{"position": "Applications Engineer", "company": "Intel Corporation", "profiles": ["Summary Applications engineering professional with 10 years of experience. Superb collaboration, product development, customer service, presentation, facilitation, and problem resolution skills. Recognized for an ability to define, support, market, and launch new technical products and services that drive results and increase market share. Specialties:• Versatile as a project team lead or team member delivering part of a solution  \n• Excellent problem solving and project organization skills  \n• Strong verbal and written communication skills  \n• Proficient in Microsoft Office Applications Suite \n• Skilled in use of Adobe FrameMaker \n• Frequent user of SharePoint and Live Meeting collaboration tools \n• Experience using Adobe Photoshop, Adobe Premiere, and Windows Movie Maker Summary Applications engineering professional with 10 years of experience. Superb collaboration, product development, customer service, presentation, facilitation, and problem resolution skills. Recognized for an ability to define, support, market, and launch new technical products and services that drive results and increase market share. Specialties:• Versatile as a project team lead or team member delivering part of a solution  \n• Excellent problem solving and project organization skills  \n• Strong verbal and written communication skills  \n• Proficient in Microsoft Office Applications Suite \n• Skilled in use of Adobe FrameMaker \n• Frequent user of SharePoint and Live Meeting collaboration tools \n• Experience using Adobe Photoshop, Adobe Premiere, and Windows Movie Maker Applications engineering professional with 10 years of experience. Superb collaboration, product development, customer service, presentation, facilitation, and problem resolution skills. Recognized for an ability to define, support, market, and launch new technical products and services that drive results and increase market share. Specialties:• Versatile as a project team lead or team member delivering part of a solution  \n• Excellent problem solving and project organization skills  \n• Strong verbal and written communication skills  \n• Proficient in Microsoft Office Applications Suite \n• Skilled in use of Adobe FrameMaker \n• Frequent user of SharePoint and Live Meeting collaboration tools \n• Experience using Adobe Photoshop, Adobe Premiere, and Windows Movie Maker Applications engineering professional with 10 years of experience. Superb collaboration, product development, customer service, presentation, facilitation, and problem resolution skills. Recognized for an ability to define, support, market, and launch new technical products and services that drive results and increase market share. Specialties:• Versatile as a project team lead or team member delivering part of a solution  \n• Excellent problem solving and project organization skills  \n• Strong verbal and written communication skills  \n• Proficient in Microsoft Office Applications Suite \n• Skilled in use of Adobe FrameMaker \n• Frequent user of SharePoint and Live Meeting collaboration tools \n• Experience using Adobe Photoshop, Adobe Premiere, and Windows Movie Maker Experience Field Applications Engineer Intel Corporation May 2011  – Present (4 years 4 months) Field Applications Engineer supporting Best Buy. Senior Platform Applications Engineer - PC Client Operations and Enabling Intel July 1999  –  May 2011  (11 years 11 months) Provide technical support and marketing input for Intel’s mobile and desktop processors from product definition through product launch and sustaining. Collaborate with product marketing, architecture, and engineering teams to define, enable, and debug new product features and technologies.  \n \n• Chair of a technical workgroup to define and approve power/thermal specifications for new products on Intel’s processor roadmap. Workgroup includes senior contributors from marketing, business development, architecture, engineering, and product quality/reliability. \n• Collaborate with marketing, architecture, and product engineering to drive approval of lower power processor products. These actions help ensure Intel’s ability to meet new Energy Star guidelines, reduce system design costs for market competitiveness, and save end users money for power costs.  \n• Drove closure of 2009 desktop platforms system power supply guidance. This effort saved customers money and time in power supply redesign. Coordinated communications of specification changes, technical implications, and presented requirements to Intel customers worldwide.  \n• Appointed as Intel Applications Engineering Platform Manager for 2007 to track division-wide product and customer issues, present status and resolution plans to management while driving closure, and ensure a successful platform launch for Intel’s customers. \n• Collaborate across Intel divisions to define technical specifications for next generation desktop processors spanning from product definition through product launch. \n• Received multiple Intel Divisional Recognition Awards for outstanding customer support and new technology enabling.  \n• Current and past author and document owner of technical datasheets for six generations of Intel desktop processors. Coordinated updates across divisions for specifications where synergies were discovered. Student Babson College 2008  –  2010  (2 years) Field Applications Engineer Intel Corporation May 2011  – Present (4 years 4 months) Field Applications Engineer supporting Best Buy. Field Applications Engineer Intel Corporation May 2011  – Present (4 years 4 months) Field Applications Engineer supporting Best Buy. Senior Platform Applications Engineer - PC Client Operations and Enabling Intel July 1999  –  May 2011  (11 years 11 months) Provide technical support and marketing input for Intel’s mobile and desktop processors from product definition through product launch and sustaining. Collaborate with product marketing, architecture, and engineering teams to define, enable, and debug new product features and technologies.  \n \n• Chair of a technical workgroup to define and approve power/thermal specifications for new products on Intel’s processor roadmap. Workgroup includes senior contributors from marketing, business development, architecture, engineering, and product quality/reliability. \n• Collaborate with marketing, architecture, and product engineering to drive approval of lower power processor products. These actions help ensure Intel’s ability to meet new Energy Star guidelines, reduce system design costs for market competitiveness, and save end users money for power costs.  \n• Drove closure of 2009 desktop platforms system power supply guidance. This effort saved customers money and time in power supply redesign. Coordinated communications of specification changes, technical implications, and presented requirements to Intel customers worldwide.  \n• Appointed as Intel Applications Engineering Platform Manager for 2007 to track division-wide product and customer issues, present status and resolution plans to management while driving closure, and ensure a successful platform launch for Intel’s customers. \n• Collaborate across Intel divisions to define technical specifications for next generation desktop processors spanning from product definition through product launch. \n• Received multiple Intel Divisional Recognition Awards for outstanding customer support and new technology enabling.  \n• Current and past author and document owner of technical datasheets for six generations of Intel desktop processors. Coordinated updates across divisions for specifications where synergies were discovered. Senior Platform Applications Engineer - PC Client Operations and Enabling Intel July 1999  –  May 2011  (11 years 11 months) Provide technical support and marketing input for Intel’s mobile and desktop processors from product definition through product launch and sustaining. Collaborate with product marketing, architecture, and engineering teams to define, enable, and debug new product features and technologies.  \n \n• Chair of a technical workgroup to define and approve power/thermal specifications for new products on Intel’s processor roadmap. Workgroup includes senior contributors from marketing, business development, architecture, engineering, and product quality/reliability. \n• Collaborate with marketing, architecture, and product engineering to drive approval of lower power processor products. These actions help ensure Intel’s ability to meet new Energy Star guidelines, reduce system design costs for market competitiveness, and save end users money for power costs.  \n• Drove closure of 2009 desktop platforms system power supply guidance. This effort saved customers money and time in power supply redesign. Coordinated communications of specification changes, technical implications, and presented requirements to Intel customers worldwide.  \n• Appointed as Intel Applications Engineering Platform Manager for 2007 to track division-wide product and customer issues, present status and resolution plans to management while driving closure, and ensure a successful platform launch for Intel’s customers. \n• Collaborate across Intel divisions to define technical specifications for next generation desktop processors spanning from product definition through product launch. \n• Received multiple Intel Divisional Recognition Awards for outstanding customer support and new technology enabling.  \n• Current and past author and document owner of technical datasheets for six generations of Intel desktop processors. Coordinated updates across divisions for specifications where synergies were discovered. Student Babson College 2008  –  2010  (2 years) Student Babson College 2008  –  2010  (2 years) Skills Product Management Semiconductors Skills  Product Management Semiconductors Product Management Semiconductors Product Management Semiconductors Education Babson College - Franklin W. Olin Graduate School of Business MBA,  Entrepreneurship 2008  – 2010 Cum Laude Activities and Societies:  Beta Gamma Sigma Iowa State University BS,  Computer Engineering 1994  – 1999 Minor: Mathematics Activities and Societies:  • Tau Beta Pi (Engineering Honor Society) - Vice President 1998\n• Eta Kappa Nu (Electrical/Computer Eng. Honor Society) - Member 1995-1999\n- Engineering Student Council Representative for one year\n• Phi Kappa Phi (All-discipline Honor Society) - Member 1996-1999 Hopkins High School Babson College - Franklin W. Olin Graduate School of Business MBA,  Entrepreneurship 2008  – 2010 Cum Laude Activities and Societies:  Beta Gamma Sigma Babson College - Franklin W. Olin Graduate School of Business MBA,  Entrepreneurship 2008  – 2010 Cum Laude Activities and Societies:  Beta Gamma Sigma Babson College - Franklin W. Olin Graduate School of Business MBA,  Entrepreneurship 2008  – 2010 Cum Laude Activities and Societies:  Beta Gamma Sigma Iowa State University BS,  Computer Engineering 1994  – 1999 Minor: Mathematics Activities and Societies:  • Tau Beta Pi (Engineering Honor Society) - Vice President 1998\n• Eta Kappa Nu (Electrical/Computer Eng. Honor Society) - Member 1995-1999\n- Engineering Student Council Representative for one year\n• Phi Kappa Phi (All-discipline Honor Society) - Member 1996-1999 Iowa State University BS,  Computer Engineering 1994  – 1999 Minor: Mathematics Activities and Societies:  • Tau Beta Pi (Engineering Honor Society) - Vice President 1998\n• Eta Kappa Nu (Electrical/Computer Eng. Honor Society) - Member 1995-1999\n- Engineering Student Council Representative for one year\n• Phi Kappa Phi (All-discipline Honor Society) - Member 1996-1999 Iowa State University BS,  Computer Engineering 1994  – 1999 Minor: Mathematics Activities and Societies:  • Tau Beta Pi (Engineering Honor Society) - Vice President 1998\n• Eta Kappa Nu (Electrical/Computer Eng. Honor Society) - Member 1995-1999\n- Engineering Student Council Representative for one year\n• Phi Kappa Phi (All-discipline Honor Society) - Member 1996-1999 Hopkins High School Hopkins High School Hopkins High School ", "Skills Product Marketing Intel Mobile Devices Semiconductors Cross-functional Team... Strategic Partnerships Go-to-market Strategy Business Alliances Product Management Marketing Strategy Semiconductor Industry Consumer Electronics Skills  Product Marketing Intel Mobile Devices Semiconductors Cross-functional Team... Strategic Partnerships Go-to-market Strategy Business Alliances Product Management Marketing Strategy Semiconductor Industry Consumer Electronics Product Marketing Intel Mobile Devices Semiconductors Cross-functional Team... Strategic Partnerships Go-to-market Strategy Business Alliances Product Management Marketing Strategy Semiconductor Industry Consumer Electronics Product Marketing Intel Mobile Devices Semiconductors Cross-functional Team... Strategic Partnerships Go-to-market Strategy Business Alliances Product Management Marketing Strategy Semiconductor Industry Consumer Electronics ", "Experience Field Applications Engineer Intel Corporation February 2001  – Present (14 years 7 months) Platform Applications Engineer Intel Corporation March 2000  –  January 2001  (11 months) Validation Engineer Intel Corporation June 1999  –  March 2000  (10 months) Field Applications Engineer Intel Corporation February 2001  – Present (14 years 7 months) Field Applications Engineer Intel Corporation February 2001  – Present (14 years 7 months) Platform Applications Engineer Intel Corporation March 2000  –  January 2001  (11 months) Platform Applications Engineer Intel Corporation March 2000  –  January 2001  (11 months) Validation Engineer Intel Corporation June 1999  –  March 2000  (10 months) Validation Engineer Intel Corporation June 1999  –  March 2000  (10 months) Skills Semiconductors Processors Intel Technical Marketing Microprocessors IC Debugging SoC ASIC Computer Architecture Hardware Architecture Skills  Semiconductors Processors Intel Technical Marketing Microprocessors IC Debugging SoC ASIC Computer Architecture Hardware Architecture Semiconductors Processors Intel Technical Marketing Microprocessors IC Debugging SoC ASIC Computer Architecture Hardware Architecture Semiconductors Processors Intel Technical Marketing Microprocessors IC Debugging SoC ASIC Computer Architecture Hardware Architecture Education University of Florida BS,  Electrical Engineering 1994  – 1999 University of Florida BS,  Electrical Engineering 1994  – 1999 University of Florida BS,  Electrical Engineering 1994  – 1999 University of Florida BS,  Electrical Engineering 1994  – 1999 ", "Skills Testing Debugging Integration Perl Cross-functional Team... Device Drivers Firmware Mobile Devices Hardware Intel Software Documentation Product Development Manufacturing Programming Storage Management Technical Support Engineering Leadership HP See 5+     See less Skills  Testing Debugging Integration Perl Cross-functional Team... Device Drivers Firmware Mobile Devices Hardware Intel Software Documentation Product Development Manufacturing Programming Storage Management Technical Support Engineering Leadership HP See 5+     See less Testing Debugging Integration Perl Cross-functional Team... Device Drivers Firmware Mobile Devices Hardware Intel Software Documentation Product Development Manufacturing Programming Storage Management Technical Support Engineering Leadership HP See 5+     See less Testing Debugging Integration Perl Cross-functional Team... Device Drivers Firmware Mobile Devices Hardware Intel Software Documentation Product Development Manufacturing Programming Storage Management Technical Support Engineering Leadership HP See 5+     See less ", "Languages Greek, Ancient (to 1453) Hebrew Greek, Ancient (to 1453) Hebrew Greek, Ancient (to 1453) Hebrew Skills Network Processors DSL GPON Customer Support Project Management Semiconductors SoC IC ASIC Analog Hardware Architecture Mixed Signal Semiconductor Industry Firmware Embedded Systems Debugging Circuit Design Integrated Circuit... Microcontrollers PCB design RTOS Logic Analyzer Processors See 8+     See less Skills  Network Processors DSL GPON Customer Support Project Management Semiconductors SoC IC ASIC Analog Hardware Architecture Mixed Signal Semiconductor Industry Firmware Embedded Systems Debugging Circuit Design Integrated Circuit... Microcontrollers PCB design RTOS Logic Analyzer Processors See 8+     See less Network Processors DSL GPON Customer Support Project Management Semiconductors SoC IC ASIC Analog Hardware Architecture Mixed Signal Semiconductor Industry Firmware Embedded Systems Debugging Circuit Design Integrated Circuit... Microcontrollers PCB design RTOS Logic Analyzer Processors See 8+     See less Network Processors DSL GPON Customer Support Project Management Semiconductors SoC IC ASIC Analog Hardware Architecture Mixed Signal Semiconductor Industry Firmware Embedded Systems Debugging Circuit Design Integrated Circuit... Microcontrollers PCB design RTOS Logic Analyzer Processors See 8+     See less ", "Experience Platform Applications Engineer Intel Corporation February 2013  – Present (2 years 7 months) Applications Engineer Intel Corporation March 2005  –  February 2013  (8 years) Platform Applications Engineer Intel Corporation February 2013  – Present (2 years 7 months) Platform Applications Engineer Intel Corporation February 2013  – Present (2 years 7 months) Applications Engineer Intel Corporation March 2005  –  February 2013  (8 years) Applications Engineer Intel Corporation March 2005  –  February 2013  (8 years) Skills Semiconductors Processors Debugging Embedded Systems Device Drivers Intel Computer Architecture Software Engineering Software Development Product Marketing System Architecture Multithreading High Performance... Firmware Perl Product Management Program Management Cloud Computing See 3+     See less Skills  Semiconductors Processors Debugging Embedded Systems Device Drivers Intel Computer Architecture Software Engineering Software Development Product Marketing System Architecture Multithreading High Performance... Firmware Perl Product Management Program Management Cloud Computing See 3+     See less Semiconductors Processors Debugging Embedded Systems Device Drivers Intel Computer Architecture Software Engineering Software Development Product Marketing System Architecture Multithreading High Performance... Firmware Perl Product Management Program Management Cloud Computing See 3+     See less Semiconductors Processors Debugging Embedded Systems Device Drivers Intel Computer Architecture Software Engineering Software Development Product Marketing System Architecture Multithreading High Performance... Firmware Perl Product Management Program Management Cloud Computing See 3+     See less ", "Summary I currently work as an Applications engineer for Intel Corporation after holding a similar position at Avago/LSI. I have an M.S. in Electrical Engineering with an Analog Design concentration from Santa Clara University and received my B.S. in Electrical Engineering from the University of California Santa Barbara. \n \nMy main responsibilities consist of customer support, hardware testing, and some circuit simulation. Customer issues are debugged either on site or remotely. Hardware testing done mostly in lab on test chips using available lab equipment. Some simulation to silicon correlation comparing simulated link performance to actual silicon performance. Summary I currently work as an Applications engineer for Intel Corporation after holding a similar position at Avago/LSI. I have an M.S. in Electrical Engineering with an Analog Design concentration from Santa Clara University and received my B.S. in Electrical Engineering from the University of California Santa Barbara. \n \nMy main responsibilities consist of customer support, hardware testing, and some circuit simulation. Customer issues are debugged either on site or remotely. Hardware testing done mostly in lab on test chips using available lab equipment. Some simulation to silicon correlation comparing simulated link performance to actual silicon performance. I currently work as an Applications engineer for Intel Corporation after holding a similar position at Avago/LSI. I have an M.S. in Electrical Engineering with an Analog Design concentration from Santa Clara University and received my B.S. in Electrical Engineering from the University of California Santa Barbara. \n \nMy main responsibilities consist of customer support, hardware testing, and some circuit simulation. Customer issues are debugged either on site or remotely. Hardware testing done mostly in lab on test chips using available lab equipment. Some simulation to silicon correlation comparing simulated link performance to actual silicon performance. I currently work as an Applications engineer for Intel Corporation after holding a similar position at Avago/LSI. I have an M.S. in Electrical Engineering with an Analog Design concentration from Santa Clara University and received my B.S. in Electrical Engineering from the University of California Santa Barbara. \n \nMy main responsibilities consist of customer support, hardware testing, and some circuit simulation. Customer issues are debugged either on site or remotely. Hardware testing done mostly in lab on test chips using available lab equipment. Some simulation to silicon correlation comparing simulated link performance to actual silicon performance. Experience Applications Engineer Intel Corporation November 2014  – Present (10 months) Testing, debugging, and review of customer's networking SerDes. PCIe, Ethernet, USB, 10G-KR, and other various standards. Some channel simulation with most testing being done hands-on in the lab using bench equipment. Senior SerDes Applications/Validation Engineer LSI Corporation January 2012  –  November 2014  (2 years 11 months) San Jose, CA Bench testing and simulation of customer hardware applications. I'm responsible for delivering and supporting our products within customer systems. Circuit debug, hardware and software support, data processing, and discussion of customer issues. I also provide internal support and run bench validation tests of SerDes test chips. Equipment used includes BERTscopes, oscilloscopes, power supplies, temperature controllers, and various backplanes. Software primarily in Python with data collected and processed in Excel. Hardware Validation Engineer LSI Corporation December 2010  –  January 2012  (1 year 2 months) SerDes Validation lab testing chips to see if they meet standard specifications. Receiver jitter tolerance, transmitter amplitude, PLL functionality, etc. characterized running automated tests via Python scripts. Product Support Engineer One Touch Systems January 2006  –  December 2010  (5 years) - Developed and maintained lab facilities to emulate customers’ network environments and resolved issues reported via email and phone support lines. \n- Troubleshooting of software, hardware products installed in IP/satellite networks. \n- Analysis & troubleshooting of SQL & MS Access type databases. \n- Windows Server 2000/2003 & IIS configuration. \n- Coordinated with Business Development Managers and Account Executives to help facilitate the installation, upgrade of new products at customer locations. \n- Deliver product training at customer facilities and internally to sales group. Computer Operator · UCSB North Hall February 2005  –  August 2005  (7 months) · Network printer maintenance, help desk, server support, magnetic tape backup Computer Tech Student Assistant · UCSB Donald Bren July 2004  –  February 2005  (8 months) · Windows XP troubleshooting, help desk via Request Tracker, Network Maintenance, imaging, hardware/software support, customer support via email, phone, or in person Education Database Programmer · UCSB Gevirtz School May 2004  –  July 2004  (3 months) Education Student Database with scripts using Filemaker Pro Applications Engineer Intel Corporation November 2014  – Present (10 months) Testing, debugging, and review of customer's networking SerDes. PCIe, Ethernet, USB, 10G-KR, and other various standards. Some channel simulation with most testing being done hands-on in the lab using bench equipment. Applications Engineer Intel Corporation November 2014  – Present (10 months) Testing, debugging, and review of customer's networking SerDes. PCIe, Ethernet, USB, 10G-KR, and other various standards. Some channel simulation with most testing being done hands-on in the lab using bench equipment. Senior SerDes Applications/Validation Engineer LSI Corporation January 2012  –  November 2014  (2 years 11 months) San Jose, CA Bench testing and simulation of customer hardware applications. I'm responsible for delivering and supporting our products within customer systems. Circuit debug, hardware and software support, data processing, and discussion of customer issues. I also provide internal support and run bench validation tests of SerDes test chips. Equipment used includes BERTscopes, oscilloscopes, power supplies, temperature controllers, and various backplanes. Software primarily in Python with data collected and processed in Excel. Senior SerDes Applications/Validation Engineer LSI Corporation January 2012  –  November 2014  (2 years 11 months) San Jose, CA Bench testing and simulation of customer hardware applications. I'm responsible for delivering and supporting our products within customer systems. Circuit debug, hardware and software support, data processing, and discussion of customer issues. I also provide internal support and run bench validation tests of SerDes test chips. Equipment used includes BERTscopes, oscilloscopes, power supplies, temperature controllers, and various backplanes. Software primarily in Python with data collected and processed in Excel. Hardware Validation Engineer LSI Corporation December 2010  –  January 2012  (1 year 2 months) SerDes Validation lab testing chips to see if they meet standard specifications. Receiver jitter tolerance, transmitter amplitude, PLL functionality, etc. characterized running automated tests via Python scripts. Hardware Validation Engineer LSI Corporation December 2010  –  January 2012  (1 year 2 months) SerDes Validation lab testing chips to see if they meet standard specifications. Receiver jitter tolerance, transmitter amplitude, PLL functionality, etc. characterized running automated tests via Python scripts. Product Support Engineer One Touch Systems January 2006  –  December 2010  (5 years) - Developed and maintained lab facilities to emulate customers’ network environments and resolved issues reported via email and phone support lines. \n- Troubleshooting of software, hardware products installed in IP/satellite networks. \n- Analysis & troubleshooting of SQL & MS Access type databases. \n- Windows Server 2000/2003 & IIS configuration. \n- Coordinated with Business Development Managers and Account Executives to help facilitate the installation, upgrade of new products at customer locations. \n- Deliver product training at customer facilities and internally to sales group. Product Support Engineer One Touch Systems January 2006  –  December 2010  (5 years) - Developed and maintained lab facilities to emulate customers’ network environments and resolved issues reported via email and phone support lines. \n- Troubleshooting of software, hardware products installed in IP/satellite networks. \n- Analysis & troubleshooting of SQL & MS Access type databases. \n- Windows Server 2000/2003 & IIS configuration. \n- Coordinated with Business Development Managers and Account Executives to help facilitate the installation, upgrade of new products at customer locations. \n- Deliver product training at customer facilities and internally to sales group. Computer Operator · UCSB North Hall February 2005  –  August 2005  (7 months) · Network printer maintenance, help desk, server support, magnetic tape backup Computer Operator · UCSB North Hall February 2005  –  August 2005  (7 months) · Network printer maintenance, help desk, server support, magnetic tape backup Computer Tech Student Assistant · UCSB Donald Bren July 2004  –  February 2005  (8 months) · Windows XP troubleshooting, help desk via Request Tracker, Network Maintenance, imaging, hardware/software support, customer support via email, phone, or in person Computer Tech Student Assistant · UCSB Donald Bren July 2004  –  February 2005  (8 months) · Windows XP troubleshooting, help desk via Request Tracker, Network Maintenance, imaging, hardware/software support, customer support via email, phone, or in person Education Database Programmer · UCSB Gevirtz School May 2004  –  July 2004  (3 months) Education Student Database with scripts using Filemaker Pro Education Database Programmer · UCSB Gevirtz School May 2004  –  July 2004  (3 months) Education Student Database with scripts using Filemaker Pro Languages Spanish Elementary proficiency Spanish Elementary proficiency Spanish Elementary proficiency Elementary proficiency Skills Unix Networking Verilog Troubleshooting Windows Server Testing Linux Hardware Semiconductors Analog Circuit Design Product Development Product Management Technical Support C Network Administration Analog Python Debugging See 3+     See less Skills  Unix Networking Verilog Troubleshooting Windows Server Testing Linux Hardware Semiconductors Analog Circuit Design Product Development Product Management Technical Support C Network Administration Analog Python Debugging See 3+     See less Unix Networking Verilog Troubleshooting Windows Server Testing Linux Hardware Semiconductors Analog Circuit Design Product Development Product Management Technical Support C Network Administration Analog Python Debugging See 3+     See less Unix Networking Verilog Troubleshooting Windows Server Testing Linux Hardware Semiconductors Analog Circuit Design Product Development Product Management Technical Support C Network Administration Analog Python Debugging See 3+     See less Education Santa Clara University Master of Science,  Electrical Engineering 2006  – 2010 Subjects studied: semiconductor physics, Power IC design, network circuit analysis, data communications, digital logic and synthesis, analog circuit analysis and design, VLSI layout. \n \nProjects include: ADC to DAC circuit, various digital logic simulations, transmitter and receiver architecture, and a PLL design University of California, Santa Barbara Bachelor of Science,  Electrical Engineering 2001  – 2005 · Subjects studied: C, Assembly, Analog and Digital Circuit Analysis, Solid State Physics, Field Theory, CMOS VLSI design, Advanced Prob. And Statistics, Signal Analysis in Continuous and Discrete time with Linear Algebra apps, Transistor Amplification, High Frequency Circuits, Quantum Physics, UNIX, Computer Architecture, Network Theory/Programming, Robot Control Systems, Circuit Layout and Simulation, SPICE, Verilog, Nonlinear Phenomena Bellarmine College Preparatory High School Diploma 1997  – 2001 Activities and Societies:  Varsity Swimming and Water Polo ,  gaming club ,  ceramics club Santa Clara University Master of Science,  Electrical Engineering 2006  – 2010 Subjects studied: semiconductor physics, Power IC design, network circuit analysis, data communications, digital logic and synthesis, analog circuit analysis and design, VLSI layout. \n \nProjects include: ADC to DAC circuit, various digital logic simulations, transmitter and receiver architecture, and a PLL design Santa Clara University Master of Science,  Electrical Engineering 2006  – 2010 Subjects studied: semiconductor physics, Power IC design, network circuit analysis, data communications, digital logic and synthesis, analog circuit analysis and design, VLSI layout. \n \nProjects include: ADC to DAC circuit, various digital logic simulations, transmitter and receiver architecture, and a PLL design Santa Clara University Master of Science,  Electrical Engineering 2006  – 2010 Subjects studied: semiconductor physics, Power IC design, network circuit analysis, data communications, digital logic and synthesis, analog circuit analysis and design, VLSI layout. \n \nProjects include: ADC to DAC circuit, various digital logic simulations, transmitter and receiver architecture, and a PLL design University of California, Santa Barbara Bachelor of Science,  Electrical Engineering 2001  – 2005 · Subjects studied: C, Assembly, Analog and Digital Circuit Analysis, Solid State Physics, Field Theory, CMOS VLSI design, Advanced Prob. And Statistics, Signal Analysis in Continuous and Discrete time with Linear Algebra apps, Transistor Amplification, High Frequency Circuits, Quantum Physics, UNIX, Computer Architecture, Network Theory/Programming, Robot Control Systems, Circuit Layout and Simulation, SPICE, Verilog, Nonlinear Phenomena University of California, Santa Barbara Bachelor of Science,  Electrical Engineering 2001  – 2005 · Subjects studied: C, Assembly, Analog and Digital Circuit Analysis, Solid State Physics, Field Theory, CMOS VLSI design, Advanced Prob. And Statistics, Signal Analysis in Continuous and Discrete time with Linear Algebra apps, Transistor Amplification, High Frequency Circuits, Quantum Physics, UNIX, Computer Architecture, Network Theory/Programming, Robot Control Systems, Circuit Layout and Simulation, SPICE, Verilog, Nonlinear Phenomena University of California, Santa Barbara Bachelor of Science,  Electrical Engineering 2001  – 2005 · Subjects studied: C, Assembly, Analog and Digital Circuit Analysis, Solid State Physics, Field Theory, CMOS VLSI design, Advanced Prob. And Statistics, Signal Analysis in Continuous and Discrete time with Linear Algebra apps, Transistor Amplification, High Frequency Circuits, Quantum Physics, UNIX, Computer Architecture, Network Theory/Programming, Robot Control Systems, Circuit Layout and Simulation, SPICE, Verilog, Nonlinear Phenomena Bellarmine College Preparatory High School Diploma 1997  – 2001 Activities and Societies:  Varsity Swimming and Water Polo ,  gaming club ,  ceramics club Bellarmine College Preparatory High School Diploma 1997  – 2001 Activities and Societies:  Varsity Swimming and Water Polo ,  gaming club ,  ceramics club Bellarmine College Preparatory High School Diploma 1997  – 2001 Activities and Societies:  Varsity Swimming and Water Polo ,  gaming club ,  ceramics club ", "Skills Semiconductors Embedded Systems Technical Marketing High Performance... Cloud Computing Storage Hardware Unix Product Marketing System Architecture Device Drivers Operating Systems Debugging Intel Pre-sales Processors Computer Architecture ASIC Server Architecture Enterprise Architecture See 5+     See less Skills  Semiconductors Embedded Systems Technical Marketing High Performance... Cloud Computing Storage Hardware Unix Product Marketing System Architecture Device Drivers Operating Systems Debugging Intel Pre-sales Processors Computer Architecture ASIC Server Architecture Enterprise Architecture See 5+     See less Semiconductors Embedded Systems Technical Marketing High Performance... Cloud Computing Storage Hardware Unix Product Marketing System Architecture Device Drivers Operating Systems Debugging Intel Pre-sales Processors Computer Architecture ASIC Server Architecture Enterprise Architecture See 5+     See less Semiconductors Embedded Systems Technical Marketing High Performance... Cloud Computing Storage Hardware Unix Product Marketing System Architecture Device Drivers Operating Systems Debugging Intel Pre-sales Processors Computer Architecture ASIC Server Architecture Enterprise Architecture See 5+     See less ", "Experience HW Engineer/Platform Applications Engineer Intel Corporation August 2015  – Present (1 month) Hillsboro, OR HW Design and Applications Engineer for Android Tablet and Phones. HW Design Engineer, Customer Platform Technology Development Intel Corporation August 2013  –  July 2015  (2 years) Portland, Oregon Area Wearable Technology development; IoT HW; Galileo HW Development; PCB technology HW Platform Applications Engineer Intel Corporation April 2010  –  August 2013  (3 years 5 months) Applications Engineer for Intel Digital Home Group, supporting customer designs for Consumer Electronics, such as Blue-Ray, Set-top boxes for cable & satellite, Digital Home Gateway. Platform Applications Engineer Intel Corporation January 2006  –  April 2010  (4 years 4 months) Platform Applications engineer in Intel's Embedded Communications Group (ECG), supporting custom embedded server designs using Intel Xeon Processors & Chipsets. Power Systems Engineer General Dynamics C4 Systems January 2005  –  January 2006  (1 year 1 month) Electrical Power Systems (EPS) Engineer, worked on power system telemetry board, FPGA design. Systems Engineer/ Platform Design Intel March 1998  –  January 2005  (6 years 11 months) Platform Design Engineer for Intel Architecture (IA) and XScale-based platforms, consisting of board-level design, PCB layout, platform mechanical design, and FPGA design. Test Engineer Intern Advanced Hardware Architectures (AHA) May 1996  –  December 1997  (1 year 8 months) AT3- Aviation Electronics Technician US Navy August 1990  –  August 1992  (2 years 1 month) Electronics tech supporting S3 Viking aircraft. Honorably discharged in 1992 to NROTC at University of Idaho. HW Engineer/Platform Applications Engineer Intel Corporation August 2015  – Present (1 month) Hillsboro, OR HW Design and Applications Engineer for Android Tablet and Phones. HW Engineer/Platform Applications Engineer Intel Corporation August 2015  – Present (1 month) Hillsboro, OR HW Design and Applications Engineer for Android Tablet and Phones. HW Design Engineer, Customer Platform Technology Development Intel Corporation August 2013  –  July 2015  (2 years) Portland, Oregon Area Wearable Technology development; IoT HW; Galileo HW Development; PCB technology HW Design Engineer, Customer Platform Technology Development Intel Corporation August 2013  –  July 2015  (2 years) Portland, Oregon Area Wearable Technology development; IoT HW; Galileo HW Development; PCB technology HW Platform Applications Engineer Intel Corporation April 2010  –  August 2013  (3 years 5 months) Applications Engineer for Intel Digital Home Group, supporting customer designs for Consumer Electronics, such as Blue-Ray, Set-top boxes for cable & satellite, Digital Home Gateway. HW Platform Applications Engineer Intel Corporation April 2010  –  August 2013  (3 years 5 months) Applications Engineer for Intel Digital Home Group, supporting customer designs for Consumer Electronics, such as Blue-Ray, Set-top boxes for cable & satellite, Digital Home Gateway. Platform Applications Engineer Intel Corporation January 2006  –  April 2010  (4 years 4 months) Platform Applications engineer in Intel's Embedded Communications Group (ECG), supporting custom embedded server designs using Intel Xeon Processors & Chipsets. Platform Applications Engineer Intel Corporation January 2006  –  April 2010  (4 years 4 months) Platform Applications engineer in Intel's Embedded Communications Group (ECG), supporting custom embedded server designs using Intel Xeon Processors & Chipsets. Power Systems Engineer General Dynamics C4 Systems January 2005  –  January 2006  (1 year 1 month) Electrical Power Systems (EPS) Engineer, worked on power system telemetry board, FPGA design. Power Systems Engineer General Dynamics C4 Systems January 2005  –  January 2006  (1 year 1 month) Electrical Power Systems (EPS) Engineer, worked on power system telemetry board, FPGA design. Systems Engineer/ Platform Design Intel March 1998  –  January 2005  (6 years 11 months) Platform Design Engineer for Intel Architecture (IA) and XScale-based platforms, consisting of board-level design, PCB layout, platform mechanical design, and FPGA design. Systems Engineer/ Platform Design Intel March 1998  –  January 2005  (6 years 11 months) Platform Design Engineer for Intel Architecture (IA) and XScale-based platforms, consisting of board-level design, PCB layout, platform mechanical design, and FPGA design. Test Engineer Intern Advanced Hardware Architectures (AHA) May 1996  –  December 1997  (1 year 8 months) Test Engineer Intern Advanced Hardware Architectures (AHA) May 1996  –  December 1997  (1 year 8 months) AT3- Aviation Electronics Technician US Navy August 1990  –  August 1992  (2 years 1 month) Electronics tech supporting S3 Viking aircraft. Honorably discharged in 1992 to NROTC at University of Idaho. AT3- Aviation Electronics Technician US Navy August 1990  –  August 1992  (2 years 1 month) Electronics tech supporting S3 Viking aircraft. Honorably discharged in 1992 to NROTC at University of Idaho. Skills Embedded Systems FPGA Processors Debugging PCB design Intel Verilog Hardware Architecture Firmware Hardware Electrical Engineering Electronics Microprocessors Testing ASIC Hardware Design PCIe SoC Circuit Design System Design VHDL ModelSim IOT Wearable Computing Semiconductors PCB Design See 11+     See less Skills  Embedded Systems FPGA Processors Debugging PCB design Intel Verilog Hardware Architecture Firmware Hardware Electrical Engineering Electronics Microprocessors Testing ASIC Hardware Design PCIe SoC Circuit Design System Design VHDL ModelSim IOT Wearable Computing Semiconductors PCB Design See 11+     See less Embedded Systems FPGA Processors Debugging PCB design Intel Verilog Hardware Architecture Firmware Hardware Electrical Engineering Electronics Microprocessors Testing ASIC Hardware Design PCIe SoC Circuit Design System Design VHDL ModelSim IOT Wearable Computing Semiconductors PCB Design See 11+     See less Embedded Systems FPGA Processors Debugging PCB design Intel Verilog Hardware Architecture Firmware Hardware Electrical Engineering Electronics Microprocessors Testing ASIC Hardware Design PCIe SoC Circuit Design System Design VHDL ModelSim IOT Wearable Computing Semiconductors PCB Design See 11+     See less Education University of Idaho BSEE,  Electrical and Electronics Engineering 1992  – 1997 University of Idaho BSEE,  Electrical and Electronics Engineering 1992  – 1997 University of Idaho BSEE,  Electrical and Electronics Engineering 1992  – 1997 University of Idaho BSEE,  Electrical and Electronics Engineering 1992  – 1997 ", "Skills Cadence CAD IC Microprocessors AutoCAD Layout Semiconductors Circuit Design Packaging Design for Manufacturing Mentor Expedition Analog Skills  Cadence CAD IC Microprocessors AutoCAD Layout Semiconductors Circuit Design Packaging Design for Manufacturing Mentor Expedition Analog Cadence CAD IC Microprocessors AutoCAD Layout Semiconductors Circuit Design Packaging Design for Manufacturing Mentor Expedition Analog Cadence CAD IC Microprocessors AutoCAD Layout Semiconductors Circuit Design Packaging Design for Manufacturing Mentor Expedition Analog ", "Skills Semiconductors Skills  Semiconductors Semiconductors Semiconductors ", "Skills Mobile Devices Strategy Intel Wireless Marketing Semiconductors Product Management Go-to-market Strategy Product Marketing Processors Semiconductor Industry Electronics Skills  Mobile Devices Strategy Intel Wireless Marketing Semiconductors Product Management Go-to-market Strategy Product Marketing Processors Semiconductor Industry Electronics Mobile Devices Strategy Intel Wireless Marketing Semiconductors Product Management Go-to-market Strategy Product Marketing Processors Semiconductor Industry Electronics Mobile Devices Strategy Intel Wireless Marketing Semiconductors Product Management Go-to-market Strategy Product Marketing Processors Semiconductor Industry Electronics ", "Skills SoC Semiconductors ASIC IC Product Management FPGA Debugging Embedded Systems Hardware Architecture Mixed Signal Firmware Digital Signal... EDA Embedded Software RTL Design Skills  SoC Semiconductors ASIC IC Product Management FPGA Debugging Embedded Systems Hardware Architecture Mixed Signal Firmware Digital Signal... EDA Embedded Software RTL Design SoC Semiconductors ASIC IC Product Management FPGA Debugging Embedded Systems Hardware Architecture Mixed Signal Firmware Digital Signal... EDA Embedded Software RTL Design SoC Semiconductors ASIC IC Product Management FPGA Debugging Embedded Systems Hardware Architecture Mixed Signal Firmware Digital Signal... EDA Embedded Software RTL Design ", "Skills Intel Embedded Systems Hardware Processors Skills  Intel Embedded Systems Hardware Processors Intel Embedded Systems Hardware Processors Intel Embedded Systems Hardware Processors ", "Experience Field Applications Engineer Intel Corporation 2015  – Present (less than a year) Taipei City, Taiwan Assistant Winemaker / Winery Operations Milagro Vineyards & Winery 2010  –  2014  (4 years) Albuquerque, New Mexico Area Vineyards: manage field crews with respect to planting, pruning, watering, fertilizing, vine training & harvest \nWinery: responsible for crush & fermentation, barrel aging regimen, blending, bottling, labeling \nSales & Marketing: operate tasting room, manage wholesale accounts, maintain website and develop customer marketing communications. Field Applications Engineer Intel Corporation 2004  –  2010  (6 years) Austin, Texas Area Lead time to market OEM engineering development for Corp Clients, uni-processor & dual-processor servers through a multi-year development cycle. \n-- Design Win & Product definition, hardware & software features \n-- Pre-production silicon validation, Alpha & Beta software validation (drivers, BIOS, firmware) \n-- Embedded controller & firmware definition, enabling and development Platform Applications Engineer Intel Corporation 2000  –  2004  (4 years) Folsom, CA -- Evaluate and enable PCB manufacturing capabilities as it pertained to HVM in the desktop PC market segment. \n-- Design prototype reference motherboards and related engineering design collateral. \n-- Customer support for all Tier 1 (MNC OEMs and ODM) mother board designs for new chipsets & processors. \n-- Platform cost reduction design activities through experimental motherboard designs to reduce layer count and component cost. Field Applications Engineer Intel Corporation 2015  – Present (less than a year) Taipei City, Taiwan Field Applications Engineer Intel Corporation 2015  – Present (less than a year) Taipei City, Taiwan Assistant Winemaker / Winery Operations Milagro Vineyards & Winery 2010  –  2014  (4 years) Albuquerque, New Mexico Area Vineyards: manage field crews with respect to planting, pruning, watering, fertilizing, vine training & harvest \nWinery: responsible for crush & fermentation, barrel aging regimen, blending, bottling, labeling \nSales & Marketing: operate tasting room, manage wholesale accounts, maintain website and develop customer marketing communications. Assistant Winemaker / Winery Operations Milagro Vineyards & Winery 2010  –  2014  (4 years) Albuquerque, New Mexico Area Vineyards: manage field crews with respect to planting, pruning, watering, fertilizing, vine training & harvest \nWinery: responsible for crush & fermentation, barrel aging regimen, blending, bottling, labeling \nSales & Marketing: operate tasting room, manage wholesale accounts, maintain website and develop customer marketing communications. Field Applications Engineer Intel Corporation 2004  –  2010  (6 years) Austin, Texas Area Lead time to market OEM engineering development for Corp Clients, uni-processor & dual-processor servers through a multi-year development cycle. \n-- Design Win & Product definition, hardware & software features \n-- Pre-production silicon validation, Alpha & Beta software validation (drivers, BIOS, firmware) \n-- Embedded controller & firmware definition, enabling and development Field Applications Engineer Intel Corporation 2004  –  2010  (6 years) Austin, Texas Area Lead time to market OEM engineering development for Corp Clients, uni-processor & dual-processor servers through a multi-year development cycle. \n-- Design Win & Product definition, hardware & software features \n-- Pre-production silicon validation, Alpha & Beta software validation (drivers, BIOS, firmware) \n-- Embedded controller & firmware definition, enabling and development Platform Applications Engineer Intel Corporation 2000  –  2004  (4 years) Folsom, CA -- Evaluate and enable PCB manufacturing capabilities as it pertained to HVM in the desktop PC market segment. \n-- Design prototype reference motherboards and related engineering design collateral. \n-- Customer support for all Tier 1 (MNC OEMs and ODM) mother board designs for new chipsets & processors. \n-- Platform cost reduction design activities through experimental motherboard designs to reduce layer count and component cost. Platform Applications Engineer Intel Corporation 2000  –  2004  (4 years) Folsom, CA -- Evaluate and enable PCB manufacturing capabilities as it pertained to HVM in the desktop PC market segment. \n-- Design prototype reference motherboards and related engineering design collateral. \n-- Customer support for all Tier 1 (MNC OEMs and ODM) mother board designs for new chipsets & processors. \n-- Platform cost reduction design activities through experimental motherboard designs to reduce layer count and component cost. Skills Embedded Systems Semiconductors Computer Architecture Viticulture Engineering Management Product Management Oenology Small Business Motherboards PCB design Strategic Planning Marketing Strategy Manufacturing Skills  Embedded Systems Semiconductors Computer Architecture Viticulture Engineering Management Product Management Oenology Small Business Motherboards PCB design Strategic Planning Marketing Strategy Manufacturing Embedded Systems Semiconductors Computer Architecture Viticulture Engineering Management Product Management Oenology Small Business Motherboards PCB design Strategic Planning Marketing Strategy Manufacturing Embedded Systems Semiconductors Computer Architecture Viticulture Engineering Management Product Management Oenology Small Business Motherboards PCB design Strategic Planning Marketing Strategy Manufacturing Education New Mexico State University BS,  Electrical Engineering 1997  – 2000 New Mexico State University BS,  Electrical Engineering 1997  – 2000 New Mexico State University BS,  Electrical Engineering 1997  – 2000 New Mexico State University BS,  Electrical Engineering 1997  – 2000 ", "Languages English Czech Slovak Russian English Czech Slovak Russian English Czech Slovak Russian Skills ARM Embedded Systems Electronics Microprocessors Semiconductors Analog Hardware Wireless Hardware Architecture PCB design Embedded Software SoC Intel X86 EMS Semiconductor Industry IC Defence Mission Critical Healthcare Information... CPU design Firmware USB PCIe Signal Integrity Sales Mixed Signal EDA Processors PCB Design See 15+     See less Skills  ARM Embedded Systems Electronics Microprocessors Semiconductors Analog Hardware Wireless Hardware Architecture PCB design Embedded Software SoC Intel X86 EMS Semiconductor Industry IC Defence Mission Critical Healthcare Information... CPU design Firmware USB PCIe Signal Integrity Sales Mixed Signal EDA Processors PCB Design See 15+     See less ARM Embedded Systems Electronics Microprocessors Semiconductors Analog Hardware Wireless Hardware Architecture PCB design Embedded Software SoC Intel X86 EMS Semiconductor Industry IC Defence Mission Critical Healthcare Information... CPU design Firmware USB PCIe Signal Integrity Sales Mixed Signal EDA Processors PCB Design See 15+     See less ARM Embedded Systems Electronics Microprocessors Semiconductors Analog Hardware Wireless Hardware Architecture PCB design Embedded Software SoC Intel X86 EMS Semiconductor Industry IC Defence Mission Critical Healthcare Information... CPU design Firmware USB PCIe Signal Integrity Sales Mixed Signal EDA Processors PCB Design See 15+     See less Honors & Awards Intel EMEA Recognition Award Intel Corporation UK (Ltd) July 2009 First embedded Nehalem Xeon-EP design in Europe. Intel EMEA Recognition Award Intel Corporation June 2010 Strategic Consumer Electronic Design Win in Italy Intel EMEA Recognition Award Intel Corporation UK (Ltd) July 2009 First embedded Nehalem Xeon-EP design in Europe. Intel EMEA Recognition Award Intel Corporation UK (Ltd) July 2009 First embedded Nehalem Xeon-EP design in Europe. Intel EMEA Recognition Award Intel Corporation UK (Ltd) July 2009 First embedded Nehalem Xeon-EP design in Europe. Intel EMEA Recognition Award Intel Corporation June 2010 Strategic Consumer Electronic Design Win in Italy Intel EMEA Recognition Award Intel Corporation June 2010 Strategic Consumer Electronic Design Win in Italy Intel EMEA Recognition Award Intel Corporation June 2010 Strategic Consumer Electronic Design Win in Italy ", "Skills Embedded Systems Wireless Semiconductors Product Marketing Virtualization Servers Mobile Technology Systems Engineering Intel Microprocessors Hardware Architecture Debugging Processors IC Hardware Computer Architecture Electronics Integration Product Engineering SoC See 5+     See less Skills  Embedded Systems Wireless Semiconductors Product Marketing Virtualization Servers Mobile Technology Systems Engineering Intel Microprocessors Hardware Architecture Debugging Processors IC Hardware Computer Architecture Electronics Integration Product Engineering SoC See 5+     See less Embedded Systems Wireless Semiconductors Product Marketing Virtualization Servers Mobile Technology Systems Engineering Intel Microprocessors Hardware Architecture Debugging Processors IC Hardware Computer Architecture Electronics Integration Product Engineering SoC See 5+     See less Embedded Systems Wireless Semiconductors Product Marketing Virtualization Servers Mobile Technology Systems Engineering Intel Microprocessors Hardware Architecture Debugging Processors IC Hardware Computer Architecture Electronics Integration Product Engineering SoC See 5+     See less ", "Skills Intel Processors Skills  Intel Processors Intel Processors Intel Processors ", "Skills Embedded Systems Microprocessors Security Hardware Semiconductors Low-power Design VLSI SoC Processors Intel Product Management Skills  Embedded Systems Microprocessors Security Hardware Semiconductors Low-power Design VLSI SoC Processors Intel Product Management Embedded Systems Microprocessors Security Hardware Semiconductors Low-power Design VLSI SoC Processors Intel Product Management Embedded Systems Microprocessors Security Hardware Semiconductors Low-power Design VLSI SoC Processors Intel Product Management Education University of Southern California MS 2006  – 2007 Manipal University BE 1998  – 2002 University of Southern California MS 2006  – 2007 University of Southern California MS 2006  – 2007 University of Southern California MS 2006  – 2007 Manipal University BE 1998  – 2002 Manipal University BE 1998  – 2002 Manipal University BE 1998  – 2002 ", "Skills Servers EDA Intel Algorithms Enterprise Software Management Computer Security Debugging Firmware SoC Security Semiconductors Bios Processors Manufacturing X86 See 1+     See less Skills  Servers EDA Intel Algorithms Enterprise Software Management Computer Security Debugging Firmware SoC Security Semiconductors Bios Processors Manufacturing X86 See 1+     See less Servers EDA Intel Algorithms Enterprise Software Management Computer Security Debugging Firmware SoC Security Semiconductors Bios Processors Manufacturing X86 See 1+     See less Servers EDA Intel Algorithms Enterprise Software Management Computer Security Debugging Firmware SoC Security Semiconductors Bios Processors Manufacturing X86 See 1+     See less "]}