{"position": "Assistant Director", "company": "Stanford University", "profiles": ["Summary Arts & Crafts Specialties: Applique Embroidery, Crewel Embroidery, Counted Cross-Stitch Embroidery, Needlepoint Canvas Embroidery, Silk Shading Embroidery, Gold Work Embroidery, Knitting, Sewing \n \nHigher Education Management Specialties: Higher Education Administration, Business School Administration, Operations Management, Program Planning, Organizational Development, Organizational Change Management, Academic Library Management, Facilities Management, Space Planning and Space Management, Writing and Editing, Nonprofit Management, Not-for-Profit Management Summary Arts & Crafts Specialties: Applique Embroidery, Crewel Embroidery, Counted Cross-Stitch Embroidery, Needlepoint Canvas Embroidery, Silk Shading Embroidery, Gold Work Embroidery, Knitting, Sewing \n \nHigher Education Management Specialties: Higher Education Administration, Business School Administration, Operations Management, Program Planning, Organizational Development, Organizational Change Management, Academic Library Management, Facilities Management, Space Planning and Space Management, Writing and Editing, Nonprofit Management, Not-for-Profit Management Arts & Crafts Specialties: Applique Embroidery, Crewel Embroidery, Counted Cross-Stitch Embroidery, Needlepoint Canvas Embroidery, Silk Shading Embroidery, Gold Work Embroidery, Knitting, Sewing \n \nHigher Education Management Specialties: Higher Education Administration, Business School Administration, Operations Management, Program Planning, Organizational Development, Organizational Change Management, Academic Library Management, Facilities Management, Space Planning and Space Management, Writing and Editing, Nonprofit Management, Not-for-Profit Management Arts & Crafts Specialties: Applique Embroidery, Crewel Embroidery, Counted Cross-Stitch Embroidery, Needlepoint Canvas Embroidery, Silk Shading Embroidery, Gold Work Embroidery, Knitting, Sewing \n \nHigher Education Management Specialties: Higher Education Administration, Business School Administration, Operations Management, Program Planning, Organizational Development, Organizational Change Management, Academic Library Management, Facilities Management, Space Planning and Space Management, Writing and Editing, Nonprofit Management, Not-for-Profit Management Experience Owner and Needlework Designer Needlework Bench May 2011  – Present (4 years 4 months) Galena, Illinois Bookkeeper (part-time) Galena - Jo Daviess County Historical Society June 2014  – Present (1 year 3 months) Galena, Illinois Responsible for accounts payable and accounts receivable transactions for the Historical Society's Galena & U.S. Grant Museum, Gateway to History retail operation, and the Old Blacksmith Shop. Serve as Recording Secretary for the Society's Board of Directors. Associate Dean for Faculty Services and Operations Stanford University Graduate School of Business September 2001  –  April 2011  (9 years 8 months) Stanford, California Executive leadership responsibility for facilities operations, faculty support, library services, new construction program planning and building projects, food services, and residential dormitory operations. Executive Team member for planning and construction of 12.5 acre, $345MM Knight Management Center facilities completed in 2011. Served on Sustainability Task Force that recommended LEED Platinum goal. Led business school relocation Knight Shift Task Force and prepared annual capital plan. Associate Dean for Information Resources Stanford University Graduate School of Business September 2000  –  August 2001  (1 year) Stanford, California Director for Information Resources Stanford University Graduate School of Business May 1999  –  August 2000  (1 year 4 months) Stanford, California Acting Director for Information Resources Stanford University Graduate School of Business December 1997  –  April 1999  (1 year 5 months) Stanford, California Acting Library Director Stanford University Graduate School of Business, J. Hugh Jackson Library December 1997  –  January 1999  (1 year 2 months) Stanford, California Acting Director for Computing Services Stanford University Graduate School of Business December 1997  –  July 1998  (8 months) Stanford, California Head Technical Services Librarian and Assistant Director Stanford University Graduate School of Business, J. Hugh Jackson Library June 1991  –  November 1997  (6 years 6 months) Stanford, California Head Public Services Librarian and Assistant Director Stanford University Graduate School of Business, J. Hugh Jackson Library April 1989  –  May 1991  (2 years 2 months) Stanford, California Head Public Services Librarian Stanford University Graduate School of Business, J. Hugh Jackson Library January 1984  –  March 1989  (5 years 3 months) Stanford, California Cataloging and Reference Librarian Cornell University Industrial and Labor Relations School, Martin P. Catherwood Library August 1979  –  December 1983  (4 years 5 months) Ithaca, New York Acquisitions and Cataloging Librarian National City Public Library May 1976  –  June 1978  (2 years 2 months) National City, California Reference Librarian San Diego Public Library August 1974  –  May 1976  (1 year 10 months) San Diego, California Owner and Needlework Designer Needlework Bench May 2011  – Present (4 years 4 months) Galena, Illinois Owner and Needlework Designer Needlework Bench May 2011  – Present (4 years 4 months) Galena, Illinois Bookkeeper (part-time) Galena - Jo Daviess County Historical Society June 2014  – Present (1 year 3 months) Galena, Illinois Responsible for accounts payable and accounts receivable transactions for the Historical Society's Galena & U.S. Grant Museum, Gateway to History retail operation, and the Old Blacksmith Shop. Serve as Recording Secretary for the Society's Board of Directors. Bookkeeper (part-time) Galena - Jo Daviess County Historical Society June 2014  – Present (1 year 3 months) Galena, Illinois Responsible for accounts payable and accounts receivable transactions for the Historical Society's Galena & U.S. Grant Museum, Gateway to History retail operation, and the Old Blacksmith Shop. Serve as Recording Secretary for the Society's Board of Directors. Associate Dean for Faculty Services and Operations Stanford University Graduate School of Business September 2001  –  April 2011  (9 years 8 months) Stanford, California Executive leadership responsibility for facilities operations, faculty support, library services, new construction program planning and building projects, food services, and residential dormitory operations. Executive Team member for planning and construction of 12.5 acre, $345MM Knight Management Center facilities completed in 2011. Served on Sustainability Task Force that recommended LEED Platinum goal. Led business school relocation Knight Shift Task Force and prepared annual capital plan. Associate Dean for Faculty Services and Operations Stanford University Graduate School of Business September 2001  –  April 2011  (9 years 8 months) Stanford, California Executive leadership responsibility for facilities operations, faculty support, library services, new construction program planning and building projects, food services, and residential dormitory operations. Executive Team member for planning and construction of 12.5 acre, $345MM Knight Management Center facilities completed in 2011. Served on Sustainability Task Force that recommended LEED Platinum goal. Led business school relocation Knight Shift Task Force and prepared annual capital plan. Associate Dean for Information Resources Stanford University Graduate School of Business September 2000  –  August 2001  (1 year) Stanford, California Associate Dean for Information Resources Stanford University Graduate School of Business September 2000  –  August 2001  (1 year) Stanford, California Director for Information Resources Stanford University Graduate School of Business May 1999  –  August 2000  (1 year 4 months) Stanford, California Director for Information Resources Stanford University Graduate School of Business May 1999  –  August 2000  (1 year 4 months) Stanford, California Acting Director for Information Resources Stanford University Graduate School of Business December 1997  –  April 1999  (1 year 5 months) Stanford, California Acting Director for Information Resources Stanford University Graduate School of Business December 1997  –  April 1999  (1 year 5 months) Stanford, California Acting Library Director Stanford University Graduate School of Business, J. Hugh Jackson Library December 1997  –  January 1999  (1 year 2 months) Stanford, California Acting Library Director Stanford University Graduate School of Business, J. Hugh Jackson Library December 1997  –  January 1999  (1 year 2 months) Stanford, California Acting Director for Computing Services Stanford University Graduate School of Business December 1997  –  July 1998  (8 months) Stanford, California Acting Director for Computing Services Stanford University Graduate School of Business December 1997  –  July 1998  (8 months) Stanford, California Head Technical Services Librarian and Assistant Director Stanford University Graduate School of Business, J. Hugh Jackson Library June 1991  –  November 1997  (6 years 6 months) Stanford, California Head Technical Services Librarian and Assistant Director Stanford University Graduate School of Business, J. Hugh Jackson Library June 1991  –  November 1997  (6 years 6 months) Stanford, California Head Public Services Librarian and Assistant Director Stanford University Graduate School of Business, J. Hugh Jackson Library April 1989  –  May 1991  (2 years 2 months) Stanford, California Head Public Services Librarian and Assistant Director Stanford University Graduate School of Business, J. Hugh Jackson Library April 1989  –  May 1991  (2 years 2 months) Stanford, California Head Public Services Librarian Stanford University Graduate School of Business, J. Hugh Jackson Library January 1984  –  March 1989  (5 years 3 months) Stanford, California Head Public Services Librarian Stanford University Graduate School of Business, J. Hugh Jackson Library January 1984  –  March 1989  (5 years 3 months) Stanford, California Cataloging and Reference Librarian Cornell University Industrial and Labor Relations School, Martin P. Catherwood Library August 1979  –  December 1983  (4 years 5 months) Ithaca, New York Cataloging and Reference Librarian Cornell University Industrial and Labor Relations School, Martin P. Catherwood Library August 1979  –  December 1983  (4 years 5 months) Ithaca, New York Acquisitions and Cataloging Librarian National City Public Library May 1976  –  June 1978  (2 years 2 months) National City, California Acquisitions and Cataloging Librarian National City Public Library May 1976  –  June 1978  (2 years 2 months) National City, California Reference Librarian San Diego Public Library August 1974  –  May 1976  (1 year 10 months) San Diego, California Reference Librarian San Diego Public Library August 1974  –  May 1976  (1 year 10 months) San Diego, California Languages Spanish Spanish Spanish Skills Higher Education Business Schools Leadership Management Change Management Strategic Planning Budget Management Operations Management Facilities Management Organizational... Program Development Project Planning Project Management Library Management Event Management Research Editing Writing Report Writing Nonprofits Not for Profit See 6+     See less Skills  Higher Education Business Schools Leadership Management Change Management Strategic Planning Budget Management Operations Management Facilities Management Organizational... Program Development Project Planning Project Management Library Management Event Management Research Editing Writing Report Writing Nonprofits Not for Profit See 6+     See less Higher Education Business Schools Leadership Management Change Management Strategic Planning Budget Management Operations Management Facilities Management Organizational... Program Development Project Planning Project Management Library Management Event Management Research Editing Writing Report Writing Nonprofits Not for Profit See 6+     See less Higher Education Business Schools Leadership Management Change Management Strategic Planning Budget Management Operations Management Facilities Management Organizational... Program Development Project Planning Project Management Library Management Event Management Research Editing Writing Report Writing Nonprofits Not for Profit See 6+     See less Education The Royal School of Needlework, Hampton Court Palace, United Kingdom Studying for Diploma in Technical Hand Embroidery 2014  – 2015 The Royal School of Needlework, Hampton Court Palace, United Kingdom Certificate in Technical Hand Embroidery 2013  – 2013 San Jose State University M.A.,  Librarianship 1973  – 1974 University of California, San Diego B.A.,  English and American Literature 1969  – 1973 The Royal School of Needlework, Hampton Court Palace, United Kingdom Studying for Diploma in Technical Hand Embroidery 2014  – 2015 The Royal School of Needlework, Hampton Court Palace, United Kingdom Studying for Diploma in Technical Hand Embroidery 2014  – 2015 The Royal School of Needlework, Hampton Court Palace, United Kingdom Studying for Diploma in Technical Hand Embroidery 2014  – 2015 The Royal School of Needlework, Hampton Court Palace, United Kingdom Certificate in Technical Hand Embroidery 2013  – 2013 The Royal School of Needlework, Hampton Court Palace, United Kingdom Certificate in Technical Hand Embroidery 2013  – 2013 The Royal School of Needlework, Hampton Court Palace, United Kingdom Certificate in Technical Hand Embroidery 2013  – 2013 San Jose State University M.A.,  Librarianship 1973  – 1974 San Jose State University M.A.,  Librarianship 1973  – 1974 San Jose State University M.A.,  Librarianship 1973  – 1974 University of California, San Diego B.A.,  English and American Literature 1969  – 1973 University of California, San Diego B.A.,  English and American Literature 1969  – 1973 University of California, San Diego B.A.,  English and American Literature 1969  – 1973 Honors & Awards Stanford University Award for Reengineering Stanford University December 1994 Stanford University Award for Reengineering Stanford University December 1994 Stanford University Award for Reengineering Stanford University December 1994 Stanford University Award for Reengineering Stanford University December 1994 ", "Experience Retired retired Assistant Director Stanford University May 1997  –  June 2013  (16 years 2 months) Retired retired Retired retired Assistant Director Stanford University May 1997  –  June 2013  (16 years 2 months) Assistant Director Stanford University May 1997  –  June 2013  (16 years 2 months) Skills Higher Education Student Affairs Skills  Higher Education Student Affairs Higher Education Student Affairs Higher Education Student Affairs ", "Skills CSS Software Development SQL Linux Python User Experience HTML MySQL Perl Program Management Agile Methodologies Scrum Web Applications Web Development Unix Apache See 1+     See less Skills  CSS Software Development SQL Linux Python User Experience HTML MySQL Perl Program Management Agile Methodologies Scrum Web Applications Web Development Unix Apache See 1+     See less CSS Software Development SQL Linux Python User Experience HTML MySQL Perl Program Management Agile Methodologies Scrum Web Applications Web Development Unix Apache See 1+     See less CSS Software Development SQL Linux Python User Experience HTML MySQL Perl Program Management Agile Methodologies Scrum Web Applications Web Development Unix Apache See 1+     See less ", "Experience Assistant Director Stanford University Medical Center Assistant Director Stanford University Medical Center Assistant Director Stanford University Medical Center ", "Languages English Native or bilingual proficiency Romania Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency Romania Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency Romania Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Research Acting Dramaturgy Teaching Drama Arts Administration Performing Arts Public Speaking Theatre Non-profits Film Blogging Creative Writing Grant Writing Event Management Storytelling Editing Improvisation Event Planning Film Production Social Media Higher Education Dance Stage Music Musical Theatre Nonprofits Directing Singing Screenwriting Art Video Production Video Video Editing Television Entertainment Voice Over Shakespeare Photography Documentaries Social Networking Short Films Journalism Casting See 29+     See less Skills  Research Acting Dramaturgy Teaching Drama Arts Administration Performing Arts Public Speaking Theatre Non-profits Film Blogging Creative Writing Grant Writing Event Management Storytelling Editing Improvisation Event Planning Film Production Social Media Higher Education Dance Stage Music Musical Theatre Nonprofits Directing Singing Screenwriting Art Video Production Video Video Editing Television Entertainment Voice Over Shakespeare Photography Documentaries Social Networking Short Films Journalism Casting See 29+     See less Research Acting Dramaturgy Teaching Drama Arts Administration Performing Arts Public Speaking Theatre Non-profits Film Blogging Creative Writing Grant Writing Event Management Storytelling Editing Improvisation Event Planning Film Production Social Media Higher Education Dance Stage Music Musical Theatre Nonprofits Directing Singing Screenwriting Art Video Production Video Video Editing Television Entertainment Voice Over Shakespeare Photography Documentaries Social Networking Short Films Journalism Casting See 29+     See less Research Acting Dramaturgy Teaching Drama Arts Administration Performing Arts Public Speaking Theatre Non-profits Film Blogging Creative Writing Grant Writing Event Management Storytelling Editing Improvisation Event Planning Film Production Social Media Higher Education Dance Stage Music Musical Theatre Nonprofits Directing Singing Screenwriting Art Video Production Video Video Editing Television Entertainment Voice Over Shakespeare Photography Documentaries Social Networking Short Films Journalism Casting See 29+     See less ", "Languages Spanish Spanish Spanish Skills Leadership Public Speaking Leadership Development Human Resources Program Management Motivational Speaking Management Event Management Event Planning Conflict Resolution Curriculum Design Fundraising Nonprofits Teaching Research Grants Program Development Program Evaluation Higher Education See 4+     See less Skills  Leadership Public Speaking Leadership Development Human Resources Program Management Motivational Speaking Management Event Management Event Planning Conflict Resolution Curriculum Design Fundraising Nonprofits Teaching Research Grants Program Development Program Evaluation Higher Education See 4+     See less Leadership Public Speaking Leadership Development Human Resources Program Management Motivational Speaking Management Event Management Event Planning Conflict Resolution Curriculum Design Fundraising Nonprofits Teaching Research Grants Program Development Program Evaluation Higher Education See 4+     See less Leadership Public Speaking Leadership Development Human Resources Program Management Motivational Speaking Management Event Management Event Planning Conflict Resolution Curriculum Design Fundraising Nonprofits Teaching Research Grants Program Development Program Evaluation Higher Education See 4+     See less Honors & Awards ", "Experience Housing Assistant Director Stanford University Housing Assistant Director Stanford University Housing Assistant Director Stanford University ", "Summary Oracle Corp, Stanford University, Transmeta Corp. Specialties:Management, Consulting (Technology and Business Development), Strategic alliances, Negotiations, International expansions, Leadership Summary Oracle Corp, Stanford University, Transmeta Corp. Specialties:Management, Consulting (Technology and Business Development), Strategic alliances, Negotiations, International expansions, Leadership Oracle Corp, Stanford University, Transmeta Corp. Specialties:Management, Consulting (Technology and Business Development), Strategic alliances, Negotiations, International expansions, Leadership Oracle Corp, Stanford University, Transmeta Corp. Specialties:Management, Consulting (Technology and Business Development), Strategic alliances, Negotiations, International expansions, Leadership Experience Key Account Director Oracle April 2014  – Present (1 year 5 months) San Francisco Bay Area Global responsibility for all lines of Oracle business at The Walt Disney Company and Disney subsidiaries. Technology Sales Manager Oracle Corporation June 2011  – Present (4 years 3 months) San Francisco Bay Area Global account ownership for software license sales to a small group of Fortune 500 accounts. Manager, Oracle Argentina Oracle Corporation December 2009  –  June 2011  (1 year 7 months) Buenos Aires, Argentina Ben was on a 2-year Expatriot assignment to open an offshore Sales hub in Buenos Aires, Argentina. He had responsibility for the Argentina Technology hub for Sales and business development for North America (US and Canada). \n \nHis teams covered North American Commercial Accounts for Technology License Sales, reporting to the Vice President of Sales for North American Commercial Accounts. \n \n-Hired, trained and managed a net-new team of 30 Sales Reps in a new office in Buenos Aires. \n-2 Year Expatriot relocation to Argentina to build a new Sales hub (2009-2011). \n-Built out infrastructure, culture, management team and implement Best Practices from Oracle HQ. \n-Worked closely with North American management and Sales teams to align integration and Sales methodologies. Senior Account Manager Oracle Corporation December 2007  –  December 2009  (2 years 1 month) -MVP for all of Oracle Direct North America - Q2 FY'10 (Leadership and Outstanding Performance Award). \n-MVP Q2 FY'10 (380% of Budget). \n-SoCal MVP Q1 FY'10 (275% of Budget). \n-Top Performer FY'09 (160% of Budget). \n-MVP Q1 FY'09 (425% of Budget). \n-Top Mentor Award, FY'09. \n-Nominated as Team Lead.  \n-Presidents Club FY'08 (Banff, Canada) - (180% of annual Budget). \n-Consistently exceed quota.  \n-Promoted (December 2007) to Senior leadership role. Account Manager Oracle Corporation September 2006  –  December 2007  (1 year 4 months) Manage commercial accounts in Southern California, primarily Orange County and LA. Generate new business, strategic plan for territory. Assistant Director Stanford University 2005  –  2006  (1 year) Assistant Director and Marketing Manager for the Stanford Technology Ventures Program (STVP: http://stvp.stanford.edu). Liaison to the venture capital, legal and start-up community for Stanford's School of Engineering's entrepreneurship program. Worked with programs such as Stanford's dSchool, IDEO, GSB and others to drive entrepreneurship at Stanford, locally, and internationally. Consultant various startups January 2003  –  August 2005  (2 years 8 months) Consultant and entrepreneur with IDI Corp. and various high-tech start-ups in Texas and California. Manager, Operations Transmeta Corp. September 1997  –  August 2002  (5 years) Managed a team of 7 people in Santa Clara and Boston for a fast-paced, aggressively growing semiconductor company. Responsible for organizational, financial and strategic decisions. Recruited, hired, managed, trained and developed a team of seven to ensure smooth operations in California and Boston. Negotiated $37 million in real estate deals, including consolidation of existing operations and domestic expansion. Marketing and Sales Manager (Madrid, Spain) InMadrid Magazine 1996  –  1997  (1 year) Developed sales and marketing department for a new English-language magazine in Madrid, Spain.  \nSold directly to local industry and large advertisers. Project Coordinator - NAFTA (Mexico City) Environmental Education & Training Institute of North America (EETINA) 1995  –  1995  (less than a year) Managed environmental training programs for NAFTA environmental groups from Mexico, Canada and the US. Based in Mexico City, Mexico. Project Coordinator (Costa Rica) Amigos de las Americas 1989  –  1989  (less than a year) Volunteer in southern Costa Rica (Suretka) working with families in remote villages on water purification and healthcare issues. Key Account Director Oracle April 2014  – Present (1 year 5 months) San Francisco Bay Area Global responsibility for all lines of Oracle business at The Walt Disney Company and Disney subsidiaries. Key Account Director Oracle April 2014  – Present (1 year 5 months) San Francisco Bay Area Global responsibility for all lines of Oracle business at The Walt Disney Company and Disney subsidiaries. Technology Sales Manager Oracle Corporation June 2011  – Present (4 years 3 months) San Francisco Bay Area Global account ownership for software license sales to a small group of Fortune 500 accounts. Technology Sales Manager Oracle Corporation June 2011  – Present (4 years 3 months) San Francisco Bay Area Global account ownership for software license sales to a small group of Fortune 500 accounts. Manager, Oracle Argentina Oracle Corporation December 2009  –  June 2011  (1 year 7 months) Buenos Aires, Argentina Ben was on a 2-year Expatriot assignment to open an offshore Sales hub in Buenos Aires, Argentina. He had responsibility for the Argentina Technology hub for Sales and business development for North America (US and Canada). \n \nHis teams covered North American Commercial Accounts for Technology License Sales, reporting to the Vice President of Sales for North American Commercial Accounts. \n \n-Hired, trained and managed a net-new team of 30 Sales Reps in a new office in Buenos Aires. \n-2 Year Expatriot relocation to Argentina to build a new Sales hub (2009-2011). \n-Built out infrastructure, culture, management team and implement Best Practices from Oracle HQ. \n-Worked closely with North American management and Sales teams to align integration and Sales methodologies. Manager, Oracle Argentina Oracle Corporation December 2009  –  June 2011  (1 year 7 months) Buenos Aires, Argentina Ben was on a 2-year Expatriot assignment to open an offshore Sales hub in Buenos Aires, Argentina. He had responsibility for the Argentina Technology hub for Sales and business development for North America (US and Canada). \n \nHis teams covered North American Commercial Accounts for Technology License Sales, reporting to the Vice President of Sales for North American Commercial Accounts. \n \n-Hired, trained and managed a net-new team of 30 Sales Reps in a new office in Buenos Aires. \n-2 Year Expatriot relocation to Argentina to build a new Sales hub (2009-2011). \n-Built out infrastructure, culture, management team and implement Best Practices from Oracle HQ. \n-Worked closely with North American management and Sales teams to align integration and Sales methodologies. Senior Account Manager Oracle Corporation December 2007  –  December 2009  (2 years 1 month) -MVP for all of Oracle Direct North America - Q2 FY'10 (Leadership and Outstanding Performance Award). \n-MVP Q2 FY'10 (380% of Budget). \n-SoCal MVP Q1 FY'10 (275% of Budget). \n-Top Performer FY'09 (160% of Budget). \n-MVP Q1 FY'09 (425% of Budget). \n-Top Mentor Award, FY'09. \n-Nominated as Team Lead.  \n-Presidents Club FY'08 (Banff, Canada) - (180% of annual Budget). \n-Consistently exceed quota.  \n-Promoted (December 2007) to Senior leadership role. Senior Account Manager Oracle Corporation December 2007  –  December 2009  (2 years 1 month) -MVP for all of Oracle Direct North America - Q2 FY'10 (Leadership and Outstanding Performance Award). \n-MVP Q2 FY'10 (380% of Budget). \n-SoCal MVP Q1 FY'10 (275% of Budget). \n-Top Performer FY'09 (160% of Budget). \n-MVP Q1 FY'09 (425% of Budget). \n-Top Mentor Award, FY'09. \n-Nominated as Team Lead.  \n-Presidents Club FY'08 (Banff, Canada) - (180% of annual Budget). \n-Consistently exceed quota.  \n-Promoted (December 2007) to Senior leadership role. Account Manager Oracle Corporation September 2006  –  December 2007  (1 year 4 months) Manage commercial accounts in Southern California, primarily Orange County and LA. Generate new business, strategic plan for territory. Account Manager Oracle Corporation September 2006  –  December 2007  (1 year 4 months) Manage commercial accounts in Southern California, primarily Orange County and LA. Generate new business, strategic plan for territory. Assistant Director Stanford University 2005  –  2006  (1 year) Assistant Director and Marketing Manager for the Stanford Technology Ventures Program (STVP: http://stvp.stanford.edu). Liaison to the venture capital, legal and start-up community for Stanford's School of Engineering's entrepreneurship program. Worked with programs such as Stanford's dSchool, IDEO, GSB and others to drive entrepreneurship at Stanford, locally, and internationally. Assistant Director Stanford University 2005  –  2006  (1 year) Assistant Director and Marketing Manager for the Stanford Technology Ventures Program (STVP: http://stvp.stanford.edu). Liaison to the venture capital, legal and start-up community for Stanford's School of Engineering's entrepreneurship program. Worked with programs such as Stanford's dSchool, IDEO, GSB and others to drive entrepreneurship at Stanford, locally, and internationally. Consultant various startups January 2003  –  August 2005  (2 years 8 months) Consultant and entrepreneur with IDI Corp. and various high-tech start-ups in Texas and California. Consultant various startups January 2003  –  August 2005  (2 years 8 months) Consultant and entrepreneur with IDI Corp. and various high-tech start-ups in Texas and California. Manager, Operations Transmeta Corp. September 1997  –  August 2002  (5 years) Managed a team of 7 people in Santa Clara and Boston for a fast-paced, aggressively growing semiconductor company. Responsible for organizational, financial and strategic decisions. Recruited, hired, managed, trained and developed a team of seven to ensure smooth operations in California and Boston. Negotiated $37 million in real estate deals, including consolidation of existing operations and domestic expansion. Manager, Operations Transmeta Corp. September 1997  –  August 2002  (5 years) Managed a team of 7 people in Santa Clara and Boston for a fast-paced, aggressively growing semiconductor company. Responsible for organizational, financial and strategic decisions. Recruited, hired, managed, trained and developed a team of seven to ensure smooth operations in California and Boston. Negotiated $37 million in real estate deals, including consolidation of existing operations and domestic expansion. Marketing and Sales Manager (Madrid, Spain) InMadrid Magazine 1996  –  1997  (1 year) Developed sales and marketing department for a new English-language magazine in Madrid, Spain.  \nSold directly to local industry and large advertisers. Marketing and Sales Manager (Madrid, Spain) InMadrid Magazine 1996  –  1997  (1 year) Developed sales and marketing department for a new English-language magazine in Madrid, Spain.  \nSold directly to local industry and large advertisers. Project Coordinator - NAFTA (Mexico City) Environmental Education & Training Institute of North America (EETINA) 1995  –  1995  (less than a year) Managed environmental training programs for NAFTA environmental groups from Mexico, Canada and the US. Based in Mexico City, Mexico. Project Coordinator - NAFTA (Mexico City) Environmental Education & Training Institute of North America (EETINA) 1995  –  1995  (less than a year) Managed environmental training programs for NAFTA environmental groups from Mexico, Canada and the US. Based in Mexico City, Mexico. Project Coordinator (Costa Rica) Amigos de las Americas 1989  –  1989  (less than a year) Volunteer in southern Costa Rica (Suretka) working with families in remote villages on water purification and healthcare issues. Project Coordinator (Costa Rica) Amigos de las Americas 1989  –  1989  (less than a year) Volunteer in southern Costa Rica (Suretka) working with families in remote villages on water purification and healthcare issues. Languages Spanish Spanish Spanish Skills Management Leadership Strategic Alliances Business Development Negotiation Management Consulting Cloud Computing Program Management Product Management Enterprise Software Product Marketing Account Management Integration Direct Sales Start-ups Sales Sales Management Sales Operations Entrepreneurship Business Strategy International Sales Strategic Planning Lead Generation Go-to-market Strategy SaaS Analysis Strategy Business Intelligence Solution Selling Sales Process Strategic Partnerships Professional Services CRM Storage Business Alliances Marketing Latin America ERP New Business Development Analytics Technology Licensing Partner Management Sales Enablement Pre-sales Channel Partners Salesforce.com PaaS See 33+     See less Skills  Management Leadership Strategic Alliances Business Development Negotiation Management Consulting Cloud Computing Program Management Product Management Enterprise Software Product Marketing Account Management Integration Direct Sales Start-ups Sales Sales Management Sales Operations Entrepreneurship Business Strategy International Sales Strategic Planning Lead Generation Go-to-market Strategy SaaS Analysis Strategy Business Intelligence Solution Selling Sales Process Strategic Partnerships Professional Services CRM Storage Business Alliances Marketing Latin America ERP New Business Development Analytics Technology Licensing Partner Management Sales Enablement Pre-sales Channel Partners Salesforce.com PaaS See 33+     See less Management Leadership Strategic Alliances Business Development Negotiation Management Consulting Cloud Computing Program Management Product Management Enterprise Software Product Marketing Account Management Integration Direct Sales Start-ups Sales Sales Management Sales Operations Entrepreneurship Business Strategy International Sales Strategic Planning Lead Generation Go-to-market Strategy SaaS Analysis Strategy Business Intelligence Solution Selling Sales Process Strategic Partnerships Professional Services CRM Storage Business Alliances Marketing Latin America ERP New Business Development Analytics Technology Licensing Partner Management Sales Enablement Pre-sales Channel Partners Salesforce.com PaaS See 33+     See less Management Leadership Strategic Alliances Business Development Negotiation Management Consulting Cloud Computing Program Management Product Management Enterprise Software Product Marketing Account Management Integration Direct Sales Start-ups Sales Sales Management Sales Operations Entrepreneurship Business Strategy International Sales Strategic Planning Lead Generation Go-to-market Strategy SaaS Analysis Strategy Business Intelligence Solution Selling Sales Process Strategic Partnerships Professional Services CRM Storage Business Alliances Marketing Latin America ERP New Business Development Analytics Technology Licensing Partner Management Sales Enablement Pre-sales Channel Partners Salesforce.com PaaS See 33+     See less Education Southern Methodist University - Cox School of Business MBA- partial,  Technology, Strategy 2002  – 2003 University of San Diego BA,  International Relations 1992  – 1996 Sacred Heart Prep 1988  – 1992 Activities and Societies:  Rotary Club: International Community Service Award Stanford University University of California, Berkeley Southern Methodist University - Cox School of Business MBA- partial,  Technology, Strategy 2002  – 2003 Southern Methodist University - Cox School of Business MBA- partial,  Technology, Strategy 2002  – 2003 Southern Methodist University - Cox School of Business MBA- partial,  Technology, Strategy 2002  – 2003 University of San Diego BA,  International Relations 1992  – 1996 University of San Diego BA,  International Relations 1992  – 1996 University of San Diego BA,  International Relations 1992  – 1996 Sacred Heart Prep 1988  – 1992 Activities and Societies:  Rotary Club: International Community Service Award Sacred Heart Prep 1988  – 1992 Activities and Societies:  Rotary Club: International Community Service Award Sacred Heart Prep 1988  – 1992 Activities and Societies:  Rotary Club: International Community Service Award Stanford University Stanford University Stanford University University of California, Berkeley University of California, Berkeley University of California, Berkeley Honors & Awards Additional Honors & Awards -Rotary Club International Community Service \n-Volunteer, Environmental Traveling Companions (www.etctrips.org) \n-Volunteer, Boys & Girls Club, San Francisco \n-Time Magazine Person of the Year 2006 Additional Honors & Awards -Rotary Club International Community Service \n-Volunteer, Environmental Traveling Companions (www.etctrips.org) \n-Volunteer, Boys & Girls Club, San Francisco \n-Time Magazine Person of the Year 2006 Additional Honors & Awards -Rotary Club International Community Service \n-Volunteer, Environmental Traveling Companions (www.etctrips.org) \n-Volunteer, Boys & Girls Club, San Francisco \n-Time Magazine Person of the Year 2006 Additional Honors & Awards -Rotary Club International Community Service \n-Volunteer, Environmental Traveling Companions (www.etctrips.org) \n-Volunteer, Boys & Girls Club, San Francisco \n-Time Magazine Person of the Year 2006 ", "Experience Assistant Director Stanford University October 2008  – Present (6 years 11 months) Assistant Director Stanford University October 2008  – Present (6 years 11 months) Assistant Director Stanford University October 2008  – Present (6 years 11 months) ", "Summary Kristin Conner is a Career Development Professional with over 15 years of experience assisting students and alumni with career exploration, the job/internship search process, networking strategies, and career management. Kristin's background and expertise includes student and employer career engagement and community building, with special focus on public service careers, international careers, internships, international students, the freshmen and sophomore experience, and career assessment/tool use and development. She has also worked with students interested in engineering, health, business, and arts and entertainment. Kristin is a Nationally Certified Counselor and has received Master Career Counselor recognition from the National Career Development Association (NCDA) where she has also been part of the NCDA Leadership Academy. Summary Kristin Conner is a Career Development Professional with over 15 years of experience assisting students and alumni with career exploration, the job/internship search process, networking strategies, and career management. Kristin's background and expertise includes student and employer career engagement and community building, with special focus on public service careers, international careers, internships, international students, the freshmen and sophomore experience, and career assessment/tool use and development. She has also worked with students interested in engineering, health, business, and arts and entertainment. Kristin is a Nationally Certified Counselor and has received Master Career Counselor recognition from the National Career Development Association (NCDA) where she has also been part of the NCDA Leadership Academy. Kristin Conner is a Career Development Professional with over 15 years of experience assisting students and alumni with career exploration, the job/internship search process, networking strategies, and career management. Kristin's background and expertise includes student and employer career engagement and community building, with special focus on public service careers, international careers, internships, international students, the freshmen and sophomore experience, and career assessment/tool use and development. She has also worked with students interested in engineering, health, business, and arts and entertainment. Kristin is a Nationally Certified Counselor and has received Master Career Counselor recognition from the National Career Development Association (NCDA) where she has also been part of the NCDA Leadership Academy. Kristin Conner is a Career Development Professional with over 15 years of experience assisting students and alumni with career exploration, the job/internship search process, networking strategies, and career management. Kristin's background and expertise includes student and employer career engagement and community building, with special focus on public service careers, international careers, internships, international students, the freshmen and sophomore experience, and career assessment/tool use and development. She has also worked with students interested in engineering, health, business, and arts and entertainment. Kristin is a Nationally Certified Counselor and has received Master Career Counselor recognition from the National Career Development Association (NCDA) where she has also been part of the NCDA Leadership Academy. Experience Director of Transfer and Career Services Los Medanos College June 2015  – Present (3 months) Product Developer, Tools for career Readiness Exploration and Evaluation (T.R.E.E) Stanford University, Career Development Center August 2008  – Present (7 years 1 month) •Created unique on-line career tool as part of four-person collaboration. \n•Developed career curriculum for self-reflection, career exploration, networking, and job search, which includes reflection questions for each step. Results can be saved by user and discussed in career counseling sessions. \n•Consulted on content and activity design, user-experience, and overall design of front-end and back-end of product. \n•Product is licensed and available for purchase by universities or corporations and fully modifiable for different populations. Assistant Director Stanford University, Career Development Center October 2000  –  June 2015  (14 years 9 months) Community Development/Programming \n•Freshmen/Sophomore: Played key role in developing strategy to build community. Strategy was developed through soliciting information from students and collaborative partnerships to personalize career development through targeted meetups. Utilized Twitter, Campus Quad and email weekly with targeted information.  \n•Public Service Careers: Created and implemented successful strategy building strong community of students. Developed targeted programs and networking events (20+ per yr) with alumni/employers. Collaborated with staff in development of career web portal. Advocated for nonprofit employer access to low-cost ways to connect with students. Strategy became template in office for other career focused communities. Instituted weekly email with targeted resources and jobs (5800+ students subscribed).  \n•International Careers: Led multi-department week-long program which included an international opportunities fair and alumni/student events. Built community through cross-campus programming and targeted marketing strategy. \n•International Students: Developed career education series in response to student and international center concerns.  \nManagement \n•Supervised 4 graduate students (one promoted to professional staff). Evaluated performance based on University expectations and requirements of grad program. Provided on-going training of counseling skills; met weekly through individual and group supervision. \n•Managed peer counseling program of 4-6 students who provided outreach on career topics. Facilitated 3-month training on counseling skills, job/internship strategies and application material preparation. Developed connections across campus to secure space for presentations. \n•Led team in development/implementation of alumni/student networking lunch. Directed IT staff in creation of online scheduling system for 400 attendees.  \nCounseling \n•Counseled diverse student population through entire career development process. Clasroom Facilitator, Designing Your Stanford (4/14-6/14), Designing Your Life Stanford University April 2010  –  June 2014  (4 years 3 months) •Facilitated small-group discussions (8-10 students) within larger undergraduate lecture course regarding the career exploration/decision process and making most of academic experience all through the design thinking lens. Lecturer, Case Studies and Internships; Integrated Counseling Theories San Francisco State University August 2007  –  May 2008  (10 months) •Taught, supervised and evaluated students in graduate level course on integrating career development theory into practicum sites. \n•Utilized group discussion, case studies and flipped-classroom techniques to highlight theories and difficult client situations. \n•Guided students through process of writing culminating experience (thesis) paper. Career Counselor U.C.Berkeley, Career Center February 2000  –  June 2000  (5 months) •\tCounseled diverse student population on career issues, including resumes, interviewing and job search strategies \n•\tDeveloped focus and programming for career symposium, as part of planning team \n•\tUpdated website information on career opportunities Event Planning Committee Member U.C. Berkeley, Career Center October 1999  –  December 1999  (3 months) •\tReviewed and created variety of advertising material for week-long event (35 programs) \n•\tWorked with committee, under deadline, to acquire and confirm panelists and all logistical needs \n•\tDeveloped new connections with career professionals Employment Liaison San Mateo County, Youth Employment Program June 1999  –  August 1999  (3 months) •\tProvided outreach and recruitment to local schools regarding program opportunities \n•\tMediated conflicts between students, employers, and parents \n•\tMulti-tasked application process and government deadlines, and monitored student progress at work site \n•\tAssessed and oriented students and local employers to program requirements and expectations Career Counselor Intern U.C. Berkeley, Career Center August 1998  –  May 1999  (10 months) Career Counselor Intern San Francisco State University, Career Center August 1997  –  May 1998  (10 months) Resource Librarian Sonoma State University, Career Center May 1997  –  August 1997  (4 months) Director of Transfer and Career Services Los Medanos College June 2015  – Present (3 months) Director of Transfer and Career Services Los Medanos College June 2015  – Present (3 months) Product Developer, Tools for career Readiness Exploration and Evaluation (T.R.E.E) Stanford University, Career Development Center August 2008  – Present (7 years 1 month) •Created unique on-line career tool as part of four-person collaboration. \n•Developed career curriculum for self-reflection, career exploration, networking, and job search, which includes reflection questions for each step. Results can be saved by user and discussed in career counseling sessions. \n•Consulted on content and activity design, user-experience, and overall design of front-end and back-end of product. \n•Product is licensed and available for purchase by universities or corporations and fully modifiable for different populations. Product Developer, Tools for career Readiness Exploration and Evaluation (T.R.E.E) Stanford University, Career Development Center August 2008  – Present (7 years 1 month) •Created unique on-line career tool as part of four-person collaboration. \n•Developed career curriculum for self-reflection, career exploration, networking, and job search, which includes reflection questions for each step. Results can be saved by user and discussed in career counseling sessions. \n•Consulted on content and activity design, user-experience, and overall design of front-end and back-end of product. \n•Product is licensed and available for purchase by universities or corporations and fully modifiable for different populations. Assistant Director Stanford University, Career Development Center October 2000  –  June 2015  (14 years 9 months) Community Development/Programming \n•Freshmen/Sophomore: Played key role in developing strategy to build community. Strategy was developed through soliciting information from students and collaborative partnerships to personalize career development through targeted meetups. Utilized Twitter, Campus Quad and email weekly with targeted information.  \n•Public Service Careers: Created and implemented successful strategy building strong community of students. Developed targeted programs and networking events (20+ per yr) with alumni/employers. Collaborated with staff in development of career web portal. Advocated for nonprofit employer access to low-cost ways to connect with students. Strategy became template in office for other career focused communities. Instituted weekly email with targeted resources and jobs (5800+ students subscribed).  \n•International Careers: Led multi-department week-long program which included an international opportunities fair and alumni/student events. Built community through cross-campus programming and targeted marketing strategy. \n•International Students: Developed career education series in response to student and international center concerns.  \nManagement \n•Supervised 4 graduate students (one promoted to professional staff). Evaluated performance based on University expectations and requirements of grad program. Provided on-going training of counseling skills; met weekly through individual and group supervision. \n•Managed peer counseling program of 4-6 students who provided outreach on career topics. Facilitated 3-month training on counseling skills, job/internship strategies and application material preparation. Developed connections across campus to secure space for presentations. \n•Led team in development/implementation of alumni/student networking lunch. Directed IT staff in creation of online scheduling system for 400 attendees.  \nCounseling \n•Counseled diverse student population through entire career development process. Assistant Director Stanford University, Career Development Center October 2000  –  June 2015  (14 years 9 months) Community Development/Programming \n•Freshmen/Sophomore: Played key role in developing strategy to build community. Strategy was developed through soliciting information from students and collaborative partnerships to personalize career development through targeted meetups. Utilized Twitter, Campus Quad and email weekly with targeted information.  \n•Public Service Careers: Created and implemented successful strategy building strong community of students. Developed targeted programs and networking events (20+ per yr) with alumni/employers. Collaborated with staff in development of career web portal. Advocated for nonprofit employer access to low-cost ways to connect with students. Strategy became template in office for other career focused communities. Instituted weekly email with targeted resources and jobs (5800+ students subscribed).  \n•International Careers: Led multi-department week-long program which included an international opportunities fair and alumni/student events. Built community through cross-campus programming and targeted marketing strategy. \n•International Students: Developed career education series in response to student and international center concerns.  \nManagement \n•Supervised 4 graduate students (one promoted to professional staff). Evaluated performance based on University expectations and requirements of grad program. Provided on-going training of counseling skills; met weekly through individual and group supervision. \n•Managed peer counseling program of 4-6 students who provided outreach on career topics. Facilitated 3-month training on counseling skills, job/internship strategies and application material preparation. Developed connections across campus to secure space for presentations. \n•Led team in development/implementation of alumni/student networking lunch. Directed IT staff in creation of online scheduling system for 400 attendees.  \nCounseling \n•Counseled diverse student population through entire career development process. Clasroom Facilitator, Designing Your Stanford (4/14-6/14), Designing Your Life Stanford University April 2010  –  June 2014  (4 years 3 months) •Facilitated small-group discussions (8-10 students) within larger undergraduate lecture course regarding the career exploration/decision process and making most of academic experience all through the design thinking lens. Clasroom Facilitator, Designing Your Stanford (4/14-6/14), Designing Your Life Stanford University April 2010  –  June 2014  (4 years 3 months) •Facilitated small-group discussions (8-10 students) within larger undergraduate lecture course regarding the career exploration/decision process and making most of academic experience all through the design thinking lens. Lecturer, Case Studies and Internships; Integrated Counseling Theories San Francisco State University August 2007  –  May 2008  (10 months) •Taught, supervised and evaluated students in graduate level course on integrating career development theory into practicum sites. \n•Utilized group discussion, case studies and flipped-classroom techniques to highlight theories and difficult client situations. \n•Guided students through process of writing culminating experience (thesis) paper. Lecturer, Case Studies and Internships; Integrated Counseling Theories San Francisco State University August 2007  –  May 2008  (10 months) •Taught, supervised and evaluated students in graduate level course on integrating career development theory into practicum sites. \n•Utilized group discussion, case studies and flipped-classroom techniques to highlight theories and difficult client situations. \n•Guided students through process of writing culminating experience (thesis) paper. Career Counselor U.C.Berkeley, Career Center February 2000  –  June 2000  (5 months) •\tCounseled diverse student population on career issues, including resumes, interviewing and job search strategies \n•\tDeveloped focus and programming for career symposium, as part of planning team \n•\tUpdated website information on career opportunities Career Counselor U.C.Berkeley, Career Center February 2000  –  June 2000  (5 months) •\tCounseled diverse student population on career issues, including resumes, interviewing and job search strategies \n•\tDeveloped focus and programming for career symposium, as part of planning team \n•\tUpdated website information on career opportunities Event Planning Committee Member U.C. Berkeley, Career Center October 1999  –  December 1999  (3 months) •\tReviewed and created variety of advertising material for week-long event (35 programs) \n•\tWorked with committee, under deadline, to acquire and confirm panelists and all logistical needs \n•\tDeveloped new connections with career professionals Event Planning Committee Member U.C. Berkeley, Career Center October 1999  –  December 1999  (3 months) •\tReviewed and created variety of advertising material for week-long event (35 programs) \n•\tWorked with committee, under deadline, to acquire and confirm panelists and all logistical needs \n•\tDeveloped new connections with career professionals Employment Liaison San Mateo County, Youth Employment Program June 1999  –  August 1999  (3 months) •\tProvided outreach and recruitment to local schools regarding program opportunities \n•\tMediated conflicts between students, employers, and parents \n•\tMulti-tasked application process and government deadlines, and monitored student progress at work site \n•\tAssessed and oriented students and local employers to program requirements and expectations Employment Liaison San Mateo County, Youth Employment Program June 1999  –  August 1999  (3 months) •\tProvided outreach and recruitment to local schools regarding program opportunities \n•\tMediated conflicts between students, employers, and parents \n•\tMulti-tasked application process and government deadlines, and monitored student progress at work site \n•\tAssessed and oriented students and local employers to program requirements and expectations Career Counselor Intern U.C. Berkeley, Career Center August 1998  –  May 1999  (10 months) Career Counselor Intern U.C. Berkeley, Career Center August 1998  –  May 1999  (10 months) Career Counselor Intern San Francisco State University, Career Center August 1997  –  May 1998  (10 months) Career Counselor Intern San Francisco State University, Career Center August 1997  –  May 1998  (10 months) Resource Librarian Sonoma State University, Career Center May 1997  –  August 1997  (4 months) Resource Librarian Sonoma State University, Career Center May 1997  –  August 1997  (4 months) Languages English English English Skills Career Assessment Student Affairs Cover Letters Job Search Strategies MBTI Career Development Training Community Outreach Supervisory Skills Interviews Career Counseling Employee Training Leadership Public Speaking Program Development Strong Interest... Event Planning Resume Writing Career Management Student Development Efficiency Higher Education Psychotherapy See 8+     See less Skills  Career Assessment Student Affairs Cover Letters Job Search Strategies MBTI Career Development Training Community Outreach Supervisory Skills Interviews Career Counseling Employee Training Leadership Public Speaking Program Development Strong Interest... Event Planning Resume Writing Career Management Student Development Efficiency Higher Education Psychotherapy See 8+     See less Career Assessment Student Affairs Cover Letters Job Search Strategies MBTI Career Development Training Community Outreach Supervisory Skills Interviews Career Counseling Employee Training Leadership Public Speaking Program Development Strong Interest... Event Planning Resume Writing Career Management Student Development Efficiency Higher Education Psychotherapy See 8+     See less Career Assessment Student Affairs Cover Letters Job Search Strategies MBTI Career Development Training Community Outreach Supervisory Skills Interviews Career Counseling Employee Training Leadership Public Speaking Program Development Strong Interest... Event Planning Resume Writing Career Management Student Development Efficiency Higher Education Psychotherapy See 8+     See less Education University of San Francisco EdD,  Organization and Leadership 2015 San Francisco State University MS,  Counseling 2000 College and Career Specializations Sonoma State University BA,  Psychology 1997 University of San Francisco EdD,  Organization and Leadership 2015 University of San Francisco EdD,  Organization and Leadership 2015 University of San Francisco EdD,  Organization and Leadership 2015 San Francisco State University MS,  Counseling 2000 College and Career Specializations San Francisco State University MS,  Counseling 2000 College and Career Specializations San Francisco State University MS,  Counseling 2000 College and Career Specializations Sonoma State University BA,  Psychology 1997 Sonoma State University BA,  Psychology 1997 Sonoma State University BA,  Psychology 1997 Honors & Awards NCDA Leadership Academy Class 2013/2014 National Career Development Association January 2013 The Leadership Academy was created in 2006 with the ultimate goal of the identifying and nurturing future generations of NCDA Leaders. Up to eight NCDA members will be selected to join this hands-on, highly experiential leadership development opportunity designed specifically for promising national and state career development association leaders. NCDA's Leadership Academy will refine and strengthen the leadership skills of those selected for this dynamic program.  NCDA Leadership Academy Class 2013/2014 National Career Development Association January 2013 The Leadership Academy was created in 2006 with the ultimate goal of the identifying and nurturing future generations of NCDA Leaders. Up to eight NCDA members will be selected to join this hands-on, highly experiential leadership development opportunity designed specifically for promising national and state career development association leaders. NCDA's Leadership Academy will refine and strengthen the leadership skills of those selected for this dynamic program.  NCDA Leadership Academy Class 2013/2014 National Career Development Association January 2013 The Leadership Academy was created in 2006 with the ultimate goal of the identifying and nurturing future generations of NCDA Leaders. Up to eight NCDA members will be selected to join this hands-on, highly experiential leadership development opportunity designed specifically for promising national and state career development association leaders. NCDA's Leadership Academy will refine and strengthen the leadership skills of those selected for this dynamic program.  NCDA Leadership Academy Class 2013/2014 National Career Development Association January 2013 The Leadership Academy was created in 2006 with the ultimate goal of the identifying and nurturing future generations of NCDA Leaders. Up to eight NCDA members will be selected to join this hands-on, highly experiential leadership development opportunity designed specifically for promising national and state career development association leaders. NCDA's Leadership Academy will refine and strengthen the leadership skills of those selected for this dynamic program.  ", "Summary Publications: \n\"MEMSEye\" for Optical 3D Position and Orientation Measurement - Secondary Author \n \nClosed Loop Control - \nPart of a team that developed a closed-loop PID control system, using an embedded system that drives MirrorcleTech's MEMS mirrors, and uses feedback from an optical sensor to complete the closed loop.  \n \nMirrorcle Technologies MCU Development Board - \nDeveloped and designed hardware, firmware and API for MirrorcleTech's MCU development board, which allows the user to control and drive MirrorcleTech's MEMS mirrors, drive a laser diode, and generate drive signals to analog outputs for other applications. The firmware and API offer a set of functions the user can request the MCU to perform to drive the MEMS mirror, drive the laser output, and control other settings such as filter frequency for on-board filters, enabling/disabling the on-board voltage supplies, etc. \n \nCircuit Design - Schematic and PCB Layout \nDesigned circuits for various applications such as high voltage amplifiers, Analog Input/Output boards that interface with FPGAs, and MCU controller boards. Tested circuit schematics in simulation, designed PCB layouts, created BOMs for these builds, performed QA, and provided user guides and documentation for all hardware.  \n \nOther Software skills: Classroom programming knowledge of Verilog and C/C++. Efficient in Microsoft Office, Adobe Photoshop and Illustrator, Multimedia Fusion Developer, and experience working on Windows XP, 7 and Vista, Mac OS X, and Ubuntu Linux. \n \nSpecialties: PSpice, Autocad, Cadence Layout Tools, Matlab, MultiSim and Ultiboard, Adobe Photoshop and Illustrator, Macromedia Fusion Developer 2, Microsoft Office, Computer Networking, EIT Certified \n \nManagement skills (managed a group of 34 instructors to run a camp of 250 campers) Summary Publications: \n\"MEMSEye\" for Optical 3D Position and Orientation Measurement - Secondary Author \n \nClosed Loop Control - \nPart of a team that developed a closed-loop PID control system, using an embedded system that drives MirrorcleTech's MEMS mirrors, and uses feedback from an optical sensor to complete the closed loop.  \n \nMirrorcle Technologies MCU Development Board - \nDeveloped and designed hardware, firmware and API for MirrorcleTech's MCU development board, which allows the user to control and drive MirrorcleTech's MEMS mirrors, drive a laser diode, and generate drive signals to analog outputs for other applications. The firmware and API offer a set of functions the user can request the MCU to perform to drive the MEMS mirror, drive the laser output, and control other settings such as filter frequency for on-board filters, enabling/disabling the on-board voltage supplies, etc. \n \nCircuit Design - Schematic and PCB Layout \nDesigned circuits for various applications such as high voltage amplifiers, Analog Input/Output boards that interface with FPGAs, and MCU controller boards. Tested circuit schematics in simulation, designed PCB layouts, created BOMs for these builds, performed QA, and provided user guides and documentation for all hardware.  \n \nOther Software skills: Classroom programming knowledge of Verilog and C/C++. Efficient in Microsoft Office, Adobe Photoshop and Illustrator, Multimedia Fusion Developer, and experience working on Windows XP, 7 and Vista, Mac OS X, and Ubuntu Linux. \n \nSpecialties: PSpice, Autocad, Cadence Layout Tools, Matlab, MultiSim and Ultiboard, Adobe Photoshop and Illustrator, Macromedia Fusion Developer 2, Microsoft Office, Computer Networking, EIT Certified \n \nManagement skills (managed a group of 34 instructors to run a camp of 250 campers) Publications: \n\"MEMSEye\" for Optical 3D Position and Orientation Measurement - Secondary Author \n \nClosed Loop Control - \nPart of a team that developed a closed-loop PID control system, using an embedded system that drives MirrorcleTech's MEMS mirrors, and uses feedback from an optical sensor to complete the closed loop.  \n \nMirrorcle Technologies MCU Development Board - \nDeveloped and designed hardware, firmware and API for MirrorcleTech's MCU development board, which allows the user to control and drive MirrorcleTech's MEMS mirrors, drive a laser diode, and generate drive signals to analog outputs for other applications. The firmware and API offer a set of functions the user can request the MCU to perform to drive the MEMS mirror, drive the laser output, and control other settings such as filter frequency for on-board filters, enabling/disabling the on-board voltage supplies, etc. \n \nCircuit Design - Schematic and PCB Layout \nDesigned circuits for various applications such as high voltage amplifiers, Analog Input/Output boards that interface with FPGAs, and MCU controller boards. Tested circuit schematics in simulation, designed PCB layouts, created BOMs for these builds, performed QA, and provided user guides and documentation for all hardware.  \n \nOther Software skills: Classroom programming knowledge of Verilog and C/C++. Efficient in Microsoft Office, Adobe Photoshop and Illustrator, Multimedia Fusion Developer, and experience working on Windows XP, 7 and Vista, Mac OS X, and Ubuntu Linux. \n \nSpecialties: PSpice, Autocad, Cadence Layout Tools, Matlab, MultiSim and Ultiboard, Adobe Photoshop and Illustrator, Macromedia Fusion Developer 2, Microsoft Office, Computer Networking, EIT Certified \n \nManagement skills (managed a group of 34 instructors to run a camp of 250 campers) Publications: \n\"MEMSEye\" for Optical 3D Position and Orientation Measurement - Secondary Author \n \nClosed Loop Control - \nPart of a team that developed a closed-loop PID control system, using an embedded system that drives MirrorcleTech's MEMS mirrors, and uses feedback from an optical sensor to complete the closed loop.  \n \nMirrorcle Technologies MCU Development Board - \nDeveloped and designed hardware, firmware and API for MirrorcleTech's MCU development board, which allows the user to control and drive MirrorcleTech's MEMS mirrors, drive a laser diode, and generate drive signals to analog outputs for other applications. The firmware and API offer a set of functions the user can request the MCU to perform to drive the MEMS mirror, drive the laser output, and control other settings such as filter frequency for on-board filters, enabling/disabling the on-board voltage supplies, etc. \n \nCircuit Design - Schematic and PCB Layout \nDesigned circuits for various applications such as high voltage amplifiers, Analog Input/Output boards that interface with FPGAs, and MCU controller boards. Tested circuit schematics in simulation, designed PCB layouts, created BOMs for these builds, performed QA, and provided user guides and documentation for all hardware.  \n \nOther Software skills: Classroom programming knowledge of Verilog and C/C++. Efficient in Microsoft Office, Adobe Photoshop and Illustrator, Multimedia Fusion Developer, and experience working on Windows XP, 7 and Vista, Mac OS X, and Ubuntu Linux. \n \nSpecialties: PSpice, Autocad, Cadence Layout Tools, Matlab, MultiSim and Ultiboard, Adobe Photoshop and Illustrator, Macromedia Fusion Developer 2, Microsoft Office, Computer Networking, EIT Certified \n \nManagement skills (managed a group of 34 instructors to run a camp of 250 campers) Experience Electronics Engineer Mirrorcle Technologies, INC October 2010  – Present (4 years 11 months) Richmond, CA · Manage Mirrorcle’s MEMS driver and prototyping electronics manufacturing. \n· Manage Mirrorcle’s customer-specific testing of MEMS mirrors for 3D scanning application. \n· Perform schematic design and PCB layout of for microcontroller development boards, high voltage amplifiers, laser driving circuits, breakout boards to FGPAs development kits, etc. \n· Perform closed loop control system development for MEMS mirrors using LabView and Matlab. \n· Perform embedded system design to implement the closed loop control systems for MEMS mirrors. \n· Document Mirrorcle's in-house production and testing procedures. \n· Prepare and maintain user guides and other documents for various Mirrorcle Technologies products such as amplifiers, controller cards, development kits, etc. Director - St. Marys of Moraga, Assistant Director - Stanford University iD Tech Camps June 2005  –  September 2012  (7 years 4 months) I have worked for 5 years as Instructor with iD Tech, with 2 of those years as a Lead Instructor. I taught classes in 2D game design, RPG game design, Robotics, and Graphic Design. \n \nI have worked 2 seasons as Assistant Director at Stanford University, and 1 season as Director at St. Marys College of Moraga. I have also directed the beta test week of camp in April 2010. I managed a group of up to 34 instructors and overseeing a camp of around 250 students. \n \nTHIS POSITION IS SEASONAL - June to September (2005-2011) Student Ambassador San Jose State University March 2006  –  September 2009  (3 years 7 months) Performed Campus tours, promoted the university and updated university information \nCoordinated office tasks, conducted interviews, created training material, and coordinated training for new Student Ambassadors for spring 2008 and 2009 semesters Resident Advisor San Jose State University January 2007  –  May 2009  (2 years 5 months) Planned, coordinated and led activities for numbering between 10 and 100+ residents \nPromoted community development and engaged the residents in open forum discussions Intern Walker and Sako, LLP September 2006  –  September 2007  (1 year 1 month) Used CAD software to draft patent application diagrams of circuit elements\t \nFiled patent paper work \nPerformed administrative tasks Electronics Engineer Mirrorcle Technologies, INC October 2010  – Present (4 years 11 months) Richmond, CA · Manage Mirrorcle’s MEMS driver and prototyping electronics manufacturing. \n· Manage Mirrorcle’s customer-specific testing of MEMS mirrors for 3D scanning application. \n· Perform schematic design and PCB layout of for microcontroller development boards, high voltage amplifiers, laser driving circuits, breakout boards to FGPAs development kits, etc. \n· Perform closed loop control system development for MEMS mirrors using LabView and Matlab. \n· Perform embedded system design to implement the closed loop control systems for MEMS mirrors. \n· Document Mirrorcle's in-house production and testing procedures. \n· Prepare and maintain user guides and other documents for various Mirrorcle Technologies products such as amplifiers, controller cards, development kits, etc. Electronics Engineer Mirrorcle Technologies, INC October 2010  – Present (4 years 11 months) Richmond, CA · Manage Mirrorcle’s MEMS driver and prototyping electronics manufacturing. \n· Manage Mirrorcle’s customer-specific testing of MEMS mirrors for 3D scanning application. \n· Perform schematic design and PCB layout of for microcontroller development boards, high voltage amplifiers, laser driving circuits, breakout boards to FGPAs development kits, etc. \n· Perform closed loop control system development for MEMS mirrors using LabView and Matlab. \n· Perform embedded system design to implement the closed loop control systems for MEMS mirrors. \n· Document Mirrorcle's in-house production and testing procedures. \n· Prepare and maintain user guides and other documents for various Mirrorcle Technologies products such as amplifiers, controller cards, development kits, etc. Director - St. Marys of Moraga, Assistant Director - Stanford University iD Tech Camps June 2005  –  September 2012  (7 years 4 months) I have worked for 5 years as Instructor with iD Tech, with 2 of those years as a Lead Instructor. I taught classes in 2D game design, RPG game design, Robotics, and Graphic Design. \n \nI have worked 2 seasons as Assistant Director at Stanford University, and 1 season as Director at St. Marys College of Moraga. I have also directed the beta test week of camp in April 2010. I managed a group of up to 34 instructors and overseeing a camp of around 250 students. \n \nTHIS POSITION IS SEASONAL - June to September (2005-2011) Director - St. Marys of Moraga, Assistant Director - Stanford University iD Tech Camps June 2005  –  September 2012  (7 years 4 months) I have worked for 5 years as Instructor with iD Tech, with 2 of those years as a Lead Instructor. I taught classes in 2D game design, RPG game design, Robotics, and Graphic Design. \n \nI have worked 2 seasons as Assistant Director at Stanford University, and 1 season as Director at St. Marys College of Moraga. I have also directed the beta test week of camp in April 2010. I managed a group of up to 34 instructors and overseeing a camp of around 250 students. \n \nTHIS POSITION IS SEASONAL - June to September (2005-2011) Student Ambassador San Jose State University March 2006  –  September 2009  (3 years 7 months) Performed Campus tours, promoted the university and updated university information \nCoordinated office tasks, conducted interviews, created training material, and coordinated training for new Student Ambassadors for spring 2008 and 2009 semesters Student Ambassador San Jose State University March 2006  –  September 2009  (3 years 7 months) Performed Campus tours, promoted the university and updated university information \nCoordinated office tasks, conducted interviews, created training material, and coordinated training for new Student Ambassadors for spring 2008 and 2009 semesters Resident Advisor San Jose State University January 2007  –  May 2009  (2 years 5 months) Planned, coordinated and led activities for numbering between 10 and 100+ residents \nPromoted community development and engaged the residents in open forum discussions Resident Advisor San Jose State University January 2007  –  May 2009  (2 years 5 months) Planned, coordinated and led activities for numbering between 10 and 100+ residents \nPromoted community development and engaged the residents in open forum discussions Intern Walker and Sako, LLP September 2006  –  September 2007  (1 year 1 month) Used CAD software to draft patent application diagrams of circuit elements\t \nFiled patent paper work \nPerformed administrative tasks Intern Walker and Sako, LLP September 2006  –  September 2007  (1 year 1 month) Used CAD software to draft patent application diagrams of circuit elements\t \nFiled patent paper work \nPerformed administrative tasks Skills PCB Layout Schematic Capture Embedded Systems Microcontrollers Filter Design Amplifier Design DC-DC Circuits Matlab Labview Adobe Creative Suite Digital Photography Teaching Management - Summer... PCB design Camp Java Photoshop Pspice Testing See 4+     See less Skills  PCB Layout Schematic Capture Embedded Systems Microcontrollers Filter Design Amplifier Design DC-DC Circuits Matlab Labview Adobe Creative Suite Digital Photography Teaching Management - Summer... PCB design Camp Java Photoshop Pspice Testing See 4+     See less PCB Layout Schematic Capture Embedded Systems Microcontrollers Filter Design Amplifier Design DC-DC Circuits Matlab Labview Adobe Creative Suite Digital Photography Teaching Management - Summer... PCB design Camp Java Photoshop Pspice Testing See 4+     See less PCB Layout Schematic Capture Embedded Systems Microcontrollers Filter Design Amplifier Design DC-DC Circuits Matlab Labview Adobe Creative Suite Digital Photography Teaching Management - Summer... PCB design Camp Java Photoshop Pspice Testing See 4+     See less Education San Jose State University BSEE,  BS Electrical Engineering - Analog Electronics and IC Design 2004  – 2009 EIT (Engineering in Training) Completed as of January 2010 \n \nAdditional Coursework: Analog and Digital Communications (B+), Analog Filter Design (B-), Computer Networking (B), Digital CMOS Design (C+), Electronic Design I & II (B-, C), Electronics Test Design Engineering (B), Senior Design Project I & II (B+, A), Ordinary Differential Equations (A), Digital Design I & II, Linear Systems, Network Analysis, Physical Electronics, Operational Amplifiers. Activities and Societies:  Tau Delta Phi - Honors Society(President and Vice President) ,  Spartan Squad (Squad Lead) ,  IEEE member ,  Physics Club member ,  Student Ambassador Association (Founder and President) ,  Indian Student Association ,  Indian Student Organization ,  Resident Hall Association San Jose State University BSEE,  BS Electrical Engineering - Analog Electronics and IC Design 2004  – 2009 EIT (Engineering in Training) Completed as of January 2010 \n \nAdditional Coursework: Analog and Digital Communications (B+), Analog Filter Design (B-), Computer Networking (B), Digital CMOS Design (C+), Electronic Design I & II (B-, C), Electronics Test Design Engineering (B), Senior Design Project I & II (B+, A), Ordinary Differential Equations (A), Digital Design I & II, Linear Systems, Network Analysis, Physical Electronics, Operational Amplifiers. Activities and Societies:  Tau Delta Phi - Honors Society(President and Vice President) ,  Spartan Squad (Squad Lead) ,  IEEE member ,  Physics Club member ,  Student Ambassador Association (Founder and President) ,  Indian Student Association ,  Indian Student Organization ,  Resident Hall Association San Jose State University BSEE,  BS Electrical Engineering - Analog Electronics and IC Design 2004  – 2009 EIT (Engineering in Training) Completed as of January 2010 \n \nAdditional Coursework: Analog and Digital Communications (B+), Analog Filter Design (B-), Computer Networking (B), Digital CMOS Design (C+), Electronic Design I & II (B-, C), Electronics Test Design Engineering (B), Senior Design Project I & II (B+, A), Ordinary Differential Equations (A), Digital Design I & II, Linear Systems, Network Analysis, Physical Electronics, Operational Amplifiers. Activities and Societies:  Tau Delta Phi - Honors Society(President and Vice President) ,  Spartan Squad (Squad Lead) ,  IEEE member ,  Physics Club member ,  Student Ambassador Association (Founder and President) ,  Indian Student Association ,  Indian Student Organization ,  Resident Hall Association San Jose State University BSEE,  BS Electrical Engineering - Analog Electronics and IC Design 2004  – 2009 EIT (Engineering in Training) Completed as of January 2010 \n \nAdditional Coursework: Analog and Digital Communications (B+), Analog Filter Design (B-), Computer Networking (B), Digital CMOS Design (C+), Electronic Design I & II (B-, C), Electronics Test Design Engineering (B), Senior Design Project I & II (B+, A), Ordinary Differential Equations (A), Digital Design I & II, Linear Systems, Network Analysis, Physical Electronics, Operational Amplifiers. Activities and Societies:  Tau Delta Phi - Honors Society(President and Vice President) ,  Spartan Squad (Squad Lead) ,  IEEE member ,  Physics Club member ,  Student Ambassador Association (Founder and President) ,  Indian Student Association ,  Indian Student Organization ,  Resident Hall Association ", "Experience Assistant Director Stanford University March 1990  – Present (25 years 6 months) Adjunct Faculty Monterey Institute of International Studies January 2013  – Present (2 years 8 months) Assistant Director Stanford University March 1990  – Present (25 years 6 months) Assistant Director Stanford University March 1990  – Present (25 years 6 months) Adjunct Faculty Monterey Institute of International Studies January 2013  – Present (2 years 8 months) Adjunct Faculty Monterey Institute of International Studies January 2013  – Present (2 years 8 months) Skills Fulbright recipient to... International... Non-immigrant visas... Skills  Fulbright recipient to... International... Non-immigrant visas... Fulbright recipient to... International... Non-immigrant visas... Fulbright recipient to... International... Non-immigrant visas... Education Stanford University Master of Arts (MA),  International Development and Education Activities and Societies:  Fulbright Scholar 1993 - Germany\nFocused on International Education University of California, Irvine Bachelor's degree Stanford University Master of Arts (MA),  International Development and Education Activities and Societies:  Fulbright Scholar 1993 - Germany\nFocused on International Education Stanford University Master of Arts (MA),  International Development and Education Activities and Societies:  Fulbright Scholar 1993 - Germany\nFocused on International Education Stanford University Master of Arts (MA),  International Development and Education Activities and Societies:  Fulbright Scholar 1993 - Germany\nFocused on International Education University of California, Irvine Bachelor's degree University of California, Irvine Bachelor's degree University of California, Irvine Bachelor's degree ", "Skills International... Program Management Strategy Community Outreach connecting the dots Nonprofits Higher Education Leadership Skills  International... Program Management Strategy Community Outreach connecting the dots Nonprofits Higher Education Leadership International... Program Management Strategy Community Outreach connecting the dots Nonprofits Higher Education Leadership International... Program Management Strategy Community Outreach connecting the dots Nonprofits Higher Education Leadership ", "Skills Fundraising Nonprofits Strategy Research Public Speaking Grant Writing Higher Education Program Development Community Outreach Grants Data Analysis Philanthropy Skills  Fundraising Nonprofits Strategy Research Public Speaking Grant Writing Higher Education Program Development Community Outreach Grants Data Analysis Philanthropy Fundraising Nonprofits Strategy Research Public Speaking Grant Writing Higher Education Program Development Community Outreach Grants Data Analysis Philanthropy Fundraising Nonprofits Strategy Research Public Speaking Grant Writing Higher Education Program Development Community Outreach Grants Data Analysis Philanthropy ", "Experience Chief Program Officer Chicago Park District November 2011  – Present (3 years 10 months) Greater Chicago Area I am responsible for the largest department within the Chicago Park District. The Community Recreation Department focuses on the Park District's core mission of providing high quality leisure services to Chicago residents and visitors. The Community Recreation Department offers programs throughout the life course in athletics, aquatics, cultural arts, special events, general recreation, and environmental programming. Programs are offered city-wide within the South, Central, and North Regions. Chief Program Officer Chicago Park District November 2011  – Present (3 years 10 months) Greater Chicago Area I am responsible for the largest department within the Chicago Park District. The Community Recreation Department focuses on the Park District's core mission of providing high quality leisure services to Chicago residents and visitors. The Community Recreation Department offers programs throughout the life course in athletics, aquatics, cultural arts, special events, general recreation, and environmental programming. Programs are offered city-wide within the South, Central, and North Regions. Chief Program Officer Chicago Park District November 2011  – Present (3 years 10 months) Greater Chicago Area I am responsible for the largest department within the Chicago Park District. The Community Recreation Department focuses on the Park District's core mission of providing high quality leisure services to Chicago residents and visitors. The Community Recreation Department offers programs throughout the life course in athletics, aquatics, cultural arts, special events, general recreation, and environmental programming. Programs are offered city-wide within the South, Central, and North Regions. Skills Program Development Public Speaking Non-profits Education Policy Coaching Team Building Program Management Nonprofits Event Management Career Counseling Leadership Fundraising Staff Development Community Outreach Marketing Training Public Relations Strategy See 3+     See less Skills  Program Development Public Speaking Non-profits Education Policy Coaching Team Building Program Management Nonprofits Event Management Career Counseling Leadership Fundraising Staff Development Community Outreach Marketing Training Public Relations Strategy See 3+     See less Program Development Public Speaking Non-profits Education Policy Coaching Team Building Program Management Nonprofits Event Management Career Counseling Leadership Fundraising Staff Development Community Outreach Marketing Training Public Relations Strategy See 3+     See less Program Development Public Speaking Non-profits Education Policy Coaching Team Building Program Management Nonprofits Event Management Career Counseling Leadership Fundraising Staff Development Community Outreach Marketing Training Public Relations Strategy See 3+     See less Education Northwestern University MS,  Marital and Family Therapy 1998  – 2000 Stanford University BA,  Sociology 1990  – 1994 Activities and Societies:  Stanford Football ,  Kappa Alpha Psi Orchard Lake St. Mary's HS 1987  – 1990 Activities and Societies:  National Honor's Society ,  Football ,  Basketball ,  Track & Field Redford Bishop Borgess HS 1986  – 1986 Northwestern University MS,  Marital and Family Therapy 1998  – 2000 Northwestern University MS,  Marital and Family Therapy 1998  – 2000 Northwestern University MS,  Marital and Family Therapy 1998  – 2000 Stanford University BA,  Sociology 1990  – 1994 Activities and Societies:  Stanford Football ,  Kappa Alpha Psi Stanford University BA,  Sociology 1990  – 1994 Activities and Societies:  Stanford Football ,  Kappa Alpha Psi Stanford University BA,  Sociology 1990  – 1994 Activities and Societies:  Stanford Football ,  Kappa Alpha Psi Orchard Lake St. Mary's HS 1987  – 1990 Activities and Societies:  National Honor's Society ,  Football ,  Basketball ,  Track & Field Orchard Lake St. Mary's HS 1987  – 1990 Activities and Societies:  National Honor's Society ,  Football ,  Basketball ,  Track & Field Orchard Lake St. Mary's HS 1987  – 1990 Activities and Societies:  National Honor's Society ,  Football ,  Basketball ,  Track & Field Redford Bishop Borgess HS 1986  – 1986 Redford Bishop Borgess HS 1986  – 1986 Redford Bishop Borgess HS 1986  – 1986 ", "Experience Assistant Director Stanford University School of Medicine Assistant Director Stanford University School of Medicine Assistant Director Stanford University School of Medicine ", "Skills Outstanding Customer... Research and Reference Effective Communications Information Management Event Planning Program Management Collaborative Teamwork Teamwork Training Library Customer Service Research Skills  Outstanding Customer... Research and Reference Effective Communications Information Management Event Planning Program Management Collaborative Teamwork Teamwork Training Library Customer Service Research Outstanding Customer... Research and Reference Effective Communications Information Management Event Planning Program Management Collaborative Teamwork Teamwork Training Library Customer Service Research Outstanding Customer... Research and Reference Effective Communications Information Management Event Planning Program Management Collaborative Teamwork Teamwork Training Library Customer Service Research Honors & Awards ", "Experience Assistant Director Stanford University January 2014  – Present (1 year 8 months) Senior Financial Management Analyst Stanford University March 2007  – Present (8 years 6 months) On Campus Financial Application Analyst Dell Perot Systems 2005  –  2007  (2 years) Assistant Director Stanford University January 2014  – Present (1 year 8 months) Assistant Director Stanford University January 2014  – Present (1 year 8 months) Senior Financial Management Analyst Stanford University March 2007  – Present (8 years 6 months) On Campus Senior Financial Management Analyst Stanford University March 2007  – Present (8 years 6 months) On Campus Financial Application Analyst Dell Perot Systems 2005  –  2007  (2 years) Financial Application Analyst Dell Perot Systems 2005  –  2007  (2 years) ", "Experience Assistant Director Santa Clara University Leavey School of Business April 2009  – Present (6 years 5 months) Santa Clara, CA Career Coaching \n-Impact hundreds of MBA & MSIS students/alumni through 1:1 coaching sessions on all aspects of career management \n- Created & implemented Job Search Groups, providing a forum for students/alumni to move the job search forward, receive support & build networks \n- Oversee annual resume review process for over 100+ graduate students. Track requests, coordinate with consultants; personally conduct reviews. \n- Manage the implementation of business self-assessment tool, CareerLeader, used by 200 students annually in 1:1 sessions & workshops \n \nProgram Management \n- Create career plan & conduct over 15 events per quarter; work with outside consultants to deliver content; market events to students & manage logistics \n- Collaborate with Director to create & execute Career Conference, educating students about careers & industries, & bi-annual Networking Nights to connect employers, alumni & students \n- Co-developed annual summer “Bridges Experiential Learning” program matching MBA students \nwith organizations, providing experience to over 100 students in five years  \n- Introduced new programs such as quarterly new student orientation, webinars for international \nstudents, mock interviews & On Campus Interview prep \n \nCorporate Outreach & Communications \n- Build corporate relationships resulting in employers recruiting on campus, attending events, posting jobs & hiring students; collaborate with the Career Center for On Campus Interviewing  \n- Serve as first point of contact for students & employers, responding to all inquiries about resources  \n- Write quarterly student email newsletter for, weekly Linked In and Facebook posts, website content \n \nOperations  \n- Kept GBCM running for 8 months after Director left; recognized by the Assistant Dean for \ndedication to the students & school during search for new Director  \n- Create & write processes for office operations to preserve institutional knowledge \n- Manage office operations, technology tools & train staff & student workers Independent Career Counselor Kelly Walsh Career Counseling January 2009  – Present (6 years 8 months) San Francisco Bay Area - Coach clients with all aspects of the job search: self-assessment, job search tactics, networking, job search tools and resources, resume, interviewing, negotiating Facilitator-Women in Management Program Stanford University Graduate School of Business September 2006  – Present (9 years) Stanford, CA - Facilitate bi-weekly meetings during academic year with groups of five to seven MBA women, providing a forum for students to give and receive personal support in confidential setting  \n- Volunteered to Faculty Director to serve as Community Manager for 15 WIM facilitators, creating an \nonline community to communicate best practices and meet virtually Assistant Director Stanford University January 2000  –  January 2009  (9 years 1 month) Stanford, CA Career Advising and Education \n- Conducted 125+ career advising sessions annually with MBA students and Alumni, providing guidance throughout job search process with self-assessment, job search tactics, networking contacts, resources and strategic career management  \n- Facilitated student success teams giving students structure and support in the job search  \n- Led workshops on topics such as MBTI, resume writing, cover letters, interviewing, negotiating, and targeted job search strategies \n \nEmployer Relations and Outreach  \n- Acquired in-depth knowledge of MBA opportunities, across multiple industries, by contacting \nemployers to establish and build relationships \n- Oversaw entire On Campus Recruiting process including planning and scheduling all campus \ninterviews, employer presentations, and mitigating conflicts between recruiters and students \n- Advised employers on recruiting strategies and best practices for GSB students  \n- Planned and executed High Tech and Spring Career Fairs, working with CMC staff and student clubs  \n- Partnered with Women in Management, High Tech and Consulting Clubs; provided support for \nevents to students and employers, traveled with students on treks to build relationships with employers and provide exposure for job opportunities \n \nProgram Management  \nResume Reviews  \n• Created resume template, a requirement for all incoming MBA students. Developed process to review resumes during summer and managed distribution, review and tracking \n- Recruited GSB staff and hired external consultants to conduct 360 resume reviews in five-day period for inclusion in annual Resume Book  \n \nFirst Contact Program  \n- Developed and led program for each first year MBA to be assigned to an advisor for initial session \nand subsequent follow up throughout the two-year program; enabled staff to efficiently follow up \nwith students on placement information \n- Acknowledged among top five business schools as providing the most personalized services to \nstudents Marketing Manager Silicon Graphics, Inc. (SGI) 1990  –  1998  (8 years) Mountain View, CA Senior Order Administrator Mips Computer Systems September 1990  –  July 1992  (1 year 11 months) Sunnyvale, CA Responsible for order processing for the Asia Pacific, Canada and Latin American regions. Order Administration Stardent Computer 1988  –  1990  (2 years) Sunnyvale, CA Assistant Director Santa Clara University Leavey School of Business April 2009  – Present (6 years 5 months) Santa Clara, CA Career Coaching \n-Impact hundreds of MBA & MSIS students/alumni through 1:1 coaching sessions on all aspects of career management \n- Created & implemented Job Search Groups, providing a forum for students/alumni to move the job search forward, receive support & build networks \n- Oversee annual resume review process for over 100+ graduate students. Track requests, coordinate with consultants; personally conduct reviews. \n- Manage the implementation of business self-assessment tool, CareerLeader, used by 200 students annually in 1:1 sessions & workshops \n \nProgram Management \n- Create career plan & conduct over 15 events per quarter; work with outside consultants to deliver content; market events to students & manage logistics \n- Collaborate with Director to create & execute Career Conference, educating students about careers & industries, & bi-annual Networking Nights to connect employers, alumni & students \n- Co-developed annual summer “Bridges Experiential Learning” program matching MBA students \nwith organizations, providing experience to over 100 students in five years  \n- Introduced new programs such as quarterly new student orientation, webinars for international \nstudents, mock interviews & On Campus Interview prep \n \nCorporate Outreach & Communications \n- Build corporate relationships resulting in employers recruiting on campus, attending events, posting jobs & hiring students; collaborate with the Career Center for On Campus Interviewing  \n- Serve as first point of contact for students & employers, responding to all inquiries about resources  \n- Write quarterly student email newsletter for, weekly Linked In and Facebook posts, website content \n \nOperations  \n- Kept GBCM running for 8 months after Director left; recognized by the Assistant Dean for \ndedication to the students & school during search for new Director  \n- Create & write processes for office operations to preserve institutional knowledge \n- Manage office operations, technology tools & train staff & student workers Assistant Director Santa Clara University Leavey School of Business April 2009  – Present (6 years 5 months) Santa Clara, CA Career Coaching \n-Impact hundreds of MBA & MSIS students/alumni through 1:1 coaching sessions on all aspects of career management \n- Created & implemented Job Search Groups, providing a forum for students/alumni to move the job search forward, receive support & build networks \n- Oversee annual resume review process for over 100+ graduate students. Track requests, coordinate with consultants; personally conduct reviews. \n- Manage the implementation of business self-assessment tool, CareerLeader, used by 200 students annually in 1:1 sessions & workshops \n \nProgram Management \n- Create career plan & conduct over 15 events per quarter; work with outside consultants to deliver content; market events to students & manage logistics \n- Collaborate with Director to create & execute Career Conference, educating students about careers & industries, & bi-annual Networking Nights to connect employers, alumni & students \n- Co-developed annual summer “Bridges Experiential Learning” program matching MBA students \nwith organizations, providing experience to over 100 students in five years  \n- Introduced new programs such as quarterly new student orientation, webinars for international \nstudents, mock interviews & On Campus Interview prep \n \nCorporate Outreach & Communications \n- Build corporate relationships resulting in employers recruiting on campus, attending events, posting jobs & hiring students; collaborate with the Career Center for On Campus Interviewing  \n- Serve as first point of contact for students & employers, responding to all inquiries about resources  \n- Write quarterly student email newsletter for, weekly Linked In and Facebook posts, website content \n \nOperations  \n- Kept GBCM running for 8 months after Director left; recognized by the Assistant Dean for \ndedication to the students & school during search for new Director  \n- Create & write processes for office operations to preserve institutional knowledge \n- Manage office operations, technology tools & train staff & student workers Independent Career Counselor Kelly Walsh Career Counseling January 2009  – Present (6 years 8 months) San Francisco Bay Area - Coach clients with all aspects of the job search: self-assessment, job search tactics, networking, job search tools and resources, resume, interviewing, negotiating Independent Career Counselor Kelly Walsh Career Counseling January 2009  – Present (6 years 8 months) San Francisco Bay Area - Coach clients with all aspects of the job search: self-assessment, job search tactics, networking, job search tools and resources, resume, interviewing, negotiating Facilitator-Women in Management Program Stanford University Graduate School of Business September 2006  – Present (9 years) Stanford, CA - Facilitate bi-weekly meetings during academic year with groups of five to seven MBA women, providing a forum for students to give and receive personal support in confidential setting  \n- Volunteered to Faculty Director to serve as Community Manager for 15 WIM facilitators, creating an \nonline community to communicate best practices and meet virtually Facilitator-Women in Management Program Stanford University Graduate School of Business September 2006  – Present (9 years) Stanford, CA - Facilitate bi-weekly meetings during academic year with groups of five to seven MBA women, providing a forum for students to give and receive personal support in confidential setting  \n- Volunteered to Faculty Director to serve as Community Manager for 15 WIM facilitators, creating an \nonline community to communicate best practices and meet virtually Assistant Director Stanford University January 2000  –  January 2009  (9 years 1 month) Stanford, CA Career Advising and Education \n- Conducted 125+ career advising sessions annually with MBA students and Alumni, providing guidance throughout job search process with self-assessment, job search tactics, networking contacts, resources and strategic career management  \n- Facilitated student success teams giving students structure and support in the job search  \n- Led workshops on topics such as MBTI, resume writing, cover letters, interviewing, negotiating, and targeted job search strategies \n \nEmployer Relations and Outreach  \n- Acquired in-depth knowledge of MBA opportunities, across multiple industries, by contacting \nemployers to establish and build relationships \n- Oversaw entire On Campus Recruiting process including planning and scheduling all campus \ninterviews, employer presentations, and mitigating conflicts between recruiters and students \n- Advised employers on recruiting strategies and best practices for GSB students  \n- Planned and executed High Tech and Spring Career Fairs, working with CMC staff and student clubs  \n- Partnered with Women in Management, High Tech and Consulting Clubs; provided support for \nevents to students and employers, traveled with students on treks to build relationships with employers and provide exposure for job opportunities \n \nProgram Management  \nResume Reviews  \n• Created resume template, a requirement for all incoming MBA students. Developed process to review resumes during summer and managed distribution, review and tracking \n- Recruited GSB staff and hired external consultants to conduct 360 resume reviews in five-day period for inclusion in annual Resume Book  \n \nFirst Contact Program  \n- Developed and led program for each first year MBA to be assigned to an advisor for initial session \nand subsequent follow up throughout the two-year program; enabled staff to efficiently follow up \nwith students on placement information \n- Acknowledged among top five business schools as providing the most personalized services to \nstudents Assistant Director Stanford University January 2000  –  January 2009  (9 years 1 month) Stanford, CA Career Advising and Education \n- Conducted 125+ career advising sessions annually with MBA students and Alumni, providing guidance throughout job search process with self-assessment, job search tactics, networking contacts, resources and strategic career management  \n- Facilitated student success teams giving students structure and support in the job search  \n- Led workshops on topics such as MBTI, resume writing, cover letters, interviewing, negotiating, and targeted job search strategies \n \nEmployer Relations and Outreach  \n- Acquired in-depth knowledge of MBA opportunities, across multiple industries, by contacting \nemployers to establish and build relationships \n- Oversaw entire On Campus Recruiting process including planning and scheduling all campus \ninterviews, employer presentations, and mitigating conflicts between recruiters and students \n- Advised employers on recruiting strategies and best practices for GSB students  \n- Planned and executed High Tech and Spring Career Fairs, working with CMC staff and student clubs  \n- Partnered with Women in Management, High Tech and Consulting Clubs; provided support for \nevents to students and employers, traveled with students on treks to build relationships with employers and provide exposure for job opportunities \n \nProgram Management  \nResume Reviews  \n• Created resume template, a requirement for all incoming MBA students. Developed process to review resumes during summer and managed distribution, review and tracking \n- Recruited GSB staff and hired external consultants to conduct 360 resume reviews in five-day period for inclusion in annual Resume Book  \n \nFirst Contact Program  \n- Developed and led program for each first year MBA to be assigned to an advisor for initial session \nand subsequent follow up throughout the two-year program; enabled staff to efficiently follow up \nwith students on placement information \n- Acknowledged among top five business schools as providing the most personalized services to \nstudents Marketing Manager Silicon Graphics, Inc. (SGI) 1990  –  1998  (8 years) Mountain View, CA Marketing Manager Silicon Graphics, Inc. (SGI) 1990  –  1998  (8 years) Mountain View, CA Senior Order Administrator Mips Computer Systems September 1990  –  July 1992  (1 year 11 months) Sunnyvale, CA Responsible for order processing for the Asia Pacific, Canada and Latin American regions. Senior Order Administrator Mips Computer Systems September 1990  –  July 1992  (1 year 11 months) Sunnyvale, CA Responsible for order processing for the Asia Pacific, Canada and Latin American regions. Order Administration Stardent Computer 1988  –  1990  (2 years) Sunnyvale, CA Order Administration Stardent Computer 1988  –  1990  (2 years) Sunnyvale, CA Skills Career Counseling Career Management Program Management Strategy Recruiting Higher Education... Resume Writing Coaching Team Building Student Affairs Leadership Development Staff Development Public Speaking Job Coaching Building Relationships Training Job Search Strategies Mock Interviews Career Assessment Workshop Facilitation Career Development... Training Delivery Cross-functional Team... Executive Coaching MBTI Certified See 10+     See less Skills  Career Counseling Career Management Program Management Strategy Recruiting Higher Education... Resume Writing Coaching Team Building Student Affairs Leadership Development Staff Development Public Speaking Job Coaching Building Relationships Training Job Search Strategies Mock Interviews Career Assessment Workshop Facilitation Career Development... Training Delivery Cross-functional Team... Executive Coaching MBTI Certified See 10+     See less Career Counseling Career Management Program Management Strategy Recruiting Higher Education... Resume Writing Coaching Team Building Student Affairs Leadership Development Staff Development Public Speaking Job Coaching Building Relationships Training Job Search Strategies Mock Interviews Career Assessment Workshop Facilitation Career Development... Training Delivery Cross-functional Team... Executive Coaching MBTI Certified See 10+     See less Career Counseling Career Management Program Management Strategy Recruiting Higher Education... Resume Writing Coaching Team Building Student Affairs Leadership Development Staff Development Public Speaking Job Coaching Building Relationships Training Job Search Strategies Mock Interviews Career Assessment Workshop Facilitation Career Development... Training Delivery Cross-functional Team... Executive Coaching MBTI Certified See 10+     See less Education Santa Clara University MA,  Counseling 1998  – 2001 University of California, Los Angeles BA,  Psychology with an Emphasis in Business Saint Francis High School Santa Clara University MA,  Counseling 1998  – 2001 Santa Clara University MA,  Counseling 1998  – 2001 Santa Clara University MA,  Counseling 1998  – 2001 University of California, Los Angeles BA,  Psychology with an Emphasis in Business University of California, Los Angeles BA,  Psychology with an Emphasis in Business University of California, Los Angeles BA,  Psychology with an Emphasis in Business Saint Francis High School Saint Francis High School Saint Francis High School ", "Skills Strategy Recruiting Leadership Start-ups Management Entrepreneurship Networking Program Management Research Project Management Public Speaking Event Planning Social Media Data Analysis Organizational... Product Management Nonprofits Fundraising Strategic Planning Program Development See 5+     See less Skills  Strategy Recruiting Leadership Start-ups Management Entrepreneurship Networking Program Management Research Project Management Public Speaking Event Planning Social Media Data Analysis Organizational... Product Management Nonprofits Fundraising Strategic Planning Program Development See 5+     See less Strategy Recruiting Leadership Start-ups Management Entrepreneurship Networking Program Management Research Project Management Public Speaking Event Planning Social Media Data Analysis Organizational... Product Management Nonprofits Fundraising Strategic Planning Program Development See 5+     See less Strategy Recruiting Leadership Start-ups Management Entrepreneurship Networking Program Management Research Project Management Public Speaking Event Planning Social Media Data Analysis Organizational... Product Management Nonprofits Fundraising Strategic Planning Program Development See 5+     See less "]}