{"position": "Associate Dean", "company": "Stanford University", "profiles": ["Experience Associate Dean Stanford University Associate Dean Stanford University Associate Dean Stanford University Education Stanford University M.A. University of Chicago M.A. University of Michigan Stanford University M.A. Stanford University M.A. Stanford University M.A. University of Chicago M.A. University of Chicago M.A. University of Chicago M.A. University of Michigan University of Michigan University of Michigan ", "Experience Associate Dean Stanford University School of Education February 2005  – Present (10 years 7 months) Set the vision, strategy and facilitate the execution of alumni relations and development in the Stanford Graduate School of Education. Independently and in partnership with the Dean, build relationships with the school's most generous volunteers and prospective supporters. Coach and manage a highly-productive and collaborative seven-member team. Partner with the Dean to articulate the school's goals and objectives and translate them into fund raising objectives. Be accountable for setting and achieving the school's fund raising goals. Coordinate and integrate the school's alumni relations and fund raising objectives into the broader goals and objectives of the university. Associate Dean Stanford University School of Education February 2005  – Present (10 years 7 months) Set the vision, strategy and facilitate the execution of alumni relations and development in the Stanford Graduate School of Education. Independently and in partnership with the Dean, build relationships with the school's most generous volunteers and prospective supporters. Coach and manage a highly-productive and collaborative seven-member team. Partner with the Dean to articulate the school's goals and objectives and translate them into fund raising objectives. Be accountable for setting and achieving the school's fund raising goals. Coordinate and integrate the school's alumni relations and fund raising objectives into the broader goals and objectives of the university. Associate Dean Stanford University School of Education February 2005  – Present (10 years 7 months) Set the vision, strategy and facilitate the execution of alumni relations and development in the Stanford Graduate School of Education. Independently and in partnership with the Dean, build relationships with the school's most generous volunteers and prospective supporters. Coach and manage a highly-productive and collaborative seven-member team. Partner with the Dean to articulate the school's goals and objectives and translate them into fund raising objectives. Be accountable for setting and achieving the school's fund raising goals. Coordinate and integrate the school's alumni relations and fund raising objectives into the broader goals and objectives of the university. Skills Grant Writing Higher Education Stewardship Alumni Relations Volunteer Management Fundraising Nonprofits Program Development Philanthropy Research Annual Giving Teaching Community Outreach Grants Editing Strategic Planning Board Development Student Development Student Affairs Higher Education... Program Evaluation Academic Advising Admissions See 8+     See less Skills  Grant Writing Higher Education Stewardship Alumni Relations Volunteer Management Fundraising Nonprofits Program Development Philanthropy Research Annual Giving Teaching Community Outreach Grants Editing Strategic Planning Board Development Student Development Student Affairs Higher Education... Program Evaluation Academic Advising Admissions See 8+     See less Grant Writing Higher Education Stewardship Alumni Relations Volunteer Management Fundraising Nonprofits Program Development Philanthropy Research Annual Giving Teaching Community Outreach Grants Editing Strategic Planning Board Development Student Development Student Affairs Higher Education... Program Evaluation Academic Advising Admissions See 8+     See less Grant Writing Higher Education Stewardship Alumni Relations Volunteer Management Fundraising Nonprofits Program Development Philanthropy Research Annual Giving Teaching Community Outreach Grants Editing Strategic Planning Board Development Student Development Student Affairs Higher Education... Program Evaluation Academic Advising Admissions See 8+     See less Honors & Awards Crystal Apple Award for Outstanding Teaching Council for the Advancement and Support of Education (CASE) June 2011 Crystal Apple Award for Outstanding Teaching Council for the Advancement and Support of Education (CASE) June 2011 Crystal Apple Award for Outstanding Teaching Council for the Advancement and Support of Education (CASE) June 2011 Crystal Apple Award for Outstanding Teaching Council for the Advancement and Support of Education (CASE) June 2011 ", "Summary Strategic partner and chief administrative officer for Stanford's School of Earth Sciences. Work closely with Dean and other school leaders to guide and nurture the development of the organization. Oversee all operational areas, including finance, HR, IT, research administration, compliance, facilities, as well as several programmatic areas.  \n \nMy goal is to transition to a senior position in a foundation or other non-profit organization in Northern California. Specialties:strategic planning and implementation, change management, strong general management skills Summary Strategic partner and chief administrative officer for Stanford's School of Earth Sciences. Work closely with Dean and other school leaders to guide and nurture the development of the organization. Oversee all operational areas, including finance, HR, IT, research administration, compliance, facilities, as well as several programmatic areas.  \n \nMy goal is to transition to a senior position in a foundation or other non-profit organization in Northern California. Specialties:strategic planning and implementation, change management, strong general management skills Strategic partner and chief administrative officer for Stanford's School of Earth Sciences. Work closely with Dean and other school leaders to guide and nurture the development of the organization. Oversee all operational areas, including finance, HR, IT, research administration, compliance, facilities, as well as several programmatic areas.  \n \nMy goal is to transition to a senior position in a foundation or other non-profit organization in Northern California. Specialties:strategic planning and implementation, change management, strong general management skills Strategic partner and chief administrative officer for Stanford's School of Earth Sciences. Work closely with Dean and other school leaders to guide and nurture the development of the organization. Oversee all operational areas, including finance, HR, IT, research administration, compliance, facilities, as well as several programmatic areas.  \n \nMy goal is to transition to a senior position in a foundation or other non-profit organization in Northern California. Specialties:strategic planning and implementation, change management, strong general management skills Experience Senior Associate Dean, Finance & Administration Stanford University, School of Earth, Energy and Environmental Sciences March 1998  – Present (17 years 6 months) Associate Director The Institute for International Studies, Stanford University May 1991  –  March 1998  (6 years 11 months) Administrative Services Manager Vice President for Business & Finance, Stanford University June 1986  –  May 1991  (5 years) Senior Associate Dean, Finance & Administration Stanford University, School of Earth, Energy and Environmental Sciences March 1998  – Present (17 years 6 months) Senior Associate Dean, Finance & Administration Stanford University, School of Earth, Energy and Environmental Sciences March 1998  – Present (17 years 6 months) Associate Director The Institute for International Studies, Stanford University May 1991  –  March 1998  (6 years 11 months) Associate Director The Institute for International Studies, Stanford University May 1991  –  March 1998  (6 years 11 months) Administrative Services Manager Vice President for Business & Finance, Stanford University June 1986  –  May 1991  (5 years) Administrative Services Manager Vice President for Business & Finance, Stanford University June 1986  –  May 1991  (5 years) Education Binghamton University 1978  – 1982 Binghamton University 1978  – 1982 Binghamton University 1978  – 1982 Binghamton University 1978  – 1982 ", "Experience Sr. Associate Dean for Finance and Administration Stanford University March 2009  – Present (6 years 6 months) Stanford University School of Education Sr. Associate Dean for Finance and Administration Stanford University March 2009  – Present (6 years 6 months) Stanford University School of Education Sr. Associate Dean for Finance and Administration Stanford University March 2009  – Present (6 years 6 months) Stanford University School of Education Education University of California, Berkeley 1984  – 1988 University of California, Berkeley 1984  – 1988 University of California, Berkeley 1984  – 1988 University of California, Berkeley 1984  – 1988 ", "Summary Specialize in developing internet-based programs for consumer and business audiences, with a special emphasis on e-learning. Summary Specialize in developing internet-based programs for consumer and business audiences, with a special emphasis on e-learning. Specialize in developing internet-based programs for consumer and business audiences, with a special emphasis on e-learning. Specialize in developing internet-based programs for consumer and business audiences, with a special emphasis on e-learning. Experience Director & Associate Dean Stanford University April 2006  – Present (9 years 5 months) Founder/Editor Open Culture March 2006  – Present (9 years 6 months) Managing Director; Director of Online Programs AllLearn (e-Learning Consortium of Stanford, Oxford, and Yale) April 2001  –  July 2005  (4 years 4 months) Director of Business Development; Editorial Manager About.com February 1999  –  April 2001  (2 years 3 months) Director of Research Magna Consulting January 1998  –  February 1999  (1 year 2 months) Consultant (Freelance) Sucherman Consulting Group October 1996  –  November 1997  (1 year 2 months) Consultant (Freelance) The G7 Group May 1995  –  June 1996  (1 year 2 months) Director & Associate Dean Stanford University April 2006  – Present (9 years 5 months) Director & Associate Dean Stanford University April 2006  – Present (9 years 5 months) Founder/Editor Open Culture March 2006  – Present (9 years 6 months) Founder/Editor Open Culture March 2006  – Present (9 years 6 months) Managing Director; Director of Online Programs AllLearn (e-Learning Consortium of Stanford, Oxford, and Yale) April 2001  –  July 2005  (4 years 4 months) Managing Director; Director of Online Programs AllLearn (e-Learning Consortium of Stanford, Oxford, and Yale) April 2001  –  July 2005  (4 years 4 months) Director of Business Development; Editorial Manager About.com February 1999  –  April 2001  (2 years 3 months) Director of Business Development; Editorial Manager About.com February 1999  –  April 2001  (2 years 3 months) Director of Research Magna Consulting January 1998  –  February 1999  (1 year 2 months) Director of Research Magna Consulting January 1998  –  February 1999  (1 year 2 months) Consultant (Freelance) Sucherman Consulting Group October 1996  –  November 1997  (1 year 2 months) Consultant (Freelance) Sucherman Consulting Group October 1996  –  November 1997  (1 year 2 months) Consultant (Freelance) The G7 Group May 1995  –  June 1996  (1 year 2 months) Consultant (Freelance) The G7 Group May 1995  –  June 1996  (1 year 2 months) Skills Higher Education Curriculum Design Curriculum Development Adult Education Staff Development Courses Instructional Technology Instructional Design Editing Qualitative Research Educational Technology University Teaching Research Lecturing Grant Writing E-Learning History See 2+     See less Skills  Higher Education Curriculum Design Curriculum Development Adult Education Staff Development Courses Instructional Technology Instructional Design Editing Qualitative Research Educational Technology University Teaching Research Lecturing Grant Writing E-Learning History See 2+     See less Higher Education Curriculum Design Curriculum Development Adult Education Staff Development Courses Instructional Technology Instructional Design Editing Qualitative Research Educational Technology University Teaching Research Lecturing Grant Writing E-Learning History See 2+     See less Higher Education Curriculum Design Curriculum Development Adult Education Staff Development Courses Instructional Technology Instructional Design Editing Qualitative Research Educational Technology University Teaching Research Lecturing Grant Writing E-Learning History See 2+     See less Education Stanford University Ph.D. 1997 Stanford University MA 1991  – 1993 University of Wisconsin-Madison B.A.,  History September 1986  – June 1990 Stanford University Ph.D. 1997 Stanford University Ph.D. 1997 Stanford University Ph.D. 1997 Stanford University MA 1991  – 1993 Stanford University MA 1991  – 1993 Stanford University MA 1991  – 1993 University of Wisconsin-Madison B.A.,  History September 1986  – June 1990 University of Wisconsin-Madison B.A.,  History September 1986  – June 1990 University of Wisconsin-Madison B.A.,  History September 1986  – June 1990 ", "Experience Co-Founder and Principal Course Gateway February 2013  – Present (2 years 7 months) Washington, DC Deputy General Counsel United BioSource Corporation 2008  –  January 2013  (5 years) Deputy General Counsel LECG 2004  –  2008  (4 years) General Counsel The Washington Advisory Group 2001  –  2004  (3 years) General Counsel Health Care Financial Partners REIT 1998  –  2001  (3 years) Associate Dean Stanford University School of Medicine 1994  –  1998  (4 years) Co-Founder and Principal Course Gateway February 2013  – Present (2 years 7 months) Washington, DC Co-Founder and Principal Course Gateway February 2013  – Present (2 years 7 months) Washington, DC Deputy General Counsel United BioSource Corporation 2008  –  January 2013  (5 years) Deputy General Counsel United BioSource Corporation 2008  –  January 2013  (5 years) Deputy General Counsel LECG 2004  –  2008  (4 years) Deputy General Counsel LECG 2004  –  2008  (4 years) General Counsel The Washington Advisory Group 2001  –  2004  (3 years) General Counsel The Washington Advisory Group 2001  –  2004  (3 years) General Counsel Health Care Financial Partners REIT 1998  –  2001  (3 years) General Counsel Health Care Financial Partners REIT 1998  –  2001  (3 years) Associate Dean Stanford University School of Medicine 1994  –  1998  (4 years) Associate Dean Stanford University School of Medicine 1994  –  1998  (4 years) Skills Pharmaceutical Industry Intellectual Property Regulatory Affairs Licensing Corporate Law Venture Capital Clinical Trials Biotechnology Managed Care Public Policy Private Equity Start-ups Lifesciences Strategic Planning Commercial Real Estate Contract Negotiation Contract Management Higher Education... See 3+     See less Skills  Pharmaceutical Industry Intellectual Property Regulatory Affairs Licensing Corporate Law Venture Capital Clinical Trials Biotechnology Managed Care Public Policy Private Equity Start-ups Lifesciences Strategic Planning Commercial Real Estate Contract Negotiation Contract Management Higher Education... See 3+     See less Pharmaceutical Industry Intellectual Property Regulatory Affairs Licensing Corporate Law Venture Capital Clinical Trials Biotechnology Managed Care Public Policy Private Equity Start-ups Lifesciences Strategic Planning Commercial Real Estate Contract Negotiation Contract Management Higher Education... See 3+     See less Pharmaceutical Industry Intellectual Property Regulatory Affairs Licensing Corporate Law Venture Capital Clinical Trials Biotechnology Managed Care Public Policy Private Equity Start-ups Lifesciences Strategic Planning Commercial Real Estate Contract Negotiation Contract Management Higher Education... See 3+     See less Education The Johns Hopkins University BA,  Economics University of Pennsylvania J.D. The Johns Hopkins University BA,  Economics The Johns Hopkins University BA,  Economics The Johns Hopkins University BA,  Economics University of Pennsylvania J.D. University of Pennsylvania J.D. University of Pennsylvania J.D. ", "Experience Associate Dean Stanford University February 2010  – Present (5 years 7 months) Palo Alto, CA Assistant Dean and Director Drexel University November 2007  –  February 2010  (2 years 4 months) Philadelphia, PA Associate Director Drexel University August 2006  –  November 2007  (1 year 4 months) Philadelphia, PA Assistant Director/Resident Director Drexel University July 2005  –  August 2006  (1 year 2 months) Philadelphia, PA Community Director and Fraternity & Sorority Life Advisor Dartmouth College August 2003  –  July 2005  (2 years) Hanover, NH Area Director of Summer Conference Housing Texas Christian University July 2002  –  December 2003  (1 year 6 months) Fort Worth, TX Residence Hall Director Texas Christian University January 2000  –  December 2003  (4 years) Fort Worth, TX English as a Second Language Teacher Keller Independent School District January 2003  –  August 2003  (8 months) Keller, TX Associate Dean Stanford University February 2010  – Present (5 years 7 months) Palo Alto, CA Associate Dean Stanford University February 2010  – Present (5 years 7 months) Palo Alto, CA Assistant Dean and Director Drexel University November 2007  –  February 2010  (2 years 4 months) Philadelphia, PA Assistant Dean and Director Drexel University November 2007  –  February 2010  (2 years 4 months) Philadelphia, PA Associate Director Drexel University August 2006  –  November 2007  (1 year 4 months) Philadelphia, PA Associate Director Drexel University August 2006  –  November 2007  (1 year 4 months) Philadelphia, PA Assistant Director/Resident Director Drexel University July 2005  –  August 2006  (1 year 2 months) Philadelphia, PA Assistant Director/Resident Director Drexel University July 2005  –  August 2006  (1 year 2 months) Philadelphia, PA Community Director and Fraternity & Sorority Life Advisor Dartmouth College August 2003  –  July 2005  (2 years) Hanover, NH Community Director and Fraternity & Sorority Life Advisor Dartmouth College August 2003  –  July 2005  (2 years) Hanover, NH Area Director of Summer Conference Housing Texas Christian University July 2002  –  December 2003  (1 year 6 months) Fort Worth, TX Area Director of Summer Conference Housing Texas Christian University July 2002  –  December 2003  (1 year 6 months) Fort Worth, TX Residence Hall Director Texas Christian University January 2000  –  December 2003  (4 years) Fort Worth, TX Residence Hall Director Texas Christian University January 2000  –  December 2003  (4 years) Fort Worth, TX English as a Second Language Teacher Keller Independent School District January 2003  –  August 2003  (8 months) Keller, TX English as a Second Language Teacher Keller Independent School District January 2003  –  August 2003  (8 months) Keller, TX Skills Higher Education Student Affairs Student Development Curriculum Development Teaching Academic Advising Career Counseling Community Outreach Curriculum Design Distance Learning Event Planning Grant Writing Instructional Technology Program Development Public Speaking University Teaching See 1+     See less Skills  Higher Education Student Affairs Student Development Curriculum Development Teaching Academic Advising Career Counseling Community Outreach Curriculum Design Distance Learning Event Planning Grant Writing Instructional Technology Program Development Public Speaking University Teaching See 1+     See less Higher Education Student Affairs Student Development Curriculum Development Teaching Academic Advising Career Counseling Community Outreach Curriculum Design Distance Learning Event Planning Grant Writing Instructional Technology Program Development Public Speaking University Teaching See 1+     See less Higher Education Student Affairs Student Development Curriculum Development Teaching Academic Advising Career Counseling Community Outreach Curriculum Design Distance Learning Event Planning Grant Writing Instructional Technology Program Development Public Speaking University Teaching See 1+     See less Education Drexel University Doctor of Philosophy (Ph.D.),  Educational Leadership and Learning Technology 2006  – 2011 Texas Christian University Master's Degree,  Counselor Education/School Counseling and Guidance Services 2000  – 2002 Texas Christian University Bachelor's Degree,  English ,  History & Secondary Education 1996  – 1999 Drexel University Doctor of Philosophy (Ph.D.),  Educational Leadership and Learning Technology 2006  – 2011 Drexel University Doctor of Philosophy (Ph.D.),  Educational Leadership and Learning Technology 2006  – 2011 Drexel University Doctor of Philosophy (Ph.D.),  Educational Leadership and Learning Technology 2006  – 2011 Texas Christian University Master's Degree,  Counselor Education/School Counseling and Guidance Services 2000  – 2002 Texas Christian University Master's Degree,  Counselor Education/School Counseling and Guidance Services 2000  – 2002 Texas Christian University Master's Degree,  Counselor Education/School Counseling and Guidance Services 2000  – 2002 Texas Christian University Bachelor's Degree,  English ,  History & Secondary Education 1996  – 1999 Texas Christian University Bachelor's Degree,  English ,  History & Secondary Education 1996  – 1999 Texas Christian University Bachelor's Degree,  English ,  History & Secondary Education 1996  – 1999 ", "Summary Talented higher education administrator skilled in achieving optimal programmatic results through collaboration and effective communication. Specialties:Development of students of color, Graduate Admissions, Diversity training, residence life, Greek Life, Student Programming, Orientation Summary Talented higher education administrator skilled in achieving optimal programmatic results through collaboration and effective communication. Specialties:Development of students of color, Graduate Admissions, Diversity training, residence life, Greek Life, Student Programming, Orientation Talented higher education administrator skilled in achieving optimal programmatic results through collaboration and effective communication. Specialties:Development of students of color, Graduate Admissions, Diversity training, residence life, Greek Life, Student Programming, Orientation Talented higher education administrator skilled in achieving optimal programmatic results through collaboration and effective communication. Specialties:Development of students of color, Graduate Admissions, Diversity training, residence life, Greek Life, Student Programming, Orientation Experience Associate Dean Stanford University May 2015  – Present (4 months) Residence Dean Stanford University August 2010  – Present (5 years 1 month) Assistant Dean Stanford University March 2012  –  April 2015  (3 years 2 months) Stanford, CA Program Coordinator University of Texas at Austin January 2008  –  August 2010  (2 years 8 months) Hall Coordinator The University of Texas at Austin 2006  –  2008  (2 years) Associate Dean Stanford University May 2015  – Present (4 months) Associate Dean Stanford University May 2015  – Present (4 months) Residence Dean Stanford University August 2010  – Present (5 years 1 month) Residence Dean Stanford University August 2010  – Present (5 years 1 month) Assistant Dean Stanford University March 2012  –  April 2015  (3 years 2 months) Stanford, CA Assistant Dean Stanford University March 2012  –  April 2015  (3 years 2 months) Stanford, CA Program Coordinator University of Texas at Austin January 2008  –  August 2010  (2 years 8 months) Program Coordinator University of Texas at Austin January 2008  –  August 2010  (2 years 8 months) Hall Coordinator The University of Texas at Austin 2006  –  2008  (2 years) Hall Coordinator The University of Texas at Austin 2006  –  2008  (2 years) Languages English English English Skills Community Outreach Residence Life Higher Education... Public Speaking Program Management Volunteer Management Grants Diversity Training Research Nonprofits Program Development Youth Development Student Affairs Skills  Community Outreach Residence Life Higher Education... Public Speaking Program Management Volunteer Management Grants Diversity Training Research Nonprofits Program Development Youth Development Student Affairs Community Outreach Residence Life Higher Education... Public Speaking Program Management Volunteer Management Grants Diversity Training Research Nonprofits Program Development Youth Development Student Affairs Community Outreach Residence Life Higher Education... Public Speaking Program Management Volunteer Management Grants Diversity Training Research Nonprofits Program Development Youth Development Student Affairs Education The University of Texas at Austin Doctor of Philosophy (PhD),  Educational Administration 2015  My dissertation topic was on the influence of emotional intelligence on residential student leaders’ enactment of leadership. \n Boston University MSW,  Social Work 2004  – 2006 Activities and Societies:  Boston University School of Social Work Diversity Committee\nBoston University School of Social Work Admissions Committee Jackson State University BA,  Psychology 2000  – 2004 Activities and Societies:  Delta Sigma Theta Sorority ,  Inc.\nPsi Chi National Honor Society\nTiger P.R.I.D.E.\nAlpha Lambda Delta National Honor Society\nM.A.D.D.R.A.M.A Theater Troupe The University of Texas at Austin Doctor of Philosophy (PhD),  Educational Administration 2015  My dissertation topic was on the influence of emotional intelligence on residential student leaders’ enactment of leadership. \n The University of Texas at Austin Doctor of Philosophy (PhD),  Educational Administration 2015  My dissertation topic was on the influence of emotional intelligence on residential student leaders’ enactment of leadership. \n The University of Texas at Austin Doctor of Philosophy (PhD),  Educational Administration 2015  My dissertation topic was on the influence of emotional intelligence on residential student leaders’ enactment of leadership. \n Boston University MSW,  Social Work 2004  – 2006 Activities and Societies:  Boston University School of Social Work Diversity Committee\nBoston University School of Social Work Admissions Committee Boston University MSW,  Social Work 2004  – 2006 Activities and Societies:  Boston University School of Social Work Diversity Committee\nBoston University School of Social Work Admissions Committee Boston University MSW,  Social Work 2004  – 2006 Activities and Societies:  Boston University School of Social Work Diversity Committee\nBoston University School of Social Work Admissions Committee Jackson State University BA,  Psychology 2000  – 2004 Activities and Societies:  Delta Sigma Theta Sorority ,  Inc.\nPsi Chi National Honor Society\nTiger P.R.I.D.E.\nAlpha Lambda Delta National Honor Society\nM.A.D.D.R.A.M.A Theater Troupe Jackson State University BA,  Psychology 2000  – 2004 Activities and Societies:  Delta Sigma Theta Sorority ,  Inc.\nPsi Chi National Honor Society\nTiger P.R.I.D.E.\nAlpha Lambda Delta National Honor Society\nM.A.D.D.R.A.M.A Theater Troupe Jackson State University BA,  Psychology 2000  – 2004 Activities and Societies:  Delta Sigma Theta Sorority ,  Inc.\nPsi Chi National Honor Society\nTiger P.R.I.D.E.\nAlpha Lambda Delta National Honor Society\nM.A.D.D.R.A.M.A Theater Troupe ", "Summary • 15+ years as a high-level, trusted Executive Assistant in various industries.  \n• Successfully interact and communicate with a wide variety of people from board members, senior management to support staff.  \n• Strong organizational, event-planning, and project management skills.  \n• Experienced team worker, able to work cooperatively within a team or independently. \n• Proven record of discretion, self-motivation, initiative, and dependability. \n• Enthusiastic goal-oriented individual with exceptional multitasking abilities, as well as strong written and verbal communication skills. Summary • 15+ years as a high-level, trusted Executive Assistant in various industries.  \n• Successfully interact and communicate with a wide variety of people from board members, senior management to support staff.  \n• Strong organizational, event-planning, and project management skills.  \n• Experienced team worker, able to work cooperatively within a team or independently. \n• Proven record of discretion, self-motivation, initiative, and dependability. \n• Enthusiastic goal-oriented individual with exceptional multitasking abilities, as well as strong written and verbal communication skills. • 15+ years as a high-level, trusted Executive Assistant in various industries.  \n• Successfully interact and communicate with a wide variety of people from board members, senior management to support staff.  \n• Strong organizational, event-planning, and project management skills.  \n• Experienced team worker, able to work cooperatively within a team or independently. \n• Proven record of discretion, self-motivation, initiative, and dependability. \n• Enthusiastic goal-oriented individual with exceptional multitasking abilities, as well as strong written and verbal communication skills. • 15+ years as a high-level, trusted Executive Assistant in various industries.  \n• Successfully interact and communicate with a wide variety of people from board members, senior management to support staff.  \n• Strong organizational, event-planning, and project management skills.  \n• Experienced team worker, able to work cooperatively within a team or independently. \n• Proven record of discretion, self-motivation, initiative, and dependability. \n• Enthusiastic goal-oriented individual with exceptional multitasking abilities, as well as strong written and verbal communication skills. Experience Executive Assistant-EVP of Product salesforce.com June 2014  – Present (1 year 3 months) San Francisco Bay Area Senior Executive Assistant to the COO, President & Sales VP Equinix September 2007  –  March 2014  (6 years 7 months) Redwood Shores, CA •Manage a broad range of executive level support including extremely active calendars; expense reports; composing confidential correspondence; conference calls \n•Arranging complex domestic and international travel; prepare itineraries \n•Assist in development of executive level reports and presentations  \n•Act as gatekeeper, prioritize conflicting needs; proactively handling department matters, with follow-through within deadlines \n•Manage a variety of special projects that have organizational impact \n•Plan and execute team meetings and events Executive Assistant to CMO Equinix April 2006  –  September 2007  (1 year 6 months) Redwood City, CA •Manage all executive level administrative tasks including scheduling meetings, conference calls, expense reports and travel arrangements \n•Key contact for the office and external customers \n•Plan and manage agenda and logistics for high level meetings and company events \n•Draft and edit confidential correspondence Assistant to Senior Associate Dean Stanford University November 2004  –  April 2006  (1 year 6 months) •\tManaged the office of the Senior Associate Dean of Faculty and Academic Affairs \n•\tPrepared research proposals  \n•\tCoordinated faculty and staff meetings with the Dean and the Senior Associate Dean \n•\tAssisted the Faculty Affairs Officer on faculty salary letters, teaching staff appointments, promotions, and manage confidential files. Administrative Support Associate, External Relations Stanford University March 2002  –  November 2004  (2 years 9 months) •\tProvided full administrative support to two Major Gift Officers \n•\tResearched and wrote briefings related to donor/prospect visits  \n•\tManaged multiple calendars, reimbursements, and travel arrangements  \n•\tAssisted on the Dean's Luncheon, Fellowship Reception, and advisory meetings \n•\tPlanned and executed meetings/events for donors, faculty, and development staff Customer Service Representative Blue Martini Software July 2001  –  March 2002  (9 months) Project Manager, Oracle Store Oracle September 1998  –  August 2000  (2 years) Redwood Shores, CA •Reviewed data integrity issues (product naming conventions, product categories) to ensure data was reliable \n•Assisted implementation in quality assurance tests of new system roll-outs \n•Worked with virtual team members to understand customer issues and identify areas where change was needed \n•Gathered requirements for functionality and enhancements changes and drove them to implementation \n•Organized the Store Customer Satisfaction Survey and presented to upper management Field Contract Specialist Oracle September 1995  –  September 1998  (3 years 1 month) Redwood Shores, CA •Drafted standard and non-standard contracts for the public and educational sector \n•Prepared and negotiated price quotations for deals over $100,000 \n•Processed orders to ensure compliance with corporate policies and approval guidelines Customer Service Representative Oracle September 1993  –  September 1995  (2 years 1 month) Redwood Shores, CA •Functioned as primary point of contact for major accounts \n•Trained sales representatives on new polices and online services \n•Identified operational weaknesses and developed internal procedures Executive Assistant-EVP of Product salesforce.com June 2014  – Present (1 year 3 months) San Francisco Bay Area Executive Assistant-EVP of Product salesforce.com June 2014  – Present (1 year 3 months) San Francisco Bay Area Senior Executive Assistant to the COO, President & Sales VP Equinix September 2007  –  March 2014  (6 years 7 months) Redwood Shores, CA •Manage a broad range of executive level support including extremely active calendars; expense reports; composing confidential correspondence; conference calls \n•Arranging complex domestic and international travel; prepare itineraries \n•Assist in development of executive level reports and presentations  \n•Act as gatekeeper, prioritize conflicting needs; proactively handling department matters, with follow-through within deadlines \n•Manage a variety of special projects that have organizational impact \n•Plan and execute team meetings and events Senior Executive Assistant to the COO, President & Sales VP Equinix September 2007  –  March 2014  (6 years 7 months) Redwood Shores, CA •Manage a broad range of executive level support including extremely active calendars; expense reports; composing confidential correspondence; conference calls \n•Arranging complex domestic and international travel; prepare itineraries \n•Assist in development of executive level reports and presentations  \n•Act as gatekeeper, prioritize conflicting needs; proactively handling department matters, with follow-through within deadlines \n•Manage a variety of special projects that have organizational impact \n•Plan and execute team meetings and events Executive Assistant to CMO Equinix April 2006  –  September 2007  (1 year 6 months) Redwood City, CA •Manage all executive level administrative tasks including scheduling meetings, conference calls, expense reports and travel arrangements \n•Key contact for the office and external customers \n•Plan and manage agenda and logistics for high level meetings and company events \n•Draft and edit confidential correspondence Executive Assistant to CMO Equinix April 2006  –  September 2007  (1 year 6 months) Redwood City, CA •Manage all executive level administrative tasks including scheduling meetings, conference calls, expense reports and travel arrangements \n•Key contact for the office and external customers \n•Plan and manage agenda and logistics for high level meetings and company events \n•Draft and edit confidential correspondence Assistant to Senior Associate Dean Stanford University November 2004  –  April 2006  (1 year 6 months) •\tManaged the office of the Senior Associate Dean of Faculty and Academic Affairs \n•\tPrepared research proposals  \n•\tCoordinated faculty and staff meetings with the Dean and the Senior Associate Dean \n•\tAssisted the Faculty Affairs Officer on faculty salary letters, teaching staff appointments, promotions, and manage confidential files. Assistant to Senior Associate Dean Stanford University November 2004  –  April 2006  (1 year 6 months) •\tManaged the office of the Senior Associate Dean of Faculty and Academic Affairs \n•\tPrepared research proposals  \n•\tCoordinated faculty and staff meetings with the Dean and the Senior Associate Dean \n•\tAssisted the Faculty Affairs Officer on faculty salary letters, teaching staff appointments, promotions, and manage confidential files. Administrative Support Associate, External Relations Stanford University March 2002  –  November 2004  (2 years 9 months) •\tProvided full administrative support to two Major Gift Officers \n•\tResearched and wrote briefings related to donor/prospect visits  \n•\tManaged multiple calendars, reimbursements, and travel arrangements  \n•\tAssisted on the Dean's Luncheon, Fellowship Reception, and advisory meetings \n•\tPlanned and executed meetings/events for donors, faculty, and development staff Administrative Support Associate, External Relations Stanford University March 2002  –  November 2004  (2 years 9 months) •\tProvided full administrative support to two Major Gift Officers \n•\tResearched and wrote briefings related to donor/prospect visits  \n•\tManaged multiple calendars, reimbursements, and travel arrangements  \n•\tAssisted on the Dean's Luncheon, Fellowship Reception, and advisory meetings \n•\tPlanned and executed meetings/events for donors, faculty, and development staff Customer Service Representative Blue Martini Software July 2001  –  March 2002  (9 months) Customer Service Representative Blue Martini Software July 2001  –  March 2002  (9 months) Project Manager, Oracle Store Oracle September 1998  –  August 2000  (2 years) Redwood Shores, CA •Reviewed data integrity issues (product naming conventions, product categories) to ensure data was reliable \n•Assisted implementation in quality assurance tests of new system roll-outs \n•Worked with virtual team members to understand customer issues and identify areas where change was needed \n•Gathered requirements for functionality and enhancements changes and drove them to implementation \n•Organized the Store Customer Satisfaction Survey and presented to upper management Project Manager, Oracle Store Oracle September 1998  –  August 2000  (2 years) Redwood Shores, CA •Reviewed data integrity issues (product naming conventions, product categories) to ensure data was reliable \n•Assisted implementation in quality assurance tests of new system roll-outs \n•Worked with virtual team members to understand customer issues and identify areas where change was needed \n•Gathered requirements for functionality and enhancements changes and drove them to implementation \n•Organized the Store Customer Satisfaction Survey and presented to upper management Field Contract Specialist Oracle September 1995  –  September 1998  (3 years 1 month) Redwood Shores, CA •Drafted standard and non-standard contracts for the public and educational sector \n•Prepared and negotiated price quotations for deals over $100,000 \n•Processed orders to ensure compliance with corporate policies and approval guidelines Field Contract Specialist Oracle September 1995  –  September 1998  (3 years 1 month) Redwood Shores, CA •Drafted standard and non-standard contracts for the public and educational sector \n•Prepared and negotiated price quotations for deals over $100,000 \n•Processed orders to ensure compliance with corporate policies and approval guidelines Customer Service Representative Oracle September 1993  –  September 1995  (2 years 1 month) Redwood Shores, CA •Functioned as primary point of contact for major accounts \n•Trained sales representatives on new polices and online services \n•Identified operational weaknesses and developed internal procedures Customer Service Representative Oracle September 1993  –  September 1995  (2 years 1 month) Redwood Shores, CA •Functioned as primary point of contact for major accounts \n•Trained sales representatives on new polices and online services \n•Identified operational weaknesses and developed internal procedures Skills SaaS Cloud Computing Vendor Management Data Center Administrative... Teamwork Telecommunications Enterprise Software Salesforce.com Strategic Partnerships Customer Service Management Professional Services Sales Leadership Skills  SaaS Cloud Computing Vendor Management Data Center Administrative... Teamwork Telecommunications Enterprise Software Salesforce.com Strategic Partnerships Customer Service Management Professional Services Sales Leadership SaaS Cloud Computing Vendor Management Data Center Administrative... Teamwork Telecommunications Enterprise Software Salesforce.com Strategic Partnerships Customer Service Management Professional Services Sales Leadership SaaS Cloud Computing Vendor Management Data Center Administrative... Teamwork Telecommunications Enterprise Software Salesforce.com Strategic Partnerships Customer Service Management Professional Services Sales Leadership Education University of San Diego Bachelor's degree,  Political Science University of San Diego Bachelor's degree,  Political Science University of San Diego Bachelor's degree,  Political Science University of San Diego Bachelor's degree,  Political Science ", "Experience Associate Dean Stanford University Associate Dean Stanford University Associate Dean Stanford University Education Duke University PhD,  Biological Anthropology and Anatomy 1990  – 1998 Lesley University MS,  Education 1988  – 1990 Columbia University in the City of New York BA,  Anthropology 1983  – 1988 Duke University PhD,  Biological Anthropology and Anatomy 1990  – 1998 Duke University PhD,  Biological Anthropology and Anatomy 1990  – 1998 Duke University PhD,  Biological Anthropology and Anatomy 1990  – 1998 Lesley University MS,  Education 1988  – 1990 Lesley University MS,  Education 1988  – 1990 Lesley University MS,  Education 1988  – 1990 Columbia University in the City of New York BA,  Anthropology 1983  – 1988 Columbia University in the City of New York BA,  Anthropology 1983  – 1988 Columbia University in the City of New York BA,  Anthropology 1983  – 1988 ", "Summary Proven leader with the ability to lead strategic initiatives, manage complex operations and influence global teams. Summary Proven leader with the ability to lead strategic initiatives, manage complex operations and influence global teams. Proven leader with the ability to lead strategic initiatives, manage complex operations and influence global teams. Proven leader with the ability to lead strategic initiatives, manage complex operations and influence global teams. Experience Senior Associate Dean Stanford University School of Medicine January 2015  – Present (8 months) Strategy & Communications Associate Dean & Chief of Staff Stanford University School of Medicine April 2013  –  December 2014  (1 year 9 months) Stanford, CA Strategy & Communications Assistant Dean, Global Innovation Programs Stanford Graduate School of Business January 2012  –  April 2013  (1 year 4 months) Delivered global strategy for the Stanford GSB with a focus on innovation and entrepreneurship programs. Developed content for SEED (Stanford Institute for Innovation in Developing Economies) programs in alignment with the institute's mission, to enable entrepreneurs to alleviate poverty in developing economies. Built programs to support the GSB’s online and distance learning goals. Assistant Dean / Managing Director, Executive Education Stanford Graduate School of Business January 2006  –  January 2012  (6 years 1 month) Stanford, CA Delivered strategic plan, long-term vision and global strategy for Executive Education business. Launched innovative marketing campaigns to achieve standout branding and build reputation for products/programs. Director of Marketing, Executive Education Stanford Graduate School of Business September 2002  –  January 2006  (3 years 5 months) Stanford, CA Responsible for marketing extensive Executive Education portfolio. Launched extensive marketing plans including print, media, web strategy (online presence, email marketing, social media and search) and direct marketing campaigns. Marketing Management Oracle October 2000  –  June 2002  (1 year 9 months) Managed $50 million global advertising budget for Oracle. Oversight of central and regional budgets including media buys, production costs and pan-regional funding. Planning/execution of global advertising strategy, management of multiple branding and media agencies. Marketing Management Respond.com June 1998  –  September 2000  (2 years 4 months) Palo Alto, CA Responsible for marketing strategy from creative concepts to delivery of campaigns, in collaboration with Product Management, PR and Research teams to ensure on-brand delivery. Grew qualified traffic/requests to Respond.com network + extensive grassroots marketing campaigns for lead generation. Marketing Management Levi Strauss & Co. January 1989  –  June 1998  (9 years 6 months) Delivered strategic plans for Dockers retail and event marketing programs including trade shows, Fashion Week, seasonal merchandising events and sales events with oversight of a $3 million budget and responsibility for corporate brand identity and creation of concepts. Senior Associate Dean Stanford University School of Medicine January 2015  – Present (8 months) Strategy & Communications Senior Associate Dean Stanford University School of Medicine January 2015  – Present (8 months) Strategy & Communications Associate Dean & Chief of Staff Stanford University School of Medicine April 2013  –  December 2014  (1 year 9 months) Stanford, CA Strategy & Communications Associate Dean & Chief of Staff Stanford University School of Medicine April 2013  –  December 2014  (1 year 9 months) Stanford, CA Strategy & Communications Assistant Dean, Global Innovation Programs Stanford Graduate School of Business January 2012  –  April 2013  (1 year 4 months) Delivered global strategy for the Stanford GSB with a focus on innovation and entrepreneurship programs. Developed content for SEED (Stanford Institute for Innovation in Developing Economies) programs in alignment with the institute's mission, to enable entrepreneurs to alleviate poverty in developing economies. Built programs to support the GSB’s online and distance learning goals. Assistant Dean, Global Innovation Programs Stanford Graduate School of Business January 2012  –  April 2013  (1 year 4 months) Delivered global strategy for the Stanford GSB with a focus on innovation and entrepreneurship programs. Developed content for SEED (Stanford Institute for Innovation in Developing Economies) programs in alignment with the institute's mission, to enable entrepreneurs to alleviate poverty in developing economies. Built programs to support the GSB’s online and distance learning goals. Assistant Dean / Managing Director, Executive Education Stanford Graduate School of Business January 2006  –  January 2012  (6 years 1 month) Stanford, CA Delivered strategic plan, long-term vision and global strategy for Executive Education business. Launched innovative marketing campaigns to achieve standout branding and build reputation for products/programs. Assistant Dean / Managing Director, Executive Education Stanford Graduate School of Business January 2006  –  January 2012  (6 years 1 month) Stanford, CA Delivered strategic plan, long-term vision and global strategy for Executive Education business. Launched innovative marketing campaigns to achieve standout branding and build reputation for products/programs. Director of Marketing, Executive Education Stanford Graduate School of Business September 2002  –  January 2006  (3 years 5 months) Stanford, CA Responsible for marketing extensive Executive Education portfolio. Launched extensive marketing plans including print, media, web strategy (online presence, email marketing, social media and search) and direct marketing campaigns. Director of Marketing, Executive Education Stanford Graduate School of Business September 2002  –  January 2006  (3 years 5 months) Stanford, CA Responsible for marketing extensive Executive Education portfolio. Launched extensive marketing plans including print, media, web strategy (online presence, email marketing, social media and search) and direct marketing campaigns. Marketing Management Oracle October 2000  –  June 2002  (1 year 9 months) Managed $50 million global advertising budget for Oracle. Oversight of central and regional budgets including media buys, production costs and pan-regional funding. Planning/execution of global advertising strategy, management of multiple branding and media agencies. Marketing Management Oracle October 2000  –  June 2002  (1 year 9 months) Managed $50 million global advertising budget for Oracle. Oversight of central and regional budgets including media buys, production costs and pan-regional funding. Planning/execution of global advertising strategy, management of multiple branding and media agencies. Marketing Management Respond.com June 1998  –  September 2000  (2 years 4 months) Palo Alto, CA Responsible for marketing strategy from creative concepts to delivery of campaigns, in collaboration with Product Management, PR and Research teams to ensure on-brand delivery. Grew qualified traffic/requests to Respond.com network + extensive grassroots marketing campaigns for lead generation. Marketing Management Respond.com June 1998  –  September 2000  (2 years 4 months) Palo Alto, CA Responsible for marketing strategy from creative concepts to delivery of campaigns, in collaboration with Product Management, PR and Research teams to ensure on-brand delivery. Grew qualified traffic/requests to Respond.com network + extensive grassroots marketing campaigns for lead generation. Marketing Management Levi Strauss & Co. January 1989  –  June 1998  (9 years 6 months) Delivered strategic plans for Dockers retail and event marketing programs including trade shows, Fashion Week, seasonal merchandising events and sales events with oversight of a $3 million budget and responsibility for corporate brand identity and creation of concepts. Marketing Management Levi Strauss & Co. January 1989  –  June 1998  (9 years 6 months) Delivered strategic plans for Dockers retail and event marketing programs including trade shows, Fashion Week, seasonal merchandising events and sales events with oversight of a $3 million budget and responsibility for corporate brand identity and creation of concepts. Languages Hindi Native or bilingual proficiency Marathi Native or bilingual proficiency Gujarati Native or bilingual proficiency Hindi Native or bilingual proficiency Marathi Native or bilingual proficiency Gujarati Native or bilingual proficiency Hindi Native or bilingual proficiency Marathi Native or bilingual proficiency Gujarati Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Leadership Development Team Leadership Strategic Planning Marketing Strategy Programme Design Operations Management Global Strategy Strategy Skills  Leadership Development Team Leadership Strategic Planning Marketing Strategy Programme Design Operations Management Global Strategy Strategy Leadership Development Team Leadership Strategic Planning Marketing Strategy Programme Design Operations Management Global Strategy Strategy Leadership Development Team Leadership Strategic Planning Marketing Strategy Programme Design Operations Management Global Strategy Strategy Education Sydenham College, University of Bombay, India Bachelor of Commerce (B.Com.) 1984  – 1987 Sydenham College, University of Bombay, India Bachelor of Commerce (B.Com.) 1984  – 1987 Sydenham College, University of Bombay, India Bachelor of Commerce (B.Com.) 1984  – 1987 Sydenham College, University of Bombay, India Bachelor of Commerce (B.Com.) 1984  – 1987 ", "Experience Associate Director Stanford University Associate Director Stanford University Associate Director Stanford University ", "Skills Community Outreach Staff Development Program Management Fundraising Higher Education Student Affairs Recruiting Curriculum Development Policy Leadership Nonprofits Research Training Curriculum Design Grants Skills  Community Outreach Staff Development Program Management Fundraising Higher Education Student Affairs Recruiting Curriculum Development Policy Leadership Nonprofits Research Training Curriculum Design Grants Community Outreach Staff Development Program Management Fundraising Higher Education Student Affairs Recruiting Curriculum Development Policy Leadership Nonprofits Research Training Curriculum Design Grants Community Outreach Staff Development Program Management Fundraising Higher Education Student Affairs Recruiting Curriculum Development Policy Leadership Nonprofits Research Training Curriculum Design Grants ", "Experience Associate Dean Duke University October 2010  – Present (4 years 11 months) Associate Dean Stanford University June 2007  –  September 2010  (3 years 4 months) Associate Dean Duke University October 2010  – Present (4 years 11 months) Associate Dean Duke University October 2010  – Present (4 years 11 months) Associate Dean Stanford University June 2007  –  September 2010  (3 years 4 months) Associate Dean Stanford University June 2007  –  September 2010  (3 years 4 months) Languages Elementary French, Conversational Bahasa Indonesia Elementary French, Conversational Bahasa Indonesia Elementary French, Conversational Bahasa Indonesia Skills Teaching Public Speaking Strategic Planning Budgets HIgher Education... Academic Advising Higher Education Staff Development Grant Writing University Teaching Program Development Community Outreach Student Development Student Affairs College Teaching Program Evaluation Nonprofits Editing See 3+     See less Skills  Teaching Public Speaking Strategic Planning Budgets HIgher Education... Academic Advising Higher Education Staff Development Grant Writing University Teaching Program Development Community Outreach Student Development Student Affairs College Teaching Program Evaluation Nonprofits Editing See 3+     See less Teaching Public Speaking Strategic Planning Budgets HIgher Education... Academic Advising Higher Education Staff Development Grant Writing University Teaching Program Development Community Outreach Student Development Student Affairs College Teaching Program Evaluation Nonprofits Editing See 3+     See less Teaching Public Speaking Strategic Planning Budgets HIgher Education... Academic Advising Higher Education Staff Development Grant Writing University Teaching Program Development Community Outreach Student Development Student Affairs College Teaching Program Evaluation Nonprofits Editing See 3+     See less Education Duke University Doctor of Philosophy (PhD),  Biological Anthropology & Anatomy (Evolutionary Anthropology) Lesley University Master of Science (MS),  Education Columbia Univeresity Bachelor of Arts (BA),  Anthropology Duke University Doctor of Philosophy (PhD),  Biological Anthropology & Anatomy (Evolutionary Anthropology) Duke University Doctor of Philosophy (PhD),  Biological Anthropology & Anatomy (Evolutionary Anthropology) Duke University Doctor of Philosophy (PhD),  Biological Anthropology & Anatomy (Evolutionary Anthropology) Lesley University Master of Science (MS),  Education Lesley University Master of Science (MS),  Education Lesley University Master of Science (MS),  Education Columbia Univeresity Bachelor of Arts (BA),  Anthropology Columbia Univeresity Bachelor of Arts (BA),  Anthropology Columbia Univeresity Bachelor of Arts (BA),  Anthropology ", "Experience Associate Dean Stanford University 2010  – Present (5 years) Associate Dean Stanford University 2010  – Present (5 years) Associate Dean Stanford University 2010  – Present (5 years) "]}