{"position": "Associate", "company": "Intel Corporation", "profiles": ["Experience SENIOR ASSOCIATE Intel Corporation January 2011  – Present (4 years 8 months) SENIOR ASSOCIATE Intel Corporation January 2011  – Present (4 years 8 months) SENIOR ASSOCIATE Intel Corporation January 2011  – Present (4 years 8 months) Skills Project Management Internal Communications Skills  Project Management Internal Communications Project Management Internal Communications Project Management Internal Communications ", "Experience Transaction Associate Intel Corporation Transaction Associate Intel Corporation Transaction Associate Intel Corporation Education Salt Lake Community College Salt Lake Community College Salt Lake Community College Salt Lake Community College ", "Experience Sr Administrative Associate Intel Corporation 1993  – Present (22 years) Senior Administrative Assistant University of California, Santa Barbara 1976  –  1982  (6 years) Sr Administrative Associate Intel Corporation 1993  – Present (22 years) Sr Administrative Associate Intel Corporation 1993  – Present (22 years) Senior Administrative Assistant University of California, Santa Barbara 1976  –  1982  (6 years) Senior Administrative Assistant University of California, Santa Barbara 1976  –  1982  (6 years) Skills Lotus Notes Visio Process Scheduler PeopleSoft Skills  Lotus Notes Visio Process Scheduler PeopleSoft Lotus Notes Visio Process Scheduler PeopleSoft Lotus Notes Visio Process Scheduler PeopleSoft Education Mission College AA,  Liberal Arts 2000 Orange Coast College Liberal Arts 1984  – 1986 Mission College AA,  Liberal Arts 2000 Mission College AA,  Liberal Arts 2000 Mission College AA,  Liberal Arts 2000 Orange Coast College Liberal Arts 1984  – 1986 Orange Coast College Liberal Arts 1984  – 1986 Orange Coast College Liberal Arts 1984  – 1986 ", "Summary HUMAN RESOURCE ASSISTANT with over 15 years’ experience providing employee data and payroll support, training and creating learning guides. Flexible team player and has the ability to work with all levels of management. Ability to multi-task and provide world class customer service while supporting organizational goals and developing effective relationships. Summary HUMAN RESOURCE ASSISTANT with over 15 years’ experience providing employee data and payroll support, training and creating learning guides. Flexible team player and has the ability to work with all levels of management. Ability to multi-task and provide world class customer service while supporting organizational goals and developing effective relationships. HUMAN RESOURCE ASSISTANT with over 15 years’ experience providing employee data and payroll support, training and creating learning guides. Flexible team player and has the ability to work with all levels of management. Ability to multi-task and provide world class customer service while supporting organizational goals and developing effective relationships. HUMAN RESOURCE ASSISTANT with over 15 years’ experience providing employee data and payroll support, training and creating learning guides. Flexible team player and has the ability to work with all levels of management. Ability to multi-task and provide world class customer service while supporting organizational goals and developing effective relationships. Experience Human Resource Assistant Teledyne Microwave Solutions April 2015  – Present (5 months) Rancho Cordova, CA • Processing, verifying, and maintaining documentation relating to H.R. activities such as staffing, recruitment, training, grievances, performance evaluations, and classifications. \n• Providing support such as; Benefit Administration, LOAs, Workers Compensation, as well as projects requiring data retrieval and formatting. \n• Conducting New Hire and Benefits Orientation to new employees by Explaining company personnel policies, benefits, and procedures to new employees. \n Recruiting Coordinator/Image Technician Dignity Health August 2014  – Present (1 year 1 month) Rancho Cordova, CA •Providing Administrative support to the Physician recruiters with interview scheduling, itinerary development and requisition management.\t \n• Responsible for gathering, sorting, scanning and batching documents according to work types and client specifications \n• Audits scanned documents in the ImageNow/Lawson program Office Manager/Administrative Assistant Intel Corporation 2009  –  2013  (4 years) Longmont, CO Providing Administrative support to two major groups at the Longmont site with over 80+ people with duties such as calendar management , travel arrangements, new hire set ups and move coordination, scheduling and coordinating logistics for team builders and great place to work events.  \n \nLongmont Office Manager who supports all building and site issues due to the fact that it was a non-corporate supported site. Duties such as purchase order processing, space czar, HVAC, main point contact for IT related site issues, and helping all site personnel with a variety of day to day activities. \n \nEvent Coordinator- Planned over 32 events (resume attached below) Payroll Processor/Transaction Associate Intel Corporation 2002  –  2009  (7 years) Processed the payroll of an average of 2822 employees each month and managed the leave of absence pay and data for an average of 91 employees each month with a near flawless quality rate (99%) and while meeting strict deadlines. \n \nCreated and updated over 60 process documents, ensuring US Payroll’s compliance with Sarbanes Oxley, while performing data administrating and processes payroll.  \n \nRecognized as an MVP (Most Valuable Player) within the US Payroll group for the willingness to support team members and get the job done. Employee Service Center Associate Intel Corporation June 1998  –  April 2002  (3 years 11 months) Developed broad knowledge of HR processes, such as employee movements including new hires, transfers, relocation, employee data changes, and terminations. \n \nRecognized the need for a PC upgrade for the Employee Services Center and drove the justification, logistics, and training for 20 people, with no cost to the department. \n \nIdentified the need for and created learning guides and process certifications for new employees to ensure successful training and high quality. Data Administrator Intel Corporation 2002  –  2002  (less than a year) Riverton, Utah Worked as the liaison between Payroll and the Employee Data Support team to ensure good communication an effective business partnering.  \n \nVolunteered to assist with preparing 13,711 payroll documents for imaging.  \n \nCreated and maintained the Data Administration Desktop Manual to ensure processes were completed with accuracy and consistency. Payroll Front Desk /Records Administrator Intel Corporation 1995  –  1998  (3 years) Supported employees with questions regarding payroll and petty cash questions in a service window environment. \n \nInstructed, gathered, and processed all Folsom new employee paperwork, including W-4 Forms, I-9 Forms, and job applications, and entered all employee changes related to the employment life cycle.  \n \n \nManaged NT migration for Payroll groups in two locations, which required identifying and documenting individual needs, managing inventory, and ensuring successful migration. \n \nKey contributor on the Desktop Manual Team, which required validation of all processes to ensure they were accurate and consistent with in Employee Information Services. Human Resource Assistant Teledyne Microwave Solutions April 2015  – Present (5 months) Rancho Cordova, CA • Processing, verifying, and maintaining documentation relating to H.R. activities such as staffing, recruitment, training, grievances, performance evaluations, and classifications. \n• Providing support such as; Benefit Administration, LOAs, Workers Compensation, as well as projects requiring data retrieval and formatting. \n• Conducting New Hire and Benefits Orientation to new employees by Explaining company personnel policies, benefits, and procedures to new employees. \n Human Resource Assistant Teledyne Microwave Solutions April 2015  – Present (5 months) Rancho Cordova, CA • Processing, verifying, and maintaining documentation relating to H.R. activities such as staffing, recruitment, training, grievances, performance evaluations, and classifications. \n• Providing support such as; Benefit Administration, LOAs, Workers Compensation, as well as projects requiring data retrieval and formatting. \n• Conducting New Hire and Benefits Orientation to new employees by Explaining company personnel policies, benefits, and procedures to new employees. \n Recruiting Coordinator/Image Technician Dignity Health August 2014  – Present (1 year 1 month) Rancho Cordova, CA •Providing Administrative support to the Physician recruiters with interview scheduling, itinerary development and requisition management.\t \n• Responsible for gathering, sorting, scanning and batching documents according to work types and client specifications \n• Audits scanned documents in the ImageNow/Lawson program Recruiting Coordinator/Image Technician Dignity Health August 2014  – Present (1 year 1 month) Rancho Cordova, CA •Providing Administrative support to the Physician recruiters with interview scheduling, itinerary development and requisition management.\t \n• Responsible for gathering, sorting, scanning and batching documents according to work types and client specifications \n• Audits scanned documents in the ImageNow/Lawson program Office Manager/Administrative Assistant Intel Corporation 2009  –  2013  (4 years) Longmont, CO Providing Administrative support to two major groups at the Longmont site with over 80+ people with duties such as calendar management , travel arrangements, new hire set ups and move coordination, scheduling and coordinating logistics for team builders and great place to work events.  \n \nLongmont Office Manager who supports all building and site issues due to the fact that it was a non-corporate supported site. Duties such as purchase order processing, space czar, HVAC, main point contact for IT related site issues, and helping all site personnel with a variety of day to day activities. \n \nEvent Coordinator- Planned over 32 events (resume attached below) Office Manager/Administrative Assistant Intel Corporation 2009  –  2013  (4 years) Longmont, CO Providing Administrative support to two major groups at the Longmont site with over 80+ people with duties such as calendar management , travel arrangements, new hire set ups and move coordination, scheduling and coordinating logistics for team builders and great place to work events.  \n \nLongmont Office Manager who supports all building and site issues due to the fact that it was a non-corporate supported site. Duties such as purchase order processing, space czar, HVAC, main point contact for IT related site issues, and helping all site personnel with a variety of day to day activities. \n \nEvent Coordinator- Planned over 32 events (resume attached below) Payroll Processor/Transaction Associate Intel Corporation 2002  –  2009  (7 years) Processed the payroll of an average of 2822 employees each month and managed the leave of absence pay and data for an average of 91 employees each month with a near flawless quality rate (99%) and while meeting strict deadlines. \n \nCreated and updated over 60 process documents, ensuring US Payroll’s compliance with Sarbanes Oxley, while performing data administrating and processes payroll.  \n \nRecognized as an MVP (Most Valuable Player) within the US Payroll group for the willingness to support team members and get the job done. Payroll Processor/Transaction Associate Intel Corporation 2002  –  2009  (7 years) Processed the payroll of an average of 2822 employees each month and managed the leave of absence pay and data for an average of 91 employees each month with a near flawless quality rate (99%) and while meeting strict deadlines. \n \nCreated and updated over 60 process documents, ensuring US Payroll’s compliance with Sarbanes Oxley, while performing data administrating and processes payroll.  \n \nRecognized as an MVP (Most Valuable Player) within the US Payroll group for the willingness to support team members and get the job done. Employee Service Center Associate Intel Corporation June 1998  –  April 2002  (3 years 11 months) Developed broad knowledge of HR processes, such as employee movements including new hires, transfers, relocation, employee data changes, and terminations. \n \nRecognized the need for a PC upgrade for the Employee Services Center and drove the justification, logistics, and training for 20 people, with no cost to the department. \n \nIdentified the need for and created learning guides and process certifications for new employees to ensure successful training and high quality. Employee Service Center Associate Intel Corporation June 1998  –  April 2002  (3 years 11 months) Developed broad knowledge of HR processes, such as employee movements including new hires, transfers, relocation, employee data changes, and terminations. \n \nRecognized the need for a PC upgrade for the Employee Services Center and drove the justification, logistics, and training for 20 people, with no cost to the department. \n \nIdentified the need for and created learning guides and process certifications for new employees to ensure successful training and high quality. Data Administrator Intel Corporation 2002  –  2002  (less than a year) Riverton, Utah Worked as the liaison between Payroll and the Employee Data Support team to ensure good communication an effective business partnering.  \n \nVolunteered to assist with preparing 13,711 payroll documents for imaging.  \n \nCreated and maintained the Data Administration Desktop Manual to ensure processes were completed with accuracy and consistency. Data Administrator Intel Corporation 2002  –  2002  (less than a year) Riverton, Utah Worked as the liaison between Payroll and the Employee Data Support team to ensure good communication an effective business partnering.  \n \nVolunteered to assist with preparing 13,711 payroll documents for imaging.  \n \nCreated and maintained the Data Administration Desktop Manual to ensure processes were completed with accuracy and consistency. Payroll Front Desk /Records Administrator Intel Corporation 1995  –  1998  (3 years) Supported employees with questions regarding payroll and petty cash questions in a service window environment. \n \nInstructed, gathered, and processed all Folsom new employee paperwork, including W-4 Forms, I-9 Forms, and job applications, and entered all employee changes related to the employment life cycle.  \n \n \nManaged NT migration for Payroll groups in two locations, which required identifying and documenting individual needs, managing inventory, and ensuring successful migration. \n \nKey contributor on the Desktop Manual Team, which required validation of all processes to ensure they were accurate and consistent with in Employee Information Services. Payroll Front Desk /Records Administrator Intel Corporation 1995  –  1998  (3 years) Supported employees with questions regarding payroll and petty cash questions in a service window environment. \n \nInstructed, gathered, and processed all Folsom new employee paperwork, including W-4 Forms, I-9 Forms, and job applications, and entered all employee changes related to the employment life cycle.  \n \n \nManaged NT migration for Payroll groups in two locations, which required identifying and documenting individual needs, managing inventory, and ensuring successful migration. \n \nKey contributor on the Desktop Manual Team, which required validation of all processes to ensure they were accurate and consistent with in Employee Information Services. Education DeVry University Bachelor of Science,  Technical Management 2009 DeVry University Bachelor of Science,  Technical Management 2009 DeVry University Bachelor of Science,  Technical Management 2009 DeVry University Bachelor of Science,  Technical Management 2009 ", "Experience Marketing Associate Intel Corporation September 2014  – Present (1 year) Hillsboro, OR Communications Intern Bicycle Transportation Alliance May 2014  –  August 2014  (4 months) Portland, Oregon Area Design art for print and web marketing and execute social media campaigns to support BTA programs, events, and advocacy efforts. Use WordPress knowledge, HTML/CSS understanding, and excellent writing skills to copy edit BTA blog posts and implement website updates. Create monthly newsletters using Mail Chimp on short timelines. Director of Public Relations Undergraduate Student Government West- Arizona State University February 2014  –  May 2014  (4 months) Design graphic and persuasive signage for event marketing. Analyze marketing program and develop fresh marketing strategies. Lead the redesign of the webpage for student government at the West campus. Update social media posts and increase following. Technical Analyst American Express June 2013  –  August 2013  (3 months) Phoenix, Arizona Area Fulfilled the duties of a Business Analyst on the projects assigned by taking on the responsibility for documentation of business needs/requirements and applying the required methods and standards. \nAssisted in the analysis of underlying issues arising from investigations into requirements and facilitated meetings and conference calls. Quickly adapted to the fast-paced environment and constantly changing priorities. Worked closely with the Project Manager to maintain Cost, Schedule and Scope of each project. Bulk Department Intern Sprouts Farmers Market January 2013  –  May 2013  (5 months) Phoenix, Arizona Area Assisted Bulk Manager in day-to-day operations of the bulk department. Duties included putting together weekly advertisement recaps, setting up new bulk food items, updating database information, and creating pre-order excel spreadsheets. Updated company portal with information for stores, collected orders from all stores, and assembled and distributed birthday cards for all employees were other responsibilities. Also, communicated effectively with 150 store managers to problem solve and coordinate supply orders. Party Coordinator PlayGrounds Fun Zone & Cafe October 2011  –  January 2013  (1 year 4 months) Phoenix, Arizona Area Worked directly with customers in planning events and independently executed them to fit customer needs. Other responsibilities included responding to all potential customer emails, booking parties, creating reservation forms, and ensuring everything from set up to food was perfect on the day of the event so the customer was completely satisfied. Marketing Associate Intel Corporation September 2014  – Present (1 year) Hillsboro, OR Marketing Associate Intel Corporation September 2014  – Present (1 year) Hillsboro, OR Communications Intern Bicycle Transportation Alliance May 2014  –  August 2014  (4 months) Portland, Oregon Area Design art for print and web marketing and execute social media campaigns to support BTA programs, events, and advocacy efforts. Use WordPress knowledge, HTML/CSS understanding, and excellent writing skills to copy edit BTA blog posts and implement website updates. Create monthly newsletters using Mail Chimp on short timelines. Communications Intern Bicycle Transportation Alliance May 2014  –  August 2014  (4 months) Portland, Oregon Area Design art for print and web marketing and execute social media campaigns to support BTA programs, events, and advocacy efforts. Use WordPress knowledge, HTML/CSS understanding, and excellent writing skills to copy edit BTA blog posts and implement website updates. Create monthly newsletters using Mail Chimp on short timelines. Director of Public Relations Undergraduate Student Government West- Arizona State University February 2014  –  May 2014  (4 months) Design graphic and persuasive signage for event marketing. Analyze marketing program and develop fresh marketing strategies. Lead the redesign of the webpage for student government at the West campus. Update social media posts and increase following. Director of Public Relations Undergraduate Student Government West- Arizona State University February 2014  –  May 2014  (4 months) Design graphic and persuasive signage for event marketing. Analyze marketing program and develop fresh marketing strategies. Lead the redesign of the webpage for student government at the West campus. Update social media posts and increase following. Technical Analyst American Express June 2013  –  August 2013  (3 months) Phoenix, Arizona Area Fulfilled the duties of a Business Analyst on the projects assigned by taking on the responsibility for documentation of business needs/requirements and applying the required methods and standards. \nAssisted in the analysis of underlying issues arising from investigations into requirements and facilitated meetings and conference calls. Quickly adapted to the fast-paced environment and constantly changing priorities. Worked closely with the Project Manager to maintain Cost, Schedule and Scope of each project. Technical Analyst American Express June 2013  –  August 2013  (3 months) Phoenix, Arizona Area Fulfilled the duties of a Business Analyst on the projects assigned by taking on the responsibility for documentation of business needs/requirements and applying the required methods and standards. \nAssisted in the analysis of underlying issues arising from investigations into requirements and facilitated meetings and conference calls. Quickly adapted to the fast-paced environment and constantly changing priorities. Worked closely with the Project Manager to maintain Cost, Schedule and Scope of each project. Bulk Department Intern Sprouts Farmers Market January 2013  –  May 2013  (5 months) Phoenix, Arizona Area Assisted Bulk Manager in day-to-day operations of the bulk department. Duties included putting together weekly advertisement recaps, setting up new bulk food items, updating database information, and creating pre-order excel spreadsheets. Updated company portal with information for stores, collected orders from all stores, and assembled and distributed birthday cards for all employees were other responsibilities. Also, communicated effectively with 150 store managers to problem solve and coordinate supply orders. Bulk Department Intern Sprouts Farmers Market January 2013  –  May 2013  (5 months) Phoenix, Arizona Area Assisted Bulk Manager in day-to-day operations of the bulk department. Duties included putting together weekly advertisement recaps, setting up new bulk food items, updating database information, and creating pre-order excel spreadsheets. Updated company portal with information for stores, collected orders from all stores, and assembled and distributed birthday cards for all employees were other responsibilities. Also, communicated effectively with 150 store managers to problem solve and coordinate supply orders. Party Coordinator PlayGrounds Fun Zone & Cafe October 2011  –  January 2013  (1 year 4 months) Phoenix, Arizona Area Worked directly with customers in planning events and independently executed them to fit customer needs. Other responsibilities included responding to all potential customer emails, booking parties, creating reservation forms, and ensuring everything from set up to food was perfect on the day of the event so the customer was completely satisfied. Party Coordinator PlayGrounds Fun Zone & Cafe October 2011  –  January 2013  (1 year 4 months) Phoenix, Arizona Area Worked directly with customers in planning events and independently executed them to fit customer needs. Other responsibilities included responding to all potential customer emails, booking parties, creating reservation forms, and ensuring everything from set up to food was perfect on the day of the event so the customer was completely satisfied. Languages   Skills Communication Organization Microsoft Office Social Media Marketing Microsoft Excel Microsoft Word Photoshop Elements PowerPoint Teamwork Outlook Customer Service English Problem Solving Team Leadership Mac OS X Agile & Waterfall... Clarity SharePoint Research Category Analyzer... See 5+     See less Skills  Communication Organization Microsoft Office Social Media Marketing Microsoft Excel Microsoft Word Photoshop Elements PowerPoint Teamwork Outlook Customer Service English Problem Solving Team Leadership Mac OS X Agile & Waterfall... Clarity SharePoint Research Category Analyzer... See 5+     See less Communication Organization Microsoft Office Social Media Marketing Microsoft Excel Microsoft Word Photoshop Elements PowerPoint Teamwork Outlook Customer Service English Problem Solving Team Leadership Mac OS X Agile & Waterfall... Clarity SharePoint Research Category Analyzer... See 5+     See less Communication Organization Microsoft Office Social Media Marketing Microsoft Excel Microsoft Word Photoshop Elements PowerPoint Teamwork Outlook Customer Service English Problem Solving Team Leadership Mac OS X Agile & Waterfall... Clarity SharePoint Research Category Analyzer... See 5+     See less Education Arizona State University Bachelor's Degree,  Management , 4.0 2010  – 2014 Summa Cum Laude Thunderbird High School 2006  – 2010 Arizona State University Bachelor's Degree,  Management , 4.0 2010  – 2014 Summa Cum Laude Arizona State University Bachelor's Degree,  Management , 4.0 2010  – 2014 Summa Cum Laude Arizona State University Bachelor's Degree,  Management , 4.0 2010  – 2014 Summa Cum Laude Thunderbird High School 2006  – 2010 Thunderbird High School 2006  – 2010 Thunderbird High School 2006  – 2010 Honors & Awards New American University Provost Scholarship Award Fall 2010, Spring 2011, Fall 2011, Spring 2012, Fall 2012, Spring 2013, Fall 2013, Spring 2014 Dean's List with Distinction Fall 2013 Dean's List with Distinction Spring 2013 Dean's List with Distinction Fall 2012 Dean's List with Distinction Spring 2012 Dean's List with Distinction Fall 2011 Dean's List with Distinction Spring 2011 \n Dean's List with Distinction Fall 2010 New American University Provost Scholarship Award Fall 2010, Spring 2011, Fall 2011, Spring 2012, Fall 2012, Spring 2013, Fall 2013, Spring 2014 New American University Provost Scholarship Award Fall 2010, Spring 2011, Fall 2011, Spring 2012, Fall 2012, Spring 2013, Fall 2013, Spring 2014 New American University Provost Scholarship Award Fall 2010, Spring 2011, Fall 2011, Spring 2012, Fall 2012, Spring 2013, Fall 2013, Spring 2014 Dean's List with Distinction Fall 2013 Dean's List with Distinction Fall 2013 Dean's List with Distinction Fall 2013 Dean's List with Distinction Spring 2013 Dean's List with Distinction Spring 2013 Dean's List with Distinction Spring 2013 Dean's List with Distinction Fall 2012 Dean's List with Distinction Fall 2012 Dean's List with Distinction Fall 2012 Dean's List with Distinction Spring 2012 Dean's List with Distinction Spring 2012 Dean's List with Distinction Spring 2012 Dean's List with Distinction Fall 2011 Dean's List with Distinction Fall 2011 Dean's List with Distinction Fall 2011 Dean's List with Distinction Spring 2011 \n Dean's List with Distinction Spring 2011 \n Dean's List with Distinction Spring 2011 \n Dean's List with Distinction Fall 2010 Dean's List with Distinction Fall 2010 Dean's List with Distinction Fall 2010 ", "Experience Global Product Cycle Planning Manager Ford Motor Company 2009  – Present (6 years) Sustainability & Fuel Economy Product Planning Manager Ford Motor Company 2004  –  2008  (4 years) Marketing Associate Intel Corporation 1986  –  1986  (less than a year) Marketing Associate Intel Corporation 1986  –  1986  (less than a year) Marketing Associate Intel Corporation 1986  –  1986  (less than a year) Global Product Cycle Planning Manager Ford Motor Company 2009  – Present (6 years) Global Product Cycle Planning Manager Ford Motor Company 2009  – Present (6 years) Sustainability & Fuel Economy Product Planning Manager Ford Motor Company 2004  –  2008  (4 years) Sustainability & Fuel Economy Product Planning Manager Ford Motor Company 2004  –  2008  (4 years) Marketing Associate Intel Corporation 1986  –  1986  (less than a year) Marketing Associate Intel Corporation 1986  –  1986  (less than a year) Marketing Associate Intel Corporation 1986  –  1986  (less than a year) Marketing Associate Intel Corporation 1986  –  1986  (less than a year) Marketing Associate Intel Corporation 1986  –  1986  (less than a year) Marketing Associate Intel Corporation 1986  –  1986  (less than a year) Skills Strategic Planning Product Development Cross-functional Team... Competitive Analysis Automotive Program Management Product Management Skills  Strategic Planning Product Development Cross-functional Team... Competitive Analysis Automotive Program Management Product Management Strategic Planning Product Development Cross-functional Team... Competitive Analysis Automotive Program Management Product Management Strategic Planning Product Development Cross-functional Team... Competitive Analysis Automotive Program Management Product Management Education University of Pennsylvania - The Wharton School MBA,  Finance 1985  – 1986 Kettering University BS,  Industrial & Systems Engineering 1977  – 1982 University of Pennsylvania - The Wharton School MBA,  Finance 1985  – 1986 University of Pennsylvania - The Wharton School MBA,  Finance 1985  – 1986 University of Pennsylvania - The Wharton School MBA,  Finance 1985  – 1986 Kettering University BS,  Industrial & Systems Engineering 1977  – 1982 Kettering University BS,  Industrial & Systems Engineering 1977  – 1982 Kettering University BS,  Industrial & Systems Engineering 1977  – 1982 ", "Experience Senior associate Intel Corporation Senior associate Intel Corporation Senior associate Intel Corporation ", "Experience Accelerated Leadership Program (ALP) Associate Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Accelerated Leadership Program (ALP) Associate Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Accelerated Leadership Program (ALP) Associate Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Languages   Skills Skills     Honors & Awards ", "Experience Associate Intel Corporation April 2012  – Present (3 years 5 months) Penang, Malaysia working as a product development engineer Software Developer KISL Technology Centre SDN. BHD. January 2011  – Present (4 years 8 months) Associate Intel Corporation April 2012  – Present (3 years 5 months) Penang, Malaysia working as a product development engineer Associate Intel Corporation April 2012  – Present (3 years 5 months) Penang, Malaysia working as a product development engineer Software Developer KISL Technology Centre SDN. BHD. January 2011  – Present (4 years 8 months) Software Developer KISL Technology Centre SDN. BHD. January 2011  – Present (4 years 8 months) Languages Hindi Malay English Hindi Malay English Hindi Malay English Skills Asp.net 4.0/ 2.0, C#... .NET Microsoft SQL Server XML JavaScript Web Services Visual Studio jQuery ASP.NET MVC ADO.NET WPF Software Development Skills  Asp.net 4.0/ 2.0, C#... .NET Microsoft SQL Server XML JavaScript Web Services Visual Studio jQuery ASP.NET MVC ADO.NET WPF Software Development Asp.net 4.0/ 2.0, C#... .NET Microsoft SQL Server XML JavaScript Web Services Visual Studio jQuery ASP.NET MVC ADO.NET WPF Software Development Asp.net 4.0/ 2.0, C#... .NET Microsoft SQL Server XML JavaScript Web Services Visual Studio jQuery ASP.NET MVC ADO.NET WPF Software Development ", "Summary I am a recent graduate of Duke University's Fuqua School of Business, currently participating in Intel's Accelerated Leadership Program (ALP). Summary I am a recent graduate of Duke University's Fuqua School of Business, currently participating in Intel's Accelerated Leadership Program (ALP). I am a recent graduate of Duke University's Fuqua School of Business, currently participating in Intel's Accelerated Leadership Program (ALP). I am a recent graduate of Duke University's Fuqua School of Business, currently participating in Intel's Accelerated Leadership Program (ALP). Experience Accelerated Leadership Program (\"ALP\") Associate Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Market Watch and Business Innovation Strategist Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Services Marketing Intern, Global Marketing & Corporate Communications Cisco May 2014  –  August 2014  (4 months) Raleigh-Durham, North Carolina Area Contributed Portfolio Analysis, Demand Generation Goaling, and Services Marketing Input to Mobility and Collaboration Campaigns. \nDrove creation of a highly rated breakout session on Cisco's mobility services offerings for presentation to 2,100 Cisco sales personnel. Extern, Global Operations Change Management Red Hat January 2014  –  April 2014  (4 months) Raleigh-Durham, North Carolina Area Researched, Developed, and Socialized a new process and framework for the publication of product price books. Vice President, Operations First Liberties Financial March 2010  –  May 2013  (3 years 3 months) New York, NY Managed the firm's operations and information technology. Supported the firm's sales force. Worked closely with the CEO and Chief Compliance Officer on development and implementation of supervisory and operating procedures. Associate Pelion Financial Group, Inc. December 2006  –  March 2010  (3 years 4 months) New York, NY Assisted management in pursuing a benefits administrator and investment advisor roll-up strategy. Accelerated Leadership Program (\"ALP\") Associate Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Accelerated Leadership Program (\"ALP\") Associate Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Market Watch and Business Innovation Strategist Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Market Watch and Business Innovation Strategist Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Services Marketing Intern, Global Marketing & Corporate Communications Cisco May 2014  –  August 2014  (4 months) Raleigh-Durham, North Carolina Area Contributed Portfolio Analysis, Demand Generation Goaling, and Services Marketing Input to Mobility and Collaboration Campaigns. \nDrove creation of a highly rated breakout session on Cisco's mobility services offerings for presentation to 2,100 Cisco sales personnel. Services Marketing Intern, Global Marketing & Corporate Communications Cisco May 2014  –  August 2014  (4 months) Raleigh-Durham, North Carolina Area Contributed Portfolio Analysis, Demand Generation Goaling, and Services Marketing Input to Mobility and Collaboration Campaigns. \nDrove creation of a highly rated breakout session on Cisco's mobility services offerings for presentation to 2,100 Cisco sales personnel. Extern, Global Operations Change Management Red Hat January 2014  –  April 2014  (4 months) Raleigh-Durham, North Carolina Area Researched, Developed, and Socialized a new process and framework for the publication of product price books. Extern, Global Operations Change Management Red Hat January 2014  –  April 2014  (4 months) Raleigh-Durham, North Carolina Area Researched, Developed, and Socialized a new process and framework for the publication of product price books. Vice President, Operations First Liberties Financial March 2010  –  May 2013  (3 years 3 months) New York, NY Managed the firm's operations and information technology. Supported the firm's sales force. Worked closely with the CEO and Chief Compliance Officer on development and implementation of supervisory and operating procedures. Vice President, Operations First Liberties Financial March 2010  –  May 2013  (3 years 3 months) New York, NY Managed the firm's operations and information technology. Supported the firm's sales force. Worked closely with the CEO and Chief Compliance Officer on development and implementation of supervisory and operating procedures. Associate Pelion Financial Group, Inc. December 2006  –  March 2010  (3 years 4 months) New York, NY Assisted management in pursuing a benefits administrator and investment advisor roll-up strategy. Associate Pelion Financial Group, Inc. December 2006  –  March 2010  (3 years 4 months) New York, NY Assisted management in pursuing a benefits administrator and investment advisor roll-up strategy. Languages   Skills Strategy Capital Markets Securities Management Options Fixed Income Entrepreneurship Asset Management Emerging Markets Marketing Marketing Strategy FINRA Broker-Dealer Investment Advisory Equity Trading Series 7 Broker-Dealer Operations Broker-Dealer Compliance Bloomberg Trading Public Speaking Financial Markets Business Process... Microsoft Office Mobile Cloud Social Media See 12+     See less Skills  Strategy Capital Markets Securities Management Options Fixed Income Entrepreneurship Asset Management Emerging Markets Marketing Marketing Strategy FINRA Broker-Dealer Investment Advisory Equity Trading Series 7 Broker-Dealer Operations Broker-Dealer Compliance Bloomberg Trading Public Speaking Financial Markets Business Process... Microsoft Office Mobile Cloud Social Media See 12+     See less Strategy Capital Markets Securities Management Options Fixed Income Entrepreneurship Asset Management Emerging Markets Marketing Marketing Strategy FINRA Broker-Dealer Investment Advisory Equity Trading Series 7 Broker-Dealer Operations Broker-Dealer Compliance Bloomberg Trading Public Speaking Financial Markets Business Process... Microsoft Office Mobile Cloud Social Media See 12+     See less Strategy Capital Markets Securities Management Options Fixed Income Entrepreneurship Asset Management Emerging Markets Marketing Marketing Strategy FINRA Broker-Dealer Investment Advisory Equity Trading Series 7 Broker-Dealer Operations Broker-Dealer Compliance Bloomberg Trading Public Speaking Financial Markets Business Process... Microsoft Office Mobile Cloud Social Media See 12+     See less Education Fuqua School of Business, Duke University Master of Business Administration (M.B.A.),  Marketing Analysis and Strategy & Decision Sciences , 3.85 GPA 2013  – 2015 Activities and Societies:  Fuqua Scholar ,  Dean's List ,  Admissions Fellow ,  Section 6 Communications Chair ,  FCSC Communications Chair ,  High Tech Club ,  Marketing Club ,  and Teaching Assistant for Management Communications and Professional Project Communications Cornell University Bachelor of Arts (B.A.),  History , 3.12 GPA 2001  – 2005 Activities and Societies:  Phi Sigma Kappa ,  Sailing Team ,  Habitat for Humanity University of Otago Topics in Advanced Marketing , A- 2015 MBA exchange programme Fuqua School of Business, Duke University Master of Business Administration (M.B.A.),  Marketing Analysis and Strategy & Decision Sciences , 3.85 GPA 2013  – 2015 Activities and Societies:  Fuqua Scholar ,  Dean's List ,  Admissions Fellow ,  Section 6 Communications Chair ,  FCSC Communications Chair ,  High Tech Club ,  Marketing Club ,  and Teaching Assistant for Management Communications and Professional Project Communications Fuqua School of Business, Duke University Master of Business Administration (M.B.A.),  Marketing Analysis and Strategy & Decision Sciences , 3.85 GPA 2013  – 2015 Activities and Societies:  Fuqua Scholar ,  Dean's List ,  Admissions Fellow ,  Section 6 Communications Chair ,  FCSC Communications Chair ,  High Tech Club ,  Marketing Club ,  and Teaching Assistant for Management Communications and Professional Project Communications Fuqua School of Business, Duke University Master of Business Administration (M.B.A.),  Marketing Analysis and Strategy & Decision Sciences , 3.85 GPA 2013  – 2015 Activities and Societies:  Fuqua Scholar ,  Dean's List ,  Admissions Fellow ,  Section 6 Communications Chair ,  FCSC Communications Chair ,  High Tech Club ,  Marketing Club ,  and Teaching Assistant for Management Communications and Professional Project Communications Cornell University Bachelor of Arts (B.A.),  History , 3.12 GPA 2001  – 2005 Activities and Societies:  Phi Sigma Kappa ,  Sailing Team ,  Habitat for Humanity Cornell University Bachelor of Arts (B.A.),  History , 3.12 GPA 2001  – 2005 Activities and Societies:  Phi Sigma Kappa ,  Sailing Team ,  Habitat for Humanity Cornell University Bachelor of Arts (B.A.),  History , 3.12 GPA 2001  – 2005 Activities and Societies:  Phi Sigma Kappa ,  Sailing Team ,  Habitat for Humanity University of Otago Topics in Advanced Marketing , A- 2015 MBA exchange programme University of Otago Topics in Advanced Marketing , A- 2015 MBA exchange programme University of Otago Topics in Advanced Marketing , A- 2015 MBA exchange programme Honors & Awards ", "Summary I started professionally by engineering technical solutions for complex commercial, industrial, and consumer products. Later, I discovered a passion for building new products, markets, and businesses; understanding how people use products and services; and influencing the future landscape of technology. Summary I started professionally by engineering technical solutions for complex commercial, industrial, and consumer products. Later, I discovered a passion for building new products, markets, and businesses; understanding how people use products and services; and influencing the future landscape of technology. I started professionally by engineering technical solutions for complex commercial, industrial, and consumer products. Later, I discovered a passion for building new products, markets, and businesses; understanding how people use products and services; and influencing the future landscape of technology. I started professionally by engineering technical solutions for complex commercial, industrial, and consumer products. Later, I discovered a passion for building new products, markets, and businesses; understanding how people use products and services; and influencing the future landscape of technology. Experience Product Marketing Manager - Internet of Things Group, Smart Home Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Accelerated Leadership Program (ALP) Associate Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Operations Consultant Philippine Red Cross August 2014  –  March 2015  (8 months) Manila, Philippines Funded by a grant from the MIT Philippines Relief Fund, I worked with the Philippines Red Cross on several projects, including: \n \n- Mapping formal and informal process flows of information during disaster events and developing inter-department communications strategies in order to improve response times and streamline resources \n- Planned distribution logistics for shelter construction materials to benefit thousands of displaced families from Typhoon Hayian -- largest logistics challenge (by volume) ever faced by Philippine Red Cross \n- Developing livelihood and disaster risk reduction programs for Typhoon Haiyan affected areas Leaders for Global Operations (LGO) Fellow Massachusetts Institute of Technology (MIT) June 2012  –  June 2014  (2 years 1 month) Cambridge, MA MIT LGO is a collaborative venture between the MIT School of Engineering, the MIT Sloan School of Management, and a select group of industry partners. Operations Program Manager Amazon May 2013  –  December 2013  (8 months) Seattle, WA At Amazon, I was responsible for developing new operational processes in an emerging business. By working closely with suppliers, I was able to develop and pilot new systems that substantially improved quality and delivery speed. Additionally, I utilized new analytical methods to improve inventory management, increasing in-stock availability while reducing costs. \n \n- Improved category instock rates by 69% \n- Reduced lead times by 75% \n- Identified 40% cost reduction opportunity through utilization of new inventory management techniques Silicon and Fluidic Integration Architect Hewlett-Packard August 2007  –  April 2012  (4 years 9 months) San Diego, CA As a printhead architect on the Silicon and Fluidic Integration Team (SFIT), I owned printhead microfluidic design and performance in commercial and industrial printers, including HP's first inkjet web press and the Officejet Pro X Series.  \n \n- Assessed feasibility and implementation risks of new technology integration; made go/no-go decisions for new technology into upcoming products; developed technology roadmaps for future product offerings over next 6+ years \n- Developed designs that balance speed, power limits, reliability, print quality, cost, and risk in accordance with specific market and business needs \n- Evaluated technical specifications for life, speed, reliability, and quality, negotiating with four remote internal groups \n- Initiated and qualified new test methods, tools, and procedures \n- Worked extensively with remote and cross functional teams in a lean engineering environment \n- Managed complex design and fabrication processes through several organizations and locations \n- Communicated results through written and oral reports to engineers and senior management \n- Managed budget, resources, scope, and schedule \n- Utilized analytical modeling and design of experiment methodology \n- Mentored graduate student intern \n- Achieved pen life improvement of 2x, servicing time improvement by 8x, and print quality and speed improvement of 2x for HP’s High Speed Inkjet Web Press Account Manager, New Business Development Hewlett Packard December 2008  –  June 2010  (1 year 7 months) San Diego, CA As part of HP's Digital Oasis team, I led two (out of three) pilot sites to evaluate new educational business model. \n \n- Partnered with school principals and program directors to develop overall strategy, scope, and staffing requirements \n- Developed operational processes to handle mix of standard products and complex customer projects  \n- Overhauled training program from one year to three months while maintaining revenue performance \n- Advocated for and established educational strategy for national roll-out; led team of technical writers and eight high school teachers to develop portfolio of 15 multidisciplinary lessons for students \n- Provided direct sales support for program extension into Viacom worldwide headquarters Product Marketing Manager - Internet of Things Group, Smart Home Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Product Marketing Manager - Internet of Things Group, Smart Home Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Accelerated Leadership Program (ALP) Associate Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Accelerated Leadership Program (ALP) Associate Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Operations Consultant Philippine Red Cross August 2014  –  March 2015  (8 months) Manila, Philippines Funded by a grant from the MIT Philippines Relief Fund, I worked with the Philippines Red Cross on several projects, including: \n \n- Mapping formal and informal process flows of information during disaster events and developing inter-department communications strategies in order to improve response times and streamline resources \n- Planned distribution logistics for shelter construction materials to benefit thousands of displaced families from Typhoon Hayian -- largest logistics challenge (by volume) ever faced by Philippine Red Cross \n- Developing livelihood and disaster risk reduction programs for Typhoon Haiyan affected areas Operations Consultant Philippine Red Cross August 2014  –  March 2015  (8 months) Manila, Philippines Funded by a grant from the MIT Philippines Relief Fund, I worked with the Philippines Red Cross on several projects, including: \n \n- Mapping formal and informal process flows of information during disaster events and developing inter-department communications strategies in order to improve response times and streamline resources \n- Planned distribution logistics for shelter construction materials to benefit thousands of displaced families from Typhoon Hayian -- largest logistics challenge (by volume) ever faced by Philippine Red Cross \n- Developing livelihood and disaster risk reduction programs for Typhoon Haiyan affected areas Leaders for Global Operations (LGO) Fellow Massachusetts Institute of Technology (MIT) June 2012  –  June 2014  (2 years 1 month) Cambridge, MA MIT LGO is a collaborative venture between the MIT School of Engineering, the MIT Sloan School of Management, and a select group of industry partners. Leaders for Global Operations (LGO) Fellow Massachusetts Institute of Technology (MIT) June 2012  –  June 2014  (2 years 1 month) Cambridge, MA MIT LGO is a collaborative venture between the MIT School of Engineering, the MIT Sloan School of Management, and a select group of industry partners. Operations Program Manager Amazon May 2013  –  December 2013  (8 months) Seattle, WA At Amazon, I was responsible for developing new operational processes in an emerging business. By working closely with suppliers, I was able to develop and pilot new systems that substantially improved quality and delivery speed. Additionally, I utilized new analytical methods to improve inventory management, increasing in-stock availability while reducing costs. \n \n- Improved category instock rates by 69% \n- Reduced lead times by 75% \n- Identified 40% cost reduction opportunity through utilization of new inventory management techniques Operations Program Manager Amazon May 2013  –  December 2013  (8 months) Seattle, WA At Amazon, I was responsible for developing new operational processes in an emerging business. By working closely with suppliers, I was able to develop and pilot new systems that substantially improved quality and delivery speed. Additionally, I utilized new analytical methods to improve inventory management, increasing in-stock availability while reducing costs. \n \n- Improved category instock rates by 69% \n- Reduced lead times by 75% \n- Identified 40% cost reduction opportunity through utilization of new inventory management techniques Silicon and Fluidic Integration Architect Hewlett-Packard August 2007  –  April 2012  (4 years 9 months) San Diego, CA As a printhead architect on the Silicon and Fluidic Integration Team (SFIT), I owned printhead microfluidic design and performance in commercial and industrial printers, including HP's first inkjet web press and the Officejet Pro X Series.  \n \n- Assessed feasibility and implementation risks of new technology integration; made go/no-go decisions for new technology into upcoming products; developed technology roadmaps for future product offerings over next 6+ years \n- Developed designs that balance speed, power limits, reliability, print quality, cost, and risk in accordance with specific market and business needs \n- Evaluated technical specifications for life, speed, reliability, and quality, negotiating with four remote internal groups \n- Initiated and qualified new test methods, tools, and procedures \n- Worked extensively with remote and cross functional teams in a lean engineering environment \n- Managed complex design and fabrication processes through several organizations and locations \n- Communicated results through written and oral reports to engineers and senior management \n- Managed budget, resources, scope, and schedule \n- Utilized analytical modeling and design of experiment methodology \n- Mentored graduate student intern \n- Achieved pen life improvement of 2x, servicing time improvement by 8x, and print quality and speed improvement of 2x for HP’s High Speed Inkjet Web Press Silicon and Fluidic Integration Architect Hewlett-Packard August 2007  –  April 2012  (4 years 9 months) San Diego, CA As a printhead architect on the Silicon and Fluidic Integration Team (SFIT), I owned printhead microfluidic design and performance in commercial and industrial printers, including HP's first inkjet web press and the Officejet Pro X Series.  \n \n- Assessed feasibility and implementation risks of new technology integration; made go/no-go decisions for new technology into upcoming products; developed technology roadmaps for future product offerings over next 6+ years \n- Developed designs that balance speed, power limits, reliability, print quality, cost, and risk in accordance with specific market and business needs \n- Evaluated technical specifications for life, speed, reliability, and quality, negotiating with four remote internal groups \n- Initiated and qualified new test methods, tools, and procedures \n- Worked extensively with remote and cross functional teams in a lean engineering environment \n- Managed complex design and fabrication processes through several organizations and locations \n- Communicated results through written and oral reports to engineers and senior management \n- Managed budget, resources, scope, and schedule \n- Utilized analytical modeling and design of experiment methodology \n- Mentored graduate student intern \n- Achieved pen life improvement of 2x, servicing time improvement by 8x, and print quality and speed improvement of 2x for HP’s High Speed Inkjet Web Press Account Manager, New Business Development Hewlett Packard December 2008  –  June 2010  (1 year 7 months) San Diego, CA As part of HP's Digital Oasis team, I led two (out of three) pilot sites to evaluate new educational business model. \n \n- Partnered with school principals and program directors to develop overall strategy, scope, and staffing requirements \n- Developed operational processes to handle mix of standard products and complex customer projects  \n- Overhauled training program from one year to three months while maintaining revenue performance \n- Advocated for and established educational strategy for national roll-out; led team of technical writers and eight high school teachers to develop portfolio of 15 multidisciplinary lessons for students \n- Provided direct sales support for program extension into Viacom worldwide headquarters Account Manager, New Business Development Hewlett Packard December 2008  –  June 2010  (1 year 7 months) San Diego, CA As part of HP's Digital Oasis team, I led two (out of three) pilot sites to evaluate new educational business model. \n \n- Partnered with school principals and program directors to develop overall strategy, scope, and staffing requirements \n- Developed operational processes to handle mix of standard products and complex customer projects  \n- Overhauled training program from one year to three months while maintaining revenue performance \n- Advocated for and established educational strategy for national roll-out; led team of technical writers and eight high school teachers to develop portfolio of 15 multidisciplinary lessons for students \n- Provided direct sales support for program extension into Viacom worldwide headquarters Skills Program Management Leadership Manufacturing Product Development Project Management Process Improvement Cross-functional Team... Data Analysis Product Design Supply Chain Management Skills  Program Management Leadership Manufacturing Product Development Project Management Process Improvement Cross-functional Team... Data Analysis Product Design Supply Chain Management Program Management Leadership Manufacturing Product Development Project Management Process Improvement Cross-functional Team... Data Analysis Product Design Supply Chain Management Program Management Leadership Manufacturing Product Development Project Management Process Improvement Cross-functional Team... Data Analysis Product Design Supply Chain Management Education Massachusetts Institute of Technology Master's Degree,  Mechanical Engineering 2012  – 2014 Massachusetts Institute of Technology Master of Business Administration (M.B.A.) 2012  – 2014 Massachusetts Institute of Technology Bachelor's Degree,  Mechanical Engineering 2003  – 2007 Undergraduate Research: Integrated hardware and developed software for Parkinson's testing using TCL/TK in Real Time Linux. \n \nSenior Design Project: Engineering co-lead for 15 member project that designed, developed, and built prototype of a novel wheelchair concept that improves communication between wheelchair rider and pusher. Was one of two team members to be noted on provisional patent application. \n \nSenior Thesis: Designed, built, and programmed an electro-mechanical hand position tracker that can be built at a significantly lower cost than existing solutions. System was able to translate hand positions onto computer screen for analysis. Activities and Societies:  Burton Conner ,  Filipino Student Association ,  Women's Varsity Ice Hockey ,  UROP (Undergraduate Research Opportunities Program) ,  Women's Initiative Massachusetts Institute of Technology Master's Degree,  Mechanical Engineering 2012  – 2014 Massachusetts Institute of Technology Master's Degree,  Mechanical Engineering 2012  – 2014 Massachusetts Institute of Technology Master's Degree,  Mechanical Engineering 2012  – 2014 Massachusetts Institute of Technology Master of Business Administration (M.B.A.) 2012  – 2014 Massachusetts Institute of Technology Master of Business Administration (M.B.A.) 2012  – 2014 Massachusetts Institute of Technology Master of Business Administration (M.B.A.) 2012  – 2014 Massachusetts Institute of Technology Bachelor's Degree,  Mechanical Engineering 2003  – 2007 Undergraduate Research: Integrated hardware and developed software for Parkinson's testing using TCL/TK in Real Time Linux. \n \nSenior Design Project: Engineering co-lead for 15 member project that designed, developed, and built prototype of a novel wheelchair concept that improves communication between wheelchair rider and pusher. Was one of two team members to be noted on provisional patent application. \n \nSenior Thesis: Designed, built, and programmed an electro-mechanical hand position tracker that can be built at a significantly lower cost than existing solutions. System was able to translate hand positions onto computer screen for analysis. Activities and Societies:  Burton Conner ,  Filipino Student Association ,  Women's Varsity Ice Hockey ,  UROP (Undergraduate Research Opportunities Program) ,  Women's Initiative Massachusetts Institute of Technology Bachelor's Degree,  Mechanical Engineering 2003  – 2007 Undergraduate Research: Integrated hardware and developed software for Parkinson's testing using TCL/TK in Real Time Linux. \n \nSenior Design Project: Engineering co-lead for 15 member project that designed, developed, and built prototype of a novel wheelchair concept that improves communication between wheelchair rider and pusher. Was one of two team members to be noted on provisional patent application. \n \nSenior Thesis: Designed, built, and programmed an electro-mechanical hand position tracker that can be built at a significantly lower cost than existing solutions. System was able to translate hand positions onto computer screen for analysis. Activities and Societies:  Burton Conner ,  Filipino Student Association ,  Women's Varsity Ice Hockey ,  UROP (Undergraduate Research Opportunities Program) ,  Women's Initiative Massachusetts Institute of Technology Bachelor's Degree,  Mechanical Engineering 2003  – 2007 Undergraduate Research: Integrated hardware and developed software for Parkinson's testing using TCL/TK in Real Time Linux. \n \nSenior Design Project: Engineering co-lead for 15 member project that designed, developed, and built prototype of a novel wheelchair concept that improves communication between wheelchair rider and pusher. Was one of two team members to be noted on provisional patent application. \n \nSenior Thesis: Designed, built, and programmed an electro-mechanical hand position tracker that can be built at a significantly lower cost than existing solutions. System was able to translate hand positions onto computer screen for analysis. Activities and Societies:  Burton Conner ,  Filipino Student Association ,  Women's Varsity Ice Hockey ,  UROP (Undergraduate Research Opportunities Program) ,  Women's Initiative Honors & Awards Volunteer of the Year (finalist) San Diego Science Alliance June 2012 Peer Recognition Award Sloan Senate November 2013 For development of Excel-based course scheduling tool NCAA Scholar Athlete Award NCAA (Women's Ice Hockey) March 2005 Volunteer of the Year (finalist) San Diego Science Alliance June 2012 Volunteer of the Year (finalist) San Diego Science Alliance June 2012 Volunteer of the Year (finalist) San Diego Science Alliance June 2012 Peer Recognition Award Sloan Senate November 2013 For development of Excel-based course scheduling tool Peer Recognition Award Sloan Senate November 2013 For development of Excel-based course scheduling tool Peer Recognition Award Sloan Senate November 2013 For development of Excel-based course scheduling tool NCAA Scholar Athlete Award NCAA (Women's Ice Hockey) March 2005 NCAA Scholar Athlete Award NCAA (Women's Ice Hockey) March 2005 NCAA Scholar Athlete Award NCAA (Women's Ice Hockey) March 2005 ", "Experience Retail Marketing Associate Intel Corporation October 2014  – Present (11 months) Indonesia Project Manager Quantum Integrated Services for Intel Indonesia July 2013  – Present (2 years 2 months) Greater Jakarta Area, Indonesia Key Responsibilities:  \n \n-\tDevelop and maintaining a proper top-down structured Project Plan  \n-\tDefine the resource requirments to deliver the project execution \n-\tManaging co-ordination of partners engaged in project work \n-\tManaging and controling project deliverables in line with plan.  \n-\tMonitoring project progress and performance  \n-\tRecording and managing project issues and escalating where necessary.  \n-\tDefine the content and format of status report providing to Retail Marketing Manager  \n-\tLiaises with and updates progress to Retail Marketing Manager and Marketing Director  \n-\tManaging project evaluation activities Account Executive MB1 Event Management Services February 2011  –  July 2013  (2 years 6 months) Greater Jakarta Area, Indonesia Key Responsibilities :  \n-\tDrive revenue to the organization.  \n-\tMaintains and develop the business relationship between the agency and the client to create an opportunity up sell.  \n-\tBecome the liaison between the client and the agency team to ensure the client's needs and goals are being met on every project, act as trusted advisor to assist client’s needs.  \n-\tManage pitches to the client, the client's project budget and developing relationships in order to acquire new accounts.  \n-\tTake a direct role in planning events as well, as Project Leader Retail Marketing Associate Intel Corporation October 2014  – Present (11 months) Indonesia Retail Marketing Associate Intel Corporation October 2014  – Present (11 months) Indonesia Project Manager Quantum Integrated Services for Intel Indonesia July 2013  – Present (2 years 2 months) Greater Jakarta Area, Indonesia Key Responsibilities:  \n \n-\tDevelop and maintaining a proper top-down structured Project Plan  \n-\tDefine the resource requirments to deliver the project execution \n-\tManaging co-ordination of partners engaged in project work \n-\tManaging and controling project deliverables in line with plan.  \n-\tMonitoring project progress and performance  \n-\tRecording and managing project issues and escalating where necessary.  \n-\tDefine the content and format of status report providing to Retail Marketing Manager  \n-\tLiaises with and updates progress to Retail Marketing Manager and Marketing Director  \n-\tManaging project evaluation activities Project Manager Quantum Integrated Services for Intel Indonesia July 2013  – Present (2 years 2 months) Greater Jakarta Area, Indonesia Key Responsibilities:  \n \n-\tDevelop and maintaining a proper top-down structured Project Plan  \n-\tDefine the resource requirments to deliver the project execution \n-\tManaging co-ordination of partners engaged in project work \n-\tManaging and controling project deliverables in line with plan.  \n-\tMonitoring project progress and performance  \n-\tRecording and managing project issues and escalating where necessary.  \n-\tDefine the content and format of status report providing to Retail Marketing Manager  \n-\tLiaises with and updates progress to Retail Marketing Manager and Marketing Director  \n-\tManaging project evaluation activities Account Executive MB1 Event Management Services February 2011  –  July 2013  (2 years 6 months) Greater Jakarta Area, Indonesia Key Responsibilities :  \n-\tDrive revenue to the organization.  \n-\tMaintains and develop the business relationship between the agency and the client to create an opportunity up sell.  \n-\tBecome the liaison between the client and the agency team to ensure the client's needs and goals are being met on every project, act as trusted advisor to assist client’s needs.  \n-\tManage pitches to the client, the client's project budget and developing relationships in order to acquire new accounts.  \n-\tTake a direct role in planning events as well, as Project Leader Account Executive MB1 Event Management Services February 2011  –  July 2013  (2 years 6 months) Greater Jakarta Area, Indonesia Key Responsibilities :  \n-\tDrive revenue to the organization.  \n-\tMaintains and develop the business relationship between the agency and the client to create an opportunity up sell.  \n-\tBecome the liaison between the client and the agency team to ensure the client's needs and goals are being met on every project, act as trusted advisor to assist client’s needs.  \n-\tManage pitches to the client, the client's project budget and developing relationships in order to acquire new accounts.  \n-\tTake a direct role in planning events as well, as Project Leader Languages   Skills Skills     Education St. Theresia Tourism High School Tourism 1999  – 2002 Activities and Societies:  During my study ,  I was an active member of several organizations inside school as well as outside of school. I was in charge of OSIS Dept. Production Unit SMK St. THERESIA (2001) and also Dept. Journalist (2000) St. Theresia Tourism High School Tourism 1999  – 2002 Activities and Societies:  During my study ,  I was an active member of several organizations inside school as well as outside of school. I was in charge of OSIS Dept. Production Unit SMK St. THERESIA (2001) and also Dept. Journalist (2000) St. Theresia Tourism High School Tourism 1999  – 2002 Activities and Societies:  During my study ,  I was an active member of several organizations inside school as well as outside of school. I was in charge of OSIS Dept. Production Unit SMK St. THERESIA (2001) and also Dept. Journalist (2000) St. Theresia Tourism High School Tourism 1999  – 2002 Activities and Societies:  During my study ,  I was an active member of several organizations inside school as well as outside of school. I was in charge of OSIS Dept. Production Unit SMK St. THERESIA (2001) and also Dept. Journalist (2000) Honors & Awards ", "Summary Strong experience successfully filling a diverse set of finance roles in manufacturing, strategic logistics and transportation, strategic sales and marketing, banking, real estate lending, private equity and online finance publication.  \n \nI want to continue my career in progressive roles that will use my financial analysis, accounting, business communication and presentation skills to support sales, marketing,corporate finance, consulting and project management teams. Specialties:Financial analysis; Financial valuation techniques; Financial modeling; Real estate finance; P&L analysis; Financial reporting; Due diligence; Legal filings review, analysis and reporting; Business management consulting; Multilingual translations. Summary Strong experience successfully filling a diverse set of finance roles in manufacturing, strategic logistics and transportation, strategic sales and marketing, banking, real estate lending, private equity and online finance publication.  \n \nI want to continue my career in progressive roles that will use my financial analysis, accounting, business communication and presentation skills to support sales, marketing,corporate finance, consulting and project management teams. Specialties:Financial analysis; Financial valuation techniques; Financial modeling; Real estate finance; P&L analysis; Financial reporting; Due diligence; Legal filings review, analysis and reporting; Business management consulting; Multilingual translations. Strong experience successfully filling a diverse set of finance roles in manufacturing, strategic logistics and transportation, strategic sales and marketing, banking, real estate lending, private equity and online finance publication.  \n \nI want to continue my career in progressive roles that will use my financial analysis, accounting, business communication and presentation skills to support sales, marketing,corporate finance, consulting and project management teams. Specialties:Financial analysis; Financial valuation techniques; Financial modeling; Real estate finance; P&L analysis; Financial reporting; Due diligence; Legal filings review, analysis and reporting; Business management consulting; Multilingual translations. Strong experience successfully filling a diverse set of finance roles in manufacturing, strategic logistics and transportation, strategic sales and marketing, banking, real estate lending, private equity and online finance publication.  \n \nI want to continue my career in progressive roles that will use my financial analysis, accounting, business communication and presentation skills to support sales, marketing,corporate finance, consulting and project management teams. Specialties:Financial analysis; Financial valuation techniques; Financial modeling; Real estate finance; P&L analysis; Financial reporting; Due diligence; Legal filings review, analysis and reporting; Business management consulting; Multilingual translations. Experience Sr. Finance Associate Intel Corporation November 2010  – Present (4 years 10 months) Chandler, AZ Responsibilities \n\tManage the development of business unit budgets and capital spending forecasts – Total value: $380M \n\tLead and coordinate the activities of finance and operations teams during forecasting and budgetary sessions \n\tPrepare month close reports and communicate variances to forecasts and their business drivers\t \n\tReview and analyze special projects and investments proposals to assess their viability and make recommendations \n\tBuild and maintain financial valuations and reporting models to support decision making processes \n\tLead and manage projects to drive cost efficiencies and provide process improvement solutions \n\tAnalyze operations financials to establish and report operational performance metrics and scorecards  \n \nRecent accomplishments \no\tManaged the post merger integration of Infineon, AG and the Intel Logistics Finance systems  \no\tPrepared the annual “State of Freight” report for the Customer Planning and Logistics Fulfillment Group \no\tStreamlined and improved the efficiency of forecasting and budgetary sessions to save 200 process hours \no\tCo-chaired the Logistics and Transportation Savings Council meeting Sr. P&L Analyst - Summer Associate J.P. Morgan Chase & Co 2009  –  2009  (less than a year) Wilmington, DE Lead Financial Consultant E*TRADE Financial September 2001  –  November 2007  (6 years 3 months) Arlington, VA Investment Analyst Intern Global Environment Fund May 2001  –  September 2001  (5 months) Washington DC Sr. Securities Analyst SNL Financial March 2000  –  May 2001  (1 year 3 months) Washington DC Sr. Finance Associate Intel Corporation November 2010  – Present (4 years 10 months) Chandler, AZ Responsibilities \n\tManage the development of business unit budgets and capital spending forecasts – Total value: $380M \n\tLead and coordinate the activities of finance and operations teams during forecasting and budgetary sessions \n\tPrepare month close reports and communicate variances to forecasts and their business drivers\t \n\tReview and analyze special projects and investments proposals to assess their viability and make recommendations \n\tBuild and maintain financial valuations and reporting models to support decision making processes \n\tLead and manage projects to drive cost efficiencies and provide process improvement solutions \n\tAnalyze operations financials to establish and report operational performance metrics and scorecards  \n \nRecent accomplishments \no\tManaged the post merger integration of Infineon, AG and the Intel Logistics Finance systems  \no\tPrepared the annual “State of Freight” report for the Customer Planning and Logistics Fulfillment Group \no\tStreamlined and improved the efficiency of forecasting and budgetary sessions to save 200 process hours \no\tCo-chaired the Logistics and Transportation Savings Council meeting Sr. Finance Associate Intel Corporation November 2010  – Present (4 years 10 months) Chandler, AZ Responsibilities \n\tManage the development of business unit budgets and capital spending forecasts – Total value: $380M \n\tLead and coordinate the activities of finance and operations teams during forecasting and budgetary sessions \n\tPrepare month close reports and communicate variances to forecasts and their business drivers\t \n\tReview and analyze special projects and investments proposals to assess their viability and make recommendations \n\tBuild and maintain financial valuations and reporting models to support decision making processes \n\tLead and manage projects to drive cost efficiencies and provide process improvement solutions \n\tAnalyze operations financials to establish and report operational performance metrics and scorecards  \n \nRecent accomplishments \no\tManaged the post merger integration of Infineon, AG and the Intel Logistics Finance systems  \no\tPrepared the annual “State of Freight” report for the Customer Planning and Logistics Fulfillment Group \no\tStreamlined and improved the efficiency of forecasting and budgetary sessions to save 200 process hours \no\tCo-chaired the Logistics and Transportation Savings Council meeting Sr. P&L Analyst - Summer Associate J.P. Morgan Chase & Co 2009  –  2009  (less than a year) Wilmington, DE Sr. P&L Analyst - Summer Associate J.P. Morgan Chase & Co 2009  –  2009  (less than a year) Wilmington, DE Lead Financial Consultant E*TRADE Financial September 2001  –  November 2007  (6 years 3 months) Arlington, VA Lead Financial Consultant E*TRADE Financial September 2001  –  November 2007  (6 years 3 months) Arlington, VA Investment Analyst Intern Global Environment Fund May 2001  –  September 2001  (5 months) Washington DC Investment Analyst Intern Global Environment Fund May 2001  –  September 2001  (5 months) Washington DC Sr. Securities Analyst SNL Financial March 2000  –  May 2001  (1 year 3 months) Washington DC Sr. Securities Analyst SNL Financial March 2000  –  May 2001  (1 year 3 months) Washington DC Skills Excellent Financial... Marketing Research Building Strong... US GAAP Financial Analysis Financial Reporting French German Communication Financial Statements Statistical Data... Corporate Finance Financial Modeling Valuation Due Diligence Process Improvement Forecasting Business Strategy Analysis Accounting Finance Project Management Private Equity Managerial Finance Cross-functional Team... Business Analysis Financial Accounting Hyperion Enterprise Microsoft Excel Financial Statement... Market Research Banking Credit Data Analysis See 19+     See less Skills  Excellent Financial... Marketing Research Building Strong... US GAAP Financial Analysis Financial Reporting French German Communication Financial Statements Statistical Data... Corporate Finance Financial Modeling Valuation Due Diligence Process Improvement Forecasting Business Strategy Analysis Accounting Finance Project Management Private Equity Managerial Finance Cross-functional Team... Business Analysis Financial Accounting Hyperion Enterprise Microsoft Excel Financial Statement... Market Research Banking Credit Data Analysis See 19+     See less Excellent Financial... Marketing Research Building Strong... US GAAP Financial Analysis Financial Reporting French German Communication Financial Statements Statistical Data... Corporate Finance Financial Modeling Valuation Due Diligence Process Improvement Forecasting Business Strategy Analysis Accounting Finance Project Management Private Equity Managerial Finance Cross-functional Team... Business Analysis Financial Accounting Hyperion Enterprise Microsoft Excel Financial Statement... Market Research Banking Credit Data Analysis See 19+     See less Excellent Financial... Marketing Research Building Strong... US GAAP Financial Analysis Financial Reporting French German Communication Financial Statements Statistical Data... Corporate Finance Financial Modeling Valuation Due Diligence Process Improvement Forecasting Business Strategy Analysis Accounting Finance Project Management Private Equity Managerial Finance Cross-functional Team... Business Analysis Financial Accounting Hyperion Enterprise Microsoft Excel Financial Statement... Market Research Banking Credit Data Analysis See 19+     See less Education Howard University MBA,  Finance 2010 Concordia University B.A.,  Economics Howard University MBA,  Finance 2010 Howard University MBA,  Finance 2010 Howard University MBA,  Finance 2010 Concordia University B.A.,  Economics Concordia University B.A.,  Economics Concordia University B.A.,  Economics ", "Experience Summer Associate Northern Light Venture Capital June 2013  –  September 2013  (4 months) Beijing City, China Senior Engineer E Ink Corporation 2006  –  2012  (6 years) Greater Boston Area Product Engineer Micron Technology 2005  –  2006  (1 year) Summer Associate Northern Light Venture Capital June 2013  –  September 2013  (4 months) Beijing City, China Summer Associate Northern Light Venture Capital June 2013  –  September 2013  (4 months) Beijing City, China Senior Engineer E Ink Corporation 2006  –  2012  (6 years) Greater Boston Area Senior Engineer E Ink Corporation 2006  –  2012  (6 years) Greater Boston Area Product Engineer Micron Technology 2005  –  2006  (1 year) Product Engineer Micron Technology 2005  –  2006  (1 year) Languages English Chinese English Chinese English Chinese Skills Skills     Education Northwestern University - Kellogg School of Management MBA 2012  – 2014 Univeristy of Michigan, Ann Arbor M.S.,  Electrical Engineering 2003  – 2005 National Taiwan University B.S.,  Electrical Engineering 1997  – 2001 Northwestern University - Kellogg School of Management MBA 2012  – 2014 Northwestern University - Kellogg School of Management MBA 2012  – 2014 Northwestern University - Kellogg School of Management MBA 2012  – 2014 Univeristy of Michigan, Ann Arbor M.S.,  Electrical Engineering 2003  – 2005 Univeristy of Michigan, Ann Arbor M.S.,  Electrical Engineering 2003  – 2005 Univeristy of Michigan, Ann Arbor M.S.,  Electrical Engineering 2003  – 2005 National Taiwan University B.S.,  Electrical Engineering 1997  – 2001 National Taiwan University B.S.,  Electrical Engineering 1997  – 2001 National Taiwan University B.S.,  Electrical Engineering 1997  – 2001 ", "Experience ALP Associate Intel Corporation July 2014  – Present (1 year 2 months) Santa Clara, CA Senior Platform Engineer Club Car, Ingersoll Rand August 2007  –  August 2012  (5 years 1 month) Augusta, Georgia Area Project Management / Vehicle Development / Value Engineering / Product Integrity Powertrain Engineer China Sourcing Office, Ford Motor Company October 2004  –  August 2006  (1 year 11 months) Shanghai, China Project Management / Supplier Development / Product Design Powertrain Intern China Sourcing Office, Ford Motor Company January 2004  –  July 2004  (7 months) Shanghai, China Competitor Benchmarking / Supplier Evaluation Summer Intern Global Research Center, General Electric July 2003  –  September 2003  (3 months) Shanghai, China Six Sigma Deployment / New Product Development ALP Associate Intel Corporation July 2014  – Present (1 year 2 months) Santa Clara, CA ALP Associate Intel Corporation July 2014  – Present (1 year 2 months) Santa Clara, CA Senior Platform Engineer Club Car, Ingersoll Rand August 2007  –  August 2012  (5 years 1 month) Augusta, Georgia Area Project Management / Vehicle Development / Value Engineering / Product Integrity Senior Platform Engineer Club Car, Ingersoll Rand August 2007  –  August 2012  (5 years 1 month) Augusta, Georgia Area Project Management / Vehicle Development / Value Engineering / Product Integrity Powertrain Engineer China Sourcing Office, Ford Motor Company October 2004  –  August 2006  (1 year 11 months) Shanghai, China Project Management / Supplier Development / Product Design Powertrain Engineer China Sourcing Office, Ford Motor Company October 2004  –  August 2006  (1 year 11 months) Shanghai, China Project Management / Supplier Development / Product Design Powertrain Intern China Sourcing Office, Ford Motor Company January 2004  –  July 2004  (7 months) Shanghai, China Competitor Benchmarking / Supplier Evaluation Powertrain Intern China Sourcing Office, Ford Motor Company January 2004  –  July 2004  (7 months) Shanghai, China Competitor Benchmarking / Supplier Evaluation Summer Intern Global Research Center, General Electric July 2003  –  September 2003  (3 months) Shanghai, China Six Sigma Deployment / New Product Development Summer Intern Global Research Center, General Electric July 2003  –  September 2003  (3 months) Shanghai, China Six Sigma Deployment / New Product Development Languages English Native or bilingual proficiency Mandarin Native or bilingual proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Project Management Bilingual Hands-on Vehicle Repair Six Sigma Lean Manufacturing Vehicles Product Development Process Improvement Cross-functional Team... Product Design Supplier Evaluation Skills  Project Management Bilingual Hands-on Vehicle Repair Six Sigma Lean Manufacturing Vehicles Product Development Process Improvement Cross-functional Team... Product Design Supplier Evaluation Project Management Bilingual Hands-on Vehicle Repair Six Sigma Lean Manufacturing Vehicles Product Development Process Improvement Cross-functional Team... Product Design Supplier Evaluation Project Management Bilingual Hands-on Vehicle Repair Six Sigma Lean Manufacturing Vehicles Product Development Process Improvement Cross-functional Team... Product Design Supplier Evaluation Education MIT Sloan School of Management Master of Business Administration (MBA),  General Management 2012  – 2014 Boston University Master,  Manufacturing , 3.86 Dean's Fellowship Activities and Societies:  ASME ,  SAE Shanghai Jiao Tong University B.S. & M.S.,  Materials Science and Engineering; Minor: English , 3.9 MIT Sloan School of Management Master of Business Administration (MBA),  General Management 2012  – 2014 MIT Sloan School of Management Master of Business Administration (MBA),  General Management 2012  – 2014 MIT Sloan School of Management Master of Business Administration (MBA),  General Management 2012  – 2014 Boston University Master,  Manufacturing , 3.86 Dean's Fellowship Activities and Societies:  ASME ,  SAE Boston University Master,  Manufacturing , 3.86 Dean's Fellowship Activities and Societies:  ASME ,  SAE Boston University Master,  Manufacturing , 3.86 Dean's Fellowship Activities and Societies:  ASME ,  SAE Shanghai Jiao Tong University B.S. & M.S.,  Materials Science and Engineering; Minor: English , 3.9 Shanghai Jiao Tong University B.S. & M.S.,  Materials Science and Engineering; Minor: English , 3.9 Shanghai Jiao Tong University B.S. & M.S.,  Materials Science and Engineering; Minor: English , 3.9 ", "Summary Equity Analysis and Recommendations \nFinancial Institutions Credit Analysis  \nMacro Analysis Specialties:Financial Sector Analysis \nMacro Analysis Summary Equity Analysis and Recommendations \nFinancial Institutions Credit Analysis  \nMacro Analysis Specialties:Financial Sector Analysis \nMacro Analysis Equity Analysis and Recommendations \nFinancial Institutions Credit Analysis  \nMacro Analysis Specialties:Financial Sector Analysis \nMacro Analysis Equity Analysis and Recommendations \nFinancial Institutions Credit Analysis  \nMacro Analysis Specialties:Financial Sector Analysis \nMacro Analysis Experience Treasury Associate Intel Corporation July 2011  – Present (4 years 2 months) Israel Investment Manager Master in Finance Program Student London Business School August 2010  –  July 2011  (1 year) Student in the \"Master in Finance\" Program (Full Time) at London Business School. Financial Institutions Credit Analyst Bank Leumi March 2009  –  August 2010  (1 year 6 months) * Financial Institutions Credit Analysis for Prop desk and Risk unit \n* Macro Analysis Equity Analyst Bank Leumi August 2006  –  March 2009  (2 years 8 months) * Equity recommendations \n* Macro Analysis Treasury Associate Intel Corporation July 2011  – Present (4 years 2 months) Israel Investment Manager Treasury Associate Intel Corporation July 2011  – Present (4 years 2 months) Israel Investment Manager Master in Finance Program Student London Business School August 2010  –  July 2011  (1 year) Student in the \"Master in Finance\" Program (Full Time) at London Business School. Master in Finance Program Student London Business School August 2010  –  July 2011  (1 year) Student in the \"Master in Finance\" Program (Full Time) at London Business School. Financial Institutions Credit Analyst Bank Leumi March 2009  –  August 2010  (1 year 6 months) * Financial Institutions Credit Analysis for Prop desk and Risk unit \n* Macro Analysis Financial Institutions Credit Analyst Bank Leumi March 2009  –  August 2010  (1 year 6 months) * Financial Institutions Credit Analysis for Prop desk and Risk unit \n* Macro Analysis Equity Analyst Bank Leumi August 2006  –  March 2009  (2 years 8 months) * Equity recommendations \n* Macro Analysis Equity Analyst Bank Leumi August 2006  –  March 2009  (2 years 8 months) * Equity recommendations \n* Macro Analysis Skills Investments Equities Financial Risk Financial Modeling Financial Institutions Credit Financial Analysis Banking Business Analysis Corporate Finance Business Strategy Macro Analysis Valuation Credit Analysis Skills  Investments Equities Financial Risk Financial Modeling Financial Institutions Credit Financial Analysis Banking Business Analysis Corporate Finance Business Strategy Macro Analysis Valuation Credit Analysis Investments Equities Financial Risk Financial Modeling Financial Institutions Credit Financial Analysis Banking Business Analysis Corporate Finance Business Strategy Macro Analysis Valuation Credit Analysis Investments Equities Financial Risk Financial Modeling Financial Institutions Credit Financial Analysis Banking Business Analysis Corporate Finance Business Strategy Macro Analysis Valuation Credit Analysis Education Tel Aviv University MA,  Economics 2004  – 2008 London Business School Tel Aviv University MA,  Economics 2004  – 2008 Tel Aviv University MA,  Economics 2004  – 2008 Tel Aviv University MA,  Economics 2004  – 2008 London Business School London Business School London Business School ", "Experience Product Manager, Wearables (ALP Associate) Intel Corporation July 2015  – Present (2 months) Santa Clara, California MBA Innovation Intern Symantec 2014  –  2014  (less than a year) Manager Strata Decision Technology May 2009  –  June 2013  (4 years 2 months) Investment Banking Analyst J.P. Morgan Securities Inc. 2007  –  2008  (1 year) Product Manager, Wearables (ALP Associate) Intel Corporation July 2015  – Present (2 months) Santa Clara, California Product Manager, Wearables (ALP Associate) Intel Corporation July 2015  – Present (2 months) Santa Clara, California MBA Innovation Intern Symantec 2014  –  2014  (less than a year) MBA Innovation Intern Symantec 2014  –  2014  (less than a year) Manager Strata Decision Technology May 2009  –  June 2013  (4 years 2 months) Manager Strata Decision Technology May 2009  –  June 2013  (4 years 2 months) Investment Banking Analyst J.P. Morgan Securities Inc. 2007  –  2008  (1 year) Investment Banking Analyst J.P. Morgan Securities Inc. 2007  –  2008  (1 year) Skills Financial Modeling Analytics Data Analysis Valuation Financial Analysis Business Analysis Analysis Business Process... Corporate Finance Skills  Financial Modeling Analytics Data Analysis Valuation Financial Analysis Business Analysis Analysis Business Process... Corporate Finance Financial Modeling Analytics Data Analysis Valuation Financial Analysis Business Analysis Analysis Business Process... Corporate Finance Financial Modeling Analytics Data Analysis Valuation Financial Analysis Business Analysis Analysis Business Process... Corporate Finance Education Dartmouth College - The Tuck School of Business at Dartmouth Master of Business Administration (MBA) 2013  – 2015 The University of Chicago A.B. Economics, Minor in South Asian Languages and Civilizations 2003  – 2007 Dartmouth College - The Tuck School of Business at Dartmouth Master of Business Administration (MBA) 2013  – 2015 Dartmouth College - The Tuck School of Business at Dartmouth Master of Business Administration (MBA) 2013  – 2015 Dartmouth College - The Tuck School of Business at Dartmouth Master of Business Administration (MBA) 2013  – 2015 The University of Chicago A.B. Economics, Minor in South Asian Languages and Civilizations 2003  – 2007 The University of Chicago A.B. Economics, Minor in South Asian Languages and Civilizations 2003  – 2007 The University of Chicago A.B. Economics, Minor in South Asian Languages and Civilizations 2003  – 2007 ", "Experience Independent Representative ACN Telecommunications Tax Associate Intel Corporation June 2006  – Present (9 years 3 months) Independent Representative ACN Telecommunications Independent Representative ACN Telecommunications Tax Associate Intel Corporation June 2006  – Present (9 years 3 months) Tax Associate Intel Corporation June 2006  – Present (9 years 3 months) ", "Experience Sales and Marketing Associate Intel Corporation October 2010  – Present (4 years 11 months) Marketing Specialist Intel Corporation October 2009  –  October 2010  (1 year 1 month) Account Executive Weber Shandwick August 2009  –  January 2010  (6 months) Sales and Marketing Associate Intel Corporation October 2010  – Present (4 years 11 months) Sales and Marketing Associate Intel Corporation October 2010  – Present (4 years 11 months) Marketing Specialist Intel Corporation October 2009  –  October 2010  (1 year 1 month) Marketing Specialist Intel Corporation October 2009  –  October 2010  (1 year 1 month) Account Executive Weber Shandwick August 2009  –  January 2010  (6 months) Account Executive Weber Shandwick August 2009  –  January 2010  (6 months) Education National Chiao Tung University Bachelor's degree,  Business , Management, Marketing, and Related Support Services 2005  – 2009 National Chiao Tung University Bachelor's degree,  Business , Management, Marketing, and Related Support Services 2005  – 2009 National Chiao Tung University Bachelor's degree,  Business , Management, Marketing, and Related Support Services 2005  – 2009 National Chiao Tung University Bachelor's degree,  Business , Management, Marketing, and Related Support Services 2005  – 2009 ", "Experience Accelerated Leadership Program (ALP) Associate Intel Corporation July 2014  – Present (1 year 2 months) Santa Clara, CA The Accelerated Leadership Program (ALP) is a rotational general management opportunity designed by Intel's executive team to develop Intel's most influential future leaders. \nhttp://www.intel.com/content/www/us/en/jobs/locations/united-states/students/programs/accelerated-leadership-program.html Senior Finance Manager,US Finance and Strategy Walmart June 2013  –  August 2013  (3 months) Bentonville, Arkansas Senior Manager, Business Development AGRIA CORPORATION March 2010  –  July 2012  (2 years 5 months) BEIJING The first China-based agriculture company listed on NYSE, operating in China, Oceania and South America. \n \nServed as core team member executing the company-wide restructuring strategy, through a series of domestic and cross-border acquisition and divestiture transactions, including the largest agricultural service company in New Zealand. Manager, Transaction Service PwC January 2006  –  January 2010  (4 years 1 month) Beijing Led end-to-end process of 35+ engagements. Conducted financial due diligence, financial modeling assistance, business plan review, contract terms review and/or post deal integration services for both financial and corporate investors Senior Associate, Audit PwC August 2002  –  January 2006  (3 years 6 months) Bejing, Shenzhen Led full cycle of planning, field work, team monitoring and report writing for 20+ audit engagements of IPO(PRC, Hong Kong, US), Annual Audit and Sarbanes-Oxley compliance review. Accelerated Leadership Program (ALP) Associate Intel Corporation July 2014  – Present (1 year 2 months) Santa Clara, CA The Accelerated Leadership Program (ALP) is a rotational general management opportunity designed by Intel's executive team to develop Intel's most influential future leaders. \nhttp://www.intel.com/content/www/us/en/jobs/locations/united-states/students/programs/accelerated-leadership-program.html Accelerated Leadership Program (ALP) Associate Intel Corporation July 2014  – Present (1 year 2 months) Santa Clara, CA The Accelerated Leadership Program (ALP) is a rotational general management opportunity designed by Intel's executive team to develop Intel's most influential future leaders. \nhttp://www.intel.com/content/www/us/en/jobs/locations/united-states/students/programs/accelerated-leadership-program.html Senior Finance Manager,US Finance and Strategy Walmart June 2013  –  August 2013  (3 months) Bentonville, Arkansas Senior Finance Manager,US Finance and Strategy Walmart June 2013  –  August 2013  (3 months) Bentonville, Arkansas Senior Manager, Business Development AGRIA CORPORATION March 2010  –  July 2012  (2 years 5 months) BEIJING The first China-based agriculture company listed on NYSE, operating in China, Oceania and South America. \n \nServed as core team member executing the company-wide restructuring strategy, through a series of domestic and cross-border acquisition and divestiture transactions, including the largest agricultural service company in New Zealand. Senior Manager, Business Development AGRIA CORPORATION March 2010  –  July 2012  (2 years 5 months) BEIJING The first China-based agriculture company listed on NYSE, operating in China, Oceania and South America. \n \nServed as core team member executing the company-wide restructuring strategy, through a series of domestic and cross-border acquisition and divestiture transactions, including the largest agricultural service company in New Zealand. Manager, Transaction Service PwC January 2006  –  January 2010  (4 years 1 month) Beijing Led end-to-end process of 35+ engagements. Conducted financial due diligence, financial modeling assistance, business plan review, contract terms review and/or post deal integration services for both financial and corporate investors Manager, Transaction Service PwC January 2006  –  January 2010  (4 years 1 month) Beijing Led end-to-end process of 35+ engagements. Conducted financial due diligence, financial modeling assistance, business plan review, contract terms review and/or post deal integration services for both financial and corporate investors Senior Associate, Audit PwC August 2002  –  January 2006  (3 years 6 months) Bejing, Shenzhen Led full cycle of planning, field work, team monitoring and report writing for 20+ audit engagements of IPO(PRC, Hong Kong, US), Annual Audit and Sarbanes-Oxley compliance review. Senior Associate, Audit PwC August 2002  –  January 2006  (3 years 6 months) Bejing, Shenzhen Led full cycle of planning, field work, team monitoring and report writing for 20+ audit engagements of IPO(PRC, Hong Kong, US), Annual Audit and Sarbanes-Oxley compliance review. Skills Corporate Finance Valuation Due Diligence Financial Modeling Financial Analysis Strategic Financial... Mergers & Acquisitions Cross-border... Corporate Development Private Equity Sarbanes-Oxley Act IFRS US GAAP Skills  Corporate Finance Valuation Due Diligence Financial Modeling Financial Analysis Strategic Financial... Mergers & Acquisitions Cross-border... Corporate Development Private Equity Sarbanes-Oxley Act IFRS US GAAP Corporate Finance Valuation Due Diligence Financial Modeling Financial Analysis Strategic Financial... Mergers & Acquisitions Cross-border... Corporate Development Private Equity Sarbanes-Oxley Act IFRS US GAAP Corporate Finance Valuation Due Diligence Financial Modeling Financial Analysis Strategic Financial... Mergers & Acquisitions Cross-border... Corporate Development Private Equity Sarbanes-Oxley Act IFRS US GAAP Education Columbia Business School MBA Candidate,  Finance 2012  – 2014 Renmin University of China Bachelor,  Economics The University of Hong Kong Activities and Societies:  Student Exchange Program Columbia Business School MBA Candidate,  Finance 2012  – 2014 Columbia Business School MBA Candidate,  Finance 2012  – 2014 Columbia Business School MBA Candidate,  Finance 2012  – 2014 Renmin University of China Bachelor,  Economics Renmin University of China Bachelor,  Economics Renmin University of China Bachelor,  Economics The University of Hong Kong Activities and Societies:  Student Exchange Program The University of Hong Kong Activities and Societies:  Student Exchange Program The University of Hong Kong Activities and Societies:  Student Exchange Program ", "Experience Transaction Associate Intel Corporation Transaction Associate Intel Corporation Transaction Associate Intel Corporation Education Black Hills State University 1972  – 1976 Black Hills State University 1972  – 1976 Black Hills State University 1972  – 1976 Black Hills State University 1972  – 1976 ", "Skills Accounting Financial Analysis Skills  Accounting Financial Analysis Accounting Financial Analysis Accounting Financial Analysis ", "Summary - Associate in Intel's Accelerated Leadership Program \n \n- 6 years of leadership experience in technical roles and a proven track record of solving complex problems \n \n- Graduate of The Wharton School, University of Pennsylvania with concentrations in entrepreneurial management and operations. Graduate of the US Naval Academy and Stanford University in electrical engineering. Graduate of the Navy's Nuclear Propulsion Program and certified Nuclear Engineer by the US Department of Energy \n \n- Core Competencies: analysis, project management, communications Summary - Associate in Intel's Accelerated Leadership Program \n \n- 6 years of leadership experience in technical roles and a proven track record of solving complex problems \n \n- Graduate of The Wharton School, University of Pennsylvania with concentrations in entrepreneurial management and operations. Graduate of the US Naval Academy and Stanford University in electrical engineering. Graduate of the Navy's Nuclear Propulsion Program and certified Nuclear Engineer by the US Department of Energy \n \n- Core Competencies: analysis, project management, communications - Associate in Intel's Accelerated Leadership Program \n \n- 6 years of leadership experience in technical roles and a proven track record of solving complex problems \n \n- Graduate of The Wharton School, University of Pennsylvania with concentrations in entrepreneurial management and operations. Graduate of the US Naval Academy and Stanford University in electrical engineering. Graduate of the Navy's Nuclear Propulsion Program and certified Nuclear Engineer by the US Department of Energy \n \n- Core Competencies: analysis, project management, communications - Associate in Intel's Accelerated Leadership Program \n \n- 6 years of leadership experience in technical roles and a proven track record of solving complex problems \n \n- Graduate of The Wharton School, University of Pennsylvania with concentrations in entrepreneurial management and operations. Graduate of the US Naval Academy and Stanford University in electrical engineering. Graduate of the Navy's Nuclear Propulsion Program and certified Nuclear Engineer by the US Department of Energy \n \n- Core Competencies: analysis, project management, communications Experience ALP Associate Intel Corporation July 2014  – Present (1 year 2 months) - Rotational program across business units and functions \n \n- First rotation: Product Marketing Engineer, Data Center SSD, Non-Volatile Memory Solutions Group Summer Consultant The Boston Consulting Group June 2013  –  August 2013  (3 months) Greater Chicago Area - Advised a major industrial goods company on growth opportunities Submarine Operations Specialist for the Chief of Naval Operations US Navy July 2010  –  June 2012  (2 years) Washington, DC - Supervised the collection, processing and dissemination of intelligence from naval and joint operations \n- Briefed senior military and civilian leadership at the Pentagon Submarine Division Officer, USS MIAMI (SSN 755) US Navy December 2007  –  June 2010  (2 years 7 months) Groton, CT •Assistant Operations Officer, 6 months \n- Responsible for coordinating the operations of 11 divisions into 1 ship-wide plan  \n- Organized operations during a complex maintenance overhaul \n \n•Chemistry/Radiological Controls Officer, 15 months \n- Supervised 6 people responsible for the chemistry control and radiological containment of the nuclear power plant \n- Senior supervisor for reactor plant maintenance \n \n•Reactor Controls Officer, 10 months \n- Supervised 7 people responsible for reactor maintenance and operations \n- Directed key reactor plant instrumentation upgrades during a modernization overhaul ALP Associate Intel Corporation July 2014  – Present (1 year 2 months) - Rotational program across business units and functions \n \n- First rotation: Product Marketing Engineer, Data Center SSD, Non-Volatile Memory Solutions Group ALP Associate Intel Corporation July 2014  – Present (1 year 2 months) - Rotational program across business units and functions \n \n- First rotation: Product Marketing Engineer, Data Center SSD, Non-Volatile Memory Solutions Group Summer Consultant The Boston Consulting Group June 2013  –  August 2013  (3 months) Greater Chicago Area - Advised a major industrial goods company on growth opportunities Summer Consultant The Boston Consulting Group June 2013  –  August 2013  (3 months) Greater Chicago Area - Advised a major industrial goods company on growth opportunities Submarine Operations Specialist for the Chief of Naval Operations US Navy July 2010  –  June 2012  (2 years) Washington, DC - Supervised the collection, processing and dissemination of intelligence from naval and joint operations \n- Briefed senior military and civilian leadership at the Pentagon Submarine Operations Specialist for the Chief of Naval Operations US Navy July 2010  –  June 2012  (2 years) Washington, DC - Supervised the collection, processing and dissemination of intelligence from naval and joint operations \n- Briefed senior military and civilian leadership at the Pentagon Submarine Division Officer, USS MIAMI (SSN 755) US Navy December 2007  –  June 2010  (2 years 7 months) Groton, CT •Assistant Operations Officer, 6 months \n- Responsible for coordinating the operations of 11 divisions into 1 ship-wide plan  \n- Organized operations during a complex maintenance overhaul \n \n•Chemistry/Radiological Controls Officer, 15 months \n- Supervised 6 people responsible for the chemistry control and radiological containment of the nuclear power plant \n- Senior supervisor for reactor plant maintenance \n \n•Reactor Controls Officer, 10 months \n- Supervised 7 people responsible for reactor maintenance and operations \n- Directed key reactor plant instrumentation upgrades during a modernization overhaul Submarine Division Officer, USS MIAMI (SSN 755) US Navy December 2007  –  June 2010  (2 years 7 months) Groton, CT •Assistant Operations Officer, 6 months \n- Responsible for coordinating the operations of 11 divisions into 1 ship-wide plan  \n- Organized operations during a complex maintenance overhaul \n \n•Chemistry/Radiological Controls Officer, 15 months \n- Supervised 6 people responsible for the chemistry control and radiological containment of the nuclear power plant \n- Senior supervisor for reactor plant maintenance \n \n•Reactor Controls Officer, 10 months \n- Supervised 7 people responsible for reactor maintenance and operations \n- Directed key reactor plant instrumentation upgrades during a modernization overhaul Skills Skills     Education University of Pennsylvania - The Wharton School Master of Business Administration (M.B.A.),  Entrepreneurial Management and Operations 2012  – 2014 - Project Manager, Penn Biotech Group \n \n- Vice President, Wharton Consulting Club Activities and Societies:  - Cohort J Stanford University MS,  Electrical Engineering 2004  – 2006 - Area of Depth: Solid State Materials and Devices \n \n- Research Assistant at Stanford Microsystems Laboratory  \n(Published in J. Micromech. Microeng.) \n \n- Research Assistant at Rabinovitch/Bland Cardiopulmonary Research Laboratory  \n(Published in Am. J. Physiol. Lung.) \n \n- Head Teaching Assistant for ME342: MEMS Laboratory Activities and Societies:  - Intramural flag football team coach (spring 2006) United States Naval Academy BS,  Electrical Engineering 2000  – 2004 - Trident Scholar Senior Research Project: Development of a Microelectromechanical System (MEMS) for Small Satellite Thermal Control Activities and Societies:  - 8th Company Navy Nuclear Power School 2006  – 2007 - Graduated with honors from the Navy's nuclear power training program University of Pennsylvania - The Wharton School Master of Business Administration (M.B.A.),  Entrepreneurial Management and Operations 2012  – 2014 - Project Manager, Penn Biotech Group \n \n- Vice President, Wharton Consulting Club Activities and Societies:  - Cohort J University of Pennsylvania - The Wharton School Master of Business Administration (M.B.A.),  Entrepreneurial Management and Operations 2012  – 2014 - Project Manager, Penn Biotech Group \n \n- Vice President, Wharton Consulting Club Activities and Societies:  - Cohort J University of Pennsylvania - The Wharton School Master of Business Administration (M.B.A.),  Entrepreneurial Management and Operations 2012  – 2014 - Project Manager, Penn Biotech Group \n \n- Vice President, Wharton Consulting Club Activities and Societies:  - Cohort J Stanford University MS,  Electrical Engineering 2004  – 2006 - Area of Depth: Solid State Materials and Devices \n \n- Research Assistant at Stanford Microsystems Laboratory  \n(Published in J. Micromech. Microeng.) \n \n- Research Assistant at Rabinovitch/Bland Cardiopulmonary Research Laboratory  \n(Published in Am. J. Physiol. Lung.) \n \n- Head Teaching Assistant for ME342: MEMS Laboratory Activities and Societies:  - Intramural flag football team coach (spring 2006) Stanford University MS,  Electrical Engineering 2004  – 2006 - Area of Depth: Solid State Materials and Devices \n \n- Research Assistant at Stanford Microsystems Laboratory  \n(Published in J. Micromech. Microeng.) \n \n- Research Assistant at Rabinovitch/Bland Cardiopulmonary Research Laboratory  \n(Published in Am. J. Physiol. Lung.) \n \n- Head Teaching Assistant for ME342: MEMS Laboratory Activities and Societies:  - Intramural flag football team coach (spring 2006) Stanford University MS,  Electrical Engineering 2004  – 2006 - Area of Depth: Solid State Materials and Devices \n \n- Research Assistant at Stanford Microsystems Laboratory  \n(Published in J. Micromech. Microeng.) \n \n- Research Assistant at Rabinovitch/Bland Cardiopulmonary Research Laboratory  \n(Published in Am. J. Physiol. Lung.) \n \n- Head Teaching Assistant for ME342: MEMS Laboratory Activities and Societies:  - Intramural flag football team coach (spring 2006) United States Naval Academy BS,  Electrical Engineering 2000  – 2004 - Trident Scholar Senior Research Project: Development of a Microelectromechanical System (MEMS) for Small Satellite Thermal Control Activities and Societies:  - 8th Company United States Naval Academy BS,  Electrical Engineering 2000  – 2004 - Trident Scholar Senior Research Project: Development of a Microelectromechanical System (MEMS) for Small Satellite Thermal Control Activities and Societies:  - 8th Company United States Naval Academy BS,  Electrical Engineering 2000  – 2004 - Trident Scholar Senior Research Project: Development of a Microelectromechanical System (MEMS) for Small Satellite Thermal Control Activities and Societies:  - 8th Company Navy Nuclear Power School 2006  – 2007 - Graduated with honors from the Navy's nuclear power training program Navy Nuclear Power School 2006  – 2007 - Graduated with honors from the Navy's nuclear power training program Navy Nuclear Power School 2006  – 2007 - Graduated with honors from the Navy's nuclear power training program "]}