{"position": "Auditor", "company": "Intel Corporation", "profiles": ["Languages English English English Skills FCCA CISA Internal Audit Assurance Sarbanes-Oxley Act Internal Controls Enterprise Risk... IT Audit Auditing IFRS Financial Audits External Audit US GAAP COBIT Sarbanes-Oxley Risk Management COSO Risk Assessment Information Security... Corporate Governance Governance SAS70 Big 4 Financial Reporting Financial Analysis Consolidation See 11+     See less Skills  FCCA CISA Internal Audit Assurance Sarbanes-Oxley Act Internal Controls Enterprise Risk... IT Audit Auditing IFRS Financial Audits External Audit US GAAP COBIT Sarbanes-Oxley Risk Management COSO Risk Assessment Information Security... Corporate Governance Governance SAS70 Big 4 Financial Reporting Financial Analysis Consolidation See 11+     See less FCCA CISA Internal Audit Assurance Sarbanes-Oxley Act Internal Controls Enterprise Risk... IT Audit Auditing IFRS Financial Audits External Audit US GAAP COBIT Sarbanes-Oxley Risk Management COSO Risk Assessment Information Security... Corporate Governance Governance SAS70 Big 4 Financial Reporting Financial Analysis Consolidation See 11+     See less FCCA CISA Internal Audit Assurance Sarbanes-Oxley Act Internal Controls Enterprise Risk... IT Audit Auditing IFRS Financial Audits External Audit US GAAP COBIT Sarbanes-Oxley Risk Management COSO Risk Assessment Information Security... Corporate Governance Governance SAS70 Big 4 Financial Reporting Financial Analysis Consolidation See 11+     See less Honors & Awards ", "Summary I am an experienced Technology and Information Security manager. I have been fortunate to have had many opportunities to develop plans and people needed to improve or implement new security systems and infrastructure. \n \nKey Highlights are: \n- Translate customer objectives into actionable plans \n- Delivery assurance and P&L responsibility for programs/projects \n- Develop and deploy Security Architecture and programs \n- Partner and work with innovative people and companies to develop solutions to secure or deliver infrastructure needed to support business objectives \n \nSpecialties: Security Architecture, Global collaboration, Data Center Management and Service Consolidation, Budget Planning and Management, Service Implementation, Operations and Program Management, Risk Assessment, Creating Performing Teams, People Management and Mentoring, Process Improvement, Department of Homeland Security Summary I am an experienced Technology and Information Security manager. I have been fortunate to have had many opportunities to develop plans and people needed to improve or implement new security systems and infrastructure. \n \nKey Highlights are: \n- Translate customer objectives into actionable plans \n- Delivery assurance and P&L responsibility for programs/projects \n- Develop and deploy Security Architecture and programs \n- Partner and work with innovative people and companies to develop solutions to secure or deliver infrastructure needed to support business objectives \n \nSpecialties: Security Architecture, Global collaboration, Data Center Management and Service Consolidation, Budget Planning and Management, Service Implementation, Operations and Program Management, Risk Assessment, Creating Performing Teams, People Management and Mentoring, Process Improvement, Department of Homeland Security I am an experienced Technology and Information Security manager. I have been fortunate to have had many opportunities to develop plans and people needed to improve or implement new security systems and infrastructure. \n \nKey Highlights are: \n- Translate customer objectives into actionable plans \n- Delivery assurance and P&L responsibility for programs/projects \n- Develop and deploy Security Architecture and programs \n- Partner and work with innovative people and companies to develop solutions to secure or deliver infrastructure needed to support business objectives \n \nSpecialties: Security Architecture, Global collaboration, Data Center Management and Service Consolidation, Budget Planning and Management, Service Implementation, Operations and Program Management, Risk Assessment, Creating Performing Teams, People Management and Mentoring, Process Improvement, Department of Homeland Security I am an experienced Technology and Information Security manager. I have been fortunate to have had many opportunities to develop plans and people needed to improve or implement new security systems and infrastructure. \n \nKey Highlights are: \n- Translate customer objectives into actionable plans \n- Delivery assurance and P&L responsibility for programs/projects \n- Develop and deploy Security Architecture and programs \n- Partner and work with innovative people and companies to develop solutions to secure or deliver infrastructure needed to support business objectives \n \nSpecialties: Security Architecture, Global collaboration, Data Center Management and Service Consolidation, Budget Planning and Management, Service Implementation, Operations and Program Management, Risk Assessment, Creating Performing Teams, People Management and Mentoring, Process Improvement, Department of Homeland Security Experience Director IT FS-ISAC November 2014  – Present (10 months) Reston, VA Practice Director, Information Security ThruPoint August 2012  – Present (3 years 1 month) Reston, VA As a Practice Director and Delivery Assurance Director I have been responsible for both project delivery and P&L. Significant projects include Design Support and Implementation for Sprint’s preproduction vendor testing lab space (80k sq. feet), an Operational Risk Assessment for UBS (Swiss Bank), Monitoring Application profiling for INTELSAT. Principal Consultant ThruPoint April 2012  –  August 2012  (5 months) Reston, VA Senior Manager, Security Operations Time Warner Cable 2008  –  November 2011  (3 years) Herndon, VA Service Delivery/Program Manager Intel Corporation February 1996  –  January 2007  (11 years) Internal Auditor Intel Corporation June 2004  –  May 2005  (1 year) Data Center Operations Intel Online Services (A Managed Hosting Service to Fortune 500 Companies) April 2001  –  June 2004  (3 years 3 months) Customer Integration Management Intel Online Services (A Managed Hosting Service to Fortune 500 Companies) July 1999  –  March 2001  (1 year 9 months) Chantilly, VA Program Manager - Server Architecture Labs Intel Corporation April 1998  –  July 1999  (1 year 4 months) Portland, Oregon Area Engineering Manager Intel Corporation March 1997  –  April 1998  (1 year 2 months) Folsom, CA Software Engineer Intel Corporation February 1994  –  March 1997  (3 years 2 months) Folsom, CA Director IT FS-ISAC November 2014  – Present (10 months) Reston, VA Director IT FS-ISAC November 2014  – Present (10 months) Reston, VA Practice Director, Information Security ThruPoint August 2012  – Present (3 years 1 month) Reston, VA As a Practice Director and Delivery Assurance Director I have been responsible for both project delivery and P&L. Significant projects include Design Support and Implementation for Sprint’s preproduction vendor testing lab space (80k sq. feet), an Operational Risk Assessment for UBS (Swiss Bank), Monitoring Application profiling for INTELSAT. Practice Director, Information Security ThruPoint August 2012  – Present (3 years 1 month) Reston, VA As a Practice Director and Delivery Assurance Director I have been responsible for both project delivery and P&L. Significant projects include Design Support and Implementation for Sprint’s preproduction vendor testing lab space (80k sq. feet), an Operational Risk Assessment for UBS (Swiss Bank), Monitoring Application profiling for INTELSAT. Principal Consultant ThruPoint April 2012  –  August 2012  (5 months) Reston, VA Principal Consultant ThruPoint April 2012  –  August 2012  (5 months) Reston, VA Senior Manager, Security Operations Time Warner Cable 2008  –  November 2011  (3 years) Herndon, VA Senior Manager, Security Operations Time Warner Cable 2008  –  November 2011  (3 years) Herndon, VA Service Delivery/Program Manager Intel Corporation February 1996  –  January 2007  (11 years) Service Delivery/Program Manager Intel Corporation February 1996  –  January 2007  (11 years) Internal Auditor Intel Corporation June 2004  –  May 2005  (1 year) Internal Auditor Intel Corporation June 2004  –  May 2005  (1 year) Data Center Operations Intel Online Services (A Managed Hosting Service to Fortune 500 Companies) April 2001  –  June 2004  (3 years 3 months) Data Center Operations Intel Online Services (A Managed Hosting Service to Fortune 500 Companies) April 2001  –  June 2004  (3 years 3 months) Customer Integration Management Intel Online Services (A Managed Hosting Service to Fortune 500 Companies) July 1999  –  March 2001  (1 year 9 months) Chantilly, VA Customer Integration Management Intel Online Services (A Managed Hosting Service to Fortune 500 Companies) July 1999  –  March 2001  (1 year 9 months) Chantilly, VA Program Manager - Server Architecture Labs Intel Corporation April 1998  –  July 1999  (1 year 4 months) Portland, Oregon Area Program Manager - Server Architecture Labs Intel Corporation April 1998  –  July 1999  (1 year 4 months) Portland, Oregon Area Engineering Manager Intel Corporation March 1997  –  April 1998  (1 year 2 months) Folsom, CA Engineering Manager Intel Corporation March 1997  –  April 1998  (1 year 2 months) Folsom, CA Software Engineer Intel Corporation February 1994  –  March 1997  (3 years 2 months) Folsom, CA Software Engineer Intel Corporation February 1994  –  March 1997  (3 years 2 months) Folsom, CA Skills CISM CISSP ITIL CRISC Process Improvement Security Security Architecture... Information Security Risk Assessment Integration Program Management Data Center Enterprise Software Computer Security Risk Management Cross-functional Team... Leadership Network Security Information Technology Information Security... Firewalls Disaster Recovery Microsoft Exchange PMP Troubleshooting Project Management Management See 12+     See less Skills  CISM CISSP ITIL CRISC Process Improvement Security Security Architecture... Information Security Risk Assessment Integration Program Management Data Center Enterprise Software Computer Security Risk Management Cross-functional Team... Leadership Network Security Information Technology Information Security... Firewalls Disaster Recovery Microsoft Exchange PMP Troubleshooting Project Management Management See 12+     See less CISM CISSP ITIL CRISC Process Improvement Security Security Architecture... Information Security Risk Assessment Integration Program Management Data Center Enterprise Software Computer Security Risk Management Cross-functional Team... Leadership Network Security Information Technology Information Security... Firewalls Disaster Recovery Microsoft Exchange PMP Troubleshooting Project Management Management See 12+     See less CISM CISSP ITIL CRISC Process Improvement Security Security Architecture... Information Security Risk Assessment Integration Program Management Data Center Enterprise Software Computer Security Risk Management Cross-functional Team... Leadership Network Security Information Technology Information Security... Firewalls Disaster Recovery Microsoft Exchange PMP Troubleshooting Project Management Management See 12+     See less Education California State University-Long Beach - College of Business Administration BS,  Finance ,  Real Estate and Law 1984  – 1987 Certified Information Systems Security Professional (CISSP) \nCertified Information Security Manager (CISM) \nCertified in Risk and Information Systems Control (CRISC) \nCertified - ITIL Foundations Activities and Societies:  President ,  Law Society California State University-Long Beach - College of Business Administration BS,  Finance ,  Real Estate and Law 1984  – 1987 Certified Information Systems Security Professional (CISSP) \nCertified Information Security Manager (CISM) \nCertified in Risk and Information Systems Control (CRISC) \nCertified - ITIL Foundations Activities and Societies:  President ,  Law Society California State University-Long Beach - College of Business Administration BS,  Finance ,  Real Estate and Law 1984  – 1987 Certified Information Systems Security Professional (CISSP) \nCertified Information Security Manager (CISM) \nCertified in Risk and Information Systems Control (CRISC) \nCertified - ITIL Foundations Activities and Societies:  President ,  Law Society California State University-Long Beach - College of Business Administration BS,  Finance ,  Real Estate and Law 1984  – 1987 Certified Information Systems Security Professional (CISSP) \nCertified Information Security Manager (CISM) \nCertified in Risk and Information Systems Control (CRISC) \nCertified - ITIL Foundations Activities and Societies:  President ,  Law Society ", "Experience System / Application Auditor Intel Corporation April 2014  – Present (1 year 5 months) folsom, california Sr. Internal Auditor VSP December 2010  –  March 2014  (3 years 4 months) Sr. Audit Associate Gilbert Associates, Inc. July 2010  –  December 2010  (6 months) Sr. Auditor Perry-Smith LLP July 2007  –  June 2010  (3 years) Fund Accounting Analyst Franklin Templeton Investments July 2004  –  February 2007  (2 years 8 months) System / Application Auditor Intel Corporation April 2014  – Present (1 year 5 months) folsom, california System / Application Auditor Intel Corporation April 2014  – Present (1 year 5 months) folsom, california Sr. Internal Auditor VSP December 2010  –  March 2014  (3 years 4 months) Sr. Internal Auditor VSP December 2010  –  March 2014  (3 years 4 months) Sr. Audit Associate Gilbert Associates, Inc. July 2010  –  December 2010  (6 months) Sr. Audit Associate Gilbert Associates, Inc. July 2010  –  December 2010  (6 months) Sr. Auditor Perry-Smith LLP July 2007  –  June 2010  (3 years) Sr. Auditor Perry-Smith LLP July 2007  –  June 2010  (3 years) Fund Accounting Analyst Franklin Templeton Investments July 2004  –  February 2007  (2 years 8 months) Fund Accounting Analyst Franklin Templeton Investments July 2004  –  February 2007  (2 years 8 months) Languages Hindi Hindi Hindi Skills Auditing Accounting Audit Financial Reporting SOX Model Audit Rule (MAR)... ISO 27001 testing Application controls... Change Management Risk Assessment Risk Analysis Financial Accounting GAAP Internal Audit Internal Controls Sarbanes-Oxley Act Enterprise Risk... Sarbanes-Oxley See 3+     See less Skills  Auditing Accounting Audit Financial Reporting SOX Model Audit Rule (MAR)... ISO 27001 testing Application controls... Change Management Risk Assessment Risk Analysis Financial Accounting GAAP Internal Audit Internal Controls Sarbanes-Oxley Act Enterprise Risk... Sarbanes-Oxley See 3+     See less Auditing Accounting Audit Financial Reporting SOX Model Audit Rule (MAR)... ISO 27001 testing Application controls... Change Management Risk Assessment Risk Analysis Financial Accounting GAAP Internal Audit Internal Controls Sarbanes-Oxley Act Enterprise Risk... Sarbanes-Oxley See 3+     See less Auditing Accounting Audit Financial Reporting SOX Model Audit Rule (MAR)... ISO 27001 testing Application controls... Change Management Risk Assessment Risk Analysis Financial Accounting GAAP Internal Audit Internal Controls Sarbanes-Oxley Act Enterprise Risk... Sarbanes-Oxley See 3+     See less Education California State University-Sacramento Bachelor of Science,  Business Admin - Accounting California State University-Sacramento Bachelor of Science,  Business Admin - Accounting California State University-Sacramento Bachelor of Science,  Business Admin - Accounting California State University-Sacramento Bachelor of Science,  Business Admin - Accounting ", "Experience Payroll Auditor Intel Corporation Payroll Auditor Intel Corporation Payroll Auditor Intel Corporation ", "Skills Privacy Compliance Risk Management Program Management Internal Controls IT Audit Skills  Privacy Compliance Risk Management Program Management Internal Controls IT Audit Privacy Compliance Risk Management Program Management Internal Controls IT Audit Privacy Compliance Risk Management Program Management Internal Controls IT Audit ", "Summary Proven leader with 16 years experience in various Finance roles in high-tech industry; 3 years as an individual contributor, 13 years as a people manager. Vast experience and success in cost reduction, organizational development, recruiting, hiring, performance management, and influencing business strategy in a variety of diverse locations and business units. \n \nSpecialties: International Experience, Cost Reduction, Organizational Development, Financial Modeling, Business Development Summary Proven leader with 16 years experience in various Finance roles in high-tech industry; 3 years as an individual contributor, 13 years as a people manager. Vast experience and success in cost reduction, organizational development, recruiting, hiring, performance management, and influencing business strategy in a variety of diverse locations and business units. \n \nSpecialties: International Experience, Cost Reduction, Organizational Development, Financial Modeling, Business Development Proven leader with 16 years experience in various Finance roles in high-tech industry; 3 years as an individual contributor, 13 years as a people manager. Vast experience and success in cost reduction, organizational development, recruiting, hiring, performance management, and influencing business strategy in a variety of diverse locations and business units. \n \nSpecialties: International Experience, Cost Reduction, Organizational Development, Financial Modeling, Business Development Proven leader with 16 years experience in various Finance roles in high-tech industry; 3 years as an individual contributor, 13 years as a people manager. Vast experience and success in cost reduction, organizational development, recruiting, hiring, performance management, and influencing business strategy in a variety of diverse locations and business units. \n \nSpecialties: International Experience, Cost Reduction, Organizational Development, Financial Modeling, Business Development Experience Senior Finance Director EMC June 2014  – Present (1 year 3 months) Franklin, Massachusetts Factory Finance Manager Intel Corporation April 2011  –  June 2014  (3 years 3 months) Hudson, Massachusetts Senior Competitive Analyst Intel Corporation 2009  –  2011  (2 years) Santa Clara, California Malaysia/India Finance Manager Intel Corporation 2007  –  2009  (2 years) Penang, Malaysia Internal Auditor Intel Corporation 2006  –  2007  (1 year) Various Worldwide Locations Massachusetts & East Coast Finance Manager Intel Corporation 2001  –  2006  (5 years) Hudson, Massachusetts Product Line Financial Analyst Intel Corporation 1999  –  2001  (2 years) Parsippany, New Jersey Financial Analyst Intel Corporation 1998  –  1999  (1 year) Portland, Oregon Senior Finance Director EMC June 2014  – Present (1 year 3 months) Franklin, Massachusetts Senior Finance Director EMC June 2014  – Present (1 year 3 months) Franklin, Massachusetts Factory Finance Manager Intel Corporation April 2011  –  June 2014  (3 years 3 months) Hudson, Massachusetts Factory Finance Manager Intel Corporation April 2011  –  June 2014  (3 years 3 months) Hudson, Massachusetts Senior Competitive Analyst Intel Corporation 2009  –  2011  (2 years) Santa Clara, California Senior Competitive Analyst Intel Corporation 2009  –  2011  (2 years) Santa Clara, California Malaysia/India Finance Manager Intel Corporation 2007  –  2009  (2 years) Penang, Malaysia Malaysia/India Finance Manager Intel Corporation 2007  –  2009  (2 years) Penang, Malaysia Internal Auditor Intel Corporation 2006  –  2007  (1 year) Various Worldwide Locations Internal Auditor Intel Corporation 2006  –  2007  (1 year) Various Worldwide Locations Massachusetts & East Coast Finance Manager Intel Corporation 2001  –  2006  (5 years) Hudson, Massachusetts Massachusetts & East Coast Finance Manager Intel Corporation 2001  –  2006  (5 years) Hudson, Massachusetts Product Line Financial Analyst Intel Corporation 1999  –  2001  (2 years) Parsippany, New Jersey Product Line Financial Analyst Intel Corporation 1999  –  2001  (2 years) Parsippany, New Jersey Financial Analyst Intel Corporation 1998  –  1999  (1 year) Portland, Oregon Financial Analyst Intel Corporation 1998  –  1999  (1 year) Portland, Oregon Skills Financial Modeling Organizational... International Business Strategy Business Development Forecasting Budgets Cross-functional Team... Analysis Management Business Strategy Leadership Product Development Pricing Finance Financial Analysis Process Improvement See 2+     See less Skills  Financial Modeling Organizational... International Business Strategy Business Development Forecasting Budgets Cross-functional Team... Analysis Management Business Strategy Leadership Product Development Pricing Finance Financial Analysis Process Improvement See 2+     See less Financial Modeling Organizational... International Business Strategy Business Development Forecasting Budgets Cross-functional Team... Analysis Management Business Strategy Leadership Product Development Pricing Finance Financial Analysis Process Improvement See 2+     See less Financial Modeling Organizational... International Business Strategy Business Development Forecasting Budgets Cross-functional Team... Analysis Management Business Strategy Leadership Product Development Pricing Finance Financial Analysis Process Improvement See 2+     See less Education Cornell University BS 1994  – 1998 Duke University - The Fuqua School of Business Master 2004  – 2006 Cornell University BS 1994  – 1998 Cornell University BS 1994  – 1998 Cornell University BS 1994  – 1998 Duke University - The Fuqua School of Business Master 2004  – 2006 Duke University - The Fuqua School of Business Master 2004  – 2006 Duke University - The Fuqua School of Business Master 2004  – 2006 ", "Summary Dedicated Certified Public Accountant, Certified Information Systems Auditor and internal audit professional with considerable senior management level experience. Expert in internal controls, Sarbanes-Oxley, and IT and business process auditing. Driven strategic thinker with high integrity, strong work ethic, and a passion for pursuit of excellence in the workplace. \n \nBackground and Areas of Strength: \n \n•\tInternal Auditing \n•\tRisk Assessment \n•\tSenior Manager \n•\tBig-4 Audit Experience \n•\tInformation Technology Assurance \n•\tFederal Regulatory Compliance \n•\tProject Management \n•\tExternal Auditing  \n•\tBusiness Operations Summary Dedicated Certified Public Accountant, Certified Information Systems Auditor and internal audit professional with considerable senior management level experience. Expert in internal controls, Sarbanes-Oxley, and IT and business process auditing. Driven strategic thinker with high integrity, strong work ethic, and a passion for pursuit of excellence in the workplace. \n \nBackground and Areas of Strength: \n \n•\tInternal Auditing \n•\tRisk Assessment \n•\tSenior Manager \n•\tBig-4 Audit Experience \n•\tInformation Technology Assurance \n•\tFederal Regulatory Compliance \n•\tProject Management \n•\tExternal Auditing  \n•\tBusiness Operations Dedicated Certified Public Accountant, Certified Information Systems Auditor and internal audit professional with considerable senior management level experience. Expert in internal controls, Sarbanes-Oxley, and IT and business process auditing. Driven strategic thinker with high integrity, strong work ethic, and a passion for pursuit of excellence in the workplace. \n \nBackground and Areas of Strength: \n \n•\tInternal Auditing \n•\tRisk Assessment \n•\tSenior Manager \n•\tBig-4 Audit Experience \n•\tInformation Technology Assurance \n•\tFederal Regulatory Compliance \n•\tProject Management \n•\tExternal Auditing  \n•\tBusiness Operations Dedicated Certified Public Accountant, Certified Information Systems Auditor and internal audit professional with considerable senior management level experience. Expert in internal controls, Sarbanes-Oxley, and IT and business process auditing. Driven strategic thinker with high integrity, strong work ethic, and a passion for pursuit of excellence in the workplace. \n \nBackground and Areas of Strength: \n \n•\tInternal Auditing \n•\tRisk Assessment \n•\tSenior Manager \n•\tBig-4 Audit Experience \n•\tInformation Technology Assurance \n•\tFederal Regulatory Compliance \n•\tProject Management \n•\tExternal Auditing  \n•\tBusiness Operations Experience IT Internal Auditor Intel Corporation April 2013  – Present (2 years 5 months) Folsom, CA Audit & Consulting Specialist, Lead, Level IV Aerojet July 2011  –  March 2013  (1 year 9 months) Rancho Cordova, CA •\tManage Sarbanes-Oxley testing, business process / operational reviews, legal and other investigations, and federal regulatory compliance auditing (FAR, DFARS, CAS, TINA, etc.)  \n•\tPerform and manage government compliance reviews related to the Department of Defense’s Business Systems: Accounting/Billing, Purchasing, Estimating, Government Property, Material Management, and Earned Value Management System. \n•\tPerform risk assessments, scope audits, evaluate design and operating effectiveness of internal controls, review work papers, draft reports, and negotiate management responses to audit recommendations. \n•\tCoordinate internal audit support for the Company’s external auditors and the Defense Contract Audit Agency (DCAA). \n•\tCommunicate and coordinate with senior management regarding Sarbanes-Oxley compliance and testing, deficiencies, and corrective actions. Influence key stakeholders to facilitate positive change. Senior Manager, Information Systems Assurance BDO USA, LLP October 2006  –  July 2011  (4 years 10 months) San Francisco Bay Area •\tSupervised internal control engagements including internal and external audits, Sarbanes Oxley 404 and SAS 70 engagements.  \n•\tResponsible for managing IT audits of a wide variety of applications including SAP, Oracle, JD Edwards, NetSuite, MS Dynamics, Quickbooks, and Made2Manage. \n•\tUtilized the IDEA data analysis application to perform Computer Assisted Audit Techniques (CAATs). \n•\tStreamlined audit approach following a risk based methodology, resulting in a 71% decrease in annual hours incurred on one client between 2006 and 2009. \n•\tWas appointed to BDO’s national quality control review team and taught training course for BDO’s national SAS70 team. Assisted with the drafting of BDO national policies and procedures in the areas of engagement risk assessments and 404 controls as well as SAS70, report, and spreadsheet testing. \n•\tInstrumental in nurturing relationships with client’s highest levels of senior management. \n•\tReviewed and assisted with the implementation of disaster recovery plans. \n•\tSimultaneously supervised up to 46 engagements of varying size and complexity. \n•\tReceived the highest possible annual performance rating in each of my four years with the firm. \n•\tSelect clients included: Red Lion Hotels, Hecla Mining Company, Ambassadors Group, Sonic Solutions, IXYS, Intelius, Keytronic, Equity Administration Solutions (EASi,) Conifer Securities. Experienced Senior Associate, Systems & Process Assurance PricewaterhouseCoopers August 2003  –  September 2006  (3 years 2 months) San Francisco Bay Area •\tSupervised and performed testing of IT General Controls, business process controls, and Oracle Enterprise Resource Planning (ERP) and Unix security controls. \n•\tTaught training courses covering ACL data analytics, the COSO framework, information processing objectives, business processes, application controls and IT general controls. Completed training in the audit of PeopleSoft and mainframes. \n•\tAssessed Health Insurance Portability and Accountability Act (HIPAA) compliance. \n•\tSelect clients included: Microsoft, Barclays Global Investors, Franklin Templeton, Chevron, Bayer, Federal Reserve Bank, Federal Home Loan Bank, GenCorp. IT Internal Auditor Intel Corporation April 2013  – Present (2 years 5 months) Folsom, CA IT Internal Auditor Intel Corporation April 2013  – Present (2 years 5 months) Folsom, CA Audit & Consulting Specialist, Lead, Level IV Aerojet July 2011  –  March 2013  (1 year 9 months) Rancho Cordova, CA •\tManage Sarbanes-Oxley testing, business process / operational reviews, legal and other investigations, and federal regulatory compliance auditing (FAR, DFARS, CAS, TINA, etc.)  \n•\tPerform and manage government compliance reviews related to the Department of Defense’s Business Systems: Accounting/Billing, Purchasing, Estimating, Government Property, Material Management, and Earned Value Management System. \n•\tPerform risk assessments, scope audits, evaluate design and operating effectiveness of internal controls, review work papers, draft reports, and negotiate management responses to audit recommendations. \n•\tCoordinate internal audit support for the Company’s external auditors and the Defense Contract Audit Agency (DCAA). \n•\tCommunicate and coordinate with senior management regarding Sarbanes-Oxley compliance and testing, deficiencies, and corrective actions. Influence key stakeholders to facilitate positive change. Audit & Consulting Specialist, Lead, Level IV Aerojet July 2011  –  March 2013  (1 year 9 months) Rancho Cordova, CA •\tManage Sarbanes-Oxley testing, business process / operational reviews, legal and other investigations, and federal regulatory compliance auditing (FAR, DFARS, CAS, TINA, etc.)  \n•\tPerform and manage government compliance reviews related to the Department of Defense’s Business Systems: Accounting/Billing, Purchasing, Estimating, Government Property, Material Management, and Earned Value Management System. \n•\tPerform risk assessments, scope audits, evaluate design and operating effectiveness of internal controls, review work papers, draft reports, and negotiate management responses to audit recommendations. \n•\tCoordinate internal audit support for the Company’s external auditors and the Defense Contract Audit Agency (DCAA). \n•\tCommunicate and coordinate with senior management regarding Sarbanes-Oxley compliance and testing, deficiencies, and corrective actions. Influence key stakeholders to facilitate positive change. Senior Manager, Information Systems Assurance BDO USA, LLP October 2006  –  July 2011  (4 years 10 months) San Francisco Bay Area •\tSupervised internal control engagements including internal and external audits, Sarbanes Oxley 404 and SAS 70 engagements.  \n•\tResponsible for managing IT audits of a wide variety of applications including SAP, Oracle, JD Edwards, NetSuite, MS Dynamics, Quickbooks, and Made2Manage. \n•\tUtilized the IDEA data analysis application to perform Computer Assisted Audit Techniques (CAATs). \n•\tStreamlined audit approach following a risk based methodology, resulting in a 71% decrease in annual hours incurred on one client between 2006 and 2009. \n•\tWas appointed to BDO’s national quality control review team and taught training course for BDO’s national SAS70 team. Assisted with the drafting of BDO national policies and procedures in the areas of engagement risk assessments and 404 controls as well as SAS70, report, and spreadsheet testing. \n•\tInstrumental in nurturing relationships with client’s highest levels of senior management. \n•\tReviewed and assisted with the implementation of disaster recovery plans. \n•\tSimultaneously supervised up to 46 engagements of varying size and complexity. \n•\tReceived the highest possible annual performance rating in each of my four years with the firm. \n•\tSelect clients included: Red Lion Hotels, Hecla Mining Company, Ambassadors Group, Sonic Solutions, IXYS, Intelius, Keytronic, Equity Administration Solutions (EASi,) Conifer Securities. Senior Manager, Information Systems Assurance BDO USA, LLP October 2006  –  July 2011  (4 years 10 months) San Francisco Bay Area •\tSupervised internal control engagements including internal and external audits, Sarbanes Oxley 404 and SAS 70 engagements.  \n•\tResponsible for managing IT audits of a wide variety of applications including SAP, Oracle, JD Edwards, NetSuite, MS Dynamics, Quickbooks, and Made2Manage. \n•\tUtilized the IDEA data analysis application to perform Computer Assisted Audit Techniques (CAATs). \n•\tStreamlined audit approach following a risk based methodology, resulting in a 71% decrease in annual hours incurred on one client between 2006 and 2009. \n•\tWas appointed to BDO’s national quality control review team and taught training course for BDO’s national SAS70 team. Assisted with the drafting of BDO national policies and procedures in the areas of engagement risk assessments and 404 controls as well as SAS70, report, and spreadsheet testing. \n•\tInstrumental in nurturing relationships with client’s highest levels of senior management. \n•\tReviewed and assisted with the implementation of disaster recovery plans. \n•\tSimultaneously supervised up to 46 engagements of varying size and complexity. \n•\tReceived the highest possible annual performance rating in each of my four years with the firm. \n•\tSelect clients included: Red Lion Hotels, Hecla Mining Company, Ambassadors Group, Sonic Solutions, IXYS, Intelius, Keytronic, Equity Administration Solutions (EASi,) Conifer Securities. Experienced Senior Associate, Systems & Process Assurance PricewaterhouseCoopers August 2003  –  September 2006  (3 years 2 months) San Francisco Bay Area •\tSupervised and performed testing of IT General Controls, business process controls, and Oracle Enterprise Resource Planning (ERP) and Unix security controls. \n•\tTaught training courses covering ACL data analytics, the COSO framework, information processing objectives, business processes, application controls and IT general controls. Completed training in the audit of PeopleSoft and mainframes. \n•\tAssessed Health Insurance Portability and Accountability Act (HIPAA) compliance. \n•\tSelect clients included: Microsoft, Barclays Global Investors, Franklin Templeton, Chevron, Bayer, Federal Reserve Bank, Federal Home Loan Bank, GenCorp. Experienced Senior Associate, Systems & Process Assurance PricewaterhouseCoopers August 2003  –  September 2006  (3 years 2 months) San Francisco Bay Area •\tSupervised and performed testing of IT General Controls, business process controls, and Oracle Enterprise Resource Planning (ERP) and Unix security controls. \n•\tTaught training courses covering ACL data analytics, the COSO framework, information processing objectives, business processes, application controls and IT general controls. Completed training in the audit of PeopleSoft and mainframes. \n•\tAssessed Health Insurance Portability and Accountability Act (HIPAA) compliance. \n•\tSelect clients included: Microsoft, Barclays Global Investors, Franklin Templeton, Chevron, Bayer, Federal Reserve Bank, Federal Home Loan Bank, GenCorp. Skills US GAAP Internal Controls Sarbanes-Oxley Act SEC filings Auditing Process Improvement ERP CISA IT Audit Sarbanes-Oxley Internal Audit Disaster Recovery Risk Assessment CPA Business Process Skills  US GAAP Internal Controls Sarbanes-Oxley Act SEC filings Auditing Process Improvement ERP CISA IT Audit Sarbanes-Oxley Internal Audit Disaster Recovery Risk Assessment CPA Business Process US GAAP Internal Controls Sarbanes-Oxley Act SEC filings Auditing Process Improvement ERP CISA IT Audit Sarbanes-Oxley Internal Audit Disaster Recovery Risk Assessment CPA Business Process US GAAP Internal Controls Sarbanes-Oxley Act SEC filings Auditing Process Improvement ERP CISA IT Audit Sarbanes-Oxley Internal Audit Disaster Recovery Risk Assessment CPA Business Process Education University of California, Santa Barbara Bachelor of Arts (B.A.),  Business Economics with Emphasis in Accounting 1999  – 2003 University of California, Santa Barbara Bachelor of Arts (B.A.),  Business Economics with Emphasis in Accounting 1999  – 2003 University of California, Santa Barbara Bachelor of Arts (B.A.),  Business Economics with Emphasis in Accounting 1999  – 2003 University of California, Santa Barbara Bachelor of Arts (B.A.),  Business Economics with Emphasis in Accounting 1999  – 2003 ", "Skills Financial Analysis Forecasting Process Improvement Internal Controls Business Process... Budgeting Business Analysis Internal Audit Budgets Strategic Financial... Competitive Analysis Cross-functional Team... Financial Modeling Finance Management Analysis Financial Reporting Program Management Managerial Finance Sarbanes-Oxley Act Mergers & Acquisitions See 6+     See less Skills  Financial Analysis Forecasting Process Improvement Internal Controls Business Process... Budgeting Business Analysis Internal Audit Budgets Strategic Financial... Competitive Analysis Cross-functional Team... Financial Modeling Finance Management Analysis Financial Reporting Program Management Managerial Finance Sarbanes-Oxley Act Mergers & Acquisitions See 6+     See less Financial Analysis Forecasting Process Improvement Internal Controls Business Process... Budgeting Business Analysis Internal Audit Budgets Strategic Financial... Competitive Analysis Cross-functional Team... Financial Modeling Finance Management Analysis Financial Reporting Program Management Managerial Finance Sarbanes-Oxley Act Mergers & Acquisitions See 6+     See less Financial Analysis Forecasting Process Improvement Internal Controls Business Process... Budgeting Business Analysis Internal Audit Budgets Strategic Financial... Competitive Analysis Cross-functional Team... Financial Modeling Finance Management Analysis Financial Reporting Program Management Managerial Finance Sarbanes-Oxley Act Mergers & Acquisitions See 6+     See less ", "Experience Internal Auditor Intel Corporation March 2013  – Present (2 years 6 months) Santa Clara, CA \n• Conducted financial and operational audits to determine reliability and effectiveness of control systems \n• Analyzed accounting records, statistical data, organizational procedures, and operational records \n• Evaluated effectiveness and efficiency of key business processes across various Intel functions for risk \n• Reported and presented findings and recommendations to senior management \n• Influenced change based on analysis of audit findings in the business \n• Analyzed and synthesized data quickly in audit testing by employing strong finance technical skills \n• Awarded the Internal Audit Excellence Award for providing outstanding client service \n• Awarded Outstanding SOX Testing for executing testing efficiently for 7 of 8 high profile revenue controls \n Americas Sales and Marketing Revenue Finance Lead Intel Corporation April 2011  – Present (4 years 5 months) Folsom, CA • Forecasted and reported the Americas Region Revenue of approximately 50% of all Intel Revenue \n• Identified opportunities to streamline the revenue process through partnering with multiple finance, operations and global revenue teams \n• Developed forecasts for the weekly, quarterly, and annual revenue \n• Led the quarterly revenue close process and finalized revenue reporting in compliance with external reporting guidelines \n• Recognized with a Best In Class Award for ranking first among other regions for revenue close execution \n Senior Financial Planning & Analysis Analyst Intel Corporation April 2006  –  April 2011  (5 years 1 month) Folsom, CA • Supported the business by closing the books and analyzing variances and trends for a $200M annual expense, $9M capital budget, 900 headcount group \n• Developed financial forecasts consistent with the business objectives of the organization \n• Ensured compliance with reporting standards, corporate policies and integrity of internal/external reporting \n• Provided financial support to senior management including the department head and operational managers \n• Earned a Division Recognition Award for the successful implementation of control processes to protect Intel’s intellectual property and high value inventory. \n \n Internal Auditor Intel Corporation March 2013  – Present (2 years 6 months) Santa Clara, CA \n• Conducted financial and operational audits to determine reliability and effectiveness of control systems \n• Analyzed accounting records, statistical data, organizational procedures, and operational records \n• Evaluated effectiveness and efficiency of key business processes across various Intel functions for risk \n• Reported and presented findings and recommendations to senior management \n• Influenced change based on analysis of audit findings in the business \n• Analyzed and synthesized data quickly in audit testing by employing strong finance technical skills \n• Awarded the Internal Audit Excellence Award for providing outstanding client service \n• Awarded Outstanding SOX Testing for executing testing efficiently for 7 of 8 high profile revenue controls \n Internal Auditor Intel Corporation March 2013  – Present (2 years 6 months) Santa Clara, CA \n• Conducted financial and operational audits to determine reliability and effectiveness of control systems \n• Analyzed accounting records, statistical data, organizational procedures, and operational records \n• Evaluated effectiveness and efficiency of key business processes across various Intel functions for risk \n• Reported and presented findings and recommendations to senior management \n• Influenced change based on analysis of audit findings in the business \n• Analyzed and synthesized data quickly in audit testing by employing strong finance technical skills \n• Awarded the Internal Audit Excellence Award for providing outstanding client service \n• Awarded Outstanding SOX Testing for executing testing efficiently for 7 of 8 high profile revenue controls \n Americas Sales and Marketing Revenue Finance Lead Intel Corporation April 2011  – Present (4 years 5 months) Folsom, CA • Forecasted and reported the Americas Region Revenue of approximately 50% of all Intel Revenue \n• Identified opportunities to streamline the revenue process through partnering with multiple finance, operations and global revenue teams \n• Developed forecasts for the weekly, quarterly, and annual revenue \n• Led the quarterly revenue close process and finalized revenue reporting in compliance with external reporting guidelines \n• Recognized with a Best In Class Award for ranking first among other regions for revenue close execution \n Americas Sales and Marketing Revenue Finance Lead Intel Corporation April 2011  – Present (4 years 5 months) Folsom, CA • Forecasted and reported the Americas Region Revenue of approximately 50% of all Intel Revenue \n• Identified opportunities to streamline the revenue process through partnering with multiple finance, operations and global revenue teams \n• Developed forecasts for the weekly, quarterly, and annual revenue \n• Led the quarterly revenue close process and finalized revenue reporting in compliance with external reporting guidelines \n• Recognized with a Best In Class Award for ranking first among other regions for revenue close execution \n Senior Financial Planning & Analysis Analyst Intel Corporation April 2006  –  April 2011  (5 years 1 month) Folsom, CA • Supported the business by closing the books and analyzing variances and trends for a $200M annual expense, $9M capital budget, 900 headcount group \n• Developed financial forecasts consistent with the business objectives of the organization \n• Ensured compliance with reporting standards, corporate policies and integrity of internal/external reporting \n• Provided financial support to senior management including the department head and operational managers \n• Earned a Division Recognition Award for the successful implementation of control processes to protect Intel’s intellectual property and high value inventory. \n \n Senior Financial Planning & Analysis Analyst Intel Corporation April 2006  –  April 2011  (5 years 1 month) Folsom, CA • Supported the business by closing the books and analyzing variances and trends for a $200M annual expense, $9M capital budget, 900 headcount group \n• Developed financial forecasts consistent with the business objectives of the organization \n• Ensured compliance with reporting standards, corporate policies and integrity of internal/external reporting \n• Provided financial support to senior management including the department head and operational managers \n• Earned a Division Recognition Award for the successful implementation of control processes to protect Intel’s intellectual property and high value inventory. \n \n Skills Capital Budgeting Zero-based Budgeting Budget Forecasts Budget Reconciliation Financial Analysis Revenue Recognition Revenue Analysis Microsoft Excel Accounting FPA Capital Purchases Financial Forecasting Budgets Internal Audit Account Reconciliation Variance Analysis See 1+     See less Skills  Capital Budgeting Zero-based Budgeting Budget Forecasts Budget Reconciliation Financial Analysis Revenue Recognition Revenue Analysis Microsoft Excel Accounting FPA Capital Purchases Financial Forecasting Budgets Internal Audit Account Reconciliation Variance Analysis See 1+     See less Capital Budgeting Zero-based Budgeting Budget Forecasts Budget Reconciliation Financial Analysis Revenue Recognition Revenue Analysis Microsoft Excel Accounting FPA Capital Purchases Financial Forecasting Budgets Internal Audit Account Reconciliation Variance Analysis See 1+     See less Capital Budgeting Zero-based Budgeting Budget Forecasts Budget Reconciliation Financial Analysis Revenue Recognition Revenue Analysis Microsoft Excel Accounting FPA Capital Purchases Financial Forecasting Budgets Internal Audit Account Reconciliation Variance Analysis See 1+     See less Education University of California, Davis Bachelor of Science (B.S.),  Managerial Economics , 3.67 2002  – 2006 Activities and Societies:  Golden Key National Honor Society ,  Club Finance Council University of California, Davis Bachelor of Science (B.S.),  Managerial Economics , 3.67 2002  – 2006 Activities and Societies:  Golden Key National Honor Society ,  Club Finance Council University of California, Davis Bachelor of Science (B.S.),  Managerial Economics , 3.67 2002  – 2006 Activities and Societies:  Golden Key National Honor Society ,  Club Finance Council University of California, Davis Bachelor of Science (B.S.),  Managerial Economics , 3.67 2002  – 2006 Activities and Societies:  Golden Key National Honor Society ,  Club Finance Council ", "Skills CISA CISSP Disaster Recovery Business Continuity Skills  CISA CISSP Disaster Recovery Business Continuity CISA CISSP Disaster Recovery Business Continuity CISA CISSP Disaster Recovery Business Continuity ", "Experience Internal Auditor Intel Corporation September 2011  – Present (4 years) Beijing, China Manager Ernst & Young June 2006  –  February 2012  (5 years 9 months) Internal Auditor Intel Corporation September 2011  – Present (4 years) Beijing, China Internal Auditor Intel Corporation September 2011  – Present (4 years) Beijing, China Manager Ernst & Young June 2006  –  February 2012  (5 years 9 months) Manager Ernst & Young June 2006  –  February 2012  (5 years 9 months) Skills Internal Audit Internal Controls Enterprise Risk... Skills  Internal Audit Internal Controls Enterprise Risk... Internal Audit Internal Controls Enterprise Risk... Internal Audit Internal Controls Enterprise Risk... Education Macquarie University Master Degree,  Accounting 2002  – 2005 Macquarie University Master Degree,  Accounting 2002  – 2005 Macquarie University Master Degree,  Accounting 2002  – 2005 Macquarie University Master Degree,  Accounting 2002  – 2005 ", "Summary Specialties:Internal Auditing, Risk Management, Sarbanes-Oxley, Accounting \n \nCertified Public Accountant (CPA) -- Oregon \nCertified Internal Auditor (CIA) Summary Specialties:Internal Auditing, Risk Management, Sarbanes-Oxley, Accounting \n \nCertified Public Accountant (CPA) -- Oregon \nCertified Internal Auditor (CIA) Specialties:Internal Auditing, Risk Management, Sarbanes-Oxley, Accounting \n \nCertified Public Accountant (CPA) -- Oregon \nCertified Internal Auditor (CIA) Specialties:Internal Auditing, Risk Management, Sarbanes-Oxley, Accounting \n \nCertified Public Accountant (CPA) -- Oregon \nCertified Internal Auditor (CIA) Experience Senior Internal Auditor, Greater Asia Intel Corporation December 2013  – Present (1 year 9 months) Shanghai City, China Senior Internal Auditor Intel Corporation April 2012  –  December 2013  (1 year 9 months) Portland, Oregon Area Internal Auditor Intel Corporation August 2010  –  April 2012  (1 year 9 months) Portland, Oregon Area Senior External Reporting Specialist Intel Corporation February 2008  –  July 2010  (2 years 6 months) Portland, Oregon Area External Reporting Specialist Intel Corporation May 2006  –  February 2008  (1 year 10 months) Portland, Oregon Area Accounting Intern Intel Corporation May 2005  –  August 2005  (4 months) Portland, Oregon Area External Reporting group Consultant Qualtrics 2002  –  2003  (1 year) Provo, Utah Area NASD Registered Securities Representative E*TRADE Financial April 2000  –  August 2002  (2 years 5 months) Sacramento, California Area Senior Internal Auditor, Greater Asia Intel Corporation December 2013  – Present (1 year 9 months) Shanghai City, China Senior Internal Auditor, Greater Asia Intel Corporation December 2013  – Present (1 year 9 months) Shanghai City, China Senior Internal Auditor Intel Corporation April 2012  –  December 2013  (1 year 9 months) Portland, Oregon Area Senior Internal Auditor Intel Corporation April 2012  –  December 2013  (1 year 9 months) Portland, Oregon Area Internal Auditor Intel Corporation August 2010  –  April 2012  (1 year 9 months) Portland, Oregon Area Internal Auditor Intel Corporation August 2010  –  April 2012  (1 year 9 months) Portland, Oregon Area Senior External Reporting Specialist Intel Corporation February 2008  –  July 2010  (2 years 6 months) Portland, Oregon Area Senior External Reporting Specialist Intel Corporation February 2008  –  July 2010  (2 years 6 months) Portland, Oregon Area External Reporting Specialist Intel Corporation May 2006  –  February 2008  (1 year 10 months) Portland, Oregon Area External Reporting Specialist Intel Corporation May 2006  –  February 2008  (1 year 10 months) Portland, Oregon Area Accounting Intern Intel Corporation May 2005  –  August 2005  (4 months) Portland, Oregon Area External Reporting group Accounting Intern Intel Corporation May 2005  –  August 2005  (4 months) Portland, Oregon Area External Reporting group Consultant Qualtrics 2002  –  2003  (1 year) Provo, Utah Area Consultant Qualtrics 2002  –  2003  (1 year) Provo, Utah Area NASD Registered Securities Representative E*TRADE Financial April 2000  –  August 2002  (2 years 5 months) Sacramento, California Area NASD Registered Securities Representative E*TRADE Financial April 2000  –  August 2002  (2 years 5 months) Sacramento, California Area Skills Accounting SEC reporting Internal Audit Financial Reporting SEC filings Internal Controls Revenue Recognition Sarbanes-Oxley Act Cost Accounting US GAAP CPA Financial Modeling Financial Accounting Financial Analysis Skills  Accounting SEC reporting Internal Audit Financial Reporting SEC filings Internal Controls Revenue Recognition Sarbanes-Oxley Act Cost Accounting US GAAP CPA Financial Modeling Financial Accounting Financial Analysis Accounting SEC reporting Internal Audit Financial Reporting SEC filings Internal Controls Revenue Recognition Sarbanes-Oxley Act Cost Accounting US GAAP CPA Financial Modeling Financial Accounting Financial Analysis Accounting SEC reporting Internal Audit Financial Reporting SEC filings Internal Controls Revenue Recognition Sarbanes-Oxley Act Cost Accounting US GAAP CPA Financial Modeling Financial Accounting Financial Analysis Education Brigham Young University BS,  Accounting 2002  – 2006 Brigham Young University BS,  Accounting 2002  – 2006 Brigham Young University BS,  Accounting 2002  – 2006 Brigham Young University BS,  Accounting 2002  – 2006 Honors & Awards Additional Honors & Awards Certified Public Accountant, State of Oregon Additional Honors & Awards Certified Public Accountant, State of Oregon Additional Honors & Awards Certified Public Accountant, State of Oregon Additional Honors & Awards Certified Public Accountant, State of Oregon ", "Skills Security Network Security CISSP IT Audit CISA Information Security Information Security... Computer Security Risk Assessment PCI DSS ISO 27001 Sarbanes-Oxley Act Information Technology Risk Management Penetration Testing ITIL Security Audits Vulnerability Assessment Internal Audit Business Continuity Disaster Recovery COBIT Governance Sarbanes-Oxley See 9+     See less Skills  Security Network Security CISSP IT Audit CISA Information Security Information Security... Computer Security Risk Assessment PCI DSS ISO 27001 Sarbanes-Oxley Act Information Technology Risk Management Penetration Testing ITIL Security Audits Vulnerability Assessment Internal Audit Business Continuity Disaster Recovery COBIT Governance Sarbanes-Oxley See 9+     See less Security Network Security CISSP IT Audit CISA Information Security Information Security... Computer Security Risk Assessment PCI DSS ISO 27001 Sarbanes-Oxley Act Information Technology Risk Management Penetration Testing ITIL Security Audits Vulnerability Assessment Internal Audit Business Continuity Disaster Recovery COBIT Governance Sarbanes-Oxley See 9+     See less Security Network Security CISSP IT Audit CISA Information Security Information Security... Computer Security Risk Assessment PCI DSS ISO 27001 Sarbanes-Oxley Act Information Technology Risk Management Penetration Testing ITIL Security Audits Vulnerability Assessment Internal Audit Business Continuity Disaster Recovery COBIT Governance Sarbanes-Oxley See 9+     See less Honors & Awards ", "Experience Quality Assurance Looking for an exciting new job opportunity Release product.audits ,ectc Internal Auditor Intel Corporation May 2009  – Present (6 years 4 months) Manufacturing operation Intel Corporation June 1997  –  June 2009  (12 years 1 month) Quality Assurance Looking for an exciting new job opportunity Release product.audits ,ectc Quality Assurance Looking for an exciting new job opportunity Release product.audits ,ectc Internal Auditor Intel Corporation May 2009  – Present (6 years 4 months) Internal Auditor Intel Corporation May 2009  – Present (6 years 4 months) Manufacturing operation Intel Corporation June 1997  –  June 2009  (12 years 1 month) Manufacturing operation Intel Corporation June 1997  –  June 2009  (12 years 1 month) Languages English English English Skills Accounting Budgets Research Financial Reporting Quality Auditing Project Management Six Sigma Semiconductors Continuous Improvement Manufacturing Process Improvement Team Leadership Skills  Accounting Budgets Research Financial Reporting Quality Auditing Project Management Six Sigma Semiconductors Continuous Improvement Manufacturing Process Improvement Team Leadership Accounting Budgets Research Financial Reporting Quality Auditing Project Management Six Sigma Semiconductors Continuous Improvement Manufacturing Process Improvement Team Leadership Accounting Budgets Research Financial Reporting Quality Auditing Project Management Six Sigma Semiconductors Continuous Improvement Manufacturing Process Improvement Team Leadership Education universidad autonoma monterrey Associate’s Degree,  Human Resources Management/Personnel Administration , General 2013  – 2015 Genaral ADM 1 and 2 \nDerecho 1y2 \nderecho mercantil 1 \nEstadistica \nContabilidad1 \nAntropologia Social \nPensamiento psicológico  \n \n Univesidad Nacional Bachelor’s Degree,  Art/Art Studies , General 1991  – 1994 General Studies, Art universidad autonoma monterrey Associate’s Degree,  Human Resources Management/Personnel Administration , General 2013  – 2015 Genaral ADM 1 and 2 \nDerecho 1y2 \nderecho mercantil 1 \nEstadistica \nContabilidad1 \nAntropologia Social \nPensamiento psicológico  \n \n universidad autonoma monterrey Associate’s Degree,  Human Resources Management/Personnel Administration , General 2013  – 2015 Genaral ADM 1 and 2 \nDerecho 1y2 \nderecho mercantil 1 \nEstadistica \nContabilidad1 \nAntropologia Social \nPensamiento psicológico  \n \n universidad autonoma monterrey Associate’s Degree,  Human Resources Management/Personnel Administration , General 2013  – 2015 Genaral ADM 1 and 2 \nDerecho 1y2 \nderecho mercantil 1 \nEstadistica \nContabilidad1 \nAntropologia Social \nPensamiento psicológico  \n \n Univesidad Nacional Bachelor’s Degree,  Art/Art Studies , General 1991  – 1994 General Studies, Art Univesidad Nacional Bachelor’s Degree,  Art/Art Studies , General 1991  – 1994 General Studies, Art Univesidad Nacional Bachelor’s Degree,  Art/Art Studies , General 1991  – 1994 General Studies, Art ", "Summary EXPERIENCED OPERATIONS AND FINANCE EXECUTIVE \n \nHands on executive leader with a proven track record of developing and implementing effective business strategies, establishing achievable stretch operating plans, and motivating cross-functional teams to deliver great results. Demonstrated ability to achieve consistent financial performance through successful execution of business strategies, achievement of high customer satisfaction and retention, and the implementation of programs to attract and retain top talent, with over 25 years’ experience in professional services, high technology and manufacturing companies ranging from small organizations to Fortune 100 companies. Summary EXPERIENCED OPERATIONS AND FINANCE EXECUTIVE \n \nHands on executive leader with a proven track record of developing and implementing effective business strategies, establishing achievable stretch operating plans, and motivating cross-functional teams to deliver great results. Demonstrated ability to achieve consistent financial performance through successful execution of business strategies, achievement of high customer satisfaction and retention, and the implementation of programs to attract and retain top talent, with over 25 years’ experience in professional services, high technology and manufacturing companies ranging from small organizations to Fortune 100 companies. EXPERIENCED OPERATIONS AND FINANCE EXECUTIVE \n \nHands on executive leader with a proven track record of developing and implementing effective business strategies, establishing achievable stretch operating plans, and motivating cross-functional teams to deliver great results. Demonstrated ability to achieve consistent financial performance through successful execution of business strategies, achievement of high customer satisfaction and retention, and the implementation of programs to attract and retain top talent, with over 25 years’ experience in professional services, high technology and manufacturing companies ranging from small organizations to Fortune 100 companies. EXPERIENCED OPERATIONS AND FINANCE EXECUTIVE \n \nHands on executive leader with a proven track record of developing and implementing effective business strategies, establishing achievable stretch operating plans, and motivating cross-functional teams to deliver great results. Demonstrated ability to achieve consistent financial performance through successful execution of business strategies, achievement of high customer satisfaction and retention, and the implementation of programs to attract and retain top talent, with over 25 years’ experience in professional services, high technology and manufacturing companies ranging from small organizations to Fortune 100 companies. Experience Senior Vice President Kranz & Associates May 2014  –  May 2015  (1 year 1 month) San Francisco Bay Area Financial and administrative consulting advisory services for companies at all stages of development. \n \nManaged internal operations, including scheduling and recruiting functions. Responsible for developing and implementing infrastructure for growth. \n \n•\tMember of Executive Team, reporting to CEO \n•\tConducted company’s first all-employee survey and designed and developed programs to manage performance and improve employee retention, including a performance review process, and a mentoring and career development programs \n•\tImplemented process improvements, new tools, hired staff and improved reporting to double the hiring of talent in a very tight recruiting market \n•\tImplemented human resource policy and process improvements, including a new business referral bonus program, PTO policy, and converted certain 1099 contractors to W2 status \n•\tImplemented improvements to employee training program \n Executive Vice President, Western Region Accretive Solutions, Inc. May 1997  –  November 2013  (16 years 7 months) San Francisco Bay Area A national consulting and executive search firm helping companies manage and improve their financial, operational, and IT performance. \n \nManaged business region with $50m in revenues and 250 employees. Responsible for all aspects of consulting and executive search practice including full P&L responsibility, strategy development and execution, business development, recruiting, service delivery and operations for Accretive Solutions’ largest region. Provided solutions to clients in technology, life sciences, financial services, media and entertainment, and healthcare industries. World Traveller Large May 1995  –  February 1997  (1 year 10 months) Travelled throughout Europe, North Africa, Asia, Australia, New Zealand and various Pacific Islands Senior Auditor Intel Corporation November 1993  –  April 1995  (1 year 6 months) Developed, conducted and supervised financial and operational audit programs in the U.S., Europe and Asia, reviewing practices such as inventory management and security, product delivery performance, product naming conventions, tax records, human resources systems, large-scale construction projects and subcontractor manufacturing operations. Various Accounting & Finance Positions Amdahl Corporation 1989  –  1993  (4 years) Sunnyvale and Santa Clara, California Various positions, including Accountant, Internal Auditor and Policies & Procedures officer Wesfarmers Chemicals, Energy and Fertilisers 1983  –  1988  (5 years) Perth, Australia Senior Vice President Kranz & Associates May 2014  –  May 2015  (1 year 1 month) San Francisco Bay Area Financial and administrative consulting advisory services for companies at all stages of development. \n \nManaged internal operations, including scheduling and recruiting functions. Responsible for developing and implementing infrastructure for growth. \n \n•\tMember of Executive Team, reporting to CEO \n•\tConducted company’s first all-employee survey and designed and developed programs to manage performance and improve employee retention, including a performance review process, and a mentoring and career development programs \n•\tImplemented process improvements, new tools, hired staff and improved reporting to double the hiring of talent in a very tight recruiting market \n•\tImplemented human resource policy and process improvements, including a new business referral bonus program, PTO policy, and converted certain 1099 contractors to W2 status \n•\tImplemented improvements to employee training program \n Senior Vice President Kranz & Associates May 2014  –  May 2015  (1 year 1 month) San Francisco Bay Area Financial and administrative consulting advisory services for companies at all stages of development. \n \nManaged internal operations, including scheduling and recruiting functions. Responsible for developing and implementing infrastructure for growth. \n \n•\tMember of Executive Team, reporting to CEO \n•\tConducted company’s first all-employee survey and designed and developed programs to manage performance and improve employee retention, including a performance review process, and a mentoring and career development programs \n•\tImplemented process improvements, new tools, hired staff and improved reporting to double the hiring of talent in a very tight recruiting market \n•\tImplemented human resource policy and process improvements, including a new business referral bonus program, PTO policy, and converted certain 1099 contractors to W2 status \n•\tImplemented improvements to employee training program \n Executive Vice President, Western Region Accretive Solutions, Inc. May 1997  –  November 2013  (16 years 7 months) San Francisco Bay Area A national consulting and executive search firm helping companies manage and improve their financial, operational, and IT performance. \n \nManaged business region with $50m in revenues and 250 employees. Responsible for all aspects of consulting and executive search practice including full P&L responsibility, strategy development and execution, business development, recruiting, service delivery and operations for Accretive Solutions’ largest region. Provided solutions to clients in technology, life sciences, financial services, media and entertainment, and healthcare industries. Executive Vice President, Western Region Accretive Solutions, Inc. May 1997  –  November 2013  (16 years 7 months) San Francisco Bay Area A national consulting and executive search firm helping companies manage and improve their financial, operational, and IT performance. \n \nManaged business region with $50m in revenues and 250 employees. Responsible for all aspects of consulting and executive search practice including full P&L responsibility, strategy development and execution, business development, recruiting, service delivery and operations for Accretive Solutions’ largest region. Provided solutions to clients in technology, life sciences, financial services, media and entertainment, and healthcare industries. World Traveller Large May 1995  –  February 1997  (1 year 10 months) Travelled throughout Europe, North Africa, Asia, Australia, New Zealand and various Pacific Islands World Traveller Large May 1995  –  February 1997  (1 year 10 months) Travelled throughout Europe, North Africa, Asia, Australia, New Zealand and various Pacific Islands Senior Auditor Intel Corporation November 1993  –  April 1995  (1 year 6 months) Developed, conducted and supervised financial and operational audit programs in the U.S., Europe and Asia, reviewing practices such as inventory management and security, product delivery performance, product naming conventions, tax records, human resources systems, large-scale construction projects and subcontractor manufacturing operations. Senior Auditor Intel Corporation November 1993  –  April 1995  (1 year 6 months) Developed, conducted and supervised financial and operational audit programs in the U.S., Europe and Asia, reviewing practices such as inventory management and security, product delivery performance, product naming conventions, tax records, human resources systems, large-scale construction projects and subcontractor manufacturing operations. Various Accounting & Finance Positions Amdahl Corporation 1989  –  1993  (4 years) Sunnyvale and Santa Clara, California Various Accounting & Finance Positions Amdahl Corporation 1989  –  1993  (4 years) Sunnyvale and Santa Clara, California Various positions, including Accountant, Internal Auditor and Policies & Procedures officer Wesfarmers Chemicals, Energy and Fertilisers 1983  –  1988  (5 years) Perth, Australia Various positions, including Accountant, Internal Auditor and Policies & Procedures officer Wesfarmers Chemicals, Energy and Fertilisers 1983  –  1988  (5 years) Perth, Australia Skills Sarbanes-Oxley Act SEC filings Internal Audit Program Management Accounting Management Mergers Auditing Revenue Recognition Finance Cost Accounting Risk Management Acquisition Integration Executive Management Financial Accounting Financial Reporting Mergers & Acquisitions Financial Audits Start-ups Sarbanes-Oxley Financial Analysis Enterprise Risk... Business Process Due Diligence Corporate Finance ERP Process Improvement Cash Management Restructuring Internal Controls Business Process... Business Transformation Human Resources Corporate Development Corporate Governance Business Planning Financial Modeling Management Consulting Strategy Managerial Finance Strategic Financial... Forecasting Governance Financial Services Consulting See 30+     See less Skills  Sarbanes-Oxley Act SEC filings Internal Audit Program Management Accounting Management Mergers Auditing Revenue Recognition Finance Cost Accounting Risk Management Acquisition Integration Executive Management Financial Accounting Financial Reporting Mergers & Acquisitions Financial Audits Start-ups Sarbanes-Oxley Financial Analysis Enterprise Risk... Business Process Due Diligence Corporate Finance ERP Process Improvement Cash Management Restructuring Internal Controls Business Process... Business Transformation Human Resources Corporate Development Corporate Governance Business Planning Financial Modeling Management Consulting Strategy Managerial Finance Strategic Financial... Forecasting Governance Financial Services Consulting See 30+     See less Sarbanes-Oxley Act SEC filings Internal Audit Program Management Accounting Management Mergers Auditing Revenue Recognition Finance Cost Accounting Risk Management Acquisition Integration Executive Management Financial Accounting Financial Reporting Mergers & Acquisitions Financial Audits Start-ups Sarbanes-Oxley Financial Analysis Enterprise Risk... Business Process Due Diligence Corporate Finance ERP Process Improvement Cash Management Restructuring Internal Controls Business Process... Business Transformation Human Resources Corporate Development Corporate Governance Business Planning Financial Modeling Management Consulting Strategy Managerial Finance Strategic Financial... Forecasting Governance Financial Services Consulting See 30+     See less Sarbanes-Oxley Act SEC filings Internal Audit Program Management Accounting Management Mergers Auditing Revenue Recognition Finance Cost Accounting Risk Management Acquisition Integration Executive Management Financial Accounting Financial Reporting Mergers & Acquisitions Financial Audits Start-ups Sarbanes-Oxley Financial Analysis Enterprise Risk... Business Process Due Diligence Corporate Finance ERP Process Improvement Cash Management Restructuring Internal Controls Business Process... Business Transformation Human Resources Corporate Development Corporate Governance Business Planning Financial Modeling Management Consulting Strategy Managerial Finance Strategic Financial... Forecasting Governance Financial Services Consulting See 30+     See less Education Curtin University Bachelor of Business (BBus),  Accounting and Business Law 1980  – 1983 Curtin University Bachelor of Business (BBus),  Accounting and Business Law 1980  – 1983 Curtin University Bachelor of Business (BBus),  Accounting and Business Law 1980  – 1983 Curtin University Bachelor of Business (BBus),  Accounting and Business Law 1980  – 1983 ", "Experience Payroll Auditor Intel Corporation Payroll Auditor Intel Corporation Payroll Auditor Intel Corporation ", "Summary I am an Internal Auditor in a large worldwide bluechip corporation. I have 10 years of operational finance & controls experience and am CIMA qualified - am currently working towards CIA. I have international experience of working in the States, and have undertaken geo and worldwide roles providing a full experience of working in a global company. Summary I am an Internal Auditor in a large worldwide bluechip corporation. I have 10 years of operational finance & controls experience and am CIMA qualified - am currently working towards CIA. I have international experience of working in the States, and have undertaken geo and worldwide roles providing a full experience of working in a global company. I am an Internal Auditor in a large worldwide bluechip corporation. I have 10 years of operational finance & controls experience and am CIMA qualified - am currently working towards CIA. I have international experience of working in the States, and have undertaken geo and worldwide roles providing a full experience of working in a global company. I am an Internal Auditor in a large worldwide bluechip corporation. I have 10 years of operational finance & controls experience and am CIMA qualified - am currently working towards CIA. I have international experience of working in the States, and have undertaken geo and worldwide roles providing a full experience of working in a global company. Experience Internal Auditor Intel Corporation July 2013  – Present (2 years 2 months) United Kingdom A member of the Greater Europe Audit team responsible for conducting audits across Worldwide locations: \n•\tAudits conducted on a variety of sites from Research and Development, Production through to Sales and Marketing.  \n•\tAudits conducted from planning through to fieldwork and results/recommendations issued to the group being audited.  \n•\tExperience in leading audits with particular specialism in Sales and Marketing. \n•\tHigh skill levels in communication and stakeholder management resulted in acceptance of audit items issued and appreciation of value added to the business by the mgmt. teams. Partner Marketing Finance Manager Intel Corporation January 2012  –  July 2013  (1 year 7 months) Management of the Intel Inside Program in EMEA (Europe, Middle East and Africa) from a Finance perspective in EMEA. Managed a team of 9 through a Marketing Program regeneration including identifying and resourcing new finance roles to support the program, managing resource requirements throughout the change, keeping team morale up throughout the period. Effectively managed a reduction in resource from 9 to 5 people to support new program. Experience of setting team quarterly objectives and managing the team to those throughout the quarter. Marketing Controls Specialist Intel Corporation March 2010  –  December 2011  (1 year 10 months) Management of Intel Risk and Controls across all Marketing programs within the EMEA region, and Customer Audit lead carrying out Intel Audits with customers to ensure compliance to Terms and Conditions of relevant programs. Key Achievements included: \n•\tCompleting 10 customer audits across EMEA, ranging from Channel customers to local resellers to ensure compliance to Marketing and Pricing Programs. Dealt with very ambiguous situations and found significant $ recovery for the company. \n•\tInternal Audit Experience – completion of Intel small site audits focused on Marketing Programs. \n•\tProactively set up and led a Worldwide Marketing Controls forum. Connected Controls and Purchasing together, drove collaboration between the groups and implemented a new worldwide audit for vendors. \n \nAlso completed a 6 month Worldwide assignment at company headquarters in the USA. Focused on risk and controls of the new Intel Inside Program. Worked with all geographies across the world. Achievements include completing worldwide risk assessment to highlight program transition risks. Completion of worldwide brand value analysis and co-lead of worldwide audit team driving worldwide alignment and improvements for audit in the new Intel Inside Program. Regular report outs to Finance and Marketing worldwide directors were included in this assignment. Marketing Finance Analyst Intel Corporation February 2008  –  February 2010  (2 years 1 month) Managed headcount and spend budgets for the marketing organisations within Europe, Middle East and Africa. Key achievements included: Key Finance contact on site strategy project preparing ROI’s and influencing senior management regarding best course of action. I also developed a travel tool to help teams manage travel expenditure. Management of marketing accruals with no audit items or variances outside tolerance. Channel Finance Analyst Intel Corporation July 2005  –  January 2008  (2 years 7 months) United Kingdom This role comprised of account ownership from a financial perspective of some of the external distributors Intel works with, and management of sales out reporting and inventory levels. Key achievements included: Worldwide lead for a business divestiture with aim to define Channel Finance process from Day One of divestiture. Led cross departmental team to ensure successful centalisation of the largest Distributor in Europe. Internal Auditor Intel Corporation July 2013  – Present (2 years 2 months) United Kingdom A member of the Greater Europe Audit team responsible for conducting audits across Worldwide locations: \n•\tAudits conducted on a variety of sites from Research and Development, Production through to Sales and Marketing.  \n•\tAudits conducted from planning through to fieldwork and results/recommendations issued to the group being audited.  \n•\tExperience in leading audits with particular specialism in Sales and Marketing. \n•\tHigh skill levels in communication and stakeholder management resulted in acceptance of audit items issued and appreciation of value added to the business by the mgmt. teams. Internal Auditor Intel Corporation July 2013  – Present (2 years 2 months) United Kingdom A member of the Greater Europe Audit team responsible for conducting audits across Worldwide locations: \n•\tAudits conducted on a variety of sites from Research and Development, Production through to Sales and Marketing.  \n•\tAudits conducted from planning through to fieldwork and results/recommendations issued to the group being audited.  \n•\tExperience in leading audits with particular specialism in Sales and Marketing. \n•\tHigh skill levels in communication and stakeholder management resulted in acceptance of audit items issued and appreciation of value added to the business by the mgmt. teams. Partner Marketing Finance Manager Intel Corporation January 2012  –  July 2013  (1 year 7 months) Management of the Intel Inside Program in EMEA (Europe, Middle East and Africa) from a Finance perspective in EMEA. Managed a team of 9 through a Marketing Program regeneration including identifying and resourcing new finance roles to support the program, managing resource requirements throughout the change, keeping team morale up throughout the period. Effectively managed a reduction in resource from 9 to 5 people to support new program. Experience of setting team quarterly objectives and managing the team to those throughout the quarter. Partner Marketing Finance Manager Intel Corporation January 2012  –  July 2013  (1 year 7 months) Management of the Intel Inside Program in EMEA (Europe, Middle East and Africa) from a Finance perspective in EMEA. Managed a team of 9 through a Marketing Program regeneration including identifying and resourcing new finance roles to support the program, managing resource requirements throughout the change, keeping team morale up throughout the period. Effectively managed a reduction in resource from 9 to 5 people to support new program. Experience of setting team quarterly objectives and managing the team to those throughout the quarter. Marketing Controls Specialist Intel Corporation March 2010  –  December 2011  (1 year 10 months) Management of Intel Risk and Controls across all Marketing programs within the EMEA region, and Customer Audit lead carrying out Intel Audits with customers to ensure compliance to Terms and Conditions of relevant programs. Key Achievements included: \n•\tCompleting 10 customer audits across EMEA, ranging from Channel customers to local resellers to ensure compliance to Marketing and Pricing Programs. Dealt with very ambiguous situations and found significant $ recovery for the company. \n•\tInternal Audit Experience – completion of Intel small site audits focused on Marketing Programs. \n•\tProactively set up and led a Worldwide Marketing Controls forum. Connected Controls and Purchasing together, drove collaboration between the groups and implemented a new worldwide audit for vendors. \n \nAlso completed a 6 month Worldwide assignment at company headquarters in the USA. Focused on risk and controls of the new Intel Inside Program. Worked with all geographies across the world. Achievements include completing worldwide risk assessment to highlight program transition risks. Completion of worldwide brand value analysis and co-lead of worldwide audit team driving worldwide alignment and improvements for audit in the new Intel Inside Program. Regular report outs to Finance and Marketing worldwide directors were included in this assignment. Marketing Controls Specialist Intel Corporation March 2010  –  December 2011  (1 year 10 months) Management of Intel Risk and Controls across all Marketing programs within the EMEA region, and Customer Audit lead carrying out Intel Audits with customers to ensure compliance to Terms and Conditions of relevant programs. Key Achievements included: \n•\tCompleting 10 customer audits across EMEA, ranging from Channel customers to local resellers to ensure compliance to Marketing and Pricing Programs. Dealt with very ambiguous situations and found significant $ recovery for the company. \n•\tInternal Audit Experience – completion of Intel small site audits focused on Marketing Programs. \n•\tProactively set up and led a Worldwide Marketing Controls forum. Connected Controls and Purchasing together, drove collaboration between the groups and implemented a new worldwide audit for vendors. \n \nAlso completed a 6 month Worldwide assignment at company headquarters in the USA. Focused on risk and controls of the new Intel Inside Program. Worked with all geographies across the world. Achievements include completing worldwide risk assessment to highlight program transition risks. Completion of worldwide brand value analysis and co-lead of worldwide audit team driving worldwide alignment and improvements for audit in the new Intel Inside Program. Regular report outs to Finance and Marketing worldwide directors were included in this assignment. Marketing Finance Analyst Intel Corporation February 2008  –  February 2010  (2 years 1 month) Managed headcount and spend budgets for the marketing organisations within Europe, Middle East and Africa. Key achievements included: Key Finance contact on site strategy project preparing ROI’s and influencing senior management regarding best course of action. I also developed a travel tool to help teams manage travel expenditure. Management of marketing accruals with no audit items or variances outside tolerance. Marketing Finance Analyst Intel Corporation February 2008  –  February 2010  (2 years 1 month) Managed headcount and spend budgets for the marketing organisations within Europe, Middle East and Africa. Key achievements included: Key Finance contact on site strategy project preparing ROI’s and influencing senior management regarding best course of action. I also developed a travel tool to help teams manage travel expenditure. Management of marketing accruals with no audit items or variances outside tolerance. Channel Finance Analyst Intel Corporation July 2005  –  January 2008  (2 years 7 months) United Kingdom This role comprised of account ownership from a financial perspective of some of the external distributors Intel works with, and management of sales out reporting and inventory levels. Key achievements included: Worldwide lead for a business divestiture with aim to define Channel Finance process from Day One of divestiture. Led cross departmental team to ensure successful centalisation of the largest Distributor in Europe. Channel Finance Analyst Intel Corporation July 2005  –  January 2008  (2 years 7 months) United Kingdom This role comprised of account ownership from a financial perspective of some of the external distributors Intel works with, and management of sales out reporting and inventory levels. Key achievements included: Worldwide lead for a business divestiture with aim to define Channel Finance process from Day One of divestiture. Led cross departmental team to ensure successful centalisation of the largest Distributor in Europe. Skills Semiconductors Processors Intel JMP Cross-functional Team... Semiconductor Industry Financial Modeling Skills  Semiconductors Processors Intel JMP Cross-functional Team... Semiconductor Industry Financial Modeling Semiconductors Processors Intel JMP Cross-functional Team... Semiconductor Industry Financial Modeling Semiconductors Processors Intel JMP Cross-functional Team... Semiconductor Industry Financial Modeling Education University of Plymouth Bachelor's degree,  Business Studies 2001  – 2005 Queen Marys College A levels,  Business Studies , History,  Sociology 1999  – 2001 University of Plymouth Bachelor's degree,  Business Studies 2001  – 2005 University of Plymouth Bachelor's degree,  Business Studies 2001  – 2005 University of Plymouth Bachelor's degree,  Business Studies 2001  – 2005 Queen Marys College A levels,  Business Studies , History,  Sociology 1999  – 2001 Queen Marys College A levels,  Business Studies , History,  Sociology 1999  – 2001 Queen Marys College A levels,  Business Studies , History,  Sociology 1999  – 2001 ", "Summary Specialties: CICPA, ACCA and HKICPA. Summary Specialties: CICPA, ACCA and HKICPA. Specialties: CICPA, ACCA and HKICPA. Specialties: CICPA, ACCA and HKICPA. Experience Internal Auditor Intel Corporation Internal Auditor Intel Corporation Internal Auditor Intel Corporation ", "Summary • Professional experience primarily relates to IT/business process optimization and internal control design consulting, assessment, and testing. \n• Big 4 experience in managing multiple IT and Compliance Attestation engagements across several organizations, platforms and industries. Summary • Professional experience primarily relates to IT/business process optimization and internal control design consulting, assessment, and testing. \n• Big 4 experience in managing multiple IT and Compliance Attestation engagements across several organizations, platforms and industries. • Professional experience primarily relates to IT/business process optimization and internal control design consulting, assessment, and testing. \n• Big 4 experience in managing multiple IT and Compliance Attestation engagements across several organizations, platforms and industries. • Professional experience primarily relates to IT/business process optimization and internal control design consulting, assessment, and testing. \n• Big 4 experience in managing multiple IT and Compliance Attestation engagements across several organizations, platforms and industries. Experience IT Internal Auditor Intel Corporation September 2013  – Present (2 years) IT Audit Senior Starbucks Coffee Company October 2011  –  April 2013  (1 year 7 months) Sr. Associate - IT Attestation KPMG 2010  –  September 2011  (1 year) Associate - IT Attestation KPMG Advisory 2008  –  July 2010  (2 years) Claim and Accounting Information System Specialist Lithia Motors January 2004  –  February 2005  (1 year 2 months) •Developing automated processes in Excel and Access to produce financial reports for management \n \n•Collaborating with team members and dealerships to transfer financial data at month-ends \n \n•Identifying process improvement opportunities within the accounting area and dealerships \n \n•Coordinating communications and corporations between dealerships and insurance carriers in the claim settlement process IT Internal Auditor Intel Corporation September 2013  – Present (2 years) IT Internal Auditor Intel Corporation September 2013  – Present (2 years) IT Audit Senior Starbucks Coffee Company October 2011  –  April 2013  (1 year 7 months) IT Audit Senior Starbucks Coffee Company October 2011  –  April 2013  (1 year 7 months) Sr. Associate - IT Attestation KPMG 2010  –  September 2011  (1 year) Sr. Associate - IT Attestation KPMG 2010  –  September 2011  (1 year) Associate - IT Attestation KPMG Advisory 2008  –  July 2010  (2 years) Associate - IT Attestation KPMG Advisory 2008  –  July 2010  (2 years) Claim and Accounting Information System Specialist Lithia Motors January 2004  –  February 2005  (1 year 2 months) •Developing automated processes in Excel and Access to produce financial reports for management \n \n•Collaborating with team members and dealerships to transfer financial data at month-ends \n \n•Identifying process improvement opportunities within the accounting area and dealerships \n \n•Coordinating communications and corporations between dealerships and insurance carriers in the claim settlement process Claim and Accounting Information System Specialist Lithia Motors January 2004  –  February 2005  (1 year 2 months) •Developing automated processes in Excel and Access to produce financial reports for management \n \n•Collaborating with team members and dealerships to transfer financial data at month-ends \n \n•Identifying process improvement opportunities within the accounting area and dealerships \n \n•Coordinating communications and corporations between dealerships and insurance carriers in the claim settlement process Skills Process Improvement Access Internal Controls Management Accounting IT Audit Information Technology Microsoft Excel Sarbanes-Oxley Act Internal Audit Auditing Financial Statements Consulting Business Process... Business Process Skills  Process Improvement Access Internal Controls Management Accounting IT Audit Information Technology Microsoft Excel Sarbanes-Oxley Act Internal Audit Auditing Financial Statements Consulting Business Process... Business Process Process Improvement Access Internal Controls Management Accounting IT Audit Information Technology Microsoft Excel Sarbanes-Oxley Act Internal Audit Auditing Financial Statements Consulting Business Process... Business Process Process Improvement Access Internal Controls Management Accounting IT Audit Information Technology Microsoft Excel Sarbanes-Oxley Act Internal Audit Auditing Financial Statements Consulting Business Process... Business Process Education The University of Texas at Austin - Red McCombs School of Business Master,  Professional Accounting 2007  – 2008 Southern Oregon University Bachelor,  BS in Accounting •Certificate in Accounting Information System \n•Certified Microsoft Office Specialist - Access, Excel The University of Texas at Austin - Red McCombs School of Business Master,  Professional Accounting 2007  – 2008 The University of Texas at Austin - Red McCombs School of Business Master,  Professional Accounting 2007  – 2008 The University of Texas at Austin - Red McCombs School of Business Master,  Professional Accounting 2007  – 2008 Southern Oregon University Bachelor,  BS in Accounting •Certificate in Accounting Information System \n•Certified Microsoft Office Specialist - Access, Excel Southern Oregon University Bachelor,  BS in Accounting •Certificate in Accounting Information System \n•Certified Microsoft Office Specialist - Access, Excel Southern Oregon University Bachelor,  BS in Accounting •Certificate in Accounting Information System \n•Certified Microsoft Office Specialist - Access, Excel ", "Summary Motivated, passionate, self-starter with expertise in assessing risk, understanding controls and control gaps, planning scheduling and executing audits while maintaining great client service skills, with an IT background primarily in SAP. Summary Motivated, passionate, self-starter with expertise in assessing risk, understanding controls and control gaps, planning scheduling and executing audits while maintaining great client service skills, with an IT background primarily in SAP. Motivated, passionate, self-starter with expertise in assessing risk, understanding controls and control gaps, planning scheduling and executing audits while maintaining great client service skills, with an IT background primarily in SAP. Motivated, passionate, self-starter with expertise in assessing risk, understanding controls and control gaps, planning scheduling and executing audits while maintaining great client service skills, with an IT background primarily in SAP. Experience IT Internal Auditor Intel Corporation October 2008  – Present (6 years 11 months) SAP Security and SOD Intel Corporation June 2001  –  September 2008  (7 years 4 months) Aircraft Maintenance Technician United States Air Force April 1989  –  December 1997  (8 years 9 months) IT Internal Auditor Intel Corporation October 2008  – Present (6 years 11 months) IT Internal Auditor Intel Corporation October 2008  – Present (6 years 11 months) SAP Security and SOD Intel Corporation June 2001  –  September 2008  (7 years 4 months) SAP Security and SOD Intel Corporation June 2001  –  September 2008  (7 years 4 months) Aircraft Maintenance Technician United States Air Force April 1989  –  December 1997  (8 years 9 months) Aircraft Maintenance Technician United States Air Force April 1989  –  December 1997  (8 years 9 months) Skills SAP Internal Audit ITIL IT Audit Information Security ABAP Sarbanes-Oxley Skills  SAP Internal Audit ITIL IT Audit Information Security ABAP Sarbanes-Oxley SAP Internal Audit ITIL IT Audit Information Security ABAP Sarbanes-Oxley SAP Internal Audit ITIL IT Audit Information Security ABAP Sarbanes-Oxley Education California State University-Chico BS,  MIS 1997  – 2001 California State University-Chico BS,  MIS 1997  – 2001 California State University-Chico BS,  MIS 1997  – 2001 California State University-Chico BS,  MIS 1997  – 2001 ", "Skills Finance Internal Audit Auditing Financial Risk Valuation Financial Analysis Financial Modeling Accounting Financial Reporting Internal Controls Process Improvement Sarbanes-Oxley Act Skills  Finance Internal Audit Auditing Financial Risk Valuation Financial Analysis Financial Modeling Accounting Financial Reporting Internal Controls Process Improvement Sarbanes-Oxley Act Finance Internal Audit Auditing Financial Risk Valuation Financial Analysis Financial Modeling Accounting Financial Reporting Internal Controls Process Improvement Sarbanes-Oxley Act Finance Internal Audit Auditing Financial Risk Valuation Financial Analysis Financial Modeling Accounting Financial Reporting Internal Controls Process Improvement Sarbanes-Oxley Act ", "Summary Versatile strategic procurement and finance leader with extensive experience driving cost reduction, developing and implementing global sourcing strategies to achieve optimal long-term results. Passionate about continuous development. \n \nSpecialities: Financial Analysis, Cost Reduction, Budget and Financial Control, Business Case Analytics, Should cost modeling, Market & Spend Analytics, Industry Benchmarking, Strategic Sourcing, Category Management, Supplier Negotiations, Contract Management, Supplier Relationship Management, Supplier Performance Management, Team Leadership & Development, Program Management, e-Procurement. Summary Versatile strategic procurement and finance leader with extensive experience driving cost reduction, developing and implementing global sourcing strategies to achieve optimal long-term results. Passionate about continuous development. \n \nSpecialities: Financial Analysis, Cost Reduction, Budget and Financial Control, Business Case Analytics, Should cost modeling, Market & Spend Analytics, Industry Benchmarking, Strategic Sourcing, Category Management, Supplier Negotiations, Contract Management, Supplier Relationship Management, Supplier Performance Management, Team Leadership & Development, Program Management, e-Procurement. Versatile strategic procurement and finance leader with extensive experience driving cost reduction, developing and implementing global sourcing strategies to achieve optimal long-term results. Passionate about continuous development. \n \nSpecialities: Financial Analysis, Cost Reduction, Budget and Financial Control, Business Case Analytics, Should cost modeling, Market & Spend Analytics, Industry Benchmarking, Strategic Sourcing, Category Management, Supplier Negotiations, Contract Management, Supplier Relationship Management, Supplier Performance Management, Team Leadership & Development, Program Management, e-Procurement. Versatile strategic procurement and finance leader with extensive experience driving cost reduction, developing and implementing global sourcing strategies to achieve optimal long-term results. Passionate about continuous development. \n \nSpecialities: Financial Analysis, Cost Reduction, Budget and Financial Control, Business Case Analytics, Should cost modeling, Market & Spend Analytics, Industry Benchmarking, Strategic Sourcing, Category Management, Supplier Negotiations, Contract Management, Supplier Relationship Management, Supplier Performance Management, Team Leadership & Development, Program Management, e-Procurement. Experience Internal Auditor Intel Corporation July 2015  – Present (2 months) Penang, Malaysia Finance Senior Manager Intel Corporation December 2014  – Present (9 months) Logistics Procurement Senior Manager Dell September 2013  –  November 2014  (1 year 3 months) Penang, Malaysia Manage Global Logistics Procurement GSM/RCM team. Responsible for bids analytics, industry rate benchmarking and should cost analysis for Global Fulfillment and Logistics. Drive various aspects of logistics sourcing: align with GCM and business partners, capture requirements, execute RFQ, evaluate providers, make award recommendations, and drive contract amendments. Research, analyze and understand the supply market drivers for applicable logistics and services commodities. Ensure effective on-boarding of new OTM team and leverage of OTM technology, developing organizational capability to ensure robust pricing integrity and maximized leverage of the technology’s new capabilities. Logistics Procurement Consultant Dell March 2012  –  August 2013  (1 year 6 months) Penang, Malaysia Procurement responsibility for Global Inbound Logistics and South Asia Outbound Logistics. Responsible for strategic development of providers, development of commodity strategies, negotiation, and enforcement of logistics contracts. Finance Manager - Global Logistics Procurement Dell March 2009  –  March 2012  (3 years 1 month) Penang, Malaysia Finance support to the Executive Director of Global Logistics Procurement responsible for entire Dell Logistics Procurement. Monitor financial health of strategic suppliers ensuring no interruption of service in Logistics network. Provide business case guidance for negotiations and communicate cost impact to business finance partners. Through analysis of cost components and actual spend, review and provide guidance for cost reduction opportunities through supplier negotiations. Drive payment term improvements. Finance Manager - APJ Logistics Dell November 2006  –  March 2009  (2 years 5 months) Penang, Malaysia Finance Manager responsible for driving Asia Pacific & Japan (APJ) Logistics to meet Cost Per Box (CPB) and savings goal; prepare forecast reviews and leadership reviews. Initiate productivity/process improvement. Finance Senior Analyst - Product Development Intel Corporation July 2004  –  November 2006  (2 years 5 months) Penang, Malaysia Responsible for influencing product roadmap decisions and designs for desktop motherboards, drive BOM cost reductions, and quote new business. Finance Senior Analyst - Business Process Controls Intel Corporation May 2003  –  June 2004  (1 year 2 months) Penang, Malaysia Responsible for business process controls to keep Intel legal in dealing with China subcontractors, ensure all critical business processes are TLC (Tax Licensing Custom) compliant. Conduct risk assessment and improve controls on major business processes. Ensure successful outsourcers’ ramp up/down, resolve business and compliance issues, develop and drive process improvements. Finance Analyst - CPU Division Intel Corporation October 2000  –  May 2003  (2 years 8 months) Penang, Malaysia Responsible for cost and Budget & Planning function, manage quarterly budget; monthly close and management reporting activities, drive cost reduction. Budget & Planning, Cost and Inventory Analyst Intel Corporation August 1999  –  September 2000  (1 year 2 months) Penang, Malaysia Responsible for control of budgetary spending, drive cost reduction and drive lower inventory level. Internal Auditor Intel Corporation July 2015  – Present (2 months) Penang, Malaysia Internal Auditor Intel Corporation July 2015  – Present (2 months) Penang, Malaysia Finance Senior Manager Intel Corporation December 2014  – Present (9 months) Finance Senior Manager Intel Corporation December 2014  – Present (9 months) Logistics Procurement Senior Manager Dell September 2013  –  November 2014  (1 year 3 months) Penang, Malaysia Manage Global Logistics Procurement GSM/RCM team. Responsible for bids analytics, industry rate benchmarking and should cost analysis for Global Fulfillment and Logistics. Drive various aspects of logistics sourcing: align with GCM and business partners, capture requirements, execute RFQ, evaluate providers, make award recommendations, and drive contract amendments. Research, analyze and understand the supply market drivers for applicable logistics and services commodities. Ensure effective on-boarding of new OTM team and leverage of OTM technology, developing organizational capability to ensure robust pricing integrity and maximized leverage of the technology’s new capabilities. Logistics Procurement Senior Manager Dell September 2013  –  November 2014  (1 year 3 months) Penang, Malaysia Manage Global Logistics Procurement GSM/RCM team. Responsible for bids analytics, industry rate benchmarking and should cost analysis for Global Fulfillment and Logistics. Drive various aspects of logistics sourcing: align with GCM and business partners, capture requirements, execute RFQ, evaluate providers, make award recommendations, and drive contract amendments. Research, analyze and understand the supply market drivers for applicable logistics and services commodities. Ensure effective on-boarding of new OTM team and leverage of OTM technology, developing organizational capability to ensure robust pricing integrity and maximized leverage of the technology’s new capabilities. Logistics Procurement Consultant Dell March 2012  –  August 2013  (1 year 6 months) Penang, Malaysia Procurement responsibility for Global Inbound Logistics and South Asia Outbound Logistics. Responsible for strategic development of providers, development of commodity strategies, negotiation, and enforcement of logistics contracts. Logistics Procurement Consultant Dell March 2012  –  August 2013  (1 year 6 months) Penang, Malaysia Procurement responsibility for Global Inbound Logistics and South Asia Outbound Logistics. Responsible for strategic development of providers, development of commodity strategies, negotiation, and enforcement of logistics contracts. Finance Manager - Global Logistics Procurement Dell March 2009  –  March 2012  (3 years 1 month) Penang, Malaysia Finance support to the Executive Director of Global Logistics Procurement responsible for entire Dell Logistics Procurement. Monitor financial health of strategic suppliers ensuring no interruption of service in Logistics network. Provide business case guidance for negotiations and communicate cost impact to business finance partners. Through analysis of cost components and actual spend, review and provide guidance for cost reduction opportunities through supplier negotiations. Drive payment term improvements. Finance Manager - Global Logistics Procurement Dell March 2009  –  March 2012  (3 years 1 month) Penang, Malaysia Finance support to the Executive Director of Global Logistics Procurement responsible for entire Dell Logistics Procurement. Monitor financial health of strategic suppliers ensuring no interruption of service in Logistics network. Provide business case guidance for negotiations and communicate cost impact to business finance partners. Through analysis of cost components and actual spend, review and provide guidance for cost reduction opportunities through supplier negotiations. Drive payment term improvements. Finance Manager - APJ Logistics Dell November 2006  –  March 2009  (2 years 5 months) Penang, Malaysia Finance Manager responsible for driving Asia Pacific & Japan (APJ) Logistics to meet Cost Per Box (CPB) and savings goal; prepare forecast reviews and leadership reviews. Initiate productivity/process improvement. Finance Manager - APJ Logistics Dell November 2006  –  March 2009  (2 years 5 months) Penang, Malaysia Finance Manager responsible for driving Asia Pacific & Japan (APJ) Logistics to meet Cost Per Box (CPB) and savings goal; prepare forecast reviews and leadership reviews. Initiate productivity/process improvement. Finance Senior Analyst - Product Development Intel Corporation July 2004  –  November 2006  (2 years 5 months) Penang, Malaysia Responsible for influencing product roadmap decisions and designs for desktop motherboards, drive BOM cost reductions, and quote new business. Finance Senior Analyst - Product Development Intel Corporation July 2004  –  November 2006  (2 years 5 months) Penang, Malaysia Responsible for influencing product roadmap decisions and designs for desktop motherboards, drive BOM cost reductions, and quote new business. Finance Senior Analyst - Business Process Controls Intel Corporation May 2003  –  June 2004  (1 year 2 months) Penang, Malaysia Responsible for business process controls to keep Intel legal in dealing with China subcontractors, ensure all critical business processes are TLC (Tax Licensing Custom) compliant. Conduct risk assessment and improve controls on major business processes. Ensure successful outsourcers’ ramp up/down, resolve business and compliance issues, develop and drive process improvements. Finance Senior Analyst - Business Process Controls Intel Corporation May 2003  –  June 2004  (1 year 2 months) Penang, Malaysia Responsible for business process controls to keep Intel legal in dealing with China subcontractors, ensure all critical business processes are TLC (Tax Licensing Custom) compliant. Conduct risk assessment and improve controls on major business processes. Ensure successful outsourcers’ ramp up/down, resolve business and compliance issues, develop and drive process improvements. Finance Analyst - CPU Division Intel Corporation October 2000  –  May 2003  (2 years 8 months) Penang, Malaysia Responsible for cost and Budget & Planning function, manage quarterly budget; monthly close and management reporting activities, drive cost reduction. Finance Analyst - CPU Division Intel Corporation October 2000  –  May 2003  (2 years 8 months) Penang, Malaysia Responsible for cost and Budget & Planning function, manage quarterly budget; monthly close and management reporting activities, drive cost reduction. Budget & Planning, Cost and Inventory Analyst Intel Corporation August 1999  –  September 2000  (1 year 2 months) Penang, Malaysia Responsible for control of budgetary spending, drive cost reduction and drive lower inventory level. Budget & Planning, Cost and Inventory Analyst Intel Corporation August 1999  –  September 2000  (1 year 2 months) Penang, Malaysia Responsible for control of budgetary spending, drive cost reduction and drive lower inventory level. Languages English Full professional proficiency Mandarin Full professional proficiency Malay Professional working proficiency Japanese Elementary proficiency Tamil Elementary proficiency English Full professional proficiency Mandarin Full professional proficiency Malay Professional working proficiency Japanese Elementary proficiency Tamil Elementary proficiency English Full professional proficiency Mandarin Full professional proficiency Malay Professional working proficiency Japanese Elementary proficiency Tamil Elementary proficiency Full professional proficiency Full professional proficiency Professional working proficiency Elementary proficiency Elementary proficiency Skills Process Improvement Financial Analysis Business Analysis Financial Modeling Financial Reporting Outsourcing Business Process... Cross-functional Team... Finance Forecasting Variance Analysis Budgets Service Delivery Managerial Finance ERP Strategy Procurement Management Program Management See 4+     See less Skills  Process Improvement Financial Analysis Business Analysis Financial Modeling Financial Reporting Outsourcing Business Process... Cross-functional Team... Finance Forecasting Variance Analysis Budgets Service Delivery Managerial Finance ERP Strategy Procurement Management Program Management See 4+     See less Process Improvement Financial Analysis Business Analysis Financial Modeling Financial Reporting Outsourcing Business Process... Cross-functional Team... Finance Forecasting Variance Analysis Budgets Service Delivery Managerial Finance ERP Strategy Procurement Management Program Management See 4+     See less Process Improvement Financial Analysis Business Analysis Financial Modeling Financial Reporting Outsourcing Business Process... Cross-functional Team... Finance Forecasting Variance Analysis Budgets Service Delivery Managerial Finance ERP Strategy Procurement Management Program Management See 4+     See less Education Universiti Sains Malaysia Bachelor's Degree,  Business Administration and Management ,  Major: Accounting Universiti Sains Malaysia Master of Business Administration (M.B.A.) University of Pennsylvania - The Wharton School Dale Carnegie Universiti Sains Malaysia Bachelor's Degree,  Business Administration and Management ,  Major: Accounting Universiti Sains Malaysia Bachelor's Degree,  Business Administration and Management ,  Major: Accounting Universiti Sains Malaysia Bachelor's Degree,  Business Administration and Management ,  Major: Accounting Universiti Sains Malaysia Master of Business Administration (M.B.A.) Universiti Sains Malaysia Master of Business Administration (M.B.A.) Universiti Sains Malaysia Master of Business Administration (M.B.A.) University of Pennsylvania - The Wharton School University of Pennsylvania - The Wharton School University of Pennsylvania - The Wharton School Dale Carnegie Dale Carnegie Dale Carnegie "]}