{"position": "Business Process Designer", "company": "Google", "profiles": ["Experience Manager, Business Process Design Laureate Education April 2012  – Present (3 years 5 months) Baltimore, Maryland Area Manager, Business Process Design Laureate Education April 2012  – Present (3 years 5 months) Baltimore, Maryland Area Manager, Business Process Design Laureate Education April 2012  – Present (3 years 5 months) Baltimore, Maryland Area Skills Skills     Education University of Maryland College Park Bachelor of Arts (BA) 1997  – 2001 University of Maryland College Park Bachelor of Arts (BA) 1997  – 2001 University of Maryland College Park Bachelor of Arts (BA) 1997  – 2001 University of Maryland College Park Bachelor of Arts (BA) 1997  – 2001 ", "Summary Acquisition integration, process standardization, and large systems implementations, including ERP, engineering/PLM, and warehouse management systems (WMS). \n \nSpecialties: acquisition integration, ERP implementations, business process standardization Summary Acquisition integration, process standardization, and large systems implementations, including ERP, engineering/PLM, and warehouse management systems (WMS). \n \nSpecialties: acquisition integration, ERP implementations, business process standardization Acquisition integration, process standardization, and large systems implementations, including ERP, engineering/PLM, and warehouse management systems (WMS). \n \nSpecialties: acquisition integration, ERP implementations, business process standardization Acquisition integration, process standardization, and large systems implementations, including ERP, engineering/PLM, and warehouse management systems (WMS). \n \nSpecialties: acquisition integration, ERP implementations, business process standardization Experience IT Director - Business Systems Integration Lead Eaton February 2013  – Present (2 years 7 months) Manage portfolios of business system integration projects that drive sales, manufacturing, procurement, and logistics synergies related to Eaton's acquisition of Cooper Industries. Director, Global Order Management, ERP, & Supply-Chain IT Eaton Corporation August 2009  –  January 2013  (3 years 6 months) Responsible for directing order management, ERP consolidation, manufacturing programs alignment, and business process standardization programs globally across the Electrical Sector. Senior Manager, Business Process Design & Supply-Chain IT Eaton November 2006  –  July 2009  (2 years 9 months) Responsible for the business and IT program management for the ERP and supply-chain standardization effort at Eaton's electrical group. IT Program Manager - Enterprise Common Platform Eaton February 2006  –  October 2006  (9 months) Managed a portfolio of ERP and standard process implementation projects as part of the Enterprise Common Platform (ECP) utilizing Oracle. Responsible for refining and maintaining the program’s strategic roadmap, including continued development in organization, infrastructure, and implementation project methodology. Implementation Manager Siemens Energy & Automation January 2005  –  January 2006  (1 year 1 month) Managed the implementation of supply-chain process standardization and SAP for the Power Conversion Division. Business implementation scope spanned the Materials Management, Manufacturing, Sales and Distribution, Project Systems, and Service Business processes. Service Business Team Lead - SAP Siemens Energy & Automation May 2004  –  December 2004  (8 months) Manager for the Service Business team responsible for process standardization and implementation of the SAP Customer Service (CS) module across all Service Business units. IT Lead - Service Business - SAP Siemens Energy & Automation October 2002  –  April 2004  (1 year 7 months) Responsible for requirements gathering, process definition, and SAP customizing for Service Business processes, including field service, product repair, and product refurbishment. IT Planning Manager Siemens Energy & Automation, Inc. June 2002  –  September 2002  (4 months) Responsible for IT project and budget planning, business case development, and system portfolio management for Corporate departments and the Industrial Services Division. IT Planner Siemens Energy & Automation December 2000  –  May 2002  (1 year 6 months) Responsible for project planning, budget estimates, system enhancement planning and analysis, and business case development. Responsible for handover of projects to development teams. Project Leader - Customer Request System Siemens Energy & Automation June 1999  –  November 2000  (1 year 6 months) Responsible for the integrity of the Customer Request System (CRS), including the production and development environments for Remedy ARS 4.0.3, Seagate Info, Telamon, and integrated knowledge base. Responsible for the hiring and management of the CRS Infrastructure Team. Supervisor - Technical Education Center Siemens Energy & Automation January 1998  –  May 1999  (1 year 5 months) Senior Writer - Technical Education Center Siemens Energy & Automation June 1997  –  December 1997  (7 months) Implemented documentation development methodology and standards. Created and documented templates and formatting macros to support documentation standards. Wrote end-user manuals. Project Leader , Documentation Development Eaton Cutler-Hammer January 1997  –  May 1997  (5 months) Supervised four writers and trainers who provided training and documentation for internal systems. Automated documentation and training tasks using Visual Basic for Applications. Documentation Specialist Technical Data Services December 1994  –  December 1996  (2 years 1 month) Responsible for creating and maintaining printed and online end-user documentation. IT Director - Business Systems Integration Lead Eaton February 2013  – Present (2 years 7 months) Manage portfolios of business system integration projects that drive sales, manufacturing, procurement, and logistics synergies related to Eaton's acquisition of Cooper Industries. IT Director - Business Systems Integration Lead Eaton February 2013  – Present (2 years 7 months) Manage portfolios of business system integration projects that drive sales, manufacturing, procurement, and logistics synergies related to Eaton's acquisition of Cooper Industries. Director, Global Order Management, ERP, & Supply-Chain IT Eaton Corporation August 2009  –  January 2013  (3 years 6 months) Responsible for directing order management, ERP consolidation, manufacturing programs alignment, and business process standardization programs globally across the Electrical Sector. Director, Global Order Management, ERP, & Supply-Chain IT Eaton Corporation August 2009  –  January 2013  (3 years 6 months) Responsible for directing order management, ERP consolidation, manufacturing programs alignment, and business process standardization programs globally across the Electrical Sector. Senior Manager, Business Process Design & Supply-Chain IT Eaton November 2006  –  July 2009  (2 years 9 months) Responsible for the business and IT program management for the ERP and supply-chain standardization effort at Eaton's electrical group. Senior Manager, Business Process Design & Supply-Chain IT Eaton November 2006  –  July 2009  (2 years 9 months) Responsible for the business and IT program management for the ERP and supply-chain standardization effort at Eaton's electrical group. IT Program Manager - Enterprise Common Platform Eaton February 2006  –  October 2006  (9 months) Managed a portfolio of ERP and standard process implementation projects as part of the Enterprise Common Platform (ECP) utilizing Oracle. Responsible for refining and maintaining the program’s strategic roadmap, including continued development in organization, infrastructure, and implementation project methodology. IT Program Manager - Enterprise Common Platform Eaton February 2006  –  October 2006  (9 months) Managed a portfolio of ERP and standard process implementation projects as part of the Enterprise Common Platform (ECP) utilizing Oracle. Responsible for refining and maintaining the program’s strategic roadmap, including continued development in organization, infrastructure, and implementation project methodology. Implementation Manager Siemens Energy & Automation January 2005  –  January 2006  (1 year 1 month) Managed the implementation of supply-chain process standardization and SAP for the Power Conversion Division. Business implementation scope spanned the Materials Management, Manufacturing, Sales and Distribution, Project Systems, and Service Business processes. Implementation Manager Siemens Energy & Automation January 2005  –  January 2006  (1 year 1 month) Managed the implementation of supply-chain process standardization and SAP for the Power Conversion Division. Business implementation scope spanned the Materials Management, Manufacturing, Sales and Distribution, Project Systems, and Service Business processes. Service Business Team Lead - SAP Siemens Energy & Automation May 2004  –  December 2004  (8 months) Manager for the Service Business team responsible for process standardization and implementation of the SAP Customer Service (CS) module across all Service Business units. Service Business Team Lead - SAP Siemens Energy & Automation May 2004  –  December 2004  (8 months) Manager for the Service Business team responsible for process standardization and implementation of the SAP Customer Service (CS) module across all Service Business units. IT Lead - Service Business - SAP Siemens Energy & Automation October 2002  –  April 2004  (1 year 7 months) Responsible for requirements gathering, process definition, and SAP customizing for Service Business processes, including field service, product repair, and product refurbishment. IT Lead - Service Business - SAP Siemens Energy & Automation October 2002  –  April 2004  (1 year 7 months) Responsible for requirements gathering, process definition, and SAP customizing for Service Business processes, including field service, product repair, and product refurbishment. IT Planning Manager Siemens Energy & Automation, Inc. June 2002  –  September 2002  (4 months) Responsible for IT project and budget planning, business case development, and system portfolio management for Corporate departments and the Industrial Services Division. IT Planning Manager Siemens Energy & Automation, Inc. June 2002  –  September 2002  (4 months) Responsible for IT project and budget planning, business case development, and system portfolio management for Corporate departments and the Industrial Services Division. IT Planner Siemens Energy & Automation December 2000  –  May 2002  (1 year 6 months) Responsible for project planning, budget estimates, system enhancement planning and analysis, and business case development. Responsible for handover of projects to development teams. IT Planner Siemens Energy & Automation December 2000  –  May 2002  (1 year 6 months) Responsible for project planning, budget estimates, system enhancement planning and analysis, and business case development. Responsible for handover of projects to development teams. Project Leader - Customer Request System Siemens Energy & Automation June 1999  –  November 2000  (1 year 6 months) Responsible for the integrity of the Customer Request System (CRS), including the production and development environments for Remedy ARS 4.0.3, Seagate Info, Telamon, and integrated knowledge base. Responsible for the hiring and management of the CRS Infrastructure Team. Project Leader - Customer Request System Siemens Energy & Automation June 1999  –  November 2000  (1 year 6 months) Responsible for the integrity of the Customer Request System (CRS), including the production and development environments for Remedy ARS 4.0.3, Seagate Info, Telamon, and integrated knowledge base. Responsible for the hiring and management of the CRS Infrastructure Team. Supervisor - Technical Education Center Siemens Energy & Automation January 1998  –  May 1999  (1 year 5 months) Supervisor - Technical Education Center Siemens Energy & Automation January 1998  –  May 1999  (1 year 5 months) Senior Writer - Technical Education Center Siemens Energy & Automation June 1997  –  December 1997  (7 months) Implemented documentation development methodology and standards. Created and documented templates and formatting macros to support documentation standards. Wrote end-user manuals. Senior Writer - Technical Education Center Siemens Energy & Automation June 1997  –  December 1997  (7 months) Implemented documentation development methodology and standards. Created and documented templates and formatting macros to support documentation standards. Wrote end-user manuals. Project Leader , Documentation Development Eaton Cutler-Hammer January 1997  –  May 1997  (5 months) Supervised four writers and trainers who provided training and documentation for internal systems. Automated documentation and training tasks using Visual Basic for Applications. Project Leader , Documentation Development Eaton Cutler-Hammer January 1997  –  May 1997  (5 months) Supervised four writers and trainers who provided training and documentation for internal systems. Automated documentation and training tasks using Visual Basic for Applications. Documentation Specialist Technical Data Services December 1994  –  December 1996  (2 years 1 month) Responsible for creating and maintaining printed and online end-user documentation. Documentation Specialist Technical Data Services December 1994  –  December 1996  (2 years 1 month) Responsible for creating and maintaining printed and online end-user documentation. Skills ERP Process Improvement Program Management Integration IT Management Change Management Cross-functional Team... Business Analysis IT Strategy SAP Oracle E-Business Suite Project Management Requirements Analysis Software Documentation Business Process... Lean Manufacturing Six Sigma Vendor Management Manufacturing Team Building Requirements Gathering Materials Management Management Project Planning ERP Oracle SAP ERP Supply Chain Analysis Business Process Enterprise Software Budgets Oracle MRP Business Intelligence PMO Visio Supply Chain Management Continuous Improvement ITIL MS Project Project Portfolio... Information Technology Leadership Testing See 29+     See less Skills  ERP Process Improvement Program Management Integration IT Management Change Management Cross-functional Team... Business Analysis IT Strategy SAP Oracle E-Business Suite Project Management Requirements Analysis Software Documentation Business Process... Lean Manufacturing Six Sigma Vendor Management Manufacturing Team Building Requirements Gathering Materials Management Management Project Planning ERP Oracle SAP ERP Supply Chain Analysis Business Process Enterprise Software Budgets Oracle MRP Business Intelligence PMO Visio Supply Chain Management Continuous Improvement ITIL MS Project Project Portfolio... Information Technology Leadership Testing See 29+     See less ERP Process Improvement Program Management Integration IT Management Change Management Cross-functional Team... Business Analysis IT Strategy SAP Oracle E-Business Suite Project Management Requirements Analysis Software Documentation Business Process... Lean Manufacturing Six Sigma Vendor Management Manufacturing Team Building Requirements Gathering Materials Management Management Project Planning ERP Oracle SAP ERP Supply Chain Analysis Business Process Enterprise Software Budgets Oracle MRP Business Intelligence PMO Visio Supply Chain Management Continuous Improvement ITIL MS Project Project Portfolio... Information Technology Leadership Testing See 29+     See less ERP Process Improvement Program Management Integration IT Management Change Management Cross-functional Team... Business Analysis IT Strategy SAP Oracle E-Business Suite Project Management Requirements Analysis Software Documentation Business Process... Lean Manufacturing Six Sigma Vendor Management Manufacturing Team Building Requirements Gathering Materials Management Management Project Planning ERP Oracle SAP ERP Supply Chain Analysis Business Process Enterprise Software Budgets Oracle MRP Business Intelligence PMO Visio Supply Chain Management Continuous Improvement ITIL MS Project Project Portfolio... Information Technology Leadership Testing See 29+     See less ", "Experience Manager, Acquisition Integration Cisco Systems June 2010  – Present (5 years 3 months) Manager, Business Process Design Cisco Systems July 2008  –  July 2010  (2 years 1 month) Director of Operations, Software as a Service Centerbeam January 2005  –  June 2008  (3 years 6 months) Greenbelt Sun Microsystems June 2002  –  January 2005  (2 years 8 months) Manager, Acquisition Integration Cisco Systems June 2010  – Present (5 years 3 months) Manager, Acquisition Integration Cisco Systems June 2010  – Present (5 years 3 months) Manager, Business Process Design Cisco Systems July 2008  –  July 2010  (2 years 1 month) Manager, Business Process Design Cisco Systems July 2008  –  July 2010  (2 years 1 month) Director of Operations, Software as a Service Centerbeam January 2005  –  June 2008  (3 years 6 months) Director of Operations, Software as a Service Centerbeam January 2005  –  June 2008  (3 years 6 months) Greenbelt Sun Microsystems June 2002  –  January 2005  (2 years 8 months) Greenbelt Sun Microsystems June 2002  –  January 2005  (2 years 8 months) Skills Six Sigma Engineering Program Management Process Improvement Cloud Computing Data Center Product Management SaaS Project Management Change Management Cross-functional Team... Vendor Management Software Documentation Integration Process Simulation Outsourcing Security IT Service Management Troubleshooting ITIL Enterprise Software See 6+     See less Skills  Six Sigma Engineering Program Management Process Improvement Cloud Computing Data Center Product Management SaaS Project Management Change Management Cross-functional Team... Vendor Management Software Documentation Integration Process Simulation Outsourcing Security IT Service Management Troubleshooting ITIL Enterprise Software See 6+     See less Six Sigma Engineering Program Management Process Improvement Cloud Computing Data Center Product Management SaaS Project Management Change Management Cross-functional Team... Vendor Management Software Documentation Integration Process Simulation Outsourcing Security IT Service Management Troubleshooting ITIL Enterprise Software See 6+     See less Six Sigma Engineering Program Management Process Improvement Cloud Computing Data Center Product Management SaaS Project Management Change Management Cross-functional Team... Vendor Management Software Documentation Integration Process Simulation Outsourcing Security IT Service Management Troubleshooting ITIL Enterprise Software See 6+     See less Education California Polytechnic State University-San Luis Obispo BS California Polytechnic State University-San Luis Obispo MS California Polytechnic State University-San Luis Obispo BS California Polytechnic State University-San Luis Obispo BS California Polytechnic State University-San Luis Obispo BS California Polytechnic State University-San Luis Obispo MS California Polytechnic State University-San Luis Obispo MS California Polytechnic State University-San Luis Obispo MS ", "Languages English German English German English German Skills Supply Chain Management Supply Chain... Logistics Management Warehouse Management Container Terminals Supply Chain Logistics Change Management Operations Research Business Process SAP APO Warehousing SAP R/3 Leadership Demand Planning Integration Project Management SAP ERP Business Process... SAP Management See 6+     See less Skills  Supply Chain Management Supply Chain... Logistics Management Warehouse Management Container Terminals Supply Chain Logistics Change Management Operations Research Business Process SAP APO Warehousing SAP R/3 Leadership Demand Planning Integration Project Management SAP ERP Business Process... SAP Management See 6+     See less Supply Chain Management Supply Chain... Logistics Management Warehouse Management Container Terminals Supply Chain Logistics Change Management Operations Research Business Process SAP APO Warehousing SAP R/3 Leadership Demand Planning Integration Project Management SAP ERP Business Process... SAP Management See 6+     See less Supply Chain Management Supply Chain... Logistics Management Warehouse Management Container Terminals Supply Chain Logistics Change Management Operations Research Business Process SAP APO Warehousing SAP R/3 Leadership Demand Planning Integration Project Management SAP ERP Business Process... SAP Management See 6+     See less ", "Languages Italian Professional working proficiency French Limited working proficiency Italian Professional working proficiency French Limited working proficiency Italian Professional working proficiency French Limited working proficiency Professional working proficiency Limited working proficiency Skills Writing Copy Editing Web Design Project management... Event Management Leadership & Mentoring Strategy Copywriting Marketing Communications Strategic Planning Management Budgets Team Leadership Press Releases Internal Communications Corporate Communications Public Relations Business Analysis Insurance See 4+     See less Skills  Writing Copy Editing Web Design Project management... Event Management Leadership & Mentoring Strategy Copywriting Marketing Communications Strategic Planning Management Budgets Team Leadership Press Releases Internal Communications Corporate Communications Public Relations Business Analysis Insurance See 4+     See less Writing Copy Editing Web Design Project management... Event Management Leadership & Mentoring Strategy Copywriting Marketing Communications Strategic Planning Management Budgets Team Leadership Press Releases Internal Communications Corporate Communications Public Relations Business Analysis Insurance See 4+     See less Writing Copy Editing Web Design Project management... Event Management Leadership & Mentoring Strategy Copywriting Marketing Communications Strategic Planning Management Budgets Team Leadership Press Releases Internal Communications Corporate Communications Public Relations Business Analysis Insurance See 4+     See less ", "Languages Korean Elementary proficiency Korean Elementary proficiency Korean Elementary proficiency Elementary proficiency Skills Financial Modeling Research Contract Negotiation Project Management Marketing Financial Analysis Due Diligence Mergers Business Process Design Mergers & Acquisitions Management Consulting Team Building Management Leadership Strategy CRM Outsourcing Enterprise Software Finance Business Analysis Portfolio Management See 6+     See less Skills  Financial Modeling Research Contract Negotiation Project Management Marketing Financial Analysis Due Diligence Mergers Business Process Design Mergers & Acquisitions Management Consulting Team Building Management Leadership Strategy CRM Outsourcing Enterprise Software Finance Business Analysis Portfolio Management See 6+     See less Financial Modeling Research Contract Negotiation Project Management Marketing Financial Analysis Due Diligence Mergers Business Process Design Mergers & Acquisitions Management Consulting Team Building Management Leadership Strategy CRM Outsourcing Enterprise Software Finance Business Analysis Portfolio Management See 6+     See less Financial Modeling Research Contract Negotiation Project Management Marketing Financial Analysis Due Diligence Mergers Business Process Design Mergers & Acquisitions Management Consulting Team Building Management Leadership Strategy CRM Outsourcing Enterprise Software Finance Business Analysis Portfolio Management See 6+     See less ", "Summary In-depth experience in both operational and strategic change initiatives. Proven track record in consulting, change management, project management, performance improvement, revenue growth and relationship management. Industry experience includes financial services, credit cards, insurance, energy, healthcare and mass public transportation. Ability to work in North America and Europe. Summary In-depth experience in both operational and strategic change initiatives. Proven track record in consulting, change management, project management, performance improvement, revenue growth and relationship management. Industry experience includes financial services, credit cards, insurance, energy, healthcare and mass public transportation. Ability to work in North America and Europe. In-depth experience in both operational and strategic change initiatives. Proven track record in consulting, change management, project management, performance improvement, revenue growth and relationship management. Industry experience includes financial services, credit cards, insurance, energy, healthcare and mass public transportation. Ability to work in North America and Europe. In-depth experience in both operational and strategic change initiatives. Proven track record in consulting, change management, project management, performance improvement, revenue growth and relationship management. Industry experience includes financial services, credit cards, insurance, energy, healthcare and mass public transportation. Ability to work in North America and Europe. Experience Senior Manager, Process Design and Implementation BMO Financial Group June 2013  – Present (2 years 3 months) Toronto Senior Manager, Process Design and Implementation BMO Financial Group June 2013  – Present (2 years 3 months) Toronto Senior Manager, Process Design and Implementation BMO Financial Group June 2013  – Present (2 years 3 months) Toronto Languages English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Business Strategy Business Process... Change Management Business Development Performance Management Relationship Management Project Management Leadership Management Risk Management Skills  Business Strategy Business Process... Change Management Business Development Performance Management Relationship Management Project Management Leadership Management Risk Management Business Strategy Business Process... Change Management Business Development Performance Management Relationship Management Project Management Leadership Management Risk Management Business Strategy Business Process... Change Management Business Development Performance Management Relationship Management Project Management Leadership Management Risk Management Education Centre International d’Etudes Pédagogiques (CIEP) - France Diplôme d'études en langue française (DELF),  Diploma in French language for non-native speakers 2010  – 2010 HEC School of Management MBA,  Paris, France 2006  – 2006 The University of Western Ontario - Richard Ivey School of Business MBA 2004  – 2005 University of Toronto Hon. Bachelor of Science,  Biology , Environmental Studies 1994  – 1998 Trinity College Activities and Societies:  Environmental Students Union (ENSU) - secretary Centre International d’Etudes Pédagogiques (CIEP) - France Diplôme d'études en langue française (DELF),  Diploma in French language for non-native speakers 2010  – 2010 Centre International d’Etudes Pédagogiques (CIEP) - France Diplôme d'études en langue française (DELF),  Diploma in French language for non-native speakers 2010  – 2010 Centre International d’Etudes Pédagogiques (CIEP) - France Diplôme d'études en langue française (DELF),  Diploma in French language for non-native speakers 2010  – 2010 HEC School of Management MBA,  Paris, France 2006  – 2006 HEC School of Management MBA,  Paris, France 2006  – 2006 HEC School of Management MBA,  Paris, France 2006  – 2006 The University of Western Ontario - Richard Ivey School of Business MBA 2004  – 2005 The University of Western Ontario - Richard Ivey School of Business MBA 2004  – 2005 The University of Western Ontario - Richard Ivey School of Business MBA 2004  – 2005 University of Toronto Hon. Bachelor of Science,  Biology , Environmental Studies 1994  – 1998 Trinity College Activities and Societies:  Environmental Students Union (ENSU) - secretary University of Toronto Hon. Bachelor of Science,  Biology , Environmental Studies 1994  – 1998 Trinity College Activities and Societies:  Environmental Students Union (ENSU) - secretary University of Toronto Hon. Bachelor of Science,  Biology , Environmental Studies 1994  – 1998 Trinity College Activities and Societies:  Environmental Students Union (ENSU) - secretary ", "Experience Manager, Business Process Design and Improvement, Shared Services Government of Alberta August 2013  – Present (2 years 1 month) Responsible for identifying broad and strategically significant business process improvement and reengineering opportunities, both system and workflow, and subsequently developing and managing reengineering or improvement project work plans, leading project teams and implementing multifaceted process changes that have division, department, and potentially GoA-wide reach. \n \nResponsible for establishing positive working relationships with executive leadership within the GoA, including diverse internal and external stakeholders to produce and deliver the best possible solution to meet the client’s needs, and building a culture of continuous improvement. Executive Assistant to the ADM Service Alberta, Business Services July 2011  –  August 2013  (2 years 2 months) Responsible for providing strategic management and advice to the Assistant Deputy Minister (ADM) in the ongoing operational management of the division, as well as managing the daily operations of the ADM’s office.  \nCoordinated major initiatives and projects, delegating responsibilities and project components to senior division staff.  \nContributed to policy development and review Manager, Business Process Design and Improvement, Shared Services Government of Alberta August 2013  – Present (2 years 1 month) Responsible for identifying broad and strategically significant business process improvement and reengineering opportunities, both system and workflow, and subsequently developing and managing reengineering or improvement project work plans, leading project teams and implementing multifaceted process changes that have division, department, and potentially GoA-wide reach. \n \nResponsible for establishing positive working relationships with executive leadership within the GoA, including diverse internal and external stakeholders to produce and deliver the best possible solution to meet the client’s needs, and building a culture of continuous improvement. Manager, Business Process Design and Improvement, Shared Services Government of Alberta August 2013  – Present (2 years 1 month) Responsible for identifying broad and strategically significant business process improvement and reengineering opportunities, both system and workflow, and subsequently developing and managing reengineering or improvement project work plans, leading project teams and implementing multifaceted process changes that have division, department, and potentially GoA-wide reach. \n \nResponsible for establishing positive working relationships with executive leadership within the GoA, including diverse internal and external stakeholders to produce and deliver the best possible solution to meet the client’s needs, and building a culture of continuous improvement. Executive Assistant to the ADM Service Alberta, Business Services July 2011  –  August 2013  (2 years 2 months) Responsible for providing strategic management and advice to the Assistant Deputy Minister (ADM) in the ongoing operational management of the division, as well as managing the daily operations of the ADM’s office.  \nCoordinated major initiatives and projects, delegating responsibilities and project components to senior division staff.  \nContributed to policy development and review Executive Assistant to the ADM Service Alberta, Business Services July 2011  –  August 2013  (2 years 2 months) Responsible for providing strategic management and advice to the Assistant Deputy Minister (ADM) in the ongoing operational management of the division, as well as managing the daily operations of the ADM’s office.  \nCoordinated major initiatives and projects, delegating responsibilities and project components to senior division staff.  \nContributed to policy development and review Skills Management Business Process... Leadership Operations Management Policy Government Program Management Strategic Planning Skills  Management Business Process... Leadership Operations Management Policy Government Program Management Strategic Planning Management Business Process... Leadership Operations Management Policy Government Program Management Strategic Planning Management Business Process... Leadership Operations Management Policy Government Program Management Strategic Planning Education Concordia University College of Alberta Bachelor of Arts (BA),  Sociology MacEwan University Diploma,  Investigative Studies Concordia University College of Alberta Bachelor of Arts (BA),  Sociology Concordia University College of Alberta Bachelor of Arts (BA),  Sociology Concordia University College of Alberta Bachelor of Arts (BA),  Sociology MacEwan University Diploma,  Investigative Studies MacEwan University Diploma,  Investigative Studies MacEwan University Diploma,  Investigative Studies ", "Summary Experienced professional supporting business solutions by understanding and communicating requirements in the context of the businss process, including: procurement, managing customer data, logistics, global supply chain, member servcies for insurance,or creating a better user experience. \n \nHaving worked in many organizations across numerous industries, I rely on a diverse set of tools and knowledge to adress the problem at hand. I have experience facilitating conversations with stakeholders and users as well as leading sessions to identify gaps, risks, issues and opportunities to support project delivery. More important, as an analyst, I understand the significance of listening, which is the key to ensure the client’s needs are well understand and well documented. \n \nI consider the client’s need as first and foremost and the team as a cohesive unit is the catalyst to make things happen. I am looking for challenging opportunities to add value to a high performance team with a hands-on approach to solving real business problems. \n \nSpecialties: Business Analysis, Process Analysis, Process Modeling, Project Coordination, Facilitation, Master Data Summary Experienced professional supporting business solutions by understanding and communicating requirements in the context of the businss process, including: procurement, managing customer data, logistics, global supply chain, member servcies for insurance,or creating a better user experience. \n \nHaving worked in many organizations across numerous industries, I rely on a diverse set of tools and knowledge to adress the problem at hand. I have experience facilitating conversations with stakeholders and users as well as leading sessions to identify gaps, risks, issues and opportunities to support project delivery. More important, as an analyst, I understand the significance of listening, which is the key to ensure the client’s needs are well understand and well documented. \n \nI consider the client’s need as first and foremost and the team as a cohesive unit is the catalyst to make things happen. I am looking for challenging opportunities to add value to a high performance team with a hands-on approach to solving real business problems. \n \nSpecialties: Business Analysis, Process Analysis, Process Modeling, Project Coordination, Facilitation, Master Data Experienced professional supporting business solutions by understanding and communicating requirements in the context of the businss process, including: procurement, managing customer data, logistics, global supply chain, member servcies for insurance,or creating a better user experience. \n \nHaving worked in many organizations across numerous industries, I rely on a diverse set of tools and knowledge to adress the problem at hand. I have experience facilitating conversations with stakeholders and users as well as leading sessions to identify gaps, risks, issues and opportunities to support project delivery. More important, as an analyst, I understand the significance of listening, which is the key to ensure the client’s needs are well understand and well documented. \n \nI consider the client’s need as first and foremost and the team as a cohesive unit is the catalyst to make things happen. I am looking for challenging opportunities to add value to a high performance team with a hands-on approach to solving real business problems. \n \nSpecialties: Business Analysis, Process Analysis, Process Modeling, Project Coordination, Facilitation, Master Data Experienced professional supporting business solutions by understanding and communicating requirements in the context of the businss process, including: procurement, managing customer data, logistics, global supply chain, member servcies for insurance,or creating a better user experience. \n \nHaving worked in many organizations across numerous industries, I rely on a diverse set of tools and knowledge to adress the problem at hand. I have experience facilitating conversations with stakeholders and users as well as leading sessions to identify gaps, risks, issues and opportunities to support project delivery. More important, as an analyst, I understand the significance of listening, which is the key to ensure the client’s needs are well understand and well documented. \n \nI consider the client’s need as first and foremost and the team as a cohesive unit is the catalyst to make things happen. I am looking for challenging opportunities to add value to a high performance team with a hands-on approach to solving real business problems. \n \nSpecialties: Business Analysis, Process Analysis, Process Modeling, Project Coordination, Facilitation, Master Data Experience Manager Business Process Design CME Group December 2013  – Present (1 year 9 months) Greater Chicago Area Participates in the development of strategic plans, systems design and tracks information systems and business system development and deployment on a global basis. Works with functional area management to establish systems and processes that have a direct impact on business' competitive capabilities. Responsibilities include managing and supporting all customer experience process automation projects , insuring the availability, responsiveness, and effective utilization of the Development resources. Responsible as an Enterprise BPM Team Member and manager to develop and implement systems strategies and technology that meet the support and operations business requirements. Principle Consultant Infinite Minds Consulting LLC January 2007  – Present (8 years 8 months) Chicagoland Consultant CME Group March 2013  –  December 2013  (10 months) Greater Chicago Area Opportunity  \n• Ability to compose and maintain compelling business cases and project charters for the business stakeholders that identifies all the major components of the BPM program including the vision roadmap, financial economics and related benefits \n \nAnalysis  \n• The ability to deliver process discovery for sufficient understanding of the current state baseline. This deliverable may contain or be the result of the following: process flows & narratives, interviews and facilitation, common process structures, policies & procedures, applications & integrations, key performance indicators, baseline walkthrough. \n• The ability to extend the baseline discovery and incorporate the appropriate perspective that will result in the business analysis deliverable that may contain or be the result of the following: comparable benchmarking, baseline measurements, gap analysis, qualitative & quantitative metrics, costing model, business requirements, conclusion / recommendation, possible solutions and future state. \n \nPrototype & Design \n• Present future state concepts through story boards, flow charting, existing in-house functional models and/or build functional examples within Appian for client use to drive the business needs to a technical requirement sufficient for BPM development. \n• Perform step by step walkthroughs for proposed solutions to ensure solution expectations are set. \n• Obtain final sign-off from the business stakeholders prior to any BPM development. \n• Drive and flush out the technical requirements with the required parties for development execution. \n• Work closely with the development and testing teams to ensure a high quality process deliverable. \n \nDeploy & Monitor \n• Drive and institute the necessary activities for both the initial and continuous process deployments within the assigned business area that includes change management, user education & training, solution migration, and the 3 tier support model. Business Analyst - Tek Systems Hallmark Services Corporation October 2012  –  February 2013  (5 months) naperville, il •\tElicit requirements by developing user stories, interviews, document analysis, storyboards/strawman, business process descriptions, business rules, wireframes, business and data analysis, task and workflow analysis, and/or stakeholder viewpoints. Facilitate user focus sessions with key business team members.  \n•\tCritically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and identifying the underlying needs/requirements driving user requests.  \n•\tExperience supporting member services related to the public exchange implementation for the Healthcare for America Plan(Obamacare) \n•\tCommunicate understanding of processes while looking at the impact of the stories across functional areas and to help the team focus on what is important and to ensure dependencies were identified  \n•\tAct as a liaison between Product Owners and project teams, and evaluate request coming from business units/product management to determine true business need and potential solutions \n•\tReview test plans with testing group to ensure business requirements properly evaluated and reflected in the testing process. Involved with all phases of development (analysis, design, coding, testing, and deployment).  \n•\tCreate and maintain relationships between business objectives, requirements, and solution components by identifying and documenting the lineage of each requirement including backward/forward traceability. Consultant CME Group 2013  –  2013  (less than a year) Lead Business Analyst (BPMN) - Analyst INTL Analyst International Contracted to Navistar September 2010  –  October 2012  (2 years 2 months) Greater Chicago Area •\tResponsible for developing and maintaining formal BPMN based process documentation including, process models, business requirements traceability matrixes, and use case documentation  \n•\tCreated BPMN compliant models of current and proposed solutions for Order to Cash, including e-Quote, E- Business Suite, PeopleSoft Contracts and Approvals; Supply Chain including 3PL, Shipping & Receiving, Manufacturing (Baan) Supplier Quality Management, Supplier Based Tooling processes  \n•\tFacilitate and engaged in interviews and working sessions with stakeholders, users, customers, vendors and suppliers to understand information, technology, data, and work flows to understand requirements and provide recommendations to the management to drive process improvement \n•\tLead analyst teams in the abstraction of existing and future state business processes into logical models to identify the strengths and weaknesses of alternative solutions \n•\tIdentified gaps in critical business processes affecting shipping, distribution and receiving parts at the plant, leading to inaccurate on hand inventory and causing delays in production. Participated in developing process changes to reduce variability and improve the ability to track deliveries and reduce expedites of duplicate orders.  \n•\tDemonstrate an in-depth knowledge of process management concepts across a wide variety of methodologies - demonstrating the ability to assess the situational appropriates of tool use across methodologies \n•\tProven ability to elicit clarity and direction in ambiguous or budding project environments with business partners who may have little to no exposure to formal process management or optimization practices \n•\tCollaborated with business analyst, enterprise architects and management to develop project strategy for process automation using Oracle BPM Suite and developed strategy for managing the lifecycle of static and executable models in Oracle Enterprise Repository created in Visio, Sparx EA or Oracle jDeveloper Senior IT Business Data Quality Analyst - Sogeti Corp Constellation Energy July 2010  –  September 2010  (3 months) Baltimore, Maryland Area Proficiency with Business Process Analysis and Documentation involving Contracts, Billing, Warranties, Accounts Receivables, Customer Relationship Management \nAbility to analyze data flows and create data flow diagrams \nAssist with presentation development \nData Quality & Reconciliation Analysis \nWork closely with client and other analysts to gather requirements and propose alternative solutions Siperian Business Analyst - Icon Consulting Corp Waste Management, Inc. January 2010  –  July 2010  (7 months) Houston, Texas Area Under minimal supervision, facilitate the business analysis process to identify business requirements for system solutions or improved processes that will increase efficiency and overall productivity through Master Data Management and Data Governance. Work cohesively with developers, business units, and other test team members. Responsible for the creation, coordination, and execution of test plans in a lead testing role for various types of projects. Lead Business Systems Analyst – MDM- Axelon Corp Pfizer July 2007  –  December 2009  (2 years 6 months) New London/Norwich, Connecticut Area •\tSupported the successful delivery of several large complex Enterprise Master Data initiatives for a multibillion pharmaceutical company. The Solution used Siperian MRM Hub to cleanse, standardize and de-duplicate records interfacing with PeopleSoft, Oracle Financials, Siebel and MSCRM. \n \n•\tCollaborated with users, IT and data analyst to document source and target application data structures \n \n•\tDocumented business objectives, business rules, functional and nonfunctional requirements, business process models with rich text descriptions, data flows and use cases \n \n•\tProfiled data using Trillium, executed data queries and performed research to identify opportunities to improve data quality  \n \n•\tEngaged stakeholders, business subject matter experts in Customer Master Data Governance and Rules Management to establish guidelines, standards and policies to support improved data quality \n \n•\tDesigned and developed a requirements tracking and issues management tool for the Business Analyst community to improve team efficiency and improve requirements traceability throughout the SDLC \n \n•\tTook ownership in documenting business solution design process, finding gaps in existing process, arranging training modules for new process development and implementation. \n \n•\tWorked with QA team to provide input to test plans and test cases for User Acceptance Testing (UAT). \n \nDocumented business rules, business requirements, functional and nonfunctional requirements, cleansing and standardization rules and guidelines, business process models, data flows, use case models, activity diagrams, and data definitions \n \n•\tSolid business, communication, and presentation skills. Adept at creating, editing, and coordinating communication protocols (facilitation of Joint Application Development(JAD) sessions and interviews, workshops, written correspondence, reports, project status reports, oral presentations, e-mails, etc.) Pricing Analyst Hitachi Data Systems January 2006  –  March 2007  (1 year 3 months) Greater Chicago Area •\tManaged profitability of highly competitive bidding opportunities for high dollar value storage solutions. \n \n•\tAnalyzed margins by segment and/or product category including product mix, pricing arrangements or contract terms, customer life cycle, etc. \n \n•\tNegotiated pricing for strategic opportunities and worked closely with sales team and Channel partners to develop competitive strategies for customers in the North America Region.  \n•\tIdentified gaps in dealer support operations. Recommended improvements to increase analyst efficiency and productivity \n \n•\tDeveloped pricing options to meet competitive opportunities and provide input for profitability projections and corporate pricing strategy  \n \n•\tDeveloped and employed improvements in price discounting tools to increase consistency in sales discounting and reduce defects which cause inaccurate quotes  \n•\tEmployed cost-benefit analysis to review financial requests, assess program tradeoffs, and explore alternative funding methods. \n \n•\tAnalyzed supplier rebates for margin improvement  \nopportunities and interacted with field, suppliers, category managers, customers to implement. \n \n•\tAnalyzed complex RFQ’s with Account Owners to ensure margin protection and ability to comply upon contract award. This would include compilation and manipulation of historical data. Process Architect ALLSTATE INSURANCE March 2005  –  March 2006  (1 year 1 month) Greater Chicago Area •\tDeveloped process Architecture for business processes critical to core organizational functions to support CMM adoption. \n \n•\tServed as a liaison to numerous organizations to develop policies and procedures to facilitate the implementation of new process modules and or enhancements.  \n \n•\tLed Business Process Management (BPM) proof of concept to integrate XML messages from Corporate Modeling output to support the deployment of an automated workflow solution using an industry BPM engine.  \n \n•\tCollaborated with vendors, subject matter experts and consultants to document workflow solution requirements \n \n•\tKicked off process tools user group to collaborate on best practices for process development and to define organizational practices, standards and procedures. Provided demonstrations, coaching and training to support early adoption.  \n \n•\tFacilitated process discussions to manage the integration points across multiple process action teams while defining the organization’s standard software process.  \n \n•\tPerformed complex process analysis functions and recommended innovative solutions based on industry best practices to improve operational efficiencies and cost savings.  \n \n•\tPrepared business process related project documentation as per PMO defined artifacts for a large scale project (in line with CMM Methodology) \n \n•\tAnalyzed, researched, diagrammed business process flows, created detailed narrative instructions with reference material, computer screen captures, web links, computer system/application navigation, update procedures for inclusion in training manual \n \n•\tDocumented and published standard operating procedures, work instructions, templates and examples or related processes and methodologies \n \n•\tCoordinated workflow and trained process modelers in methods, procedures and standards for documenting local processes and procedures Senior Business Systems Analyst SEARS January 2004  –  March 2005  (1 year 3 months) Greater Chicago Area •\tComposed detailed and comprehensive requirement documentation to so support the integration and custom development of a large scale and complex JEE retail POS package using IBM Web Sphere MQ for communicating large volumes of transactional sales data to backend systems \n \n•\tDeveloped vision, scope, and use case documents; business process models, use case diagrams, activity diagrams, and state chart diagrams. \n \n•\tImplemented document inspection process to analyze artifacts for defects and provide coaching to business analyst to reduce errors in project deliverables resulting in improved analyst proficiency.  \n \n•\tFacilitated working sessions to develop RUP templates, improve productivity, share lessons learned and build team effectiveness.  \n \n•\tMentored and coached business systems analyst in Rational Methodology/tools leading to improved productivity and conformance to standards \n \n•\tParticipated regularly in Review meetings with Project Manager, Architect, Application System Engineers and Business Analyst  \n \n•\tUtilized UML for Use Case creation, workflow design, diagramming techniques, i.e. block sequence, physical, interaction and system diagrams. \n \n•\tIdentified design issues related to GUI usability, workflow, GUI scalability, performance etc Senior Pricing Analyst LUCENT TECHNOLOGIES January 2001  –  January 2003  (2 years 1 month) Greater Chicago Area •\tManaged pricing strategy for European, Middle Eastern and African regions valued at over $300 million in annual sales revenue. \n•\tNegotiated competitive pricing with business partners, customers and sales team. Resulted in purchase orders up to $15 million and 12% increase in margins. \n•\tEvaluated financial statements; conducted cost-benefit analysis of customer proposals, and pre-sale agreements that led to informed technology investment decisions. \n•\tInterfaced with multiple development organizations to assess and streamline daily operations. \n•\tInterfaced with supply chain management to secure volume discounts while negotiating margins with regional Business Architect LUCENT TECHNOLOGIES February 1997  –  January 2003  (6 years) Greater Chicago Area •\tManaged a 24 member Process Engineering Council, an organization of subject matter experts across the SDLC that resolved cross-functional issues, promoted continuous process improvement, knowledge transfer and sharing best practices. \n•\tAudited systems and processes to identify quality gaps. Restructured process development team strategy, which led to an annual expense reduction of $2 million  \n•\tLed projects supporting technology strategy, process management, systematic process action planning, improvement, and monitoring. Manager Business Process Design CME Group December 2013  – Present (1 year 9 months) Greater Chicago Area Participates in the development of strategic plans, systems design and tracks information systems and business system development and deployment on a global basis. Works with functional area management to establish systems and processes that have a direct impact on business' competitive capabilities. Responsibilities include managing and supporting all customer experience process automation projects , insuring the availability, responsiveness, and effective utilization of the Development resources. Responsible as an Enterprise BPM Team Member and manager to develop and implement systems strategies and technology that meet the support and operations business requirements. Manager Business Process Design CME Group December 2013  – Present (1 year 9 months) Greater Chicago Area Participates in the development of strategic plans, systems design and tracks information systems and business system development and deployment on a global basis. Works with functional area management to establish systems and processes that have a direct impact on business' competitive capabilities. Responsibilities include managing and supporting all customer experience process automation projects , insuring the availability, responsiveness, and effective utilization of the Development resources. Responsible as an Enterprise BPM Team Member and manager to develop and implement systems strategies and technology that meet the support and operations business requirements. Principle Consultant Infinite Minds Consulting LLC January 2007  – Present (8 years 8 months) Chicagoland Principle Consultant Infinite Minds Consulting LLC January 2007  – Present (8 years 8 months) Chicagoland Consultant CME Group March 2013  –  December 2013  (10 months) Greater Chicago Area Opportunity  \n• Ability to compose and maintain compelling business cases and project charters for the business stakeholders that identifies all the major components of the BPM program including the vision roadmap, financial economics and related benefits \n \nAnalysis  \n• The ability to deliver process discovery for sufficient understanding of the current state baseline. This deliverable may contain or be the result of the following: process flows & narratives, interviews and facilitation, common process structures, policies & procedures, applications & integrations, key performance indicators, baseline walkthrough. \n• The ability to extend the baseline discovery and incorporate the appropriate perspective that will result in the business analysis deliverable that may contain or be the result of the following: comparable benchmarking, baseline measurements, gap analysis, qualitative & quantitative metrics, costing model, business requirements, conclusion / recommendation, possible solutions and future state. \n \nPrototype & Design \n• Present future state concepts through story boards, flow charting, existing in-house functional models and/or build functional examples within Appian for client use to drive the business needs to a technical requirement sufficient for BPM development. \n• Perform step by step walkthroughs for proposed solutions to ensure solution expectations are set. \n• Obtain final sign-off from the business stakeholders prior to any BPM development. \n• Drive and flush out the technical requirements with the required parties for development execution. \n• Work closely with the development and testing teams to ensure a high quality process deliverable. \n \nDeploy & Monitor \n• Drive and institute the necessary activities for both the initial and continuous process deployments within the assigned business area that includes change management, user education & training, solution migration, and the 3 tier support model. Consultant CME Group March 2013  –  December 2013  (10 months) Greater Chicago Area Opportunity  \n• Ability to compose and maintain compelling business cases and project charters for the business stakeholders that identifies all the major components of the BPM program including the vision roadmap, financial economics and related benefits \n \nAnalysis  \n• The ability to deliver process discovery for sufficient understanding of the current state baseline. This deliverable may contain or be the result of the following: process flows & narratives, interviews and facilitation, common process structures, policies & procedures, applications & integrations, key performance indicators, baseline walkthrough. \n• The ability to extend the baseline discovery and incorporate the appropriate perspective that will result in the business analysis deliverable that may contain or be the result of the following: comparable benchmarking, baseline measurements, gap analysis, qualitative & quantitative metrics, costing model, business requirements, conclusion / recommendation, possible solutions and future state. \n \nPrototype & Design \n• Present future state concepts through story boards, flow charting, existing in-house functional models and/or build functional examples within Appian for client use to drive the business needs to a technical requirement sufficient for BPM development. \n• Perform step by step walkthroughs for proposed solutions to ensure solution expectations are set. \n• Obtain final sign-off from the business stakeholders prior to any BPM development. \n• Drive and flush out the technical requirements with the required parties for development execution. \n• Work closely with the development and testing teams to ensure a high quality process deliverable. \n \nDeploy & Monitor \n• Drive and institute the necessary activities for both the initial and continuous process deployments within the assigned business area that includes change management, user education & training, solution migration, and the 3 tier support model. Business Analyst - Tek Systems Hallmark Services Corporation October 2012  –  February 2013  (5 months) naperville, il •\tElicit requirements by developing user stories, interviews, document analysis, storyboards/strawman, business process descriptions, business rules, wireframes, business and data analysis, task and workflow analysis, and/or stakeholder viewpoints. Facilitate user focus sessions with key business team members.  \n•\tCritically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and identifying the underlying needs/requirements driving user requests.  \n•\tExperience supporting member services related to the public exchange implementation for the Healthcare for America Plan(Obamacare) \n•\tCommunicate understanding of processes while looking at the impact of the stories across functional areas and to help the team focus on what is important and to ensure dependencies were identified  \n•\tAct as a liaison between Product Owners and project teams, and evaluate request coming from business units/product management to determine true business need and potential solutions \n•\tReview test plans with testing group to ensure business requirements properly evaluated and reflected in the testing process. Involved with all phases of development (analysis, design, coding, testing, and deployment).  \n•\tCreate and maintain relationships between business objectives, requirements, and solution components by identifying and documenting the lineage of each requirement including backward/forward traceability. Business Analyst - Tek Systems Hallmark Services Corporation October 2012  –  February 2013  (5 months) naperville, il •\tElicit requirements by developing user stories, interviews, document analysis, storyboards/strawman, business process descriptions, business rules, wireframes, business and data analysis, task and workflow analysis, and/or stakeholder viewpoints. Facilitate user focus sessions with key business team members.  \n•\tCritically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and identifying the underlying needs/requirements driving user requests.  \n•\tExperience supporting member services related to the public exchange implementation for the Healthcare for America Plan(Obamacare) \n•\tCommunicate understanding of processes while looking at the impact of the stories across functional areas and to help the team focus on what is important and to ensure dependencies were identified  \n•\tAct as a liaison between Product Owners and project teams, and evaluate request coming from business units/product management to determine true business need and potential solutions \n•\tReview test plans with testing group to ensure business requirements properly evaluated and reflected in the testing process. Involved with all phases of development (analysis, design, coding, testing, and deployment).  \n•\tCreate and maintain relationships between business objectives, requirements, and solution components by identifying and documenting the lineage of each requirement including backward/forward traceability. Consultant CME Group 2013  –  2013  (less than a year) Consultant CME Group 2013  –  2013  (less than a year) Lead Business Analyst (BPMN) - Analyst INTL Analyst International Contracted to Navistar September 2010  –  October 2012  (2 years 2 months) Greater Chicago Area •\tResponsible for developing and maintaining formal BPMN based process documentation including, process models, business requirements traceability matrixes, and use case documentation  \n•\tCreated BPMN compliant models of current and proposed solutions for Order to Cash, including e-Quote, E- Business Suite, PeopleSoft Contracts and Approvals; Supply Chain including 3PL, Shipping & Receiving, Manufacturing (Baan) Supplier Quality Management, Supplier Based Tooling processes  \n•\tFacilitate and engaged in interviews and working sessions with stakeholders, users, customers, vendors and suppliers to understand information, technology, data, and work flows to understand requirements and provide recommendations to the management to drive process improvement \n•\tLead analyst teams in the abstraction of existing and future state business processes into logical models to identify the strengths and weaknesses of alternative solutions \n•\tIdentified gaps in critical business processes affecting shipping, distribution and receiving parts at the plant, leading to inaccurate on hand inventory and causing delays in production. Participated in developing process changes to reduce variability and improve the ability to track deliveries and reduce expedites of duplicate orders.  \n•\tDemonstrate an in-depth knowledge of process management concepts across a wide variety of methodologies - demonstrating the ability to assess the situational appropriates of tool use across methodologies \n•\tProven ability to elicit clarity and direction in ambiguous or budding project environments with business partners who may have little to no exposure to formal process management or optimization practices \n•\tCollaborated with business analyst, enterprise architects and management to develop project strategy for process automation using Oracle BPM Suite and developed strategy for managing the lifecycle of static and executable models in Oracle Enterprise Repository created in Visio, Sparx EA or Oracle jDeveloper Lead Business Analyst (BPMN) - Analyst INTL Analyst International Contracted to Navistar September 2010  –  October 2012  (2 years 2 months) Greater Chicago Area •\tResponsible for developing and maintaining formal BPMN based process documentation including, process models, business requirements traceability matrixes, and use case documentation  \n•\tCreated BPMN compliant models of current and proposed solutions for Order to Cash, including e-Quote, E- Business Suite, PeopleSoft Contracts and Approvals; Supply Chain including 3PL, Shipping & Receiving, Manufacturing (Baan) Supplier Quality Management, Supplier Based Tooling processes  \n•\tFacilitate and engaged in interviews and working sessions with stakeholders, users, customers, vendors and suppliers to understand information, technology, data, and work flows to understand requirements and provide recommendations to the management to drive process improvement \n•\tLead analyst teams in the abstraction of existing and future state business processes into logical models to identify the strengths and weaknesses of alternative solutions \n•\tIdentified gaps in critical business processes affecting shipping, distribution and receiving parts at the plant, leading to inaccurate on hand inventory and causing delays in production. Participated in developing process changes to reduce variability and improve the ability to track deliveries and reduce expedites of duplicate orders.  \n•\tDemonstrate an in-depth knowledge of process management concepts across a wide variety of methodologies - demonstrating the ability to assess the situational appropriates of tool use across methodologies \n•\tProven ability to elicit clarity and direction in ambiguous or budding project environments with business partners who may have little to no exposure to formal process management or optimization practices \n•\tCollaborated with business analyst, enterprise architects and management to develop project strategy for process automation using Oracle BPM Suite and developed strategy for managing the lifecycle of static and executable models in Oracle Enterprise Repository created in Visio, Sparx EA or Oracle jDeveloper Senior IT Business Data Quality Analyst - Sogeti Corp Constellation Energy July 2010  –  September 2010  (3 months) Baltimore, Maryland Area Proficiency with Business Process Analysis and Documentation involving Contracts, Billing, Warranties, Accounts Receivables, Customer Relationship Management \nAbility to analyze data flows and create data flow diagrams \nAssist with presentation development \nData Quality & Reconciliation Analysis \nWork closely with client and other analysts to gather requirements and propose alternative solutions Senior IT Business Data Quality Analyst - Sogeti Corp Constellation Energy July 2010  –  September 2010  (3 months) Baltimore, Maryland Area Proficiency with Business Process Analysis and Documentation involving Contracts, Billing, Warranties, Accounts Receivables, Customer Relationship Management \nAbility to analyze data flows and create data flow diagrams \nAssist with presentation development \nData Quality & Reconciliation Analysis \nWork closely with client and other analysts to gather requirements and propose alternative solutions Siperian Business Analyst - Icon Consulting Corp Waste Management, Inc. January 2010  –  July 2010  (7 months) Houston, Texas Area Under minimal supervision, facilitate the business analysis process to identify business requirements for system solutions or improved processes that will increase efficiency and overall productivity through Master Data Management and Data Governance. Work cohesively with developers, business units, and other test team members. Responsible for the creation, coordination, and execution of test plans in a lead testing role for various types of projects. Siperian Business Analyst - Icon Consulting Corp Waste Management, Inc. January 2010  –  July 2010  (7 months) Houston, Texas Area Under minimal supervision, facilitate the business analysis process to identify business requirements for system solutions or improved processes that will increase efficiency and overall productivity through Master Data Management and Data Governance. Work cohesively with developers, business units, and other test team members. Responsible for the creation, coordination, and execution of test plans in a lead testing role for various types of projects. Lead Business Systems Analyst – MDM- Axelon Corp Pfizer July 2007  –  December 2009  (2 years 6 months) New London/Norwich, Connecticut Area •\tSupported the successful delivery of several large complex Enterprise Master Data initiatives for a multibillion pharmaceutical company. The Solution used Siperian MRM Hub to cleanse, standardize and de-duplicate records interfacing with PeopleSoft, Oracle Financials, Siebel and MSCRM. \n \n•\tCollaborated with users, IT and data analyst to document source and target application data structures \n \n•\tDocumented business objectives, business rules, functional and nonfunctional requirements, business process models with rich text descriptions, data flows and use cases \n \n•\tProfiled data using Trillium, executed data queries and performed research to identify opportunities to improve data quality  \n \n•\tEngaged stakeholders, business subject matter experts in Customer Master Data Governance and Rules Management to establish guidelines, standards and policies to support improved data quality \n \n•\tDesigned and developed a requirements tracking and issues management tool for the Business Analyst community to improve team efficiency and improve requirements traceability throughout the SDLC \n \n•\tTook ownership in documenting business solution design process, finding gaps in existing process, arranging training modules for new process development and implementation. \n \n•\tWorked with QA team to provide input to test plans and test cases for User Acceptance Testing (UAT). \n \nDocumented business rules, business requirements, functional and nonfunctional requirements, cleansing and standardization rules and guidelines, business process models, data flows, use case models, activity diagrams, and data definitions \n \n•\tSolid business, communication, and presentation skills. Adept at creating, editing, and coordinating communication protocols (facilitation of Joint Application Development(JAD) sessions and interviews, workshops, written correspondence, reports, project status reports, oral presentations, e-mails, etc.) Lead Business Systems Analyst – MDM- Axelon Corp Pfizer July 2007  –  December 2009  (2 years 6 months) New London/Norwich, Connecticut Area •\tSupported the successful delivery of several large complex Enterprise Master Data initiatives for a multibillion pharmaceutical company. The Solution used Siperian MRM Hub to cleanse, standardize and de-duplicate records interfacing with PeopleSoft, Oracle Financials, Siebel and MSCRM. \n \n•\tCollaborated with users, IT and data analyst to document source and target application data structures \n \n•\tDocumented business objectives, business rules, functional and nonfunctional requirements, business process models with rich text descriptions, data flows and use cases \n \n•\tProfiled data using Trillium, executed data queries and performed research to identify opportunities to improve data quality  \n \n•\tEngaged stakeholders, business subject matter experts in Customer Master Data Governance and Rules Management to establish guidelines, standards and policies to support improved data quality \n \n•\tDesigned and developed a requirements tracking and issues management tool for the Business Analyst community to improve team efficiency and improve requirements traceability throughout the SDLC \n \n•\tTook ownership in documenting business solution design process, finding gaps in existing process, arranging training modules for new process development and implementation. \n \n•\tWorked with QA team to provide input to test plans and test cases for User Acceptance Testing (UAT). \n \nDocumented business rules, business requirements, functional and nonfunctional requirements, cleansing and standardization rules and guidelines, business process models, data flows, use case models, activity diagrams, and data definitions \n \n•\tSolid business, communication, and presentation skills. Adept at creating, editing, and coordinating communication protocols (facilitation of Joint Application Development(JAD) sessions and interviews, workshops, written correspondence, reports, project status reports, oral presentations, e-mails, etc.) Pricing Analyst Hitachi Data Systems January 2006  –  March 2007  (1 year 3 months) Greater Chicago Area •\tManaged profitability of highly competitive bidding opportunities for high dollar value storage solutions. \n \n•\tAnalyzed margins by segment and/or product category including product mix, pricing arrangements or contract terms, customer life cycle, etc. \n \n•\tNegotiated pricing for strategic opportunities and worked closely with sales team and Channel partners to develop competitive strategies for customers in the North America Region.  \n•\tIdentified gaps in dealer support operations. Recommended improvements to increase analyst efficiency and productivity \n \n•\tDeveloped pricing options to meet competitive opportunities and provide input for profitability projections and corporate pricing strategy  \n \n•\tDeveloped and employed improvements in price discounting tools to increase consistency in sales discounting and reduce defects which cause inaccurate quotes  \n•\tEmployed cost-benefit analysis to review financial requests, assess program tradeoffs, and explore alternative funding methods. \n \n•\tAnalyzed supplier rebates for margin improvement  \nopportunities and interacted with field, suppliers, category managers, customers to implement. \n \n•\tAnalyzed complex RFQ’s with Account Owners to ensure margin protection and ability to comply upon contract award. This would include compilation and manipulation of historical data. Pricing Analyst Hitachi Data Systems January 2006  –  March 2007  (1 year 3 months) Greater Chicago Area •\tManaged profitability of highly competitive bidding opportunities for high dollar value storage solutions. \n \n•\tAnalyzed margins by segment and/or product category including product mix, pricing arrangements or contract terms, customer life cycle, etc. \n \n•\tNegotiated pricing for strategic opportunities and worked closely with sales team and Channel partners to develop competitive strategies for customers in the North America Region.  \n•\tIdentified gaps in dealer support operations. Recommended improvements to increase analyst efficiency and productivity \n \n•\tDeveloped pricing options to meet competitive opportunities and provide input for profitability projections and corporate pricing strategy  \n \n•\tDeveloped and employed improvements in price discounting tools to increase consistency in sales discounting and reduce defects which cause inaccurate quotes  \n•\tEmployed cost-benefit analysis to review financial requests, assess program tradeoffs, and explore alternative funding methods. \n \n•\tAnalyzed supplier rebates for margin improvement  \nopportunities and interacted with field, suppliers, category managers, customers to implement. \n \n•\tAnalyzed complex RFQ’s with Account Owners to ensure margin protection and ability to comply upon contract award. This would include compilation and manipulation of historical data. Process Architect ALLSTATE INSURANCE March 2005  –  March 2006  (1 year 1 month) Greater Chicago Area •\tDeveloped process Architecture for business processes critical to core organizational functions to support CMM adoption. \n \n•\tServed as a liaison to numerous organizations to develop policies and procedures to facilitate the implementation of new process modules and or enhancements.  \n \n•\tLed Business Process Management (BPM) proof of concept to integrate XML messages from Corporate Modeling output to support the deployment of an automated workflow solution using an industry BPM engine.  \n \n•\tCollaborated with vendors, subject matter experts and consultants to document workflow solution requirements \n \n•\tKicked off process tools user group to collaborate on best practices for process development and to define organizational practices, standards and procedures. Provided demonstrations, coaching and training to support early adoption.  \n \n•\tFacilitated process discussions to manage the integration points across multiple process action teams while defining the organization’s standard software process.  \n \n•\tPerformed complex process analysis functions and recommended innovative solutions based on industry best practices to improve operational efficiencies and cost savings.  \n \n•\tPrepared business process related project documentation as per PMO defined artifacts for a large scale project (in line with CMM Methodology) \n \n•\tAnalyzed, researched, diagrammed business process flows, created detailed narrative instructions with reference material, computer screen captures, web links, computer system/application navigation, update procedures for inclusion in training manual \n \n•\tDocumented and published standard operating procedures, work instructions, templates and examples or related processes and methodologies \n \n•\tCoordinated workflow and trained process modelers in methods, procedures and standards for documenting local processes and procedures Process Architect ALLSTATE INSURANCE March 2005  –  March 2006  (1 year 1 month) Greater Chicago Area •\tDeveloped process Architecture for business processes critical to core organizational functions to support CMM adoption. \n \n•\tServed as a liaison to numerous organizations to develop policies and procedures to facilitate the implementation of new process modules and or enhancements.  \n \n•\tLed Business Process Management (BPM) proof of concept to integrate XML messages from Corporate Modeling output to support the deployment of an automated workflow solution using an industry BPM engine.  \n \n•\tCollaborated with vendors, subject matter experts and consultants to document workflow solution requirements \n \n•\tKicked off process tools user group to collaborate on best practices for process development and to define organizational practices, standards and procedures. Provided demonstrations, coaching and training to support early adoption.  \n \n•\tFacilitated process discussions to manage the integration points across multiple process action teams while defining the organization’s standard software process.  \n \n•\tPerformed complex process analysis functions and recommended innovative solutions based on industry best practices to improve operational efficiencies and cost savings.  \n \n•\tPrepared business process related project documentation as per PMO defined artifacts for a large scale project (in line with CMM Methodology) \n \n•\tAnalyzed, researched, diagrammed business process flows, created detailed narrative instructions with reference material, computer screen captures, web links, computer system/application navigation, update procedures for inclusion in training manual \n \n•\tDocumented and published standard operating procedures, work instructions, templates and examples or related processes and methodologies \n \n•\tCoordinated workflow and trained process modelers in methods, procedures and standards for documenting local processes and procedures Senior Business Systems Analyst SEARS January 2004  –  March 2005  (1 year 3 months) Greater Chicago Area •\tComposed detailed and comprehensive requirement documentation to so support the integration and custom development of a large scale and complex JEE retail POS package using IBM Web Sphere MQ for communicating large volumes of transactional sales data to backend systems \n \n•\tDeveloped vision, scope, and use case documents; business process models, use case diagrams, activity diagrams, and state chart diagrams. \n \n•\tImplemented document inspection process to analyze artifacts for defects and provide coaching to business analyst to reduce errors in project deliverables resulting in improved analyst proficiency.  \n \n•\tFacilitated working sessions to develop RUP templates, improve productivity, share lessons learned and build team effectiveness.  \n \n•\tMentored and coached business systems analyst in Rational Methodology/tools leading to improved productivity and conformance to standards \n \n•\tParticipated regularly in Review meetings with Project Manager, Architect, Application System Engineers and Business Analyst  \n \n•\tUtilized UML for Use Case creation, workflow design, diagramming techniques, i.e. block sequence, physical, interaction and system diagrams. \n \n•\tIdentified design issues related to GUI usability, workflow, GUI scalability, performance etc Senior Business Systems Analyst SEARS January 2004  –  March 2005  (1 year 3 months) Greater Chicago Area •\tComposed detailed and comprehensive requirement documentation to so support the integration and custom development of a large scale and complex JEE retail POS package using IBM Web Sphere MQ for communicating large volumes of transactional sales data to backend systems \n \n•\tDeveloped vision, scope, and use case documents; business process models, use case diagrams, activity diagrams, and state chart diagrams. \n \n•\tImplemented document inspection process to analyze artifacts for defects and provide coaching to business analyst to reduce errors in project deliverables resulting in improved analyst proficiency.  \n \n•\tFacilitated working sessions to develop RUP templates, improve productivity, share lessons learned and build team effectiveness.  \n \n•\tMentored and coached business systems analyst in Rational Methodology/tools leading to improved productivity and conformance to standards \n \n•\tParticipated regularly in Review meetings with Project Manager, Architect, Application System Engineers and Business Analyst  \n \n•\tUtilized UML for Use Case creation, workflow design, diagramming techniques, i.e. block sequence, physical, interaction and system diagrams. \n \n•\tIdentified design issues related to GUI usability, workflow, GUI scalability, performance etc Senior Pricing Analyst LUCENT TECHNOLOGIES January 2001  –  January 2003  (2 years 1 month) Greater Chicago Area •\tManaged pricing strategy for European, Middle Eastern and African regions valued at over $300 million in annual sales revenue. \n•\tNegotiated competitive pricing with business partners, customers and sales team. Resulted in purchase orders up to $15 million and 12% increase in margins. \n•\tEvaluated financial statements; conducted cost-benefit analysis of customer proposals, and pre-sale agreements that led to informed technology investment decisions. \n•\tInterfaced with multiple development organizations to assess and streamline daily operations. \n•\tInterfaced with supply chain management to secure volume discounts while negotiating margins with regional Senior Pricing Analyst LUCENT TECHNOLOGIES January 2001  –  January 2003  (2 years 1 month) Greater Chicago Area •\tManaged pricing strategy for European, Middle Eastern and African regions valued at over $300 million in annual sales revenue. \n•\tNegotiated competitive pricing with business partners, customers and sales team. Resulted in purchase orders up to $15 million and 12% increase in margins. \n•\tEvaluated financial statements; conducted cost-benefit analysis of customer proposals, and pre-sale agreements that led to informed technology investment decisions. \n•\tInterfaced with multiple development organizations to assess and streamline daily operations. \n•\tInterfaced with supply chain management to secure volume discounts while negotiating margins with regional Business Architect LUCENT TECHNOLOGIES February 1997  –  January 2003  (6 years) Greater Chicago Area •\tManaged a 24 member Process Engineering Council, an organization of subject matter experts across the SDLC that resolved cross-functional issues, promoted continuous process improvement, knowledge transfer and sharing best practices. \n•\tAudited systems and processes to identify quality gaps. Restructured process development team strategy, which led to an annual expense reduction of $2 million  \n•\tLed projects supporting technology strategy, process management, systematic process action planning, improvement, and monitoring. Business Architect LUCENT TECHNOLOGIES February 1997  –  January 2003  (6 years) Greater Chicago Area •\tManaged a 24 member Process Engineering Council, an organization of subject matter experts across the SDLC that resolved cross-functional issues, promoted continuous process improvement, knowledge transfer and sharing best practices. \n•\tAudited systems and processes to identify quality gaps. Restructured process development team strategy, which led to an annual expense reduction of $2 million  \n•\tLed projects supporting technology strategy, process management, systematic process action planning, improvement, and monitoring. Skills Requirements Analysis SDLC Business Process Business Analysis Visio Business Intelligence Integration Business Requirements Master Data Management Requirements Gathering IT Strategy Management Business Process Design Enterprise Architecture Agile Methodologies Data Modeling Software Documentation User Acceptance Testing Process Improvement Systems Analysis Project Management CRM Testing Enterprise Software Data Warehousing Data Integration ETL Cross-functional Team... PMO Process Modeling Project Coordination Business Process... Quality Assurance Process Analysis UML Analysis Databases Change Management Software Project... Scrum Project Delivery Process Engineering Data Analysis Strategy Kanban Lean Six Sigma See 31+     See less Skills  Requirements Analysis SDLC Business Process Business Analysis Visio Business Intelligence Integration Business Requirements Master Data Management Requirements Gathering IT Strategy Management Business Process Design Enterprise Architecture Agile Methodologies Data Modeling Software Documentation User Acceptance Testing Process Improvement Systems Analysis Project Management CRM Testing Enterprise Software Data Warehousing Data Integration ETL Cross-functional Team... PMO Process Modeling Project Coordination Business Process... Quality Assurance Process Analysis UML Analysis Databases Change Management Software Project... Scrum Project Delivery Process Engineering Data Analysis Strategy Kanban Lean Six Sigma See 31+     See less Requirements Analysis SDLC Business Process Business Analysis Visio Business Intelligence Integration Business Requirements Master Data Management Requirements Gathering IT Strategy Management Business Process Design Enterprise Architecture Agile Methodologies Data Modeling Software Documentation User Acceptance Testing Process Improvement Systems Analysis Project Management CRM Testing Enterprise Software Data Warehousing Data Integration ETL Cross-functional Team... PMO Process Modeling Project Coordination Business Process... Quality Assurance Process Analysis UML Analysis Databases Change Management Software Project... Scrum Project Delivery Process Engineering Data Analysis Strategy Kanban Lean Six Sigma See 31+     See less Requirements Analysis SDLC Business Process Business Analysis Visio Business Intelligence Integration Business Requirements Master Data Management Requirements Gathering IT Strategy Management Business Process Design Enterprise Architecture Agile Methodologies Data Modeling Software Documentation User Acceptance Testing Process Improvement Systems Analysis Project Management CRM Testing Enterprise Software Data Warehousing Data Integration ETL Cross-functional Team... PMO Process Modeling Project Coordination Business Process... Quality Assurance Process Analysis UML Analysis Databases Change Management Software Project... Scrum Project Delivery Process Engineering Data Analysis Strategy Kanban Lean Six Sigma See 31+     See less Education Northwestern University Master’s Degree,  Predictive Analytics 2015  – 2018 Data Science North Central College Master of Science,  Information Systems 2000  – 2001 North Central College Masters,  MBA 1999  – 2000 University of South Florida Bachelor,  Information Systems 1991  – 1994 Activities and Societies:  School Chapter President of APICS The Association for Operations Management University of North Carolina at Charlotte Master’s Degree,  Predictive Analytics 2015 Bartow High School Northwestern University Master’s Degree,  Predictive Analytics 2015  – 2018 Data Science Northwestern University Master’s Degree,  Predictive Analytics 2015  – 2018 Data Science Northwestern University Master’s Degree,  Predictive Analytics 2015  – 2018 Data Science North Central College Master of Science,  Information Systems 2000  – 2001 North Central College Master of Science,  Information Systems 2000  – 2001 North Central College Master of Science,  Information Systems 2000  – 2001 North Central College Masters,  MBA 1999  – 2000 North Central College Masters,  MBA 1999  – 2000 North Central College Masters,  MBA 1999  – 2000 University of South Florida Bachelor,  Information Systems 1991  – 1994 Activities and Societies:  School Chapter President of APICS The Association for Operations Management University of South Florida Bachelor,  Information Systems 1991  – 1994 Activities and Societies:  School Chapter President of APICS The Association for Operations Management University of South Florida Bachelor,  Information Systems 1991  – 1994 Activities and Societies:  School Chapter President of APICS The Association for Operations Management University of North Carolina at Charlotte Master’s Degree,  Predictive Analytics 2015 University of North Carolina at Charlotte Master’s Degree,  Predictive Analytics 2015 University of North Carolina at Charlotte Master’s Degree,  Predictive Analytics 2015 Bartow High School Bartow High School Bartow High School ", "Skills Program Management Strategic Planning Program Evaluation Testing Process Improvement Change Management Project Management Management Team Leadership Product Development Business Development Security Team Building Business Process Leadership Development Budgets Leadership Training Public Speaking Cross-functional Team... Analysis Strategic Partnerships Management Consulting Strategy Vendor Management Item Response Theory Consulting Project Planning Proposal Writing Classical Test Theory Product Management Organizational... Start-ups Business Analysis See 19+     See less Skills  Program Management Strategic Planning Program Evaluation Testing Process Improvement Change Management Project Management Management Team Leadership Product Development Business Development Security Team Building Business Process Leadership Development Budgets Leadership Training Public Speaking Cross-functional Team... Analysis Strategic Partnerships Management Consulting Strategy Vendor Management Item Response Theory Consulting Project Planning Proposal Writing Classical Test Theory Product Management Organizational... Start-ups Business Analysis See 19+     See less Program Management Strategic Planning Program Evaluation Testing Process Improvement Change Management Project Management Management Team Leadership Product Development Business Development Security Team Building Business Process Leadership Development Budgets Leadership Training Public Speaking Cross-functional Team... Analysis Strategic Partnerships Management Consulting Strategy Vendor Management Item Response Theory Consulting Project Planning Proposal Writing Classical Test Theory Product Management Organizational... Start-ups Business Analysis See 19+     See less Program Management Strategic Planning Program Evaluation Testing Process Improvement Change Management Project Management Management Team Leadership Product Development Business Development Security Team Building Business Process Leadership Development Budgets Leadership Training Public Speaking Cross-functional Team... Analysis Strategic Partnerships Management Consulting Strategy Vendor Management Item Response Theory Consulting Project Planning Proposal Writing Classical Test Theory Product Management Organizational... Start-ups Business Analysis See 19+     See less ", "Skills Business Process... Strategic Planning Project Planning Business Analysis Microsoft Office Leadership Agile Project Management Microsoft Excel Supply Chain Management Coaching P&L Management Project Portfolio... Project Management Management Strategy Supply Chain Process Scheduler Performance Management Sales Management Logistics Training Time Management Team Leadership See 8+     See less Skills  Business Process... Strategic Planning Project Planning Business Analysis Microsoft Office Leadership Agile Project Management Microsoft Excel Supply Chain Management Coaching P&L Management Project Portfolio... Project Management Management Strategy Supply Chain Process Scheduler Performance Management Sales Management Logistics Training Time Management Team Leadership See 8+     See less Business Process... Strategic Planning Project Planning Business Analysis Microsoft Office Leadership Agile Project Management Microsoft Excel Supply Chain Management Coaching P&L Management Project Portfolio... Project Management Management Strategy Supply Chain Process Scheduler Performance Management Sales Management Logistics Training Time Management Team Leadership See 8+     See less Business Process... Strategic Planning Project Planning Business Analysis Microsoft Office Leadership Agile Project Management Microsoft Excel Supply Chain Management Coaching P&L Management Project Portfolio... Project Management Management Strategy Supply Chain Process Scheduler Performance Management Sales Management Logistics Training Time Management Team Leadership See 8+     See less Honors & Awards Chairman's Award for Effective Cost Control Best Buy October 2009 Managed the system changes required for a Home Delivery project that saved the company over 3 Million annually. The project team was recognized as the most effective cost control project in the company that year.  Retail Partner of the Year Best Buy Retail July 2006 Project Manager for a project that delivered the capability to repair PCs in Best Buy's retail stores. This backbone enabled Best Buys partnership with Geek Squad to proceed smoothly.  Chairman's Award for Effective Cost Control Best Buy October 2009 Managed the system changes required for a Home Delivery project that saved the company over 3 Million annually. The project team was recognized as the most effective cost control project in the company that year.  Chairman's Award for Effective Cost Control Best Buy October 2009 Managed the system changes required for a Home Delivery project that saved the company over 3 Million annually. The project team was recognized as the most effective cost control project in the company that year.  Chairman's Award for Effective Cost Control Best Buy October 2009 Managed the system changes required for a Home Delivery project that saved the company over 3 Million annually. The project team was recognized as the most effective cost control project in the company that year.  Retail Partner of the Year Best Buy Retail July 2006 Project Manager for a project that delivered the capability to repair PCs in Best Buy's retail stores. This backbone enabled Best Buys partnership with Geek Squad to proceed smoothly.  Retail Partner of the Year Best Buy Retail July 2006 Project Manager for a project that delivered the capability to repair PCs in Best Buy's retail stores. This backbone enabled Best Buys partnership with Geek Squad to proceed smoothly.  Retail Partner of the Year Best Buy Retail July 2006 Project Manager for a project that delivered the capability to repair PCs in Best Buy's retail stores. This backbone enabled Best Buys partnership with Geek Squad to proceed smoothly.  ", "Experience Manager, Business Process Design (SPHR) Stop & Shop July 2011  – Present (4 years 2 months) Quincy, MA Director, HRIS & Information Management Stop & Shop Supermarket Co. LLC, Giant Food, Ahold USA 1982  – Present (33 years) HR Ahold USA 2006  –  2011  (5 years) Manager, Business Process Design (SPHR) Stop & Shop July 2011  – Present (4 years 2 months) Quincy, MA Manager, Business Process Design (SPHR) Stop & Shop July 2011  – Present (4 years 2 months) Quincy, MA Director, HRIS & Information Management Stop & Shop Supermarket Co. LLC, Giant Food, Ahold USA 1982  – Present (33 years) Director, HRIS & Information Management Stop & Shop Supermarket Co. LLC, Giant Food, Ahold USA 1982  – Present (33 years) HR Ahold USA 2006  –  2011  (5 years) HR Ahold USA 2006  –  2011  (5 years) Skills Analysis SQL Change Management Customer Service Teamwork Human Resources Business Process... Training Business Process Performance Management Succession Planning Process Improvement Deferred Compensation Budgets Program Management Visio Leadership Employee Relations Access Social Media SDLC Kronos PeopleSoft Organizational... Microsoft Excel Vendor Management Business Process Design HRIS Personnel Management Team Leadership Talent Acquisition Talent Management Onboarding Outlook Cross-functional Team... Organizational Design Recruiting Workforce Planning Project Management Business Intelligence Store Management Business Analysis Team Building Retail Inventory Management Requirements Analysis Project Planning Merchandising Income Statement Benefits Administration See 35+     See less Skills  Analysis SQL Change Management Customer Service Teamwork Human Resources Business Process... Training Business Process Performance Management Succession Planning Process Improvement Deferred Compensation Budgets Program Management Visio Leadership Employee Relations Access Social Media SDLC Kronos PeopleSoft Organizational... Microsoft Excel Vendor Management Business Process Design HRIS Personnel Management Team Leadership Talent Acquisition Talent Management Onboarding Outlook Cross-functional Team... Organizational Design Recruiting Workforce Planning Project Management Business Intelligence Store Management Business Analysis Team Building Retail Inventory Management Requirements Analysis Project Planning Merchandising Income Statement Benefits Administration See 35+     See less Analysis SQL Change Management Customer Service Teamwork Human Resources Business Process... Training Business Process Performance Management Succession Planning Process Improvement Deferred Compensation Budgets Program Management Visio Leadership Employee Relations Access Social Media SDLC Kronos PeopleSoft Organizational... Microsoft Excel Vendor Management Business Process Design HRIS Personnel Management Team Leadership Talent Acquisition Talent Management Onboarding Outlook Cross-functional Team... Organizational Design Recruiting Workforce Planning Project Management Business Intelligence Store Management Business Analysis Team Building Retail Inventory Management Requirements Analysis Project Planning Merchandising Income Statement Benefits Administration See 35+     See less Analysis SQL Change Management Customer Service Teamwork Human Resources Business Process... Training Business Process Performance Management Succession Planning Process Improvement Deferred Compensation Budgets Program Management Visio Leadership Employee Relations Access Social Media SDLC Kronos PeopleSoft Organizational... Microsoft Excel Vendor Management Business Process Design HRIS Personnel Management Team Leadership Talent Acquisition Talent Management Onboarding Outlook Cross-functional Team... Organizational Design Recruiting Workforce Planning Project Management Business Intelligence Store Management Business Analysis Team Building Retail Inventory Management Requirements Analysis Project Planning Merchandising Income Statement Benefits Administration See 35+     See less ", "Experience Dir. Global Process Expert S2P Value Stream UCB July 2014  – Present (1 year 2 months) Associate Director Global Process Owner Source-to-Pay (P2P) UCB October 2010  –  June 2014  (3 years 9 months) Belgium Accountable for all aspects of UCB's core S2P tools & processes and design of best-in-class, compliant, efficient and effective end-to-end S2P processes, aiming to deliver solutions to the business. Internal Control Manager & Business Process Design UCB August 2008  –  October 2010  (2 years 3 months) In the context of the externalization of the financial activities to an external provider \n- Designing optimized financial and internal control processes, in compliance with Corporate Governance best practices; \n- Ensuring that information systems are aligned with business and financial needs; \n- Management of moving from ‘AS IS’ situation to ‘TO BE’ scenario & change management impacts. Senior Auditor Price Waterhouse Coopers September 2006  –  July 2008  (1 year 11 months) -Perform financial audits for major clients (Fortis Insurance Belgium, Euroclear); \n-Identify control weaknesses & reporting deficiencies; \n-Audit/evaluate the effectiveness of those internal controls over financial reporting; \n-Evaluate the effectiveness of Sarbanes-Oxley implementation Financial Controller Deli XL July 2003  –  September 2006  (3 years 3 months) - Budget Preparation \n- Analysis of actuals vs. budget \n- Various projects Dir. Global Process Expert S2P Value Stream UCB July 2014  – Present (1 year 2 months) Dir. Global Process Expert S2P Value Stream UCB July 2014  – Present (1 year 2 months) Associate Director Global Process Owner Source-to-Pay (P2P) UCB October 2010  –  June 2014  (3 years 9 months) Belgium Accountable for all aspects of UCB's core S2P tools & processes and design of best-in-class, compliant, efficient and effective end-to-end S2P processes, aiming to deliver solutions to the business. Associate Director Global Process Owner Source-to-Pay (P2P) UCB October 2010  –  June 2014  (3 years 9 months) Belgium Accountable for all aspects of UCB's core S2P tools & processes and design of best-in-class, compliant, efficient and effective end-to-end S2P processes, aiming to deliver solutions to the business. Internal Control Manager & Business Process Design UCB August 2008  –  October 2010  (2 years 3 months) In the context of the externalization of the financial activities to an external provider \n- Designing optimized financial and internal control processes, in compliance with Corporate Governance best practices; \n- Ensuring that information systems are aligned with business and financial needs; \n- Management of moving from ‘AS IS’ situation to ‘TO BE’ scenario & change management impacts. Internal Control Manager & Business Process Design UCB August 2008  –  October 2010  (2 years 3 months) In the context of the externalization of the financial activities to an external provider \n- Designing optimized financial and internal control processes, in compliance with Corporate Governance best practices; \n- Ensuring that information systems are aligned with business and financial needs; \n- Management of moving from ‘AS IS’ situation to ‘TO BE’ scenario & change management impacts. Senior Auditor Price Waterhouse Coopers September 2006  –  July 2008  (1 year 11 months) -Perform financial audits for major clients (Fortis Insurance Belgium, Euroclear); \n-Identify control weaknesses & reporting deficiencies; \n-Audit/evaluate the effectiveness of those internal controls over financial reporting; \n-Evaluate the effectiveness of Sarbanes-Oxley implementation Senior Auditor Price Waterhouse Coopers September 2006  –  July 2008  (1 year 11 months) -Perform financial audits for major clients (Fortis Insurance Belgium, Euroclear); \n-Identify control weaknesses & reporting deficiencies; \n-Audit/evaluate the effectiveness of those internal controls over financial reporting; \n-Evaluate the effectiveness of Sarbanes-Oxley implementation Financial Controller Deli XL July 2003  –  September 2006  (3 years 3 months) - Budget Preparation \n- Analysis of actuals vs. budget \n- Various projects Financial Controller Deli XL July 2003  –  September 2006  (3 years 3 months) - Budget Preparation \n- Analysis of actuals vs. budget \n- Various projects Languages French English Romanian French English Romanian French English Romanian Skills Internal Controls Audit Financial Reporting SOX Compliance P2P Project Coordination Alignment Process Alignment Compromise Agreements Listening Skills Customer Focus Purchasing Processes Process Mapping Process Optimization Auditing SAP Sarbanes-Oxley Act Consolidation Financial Accounting Customer Oriented Business Process... Business Process Business Alignment Shared Services Business Process Mapping Change Management See 12+     See less Skills  Internal Controls Audit Financial Reporting SOX Compliance P2P Project Coordination Alignment Process Alignment Compromise Agreements Listening Skills Customer Focus Purchasing Processes Process Mapping Process Optimization Auditing SAP Sarbanes-Oxley Act Consolidation Financial Accounting Customer Oriented Business Process... Business Process Business Alignment Shared Services Business Process Mapping Change Management See 12+     See less Internal Controls Audit Financial Reporting SOX Compliance P2P Project Coordination Alignment Process Alignment Compromise Agreements Listening Skills Customer Focus Purchasing Processes Process Mapping Process Optimization Auditing SAP Sarbanes-Oxley Act Consolidation Financial Accounting Customer Oriented Business Process... Business Process Business Alignment Shared Services Business Process Mapping Change Management See 12+     See less Internal Controls Audit Financial Reporting SOX Compliance P2P Project Coordination Alignment Process Alignment Compromise Agreements Listening Skills Customer Focus Purchasing Processes Process Mapping Process Optimization Auditing SAP Sarbanes-Oxley Act Consolidation Financial Accounting Customer Oriented Business Process... Business Process Business Alignment Shared Services Business Process Mapping Change Management See 12+     See less Education Université catholique de Louvain IAG - Institut d'Administration et de Gestion,  Master in Business Engineering 2000  – 2003 Solvay Brussels School Dedicated courses to Corporate Taxes 2003  – 2004 Tecnológico de Monterrey Exchange program - International Management (campus : San Luis Potosi) 2002  – 2002 Facultés universitaires 'Saint-Louis', Bruxelles Bachelor,  Bachelor in Business Engineering 1997  – 2000 CCM - College Cardinal Mercier 1991  – 1997 Université catholique de Louvain IAG - Institut d'Administration et de Gestion,  Master in Business Engineering 2000  – 2003 Université catholique de Louvain IAG - Institut d'Administration et de Gestion,  Master in Business Engineering 2000  – 2003 Université catholique de Louvain IAG - Institut d'Administration et de Gestion,  Master in Business Engineering 2000  – 2003 Solvay Brussels School Dedicated courses to Corporate Taxes 2003  – 2004 Solvay Brussels School Dedicated courses to Corporate Taxes 2003  – 2004 Solvay Brussels School Dedicated courses to Corporate Taxes 2003  – 2004 Tecnológico de Monterrey Exchange program - International Management (campus : San Luis Potosi) 2002  – 2002 Tecnológico de Monterrey Exchange program - International Management (campus : San Luis Potosi) 2002  – 2002 Tecnológico de Monterrey Exchange program - International Management (campus : San Luis Potosi) 2002  – 2002 Facultés universitaires 'Saint-Louis', Bruxelles Bachelor,  Bachelor in Business Engineering 1997  – 2000 Facultés universitaires 'Saint-Louis', Bruxelles Bachelor,  Bachelor in Business Engineering 1997  – 2000 Facultés universitaires 'Saint-Louis', Bruxelles Bachelor,  Bachelor in Business Engineering 1997  – 2000 CCM - College Cardinal Mercier 1991  – 1997 CCM - College Cardinal Mercier 1991  – 1997 CCM - College Cardinal Mercier 1991  – 1997 ", "Skills Software Selection Business Process Design Requirements Analysis HRIS People Management Change Management Outsourcing Management Business Process... Project Management Performance Management Process Improvement Project Portfolio... Management Consulting PMP Leadership Strategy CRM Human Resources Consulting Business Transformation PMO Organizational Design Vendor Management Program Management IT Strategy See 11+     See less Skills  Software Selection Business Process Design Requirements Analysis HRIS People Management Change Management Outsourcing Management Business Process... Project Management Performance Management Process Improvement Project Portfolio... Management Consulting PMP Leadership Strategy CRM Human Resources Consulting Business Transformation PMO Organizational Design Vendor Management Program Management IT Strategy See 11+     See less Software Selection Business Process Design Requirements Analysis HRIS People Management Change Management Outsourcing Management Business Process... Project Management Performance Management Process Improvement Project Portfolio... Management Consulting PMP Leadership Strategy CRM Human Resources Consulting Business Transformation PMO Organizational Design Vendor Management Program Management IT Strategy See 11+     See less Software Selection Business Process Design Requirements Analysis HRIS People Management Change Management Outsourcing Management Business Process... Project Management Performance Management Process Improvement Project Portfolio... Management Consulting PMP Leadership Strategy CRM Human Resources Consulting Business Transformation PMO Organizational Design Vendor Management Program Management IT Strategy See 11+     See less ", "Experience Manager Business Process Design Sysco Corporation Manager Business Process Design Sysco Corporation Manager Business Process Design Sysco Corporation ", "Experience Manager, Business Process Design Manulife July 2015  – Present (2 months) Acting Manager, Business Process Design Manulife Financial December 2014  –  July 2015  (8 months) Business Process Designer Manulife Financial October 2013  –  December 2014  (1 year 3 months) Intermediate Business Analyst Manulife Financial November 2010  –  October 2013  (3 years) Waterloo Ontario Supervisor - Transfers Administration Manulife Financial August 2009  –  November 2010  (1 year 4 months) Waterloo Ontario Manager, Business Process Design Manulife July 2015  – Present (2 months) Manager, Business Process Design Manulife July 2015  – Present (2 months) Acting Manager, Business Process Design Manulife Financial December 2014  –  July 2015  (8 months) Acting Manager, Business Process Design Manulife Financial December 2014  –  July 2015  (8 months) Business Process Designer Manulife Financial October 2013  –  December 2014  (1 year 3 months) Business Process Designer Manulife Financial October 2013  –  December 2014  (1 year 3 months) Intermediate Business Analyst Manulife Financial November 2010  –  October 2013  (3 years) Waterloo Ontario Intermediate Business Analyst Manulife Financial November 2010  –  October 2013  (3 years) Waterloo Ontario Supervisor - Transfers Administration Manulife Financial August 2009  –  November 2010  (1 year 4 months) Waterloo Ontario Supervisor - Transfers Administration Manulife Financial August 2009  –  November 2010  (1 year 4 months) Waterloo Ontario Languages French French French Skills Business Analysis Insurance Coaching Investments Leadership Process Improvement Team Leadership Visio Requirements Gathering Problem Solving Training Data Analysis Public Speaking Change Management Business Process... BPMN Writing Process Analysis User Acceptance Testing Software Documentation Vendor Management See 6+     See less Skills  Business Analysis Insurance Coaching Investments Leadership Process Improvement Team Leadership Visio Requirements Gathering Problem Solving Training Data Analysis Public Speaking Change Management Business Process... BPMN Writing Process Analysis User Acceptance Testing Software Documentation Vendor Management See 6+     See less Business Analysis Insurance Coaching Investments Leadership Process Improvement Team Leadership Visio Requirements Gathering Problem Solving Training Data Analysis Public Speaking Change Management Business Process... BPMN Writing Process Analysis User Acceptance Testing Software Documentation Vendor Management See 6+     See less Business Analysis Insurance Coaching Investments Leadership Process Improvement Team Leadership Visio Requirements Gathering Problem Solving Training Data Analysis Public Speaking Change Management Business Process... BPMN Writing Process Analysis User Acceptance Testing Software Documentation Vendor Management See 6+     See less Education University of Waterloo BA,  English 2002  – 2006 University of Waterloo BA,  English 2002  – 2006 University of Waterloo BA,  English 2002  – 2006 University of Waterloo BA,  English 2002  – 2006 Honors & Awards ", "Experience Manager, Business Process Design & Delivery Comcast October 2011  – Present (3 years 11 months) Senior Consultant Hitachi Consulting August 2007  –  October 2011  (4 years 3 months) Graduate Assistant in the Office of Transfer Admissions Drexel University January 2007  –  June 2007  (6 months) Human Resources Representative Mars Electronics June 2003  –  December 2006  (3 years 7 months) Manager, Business Process Design & Delivery Comcast October 2011  – Present (3 years 11 months) Manager, Business Process Design & Delivery Comcast October 2011  – Present (3 years 11 months) Senior Consultant Hitachi Consulting August 2007  –  October 2011  (4 years 3 months) Senior Consultant Hitachi Consulting August 2007  –  October 2011  (4 years 3 months) Graduate Assistant in the Office of Transfer Admissions Drexel University January 2007  –  June 2007  (6 months) Graduate Assistant in the Office of Transfer Admissions Drexel University January 2007  –  June 2007  (6 months) Human Resources Representative Mars Electronics June 2003  –  December 2006  (3 years 7 months) Human Resources Representative Mars Electronics June 2003  –  December 2006  (3 years 7 months) Languages Russian Russian Russian Skills Program Management Process Improvement Change Management Strategic Planning Project Management Training Operations Management Telecommunications Integration Human Resources Business Analysis Business Process... Project Planning Analysis Vendor Management Management Consulting Organizational... See 2+     See less Skills  Program Management Process Improvement Change Management Strategic Planning Project Management Training Operations Management Telecommunications Integration Human Resources Business Analysis Business Process... Project Planning Analysis Vendor Management Management Consulting Organizational... See 2+     See less Program Management Process Improvement Change Management Strategic Planning Project Management Training Operations Management Telecommunications Integration Human Resources Business Analysis Business Process... Project Planning Analysis Vendor Management Management Consulting Organizational... See 2+     See less Program Management Process Improvement Change Management Strategic Planning Project Management Training Operations Management Telecommunications Integration Human Resources Business Analysis Business Process... Project Planning Analysis Vendor Management Management Consulting Organizational... See 2+     See less Education Drexel University MS Higher Education,  Higher Education Administration & Organizational Management and Global & International Education 2005  – 2007 Completed a Capstone Research Project on Professional Development in Enrollment Management Drexel University BS Business Administration,  Human Resource Management 2002  – 2007 Activities and Societies:  University Chorus ,  Chamber Singers ,  TrebleMakers Drexel University MS Higher Education,  Higher Education Administration & Organizational Management and Global & International Education 2005  – 2007 Completed a Capstone Research Project on Professional Development in Enrollment Management Drexel University MS Higher Education,  Higher Education Administration & Organizational Management and Global & International Education 2005  – 2007 Completed a Capstone Research Project on Professional Development in Enrollment Management Drexel University MS Higher Education,  Higher Education Administration & Organizational Management and Global & International Education 2005  – 2007 Completed a Capstone Research Project on Professional Development in Enrollment Management Drexel University BS Business Administration,  Human Resource Management 2002  – 2007 Activities and Societies:  University Chorus ,  Chamber Singers ,  TrebleMakers Drexel University BS Business Administration,  Human Resource Management 2002  – 2007 Activities and Societies:  University Chorus ,  Chamber Singers ,  TrebleMakers Drexel University BS Business Administration,  Human Resource Management 2002  – 2007 Activities and Societies:  University Chorus ,  Chamber Singers ,  TrebleMakers ", "Experience Senior Manager Business Operations Cisco Systems April 2012  – Present (3 years 5 months) San Jose Sales Mobility: \nDefine and drive sales mobility strategy \nDevelop and deploy mobile apps to enable the sales field \n \nSales Business Architecture: \nDefine and drive business architecture strategy to enable and support top company priorities, new business models and Go To Market strategies as it relates to sales Manager, Business Process Design Cisco October 2009  –  March 2012  (2 years 6 months) Business Architect - turning strategy into reality \nLed effort to create a program to support company's cloud strategy Operations Manager, Business Process Design Cisco Systems October 2006  –  October 2009  (3 years 1 month) Senior Manager Business Operations Cisco Systems April 2012  – Present (3 years 5 months) San Jose Sales Mobility: \nDefine and drive sales mobility strategy \nDevelop and deploy mobile apps to enable the sales field \n \nSales Business Architecture: \nDefine and drive business architecture strategy to enable and support top company priorities, new business models and Go To Market strategies as it relates to sales Senior Manager Business Operations Cisco Systems April 2012  – Present (3 years 5 months) San Jose Sales Mobility: \nDefine and drive sales mobility strategy \nDevelop and deploy mobile apps to enable the sales field \n \nSales Business Architecture: \nDefine and drive business architecture strategy to enable and support top company priorities, new business models and Go To Market strategies as it relates to sales Manager, Business Process Design Cisco October 2009  –  March 2012  (2 years 6 months) Business Architect - turning strategy into reality \nLed effort to create a program to support company's cloud strategy Manager, Business Process Design Cisco October 2009  –  March 2012  (2 years 6 months) Business Architect - turning strategy into reality \nLed effort to create a program to support company's cloud strategy Operations Manager, Business Process Design Cisco Systems October 2006  –  October 2009  (3 years 1 month) Operations Manager, Business Process Design Cisco Systems October 2006  –  October 2009  (3 years 1 month) Skills Cloud Computing Go-to-market Strategy Cross-functional Team... SaaS Strategy Business Architecture Sales Metrics Program Management Business Process Design Mobile Applications Professional Services Strategic Partnerships Enterprise Software Sales Enablement Skills  Cloud Computing Go-to-market Strategy Cross-functional Team... SaaS Strategy Business Architecture Sales Metrics Program Management Business Process Design Mobile Applications Professional Services Strategic Partnerships Enterprise Software Sales Enablement Cloud Computing Go-to-market Strategy Cross-functional Team... SaaS Strategy Business Architecture Sales Metrics Program Management Business Process Design Mobile Applications Professional Services Strategic Partnerships Enterprise Software Sales Enablement Cloud Computing Go-to-market Strategy Cross-functional Team... SaaS Strategy Business Architecture Sales Metrics Program Management Business Process Design Mobile Applications Professional Services Strategic Partnerships Enterprise Software Sales Enablement ", "Experience Executive Manager Business and Process Design (Ignite Program) Suncorp Group August 2010  – Present (5 years 1 month) Head of the Business and Process Design for the Customer, Deposits and Assisted Channels Stream of the Ignite Program. A program to replace the core banking systems of Suncorp Bank with OBP (Oracle Banking Platform) and related Customer and Workflow solutions. Executive Manager Banking Operations Suncorp June 2007  –  August 2010  (3 years 3 months) Manage the provision of all banking and treasury back office services including payments CS1 - 5, foreign exchange, deposit / merchant products (fulfilment and servicing) and offshore operations. Manager Banking Projects Delivery Suncorp June 2006  –  June 2007  (1 year 1 month) Lead a team of Project Leaders/Managers responsible for implementing Banking Projects across both Retail and Business Banking Six Sigma Black Belt / Project Manager Suncorp May 2002  –  June 2006  (4 years 2 months) Lead and manage project teams to ensure successful implementation of Business Banking related projects. Apply Six Sigma tools and methodologies to achieve these project objectives. Effectively communicate on progress with senior stakeholders. Operations Manager Bank of New York Mellon January 2000  –  March 2001  (1 year 3 months) Manage the performance of the INVESCO dealing business unit. The unit consisted of 3 Team Leaders and 28 staff processing Unit Trust & ISA deals. Project Office Manager RBS Trust Bank August 1997  –  December 1999  (2 years 5 months) Leading a small team responsible for running various projects and providing MIS reports to support senior management. Executive Manager Business and Process Design (Ignite Program) Suncorp Group August 2010  – Present (5 years 1 month) Head of the Business and Process Design for the Customer, Deposits and Assisted Channels Stream of the Ignite Program. A program to replace the core banking systems of Suncorp Bank with OBP (Oracle Banking Platform) and related Customer and Workflow solutions. Executive Manager Business and Process Design (Ignite Program) Suncorp Group August 2010  – Present (5 years 1 month) Head of the Business and Process Design for the Customer, Deposits and Assisted Channels Stream of the Ignite Program. A program to replace the core banking systems of Suncorp Bank with OBP (Oracle Banking Platform) and related Customer and Workflow solutions. Executive Manager Banking Operations Suncorp June 2007  –  August 2010  (3 years 3 months) Manage the provision of all banking and treasury back office services including payments CS1 - 5, foreign exchange, deposit / merchant products (fulfilment and servicing) and offshore operations. Executive Manager Banking Operations Suncorp June 2007  –  August 2010  (3 years 3 months) Manage the provision of all banking and treasury back office services including payments CS1 - 5, foreign exchange, deposit / merchant products (fulfilment and servicing) and offshore operations. Manager Banking Projects Delivery Suncorp June 2006  –  June 2007  (1 year 1 month) Lead a team of Project Leaders/Managers responsible for implementing Banking Projects across both Retail and Business Banking Manager Banking Projects Delivery Suncorp June 2006  –  June 2007  (1 year 1 month) Lead a team of Project Leaders/Managers responsible for implementing Banking Projects across both Retail and Business Banking Six Sigma Black Belt / Project Manager Suncorp May 2002  –  June 2006  (4 years 2 months) Lead and manage project teams to ensure successful implementation of Business Banking related projects. Apply Six Sigma tools and methodologies to achieve these project objectives. Effectively communicate on progress with senior stakeholders. Six Sigma Black Belt / Project Manager Suncorp May 2002  –  June 2006  (4 years 2 months) Lead and manage project teams to ensure successful implementation of Business Banking related projects. Apply Six Sigma tools and methodologies to achieve these project objectives. Effectively communicate on progress with senior stakeholders. Operations Manager Bank of New York Mellon January 2000  –  March 2001  (1 year 3 months) Manage the performance of the INVESCO dealing business unit. The unit consisted of 3 Team Leaders and 28 staff processing Unit Trust & ISA deals. Operations Manager Bank of New York Mellon January 2000  –  March 2001  (1 year 3 months) Manage the performance of the INVESCO dealing business unit. The unit consisted of 3 Team Leaders and 28 staff processing Unit Trust & ISA deals. Project Office Manager RBS Trust Bank August 1997  –  December 1999  (2 years 5 months) Leading a small team responsible for running various projects and providing MIS reports to support senior management. Project Office Manager RBS Trust Bank August 1997  –  December 1999  (2 years 5 months) Leading a small team responsible for running various projects and providing MIS reports to support senior management. Skills Core Banking Business Strategy Business Transformation Stakeholder Management Banking Process Engineering Business Process... Risk Management Team Leadership Performance Management Management Business Analysis Project Delivery Project Portfolio... Six Sigma Business Process Change Management Project Management See 3+     See less Skills  Core Banking Business Strategy Business Transformation Stakeholder Management Banking Process Engineering Business Process... Risk Management Team Leadership Performance Management Management Business Analysis Project Delivery Project Portfolio... Six Sigma Business Process Change Management Project Management See 3+     See less Core Banking Business Strategy Business Transformation Stakeholder Management Banking Process Engineering Business Process... Risk Management Team Leadership Performance Management Management Business Analysis Project Delivery Project Portfolio... Six Sigma Business Process Change Management Project Management See 3+     See less Core Banking Business Strategy Business Transformation Stakeholder Management Banking Process Engineering Business Process... Risk Management Team Leadership Performance Management Management Business Analysis Project Delivery Project Portfolio... Six Sigma Business Process Change Management Project Management See 3+     See less Education MS Graduate School of BusIness UCD Post Grad DBS,  Business Studies 1992  – 1993 University College Dublin BA,  Economics 1988  – 1991 MS Graduate School of BusIness UCD Post Grad DBS,  Business Studies 1992  – 1993 MS Graduate School of BusIness UCD Post Grad DBS,  Business Studies 1992  – 1993 MS Graduate School of BusIness UCD Post Grad DBS,  Business Studies 1992  – 1993 University College Dublin BA,  Economics 1988  – 1991 University College Dublin BA,  Economics 1988  – 1991 University College Dublin BA,  Economics 1988  – 1991 ", "Summary Back-Office, Intranet, Workflow, Reporting, Marketing Support Services, Business Intelligence, SQL Database Design and Architecture, CRM, Systems/Operations & Business Process Improvement, Branding Strategy, Classroom Training & Documentation Summary Back-Office, Intranet, Workflow, Reporting, Marketing Support Services, Business Intelligence, SQL Database Design and Architecture, CRM, Systems/Operations & Business Process Improvement, Branding Strategy, Classroom Training & Documentation Back-Office, Intranet, Workflow, Reporting, Marketing Support Services, Business Intelligence, SQL Database Design and Architecture, CRM, Systems/Operations & Business Process Improvement, Branding Strategy, Classroom Training & Documentation Back-Office, Intranet, Workflow, Reporting, Marketing Support Services, Business Intelligence, SQL Database Design and Architecture, CRM, Systems/Operations & Business Process Improvement, Branding Strategy, Classroom Training & Documentation Experience Marketing Strategist Electroprop September 2013  – Present (2 years) santa barbara, california area Electroprop (The Electric Propeller Company) manufactures high efficiency marine electric propulsion drives. http://www.electroprop.com Freelance Marketing Services Consultant Independent Consultant March 2009  – Present (6 years 6 months) santa barbara, california Provides affordable creative and digital marketing strategies to small businesses, non-profit organizations, start-ups and entrepreneurs. Designs and builds back-office business intelligence, workflow and reporting applications. Creates, configures and customizes software solutions, develops training materials and leads instruction sessions. Product Operations Specialist Kontera December 2012  –  February 2013  (3 months) san francisco, ca Troubleshooter and solution provider for online ad-serving products: \n \n- Built publisher and advertiser product demos for desktop and mobile using responsive web design practices (media queries css3, html5 and javascript) \n \n- Updated official Wordpress plugin to reflect online advertising product enhancements using Wordpress codex, php, jquery and javascript \n \n- Improved ability of account managers to service clients by providing detailed instructions on Wiki \n \n- Created test publishers and advertisements and configured settings for them to work, using debugging tools such as firebug, Charles, and Fiddler to troubleshoot and diagnose issues \n \n- Created SQL queries to generate ad-hoc and monthly performance reports Producer MRM Worldwide February 2011  –  June 2011  (5 months) Led branded digital and social platform production efforts for US Army recruiting campaigns. Notable projects include mobile-optimized Goarmy.com website and co-branded Facebook page with 20th Century Fox's \"X-Men: First Class\" exclusive content. Client Services Manager Ad Yatra September 2009  –  March 2010  (7 months) Ad Yatra is a digital agency that specializes in rich media production. \n \nNotable projects include Propecia and Isentress websites for Merck, the Samsung WOW Challenge with Ze Frank, and the Fragrance Foundation's One Mighty Drop campaign. Internet Project Manager Victoria's Secret September 2008  –  February 2009  (6 months) Member of the team that launched the Webby-nominated 2008 Victoria's Secret Fashion Show website, widget, and Facebook application. Technical Project Manager Creative Feed, Inc. November 2007  –  May 2008  (7 months) Provided technical leadership and expertise in digital production methodologies for boutique firm focused on creative and marketing services. Program Manager, Business Applications Shaklee September 2005  –  October 2006  (1 year 2 months) Oversaw special projects involving development of business-building web applications, e-commerce projects, guiding and directing team members, developing resource allocation plans, contributing to production of guidelines and procedures, and managing project schedules. Manager, Business Process Design Shaklee Corporation February 2003  –  September 2005  (2 years 8 months) Individually designed, coded, and managed a full suite of ASP-based intranet applications to meet needs of internal clients including Creative Services, Marketing, QA, Sales, and Field Support departments. Manager, Bonus Systems & Design/Sales Support Shaklee Corporation April 2001  –  February 2003  (1 year 11 months) Managed development, testing, and operation of commission system that paid out more than $2 million in bonuses monthly, while at the same time overseeing team of 10 sales support representatives that handled hundreds of field contacts daily. Project Manager, VoDSL Northpoint Communications May 2000  –  December 2000  (8 months) Oversaw design and implementation of Voice over DSL product while negotiating business requirements and timeline with marketing department. Implemented automated supply chain management for all stages of product marketing, installation and service. Project Manager Solutions Plus October 1998  –  April 2000  (1 year 7 months) Oversaw and reported embedded systems Y2K compliance and capital asset management projects for various private- and public-sector clients. Marketing Strategist Electroprop September 2013  – Present (2 years) santa barbara, california area Electroprop (The Electric Propeller Company) manufactures high efficiency marine electric propulsion drives. http://www.electroprop.com Marketing Strategist Electroprop September 2013  – Present (2 years) santa barbara, california area Electroprop (The Electric Propeller Company) manufactures high efficiency marine electric propulsion drives. http://www.electroprop.com Freelance Marketing Services Consultant Independent Consultant March 2009  – Present (6 years 6 months) santa barbara, california Provides affordable creative and digital marketing strategies to small businesses, non-profit organizations, start-ups and entrepreneurs. Designs and builds back-office business intelligence, workflow and reporting applications. Creates, configures and customizes software solutions, develops training materials and leads instruction sessions. Freelance Marketing Services Consultant Independent Consultant March 2009  – Present (6 years 6 months) santa barbara, california Provides affordable creative and digital marketing strategies to small businesses, non-profit organizations, start-ups and entrepreneurs. Designs and builds back-office business intelligence, workflow and reporting applications. Creates, configures and customizes software solutions, develops training materials and leads instruction sessions. Product Operations Specialist Kontera December 2012  –  February 2013  (3 months) san francisco, ca Troubleshooter and solution provider for online ad-serving products: \n \n- Built publisher and advertiser product demos for desktop and mobile using responsive web design practices (media queries css3, html5 and javascript) \n \n- Updated official Wordpress plugin to reflect online advertising product enhancements using Wordpress codex, php, jquery and javascript \n \n- Improved ability of account managers to service clients by providing detailed instructions on Wiki \n \n- Created test publishers and advertisements and configured settings for them to work, using debugging tools such as firebug, Charles, and Fiddler to troubleshoot and diagnose issues \n \n- Created SQL queries to generate ad-hoc and monthly performance reports Product Operations Specialist Kontera December 2012  –  February 2013  (3 months) san francisco, ca Troubleshooter and solution provider for online ad-serving products: \n \n- Built publisher and advertiser product demos for desktop and mobile using responsive web design practices (media queries css3, html5 and javascript) \n \n- Updated official Wordpress plugin to reflect online advertising product enhancements using Wordpress codex, php, jquery and javascript \n \n- Improved ability of account managers to service clients by providing detailed instructions on Wiki \n \n- Created test publishers and advertisements and configured settings for them to work, using debugging tools such as firebug, Charles, and Fiddler to troubleshoot and diagnose issues \n \n- Created SQL queries to generate ad-hoc and monthly performance reports Producer MRM Worldwide February 2011  –  June 2011  (5 months) Led branded digital and social platform production efforts for US Army recruiting campaigns. Notable projects include mobile-optimized Goarmy.com website and co-branded Facebook page with 20th Century Fox's \"X-Men: First Class\" exclusive content. Producer MRM Worldwide February 2011  –  June 2011  (5 months) Led branded digital and social platform production efforts for US Army recruiting campaigns. Notable projects include mobile-optimized Goarmy.com website and co-branded Facebook page with 20th Century Fox's \"X-Men: First Class\" exclusive content. Client Services Manager Ad Yatra September 2009  –  March 2010  (7 months) Ad Yatra is a digital agency that specializes in rich media production. \n \nNotable projects include Propecia and Isentress websites for Merck, the Samsung WOW Challenge with Ze Frank, and the Fragrance Foundation's One Mighty Drop campaign. Client Services Manager Ad Yatra September 2009  –  March 2010  (7 months) Ad Yatra is a digital agency that specializes in rich media production. \n \nNotable projects include Propecia and Isentress websites for Merck, the Samsung WOW Challenge with Ze Frank, and the Fragrance Foundation's One Mighty Drop campaign. Internet Project Manager Victoria's Secret September 2008  –  February 2009  (6 months) Member of the team that launched the Webby-nominated 2008 Victoria's Secret Fashion Show website, widget, and Facebook application. Internet Project Manager Victoria's Secret September 2008  –  February 2009  (6 months) Member of the team that launched the Webby-nominated 2008 Victoria's Secret Fashion Show website, widget, and Facebook application. Technical Project Manager Creative Feed, Inc. November 2007  –  May 2008  (7 months) Provided technical leadership and expertise in digital production methodologies for boutique firm focused on creative and marketing services. Technical Project Manager Creative Feed, Inc. November 2007  –  May 2008  (7 months) Provided technical leadership and expertise in digital production methodologies for boutique firm focused on creative and marketing services. Program Manager, Business Applications Shaklee September 2005  –  October 2006  (1 year 2 months) Oversaw special projects involving development of business-building web applications, e-commerce projects, guiding and directing team members, developing resource allocation plans, contributing to production of guidelines and procedures, and managing project schedules. Program Manager, Business Applications Shaklee September 2005  –  October 2006  (1 year 2 months) Oversaw special projects involving development of business-building web applications, e-commerce projects, guiding and directing team members, developing resource allocation plans, contributing to production of guidelines and procedures, and managing project schedules. Manager, Business Process Design Shaklee Corporation February 2003  –  September 2005  (2 years 8 months) Individually designed, coded, and managed a full suite of ASP-based intranet applications to meet needs of internal clients including Creative Services, Marketing, QA, Sales, and Field Support departments. Manager, Business Process Design Shaklee Corporation February 2003  –  September 2005  (2 years 8 months) Individually designed, coded, and managed a full suite of ASP-based intranet applications to meet needs of internal clients including Creative Services, Marketing, QA, Sales, and Field Support departments. Manager, Bonus Systems & Design/Sales Support Shaklee Corporation April 2001  –  February 2003  (1 year 11 months) Managed development, testing, and operation of commission system that paid out more than $2 million in bonuses monthly, while at the same time overseeing team of 10 sales support representatives that handled hundreds of field contacts daily. Manager, Bonus Systems & Design/Sales Support Shaklee Corporation April 2001  –  February 2003  (1 year 11 months) Managed development, testing, and operation of commission system that paid out more than $2 million in bonuses monthly, while at the same time overseeing team of 10 sales support representatives that handled hundreds of field contacts daily. Project Manager, VoDSL Northpoint Communications May 2000  –  December 2000  (8 months) Oversaw design and implementation of Voice over DSL product while negotiating business requirements and timeline with marketing department. Implemented automated supply chain management for all stages of product marketing, installation and service. Project Manager, VoDSL Northpoint Communications May 2000  –  December 2000  (8 months) Oversaw design and implementation of Voice over DSL product while negotiating business requirements and timeline with marketing department. Implemented automated supply chain management for all stages of product marketing, installation and service. Project Manager Solutions Plus October 1998  –  April 2000  (1 year 7 months) Oversaw and reported embedded systems Y2K compliance and capital asset management projects for various private- and public-sector clients. Project Manager Solutions Plus October 1998  –  April 2000  (1 year 7 months) Oversaw and reported embedded systems Y2K compliance and capital asset management projects for various private- and public-sector clients. Skills Ideation Concept Development Creative Strategy Collaborative Problem... Wireframing Creative Communication Idea Generation Creative Problem Solving New Product Ideation Problem Analysis Business Process... Information Architecture Concept Ideation Client Services Product Development Microsoft Dynamics Project Planning Digital Strategy Business Analysis Business Process Design Business Strategy Copy Editing HTML CSS ASP SQL Server Gimp Inkscape PowerPoint Excel Visual Basic JavaScript Web Strategy User Experience Cross-functional Team... Program Management Social Media Digital Marketing CRM Product Marketing Microsoft Excel Web Design Web Development Project Management WordPress Product Management Mobile Devices Wireframes See 33+     See less Skills  Ideation Concept Development Creative Strategy Collaborative Problem... Wireframing Creative Communication Idea Generation Creative Problem Solving New Product Ideation Problem Analysis Business Process... Information Architecture Concept Ideation Client Services Product Development Microsoft Dynamics Project Planning Digital Strategy Business Analysis Business Process Design Business Strategy Copy Editing HTML CSS ASP SQL Server Gimp Inkscape PowerPoint Excel Visual Basic JavaScript Web Strategy User Experience Cross-functional Team... Program Management Social Media Digital Marketing CRM Product Marketing Microsoft Excel Web Design Web Development Project Management WordPress Product Management Mobile Devices Wireframes See 33+     See less Ideation Concept Development Creative Strategy Collaborative Problem... Wireframing Creative Communication Idea Generation Creative Problem Solving New Product Ideation Problem Analysis Business Process... Information Architecture Concept Ideation Client Services Product Development Microsoft Dynamics Project Planning Digital Strategy Business Analysis Business Process Design Business Strategy Copy Editing HTML CSS ASP SQL Server Gimp Inkscape PowerPoint Excel Visual Basic JavaScript Web Strategy User Experience Cross-functional Team... Program Management Social Media Digital Marketing CRM Product Marketing Microsoft Excel Web Design Web Development Project Management WordPress Product Management Mobile Devices Wireframes See 33+     See less Ideation Concept Development Creative Strategy Collaborative Problem... Wireframing Creative Communication Idea Generation Creative Problem Solving New Product Ideation Problem Analysis Business Process... Information Architecture Concept Ideation Client Services Product Development Microsoft Dynamics Project Planning Digital Strategy Business Analysis Business Process Design Business Strategy Copy Editing HTML CSS ASP SQL Server Gimp Inkscape PowerPoint Excel Visual Basic JavaScript Web Strategy User Experience Cross-functional Team... Program Management Social Media Digital Marketing CRM Product Marketing Microsoft Excel Web Design Web Development Project Management WordPress Product Management Mobile Devices Wireframes See 33+     See less Education Drexel University BS,  Mechanical Engineering 1991  – 1996 Learned Mechanical Engineering Activities and Societies:  Pi Lambda Phi Mainland Regional High School Drexel University BS,  Mechanical Engineering 1991  – 1996 Learned Mechanical Engineering Activities and Societies:  Pi Lambda Phi Drexel University BS,  Mechanical Engineering 1991  – 1996 Learned Mechanical Engineering Activities and Societies:  Pi Lambda Phi Drexel University BS,  Mechanical Engineering 1991  – 1996 Learned Mechanical Engineering Activities and Societies:  Pi Lambda Phi Mainland Regional High School Mainland Regional High School Mainland Regional High School ", "Summary Professionally accredited instructional designer with demonstrated capabilities in project management and optimization, needs assessment, content management and the development of dynamic learning solutions at the management level. Summary Professionally accredited instructional designer with demonstrated capabilities in project management and optimization, needs assessment, content management and the development of dynamic learning solutions at the management level. Professionally accredited instructional designer with demonstrated capabilities in project management and optimization, needs assessment, content management and the development of dynamic learning solutions at the management level. Professionally accredited instructional designer with demonstrated capabilities in project management and optimization, needs assessment, content management and the development of dynamic learning solutions at the management level. Experience Senior Manager, Business Process Design and Delivery Bell December 2014  – Present (9 months) Effectively lead the Content Management, Training Design and Delivery, and Process Optimization teams across the Loyalty and Retention organization within Customer Operations. Learning and Development Manager Bell 2012  –  December 2014  (2 years) Toronto, Canada Area Single point of contact for all Customer Operations training for Bell Residential Services, Bell Mobility and Virgin Mobile. Manage operational and project stakeholders to support new project and product launches from conception to post delivery analysis. Training Design Manager Bell August 2008  –  June 2012  (3 years 11 months) Developed dynamic TSOA based training strategies and material using facilitator led, eLearning, and simulation based methods based on complex needs assessment and task analysis. Hiring and Training Delivery Manager Bell December 2007  –  August 2008  (9 months) Managed a core group of training specialists, from performance management to ongoing coaching and development while revisting the training delivery process through internal process optimization. Training Specialist Bell September 2006  –  December 2007  (1 year 4 months) Toronto Responsible for training customer operations on all aspects of Bell TV, including but not limited to, customer service call flow, billing, technical troubleshooting and sales, as well as as managing external site ramps. Senior Manager, Business Process Design and Delivery Bell December 2014  – Present (9 months) Effectively lead the Content Management, Training Design and Delivery, and Process Optimization teams across the Loyalty and Retention organization within Customer Operations. Senior Manager, Business Process Design and Delivery Bell December 2014  – Present (9 months) Effectively lead the Content Management, Training Design and Delivery, and Process Optimization teams across the Loyalty and Retention organization within Customer Operations. Learning and Development Manager Bell 2012  –  December 2014  (2 years) Toronto, Canada Area Single point of contact for all Customer Operations training for Bell Residential Services, Bell Mobility and Virgin Mobile. Manage operational and project stakeholders to support new project and product launches from conception to post delivery analysis. Learning and Development Manager Bell 2012  –  December 2014  (2 years) Toronto, Canada Area Single point of contact for all Customer Operations training for Bell Residential Services, Bell Mobility and Virgin Mobile. Manage operational and project stakeholders to support new project and product launches from conception to post delivery analysis. Training Design Manager Bell August 2008  –  June 2012  (3 years 11 months) Developed dynamic TSOA based training strategies and material using facilitator led, eLearning, and simulation based methods based on complex needs assessment and task analysis. Training Design Manager Bell August 2008  –  June 2012  (3 years 11 months) Developed dynamic TSOA based training strategies and material using facilitator led, eLearning, and simulation based methods based on complex needs assessment and task analysis. Hiring and Training Delivery Manager Bell December 2007  –  August 2008  (9 months) Managed a core group of training specialists, from performance management to ongoing coaching and development while revisting the training delivery process through internal process optimization. Hiring and Training Delivery Manager Bell December 2007  –  August 2008  (9 months) Managed a core group of training specialists, from performance management to ongoing coaching and development while revisting the training delivery process through internal process optimization. Training Specialist Bell September 2006  –  December 2007  (1 year 4 months) Toronto Responsible for training customer operations on all aspects of Bell TV, including but not limited to, customer service call flow, billing, technical troubleshooting and sales, as well as as managing external site ramps. Training Specialist Bell September 2006  –  December 2007  (1 year 4 months) Toronto Responsible for training customer operations on all aspects of Bell TV, including but not limited to, customer service call flow, billing, technical troubleshooting and sales, as well as as managing external site ramps. Languages   Skills Instructional Design Project Management E-Learning Cross-functional Team... Knowledge Management Training Needs Analysis Adult Learning Theory Impact Assessment Stakeholder Management Process Optimization Collaboration Solutions Skills  Instructional Design Project Management E-Learning Cross-functional Team... Knowledge Management Training Needs Analysis Adult Learning Theory Impact Assessment Stakeholder Management Process Optimization Collaboration Solutions Instructional Design Project Management E-Learning Cross-functional Team... Knowledge Management Training Needs Analysis Adult Learning Theory Impact Assessment Stakeholder Management Process Optimization Collaboration Solutions Instructional Design Project Management E-Learning Cross-functional Team... Knowledge Management Training Needs Analysis Adult Learning Theory Impact Assessment Stakeholder Management Process Optimization Collaboration Solutions Honors & Awards ", "Languages Spanish Spanish Spanish Skills Cross-functional Team... Product Development R&D Problem Solving Business Process... Management Program Management Six Sigma Project Management Medical Devices Strategy Process Engineering Engineering Manufacturing Strategic Planning Quality Assurance Leadership Supply Chain Management Quality System Analysis Product Launch Supply Chain Testing Training Data Analysis Product Management Analytics Budgets Organizational... Marketing Strategy Process Improvement Start-ups Marketing Competitive Analysis Vendor Management Engineering Management See 21+     See less Skills  Cross-functional Team... Product Development R&D Problem Solving Business Process... Management Program Management Six Sigma Project Management Medical Devices Strategy Process Engineering Engineering Manufacturing Strategic Planning Quality Assurance Leadership Supply Chain Management Quality System Analysis Product Launch Supply Chain Testing Training Data Analysis Product Management Analytics Budgets Organizational... Marketing Strategy Process Improvement Start-ups Marketing Competitive Analysis Vendor Management Engineering Management See 21+     See less Cross-functional Team... Product Development R&D Problem Solving Business Process... Management Program Management Six Sigma Project Management Medical Devices Strategy Process Engineering Engineering Manufacturing Strategic Planning Quality Assurance Leadership Supply Chain Management Quality System Analysis Product Launch Supply Chain Testing Training Data Analysis Product Management Analytics Budgets Organizational... Marketing Strategy Process Improvement Start-ups Marketing Competitive Analysis Vendor Management Engineering Management See 21+     See less Cross-functional Team... Product Development R&D Problem Solving Business Process... Management Program Management Six Sigma Project Management Medical Devices Strategy Process Engineering Engineering Manufacturing Strategic Planning Quality Assurance Leadership Supply Chain Management Quality System Analysis Product Launch Supply Chain Testing Training Data Analysis Product Management Analytics Budgets Organizational... Marketing Strategy Process Improvement Start-ups Marketing Competitive Analysis Vendor Management Engineering Management See 21+     See less ", "Skills Cloud Computing Program Management Enterprise Software SaaS Data Center Unix Architecture Governance SDLC Enterprise Architecture Integration IT Strategy Perl Business Process... Cross-functional Team... Vendor Management Business Architecture See 1+     See less Skills  Cloud Computing Program Management Enterprise Software SaaS Data Center Unix Architecture Governance SDLC Enterprise Architecture Integration IT Strategy Perl Business Process... Cross-functional Team... Vendor Management Business Architecture See 1+     See less Cloud Computing Program Management Enterprise Software SaaS Data Center Unix Architecture Governance SDLC Enterprise Architecture Integration IT Strategy Perl Business Process... Cross-functional Team... Vendor Management Business Architecture See 1+     See less Cloud Computing Program Management Enterprise Software SaaS Data Center Unix Architecture Governance SDLC Enterprise Architecture Integration IT Strategy Perl Business Process... Cross-functional Team... Vendor Management Business Architecture See 1+     See less ", "Experience Senior Manager - Business Process Design and Build Loblaw Companies Limited May 2012  – Present (3 years 4 months) Process Manager Capital One July 2011  –  December 2012  (1 year 6 months) Senior Manager, Process Improvement - Lean Retail Loblaw Companies Limited March 2007  –  June 2011  (4 years 4 months) Brampton, Ontario Engineering Analyst - Supply Chain Process Improvement Loblaw Companies Limited February 2006  –  March 2007  (1 year 2 months) Brampton, Ontario Senior Manager - Business Process Design and Build Loblaw Companies Limited May 2012  – Present (3 years 4 months) Senior Manager - Business Process Design and Build Loblaw Companies Limited May 2012  – Present (3 years 4 months) Process Manager Capital One July 2011  –  December 2012  (1 year 6 months) Process Manager Capital One July 2011  –  December 2012  (1 year 6 months) Senior Manager, Process Improvement - Lean Retail Loblaw Companies Limited March 2007  –  June 2011  (4 years 4 months) Brampton, Ontario Senior Manager, Process Improvement - Lean Retail Loblaw Companies Limited March 2007  –  June 2011  (4 years 4 months) Brampton, Ontario Engineering Analyst - Supply Chain Process Improvement Loblaw Companies Limited February 2006  –  March 2007  (1 year 2 months) Brampton, Ontario Engineering Analyst - Supply Chain Process Improvement Loblaw Companies Limited February 2006  –  March 2007  (1 year 2 months) Brampton, Ontario Education University of Windsor Bachelor of Applied Science,  Industrial Engineering 2001  – 2005 University of Windsor Bachelor of Applied Science,  Industrial Engineering 2001  – 2005 University of Windsor Bachelor of Applied Science,  Industrial Engineering 2001  – 2005 University of Windsor Bachelor of Applied Science,  Industrial Engineering 2001  – 2005 ", "Summary Evans has worked for such major players in the IT industry as General Electric, IBM, and Covad Communications. His many job titles include: Field Service Representative, Help Desk Technician, Network Engineer, Network Monitoring Specialist and many more. \n \nEvans made the jump into management in 1998 when he became Director of Technical Support for Word Records, a division of Gaylord Entertainment. Since then, he has been a Senior Manager of Network Activations for Bluestar Communications, a General Manager for Vivo Communications, a Manager with ISDN.Net, a Senior IT Advisor with Metropolitan Government of Nashville, TN, and more. \n \nIn 2001, Evans was introduced to professional project management and was drawn to the organization and efficiency of the PMBOK methodology. Since then, he has been involved in projects in roles ranging from Executive Sponsor to Project Manager and has been pursuing project management as his primary career role ever since. Recently Evans became certified in IT Infrastructure Library (ITIL) Foundations and received his Project Management Professional (PMP) certification from the Project Management Institute. \n \nMost recently, Evans has worked in the ITSM/ITAM arena as a Senior Consultant for Numara Software, BMC Software, and RightStar Systems, Business Analyst for BMC, Director of Professional Services for Consultis of Tampa. \n \nEvans received his BS degree from Middle Tennessee State University and is currently employed as Director of Service and Support for EasyVista, a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise. Specialties:Senior level manager, 40+ employees. Project manager, business process design. Start up, telecom, computer hardware, Internet. EDI, Sterling Commerce Gentran. Helpdesk management, technical. A+ & Novell Certified. Software experience. Win & Unix networking. 3270, 5250, TCP/IP, DNS, Cisco, Lucent. VisualBASIC, Access, SQL, ColdFusion, HTML, C, Unix, Perl. Sales, sales management. Own ISP, web hosting, site design, email solutions, spam and virus filtering, custom programming, IT consulting.. Summary Evans has worked for such major players in the IT industry as General Electric, IBM, and Covad Communications. His many job titles include: Field Service Representative, Help Desk Technician, Network Engineer, Network Monitoring Specialist and many more. \n \nEvans made the jump into management in 1998 when he became Director of Technical Support for Word Records, a division of Gaylord Entertainment. Since then, he has been a Senior Manager of Network Activations for Bluestar Communications, a General Manager for Vivo Communications, a Manager with ISDN.Net, a Senior IT Advisor with Metropolitan Government of Nashville, TN, and more. \n \nIn 2001, Evans was introduced to professional project management and was drawn to the organization and efficiency of the PMBOK methodology. Since then, he has been involved in projects in roles ranging from Executive Sponsor to Project Manager and has been pursuing project management as his primary career role ever since. Recently Evans became certified in IT Infrastructure Library (ITIL) Foundations and received his Project Management Professional (PMP) certification from the Project Management Institute. \n \nMost recently, Evans has worked in the ITSM/ITAM arena as a Senior Consultant for Numara Software, BMC Software, and RightStar Systems, Business Analyst for BMC, Director of Professional Services for Consultis of Tampa. \n \nEvans received his BS degree from Middle Tennessee State University and is currently employed as Director of Service and Support for EasyVista, a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise. Specialties:Senior level manager, 40+ employees. Project manager, business process design. Start up, telecom, computer hardware, Internet. EDI, Sterling Commerce Gentran. Helpdesk management, technical. A+ & Novell Certified. Software experience. Win & Unix networking. 3270, 5250, TCP/IP, DNS, Cisco, Lucent. VisualBASIC, Access, SQL, ColdFusion, HTML, C, Unix, Perl. Sales, sales management. Own ISP, web hosting, site design, email solutions, spam and virus filtering, custom programming, IT consulting.. Evans has worked for such major players in the IT industry as General Electric, IBM, and Covad Communications. His many job titles include: Field Service Representative, Help Desk Technician, Network Engineer, Network Monitoring Specialist and many more. \n \nEvans made the jump into management in 1998 when he became Director of Technical Support for Word Records, a division of Gaylord Entertainment. Since then, he has been a Senior Manager of Network Activations for Bluestar Communications, a General Manager for Vivo Communications, a Manager with ISDN.Net, a Senior IT Advisor with Metropolitan Government of Nashville, TN, and more. \n \nIn 2001, Evans was introduced to professional project management and was drawn to the organization and efficiency of the PMBOK methodology. Since then, he has been involved in projects in roles ranging from Executive Sponsor to Project Manager and has been pursuing project management as his primary career role ever since. Recently Evans became certified in IT Infrastructure Library (ITIL) Foundations and received his Project Management Professional (PMP) certification from the Project Management Institute. \n \nMost recently, Evans has worked in the ITSM/ITAM arena as a Senior Consultant for Numara Software, BMC Software, and RightStar Systems, Business Analyst for BMC, Director of Professional Services for Consultis of Tampa. \n \nEvans received his BS degree from Middle Tennessee State University and is currently employed as Director of Service and Support for EasyVista, a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise. Specialties:Senior level manager, 40+ employees. Project manager, business process design. Start up, telecom, computer hardware, Internet. EDI, Sterling Commerce Gentran. Helpdesk management, technical. A+ & Novell Certified. Software experience. Win & Unix networking. 3270, 5250, TCP/IP, DNS, Cisco, Lucent. VisualBASIC, Access, SQL, ColdFusion, HTML, C, Unix, Perl. Sales, sales management. Own ISP, web hosting, site design, email solutions, spam and virus filtering, custom programming, IT consulting.. Evans has worked for such major players in the IT industry as General Electric, IBM, and Covad Communications. His many job titles include: Field Service Representative, Help Desk Technician, Network Engineer, Network Monitoring Specialist and many more. \n \nEvans made the jump into management in 1998 when he became Director of Technical Support for Word Records, a division of Gaylord Entertainment. Since then, he has been a Senior Manager of Network Activations for Bluestar Communications, a General Manager for Vivo Communications, a Manager with ISDN.Net, a Senior IT Advisor with Metropolitan Government of Nashville, TN, and more. \n \nIn 2001, Evans was introduced to professional project management and was drawn to the organization and efficiency of the PMBOK methodology. Since then, he has been involved in projects in roles ranging from Executive Sponsor to Project Manager and has been pursuing project management as his primary career role ever since. Recently Evans became certified in IT Infrastructure Library (ITIL) Foundations and received his Project Management Professional (PMP) certification from the Project Management Institute. \n \nMost recently, Evans has worked in the ITSM/ITAM arena as a Senior Consultant for Numara Software, BMC Software, and RightStar Systems, Business Analyst for BMC, Director of Professional Services for Consultis of Tampa. \n \nEvans received his BS degree from Middle Tennessee State University and is currently employed as Director of Service and Support for EasyVista, a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise. Specialties:Senior level manager, 40+ employees. Project manager, business process design. Start up, telecom, computer hardware, Internet. EDI, Sterling Commerce Gentran. Helpdesk management, technical. A+ & Novell Certified. Software experience. Win & Unix networking. 3270, 5250, TCP/IP, DNS, Cisco, Lucent. VisualBASIC, Access, SQL, ColdFusion, HTML, C, Unix, Perl. Sales, sales management. Own ISP, web hosting, site design, email solutions, spam and virus filtering, custom programming, IT consulting.. Experience Director Service & Support (North America) EasyVista January 2014  – Present (1 year 8 months) EasyVista Inc., a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise, has more than 20 years of experience as a pure player in the IT Management space. The company has a direct presence around the world with offices in the US, Canada, France, UK, Italy, Spain and Portugal. EasyVista is quoted on Alternext – EuroNext Paris. EasyVista recognizes that IT is changing. The services expected from IT are no longer standard and the supporting platforms are no longer exclusively in the IT-basement; they are in the cloud, outsourced and mobile. Anytime, Any Device, Anywhere – This is NEW IT. Learn more about it today! http://www.easyvista.com Owner Martek.Net December 1989  – Present (25 years 9 months) Over the years, Martek has grown from a small computer hardware repair shop into a one stop shop for all of your technology needs. We can help you design your network, supply you with fully configured servers and ready to run workstations, take care of all of your cabling needs, setup email at your site or on our servers, provide your internet connectivity, create your web site, program your own custom applications, and support all of the above quickly, conveniently and at a reasonable price. \n \nMARTEK COMPUTER COMPANY \nHardware/Software Sales \nNetworking Design/Install & Service \nComputer Repair \nMessaging Systems (Email - in house/outsourced) \n \nMARTEK.NET \nWeb Connections \nWeb Hosting \nWeb Site Design \nMessaging Systems (Email - in house/outsourced) \n \nMARTEKWARE \nCustom Programming \nDatabase Design \nE-Commerce/Web Database Work \n \nPlease contact us if we can be of assistance. Director US Sales Engineering EasyVista January 2014  –  January 2014  (1 month) EasyVista Inc., a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise, has more than 20 years of experience as a pure player in the IT Management space. The company has a direct presence around the world with offices in the US, Canada, France, UK, Italy, Spain and Portugal. EasyVista is quoted on Alternext – EuroNext Paris. EasyVista recognizes that IT is changing. The services expected from IT are no longer standard and the supporting platforms are no longer exclusively in the IT-basement; they are in the cloud, outsourced and mobile. Anytime, Any Device, Anywhere – This is NEW IT. Learn more about it today! http://www.easyvista.com Senior Consultant RightStar Systems October 2012  –  December 2013  (1 year 3 months) Nashville, TN Senior Consultant delivering consulting/assessment, education, implementation, and support engagements related to IT Service Management (ITSM), IT Infrastructure Library (ITIL), BMC FootPrints Service Core, BMC FootPrints Asset Core, Incident Management, Service Request Management, Problem Management, Change Management, & Configuration Management. Business Systems Analyst BMC Software March 2012  –  October 2012  (8 months) Nashville, TN Business Systems Analyst in the Professional Services group at BMC Software. Director of Professional Services Consultis of Tampa September 2009  –  March 2012  (2 years 7 months) Strategic Consulting, including business process & service desk strategy development using Numara FootPrints and Numara Asset Management Platform (Numara AMP). Senior Consultant BMC Software September 2009  –  March 2012  (2 years 7 months) Evans Martin is a Senior Consultant for BMC Software Professional Services. Evans has worked \nfor major Fortune 500 companies in the IT industry and has held titles such as Director of Technical Support, Senior \nManager of Network Activations, and Senior IT Advisor. Evans is certified in IT Infrastructure Library (ITIL) Foundations v2 \nand has received his Project Management Professional (PMP) certification from the Project Management Institute. Evans \nis pleased to be bringing this wealth of industry knowledge and experience to BMC Software’s award winning ITIL \ncompatible product lines. Project Manager Ciber August 2007  –  December 2008  (1 year 5 months) I was a project manager and was employeed by Ciber, Inc. and contracted to The State of Tennessee. I functioned as both a business analyst and project manager on large FileNet ECM implementations for many State agencies. Manager Network Activations Cybera, Inc. 2007  –  2007  (less than a year) WAN Analyst Metropolitan Government of Nashville, TN & Davidson County September 2004  –  August 2006  (2 years) Cisco network maintenance, design & monitoring. Departmental website design and maintenance. Solar Winds SNMP monitoring expert. Database design & maintenance for internal knowledge base & documentation. Project management & work plan design & maintenance. Jack of all trades. Project Manager ISDN.Net 2001  –  2002  (1 year) Senior Manager Bluestar Communications 1999  –  2002  (3 years) General Manager Vivo Communications 2001  –  2001  (less than a year) Senior Manager Covad 2001  –  2001  (less than a year) EDI Coordinator Gaylord Entertainment 1997  –  1999  (2 years) Contractor Metro Information Services 1997  –  1998  (1 year) Field Service Representative General Electric Computer Service 1992  –  1995  (3 years) Field Service Representative General Electric 1992  –  1995  (3 years) Director Service & Support (North America) EasyVista January 2014  – Present (1 year 8 months) EasyVista Inc., a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise, has more than 20 years of experience as a pure player in the IT Management space. The company has a direct presence around the world with offices in the US, Canada, France, UK, Italy, Spain and Portugal. EasyVista is quoted on Alternext – EuroNext Paris. EasyVista recognizes that IT is changing. The services expected from IT are no longer standard and the supporting platforms are no longer exclusively in the IT-basement; they are in the cloud, outsourced and mobile. Anytime, Any Device, Anywhere – This is NEW IT. Learn more about it today! http://www.easyvista.com Director Service & Support (North America) EasyVista January 2014  – Present (1 year 8 months) EasyVista Inc., a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise, has more than 20 years of experience as a pure player in the IT Management space. The company has a direct presence around the world with offices in the US, Canada, France, UK, Italy, Spain and Portugal. EasyVista is quoted on Alternext – EuroNext Paris. EasyVista recognizes that IT is changing. The services expected from IT are no longer standard and the supporting platforms are no longer exclusively in the IT-basement; they are in the cloud, outsourced and mobile. Anytime, Any Device, Anywhere – This is NEW IT. Learn more about it today! http://www.easyvista.com Owner Martek.Net December 1989  – Present (25 years 9 months) Over the years, Martek has grown from a small computer hardware repair shop into a one stop shop for all of your technology needs. We can help you design your network, supply you with fully configured servers and ready to run workstations, take care of all of your cabling needs, setup email at your site or on our servers, provide your internet connectivity, create your web site, program your own custom applications, and support all of the above quickly, conveniently and at a reasonable price. \n \nMARTEK COMPUTER COMPANY \nHardware/Software Sales \nNetworking Design/Install & Service \nComputer Repair \nMessaging Systems (Email - in house/outsourced) \n \nMARTEK.NET \nWeb Connections \nWeb Hosting \nWeb Site Design \nMessaging Systems (Email - in house/outsourced) \n \nMARTEKWARE \nCustom Programming \nDatabase Design \nE-Commerce/Web Database Work \n \nPlease contact us if we can be of assistance. Owner Martek.Net December 1989  – Present (25 years 9 months) Over the years, Martek has grown from a small computer hardware repair shop into a one stop shop for all of your technology needs. We can help you design your network, supply you with fully configured servers and ready to run workstations, take care of all of your cabling needs, setup email at your site or on our servers, provide your internet connectivity, create your web site, program your own custom applications, and support all of the above quickly, conveniently and at a reasonable price. \n \nMARTEK COMPUTER COMPANY \nHardware/Software Sales \nNetworking Design/Install & Service \nComputer Repair \nMessaging Systems (Email - in house/outsourced) \n \nMARTEK.NET \nWeb Connections \nWeb Hosting \nWeb Site Design \nMessaging Systems (Email - in house/outsourced) \n \nMARTEKWARE \nCustom Programming \nDatabase Design \nE-Commerce/Web Database Work \n \nPlease contact us if we can be of assistance. Director US Sales Engineering EasyVista January 2014  –  January 2014  (1 month) EasyVista Inc., a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise, has more than 20 years of experience as a pure player in the IT Management space. The company has a direct presence around the world with offices in the US, Canada, France, UK, Italy, Spain and Portugal. EasyVista is quoted on Alternext – EuroNext Paris. EasyVista recognizes that IT is changing. The services expected from IT are no longer standard and the supporting platforms are no longer exclusively in the IT-basement; they are in the cloud, outsourced and mobile. Anytime, Any Device, Anywhere – This is NEW IT. Learn more about it today! http://www.easyvista.com Director US Sales Engineering EasyVista January 2014  –  January 2014  (1 month) EasyVista Inc., a leading, global provider of cloud based IT Service Management, Asset Lifecycle Management, and Organizational Service Management solutions for the large enterprise, has more than 20 years of experience as a pure player in the IT Management space. The company has a direct presence around the world with offices in the US, Canada, France, UK, Italy, Spain and Portugal. EasyVista is quoted on Alternext – EuroNext Paris. EasyVista recognizes that IT is changing. The services expected from IT are no longer standard and the supporting platforms are no longer exclusively in the IT-basement; they are in the cloud, outsourced and mobile. Anytime, Any Device, Anywhere – This is NEW IT. Learn more about it today! http://www.easyvista.com Senior Consultant RightStar Systems October 2012  –  December 2013  (1 year 3 months) Nashville, TN Senior Consultant delivering consulting/assessment, education, implementation, and support engagements related to IT Service Management (ITSM), IT Infrastructure Library (ITIL), BMC FootPrints Service Core, BMC FootPrints Asset Core, Incident Management, Service Request Management, Problem Management, Change Management, & Configuration Management. Senior Consultant RightStar Systems October 2012  –  December 2013  (1 year 3 months) Nashville, TN Senior Consultant delivering consulting/assessment, education, implementation, and support engagements related to IT Service Management (ITSM), IT Infrastructure Library (ITIL), BMC FootPrints Service Core, BMC FootPrints Asset Core, Incident Management, Service Request Management, Problem Management, Change Management, & Configuration Management. Business Systems Analyst BMC Software March 2012  –  October 2012  (8 months) Nashville, TN Business Systems Analyst in the Professional Services group at BMC Software. Business Systems Analyst BMC Software March 2012  –  October 2012  (8 months) Nashville, TN Business Systems Analyst in the Professional Services group at BMC Software. Director of Professional Services Consultis of Tampa September 2009  –  March 2012  (2 years 7 months) Strategic Consulting, including business process & service desk strategy development using Numara FootPrints and Numara Asset Management Platform (Numara AMP). Director of Professional Services Consultis of Tampa September 2009  –  March 2012  (2 years 7 months) Strategic Consulting, including business process & service desk strategy development using Numara FootPrints and Numara Asset Management Platform (Numara AMP). Senior Consultant BMC Software September 2009  –  March 2012  (2 years 7 months) Evans Martin is a Senior Consultant for BMC Software Professional Services. Evans has worked \nfor major Fortune 500 companies in the IT industry and has held titles such as Director of Technical Support, Senior \nManager of Network Activations, and Senior IT Advisor. Evans is certified in IT Infrastructure Library (ITIL) Foundations v2 \nand has received his Project Management Professional (PMP) certification from the Project Management Institute. Evans \nis pleased to be bringing this wealth of industry knowledge and experience to BMC Software’s award winning ITIL \ncompatible product lines. Senior Consultant BMC Software September 2009  –  March 2012  (2 years 7 months) Evans Martin is a Senior Consultant for BMC Software Professional Services. Evans has worked \nfor major Fortune 500 companies in the IT industry and has held titles such as Director of Technical Support, Senior \nManager of Network Activations, and Senior IT Advisor. Evans is certified in IT Infrastructure Library (ITIL) Foundations v2 \nand has received his Project Management Professional (PMP) certification from the Project Management Institute. Evans \nis pleased to be bringing this wealth of industry knowledge and experience to BMC Software’s award winning ITIL \ncompatible product lines. Project Manager Ciber August 2007  –  December 2008  (1 year 5 months) I was a project manager and was employeed by Ciber, Inc. and contracted to The State of Tennessee. I functioned as both a business analyst and project manager on large FileNet ECM implementations for many State agencies. Project Manager Ciber August 2007  –  December 2008  (1 year 5 months) I was a project manager and was employeed by Ciber, Inc. and contracted to The State of Tennessee. I functioned as both a business analyst and project manager on large FileNet ECM implementations for many State agencies. Manager Network Activations Cybera, Inc. 2007  –  2007  (less than a year) Manager Network Activations Cybera, Inc. 2007  –  2007  (less than a year) WAN Analyst Metropolitan Government of Nashville, TN & Davidson County September 2004  –  August 2006  (2 years) Cisco network maintenance, design & monitoring. Departmental website design and maintenance. Solar Winds SNMP monitoring expert. Database design & maintenance for internal knowledge base & documentation. Project management & work plan design & maintenance. Jack of all trades. WAN Analyst Metropolitan Government of Nashville, TN & Davidson County September 2004  –  August 2006  (2 years) Cisco network maintenance, design & monitoring. Departmental website design and maintenance. Solar Winds SNMP monitoring expert. Database design & maintenance for internal knowledge base & documentation. Project management & work plan design & maintenance. Jack of all trades. Project Manager ISDN.Net 2001  –  2002  (1 year) Project Manager ISDN.Net 2001  –  2002  (1 year) Senior Manager Bluestar Communications 1999  –  2002  (3 years) Senior Manager Bluestar Communications 1999  –  2002  (3 years) General Manager Vivo Communications 2001  –  2001  (less than a year) General Manager Vivo Communications 2001  –  2001  (less than a year) Senior Manager Covad 2001  –  2001  (less than a year) Senior Manager Covad 2001  –  2001  (less than a year) EDI Coordinator Gaylord Entertainment 1997  –  1999  (2 years) EDI Coordinator Gaylord Entertainment 1997  –  1999  (2 years) Contractor Metro Information Services 1997  –  1998  (1 year) Contractor Metro Information Services 1997  –  1998  (1 year) Field Service Representative General Electric Computer Service 1992  –  1995  (3 years) Field Service Representative General Electric Computer Service 1992  –  1995  (3 years) Field Service Representative General Electric 1992  –  1995  (3 years) Field Service Representative General Electric 1992  –  1995  (3 years) Skills SQL Unix Telecommunications Consulting Cisco Technologies Business Analysis Access ITIL Project Management Servers DNS Windows TCP/IP PMP BMC FootPrints BMC Asset Core Professional Services Cloud Computing Management Networking Help Desk Support Technical Support Disaster Recovery Microsoft SQL Server Integration Enterprise Software IT Service Management Enterprise Architecture Databases Security Computer Hardware IT Management Business Process SaaS Virtualization Service Desk Incident Management Data Center SharePoint Change Management VMware Information Technology Vendor Management Windows Server IT Operations Active Directory System Administration Software Documentation Business Intelligence SDLC See 35+     See less Skills  SQL Unix Telecommunications Consulting Cisco Technologies Business Analysis Access ITIL Project Management Servers DNS Windows TCP/IP PMP BMC FootPrints BMC Asset Core Professional Services Cloud Computing Management Networking Help Desk Support Technical Support Disaster Recovery Microsoft SQL Server Integration Enterprise Software IT Service Management Enterprise Architecture Databases Security Computer Hardware IT Management Business Process SaaS Virtualization Service Desk Incident Management Data Center SharePoint Change Management VMware Information Technology Vendor Management Windows Server IT Operations Active Directory System Administration Software Documentation Business Intelligence SDLC See 35+     See less SQL Unix Telecommunications Consulting Cisco Technologies Business Analysis Access ITIL Project Management Servers DNS Windows TCP/IP PMP BMC FootPrints BMC Asset Core Professional Services Cloud Computing Management Networking Help Desk Support Technical Support Disaster Recovery Microsoft SQL Server Integration Enterprise Software IT Service Management Enterprise Architecture Databases Security Computer Hardware IT Management Business Process SaaS Virtualization Service Desk Incident Management Data Center SharePoint Change Management VMware Information Technology Vendor Management Windows Server IT Operations Active Directory System Administration Software Documentation Business Intelligence SDLC See 35+     See less SQL Unix Telecommunications Consulting Cisco Technologies Business Analysis Access ITIL Project Management Servers DNS Windows TCP/IP PMP BMC FootPrints BMC Asset Core Professional Services Cloud Computing Management Networking Help Desk Support Technical Support Disaster Recovery Microsoft SQL Server Integration Enterprise Software IT Service Management Enterprise Architecture Databases Security Computer Hardware IT Management Business Process SaaS Virtualization Service Desk Incident Management Data Center SharePoint Change Management VMware Information Technology Vendor Management Windows Server IT Operations Active Directory System Administration Software Documentation Business Intelligence SDLC See 35+     See less Education Middle Tennessee State University BS,  Recording Industry Management August 1987  – December 2003 Middle Tennessee State University BS,  Recording Industry Management August 1987  – December 2003 Middle Tennessee State University BS,  Recording Industry Management August 1987  – December 2003 Middle Tennessee State University BS,  Recording Industry Management August 1987  – December 2003 Honors & Awards Additional Honors & Awards Project Management Professional (PMP) \nPMI \nPMI Nashville \nITIL Foundations Certified Additional Honors & Awards Project Management Professional (PMP) \nPMI \nPMI Nashville \nITIL Foundations Certified Additional Honors & Awards Project Management Professional (PMP) \nPMI \nPMI Nashville \nITIL Foundations Certified Additional Honors & Awards Project Management Professional (PMP) \nPMI \nPMI Nashville \nITIL Foundations Certified "]}