{"position": "Business Development Manager", "company": "Intel Corporation", "profiles": ["Skills ITIL Certified COBIT Data Center Cloud Computing IaaS Product Marketing IT Service Management IT Service Delivery Team Building Team Leadership Team Management Distributed Team... IT Management ITIL Product Management Operating Systems Telecommunications IT Outsourcing Infrastructure Pre-sales VMware E-commerce Virtualization DOS Managed Services Disaster Recovery VoIP PMP PMO IT Operations Business Intelligence PMI Cisco Technologies Firewalls IP Outsourcing Service Delivery Service Management IT Strategy Storage Network Design Solution Architecture Network Architecture Security Network Security HP See 31+     See less Skills  ITIL Certified COBIT Data Center Cloud Computing IaaS Product Marketing IT Service Management IT Service Delivery Team Building Team Leadership Team Management Distributed Team... IT Management ITIL Product Management Operating Systems Telecommunications IT Outsourcing Infrastructure Pre-sales VMware E-commerce Virtualization DOS Managed Services Disaster Recovery VoIP PMP PMO IT Operations Business Intelligence PMI Cisco Technologies Firewalls IP Outsourcing Service Delivery Service Management IT Strategy Storage Network Design Solution Architecture Network Architecture Security Network Security HP See 31+     See less ITIL Certified COBIT Data Center Cloud Computing IaaS Product Marketing IT Service Management IT Service Delivery Team Building Team Leadership Team Management Distributed Team... IT Management ITIL Product Management Operating Systems Telecommunications IT Outsourcing Infrastructure Pre-sales VMware E-commerce Virtualization DOS Managed Services Disaster Recovery VoIP PMP PMO IT Operations Business Intelligence PMI Cisco Technologies Firewalls IP Outsourcing Service Delivery Service Management IT Strategy Storage Network Design Solution Architecture Network Architecture Security Network Security HP See 31+     See less ITIL Certified COBIT Data Center Cloud Computing IaaS Product Marketing IT Service Management IT Service Delivery Team Building Team Leadership Team Management Distributed Team... IT Management ITIL Product Management Operating Systems Telecommunications IT Outsourcing Infrastructure Pre-sales VMware E-commerce Virtualization DOS Managed Services Disaster Recovery VoIP PMP PMO IT Operations Business Intelligence PMI Cisco Technologies Firewalls IP Outsourcing Service Delivery Service Management IT Strategy Storage Network Design Solution Architecture Network Architecture Security Network Security HP See 31+     See less ", "Summary Successful track record of growing business revenues and market segment share for new products and solutions. My leadership style is to focus on developmental coaching in conjunction with hands on experience to achieve sustainable business results.  \n \n18 yrs experience of Leadership and Management in the Asia Pacific Region. Develop business strategies for the practical adoption of innovative solutions in ERP, CRM and Supply Chain through to Multimedia Based Learning Management Systems. Sydney Australia is my base of operations. \n \nBusiness Goal - To lead a business from $5m to $100m in the next years. \n \nSpecialties: Business Leadership, Executive Coaching, Change Management, Technology Strategy, Market Share Growth. Summary Successful track record of growing business revenues and market segment share for new products and solutions. My leadership style is to focus on developmental coaching in conjunction with hands on experience to achieve sustainable business results.  \n \n18 yrs experience of Leadership and Management in the Asia Pacific Region. Develop business strategies for the practical adoption of innovative solutions in ERP, CRM and Supply Chain through to Multimedia Based Learning Management Systems. Sydney Australia is my base of operations. \n \nBusiness Goal - To lead a business from $5m to $100m in the next years. \n \nSpecialties: Business Leadership, Executive Coaching, Change Management, Technology Strategy, Market Share Growth. Successful track record of growing business revenues and market segment share for new products and solutions. My leadership style is to focus on developmental coaching in conjunction with hands on experience to achieve sustainable business results.  \n \n18 yrs experience of Leadership and Management in the Asia Pacific Region. Develop business strategies for the practical adoption of innovative solutions in ERP, CRM and Supply Chain through to Multimedia Based Learning Management Systems. Sydney Australia is my base of operations. \n \nBusiness Goal - To lead a business from $5m to $100m in the next years. \n \nSpecialties: Business Leadership, Executive Coaching, Change Management, Technology Strategy, Market Share Growth. Successful track record of growing business revenues and market segment share for new products and solutions. My leadership style is to focus on developmental coaching in conjunction with hands on experience to achieve sustainable business results.  \n \n18 yrs experience of Leadership and Management in the Asia Pacific Region. Develop business strategies for the practical adoption of innovative solutions in ERP, CRM and Supply Chain through to Multimedia Based Learning Management Systems. Sydney Australia is my base of operations. \n \nBusiness Goal - To lead a business from $5m to $100m in the next years. \n \nSpecialties: Business Leadership, Executive Coaching, Change Management, Technology Strategy, Market Share Growth. Experience Aus/NZ Tablet Category Manager Intel Corporation January 2014  – Present (1 year 8 months) To own the Strategy Development and Channel to Market execution plans that grow the penetration of Intel-based tablets in Australia and New Zealand. The critical outcome is developing the tablet category through all levels of our customer base, from hardware manufacturers who are increasingly opting for Intel processors inside their tablet designs, through large format retailers and in to our channel reseller base and key end-user customers. Executive - Digital Economy Enablement Intel Corporation September 2010  – Present (5 years) The scope of this role is to work with businesses and the public sector to identify and act on opportunities arising from Australia’s new National Broadband Network. He leads the company’s digital economy initiatives in this country. Aus/NZ Segment Manager - Mobility Devices Intel Corporation October 2002  – Present (12 years 11 months) ANZ Group Manager, Enterprise Business Development Intel Corporation November 2006  –  September 2010  (3 years 11 months) In his role, Corey is responsible for establishing rapid time to adoption of Intel standards-based computing technology, with a particular focus in the Top 100 of Enterprises and Government agencies. The Enterprise Solutions team maintains strategic relationships with these customers to ensure they realise the full benefits of Intel-based solutions in the enterprise environment. Financial Services Industry Business Development Manager Intel Corporation December 2004  –  November 2006  (2 years) Retail Industry Business Development Manager Intel Corporation July 2003  –  December 2004  (1 year 6 months) Business Development Manager, High Performance Computing Intel Corporation October 2002  –  July 2003  (10 months) Commerical Industry Manager Sun Microsystems September 2000  –  August 2002  (2 years) Asia Pacific Regional Manager NETg (Harcourt Brace) March 1998  –  August 2000  (2 years 6 months) Supply Chain Senior Acount Executive i2 Technologies July 1996  –  March 1998  (1 year 9 months) Manufacturing Industry Account Executive J.D. Edwards & Co February 1994  –  July 1996  (2 years 6 months) Open Systems Division Manager Stott & Hoare (IBM VAR) March 1988  –  December 1993  (5 years 10 months) Aus/NZ Tablet Category Manager Intel Corporation January 2014  – Present (1 year 8 months) To own the Strategy Development and Channel to Market execution plans that grow the penetration of Intel-based tablets in Australia and New Zealand. The critical outcome is developing the tablet category through all levels of our customer base, from hardware manufacturers who are increasingly opting for Intel processors inside their tablet designs, through large format retailers and in to our channel reseller base and key end-user customers. Aus/NZ Tablet Category Manager Intel Corporation January 2014  – Present (1 year 8 months) To own the Strategy Development and Channel to Market execution plans that grow the penetration of Intel-based tablets in Australia and New Zealand. The critical outcome is developing the tablet category through all levels of our customer base, from hardware manufacturers who are increasingly opting for Intel processors inside their tablet designs, through large format retailers and in to our channel reseller base and key end-user customers. Executive - Digital Economy Enablement Intel Corporation September 2010  – Present (5 years) The scope of this role is to work with businesses and the public sector to identify and act on opportunities arising from Australia’s new National Broadband Network. He leads the company’s digital economy initiatives in this country. Executive - Digital Economy Enablement Intel Corporation September 2010  – Present (5 years) The scope of this role is to work with businesses and the public sector to identify and act on opportunities arising from Australia’s new National Broadband Network. He leads the company’s digital economy initiatives in this country. Aus/NZ Segment Manager - Mobility Devices Intel Corporation October 2002  – Present (12 years 11 months) Aus/NZ Segment Manager - Mobility Devices Intel Corporation October 2002  – Present (12 years 11 months) ANZ Group Manager, Enterprise Business Development Intel Corporation November 2006  –  September 2010  (3 years 11 months) In his role, Corey is responsible for establishing rapid time to adoption of Intel standards-based computing technology, with a particular focus in the Top 100 of Enterprises and Government agencies. The Enterprise Solutions team maintains strategic relationships with these customers to ensure they realise the full benefits of Intel-based solutions in the enterprise environment. ANZ Group Manager, Enterprise Business Development Intel Corporation November 2006  –  September 2010  (3 years 11 months) In his role, Corey is responsible for establishing rapid time to adoption of Intel standards-based computing technology, with a particular focus in the Top 100 of Enterprises and Government agencies. The Enterprise Solutions team maintains strategic relationships with these customers to ensure they realise the full benefits of Intel-based solutions in the enterprise environment. Financial Services Industry Business Development Manager Intel Corporation December 2004  –  November 2006  (2 years) Financial Services Industry Business Development Manager Intel Corporation December 2004  –  November 2006  (2 years) Retail Industry Business Development Manager Intel Corporation July 2003  –  December 2004  (1 year 6 months) Retail Industry Business Development Manager Intel Corporation July 2003  –  December 2004  (1 year 6 months) Business Development Manager, High Performance Computing Intel Corporation October 2002  –  July 2003  (10 months) Business Development Manager, High Performance Computing Intel Corporation October 2002  –  July 2003  (10 months) Commerical Industry Manager Sun Microsystems September 2000  –  August 2002  (2 years) Commerical Industry Manager Sun Microsystems September 2000  –  August 2002  (2 years) Asia Pacific Regional Manager NETg (Harcourt Brace) March 1998  –  August 2000  (2 years 6 months) Asia Pacific Regional Manager NETg (Harcourt Brace) March 1998  –  August 2000  (2 years 6 months) Supply Chain Senior Acount Executive i2 Technologies July 1996  –  March 1998  (1 year 9 months) Supply Chain Senior Acount Executive i2 Technologies July 1996  –  March 1998  (1 year 9 months) Manufacturing Industry Account Executive J.D. Edwards & Co February 1994  –  July 1996  (2 years 6 months) Manufacturing Industry Account Executive J.D. Edwards & Co February 1994  –  July 1996  (2 years 6 months) Open Systems Division Manager Stott & Hoare (IBM VAR) March 1988  –  December 1993  (5 years 10 months) Open Systems Division Manager Stott & Hoare (IBM VAR) March 1988  –  December 1993  (5 years 10 months) Languages French French French Skills ERP Business Strategy Program Management Strategic Planning Strategy Development Start-ups New Business Development Sales Management Business Planning Team Leadership Go-to-market Strategy Strategy Strategic Partnerships Change Management Business Intelligence Executive Coaching Life Coaching Federal Government Enterprise Software Team Management Channel Partners Direct Sales Management Business Development Sales Product Marketing Product Management IT Strategy Cloud Computing Solution Selling SaaS Business Alliances See 17+     See less Skills  ERP Business Strategy Program Management Strategic Planning Strategy Development Start-ups New Business Development Sales Management Business Planning Team Leadership Go-to-market Strategy Strategy Strategic Partnerships Change Management Business Intelligence Executive Coaching Life Coaching Federal Government Enterprise Software Team Management Channel Partners Direct Sales Management Business Development Sales Product Marketing Product Management IT Strategy Cloud Computing Solution Selling SaaS Business Alliances See 17+     See less ERP Business Strategy Program Management Strategic Planning Strategy Development Start-ups New Business Development Sales Management Business Planning Team Leadership Go-to-market Strategy Strategy Strategic Partnerships Change Management Business Intelligence Executive Coaching Life Coaching Federal Government Enterprise Software Team Management Channel Partners Direct Sales Management Business Development Sales Product Marketing Product Management IT Strategy Cloud Computing Solution Selling SaaS Business Alliances See 17+     See less ERP Business Strategy Program Management Strategic Planning Strategy Development Start-ups New Business Development Sales Management Business Planning Team Leadership Go-to-market Strategy Strategy Strategic Partnerships Change Management Business Intelligence Executive Coaching Life Coaching Federal Government Enterprise Software Team Management Channel Partners Direct Sales Management Business Development Sales Product Marketing Product Management IT Strategy Cloud Computing Solution Selling SaaS Business Alliances See 17+     See less Education Macquarie Graduate School of Management (MGSM) MBA,  M&A , Finance, Marketing,  Operations 2004  – 2006 Activities and Societies:  MGSM Logistics Management Award Lewis and Clark College BA,  Communication 1984  – 1987 Macquarie Graduate School of Management (MGSM) MBA,  M&A , Finance, Marketing,  Operations 2004  – 2006 Activities and Societies:  MGSM Logistics Management Award Macquarie Graduate School of Management (MGSM) MBA,  M&A , Finance, Marketing,  Operations 2004  – 2006 Activities and Societies:  MGSM Logistics Management Award Macquarie Graduate School of Management (MGSM) MBA,  M&A , Finance, Marketing,  Operations 2004  – 2006 Activities and Societies:  MGSM Logistics Management Award Lewis and Clark College BA,  Communication 1984  – 1987 Lewis and Clark College BA,  Communication 1984  – 1987 Lewis and Clark College BA,  Communication 1984  – 1987 ", "Summary Russ is an experienced business development specialist, with extensive high-tech background. Russ works with companies to help them strategically align their technologies for success. Russ has a proven record of helping his customers, and customers' customers, determine effective and scalable services leading to a high level of customer satisfaction. Specialties:Sales, Sales Management, Business Development, Negotiation Summary Russ is an experienced business development specialist, with extensive high-tech background. Russ works with companies to help them strategically align their technologies for success. Russ has a proven record of helping his customers, and customers' customers, determine effective and scalable services leading to a high level of customer satisfaction. Specialties:Sales, Sales Management, Business Development, Negotiation Russ is an experienced business development specialist, with extensive high-tech background. Russ works with companies to help them strategically align their technologies for success. Russ has a proven record of helping his customers, and customers' customers, determine effective and scalable services leading to a high level of customer satisfaction. Specialties:Sales, Sales Management, Business Development, Negotiation Russ is an experienced business development specialist, with extensive high-tech background. Russ works with companies to help them strategically align their technologies for success. Russ has a proven record of helping his customers, and customers' customers, determine effective and scalable services leading to a high level of customer satisfaction. Specialties:Sales, Sales Management, Business Development, Negotiation Experience Sr. Business Development Manager Intel Corporation October 2012  – Present (2 years 11 months) Hillsboro, OR Managing existing and new relationships with ISVs, OEMs and Internet Data Centers. Focus on Intel's power management solutions and the integration of Intel middleware into third party software management consoles. Drive industry sales and marketing programs to accelerate DCM product adoption. VP Sales, Americas LINBIT January 2010  –  October 2012  (2 years 10 months) Sales and business development for High-Availability systems utilizing DRBD® replication technology. VP Sales & Marketing EasyStreet Online Services, Inc. May 1997  –  September 2009  (12 years 5 months) CIO/IT Manager's Forum Steering Committee Software Association of Oregon September 2002  –  August 2009  (7 years) Member, Board of Directors Beaverton Chamber of Commerce January 2002  –  December 2008  (7 years) Beaverton, Oregon Internet SIG Steering Committee Technology Association of Oregon (formeraly SAO) September 1997  –  February 2001  (3 years 6 months) Business Development Mgr Polar Systems, Inc. January 1996  –  April 1997  (1 year 4 months) Principal BBK Enterprises, Inc. February 1993  –  April 1997  (4 years 3 months) Sales and Business Development, Contract Negotiations, Solutions selling, Account / Channel Development, and Start up executive. VP Business Development Network Computing Devices April 1992  –  January 1993  (10 months) Worldwide business development activities for NCD's PC (GSS) Division. Co-Founder, VP Graphic Software Systems, Inc. October 1981  –  April 1992  (10 years 7 months) Held positions in Operations, Software Engineering, Sales, & Marketing Software Engineer/Systems Analyst Tektronix May 1978  –  October 1981  (3 years 6 months) Lead Project for a major enhancement to a family of graphics programming tools. Project recognized for excellent design and timely deliveries. \nProvided technical assistance to international systems analysts for a family of graphics terminals and software. Sr. Business Development Manager Intel Corporation October 2012  – Present (2 years 11 months) Hillsboro, OR Managing existing and new relationships with ISVs, OEMs and Internet Data Centers. Focus on Intel's power management solutions and the integration of Intel middleware into third party software management consoles. Drive industry sales and marketing programs to accelerate DCM product adoption. Sr. Business Development Manager Intel Corporation October 2012  – Present (2 years 11 months) Hillsboro, OR Managing existing and new relationships with ISVs, OEMs and Internet Data Centers. Focus on Intel's power management solutions and the integration of Intel middleware into third party software management consoles. Drive industry sales and marketing programs to accelerate DCM product adoption. VP Sales, Americas LINBIT January 2010  –  October 2012  (2 years 10 months) Sales and business development for High-Availability systems utilizing DRBD® replication technology. VP Sales, Americas LINBIT January 2010  –  October 2012  (2 years 10 months) Sales and business development for High-Availability systems utilizing DRBD® replication technology. VP Sales & Marketing EasyStreet Online Services, Inc. May 1997  –  September 2009  (12 years 5 months) VP Sales & Marketing EasyStreet Online Services, Inc. May 1997  –  September 2009  (12 years 5 months) CIO/IT Manager's Forum Steering Committee Software Association of Oregon September 2002  –  August 2009  (7 years) CIO/IT Manager's Forum Steering Committee Software Association of Oregon September 2002  –  August 2009  (7 years) Member, Board of Directors Beaverton Chamber of Commerce January 2002  –  December 2008  (7 years) Beaverton, Oregon Member, Board of Directors Beaverton Chamber of Commerce January 2002  –  December 2008  (7 years) Beaverton, Oregon Internet SIG Steering Committee Technology Association of Oregon (formeraly SAO) September 1997  –  February 2001  (3 years 6 months) Internet SIG Steering Committee Technology Association of Oregon (formeraly SAO) September 1997  –  February 2001  (3 years 6 months) Business Development Mgr Polar Systems, Inc. January 1996  –  April 1997  (1 year 4 months) Business Development Mgr Polar Systems, Inc. January 1996  –  April 1997  (1 year 4 months) Principal BBK Enterprises, Inc. February 1993  –  April 1997  (4 years 3 months) Sales and Business Development, Contract Negotiations, Solutions selling, Account / Channel Development, and Start up executive. Principal BBK Enterprises, Inc. February 1993  –  April 1997  (4 years 3 months) Sales and Business Development, Contract Negotiations, Solutions selling, Account / Channel Development, and Start up executive. VP Business Development Network Computing Devices April 1992  –  January 1993  (10 months) Worldwide business development activities for NCD's PC (GSS) Division. VP Business Development Network Computing Devices April 1992  –  January 1993  (10 months) Worldwide business development activities for NCD's PC (GSS) Division. Co-Founder, VP Graphic Software Systems, Inc. October 1981  –  April 1992  (10 years 7 months) Held positions in Operations, Software Engineering, Sales, & Marketing Co-Founder, VP Graphic Software Systems, Inc. October 1981  –  April 1992  (10 years 7 months) Held positions in Operations, Software Engineering, Sales, & Marketing Software Engineer/Systems Analyst Tektronix May 1978  –  October 1981  (3 years 6 months) Lead Project for a major enhancement to a family of graphics programming tools. Project recognized for excellent design and timely deliveries. \nProvided technical assistance to international systems analysts for a family of graphics terminals and software. Software Engineer/Systems Analyst Tektronix May 1978  –  October 1981  (3 years 6 months) Lead Project for a major enhancement to a family of graphics programming tools. Project recognized for excellent design and timely deliveries. \nProvided technical assistance to international systems analysts for a family of graphics terminals and software. Skills Sales Management Business Development Analytics Solution Selling Management Selling Strategic Partnerships Product Development Program Management SaaS Integration Enterprise Software Negotiation CRM Leadership Product Management Sales Networking Product Marketing Cloud Computing Salesforce.com Go-to-market Strategy Contract Negotiation Start-ups Sales Operations New Business Development Account Management Software Project... Team Leadership Vendor Management Data Center Customer Satisfaction E-commerce Cross-functional Team... Sales Process Strategy See 21+     See less Skills  Sales Management Business Development Analytics Solution Selling Management Selling Strategic Partnerships Product Development Program Management SaaS Integration Enterprise Software Negotiation CRM Leadership Product Management Sales Networking Product Marketing Cloud Computing Salesforce.com Go-to-market Strategy Contract Negotiation Start-ups Sales Operations New Business Development Account Management Software Project... Team Leadership Vendor Management Data Center Customer Satisfaction E-commerce Cross-functional Team... Sales Process Strategy See 21+     See less Sales Management Business Development Analytics Solution Selling Management Selling Strategic Partnerships Product Development Program Management SaaS Integration Enterprise Software Negotiation CRM Leadership Product Management Sales Networking Product Marketing Cloud Computing Salesforce.com Go-to-market Strategy Contract Negotiation Start-ups Sales Operations New Business Development Account Management Software Project... Team Leadership Vendor Management Data Center Customer Satisfaction E-commerce Cross-functional Team... Sales Process Strategy See 21+     See less Sales Management Business Development Analytics Solution Selling Management Selling Strategic Partnerships Product Development Program Management SaaS Integration Enterprise Software Negotiation CRM Leadership Product Management Sales Networking Product Marketing Cloud Computing Salesforce.com Go-to-market Strategy Contract Negotiation Start-ups Sales Operations New Business Development Account Management Software Project... Team Leadership Vendor Management Data Center Customer Satisfaction E-commerce Cross-functional Team... Sales Process Strategy See 21+     See less Education Purdue University MS 1976  – 1978 Lakeland College BA 1971  – 1975 South adams high school Purdue University MS 1976  – 1978 Purdue University MS 1976  – 1978 Purdue University MS 1976  – 1978 Lakeland College BA 1971  – 1975 Lakeland College BA 1971  – 1975 Lakeland College BA 1971  – 1975 South adams high school South adams high school South adams high school ", "Skills People Management Strategic Thinking Team Leadership Individualization Activator Futuristic Public Speaking Public Relations Skills Customer Presentations Product Marketing Competitive Analysis New Business Development Marketing Strategy Online Marketing Business Development Intel See 1+     See less Skills  People Management Strategic Thinking Team Leadership Individualization Activator Futuristic Public Speaking Public Relations Skills Customer Presentations Product Marketing Competitive Analysis New Business Development Marketing Strategy Online Marketing Business Development Intel See 1+     See less People Management Strategic Thinking Team Leadership Individualization Activator Futuristic Public Speaking Public Relations Skills Customer Presentations Product Marketing Competitive Analysis New Business Development Marketing Strategy Online Marketing Business Development Intel See 1+     See less People Management Strategic Thinking Team Leadership Individualization Activator Futuristic Public Speaking Public Relations Skills Customer Presentations Product Marketing Competitive Analysis New Business Development Marketing Strategy Online Marketing Business Development Intel See 1+     See less ", "Summary Janice A. Jackson  \nLake Oswego, Oregon \nChandler, Arizona  \n \nOver twenty-five years of Strategic Business Development and Marketing Management experience in the High Technology industry with proven success in Business Development, IP Licensing, SOW Development, Channel Development, Third Party Vendor Relationship Management (OEM’s/ODM’s/OSV’s/ISV’s/SI’s), Contract Negotiations, Major Account Management, Business Development expansion to International and Emerging Markets, Strong communication and customer facing skills, strong customer orientation focus with excellent business development skills and follow through with customer engagements, results oriented, strong team leadership skills, self managed, proven results in highly matrixed environments working on complex opportunities driving virtual teams. \n \nSpecialties: Strategic Business Development and Relationship Manager working with Strategic Alliance Accounts :Tier 1 OEM's, Linux OSV's, Emerging market local OEM's, ISV's, Solution Provider's, Software Tool Vendors. Business Development and Planning , Contract negotiations , IP licensing, Contract Management , Technology licensing , Linux , Microsoft WinCE and XP, High Performance Computing , HPC , Super Computing , Clusters , Channels , Fellow Traveler Program Management , Strategic Relationship Management , Alliance Management , Joint Marketing , International Business Development experience in Germany , France , China , Japan , Korea and other Emerging Markets, Customer Collateral , Press Releases , Software Development tools, IDE’s , Eclipse , ISV Fellow Traveler Programs , Embedded environments , System Integrator and VAR Management , Start-up mentality , Cross Divisional experience, Champion , results oriented . Summary Janice A. Jackson  \nLake Oswego, Oregon \nChandler, Arizona  \n \nOver twenty-five years of Strategic Business Development and Marketing Management experience in the High Technology industry with proven success in Business Development, IP Licensing, SOW Development, Channel Development, Third Party Vendor Relationship Management (OEM’s/ODM’s/OSV’s/ISV’s/SI’s), Contract Negotiations, Major Account Management, Business Development expansion to International and Emerging Markets, Strong communication and customer facing skills, strong customer orientation focus with excellent business development skills and follow through with customer engagements, results oriented, strong team leadership skills, self managed, proven results in highly matrixed environments working on complex opportunities driving virtual teams. \n \nSpecialties: Strategic Business Development and Relationship Manager working with Strategic Alliance Accounts :Tier 1 OEM's, Linux OSV's, Emerging market local OEM's, ISV's, Solution Provider's, Software Tool Vendors. Business Development and Planning , Contract negotiations , IP licensing, Contract Management , Technology licensing , Linux , Microsoft WinCE and XP, High Performance Computing , HPC , Super Computing , Clusters , Channels , Fellow Traveler Program Management , Strategic Relationship Management , Alliance Management , Joint Marketing , International Business Development experience in Germany , France , China , Japan , Korea and other Emerging Markets, Customer Collateral , Press Releases , Software Development tools, IDE’s , Eclipse , ISV Fellow Traveler Programs , Embedded environments , System Integrator and VAR Management , Start-up mentality , Cross Divisional experience, Champion , results oriented . Janice A. Jackson  \nLake Oswego, Oregon \nChandler, Arizona  \n \nOver twenty-five years of Strategic Business Development and Marketing Management experience in the High Technology industry with proven success in Business Development, IP Licensing, SOW Development, Channel Development, Third Party Vendor Relationship Management (OEM’s/ODM’s/OSV’s/ISV’s/SI’s), Contract Negotiations, Major Account Management, Business Development expansion to International and Emerging Markets, Strong communication and customer facing skills, strong customer orientation focus with excellent business development skills and follow through with customer engagements, results oriented, strong team leadership skills, self managed, proven results in highly matrixed environments working on complex opportunities driving virtual teams. \n \nSpecialties: Strategic Business Development and Relationship Manager working with Strategic Alliance Accounts :Tier 1 OEM's, Linux OSV's, Emerging market local OEM's, ISV's, Solution Provider's, Software Tool Vendors. Business Development and Planning , Contract negotiations , IP licensing, Contract Management , Technology licensing , Linux , Microsoft WinCE and XP, High Performance Computing , HPC , Super Computing , Clusters , Channels , Fellow Traveler Program Management , Strategic Relationship Management , Alliance Management , Joint Marketing , International Business Development experience in Germany , France , China , Japan , Korea and other Emerging Markets, Customer Collateral , Press Releases , Software Development tools, IDE’s , Eclipse , ISV Fellow Traveler Programs , Embedded environments , System Integrator and VAR Management , Start-up mentality , Cross Divisional experience, Champion , results oriented . Janice A. Jackson  \nLake Oswego, Oregon \nChandler, Arizona  \n \nOver twenty-five years of Strategic Business Development and Marketing Management experience in the High Technology industry with proven success in Business Development, IP Licensing, SOW Development, Channel Development, Third Party Vendor Relationship Management (OEM’s/ODM’s/OSV’s/ISV’s/SI’s), Contract Negotiations, Major Account Management, Business Development expansion to International and Emerging Markets, Strong communication and customer facing skills, strong customer orientation focus with excellent business development skills and follow through with customer engagements, results oriented, strong team leadership skills, self managed, proven results in highly matrixed environments working on complex opportunities driving virtual teams. \n \nSpecialties: Strategic Business Development and Relationship Manager working with Strategic Alliance Accounts :Tier 1 OEM's, Linux OSV's, Emerging market local OEM's, ISV's, Solution Provider's, Software Tool Vendors. Business Development and Planning , Contract negotiations , IP licensing, Contract Management , Technology licensing , Linux , Microsoft WinCE and XP, High Performance Computing , HPC , Super Computing , Clusters , Channels , Fellow Traveler Program Management , Strategic Relationship Management , Alliance Management , Joint Marketing , International Business Development experience in Germany , France , China , Japan , Korea and other Emerging Markets, Customer Collateral , Press Releases , Software Development tools, IDE’s , Eclipse , ISV Fellow Traveler Programs , Embedded environments , System Integrator and VAR Management , Start-up mentality , Cross Divisional experience, Champion , results oriented . Experience Business Development Manager Intel Corporation October 2014  – Present (11 months) Internet of Things Group Strategic Business Development Manager Intel Corporation November 2011  – Present (3 years 10 months) MCG/NDG Platform Solutions Group Drove all the Business and Licensing deliverables for the Mobility Communications Group Platform Solutions Group Projects. Negotiated several Intel Consulting Service Agreements enabling various engineering groups to outsource a variety of development and integration projects as well as licensing in IP technologies to Intel. Standardized Statement of Work (SOW) engagements with Wipro across all engineering organizations on various staff augmentation engagements. In addition, took on the responsibilities of the operations manager for the group, including the financial budget mgmt. of the third party engagements with finance, IP plan development, running ProtexIP against software stack and Software Legal compliance efforts (Outbound licenses, Open Source Compliance, Export Control, IP licenses) for the projects. Developed and managed a User Trial Program for The Egg program. Worked closely with Intel Privacy and Legal to develop a Trial Participant Release/CNDA form to be executed prior to Trial device delivery; drove trial participant survey development and managed the selection of trial participants from the survey feedback; developed OOBE survey, drove user feedback sessions and incorporated feedback into product roadmap. Sr. Business Partnership Mgr. Intel Digital Home Group November 2009  –  November 2011  (2 years 1 month) Managed the DHG Wind River relationship to drive scaling engineering efforts to align with each of the four segment strategies to scale opportunities due to limited DHG engineering segment resources. Drove all SOW and pricing efforts with WR. Initiated and drove complex business and legal negotiations for licensing of third party IP technologies for the Cherry Canyon/Vizio Google TV programs. The complexity of the ecosystem development partners (ISV’s, SI’s, OSV’s, ODM’s, OEM’s) required developing a new licensing model for both Intel and the third parties. Negotiated agreements for source or binary format access to make modifications/derivative works and redistribute to other ecosystem partners for testing/validation/certification and manufacturing rights. Each negotiation had numerous business/legal complexities to overcome to execute the required licenses. Developed the SWLC compliance for the project, including developing the IP plan. Virtualization ISV Co-Marketing Mgr. Intel April 2009  –  December 2009  (9 months) Managed the Tier 2 Virtualization ISV’s (Novell, Red Hat, Canonical, Parallels, Oracle, Sun) relationships driving co-marketing activities promoting SSG virtualization engineering enabling efforts and implementations of Intel Virtualization Technologies in ISV Virtualization GTM strategies. XML Sr. Business Development Mgr Intel January 2008  –  April 2009  (1 year 4 months) Managed the worldwide Business Development and Channel efforts for the XML Software Products. Influenced and drove changes to the programs initial ISV engagement strategies, pricing and business models. In changing the programs engagement strategy, grew the opportunity funnel over 13X in 2008 from 30 accounts at the start of the year to over 400 ISV’s by the end of 2008. Worked extensively with Product Marketing, architects and engineering to influence and realign product roadmap to meet current customer engagement requirements to maximize the potential for obtaining the revenue plan. Lead the project EOL and mitigated legal liabilities to existing customer base due to organizational decision to disinvest in project. HPC Marketing Programs Mgr Hewlett Packard December 2006  –  November 2007  (1 year) Consultant for the WWide High Performance Computing Division’s Product Marketing team. Developed and drove the implementation of a WWide 2007 strategic Itanium initiative for a competitive marketing migration program targeted at SGI installed base to increase HP Integrity (Itanium) Linux revenue. Drove cross divisional non-standard issues in order to have a competitive product and support offering, defining not only GEO program requirements but also defining at each country GM level specific business requirements according to their local competitive environment Business Development Mgr. Intel August 2000  –  October 2006  (6 years 3 months) Strategic Business Development Mgr, contract negotiations with Tier One OEM's, Linux OSV's, Software Tool Vendors, System Integrators, VAR's, and other Solution Providers, worldwide, including emerging markets. Biz Dv Mgr Sequent Computer Systems 1988  –  2000  (12 years) Business Development Mgr Sequent 1988  –  2000  (12 years) Major Accounts Mgr. Tektronix 1980  –  1988  (8 years) Business Development Manager Intel Corporation October 2014  – Present (11 months) Internet of Things Group Business Development Manager Intel Corporation October 2014  – Present (11 months) Internet of Things Group Strategic Business Development Manager Intel Corporation November 2011  – Present (3 years 10 months) MCG/NDG Platform Solutions Group Drove all the Business and Licensing deliverables for the Mobility Communications Group Platform Solutions Group Projects. Negotiated several Intel Consulting Service Agreements enabling various engineering groups to outsource a variety of development and integration projects as well as licensing in IP technologies to Intel. Standardized Statement of Work (SOW) engagements with Wipro across all engineering organizations on various staff augmentation engagements. In addition, took on the responsibilities of the operations manager for the group, including the financial budget mgmt. of the third party engagements with finance, IP plan development, running ProtexIP against software stack and Software Legal compliance efforts (Outbound licenses, Open Source Compliance, Export Control, IP licenses) for the projects. Developed and managed a User Trial Program for The Egg program. Worked closely with Intel Privacy and Legal to develop a Trial Participant Release/CNDA form to be executed prior to Trial device delivery; drove trial participant survey development and managed the selection of trial participants from the survey feedback; developed OOBE survey, drove user feedback sessions and incorporated feedback into product roadmap. Strategic Business Development Manager Intel Corporation November 2011  – Present (3 years 10 months) MCG/NDG Platform Solutions Group Drove all the Business and Licensing deliverables for the Mobility Communications Group Platform Solutions Group Projects. Negotiated several Intel Consulting Service Agreements enabling various engineering groups to outsource a variety of development and integration projects as well as licensing in IP technologies to Intel. Standardized Statement of Work (SOW) engagements with Wipro across all engineering organizations on various staff augmentation engagements. In addition, took on the responsibilities of the operations manager for the group, including the financial budget mgmt. of the third party engagements with finance, IP plan development, running ProtexIP against software stack and Software Legal compliance efforts (Outbound licenses, Open Source Compliance, Export Control, IP licenses) for the projects. Developed and managed a User Trial Program for The Egg program. Worked closely with Intel Privacy and Legal to develop a Trial Participant Release/CNDA form to be executed prior to Trial device delivery; drove trial participant survey development and managed the selection of trial participants from the survey feedback; developed OOBE survey, drove user feedback sessions and incorporated feedback into product roadmap. Sr. Business Partnership Mgr. Intel Digital Home Group November 2009  –  November 2011  (2 years 1 month) Managed the DHG Wind River relationship to drive scaling engineering efforts to align with each of the four segment strategies to scale opportunities due to limited DHG engineering segment resources. Drove all SOW and pricing efforts with WR. Initiated and drove complex business and legal negotiations for licensing of third party IP technologies for the Cherry Canyon/Vizio Google TV programs. The complexity of the ecosystem development partners (ISV’s, SI’s, OSV’s, ODM’s, OEM’s) required developing a new licensing model for both Intel and the third parties. Negotiated agreements for source or binary format access to make modifications/derivative works and redistribute to other ecosystem partners for testing/validation/certification and manufacturing rights. Each negotiation had numerous business/legal complexities to overcome to execute the required licenses. Developed the SWLC compliance for the project, including developing the IP plan. Sr. Business Partnership Mgr. Intel Digital Home Group November 2009  –  November 2011  (2 years 1 month) Managed the DHG Wind River relationship to drive scaling engineering efforts to align with each of the four segment strategies to scale opportunities due to limited DHG engineering segment resources. Drove all SOW and pricing efforts with WR. Initiated and drove complex business and legal negotiations for licensing of third party IP technologies for the Cherry Canyon/Vizio Google TV programs. The complexity of the ecosystem development partners (ISV’s, SI’s, OSV’s, ODM’s, OEM’s) required developing a new licensing model for both Intel and the third parties. Negotiated agreements for source or binary format access to make modifications/derivative works and redistribute to other ecosystem partners for testing/validation/certification and manufacturing rights. Each negotiation had numerous business/legal complexities to overcome to execute the required licenses. Developed the SWLC compliance for the project, including developing the IP plan. Virtualization ISV Co-Marketing Mgr. Intel April 2009  –  December 2009  (9 months) Managed the Tier 2 Virtualization ISV’s (Novell, Red Hat, Canonical, Parallels, Oracle, Sun) relationships driving co-marketing activities promoting SSG virtualization engineering enabling efforts and implementations of Intel Virtualization Technologies in ISV Virtualization GTM strategies. Virtualization ISV Co-Marketing Mgr. Intel April 2009  –  December 2009  (9 months) Managed the Tier 2 Virtualization ISV’s (Novell, Red Hat, Canonical, Parallels, Oracle, Sun) relationships driving co-marketing activities promoting SSG virtualization engineering enabling efforts and implementations of Intel Virtualization Technologies in ISV Virtualization GTM strategies. XML Sr. Business Development Mgr Intel January 2008  –  April 2009  (1 year 4 months) Managed the worldwide Business Development and Channel efforts for the XML Software Products. Influenced and drove changes to the programs initial ISV engagement strategies, pricing and business models. In changing the programs engagement strategy, grew the opportunity funnel over 13X in 2008 from 30 accounts at the start of the year to over 400 ISV’s by the end of 2008. Worked extensively with Product Marketing, architects and engineering to influence and realign product roadmap to meet current customer engagement requirements to maximize the potential for obtaining the revenue plan. Lead the project EOL and mitigated legal liabilities to existing customer base due to organizational decision to disinvest in project. XML Sr. Business Development Mgr Intel January 2008  –  April 2009  (1 year 4 months) Managed the worldwide Business Development and Channel efforts for the XML Software Products. Influenced and drove changes to the programs initial ISV engagement strategies, pricing and business models. In changing the programs engagement strategy, grew the opportunity funnel over 13X in 2008 from 30 accounts at the start of the year to over 400 ISV’s by the end of 2008. Worked extensively with Product Marketing, architects and engineering to influence and realign product roadmap to meet current customer engagement requirements to maximize the potential for obtaining the revenue plan. Lead the project EOL and mitigated legal liabilities to existing customer base due to organizational decision to disinvest in project. HPC Marketing Programs Mgr Hewlett Packard December 2006  –  November 2007  (1 year) Consultant for the WWide High Performance Computing Division’s Product Marketing team. Developed and drove the implementation of a WWide 2007 strategic Itanium initiative for a competitive marketing migration program targeted at SGI installed base to increase HP Integrity (Itanium) Linux revenue. Drove cross divisional non-standard issues in order to have a competitive product and support offering, defining not only GEO program requirements but also defining at each country GM level specific business requirements according to their local competitive environment HPC Marketing Programs Mgr Hewlett Packard December 2006  –  November 2007  (1 year) Consultant for the WWide High Performance Computing Division’s Product Marketing team. Developed and drove the implementation of a WWide 2007 strategic Itanium initiative for a competitive marketing migration program targeted at SGI installed base to increase HP Integrity (Itanium) Linux revenue. Drove cross divisional non-standard issues in order to have a competitive product and support offering, defining not only GEO program requirements but also defining at each country GM level specific business requirements according to their local competitive environment Business Development Mgr. Intel August 2000  –  October 2006  (6 years 3 months) Strategic Business Development Mgr, contract negotiations with Tier One OEM's, Linux OSV's, Software Tool Vendors, System Integrators, VAR's, and other Solution Providers, worldwide, including emerging markets. Business Development Mgr. Intel August 2000  –  October 2006  (6 years 3 months) Strategic Business Development Mgr, contract negotiations with Tier One OEM's, Linux OSV's, Software Tool Vendors, System Integrators, VAR's, and other Solution Providers, worldwide, including emerging markets. Biz Dv Mgr Sequent Computer Systems 1988  –  2000  (12 years) Biz Dv Mgr Sequent Computer Systems 1988  –  2000  (12 years) Business Development Mgr Sequent 1988  –  2000  (12 years) Business Development Mgr Sequent 1988  –  2000  (12 years) Major Accounts Mgr. Tektronix 1980  –  1988  (8 years) Major Accounts Mgr. Tektronix 1980  –  1988  (8 years) Skills ISV Channel High Performance... Solution Selling Semiconductors Product Marketing Enterprise Software Account Management Management Program Management Business Development Competitive Analysis Pre-sales Start-ups Strategy Business Strategy Sales Operations Virtualization Leadership SaaS Go-to-market Strategy See 6+     See less Skills  ISV Channel High Performance... Solution Selling Semiconductors Product Marketing Enterprise Software Account Management Management Program Management Business Development Competitive Analysis Pre-sales Start-ups Strategy Business Strategy Sales Operations Virtualization Leadership SaaS Go-to-market Strategy See 6+     See less ISV Channel High Performance... Solution Selling Semiconductors Product Marketing Enterprise Software Account Management Management Program Management Business Development Competitive Analysis Pre-sales Start-ups Strategy Business Strategy Sales Operations Virtualization Leadership SaaS Go-to-market Strategy See 6+     See less ISV Channel High Performance... Solution Selling Semiconductors Product Marketing Enterprise Software Account Management Management Program Management Business Development Competitive Analysis Pre-sales Start-ups Strategy Business Strategy Sales Operations Virtualization Leadership SaaS Go-to-market Strategy See 6+     See less Education Oregon State University BS,  Business Admin/Marketing 1976  – 1980 Reynolds High School Oregon State University BS,  Business Admin/Marketing 1976  – 1980 Oregon State University BS,  Business Admin/Marketing 1976  – 1980 Oregon State University BS,  Business Admin/Marketing 1976  – 1980 Reynolds High School Reynolds High School Reynolds High School ", "Skills Semiconductors Product Marketing Processors Motivational Speaking Intel Technical Marketing Debugging Product Development Design of Experiments Product Management Cross-functional Team... Go-to-market Strategy IC Program Management Embedded Systems Computer Architecture SoC Semiconductor Industry Hardware Architecture See 4+     See less Skills  Semiconductors Product Marketing Processors Motivational Speaking Intel Technical Marketing Debugging Product Development Design of Experiments Product Management Cross-functional Team... Go-to-market Strategy IC Program Management Embedded Systems Computer Architecture SoC Semiconductor Industry Hardware Architecture See 4+     See less Semiconductors Product Marketing Processors Motivational Speaking Intel Technical Marketing Debugging Product Development Design of Experiments Product Management Cross-functional Team... Go-to-market Strategy IC Program Management Embedded Systems Computer Architecture SoC Semiconductor Industry Hardware Architecture See 4+     See less Semiconductors Product Marketing Processors Motivational Speaking Intel Technical Marketing Debugging Product Development Design of Experiments Product Management Cross-functional Team... Go-to-market Strategy IC Program Management Embedded Systems Computer Architecture SoC Semiconductor Industry Hardware Architecture See 4+     See less ", "Languages Swedish English Spanish German Swedish English Spanish German Swedish English Spanish German Skills Go-to-market Strategy Strategy Business Alliances Business Development Management Product Management Program Management Strategic Alliances Mobile Devices Cross-functional Team... Strategic Partnerships Partner Management Skills  Go-to-market Strategy Strategy Business Alliances Business Development Management Product Management Program Management Strategic Alliances Mobile Devices Cross-functional Team... Strategic Partnerships Partner Management Go-to-market Strategy Strategy Business Alliances Business Development Management Product Management Program Management Strategic Alliances Mobile Devices Cross-functional Team... Strategic Partnerships Partner Management Go-to-market Strategy Strategy Business Alliances Business Development Management Product Management Program Management Strategic Alliances Mobile Devices Cross-functional Team... Strategic Partnerships Partner Management ", "Summary Professional experience in IT industry sales & business development for 16+ years.  \n \nHolding Computer Engineering B.S., and MBA degrees.  \n \nWorking as Business Development Manager at Intel Corporation Turkey.  \n \nSales & marketing, key account management, internal & external stakeholder management, partner management, business development, ecosystem relationship building are the skills I capitalized this far.  \n \nCustomer orientation, discipline, results orientation, strategic and structured approach to business are among my strengths. \n \nSpecialties: IT sales experience, executive relationship management, key account management, business development, solution development, relationship management, solution sales, government relations, finance & telco verticals experience, ecosystem knowledge, computer hardware, servers, desktop & mobile architectures, virtualization, cloud computing, telecoms infrastructure, security, identity protection, PKI, authentication, secure element, mobile payments. Summary Professional experience in IT industry sales & business development for 16+ years.  \n \nHolding Computer Engineering B.S., and MBA degrees.  \n \nWorking as Business Development Manager at Intel Corporation Turkey.  \n \nSales & marketing, key account management, internal & external stakeholder management, partner management, business development, ecosystem relationship building are the skills I capitalized this far.  \n \nCustomer orientation, discipline, results orientation, strategic and structured approach to business are among my strengths. \n \nSpecialties: IT sales experience, executive relationship management, key account management, business development, solution development, relationship management, solution sales, government relations, finance & telco verticals experience, ecosystem knowledge, computer hardware, servers, desktop & mobile architectures, virtualization, cloud computing, telecoms infrastructure, security, identity protection, PKI, authentication, secure element, mobile payments. Professional experience in IT industry sales & business development for 16+ years.  \n \nHolding Computer Engineering B.S., and MBA degrees.  \n \nWorking as Business Development Manager at Intel Corporation Turkey.  \n \nSales & marketing, key account management, internal & external stakeholder management, partner management, business development, ecosystem relationship building are the skills I capitalized this far.  \n \nCustomer orientation, discipline, results orientation, strategic and structured approach to business are among my strengths. \n \nSpecialties: IT sales experience, executive relationship management, key account management, business development, solution development, relationship management, solution sales, government relations, finance & telco verticals experience, ecosystem knowledge, computer hardware, servers, desktop & mobile architectures, virtualization, cloud computing, telecoms infrastructure, security, identity protection, PKI, authentication, secure element, mobile payments. Professional experience in IT industry sales & business development for 16+ years.  \n \nHolding Computer Engineering B.S., and MBA degrees.  \n \nWorking as Business Development Manager at Intel Corporation Turkey.  \n \nSales & marketing, key account management, internal & external stakeholder management, partner management, business development, ecosystem relationship building are the skills I capitalized this far.  \n \nCustomer orientation, discipline, results orientation, strategic and structured approach to business are among my strengths. \n \nSpecialties: IT sales experience, executive relationship management, key account management, business development, solution development, relationship management, solution sales, government relations, finance & telco verticals experience, ecosystem knowledge, computer hardware, servers, desktop & mobile architectures, virtualization, cloud computing, telecoms infrastructure, security, identity protection, PKI, authentication, secure element, mobile payments. Experience Business Development Manager Intel Corporation March 2006  – Present (9 years 6 months) Ankara Key enterprise (finance, telco), government & education verticals account management. Providing end users with the right Intel solutions that will span both hardware and software perspectives as Intel is moving to a software & services company from a chip provider. Developing business with ecosystem partners (OEMs, ISVs, SIs, Telcos, and others) at enterprise, government, education, telco verticals; developing key executive level relationships at end users and ecosystem, driving key initiatives that span different expertise domains, and delivering results to end users. Managing relations with key MNC OEMs in enterprise, government, education and SMB verticals, as an MNC OEM account manager. Held various different roles within Intel covering end users, partners, and different end user verticals.  Business Development Manager Meteksan Sistem A.S November 2005  –  March 2006  (5 months) Business Development for provisioning IT services for government organizations. Solution Sales Unit Manager KocSistem A.S. August 2005  –  November 2005  (4 months) Solution Sales and Business Development Unit Manager responsible from ICT solution sales to government organizations. Business Development Specialist KocSistem A.S. January 2001  –  August 2005  (4 years 8 months) Business Development Specialist working on e-government projects as a presales specialist in forming the overall IT solution proposal. Software Development Expert KoçSistem July 1999  –  December 2000  (1 year 6 months) Ankara, Turkey Software development, software design of key core banking applications of Ziraatbank. Business Development Manager Intel Corporation March 2006  – Present (9 years 6 months) Ankara Key enterprise (finance, telco), government & education verticals account management. Providing end users with the right Intel solutions that will span both hardware and software perspectives as Intel is moving to a software & services company from a chip provider. Developing business with ecosystem partners (OEMs, ISVs, SIs, Telcos, and others) at enterprise, government, education, telco verticals; developing key executive level relationships at end users and ecosystem, driving key initiatives that span different expertise domains, and delivering results to end users. Managing relations with key MNC OEMs in enterprise, government, education and SMB verticals, as an MNC OEM account manager. Held various different roles within Intel covering end users, partners, and different end user verticals.  Business Development Manager Intel Corporation March 2006  – Present (9 years 6 months) Ankara Key enterprise (finance, telco), government & education verticals account management. Providing end users with the right Intel solutions that will span both hardware and software perspectives as Intel is moving to a software & services company from a chip provider. Developing business with ecosystem partners (OEMs, ISVs, SIs, Telcos, and others) at enterprise, government, education, telco verticals; developing key executive level relationships at end users and ecosystem, driving key initiatives that span different expertise domains, and delivering results to end users. Managing relations with key MNC OEMs in enterprise, government, education and SMB verticals, as an MNC OEM account manager. Held various different roles within Intel covering end users, partners, and different end user verticals.  Business Development Manager Meteksan Sistem A.S November 2005  –  March 2006  (5 months) Business Development for provisioning IT services for government organizations. Business Development Manager Meteksan Sistem A.S November 2005  –  March 2006  (5 months) Business Development for provisioning IT services for government organizations. Solution Sales Unit Manager KocSistem A.S. August 2005  –  November 2005  (4 months) Solution Sales and Business Development Unit Manager responsible from ICT solution sales to government organizations. Solution Sales Unit Manager KocSistem A.S. August 2005  –  November 2005  (4 months) Solution Sales and Business Development Unit Manager responsible from ICT solution sales to government organizations. Business Development Specialist KocSistem A.S. January 2001  –  August 2005  (4 years 8 months) Business Development Specialist working on e-government projects as a presales specialist in forming the overall IT solution proposal. Business Development Specialist KocSistem A.S. January 2001  –  August 2005  (4 years 8 months) Business Development Specialist working on e-government projects as a presales specialist in forming the overall IT solution proposal. Software Development Expert KoçSistem July 1999  –  December 2000  (1 year 6 months) Ankara, Turkey Software development, software design of key core banking applications of Ziraatbank. Software Development Expert KoçSistem July 1999  –  December 2000  (1 year 6 months) Ankara, Turkey Software development, software design of key core banking applications of Ziraatbank. Languages English English English Skills Solution Selling Computer Hardware Servers Cloud Computing Ecosystem Business Development Pre-sales Virtualization IT Service Management Enterprise Software Telecommunications Account Management Business Intelligence Channel Partners Data Center Go-to-market Strategy Hardware Integration Key Account Management Mobile Devices Partner Management Product Management Product Marketing Software Development Storage Strategy Wireless Business Alliances Strategic Partnerships See 14+     See less Skills  Solution Selling Computer Hardware Servers Cloud Computing Ecosystem Business Development Pre-sales Virtualization IT Service Management Enterprise Software Telecommunications Account Management Business Intelligence Channel Partners Data Center Go-to-market Strategy Hardware Integration Key Account Management Mobile Devices Partner Management Product Management Product Marketing Software Development Storage Strategy Wireless Business Alliances Strategic Partnerships See 14+     See less Solution Selling Computer Hardware Servers Cloud Computing Ecosystem Business Development Pre-sales Virtualization IT Service Management Enterprise Software Telecommunications Account Management Business Intelligence Channel Partners Data Center Go-to-market Strategy Hardware Integration Key Account Management Mobile Devices Partner Management Product Management Product Marketing Software Development Storage Strategy Wireless Business Alliances Strategic Partnerships See 14+     See less Solution Selling Computer Hardware Servers Cloud Computing Ecosystem Business Development Pre-sales Virtualization IT Service Management Enterprise Software Telecommunications Account Management Business Intelligence Channel Partners Data Center Go-to-market Strategy Hardware Integration Key Account Management Mobile Devices Partner Management Product Management Product Marketing Software Development Storage Strategy Wireless Business Alliances Strategic Partnerships See 14+     See less Education Orta Doğu Teknik Üniversitesi / Middle East Technical University Ph.D.,  Information Systems , e-Government, e-Government Maturity Models, Software Quality,  Project Mgmt. 2004  – 2010 Orta Doğu Teknik Üniversitesi / Middle East Technical University MBA,  Finance ,  Management , Strategic Management,  Accounting ,  IT Management 1999  – 2001 Orta Doğu Teknik Üniversitesi Bachelor's degree,  Computer Engineering 1995  – 1999 Ankara Fen Lisesi 4.42,  High School 1992  – 1995 Orta Doğu Teknik Üniversitesi / Middle East Technical University Ph.D.,  Information Systems , e-Government, e-Government Maturity Models, Software Quality,  Project Mgmt. 2004  – 2010 Orta Doğu Teknik Üniversitesi / Middle East Technical University Ph.D.,  Information Systems , e-Government, e-Government Maturity Models, Software Quality,  Project Mgmt. 2004  – 2010 Orta Doğu Teknik Üniversitesi / Middle East Technical University Ph.D.,  Information Systems , e-Government, e-Government Maturity Models, Software Quality,  Project Mgmt. 2004  – 2010 Orta Doğu Teknik Üniversitesi / Middle East Technical University MBA,  Finance ,  Management , Strategic Management,  Accounting ,  IT Management 1999  – 2001 Orta Doğu Teknik Üniversitesi / Middle East Technical University MBA,  Finance ,  Management , Strategic Management,  Accounting ,  IT Management 1999  – 2001 Orta Doğu Teknik Üniversitesi / Middle East Technical University MBA,  Finance ,  Management , Strategic Management,  Accounting ,  IT Management 1999  – 2001 Orta Doğu Teknik Üniversitesi Bachelor's degree,  Computer Engineering 1995  – 1999 Orta Doğu Teknik Üniversitesi Bachelor's degree,  Computer Engineering 1995  – 1999 Orta Doğu Teknik Üniversitesi Bachelor's degree,  Computer Engineering 1995  – 1999 Ankara Fen Lisesi 4.42,  High School 1992  – 1995 Ankara Fen Lisesi 4.42,  High School 1992  – 1995 Ankara Fen Lisesi 4.42,  High School 1992  – 1995 ", "Summary 21 years of experience in the IT and Telco industry with Sales, Marketing and Customer Relations related jobs in Multinational Companies. Interested in Senior Level positions for Turkey and Emerging regions. \n \nSpecialties:  \nInformation Technologies, Telco Services, Enterprise / Retail Segments, Emerging Markets, Entrepreneurships / Startup, B2C / B2B PC & Mobile Market, OEM products, notebook, tablet, smartphone, desktop, Software & Hardware Technology, Enterprise Customers (Server HW & Oracle/Microsoft),  \nAccount Management, Key Account Management, Channel Management, Channel Sales, Resellers, Strategy & Business Development, Alliance Management, Contract Negotiation, Solution Sales, Project Management \nMarketing, Market Development, Program / Product Management, Pricing, Competitive Analysis, Partner Ecosystem, Go-to-Market, Demand Generation Activities, Marketing Fund,  \nIntegrated Marketing, ATL/BTL Marketing & PR Communication, Online/Digital Marketing \nCustomer Relations, CRM, Customer Care Management, Service Delivery \nTeam Management,Team Building, Virtual / Cross teams, Leadership, Performance Management, Personnel Management \n \n Summary 21 years of experience in the IT and Telco industry with Sales, Marketing and Customer Relations related jobs in Multinational Companies. Interested in Senior Level positions for Turkey and Emerging regions. \n \nSpecialties:  \nInformation Technologies, Telco Services, Enterprise / Retail Segments, Emerging Markets, Entrepreneurships / Startup, B2C / B2B PC & Mobile Market, OEM products, notebook, tablet, smartphone, desktop, Software & Hardware Technology, Enterprise Customers (Server HW & Oracle/Microsoft),  \nAccount Management, Key Account Management, Channel Management, Channel Sales, Resellers, Strategy & Business Development, Alliance Management, Contract Negotiation, Solution Sales, Project Management \nMarketing, Market Development, Program / Product Management, Pricing, Competitive Analysis, Partner Ecosystem, Go-to-Market, Demand Generation Activities, Marketing Fund,  \nIntegrated Marketing, ATL/BTL Marketing & PR Communication, Online/Digital Marketing \nCustomer Relations, CRM, Customer Care Management, Service Delivery \nTeam Management,Team Building, Virtual / Cross teams, Leadership, Performance Management, Personnel Management \n \n 21 years of experience in the IT and Telco industry with Sales, Marketing and Customer Relations related jobs in Multinational Companies. Interested in Senior Level positions for Turkey and Emerging regions. \n \nSpecialties:  \nInformation Technologies, Telco Services, Enterprise / Retail Segments, Emerging Markets, Entrepreneurships / Startup, B2C / B2B PC & Mobile Market, OEM products, notebook, tablet, smartphone, desktop, Software & Hardware Technology, Enterprise Customers (Server HW & Oracle/Microsoft),  \nAccount Management, Key Account Management, Channel Management, Channel Sales, Resellers, Strategy & Business Development, Alliance Management, Contract Negotiation, Solution Sales, Project Management \nMarketing, Market Development, Program / Product Management, Pricing, Competitive Analysis, Partner Ecosystem, Go-to-Market, Demand Generation Activities, Marketing Fund,  \nIntegrated Marketing, ATL/BTL Marketing & PR Communication, Online/Digital Marketing \nCustomer Relations, CRM, Customer Care Management, Service Delivery \nTeam Management,Team Building, Virtual / Cross teams, Leadership, Performance Management, Personnel Management \n \n 21 years of experience in the IT and Telco industry with Sales, Marketing and Customer Relations related jobs in Multinational Companies. Interested in Senior Level positions for Turkey and Emerging regions. \n \nSpecialties:  \nInformation Technologies, Telco Services, Enterprise / Retail Segments, Emerging Markets, Entrepreneurships / Startup, B2C / B2B PC & Mobile Market, OEM products, notebook, tablet, smartphone, desktop, Software & Hardware Technology, Enterprise Customers (Server HW & Oracle/Microsoft),  \nAccount Management, Key Account Management, Channel Management, Channel Sales, Resellers, Strategy & Business Development, Alliance Management, Contract Negotiation, Solution Sales, Project Management \nMarketing, Market Development, Program / Product Management, Pricing, Competitive Analysis, Partner Ecosystem, Go-to-Market, Demand Generation Activities, Marketing Fund,  \nIntegrated Marketing, ATL/BTL Marketing & PR Communication, Online/Digital Marketing \nCustomer Relations, CRM, Customer Care Management, Service Delivery \nTeam Management,Team Building, Virtual / Cross teams, Leadership, Performance Management, Personnel Management \n \n Experience Director of Customer Care Turk Telekom August 2013  –  March 2015  (1 year 8 months) Istanbul, Turkey Outbound and Inbound Call Center Operations, Service Quality Management, Customer Retention Activities, Document Management, Complaint Management, Customer Services, Customer Experience, Channel Management Consumer Sales Director Turk Telekom July 2011  –  July 2013  (2 years 1 month) Istanbul, Turkey Responsible for Strategy and Performance Management, Device Management, Sales Support, Sales System Development, Alternative Channels, Trade Marketing Market Development Manager Intel Corporation September 2007  –  July 2011  (3 years 11 months) Responsible for marketing and influencing activities in Multinational Accounts for both PC and Server businesses. Middle East Turkey Africa Notebook Business Development Manager Intel Corporation August 2006  –  September 2007  (1 year 2 months) Develop the Notebook business in the channel customers of META Middle East Turkey Africa Region Public Sector Manager Intel Corporation September 2005  –  June 2006  (10 months) Member of the Europe Marketing Organization, responsible to coordinate, launch, drive & scale Government Assisted Purchasing Programs and SMB GTMs in 12 countries through local and multinational players. Turkey Business Development Manager Intel Corporation March 2003  –  August 2005  (2 years 6 months) Developing the relations with Enterprise sector in Turkey. \nMostly focusing in Government, Education, Finance and Telco sectors. Sales Manager Orange Business Services (France Telekom) February 1998  –  February 2003  (5 years 1 month) Managing big accounts and multinational telco projects. Sales Support Manager Armada Bilgisayar A.S. 1994  –  1996  (2 years) Managing all pre-sales activities Director of Customer Care Turk Telekom August 2013  –  March 2015  (1 year 8 months) Istanbul, Turkey Outbound and Inbound Call Center Operations, Service Quality Management, Customer Retention Activities, Document Management, Complaint Management, Customer Services, Customer Experience, Channel Management Director of Customer Care Turk Telekom August 2013  –  March 2015  (1 year 8 months) Istanbul, Turkey Outbound and Inbound Call Center Operations, Service Quality Management, Customer Retention Activities, Document Management, Complaint Management, Customer Services, Customer Experience, Channel Management Consumer Sales Director Turk Telekom July 2011  –  July 2013  (2 years 1 month) Istanbul, Turkey Responsible for Strategy and Performance Management, Device Management, Sales Support, Sales System Development, Alternative Channels, Trade Marketing Consumer Sales Director Turk Telekom July 2011  –  July 2013  (2 years 1 month) Istanbul, Turkey Responsible for Strategy and Performance Management, Device Management, Sales Support, Sales System Development, Alternative Channels, Trade Marketing Market Development Manager Intel Corporation September 2007  –  July 2011  (3 years 11 months) Responsible for marketing and influencing activities in Multinational Accounts for both PC and Server businesses. Market Development Manager Intel Corporation September 2007  –  July 2011  (3 years 11 months) Responsible for marketing and influencing activities in Multinational Accounts for both PC and Server businesses. Middle East Turkey Africa Notebook Business Development Manager Intel Corporation August 2006  –  September 2007  (1 year 2 months) Develop the Notebook business in the channel customers of META Middle East Turkey Africa Notebook Business Development Manager Intel Corporation August 2006  –  September 2007  (1 year 2 months) Develop the Notebook business in the channel customers of META Middle East Turkey Africa Region Public Sector Manager Intel Corporation September 2005  –  June 2006  (10 months) Member of the Europe Marketing Organization, responsible to coordinate, launch, drive & scale Government Assisted Purchasing Programs and SMB GTMs in 12 countries through local and multinational players. Middle East Turkey Africa Region Public Sector Manager Intel Corporation September 2005  –  June 2006  (10 months) Member of the Europe Marketing Organization, responsible to coordinate, launch, drive & scale Government Assisted Purchasing Programs and SMB GTMs in 12 countries through local and multinational players. Turkey Business Development Manager Intel Corporation March 2003  –  August 2005  (2 years 6 months) Developing the relations with Enterprise sector in Turkey. \nMostly focusing in Government, Education, Finance and Telco sectors. Turkey Business Development Manager Intel Corporation March 2003  –  August 2005  (2 years 6 months) Developing the relations with Enterprise sector in Turkey. \nMostly focusing in Government, Education, Finance and Telco sectors. Sales Manager Orange Business Services (France Telekom) February 1998  –  February 2003  (5 years 1 month) Managing big accounts and multinational telco projects. Sales Manager Orange Business Services (France Telekom) February 1998  –  February 2003  (5 years 1 month) Managing big accounts and multinational telco projects. Sales Support Manager Armada Bilgisayar A.S. 1994  –  1996  (2 years) Managing all pre-sales activities Sales Support Manager Armada Bilgisayar A.S. 1994  –  1996  (2 years) Managing all pre-sales activities Languages English Full professional proficiency Turkish Native or bilingual proficiency English Full professional proficiency Turkish Native or bilingual proficiency English Full professional proficiency Turkish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Account Management Channel Sales Support Telco Channel Management Telecommunications Key Account Management New Business Development Sales Management Team Management Direct Sales Wireless International Sales Pre-sales People Management Key Account Development Marketing Management Integration IT Solutions Computer Hardware Computers Sales Compensation... Strategic Planning Sales Operations Management Product Marketing Mobile Devices Strategy Channel Partners Program Management Business Development Go-to-market Strategy Competitive Analysis Sales Compensation... Project Planning See 20+     See less Skills  Account Management Channel Sales Support Telco Channel Management Telecommunications Key Account Management New Business Development Sales Management Team Management Direct Sales Wireless International Sales Pre-sales People Management Key Account Development Marketing Management Integration IT Solutions Computer Hardware Computers Sales Compensation... Strategic Planning Sales Operations Management Product Marketing Mobile Devices Strategy Channel Partners Program Management Business Development Go-to-market Strategy Competitive Analysis Sales Compensation... Project Planning See 20+     See less Account Management Channel Sales Support Telco Channel Management Telecommunications Key Account Management New Business Development Sales Management Team Management Direct Sales Wireless International Sales Pre-sales People Management Key Account Development Marketing Management Integration IT Solutions Computer Hardware Computers Sales Compensation... Strategic Planning Sales Operations Management Product Marketing Mobile Devices Strategy Channel Partners Program Management Business Development Go-to-market Strategy Competitive Analysis Sales Compensation... Project Planning See 20+     See less Account Management Channel Sales Support Telco Channel Management Telecommunications Key Account Management New Business Development Sales Management Team Management Direct Sales Wireless International Sales Pre-sales People Management Key Account Development Marketing Management Integration IT Solutions Computer Hardware Computers Sales Compensation... Strategic Planning Sales Operations Management Product Marketing Mobile Devices Strategy Channel Partners Program Management Business Development Go-to-market Strategy Competitive Analysis Sales Compensation... Project Planning See 20+     See less Education Istanbul Technical University MS,  Executive MBA September 2000  – June 2001 Graduated with 3rd degree Bosphorous University BS,  Computer Engineering September 1990  – July 1994 I have been an active member of 2 students clubs which are Engineering Society and Computer Club Activities and Societies:  ENSO (Engineering Society) and Computer Club Bosphorus University Good,  Computer Engineering 1990  – 1994 Activities and Societies:  Engineering Society ,  IT Club Istanbul Technical University MS,  Executive MBA September 2000  – June 2001 Graduated with 3rd degree Istanbul Technical University MS,  Executive MBA September 2000  – June 2001 Graduated with 3rd degree Istanbul Technical University MS,  Executive MBA September 2000  – June 2001 Graduated with 3rd degree Bosphorous University BS,  Computer Engineering September 1990  – July 1994 I have been an active member of 2 students clubs which are Engineering Society and Computer Club Activities and Societies:  ENSO (Engineering Society) and Computer Club Bosphorous University BS,  Computer Engineering September 1990  – July 1994 I have been an active member of 2 students clubs which are Engineering Society and Computer Club Activities and Societies:  ENSO (Engineering Society) and Computer Club Bosphorous University BS,  Computer Engineering September 1990  – July 1994 I have been an active member of 2 students clubs which are Engineering Society and Computer Club Activities and Societies:  ENSO (Engineering Society) and Computer Club Bosphorus University Good,  Computer Engineering 1990  – 1994 Activities and Societies:  Engineering Society ,  IT Club Bosphorus University Good,  Computer Engineering 1990  – 1994 Activities and Societies:  Engineering Society ,  IT Club Bosphorus University Good,  Computer Engineering 1990  – 1994 Activities and Societies:  Engineering Society ,  IT Club Honors & Awards Additional Honors & Awards Got 5 Intel EMEA Recognition Awards between 2003-2008 by the successful Government projects.  \nGot the “Top Gun of The Year 2000 Award” in the sales contest among the Worldwide Equant Sales Offices.  \nEntered the “Hundred Percent Club” in 1999 by winning the personal sales quota competition in Equant EMEA region. \nGraduated with the 3rd degree from Istanbul Technical University, Executive MBA program \nEntered the first 100 out of 1M people in the University Entrance Exam \nGraduated with the 1st degree from Maltepe Military High School (1800 students) \nBronze Award from Tübitak (The Scientific and Technical Research Council of Turkey) on the National Science Contest among High School Students. Additional Honors & Awards Got 5 Intel EMEA Recognition Awards between 2003-2008 by the successful Government projects.  \nGot the “Top Gun of The Year 2000 Award” in the sales contest among the Worldwide Equant Sales Offices.  \nEntered the “Hundred Percent Club” in 1999 by winning the personal sales quota competition in Equant EMEA region. \nGraduated with the 3rd degree from Istanbul Technical University, Executive MBA program \nEntered the first 100 out of 1M people in the University Entrance Exam \nGraduated with the 1st degree from Maltepe Military High School (1800 students) \nBronze Award from Tübitak (The Scientific and Technical Research Council of Turkey) on the National Science Contest among High School Students. Additional Honors & Awards Got 5 Intel EMEA Recognition Awards between 2003-2008 by the successful Government projects.  \nGot the “Top Gun of The Year 2000 Award” in the sales contest among the Worldwide Equant Sales Offices.  \nEntered the “Hundred Percent Club” in 1999 by winning the personal sales quota competition in Equant EMEA region. \nGraduated with the 3rd degree from Istanbul Technical University, Executive MBA program \nEntered the first 100 out of 1M people in the University Entrance Exam \nGraduated with the 1st degree from Maltepe Military High School (1800 students) \nBronze Award from Tübitak (The Scientific and Technical Research Council of Turkey) on the National Science Contest among High School Students. Additional Honors & Awards Got 5 Intel EMEA Recognition Awards between 2003-2008 by the successful Government projects.  \nGot the “Top Gun of The Year 2000 Award” in the sales contest among the Worldwide Equant Sales Offices.  \nEntered the “Hundred Percent Club” in 1999 by winning the personal sales quota competition in Equant EMEA region. \nGraduated with the 3rd degree from Istanbul Technical University, Executive MBA program \nEntered the first 100 out of 1M people in the University Entrance Exam \nGraduated with the 1st degree from Maltepe Military High School (1800 students) \nBronze Award from Tübitak (The Scientific and Technical Research Council of Turkey) on the National Science Contest among High School Students. ", "Summary Semiconductor and intellectual property sales and business development executive, with in-depth knowledge of ARM and Intel Architecture microprocessors, and smartphone and tablet design. Experienced in managing technical sales and marketing personnel, strategic account/partner management, operations, field and factory applications engineering. Summary Semiconductor and intellectual property sales and business development executive, with in-depth knowledge of ARM and Intel Architecture microprocessors, and smartphone and tablet design. Experienced in managing technical sales and marketing personnel, strategic account/partner management, operations, field and factory applications engineering. Semiconductor and intellectual property sales and business development executive, with in-depth knowledge of ARM and Intel Architecture microprocessors, and smartphone and tablet design. Experienced in managing technical sales and marketing personnel, strategic account/partner management, operations, field and factory applications engineering. Semiconductor and intellectual property sales and business development executive, with in-depth knowledge of ARM and Intel Architecture microprocessors, and smartphone and tablet design. Experienced in managing technical sales and marketing personnel, strategic account/partner management, operations, field and factory applications engineering. Experience Senior Business Development Manager Intel Corporation July 2012  – Present (3 years 2 months) Austin, Texas Area Business Development Manager Intel Corporation June 2010  –  June 2012  (2 years 1 month) Austin, Texas Area Consultant Mentor Graphics April 2010  –  June 2010  (3 months) Austin, Texas Area Senior Business Development Manager VMware October 2008  –  January 2010  (1 year 4 months) Austin, Texas Area Member of Technology Advisory Board Minah Ventures March 2005  –  December 2009  (4 years 10 months) Austin, Texas Area Senior Vice President and General Manager Trango Virtual Processors March 2007  –  October 2008  (1 year 8 months) Austin, Texas Area Director of Fabric IP Marketing ARM January 2006  –  February 2007  (1 year 2 months) Austin, Texas Area Director of Field Applications Engineering ARM August 2003  –  December 2005  (2 years 5 months) Austin, Texas Area Senior Partner Sales Manager ARM October 2000  –  December 2005  (5 years 3 months) Austin, Texas Area Field Applications Engineer Advanced RISC Machines March 1997  –  September 2000  (3 years 7 months) Austin, Texas Area Senior Computer Engineer Dell August 1996  –  February 1997  (7 months) Austin, Texas Area Staff PowerPC Applications Engineer Motorola Semiconductor July 1992  –  July 1996  (4 years 1 month) Austin, Texas Area Senior Computer Engineer Motorola June 1989  –  July 1992  (3 years 2 months) Greater Chicago Area Computer Engineer IBM May 1988  –  August 1988  (4 months) Rochester, Minnesota Area Senior Business Development Manager Intel Corporation July 2012  – Present (3 years 2 months) Austin, Texas Area Senior Business Development Manager Intel Corporation July 2012  – Present (3 years 2 months) Austin, Texas Area Business Development Manager Intel Corporation June 2010  –  June 2012  (2 years 1 month) Austin, Texas Area Business Development Manager Intel Corporation June 2010  –  June 2012  (2 years 1 month) Austin, Texas Area Consultant Mentor Graphics April 2010  –  June 2010  (3 months) Austin, Texas Area Consultant Mentor Graphics April 2010  –  June 2010  (3 months) Austin, Texas Area Senior Business Development Manager VMware October 2008  –  January 2010  (1 year 4 months) Austin, Texas Area Senior Business Development Manager VMware October 2008  –  January 2010  (1 year 4 months) Austin, Texas Area Member of Technology Advisory Board Minah Ventures March 2005  –  December 2009  (4 years 10 months) Austin, Texas Area Member of Technology Advisory Board Minah Ventures March 2005  –  December 2009  (4 years 10 months) Austin, Texas Area Senior Vice President and General Manager Trango Virtual Processors March 2007  –  October 2008  (1 year 8 months) Austin, Texas Area Senior Vice President and General Manager Trango Virtual Processors March 2007  –  October 2008  (1 year 8 months) Austin, Texas Area Director of Fabric IP Marketing ARM January 2006  –  February 2007  (1 year 2 months) Austin, Texas Area Director of Fabric IP Marketing ARM January 2006  –  February 2007  (1 year 2 months) Austin, Texas Area Director of Field Applications Engineering ARM August 2003  –  December 2005  (2 years 5 months) Austin, Texas Area Director of Field Applications Engineering ARM August 2003  –  December 2005  (2 years 5 months) Austin, Texas Area Senior Partner Sales Manager ARM October 2000  –  December 2005  (5 years 3 months) Austin, Texas Area Senior Partner Sales Manager ARM October 2000  –  December 2005  (5 years 3 months) Austin, Texas Area Field Applications Engineer Advanced RISC Machines March 1997  –  September 2000  (3 years 7 months) Austin, Texas Area Field Applications Engineer Advanced RISC Machines March 1997  –  September 2000  (3 years 7 months) Austin, Texas Area Senior Computer Engineer Dell August 1996  –  February 1997  (7 months) Austin, Texas Area Senior Computer Engineer Dell August 1996  –  February 1997  (7 months) Austin, Texas Area Staff PowerPC Applications Engineer Motorola Semiconductor July 1992  –  July 1996  (4 years 1 month) Austin, Texas Area Staff PowerPC Applications Engineer Motorola Semiconductor July 1992  –  July 1996  (4 years 1 month) Austin, Texas Area Senior Computer Engineer Motorola June 1989  –  July 1992  (3 years 2 months) Greater Chicago Area Senior Computer Engineer Motorola June 1989  –  July 1992  (3 years 2 months) Greater Chicago Area Computer Engineer IBM May 1988  –  August 1988  (4 months) Rochester, Minnesota Area Computer Engineer IBM May 1988  –  August 1988  (4 months) Rochester, Minnesota Area Languages English English English Skills Microprocessors Virtualization Semiconductors Embedded Systems Mobile Communications Embedded Software Mobile Wireless Mobile Technology Start-ups IP Telecommunications Mobile Software ARM New Business Development Key Account Management Licensing X86 Team Leadership Strategy Development Hardware Contract Negotiations Customer Engagement Product Strategy Strategic Partnerships OEM Mobile Devices Strategy Product Management Sales Technical Product Sales Technical Sales... Sales Management Business Strategy Business Development SoC ASIC Cross-functional Team... Product Marketing Contract Negotiation SaaS Consumer Electronics Go-to-market Strategy Integration Product Launch Cloud Computing Competitive Analysis Processors Technical Marketing Business Alliances See 35+     See less Skills  Microprocessors Virtualization Semiconductors Embedded Systems Mobile Communications Embedded Software Mobile Wireless Mobile Technology Start-ups IP Telecommunications Mobile Software ARM New Business Development Key Account Management Licensing X86 Team Leadership Strategy Development Hardware Contract Negotiations Customer Engagement Product Strategy Strategic Partnerships OEM Mobile Devices Strategy Product Management Sales Technical Product Sales Technical Sales... Sales Management Business Strategy Business Development SoC ASIC Cross-functional Team... Product Marketing Contract Negotiation SaaS Consumer Electronics Go-to-market Strategy Integration Product Launch Cloud Computing Competitive Analysis Processors Technical Marketing Business Alliances See 35+     See less Microprocessors Virtualization Semiconductors Embedded Systems Mobile Communications Embedded Software Mobile Wireless Mobile Technology Start-ups IP Telecommunications Mobile Software ARM New Business Development Key Account Management Licensing X86 Team Leadership Strategy Development Hardware Contract Negotiations Customer Engagement Product Strategy Strategic Partnerships OEM Mobile Devices Strategy Product Management Sales Technical Product Sales Technical Sales... Sales Management Business Strategy Business Development SoC ASIC Cross-functional Team... Product Marketing Contract Negotiation SaaS Consumer Electronics Go-to-market Strategy Integration Product Launch Cloud Computing Competitive Analysis Processors Technical Marketing Business Alliances See 35+     See less Microprocessors Virtualization Semiconductors Embedded Systems Mobile Communications Embedded Software Mobile Wireless Mobile Technology Start-ups IP Telecommunications Mobile Software ARM New Business Development Key Account Management Licensing X86 Team Leadership Strategy Development Hardware Contract Negotiations Customer Engagement Product Strategy Strategic Partnerships OEM Mobile Devices Strategy Product Management Sales Technical Product Sales Technical Sales... Sales Management Business Strategy Business Development SoC ASIC Cross-functional Team... Product Marketing Contract Negotiation SaaS Consumer Electronics Go-to-market Strategy Integration Product Launch Cloud Computing Competitive Analysis Processors Technical Marketing Business Alliances See 35+     See less Education St. Edward's University MBA August 1998  – May 2001 Illinois Institute of Technology MSEE 1989  – 1993 Iowa State University BSCprE 1984  – 1989 St. Edward's University MBA August 1998  – May 2001 St. Edward's University MBA August 1998  – May 2001 St. Edward's University MBA August 1998  – May 2001 Illinois Institute of Technology MSEE 1989  – 1993 Illinois Institute of Technology MSEE 1989  – 1993 Illinois Institute of Technology MSEE 1989  – 1993 Iowa State University BSCprE 1984  – 1989 Iowa State University BSCprE 1984  – 1989 Iowa State University BSCprE 1984  – 1989 Honors & Awards ", "Summary - 9 + year experience in embedded / PC market \n 3 years segment Marketing & Sales in Intel embedded and software field \n 6 Plus years of PM (Product and Project Management) experience in Embedded (Thin client,  \nPOS and IPC) and PC (Notebook / Desktop and AIO) market \n- Handle key embedded account with strong eco-system partner customer relationship \n- Manage CPU product life cycle from Product launch/ Product marketing / Design in / EOL \n- Allocate and coordinate internal / external resource to solve customer issue \n- Develop product positioning and value proposition to drive demand \n- Strong market research analyze and sale “solution” capability \n- Develop and execute marketing strategies for target account \n- Positive, team-work, leadership Summary - 9 + year experience in embedded / PC market \n 3 years segment Marketing & Sales in Intel embedded and software field \n 6 Plus years of PM (Product and Project Management) experience in Embedded (Thin client,  \nPOS and IPC) and PC (Notebook / Desktop and AIO) market \n- Handle key embedded account with strong eco-system partner customer relationship \n- Manage CPU product life cycle from Product launch/ Product marketing / Design in / EOL \n- Allocate and coordinate internal / external resource to solve customer issue \n- Develop product positioning and value proposition to drive demand \n- Strong market research analyze and sale “solution” capability \n- Develop and execute marketing strategies for target account \n- Positive, team-work, leadership - 9 + year experience in embedded / PC market \n 3 years segment Marketing & Sales in Intel embedded and software field \n 6 Plus years of PM (Product and Project Management) experience in Embedded (Thin client,  \nPOS and IPC) and PC (Notebook / Desktop and AIO) market \n- Handle key embedded account with strong eco-system partner customer relationship \n- Manage CPU product life cycle from Product launch/ Product marketing / Design in / EOL \n- Allocate and coordinate internal / external resource to solve customer issue \n- Develop product positioning and value proposition to drive demand \n- Strong market research analyze and sale “solution” capability \n- Develop and execute marketing strategies for target account \n- Positive, team-work, leadership - 9 + year experience in embedded / PC market \n 3 years segment Marketing & Sales in Intel embedded and software field \n 6 Plus years of PM (Product and Project Management) experience in Embedded (Thin client,  \nPOS and IPC) and PC (Notebook / Desktop and AIO) market \n- Handle key embedded account with strong eco-system partner customer relationship \n- Manage CPU product life cycle from Product launch/ Product marketing / Design in / EOL \n- Allocate and coordinate internal / external resource to solve customer issue \n- Develop product positioning and value proposition to drive demand \n- Strong market research analyze and sale “solution” capability \n- Develop and execute marketing strategies for target account \n- Positive, team-work, leadership Experience Regional Business Development Manager Intel Corporation October 2011  – Present (3 years 11 months) Regional Business Development Manager Intel Corporation October 2011  –  May 2014  (2 years 8 months) Taiwan Develop the business strategy, program and marketing activities for demand creation, generated new deals by Intel solution.  \nCo-sell segment ODM to OEM for match making opportunities \nWork with the cross-functional team (product, engineering, and marketing) to grow the market share in ecosystem partner CPU Product Marketing VIA Technologies, Inc. August 2005  –  October 2011  (6 years 3 months) Taiwan Match VIA platform with ODMs project (Spec, design, technical support)  \nHandle key embedded account with strong eco-system partner customer relationship \nManage CPU product life cycle from Product launch/ Product marketing / Design in / EOL \nAllocate and coordinate internal / external resource to solve customer issue \nDevelop product positioning and value proposition to drive demand \nDevelop and execute marketing strategies for target account Regional Business Development Manager Intel Corporation October 2011  – Present (3 years 11 months) Regional Business Development Manager Intel Corporation October 2011  – Present (3 years 11 months) Regional Business Development Manager Intel Corporation October 2011  –  May 2014  (2 years 8 months) Taiwan Develop the business strategy, program and marketing activities for demand creation, generated new deals by Intel solution.  \nCo-sell segment ODM to OEM for match making opportunities \nWork with the cross-functional team (product, engineering, and marketing) to grow the market share in ecosystem partner Regional Business Development Manager Intel Corporation October 2011  –  May 2014  (2 years 8 months) Taiwan Develop the business strategy, program and marketing activities for demand creation, generated new deals by Intel solution.  \nCo-sell segment ODM to OEM for match making opportunities \nWork with the cross-functional team (product, engineering, and marketing) to grow the market share in ecosystem partner CPU Product Marketing VIA Technologies, Inc. August 2005  –  October 2011  (6 years 3 months) Taiwan Match VIA platform with ODMs project (Spec, design, technical support)  \nHandle key embedded account with strong eco-system partner customer relationship \nManage CPU product life cycle from Product launch/ Product marketing / Design in / EOL \nAllocate and coordinate internal / external resource to solve customer issue \nDevelop product positioning and value proposition to drive demand \nDevelop and execute marketing strategies for target account CPU Product Marketing VIA Technologies, Inc. August 2005  –  October 2011  (6 years 3 months) Taiwan Match VIA platform with ODMs project (Spec, design, technical support)  \nHandle key embedded account with strong eco-system partner customer relationship \nManage CPU product life cycle from Product launch/ Product marketing / Design in / EOL \nAllocate and coordinate internal / external resource to solve customer issue \nDevelop product positioning and value proposition to drive demand \nDevelop and execute marketing strategies for target account Languages English Chinese English Chinese English Chinese Skills Project Management Product Management Product Marketing Sales Management Presentations Marketing Strategy Market Research Public Speaking Ecosystem Management Business Development Cross-functional Team... Sales Product Launch Skills  Project Management Product Management Product Marketing Sales Management Presentations Marketing Strategy Market Research Public Speaking Ecosystem Management Business Development Cross-functional Team... Sales Product Launch Project Management Product Management Product Marketing Sales Management Presentations Marketing Strategy Market Research Public Speaking Ecosystem Management Business Development Cross-functional Team... Sales Product Launch Project Management Product Management Product Marketing Sales Management Presentations Marketing Strategy Market Research Public Speaking Ecosystem Management Business Development Cross-functional Team... Sales Product Launch Education National Tsing - Hua University Master,  Technology Management 2003  – 2005 Activities and Societies:  Awards for technology management master thesis 2005 Fu Jen Catholic University Dual Bachelor,  Business Management & History 1998  – 2003 Activities and Societies:  President of History department in Fu Jen University ,  2000~2001\nPresident of dance club and member in VIA technologies ,  2006~2007 National Tsing - Hua University Master,  Technology Management 2003  – 2005 Activities and Societies:  Awards for technology management master thesis 2005 National Tsing - Hua University Master,  Technology Management 2003  – 2005 Activities and Societies:  Awards for technology management master thesis 2005 National Tsing - Hua University Master,  Technology Management 2003  – 2005 Activities and Societies:  Awards for technology management master thesis 2005 Fu Jen Catholic University Dual Bachelor,  Business Management & History 1998  – 2003 Activities and Societies:  President of History department in Fu Jen University ,  2000~2001\nPresident of dance club and member in VIA technologies ,  2006~2007 Fu Jen Catholic University Dual Bachelor,  Business Management & History 1998  – 2003 Activities and Societies:  President of History department in Fu Jen University ,  2000~2001\nPresident of dance club and member in VIA technologies ,  2006~2007 Fu Jen Catholic University Dual Bachelor,  Business Management & History 1998  – 2003 Activities and Societies:  President of History department in Fu Jen University ,  2000~2001\nPresident of dance club and member in VIA technologies ,  2006~2007 ", "Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Channel Sales Mobile Devices Product Marketing Product Management Go-to-market Strategy Business Alliances Strategic Partnerships Account Management Management Channel Partners Business Development Team Leadership Demand Generation Telecommunications International Sales Sales Operations Cross-functional Team... Multi-channel Marketing Partner Management Wireless B2B Competitive Analysis Solution Selling Forecasting Strategy Direct Sales Key Account Management SaaS Channel Sales Consumer Electronics Sales Process Sales Management Sales Enablement Managed Services Business Strategy Data Center Semiconductors Professional Services Semiconductor Industry Marketing Strategy Business Planning International Business Strategic Alliances VoIP Distribution Strategies Team Management HP New Business Development See 34+     See less Skills  Channel Sales Mobile Devices Product Marketing Product Management Go-to-market Strategy Business Alliances Strategic Partnerships Account Management Management Channel Partners Business Development Team Leadership Demand Generation Telecommunications International Sales Sales Operations Cross-functional Team... Multi-channel Marketing Partner Management Wireless B2B Competitive Analysis Solution Selling Forecasting Strategy Direct Sales Key Account Management SaaS Channel Sales Consumer Electronics Sales Process Sales Management Sales Enablement Managed Services Business Strategy Data Center Semiconductors Professional Services Semiconductor Industry Marketing Strategy Business Planning International Business Strategic Alliances VoIP Distribution Strategies Team Management HP New Business Development See 34+     See less Channel Sales Mobile Devices Product Marketing Product Management Go-to-market Strategy Business Alliances Strategic Partnerships Account Management Management Channel Partners Business Development Team Leadership Demand Generation Telecommunications International Sales Sales Operations Cross-functional Team... Multi-channel Marketing Partner Management Wireless B2B Competitive Analysis Solution Selling Forecasting Strategy Direct Sales Key Account Management SaaS Channel Sales Consumer Electronics Sales Process Sales Management Sales Enablement Managed Services Business Strategy Data Center Semiconductors Professional Services Semiconductor Industry Marketing Strategy Business Planning International Business Strategic Alliances VoIP Distribution Strategies Team Management HP New Business Development See 34+     See less Channel Sales Mobile Devices Product Marketing Product Management Go-to-market Strategy Business Alliances Strategic Partnerships Account Management Management Channel Partners Business Development Team Leadership Demand Generation Telecommunications International Sales Sales Operations Cross-functional Team... Multi-channel Marketing Partner Management Wireless B2B Competitive Analysis Solution Selling Forecasting Strategy Direct Sales Key Account Management SaaS Channel Sales Consumer Electronics Sales Process Sales Management Sales Enablement Managed Services Business Strategy Data Center Semiconductors Professional Services Semiconductor Industry Marketing Strategy Business Planning International Business Strategic Alliances VoIP Distribution Strategies Team Management HP New Business Development See 34+     See less ", "Experience Information Security Business Development Manager Intel Corporation June 2015  – Present (3 months) Chandler AZ Strategic Business Development Manager Intel Corporation July 2012  –  May 2015  (2 years 11 months) United States Manage Education and FSI Software Ecosystem Enabling for Intel Architecture \n-Windows and Android Intel Architecture Ecosystem enabling  \n-Partner with Key Software ISV's to introduce Next Generation Intel Platform features  \n-Coordinate Goto Market/Demo Activities for Software partners with Marketing teams Business Development Manager Intel April 2011  –  July 2012  (1 year 4 months) Memory Industry Ecosystem Enabling: \nOwn OEM communication for Memory Ecosystem Enabling \nManage High density server memory requirements task force \n-LRDIMM Enabling \nProgram manager for Microserver memory enabling Technical Marketing Engineer/Platform Application Engineer Intel June 2009  –  April 2011  (1 year 11 months) United States Supported Intel's Data Center Group's Customers \nOwn resolving any Server memory related customer questions/issues and escalate then to appropriate channels when required. \nOwn Different Customer Collateral like EDS and Memory POR communication Demand Analyst Intel June 2007  –  June 2009  (2 years 1 month) Long range business planning \nDemand analyst for Server platforms group. Primary responsibilities include forecasting demand for LRP horizon based on market conditions and presenting to GM.  \nResponsible for doing Competitive analysis for SVR roadmap in order to forecast MSS. \nnteract with key marketing and finance stakeholders to get inputs on pricing and marketing strategies and influence them based on FAB/AT issues. \nResponsible for coordinating with FAB/AT in balancing the supply chain.\t \nCoordinated Quarterly LRP Process for Consumer Electronics Group and Chanel Platforms Group with a goal of ratifying demand forecast. \nOwned analyzing and publishing CPU market size. Sr design engineer Intel August 2000  –  June 2007  (6 years 11 months) United States Micro architect for physical/initialization layer for PCI express. \nManaged micro schedule for design/validation for physical layer of PCI Express. Drove completion of design and validation at corresponding milestones. \nDrove effort to change to improve validation methodology based on post silicon feedback.  \nInteracted with engineers from up to 5 different sites spread across America, Malaysia and India. Different parts of the design were done in different sites and I was involved in driving validation activities for PCI express with engineers located in different sites. \nInteracted with external customers like graphics card vendors for exchanging traces and solving common problems.  \nRepresented the design team in PCIE 2.0 coordination meeting for tracking new spec developments. Responsible for influencing the spec coordination team to address desktop/mobile chipset’s concerns. Communicated with other chipsets groups in Intel to address common problems and create a common voice to influence PCI express spec \nWorked on design team for Infiniband technology in the server chipset group. Information Security Business Development Manager Intel Corporation June 2015  – Present (3 months) Chandler AZ Information Security Business Development Manager Intel Corporation June 2015  – Present (3 months) Chandler AZ Strategic Business Development Manager Intel Corporation July 2012  –  May 2015  (2 years 11 months) United States Manage Education and FSI Software Ecosystem Enabling for Intel Architecture \n-Windows and Android Intel Architecture Ecosystem enabling  \n-Partner with Key Software ISV's to introduce Next Generation Intel Platform features  \n-Coordinate Goto Market/Demo Activities for Software partners with Marketing teams Strategic Business Development Manager Intel Corporation July 2012  –  May 2015  (2 years 11 months) United States Manage Education and FSI Software Ecosystem Enabling for Intel Architecture \n-Windows and Android Intel Architecture Ecosystem enabling  \n-Partner with Key Software ISV's to introduce Next Generation Intel Platform features  \n-Coordinate Goto Market/Demo Activities for Software partners with Marketing teams Business Development Manager Intel April 2011  –  July 2012  (1 year 4 months) Memory Industry Ecosystem Enabling: \nOwn OEM communication for Memory Ecosystem Enabling \nManage High density server memory requirements task force \n-LRDIMM Enabling \nProgram manager for Microserver memory enabling Business Development Manager Intel April 2011  –  July 2012  (1 year 4 months) Memory Industry Ecosystem Enabling: \nOwn OEM communication for Memory Ecosystem Enabling \nManage High density server memory requirements task force \n-LRDIMM Enabling \nProgram manager for Microserver memory enabling Technical Marketing Engineer/Platform Application Engineer Intel June 2009  –  April 2011  (1 year 11 months) United States Supported Intel's Data Center Group's Customers \nOwn resolving any Server memory related customer questions/issues and escalate then to appropriate channels when required. \nOwn Different Customer Collateral like EDS and Memory POR communication Technical Marketing Engineer/Platform Application Engineer Intel June 2009  –  April 2011  (1 year 11 months) United States Supported Intel's Data Center Group's Customers \nOwn resolving any Server memory related customer questions/issues and escalate then to appropriate channels when required. \nOwn Different Customer Collateral like EDS and Memory POR communication Demand Analyst Intel June 2007  –  June 2009  (2 years 1 month) Long range business planning \nDemand analyst for Server platforms group. Primary responsibilities include forecasting demand for LRP horizon based on market conditions and presenting to GM.  \nResponsible for doing Competitive analysis for SVR roadmap in order to forecast MSS. \nnteract with key marketing and finance stakeholders to get inputs on pricing and marketing strategies and influence them based on FAB/AT issues. \nResponsible for coordinating with FAB/AT in balancing the supply chain.\t \nCoordinated Quarterly LRP Process for Consumer Electronics Group and Chanel Platforms Group with a goal of ratifying demand forecast. \nOwned analyzing and publishing CPU market size. Demand Analyst Intel June 2007  –  June 2009  (2 years 1 month) Long range business planning \nDemand analyst for Server platforms group. Primary responsibilities include forecasting demand for LRP horizon based on market conditions and presenting to GM.  \nResponsible for doing Competitive analysis for SVR roadmap in order to forecast MSS. \nnteract with key marketing and finance stakeholders to get inputs on pricing and marketing strategies and influence them based on FAB/AT issues. \nResponsible for coordinating with FAB/AT in balancing the supply chain.\t \nCoordinated Quarterly LRP Process for Consumer Electronics Group and Chanel Platforms Group with a goal of ratifying demand forecast. \nOwned analyzing and publishing CPU market size. Sr design engineer Intel August 2000  –  June 2007  (6 years 11 months) United States Micro architect for physical/initialization layer for PCI express. \nManaged micro schedule for design/validation for physical layer of PCI Express. Drove completion of design and validation at corresponding milestones. \nDrove effort to change to improve validation methodology based on post silicon feedback.  \nInteracted with engineers from up to 5 different sites spread across America, Malaysia and India. Different parts of the design were done in different sites and I was involved in driving validation activities for PCI express with engineers located in different sites. \nInteracted with external customers like graphics card vendors for exchanging traces and solving common problems.  \nRepresented the design team in PCIE 2.0 coordination meeting for tracking new spec developments. Responsible for influencing the spec coordination team to address desktop/mobile chipset’s concerns. Communicated with other chipsets groups in Intel to address common problems and create a common voice to influence PCI express spec \nWorked on design team for Infiniband technology in the server chipset group. Sr design engineer Intel August 2000  –  June 2007  (6 years 11 months) United States Micro architect for physical/initialization layer for PCI express. \nManaged micro schedule for design/validation for physical layer of PCI Express. Drove completion of design and validation at corresponding milestones. \nDrove effort to change to improve validation methodology based on post silicon feedback.  \nInteracted with engineers from up to 5 different sites spread across America, Malaysia and India. Different parts of the design were done in different sites and I was involved in driving validation activities for PCI express with engineers located in different sites. \nInteracted with external customers like graphics card vendors for exchanging traces and solving common problems.  \nRepresented the design team in PCIE 2.0 coordination meeting for tracking new spec developments. Responsible for influencing the spec coordination team to address desktop/mobile chipset’s concerns. Communicated with other chipsets groups in Intel to address common problems and create a common voice to influence PCI express spec \nWorked on design team for Infiniband technology in the server chipset group. Languages English Telugu Hindi English Telugu Hindi English Telugu Hindi Skills Information Security Business Development Enterprise Software Product Management Product Marketing Competitive Analysis Semiconductors Intel Cross-functional Team... SoC Software Go-to-market Strategy Program Management Electrical Engineering Microprocessors Product Development See 1+     See less Skills  Information Security Business Development Enterprise Software Product Management Product Marketing Competitive Analysis Semiconductors Intel Cross-functional Team... SoC Software Go-to-market Strategy Program Management Electrical Engineering Microprocessors Product Development See 1+     See less Information Security Business Development Enterprise Software Product Management Product Marketing Competitive Analysis Semiconductors Intel Cross-functional Team... SoC Software Go-to-market Strategy Program Management Electrical Engineering Microprocessors Product Development See 1+     See less Information Security Business Development Enterprise Software Product Management Product Marketing Competitive Analysis Semiconductors Intel Cross-functional Team... SoC Software Go-to-market Strategy Program Management Electrical Engineering Microprocessors Product Development See 1+     See less Education Arizona State University - W. P. Carey School of Business MBA,  International Mgmt 2005  – 2007 Wright State University MS,  Electrical Engineering 1998  – 2000 Activities and Societies:  Indian sudent association president(99-00) GITAM, VIZAG BS,  Electrical Engineering 1994  – 1998 Arizona State University - W. P. Carey School of Business MBA,  International Mgmt 2005  – 2007 Arizona State University - W. P. Carey School of Business MBA,  International Mgmt 2005  – 2007 Arizona State University - W. P. Carey School of Business MBA,  International Mgmt 2005  – 2007 Wright State University MS,  Electrical Engineering 1998  – 2000 Activities and Societies:  Indian sudent association president(99-00) Wright State University MS,  Electrical Engineering 1998  – 2000 Activities and Societies:  Indian sudent association president(99-00) Wright State University MS,  Electrical Engineering 1998  – 2000 Activities and Societies:  Indian sudent association president(99-00) GITAM, VIZAG BS,  Electrical Engineering 1994  – 1998 GITAM, VIZAG BS,  Electrical Engineering 1994  – 1998 GITAM, VIZAG BS,  Electrical Engineering 1994  – 1998 ", "Experience Business Development Manager Intel Corporation December 2009  – Present (5 years 9 months) Santa Clara, CA Product Manager Intel Corporation December 2002  –  December 2009  (7 years 1 month) Hillsboro, OR, Shanghai, China, Santa Clara, CA Business Development Manager Intel Corporation December 2001  –  December 2002  (1 year 1 month) Seattle, Washington Product Manager Intel Corporation July 2000  –  December 2001  (1 year 6 months) Hillsboro, OR, Santa Clara, CA Software Engineer Honeywell International Inc June 1998  –  June 2000  (2 years 1 month) Minneapolis, MN Business Development Manager Intel Corporation December 2009  – Present (5 years 9 months) Santa Clara, CA Business Development Manager Intel Corporation December 2009  – Present (5 years 9 months) Santa Clara, CA Product Manager Intel Corporation December 2002  –  December 2009  (7 years 1 month) Hillsboro, OR, Shanghai, China, Santa Clara, CA Product Manager Intel Corporation December 2002  –  December 2009  (7 years 1 month) Hillsboro, OR, Shanghai, China, Santa Clara, CA Business Development Manager Intel Corporation December 2001  –  December 2002  (1 year 1 month) Seattle, Washington Business Development Manager Intel Corporation December 2001  –  December 2002  (1 year 1 month) Seattle, Washington Product Manager Intel Corporation July 2000  –  December 2001  (1 year 6 months) Hillsboro, OR, Santa Clara, CA Product Manager Intel Corporation July 2000  –  December 2001  (1 year 6 months) Hillsboro, OR, Santa Clara, CA Software Engineer Honeywell International Inc June 1998  –  June 2000  (2 years 1 month) Minneapolis, MN Software Engineer Honeywell International Inc June 1998  –  June 2000  (2 years 1 month) Minneapolis, MN "]}