{"position": "Business Planner", "company": "Intel Corporation", "profiles": ["Summary Results oriented business and non-profit management professional focused on operations and organization management. Skilled at transforming organizational vision into strategic direction and concrete operational plans. Strong leader effective at developing and managing complex financial and operational systems through collaboration and analytical problem solving. Effective manager who has supervised 24 professional, technical, and support staff and a direct budget of $2M. \n \nSpecialties: Strategic analysis,planning, and decision making; systems and process evaluation and improvement; resource planning and management; program development; strategic relationship management; financial planning and analysis; budget development and implementation; staff management and supervision. Summary Results oriented business and non-profit management professional focused on operations and organization management. Skilled at transforming organizational vision into strategic direction and concrete operational plans. Strong leader effective at developing and managing complex financial and operational systems through collaboration and analytical problem solving. Effective manager who has supervised 24 professional, technical, and support staff and a direct budget of $2M. \n \nSpecialties: Strategic analysis,planning, and decision making; systems and process evaluation and improvement; resource planning and management; program development; strategic relationship management; financial planning and analysis; budget development and implementation; staff management and supervision. Results oriented business and non-profit management professional focused on operations and organization management. Skilled at transforming organizational vision into strategic direction and concrete operational plans. Strong leader effective at developing and managing complex financial and operational systems through collaboration and analytical problem solving. Effective manager who has supervised 24 professional, technical, and support staff and a direct budget of $2M. \n \nSpecialties: Strategic analysis,planning, and decision making; systems and process evaluation and improvement; resource planning and management; program development; strategic relationship management; financial planning and analysis; budget development and implementation; staff management and supervision. Results oriented business and non-profit management professional focused on operations and organization management. Skilled at transforming organizational vision into strategic direction and concrete operational plans. Strong leader effective at developing and managing complex financial and operational systems through collaboration and analytical problem solving. Effective manager who has supervised 24 professional, technical, and support staff and a direct budget of $2M. \n \nSpecialties: Strategic analysis,planning, and decision making; systems and process evaluation and improvement; resource planning and management; program development; strategic relationship management; financial planning and analysis; budget development and implementation; staff management and supervision. Experience Deputy Director for Finance and Operations Children's Council of San Francisco February 2013  – Present (2 years 7 months) San Francisco Bay Area Director of Development Operations Jewish Community Federation January 2012  –  January 2013  (1 year 1 month) San Francisco Bay Area Operations and Organizational Consultant Non-profit Agencies January 2010  –  December 2011  (2 years) Associate Director Jewish Community Center of San Francisco April 2006  –  September 2009  (3 years 6 months) San Francisco Director, Operations Planning and Adult Program Services Jewish Community Center of San Francisco May 2001  –  April 2006  (5 years) San Francisco Director of Operations P&B Fabrics, Inc October 1994  –  May 2000  (5 years 8 months) Burlingame, CA Business Planner/Senior Business Planner Intel Corporation June 1990  –  September 1994  (4 years 4 months) Portland, OR and Santa Clara, CA Deputy Director for Finance and Operations Children's Council of San Francisco February 2013  – Present (2 years 7 months) San Francisco Bay Area Deputy Director for Finance and Operations Children's Council of San Francisco February 2013  – Present (2 years 7 months) San Francisco Bay Area Director of Development Operations Jewish Community Federation January 2012  –  January 2013  (1 year 1 month) San Francisco Bay Area Director of Development Operations Jewish Community Federation January 2012  –  January 2013  (1 year 1 month) San Francisco Bay Area Operations and Organizational Consultant Non-profit Agencies January 2010  –  December 2011  (2 years) Operations and Organizational Consultant Non-profit Agencies January 2010  –  December 2011  (2 years) Associate Director Jewish Community Center of San Francisco April 2006  –  September 2009  (3 years 6 months) San Francisco Associate Director Jewish Community Center of San Francisco April 2006  –  September 2009  (3 years 6 months) San Francisco Director, Operations Planning and Adult Program Services Jewish Community Center of San Francisco May 2001  –  April 2006  (5 years) San Francisco Director, Operations Planning and Adult Program Services Jewish Community Center of San Francisco May 2001  –  April 2006  (5 years) San Francisco Director of Operations P&B Fabrics, Inc October 1994  –  May 2000  (5 years 8 months) Burlingame, CA Director of Operations P&B Fabrics, Inc October 1994  –  May 2000  (5 years 8 months) Burlingame, CA Business Planner/Senior Business Planner Intel Corporation June 1990  –  September 1994  (4 years 4 months) Portland, OR and Santa Clara, CA Business Planner/Senior Business Planner Intel Corporation June 1990  –  September 1994  (4 years 4 months) Portland, OR and Santa Clara, CA Skills Skills     Education University of Michigan - Stephen M. Ross School of Business Master of Business Administration (MBA) 1988  – 1990 University of Pennsylvania BSE 1981  – 1985 University of Michigan - Stephen M. Ross School of Business Master of Business Administration (MBA) 1988  – 1990 University of Michigan - Stephen M. Ross School of Business Master of Business Administration (MBA) 1988  – 1990 University of Michigan - Stephen M. Ross School of Business Master of Business Administration (MBA) 1988  – 1990 University of Pennsylvania BSE 1981  – 1985 University of Pennsylvania BSE 1981  – 1985 University of Pennsylvania BSE 1981  – 1985 ", "Experience VP Operations Sundia Corporation September 2014  – Present (1 year) Orinda, CA VP Logistics Sundia Corporation May 2007  –  August 2014  (7 years 4 months) Director of Order Management Berkshire Blanket 2002  –  2006  (4 years) Director of Logistics Design Within Reach 1999  –  2000  (1 year) Senior Business Planner Intel Corporation 1995  –  1995  (less than a year) Production Control Manager Wyman-Gordon Investment Casting Inc. 1992  –  1995  (3 years) International Project Manager Wyman-Gordon Investment Casting Inc. 1988  –  1992  (4 years) VP Operations Sundia Corporation September 2014  – Present (1 year) Orinda, CA VP Operations Sundia Corporation September 2014  – Present (1 year) Orinda, CA VP Logistics Sundia Corporation May 2007  –  August 2014  (7 years 4 months) VP Logistics Sundia Corporation May 2007  –  August 2014  (7 years 4 months) Director of Order Management Berkshire Blanket 2002  –  2006  (4 years) Director of Order Management Berkshire Blanket 2002  –  2006  (4 years) Director of Logistics Design Within Reach 1999  –  2000  (1 year) Director of Logistics Design Within Reach 1999  –  2000  (1 year) Senior Business Planner Intel Corporation 1995  –  1995  (less than a year) Senior Business Planner Intel Corporation 1995  –  1995  (less than a year) Production Control Manager Wyman-Gordon Investment Casting Inc. 1992  –  1995  (3 years) Production Control Manager Wyman-Gordon Investment Casting Inc. 1992  –  1995  (3 years) International Project Manager Wyman-Gordon Investment Casting Inc. 1988  –  1992  (4 years) International Project Manager Wyman-Gordon Investment Casting Inc. 1988  –  1992  (4 years) Education University of Virginia Darden School of Business MBA 1986  – 1988 University of Colorado Boulder BS 1980  – 1982 University of California, Berkeley 1978  – 1979 University of Virginia Darden School of Business MBA 1986  – 1988 University of Virginia Darden School of Business MBA 1986  – 1988 University of Virginia Darden School of Business MBA 1986  – 1988 University of Colorado Boulder BS 1980  – 1982 University of Colorado Boulder BS 1980  – 1982 University of Colorado Boulder BS 1980  – 1982 University of California, Berkeley 1978  – 1979 University of California, Berkeley 1978  – 1979 University of California, Berkeley 1978  – 1979 ", "Skills Program Management Project Management Operations Management Human Resources Leadership Management Personnel Management Strategy Skills  Program Management Project Management Operations Management Human Resources Leadership Management Personnel Management Strategy Program Management Project Management Operations Management Human Resources Leadership Management Personnel Management Strategy Program Management Project Management Operations Management Human Resources Leadership Management Personnel Management Strategy ", "Summary Specializing in Oracle E- Business Suite applications and with primary expertise in Projects and Financials and implementing in Latin America, EMEA, and Asia regions. Summary Specializing in Oracle E- Business Suite applications and with primary expertise in Projects and Financials and implementing in Latin America, EMEA, and Asia regions. Specializing in Oracle E- Business Suite applications and with primary expertise in Projects and Financials and implementing in Latin America, EMEA, and Asia regions. Specializing in Oracle E- Business Suite applications and with primary expertise in Projects and Financials and implementing in Latin America, EMEA, and Asia regions. Experience Owner/Managing Director FSP Consulting, Inc. February 2006  – Present (9 years 7 months) Jupiter, Florida Co founder/Owner for niche Oracle Consulting firm, specializing in global implementations of Oracle Financials, Oracle Projects, Oracle Manufacuring and regional/Add on Localizations.. Primary regional focus includes Latin America, EMEA, and North America. Senior Principal Consultant Aerojet Rocketdyne September 2012  –  October 2013  (1 year 2 months) Sacramento, California Area Senior Principal Projects consultant for Oracle 12.1.3 implementation for Aerojet Rocketdyne. Primary responsibilities included finalizing business requirements, design, configuration, and post production support of Project Billing, Project Costing, Project Management, Project Contracts, and Project Manufacturing Applications across multiple operating units and ledgers Senior Principal Consultant Laitram September 2011  –  July 2013  (1 year 11 months) New Orleans, LA/ Sao Paulo Brazil Oracle Functional Lead Architect for Brazilian Oracle 11.5.10.2 Order to Cash rollout for Laitram Corporation, a global manufacturer of conveying systems and technologies, seafood processing equipment, metal stair and platform systems, and microwave technology for manufacturing. Oracle application focus and responsibilities included Order Management, Advanced Pricing, Accounts Receivable, and Latin Tax Engine (Regional Localization) Senior Principal Consultant Grede Foundries, Inc. October 2011  –  September 2012  (1 year) Monterrey Area, Mexico Solution architect for process improvements across Oracle Financials, Suppl Chain,Inventory, and Distribution Solutions Architect Ausenco December 2011  –  August 2012  (9 months) Brisbane Area, Australia Global Solution Architect for Oracle 12.1.3 implementation for Ausenco Limited, a global engineering, procurement, construction management, project management, and operations service provider to energy, resource and process industries. Application scope included Project Costing, Project Billing, Project Management, OTL, Core HR, Self Service HR, i-Recruitment, Payroll, Purchasing, i-Procurement, Accounts Payable, Accounts Receivable, Payments, Cash Management, Fixed Assets, General Ledger, E-Business Tax, OBIEE, and Regional/Add on localizations for South American countries (Brazil, Peru, and Chile) Senior Principal Consultant Arrow Electronics January 2012  –  May 2012  (5 months) Frankfurt Area, Germany Senior Principal Consulant provding functional and project management services for Financials, Supply Chain, and Distrbution for Central European regional rollout on Oracle 12 .06 Senior Principal Consultant Wood Group Mustang March 2011  –  October 2011  (8 months) Houston, Texas Area Oracle Functional Financials Lead for Oracle 12.1.3 Phase 1 scopeing and design for Mustang Engineering, a globally recognized company focusing on engineering, design, Project Management, and construction managements services to oil and gas; refining and chemical; pipeline, automation and control; and process and Manufacturing industries Senior Principal Consultant National Oilwell Varco February 2011  –  March 2011  (2 months) Senior principal consultant for implementation changes of new Harmonized Sales Tax requirements for Canadian tax entitiy on Oracle11.5.10.2 Senior Principal Consultant DJO, LLC October 2010  –  February 2011  (5 months) Oracle Functional Financials consultant for Oracle 12.06 implementation for DJO Ortho Incorporated, a global industry leader in engineering, manufacturing, and distribution of orthopedic medical devices and orthopedic products/supplies Senior Principal Consultant Geokinetics March 2010  –  October 2010  (8 months) Latin America Oracle Functional lead for 12.04 to 12.1.1 upgrade and reengineering/enhancing existing business processes, regional localizations, product localizations, and reporting for global geophysical services company. Primary geographic scope includes subsidiaries based in Bogota, Colombia and Rio De Janeiro, Brazil. Oracle application scope and focus includes Oracle Project Costing, Project Billing, Project Management, General Ledger, Purchasing, i-Procurement, i-Expense, Payables, Receivables, E business Tax, Colombian Regional/Product Localizations, and Brazilian Regional/Product Localizations. Senior Principal Consultant Wood Group March 2010  –  March 2010  (1 month) Oracle Functional lead for Oracle implementation assessment for Colombian subsidiary of a Global operator of engineering, production support, and maintenance management servicing the oil and gas industry. Senior Principal Consultant Oxbow July 2009  –  March 2010  (9 months) Latin American Localizations/Globalizations functional lead and Co-Project Manager (Latin America) for Oracle R12 (version 12.06) implementation for Oxbow Corporation, an industry leader in mining and marketing of energy products such as coal, natural gas, and petroleum coke. Also, responsible for validating and preparing BR100s and BR110’s for European Localization /globalization and statutory requirements.for 5 countries in EMEA region Senior Principal Consultant Arrow Electronics ECS 2006  –  December 2009  (3 years) Finance Functional lead for Oracle implementation for Arrow Electronics Inc’s Enterprise Computing Solutions North American Division on Oracle 11.5.10.2.The overall focus of the lead role is the implementation and overall support for Oracle Financial Applications which include General Ledger, Accounts Payable, iExpense, Accounts Receivable, iReceivables, iPayment, Trade Management, Fixed Assets, and Cash Management. Additional overarching responsibilities included providing leadership, guidance, hands on training, and communicating disciplines of best practices to identified internal subject matter experts focusing in the areas of Accounts Receivables, Accounts Payable, General Ledger, Fixed Assets, Treasury, Cash Management, Financial Planning and Analysis, and Cost Management. Senior Principal Consultant Galderma August 2008  –  February 2009  (7 months) Greater San Diego Area Responsible for developing strategy and project plan to configure and implement Oracle applications for foreign entities. Scope for foreign locations included Switzerland, Israel, Germany, Finland UK, and Japan Senior Principal Consultant NextWave Broadband 2006  –  2008  (2 years) Senior Principal Consultant PacketVideo 2006  –  2008  (2 years) Senior Principal consultant lead providing functional and best practice expertise for 11.5.10 Oracle Project Management, Project Costing , Project Billing, and Financial Applications..Key focus area was also developing integrated functional test scripts to validate the design and impact of Customization and client extensions for Labor Costing, Revenue Generation/Revenue Recognition, and Budgeting Estimated Time to Complete (ETC) for key Contract Projects . Service Contracts, and Maintenance Contracts. Manager, Financial Systems Sanmina-SCI Corporation December 2005  –  April 2006  (5 months) Primarily responsible for re-engineering Global Oracle ERP Finance Architecture , managing global process improvement efforts through utilization of extended Oracle functionality, implementing regional localization requirements in Latin America, China, Asia Pacific, and Europe, and extending Oracle Project Accounting applications (Costing, Billing, Manufacturing, ) and tools to specific activity based costing business segments. Finance Director- Latin America Sanmina-SCI do Brasil 2004  –  2006  (2 years) Responsible for ERP system integrations, implementation of Special tax Regimes, Process Improvement, Sarbanes Oxley 404 Internal Control Evaluation, and Local Statutory processes and Procedures for Latin American Region (Mexico and Brazil). Also functioned as Functional Financial Project lead for 11i (11.58) Oracle Implementation in Brazil. Project scope lasted 1 ½ years and included implementation of Oracle Manufacturing Suite (OM, PO, BOM, INV, WIP ), Oracle Financial Applications (GL, AP, AR, FA, and CM), and all Brazilian Localizations (Latin American Tax Engine, Integrated Receiving, Period Average Cost, Bank Interfaces, etc). Manager, Financial Systems Sanmina-SCI Corporation April 2001  –  June 2004  (3 years 3 months) Functional and technical finance lead for Global Oracle Cost Management & core financial system implementations with Fortune 500 Contract Manufacturing Corporation. Functionally manged and supported over 25 full scale glonal Oracle Financial 11/03/11i and manufacturing implementations. Implementation phase includes Discovery, business processing mapping, identify gaps and major challenges, deployment and training, Go live roll out, post implementation support, & document/ summarize project key learning’s & areas of focus for risk management, Divisional Business Planner Intel Corporation 1998  –  2001  (3 years) santa clara, ca Responsible for coordination & facilitating production scheduling of the Pentium III Mobile CPU Processor by providing timely information & analysis regarding market trends, shifts, and demand. \n \nResponsible for developing and improving strategies to monitor and facilitate delivery performance to Original Equipment Manufacturers and customer retail distribution channels. \n \nResponsible for develop & implement strategies of the Manufacturing operations to facilitate demand within European & Asian Markets to achieve high level company goals Owner/Managing Director FSP Consulting, Inc. February 2006  – Present (9 years 7 months) Jupiter, Florida Co founder/Owner for niche Oracle Consulting firm, specializing in global implementations of Oracle Financials, Oracle Projects, Oracle Manufacuring and regional/Add on Localizations.. Primary regional focus includes Latin America, EMEA, and North America. Owner/Managing Director FSP Consulting, Inc. February 2006  – Present (9 years 7 months) Jupiter, Florida Co founder/Owner for niche Oracle Consulting firm, specializing in global implementations of Oracle Financials, Oracle Projects, Oracle Manufacuring and regional/Add on Localizations.. Primary regional focus includes Latin America, EMEA, and North America. Senior Principal Consultant Aerojet Rocketdyne September 2012  –  October 2013  (1 year 2 months) Sacramento, California Area Senior Principal Projects consultant for Oracle 12.1.3 implementation for Aerojet Rocketdyne. Primary responsibilities included finalizing business requirements, design, configuration, and post production support of Project Billing, Project Costing, Project Management, Project Contracts, and Project Manufacturing Applications across multiple operating units and ledgers Senior Principal Consultant Aerojet Rocketdyne September 2012  –  October 2013  (1 year 2 months) Sacramento, California Area Senior Principal Projects consultant for Oracle 12.1.3 implementation for Aerojet Rocketdyne. Primary responsibilities included finalizing business requirements, design, configuration, and post production support of Project Billing, Project Costing, Project Management, Project Contracts, and Project Manufacturing Applications across multiple operating units and ledgers Senior Principal Consultant Laitram September 2011  –  July 2013  (1 year 11 months) New Orleans, LA/ Sao Paulo Brazil Oracle Functional Lead Architect for Brazilian Oracle 11.5.10.2 Order to Cash rollout for Laitram Corporation, a global manufacturer of conveying systems and technologies, seafood processing equipment, metal stair and platform systems, and microwave technology for manufacturing. Oracle application focus and responsibilities included Order Management, Advanced Pricing, Accounts Receivable, and Latin Tax Engine (Regional Localization) Senior Principal Consultant Laitram September 2011  –  July 2013  (1 year 11 months) New Orleans, LA/ Sao Paulo Brazil Oracle Functional Lead Architect for Brazilian Oracle 11.5.10.2 Order to Cash rollout for Laitram Corporation, a global manufacturer of conveying systems and technologies, seafood processing equipment, metal stair and platform systems, and microwave technology for manufacturing. Oracle application focus and responsibilities included Order Management, Advanced Pricing, Accounts Receivable, and Latin Tax Engine (Regional Localization) Senior Principal Consultant Grede Foundries, Inc. October 2011  –  September 2012  (1 year) Monterrey Area, Mexico Solution architect for process improvements across Oracle Financials, Suppl Chain,Inventory, and Distribution Senior Principal Consultant Grede Foundries, Inc. October 2011  –  September 2012  (1 year) Monterrey Area, Mexico Solution architect for process improvements across Oracle Financials, Suppl Chain,Inventory, and Distribution Solutions Architect Ausenco December 2011  –  August 2012  (9 months) Brisbane Area, Australia Global Solution Architect for Oracle 12.1.3 implementation for Ausenco Limited, a global engineering, procurement, construction management, project management, and operations service provider to energy, resource and process industries. Application scope included Project Costing, Project Billing, Project Management, OTL, Core HR, Self Service HR, i-Recruitment, Payroll, Purchasing, i-Procurement, Accounts Payable, Accounts Receivable, Payments, Cash Management, Fixed Assets, General Ledger, E-Business Tax, OBIEE, and Regional/Add on localizations for South American countries (Brazil, Peru, and Chile) Solutions Architect Ausenco December 2011  –  August 2012  (9 months) Brisbane Area, Australia Global Solution Architect for Oracle 12.1.3 implementation for Ausenco Limited, a global engineering, procurement, construction management, project management, and operations service provider to energy, resource and process industries. Application scope included Project Costing, Project Billing, Project Management, OTL, Core HR, Self Service HR, i-Recruitment, Payroll, Purchasing, i-Procurement, Accounts Payable, Accounts Receivable, Payments, Cash Management, Fixed Assets, General Ledger, E-Business Tax, OBIEE, and Regional/Add on localizations for South American countries (Brazil, Peru, and Chile) Senior Principal Consultant Arrow Electronics January 2012  –  May 2012  (5 months) Frankfurt Area, Germany Senior Principal Consulant provding functional and project management services for Financials, Supply Chain, and Distrbution for Central European regional rollout on Oracle 12 .06 Senior Principal Consultant Arrow Electronics January 2012  –  May 2012  (5 months) Frankfurt Area, Germany Senior Principal Consulant provding functional and project management services for Financials, Supply Chain, and Distrbution for Central European regional rollout on Oracle 12 .06 Senior Principal Consultant Wood Group Mustang March 2011  –  October 2011  (8 months) Houston, Texas Area Oracle Functional Financials Lead for Oracle 12.1.3 Phase 1 scopeing and design for Mustang Engineering, a globally recognized company focusing on engineering, design, Project Management, and construction managements services to oil and gas; refining and chemical; pipeline, automation and control; and process and Manufacturing industries Senior Principal Consultant Wood Group Mustang March 2011  –  October 2011  (8 months) Houston, Texas Area Oracle Functional Financials Lead for Oracle 12.1.3 Phase 1 scopeing and design for Mustang Engineering, a globally recognized company focusing on engineering, design, Project Management, and construction managements services to oil and gas; refining and chemical; pipeline, automation and control; and process and Manufacturing industries Senior Principal Consultant National Oilwell Varco February 2011  –  March 2011  (2 months) Senior principal consultant for implementation changes of new Harmonized Sales Tax requirements for Canadian tax entitiy on Oracle11.5.10.2 Senior Principal Consultant National Oilwell Varco February 2011  –  March 2011  (2 months) Senior principal consultant for implementation changes of new Harmonized Sales Tax requirements for Canadian tax entitiy on Oracle11.5.10.2 Senior Principal Consultant DJO, LLC October 2010  –  February 2011  (5 months) Oracle Functional Financials consultant for Oracle 12.06 implementation for DJO Ortho Incorporated, a global industry leader in engineering, manufacturing, and distribution of orthopedic medical devices and orthopedic products/supplies Senior Principal Consultant DJO, LLC October 2010  –  February 2011  (5 months) Oracle Functional Financials consultant for Oracle 12.06 implementation for DJO Ortho Incorporated, a global industry leader in engineering, manufacturing, and distribution of orthopedic medical devices and orthopedic products/supplies Senior Principal Consultant Geokinetics March 2010  –  October 2010  (8 months) Latin America Oracle Functional lead for 12.04 to 12.1.1 upgrade and reengineering/enhancing existing business processes, regional localizations, product localizations, and reporting for global geophysical services company. Primary geographic scope includes subsidiaries based in Bogota, Colombia and Rio De Janeiro, Brazil. Oracle application scope and focus includes Oracle Project Costing, Project Billing, Project Management, General Ledger, Purchasing, i-Procurement, i-Expense, Payables, Receivables, E business Tax, Colombian Regional/Product Localizations, and Brazilian Regional/Product Localizations. Senior Principal Consultant Geokinetics March 2010  –  October 2010  (8 months) Latin America Oracle Functional lead for 12.04 to 12.1.1 upgrade and reengineering/enhancing existing business processes, regional localizations, product localizations, and reporting for global geophysical services company. Primary geographic scope includes subsidiaries based in Bogota, Colombia and Rio De Janeiro, Brazil. Oracle application scope and focus includes Oracle Project Costing, Project Billing, Project Management, General Ledger, Purchasing, i-Procurement, i-Expense, Payables, Receivables, E business Tax, Colombian Regional/Product Localizations, and Brazilian Regional/Product Localizations. Senior Principal Consultant Wood Group March 2010  –  March 2010  (1 month) Oracle Functional lead for Oracle implementation assessment for Colombian subsidiary of a Global operator of engineering, production support, and maintenance management servicing the oil and gas industry. Senior Principal Consultant Wood Group March 2010  –  March 2010  (1 month) Oracle Functional lead for Oracle implementation assessment for Colombian subsidiary of a Global operator of engineering, production support, and maintenance management servicing the oil and gas industry. Senior Principal Consultant Oxbow July 2009  –  March 2010  (9 months) Latin American Localizations/Globalizations functional lead and Co-Project Manager (Latin America) for Oracle R12 (version 12.06) implementation for Oxbow Corporation, an industry leader in mining and marketing of energy products such as coal, natural gas, and petroleum coke. Also, responsible for validating and preparing BR100s and BR110’s for European Localization /globalization and statutory requirements.for 5 countries in EMEA region Senior Principal Consultant Oxbow July 2009  –  March 2010  (9 months) Latin American Localizations/Globalizations functional lead and Co-Project Manager (Latin America) for Oracle R12 (version 12.06) implementation for Oxbow Corporation, an industry leader in mining and marketing of energy products such as coal, natural gas, and petroleum coke. Also, responsible for validating and preparing BR100s and BR110’s for European Localization /globalization and statutory requirements.for 5 countries in EMEA region Senior Principal Consultant Arrow Electronics ECS 2006  –  December 2009  (3 years) Finance Functional lead for Oracle implementation for Arrow Electronics Inc’s Enterprise Computing Solutions North American Division on Oracle 11.5.10.2.The overall focus of the lead role is the implementation and overall support for Oracle Financial Applications which include General Ledger, Accounts Payable, iExpense, Accounts Receivable, iReceivables, iPayment, Trade Management, Fixed Assets, and Cash Management. Additional overarching responsibilities included providing leadership, guidance, hands on training, and communicating disciplines of best practices to identified internal subject matter experts focusing in the areas of Accounts Receivables, Accounts Payable, General Ledger, Fixed Assets, Treasury, Cash Management, Financial Planning and Analysis, and Cost Management. Senior Principal Consultant Arrow Electronics ECS 2006  –  December 2009  (3 years) Finance Functional lead for Oracle implementation for Arrow Electronics Inc’s Enterprise Computing Solutions North American Division on Oracle 11.5.10.2.The overall focus of the lead role is the implementation and overall support for Oracle Financial Applications which include General Ledger, Accounts Payable, iExpense, Accounts Receivable, iReceivables, iPayment, Trade Management, Fixed Assets, and Cash Management. Additional overarching responsibilities included providing leadership, guidance, hands on training, and communicating disciplines of best practices to identified internal subject matter experts focusing in the areas of Accounts Receivables, Accounts Payable, General Ledger, Fixed Assets, Treasury, Cash Management, Financial Planning and Analysis, and Cost Management. Senior Principal Consultant Galderma August 2008  –  February 2009  (7 months) Greater San Diego Area Responsible for developing strategy and project plan to configure and implement Oracle applications for foreign entities. Scope for foreign locations included Switzerland, Israel, Germany, Finland UK, and Japan Senior Principal Consultant Galderma August 2008  –  February 2009  (7 months) Greater San Diego Area Responsible for developing strategy and project plan to configure and implement Oracle applications for foreign entities. Scope for foreign locations included Switzerland, Israel, Germany, Finland UK, and Japan Senior Principal Consultant NextWave Broadband 2006  –  2008  (2 years) Senior Principal Consultant NextWave Broadband 2006  –  2008  (2 years) Senior Principal Consultant PacketVideo 2006  –  2008  (2 years) Senior Principal consultant lead providing functional and best practice expertise for 11.5.10 Oracle Project Management, Project Costing , Project Billing, and Financial Applications..Key focus area was also developing integrated functional test scripts to validate the design and impact of Customization and client extensions for Labor Costing, Revenue Generation/Revenue Recognition, and Budgeting Estimated Time to Complete (ETC) for key Contract Projects . Service Contracts, and Maintenance Contracts. Senior Principal Consultant PacketVideo 2006  –  2008  (2 years) Senior Principal consultant lead providing functional and best practice expertise for 11.5.10 Oracle Project Management, Project Costing , Project Billing, and Financial Applications..Key focus area was also developing integrated functional test scripts to validate the design and impact of Customization and client extensions for Labor Costing, Revenue Generation/Revenue Recognition, and Budgeting Estimated Time to Complete (ETC) for key Contract Projects . Service Contracts, and Maintenance Contracts. Manager, Financial Systems Sanmina-SCI Corporation December 2005  –  April 2006  (5 months) Primarily responsible for re-engineering Global Oracle ERP Finance Architecture , managing global process improvement efforts through utilization of extended Oracle functionality, implementing regional localization requirements in Latin America, China, Asia Pacific, and Europe, and extending Oracle Project Accounting applications (Costing, Billing, Manufacturing, ) and tools to specific activity based costing business segments. Manager, Financial Systems Sanmina-SCI Corporation December 2005  –  April 2006  (5 months) Primarily responsible for re-engineering Global Oracle ERP Finance Architecture , managing global process improvement efforts through utilization of extended Oracle functionality, implementing regional localization requirements in Latin America, China, Asia Pacific, and Europe, and extending Oracle Project Accounting applications (Costing, Billing, Manufacturing, ) and tools to specific activity based costing business segments. Finance Director- Latin America Sanmina-SCI do Brasil 2004  –  2006  (2 years) Responsible for ERP system integrations, implementation of Special tax Regimes, Process Improvement, Sarbanes Oxley 404 Internal Control Evaluation, and Local Statutory processes and Procedures for Latin American Region (Mexico and Brazil). Also functioned as Functional Financial Project lead for 11i (11.58) Oracle Implementation in Brazil. Project scope lasted 1 ½ years and included implementation of Oracle Manufacturing Suite (OM, PO, BOM, INV, WIP ), Oracle Financial Applications (GL, AP, AR, FA, and CM), and all Brazilian Localizations (Latin American Tax Engine, Integrated Receiving, Period Average Cost, Bank Interfaces, etc). Finance Director- Latin America Sanmina-SCI do Brasil 2004  –  2006  (2 years) Responsible for ERP system integrations, implementation of Special tax Regimes, Process Improvement, Sarbanes Oxley 404 Internal Control Evaluation, and Local Statutory processes and Procedures for Latin American Region (Mexico and Brazil). Also functioned as Functional Financial Project lead for 11i (11.58) Oracle Implementation in Brazil. Project scope lasted 1 ½ years and included implementation of Oracle Manufacturing Suite (OM, PO, BOM, INV, WIP ), Oracle Financial Applications (GL, AP, AR, FA, and CM), and all Brazilian Localizations (Latin American Tax Engine, Integrated Receiving, Period Average Cost, Bank Interfaces, etc). Manager, Financial Systems Sanmina-SCI Corporation April 2001  –  June 2004  (3 years 3 months) Functional and technical finance lead for Global Oracle Cost Management & core financial system implementations with Fortune 500 Contract Manufacturing Corporation. Functionally manged and supported over 25 full scale glonal Oracle Financial 11/03/11i and manufacturing implementations. Implementation phase includes Discovery, business processing mapping, identify gaps and major challenges, deployment and training, Go live roll out, post implementation support, & document/ summarize project key learning’s & areas of focus for risk management, Manager, Financial Systems Sanmina-SCI Corporation April 2001  –  June 2004  (3 years 3 months) Functional and technical finance lead for Global Oracle Cost Management & core financial system implementations with Fortune 500 Contract Manufacturing Corporation. Functionally manged and supported over 25 full scale glonal Oracle Financial 11/03/11i and manufacturing implementations. Implementation phase includes Discovery, business processing mapping, identify gaps and major challenges, deployment and training, Go live roll out, post implementation support, & document/ summarize project key learning’s & areas of focus for risk management, Divisional Business Planner Intel Corporation 1998  –  2001  (3 years) santa clara, ca Responsible for coordination & facilitating production scheduling of the Pentium III Mobile CPU Processor by providing timely information & analysis regarding market trends, shifts, and demand. \n \nResponsible for developing and improving strategies to monitor and facilitate delivery performance to Original Equipment Manufacturers and customer retail distribution channels. \n \nResponsible for develop & implement strategies of the Manufacturing operations to facilitate demand within European & Asian Markets to achieve high level company goals Divisional Business Planner Intel Corporation 1998  –  2001  (3 years) santa clara, ca Responsible for coordination & facilitating production scheduling of the Pentium III Mobile CPU Processor by providing timely information & analysis regarding market trends, shifts, and demand. \n \nResponsible for developing and improving strategies to monitor and facilitate delivery performance to Original Equipment Manufacturers and customer retail distribution channels. \n \nResponsible for develop & implement strategies of the Manufacturing operations to facilitate demand within European & Asian Markets to achieve high level company goals Languages English Native or bilingual proficiency Portuguese Full professional proficiency Spanish Professional working proficiency English Native or bilingual proficiency Portuguese Full professional proficiency Spanish Professional working proficiency English Native or bilingual proficiency Portuguese Full professional proficiency Spanish Professional working proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Skills Oracle E-Business Suite Oracle R12 Financials Oracle Project... Program Management Business Process... Business Analysis Finance ERP Oracle Applications Financial Systems SDLC Integration Requirements Analysis Business Intelligence Oracle Strategic Financial... Project Management Cross-functional Team... Business Process Mapping Supply Chain Business Process Analysis Process Improvement SAP Oracle Discoverer Telecommunications PMP Change Management Pricing Financials See 15+     See less Skills  Oracle E-Business Suite Oracle R12 Financials Oracle Project... Program Management Business Process... Business Analysis Finance ERP Oracle Applications Financial Systems SDLC Integration Requirements Analysis Business Intelligence Oracle Strategic Financial... Project Management Cross-functional Team... Business Process Mapping Supply Chain Business Process Analysis Process Improvement SAP Oracle Discoverer Telecommunications PMP Change Management Pricing Financials See 15+     See less Oracle E-Business Suite Oracle R12 Financials Oracle Project... Program Management Business Process... Business Analysis Finance ERP Oracle Applications Financial Systems SDLC Integration Requirements Analysis Business Intelligence Oracle Strategic Financial... Project Management Cross-functional Team... Business Process Mapping Supply Chain Business Process Analysis Process Improvement SAP Oracle Discoverer Telecommunications PMP Change Management Pricing Financials See 15+     See less Oracle E-Business Suite Oracle R12 Financials Oracle Project... Program Management Business Process... Business Analysis Finance ERP Oracle Applications Financial Systems SDLC Integration Requirements Analysis Business Intelligence Oracle Strategic Financial... Project Management Cross-functional Team... Business Process Mapping Supply Chain Business Process Analysis Process Improvement SAP Oracle Discoverer Telecommunications PMP Change Management Pricing Financials See 15+     See less Education Morehouse College Bachelor of Business Administration (BBA),  Accounting 1996  – 1998 Morehouse College Bachelor of Business Administration (BBA),  Accounting 1996  – 1998 Morehouse College Bachelor of Business Administration (BBA),  Accounting 1996  – 1998 Morehouse College Bachelor of Business Administration (BBA),  Accounting 1996  – 1998 ", "Experience Long Range Business Planner Intel Corporation October 2014  – Present (11 months) San Francisco Bay Area Long Range Business Planner Intel Corporation October 2014  – Present (11 months) San Francisco Bay Area Long Range Business Planner Intel Corporation October 2014  – Present (11 months) San Francisco Bay Area Skills Semiconductors Debugging Computer Architecture International Business Cross-cultural Teams Business Analysis Business Intelligence Computer Science Verilog Perl Simulations Hardware Architecture C C++ Skills  Semiconductors Debugging Computer Architecture International Business Cross-cultural Teams Business Analysis Business Intelligence Computer Science Verilog Perl Simulations Hardware Architecture C C++ Semiconductors Debugging Computer Architecture International Business Cross-cultural Teams Business Analysis Business Intelligence Computer Science Verilog Perl Simulations Hardware Architecture C C++ Semiconductors Debugging Computer Architecture International Business Cross-cultural Teams Business Analysis Business Intelligence Computer Science Verilog Perl Simulations Hardware Architecture C C++ Education Santa Clara University MBA,  Business 2005  – 2008 University of California, San Diego MS,  Computer Science (Computer Engineering) 1998  – 2000 University of Washington BS,  Computer Engineering 1993  – 1998 Santa Clara University MBA,  Business 2005  – 2008 Santa Clara University MBA,  Business 2005  – 2008 Santa Clara University MBA,  Business 2005  – 2008 University of California, San Diego MS,  Computer Science (Computer Engineering) 1998  – 2000 University of California, San Diego MS,  Computer Science (Computer Engineering) 1998  – 2000 University of California, San Diego MS,  Computer Science (Computer Engineering) 1998  – 2000 University of Washington BS,  Computer Engineering 1993  – 1998 University of Washington BS,  Computer Engineering 1993  – 1998 University of Washington BS,  Computer Engineering 1993  – 1998 ", "Summary Accomplished Software Product Manager. Core competency includes:  \n* Managed full software product life cycle from product positioning, market research, features/benefits, product roadmaps, pricing, execution, to sales enablement.  \n* Built direct relationship with hardware vendors and software vendors. Enabled market adoption of new technologies and products. \n* Incubated and released iOS/ Android SaaS-based software solutions. Won a major customer deal in 2014. \n \nSpecialties: * A proven leader in a cross functional team with capacity of goal setting, risk management and getting the job done.  \n* Expert on market research, segmentation, competition, product definition (MRD/PRD), roadmap, marketing collaterals, go-to-market, sales enablement.  \n* Hands-on experience in building and maintaining vendor relationships. \n* An effective communicator, striving in a multi-language/cultural work environment. Summary Accomplished Software Product Manager. Core competency includes:  \n* Managed full software product life cycle from product positioning, market research, features/benefits, product roadmaps, pricing, execution, to sales enablement.  \n* Built direct relationship with hardware vendors and software vendors. Enabled market adoption of new technologies and products. \n* Incubated and released iOS/ Android SaaS-based software solutions. Won a major customer deal in 2014. \n \nSpecialties: * A proven leader in a cross functional team with capacity of goal setting, risk management and getting the job done.  \n* Expert on market research, segmentation, competition, product definition (MRD/PRD), roadmap, marketing collaterals, go-to-market, sales enablement.  \n* Hands-on experience in building and maintaining vendor relationships. \n* An effective communicator, striving in a multi-language/cultural work environment. Accomplished Software Product Manager. Core competency includes:  \n* Managed full software product life cycle from product positioning, market research, features/benefits, product roadmaps, pricing, execution, to sales enablement.  \n* Built direct relationship with hardware vendors and software vendors. Enabled market adoption of new technologies and products. \n* Incubated and released iOS/ Android SaaS-based software solutions. Won a major customer deal in 2014. \n \nSpecialties: * A proven leader in a cross functional team with capacity of goal setting, risk management and getting the job done.  \n* Expert on market research, segmentation, competition, product definition (MRD/PRD), roadmap, marketing collaterals, go-to-market, sales enablement.  \n* Hands-on experience in building and maintaining vendor relationships. \n* An effective communicator, striving in a multi-language/cultural work environment. Accomplished Software Product Manager. Core competency includes:  \n* Managed full software product life cycle from product positioning, market research, features/benefits, product roadmaps, pricing, execution, to sales enablement.  \n* Built direct relationship with hardware vendors and software vendors. Enabled market adoption of new technologies and products. \n* Incubated and released iOS/ Android SaaS-based software solutions. Won a major customer deal in 2014. \n \nSpecialties: * A proven leader in a cross functional team with capacity of goal setting, risk management and getting the job done.  \n* Expert on market research, segmentation, competition, product definition (MRD/PRD), roadmap, marketing collaterals, go-to-market, sales enablement.  \n* Hands-on experience in building and maintaining vendor relationships. \n* An effective communicator, striving in a multi-language/cultural work environment. Experience Software Product Manager XIP 2013  – Present (2 years) Palo Alto, California Led XIP to expand business to software and cloud. Evangelized innovative idea and action plans. Won Executives’ approvals to execute the plans. Collaborated with R&D teams to agree on features and timelines. Implemented a profitable software and cloud offering roadmap. Product Manager Hewlett-Packard 2011  –  2012  (1 year) Palo Alto, California Business Critical Systems, ESSN \n \nManaged the software portfolio, Linux/HP-UX, in Americas. Sustained software sales momentum in a disruptive market. Drove creative approaches to grow software solution revenue. Strengthened Virtualization, Service Guard, Cloud solution offerings. Promoted new products and services to sales and customers. Product Manager Intel Corporation 2009  –  2010  (1 year) Santa Clara, California Wireless Business Development, Intel Mobility Group \n \nDeveloped market to adopt new technology 4G/WiMAX and launched a new product line. Managed customer relationship. Won 3 new design-wins and maintained 4 more. Product Manager Intel Corporation 2006  –  2009  (3 years) Santa Clara, California Mobile Platforms Group \n \nLed cross-functional teams and managed in product development, roadmap, pricing, customer sampling, factory ramp, program management, risk management, marketing communications, marketing collaterals, product launch, post-launch crisis managements, and customer support. Delivered two key CPU launches, ‘08 Penryn and ‘07 Merom. Responsibilities included managing product life cycles of Intel Core Duo with 60+ SKUs. Lead Supply Chain Business Planner Intel Corporation 1998  –  2006  (8 years) Santa Clara, California Customer Fulfillment Planning Logistics Group \n \nManaged CPU production schedules for Intel global factory networks. Set build plans to align factory production with demand. Resolved businesses/ supply chain issues. Developed and improved business processes. Enabled factory ramps of Intel Core Duo, Pentium III and Pentium II. Delivered 100M+ units yearly. Software Product Manager XIP 2013  – Present (2 years) Palo Alto, California Led XIP to expand business to software and cloud. Evangelized innovative idea and action plans. Won Executives’ approvals to execute the plans. Collaborated with R&D teams to agree on features and timelines. Implemented a profitable software and cloud offering roadmap. Software Product Manager XIP 2013  – Present (2 years) Palo Alto, California Led XIP to expand business to software and cloud. Evangelized innovative idea and action plans. Won Executives’ approvals to execute the plans. Collaborated with R&D teams to agree on features and timelines. Implemented a profitable software and cloud offering roadmap. Product Manager Hewlett-Packard 2011  –  2012  (1 year) Palo Alto, California Business Critical Systems, ESSN \n \nManaged the software portfolio, Linux/HP-UX, in Americas. Sustained software sales momentum in a disruptive market. Drove creative approaches to grow software solution revenue. Strengthened Virtualization, Service Guard, Cloud solution offerings. Promoted new products and services to sales and customers. Product Manager Hewlett-Packard 2011  –  2012  (1 year) Palo Alto, California Business Critical Systems, ESSN \n \nManaged the software portfolio, Linux/HP-UX, in Americas. Sustained software sales momentum in a disruptive market. Drove creative approaches to grow software solution revenue. Strengthened Virtualization, Service Guard, Cloud solution offerings. Promoted new products and services to sales and customers. Product Manager Intel Corporation 2009  –  2010  (1 year) Santa Clara, California Wireless Business Development, Intel Mobility Group \n \nDeveloped market to adopt new technology 4G/WiMAX and launched a new product line. Managed customer relationship. Won 3 new design-wins and maintained 4 more. Product Manager Intel Corporation 2009  –  2010  (1 year) Santa Clara, California Wireless Business Development, Intel Mobility Group \n \nDeveloped market to adopt new technology 4G/WiMAX and launched a new product line. Managed customer relationship. Won 3 new design-wins and maintained 4 more. Product Manager Intel Corporation 2006  –  2009  (3 years) Santa Clara, California Mobile Platforms Group \n \nLed cross-functional teams and managed in product development, roadmap, pricing, customer sampling, factory ramp, program management, risk management, marketing communications, marketing collaterals, product launch, post-launch crisis managements, and customer support. Delivered two key CPU launches, ‘08 Penryn and ‘07 Merom. Responsibilities included managing product life cycles of Intel Core Duo with 60+ SKUs. Product Manager Intel Corporation 2006  –  2009  (3 years) Santa Clara, California Mobile Platforms Group \n \nLed cross-functional teams and managed in product development, roadmap, pricing, customer sampling, factory ramp, program management, risk management, marketing communications, marketing collaterals, product launch, post-launch crisis managements, and customer support. Delivered two key CPU launches, ‘08 Penryn and ‘07 Merom. Responsibilities included managing product life cycles of Intel Core Duo with 60+ SKUs. Lead Supply Chain Business Planner Intel Corporation 1998  –  2006  (8 years) Santa Clara, California Customer Fulfillment Planning Logistics Group \n \nManaged CPU production schedules for Intel global factory networks. Set build plans to align factory production with demand. Resolved businesses/ supply chain issues. Developed and improved business processes. Enabled factory ramps of Intel Core Duo, Pentium III and Pentium II. Delivered 100M+ units yearly. Lead Supply Chain Business Planner Intel Corporation 1998  –  2006  (8 years) Santa Clara, California Customer Fulfillment Planning Logistics Group \n \nManaged CPU production schedules for Intel global factory networks. Set build plans to align factory production with demand. Resolved businesses/ supply chain issues. Developed and improved business processes. Enabled factory ramps of Intel Core Duo, Pentium III and Pentium II. Delivered 100M+ units yearly. Languages English Chinese English Chinese English Chinese Skills Software Development Private Cloud Cloud Computing Contract Negotiation Cloud Marketing Enterprise Software Vendor Management Segmentation Communicator Cross-functional Team... Product Development Market Research Product Planning Go-to-market Strategy Product Lifecycle... Product Management Product Marketing Product Launch Competitive Analysis GTM Chinese Computer Hardware Supply Chain Management Sales Enablement Virtualization Semiconductors Supply Chain Management Project Planning Strategic Partnerships Mobile Devices Wireless Program Management Business Development Project Management Multi-channel Marketing Strategy Leadership Business Alliances Marketing Communications CRM Demand Generation Pricing Channel Partners Business Process Start-ups P&L Management Partner Management Analytics Product Requirements See 35+     See less Skills  Software Development Private Cloud Cloud Computing Contract Negotiation Cloud Marketing Enterprise Software Vendor Management Segmentation Communicator Cross-functional Team... Product Development Market Research Product Planning Go-to-market Strategy Product Lifecycle... Product Management Product Marketing Product Launch Competitive Analysis GTM Chinese Computer Hardware Supply Chain Management Sales Enablement Virtualization Semiconductors Supply Chain Management Project Planning Strategic Partnerships Mobile Devices Wireless Program Management Business Development Project Management Multi-channel Marketing Strategy Leadership Business Alliances Marketing Communications CRM Demand Generation Pricing Channel Partners Business Process Start-ups P&L Management Partner Management Analytics Product Requirements See 35+     See less Software Development Private Cloud Cloud Computing Contract Negotiation Cloud Marketing Enterprise Software Vendor Management Segmentation Communicator Cross-functional Team... Product Development Market Research Product Planning Go-to-market Strategy Product Lifecycle... Product Management Product Marketing Product Launch Competitive Analysis GTM Chinese Computer Hardware Supply Chain Management Sales Enablement Virtualization Semiconductors Supply Chain Management Project Planning Strategic Partnerships Mobile Devices Wireless Program Management Business Development Project Management Multi-channel Marketing Strategy Leadership Business Alliances Marketing Communications CRM Demand Generation Pricing Channel Partners Business Process Start-ups P&L Management Partner Management Analytics Product Requirements See 35+     See less Software Development Private Cloud Cloud Computing Contract Negotiation Cloud Marketing Enterprise Software Vendor Management Segmentation Communicator Cross-functional Team... Product Development Market Research Product Planning Go-to-market Strategy Product Lifecycle... Product Management Product Marketing Product Launch Competitive Analysis GTM Chinese Computer Hardware Supply Chain Management Sales Enablement Virtualization Semiconductors Supply Chain Management Project Planning Strategic Partnerships Mobile Devices Wireless Program Management Business Development Project Management Multi-channel Marketing Strategy Leadership Business Alliances Marketing Communications CRM Demand Generation Pricing Channel Partners Business Process Start-ups P&L Management Partner Management Analytics Product Requirements See 35+     See less Education Purdue University - Krannert School of Management MBA Beijing Institute of Civil Engineering and Architecture Bachelor of Applied Science (BASc),  Engineering Purdue University - Krannert School of Management MBA Purdue University - Krannert School of Management MBA Purdue University - Krannert School of Management MBA Beijing Institute of Civil Engineering and Architecture Bachelor of Applied Science (BASc),  Engineering Beijing Institute of Civil Engineering and Architecture Bachelor of Applied Science (BASc),  Engineering Beijing Institute of Civil Engineering and Architecture Bachelor of Applied Science (BASc),  Engineering ", "Experience Business Planner Intel Corporation Business Planner Intel Corporation Business Planner Intel Corporation ", "Summary I am a Product Analytics Manager at GoPro and passionate about leading and working on teams that build data pipelines and the analytic products that capitalize on massive data sets.  \n \nConference Presenter:  \n1. Business Forecasting and Predictive Intelligence Summit http://www.businessforecasting2014.com/presenters/ \n \n2. The Escape Big Data Analytics Conference 2015 \nhttp://the-escape.org/ Summary I am a Product Analytics Manager at GoPro and passionate about leading and working on teams that build data pipelines and the analytic products that capitalize on massive data sets.  \n \nConference Presenter:  \n1. Business Forecasting and Predictive Intelligence Summit http://www.businessforecasting2014.com/presenters/ \n \n2. The Escape Big Data Analytics Conference 2015 \nhttp://the-escape.org/ I am a Product Analytics Manager at GoPro and passionate about leading and working on teams that build data pipelines and the analytic products that capitalize on massive data sets.  \n \nConference Presenter:  \n1. Business Forecasting and Predictive Intelligence Summit http://www.businessforecasting2014.com/presenters/ \n \n2. The Escape Big Data Analytics Conference 2015 \nhttp://the-escape.org/ I am a Product Analytics Manager at GoPro and passionate about leading and working on teams that build data pipelines and the analytic products that capitalize on massive data sets.  \n \nConference Presenter:  \n1. Business Forecasting and Predictive Intelligence Summit http://www.businessforecasting2014.com/presenters/ \n \n2. The Escape Big Data Analytics Conference 2015 \nhttp://the-escape.org/ Languages   Skills OLAP SAP ODBC Excel Data Analysis Microstrategy Teradata SQL Server PowerPoint Visio Microsoft Excel Predictive Analytics SPSS Oracle Demantra SAS Analytics Product Management Business Process Forecasting Analysis Microsoft SQL Server Cross-functional Team... Project Planning CRM Software Documentation Strategy Business Intelligence Management Big Data SQL Oracle Business... Pricing Mobile Devices Oracle HR Databases OBIEE Program Management See 22+     See less Skills  OLAP SAP ODBC Excel Data Analysis Microstrategy Teradata SQL Server PowerPoint Visio Microsoft Excel Predictive Analytics SPSS Oracle Demantra SAS Analytics Product Management Business Process Forecasting Analysis Microsoft SQL Server Cross-functional Team... Project Planning CRM Software Documentation Strategy Business Intelligence Management Big Data SQL Oracle Business... Pricing Mobile Devices Oracle HR Databases OBIEE Program Management See 22+     See less OLAP SAP ODBC Excel Data Analysis Microstrategy Teradata SQL Server PowerPoint Visio Microsoft Excel Predictive Analytics SPSS Oracle Demantra SAS Analytics Product Management Business Process Forecasting Analysis Microsoft SQL Server Cross-functional Team... Project Planning CRM Software Documentation Strategy Business Intelligence Management Big Data SQL Oracle Business... Pricing Mobile Devices Oracle HR Databases OBIEE Program Management See 22+     See less OLAP SAP ODBC Excel Data Analysis Microstrategy Teradata SQL Server PowerPoint Visio Microsoft Excel Predictive Analytics SPSS Oracle Demantra SAS Analytics Product Management Business Process Forecasting Analysis Microsoft SQL Server Cross-functional Team... Project Planning CRM Software Documentation Strategy Business Intelligence Management Big Data SQL Oracle Business... Pricing Mobile Devices Oracle HR Databases OBIEE Program Management See 22+     See less Education Northwestern University Master of Science (MS),  Predictive Analytics 2012  – 2015 University of California, Davis Bachelor of Arts (BA),  Organizational Studies 1998  – 1999 Northwestern University Master of Science (MS),  Predictive Analytics 2012  – 2015 Northwestern University Master of Science (MS),  Predictive Analytics 2012  – 2015 Northwestern University Master of Science (MS),  Predictive Analytics 2012  – 2015 University of California, Davis Bachelor of Arts (BA),  Organizational Studies 1998  – 1999 University of California, Davis Bachelor of Arts (BA),  Organizational Studies 1998  – 1999 University of California, Davis Bachelor of Arts (BA),  Organizational Studies 1998  – 1999 Honors & Awards ", "Summary I am a Lead Business Planner in the CPU planning division at Intel Corporation. My division is responsible for supply chain manufacturing, and aligning supply to demand while minimizing excess inventory and meeting all customer demand. We strategically align supply to demand near term, while monitoring leading indicators to alleviate any anticipated manufacturing or inventory issues. \n \nI focus on the business environment, and strive to maintain the best supply and service for the customers while maintaining corporate business strategies. I have been a key driver of new processes to optimize customer satisfaction while minimizing inventory levels. I am self-motivated and continuously identify issues, risks, and implement constructive solutions across organizational teams. \n \nOver the past 10 years I have held multiple positions at Intel Corporation: Lead Business Planner, Product Marketing Engineer, Team Manager, Inventory Analyst, Business Analyst, and Customer Service Analyst. I have been directly responsible for the NPI (new product introduction) of many different product lines (Server/Mobile/Desktop).  \n• Managed several product recalls and worked with engineering, manufacturing, and sales and marketing to minimize customer impact from any manufacturing issues.  \n•Worked with sales and marketing to align forecasted demand signals to what customers are ordering.  \n•Managed yield issues with engineering and manufacturing teams.  \n•Compiled and reported out inventory levels for the division and influenced management decisions.  \n•Monitored orders in SAP to be sure orders maintain a high level of customer requested delivery dates. Summary I am a Lead Business Planner in the CPU planning division at Intel Corporation. My division is responsible for supply chain manufacturing, and aligning supply to demand while minimizing excess inventory and meeting all customer demand. We strategically align supply to demand near term, while monitoring leading indicators to alleviate any anticipated manufacturing or inventory issues. \n \nI focus on the business environment, and strive to maintain the best supply and service for the customers while maintaining corporate business strategies. I have been a key driver of new processes to optimize customer satisfaction while minimizing inventory levels. I am self-motivated and continuously identify issues, risks, and implement constructive solutions across organizational teams. \n \nOver the past 10 years I have held multiple positions at Intel Corporation: Lead Business Planner, Product Marketing Engineer, Team Manager, Inventory Analyst, Business Analyst, and Customer Service Analyst. I have been directly responsible for the NPI (new product introduction) of many different product lines (Server/Mobile/Desktop).  \n• Managed several product recalls and worked with engineering, manufacturing, and sales and marketing to minimize customer impact from any manufacturing issues.  \n•Worked with sales and marketing to align forecasted demand signals to what customers are ordering.  \n•Managed yield issues with engineering and manufacturing teams.  \n•Compiled and reported out inventory levels for the division and influenced management decisions.  \n•Monitored orders in SAP to be sure orders maintain a high level of customer requested delivery dates. I am a Lead Business Planner in the CPU planning division at Intel Corporation. My division is responsible for supply chain manufacturing, and aligning supply to demand while minimizing excess inventory and meeting all customer demand. We strategically align supply to demand near term, while monitoring leading indicators to alleviate any anticipated manufacturing or inventory issues. \n \nI focus on the business environment, and strive to maintain the best supply and service for the customers while maintaining corporate business strategies. I have been a key driver of new processes to optimize customer satisfaction while minimizing inventory levels. I am self-motivated and continuously identify issues, risks, and implement constructive solutions across organizational teams. \n \nOver the past 10 years I have held multiple positions at Intel Corporation: Lead Business Planner, Product Marketing Engineer, Team Manager, Inventory Analyst, Business Analyst, and Customer Service Analyst. I have been directly responsible for the NPI (new product introduction) of many different product lines (Server/Mobile/Desktop).  \n• Managed several product recalls and worked with engineering, manufacturing, and sales and marketing to minimize customer impact from any manufacturing issues.  \n•Worked with sales and marketing to align forecasted demand signals to what customers are ordering.  \n•Managed yield issues with engineering and manufacturing teams.  \n•Compiled and reported out inventory levels for the division and influenced management decisions.  \n•Monitored orders in SAP to be sure orders maintain a high level of customer requested delivery dates. I am a Lead Business Planner in the CPU planning division at Intel Corporation. My division is responsible for supply chain manufacturing, and aligning supply to demand while minimizing excess inventory and meeting all customer demand. We strategically align supply to demand near term, while monitoring leading indicators to alleviate any anticipated manufacturing or inventory issues. \n \nI focus on the business environment, and strive to maintain the best supply and service for the customers while maintaining corporate business strategies. I have been a key driver of new processes to optimize customer satisfaction while minimizing inventory levels. I am self-motivated and continuously identify issues, risks, and implement constructive solutions across organizational teams. \n \nOver the past 10 years I have held multiple positions at Intel Corporation: Lead Business Planner, Product Marketing Engineer, Team Manager, Inventory Analyst, Business Analyst, and Customer Service Analyst. I have been directly responsible for the NPI (new product introduction) of many different product lines (Server/Mobile/Desktop).  \n• Managed several product recalls and worked with engineering, manufacturing, and sales and marketing to minimize customer impact from any manufacturing issues.  \n•Worked with sales and marketing to align forecasted demand signals to what customers are ordering.  \n•Managed yield issues with engineering and manufacturing teams.  \n•Compiled and reported out inventory levels for the division and influenced management decisions.  \n•Monitored orders in SAP to be sure orders maintain a high level of customer requested delivery dates. Experience Senior Business Planner Intel Corporation 2007  – Present (8 years) Intel Corporation, Customer Planning and Logistics group (CPLG)  \n-Managed many platform products from initial ramp thru end of life and mid-life conversions.  \n-Cross organization team building for product launch with manufacturing, engineering, and marketing. \n-Train and mentor other planners on processes, issue identification and cross team resolution. \n-Manage product strategy and supply inventories to align with business goals. Inventory Analyst Intel Corporation 2003  –  2007  (4 years) Inventory Analyst – (2003-2007) \nIntel Corporation, Customer Planning and Logistics group (CPLG)  \n-Compiled and reported out supply chain inventory to management influencing data driven decisions. Business Analyst Intel Corporation 2001  –  2002  (1 year) Business Analyst – (2001-2002) \nIntel Corporation, Customer Planning and Logistics group (CPLG)  \n-Implemented customer allocation tool to division, key interface for development/ testing/ training. Senior Business Planner Intel Corporation 2007  – Present (8 years) Intel Corporation, Customer Planning and Logistics group (CPLG)  \n-Managed many platform products from initial ramp thru end of life and mid-life conversions.  \n-Cross organization team building for product launch with manufacturing, engineering, and marketing. \n-Train and mentor other planners on processes, issue identification and cross team resolution. \n-Manage product strategy and supply inventories to align with business goals. Senior Business Planner Intel Corporation 2007  – Present (8 years) Intel Corporation, Customer Planning and Logistics group (CPLG)  \n-Managed many platform products from initial ramp thru end of life and mid-life conversions.  \n-Cross organization team building for product launch with manufacturing, engineering, and marketing. \n-Train and mentor other planners on processes, issue identification and cross team resolution. \n-Manage product strategy and supply inventories to align with business goals. Inventory Analyst Intel Corporation 2003  –  2007  (4 years) Inventory Analyst – (2003-2007) \nIntel Corporation, Customer Planning and Logistics group (CPLG)  \n-Compiled and reported out supply chain inventory to management influencing data driven decisions. Inventory Analyst Intel Corporation 2003  –  2007  (4 years) Inventory Analyst – (2003-2007) \nIntel Corporation, Customer Planning and Logistics group (CPLG)  \n-Compiled and reported out supply chain inventory to management influencing data driven decisions. Business Analyst Intel Corporation 2001  –  2002  (1 year) Business Analyst – (2001-2002) \nIntel Corporation, Customer Planning and Logistics group (CPLG)  \n-Implemented customer allocation tool to division, key interface for development/ testing/ training. Business Analyst Intel Corporation 2001  –  2002  (1 year) Business Analyst – (2001-2002) \nIntel Corporation, Customer Planning and Logistics group (CPLG)  \n-Implemented customer allocation tool to division, key interface for development/ testing/ training. Languages   Skills Cross-functional Team... Program Management Agile Methodologies Supply Management Strategic Partnerships Business Transformation Strategy Supply Chain Management Business Process... Operations Management Channel Partners Business Strategy Integration Six Sigma Vendor Management Project Planning Sales Contract Negotiation Product Development Analytics Visio SAP Product Management Go-to-market Strategy Strategic Planning Business Analysis Business Process Business Planning Process Improvement Process Engineering Start-ups Software Project... Competitive Analysis Product Marketing Forecasting Change Management Product Lifecycle... Manufacturing Wireless Team Leadership Testing SaaS Pricing PMP Business Intelligence Data Analysis Project Management Analysis Management Supply Chain See 35+     See less Skills  Cross-functional Team... Program Management Agile Methodologies Supply Management Strategic Partnerships Business Transformation Strategy Supply Chain Management Business Process... Operations Management Channel Partners Business Strategy Integration Six Sigma Vendor Management Project Planning Sales Contract Negotiation Product Development Analytics Visio SAP Product Management Go-to-market Strategy Strategic Planning Business Analysis Business Process Business Planning Process Improvement Process Engineering Start-ups Software Project... Competitive Analysis Product Marketing Forecasting Change Management Product Lifecycle... Manufacturing Wireless Team Leadership Testing SaaS Pricing PMP Business Intelligence Data Analysis Project Management Analysis Management Supply Chain See 35+     See less Cross-functional Team... Program Management Agile Methodologies Supply Management Strategic Partnerships Business Transformation Strategy Supply Chain Management Business Process... Operations Management Channel Partners Business Strategy Integration Six Sigma Vendor Management Project Planning Sales Contract Negotiation Product Development Analytics Visio SAP Product Management Go-to-market Strategy Strategic Planning Business Analysis Business Process Business Planning Process Improvement Process Engineering Start-ups Software Project... Competitive Analysis Product Marketing Forecasting Change Management Product Lifecycle... Manufacturing Wireless Team Leadership Testing SaaS Pricing PMP Business Intelligence Data Analysis Project Management Analysis Management Supply Chain See 35+     See less Cross-functional Team... Program Management Agile Methodologies Supply Management Strategic Partnerships Business Transformation Strategy Supply Chain Management Business Process... Operations Management Channel Partners Business Strategy Integration Six Sigma Vendor Management Project Planning Sales Contract Negotiation Product Development Analytics Visio SAP Product Management Go-to-market Strategy Strategic Planning Business Analysis Business Process Business Planning Process Improvement Process Engineering Start-ups Software Project... Competitive Analysis Product Marketing Forecasting Change Management Product Lifecycle... Manufacturing Wireless Team Leadership Testing SaaS Pricing PMP Business Intelligence Data Analysis Project Management Analysis Management Supply Chain See 35+     See less Education California State University-Chico Business Administration, Finance Pleasant Valley High School, Chico CA California State University-Chico Business Administration, Finance California State University-Chico Business Administration, Finance California State University-Chico Business Administration, Finance Pleasant Valley High School, Chico CA Pleasant Valley High School, Chico CA Pleasant Valley High School, Chico CA Honors & Awards ", "Experience Business Planner Intel Corporation September 2012  – Present (3 years) Ensure build strategies are in place to meet customer needs without building excess or coming up short to demand for a family of products. Business Analyst Intel Corporation February 2012  –  August 2012  (7 months) Folsom Assistant Manager REI November 2002  –  January 2012  (9 years 3 months) District Manager Mulberry Neckwear 2000  –  2002  (2 years) San Francisco Bay Area Business Planner Intel Corporation September 2012  – Present (3 years) Ensure build strategies are in place to meet customer needs without building excess or coming up short to demand for a family of products. Business Planner Intel Corporation September 2012  – Present (3 years) Ensure build strategies are in place to meet customer needs without building excess or coming up short to demand for a family of products. Business Analyst Intel Corporation February 2012  –  August 2012  (7 months) Folsom Business Analyst Intel Corporation February 2012  –  August 2012  (7 months) Folsom Assistant Manager REI November 2002  –  January 2012  (9 years 3 months) Assistant Manager REI November 2002  –  January 2012  (9 years 3 months) District Manager Mulberry Neckwear 2000  –  2002  (2 years) San Francisco Bay Area District Manager Mulberry Neckwear 2000  –  2002  (2 years) San Francisco Bay Area Skills Business Analysis Management Customer Service Microsoft Excel Forecasting Program Management Team Leadership SAP Product Management Team Building Analysis Strategic Planning Skills  Business Analysis Management Customer Service Microsoft Excel Forecasting Program Management Team Leadership SAP Product Management Team Building Analysis Strategic Planning Business Analysis Management Customer Service Microsoft Excel Forecasting Program Management Team Leadership SAP Product Management Team Building Analysis Strategic Planning Business Analysis Management Customer Service Microsoft Excel Forecasting Program Management Team Leadership SAP Product Management Team Building Analysis Strategic Planning Education California Polytechnic State University-San Luis Obispo BS,  Graphic Communications , Management 1991  – 1996 California Polytechnic State University-San Luis Obispo BS,  Graphic Communications , Management 1991  – 1996 California Polytechnic State University-San Luis Obispo BS,  Graphic Communications , Management 1991  – 1996 California Polytechnic State University-San Luis Obispo BS,  Graphic Communications , Management 1991  – 1996 ", "Skills Cross-functional Team... Mobile Devices Product Development Product Management Product Marketing Semiconductors Start-ups Strategic Planning Strategy Skills  Cross-functional Team... Mobile Devices Product Development Product Management Product Marketing Semiconductors Start-ups Strategic Planning Strategy Cross-functional Team... Mobile Devices Product Development Product Management Product Marketing Semiconductors Start-ups Strategic Planning Strategy Cross-functional Team... Mobile Devices Product Development Product Management Product Marketing Semiconductors Start-ups Strategic Planning Strategy ", "Experience Business Planner Intel Corporation 2001  – Present (14 years) Operations Manager Ryder System, Inc. August 1992  –  January 2001  (8 years 6 months) Operations Manager Ryder Integrated Logistics 1992  –  2001  (9 years) Business Planner Intel Corporation 2001  – Present (14 years) Business Planner Intel Corporation 2001  – Present (14 years) Operations Manager Ryder System, Inc. August 1992  –  January 2001  (8 years 6 months) Operations Manager Ryder System, Inc. August 1992  –  January 2001  (8 years 6 months) Operations Manager Ryder Integrated Logistics 1992  –  2001  (9 years) Operations Manager Ryder Integrated Logistics 1992  –  2001  (9 years) Education Pepperdine University, The George L. Graziadio School of Business and Management 1996  – 1999 University of Southern California - Marshall School of Business Business 1989  – 1992 Pepperdine University, The George L. Graziadio School of Business and Management 1996  – 1999 Pepperdine University, The George L. Graziadio School of Business and Management 1996  – 1999 Pepperdine University, The George L. Graziadio School of Business and Management 1996  – 1999 University of Southern California - Marshall School of Business Business 1989  – 1992 University of Southern California - Marshall School of Business Business 1989  – 1992 University of Southern California - Marshall School of Business Business 1989  – 1992 ", "Skills Process Improvement Change Management ITIL Customer Service Management Retail Inventory Management Leadership Training User Acceptance Testing Warehousing Warehouse Management SAP Implementation SAP Warehouse Management System Deployment Workplace Safety Supervisory Management Regression Testing Functional Testing System Testing Performance Testing End-to-end Testing Project Delivery Supply Chain Logistics Distribution Center... See 11+     See less Skills  Process Improvement Change Management ITIL Customer Service Management Retail Inventory Management Leadership Training User Acceptance Testing Warehousing Warehouse Management SAP Implementation SAP Warehouse Management System Deployment Workplace Safety Supervisory Management Regression Testing Functional Testing System Testing Performance Testing End-to-end Testing Project Delivery Supply Chain Logistics Distribution Center... See 11+     See less Process Improvement Change Management ITIL Customer Service Management Retail Inventory Management Leadership Training User Acceptance Testing Warehousing Warehouse Management SAP Implementation SAP Warehouse Management System Deployment Workplace Safety Supervisory Management Regression Testing Functional Testing System Testing Performance Testing End-to-end Testing Project Delivery Supply Chain Logistics Distribution Center... See 11+     See less Process Improvement Change Management ITIL Customer Service Management Retail Inventory Management Leadership Training User Acceptance Testing Warehousing Warehouse Management SAP Implementation SAP Warehouse Management System Deployment Workplace Safety Supervisory Management Regression Testing Functional Testing System Testing Performance Testing End-to-end Testing Project Delivery Supply Chain Logistics Distribution Center... See 11+     See less ", "Summary PROFESSIONAL SUMMARY: \n• B.S. degree in Human Resource Management \n• Experience in recruitment, on-boarding, employee relations, training, development, compliance, benefits, compensation and other generalist areas. \n• 10 years experience in high tech program management, process development, improvement and implementation. \n• Passion for learning labor law, compliance, identifying risks and implementation. \n• Effective verbal, written and presentation skills to influence global cross-functional teams. \n• Strong planning, organizational, analytical, problem solving, customer service, interpersonal and negotiation skills. \n• IT systems savvy including MS Office, graphics, HRIS and proprietary engineering web based tools. Specialties:Worker Occupational Safety & Health Specialist Summary PROFESSIONAL SUMMARY: \n• B.S. degree in Human Resource Management \n• Experience in recruitment, on-boarding, employee relations, training, development, compliance, benefits, compensation and other generalist areas. \n• 10 years experience in high tech program management, process development, improvement and implementation. \n• Passion for learning labor law, compliance, identifying risks and implementation. \n• Effective verbal, written and presentation skills to influence global cross-functional teams. \n• Strong planning, organizational, analytical, problem solving, customer service, interpersonal and negotiation skills. \n• IT systems savvy including MS Office, graphics, HRIS and proprietary engineering web based tools. Specialties:Worker Occupational Safety & Health Specialist PROFESSIONAL SUMMARY: \n• B.S. degree in Human Resource Management \n• Experience in recruitment, on-boarding, employee relations, training, development, compliance, benefits, compensation and other generalist areas. \n• 10 years experience in high tech program management, process development, improvement and implementation. \n• Passion for learning labor law, compliance, identifying risks and implementation. \n• Effective verbal, written and presentation skills to influence global cross-functional teams. \n• Strong planning, organizational, analytical, problem solving, customer service, interpersonal and negotiation skills. \n• IT systems savvy including MS Office, graphics, HRIS and proprietary engineering web based tools. Specialties:Worker Occupational Safety & Health Specialist PROFESSIONAL SUMMARY: \n• B.S. degree in Human Resource Management \n• Experience in recruitment, on-boarding, employee relations, training, development, compliance, benefits, compensation and other generalist areas. \n• 10 years experience in high tech program management, process development, improvement and implementation. \n• Passion for learning labor law, compliance, identifying risks and implementation. \n• Effective verbal, written and presentation skills to influence global cross-functional teams. \n• Strong planning, organizational, analytical, problem solving, customer service, interpersonal and negotiation skills. \n• IT systems savvy including MS Office, graphics, HRIS and proprietary engineering web based tools. Specialties:Worker Occupational Safety & Health Specialist Experience HR Generalist Snap-on Diagnostics May 2007  – Present (8 years 4 months) o Handle all HR functions including, payroll, benefits, HRIS, etc \no Conduct new hire orientation and processing paperwork. \no Manage benefits administration, including enrollments, employee inquiries and issue resolution. \no Manage workers compensation, FMLA, OSHA & Safety requirements. \no Support payroll administration. \no Manage employee data in HRIS database (ADP E4) and auditing the changes each pay period. \no Employee relations and coaching. \no Recruitment; Screen resumes and applications, publish job openings on corporate website and maintain Affirmation Action database. \no Perform exit interviews and produce termination documentation. \no Prepare contracts for new and existing consultants within specific guidelines and maintain consultant contract log. \no Process improvement and other projects and duties as required. HR Contractor Neophotonics/Nelson Staffing March 2007  –  May 2007  (3 months) •\tResearched and applied government compliance documentation requirements, reviewed current practices, standardized employee records from four acquisitions and initiated archival system. \n•\tAudited over 200 personnel records and 600 Employment Eligibility Verification (I9) documents per government agency compliance laws and regulations. \n•\tDeveloped an Excel database of 800+ records to track terminations, temporary employees, contractors and consultants. Human Resources Assistant Williams Island POA February 2006  –  January 2007  (1 year) Responsible for all aspects of Human Resource Management including (but not limited to)  \n•\tProvided Generalist support to the Director of Human Resources in recruitment, staffing, benefits, payroll, new hire & terminations and other areas. \n•\tRegistered, set up and attended job fairs, coordinated employee training and events. \n•\tWorked with outsource vendors and internal managers to meet staffing requirements. \n•\tConducted all pre-employment screening including background and reference checks. \n•\tConsulted employees and managers relating to benefits, payroll, policies and procedures. \n•\tProcessed all new hires and terminations. \n•\tManaged confidential employee personnel data in HRIS. \n•\tComposed and published employee communications notices and newsletter.  \n•\tResearched employment laws, processed COBRA, Worker’s Compensation claims and EEOC reports. Program Manager Cisco Systems (San Jose, CA) December 1999  –  January 2004  (4 years 2 months) • Implemented a web-based application to provide business partners a portal to obtain training information and documents. Presented program overview, developed and documented new processes and provided user training. Managed customer interface between external partners and internal content providers.  \n• Led global cross-functional teams to fix internet software vulnerable to security defects in a critical-paced environment. \n• Developed training and process documentation and provided individual and group training.  \n• Designed, co-developed and implemented three web-based application tools to improve efficiency, communication and automate manual processes.  \n• Ran weekly meetings; prepared agenda, metrics, minutes and presented status to team and management.  \n• Escalated risks and conducted emergency meetings when required to drive resolution.  \n• Developed and managed restricted access intranet site. Associate Producer Mattel Interactive/Broderbund February 1999  –  October 1999  (9 months) • Involved in all phases of software development including feature definition, user-interface design, graphical content, testing and shipment for consumer print, photo editing and multimedia products. \n• Worked with internal and external developers to ensure functionality met specifications, ensured proper integration with supporting multimedia applets and developed custom skew for Hewlett Packard.  \n• Generated concept and feature specifications, wrote user manual, on-line help and “Read Me” files. \n• Collaborated with graphic artists and marketing to design icons, splash screens, package designs and bundles. \n• Created feature lists and enhancements, selected multimedia content and worked with legal on copyright issues. \n• Maintained daily communications with team and set expectations to drive on-time completion. \n• Worked closely with QA in prioritizing and resolving critical bugs, conducted alpha testing and developed test plans Business Planner Intel Corporation July 1993  –  January 1999  (5 years 7 months) •\tDeveloped global cross-training program that resulted in improved communications and cohesive team efforts. \n•\tDeveloped and presented training manual for new employees.  \n•\tDeveloped Service Level Agreement resulting in reduced response time from counterparts by over 50%. \n•\tDeveloped order management process and coordinated deployment with external developers. \n•\tNegotiated agreements and coordinated delivery schedules with external vendors/contract manufacturers. \n•\tManaged production of 42 million Pentium® processors through multiple conversions from development to EOL. \n•\tPartnered with fab, assembly/test, material and change management planners to ensure production met build plans. \n•\tAnalyzed resource constraints and developed various \"what if\" solutions to determine optimal strategy to meet demand.  \n•\tManaged five programs to support new product debug, compatibility testing and benchmarking systems to support new product development. HR Generalist Snap-on Diagnostics May 2007  – Present (8 years 4 months) o Handle all HR functions including, payroll, benefits, HRIS, etc \no Conduct new hire orientation and processing paperwork. \no Manage benefits administration, including enrollments, employee inquiries and issue resolution. \no Manage workers compensation, FMLA, OSHA & Safety requirements. \no Support payroll administration. \no Manage employee data in HRIS database (ADP E4) and auditing the changes each pay period. \no Employee relations and coaching. \no Recruitment; Screen resumes and applications, publish job openings on corporate website and maintain Affirmation Action database. \no Perform exit interviews and produce termination documentation. \no Prepare contracts for new and existing consultants within specific guidelines and maintain consultant contract log. \no Process improvement and other projects and duties as required. HR Generalist Snap-on Diagnostics May 2007  – Present (8 years 4 months) o Handle all HR functions including, payroll, benefits, HRIS, etc \no Conduct new hire orientation and processing paperwork. \no Manage benefits administration, including enrollments, employee inquiries and issue resolution. \no Manage workers compensation, FMLA, OSHA & Safety requirements. \no Support payroll administration. \no Manage employee data in HRIS database (ADP E4) and auditing the changes each pay period. \no Employee relations and coaching. \no Recruitment; Screen resumes and applications, publish job openings on corporate website and maintain Affirmation Action database. \no Perform exit interviews and produce termination documentation. \no Prepare contracts for new and existing consultants within specific guidelines and maintain consultant contract log. \no Process improvement and other projects and duties as required. HR Contractor Neophotonics/Nelson Staffing March 2007  –  May 2007  (3 months) •\tResearched and applied government compliance documentation requirements, reviewed current practices, standardized employee records from four acquisitions and initiated archival system. \n•\tAudited over 200 personnel records and 600 Employment Eligibility Verification (I9) documents per government agency compliance laws and regulations. \n•\tDeveloped an Excel database of 800+ records to track terminations, temporary employees, contractors and consultants. HR Contractor Neophotonics/Nelson Staffing March 2007  –  May 2007  (3 months) •\tResearched and applied government compliance documentation requirements, reviewed current practices, standardized employee records from four acquisitions and initiated archival system. \n•\tAudited over 200 personnel records and 600 Employment Eligibility Verification (I9) documents per government agency compliance laws and regulations. \n•\tDeveloped an Excel database of 800+ records to track terminations, temporary employees, contractors and consultants. Human Resources Assistant Williams Island POA February 2006  –  January 2007  (1 year) Responsible for all aspects of Human Resource Management including (but not limited to)  \n•\tProvided Generalist support to the Director of Human Resources in recruitment, staffing, benefits, payroll, new hire & terminations and other areas. \n•\tRegistered, set up and attended job fairs, coordinated employee training and events. \n•\tWorked with outsource vendors and internal managers to meet staffing requirements. \n•\tConducted all pre-employment screening including background and reference checks. \n•\tConsulted employees and managers relating to benefits, payroll, policies and procedures. \n•\tProcessed all new hires and terminations. \n•\tManaged confidential employee personnel data in HRIS. \n•\tComposed and published employee communications notices and newsletter.  \n•\tResearched employment laws, processed COBRA, Worker’s Compensation claims and EEOC reports. Human Resources Assistant Williams Island POA February 2006  –  January 2007  (1 year) Responsible for all aspects of Human Resource Management including (but not limited to)  \n•\tProvided Generalist support to the Director of Human Resources in recruitment, staffing, benefits, payroll, new hire & terminations and other areas. \n•\tRegistered, set up and attended job fairs, coordinated employee training and events. \n•\tWorked with outsource vendors and internal managers to meet staffing requirements. \n•\tConducted all pre-employment screening including background and reference checks. \n•\tConsulted employees and managers relating to benefits, payroll, policies and procedures. \n•\tProcessed all new hires and terminations. \n•\tManaged confidential employee personnel data in HRIS. \n•\tComposed and published employee communications notices and newsletter.  \n•\tResearched employment laws, processed COBRA, Worker’s Compensation claims and EEOC reports. Program Manager Cisco Systems (San Jose, CA) December 1999  –  January 2004  (4 years 2 months) • Implemented a web-based application to provide business partners a portal to obtain training information and documents. Presented program overview, developed and documented new processes and provided user training. Managed customer interface between external partners and internal content providers.  \n• Led global cross-functional teams to fix internet software vulnerable to security defects in a critical-paced environment. \n• Developed training and process documentation and provided individual and group training.  \n• Designed, co-developed and implemented three web-based application tools to improve efficiency, communication and automate manual processes.  \n• Ran weekly meetings; prepared agenda, metrics, minutes and presented status to team and management.  \n• Escalated risks and conducted emergency meetings when required to drive resolution.  \n• Developed and managed restricted access intranet site. Program Manager Cisco Systems (San Jose, CA) December 1999  –  January 2004  (4 years 2 months) • Implemented a web-based application to provide business partners a portal to obtain training information and documents. Presented program overview, developed and documented new processes and provided user training. Managed customer interface between external partners and internal content providers.  \n• Led global cross-functional teams to fix internet software vulnerable to security defects in a critical-paced environment. \n• Developed training and process documentation and provided individual and group training.  \n• Designed, co-developed and implemented three web-based application tools to improve efficiency, communication and automate manual processes.  \n• Ran weekly meetings; prepared agenda, metrics, minutes and presented status to team and management.  \n• Escalated risks and conducted emergency meetings when required to drive resolution.  \n• Developed and managed restricted access intranet site. Associate Producer Mattel Interactive/Broderbund February 1999  –  October 1999  (9 months) • Involved in all phases of software development including feature definition, user-interface design, graphical content, testing and shipment for consumer print, photo editing and multimedia products. \n• Worked with internal and external developers to ensure functionality met specifications, ensured proper integration with supporting multimedia applets and developed custom skew for Hewlett Packard.  \n• Generated concept and feature specifications, wrote user manual, on-line help and “Read Me” files. \n• Collaborated with graphic artists and marketing to design icons, splash screens, package designs and bundles. \n• Created feature lists and enhancements, selected multimedia content and worked with legal on copyright issues. \n• Maintained daily communications with team and set expectations to drive on-time completion. \n• Worked closely with QA in prioritizing and resolving critical bugs, conducted alpha testing and developed test plans Associate Producer Mattel Interactive/Broderbund February 1999  –  October 1999  (9 months) • Involved in all phases of software development including feature definition, user-interface design, graphical content, testing and shipment for consumer print, photo editing and multimedia products. \n• Worked with internal and external developers to ensure functionality met specifications, ensured proper integration with supporting multimedia applets and developed custom skew for Hewlett Packard.  \n• Generated concept and feature specifications, wrote user manual, on-line help and “Read Me” files. \n• Collaborated with graphic artists and marketing to design icons, splash screens, package designs and bundles. \n• Created feature lists and enhancements, selected multimedia content and worked with legal on copyright issues. \n• Maintained daily communications with team and set expectations to drive on-time completion. \n• Worked closely with QA in prioritizing and resolving critical bugs, conducted alpha testing and developed test plans Business Planner Intel Corporation July 1993  –  January 1999  (5 years 7 months) •\tDeveloped global cross-training program that resulted in improved communications and cohesive team efforts. \n•\tDeveloped and presented training manual for new employees.  \n•\tDeveloped Service Level Agreement resulting in reduced response time from counterparts by over 50%. \n•\tDeveloped order management process and coordinated deployment with external developers. \n•\tNegotiated agreements and coordinated delivery schedules with external vendors/contract manufacturers. \n•\tManaged production of 42 million Pentium® processors through multiple conversions from development to EOL. \n•\tPartnered with fab, assembly/test, material and change management planners to ensure production met build plans. \n•\tAnalyzed resource constraints and developed various \"what if\" solutions to determine optimal strategy to meet demand.  \n•\tManaged five programs to support new product debug, compatibility testing and benchmarking systems to support new product development. Business Planner Intel Corporation July 1993  –  January 1999  (5 years 7 months) •\tDeveloped global cross-training program that resulted in improved communications and cohesive team efforts. \n•\tDeveloped and presented training manual for new employees.  \n•\tDeveloped Service Level Agreement resulting in reduced response time from counterparts by over 50%. \n•\tDeveloped order management process and coordinated deployment with external developers. \n•\tNegotiated agreements and coordinated delivery schedules with external vendors/contract manufacturers. \n•\tManaged production of 42 million Pentium® processors through multiple conversions from development to EOL. \n•\tPartnered with fab, assembly/test, material and change management planners to ensure production met build plans. \n•\tAnalyzed resource constraints and developed various \"what if\" solutions to determine optimal strategy to meet demand.  \n•\tManaged five programs to support new product debug, compatibility testing and benchmarking systems to support new product development. Skills Employee Relations Training Talent Acquisition Human Resources Recruiting Process Improvement Cross-functional Team... Personnel Management Skills  Employee Relations Training Talent Acquisition Human Resources Recruiting Process Improvement Cross-functional Team... Personnel Management Employee Relations Training Talent Acquisition Human Resources Recruiting Process Improvement Cross-functional Team... Personnel Management Employee Relations Training Talent Acquisition Human Resources Recruiting Process Improvement Cross-functional Team... Personnel Management Education The George Washington University - School of Business Master's Certificate,  Information Technology Project Management 2000  – 2001 San Jose State University B.S,  Human Resource Management 1991  – 1996 Activities and Societies:  VP Operations ,  AISEC (Association of International Exchange Students in Economics and Management) http://www.aiesecus.org West Valley College AS,  Business Administration 1988  – 1991 The George Washington University - School of Business Master's Certificate,  Information Technology Project Management 2000  – 2001 The George Washington University - School of Business Master's Certificate,  Information Technology Project Management 2000  – 2001 The George Washington University - School of Business Master's Certificate,  Information Technology Project Management 2000  – 2001 San Jose State University B.S,  Human Resource Management 1991  – 1996 Activities and Societies:  VP Operations ,  AISEC (Association of International Exchange Students in Economics and Management) http://www.aiesecus.org San Jose State University B.S,  Human Resource Management 1991  – 1996 Activities and Societies:  VP Operations ,  AISEC (Association of International Exchange Students in Economics and Management) http://www.aiesecus.org San Jose State University B.S,  Human Resource Management 1991  – 1996 Activities and Societies:  VP Operations ,  AISEC (Association of International Exchange Students in Economics and Management) http://www.aiesecus.org West Valley College AS,  Business Administration 1988  – 1991 West Valley College AS,  Business Administration 1988  – 1991 West Valley College AS,  Business Administration 1988  – 1991 ", "Languages Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Product Marketing Go-to-market Strategy Management Positioning Product Management Competitive Analysis Semiconductors Cross-functional Team... Multi-channel Marketing Strategic Partnerships Product Launch Demand Generation Data Analytics Machine Learning Python Business Development Business Strategy CRM Cloud Computing Consulting Enterprise Software Program Management See 7+     See less Skills  Product Marketing Go-to-market Strategy Management Positioning Product Management Competitive Analysis Semiconductors Cross-functional Team... Multi-channel Marketing Strategic Partnerships Product Launch Demand Generation Data Analytics Machine Learning Python Business Development Business Strategy CRM Cloud Computing Consulting Enterprise Software Program Management See 7+     See less Product Marketing Go-to-market Strategy Management Positioning Product Management Competitive Analysis Semiconductors Cross-functional Team... Multi-channel Marketing Strategic Partnerships Product Launch Demand Generation Data Analytics Machine Learning Python Business Development Business Strategy CRM Cloud Computing Consulting Enterprise Software Program Management See 7+     See less Product Marketing Go-to-market Strategy Management Positioning Product Management Competitive Analysis Semiconductors Cross-functional Team... Multi-channel Marketing Strategic Partnerships Product Launch Demand Generation Data Analytics Machine Learning Python Business Development Business Strategy CRM Cloud Computing Consulting Enterprise Software Program Management See 7+     See less ", "Summary MARKETING / SALES / STRATEGIC PLANNING / ALLIANCE MANAGEMENT AND BUSINESS DEVELOPMENT / NEW BUSINESS VENTURES / MBA Specialties:Corporate entrepreneurship - cofounded a business which was acquired by the market segment leader. High-technology product development and marketing. Venture Capital investments. Forming and maintaining strategic alliances. Summary MARKETING / SALES / STRATEGIC PLANNING / ALLIANCE MANAGEMENT AND BUSINESS DEVELOPMENT / NEW BUSINESS VENTURES / MBA Specialties:Corporate entrepreneurship - cofounded a business which was acquired by the market segment leader. High-technology product development and marketing. Venture Capital investments. Forming and maintaining strategic alliances. MARKETING / SALES / STRATEGIC PLANNING / ALLIANCE MANAGEMENT AND BUSINESS DEVELOPMENT / NEW BUSINESS VENTURES / MBA Specialties:Corporate entrepreneurship - cofounded a business which was acquired by the market segment leader. High-technology product development and marketing. Venture Capital investments. Forming and maintaining strategic alliances. MARKETING / SALES / STRATEGIC PLANNING / ALLIANCE MANAGEMENT AND BUSINESS DEVELOPMENT / NEW BUSINESS VENTURES / MBA Specialties:Corporate entrepreneurship - cofounded a business which was acquired by the market segment leader. High-technology product development and marketing. Venture Capital investments. Forming and maintaining strategic alliances. Experience Business Development Manager / New Product Innovation Intel Corporation March 2013  – Present (2 years 6 months) Business Development Manager / New Product Innovation Intel Corporation March 2013  – Present (2 years 6 months) Business Development Manager / New Product Innovation Intel Corporation March 2013  – Present (2 years 6 months) Skills Marketing Entrepreneurship Business Development Product Development Strategic Planning Leadership Segmentation Venture Capital Cross-functional Team... Product Management Product Marketing Program Management Product Launch Semiconductors Start-ups Competitive Analysis Business Strategy Positioning Product Lifecycle... Project Management Financial Modeling Pricing Marketing Strategy Consumer Electronics Intel Strategy Market Research Enterprise Software Wireless Go-to-market Strategy See 15+     See less Skills  Marketing Entrepreneurship Business Development Product Development Strategic Planning Leadership Segmentation Venture Capital Cross-functional Team... Product Management Product Marketing Program Management Product Launch Semiconductors Start-ups Competitive Analysis Business Strategy Positioning Product Lifecycle... Project Management Financial Modeling Pricing Marketing Strategy Consumer Electronics Intel Strategy Market Research Enterprise Software Wireless Go-to-market Strategy See 15+     See less Marketing Entrepreneurship Business Development Product Development Strategic Planning Leadership Segmentation Venture Capital Cross-functional Team... Product Management Product Marketing Program Management Product Launch Semiconductors Start-ups Competitive Analysis Business Strategy Positioning Product Lifecycle... Project Management Financial Modeling Pricing Marketing Strategy Consumer Electronics Intel Strategy Market Research Enterprise Software Wireless Go-to-market Strategy See 15+     See less Marketing Entrepreneurship Business Development Product Development Strategic Planning Leadership Segmentation Venture Capital Cross-functional Team... Product Management Product Marketing Program Management Product Launch Semiconductors Start-ups Competitive Analysis Business Strategy Positioning Product Lifecycle... Project Management Financial Modeling Pricing Marketing Strategy Consumer Electronics Intel Strategy Market Research Enterprise Software Wireless Go-to-market Strategy See 15+     See less Education Babson College - Franklin W. Olin Graduate School of Business MBA 2001  – 2003 University of California, San Diego Professional Certificate 1991  – 1993 University of Southern California BS September 1983  – May 1987 USC Bachelor of Science 1983  – 1987 Babson College - Franklin W. Olin Graduate School of Business MBA 2001  – 2003 Babson College - Franklin W. Olin Graduate School of Business MBA 2001  – 2003 Babson College - Franklin W. Olin Graduate School of Business MBA 2001  – 2003 University of California, San Diego Professional Certificate 1991  – 1993 University of California, San Diego Professional Certificate 1991  – 1993 University of California, San Diego Professional Certificate 1991  – 1993 University of Southern California BS September 1983  – May 1987 University of Southern California BS September 1983  – May 1987 University of Southern California BS September 1983  – May 1987 USC Bachelor of Science 1983  – 1987 USC Bachelor of Science 1983  – 1987 USC Bachelor of Science 1983  – 1987 Honors & Awards Additional Honors & Awards •\tReceived the prestigious National Performance Review “Hammer Award” from Vice President Al Gore, for innovations in large Government procurement, March 1997. \n•\tPatent-holding inventor of US Patent 7,073,195 B2 Issued July 4, 2006 and US 7,395,246 B2 Issued July 1, 2008 \n•\tReceived over 20 merit awards at Intel, including awards for creating investment strategies for Intel Capital, launching a new business and several microprocessors. \n•\tGraduated Magna Cum Laude from Babson College MBA, a top-tier program which is broadly rated #1 in entrepreneurship. \n•\tHighly decorated, honorably discharged Lieutenant Commander, US Navy; distinguished service in submarines, ships and R&D. Additional Honors & Awards •\tReceived the prestigious National Performance Review “Hammer Award” from Vice President Al Gore, for innovations in large Government procurement, March 1997. \n•\tPatent-holding inventor of US Patent 7,073,195 B2 Issued July 4, 2006 and US 7,395,246 B2 Issued July 1, 2008 \n•\tReceived over 20 merit awards at Intel, including awards for creating investment strategies for Intel Capital, launching a new business and several microprocessors. \n•\tGraduated Magna Cum Laude from Babson College MBA, a top-tier program which is broadly rated #1 in entrepreneurship. \n•\tHighly decorated, honorably discharged Lieutenant Commander, US Navy; distinguished service in submarines, ships and R&D. Additional Honors & Awards •\tReceived the prestigious National Performance Review “Hammer Award” from Vice President Al Gore, for innovations in large Government procurement, March 1997. \n•\tPatent-holding inventor of US Patent 7,073,195 B2 Issued July 4, 2006 and US 7,395,246 B2 Issued July 1, 2008 \n•\tReceived over 20 merit awards at Intel, including awards for creating investment strategies for Intel Capital, launching a new business and several microprocessors. \n•\tGraduated Magna Cum Laude from Babson College MBA, a top-tier program which is broadly rated #1 in entrepreneurship. \n•\tHighly decorated, honorably discharged Lieutenant Commander, US Navy; distinguished service in submarines, ships and R&D. Additional Honors & Awards •\tReceived the prestigious National Performance Review “Hammer Award” from Vice President Al Gore, for innovations in large Government procurement, March 1997. \n•\tPatent-holding inventor of US Patent 7,073,195 B2 Issued July 4, 2006 and US 7,395,246 B2 Issued July 1, 2008 \n•\tReceived over 20 merit awards at Intel, including awards for creating investment strategies for Intel Capital, launching a new business and several microprocessors. \n•\tGraduated Magna Cum Laude from Babson College MBA, a top-tier program which is broadly rated #1 in entrepreneurship. \n•\tHighly decorated, honorably discharged Lieutenant Commander, US Navy; distinguished service in submarines, ships and R&D. ", "Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Product Marketing Cross-functional Team... Supply Chain Management Business Analysis Competitive Analysis Operations Management Analytics Supply Chain Product Management Semiconductors Management Sales Operations Product Development Analysis Program Management Skills  Product Marketing Cross-functional Team... Supply Chain Management Business Analysis Competitive Analysis Operations Management Analytics Supply Chain Product Management Semiconductors Management Sales Operations Product Development Analysis Program Management Product Marketing Cross-functional Team... Supply Chain Management Business Analysis Competitive Analysis Operations Management Analytics Supply Chain Product Management Semiconductors Management Sales Operations Product Development Analysis Program Management Product Marketing Cross-functional Team... Supply Chain Management Business Analysis Competitive Analysis Operations Management Analytics Supply Chain Product Management Semiconductors Management Sales Operations Product Development Analysis Program Management ", "Skills Management Project Management Product Management Go-to-market Strategy Leadership Organizational Design Forecasting Cross-functional Team... Pricing Market Analysis Analysis Product Marketing International Relations Semiconductors Sales Skills  Management Project Management Product Management Go-to-market Strategy Leadership Organizational Design Forecasting Cross-functional Team... Pricing Market Analysis Analysis Product Marketing International Relations Semiconductors Sales Management Project Management Product Management Go-to-market Strategy Leadership Organizational Design Forecasting Cross-functional Team... Pricing Market Analysis Analysis Product Marketing International Relations Semiconductors Sales Management Project Management Product Management Go-to-market Strategy Leadership Organizational Design Forecasting Cross-functional Team... Pricing Market Analysis Analysis Product Marketing International Relations Semiconductors Sales ", "Languages Spanish Spanish Spanish Skills Spanish-speaking Management Community Outreach Critical Thinking Leadership Strategic Planning Leadership Development Team Building Cross-functional Team... Team Leadership Data Analysis Organizational... Public Speaking Project Management Analysis Change Management See 1+     See less Skills  Spanish-speaking Management Community Outreach Critical Thinking Leadership Strategic Planning Leadership Development Team Building Cross-functional Team... Team Leadership Data Analysis Organizational... Public Speaking Project Management Analysis Change Management See 1+     See less Spanish-speaking Management Community Outreach Critical Thinking Leadership Strategic Planning Leadership Development Team Building Cross-functional Team... Team Leadership Data Analysis Organizational... Public Speaking Project Management Analysis Change Management See 1+     See less Spanish-speaking Management Community Outreach Critical Thinking Leadership Strategic Planning Leadership Development Team Building Cross-functional Team... Team Leadership Data Analysis Organizational... Public Speaking Project Management Analysis Change Management See 1+     See less ", "Summary Over 18 years of experience in Supply Chain Planning & Business Process Transformation, Integration, Standardization and Optimization, Data Analytics, Data Modeling, LEAN and BI Integration.  \n \nSpecialties: Strategic supply chain vision and implementation, CIP, Operations, Process development methodologies, data architecture, Internal and External Foundry and Mergers & Acquisitions Supply Chains. Customer MDM, Org and LEAN consultative initiatives. \n \n* 2 years of first-line performance management Summary Over 18 years of experience in Supply Chain Planning & Business Process Transformation, Integration, Standardization and Optimization, Data Analytics, Data Modeling, LEAN and BI Integration.  \n \nSpecialties: Strategic supply chain vision and implementation, CIP, Operations, Process development methodologies, data architecture, Internal and External Foundry and Mergers & Acquisitions Supply Chains. Customer MDM, Org and LEAN consultative initiatives. \n \n* 2 years of first-line performance management Over 18 years of experience in Supply Chain Planning & Business Process Transformation, Integration, Standardization and Optimization, Data Analytics, Data Modeling, LEAN and BI Integration.  \n \nSpecialties: Strategic supply chain vision and implementation, CIP, Operations, Process development methodologies, data architecture, Internal and External Foundry and Mergers & Acquisitions Supply Chains. Customer MDM, Org and LEAN consultative initiatives. \n \n* 2 years of first-line performance management Over 18 years of experience in Supply Chain Planning & Business Process Transformation, Integration, Standardization and Optimization, Data Analytics, Data Modeling, LEAN and BI Integration.  \n \nSpecialties: Strategic supply chain vision and implementation, CIP, Operations, Process development methodologies, data architecture, Internal and External Foundry and Mergers & Acquisitions Supply Chains. Customer MDM, Org and LEAN consultative initiatives. \n \n* 2 years of first-line performance management Experience Enterprise Business Architect Intel Corporation March 2009  – Present (6 years 6 months) Enterprise Business Architect Intel Corporation March 2009  – Present (6 years 6 months) Enterprise Business Architect Intel Corporation March 2009  – Present (6 years 6 months) Skills Process Engineering Program Management Master Data Management Analysis Business Analysis Requirements Analysis Analytics Enterprise Architecture Architectural Design Process Management Process Mapping Process Optimization Team Leadership Team Building Team Management Cross-functional Team... Virtual Teams Strategic Planning Strategy Development Strategic Thinking Strategic Analysis Strategic Partnerships Acquisition Integration Customer Acquisition Acquisition Analysis Business Process Data Analysis Business Transformation Agile Project Management Business Process... Strategy Business Process Mapping Project Planning Integration Business Valuation SAP Lean Manufacturing Manufacturing Supply Chain Management Process Improvement Product Management Business Intelligence Business Process... Supply Management Product Planning Product Road Mapping New Product Roll Out New Product Release Mergers & Acquisitions See 35+     See less Skills  Process Engineering Program Management Master Data Management Analysis Business Analysis Requirements Analysis Analytics Enterprise Architecture Architectural Design Process Management Process Mapping Process Optimization Team Leadership Team Building Team Management Cross-functional Team... Virtual Teams Strategic Planning Strategy Development Strategic Thinking Strategic Analysis Strategic Partnerships Acquisition Integration Customer Acquisition Acquisition Analysis Business Process Data Analysis Business Transformation Agile Project Management Business Process... Strategy Business Process Mapping Project Planning Integration Business Valuation SAP Lean Manufacturing Manufacturing Supply Chain Management Process Improvement Product Management Business Intelligence Business Process... Supply Management Product Planning Product Road Mapping New Product Roll Out New Product Release Mergers & Acquisitions See 35+     See less Process Engineering Program Management Master Data Management Analysis Business Analysis Requirements Analysis Analytics Enterprise Architecture Architectural Design Process Management Process Mapping Process Optimization Team Leadership Team Building Team Management Cross-functional Team... Virtual Teams Strategic Planning Strategy Development Strategic Thinking Strategic Analysis Strategic Partnerships Acquisition Integration Customer Acquisition Acquisition Analysis Business Process Data Analysis Business Transformation Agile Project Management Business Process... Strategy Business Process Mapping Project Planning Integration Business Valuation SAP Lean Manufacturing Manufacturing Supply Chain Management Process Improvement Product Management Business Intelligence Business Process... Supply Management Product Planning Product Road Mapping New Product Roll Out New Product Release Mergers & Acquisitions See 35+     See less Process Engineering Program Management Master Data Management Analysis Business Analysis Requirements Analysis Analytics Enterprise Architecture Architectural Design Process Management Process Mapping Process Optimization Team Leadership Team Building Team Management Cross-functional Team... Virtual Teams Strategic Planning Strategy Development Strategic Thinking Strategic Analysis Strategic Partnerships Acquisition Integration Customer Acquisition Acquisition Analysis Business Process Data Analysis Business Transformation Agile Project Management Business Process... Strategy Business Process Mapping Project Planning Integration Business Valuation SAP Lean Manufacturing Manufacturing Supply Chain Management Process Improvement Product Management Business Intelligence Business Process... Supply Management Product Planning Product Road Mapping New Product Roll Out New Product Release Mergers & Acquisitions See 35+     See less ", "Summary It's All About You \n \nIt does not matter what zip code you live in or what zip code you would like to move to, the objective is the same, to provide you with personable excellent service !!!!!! \n \nI also specialize in representing Pro Athletes in the purchase or sale of a home or investment property. I will also locate short or long term rental housing for Professional Athletes throughout the entire San Francisco Bay Area.  \n \n \n \n☎ Call/Text: 408.605.9006 \n★ Email: phil.simms@cbnorcal.com \nWeb: www.Phil-Simms.com \nTwitter: @SimmsPhil \n \nThank you Summary It's All About You \n \nIt does not matter what zip code you live in or what zip code you would like to move to, the objective is the same, to provide you with personable excellent service !!!!!! \n \nI also specialize in representing Pro Athletes in the purchase or sale of a home or investment property. I will also locate short or long term rental housing for Professional Athletes throughout the entire San Francisco Bay Area.  \n \n \n \n☎ Call/Text: 408.605.9006 \n★ Email: phil.simms@cbnorcal.com \nWeb: www.Phil-Simms.com \nTwitter: @SimmsPhil \n \nThank you It's All About You \n \nIt does not matter what zip code you live in or what zip code you would like to move to, the objective is the same, to provide you with personable excellent service !!!!!! \n \nI also specialize in representing Pro Athletes in the purchase or sale of a home or investment property. I will also locate short or long term rental housing for Professional Athletes throughout the entire San Francisco Bay Area.  \n \n \n \n☎ Call/Text: 408.605.9006 \n★ Email: phil.simms@cbnorcal.com \nWeb: www.Phil-Simms.com \nTwitter: @SimmsPhil \n \nThank you It's All About You \n \nIt does not matter what zip code you live in or what zip code you would like to move to, the objective is the same, to provide you with personable excellent service !!!!!! \n \nI also specialize in representing Pro Athletes in the purchase or sale of a home or investment property. I will also locate short or long term rental housing for Professional Athletes throughout the entire San Francisco Bay Area.  \n \n \n \n☎ Call/Text: 408.605.9006 \n★ Email: phil.simms@cbnorcal.com \nWeb: www.Phil-Simms.com \nTwitter: @SimmsPhil \n \nThank you Experience Realtor Coldwell Banker Residential Brokerage May 2011  – Present (4 years 4 months) San Francisco Bay Area •\tRepresentative for Buyers and Sellers of residential properties \n•\tLocating available homes via market research \n•\tProviding market pricing analysis to home buyers and prospects  \n•\tNegotiating contract pricing, terms and conditions \n•\tPersuading, influencing and implementing solutions to resolve contract issues/problems \n•\tPerforming comparative market analysis to establish a home value that will attract home buyers \n•\tImplementing marketing campaigns to showcase homes via YouTube, Twitter, Facebook, Real Estate Blogs and www.Phil-Simms.com \n•\tPerforming lead generation activities such as:  \no\tHosting open houses \no\tQuarterly targeted mailing campaigns \no\tCultivating relationships via Networking events both locally and nationally \no\tExecuting daily messaging campaigns via Twitter, Facebook and LinkedIn Real Estate Agent Prudential Real Estate 2009  –  2011  (2 years) San Francisco Bay Area NPI Materials Manager Palm, Inc February 2010  –  October 2010  (9 months) Primarily responsible for ensuring materials supply supports all prototype and production build schedules. Managed all risk release and risk buy deliverables internally and at CM. Also responsible for tracking and communicating critical parts release status. Managed raw material and pipeline status of long lead time parts. Managed clear to build reporting matrices.  \n \n• Managed and tracked material BOM costs from prototype thru first customer shipment. Performed scenario and feature cost analysis.  \n• Communicated key cost drivers and financial impacts of BOM changes to project team. Managed materials escalations with JDM and GSMs. Performed readiness analysis and communicated material risks to project team.  \n• Successfully launched Palm Pre-2 Mobile Phone in September 2010. Business Planner Intel Corporation June 2005  –  June 2009  (4 years 1 month) Developed and implemented quarterly build plans that fully supported the corporate revenue goals. \nPerformed capacity modeling and what-if build plan analysis. Fully accountable for ensuring product family Inventory levels are aligned to key corporate objectives. Created and implemented new product BOM’s.  \n \n• Responsible for the development and execution of the master manufacturing schedule. \n• Performed weekly backlog demand vs. supply analysis. \n• Executed build plan changes to support forecasted demand. \n• Responsible for determining production priorities and approving build plan changes to support unforecasted demand upsides \n* Provided available to promise and line item schedule information to sales and marketing. \n•Implemented all new product plans and schedules into planning systems and communicated all readiness issues to management \n•Maintained weeks of inventory goals at all strategic hubs \n• Responsible for sustaining order fulfillment rates while balancing strategic inventory goals.  \nResponsible for implementing corrective measures to mitigate excessive inventory build up.  \n• Analyzed and resolved all inventory discrepancies. \n• Successfully launched Intel’s first 32 Nanometer Mobile CPU’s – directly responsible for developing all \nmanufacturing schedules, shipping 25 million units and obtaining $5 Billion in revenue in 2008 \n• Successfully redesigned Intel’s excess inventory reporting tools and capabilities. Materials Manager Apple Computer June 2003  –  February 2005  (1 year 9 months) Responsible for reporting excess and obsolete inventory metrics to management. Developing forward-looking risk and opportunity analysis to simulate materials exposures and cost of incremental demand. Reviewed and monitored excess inventory by factories. Implemented and directed actions to be taken to mitigate risks. Responsible for driving processes and final deposition of excess supply at various manufacturing sites.  \n \nDeveloped quarterly excess forecasts and analysis which has resulted in over $3 million dollars in savings.  \nImplemented monthly new buy/repair analysis and processes, which resulted in more accurate, spend forecasts.  \nProvided detailed part number analysis to corporate finance to ensure excess reserves were properly accounted for. NPI Program Planner Hewlett-Packard 2000  –  2001  (1 year) Product Planner Hynix Semiconductor Incorporated January 1998  –  January 2000  (2 years 1 month) Responsible for managing the daily logistics, scheduling, delinquent backlog, and inventory levels at strategic hubs for memory chips. Responsible for analyzing customer demand, developing forecasts and adjusting supply plans to meet changes in customer demand. Responsible for providing delivery quotes, inventory reconciliation, and processing of debit/credit memos. \n \nManaged excess inventory by rebalancing strategic hub inventories and developing disposition plans.  \nManaged vendor selection and all outsourcing activities in support of daily operations.  \nWorked cross functionally with sales and marketing channels to plan and implement objectives to meet financial goals \nMonitored actuals versus forecasts, compiled data and created presentations to management.  \nSuccessfully introduced and managed Hynix's first generation 128MB memory chips. Customer Service Planner Micro Linear Corporation January 1995  –  January 1997  (2 years 1 month) Served as the primary contact person for an assigned customer base. Audited customer purchase orders for accuracy of product, pricing and delivery requirements. Approved and entered purchase orders, RMA's, eval requests, scheduling and shipping information for analog and mixed signal components.  \n \nServed as the focal point for product availability, credit, RMA's, and shipping information.  \nResearched and resolved open backlog issues.  \nMonitored the allocation of products and maintained customer backlogs.  \nProvided weekly reporting of sales, shipping, and backlog information to management.  \nAnalyzed weekly point of sale and created inventory reports for the distribution channel. Realtor Coldwell Banker Residential Brokerage May 2011  – Present (4 years 4 months) San Francisco Bay Area •\tRepresentative for Buyers and Sellers of residential properties \n•\tLocating available homes via market research \n•\tProviding market pricing analysis to home buyers and prospects  \n•\tNegotiating contract pricing, terms and conditions \n•\tPersuading, influencing and implementing solutions to resolve contract issues/problems \n•\tPerforming comparative market analysis to establish a home value that will attract home buyers \n•\tImplementing marketing campaigns to showcase homes via YouTube, Twitter, Facebook, Real Estate Blogs and www.Phil-Simms.com \n•\tPerforming lead generation activities such as:  \no\tHosting open houses \no\tQuarterly targeted mailing campaigns \no\tCultivating relationships via Networking events both locally and nationally \no\tExecuting daily messaging campaigns via Twitter, Facebook and LinkedIn Realtor Coldwell Banker Residential Brokerage May 2011  – Present (4 years 4 months) San Francisco Bay Area •\tRepresentative for Buyers and Sellers of residential properties \n•\tLocating available homes via market research \n•\tProviding market pricing analysis to home buyers and prospects  \n•\tNegotiating contract pricing, terms and conditions \n•\tPersuading, influencing and implementing solutions to resolve contract issues/problems \n•\tPerforming comparative market analysis to establish a home value that will attract home buyers \n•\tImplementing marketing campaigns to showcase homes via YouTube, Twitter, Facebook, Real Estate Blogs and www.Phil-Simms.com \n•\tPerforming lead generation activities such as:  \no\tHosting open houses \no\tQuarterly targeted mailing campaigns \no\tCultivating relationships via Networking events both locally and nationally \no\tExecuting daily messaging campaigns via Twitter, Facebook and LinkedIn Real Estate Agent Prudential Real Estate 2009  –  2011  (2 years) San Francisco Bay Area Real Estate Agent Prudential Real Estate 2009  –  2011  (2 years) San Francisco Bay Area NPI Materials Manager Palm, Inc February 2010  –  October 2010  (9 months) Primarily responsible for ensuring materials supply supports all prototype and production build schedules. Managed all risk release and risk buy deliverables internally and at CM. Also responsible for tracking and communicating critical parts release status. Managed raw material and pipeline status of long lead time parts. Managed clear to build reporting matrices.  \n \n• Managed and tracked material BOM costs from prototype thru first customer shipment. Performed scenario and feature cost analysis.  \n• Communicated key cost drivers and financial impacts of BOM changes to project team. Managed materials escalations with JDM and GSMs. Performed readiness analysis and communicated material risks to project team.  \n• Successfully launched Palm Pre-2 Mobile Phone in September 2010. NPI Materials Manager Palm, Inc February 2010  –  October 2010  (9 months) Primarily responsible for ensuring materials supply supports all prototype and production build schedules. Managed all risk release and risk buy deliverables internally and at CM. Also responsible for tracking and communicating critical parts release status. Managed raw material and pipeline status of long lead time parts. Managed clear to build reporting matrices.  \n \n• Managed and tracked material BOM costs from prototype thru first customer shipment. Performed scenario and feature cost analysis.  \n• Communicated key cost drivers and financial impacts of BOM changes to project team. Managed materials escalations with JDM and GSMs. Performed readiness analysis and communicated material risks to project team.  \n• Successfully launched Palm Pre-2 Mobile Phone in September 2010. Business Planner Intel Corporation June 2005  –  June 2009  (4 years 1 month) Developed and implemented quarterly build plans that fully supported the corporate revenue goals. \nPerformed capacity modeling and what-if build plan analysis. Fully accountable for ensuring product family Inventory levels are aligned to key corporate objectives. Created and implemented new product BOM’s.  \n \n• Responsible for the development and execution of the master manufacturing schedule. \n• Performed weekly backlog demand vs. supply analysis. \n• Executed build plan changes to support forecasted demand. \n• Responsible for determining production priorities and approving build plan changes to support unforecasted demand upsides \n* Provided available to promise and line item schedule information to sales and marketing. \n•Implemented all new product plans and schedules into planning systems and communicated all readiness issues to management \n•Maintained weeks of inventory goals at all strategic hubs \n• Responsible for sustaining order fulfillment rates while balancing strategic inventory goals.  \nResponsible for implementing corrective measures to mitigate excessive inventory build up.  \n• Analyzed and resolved all inventory discrepancies. \n• Successfully launched Intel’s first 32 Nanometer Mobile CPU’s – directly responsible for developing all \nmanufacturing schedules, shipping 25 million units and obtaining $5 Billion in revenue in 2008 \n• Successfully redesigned Intel’s excess inventory reporting tools and capabilities. Business Planner Intel Corporation June 2005  –  June 2009  (4 years 1 month) Developed and implemented quarterly build plans that fully supported the corporate revenue goals. \nPerformed capacity modeling and what-if build plan analysis. Fully accountable for ensuring product family Inventory levels are aligned to key corporate objectives. Created and implemented new product BOM’s.  \n \n• Responsible for the development and execution of the master manufacturing schedule. \n• Performed weekly backlog demand vs. supply analysis. \n• Executed build plan changes to support forecasted demand. \n• Responsible for determining production priorities and approving build plan changes to support unforecasted demand upsides \n* Provided available to promise and line item schedule information to sales and marketing. \n•Implemented all new product plans and schedules into planning systems and communicated all readiness issues to management \n•Maintained weeks of inventory goals at all strategic hubs \n• Responsible for sustaining order fulfillment rates while balancing strategic inventory goals.  \nResponsible for implementing corrective measures to mitigate excessive inventory build up.  \n• Analyzed and resolved all inventory discrepancies. \n• Successfully launched Intel’s first 32 Nanometer Mobile CPU’s – directly responsible for developing all \nmanufacturing schedules, shipping 25 million units and obtaining $5 Billion in revenue in 2008 \n• Successfully redesigned Intel’s excess inventory reporting tools and capabilities. Materials Manager Apple Computer June 2003  –  February 2005  (1 year 9 months) Responsible for reporting excess and obsolete inventory metrics to management. Developing forward-looking risk and opportunity analysis to simulate materials exposures and cost of incremental demand. Reviewed and monitored excess inventory by factories. Implemented and directed actions to be taken to mitigate risks. Responsible for driving processes and final deposition of excess supply at various manufacturing sites.  \n \nDeveloped quarterly excess forecasts and analysis which has resulted in over $3 million dollars in savings.  \nImplemented monthly new buy/repair analysis and processes, which resulted in more accurate, spend forecasts.  \nProvided detailed part number analysis to corporate finance to ensure excess reserves were properly accounted for. Materials Manager Apple Computer June 2003  –  February 2005  (1 year 9 months) Responsible for reporting excess and obsolete inventory metrics to management. Developing forward-looking risk and opportunity analysis to simulate materials exposures and cost of incremental demand. Reviewed and monitored excess inventory by factories. Implemented and directed actions to be taken to mitigate risks. Responsible for driving processes and final deposition of excess supply at various manufacturing sites.  \n \nDeveloped quarterly excess forecasts and analysis which has resulted in over $3 million dollars in savings.  \nImplemented monthly new buy/repair analysis and processes, which resulted in more accurate, spend forecasts.  \nProvided detailed part number analysis to corporate finance to ensure excess reserves were properly accounted for. NPI Program Planner Hewlett-Packard 2000  –  2001  (1 year) NPI Program Planner Hewlett-Packard 2000  –  2001  (1 year) Product Planner Hynix Semiconductor Incorporated January 1998  –  January 2000  (2 years 1 month) Responsible for managing the daily logistics, scheduling, delinquent backlog, and inventory levels at strategic hubs for memory chips. Responsible for analyzing customer demand, developing forecasts and adjusting supply plans to meet changes in customer demand. Responsible for providing delivery quotes, inventory reconciliation, and processing of debit/credit memos. \n \nManaged excess inventory by rebalancing strategic hub inventories and developing disposition plans.  \nManaged vendor selection and all outsourcing activities in support of daily operations.  \nWorked cross functionally with sales and marketing channels to plan and implement objectives to meet financial goals \nMonitored actuals versus forecasts, compiled data and created presentations to management.  \nSuccessfully introduced and managed Hynix's first generation 128MB memory chips. Product Planner Hynix Semiconductor Incorporated January 1998  –  January 2000  (2 years 1 month) Responsible for managing the daily logistics, scheduling, delinquent backlog, and inventory levels at strategic hubs for memory chips. Responsible for analyzing customer demand, developing forecasts and adjusting supply plans to meet changes in customer demand. Responsible for providing delivery quotes, inventory reconciliation, and processing of debit/credit memos. \n \nManaged excess inventory by rebalancing strategic hub inventories and developing disposition plans.  \nManaged vendor selection and all outsourcing activities in support of daily operations.  \nWorked cross functionally with sales and marketing channels to plan and implement objectives to meet financial goals \nMonitored actuals versus forecasts, compiled data and created presentations to management.  \nSuccessfully introduced and managed Hynix's first generation 128MB memory chips. Customer Service Planner Micro Linear Corporation January 1995  –  January 1997  (2 years 1 month) Served as the primary contact person for an assigned customer base. Audited customer purchase orders for accuracy of product, pricing and delivery requirements. Approved and entered purchase orders, RMA's, eval requests, scheduling and shipping information for analog and mixed signal components.  \n \nServed as the focal point for product availability, credit, RMA's, and shipping information.  \nResearched and resolved open backlog issues.  \nMonitored the allocation of products and maintained customer backlogs.  \nProvided weekly reporting of sales, shipping, and backlog information to management.  \nAnalyzed weekly point of sale and created inventory reports for the distribution channel. Customer Service Planner Micro Linear Corporation January 1995  –  January 1997  (2 years 1 month) Served as the primary contact person for an assigned customer base. Audited customer purchase orders for accuracy of product, pricing and delivery requirements. Approved and entered purchase orders, RMA's, eval requests, scheduling and shipping information for analog and mixed signal components.  \n \nServed as the focal point for product availability, credit, RMA's, and shipping information.  \nResearched and resolved open backlog issues.  \nMonitored the allocation of products and maintained customer backlogs.  \nProvided weekly reporting of sales, shipping, and backlog information to management.  \nAnalyzed weekly point of sale and created inventory reports for the distribution channel. Skills Negotiation Cross-functional Team... Market Analysis Contract Negotiation Sales Strategic Planning Marketing Strategy Marketing Forecasting Strategic Partnerships Customer Service Real Estate Professional Sports Pro Sports Real Estate Relocation Pro Athlete Relocation Business Development Leadership Management Strategy Analysis Product Development Selling Investment Properties Process Improvement Social Media Marketing Sports Lead Generation Investments Market Research Entrepreneurship Finance New Business Development Real Estate Transactions Small Business Start-ups Business Planning Budgets Facebook Team Building Sellers Residential Homes Logistics Buyers Online Marketing Networking Social Networking See 32+     See less Skills  Negotiation Cross-functional Team... Market Analysis Contract Negotiation Sales Strategic Planning Marketing Strategy Marketing Forecasting Strategic Partnerships Customer Service Real Estate Professional Sports Pro Sports Real Estate Relocation Pro Athlete Relocation Business Development Leadership Management Strategy Analysis Product Development Selling Investment Properties Process Improvement Social Media Marketing Sports Lead Generation Investments Market Research Entrepreneurship Finance New Business Development Real Estate Transactions Small Business Start-ups Business Planning Budgets Facebook Team Building Sellers Residential Homes Logistics Buyers Online Marketing Networking Social Networking See 32+     See less Negotiation Cross-functional Team... Market Analysis Contract Negotiation Sales Strategic Planning Marketing Strategy Marketing Forecasting Strategic Partnerships Customer Service Real Estate Professional Sports Pro Sports Real Estate Relocation Pro Athlete Relocation Business Development Leadership Management Strategy Analysis Product Development Selling Investment Properties Process Improvement Social Media Marketing Sports Lead Generation Investments Market Research Entrepreneurship Finance New Business Development Real Estate Transactions Small Business Start-ups Business Planning Budgets Facebook Team Building Sellers Residential Homes Logistics Buyers Online Marketing Networking Social Networking See 32+     See less Negotiation Cross-functional Team... Market Analysis Contract Negotiation Sales Strategic Planning Marketing Strategy Marketing Forecasting Strategic Partnerships Customer Service Real Estate Professional Sports Pro Sports Real Estate Relocation Pro Athlete Relocation Business Development Leadership Management Strategy Analysis Product Development Selling Investment Properties Process Improvement Social Media Marketing Sports Lead Generation Investments Market Research Entrepreneurship Finance New Business Development Real Estate Transactions Small Business Start-ups Business Planning Budgets Facebook Team Building Sellers Residential Homes Logistics Buyers Online Marketing Networking Social Networking See 32+     See less Education University of San Francisco Bachelor of Science,  Applied Economics 1997  – 1999 De Anza College Associate of Arts,  Economics 1989  – 1997 University of San Francisco Bachelor of Science,  Applied Economics 1997  – 1999 University of San Francisco Bachelor of Science,  Applied Economics 1997  – 1999 University of San Francisco Bachelor of Science,  Applied Economics 1997  – 1999 De Anza College Associate of Arts,  Economics 1989  – 1997 De Anza College Associate of Arts,  Economics 1989  – 1997 De Anza College Associate of Arts,  Economics 1989  – 1997 "]}