{"position": "CBD Consultant", "company": "IBM", "profiles": ["Summary Andrea Chaves is a consultant in the Strategy and Analytics Practice of IBM Global Business Services. Miss Chaves graduated with highest distinction from the University of North Carolina at Chapel Hill with a BS in Business Administration. Outside of her leadership roles in various student led organizations at Chapel Hill, Andrea worked as a marketing associate at Demographics Pro, a startup Twitter analytics provider specializing in delivering actionable insight to marketing professionals and social media analysts. While at Demographics Pro, Andrea served as the customer service liaison and played an integral role in the planning, execution, and development of subsequent product roll outs. Andrea is open to new experiences to enrich her skill set and further diversify her portfolio. Summary Andrea Chaves is a consultant in the Strategy and Analytics Practice of IBM Global Business Services. Miss Chaves graduated with highest distinction from the University of North Carolina at Chapel Hill with a BS in Business Administration. Outside of her leadership roles in various student led organizations at Chapel Hill, Andrea worked as a marketing associate at Demographics Pro, a startup Twitter analytics provider specializing in delivering actionable insight to marketing professionals and social media analysts. While at Demographics Pro, Andrea served as the customer service liaison and played an integral role in the planning, execution, and development of subsequent product roll outs. Andrea is open to new experiences to enrich her skill set and further diversify her portfolio. Andrea Chaves is a consultant in the Strategy and Analytics Practice of IBM Global Business Services. Miss Chaves graduated with highest distinction from the University of North Carolina at Chapel Hill with a BS in Business Administration. Outside of her leadership roles in various student led organizations at Chapel Hill, Andrea worked as a marketing associate at Demographics Pro, a startup Twitter analytics provider specializing in delivering actionable insight to marketing professionals and social media analysts. While at Demographics Pro, Andrea served as the customer service liaison and played an integral role in the planning, execution, and development of subsequent product roll outs. Andrea is open to new experiences to enrich her skill set and further diversify her portfolio. Andrea Chaves is a consultant in the Strategy and Analytics Practice of IBM Global Business Services. Miss Chaves graduated with highest distinction from the University of North Carolina at Chapel Hill with a BS in Business Administration. Outside of her leadership roles in various student led organizations at Chapel Hill, Andrea worked as a marketing associate at Demographics Pro, a startup Twitter analytics provider specializing in delivering actionable insight to marketing professionals and social media analysts. While at Demographics Pro, Andrea served as the customer service liaison and played an integral role in the planning, execution, and development of subsequent product roll outs. Andrea is open to new experiences to enrich her skill set and further diversify her portfolio. Experience Inbound CBD Consultant IBM July 2015  – Present (2 months) Atlanta, GA Andrea is currently serving as a QA Analyst for various web applications across iOS platforms. Her work includes writing test scripts, executing test scripts, cross-referencing designs with business requirements, identifying defects, and working with the development team to track and resolve defects using Rational. Marketing Associate Demographics Pro April 2013  –  June 2015  (2 years 3 months) Carrboro, NC Marketing Intern Panda Painting May 2012  –  August 2012  (4 months) Atlanta, GA Project/Volunteer Coordinator Colon Cancer Association March 2011  –  August 2011  (6 months) Denver, NC Inbound CBD Consultant IBM July 2015  – Present (2 months) Atlanta, GA Andrea is currently serving as a QA Analyst for various web applications across iOS platforms. Her work includes writing test scripts, executing test scripts, cross-referencing designs with business requirements, identifying defects, and working with the development team to track and resolve defects using Rational. Inbound CBD Consultant IBM July 2015  – Present (2 months) Atlanta, GA Andrea is currently serving as a QA Analyst for various web applications across iOS platforms. Her work includes writing test scripts, executing test scripts, cross-referencing designs with business requirements, identifying defects, and working with the development team to track and resolve defects using Rational. Marketing Associate Demographics Pro April 2013  –  June 2015  (2 years 3 months) Carrboro, NC Marketing Associate Demographics Pro April 2013  –  June 2015  (2 years 3 months) Carrboro, NC Marketing Intern Panda Painting May 2012  –  August 2012  (4 months) Atlanta, GA Marketing Intern Panda Painting May 2012  –  August 2012  (4 months) Atlanta, GA Project/Volunteer Coordinator Colon Cancer Association March 2011  –  August 2011  (6 months) Denver, NC Project/Volunteer Coordinator Colon Cancer Association March 2011  –  August 2011  (6 months) Denver, NC Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Skills     Education The University of North Carolina at Chapel Hill Business Administration 2011  – 2015 Activities and Societies:  Minority Mentor Advising Program ,  Undergraduate Business Symposium Core Committee UNC Kenan-Flagler Business School BS Business Administration 2011  – 2015 Lincolnton High School 2007  – 2011 The University of North Carolina at Chapel Hill Business Administration 2011  – 2015 Activities and Societies:  Minority Mentor Advising Program ,  Undergraduate Business Symposium Core Committee The University of North Carolina at Chapel Hill Business Administration 2011  – 2015 Activities and Societies:  Minority Mentor Advising Program ,  Undergraduate Business Symposium Core Committee The University of North Carolina at Chapel Hill Business Administration 2011  – 2015 Activities and Societies:  Minority Mentor Advising Program ,  Undergraduate Business Symposium Core Committee UNC Kenan-Flagler Business School BS Business Administration 2011  – 2015 UNC Kenan-Flagler Business School BS Business Administration 2011  – 2015 UNC Kenan-Flagler Business School BS Business Administration 2011  – 2015 Lincolnton High School 2007  – 2011 Lincolnton High School 2007  – 2011 Lincolnton High School 2007  – 2011 ", "Summary Currently working for IBM Global Business Services as a Consultant in the Consulting by Degrees program. I have previously graduated from The Pennsylvania State University with a degree in Finance, a concentration in Marketing, and a minor in International Business.  Summary Currently working for IBM Global Business Services as a Consultant in the Consulting by Degrees program. I have previously graduated from The Pennsylvania State University with a degree in Finance, a concentration in Marketing, and a minor in International Business.  Currently working for IBM Global Business Services as a Consultant in the Consulting by Degrees program. I have previously graduated from The Pennsylvania State University with a degree in Finance, a concentration in Marketing, and a minor in International Business.  Currently working for IBM Global Business Services as a Consultant in the Consulting by Degrees program. I have previously graduated from The Pennsylvania State University with a degree in Finance, a concentration in Marketing, and a minor in International Business.  Experience Business Analytics & Strategy CbD Consultant IBM Global Business Services July 2015  – Present (2 months) Greater New York City Area Event Coordinator Intern IMS Marketing May 2014  –  August 2014  (4 months) New York, NY •\tOrganized the preparation and implementation of multiple events promoting foundations such as Samsung’s Hope for Children  \n•\tAdministered press events with media companies with the responsibility of handling celebrities and athletes to ensure the event/ show runs effectively Intern Empire Event Promotions, Inc. May 2013  –  August 2014  (1 year 4 months) Basking Ridge, NJ •\tCoordinated alongside top management to prepare for multiple large scale events of over 800 attendees for the Boomer Esiason Foundation in order to raise money and awareness for Cystic Fibrosis each year \n•\tOperated UnderArmour sales and transactions with customers by managing initial orders, maneuvering the complex database, and ensuring customer satisfaction  \n•\tMonitored and analyzed the Boomer & Carton radio show each morning from 6 AM to 10 AM to provide clients with sales and advertising metrics \n•\tInstalled and managed QuickBooks account for company while recording all funds and transactions processed  \n \n \nGTG Productions, LLC\t \nProject Development  \n•\tAssisted in the production and distribution of the comic series Genie The Gene which educates and entertains children  \n•\tEnsured communication between artists, publishers, and developers was cohesive and focused for events such as San Diego Comic-Con Instructor Rettigs Gymnastics Training Center January 2009  –  August 2011  (2 years 8 months) Business Analytics & Strategy CbD Consultant IBM Global Business Services July 2015  – Present (2 months) Greater New York City Area Business Analytics & Strategy CbD Consultant IBM Global Business Services July 2015  – Present (2 months) Greater New York City Area Event Coordinator Intern IMS Marketing May 2014  –  August 2014  (4 months) New York, NY •\tOrganized the preparation and implementation of multiple events promoting foundations such as Samsung’s Hope for Children  \n•\tAdministered press events with media companies with the responsibility of handling celebrities and athletes to ensure the event/ show runs effectively Event Coordinator Intern IMS Marketing May 2014  –  August 2014  (4 months) New York, NY •\tOrganized the preparation and implementation of multiple events promoting foundations such as Samsung’s Hope for Children  \n•\tAdministered press events with media companies with the responsibility of handling celebrities and athletes to ensure the event/ show runs effectively Intern Empire Event Promotions, Inc. May 2013  –  August 2014  (1 year 4 months) Basking Ridge, NJ •\tCoordinated alongside top management to prepare for multiple large scale events of over 800 attendees for the Boomer Esiason Foundation in order to raise money and awareness for Cystic Fibrosis each year \n•\tOperated UnderArmour sales and transactions with customers by managing initial orders, maneuvering the complex database, and ensuring customer satisfaction  \n•\tMonitored and analyzed the Boomer & Carton radio show each morning from 6 AM to 10 AM to provide clients with sales and advertising metrics \n•\tInstalled and managed QuickBooks account for company while recording all funds and transactions processed  \n \n \nGTG Productions, LLC\t \nProject Development  \n•\tAssisted in the production and distribution of the comic series Genie The Gene which educates and entertains children  \n•\tEnsured communication between artists, publishers, and developers was cohesive and focused for events such as San Diego Comic-Con Intern Empire Event Promotions, Inc. May 2013  –  August 2014  (1 year 4 months) Basking Ridge, NJ •\tCoordinated alongside top management to prepare for multiple large scale events of over 800 attendees for the Boomer Esiason Foundation in order to raise money and awareness for Cystic Fibrosis each year \n•\tOperated UnderArmour sales and transactions with customers by managing initial orders, maneuvering the complex database, and ensuring customer satisfaction  \n•\tMonitored and analyzed the Boomer & Carton radio show each morning from 6 AM to 10 AM to provide clients with sales and advertising metrics \n•\tInstalled and managed QuickBooks account for company while recording all funds and transactions processed  \n \n \nGTG Productions, LLC\t \nProject Development  \n•\tAssisted in the production and distribution of the comic series Genie The Gene which educates and entertains children  \n•\tEnsured communication between artists, publishers, and developers was cohesive and focused for events such as San Diego Comic-Con Instructor Rettigs Gymnastics Training Center January 2009  –  August 2011  (2 years 8 months) Instructor Rettigs Gymnastics Training Center January 2009  –  August 2011  (2 years 8 months) Skills Microsoft Excel PowerPoint Microsoft Office Microsoft Word Teamwork Social Media Customer Service Market Research Marketing Financial Analysis Research Public Speaking Time Management Leadership Skills  Microsoft Excel PowerPoint Microsoft Office Microsoft Word Teamwork Social Media Customer Service Market Research Marketing Financial Analysis Research Public Speaking Time Management Leadership Microsoft Excel PowerPoint Microsoft Office Microsoft Word Teamwork Social Media Customer Service Market Research Marketing Financial Analysis Research Public Speaking Time Management Leadership Microsoft Excel PowerPoint Microsoft Office Microsoft Word Teamwork Social Media Customer Service Market Research Marketing Financial Analysis Research Public Speaking Time Management Leadership Education Penn State University Bachelor's degree,  Finance , General 2011  – 2015 Activities and Societies:  Alpha Kappa Psi professional business fraternity ,  Club Gymnastics ,  THON Parsippany Hills High School 2007  – 2011 Penn State University Bachelor's degree,  Finance , General 2011  – 2015 Activities and Societies:  Alpha Kappa Psi professional business fraternity ,  Club Gymnastics ,  THON Penn State University Bachelor's degree,  Finance , General 2011  – 2015 Activities and Societies:  Alpha Kappa Psi professional business fraternity ,  Club Gymnastics ,  THON Penn State University Bachelor's degree,  Finance , General 2011  – 2015 Activities and Societies:  Alpha Kappa Psi professional business fraternity ,  Club Gymnastics ,  THON Parsippany Hills High School 2007  – 2011 Parsippany Hills High School 2007  – 2011 Parsippany Hills High School 2007  – 2011 Honors & Awards 4th place in 2014 World Father/Daughter Golf Tournament in Kinsale, Ireland Carr Golf July 2014 4th place in 2014 World Father/Daughter Golf Tournament in Kinsale, Ireland Carr Golf July 2014 4th place in 2014 World Father/Daughter Golf Tournament in Kinsale, Ireland Carr Golf July 2014 4th place in 2014 World Father/Daughter Golf Tournament in Kinsale, Ireland Carr Golf July 2014 ", "Summary Hello, and thank you for visiting my profile!  \n \nIn summary, I am a high-energy, animated young professional who is passionate about implementing creativity in both artistic and professional settings. \n \nI have worked in the areas of web design, database development, management, public relations, sales, and consulting as well as fruit sculpting and wedding planning. Through studying BIT and Marketing at Virginia Tech I was able to discern IT consulting as my ideal dovetail of technology and human interaction blended with constantly evolving challenges.  \n \nIf you would like to contact me, please reach out to daniella.damiano@gmail.com \n \nI look forward to connecting with you soon,  \n~Daniella Summary Hello, and thank you for visiting my profile!  \n \nIn summary, I am a high-energy, animated young professional who is passionate about implementing creativity in both artistic and professional settings. \n \nI have worked in the areas of web design, database development, management, public relations, sales, and consulting as well as fruit sculpting and wedding planning. Through studying BIT and Marketing at Virginia Tech I was able to discern IT consulting as my ideal dovetail of technology and human interaction blended with constantly evolving challenges.  \n \nIf you would like to contact me, please reach out to daniella.damiano@gmail.com \n \nI look forward to connecting with you soon,  \n~Daniella Hello, and thank you for visiting my profile!  \n \nIn summary, I am a high-energy, animated young professional who is passionate about implementing creativity in both artistic and professional settings. \n \nI have worked in the areas of web design, database development, management, public relations, sales, and consulting as well as fruit sculpting and wedding planning. Through studying BIT and Marketing at Virginia Tech I was able to discern IT consulting as my ideal dovetail of technology and human interaction blended with constantly evolving challenges.  \n \nIf you would like to contact me, please reach out to daniella.damiano@gmail.com \n \nI look forward to connecting with you soon,  \n~Daniella Hello, and thank you for visiting my profile!  \n \nIn summary, I am a high-energy, animated young professional who is passionate about implementing creativity in both artistic and professional settings. \n \nI have worked in the areas of web design, database development, management, public relations, sales, and consulting as well as fruit sculpting and wedding planning. Through studying BIT and Marketing at Virginia Tech I was able to discern IT consulting as my ideal dovetail of technology and human interaction blended with constantly evolving challenges.  \n \nIf you would like to contact me, please reach out to daniella.damiano@gmail.com \n \nI look forward to connecting with you soon,  \n~Daniella Experience Honors Student in Pamplin College of Business Virginia Tech August 2012  – Present (3 years 1 month) CbD Consultant IBM January 2015  – Present (8 months) Washington D.C. Metro Area Web Development Intern Mvix (USA) May 2014  –  August 2014  (4 months) Business Process Development Intern ATS-Sales LLC May 2013  –  August 2013  (4 months) - Identified, customized, and implemented new software to improve the quotation process, inventory tracking, CRM, and supply chain management \n \n- Wrote VBA-based programs to improve the speed and accuracy of tracking contract progress and customer service responses \n \n- Trained Administrative department on utilizing new systems \n \n- Trained Sales on custom software and maximizing new technology to expedite reporting and streamline client presentations  \n \n- Wrote tutorials on all systems, processes, and software implemented  \n \n- Created a new company website using a WordPress platform Server Clyde's Restaurant Group May 2012  –  August 2012  (4 months) Ashburn Virginia - Learned to be organized and prioritize in a stressful, time-sensitive environment \n \n- Gained understanding of how to effectively work with diverse coworkers and patrons \n \n- Worked smoothly with significant amounts of staff to serve and anticipate the needs of large groups Junior Public Relations Coordinator Dandelion Patch January 2011  –  May 2012  (1 year 5 months) Leesburg Virginia - Closed approximately 3 deals per week averaging $500-$4,500 per deal \n \n- Coordinated sales teams of 3 to 9 employees \n \n- Represented the company at vendor fairs around the DC metro area \n \n- Led meetings to facilitate B2B and B2C relations \n \n- Boosted sales by initiating redesign of product promotions and displays \n \n- Trained employees on effective sales methods and relevant computer programs Technical Summer Intern Atlantic Technical Sales Inc. May 2010  –  September 2010  (5 months) - Developed a data archiving system for contracting jobs, drawings, and projects—reducing employee frustration and wasted time \n \n- Employed Ace and Quickbooks for organizing client information Seasonal, promotional, and display decorator Giant Food January 2007  –  May 2009  (2 years 5 months) This position was truly one of continual evolution. It began with seasonal decorating and displays, to merchandising and promotion. Continually increasing responsibility developed into event planning, community promotions, and cause related marketing. Honors Student in Pamplin College of Business Virginia Tech August 2012  – Present (3 years 1 month) Honors Student in Pamplin College of Business Virginia Tech August 2012  – Present (3 years 1 month) CbD Consultant IBM January 2015  – Present (8 months) Washington D.C. Metro Area CbD Consultant IBM January 2015  – Present (8 months) Washington D.C. Metro Area Web Development Intern Mvix (USA) May 2014  –  August 2014  (4 months) Web Development Intern Mvix (USA) May 2014  –  August 2014  (4 months) Business Process Development Intern ATS-Sales LLC May 2013  –  August 2013  (4 months) - Identified, customized, and implemented new software to improve the quotation process, inventory tracking, CRM, and supply chain management \n \n- Wrote VBA-based programs to improve the speed and accuracy of tracking contract progress and customer service responses \n \n- Trained Administrative department on utilizing new systems \n \n- Trained Sales on custom software and maximizing new technology to expedite reporting and streamline client presentations  \n \n- Wrote tutorials on all systems, processes, and software implemented  \n \n- Created a new company website using a WordPress platform Business Process Development Intern ATS-Sales LLC May 2013  –  August 2013  (4 months) - Identified, customized, and implemented new software to improve the quotation process, inventory tracking, CRM, and supply chain management \n \n- Wrote VBA-based programs to improve the speed and accuracy of tracking contract progress and customer service responses \n \n- Trained Administrative department on utilizing new systems \n \n- Trained Sales on custom software and maximizing new technology to expedite reporting and streamline client presentations  \n \n- Wrote tutorials on all systems, processes, and software implemented  \n \n- Created a new company website using a WordPress platform Server Clyde's Restaurant Group May 2012  –  August 2012  (4 months) Ashburn Virginia - Learned to be organized and prioritize in a stressful, time-sensitive environment \n \n- Gained understanding of how to effectively work with diverse coworkers and patrons \n \n- Worked smoothly with significant amounts of staff to serve and anticipate the needs of large groups Server Clyde's Restaurant Group May 2012  –  August 2012  (4 months) Ashburn Virginia - Learned to be organized and prioritize in a stressful, time-sensitive environment \n \n- Gained understanding of how to effectively work with diverse coworkers and patrons \n \n- Worked smoothly with significant amounts of staff to serve and anticipate the needs of large groups Junior Public Relations Coordinator Dandelion Patch January 2011  –  May 2012  (1 year 5 months) Leesburg Virginia - Closed approximately 3 deals per week averaging $500-$4,500 per deal \n \n- Coordinated sales teams of 3 to 9 employees \n \n- Represented the company at vendor fairs around the DC metro area \n \n- Led meetings to facilitate B2B and B2C relations \n \n- Boosted sales by initiating redesign of product promotions and displays \n \n- Trained employees on effective sales methods and relevant computer programs Junior Public Relations Coordinator Dandelion Patch January 2011  –  May 2012  (1 year 5 months) Leesburg Virginia - Closed approximately 3 deals per week averaging $500-$4,500 per deal \n \n- Coordinated sales teams of 3 to 9 employees \n \n- Represented the company at vendor fairs around the DC metro area \n \n- Led meetings to facilitate B2B and B2C relations \n \n- Boosted sales by initiating redesign of product promotions and displays \n \n- Trained employees on effective sales methods and relevant computer programs Technical Summer Intern Atlantic Technical Sales Inc. May 2010  –  September 2010  (5 months) - Developed a data archiving system for contracting jobs, drawings, and projects—reducing employee frustration and wasted time \n \n- Employed Ace and Quickbooks for organizing client information Technical Summer Intern Atlantic Technical Sales Inc. May 2010  –  September 2010  (5 months) - Developed a data archiving system for contracting jobs, drawings, and projects—reducing employee frustration and wasted time \n \n- Employed Ace and Quickbooks for organizing client information Seasonal, promotional, and display decorator Giant Food January 2007  –  May 2009  (2 years 5 months) This position was truly one of continual evolution. It began with seasonal decorating and displays, to merchandising and promotion. Continually increasing responsibility developed into event planning, community promotions, and cause related marketing. Seasonal, promotional, and display decorator Giant Food January 2007  –  May 2009  (2 years 5 months) This position was truly one of continual evolution. It began with seasonal decorating and displays, to merchandising and promotion. Continually increasing responsibility developed into event planning, community promotions, and cause related marketing. Languages   Skills WordPress Microsoft Excel SmartSheet ACE QuikQuote PowerPoint Microsoft Office Microsoft Word Printing Press Windows Organization Coordination Communication Creative Problem Solving Conflict Resolution Analytic Thinking Multi Tasking Energetic team player Tactfulness OS X Customer Service Time Management Teamwork See 8+     See less Skills  WordPress Microsoft Excel SmartSheet ACE QuikQuote PowerPoint Microsoft Office Microsoft Word Printing Press Windows Organization Coordination Communication Creative Problem Solving Conflict Resolution Analytic Thinking Multi Tasking Energetic team player Tactfulness OS X Customer Service Time Management Teamwork See 8+     See less WordPress Microsoft Excel SmartSheet ACE QuikQuote PowerPoint Microsoft Office Microsoft Word Printing Press Windows Organization Coordination Communication Creative Problem Solving Conflict Resolution Analytic Thinking Multi Tasking Energetic team player Tactfulness OS X Customer Service Time Management Teamwork See 8+     See less WordPress Microsoft Excel SmartSheet ACE QuikQuote PowerPoint Microsoft Office Microsoft Word Printing Press Windows Organization Coordination Communication Creative Problem Solving Conflict Resolution Analytic Thinking Multi Tasking Energetic team player Tactfulness OS X Customer Service Time Management Teamwork See 8+     See less Education Virginia Tech Bachelor's Degree,  Marketing , Programming IT,  Management , Senior 2012  – 2015 Activities and Societies:  PUMP (Pamplin Undergraduate Mentoring Program) ,  PGS (Presidential Global Scholars)\nLCI Conversation Partner (Language and Culture Institute ,  tutoring foreign exchange students) Virginia Polytechnic Institute and State University - Pamplin College of Business Bachelor of Science (BS),  Information Technology 2012  – 2015 Virginia Tech Bachelor's Degree,  Marketing , Programming IT,  Management , Senior 2012  – 2015 Activities and Societies:  PUMP (Pamplin Undergraduate Mentoring Program) ,  PGS (Presidential Global Scholars)\nLCI Conversation Partner (Language and Culture Institute ,  tutoring foreign exchange students) Virginia Tech Bachelor's Degree,  Marketing , Programming IT,  Management , Senior 2012  – 2015 Activities and Societies:  PUMP (Pamplin Undergraduate Mentoring Program) ,  PGS (Presidential Global Scholars)\nLCI Conversation Partner (Language and Culture Institute ,  tutoring foreign exchange students) Virginia Tech Bachelor's Degree,  Marketing , Programming IT,  Management , Senior 2012  – 2015 Activities and Societies:  PUMP (Pamplin Undergraduate Mentoring Program) ,  PGS (Presidential Global Scholars)\nLCI Conversation Partner (Language and Culture Institute ,  tutoring foreign exchange students) Virginia Polytechnic Institute and State University - Pamplin College of Business Bachelor of Science (BS),  Information Technology 2012  – 2015 Virginia Polytechnic Institute and State University - Pamplin College of Business Bachelor of Science (BS),  Information Technology 2012  – 2015 Virginia Polytechnic Institute and State University - Pamplin College of Business Bachelor of Science (BS),  Information Technology 2012  – 2015 Honors & Awards ", "Experience CbD Consultant IBM Italia April 2015  – Present (5 months) Consultant - Stage IBM Italia December 2014  –  March 2015  (4 months) Volunteer Guest University of Milan at the Applied Quantum Mechanics group April 2014  –  September 2014  (6 months) I worked as volunteer guest at the Applied Quantum Mechanics for research activities aimed at article writing. CbD Consultant IBM Italia April 2015  – Present (5 months) CbD Consultant IBM Italia April 2015  – Present (5 months) Consultant - Stage IBM Italia December 2014  –  March 2015  (4 months) Consultant - Stage IBM Italia December 2014  –  March 2015  (4 months) Volunteer Guest University of Milan at the Applied Quantum Mechanics group April 2014  –  September 2014  (6 months) I worked as volunteer guest at the Applied Quantum Mechanics for research activities aimed at article writing. Volunteer Guest University of Milan at the Applied Quantum Mechanics group April 2014  –  September 2014  (6 months) I worked as volunteer guest at the Applied Quantum Mechanics for research activities aimed at article writing. Languages English Professional working proficiency Italiano Native or bilingual proficiency English Professional working proficiency Italiano Native or bilingual proficiency English Professional working proficiency Italiano Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Fisica Physics Quantum Optics Mathematica Mathematics Quantum Computation Quantum Information Programming Wolfram Mathematica C++ Matlab Analisi numerica BPMN 2.0 Science Violin Kung Fu, instructor in... Judo, black belt 2nd dan bicycle (basic repair) See 3+     See less Skills  Fisica Physics Quantum Optics Mathematica Mathematics Quantum Computation Quantum Information Programming Wolfram Mathematica C++ Matlab Analisi numerica BPMN 2.0 Science Violin Kung Fu, instructor in... Judo, black belt 2nd dan bicycle (basic repair) See 3+     See less Fisica Physics Quantum Optics Mathematica Mathematics Quantum Computation Quantum Information Programming Wolfram Mathematica C++ Matlab Analisi numerica BPMN 2.0 Science Violin Kung Fu, instructor in... Judo, black belt 2nd dan bicycle (basic repair) See 3+     See less Fisica Physics Quantum Optics Mathematica Mathematics Quantum Computation Quantum Information Programming Wolfram Mathematica C++ Matlab Analisi numerica BPMN 2.0 Science Violin Kung Fu, instructor in... Judo, black belt 2nd dan bicycle (basic repair) See 3+     See less Education Università degli Studi di Milano Master's degree,  Physics , 102/110 2011  – 2013 Thesis Title: \"Superconducting qubits coupled through a resonator within the quantum Rabi model framework\".  \nIn this thesis I studied analytically and numerically the properties of a system made by one or two superconducting qubits coupled with a bosonic field in a particular coupling regime called \"deep strong coupling\". In this regime the Jaynes-Cummings model is not longer valid and the full quantum Rabi model must be considered. \nIn particular I focused on the generation of entanglement between the two qubits with a numerical analysis for different qubits frequencies regimes. Università degli Studi di Milano Bachelor's degree,  Physics , 94/110 2006  – 2011 Thesis Title: \"Studio delle caratteristiche di impulsi laser generati da cristalli \"periodically polled\"\". \nIn this thesis I studied computationally the characteristics of a laser pulse generated and amplified by paremetic down conversion from a laser pump that pass throughout a non-linear and periodically polled crystall. Università degli Studi di Milano Master's degree,  Physics , 102/110 2011  – 2013 Thesis Title: \"Superconducting qubits coupled through a resonator within the quantum Rabi model framework\".  \nIn this thesis I studied analytically and numerically the properties of a system made by one or two superconducting qubits coupled with a bosonic field in a particular coupling regime called \"deep strong coupling\". In this regime the Jaynes-Cummings model is not longer valid and the full quantum Rabi model must be considered. \nIn particular I focused on the generation of entanglement between the two qubits with a numerical analysis for different qubits frequencies regimes. Università degli Studi di Milano Master's degree,  Physics , 102/110 2011  – 2013 Thesis Title: \"Superconducting qubits coupled through a resonator within the quantum Rabi model framework\".  \nIn this thesis I studied analytically and numerically the properties of a system made by one or two superconducting qubits coupled with a bosonic field in a particular coupling regime called \"deep strong coupling\". In this regime the Jaynes-Cummings model is not longer valid and the full quantum Rabi model must be considered. \nIn particular I focused on the generation of entanglement between the two qubits with a numerical analysis for different qubits frequencies regimes. Università degli Studi di Milano Master's degree,  Physics , 102/110 2011  – 2013 Thesis Title: \"Superconducting qubits coupled through a resonator within the quantum Rabi model framework\".  \nIn this thesis I studied analytically and numerically the properties of a system made by one or two superconducting qubits coupled with a bosonic field in a particular coupling regime called \"deep strong coupling\". In this regime the Jaynes-Cummings model is not longer valid and the full quantum Rabi model must be considered. \nIn particular I focused on the generation of entanglement between the two qubits with a numerical analysis for different qubits frequencies regimes. Università degli Studi di Milano Bachelor's degree,  Physics , 94/110 2006  – 2011 Thesis Title: \"Studio delle caratteristiche di impulsi laser generati da cristalli \"periodically polled\"\". \nIn this thesis I studied computationally the characteristics of a laser pulse generated and amplified by paremetic down conversion from a laser pump that pass throughout a non-linear and periodically polled crystall. Università degli Studi di Milano Bachelor's degree,  Physics , 94/110 2006  – 2011 Thesis Title: \"Studio delle caratteristiche di impulsi laser generati da cristalli \"periodically polled\"\". \nIn this thesis I studied computationally the characteristics of a laser pulse generated and amplified by paremetic down conversion from a laser pump that pass throughout a non-linear and periodically polled crystall. Università degli Studi di Milano Bachelor's degree,  Physics , 94/110 2006  – 2011 Thesis Title: \"Studio delle caratteristiche di impulsi laser generati da cristalli \"periodically polled\"\". \nIn this thesis I studied computationally the characteristics of a laser pulse generated and amplified by paremetic down conversion from a laser pump that pass throughout a non-linear and periodically polled crystall. ", "Summary Recent graduate from Lehigh University with a dual degree in Computer Science and Business.  Summary Recent graduate from Lehigh University with a dual degree in Computer Science and Business.  Recent graduate from Lehigh University with a dual degree in Computer Science and Business.  Recent graduate from Lehigh University with a dual degree in Computer Science and Business.  Experience Project Team Leader PPL Corporation January 2014  –  December 2014  (1 year) Allentown, Pennsylvania Area Analyzed and developed a new storm prediction algorithm application for PPL Corporation. Worked with Python pandas data analysis package for statistical storm research. Developed a standalone application written in Java as a deliverable for PPL.  GBS Consultant Intern IBM May 2014  –  August 2014  (4 months) Greater New York City Area Worked on a SAP implementation project for a multi-billion dollar animal health company. Managed and tracked a large scale project plan in MS Project. In addition, traveled to Brussels, Belgium to shadow top-level executives and to assist in the project's Go Live preparation.  IT Risk & Assurance Intern EY May 2013  –  June 2013  (2 months) Prague, Czech Republic Worked with the IT Risk & Assurance team in performing a variety of tasks that included database management, SQL, SAP software and Microsoft Excel. Inventory Clerk Freight Finder May 2012  –  May 2013  (1 year 1 month) Cleveland/Akron, Ohio Area Performed regular audits on incoming/outgoing inventory and worked extensively with Microsoft Excel in recording inventory lists. Also created product listings on company website. Website Design SentroTech May 2011  –  May 2013  (2 years 1 month) Strongsville, OH Web graphic design work. Also worked with Adobe Photoshop software to edit/design product pictures. Administrative Assistant SentroTech May 2011  –  August 2011  (4 months) Strongsville, OH Managed customer invoices, issued quotations, updated customer database, and responded to customer queries via telephone/e-mail. Project Team Leader PPL Corporation January 2014  –  December 2014  (1 year) Allentown, Pennsylvania Area Analyzed and developed a new storm prediction algorithm application for PPL Corporation. Worked with Python pandas data analysis package for statistical storm research. Developed a standalone application written in Java as a deliverable for PPL.  Project Team Leader PPL Corporation January 2014  –  December 2014  (1 year) Allentown, Pennsylvania Area Analyzed and developed a new storm prediction algorithm application for PPL Corporation. Worked with Python pandas data analysis package for statistical storm research. Developed a standalone application written in Java as a deliverable for PPL.  GBS Consultant Intern IBM May 2014  –  August 2014  (4 months) Greater New York City Area Worked on a SAP implementation project for a multi-billion dollar animal health company. Managed and tracked a large scale project plan in MS Project. In addition, traveled to Brussels, Belgium to shadow top-level executives and to assist in the project's Go Live preparation.  GBS Consultant Intern IBM May 2014  –  August 2014  (4 months) Greater New York City Area Worked on a SAP implementation project for a multi-billion dollar animal health company. Managed and tracked a large scale project plan in MS Project. In addition, traveled to Brussels, Belgium to shadow top-level executives and to assist in the project's Go Live preparation.  IT Risk & Assurance Intern EY May 2013  –  June 2013  (2 months) Prague, Czech Republic Worked with the IT Risk & Assurance team in performing a variety of tasks that included database management, SQL, SAP software and Microsoft Excel. IT Risk & Assurance Intern EY May 2013  –  June 2013  (2 months) Prague, Czech Republic Worked with the IT Risk & Assurance team in performing a variety of tasks that included database management, SQL, SAP software and Microsoft Excel. Inventory Clerk Freight Finder May 2012  –  May 2013  (1 year 1 month) Cleveland/Akron, Ohio Area Performed regular audits on incoming/outgoing inventory and worked extensively with Microsoft Excel in recording inventory lists. Also created product listings on company website. Inventory Clerk Freight Finder May 2012  –  May 2013  (1 year 1 month) Cleveland/Akron, Ohio Area Performed regular audits on incoming/outgoing inventory and worked extensively with Microsoft Excel in recording inventory lists. Also created product listings on company website. Website Design SentroTech May 2011  –  May 2013  (2 years 1 month) Strongsville, OH Web graphic design work. Also worked with Adobe Photoshop software to edit/design product pictures. Website Design SentroTech May 2011  –  May 2013  (2 years 1 month) Strongsville, OH Web graphic design work. Also worked with Adobe Photoshop software to edit/design product pictures. Administrative Assistant SentroTech May 2011  –  August 2011  (4 months) Strongsville, OH Managed customer invoices, issued quotations, updated customer database, and responded to customer queries via telephone/e-mail. Administrative Assistant SentroTech May 2011  –  August 2011  (4 months) Strongsville, OH Managed customer invoices, issued quotations, updated customer database, and responded to customer queries via telephone/e-mail. Languages English Native or bilingual proficiency Chinese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills C++ Java SQL JavaScript Assembly Language SAP HTML Microsoft Excel Microsoft Word PowerPoint Web Design Photoshop Social Media Analysis Skills  C++ Java SQL JavaScript Assembly Language SAP HTML Microsoft Excel Microsoft Word PowerPoint Web Design Photoshop Social Media Analysis C++ Java SQL JavaScript Assembly Language SAP HTML Microsoft Excel Microsoft Word PowerPoint Web Design Photoshop Social Media Analysis C++ Java SQL JavaScript Assembly Language SAP HTML Microsoft Excel Microsoft Word PowerPoint Web Design Photoshop Social Media Analysis Education Lehigh University Computer Science and Business 2011  – 2015 Strongsville High School 2007  – 2011 Activities and Societies:  National Honors Society ,  Mu Alpha Theta ,  Spanish Honors Society ,  Captain of SHS Girls Tennis Team Lehigh University Computer Science and Business 2011  – 2015 Lehigh University Computer Science and Business 2011  – 2015 Lehigh University Computer Science and Business 2011  – 2015 Strongsville High School 2007  – 2011 Activities and Societies:  National Honors Society ,  Mu Alpha Theta ,  Spanish Honors Society ,  Captain of SHS Girls Tennis Team Strongsville High School 2007  – 2011 Activities and Societies:  National Honors Society ,  Mu Alpha Theta ,  Spanish Honors Society ,  Captain of SHS Girls Tennis Team Strongsville High School 2007  – 2011 Activities and Societies:  National Honors Society ,  Mu Alpha Theta ,  Spanish Honors Society ,  Captain of SHS Girls Tennis Team Honors & Awards ", "Summary Consulting By Degrees Consultant at IBM that has experience with programming in VB.Net, Java, and C#; Database design with Access, E-R diagramming, SharePoint, SQL server, and Oracle; Microsoft Office Suite with Excel, Word, Visio, Project, and Powerpoint; Operating Systems and Server Administration functions using Linux and Windows; Creating and Designing WordPress sites; Business Process Modeling using UML activity diagram; Enterprise Architecture using functional modeling, physical architecture design, security planning and recovery issues, and project management; System Analysis and Design methodologies; Security and Risk Assessment of business network infrastructure; Network diagramming Low-Level/High-Level using Visio; and Telecommunications using Wireshark. Summary Consulting By Degrees Consultant at IBM that has experience with programming in VB.Net, Java, and C#; Database design with Access, E-R diagramming, SharePoint, SQL server, and Oracle; Microsoft Office Suite with Excel, Word, Visio, Project, and Powerpoint; Operating Systems and Server Administration functions using Linux and Windows; Creating and Designing WordPress sites; Business Process Modeling using UML activity diagram; Enterprise Architecture using functional modeling, physical architecture design, security planning and recovery issues, and project management; System Analysis and Design methodologies; Security and Risk Assessment of business network infrastructure; Network diagramming Low-Level/High-Level using Visio; and Telecommunications using Wireshark. Consulting By Degrees Consultant at IBM that has experience with programming in VB.Net, Java, and C#; Database design with Access, E-R diagramming, SharePoint, SQL server, and Oracle; Microsoft Office Suite with Excel, Word, Visio, Project, and Powerpoint; Operating Systems and Server Administration functions using Linux and Windows; Creating and Designing WordPress sites; Business Process Modeling using UML activity diagram; Enterprise Architecture using functional modeling, physical architecture design, security planning and recovery issues, and project management; System Analysis and Design methodologies; Security and Risk Assessment of business network infrastructure; Network diagramming Low-Level/High-Level using Visio; and Telecommunications using Wireshark. Consulting By Degrees Consultant at IBM that has experience with programming in VB.Net, Java, and C#; Database design with Access, E-R diagramming, SharePoint, SQL server, and Oracle; Microsoft Office Suite with Excel, Word, Visio, Project, and Powerpoint; Operating Systems and Server Administration functions using Linux and Windows; Creating and Designing WordPress sites; Business Process Modeling using UML activity diagram; Enterprise Architecture using functional modeling, physical architecture design, security planning and recovery issues, and project management; System Analysis and Design methodologies; Security and Risk Assessment of business network infrastructure; Network diagramming Low-Level/High-Level using Visio; and Telecommunications using Wireshark. Experience CBD Consultant IBM August 2015  – Present (1 month) MIS Intern James River Financial Corp. June 2014  –  August 2014  (3 months) Researched, proposed, and implemented BMC Track-It!, an IT project management software, to improve help desk and asset management operations. \nRotated backup tapes and checked backup logs for errors to find business critical errors that would interfere with daily operations. \nAssisted in the cleanup/rewiring of server room to increase server room capacity  \nResearched and proposed software for compiling all Event View logs to find errors quickly and reduce time spent searching server logs. \n Greenhouse Worker Stranges’ Greenhouse May 2010  –  August 2013  (3 years 4 months) Supervised inventory and all equipment to ensure that the customer was receiving a quality product and preventing costly maintenance of machinery.  \nTrained, mentored, and supervised new employees. Trained eight employees while working at Stranges’ and assisted in supervising seasonal help. \nManaged my own portion of the greenhouse for which I was responsible for maintaining the quality of the products, pulling orders, and cleanliness of my work space. \n CBD Consultant IBM August 2015  – Present (1 month) CBD Consultant IBM August 2015  – Present (1 month) MIS Intern James River Financial Corp. June 2014  –  August 2014  (3 months) Researched, proposed, and implemented BMC Track-It!, an IT project management software, to improve help desk and asset management operations. \nRotated backup tapes and checked backup logs for errors to find business critical errors that would interfere with daily operations. \nAssisted in the cleanup/rewiring of server room to increase server room capacity  \nResearched and proposed software for compiling all Event View logs to find errors quickly and reduce time spent searching server logs. \n MIS Intern James River Financial Corp. June 2014  –  August 2014  (3 months) Researched, proposed, and implemented BMC Track-It!, an IT project management software, to improve help desk and asset management operations. \nRotated backup tapes and checked backup logs for errors to find business critical errors that would interfere with daily operations. \nAssisted in the cleanup/rewiring of server room to increase server room capacity  \nResearched and proposed software for compiling all Event View logs to find errors quickly and reduce time spent searching server logs. \n Greenhouse Worker Stranges’ Greenhouse May 2010  –  August 2013  (3 years 4 months) Supervised inventory and all equipment to ensure that the customer was receiving a quality product and preventing costly maintenance of machinery.  \nTrained, mentored, and supervised new employees. Trained eight employees while working at Stranges’ and assisted in supervising seasonal help. \nManaged my own portion of the greenhouse for which I was responsible for maintaining the quality of the products, pulling orders, and cleanliness of my work space. \n Greenhouse Worker Stranges’ Greenhouse May 2010  –  August 2013  (3 years 4 months) Supervised inventory and all equipment to ensure that the customer was receiving a quality product and preventing costly maintenance of machinery.  \nTrained, mentored, and supervised new employees. Trained eight employees while working at Stranges’ and assisted in supervising seasonal help. \nManaged my own portion of the greenhouse for which I was responsible for maintaining the quality of the products, pulling orders, and cleanliness of my work space. \n Languages   Skills PowerPoint Microsoft Excel Microsoft Word Teamwork Public Speaking Access Customer Service Visual Basic Research Time Management Facebook SharePoint Skills  PowerPoint Microsoft Excel Microsoft Word Teamwork Public Speaking Access Customer Service Visual Basic Research Time Management Facebook SharePoint PowerPoint Microsoft Excel Microsoft Word Teamwork Public Speaking Access Customer Service Visual Basic Research Time Management Facebook SharePoint PowerPoint Microsoft Excel Microsoft Word Teamwork Public Speaking Access Customer Service Visual Basic Research Time Management Facebook SharePoint Education James Madison University BBA,  Computer Information Systems 2011  – 2015 Activities and Societies:  Sigma Phi Epsilon National Fraternity ,  Sigma Alpha Lambda Leadership and Honors Society ,  AITP James Madison University BBA,  Computer Information Systems 2011  – 2015 Activities and Societies:  Sigma Phi Epsilon National Fraternity ,  Sigma Alpha Lambda Leadership and Honors Society ,  AITP James Madison University BBA,  Computer Information Systems 2011  – 2015 Activities and Societies:  Sigma Phi Epsilon National Fraternity ,  Sigma Alpha Lambda Leadership and Honors Society ,  AITP James Madison University BBA,  Computer Information Systems 2011  – 2015 Activities and Societies:  Sigma Phi Epsilon National Fraternity ,  Sigma Alpha Lambda Leadership and Honors Society ,  AITP Honors & Awards Dean's List James Madison University May 2012 President's List James Madison University May 2014 Dean's List James Madison University December 2014 Dean's List James Madison University May 2015 CIS IT Consulting Team 1st Place James Madison University May 2015 Consulting team won 1st place out of 12 in consulting proposal competition. Dean's List James Madison University May 2012 Dean's List James Madison University May 2012 Dean's List James Madison University May 2012 President's List James Madison University May 2014 President's List James Madison University May 2014 President's List James Madison University May 2014 Dean's List James Madison University December 2014 Dean's List James Madison University December 2014 Dean's List James Madison University December 2014 Dean's List James Madison University May 2015 Dean's List James Madison University May 2015 Dean's List James Madison University May 2015 CIS IT Consulting Team 1st Place James Madison University May 2015 Consulting team won 1st place out of 12 in consulting proposal competition. CIS IT Consulting Team 1st Place James Madison University May 2015 Consulting team won 1st place out of 12 in consulting proposal competition. CIS IT Consulting Team 1st Place James Madison University May 2015 Consulting team won 1st place out of 12 in consulting proposal competition. ", "Experience Consultant IBM June 2015  – Present (3 months) New York, NY Interning as a CbD Consultant for IBM Global Business Services Financial Analyst Intern American Natural Gas Solutions June 2014  –  August 2014  (3 months) • Developed financial model analyzing impact of natural gas price on company’s revenues, costs, profitability, and \ncash flows based on commodity price fluctuations \n• Contributed to detailed financial model for U.S. Department of Energy grant proposal laying the groundwork for a $250MM infrastructure build-out to service $100MM in long-term annual contracts \n• Drafted initial executive summary of grant proposal, presented to executives, and edited based upon feedback Financial Operations Intern IDT Telecomm June 2013  –  August 2013  (3 months) • Worked on project management team of Boss Revolution, an international money transfer service, contributing to \nnational rollout in 19 US states and global expansion to Africa, Asia, and South America \n• Analyzed raw transaction data of 300 retail money transfer stores and developed Excel model to identify underperforming stores and regions \n• Provided feedback to regional account managers on how to improve effectiveness of nonperforming stores by \naddressing store-specific issues and implementing alternative strategies Intern DeFeo Associates June 2013  –  August 2013  (3 months) • Apprenticed under expert business consultant in the fields of environmental sustainability, energy conservation, \nrecycling, and solid waste management, as well as a LEED accredited professional \n• Researched and published white paper on the viability and sustainability of mixed recycling facilities by analyzing payback periods, equipment costs, and technological innovations of similar projects \n• Attended client consultations and presented analysis of company’s practices compared to industry standards Consultant IBM June 2015  – Present (3 months) New York, NY Interning as a CbD Consultant for IBM Global Business Services Consultant IBM June 2015  – Present (3 months) New York, NY Interning as a CbD Consultant for IBM Global Business Services Financial Analyst Intern American Natural Gas Solutions June 2014  –  August 2014  (3 months) • Developed financial model analyzing impact of natural gas price on company’s revenues, costs, profitability, and \ncash flows based on commodity price fluctuations \n• Contributed to detailed financial model for U.S. Department of Energy grant proposal laying the groundwork for a $250MM infrastructure build-out to service $100MM in long-term annual contracts \n• Drafted initial executive summary of grant proposal, presented to executives, and edited based upon feedback Financial Analyst Intern American Natural Gas Solutions June 2014  –  August 2014  (3 months) • Developed financial model analyzing impact of natural gas price on company’s revenues, costs, profitability, and \ncash flows based on commodity price fluctuations \n• Contributed to detailed financial model for U.S. Department of Energy grant proposal laying the groundwork for a $250MM infrastructure build-out to service $100MM in long-term annual contracts \n• Drafted initial executive summary of grant proposal, presented to executives, and edited based upon feedback Financial Operations Intern IDT Telecomm June 2013  –  August 2013  (3 months) • Worked on project management team of Boss Revolution, an international money transfer service, contributing to \nnational rollout in 19 US states and global expansion to Africa, Asia, and South America \n• Analyzed raw transaction data of 300 retail money transfer stores and developed Excel model to identify underperforming stores and regions \n• Provided feedback to regional account managers on how to improve effectiveness of nonperforming stores by \naddressing store-specific issues and implementing alternative strategies Financial Operations Intern IDT Telecomm June 2013  –  August 2013  (3 months) • Worked on project management team of Boss Revolution, an international money transfer service, contributing to \nnational rollout in 19 US states and global expansion to Africa, Asia, and South America \n• Analyzed raw transaction data of 300 retail money transfer stores and developed Excel model to identify underperforming stores and regions \n• Provided feedback to regional account managers on how to improve effectiveness of nonperforming stores by \naddressing store-specific issues and implementing alternative strategies Intern DeFeo Associates June 2013  –  August 2013  (3 months) • Apprenticed under expert business consultant in the fields of environmental sustainability, energy conservation, \nrecycling, and solid waste management, as well as a LEED accredited professional \n• Researched and published white paper on the viability and sustainability of mixed recycling facilities by analyzing payback periods, equipment costs, and technological innovations of similar projects \n• Attended client consultations and presented analysis of company’s practices compared to industry standards Intern DeFeo Associates June 2013  –  August 2013  (3 months) • Apprenticed under expert business consultant in the fields of environmental sustainability, energy conservation, \nrecycling, and solid waste management, as well as a LEED accredited professional \n• Researched and published white paper on the viability and sustainability of mixed recycling facilities by analyzing payback periods, equipment costs, and technological innovations of similar projects \n• Attended client consultations and presented analysis of company’s practices compared to industry standards Skills Microsoft Office Public Speaking Microsoft Word Skills  Microsoft Office Public Speaking Microsoft Word Microsoft Office Public Speaking Microsoft Word Microsoft Office Public Speaking Microsoft Word Education New York University, Stern School of Business Bachelor of Science,  Business; Finance ,  Environmental Science 2012  – 2016 New York University - Leonard N. Stern School of Business Finance and Environmental Studies 2011  – 2016 New York University New York University, Stern School of Business Bachelor of Science,  Business; Finance ,  Environmental Science 2012  – 2016 New York University, Stern School of Business Bachelor of Science,  Business; Finance ,  Environmental Science 2012  – 2016 New York University, Stern School of Business Bachelor of Science,  Business; Finance ,  Environmental Science 2012  – 2016 New York University - Leonard N. Stern School of Business Finance and Environmental Studies 2011  – 2016 New York University - Leonard N. Stern School of Business Finance and Environmental Studies 2011  – 2016 New York University - Leonard N. Stern School of Business Finance and Environmental Studies 2011  – 2016 New York University New York University New York University ", "Experience CbD Consultant IBM Summer Intern, Investment Banking Market's Tech JPMorgan Chase June 2012  –  August 2012  (3 months) User control of rule-based algo trading Opportunity Research Scholar Georgia Institute of Technology August 2010  –  May 2012  (1 year 10 months) Atlanta, Georgia Investigated residential electricity consumption and developed optimized control systems Computer Science Teaching Assistant Georgia Institute of Technology August 2010  –  May 2012  (1 year 10 months) Atlanta, Georgia Assisted in teaching \"Introduction to C Programming\" (CS1372) to CompE and EE undergrads by holding recitations, tutoring, and test/homework grading. CbD Consultant IBM CbD Consultant IBM Summer Intern, Investment Banking Market's Tech JPMorgan Chase June 2012  –  August 2012  (3 months) User control of rule-based algo trading Summer Intern, Investment Banking Market's Tech JPMorgan Chase June 2012  –  August 2012  (3 months) User control of rule-based algo trading Opportunity Research Scholar Georgia Institute of Technology August 2010  –  May 2012  (1 year 10 months) Atlanta, Georgia Investigated residential electricity consumption and developed optimized control systems Opportunity Research Scholar Georgia Institute of Technology August 2010  –  May 2012  (1 year 10 months) Atlanta, Georgia Investigated residential electricity consumption and developed optimized control systems Computer Science Teaching Assistant Georgia Institute of Technology August 2010  –  May 2012  (1 year 10 months) Atlanta, Georgia Assisted in teaching \"Introduction to C Programming\" (CS1372) to CompE and EE undergrads by holding recitations, tutoring, and test/homework grading. Computer Science Teaching Assistant Georgia Institute of Technology August 2010  –  May 2012  (1 year 10 months) Atlanta, Georgia Assisted in teaching \"Introduction to C Programming\" (CS1372) to CompE and EE undergrads by holding recitations, tutoring, and test/homework grading. Skills C C++ Microsoft Office Windows Computer Hardware Microsoft Excel Matlab Java Customer Service Microsoft Word PowerPoint HTML Linux Verilog VHDL Skills  C C++ Microsoft Office Windows Computer Hardware Microsoft Excel Matlab Java Customer Service Microsoft Word PowerPoint HTML Linux Verilog VHDL C C++ Microsoft Office Windows Computer Hardware Microsoft Excel Matlab Java Customer Service Microsoft Word PowerPoint HTML Linux Verilog VHDL C C++ Microsoft Office Windows Computer Hardware Microsoft Excel Matlab Java Customer Service Microsoft Word PowerPoint HTML Linux Verilog VHDL Education Georgia Institute of Technology Bachelor of Science (BS),  Computer Engineering 2009  – 2013 Georgia Institute of Technology Bachelor of Science (BS),  Computer Engineering 2009  – 2013 Georgia Institute of Technology Bachelor of Science (BS),  Computer Engineering 2009  – 2013 Georgia Institute of Technology Bachelor of Science (BS),  Computer Engineering 2009  – 2013 Honors & Awards Graduate BS with Highest Honors Georgia Institute of Technology December 2012 First Place Research Poster Opportunity Research Scholarship Program May 2011 Faculty Honors at Georgia Tech Georgia Institute of Technology 2009 Graduate BS with Highest Honors Georgia Institute of Technology December 2012 Graduate BS with Highest Honors Georgia Institute of Technology December 2012 Graduate BS with Highest Honors Georgia Institute of Technology December 2012 First Place Research Poster Opportunity Research Scholarship Program May 2011 First Place Research Poster Opportunity Research Scholarship Program May 2011 First Place Research Poster Opportunity Research Scholarship Program May 2011 Faculty Honors at Georgia Tech Georgia Institute of Technology 2009 Faculty Honors at Georgia Tech Georgia Institute of Technology 2009 Faculty Honors at Georgia Tech Georgia Institute of Technology 2009 ", "Summary I am currently working at IBM in the Interactive Experience & Mobile service line as a Consultant after graduating from Cardiff University with a First Class Honours BSc Computer Science degree. I have previously worked in the Tax practice at Deloitte and in IBM Global Business Services whilst completing my university studies.  \n Summary I am currently working at IBM in the Interactive Experience & Mobile service line as a Consultant after graduating from Cardiff University with a First Class Honours BSc Computer Science degree. I have previously worked in the Tax practice at Deloitte and in IBM Global Business Services whilst completing my university studies.  \n I am currently working at IBM in the Interactive Experience & Mobile service line as a Consultant after graduating from Cardiff University with a First Class Honours BSc Computer Science degree. I have previously worked in the Tax practice at Deloitte and in IBM Global Business Services whilst completing my university studies.  \n I am currently working at IBM in the Interactive Experience & Mobile service line as a Consultant after graduating from Cardiff University with a First Class Honours BSc Computer Science degree. I have previously worked in the Tax practice at Deloitte and in IBM Global Business Services whilst completing my university studies.  \n Experience Interactive Experience & Mobile Consultant IBM July 2015  – Present (2 months) London, United Kingdom Consultant in the IBM iX&M service line based in London. Web Developer Freelance September 2012  –  July 2015  (2 years 11 months) Improved knowledge of HTML, CSS and PHP by working on website maintenance on a range of websites; including www.cheshirehalfmarathon.co.uk and www.mytriathlon.co.uk. \nRequirements include implementing new features or changing the design of these sites. Associate - Tax Deloitte UK August 2014  –  August 2014  (1 month) Reading, United Kingdom Working within the Tax practice in the Reading office, I assisted and contributed to: \n- Tax Computations \n- Transfer Pricing reports \n- Business development research \n- Financial modelling for Transfer Pricing and M&A reports CbD Consultant IBM July 2013  –  July 2014  (1 year 1 month) Hursley/Southbank I am currently working within the Consulting by Degrees (CbD) graduate scheme management structure for Global Business Services within IBM. \n \nI was previously involved with assisting with new joiners to the CbD scheme, helping out with our 5 week training induction course, where I have led the training on Java as well as assisting with other training modules including Unix and SQL. \n \nI later worked as the Technical Lead of the IBM Campus Tour, assisting the organisation and management of this highly innovative university attraction campaign. We visited the top 25 universities in the UK, demonstrating innovative technology in order to attract the brightest undergraduate students. \n \nFinally, I worked as a member of the Project Management Office on a multi-million pound account for a mobile payments provider working in emerging markets. Hospitality Assistant Compass Group August 2011  –  October 2012  (1 year 3 months) Reading, Cardiff Developed excellent time management skills whilst working at busy venues such as the Millennium Stadium, Cardiff City Stadium and the Madejski Stadium. \nLiaising with customers, front of house and kitchen staff, helped to improve communicational skills, providing good customer service. Warehouse and Administration Assistant Blade Printing Services July 2012  –  September 2012  (3 months) Reading, United Kingdom Created an HTML email to be used for company newsletters. Used knowledge of HTML and CorelDraw, inline style elements were used in the design of the email. Waiting Staff Glamorgan CCC March 2012  –  September 2012  (7 months) Cardiff, United Kingdom Providing a catering service for over 500 people required a large team, emphasising the importance of team work. Administration Assistant Westgate Residential Lettings June 2010  –  September 2010  (4 months) Working as an individual, updating and posting housing vacancies on the company website \nAssisting colleagues with customers’ needs with regards to property lettings, helped develop professional communication skills. Interactive Experience & Mobile Consultant IBM July 2015  – Present (2 months) London, United Kingdom Consultant in the IBM iX&M service line based in London. Interactive Experience & Mobile Consultant IBM July 2015  – Present (2 months) London, United Kingdom Consultant in the IBM iX&M service line based in London. Web Developer Freelance September 2012  –  July 2015  (2 years 11 months) Improved knowledge of HTML, CSS and PHP by working on website maintenance on a range of websites; including www.cheshirehalfmarathon.co.uk and www.mytriathlon.co.uk. \nRequirements include implementing new features or changing the design of these sites. Web Developer Freelance September 2012  –  July 2015  (2 years 11 months) Improved knowledge of HTML, CSS and PHP by working on website maintenance on a range of websites; including www.cheshirehalfmarathon.co.uk and www.mytriathlon.co.uk. \nRequirements include implementing new features or changing the design of these sites. Associate - Tax Deloitte UK August 2014  –  August 2014  (1 month) Reading, United Kingdom Working within the Tax practice in the Reading office, I assisted and contributed to: \n- Tax Computations \n- Transfer Pricing reports \n- Business development research \n- Financial modelling for Transfer Pricing and M&A reports Associate - Tax Deloitte UK August 2014  –  August 2014  (1 month) Reading, United Kingdom Working within the Tax practice in the Reading office, I assisted and contributed to: \n- Tax Computations \n- Transfer Pricing reports \n- Business development research \n- Financial modelling for Transfer Pricing and M&A reports CbD Consultant IBM July 2013  –  July 2014  (1 year 1 month) Hursley/Southbank I am currently working within the Consulting by Degrees (CbD) graduate scheme management structure for Global Business Services within IBM. \n \nI was previously involved with assisting with new joiners to the CbD scheme, helping out with our 5 week training induction course, where I have led the training on Java as well as assisting with other training modules including Unix and SQL. \n \nI later worked as the Technical Lead of the IBM Campus Tour, assisting the organisation and management of this highly innovative university attraction campaign. We visited the top 25 universities in the UK, demonstrating innovative technology in order to attract the brightest undergraduate students. \n \nFinally, I worked as a member of the Project Management Office on a multi-million pound account for a mobile payments provider working in emerging markets. CbD Consultant IBM July 2013  –  July 2014  (1 year 1 month) Hursley/Southbank I am currently working within the Consulting by Degrees (CbD) graduate scheme management structure for Global Business Services within IBM. \n \nI was previously involved with assisting with new joiners to the CbD scheme, helping out with our 5 week training induction course, where I have led the training on Java as well as assisting with other training modules including Unix and SQL. \n \nI later worked as the Technical Lead of the IBM Campus Tour, assisting the organisation and management of this highly innovative university attraction campaign. We visited the top 25 universities in the UK, demonstrating innovative technology in order to attract the brightest undergraduate students. \n \nFinally, I worked as a member of the Project Management Office on a multi-million pound account for a mobile payments provider working in emerging markets. Hospitality Assistant Compass Group August 2011  –  October 2012  (1 year 3 months) Reading, Cardiff Developed excellent time management skills whilst working at busy venues such as the Millennium Stadium, Cardiff City Stadium and the Madejski Stadium. \nLiaising with customers, front of house and kitchen staff, helped to improve communicational skills, providing good customer service. Hospitality Assistant Compass Group August 2011  –  October 2012  (1 year 3 months) Reading, Cardiff Developed excellent time management skills whilst working at busy venues such as the Millennium Stadium, Cardiff City Stadium and the Madejski Stadium. \nLiaising with customers, front of house and kitchen staff, helped to improve communicational skills, providing good customer service. Warehouse and Administration Assistant Blade Printing Services July 2012  –  September 2012  (3 months) Reading, United Kingdom Created an HTML email to be used for company newsletters. Used knowledge of HTML and CorelDraw, inline style elements were used in the design of the email. Warehouse and Administration Assistant Blade Printing Services July 2012  –  September 2012  (3 months) Reading, United Kingdom Created an HTML email to be used for company newsletters. Used knowledge of HTML and CorelDraw, inline style elements were used in the design of the email. Waiting Staff Glamorgan CCC March 2012  –  September 2012  (7 months) Cardiff, United Kingdom Providing a catering service for over 500 people required a large team, emphasising the importance of team work. Waiting Staff Glamorgan CCC March 2012  –  September 2012  (7 months) Cardiff, United Kingdom Providing a catering service for over 500 people required a large team, emphasising the importance of team work. Administration Assistant Westgate Residential Lettings June 2010  –  September 2010  (4 months) Working as an individual, updating and posting housing vacancies on the company website \nAssisting colleagues with customers’ needs with regards to property lettings, helped develop professional communication skills. Administration Assistant Westgate Residential Lettings June 2010  –  September 2010  (4 months) Working as an individual, updating and posting housing vacancies on the company website \nAssisting colleagues with customers’ needs with regards to property lettings, helped develop professional communication skills. Skills Python Java HTML CSS PHP MySQL Dreamweaver Photoshop Microsoft Office Skills  Python Java HTML CSS PHP MySQL Dreamweaver Photoshop Microsoft Office Python Java HTML CSS PHP MySQL Dreamweaver Photoshop Microsoft Office Python Java HTML CSS PHP MySQL Dreamweaver Photoshop Microsoft Office Education Cardiff University / Prifysgol Caerdydd Bachelor of Science (BSc),  Computer Science , 1st Class 2011  – 2015 BSc Computer Science \n \nAchieved 84% in Final Year Project investigating the link between tweets and association football results in the Premier League. \n \nModules completed include:  \nEmerging Technologies, Large Scale Databases, Security & Forensics, Knowledge Management, Web Applications, Problem Solving with Python, Fundamentals of Computing with Java, Scientific Computing and Multimedia Applications, Communication Networks and Pervasive Computing, Algorithms and Data Structures, Database Systems, System Design and Group Project. Activities and Societies:  Active member of social football team The Nottingham Trent University Bachelor of Arts (BA),  Business Management and Accounting & Finance , N/A 2010  – 2011 Maiden Erlegh School 2008  – 2010 A Levels: Business Studies (B), Geography (B) \nBTEC National Award: ICT (Distinction) The Piggott School 2003  – 2008 GCSE: 11 A to C grades, including A in Maths. Activities and Societies:  Football 1st Team Cardiff University / Prifysgol Caerdydd Bachelor of Science (BSc),  Computer Science , 1st Class 2011  – 2015 BSc Computer Science \n \nAchieved 84% in Final Year Project investigating the link between tweets and association football results in the Premier League. \n \nModules completed include:  \nEmerging Technologies, Large Scale Databases, Security & Forensics, Knowledge Management, Web Applications, Problem Solving with Python, Fundamentals of Computing with Java, Scientific Computing and Multimedia Applications, Communication Networks and Pervasive Computing, Algorithms and Data Structures, Database Systems, System Design and Group Project. Activities and Societies:  Active member of social football team Cardiff University / Prifysgol Caerdydd Bachelor of Science (BSc),  Computer Science , 1st Class 2011  – 2015 BSc Computer Science \n \nAchieved 84% in Final Year Project investigating the link between tweets and association football results in the Premier League. \n \nModules completed include:  \nEmerging Technologies, Large Scale Databases, Security & Forensics, Knowledge Management, Web Applications, Problem Solving with Python, Fundamentals of Computing with Java, Scientific Computing and Multimedia Applications, Communication Networks and Pervasive Computing, Algorithms and Data Structures, Database Systems, System Design and Group Project. Activities and Societies:  Active member of social football team Cardiff University / Prifysgol Caerdydd Bachelor of Science (BSc),  Computer Science , 1st Class 2011  – 2015 BSc Computer Science \n \nAchieved 84% in Final Year Project investigating the link between tweets and association football results in the Premier League. \n \nModules completed include:  \nEmerging Technologies, Large Scale Databases, Security & Forensics, Knowledge Management, Web Applications, Problem Solving with Python, Fundamentals of Computing with Java, Scientific Computing and Multimedia Applications, Communication Networks and Pervasive Computing, Algorithms and Data Structures, Database Systems, System Design and Group Project. Activities and Societies:  Active member of social football team The Nottingham Trent University Bachelor of Arts (BA),  Business Management and Accounting & Finance , N/A 2010  – 2011 The Nottingham Trent University Bachelor of Arts (BA),  Business Management and Accounting & Finance , N/A 2010  – 2011 The Nottingham Trent University Bachelor of Arts (BA),  Business Management and Accounting & Finance , N/A 2010  – 2011 Maiden Erlegh School 2008  – 2010 A Levels: Business Studies (B), Geography (B) \nBTEC National Award: ICT (Distinction) Maiden Erlegh School 2008  – 2010 A Levels: Business Studies (B), Geography (B) \nBTEC National Award: ICT (Distinction) Maiden Erlegh School 2008  – 2010 A Levels: Business Studies (B), Geography (B) \nBTEC National Award: ICT (Distinction) The Piggott School 2003  – 2008 GCSE: 11 A to C grades, including A in Maths. Activities and Societies:  Football 1st Team The Piggott School 2003  – 2008 GCSE: 11 A to C grades, including A in Maths. Activities and Societies:  Football 1st Team The Piggott School 2003  – 2008 GCSE: 11 A to C grades, including A in Maths. Activities and Societies:  Football 1st Team ", "Summary I'm a senior level consultant at IBM interested in making new connections with others in my industry.  Summary I'm a senior level consultant at IBM interested in making new connections with others in my industry.  I'm a senior level consultant at IBM interested in making new connections with others in my industry.  I'm a senior level consultant at IBM interested in making new connections with others in my industry.  Experience Senior SAP APO Conultant IBM January 2012  – Present (3 years 8 months) Rockville, MD Lead workshop and gathered requirements for new SAP ECC and APO implementations at multiple large vehicle manufacturing companies.  Global Business Services (GBS) Consulting by Degerees (CbD) Consultant IBM February 2012  –  January 2014  (2 years) Charlotte, North Carolina Area Supply Chain Intern General Dynamics Armaments and Technical Products May 2010  –  August 2010  (4 months) Summer of 2010 \nSurveyed the purchasing team to judge training needs \nOrganized a two day team summit to address key training needs which received commendation from the Sr. Mngr. of Supply Chain Financials. \nDeveloped a team website for the purchasing group \nCreated a template to facilitate loading BPOs into Oracle with DataLoad Delivery Person Grandes May 2009  –  August 2009  (4 months) of 2008 and 2009 \nTrained new employees both at Holland Patent and the new Grandes; Responsible for numerous back of the house operations when not delivering, including: \nIn charge of preparation work for the restaurant \nMaking sure that crucial goods were stocked \nLearned that competition is a good way to speed up the non-delivery assignments \nFigured out the quickest routes to take deliveries to increase productivity Senior SAP APO Conultant IBM January 2012  – Present (3 years 8 months) Rockville, MD Lead workshop and gathered requirements for new SAP ECC and APO implementations at multiple large vehicle manufacturing companies.  Senior SAP APO Conultant IBM January 2012  – Present (3 years 8 months) Rockville, MD Lead workshop and gathered requirements for new SAP ECC and APO implementations at multiple large vehicle manufacturing companies.  Global Business Services (GBS) Consulting by Degerees (CbD) Consultant IBM February 2012  –  January 2014  (2 years) Charlotte, North Carolina Area Global Business Services (GBS) Consulting by Degerees (CbD) Consultant IBM February 2012  –  January 2014  (2 years) Charlotte, North Carolina Area Supply Chain Intern General Dynamics Armaments and Technical Products May 2010  –  August 2010  (4 months) Summer of 2010 \nSurveyed the purchasing team to judge training needs \nOrganized a two day team summit to address key training needs which received commendation from the Sr. Mngr. of Supply Chain Financials. \nDeveloped a team website for the purchasing group \nCreated a template to facilitate loading BPOs into Oracle with DataLoad Supply Chain Intern General Dynamics Armaments and Technical Products May 2010  –  August 2010  (4 months) Summer of 2010 \nSurveyed the purchasing team to judge training needs \nOrganized a two day team summit to address key training needs which received commendation from the Sr. Mngr. of Supply Chain Financials. \nDeveloped a team website for the purchasing group \nCreated a template to facilitate loading BPOs into Oracle with DataLoad Delivery Person Grandes May 2009  –  August 2009  (4 months) of 2008 and 2009 \nTrained new employees both at Holland Patent and the new Grandes; Responsible for numerous back of the house operations when not delivering, including: \nIn charge of preparation work for the restaurant \nMaking sure that crucial goods were stocked \nLearned that competition is a good way to speed up the non-delivery assignments \nFigured out the quickest routes to take deliveries to increase productivity Delivery Person Grandes May 2009  –  August 2009  (4 months) of 2008 and 2009 \nTrained new employees both at Holland Patent and the new Grandes; Responsible for numerous back of the house operations when not delivering, including: \nIn charge of preparation work for the restaurant \nMaking sure that crucial goods were stocked \nLearned that competition is a good way to speed up the non-delivery assignments \nFigured out the quickest routes to take deliveries to increase productivity Languages English French English French English French Skills SAP APO SAP ERP SAP Implementation Microsoft Excel Project Management Microsoft Word Supply Chain Data Analysis Leadership Business Analysis Business Process SAP Analysis SAP PP Skills  SAP APO SAP ERP SAP Implementation Microsoft Excel Project Management Microsoft Word Supply Chain Data Analysis Leadership Business Analysis Business Process SAP Analysis SAP PP SAP APO SAP ERP SAP Implementation Microsoft Excel Project Management Microsoft Word Supply Chain Data Analysis Leadership Business Analysis Business Process SAP Analysis SAP PP SAP APO SAP ERP SAP Implementation Microsoft Excel Project Management Microsoft Word Supply Chain Data Analysis Leadership Business Analysis Business Process SAP Analysis SAP PP Education Clarkson University 2007  – 2011 Grenoble Ecole de Management Clarkson University 2007  – 2011 Clarkson University 2007  – 2011 Clarkson University 2007  – 2011 Grenoble Ecole de Management Grenoble Ecole de Management Grenoble Ecole de Management ", "Experience CbD Consultant IBM August 2015  – Present (1 month) New York, New York Finance/SIOP Intern Nomacorc LLC June 2014  –  August 2014  (3 months) Zebulon, NC Assistant de Planning Nomacorc LLC June 2013  –  August 2013  (3 months) Thimister-Clermont, Belgium CbD Consultant IBM August 2015  – Present (1 month) New York, New York CbD Consultant IBM August 2015  – Present (1 month) New York, New York Finance/SIOP Intern Nomacorc LLC June 2014  –  August 2014  (3 months) Zebulon, NC Finance/SIOP Intern Nomacorc LLC June 2014  –  August 2014  (3 months) Zebulon, NC Assistant de Planning Nomacorc LLC June 2013  –  August 2013  (3 months) Thimister-Clermont, Belgium Assistant de Planning Nomacorc LLC June 2013  –  August 2013  (3 months) Thimister-Clermont, Belgium Languages French Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency French Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency French Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Leadership PowerPoint Teamwork Microsoft Word Microsoft Office Microsoft Excel Research Public Speaking English Windows Event Planning Time Management Team Leadership Skills  Leadership PowerPoint Teamwork Microsoft Word Microsoft Office Microsoft Excel Research Public Speaking English Windows Event Planning Time Management Team Leadership Leadership PowerPoint Teamwork Microsoft Word Microsoft Office Microsoft Excel Research Public Speaking English Windows Event Planning Time Management Team Leadership Leadership PowerPoint Teamwork Microsoft Word Microsoft Office Microsoft Excel Research Public Speaking English Windows Event Planning Time Management Team Leadership Education University of North Carolina at Chapel Hill BA,  Political Science 2011  – 2015 University of North Carolina at Chapel Hill - Kenan-Flagler Business School University of North Carolina at Chapel Hill BA,  Political Science 2011  – 2015 University of North Carolina at Chapel Hill BA,  Political Science 2011  – 2015 University of North Carolina at Chapel Hill BA,  Political Science 2011  – 2015 University of North Carolina at Chapel Hill - Kenan-Flagler Business School University of North Carolina at Chapel Hill - Kenan-Flagler Business School University of North Carolina at Chapel Hill - Kenan-Flagler Business School ", "Summary Studying Business & Management on a 4-year sandwich degree at Aston University. Currently on my Placement year at IBM based at IBM Southbank in London. Summary Studying Business & Management on a 4-year sandwich degree at Aston University. Currently on my Placement year at IBM based at IBM Southbank in London. Studying Business & Management on a 4-year sandwich degree at Aston University. Currently on my Placement year at IBM based at IBM Southbank in London. Studying Business & Management on a 4-year sandwich degree at Aston University. Currently on my Placement year at IBM based at IBM Southbank in London. Experience CbD Consultant IBM July 2013  – Present (2 years 2 months) Currently working within IBM Global Business Services. CbD Consultant IBM July 2013  – Present (2 years 2 months) Currently working within IBM Global Business Services. CbD Consultant IBM July 2013  – Present (2 years 2 months) Currently working within IBM Global Business Services. Skills Time Management Interpersonal Skill Cloud Computing Teamwork Microsoft Excel Microsoft Word Microsoft Powerpoint Lotus Notes Lotus Symphony Skills  Time Management Interpersonal Skill Cloud Computing Teamwork Microsoft Excel Microsoft Word Microsoft Powerpoint Lotus Notes Lotus Symphony Time Management Interpersonal Skill Cloud Computing Teamwork Microsoft Excel Microsoft Word Microsoft Powerpoint Lotus Notes Lotus Symphony Time Management Interpersonal Skill Cloud Computing Teamwork Microsoft Excel Microsoft Word Microsoft Powerpoint Lotus Notes Lotus Symphony Education Aston University Business and Management 2011  – 2015 Strategic Finance \nPrinciples of Intellectual Property Law \nE-Marketing \nEnterprise Resource Planning \nBusiness Game \nDoing E-Business \nBusiness Policy \nBusiness, Government & Society \nEnglish Legal Method & Contract Law \nBusiness Decision Analysis \nIntroduction to Marketing Management \nIntroduction to Management Accounting \nInformation Technology in Business \nPrinciples of Operations Management \nOrganisational Behaviour \nIntroduction to Financial Accounting \nIntroduction to Microeconomics \nIntroduction to Macroeconomics \nPerspectives on Business & Management \nQuantitative Techniques Activities and Societies:  1st Team Hockey Welshpool High School - 2004  – 2011 A levels: Business Studies (Distinction), History (B), Geography (B). Activities and Societies:  Welshpool Town Football Club Aston University Business and Management 2011  – 2015 Strategic Finance \nPrinciples of Intellectual Property Law \nE-Marketing \nEnterprise Resource Planning \nBusiness Game \nDoing E-Business \nBusiness Policy \nBusiness, Government & Society \nEnglish Legal Method & Contract Law \nBusiness Decision Analysis \nIntroduction to Marketing Management \nIntroduction to Management Accounting \nInformation Technology in Business \nPrinciples of Operations Management \nOrganisational Behaviour \nIntroduction to Financial Accounting \nIntroduction to Microeconomics \nIntroduction to Macroeconomics \nPerspectives on Business & Management \nQuantitative Techniques Activities and Societies:  1st Team Hockey Aston University Business and Management 2011  – 2015 Strategic Finance \nPrinciples of Intellectual Property Law \nE-Marketing \nEnterprise Resource Planning \nBusiness Game \nDoing E-Business \nBusiness Policy \nBusiness, Government & Society \nEnglish Legal Method & Contract Law \nBusiness Decision Analysis \nIntroduction to Marketing Management \nIntroduction to Management Accounting \nInformation Technology in Business \nPrinciples of Operations Management \nOrganisational Behaviour \nIntroduction to Financial Accounting \nIntroduction to Microeconomics \nIntroduction to Macroeconomics \nPerspectives on Business & Management \nQuantitative Techniques Activities and Societies:  1st Team Hockey Aston University Business and Management 2011  – 2015 Strategic Finance \nPrinciples of Intellectual Property Law \nE-Marketing \nEnterprise Resource Planning \nBusiness Game \nDoing E-Business \nBusiness Policy \nBusiness, Government & Society \nEnglish Legal Method & Contract Law \nBusiness Decision Analysis \nIntroduction to Marketing Management \nIntroduction to Management Accounting \nInformation Technology in Business \nPrinciples of Operations Management \nOrganisational Behaviour \nIntroduction to Financial Accounting \nIntroduction to Microeconomics \nIntroduction to Macroeconomics \nPerspectives on Business & Management \nQuantitative Techniques Activities and Societies:  1st Team Hockey Welshpool High School - 2004  – 2011 A levels: Business Studies (Distinction), History (B), Geography (B). Activities and Societies:  Welshpool Town Football Club Welshpool High School - 2004  – 2011 A levels: Business Studies (Distinction), History (B), Geography (B). Activities and Societies:  Welshpool Town Football Club Welshpool High School - 2004  – 2011 A levels: Business Studies (Distinction), History (B), Geography (B). Activities and Societies:  Welshpool Town Football Club "]}