{"position": "Clinical Fellow", "company": "Stanford University", "profiles": ["Experience Associate Medical Director AbbVie January 2014  – Present (1 year 8 months) Infectious Diseases Postdoctoral Research Fellow Stanford University Medical Center July 2012  –  January 2014  (1 year 7 months) Research project involved the investigation of virus-host interactions involved in Hepatitis C Virus (HCV) release and cell-to-cell transmission, late stages of the HCV life cycle, and translating this data into more effective antiviral strategies. Infectious Diseases Clinical Fellow Stanford University Medical Center July 2011  –  January 2014  (2 years 7 months) Stanford, CA Infectious Diseases Consultant St. Rose Hospital September 2013  –  December 2013  (4 months) Hayward, CA Nocturnist Kaiser Permanente Santa Clara Medical Center July 2012  –  December 2013  (1 year 6 months) Santa Clara, CA Resident University of Chicago Medical Center June 2008  –  June 2011  (3 years 1 month) Chicago, IL Research Associate Genelabs Technologies January 1998  –  May 1999  (1 year 5 months) Redwood City, CA - Performed DNA sequencing for other projects in the company. \n- Developed Kinetic Strand Displacement Assay as a screening tool for novel compounds that inhibit transcription factor-DNA binding. Associate Medical Director AbbVie January 2014  – Present (1 year 8 months) Associate Medical Director AbbVie January 2014  – Present (1 year 8 months) Infectious Diseases Postdoctoral Research Fellow Stanford University Medical Center July 2012  –  January 2014  (1 year 7 months) Research project involved the investigation of virus-host interactions involved in Hepatitis C Virus (HCV) release and cell-to-cell transmission, late stages of the HCV life cycle, and translating this data into more effective antiviral strategies. Infectious Diseases Postdoctoral Research Fellow Stanford University Medical Center July 2012  –  January 2014  (1 year 7 months) Research project involved the investigation of virus-host interactions involved in Hepatitis C Virus (HCV) release and cell-to-cell transmission, late stages of the HCV life cycle, and translating this data into more effective antiviral strategies. Infectious Diseases Clinical Fellow Stanford University Medical Center July 2011  –  January 2014  (2 years 7 months) Stanford, CA Infectious Diseases Clinical Fellow Stanford University Medical Center July 2011  –  January 2014  (2 years 7 months) Stanford, CA Infectious Diseases Consultant St. Rose Hospital September 2013  –  December 2013  (4 months) Hayward, CA Infectious Diseases Consultant St. Rose Hospital September 2013  –  December 2013  (4 months) Hayward, CA Nocturnist Kaiser Permanente Santa Clara Medical Center July 2012  –  December 2013  (1 year 6 months) Santa Clara, CA Nocturnist Kaiser Permanente Santa Clara Medical Center July 2012  –  December 2013  (1 year 6 months) Santa Clara, CA Resident University of Chicago Medical Center June 2008  –  June 2011  (3 years 1 month) Chicago, IL Resident University of Chicago Medical Center June 2008  –  June 2011  (3 years 1 month) Chicago, IL Research Associate Genelabs Technologies January 1998  –  May 1999  (1 year 5 months) Redwood City, CA - Performed DNA sequencing for other projects in the company. \n- Developed Kinetic Strand Displacement Assay as a screening tool for novel compounds that inhibit transcription factor-DNA binding. Research Associate Genelabs Technologies January 1998  –  May 1999  (1 year 5 months) Redwood City, CA - Performed DNA sequencing for other projects in the company. \n- Developed Kinetic Strand Displacement Assay as a screening tool for novel compounds that inhibit transcription factor-DNA binding. Skills Internal Medicine Infectious Diseases Hepatitis C Biochemistry Board Certified Medicine Immunology Hospitals Medical Education Clinical Research Healthcare Healthcare Management Molecular Biology Skills  Internal Medicine Infectious Diseases Hepatitis C Biochemistry Board Certified Medicine Immunology Hospitals Medical Education Clinical Research Healthcare Healthcare Management Molecular Biology Internal Medicine Infectious Diseases Hepatitis C Biochemistry Board Certified Medicine Immunology Hospitals Medical Education Clinical Research Healthcare Healthcare Management Molecular Biology Internal Medicine Infectious Diseases Hepatitis C Biochemistry Board Certified Medicine Immunology Hospitals Medical Education Clinical Research Healthcare Healthcare Management Molecular Biology Education University of Illinois at Urbana-Champaign Doctor of Medicine (MD) 2000  – 2008 Activities and Societies:  Alpha Omega Alpha Honor Medical Society University of Illinois at Urbana-Champaign Doctor of Philosophy (PhD),  Biochemistry 1999  – 2006 - Developed the Fluorescence Anisotropy Microplate Assay to measure steroid receptor-DNA binding, coactivator-steroid receptor binding and as a system suitable for screening large compound libraries to identify novel compounds that modulate steroid receptor-DNA binding. \n- Mentor for college students rotating through the lab \n- Teaching Assistant for multiple college science courses University of California, Berkeley Bachelor of Arts (BA),  Biochemistry 1993  – 1997 University of Illinois at Urbana-Champaign Doctor of Medicine (MD) 2000  – 2008 Activities and Societies:  Alpha Omega Alpha Honor Medical Society University of Illinois at Urbana-Champaign Doctor of Medicine (MD) 2000  – 2008 Activities and Societies:  Alpha Omega Alpha Honor Medical Society University of Illinois at Urbana-Champaign Doctor of Medicine (MD) 2000  – 2008 Activities and Societies:  Alpha Omega Alpha Honor Medical Society University of Illinois at Urbana-Champaign Doctor of Philosophy (PhD),  Biochemistry 1999  – 2006 - Developed the Fluorescence Anisotropy Microplate Assay to measure steroid receptor-DNA binding, coactivator-steroid receptor binding and as a system suitable for screening large compound libraries to identify novel compounds that modulate steroid receptor-DNA binding. \n- Mentor for college students rotating through the lab \n- Teaching Assistant for multiple college science courses University of Illinois at Urbana-Champaign Doctor of Philosophy (PhD),  Biochemistry 1999  – 2006 - Developed the Fluorescence Anisotropy Microplate Assay to measure steroid receptor-DNA binding, coactivator-steroid receptor binding and as a system suitable for screening large compound libraries to identify novel compounds that modulate steroid receptor-DNA binding. \n- Mentor for college students rotating through the lab \n- Teaching Assistant for multiple college science courses University of Illinois at Urbana-Champaign Doctor of Philosophy (PhD),  Biochemistry 1999  – 2006 - Developed the Fluorescence Anisotropy Microplate Assay to measure steroid receptor-DNA binding, coactivator-steroid receptor binding and as a system suitable for screening large compound libraries to identify novel compounds that modulate steroid receptor-DNA binding. \n- Mentor for college students rotating through the lab \n- Teaching Assistant for multiple college science courses University of California, Berkeley Bachelor of Arts (BA),  Biochemistry 1993  – 1997 University of California, Berkeley Bachelor of Arts (BA),  Biochemistry 1993  – 1997 University of California, Berkeley Bachelor of Arts (BA),  Biochemistry 1993  – 1997 ", "Experience Hospitalist The Permanente Medical Group July 2014  – Present (1 year 2 months) Kaiser Vallejo Physician Advanced Nephrology Associates 2004  –  January 2014  (10 years) Hospitalist The Permanente Medical Group July 2014  – Present (1 year 2 months) Kaiser Vallejo Hospitalist The Permanente Medical Group July 2014  – Present (1 year 2 months) Kaiser Vallejo Physician Advanced Nephrology Associates 2004  –  January 2014  (10 years) Physician Advanced Nephrology Associates 2004  –  January 2014  (10 years) Skills Medicine Family Medicine Internal Medicine Medical Education Board Certified Nephrology Primary Care Critical Care Medicine Hospital Medicine Skills  Medicine Family Medicine Internal Medicine Medical Education Board Certified Nephrology Primary Care Critical Care Medicine Hospital Medicine Medicine Family Medicine Internal Medicine Medical Education Board Certified Nephrology Primary Care Critical Care Medicine Hospital Medicine Medicine Family Medicine Internal Medicine Medical Education Board Certified Nephrology Primary Care Critical Care Medicine Hospital Medicine Education Clinical Fellow - Stanford University Board Certified Nephrologist,  Nephrology Fellowship Program 2002  – 2004 Resident - Presbyterian Hospital - University of Pittsburgh Medical Center Internal Medicine Residency Program 1999  – 2002 University of Pittsburgh School of Medicine Doctor of Medicine (M.D.),  Internal Medicine 1994  – 1999 University of California, Berkeley Bachelor of Arts (B.A.),  Biochemistry , Biophysics and Molecular Biology 1990  – 1994 Clinical Fellow - Stanford University Board Certified Nephrologist,  Nephrology Fellowship Program 2002  – 2004 Clinical Fellow - Stanford University Board Certified Nephrologist,  Nephrology Fellowship Program 2002  – 2004 Clinical Fellow - Stanford University Board Certified Nephrologist,  Nephrology Fellowship Program 2002  – 2004 Resident - Presbyterian Hospital - University of Pittsburgh Medical Center Internal Medicine Residency Program 1999  – 2002 Resident - Presbyterian Hospital - University of Pittsburgh Medical Center Internal Medicine Residency Program 1999  – 2002 Resident - Presbyterian Hospital - University of Pittsburgh Medical Center Internal Medicine Residency Program 1999  – 2002 University of Pittsburgh School of Medicine Doctor of Medicine (M.D.),  Internal Medicine 1994  – 1999 University of Pittsburgh School of Medicine Doctor of Medicine (M.D.),  Internal Medicine 1994  – 1999 University of Pittsburgh School of Medicine Doctor of Medicine (M.D.),  Internal Medicine 1994  – 1999 University of California, Berkeley Bachelor of Arts (B.A.),  Biochemistry , Biophysics and Molecular Biology 1990  – 1994 University of California, Berkeley Bachelor of Arts (B.A.),  Biochemistry , Biophysics and Molecular Biology 1990  – 1994 University of California, Berkeley Bachelor of Arts (B.A.),  Biochemistry , Biophysics and Molecular Biology 1990  – 1994 ", "Summary Specialties:Critical Care Summary Specialties:Critical Care Specialties:Critical Care Specialties:Critical Care Experience Clinical Fellow Stanford University Medical Center Anesthesiology Resident Northwestern Medical Center 2005  –  2009  (4 years) Clinical Fellow Stanford University Medical Center Clinical Fellow Stanford University Medical Center Anesthesiology Resident Northwestern Medical Center 2005  –  2009  (4 years) Anesthesiology Resident Northwestern Medical Center 2005  –  2009  (4 years) Education University of Minnesota Medical School MD,  Medicine 2001  – 2005 Georgetown University MS,  Physiology 2000  – 2001 University of St. Thomas BA,  Biology 1995  – 1999 University of Minnesota Medical School MD,  Medicine 2001  – 2005 University of Minnesota Medical School MD,  Medicine 2001  – 2005 University of Minnesota Medical School MD,  Medicine 2001  – 2005 Georgetown University MS,  Physiology 2000  – 2001 Georgetown University MS,  Physiology 2000  – 2001 Georgetown University MS,  Physiology 2000  – 2001 University of St. Thomas BA,  Biology 1995  – 1999 University of St. Thomas BA,  Biology 1995  – 1999 University of St. Thomas BA,  Biology 1995  – 1999 ", "Experience Surgeon Kanagawa Children's Medical Center August 2012  – Present (3 years 1 month) Surgeon Kanagawa Children's Medical Center 2012  – Present (3 years) Clinical fellow British Columbia Children's Hospital August 2010  –  July 2012  (2 years) Postdoctoral Research Fellow Stanford University School of Medicine July 2007  –  July 2010  (3 years 1 month) Surgeon Kanagawa Children's Medical Center August 2012  – Present (3 years 1 month) Surgeon Kanagawa Children's Medical Center August 2012  – Present (3 years 1 month) Surgeon Kanagawa Children's Medical Center 2012  – Present (3 years) Surgeon Kanagawa Children's Medical Center 2012  – Present (3 years) Clinical fellow British Columbia Children's Hospital August 2010  –  July 2012  (2 years) Clinical fellow British Columbia Children's Hospital August 2010  –  July 2012  (2 years) Postdoctoral Research Fellow Stanford University School of Medicine July 2007  –  July 2010  (3 years 1 month) Postdoctoral Research Fellow Stanford University School of Medicine July 2007  –  July 2010  (3 years 1 month) Education Nippon Medical School 1992  – 1998 Nippon Medical School 1992  – 1998 Nippon Medical School 1992  – 1998 Nippon Medical School 1992  – 1998 ", "Summary Specialties:Endometriosis, Laparoscopy, Reproductive endocrinology, In vitro fertilization Summary Specialties:Endometriosis, Laparoscopy, Reproductive endocrinology, In vitro fertilization Specialties:Endometriosis, Laparoscopy, Reproductive endocrinology, In vitro fertilization Specialties:Endometriosis, Laparoscopy, Reproductive endocrinology, In vitro fertilization Experience Chair, Department of Clinical Investigation Madigan Healthcare System April 2015  – Present (5 months) Deputy Chair, Department of Clinical Investigation Madigan Healthcare System January 2010  –  April 2015  (5 years 4 months) Clinical Fellow Stanford University School of Medicine 2004  –  2007  (3 years) Chair, Department of Clinical Investigation Madigan Healthcare System April 2015  – Present (5 months) Chair, Department of Clinical Investigation Madigan Healthcare System April 2015  – Present (5 months) Deputy Chair, Department of Clinical Investigation Madigan Healthcare System January 2010  –  April 2015  (5 years 4 months) Deputy Chair, Department of Clinical Investigation Madigan Healthcare System January 2010  –  April 2015  (5 years 4 months) Clinical Fellow Stanford University School of Medicine 2004  –  2007  (3 years) Clinical Fellow Stanford University School of Medicine 2004  –  2007  (3 years) Skills Laparoscopic Surgery Genetics Endocrinology Cancer Ultrasound Medical Education Internal Medicine Clinical Trials Reproductive... IVF Medical Research Medicine Public Health Clinical Research Board Certified Skills  Laparoscopic Surgery Genetics Endocrinology Cancer Ultrasound Medical Education Internal Medicine Clinical Trials Reproductive... IVF Medical Research Medicine Public Health Clinical Research Board Certified Laparoscopic Surgery Genetics Endocrinology Cancer Ultrasound Medical Education Internal Medicine Clinical Trials Reproductive... IVF Medical Research Medicine Public Health Clinical Research Board Certified Laparoscopic Surgery Genetics Endocrinology Cancer Ultrasound Medical Education Internal Medicine Clinical Trials Reproductive... IVF Medical Research Medicine Public Health Clinical Research Board Certified Education Stanford University IVF Fellowship,  Laparoscopy, In vitro fertilization 2004  – 2007 Thesis entitled \"Gene expression analysis of endometrium reveals progesterone resistance and candidate susceptibility genes in women with endometriosis.\" Published in Journal of Endocrinology 2007. Uniformed Services University of the Health Sciences - F Edward Hebert SOM M.D.,  Medicine 1993  – 1997 Activities and Societies:  Alpha Omega Alpha University of Oxford M.Sc.,  Immunogenetics 1991  – 1993 Marshall scholarship \nThesis titled, \"A molecular analysis of the genetic susceptibility to ankylosing spondylitis.\" Published in Annals of Rheumatic Diseases 1994 Activities and Societies:  Oxford University Varsity Lacrosse Team\nQueen's College Rugby Team\nQueen's College Tennis Team United States Military Academy at West Point B.Sc.,  Life Sceinces 1987  – 1991 Valedictorian, Class of 1991 Stanford University IVF Fellowship,  Laparoscopy, In vitro fertilization 2004  – 2007 Thesis entitled \"Gene expression analysis of endometrium reveals progesterone resistance and candidate susceptibility genes in women with endometriosis.\" Published in Journal of Endocrinology 2007. Stanford University IVF Fellowship,  Laparoscopy, In vitro fertilization 2004  – 2007 Thesis entitled \"Gene expression analysis of endometrium reveals progesterone resistance and candidate susceptibility genes in women with endometriosis.\" Published in Journal of Endocrinology 2007. Stanford University IVF Fellowship,  Laparoscopy, In vitro fertilization 2004  – 2007 Thesis entitled \"Gene expression analysis of endometrium reveals progesterone resistance and candidate susceptibility genes in women with endometriosis.\" Published in Journal of Endocrinology 2007. Uniformed Services University of the Health Sciences - F Edward Hebert SOM M.D.,  Medicine 1993  – 1997 Activities and Societies:  Alpha Omega Alpha Uniformed Services University of the Health Sciences - F Edward Hebert SOM M.D.,  Medicine 1993  – 1997 Activities and Societies:  Alpha Omega Alpha Uniformed Services University of the Health Sciences - F Edward Hebert SOM M.D.,  Medicine 1993  – 1997 Activities and Societies:  Alpha Omega Alpha University of Oxford M.Sc.,  Immunogenetics 1991  – 1993 Marshall scholarship \nThesis titled, \"A molecular analysis of the genetic susceptibility to ankylosing spondylitis.\" Published in Annals of Rheumatic Diseases 1994 Activities and Societies:  Oxford University Varsity Lacrosse Team\nQueen's College Rugby Team\nQueen's College Tennis Team University of Oxford M.Sc.,  Immunogenetics 1991  – 1993 Marshall scholarship \nThesis titled, \"A molecular analysis of the genetic susceptibility to ankylosing spondylitis.\" Published in Annals of Rheumatic Diseases 1994 Activities and Societies:  Oxford University Varsity Lacrosse Team\nQueen's College Rugby Team\nQueen's College Tennis Team University of Oxford M.Sc.,  Immunogenetics 1991  – 1993 Marshall scholarship \nThesis titled, \"A molecular analysis of the genetic susceptibility to ankylosing spondylitis.\" Published in Annals of Rheumatic Diseases 1994 Activities and Societies:  Oxford University Varsity Lacrosse Team\nQueen's College Rugby Team\nQueen's College Tennis Team United States Military Academy at West Point B.Sc.,  Life Sceinces 1987  – 1991 Valedictorian, Class of 1991 United States Military Academy at West Point B.Sc.,  Life Sceinces 1987  – 1991 Valedictorian, Class of 1991 United States Military Academy at West Point B.Sc.,  Life Sceinces 1987  – 1991 Valedictorian, Class of 1991 ", "Experience Clinical Fellow Stanford University Clinical Fellow Stanford University Clinical Fellow Stanford University Education University of Colorado Boulder 1989  – 1993 University of Colorado Boulder 1989  – 1993 University of Colorado Boulder 1989  – 1993 University of Colorado Boulder 1989  – 1993 ", "Experience Physician Kaiser Hospital June 2015  – Present (3 months) San Francisco Bay Area Clinical Assistant Professor Stanford University School of Medicine July 2013  –  May 2015  (1 year 11 months) Department of Cardiothoracic Surgery Specialized in all forms of adult cardiac surgery, thoracic transplantation, and mechanical circulatory support. Research interests included medico-surgical education and thoracic transplantation.  Clinical Instructor Stanford University School of Medicine July 2012  –  June 2013  (1 year) Department of Cardiothoracic Surgery Thoracic transplantation and mechanical circulatory support fellowship Clinical Fellow Stanford University School of Medicine July 2009  –  June 2012  (3 years) Department of Cardiothoracic Surgery Adult cardiothoracic surgery residency Post-doctoral research fellow Stanford University July 2004  –  June 2007  (3 years) Department of Cardiothoracic Surgery Research focused on molecular mechanisms and stem cell therapeutics for treatment of heart failure. Specific areas of study included molecular imaging of stem cell therapy for the heart and the apelin-APJ neurohormonal pathway. Physician Kaiser Hospital June 2015  – Present (3 months) San Francisco Bay Area Physician Kaiser Hospital June 2015  – Present (3 months) San Francisco Bay Area Clinical Assistant Professor Stanford University School of Medicine July 2013  –  May 2015  (1 year 11 months) Department of Cardiothoracic Surgery Specialized in all forms of adult cardiac surgery, thoracic transplantation, and mechanical circulatory support. Research interests included medico-surgical education and thoracic transplantation.  Clinical Assistant Professor Stanford University School of Medicine July 2013  –  May 2015  (1 year 11 months) Department of Cardiothoracic Surgery Specialized in all forms of adult cardiac surgery, thoracic transplantation, and mechanical circulatory support. Research interests included medico-surgical education and thoracic transplantation.  Clinical Instructor Stanford University School of Medicine July 2012  –  June 2013  (1 year) Department of Cardiothoracic Surgery Thoracic transplantation and mechanical circulatory support fellowship Clinical Instructor Stanford University School of Medicine July 2012  –  June 2013  (1 year) Department of Cardiothoracic Surgery Thoracic transplantation and mechanical circulatory support fellowship Clinical Fellow Stanford University School of Medicine July 2009  –  June 2012  (3 years) Department of Cardiothoracic Surgery Adult cardiothoracic surgery residency Clinical Fellow Stanford University School of Medicine July 2009  –  June 2012  (3 years) Department of Cardiothoracic Surgery Adult cardiothoracic surgery residency Post-doctoral research fellow Stanford University July 2004  –  June 2007  (3 years) Department of Cardiothoracic Surgery Research focused on molecular mechanisms and stem cell therapeutics for treatment of heart failure. Specific areas of study included molecular imaging of stem cell therapy for the heart and the apelin-APJ neurohormonal pathway. Post-doctoral research fellow Stanford University July 2004  –  June 2007  (3 years) Department of Cardiothoracic Surgery Research focused on molecular mechanisms and stem cell therapeutics for treatment of heart failure. Specific areas of study included molecular imaging of stem cell therapy for the heart and the apelin-APJ neurohormonal pathway. Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Urdu Native or bilingual proficiency French Limited working proficiency Punjabi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Urdu Native or bilingual proficiency French Limited working proficiency Punjabi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Urdu Native or bilingual proficiency French Limited working proficiency Punjabi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Native or bilingual proficiency Skills Medical Education Clinical Research Medicine Healthcare Medical Research Public Health Research Critical Care Board Certified Hospitals Surgery Life Sciences Medical Devices Skills  Medical Education Clinical Research Medicine Healthcare Medical Research Public Health Research Critical Care Board Certified Hospitals Surgery Life Sciences Medical Devices Medical Education Clinical Research Medicine Healthcare Medical Research Public Health Research Critical Care Board Certified Hospitals Surgery Life Sciences Medical Devices Medical Education Clinical Research Medicine Healthcare Medical Research Public Health Research Critical Care Board Certified Hospitals Surgery Life Sciences Medical Devices Education The Johns Hopkins University Master of Education (M.Ed.) 2014  – 2017 Harvard Medical School General Surgery Residency Program 2001  – 2009 University of California, San Francisco Doctor of Medicine (M.D.) 1996  – 2001 University of California, Berkeley Bachelor's degree,  Cell/Cellular and Molecular Biology 1992  – 1995 The Johns Hopkins University Master of Education (M.Ed.) 2014  – 2017 The Johns Hopkins University Master of Education (M.Ed.) 2014  – 2017 The Johns Hopkins University Master of Education (M.Ed.) 2014  – 2017 Harvard Medical School General Surgery Residency Program 2001  – 2009 Harvard Medical School General Surgery Residency Program 2001  – 2009 Harvard Medical School General Surgery Residency Program 2001  – 2009 University of California, San Francisco Doctor of Medicine (M.D.) 1996  – 2001 University of California, San Francisco Doctor of Medicine (M.D.) 1996  – 2001 University of California, San Francisco Doctor of Medicine (M.D.) 1996  – 2001 University of California, Berkeley Bachelor's degree,  Cell/Cellular and Molecular Biology 1992  – 1995 University of California, Berkeley Bachelor's degree,  Cell/Cellular and Molecular Biology 1992  – 1995 University of California, Berkeley Bachelor's degree,  Cell/Cellular and Molecular Biology 1992  – 1995 ", "Summary I am passionate about taking care of sick neonates in the intensive care unit and will continue to do so as Kaiser Permanente opens the new San Leandro venue and its larger NICU there. \nI am also equally passionate about bringing my neuroscience expertise to improving the movement and performance of elite athletes (especially golfers but all sports) and am in the process of founding a consulting business, GoaLoGolf, that brings principles of neuroscience to training the elite athlete. Summary I am passionate about taking care of sick neonates in the intensive care unit and will continue to do so as Kaiser Permanente opens the new San Leandro venue and its larger NICU there. \nI am also equally passionate about bringing my neuroscience expertise to improving the movement and performance of elite athletes (especially golfers but all sports) and am in the process of founding a consulting business, GoaLoGolf, that brings principles of neuroscience to training the elite athlete. I am passionate about taking care of sick neonates in the intensive care unit and will continue to do so as Kaiser Permanente opens the new San Leandro venue and its larger NICU there. \nI am also equally passionate about bringing my neuroscience expertise to improving the movement and performance of elite athletes (especially golfers but all sports) and am in the process of founding a consulting business, GoaLoGolf, that brings principles of neuroscience to training the elite athlete. I am passionate about taking care of sick neonates in the intensive care unit and will continue to do so as Kaiser Permanente opens the new San Leandro venue and its larger NICU there. \nI am also equally passionate about bringing my neuroscience expertise to improving the movement and performance of elite athletes (especially golfers but all sports) and am in the process of founding a consulting business, GoaLoGolf, that brings principles of neuroscience to training the elite athlete. Experience Neonatologist The Permanente Medical Group December 2010  – Present (4 years 9 months) Physician in the Neonatal Intensive Care Unit, Hayward Hospital. Volunteer Assistant Coach Stanford Men's Golf Team Stanford University 2012  –  2013  (1 year) Stanford, California Clinical Fellow Stanford University Medical Center July 2005  –  June 2009  (4 years) Research in developmental neurobiology (patterning the developing cerebellum) and fellowship training in neonatology Resident Massachusetts General Hospital 2002  –  2005  (3 years) Pediatric Residency Neonatologist The Permanente Medical Group December 2010  – Present (4 years 9 months) Physician in the Neonatal Intensive Care Unit, Hayward Hospital. Neonatologist The Permanente Medical Group December 2010  – Present (4 years 9 months) Physician in the Neonatal Intensive Care Unit, Hayward Hospital. Volunteer Assistant Coach Stanford Men's Golf Team Stanford University 2012  –  2013  (1 year) Stanford, California Volunteer Assistant Coach Stanford Men's Golf Team Stanford University 2012  –  2013  (1 year) Stanford, California Clinical Fellow Stanford University Medical Center July 2005  –  June 2009  (4 years) Research in developmental neurobiology (patterning the developing cerebellum) and fellowship training in neonatology Clinical Fellow Stanford University Medical Center July 2005  –  June 2009  (4 years) Research in developmental neurobiology (patterning the developing cerebellum) and fellowship training in neonatology Resident Massachusetts General Hospital 2002  –  2005  (3 years) Pediatric Residency Resident Massachusetts General Hospital 2002  –  2005  (3 years) Pediatric Residency Languages French Elementary proficiency Kannada Elementary proficiency French Elementary proficiency Kannada Elementary proficiency French Elementary proficiency Kannada Elementary proficiency Elementary proficiency Elementary proficiency Skills Medical Education Clinical Research Medicine Neuroscience Pediatrics Molecular Biology Healthcare Cell Biology Lifesciences ICU Patient Safety Medical Research Skills  Medical Education Clinical Research Medicine Neuroscience Pediatrics Molecular Biology Healthcare Cell Biology Lifesciences ICU Patient Safety Medical Research Medical Education Clinical Research Medicine Neuroscience Pediatrics Molecular Biology Healthcare Cell Biology Lifesciences ICU Patient Safety Medical Research Medical Education Clinical Research Medicine Neuroscience Pediatrics Molecular Biology Healthcare Cell Biology Lifesciences ICU Patient Safety Medical Research Education Northwestern University MD PhD,  Neuroscience , Medicine 1993  – 2002 Northwestern University - The Feinberg School of Medicine MD PhD,  Neuroscience 1993  – 2002 Northwestern University Bachelor of Arts (B.A.),  Mathematics , Integrated Science,  Biochemistry 1989  – 1993 Northwestern University MD PhD,  Neuroscience , Medicine 1993  – 2002 Northwestern University MD PhD,  Neuroscience , Medicine 1993  – 2002 Northwestern University MD PhD,  Neuroscience , Medicine 1993  – 2002 Northwestern University - The Feinberg School of Medicine MD PhD,  Neuroscience 1993  – 2002 Northwestern University - The Feinberg School of Medicine MD PhD,  Neuroscience 1993  – 2002 Northwestern University - The Feinberg School of Medicine MD PhD,  Neuroscience 1993  – 2002 Northwestern University Bachelor of Arts (B.A.),  Mathematics , Integrated Science,  Biochemistry 1989  – 1993 Northwestern University Bachelor of Arts (B.A.),  Mathematics , Integrated Science,  Biochemistry 1989  – 1993 Northwestern University Bachelor of Arts (B.A.),  Mathematics , Integrated Science,  Biochemistry 1989  – 1993 ", "Experience Clinical Assistant Professor, Heart Failure and Cardiac Transplantation Capital District Health Authority and Dalhousie University January 2012  – Present (3 years 8 months) Co-Medical Director of the Advanced Heart Failure/Transplant/VAD program at the QEII Health Science Center, Halifax, Nova Scotia Clinical Fellow Stanford University Medical Center July 2010  –  September 2011  (1 year 3 months) Heart Failure and Cardiac Transplantation Cardiology Fellow Dalhousie University July 2007  –  July 2010  (3 years 1 month) Clinical Assistant Professor, Heart Failure and Cardiac Transplantation Capital District Health Authority and Dalhousie University January 2012  – Present (3 years 8 months) Co-Medical Director of the Advanced Heart Failure/Transplant/VAD program at the QEII Health Science Center, Halifax, Nova Scotia Clinical Assistant Professor, Heart Failure and Cardiac Transplantation Capital District Health Authority and Dalhousie University January 2012  – Present (3 years 8 months) Co-Medical Director of the Advanced Heart Failure/Transplant/VAD program at the QEII Health Science Center, Halifax, Nova Scotia Clinical Fellow Stanford University Medical Center July 2010  –  September 2011  (1 year 3 months) Heart Failure and Cardiac Transplantation Clinical Fellow Stanford University Medical Center July 2010  –  September 2011  (1 year 3 months) Heart Failure and Cardiac Transplantation Cardiology Fellow Dalhousie University July 2007  –  July 2010  (3 years 1 month) Cardiology Fellow Dalhousie University July 2007  –  July 2010  (3 years 1 month) Skills Heart Failure Heart Transplant Mechanical Circulatory... Clinical Cardiology Cardiology Clinical Research Transplant Echocardiography Critical Care Critical Care Medicine ICU Medical Education Internal Medicine Medical Research Medicine Interventional... Board Certified ACLS See 3+     See less Skills  Heart Failure Heart Transplant Mechanical Circulatory... Clinical Cardiology Cardiology Clinical Research Transplant Echocardiography Critical Care Critical Care Medicine ICU Medical Education Internal Medicine Medical Research Medicine Interventional... Board Certified ACLS See 3+     See less Heart Failure Heart Transplant Mechanical Circulatory... Clinical Cardiology Cardiology Clinical Research Transplant Echocardiography Critical Care Critical Care Medicine ICU Medical Education Internal Medicine Medical Research Medicine Interventional... Board Certified ACLS See 3+     See less Heart Failure Heart Transplant Mechanical Circulatory... Clinical Cardiology Cardiology Clinical Research Transplant Echocardiography Critical Care Critical Care Medicine ICU Medical Education Internal Medicine Medical Research Medicine Interventional... Board Certified ACLS See 3+     See less Education Dalhousie University Doctor of Medicine (MD) 2000  – 2004 St. Francis Xavier University Bachelor’s Degree,  Honours Biology 1996  – 2000 Dalhousie University Doctor of Medicine (MD) 2000  – 2004 Dalhousie University Doctor of Medicine (MD) 2000  – 2004 Dalhousie University Doctor of Medicine (MD) 2000  – 2004 St. Francis Xavier University Bachelor’s Degree,  Honours Biology 1996  – 2000 St. Francis Xavier University Bachelor’s Degree,  Honours Biology 1996  – 2000 St. Francis Xavier University Bachelor’s Degree,  Honours Biology 1996  – 2000 ", "Summary Specialties: Adult Pulmonary Medicine in France Summary Specialties: Adult Pulmonary Medicine in France Specialties: Adult Pulmonary Medicine in France Specialties: Adult Pulmonary Medicine in France Experience Resident Physician Alameda County Hospital October 2011  – Present (3 years 11 months) Oakland CA, USA I am currently performing my residency in Internal Medicine at Alameda Health System Hospital (Oakland, CA, USA). Meanwhile, I am very fortunate to be a visiting scholar at Stanford to continue my translational research on a longitudinal cohort of patients with ABPA under the mentoring of Dr. Moss (Professor of Pediatrics at the Lucile Salter Packard Children's Hospital) and Dr. Herzenberg (Professor [Research] of Genetics). Visiting resident Alameda County Hospital April 2014  –  May 2014  (2 months) Bethesda I spent my clinical elective rotation at the NIH/NIAID to learn how to manage patients with rare immunodeficiencies. Given the rarity of these diseases, the management approach was based on experimental molecular therapy designed to specifically target the newly identified immune dysfunction. Clinical and basic research was the foundation of these novel treatments. Clinical Fellow Stanford University School of Medicine July 2012  –  October 2012  (4 months) Stanford Hospital I was seeing patients with allergy or immunodeficiency, under an exemption of the Medical Board of California (exemption 2111), under the supervision of Dr. Sean McGhee, Director of the Allergy and Immunology Fellowship program at Stanford. I became familiar with many conditions such as chronic granulomatous disease, food induced enterocolitis syndrom, toll like receptor deficiency. This experience has confirmed my passion for managing children and adults with Allergy and/or Immunodeficiency. Clinical Research Fellow Stanford University School of Medicine January 2008  –  October 2012  (4 years 10 months) Stanford University School of Medicine In 2008, I returned to Stanford as a post-doctoral fellow to explore the role granulocytes in another atopic disease, food allergy. Under the combined mentorship of Drs. Nadeau, Tirouvanziam, Prs Galli and Herzenberg, I took a leading role in developing direct multi-parameter methods for basophil and eosinophil analysis in whole blood. This work led to several abstracts, publications and patents. I defended my PhD in September 2011, and received the best Honors. At Stanford, now equipped with experience in translational research on CF and allergy, I am currently applying my skills to Cystic Fibrosis-Allergic BronchoPulmonary Aspergillosis (CF-ABPA) under the mentorship of Prof. Moss while performing residency in Internal Medicine. I expect results to lead to a better understanding of CF-ABPA and potentially to the development of a novel, clinically relevant test. Such a test could usher in earlier treatment and better prognosis for CF-ABPA patients. Resident Physician Alameda County Hospital October 2011  – Present (3 years 11 months) Oakland CA, USA I am currently performing my residency in Internal Medicine at Alameda Health System Hospital (Oakland, CA, USA). Meanwhile, I am very fortunate to be a visiting scholar at Stanford to continue my translational research on a longitudinal cohort of patients with ABPA under the mentoring of Dr. Moss (Professor of Pediatrics at the Lucile Salter Packard Children's Hospital) and Dr. Herzenberg (Professor [Research] of Genetics). Resident Physician Alameda County Hospital October 2011  – Present (3 years 11 months) Oakland CA, USA I am currently performing my residency in Internal Medicine at Alameda Health System Hospital (Oakland, CA, USA). Meanwhile, I am very fortunate to be a visiting scholar at Stanford to continue my translational research on a longitudinal cohort of patients with ABPA under the mentoring of Dr. Moss (Professor of Pediatrics at the Lucile Salter Packard Children's Hospital) and Dr. Herzenberg (Professor [Research] of Genetics). Visiting resident Alameda County Hospital April 2014  –  May 2014  (2 months) Bethesda I spent my clinical elective rotation at the NIH/NIAID to learn how to manage patients with rare immunodeficiencies. Given the rarity of these diseases, the management approach was based on experimental molecular therapy designed to specifically target the newly identified immune dysfunction. Clinical and basic research was the foundation of these novel treatments. Visiting resident Alameda County Hospital April 2014  –  May 2014  (2 months) Bethesda I spent my clinical elective rotation at the NIH/NIAID to learn how to manage patients with rare immunodeficiencies. Given the rarity of these diseases, the management approach was based on experimental molecular therapy designed to specifically target the newly identified immune dysfunction. Clinical and basic research was the foundation of these novel treatments. Clinical Fellow Stanford University School of Medicine July 2012  –  October 2012  (4 months) Stanford Hospital I was seeing patients with allergy or immunodeficiency, under an exemption of the Medical Board of California (exemption 2111), under the supervision of Dr. Sean McGhee, Director of the Allergy and Immunology Fellowship program at Stanford. I became familiar with many conditions such as chronic granulomatous disease, food induced enterocolitis syndrom, toll like receptor deficiency. This experience has confirmed my passion for managing children and adults with Allergy and/or Immunodeficiency. Clinical Fellow Stanford University School of Medicine July 2012  –  October 2012  (4 months) Stanford Hospital I was seeing patients with allergy or immunodeficiency, under an exemption of the Medical Board of California (exemption 2111), under the supervision of Dr. Sean McGhee, Director of the Allergy and Immunology Fellowship program at Stanford. I became familiar with many conditions such as chronic granulomatous disease, food induced enterocolitis syndrom, toll like receptor deficiency. This experience has confirmed my passion for managing children and adults with Allergy and/or Immunodeficiency. Clinical Research Fellow Stanford University School of Medicine January 2008  –  October 2012  (4 years 10 months) Stanford University School of Medicine In 2008, I returned to Stanford as a post-doctoral fellow to explore the role granulocytes in another atopic disease, food allergy. Under the combined mentorship of Drs. Nadeau, Tirouvanziam, Prs Galli and Herzenberg, I took a leading role in developing direct multi-parameter methods for basophil and eosinophil analysis in whole blood. This work led to several abstracts, publications and patents. I defended my PhD in September 2011, and received the best Honors. At Stanford, now equipped with experience in translational research on CF and allergy, I am currently applying my skills to Cystic Fibrosis-Allergic BronchoPulmonary Aspergillosis (CF-ABPA) under the mentorship of Prof. Moss while performing residency in Internal Medicine. I expect results to lead to a better understanding of CF-ABPA and potentially to the development of a novel, clinically relevant test. Such a test could usher in earlier treatment and better prognosis for CF-ABPA patients. Clinical Research Fellow Stanford University School of Medicine January 2008  –  October 2012  (4 years 10 months) Stanford University School of Medicine In 2008, I returned to Stanford as a post-doctoral fellow to explore the role granulocytes in another atopic disease, food allergy. Under the combined mentorship of Drs. Nadeau, Tirouvanziam, Prs Galli and Herzenberg, I took a leading role in developing direct multi-parameter methods for basophil and eosinophil analysis in whole blood. This work led to several abstracts, publications and patents. I defended my PhD in September 2011, and received the best Honors. At Stanford, now equipped with experience in translational research on CF and allergy, I am currently applying my skills to Cystic Fibrosis-Allergic BronchoPulmonary Aspergillosis (CF-ABPA) under the mentorship of Prof. Moss while performing residency in Internal Medicine. I expect results to lead to a better understanding of CF-ABPA and potentially to the development of a novel, clinically relevant test. Such a test could usher in earlier treatment and better prognosis for CF-ABPA patients. Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Flow Cytometry In Vitro Medicine Clinical Research Internal Medicine Cell Molecular Biology Cell Biology Transfection Immunology Allergy Western Blotting In Vivo FACS Cell Culture Translational Research Tissue Culture Biotechnology Immunoassays See 4+     See less Skills  Flow Cytometry In Vitro Medicine Clinical Research Internal Medicine Cell Molecular Biology Cell Biology Transfection Immunology Allergy Western Blotting In Vivo FACS Cell Culture Translational Research Tissue Culture Biotechnology Immunoassays See 4+     See less Flow Cytometry In Vitro Medicine Clinical Research Internal Medicine Cell Molecular Biology Cell Biology Transfection Immunology Allergy Western Blotting In Vivo FACS Cell Culture Translational Research Tissue Culture Biotechnology Immunoassays See 4+     See less Flow Cytometry In Vitro Medicine Clinical Research Internal Medicine Cell Molecular Biology Cell Biology Transfection Immunology Allergy Western Blotting In Vivo FACS Cell Culture Translational Research Tissue Culture Biotechnology Immunoassays See 4+     See less Education Marseille,School of medicine PhD,  Imunology/Biology 2008  – 2011 Granulocytes and allergic/inflammatory pulmonary disease Marseilles, School of Medicine MD,  Adult Pulmonary Medicine, residency 2002  – 2008 Activities and Societies:  Residency Marseilles University MSc,  Medicine; Adult Pulmonary Medicine; Health & environment 2008 Montreal School of Medicine Intern 2002  – 2002 Activities and Societies:  Intern in the Hospital Université Denis Diderot (Paris VII) Graduate School, Medicine,  Medicine 1998  – 2002 Marseille,School of medicine PhD,  Imunology/Biology 2008  – 2011 Granulocytes and allergic/inflammatory pulmonary disease Marseille,School of medicine PhD,  Imunology/Biology 2008  – 2011 Granulocytes and allergic/inflammatory pulmonary disease Marseille,School of medicine PhD,  Imunology/Biology 2008  – 2011 Granulocytes and allergic/inflammatory pulmonary disease Marseilles, School of Medicine MD,  Adult Pulmonary Medicine, residency 2002  – 2008 Activities and Societies:  Residency Marseilles, School of Medicine MD,  Adult Pulmonary Medicine, residency 2002  – 2008 Activities and Societies:  Residency Marseilles, School of Medicine MD,  Adult Pulmonary Medicine, residency 2002  – 2008 Activities and Societies:  Residency Marseilles University MSc,  Medicine; Adult Pulmonary Medicine; Health & environment 2008 Marseilles University MSc,  Medicine; Adult Pulmonary Medicine; Health & environment 2008 Marseilles University MSc,  Medicine; Adult Pulmonary Medicine; Health & environment 2008 Montreal School of Medicine Intern 2002  – 2002 Activities and Societies:  Intern in the Hospital Montreal School of Medicine Intern 2002  – 2002 Activities and Societies:  Intern in the Hospital Montreal School of Medicine Intern 2002  – 2002 Activities and Societies:  Intern in the Hospital Université Denis Diderot (Paris VII) Graduate School, Medicine,  Medicine 1998  – 2002 Université Denis Diderot (Paris VII) Graduate School, Medicine,  Medicine 1998  – 2002 Université Denis Diderot (Paris VII) Graduate School, Medicine,  Medicine 1998  – 2002 Honors & Awards Chrysalis Project American Association of Allergy Asthma and Immunology, USA February 2014 Runner up for poster presentation in the Research category at the ACP meeting ACP regional Meeting November 2013 AAAAI Interest Section Fellow in Training Award American Association of Allergy Asthma and Immunology, USA March 2012 Elizabeth Nash Memorial Fellowship CFRI Fellowship August 2011 SPARK/SPECTRUM Award Stanford University School of Medicine) (7 out of 100 applications from Stanford September 2010 McCormick Award Stanford University School of Medicine July 2010 Child Health Research Program Fellowship Packard Foundation, Stanford Medical Center August 2008 Dean Fellowship Stanford University, School of Medicine, USA November 2008 Chrysalis Project American Association of Allergy Asthma and Immunology, USA February 2014 Chrysalis Project American Association of Allergy Asthma and Immunology, USA February 2014 Chrysalis Project American Association of Allergy Asthma and Immunology, USA February 2014 Runner up for poster presentation in the Research category at the ACP meeting ACP regional Meeting November 2013 Runner up for poster presentation in the Research category at the ACP meeting ACP regional Meeting November 2013 Runner up for poster presentation in the Research category at the ACP meeting ACP regional Meeting November 2013 AAAAI Interest Section Fellow in Training Award American Association of Allergy Asthma and Immunology, USA March 2012 AAAAI Interest Section Fellow in Training Award American Association of Allergy Asthma and Immunology, USA March 2012 AAAAI Interest Section Fellow in Training Award American Association of Allergy Asthma and Immunology, USA March 2012 Elizabeth Nash Memorial Fellowship CFRI Fellowship August 2011 Elizabeth Nash Memorial Fellowship CFRI Fellowship August 2011 Elizabeth Nash Memorial Fellowship CFRI Fellowship August 2011 SPARK/SPECTRUM Award Stanford University School of Medicine) (7 out of 100 applications from Stanford September 2010 SPARK/SPECTRUM Award Stanford University School of Medicine) (7 out of 100 applications from Stanford September 2010 SPARK/SPECTRUM Award Stanford University School of Medicine) (7 out of 100 applications from Stanford September 2010 McCormick Award Stanford University School of Medicine July 2010 McCormick Award Stanford University School of Medicine July 2010 McCormick Award Stanford University School of Medicine July 2010 Child Health Research Program Fellowship Packard Foundation, Stanford Medical Center August 2008 Child Health Research Program Fellowship Packard Foundation, Stanford Medical Center August 2008 Child Health Research Program Fellowship Packard Foundation, Stanford Medical Center August 2008 Dean Fellowship Stanford University, School of Medicine, USA November 2008 Dean Fellowship Stanford University, School of Medicine, USA November 2008 Dean Fellowship Stanford University, School of Medicine, USA November 2008 ", "Summary Dr. Shengjun Zhang received his MD from Zhengzhou University in 1984 and his MBA in Health Management from Johns Hopkins University in 2010. He participated in clinical fellowship training at Stanford University Sleep Research Center; five years of cardiology postdoctoral training at NIA/NIH; two years of research experience at UMDNJ/RWJMS. In addition to research experiences, Shengjun worked two years in clinical research project management at Johns Hopkins School of Medicine Department of Oncology and two years of international clinical study in infectious diseases (HIV/AIDS) at Johns Hopkins Hospital (HPTN China study project coordinator). Shengjun also has two years of projects management and business development experience at Westat, Inc. and four years of executive-level project director experience at Frontagelab, Inc. Prior to entering the clinical research and trial, he practiced internal medicine and pulmonary in China for twelve years.  \n \nCurrently, Shengjun serves as director of Clinical Research Center—China for Frontage and a special-appointed professor at Zhengzhou University. Summary Dr. Shengjun Zhang received his MD from Zhengzhou University in 1984 and his MBA in Health Management from Johns Hopkins University in 2010. He participated in clinical fellowship training at Stanford University Sleep Research Center; five years of cardiology postdoctoral training at NIA/NIH; two years of research experience at UMDNJ/RWJMS. In addition to research experiences, Shengjun worked two years in clinical research project management at Johns Hopkins School of Medicine Department of Oncology and two years of international clinical study in infectious diseases (HIV/AIDS) at Johns Hopkins Hospital (HPTN China study project coordinator). Shengjun also has two years of projects management and business development experience at Westat, Inc. and four years of executive-level project director experience at Frontagelab, Inc. Prior to entering the clinical research and trial, he practiced internal medicine and pulmonary in China for twelve years.  \n \nCurrently, Shengjun serves as director of Clinical Research Center—China for Frontage and a special-appointed professor at Zhengzhou University. Dr. Shengjun Zhang received his MD from Zhengzhou University in 1984 and his MBA in Health Management from Johns Hopkins University in 2010. He participated in clinical fellowship training at Stanford University Sleep Research Center; five years of cardiology postdoctoral training at NIA/NIH; two years of research experience at UMDNJ/RWJMS. In addition to research experiences, Shengjun worked two years in clinical research project management at Johns Hopkins School of Medicine Department of Oncology and two years of international clinical study in infectious diseases (HIV/AIDS) at Johns Hopkins Hospital (HPTN China study project coordinator). Shengjun also has two years of projects management and business development experience at Westat, Inc. and four years of executive-level project director experience at Frontagelab, Inc. Prior to entering the clinical research and trial, he practiced internal medicine and pulmonary in China for twelve years.  \n \nCurrently, Shengjun serves as director of Clinical Research Center—China for Frontage and a special-appointed professor at Zhengzhou University. Dr. Shengjun Zhang received his MD from Zhengzhou University in 1984 and his MBA in Health Management from Johns Hopkins University in 2010. He participated in clinical fellowship training at Stanford University Sleep Research Center; five years of cardiology postdoctoral training at NIA/NIH; two years of research experience at UMDNJ/RWJMS. In addition to research experiences, Shengjun worked two years in clinical research project management at Johns Hopkins School of Medicine Department of Oncology and two years of international clinical study in infectious diseases (HIV/AIDS) at Johns Hopkins Hospital (HPTN China study project coordinator). Shengjun also has two years of projects management and business development experience at Westat, Inc. and four years of executive-level project director experience at Frontagelab, Inc. Prior to entering the clinical research and trial, he practiced internal medicine and pulmonary in China for twelve years.  \n \nCurrently, Shengjun serves as director of Clinical Research Center—China for Frontage and a special-appointed professor at Zhengzhou University. Experience Clinical Research Director Frontage Laboratories, Inc January 2008  – Present (7 years 8 months) Preparing to set up clinical research branch for Frontagelab. \nWorking on SOPs and other regulatory binder for Frontagelab. \nBusiness development for Frontagelab. Special Appointed Professor of Zhengzhou University Frontagelab.Inc January 2008  – Present (7 years 8 months) Sr. Clinical Research Associate Westat November 2006  –  January 2008  (1 year 3 months) My currently responsibility is developing and conducting the clinical research projects in China and manage the Westat Beijing office. Major achievements for past half year are at below: HPTN China Project Coordinator Johns Hopkins School of Medicine October 2004  –  December 2006  (2 years 3 months) HPTN 058 study is a phase III randomized controlled trial to evaluate the efficacy of drug treatment in prevention of HIV infection among opiate dependent injectors both in China and Thailand. Senior Research Program Coordinator Johns Hopkins School of Medicine June 2002  –  October 2004  (2 years 5 months) As a senior research program coordinator, I involved the protocol design, burdget, regulatory files and CRF management, database design and management for these studies. Research Scientist III UMDNJ May 2001  –  June 2002  (1 year 2 months) Working as a research scientist, I conducted the broad of cardiovascular research and had three high level scientific publications. Visiting Fellow National Institutes of Health January 1997  –  May 2001  (4 years 5 months) As a visiting postdoctoral fellow, I had gotten strictly training at NIH. The training included the grant application, clinical and basic research protocol design and implementation, and all others. My research interesting was focus on cardiovascular science and aging. There were 10 scientific papers published in high level journal. Visiting Clinical Fellow Stanford University June 1996  –  January 1997  (8 months) As a visiting clinical fellow, I had conducted the cardiovascular research on sleep apnea at best the sleep research laboratory around the world. Clinical Research Director Frontage Laboratories, Inc January 2008  – Present (7 years 8 months) Preparing to set up clinical research branch for Frontagelab. \nWorking on SOPs and other regulatory binder for Frontagelab. \nBusiness development for Frontagelab. Clinical Research Director Frontage Laboratories, Inc January 2008  – Present (7 years 8 months) Preparing to set up clinical research branch for Frontagelab. \nWorking on SOPs and other regulatory binder for Frontagelab. \nBusiness development for Frontagelab. Special Appointed Professor of Zhengzhou University Frontagelab.Inc January 2008  – Present (7 years 8 months) Special Appointed Professor of Zhengzhou University Frontagelab.Inc January 2008  – Present (7 years 8 months) Sr. Clinical Research Associate Westat November 2006  –  January 2008  (1 year 3 months) My currently responsibility is developing and conducting the clinical research projects in China and manage the Westat Beijing office. Major achievements for past half year are at below: Sr. Clinical Research Associate Westat November 2006  –  January 2008  (1 year 3 months) My currently responsibility is developing and conducting the clinical research projects in China and manage the Westat Beijing office. Major achievements for past half year are at below: HPTN China Project Coordinator Johns Hopkins School of Medicine October 2004  –  December 2006  (2 years 3 months) HPTN 058 study is a phase III randomized controlled trial to evaluate the efficacy of drug treatment in prevention of HIV infection among opiate dependent injectors both in China and Thailand. HPTN China Project Coordinator Johns Hopkins School of Medicine October 2004  –  December 2006  (2 years 3 months) HPTN 058 study is a phase III randomized controlled trial to evaluate the efficacy of drug treatment in prevention of HIV infection among opiate dependent injectors both in China and Thailand. Senior Research Program Coordinator Johns Hopkins School of Medicine June 2002  –  October 2004  (2 years 5 months) As a senior research program coordinator, I involved the protocol design, burdget, regulatory files and CRF management, database design and management for these studies. Senior Research Program Coordinator Johns Hopkins School of Medicine June 2002  –  October 2004  (2 years 5 months) As a senior research program coordinator, I involved the protocol design, burdget, regulatory files and CRF management, database design and management for these studies. Research Scientist III UMDNJ May 2001  –  June 2002  (1 year 2 months) Working as a research scientist, I conducted the broad of cardiovascular research and had three high level scientific publications. Research Scientist III UMDNJ May 2001  –  June 2002  (1 year 2 months) Working as a research scientist, I conducted the broad of cardiovascular research and had three high level scientific publications. Visiting Fellow National Institutes of Health January 1997  –  May 2001  (4 years 5 months) As a visiting postdoctoral fellow, I had gotten strictly training at NIH. The training included the grant application, clinical and basic research protocol design and implementation, and all others. My research interesting was focus on cardiovascular science and aging. There were 10 scientific papers published in high level journal. Visiting Fellow National Institutes of Health January 1997  –  May 2001  (4 years 5 months) As a visiting postdoctoral fellow, I had gotten strictly training at NIH. The training included the grant application, clinical and basic research protocol design and implementation, and all others. My research interesting was focus on cardiovascular science and aging. There were 10 scientific papers published in high level journal. Visiting Clinical Fellow Stanford University June 1996  –  January 1997  (8 months) As a visiting clinical fellow, I had conducted the cardiovascular research on sleep apnea at best the sleep research laboratory around the world. Visiting Clinical Fellow Stanford University June 1996  –  January 1997  (8 months) As a visiting clinical fellow, I had conducted the cardiovascular research on sleep apnea at best the sleep research laboratory around the world. Education The Johns Hopkins University - Carey Business School MBA,  Health Management 2003  – 2008 Zhengzhou University Bachelor of Medicine (Equal to M.D.),  Medicine 1979  – 1984 The Johns Hopkins University - Carey Business School MBA,  Health Management 2003  – 2008 The Johns Hopkins University - Carey Business School MBA,  Health Management 2003  – 2008 The Johns Hopkins University - Carey Business School MBA,  Health Management 2003  – 2008 Zhengzhou University Bachelor of Medicine (Equal to M.D.),  Medicine 1979  – 1984 Zhengzhou University Bachelor of Medicine (Equal to M.D.),  Medicine 1979  – 1984 Zhengzhou University Bachelor of Medicine (Equal to M.D.),  Medicine 1979  – 1984 ", "Summary Specialties:Neurovascular disease \nVertebroplasty for vertebral compression fracture Summary Specialties:Neurovascular disease \nVertebroplasty for vertebral compression fracture Specialties:Neurovascular disease \nVertebroplasty for vertebral compression fracture Specialties:Neurovascular disease \nVertebroplasty for vertebral compression fracture Experience MD Jikei University Hospital Clinical Fellow Stanford University Hospital March 2003  –  July 2006  (3 years 5 months) Research and Clinical Fellow Stanford University 2003  –  2006  (3 years) MD Jikei University Hospital MD Jikei University Hospital Clinical Fellow Stanford University Hospital March 2003  –  July 2006  (3 years 5 months) Clinical Fellow Stanford University Hospital March 2003  –  July 2006  (3 years 5 months) Research and Clinical Fellow Stanford University 2003  –  2006  (3 years) Research and Clinical Fellow Stanford University 2003  –  2006  (3 years) Skills Clinical Research Medicine Surgery Neuroscience Medical Education Medical Research Emergency Medicine Skills  Clinical Research Medicine Surgery Neuroscience Medical Education Medical Research Emergency Medicine Clinical Research Medicine Surgery Neuroscience Medical Education Medical Research Emergency Medicine Clinical Research Medicine Surgery Neuroscience Medical Education Medical Research Emergency Medicine Education The Jikei University MD,  Medical 1992  – 1998 The Jikei University MD,  Medical 1992  – 1998 The Jikei University MD,  Medical 1992  – 1998 The Jikei University MD,  Medical 1992  – 1998 ", "Summary I am a licensed clinical and consulting psychologist who is currently working full-time in private practice in San Francisco's Financial district. I provide short and long term psychodynamic, and cognitive behavioral psychotherapy to adolescents, adults, couples and families. I left the University of California, San Francisco's Faculty and Staff Assistance Program to pursue my long-term dream of working in private practice.  \n \nI have a strong commitment to understanding diversity and how culture impacts the choices individuals make. In addition, I continue to seek knowledge concerning the interrelatedness of health, illness, and behavior, emotional resiliency, the process of healing, and social influences.  \n \nFurthermore I continue to explore and believe in the importance of knowing thyself. I truly believe the journey begins within the self, the more we commit to knowing and accepting ourselves, the more we are able to have healthy relationships because we have nothing to hide and nothing to feel ashamed of. Interpersonal relationships can elicit our most primitive feelings. Learning how to relax into our feelings and open a space to explore and understand what our feelings teach us, we will not be as afraid to be open, and honest regardless of the outcome. \n \nSpecialties: Psychodynamic Psychotherapy, Cognitive Behavioral Therapy, Client-Centered Psychotherapy, Dynamic Brief Therapy Models, Dialectical Behavioral Therapy with a focus on somatic awareness. Specialized training in Mood Disorders, Substance Abuse, Stress Reduction, Emotional Intelligence, Depression, and Anxiety Disorders. Summary I am a licensed clinical and consulting psychologist who is currently working full-time in private practice in San Francisco's Financial district. I provide short and long term psychodynamic, and cognitive behavioral psychotherapy to adolescents, adults, couples and families. I left the University of California, San Francisco's Faculty and Staff Assistance Program to pursue my long-term dream of working in private practice.  \n \nI have a strong commitment to understanding diversity and how culture impacts the choices individuals make. In addition, I continue to seek knowledge concerning the interrelatedness of health, illness, and behavior, emotional resiliency, the process of healing, and social influences.  \n \nFurthermore I continue to explore and believe in the importance of knowing thyself. I truly believe the journey begins within the self, the more we commit to knowing and accepting ourselves, the more we are able to have healthy relationships because we have nothing to hide and nothing to feel ashamed of. Interpersonal relationships can elicit our most primitive feelings. Learning how to relax into our feelings and open a space to explore and understand what our feelings teach us, we will not be as afraid to be open, and honest regardless of the outcome. \n \nSpecialties: Psychodynamic Psychotherapy, Cognitive Behavioral Therapy, Client-Centered Psychotherapy, Dynamic Brief Therapy Models, Dialectical Behavioral Therapy with a focus on somatic awareness. Specialized training in Mood Disorders, Substance Abuse, Stress Reduction, Emotional Intelligence, Depression, and Anxiety Disorders. I am a licensed clinical and consulting psychologist who is currently working full-time in private practice in San Francisco's Financial district. I provide short and long term psychodynamic, and cognitive behavioral psychotherapy to adolescents, adults, couples and families. I left the University of California, San Francisco's Faculty and Staff Assistance Program to pursue my long-term dream of working in private practice.  \n \nI have a strong commitment to understanding diversity and how culture impacts the choices individuals make. In addition, I continue to seek knowledge concerning the interrelatedness of health, illness, and behavior, emotional resiliency, the process of healing, and social influences.  \n \nFurthermore I continue to explore and believe in the importance of knowing thyself. I truly believe the journey begins within the self, the more we commit to knowing and accepting ourselves, the more we are able to have healthy relationships because we have nothing to hide and nothing to feel ashamed of. Interpersonal relationships can elicit our most primitive feelings. Learning how to relax into our feelings and open a space to explore and understand what our feelings teach us, we will not be as afraid to be open, and honest regardless of the outcome. \n \nSpecialties: Psychodynamic Psychotherapy, Cognitive Behavioral Therapy, Client-Centered Psychotherapy, Dynamic Brief Therapy Models, Dialectical Behavioral Therapy with a focus on somatic awareness. Specialized training in Mood Disorders, Substance Abuse, Stress Reduction, Emotional Intelligence, Depression, and Anxiety Disorders. I am a licensed clinical and consulting psychologist who is currently working full-time in private practice in San Francisco's Financial district. I provide short and long term psychodynamic, and cognitive behavioral psychotherapy to adolescents, adults, couples and families. I left the University of California, San Francisco's Faculty and Staff Assistance Program to pursue my long-term dream of working in private practice.  \n \nI have a strong commitment to understanding diversity and how culture impacts the choices individuals make. In addition, I continue to seek knowledge concerning the interrelatedness of health, illness, and behavior, emotional resiliency, the process of healing, and social influences.  \n \nFurthermore I continue to explore and believe in the importance of knowing thyself. I truly believe the journey begins within the self, the more we commit to knowing and accepting ourselves, the more we are able to have healthy relationships because we have nothing to hide and nothing to feel ashamed of. Interpersonal relationships can elicit our most primitive feelings. Learning how to relax into our feelings and open a space to explore and understand what our feelings teach us, we will not be as afraid to be open, and honest regardless of the outcome. \n \nSpecialties: Psychodynamic Psychotherapy, Cognitive Behavioral Therapy, Client-Centered Psychotherapy, Dynamic Brief Therapy Models, Dialectical Behavioral Therapy with a focus on somatic awareness. Specialized training in Mood Disorders, Substance Abuse, Stress Reduction, Emotional Intelligence, Depression, and Anxiety Disorders. Experience Clinical and Consulting Psychologist in Private Practice Michelle Sokoloff, Psy.D. June 2008  – Present (7 years 3 months) Providing culturally informed dynamic, client-centered, psychotherapy to individuals and couples utilizing schema, cognitive and behavioral therapies. \n \nSpecialty Focus: \n \nMood disorders (depression and anxiety) \nPersonality disorders \nSubstance abuse and dependence \nBody image/disordered eating \nlife transitions, and career exploration \nADHD/ADD/Learning disorders Clinical Psychologist University of California, San Francisco June 2008  –  February 2013  (4 years 9 months) Providing culturally informed time-limited therapy, organizational interventions and consultations, team-building, outreach, and presentations to the University of California, San Francisco's faculty and staff. Postdoctorate UCSF February 2007  –  February 2008  (1 year 1 month) Provided short term psychodynamic and cognitive-behaviorally therapy. Clients presented with Axis I, II, III, and IV disorders including acute suicidality, Impulse control disorders, substance abuse, depression, anxiety, severe eating disorders, psychotic disorders, personality disorders, layoffs, transitions,and were from diverse ethnic backgrounds including: African American, Latino,  \nAsian American, Native American, and Euro American. Provided consultation to managers and supervisors in dealing with workplace  \nconcerns related to the department. Conducted assessments, crisis intervention and after-hour on call services monthly. Clinical Fellow Stanford University, Counseling and Psychological Services 2005  –  2006  (1 year) Provided short and long-term insight oriented psychotherapy to Stanford University undergraduate and graduate students which included working with individuals, and couples. Collaborated with staff psychologists, psychiatrists, physicians and nurses using a multidisciplinary approach. Provided outreach to different departments on campus, and facilitated Stress Management group for undergraduate and graduate students. Appointed Fellow Liaison to staff to facilitate communication, planning and program development. Therapist Community Counseling Education Center, Fremont, CA Mental Health Services July 2004  –  August 2005  (1 year 2 months) Provided insight oriented psychotherapy to families, children, adults, and couples, focusing on Axis I, and Axis II diagnoses, with an emphasis on community members with minimal social and economic resources. Conducted assessments on college students, children and adult referrals from the community. These included court ordered evaluations, caregiver competence, bonding and attachment studies, treatment planning, and placement recommendations. Worked as part of an interdisciplinary team throughout various departments within the medical setting to provide psychological interventions and consultation with patients, psychiatrists, and physicians. Interacted with various managed care companies when necessary for reimbursement and continuation of services. \nTests administered included: \nMMPI-2\tWAIS-III \nRorschach (Exner system)\tWMS-III  \nTAT\tWRAT-3 \nTrail Making Test\tMMPI-2 \nBender Gestalt\tMCMI-III \nKBIT\tPAI Therapist The Wright Institute September 2003  –  September 2004  (1 year 1 month) Provided adults with long term and brief psychodynamically oriented psychotherapy and cognitive behavioral therapy on a sliding-scale basis. The clinic served university students, adults and couples from around the community, from diverse ethnic and socioeconomic backgrounds and presented with a wide range of diagnoses, including sexual identity issues, adjustment, character and mood disorders, psychosis, and substance abuse issues. Residential Therapist Horizon Services Residential Treatment, Hayward, CA September 2002  –  July 2003  (11 months) Intake evaluations, individual and group psychotherapy for the treatment of chemically dependent and dual diagnosis clients. Provided insight oriented psychodynamic and cognitive-behaviorally long term and brief therapy. Facilitated weekly therapy groups and co-facilitated a weekly women’s group. Clients presented with Axis I, II, III, and IV disorders including acute suicidality, impulse control disorders, substance abuse, depression, anxiety, schizophrenia,  \nand Hepatitis status and were from diverse ethnic backgrounds including: African American, Latino, Asian American, Native American, and Euro American. Certified by facility in Conflict Resolution, and Anger management. Therapist Kappa Continuation High School, Richmond, CA September 2001  –  June 2002  (10 months) Counseled at-risk and in-crisis adolescents. Provided milieu therapy to high-risk adolescents in a high school setting. Worked closely with teachers and other service providers. Clients presented with developmental transitions, relationship problems, and oppositional behaviors. Worked closely with counselor to ensure that educational and career goals were met. Organized two after school programs focusing on career building and future goals. Clinical and Consulting Psychologist in Private Practice Michelle Sokoloff, Psy.D. June 2008  – Present (7 years 3 months) Providing culturally informed dynamic, client-centered, psychotherapy to individuals and couples utilizing schema, cognitive and behavioral therapies. \n \nSpecialty Focus: \n \nMood disorders (depression and anxiety) \nPersonality disorders \nSubstance abuse and dependence \nBody image/disordered eating \nlife transitions, and career exploration \nADHD/ADD/Learning disorders Clinical and Consulting Psychologist in Private Practice Michelle Sokoloff, Psy.D. June 2008  – Present (7 years 3 months) Providing culturally informed dynamic, client-centered, psychotherapy to individuals and couples utilizing schema, cognitive and behavioral therapies. \n \nSpecialty Focus: \n \nMood disorders (depression and anxiety) \nPersonality disorders \nSubstance abuse and dependence \nBody image/disordered eating \nlife transitions, and career exploration \nADHD/ADD/Learning disorders Clinical Psychologist University of California, San Francisco June 2008  –  February 2013  (4 years 9 months) Providing culturally informed time-limited therapy, organizational interventions and consultations, team-building, outreach, and presentations to the University of California, San Francisco's faculty and staff. Clinical Psychologist University of California, San Francisco June 2008  –  February 2013  (4 years 9 months) Providing culturally informed time-limited therapy, organizational interventions and consultations, team-building, outreach, and presentations to the University of California, San Francisco's faculty and staff. Postdoctorate UCSF February 2007  –  February 2008  (1 year 1 month) Provided short term psychodynamic and cognitive-behaviorally therapy. Clients presented with Axis I, II, III, and IV disorders including acute suicidality, Impulse control disorders, substance abuse, depression, anxiety, severe eating disorders, psychotic disorders, personality disorders, layoffs, transitions,and were from diverse ethnic backgrounds including: African American, Latino,  \nAsian American, Native American, and Euro American. Provided consultation to managers and supervisors in dealing with workplace  \nconcerns related to the department. Conducted assessments, crisis intervention and after-hour on call services monthly. Postdoctorate UCSF February 2007  –  February 2008  (1 year 1 month) Provided short term psychodynamic and cognitive-behaviorally therapy. Clients presented with Axis I, II, III, and IV disorders including acute suicidality, Impulse control disorders, substance abuse, depression, anxiety, severe eating disorders, psychotic disorders, personality disorders, layoffs, transitions,and were from diverse ethnic backgrounds including: African American, Latino,  \nAsian American, Native American, and Euro American. Provided consultation to managers and supervisors in dealing with workplace  \nconcerns related to the department. Conducted assessments, crisis intervention and after-hour on call services monthly. Clinical Fellow Stanford University, Counseling and Psychological Services 2005  –  2006  (1 year) Provided short and long-term insight oriented psychotherapy to Stanford University undergraduate and graduate students which included working with individuals, and couples. Collaborated with staff psychologists, psychiatrists, physicians and nurses using a multidisciplinary approach. Provided outreach to different departments on campus, and facilitated Stress Management group for undergraduate and graduate students. Appointed Fellow Liaison to staff to facilitate communication, planning and program development. Clinical Fellow Stanford University, Counseling and Psychological Services 2005  –  2006  (1 year) Provided short and long-term insight oriented psychotherapy to Stanford University undergraduate and graduate students which included working with individuals, and couples. Collaborated with staff psychologists, psychiatrists, physicians and nurses using a multidisciplinary approach. Provided outreach to different departments on campus, and facilitated Stress Management group for undergraduate and graduate students. Appointed Fellow Liaison to staff to facilitate communication, planning and program development. Therapist Community Counseling Education Center, Fremont, CA Mental Health Services July 2004  –  August 2005  (1 year 2 months) Provided insight oriented psychotherapy to families, children, adults, and couples, focusing on Axis I, and Axis II diagnoses, with an emphasis on community members with minimal social and economic resources. Conducted assessments on college students, children and adult referrals from the community. These included court ordered evaluations, caregiver competence, bonding and attachment studies, treatment planning, and placement recommendations. Worked as part of an interdisciplinary team throughout various departments within the medical setting to provide psychological interventions and consultation with patients, psychiatrists, and physicians. Interacted with various managed care companies when necessary for reimbursement and continuation of services. \nTests administered included: \nMMPI-2\tWAIS-III \nRorschach (Exner system)\tWMS-III  \nTAT\tWRAT-3 \nTrail Making Test\tMMPI-2 \nBender Gestalt\tMCMI-III \nKBIT\tPAI Therapist Community Counseling Education Center, Fremont, CA Mental Health Services July 2004  –  August 2005  (1 year 2 months) Provided insight oriented psychotherapy to families, children, adults, and couples, focusing on Axis I, and Axis II diagnoses, with an emphasis on community members with minimal social and economic resources. Conducted assessments on college students, children and adult referrals from the community. These included court ordered evaluations, caregiver competence, bonding and attachment studies, treatment planning, and placement recommendations. Worked as part of an interdisciplinary team throughout various departments within the medical setting to provide psychological interventions and consultation with patients, psychiatrists, and physicians. Interacted with various managed care companies when necessary for reimbursement and continuation of services. \nTests administered included: \nMMPI-2\tWAIS-III \nRorschach (Exner system)\tWMS-III  \nTAT\tWRAT-3 \nTrail Making Test\tMMPI-2 \nBender Gestalt\tMCMI-III \nKBIT\tPAI Therapist The Wright Institute September 2003  –  September 2004  (1 year 1 month) Provided adults with long term and brief psychodynamically oriented psychotherapy and cognitive behavioral therapy on a sliding-scale basis. The clinic served university students, adults and couples from around the community, from diverse ethnic and socioeconomic backgrounds and presented with a wide range of diagnoses, including sexual identity issues, adjustment, character and mood disorders, psychosis, and substance abuse issues. Therapist The Wright Institute September 2003  –  September 2004  (1 year 1 month) Provided adults with long term and brief psychodynamically oriented psychotherapy and cognitive behavioral therapy on a sliding-scale basis. The clinic served university students, adults and couples from around the community, from diverse ethnic and socioeconomic backgrounds and presented with a wide range of diagnoses, including sexual identity issues, adjustment, character and mood disorders, psychosis, and substance abuse issues. Residential Therapist Horizon Services Residential Treatment, Hayward, CA September 2002  –  July 2003  (11 months) Intake evaluations, individual and group psychotherapy for the treatment of chemically dependent and dual diagnosis clients. Provided insight oriented psychodynamic and cognitive-behaviorally long term and brief therapy. Facilitated weekly therapy groups and co-facilitated a weekly women’s group. Clients presented with Axis I, II, III, and IV disorders including acute suicidality, impulse control disorders, substance abuse, depression, anxiety, schizophrenia,  \nand Hepatitis status and were from diverse ethnic backgrounds including: African American, Latino, Asian American, Native American, and Euro American. Certified by facility in Conflict Resolution, and Anger management. Residential Therapist Horizon Services Residential Treatment, Hayward, CA September 2002  –  July 2003  (11 months) Intake evaluations, individual and group psychotherapy for the treatment of chemically dependent and dual diagnosis clients. Provided insight oriented psychodynamic and cognitive-behaviorally long term and brief therapy. Facilitated weekly therapy groups and co-facilitated a weekly women’s group. Clients presented with Axis I, II, III, and IV disorders including acute suicidality, impulse control disorders, substance abuse, depression, anxiety, schizophrenia,  \nand Hepatitis status and were from diverse ethnic backgrounds including: African American, Latino, Asian American, Native American, and Euro American. Certified by facility in Conflict Resolution, and Anger management. Therapist Kappa Continuation High School, Richmond, CA September 2001  –  June 2002  (10 months) Counseled at-risk and in-crisis adolescents. Provided milieu therapy to high-risk adolescents in a high school setting. Worked closely with teachers and other service providers. Clients presented with developmental transitions, relationship problems, and oppositional behaviors. Worked closely with counselor to ensure that educational and career goals were met. Organized two after school programs focusing on career building and future goals. Therapist Kappa Continuation High School, Richmond, CA September 2001  –  June 2002  (10 months) Counseled at-risk and in-crisis adolescents. Provided milieu therapy to high-risk adolescents in a high school setting. Worked closely with teachers and other service providers. Clients presented with developmental transitions, relationship problems, and oppositional behaviors. Worked closely with counselor to ensure that educational and career goals were met. Organized two after school programs focusing on career building and future goals. Skills Group Therapy Psychotherapy Family Therapy CBT Adolescents Psychology Crisis Intervention Life Transitions Treatment Anger Management Therapists Stress Management Clinical Research Program Development DBT Interventions Psychodynamic... Cognition Dual Diagnosis Conflict Resolution Clinical Psychology Psychological Assessment Google Groups See 8+     See less Skills  Group Therapy Psychotherapy Family Therapy CBT Adolescents Psychology Crisis Intervention Life Transitions Treatment Anger Management Therapists Stress Management Clinical Research Program Development DBT Interventions Psychodynamic... Cognition Dual Diagnosis Conflict Resolution Clinical Psychology Psychological Assessment Google Groups See 8+     See less Group Therapy Psychotherapy Family Therapy CBT Adolescents Psychology Crisis Intervention Life Transitions Treatment Anger Management Therapists Stress Management Clinical Research Program Development DBT Interventions Psychodynamic... Cognition Dual Diagnosis Conflict Resolution Clinical Psychology Psychological Assessment Google Groups See 8+     See less Group Therapy Psychotherapy Family Therapy CBT Adolescents Psychology Crisis Intervention Life Transitions Treatment Anger Management Therapists Stress Management Clinical Research Program Development DBT Interventions Psychodynamic... Cognition Dual Diagnosis Conflict Resolution Clinical Psychology Psychological Assessment Google Groups See 8+     See less Education The Wright Institute Psy.D.,  Clinical Psychology 2002  – 2006 The Wright Institute M.A.,  Clinical Psychology 2002  – 2006 Univeristy of Oregon B.A.,  Sociology 1994  – 1998 The Wright Institute Psy.D.,  Clinical Psychology 2002  – 2006 The Wright Institute Psy.D.,  Clinical Psychology 2002  – 2006 The Wright Institute Psy.D.,  Clinical Psychology 2002  – 2006 The Wright Institute M.A.,  Clinical Psychology 2002  – 2006 The Wright Institute M.A.,  Clinical Psychology 2002  – 2006 The Wright Institute M.A.,  Clinical Psychology 2002  – 2006 Univeristy of Oregon B.A.,  Sociology 1994  – 1998 Univeristy of Oregon B.A.,  Sociology 1994  – 1998 Univeristy of Oregon B.A.,  Sociology 1994  – 1998 ", "Experience Founder, Chief Medical/Scientific Officer Kine Design, Inc March 2015  – Present (6 months) Emeryville, CA CEO MH Ware, LLC March 2015  – Present (6 months) Palo Alto, CA Healthcare and Science Consulting California Institute for Regenerative Medicine Clinical Fellow Stanford University School of Medicine October 2014  – Present (11 months) Institute for Stem Cell Biology and Regenerative Medicine Founder, Chief Medical/Scientific Officer Kine Design, Inc March 2015  – Present (6 months) Emeryville, CA Founder, Chief Medical/Scientific Officer Kine Design, Inc March 2015  – Present (6 months) Emeryville, CA CEO MH Ware, LLC March 2015  – Present (6 months) Palo Alto, CA Healthcare and Science Consulting CEO MH Ware, LLC March 2015  – Present (6 months) Palo Alto, CA Healthcare and Science Consulting California Institute for Regenerative Medicine Clinical Fellow Stanford University School of Medicine October 2014  – Present (11 months) Institute for Stem Cell Biology and Regenerative Medicine California Institute for Regenerative Medicine Clinical Fellow Stanford University School of Medicine October 2014  – Present (11 months) Institute for Stem Cell Biology and Regenerative Medicine Languages English Korean Spanish English Korean Spanish English Korean Spanish Skills Molecular Biology Skills  Molecular Biology Molecular Biology Molecular Biology Education Stanford University Post-Doctoral Fellowship,  Division of Plastic Surgery, Department of Surgery 2012  – 2016 University of Hawaii John A. Burns School of Medicine Surgical Resident,  General Surgery Residency Program 2010  – 2012 New York Medical College Doctor of Medicine (M.D.),  Medicine 2005  – 2010 New York Medical College Master of Public Health (MPH),  Health Policy and Management 2005  – 2010 Georgetown University Master's Degree,  Physiology and Biophysics 2004  – 2005 University of California, Los Angeles Bachelor's Degree,  Biochemistry with Computing Specialization 1999  – 2003 Mission Viejo High School 1995  – 1999 Stanford University Post-Doctoral Fellowship,  Division of Plastic Surgery, Department of Surgery 2012  – 2016 Stanford University Post-Doctoral Fellowship,  Division of Plastic Surgery, Department of Surgery 2012  – 2016 Stanford University Post-Doctoral Fellowship,  Division of Plastic Surgery, Department of Surgery 2012  – 2016 University of Hawaii John A. Burns School of Medicine Surgical Resident,  General Surgery Residency Program 2010  – 2012 University of Hawaii John A. Burns School of Medicine Surgical Resident,  General Surgery Residency Program 2010  – 2012 University of Hawaii John A. Burns School of Medicine Surgical Resident,  General Surgery Residency Program 2010  – 2012 New York Medical College Doctor of Medicine (M.D.),  Medicine 2005  – 2010 New York Medical College Doctor of Medicine (M.D.),  Medicine 2005  – 2010 New York Medical College Doctor of Medicine (M.D.),  Medicine 2005  – 2010 New York Medical College Master of Public Health (MPH),  Health Policy and Management 2005  – 2010 New York Medical College Master of Public Health (MPH),  Health Policy and Management 2005  – 2010 New York Medical College Master of Public Health (MPH),  Health Policy and Management 2005  – 2010 Georgetown University Master's Degree,  Physiology and Biophysics 2004  – 2005 Georgetown University Master's Degree,  Physiology and Biophysics 2004  – 2005 Georgetown University Master's Degree,  Physiology and Biophysics 2004  – 2005 University of California, Los Angeles Bachelor's Degree,  Biochemistry with Computing Specialization 1999  – 2003 University of California, Los Angeles Bachelor's Degree,  Biochemistry with Computing Specialization 1999  – 2003 University of California, Los Angeles Bachelor's Degree,  Biochemistry with Computing Specialization 1999  – 2003 Mission Viejo High School 1995  – 1999 Mission Viejo High School 1995  – 1999 Mission Viejo High School 1995  – 1999 ", "Experience M.D. Nephrology and Internal Medicine Samaritan House Clinic Redwood City May 2015  – Present (4 months) Redwood City, California Volunteer in nephrology and internal medicine M.D. self employed 2007  – Present (8 years) Portola Valley, CA Board Certified Internal Medicine and Nephrology \nConsultant in Kidneys Disease, Hypertension, Prevention of progression of Chronic Kidney Disease, Hemodialysis and Peritoneal Dialysis. Medical Advisory Board Keas 2007  –  2012  (5 years) assitant Professor of medicine UCSF December 1998  –  December 2005  (7 years 1 month) Principal Consultant Pfizer 2000  –  2004  (4 years) San Francisco Consultant Amgen 2000  –  2004  (4 years) San Francisco Bay Area Principal Consultant Merck 2000  –  2004  (4 years) San Francisco Bay Area M.D., Research Nephrology Fellow, NKF Fellow Stanford University 1997  –  1999  (2 years) Brian Myers Lab, Stanford University, School of Medicine M.D., Clinical Fellow Stanford University 1996  –  1996  (less than a year) Stanford University, School of Medicine M.D. Kaiser Permanente 1994  –  1996  (2 years) M.D. Kaiser Permanente 1994  –  1996  (2 years) Medical Student Université Rene Descartes 1981  –  1985  (4 years) Paris Area, France M.D. Nephrology and Internal Medicine Samaritan House Clinic Redwood City May 2015  – Present (4 months) Redwood City, California Volunteer in nephrology and internal medicine M.D. Nephrology and Internal Medicine Samaritan House Clinic Redwood City May 2015  – Present (4 months) Redwood City, California Volunteer in nephrology and internal medicine M.D. self employed 2007  – Present (8 years) Portola Valley, CA Board Certified Internal Medicine and Nephrology \nConsultant in Kidneys Disease, Hypertension, Prevention of progression of Chronic Kidney Disease, Hemodialysis and Peritoneal Dialysis. M.D. self employed 2007  – Present (8 years) Portola Valley, CA Board Certified Internal Medicine and Nephrology \nConsultant in Kidneys Disease, Hypertension, Prevention of progression of Chronic Kidney Disease, Hemodialysis and Peritoneal Dialysis. Medical Advisory Board Keas 2007  –  2012  (5 years) Medical Advisory Board Keas 2007  –  2012  (5 years) assitant Professor of medicine UCSF December 1998  –  December 2005  (7 years 1 month) assitant Professor of medicine UCSF December 1998  –  December 2005  (7 years 1 month) Principal Consultant Pfizer 2000  –  2004  (4 years) San Francisco Principal Consultant Pfizer 2000  –  2004  (4 years) San Francisco Consultant Amgen 2000  –  2004  (4 years) San Francisco Bay Area Consultant Amgen 2000  –  2004  (4 years) San Francisco Bay Area Principal Consultant Merck 2000  –  2004  (4 years) San Francisco Bay Area Principal Consultant Merck 2000  –  2004  (4 years) San Francisco Bay Area M.D., Research Nephrology Fellow, NKF Fellow Stanford University 1997  –  1999  (2 years) Brian Myers Lab, Stanford University, School of Medicine M.D., Research Nephrology Fellow, NKF Fellow Stanford University 1997  –  1999  (2 years) Brian Myers Lab, Stanford University, School of Medicine M.D., Clinical Fellow Stanford University 1996  –  1996  (less than a year) Stanford University, School of Medicine M.D., Clinical Fellow Stanford University 1996  –  1996  (less than a year) Stanford University, School of Medicine M.D. Kaiser Permanente 1994  –  1996  (2 years) M.D. Kaiser Permanente 1994  –  1996  (2 years) M.D. Kaiser Permanente 1994  –  1996  (2 years) M.D. Kaiser Permanente 1994  –  1996  (2 years) Medical Student Université Rene Descartes 1981  –  1985  (4 years) Paris Area, France Medical Student Université Rene Descartes 1981  –  1985  (4 years) Paris Area, France Languages English Native or bilingual proficiency French Native or bilingual proficiency Farsi Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Native or bilingual proficiency Farsi Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Native or bilingual proficiency Farsi Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Nephrology Hemodialysis Medicine Hypertension Board Certified Internal Medicine Healthcare Peritoneal Dialysis Entrepreneurship Clinical Research Medical Education Clinical Development Mentoring Medical Ethics Fundraising Hypertension in... See 1+     See less Skills  Nephrology Hemodialysis Medicine Hypertension Board Certified Internal Medicine Healthcare Peritoneal Dialysis Entrepreneurship Clinical Research Medical Education Clinical Development Mentoring Medical Ethics Fundraising Hypertension in... See 1+     See less Nephrology Hemodialysis Medicine Hypertension Board Certified Internal Medicine Healthcare Peritoneal Dialysis Entrepreneurship Clinical Research Medical Education Clinical Development Mentoring Medical Ethics Fundraising Hypertension in... See 1+     See less Nephrology Hemodialysis Medicine Hypertension Board Certified Internal Medicine Healthcare Peritoneal Dialysis Entrepreneurship Clinical Research Medical Education Clinical Development Mentoring Medical Ethics Fundraising Hypertension in... See 1+     See less Education Stanford University School of Medicine Post Doctorate Fellowship Nephrology,  Board Certification in Nephrology, November 2008 1996  – 1999 96-97: Clinical Nephrology, Hemodialysis, Peritoneal dialysis, Transplant Nephrology at Stanford University Medical Center \n97-99: Nephrology Research with Professor Brian Myers: Preeclampsia and kidney physiology during pregnancy, Ig A Nephropathy, Membranous Nephropathy. Faculte de Medecine, Universite Rene Descartes, Paris V Doctor of Medicine (M.D.),  Medicine 1980  – 1990 http://www.univ-paris5.fr Lycée Estienne d'Orves High School,  Baccalauréat C Mathématiques et Physique , Mention Bien 1974  – 1978 http://estiennedorves.net/web/lycee/presentation Lycée Razi Stanford University School of Medicine Post Doctorate Fellowship Nephrology,  Board Certification in Nephrology, November 2008 1996  – 1999 96-97: Clinical Nephrology, Hemodialysis, Peritoneal dialysis, Transplant Nephrology at Stanford University Medical Center \n97-99: Nephrology Research with Professor Brian Myers: Preeclampsia and kidney physiology during pregnancy, Ig A Nephropathy, Membranous Nephropathy. Stanford University School of Medicine Post Doctorate Fellowship Nephrology,  Board Certification in Nephrology, November 2008 1996  – 1999 96-97: Clinical Nephrology, Hemodialysis, Peritoneal dialysis, Transplant Nephrology at Stanford University Medical Center \n97-99: Nephrology Research with Professor Brian Myers: Preeclampsia and kidney physiology during pregnancy, Ig A Nephropathy, Membranous Nephropathy. Stanford University School of Medicine Post Doctorate Fellowship Nephrology,  Board Certification in Nephrology, November 2008 1996  – 1999 96-97: Clinical Nephrology, Hemodialysis, Peritoneal dialysis, Transplant Nephrology at Stanford University Medical Center \n97-99: Nephrology Research with Professor Brian Myers: Preeclampsia and kidney physiology during pregnancy, Ig A Nephropathy, Membranous Nephropathy. Faculte de Medecine, Universite Rene Descartes, Paris V Doctor of Medicine (M.D.),  Medicine 1980  – 1990 http://www.univ-paris5.fr Faculte de Medecine, Universite Rene Descartes, Paris V Doctor of Medicine (M.D.),  Medicine 1980  – 1990 http://www.univ-paris5.fr Faculte de Medecine, Universite Rene Descartes, Paris V Doctor of Medicine (M.D.),  Medicine 1980  – 1990 http://www.univ-paris5.fr Lycée Estienne d'Orves High School,  Baccalauréat C Mathématiques et Physique , Mention Bien 1974  – 1978 http://estiennedorves.net/web/lycee/presentation Lycée Estienne d'Orves High School,  Baccalauréat C Mathématiques et Physique , Mention Bien 1974  – 1978 http://estiennedorves.net/web/lycee/presentation Lycée Estienne d'Orves High School,  Baccalauréat C Mathématiques et Physique , Mention Bien 1974  – 1978 http://estiennedorves.net/web/lycee/presentation Lycée Razi Lycée Razi Lycée Razi "]}