{"position": "Communications Specialist", "company": "Intel Corporation", "profiles": ["Languages   Skills Change Management Management Consulting Business Transformation Strategic Planning Business Process... Vendor Management Cross-functional Team... Business Strategy Procurement Strategic Sourcing Contract Management Department Budgeting Competitive Analysis Strategy Management Program Management Process Improvement See 2+     See less Skills  Change Management Management Consulting Business Transformation Strategic Planning Business Process... Vendor Management Cross-functional Team... Business Strategy Procurement Strategic Sourcing Contract Management Department Budgeting Competitive Analysis Strategy Management Program Management Process Improvement See 2+     See less Change Management Management Consulting Business Transformation Strategic Planning Business Process... Vendor Management Cross-functional Team... Business Strategy Procurement Strategic Sourcing Contract Management Department Budgeting Competitive Analysis Strategy Management Program Management Process Improvement See 2+     See less Change Management Management Consulting Business Transformation Strategic Planning Business Process... Vendor Management Cross-functional Team... Business Strategy Procurement Strategic Sourcing Contract Management Department Budgeting Competitive Analysis Strategy Management Program Management Process Improvement See 2+     See less Education Thunderbird School of Global Management MBA,  Finance 2003  – 2004 Oregon State University BA,  Spanish ,  Math Thunderbird School of Global Management MBA,  Finance 2003  – 2004 Thunderbird School of Global Management MBA,  Finance 2003  – 2004 Thunderbird School of Global Management MBA,  Finance 2003  – 2004 Oregon State University BA,  Spanish ,  Math Oregon State University BA,  Spanish ,  Math Oregon State University BA,  Spanish ,  Math ", "Summary Specialties: WebStorm, GitHub, Jive, Business Analysis, Kanban Facilitator, HTML 5 development tack (Angular, Javascript, Grunt, Bower, JSON) Visio 2013, SharePoint 2010, SharePoint Designer 2010, Microsoft Office 2010, Frontpage (HTML), InfoFactory/Documentum, Target Mailer, Quality Center, SAP, Intel Application Profiler Summary Specialties: WebStorm, GitHub, Jive, Business Analysis, Kanban Facilitator, HTML 5 development tack (Angular, Javascript, Grunt, Bower, JSON) Visio 2013, SharePoint 2010, SharePoint Designer 2010, Microsoft Office 2010, Frontpage (HTML), InfoFactory/Documentum, Target Mailer, Quality Center, SAP, Intel Application Profiler Specialties: WebStorm, GitHub, Jive, Business Analysis, Kanban Facilitator, HTML 5 development tack (Angular, Javascript, Grunt, Bower, JSON) Visio 2013, SharePoint 2010, SharePoint Designer 2010, Microsoft Office 2010, Frontpage (HTML), InfoFactory/Documentum, Target Mailer, Quality Center, SAP, Intel Application Profiler Specialties: WebStorm, GitHub, Jive, Business Analysis, Kanban Facilitator, HTML 5 development tack (Angular, Javascript, Grunt, Bower, JSON) Visio 2013, SharePoint 2010, SharePoint Designer 2010, Microsoft Office 2010, Frontpage (HTML), InfoFactory/Documentum, Target Mailer, Quality Center, SAP, Intel Application Profiler Experience Project Manager and Communications Specialist Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, Oregon The 5 Star Apps Project Coordinator is a key role supporting Intel IT’s multi-year, multi-platform enablement initiative focused upon delivering business solutions to our users on their platform(s) of choice. 5 Star Apps embraces Intel’s product strategy for extending the computing platform (devices, operating systems and browsers) with equal or improved user experience and information security. This transition is a shift on a scale similar to when Intel IT shifted from desktops to laptops as a primary enterprise user device. \n \nKey Responsibilities: \n \nAccelerated Results Center (ARC), Primary Coordinator and Liaison: As our 5 Star ARC Coordinator, Hillary engages with both IT and non-IT development teams to drive them through completion of key artifacts of the unique ARC model: Complexity Assessments to gauge project scope and major risk areas; project charters to elicit each’s project’s Mission/Vision statement as well as lock down high level scope; user stories and requirements development to define the business needs; process mapping/flows development to illustrate how the needs will be realized in the new solution; architectural and design Reviews to capture and refine the as-is and to-be process models; solution validation and testing to improve solution quality; and transition change mgmt. (TCM) and user adoption activities critical to deployment. \n \nPartners with all levels of the organization to develop, review and release program communications and critical initiatives.  \n \nMaintains project documentation, e.g., issues log, schedule, project documentation for meetings and archival of project-related collateral (SOWs, charter documents, project plans, stakeholder maps, and retrospective (post implementation) reviews. Sr. Administrative Assistant - PDS Intel Corporation February 2008  –  July 2013  (5 years 6 months) Admin partner to Kirt Eberts, Director of Product Data Solutions and Bill Giard, Principal Engineer in ITS3. \n \nOther: \nCalendar management, travel, purchasing via purchase orders and CPC, expense reports, preparation of presentations, supply maintenance, org-unit maintenance, training reports, org charts, go-to person for knowledge on Intel processes/procedures, office-space management, moves and reconfigurations, awards and recognition and open forum facilitation, SharePoint migration and management/administration, InfoFactory cabinet owner and administrator, special projects and mentoring of junior Admins. Sr. Administrative Assistant - NBI Intel Corporation May 2004  –  February 2009  (4 years 10 months) Senior admin supporting various new seed venture groups and investigations. New Business Initiatives (NBI) SharePoint owner and administrator responsible for development/creation of sites, training/rollout to NBI employees and migration from SharePoint V2 to MOSS. Responsible for updates to existing content and management of access requests. Administrator of organization’s shared drives, including archival of documents, access requests and audit of permissions. Sr. Administrative Assistant - NSG (Kelly Services) Intel Corporation November 2003  –  May 2004  (7 months) Lead admin in NSG’s Voiceband Modem Operation (VMO) division, supporting 1 GM and 3 Directors. Responsible for writing and posting of the monthly status report and indicators. Owner of department WMM; responsible for maintaining group meetings (including agenda, meeting minutes and group presentations) and security permissions.  \n \nMember of the ICG Productivity Tips & Tricks team, helping to promote clear and consistent communication regarding BKMs within ICG and throughout Intel. Sr. Administrative Assistant - CEG (Kelly Services Intel Corporation May 2003  –  November 2003  (7 months) Owner of BPG Field Business Division Link (FDBL) posting and updates, BPG Weekly Field Update (WFU) article postings and approvals, BPG Program Decoder Chart updates, Sr. Administrative Assistant - ICG Intel Corporation February 1999  –  March 2001  (2 years 2 months) Responsible for staffing and attire for ICG/NCG N+I trade shows. Attend and work trade-show events, providing information and customer support. Member of the core team for event planning. Project Manager and Communications Specialist Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, Oregon The 5 Star Apps Project Coordinator is a key role supporting Intel IT’s multi-year, multi-platform enablement initiative focused upon delivering business solutions to our users on their platform(s) of choice. 5 Star Apps embraces Intel’s product strategy for extending the computing platform (devices, operating systems and browsers) with equal or improved user experience and information security. This transition is a shift on a scale similar to when Intel IT shifted from desktops to laptops as a primary enterprise user device. \n \nKey Responsibilities: \n \nAccelerated Results Center (ARC), Primary Coordinator and Liaison: As our 5 Star ARC Coordinator, Hillary engages with both IT and non-IT development teams to drive them through completion of key artifacts of the unique ARC model: Complexity Assessments to gauge project scope and major risk areas; project charters to elicit each’s project’s Mission/Vision statement as well as lock down high level scope; user stories and requirements development to define the business needs; process mapping/flows development to illustrate how the needs will be realized in the new solution; architectural and design Reviews to capture and refine the as-is and to-be process models; solution validation and testing to improve solution quality; and transition change mgmt. (TCM) and user adoption activities critical to deployment. \n \nPartners with all levels of the organization to develop, review and release program communications and critical initiatives.  \n \nMaintains project documentation, e.g., issues log, schedule, project documentation for meetings and archival of project-related collateral (SOWs, charter documents, project plans, stakeholder maps, and retrospective (post implementation) reviews. Project Manager and Communications Specialist Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, Oregon The 5 Star Apps Project Coordinator is a key role supporting Intel IT’s multi-year, multi-platform enablement initiative focused upon delivering business solutions to our users on their platform(s) of choice. 5 Star Apps embraces Intel’s product strategy for extending the computing platform (devices, operating systems and browsers) with equal or improved user experience and information security. This transition is a shift on a scale similar to when Intel IT shifted from desktops to laptops as a primary enterprise user device. \n \nKey Responsibilities: \n \nAccelerated Results Center (ARC), Primary Coordinator and Liaison: As our 5 Star ARC Coordinator, Hillary engages with both IT and non-IT development teams to drive them through completion of key artifacts of the unique ARC model: Complexity Assessments to gauge project scope and major risk areas; project charters to elicit each’s project’s Mission/Vision statement as well as lock down high level scope; user stories and requirements development to define the business needs; process mapping/flows development to illustrate how the needs will be realized in the new solution; architectural and design Reviews to capture and refine the as-is and to-be process models; solution validation and testing to improve solution quality; and transition change mgmt. (TCM) and user adoption activities critical to deployment. \n \nPartners with all levels of the organization to develop, review and release program communications and critical initiatives.  \n \nMaintains project documentation, e.g., issues log, schedule, project documentation for meetings and archival of project-related collateral (SOWs, charter documents, project plans, stakeholder maps, and retrospective (post implementation) reviews. Sr. Administrative Assistant - PDS Intel Corporation February 2008  –  July 2013  (5 years 6 months) Admin partner to Kirt Eberts, Director of Product Data Solutions and Bill Giard, Principal Engineer in ITS3. \n \nOther: \nCalendar management, travel, purchasing via purchase orders and CPC, expense reports, preparation of presentations, supply maintenance, org-unit maintenance, training reports, org charts, go-to person for knowledge on Intel processes/procedures, office-space management, moves and reconfigurations, awards and recognition and open forum facilitation, SharePoint migration and management/administration, InfoFactory cabinet owner and administrator, special projects and mentoring of junior Admins. Sr. Administrative Assistant - PDS Intel Corporation February 2008  –  July 2013  (5 years 6 months) Admin partner to Kirt Eberts, Director of Product Data Solutions and Bill Giard, Principal Engineer in ITS3. \n \nOther: \nCalendar management, travel, purchasing via purchase orders and CPC, expense reports, preparation of presentations, supply maintenance, org-unit maintenance, training reports, org charts, go-to person for knowledge on Intel processes/procedures, office-space management, moves and reconfigurations, awards and recognition and open forum facilitation, SharePoint migration and management/administration, InfoFactory cabinet owner and administrator, special projects and mentoring of junior Admins. Sr. Administrative Assistant - NBI Intel Corporation May 2004  –  February 2009  (4 years 10 months) Senior admin supporting various new seed venture groups and investigations. New Business Initiatives (NBI) SharePoint owner and administrator responsible for development/creation of sites, training/rollout to NBI employees and migration from SharePoint V2 to MOSS. Responsible for updates to existing content and management of access requests. Administrator of organization’s shared drives, including archival of documents, access requests and audit of permissions. Sr. Administrative Assistant - NBI Intel Corporation May 2004  –  February 2009  (4 years 10 months) Senior admin supporting various new seed venture groups and investigations. New Business Initiatives (NBI) SharePoint owner and administrator responsible for development/creation of sites, training/rollout to NBI employees and migration from SharePoint V2 to MOSS. Responsible for updates to existing content and management of access requests. Administrator of organization’s shared drives, including archival of documents, access requests and audit of permissions. Sr. Administrative Assistant - NSG (Kelly Services) Intel Corporation November 2003  –  May 2004  (7 months) Lead admin in NSG’s Voiceband Modem Operation (VMO) division, supporting 1 GM and 3 Directors. Responsible for writing and posting of the monthly status report and indicators. Owner of department WMM; responsible for maintaining group meetings (including agenda, meeting minutes and group presentations) and security permissions.  \n \nMember of the ICG Productivity Tips & Tricks team, helping to promote clear and consistent communication regarding BKMs within ICG and throughout Intel. Sr. Administrative Assistant - NSG (Kelly Services) Intel Corporation November 2003  –  May 2004  (7 months) Lead admin in NSG’s Voiceband Modem Operation (VMO) division, supporting 1 GM and 3 Directors. Responsible for writing and posting of the monthly status report and indicators. Owner of department WMM; responsible for maintaining group meetings (including agenda, meeting minutes and group presentations) and security permissions.  \n \nMember of the ICG Productivity Tips & Tricks team, helping to promote clear and consistent communication regarding BKMs within ICG and throughout Intel. Sr. Administrative Assistant - CEG (Kelly Services Intel Corporation May 2003  –  November 2003  (7 months) Owner of BPG Field Business Division Link (FDBL) posting and updates, BPG Weekly Field Update (WFU) article postings and approvals, BPG Program Decoder Chart updates, Sr. Administrative Assistant - CEG (Kelly Services Intel Corporation May 2003  –  November 2003  (7 months) Owner of BPG Field Business Division Link (FDBL) posting and updates, BPG Weekly Field Update (WFU) article postings and approvals, BPG Program Decoder Chart updates, Sr. Administrative Assistant - ICG Intel Corporation February 1999  –  March 2001  (2 years 2 months) Responsible for staffing and attire for ICG/NCG N+I trade shows. Attend and work trade-show events, providing information and customer support. Member of the core team for event planning. Sr. Administrative Assistant - ICG Intel Corporation February 1999  –  March 2001  (2 years 2 months) Responsible for staffing and attire for ICG/NCG N+I trade shows. Attend and work trade-show events, providing information and customer support. Member of the core team for event planning. Skills SharePoint Product Management Outlook Program Management Access SAP System Administration Enterprise Software Semiconductors Intel Expenses Purchasing Business Intelligence MS Project Visio Windows Microsoft Office Microsoft Excel Event Planning Computer Architecture Cross-functional Team... FrontPage Microsoft Office 2007 PowerPoint Prioritization Word Internet Explorer Excel Scheduling Administration Coordination MS Office Suite Spreadsheets Expense Management Teamwork Customer Service Event Management Problem Solving Adobe CQ AngularJS HTML 5 Node.js Jive Web Content Publishing Communication Technical Writing Writing See 33+     See less Skills  SharePoint Product Management Outlook Program Management Access SAP System Administration Enterprise Software Semiconductors Intel Expenses Purchasing Business Intelligence MS Project Visio Windows Microsoft Office Microsoft Excel Event Planning Computer Architecture Cross-functional Team... FrontPage Microsoft Office 2007 PowerPoint Prioritization Word Internet Explorer Excel Scheduling Administration Coordination MS Office Suite Spreadsheets Expense Management Teamwork Customer Service Event Management Problem Solving Adobe CQ AngularJS HTML 5 Node.js Jive Web Content Publishing Communication Technical Writing Writing See 33+     See less SharePoint Product Management Outlook Program Management Access SAP System Administration Enterprise Software Semiconductors Intel Expenses Purchasing Business Intelligence MS Project Visio Windows Microsoft Office Microsoft Excel Event Planning Computer Architecture Cross-functional Team... FrontPage Microsoft Office 2007 PowerPoint Prioritization Word Internet Explorer Excel Scheduling Administration Coordination MS Office Suite Spreadsheets Expense Management Teamwork Customer Service Event Management Problem Solving Adobe CQ AngularJS HTML 5 Node.js Jive Web Content Publishing Communication Technical Writing Writing See 33+     See less SharePoint Product Management Outlook Program Management Access SAP System Administration Enterprise Software Semiconductors Intel Expenses Purchasing Business Intelligence MS Project Visio Windows Microsoft Office Microsoft Excel Event Planning Computer Architecture Cross-functional Team... FrontPage Microsoft Office 2007 PowerPoint Prioritization Word Internet Explorer Excel Scheduling Administration Coordination MS Office Suite Spreadsheets Expense Management Teamwork Customer Service Event Management Problem Solving Adobe CQ AngularJS HTML 5 Node.js Jive Web Content Publishing Communication Technical Writing Writing See 33+     See less Education Oregon Institute of Technology AAS,  Legal Office 1991  – 1993 Activities and Societies:  Beta Sigma Phi Oregon Institute of Technology AAS,  Legal Office 1991  – 1993 Activities and Societies:  Beta Sigma Phi Oregon Institute of Technology AAS,  Legal Office 1991  – 1993 Activities and Societies:  Beta Sigma Phi Oregon Institute of Technology AAS,  Legal Office 1991  – 1993 Activities and Societies:  Beta Sigma Phi Honors & Awards Additional Honors & Awards Information Technology (IT) Division Recognition Award (DRA) - Outstanding example of Possibility Thinking. After 18 mos. of various PCCG and IT attempts to deliver Intel Restricted Secret (IRS) content on handheld devices, this team reframed the problem and worked across IT to deliver critical business indicators for PCCG. \n \nProduct Data Solutions Dvision Recognition Award (DRA) - Excellent planning and execution in the inaugural ITS3 Technical Conference (awarded Q4 2012). \n \nIntel Capital Division Recognition Award (DRA) - creating an infrastructure and supporting operational plan for knowledge sharing and training in NBI (awarded Q1 2005). \n \n“Outstanding Legal Student” in Office Systems Technology – Legal Option at Oregon Institute of Technology, 1993 \n \nWho’s Who Among American College Students, 1992 and 1993 \n \nPresident’s List at Oregon Institute of Technology, 1991 - 1993 Additional Honors & Awards Information Technology (IT) Division Recognition Award (DRA) - Outstanding example of Possibility Thinking. After 18 mos. of various PCCG and IT attempts to deliver Intel Restricted Secret (IRS) content on handheld devices, this team reframed the problem and worked across IT to deliver critical business indicators for PCCG. \n \nProduct Data Solutions Dvision Recognition Award (DRA) - Excellent planning and execution in the inaugural ITS3 Technical Conference (awarded Q4 2012). \n \nIntel Capital Division Recognition Award (DRA) - creating an infrastructure and supporting operational plan for knowledge sharing and training in NBI (awarded Q1 2005). \n \n“Outstanding Legal Student” in Office Systems Technology – Legal Option at Oregon Institute of Technology, 1993 \n \nWho’s Who Among American College Students, 1992 and 1993 \n \nPresident’s List at Oregon Institute of Technology, 1991 - 1993 Additional Honors & Awards Information Technology (IT) Division Recognition Award (DRA) - Outstanding example of Possibility Thinking. After 18 mos. of various PCCG and IT attempts to deliver Intel Restricted Secret (IRS) content on handheld devices, this team reframed the problem and worked across IT to deliver critical business indicators for PCCG. \n \nProduct Data Solutions Dvision Recognition Award (DRA) - Excellent planning and execution in the inaugural ITS3 Technical Conference (awarded Q4 2012). \n \nIntel Capital Division Recognition Award (DRA) - creating an infrastructure and supporting operational plan for knowledge sharing and training in NBI (awarded Q1 2005). \n \n“Outstanding Legal Student” in Office Systems Technology – Legal Option at Oregon Institute of Technology, 1993 \n \nWho’s Who Among American College Students, 1992 and 1993 \n \nPresident’s List at Oregon Institute of Technology, 1991 - 1993 Additional Honors & Awards Information Technology (IT) Division Recognition Award (DRA) - Outstanding example of Possibility Thinking. After 18 mos. of various PCCG and IT attempts to deliver Intel Restricted Secret (IRS) content on handheld devices, this team reframed the problem and worked across IT to deliver critical business indicators for PCCG. \n \nProduct Data Solutions Dvision Recognition Award (DRA) - Excellent planning and execution in the inaugural ITS3 Technical Conference (awarded Q4 2012). \n \nIntel Capital Division Recognition Award (DRA) - creating an infrastructure and supporting operational plan for knowledge sharing and training in NBI (awarded Q1 2005). \n \n“Outstanding Legal Student” in Office Systems Technology – Legal Option at Oregon Institute of Technology, 1993 \n \nWho’s Who Among American College Students, 1992 and 1993 \n \nPresident’s List at Oregon Institute of Technology, 1991 - 1993 ", "Summary I am a professional with a marketing, database, web engineering, and management background. I have a passion for excellence and am pursuing a career in which I can use my skills to work with customers, build applications, create reliable solutions, and help peers and employees grow. I am secret certification ready. \n \nAt some point in a person's body of experience (30 years here). It doesn't matter what the technology is called -- a fluid mind can make it work. Even though I have high standards I've never been called rigid. \n \nSpecialties: Coding: PHP, JavaScript, HTML5, CSS3. Experience: Marketing Communications, Marketing Program Management, Technology Team Management, Operational Team Management, Ecommerce Technologies and Implementations, Codework & Architecture: SQL Databases, Schema Design, Web Application Design, Cross-Platform JavaScript, DHTML, Cookies, Visual BASIC, HTML/DHTML/XHTML/HTML5, CSS2, CSS3, Adobe Photoshop, Graphics Formats, Server Farm Architecture (security, scalability, redundancy), PHP, VBScript (ASP), Python, Perl, Awk, Databases: MySQL, Microsoft Access, Microsoft SQL Server, Oracle, SQLPlus, TOAD, Microsoft Foxpro, Cold Fusion, O'Hanlon Database Solution, DBase, Paradox Summary I am a professional with a marketing, database, web engineering, and management background. I have a passion for excellence and am pursuing a career in which I can use my skills to work with customers, build applications, create reliable solutions, and help peers and employees grow. I am secret certification ready. \n \nAt some point in a person's body of experience (30 years here). It doesn't matter what the technology is called -- a fluid mind can make it work. Even though I have high standards I've never been called rigid. \n \nSpecialties: Coding: PHP, JavaScript, HTML5, CSS3. Experience: Marketing Communications, Marketing Program Management, Technology Team Management, Operational Team Management, Ecommerce Technologies and Implementations, Codework & Architecture: SQL Databases, Schema Design, Web Application Design, Cross-Platform JavaScript, DHTML, Cookies, Visual BASIC, HTML/DHTML/XHTML/HTML5, CSS2, CSS3, Adobe Photoshop, Graphics Formats, Server Farm Architecture (security, scalability, redundancy), PHP, VBScript (ASP), Python, Perl, Awk, Databases: MySQL, Microsoft Access, Microsoft SQL Server, Oracle, SQLPlus, TOAD, Microsoft Foxpro, Cold Fusion, O'Hanlon Database Solution, DBase, Paradox I am a professional with a marketing, database, web engineering, and management background. I have a passion for excellence and am pursuing a career in which I can use my skills to work with customers, build applications, create reliable solutions, and help peers and employees grow. I am secret certification ready. \n \nAt some point in a person's body of experience (30 years here). It doesn't matter what the technology is called -- a fluid mind can make it work. Even though I have high standards I've never been called rigid. \n \nSpecialties: Coding: PHP, JavaScript, HTML5, CSS3. Experience: Marketing Communications, Marketing Program Management, Technology Team Management, Operational Team Management, Ecommerce Technologies and Implementations, Codework & Architecture: SQL Databases, Schema Design, Web Application Design, Cross-Platform JavaScript, DHTML, Cookies, Visual BASIC, HTML/DHTML/XHTML/HTML5, CSS2, CSS3, Adobe Photoshop, Graphics Formats, Server Farm Architecture (security, scalability, redundancy), PHP, VBScript (ASP), Python, Perl, Awk, Databases: MySQL, Microsoft Access, Microsoft SQL Server, Oracle, SQLPlus, TOAD, Microsoft Foxpro, Cold Fusion, O'Hanlon Database Solution, DBase, Paradox I am a professional with a marketing, database, web engineering, and management background. I have a passion for excellence and am pursuing a career in which I can use my skills to work with customers, build applications, create reliable solutions, and help peers and employees grow. I am secret certification ready. \n \nAt some point in a person's body of experience (30 years here). It doesn't matter what the technology is called -- a fluid mind can make it work. Even though I have high standards I've never been called rigid. \n \nSpecialties: Coding: PHP, JavaScript, HTML5, CSS3. Experience: Marketing Communications, Marketing Program Management, Technology Team Management, Operational Team Management, Ecommerce Technologies and Implementations, Codework & Architecture: SQL Databases, Schema Design, Web Application Design, Cross-Platform JavaScript, DHTML, Cookies, Visual BASIC, HTML/DHTML/XHTML/HTML5, CSS2, CSS3, Adobe Photoshop, Graphics Formats, Server Farm Architecture (security, scalability, redundancy), PHP, VBScript (ASP), Python, Perl, Awk, Databases: MySQL, Microsoft Access, Microsoft SQL Server, Oracle, SQLPlus, TOAD, Microsoft Foxpro, Cold Fusion, O'Hanlon Database Solution, DBase, Paradox Languages English Native or bilingual proficiency Spanish Elementary proficiency French Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency French Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency French Elementary proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Perl PHP Microsoft SQL Server MySQL Databases Visual Basic Oracle Python E-commerce ColdFusion DHTML CSS3 Scalability Web Application Design HTML SQL JavaScript Java Software Development CSS Management Integration Program Management See 8+     See less Skills  Perl PHP Microsoft SQL Server MySQL Databases Visual Basic Oracle Python E-commerce ColdFusion DHTML CSS3 Scalability Web Application Design HTML SQL JavaScript Java Software Development CSS Management Integration Program Management See 8+     See less Perl PHP Microsoft SQL Server MySQL Databases Visual Basic Oracle Python E-commerce ColdFusion DHTML CSS3 Scalability Web Application Design HTML SQL JavaScript Java Software Development CSS Management Integration Program Management See 8+     See less Perl PHP Microsoft SQL Server MySQL Databases Visual Basic Oracle Python E-commerce ColdFusion DHTML CSS3 Scalability Web Application Design HTML SQL JavaScript Java Software Development CSS Management Integration Program Management See 8+     See less ", "Summary Specialties: Corporate communications, software testing, performance and stress testing, software vendor management Summary Specialties: Corporate communications, software testing, performance and stress testing, software vendor management Specialties: Corporate communications, software testing, performance and stress testing, software vendor management Specialties: Corporate communications, software testing, performance and stress testing, software vendor management Experience Software Quality Analyst Intel Corporation 2012  – Present (3 years) Technical Project Manager Intel Corporation 2010  –  2012  (2 years) Plan and coordinate performance tests for enterprise application development. Internal Communications Specialist Intel Corporation 2007  –  2010  (3 years) Product Manager Intel Corporation 2005  –  2006  (1 year) Software Quality Analyst Intel Corporation 2012  – Present (3 years) Software Quality Analyst Intel Corporation 2012  – Present (3 years) Technical Project Manager Intel Corporation 2010  –  2012  (2 years) Plan and coordinate performance tests for enterprise application development. Technical Project Manager Intel Corporation 2010  –  2012  (2 years) Plan and coordinate performance tests for enterprise application development. Internal Communications Specialist Intel Corporation 2007  –  2010  (3 years) Internal Communications Specialist Intel Corporation 2007  –  2010  (3 years) Product Manager Intel Corporation 2005  –  2006  (1 year) Product Manager Intel Corporation 2005  –  2006  (1 year) Skills Intel Program Management Strategic Planning Internal Communications Cross-functional Team... Corporate Communications Strategy Project Management Product Management Vendor Management Skills  Intel Program Management Strategic Planning Internal Communications Cross-functional Team... Corporate Communications Strategy Project Management Product Management Vendor Management Intel Program Management Strategic Planning Internal Communications Cross-functional Team... Corporate Communications Strategy Project Management Product Management Vendor Management Intel Program Management Strategic Planning Internal Communications Cross-functional Team... Corporate Communications Strategy Project Management Product Management Vendor Management Education University of North Carolina at Chapel Hill MSIS,  Information and Library Science 1995  – 1997 University of North Carolina at Chapel Hill B.S.,  Business Administration 1985  – 1989 University of North Carolina at Chapel Hill MSIS,  Information and Library Science 1995  – 1997 University of North Carolina at Chapel Hill MSIS,  Information and Library Science 1995  – 1997 University of North Carolina at Chapel Hill MSIS,  Information and Library Science 1995  – 1997 University of North Carolina at Chapel Hill B.S.,  Business Administration 1985  – 1989 University of North Carolina at Chapel Hill B.S.,  Business Administration 1985  – 1989 University of North Carolina at Chapel Hill B.S.,  Business Administration 1985  – 1989 ", "Experience Communications Specialist Intel Corporation July 2014  – Present (1 year 2 months) Reporting to the Operations Manager and working closely with the Communications Manager, responsible for supporting internal company communications and operations needs by developing and executing focused business direction and communication plans. Graduate Assistant for Communication U.S. Fish and Wildlife Service, Division of Fishery Resources July 2013  –  June 2014  (1 year) Working with a small team, responsible for content development, website maintenance, assisting with outreach activities, and collaborating on the development of a new strategic communication plan. Graduate Teaching Assistant Portland State University September 2012  –  June 2013  (10 months) Working with a tenure track professor, responsible for grading submissions, developing supplemental teaching materials, providing feedback to students, and meeting with research groups to guide them through the process of conducting social science research. Front-of-House Manager The Venetian Theatre & Bistro January 2010  –  September 2012  (2 years 9 months) Answering to the owner, responsible for front-of-house operations. Directly supervised 16 to 22 employees to ensure efficiency and the highest quality of customer service. Lead Server The Venetian Theatre & Bistro June 2008  –  December 2010  (2 years 7 months) Answering to the owner, trained and directly supervised 16 to 22 employees to ensure efficiency and the highest quality of customer service.  \n \nAs a server, provided prompt and friendly customer service. Received only positive customer comment cards rating service as either \"excellent\" or \"truly superior.\" Communications Specialist Intel Corporation July 2014  – Present (1 year 2 months) Reporting to the Operations Manager and working closely with the Communications Manager, responsible for supporting internal company communications and operations needs by developing and executing focused business direction and communication plans. Communications Specialist Intel Corporation July 2014  – Present (1 year 2 months) Reporting to the Operations Manager and working closely with the Communications Manager, responsible for supporting internal company communications and operations needs by developing and executing focused business direction and communication plans. Graduate Assistant for Communication U.S. Fish and Wildlife Service, Division of Fishery Resources July 2013  –  June 2014  (1 year) Working with a small team, responsible for content development, website maintenance, assisting with outreach activities, and collaborating on the development of a new strategic communication plan. Graduate Assistant for Communication U.S. Fish and Wildlife Service, Division of Fishery Resources July 2013  –  June 2014  (1 year) Working with a small team, responsible for content development, website maintenance, assisting with outreach activities, and collaborating on the development of a new strategic communication plan. Graduate Teaching Assistant Portland State University September 2012  –  June 2013  (10 months) Working with a tenure track professor, responsible for grading submissions, developing supplemental teaching materials, providing feedback to students, and meeting with research groups to guide them through the process of conducting social science research. Graduate Teaching Assistant Portland State University September 2012  –  June 2013  (10 months) Working with a tenure track professor, responsible for grading submissions, developing supplemental teaching materials, providing feedback to students, and meeting with research groups to guide them through the process of conducting social science research. Front-of-House Manager The Venetian Theatre & Bistro January 2010  –  September 2012  (2 years 9 months) Answering to the owner, responsible for front-of-house operations. Directly supervised 16 to 22 employees to ensure efficiency and the highest quality of customer service. Front-of-House Manager The Venetian Theatre & Bistro January 2010  –  September 2012  (2 years 9 months) Answering to the owner, responsible for front-of-house operations. Directly supervised 16 to 22 employees to ensure efficiency and the highest quality of customer service. Lead Server The Venetian Theatre & Bistro June 2008  –  December 2010  (2 years 7 months) Answering to the owner, trained and directly supervised 16 to 22 employees to ensure efficiency and the highest quality of customer service.  \n \nAs a server, provided prompt and friendly customer service. Received only positive customer comment cards rating service as either \"excellent\" or \"truly superior.\" Lead Server The Venetian Theatre & Bistro June 2008  –  December 2010  (2 years 7 months) Answering to the owner, trained and directly supervised 16 to 22 employees to ensure efficiency and the highest quality of customer service.  \n \nAs a server, provided prompt and friendly customer service. Received only positive customer comment cards rating service as either \"excellent\" or \"truly superior.\" Languages Italian Italian Italian Skills Writing Public Speaking Strategic Communications Teamwork Leadership Community Outreach Social Media Communication Event Planning Teaching Skills  Writing Public Speaking Strategic Communications Teamwork Leadership Community Outreach Social Media Communication Event Planning Teaching Writing Public Speaking Strategic Communications Teamwork Leadership Community Outreach Social Media Communication Event Planning Teaching Writing Public Speaking Strategic Communications Teamwork Leadership Community Outreach Social Media Communication Event Planning Teaching Education Portland State University Master's degree,  Communication 2012  – 2014 Gonzaga University Bachelor of Arts (BA),  Applied Communication Studies 2004  – 2008 Activities and Societies:  Public Relations Student Society of America (PRSSA) ,  Lambda Pi Eta ,  The Feminist Papers Portland State University Master's degree,  Communication 2012  – 2014 Portland State University Master's degree,  Communication 2012  – 2014 Portland State University Master's degree,  Communication 2012  – 2014 Gonzaga University Bachelor of Arts (BA),  Applied Communication Studies 2004  – 2008 Activities and Societies:  Public Relations Student Society of America (PRSSA) ,  Lambda Pi Eta ,  The Feminist Papers Gonzaga University Bachelor of Arts (BA),  Applied Communication Studies 2004  – 2008 Activities and Societies:  Public Relations Student Society of America (PRSSA) ,  Lambda Pi Eta ,  The Feminist Papers Gonzaga University Bachelor of Arts (BA),  Applied Communication Studies 2004  – 2008 Activities and Societies:  Public Relations Student Society of America (PRSSA) ,  Lambda Pi Eta ,  The Feminist Papers ", "Summary Solid written and verbal communication; team player; collaborator; detail-, goal-, and customer-oriented; strong documentation advocate; and strong software aptitude. \n \n* Content Creation \n* Corporate Communications \n* Project Planning Summary Solid written and verbal communication; team player; collaborator; detail-, goal-, and customer-oriented; strong documentation advocate; and strong software aptitude. \n \n* Content Creation \n* Corporate Communications \n* Project Planning Solid written and verbal communication; team player; collaborator; detail-, goal-, and customer-oriented; strong documentation advocate; and strong software aptitude. \n \n* Content Creation \n* Corporate Communications \n* Project Planning Solid written and verbal communication; team player; collaborator; detail-, goal-, and customer-oriented; strong documentation advocate; and strong software aptitude. \n \n* Content Creation \n* Corporate Communications \n* Project Planning Experience ATTD Safety Communications Program Manager Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, OR IT Employee Communications Specialist Intel Corporation July 2011  –  April 2014  (2 years 10 months) Hillsboro, OR Fab 20 Application Developer & Web/SharePoint Administrator Intel June 2000  –  July 2011  (11 years 2 months) Hillsboro, OR Field Director Bill Sizemore for Governor June 1998  –  November 1998  (6 months) Clackamas, OR Political Director Oregon Voter Guide January 1998  –  March 1998  (3 months) Sherwood, OR Coalition Director Yes on 51 Committee August 1997  –  November 1997  (4 months) Portland, OR Government & Industry Affairs Manager National Glass Association August 1990  –  December 1996  (6 years 5 months) McLean, VA Legislative Correspondent Office of U.S. Senator Orrin G. Hatch April 1988  –  August 1990  (2 years 5 months) Washington, D.C. Assistant Regional Director Commission on the Bicentennial of the U.S. Constitution July 1986  –  August 1987  (1 year 2 months) Washington, DC Intern Office of U.S. Senator Pete Wilson January 1986  –  April 1986  (4 months) Washington, DC ATTD Safety Communications Program Manager Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, OR ATTD Safety Communications Program Manager Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, OR IT Employee Communications Specialist Intel Corporation July 2011  –  April 2014  (2 years 10 months) Hillsboro, OR IT Employee Communications Specialist Intel Corporation July 2011  –  April 2014  (2 years 10 months) Hillsboro, OR Fab 20 Application Developer & Web/SharePoint Administrator Intel June 2000  –  July 2011  (11 years 2 months) Hillsboro, OR Fab 20 Application Developer & Web/SharePoint Administrator Intel June 2000  –  July 2011  (11 years 2 months) Hillsboro, OR Field Director Bill Sizemore for Governor June 1998  –  November 1998  (6 months) Clackamas, OR Field Director Bill Sizemore for Governor June 1998  –  November 1998  (6 months) Clackamas, OR Political Director Oregon Voter Guide January 1998  –  March 1998  (3 months) Sherwood, OR Political Director Oregon Voter Guide January 1998  –  March 1998  (3 months) Sherwood, OR Coalition Director Yes on 51 Committee August 1997  –  November 1997  (4 months) Portland, OR Coalition Director Yes on 51 Committee August 1997  –  November 1997  (4 months) Portland, OR Government & Industry Affairs Manager National Glass Association August 1990  –  December 1996  (6 years 5 months) McLean, VA Government & Industry Affairs Manager National Glass Association August 1990  –  December 1996  (6 years 5 months) McLean, VA Legislative Correspondent Office of U.S. Senator Orrin G. Hatch April 1988  –  August 1990  (2 years 5 months) Washington, D.C. Legislative Correspondent Office of U.S. Senator Orrin G. Hatch April 1988  –  August 1990  (2 years 5 months) Washington, D.C. Assistant Regional Director Commission on the Bicentennial of the U.S. Constitution July 1986  –  August 1987  (1 year 2 months) Washington, DC Assistant Regional Director Commission on the Bicentennial of the U.S. Constitution July 1986  –  August 1987  (1 year 2 months) Washington, DC Intern Office of U.S. Senator Pete Wilson January 1986  –  April 1986  (4 months) Washington, DC Intern Office of U.S. Senator Pete Wilson January 1986  –  April 1986  (4 months) Washington, DC Languages English Native or bilingual proficiency Japanese Elementary proficiency English Native or bilingual proficiency Japanese Elementary proficiency English Native or bilingual proficiency Japanese Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Visio Databases Project Management SharePoint Software Documentation Microsoft SQL Server VB.NET SQL Program Management C# SDLC Perl Cross-functional Team... Management Skills  Visio Databases Project Management SharePoint Software Documentation Microsoft SQL Server VB.NET SQL Program Management C# SDLC Perl Cross-functional Team... Management Visio Databases Project Management SharePoint Software Documentation Microsoft SQL Server VB.NET SQL Program Management C# SDLC Perl Cross-functional Team... Management Visio Databases Project Management SharePoint Software Documentation Microsoft SQL Server VB.NET SQL Program Management C# SDLC Perl Cross-functional Team... Management Education Brigham Young University Bachelor of Arts,  Political Science 1980  – 1986 El Camino College Political Science 1980  – 1980 Portland Community College Computer Information Systems 2001  – 2003 Brigham Young University Bachelor of Arts,  Political Science 1980  – 1986 Brigham Young University Bachelor of Arts,  Political Science 1980  – 1986 Brigham Young University Bachelor of Arts,  Political Science 1980  – 1986 El Camino College Political Science 1980  – 1980 El Camino College Political Science 1980  – 1980 El Camino College Political Science 1980  – 1980 Portland Community College Computer Information Systems 2001  – 2003 Portland Community College Computer Information Systems 2001  – 2003 Portland Community College Computer Information Systems 2001  – 2003 Honors & Awards ", "Experience Internal Communications Specialist Intel Corporation January 2005  – Present (10 years 8 months) Internal Communications Specialist Intel Corporation January 2005  – Present (10 years 8 months) Internal Communications Specialist Intel Corporation January 2005  – Present (10 years 8 months) Education Universitat Autònoma de Barcelona Master's degree,  Máster en Dirección de Comunicación Empresarial e Institucional (productos, servicios, marcas) 2010  – 2011 Universidad de Costa Rica Bachelor's degree,  Ciencias de la Comunicación Colectiva con énfasis en RRPP 2000  – 2003 Universitat Autònoma de Barcelona Master's degree,  Máster en Dirección de Comunicación Empresarial e Institucional (productos, servicios, marcas) 2010  – 2011 Universitat Autònoma de Barcelona Master's degree,  Máster en Dirección de Comunicación Empresarial e Institucional (productos, servicios, marcas) 2010  – 2011 Universitat Autònoma de Barcelona Master's degree,  Máster en Dirección de Comunicación Empresarial e Institucional (productos, servicios, marcas) 2010  – 2011 Universidad de Costa Rica Bachelor's degree,  Ciencias de la Comunicación Colectiva con énfasis en RRPP 2000  – 2003 Universidad de Costa Rica Bachelor's degree,  Ciencias de la Comunicación Colectiva con énfasis en RRPP 2000  – 2003 Universidad de Costa Rica Bachelor's degree,  Ciencias de la Comunicación Colectiva con énfasis en RRPP 2000  – 2003 ", "Skills Public Relations Writing On-air Reporting Corporate Communications Internal Communications News Writing Strategic Communications Publicity Television Social Media Press Releases Journalism Editing Copywriting Storytelling Media Relations See 1+     See less Skills  Public Relations Writing On-air Reporting Corporate Communications Internal Communications News Writing Strategic Communications Publicity Television Social Media Press Releases Journalism Editing Copywriting Storytelling Media Relations See 1+     See less Public Relations Writing On-air Reporting Corporate Communications Internal Communications News Writing Strategic Communications Publicity Television Social Media Press Releases Journalism Editing Copywriting Storytelling Media Relations See 1+     See less Public Relations Writing On-air Reporting Corporate Communications Internal Communications News Writing Strategic Communications Publicity Television Social Media Press Releases Journalism Editing Copywriting Storytelling Media Relations See 1+     See less ", "Summary Deliver sales and training materials (messaging, positioning guides, presentations, demos, videos) that enable Intel Field and Channel partners to sell Kno™, an Intel Education Solution. Communicate product changes. Own the Kno roadmap publication and field training. Co-own demand generation efforts for Kno B2C channel. \n \nSpecialties: Proficient in Microsoft Office, Adobe Acrobat, HTML, Bronto, and RightNow CRMs, Final Cut Pro X, and Oracle Eloqua. Summary Deliver sales and training materials (messaging, positioning guides, presentations, demos, videos) that enable Intel Field and Channel partners to sell Kno™, an Intel Education Solution. Communicate product changes. Own the Kno roadmap publication and field training. Co-own demand generation efforts for Kno B2C channel. \n \nSpecialties: Proficient in Microsoft Office, Adobe Acrobat, HTML, Bronto, and RightNow CRMs, Final Cut Pro X, and Oracle Eloqua. Deliver sales and training materials (messaging, positioning guides, presentations, demos, videos) that enable Intel Field and Channel partners to sell Kno™, an Intel Education Solution. Communicate product changes. Own the Kno roadmap publication and field training. Co-own demand generation efforts for Kno B2C channel. \n \nSpecialties: Proficient in Microsoft Office, Adobe Acrobat, HTML, Bronto, and RightNow CRMs, Final Cut Pro X, and Oracle Eloqua. Deliver sales and training materials (messaging, positioning guides, presentations, demos, videos) that enable Intel Field and Channel partners to sell Kno™, an Intel Education Solution. Communicate product changes. Own the Kno roadmap publication and field training. Co-own demand generation efforts for Kno B2C channel. \n \nSpecialties: Proficient in Microsoft Office, Adobe Acrobat, HTML, Bronto, and RightNow CRMs, Final Cut Pro X, and Oracle Eloqua. Experience Marketing Communications Specialist Intel Corporation November 2013  –  May 2015  (1 year 7 months) Santa Clara, CA Deliver sales and training materials (messaging, positioning guides, presentations, demos, videos) that enable Intel Field and Channel partners to sell Kno™, an Intel Education Solution. Communicate product changes. Own the Kno roadmap publication and field training. Co-own demand generation efforts for Kno B2C channel. \n \nCharter, plan and execute seasonal eTextbooks sales campaign aimed at higher education and K12 kno.com customers to meet revenue goals. Identify and propose areas of improvement for future campaigns.  \n \nTrain and enable the Field to effectively sell the Kno solution by communicating product plans, educating them on Kno™ SaaS product features and benefits, and arming them with sales tools (product briefs, quick start guides, user guides, demo guides, presentations, product videos). \n \nThe go-to expert on how to present the Kno solution at events. Assist in developing the Kno presence at events internationally. Senior Marketing Communications Associate Kno, Inc. October 2012  –  October 2013  (1 year 1 month) Work with design, engineering and product teams to plan, create, distribute and manage Kno’s outbound communications through kno.com, email and social media channels. \n \n•\tEngage and inform Kno’s users through social media posts, email content, web copy, and tutorial videos. \n•\tGrow Kno’s active email users Open and Click through Rates through A/B tests and segmentation. \n•\tManage publisher partnerships to give away free books; tracking measurable outcomes through Google Analytics. \n•\tManage and release coupons to partners at key times to drive sales.  \n•\tBuild and maintain Kno’s image on over 70 sites and within app stores. \n•\tWork with product on copy and the design of features to create seamless user experiences. Customer Service Kno, Inc. July 2011  –  October 2012  (1 year 4 months) Santa Clara, CA Answered customer inquiries on phone, chat, and email. \n- Configured RightNow CRM software to establish knowledge base to maximize Customer Support efficiency. \n- Created Macros, Help, and FAQ guides for app on iOS, Android, and browser platforms. \n- Performed Quality Assurance for new versions of the product. \n- Organized and communicated customer feedback to respective teams. \n- Reported bugs to the engineering team to be fixed in a timely manner. \n- Worked on special projects with other departments such as Marketing, Sales, and Product Management. \n- Lead and trainer for new CS representatives. Marketing Communications Specialist Intel Corporation November 2013  –  May 2015  (1 year 7 months) Santa Clara, CA Deliver sales and training materials (messaging, positioning guides, presentations, demos, videos) that enable Intel Field and Channel partners to sell Kno™, an Intel Education Solution. Communicate product changes. Own the Kno roadmap publication and field training. Co-own demand generation efforts for Kno B2C channel. \n \nCharter, plan and execute seasonal eTextbooks sales campaign aimed at higher education and K12 kno.com customers to meet revenue goals. Identify and propose areas of improvement for future campaigns.  \n \nTrain and enable the Field to effectively sell the Kno solution by communicating product plans, educating them on Kno™ SaaS product features and benefits, and arming them with sales tools (product briefs, quick start guides, user guides, demo guides, presentations, product videos). \n \nThe go-to expert on how to present the Kno solution at events. Assist in developing the Kno presence at events internationally. Marketing Communications Specialist Intel Corporation November 2013  –  May 2015  (1 year 7 months) Santa Clara, CA Deliver sales and training materials (messaging, positioning guides, presentations, demos, videos) that enable Intel Field and Channel partners to sell Kno™, an Intel Education Solution. Communicate product changes. Own the Kno roadmap publication and field training. Co-own demand generation efforts for Kno B2C channel. \n \nCharter, plan and execute seasonal eTextbooks sales campaign aimed at higher education and K12 kno.com customers to meet revenue goals. Identify and propose areas of improvement for future campaigns.  \n \nTrain and enable the Field to effectively sell the Kno solution by communicating product plans, educating them on Kno™ SaaS product features and benefits, and arming them with sales tools (product briefs, quick start guides, user guides, demo guides, presentations, product videos). \n \nThe go-to expert on how to present the Kno solution at events. Assist in developing the Kno presence at events internationally. Senior Marketing Communications Associate Kno, Inc. October 2012  –  October 2013  (1 year 1 month) Work with design, engineering and product teams to plan, create, distribute and manage Kno’s outbound communications through kno.com, email and social media channels. \n \n•\tEngage and inform Kno’s users through social media posts, email content, web copy, and tutorial videos. \n•\tGrow Kno’s active email users Open and Click through Rates through A/B tests and segmentation. \n•\tManage publisher partnerships to give away free books; tracking measurable outcomes through Google Analytics. \n•\tManage and release coupons to partners at key times to drive sales.  \n•\tBuild and maintain Kno’s image on over 70 sites and within app stores. \n•\tWork with product on copy and the design of features to create seamless user experiences. Senior Marketing Communications Associate Kno, Inc. October 2012  –  October 2013  (1 year 1 month) Work with design, engineering and product teams to plan, create, distribute and manage Kno’s outbound communications through kno.com, email and social media channels. \n \n•\tEngage and inform Kno’s users through social media posts, email content, web copy, and tutorial videos. \n•\tGrow Kno’s active email users Open and Click through Rates through A/B tests and segmentation. \n•\tManage publisher partnerships to give away free books; tracking measurable outcomes through Google Analytics. \n•\tManage and release coupons to partners at key times to drive sales.  \n•\tBuild and maintain Kno’s image on over 70 sites and within app stores. \n•\tWork with product on copy and the design of features to create seamless user experiences. Customer Service Kno, Inc. July 2011  –  October 2012  (1 year 4 months) Santa Clara, CA Answered customer inquiries on phone, chat, and email. \n- Configured RightNow CRM software to establish knowledge base to maximize Customer Support efficiency. \n- Created Macros, Help, and FAQ guides for app on iOS, Android, and browser platforms. \n- Performed Quality Assurance for new versions of the product. \n- Organized and communicated customer feedback to respective teams. \n- Reported bugs to the engineering team to be fixed in a timely manner. \n- Worked on special projects with other departments such as Marketing, Sales, and Product Management. \n- Lead and trainer for new CS representatives. Customer Service Kno, Inc. July 2011  –  October 2012  (1 year 4 months) Santa Clara, CA Answered customer inquiries on phone, chat, and email. \n- Configured RightNow CRM software to establish knowledge base to maximize Customer Support efficiency. \n- Created Macros, Help, and FAQ guides for app on iOS, Android, and browser platforms. \n- Performed Quality Assurance for new versions of the product. \n- Organized and communicated customer feedback to respective teams. \n- Reported bugs to the engineering team to be fixed in a timely manner. \n- Worked on special projects with other departments such as Marketing, Sales, and Product Management. \n- Lead and trainer for new CS representatives. Skills Sales Microsoft Office 2007 Facebook Social Networking Event Planning Customer Service Social Media Time Management PowerPoint YouTube Social Media Marketing Microsoft Office Google Docs Microsoft Excel Retail Marketing Communications See 1+     See less Skills  Sales Microsoft Office 2007 Facebook Social Networking Event Planning Customer Service Social Media Time Management PowerPoint YouTube Social Media Marketing Microsoft Office Google Docs Microsoft Excel Retail Marketing Communications See 1+     See less Sales Microsoft Office 2007 Facebook Social Networking Event Planning Customer Service Social Media Time Management PowerPoint YouTube Social Media Marketing Microsoft Office Google Docs Microsoft Excel Retail Marketing Communications See 1+     See less Sales Microsoft Office 2007 Facebook Social Networking Event Planning Customer Service Social Media Time Management PowerPoint YouTube Social Media Marketing Microsoft Office Google Docs Microsoft Excel Retail Marketing Communications See 1+     See less Education San Jose State University Bachelor of Science,  Marketing 2007  – 2011 Activities and Societies:  GPA: 3.28 San Jose State University Bachelor of Science,  Marketing 2007  – 2011 Activities and Societies:  GPA: 3.28 San Jose State University Bachelor of Science,  Marketing 2007  – 2011 Activities and Societies:  GPA: 3.28 San Jose State University Bachelor of Science,  Marketing 2007  – 2011 Activities and Societies:  GPA: 3.28 ", "Skills Alliances Mobile Product Marketing Sales Management Software Sales Software Marketing Business Alliances Mobile Devices Wireless Skills  Alliances Mobile Product Marketing Sales Management Software Sales Software Marketing Business Alliances Mobile Devices Wireless Alliances Mobile Product Marketing Sales Management Software Sales Software Marketing Business Alliances Mobile Devices Wireless Alliances Mobile Product Marketing Sales Management Software Sales Software Marketing Business Alliances Mobile Devices Wireless ", "Summary Currently on the product marketing team for the Intel NUC and Intel Compute Stick, focusing mainly on go to market activities. Summary Currently on the product marketing team for the Intel NUC and Intel Compute Stick, focusing mainly on go to market activities. Currently on the product marketing team for the Intel NUC and Intel Compute Stick, focusing mainly on go to market activities. Currently on the product marketing team for the Intel NUC and Intel Compute Stick, focusing mainly on go to market activities. Experience Marketing Communications Specialist Intel Corporation June 2015  – Present (3 months) Hillsboro, Oregon Product Marketing Intern Intel Corporation July 2014  –  June 2015  (1 year) Hawthorn Farm, Hillsboro, Oregon Marketing intern on the product marketing team for the Intel® NUC (Client Computing Group within the Channel Innovation and Solutions Division). I have worked on a wide variety of projects at Intel thus far: managing content creation for go-to-market planning for the Intel NUC product line, reviewing and creating marketing materials such as product briefs, infographics, fliers, white papers, and industry briefs, posting on and updating Intel NUC social media accounts (Twitter, YouTube), analyzing market research results for mini PCs and other new form factors, and organizing the Intel NUC Challenge at Portland State University (contest runs Dec-May). Multiple Engineering Co-op Intern (MECOP) Intel Corporation July 2014  –  January 2015  (7 months) Hawthorn Farm Campus, Hillsboro, Oregon First MECOP internship. Educational Activities Committee Oregon State University October 2012  –  June 2014  (1 year 9 months) Oregon State University Kept record of allocation of University activity funds, organized committee meetings, and was the contact for campus organizations applying for funds. Sales Associate Nordstrom June 2011  –  December 2013  (2 years 7 months) Tigard, Oregon Sales associate in Children's shoes, Accessories and Sunglasses, and Brass Plum departments. Returned each summer and winter break from Oregon State University as a seasonal employee for three years. Marketing Communications Specialist Intel Corporation June 2015  – Present (3 months) Hillsboro, Oregon Marketing Communications Specialist Intel Corporation June 2015  – Present (3 months) Hillsboro, Oregon Product Marketing Intern Intel Corporation July 2014  –  June 2015  (1 year) Hawthorn Farm, Hillsboro, Oregon Marketing intern on the product marketing team for the Intel® NUC (Client Computing Group within the Channel Innovation and Solutions Division). I have worked on a wide variety of projects at Intel thus far: managing content creation for go-to-market planning for the Intel NUC product line, reviewing and creating marketing materials such as product briefs, infographics, fliers, white papers, and industry briefs, posting on and updating Intel NUC social media accounts (Twitter, YouTube), analyzing market research results for mini PCs and other new form factors, and organizing the Intel NUC Challenge at Portland State University (contest runs Dec-May). Product Marketing Intern Intel Corporation July 2014  –  June 2015  (1 year) Hawthorn Farm, Hillsboro, Oregon Marketing intern on the product marketing team for the Intel® NUC (Client Computing Group within the Channel Innovation and Solutions Division). I have worked on a wide variety of projects at Intel thus far: managing content creation for go-to-market planning for the Intel NUC product line, reviewing and creating marketing materials such as product briefs, infographics, fliers, white papers, and industry briefs, posting on and updating Intel NUC social media accounts (Twitter, YouTube), analyzing market research results for mini PCs and other new form factors, and organizing the Intel NUC Challenge at Portland State University (contest runs Dec-May). Multiple Engineering Co-op Intern (MECOP) Intel Corporation July 2014  –  January 2015  (7 months) Hawthorn Farm Campus, Hillsboro, Oregon First MECOP internship. Multiple Engineering Co-op Intern (MECOP) Intel Corporation July 2014  –  January 2015  (7 months) Hawthorn Farm Campus, Hillsboro, Oregon First MECOP internship. Educational Activities Committee Oregon State University October 2012  –  June 2014  (1 year 9 months) Oregon State University Kept record of allocation of University activity funds, organized committee meetings, and was the contact for campus organizations applying for funds. Educational Activities Committee Oregon State University October 2012  –  June 2014  (1 year 9 months) Oregon State University Kept record of allocation of University activity funds, organized committee meetings, and was the contact for campus organizations applying for funds. Sales Associate Nordstrom June 2011  –  December 2013  (2 years 7 months) Tigard, Oregon Sales associate in Children's shoes, Accessories and Sunglasses, and Brass Plum departments. Returned each summer and winter break from Oregon State University as a seasonal employee for three years. Sales Associate Nordstrom June 2011  –  December 2013  (2 years 7 months) Tigard, Oregon Sales associate in Children's shoes, Accessories and Sunglasses, and Brass Plum departments. Returned each summer and winter break from Oregon State University as a seasonal employee for three years. Skills Product Marketing Teamwork Event Planning Time Management Market Research Marketing Social Networking Social Media Marketing PowerPoint Microsoft Excel Twitter Microsoft Word Social Media Management Facebook Skills  Product Marketing Teamwork Event Planning Time Management Market Research Marketing Social Networking Social Media Marketing PowerPoint Microsoft Excel Twitter Microsoft Word Social Media Management Facebook Product Marketing Teamwork Event Planning Time Management Market Research Marketing Social Networking Social Media Marketing PowerPoint Microsoft Excel Twitter Microsoft Word Social Media Management Facebook Product Marketing Teamwork Event Planning Time Management Market Research Marketing Social Networking Social Media Marketing PowerPoint Microsoft Excel Twitter Microsoft Word Social Media Management Facebook Education Oregon State University Bachelor of Science (B.S.),  Marketing , Senior 2011  – 2015 Activities and Societies:  Educational Activities Committee ,  All University SING Marketing Committee ,  Oregon State Equestrian Team ,  Alpha Gamma Delta. Jesuit High School 2007  – 2011 Oregon State University Bachelor of Science (B.S.),  Marketing , Senior 2011  – 2015 Activities and Societies:  Educational Activities Committee ,  All University SING Marketing Committee ,  Oregon State Equestrian Team ,  Alpha Gamma Delta. Oregon State University Bachelor of Science (B.S.),  Marketing , Senior 2011  – 2015 Activities and Societies:  Educational Activities Committee ,  All University SING Marketing Committee ,  Oregon State Equestrian Team ,  Alpha Gamma Delta. Oregon State University Bachelor of Science (B.S.),  Marketing , Senior 2011  – 2015 Activities and Societies:  Educational Activities Committee ,  All University SING Marketing Committee ,  Oregon State Equestrian Team ,  Alpha Gamma Delta. Jesuit High School 2007  – 2011 Jesuit High School 2007  – 2011 Jesuit High School 2007  – 2011 ", "Languages English English English Skills Change Management -... Mentoring, coaching,... Change Management:... Communication Project... Corporate Communications Change Management Strategic Communications Leadership Internal Communications Project Management Customer Service Employee Benefits Process Improvement Management Strategy Strategic Planning Coaching Marketing Insurance Employee Engagement Project Planning Business Process Organizational... Human Resources See 10+     See less Skills  Change Management -... Mentoring, coaching,... Change Management:... Communication Project... Corporate Communications Change Management Strategic Communications Leadership Internal Communications Project Management Customer Service Employee Benefits Process Improvement Management Strategy Strategic Planning Coaching Marketing Insurance Employee Engagement Project Planning Business Process Organizational... Human Resources See 10+     See less Change Management -... Mentoring, coaching,... Change Management:... Communication Project... Corporate Communications Change Management Strategic Communications Leadership Internal Communications Project Management Customer Service Employee Benefits Process Improvement Management Strategy Strategic Planning Coaching Marketing Insurance Employee Engagement Project Planning Business Process Organizational... Human Resources See 10+     See less Change Management -... Mentoring, coaching,... Change Management:... Communication Project... Corporate Communications Change Management Strategic Communications Leadership Internal Communications Project Management Customer Service Employee Benefits Process Improvement Management Strategy Strategic Planning Coaching Marketing Insurance Employee Engagement Project Planning Business Process Organizational... Human Resources See 10+     See less Honors & Awards ", "Skills Product Marketing Strategic Partnerships Management Go-to-market Strategy Marketing Communications Channel Partners Team Leadership Competitive Analysis Skills  Product Marketing Strategic Partnerships Management Go-to-market Strategy Marketing Communications Channel Partners Team Leadership Competitive Analysis Product Marketing Strategic Partnerships Management Go-to-market Strategy Marketing Communications Channel Partners Team Leadership Competitive Analysis Product Marketing Strategic Partnerships Management Go-to-market Strategy Marketing Communications Channel Partners Team Leadership Competitive Analysis ", "Honors & Awards ", "Summary I recently graduated from the University of Oregon with both public relations and Spanish degrees. Be they on campus or abroad, my studies led me to developing passions for both writing and language. I began to merge these passions with one goal in mind: to help facilitate two-way communication among peoples of different cultures and backgrounds.  \n \nSee what I'm up to and visit my portfolio below! Summary I recently graduated from the University of Oregon with both public relations and Spanish degrees. Be they on campus or abroad, my studies led me to developing passions for both writing and language. I began to merge these passions with one goal in mind: to help facilitate two-way communication among peoples of different cultures and backgrounds.  \n \nSee what I'm up to and visit my portfolio below! I recently graduated from the University of Oregon with both public relations and Spanish degrees. Be they on campus or abroad, my studies led me to developing passions for both writing and language. I began to merge these passions with one goal in mind: to help facilitate two-way communication among peoples of different cultures and backgrounds.  \n \nSee what I'm up to and visit my portfolio below! I recently graduated from the University of Oregon with both public relations and Spanish degrees. Be they on campus or abroad, my studies led me to developing passions for both writing and language. I began to merge these passions with one goal in mind: to help facilitate two-way communication among peoples of different cultures and backgrounds.  \n \nSee what I'm up to and visit my portfolio below! Experience Internal Marketing Communications Specialist Intel Corporation August 2015  – Present (1 month) Hillsboro, OR Brand Strategy and Strategic Communications Intern Cambia Health Solutions March 2015  –  August 2015  (6 months) Portland, OR Developed messaging strategy and social media content \nWrote blog posts for internal and external target audiences \nCoordinated team projects alongside department managers Arbitration Clerk Hawes Financial Group October 2014  –  March 2015  (6 months) Springfield, OR Copy edited both English and Spanish legal documents \nAssisted litigators and attorneys prepare and organize lawsuits \nIdentified consumer-reported compliance violations \n Communications and Event Planning Intern American Cancer Society November 2013  –  July 2014  (9 months) Eugene, OR Wrote campaign strategy and incorporated social media planning\t \nHelped plan and execute Relay For Life and Bark For Life events \nCreated written and graphic materials for donation outreach \n Student Public Relations Rep. Green Alley Project January 2014  –  March 2014  (3 months) Eugene, OR Developed environmentalist campaign strategy  \nGarnered interest from Mayor Kitty Piercy and local businesses \nPublished by The Register-Guard in a front page article Freelance Writer Team Dignitas Ltd November 2012  –  June 2013  (8 months) Eugene, OR Drafted articles and reviews on videogames and technology\t \nApplied AP style to strengthen the company’s image \nReceived positive feedback for multiple contributions Graphic Design Intern United Components June 2012  –  September 2012  (4 months) Charlotte, NC Improved client relations through design and copy\t \nWrote and edited website articles to increase brand legitimacy \nManaged company website to promote user-website interaction Internal Marketing Communications Specialist Intel Corporation August 2015  – Present (1 month) Hillsboro, OR Internal Marketing Communications Specialist Intel Corporation August 2015  – Present (1 month) Hillsboro, OR Brand Strategy and Strategic Communications Intern Cambia Health Solutions March 2015  –  August 2015  (6 months) Portland, OR Developed messaging strategy and social media content \nWrote blog posts for internal and external target audiences \nCoordinated team projects alongside department managers Brand Strategy and Strategic Communications Intern Cambia Health Solutions March 2015  –  August 2015  (6 months) Portland, OR Developed messaging strategy and social media content \nWrote blog posts for internal and external target audiences \nCoordinated team projects alongside department managers Arbitration Clerk Hawes Financial Group October 2014  –  March 2015  (6 months) Springfield, OR Copy edited both English and Spanish legal documents \nAssisted litigators and attorneys prepare and organize lawsuits \nIdentified consumer-reported compliance violations \n Arbitration Clerk Hawes Financial Group October 2014  –  March 2015  (6 months) Springfield, OR Copy edited both English and Spanish legal documents \nAssisted litigators and attorneys prepare and organize lawsuits \nIdentified consumer-reported compliance violations \n Communications and Event Planning Intern American Cancer Society November 2013  –  July 2014  (9 months) Eugene, OR Wrote campaign strategy and incorporated social media planning\t \nHelped plan and execute Relay For Life and Bark For Life events \nCreated written and graphic materials for donation outreach \n Communications and Event Planning Intern American Cancer Society November 2013  –  July 2014  (9 months) Eugene, OR Wrote campaign strategy and incorporated social media planning\t \nHelped plan and execute Relay For Life and Bark For Life events \nCreated written and graphic materials for donation outreach \n Student Public Relations Rep. Green Alley Project January 2014  –  March 2014  (3 months) Eugene, OR Developed environmentalist campaign strategy  \nGarnered interest from Mayor Kitty Piercy and local businesses \nPublished by The Register-Guard in a front page article Student Public Relations Rep. Green Alley Project January 2014  –  March 2014  (3 months) Eugene, OR Developed environmentalist campaign strategy  \nGarnered interest from Mayor Kitty Piercy and local businesses \nPublished by The Register-Guard in a front page article Freelance Writer Team Dignitas Ltd November 2012  –  June 2013  (8 months) Eugene, OR Drafted articles and reviews on videogames and technology\t \nApplied AP style to strengthen the company’s image \nReceived positive feedback for multiple contributions Freelance Writer Team Dignitas Ltd November 2012  –  June 2013  (8 months) Eugene, OR Drafted articles and reviews on videogames and technology\t \nApplied AP style to strengthen the company’s image \nReceived positive feedback for multiple contributions Graphic Design Intern United Components June 2012  –  September 2012  (4 months) Charlotte, NC Improved client relations through design and copy\t \nWrote and edited website articles to increase brand legitimacy \nManaged company website to promote user-website interaction Graphic Design Intern United Components June 2012  –  September 2012  (4 months) Charlotte, NC Improved client relations through design and copy\t \nWrote and edited website articles to increase brand legitimacy \nManaged company website to promote user-website interaction Languages Spanish English Spanish English Spanish English Skills Social Networking Public Relations Social Media Media Relations Facebook Marketing Strategy Writing Social Media Marketing Marketing Communications Marketing Online Advertising Direct Marketing Integrated Marketing Digital Strategy Copywriting InDesign Digital Marketing Online Marketing Editing Advertising Graphic Design Photoshop AP Style Blogging Email Marketing See 10+     See less Skills  Social Networking Public Relations Social Media Media Relations Facebook Marketing Strategy Writing Social Media Marketing Marketing Communications Marketing Online Advertising Direct Marketing Integrated Marketing Digital Strategy Copywriting InDesign Digital Marketing Online Marketing Editing Advertising Graphic Design Photoshop AP Style Blogging Email Marketing See 10+     See less Social Networking Public Relations Social Media Media Relations Facebook Marketing Strategy Writing Social Media Marketing Marketing Communications Marketing Online Advertising Direct Marketing Integrated Marketing Digital Strategy Copywriting InDesign Digital Marketing Online Marketing Editing Advertising Graphic Design Photoshop AP Style Blogging Email Marketing See 10+     See less Social Networking Public Relations Social Media Media Relations Facebook Marketing Strategy Writing Social Media Marketing Marketing Communications Marketing Online Advertising Direct Marketing Integrated Marketing Digital Strategy Copywriting InDesign Digital Marketing Online Marketing Editing Advertising Graphic Design Photoshop AP Style Blogging Email Marketing See 10+     See less Education University of Oregon Bachelor of Arts (BA),  Public Relations 2010  – 2014 Became a member of the Public Relations Student Society of America (PRSSA) during my time at the School of Journalism and Communication. Familiarized myself with client work, campaign strategy and brand management through my courses. University of Oregon Bachelor of Arts (BA),  Spanish Language and Literature 2010  – 2014 Studied abroad in Mexico for three months at the Instituto Tecnológico de Querétaro while living with a Mexican family and immersing myself in culture. I also took the time to travel and explore in between Spanish courses. University of Oregon Bachelor of Arts (BA),  Public Relations 2010  – 2014 Became a member of the Public Relations Student Society of America (PRSSA) during my time at the School of Journalism and Communication. Familiarized myself with client work, campaign strategy and brand management through my courses. University of Oregon Bachelor of Arts (BA),  Public Relations 2010  – 2014 Became a member of the Public Relations Student Society of America (PRSSA) during my time at the School of Journalism and Communication. Familiarized myself with client work, campaign strategy and brand management through my courses. University of Oregon Bachelor of Arts (BA),  Public Relations 2010  – 2014 Became a member of the Public Relations Student Society of America (PRSSA) during my time at the School of Journalism and Communication. Familiarized myself with client work, campaign strategy and brand management through my courses. University of Oregon Bachelor of Arts (BA),  Spanish Language and Literature 2010  – 2014 Studied abroad in Mexico for three months at the Instituto Tecnológico de Querétaro while living with a Mexican family and immersing myself in culture. I also took the time to travel and explore in between Spanish courses. University of Oregon Bachelor of Arts (BA),  Spanish Language and Literature 2010  – 2014 Studied abroad in Mexico for three months at the Instituto Tecnológico de Querétaro while living with a Mexican family and immersing myself in culture. I also took the time to travel and explore in between Spanish courses. University of Oregon Bachelor of Arts (BA),  Spanish Language and Literature 2010  – 2014 Studied abroad in Mexico for three months at the Instituto Tecnológico de Querétaro while living with a Mexican family and immersing myself in culture. I also took the time to travel and explore in between Spanish courses. Honors & Awards ", "Summary Energetic, enthusiastic communications manager with award winning experience. Provide strategies and solutions for corporate communications challenges. Competently skilled in the development, management and tactical execution of communications strategies and solutions. Inquisitive, analytical, creative, resourceful, results-oriented professional. Excellent ability to inspire and lead teams.  \n \nLover of a good story. Effectively employ corporate storytelling—via an integrated communications channels approach—to humanize the workplace and successfully activate employee enthusiasm and engagement in a targeted manner. \n \nInternal communications │ Communications strategies │ Key messages │ Internal social media │ Engage employees effectively │ Integrated communications function │ Provide communications coaching Summary Energetic, enthusiastic communications manager with award winning experience. Provide strategies and solutions for corporate communications challenges. Competently skilled in the development, management and tactical execution of communications strategies and solutions. Inquisitive, analytical, creative, resourceful, results-oriented professional. Excellent ability to inspire and lead teams.  \n \nLover of a good story. Effectively employ corporate storytelling—via an integrated communications channels approach—to humanize the workplace and successfully activate employee enthusiasm and engagement in a targeted manner. \n \nInternal communications │ Communications strategies │ Key messages │ Internal social media │ Engage employees effectively │ Integrated communications function │ Provide communications coaching Energetic, enthusiastic communications manager with award winning experience. Provide strategies and solutions for corporate communications challenges. Competently skilled in the development, management and tactical execution of communications strategies and solutions. Inquisitive, analytical, creative, resourceful, results-oriented professional. Excellent ability to inspire and lead teams.  \n \nLover of a good story. Effectively employ corporate storytelling—via an integrated communications channels approach—to humanize the workplace and successfully activate employee enthusiasm and engagement in a targeted manner. \n \nInternal communications │ Communications strategies │ Key messages │ Internal social media │ Engage employees effectively │ Integrated communications function │ Provide communications coaching Energetic, enthusiastic communications manager with award winning experience. Provide strategies and solutions for corporate communications challenges. Competently skilled in the development, management and tactical execution of communications strategies and solutions. Inquisitive, analytical, creative, resourceful, results-oriented professional. Excellent ability to inspire and lead teams.  \n \nLover of a good story. Effectively employ corporate storytelling—via an integrated communications channels approach—to humanize the workplace and successfully activate employee enthusiasm and engagement in a targeted manner. \n \nInternal communications │ Communications strategies │ Key messages │ Internal social media │ Engage employees effectively │ Integrated communications function │ Provide communications coaching Experience Communications and Marketing Professional Consultant April 2014  – Present (1 year 5 months) Writing, editing, development of marketing and communications strategies and plans, development and execution of targeted emails and newsletters, planning and execution of social media plans and digital marketing plans. Vice President Marketing and Communications IABC/Oregon-Columbia 2013  – Present (2 years) Portland, Oregon Area The VP of Marketing and Communications for the Oregon-Columbia chapter of the International Association of Business Communicators (IABC) is a volunteer role. Key responsibilities include developing written communications as needed and maintaining media relations. \n•\tWrites newsletter content and/or solicits contributors for monthly newsletter \n•\tWrites press releases and sends to appropriate media to promote upcoming events \n•\tWrites other content, as needed (or solicits contributors) \n•\tNurtures media relationships and maintains media contact list and accurate records of activities \n•\tWorks collaboratively with Vice President of Digital Communications to ensure an integrated, fluid marketing plan is followed that appropriately utilizes social and digital channels. \n•\tWorks collaboratively with Vice President of Membership leveraging marketing and communications efforts to recruit new members and retain existing members. \n \nAdditional duties: \n•\tActively seek deputies and volunteers from within chapter membership \n•\tAttend monthly board meetings \n•\tAttend chapter meetings (professional development/speaker events and professional communicator networking events) Communications Manger for the IT Strategy Office Intel Corporation July 2013  –  April 2014  (10 months) Hillsboro, Oregon Partner with a wide variety of key stakeholders to provide strategic communications support towards executing a comprehensive, valuable portfolio of communications designed to activate and align IT employees to IT’s Strategy and business priorities. This position requires developing communications strategies and plans and working with others to execute against those plans. Used an integrated set of communications channels to maximize reach and to deepen employee understanding of messaging. Talent Advisor Intel Corporation June 2012  –  June 2013  (1 year 1 month) Hillsboro, Oregon Expanded version of Sr. Technical Recruiter position. Software Talent Branding & Marketing Project Manager Intel Corporation April 2011  –  June 2012  (1 year 3 months) Hillsboro, Oregon Developed a multi-phase software talent employment brand strategy and new marketing channel plan. Worked with existing staffing marketing team to leverage current employment branding strategies and marketing channels, while simultaneously \"breaking away\" to explore unique, untapped marketing resources and channels. Leveraged internal software resources as well as external resources (creative agencies) throughout the employment branding and marketing plan cycle. Measured ROI using third-party and internal web tools such as click rates and website traffic rates being driven to a specific landing page from targeted external sites used as marketing channels. Coordinated the software talent presence portion of SigGraph 2011 and OScon 2011. Worked with external creative agencies regarding: photo shoots, collateral material, signage, and other marketing tools. College Recruiter Intel Corporation Intel Corporation January 2011  –  April 2011  (4 months) Hillsboro, Oregon Assigned to college recruiting team when a seasoned technical recruiter was needed. During this assignment, I continued to develop and deepen career skills in communications, marketing and branding and leadership, leading to an assignment in Staffing Marketing as the Software Talent Branding & Marketing Project Manager. Employee Communications Specialist Intel Corporation June 2010  –  December 2010  (7 months) Hillsboro, Oregon Rotational Assignment: Internal communications across several business groups at Intel Corporation. Included: writing, publishing, consulting with key stakeholders within the business, researching, applying social media channels to messages where appropriate, building communications strategies all while working both collaboratively and independantly on tight, deadline-driven schedules. Sr. Technical Recruiter Intel Corporation December 2003  –  May 2010  (6 years 6 months) Hillsboro, Oregon Work collaboratively and consultatively with business groups to fulfill their external hiring needs. Responsible for sourcing/recruiting both experienced and recent college graduates. Recruit software and hardware engineers, technical marketing engineers, and product marketing engineers. Senior Corporate Recruiter LiveBridge Inc. April 2002  –  December 2003  (1 year 9 months) Full-lifecycle recuriting of middle management through C-level employees for LiveBridge Inc. Developed strategic sourcing plans and fulfilled tactical recruiting requirements in response to workforce planning initiatives. Consulted directly with management/executive C-level employees. Automated recruiting processes and developed training materials and trained junior level and new recruiters. Informally mentored less senior level staffing/HR professional. Developed and fulfilled advertising campaigns. Responsible for recruiting across the United States and Canada. Successfully ramped one new call center in Canada. \n \nAffiliated Computer Services (ACS) purchased LiveBridge Inc.in 2005. LiveBridge is a call center agency serving the financial and telecommunications industries. Sr. Technical Recruiter Cotelligent 1999  –  1999  (less than a year) Technical Recruiter Excell Data Corporation 1998  –  1999  (1 year) Communications and Marketing Professional Consultant April 2014  – Present (1 year 5 months) Writing, editing, development of marketing and communications strategies and plans, development and execution of targeted emails and newsletters, planning and execution of social media plans and digital marketing plans. Communications and Marketing Professional Consultant April 2014  – Present (1 year 5 months) Writing, editing, development of marketing and communications strategies and plans, development and execution of targeted emails and newsletters, planning and execution of social media plans and digital marketing plans. Vice President Marketing and Communications IABC/Oregon-Columbia 2013  – Present (2 years) Portland, Oregon Area The VP of Marketing and Communications for the Oregon-Columbia chapter of the International Association of Business Communicators (IABC) is a volunteer role. Key responsibilities include developing written communications as needed and maintaining media relations. \n•\tWrites newsletter content and/or solicits contributors for monthly newsletter \n•\tWrites press releases and sends to appropriate media to promote upcoming events \n•\tWrites other content, as needed (or solicits contributors) \n•\tNurtures media relationships and maintains media contact list and accurate records of activities \n•\tWorks collaboratively with Vice President of Digital Communications to ensure an integrated, fluid marketing plan is followed that appropriately utilizes social and digital channels. \n•\tWorks collaboratively with Vice President of Membership leveraging marketing and communications efforts to recruit new members and retain existing members. \n \nAdditional duties: \n•\tActively seek deputies and volunteers from within chapter membership \n•\tAttend monthly board meetings \n•\tAttend chapter meetings (professional development/speaker events and professional communicator networking events) Vice President Marketing and Communications IABC/Oregon-Columbia 2013  – Present (2 years) Portland, Oregon Area The VP of Marketing and Communications for the Oregon-Columbia chapter of the International Association of Business Communicators (IABC) is a volunteer role. Key responsibilities include developing written communications as needed and maintaining media relations. \n•\tWrites newsletter content and/or solicits contributors for monthly newsletter \n•\tWrites press releases and sends to appropriate media to promote upcoming events \n•\tWrites other content, as needed (or solicits contributors) \n•\tNurtures media relationships and maintains media contact list and accurate records of activities \n•\tWorks collaboratively with Vice President of Digital Communications to ensure an integrated, fluid marketing plan is followed that appropriately utilizes social and digital channels. \n•\tWorks collaboratively with Vice President of Membership leveraging marketing and communications efforts to recruit new members and retain existing members. \n \nAdditional duties: \n•\tActively seek deputies and volunteers from within chapter membership \n•\tAttend monthly board meetings \n•\tAttend chapter meetings (professional development/speaker events and professional communicator networking events) Communications Manger for the IT Strategy Office Intel Corporation July 2013  –  April 2014  (10 months) Hillsboro, Oregon Partner with a wide variety of key stakeholders to provide strategic communications support towards executing a comprehensive, valuable portfolio of communications designed to activate and align IT employees to IT’s Strategy and business priorities. This position requires developing communications strategies and plans and working with others to execute against those plans. Used an integrated set of communications channels to maximize reach and to deepen employee understanding of messaging. Communications Manger for the IT Strategy Office Intel Corporation July 2013  –  April 2014  (10 months) Hillsboro, Oregon Partner with a wide variety of key stakeholders to provide strategic communications support towards executing a comprehensive, valuable portfolio of communications designed to activate and align IT employees to IT’s Strategy and business priorities. This position requires developing communications strategies and plans and working with others to execute against those plans. Used an integrated set of communications channels to maximize reach and to deepen employee understanding of messaging. Talent Advisor Intel Corporation June 2012  –  June 2013  (1 year 1 month) Hillsboro, Oregon Expanded version of Sr. Technical Recruiter position. Talent Advisor Intel Corporation June 2012  –  June 2013  (1 year 1 month) Hillsboro, Oregon Expanded version of Sr. Technical Recruiter position. Software Talent Branding & Marketing Project Manager Intel Corporation April 2011  –  June 2012  (1 year 3 months) Hillsboro, Oregon Developed a multi-phase software talent employment brand strategy and new marketing channel plan. Worked with existing staffing marketing team to leverage current employment branding strategies and marketing channels, while simultaneously \"breaking away\" to explore unique, untapped marketing resources and channels. Leveraged internal software resources as well as external resources (creative agencies) throughout the employment branding and marketing plan cycle. Measured ROI using third-party and internal web tools such as click rates and website traffic rates being driven to a specific landing page from targeted external sites used as marketing channels. Coordinated the software talent presence portion of SigGraph 2011 and OScon 2011. Worked with external creative agencies regarding: photo shoots, collateral material, signage, and other marketing tools. Software Talent Branding & Marketing Project Manager Intel Corporation April 2011  –  June 2012  (1 year 3 months) Hillsboro, Oregon Developed a multi-phase software talent employment brand strategy and new marketing channel plan. Worked with existing staffing marketing team to leverage current employment branding strategies and marketing channels, while simultaneously \"breaking away\" to explore unique, untapped marketing resources and channels. Leveraged internal software resources as well as external resources (creative agencies) throughout the employment branding and marketing plan cycle. Measured ROI using third-party and internal web tools such as click rates and website traffic rates being driven to a specific landing page from targeted external sites used as marketing channels. Coordinated the software talent presence portion of SigGraph 2011 and OScon 2011. Worked with external creative agencies regarding: photo shoots, collateral material, signage, and other marketing tools. College Recruiter Intel Corporation Intel Corporation January 2011  –  April 2011  (4 months) Hillsboro, Oregon Assigned to college recruiting team when a seasoned technical recruiter was needed. During this assignment, I continued to develop and deepen career skills in communications, marketing and branding and leadership, leading to an assignment in Staffing Marketing as the Software Talent Branding & Marketing Project Manager. College Recruiter Intel Corporation Intel Corporation January 2011  –  April 2011  (4 months) Hillsboro, Oregon Assigned to college recruiting team when a seasoned technical recruiter was needed. During this assignment, I continued to develop and deepen career skills in communications, marketing and branding and leadership, leading to an assignment in Staffing Marketing as the Software Talent Branding & Marketing Project Manager. Employee Communications Specialist Intel Corporation June 2010  –  December 2010  (7 months) Hillsboro, Oregon Rotational Assignment: Internal communications across several business groups at Intel Corporation. Included: writing, publishing, consulting with key stakeholders within the business, researching, applying social media channels to messages where appropriate, building communications strategies all while working both collaboratively and independantly on tight, deadline-driven schedules. Employee Communications Specialist Intel Corporation June 2010  –  December 2010  (7 months) Hillsboro, Oregon Rotational Assignment: Internal communications across several business groups at Intel Corporation. Included: writing, publishing, consulting with key stakeholders within the business, researching, applying social media channels to messages where appropriate, building communications strategies all while working both collaboratively and independantly on tight, deadline-driven schedules. Sr. Technical Recruiter Intel Corporation December 2003  –  May 2010  (6 years 6 months) Hillsboro, Oregon Work collaboratively and consultatively with business groups to fulfill their external hiring needs. Responsible for sourcing/recruiting both experienced and recent college graduates. Recruit software and hardware engineers, technical marketing engineers, and product marketing engineers. Sr. Technical Recruiter Intel Corporation December 2003  –  May 2010  (6 years 6 months) Hillsboro, Oregon Work collaboratively and consultatively with business groups to fulfill their external hiring needs. Responsible for sourcing/recruiting both experienced and recent college graduates. Recruit software and hardware engineers, technical marketing engineers, and product marketing engineers. Senior Corporate Recruiter LiveBridge Inc. April 2002  –  December 2003  (1 year 9 months) Full-lifecycle recuriting of middle management through C-level employees for LiveBridge Inc. Developed strategic sourcing plans and fulfilled tactical recruiting requirements in response to workforce planning initiatives. Consulted directly with management/executive C-level employees. Automated recruiting processes and developed training materials and trained junior level and new recruiters. Informally mentored less senior level staffing/HR professional. Developed and fulfilled advertising campaigns. Responsible for recruiting across the United States and Canada. Successfully ramped one new call center in Canada. \n \nAffiliated Computer Services (ACS) purchased LiveBridge Inc.in 2005. LiveBridge is a call center agency serving the financial and telecommunications industries. Senior Corporate Recruiter LiveBridge Inc. April 2002  –  December 2003  (1 year 9 months) Full-lifecycle recuriting of middle management through C-level employees for LiveBridge Inc. Developed strategic sourcing plans and fulfilled tactical recruiting requirements in response to workforce planning initiatives. Consulted directly with management/executive C-level employees. Automated recruiting processes and developed training materials and trained junior level and new recruiters. Informally mentored less senior level staffing/HR professional. Developed and fulfilled advertising campaigns. Responsible for recruiting across the United States and Canada. Successfully ramped one new call center in Canada. \n \nAffiliated Computer Services (ACS) purchased LiveBridge Inc.in 2005. LiveBridge is a call center agency serving the financial and telecommunications industries. Sr. Technical Recruiter Cotelligent 1999  –  1999  (less than a year) Sr. Technical Recruiter Cotelligent 1999  –  1999  (less than a year) Technical Recruiter Excell Data Corporation 1998  –  1999  (1 year) Technical Recruiter Excell Data Corporation 1998  –  1999  (1 year) Languages French Limited working proficiency German Limited working proficiency French Limited working proficiency German Limited working proficiency French Limited working proficiency German Limited working proficiency Limited working proficiency Limited working proficiency Skills Strategy Leadership Stakeholder Management Marketing Communications Employer Branding Internal Communications Marketing Digital Marketing Employee Engagement Social Media Marketing Consulting Program Management Training Management Project Management Writing Strategic Communications Product Marketing Strategic Planning Networking Human Resources Temporary Placement Coaching Workforce Planning Organizational... Taleo Onboarding Recruiting Vendor Management Contract Recruitment Screening Resumes Social Media Applicant Tracking... College Recruiting Personnel Management Start-ups Interviews Hiring Executive Search Employee Relations Performance Management Talent Acquisition Sourcing Technical Recruiting Full-cycle Recruiting Internet Recruiting Talent Management Corporate Communications See 33+     See less Skills  Strategy Leadership Stakeholder Management Marketing Communications Employer Branding Internal Communications Marketing Digital Marketing Employee Engagement Social Media Marketing Consulting Program Management Training Management Project Management Writing Strategic Communications Product Marketing Strategic Planning Networking Human Resources Temporary Placement Coaching Workforce Planning Organizational... Taleo Onboarding Recruiting Vendor Management Contract Recruitment Screening Resumes Social Media Applicant Tracking... College Recruiting Personnel Management Start-ups Interviews Hiring Executive Search Employee Relations Performance Management Talent Acquisition Sourcing Technical Recruiting Full-cycle Recruiting Internet Recruiting Talent Management Corporate Communications See 33+     See less Strategy Leadership Stakeholder Management Marketing Communications Employer Branding Internal Communications Marketing Digital Marketing Employee Engagement Social Media Marketing Consulting Program Management Training Management Project Management Writing Strategic Communications Product Marketing Strategic Planning Networking Human Resources Temporary Placement Coaching Workforce Planning Organizational... Taleo Onboarding Recruiting Vendor Management Contract Recruitment Screening Resumes Social Media Applicant Tracking... College Recruiting Personnel Management Start-ups Interviews Hiring Executive Search Employee Relations Performance Management Talent Acquisition Sourcing Technical Recruiting Full-cycle Recruiting Internet Recruiting Talent Management Corporate Communications See 33+     See less Strategy Leadership Stakeholder Management Marketing Communications Employer Branding Internal Communications Marketing Digital Marketing Employee Engagement Social Media Marketing Consulting Program Management Training Management Project Management Writing Strategic Communications Product Marketing Strategic Planning Networking Human Resources Temporary Placement Coaching Workforce Planning Organizational... Taleo Onboarding Recruiting Vendor Management Contract Recruitment Screening Resumes Social Media Applicant Tracking... College Recruiting Personnel Management Start-ups Interviews Hiring Executive Search Employee Relations Performance Management Talent Acquisition Sourcing Technical Recruiting Full-cycle Recruiting Internet Recruiting Talent Management Corporate Communications See 33+     See less Education University of Minnesota Bachelor of Liberal Arts,  Communications 1991 Activities and Societies:  Alpha Delta Pi\nJr. Panhellenic Association Cambridgeshire College of Arts and Technology Music Performance , General Oregon College of Art and Craft Oregon College of Art and Craft University of Minnesota Bachelor of Liberal Arts,  Communications 1991 Activities and Societies:  Alpha Delta Pi\nJr. Panhellenic Association University of Minnesota Bachelor of Liberal Arts,  Communications 1991 Activities and Societies:  Alpha Delta Pi\nJr. Panhellenic Association University of Minnesota Bachelor of Liberal Arts,  Communications 1991 Activities and Societies:  Alpha Delta Pi\nJr. Panhellenic Association Cambridgeshire College of Arts and Technology Music Performance , General Cambridgeshire College of Arts and Technology Music Performance , General Cambridgeshire College of Arts and Technology Music Performance , General Oregon College of Art and Craft Oregon College of Art and Craft Oregon College of Art and Craft Oregon College of Art and Craft Oregon College of Art and Craft Oregon College of Art and Craft Honors & Awards Women@Intel Network (WIN) Conference Co-Chair, 2013 Women@Intel (WIN), an organization promoting leadership development in women November 2013 Awarded an Intel Recognition Award by WIN for planning and executing the most successful conference in five years. The conference served 625 women in Oregon and over 1,800 internationally, via a live-stream link streamed through a virtual conference hall setting tool.  \n \nRecruited from role as Co-Chair of Marketing Committee to step in and co-chair this event when it became necessary for one of the original co-chairs to relocate overseas on business. Over a period of four months leading up to the event, co-directed and co-managed the work of 20 volunteers heading up sub-committees necessary for planning and execution of an outstanding professional conference event. Additionally, day-of-conference, oversaw and directed the work of 60+ onsite volunteers and executed all day-of-event tasks required of a co-chair such as introducing Master of Ceremonies, providing direction to all volunteers to make event flow smoothly, and wrapping up the conference. Conducted post-conference debrief with committee chairs and contributed to final presentation to the WIN Board detailing results of the conference. It was my pleasure to work with an outstanding Co-Chair on this event. Intel Quality (IQA) Award, 2012 Intel Corporation June 2012 Considered the most prestigious award at Intel. Human Resources Enterprise Services global organization made a significant transformation, driving down costs by 19 percent over the three years. Cracked down on many complicated processes, including hiring, whittling the time it takes to interview and hire someone from weeks to just days. \n \nA valuable and significant piece of this award was predicated on attracting and hiring software talent to Intel. As the SW Talent Branding/Marketing Project Manager for the US market, I led the US effort--within a global effort--to attract and hire software talent for Intel. \n Intel HR Department Recognition Award, 2011 Human Resources Department, Intel Corporation Content Expert and Project Manager for Software Talent Attract Project. Drove the employee branding campaign in the USA, resulting in Staffing reaching and exceeding their software talent hiring goals for 2011 and 2012. \n Intel Talent for Talent Award, 2010 Staffing and Talent Department, Intel Corporation As a Project Manager, drove an effort to redesign the Foreign National Offer process, reducing through-put time of desired candidates without permanent, unrestricted right to work in the USA for work approval from three weeks down to five days. The redesign increased our competitive edge and increased our ability to attract top talent. \n Women@Intel Network (WIN) Conference Co-Chair, 2013 Women@Intel (WIN), an organization promoting leadership development in women November 2013 Awarded an Intel Recognition Award by WIN for planning and executing the most successful conference in five years. The conference served 625 women in Oregon and over 1,800 internationally, via a live-stream link streamed through a virtual conference hall setting tool.  \n \nRecruited from role as Co-Chair of Marketing Committee to step in and co-chair this event when it became necessary for one of the original co-chairs to relocate overseas on business. Over a period of four months leading up to the event, co-directed and co-managed the work of 20 volunteers heading up sub-committees necessary for planning and execution of an outstanding professional conference event. Additionally, day-of-conference, oversaw and directed the work of 60+ onsite volunteers and executed all day-of-event tasks required of a co-chair such as introducing Master of Ceremonies, providing direction to all volunteers to make event flow smoothly, and wrapping up the conference. Conducted post-conference debrief with committee chairs and contributed to final presentation to the WIN Board detailing results of the conference. It was my pleasure to work with an outstanding Co-Chair on this event. Women@Intel Network (WIN) Conference Co-Chair, 2013 Women@Intel (WIN), an organization promoting leadership development in women November 2013 Awarded an Intel Recognition Award by WIN for planning and executing the most successful conference in five years. The conference served 625 women in Oregon and over 1,800 internationally, via a live-stream link streamed through a virtual conference hall setting tool.  \n \nRecruited from role as Co-Chair of Marketing Committee to step in and co-chair this event when it became necessary for one of the original co-chairs to relocate overseas on business. Over a period of four months leading up to the event, co-directed and co-managed the work of 20 volunteers heading up sub-committees necessary for planning and execution of an outstanding professional conference event. Additionally, day-of-conference, oversaw and directed the work of 60+ onsite volunteers and executed all day-of-event tasks required of a co-chair such as introducing Master of Ceremonies, providing direction to all volunteers to make event flow smoothly, and wrapping up the conference. Conducted post-conference debrief with committee chairs and contributed to final presentation to the WIN Board detailing results of the conference. It was my pleasure to work with an outstanding Co-Chair on this event. Women@Intel Network (WIN) Conference Co-Chair, 2013 Women@Intel (WIN), an organization promoting leadership development in women November 2013 Awarded an Intel Recognition Award by WIN for planning and executing the most successful conference in five years. The conference served 625 women in Oregon and over 1,800 internationally, via a live-stream link streamed through a virtual conference hall setting tool.  \n \nRecruited from role as Co-Chair of Marketing Committee to step in and co-chair this event when it became necessary for one of the original co-chairs to relocate overseas on business. Over a period of four months leading up to the event, co-directed and co-managed the work of 20 volunteers heading up sub-committees necessary for planning and execution of an outstanding professional conference event. Additionally, day-of-conference, oversaw and directed the work of 60+ onsite volunteers and executed all day-of-event tasks required of a co-chair such as introducing Master of Ceremonies, providing direction to all volunteers to make event flow smoothly, and wrapping up the conference. Conducted post-conference debrief with committee chairs and contributed to final presentation to the WIN Board detailing results of the conference. It was my pleasure to work with an outstanding Co-Chair on this event. Intel Quality (IQA) Award, 2012 Intel Corporation June 2012 Considered the most prestigious award at Intel. Human Resources Enterprise Services global organization made a significant transformation, driving down costs by 19 percent over the three years. Cracked down on many complicated processes, including hiring, whittling the time it takes to interview and hire someone from weeks to just days. \n \nA valuable and significant piece of this award was predicated on attracting and hiring software talent to Intel. As the SW Talent Branding/Marketing Project Manager for the US market, I led the US effort--within a global effort--to attract and hire software talent for Intel. \n Intel Quality (IQA) Award, 2012 Intel Corporation June 2012 Considered the most prestigious award at Intel. Human Resources Enterprise Services global organization made a significant transformation, driving down costs by 19 percent over the three years. Cracked down on many complicated processes, including hiring, whittling the time it takes to interview and hire someone from weeks to just days. \n \nA valuable and significant piece of this award was predicated on attracting and hiring software talent to Intel. As the SW Talent Branding/Marketing Project Manager for the US market, I led the US effort--within a global effort--to attract and hire software talent for Intel. \n Intel Quality (IQA) Award, 2012 Intel Corporation June 2012 Considered the most prestigious award at Intel. Human Resources Enterprise Services global organization made a significant transformation, driving down costs by 19 percent over the three years. Cracked down on many complicated processes, including hiring, whittling the time it takes to interview and hire someone from weeks to just days. \n \nA valuable and significant piece of this award was predicated on attracting and hiring software talent to Intel. As the SW Talent Branding/Marketing Project Manager for the US market, I led the US effort--within a global effort--to attract and hire software talent for Intel. \n Intel HR Department Recognition Award, 2011 Human Resources Department, Intel Corporation Content Expert and Project Manager for Software Talent Attract Project. Drove the employee branding campaign in the USA, resulting in Staffing reaching and exceeding their software talent hiring goals for 2011 and 2012. \n Intel HR Department Recognition Award, 2011 Human Resources Department, Intel Corporation Content Expert and Project Manager for Software Talent Attract Project. Drove the employee branding campaign in the USA, resulting in Staffing reaching and exceeding their software talent hiring goals for 2011 and 2012. \n Intel HR Department Recognition Award, 2011 Human Resources Department, Intel Corporation Content Expert and Project Manager for Software Talent Attract Project. Drove the employee branding campaign in the USA, resulting in Staffing reaching and exceeding their software talent hiring goals for 2011 and 2012. \n Intel Talent for Talent Award, 2010 Staffing and Talent Department, Intel Corporation As a Project Manager, drove an effort to redesign the Foreign National Offer process, reducing through-put time of desired candidates without permanent, unrestricted right to work in the USA for work approval from three weeks down to five days. The redesign increased our competitive edge and increased our ability to attract top talent. \n Intel Talent for Talent Award, 2010 Staffing and Talent Department, Intel Corporation As a Project Manager, drove an effort to redesign the Foreign National Offer process, reducing through-put time of desired candidates without permanent, unrestricted right to work in the USA for work approval from three weeks down to five days. The redesign increased our competitive edge and increased our ability to attract top talent. \n Intel Talent for Talent Award, 2010 Staffing and Talent Department, Intel Corporation As a Project Manager, drove an effort to redesign the Foreign National Offer process, reducing through-put time of desired candidates without permanent, unrestricted right to work in the USA for work approval from three weeks down to five days. The redesign increased our competitive edge and increased our ability to attract top talent. \n ", "", "Summary I am a dependable, capable and strategically minded HR professional with an eagerness to progress and develop my career. I am an energetic and hardworking individual who thrives in a dynamic, fast-paced environment. Summary I am a dependable, capable and strategically minded HR professional with an eagerness to progress and develop my career. I am an energetic and hardworking individual who thrives in a dynamic, fast-paced environment. I am a dependable, capable and strategically minded HR professional with an eagerness to progress and develop my career. I am an energetic and hardworking individual who thrives in a dynamic, fast-paced environment. I am a dependable, capable and strategically minded HR professional with an eagerness to progress and develop my career. I am an energetic and hardworking individual who thrives in a dynamic, fast-paced environment. Experience EMEA Communications Specialist Intel Corporation April 2014  – Present (1 year 5 months) Leixlip, Ireland Develop, drive, execute and measure internal communications and engagement strategies that builds employee understanding of, and belief in, the vision of the organisation. \nBuild employee engagement with the vision, values and principles of the organisation. \nDevelop communication strategies for EMEA-wide internal projects and campaigns.  \nEngage with new communications channels and maximise efficiency of existing channels using appropriate new technologies to maximise engagement and individual connection to business success. \nResearch, write and publish internal strategic business stories from Ireland and EMEA. Partner with the Global Internal News team to share these stories with the wider Intel employee base.  \nAssist the Ireland Internal Communications Manager on event management / managing internal VIP visits/ Executive events Ireland Employee Commuications Specialist Intel Corporation September 2013  – Present (2 years) Leixlip, Ireland As a member of the GER Employee Communications (EC) team I am responsible for implementing and executing internal employee communication programs and events including planning, writing, or producing employee communications, newsletters, internal publications, employee open forums, business update meetings, etc. I also research relevant internal topics, find ways to understand your audience, and create compelling communications that summarise and present that information in a way that connects with the audience.  \n \nI work closely with the Ireland EC Account manager, HR and business partners to support Ireland employee and manager communication needs. My position also requires close co-operation with other internal communications partners in business groups, including Corporate Affairs to publicise internal key messages and events at cross-EMEA/biz group/site level. Clerical Officer Department of Social Protection November 2012  –  September 2013  (11 months) Killarney Deciding Officer within the new Intreo Office, carrying out interviews and making live decisions on jobseeker claims Sales Associate River Island June 2012  –  October 2012  (5 months) Limerick Sales Assistant Mollys Xpress Stop & Shop May 2007  –  May 2012  (5 years 1 month) Kerry Bartender and Waitress Fools and Horses Bar and Restaurant June 2010  –  August 2010  (3 months) Lagos, Algarve, Portugal EMEA Communications Specialist Intel Corporation April 2014  – Present (1 year 5 months) Leixlip, Ireland Develop, drive, execute and measure internal communications and engagement strategies that builds employee understanding of, and belief in, the vision of the organisation. \nBuild employee engagement with the vision, values and principles of the organisation. \nDevelop communication strategies for EMEA-wide internal projects and campaigns.  \nEngage with new communications channels and maximise efficiency of existing channels using appropriate new technologies to maximise engagement and individual connection to business success. \nResearch, write and publish internal strategic business stories from Ireland and EMEA. Partner with the Global Internal News team to share these stories with the wider Intel employee base.  \nAssist the Ireland Internal Communications Manager on event management / managing internal VIP visits/ Executive events EMEA Communications Specialist Intel Corporation April 2014  – Present (1 year 5 months) Leixlip, Ireland Develop, drive, execute and measure internal communications and engagement strategies that builds employee understanding of, and belief in, the vision of the organisation. \nBuild employee engagement with the vision, values and principles of the organisation. \nDevelop communication strategies for EMEA-wide internal projects and campaigns.  \nEngage with new communications channels and maximise efficiency of existing channels using appropriate new technologies to maximise engagement and individual connection to business success. \nResearch, write and publish internal strategic business stories from Ireland and EMEA. Partner with the Global Internal News team to share these stories with the wider Intel employee base.  \nAssist the Ireland Internal Communications Manager on event management / managing internal VIP visits/ Executive events Ireland Employee Commuications Specialist Intel Corporation September 2013  – Present (2 years) Leixlip, Ireland As a member of the GER Employee Communications (EC) team I am responsible for implementing and executing internal employee communication programs and events including planning, writing, or producing employee communications, newsletters, internal publications, employee open forums, business update meetings, etc. I also research relevant internal topics, find ways to understand your audience, and create compelling communications that summarise and present that information in a way that connects with the audience.  \n \nI work closely with the Ireland EC Account manager, HR and business partners to support Ireland employee and manager communication needs. My position also requires close co-operation with other internal communications partners in business groups, including Corporate Affairs to publicise internal key messages and events at cross-EMEA/biz group/site level. Ireland Employee Commuications Specialist Intel Corporation September 2013  – Present (2 years) Leixlip, Ireland As a member of the GER Employee Communications (EC) team I am responsible for implementing and executing internal employee communication programs and events including planning, writing, or producing employee communications, newsletters, internal publications, employee open forums, business update meetings, etc. I also research relevant internal topics, find ways to understand your audience, and create compelling communications that summarise and present that information in a way that connects with the audience.  \n \nI work closely with the Ireland EC Account manager, HR and business partners to support Ireland employee and manager communication needs. My position also requires close co-operation with other internal communications partners in business groups, including Corporate Affairs to publicise internal key messages and events at cross-EMEA/biz group/site level. Clerical Officer Department of Social Protection November 2012  –  September 2013  (11 months) Killarney Deciding Officer within the new Intreo Office, carrying out interviews and making live decisions on jobseeker claims Clerical Officer Department of Social Protection November 2012  –  September 2013  (11 months) Killarney Deciding Officer within the new Intreo Office, carrying out interviews and making live decisions on jobseeker claims Sales Associate River Island June 2012  –  October 2012  (5 months) Limerick Sales Associate River Island June 2012  –  October 2012  (5 months) Limerick Sales Assistant Mollys Xpress Stop & Shop May 2007  –  May 2012  (5 years 1 month) Kerry Sales Assistant Mollys Xpress Stop & Shop May 2007  –  May 2012  (5 years 1 month) Kerry Bartender and Waitress Fools and Horses Bar and Restaurant June 2010  –  August 2010  (3 months) Lagos, Algarve, Portugal Bartender and Waitress Fools and Horses Bar and Restaurant June 2010  –  August 2010  (3 months) Lagos, Algarve, Portugal Skills Customer Service Research Outlook Teaching Public Speaking Teamwork System Administration Retail Sales Editing English PowerPoint Windows Innovation Pay Close Attention to... Skills  Customer Service Research Outlook Teaching Public Speaking Teamwork System Administration Retail Sales Editing English PowerPoint Windows Innovation Pay Close Attention to... Customer Service Research Outlook Teaching Public Speaking Teamwork System Administration Retail Sales Editing English PowerPoint Windows Innovation Pay Close Attention to... Customer Service Research Outlook Teaching Public Speaking Teamwork System Administration Retail Sales Editing English PowerPoint Windows Innovation Pay Close Attention to... Education The Open College, Dublin Fetac Level 6,  Human Resources Management/Personnel Administration , General 2013  – 2013 University of Limerick Masters in English Language Teaching,  Teaching English as a Second or Foreign Language/ESL Language Instructor 2011  – 2012 University College Cork Bachelor of Arts (B.A.),  English and History 2008  – 2011 Joint Honours English and History Degree Tarbert Comprehensive School Leaving Cert 2003  – 2008 The Open College, Dublin Fetac Level 6,  Human Resources Management/Personnel Administration , General 2013  – 2013 The Open College, Dublin Fetac Level 6,  Human Resources Management/Personnel Administration , General 2013  – 2013 The Open College, Dublin Fetac Level 6,  Human Resources Management/Personnel Administration , General 2013  – 2013 University of Limerick Masters in English Language Teaching,  Teaching English as a Second or Foreign Language/ESL Language Instructor 2011  – 2012 University of Limerick Masters in English Language Teaching,  Teaching English as a Second or Foreign Language/ESL Language Instructor 2011  – 2012 University of Limerick Masters in English Language Teaching,  Teaching English as a Second or Foreign Language/ESL Language Instructor 2011  – 2012 University College Cork Bachelor of Arts (B.A.),  English and History 2008  – 2011 Joint Honours English and History Degree University College Cork Bachelor of Arts (B.A.),  English and History 2008  – 2011 Joint Honours English and History Degree University College Cork Bachelor of Arts (B.A.),  English and History 2008  – 2011 Joint Honours English and History Degree Tarbert Comprehensive School Leaving Cert 2003  – 2008 Tarbert Comprehensive School Leaving Cert 2003  – 2008 Tarbert Comprehensive School Leaving Cert 2003  – 2008 ", "Summary Results-oriented strategic communications and marketing professional with 13 years of experience in Healthcare and High Tech. Held strategic leadership positions managing people and improving company profitability. High-energy individual who thrives in a fast-paced, multi-tasking and productive environment. Proven track record in delivering strategic, creative, and cost-effective results. . \n \n• Experienced Global Communicator \n• Excellent execution of proactive communication strategies \n• Knowledgeable HR Marketing Communications Manager \n• Cross functional team leader \n• Strategic communications \n• Major collateral development  \n• Valuable written and oral communications skills \n• Excellent project manager \n• Strong team player \n• Writing/editing/proof reading \n \nSpecialties: Microsoft products (Word, Exel, PowerPoint, FrontPage, Outlook, Publisher, etc.) \nCommunication Plans complete from Key Messaging to publish Summary Results-oriented strategic communications and marketing professional with 13 years of experience in Healthcare and High Tech. Held strategic leadership positions managing people and improving company profitability. High-energy individual who thrives in a fast-paced, multi-tasking and productive environment. Proven track record in delivering strategic, creative, and cost-effective results. . \n \n• Experienced Global Communicator \n• Excellent execution of proactive communication strategies \n• Knowledgeable HR Marketing Communications Manager \n• Cross functional team leader \n• Strategic communications \n• Major collateral development  \n• Valuable written and oral communications skills \n• Excellent project manager \n• Strong team player \n• Writing/editing/proof reading \n \nSpecialties: Microsoft products (Word, Exel, PowerPoint, FrontPage, Outlook, Publisher, etc.) \nCommunication Plans complete from Key Messaging to publish Results-oriented strategic communications and marketing professional with 13 years of experience in Healthcare and High Tech. Held strategic leadership positions managing people and improving company profitability. High-energy individual who thrives in a fast-paced, multi-tasking and productive environment. Proven track record in delivering strategic, creative, and cost-effective results. . \n \n• Experienced Global Communicator \n• Excellent execution of proactive communication strategies \n• Knowledgeable HR Marketing Communications Manager \n• Cross functional team leader \n• Strategic communications \n• Major collateral development  \n• Valuable written and oral communications skills \n• Excellent project manager \n• Strong team player \n• Writing/editing/proof reading \n \nSpecialties: Microsoft products (Word, Exel, PowerPoint, FrontPage, Outlook, Publisher, etc.) \nCommunication Plans complete from Key Messaging to publish Results-oriented strategic communications and marketing professional with 13 years of experience in Healthcare and High Tech. Held strategic leadership positions managing people and improving company profitability. High-energy individual who thrives in a fast-paced, multi-tasking and productive environment. Proven track record in delivering strategic, creative, and cost-effective results. . \n \n• Experienced Global Communicator \n• Excellent execution of proactive communication strategies \n• Knowledgeable HR Marketing Communications Manager \n• Cross functional team leader \n• Strategic communications \n• Major collateral development  \n• Valuable written and oral communications skills \n• Excellent project manager \n• Strong team player \n• Writing/editing/proof reading \n \nSpecialties: Microsoft products (Word, Exel, PowerPoint, FrontPage, Outlook, Publisher, etc.) \nCommunication Plans complete from Key Messaging to publish Experience Director of Communications MountainStar Healthcare January 2010  – Present (5 years 8 months) Adjunct Professor Salt Lake Community College August 2004  – Present (11 years 1 month) Created course material, lectures, and exams; accountable for teaching students public speaking; designing, preparing PowerPoint slides, and presenting to an audience; Taught 9 classes with a total of over 150 students. Employee Communications Specialist Intel Corporation April 2005  –  January 2010  (4 years 10 months) •Responsible for creating marketing and communication plans especially for Intel's retiree population regarding changes to benefit packages and plans.  \n•Generated the benefits enrollment guide for both active and retiree populations.  \n•Responsible to work multiple groups within Intel to generate communication based on changes in employee benefits and services.  \n•Generated communications that have been read by more than 100,000 employees globally at Intel. \n•Provide a weekly writing tip of the week to Global Communications Managers to help them write better communications.  \n•Responsible for running projects from beginning to finish.  \n•Managed communications aspects for multiple projects simultaneously.  \n•Created a roadmap of projects, owners, and opportunities within HR Communications to allocate resources to several different projects. \n•Responsible for conducting an in-depth analysis of the new employee experience for Intel in the United States. Associate Vice President of Development Hale Centre Theatre December 2004  –  April 2005  (5 months) Associate Director Intermountain Health Care August 2001  –  December 2004  (3 years 5 months) Responsible for maintenance of the donor database used at The Deseret Foundation.  \nResponsible for entering, cleaning and storing data.  \nFacilitated the process of an upgrade in software to a current version;  \nSet up and managed a training session for The Deseret Foundation staff for the new version of software;  \nResponsible for overseeing the clean up process of data.  \nResponsible for all accounting procedures within The Deseret Foundation;  \nWorked closely with Accounting department to ensure budget and correct information is in line;  \nRequired to assist staff members in using any technology The Deseret Foundation offers. \nCreated and marketed the image of The Deseret Foundation;  \nDeveloped all marketing, communication, informational and development printed materials which includes newsletters, marketing brochures, direct mail solicitations, annual reports, etc.; Director of Communications MountainStar Healthcare January 2010  – Present (5 years 8 months) Director of Communications MountainStar Healthcare January 2010  – Present (5 years 8 months) Adjunct Professor Salt Lake Community College August 2004  – Present (11 years 1 month) Created course material, lectures, and exams; accountable for teaching students public speaking; designing, preparing PowerPoint slides, and presenting to an audience; Taught 9 classes with a total of over 150 students. Adjunct Professor Salt Lake Community College August 2004  – Present (11 years 1 month) Created course material, lectures, and exams; accountable for teaching students public speaking; designing, preparing PowerPoint slides, and presenting to an audience; Taught 9 classes with a total of over 150 students. Employee Communications Specialist Intel Corporation April 2005  –  January 2010  (4 years 10 months) •Responsible for creating marketing and communication plans especially for Intel's retiree population regarding changes to benefit packages and plans.  \n•Generated the benefits enrollment guide for both active and retiree populations.  \n•Responsible to work multiple groups within Intel to generate communication based on changes in employee benefits and services.  \n•Generated communications that have been read by more than 100,000 employees globally at Intel. \n•Provide a weekly writing tip of the week to Global Communications Managers to help them write better communications.  \n•Responsible for running projects from beginning to finish.  \n•Managed communications aspects for multiple projects simultaneously.  \n•Created a roadmap of projects, owners, and opportunities within HR Communications to allocate resources to several different projects. \n•Responsible for conducting an in-depth analysis of the new employee experience for Intel in the United States. Employee Communications Specialist Intel Corporation April 2005  –  January 2010  (4 years 10 months) •Responsible for creating marketing and communication plans especially for Intel's retiree population regarding changes to benefit packages and plans.  \n•Generated the benefits enrollment guide for both active and retiree populations.  \n•Responsible to work multiple groups within Intel to generate communication based on changes in employee benefits and services.  \n•Generated communications that have been read by more than 100,000 employees globally at Intel. \n•Provide a weekly writing tip of the week to Global Communications Managers to help them write better communications.  \n•Responsible for running projects from beginning to finish.  \n•Managed communications aspects for multiple projects simultaneously.  \n•Created a roadmap of projects, owners, and opportunities within HR Communications to allocate resources to several different projects. \n•Responsible for conducting an in-depth analysis of the new employee experience for Intel in the United States. Associate Vice President of Development Hale Centre Theatre December 2004  –  April 2005  (5 months) Associate Vice President of Development Hale Centre Theatre December 2004  –  April 2005  (5 months) Associate Director Intermountain Health Care August 2001  –  December 2004  (3 years 5 months) Responsible for maintenance of the donor database used at The Deseret Foundation.  \nResponsible for entering, cleaning and storing data.  \nFacilitated the process of an upgrade in software to a current version;  \nSet up and managed a training session for The Deseret Foundation staff for the new version of software;  \nResponsible for overseeing the clean up process of data.  \nResponsible for all accounting procedures within The Deseret Foundation;  \nWorked closely with Accounting department to ensure budget and correct information is in line;  \nRequired to assist staff members in using any technology The Deseret Foundation offers. \nCreated and marketed the image of The Deseret Foundation;  \nDeveloped all marketing, communication, informational and development printed materials which includes newsletters, marketing brochures, direct mail solicitations, annual reports, etc.; Associate Director Intermountain Health Care August 2001  –  December 2004  (3 years 5 months) Responsible for maintenance of the donor database used at The Deseret Foundation.  \nResponsible for entering, cleaning and storing data.  \nFacilitated the process of an upgrade in software to a current version;  \nSet up and managed a training session for The Deseret Foundation staff for the new version of software;  \nResponsible for overseeing the clean up process of data.  \nResponsible for all accounting procedures within The Deseret Foundation;  \nWorked closely with Accounting department to ensure budget and correct information is in line;  \nRequired to assist staff members in using any technology The Deseret Foundation offers. \nCreated and marketed the image of The Deseret Foundation;  \nDeveloped all marketing, communication, informational and development printed materials which includes newsletters, marketing brochures, direct mail solicitations, annual reports, etc.; Skills PowerPoint Outlook Microsoft Word Budgets Strategy Software Documentation Public Speaking Marketing Strategy Social Media Marketing Communications Non-profits Strategic Planning Strategic Communications Management Social Media Marketing Program Management Public Relations Marketing Social Networking Newsletters Internal Communications Human Resources Cross-functional Team... Leadership Time Management Editing Leadership Development Training Event Planning See 14+     See less Skills  PowerPoint Outlook Microsoft Word Budgets Strategy Software Documentation Public Speaking Marketing Strategy Social Media Marketing Communications Non-profits Strategic Planning Strategic Communications Management Social Media Marketing Program Management Public Relations Marketing Social Networking Newsletters Internal Communications Human Resources Cross-functional Team... Leadership Time Management Editing Leadership Development Training Event Planning See 14+     See less PowerPoint Outlook Microsoft Word Budgets Strategy Software Documentation Public Speaking Marketing Strategy Social Media Marketing Communications Non-profits Strategic Planning Strategic Communications Management Social Media Marketing Program Management Public Relations Marketing Social Networking Newsletters Internal Communications Human Resources Cross-functional Team... Leadership Time Management Editing Leadership Development Training Event Planning See 14+     See less PowerPoint Outlook Microsoft Word Budgets Strategy Software Documentation Public Speaking Marketing Strategy Social Media Marketing Communications Non-profits Strategic Planning Strategic Communications Management Social Media Marketing Program Management Public Relations Marketing Social Networking Newsletters Internal Communications Human Resources Cross-functional Team... Leadership Time Management Editing Leadership Development Training Event Planning See 14+     See less Education University of Phoenix MBA,  Marketing/Communications ,  Finance , Business Ethics, Accounting, Statistics,  Organizational Management 2002  – 2004 Utah State University B.S. - Journalism,  empahsis in Public Relations 1998  – 2001 Utah State University Minor,  Spanish 1998  – 2001 University of Phoenix MBA,  Marketing/Communications ,  Finance , Business Ethics, Accounting, Statistics,  Organizational Management 2002  – 2004 University of Phoenix MBA,  Marketing/Communications ,  Finance , Business Ethics, Accounting, Statistics,  Organizational Management 2002  – 2004 University of Phoenix MBA,  Marketing/Communications ,  Finance , Business Ethics, Accounting, Statistics,  Organizational Management 2002  – 2004 Utah State University B.S. - Journalism,  empahsis in Public Relations 1998  – 2001 Utah State University B.S. - Journalism,  empahsis in Public Relations 1998  – 2001 Utah State University B.S. - Journalism,  empahsis in Public Relations 1998  – 2001 Utah State University Minor,  Spanish 1998  – 2001 Utah State University Minor,  Spanish 1998  – 2001 Utah State University Minor,  Spanish 1998  – 2001 ", "Summary My expertise and passion are in project management and communications. My project management experience includes logistic lead for the Intel Senior Women's Symposium, the ERG Leadership Summit, and other large events at Intel. I have proven to provide stellar execution and attention to detail. I am completing my BA degree in Organizational Communications from California State University of Sacramento and have completed my AA degree from American River College, with a focus on communications. \n \nI am the WIN Marcom Chair for Folsom, CA and have been the Marcom co-chair for Intel Folsom's 30th Anniversary celebration. In my communications analyst position I was the single source for all Folsom finance communications, which included centralized job opportunity communications, organizational announcements, site program announcements, event communications and management of the finance SharePoint site. My experience includes organizing Open Forums, large executive events, and team building events. Summary My expertise and passion are in project management and communications. My project management experience includes logistic lead for the Intel Senior Women's Symposium, the ERG Leadership Summit, and other large events at Intel. I have proven to provide stellar execution and attention to detail. I am completing my BA degree in Organizational Communications from California State University of Sacramento and have completed my AA degree from American River College, with a focus on communications. \n \nI am the WIN Marcom Chair for Folsom, CA and have been the Marcom co-chair for Intel Folsom's 30th Anniversary celebration. In my communications analyst position I was the single source for all Folsom finance communications, which included centralized job opportunity communications, organizational announcements, site program announcements, event communications and management of the finance SharePoint site. My experience includes organizing Open Forums, large executive events, and team building events. My expertise and passion are in project management and communications. My project management experience includes logistic lead for the Intel Senior Women's Symposium, the ERG Leadership Summit, and other large events at Intel. I have proven to provide stellar execution and attention to detail. I am completing my BA degree in Organizational Communications from California State University of Sacramento and have completed my AA degree from American River College, with a focus on communications. \n \nI am the WIN Marcom Chair for Folsom, CA and have been the Marcom co-chair for Intel Folsom's 30th Anniversary celebration. In my communications analyst position I was the single source for all Folsom finance communications, which included centralized job opportunity communications, organizational announcements, site program announcements, event communications and management of the finance SharePoint site. My experience includes organizing Open Forums, large executive events, and team building events. My expertise and passion are in project management and communications. My project management experience includes logistic lead for the Intel Senior Women's Symposium, the ERG Leadership Summit, and other large events at Intel. I have proven to provide stellar execution and attention to detail. I am completing my BA degree in Organizational Communications from California State University of Sacramento and have completed my AA degree from American River College, with a focus on communications. \n \nI am the WIN Marcom Chair for Folsom, CA and have been the Marcom co-chair for Intel Folsom's 30th Anniversary celebration. In my communications analyst position I was the single source for all Folsom finance communications, which included centralized job opportunity communications, organizational announcements, site program announcements, event communications and management of the finance SharePoint site. My experience includes organizing Open Forums, large executive events, and team building events. Experience Marcom Chair for FM WIN Intel Corporation January 2014  – Present (1 year 8 months) Sr. Administrative Assistant Intel Corporation August 2005  – Present (10 years 1 month) Expert in SharePoint, managed complex travel and calendar for senior management, managed various complex projects, lead admin meetings, managed our training schedule and curriculum. Communications Specialist Intel Corporation June 2012  –  September 2012  (4 months) Communications Specialist Intel Corporation June 2012  –  September 2012  (4 months) Marcom Chair for FM WIN Intel Corporation January 2014  – Present (1 year 8 months) Marcom Chair for FM WIN Intel Corporation January 2014  – Present (1 year 8 months) Sr. Administrative Assistant Intel Corporation August 2005  – Present (10 years 1 month) Expert in SharePoint, managed complex travel and calendar for senior management, managed various complex projects, lead admin meetings, managed our training schedule and curriculum. Sr. Administrative Assistant Intel Corporation August 2005  – Present (10 years 1 month) Expert in SharePoint, managed complex travel and calendar for senior management, managed various complex projects, lead admin meetings, managed our training schedule and curriculum. Communications Specialist Intel Corporation June 2012  –  September 2012  (4 months) Communications Specialist Intel Corporation June 2012  –  September 2012  (4 months) Communications Specialist Intel Corporation June 2012  –  September 2012  (4 months) Communications Specialist Intel Corporation June 2012  –  September 2012  (4 months) Languages Russian Native or bilingual proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Project Management Communication Skills Marketing Communications Training Process Improvement Customer Service Creative Writing Corporate Communications Event Planning SharePoint Team Building Calendars Office Management Data Analysis Marketing Event Management Time Management Project Planning Social Networking Social Media Communication Program Management See 7+     See less Skills  Project Management Communication Skills Marketing Communications Training Process Improvement Customer Service Creative Writing Corporate Communications Event Planning SharePoint Team Building Calendars Office Management Data Analysis Marketing Event Management Time Management Project Planning Social Networking Social Media Communication Program Management See 7+     See less Project Management Communication Skills Marketing Communications Training Process Improvement Customer Service Creative Writing Corporate Communications Event Planning SharePoint Team Building Calendars Office Management Data Analysis Marketing Event Management Time Management Project Planning Social Networking Social Media Communication Program Management See 7+     See less Project Management Communication Skills Marketing Communications Training Process Improvement Customer Service Creative Writing Corporate Communications Event Planning SharePoint Team Building Calendars Office Management Data Analysis Marketing Event Management Time Management Project Planning Social Networking Social Media Communication Program Management See 7+     See less Education CSU Sacramento Bachelor of Arts (BA),  Business/Corporate Communications , 3.90 2009  – 2015 Phi Kappa Phi Honors Society \nGraduated with Summa Cum Laude Honors Activities and Societies:  Public Relations Society American River College Associate of Arts (A.A.),  Liberal Arts and Sciences/Liberal Studies , 3.7 2008  – 2009 Liberal Arts major, with a focus on Communications. Activities and Societies:  Golden Key Honor's Society CSU Sacramento Bachelor of Arts (BA),  Business/Corporate Communications , 3.90 2009  – 2015 Phi Kappa Phi Honors Society \nGraduated with Summa Cum Laude Honors Activities and Societies:  Public Relations Society CSU Sacramento Bachelor of Arts (BA),  Business/Corporate Communications , 3.90 2009  – 2015 Phi Kappa Phi Honors Society \nGraduated with Summa Cum Laude Honors Activities and Societies:  Public Relations Society CSU Sacramento Bachelor of Arts (BA),  Business/Corporate Communications , 3.90 2009  – 2015 Phi Kappa Phi Honors Society \nGraduated with Summa Cum Laude Honors Activities and Societies:  Public Relations Society American River College Associate of Arts (A.A.),  Liberal Arts and Sciences/Liberal Studies , 3.7 2008  – 2009 Liberal Arts major, with a focus on Communications. Activities and Societies:  Golden Key Honor's Society American River College Associate of Arts (A.A.),  Liberal Arts and Sciences/Liberal Studies , 3.7 2008  – 2009 Liberal Arts major, with a focus on Communications. Activities and Societies:  Golden Key Honor's Society American River College Associate of Arts (A.A.),  Liberal Arts and Sciences/Liberal Studies , 3.7 2008  – 2009 Liberal Arts major, with a focus on Communications. Activities and Societies:  Golden Key Honor's Society Honors & Awards Department Recognition Award - Intel Human Resources Group July 2014 In recognition for the work done on the 2014 Intel Senior Women's Symposium Department Recognition Award - Intel Client Components Group September 2008 DRA received in recognition of outstanding efforts to execute the move to MOSS and Webtop from Carmel. Folsom Excellence Award Intel - Folsom Excellence Team January 2008 In appreciation of outstanding contribution as a core team member of the first $1M dollar Folsom Community Giving Campaign! Department Recognition Award - Intel Human Resources Group July 2014 In recognition for the work done on the 2014 Intel Senior Women's Symposium Department Recognition Award - Intel Human Resources Group July 2014 In recognition for the work done on the 2014 Intel Senior Women's Symposium Department Recognition Award - Intel Human Resources Group July 2014 In recognition for the work done on the 2014 Intel Senior Women's Symposium Department Recognition Award - Intel Client Components Group September 2008 DRA received in recognition of outstanding efforts to execute the move to MOSS and Webtop from Carmel. Department Recognition Award - Intel Client Components Group September 2008 DRA received in recognition of outstanding efforts to execute the move to MOSS and Webtop from Carmel. Department Recognition Award - Intel Client Components Group September 2008 DRA received in recognition of outstanding efforts to execute the move to MOSS and Webtop from Carmel. Folsom Excellence Award Intel - Folsom Excellence Team January 2008 In appreciation of outstanding contribution as a core team member of the first $1M dollar Folsom Community Giving Campaign! Folsom Excellence Award Intel - Folsom Excellence Team January 2008 In appreciation of outstanding contribution as a core team member of the first $1M dollar Folsom Community Giving Campaign! Folsom Excellence Award Intel - Folsom Excellence Team January 2008 In appreciation of outstanding contribution as a core team member of the first $1M dollar Folsom Community Giving Campaign! ", "Experience Product Manager Intel Corporation January 2013  – Present (2 years 8 months) Folsom, California Product Manger for Identity, Directory & Authentication Services (IDAS). I'm responsible for all team product/project management activities including working with our business partners to translate their needs into capability and performance requirements and to work within the IT organization to ensure that these business needs are met effectively. I “own” the team’s roadmap and work with our customers/stakeholders, architects, engineers, ops partners and our vendors to deliver the solutions and capabilities as defined on our roadmap. Project Manager Intel Corporation July 2011  –  December 2012  (1 year 6 months) Human Resources project management. Product Manager Intel Corporation June 2005  –  July 2011  (6 years 2 months) As Messaging Product Manager, I have responsibility for a large part of the e-mail service as well as provide program management all new releases. Translate business and market requirements into product/service requirements. Engage partner groups, such as engineering, finance, quality, and marketing, to ensure the final offering meets these requirements. Publish product roadmaps and indicators. Communicate product/service plans to stakeholders and customers. Ensure product/service support capability in place to meet SLAs. Manage products/services through their lifecycle. Project Manager Intel Corporation July 2000  –  June 2005  (5 years) Managed key IT projects across multiple teams and varying services. Communications Specialist Intel Corporation February 1997  –  July 2000  (3 years 6 months) Created content for the intranet and printed material, developed communications plans and implemented the strategies and tactics, worked with product/program managers to define their communications needs for successful product implementations, managed internal and external vendors. Product Manager Intel Corporation January 2013  – Present (2 years 8 months) Folsom, California Product Manger for Identity, Directory & Authentication Services (IDAS). I'm responsible for all team product/project management activities including working with our business partners to translate their needs into capability and performance requirements and to work within the IT organization to ensure that these business needs are met effectively. I “own” the team’s roadmap and work with our customers/stakeholders, architects, engineers, ops partners and our vendors to deliver the solutions and capabilities as defined on our roadmap. Product Manager Intel Corporation January 2013  – Present (2 years 8 months) Folsom, California Product Manger for Identity, Directory & Authentication Services (IDAS). I'm responsible for all team product/project management activities including working with our business partners to translate their needs into capability and performance requirements and to work within the IT organization to ensure that these business needs are met effectively. I “own” the team’s roadmap and work with our customers/stakeholders, architects, engineers, ops partners and our vendors to deliver the solutions and capabilities as defined on our roadmap. Project Manager Intel Corporation July 2011  –  December 2012  (1 year 6 months) Human Resources project management. Project Manager Intel Corporation July 2011  –  December 2012  (1 year 6 months) Human Resources project management. Product Manager Intel Corporation June 2005  –  July 2011  (6 years 2 months) As Messaging Product Manager, I have responsibility for a large part of the e-mail service as well as provide program management all new releases. Translate business and market requirements into product/service requirements. Engage partner groups, such as engineering, finance, quality, and marketing, to ensure the final offering meets these requirements. Publish product roadmaps and indicators. Communicate product/service plans to stakeholders and customers. Ensure product/service support capability in place to meet SLAs. Manage products/services through their lifecycle. Product Manager Intel Corporation June 2005  –  July 2011  (6 years 2 months) As Messaging Product Manager, I have responsibility for a large part of the e-mail service as well as provide program management all new releases. Translate business and market requirements into product/service requirements. Engage partner groups, such as engineering, finance, quality, and marketing, to ensure the final offering meets these requirements. Publish product roadmaps and indicators. Communicate product/service plans to stakeholders and customers. Ensure product/service support capability in place to meet SLAs. Manage products/services through their lifecycle. Project Manager Intel Corporation July 2000  –  June 2005  (5 years) Managed key IT projects across multiple teams and varying services. Project Manager Intel Corporation July 2000  –  June 2005  (5 years) Managed key IT projects across multiple teams and varying services. Communications Specialist Intel Corporation February 1997  –  July 2000  (3 years 6 months) Created content for the intranet and printed material, developed communications plans and implemented the strategies and tactics, worked with product/program managers to define their communications needs for successful product implementations, managed internal and external vendors. Communications Specialist Intel Corporation February 1997  –  July 2000  (3 years 6 months) Created content for the intranet and printed material, developed communications plans and implemented the strategies and tactics, worked with product/program managers to define their communications needs for successful product implementations, managed internal and external vendors. Skills Program Management Cross-functional Team... Project Management Process Improvement Product Management Vendor Management PMP Software Project... Business Analysis Management Integration Requirements Analysis Business Development Six Sigma Cloud Computing Enterprise Software Business Process... Project Portfolio... Strategy Business Intelligence See 5+     See less Skills  Program Management Cross-functional Team... Project Management Process Improvement Product Management Vendor Management PMP Software Project... Business Analysis Management Integration Requirements Analysis Business Development Six Sigma Cloud Computing Enterprise Software Business Process... Project Portfolio... Strategy Business Intelligence See 5+     See less Program Management Cross-functional Team... Project Management Process Improvement Product Management Vendor Management PMP Software Project... Business Analysis Management Integration Requirements Analysis Business Development Six Sigma Cloud Computing Enterprise Software Business Process... Project Portfolio... Strategy Business Intelligence See 5+     See less Program Management Cross-functional Team... Project Management Process Improvement Product Management Vendor Management PMP Software Project... Business Analysis Management Integration Requirements Analysis Business Development Six Sigma Cloud Computing Enterprise Software Business Process... Project Portfolio... Strategy Business Intelligence See 5+     See less Education California State University-Sacramento Bachelor of Science,  Business Administration 1993  – 1996 San Jose State University 1992  – 1992 California State University-Sacramento Bachelor of Science,  Business Administration 1993  – 1996 California State University-Sacramento Bachelor of Science,  Business Administration 1993  – 1996 California State University-Sacramento Bachelor of Science,  Business Administration 1993  – 1996 San Jose State University 1992  – 1992 San Jose State University 1992  – 1992 San Jose State University 1992  – 1992 ", "Summary Energetic, creative, and driven team player with experience in marketing strategy development and execution, sales management, and brand storytelling; adept at communicating with internal and external customers and partners to drive business growth.  \n Summary Energetic, creative, and driven team player with experience in marketing strategy development and execution, sales management, and brand storytelling; adept at communicating with internal and external customers and partners to drive business growth.  \n Energetic, creative, and driven team player with experience in marketing strategy development and execution, sales management, and brand storytelling; adept at communicating with internal and external customers and partners to drive business growth.  \n Energetic, creative, and driven team player with experience in marketing strategy development and execution, sales management, and brand storytelling; adept at communicating with internal and external customers and partners to drive business growth.  \n Experience Internal Marketing Communications Specialist Intel Corporation July 2013  – Present (2 years 2 months) Folsom, CA Develop and implement marketing communication plans for new IT products and services, pilot programs, and product updates and improvements.  \nCreate strategies to drive new product adoption in partnership with product managers and stakeholders. \nAdvocate for a positive user experience with IT products and services to drive the positive perception of information technology. \nImproved the new employee experience with IT by creating new hire training and education materials, managing a social community and acting as IT liaison to a new hire integration committee. \nAct as team Director of Fun, organizing cross-site team-building and morale-boosting events. \nServed as IT Technical Leadership Conference 2015 Committee Communications Chair \n Marketing and Social Media Coordinator Portland State University May 2012  –  June 2013  (1 year 2 months) Portland, Oregon Area Developed copy for online and physical promotion materials to support marketing and recruitment strategy and goals. \nConducted marketing research and competitive landscape analysis to support overall strategic plan and initiatives. \nCreated and distributed original content through social media and website on a daily basis to grow online presence and community in collaboration with the Director of Marketing and Recruitment. Marketing Intern Avatron Software, Inc. July 2012  –  September 2012  (3 months) Conducted market research and competitive landscape analysis for current and future products to help set company marketing strategy and business direction. \nDeveloped in-depth analysis and reports of market data for the CEO and VP of Business Development. \nWorked as part of a team to develop and implement the overall company marketing strategy. Communications Intern Renewable Northwest Project January 2012  –  June 2012  (6 months) Develop new website content and distribute using the organization's Drupal system. \nCreate and implement social media strategic plan, which has grown social media following by 30%.  \nManage and distribute content for social media channels in partnership with Communication Manager. Sales Manager bebe stores October 2007  –  June 2010  (2 years 9 months) Managed store team in areas such as appointment business, hiring and staffing, and employee development to increase sales in 2009 by 10% from previous year. \nImplemented sales development plans and enhanced visual displays to increase shoe sales by 4%. \nSuccessfully communicated sales strategies with upper management via phone, fax and email. Internal Marketing Communications Specialist Intel Corporation July 2013  – Present (2 years 2 months) Folsom, CA Develop and implement marketing communication plans for new IT products and services, pilot programs, and product updates and improvements.  \nCreate strategies to drive new product adoption in partnership with product managers and stakeholders. \nAdvocate for a positive user experience with IT products and services to drive the positive perception of information technology. \nImproved the new employee experience with IT by creating new hire training and education materials, managing a social community and acting as IT liaison to a new hire integration committee. \nAct as team Director of Fun, organizing cross-site team-building and morale-boosting events. \nServed as IT Technical Leadership Conference 2015 Committee Communications Chair \n Internal Marketing Communications Specialist Intel Corporation July 2013  – Present (2 years 2 months) Folsom, CA Develop and implement marketing communication plans for new IT products and services, pilot programs, and product updates and improvements.  \nCreate strategies to drive new product adoption in partnership with product managers and stakeholders. \nAdvocate for a positive user experience with IT products and services to drive the positive perception of information technology. \nImproved the new employee experience with IT by creating new hire training and education materials, managing a social community and acting as IT liaison to a new hire integration committee. \nAct as team Director of Fun, organizing cross-site team-building and morale-boosting events. \nServed as IT Technical Leadership Conference 2015 Committee Communications Chair \n Marketing and Social Media Coordinator Portland State University May 2012  –  June 2013  (1 year 2 months) Portland, Oregon Area Developed copy for online and physical promotion materials to support marketing and recruitment strategy and goals. \nConducted marketing research and competitive landscape analysis to support overall strategic plan and initiatives. \nCreated and distributed original content through social media and website on a daily basis to grow online presence and community in collaboration with the Director of Marketing and Recruitment. Marketing and Social Media Coordinator Portland State University May 2012  –  June 2013  (1 year 2 months) Portland, Oregon Area Developed copy for online and physical promotion materials to support marketing and recruitment strategy and goals. \nConducted marketing research and competitive landscape analysis to support overall strategic plan and initiatives. \nCreated and distributed original content through social media and website on a daily basis to grow online presence and community in collaboration with the Director of Marketing and Recruitment. Marketing Intern Avatron Software, Inc. July 2012  –  September 2012  (3 months) Conducted market research and competitive landscape analysis for current and future products to help set company marketing strategy and business direction. \nDeveloped in-depth analysis and reports of market data for the CEO and VP of Business Development. \nWorked as part of a team to develop and implement the overall company marketing strategy. Marketing Intern Avatron Software, Inc. July 2012  –  September 2012  (3 months) Conducted market research and competitive landscape analysis for current and future products to help set company marketing strategy and business direction. \nDeveloped in-depth analysis and reports of market data for the CEO and VP of Business Development. \nWorked as part of a team to develop and implement the overall company marketing strategy. Communications Intern Renewable Northwest Project January 2012  –  June 2012  (6 months) Develop new website content and distribute using the organization's Drupal system. \nCreate and implement social media strategic plan, which has grown social media following by 30%.  \nManage and distribute content for social media channels in partnership with Communication Manager. Communications Intern Renewable Northwest Project January 2012  –  June 2012  (6 months) Develop new website content and distribute using the organization's Drupal system. \nCreate and implement social media strategic plan, which has grown social media following by 30%.  \nManage and distribute content for social media channels in partnership with Communication Manager. Sales Manager bebe stores October 2007  –  June 2010  (2 years 9 months) Managed store team in areas such as appointment business, hiring and staffing, and employee development to increase sales in 2009 by 10% from previous year. \nImplemented sales development plans and enhanced visual displays to increase shoe sales by 4%. \nSuccessfully communicated sales strategies with upper management via phone, fax and email. Sales Manager bebe stores October 2007  –  June 2010  (2 years 9 months) Managed store team in areas such as appointment business, hiring and staffing, and employee development to increase sales in 2009 by 10% from previous year. \nImplemented sales development plans and enhanced visual displays to increase shoe sales by 4%. \nSuccessfully communicated sales strategies with upper management via phone, fax and email. Languages Spanish Professional working proficiency Spanish Professional working proficiency Spanish Professional working proficiency Professional working proficiency Skills Social Media Social Media Marketing Research Event Planning Strategic Planning Marketing Strategy Public Speaking PowerPoint Project Management Marketing Communications Marketing Microsoft Office Customer Service Microsoft Excel Product Marketing Spanish Management Sales Management Staff Development Social Networking Marketing Research Blogging Editing Sales Business Development Integrated Marketing Competitive Analysis Recruiting Strategy Public Relations Teamwork Online Marketing Advertising Market Research See 19+     See less Skills  Social Media Social Media Marketing Research Event Planning Strategic Planning Marketing Strategy Public Speaking PowerPoint Project Management Marketing Communications Marketing Microsoft Office Customer Service Microsoft Excel Product Marketing Spanish Management Sales Management Staff Development Social Networking Marketing Research Blogging Editing Sales Business Development Integrated Marketing Competitive Analysis Recruiting Strategy Public Relations Teamwork Online Marketing Advertising Market Research See 19+     See less Social Media Social Media Marketing Research Event Planning Strategic Planning Marketing Strategy Public Speaking PowerPoint Project Management Marketing Communications Marketing Microsoft Office Customer Service Microsoft Excel Product Marketing Spanish Management Sales Management Staff Development Social Networking Marketing Research Blogging Editing Sales Business Development Integrated Marketing Competitive Analysis Recruiting Strategy Public Relations Teamwork Online Marketing Advertising Market Research See 19+     See less Social Media Social Media Marketing Research Event Planning Strategic Planning Marketing Strategy Public Speaking PowerPoint Project Management Marketing Communications Marketing Microsoft Office Customer Service Microsoft Excel Product Marketing Spanish Management Sales Management Staff Development Social Networking Marketing Research Blogging Editing Sales Business Development Integrated Marketing Competitive Analysis Recruiting Strategy Public Relations Teamwork Online Marketing Advertising Market Research See 19+     See less Education Portland State University Master,  Business Administration 2011  – 2013 Marketing and Logistics Concentration \nWomen in Business Group founding member and VP of Communications \nGraduate Student Partners Committee member Activities and Societies:  Women in Business - Co-founder and VP of Marketing Portland State University Bachelor of Arts,  Spanish 2006  – 2010 International Business Studies Certificate \nCompleted two-year study abroad Activities and Societies:  Portland State Women in Business ,  founding member Saint Louis University Bachelor’s Degree,  Spanish 2004  – 2005 Completed two-year study abroad at the St. Louis University campus in Madrid, Spain. Traveled to Mallorca, Spain to study oceanography and South Africa and Namibia to study African politics. Portland State University Master,  Business Administration 2011  – 2013 Marketing and Logistics Concentration \nWomen in Business Group founding member and VP of Communications \nGraduate Student Partners Committee member Activities and Societies:  Women in Business - Co-founder and VP of Marketing Portland State University Master,  Business Administration 2011  – 2013 Marketing and Logistics Concentration \nWomen in Business Group founding member and VP of Communications \nGraduate Student Partners Committee member Activities and Societies:  Women in Business - Co-founder and VP of Marketing Portland State University Master,  Business Administration 2011  – 2013 Marketing and Logistics Concentration \nWomen in Business Group founding member and VP of Communications \nGraduate Student Partners Committee member Activities and Societies:  Women in Business - Co-founder and VP of Marketing Portland State University Bachelor of Arts,  Spanish 2006  – 2010 International Business Studies Certificate \nCompleted two-year study abroad Activities and Societies:  Portland State Women in Business ,  founding member Portland State University Bachelor of Arts,  Spanish 2006  – 2010 International Business Studies Certificate \nCompleted two-year study abroad Activities and Societies:  Portland State Women in Business ,  founding member Portland State University Bachelor of Arts,  Spanish 2006  – 2010 International Business Studies Certificate \nCompleted two-year study abroad Activities and Societies:  Portland State Women in Business ,  founding member Saint Louis University Bachelor’s Degree,  Spanish 2004  – 2005 Completed two-year study abroad at the St. Louis University campus in Madrid, Spain. Traveled to Mallorca, Spain to study oceanography and South Africa and Namibia to study African politics. Saint Louis University Bachelor’s Degree,  Spanish 2004  – 2005 Completed two-year study abroad at the St. Louis University campus in Madrid, Spain. Traveled to Mallorca, Spain to study oceanography and South Africa and Namibia to study African politics. Saint Louis University Bachelor’s Degree,  Spanish 2004  – 2005 Completed two-year study abroad at the St. Louis University campus in Madrid, Spain. Traveled to Mallorca, Spain to study oceanography and South Africa and Namibia to study African politics. ", "Skills Brochures Web Content Problem Solving Magazine Articles Internal Communications Newsletters Corporate Communications Promotions Messaging Executive Communications Editing Communications Planning Communications Strategy Writing Strategic Communications Marketing Communications Copy Editing Content Management Web Content Management Editorial Content Strategy Leadership Training Communication Training Marketing See 10+     See less Skills  Brochures Web Content Problem Solving Magazine Articles Internal Communications Newsletters Corporate Communications Promotions Messaging Executive Communications Editing Communications Planning Communications Strategy Writing Strategic Communications Marketing Communications Copy Editing Content Management Web Content Management Editorial Content Strategy Leadership Training Communication Training Marketing See 10+     See less Brochures Web Content Problem Solving Magazine Articles Internal Communications Newsletters Corporate Communications Promotions Messaging Executive Communications Editing Communications Planning Communications Strategy Writing Strategic Communications Marketing Communications Copy Editing Content Management Web Content Management Editorial Content Strategy Leadership Training Communication Training Marketing See 10+     See less Brochures Web Content Problem Solving Magazine Articles Internal Communications Newsletters Corporate Communications Promotions Messaging Executive Communications Editing Communications Planning Communications Strategy Writing Strategic Communications Marketing Communications Copy Editing Content Management Web Content Management Editorial Content Strategy Leadership Training Communication Training Marketing See 10+     See less "]}