{"position": "Delivery Manager", "company": "IBM", "profiles": ["Skills Project Management IT Service Management Software Project... Program Management Team Leadership PMP IT Outsourcing Integration Performance Improvement Disaster Recovery Databases SQL System Administration Unix Linux Web Servers Network Security Network Administration Security SDLC Management Telecommunications Vendor Management Cross-functional Team... Outsourcing Cloud Computing Agile Methodologies Negotiation Customer Service New Business Development IT Strategy ITIL IT Management Solution Architecture Enterprise Architecture Service Delivery Networking See 22+     See less Skills  Project Management IT Service Management Software Project... Program Management Team Leadership PMP IT Outsourcing Integration Performance Improvement Disaster Recovery Databases SQL System Administration Unix Linux Web Servers Network Security Network Administration Security SDLC Management Telecommunications Vendor Management Cross-functional Team... Outsourcing Cloud Computing Agile Methodologies Negotiation Customer Service New Business Development IT Strategy ITIL IT Management Solution Architecture Enterprise Architecture Service Delivery Networking See 22+     See less Project Management IT Service Management Software Project... Program Management Team Leadership PMP IT Outsourcing Integration Performance Improvement Disaster Recovery Databases SQL System Administration Unix Linux Web Servers Network Security Network Administration Security SDLC Management Telecommunications Vendor Management Cross-functional Team... Outsourcing Cloud Computing Agile Methodologies Negotiation Customer Service New Business Development IT Strategy ITIL IT Management Solution Architecture Enterprise Architecture Service Delivery Networking See 22+     See less Project Management IT Service Management Software Project... Program Management Team Leadership PMP IT Outsourcing Integration Performance Improvement Disaster Recovery Databases SQL System Administration Unix Linux Web Servers Network Security Network Administration Security SDLC Management Telecommunications Vendor Management Cross-functional Team... Outsourcing Cloud Computing Agile Methodologies Negotiation Customer Service New Business Development IT Strategy ITIL IT Management Solution Architecture Enterprise Architecture Service Delivery Networking See 22+     See less ", "Languages English Turkish English Turkish English Turkish Skills Program Management Global Delivery Integration Transition Management Service Delivery Telecommunications Leading Large Teams People Management Software Development Outsourcing PMP Leadership C++ IT Strategy Management Software Project... Enterprise Architecture SDLC Requirements Analysis See 4+     See less Skills  Program Management Global Delivery Integration Transition Management Service Delivery Telecommunications Leading Large Teams People Management Software Development Outsourcing PMP Leadership C++ IT Strategy Management Software Project... Enterprise Architecture SDLC Requirements Analysis See 4+     See less Program Management Global Delivery Integration Transition Management Service Delivery Telecommunications Leading Large Teams People Management Software Development Outsourcing PMP Leadership C++ IT Strategy Management Software Project... Enterprise Architecture SDLC Requirements Analysis See 4+     See less Program Management Global Delivery Integration Transition Management Service Delivery Telecommunications Leading Large Teams People Management Software Development Outsourcing PMP Leadership C++ IT Strategy Management Software Project... Enterprise Architecture SDLC Requirements Analysis See 4+     See less ", "Skills IT Service Management Outsourcing IT Governance Global Delivery PMP Business Management Project Delivery Stakeholder Management Change Management Customer Relations Project Portfolio... Transition Management Business Analysis Project Management Management Governance IT Strategy Business Process Integration Program Management Resource Management Pre-sales Customer Service Business Intelligence MBA See 10+     See less Skills  IT Service Management Outsourcing IT Governance Global Delivery PMP Business Management Project Delivery Stakeholder Management Change Management Customer Relations Project Portfolio... Transition Management Business Analysis Project Management Management Governance IT Strategy Business Process Integration Program Management Resource Management Pre-sales Customer Service Business Intelligence MBA See 10+     See less IT Service Management Outsourcing IT Governance Global Delivery PMP Business Management Project Delivery Stakeholder Management Change Management Customer Relations Project Portfolio... Transition Management Business Analysis Project Management Management Governance IT Strategy Business Process Integration Program Management Resource Management Pre-sales Customer Service Business Intelligence MBA See 10+     See less IT Service Management Outsourcing IT Governance Global Delivery PMP Business Management Project Delivery Stakeholder Management Change Management Customer Relations Project Portfolio... Transition Management Business Analysis Project Management Management Governance IT Strategy Business Process Integration Program Management Resource Management Pre-sales Customer Service Business Intelligence MBA See 10+     See less Education Indian Institute of Management, Lucknow Management 2008  – 2008 Seminar on Doing Business in India MIP-Politecnico Di Milano EMBA,  EMBA in Startegy e ICT Governance 2005  – 2008 Tongji Unversity Shanghai 2007  – 2007 Activities and Societies:  Tongji University in Shanghai-MBA elective \"Doing Business in China\" Politecnico di Milano 1979  – 1984 Indian Institute of Management, Lucknow Management 2008  – 2008 Seminar on Doing Business in India Indian Institute of Management, Lucknow Management 2008  – 2008 Seminar on Doing Business in India Indian Institute of Management, Lucknow Management 2008  – 2008 Seminar on Doing Business in India MIP-Politecnico Di Milano EMBA,  EMBA in Startegy e ICT Governance 2005  – 2008 MIP-Politecnico Di Milano EMBA,  EMBA in Startegy e ICT Governance 2005  – 2008 MIP-Politecnico Di Milano EMBA,  EMBA in Startegy e ICT Governance 2005  – 2008 Tongji Unversity Shanghai 2007  – 2007 Activities and Societies:  Tongji University in Shanghai-MBA elective \"Doing Business in China\" Tongji Unversity Shanghai 2007  – 2007 Activities and Societies:  Tongji University in Shanghai-MBA elective \"Doing Business in China\" Tongji Unversity Shanghai 2007  – 2007 Activities and Societies:  Tongji University in Shanghai-MBA elective \"Doing Business in China\" Politecnico di Milano 1979  – 1984 Politecnico di Milano 1979  – 1984 Politecnico di Milano 1979  – 1984 ", "Experience Service Delivery Manager IBM October 2013  – Present (1 year 11 months) Turin Area, Italy Fiat Chrysler / CNHi \nManaging all Network LAN services in IBM DC and customers production sites (Italy,Germany,Belgium). Incident, change, asset management and management system  \nwith different LAN network providers. Service Delivery Manager IBM November 2010  –  October 2013  (3 years) Turin Area, Italy Fiat Group/Fiat Industrial customers \nManaging all cross critical services, such as Network internet link. \nEnsuring high availability of follows devices proxy,radware and juniper fw. \nIncident and change management, ensure SLA’s and PI agreed. \nMonitoring and analisys to enhance customer satisfaction. Service Delivery Manager IBM October 2009  –  November 2010  (1 year 2 months) Turin Area, Italy Fiat Spa and International Fiat Holding in Lingotto and Lugano sites \nDelivering critical services such as Banking,Network and Blackberry. \nIncident and change management, ensure SLA’s and PI agreed. \nMonitoring and analisys to enhance customer satisfaction. Customer Care Manager/Service Coordinator Globalvalue March 2001  –  September 2009  (8 years 7 months) Turin Area, Italy CC & SC management about Fiat Group Automobile customer applications SW Developer Analyst - Project Analyst Data Consult December 1988  –  January 2001  (12 years 2 months) Turin Area, Italy Sw developer/analyst/project analyst below procedures automotive customers: \nSelf-market branches, Messaging dealers Italy / Abroad Job title , DDS (Front-end dealers) \nLink dealers (disoss), procedure New Burden On-Line SW Developer, Analyst Aries Informatica January 1988  –  November 1988  (11 months) Asti Area, Italy - Turin Area, Italy analisys and develop Connecting Consortium Interbanca and suppliers management procedures SW Developer Newcom Data June 1987  –  December 1987  (7 months) Turin Area, Italy - Pomigliano (NA) As programmer Reprocessing procedures Archives Suppliers - Project: Management Resources Suppliers Service Delivery Manager IBM October 2013  – Present (1 year 11 months) Turin Area, Italy Fiat Chrysler / CNHi \nManaging all Network LAN services in IBM DC and customers production sites (Italy,Germany,Belgium). Incident, change, asset management and management system  \nwith different LAN network providers. Service Delivery Manager IBM October 2013  – Present (1 year 11 months) Turin Area, Italy Fiat Chrysler / CNHi \nManaging all Network LAN services in IBM DC and customers production sites (Italy,Germany,Belgium). Incident, change, asset management and management system  \nwith different LAN network providers. Service Delivery Manager IBM November 2010  –  October 2013  (3 years) Turin Area, Italy Fiat Group/Fiat Industrial customers \nManaging all cross critical services, such as Network internet link. \nEnsuring high availability of follows devices proxy,radware and juniper fw. \nIncident and change management, ensure SLA’s and PI agreed. \nMonitoring and analisys to enhance customer satisfaction. Service Delivery Manager IBM November 2010  –  October 2013  (3 years) Turin Area, Italy Fiat Group/Fiat Industrial customers \nManaging all cross critical services, such as Network internet link. \nEnsuring high availability of follows devices proxy,radware and juniper fw. \nIncident and change management, ensure SLA’s and PI agreed. \nMonitoring and analisys to enhance customer satisfaction. Service Delivery Manager IBM October 2009  –  November 2010  (1 year 2 months) Turin Area, Italy Fiat Spa and International Fiat Holding in Lingotto and Lugano sites \nDelivering critical services such as Banking,Network and Blackberry. \nIncident and change management, ensure SLA’s and PI agreed. \nMonitoring and analisys to enhance customer satisfaction. Service Delivery Manager IBM October 2009  –  November 2010  (1 year 2 months) Turin Area, Italy Fiat Spa and International Fiat Holding in Lingotto and Lugano sites \nDelivering critical services such as Banking,Network and Blackberry. \nIncident and change management, ensure SLA’s and PI agreed. \nMonitoring and analisys to enhance customer satisfaction. Customer Care Manager/Service Coordinator Globalvalue March 2001  –  September 2009  (8 years 7 months) Turin Area, Italy CC & SC management about Fiat Group Automobile customer applications Customer Care Manager/Service Coordinator Globalvalue March 2001  –  September 2009  (8 years 7 months) Turin Area, Italy CC & SC management about Fiat Group Automobile customer applications SW Developer Analyst - Project Analyst Data Consult December 1988  –  January 2001  (12 years 2 months) Turin Area, Italy Sw developer/analyst/project analyst below procedures automotive customers: \nSelf-market branches, Messaging dealers Italy / Abroad Job title , DDS (Front-end dealers) \nLink dealers (disoss), procedure New Burden On-Line SW Developer Analyst - Project Analyst Data Consult December 1988  –  January 2001  (12 years 2 months) Turin Area, Italy Sw developer/analyst/project analyst below procedures automotive customers: \nSelf-market branches, Messaging dealers Italy / Abroad Job title , DDS (Front-end dealers) \nLink dealers (disoss), procedure New Burden On-Line SW Developer, Analyst Aries Informatica January 1988  –  November 1988  (11 months) Asti Area, Italy - Turin Area, Italy analisys and develop Connecting Consortium Interbanca and suppliers management procedures SW Developer, Analyst Aries Informatica January 1988  –  November 1988  (11 months) Asti Area, Italy - Turin Area, Italy analisys and develop Connecting Consortium Interbanca and suppliers management procedures SW Developer Newcom Data June 1987  –  December 1987  (7 months) Turin Area, Italy - Pomigliano (NA) As programmer Reprocessing procedures Archives Suppliers - Project: Management Resources Suppliers SW Developer Newcom Data June 1987  –  December 1987  (7 months) Turin Area, Italy - Pomigliano (NA) As programmer Reprocessing procedures Archives Suppliers - Project: Management Resources Suppliers Education Nuclear Technical School High School,  Nuclear/Nuclear Power Technology/Technician 1979  – 1984 Nuclear Technical School High School,  Nuclear/Nuclear Power Technology/Technician 1979  – 1984 Nuclear Technical School High School,  Nuclear/Nuclear Power Technology/Technician 1979  – 1984 Nuclear Technical School High School,  Nuclear/Nuclear Power Technology/Technician 1979  – 1984 ", "Experience Service Delivery Manager IBM India Pvt Ltd March 2014  – Present (1 year 6 months) Bangalore Senior Delivery Manager IBM India Pvt Ltd January 2012  – Present (3 years 8 months) SAP Delivery Manager IBM India Pvt Ltd June 2006  –  August 2011  (5 years 3 months) Service Delivery Manager IBM India Pvt Ltd March 2014  – Present (1 year 6 months) Bangalore Service Delivery Manager IBM India Pvt Ltd March 2014  – Present (1 year 6 months) Bangalore Senior Delivery Manager IBM India Pvt Ltd January 2012  – Present (3 years 8 months) Senior Delivery Manager IBM India Pvt Ltd January 2012  – Present (3 years 8 months) SAP Delivery Manager IBM India Pvt Ltd June 2006  –  August 2011  (5 years 3 months) SAP Delivery Manager IBM India Pvt Ltd June 2006  –  August 2011  (5 years 3 months) Skills Business Intelligence ERP Global Delivery Leadership SAP SAP BW Service Delivery Software Project... Skills  Business Intelligence ERP Global Delivery Leadership SAP SAP BW Service Delivery Software Project... Business Intelligence ERP Global Delivery Leadership SAP SAP BW Service Delivery Software Project... Business Intelligence ERP Global Delivery Leadership SAP SAP BW Service Delivery Software Project... Education B. M. S. College of Engineering Information Science and Engineering 1996  – 2000 B. M. S. College of Engineering Information Science and Engineering 1996  – 2000 B. M. S. College of Engineering Information Science and Engineering 1996  – 2000 B. M. S. College of Engineering Information Science and Engineering 1996  – 2000 ", "Summary Throughout my professional career, I have gained extensive experience and skills across the IT and Business Functions, encompassing but not limited too: Computer Operations, Technical Support, Project Management, Business Operations, Technical Solutioning, Service Delivery Management: Change Management, Incident Management, Problem Management, People Management (inc 3rd party suppliers). \n \nI have worked on/and with a broad range of customers spanning the private (Finance, Insurance, Retail, Distribution, Service Provider, Engineering) and public sector \n Summary Throughout my professional career, I have gained extensive experience and skills across the IT and Business Functions, encompassing but not limited too: Computer Operations, Technical Support, Project Management, Business Operations, Technical Solutioning, Service Delivery Management: Change Management, Incident Management, Problem Management, People Management (inc 3rd party suppliers). \n \nI have worked on/and with a broad range of customers spanning the private (Finance, Insurance, Retail, Distribution, Service Provider, Engineering) and public sector \n Throughout my professional career, I have gained extensive experience and skills across the IT and Business Functions, encompassing but not limited too: Computer Operations, Technical Support, Project Management, Business Operations, Technical Solutioning, Service Delivery Management: Change Management, Incident Management, Problem Management, People Management (inc 3rd party suppliers). \n \nI have worked on/and with a broad range of customers spanning the private (Finance, Insurance, Retail, Distribution, Service Provider, Engineering) and public sector \n Throughout my professional career, I have gained extensive experience and skills across the IT and Business Functions, encompassing but not limited too: Computer Operations, Technical Support, Project Management, Business Operations, Technical Solutioning, Service Delivery Management: Change Management, Incident Management, Problem Management, People Management (inc 3rd party suppliers). \n \nI have worked on/and with a broad range of customers spanning the private (Finance, Insurance, Retail, Distribution, Service Provider, Engineering) and public sector \n Experience Project Manager IBM in Ireland October 2014  – Present (11 months) Dublin Project Manager Role in Finance Sector. Project Managing across multiple platform teams to ensure patching levels were maintained across c. 3000 servers. This was both an internal and customer facing role. The primary focus was on Intel and Unix platforms, overseeing a team of dedicated geographical dispersed engineers and PMs to accomplish our deliverable's. Project Manager - Service Improvement Program IBM in Ireland April 2014  –  September 2014  (6 months) Dublin Service Improvement Programme on an internal Server Activation/Deactivation Process, aligning to the new tool that was issued coincidently at the same time Project Manager - Lean Six Sigma Process Improvement & Network Services Workload Manager IBM in Ireland June 2013  –  March 2014  (10 months) Dublin Project Manager - Lean Six Sigma Process Improvement \nProject managed an IBM global team six sigma process improvement initiative across Service Management and Network Services delivery teams in Ireland. I focused on removing non value add activities, process redesign to eliminate waste, capacity gains and ultimately embedded a new more efficient streamlined delivery structure. This program was continuously reviewed by global exec teams to meet rigorous checkpoints and what we delivered locally was deemed so successful that it was used as a reference point within EMEA on how to implement the model \n \nNetwork Services Workload Manager \nTask manager for all workload for the Ireland Network Services Delivery Team, supporting 20 accounts for BAU and Project demands. I led a team of 15 engineers to deliver on stringent SLA/KPI's and was responsible for all resourcing and delivery within this area. Service Delivery Manager IBM in Ireland September 2012  –  May 2013  (9 months) Dublin Service Delivery Manager: Supporting two financial customers on site within Strategic Outsourcing. Primary IBM contact for customer in all steady state activities, managing services to contract as per SLAs aligned to the ITIL Processes Service Delivery Manager IBM in Ireland September 2009  –  August 2012  (3 years) Dublin Service Delivery Manager: Supporting a Public Sector Managed Service customer on site. Primary IBM contact for customer in all steady state activities, managing services to contract as per SLAs aligned to the ITIL Processes Service Delivery Manager IBM in Ireland April 2006  –  August 2009  (3 years 5 months) Dublin Services Delivery Manager: Supporting the IBM Business Manager on Commercial Contracts. (T&M/Fixed) Solutioning & Managing the delivery of the contract elements in scope and schedule the necessary resources.  Service Delivery Manager IBM in Ireland January 2004  –  March 2006  (2 years 3 months) Dublin Service Delivery Manager: Supporting eight external Managed Services Customers ranging across the following Sectors: Financial, Insurance, Distribution, Service Provider \nand Engineering. Primary IBM contact for customer in all steady state activities, managing services to contract as per SLAs aligned to the ITIL Processes \n Project Manager IBM in Ireland April 2003  –  December 2003  (9 months) Dublin Project Management: Across a number of external commercial customers spanning the Public, Financial sectors. Most of the engagements were on Infrastructure Builds: Networks, xSeries, pSeries and Storage. The teams were made up of IBM(across business and competencies), Customer and third parties. ITS Business Operations Manager IBM in Ireland September 2002  –  March 2003  (7 months) Dublin Supporting the ITS Country Manager and his team across the ITS business lines: ISMS, BCRS, NCS  Change Manager IBM in Ireland March 2001  –  August 2002  (1 year 6 months) Dublin Telecommunications Sector: Worked with a client’s operations team, on site as their Change Manager  IT Consultant IBM in Ireland August 2000  –  February 2001  (7 months) Dublin Method Exponent: On the ITS Phoenix Team, the program was a key component of the overall ITS strategy, complementing the Tower Offerings with a cross-ITS Infrastructure Solutions approach to the issues facing our customers. Putting a greater emphasis on a consultancy let approach and reuse of Intellectual Capital. During this phase worked on the ITS Opportunity Engagement Model. Worked on a series of proposals and drawing up of contracts. Assisting our Sales Team. As well as working on a number of consultation engagements Service Delivery Manager Retail Sector February 1998  –  August 2000  (2 years 7 months) Dunlaoghaire As Service Delivery Manager, I was ultimately responsible for the Applications Support Team, but with overall responsibility for service delivery Network Administrator Retail Sector July 1992  –  January 1998  (5 years 7 months) Dunlaoghaire Managed and Supported the WAN(Voice/Data), Project Managed all related network activity Computer Operations Shift-Leader Retail Sector May 1990  –  June 1992  (2 years 2 months) DunLaoghaire Computer Operation Shift-Leader: Shift Management, Day to Day support, network installation, incident/problem management, initiated documentation of operational procedures \n Computer Operator Distribution Sector September 1983  –  April 1990  (6 years 8 months) Swords Worked with a Freight Company, as a Computer Operator reporting into the Financial Controller and Company Director Project Manager IBM in Ireland October 2014  – Present (11 months) Dublin Project Manager Role in Finance Sector. Project Managing across multiple platform teams to ensure patching levels were maintained across c. 3000 servers. This was both an internal and customer facing role. The primary focus was on Intel and Unix platforms, overseeing a team of dedicated geographical dispersed engineers and PMs to accomplish our deliverable's. Project Manager IBM in Ireland October 2014  – Present (11 months) Dublin Project Manager Role in Finance Sector. Project Managing across multiple platform teams to ensure patching levels were maintained across c. 3000 servers. This was both an internal and customer facing role. The primary focus was on Intel and Unix platforms, overseeing a team of dedicated geographical dispersed engineers and PMs to accomplish our deliverable's. Project Manager - Service Improvement Program IBM in Ireland April 2014  –  September 2014  (6 months) Dublin Service Improvement Programme on an internal Server Activation/Deactivation Process, aligning to the new tool that was issued coincidently at the same time Project Manager - Service Improvement Program IBM in Ireland April 2014  –  September 2014  (6 months) Dublin Service Improvement Programme on an internal Server Activation/Deactivation Process, aligning to the new tool that was issued coincidently at the same time Project Manager - Lean Six Sigma Process Improvement & Network Services Workload Manager IBM in Ireland June 2013  –  March 2014  (10 months) Dublin Project Manager - Lean Six Sigma Process Improvement \nProject managed an IBM global team six sigma process improvement initiative across Service Management and Network Services delivery teams in Ireland. I focused on removing non value add activities, process redesign to eliminate waste, capacity gains and ultimately embedded a new more efficient streamlined delivery structure. This program was continuously reviewed by global exec teams to meet rigorous checkpoints and what we delivered locally was deemed so successful that it was used as a reference point within EMEA on how to implement the model \n \nNetwork Services Workload Manager \nTask manager for all workload for the Ireland Network Services Delivery Team, supporting 20 accounts for BAU and Project demands. I led a team of 15 engineers to deliver on stringent SLA/KPI's and was responsible for all resourcing and delivery within this area. Project Manager - Lean Six Sigma Process Improvement & Network Services Workload Manager IBM in Ireland June 2013  –  March 2014  (10 months) Dublin Project Manager - Lean Six Sigma Process Improvement \nProject managed an IBM global team six sigma process improvement initiative across Service Management and Network Services delivery teams in Ireland. I focused on removing non value add activities, process redesign to eliminate waste, capacity gains and ultimately embedded a new more efficient streamlined delivery structure. This program was continuously reviewed by global exec teams to meet rigorous checkpoints and what we delivered locally was deemed so successful that it was used as a reference point within EMEA on how to implement the model \n \nNetwork Services Workload Manager \nTask manager for all workload for the Ireland Network Services Delivery Team, supporting 20 accounts for BAU and Project demands. I led a team of 15 engineers to deliver on stringent SLA/KPI's and was responsible for all resourcing and delivery within this area. Service Delivery Manager IBM in Ireland September 2012  –  May 2013  (9 months) Dublin Service Delivery Manager: Supporting two financial customers on site within Strategic Outsourcing. Primary IBM contact for customer in all steady state activities, managing services to contract as per SLAs aligned to the ITIL Processes Service Delivery Manager IBM in Ireland September 2012  –  May 2013  (9 months) Dublin Service Delivery Manager: Supporting two financial customers on site within Strategic Outsourcing. Primary IBM contact for customer in all steady state activities, managing services to contract as per SLAs aligned to the ITIL Processes Service Delivery Manager IBM in Ireland September 2009  –  August 2012  (3 years) Dublin Service Delivery Manager: Supporting a Public Sector Managed Service customer on site. Primary IBM contact for customer in all steady state activities, managing services to contract as per SLAs aligned to the ITIL Processes Service Delivery Manager IBM in Ireland September 2009  –  August 2012  (3 years) Dublin Service Delivery Manager: Supporting a Public Sector Managed Service customer on site. Primary IBM contact for customer in all steady state activities, managing services to contract as per SLAs aligned to the ITIL Processes Service Delivery Manager IBM in Ireland April 2006  –  August 2009  (3 years 5 months) Dublin Services Delivery Manager: Supporting the IBM Business Manager on Commercial Contracts. (T&M/Fixed) Solutioning & Managing the delivery of the contract elements in scope and schedule the necessary resources.  Service Delivery Manager IBM in Ireland April 2006  –  August 2009  (3 years 5 months) Dublin Services Delivery Manager: Supporting the IBM Business Manager on Commercial Contracts. (T&M/Fixed) Solutioning & Managing the delivery of the contract elements in scope and schedule the necessary resources.  Service Delivery Manager IBM in Ireland January 2004  –  March 2006  (2 years 3 months) Dublin Service Delivery Manager: Supporting eight external Managed Services Customers ranging across the following Sectors: Financial, Insurance, Distribution, Service Provider \nand Engineering. Primary IBM contact for customer in all steady state activities, managing services to contract as per SLAs aligned to the ITIL Processes \n Service Delivery Manager IBM in Ireland January 2004  –  March 2006  (2 years 3 months) Dublin Service Delivery Manager: Supporting eight external Managed Services Customers ranging across the following Sectors: Financial, Insurance, Distribution, Service Provider \nand Engineering. Primary IBM contact for customer in all steady state activities, managing services to contract as per SLAs aligned to the ITIL Processes \n Project Manager IBM in Ireland April 2003  –  December 2003  (9 months) Dublin Project Management: Across a number of external commercial customers spanning the Public, Financial sectors. Most of the engagements were on Infrastructure Builds: Networks, xSeries, pSeries and Storage. The teams were made up of IBM(across business and competencies), Customer and third parties. Project Manager IBM in Ireland April 2003  –  December 2003  (9 months) Dublin Project Management: Across a number of external commercial customers spanning the Public, Financial sectors. Most of the engagements were on Infrastructure Builds: Networks, xSeries, pSeries and Storage. The teams were made up of IBM(across business and competencies), Customer and third parties. ITS Business Operations Manager IBM in Ireland September 2002  –  March 2003  (7 months) Dublin Supporting the ITS Country Manager and his team across the ITS business lines: ISMS, BCRS, NCS  ITS Business Operations Manager IBM in Ireland September 2002  –  March 2003  (7 months) Dublin Supporting the ITS Country Manager and his team across the ITS business lines: ISMS, BCRS, NCS  Change Manager IBM in Ireland March 2001  –  August 2002  (1 year 6 months) Dublin Telecommunications Sector: Worked with a client’s operations team, on site as their Change Manager  Change Manager IBM in Ireland March 2001  –  August 2002  (1 year 6 months) Dublin Telecommunications Sector: Worked with a client’s operations team, on site as their Change Manager  IT Consultant IBM in Ireland August 2000  –  February 2001  (7 months) Dublin Method Exponent: On the ITS Phoenix Team, the program was a key component of the overall ITS strategy, complementing the Tower Offerings with a cross-ITS Infrastructure Solutions approach to the issues facing our customers. Putting a greater emphasis on a consultancy let approach and reuse of Intellectual Capital. During this phase worked on the ITS Opportunity Engagement Model. Worked on a series of proposals and drawing up of contracts. Assisting our Sales Team. As well as working on a number of consultation engagements IT Consultant IBM in Ireland August 2000  –  February 2001  (7 months) Dublin Method Exponent: On the ITS Phoenix Team, the program was a key component of the overall ITS strategy, complementing the Tower Offerings with a cross-ITS Infrastructure Solutions approach to the issues facing our customers. Putting a greater emphasis on a consultancy let approach and reuse of Intellectual Capital. During this phase worked on the ITS Opportunity Engagement Model. Worked on a series of proposals and drawing up of contracts. Assisting our Sales Team. As well as working on a number of consultation engagements Service Delivery Manager Retail Sector February 1998  –  August 2000  (2 years 7 months) Dunlaoghaire As Service Delivery Manager, I was ultimately responsible for the Applications Support Team, but with overall responsibility for service delivery Service Delivery Manager Retail Sector February 1998  –  August 2000  (2 years 7 months) Dunlaoghaire As Service Delivery Manager, I was ultimately responsible for the Applications Support Team, but with overall responsibility for service delivery Network Administrator Retail Sector July 1992  –  January 1998  (5 years 7 months) Dunlaoghaire Managed and Supported the WAN(Voice/Data), Project Managed all related network activity Network Administrator Retail Sector July 1992  –  January 1998  (5 years 7 months) Dunlaoghaire Managed and Supported the WAN(Voice/Data), Project Managed all related network activity Computer Operations Shift-Leader Retail Sector May 1990  –  June 1992  (2 years 2 months) DunLaoghaire Computer Operation Shift-Leader: Shift Management, Day to Day support, network installation, incident/problem management, initiated documentation of operational procedures \n Computer Operations Shift-Leader Retail Sector May 1990  –  June 1992  (2 years 2 months) DunLaoghaire Computer Operation Shift-Leader: Shift Management, Day to Day support, network installation, incident/problem management, initiated documentation of operational procedures \n Computer Operator Distribution Sector September 1983  –  April 1990  (6 years 8 months) Swords Worked with a Freight Company, as a Computer Operator reporting into the Financial Controller and Company Director Computer Operator Distribution Sector September 1983  –  April 1990  (6 years 8 months) Swords Worked with a Freight Company, as a Computer Operator reporting into the Financial Controller and Company Director Skills Service Delivery ITIL Outsourcing Incident Management Service Management SLA Infrastructure Managed Services Telecommunications Information Technology Change Management Problem Management People Management Project Management Business Operations Contract Management Third Party Vendor... Business Partner... See 3+     See less Skills  Service Delivery ITIL Outsourcing Incident Management Service Management SLA Infrastructure Managed Services Telecommunications Information Technology Change Management Problem Management People Management Project Management Business Operations Contract Management Third Party Vendor... Business Partner... See 3+     See less Service Delivery ITIL Outsourcing Incident Management Service Management SLA Infrastructure Managed Services Telecommunications Information Technology Change Management Problem Management People Management Project Management Business Operations Contract Management Third Party Vendor... Business Partner... See 3+     See less Service Delivery ITIL Outsourcing Incident Management Service Management SLA Infrastructure Managed Services Telecommunications Information Technology Change Management Problem Management People Management Project Management Business Operations Contract Management Third Party Vendor... Business Partner... See 3+     See less Education Trinity College Dublin Bachelor of Science (BSc),  Information Systems Trinity College Dublin Bachelor of Science (BSc),  Information Systems Trinity College Dublin Bachelor of Science (BSc),  Information Systems Trinity College Dublin Bachelor of Science (BSc),  Information Systems ", "Languages English Putonghua Cantonese English Putonghua Cantonese English Putonghua Cantonese Skills Outsourcing Service Delivery People Management Strategic Planning Solution Design Product Development Conflict Management Disaster Recovery Pre-sales Mainframe JCL ITIL z/OS DB2 IT Service Management REXX Vendor Management Integration IBM Mainframe Requirements Analysis Consultancy Project Delivery SDLC Team Leadership Tivoli Application Development Operating Systems Testing Databases IT Strategy COBOL MVS Service Management Change Management TSO CICS IT Management VSAM Systems Management Incident Management Storage SLA Systems Analysis IT Governance Technical Leadership See 30+     See less Skills  Outsourcing Service Delivery People Management Strategic Planning Solution Design Product Development Conflict Management Disaster Recovery Pre-sales Mainframe JCL ITIL z/OS DB2 IT Service Management REXX Vendor Management Integration IBM Mainframe Requirements Analysis Consultancy Project Delivery SDLC Team Leadership Tivoli Application Development Operating Systems Testing Databases IT Strategy COBOL MVS Service Management Change Management TSO CICS IT Management VSAM Systems Management Incident Management Storage SLA Systems Analysis IT Governance Technical Leadership See 30+     See less Outsourcing Service Delivery People Management Strategic Planning Solution Design Product Development Conflict Management Disaster Recovery Pre-sales Mainframe JCL ITIL z/OS DB2 IT Service Management REXX Vendor Management Integration IBM Mainframe Requirements Analysis Consultancy Project Delivery SDLC Team Leadership Tivoli Application Development Operating Systems Testing Databases IT Strategy COBOL MVS Service Management Change Management TSO CICS IT Management VSAM Systems Management Incident Management Storage SLA Systems Analysis IT Governance Technical Leadership See 30+     See less Outsourcing Service Delivery People Management Strategic Planning Solution Design Product Development Conflict Management Disaster Recovery Pre-sales Mainframe JCL ITIL z/OS DB2 IT Service Management REXX Vendor Management Integration IBM Mainframe Requirements Analysis Consultancy Project Delivery SDLC Team Leadership Tivoli Application Development Operating Systems Testing Databases IT Strategy COBOL MVS Service Management Change Management TSO CICS IT Management VSAM Systems Management Incident Management Storage SLA Systems Analysis IT Governance Technical Leadership See 30+     See less ", "Summary •\tProject Management Institute (PMI) certified; \n \n•\tExperience in managing projects and high performance teams of expressive companies; \n \n•\tExperience in SAP environment and Legacy Systems; \n \n•\tExperience in consulting and implementation of I.T. outsourcing models; \n \n•\tStrong performance in maintenance and management of SLA; \n \n•\tGreat knowledge in processes, services and systems maintenance (ITIL) and Audits (ISO and SOX). \n \n•\tCommitment to results, customer focus, good interpersonal skills, strategic vision, leadership and motivating attitude. Summary •\tProject Management Institute (PMI) certified; \n \n•\tExperience in managing projects and high performance teams of expressive companies; \n \n•\tExperience in SAP environment and Legacy Systems; \n \n•\tExperience in consulting and implementation of I.T. outsourcing models; \n \n•\tStrong performance in maintenance and management of SLA; \n \n•\tGreat knowledge in processes, services and systems maintenance (ITIL) and Audits (ISO and SOX). \n \n•\tCommitment to results, customer focus, good interpersonal skills, strategic vision, leadership and motivating attitude. •\tProject Management Institute (PMI) certified; \n \n•\tExperience in managing projects and high performance teams of expressive companies; \n \n•\tExperience in SAP environment and Legacy Systems; \n \n•\tExperience in consulting and implementation of I.T. outsourcing models; \n \n•\tStrong performance in maintenance and management of SLA; \n \n•\tGreat knowledge in processes, services and systems maintenance (ITIL) and Audits (ISO and SOX). \n \n•\tCommitment to results, customer focus, good interpersonal skills, strategic vision, leadership and motivating attitude. •\tProject Management Institute (PMI) certified; \n \n•\tExperience in managing projects and high performance teams of expressive companies; \n \n•\tExperience in SAP environment and Legacy Systems; \n \n•\tExperience in consulting and implementation of I.T. outsourcing models; \n \n•\tStrong performance in maintenance and management of SLA; \n \n•\tGreat knowledge in processes, services and systems maintenance (ITIL) and Audits (ISO and SOX). \n \n•\tCommitment to results, customer focus, good interpersonal skills, strategic vision, leadership and motivating attitude. Experience SAP Project Manager, Customer: Volkswagen IBM August 2014  – Present (1 year 1 month) São Paulo Area, Brazil Managing project to implement new features on SAP System ET2000, which is a global template of Volkswagen for warehouse operation and management, preparing it to work with more than one plant. \n \nProject is ongoing and SAP modules involved are MM, WM, SD, APO, FI-CO, Abap and BASIS. SAP Project Manager, Customer: Volkswagen IBM May 2013  –  May 2014  (1 year 1 month) São Paulo Area, Brazil Managing project of releasing more than 9,000 transport orders to Quality and Production environments of VW’s warehouse segment (ET2000), in order to have the Brazil’s environments equalized to worldwide VW's ET2000 environments. \n \nThe strategy adopted for realization of this project was to carry full integration test, because the amount of updates that were processed covering the MM, WM, SD, APO, BW and FI modules of SAP and strong activity of BASIS team. Service Delivery Manager IBM January 2011  –  April 2013  (2 years 4 months) São Paulo Area, Brazil Manage Sustain Services - SAP for IBM local customers: Volkswagen do Brasil, Wal-Mart, Construtora e Incorporadora Rossi, BM&F BOVESPA, Mondelez International (Kraft Foods). \n \nMain achievements: \n•\tConducting improvement actions aligned with executives, based on monitoring of operational indicators (Volume, Severity, Aging, SLA) and financial indicators (Cost, Effort, Revenue, Actual x Plan);  \n•\tManagement of risks and issues for each project; \n•\tManagement of teams, involving SAP professionals (Leaders, Functional and ABAPs), directing them to support based on ITIL best practices, and preparing teams for CMMI certification; \n•\tManagement of productivity of the members of the teams. Service Delivery Manager IBM April 2010  –  December 2010  (9 months) São Paulo Area, Brazil Responsible for structuring SAP projects of sustain, customers Brookfield Realty and PDG Realty and Responsible for structuring WEB projects of sustain, customer Philips do Brasil. \n \nMain achievements: \n•\tSupervision and acting as Subject Matter Expert in the transitions, i.e., project in which the working model in the customer environment is adapted to the working standard model of IBM, working on the design, composition of the teams, review process and tools and structuring the governance (communication, reports, indicators, tracking issues and risks, etc.). Service Delivery Manager IBM July 2009  –  March 2010  (9 months) São Paulo Area, Brazil Responsible for leading the Sustain team for corporate systems of the Mapfre Seguradora S. A. \n \nMain achievements: \n•\tLeadership Team (30 experts), organizing the service, leading the team in accordance with the procedures, working on personal issues of the team members, tracking / reporting critical issues, measuring / acting based on operational indicators (volume, severity, aging, SLA) and presenting the results to IBM and customer executives. Service Delivery Manager IBM January 2009  –  June 2009  (6 months) São Paulo Area, Brazil Responsible for project \"AUDITS\" in structuring Outsourcing Delivery Center. \n \nMain achievements: \n•\tStandardization of compliance with requirements of the company in the nine accounts assisted by Outsourcing Delivery Center (Volkswagen, Unilever, Souza Cruz, etc). Service Delivery Manager IBM February 2007  –  December 2008  (1 year 11 months) São Paulo Area, Brazil Responsible for leading the Sustain team for SAP and Legacy Systems of the Bunge Fertilizantes S. A. \n \nMain achievements: \n•\tStrong participation in structuring the support post Go Live of the new ERP: SAP; \n•\tTechnical participation in replacing Bunge’s ERP (from BaaN to SAP), working on definitions and tests of integrations between SAP and Legacy Systems; \n•\tLeadership Team (60 experts), organizing the service, leading the team in accordance with the procedures, tracking / reporting critical issues, measuring / acting based on operational indicators (volume, severity, aging, SLA) and presenting the results to IBM and customer executives; \n•\tProviding support to users on Bunge’s systems, problem solving and help on operation of the systems, using specific knowledge related to the business (Production, Invoicing, Inventory, Purchasing, Accounts Payable / Receivable, Freight). Project Manager Alper Consulting October 2004  –  December 2006  (2 years 3 months) São Paulo Area, Brazil Responsible for administration of the company, negotiation and management of the projects. \n \nMain achievements: \n•\tNegotiation of IT projects in the industrial area of Bunge, analyzing needs, detailing activities, deadlines and costs, developing business proposals and conditions of relationship and discussing all points along the customer; \n•\tManagement of the development team, reviewing administration of demands, planning and execution of activities and ensuring quality of technological products to be delivered, as scope, cost and schedule; \n•\tDirectors of the company, working in financial control and strategic direction. System Analyst Talent Four Consulting March 2002  –  October 2004  (2 years 8 months) São Paulo Area, Brazil Allocated in BUNGE FERTILIZANTES S.A. \nResponsible for analysis and development of systems – Technology: Centura, Database: Oracle. \n \nMain achievements: \n•\tDevelopment of Sistema de Recebimento Físico, conducting all phases of the project: requirements, analysis, construction, training, deployment and maintenance (developed in Oracle / Centura); \n•\tDevelopment and maintenance of systems (Requisição de Materiais, Planejamento de Produção, Agente de Mensagens, Otimização de Fábricas, Otimização de Atendimento de Carga e Descarga, Agendamento de Carregamentos e Faturamento); \n•\tDevelopment and maintenance of routines in Oracle to systems integration, i.e., between Company’s ERP and others legacy systems and for communication between the systems and automation equipment (e.g. scales for weighing trucks); \n•\tImplementation and training on various systems all over Brazil. System Analyst USIMINAS March 2000  –  December 2001  (1 year 10 months) São Paulo Area, Brazil Responsible for analysis and development of systems – Technology: Centura, Database: Oracle. \n \nMain achievements: \n•\tAnalysis and development of Sistema de Controle do Pátio de Placas da Cosipa, participating phases of modeling, development, user training and post-deployment support; \n•\tEnhancements, new features and maintenance in Sistema da Aciaria. SAP Project Manager, Customer: Volkswagen IBM August 2014  – Present (1 year 1 month) São Paulo Area, Brazil Managing project to implement new features on SAP System ET2000, which is a global template of Volkswagen for warehouse operation and management, preparing it to work with more than one plant. \n \nProject is ongoing and SAP modules involved are MM, WM, SD, APO, FI-CO, Abap and BASIS. SAP Project Manager, Customer: Volkswagen IBM August 2014  – Present (1 year 1 month) São Paulo Area, Brazil Managing project to implement new features on SAP System ET2000, which is a global template of Volkswagen for warehouse operation and management, preparing it to work with more than one plant. \n \nProject is ongoing and SAP modules involved are MM, WM, SD, APO, FI-CO, Abap and BASIS. SAP Project Manager, Customer: Volkswagen IBM May 2013  –  May 2014  (1 year 1 month) São Paulo Area, Brazil Managing project of releasing more than 9,000 transport orders to Quality and Production environments of VW’s warehouse segment (ET2000), in order to have the Brazil’s environments equalized to worldwide VW's ET2000 environments. \n \nThe strategy adopted for realization of this project was to carry full integration test, because the amount of updates that were processed covering the MM, WM, SD, APO, BW and FI modules of SAP and strong activity of BASIS team. SAP Project Manager, Customer: Volkswagen IBM May 2013  –  May 2014  (1 year 1 month) São Paulo Area, Brazil Managing project of releasing more than 9,000 transport orders to Quality and Production environments of VW’s warehouse segment (ET2000), in order to have the Brazil’s environments equalized to worldwide VW's ET2000 environments. \n \nThe strategy adopted for realization of this project was to carry full integration test, because the amount of updates that were processed covering the MM, WM, SD, APO, BW and FI modules of SAP and strong activity of BASIS team. Service Delivery Manager IBM January 2011  –  April 2013  (2 years 4 months) São Paulo Area, Brazil Manage Sustain Services - SAP for IBM local customers: Volkswagen do Brasil, Wal-Mart, Construtora e Incorporadora Rossi, BM&F BOVESPA, Mondelez International (Kraft Foods). \n \nMain achievements: \n•\tConducting improvement actions aligned with executives, based on monitoring of operational indicators (Volume, Severity, Aging, SLA) and financial indicators (Cost, Effort, Revenue, Actual x Plan);  \n•\tManagement of risks and issues for each project; \n•\tManagement of teams, involving SAP professionals (Leaders, Functional and ABAPs), directing them to support based on ITIL best practices, and preparing teams for CMMI certification; \n•\tManagement of productivity of the members of the teams. Service Delivery Manager IBM January 2011  –  April 2013  (2 years 4 months) São Paulo Area, Brazil Manage Sustain Services - SAP for IBM local customers: Volkswagen do Brasil, Wal-Mart, Construtora e Incorporadora Rossi, BM&F BOVESPA, Mondelez International (Kraft Foods). \n \nMain achievements: \n•\tConducting improvement actions aligned with executives, based on monitoring of operational indicators (Volume, Severity, Aging, SLA) and financial indicators (Cost, Effort, Revenue, Actual x Plan);  \n•\tManagement of risks and issues for each project; \n•\tManagement of teams, involving SAP professionals (Leaders, Functional and ABAPs), directing them to support based on ITIL best practices, and preparing teams for CMMI certification; \n•\tManagement of productivity of the members of the teams. Service Delivery Manager IBM April 2010  –  December 2010  (9 months) São Paulo Area, Brazil Responsible for structuring SAP projects of sustain, customers Brookfield Realty and PDG Realty and Responsible for structuring WEB projects of sustain, customer Philips do Brasil. \n \nMain achievements: \n•\tSupervision and acting as Subject Matter Expert in the transitions, i.e., project in which the working model in the customer environment is adapted to the working standard model of IBM, working on the design, composition of the teams, review process and tools and structuring the governance (communication, reports, indicators, tracking issues and risks, etc.). Service Delivery Manager IBM April 2010  –  December 2010  (9 months) São Paulo Area, Brazil Responsible for structuring SAP projects of sustain, customers Brookfield Realty and PDG Realty and Responsible for structuring WEB projects of sustain, customer Philips do Brasil. \n \nMain achievements: \n•\tSupervision and acting as Subject Matter Expert in the transitions, i.e., project in which the working model in the customer environment is adapted to the working standard model of IBM, working on the design, composition of the teams, review process and tools and structuring the governance (communication, reports, indicators, tracking issues and risks, etc.). Service Delivery Manager IBM July 2009  –  March 2010  (9 months) São Paulo Area, Brazil Responsible for leading the Sustain team for corporate systems of the Mapfre Seguradora S. A. \n \nMain achievements: \n•\tLeadership Team (30 experts), organizing the service, leading the team in accordance with the procedures, working on personal issues of the team members, tracking / reporting critical issues, measuring / acting based on operational indicators (volume, severity, aging, SLA) and presenting the results to IBM and customer executives. Service Delivery Manager IBM July 2009  –  March 2010  (9 months) São Paulo Area, Brazil Responsible for leading the Sustain team for corporate systems of the Mapfre Seguradora S. A. \n \nMain achievements: \n•\tLeadership Team (30 experts), organizing the service, leading the team in accordance with the procedures, working on personal issues of the team members, tracking / reporting critical issues, measuring / acting based on operational indicators (volume, severity, aging, SLA) and presenting the results to IBM and customer executives. Service Delivery Manager IBM January 2009  –  June 2009  (6 months) São Paulo Area, Brazil Responsible for project \"AUDITS\" in structuring Outsourcing Delivery Center. \n \nMain achievements: \n•\tStandardization of compliance with requirements of the company in the nine accounts assisted by Outsourcing Delivery Center (Volkswagen, Unilever, Souza Cruz, etc). Service Delivery Manager IBM January 2009  –  June 2009  (6 months) São Paulo Area, Brazil Responsible for project \"AUDITS\" in structuring Outsourcing Delivery Center. \n \nMain achievements: \n•\tStandardization of compliance with requirements of the company in the nine accounts assisted by Outsourcing Delivery Center (Volkswagen, Unilever, Souza Cruz, etc). Service Delivery Manager IBM February 2007  –  December 2008  (1 year 11 months) São Paulo Area, Brazil Responsible for leading the Sustain team for SAP and Legacy Systems of the Bunge Fertilizantes S. A. \n \nMain achievements: \n•\tStrong participation in structuring the support post Go Live of the new ERP: SAP; \n•\tTechnical participation in replacing Bunge’s ERP (from BaaN to SAP), working on definitions and tests of integrations between SAP and Legacy Systems; \n•\tLeadership Team (60 experts), organizing the service, leading the team in accordance with the procedures, tracking / reporting critical issues, measuring / acting based on operational indicators (volume, severity, aging, SLA) and presenting the results to IBM and customer executives; \n•\tProviding support to users on Bunge’s systems, problem solving and help on operation of the systems, using specific knowledge related to the business (Production, Invoicing, Inventory, Purchasing, Accounts Payable / Receivable, Freight). Service Delivery Manager IBM February 2007  –  December 2008  (1 year 11 months) São Paulo Area, Brazil Responsible for leading the Sustain team for SAP and Legacy Systems of the Bunge Fertilizantes S. A. \n \nMain achievements: \n•\tStrong participation in structuring the support post Go Live of the new ERP: SAP; \n•\tTechnical participation in replacing Bunge’s ERP (from BaaN to SAP), working on definitions and tests of integrations between SAP and Legacy Systems; \n•\tLeadership Team (60 experts), organizing the service, leading the team in accordance with the procedures, tracking / reporting critical issues, measuring / acting based on operational indicators (volume, severity, aging, SLA) and presenting the results to IBM and customer executives; \n•\tProviding support to users on Bunge’s systems, problem solving and help on operation of the systems, using specific knowledge related to the business (Production, Invoicing, Inventory, Purchasing, Accounts Payable / Receivable, Freight). Project Manager Alper Consulting October 2004  –  December 2006  (2 years 3 months) São Paulo Area, Brazil Responsible for administration of the company, negotiation and management of the projects. \n \nMain achievements: \n•\tNegotiation of IT projects in the industrial area of Bunge, analyzing needs, detailing activities, deadlines and costs, developing business proposals and conditions of relationship and discussing all points along the customer; \n•\tManagement of the development team, reviewing administration of demands, planning and execution of activities and ensuring quality of technological products to be delivered, as scope, cost and schedule; \n•\tDirectors of the company, working in financial control and strategic direction. Project Manager Alper Consulting October 2004  –  December 2006  (2 years 3 months) São Paulo Area, Brazil Responsible for administration of the company, negotiation and management of the projects. \n \nMain achievements: \n•\tNegotiation of IT projects in the industrial area of Bunge, analyzing needs, detailing activities, deadlines and costs, developing business proposals and conditions of relationship and discussing all points along the customer; \n•\tManagement of the development team, reviewing administration of demands, planning and execution of activities and ensuring quality of technological products to be delivered, as scope, cost and schedule; \n•\tDirectors of the company, working in financial control and strategic direction. System Analyst Talent Four Consulting March 2002  –  October 2004  (2 years 8 months) São Paulo Area, Brazil Allocated in BUNGE FERTILIZANTES S.A. \nResponsible for analysis and development of systems – Technology: Centura, Database: Oracle. \n \nMain achievements: \n•\tDevelopment of Sistema de Recebimento Físico, conducting all phases of the project: requirements, analysis, construction, training, deployment and maintenance (developed in Oracle / Centura); \n•\tDevelopment and maintenance of systems (Requisição de Materiais, Planejamento de Produção, Agente de Mensagens, Otimização de Fábricas, Otimização de Atendimento de Carga e Descarga, Agendamento de Carregamentos e Faturamento); \n•\tDevelopment and maintenance of routines in Oracle to systems integration, i.e., between Company’s ERP and others legacy systems and for communication between the systems and automation equipment (e.g. scales for weighing trucks); \n•\tImplementation and training on various systems all over Brazil. System Analyst Talent Four Consulting March 2002  –  October 2004  (2 years 8 months) São Paulo Area, Brazil Allocated in BUNGE FERTILIZANTES S.A. \nResponsible for analysis and development of systems – Technology: Centura, Database: Oracle. \n \nMain achievements: \n•\tDevelopment of Sistema de Recebimento Físico, conducting all phases of the project: requirements, analysis, construction, training, deployment and maintenance (developed in Oracle / Centura); \n•\tDevelopment and maintenance of systems (Requisição de Materiais, Planejamento de Produção, Agente de Mensagens, Otimização de Fábricas, Otimização de Atendimento de Carga e Descarga, Agendamento de Carregamentos e Faturamento); \n•\tDevelopment and maintenance of routines in Oracle to systems integration, i.e., between Company’s ERP and others legacy systems and for communication between the systems and automation equipment (e.g. scales for weighing trucks); \n•\tImplementation and training on various systems all over Brazil. System Analyst USIMINAS March 2000  –  December 2001  (1 year 10 months) São Paulo Area, Brazil Responsible for analysis and development of systems – Technology: Centura, Database: Oracle. \n \nMain achievements: \n•\tAnalysis and development of Sistema de Controle do Pátio de Placas da Cosipa, participating phases of modeling, development, user training and post-deployment support; \n•\tEnhancements, new features and maintenance in Sistema da Aciaria. System Analyst USIMINAS March 2000  –  December 2001  (1 year 10 months) São Paulo Area, Brazil Responsible for analysis and development of systems – Technology: Centura, Database: Oracle. \n \nMain achievements: \n•\tAnalysis and development of Sistema de Controle do Pátio de Placas da Cosipa, participating phases of modeling, development, user training and post-deployment support; \n•\tEnhancements, new features and maintenance in Sistema da Aciaria. Languages English Professional working proficiency English Professional working proficiency English Professional working proficiency Professional working proficiency Skills PMI Team Leadership Cross-functional Team... Strategic Leadership Situational Leadership SAP ERP Legacy Systems IT Outsourcing Sla ITIL Process ITIL Service Strategy ISO SOX Compliancy Management Project Management Account Management Operations Management IT Management PMBOK Business Process... ITIL Pre-sales PMP ERP IT Service Management Business Intelligence Program Management Governance IT Transformation CMMI PMO Service Delivery See 17+     See less Skills  PMI Team Leadership Cross-functional Team... Strategic Leadership Situational Leadership SAP ERP Legacy Systems IT Outsourcing Sla ITIL Process ITIL Service Strategy ISO SOX Compliancy Management Project Management Account Management Operations Management IT Management PMBOK Business Process... ITIL Pre-sales PMP ERP IT Service Management Business Intelligence Program Management Governance IT Transformation CMMI PMO Service Delivery See 17+     See less PMI Team Leadership Cross-functional Team... Strategic Leadership Situational Leadership SAP ERP Legacy Systems IT Outsourcing Sla ITIL Process ITIL Service Strategy ISO SOX Compliancy Management Project Management Account Management Operations Management IT Management PMBOK Business Process... ITIL Pre-sales PMP ERP IT Service Management Business Intelligence Program Management Governance IT Transformation CMMI PMO Service Delivery See 17+     See less PMI Team Leadership Cross-functional Team... Strategic Leadership Situational Leadership SAP ERP Legacy Systems IT Outsourcing Sla ITIL Process ITIL Service Strategy ISO SOX Compliancy Management Project Management Account Management Operations Management IT Management PMBOK Business Process... ITIL Pre-sales PMP ERP IT Service Management Business Intelligence Program Management Governance IT Transformation CMMI PMO Service Delivery See 17+     See less Education Fundação Getulio Vargas Master of Business Administration (M.B.A.),  Project Management 2006  – 2008 FATEC Associate's Degree,  Data Processing 1999  – 2001 Fundação Getulio Vargas Master of Business Administration (M.B.A.),  Project Management 2006  – 2008 Fundação Getulio Vargas Master of Business Administration (M.B.A.),  Project Management 2006  – 2008 Fundação Getulio Vargas Master of Business Administration (M.B.A.),  Project Management 2006  – 2008 FATEC Associate's Degree,  Data Processing 1999  – 2001 FATEC Associate's Degree,  Data Processing 1999  – 2001 FATEC Associate's Degree,  Data Processing 1999  – 2001 ", "Experience Regional Delivery Manager IBM January 2014  – Present (1 year 8 months) Client Delivery Manager IBM August 2010  –  December 2013  (3 years 5 months) Service Delivery Manager IBM January 2008  –  August 2010  (2 years 8 months) Manager Operations Harintech January 2007  –  December 2007  (1 year) Program Manager Network Solutions Pvt. Ltd. - An IBM Company May 2000  –  December 2006  (6 years 8 months) Regional Delivery Manager IBM January 2014  – Present (1 year 8 months) Regional Delivery Manager IBM January 2014  – Present (1 year 8 months) Client Delivery Manager IBM August 2010  –  December 2013  (3 years 5 months) Client Delivery Manager IBM August 2010  –  December 2013  (3 years 5 months) Service Delivery Manager IBM January 2008  –  August 2010  (2 years 8 months) Service Delivery Manager IBM January 2008  –  August 2010  (2 years 8 months) Manager Operations Harintech January 2007  –  December 2007  (1 year) Manager Operations Harintech January 2007  –  December 2007  (1 year) Program Manager Network Solutions Pvt. Ltd. - An IBM Company May 2000  –  December 2006  (6 years 8 months) Program Manager Network Solutions Pvt. Ltd. - An IBM Company May 2000  –  December 2006  (6 years 8 months) Skills IT Service Management Service Delivery Agile Project Management ITIL Pre-sales Service Management Data Center IT Operations PMP Sla Incident Management Solution Architecture Transition Management Project Delivery Managed Services Program Management CRM Management See 3+     See less Skills  IT Service Management Service Delivery Agile Project Management ITIL Pre-sales Service Management Data Center IT Operations PMP Sla Incident Management Solution Architecture Transition Management Project Delivery Managed Services Program Management CRM Management See 3+     See less IT Service Management Service Delivery Agile Project Management ITIL Pre-sales Service Management Data Center IT Operations PMP Sla Incident Management Solution Architecture Transition Management Project Delivery Managed Services Program Management CRM Management See 3+     See less IT Service Management Service Delivery Agile Project Management ITIL Pre-sales Service Management Data Center IT Operations PMP Sla Incident Management Solution Architecture Transition Management Project Delivery Managed Services Program Management CRM Management See 3+     See less ", "Summary I am an IT service and management leader that has eight years of experiencing managing complex IT projects and operations across desktop, mainframe, and midrange platforms. Summary I am an IT service and management leader that has eight years of experiencing managing complex IT projects and operations across desktop, mainframe, and midrange platforms. I am an IT service and management leader that has eight years of experiencing managing complex IT projects and operations across desktop, mainframe, and midrange platforms. I am an IT service and management leader that has eight years of experiencing managing complex IT projects and operations across desktop, mainframe, and midrange platforms. Experience Senior Service Delivery Manager IBM December 2012  – Present (2 years 9 months) Responsible for operation performance and strategic growth of the Linux on System z Platform as a Service offering at large financial services outsourcing contract. This included the financial management, project delivery and operational support for mission critical applications hosted on the zVM and Linux on System z virtual server platform. Service Delivery Manager IBM August 2009  –  November 2012  (3 years 4 months) Led the introduction of the Linux on System z Platform as a Service offering at a large financial services client. Responsibilities included the establishment of operational support processes, engagement services, and infrastructure and capacity expansion to enable volume growth. Service Delivery Manager IBM January 2007  –  June 2009  (2 years 6 months) Global service owner for Electronic Software Distribution Services (ESD) on large financial services outsourcing contract responsible for the cost management and delivery quality for software packaging, software distribution, patch management and image management services to 65,000 workstations in 26 countries along with client facing and executive communication responsibilities. Project Manager IBM March 2006  –  April 2007  (1 year 2 months) Responsible for the2007 Daylight Savings Change program for the End User Computing Tower and led the successful remediation of 65,000 workstations, 700 servers, 80,000 email accounts, and 5,000 BlackBerry users across a large financial services client. I also led a segment of the news Service Request System Program that delivered a new web based service request system and help consolidate eight Lotus Notes databases to provide a single request system for client end users. This included execution and delivery of the Service Request Program Performance Assessment Plan. Business Analyst IBM January 2005  –  March 2006  (1 year 3 months) Phoenix, Arizona Area Responsible for performing labor, software, and hardware expense budgeting and forecasting for a large financial services outsourcing account. Senior Service Delivery Manager IBM December 2012  – Present (2 years 9 months) Responsible for operation performance and strategic growth of the Linux on System z Platform as a Service offering at large financial services outsourcing contract. This included the financial management, project delivery and operational support for mission critical applications hosted on the zVM and Linux on System z virtual server platform. Senior Service Delivery Manager IBM December 2012  – Present (2 years 9 months) Responsible for operation performance and strategic growth of the Linux on System z Platform as a Service offering at large financial services outsourcing contract. This included the financial management, project delivery and operational support for mission critical applications hosted on the zVM and Linux on System z virtual server platform. Service Delivery Manager IBM August 2009  –  November 2012  (3 years 4 months) Led the introduction of the Linux on System z Platform as a Service offering at a large financial services client. Responsibilities included the establishment of operational support processes, engagement services, and infrastructure and capacity expansion to enable volume growth. Service Delivery Manager IBM August 2009  –  November 2012  (3 years 4 months) Led the introduction of the Linux on System z Platform as a Service offering at a large financial services client. Responsibilities included the establishment of operational support processes, engagement services, and infrastructure and capacity expansion to enable volume growth. Service Delivery Manager IBM January 2007  –  June 2009  (2 years 6 months) Global service owner for Electronic Software Distribution Services (ESD) on large financial services outsourcing contract responsible for the cost management and delivery quality for software packaging, software distribution, patch management and image management services to 65,000 workstations in 26 countries along with client facing and executive communication responsibilities. Service Delivery Manager IBM January 2007  –  June 2009  (2 years 6 months) Global service owner for Electronic Software Distribution Services (ESD) on large financial services outsourcing contract responsible for the cost management and delivery quality for software packaging, software distribution, patch management and image management services to 65,000 workstations in 26 countries along with client facing and executive communication responsibilities. Project Manager IBM March 2006  –  April 2007  (1 year 2 months) Responsible for the2007 Daylight Savings Change program for the End User Computing Tower and led the successful remediation of 65,000 workstations, 700 servers, 80,000 email accounts, and 5,000 BlackBerry users across a large financial services client. I also led a segment of the news Service Request System Program that delivered a new web based service request system and help consolidate eight Lotus Notes databases to provide a single request system for client end users. This included execution and delivery of the Service Request Program Performance Assessment Plan. Project Manager IBM March 2006  –  April 2007  (1 year 2 months) Responsible for the2007 Daylight Savings Change program for the End User Computing Tower and led the successful remediation of 65,000 workstations, 700 servers, 80,000 email accounts, and 5,000 BlackBerry users across a large financial services client. I also led a segment of the news Service Request System Program that delivered a new web based service request system and help consolidate eight Lotus Notes databases to provide a single request system for client end users. This included execution and delivery of the Service Request Program Performance Assessment Plan. Business Analyst IBM January 2005  –  March 2006  (1 year 3 months) Phoenix, Arizona Area Responsible for performing labor, software, and hardware expense budgeting and forecasting for a large financial services outsourcing account. Business Analyst IBM January 2005  –  March 2006  (1 year 3 months) Phoenix, Arizona Area Responsible for performing labor, software, and hardware expense budgeting and forecasting for a large financial services outsourcing account. Skills IT Service Management IBM Mainframe SDLC Enterprise Architecture ITIL Disaster Recovery PMP Data Center IT Strategy Program Management Solution Architecture IT Operations Virtualization IT Management Service Delivery Skills  IT Service Management IBM Mainframe SDLC Enterprise Architecture ITIL Disaster Recovery PMP Data Center IT Strategy Program Management Solution Architecture IT Operations Virtualization IT Management Service Delivery IT Service Management IBM Mainframe SDLC Enterprise Architecture ITIL Disaster Recovery PMP Data Center IT Strategy Program Management Solution Architecture IT Operations Virtualization IT Management Service Delivery IT Service Management IBM Mainframe SDLC Enterprise Architecture ITIL Disaster Recovery PMP Data Center IT Strategy Program Management Solution Architecture IT Operations Virtualization IT Management Service Delivery Education University of Arizona, Eller College of Management Bachelor of Science (B.S.),  Finance , General 2000  – 2004 North High 1996  – 2000 University of Arizona, Eller College of Management Bachelor of Science (B.S.),  Finance , General 2000  – 2004 University of Arizona, Eller College of Management Bachelor of Science (B.S.),  Finance , General 2000  – 2004 University of Arizona, Eller College of Management Bachelor of Science (B.S.),  Finance , General 2000  – 2004 North High 1996  – 2000 North High 1996  – 2000 North High 1996  – 2000 ", "Experience Business Relationship Manager SCE IT Business Relations Southern California Edison 2006  – Present (9 years) Service Delivery Manager - IBM Pacificare Health Systems 2003  –  2006  (3 years) Service Delivery Manager - IBM Pacificare Health Systems 2003  –  2006  (3 years) Service Delivery Manager IBM Global Services 1997  –  2006  (9 years) Service Delivery Manager IBM 2002  –  2003  (1 year) Manager of Infrastructure IBM 1997  –  2000  (3 years) AVP Union Bank of California 1993  –  1996  (3 years) Business Relationship Manager SCE Business Relationship Manager SCE IT Business Relations Southern California Edison 2006  – Present (9 years) IT Business Relations Southern California Edison 2006  – Present (9 years) Service Delivery Manager - IBM Pacificare Health Systems 2003  –  2006  (3 years) Service Delivery Manager - IBM Pacificare Health Systems 2003  –  2006  (3 years) Service Delivery Manager - IBM Pacificare Health Systems 2003  –  2006  (3 years) Service Delivery Manager - IBM Pacificare Health Systems 2003  –  2006  (3 years) Service Delivery Manager IBM Global Services 1997  –  2006  (9 years) Service Delivery Manager IBM Global Services 1997  –  2006  (9 years) Service Delivery Manager IBM 2002  –  2003  (1 year) Service Delivery Manager IBM 2002  –  2003  (1 year) Manager of Infrastructure IBM 1997  –  2000  (3 years) Manager of Infrastructure IBM 1997  –  2000  (3 years) AVP Union Bank of California 1993  –  1996  (3 years) AVP Union Bank of California 1993  –  1996  (3 years) Education California State University-Long Beach California State University-Long Beach California State University-Long Beach California State University-Long Beach ", "Summary Dynamic, highly motivated individual with over ten years of experience in Information Technology, leading teams in delivering exemplary service. Aims to work in a stimulating and challenging environment that allows the leveraging of broad technical and management skills and expertise to make a lasting, positive impact on the organization. Summary Dynamic, highly motivated individual with over ten years of experience in Information Technology, leading teams in delivering exemplary service. Aims to work in a stimulating and challenging environment that allows the leveraging of broad technical and management skills and expertise to make a lasting, positive impact on the organization. Dynamic, highly motivated individual with over ten years of experience in Information Technology, leading teams in delivering exemplary service. Aims to work in a stimulating and challenging environment that allows the leveraging of broad technical and management skills and expertise to make a lasting, positive impact on the organization. Dynamic, highly motivated individual with over ten years of experience in Information Technology, leading teams in delivering exemplary service. Aims to work in a stimulating and challenging environment that allows the leveraging of broad technical and management skills and expertise to make a lasting, positive impact on the organization. Experience Delivery Project Executive IBM January 2014  – Present (1 year 8 months) Melbourne Area, Australia Responsibilities: \n \n• Manage end to end delivery of four IBM contracts (Healthcare, Manufacturing, Automotive and Electrical Appliances Clients) with a total contract value of over 15 million dollars \n• Client stakeholder management with chief executives and senior IT managers \n• Responsible for Financial Management by overseeing budget, forecasting cost and managing profitability \n• Identify and manage new opportunities from solution phase to delivery phase \n• Responsible for Server Support Operations, Network Support, Service Desk, Data Center Management, Security and Compliance management \n• Negotiate and manage the transition of Client services from first generation cloud infrastructure to SmartCloud Enterprise \n \nAchievements: \n \n• Led a cross skilled team to a successful and highly commended disaster recovery test of the National Blood Management system \n• Rebalanced expenditure by reducing cost on legacy infrastructure by 25% and reinvesting in innovative and newer mobility and cloud based technologies. Delivery Project Executive IBM January 2014  – Present (1 year 8 months) Melbourne Area, Australia Responsibilities: \n \n• Manage end to end delivery of four IBM contracts (Healthcare, Manufacturing, Automotive and Electrical Appliances Clients) with a total contract value of over 15 million dollars \n• Client stakeholder management with chief executives and senior IT managers \n• Responsible for Financial Management by overseeing budget, forecasting cost and managing profitability \n• Identify and manage new opportunities from solution phase to delivery phase \n• Responsible for Server Support Operations, Network Support, Service Desk, Data Center Management, Security and Compliance management \n• Negotiate and manage the transition of Client services from first generation cloud infrastructure to SmartCloud Enterprise \n \nAchievements: \n \n• Led a cross skilled team to a successful and highly commended disaster recovery test of the National Blood Management system \n• Rebalanced expenditure by reducing cost on legacy infrastructure by 25% and reinvesting in innovative and newer mobility and cloud based technologies. Delivery Project Executive IBM January 2014  – Present (1 year 8 months) Melbourne Area, Australia Responsibilities: \n \n• Manage end to end delivery of four IBM contracts (Healthcare, Manufacturing, Automotive and Electrical Appliances Clients) with a total contract value of over 15 million dollars \n• Client stakeholder management with chief executives and senior IT managers \n• Responsible for Financial Management by overseeing budget, forecasting cost and managing profitability \n• Identify and manage new opportunities from solution phase to delivery phase \n• Responsible for Server Support Operations, Network Support, Service Desk, Data Center Management, Security and Compliance management \n• Negotiate and manage the transition of Client services from first generation cloud infrastructure to SmartCloud Enterprise \n \nAchievements: \n \n• Led a cross skilled team to a successful and highly commended disaster recovery test of the National Blood Management system \n• Rebalanced expenditure by reducing cost on legacy infrastructure by 25% and reinvesting in innovative and newer mobility and cloud based technologies. Languages English Native or bilingual proficiency Hindi Limited working proficiency Malayalam Limited working proficiency Tamil Elementary proficiency Arabic Elementary proficiency English Native or bilingual proficiency Hindi Limited working proficiency Malayalam Limited working proficiency Tamil Elementary proficiency Arabic Elementary proficiency English Native or bilingual proficiency Hindi Limited working proficiency Malayalam Limited working proficiency Tamil Elementary proficiency Arabic Elementary proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Elementary proficiency Elementary proficiency Skills Service Delivery IT Service Management Incident Management Service Management Project Delivery ITIL Configuration Management IT Outsourcing Sla IT Operations Problem Management IT Strategy Solution Architecture ITIL Certified AIX Service Delivery... Service Desk Stakeholder Management Stakeholder Engagement Budgets Forecasting Executive Management Disaster Recovery SLA IT Management See 10+     See less Skills  Service Delivery IT Service Management Incident Management Service Management Project Delivery ITIL Configuration Management IT Outsourcing Sla IT Operations Problem Management IT Strategy Solution Architecture ITIL Certified AIX Service Delivery... Service Desk Stakeholder Management Stakeholder Engagement Budgets Forecasting Executive Management Disaster Recovery SLA IT Management See 10+     See less Service Delivery IT Service Management Incident Management Service Management Project Delivery ITIL Configuration Management IT Outsourcing Sla IT Operations Problem Management IT Strategy Solution Architecture ITIL Certified AIX Service Delivery... Service Desk Stakeholder Management Stakeholder Engagement Budgets Forecasting Executive Management Disaster Recovery SLA IT Management See 10+     See less Service Delivery IT Service Management Incident Management Service Management Project Delivery ITIL Configuration Management IT Outsourcing Sla IT Operations Problem Management IT Strategy Solution Architecture ITIL Certified AIX Service Delivery... Service Desk Stakeholder Management Stakeholder Engagement Budgets Forecasting Executive Management Disaster Recovery SLA IT Management See 10+     See less Education Monash University Master's Degree,  Masters of Network Computing , 79.34% Deakin University Masters in IT Security,  IT Security , 79.50% Monash University Master's Degree,  Masters of Network Computing , 79.34% Monash University Master's Degree,  Masters of Network Computing , 79.34% Monash University Master's Degree,  Masters of Network Computing , 79.34% Deakin University Masters in IT Security,  IT Security , 79.50% Deakin University Masters in IT Security,  IT Security , 79.50% Deakin University Masters in IT Security,  IT Security , 79.50% ", "Skills Global Delivery Transition Management Application Management... Client Engagement Project Delivery Program Management Skills  Global Delivery Transition Management Application Management... Client Engagement Project Delivery Program Management Global Delivery Transition Management Application Management... Client Engagement Project Delivery Program Management Global Delivery Transition Management Application Management... Client Engagement Project Delivery Program Management ", "Languages French Spanish French Spanish French Spanish Skills Global Delivery Outsourcing IT Outsourcing Integration Service Delivery PMO Program Management Skills  Global Delivery Outsourcing IT Outsourcing Integration Service Delivery PMO Program Management Global Delivery Outsourcing IT Outsourcing Integration Service Delivery PMO Program Management Global Delivery Outsourcing IT Outsourcing Integration Service Delivery PMO Program Management ", "Experience Service Availability Manager IBM do Brasil December 2008  – Present (6 years 9 months) Service Delivery Manager - IBM GPA - Grupo Pão de Açúcar August 2013  –  2013  (less than a year) (2013) Service Delivery Manager - IBM at Grupo Pão de Açúcar  \n(2011/2013) Service Delivery Manager - IBM at ACCOR  \n(2011/2013) Service Delivery Manager - IBM at Edenred  \n(2010) Service Delivery Manager - IBM at TecBan  \n(2009) Service Delivery Manager - IBM at Carrefour Especialista de Sistemas Carrefour Comércio e Indústria Ltda. April 1995  –  December 2008  (13 years 9 months) Service Availability Manager IBM do Brasil December 2008  – Present (6 years 9 months) Service Availability Manager IBM do Brasil December 2008  – Present (6 years 9 months) Service Delivery Manager - IBM GPA - Grupo Pão de Açúcar August 2013  –  2013  (less than a year) (2013) Service Delivery Manager - IBM at Grupo Pão de Açúcar  \n(2011/2013) Service Delivery Manager - IBM at ACCOR  \n(2011/2013) Service Delivery Manager - IBM at Edenred  \n(2010) Service Delivery Manager - IBM at TecBan  \n(2009) Service Delivery Manager - IBM at Carrefour Service Delivery Manager - IBM GPA - Grupo Pão de Açúcar August 2013  –  2013  (less than a year) (2013) Service Delivery Manager - IBM at Grupo Pão de Açúcar  \n(2011/2013) Service Delivery Manager - IBM at ACCOR  \n(2011/2013) Service Delivery Manager - IBM at Edenred  \n(2010) Service Delivery Manager - IBM at TecBan  \n(2009) Service Delivery Manager - IBM at Carrefour Especialista de Sistemas Carrefour Comércio e Indústria Ltda. April 1995  –  December 2008  (13 years 9 months) Especialista de Sistemas Carrefour Comércio e Indústria Ltda. April 1995  –  December 2008  (13 years 9 months) Skills IT Management ITIL Service Delivery IT Service Management PMO IT Outsourcing Disaster Recovery PMP ERP Business Intelligence SQL Data Center Operating Systems MS Project Sla PMI COBIT Outsourcing See 3+     See less Skills  IT Management ITIL Service Delivery IT Service Management PMO IT Outsourcing Disaster Recovery PMP ERP Business Intelligence SQL Data Center Operating Systems MS Project Sla PMI COBIT Outsourcing See 3+     See less IT Management ITIL Service Delivery IT Service Management PMO IT Outsourcing Disaster Recovery PMP ERP Business Intelligence SQL Data Center Operating Systems MS Project Sla PMI COBIT Outsourcing See 3+     See less IT Management ITIL Service Delivery IT Service Management PMO IT Outsourcing Disaster Recovery PMP ERP Business Intelligence SQL Data Center Operating Systems MS Project Sla PMI COBIT Outsourcing See 3+     See less Education Estácio - Centro Universitário Uniradial Formado,  Tecnólogo em Sistemas da Informação 2006  – 2008 Estácio - Centro Universitário Uniradial Formado,  Tecnólogo em Sistemas da Informação 2006  – 2008 Estácio - Centro Universitário Uniradial Formado,  Tecnólogo em Sistemas da Informação 2006  – 2008 Estácio - Centro Universitário Uniradial Formado,  Tecnólogo em Sistemas da Informação 2006  – 2008 ", "Summary At the outset, I wish to state that my endeavor had been, to serve any organization to the fullest leaving no room for remorse by the company or the team, on the choice of selection. \n \n \nObjective:  \n \nTo obtain a challenging position with particular emphasis on utilizing my skills & experience, thereby, contribute to the organization's growth and personal growth .Total experience - Eight Years Six Months \nRelevant Experience (current profile) - 17 Months Specialties:communication skills, computer hardware, continuous improvement, customer relations, customer satisfaction, delivery, documentation, email, engineering, foxpro, imaging, ip, lan, leadership, linux, management, meeting facilitation, mentoring, microsoft access, microsoft certified professional, microsoft excel, microsoft powerpoint, microsoft windows, microsoft windows 2000, microsoft windows 95, microsoft windows 98, Summary At the outset, I wish to state that my endeavor had been, to serve any organization to the fullest leaving no room for remorse by the company or the team, on the choice of selection. \n \n \nObjective:  \n \nTo obtain a challenging position with particular emphasis on utilizing my skills & experience, thereby, contribute to the organization's growth and personal growth .Total experience - Eight Years Six Months \nRelevant Experience (current profile) - 17 Months Specialties:communication skills, computer hardware, continuous improvement, customer relations, customer satisfaction, delivery, documentation, email, engineering, foxpro, imaging, ip, lan, leadership, linux, management, meeting facilitation, mentoring, microsoft access, microsoft certified professional, microsoft excel, microsoft powerpoint, microsoft windows, microsoft windows 2000, microsoft windows 95, microsoft windows 98, At the outset, I wish to state that my endeavor had been, to serve any organization to the fullest leaving no room for remorse by the company or the team, on the choice of selection. \n \n \nObjective:  \n \nTo obtain a challenging position with particular emphasis on utilizing my skills & experience, thereby, contribute to the organization's growth and personal growth .Total experience - Eight Years Six Months \nRelevant Experience (current profile) - 17 Months Specialties:communication skills, computer hardware, continuous improvement, customer relations, customer satisfaction, delivery, documentation, email, engineering, foxpro, imaging, ip, lan, leadership, linux, management, meeting facilitation, mentoring, microsoft access, microsoft certified professional, microsoft excel, microsoft powerpoint, microsoft windows, microsoft windows 2000, microsoft windows 95, microsoft windows 98, At the outset, I wish to state that my endeavor had been, to serve any organization to the fullest leaving no room for remorse by the company or the team, on the choice of selection. \n \n \nObjective:  \n \nTo obtain a challenging position with particular emphasis on utilizing my skills & experience, thereby, contribute to the organization's growth and personal growth .Total experience - Eight Years Six Months \nRelevant Experience (current profile) - 17 Months Specialties:communication skills, computer hardware, continuous improvement, customer relations, customer satisfaction, delivery, documentation, email, engineering, foxpro, imaging, ip, lan, leadership, linux, management, meeting facilitation, mentoring, microsoft access, microsoft certified professional, microsoft excel, microsoft powerpoint, microsoft windows, microsoft windows 2000, microsoft windows 95, microsoft windows 98, Experience Service Delivery Manager IBM August 2015  – Present (1 month) Bangalore Service Delivery Manager IBM August 2015  – Present (1 month) Bangalore Service Delivery Manager IBM August 2015  – Present (1 month) Bangalore Operations Manager Wipro Infotech Ltd December 2010  – Present (4 years 9 months) IT Manager Wipro Infotech January 2010  – Present (5 years 8 months) Program Lead Wipro Infotech August 2011  –  February 2015  (3 years 7 months) Mysuru Area, India Service desk Reliance Capital Ltd March 2008  –  June 2008  (4 months) Handling a huge user base of approximately 75000+users ( All Wipro Technologies and Wipro Infotech employees) for all geographies and responsible for remote support performance in 100+ Wipro locations all round the globe with a team of 75 + Engineers. \nPrime responsibilities included handling User Escalations, C-SAT, Operations & MIS, Training & recruitment, Audits, Team Management & General Administration. \nHandling weekly/Monthly customer reviews on operations. \nPrepare & update Monthly MIS reports and analyze the performance and initiate actions for continuous improvement in service desk and target on growing 'UP the service levels' \nEnsure high quality support is delivered by the team members by continuous monitoring and mentoring to meet all SLA parameters like response/resolution/repeat/reopen/C-Sat and analyze RCA on deviated incidents. \nCo-ordinating with planning team for any new implementation .Testing of applications on backbone and ODC environment and carry out the complete documentation before the release. \n \n2. Working as Site-In-Charge; Handling a Team of 23 Technical & 20 Service desk call coordinators across Tamil Nadu \nService desk consists of 20 call coordinators & 1 Team Lead who was reporting to me. \nCall coordinators in service desk were handling call across PAN India & assigning the same to the technical engineers. \nPreparing shift rosters for all 20 call coordinators  \nInteracting with Central Team for various requirements to ensure that service norm, deliverables committed to customer are met. \nAdhering to SLA norms & Process Adherence. \nAnalyzing the calls on response and resolution time violations  \nInteracting with operations & other teams on customer requirements. \nVerify all the reports which is sent out to Customer. \nDaily reviewing of open tickets and pending calls in IT IS Centre \nPreparation of monthly executive summary and submitting to PM  \nCall for weekly meeting & monthly meeting with team and PM. Shift Lead SCB (Scope International) March 2007  –  March 2008  (1 year 1 month) Team consists of Helpdesk , FM Engineers, PC Service Engineers & Asset Engineers. \nComplaint Handling, Quick Resolution, Customer Satisfaction, Team Management,  \nAdhering to SLA norms & Process Adherence. \nAnalyzing the calls on response and resolution time violations \nInteracting with operations & other teams on a customer requirements \nDaily reviewing of open tickets with respective vendors. \nCall for weekly meetings with PM L3 Engineers & Customer on open issues \nIdentifying the skill gap and training needed identification of the desktop engineer  \nand helpdesk executives and bring them to the notice of the PM \nIdentify the skill gaps for self in managing the monitored parameters to minimize the L3 escalations and bring them to the notice of the PM \nImplementation of new project based applications. \nInitiatives introduced to improve service delivery at the customer site \nPreparing Roaster for all the team. \nConducting daily review meeting with the customer & the IT Manager. \n \n4. Working as LAB Administrator - Win 2003 Server Administrator cum Team Lead (Desktop Support Engineers LAB Administrator Intel Technology India Pvt. Ltd March 2006  –  March 2007  (1 year 1 month) O/S Installation & Troubling shooting(Win XP,Win 2k3,Linux - SuSe,Fedora Core). \nGroup Policy Management \nFolder Management & Grant Permission \nImage Creation & Restoration. \nHost Management \nData Backup \nStatic & Dynamic IP Management \nAs a Team Lead : \nHandling the Team of 12 technical engineers. \nTeam consists of desktop engineers. \nComplaint Handling, Quick Resolution, Customer Satisfaction, Team Management,  \nAdhering to SLA norms & Process Adherence. \nAnalyzing the calls resolution time violations. \nDaily reviewing of open tickets assigned to the respective desktop engineers. \nConducting weekly Meeting with the engineers. \nPresenting the weekly activities & weekly plans to the customer. \nRouting the complaint tickets to the engineers accordingly. 5. Worked as Engineer - Email Administrator /Team Lead Service desk WIPRO INFOTECH June 2004  –  May 2005  (1 year) Was handling a team of 20 call coordinators. \nPreparing shift rosters for all 20 call coordinators & sharing the same with my supervisor. \nConducting weekly Meeting with the engineers. \nRouting the complaint tickets to the engineers accordingly. \nProviding first level support for User's on technical queries over voice & \nEmail support. \nMonitoring link outage and Server and escalating it to top level managers  \nthrough telephone as well as e-mail. \nAssigning calls to Technical Professionals. \nPreparing reports for different technical related issues regularly, i.e., Daily,  \nWeekly and monthly basis. \nInteracting with clients. \nMaintaining User's AD(Active Directory) Account. \nCreating Email ID's, User ID's & Mailbox \nTrouble shooting AD(Active Directory) Account lockout problems. \nMigration of users Mailbox. \nProviding VPN, RAS & IPass according to User's Request. \nTrouble shooting Mail bounce & Mail Delay Problems. \n \nTraining(s) Completed: Received Training on Active Directory & W2K  \nServer from company. Service Delivery Manager IBM August 2015  – Present (1 month) Bangalore Service Delivery Manager IBM August 2015  – Present (1 month) Bangalore Service Delivery Manager IBM August 2015  – Present (1 month) Bangalore Service Delivery Manager IBM August 2015  – Present (1 month) Bangalore Service Delivery Manager IBM August 2015  – Present (1 month) Bangalore Service Delivery Manager IBM August 2015  – Present (1 month) Bangalore Operations Manager Wipro Infotech Ltd December 2010  – Present (4 years 9 months) Operations Manager Wipro Infotech Ltd December 2010  – Present (4 years 9 months) IT Manager Wipro Infotech January 2010  – Present (5 years 8 months) IT Manager Wipro Infotech January 2010  – Present (5 years 8 months) Program Lead Wipro Infotech August 2011  –  February 2015  (3 years 7 months) Mysuru Area, India Program Lead Wipro Infotech August 2011  –  February 2015  (3 years 7 months) Mysuru Area, India Service desk Reliance Capital Ltd March 2008  –  June 2008  (4 months) Handling a huge user base of approximately 75000+users ( All Wipro Technologies and Wipro Infotech employees) for all geographies and responsible for remote support performance in 100+ Wipro locations all round the globe with a team of 75 + Engineers. \nPrime responsibilities included handling User Escalations, C-SAT, Operations & MIS, Training & recruitment, Audits, Team Management & General Administration. \nHandling weekly/Monthly customer reviews on operations. \nPrepare & update Monthly MIS reports and analyze the performance and initiate actions for continuous improvement in service desk and target on growing 'UP the service levels' \nEnsure high quality support is delivered by the team members by continuous monitoring and mentoring to meet all SLA parameters like response/resolution/repeat/reopen/C-Sat and analyze RCA on deviated incidents. \nCo-ordinating with planning team for any new implementation .Testing of applications on backbone and ODC environment and carry out the complete documentation before the release. \n \n2. Working as Site-In-Charge; Handling a Team of 23 Technical & 20 Service desk call coordinators across Tamil Nadu \nService desk consists of 20 call coordinators & 1 Team Lead who was reporting to me. \nCall coordinators in service desk were handling call across PAN India & assigning the same to the technical engineers. \nPreparing shift rosters for all 20 call coordinators  \nInteracting with Central Team for various requirements to ensure that service norm, deliverables committed to customer are met. \nAdhering to SLA norms & Process Adherence. \nAnalyzing the calls on response and resolution time violations  \nInteracting with operations & other teams on customer requirements. \nVerify all the reports which is sent out to Customer. \nDaily reviewing of open tickets and pending calls in IT IS Centre \nPreparation of monthly executive summary and submitting to PM  \nCall for weekly meeting & monthly meeting with team and PM. Service desk Reliance Capital Ltd March 2008  –  June 2008  (4 months) Handling a huge user base of approximately 75000+users ( All Wipro Technologies and Wipro Infotech employees) for all geographies and responsible for remote support performance in 100+ Wipro locations all round the globe with a team of 75 + Engineers. \nPrime responsibilities included handling User Escalations, C-SAT, Operations & MIS, Training & recruitment, Audits, Team Management & General Administration. \nHandling weekly/Monthly customer reviews on operations. \nPrepare & update Monthly MIS reports and analyze the performance and initiate actions for continuous improvement in service desk and target on growing 'UP the service levels' \nEnsure high quality support is delivered by the team members by continuous monitoring and mentoring to meet all SLA parameters like response/resolution/repeat/reopen/C-Sat and analyze RCA on deviated incidents. \nCo-ordinating with planning team for any new implementation .Testing of applications on backbone and ODC environment and carry out the complete documentation before the release. \n \n2. Working as Site-In-Charge; Handling a Team of 23 Technical & 20 Service desk call coordinators across Tamil Nadu \nService desk consists of 20 call coordinators & 1 Team Lead who was reporting to me. \nCall coordinators in service desk were handling call across PAN India & assigning the same to the technical engineers. \nPreparing shift rosters for all 20 call coordinators  \nInteracting with Central Team for various requirements to ensure that service norm, deliverables committed to customer are met. \nAdhering to SLA norms & Process Adherence. \nAnalyzing the calls on response and resolution time violations  \nInteracting with operations & other teams on customer requirements. \nVerify all the reports which is sent out to Customer. \nDaily reviewing of open tickets and pending calls in IT IS Centre \nPreparation of monthly executive summary and submitting to PM  \nCall for weekly meeting & monthly meeting with team and PM. Shift Lead SCB (Scope International) March 2007  –  March 2008  (1 year 1 month) Team consists of Helpdesk , FM Engineers, PC Service Engineers & Asset Engineers. \nComplaint Handling, Quick Resolution, Customer Satisfaction, Team Management,  \nAdhering to SLA norms & Process Adherence. \nAnalyzing the calls on response and resolution time violations \nInteracting with operations & other teams on a customer requirements \nDaily reviewing of open tickets with respective vendors. \nCall for weekly meetings with PM L3 Engineers & Customer on open issues \nIdentifying the skill gap and training needed identification of the desktop engineer  \nand helpdesk executives and bring them to the notice of the PM \nIdentify the skill gaps for self in managing the monitored parameters to minimize the L3 escalations and bring them to the notice of the PM \nImplementation of new project based applications. \nInitiatives introduced to improve service delivery at the customer site \nPreparing Roaster for all the team. \nConducting daily review meeting with the customer & the IT Manager. \n \n4. Working as LAB Administrator - Win 2003 Server Administrator cum Team Lead (Desktop Support Engineers Shift Lead SCB (Scope International) March 2007  –  March 2008  (1 year 1 month) Team consists of Helpdesk , FM Engineers, PC Service Engineers & Asset Engineers. \nComplaint Handling, Quick Resolution, Customer Satisfaction, Team Management,  \nAdhering to SLA norms & Process Adherence. \nAnalyzing the calls on response and resolution time violations \nInteracting with operations & other teams on a customer requirements \nDaily reviewing of open tickets with respective vendors. \nCall for weekly meetings with PM L3 Engineers & Customer on open issues \nIdentifying the skill gap and training needed identification of the desktop engineer  \nand helpdesk executives and bring them to the notice of the PM \nIdentify the skill gaps for self in managing the monitored parameters to minimize the L3 escalations and bring them to the notice of the PM \nImplementation of new project based applications. \nInitiatives introduced to improve service delivery at the customer site \nPreparing Roaster for all the team. \nConducting daily review meeting with the customer & the IT Manager. \n \n4. Working as LAB Administrator - Win 2003 Server Administrator cum Team Lead (Desktop Support Engineers LAB Administrator Intel Technology India Pvt. Ltd March 2006  –  March 2007  (1 year 1 month) O/S Installation & Troubling shooting(Win XP,Win 2k3,Linux - SuSe,Fedora Core). \nGroup Policy Management \nFolder Management & Grant Permission \nImage Creation & Restoration. \nHost Management \nData Backup \nStatic & Dynamic IP Management \nAs a Team Lead : \nHandling the Team of 12 technical engineers. \nTeam consists of desktop engineers. \nComplaint Handling, Quick Resolution, Customer Satisfaction, Team Management,  \nAdhering to SLA norms & Process Adherence. \nAnalyzing the calls resolution time violations. \nDaily reviewing of open tickets assigned to the respective desktop engineers. \nConducting weekly Meeting with the engineers. \nPresenting the weekly activities & weekly plans to the customer. \nRouting the complaint tickets to the engineers accordingly. LAB Administrator Intel Technology India Pvt. Ltd March 2006  –  March 2007  (1 year 1 month) O/S Installation & Troubling shooting(Win XP,Win 2k3,Linux - SuSe,Fedora Core). \nGroup Policy Management \nFolder Management & Grant Permission \nImage Creation & Restoration. \nHost Management \nData Backup \nStatic & Dynamic IP Management \nAs a Team Lead : \nHandling the Team of 12 technical engineers. \nTeam consists of desktop engineers. \nComplaint Handling, Quick Resolution, Customer Satisfaction, Team Management,  \nAdhering to SLA norms & Process Adherence. \nAnalyzing the calls resolution time violations. \nDaily reviewing of open tickets assigned to the respective desktop engineers. \nConducting weekly Meeting with the engineers. \nPresenting the weekly activities & weekly plans to the customer. \nRouting the complaint tickets to the engineers accordingly. 5. Worked as Engineer - Email Administrator /Team Lead Service desk WIPRO INFOTECH June 2004  –  May 2005  (1 year) Was handling a team of 20 call coordinators. \nPreparing shift rosters for all 20 call coordinators & sharing the same with my supervisor. \nConducting weekly Meeting with the engineers. \nRouting the complaint tickets to the engineers accordingly. \nProviding first level support for User's on technical queries over voice & \nEmail support. \nMonitoring link outage and Server and escalating it to top level managers  \nthrough telephone as well as e-mail. \nAssigning calls to Technical Professionals. \nPreparing reports for different technical related issues regularly, i.e., Daily,  \nWeekly and monthly basis. \nInteracting with clients. \nMaintaining User's AD(Active Directory) Account. \nCreating Email ID's, User ID's & Mailbox \nTrouble shooting AD(Active Directory) Account lockout problems. \nMigration of users Mailbox. \nProviding VPN, RAS & IPass according to User's Request. \nTrouble shooting Mail bounce & Mail Delay Problems. \n \nTraining(s) Completed: Received Training on Active Directory & W2K  \nServer from company. 5. Worked as Engineer - Email Administrator /Team Lead Service desk WIPRO INFOTECH June 2004  –  May 2005  (1 year) Was handling a team of 20 call coordinators. \nPreparing shift rosters for all 20 call coordinators & sharing the same with my supervisor. \nConducting weekly Meeting with the engineers. \nRouting the complaint tickets to the engineers accordingly. \nProviding first level support for User's on technical queries over voice & \nEmail support. \nMonitoring link outage and Server and escalating it to top level managers  \nthrough telephone as well as e-mail. \nAssigning calls to Technical Professionals. \nPreparing reports for different technical related issues regularly, i.e., Daily,  \nWeekly and monthly basis. \nInteracting with clients. \nMaintaining User's AD(Active Directory) Account. \nCreating Email ID's, User ID's & Mailbox \nTrouble shooting AD(Active Directory) Account lockout problems. \nMigration of users Mailbox. \nProviding VPN, RAS & IPass according to User's Request. \nTrouble shooting Mail bounce & Mail Delay Problems. \n \nTraining(s) Completed: Received Training on Active Directory & W2K  \nServer from company. Skills Business Intelligence Management Business Continuity... Windows Team Management Microsoft Certified... IT Service Management Sla Software Documentation Active Directory Troubleshooting Technical Support Service Delivery VPN Windows Server Skills  Business Intelligence Management Business Continuity... Windows Team Management Microsoft Certified... IT Service Management Sla Software Documentation Active Directory Troubleshooting Technical Support Service Delivery VPN Windows Server Business Intelligence Management Business Continuity... Windows Team Management Microsoft Certified... IT Service Management Sla Software Documentation Active Directory Troubleshooting Technical Support Service Delivery VPN Windows Server Business Intelligence Management Business Continuity... Windows Team Management Microsoft Certified... IT Service Management Sla Software Documentation Active Directory Troubleshooting Technical Support Service Delivery VPN Windows Server Education First Grade College B.Com,  Commerce 1997  – 2000 Lindsay Memorial School Bachelor of Commerce 1997  – 2000 First Grade College B.Com,  Commerce 1997  – 2000 First Grade College B.Com,  Commerce 1997  – 2000 First Grade College B.Com,  Commerce 1997  – 2000 Lindsay Memorial School Bachelor of Commerce 1997  – 2000 Lindsay Memorial School Bachelor of Commerce 1997  – 2000 Lindsay Memorial School Bachelor of Commerce 1997  – 2000 ", "Summary I am serviceminded and have exprience with both internal and external collaboration. I am used to plan my own work and I work independently, structured and consistently targeted. \nI am Analytical and act rationally - even in stressful situations. \nI can sense the situation and knows how to adapt my behavior to the customer. Summary I am serviceminded and have exprience with both internal and external collaboration. I am used to plan my own work and I work independently, structured and consistently targeted. \nI am Analytical and act rationally - even in stressful situations. \nI can sense the situation and knows how to adapt my behavior to the customer. I am serviceminded and have exprience with both internal and external collaboration. I am used to plan my own work and I work independently, structured and consistently targeted. \nI am Analytical and act rationally - even in stressful situations. \nI can sense the situation and knows how to adapt my behavior to the customer. I am serviceminded and have exprience with both internal and external collaboration. I am used to plan my own work and I work independently, structured and consistently targeted. \nI am Analytical and act rationally - even in stressful situations. \nI can sense the situation and knows how to adapt my behavior to the customer. Experience Service Delivery Manager IBM Danmark ApS April 2013  – Present (2 years 5 months) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark ApS October 2012  –  March 2013  (6 months) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark ApS October 2012  –  December 2012  (3 months) Copenhagen Area, Denmark Technical Solution Manager IBM Danmark ApS March 2011  –  September 2012  (1 year 7 months) Copenhagen Area, Denmark Soldier Danish Defence April 2012  –  June 2012  (3 months) Camp Maréchal de Lattre de Tassigny (Novo Selo), Kosovo Service Delivery Manager IBM Danmark ApS February 2010  –  February 2011  (1 year 1 month) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark A/S May 2002  –  January 2010  (7 years 9 months) Copenhagen Area, Denmark Project Manager IBM Danmark A/S August 2001  –  May 2002  (10 months) Copenhagen Area, Denmark IT Specialist IBM Danmark A/S July 1997  –  July 2001  (4 years 1 month) Copenhagen Area, Denmark IT Specialist Responsor A/S March 1996  –  June 1997  (1 year 4 months) Copenhagen Area, Denmark Sales Assistant Johannes Fog A/S June 1986  –  March 1996  (9 years 10 months) Copenhagen Area, Denmark Soldier Danish Defence September 1985  –  May 1986  (9 months) København / Høvelte Service Delivery Manager IBM Danmark ApS April 2013  – Present (2 years 5 months) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark ApS April 2013  – Present (2 years 5 months) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark ApS October 2012  –  March 2013  (6 months) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark ApS October 2012  –  March 2013  (6 months) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark ApS October 2012  –  December 2012  (3 months) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark ApS October 2012  –  December 2012  (3 months) Copenhagen Area, Denmark Technical Solution Manager IBM Danmark ApS March 2011  –  September 2012  (1 year 7 months) Copenhagen Area, Denmark Technical Solution Manager IBM Danmark ApS March 2011  –  September 2012  (1 year 7 months) Copenhagen Area, Denmark Soldier Danish Defence April 2012  –  June 2012  (3 months) Camp Maréchal de Lattre de Tassigny (Novo Selo), Kosovo Soldier Danish Defence April 2012  –  June 2012  (3 months) Camp Maréchal de Lattre de Tassigny (Novo Selo), Kosovo Service Delivery Manager IBM Danmark ApS February 2010  –  February 2011  (1 year 1 month) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark ApS February 2010  –  February 2011  (1 year 1 month) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark A/S May 2002  –  January 2010  (7 years 9 months) Copenhagen Area, Denmark Service Delivery Manager IBM Danmark A/S May 2002  –  January 2010  (7 years 9 months) Copenhagen Area, Denmark Project Manager IBM Danmark A/S August 2001  –  May 2002  (10 months) Copenhagen Area, Denmark Project Manager IBM Danmark A/S August 2001  –  May 2002  (10 months) Copenhagen Area, Denmark IT Specialist IBM Danmark A/S July 1997  –  July 2001  (4 years 1 month) Copenhagen Area, Denmark IT Specialist IBM Danmark A/S July 1997  –  July 2001  (4 years 1 month) Copenhagen Area, Denmark IT Specialist Responsor A/S March 1996  –  June 1997  (1 year 4 months) Copenhagen Area, Denmark IT Specialist Responsor A/S March 1996  –  June 1997  (1 year 4 months) Copenhagen Area, Denmark Sales Assistant Johannes Fog A/S June 1986  –  March 1996  (9 years 10 months) Copenhagen Area, Denmark Sales Assistant Johannes Fog A/S June 1986  –  March 1996  (9 years 10 months) Copenhagen Area, Denmark Soldier Danish Defence September 1985  –  May 1986  (9 months) København / Høvelte Soldier Danish Defence September 1985  –  May 1986  (9 months) København / Høvelte Languages English Full professional proficiency German Elementary proficiency French Elementary proficiency Italian Elementary proficiency Swedish Professional working proficiency Norwegian Professional working proficiency Danish Native or bilingual proficiency English Full professional proficiency German Elementary proficiency French Elementary proficiency Italian Elementary proficiency Swedish Professional working proficiency Norwegian Professional working proficiency Danish Native or bilingual proficiency English Full professional proficiency German Elementary proficiency French Elementary proficiency Italian Elementary proficiency Swedish Professional working proficiency Norwegian Professional working proficiency Danish Native or bilingual proficiency Full professional proficiency Elementary proficiency Elementary proficiency Elementary proficiency Professional working proficiency Professional working proficiency Native or bilingual proficiency Skills IT Outsourcing IT Service Management ITIL Service Delivery System Deployment Operating Systems Service Management Infrastructure Outsourcing IT Strategy Incident Management Sla Global Delivery IT Operations Solution Architecture IT Management Transition Management Service Desk Enterprise Architecture Data Center Pre-sales Project Portfolio... PMP Project Delivery IT Transformation ITIL Certified Disaster Recovery Virtualization PMO Offshoring Problem Management Project Management Change Management See 18+     See less Skills  IT Outsourcing IT Service Management ITIL Service Delivery System Deployment Operating Systems Service Management Infrastructure Outsourcing IT Strategy Incident Management Sla Global Delivery IT Operations Solution Architecture IT Management Transition Management Service Desk Enterprise Architecture Data Center Pre-sales Project Portfolio... PMP Project Delivery IT Transformation ITIL Certified Disaster Recovery Virtualization PMO Offshoring Problem Management Project Management Change Management See 18+     See less IT Outsourcing IT Service Management ITIL Service Delivery System Deployment Operating Systems Service Management Infrastructure Outsourcing IT Strategy Incident Management Sla Global Delivery IT Operations Solution Architecture IT Management Transition Management Service Desk Enterprise Architecture Data Center Pre-sales Project Portfolio... PMP Project Delivery IT Transformation ITIL Certified Disaster Recovery Virtualization PMO Offshoring Problem Management Project Management Change Management See 18+     See less IT Outsourcing IT Service Management ITIL Service Delivery System Deployment Operating Systems Service Management Infrastructure Outsourcing IT Strategy Incident Management Sla Global Delivery IT Operations Solution Architecture IT Management Transition Management Service Desk Enterprise Architecture Data Center Pre-sales Project Portfolio... PMP Project Delivery IT Transformation ITIL Certified Disaster Recovery Virtualization PMO Offshoring Problem Management Project Management Change Management See 18+     See less Education Danmarks Tekniske Universitet Master of Science In Engineering 1986  – 1995 Kildegård Gymnasium High-school certificate 1982  – 1985 Danmarks Tekniske Universitet Master of Science In Engineering 1986  – 1995 Danmarks Tekniske Universitet Master of Science In Engineering 1986  – 1995 Danmarks Tekniske Universitet Master of Science In Engineering 1986  – 1995 Kildegård Gymnasium High-school certificate 1982  – 1985 Kildegård Gymnasium High-school certificate 1982  – 1985 Kildegård Gymnasium High-school certificate 1982  – 1985 Honors & Awards ", "Languages English Kannada Hindi English Kannada Hindi English Kannada Hindi Skills Software Project... SOA Agile Methodologies Requirements Analysis Solution Architecture Atlassian JIRA Scrum Enterprise Software WebLogic Web Services Oracle Integration Manage Complex Projects Skills  Software Project... SOA Agile Methodologies Requirements Analysis Solution Architecture Atlassian JIRA Scrum Enterprise Software WebLogic Web Services Oracle Integration Manage Complex Projects Software Project... SOA Agile Methodologies Requirements Analysis Solution Architecture Atlassian JIRA Scrum Enterprise Software WebLogic Web Services Oracle Integration Manage Complex Projects Software Project... SOA Agile Methodologies Requirements Analysis Solution Architecture Atlassian JIRA Scrum Enterprise Software WebLogic Web Services Oracle Integration Manage Complex Projects Honors & Awards Top Contributor Award IBM March 2014 IBM Outstanding Contributor Award IBM March 2013 Eminence & Excellence Award IBM October 2012 Service Excellence Award IBM October 2011 IBM Bravo for Leadership IBM June 2008 Top Contributor Award IBM March 2014 Top Contributor Award IBM March 2014 Top Contributor Award IBM March 2014 IBM Outstanding Contributor Award IBM March 2013 IBM Outstanding Contributor Award IBM March 2013 IBM Outstanding Contributor Award IBM March 2013 Eminence & Excellence Award IBM October 2012 Eminence & Excellence Award IBM October 2012 Eminence & Excellence Award IBM October 2012 Service Excellence Award IBM October 2011 Service Excellence Award IBM October 2011 Service Excellence Award IBM October 2011 IBM Bravo for Leadership IBM June 2008 IBM Bravo for Leadership IBM June 2008 IBM Bravo for Leadership IBM June 2008 ", "Skills Security CISSP Application Security Data Security Vulnerability Assessment Information Security Penetration Testing Network Security Integration Information Security... IDS Solution Architecture Information Technology Enterprise Software PCI DSS Vulnerability Management SDLC Computer Security See 3+     See less Skills  Security CISSP Application Security Data Security Vulnerability Assessment Information Security Penetration Testing Network Security Integration Information Security... IDS Solution Architecture Information Technology Enterprise Software PCI DSS Vulnerability Management SDLC Computer Security See 3+     See less Security CISSP Application Security Data Security Vulnerability Assessment Information Security Penetration Testing Network Security Integration Information Security... IDS Solution Architecture Information Technology Enterprise Software PCI DSS Vulnerability Management SDLC Computer Security See 3+     See less Security CISSP Application Security Data Security Vulnerability Assessment Information Security Penetration Testing Network Security Integration Information Security... IDS Solution Architecture Information Technology Enterprise Software PCI DSS Vulnerability Management SDLC Computer Security See 3+     See less Honors & Awards ", "Summary - Service Delivery Manager at IBM \n- LEAN (SixSigma) associate \n- Point of contact for Nestle Waters North America and Nestle Mexico. \n- Active Directory administrator. \n- Technical services. \n \nSpecialties: - ITIL v3 - IT Service Management Foundation \n- LEAN (SixSigma) \n- Organizational Changes (Culture) \n- MCTS: Configuring Windows Vista Client \n- Servers administration \n- Active Directory administration Summary - Service Delivery Manager at IBM \n- LEAN (SixSigma) associate \n- Point of contact for Nestle Waters North America and Nestle Mexico. \n- Active Directory administrator. \n- Technical services. \n \nSpecialties: - ITIL v3 - IT Service Management Foundation \n- LEAN (SixSigma) \n- Organizational Changes (Culture) \n- MCTS: Configuring Windows Vista Client \n- Servers administration \n- Active Directory administration - Service Delivery Manager at IBM \n- LEAN (SixSigma) associate \n- Point of contact for Nestle Waters North America and Nestle Mexico. \n- Active Directory administrator. \n- Technical services. \n \nSpecialties: - ITIL v3 - IT Service Management Foundation \n- LEAN (SixSigma) \n- Organizational Changes (Culture) \n- MCTS: Configuring Windows Vista Client \n- Servers administration \n- Active Directory administration - Service Delivery Manager at IBM \n- LEAN (SixSigma) associate \n- Point of contact for Nestle Waters North America and Nestle Mexico. \n- Active Directory administrator. \n- Technical services. \n \nSpecialties: - ITIL v3 - IT Service Management Foundation \n- LEAN (SixSigma) \n- Organizational Changes (Culture) \n- MCTS: Configuring Windows Vista Client \n- Servers administration \n- Active Directory administration Experience Global Service Delivery Manager IBM Global Services February 2014  – Present (1 year 7 months) Mainframe Global Service Delivery Manager at IBM \n- Client face \n- Work with the client to understand issues and requirements and responds to requests for new services. \n- Ensure positive client satisfaction and client relationship is maintained. \n- Be the primary contact between the Delivery Project Executive and delivery support organization. \n- Support the Delivery Project Executive and the Project Executive as the service delivery advocate. \n- Proactively monitor the problem and change process and manages problem and change issues and alerts as needed. \n- Help to ensure quality of service and manage cost of delivery by looking at better ways to provide service in a cost efficient manner. \n- Lead and direct the delivery team with direction from the executives. \n- Drive/Manage service quality and improvement of service delivery processes. \n- Participate in Technical proposal preparation. \n- Provide technical support and participate in the Change Control Board and/or change control process. \n- Drive/participate and coordinate crisis management. \n- Client supported: Ameriprise Financial Inc. \n- Service lines supported: CICS system support, IMS system support, DB2 system support, Mainframe Batch and Console operations. Service Delivery Manager IBM Global Services July 2009  –  February 2014  (4 years 8 months) - (Jul/09 - to date): Service Delivery Manager at IBM \n- Be the primary contact between the Delivery Project Executive and delivery support organization.  \n- Support the Delivery Project Executive and the Project Executive as the service delivery advocate.  \n- Proactively monitor the problem and change process and manages problem and change issues and alerts as needed. \n- Work with the customer to understand issues and requirements and responds to requests for new services. \n- Help to ensure quality of service and manage cost of delivery by looking at better ways to provide service in a cost efficient manner.  \n- Lead and direct the delivery team with direction from the executives. \n- Ensure positive customer satisfaction and customer relationship is maintained. \n- Drive/Manage service quality and improvement of service delivery processes. \n- Participate in Technical proposal preparation. \n- Provide technical support and participate in the Change Control Board and/or change control process. \n- Drive/participate and coordinate crisis management. \n \n- Customers supported: Ameriprise Financial Inc.; Discover Financial Services; GM; Vanity Fair. \n- Service lines supported: CICS system support, IMS system support, Batch and Console operations, DB2 UDB, Oracle, SQL, Windows Intel. IT Specialist IBM do Brasil January 2005  –  June 2009  (4 years 6 months) 09/2008 - 06/2009 Implement LEAN (SixSigma) methodology in Software Platform Management Services area. Identify the major wastes in order to eliminate them and to improve quality and value for the IBM clients.  \n07/2008-to 09/2008 (AT&T)  \nTo provide a standard image for workstations used by IBM employees that will support AT&T using client network infrastructure. \n06/2008-07/2008 (InBev)  \nTo support Windows srvs of InBev environment. AD based environment. \n01/2005-06/2008 (Nestle)  \nAD management. Hotfixes & Application deployment. \nSingle Point of Contact for Nestle Waters (USA), Nestle Mexico.Assist in troubleshooting LAN, desktop/workstations, srvr problems, and applications. Analyze completed wkst requests to: Identify and recommend required process improvements. Identify any process compliance issues. Update/reload approved, supported software application. IT Specialist Compassion do Brasil May 2001  –  December 2004  (3 years 8 months) Active Directory management. \nSoftware distribution via Intellimirror. \nHardware and software purchase. \nSoftware development. \nNetwork cabling. Global Service Delivery Manager IBM Global Services February 2014  – Present (1 year 7 months) Mainframe Global Service Delivery Manager at IBM \n- Client face \n- Work with the client to understand issues and requirements and responds to requests for new services. \n- Ensure positive client satisfaction and client relationship is maintained. \n- Be the primary contact between the Delivery Project Executive and delivery support organization. \n- Support the Delivery Project Executive and the Project Executive as the service delivery advocate. \n- Proactively monitor the problem and change process and manages problem and change issues and alerts as needed. \n- Help to ensure quality of service and manage cost of delivery by looking at better ways to provide service in a cost efficient manner. \n- Lead and direct the delivery team with direction from the executives. \n- Drive/Manage service quality and improvement of service delivery processes. \n- Participate in Technical proposal preparation. \n- Provide technical support and participate in the Change Control Board and/or change control process. \n- Drive/participate and coordinate crisis management. \n- Client supported: Ameriprise Financial Inc. \n- Service lines supported: CICS system support, IMS system support, DB2 system support, Mainframe Batch and Console operations. Global Service Delivery Manager IBM Global Services February 2014  – Present (1 year 7 months) Mainframe Global Service Delivery Manager at IBM \n- Client face \n- Work with the client to understand issues and requirements and responds to requests for new services. \n- Ensure positive client satisfaction and client relationship is maintained. \n- Be the primary contact between the Delivery Project Executive and delivery support organization. \n- Support the Delivery Project Executive and the Project Executive as the service delivery advocate. \n- Proactively monitor the problem and change process and manages problem and change issues and alerts as needed. \n- Help to ensure quality of service and manage cost of delivery by looking at better ways to provide service in a cost efficient manner. \n- Lead and direct the delivery team with direction from the executives. \n- Drive/Manage service quality and improvement of service delivery processes. \n- Participate in Technical proposal preparation. \n- Provide technical support and participate in the Change Control Board and/or change control process. \n- Drive/participate and coordinate crisis management. \n- Client supported: Ameriprise Financial Inc. \n- Service lines supported: CICS system support, IMS system support, DB2 system support, Mainframe Batch and Console operations. Service Delivery Manager IBM Global Services July 2009  –  February 2014  (4 years 8 months) - (Jul/09 - to date): Service Delivery Manager at IBM \n- Be the primary contact between the Delivery Project Executive and delivery support organization.  \n- Support the Delivery Project Executive and the Project Executive as the service delivery advocate.  \n- Proactively monitor the problem and change process and manages problem and change issues and alerts as needed. \n- Work with the customer to understand issues and requirements and responds to requests for new services. \n- Help to ensure quality of service and manage cost of delivery by looking at better ways to provide service in a cost efficient manner.  \n- Lead and direct the delivery team with direction from the executives. \n- Ensure positive customer satisfaction and customer relationship is maintained. \n- Drive/Manage service quality and improvement of service delivery processes. \n- Participate in Technical proposal preparation. \n- Provide technical support and participate in the Change Control Board and/or change control process. \n- Drive/participate and coordinate crisis management. \n \n- Customers supported: Ameriprise Financial Inc.; Discover Financial Services; GM; Vanity Fair. \n- Service lines supported: CICS system support, IMS system support, Batch and Console operations, DB2 UDB, Oracle, SQL, Windows Intel. Service Delivery Manager IBM Global Services July 2009  –  February 2014  (4 years 8 months) - (Jul/09 - to date): Service Delivery Manager at IBM \n- Be the primary contact between the Delivery Project Executive and delivery support organization.  \n- Support the Delivery Project Executive and the Project Executive as the service delivery advocate.  \n- Proactively monitor the problem and change process and manages problem and change issues and alerts as needed. \n- Work with the customer to understand issues and requirements and responds to requests for new services. \n- Help to ensure quality of service and manage cost of delivery by looking at better ways to provide service in a cost efficient manner.  \n- Lead and direct the delivery team with direction from the executives. \n- Ensure positive customer satisfaction and customer relationship is maintained. \n- Drive/Manage service quality and improvement of service delivery processes. \n- Participate in Technical proposal preparation. \n- Provide technical support and participate in the Change Control Board and/or change control process. \n- Drive/participate and coordinate crisis management. \n \n- Customers supported: Ameriprise Financial Inc.; Discover Financial Services; GM; Vanity Fair. \n- Service lines supported: CICS system support, IMS system support, Batch and Console operations, DB2 UDB, Oracle, SQL, Windows Intel. IT Specialist IBM do Brasil January 2005  –  June 2009  (4 years 6 months) 09/2008 - 06/2009 Implement LEAN (SixSigma) methodology in Software Platform Management Services area. Identify the major wastes in order to eliminate them and to improve quality and value for the IBM clients.  \n07/2008-to 09/2008 (AT&T)  \nTo provide a standard image for workstations used by IBM employees that will support AT&T using client network infrastructure. \n06/2008-07/2008 (InBev)  \nTo support Windows srvs of InBev environment. AD based environment. \n01/2005-06/2008 (Nestle)  \nAD management. Hotfixes & Application deployment. \nSingle Point of Contact for Nestle Waters (USA), Nestle Mexico.Assist in troubleshooting LAN, desktop/workstations, srvr problems, and applications. Analyze completed wkst requests to: Identify and recommend required process improvements. Identify any process compliance issues. Update/reload approved, supported software application. IT Specialist IBM do Brasil January 2005  –  June 2009  (4 years 6 months) 09/2008 - 06/2009 Implement LEAN (SixSigma) methodology in Software Platform Management Services area. Identify the major wastes in order to eliminate them and to improve quality and value for the IBM clients.  \n07/2008-to 09/2008 (AT&T)  \nTo provide a standard image for workstations used by IBM employees that will support AT&T using client network infrastructure. \n06/2008-07/2008 (InBev)  \nTo support Windows srvs of InBev environment. AD based environment. \n01/2005-06/2008 (Nestle)  \nAD management. Hotfixes & Application deployment. \nSingle Point of Contact for Nestle Waters (USA), Nestle Mexico.Assist in troubleshooting LAN, desktop/workstations, srvr problems, and applications. Analyze completed wkst requests to: Identify and recommend required process improvements. Identify any process compliance issues. Update/reload approved, supported software application. IT Specialist Compassion do Brasil May 2001  –  December 2004  (3 years 8 months) Active Directory management. \nSoftware distribution via Intellimirror. \nHardware and software purchase. \nSoftware development. \nNetwork cabling. IT Specialist Compassion do Brasil May 2001  –  December 2004  (3 years 8 months) Active Directory management. \nSoftware distribution via Intellimirror. \nHardware and software purchase. \nSoftware development. \nNetwork cabling. Skills ITIL Active Directory IT Service Management Service Delivery IT Management Service Management Skills  ITIL Active Directory IT Service Management Service Delivery IT Management Service Management ITIL Active Directory IT Service Management Service Delivery IT Management Service Management ITIL Active Directory IT Service Management Service Delivery IT Management Service Management Education Universidade Estadual de Campinas College,  Data Processing Technology 1993  – 1997 COTUCA 1987  – 1991 Universidade Estadual de Campinas College,  Data Processing Technology 1993  – 1997 Universidade Estadual de Campinas College,  Data Processing Technology 1993  – 1997 Universidade Estadual de Campinas College,  Data Processing Technology 1993  – 1997 COTUCA 1987  – 1991 COTUCA 1987  – 1991 COTUCA 1987  – 1991 Honors & Awards Additional Honors & Awards The Best of IBM! - Teamwork Inside - September 2007 \nQuarter Highlight (4Q/2008) - Representing SPMS Brazil in LEAN project. Additional Honors & Awards The Best of IBM! - Teamwork Inside - September 2007 \nQuarter Highlight (4Q/2008) - Representing SPMS Brazil in LEAN project. Additional Honors & Awards The Best of IBM! - Teamwork Inside - September 2007 \nQuarter Highlight (4Q/2008) - Representing SPMS Brazil in LEAN project. Additional Honors & Awards The Best of IBM! - Teamwork Inside - September 2007 \nQuarter Highlight (4Q/2008) - Representing SPMS Brazil in LEAN project. ", "Experience IT Delivery Manager IBM May 2015  – Present (4 months) Amsterdam Area, Netherlands IT Delivery Manager responsible for OS platforms of Midrange Systems (Unix, Linux, Solaris, Wintel and iSeries) at the ABN AMRO account (± 30 pers). \n \n IT Delivery Manager IBM June 2014  –  May 2015  (1 year) Amsterdam Area, Netherlands IT Delivery Manager responsible for Data Management (Oracle, SQL and DB2) at the ABN AMRO account (± 20 pers). \n IT Delivery Manager IBM August 2012  –  June 2014  (1 year 11 months) Amsterdam Area, Netherlands Responsible for the Oracle Data Management (± 40 pers). The Oracle Data Management department performs Oracle Support and DBA project activities for 11 customers. Acting Manager IBM November 2011  –  August 2012  (10 months) Amstelveen Responsible for the Data Management department Oracle Projects (± 20 pers). Oracle Projects performs Oracle DBA project activities for 11 clients. Team Lead / Backup First Line Manager IBM July 2010  –  November 2011  (1 year 5 months) Amstelveen Responsible for the operational lead of the Data Management department (Oracle, DB2 and SQL databases) at the ABN AMRO account (± 36 pers) . Team Lead / Backup First Line Manager IBM February 2010  –  June 2010  (5 months) Amstelveen Responsible for the operational lead of the UNIX and Storage department at the ABN AMRO account (±70 pers). Team Lead IBM February 2009  –  January 2010  (1 year) Amstelveen Responsible for the operational lead of the department Wintel Releasing at the ABN AMRO account. The department Wintel Releasing is responsible for the acceptance of all changes in the Wintel environment of the ABN AMRO BUNL. Team Lead / Backup First Line Manager IBM November 2006  –  January 2009  (2 years 3 months) Amstelveen Responsible for the operational lead of the department Wintel Projects (± 30 pers) at the ABN AMRO account. The department Wintel Projects delivers technical resources (engineers) and knowledge regarding the Wintel Platform to projects and microworkorders. IT Specialist IBM November 2005  –  October 2006  (1 year) Amstelveen Participated in various projects at the ABN AMRO account as a system engineer and projectcoordinator. System Engineer ABN AMRO Bank N.V. November 2002  –  November 2005  (3 years 1 month) Amstelveen As an system engineer I have developed several Infrastructural components based on the MicroSoft Windows. \nAs an projectcoordinator I have participated several large Migration projects. System Engineer ABN AMRO Bank N.V. August 2001  –  November 2002  (1 year 4 months) Amstelveen As a system engineer with the specialism ´Storage and Backup` I was responsible for : \n- creating technical solutions including costs reports. \n- defining technical standards. \n- defining concepts (e.g. Security concepts). \n- 3e and 4e Line support. \n- acceptance of new products. Lanmanager ABN AMRO Bank N.V. May 1999  –  July 2001  (2 years 3 months) Amstelveen Responsible for maintaining OS2 and Windows NT4 domains used by 1800 users. IT Delivery Manager IBM May 2015  – Present (4 months) Amsterdam Area, Netherlands IT Delivery Manager responsible for OS platforms of Midrange Systems (Unix, Linux, Solaris, Wintel and iSeries) at the ABN AMRO account (± 30 pers). \n \n IT Delivery Manager IBM May 2015  – Present (4 months) Amsterdam Area, Netherlands IT Delivery Manager responsible for OS platforms of Midrange Systems (Unix, Linux, Solaris, Wintel and iSeries) at the ABN AMRO account (± 30 pers). \n \n IT Delivery Manager IBM June 2014  –  May 2015  (1 year) Amsterdam Area, Netherlands IT Delivery Manager responsible for Data Management (Oracle, SQL and DB2) at the ABN AMRO account (± 20 pers). \n IT Delivery Manager IBM June 2014  –  May 2015  (1 year) Amsterdam Area, Netherlands IT Delivery Manager responsible for Data Management (Oracle, SQL and DB2) at the ABN AMRO account (± 20 pers). \n IT Delivery Manager IBM August 2012  –  June 2014  (1 year 11 months) Amsterdam Area, Netherlands Responsible for the Oracle Data Management (± 40 pers). The Oracle Data Management department performs Oracle Support and DBA project activities for 11 customers. IT Delivery Manager IBM August 2012  –  June 2014  (1 year 11 months) Amsterdam Area, Netherlands Responsible for the Oracle Data Management (± 40 pers). The Oracle Data Management department performs Oracle Support and DBA project activities for 11 customers. Acting Manager IBM November 2011  –  August 2012  (10 months) Amstelveen Responsible for the Data Management department Oracle Projects (± 20 pers). Oracle Projects performs Oracle DBA project activities for 11 clients. Acting Manager IBM November 2011  –  August 2012  (10 months) Amstelveen Responsible for the Data Management department Oracle Projects (± 20 pers). Oracle Projects performs Oracle DBA project activities for 11 clients. Team Lead / Backup First Line Manager IBM July 2010  –  November 2011  (1 year 5 months) Amstelveen Responsible for the operational lead of the Data Management department (Oracle, DB2 and SQL databases) at the ABN AMRO account (± 36 pers) . Team Lead / Backup First Line Manager IBM July 2010  –  November 2011  (1 year 5 months) Amstelveen Responsible for the operational lead of the Data Management department (Oracle, DB2 and SQL databases) at the ABN AMRO account (± 36 pers) . Team Lead / Backup First Line Manager IBM February 2010  –  June 2010  (5 months) Amstelveen Responsible for the operational lead of the UNIX and Storage department at the ABN AMRO account (±70 pers). Team Lead / Backup First Line Manager IBM February 2010  –  June 2010  (5 months) Amstelveen Responsible for the operational lead of the UNIX and Storage department at the ABN AMRO account (±70 pers). Team Lead IBM February 2009  –  January 2010  (1 year) Amstelveen Responsible for the operational lead of the department Wintel Releasing at the ABN AMRO account. The department Wintel Releasing is responsible for the acceptance of all changes in the Wintel environment of the ABN AMRO BUNL. Team Lead IBM February 2009  –  January 2010  (1 year) Amstelveen Responsible for the operational lead of the department Wintel Releasing at the ABN AMRO account. The department Wintel Releasing is responsible for the acceptance of all changes in the Wintel environment of the ABN AMRO BUNL. Team Lead / Backup First Line Manager IBM November 2006  –  January 2009  (2 years 3 months) Amstelveen Responsible for the operational lead of the department Wintel Projects (± 30 pers) at the ABN AMRO account. The department Wintel Projects delivers technical resources (engineers) and knowledge regarding the Wintel Platform to projects and microworkorders. Team Lead / Backup First Line Manager IBM November 2006  –  January 2009  (2 years 3 months) Amstelveen Responsible for the operational lead of the department Wintel Projects (± 30 pers) at the ABN AMRO account. The department Wintel Projects delivers technical resources (engineers) and knowledge regarding the Wintel Platform to projects and microworkorders. IT Specialist IBM November 2005  –  October 2006  (1 year) Amstelveen Participated in various projects at the ABN AMRO account as a system engineer and projectcoordinator. IT Specialist IBM November 2005  –  October 2006  (1 year) Amstelveen Participated in various projects at the ABN AMRO account as a system engineer and projectcoordinator. System Engineer ABN AMRO Bank N.V. November 2002  –  November 2005  (3 years 1 month) Amstelveen As an system engineer I have developed several Infrastructural components based on the MicroSoft Windows. \nAs an projectcoordinator I have participated several large Migration projects. System Engineer ABN AMRO Bank N.V. November 2002  –  November 2005  (3 years 1 month) Amstelveen As an system engineer I have developed several Infrastructural components based on the MicroSoft Windows. \nAs an projectcoordinator I have participated several large Migration projects. System Engineer ABN AMRO Bank N.V. August 2001  –  November 2002  (1 year 4 months) Amstelveen As a system engineer with the specialism ´Storage and Backup` I was responsible for : \n- creating technical solutions including costs reports. \n- defining technical standards. \n- defining concepts (e.g. Security concepts). \n- 3e and 4e Line support. \n- acceptance of new products. System Engineer ABN AMRO Bank N.V. August 2001  –  November 2002  (1 year 4 months) Amstelveen As a system engineer with the specialism ´Storage and Backup` I was responsible for : \n- creating technical solutions including costs reports. \n- defining technical standards. \n- defining concepts (e.g. Security concepts). \n- 3e and 4e Line support. \n- acceptance of new products. Lanmanager ABN AMRO Bank N.V. May 1999  –  July 2001  (2 years 3 months) Amstelveen Responsible for maintaining OS2 and Windows NT4 domains used by 1800 users. Lanmanager ABN AMRO Bank N.V. May 1999  –  July 2001  (2 years 3 months) Amstelveen Responsible for maintaining OS2 and Windows NT4 domains used by 1800 users. Skills IT Service Management Service Management Service Delivery ITIL IT Outsourcing IT Strategy Incident Management Sla Transition Management Data Center SQL IT Management Outsourcing Virtualization Process Management IT Operations PRINCE2 Service Desk Business Analysis Oracle VMware Databases Requirements Analysis Security Offshoring PMO Integration Project Delivery Windows See 14+     See less Skills  IT Service Management Service Management Service Delivery ITIL IT Outsourcing IT Strategy Incident Management Sla Transition Management Data Center SQL IT Management Outsourcing Virtualization Process Management IT Operations PRINCE2 Service Desk Business Analysis Oracle VMware Databases Requirements Analysis Security Offshoring PMO Integration Project Delivery Windows See 14+     See less IT Service Management Service Management Service Delivery ITIL IT Outsourcing IT Strategy Incident Management Sla Transition Management Data Center SQL IT Management Outsourcing Virtualization Process Management IT Operations PRINCE2 Service Desk Business Analysis Oracle VMware Databases Requirements Analysis Security Offshoring PMO Integration Project Delivery Windows See 14+     See less IT Service Management Service Management Service Delivery ITIL IT Outsourcing IT Strategy Incident Management Sla Transition Management Data Center SQL IT Management Outsourcing Virtualization Process Management IT Operations PRINCE2 Service Desk Business Analysis Oracle VMware Databases Requirements Analysis Security Offshoring PMO Integration Project Delivery Windows See 14+     See less Education Stichting HOBI (HEAO BI) Batchelor,  HEAO BI 2002  – 2009 Stichting HOBI (HEAO BI) Batchelor,  HEAO BI 2002  – 2009 Stichting HOBI (HEAO BI) Batchelor,  HEAO BI 2002  – 2009 Stichting HOBI (HEAO BI) Batchelor,  HEAO BI 2002  – 2009 ", "Summary I am an ITIL V3 EXPERT certified experienced Service Delivery Manager with a proven track record in leading & managing successful IBM Commercial accounts. I have established success in delivering challenging Process Engineering and Development whilst striving for Continual Service Improvement. A troubleshooter who is both logical and methodical with a proven ability to analyse, evaluate and present reasoned arguments in both written and oral form. An individual with highly developed organizational and planning skills, a keen eye for detail and able to handle pressure with ease and the ability to adapt and react positively to fast changing priorities. Predominately based on customer sites with a proven track record in building excellent customer relationships through having a strong Service attitude and constantly striving for efficiency and effectiveness.  \n \nSpecialties \nService Delivery, Continued Service Improvement, Service Level Management, Service Support, Change Management, Analysis, Problem Management, Incident Management, Summary I am an ITIL V3 EXPERT certified experienced Service Delivery Manager with a proven track record in leading & managing successful IBM Commercial accounts. I have established success in delivering challenging Process Engineering and Development whilst striving for Continual Service Improvement. A troubleshooter who is both logical and methodical with a proven ability to analyse, evaluate and present reasoned arguments in both written and oral form. An individual with highly developed organizational and planning skills, a keen eye for detail and able to handle pressure with ease and the ability to adapt and react positively to fast changing priorities. Predominately based on customer sites with a proven track record in building excellent customer relationships through having a strong Service attitude and constantly striving for efficiency and effectiveness.  \n \nSpecialties \nService Delivery, Continued Service Improvement, Service Level Management, Service Support, Change Management, Analysis, Problem Management, Incident Management, I am an ITIL V3 EXPERT certified experienced Service Delivery Manager with a proven track record in leading & managing successful IBM Commercial accounts. I have established success in delivering challenging Process Engineering and Development whilst striving for Continual Service Improvement. A troubleshooter who is both logical and methodical with a proven ability to analyse, evaluate and present reasoned arguments in both written and oral form. An individual with highly developed organizational and planning skills, a keen eye for detail and able to handle pressure with ease and the ability to adapt and react positively to fast changing priorities. Predominately based on customer sites with a proven track record in building excellent customer relationships through having a strong Service attitude and constantly striving for efficiency and effectiveness.  \n \nSpecialties \nService Delivery, Continued Service Improvement, Service Level Management, Service Support, Change Management, Analysis, Problem Management, Incident Management, I am an ITIL V3 EXPERT certified experienced Service Delivery Manager with a proven track record in leading & managing successful IBM Commercial accounts. I have established success in delivering challenging Process Engineering and Development whilst striving for Continual Service Improvement. A troubleshooter who is both logical and methodical with a proven ability to analyse, evaluate and present reasoned arguments in both written and oral form. An individual with highly developed organizational and planning skills, a keen eye for detail and able to handle pressure with ease and the ability to adapt and react positively to fast changing priorities. Predominately based on customer sites with a proven track record in building excellent customer relationships through having a strong Service attitude and constantly striving for efficiency and effectiveness.  \n \nSpecialties \nService Delivery, Continued Service Improvement, Service Level Management, Service Support, Change Management, Analysis, Problem Management, Incident Management, Experience Lead Service Delivery Manager IBM July 2013  – Present (2 years 2 months) Dublin Bank of Scotland (Lloyds) & Certus - Finance Industry: \n \nScope: As a member of the Account Senior Management team, I provide a holistic view of the customer’s environment and drive recommendations to improve overall customer service. \nI own the integrated Management system to ensure the key processes (Incident Management, Major Incident Management, Problem Management, Change Management, and Availability Management) are fully supporting the delivery of IT services inline with IBM commitments to the clients. \n \nIn support of this role, I task manage a team of Service managers, technical resource. and both the Security and Compliance teams on the accounts. Service Delivery Manager IBM August 2012  –  July 2013  (1 year) Dublin, Ireland ITIL Process Owner Transition & Transformation Manager IBM November 2010  –  August 2012  (1 year 10 months) Dublin IBM Transition & Transformation manager on the Bank of Scotland & Certus account. Service Delivery Manager IBM March 2008  –  November 2010  (2 years 9 months) Dublin Over all responsibility for the Management of the IBM Treasury Center, Dublin Service Delivery Manager IBM July 2005  –  March 2008  (2 years 9 months) Dublin SDM for a portfolio of Managed Service Accounts - Quinn Direct, C&C Ireland, HSE, BOI Life, Western Power Distribution (UK) Cisco Certified Network Engineer - CCNP IBM September 1998  –  January 2005  (6 years 5 months) Dublin Network Engineer responsible for the design and implementation of a varied number of infrastructure components - LAN, WAN, IP Telephony. Lead Service Delivery Manager IBM July 2013  – Present (2 years 2 months) Dublin Bank of Scotland (Lloyds) & Certus - Finance Industry: \n \nScope: As a member of the Account Senior Management team, I provide a holistic view of the customer’s environment and drive recommendations to improve overall customer service. \nI own the integrated Management system to ensure the key processes (Incident Management, Major Incident Management, Problem Management, Change Management, and Availability Management) are fully supporting the delivery of IT services inline with IBM commitments to the clients. \n \nIn support of this role, I task manage a team of Service managers, technical resource. and both the Security and Compliance teams on the accounts. Lead Service Delivery Manager IBM July 2013  – Present (2 years 2 months) Dublin Bank of Scotland (Lloyds) & Certus - Finance Industry: \n \nScope: As a member of the Account Senior Management team, I provide a holistic view of the customer’s environment and drive recommendations to improve overall customer service. \nI own the integrated Management system to ensure the key processes (Incident Management, Major Incident Management, Problem Management, Change Management, and Availability Management) are fully supporting the delivery of IT services inline with IBM commitments to the clients. \n \nIn support of this role, I task manage a team of Service managers, technical resource. and both the Security and Compliance teams on the accounts. Service Delivery Manager IBM August 2012  –  July 2013  (1 year) Dublin, Ireland ITIL Process Owner Service Delivery Manager IBM August 2012  –  July 2013  (1 year) Dublin, Ireland ITIL Process Owner Transition & Transformation Manager IBM November 2010  –  August 2012  (1 year 10 months) Dublin IBM Transition & Transformation manager on the Bank of Scotland & Certus account. Transition & Transformation Manager IBM November 2010  –  August 2012  (1 year 10 months) Dublin IBM Transition & Transformation manager on the Bank of Scotland & Certus account. Service Delivery Manager IBM March 2008  –  November 2010  (2 years 9 months) Dublin Over all responsibility for the Management of the IBM Treasury Center, Dublin Service Delivery Manager IBM March 2008  –  November 2010  (2 years 9 months) Dublin Over all responsibility for the Management of the IBM Treasury Center, Dublin Service Delivery Manager IBM July 2005  –  March 2008  (2 years 9 months) Dublin SDM for a portfolio of Managed Service Accounts - Quinn Direct, C&C Ireland, HSE, BOI Life, Western Power Distribution (UK) Service Delivery Manager IBM July 2005  –  March 2008  (2 years 9 months) Dublin SDM for a portfolio of Managed Service Accounts - Quinn Direct, C&C Ireland, HSE, BOI Life, Western Power Distribution (UK) Cisco Certified Network Engineer - CCNP IBM September 1998  –  January 2005  (6 years 5 months) Dublin Network Engineer responsible for the design and implementation of a varied number of infrastructure components - LAN, WAN, IP Telephony. Cisco Certified Network Engineer - CCNP IBM September 1998  –  January 2005  (6 years 5 months) Dublin Network Engineer responsible for the design and implementation of a varied number of infrastructure components - LAN, WAN, IP Telephony. Skills IT Service Management Service Delivery Incident Management Service Management Service Improvement ITIL Stakeholder Management Change Management IT Operations IT Outsourcing IT Management Sla Problem Management ITIL Certified Managed Services IT Strategy SLA See 2+     See less Skills  IT Service Management Service Delivery Incident Management Service Management Service Improvement ITIL Stakeholder Management Change Management IT Operations IT Outsourcing IT Management Sla Problem Management ITIL Certified Managed Services IT Strategy SLA See 2+     See less IT Service Management Service Delivery Incident Management Service Management Service Improvement ITIL Stakeholder Management Change Management IT Operations IT Outsourcing IT Management Sla Problem Management ITIL Certified Managed Services IT Strategy SLA See 2+     See less IT Service Management Service Delivery Incident Management Service Management Service Improvement ITIL Stakeholder Management Change Management IT Operations IT Outsourcing IT Management Sla Problem Management ITIL Certified Managed Services IT Strategy SLA See 2+     See less ", "Experience Service Delivery Manager IBM April 2014  – Present (1 year 5 months) Account in Hartford, CT Global Service Delivery Manager IBM November 2011  –  March 2014  (2 years 5 months) Princeton, NJ Service Delivery Manager IBM July 2010  –  November 2011  (1 year 5 months) Delivery Manager IBM September 2007  –  November 2010  (3 years 3 months) Deskside Team Lead IBM January 1995  –  September 2007  (12 years 9 months) Technical Asst PECO Energy 1976  –  1994  (18 years) Service Delivery Manager IBM April 2014  – Present (1 year 5 months) Account in Hartford, CT Service Delivery Manager IBM April 2014  – Present (1 year 5 months) Account in Hartford, CT Global Service Delivery Manager IBM November 2011  –  March 2014  (2 years 5 months) Princeton, NJ Global Service Delivery Manager IBM November 2011  –  March 2014  (2 years 5 months) Princeton, NJ Service Delivery Manager IBM July 2010  –  November 2011  (1 year 5 months) Service Delivery Manager IBM July 2010  –  November 2011  (1 year 5 months) Delivery Manager IBM September 2007  –  November 2010  (3 years 3 months) Delivery Manager IBM September 2007  –  November 2010  (3 years 3 months) Deskside Team Lead IBM January 1995  –  September 2007  (12 years 9 months) Deskside Team Lead IBM January 1995  –  September 2007  (12 years 9 months) Technical Asst PECO Energy 1976  –  1994  (18 years) Technical Asst PECO Energy 1976  –  1994  (18 years) Skills Service Delivery IT Service Management Global Delivery IT Operations Sla IT Outsourcing Windows Server Program Management IT Management Service Management ITIL IT Strategy Solution Architecture Disaster Recovery Outsourcing PMO Project Portfolio... PMP Vendor Management Data Center Enterprise Architecture Resource Management SLA See 8+     See less Skills  Service Delivery IT Service Management Global Delivery IT Operations Sla IT Outsourcing Windows Server Program Management IT Management Service Management ITIL IT Strategy Solution Architecture Disaster Recovery Outsourcing PMO Project Portfolio... PMP Vendor Management Data Center Enterprise Architecture Resource Management SLA See 8+     See less Service Delivery IT Service Management Global Delivery IT Operations Sla IT Outsourcing Windows Server Program Management IT Management Service Management ITIL IT Strategy Solution Architecture Disaster Recovery Outsourcing PMO Project Portfolio... PMP Vendor Management Data Center Enterprise Architecture Resource Management SLA See 8+     See less Service Delivery IT Service Management Global Delivery IT Operations Sla IT Outsourcing Windows Server Program Management IT Management Service Management ITIL IT Strategy Solution Architecture Disaster Recovery Outsourcing PMO Project Portfolio... PMP Vendor Management Data Center Enterprise Architecture Resource Management SLA See 8+     See less "]}