{"position": "Demand Analyst", "company": "Intel Corporation", "profiles": ["Experience Supply Demand Analyst Intel Corporation January 1996  – Present (19 years 8 months) Buyer/Planner Three-Five Systems Inc. October 1993  –  January 1996  (2 years 4 months) Tempe, AZ Supply Demand Analyst Intel Corporation January 1996  – Present (19 years 8 months) Supply Demand Analyst Intel Corporation January 1996  – Present (19 years 8 months) Buyer/Planner Three-Five Systems Inc. October 1993  –  January 1996  (2 years 4 months) Tempe, AZ Buyer/Planner Three-Five Systems Inc. October 1993  –  January 1996  (2 years 4 months) Tempe, AZ Skills Top Skills 6 Semiconductors 3 Lean Manufacturing 3 Process Improvement 2 Supply Chain Management 2 Supply Management 1 SPC 1 Manufacturing 1 Cross-functional Team... 1 Six Sigma 1 Process Engineering Thompson, also knows about... 1 MRP 1 Strategic Planning Skills  Top Skills 6 Semiconductors 3 Lean Manufacturing 3 Process Improvement 2 Supply Chain Management 2 Supply Management 1 SPC 1 Manufacturing 1 Cross-functional Team... 1 Six Sigma 1 Process Engineering Thompson, also knows about... 1 MRP 1 Strategic Planning Top Skills 6 Semiconductors 3 Lean Manufacturing 3 Process Improvement 2 Supply Chain Management 2 Supply Management 1 SPC 1 Manufacturing 1 Cross-functional Team... 1 Six Sigma 1 Process Engineering Thompson, also knows about... 1 MRP 1 Strategic Planning Top Skills 6 Semiconductors 3 Lean Manufacturing 3 Process Improvement 2 Supply Chain Management 2 Supply Management 1 SPC 1 Manufacturing 1 Cross-functional Team... 1 Six Sigma 1 Process Engineering Thompson, also knows about... 1 MRP 1 Strategic Planning                     1 MRP 1 Strategic Planning ", "Summary Marketing and supply chain professional with experience supporting factory production and corporate platform strategies through marketing, purchasing, Commodity Management and planning functions.  \n \nSpecialties: Market research/intelligence, pricing, forecasting, purchasing, contract negotiations, product sourcing and managing relationships with key vendors. Summary Marketing and supply chain professional with experience supporting factory production and corporate platform strategies through marketing, purchasing, Commodity Management and planning functions.  \n \nSpecialties: Market research/intelligence, pricing, forecasting, purchasing, contract negotiations, product sourcing and managing relationships with key vendors. Marketing and supply chain professional with experience supporting factory production and corporate platform strategies through marketing, purchasing, Commodity Management and planning functions.  \n \nSpecialties: Market research/intelligence, pricing, forecasting, purchasing, contract negotiations, product sourcing and managing relationships with key vendors. Marketing and supply chain professional with experience supporting factory production and corporate platform strategies through marketing, purchasing, Commodity Management and planning functions.  \n \nSpecialties: Market research/intelligence, pricing, forecasting, purchasing, contract negotiations, product sourcing and managing relationships with key vendors. Experience Server Pricing Manager Intel Corporation August 2013  – Present (2 years 1 month) Responsible for developing and maintaining our price strategy on the Xeon E5 platform and Xeon Phi product family. Ownership of High Performance Computing, Workstation and mainstream enterprise market segment price strategies which include supporting TAM expansion, ASP management, and platform share of wallet roadmap strategies. Server Demand Analyst Intel Corporation March 2011  –  August 2013  (2 years 6 months) Contribute to setting and executing to Intel's product platform strategy. Responsible for accurate forecasting of Intel's global server processor demand to ensure optimized servicing of our customer's needs and appropriate guidance to the investor community. Material Planning Analyst Intel Corporation August 2008  –  March 2011  (2 years 8 months) Bridging the gap between corporate level product demand and individual materials demand (specializing in chemicals) at our several manufacturing facilities through building dynamic forecasting models and serving as a resource/consultant to Intel Materials groups. Commodity Specialist Intel Corporation May 2005  –  August 2008  (3 years 4 months) •Procurement and supply line management of direct process materials supporting all Oregon wafer manufacturing facilities with annual spends exceeding $35m. Initiate and support cost optimization activities through to qualification and implementation (alternate/direct sourcing, inventory reductions, consumption reduction initiatives)  \n•Supplier owner for emerging chemical supplier. Manage supplier cost roadmap, facilitate new product introductions, perform supply line risk assessments, resolve legal disputes and craft contract language. \n•Contract owner for $25M global water treatment vendor. This contract services all of Intel’s international and domestic locations. Server Pricing Manager Intel Corporation August 2013  – Present (2 years 1 month) Responsible for developing and maintaining our price strategy on the Xeon E5 platform and Xeon Phi product family. Ownership of High Performance Computing, Workstation and mainstream enterprise market segment price strategies which include supporting TAM expansion, ASP management, and platform share of wallet roadmap strategies. Server Pricing Manager Intel Corporation August 2013  – Present (2 years 1 month) Responsible for developing and maintaining our price strategy on the Xeon E5 platform and Xeon Phi product family. Ownership of High Performance Computing, Workstation and mainstream enterprise market segment price strategies which include supporting TAM expansion, ASP management, and platform share of wallet roadmap strategies. Server Demand Analyst Intel Corporation March 2011  –  August 2013  (2 years 6 months) Contribute to setting and executing to Intel's product platform strategy. Responsible for accurate forecasting of Intel's global server processor demand to ensure optimized servicing of our customer's needs and appropriate guidance to the investor community. Server Demand Analyst Intel Corporation March 2011  –  August 2013  (2 years 6 months) Contribute to setting and executing to Intel's product platform strategy. Responsible for accurate forecasting of Intel's global server processor demand to ensure optimized servicing of our customer's needs and appropriate guidance to the investor community. Material Planning Analyst Intel Corporation August 2008  –  March 2011  (2 years 8 months) Bridging the gap between corporate level product demand and individual materials demand (specializing in chemicals) at our several manufacturing facilities through building dynamic forecasting models and serving as a resource/consultant to Intel Materials groups. Material Planning Analyst Intel Corporation August 2008  –  March 2011  (2 years 8 months) Bridging the gap between corporate level product demand and individual materials demand (specializing in chemicals) at our several manufacturing facilities through building dynamic forecasting models and serving as a resource/consultant to Intel Materials groups. Commodity Specialist Intel Corporation May 2005  –  August 2008  (3 years 4 months) •Procurement and supply line management of direct process materials supporting all Oregon wafer manufacturing facilities with annual spends exceeding $35m. Initiate and support cost optimization activities through to qualification and implementation (alternate/direct sourcing, inventory reductions, consumption reduction initiatives)  \n•Supplier owner for emerging chemical supplier. Manage supplier cost roadmap, facilitate new product introductions, perform supply line risk assessments, resolve legal disputes and craft contract language. \n•Contract owner for $25M global water treatment vendor. This contract services all of Intel’s international and domestic locations. Commodity Specialist Intel Corporation May 2005  –  August 2008  (3 years 4 months) •Procurement and supply line management of direct process materials supporting all Oregon wafer manufacturing facilities with annual spends exceeding $35m. Initiate and support cost optimization activities through to qualification and implementation (alternate/direct sourcing, inventory reductions, consumption reduction initiatives)  \n•Supplier owner for emerging chemical supplier. Manage supplier cost roadmap, facilitate new product introductions, perform supply line risk assessments, resolve legal disputes and craft contract language. \n•Contract owner for $25M global water treatment vendor. This contract services all of Intel’s international and domestic locations. Skills Top Skills 8 Supply Chain 7 Forecasting 6 Supply Management 6 Management 5 Procurement 4 Strategy 4 Purchasing 3 Supply Chain Management 2 Contract Negotiation 2 Manufacturing David also knows about... 1 Program Management 1 MRP 1 Sourcing 1 Customer Service 1 Inventory Management 1 Cross-functional Team... 1 SAP 1 Continuous Improvement 1 Materials Management 1 Marketing 1 Global Sourcing 1 Lean Manufacturing 1 Strategic Sourcing 1 Product Development 1 Process Improvement Skills  Top Skills 8 Supply Chain 7 Forecasting 6 Supply Management 6 Management 5 Procurement 4 Strategy 4 Purchasing 3 Supply Chain Management 2 Contract Negotiation 2 Manufacturing David also knows about... 1 Program Management 1 MRP 1 Sourcing 1 Customer Service 1 Inventory Management 1 Cross-functional Team... 1 SAP 1 Continuous Improvement 1 Materials Management 1 Marketing 1 Global Sourcing 1 Lean Manufacturing 1 Strategic Sourcing 1 Product Development 1 Process Improvement Top Skills 8 Supply Chain 7 Forecasting 6 Supply Management 6 Management 5 Procurement 4 Strategy 4 Purchasing 3 Supply Chain Management 2 Contract Negotiation 2 Manufacturing David also knows about... 1 Program Management 1 MRP 1 Sourcing 1 Customer Service 1 Inventory Management 1 Cross-functional Team... 1 SAP 1 Continuous Improvement 1 Materials Management 1 Marketing 1 Global Sourcing 1 Lean Manufacturing 1 Strategic Sourcing 1 Product Development 1 Process Improvement Top Skills 8 Supply Chain 7 Forecasting 6 Supply Management 6 Management 5 Procurement 4 Strategy 4 Purchasing 3 Supply Chain Management 2 Contract Negotiation 2 Manufacturing David also knows about... 1 Program Management 1 MRP 1 Sourcing 1 Customer Service 1 Inventory Management 1 Cross-functional Team... 1 SAP 1 Continuous Improvement 1 Materials Management 1 Marketing 1 Global Sourcing 1 Lean Manufacturing 1 Strategic Sourcing 1 Product Development 1 Process Improvement                     1 Program Management 1 MRP 1 Sourcing 1 Customer Service 1 Inventory Management 1 Cross-functional Team... 1 SAP 1 Continuous Improvement 1 Materials Management 1 Marketing 1 Global Sourcing 1 Lean Manufacturing 1 Strategic Sourcing 1 Product Development 1 Process Improvement Education Portland State University - School of Business MBA 2007  – 2010 Graduated with Honors. Courses of particular interest included New Product Development, Business Strategy, Strategic M&A, Business Valuation, Marketing Research, Cost Accounting and Strategic Cost Management. Activities and Societies:  Beta Gamma Sigma Whitworth University Bachelor of Arts,  Business Management and Marketing 2002  – 2005 Graduated with Honors. Activities and Societies:  Financial VP ,  Associated Students of Whitworth College Oregon State University Business 2001  – 2002 Portland State University - School of Business MBA 2007  – 2010 Graduated with Honors. Courses of particular interest included New Product Development, Business Strategy, Strategic M&A, Business Valuation, Marketing Research, Cost Accounting and Strategic Cost Management. Activities and Societies:  Beta Gamma Sigma Portland State University - School of Business MBA 2007  – 2010 Graduated with Honors. Courses of particular interest included New Product Development, Business Strategy, Strategic M&A, Business Valuation, Marketing Research, Cost Accounting and Strategic Cost Management. Activities and Societies:  Beta Gamma Sigma Portland State University - School of Business MBA 2007  – 2010 Graduated with Honors. Courses of particular interest included New Product Development, Business Strategy, Strategic M&A, Business Valuation, Marketing Research, Cost Accounting and Strategic Cost Management. Activities and Societies:  Beta Gamma Sigma Whitworth University Bachelor of Arts,  Business Management and Marketing 2002  – 2005 Graduated with Honors. Activities and Societies:  Financial VP ,  Associated Students of Whitworth College Whitworth University Bachelor of Arts,  Business Management and Marketing 2002  – 2005 Graduated with Honors. Activities and Societies:  Financial VP ,  Associated Students of Whitworth College Whitworth University Bachelor of Arts,  Business Management and Marketing 2002  – 2005 Graduated with Honors. Activities and Societies:  Financial VP ,  Associated Students of Whitworth College Oregon State University Business 2001  – 2002 Oregon State University Business 2001  – 2002 Oregon State University Business 2001  – 2002 ", "Summary Results oriented business analyst with over 17 years of experience in a Fortune 500 technology company with experience in supply chain management, demand forecasting, process improvement, business systems/tools development, project management, and capacity planning. Strong work ethic, fast learner, results-oriented and a good team player Summary Results oriented business analyst with over 17 years of experience in a Fortune 500 technology company with experience in supply chain management, demand forecasting, process improvement, business systems/tools development, project management, and capacity planning. Strong work ethic, fast learner, results-oriented and a good team player Results oriented business analyst with over 17 years of experience in a Fortune 500 technology company with experience in supply chain management, demand forecasting, process improvement, business systems/tools development, project management, and capacity planning. Strong work ethic, fast learner, results-oriented and a good team player Results oriented business analyst with over 17 years of experience in a Fortune 500 technology company with experience in supply chain management, demand forecasting, process improvement, business systems/tools development, project management, and capacity planning. Strong work ethic, fast learner, results-oriented and a good team player Experience Worldwide Demand Forecast Lead Intel August 2012  –  July 2015  (3 years) Santa Clara, CA •\tMicroprocessor Marketing and Business Planning (MMBP), Supply Demand Operations (SDO) group key lead and facilitator for several demand and consumption related processes by working with large number of analysts across HQ and geo teams to ensure all benchmarks and timings are met for multiple stakeholders. \n•\tResponsible for analyzing PC segments relevant to Intel Product lines to improve Intel’s monthly demand forecast, manufacturing build plan, financial plan, and/or roadmap and pricing strategies \n•\tDeliver presentation to management summarizing key findings, conclusions, and recommendations for demand and consumption processes Senior Demand Analyst Intel Corporation August 2008  –  August 2012  (4 years 1 month) Santa Clara, CA •\tResponsible for setting total consumption market size and market segment share for desktop products \n•\tPresented various market indicator analyses to management on summarizing findings, conclusions, and recommendations of demand strategies \n•\tCreated demand forecast scenarios to support potential marketing initiatives and other drivers of supply & demand variability Supply Demand Alignment Analyst Intel Corporation October 2004  –  July 2008  (3 years 10 months) Santa Clara, CA •\tLed monthly supply demand alignment/reset activities for Intel’s multi-billion dollar CPU business \n•\tInteracted with variety of business partners including wafer manufacturing network, marketing, product planning, assembly and test manufacturing, capacity planning, and finance to set build strategies for the monthly build plan activities \n•\tA key contributor in successful development and implementation of an improved simplified build plan solver which addressed three breakpoints of the old application and business processes \n•\tPerformed what-if analysis on demand and factory parameter changes scenarios for the build plan \n•\tManaged finished goods build plan to ensure meeting customer commits/backlogs Software Engineer/System Analyst Intel September 2000  –  October 2004  (4 years 2 months) Santa Clara, CA •\tSupported manufacturing software application to ensure material tracking according to engineering specification \n•\tLed/chaired weekly automation change control board meeting. Developed organization’s Automation Change Control Board process and documents  \n•\tWorked with customers from various groups to development requirement documents for generating various reports. \n•\tWrote test plans for decision support system reports \n•\tSupported Business Objects Crystal Reports and Crystal Enterprise Industrial Enginner Intel January 1998  –  August 2000  (2 years 8 months) Santa Clara, CA •\tDeveloped and improved labor and equipment capacity models to aid in manufacturing efficiency and capital purchase decisions \n•\tChaired equipment installation teams responsible for ensuring safe, on time, and quality installations by tracking installation progress, leading installation meetings, and resolving installation issues with stakeholders \n•\tDesigned equipment layouts for new tool installations Install/Qual Industrial Engineer Intel Corporation June 1997  –  September 1997  (4 months) Santa Clara, CA •Designed and maintained an inventory management system to track all on hand equipment \n•Analyzed WIP rack requirement for the high volume wafer manufacturing fab \n•Studied the proper labeling of the global trash cans in the fab. Ordered correct labels Quality Assurance Co-op Engineer Rheem Manufacturing 1994  –  1996  (2 years) Milledgeville, GA •Performed process capability (CPK) studies and Failure Mode and Effect Analysis (FMEA) on various production processes \n•Assisted in revision changes for controlled documents for ISO9000 audits \n•Developed database in dBASE III for controlled documents \n•Performed various internal audits in preparation for ISO9000 audits Worldwide Demand Forecast Lead Intel August 2012  –  July 2015  (3 years) Santa Clara, CA •\tMicroprocessor Marketing and Business Planning (MMBP), Supply Demand Operations (SDO) group key lead and facilitator for several demand and consumption related processes by working with large number of analysts across HQ and geo teams to ensure all benchmarks and timings are met for multiple stakeholders. \n•\tResponsible for analyzing PC segments relevant to Intel Product lines to improve Intel’s monthly demand forecast, manufacturing build plan, financial plan, and/or roadmap and pricing strategies \n•\tDeliver presentation to management summarizing key findings, conclusions, and recommendations for demand and consumption processes Worldwide Demand Forecast Lead Intel August 2012  –  July 2015  (3 years) Santa Clara, CA •\tMicroprocessor Marketing and Business Planning (MMBP), Supply Demand Operations (SDO) group key lead and facilitator for several demand and consumption related processes by working with large number of analysts across HQ and geo teams to ensure all benchmarks and timings are met for multiple stakeholders. \n•\tResponsible for analyzing PC segments relevant to Intel Product lines to improve Intel’s monthly demand forecast, manufacturing build plan, financial plan, and/or roadmap and pricing strategies \n•\tDeliver presentation to management summarizing key findings, conclusions, and recommendations for demand and consumption processes Senior Demand Analyst Intel Corporation August 2008  –  August 2012  (4 years 1 month) Santa Clara, CA •\tResponsible for setting total consumption market size and market segment share for desktop products \n•\tPresented various market indicator analyses to management on summarizing findings, conclusions, and recommendations of demand strategies \n•\tCreated demand forecast scenarios to support potential marketing initiatives and other drivers of supply & demand variability Senior Demand Analyst Intel Corporation August 2008  –  August 2012  (4 years 1 month) Santa Clara, CA •\tResponsible for setting total consumption market size and market segment share for desktop products \n•\tPresented various market indicator analyses to management on summarizing findings, conclusions, and recommendations of demand strategies \n•\tCreated demand forecast scenarios to support potential marketing initiatives and other drivers of supply & demand variability Supply Demand Alignment Analyst Intel Corporation October 2004  –  July 2008  (3 years 10 months) Santa Clara, CA •\tLed monthly supply demand alignment/reset activities for Intel’s multi-billion dollar CPU business \n•\tInteracted with variety of business partners including wafer manufacturing network, marketing, product planning, assembly and test manufacturing, capacity planning, and finance to set build strategies for the monthly build plan activities \n•\tA key contributor in successful development and implementation of an improved simplified build plan solver which addressed three breakpoints of the old application and business processes \n•\tPerformed what-if analysis on demand and factory parameter changes scenarios for the build plan \n•\tManaged finished goods build plan to ensure meeting customer commits/backlogs Supply Demand Alignment Analyst Intel Corporation October 2004  –  July 2008  (3 years 10 months) Santa Clara, CA •\tLed monthly supply demand alignment/reset activities for Intel’s multi-billion dollar CPU business \n•\tInteracted with variety of business partners including wafer manufacturing network, marketing, product planning, assembly and test manufacturing, capacity planning, and finance to set build strategies for the monthly build plan activities \n•\tA key contributor in successful development and implementation of an improved simplified build plan solver which addressed three breakpoints of the old application and business processes \n•\tPerformed what-if analysis on demand and factory parameter changes scenarios for the build plan \n•\tManaged finished goods build plan to ensure meeting customer commits/backlogs Software Engineer/System Analyst Intel September 2000  –  October 2004  (4 years 2 months) Santa Clara, CA •\tSupported manufacturing software application to ensure material tracking according to engineering specification \n•\tLed/chaired weekly automation change control board meeting. Developed organization’s Automation Change Control Board process and documents  \n•\tWorked with customers from various groups to development requirement documents for generating various reports. \n•\tWrote test plans for decision support system reports \n•\tSupported Business Objects Crystal Reports and Crystal Enterprise Software Engineer/System Analyst Intel September 2000  –  October 2004  (4 years 2 months) Santa Clara, CA •\tSupported manufacturing software application to ensure material tracking according to engineering specification \n•\tLed/chaired weekly automation change control board meeting. Developed organization’s Automation Change Control Board process and documents  \n•\tWorked with customers from various groups to development requirement documents for generating various reports. \n•\tWrote test plans for decision support system reports \n•\tSupported Business Objects Crystal Reports and Crystal Enterprise Industrial Enginner Intel January 1998  –  August 2000  (2 years 8 months) Santa Clara, CA •\tDeveloped and improved labor and equipment capacity models to aid in manufacturing efficiency and capital purchase decisions \n•\tChaired equipment installation teams responsible for ensuring safe, on time, and quality installations by tracking installation progress, leading installation meetings, and resolving installation issues with stakeholders \n•\tDesigned equipment layouts for new tool installations Industrial Enginner Intel January 1998  –  August 2000  (2 years 8 months) Santa Clara, CA •\tDeveloped and improved labor and equipment capacity models to aid in manufacturing efficiency and capital purchase decisions \n•\tChaired equipment installation teams responsible for ensuring safe, on time, and quality installations by tracking installation progress, leading installation meetings, and resolving installation issues with stakeholders \n•\tDesigned equipment layouts for new tool installations Install/Qual Industrial Engineer Intel Corporation June 1997  –  September 1997  (4 months) Santa Clara, CA •Designed and maintained an inventory management system to track all on hand equipment \n•Analyzed WIP rack requirement for the high volume wafer manufacturing fab \n•Studied the proper labeling of the global trash cans in the fab. Ordered correct labels Install/Qual Industrial Engineer Intel Corporation June 1997  –  September 1997  (4 months) Santa Clara, CA •Designed and maintained an inventory management system to track all on hand equipment \n•Analyzed WIP rack requirement for the high volume wafer manufacturing fab \n•Studied the proper labeling of the global trash cans in the fab. Ordered correct labels Quality Assurance Co-op Engineer Rheem Manufacturing 1994  –  1996  (2 years) Milledgeville, GA •Performed process capability (CPK) studies and Failure Mode and Effect Analysis (FMEA) on various production processes \n•Assisted in revision changes for controlled documents for ISO9000 audits \n•Developed database in dBASE III for controlled documents \n•Performed various internal audits in preparation for ISO9000 audits Quality Assurance Co-op Engineer Rheem Manufacturing 1994  –  1996  (2 years) Milledgeville, GA •Performed process capability (CPK) studies and Failure Mode and Effect Analysis (FMEA) on various production processes \n•Assisted in revision changes for controlled documents for ISO9000 audits \n•Developed database in dBASE III for controlled documents \n•Performed various internal audits in preparation for ISO9000 audits Languages Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 8 Cross-functional Team... 5 Supply Chain Management 4 Management 1 Processors 0 Project Management Lily Jin also knows about... 0 Analysis 0 Project Planning 0 Product Management 0 Competitive Analysis 0 Semiconductors 0 Industrial Engineering 0 Strategy 0 Market Analysis 0 Program Management 0 Intel 0 Process Engineering 0 Data Analysis 0 Forecasting 0 Process Improvement Skills  Top Skills 8 Cross-functional Team... 5 Supply Chain Management 4 Management 1 Processors 0 Project Management Lily Jin also knows about... 0 Analysis 0 Project Planning 0 Product Management 0 Competitive Analysis 0 Semiconductors 0 Industrial Engineering 0 Strategy 0 Market Analysis 0 Program Management 0 Intel 0 Process Engineering 0 Data Analysis 0 Forecasting 0 Process Improvement Top Skills 8 Cross-functional Team... 5 Supply Chain Management 4 Management 1 Processors 0 Project Management Lily Jin also knows about... 0 Analysis 0 Project Planning 0 Product Management 0 Competitive Analysis 0 Semiconductors 0 Industrial Engineering 0 Strategy 0 Market Analysis 0 Program Management 0 Intel 0 Process Engineering 0 Data Analysis 0 Forecasting 0 Process Improvement Top Skills 8 Cross-functional Team... 5 Supply Chain Management 4 Management 1 Processors 0 Project Management Lily Jin also knows about... 0 Analysis 0 Project Planning 0 Product Management 0 Competitive Analysis 0 Semiconductors 0 Industrial Engineering 0 Strategy 0 Market Analysis 0 Program Management 0 Intel 0 Process Engineering 0 Data Analysis 0 Forecasting 0 Process Improvement           0 Analysis 0 Project Planning 0 Product Management 0 Competitive Analysis 0 Semiconductors 0 Industrial Engineering 0 Strategy 0 Market Analysis 0 Program Management 0 Intel 0 Process Engineering 0 Data Analysis 0 Forecasting 0 Process Improvement Education Georgia Institute of Technology Bachelor of Science (BS),  Industrial Engineering 1993  – 1997 Georgia Institute of Technology Bachelor of Science (BS),  Industrial Engineering 1993  – 1997 Georgia Institute of Technology Bachelor of Science (BS),  Industrial Engineering 1993  – 1997 Georgia Institute of Technology Bachelor of Science (BS),  Industrial Engineering 1993  – 1997 ", "Summary Project Manager/Business Analyst with significant software development and business process improvement experience supporting multiple business units within an organization. Operates as leader and member of project teams charged with achieving specific high impact results within a critical time period. Specialties:Project Management, Software Development Lifecycle, Agile (eXtreme Programming), Business Process Improvement, Data Quality, Managing People and Teams, Training Summary Project Manager/Business Analyst with significant software development and business process improvement experience supporting multiple business units within an organization. Operates as leader and member of project teams charged with achieving specific high impact results within a critical time period. Specialties:Project Management, Software Development Lifecycle, Agile (eXtreme Programming), Business Process Improvement, Data Quality, Managing People and Teams, Training Project Manager/Business Analyst with significant software development and business process improvement experience supporting multiple business units within an organization. Operates as leader and member of project teams charged with achieving specific high impact results within a critical time period. Specialties:Project Management, Software Development Lifecycle, Agile (eXtreme Programming), Business Process Improvement, Data Quality, Managing People and Teams, Training Project Manager/Business Analyst with significant software development and business process improvement experience supporting multiple business units within an organization. Operates as leader and member of project teams charged with achieving specific high impact results within a critical time period. Specialties:Project Management, Software Development Lifecycle, Agile (eXtreme Programming), Business Process Improvement, Data Quality, Managing People and Teams, Training Experience Project Manager CEBOS March 2015  –  July 2015  (5 months) Associate Manager, Global IT Stryker Sustainability Solutions August 2010  –  March 2015  (4 years 8 months) Tempe, AZ • Implemented new functionality and enhancements to sales order generation software package. This increased ability to better service customers and manage sales orders. \n• Implemented RFgen cycle count and sales order pick scanning modules to improve efficiency of warehouse operations. Information Technology (IT) Director Children's Service Center July 2007  –  July 2010  (3 years 1 month) • Managed $550,000 IT budget and department staff; report directly to the CEO.  \n• Initiated and managed implementation of Windows Domain Infrastructure. Enabled centralized management of software deployment and support for over 500 users and 250 computers. \n• Created system to close gaps in billing process to capture over $400,000 of incremental annual revenue. \n• Implemented remote user access across three business units eliminating all paper documentation. Increased productivity by over 20% and reduced billing cycle time by over 40%. \n• Led team of seven clinicians charged with implementing Electronic Medical Record (EMR) to replace paperwork and streamline 19 agency workflows to improve patient care. Project Manager Infotech Consulting September 2006  –  June 2007  (10 months) • Put strategies into action to streamline operations across the organization. Drove 30% reduction in annual paper consumption, cut printer operation time by 25%, and delivered additional savings of $145,000. \n• Member of project team assigned to streamline monthly and annual financial statements. Documented 'as-is' infrastructure including business processes and associated systems. Identified five obsolete data feeds. \n• Led Role Based Access Control project to determined system access needs. Resulted in elimination of 25 user roles and streamlined user access setup. Project Manager/Business Analyst Intel Corporation November 2004  –  August 2006  (1 year 10 months) •\tLed team of 6 developers and 1 business analyst to successful implementation of Wafer Start Per Week (WSPW) tool, while maintaining legacy system, resulting in quarterly savings of 3600 mouse clicks and 225 hours of productivity gains.  \n•\tLed team of 5 software engineers who developed and sustained 4 applications focused on commodity spending and cost consumption. \n•\tFacilitated customer user group of 7 super users representing 10 Intel factories and 4 corporate groups to gather and prioritize requirements using the XP Methodology.  \n•\tProvided sustaining support, including troubleshooting issues and training, to a customer base of 1200 users and 15 down stream applications. \n•\tSet long term strategic direction by identifying gaps between customer business needs and current application functionality. (Open) 3 recommendations, including: Maria Quartarone (Bui) Systems Analyst at Intel I was a peer project manager/business analyst of Paul's. Paul managed a project team consisting of 3-5 developers and... View Jay Turpin Agile Software Developer at Intel Corporation I worked with Paul for about a year on a software development project. I was the lead developer on the team and he was the... View 1 more recommendation Supply Demand Analyst Intel Corporation January 2003  –  November 2004  (1 year 11 months) •\tLed team of 2 engineers and 3 analysts in monthly process to align wafer starts to demand across multiple factories and products. \n•\tIncreased data quality by 70% by improving quality of database housing Intel product mapping structure through validation queries.  \n•\tDeveloped and standardized business rules for model input from 30 product planners to ensure quality output from planning application. Project Manager/Business Analyst Intel Corporation July 2001  –  January 2003  (1 year 7 months) •\tLed project team of 4 developers and 2 business analysts that developed an OPL ILOG based software application to create monthly factory build plans. \n•\tDeveloped and administered training packages to approximately 25 product planners, resulting in the successful, on-time, implementation of the software. \n•\tOwned approximately 15 data integrity issues, conducted root cause analyses, defined standards for the software model’s source data, and drove resolution with data source systems, resulting in increased accuracy of model output. Project Manager/Business Analyst Motorola July 1996  –  July 2001  (5 years 1 month) •\tLed project team responsible for implementation of Order Management module of SAP that identified 7 legacy systems for retirement to SAP conversion, resulting in annual projected savings of $5 Million. \n•\tDeveloped, updated and presented business process training material to 30 buyers resulting in on-time SAP implementation. \n•\tManaged all direct materials for PRISM assembly and test facility and supervised 4 Material Handling Employees; communicated with engineering and quality teams on performance issues. \n•\tIncreased PRISM assembly and test facility on-time delivery of finished goods from 70% to 95% and increased average yield of finished goods from 72% to over 92%. Inventory Analyst Nabisco 1995  –  1995  (less than a year) Project Manager CEBOS March 2015  –  July 2015  (5 months) Project Manager CEBOS March 2015  –  July 2015  (5 months) Associate Manager, Global IT Stryker Sustainability Solutions August 2010  –  March 2015  (4 years 8 months) Tempe, AZ • Implemented new functionality and enhancements to sales order generation software package. This increased ability to better service customers and manage sales orders. \n• Implemented RFgen cycle count and sales order pick scanning modules to improve efficiency of warehouse operations. Associate Manager, Global IT Stryker Sustainability Solutions August 2010  –  March 2015  (4 years 8 months) Tempe, AZ • Implemented new functionality and enhancements to sales order generation software package. This increased ability to better service customers and manage sales orders. \n• Implemented RFgen cycle count and sales order pick scanning modules to improve efficiency of warehouse operations. Information Technology (IT) Director Children's Service Center July 2007  –  July 2010  (3 years 1 month) • Managed $550,000 IT budget and department staff; report directly to the CEO.  \n• Initiated and managed implementation of Windows Domain Infrastructure. Enabled centralized management of software deployment and support for over 500 users and 250 computers. \n• Created system to close gaps in billing process to capture over $400,000 of incremental annual revenue. \n• Implemented remote user access across three business units eliminating all paper documentation. Increased productivity by over 20% and reduced billing cycle time by over 40%. \n• Led team of seven clinicians charged with implementing Electronic Medical Record (EMR) to replace paperwork and streamline 19 agency workflows to improve patient care. Information Technology (IT) Director Children's Service Center July 2007  –  July 2010  (3 years 1 month) • Managed $550,000 IT budget and department staff; report directly to the CEO.  \n• Initiated and managed implementation of Windows Domain Infrastructure. Enabled centralized management of software deployment and support for over 500 users and 250 computers. \n• Created system to close gaps in billing process to capture over $400,000 of incremental annual revenue. \n• Implemented remote user access across three business units eliminating all paper documentation. Increased productivity by over 20% and reduced billing cycle time by over 40%. \n• Led team of seven clinicians charged with implementing Electronic Medical Record (EMR) to replace paperwork and streamline 19 agency workflows to improve patient care. Project Manager Infotech Consulting September 2006  –  June 2007  (10 months) • Put strategies into action to streamline operations across the organization. Drove 30% reduction in annual paper consumption, cut printer operation time by 25%, and delivered additional savings of $145,000. \n• Member of project team assigned to streamline monthly and annual financial statements. Documented 'as-is' infrastructure including business processes and associated systems. Identified five obsolete data feeds. \n• Led Role Based Access Control project to determined system access needs. Resulted in elimination of 25 user roles and streamlined user access setup. Project Manager Infotech Consulting September 2006  –  June 2007  (10 months) • Put strategies into action to streamline operations across the organization. Drove 30% reduction in annual paper consumption, cut printer operation time by 25%, and delivered additional savings of $145,000. \n• Member of project team assigned to streamline monthly and annual financial statements. Documented 'as-is' infrastructure including business processes and associated systems. Identified five obsolete data feeds. \n• Led Role Based Access Control project to determined system access needs. Resulted in elimination of 25 user roles and streamlined user access setup. Project Manager/Business Analyst Intel Corporation November 2004  –  August 2006  (1 year 10 months) •\tLed team of 6 developers and 1 business analyst to successful implementation of Wafer Start Per Week (WSPW) tool, while maintaining legacy system, resulting in quarterly savings of 3600 mouse clicks and 225 hours of productivity gains.  \n•\tLed team of 5 software engineers who developed and sustained 4 applications focused on commodity spending and cost consumption. \n•\tFacilitated customer user group of 7 super users representing 10 Intel factories and 4 corporate groups to gather and prioritize requirements using the XP Methodology.  \n•\tProvided sustaining support, including troubleshooting issues and training, to a customer base of 1200 users and 15 down stream applications. \n•\tSet long term strategic direction by identifying gaps between customer business needs and current application functionality. (Open) 3 recommendations, including: Maria Quartarone (Bui) Systems Analyst at Intel I was a peer project manager/business analyst of Paul's. Paul managed a project team consisting of 3-5 developers and... View Jay Turpin Agile Software Developer at Intel Corporation I worked with Paul for about a year on a software development project. I was the lead developer on the team and he was the... View 1 more recommendation Project Manager/Business Analyst Intel Corporation November 2004  –  August 2006  (1 year 10 months) •\tLed team of 6 developers and 1 business analyst to successful implementation of Wafer Start Per Week (WSPW) tool, while maintaining legacy system, resulting in quarterly savings of 3600 mouse clicks and 225 hours of productivity gains.  \n•\tLed team of 5 software engineers who developed and sustained 4 applications focused on commodity spending and cost consumption. \n•\tFacilitated customer user group of 7 super users representing 10 Intel factories and 4 corporate groups to gather and prioritize requirements using the XP Methodology.  \n•\tProvided sustaining support, including troubleshooting issues and training, to a customer base of 1200 users and 15 down stream applications. \n•\tSet long term strategic direction by identifying gaps between customer business needs and current application functionality. (Open) 3 recommendations, including: Maria Quartarone (Bui) Systems Analyst at Intel I was a peer project manager/business analyst of Paul's. Paul managed a project team consisting of 3-5 developers and... View Jay Turpin Agile Software Developer at Intel Corporation I worked with Paul for about a year on a software development project. I was the lead developer on the team and he was the... View 1 more recommendation Supply Demand Analyst Intel Corporation January 2003  –  November 2004  (1 year 11 months) •\tLed team of 2 engineers and 3 analysts in monthly process to align wafer starts to demand across multiple factories and products. \n•\tIncreased data quality by 70% by improving quality of database housing Intel product mapping structure through validation queries.  \n•\tDeveloped and standardized business rules for model input from 30 product planners to ensure quality output from planning application. Supply Demand Analyst Intel Corporation January 2003  –  November 2004  (1 year 11 months) •\tLed team of 2 engineers and 3 analysts in monthly process to align wafer starts to demand across multiple factories and products. \n•\tIncreased data quality by 70% by improving quality of database housing Intel product mapping structure through validation queries.  \n•\tDeveloped and standardized business rules for model input from 30 product planners to ensure quality output from planning application. Project Manager/Business Analyst Intel Corporation July 2001  –  January 2003  (1 year 7 months) •\tLed project team of 4 developers and 2 business analysts that developed an OPL ILOG based software application to create monthly factory build plans. \n•\tDeveloped and administered training packages to approximately 25 product planners, resulting in the successful, on-time, implementation of the software. \n•\tOwned approximately 15 data integrity issues, conducted root cause analyses, defined standards for the software model’s source data, and drove resolution with data source systems, resulting in increased accuracy of model output. Project Manager/Business Analyst Intel Corporation July 2001  –  January 2003  (1 year 7 months) •\tLed project team of 4 developers and 2 business analysts that developed an OPL ILOG based software application to create monthly factory build plans. \n•\tDeveloped and administered training packages to approximately 25 product planners, resulting in the successful, on-time, implementation of the software. \n•\tOwned approximately 15 data integrity issues, conducted root cause analyses, defined standards for the software model’s source data, and drove resolution with data source systems, resulting in increased accuracy of model output. Project Manager/Business Analyst Motorola July 1996  –  July 2001  (5 years 1 month) •\tLed project team responsible for implementation of Order Management module of SAP that identified 7 legacy systems for retirement to SAP conversion, resulting in annual projected savings of $5 Million. \n•\tDeveloped, updated and presented business process training material to 30 buyers resulting in on-time SAP implementation. \n•\tManaged all direct materials for PRISM assembly and test facility and supervised 4 Material Handling Employees; communicated with engineering and quality teams on performance issues. \n•\tIncreased PRISM assembly and test facility on-time delivery of finished goods from 70% to 95% and increased average yield of finished goods from 72% to over 92%. Project Manager/Business Analyst Motorola July 1996  –  July 2001  (5 years 1 month) •\tLed project team responsible for implementation of Order Management module of SAP that identified 7 legacy systems for retirement to SAP conversion, resulting in annual projected savings of $5 Million. \n•\tDeveloped, updated and presented business process training material to 30 buyers resulting in on-time SAP implementation. \n•\tManaged all direct materials for PRISM assembly and test facility and supervised 4 Material Handling Employees; communicated with engineering and quality teams on performance issues. \n•\tIncreased PRISM assembly and test facility on-time delivery of finished goods from 70% to 95% and increased average yield of finished goods from 72% to over 92%. Inventory Analyst Nabisco 1995  –  1995  (less than a year) Inventory Analyst Nabisco 1995  –  1995  (less than a year) Skills 23 Management 16 Software Documentation 11 Leadership 10 SDLC 9 Agile Methodologies 8 Software Development 7 SAP 3 Operations Management 3 Strategic Planning Skills  23 Management 16 Software Documentation 11 Leadership 10 SDLC 9 Agile Methodologies 8 Software Development 7 SAP 3 Operations Management 3 Strategic Planning 23 Management 16 Software Documentation 11 Leadership 10 SDLC 9 Agile Methodologies 8 Software Development 7 SAP 3 Operations Management 3 Strategic Planning 23 Management 16 Software Documentation 11 Leadership 10 SDLC 9 Agile Methodologies 8 Software Development 7 SAP 3 Operations Management 3 Strategic Planning                   Education Arizona State University Masters,  Business Administration 1999  – 2001 Michigan State University BA,  Materials and Logistics Management 1991  – 1996 Arizona State University Masters,  Business Administration 1999  – 2001 Arizona State University Masters,  Business Administration 1999  – 2001 Arizona State University Masters,  Business Administration 1999  – 2001 Michigan State University BA,  Materials and Logistics Management 1991  – 1996 Michigan State University BA,  Materials and Logistics Management 1991  – 1996 Michigan State University BA,  Materials and Logistics Management 1991  – 1996 ", "Experience Demand Analyst Intel Corporation Demand Manager Intel 2005  –  2011  (6 years) Demand Manager Intel 2005  –  2011  (6 years) Project Manager Intel 1999  –  2005  (6 years) (Open) 1 recommendation Mijail Gordienko Esquivel Entrepeneur with 15 years experience running my own businesses. While working for Kira, she showed great leadership skills and excelent people skills. For me she defines what a team player is. Her results orientation and positive attitude when facing complex situations always led the way to solving the... View Demand Analyst Intel Corporation Demand Analyst Intel Corporation Demand Manager Intel 2005  –  2011  (6 years) Demand Manager Intel 2005  –  2011  (6 years) Demand Manager Intel 2005  –  2011  (6 years) Demand Manager Intel 2005  –  2011  (6 years) Project Manager Intel 1999  –  2005  (6 years) (Open) 1 recommendation Mijail Gordienko Esquivel Entrepeneur with 15 years experience running my own businesses. While working for Kira, she showed great leadership skills and excelent people skills. For me she defines what a team player is. Her results orientation and positive attitude when facing complex situations always led the way to solving the... View Project Manager Intel 1999  –  2005  (6 years) (Open) 1 recommendation Mijail Gordienko Esquivel Entrepeneur with 15 years experience running my own businesses. While working for Kira, she showed great leadership skills and excelent people skills. For me she defines what a team player is. Her results orientation and positive attitude when facing complex situations always led the way to solving the... View Skills Skills     Education Stanford University BSIE 1982  – 1986 Stanford University BSIE 1982  – 1986 Stanford University BSIE 1982  – 1986 Stanford University BSIE 1982  – 1986 ", "Summary MBA with 20+ years business experience, spanning from Fortune 100 companies to micro-business entrepreneurship to higher education. Experience working/living in emerging markets & collaborating with teams on a global level in high tech, apparel, & accessory industries. Areas of excellence include marketing, supply chain & product management, event management, and training. \n \nMOST RELEVANT SKILLS \n•\tMasters of Business Administration, Finance concentration \n•\tManagement of product lines, operationally and through all stages of the product life cycle \n•\tMarketing in B2B & B2C environments, CPG, & retail merchandizing. Global marketing campaign management & collateral / marketing communications development \n•\tLean manufacturing, process documentation & cost reduction, procurement, contract negotiation \n•\tInternational supply chain & logistics management, U.S. Customs, tariffs & duties \n•\tTrade show & other event management & participation \n•\tCorporate & adult training, curriculum development & delivery, learning strategies \n•\tBudget & personnel management \n•\tCultural competency. Working understanding of established international markets, as well as Latin America and Asian emerging markets. \n•\tCost & market-driven pricing analytics \n•\tHighly effective multi-tasker, presenter, communicator, team leader, and team player \n•\tComfortable conducting business in Spanish \n Summary MBA with 20+ years business experience, spanning from Fortune 100 companies to micro-business entrepreneurship to higher education. Experience working/living in emerging markets & collaborating with teams on a global level in high tech, apparel, & accessory industries. Areas of excellence include marketing, supply chain & product management, event management, and training. \n \nMOST RELEVANT SKILLS \n•\tMasters of Business Administration, Finance concentration \n•\tManagement of product lines, operationally and through all stages of the product life cycle \n•\tMarketing in B2B & B2C environments, CPG, & retail merchandizing. Global marketing campaign management & collateral / marketing communications development \n•\tLean manufacturing, process documentation & cost reduction, procurement, contract negotiation \n•\tInternational supply chain & logistics management, U.S. Customs, tariffs & duties \n•\tTrade show & other event management & participation \n•\tCorporate & adult training, curriculum development & delivery, learning strategies \n•\tBudget & personnel management \n•\tCultural competency. Working understanding of established international markets, as well as Latin America and Asian emerging markets. \n•\tCost & market-driven pricing analytics \n•\tHighly effective multi-tasker, presenter, communicator, team leader, and team player \n•\tComfortable conducting business in Spanish \n MBA with 20+ years business experience, spanning from Fortune 100 companies to micro-business entrepreneurship to higher education. Experience working/living in emerging markets & collaborating with teams on a global level in high tech, apparel, & accessory industries. Areas of excellence include marketing, supply chain & product management, event management, and training. \n \nMOST RELEVANT SKILLS \n•\tMasters of Business Administration, Finance concentration \n•\tManagement of product lines, operationally and through all stages of the product life cycle \n•\tMarketing in B2B & B2C environments, CPG, & retail merchandizing. Global marketing campaign management & collateral / marketing communications development \n•\tLean manufacturing, process documentation & cost reduction, procurement, contract negotiation \n•\tInternational supply chain & logistics management, U.S. Customs, tariffs & duties \n•\tTrade show & other event management & participation \n•\tCorporate & adult training, curriculum development & delivery, learning strategies \n•\tBudget & personnel management \n•\tCultural competency. Working understanding of established international markets, as well as Latin America and Asian emerging markets. \n•\tCost & market-driven pricing analytics \n•\tHighly effective multi-tasker, presenter, communicator, team leader, and team player \n•\tComfortable conducting business in Spanish \n MBA with 20+ years business experience, spanning from Fortune 100 companies to micro-business entrepreneurship to higher education. Experience working/living in emerging markets & collaborating with teams on a global level in high tech, apparel, & accessory industries. Areas of excellence include marketing, supply chain & product management, event management, and training. \n \nMOST RELEVANT SKILLS \n•\tMasters of Business Administration, Finance concentration \n•\tManagement of product lines, operationally and through all stages of the product life cycle \n•\tMarketing in B2B & B2C environments, CPG, & retail merchandizing. Global marketing campaign management & collateral / marketing communications development \n•\tLean manufacturing, process documentation & cost reduction, procurement, contract negotiation \n•\tInternational supply chain & logistics management, U.S. Customs, tariffs & duties \n•\tTrade show & other event management & participation \n•\tCorporate & adult training, curriculum development & delivery, learning strategies \n•\tBudget & personnel management \n•\tCultural competency. Working understanding of established international markets, as well as Latin America and Asian emerging markets. \n•\tCost & market-driven pricing analytics \n•\tHighly effective multi-tasker, presenter, communicator, team leader, and team player \n•\tComfortable conducting business in Spanish \n Experience Communications Manager Intel Corporation March 2015  – Present (6 months) Hillsboro, OR (Jones Farm 5) Internal marketing & communications around amplifying the mission of Intel Pathfinding Architecture Group both internally & externally to select audiences. Events (internal & external) coordination, messaging, etc. Instructor, Business Dept Portland Community College, Rock Creek March 2011  – Present (4 years 6 months) Portland Community College, Rock Creek campus Teach online business courses (e.g. Principles of Marketing). Founder, President ANTZ Imports February 2005  –  June 2011  (6 years 5 months) •\tBuilt a wholesale company from scratch, designing & selling handmade goods sourced from Central/South America; Clients (e.g. boutiques, gift shops, apparel stores across the USA) acquired primarily through trade shows \n•\tSold B2C/retail seasonally, via a kiosk at Washington Sq mall & local events/shows \n•\tDesigned & maintained custom website/B2B portal via a CMS \n•\tMaintained company Facebook page, developed both print & electronic collateral; some use of Constant Contact \n•\tManaged / participated in minimum of 10-12 trade shows & events annually \n•\tMarket research & trend analysis (informal) \n•\tAccomplishments: launched a company from the ground up, introduced 34 low-tech (mostly cottage industry) vendors across 4 countries to the US market, recruited over 300 customer accounts, grew revenues YOY by 3-7% despite faltering economy, increased re-order rate from 2% to 44% over the life of the business (Open) 1 recommendation Gina Burton QA Specialist at DAT Solutions Angela is assertive and detail oriented. As a client I found it easy to know what she expected and always felt comfortable discussing issues as they arose. Angela has the perfect combination of poise and persistence with energy that never... View Marketing Manager Intel Corporation February 2003  –  February 2005  (2 years 1 month) Managed a small team charged with promoting servers to small business worldwide, utilizing a global distribution channel of resellers. Worked with and through peers/reams in every global geography. Managed $5M budget and grew team, budget, & responsibilities by ~ 40% during tenure. Program Marketer/Recruiter Intel Corporation February 2002  –  February 2003  (1 year 1 month) Enabled a new product line of Intel devices through a program re-selling 3rd-party software online. Recruited & negotiated contracts with 4 companies before Intel dissolved the division. Marketing Program Manager Intel Corporation January 2000  –  February 2002  (2 years 2 months) Launched one of Intel’s most prominent microprocessor features (called vPro™ technology or “AMT”). Led the team for customer usage model research which was the basis for architecting the solution, and took the feature through first 2 phases of it’s product life cycle. Awareded a Divisional Recognition Award for these accomplishments. Operations Manager Intel Corporation December 1998  –  January 2000  (1 year 2 months) Liasoned as the primary Operations Interface between a newly acquired company (based in San Diego, CA) and its product, and the Intel business unit, ultimately resulting in the launch of an entirely new product line for Intel. Customer Program Manager Intel Corporation October 1997  –  December 1998  (1 year 3 months) Managed the Print Server product team responsible for the manufacture & quality of this cash cow product line, built in our Puerto Rico factory. Supply/Demand Analyst Intel Corporation January 1997  –  October 1997  (10 months) Analyzed and negotiated for supply of components to optimize product builds in our Puerto Rico factory. Senior Buyer/Planner Intel Puerto Rico April 1995  –  January 1997  (1 year 10 months) Managed on-site procurement of limited-supply components critical to the continuous running of 7 mfg lines & meeting volume production goals Buyer Xerox Corporation October 1991  –  December 1994  (3 years 3 months) Corp Strategic Services, Furniture, Telecomm, MRO, Asset Recovery/Recycling projects.  \nAnalyzed commodities on a strategic level, led teams where applicable to leverage total spend volumes nationwide and globally via contracting. Implemented year-over-year productivity & 3-5% cost reductions with suppliers. Communications Manager Intel Corporation March 2015  – Present (6 months) Hillsboro, OR (Jones Farm 5) Internal marketing & communications around amplifying the mission of Intel Pathfinding Architecture Group both internally & externally to select audiences. Events (internal & external) coordination, messaging, etc. Communications Manager Intel Corporation March 2015  – Present (6 months) Hillsboro, OR (Jones Farm 5) Internal marketing & communications around amplifying the mission of Intel Pathfinding Architecture Group both internally & externally to select audiences. Events (internal & external) coordination, messaging, etc. Instructor, Business Dept Portland Community College, Rock Creek March 2011  – Present (4 years 6 months) Portland Community College, Rock Creek campus Teach online business courses (e.g. Principles of Marketing). Instructor, Business Dept Portland Community College, Rock Creek March 2011  – Present (4 years 6 months) Portland Community College, Rock Creek campus Teach online business courses (e.g. Principles of Marketing). Founder, President ANTZ Imports February 2005  –  June 2011  (6 years 5 months) •\tBuilt a wholesale company from scratch, designing & selling handmade goods sourced from Central/South America; Clients (e.g. boutiques, gift shops, apparel stores across the USA) acquired primarily through trade shows \n•\tSold B2C/retail seasonally, via a kiosk at Washington Sq mall & local events/shows \n•\tDesigned & maintained custom website/B2B portal via a CMS \n•\tMaintained company Facebook page, developed both print & electronic collateral; some use of Constant Contact \n•\tManaged / participated in minimum of 10-12 trade shows & events annually \n•\tMarket research & trend analysis (informal) \n•\tAccomplishments: launched a company from the ground up, introduced 34 low-tech (mostly cottage industry) vendors across 4 countries to the US market, recruited over 300 customer accounts, grew revenues YOY by 3-7% despite faltering economy, increased re-order rate from 2% to 44% over the life of the business (Open) 1 recommendation Gina Burton QA Specialist at DAT Solutions Angela is assertive and detail oriented. As a client I found it easy to know what she expected and always felt comfortable discussing issues as they arose. Angela has the perfect combination of poise and persistence with energy that never... View Founder, President ANTZ Imports February 2005  –  June 2011  (6 years 5 months) •\tBuilt a wholesale company from scratch, designing & selling handmade goods sourced from Central/South America; Clients (e.g. boutiques, gift shops, apparel stores across the USA) acquired primarily through trade shows \n•\tSold B2C/retail seasonally, via a kiosk at Washington Sq mall & local events/shows \n•\tDesigned & maintained custom website/B2B portal via a CMS \n•\tMaintained company Facebook page, developed both print & electronic collateral; some use of Constant Contact \n•\tManaged / participated in minimum of 10-12 trade shows & events annually \n•\tMarket research & trend analysis (informal) \n•\tAccomplishments: launched a company from the ground up, introduced 34 low-tech (mostly cottage industry) vendors across 4 countries to the US market, recruited over 300 customer accounts, grew revenues YOY by 3-7% despite faltering economy, increased re-order rate from 2% to 44% over the life of the business (Open) 1 recommendation Gina Burton QA Specialist at DAT Solutions Angela is assertive and detail oriented. As a client I found it easy to know what she expected and always felt comfortable discussing issues as they arose. Angela has the perfect combination of poise and persistence with energy that never... View Marketing Manager Intel Corporation February 2003  –  February 2005  (2 years 1 month) Managed a small team charged with promoting servers to small business worldwide, utilizing a global distribution channel of resellers. Worked with and through peers/reams in every global geography. Managed $5M budget and grew team, budget, & responsibilities by ~ 40% during tenure. Marketing Manager Intel Corporation February 2003  –  February 2005  (2 years 1 month) Managed a small team charged with promoting servers to small business worldwide, utilizing a global distribution channel of resellers. Worked with and through peers/reams in every global geography. Managed $5M budget and grew team, budget, & responsibilities by ~ 40% during tenure. Program Marketer/Recruiter Intel Corporation February 2002  –  February 2003  (1 year 1 month) Enabled a new product line of Intel devices through a program re-selling 3rd-party software online. Recruited & negotiated contracts with 4 companies before Intel dissolved the division. Program Marketer/Recruiter Intel Corporation February 2002  –  February 2003  (1 year 1 month) Enabled a new product line of Intel devices through a program re-selling 3rd-party software online. Recruited & negotiated contracts with 4 companies before Intel dissolved the division. Marketing Program Manager Intel Corporation January 2000  –  February 2002  (2 years 2 months) Launched one of Intel’s most prominent microprocessor features (called vPro™ technology or “AMT”). Led the team for customer usage model research which was the basis for architecting the solution, and took the feature through first 2 phases of it’s product life cycle. Awareded a Divisional Recognition Award for these accomplishments. Marketing Program Manager Intel Corporation January 2000  –  February 2002  (2 years 2 months) Launched one of Intel’s most prominent microprocessor features (called vPro™ technology or “AMT”). Led the team for customer usage model research which was the basis for architecting the solution, and took the feature through first 2 phases of it’s product life cycle. Awareded a Divisional Recognition Award for these accomplishments. Operations Manager Intel Corporation December 1998  –  January 2000  (1 year 2 months) Liasoned as the primary Operations Interface between a newly acquired company (based in San Diego, CA) and its product, and the Intel business unit, ultimately resulting in the launch of an entirely new product line for Intel. Operations Manager Intel Corporation December 1998  –  January 2000  (1 year 2 months) Liasoned as the primary Operations Interface between a newly acquired company (based in San Diego, CA) and its product, and the Intel business unit, ultimately resulting in the launch of an entirely new product line for Intel. Customer Program Manager Intel Corporation October 1997  –  December 1998  (1 year 3 months) Managed the Print Server product team responsible for the manufacture & quality of this cash cow product line, built in our Puerto Rico factory. Customer Program Manager Intel Corporation October 1997  –  December 1998  (1 year 3 months) Managed the Print Server product team responsible for the manufacture & quality of this cash cow product line, built in our Puerto Rico factory. Supply/Demand Analyst Intel Corporation January 1997  –  October 1997  (10 months) Analyzed and negotiated for supply of components to optimize product builds in our Puerto Rico factory. Supply/Demand Analyst Intel Corporation January 1997  –  October 1997  (10 months) Analyzed and negotiated for supply of components to optimize product builds in our Puerto Rico factory. Senior Buyer/Planner Intel Puerto Rico April 1995  –  January 1997  (1 year 10 months) Managed on-site procurement of limited-supply components critical to the continuous running of 7 mfg lines & meeting volume production goals Senior Buyer/Planner Intel Puerto Rico April 1995  –  January 1997  (1 year 10 months) Managed on-site procurement of limited-supply components critical to the continuous running of 7 mfg lines & meeting volume production goals Buyer Xerox Corporation October 1991  –  December 1994  (3 years 3 months) Corp Strategic Services, Furniture, Telecomm, MRO, Asset Recovery/Recycling projects.  \nAnalyzed commodities on a strategic level, led teams where applicable to leverage total spend volumes nationwide and globally via contracting. Implemented year-over-year productivity & 3-5% cost reductions with suppliers. Buyer Xerox Corporation October 1991  –  December 1994  (3 years 3 months) Corp Strategic Services, Furniture, Telecomm, MRO, Asset Recovery/Recycling projects.  \nAnalyzed commodities on a strategic level, led teams where applicable to leverage total spend volumes nationwide and globally via contracting. Implemented year-over-year productivity & 3-5% cost reductions with suppliers. Languages Spanish Spanish Spanish Skills Top Skills 22 Program Management 17 Product Marketing 17 Management 14 Marketing 12 Cross-functional Team... 9 Training 8 Product Development 7 Sales 6 Operations Management 6 Product Management Angela also knows about... 5 Leadership 4 Manufacturing 3 Procurement 3 Recruiting 3 Strategy 3 E-commerce 3 Process Improvement 2 Go-to-market Strategy 2 Budgets 2 Event Management 2 Strategic Planning 2 Start-ups 2 Supply Chain Management 2 Analysis 2 Entrepreneurship 2 Business Development 1 Project Planning 1 Customer Service 1 Small Business 1 Teamwork 1 Higher Education 1 Competitive Analysis 1 Team Building 1 Strategic Partnerships 1 Leadership Development 1 Business Strategy 1 Business Planning 1 Contract Negotiation 1 Team Leadership 1 Vendor Management 1 Forecasting 1 Human Resources 1 Management Consulting 1 Telecommunications 1 Coaching 1 Organizational... 1 Mergers & Acquisitions 1 Business Process... See 23+     See less Skills  Top Skills 22 Program Management 17 Product Marketing 17 Management 14 Marketing 12 Cross-functional Team... 9 Training 8 Product Development 7 Sales 6 Operations Management 6 Product Management Angela also knows about... 5 Leadership 4 Manufacturing 3 Procurement 3 Recruiting 3 Strategy 3 E-commerce 3 Process Improvement 2 Go-to-market Strategy 2 Budgets 2 Event Management 2 Strategic Planning 2 Start-ups 2 Supply Chain Management 2 Analysis 2 Entrepreneurship 2 Business Development 1 Project Planning 1 Customer Service 1 Small Business 1 Teamwork 1 Higher Education 1 Competitive Analysis 1 Team Building 1 Strategic Partnerships 1 Leadership Development 1 Business Strategy 1 Business Planning 1 Contract Negotiation 1 Team Leadership 1 Vendor Management 1 Forecasting 1 Human Resources 1 Management Consulting 1 Telecommunications 1 Coaching 1 Organizational... 1 Mergers & Acquisitions 1 Business Process... See 23+     See less Top Skills 22 Program Management 17 Product Marketing 17 Management 14 Marketing 12 Cross-functional Team... 9 Training 8 Product Development 7 Sales 6 Operations Management 6 Product Management Angela also knows about... 5 Leadership 4 Manufacturing 3 Procurement 3 Recruiting 3 Strategy 3 E-commerce 3 Process Improvement 2 Go-to-market Strategy 2 Budgets 2 Event Management 2 Strategic Planning 2 Start-ups 2 Supply Chain Management 2 Analysis 2 Entrepreneurship 2 Business Development 1 Project Planning 1 Customer Service 1 Small Business 1 Teamwork 1 Higher Education 1 Competitive Analysis 1 Team Building 1 Strategic Partnerships 1 Leadership Development 1 Business Strategy 1 Business Planning 1 Contract Negotiation 1 Team Leadership 1 Vendor Management 1 Forecasting 1 Human Resources 1 Management Consulting 1 Telecommunications 1 Coaching 1 Organizational... 1 Mergers & Acquisitions 1 Business Process... See 23+     See less Top Skills 22 Program Management 17 Product Marketing 17 Management 14 Marketing 12 Cross-functional Team... 9 Training 8 Product Development 7 Sales 6 Operations Management 6 Product Management Angela also knows about... 5 Leadership 4 Manufacturing 3 Procurement 3 Recruiting 3 Strategy 3 E-commerce 3 Process Improvement 2 Go-to-market Strategy 2 Budgets 2 Event Management 2 Strategic Planning 2 Start-ups 2 Supply Chain Management 2 Analysis 2 Entrepreneurship 2 Business Development 1 Project Planning 1 Customer Service 1 Small Business 1 Teamwork 1 Higher Education 1 Competitive Analysis 1 Team Building 1 Strategic Partnerships 1 Leadership Development 1 Business Strategy 1 Business Planning 1 Contract Negotiation 1 Team Leadership 1 Vendor Management 1 Forecasting 1 Human Resources 1 Management Consulting 1 Telecommunications 1 Coaching 1 Organizational... 1 Mergers & Acquisitions 1 Business Process... See 23+     See less                     5 Leadership 4 Manufacturing 3 Procurement 3 Recruiting 3 Strategy 3 E-commerce 3 Process Improvement 2 Go-to-market Strategy 2 Budgets 2 Event Management 2 Strategic Planning 2 Start-ups 2 Supply Chain Management 2 Analysis 2 Entrepreneurship 2 Business Development 1 Project Planning 1 Customer Service 1 Small Business 1 Teamwork 1 Higher Education 1 Competitive Analysis 1 Team Building 1 Strategic Partnerships 1 Leadership Development 1 Business Strategy 1 Business Planning 1 Contract Negotiation 1 Team Leadership 1 Vendor Management 1 Forecasting 1 Human Resources 1 Management Consulting 1 Telecommunications 1 Coaching 1 Organizational... 1 Mergers & Acquisitions 1 Business Process... Education Rochester Institute of Technology M.B.A.,  Finance 1992  – 1994 Obtained degree nights/weekends whilst working full time at Xerox Corp. Augustana College Bachelor of Administration,  Business Administration ,  Psychology 1987  – 1991 Worked part-time while going to school \n- Office Mgr, Civil Constructors (construction company) \n- Administrative Asst, Office of Career Planning, Augustana College Activities and Societies:  Chi Alpha Pi sorority (Vice President) ,  Bowling Club (President ,  Treasurer) Rochester Institute of Technology M.B.A.,  Finance 1992  – 1994 Obtained degree nights/weekends whilst working full time at Xerox Corp. Rochester Institute of Technology M.B.A.,  Finance 1992  – 1994 Obtained degree nights/weekends whilst working full time at Xerox Corp. Rochester Institute of Technology M.B.A.,  Finance 1992  – 1994 Obtained degree nights/weekends whilst working full time at Xerox Corp. Augustana College Bachelor of Administration,  Business Administration ,  Psychology 1987  – 1991 Worked part-time while going to school \n- Office Mgr, Civil Constructors (construction company) \n- Administrative Asst, Office of Career Planning, Augustana College Activities and Societies:  Chi Alpha Pi sorority (Vice President) ,  Bowling Club (President ,  Treasurer) Augustana College Bachelor of Administration,  Business Administration ,  Psychology 1987  – 1991 Worked part-time while going to school \n- Office Mgr, Civil Constructors (construction company) \n- Administrative Asst, Office of Career Planning, Augustana College Activities and Societies:  Chi Alpha Pi sorority (Vice President) ,  Bowling Club (President ,  Treasurer) Augustana College Bachelor of Administration,  Business Administration ,  Psychology 1987  – 1991 Worked part-time while going to school \n- Office Mgr, Civil Constructors (construction company) \n- Administrative Asst, Office of Career Planning, Augustana College Activities and Societies:  Chi Alpha Pi sorority (Vice President) ,  Bowling Club (President ,  Treasurer) ", "Experience Associate A.T. Kearney February 2015  – Present (7 months) San Francisco, California A.T. Kearney is a leading global management consulting firm with offices in more than 40 countries. Since 1926, we have been trusted advisors to the world's foremost organizations. A.T. Kearney is a partner-owned firm, committed to helping clients achieve immediate impact and growing advantage on their most mission-critical issues. \n \nWe work with more than two-thirds of the Fortune Global 500, the world's largest companies by revenues, as well as with the most influential governmental and non-profit organizations. \n \nOur work is always intended to provide a clear benefit to the organizations we work with in both the short and long term. We focus our resources, leverage our global scale, and drive excellence in all we do while enhancing our partner-like culture to ensure we are collaborative, authentic, and forward-thinking. Mergers and Acquisitions Advisor Chen Family Holdings April 2013  –  February 2015  (1 year 11 months) San Francisco, California Executed strategic and operational plans to grow a portfolio of private companies and investments. \nAnalyzed investment opportunities and acquisition targets for financial and operational risks and returns. \nConducted short and long range strategic planning sessions to ensure strategic integration of acquisitions.  \nProvided 1:1 coaching to management team members to develop management capabilities and improve soft skills. Consultant BTS Consulting August 2011  –  April 2013  (1 year 9 months) San Francisco, California Enhanced the leadership and strategic execution capabilities of Fortune 500 executives by developing and delivering customized experiential learning programs aimed to broaden the client's business and financial acumen.  \nKey clients included industry leading biotech, telecommunications, professional services, semiconductor, apparel and financial services firms. Marketing Analyst - Internship Autodesk July 2010  –  August 2010  (2 months) Identified strategic market growth opportunities for Autodesk's Manufacturing design software group.  \nAnalyzed and benchmarked internal and external sales lead generation processes. Presented recommendations to senior marketing executives. Partner and Operator Venus Granite LLC June 2007  –  December 2008  (1 year 7 months) Mountain View, CA Invested, conceptualized and executed buildup of brick and mortar kitchen remodeling business that generated customer leads from Google AdWords. Senior Business Analyst Intel Corporation January 2006  –  May 2007  (1 year 5 months) Santa Clara, California Aligned global management to corporate financial goals by presenting influential financial, operational, marketing, and product data on a weekly basis. Awarded 4 promotions within 5 years in Sales and Marketing and also Business Planning organizations. Global CPU Supply and Demand Analyst Intel Corporation March 2002  –  February 2006  (4 years) Santa Clara, California Forecasted and optimized worldwide supply and demand for multiple CPU product lines daily with annual total revenues of over $3B. Independently created forecasting tools that critically enabled lean inventory across the company. Customer Business Analyst - Internship Intel Corporation July 2000  –  December 2000  (6 months) Folsom, California Managed product launch and strategic operations of Intel Play and Intel Audio/Video devices for US retail accounts. Associate A.T. Kearney February 2015  – Present (7 months) San Francisco, California A.T. Kearney is a leading global management consulting firm with offices in more than 40 countries. Since 1926, we have been trusted advisors to the world's foremost organizations. A.T. Kearney is a partner-owned firm, committed to helping clients achieve immediate impact and growing advantage on their most mission-critical issues. \n \nWe work with more than two-thirds of the Fortune Global 500, the world's largest companies by revenues, as well as with the most influential governmental and non-profit organizations. \n \nOur work is always intended to provide a clear benefit to the organizations we work with in both the short and long term. We focus our resources, leverage our global scale, and drive excellence in all we do while enhancing our partner-like culture to ensure we are collaborative, authentic, and forward-thinking. Associate A.T. Kearney February 2015  – Present (7 months) San Francisco, California A.T. Kearney is a leading global management consulting firm with offices in more than 40 countries. Since 1926, we have been trusted advisors to the world's foremost organizations. A.T. Kearney is a partner-owned firm, committed to helping clients achieve immediate impact and growing advantage on their most mission-critical issues. \n \nWe work with more than two-thirds of the Fortune Global 500, the world's largest companies by revenues, as well as with the most influential governmental and non-profit organizations. \n \nOur work is always intended to provide a clear benefit to the organizations we work with in both the short and long term. We focus our resources, leverage our global scale, and drive excellence in all we do while enhancing our partner-like culture to ensure we are collaborative, authentic, and forward-thinking. Mergers and Acquisitions Advisor Chen Family Holdings April 2013  –  February 2015  (1 year 11 months) San Francisco, California Executed strategic and operational plans to grow a portfolio of private companies and investments. \nAnalyzed investment opportunities and acquisition targets for financial and operational risks and returns. \nConducted short and long range strategic planning sessions to ensure strategic integration of acquisitions.  \nProvided 1:1 coaching to management team members to develop management capabilities and improve soft skills. Mergers and Acquisitions Advisor Chen Family Holdings April 2013  –  February 2015  (1 year 11 months) San Francisco, California Executed strategic and operational plans to grow a portfolio of private companies and investments. \nAnalyzed investment opportunities and acquisition targets for financial and operational risks and returns. \nConducted short and long range strategic planning sessions to ensure strategic integration of acquisitions.  \nProvided 1:1 coaching to management team members to develop management capabilities and improve soft skills. Consultant BTS Consulting August 2011  –  April 2013  (1 year 9 months) San Francisco, California Enhanced the leadership and strategic execution capabilities of Fortune 500 executives by developing and delivering customized experiential learning programs aimed to broaden the client's business and financial acumen.  \nKey clients included industry leading biotech, telecommunications, professional services, semiconductor, apparel and financial services firms. Consultant BTS Consulting August 2011  –  April 2013  (1 year 9 months) San Francisco, California Enhanced the leadership and strategic execution capabilities of Fortune 500 executives by developing and delivering customized experiential learning programs aimed to broaden the client's business and financial acumen.  \nKey clients included industry leading biotech, telecommunications, professional services, semiconductor, apparel and financial services firms. Marketing Analyst - Internship Autodesk July 2010  –  August 2010  (2 months) Identified strategic market growth opportunities for Autodesk's Manufacturing design software group.  \nAnalyzed and benchmarked internal and external sales lead generation processes. Presented recommendations to senior marketing executives. Marketing Analyst - Internship Autodesk July 2010  –  August 2010  (2 months) Identified strategic market growth opportunities for Autodesk's Manufacturing design software group.  \nAnalyzed and benchmarked internal and external sales lead generation processes. Presented recommendations to senior marketing executives. Partner and Operator Venus Granite LLC June 2007  –  December 2008  (1 year 7 months) Mountain View, CA Invested, conceptualized and executed buildup of brick and mortar kitchen remodeling business that generated customer leads from Google AdWords. Partner and Operator Venus Granite LLC June 2007  –  December 2008  (1 year 7 months) Mountain View, CA Invested, conceptualized and executed buildup of brick and mortar kitchen remodeling business that generated customer leads from Google AdWords. Senior Business Analyst Intel Corporation January 2006  –  May 2007  (1 year 5 months) Santa Clara, California Aligned global management to corporate financial goals by presenting influential financial, operational, marketing, and product data on a weekly basis. Awarded 4 promotions within 5 years in Sales and Marketing and also Business Planning organizations. Senior Business Analyst Intel Corporation January 2006  –  May 2007  (1 year 5 months) Santa Clara, California Aligned global management to corporate financial goals by presenting influential financial, operational, marketing, and product data on a weekly basis. Awarded 4 promotions within 5 years in Sales and Marketing and also Business Planning organizations. Global CPU Supply and Demand Analyst Intel Corporation March 2002  –  February 2006  (4 years) Santa Clara, California Forecasted and optimized worldwide supply and demand for multiple CPU product lines daily with annual total revenues of over $3B. Independently created forecasting tools that critically enabled lean inventory across the company. Global CPU Supply and Demand Analyst Intel Corporation March 2002  –  February 2006  (4 years) Santa Clara, California Forecasted and optimized worldwide supply and demand for multiple CPU product lines daily with annual total revenues of over $3B. Independently created forecasting tools that critically enabled lean inventory across the company. Customer Business Analyst - Internship Intel Corporation July 2000  –  December 2000  (6 months) Folsom, California Managed product launch and strategic operations of Intel Play and Intel Audio/Video devices for US retail accounts. Customer Business Analyst - Internship Intel Corporation July 2000  –  December 2000  (6 months) Folsom, California Managed product launch and strategic operations of Intel Play and Intel Audio/Video devices for US retail accounts. Languages English Mandarin Cantonese Toisanese Japanese English Mandarin Cantonese Toisanese Japanese English Mandarin Cantonese Toisanese Japanese Skills Top Skills 21 Business Strategy 17 Leadership 14 Competitive Analysis 12 Program Management 10 Business Analysis 8 Business Planning 7 Operations Management 7 Strategy 6 Marketing Strategy 4 Leadership Development Benny also knows about... 3 Executive Coaching 2 Public Speaking 2 Performance Management 1 Market Analysis 0 Training Delivery 0 Microsoft Office Skills  Top Skills 21 Business Strategy 17 Leadership 14 Competitive Analysis 12 Program Management 10 Business Analysis 8 Business Planning 7 Operations Management 7 Strategy 6 Marketing Strategy 4 Leadership Development Benny also knows about... 3 Executive Coaching 2 Public Speaking 2 Performance Management 1 Market Analysis 0 Training Delivery 0 Microsoft Office Top Skills 21 Business Strategy 17 Leadership 14 Competitive Analysis 12 Program Management 10 Business Analysis 8 Business Planning 7 Operations Management 7 Strategy 6 Marketing Strategy 4 Leadership Development Benny also knows about... 3 Executive Coaching 2 Public Speaking 2 Performance Management 1 Market Analysis 0 Training Delivery 0 Microsoft Office Top Skills 21 Business Strategy 17 Leadership 14 Competitive Analysis 12 Program Management 10 Business Analysis 8 Business Planning 7 Operations Management 7 Strategy 6 Marketing Strategy 4 Leadership Development Benny also knows about... 3 Executive Coaching 2 Public Speaking 2 Performance Management 1 Market Analysis 0 Training Delivery 0 Microsoft Office                     3 Executive Coaching 2 Public Speaking 2 Performance Management 1 Market Analysis 0 Training Delivery 0 Microsoft Office Education University of Southern California - Marshall School of Business Master of Business Administration (M.B.A.) 2009  – 2011 Activities and Societies:  Elected Academic Core Representative of the Student Executive Committee ,  Member of American Finance Association ,  Marshall Management and Consulting Club ,  Graduate Asian Business Society; Charter member of Trojan Toastmasters University of Washington Bachelor of Arts (B.A.),  Business Administration - Information Systems 1995  – 2001 University of Washington Bachelor of Science (B.S.),  Cell and Molecular Biology 1995  – 2001 Activities and Societies:  Researched Osteopontin gene expression in mammalian tissue resulting in findings published as a National Science Foundation study. University of Southern California - Marshall School of Business Master of Business Administration (M.B.A.) 2009  – 2011 Activities and Societies:  Elected Academic Core Representative of the Student Executive Committee ,  Member of American Finance Association ,  Marshall Management and Consulting Club ,  Graduate Asian Business Society; Charter member of Trojan Toastmasters University of Southern California - Marshall School of Business Master of Business Administration (M.B.A.) 2009  – 2011 Activities and Societies:  Elected Academic Core Representative of the Student Executive Committee ,  Member of American Finance Association ,  Marshall Management and Consulting Club ,  Graduate Asian Business Society; Charter member of Trojan Toastmasters University of Southern California - Marshall School of Business Master of Business Administration (M.B.A.) 2009  – 2011 Activities and Societies:  Elected Academic Core Representative of the Student Executive Committee ,  Member of American Finance Association ,  Marshall Management and Consulting Club ,  Graduate Asian Business Society; Charter member of Trojan Toastmasters University of Washington Bachelor of Arts (B.A.),  Business Administration - Information Systems 1995  – 2001 University of Washington Bachelor of Arts (B.A.),  Business Administration - Information Systems 1995  – 2001 University of Washington Bachelor of Arts (B.A.),  Business Administration - Information Systems 1995  – 2001 University of Washington Bachelor of Science (B.S.),  Cell and Molecular Biology 1995  – 2001 Activities and Societies:  Researched Osteopontin gene expression in mammalian tissue resulting in findings published as a National Science Foundation study. University of Washington Bachelor of Science (B.S.),  Cell and Molecular Biology 1995  – 2001 Activities and Societies:  Researched Osteopontin gene expression in mammalian tissue resulting in findings published as a National Science Foundation study. University of Washington Bachelor of Science (B.S.),  Cell and Molecular Biology 1995  – 2001 Activities and Societies:  Researched Osteopontin gene expression in mammalian tissue resulting in findings published as a National Science Foundation study. ", "Experience Demand Analyst Intel Corporation November 2012  – Present (2 years 10 months) Swindon, United Kingdom Revenue Analyst Intel Corporation May 2010  –  October 2012  (2 years 6 months) Swindon Business Intelligence Analyst Intel Corporation May 2008  –  April 2010  (2 years) Budget and Planning Anlayst Intel Corporation April 2006  –  April 2008  (2 years 1 month) Swindon, United Kingdom Demand Analyst Intel Corporation November 2012  – Present (2 years 10 months) Swindon, United Kingdom Demand Analyst Intel Corporation November 2012  – Present (2 years 10 months) Swindon, United Kingdom Revenue Analyst Intel Corporation May 2010  –  October 2012  (2 years 6 months) Swindon Revenue Analyst Intel Corporation May 2010  –  October 2012  (2 years 6 months) Swindon Business Intelligence Analyst Intel Corporation May 2008  –  April 2010  (2 years) Business Intelligence Analyst Intel Corporation May 2008  –  April 2010  (2 years) Budget and Planning Anlayst Intel Corporation April 2006  –  April 2008  (2 years 1 month) Swindon, United Kingdom Budget and Planning Anlayst Intel Corporation April 2006  –  April 2008  (2 years 1 month) Swindon, United Kingdom Skills 5 Business Intelligence 3 Forecasting 2 Budgets 2 Project Planning Skills  5 Business Intelligence 3 Forecasting 2 Budgets 2 Project Planning 5 Business Intelligence 3 Forecasting 2 Budgets 2 Project Planning 5 Business Intelligence 3 Forecasting 2 Budgets 2 Project Planning         Education Loughborough University 1998  – 2004 2:1 Accounting and Financial Management Loughborough University 1998  – 2004 2:1 Accounting and Financial Management Loughborough University 1998  – 2004 2:1 Accounting and Financial Management Loughborough University 1998  – 2004 2:1 Accounting and Financial Management ", "Summary Driven and respected professional with demonstrated track record of achieving enhanced financial results through expertise in marketing, factory and finance. Specialties:Long-range business planning; pricing; product marketing; product positioning; training sales teams on product value propositions; branding strategy; short-term supply/demand alignment; managerial accounting; financial analysis; constructing an organization and setting the vision, mission and charter. Summary Driven and respected professional with demonstrated track record of achieving enhanced financial results through expertise in marketing, factory and finance. Specialties:Long-range business planning; pricing; product marketing; product positioning; training sales teams on product value propositions; branding strategy; short-term supply/demand alignment; managerial accounting; financial analysis; constructing an organization and setting the vision, mission and charter. Driven and respected professional with demonstrated track record of achieving enhanced financial results through expertise in marketing, factory and finance. Specialties:Long-range business planning; pricing; product marketing; product positioning; training sales teams on product value propositions; branding strategy; short-term supply/demand alignment; managerial accounting; financial analysis; constructing an organization and setting the vision, mission and charter. Driven and respected professional with demonstrated track record of achieving enhanced financial results through expertise in marketing, factory and finance. Specialties:Long-range business planning; pricing; product marketing; product positioning; training sales teams on product value propositions; branding strategy; short-term supply/demand alignment; managerial accounting; financial analysis; constructing an organization and setting the vision, mission and charter. Experience Data Analytics and Demand Manager, Global Talent Acquisition Intel Corporation June 2014  – Present (1 year 3 months) Chandler, AZ • Managed team of Data and Business Analysts responsible for all aspects of talent acquisition analytics and data management \n• Created a repeatable, traceable demand planning and forecasting process aligned to key corporate strategic objectives and trends, incorporating business input and advanced statistical modeling to triangulate the forecast around multiple points of view \n• Administered a repeatable, credible process by which we collect feedback from hiring managers and new hires to drive continuous improvement Demand Manager, Sales & Marketing Group Intel Corporation September 2011  –  June 2014  (2 years 10 months) Chandler, AZ •\tServed as a key contributor to messaging and recommendations to the CEO and Board of Directors \n•\tDelivered a 50% efficiency improvement in headcount required for demand planning  \n•\tContributed to the redesign of the company-wide long-range business planning function focused on strategic objectives \n•\tSupervised a team of 7 analysts who produce business intelligence and demand forecasts for the long-range business plans \n•\tEnabled a key growth businesses to obtain production capacity to realize their potential in the marketplace \n•\tConsulted in the development of a comprehensive data repository capable of stitching together past and present trends with the future plans to detect market dynamics and disruptions Marketing Roadmap Manager Intel Corporation July 2010  –  September 2011  (1 year 3 months) Santa Clara, CA •\tWon a major design by educating key customers on product value propositions \n•\tPublished the first 5-quarter external, non-disclosure UltrabookTM roadmap and the first external tablet roadmap \n•\tGarnered executive management ratification of product positioning and advocacy for roadmap publications \n•\tPresented the mobile roadmap to an audience of over 500 ecosystem partners \n•\tEnabled the sales teams to close design wins at the most strategically important customers by driving product requirements through engineering Demand Analyst Intel Corporation July 2007  –  September 2010  (3 years 3 months) Chandler, AZ / Folsom, CA / Santa Clara, CA •\tAdvised executive management on capacity planning and recommended capital investment strategies \n•\tDeveloped the notebook long-range plans and secured buy-in from executive management \n•\tInfluenced multiple corporate strategic decisions by performing and leveraging data-driven analyses \n•\tImproved demand planning models for forecasting demand and simulating demand scenarios while maximizing efficiency Finance Manager Intel Corporation April 2006  –  September 2007  (1 year 6 months) Chandler, AZ •\tDrove savings of over $10M by creating a dynamic tool usage model for periods of excess capacity \n•\tRecovered $7M in a 6-month period with a self-funding bonus incentive program Sr. Financial Analyst Intel Corporation July 2004  –  April 2006  (1 year 10 months) Chandler, AZ •\tManaged a team of 8 analysts to deliver plans and close activities for a factory network with a $1.2 billion/yr budget \n•\tRecaptured over $30 million via tax credits for R&D expenses and tool investments Customer Support Engineer The Boeing Company March 2001  –  August 2002  (1 year 6 months) Kent, WA •\tDesigned technical solutions for issues involving military aircraft systems Industrial Engineer The Boeing Company June 1999  –  March 2001  (1 year 10 months) Everett, WA •\tConsulted in the development of moving assembly lines for commercial aircraft manufacturing Data Analytics and Demand Manager, Global Talent Acquisition Intel Corporation June 2014  – Present (1 year 3 months) Chandler, AZ • Managed team of Data and Business Analysts responsible for all aspects of talent acquisition analytics and data management \n• Created a repeatable, traceable demand planning and forecasting process aligned to key corporate strategic objectives and trends, incorporating business input and advanced statistical modeling to triangulate the forecast around multiple points of view \n• Administered a repeatable, credible process by which we collect feedback from hiring managers and new hires to drive continuous improvement Data Analytics and Demand Manager, Global Talent Acquisition Intel Corporation June 2014  – Present (1 year 3 months) Chandler, AZ • Managed team of Data and Business Analysts responsible for all aspects of talent acquisition analytics and data management \n• Created a repeatable, traceable demand planning and forecasting process aligned to key corporate strategic objectives and trends, incorporating business input and advanced statistical modeling to triangulate the forecast around multiple points of view \n• Administered a repeatable, credible process by which we collect feedback from hiring managers and new hires to drive continuous improvement Demand Manager, Sales & Marketing Group Intel Corporation September 2011  –  June 2014  (2 years 10 months) Chandler, AZ •\tServed as a key contributor to messaging and recommendations to the CEO and Board of Directors \n•\tDelivered a 50% efficiency improvement in headcount required for demand planning  \n•\tContributed to the redesign of the company-wide long-range business planning function focused on strategic objectives \n•\tSupervised a team of 7 analysts who produce business intelligence and demand forecasts for the long-range business plans \n•\tEnabled a key growth businesses to obtain production capacity to realize their potential in the marketplace \n•\tConsulted in the development of a comprehensive data repository capable of stitching together past and present trends with the future plans to detect market dynamics and disruptions Demand Manager, Sales & Marketing Group Intel Corporation September 2011  –  June 2014  (2 years 10 months) Chandler, AZ •\tServed as a key contributor to messaging and recommendations to the CEO and Board of Directors \n•\tDelivered a 50% efficiency improvement in headcount required for demand planning  \n•\tContributed to the redesign of the company-wide long-range business planning function focused on strategic objectives \n•\tSupervised a team of 7 analysts who produce business intelligence and demand forecasts for the long-range business plans \n•\tEnabled a key growth businesses to obtain production capacity to realize their potential in the marketplace \n•\tConsulted in the development of a comprehensive data repository capable of stitching together past and present trends with the future plans to detect market dynamics and disruptions Marketing Roadmap Manager Intel Corporation July 2010  –  September 2011  (1 year 3 months) Santa Clara, CA •\tWon a major design by educating key customers on product value propositions \n•\tPublished the first 5-quarter external, non-disclosure UltrabookTM roadmap and the first external tablet roadmap \n•\tGarnered executive management ratification of product positioning and advocacy for roadmap publications \n•\tPresented the mobile roadmap to an audience of over 500 ecosystem partners \n•\tEnabled the sales teams to close design wins at the most strategically important customers by driving product requirements through engineering Marketing Roadmap Manager Intel Corporation July 2010  –  September 2011  (1 year 3 months) Santa Clara, CA •\tWon a major design by educating key customers on product value propositions \n•\tPublished the first 5-quarter external, non-disclosure UltrabookTM roadmap and the first external tablet roadmap \n•\tGarnered executive management ratification of product positioning and advocacy for roadmap publications \n•\tPresented the mobile roadmap to an audience of over 500 ecosystem partners \n•\tEnabled the sales teams to close design wins at the most strategically important customers by driving product requirements through engineering Demand Analyst Intel Corporation July 2007  –  September 2010  (3 years 3 months) Chandler, AZ / Folsom, CA / Santa Clara, CA •\tAdvised executive management on capacity planning and recommended capital investment strategies \n•\tDeveloped the notebook long-range plans and secured buy-in from executive management \n•\tInfluenced multiple corporate strategic decisions by performing and leveraging data-driven analyses \n•\tImproved demand planning models for forecasting demand and simulating demand scenarios while maximizing efficiency Demand Analyst Intel Corporation July 2007  –  September 2010  (3 years 3 months) Chandler, AZ / Folsom, CA / Santa Clara, CA •\tAdvised executive management on capacity planning and recommended capital investment strategies \n•\tDeveloped the notebook long-range plans and secured buy-in from executive management \n•\tInfluenced multiple corporate strategic decisions by performing and leveraging data-driven analyses \n•\tImproved demand planning models for forecasting demand and simulating demand scenarios while maximizing efficiency Finance Manager Intel Corporation April 2006  –  September 2007  (1 year 6 months) Chandler, AZ •\tDrove savings of over $10M by creating a dynamic tool usage model for periods of excess capacity \n•\tRecovered $7M in a 6-month period with a self-funding bonus incentive program Finance Manager Intel Corporation April 2006  –  September 2007  (1 year 6 months) Chandler, AZ •\tDrove savings of over $10M by creating a dynamic tool usage model for periods of excess capacity \n•\tRecovered $7M in a 6-month period with a self-funding bonus incentive program Sr. Financial Analyst Intel Corporation July 2004  –  April 2006  (1 year 10 months) Chandler, AZ •\tManaged a team of 8 analysts to deliver plans and close activities for a factory network with a $1.2 billion/yr budget \n•\tRecaptured over $30 million via tax credits for R&D expenses and tool investments Sr. Financial Analyst Intel Corporation July 2004  –  April 2006  (1 year 10 months) Chandler, AZ •\tManaged a team of 8 analysts to deliver plans and close activities for a factory network with a $1.2 billion/yr budget \n•\tRecaptured over $30 million via tax credits for R&D expenses and tool investments Customer Support Engineer The Boeing Company March 2001  –  August 2002  (1 year 6 months) Kent, WA •\tDesigned technical solutions for issues involving military aircraft systems Customer Support Engineer The Boeing Company March 2001  –  August 2002  (1 year 6 months) Kent, WA •\tDesigned technical solutions for issues involving military aircraft systems Industrial Engineer The Boeing Company June 1999  –  March 2001  (1 year 10 months) Everett, WA •\tConsulted in the development of moving assembly lines for commercial aircraft manufacturing Industrial Engineer The Boeing Company June 1999  –  March 2001  (1 year 10 months) Everett, WA •\tConsulted in the development of moving assembly lines for commercial aircraft manufacturing Languages English English English Skills Top Skills 14 Forecasting 10 Product Marketing 9 Financial Analysis 8 Cross-functional Team... 8 Business Strategy 7 Competitive Analysis 7 Business Planning 6 Pricing 5 Strategic Planning 4 Analysis Matthew also knows about... 4 Finance 3 Semiconductors 3 Financial Modeling 3 Business Intelligence 3 Mobile Devices 2 Process Improvement 2 Product Management 2 Budgets 2 Management 2 Program Management 1 Marketing Strategy 1 Marketing 0 Analytics 0 Leadership 0 Project Planning 0 Manufacturing See 1+     See less Skills  Top Skills 14 Forecasting 10 Product Marketing 9 Financial Analysis 8 Cross-functional Team... 8 Business Strategy 7 Competitive Analysis 7 Business Planning 6 Pricing 5 Strategic Planning 4 Analysis Matthew also knows about... 4 Finance 3 Semiconductors 3 Financial Modeling 3 Business Intelligence 3 Mobile Devices 2 Process Improvement 2 Product Management 2 Budgets 2 Management 2 Program Management 1 Marketing Strategy 1 Marketing 0 Analytics 0 Leadership 0 Project Planning 0 Manufacturing See 1+     See less Top Skills 14 Forecasting 10 Product Marketing 9 Financial Analysis 8 Cross-functional Team... 8 Business Strategy 7 Competitive Analysis 7 Business Planning 6 Pricing 5 Strategic Planning 4 Analysis Matthew also knows about... 4 Finance 3 Semiconductors 3 Financial Modeling 3 Business Intelligence 3 Mobile Devices 2 Process Improvement 2 Product Management 2 Budgets 2 Management 2 Program Management 1 Marketing Strategy 1 Marketing 0 Analytics 0 Leadership 0 Project Planning 0 Manufacturing See 1+     See less Top Skills 14 Forecasting 10 Product Marketing 9 Financial Analysis 8 Cross-functional Team... 8 Business Strategy 7 Competitive Analysis 7 Business Planning 6 Pricing 5 Strategic Planning 4 Analysis Matthew also knows about... 4 Finance 3 Semiconductors 3 Financial Modeling 3 Business Intelligence 3 Mobile Devices 2 Process Improvement 2 Product Management 2 Budgets 2 Management 2 Program Management 1 Marketing Strategy 1 Marketing 0 Analytics 0 Leadership 0 Project Planning 0 Manufacturing See 1+     See less                     4 Finance 3 Semiconductors 3 Financial Modeling 3 Business Intelligence 3 Mobile Devices 2 Process Improvement 2 Product Management 2 Budgets 2 Management 2 Program Management 1 Marketing Strategy 1 Marketing 0 Analytics 0 Leadership 0 Project Planning 0 Manufacturing Education Indiana University - Kelley School of Business Master of Business Administration (M.B.A.),  Finance 2002  – 2004 College of Engineering, University of Washington Bachelor of Science (B.S.),  Industrial Engineering 1995  – 1999 Indiana University - Kelley School of Business Master of Business Administration (M.B.A.),  Finance 2002  – 2004 Indiana University - Kelley School of Business Master of Business Administration (M.B.A.),  Finance 2002  – 2004 Indiana University - Kelley School of Business Master of Business Administration (M.B.A.),  Finance 2002  – 2004 College of Engineering, University of Washington Bachelor of Science (B.S.),  Industrial Engineering 1995  – 1999 College of Engineering, University of Washington Bachelor of Science (B.S.),  Industrial Engineering 1995  – 1999 College of Engineering, University of Washington Bachelor of Science (B.S.),  Industrial Engineering 1995  – 1999 ", "Experience Direct Price Process & Global Rebates Practices Manager Intel Corporation November 2011  – Present (3 years 10 months) Folsom, CA Rebate Analyst Intel Corporation June 2010  –  November 2011  (1 year 6 months) Folsom, CA Supply & Demand Analyst Intel Corporation May 2005  –  June 2010  (5 years 2 months) Direct Price Process & Global Rebates Practices Manager Intel Corporation November 2011  – Present (3 years 10 months) Folsom, CA Direct Price Process & Global Rebates Practices Manager Intel Corporation November 2011  – Present (3 years 10 months) Folsom, CA Rebate Analyst Intel Corporation June 2010  –  November 2011  (1 year 6 months) Folsom, CA Rebate Analyst Intel Corporation June 2010  –  November 2011  (1 year 6 months) Folsom, CA Supply & Demand Analyst Intel Corporation May 2005  –  June 2010  (5 years 2 months) Supply & Demand Analyst Intel Corporation May 2005  –  June 2010  (5 years 2 months) Skills Top Skills 10 Microsoft Excel 5 Forecasting 4 PowerPoint 4 Analytics 4 Process Improvement 4 Pricing 4 Management 3 Data Analysis 3 Program Management 3 Business Analysis Megan also knows about... 3 Project Management 3 Cross-functional Team... 2 Competitive Analysis 2 Business Strategy 2 Product Management 2 Product Marketing 1 Excel 1 Strategic Planning Skills  Top Skills 10 Microsoft Excel 5 Forecasting 4 PowerPoint 4 Analytics 4 Process Improvement 4 Pricing 4 Management 3 Data Analysis 3 Program Management 3 Business Analysis Megan also knows about... 3 Project Management 3 Cross-functional Team... 2 Competitive Analysis 2 Business Strategy 2 Product Management 2 Product Marketing 1 Excel 1 Strategic Planning Top Skills 10 Microsoft Excel 5 Forecasting 4 PowerPoint 4 Analytics 4 Process Improvement 4 Pricing 4 Management 3 Data Analysis 3 Program Management 3 Business Analysis Megan also knows about... 3 Project Management 3 Cross-functional Team... 2 Competitive Analysis 2 Business Strategy 2 Product Management 2 Product Marketing 1 Excel 1 Strategic Planning Top Skills 10 Microsoft Excel 5 Forecasting 4 PowerPoint 4 Analytics 4 Process Improvement 4 Pricing 4 Management 3 Data Analysis 3 Program Management 3 Business Analysis Megan also knows about... 3 Project Management 3 Cross-functional Team... 2 Competitive Analysis 2 Business Strategy 2 Product Management 2 Product Marketing 1 Excel 1 Strategic Planning                     3 Project Management 3 Cross-functional Team... 2 Competitive Analysis 2 Business Strategy 2 Product Management 2 Product Marketing 1 Excel 1 Strategic Planning Education University of California, Davis BS,  Managerial Economics 1999  – 2004 Activities and Societies:  Kappa Alpha Theta\nUC Davis Volleyball Club team\nWhite Water Rafting Guide\nOn-Campus Coffee House Supervisor University of California, Davis BS,  Managerial Economics 1999  – 2004 Activities and Societies:  Kappa Alpha Theta\nUC Davis Volleyball Club team\nWhite Water Rafting Guide\nOn-Campus Coffee House Supervisor University of California, Davis BS,  Managerial Economics 1999  – 2004 Activities and Societies:  Kappa Alpha Theta\nUC Davis Volleyball Club team\nWhite Water Rafting Guide\nOn-Campus Coffee House Supervisor University of California, Davis BS,  Managerial Economics 1999  – 2004 Activities and Societies:  Kappa Alpha Theta\nUC Davis Volleyball Club team\nWhite Water Rafting Guide\nOn-Campus Coffee House Supervisor ", "Experience Supply/Demand Analyst Intel March 2006  – Present (9 years 6 months) Service Parts Planner InFocus March 2005  –  February 2006  (1 year) Senior Industrial Engineer LSI Logic March 1998  –  January 2005  (6 years 11 months) Supply/Demand Analyst Intel March 2006  – Present (9 years 6 months) Supply/Demand Analyst Intel March 2006  – Present (9 years 6 months) Service Parts Planner InFocus March 2005  –  February 2006  (1 year) Service Parts Planner InFocus March 2005  –  February 2006  (1 year) Senior Industrial Engineer LSI Logic March 1998  –  January 2005  (6 years 11 months) Senior Industrial Engineer LSI Logic March 1998  –  January 2005  (6 years 11 months) Skills Skills     Education University of Wisconsin-Madison MS,  Industrial Engineering 1996  – 1998 Bilkent University BS,  Industrial Engineering 1992  – 1996 University of Wisconsin-Madison MS,  Industrial Engineering 1996  – 1998 University of Wisconsin-Madison MS,  Industrial Engineering 1996  – 1998 University of Wisconsin-Madison MS,  Industrial Engineering 1996  – 1998 Bilkent University BS,  Industrial Engineering 1992  – 1996 Bilkent University BS,  Industrial Engineering 1992  – 1996 Bilkent University BS,  Industrial Engineering 1992  – 1996 ", "Experience Senior Vice President Jefferies LLC December 2013  – Present (1 year 9 months) foster city, ca Vice President Jefferies & Company January 2011  –  December 2013  (3 years) Silicon Valley, CA Associate Jefferies & Company August 2007  –  January 2011  (3 years 6 months) New York, NY Finance Intern Game Trust Inc, New York, US June 2006  –  August 2006  (3 months) New York, NY Server and Workstation Supply/Demand Manager Intel Corporation October 2003  –  July 2005  (1 year 10 months) Santa Clara, CA Supply/Demand Analyst Intel Corporation August 2002  –  October 2003  (1 year 3 months) Santa Clara, CA Senior Vice President Jefferies LLC December 2013  – Present (1 year 9 months) foster city, ca Senior Vice President Jefferies LLC December 2013  – Present (1 year 9 months) foster city, ca Vice President Jefferies & Company January 2011  –  December 2013  (3 years) Silicon Valley, CA Vice President Jefferies & Company January 2011  –  December 2013  (3 years) Silicon Valley, CA Associate Jefferies & Company August 2007  –  January 2011  (3 years 6 months) New York, NY Associate Jefferies & Company August 2007  –  January 2011  (3 years 6 months) New York, NY Finance Intern Game Trust Inc, New York, US June 2006  –  August 2006  (3 months) New York, NY Finance Intern Game Trust Inc, New York, US June 2006  –  August 2006  (3 months) New York, NY Server and Workstation Supply/Demand Manager Intel Corporation October 2003  –  July 2005  (1 year 10 months) Santa Clara, CA Server and Workstation Supply/Demand Manager Intel Corporation October 2003  –  July 2005  (1 year 10 months) Santa Clara, CA Supply/Demand Analyst Intel Corporation August 2002  –  October 2003  (1 year 3 months) Santa Clara, CA Supply/Demand Analyst Intel Corporation August 2002  –  October 2003  (1 year 3 months) Santa Clara, CA Skills Top Skills 15 Investment Banking 13 Financial Modeling 11 Finance 9 Business Strategy 8 Private Equity 7 IPO 6 Mergers & Acquisitions 4 M&A execution 1 Debt 1 Supply Chain Management Christopher also knows about... 0 M&A Advisory Services 0 Strategic M&A 0 Demand Forecasting Skills  Top Skills 15 Investment Banking 13 Financial Modeling 11 Finance 9 Business Strategy 8 Private Equity 7 IPO 6 Mergers & Acquisitions 4 M&A execution 1 Debt 1 Supply Chain Management Christopher also knows about... 0 M&A Advisory Services 0 Strategic M&A 0 Demand Forecasting Top Skills 15 Investment Banking 13 Financial Modeling 11 Finance 9 Business Strategy 8 Private Equity 7 IPO 6 Mergers & Acquisitions 4 M&A execution 1 Debt 1 Supply Chain Management Christopher also knows about... 0 M&A Advisory Services 0 Strategic M&A 0 Demand Forecasting Top Skills 15 Investment Banking 13 Financial Modeling 11 Finance 9 Business Strategy 8 Private Equity 7 IPO 6 Mergers & Acquisitions 4 M&A execution 1 Debt 1 Supply Chain Management Christopher also knows about... 0 M&A Advisory Services 0 Strategic M&A 0 Demand Forecasting                     0 M&A Advisory Services 0 Strategic M&A 0 Demand Forecasting Education Harvard Business School MBA 2005  – 2007 Stanford University Bachelor of Science (BS) 1998  – 2002 Harvard Business School MBA 2005  – 2007 Harvard Business School MBA 2005  – 2007 Harvard Business School MBA 2005  – 2007 Stanford University Bachelor of Science (BS) 1998  – 2002 Stanford University Bachelor of Science (BS) 1998  – 2002 Stanford University Bachelor of Science (BS) 1998  – 2002 ", "Summary I am a Supply Demand Analyst in Intel’s CPU Supply Demand Planning Organization where I have held almost every available Planning position over the last 8 years. My organization is responsible for scheduling the production of Intel’s FAB and Assembly Test sites around the world by considering demand and developing inventory strategies to suit the business environments of our markets.  \n \nHolding roles including Supply Demand Analyst, Business Planner, Team Manager, Supply Analyst, and Lead Planner, I have worked with Intel’s factories on supply and quality issues, with sales and marketing on demand and inventory forecasts, with engineers on product health forecasts, and with finance on inventory control. And in this work my key contribution has been to develop tools, systems, and processes to support the work of my organization so that each interaction in the future becomes easier and more productive. \n \nI have a BS in Business Administration and an MBA focused on Global Supply Chain Management. Before earning my MBA I was a production manager at a service company then I spent two years in the Peace Corps as a Small Business Development volunteer. \n \nI am focused on continuous improvement, I constantly assess our planning systems and tools and initiate improvements. I am result oriented, I understand the business and prioritize my work appropriately to maximize my contributions. I am a strong team member, I have demonstrated the ability to lead a team through multiple challenges. I have a positive attitude and strong trust across my organization. Summary I am a Supply Demand Analyst in Intel’s CPU Supply Demand Planning Organization where I have held almost every available Planning position over the last 8 years. My organization is responsible for scheduling the production of Intel’s FAB and Assembly Test sites around the world by considering demand and developing inventory strategies to suit the business environments of our markets.  \n \nHolding roles including Supply Demand Analyst, Business Planner, Team Manager, Supply Analyst, and Lead Planner, I have worked with Intel’s factories on supply and quality issues, with sales and marketing on demand and inventory forecasts, with engineers on product health forecasts, and with finance on inventory control. And in this work my key contribution has been to develop tools, systems, and processes to support the work of my organization so that each interaction in the future becomes easier and more productive. \n \nI have a BS in Business Administration and an MBA focused on Global Supply Chain Management. Before earning my MBA I was a production manager at a service company then I spent two years in the Peace Corps as a Small Business Development volunteer. \n \nI am focused on continuous improvement, I constantly assess our planning systems and tools and initiate improvements. I am result oriented, I understand the business and prioritize my work appropriately to maximize my contributions. I am a strong team member, I have demonstrated the ability to lead a team through multiple challenges. I have a positive attitude and strong trust across my organization. I am a Supply Demand Analyst in Intel’s CPU Supply Demand Planning Organization where I have held almost every available Planning position over the last 8 years. My organization is responsible for scheduling the production of Intel’s FAB and Assembly Test sites around the world by considering demand and developing inventory strategies to suit the business environments of our markets.  \n \nHolding roles including Supply Demand Analyst, Business Planner, Team Manager, Supply Analyst, and Lead Planner, I have worked with Intel’s factories on supply and quality issues, with sales and marketing on demand and inventory forecasts, with engineers on product health forecasts, and with finance on inventory control. And in this work my key contribution has been to develop tools, systems, and processes to support the work of my organization so that each interaction in the future becomes easier and more productive. \n \nI have a BS in Business Administration and an MBA focused on Global Supply Chain Management. Before earning my MBA I was a production manager at a service company then I spent two years in the Peace Corps as a Small Business Development volunteer. \n \nI am focused on continuous improvement, I constantly assess our planning systems and tools and initiate improvements. I am result oriented, I understand the business and prioritize my work appropriately to maximize my contributions. I am a strong team member, I have demonstrated the ability to lead a team through multiple challenges. I have a positive attitude and strong trust across my organization. I am a Supply Demand Analyst in Intel’s CPU Supply Demand Planning Organization where I have held almost every available Planning position over the last 8 years. My organization is responsible for scheduling the production of Intel’s FAB and Assembly Test sites around the world by considering demand and developing inventory strategies to suit the business environments of our markets.  \n \nHolding roles including Supply Demand Analyst, Business Planner, Team Manager, Supply Analyst, and Lead Planner, I have worked with Intel’s factories on supply and quality issues, with sales and marketing on demand and inventory forecasts, with engineers on product health forecasts, and with finance on inventory control. And in this work my key contribution has been to develop tools, systems, and processes to support the work of my organization so that each interaction in the future becomes easier and more productive. \n \nI have a BS in Business Administration and an MBA focused on Global Supply Chain Management. Before earning my MBA I was a production manager at a service company then I spent two years in the Peace Corps as a Small Business Development volunteer. \n \nI am focused on continuous improvement, I constantly assess our planning systems and tools and initiate improvements. I am result oriented, I understand the business and prioritize my work appropriately to maximize my contributions. I am a strong team member, I have demonstrated the ability to lead a team through multiple challenges. I have a positive attitude and strong trust across my organization. Experience Supply Demand Analyst Intel Corporation January 2013  – Present (2 years 8 months) Managing Intel’s 32nm wafer start loadings through coordination with manufacturing, planning, finance, and marketing Senior Business Planner; IASDO Intel Corporation January 2011  –  December 2012  (2 years) Santa Clara, California Supported Haswell / Crystal Well NPI activities including risk analysis, product setup, and supply planning \n \nSupported the Ivybridge introduction and volume ramp including 4 SKU risk assessment cycles, demand forecasting, FAB wafer conversions, product setups, build plan management and weekly customer request assessment and support \n \nChaired weekly meeting to align Planning, Marketing, Finance, and FAB strategies across the CPU product line Chipsets Supply Analyst Rotation, Supply Demand Alignment Team; IASDO Intel Corporation April 2010  –  December 2010  (9 months) Santa Clara, California Managed aging products as their product lines approached end of life which required great care in planning to avoid excess or shortage. Represented products in forums with FAB, Marketing and Planning management monthly \n \nIdentified Chipset processes valuable for CPU to adopt. Implemented project to develop, pilot, and launch CPU process using Lean methodologies Team Manager Coverage, IA Planning; IASDO Intel Corporation March 2008  –  December 2008  (10 months) Santa Clara, California Supported extended team manager coverage on the Merom and Atom teams, managed 8 employees during multiple quality issues, constrained periods and resource transitions \n \nCoordinated with FAB and AT to align build plans throughout the year considering FAB and AT capacity constraints  \n \nEmphasized strong customer support with willingness to take calculated risks in order to say ‘yes’ to customers. Cited with team for helping Intel win a prestigious supplier award from Lenovo \n \nRecognized by team for open, honest and constructive attitude. Actively encouraged individuals and teams to go beyond their specific duties and look for Lean opportunities to improve the departments systems and tools Business Planner, Team Lead IASDO Intel Corporation January 2005  –  February 2008  (3 years 2 months) Santa Clara, California Managed the factory build plans of Intel products on the Server, Desktop, Mobile, and Atom platforms holding Business Planner, Die Planner, and Product Supply Planner roles. Managed products during multiple conversions, quality issues, substrate/ capacity/ die constraints, Quarter End Revenue Optimization strategies, and new product launches \n \nImplemented improvements to the CPU FG Inventory Health metric aligning it closely to CPU Planning systems to allow more timely data availability and easier data reconciliation \n \nCoordinated the Cavite and Pudong warehouse closure for Division Planning which entailed the disposition of ~11M CPU’s Program Analysit Internship U.S. Department of State June 2004  –  August 2004  (3 months) Washington D.C. Metro Area 3 month internship in the Center for Administrative Excellence Small Business Development Volunteer Peace Corps May 2000  –  August 2002  (2 years 4 months) Designed and taught Business Principles courses to 75 small business owners and 15 secondary school students \n \nCounseled 10 small business owners to develop and improve their business practices and operations \n \nTrained 40 professors and 50 international aid workers to teach business skills to students and business owners Production Planner Sourcecorp November 1998  –  May 2000  (1 year 7 months) Managed the daily operations of over 100 employees across 10 departments.  \n \nScheduled all the daily work, deliveries and pickups for over 25 clients, adjusted employee and machine assignments to assure on-time delivery \n \nDeveloped procedures and an instructional training manual, then trained 57 employees over two months to use scanners and scanning software in order to assure a smooth transition from filming to scanning \n \nWorked directly with the sales team and individual clients to customize and improve products and services  \n \nPlanned and managed a special project involving the successful prepping, scanning, indexing and filing of 10,000 boxes of loan files in a 4 week period Supply Demand Analyst Intel Corporation January 2013  – Present (2 years 8 months) Managing Intel’s 32nm wafer start loadings through coordination with manufacturing, planning, finance, and marketing Supply Demand Analyst Intel Corporation January 2013  – Present (2 years 8 months) Managing Intel’s 32nm wafer start loadings through coordination with manufacturing, planning, finance, and marketing Senior Business Planner; IASDO Intel Corporation January 2011  –  December 2012  (2 years) Santa Clara, California Supported Haswell / Crystal Well NPI activities including risk analysis, product setup, and supply planning \n \nSupported the Ivybridge introduction and volume ramp including 4 SKU risk assessment cycles, demand forecasting, FAB wafer conversions, product setups, build plan management and weekly customer request assessment and support \n \nChaired weekly meeting to align Planning, Marketing, Finance, and FAB strategies across the CPU product line Senior Business Planner; IASDO Intel Corporation January 2011  –  December 2012  (2 years) Santa Clara, California Supported Haswell / Crystal Well NPI activities including risk analysis, product setup, and supply planning \n \nSupported the Ivybridge introduction and volume ramp including 4 SKU risk assessment cycles, demand forecasting, FAB wafer conversions, product setups, build plan management and weekly customer request assessment and support \n \nChaired weekly meeting to align Planning, Marketing, Finance, and FAB strategies across the CPU product line Chipsets Supply Analyst Rotation, Supply Demand Alignment Team; IASDO Intel Corporation April 2010  –  December 2010  (9 months) Santa Clara, California Managed aging products as their product lines approached end of life which required great care in planning to avoid excess or shortage. Represented products in forums with FAB, Marketing and Planning management monthly \n \nIdentified Chipset processes valuable for CPU to adopt. Implemented project to develop, pilot, and launch CPU process using Lean methodologies Chipsets Supply Analyst Rotation, Supply Demand Alignment Team; IASDO Intel Corporation April 2010  –  December 2010  (9 months) Santa Clara, California Managed aging products as their product lines approached end of life which required great care in planning to avoid excess or shortage. Represented products in forums with FAB, Marketing and Planning management monthly \n \nIdentified Chipset processes valuable for CPU to adopt. Implemented project to develop, pilot, and launch CPU process using Lean methodologies Team Manager Coverage, IA Planning; IASDO Intel Corporation March 2008  –  December 2008  (10 months) Santa Clara, California Supported extended team manager coverage on the Merom and Atom teams, managed 8 employees during multiple quality issues, constrained periods and resource transitions \n \nCoordinated with FAB and AT to align build plans throughout the year considering FAB and AT capacity constraints  \n \nEmphasized strong customer support with willingness to take calculated risks in order to say ‘yes’ to customers. Cited with team for helping Intel win a prestigious supplier award from Lenovo \n \nRecognized by team for open, honest and constructive attitude. Actively encouraged individuals and teams to go beyond their specific duties and look for Lean opportunities to improve the departments systems and tools Team Manager Coverage, IA Planning; IASDO Intel Corporation March 2008  –  December 2008  (10 months) Santa Clara, California Supported extended team manager coverage on the Merom and Atom teams, managed 8 employees during multiple quality issues, constrained periods and resource transitions \n \nCoordinated with FAB and AT to align build plans throughout the year considering FAB and AT capacity constraints  \n \nEmphasized strong customer support with willingness to take calculated risks in order to say ‘yes’ to customers. Cited with team for helping Intel win a prestigious supplier award from Lenovo \n \nRecognized by team for open, honest and constructive attitude. Actively encouraged individuals and teams to go beyond their specific duties and look for Lean opportunities to improve the departments systems and tools Business Planner, Team Lead IASDO Intel Corporation January 2005  –  February 2008  (3 years 2 months) Santa Clara, California Managed the factory build plans of Intel products on the Server, Desktop, Mobile, and Atom platforms holding Business Planner, Die Planner, and Product Supply Planner roles. Managed products during multiple conversions, quality issues, substrate/ capacity/ die constraints, Quarter End Revenue Optimization strategies, and new product launches \n \nImplemented improvements to the CPU FG Inventory Health metric aligning it closely to CPU Planning systems to allow more timely data availability and easier data reconciliation \n \nCoordinated the Cavite and Pudong warehouse closure for Division Planning which entailed the disposition of ~11M CPU’s Business Planner, Team Lead IASDO Intel Corporation January 2005  –  February 2008  (3 years 2 months) Santa Clara, California Managed the factory build plans of Intel products on the Server, Desktop, Mobile, and Atom platforms holding Business Planner, Die Planner, and Product Supply Planner roles. Managed products during multiple conversions, quality issues, substrate/ capacity/ die constraints, Quarter End Revenue Optimization strategies, and new product launches \n \nImplemented improvements to the CPU FG Inventory Health metric aligning it closely to CPU Planning systems to allow more timely data availability and easier data reconciliation \n \nCoordinated the Cavite and Pudong warehouse closure for Division Planning which entailed the disposition of ~11M CPU’s Program Analysit Internship U.S. Department of State June 2004  –  August 2004  (3 months) Washington D.C. Metro Area 3 month internship in the Center for Administrative Excellence Program Analysit Internship U.S. Department of State June 2004  –  August 2004  (3 months) Washington D.C. Metro Area 3 month internship in the Center for Administrative Excellence Small Business Development Volunteer Peace Corps May 2000  –  August 2002  (2 years 4 months) Designed and taught Business Principles courses to 75 small business owners and 15 secondary school students \n \nCounseled 10 small business owners to develop and improve their business practices and operations \n \nTrained 40 professors and 50 international aid workers to teach business skills to students and business owners Small Business Development Volunteer Peace Corps May 2000  –  August 2002  (2 years 4 months) Designed and taught Business Principles courses to 75 small business owners and 15 secondary school students \n \nCounseled 10 small business owners to develop and improve their business practices and operations \n \nTrained 40 professors and 50 international aid workers to teach business skills to students and business owners Production Planner Sourcecorp November 1998  –  May 2000  (1 year 7 months) Managed the daily operations of over 100 employees across 10 departments.  \n \nScheduled all the daily work, deliveries and pickups for over 25 clients, adjusted employee and machine assignments to assure on-time delivery \n \nDeveloped procedures and an instructional training manual, then trained 57 employees over two months to use scanners and scanning software in order to assure a smooth transition from filming to scanning \n \nWorked directly with the sales team and individual clients to customize and improve products and services  \n \nPlanned and managed a special project involving the successful prepping, scanning, indexing and filing of 10,000 boxes of loan files in a 4 week period Production Planner Sourcecorp November 1998  –  May 2000  (1 year 7 months) Managed the daily operations of over 100 employees across 10 departments.  \n \nScheduled all the daily work, deliveries and pickups for over 25 clients, adjusted employee and machine assignments to assure on-time delivery \n \nDeveloped procedures and an instructional training manual, then trained 57 employees over two months to use scanners and scanning software in order to assure a smooth transition from filming to scanning \n \nWorked directly with the sales team and individual clients to customize and improve products and services  \n \nPlanned and managed a special project involving the successful prepping, scanning, indexing and filing of 10,000 boxes of loan files in a 4 week period Languages Spanish Spanish Spanish Skills Top Skills 11 Supply Chain Management 7 Cross-functional Team... 7 Process Improvement 6 Product Management 4 Management 3 Product Development 3 Forecasting 2 Business Process... 2 Operations Management 2 Product Marketing Greg also knows about... 1 SAP 1 Project Management 1 Analysis 1 Training 1 Start-ups 1 Mobile Devices 1 Manufacturing 1 Business Planning 1 Team Leadership 1 Organizational... 1 MS Project 1 Supply Chain... 1 Continuous Improvement 1 Strategic Financial... 1 Marketing 1 Business Intelligence 1 Project Planning 1 Lean Manufacturing 1 Process Engineering 1 Go-to-market Strategy 1 Strategic Partnerships 1 Change Management 1 Six Sigma 1 Finance 1 Data Analysis 1 Supply Management 1 Semiconductors 1 Entrepreneurship 1 Analytics 1 Budgets 1 Leadership 0 Strategic Planning See 17+     See less Skills  Top Skills 11 Supply Chain Management 7 Cross-functional Team... 7 Process Improvement 6 Product Management 4 Management 3 Product Development 3 Forecasting 2 Business Process... 2 Operations Management 2 Product Marketing Greg also knows about... 1 SAP 1 Project Management 1 Analysis 1 Training 1 Start-ups 1 Mobile Devices 1 Manufacturing 1 Business Planning 1 Team Leadership 1 Organizational... 1 MS Project 1 Supply Chain... 1 Continuous Improvement 1 Strategic Financial... 1 Marketing 1 Business Intelligence 1 Project Planning 1 Lean Manufacturing 1 Process Engineering 1 Go-to-market Strategy 1 Strategic Partnerships 1 Change Management 1 Six Sigma 1 Finance 1 Data Analysis 1 Supply Management 1 Semiconductors 1 Entrepreneurship 1 Analytics 1 Budgets 1 Leadership 0 Strategic Planning See 17+     See less Top Skills 11 Supply Chain Management 7 Cross-functional Team... 7 Process Improvement 6 Product Management 4 Management 3 Product Development 3 Forecasting 2 Business Process... 2 Operations Management 2 Product Marketing Greg also knows about... 1 SAP 1 Project Management 1 Analysis 1 Training 1 Start-ups 1 Mobile Devices 1 Manufacturing 1 Business Planning 1 Team Leadership 1 Organizational... 1 MS Project 1 Supply Chain... 1 Continuous Improvement 1 Strategic Financial... 1 Marketing 1 Business Intelligence 1 Project Planning 1 Lean Manufacturing 1 Process Engineering 1 Go-to-market Strategy 1 Strategic Partnerships 1 Change Management 1 Six Sigma 1 Finance 1 Data Analysis 1 Supply Management 1 Semiconductors 1 Entrepreneurship 1 Analytics 1 Budgets 1 Leadership 0 Strategic Planning See 17+     See less Top Skills 11 Supply Chain Management 7 Cross-functional Team... 7 Process Improvement 6 Product Management 4 Management 3 Product Development 3 Forecasting 2 Business Process... 2 Operations Management 2 Product Marketing Greg also knows about... 1 SAP 1 Project Management 1 Analysis 1 Training 1 Start-ups 1 Mobile Devices 1 Manufacturing 1 Business Planning 1 Team Leadership 1 Organizational... 1 MS Project 1 Supply Chain... 1 Continuous Improvement 1 Strategic Financial... 1 Marketing 1 Business Intelligence 1 Project Planning 1 Lean Manufacturing 1 Process Engineering 1 Go-to-market Strategy 1 Strategic Partnerships 1 Change Management 1 Six Sigma 1 Finance 1 Data Analysis 1 Supply Management 1 Semiconductors 1 Entrepreneurship 1 Analytics 1 Budgets 1 Leadership 0 Strategic Planning See 17+     See less                     1 SAP 1 Project Management 1 Analysis 1 Training 1 Start-ups 1 Mobile Devices 1 Manufacturing 1 Business Planning 1 Team Leadership 1 Organizational... 1 MS Project 1 Supply Chain... 1 Continuous Improvement 1 Strategic Financial... 1 Marketing 1 Business Intelligence 1 Project Planning 1 Lean Manufacturing 1 Process Engineering 1 Go-to-market Strategy 1 Strategic Partnerships 1 Change Management 1 Six Sigma 1 Finance 1 Data Analysis 1 Supply Management 1 Semiconductors 1 Entrepreneurship 1 Analytics 1 Budgets 1 Leadership 0 Strategic Planning Education Thunderbird School of Global Management MBA,  Supply Chain Management 2003  – 2004 CSU Long Beach Bachelor of Science (BS),  Business Administration ,  Management and Operations 1995  – 1998 Thunderbird School of Global Management MBA,  Supply Chain Management 2003  – 2004 Thunderbird School of Global Management MBA,  Supply Chain Management 2003  – 2004 Thunderbird School of Global Management MBA,  Supply Chain Management 2003  – 2004 CSU Long Beach Bachelor of Science (BS),  Business Administration ,  Management and Operations 1995  – 1998 CSU Long Beach Bachelor of Science (BS),  Business Administration ,  Management and Operations 1995  – 1998 CSU Long Beach Bachelor of Science (BS),  Business Administration ,  Management and Operations 1995  – 1998 ", "Summary 14 years expertise in Supply Chain management and my portfolio covers product forecasting, planning, stock management and customer service.  \n \nMy love to work with people and the immense interests I gathered understanding changing trends and technologies enabled me to produce high-standard forecasts resulting in reduced parts redundancy which kept my good performance with Intel through the years. Summary 14 years expertise in Supply Chain management and my portfolio covers product forecasting, planning, stock management and customer service.  \n \nMy love to work with people and the immense interests I gathered understanding changing trends and technologies enabled me to produce high-standard forecasts resulting in reduced parts redundancy which kept my good performance with Intel through the years. 14 years expertise in Supply Chain management and my portfolio covers product forecasting, planning, stock management and customer service.  \n \nMy love to work with people and the immense interests I gathered understanding changing trends and technologies enabled me to produce high-standard forecasts resulting in reduced parts redundancy which kept my good performance with Intel through the years. 14 years expertise in Supply Chain management and my portfolio covers product forecasting, planning, stock management and customer service.  \n \nMy love to work with people and the immense interests I gathered understanding changing trends and technologies enabled me to produce high-standard forecasts resulting in reduced parts redundancy which kept my good performance with Intel through the years. Experience Supply Chain Analyst Avago Technologies Limited April 2015  – Present (5 months) Demand Analyst Altera April 2014  –  April 2015  (1 year 1 month) Supply Planning Analyst Intel Corporation July 2007  –  December 2012  (5 years 6 months) Supply Demand Analyst Intel Corporation February 2006  –  July 2007  (1 year 6 months) Supply Demand Analyst Intel Corporation March 2002  –  January 2006  (3 years 11 months) Customer Service Planner Intel Corporation February 1999  –  February 2002  (3 years 1 month) Supply Chain Analyst Avago Technologies Limited April 2015  – Present (5 months) Supply Chain Analyst Avago Technologies Limited April 2015  – Present (5 months) Demand Analyst Altera April 2014  –  April 2015  (1 year 1 month) Demand Analyst Altera April 2014  –  April 2015  (1 year 1 month) Supply Planning Analyst Intel Corporation July 2007  –  December 2012  (5 years 6 months) Supply Planning Analyst Intel Corporation July 2007  –  December 2012  (5 years 6 months) Supply Demand Analyst Intel Corporation February 2006  –  July 2007  (1 year 6 months) Supply Demand Analyst Intel Corporation February 2006  –  July 2007  (1 year 6 months) Supply Demand Analyst Intel Corporation March 2002  –  January 2006  (3 years 11 months) Supply Demand Analyst Intel Corporation March 2002  –  January 2006  (3 years 11 months) Customer Service Planner Intel Corporation February 1999  –  February 2002  (3 years 1 month) Customer Service Planner Intel Corporation February 1999  –  February 2002  (3 years 1 month) Languages English, Mandarin, Bahasa Malaysia English, Mandarin, Bahasa Malaysia English, Mandarin, Bahasa Malaysia Skills 0 14 years expertise in... 0 Customer Planning... 0 Supply Demand Analyst 0 Supply Demand Manager 0 Supply Planning Manager Skills  0 14 years expertise in... 0 Customer Planning... 0 Supply Demand Analyst 0 Supply Demand Manager 0 Supply Planning Manager 0 14 years expertise in... 0 Customer Planning... 0 Supply Demand Analyst 0 Supply Demand Manager 0 Supply Planning Manager 0 14 years expertise in... 0 Customer Planning... 0 Supply Demand Analyst 0 Supply Demand Manager 0 Supply Planning Manager           Education Ottawa University Bachelor of Business Administration (BBA) 1998  – 1999 Stamford College Diploma and Advance Diploma in Business Administration 1993  – 1997 Ottawa University Bachelor of Business Administration (BBA) 1998  – 1999 Ottawa University Bachelor of Business Administration (BBA) 1998  – 1999 Ottawa University Bachelor of Business Administration (BBA) 1998  – 1999 Stamford College Diploma and Advance Diploma in Business Administration 1993  – 1997 Stamford College Diploma and Advance Diploma in Business Administration 1993  – 1997 Stamford College Diploma and Advance Diploma in Business Administration 1993  – 1997 ", "Experience Operations Manager Intel Corporation May 2012  – Present (3 years 4 months) Sacramento, California Area Finance Manager Intel Corporation July 2007  –  May 2012  (4 years 11 months) Sacramento, California Area Long-Range Planning Program Manager Intel Corporation January 2006  –  July 2007  (1 year 7 months) Sacramento, California Area Supply Chain & Revenue/Demand Analyst Intel Corporation April 2004  –  January 2006  (1 year 10 months) Sacramento, California Area Director of Finance / Controller - Save Mart Center at Fresno State SMG June 2003  –  April 2004  (11 months) Fresno, California Area Sr Financial Analyst / Project Consultant Stafford Sports,LLC September 1998  –  June 2003  (4 years 10 months) Asst Director - 1998 Goodwill Games - Sports & Facilities Turner Broadcasting September 1996  –  September 1998  (2 years 1 month) Greater New York City Area Asst Manager - Sports Competitions Atlanta Committee for the Olympic Games (ACOG) December 1994  –  September 1996  (1 year 10 months) Greater Atlanta Area Marketing Intern - USA Weightlifting United States Olympic Committee September 1994  –  December 1994  (4 months) Colorado Springs, Colorado Area Operations Manager Intel Corporation May 2012  – Present (3 years 4 months) Sacramento, California Area Operations Manager Intel Corporation May 2012  – Present (3 years 4 months) Sacramento, California Area Finance Manager Intel Corporation July 2007  –  May 2012  (4 years 11 months) Sacramento, California Area Finance Manager Intel Corporation July 2007  –  May 2012  (4 years 11 months) Sacramento, California Area Long-Range Planning Program Manager Intel Corporation January 2006  –  July 2007  (1 year 7 months) Sacramento, California Area Long-Range Planning Program Manager Intel Corporation January 2006  –  July 2007  (1 year 7 months) Sacramento, California Area Supply Chain & Revenue/Demand Analyst Intel Corporation April 2004  –  January 2006  (1 year 10 months) Sacramento, California Area Supply Chain & Revenue/Demand Analyst Intel Corporation April 2004  –  January 2006  (1 year 10 months) Sacramento, California Area Director of Finance / Controller - Save Mart Center at Fresno State SMG June 2003  –  April 2004  (11 months) Fresno, California Area Director of Finance / Controller - Save Mart Center at Fresno State SMG June 2003  –  April 2004  (11 months) Fresno, California Area Sr Financial Analyst / Project Consultant Stafford Sports,LLC September 1998  –  June 2003  (4 years 10 months) Sr Financial Analyst / Project Consultant Stafford Sports,LLC September 1998  –  June 2003  (4 years 10 months) Asst Director - 1998 Goodwill Games - Sports & Facilities Turner Broadcasting September 1996  –  September 1998  (2 years 1 month) Greater New York City Area Asst Director - 1998 Goodwill Games - Sports & Facilities Turner Broadcasting September 1996  –  September 1998  (2 years 1 month) Greater New York City Area Asst Manager - Sports Competitions Atlanta Committee for the Olympic Games (ACOG) December 1994  –  September 1996  (1 year 10 months) Greater Atlanta Area Asst Manager - Sports Competitions Atlanta Committee for the Olympic Games (ACOG) December 1994  –  September 1996  (1 year 10 months) Greater Atlanta Area Marketing Intern - USA Weightlifting United States Olympic Committee September 1994  –  December 1994  (4 months) Colorado Springs, Colorado Area Marketing Intern - USA Weightlifting United States Olympic Committee September 1994  –  December 1994  (4 months) Colorado Springs, Colorado Area Skills Skills     Education University of Georgia - Terry College of Business MBA 2000  – 2001 The University of Georgia M.Ed 1993  – 1994 Penn State University B.S. 1986  – 1990 Upper St Clair HS 1982  – 1986 University of Georgia - Terry College of Business MBA 2000  – 2001 University of Georgia - Terry College of Business MBA 2000  – 2001 University of Georgia - Terry College of Business MBA 2000  – 2001 The University of Georgia M.Ed 1993  – 1994 The University of Georgia M.Ed 1993  – 1994 The University of Georgia M.Ed 1993  – 1994 Penn State University B.S. 1986  – 1990 Penn State University B.S. 1986  – 1990 Penn State University B.S. 1986  – 1990 Upper St Clair HS 1982  – 1986 Upper St Clair HS 1982  – 1986 Upper St Clair HS 1982  – 1986 ", "Experience Controller, Enterprise and High Performance Computing Platform Group, Data Center Group Intel Corporation May 2015  – Present (4 months) Hillsboro, Oregon Controller for the Enterprise IT, High Performance Computing (HPC) and Workstation segments, and the Intel® Xeon Phi™ / Many Integrated Core (MIC) and Intel® True Scale Fabric products. Controller, Technical Computing Group, Data Center and Connected Systems Group Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro, Oregon Controller for the High Performance Computing (HPC) and Workstation segments, and the Intel® Xeon Phi™ / Many Integrated Core (MIC) and Intel® True Scale Fabric products. Technical Computing Finance Specialist, Data Center Group Intel Corporation July 2011  –  December 2012  (1 year 6 months) The DCG Technical Computing Finance Specialist is the domain expert for High Performance Computing (HPC) and Workstation business / computing segments within Intel's Data Center Finance team for Xeon and Xeon Phi / Many Integrated Core (MIC) products. This role directly partners with the Vice President of Technical Computing and his team. This role: \n-Influences pricing and support other aspects of CPU revenue deals with key HPC and Workstation customers. \n-Leads analysis / influence for the market introduction of MIC products, including market sizing and pricing strategies. \n-Develops values and recommendations on long-term strategic investment proposals \n-Evaluates proposed M&A actions applicable to the segment Long Range Business Planning Demand Analyst Intel Corporation June 2010  –  July 2011  (1 year 2 months) Focuses on near-term and long-term road map management, strategic business negotiations, pricing and competitive analysis for the Data Center Group and the Digital Home Group. Responsibilities include long-range demand forecast, influencing key marketing, strategic planning and finance stakeholders, developing crisp communication and presenting to senior management and driving analysis and decision making on market size forecasts, product road maps and segmentation, business strategies, and factory support. Finance Manager / Senior Finance Analyst (FP&A) Intel Corporation May 2006  –  June 2010  (4 years 2 months) Partnered with three General Managers / Vice Presidents in managing employee headcount and spending across two divisions. While leading the semi-annual planning processes identified and implemented changes that improved data quality, accuracy, and timeliness by 25%. Led a strategic long-range planning exercise to produce 5-year Pro-Forma P&L resource-feasible plan with major investment tradeoffs over a 5 year horizon. \nCreated a methodology for prioritization and valuation of leading-edge technologies and managed an internal investment portfolio for three strategic corporate initiatives by collecting and analyzing research related to consumers, industries, and competitors and combining with quantitative and qualitative analysis and financial models, driving key roadmap decisions with senior management. \nWorking with business partners, co-led an effort resulting in improved product margins on a future product by 33%. On another product, led the development of a market model (volume/segment/price) and projected R&D estimates that were vital in allowing senior management, up to the CEO, to make informed decisions about a high-risk strategic program and future product cost. (Open) 2 recommendations Joe Curley Director of Marketing - Data Center Group Brent has the uncommon personal strength to challenge an unexamined majority view that may be wrong, and tje common sense to... View Seshu Ajjarapu Principal, Mergers & Acquisitions, Google, Inc. I worked very closely with Brent for over a year and I highly recommend him for any position that involves analytical rigor,... View Operations Manager / Business Analyst Intel Corporation August 2004  –  May 2006  (1 year 10 months) While directing the day-to-day operations for 30-person Human Resources team, developed multiple, new data warehouse or business intelligence processes, improving communications effectiveness and planning data modeling for analysis and reporting. Also, researched, documented and streamlined (14) internal procedures establishing business continuity. \nCo-led a team that delivered the infrastructure for enterprise blogging and RSS capabilities, including launching the CEO’s blog. Successfully produced an event for the CEO’s retirement resulting in a Divisional Recognition Award. \nAs the Supplier Operations Manager for a factory in Oregon was able to improve invoicing by 50% and merge three programs into a single program, eliminating redundant paperwork and procedure and overhead. While Design Manager, improved the on-time output and performance of the A&E vendor while reducing spending. Project Manager / Engineer / Design Manager Intel Corporation September 1996  –  August 2004  (8 years) As the leader of a large project in Oregon, was able to reduce equipment installation costs by 20% establishing new corporate benchmarks. While leading another equipment installation project in Oregon, executed to 90%+ performance against schedule, with key duration reductions of up to 50%.  \nOn a large project in Colorado, developed an innovative program for equipment start-up testing that met quality goals with 75% less spending and support from vendors. On the same project, implemented a new program that increased on-time performance by 50%. \nDeveloped the Sustaining Construction program for all Colorado-based Intel sites, taking program performance to 94% within 12 months. \nAccomplished two successful new product/process introductions for the corporation. Was chairperson of two corporate-level, virtual factory, cross-geo engineering teams leading to an improvement of 15% in cross-factory matching. Engineering Technician Intel Corporation February 1996  –  September 1996  (8 months) Corporate trainer for Presentation Skills. Identified need for and developed several communication vehicles to employees and co-workers. Routinely selected to train and mentor peers due to a superior ability to learn new tasks and processes quickly. \n \nCreated over 30 procedures to facilitate safe removal of installed equipment. (Open) 1 recommendation Greg Harr Business Process Manager; Corporate Shared Services Accounting at CH2M HILL Brent was over qualified for this position. He was a top performer and utilized this opportunity to develop a network throughout Intel to improve his position upon completion of his degree. He was a great team player, and excelled in his group. View Engineering Watch Supervisor / Engineering Laboratory Technician US Navy January 1987  –  August 1995  (8 years 8 months) Nuclear Power School, Orlando \nS1W Prototype, Idaho \nUSS Long Beach, CGN-9 \nS5G Prototype, Idaho \n \nOn the USS Long Beach (CGN-9) was responsible for the operation and maintenance of nuclear power plants and support equipment. Led the Training / Drill division. Participated in Operation Desert Storm and numerous other deployments. While on board, earned first Navy Achievement Medal and an Admiral’s Letter of Commendation.  \n \nWhile at the Westinghouse Naval Reactors Facility in Idaho Falls (S5G) instructed first–time operators in the safe design, theory, and operation of nuclear power plants and support equipment. Received the second of two Navy Achievement Medals for superior leadership and outstanding performance and ranked in the top 5% of the command. Controller, Enterprise and High Performance Computing Platform Group, Data Center Group Intel Corporation May 2015  – Present (4 months) Hillsboro, Oregon Controller for the Enterprise IT, High Performance Computing (HPC) and Workstation segments, and the Intel® Xeon Phi™ / Many Integrated Core (MIC) and Intel® True Scale Fabric products. Controller, Enterprise and High Performance Computing Platform Group, Data Center Group Intel Corporation May 2015  – Present (4 months) Hillsboro, Oregon Controller for the Enterprise IT, High Performance Computing (HPC) and Workstation segments, and the Intel® Xeon Phi™ / Many Integrated Core (MIC) and Intel® True Scale Fabric products. Controller, Technical Computing Group, Data Center and Connected Systems Group Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro, Oregon Controller for the High Performance Computing (HPC) and Workstation segments, and the Intel® Xeon Phi™ / Many Integrated Core (MIC) and Intel® True Scale Fabric products. Controller, Technical Computing Group, Data Center and Connected Systems Group Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro, Oregon Controller for the High Performance Computing (HPC) and Workstation segments, and the Intel® Xeon Phi™ / Many Integrated Core (MIC) and Intel® True Scale Fabric products. Technical Computing Finance Specialist, Data Center Group Intel Corporation July 2011  –  December 2012  (1 year 6 months) The DCG Technical Computing Finance Specialist is the domain expert for High Performance Computing (HPC) and Workstation business / computing segments within Intel's Data Center Finance team for Xeon and Xeon Phi / Many Integrated Core (MIC) products. This role directly partners with the Vice President of Technical Computing and his team. This role: \n-Influences pricing and support other aspects of CPU revenue deals with key HPC and Workstation customers. \n-Leads analysis / influence for the market introduction of MIC products, including market sizing and pricing strategies. \n-Develops values and recommendations on long-term strategic investment proposals \n-Evaluates proposed M&A actions applicable to the segment Technical Computing Finance Specialist, Data Center Group Intel Corporation July 2011  –  December 2012  (1 year 6 months) The DCG Technical Computing Finance Specialist is the domain expert for High Performance Computing (HPC) and Workstation business / computing segments within Intel's Data Center Finance team for Xeon and Xeon Phi / Many Integrated Core (MIC) products. This role directly partners with the Vice President of Technical Computing and his team. This role: \n-Influences pricing and support other aspects of CPU revenue deals with key HPC and Workstation customers. \n-Leads analysis / influence for the market introduction of MIC products, including market sizing and pricing strategies. \n-Develops values and recommendations on long-term strategic investment proposals \n-Evaluates proposed M&A actions applicable to the segment Long Range Business Planning Demand Analyst Intel Corporation June 2010  –  July 2011  (1 year 2 months) Focuses on near-term and long-term road map management, strategic business negotiations, pricing and competitive analysis for the Data Center Group and the Digital Home Group. Responsibilities include long-range demand forecast, influencing key marketing, strategic planning and finance stakeholders, developing crisp communication and presenting to senior management and driving analysis and decision making on market size forecasts, product road maps and segmentation, business strategies, and factory support. Long Range Business Planning Demand Analyst Intel Corporation June 2010  –  July 2011  (1 year 2 months) Focuses on near-term and long-term road map management, strategic business negotiations, pricing and competitive analysis for the Data Center Group and the Digital Home Group. Responsibilities include long-range demand forecast, influencing key marketing, strategic planning and finance stakeholders, developing crisp communication and presenting to senior management and driving analysis and decision making on market size forecasts, product road maps and segmentation, business strategies, and factory support. Finance Manager / Senior Finance Analyst (FP&A) Intel Corporation May 2006  –  June 2010  (4 years 2 months) Partnered with three General Managers / Vice Presidents in managing employee headcount and spending across two divisions. While leading the semi-annual planning processes identified and implemented changes that improved data quality, accuracy, and timeliness by 25%. Led a strategic long-range planning exercise to produce 5-year Pro-Forma P&L resource-feasible plan with major investment tradeoffs over a 5 year horizon. \nCreated a methodology for prioritization and valuation of leading-edge technologies and managed an internal investment portfolio for three strategic corporate initiatives by collecting and analyzing research related to consumers, industries, and competitors and combining with quantitative and qualitative analysis and financial models, driving key roadmap decisions with senior management. \nWorking with business partners, co-led an effort resulting in improved product margins on a future product by 33%. On another product, led the development of a market model (volume/segment/price) and projected R&D estimates that were vital in allowing senior management, up to the CEO, to make informed decisions about a high-risk strategic program and future product cost. (Open) 2 recommendations Joe Curley Director of Marketing - Data Center Group Brent has the uncommon personal strength to challenge an unexamined majority view that may be wrong, and tje common sense to... View Seshu Ajjarapu Principal, Mergers & Acquisitions, Google, Inc. I worked very closely with Brent for over a year and I highly recommend him for any position that involves analytical rigor,... View Finance Manager / Senior Finance Analyst (FP&A) Intel Corporation May 2006  –  June 2010  (4 years 2 months) Partnered with three General Managers / Vice Presidents in managing employee headcount and spending across two divisions. While leading the semi-annual planning processes identified and implemented changes that improved data quality, accuracy, and timeliness by 25%. Led a strategic long-range planning exercise to produce 5-year Pro-Forma P&L resource-feasible plan with major investment tradeoffs over a 5 year horizon. \nCreated a methodology for prioritization and valuation of leading-edge technologies and managed an internal investment portfolio for three strategic corporate initiatives by collecting and analyzing research related to consumers, industries, and competitors and combining with quantitative and qualitative analysis and financial models, driving key roadmap decisions with senior management. \nWorking with business partners, co-led an effort resulting in improved product margins on a future product by 33%. On another product, led the development of a market model (volume/segment/price) and projected R&D estimates that were vital in allowing senior management, up to the CEO, to make informed decisions about a high-risk strategic program and future product cost. (Open) 2 recommendations Joe Curley Director of Marketing - Data Center Group Brent has the uncommon personal strength to challenge an unexamined majority view that may be wrong, and tje common sense to... View Seshu Ajjarapu Principal, Mergers & Acquisitions, Google, Inc. I worked very closely with Brent for over a year and I highly recommend him for any position that involves analytical rigor,... View Operations Manager / Business Analyst Intel Corporation August 2004  –  May 2006  (1 year 10 months) While directing the day-to-day operations for 30-person Human Resources team, developed multiple, new data warehouse or business intelligence processes, improving communications effectiveness and planning data modeling for analysis and reporting. Also, researched, documented and streamlined (14) internal procedures establishing business continuity. \nCo-led a team that delivered the infrastructure for enterprise blogging and RSS capabilities, including launching the CEO’s blog. Successfully produced an event for the CEO’s retirement resulting in a Divisional Recognition Award. \nAs the Supplier Operations Manager for a factory in Oregon was able to improve invoicing by 50% and merge three programs into a single program, eliminating redundant paperwork and procedure and overhead. While Design Manager, improved the on-time output and performance of the A&E vendor while reducing spending. Operations Manager / Business Analyst Intel Corporation August 2004  –  May 2006  (1 year 10 months) While directing the day-to-day operations for 30-person Human Resources team, developed multiple, new data warehouse or business intelligence processes, improving communications effectiveness and planning data modeling for analysis and reporting. Also, researched, documented and streamlined (14) internal procedures establishing business continuity. \nCo-led a team that delivered the infrastructure for enterprise blogging and RSS capabilities, including launching the CEO’s blog. Successfully produced an event for the CEO’s retirement resulting in a Divisional Recognition Award. \nAs the Supplier Operations Manager for a factory in Oregon was able to improve invoicing by 50% and merge three programs into a single program, eliminating redundant paperwork and procedure and overhead. While Design Manager, improved the on-time output and performance of the A&E vendor while reducing spending. Project Manager / Engineer / Design Manager Intel Corporation September 1996  –  August 2004  (8 years) As the leader of a large project in Oregon, was able to reduce equipment installation costs by 20% establishing new corporate benchmarks. While leading another equipment installation project in Oregon, executed to 90%+ performance against schedule, with key duration reductions of up to 50%.  \nOn a large project in Colorado, developed an innovative program for equipment start-up testing that met quality goals with 75% less spending and support from vendors. On the same project, implemented a new program that increased on-time performance by 50%. \nDeveloped the Sustaining Construction program for all Colorado-based Intel sites, taking program performance to 94% within 12 months. \nAccomplished two successful new product/process introductions for the corporation. Was chairperson of two corporate-level, virtual factory, cross-geo engineering teams leading to an improvement of 15% in cross-factory matching. Project Manager / Engineer / Design Manager Intel Corporation September 1996  –  August 2004  (8 years) As the leader of a large project in Oregon, was able to reduce equipment installation costs by 20% establishing new corporate benchmarks. While leading another equipment installation project in Oregon, executed to 90%+ performance against schedule, with key duration reductions of up to 50%.  \nOn a large project in Colorado, developed an innovative program for equipment start-up testing that met quality goals with 75% less spending and support from vendors. On the same project, implemented a new program that increased on-time performance by 50%. \nDeveloped the Sustaining Construction program for all Colorado-based Intel sites, taking program performance to 94% within 12 months. \nAccomplished two successful new product/process introductions for the corporation. Was chairperson of two corporate-level, virtual factory, cross-geo engineering teams leading to an improvement of 15% in cross-factory matching. Engineering Technician Intel Corporation February 1996  –  September 1996  (8 months) Corporate trainer for Presentation Skills. Identified need for and developed several communication vehicles to employees and co-workers. Routinely selected to train and mentor peers due to a superior ability to learn new tasks and processes quickly. \n \nCreated over 30 procedures to facilitate safe removal of installed equipment. (Open) 1 recommendation Greg Harr Business Process Manager; Corporate Shared Services Accounting at CH2M HILL Brent was over qualified for this position. He was a top performer and utilized this opportunity to develop a network throughout Intel to improve his position upon completion of his degree. He was a great team player, and excelled in his group. View Engineering Technician Intel Corporation February 1996  –  September 1996  (8 months) Corporate trainer for Presentation Skills. Identified need for and developed several communication vehicles to employees and co-workers. Routinely selected to train and mentor peers due to a superior ability to learn new tasks and processes quickly. \n \nCreated over 30 procedures to facilitate safe removal of installed equipment. (Open) 1 recommendation Greg Harr Business Process Manager; Corporate Shared Services Accounting at CH2M HILL Brent was over qualified for this position. He was a top performer and utilized this opportunity to develop a network throughout Intel to improve his position upon completion of his degree. He was a great team player, and excelled in his group. View Engineering Watch Supervisor / Engineering Laboratory Technician US Navy January 1987  –  August 1995  (8 years 8 months) Nuclear Power School, Orlando \nS1W Prototype, Idaho \nUSS Long Beach, CGN-9 \nS5G Prototype, Idaho \n \nOn the USS Long Beach (CGN-9) was responsible for the operation and maintenance of nuclear power plants and support equipment. Led the Training / Drill division. Participated in Operation Desert Storm and numerous other deployments. While on board, earned first Navy Achievement Medal and an Admiral’s Letter of Commendation.  \n \nWhile at the Westinghouse Naval Reactors Facility in Idaho Falls (S5G) instructed first–time operators in the safe design, theory, and operation of nuclear power plants and support equipment. Received the second of two Navy Achievement Medals for superior leadership and outstanding performance and ranked in the top 5% of the command. Engineering Watch Supervisor / Engineering Laboratory Technician US Navy January 1987  –  August 1995  (8 years 8 months) Nuclear Power School, Orlando \nS1W Prototype, Idaho \nUSS Long Beach, CGN-9 \nS5G Prototype, Idaho \n \nOn the USS Long Beach (CGN-9) was responsible for the operation and maintenance of nuclear power plants and support equipment. Led the Training / Drill division. Participated in Operation Desert Storm and numerous other deployments. While on board, earned first Navy Achievement Medal and an Admiral’s Letter of Commendation.  \n \nWhile at the Westinghouse Naval Reactors Facility in Idaho Falls (S5G) instructed first–time operators in the safe design, theory, and operation of nuclear power plants and support equipment. Received the second of two Navy Achievement Medals for superior leadership and outstanding performance and ranked in the top 5% of the command. Skills Top Skills 14 Competitive Analysis 9 Program Management 7 Forecasting 6 Analysis 5 Business Strategy 5 Management 4 Financial Analysis 4 Strategic Planning 4 Semiconductors 3 Engineering Brenton also knows about... 3 Financial Modeling 2 Process Improvement 2 Operations Management 2 Project Planning 2 Project Management 2 Strategy 1 Planning 1 Business Analysis 1 Intel 0 Statistics 0 Pricing 0 Cost 0 Budgeting 0 Problem Solving 0 Contract Negotiation 0 Accounting 0 Business Process... 0 Negotiation 0 Research 0 Corporate Finance 0 Process Engineering 0 Data Analysis 0 Contract Negotiations 0 P&L See 9+     See less Skills  Top Skills 14 Competitive Analysis 9 Program Management 7 Forecasting 6 Analysis 5 Business Strategy 5 Management 4 Financial Analysis 4 Strategic Planning 4 Semiconductors 3 Engineering Brenton also knows about... 3 Financial Modeling 2 Process Improvement 2 Operations Management 2 Project Planning 2 Project Management 2 Strategy 1 Planning 1 Business Analysis 1 Intel 0 Statistics 0 Pricing 0 Cost 0 Budgeting 0 Problem Solving 0 Contract Negotiation 0 Accounting 0 Business Process... 0 Negotiation 0 Research 0 Corporate Finance 0 Process Engineering 0 Data Analysis 0 Contract Negotiations 0 P&L See 9+     See less Top Skills 14 Competitive Analysis 9 Program Management 7 Forecasting 6 Analysis 5 Business Strategy 5 Management 4 Financial Analysis 4 Strategic Planning 4 Semiconductors 3 Engineering Brenton also knows about... 3 Financial Modeling 2 Process Improvement 2 Operations Management 2 Project Planning 2 Project Management 2 Strategy 1 Planning 1 Business Analysis 1 Intel 0 Statistics 0 Pricing 0 Cost 0 Budgeting 0 Problem Solving 0 Contract Negotiation 0 Accounting 0 Business Process... 0 Negotiation 0 Research 0 Corporate Finance 0 Process Engineering 0 Data Analysis 0 Contract Negotiations 0 P&L See 9+     See less Top Skills 14 Competitive Analysis 9 Program Management 7 Forecasting 6 Analysis 5 Business Strategy 5 Management 4 Financial Analysis 4 Strategic Planning 4 Semiconductors 3 Engineering Brenton also knows about... 3 Financial Modeling 2 Process Improvement 2 Operations Management 2 Project Planning 2 Project Management 2 Strategy 1 Planning 1 Business Analysis 1 Intel 0 Statistics 0 Pricing 0 Cost 0 Budgeting 0 Problem Solving 0 Contract Negotiation 0 Accounting 0 Business Process... 0 Negotiation 0 Research 0 Corporate Finance 0 Process Engineering 0 Data Analysis 0 Contract Negotiations 0 P&L See 9+     See less                     3 Financial Modeling 2 Process Improvement 2 Operations Management 2 Project Planning 2 Project Management 2 Strategy 1 Planning 1 Business Analysis 1 Intel 0 Statistics 0 Pricing 0 Cost 0 Budgeting 0 Problem Solving 0 Contract Negotiation 0 Accounting 0 Business Process... 0 Negotiation 0 Research 0 Corporate Finance 0 Process Engineering 0 Data Analysis 0 Contract Negotiations 0 P&L Education University of Colorado Colorado Springs Masters,  Business Administration 2001  – 2003 Emphasis in Management Stanford University Certificate in Strategic Decision and Risk Management,  Modeling for Strategic Insight 2011 University of Colorado Colorado Springs Masters,  Business Administration 2001  – 2003 Emphasis in Management University of Colorado Colorado Springs Masters,  Business Administration 2001  – 2003 Emphasis in Management University of Colorado Colorado Springs Masters,  Business Administration 2001  – 2003 Emphasis in Management Stanford University Certificate in Strategic Decision and Risk Management,  Modeling for Strategic Insight 2011 Stanford University Certificate in Strategic Decision and Risk Management,  Modeling for Strategic Insight 2011 Stanford University Certificate in Strategic Decision and Risk Management,  Modeling for Strategic Insight 2011 ", "Experience Wireless Business Development Analyst Intel Corporation September 2013  – Present (2 years) Analyze market data, technology ramps, market share, and competitive analysis to help grow wireless business.  Wireless Market Demand Analyst Intel Corporation 2011  –  2013  (2 years) Utilized various statistical techniques, including time series, correlation analysis, and t-tests, to create 12 month demand forecast for Wireless market by SKU and OEM to drive build plans. \n Compliance Analyst Intel Corporation 2008  –  2011  (3 years) Used regression analysis to conduct annual internal equity analysis to ensure parity among employee groups. \nConducted quarterly Affirmative Action Plans to track diversity and ensure parity. Business Analyst Intel Corporation 2005  –  2008  (3 years) Partnered with HR Directors to create worldwide retention strategies for IT, Finance, and Legal organizations.  \nAnalyzed survey data to identify areas for improvement and recommend strategies to retain employees. Wireless Business Development Analyst Intel Corporation September 2013  – Present (2 years) Analyze market data, technology ramps, market share, and competitive analysis to help grow wireless business.  Wireless Business Development Analyst Intel Corporation September 2013  – Present (2 years) Analyze market data, technology ramps, market share, and competitive analysis to help grow wireless business.  Wireless Market Demand Analyst Intel Corporation 2011  –  2013  (2 years) Utilized various statistical techniques, including time series, correlation analysis, and t-tests, to create 12 month demand forecast for Wireless market by SKU and OEM to drive build plans. \n Wireless Market Demand Analyst Intel Corporation 2011  –  2013  (2 years) Utilized various statistical techniques, including time series, correlation analysis, and t-tests, to create 12 month demand forecast for Wireless market by SKU and OEM to drive build plans. \n Compliance Analyst Intel Corporation 2008  –  2011  (3 years) Used regression analysis to conduct annual internal equity analysis to ensure parity among employee groups. \nConducted quarterly Affirmative Action Plans to track diversity and ensure parity. Compliance Analyst Intel Corporation 2008  –  2011  (3 years) Used regression analysis to conduct annual internal equity analysis to ensure parity among employee groups. \nConducted quarterly Affirmative Action Plans to track diversity and ensure parity. Business Analyst Intel Corporation 2005  –  2008  (3 years) Partnered with HR Directors to create worldwide retention strategies for IT, Finance, and Legal organizations.  \nAnalyzed survey data to identify areas for improvement and recommend strategies to retain employees. Business Analyst Intel Corporation 2005  –  2008  (3 years) Partnered with HR Directors to create worldwide retention strategies for IT, Finance, and Legal organizations.  \nAnalyzed survey data to identify areas for improvement and recommend strategies to retain employees. Languages English Spanish English Spanish English Spanish Skills Top Skills 2 Analytics 2 Forecasting 1 Semiconductors 1 Financial Modeling 1 Analysis 1 Data Mining 1 Business Analysis 1 Competitive Analysis 1 Program Management 1 Cross-functional Team... Alicia also knows about... 1 Statistics 1 Data Analysis 1 Microsoft Excel 1 Market Research 1 Management 1 Business Intelligence 0 Statistical Data... 0 Regression Testing 0 Multivariate Statistics 0 Qualitative Research 0 Marketing Research Skills  Top Skills 2 Analytics 2 Forecasting 1 Semiconductors 1 Financial Modeling 1 Analysis 1 Data Mining 1 Business Analysis 1 Competitive Analysis 1 Program Management 1 Cross-functional Team... Alicia also knows about... 1 Statistics 1 Data Analysis 1 Microsoft Excel 1 Market Research 1 Management 1 Business Intelligence 0 Statistical Data... 0 Regression Testing 0 Multivariate Statistics 0 Qualitative Research 0 Marketing Research Top Skills 2 Analytics 2 Forecasting 1 Semiconductors 1 Financial Modeling 1 Analysis 1 Data Mining 1 Business Analysis 1 Competitive Analysis 1 Program Management 1 Cross-functional Team... Alicia also knows about... 1 Statistics 1 Data Analysis 1 Microsoft Excel 1 Market Research 1 Management 1 Business Intelligence 0 Statistical Data... 0 Regression Testing 0 Multivariate Statistics 0 Qualitative Research 0 Marketing Research Top Skills 2 Analytics 2 Forecasting 1 Semiconductors 1 Financial Modeling 1 Analysis 1 Data Mining 1 Business Analysis 1 Competitive Analysis 1 Program Management 1 Cross-functional Team... Alicia also knows about... 1 Statistics 1 Data Analysis 1 Microsoft Excel 1 Market Research 1 Management 1 Business Intelligence 0 Statistical Data... 0 Regression Testing 0 Multivariate Statistics 0 Qualitative Research 0 Marketing Research                     1 Statistics 1 Data Analysis 1 Microsoft Excel 1 Market Research 1 Management 1 Business Intelligence 0 Statistical Data... 0 Regression Testing 0 Multivariate Statistics 0 Qualitative Research 0 Marketing Research Education Willamette University MBA Master of Business Administration (M.B.A.),  Finance ,  General 2004  – 2005 Willamette University Bachelor of Arts (B.A.),  Economics 2002  – 2004 Chemeketa Community College Associate of Arts and Sciences (A.A.S.),  Transfer Degree 2000  – 2002 Willamette University MBA Master of Business Administration (M.B.A.),  Finance ,  General 2004  – 2005 Willamette University MBA Master of Business Administration (M.B.A.),  Finance ,  General 2004  – 2005 Willamette University MBA Master of Business Administration (M.B.A.),  Finance ,  General 2004  – 2005 Willamette University Bachelor of Arts (B.A.),  Economics 2002  – 2004 Willamette University Bachelor of Arts (B.A.),  Economics 2002  – 2004 Willamette University Bachelor of Arts (B.A.),  Economics 2002  – 2004 Chemeketa Community College Associate of Arts and Sciences (A.A.S.),  Transfer Degree 2000  – 2002 Chemeketa Community College Associate of Arts and Sciences (A.A.S.),  Transfer Degree 2000  – 2002 Chemeketa Community College Associate of Arts and Sciences (A.A.S.),  Transfer Degree 2000  – 2002 ", "Experience Supply Demand Analyst Intel Corporation September 2010  –  March 2015  (4 years 7 months) Customer Business Analyst Intel Corporation June 2008  –  September 2010  (2 years 4 months) Logistics Cost & Quality Analyst Intel International BV (The Netherlands) August 2007  –  June 2008  (11 months) I relocated to the Intel Amsterdam site for 11 months. Responsibilities included monitoring and reporting out on the local spends associated to the transportation of outbound freight. I was also responsible for identifying cost-savings, which required detailed analysis of supplier contracts and invoicing data.  \nThe quality analyst part of my role involved working closely with our transportation supplier on quality issues reported by our customers. This ultimately involved a strong understanding of the supply chain in order to implement effective process changes. Customer Business Analyst Intel Corporation February 2005  –  July 2007  (2 years 6 months) Customer Support Operations Analyst Intel Corporation July 2002  –  August 2003  (1 year 2 months) This was a 13 month placement a part of my BA Degree.This predominantly involved development, maintenance and presentation of the performance indicators for two internal management teams. Sales Person Southwestern Company June 2001  –  September 2001  (4 months) This was a 4 month summer placement. I was allocated a sales area within Lakewood, Colorado selling educational books door to door on 100% commission. This involved making sales presentations, closing sales as well as finance, inventory and distribution management. Supply Demand Analyst Intel Corporation September 2010  –  March 2015  (4 years 7 months) Supply Demand Analyst Intel Corporation September 2010  –  March 2015  (4 years 7 months) Customer Business Analyst Intel Corporation June 2008  –  September 2010  (2 years 4 months) Customer Business Analyst Intel Corporation June 2008  –  September 2010  (2 years 4 months) Logistics Cost & Quality Analyst Intel International BV (The Netherlands) August 2007  –  June 2008  (11 months) I relocated to the Intel Amsterdam site for 11 months. Responsibilities included monitoring and reporting out on the local spends associated to the transportation of outbound freight. I was also responsible for identifying cost-savings, which required detailed analysis of supplier contracts and invoicing data.  \nThe quality analyst part of my role involved working closely with our transportation supplier on quality issues reported by our customers. This ultimately involved a strong understanding of the supply chain in order to implement effective process changes. Logistics Cost & Quality Analyst Intel International BV (The Netherlands) August 2007  –  June 2008  (11 months) I relocated to the Intel Amsterdam site for 11 months. Responsibilities included monitoring and reporting out on the local spends associated to the transportation of outbound freight. I was also responsible for identifying cost-savings, which required detailed analysis of supplier contracts and invoicing data.  \nThe quality analyst part of my role involved working closely with our transportation supplier on quality issues reported by our customers. This ultimately involved a strong understanding of the supply chain in order to implement effective process changes. Customer Business Analyst Intel Corporation February 2005  –  July 2007  (2 years 6 months) Customer Business Analyst Intel Corporation February 2005  –  July 2007  (2 years 6 months) Customer Support Operations Analyst Intel Corporation July 2002  –  August 2003  (1 year 2 months) This was a 13 month placement a part of my BA Degree.This predominantly involved development, maintenance and presentation of the performance indicators for two internal management teams. Customer Support Operations Analyst Intel Corporation July 2002  –  August 2003  (1 year 2 months) This was a 13 month placement a part of my BA Degree.This predominantly involved development, maintenance and presentation of the performance indicators for two internal management teams. Sales Person Southwestern Company June 2001  –  September 2001  (4 months) This was a 4 month summer placement. I was allocated a sales area within Lakewood, Colorado selling educational books door to door on 100% commission. This involved making sales presentations, closing sales as well as finance, inventory and distribution management. Sales Person Southwestern Company June 2001  –  September 2001  (4 months) This was a 4 month summer placement. I was allocated a sales area within Lakewood, Colorado selling educational books door to door on 100% commission. This involved making sales presentations, closing sales as well as finance, inventory and distribution management. Languages English English English Skills 5 Logistics 5 Supply Chain 3 Intel 3 Analysis Skills  5 Logistics 5 Supply Chain 3 Intel 3 Analysis 5 Logistics 5 Supply Chain 3 Intel 3 Analysis 5 Logistics 5 Supply Chain 3 Intel 3 Analysis         Education University of the West of England BA (Hons) First Class,  Business Studies 2000  – 2004 This was a sandwich course involving a 13 month placement at Intel Corporation (UK) July 2002 - Aug 2003. Hereford Sixth Form College A Levels 1998  – 2000 Business Studies (grade A), Design (grade A) and Psychology (grade B). Kingstone High School GCSEs 1993  – 1998 10 GCSEs Grades A-C including English, Maths and Science. University of the West of England BA (Hons) First Class,  Business Studies 2000  – 2004 This was a sandwich course involving a 13 month placement at Intel Corporation (UK) July 2002 - Aug 2003. University of the West of England BA (Hons) First Class,  Business Studies 2000  – 2004 This was a sandwich course involving a 13 month placement at Intel Corporation (UK) July 2002 - Aug 2003. University of the West of England BA (Hons) First Class,  Business Studies 2000  – 2004 This was a sandwich course involving a 13 month placement at Intel Corporation (UK) July 2002 - Aug 2003. Hereford Sixth Form College A Levels 1998  – 2000 Business Studies (grade A), Design (grade A) and Psychology (grade B). Hereford Sixth Form College A Levels 1998  – 2000 Business Studies (grade A), Design (grade A) and Psychology (grade B). Hereford Sixth Form College A Levels 1998  – 2000 Business Studies (grade A), Design (grade A) and Psychology (grade B). Kingstone High School GCSEs 1993  – 1998 10 GCSEs Grades A-C including English, Maths and Science. Kingstone High School GCSEs 1993  – 1998 10 GCSEs Grades A-C including English, Maths and Science. Kingstone High School GCSEs 1993  – 1998 10 GCSEs Grades A-C including English, Maths and Science. ", "Experience Sr. Supply Demand Analyst Intel Corporation September 1999  – Present (16 years) Folsom, California Involved in all area's of supply chain management and production planning. Experience in driving process improvement projects and LEAN initiatives. APICS CPIM certified. Sr. Supply Demand Analyst Intel Corporation September 1999  – Present (16 years) Folsom, California Involved in all area's of supply chain management and production planning. Experience in driving process improvement projects and LEAN initiatives. APICS CPIM certified. Sr. Supply Demand Analyst Intel Corporation September 1999  – Present (16 years) Folsom, California Involved in all area's of supply chain management and production planning. Experience in driving process improvement projects and LEAN initiatives. APICS CPIM certified. Skills Top Skills 13 Supply Chain Management 10 Production Planning 7 Cross-functional Team... 7 Process Improvement 6 Lean Manufacturing 5 Supply Management 4 Strategic Sourcing 3 Program Management 3 Supply Chain 3 Manufacturing Scott also knows about... 2 Six Sigma 1 MRP 1 Materials Management 1 Global Sourcing Skills  Top Skills 13 Supply Chain Management 10 Production Planning 7 Cross-functional Team... 7 Process Improvement 6 Lean Manufacturing 5 Supply Management 4 Strategic Sourcing 3 Program Management 3 Supply Chain 3 Manufacturing Scott also knows about... 2 Six Sigma 1 MRP 1 Materials Management 1 Global Sourcing Top Skills 13 Supply Chain Management 10 Production Planning 7 Cross-functional Team... 7 Process Improvement 6 Lean Manufacturing 5 Supply Management 4 Strategic Sourcing 3 Program Management 3 Supply Chain 3 Manufacturing Scott also knows about... 2 Six Sigma 1 MRP 1 Materials Management 1 Global Sourcing Top Skills 13 Supply Chain Management 10 Production Planning 7 Cross-functional Team... 7 Process Improvement 6 Lean Manufacturing 5 Supply Management 4 Strategic Sourcing 3 Program Management 3 Supply Chain 3 Manufacturing Scott also knows about... 2 Six Sigma 1 MRP 1 Materials Management 1 Global Sourcing                     2 Six Sigma 1 MRP 1 Materials Management 1 Global Sourcing Education Thunderbird School of Global Management Master of International Management,  International Business 1998  – 1999 University of Utah Master of Business Administration (M.B.A.),  International Marketing 1994  – 1995 Brigham Young University Bachelor of Science (B.S.),  International Finance; Korean Thunderbird School of Global Management Master of International Management,  International Business 1998  – 1999 Thunderbird School of Global Management Master of International Management,  International Business 1998  – 1999 Thunderbird School of Global Management Master of International Management,  International Business 1998  – 1999 University of Utah Master of Business Administration (M.B.A.),  International Marketing 1994  – 1995 University of Utah Master of Business Administration (M.B.A.),  International Marketing 1994  – 1995 University of Utah Master of Business Administration (M.B.A.),  International Marketing 1994  – 1995 Brigham Young University Bachelor of Science (B.S.),  International Finance; Korean Brigham Young University Bachelor of Science (B.S.),  International Finance; Korean Brigham Young University Bachelor of Science (B.S.),  International Finance; Korean ", "Skills Skills     Education San Jose State University MS,  Industrial and Systems Engineering 2003  – 2005 University of Lucknow BS/MBA 1997  – 2002 San Jose State University MS,  Industrial and Systems Engineering 2003  – 2005 San Jose State University MS,  Industrial and Systems Engineering 2003  – 2005 San Jose State University MS,  Industrial and Systems Engineering 2003  – 2005 University of Lucknow BS/MBA 1997  – 2002 University of Lucknow BS/MBA 1997  – 2002 University of Lucknow BS/MBA 1997  – 2002 ", "Experience Desktop Analyst Intel Corporation October 2014  – Present (11 months) Long Range Business Planning Market Research Analyst Intel Corporation January 2011  –  September 2014  (3 years 9 months) Microprocessor Marketing & Business Planning (Santa Clara, CA) Worldwide all device consolidation \nSmartphone/handset market research / modeling Server CPU Product Manager Intel Corporation February 2010  –  January 2011  (1 year) Microprocessor Marketing & Business Planning (Santa Clara, CA) Worldwide CPU Demand Lead Intel Corporation June 2008  –  February 2010  (1 year 9 months) Microprocessor Marketing & Business Planning (Santa Clara, CA) Desktop CPU Demand Analyst Intel Corporation February 2007  –  June 2008  (1 year 5 months) Microprocessor Marketing & Business Planning (Santa Clara, CA) Geo Analyst Intel Corporation August 2005  –  February 2007  (1 year 7 months) Microprocessor Marketing & Business Planning (Santa Clara) CPU Product Customer Business Analyst Intel Corporation July 2004  –  August 2005  (1 year 2 months) America Sales & Marketing Organization (Folsom, California) Desktop Analyst Intel Corporation October 2014  – Present (11 months) Long Range Business Planning Desktop Analyst Intel Corporation October 2014  – Present (11 months) Long Range Business Planning Market Research Analyst Intel Corporation January 2011  –  September 2014  (3 years 9 months) Microprocessor Marketing & Business Planning (Santa Clara, CA) Worldwide all device consolidation \nSmartphone/handset market research / modeling Market Research Analyst Intel Corporation January 2011  –  September 2014  (3 years 9 months) Microprocessor Marketing & Business Planning (Santa Clara, CA) Worldwide all device consolidation \nSmartphone/handset market research / modeling Server CPU Product Manager Intel Corporation February 2010  –  January 2011  (1 year) Microprocessor Marketing & Business Planning (Santa Clara, CA) Server CPU Product Manager Intel Corporation February 2010  –  January 2011  (1 year) Microprocessor Marketing & Business Planning (Santa Clara, CA) Worldwide CPU Demand Lead Intel Corporation June 2008  –  February 2010  (1 year 9 months) Microprocessor Marketing & Business Planning (Santa Clara, CA) Worldwide CPU Demand Lead Intel Corporation June 2008  –  February 2010  (1 year 9 months) Microprocessor Marketing & Business Planning (Santa Clara, CA) Desktop CPU Demand Analyst Intel Corporation February 2007  –  June 2008  (1 year 5 months) Microprocessor Marketing & Business Planning (Santa Clara, CA) Desktop CPU Demand Analyst Intel Corporation February 2007  –  June 2008  (1 year 5 months) Microprocessor Marketing & Business Planning (Santa Clara, CA) Geo Analyst Intel Corporation August 2005  –  February 2007  (1 year 7 months) Microprocessor Marketing & Business Planning (Santa Clara) Geo Analyst Intel Corporation August 2005  –  February 2007  (1 year 7 months) Microprocessor Marketing & Business Planning (Santa Clara) CPU Product Customer Business Analyst Intel Corporation July 2004  –  August 2005  (1 year 2 months) America Sales & Marketing Organization (Folsom, California) CPU Product Customer Business Analyst Intel Corporation July 2004  –  August 2005  (1 year 2 months) America Sales & Marketing Organization (Folsom, California) Skills Skills     Education University of California, Berkeley BS,  Industrial Engineering & Operations Research University of California, Berkeley MS,  Industrial Engineering & Operations Research University of California, Berkeley BS,  Industrial Engineering & Operations Research University of California, Berkeley BS,  Industrial Engineering & Operations Research University of California, Berkeley BS,  Industrial Engineering & Operations Research University of California, Berkeley MS,  Industrial Engineering & Operations Research University of California, Berkeley MS,  Industrial Engineering & Operations Research University of California, Berkeley MS,  Industrial Engineering & Operations Research "]}