{"position": "Deployment Manager", "company": "IBM", "profiles": ["Summary 30+ years at IBM in England, Portugal, Canada, USA Summary 30+ years at IBM in England, Portugal, Canada, USA 30+ years at IBM in England, Portugal, Canada, USA 30+ years at IBM in England, Portugal, Canada, USA Experience Executive Director of External Affairs North American Institute of Pharmaceutical Technology [NAIPT] August 2015  – Present (1 month) Toronto, Canada Area Responsible for promoting the new Professional Seminar Series for Pharmaceutical Professionals. \n \nThe Professional Seminar Series is a series of 1-day seminars aimed at management and professionals in the pharmaceutical industry. \n \nTopics range from Gap Analysis, SAP System Applications, Six Sigma Tools in Effective Project Management, Business Excellence in the Regulatory Sector, Microbiological Contamination and Sterile Validation to Challenges Faced by Industries in terms of Effective Cleaning Validation. Plus many more. \n \nAlso responsible for establishing and running an international conference for management and pharmaceuticals from around the world. The International Conference will be held in Toronto in 2016. \n \nNAIPT is well recognized in the pharmaceutical industry as a provider of top class education in Industrial Pharma and Bio-Pharma Validation Technology and Modern Technology, Quality Assurance & Quality Control. NAIPT also has an excellent Clinical Research program. CEO and President CANSEES November 2011  – Present (3 years 10 months) Toronto, Canada CANSEES is a non profit organization operating in the Greater Toronto Area (GTA) helping new Canadians to settle into Canada and helping all Canadians to obtain employment. Our services are 100% free to our clients. CEO & President Canadian Educational Services 2010  – Present (5 years) Toronto, Canada Co-Founder, CEO and President:  \nIn addition to running the company, David is also responsible for establishing relationships with colleges and universities in Canada, and for building relationships with colleges and universities in other countries such as India.. \nCanadian Educational Services Incorporated (CES) is a non-profit organization dedicated to helping people get the career education that they need in order to get better jobs and careers. We have a domestic (Canadian) division and an international division. \nIn our Domestic division we have two broad categories of clientele. \nCategory 1: People who are newcomers to Canada and cannot find employment because their qualifications and job experiences are not recognized in Canada. These people need to get Diplomas and/or Certificates from Canadian educational institutions prior to getting a job in their field. \nCategory 2: Canadian citizens / residents who have been laid off in the last few years. These people qualify for government grants to be re-educated for a new career. As in Category 1, we help them find the best possible career college in order for them to obtain the appropriate diplomas. \n \nIn our International division we focus on helping international students to c ome to Canada to study, work and live. \n \nDavid just returned from a one month tour of India where he met with more than 40 colleges and more than 5,000 students. President Pennine Way International Inc November 1994  – Present (20 years 10 months) Markham, Ontario, Canada Pennine Way International is a business consulting corporation. Clientele include IBM Canada, IBM USA, Siemens Nixdorf Canada and Siemens USA. President UFMS Inc January 2004  –  March 2008  (4 years 3 months) Toronto, Ontario UFMS is a logistics support company providing logistics systems that ensure clients get the best, and most cost effective, shipping for their products. Deployment Manager IBM January 2001  –  December 2002  (2 years) Atlanta, Georgia, USA Reporting to the global executive with worldwide responsibility for the development and deployment of Method BLUE, IBM's propriety methodology for implementing SAP in customer locations. Ran training sessions in USA, Canada, Australia, Japan, Thailand, Singapore, India, UK, France, Germany, Italy, Denmark, and China. Deployment Manager IBM April 2000  –  December 2000  (9 months) Copenhagen, Denmark Leading the development of the IBM methodology for SAP implementations and deploying in Europe. Deployment Manager IBM April 1999  –  April 2000  (1 year 1 month) Atlanta, Georgia Developing IBM's methodolgy for SAP for the Americas and Japan. Intellectual Capital Manager IBM Canada Ltd. April 1997  –  April 1999  (2 years 1 month) Toronto, Canada Managing the harvesting and re-use of intellectual capital in the IBM SAP consulting division of IBM Global Services Planning & Business Manager ISM Canada July 1996  –  April 1997  (10 months) Toronto, Canada Helping IBM Canada to implement Lotus Notes. Depolyment Manager Siemens October 1995  –  June 1996  (9 months) Munich, Germany Managed a global team for the development and deployment of the Siemens Nixdorf methodology for SAP implementation Development Manager Siemens Canada November 1994  –  September 1995  (11 months) Toronto, Canada Led a team of SAP experts in defining and deploying a world class methodology for the implementation of SAP. Manager of Quality Assurance KBS Technology Inc. August 1993  –  October 1994  (1 year 3 months) Toronto, Canada Managed the QA of the development of a Knowledge Based System for IBM. Manager, National Language Technical Centre IBM Canada Ltd. March 1992  –  September 1993  (1 year 7 months) Toronto, Canada Managed the IBM Corporate Centre of Competence for handling IBM's software internationalization technologies Market Development & Support Manager IBM Canada Ltd. January 1990  –  March 1992  (2 years 3 months) Toronto, Canada Managed the introduction of IBM's CASE technology on the RISC System/6000 platform. Ran Customer Advisory Councils in North America and Europe. Senior Manager, AIX Compiler Development IBM Canada Ltd. August 1988  –  January 1990  (1 year 6 months) Toronto, Canada Managed the transfer of AIX language development from Austin, Texas to Toronto. Managed the development of XL/C, XL/Fortran and XL/Pascal compilers for AIX. Senior Manager, Quality Assurance IBM Canada Ltd. January 1985  –  August 1988  (3 years 8 months) Toronto, Canada Managed a team of 30 professionals with responsibility to assure the quality of all products being developed in the IBM Canada software laboratory. Provided managerial support for IBM Brazil's software development laboratory in Sao Paulo, Brazil. Executive Assistant IBM Canada Ltd. June 1984  –  January 1985  (8 months) Toronto, Canada Assistant to the Director of the IBM Canada Laboratory. Manager, VM/IS Development IBM Canada Ltd. June 1983  –  June 1984  (1 year 1 month) Toronto, Canada Managed a team of 20+ people to develop IBM's first system offering of packaged software products. Senior Development Analyst IBM Canada Ltd. March 1982  –  June 1983  (1 year 4 months) Toronto, Canada Team leader for development of VM based applications Senior Systems Engineer IBM United Kingdom Ltd January 1981  –  March 1982  (1 year 3 months) Welwyng Garden City Marketing support for deploying IBM's new 4300 systems in the North Londo area. Customer Service Specialist IBM United Kingdom Ltd January 1977  –  December 1980  (4 years) Greenford, UK Team leader for the deployment of new IBM operating systems across Europe. Developed IBM's first software ordering configurator in Uithoorn, Netherlands. Customer Support Specialist IBM United Kingdom Ltd August 1976  –  December 1976  (5 months) Sterling Forrest, New York Special Assignment to IBM labs in Sterling Forrest, New York. To help develop new software upgrade methodology and tools. Customer Support Specialist IBM United Kingdom Ltd December 1974  –  December 1976  (2 years 1 month) Rayners Lane, London Responsible for Northern European support for IBM's operating systems. Territory included Finland, Sweden, Denmark, Norway, Ireland, Iceland, Israel, South Africa and the UK. Customer Support Specialist IBM United Kingdom Ltd January 1974  –  December 1974  (1 year) Manchester, England Supporting IBM customers in a large territory in North West England and Northern Ireland Systems Engineer IBM Portugal November 1972  –  January 1974  (1 year 3 months) Lisbon, Portugal Providing special assistance for the installation of new large systems to the Portuguese national airline (Air Portugal) Customer Support Representative IBM United Kingdom Ltd March 1968  –  November 1972  (4 years 9 months) Manchester, United Kingdom First position in IBM. Supported many customers in Lancashire. Ranging from hardware support to software support. Instructor IBM Sweden August 1972  –  September 1972  (2 months) Stockholm, Sweden Teaching IBM operating system internals to IBM support teams in the IBM Scandinavia Laboratory. Executive Director of External Affairs North American Institute of Pharmaceutical Technology [NAIPT] August 2015  – Present (1 month) Toronto, Canada Area Responsible for promoting the new Professional Seminar Series for Pharmaceutical Professionals. \n \nThe Professional Seminar Series is a series of 1-day seminars aimed at management and professionals in the pharmaceutical industry. \n \nTopics range from Gap Analysis, SAP System Applications, Six Sigma Tools in Effective Project Management, Business Excellence in the Regulatory Sector, Microbiological Contamination and Sterile Validation to Challenges Faced by Industries in terms of Effective Cleaning Validation. Plus many more. \n \nAlso responsible for establishing and running an international conference for management and pharmaceuticals from around the world. The International Conference will be held in Toronto in 2016. \n \nNAIPT is well recognized in the pharmaceutical industry as a provider of top class education in Industrial Pharma and Bio-Pharma Validation Technology and Modern Technology, Quality Assurance & Quality Control. NAIPT also has an excellent Clinical Research program. Executive Director of External Affairs North American Institute of Pharmaceutical Technology [NAIPT] August 2015  – Present (1 month) Toronto, Canada Area Responsible for promoting the new Professional Seminar Series for Pharmaceutical Professionals. \n \nThe Professional Seminar Series is a series of 1-day seminars aimed at management and professionals in the pharmaceutical industry. \n \nTopics range from Gap Analysis, SAP System Applications, Six Sigma Tools in Effective Project Management, Business Excellence in the Regulatory Sector, Microbiological Contamination and Sterile Validation to Challenges Faced by Industries in terms of Effective Cleaning Validation. Plus many more. \n \nAlso responsible for establishing and running an international conference for management and pharmaceuticals from around the world. The International Conference will be held in Toronto in 2016. \n \nNAIPT is well recognized in the pharmaceutical industry as a provider of top class education in Industrial Pharma and Bio-Pharma Validation Technology and Modern Technology, Quality Assurance & Quality Control. NAIPT also has an excellent Clinical Research program. CEO and President CANSEES November 2011  – Present (3 years 10 months) Toronto, Canada CANSEES is a non profit organization operating in the Greater Toronto Area (GTA) helping new Canadians to settle into Canada and helping all Canadians to obtain employment. Our services are 100% free to our clients. CEO and President CANSEES November 2011  – Present (3 years 10 months) Toronto, Canada CANSEES is a non profit organization operating in the Greater Toronto Area (GTA) helping new Canadians to settle into Canada and helping all Canadians to obtain employment. Our services are 100% free to our clients. CEO & President Canadian Educational Services 2010  – Present (5 years) Toronto, Canada Co-Founder, CEO and President:  \nIn addition to running the company, David is also responsible for establishing relationships with colleges and universities in Canada, and for building relationships with colleges and universities in other countries such as India.. \nCanadian Educational Services Incorporated (CES) is a non-profit organization dedicated to helping people get the career education that they need in order to get better jobs and careers. We have a domestic (Canadian) division and an international division. \nIn our Domestic division we have two broad categories of clientele. \nCategory 1: People who are newcomers to Canada and cannot find employment because their qualifications and job experiences are not recognized in Canada. These people need to get Diplomas and/or Certificates from Canadian educational institutions prior to getting a job in their field. \nCategory 2: Canadian citizens / residents who have been laid off in the last few years. These people qualify for government grants to be re-educated for a new career. As in Category 1, we help them find the best possible career college in order for them to obtain the appropriate diplomas. \n \nIn our International division we focus on helping international students to c ome to Canada to study, work and live. \n \nDavid just returned from a one month tour of India where he met with more than 40 colleges and more than 5,000 students. CEO & President Canadian Educational Services 2010  – Present (5 years) Toronto, Canada Co-Founder, CEO and President:  \nIn addition to running the company, David is also responsible for establishing relationships with colleges and universities in Canada, and for building relationships with colleges and universities in other countries such as India.. \nCanadian Educational Services Incorporated (CES) is a non-profit organization dedicated to helping people get the career education that they need in order to get better jobs and careers. We have a domestic (Canadian) division and an international division. \nIn our Domestic division we have two broad categories of clientele. \nCategory 1: People who are newcomers to Canada and cannot find employment because their qualifications and job experiences are not recognized in Canada. These people need to get Diplomas and/or Certificates from Canadian educational institutions prior to getting a job in their field. \nCategory 2: Canadian citizens / residents who have been laid off in the last few years. These people qualify for government grants to be re-educated for a new career. As in Category 1, we help them find the best possible career college in order for them to obtain the appropriate diplomas. \n \nIn our International division we focus on helping international students to c ome to Canada to study, work and live. \n \nDavid just returned from a one month tour of India where he met with more than 40 colleges and more than 5,000 students. President Pennine Way International Inc November 1994  – Present (20 years 10 months) Markham, Ontario, Canada Pennine Way International is a business consulting corporation. Clientele include IBM Canada, IBM USA, Siemens Nixdorf Canada and Siemens USA. President Pennine Way International Inc November 1994  – Present (20 years 10 months) Markham, Ontario, Canada Pennine Way International is a business consulting corporation. Clientele include IBM Canada, IBM USA, Siemens Nixdorf Canada and Siemens USA. President UFMS Inc January 2004  –  March 2008  (4 years 3 months) Toronto, Ontario UFMS is a logistics support company providing logistics systems that ensure clients get the best, and most cost effective, shipping for their products. President UFMS Inc January 2004  –  March 2008  (4 years 3 months) Toronto, Ontario UFMS is a logistics support company providing logistics systems that ensure clients get the best, and most cost effective, shipping for their products. Deployment Manager IBM January 2001  –  December 2002  (2 years) Atlanta, Georgia, USA Reporting to the global executive with worldwide responsibility for the development and deployment of Method BLUE, IBM's propriety methodology for implementing SAP in customer locations. Ran training sessions in USA, Canada, Australia, Japan, Thailand, Singapore, India, UK, France, Germany, Italy, Denmark, and China. Deployment Manager IBM January 2001  –  December 2002  (2 years) Atlanta, Georgia, USA Reporting to the global executive with worldwide responsibility for the development and deployment of Method BLUE, IBM's propriety methodology for implementing SAP in customer locations. Ran training sessions in USA, Canada, Australia, Japan, Thailand, Singapore, India, UK, France, Germany, Italy, Denmark, and China. Deployment Manager IBM April 2000  –  December 2000  (9 months) Copenhagen, Denmark Leading the development of the IBM methodology for SAP implementations and deploying in Europe. Deployment Manager IBM April 2000  –  December 2000  (9 months) Copenhagen, Denmark Leading the development of the IBM methodology for SAP implementations and deploying in Europe. Deployment Manager IBM April 1999  –  April 2000  (1 year 1 month) Atlanta, Georgia Developing IBM's methodolgy for SAP for the Americas and Japan. Deployment Manager IBM April 1999  –  April 2000  (1 year 1 month) Atlanta, Georgia Developing IBM's methodolgy for SAP for the Americas and Japan. Intellectual Capital Manager IBM Canada Ltd. April 1997  –  April 1999  (2 years 1 month) Toronto, Canada Managing the harvesting and re-use of intellectual capital in the IBM SAP consulting division of IBM Global Services Intellectual Capital Manager IBM Canada Ltd. April 1997  –  April 1999  (2 years 1 month) Toronto, Canada Managing the harvesting and re-use of intellectual capital in the IBM SAP consulting division of IBM Global Services Planning & Business Manager ISM Canada July 1996  –  April 1997  (10 months) Toronto, Canada Helping IBM Canada to implement Lotus Notes. Planning & Business Manager ISM Canada July 1996  –  April 1997  (10 months) Toronto, Canada Helping IBM Canada to implement Lotus Notes. Depolyment Manager Siemens October 1995  –  June 1996  (9 months) Munich, Germany Managed a global team for the development and deployment of the Siemens Nixdorf methodology for SAP implementation Depolyment Manager Siemens October 1995  –  June 1996  (9 months) Munich, Germany Managed a global team for the development and deployment of the Siemens Nixdorf methodology for SAP implementation Development Manager Siemens Canada November 1994  –  September 1995  (11 months) Toronto, Canada Led a team of SAP experts in defining and deploying a world class methodology for the implementation of SAP. Development Manager Siemens Canada November 1994  –  September 1995  (11 months) Toronto, Canada Led a team of SAP experts in defining and deploying a world class methodology for the implementation of SAP. Manager of Quality Assurance KBS Technology Inc. August 1993  –  October 1994  (1 year 3 months) Toronto, Canada Managed the QA of the development of a Knowledge Based System for IBM. Manager of Quality Assurance KBS Technology Inc. August 1993  –  October 1994  (1 year 3 months) Toronto, Canada Managed the QA of the development of a Knowledge Based System for IBM. Manager, National Language Technical Centre IBM Canada Ltd. March 1992  –  September 1993  (1 year 7 months) Toronto, Canada Managed the IBM Corporate Centre of Competence for handling IBM's software internationalization technologies Manager, National Language Technical Centre IBM Canada Ltd. March 1992  –  September 1993  (1 year 7 months) Toronto, Canada Managed the IBM Corporate Centre of Competence for handling IBM's software internationalization technologies Market Development & Support Manager IBM Canada Ltd. January 1990  –  March 1992  (2 years 3 months) Toronto, Canada Managed the introduction of IBM's CASE technology on the RISC System/6000 platform. Ran Customer Advisory Councils in North America and Europe. Market Development & Support Manager IBM Canada Ltd. January 1990  –  March 1992  (2 years 3 months) Toronto, Canada Managed the introduction of IBM's CASE technology on the RISC System/6000 platform. Ran Customer Advisory Councils in North America and Europe. Senior Manager, AIX Compiler Development IBM Canada Ltd. August 1988  –  January 1990  (1 year 6 months) Toronto, Canada Managed the transfer of AIX language development from Austin, Texas to Toronto. Managed the development of XL/C, XL/Fortran and XL/Pascal compilers for AIX. Senior Manager, AIX Compiler Development IBM Canada Ltd. August 1988  –  January 1990  (1 year 6 months) Toronto, Canada Managed the transfer of AIX language development from Austin, Texas to Toronto. Managed the development of XL/C, XL/Fortran and XL/Pascal compilers for AIX. Senior Manager, Quality Assurance IBM Canada Ltd. January 1985  –  August 1988  (3 years 8 months) Toronto, Canada Managed a team of 30 professionals with responsibility to assure the quality of all products being developed in the IBM Canada software laboratory. Provided managerial support for IBM Brazil's software development laboratory in Sao Paulo, Brazil. Senior Manager, Quality Assurance IBM Canada Ltd. January 1985  –  August 1988  (3 years 8 months) Toronto, Canada Managed a team of 30 professionals with responsibility to assure the quality of all products being developed in the IBM Canada software laboratory. Provided managerial support for IBM Brazil's software development laboratory in Sao Paulo, Brazil. Executive Assistant IBM Canada Ltd. June 1984  –  January 1985  (8 months) Toronto, Canada Assistant to the Director of the IBM Canada Laboratory. Executive Assistant IBM Canada Ltd. June 1984  –  January 1985  (8 months) Toronto, Canada Assistant to the Director of the IBM Canada Laboratory. Manager, VM/IS Development IBM Canada Ltd. June 1983  –  June 1984  (1 year 1 month) Toronto, Canada Managed a team of 20+ people to develop IBM's first system offering of packaged software products. Manager, VM/IS Development IBM Canada Ltd. June 1983  –  June 1984  (1 year 1 month) Toronto, Canada Managed a team of 20+ people to develop IBM's first system offering of packaged software products. Senior Development Analyst IBM Canada Ltd. March 1982  –  June 1983  (1 year 4 months) Toronto, Canada Team leader for development of VM based applications Senior Development Analyst IBM Canada Ltd. March 1982  –  June 1983  (1 year 4 months) Toronto, Canada Team leader for development of VM based applications Senior Systems Engineer IBM United Kingdom Ltd January 1981  –  March 1982  (1 year 3 months) Welwyng Garden City Marketing support for deploying IBM's new 4300 systems in the North Londo area. Senior Systems Engineer IBM United Kingdom Ltd January 1981  –  March 1982  (1 year 3 months) Welwyng Garden City Marketing support for deploying IBM's new 4300 systems in the North Londo area. Customer Service Specialist IBM United Kingdom Ltd January 1977  –  December 1980  (4 years) Greenford, UK Team leader for the deployment of new IBM operating systems across Europe. Developed IBM's first software ordering configurator in Uithoorn, Netherlands. Customer Service Specialist IBM United Kingdom Ltd January 1977  –  December 1980  (4 years) Greenford, UK Team leader for the deployment of new IBM operating systems across Europe. Developed IBM's first software ordering configurator in Uithoorn, Netherlands. Customer Support Specialist IBM United Kingdom Ltd August 1976  –  December 1976  (5 months) Sterling Forrest, New York Special Assignment to IBM labs in Sterling Forrest, New York. To help develop new software upgrade methodology and tools. Customer Support Specialist IBM United Kingdom Ltd August 1976  –  December 1976  (5 months) Sterling Forrest, New York Special Assignment to IBM labs in Sterling Forrest, New York. To help develop new software upgrade methodology and tools. Customer Support Specialist IBM United Kingdom Ltd December 1974  –  December 1976  (2 years 1 month) Rayners Lane, London Responsible for Northern European support for IBM's operating systems. Territory included Finland, Sweden, Denmark, Norway, Ireland, Iceland, Israel, South Africa and the UK. Customer Support Specialist IBM United Kingdom Ltd December 1974  –  December 1976  (2 years 1 month) Rayners Lane, London Responsible for Northern European support for IBM's operating systems. Territory included Finland, Sweden, Denmark, Norway, Ireland, Iceland, Israel, South Africa and the UK. Customer Support Specialist IBM United Kingdom Ltd January 1974  –  December 1974  (1 year) Manchester, England Supporting IBM customers in a large territory in North West England and Northern Ireland Customer Support Specialist IBM United Kingdom Ltd January 1974  –  December 1974  (1 year) Manchester, England Supporting IBM customers in a large territory in North West England and Northern Ireland Systems Engineer IBM Portugal November 1972  –  January 1974  (1 year 3 months) Lisbon, Portugal Providing special assistance for the installation of new large systems to the Portuguese national airline (Air Portugal) Systems Engineer IBM Portugal November 1972  –  January 1974  (1 year 3 months) Lisbon, Portugal Providing special assistance for the installation of new large systems to the Portuguese national airline (Air Portugal) Customer Support Representative IBM United Kingdom Ltd March 1968  –  November 1972  (4 years 9 months) Manchester, United Kingdom First position in IBM. Supported many customers in Lancashire. Ranging from hardware support to software support. Customer Support Representative IBM United Kingdom Ltd March 1968  –  November 1972  (4 years 9 months) Manchester, United Kingdom First position in IBM. Supported many customers in Lancashire. Ranging from hardware support to software support. Instructor IBM Sweden August 1972  –  September 1972  (2 months) Stockholm, Sweden Teaching IBM operating system internals to IBM support teams in the IBM Scandinavia Laboratory. Instructor IBM Sweden August 1972  –  September 1972  (2 months) Stockholm, Sweden Teaching IBM operating system internals to IBM support teams in the IBM Scandinavia Laboratory. Skills Strategic Planning Quality Assurance Training Software Development Leadership Change Management Management Team Building Project Planning Customer Service Sales Operations Skills  Strategic Planning Quality Assurance Training Software Development Leadership Change Management Management Team Building Project Planning Customer Service Sales Operations Strategic Planning Quality Assurance Training Software Development Leadership Change Management Management Team Building Project Planning Customer Service Sales Operations Strategic Planning Quality Assurance Training Software Development Leadership Change Management Management Team Building Project Planning Customer Service Sales Operations Education Padiham Technical School, Whitefield Secondary Nelson Padiham Technical School, Whitefield Secondary Nelson Padiham Technical School, Whitefield Secondary Nelson Padiham Technical School, Whitefield Secondary Nelson ", "Summary Resource Management/ Recruitment in IT industry - 18 years experience. \nIndian Army (including 8 years of IT) - 28 years experience. Specialties:Resource Management/ Recruitment in IT. Summary Resource Management/ Recruitment in IT industry - 18 years experience. \nIndian Army (including 8 years of IT) - 28 years experience. Specialties:Resource Management/ Recruitment in IT. Resource Management/ Recruitment in IT industry - 18 years experience. \nIndian Army (including 8 years of IT) - 28 years experience. Specialties:Resource Management/ Recruitment in IT. Resource Management/ Recruitment in IT industry - 18 years experience. \nIndian Army (including 8 years of IT) - 28 years experience. Specialties:Resource Management/ Recruitment in IT. Experience Chief Operating Officer Selectigence HR Solutions Pvt. Ltd. January 2012  –  May 2012  (5 months) Pune Recruitment Senior Vice President BOB Tech Solutions Pvt. Ltd. January 2010  –  November 2011  (1 year 11 months) Pune Recruitment & Head - Pune Location Vice President and Head - Global Recruitment Patni Computer Systems Limited September 2007  –  November 2009  (2 years 3 months) Pune Head - Global Recruitment Vice President - Strategic Sourcing Patni Computer Systems Limited September 2005  –  August 2007  (2 years) Pune Strategic Sourcing Head - Global Staffing Kanbay Software India Private Limited March 2005  –  September 2005  (7 months) Pune Head - Global Staffing Country Resource Deployment Manager IBM Global Services India March 1999  –  February 2005  (6 years) Pune Country Resource Deployment Manager & Head - Pune Location Head, Resource Centre Zensar Technologies September 1994  –  March 1999  (4 years 7 months) Pune Head, Resource Centre Commandant, Army Headquarters Computer Centre (Colonel) Indian Army December 1993  –  August 1994  (9 months) New Delhi Commandant (Managing Honeywell-Bull DPS-7 Mainframe Computer) Second Lieutenant to Colonel Indian Army June 1966  –  August 1994  (28 years 3 months) India Officer in the Corps of Signals (Telecommunications) Chief Operating Officer Selectigence HR Solutions Pvt. Ltd. January 2012  –  May 2012  (5 months) Pune Recruitment Chief Operating Officer Selectigence HR Solutions Pvt. Ltd. January 2012  –  May 2012  (5 months) Pune Recruitment Senior Vice President BOB Tech Solutions Pvt. Ltd. January 2010  –  November 2011  (1 year 11 months) Pune Recruitment & Head - Pune Location Senior Vice President BOB Tech Solutions Pvt. Ltd. January 2010  –  November 2011  (1 year 11 months) Pune Recruitment & Head - Pune Location Vice President and Head - Global Recruitment Patni Computer Systems Limited September 2007  –  November 2009  (2 years 3 months) Pune Head - Global Recruitment Vice President and Head - Global Recruitment Patni Computer Systems Limited September 2007  –  November 2009  (2 years 3 months) Pune Head - Global Recruitment Vice President - Strategic Sourcing Patni Computer Systems Limited September 2005  –  August 2007  (2 years) Pune Strategic Sourcing Vice President - Strategic Sourcing Patni Computer Systems Limited September 2005  –  August 2007  (2 years) Pune Strategic Sourcing Head - Global Staffing Kanbay Software India Private Limited March 2005  –  September 2005  (7 months) Pune Head - Global Staffing Head - Global Staffing Kanbay Software India Private Limited March 2005  –  September 2005  (7 months) Pune Head - Global Staffing Country Resource Deployment Manager IBM Global Services India March 1999  –  February 2005  (6 years) Pune Country Resource Deployment Manager & Head - Pune Location Country Resource Deployment Manager IBM Global Services India March 1999  –  February 2005  (6 years) Pune Country Resource Deployment Manager & Head - Pune Location Head, Resource Centre Zensar Technologies September 1994  –  March 1999  (4 years 7 months) Pune Head, Resource Centre Head, Resource Centre Zensar Technologies September 1994  –  March 1999  (4 years 7 months) Pune Head, Resource Centre Commandant, Army Headquarters Computer Centre (Colonel) Indian Army December 1993  –  August 1994  (9 months) New Delhi Commandant (Managing Honeywell-Bull DPS-7 Mainframe Computer) Commandant, Army Headquarters Computer Centre (Colonel) Indian Army December 1993  –  August 1994  (9 months) New Delhi Commandant (Managing Honeywell-Bull DPS-7 Mainframe Computer) Second Lieutenant to Colonel Indian Army June 1966  –  August 1994  (28 years 3 months) India Officer in the Corps of Signals (Telecommunications) Second Lieutenant to Colonel Indian Army June 1966  –  August 1994  (28 years 3 months) India Officer in the Corps of Signals (Telecommunications) Languages English Hindi Sindhi English Hindi Sindhi English Hindi Sindhi Skills Skills     Education Indian Military Academy 37th Course, Imphal Company,  Science 1965  – 1966 Activities and Societies:  Cricket National Defence Academy 28th Course, Echo Squadron,  Science 1962  – 1965 Activities and Societies:  Cricket St Columba's High School, New Delhi Senior Cambridge (General Certificate of Education),  Science 1952  – 1961 Activities and Societies:  Cricket ,  Badminton Indian Military Academy 37th Course, Imphal Company,  Science 1965  – 1966 Activities and Societies:  Cricket Indian Military Academy 37th Course, Imphal Company,  Science 1965  – 1966 Activities and Societies:  Cricket Indian Military Academy 37th Course, Imphal Company,  Science 1965  – 1966 Activities and Societies:  Cricket National Defence Academy 28th Course, Echo Squadron,  Science 1962  – 1965 Activities and Societies:  Cricket National Defence Academy 28th Course, Echo Squadron,  Science 1962  – 1965 Activities and Societies:  Cricket National Defence Academy 28th Course, Echo Squadron,  Science 1962  – 1965 Activities and Societies:  Cricket St Columba's High School, New Delhi Senior Cambridge (General Certificate of Education),  Science 1952  – 1961 Activities and Societies:  Cricket ,  Badminton St Columba's High School, New Delhi Senior Cambridge (General Certificate of Education),  Science 1952  – 1961 Activities and Societies:  Cricket ,  Badminton St Columba's High School, New Delhi Senior Cambridge (General Certificate of Education),  Science 1952  – 1961 Activities and Societies:  Cricket ,  Badminton Honors & Awards Additional Honors & Awards Won two Excellence Awards for outstanding performance in IBM in 2000 and 2001. \nWon three Excellence Awards (one bronze and two local) for exceptional performance as Head of Resource Centre of ICIL in 1997. \nWas adjudged Runner-up in ‘Mr ICIL’, a popularity contest conducted in 1998. \nConferred the award of 'Commendation' for devotion to duty and distinguished service by the Southern Army Commander in 1993. Additional Honors & Awards Won two Excellence Awards for outstanding performance in IBM in 2000 and 2001. \nWon three Excellence Awards (one bronze and two local) for exceptional performance as Head of Resource Centre of ICIL in 1997. \nWas adjudged Runner-up in ‘Mr ICIL’, a popularity contest conducted in 1998. \nConferred the award of 'Commendation' for devotion to duty and distinguished service by the Southern Army Commander in 1993. Additional Honors & Awards Won two Excellence Awards for outstanding performance in IBM in 2000 and 2001. \nWon three Excellence Awards (one bronze and two local) for exceptional performance as Head of Resource Centre of ICIL in 1997. \nWas adjudged Runner-up in ‘Mr ICIL’, a popularity contest conducted in 1998. \nConferred the award of 'Commendation' for devotion to duty and distinguished service by the Southern Army Commander in 1993. Additional Honors & Awards Won two Excellence Awards for outstanding performance in IBM in 2000 and 2001. \nWon three Excellence Awards (one bronze and two local) for exceptional performance as Head of Resource Centre of ICIL in 1997. \nWas adjudged Runner-up in ‘Mr ICIL’, a popularity contest conducted in 1998. \nConferred the award of 'Commendation' for devotion to duty and distinguished service by the Southern Army Commander in 1993. ", "Experience Global Learning Deployment Manager IBM Global Learning Deployment Manager IBM 2004  –  2011  (7 years) Global Learning Deployment Manager IBM Global Learning Deployment Manager IBM Global Learning Deployment Manager IBM 2004  –  2011  (7 years) Global Learning Deployment Manager IBM 2004  –  2011  (7 years) Skills Requirements Analysis Skills  Requirements Analysis Requirements Analysis Requirements Analysis Education National Institute of Technology Calicut B Tech,  Computer Science Engineering 1998  – 2001 XLRI Jamshedpur National Institute of Technology Calicut B Tech,  Computer Science Engineering 1998  – 2001 National Institute of Technology Calicut B Tech,  Computer Science Engineering 1998  – 2001 National Institute of Technology Calicut B Tech,  Computer Science Engineering 1998  – 2001 XLRI Jamshedpur XLRI Jamshedpur XLRI Jamshedpur ", "Experience Release and Deployment Manager IBM India Pvt. Ltd. September 2013  – Present (2 years) Pune Area, India Working as Release and Deployment Manager for IBM India Pvt ltd. Major responsibilities include : \n \n- Managing bimonthly release for the client. \n- Testing of Bug fixes / Customer Demands / Requests / New Plans / New Products in the test environment before proceeding for production deployment. \n- Configuration of New Plans / Products in Production twice a week. \n- Problem Management \n- Change Management Project Manager Amdocs November 2011  –  June 2013  (1 year 8 months) Pune, india Provide 24 x 7 Operations for Post Billing Revenue Assurance and Audit checks and balances to help the client for accurate Billing delivery \nBilling Audit for 5 major USA clients (Post Paid and Prepaid) \nTrending Analysis and Exception Report Analysis and Results. \nForefront of Billing Accuracy and Support – Ensure operational goals are met through diligent analysis to achieve 100% accuracy. \nProvide cross-functional support throughout the company. \nHandling Critical processes like SLA Management and Escalation process. Project Manager Amdocs February 2010  –  November 2011  (1 year 10 months) Gurgaon, India Provide 24 x 7 monitoring of the overall health of Amdocs Billing System and its related applications, processes and servers utilizing a variety of monitoring tools. \nResponsible for timely batch processing of EOD/EOM/Billing activities. \nEOD/EOM Processing – Build, execute and monitor batch processing activities. \nCustomer Care stability and system health – Monitor Production and Training environments making sure these environments are functioning properly to provide excellent service to our Customers \nForefront of Customer Support – Ensure operational goals are met through diligent monitoring to maximize system availability \nTier 2/3 support of operational application issues including root cause determination and correction \nConfiguration of reference tables in all the systems to ensure new plans and processes and circles are rolled out in time. \nEscalation of defects to development/vendor and/or submission of requests to intake \nPre-production signoff on new/changed functionality \nPre- and Post-production involvement in new projects to facilitate transition to production \nCommunications to/from business groups (Amdocs partner teams, Videocon partner teams, Release Management, Customer Delivery, Project Management) for operational issues \nProvide cross-functional support throughout the company. \nHandling Critical processes like SLA Management, Client engagement and Escalation process. \nResponsible for End to End Mediation configuration, file processing and error handling. Manager IBM February 2005  –  February 2010  (5 years 1 month) Kolkata Area, India, New Delhi, India Fully responsible for Postpaid Billing of Kolkata and West Bengal. \nResponsible for all adhoc and monthly reports (MIS) generated by IT developed mainly using Crystal Reports and .xls Macros. \nTaking Backups, monitoring System Performance, Planning and designing new methods and modules for beneficiary of Internal Customers. \nAct as a liaison between Customer Care QRT (Query Resolution Team) and IT. \nAct as a control for AIRTEL Bill Printing and bill dispatch / delivery with two separate vendors – MODI XEROX and SKYPAK. \n \n \nResponsible for smooth operations on-site for Bharti Project (Telemedia Services), which covers the landline business for entire North India. \nMonitored and communicated business progress to key stakeholders, including reports, status, issue resolution and resource allocation. Possesses methodology, control and delivery process knowledge to achieve results. \nDesigning, measuring, monitoring and communicating project metrics. Flexibility and willingness to work in unstructured environments with changing priorities. \nProviding support that takes the form of either primary project management or project management assistance as dictated by the situation. \nExcellent planning, time management, communication and organization skills. \n \nThe responsibilities include  \n1. Billing Operations. \n2. Testing and Configuration of New Plans, Components and Packages. \n3. MIS/ Reports Delivery within agreed timeframe with the customer. \n4. Identify delivery issues, develop improvement plans, communicate and execute plans, measure to ensure improvement target is achieved. \n5. Understand the sudden critical & urgent requirements of Customer and Respond to them in a timely manner. \n6. Ensuring to highlight the achievements, specifically adding value to the business, of the team to the management, both IBM & customer, to ensure the due recognition. Sr. Officer HFCL Infotel Ltd. March 2004  –  February 2005  (1 year) Mohali, Punjab Billing of Different Services i.e. POTS (Wire line/Wireless/DECT), Centrex, ISDN, Limited Mobility (CDMA), PCO, SME, etc in TBMS Billing Platform. \nEnsuring the proper running of Service Order Processing in TBMS. \nConfiguration of Price Plans in the Billing System. \nGeneration of Invoices and making sure that they are printed. \nEnsuring that rating is going on smoothly \nSpooling the Dump which is collected by the Print Shop and Printed. \nUploading Payments and Adjustments into the billing System before every Bill Run. \nEnsuring Co-ordination between different departments for billing S/W flow. \nConceptualization, testing and implementation of new pricing Plan/ new services. \nEnsure providence of technical support to marketing team in terms of marketing collaterals, estimation and solutions – any pre-sales support. \nExtensive Interaction with Vendors for any development in System. \nTechnical support to Revenue assurance team for audit of billing system and various Functional reports. \nSolving System Errors like Wrong Rental Posted, Usage vs. Pulse Mismatch, OTC deposit and Payment mismatch, etc. Executive Hutch August 2001  –  March 2004  (2 years 8 months) New Delhi Area, India Prepaid Billing and Post Paid Billing Operations Release and Deployment Manager IBM India Pvt. Ltd. September 2013  – Present (2 years) Pune Area, India Working as Release and Deployment Manager for IBM India Pvt ltd. Major responsibilities include : \n \n- Managing bimonthly release for the client. \n- Testing of Bug fixes / Customer Demands / Requests / New Plans / New Products in the test environment before proceeding for production deployment. \n- Configuration of New Plans / Products in Production twice a week. \n- Problem Management \n- Change Management Release and Deployment Manager IBM India Pvt. Ltd. September 2013  – Present (2 years) Pune Area, India Working as Release and Deployment Manager for IBM India Pvt ltd. Major responsibilities include : \n \n- Managing bimonthly release for the client. \n- Testing of Bug fixes / Customer Demands / Requests / New Plans / New Products in the test environment before proceeding for production deployment. \n- Configuration of New Plans / Products in Production twice a week. \n- Problem Management \n- Change Management Project Manager Amdocs November 2011  –  June 2013  (1 year 8 months) Pune, india Provide 24 x 7 Operations for Post Billing Revenue Assurance and Audit checks and balances to help the client for accurate Billing delivery \nBilling Audit for 5 major USA clients (Post Paid and Prepaid) \nTrending Analysis and Exception Report Analysis and Results. \nForefront of Billing Accuracy and Support – Ensure operational goals are met through diligent analysis to achieve 100% accuracy. \nProvide cross-functional support throughout the company. \nHandling Critical processes like SLA Management and Escalation process. Project Manager Amdocs November 2011  –  June 2013  (1 year 8 months) Pune, india Provide 24 x 7 Operations for Post Billing Revenue Assurance and Audit checks and balances to help the client for accurate Billing delivery \nBilling Audit for 5 major USA clients (Post Paid and Prepaid) \nTrending Analysis and Exception Report Analysis and Results. \nForefront of Billing Accuracy and Support – Ensure operational goals are met through diligent analysis to achieve 100% accuracy. \nProvide cross-functional support throughout the company. \nHandling Critical processes like SLA Management and Escalation process. Project Manager Amdocs February 2010  –  November 2011  (1 year 10 months) Gurgaon, India Provide 24 x 7 monitoring of the overall health of Amdocs Billing System and its related applications, processes and servers utilizing a variety of monitoring tools. \nResponsible for timely batch processing of EOD/EOM/Billing activities. \nEOD/EOM Processing – Build, execute and monitor batch processing activities. \nCustomer Care stability and system health – Monitor Production and Training environments making sure these environments are functioning properly to provide excellent service to our Customers \nForefront of Customer Support – Ensure operational goals are met through diligent monitoring to maximize system availability \nTier 2/3 support of operational application issues including root cause determination and correction \nConfiguration of reference tables in all the systems to ensure new plans and processes and circles are rolled out in time. \nEscalation of defects to development/vendor and/or submission of requests to intake \nPre-production signoff on new/changed functionality \nPre- and Post-production involvement in new projects to facilitate transition to production \nCommunications to/from business groups (Amdocs partner teams, Videocon partner teams, Release Management, Customer Delivery, Project Management) for operational issues \nProvide cross-functional support throughout the company. \nHandling Critical processes like SLA Management, Client engagement and Escalation process. \nResponsible for End to End Mediation configuration, file processing and error handling. Project Manager Amdocs February 2010  –  November 2011  (1 year 10 months) Gurgaon, India Provide 24 x 7 monitoring of the overall health of Amdocs Billing System and its related applications, processes and servers utilizing a variety of monitoring tools. \nResponsible for timely batch processing of EOD/EOM/Billing activities. \nEOD/EOM Processing – Build, execute and monitor batch processing activities. \nCustomer Care stability and system health – Monitor Production and Training environments making sure these environments are functioning properly to provide excellent service to our Customers \nForefront of Customer Support – Ensure operational goals are met through diligent monitoring to maximize system availability \nTier 2/3 support of operational application issues including root cause determination and correction \nConfiguration of reference tables in all the systems to ensure new plans and processes and circles are rolled out in time. \nEscalation of defects to development/vendor and/or submission of requests to intake \nPre-production signoff on new/changed functionality \nPre- and Post-production involvement in new projects to facilitate transition to production \nCommunications to/from business groups (Amdocs partner teams, Videocon partner teams, Release Management, Customer Delivery, Project Management) for operational issues \nProvide cross-functional support throughout the company. \nHandling Critical processes like SLA Management, Client engagement and Escalation process. \nResponsible for End to End Mediation configuration, file processing and error handling. Manager IBM February 2005  –  February 2010  (5 years 1 month) Kolkata Area, India, New Delhi, India Fully responsible for Postpaid Billing of Kolkata and West Bengal. \nResponsible for all adhoc and monthly reports (MIS) generated by IT developed mainly using Crystal Reports and .xls Macros. \nTaking Backups, monitoring System Performance, Planning and designing new methods and modules for beneficiary of Internal Customers. \nAct as a liaison between Customer Care QRT (Query Resolution Team) and IT. \nAct as a control for AIRTEL Bill Printing and bill dispatch / delivery with two separate vendors – MODI XEROX and SKYPAK. \n \n \nResponsible for smooth operations on-site for Bharti Project (Telemedia Services), which covers the landline business for entire North India. \nMonitored and communicated business progress to key stakeholders, including reports, status, issue resolution and resource allocation. Possesses methodology, control and delivery process knowledge to achieve results. \nDesigning, measuring, monitoring and communicating project metrics. Flexibility and willingness to work in unstructured environments with changing priorities. \nProviding support that takes the form of either primary project management or project management assistance as dictated by the situation. \nExcellent planning, time management, communication and organization skills. \n \nThe responsibilities include  \n1. Billing Operations. \n2. Testing and Configuration of New Plans, Components and Packages. \n3. MIS/ Reports Delivery within agreed timeframe with the customer. \n4. Identify delivery issues, develop improvement plans, communicate and execute plans, measure to ensure improvement target is achieved. \n5. Understand the sudden critical & urgent requirements of Customer and Respond to them in a timely manner. \n6. Ensuring to highlight the achievements, specifically adding value to the business, of the team to the management, both IBM & customer, to ensure the due recognition. Manager IBM February 2005  –  February 2010  (5 years 1 month) Kolkata Area, India, New Delhi, India Fully responsible for Postpaid Billing of Kolkata and West Bengal. \nResponsible for all adhoc and monthly reports (MIS) generated by IT developed mainly using Crystal Reports and .xls Macros. \nTaking Backups, monitoring System Performance, Planning and designing new methods and modules for beneficiary of Internal Customers. \nAct as a liaison between Customer Care QRT (Query Resolution Team) and IT. \nAct as a control for AIRTEL Bill Printing and bill dispatch / delivery with two separate vendors – MODI XEROX and SKYPAK. \n \n \nResponsible for smooth operations on-site for Bharti Project (Telemedia Services), which covers the landline business for entire North India. \nMonitored and communicated business progress to key stakeholders, including reports, status, issue resolution and resource allocation. Possesses methodology, control and delivery process knowledge to achieve results. \nDesigning, measuring, monitoring and communicating project metrics. Flexibility and willingness to work in unstructured environments with changing priorities. \nProviding support that takes the form of either primary project management or project management assistance as dictated by the situation. \nExcellent planning, time management, communication and organization skills. \n \nThe responsibilities include  \n1. Billing Operations. \n2. Testing and Configuration of New Plans, Components and Packages. \n3. MIS/ Reports Delivery within agreed timeframe with the customer. \n4. Identify delivery issues, develop improvement plans, communicate and execute plans, measure to ensure improvement target is achieved. \n5. Understand the sudden critical & urgent requirements of Customer and Respond to them in a timely manner. \n6. Ensuring to highlight the achievements, specifically adding value to the business, of the team to the management, both IBM & customer, to ensure the due recognition. Sr. Officer HFCL Infotel Ltd. March 2004  –  February 2005  (1 year) Mohali, Punjab Billing of Different Services i.e. POTS (Wire line/Wireless/DECT), Centrex, ISDN, Limited Mobility (CDMA), PCO, SME, etc in TBMS Billing Platform. \nEnsuring the proper running of Service Order Processing in TBMS. \nConfiguration of Price Plans in the Billing System. \nGeneration of Invoices and making sure that they are printed. \nEnsuring that rating is going on smoothly \nSpooling the Dump which is collected by the Print Shop and Printed. \nUploading Payments and Adjustments into the billing System before every Bill Run. \nEnsuring Co-ordination between different departments for billing S/W flow. \nConceptualization, testing and implementation of new pricing Plan/ new services. \nEnsure providence of technical support to marketing team in terms of marketing collaterals, estimation and solutions – any pre-sales support. \nExtensive Interaction with Vendors for any development in System. \nTechnical support to Revenue assurance team for audit of billing system and various Functional reports. \nSolving System Errors like Wrong Rental Posted, Usage vs. Pulse Mismatch, OTC deposit and Payment mismatch, etc. Sr. Officer HFCL Infotel Ltd. March 2004  –  February 2005  (1 year) Mohali, Punjab Billing of Different Services i.e. POTS (Wire line/Wireless/DECT), Centrex, ISDN, Limited Mobility (CDMA), PCO, SME, etc in TBMS Billing Platform. \nEnsuring the proper running of Service Order Processing in TBMS. \nConfiguration of Price Plans in the Billing System. \nGeneration of Invoices and making sure that they are printed. \nEnsuring that rating is going on smoothly \nSpooling the Dump which is collected by the Print Shop and Printed. \nUploading Payments and Adjustments into the billing System before every Bill Run. \nEnsuring Co-ordination between different departments for billing S/W flow. \nConceptualization, testing and implementation of new pricing Plan/ new services. \nEnsure providence of technical support to marketing team in terms of marketing collaterals, estimation and solutions – any pre-sales support. \nExtensive Interaction with Vendors for any development in System. \nTechnical support to Revenue assurance team for audit of billing system and various Functional reports. \nSolving System Errors like Wrong Rental Posted, Usage vs. Pulse Mismatch, OTC deposit and Payment mismatch, etc. Executive Hutch August 2001  –  March 2004  (2 years 8 months) New Delhi Area, India Prepaid Billing and Post Paid Billing Operations Executive Hutch August 2001  –  March 2004  (2 years 8 months) New Delhi Area, India Prepaid Billing and Post Paid Billing Operations Skills SQL Unix java Billing Solutions Revenue Assurance Quality Assurance Skills  SQL Unix java Billing Solutions Revenue Assurance Quality Assurance SQL Unix java Billing Solutions Revenue Assurance Quality Assurance SQL Unix java Billing Solutions Revenue Assurance Quality Assurance Education MDU, Rohtak Master of Computer Applications (MCA) 2011  – 2013 Elnet 3l Academy e commerce,  Java, HTML, Oracle 2000  – 2001 Delhi University Bachelor of Commerce (B.Com.),  Commerce , B 1997  – 2000 Member of the collage Basket Ball team \nMember of Delhi University Basket Ball team DAV Public School Higher Secondary,  Commerce 1995  – 1997 Captain of school Basket Ball team \nMember of Haryana state junior basket ball team MDU, Rohtak Master of Computer Applications (MCA) 2011  – 2013 MDU, Rohtak Master of Computer Applications (MCA) 2011  – 2013 MDU, Rohtak Master of Computer Applications (MCA) 2011  – 2013 Elnet 3l Academy e commerce,  Java, HTML, Oracle 2000  – 2001 Elnet 3l Academy e commerce,  Java, HTML, Oracle 2000  – 2001 Elnet 3l Academy e commerce,  Java, HTML, Oracle 2000  – 2001 Delhi University Bachelor of Commerce (B.Com.),  Commerce , B 1997  – 2000 Member of the collage Basket Ball team \nMember of Delhi University Basket Ball team Delhi University Bachelor of Commerce (B.Com.),  Commerce , B 1997  – 2000 Member of the collage Basket Ball team \nMember of Delhi University Basket Ball team Delhi University Bachelor of Commerce (B.Com.),  Commerce , B 1997  – 2000 Member of the collage Basket Ball team \nMember of Delhi University Basket Ball team DAV Public School Higher Secondary,  Commerce 1995  – 1997 Captain of school Basket Ball team \nMember of Haryana state junior basket ball team DAV Public School Higher Secondary,  Commerce 1995  – 1997 Captain of school Basket Ball team \nMember of Haryana state junior basket ball team DAV Public School Higher Secondary,  Commerce 1995  – 1997 Captain of school Basket Ball team \nMember of Haryana state junior basket ball team ", "Summary Currently I am responsible for Profiles, Directory Services and Cloud Development and Deployment for IBM Connections \n \nI have held a number of roles at Lotus Development and IBM since 1996 including Senior Development Manager, Web Experience Factory, IBM Connections Portlets, Business Operations Manager, Senior Function Verification Test Manager and Software Release Manager.  Summary Currently I am responsible for Profiles, Directory Services and Cloud Development and Deployment for IBM Connections \n \nI have held a number of roles at Lotus Development and IBM since 1996 including Senior Development Manager, Web Experience Factory, IBM Connections Portlets, Business Operations Manager, Senior Function Verification Test Manager and Software Release Manager.  Currently I am responsible for Profiles, Directory Services and Cloud Development and Deployment for IBM Connections \n \nI have held a number of roles at Lotus Development and IBM since 1996 including Senior Development Manager, Web Experience Factory, IBM Connections Portlets, Business Operations Manager, Senior Function Verification Test Manager and Software Release Manager.  Currently I am responsible for Profiles, Directory Services and Cloud Development and Deployment for IBM Connections \n \nI have held a number of roles at Lotus Development and IBM since 1996 including Senior Development Manager, Web Experience Factory, IBM Connections Portlets, Business Operations Manager, Senior Function Verification Test Manager and Software Release Manager.  Experience Cloud Development and Deployment Manager, IBM Connections IBM June 1996  – Present (19 years 3 months) Cloud Development and Deployment Manager, IBM Connections IBM June 1996  – Present (19 years 3 months) Senior Development Manager, Web Experience Factory, IBM Connections Portlets IBM June 2012  –  June 2014  (2 years 1 month) Littleton,Massachusetts I am responsible for Web Experience Factory development and test and IBM Connections Portlet development. I also own the Learning (LMS / WCL) L3 support mission Business Operations Manager IBM June 2010  –  June 2012  (2 years 1 month) Business Operations Manager for Advanced Collaboration Development organization. Senior Function Verification Test Manager IBM October 2008  –  June 2010  (1 year 9 months) Release Manager IBM July 2007  –  September 2008  (1 year 3 months) Release manager for the next release of Lotus Connections which is a social software offering with 5 services: Profiles, Activities, Blogs, Communities and Dogear which enable user collaboration and knowledge sharing. Senior Test Manager IBM May 2004  –  July 2007  (3 years 3 months) Responsible for Function Verification Test management (FVT) for Lotus Component Designer. Test Manager Lotus/IBM June 1996  –  April 2004  (7 years 11 months) QE Lead/Manager Lotus Development Corporation June 1996  –  July 1999  (3 years 2 months) Researcher University College Dublin August 1994  –  July 1995  (1 year) Cloud Development and Deployment Manager, IBM Connections IBM June 1996  – Present (19 years 3 months) Cloud Development and Deployment Manager, IBM Connections IBM June 1996  – Present (19 years 3 months) Cloud Development and Deployment Manager, IBM Connections IBM June 1996  – Present (19 years 3 months) Cloud Development and Deployment Manager, IBM Connections IBM June 1996  – Present (19 years 3 months) Senior Development Manager, Web Experience Factory, IBM Connections Portlets IBM June 2012  –  June 2014  (2 years 1 month) Littleton,Massachusetts I am responsible for Web Experience Factory development and test and IBM Connections Portlet development. I also own the Learning (LMS / WCL) L3 support mission Senior Development Manager, Web Experience Factory, IBM Connections Portlets IBM June 2012  –  June 2014  (2 years 1 month) Littleton,Massachusetts I am responsible for Web Experience Factory development and test and IBM Connections Portlet development. I also own the Learning (LMS / WCL) L3 support mission Business Operations Manager IBM June 2010  –  June 2012  (2 years 1 month) Business Operations Manager for Advanced Collaboration Development organization. Business Operations Manager IBM June 2010  –  June 2012  (2 years 1 month) Business Operations Manager for Advanced Collaboration Development organization. Senior Function Verification Test Manager IBM October 2008  –  June 2010  (1 year 9 months) Senior Function Verification Test Manager IBM October 2008  –  June 2010  (1 year 9 months) Release Manager IBM July 2007  –  September 2008  (1 year 3 months) Release manager for the next release of Lotus Connections which is a social software offering with 5 services: Profiles, Activities, Blogs, Communities and Dogear which enable user collaboration and knowledge sharing. Release Manager IBM July 2007  –  September 2008  (1 year 3 months) Release manager for the next release of Lotus Connections which is a social software offering with 5 services: Profiles, Activities, Blogs, Communities and Dogear which enable user collaboration and knowledge sharing. Senior Test Manager IBM May 2004  –  July 2007  (3 years 3 months) Responsible for Function Verification Test management (FVT) for Lotus Component Designer. Senior Test Manager IBM May 2004  –  July 2007  (3 years 3 months) Responsible for Function Verification Test management (FVT) for Lotus Component Designer. Test Manager Lotus/IBM June 1996  –  April 2004  (7 years 11 months) Test Manager Lotus/IBM June 1996  –  April 2004  (7 years 11 months) QE Lead/Manager Lotus Development Corporation June 1996  –  July 1999  (3 years 2 months) QE Lead/Manager Lotus Development Corporation June 1996  –  July 1999  (3 years 2 months) Researcher University College Dublin August 1994  –  July 1995  (1 year) Researcher University College Dublin August 1994  –  July 1995  (1 year) Skills Collaboration Solutions Social Software Lotus Connections Lotus Portals Lotus Notes Test Management Websphere Testing WebSphere Portal Cloud Computing Agile Methodologies Software Development Unix Software Project... SQL Process Improvement Portlets Enterprise Software Requirements Analysis See 5+     See less Skills  Collaboration Solutions Social Software Lotus Connections Lotus Portals Lotus Notes Test Management Websphere Testing WebSphere Portal Cloud Computing Agile Methodologies Software Development Unix Software Project... SQL Process Improvement Portlets Enterprise Software Requirements Analysis See 5+     See less Collaboration Solutions Social Software Lotus Connections Lotus Portals Lotus Notes Test Management Websphere Testing WebSphere Portal Cloud Computing Agile Methodologies Software Development Unix Software Project... SQL Process Improvement Portlets Enterprise Software Requirements Analysis See 5+     See less Collaboration Solutions Social Software Lotus Connections Lotus Portals Lotus Notes Test Management Websphere Testing WebSphere Portal Cloud Computing Agile Methodologies Software Development Unix Software Project... SQL Process Improvement Portlets Enterprise Software Requirements Analysis See 5+     See less Education Boston University - School of Management MBA,  MBA 2003  – 2004 Masters of Business Administration  Michael Smurfit Graduate School of Business, University College Dublin DBS,  Postgraduate Diploma in Business Studies 1993  – 1994 Graduate Diploma in Business Studies Ulster University BSc,  Psychology and Sociology 1989  – 1993 BSc Psychology and Sociology Boston University - School of Management MBA,  MBA 2003  – 2004 Masters of Business Administration  Boston University - School of Management MBA,  MBA 2003  – 2004 Masters of Business Administration  Boston University - School of Management MBA,  MBA 2003  – 2004 Masters of Business Administration  Michael Smurfit Graduate School of Business, University College Dublin DBS,  Postgraduate Diploma in Business Studies 1993  – 1994 Graduate Diploma in Business Studies Michael Smurfit Graduate School of Business, University College Dublin DBS,  Postgraduate Diploma in Business Studies 1993  – 1994 Graduate Diploma in Business Studies Michael Smurfit Graduate School of Business, University College Dublin DBS,  Postgraduate Diploma in Business Studies 1993  – 1994 Graduate Diploma in Business Studies Ulster University BSc,  Psychology and Sociology 1989  – 1993 BSc Psychology and Sociology Ulster University BSc,  Psychology and Sociology 1989  – 1993 BSc Psychology and Sociology Ulster University BSc,  Psychology and Sociology 1989  – 1993 BSc Psychology and Sociology ", "Skills Management Consulting Business Strategy Oracle E-Business Suite Change Management Strategy Business Analysis IT Strategy Project Management Outsourcing Business Intelligence Business Transformation Business Process... Projektmanagement Business Process Project Portfolio... ERP Business Development See 2+     See less Skills  Management Consulting Business Strategy Oracle E-Business Suite Change Management Strategy Business Analysis IT Strategy Project Management Outsourcing Business Intelligence Business Transformation Business Process... Projektmanagement Business Process Project Portfolio... ERP Business Development See 2+     See less Management Consulting Business Strategy Oracle E-Business Suite Change Management Strategy Business Analysis IT Strategy Project Management Outsourcing Business Intelligence Business Transformation Business Process... Projektmanagement Business Process Project Portfolio... ERP Business Development See 2+     See less Management Consulting Business Strategy Oracle E-Business Suite Change Management Strategy Business Analysis IT Strategy Project Management Outsourcing Business Intelligence Business Transformation Business Process... Projektmanagement Business Process Project Portfolio... ERP Business Development See 2+     See less ", "Experience Infrastructure Services & GTS Client Unit - Business Operation & Resource Deployment Manager IBM June 2015  – Present (3 months) Israel •responsible for managing project engagement staffing with a focus on balancing organization profit and long-term client opportunity \n• develops and manages the tactical and strategic resource plan and skill management process for the area. \n•Producing analytical reviews on business movements in GTS business Lines Strategic Outsourcing Business Operation & Resource Deployment Manager IBM Global Technology Services October 2014  –  June 2015  (9 months) Israel Assistant Director of Budget and Tuition Beit Berl College May 2013  –  December 2014  (1 year 8 months) Kfar Saba Security Officer Office of the Prime Minister of Israel 2012  –  2013  (1 year) Security Officer Israel Airport Authority 2011  –  2013  (2 years) Israel Infrastructure Services & GTS Client Unit - Business Operation & Resource Deployment Manager IBM June 2015  – Present (3 months) Israel •responsible for managing project engagement staffing with a focus on balancing organization profit and long-term client opportunity \n• develops and manages the tactical and strategic resource plan and skill management process for the area. \n•Producing analytical reviews on business movements in GTS business Lines Infrastructure Services & GTS Client Unit - Business Operation & Resource Deployment Manager IBM June 2015  – Present (3 months) Israel •responsible for managing project engagement staffing with a focus on balancing organization profit and long-term client opportunity \n• develops and manages the tactical and strategic resource plan and skill management process for the area. \n•Producing analytical reviews on business movements in GTS business Lines Strategic Outsourcing Business Operation & Resource Deployment Manager IBM Global Technology Services October 2014  –  June 2015  (9 months) Israel Strategic Outsourcing Business Operation & Resource Deployment Manager IBM Global Technology Services October 2014  –  June 2015  (9 months) Israel Assistant Director of Budget and Tuition Beit Berl College May 2013  –  December 2014  (1 year 8 months) Kfar Saba Assistant Director of Budget and Tuition Beit Berl College May 2013  –  December 2014  (1 year 8 months) Kfar Saba Security Officer Office of the Prime Minister of Israel 2012  –  2013  (1 year) Security Officer Office of the Prime Minister of Israel 2012  –  2013  (1 year) Security Officer Israel Airport Authority 2011  –  2013  (2 years) Israel Security Officer Israel Airport Authority 2011  –  2013  (2 years) Israel Languages English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Business Strategy Business Analysis Physical Security Budgets Risk Management Security Operations Financial Modeling Strategic Financial... Security Finance Project Planning Research Strategy Skills  Business Strategy Business Analysis Physical Security Budgets Risk Management Security Operations Financial Modeling Strategic Financial... Security Finance Project Planning Research Strategy Business Strategy Business Analysis Physical Security Budgets Risk Management Security Operations Financial Modeling Strategic Financial... Security Finance Project Planning Research Strategy Business Strategy Business Analysis Physical Security Budgets Risk Management Security Operations Financial Modeling Strategic Financial... Security Finance Project Planning Research Strategy Education Bar-Ilan University Master's degree 2015  – 2017 The college of Management- Academic Studies Bachelor of Arts (B.A.) 2012  – 2015 Bar-Ilan University Master's degree 2015  – 2017 Bar-Ilan University Master's degree 2015  – 2017 Bar-Ilan University Master's degree 2015  – 2017 The college of Management- Academic Studies Bachelor of Arts (B.A.) 2012  – 2015 The college of Management- Academic Studies Bachelor of Arts (B.A.) 2012  – 2015 The college of Management- Academic Studies Bachelor of Arts (B.A.) 2012  – 2015 ", "Skills Test Automation Testing Test Planning Test Cases Software Quality... Software Documentation Java C++ Linux Unix Perl ClearCase SDLC Agile Methodologies Requirements Analysis Skills  Test Automation Testing Test Planning Test Cases Software Quality... Software Documentation Java C++ Linux Unix Perl ClearCase SDLC Agile Methodologies Requirements Analysis Test Automation Testing Test Planning Test Cases Software Quality... Software Documentation Java C++ Linux Unix Perl ClearCase SDLC Agile Methodologies Requirements Analysis Test Automation Testing Test Planning Test Cases Software Quality... Software Documentation Java C++ Linux Unix Perl ClearCase SDLC Agile Methodologies Requirements Analysis ", "Summary Accomplished business executive with proven performance leading both emerging and established technology businesses. Adept at assembling and leading elite-level talent through strategic planning, product development, customer engineering, and go to market release. Decisive leader with an aptitude for cultivating strategic alliances with global partners. Excellent communicator with a proven history representing the brand at industry forums and with media and industry analysts. Summary Accomplished business executive with proven performance leading both emerging and established technology businesses. Adept at assembling and leading elite-level talent through strategic planning, product development, customer engineering, and go to market release. Decisive leader with an aptitude for cultivating strategic alliances with global partners. Excellent communicator with a proven history representing the brand at industry forums and with media and industry analysts. Accomplished business executive with proven performance leading both emerging and established technology businesses. Adept at assembling and leading elite-level talent through strategic planning, product development, customer engineering, and go to market release. Decisive leader with an aptitude for cultivating strategic alliances with global partners. Excellent communicator with a proven history representing the brand at industry forums and with media and industry analysts. Accomplished business executive with proven performance leading both emerging and established technology businesses. Adept at assembling and leading elite-level talent through strategic planning, product development, customer engineering, and go to market release. Decisive leader with an aptitude for cultivating strategic alliances with global partners. Excellent communicator with a proven history representing the brand at industry forums and with media and industry analysts. Experience Worldwide Deployment Manager, IBM MobileFirst IBM January 2014  – Present (1 year 8 months) North America Deployment Manager, IBM Worklight IBM June 2013  –  January 2014  (8 months) IBM Vice President, Industry Solutions Mobiquity, Inc. June 2012  –  May 2013  (1 year) V.P. and GM Travel, Hospitality, Entertainment and Media Kony Solutions June 2011  –  June 2012  (1 year 1 month) Orlando V.P. and GM Travel and Gaming Line of Business NCR 2009  –  August 2011  (2 years) Vice President, Multi-Industry Self Service Product Management NCR Corporation 2008  –  2009  (1 year) Orlando, Florida Area President, NCR Self Service, LLC/Kinetics, Inc. NCR Corporation 2006  –  2008  (2 years) Orlando, Florida Area Vice President, Business Development and Director of Professional Services Kinetics, Inc. 2000  –  2006  (6 years) Orlando, Florida Area Worldwide Deployment Manager, IBM MobileFirst IBM January 2014  – Present (1 year 8 months) Worldwide Deployment Manager, IBM MobileFirst IBM January 2014  – Present (1 year 8 months) North America Deployment Manager, IBM Worklight IBM June 2013  –  January 2014  (8 months) IBM North America Deployment Manager, IBM Worklight IBM June 2013  –  January 2014  (8 months) IBM Vice President, Industry Solutions Mobiquity, Inc. June 2012  –  May 2013  (1 year) Vice President, Industry Solutions Mobiquity, Inc. June 2012  –  May 2013  (1 year) V.P. and GM Travel, Hospitality, Entertainment and Media Kony Solutions June 2011  –  June 2012  (1 year 1 month) Orlando V.P. and GM Travel, Hospitality, Entertainment and Media Kony Solutions June 2011  –  June 2012  (1 year 1 month) Orlando V.P. and GM Travel and Gaming Line of Business NCR 2009  –  August 2011  (2 years) V.P. and GM Travel and Gaming Line of Business NCR 2009  –  August 2011  (2 years) Vice President, Multi-Industry Self Service Product Management NCR Corporation 2008  –  2009  (1 year) Orlando, Florida Area Vice President, Multi-Industry Self Service Product Management NCR Corporation 2008  –  2009  (1 year) Orlando, Florida Area President, NCR Self Service, LLC/Kinetics, Inc. NCR Corporation 2006  –  2008  (2 years) Orlando, Florida Area President, NCR Self Service, LLC/Kinetics, Inc. NCR Corporation 2006  –  2008  (2 years) Orlando, Florida Area Vice President, Business Development and Director of Professional Services Kinetics, Inc. 2000  –  2006  (6 years) Orlando, Florida Area Vice President, Business Development and Director of Professional Services Kinetics, Inc. 2000  –  2006  (6 years) Orlando, Florida Area Skills Strategic Partnerships Mobile Devices SaaS Product Management Mobile Applications Enterprise Software Cloud Computing Start-ups Go-to-market Strategy Product Development E-commerce Leadership Business Development Strategic Planning Solution Selling Professional Services See 1+     See less Skills  Strategic Partnerships Mobile Devices SaaS Product Management Mobile Applications Enterprise Software Cloud Computing Start-ups Go-to-market Strategy Product Development E-commerce Leadership Business Development Strategic Planning Solution Selling Professional Services See 1+     See less Strategic Partnerships Mobile Devices SaaS Product Management Mobile Applications Enterprise Software Cloud Computing Start-ups Go-to-market Strategy Product Development E-commerce Leadership Business Development Strategic Planning Solution Selling Professional Services See 1+     See less Strategic Partnerships Mobile Devices SaaS Product Management Mobile Applications Enterprise Software Cloud Computing Start-ups Go-to-market Strategy Product Development E-commerce Leadership Business Development Strategic Planning Solution Selling Professional Services See 1+     See less Education University of Colorado at Boulder Bachelor of Science (B.S.),  Computer Science Engineering University of Colorado at Boulder Bachelor of Science (B.S.),  Computer Science Engineering University of Colorado at Boulder Bachelor of Science (B.S.),  Computer Science Engineering University of Colorado at Boulder Bachelor of Science (B.S.),  Computer Science Engineering ", "Languages German French German French German French Skills Security Solution Architecture Cloud Computing Pre-sales Enterprise Architecture IT Strategy IT Service Management ITIL Virtualization Enterprise Software IT Management Solution Selling Professional Services Network Security SaaS Business Continuity Service Management Data Center Unix Disaster Recovery Information Security Management Managed Services VMware Computer Security Identity Management Information Technology Information Security... Governance Incident Management IT Outsourcing Storage Presales Leadership See 19+     See less Skills  Security Solution Architecture Cloud Computing Pre-sales Enterprise Architecture IT Strategy IT Service Management ITIL Virtualization Enterprise Software IT Management Solution Selling Professional Services Network Security SaaS Business Continuity Service Management Data Center Unix Disaster Recovery Information Security Management Managed Services VMware Computer Security Identity Management Information Technology Information Security... Governance Incident Management IT Outsourcing Storage Presales Leadership See 19+     See less Security Solution Architecture Cloud Computing Pre-sales Enterprise Architecture IT Strategy IT Service Management ITIL Virtualization Enterprise Software IT Management Solution Selling Professional Services Network Security SaaS Business Continuity Service Management Data Center Unix Disaster Recovery Information Security Management Managed Services VMware Computer Security Identity Management Information Technology Information Security... Governance Incident Management IT Outsourcing Storage Presales Leadership See 19+     See less Security Solution Architecture Cloud Computing Pre-sales Enterprise Architecture IT Strategy IT Service Management ITIL Virtualization Enterprise Software IT Management Solution Selling Professional Services Network Security SaaS Business Continuity Service Management Data Center Unix Disaster Recovery Information Security Management Managed Services VMware Computer Security Identity Management Information Technology Information Security... Governance Incident Management IT Outsourcing Storage Presales Leadership See 19+     See less ", "Languages French French French Skills Telecommunications Project Management Enterprise Software PMP Start-ups Change Management Management Software Development GSM Professional Services Integration Software Project... Skills  Telecommunications Project Management Enterprise Software PMP Start-ups Change Management Management Software Development GSM Professional Services Integration Software Project... Telecommunications Project Management Enterprise Software PMP Start-ups Change Management Management Software Development GSM Professional Services Integration Software Project... Telecommunications Project Management Enterprise Software PMP Start-ups Change Management Management Software Development GSM Professional Services Integration Software Project... ", "Experience MEA Lead PSP ( Project staffing ) IBM Global Services January 2013  – Present (2 years 8 months) Istanbul, Central Eastern Europe Countries Lead with experience the Resource and Capacity Management (R&CM) global resource processes, tools, and all resource channels to achieve successful practitioner placement on appropriate engagements. \nManage R&CM processes, including deployment, reporting, tracking, documentation, and utilization. \nEnsure that project resource needs are met and that revenue and profit are maximized by providing leadership for finding and staffing appropriate domestic, global delivery, and subcontractor resources on client engagements. \nComplete assignments that align resource capacity with business strategies to ensure utilization and financial targets are met.  \nDemonstrate acquired knowledge about the sector, service, solution, or competencies supported and use this knowledge to accomplish tasks with decreasing levels of guidance.  \nDemonstrate detail-oriented focus when contributing to project staffing status updates, developing candidate lists and availability updates, and providing other as-needed project and resource information and documentation. \nParticipate as a contributing R&CM member of a global shared services team by demonstrating flexibility in response to changing project needs. Collaborate with other resource staffing R&CM colleagues, project managers, subcontractor agencies, and/or people managers as needed to achieve common goals. \nContribute to achieving company’s revenue and profit goals by being accountable for individual results, including the quality and timeliness of completed assignments and achieving client and project satisfaction. \nDemonstrate professional interpersonal communications and social skills, and oral and written communications skills. \nRecognize job-related problems relative to assignments and resolve them with guidance from higher-band-level personnel. Lead Resource Deployment Manager CEE GMT IBM December 2010  –  December 2012  (2 years 1 month) Istanbul Maintain and enhance management system that drives strong and predictable quarterly operational execution across all dimensions of the business.  \nSupport movement of resources to capture opportunities to increase revenue and cost recovery \nMaintain satisfactory controls posture, identify and implement corrective actions, maintain zero tolerance for violations of IBM business conduct guidelines and processes and procedures and drive successful outcomes of internal audits \nDrive improvements in processes and tools to increase productivity, operational excellence, and enhance operational capabilities  \n \nLead by example, setting clear performance standards, provide straightforward feedback, recognise top performers and actively manage low contributors \nEnsure a positive, high-performance climate; listen to teams, address issues and help needed to succeed in IBM's environment \nFoster teamwork and inclusion among all employees -- across locations, cultures and geos -- and promote IBM's value of diversity Enterprise Applications Lead Resource Deployment Manager IBM Turkey December 2009  –  November 2010  (1 year) Istanbul, Turkey Maintain and enhance management system that drives strong and predictable quarterly operational execution across all dimensions of the business.  \nSupport movement of resources to capture opportunities to increase revenue and cost recovery \nMaintain satisfactory controls posture, identify and implement corrective actions, maintain zero tolerance for violations of IBM business conduct guidelines and processes and procedures and drive successful outcomes of internal audits \nDrive improvements in processes and tools to increase productivity, operational excellence, and enhance operational capabilities Resource Deployment Manager IBM Turkey April 2007  –  December 2009  (2 years 9 months) Istanbul, Turkey Staffing and Deployment: \n \nOn a daily basis, proactively manage the tactical staffing of practitioners focusing on bench management, utilization, profitability, practitioner skill match and development, and client satisfaction. \nMonitor availability of key skills, skill gaps, and skill shortages and surpluses; work with business leaders to ensure proper balance of skills and pipeline; provide input for recruiting and hiring including the canceling of requisitions which are no longer needed \nParticipate in hiring and recruiting efforts by communicating business needs, staffing requirements, and conducting screening and interviewing activities as appropriate \nUnderstand individual practitioner’s skill sets, geographic area, and key development goals; proactively staff new hires. \n \nUtillization,Tool, Systems, and Metrics management: \n \nBe proficient with and regularly use the various systems and tools  \nUpdate data in related systems daily to ensure proper new hire alignment, open seats, availability dates, resumes/CV’s, etc. Proactively maintain accuracy of critical data (available dates, assignment data, open seat details. \nBe knowledgeable and current on who is on the bench, watch list, missing claim, etc., in order to help drive business results and achievement of targets \nAssist practice area management in missing and unapproved timesheets actions, with the goal of driving to zero missing each week, as well as at quarter close.  \nPerform weekly deep dive on actual utilization results for practice staff, \nProvide accurate reporting and analysis to drive improved performance and delivery efficiency Human Resources Specialist Uline September 2002  –  December 2005  (3 years 4 months) Lake Forest, California California branch Human Resources Recruiter/Specialist, responsible for delivering all facets of recruiting success throughout the organization. This has been achieved through the development of local recruiting plans, employing traditional sourcing strategies and resources as well as developing new, creative recruiting ideas.  \n \n•Develop and execute recruiting plans. \n•Network through industry contacts, association memberships, trade groups and employees. \n•Coordinate and implement college recruiting initiatives. \n•Coordinate performance management and improvement systems; \n•Maintain employment compliance to regulatory concerns \n•Work on organization development; MEA Lead PSP ( Project staffing ) IBM Global Services January 2013  – Present (2 years 8 months) Istanbul, Central Eastern Europe Countries Lead with experience the Resource and Capacity Management (R&CM) global resource processes, tools, and all resource channels to achieve successful practitioner placement on appropriate engagements. \nManage R&CM processes, including deployment, reporting, tracking, documentation, and utilization. \nEnsure that project resource needs are met and that revenue and profit are maximized by providing leadership for finding and staffing appropriate domestic, global delivery, and subcontractor resources on client engagements. \nComplete assignments that align resource capacity with business strategies to ensure utilization and financial targets are met.  \nDemonstrate acquired knowledge about the sector, service, solution, or competencies supported and use this knowledge to accomplish tasks with decreasing levels of guidance.  \nDemonstrate detail-oriented focus when contributing to project staffing status updates, developing candidate lists and availability updates, and providing other as-needed project and resource information and documentation. \nParticipate as a contributing R&CM member of a global shared services team by demonstrating flexibility in response to changing project needs. Collaborate with other resource staffing R&CM colleagues, project managers, subcontractor agencies, and/or people managers as needed to achieve common goals. \nContribute to achieving company’s revenue and profit goals by being accountable for individual results, including the quality and timeliness of completed assignments and achieving client and project satisfaction. \nDemonstrate professional interpersonal communications and social skills, and oral and written communications skills. \nRecognize job-related problems relative to assignments and resolve them with guidance from higher-band-level personnel. MEA Lead PSP ( Project staffing ) IBM Global Services January 2013  – Present (2 years 8 months) Istanbul, Central Eastern Europe Countries Lead with experience the Resource and Capacity Management (R&CM) global resource processes, tools, and all resource channels to achieve successful practitioner placement on appropriate engagements. \nManage R&CM processes, including deployment, reporting, tracking, documentation, and utilization. \nEnsure that project resource needs are met and that revenue and profit are maximized by providing leadership for finding and staffing appropriate domestic, global delivery, and subcontractor resources on client engagements. \nComplete assignments that align resource capacity with business strategies to ensure utilization and financial targets are met.  \nDemonstrate acquired knowledge about the sector, service, solution, or competencies supported and use this knowledge to accomplish tasks with decreasing levels of guidance.  \nDemonstrate detail-oriented focus when contributing to project staffing status updates, developing candidate lists and availability updates, and providing other as-needed project and resource information and documentation. \nParticipate as a contributing R&CM member of a global shared services team by demonstrating flexibility in response to changing project needs. Collaborate with other resource staffing R&CM colleagues, project managers, subcontractor agencies, and/or people managers as needed to achieve common goals. \nContribute to achieving company’s revenue and profit goals by being accountable for individual results, including the quality and timeliness of completed assignments and achieving client and project satisfaction. \nDemonstrate professional interpersonal communications and social skills, and oral and written communications skills. \nRecognize job-related problems relative to assignments and resolve them with guidance from higher-band-level personnel. Lead Resource Deployment Manager CEE GMT IBM December 2010  –  December 2012  (2 years 1 month) Istanbul Maintain and enhance management system that drives strong and predictable quarterly operational execution across all dimensions of the business.  \nSupport movement of resources to capture opportunities to increase revenue and cost recovery \nMaintain satisfactory controls posture, identify and implement corrective actions, maintain zero tolerance for violations of IBM business conduct guidelines and processes and procedures and drive successful outcomes of internal audits \nDrive improvements in processes and tools to increase productivity, operational excellence, and enhance operational capabilities  \n \nLead by example, setting clear performance standards, provide straightforward feedback, recognise top performers and actively manage low contributors \nEnsure a positive, high-performance climate; listen to teams, address issues and help needed to succeed in IBM's environment \nFoster teamwork and inclusion among all employees -- across locations, cultures and geos -- and promote IBM's value of diversity Lead Resource Deployment Manager CEE GMT IBM December 2010  –  December 2012  (2 years 1 month) Istanbul Maintain and enhance management system that drives strong and predictable quarterly operational execution across all dimensions of the business.  \nSupport movement of resources to capture opportunities to increase revenue and cost recovery \nMaintain satisfactory controls posture, identify and implement corrective actions, maintain zero tolerance for violations of IBM business conduct guidelines and processes and procedures and drive successful outcomes of internal audits \nDrive improvements in processes and tools to increase productivity, operational excellence, and enhance operational capabilities  \n \nLead by example, setting clear performance standards, provide straightforward feedback, recognise top performers and actively manage low contributors \nEnsure a positive, high-performance climate; listen to teams, address issues and help needed to succeed in IBM's environment \nFoster teamwork and inclusion among all employees -- across locations, cultures and geos -- and promote IBM's value of diversity Enterprise Applications Lead Resource Deployment Manager IBM Turkey December 2009  –  November 2010  (1 year) Istanbul, Turkey Maintain and enhance management system that drives strong and predictable quarterly operational execution across all dimensions of the business.  \nSupport movement of resources to capture opportunities to increase revenue and cost recovery \nMaintain satisfactory controls posture, identify and implement corrective actions, maintain zero tolerance for violations of IBM business conduct guidelines and processes and procedures and drive successful outcomes of internal audits \nDrive improvements in processes and tools to increase productivity, operational excellence, and enhance operational capabilities Enterprise Applications Lead Resource Deployment Manager IBM Turkey December 2009  –  November 2010  (1 year) Istanbul, Turkey Maintain and enhance management system that drives strong and predictable quarterly operational execution across all dimensions of the business.  \nSupport movement of resources to capture opportunities to increase revenue and cost recovery \nMaintain satisfactory controls posture, identify and implement corrective actions, maintain zero tolerance for violations of IBM business conduct guidelines and processes and procedures and drive successful outcomes of internal audits \nDrive improvements in processes and tools to increase productivity, operational excellence, and enhance operational capabilities Resource Deployment Manager IBM Turkey April 2007  –  December 2009  (2 years 9 months) Istanbul, Turkey Staffing and Deployment: \n \nOn a daily basis, proactively manage the tactical staffing of practitioners focusing on bench management, utilization, profitability, practitioner skill match and development, and client satisfaction. \nMonitor availability of key skills, skill gaps, and skill shortages and surpluses; work with business leaders to ensure proper balance of skills and pipeline; provide input for recruiting and hiring including the canceling of requisitions which are no longer needed \nParticipate in hiring and recruiting efforts by communicating business needs, staffing requirements, and conducting screening and interviewing activities as appropriate \nUnderstand individual practitioner’s skill sets, geographic area, and key development goals; proactively staff new hires. \n \nUtillization,Tool, Systems, and Metrics management: \n \nBe proficient with and regularly use the various systems and tools  \nUpdate data in related systems daily to ensure proper new hire alignment, open seats, availability dates, resumes/CV’s, etc. Proactively maintain accuracy of critical data (available dates, assignment data, open seat details. \nBe knowledgeable and current on who is on the bench, watch list, missing claim, etc., in order to help drive business results and achievement of targets \nAssist practice area management in missing and unapproved timesheets actions, with the goal of driving to zero missing each week, as well as at quarter close.  \nPerform weekly deep dive on actual utilization results for practice staff, \nProvide accurate reporting and analysis to drive improved performance and delivery efficiency Resource Deployment Manager IBM Turkey April 2007  –  December 2009  (2 years 9 months) Istanbul, Turkey Staffing and Deployment: \n \nOn a daily basis, proactively manage the tactical staffing of practitioners focusing on bench management, utilization, profitability, practitioner skill match and development, and client satisfaction. \nMonitor availability of key skills, skill gaps, and skill shortages and surpluses; work with business leaders to ensure proper balance of skills and pipeline; provide input for recruiting and hiring including the canceling of requisitions which are no longer needed \nParticipate in hiring and recruiting efforts by communicating business needs, staffing requirements, and conducting screening and interviewing activities as appropriate \nUnderstand individual practitioner’s skill sets, geographic area, and key development goals; proactively staff new hires. \n \nUtillization,Tool, Systems, and Metrics management: \n \nBe proficient with and regularly use the various systems and tools  \nUpdate data in related systems daily to ensure proper new hire alignment, open seats, availability dates, resumes/CV’s, etc. Proactively maintain accuracy of critical data (available dates, assignment data, open seat details. \nBe knowledgeable and current on who is on the bench, watch list, missing claim, etc., in order to help drive business results and achievement of targets \nAssist practice area management in missing and unapproved timesheets actions, with the goal of driving to zero missing each week, as well as at quarter close.  \nPerform weekly deep dive on actual utilization results for practice staff, \nProvide accurate reporting and analysis to drive improved performance and delivery efficiency Human Resources Specialist Uline September 2002  –  December 2005  (3 years 4 months) Lake Forest, California California branch Human Resources Recruiter/Specialist, responsible for delivering all facets of recruiting success throughout the organization. This has been achieved through the development of local recruiting plans, employing traditional sourcing strategies and resources as well as developing new, creative recruiting ideas.  \n \n•Develop and execute recruiting plans. \n•Network through industry contacts, association memberships, trade groups and employees. \n•Coordinate and implement college recruiting initiatives. \n•Coordinate performance management and improvement systems; \n•Maintain employment compliance to regulatory concerns \n•Work on organization development; Human Resources Specialist Uline September 2002  –  December 2005  (3 years 4 months) Lake Forest, California California branch Human Resources Recruiter/Specialist, responsible for delivering all facets of recruiting success throughout the organization. This has been achieved through the development of local recruiting plans, employing traditional sourcing strategies and resources as well as developing new, creative recruiting ideas.  \n \n•Develop and execute recruiting plans. \n•Network through industry contacts, association memberships, trade groups and employees. \n•Coordinate and implement college recruiting initiatives. \n•Coordinate performance management and improvement systems; \n•Maintain employment compliance to regulatory concerns \n•Work on organization development; Skills Resource Management Process Improvement Problem Solving Analysis Planning Operations Management Microsoft Office Hiring Sourcing Excel Talent Management Workforce Planning Recruiting Project Planning Business Strategy Business Transformation Project Management Human Resources Management Consulting Organizational... Business Process... Leadership See 7+     See less Skills  Resource Management Process Improvement Problem Solving Analysis Planning Operations Management Microsoft Office Hiring Sourcing Excel Talent Management Workforce Planning Recruiting Project Planning Business Strategy Business Transformation Project Management Human Resources Management Consulting Organizational... Business Process... Leadership See 7+     See less Resource Management Process Improvement Problem Solving Analysis Planning Operations Management Microsoft Office Hiring Sourcing Excel Talent Management Workforce Planning Recruiting Project Planning Business Strategy Business Transformation Project Management Human Resources Management Consulting Organizational... Business Process... Leadership See 7+     See less Resource Management Process Improvement Problem Solving Analysis Planning Operations Management Microsoft Office Hiring Sourcing Excel Talent Management Workforce Planning Recruiting Project Planning Business Strategy Business Transformation Project Management Human Resources Management Consulting Organizational... Business Process... Leadership See 7+     See less Education University of California, Irvine Professional Certificate,  Human Resources Management 2001  – 2002 Marmara Üniversitesi Master of Arts,  Human Resources Management 2000  – 2001 Graduated with Honors Marmara Üniversitesi Bachelor of Arts,  English Language Teaching 1996  – 2000 University of California, Irvine Professional Certificate,  Human Resources Management 2001  – 2002 University of California, Irvine Professional Certificate,  Human Resources Management 2001  – 2002 University of California, Irvine Professional Certificate,  Human Resources Management 2001  – 2002 Marmara Üniversitesi Master of Arts,  Human Resources Management 2000  – 2001 Graduated with Honors Marmara Üniversitesi Master of Arts,  Human Resources Management 2000  – 2001 Graduated with Honors Marmara Üniversitesi Master of Arts,  Human Resources Management 2000  – 2001 Graduated with Honors Marmara Üniversitesi Bachelor of Arts,  English Language Teaching 1996  – 2000 Marmara Üniversitesi Bachelor of Arts,  English Language Teaching 1996  – 2000 Marmara Üniversitesi Bachelor of Arts,  English Language Teaching 1996  – 2000 Honors & Awards Additional Honors & Awards First runner at Marmara University Lang. Teaching BA degree - year 2000 Additional Honors & Awards First runner at Marmara University Lang. Teaching BA degree - year 2000 Additional Honors & Awards First runner at Marmara University Lang. Teaching BA degree - year 2000 Additional Honors & Awards First runner at Marmara University Lang. Teaching BA degree - year 2000 ", "Summary SENIOR RESOURCE DEPLOYMENT MANAGER \n \nPartner with senior leadership to ensure optimum resource deployment resulting in project\tdelivery excellence and customer satisfaction \n \nLeverage extensive knowledge of resources skills, capabilities and pipeline demands to flawlessly execute deployment processes and maximize productivity and customer satisfaction. Consultative style fosters a culture that embraces collaboration and strong relationships with stakeholders. \n \nExpertise Includes: \n•Business Intelligence\t \n•Financial Services \n•Process planning and design \n•Resource and Capacity Management\t \n•Pipeline Demand Management \n•Recruiting\t \n•Career Development and mentoring Summary SENIOR RESOURCE DEPLOYMENT MANAGER \n \nPartner with senior leadership to ensure optimum resource deployment resulting in project\tdelivery excellence and customer satisfaction \n \nLeverage extensive knowledge of resources skills, capabilities and pipeline demands to flawlessly execute deployment processes and maximize productivity and customer satisfaction. Consultative style fosters a culture that embraces collaboration and strong relationships with stakeholders. \n \nExpertise Includes: \n•Business Intelligence\t \n•Financial Services \n•Process planning and design \n•Resource and Capacity Management\t \n•Pipeline Demand Management \n•Recruiting\t \n•Career Development and mentoring SENIOR RESOURCE DEPLOYMENT MANAGER \n \nPartner with senior leadership to ensure optimum resource deployment resulting in project\tdelivery excellence and customer satisfaction \n \nLeverage extensive knowledge of resources skills, capabilities and pipeline demands to flawlessly execute deployment processes and maximize productivity and customer satisfaction. Consultative style fosters a culture that embraces collaboration and strong relationships with stakeholders. \n \nExpertise Includes: \n•Business Intelligence\t \n•Financial Services \n•Process planning and design \n•Resource and Capacity Management\t \n•Pipeline Demand Management \n•Recruiting\t \n•Career Development and mentoring SENIOR RESOURCE DEPLOYMENT MANAGER \n \nPartner with senior leadership to ensure optimum resource deployment resulting in project\tdelivery excellence and customer satisfaction \n \nLeverage extensive knowledge of resources skills, capabilities and pipeline demands to flawlessly execute deployment processes and maximize productivity and customer satisfaction. Consultative style fosters a culture that embraces collaboration and strong relationships with stakeholders. \n \nExpertise Includes: \n•Business Intelligence\t \n•Financial Services \n•Process planning and design \n•Resource and Capacity Management\t \n•Pipeline Demand Management \n•Recruiting\t \n•Career Development and mentoring Experience Resource Deployment Manager Verizon Enterprise Solutions May 2014  – Present (1 year 4 months) Greater Atlanta Area Directly responsible for deployment activities for the Global Transformational Technology Practice in the Professional Services division. Offerings include Cloud and IT Advisory, Mobility and M2M. \nResponsibilities include: \n•\tManages resource assignments and utilization forecasts in the Clarity Portfolio and Project Management tool. \n•\tLeads weekly staffing calls with Managing Principals and project managers reviewing utilization forecasts, resource availability, excess capacity and over-allocated resources; executes real time updates to balance workload allocations, and acquires additional resources as needed to resolve conflicts. \n•\tAssigning resources to billable projects in SAP timekeeping tool to enable timesheet entry for customer billing and invoicing. \n•\tSupports the project Governance team with contract revenue management to ensure compliance with SOW and contract terms. \n•\tExtracts opportunity data from Salesforce.com to review with Managing Principals and Project managers to plan for upcoming staffing and deployment needs. \n•\tAssigns appropriate resources to engagements, which requires assessing the engagement staffing needs, reviewing available options and recommending resources that meet the requirements. \n•\tPromotes sharing resources across service lines to address resource needs and conflicts. \n•\tMonitors unassigned resources and act as primary point of contact for unassigned staff; proactively identify assignments for resources as they show upcoming availability.  \n•\tIdentifies over and under-utilized resources balancing the workloads across the team. \n•\tWorks with Managing Principals to on-board sub-contractors and integrate new hires into the teams.  \n•\tTrusted advisor supporting and assisting Principals, project managers and senior management in the resolution of staffing conflicts. \n•\tWorks with senior management teams to forecast project staffing demands, analyse staff availability, evaluate variances and plan for hiring.  \n Sr. Project Staffing Professional (PSP) IBM Global Services September 2012  –  March 2014  (1 year 7 months) Marietta, GA Manage Demand, Staffing and Fulfillment for the Business Analytics and Optimization Practice Area (BAO) in the Financial Services Sector. Resource Deployment Manager IBM January 2009  –  August 2012  (3 years 8 months) Greater Atlanta Area Lead Resource Deployment Manager for Business Analytics and Optimization (BAO) Practice for the Financial Services Sector . \n \nLead RDM for the BAO Service Line and POC for the Financial Services Sector covering a headcount of 240+ resources. Onboarded 78 new hire resources for an overall growth rate percent of 22%.Collaborate with the FS BAO Leadership team by providing staffing expertise and recommendations to improve utilization and bench management. Responsible for resolving any escalations related to staffing dynamics. Overachieved on the practice area utilization targets and the required bench levels. \n \nManage and report on all FS BAO practice operations providing analysis into utilization forecasting, bench management, actual utilization and discrepancies. Proactively address discrepancies with recommended actions for remediation. Engage the Human Resources Partners for performance issues contributing to low tier utilization. \n \nActively engage with the recruiting team as the point of contact to manage the assessment center interview days for all sectors across BAO. Responsible for organizing interviewers to attend the recruiting events according to the type of skills that are being targeted. Attended many of the events as an assessor for candidates on the interview case study. Received a Service Excellence award for leading the recruiting process for the RDM team. \n \nManage the proper balance of resources and skills to meet staffing requirements for current and upcoming projects based on the opportunity pipeline. Utilize alternate resource channels such as subcontracting through our vendors or global resourcing to meet the project demands working closely with procurement and global teams. \n \nWork closely with Human Resources and the management team to enhance skills and capabilities of practitioners resulting in reduced attrition and supporting professional development goals. Provided input to career progression and performance assessment for team members. Resource Deployment Manager IBM January 2003  –  December 2008  (6 years) Greater Atlanta Area Lead Resource Deployment Manager for the Customer Relationship Management (CRM) Practice in the Financial Services Sector focused on the Marketing and Customer Intelligence Service Area. \n \nContributed to achieving the revenue and profit targets of the CRM Practice in the Financial Services Practice by achieving average yearly utilization targets of 78%. \nManaged up to 150 Business Intelligence Consultants and was instrumental in working with the sr. leadership team to merge the PWC consultants with the legacy IBM consultants after the PWC acquisition. \n \nProactively supported the rollout of new RDM tools and processes to support the following functional areas: \nProfessional Develop Tool for skills, staffing and assignment tracking. \nProfessional Utilization Forecasting to support the monthly forecasting process. \nProject Staffing Request Database \nProfessional Development and Career Framework supporting the advancement of\tkey talent and star performers \n \nSupport Partners. Practice leaders and other members of the executive leadership team being recognized as a leader and trusted advisor. My extensive knowledge of the resources skills/abilities and constant focus on deployment are keys to achieving success. \n \nPrepare several ongoing reviews and analysis of the practice metrics which enables the leadership team to take decisive actions to meet the practice objectives. Resource Deployment Manager IBM May 1999  –  December 2002  (3 years 8 months) Marietta, GA Lead Resource Deployment Manager for the Business Intelligence Competency of the Business Innovation Services Consulting Practice in the Financial Services Sector. \n \nLead and manage the Business Innovation Services opportunity and resource deployment/staffing process for the Business Intelligence Competency. Mentor and guide the RDM community in process execution and improvement to strengthen the teaming aspect of the RDM team. \n \nProvided end-to-end Utilization Forecast on a monthly basis and achieved the annual target of 75%. \n \nDrive the staffing and deployment for a team of 120 Business Intelligence Practitioners consistently achieving an average bench percentage of less than 7 percent. Work closely with Human Resources and the management team to enhance skills and capabilities of practitioners resulting in reduced attrition and supporting professional development goals. \n \nWork closely with practice executives, principals, practice leaders, delivery managers and talent executives addressing resource staffing requirements with speed and professionalism. \n \nParticipate in hiring and recruiting of new talent to meet the current and projected staffing requirements, conducting screening and interviews. Sr. Consultant IBM March 1997  –  May 1999  (2 years 3 months) Greater Atlanta Area ERP Supply Chain Management Consultant  \n \nImplemented packaged ERP solutions on an AS/400 platform specializing in Customer Order Management, Distribution, Purchasing and Manufacturing Planning applications. \nResponsibilities included: \n•\tDatabase design and build for the Manufacturing modules of the BPCS ERP software.  \n•\tEnd user training for the BPCS ERP Manufacturing modules. \n•\tIntegration of 3rd party software with the BPCS Customer Order Management software \n \nYear 2000 Remediation Consultant \nClient – Bristol Meyers Squibb (US, Mexico and Puerto Rico)  \nLead the technical implementation for a major multi-site, multi-national Year 2000 remediation project with responsibility for the assessment of multiple AS/400 systems across multiple customer locations. Responsibilities included: \n•\tAssessment and inventory analysis of the programs and data on the AS/400 BPCS systems \n•\tExecution and analysis of an AS/400 program/data inventory tool across multiple AS/400 systems in Mexico and Puerto Rico \n•\tArchitected the testing strategy and led end-users in the preparation of test protocols to be used following the remediation Sr. Application Consultant Marcam May 1993  –  March 1997  (3 years 11 months) Greater Atlanta Area Sr. Application Consultant  \nLead Customer Support Representative for the Customer Order Management Application (COM) of the MAPICS XA software for the AS/400. Responsibilities included: \n•\tOn-site customer implementation and training services \n•\tHandling complex application and implementation usage questions via telephone support \n•\tProviding direction on the functional design and future direction of the COM application to the development organization \n•\tProviding leadership and technical direction to members of the COM product support team Sr. Customer Support Representative IBM October 1986  –  April 1993  (6 years 7 months) Greater Atlanta Area Customer Support Representative \nCustomer support of MAPICS/DB applications including Cross Application Support (CAS), Order Entry and Invoicing, Accounts Receivable, Sales Analysis and Purchasing. \nLiaison between development and support organizations for CAS customer requirements. \nProvided education on MAPICS/DB Architecture and Operations for locally taught customer classes and customized training on customer site. Resource Deployment Manager Verizon Enterprise Solutions May 2014  – Present (1 year 4 months) Greater Atlanta Area Directly responsible for deployment activities for the Global Transformational Technology Practice in the Professional Services division. Offerings include Cloud and IT Advisory, Mobility and M2M. \nResponsibilities include: \n•\tManages resource assignments and utilization forecasts in the Clarity Portfolio and Project Management tool. \n•\tLeads weekly staffing calls with Managing Principals and project managers reviewing utilization forecasts, resource availability, excess capacity and over-allocated resources; executes real time updates to balance workload allocations, and acquires additional resources as needed to resolve conflicts. \n•\tAssigning resources to billable projects in SAP timekeeping tool to enable timesheet entry for customer billing and invoicing. \n•\tSupports the project Governance team with contract revenue management to ensure compliance with SOW and contract terms. \n•\tExtracts opportunity data from Salesforce.com to review with Managing Principals and Project managers to plan for upcoming staffing and deployment needs. \n•\tAssigns appropriate resources to engagements, which requires assessing the engagement staffing needs, reviewing available options and recommending resources that meet the requirements. \n•\tPromotes sharing resources across service lines to address resource needs and conflicts. \n•\tMonitors unassigned resources and act as primary point of contact for unassigned staff; proactively identify assignments for resources as they show upcoming availability.  \n•\tIdentifies over and under-utilized resources balancing the workloads across the team. \n•\tWorks with Managing Principals to on-board sub-contractors and integrate new hires into the teams.  \n•\tTrusted advisor supporting and assisting Principals, project managers and senior management in the resolution of staffing conflicts. \n•\tWorks with senior management teams to forecast project staffing demands, analyse staff availability, evaluate variances and plan for hiring.  \n Resource Deployment Manager Verizon Enterprise Solutions May 2014  – Present (1 year 4 months) Greater Atlanta Area Directly responsible for deployment activities for the Global Transformational Technology Practice in the Professional Services division. Offerings include Cloud and IT Advisory, Mobility and M2M. \nResponsibilities include: \n•\tManages resource assignments and utilization forecasts in the Clarity Portfolio and Project Management tool. \n•\tLeads weekly staffing calls with Managing Principals and project managers reviewing utilization forecasts, resource availability, excess capacity and over-allocated resources; executes real time updates to balance workload allocations, and acquires additional resources as needed to resolve conflicts. \n•\tAssigning resources to billable projects in SAP timekeeping tool to enable timesheet entry for customer billing and invoicing. \n•\tSupports the project Governance team with contract revenue management to ensure compliance with SOW and contract terms. \n•\tExtracts opportunity data from Salesforce.com to review with Managing Principals and Project managers to plan for upcoming staffing and deployment needs. \n•\tAssigns appropriate resources to engagements, which requires assessing the engagement staffing needs, reviewing available options and recommending resources that meet the requirements. \n•\tPromotes sharing resources across service lines to address resource needs and conflicts. \n•\tMonitors unassigned resources and act as primary point of contact for unassigned staff; proactively identify assignments for resources as they show upcoming availability.  \n•\tIdentifies over and under-utilized resources balancing the workloads across the team. \n•\tWorks with Managing Principals to on-board sub-contractors and integrate new hires into the teams.  \n•\tTrusted advisor supporting and assisting Principals, project managers and senior management in the resolution of staffing conflicts. \n•\tWorks with senior management teams to forecast project staffing demands, analyse staff availability, evaluate variances and plan for hiring.  \n Sr. Project Staffing Professional (PSP) IBM Global Services September 2012  –  March 2014  (1 year 7 months) Marietta, GA Manage Demand, Staffing and Fulfillment for the Business Analytics and Optimization Practice Area (BAO) in the Financial Services Sector. Sr. Project Staffing Professional (PSP) IBM Global Services September 2012  –  March 2014  (1 year 7 months) Marietta, GA Manage Demand, Staffing and Fulfillment for the Business Analytics and Optimization Practice Area (BAO) in the Financial Services Sector. Resource Deployment Manager IBM January 2009  –  August 2012  (3 years 8 months) Greater Atlanta Area Lead Resource Deployment Manager for Business Analytics and Optimization (BAO) Practice for the Financial Services Sector . \n \nLead RDM for the BAO Service Line and POC for the Financial Services Sector covering a headcount of 240+ resources. Onboarded 78 new hire resources for an overall growth rate percent of 22%.Collaborate with the FS BAO Leadership team by providing staffing expertise and recommendations to improve utilization and bench management. Responsible for resolving any escalations related to staffing dynamics. Overachieved on the practice area utilization targets and the required bench levels. \n \nManage and report on all FS BAO practice operations providing analysis into utilization forecasting, bench management, actual utilization and discrepancies. Proactively address discrepancies with recommended actions for remediation. Engage the Human Resources Partners for performance issues contributing to low tier utilization. \n \nActively engage with the recruiting team as the point of contact to manage the assessment center interview days for all sectors across BAO. Responsible for organizing interviewers to attend the recruiting events according to the type of skills that are being targeted. Attended many of the events as an assessor for candidates on the interview case study. Received a Service Excellence award for leading the recruiting process for the RDM team. \n \nManage the proper balance of resources and skills to meet staffing requirements for current and upcoming projects based on the opportunity pipeline. Utilize alternate resource channels such as subcontracting through our vendors or global resourcing to meet the project demands working closely with procurement and global teams. \n \nWork closely with Human Resources and the management team to enhance skills and capabilities of practitioners resulting in reduced attrition and supporting professional development goals. Provided input to career progression and performance assessment for team members. Resource Deployment Manager IBM January 2009  –  August 2012  (3 years 8 months) Greater Atlanta Area Lead Resource Deployment Manager for Business Analytics and Optimization (BAO) Practice for the Financial Services Sector . \n \nLead RDM for the BAO Service Line and POC for the Financial Services Sector covering a headcount of 240+ resources. Onboarded 78 new hire resources for an overall growth rate percent of 22%.Collaborate with the FS BAO Leadership team by providing staffing expertise and recommendations to improve utilization and bench management. Responsible for resolving any escalations related to staffing dynamics. Overachieved on the practice area utilization targets and the required bench levels. \n \nManage and report on all FS BAO practice operations providing analysis into utilization forecasting, bench management, actual utilization and discrepancies. Proactively address discrepancies with recommended actions for remediation. Engage the Human Resources Partners for performance issues contributing to low tier utilization. \n \nActively engage with the recruiting team as the point of contact to manage the assessment center interview days for all sectors across BAO. Responsible for organizing interviewers to attend the recruiting events according to the type of skills that are being targeted. Attended many of the events as an assessor for candidates on the interview case study. Received a Service Excellence award for leading the recruiting process for the RDM team. \n \nManage the proper balance of resources and skills to meet staffing requirements for current and upcoming projects based on the opportunity pipeline. Utilize alternate resource channels such as subcontracting through our vendors or global resourcing to meet the project demands working closely with procurement and global teams. \n \nWork closely with Human Resources and the management team to enhance skills and capabilities of practitioners resulting in reduced attrition and supporting professional development goals. Provided input to career progression and performance assessment for team members. Resource Deployment Manager IBM January 2003  –  December 2008  (6 years) Greater Atlanta Area Lead Resource Deployment Manager for the Customer Relationship Management (CRM) Practice in the Financial Services Sector focused on the Marketing and Customer Intelligence Service Area. \n \nContributed to achieving the revenue and profit targets of the CRM Practice in the Financial Services Practice by achieving average yearly utilization targets of 78%. \nManaged up to 150 Business Intelligence Consultants and was instrumental in working with the sr. leadership team to merge the PWC consultants with the legacy IBM consultants after the PWC acquisition. \n \nProactively supported the rollout of new RDM tools and processes to support the following functional areas: \nProfessional Develop Tool for skills, staffing and assignment tracking. \nProfessional Utilization Forecasting to support the monthly forecasting process. \nProject Staffing Request Database \nProfessional Development and Career Framework supporting the advancement of\tkey talent and star performers \n \nSupport Partners. Practice leaders and other members of the executive leadership team being recognized as a leader and trusted advisor. My extensive knowledge of the resources skills/abilities and constant focus on deployment are keys to achieving success. \n \nPrepare several ongoing reviews and analysis of the practice metrics which enables the leadership team to take decisive actions to meet the practice objectives. Resource Deployment Manager IBM January 2003  –  December 2008  (6 years) Greater Atlanta Area Lead Resource Deployment Manager for the Customer Relationship Management (CRM) Practice in the Financial Services Sector focused on the Marketing and Customer Intelligence Service Area. \n \nContributed to achieving the revenue and profit targets of the CRM Practice in the Financial Services Practice by achieving average yearly utilization targets of 78%. \nManaged up to 150 Business Intelligence Consultants and was instrumental in working with the sr. leadership team to merge the PWC consultants with the legacy IBM consultants after the PWC acquisition. \n \nProactively supported the rollout of new RDM tools and processes to support the following functional areas: \nProfessional Develop Tool for skills, staffing and assignment tracking. \nProfessional Utilization Forecasting to support the monthly forecasting process. \nProject Staffing Request Database \nProfessional Development and Career Framework supporting the advancement of\tkey talent and star performers \n \nSupport Partners. Practice leaders and other members of the executive leadership team being recognized as a leader and trusted advisor. My extensive knowledge of the resources skills/abilities and constant focus on deployment are keys to achieving success. \n \nPrepare several ongoing reviews and analysis of the practice metrics which enables the leadership team to take decisive actions to meet the practice objectives. Resource Deployment Manager IBM May 1999  –  December 2002  (3 years 8 months) Marietta, GA Lead Resource Deployment Manager for the Business Intelligence Competency of the Business Innovation Services Consulting Practice in the Financial Services Sector. \n \nLead and manage the Business Innovation Services opportunity and resource deployment/staffing process for the Business Intelligence Competency. Mentor and guide the RDM community in process execution and improvement to strengthen the teaming aspect of the RDM team. \n \nProvided end-to-end Utilization Forecast on a monthly basis and achieved the annual target of 75%. \n \nDrive the staffing and deployment for a team of 120 Business Intelligence Practitioners consistently achieving an average bench percentage of less than 7 percent. Work closely with Human Resources and the management team to enhance skills and capabilities of practitioners resulting in reduced attrition and supporting professional development goals. \n \nWork closely with practice executives, principals, practice leaders, delivery managers and talent executives addressing resource staffing requirements with speed and professionalism. \n \nParticipate in hiring and recruiting of new talent to meet the current and projected staffing requirements, conducting screening and interviews. Resource Deployment Manager IBM May 1999  –  December 2002  (3 years 8 months) Marietta, GA Lead Resource Deployment Manager for the Business Intelligence Competency of the Business Innovation Services Consulting Practice in the Financial Services Sector. \n \nLead and manage the Business Innovation Services opportunity and resource deployment/staffing process for the Business Intelligence Competency. Mentor and guide the RDM community in process execution and improvement to strengthen the teaming aspect of the RDM team. \n \nProvided end-to-end Utilization Forecast on a monthly basis and achieved the annual target of 75%. \n \nDrive the staffing and deployment for a team of 120 Business Intelligence Practitioners consistently achieving an average bench percentage of less than 7 percent. Work closely with Human Resources and the management team to enhance skills and capabilities of practitioners resulting in reduced attrition and supporting professional development goals. \n \nWork closely with practice executives, principals, practice leaders, delivery managers and talent executives addressing resource staffing requirements with speed and professionalism. \n \nParticipate in hiring and recruiting of new talent to meet the current and projected staffing requirements, conducting screening and interviews. Sr. Consultant IBM March 1997  –  May 1999  (2 years 3 months) Greater Atlanta Area ERP Supply Chain Management Consultant  \n \nImplemented packaged ERP solutions on an AS/400 platform specializing in Customer Order Management, Distribution, Purchasing and Manufacturing Planning applications. \nResponsibilities included: \n•\tDatabase design and build for the Manufacturing modules of the BPCS ERP software.  \n•\tEnd user training for the BPCS ERP Manufacturing modules. \n•\tIntegration of 3rd party software with the BPCS Customer Order Management software \n \nYear 2000 Remediation Consultant \nClient – Bristol Meyers Squibb (US, Mexico and Puerto Rico)  \nLead the technical implementation for a major multi-site, multi-national Year 2000 remediation project with responsibility for the assessment of multiple AS/400 systems across multiple customer locations. Responsibilities included: \n•\tAssessment and inventory analysis of the programs and data on the AS/400 BPCS systems \n•\tExecution and analysis of an AS/400 program/data inventory tool across multiple AS/400 systems in Mexico and Puerto Rico \n•\tArchitected the testing strategy and led end-users in the preparation of test protocols to be used following the remediation Sr. Consultant IBM March 1997  –  May 1999  (2 years 3 months) Greater Atlanta Area ERP Supply Chain Management Consultant  \n \nImplemented packaged ERP solutions on an AS/400 platform specializing in Customer Order Management, Distribution, Purchasing and Manufacturing Planning applications. \nResponsibilities included: \n•\tDatabase design and build for the Manufacturing modules of the BPCS ERP software.  \n•\tEnd user training for the BPCS ERP Manufacturing modules. \n•\tIntegration of 3rd party software with the BPCS Customer Order Management software \n \nYear 2000 Remediation Consultant \nClient – Bristol Meyers Squibb (US, Mexico and Puerto Rico)  \nLead the technical implementation for a major multi-site, multi-national Year 2000 remediation project with responsibility for the assessment of multiple AS/400 systems across multiple customer locations. Responsibilities included: \n•\tAssessment and inventory analysis of the programs and data on the AS/400 BPCS systems \n•\tExecution and analysis of an AS/400 program/data inventory tool across multiple AS/400 systems in Mexico and Puerto Rico \n•\tArchitected the testing strategy and led end-users in the preparation of test protocols to be used following the remediation Sr. Application Consultant Marcam May 1993  –  March 1997  (3 years 11 months) Greater Atlanta Area Sr. Application Consultant  \nLead Customer Support Representative for the Customer Order Management Application (COM) of the MAPICS XA software for the AS/400. Responsibilities included: \n•\tOn-site customer implementation and training services \n•\tHandling complex application and implementation usage questions via telephone support \n•\tProviding direction on the functional design and future direction of the COM application to the development organization \n•\tProviding leadership and technical direction to members of the COM product support team Sr. Application Consultant Marcam May 1993  –  March 1997  (3 years 11 months) Greater Atlanta Area Sr. Application Consultant  \nLead Customer Support Representative for the Customer Order Management Application (COM) of the MAPICS XA software for the AS/400. Responsibilities included: \n•\tOn-site customer implementation and training services \n•\tHandling complex application and implementation usage questions via telephone support \n•\tProviding direction on the functional design and future direction of the COM application to the development organization \n•\tProviding leadership and technical direction to members of the COM product support team Sr. Customer Support Representative IBM October 1986  –  April 1993  (6 years 7 months) Greater Atlanta Area Customer Support Representative \nCustomer support of MAPICS/DB applications including Cross Application Support (CAS), Order Entry and Invoicing, Accounts Receivable, Sales Analysis and Purchasing. \nLiaison between development and support organizations for CAS customer requirements. \nProvided education on MAPICS/DB Architecture and Operations for locally taught customer classes and customized training on customer site. Sr. Customer Support Representative IBM October 1986  –  April 1993  (6 years 7 months) Greater Atlanta Area Customer Support Representative \nCustomer support of MAPICS/DB applications including Cross Application Support (CAS), Order Entry and Invoicing, Accounts Receivable, Sales Analysis and Purchasing. \nLiaison between development and support organizations for CAS customer requirements. \nProvided education on MAPICS/DB Architecture and Operations for locally taught customer classes and customized training on customer site. Skills Business Intelligence Global Delivery Solution Architecture Business Analysis IT Strategy Data Warehousing Service Delivery PMO Resource Management PMP Vendor Management Business Transformation Business Analytics Business Process ERP Program Management SDLC Project Portfolio... Integration Cloud Computing Project Management Enterprise Architecture Consulting Management Analytics Outsourcing Business Process... Project Delivery Business Process Design CRM Change Management Disaster Recovery Governance IT Service Management ITIL Management Consulting Pre-sales Professional Services Requirements Analysis Requirements Gathering SOA Software Project... People Development See 28+     See less Skills  Business Intelligence Global Delivery Solution Architecture Business Analysis IT Strategy Data Warehousing Service Delivery PMO Resource Management PMP Vendor Management Business Transformation Business Analytics Business Process ERP Program Management SDLC Project Portfolio... Integration Cloud Computing Project Management Enterprise Architecture Consulting Management Analytics Outsourcing Business Process... Project Delivery Business Process Design CRM Change Management Disaster Recovery Governance IT Service Management ITIL Management Consulting Pre-sales Professional Services Requirements Analysis Requirements Gathering SOA Software Project... People Development See 28+     See less Business Intelligence Global Delivery Solution Architecture Business Analysis IT Strategy Data Warehousing Service Delivery PMO Resource Management PMP Vendor Management Business Transformation Business Analytics Business Process ERP Program Management SDLC Project Portfolio... Integration Cloud Computing Project Management Enterprise Architecture Consulting Management Analytics Outsourcing Business Process... Project Delivery Business Process Design CRM Change Management Disaster Recovery Governance IT Service Management ITIL Management Consulting Pre-sales Professional Services Requirements Analysis Requirements Gathering SOA Software Project... People Development See 28+     See less Business Intelligence Global Delivery Solution Architecture Business Analysis IT Strategy Data Warehousing Service Delivery PMO Resource Management PMP Vendor Management Business Transformation Business Analytics Business Process ERP Program Management SDLC Project Portfolio... Integration Cloud Computing Project Management Enterprise Architecture Consulting Management Analytics Outsourcing Business Process... Project Delivery Business Process Design CRM Change Management Disaster Recovery Governance IT Service Management ITIL Management Consulting Pre-sales Professional Services Requirements Analysis Requirements Gathering SOA Software Project... People Development See 28+     See less Education The College of New Jersey Bacherlor of Science,  Business Administration The College of New Jersey Master of Science,  Management The College of New Jersey Bacherlor of Science,  Business Administration The College of New Jersey Bacherlor of Science,  Business Administration The College of New Jersey Bacherlor of Science,  Business Administration The College of New Jersey Master of Science,  Management The College of New Jersey Master of Science,  Management The College of New Jersey Master of Science,  Management ", "Summary Ambiguous Visions => Zealous Solutions \n \nI transform business, processes, lives, and situations through strategically and visually creating solutions from an empathetic perspective, and assisting in implementing these solutions through counsel, new methods, thought and behavioral processes, business processes, training and engagement, etc. With an extensive background across business, technology, professional training and non-profits, plus an entrepreneurial spirit, I am always looking for new opportunities to innovate. \n \nMy strengths include: \n- Uncovering root causes and needs for challenging issues and new initiatives \n- Designing creative, innovative and customized solutions and processes \n- Enabling people and teams to move forward in successfully functioning in their strengths \n \nPassionate about the re-invigoration in our country around enabling individual creativity through the maker/hacker movement, STEM/STEAM education initiatives, design thinking and other methods/initiatives. Looking to connect leading corporations and organizations to education needs for both young and \"seasoned\" audiences. Summary Ambiguous Visions => Zealous Solutions \n \nI transform business, processes, lives, and situations through strategically and visually creating solutions from an empathetic perspective, and assisting in implementing these solutions through counsel, new methods, thought and behavioral processes, business processes, training and engagement, etc. With an extensive background across business, technology, professional training and non-profits, plus an entrepreneurial spirit, I am always looking for new opportunities to innovate. \n \nMy strengths include: \n- Uncovering root causes and needs for challenging issues and new initiatives \n- Designing creative, innovative and customized solutions and processes \n- Enabling people and teams to move forward in successfully functioning in their strengths \n \nPassionate about the re-invigoration in our country around enabling individual creativity through the maker/hacker movement, STEM/STEAM education initiatives, design thinking and other methods/initiatives. Looking to connect leading corporations and organizations to education needs for both young and \"seasoned\" audiences. Ambiguous Visions => Zealous Solutions \n \nI transform business, processes, lives, and situations through strategically and visually creating solutions from an empathetic perspective, and assisting in implementing these solutions through counsel, new methods, thought and behavioral processes, business processes, training and engagement, etc. With an extensive background across business, technology, professional training and non-profits, plus an entrepreneurial spirit, I am always looking for new opportunities to innovate. \n \nMy strengths include: \n- Uncovering root causes and needs for challenging issues and new initiatives \n- Designing creative, innovative and customized solutions and processes \n- Enabling people and teams to move forward in successfully functioning in their strengths \n \nPassionate about the re-invigoration in our country around enabling individual creativity through the maker/hacker movement, STEM/STEAM education initiatives, design thinking and other methods/initiatives. Looking to connect leading corporations and organizations to education needs for both young and \"seasoned\" audiences. Ambiguous Visions => Zealous Solutions \n \nI transform business, processes, lives, and situations through strategically and visually creating solutions from an empathetic perspective, and assisting in implementing these solutions through counsel, new methods, thought and behavioral processes, business processes, training and engagement, etc. With an extensive background across business, technology, professional training and non-profits, plus an entrepreneurial spirit, I am always looking for new opportunities to innovate. \n \nMy strengths include: \n- Uncovering root causes and needs for challenging issues and new initiatives \n- Designing creative, innovative and customized solutions and processes \n- Enabling people and teams to move forward in successfully functioning in their strengths \n \nPassionate about the re-invigoration in our country around enabling individual creativity through the maker/hacker movement, STEM/STEAM education initiatives, design thinking and other methods/initiatives. Looking to connect leading corporations and organizations to education needs for both young and \"seasoned\" audiences. Experience Business Start-up Advisor & Consultant Independent 2011  –  2015  (4 years) Advised multiple start-ups on pinpointing vision and strategy, developing objectives and next steps. Consulted on planning, real estate selection and organizational development. Office Director Non-Profit Food Distributor 2013  –  2014  (1 year) Developed and established internal governance and administrative process improvement. Managed successful grant writing and volunteer programs. Rolled out marketing and social media campaigns, partnered with variety of community organizations and resources. GBS BAO SWG Interlock & Deployment Manager IBM 2011  –  2012  (1 year) Integrated efforts between the Global Business Services and Software Group divisions in the area of Business Analytics & Optimization through mergers and acquisitions teams, integrating learning, assets and knowledge for multiple acquisitions. Global GBS BAO Learning Deployment Leader IBM Global Business Services 2009  –  2011  (2 years) Led global Business Analytics & Optimization learning deployment teams through full learning life cycle. Appointed to oversee the Top 10 CEO Initiative to triple global BAO education across multiple business units. Managed 25+ external vendor relationships, multimillion $ budgets. Americas BI, CRM & FM Learning Deployment Manager IBM Global Business Services 2008  –  2009  (1 year) Led Americas Business Intelligence, Customer Relationship Management and Financial Management learning deployment teams through full learning life cycle. Managed 25+ external vendor relationships, multimillion $ budgets. Global FM Training Manager IBM Global Business Services 2005  –  2008  (3 years) Led global Financial Management learning team through full learning life cycle. Pioneered new approach to large scale university style deployment. Involved with new organization design of global Learning & Knowledge organization. Assisted with assessment and implementation of new corporate wide Learning Management System (LMS). Managed 25+ external vendor relationships, multimillion $ budgets. Global BI & FM Training Manager IBM Global Business Services 2001  –  2005  (4 years) Led global Business Intelligence and Financial Management learning teams through full learning life cycle. Managed deployment of first IBM/Wharton University FM course. Pioneered and implemented: corporately adopted virtual education platforms, policies and procedures; innovative community events. Involved with redeveloping and implementing global knowledge management practices. Managed 25+ external vendor relationships, multimillion $ budgets. Business Intelligence, DataWarehousing, Process Improvement Consultant PricewaterhouseCoopers LLP 1997  –  2001  (4 years) Led front end teams through design through implementation across all industry segments: automotive, financial, airline, consumer products and telecommunications. Led SMU campus recruiting efforts. Business Start-up Advisor & Consultant Independent 2011  –  2015  (4 years) Advised multiple start-ups on pinpointing vision and strategy, developing objectives and next steps. Consulted on planning, real estate selection and organizational development. Business Start-up Advisor & Consultant Independent 2011  –  2015  (4 years) Advised multiple start-ups on pinpointing vision and strategy, developing objectives and next steps. Consulted on planning, real estate selection and organizational development. Office Director Non-Profit Food Distributor 2013  –  2014  (1 year) Developed and established internal governance and administrative process improvement. Managed successful grant writing and volunteer programs. Rolled out marketing and social media campaigns, partnered with variety of community organizations and resources. Office Director Non-Profit Food Distributor 2013  –  2014  (1 year) Developed and established internal governance and administrative process improvement. Managed successful grant writing and volunteer programs. Rolled out marketing and social media campaigns, partnered with variety of community organizations and resources. GBS BAO SWG Interlock & Deployment Manager IBM 2011  –  2012  (1 year) Integrated efforts between the Global Business Services and Software Group divisions in the area of Business Analytics & Optimization through mergers and acquisitions teams, integrating learning, assets and knowledge for multiple acquisitions. GBS BAO SWG Interlock & Deployment Manager IBM 2011  –  2012  (1 year) Integrated efforts between the Global Business Services and Software Group divisions in the area of Business Analytics & Optimization through mergers and acquisitions teams, integrating learning, assets and knowledge for multiple acquisitions. Global GBS BAO Learning Deployment Leader IBM Global Business Services 2009  –  2011  (2 years) Led global Business Analytics & Optimization learning deployment teams through full learning life cycle. Appointed to oversee the Top 10 CEO Initiative to triple global BAO education across multiple business units. Managed 25+ external vendor relationships, multimillion $ budgets. Global GBS BAO Learning Deployment Leader IBM Global Business Services 2009  –  2011  (2 years) Led global Business Analytics & Optimization learning deployment teams through full learning life cycle. Appointed to oversee the Top 10 CEO Initiative to triple global BAO education across multiple business units. Managed 25+ external vendor relationships, multimillion $ budgets. Americas BI, CRM & FM Learning Deployment Manager IBM Global Business Services 2008  –  2009  (1 year) Led Americas Business Intelligence, Customer Relationship Management and Financial Management learning deployment teams through full learning life cycle. Managed 25+ external vendor relationships, multimillion $ budgets. Americas BI, CRM & FM Learning Deployment Manager IBM Global Business Services 2008  –  2009  (1 year) Led Americas Business Intelligence, Customer Relationship Management and Financial Management learning deployment teams through full learning life cycle. Managed 25+ external vendor relationships, multimillion $ budgets. Global FM Training Manager IBM Global Business Services 2005  –  2008  (3 years) Led global Financial Management learning team through full learning life cycle. Pioneered new approach to large scale university style deployment. Involved with new organization design of global Learning & Knowledge organization. Assisted with assessment and implementation of new corporate wide Learning Management System (LMS). Managed 25+ external vendor relationships, multimillion $ budgets. Global FM Training Manager IBM Global Business Services 2005  –  2008  (3 years) Led global Financial Management learning team through full learning life cycle. Pioneered new approach to large scale university style deployment. Involved with new organization design of global Learning & Knowledge organization. Assisted with assessment and implementation of new corporate wide Learning Management System (LMS). Managed 25+ external vendor relationships, multimillion $ budgets. Global BI & FM Training Manager IBM Global Business Services 2001  –  2005  (4 years) Led global Business Intelligence and Financial Management learning teams through full learning life cycle. Managed deployment of first IBM/Wharton University FM course. Pioneered and implemented: corporately adopted virtual education platforms, policies and procedures; innovative community events. Involved with redeveloping and implementing global knowledge management practices. Managed 25+ external vendor relationships, multimillion $ budgets. Global BI & FM Training Manager IBM Global Business Services 2001  –  2005  (4 years) Led global Business Intelligence and Financial Management learning teams through full learning life cycle. Managed deployment of first IBM/Wharton University FM course. Pioneered and implemented: corporately adopted virtual education platforms, policies and procedures; innovative community events. Involved with redeveloping and implementing global knowledge management practices. Managed 25+ external vendor relationships, multimillion $ budgets. Business Intelligence, DataWarehousing, Process Improvement Consultant PricewaterhouseCoopers LLP 1997  –  2001  (4 years) Led front end teams through design through implementation across all industry segments: automotive, financial, airline, consumer products and telecommunications. Led SMU campus recruiting efforts. Business Intelligence, DataWarehousing, Process Improvement Consultant PricewaterhouseCoopers LLP 1997  –  2001  (4 years) Led front end teams through design through implementation across all industry segments: automotive, financial, airline, consumer products and telecommunications. Led SMU campus recruiting efforts. Skills Strategic Planning Leadership Program Management Training Business Intelligence Change Management Team Leadership Contract Negotiation Non-profits Management Management Consulting Strategy Marketing Strategy Nonprofits Business Process... CRM Advertising Training Delivery Cross-functional Team... Virtual Teams Goal-driven leader Analytics Entrepreneurship Requirements Analysis Data Analysis Event Management Team Management Social Media Non-profit... Non-profit Volunteer Non-profit Boards Customer Satisfaction Senior Stakeholder... Stakeholder Engagement Community Building Adobe Creative Suite Creativity Creative Strategy Creative Solutions Creative Services Event Planning Corporate Events Events Coordination Event Producing Event Photography Educational Leadership Program Development Program Evaluation Program Coordination Consulting See 35+     See less Skills  Strategic Planning Leadership Program Management Training Business Intelligence Change Management Team Leadership Contract Negotiation Non-profits Management Management Consulting Strategy Marketing Strategy Nonprofits Business Process... CRM Advertising Training Delivery Cross-functional Team... Virtual Teams Goal-driven leader Analytics Entrepreneurship Requirements Analysis Data Analysis Event Management Team Management Social Media Non-profit... Non-profit Volunteer Non-profit Boards Customer Satisfaction Senior Stakeholder... Stakeholder Engagement Community Building Adobe Creative Suite Creativity Creative Strategy Creative Solutions Creative Services Event Planning Corporate Events Events Coordination Event Producing Event Photography Educational Leadership Program Development Program Evaluation Program Coordination Consulting See 35+     See less Strategic Planning Leadership Program Management Training Business Intelligence Change Management Team Leadership Contract Negotiation Non-profits Management Management Consulting Strategy Marketing Strategy Nonprofits Business Process... CRM Advertising Training Delivery Cross-functional Team... Virtual Teams Goal-driven leader Analytics Entrepreneurship Requirements Analysis Data Analysis Event Management Team Management Social Media Non-profit... Non-profit Volunteer Non-profit Boards Customer Satisfaction Senior Stakeholder... Stakeholder Engagement Community Building Adobe Creative Suite Creativity Creative Strategy Creative Solutions Creative Services Event Planning Corporate Events Events Coordination Event Producing Event Photography Educational Leadership Program Development Program Evaluation Program Coordination Consulting See 35+     See less Strategic Planning Leadership Program Management Training Business Intelligence Change Management Team Leadership Contract Negotiation Non-profits Management Management Consulting Strategy Marketing Strategy Nonprofits Business Process... CRM Advertising Training Delivery Cross-functional Team... Virtual Teams Goal-driven leader Analytics Entrepreneurship Requirements Analysis Data Analysis Event Management Team Management Social Media Non-profit... Non-profit Volunteer Non-profit Boards Customer Satisfaction Senior Stakeholder... Stakeholder Engagement Community Building Adobe Creative Suite Creativity Creative Strategy Creative Solutions Creative Services Event Planning Corporate Events Events Coordination Event Producing Event Photography Educational Leadership Program Development Program Evaluation Program Coordination Consulting See 35+     See less Education Southern Methodist University BA,  Psychology (Distinction Program) 1993  – 1997 Distinction thesis on the affects of behavioral therapy on young autistic child. Activities and Societies:  Producer/Director Video Yearbook ,  Gamma Phi Beta ,  Crew Team Southern Methodist University BBA,  Management Information Systems (MIS) ,  Organizational Behavior & Business Policy (OBBP) 1993  – 1997 Activities and Societies:  Producer/Director Video Yearbook ,  Gamma Phi Beta ,  Crew Team Master Trainer Institute Certified Master Trainer Southern Methodist University BA,  Psychology (Distinction Program) 1993  – 1997 Distinction thesis on the affects of behavioral therapy on young autistic child. Activities and Societies:  Producer/Director Video Yearbook ,  Gamma Phi Beta ,  Crew Team Southern Methodist University BA,  Psychology (Distinction Program) 1993  – 1997 Distinction thesis on the affects of behavioral therapy on young autistic child. Activities and Societies:  Producer/Director Video Yearbook ,  Gamma Phi Beta ,  Crew Team Southern Methodist University BA,  Psychology (Distinction Program) 1993  – 1997 Distinction thesis on the affects of behavioral therapy on young autistic child. Activities and Societies:  Producer/Director Video Yearbook ,  Gamma Phi Beta ,  Crew Team Southern Methodist University BBA,  Management Information Systems (MIS) ,  Organizational Behavior & Business Policy (OBBP) 1993  – 1997 Activities and Societies:  Producer/Director Video Yearbook ,  Gamma Phi Beta ,  Crew Team Southern Methodist University BBA,  Management Information Systems (MIS) ,  Organizational Behavior & Business Policy (OBBP) 1993  – 1997 Activities and Societies:  Producer/Director Video Yearbook ,  Gamma Phi Beta ,  Crew Team Southern Methodist University BBA,  Management Information Systems (MIS) ,  Organizational Behavior & Business Policy (OBBP) 1993  – 1997 Activities and Societies:  Producer/Director Video Yearbook ,  Gamma Phi Beta ,  Crew Team Master Trainer Institute Certified Master Trainer Master Trainer Institute Certified Master Trainer Master Trainer Institute Certified Master Trainer ", "Summary Versatile professional with background and training in resource management, office management, professional staffing and recruiting, software sales, client support, and Special Education. Self-starter with accomplished leadership and communication skills, who works well individually, or as part of a team. Obtained proven record of operational growth efficiencies using effective planning, relationship building and people management. Achieved positive track record of translating complex requirements into solutions that satisfy requirements with high customer satisfaction. Advanced knowledge/research via internet, MS Office, social media and search engine tools. \n \nSpecialties: Resource Management, Administration, IT staffing, IT software sales and implementation, IT management Summary Versatile professional with background and training in resource management, office management, professional staffing and recruiting, software sales, client support, and Special Education. Self-starter with accomplished leadership and communication skills, who works well individually, or as part of a team. Obtained proven record of operational growth efficiencies using effective planning, relationship building and people management. Achieved positive track record of translating complex requirements into solutions that satisfy requirements with high customer satisfaction. Advanced knowledge/research via internet, MS Office, social media and search engine tools. \n \nSpecialties: Resource Management, Administration, IT staffing, IT software sales and implementation, IT management Versatile professional with background and training in resource management, office management, professional staffing and recruiting, software sales, client support, and Special Education. Self-starter with accomplished leadership and communication skills, who works well individually, or as part of a team. Obtained proven record of operational growth efficiencies using effective planning, relationship building and people management. Achieved positive track record of translating complex requirements into solutions that satisfy requirements with high customer satisfaction. Advanced knowledge/research via internet, MS Office, social media and search engine tools. \n \nSpecialties: Resource Management, Administration, IT staffing, IT software sales and implementation, IT management Versatile professional with background and training in resource management, office management, professional staffing and recruiting, software sales, client support, and Special Education. Self-starter with accomplished leadership and communication skills, who works well individually, or as part of a team. Obtained proven record of operational growth efficiencies using effective planning, relationship building and people management. Achieved positive track record of translating complex requirements into solutions that satisfy requirements with high customer satisfaction. Advanced knowledge/research via internet, MS Office, social media and search engine tools. \n \nSpecialties: Resource Management, Administration, IT staffing, IT software sales and implementation, IT management Experience Experience Manager Ernst & Young November 2014  – Present (10 months) Chicago, IL Office Manager Reyes Kurson Ltd. / The Roosevelt Group December 2010  –  August 2012  (1 year 9 months) Chicago, Illinois Created and implemented efficient office management protocols for affiliated corporate/legal businesses domiciled within shared office space. Reported directly to principle partner. \n•\tPoint person for all outside vendors, including building management \n•\tRecruited new support talent, managed on-boarding and ongoing supervision \n•\tManagement of all aspects of hosting meetings, virtual or physical \n•\tMaintenance of personal and business calendars for principle partner \n•\tCoordinated/implemented all travel arrangements \n•\tParalegal duties: research, document production, docket management \n•\tLarge file management \n•\tAccounts receivables and payable for vendors and all clients \n•\tMonitored switchboard and front reception area \n•\tResearched, selected, tailored and implemented client billing software Resource Deployment Manager IBM Global Business Services - Portal & Content Management Practice 2001  –  2009  (8 years) Partner with senior leadership to ensure optimum resource deployment resulting in project delivery excellence and customer satisfaction \n \nLeverage extensive knowledge of resources skills, capabilities and pipeline demands to adeptly execute deployment processes and maximize productivity and customer satisfaction. Consultative style fosters a culture that embraces collaboration and strong relationships with stakeholders. \n \nExpertise Includes: \n•Websphere Portal & SAP Portal \n•Content Management \n•Life Sciences \n•Process planning and design \n•Resource and Capacity Management \n•Pipeline Demand Management \n•Recruiting \n•Career Development and mentoring Resource Deployment Manager IBM Global Business Services - Chicago Innovation Center 2000  –  2001  (1 year) Partnered with executive management in assuring optimal utilization of skills and availability for each of the practice's professionals. Resource Deployment Manager IBM Global Business Services - Business Intelligence Practice 1999  –  2000  (1 year) Primary point of contact for resource requests when staffing projects. Tracked and reported availability and utilization for each practice group’s professionals based upon skill sets, experience and project requirements, utilizing specialized internal professional tracking software.  \n•\tPartnered with the executive management team to assure optimal utilization of, on average,  \n100 experienced and senior level professionals \n•\tParticipated in recruiting and maintaining relationships with IBM-approved subcontracting firms \n•\tLead effort to solicit, place and track resources’ submission of their current and properly  \nformatted resumes into a central repository resulting in increased productivity and efficiencies Software Account Manager IBM Sales and Distribution 1991  –  1999  (8 years) Built and maintained relationships with executive management of assigned Fortune 100 and Fortune 500 clients representing all IBM software, services and maintenance. \n•\tAssisted clients in creating strategies regarding software acquisition, support and services \n•\tAssisted with financial offerings regarding software acquisition, support and services \n•\tWorked with the internal team in responding to clients’ needs as well as creating strategies  \nand presentations for clients \n•\tAttained software and services sales earning revenue growth results across the breadth of  \nIBM's software offerings Software Sales IBM Sales and Distribution January 1988  –  December 1991  (4 years) Pitttsburgh, PA Managed sale of IBM software to customers from finance, banking and distribution industries. \n•\tDesigned and lead customer sessions demonstrating the strength of IBM relational databases  \n(DB2 and SQL/DS) and affiliated application development software utilizing customers’ data \nsamples \n•\tParticipated on a team selling IBM desktop and LAN-based software \n•\tAchieved 100% of assigned target for software license sales each year Systems Engineer IBM Sales and Distribution 1984  –  1987  (3 years) Greater Pittsburgh Area Built and maintained professional relationships with peers inside of the IT organization of assigned clients while providing technical support as well as technical updates leading to ongoing and increased hardware, software and services revenue. Experience Manager Ernst & Young November 2014  – Present (10 months) Chicago, IL Experience Manager Ernst & Young November 2014  – Present (10 months) Chicago, IL Office Manager Reyes Kurson Ltd. / The Roosevelt Group December 2010  –  August 2012  (1 year 9 months) Chicago, Illinois Created and implemented efficient office management protocols for affiliated corporate/legal businesses domiciled within shared office space. Reported directly to principle partner. \n•\tPoint person for all outside vendors, including building management \n•\tRecruited new support talent, managed on-boarding and ongoing supervision \n•\tManagement of all aspects of hosting meetings, virtual or physical \n•\tMaintenance of personal and business calendars for principle partner \n•\tCoordinated/implemented all travel arrangements \n•\tParalegal duties: research, document production, docket management \n•\tLarge file management \n•\tAccounts receivables and payable for vendors and all clients \n•\tMonitored switchboard and front reception area \n•\tResearched, selected, tailored and implemented client billing software Office Manager Reyes Kurson Ltd. / The Roosevelt Group December 2010  –  August 2012  (1 year 9 months) Chicago, Illinois Created and implemented efficient office management protocols for affiliated corporate/legal businesses domiciled within shared office space. Reported directly to principle partner. \n•\tPoint person for all outside vendors, including building management \n•\tRecruited new support talent, managed on-boarding and ongoing supervision \n•\tManagement of all aspects of hosting meetings, virtual or physical \n•\tMaintenance of personal and business calendars for principle partner \n•\tCoordinated/implemented all travel arrangements \n•\tParalegal duties: research, document production, docket management \n•\tLarge file management \n•\tAccounts receivables and payable for vendors and all clients \n•\tMonitored switchboard and front reception area \n•\tResearched, selected, tailored and implemented client billing software Resource Deployment Manager IBM Global Business Services - Portal & Content Management Practice 2001  –  2009  (8 years) Partner with senior leadership to ensure optimum resource deployment resulting in project delivery excellence and customer satisfaction \n \nLeverage extensive knowledge of resources skills, capabilities and pipeline demands to adeptly execute deployment processes and maximize productivity and customer satisfaction. Consultative style fosters a culture that embraces collaboration and strong relationships with stakeholders. \n \nExpertise Includes: \n•Websphere Portal & SAP Portal \n•Content Management \n•Life Sciences \n•Process planning and design \n•Resource and Capacity Management \n•Pipeline Demand Management \n•Recruiting \n•Career Development and mentoring Resource Deployment Manager IBM Global Business Services - Portal & Content Management Practice 2001  –  2009  (8 years) Partner with senior leadership to ensure optimum resource deployment resulting in project delivery excellence and customer satisfaction \n \nLeverage extensive knowledge of resources skills, capabilities and pipeline demands to adeptly execute deployment processes and maximize productivity and customer satisfaction. Consultative style fosters a culture that embraces collaboration and strong relationships with stakeholders. \n \nExpertise Includes: \n•Websphere Portal & SAP Portal \n•Content Management \n•Life Sciences \n•Process planning and design \n•Resource and Capacity Management \n•Pipeline Demand Management \n•Recruiting \n•Career Development and mentoring Resource Deployment Manager IBM Global Business Services - Chicago Innovation Center 2000  –  2001  (1 year) Partnered with executive management in assuring optimal utilization of skills and availability for each of the practice's professionals. Resource Deployment Manager IBM Global Business Services - Chicago Innovation Center 2000  –  2001  (1 year) Partnered with executive management in assuring optimal utilization of skills and availability for each of the practice's professionals. Resource Deployment Manager IBM Global Business Services - Business Intelligence Practice 1999  –  2000  (1 year) Primary point of contact for resource requests when staffing projects. Tracked and reported availability and utilization for each practice group’s professionals based upon skill sets, experience and project requirements, utilizing specialized internal professional tracking software.  \n•\tPartnered with the executive management team to assure optimal utilization of, on average,  \n100 experienced and senior level professionals \n•\tParticipated in recruiting and maintaining relationships with IBM-approved subcontracting firms \n•\tLead effort to solicit, place and track resources’ submission of their current and properly  \nformatted resumes into a central repository resulting in increased productivity and efficiencies Resource Deployment Manager IBM Global Business Services - Business Intelligence Practice 1999  –  2000  (1 year) Primary point of contact for resource requests when staffing projects. Tracked and reported availability and utilization for each practice group’s professionals based upon skill sets, experience and project requirements, utilizing specialized internal professional tracking software.  \n•\tPartnered with the executive management team to assure optimal utilization of, on average,  \n100 experienced and senior level professionals \n•\tParticipated in recruiting and maintaining relationships with IBM-approved subcontracting firms \n•\tLead effort to solicit, place and track resources’ submission of their current and properly  \nformatted resumes into a central repository resulting in increased productivity and efficiencies Software Account Manager IBM Sales and Distribution 1991  –  1999  (8 years) Built and maintained relationships with executive management of assigned Fortune 100 and Fortune 500 clients representing all IBM software, services and maintenance. \n•\tAssisted clients in creating strategies regarding software acquisition, support and services \n•\tAssisted with financial offerings regarding software acquisition, support and services \n•\tWorked with the internal team in responding to clients’ needs as well as creating strategies  \nand presentations for clients \n•\tAttained software and services sales earning revenue growth results across the breadth of  \nIBM's software offerings Software Account Manager IBM Sales and Distribution 1991  –  1999  (8 years) Built and maintained relationships with executive management of assigned Fortune 100 and Fortune 500 clients representing all IBM software, services and maintenance. \n•\tAssisted clients in creating strategies regarding software acquisition, support and services \n•\tAssisted with financial offerings regarding software acquisition, support and services \n•\tWorked with the internal team in responding to clients’ needs as well as creating strategies  \nand presentations for clients \n•\tAttained software and services sales earning revenue growth results across the breadth of  \nIBM's software offerings Software Sales IBM Sales and Distribution January 1988  –  December 1991  (4 years) Pitttsburgh, PA Managed sale of IBM software to customers from finance, banking and distribution industries. \n•\tDesigned and lead customer sessions demonstrating the strength of IBM relational databases  \n(DB2 and SQL/DS) and affiliated application development software utilizing customers’ data \nsamples \n•\tParticipated on a team selling IBM desktop and LAN-based software \n•\tAchieved 100% of assigned target for software license sales each year Software Sales IBM Sales and Distribution January 1988  –  December 1991  (4 years) Pitttsburgh, PA Managed sale of IBM software to customers from finance, banking and distribution industries. \n•\tDesigned and lead customer sessions demonstrating the strength of IBM relational databases  \n(DB2 and SQL/DS) and affiliated application development software utilizing customers’ data \nsamples \n•\tParticipated on a team selling IBM desktop and LAN-based software \n•\tAchieved 100% of assigned target for software license sales each year Systems Engineer IBM Sales and Distribution 1984  –  1987  (3 years) Greater Pittsburgh Area Built and maintained professional relationships with peers inside of the IT organization of assigned clients while providing technical support as well as technical updates leading to ongoing and increased hardware, software and services revenue. Systems Engineer IBM Sales and Distribution 1984  –  1987  (3 years) Greater Pittsburgh Area Built and maintained professional relationships with peers inside of the IT organization of assigned clients while providing technical support as well as technical updates leading to ongoing and increased hardware, software and services revenue. Languages English English English Skills Skills     Education University of Pittsburgh M. S.,  Information Science 1982  – 1983 University of Maryland College Park B.S.,  Special Education 1974  – 1978 University of Pittsburgh M. S.,  Information Science 1982  – 1983 University of Pittsburgh M. S.,  Information Science 1982  – 1983 University of Pittsburgh M. S.,  Information Science 1982  – 1983 University of Maryland College Park B.S.,  Special Education 1974  – 1978 University of Maryland College Park B.S.,  Special Education 1974  – 1978 University of Maryland College Park B.S.,  Special Education 1974  – 1978 ", "Experience Resource Deployment Manager IBM Middle East May 2009  – Present (6 years 4 months) Resource Deployment Manager IBM India Pvt Ltd August 2006  –  May 2009  (2 years 10 months) Resource Specialist TVA Infotech January 2006  –  August 2006  (8 months) Resource Deployment Manager IBM Middle East May 2009  – Present (6 years 4 months) Resource Deployment Manager IBM Middle East May 2009  – Present (6 years 4 months) Resource Deployment Manager IBM India Pvt Ltd August 2006  –  May 2009  (2 years 10 months) Resource Deployment Manager IBM India Pvt Ltd August 2006  –  May 2009  (2 years 10 months) Resource Specialist TVA Infotech January 2006  –  August 2006  (8 months) Resource Specialist TVA Infotech January 2006  –  August 2006  (8 months) Skills Business Analysis Employee Engagement Management Consulting Recruiting Resource Management Screening Talent Acquisition Team Management Technical Recruiting Vendor Management Performance Management Talent Management Sourcing Skills  Business Analysis Employee Engagement Management Consulting Recruiting Resource Management Screening Talent Acquisition Team Management Technical Recruiting Vendor Management Performance Management Talent Management Sourcing Business Analysis Employee Engagement Management Consulting Recruiting Resource Management Screening Talent Acquisition Team Management Technical Recruiting Vendor Management Performance Management Talent Management Sourcing Business Analysis Employee Engagement Management Consulting Recruiting Resource Management Screening Talent Acquisition Team Management Technical Recruiting Vendor Management Performance Management Talent Management Sourcing Education Alliance Business Academy PGDM,  Human Resources 2004  – 2006 Mahatma Gandhi Memorial B.Com,  Commerce 2001  – 2003 Indian High School Alliance Business Academy PGDM,  Human Resources 2004  – 2006 Alliance Business Academy PGDM,  Human Resources 2004  – 2006 Alliance Business Academy PGDM,  Human Resources 2004  – 2006 Mahatma Gandhi Memorial B.Com,  Commerce 2001  – 2003 Mahatma Gandhi Memorial B.Com,  Commerce 2001  – 2003 Mahatma Gandhi Memorial B.Com,  Commerce 2001  – 2003 Indian High School Indian High School Indian High School ", "Languages Spanish Spanish Spanish Skills Project Planning Project Implementation Process Improvement Business Management Knowledge Management Planning Security ITIL Business Process Process Engineering PMI IT Management Software Project... IT Strategy Team Leadership Change Management IT Governance Business Intelligence Balanced Scorecard Six Sigma Management Governance Requirements Analysis Program Management Divestitures SDLC Business Transformation See 12+     See less Skills  Project Planning Project Implementation Process Improvement Business Management Knowledge Management Planning Security ITIL Business Process Process Engineering PMI IT Management Software Project... IT Strategy Team Leadership Change Management IT Governance Business Intelligence Balanced Scorecard Six Sigma Management Governance Requirements Analysis Program Management Divestitures SDLC Business Transformation See 12+     See less Project Planning Project Implementation Process Improvement Business Management Knowledge Management Planning Security ITIL Business Process Process Engineering PMI IT Management Software Project... IT Strategy Team Leadership Change Management IT Governance Business Intelligence Balanced Scorecard Six Sigma Management Governance Requirements Analysis Program Management Divestitures SDLC Business Transformation See 12+     See less Project Planning Project Implementation Process Improvement Business Management Knowledge Management Planning Security ITIL Business Process Process Engineering PMI IT Management Software Project... IT Strategy Team Leadership Change Management IT Governance Business Intelligence Balanced Scorecard Six Sigma Management Governance Requirements Analysis Program Management Divestitures SDLC Business Transformation See 12+     See less ", "Experience Resource Deployment Manager IBM Global Process Services November 2010  – Present (4 years 10 months) Gurgaon, India Deploys assigned Consultant Group resources to achieve agreed bench and utilisation targets Resource Deployment Manager IBM GPS November 2010  – Present (4 years 10 months) Support IBM Germany Consultant Group by deploying them to available Projects. \nDeploys assigned Consultant Group resources to achieve agreed bench and utilisation targets.  \nAssists Business Managers to manage redeployment, recruitment, redundancies and retirements. \nWorks with the People Managers / Business Managers community for HR, utilisation, skills development and retraining issues. \nProvides input to capacity audits / forecasts and information planning purposes. \nWorks with the Lead Resource Deployment Managers and Business Managers /People Manager community to match future supply and demand \nProvides timely management information and reporting. Lead Analyst Project Management - Telco Solutions COLT Technologies September 2007  –  November 2010  (3 years 3 months) Lead Analyst COLT Technologies September 2007  –  November 2010  (3 years 3 months) Support Sales/ Bid Teams on significant customer RFP's or RFI's for Telecom Solutions. \nPro-actively manage sourcing of quotations to improve Colt's margin and meet agreed timelines. \nIncrease win rate through focused qualification and innovative solution. \nAgree an Off-Net Development plan for each customer with Bid Team. \nDelegate work with in the virtual as well as physical teams. \nNegotiating with Third Party Suppliers to get the most competitive offer from them. \nWorking closely with the Pricing Team while they create final offer for the End Customer. \nCo-ordinate testing, upload and maintenance of suppliers off net costs in the off net pricing tool, working with the Carrier relation managers and Off Net Quoting analysts/specialists  \nLead quality project as agreed with Management when required.  \nProvide analytical input on supplier competitiveness to support Carrier Relationship Managers. Functional Resource Manager CSC Pvt. Ltd August 2006  –  September 2007  (1 year 2 months) Working as a Functional Resource Manager for the Demand and Resource Management Team for Central Europe Region. \nInteracting with the German Tech Leads and Coordinators to allocate resources for any of the Technical Demands. \nGeneration of all the Operational Reports in MS-Excel and keeping track of Weekly and Monthly SLA's for all the team and all the team members. \nGeneration of Quality Documents and process charts for the process. Senior MIS Executive WNS October 2005  –  July 2006  (10 months) Technical Support Officer Convergys May 2004  –  March 2005  (11 months) Faculty Member CMC Computers May 2004  –  March 2005  (11 months) Resource Deployment Manager IBM Global Process Services November 2010  – Present (4 years 10 months) Gurgaon, India Deploys assigned Consultant Group resources to achieve agreed bench and utilisation targets Resource Deployment Manager IBM Global Process Services November 2010  – Present (4 years 10 months) Gurgaon, India Deploys assigned Consultant Group resources to achieve agreed bench and utilisation targets Resource Deployment Manager IBM GPS November 2010  – Present (4 years 10 months) Support IBM Germany Consultant Group by deploying them to available Projects. \nDeploys assigned Consultant Group resources to achieve agreed bench and utilisation targets.  \nAssists Business Managers to manage redeployment, recruitment, redundancies and retirements. \nWorks with the People Managers / Business Managers community for HR, utilisation, skills development and retraining issues. \nProvides input to capacity audits / forecasts and information planning purposes. \nWorks with the Lead Resource Deployment Managers and Business Managers /People Manager community to match future supply and demand \nProvides timely management information and reporting. Resource Deployment Manager IBM GPS November 2010  – Present (4 years 10 months) Support IBM Germany Consultant Group by deploying them to available Projects. \nDeploys assigned Consultant Group resources to achieve agreed bench and utilisation targets.  \nAssists Business Managers to manage redeployment, recruitment, redundancies and retirements. \nWorks with the People Managers / Business Managers community for HR, utilisation, skills development and retraining issues. \nProvides input to capacity audits / forecasts and information planning purposes. \nWorks with the Lead Resource Deployment Managers and Business Managers /People Manager community to match future supply and demand \nProvides timely management information and reporting. Lead Analyst Project Management - Telco Solutions COLT Technologies September 2007  –  November 2010  (3 years 3 months) Lead Analyst Project Management - Telco Solutions COLT Technologies September 2007  –  November 2010  (3 years 3 months) Lead Analyst COLT Technologies September 2007  –  November 2010  (3 years 3 months) Support Sales/ Bid Teams on significant customer RFP's or RFI's for Telecom Solutions. \nPro-actively manage sourcing of quotations to improve Colt's margin and meet agreed timelines. \nIncrease win rate through focused qualification and innovative solution. \nAgree an Off-Net Development plan for each customer with Bid Team. \nDelegate work with in the virtual as well as physical teams. \nNegotiating with Third Party Suppliers to get the most competitive offer from them. \nWorking closely with the Pricing Team while they create final offer for the End Customer. \nCo-ordinate testing, upload and maintenance of suppliers off net costs in the off net pricing tool, working with the Carrier relation managers and Off Net Quoting analysts/specialists  \nLead quality project as agreed with Management when required.  \nProvide analytical input on supplier competitiveness to support Carrier Relationship Managers. Lead Analyst COLT Technologies September 2007  –  November 2010  (3 years 3 months) Support Sales/ Bid Teams on significant customer RFP's or RFI's for Telecom Solutions. \nPro-actively manage sourcing of quotations to improve Colt's margin and meet agreed timelines. \nIncrease win rate through focused qualification and innovative solution. \nAgree an Off-Net Development plan for each customer with Bid Team. \nDelegate work with in the virtual as well as physical teams. \nNegotiating with Third Party Suppliers to get the most competitive offer from them. \nWorking closely with the Pricing Team while they create final offer for the End Customer. \nCo-ordinate testing, upload and maintenance of suppliers off net costs in the off net pricing tool, working with the Carrier relation managers and Off Net Quoting analysts/specialists  \nLead quality project as agreed with Management when required.  \nProvide analytical input on supplier competitiveness to support Carrier Relationship Managers. Functional Resource Manager CSC Pvt. Ltd August 2006  –  September 2007  (1 year 2 months) Working as a Functional Resource Manager for the Demand and Resource Management Team for Central Europe Region. \nInteracting with the German Tech Leads and Coordinators to allocate resources for any of the Technical Demands. \nGeneration of all the Operational Reports in MS-Excel and keeping track of Weekly and Monthly SLA's for all the team and all the team members. \nGeneration of Quality Documents and process charts for the process. Functional Resource Manager CSC Pvt. Ltd August 2006  –  September 2007  (1 year 2 months) Working as a Functional Resource Manager for the Demand and Resource Management Team for Central Europe Region. \nInteracting with the German Tech Leads and Coordinators to allocate resources for any of the Technical Demands. \nGeneration of all the Operational Reports in MS-Excel and keeping track of Weekly and Monthly SLA's for all the team and all the team members. \nGeneration of Quality Documents and process charts for the process. Senior MIS Executive WNS October 2005  –  July 2006  (10 months) Senior MIS Executive WNS October 2005  –  July 2006  (10 months) Technical Support Officer Convergys May 2004  –  March 2005  (11 months) Technical Support Officer Convergys May 2004  –  March 2005  (11 months) Faculty Member CMC Computers May 2004  –  March 2005  (11 months) Faculty Member CMC Computers May 2004  –  March 2005  (11 months) ", "Experience Resource Deployment Manager IBM Global Business Services Resource Deployment Manager IBM 2001  – Present (14 years) Resource Deployment Manager IBM Global Business Services Resource Deployment Manager IBM Global Business Services Resource Deployment Manager IBM 2001  – Present (14 years) Resource Deployment Manager IBM 2001  – Present (14 years) Skills Resource Management Skills  Resource Management Resource Management Resource Management "]}