{"position": "Digital Strategist", "company": "IBM", "profiles": ["Skills SEM SEO Link Building Analytics Blogging Google Analytics Online Reputation... Web Analytics Organic Search Online Advertising Keyword Research Social Media Marketing PPC Search Advertising Google Adwords Online Marketing Email Marketing Copywriting Affiliate Marketing Content Strategy See 5+     See less Skills  SEM SEO Link Building Analytics Blogging Google Analytics Online Reputation... Web Analytics Organic Search Online Advertising Keyword Research Social Media Marketing PPC Search Advertising Google Adwords Online Marketing Email Marketing Copywriting Affiliate Marketing Content Strategy See 5+     See less SEM SEO Link Building Analytics Blogging Google Analytics Online Reputation... Web Analytics Organic Search Online Advertising Keyword Research Social Media Marketing PPC Search Advertising Google Adwords Online Marketing Email Marketing Copywriting Affiliate Marketing Content Strategy See 5+     See less SEM SEO Link Building Analytics Blogging Google Analytics Online Reputation... Web Analytics Organic Search Online Advertising Keyword Research Social Media Marketing PPC Search Advertising Google Adwords Online Marketing Email Marketing Copywriting Affiliate Marketing Content Strategy See 5+     See less ", "Summary Shushant has 8 years of experience in the field in the field of Digital Marketing which includes SEM, Social Media, B2B Marketing, Web Analytic, Lead Generation. Project Management, Vendor management and Account Management.  \n \nShushant brings deep understanding of online advertising in various Industry verticals like Banking, Retail, FSI, Travel, Entertainment, Software development and many more.  \n \nHe holds a Master of Business Administration Degree from Marshall University USA in collaboration with Bhartiya Vidya Bhavan Bangalore \n \nSpecialities:  \nDigital Marketing  \nSearch Engine Marketing \nLead/Demand Generation \nWeb Analytics \nProject Management \nB2B Marketing Summary Shushant has 8 years of experience in the field in the field of Digital Marketing which includes SEM, Social Media, B2B Marketing, Web Analytic, Lead Generation. Project Management, Vendor management and Account Management.  \n \nShushant brings deep understanding of online advertising in various Industry verticals like Banking, Retail, FSI, Travel, Entertainment, Software development and many more.  \n \nHe holds a Master of Business Administration Degree from Marshall University USA in collaboration with Bhartiya Vidya Bhavan Bangalore \n \nSpecialities:  \nDigital Marketing  \nSearch Engine Marketing \nLead/Demand Generation \nWeb Analytics \nProject Management \nB2B Marketing Shushant has 8 years of experience in the field in the field of Digital Marketing which includes SEM, Social Media, B2B Marketing, Web Analytic, Lead Generation. Project Management, Vendor management and Account Management.  \n \nShushant brings deep understanding of online advertising in various Industry verticals like Banking, Retail, FSI, Travel, Entertainment, Software development and many more.  \n \nHe holds a Master of Business Administration Degree from Marshall University USA in collaboration with Bhartiya Vidya Bhavan Bangalore \n \nSpecialities:  \nDigital Marketing  \nSearch Engine Marketing \nLead/Demand Generation \nWeb Analytics \nProject Management \nB2B Marketing Shushant has 8 years of experience in the field in the field of Digital Marketing which includes SEM, Social Media, B2B Marketing, Web Analytic, Lead Generation. Project Management, Vendor management and Account Management.  \n \nShushant brings deep understanding of online advertising in various Industry verticals like Banking, Retail, FSI, Travel, Entertainment, Software development and many more.  \n \nHe holds a Master of Business Administration Degree from Marshall University USA in collaboration with Bhartiya Vidya Bhavan Bangalore \n \nSpecialities:  \nDigital Marketing  \nSearch Engine Marketing \nLead/Demand Generation \nWeb Analytics \nProject Management \nB2B Marketing Experience Digital Strategist IBM June 2015  – Present (3 months) Bengaluru Area, India Digital Marketing - IPAC Thermo Fisher Scientific March 2014  –  May 2015  (1 year 3 months) Bangalore 1. Developing digital marketing programs and ebusiness solutions (B2B & B2C) for IPAC \n2. Responsible for project management of major programs to enhance the ebusiness solutions across IPAC \n3. Digital marketing campaigns/ programs for lead generation across IPAC \n4. Responsible for regional support of the website for South Asia. Assistant Marketing Manager Infosys September 2011  –  March 2014  (2 years 7 months) Bengaluru Area, India I support products and platforms of Infosys to get more exposure in online world and help them to generate business leads through various digital marketing techniques Online Marketing Manager Vinove Software and Services Pvt. Ltd. January 2011  –  July 2011  (7 months) New Delhi Area, India Manage entire Online Marketing initiative of one of the top properties of Vinove Manager-Pay Per Click Advertising OMLogic Consulting March 2010  –  December 2010  (10 months) Managing overall PPC advertising for clients, including Affiliate marketing and Social Media Ads along with End to End Project Management PPC Expert OMLogic Consulting October 2008  –  March 2010  (1 year 6 months) Business Associate Regalix-Inc January 2008  –  September 2008  (9 months) Digital Marketing Account Associate Regalix-Inc October 2006  –  December 2007  (1 year 3 months) Manage SEM campaigns for Clients Digital Strategist IBM June 2015  – Present (3 months) Bengaluru Area, India Digital Strategist IBM June 2015  – Present (3 months) Bengaluru Area, India Digital Marketing - IPAC Thermo Fisher Scientific March 2014  –  May 2015  (1 year 3 months) Bangalore 1. Developing digital marketing programs and ebusiness solutions (B2B & B2C) for IPAC \n2. Responsible for project management of major programs to enhance the ebusiness solutions across IPAC \n3. Digital marketing campaigns/ programs for lead generation across IPAC \n4. Responsible for regional support of the website for South Asia. Digital Marketing - IPAC Thermo Fisher Scientific March 2014  –  May 2015  (1 year 3 months) Bangalore 1. Developing digital marketing programs and ebusiness solutions (B2B & B2C) for IPAC \n2. Responsible for project management of major programs to enhance the ebusiness solutions across IPAC \n3. Digital marketing campaigns/ programs for lead generation across IPAC \n4. Responsible for regional support of the website for South Asia. Assistant Marketing Manager Infosys September 2011  –  March 2014  (2 years 7 months) Bengaluru Area, India I support products and platforms of Infosys to get more exposure in online world and help them to generate business leads through various digital marketing techniques Assistant Marketing Manager Infosys September 2011  –  March 2014  (2 years 7 months) Bengaluru Area, India I support products and platforms of Infosys to get more exposure in online world and help them to generate business leads through various digital marketing techniques Online Marketing Manager Vinove Software and Services Pvt. Ltd. January 2011  –  July 2011  (7 months) New Delhi Area, India Manage entire Online Marketing initiative of one of the top properties of Vinove Online Marketing Manager Vinove Software and Services Pvt. Ltd. January 2011  –  July 2011  (7 months) New Delhi Area, India Manage entire Online Marketing initiative of one of the top properties of Vinove Manager-Pay Per Click Advertising OMLogic Consulting March 2010  –  December 2010  (10 months) Managing overall PPC advertising for clients, including Affiliate marketing and Social Media Ads along with End to End Project Management Manager-Pay Per Click Advertising OMLogic Consulting March 2010  –  December 2010  (10 months) Managing overall PPC advertising for clients, including Affiliate marketing and Social Media Ads along with End to End Project Management PPC Expert OMLogic Consulting October 2008  –  March 2010  (1 year 6 months) PPC Expert OMLogic Consulting October 2008  –  March 2010  (1 year 6 months) Business Associate Regalix-Inc January 2008  –  September 2008  (9 months) Digital Marketing Business Associate Regalix-Inc January 2008  –  September 2008  (9 months) Digital Marketing Account Associate Regalix-Inc October 2006  –  December 2007  (1 year 3 months) Manage SEM campaigns for Clients Account Associate Regalix-Inc October 2006  –  December 2007  (1 year 3 months) Manage SEM campaigns for Clients Languages English Hindi English Hindi English Hindi Skills SEM PPC Online Advertising Social Media Account Management Marketing Management Web Analytics Digital Marketing Social Media Marketing Lead Generation Product Marketing Vendor Management Online Marketing Google Adwords Affiliate Marketing Business Strategy Google Analytics Digital Media Analytics Advertising Email Marketing Business Development Leadership Marketing Strategy E-commerce Web Marketing Customer Acquisition Brand Management Digital Strategy SEO Mobile Marketing Marketing CRM Market Research B2B Marketing Marketing Research Competitive Analysis Direct Marketing Campaign Management Management See 25+     See less Skills  SEM PPC Online Advertising Social Media Account Management Marketing Management Web Analytics Digital Marketing Social Media Marketing Lead Generation Product Marketing Vendor Management Online Marketing Google Adwords Affiliate Marketing Business Strategy Google Analytics Digital Media Analytics Advertising Email Marketing Business Development Leadership Marketing Strategy E-commerce Web Marketing Customer Acquisition Brand Management Digital Strategy SEO Mobile Marketing Marketing CRM Market Research B2B Marketing Marketing Research Competitive Analysis Direct Marketing Campaign Management Management See 25+     See less SEM PPC Online Advertising Social Media Account Management Marketing Management Web Analytics Digital Marketing Social Media Marketing Lead Generation Product Marketing Vendor Management Online Marketing Google Adwords Affiliate Marketing Business Strategy Google Analytics Digital Media Analytics Advertising Email Marketing Business Development Leadership Marketing Strategy E-commerce Web Marketing Customer Acquisition Brand Management Digital Strategy SEO Mobile Marketing Marketing CRM Market Research B2B Marketing Marketing Research Competitive Analysis Direct Marketing Campaign Management Management See 25+     See less SEM PPC Online Advertising Social Media Account Management Marketing Management Web Analytics Digital Marketing Social Media Marketing Lead Generation Product Marketing Vendor Management Online Marketing Google Adwords Affiliate Marketing Business Strategy Google Analytics Digital Media Analytics Advertising Email Marketing Business Development Leadership Marketing Strategy E-commerce Web Marketing Customer Acquisition Brand Management Digital Strategy SEO Mobile Marketing Marketing CRM Market Research B2B Marketing Marketing Research Competitive Analysis Direct Marketing Campaign Management Management See 25+     See less Education Marshall University Masters of Business Adminstration,  Marketing 2004  – 2006 UC Irvine, Extension Digital Marketing,  Digital Marketing , A 2014  – 2014 Introduction to Digital Marketing \nDigital Management, Planning, & Integration \nUnderstanding, Selecting, & Deploying Digital Media \nDigital Media Testing, Measurement, & Optimization Activities and Societies:  Attended 4 online modules on Digital marketing St.Micheal English medium School 12th,  PCB 1991  – 2000 Marshall University Masters of Business Adminstration,  Marketing 2004  – 2006 Marshall University Masters of Business Adminstration,  Marketing 2004  – 2006 Marshall University Masters of Business Adminstration,  Marketing 2004  – 2006 UC Irvine, Extension Digital Marketing,  Digital Marketing , A 2014  – 2014 Introduction to Digital Marketing \nDigital Management, Planning, & Integration \nUnderstanding, Selecting, & Deploying Digital Media \nDigital Media Testing, Measurement, & Optimization Activities and Societies:  Attended 4 online modules on Digital marketing UC Irvine, Extension Digital Marketing,  Digital Marketing , A 2014  – 2014 Introduction to Digital Marketing \nDigital Management, Planning, & Integration \nUnderstanding, Selecting, & Deploying Digital Media \nDigital Media Testing, Measurement, & Optimization Activities and Societies:  Attended 4 online modules on Digital marketing UC Irvine, Extension Digital Marketing,  Digital Marketing , A 2014  – 2014 Introduction to Digital Marketing \nDigital Management, Planning, & Integration \nUnderstanding, Selecting, & Deploying Digital Media \nDigital Media Testing, Measurement, & Optimization Activities and Societies:  Attended 4 online modules on Digital marketing St.Micheal English medium School 12th,  PCB 1991  – 2000 St.Micheal English medium School 12th,  PCB 1991  – 2000 St.Micheal English medium School 12th,  PCB 1991  – 2000 Honors & Awards Linkedin Excellence in Digital Innovation Linkedin and Paul Writer February 2014 Best B2B lead generation campaign using Linkedin Additional Honors & Awards Google Adwords Qualified Individual Linkedin Excellence in Digital Innovation Linkedin and Paul Writer February 2014 Best B2B lead generation campaign using Linkedin Linkedin Excellence in Digital Innovation Linkedin and Paul Writer February 2014 Best B2B lead generation campaign using Linkedin Linkedin Excellence in Digital Innovation Linkedin and Paul Writer February 2014 Best B2B lead generation campaign using Linkedin Additional Honors & Awards Google Adwords Qualified Individual Additional Honors & Awards Google Adwords Qualified Individual Additional Honors & Awards Google Adwords Qualified Individual ", "Summary I am a communications, media, and digital marketing expert with 15 years of experience in various IBM marketing roles. My expertise includes developing and executing strategies that drive change, generate demand, and call internal and external audiences to action. \n \nAs a skilled writer, I have a proven track record of transforming concepts and messages into compelling storylines via marketing campaigns, video production, branding, event management and web design. \n \nMy success is in creatively driving projects and campaigns from concept to completion, while consistently exceeding targets. \n \nSpecialties:  \nExecutive communications • Brand messaging • Web content • Event management • Social media • Project management • Creative direction • Video production • Intranet & wikis • Newsletters • Vendor management • Product launch support Summary I am a communications, media, and digital marketing expert with 15 years of experience in various IBM marketing roles. My expertise includes developing and executing strategies that drive change, generate demand, and call internal and external audiences to action. \n \nAs a skilled writer, I have a proven track record of transforming concepts and messages into compelling storylines via marketing campaigns, video production, branding, event management and web design. \n \nMy success is in creatively driving projects and campaigns from concept to completion, while consistently exceeding targets. \n \nSpecialties:  \nExecutive communications • Brand messaging • Web content • Event management • Social media • Project management • Creative direction • Video production • Intranet & wikis • Newsletters • Vendor management • Product launch support I am a communications, media, and digital marketing expert with 15 years of experience in various IBM marketing roles. My expertise includes developing and executing strategies that drive change, generate demand, and call internal and external audiences to action. \n \nAs a skilled writer, I have a proven track record of transforming concepts and messages into compelling storylines via marketing campaigns, video production, branding, event management and web design. \n \nMy success is in creatively driving projects and campaigns from concept to completion, while consistently exceeding targets. \n \nSpecialties:  \nExecutive communications • Brand messaging • Web content • Event management • Social media • Project management • Creative direction • Video production • Intranet & wikis • Newsletters • Vendor management • Product launch support I am a communications, media, and digital marketing expert with 15 years of experience in various IBM marketing roles. My expertise includes developing and executing strategies that drive change, generate demand, and call internal and external audiences to action. \n \nAs a skilled writer, I have a proven track record of transforming concepts and messages into compelling storylines via marketing campaigns, video production, branding, event management and web design. \n \nMy success is in creatively driving projects and campaigns from concept to completion, while consistently exceeding targets. \n \nSpecialties:  \nExecutive communications • Brand messaging • Web content • Event management • Social media • Project management • Creative direction • Video production • Intranet & wikis • Newsletters • Vendor management • Product launch support Experience Social Media, Communications and Digital Strategist, IBM Software Solutions Group IBM November 2013  – Present (1 year 10 months) - Maintain an integrated, end-to-end digital and social surround program that leverages event content and assets. \n- Develop external messaging to drive awareness and attendance for IBM worldwide events. EXECUTIVE COMMUNICATIONS LEAD & DIGITAL STRATEGIST, IBM Tivoli IBM September 2010  –  July 2013  (2 years 11 months) Executive Communications: \nCreated executive communications on behalf of IBM vice presidents and global sales leader ==>  \nAchieved average open rates of 112% \n \n(Message from Don Osorno, IBM Global Sales Leader for SMB):  \n\"A BIG KUDOS as you are the person behind the scenes that puts all the content together. Thank you! ...The journal is a a terrific way to drive awareness and usage in the SMB space. Thanks for your proactive approach, compelling creativity and teaming into driving this initiative.\" \n \nDigital Strategist: \nDesigned external web sites from concept to launch, including communications plan, web copy, format, social media, SEO, metrics. \n• Developed customer facing Tivoli 'Small and Midsized Business' web portal to drive awareness/usage of our offerings ==> Launched at 5,500 page views in March, 2013, and grew 28% over next two months. \n• Developed external Customer Reference web module around cloud, mobile and asset management ==> Launched at 1,100 page views in March, 2013. \n• Contributed to the redesign of the 'Tivoli Cloud & Smarter Infrastructure' web portal ==> Site averaged 32K+ page views/month in the first 3 months after redesign, a 21% YOY increase. \n• Drove Tivoli's representation into the 'Smarter Products' global web marketing campaign ==> Site totaled 216K page views for the year, the 3rd highest total of the 14 IBM Smarter Planet themed web sites. \n• Created Tivoli Cloud web site in support of the SmartCloud launch ==> Site averaged 2,700 page views/month, a 480% YOY increase. GLOBAL SMALL & MEDIUM BUSINESS (SMB) MARKETING STRATEGIST, IBM Tivoli IBM January 2011  –  June 2013  (2 years 6 months) • Developed SMB go-to-market/social media strategy to help IBM sellers expand Tivoli's addressable sales opportunity by growing new customer and Growth Market leads ==> Grew validated marketing leads 11% YOY, digital asset registrations 14% YOY, and digital marketing pipeline win revenue 21% YOY. \n \n• Created sales enablement resources including quarterly pipeline progression kits, elevator pitches and cross-selling guides. GLOBAL DEMAND PROGRAMS LEAD, IBM Global Financing IBM May 2006  –  August 2010  (4 years 4 months) Developed strategies, channel enablement and demand generation tactics in support of IGF marketing campaigns to uncover new leads: \n• Created videos, campaign messaging, web copy and sales enablement resources \n• Designed IGF’s first social media strategy, including IGF’s presence on Lotus Connections, a networking forum for customers and sellers.  \n• Created the IMC strategy in support of six vendor alliance programs (Lenovo, Juniper, InfoPrint, APC, Barco, Motorola) ==> Grew IGF vendor revenue by over 70%YOY to $80M COMMUNICATION MANAGER: 2006 WINTER OLYMPIC GAMES Lenovo May 2005  –  April 2006  (1 year) Managed worldwide internal communications for Lenovo's sponsorship of the 2006 Olympic Games: \n• Leveraged the Games to rally employees around a common theme and establish Lenovo as a formidable worldwide brand: \n• Managed Olympic intranet portal ==> Averaged 6K+ page views/month and over 11K+ page views during the Games. SALES COMMUNICATIONS LEAD, IBM PC Division IBM August 2004  –  April 2005  (9 months) Managed internal sales portal to help sellers maximize customer face time: \n• Provided feature stories, event coverage, executive messaging, and product launch talking points. Managed web-based initiatives such as customer references and feedback mechanisms ==> Portal averaged 31,000 views/month. \n• Executed seller surveys and focus groups to better understand and enable the sales community; Conducted redesign of the sales portal based on user feedback ==> Significantly improved portal navigation and usability, boosting site traffic 25%. MARKETING COMMUNICATIONS MANAGER, IBM PartnerWorld IBM August 1998  –  July 2004  (6 years) • Developed communications plans to position IBM as the preferred partner to the Business Partner community. \n• Maintained content for PartnerWorld for Developers’ web pages. Social Media, Communications and Digital Strategist, IBM Software Solutions Group IBM November 2013  – Present (1 year 10 months) - Maintain an integrated, end-to-end digital and social surround program that leverages event content and assets. \n- Develop external messaging to drive awareness and attendance for IBM worldwide events. Social Media, Communications and Digital Strategist, IBM Software Solutions Group IBM November 2013  – Present (1 year 10 months) - Maintain an integrated, end-to-end digital and social surround program that leverages event content and assets. \n- Develop external messaging to drive awareness and attendance for IBM worldwide events. EXECUTIVE COMMUNICATIONS LEAD & DIGITAL STRATEGIST, IBM Tivoli IBM September 2010  –  July 2013  (2 years 11 months) Executive Communications: \nCreated executive communications on behalf of IBM vice presidents and global sales leader ==>  \nAchieved average open rates of 112% \n \n(Message from Don Osorno, IBM Global Sales Leader for SMB):  \n\"A BIG KUDOS as you are the person behind the scenes that puts all the content together. Thank you! ...The journal is a a terrific way to drive awareness and usage in the SMB space. Thanks for your proactive approach, compelling creativity and teaming into driving this initiative.\" \n \nDigital Strategist: \nDesigned external web sites from concept to launch, including communications plan, web copy, format, social media, SEO, metrics. \n• Developed customer facing Tivoli 'Small and Midsized Business' web portal to drive awareness/usage of our offerings ==> Launched at 5,500 page views in March, 2013, and grew 28% over next two months. \n• Developed external Customer Reference web module around cloud, mobile and asset management ==> Launched at 1,100 page views in March, 2013. \n• Contributed to the redesign of the 'Tivoli Cloud & Smarter Infrastructure' web portal ==> Site averaged 32K+ page views/month in the first 3 months after redesign, a 21% YOY increase. \n• Drove Tivoli's representation into the 'Smarter Products' global web marketing campaign ==> Site totaled 216K page views for the year, the 3rd highest total of the 14 IBM Smarter Planet themed web sites. \n• Created Tivoli Cloud web site in support of the SmartCloud launch ==> Site averaged 2,700 page views/month, a 480% YOY increase. EXECUTIVE COMMUNICATIONS LEAD & DIGITAL STRATEGIST, IBM Tivoli IBM September 2010  –  July 2013  (2 years 11 months) Executive Communications: \nCreated executive communications on behalf of IBM vice presidents and global sales leader ==>  \nAchieved average open rates of 112% \n \n(Message from Don Osorno, IBM Global Sales Leader for SMB):  \n\"A BIG KUDOS as you are the person behind the scenes that puts all the content together. Thank you! ...The journal is a a terrific way to drive awareness and usage in the SMB space. Thanks for your proactive approach, compelling creativity and teaming into driving this initiative.\" \n \nDigital Strategist: \nDesigned external web sites from concept to launch, including communications plan, web copy, format, social media, SEO, metrics. \n• Developed customer facing Tivoli 'Small and Midsized Business' web portal to drive awareness/usage of our offerings ==> Launched at 5,500 page views in March, 2013, and grew 28% over next two months. \n• Developed external Customer Reference web module around cloud, mobile and asset management ==> Launched at 1,100 page views in March, 2013. \n• Contributed to the redesign of the 'Tivoli Cloud & Smarter Infrastructure' web portal ==> Site averaged 32K+ page views/month in the first 3 months after redesign, a 21% YOY increase. \n• Drove Tivoli's representation into the 'Smarter Products' global web marketing campaign ==> Site totaled 216K page views for the year, the 3rd highest total of the 14 IBM Smarter Planet themed web sites. \n• Created Tivoli Cloud web site in support of the SmartCloud launch ==> Site averaged 2,700 page views/month, a 480% YOY increase. GLOBAL SMALL & MEDIUM BUSINESS (SMB) MARKETING STRATEGIST, IBM Tivoli IBM January 2011  –  June 2013  (2 years 6 months) • Developed SMB go-to-market/social media strategy to help IBM sellers expand Tivoli's addressable sales opportunity by growing new customer and Growth Market leads ==> Grew validated marketing leads 11% YOY, digital asset registrations 14% YOY, and digital marketing pipeline win revenue 21% YOY. \n \n• Created sales enablement resources including quarterly pipeline progression kits, elevator pitches and cross-selling guides. GLOBAL SMALL & MEDIUM BUSINESS (SMB) MARKETING STRATEGIST, IBM Tivoli IBM January 2011  –  June 2013  (2 years 6 months) • Developed SMB go-to-market/social media strategy to help IBM sellers expand Tivoli's addressable sales opportunity by growing new customer and Growth Market leads ==> Grew validated marketing leads 11% YOY, digital asset registrations 14% YOY, and digital marketing pipeline win revenue 21% YOY. \n \n• Created sales enablement resources including quarterly pipeline progression kits, elevator pitches and cross-selling guides. GLOBAL DEMAND PROGRAMS LEAD, IBM Global Financing IBM May 2006  –  August 2010  (4 years 4 months) Developed strategies, channel enablement and demand generation tactics in support of IGF marketing campaigns to uncover new leads: \n• Created videos, campaign messaging, web copy and sales enablement resources \n• Designed IGF’s first social media strategy, including IGF’s presence on Lotus Connections, a networking forum for customers and sellers.  \n• Created the IMC strategy in support of six vendor alliance programs (Lenovo, Juniper, InfoPrint, APC, Barco, Motorola) ==> Grew IGF vendor revenue by over 70%YOY to $80M GLOBAL DEMAND PROGRAMS LEAD, IBM Global Financing IBM May 2006  –  August 2010  (4 years 4 months) Developed strategies, channel enablement and demand generation tactics in support of IGF marketing campaigns to uncover new leads: \n• Created videos, campaign messaging, web copy and sales enablement resources \n• Designed IGF’s first social media strategy, including IGF’s presence on Lotus Connections, a networking forum for customers and sellers.  \n• Created the IMC strategy in support of six vendor alliance programs (Lenovo, Juniper, InfoPrint, APC, Barco, Motorola) ==> Grew IGF vendor revenue by over 70%YOY to $80M COMMUNICATION MANAGER: 2006 WINTER OLYMPIC GAMES Lenovo May 2005  –  April 2006  (1 year) Managed worldwide internal communications for Lenovo's sponsorship of the 2006 Olympic Games: \n• Leveraged the Games to rally employees around a common theme and establish Lenovo as a formidable worldwide brand: \n• Managed Olympic intranet portal ==> Averaged 6K+ page views/month and over 11K+ page views during the Games. COMMUNICATION MANAGER: 2006 WINTER OLYMPIC GAMES Lenovo May 2005  –  April 2006  (1 year) Managed worldwide internal communications for Lenovo's sponsorship of the 2006 Olympic Games: \n• Leveraged the Games to rally employees around a common theme and establish Lenovo as a formidable worldwide brand: \n• Managed Olympic intranet portal ==> Averaged 6K+ page views/month and over 11K+ page views during the Games. SALES COMMUNICATIONS LEAD, IBM PC Division IBM August 2004  –  April 2005  (9 months) Managed internal sales portal to help sellers maximize customer face time: \n• Provided feature stories, event coverage, executive messaging, and product launch talking points. Managed web-based initiatives such as customer references and feedback mechanisms ==> Portal averaged 31,000 views/month. \n• Executed seller surveys and focus groups to better understand and enable the sales community; Conducted redesign of the sales portal based on user feedback ==> Significantly improved portal navigation and usability, boosting site traffic 25%. SALES COMMUNICATIONS LEAD, IBM PC Division IBM August 2004  –  April 2005  (9 months) Managed internal sales portal to help sellers maximize customer face time: \n• Provided feature stories, event coverage, executive messaging, and product launch talking points. Managed web-based initiatives such as customer references and feedback mechanisms ==> Portal averaged 31,000 views/month. \n• Executed seller surveys and focus groups to better understand and enable the sales community; Conducted redesign of the sales portal based on user feedback ==> Significantly improved portal navigation and usability, boosting site traffic 25%. MARKETING COMMUNICATIONS MANAGER, IBM PartnerWorld IBM August 1998  –  July 2004  (6 years) • Developed communications plans to position IBM as the preferred partner to the Business Partner community. \n• Maintained content for PartnerWorld for Developers’ web pages. MARKETING COMMUNICATIONS MANAGER, IBM PartnerWorld IBM August 1998  –  July 2004  (6 years) • Developed communications plans to position IBM as the preferred partner to the Business Partner community. \n• Maintained content for PartnerWorld for Developers’ web pages. Skills Social Media Competitive Analysis IT Service Management Event Management Marketing Communications Integrated Marketing Program Management Project Management Strategic Communications Business Development Management Content Writing Marketing Strategy Cloud Computing Corporate Communications Sales Enablement Strategy Small Business Marketing Content Management Cloud Marketing Product Management Demand Generation Idea Generation Building Relationships Marketing Lead Generation Sales Internal Communications Messaging Digital Strategy Strategic Partnerships Thought Leadership Vendor Management Product Marketing Go-to-market Strategy CRM Team Management Analytics Leadership SaaS Enterprise Software Multi-channel Marketing Business Alliances B2B Marketing Partner Management Marketing Management E-commerce Solution Selling See 33+     See less Skills  Social Media Competitive Analysis IT Service Management Event Management Marketing Communications Integrated Marketing Program Management Project Management Strategic Communications Business Development Management Content Writing Marketing Strategy Cloud Computing Corporate Communications Sales Enablement Strategy Small Business Marketing Content Management Cloud Marketing Product Management Demand Generation Idea Generation Building Relationships Marketing Lead Generation Sales Internal Communications Messaging Digital Strategy Strategic Partnerships Thought Leadership Vendor Management Product Marketing Go-to-market Strategy CRM Team Management Analytics Leadership SaaS Enterprise Software Multi-channel Marketing Business Alliances B2B Marketing Partner Management Marketing Management E-commerce Solution Selling See 33+     See less Social Media Competitive Analysis IT Service Management Event Management Marketing Communications Integrated Marketing Program Management Project Management Strategic Communications Business Development Management Content Writing Marketing Strategy Cloud Computing Corporate Communications Sales Enablement Strategy Small Business Marketing Content Management Cloud Marketing Product Management Demand Generation Idea Generation Building Relationships Marketing Lead Generation Sales Internal Communications Messaging Digital Strategy Strategic Partnerships Thought Leadership Vendor Management Product Marketing Go-to-market Strategy CRM Team Management Analytics Leadership SaaS Enterprise Software Multi-channel Marketing Business Alliances B2B Marketing Partner Management Marketing Management E-commerce Solution Selling See 33+     See less Social Media Competitive Analysis IT Service Management Event Management Marketing Communications Integrated Marketing Program Management Project Management Strategic Communications Business Development Management Content Writing Marketing Strategy Cloud Computing Corporate Communications Sales Enablement Strategy Small Business Marketing Content Management Cloud Marketing Product Management Demand Generation Idea Generation Building Relationships Marketing Lead Generation Sales Internal Communications Messaging Digital Strategy Strategic Partnerships Thought Leadership Vendor Management Product Marketing Go-to-market Strategy CRM Team Management Analytics Leadership SaaS Enterprise Software Multi-channel Marketing Business Alliances B2B Marketing Partner Management Marketing Management E-commerce Solution Selling See 33+     See less Education State University of New York at Albany 1984  – 1988 State University of New York at Albany 1984  – 1988 State University of New York at Albany 1984  – 1988 State University of New York at Albany 1984  – 1988 ", "Summary I'm a Digital Strategist with expertise in data-driven technical search optimization with over a decade of experience as an organic search engine optimization and findability expert for IBM Web properties.I create digital strategies to help sites reach their local and global target audiences — using marketing tactics in organic search, social media, and paid search. \n \nI'm currently the Search Marketing Manager at IBM developerWorks. \n \nSpecialties: search engine optimization, SEO, content marketing, technical writing, B2B marketing, enterprise search marketing, search program management, organic and natural search, technical marketing, online communities, technical editing, web strategy, online strategy, metrics and analytics, social media enablement, lead and response management, conversion optimization. Summary I'm a Digital Strategist with expertise in data-driven technical search optimization with over a decade of experience as an organic search engine optimization and findability expert for IBM Web properties.I create digital strategies to help sites reach their local and global target audiences — using marketing tactics in organic search, social media, and paid search. \n \nI'm currently the Search Marketing Manager at IBM developerWorks. \n \nSpecialties: search engine optimization, SEO, content marketing, technical writing, B2B marketing, enterprise search marketing, search program management, organic and natural search, technical marketing, online communities, technical editing, web strategy, online strategy, metrics and analytics, social media enablement, lead and response management, conversion optimization. I'm a Digital Strategist with expertise in data-driven technical search optimization with over a decade of experience as an organic search engine optimization and findability expert for IBM Web properties.I create digital strategies to help sites reach their local and global target audiences — using marketing tactics in organic search, social media, and paid search. \n \nI'm currently the Search Marketing Manager at IBM developerWorks. \n \nSpecialties: search engine optimization, SEO, content marketing, technical writing, B2B marketing, enterprise search marketing, search program management, organic and natural search, technical marketing, online communities, technical editing, web strategy, online strategy, metrics and analytics, social media enablement, lead and response management, conversion optimization. I'm a Digital Strategist with expertise in data-driven technical search optimization with over a decade of experience as an organic search engine optimization and findability expert for IBM Web properties.I create digital strategies to help sites reach their local and global target audiences — using marketing tactics in organic search, social media, and paid search. \n \nI'm currently the Search Marketing Manager at IBM developerWorks. \n \nSpecialties: search engine optimization, SEO, content marketing, technical writing, B2B marketing, enterprise search marketing, search program management, organic and natural search, technical marketing, online communities, technical editing, web strategy, online strategy, metrics and analytics, social media enablement, lead and response management, conversion optimization. Experience Trial & Digital Optimization Strategy at IBM CHQ IBM April 2015  – Present (5 months) Search Marketing Manager at IBM developerWorks IBM November 2013  – Present (1 year 10 months) *Increase conversions using data-focused approach to organic search and other digital strategy methods to drive developers to engage with IBM. \n \n*Own and execute the SEO strategy for the developerWorks Web site and network, with a focus on driving visitors into the conversion funnel with compelling search-visible content, efficient lead routing, and informative actionable metrics. \n \n*Coordinate with extended team on strategy for metrics, content, and operations to incorporate conversion-focused search strategy into overall strategy. Digital Strategist at IBM Rational IBM August 2012  –  November 2013  (1 year 4 months) ▪Drive digital results for Rational brand as the digital execution lead via Web strategy, response and lead management, and digital offer implementation  \n▪Identify offer and page opportunities for converting visitors and use reporting and analysis as a method for informing marketing decisions  \n▪Define and implement Innovate event digital strategy \n▪Serve as search/findability expert and provide strategic guidance in digital marketing Web Search Marketing Manager and Digital Strategist IBM November 2008  –  August 2012  (3 years 10 months) ▪Develop marketing strategies and coordinate with Agencies, Brand Managers, Web Producers, and Social Media teams to implement multiple search and social media campaigns to support IBM Software marketing programs in the US and key Global geographies. \n▪ Manage a global team and provide technical leadership in the execution of projects in organic search, social media, crowd-sourcing, infrastructure optimization, mobile marketing, and A/B and multivariate testing. \n▪ Define KPIs and create and implement an expanded and continually improved digital campaign analysis method with actionable insights and monthly recommendations. SEO, Blogs, and Wikis Ombudsman IBM March 2006  –  November 2008  (2 years 9 months) •\tUsed early understanding of the connection between visibility in external search engines and increased awareness of developerWorks to implement usable and accessible page optimization practices to meet metrics and user satisfaction goals. \n•\tEstablished search effectiveness baselines and made predictions and recommendations based on previous and current metrics and market trends to increase organic site pageviews. \n•\tManaged blog and wiki projects and coordinated communication between 100+ IBM bloggers/wiki owners and the blog/wiki developers.  \n•\tPromoted developerWorks blogs and wikis via keyword optimization, Web feed aggregation, and other Web site visibility techniques. \n•\tEstablished and documented best practices for customer use of open source blog server and gathered requirements for improvements. \n•\tMonitored Web site, feedback, and external Web sites, forums, blogs, to remain on the leading edge of blog and wiki best practices, new technologies, and industry standards. Web Editor IBM November 2000  –  March 2006  (5 years 5 months) • Managed workload of the production of the Java technology and Web services zones \n• Edited technical content and wrote marketing blurbs for weekly highlights. \n•\tTrained Web Editors, led monthly calls, and maintained written guidelines on developerWorks processes for Web Editing. Trial & Digital Optimization Strategy at IBM CHQ IBM April 2015  – Present (5 months) Trial & Digital Optimization Strategy at IBM CHQ IBM April 2015  – Present (5 months) Search Marketing Manager at IBM developerWorks IBM November 2013  – Present (1 year 10 months) *Increase conversions using data-focused approach to organic search and other digital strategy methods to drive developers to engage with IBM. \n \n*Own and execute the SEO strategy for the developerWorks Web site and network, with a focus on driving visitors into the conversion funnel with compelling search-visible content, efficient lead routing, and informative actionable metrics. \n \n*Coordinate with extended team on strategy for metrics, content, and operations to incorporate conversion-focused search strategy into overall strategy. Search Marketing Manager at IBM developerWorks IBM November 2013  – Present (1 year 10 months) *Increase conversions using data-focused approach to organic search and other digital strategy methods to drive developers to engage with IBM. \n \n*Own and execute the SEO strategy for the developerWorks Web site and network, with a focus on driving visitors into the conversion funnel with compelling search-visible content, efficient lead routing, and informative actionable metrics. \n \n*Coordinate with extended team on strategy for metrics, content, and operations to incorporate conversion-focused search strategy into overall strategy. Digital Strategist at IBM Rational IBM August 2012  –  November 2013  (1 year 4 months) ▪Drive digital results for Rational brand as the digital execution lead via Web strategy, response and lead management, and digital offer implementation  \n▪Identify offer and page opportunities for converting visitors and use reporting and analysis as a method for informing marketing decisions  \n▪Define and implement Innovate event digital strategy \n▪Serve as search/findability expert and provide strategic guidance in digital marketing Digital Strategist at IBM Rational IBM August 2012  –  November 2013  (1 year 4 months) ▪Drive digital results for Rational brand as the digital execution lead via Web strategy, response and lead management, and digital offer implementation  \n▪Identify offer and page opportunities for converting visitors and use reporting and analysis as a method for informing marketing decisions  \n▪Define and implement Innovate event digital strategy \n▪Serve as search/findability expert and provide strategic guidance in digital marketing Web Search Marketing Manager and Digital Strategist IBM November 2008  –  August 2012  (3 years 10 months) ▪Develop marketing strategies and coordinate with Agencies, Brand Managers, Web Producers, and Social Media teams to implement multiple search and social media campaigns to support IBM Software marketing programs in the US and key Global geographies. \n▪ Manage a global team and provide technical leadership in the execution of projects in organic search, social media, crowd-sourcing, infrastructure optimization, mobile marketing, and A/B and multivariate testing. \n▪ Define KPIs and create and implement an expanded and continually improved digital campaign analysis method with actionable insights and monthly recommendations. Web Search Marketing Manager and Digital Strategist IBM November 2008  –  August 2012  (3 years 10 months) ▪Develop marketing strategies and coordinate with Agencies, Brand Managers, Web Producers, and Social Media teams to implement multiple search and social media campaigns to support IBM Software marketing programs in the US and key Global geographies. \n▪ Manage a global team and provide technical leadership in the execution of projects in organic search, social media, crowd-sourcing, infrastructure optimization, mobile marketing, and A/B and multivariate testing. \n▪ Define KPIs and create and implement an expanded and continually improved digital campaign analysis method with actionable insights and monthly recommendations. SEO, Blogs, and Wikis Ombudsman IBM March 2006  –  November 2008  (2 years 9 months) •\tUsed early understanding of the connection between visibility in external search engines and increased awareness of developerWorks to implement usable and accessible page optimization practices to meet metrics and user satisfaction goals. \n•\tEstablished search effectiveness baselines and made predictions and recommendations based on previous and current metrics and market trends to increase organic site pageviews. \n•\tManaged blog and wiki projects and coordinated communication between 100+ IBM bloggers/wiki owners and the blog/wiki developers.  \n•\tPromoted developerWorks blogs and wikis via keyword optimization, Web feed aggregation, and other Web site visibility techniques. \n•\tEstablished and documented best practices for customer use of open source blog server and gathered requirements for improvements. \n•\tMonitored Web site, feedback, and external Web sites, forums, blogs, to remain on the leading edge of blog and wiki best practices, new technologies, and industry standards. SEO, Blogs, and Wikis Ombudsman IBM March 2006  –  November 2008  (2 years 9 months) •\tUsed early understanding of the connection between visibility in external search engines and increased awareness of developerWorks to implement usable and accessible page optimization practices to meet metrics and user satisfaction goals. \n•\tEstablished search effectiveness baselines and made predictions and recommendations based on previous and current metrics and market trends to increase organic site pageviews. \n•\tManaged blog and wiki projects and coordinated communication between 100+ IBM bloggers/wiki owners and the blog/wiki developers.  \n•\tPromoted developerWorks blogs and wikis via keyword optimization, Web feed aggregation, and other Web site visibility techniques. \n•\tEstablished and documented best practices for customer use of open source blog server and gathered requirements for improvements. \n•\tMonitored Web site, feedback, and external Web sites, forums, blogs, to remain on the leading edge of blog and wiki best practices, new technologies, and industry standards. Web Editor IBM November 2000  –  March 2006  (5 years 5 months) • Managed workload of the production of the Java technology and Web services zones \n• Edited technical content and wrote marketing blurbs for weekly highlights. \n•\tTrained Web Editors, led monthly calls, and maintained written guidelines on developerWorks processes for Web Editing. Web Editor IBM November 2000  –  March 2006  (5 years 5 months) • Managed workload of the production of the Java technology and Web services zones \n• Edited technical content and wrote marketing blurbs for weekly highlights. \n•\tTrained Web Editors, led monthly calls, and maintained written guidelines on developerWorks processes for Web Editing. Skills Conversion Optimization Web Analytics SEO SEM Multivariate Testing Digital Marketing Web Strategy B2B Marketing Online Marketing Online Communities Metrics Organic Search Search Social Media Omniture Unica Google Webmaster Tools Lotus Connections Community Management Online Advertising Digital Strategy Community Sites Content Development Web Content Content Strategy Web 2.0 User Experience Information Architecture Web Content Management Social Media Marketing Analytics Blogging Usability Google Analytics Social Business Demand Generation Content Management Web Project Management Mobile Marketing E-commerce Social Media Measurement Multi-channel Marketing Web Marketing PPC Marketing Strategy Interactive Marketing Google Adwords Website Development Marketing Automation Lead Generation See 35+     See less Skills  Conversion Optimization Web Analytics SEO SEM Multivariate Testing Digital Marketing Web Strategy B2B Marketing Online Marketing Online Communities Metrics Organic Search Search Social Media Omniture Unica Google Webmaster Tools Lotus Connections Community Management Online Advertising Digital Strategy Community Sites Content Development Web Content Content Strategy Web 2.0 User Experience Information Architecture Web Content Management Social Media Marketing Analytics Blogging Usability Google Analytics Social Business Demand Generation Content Management Web Project Management Mobile Marketing E-commerce Social Media Measurement Multi-channel Marketing Web Marketing PPC Marketing Strategy Interactive Marketing Google Adwords Website Development Marketing Automation Lead Generation See 35+     See less Conversion Optimization Web Analytics SEO SEM Multivariate Testing Digital Marketing Web Strategy B2B Marketing Online Marketing Online Communities Metrics Organic Search Search Social Media Omniture Unica Google Webmaster Tools Lotus Connections Community Management Online Advertising Digital Strategy Community Sites Content Development Web Content Content Strategy Web 2.0 User Experience Information Architecture Web Content Management Social Media Marketing Analytics Blogging Usability Google Analytics Social Business Demand Generation Content Management Web Project Management Mobile Marketing E-commerce Social Media Measurement Multi-channel Marketing Web Marketing PPC Marketing Strategy Interactive Marketing Google Adwords Website Development Marketing Automation Lead Generation See 35+     See less Conversion Optimization Web Analytics SEO SEM Multivariate Testing Digital Marketing Web Strategy B2B Marketing Online Marketing Online Communities Metrics Organic Search Search Social Media Omniture Unica Google Webmaster Tools Lotus Connections Community Management Online Advertising Digital Strategy Community Sites Content Development Web Content Content Strategy Web 2.0 User Experience Information Architecture Web Content Management Social Media Marketing Analytics Blogging Usability Google Analytics Social Business Demand Generation Content Management Web Project Management Mobile Marketing E-commerce Social Media Measurement Multi-channel Marketing Web Marketing PPC Marketing Strategy Interactive Marketing Google Adwords Website Development Marketing Automation Lead Generation See 35+     See less ", "Summary Well grounded professional with over 7 years experience in sales, negotiation, marketing, project planning and deployment, grant writing and EU funding project management. \n \nMultilingual, Adaptable, Goal driven, Sociable, Communication skills, Sales Skills, Proactive, Disciplined, Dedicated, Creative. More details: http://rowenamarin.strikingly.com/ Summary Well grounded professional with over 7 years experience in sales, negotiation, marketing, project planning and deployment, grant writing and EU funding project management. \n \nMultilingual, Adaptable, Goal driven, Sociable, Communication skills, Sales Skills, Proactive, Disciplined, Dedicated, Creative. More details: http://rowenamarin.strikingly.com/ Well grounded professional with over 7 years experience in sales, negotiation, marketing, project planning and deployment, grant writing and EU funding project management. \n \nMultilingual, Adaptable, Goal driven, Sociable, Communication skills, Sales Skills, Proactive, Disciplined, Dedicated, Creative. More details: http://rowenamarin.strikingly.com/ Well grounded professional with over 7 years experience in sales, negotiation, marketing, project planning and deployment, grant writing and EU funding project management. \n \nMultilingual, Adaptable, Goal driven, Sociable, Communication skills, Sales Skills, Proactive, Disciplined, Dedicated, Creative. More details: http://rowenamarin.strikingly.com/ Experience Digital Strategist IBM July 2015  – Present (2 months) Bucharest, Romania - Responsible for implementing and executing the digital strategy to maximize demand and ensure the highest effectiveness for the Category/Program’s digital presence \n- Inbound digital marketing, search programs, paid media, content syndication and nurture streams \n- Apply analytics to better target, retarget and nurture leads through and “always on” engagement model \n- Share guidance on web deployment strategy and execution plan with the Geo. Sharing best practices and recommendations for digital tactics to improve overall results in terms of organic yield and customer engagement. \n- Analyze and report on online program and campaign effectiveness, metrics and dashboard through the use of web analytics and marketing automation systems to understand user behavior  \nand make recommendations to increase return of investment. \n- Contribute to data requirements for campaign performance tracking reports. \nExplain Key Performance Indicators and performance results to stakeholders. \n Digital Marketing Specialist Nonabox May 2014  –  March 2015  (11 months) Madrid Area, Spain •\tLead a marketing team of four people for the deployment and implementation of expansion strategy in France \n \n•\tManaged the company's SEM positioning: Facebook, Google Adwords and other sales channels. \n \n•\tDeveloped campaigns: idea generation, implementation and post-campaign evaluation. Coordination of the team responsible for design and programming. \n \n•\tCross departmental processes and structure optimization. Improved workflow processes. \n \n•\tResponsible of Email Marketing. Achieved an increase of 50% of the data base. \n \n•\tReporting responsible. Developed and structured the marketing daily, weekly and monthly reporting processes, resulting in increased efficiency for decision making. \n \n•\tB2B: Improved and growth of the affiliation network through active searching other sector partners, generating synergies that have increased Nonabox profit. MS International Project Management ESCP Europe September 2013  –  December 2014  (1 year 4 months) Madrid Area, Spain Project Management and IT Project Management, Marketing Management, Microsoft Project,Risk Management, Change Management, Corporate Finance, Business Planning, Negotiation, Leadership, International Finance Strategies, Presentation Skills, CSR, Entreprenurship, International Distribution, etc Consultant and Project Manager Artex Foundation March 2012  –  September 2013  (1 year 7 months) Bucharest, Romania •\tProject management of 5 European funded projects (average budget 250.000 Euros);  \n \n•\tDevelopment of marketing and PR initiatives (creation of advertising materials; organization of 10 events in 10 cities);  \n \n•\tAdministrative management of European funded projects (accounting, document management) Senior Consultant EFK CONSULTING http://www.efk-consulting.ro/ September 2010  –  September 2013  (3 years 1 month) http://www.efk-consulting.ro/ •\tProject planning, strategy creation and grant writing of 22 projects for european funding. \n \n•\tHave achieved six approved projects: one strategic project of over 1,7MEUR;  \n \n•\tAccount Management and assistance for project implementation; EGS for Marie Claire Sanoma Hearst October 2008  –  March 2012  (3 years 6 months) Bucharest, Romania - Editor for Travel section  \n- Photo Editor \n- Negotiating and buying the international materials(stories) used  \n- Reporting responsable \n- Organising the shootings and events Consultant Hakes, Jhonson&Jhonson, etc January 2007  –  September 2008  (1 year 9 months) Bucharest, Romania Various collaborations with multinational and nongovernmental organizations to present their offers for different target groups. Example: OB brand presentation during some sessions organized for schoolgirls in schools and high schools of Bucharest. Have achieved a target of 2100 persons. Digital Strategist IBM July 2015  – Present (2 months) Bucharest, Romania - Responsible for implementing and executing the digital strategy to maximize demand and ensure the highest effectiveness for the Category/Program’s digital presence \n- Inbound digital marketing, search programs, paid media, content syndication and nurture streams \n- Apply analytics to better target, retarget and nurture leads through and “always on” engagement model \n- Share guidance on web deployment strategy and execution plan with the Geo. Sharing best practices and recommendations for digital tactics to improve overall results in terms of organic yield and customer engagement. \n- Analyze and report on online program and campaign effectiveness, metrics and dashboard through the use of web analytics and marketing automation systems to understand user behavior  \nand make recommendations to increase return of investment. \n- Contribute to data requirements for campaign performance tracking reports. \nExplain Key Performance Indicators and performance results to stakeholders. \n Digital Strategist IBM July 2015  – Present (2 months) Bucharest, Romania - Responsible for implementing and executing the digital strategy to maximize demand and ensure the highest effectiveness for the Category/Program’s digital presence \n- Inbound digital marketing, search programs, paid media, content syndication and nurture streams \n- Apply analytics to better target, retarget and nurture leads through and “always on” engagement model \n- Share guidance on web deployment strategy and execution plan with the Geo. Sharing best practices and recommendations for digital tactics to improve overall results in terms of organic yield and customer engagement. \n- Analyze and report on online program and campaign effectiveness, metrics and dashboard through the use of web analytics and marketing automation systems to understand user behavior  \nand make recommendations to increase return of investment. \n- Contribute to data requirements for campaign performance tracking reports. \nExplain Key Performance Indicators and performance results to stakeholders. \n Digital Marketing Specialist Nonabox May 2014  –  March 2015  (11 months) Madrid Area, Spain •\tLead a marketing team of four people for the deployment and implementation of expansion strategy in France \n \n•\tManaged the company's SEM positioning: Facebook, Google Adwords and other sales channels. \n \n•\tDeveloped campaigns: idea generation, implementation and post-campaign evaluation. Coordination of the team responsible for design and programming. \n \n•\tCross departmental processes and structure optimization. Improved workflow processes. \n \n•\tResponsible of Email Marketing. Achieved an increase of 50% of the data base. \n \n•\tReporting responsible. Developed and structured the marketing daily, weekly and monthly reporting processes, resulting in increased efficiency for decision making. \n \n•\tB2B: Improved and growth of the affiliation network through active searching other sector partners, generating synergies that have increased Nonabox profit. Digital Marketing Specialist Nonabox May 2014  –  March 2015  (11 months) Madrid Area, Spain •\tLead a marketing team of four people for the deployment and implementation of expansion strategy in France \n \n•\tManaged the company's SEM positioning: Facebook, Google Adwords and other sales channels. \n \n•\tDeveloped campaigns: idea generation, implementation and post-campaign evaluation. Coordination of the team responsible for design and programming. \n \n•\tCross departmental processes and structure optimization. Improved workflow processes. \n \n•\tResponsible of Email Marketing. Achieved an increase of 50% of the data base. \n \n•\tReporting responsible. Developed and structured the marketing daily, weekly and monthly reporting processes, resulting in increased efficiency for decision making. \n \n•\tB2B: Improved and growth of the affiliation network through active searching other sector partners, generating synergies that have increased Nonabox profit. MS International Project Management ESCP Europe September 2013  –  December 2014  (1 year 4 months) Madrid Area, Spain Project Management and IT Project Management, Marketing Management, Microsoft Project,Risk Management, Change Management, Corporate Finance, Business Planning, Negotiation, Leadership, International Finance Strategies, Presentation Skills, CSR, Entreprenurship, International Distribution, etc MS International Project Management ESCP Europe September 2013  –  December 2014  (1 year 4 months) Madrid Area, Spain Project Management and IT Project Management, Marketing Management, Microsoft Project,Risk Management, Change Management, Corporate Finance, Business Planning, Negotiation, Leadership, International Finance Strategies, Presentation Skills, CSR, Entreprenurship, International Distribution, etc Consultant and Project Manager Artex Foundation March 2012  –  September 2013  (1 year 7 months) Bucharest, Romania •\tProject management of 5 European funded projects (average budget 250.000 Euros);  \n \n•\tDevelopment of marketing and PR initiatives (creation of advertising materials; organization of 10 events in 10 cities);  \n \n•\tAdministrative management of European funded projects (accounting, document management) Consultant and Project Manager Artex Foundation March 2012  –  September 2013  (1 year 7 months) Bucharest, Romania •\tProject management of 5 European funded projects (average budget 250.000 Euros);  \n \n•\tDevelopment of marketing and PR initiatives (creation of advertising materials; organization of 10 events in 10 cities);  \n \n•\tAdministrative management of European funded projects (accounting, document management) Senior Consultant EFK CONSULTING http://www.efk-consulting.ro/ September 2010  –  September 2013  (3 years 1 month) http://www.efk-consulting.ro/ •\tProject planning, strategy creation and grant writing of 22 projects for european funding. \n \n•\tHave achieved six approved projects: one strategic project of over 1,7MEUR;  \n \n•\tAccount Management and assistance for project implementation; Senior Consultant EFK CONSULTING http://www.efk-consulting.ro/ September 2010  –  September 2013  (3 years 1 month) http://www.efk-consulting.ro/ •\tProject planning, strategy creation and grant writing of 22 projects for european funding. \n \n•\tHave achieved six approved projects: one strategic project of over 1,7MEUR;  \n \n•\tAccount Management and assistance for project implementation; EGS for Marie Claire Sanoma Hearst October 2008  –  March 2012  (3 years 6 months) Bucharest, Romania - Editor for Travel section  \n- Photo Editor \n- Negotiating and buying the international materials(stories) used  \n- Reporting responsable \n- Organising the shootings and events EGS for Marie Claire Sanoma Hearst October 2008  –  March 2012  (3 years 6 months) Bucharest, Romania - Editor for Travel section  \n- Photo Editor \n- Negotiating and buying the international materials(stories) used  \n- Reporting responsable \n- Organising the shootings and events Consultant Hakes, Jhonson&Jhonson, etc January 2007  –  September 2008  (1 year 9 months) Bucharest, Romania Various collaborations with multinational and nongovernmental organizations to present their offers for different target groups. Example: OB brand presentation during some sessions organized for schoolgirls in schools and high schools of Bucharest. Have achieved a target of 2100 persons. Consultant Hakes, Jhonson&Jhonson, etc January 2007  –  September 2008  (1 year 9 months) Bucharest, Romania Various collaborations with multinational and nongovernmental organizations to present their offers for different target groups. Example: OB brand presentation during some sessions organized for schoolgirls in schools and high schools of Bucharest. Have achieved a target of 2100 persons. Languages Romanian Full professional proficiency Italian Professional working proficiency English Full professional proficiency French Limited working proficiency Spanish Professional working proficiency Romanian Full professional proficiency Italian Professional working proficiency English Full professional proficiency French Limited working proficiency Spanish Professional working proficiency Romanian Full professional proficiency Italian Professional working proficiency English Full professional proficiency French Limited working proficiency Spanish Professional working proficiency Full professional proficiency Professional working proficiency Full professional proficiency Limited working proficiency Professional working proficiency Skills Editing Negotiation Project Management Public Speaking Marketing Strategy Marketing Communications Microsoft Office Trainer Expert in EU Funding Editorial Marketing Management Fundraising Microsoft Project Project Planning Business Planning Marketing Market Research Strategy Training Management See 5+     See less Skills  Editing Negotiation Project Management Public Speaking Marketing Strategy Marketing Communications Microsoft Office Trainer Expert in EU Funding Editorial Marketing Management Fundraising Microsoft Project Project Planning Business Planning Marketing Market Research Strategy Training Management See 5+     See less Editing Negotiation Project Management Public Speaking Marketing Strategy Marketing Communications Microsoft Office Trainer Expert in EU Funding Editorial Marketing Management Fundraising Microsoft Project Project Planning Business Planning Marketing Market Research Strategy Training Management See 5+     See less Editing Negotiation Project Management Public Speaking Marketing Strategy Marketing Communications Microsoft Office Trainer Expert in EU Funding Editorial Marketing Management Fundraising Microsoft Project Project Planning Business Planning Marketing Market Research Strategy Training Management See 5+     See less Education Bucharest Academy of Economic Studies Master,  Marketing Management , 9.33 2010  – 2012 Activities and Societies:  Advanced methods of marketing data analysis ,  Competitive analysis and competitive strategy ,  Touristic Management ,  Integrated marketing communication and strategies ,  Strategic marketing ,  Marketing environment analysis ,  Intelligent Decision Support Systems Marketing ,  Marketing Audit ,  Management Channel marketing Bucharest Academy of Economic Studies Bachelor's,  Marketing Management , 9.00 2006  – 2012 2006-2009\t \n \nTitle of qualification awarded; Principal subjects/Occupational skills covered\t \n \nMarketing\t \n \nName and type of organisation providing education and training Activities and Societies:  Economics ,  Marketing ,  Management ,  Consumer Behaviour ,  SPSS ,  Marketing models ,  Econometrics ,  Marketing communication ,  Public relations techniques ,  etc. Bucharest Academy of Economic Studies Master,  Marketing Management , 9.33 2010  – 2012 Activities and Societies:  Advanced methods of marketing data analysis ,  Competitive analysis and competitive strategy ,  Touristic Management ,  Integrated marketing communication and strategies ,  Strategic marketing ,  Marketing environment analysis ,  Intelligent Decision Support Systems Marketing ,  Marketing Audit ,  Management Channel marketing Bucharest Academy of Economic Studies Master,  Marketing Management , 9.33 2010  – 2012 Activities and Societies:  Advanced methods of marketing data analysis ,  Competitive analysis and competitive strategy ,  Touristic Management ,  Integrated marketing communication and strategies ,  Strategic marketing ,  Marketing environment analysis ,  Intelligent Decision Support Systems Marketing ,  Marketing Audit ,  Management Channel marketing Bucharest Academy of Economic Studies Master,  Marketing Management , 9.33 2010  – 2012 Activities and Societies:  Advanced methods of marketing data analysis ,  Competitive analysis and competitive strategy ,  Touristic Management ,  Integrated marketing communication and strategies ,  Strategic marketing ,  Marketing environment analysis ,  Intelligent Decision Support Systems Marketing ,  Marketing Audit ,  Management Channel marketing Bucharest Academy of Economic Studies Bachelor's,  Marketing Management , 9.00 2006  – 2012 2006-2009\t \n \nTitle of qualification awarded; Principal subjects/Occupational skills covered\t \n \nMarketing\t \n \nName and type of organisation providing education and training Activities and Societies:  Economics ,  Marketing ,  Management ,  Consumer Behaviour ,  SPSS ,  Marketing models ,  Econometrics ,  Marketing communication ,  Public relations techniques ,  etc. Bucharest Academy of Economic Studies Bachelor's,  Marketing Management , 9.00 2006  – 2012 2006-2009\t \n \nTitle of qualification awarded; Principal subjects/Occupational skills covered\t \n \nMarketing\t \n \nName and type of organisation providing education and training Activities and Societies:  Economics ,  Marketing ,  Management ,  Consumer Behaviour ,  SPSS ,  Marketing models ,  Econometrics ,  Marketing communication ,  Public relations techniques ,  etc. Bucharest Academy of Economic Studies Bachelor's,  Marketing Management , 9.00 2006  – 2012 2006-2009\t \n \nTitle of qualification awarded; Principal subjects/Occupational skills covered\t \n \nMarketing\t \n \nName and type of organisation providing education and training Activities and Societies:  Economics ,  Marketing ,  Management ,  Consumer Behaviour ,  SPSS ,  Marketing models ,  Econometrics ,  Marketing communication ,  Public relations techniques ,  etc. ", "Summary Specialties: Digital Marketing, Display Marketing, Media Buying, Digital CPM/CPC/CPA Advertising, website optimization & Search Engine Optimization (SEO) Summary Specialties: Digital Marketing, Display Marketing, Media Buying, Digital CPM/CPC/CPA Advertising, website optimization & Search Engine Optimization (SEO) Specialties: Digital Marketing, Display Marketing, Media Buying, Digital CPM/CPC/CPA Advertising, website optimization & Search Engine Optimization (SEO) Specialties: Digital Marketing, Display Marketing, Media Buying, Digital CPM/CPC/CPA Advertising, website optimization & Search Engine Optimization (SEO) Experience Digital Strategist IBM December 2013  – Present (1 year 9 months) Southbury, CT • Project prioritization and management \n• Working with content owners / stakeholders to create or update web content and to educate on market demand for topics being put forward by Product Managers \n• Creating mock ups of web pages and designing navigation paths  \n• Enabling web usability within the current IBM.com templates and designs, or pushing for changes as required. \n• Launching Microsites and Products with the help of Global Web Services and local production team. \n• Updating, fixing, and deleting web content on IBM.com \n• Managing redirects (301 redirects) for marketing and support pages. \n• Coordinating daily activities with the management team. \n• Collaborating across brands to improve web template designs, improving the visitor experience, and sharing best practices.  \n• Updating IBM product taxonomy by coordinating changes with teams in support and product marketing. \n• Working within local market teams to provide guidance and when possible update their local content and demand creation capabilities on their local web sites.  \n• Analyze traffic, responses and pipeline to maximize the efficiency and production of web organic influenced marketing contribution. \n• Provide input in MSMs strategy and messaging such as demand research for phrases in search \n• Provide input and work with Professionals on the planning and guidance for digital tactics aligned to our campaigns. Media Manager (Digital) Fosina Marketing Group June 2012  –  December 2013  (1 year 7 months) Danbury, CT Fosina Marketing Group, a digital agency with deep roots in traditional direct response marketing, creates advantage for our clients by combining decades of direct to consumer marketing experience, time-tested direct response principles and proven online best practices. Over the last ten years, we’ve seamlessly taken these elements and created the Fosina Formula. Simple in concept, multifaceted in design – we simultaneously take the Right Offer, Engaging Creative, Focused Media and Protective Technology and create success for our clients by finding and keeping their best customers. Marketing Coordinator FYI Direct: FreeScore.com, IdentityHawk.com, DebtPlan.com May 2011  –  May 2012  (1 year 1 month) Norwalk, CT -Launched, maintained daily relationships and grew numerous online partners including, but not limited to, Yahoo, Zillow, WeatherBug and Weather.com \n-Led the mobile marketing strategy in 2012; expanded mobile advertisements to new partners and assisted in the design of mobile landing pages \n-Presented various marketing ideas and strategies to upper management to ensure campaign growth and stability \n-Coordinated with creative, product, legal to ensure all online materials were implemented properly \n-Increased and surpassed sales volume on individual account properties by 40% in Q1 2012 Digital Strategist IBM December 2013  – Present (1 year 9 months) Southbury, CT • Project prioritization and management \n• Working with content owners / stakeholders to create or update web content and to educate on market demand for topics being put forward by Product Managers \n• Creating mock ups of web pages and designing navigation paths  \n• Enabling web usability within the current IBM.com templates and designs, or pushing for changes as required. \n• Launching Microsites and Products with the help of Global Web Services and local production team. \n• Updating, fixing, and deleting web content on IBM.com \n• Managing redirects (301 redirects) for marketing and support pages. \n• Coordinating daily activities with the management team. \n• Collaborating across brands to improve web template designs, improving the visitor experience, and sharing best practices.  \n• Updating IBM product taxonomy by coordinating changes with teams in support and product marketing. \n• Working within local market teams to provide guidance and when possible update their local content and demand creation capabilities on their local web sites.  \n• Analyze traffic, responses and pipeline to maximize the efficiency and production of web organic influenced marketing contribution. \n• Provide input in MSMs strategy and messaging such as demand research for phrases in search \n• Provide input and work with Professionals on the planning and guidance for digital tactics aligned to our campaigns. Digital Strategist IBM December 2013  – Present (1 year 9 months) Southbury, CT • Project prioritization and management \n• Working with content owners / stakeholders to create or update web content and to educate on market demand for topics being put forward by Product Managers \n• Creating mock ups of web pages and designing navigation paths  \n• Enabling web usability within the current IBM.com templates and designs, or pushing for changes as required. \n• Launching Microsites and Products with the help of Global Web Services and local production team. \n• Updating, fixing, and deleting web content on IBM.com \n• Managing redirects (301 redirects) for marketing and support pages. \n• Coordinating daily activities with the management team. \n• Collaborating across brands to improve web template designs, improving the visitor experience, and sharing best practices.  \n• Updating IBM product taxonomy by coordinating changes with teams in support and product marketing. \n• Working within local market teams to provide guidance and when possible update their local content and demand creation capabilities on their local web sites.  \n• Analyze traffic, responses and pipeline to maximize the efficiency and production of web organic influenced marketing contribution. \n• Provide input in MSMs strategy and messaging such as demand research for phrases in search \n• Provide input and work with Professionals on the planning and guidance for digital tactics aligned to our campaigns. Media Manager (Digital) Fosina Marketing Group June 2012  –  December 2013  (1 year 7 months) Danbury, CT Fosina Marketing Group, a digital agency with deep roots in traditional direct response marketing, creates advantage for our clients by combining decades of direct to consumer marketing experience, time-tested direct response principles and proven online best practices. Over the last ten years, we’ve seamlessly taken these elements and created the Fosina Formula. Simple in concept, multifaceted in design – we simultaneously take the Right Offer, Engaging Creative, Focused Media and Protective Technology and create success for our clients by finding and keeping their best customers. Media Manager (Digital) Fosina Marketing Group June 2012  –  December 2013  (1 year 7 months) Danbury, CT Fosina Marketing Group, a digital agency with deep roots in traditional direct response marketing, creates advantage for our clients by combining decades of direct to consumer marketing experience, time-tested direct response principles and proven online best practices. Over the last ten years, we’ve seamlessly taken these elements and created the Fosina Formula. Simple in concept, multifaceted in design – we simultaneously take the Right Offer, Engaging Creative, Focused Media and Protective Technology and create success for our clients by finding and keeping their best customers. Marketing Coordinator FYI Direct: FreeScore.com, IdentityHawk.com, DebtPlan.com May 2011  –  May 2012  (1 year 1 month) Norwalk, CT -Launched, maintained daily relationships and grew numerous online partners including, but not limited to, Yahoo, Zillow, WeatherBug and Weather.com \n-Led the mobile marketing strategy in 2012; expanded mobile advertisements to new partners and assisted in the design of mobile landing pages \n-Presented various marketing ideas and strategies to upper management to ensure campaign growth and stability \n-Coordinated with creative, product, legal to ensure all online materials were implemented properly \n-Increased and surpassed sales volume on individual account properties by 40% in Q1 2012 Marketing Coordinator FYI Direct: FreeScore.com, IdentityHawk.com, DebtPlan.com May 2011  –  May 2012  (1 year 1 month) Norwalk, CT -Launched, maintained daily relationships and grew numerous online partners including, but not limited to, Yahoo, Zillow, WeatherBug and Weather.com \n-Led the mobile marketing strategy in 2012; expanded mobile advertisements to new partners and assisted in the design of mobile landing pages \n-Presented various marketing ideas and strategies to upper management to ensure campaign growth and stability \n-Coordinated with creative, product, legal to ensure all online materials were implemented properly \n-Increased and surpassed sales volume on individual account properties by 40% in Q1 2012 Languages English English English Skills Social Media Marketing Email Marketing Online Marketing Online Advertising Advertising Display Advertising Marketing Interactive Marketing SEO Social Media Digital Marketing Cost Per Acquisition Digital Media Facebook Marketing Strategy PowerPoint Excel Cost Per Lead Affiliate Management Microsoft Excel Banner Ads Direct Response See 7+     See less Skills  Social Media Marketing Email Marketing Online Marketing Online Advertising Advertising Display Advertising Marketing Interactive Marketing SEO Social Media Digital Marketing Cost Per Acquisition Digital Media Facebook Marketing Strategy PowerPoint Excel Cost Per Lead Affiliate Management Microsoft Excel Banner Ads Direct Response See 7+     See less Social Media Marketing Email Marketing Online Marketing Online Advertising Advertising Display Advertising Marketing Interactive Marketing SEO Social Media Digital Marketing Cost Per Acquisition Digital Media Facebook Marketing Strategy PowerPoint Excel Cost Per Lead Affiliate Management Microsoft Excel Banner Ads Direct Response See 7+     See less Social Media Marketing Email Marketing Online Marketing Online Advertising Advertising Display Advertising Marketing Interactive Marketing SEO Social Media Digital Marketing Cost Per Acquisition Digital Media Facebook Marketing Strategy PowerPoint Excel Cost Per Lead Affiliate Management Microsoft Excel Banner Ads Direct Response See 7+     See less Education Western Connecticut State University Bachelor of Business Administration (B.B.A.),  Interactive and Direct Marketing 2007  – 2011 Activities and Societies:  Alpha Mu Alpha Western Connecticut State University Bachelor of Business Administration (B.B.A.),  Interactive and Direct Marketing 2007  – 2011 Activities and Societies:  Alpha Mu Alpha Western Connecticut State University Bachelor of Business Administration (B.B.A.),  Interactive and Direct Marketing 2007  – 2011 Activities and Societies:  Alpha Mu Alpha Western Connecticut State University Bachelor of Business Administration (B.B.A.),  Interactive and Direct Marketing 2007  – 2011 Activities and Societies:  Alpha Mu Alpha Honors & Awards Additional Honors & Awards Deans List Western Connecticut State University, Spring 2010 \nDeans List Western Connecticut State University, Fall 2010 \nCertificate of Recognition, Greater Danbury Nonprofit Resource Center, December 1, 2010 Additional Honors & Awards Deans List Western Connecticut State University, Spring 2010 \nDeans List Western Connecticut State University, Fall 2010 \nCertificate of Recognition, Greater Danbury Nonprofit Resource Center, December 1, 2010 Additional Honors & Awards Deans List Western Connecticut State University, Spring 2010 \nDeans List Western Connecticut State University, Fall 2010 \nCertificate of Recognition, Greater Danbury Nonprofit Resource Center, December 1, 2010 Additional Honors & Awards Deans List Western Connecticut State University, Spring 2010 \nDeans List Western Connecticut State University, Fall 2010 \nCertificate of Recognition, Greater Danbury Nonprofit Resource Center, December 1, 2010 ", "Summary Senior Marketeer with 15+ years of experience creating digitally focused, integrated, brand driven, human centric experiences in an global setting. Thrive connecting the dots between people, brands and technology. \n \nIn the toolbox: Curiosity, Digital Marketing, Integrated Marketing (Paid / Owned / Earned), Content Marketing, Relentless Learner, Digital Transformation, Speaker, Dataholic, Social, Search Engine Marketing (SEM), E-Mail Marketing, Marketing Automation, CRM, Advertising, Media, Lead / Demand Generation, Experience Design, Creative Direction, UX, Graphic Design. Summary Senior Marketeer with 15+ years of experience creating digitally focused, integrated, brand driven, human centric experiences in an global setting. Thrive connecting the dots between people, brands and technology. \n \nIn the toolbox: Curiosity, Digital Marketing, Integrated Marketing (Paid / Owned / Earned), Content Marketing, Relentless Learner, Digital Transformation, Speaker, Dataholic, Social, Search Engine Marketing (SEM), E-Mail Marketing, Marketing Automation, CRM, Advertising, Media, Lead / Demand Generation, Experience Design, Creative Direction, UX, Graphic Design. Senior Marketeer with 15+ years of experience creating digitally focused, integrated, brand driven, human centric experiences in an global setting. Thrive connecting the dots between people, brands and technology. \n \nIn the toolbox: Curiosity, Digital Marketing, Integrated Marketing (Paid / Owned / Earned), Content Marketing, Relentless Learner, Digital Transformation, Speaker, Dataholic, Social, Search Engine Marketing (SEM), E-Mail Marketing, Marketing Automation, CRM, Advertising, Media, Lead / Demand Generation, Experience Design, Creative Direction, UX, Graphic Design. Senior Marketeer with 15+ years of experience creating digitally focused, integrated, brand driven, human centric experiences in an global setting. Thrive connecting the dots between people, brands and technology. \n \nIn the toolbox: Curiosity, Digital Marketing, Integrated Marketing (Paid / Owned / Earned), Content Marketing, Relentless Learner, Digital Transformation, Speaker, Dataholic, Social, Search Engine Marketing (SEM), E-Mail Marketing, Marketing Automation, CRM, Advertising, Media, Lead / Demand Generation, Experience Design, Creative Direction, UX, Graphic Design. Experience Global Digital Marketing Manager Husqvarna Group June 2015  – Present (3 months) Stockholm, Sweden European Digital Strategist IBM April 2015  –  May 2015  (2 months) Stockholm, Sweden Senior Digital Leader - Marketing, Communications and Citizenship IBM March 2014  –  April 2015  (1 year 2 months) Stockholm, Sweden Nordic Digital Marketing Strategist IBM February 2012  –  February 2014  (2 years 1 month) Stockholm, Sweden Digital Marketing Manager IBM May 2011  –  January 2012  (9 months) Stockholm, Sweden Chairman - Joint Industry Committee for Search Marketing Association of Swedish Advertisers February 2010  –  January 2012  (2 years) Stockholm, Sweden Digital Communication Manager Poolia AB August 2008  –  May 2011  (2 years 10 months) Stockholm, Sweden Digital Brand and Marketing Consultant Self Employed January 2000  –  August 2008  (8 years 8 months) Miami/Fort Lauderdale Area Project Manager Online Brand Communication – Europe Electrolux January 2006  –  December 2007  (2 years) Stockholm, Sweden Marketing Manager Callenberg Engineering, Inc. January 2003  –  March 2005  (2 years 3 months) Miami/Fort Lauderdale Area Co-Founder and VP Design Visual Image February 1995  –  December 1999  (4 years 11 months) Miami/Fort Lauderdale Area Global Digital Marketing Manager Husqvarna Group June 2015  – Present (3 months) Stockholm, Sweden Global Digital Marketing Manager Husqvarna Group June 2015  – Present (3 months) Stockholm, Sweden European Digital Strategist IBM April 2015  –  May 2015  (2 months) Stockholm, Sweden European Digital Strategist IBM April 2015  –  May 2015  (2 months) Stockholm, Sweden Senior Digital Leader - Marketing, Communications and Citizenship IBM March 2014  –  April 2015  (1 year 2 months) Stockholm, Sweden Senior Digital Leader - Marketing, Communications and Citizenship IBM March 2014  –  April 2015  (1 year 2 months) Stockholm, Sweden Nordic Digital Marketing Strategist IBM February 2012  –  February 2014  (2 years 1 month) Stockholm, Sweden Nordic Digital Marketing Strategist IBM February 2012  –  February 2014  (2 years 1 month) Stockholm, Sweden Digital Marketing Manager IBM May 2011  –  January 2012  (9 months) Stockholm, Sweden Digital Marketing Manager IBM May 2011  –  January 2012  (9 months) Stockholm, Sweden Chairman - Joint Industry Committee for Search Marketing Association of Swedish Advertisers February 2010  –  January 2012  (2 years) Stockholm, Sweden Chairman - Joint Industry Committee for Search Marketing Association of Swedish Advertisers February 2010  –  January 2012  (2 years) Stockholm, Sweden Digital Communication Manager Poolia AB August 2008  –  May 2011  (2 years 10 months) Stockholm, Sweden Digital Communication Manager Poolia AB August 2008  –  May 2011  (2 years 10 months) Stockholm, Sweden Digital Brand and Marketing Consultant Self Employed January 2000  –  August 2008  (8 years 8 months) Miami/Fort Lauderdale Area Digital Brand and Marketing Consultant Self Employed January 2000  –  August 2008  (8 years 8 months) Miami/Fort Lauderdale Area Project Manager Online Brand Communication – Europe Electrolux January 2006  –  December 2007  (2 years) Stockholm, Sweden Project Manager Online Brand Communication – Europe Electrolux January 2006  –  December 2007  (2 years) Stockholm, Sweden Marketing Manager Callenberg Engineering, Inc. January 2003  –  March 2005  (2 years 3 months) Miami/Fort Lauderdale Area Marketing Manager Callenberg Engineering, Inc. January 2003  –  March 2005  (2 years 3 months) Miami/Fort Lauderdale Area Co-Founder and VP Design Visual Image February 1995  –  December 1999  (4 years 11 months) Miami/Fort Lauderdale Area Co-Founder and VP Design Visual Image February 1995  –  December 1999  (4 years 11 months) Miami/Fort Lauderdale Area Languages   Skills Digital Marketing Digital Strategy Integrated Marketing SEM Online Marketing Social Media Marketing B2B Marketing Online Advertising Marketing Strategy Marketing Communications Creative Direction SEO Marketing Analytics CRM Brand Development Product Marketing Social Media Marketing Management Social CRM Digital Media Web Content Management Strategy B2B Strategic Communications Web Analytics Google Analytics Email Marketing Digital Branding Marketing Interaction Design User Experience Management Graphic Design Content Marketing Inbound Marketing Mobile Marketing Art Direction International Marketing Social Business Advertising Analytics See 26+     See less Skills  Digital Marketing Digital Strategy Integrated Marketing SEM Online Marketing Social Media Marketing B2B Marketing Online Advertising Marketing Strategy Marketing Communications Creative Direction SEO Marketing Analytics CRM Brand Development Product Marketing Social Media Marketing Management Social CRM Digital Media Web Content Management Strategy B2B Strategic Communications Web Analytics Google Analytics Email Marketing Digital Branding Marketing Interaction Design User Experience Management Graphic Design Content Marketing Inbound Marketing Mobile Marketing Art Direction International Marketing Social Business Advertising Analytics See 26+     See less Digital Marketing Digital Strategy Integrated Marketing SEM Online Marketing Social Media Marketing B2B Marketing Online Advertising Marketing Strategy Marketing Communications Creative Direction SEO Marketing Analytics CRM Brand Development Product Marketing Social Media Marketing Management Social CRM Digital Media Web Content Management Strategy B2B Strategic Communications Web Analytics Google Analytics Email Marketing Digital Branding Marketing Interaction Design User Experience Management Graphic Design Content Marketing Inbound Marketing Mobile Marketing Art Direction International Marketing Social Business Advertising Analytics See 26+     See less Digital Marketing Digital Strategy Integrated Marketing SEM Online Marketing Social Media Marketing B2B Marketing Online Advertising Marketing Strategy Marketing Communications Creative Direction SEO Marketing Analytics CRM Brand Development Product Marketing Social Media Marketing Management Social CRM Digital Media Web Content Management Strategy B2B Strategic Communications Web Analytics Google Analytics Email Marketing Digital Branding Marketing Interaction Design User Experience Management Graphic Design Content Marketing Inbound Marketing Mobile Marketing Art Direction International Marketing Social Business Advertising Analytics See 26+     See less Education Art Institute of Fort Lauderdale Bachelor of Science 2000  – 2002 Art Institute of Fort Lauderdale Associate of Science June 1995  – June 1997 Art Institute of Fort Lauderdale Bachelor of Science 2000  – 2002 Art Institute of Fort Lauderdale Bachelor of Science 2000  – 2002 Art Institute of Fort Lauderdale Bachelor of Science 2000  – 2002 Art Institute of Fort Lauderdale Associate of Science June 1995  – June 1997 Art Institute of Fort Lauderdale Associate of Science June 1995  – June 1997 Art Institute of Fort Lauderdale Associate of Science June 1995  – June 1997 Honors & Awards ", "Summary An all round web aficionado who is always looking to work on exciting projects with clients. I see technology as a way of facilitating and improving communication between users, understanding that people come before technology. \n \nExperienced at HTML5, CSS3, Responsive Design, JavaScript, PHP (Laravel), MySQL, Web Analytics, and more. \n \nMy portflio site: http://www.robotnikux.com Summary An all round web aficionado who is always looking to work on exciting projects with clients. I see technology as a way of facilitating and improving communication between users, understanding that people come before technology. \n \nExperienced at HTML5, CSS3, Responsive Design, JavaScript, PHP (Laravel), MySQL, Web Analytics, and more. \n \nMy portflio site: http://www.robotnikux.com An all round web aficionado who is always looking to work on exciting projects with clients. I see technology as a way of facilitating and improving communication between users, understanding that people come before technology. \n \nExperienced at HTML5, CSS3, Responsive Design, JavaScript, PHP (Laravel), MySQL, Web Analytics, and more. \n \nMy portflio site: http://www.robotnikux.com An all round web aficionado who is always looking to work on exciting projects with clients. I see technology as a way of facilitating and improving communication between users, understanding that people come before technology. \n \nExperienced at HTML5, CSS3, Responsive Design, JavaScript, PHP (Laravel), MySQL, Web Analytics, and more. \n \nMy portflio site: http://www.robotnikux.com Experience Digital Strategist IBM June 2014  – Present (1 year 3 months) Visiting Instructor Oakland University May 2012  – Present (3 years 4 months) Rochester, Michigan User Interface Designer / HMI Modeler Ford Motor Company August 2013  –  June 2014  (11 months) Dearborn, Michigan Web Strategist IBM October 2012  –  July 2013  (10 months) Systems Engineer IBM August 2011  –  October 2012  (1 year 3 months) Southfield, Michigan Web Analyst IBM February 2011  –  August 2011  (7 months) Data Analyst Improvement Path Systems August 2009  –  December 2010  (1 year 5 months) Consultant IBM June 2006  –  August 2009  (3 years 3 months) Digital Strategist IBM June 2014  – Present (1 year 3 months) Digital Strategist IBM June 2014  – Present (1 year 3 months) Visiting Instructor Oakland University May 2012  – Present (3 years 4 months) Rochester, Michigan Visiting Instructor Oakland University May 2012  – Present (3 years 4 months) Rochester, Michigan User Interface Designer / HMI Modeler Ford Motor Company August 2013  –  June 2014  (11 months) Dearborn, Michigan User Interface Designer / HMI Modeler Ford Motor Company August 2013  –  June 2014  (11 months) Dearborn, Michigan Web Strategist IBM October 2012  –  July 2013  (10 months) Web Strategist IBM October 2012  –  July 2013  (10 months) Systems Engineer IBM August 2011  –  October 2012  (1 year 3 months) Southfield, Michigan Systems Engineer IBM August 2011  –  October 2012  (1 year 3 months) Southfield, Michigan Web Analyst IBM February 2011  –  August 2011  (7 months) Web Analyst IBM February 2011  –  August 2011  (7 months) Data Analyst Improvement Path Systems August 2009  –  December 2010  (1 year 5 months) Data Analyst Improvement Path Systems August 2009  –  December 2010  (1 year 5 months) Consultant IBM June 2006  –  August 2009  (3 years 3 months) Consultant IBM June 2006  –  August 2009  (3 years 3 months) Skills User Interface Design PHP SQL Web Design Web Analytics Website Development Graphic Design Unica SharePoint Designer XHTML Data Analysis Data Visualization AJAX JavaScript CSS Microsoft Office Agile Methodologies Adobe Creative Suite Compliance IT Audit Databases Excel models User-centered Design Python Wire Framing Enterprise Architecture Project Management See 12+     See less Skills  User Interface Design PHP SQL Web Design Web Analytics Website Development Graphic Design Unica SharePoint Designer XHTML Data Analysis Data Visualization AJAX JavaScript CSS Microsoft Office Agile Methodologies Adobe Creative Suite Compliance IT Audit Databases Excel models User-centered Design Python Wire Framing Enterprise Architecture Project Management See 12+     See less User Interface Design PHP SQL Web Design Web Analytics Website Development Graphic Design Unica SharePoint Designer XHTML Data Analysis Data Visualization AJAX JavaScript CSS Microsoft Office Agile Methodologies Adobe Creative Suite Compliance IT Audit Databases Excel models User-centered Design Python Wire Framing Enterprise Architecture Project Management See 12+     See less User Interface Design PHP SQL Web Design Web Analytics Website Development Graphic Design Unica SharePoint Designer XHTML Data Analysis Data Visualization AJAX JavaScript CSS Microsoft Office Agile Methodologies Adobe Creative Suite Compliance IT Audit Databases Excel models User-centered Design Python Wire Framing Enterprise Architecture Project Management See 12+     See less Honors & Awards ", "Experience Digital Strategist IBM India Pvt Ltd. July 2010  – Present (5 years 2 months) Leading & Driving Digital Strategist’s Team to achieve business goals. Develop and implement the digital strategy to maximize demand and ensure the highest effectiveness for the Business Unit's digital presence and integrate social media as part of digital campaigns to increase presence in the marketplace. Web Analyst AOL March 2008  –  July 2010  (2 years 5 months) Support the analytic needs of a business unit (AOL European Team) by web measurement & strategic customer analysis using tools like Omniture - Sitecatalyst & Discover and Provides analytics and insights across all paid, owned and earned channels. SEO Architect Havas Worldwide Digital Matrix ( formerly Known as : Natural Search Internet Solutions Pvt. Ltd.) October 2004  –  February 2008  (3 years 5 months) Managing all aspects of day to day SEO strategy for internal & external websites. Analyze, review and implement changes to websites by optimizing for search engines to improve search visibility & traffic to a site. Digital Strategist IBM India Pvt Ltd. July 2010  – Present (5 years 2 months) Leading & Driving Digital Strategist’s Team to achieve business goals. Develop and implement the digital strategy to maximize demand and ensure the highest effectiveness for the Business Unit's digital presence and integrate social media as part of digital campaigns to increase presence in the marketplace. Digital Strategist IBM India Pvt Ltd. July 2010  – Present (5 years 2 months) Leading & Driving Digital Strategist’s Team to achieve business goals. Develop and implement the digital strategy to maximize demand and ensure the highest effectiveness for the Business Unit's digital presence and integrate social media as part of digital campaigns to increase presence in the marketplace. Web Analyst AOL March 2008  –  July 2010  (2 years 5 months) Support the analytic needs of a business unit (AOL European Team) by web measurement & strategic customer analysis using tools like Omniture - Sitecatalyst & Discover and Provides analytics and insights across all paid, owned and earned channels. Web Analyst AOL March 2008  –  July 2010  (2 years 5 months) Support the analytic needs of a business unit (AOL European Team) by web measurement & strategic customer analysis using tools like Omniture - Sitecatalyst & Discover and Provides analytics and insights across all paid, owned and earned channels. SEO Architect Havas Worldwide Digital Matrix ( formerly Known as : Natural Search Internet Solutions Pvt. Ltd.) October 2004  –  February 2008  (3 years 5 months) Managing all aspects of day to day SEO strategy for internal & external websites. Analyze, review and implement changes to websites by optimizing for search engines to improve search visibility & traffic to a site. SEO Architect Havas Worldwide Digital Matrix ( formerly Known as : Natural Search Internet Solutions Pvt. Ltd.) October 2004  –  February 2008  (3 years 5 months) Managing all aspects of day to day SEO strategy for internal & external websites. Analyze, review and implement changes to websites by optimizing for search engines to improve search visibility & traffic to a site. Skills E-commerce Web Analytics SEM Analytics PPC Google Adwords SEO Online Advertising Web Marketing Digital Strategy Omniture JavaScript Digital Marketing Google Analytics Marketing Content Management Landing Page... Lead Generation Affiliate Marketing Online Marketing See 5+     See less Skills  E-commerce Web Analytics SEM Analytics PPC Google Adwords SEO Online Advertising Web Marketing Digital Strategy Omniture JavaScript Digital Marketing Google Analytics Marketing Content Management Landing Page... Lead Generation Affiliate Marketing Online Marketing See 5+     See less E-commerce Web Analytics SEM Analytics PPC Google Adwords SEO Online Advertising Web Marketing Digital Strategy Omniture JavaScript Digital Marketing Google Analytics Marketing Content Management Landing Page... Lead Generation Affiliate Marketing Online Marketing See 5+     See less E-commerce Web Analytics SEM Analytics PPC Google Adwords SEO Online Advertising Web Marketing Digital Strategy Omniture JavaScript Digital Marketing Google Analytics Marketing Content Management Landing Page... Lead Generation Affiliate Marketing Online Marketing See 5+     See less Education Bangalore University B.Sc.,  Economics ,  Maths ,  Statistics 1992  – 1995 Sikkim Manipal University - Distance Education Master of Business Administration (M.B.A.),  Marketing Bangalore University B.Sc.,  Economics ,  Maths ,  Statistics 1992  – 1995 Bangalore University B.Sc.,  Economics ,  Maths ,  Statistics 1992  – 1995 Bangalore University B.Sc.,  Economics ,  Maths ,  Statistics 1992  – 1995 Sikkim Manipal University - Distance Education Master of Business Administration (M.B.A.),  Marketing Sikkim Manipal University - Distance Education Master of Business Administration (M.B.A.),  Marketing Sikkim Manipal University - Distance Education Master of Business Administration (M.B.A.),  Marketing ", "Experience Performance Marketing - Digital Strategist, IBM Systems IBM Canada Ltd. April 2015  – Present (5 months) Markham, Ontario Demand Programs Professional, IBM Canada C-Suite IBM Canada Ltd. April 2011  – Present (4 years 5 months) Markham, ON - End to end responsibility for program planning through to execution \n- Owns and manages agency and vendor relationships in support of the integrated program plan \n- Creates a 360-degree marketing plan using the most relevant organic and active marketing routes to market for product/solution offerings \n- Manages the program budget to an expected ROI, and achieve/exceed the program objectives Demand Programs Professional, IBM Canada Collaboration Solutions IBM Canada Ltd. August 2010  –  April 2011  (9 months) Markham, ON - Assisted in the end to end responsibility for the program \nplanning through to execution. \n- Program tactics included: proprietary and non-proprietary events, social media & digital, and telemarketing Events Team Lead / Senior Marketing Event Manager IBM Canada Ltd. August 2007  –  August 2010  (3 years 1 month) - Coordination, planning, and execution of over 250 proprietary and non-proprietary software events nationwide \n- Lead the sales and marketing teams during the event planning process \n- Assisted in implementing best practices, new ideas and training of new staff \n- Held overall responsibility for venue sourcing and recommendations, ordering of food & beverage along with audio visual requirements, sourcing and securing of event entertainment, sourcing and ordering of promotional items, managing event speakers.  \n- Responsible for organizing weekly checkpoints, creating the call agenda and managing meeting minutes \n- Responsible for end-to-end event budget management  \n- For all third party events I worked with IBM Procurement and various external vendors to negotiate IBM’s participation \n- Worked closely with IBM's internal graphic designers to develop event invitations, evaluations, and other event signage Performance Marketing - Digital Strategist, IBM Systems IBM Canada Ltd. April 2015  – Present (5 months) Markham, Ontario Performance Marketing - Digital Strategist, IBM Systems IBM Canada Ltd. April 2015  – Present (5 months) Markham, Ontario Demand Programs Professional, IBM Canada C-Suite IBM Canada Ltd. April 2011  – Present (4 years 5 months) Markham, ON - End to end responsibility for program planning through to execution \n- Owns and manages agency and vendor relationships in support of the integrated program plan \n- Creates a 360-degree marketing plan using the most relevant organic and active marketing routes to market for product/solution offerings \n- Manages the program budget to an expected ROI, and achieve/exceed the program objectives Demand Programs Professional, IBM Canada C-Suite IBM Canada Ltd. April 2011  – Present (4 years 5 months) Markham, ON - End to end responsibility for program planning through to execution \n- Owns and manages agency and vendor relationships in support of the integrated program plan \n- Creates a 360-degree marketing plan using the most relevant organic and active marketing routes to market for product/solution offerings \n- Manages the program budget to an expected ROI, and achieve/exceed the program objectives Demand Programs Professional, IBM Canada Collaboration Solutions IBM Canada Ltd. August 2010  –  April 2011  (9 months) Markham, ON - Assisted in the end to end responsibility for the program \nplanning through to execution. \n- Program tactics included: proprietary and non-proprietary events, social media & digital, and telemarketing Demand Programs Professional, IBM Canada Collaboration Solutions IBM Canada Ltd. August 2010  –  April 2011  (9 months) Markham, ON - Assisted in the end to end responsibility for the program \nplanning through to execution. \n- Program tactics included: proprietary and non-proprietary events, social media & digital, and telemarketing Events Team Lead / Senior Marketing Event Manager IBM Canada Ltd. August 2007  –  August 2010  (3 years 1 month) - Coordination, planning, and execution of over 250 proprietary and non-proprietary software events nationwide \n- Lead the sales and marketing teams during the event planning process \n- Assisted in implementing best practices, new ideas and training of new staff \n- Held overall responsibility for venue sourcing and recommendations, ordering of food & beverage along with audio visual requirements, sourcing and securing of event entertainment, sourcing and ordering of promotional items, managing event speakers.  \n- Responsible for organizing weekly checkpoints, creating the call agenda and managing meeting minutes \n- Responsible for end-to-end event budget management  \n- For all third party events I worked with IBM Procurement and various external vendors to negotiate IBM’s participation \n- Worked closely with IBM's internal graphic designers to develop event invitations, evaluations, and other event signage Events Team Lead / Senior Marketing Event Manager IBM Canada Ltd. August 2007  –  August 2010  (3 years 1 month) - Coordination, planning, and execution of over 250 proprietary and non-proprietary software events nationwide \n- Lead the sales and marketing teams during the event planning process \n- Assisted in implementing best practices, new ideas and training of new staff \n- Held overall responsibility for venue sourcing and recommendations, ordering of food & beverage along with audio visual requirements, sourcing and securing of event entertainment, sourcing and ordering of promotional items, managing event speakers.  \n- Responsible for organizing weekly checkpoints, creating the call agenda and managing meeting minutes \n- Responsible for end-to-end event budget management  \n- For all third party events I worked with IBM Procurement and various external vendors to negotiate IBM’s participation \n- Worked closely with IBM's internal graphic designers to develop event invitations, evaluations, and other event signage Skills Event Management Program Budgeting Demand Generation Project Management Integrated Marketing Unica Affinium Campaign Marketing Management Go-to-market Strategy Social Media Budgets Event Planning Training Market Planning Marketing Communications Project Planning Social Media Marketing Marketing Strategy Marketing See 3+     See less Skills  Event Management Program Budgeting Demand Generation Project Management Integrated Marketing Unica Affinium Campaign Marketing Management Go-to-market Strategy Social Media Budgets Event Planning Training Market Planning Marketing Communications Project Planning Social Media Marketing Marketing Strategy Marketing See 3+     See less Event Management Program Budgeting Demand Generation Project Management Integrated Marketing Unica Affinium Campaign Marketing Management Go-to-market Strategy Social Media Budgets Event Planning Training Market Planning Marketing Communications Project Planning Social Media Marketing Marketing Strategy Marketing See 3+     See less Event Management Program Budgeting Demand Generation Project Management Integrated Marketing Unica Affinium Campaign Marketing Management Go-to-market Strategy Social Media Budgets Event Planning Training Market Planning Marketing Communications Project Planning Social Media Marketing Marketing Strategy Marketing See 3+     See less Education Ryerson University Event Management Certificate,  Event Management, Coordination, and Planning 2009  – 2010 Activities and Societies:  Related Course Work: Meetings and Conferences ,  Event Coordination ,  Event Marketing ,  Risk Management ,  Best Practices in Event Management ,  Starting ,  Growing and Managing an Event Business ,  Wedding Planning ,  Coordination and Consulting. Saint Lawrence College Diploma: Advertising - Integrated Marketing Communications,  Advertising and Marketing 2004  – 2007 Activities and Societies:  Related Course Work:\nEvent Marketing ,  Public Relations ,  Advertising and Sales Promotion ,  Customer Relationship Management ,  Entrepreneurship & Venture Development ,  Media Planning & Buying ,  Media Sales ,  Marketing Principals ,  Copywriting and Design for Print Media ,  Video Production & Multimedia ,  Consumer and Marketing Behaviour. Ryerson University Event Management Certificate,  Event Management, Coordination, and Planning 2009  – 2010 Activities and Societies:  Related Course Work: Meetings and Conferences ,  Event Coordination ,  Event Marketing ,  Risk Management ,  Best Practices in Event Management ,  Starting ,  Growing and Managing an Event Business ,  Wedding Planning ,  Coordination and Consulting. Ryerson University Event Management Certificate,  Event Management, Coordination, and Planning 2009  – 2010 Activities and Societies:  Related Course Work: Meetings and Conferences ,  Event Coordination ,  Event Marketing ,  Risk Management ,  Best Practices in Event Management ,  Starting ,  Growing and Managing an Event Business ,  Wedding Planning ,  Coordination and Consulting. Ryerson University Event Management Certificate,  Event Management, Coordination, and Planning 2009  – 2010 Activities and Societies:  Related Course Work: Meetings and Conferences ,  Event Coordination ,  Event Marketing ,  Risk Management ,  Best Practices in Event Management ,  Starting ,  Growing and Managing an Event Business ,  Wedding Planning ,  Coordination and Consulting. Saint Lawrence College Diploma: Advertising - Integrated Marketing Communications,  Advertising and Marketing 2004  – 2007 Activities and Societies:  Related Course Work:\nEvent Marketing ,  Public Relations ,  Advertising and Sales Promotion ,  Customer Relationship Management ,  Entrepreneurship & Venture Development ,  Media Planning & Buying ,  Media Sales ,  Marketing Principals ,  Copywriting and Design for Print Media ,  Video Production & Multimedia ,  Consumer and Marketing Behaviour. Saint Lawrence College Diploma: Advertising - Integrated Marketing Communications,  Advertising and Marketing 2004  – 2007 Activities and Societies:  Related Course Work:\nEvent Marketing ,  Public Relations ,  Advertising and Sales Promotion ,  Customer Relationship Management ,  Entrepreneurship & Venture Development ,  Media Planning & Buying ,  Media Sales ,  Marketing Principals ,  Copywriting and Design for Print Media ,  Video Production & Multimedia ,  Consumer and Marketing Behaviour. Saint Lawrence College Diploma: Advertising - Integrated Marketing Communications,  Advertising and Marketing 2004  – 2007 Activities and Societies:  Related Course Work:\nEvent Marketing ,  Public Relations ,  Advertising and Sales Promotion ,  Customer Relationship Management ,  Entrepreneurship & Venture Development ,  Media Planning & Buying ,  Media Sales ,  Marketing Principals ,  Copywriting and Design for Print Media ,  Video Production & Multimedia ,  Consumer and Marketing Behaviour. ", "Summary Digital Strategist for IBM Interactive Experience in New York. Previously, a Strategy Consultant in the Consumer Products practice at IBM's London office.  \n \nI have recently published a book about my grandfather’s extradition and life in Siberia during WWII. \n \nGlobal project experience: United Kingdom, US, Norway, Sweden, Poland, Canada, Switzerland, Netherlands, Brazil Summary Digital Strategist for IBM Interactive Experience in New York. Previously, a Strategy Consultant in the Consumer Products practice at IBM's London office.  \n \nI have recently published a book about my grandfather’s extradition and life in Siberia during WWII. \n \nGlobal project experience: United Kingdom, US, Norway, Sweden, Poland, Canada, Switzerland, Netherlands, Brazil Digital Strategist for IBM Interactive Experience in New York. Previously, a Strategy Consultant in the Consumer Products practice at IBM's London office.  \n \nI have recently published a book about my grandfather’s extradition and life in Siberia during WWII. \n \nGlobal project experience: United Kingdom, US, Norway, Sweden, Poland, Canada, Switzerland, Netherlands, Brazil Digital Strategist for IBM Interactive Experience in New York. Previously, a Strategy Consultant in the Consumer Products practice at IBM's London office.  \n \nI have recently published a book about my grandfather’s extradition and life in Siberia during WWII. \n \nGlobal project experience: United Kingdom, US, Norway, Sweden, Poland, Canada, Switzerland, Netherlands, Brazil Experience Digital Strategist IBM Interactive Experience June 2015  – Present (3 months) Greater New York City Area We think bigger than an agency and more creatively than a consultancy and we have the power to integrate the whole system. Senior Strategy & Analytics Consultant IBM July 2012  –  June 2015  (3 years) London, United Kingdom IBM Global Business Services \n \nIndustries: \n- Consumer Products (Food, Beverages and Tobacco) \n- Industrial sector (O&G, Automotive, Machinery, Industrial Products) \n \nProjects; \n- Fragrances Business (Netherlands) – Managing 9 client teams of 5-10 client team members each from Asia, Latam, North America and Europe to develop a New Product Development tool \n- Tobacco Company (London, UK) - Analysis of the company’s tobacco manufacturing process in developing markets, development of a global solution for tobacco manufacturing  \n- IBM Institute for Business Value (New York, US) – Study on consumer behaviour and trends in the FMCG market \n- Industrial Products (Sweden) – Workstream lead for the definition of an operating model for Supply Chain for a company with operations in >130 countries \n- High-End Engineering (UK) – Lead business analyst, strategy formulation & implementation, identification of acquisition targets, and go-to-market proposition resulting in a ~30% YoY revenue growth over 5 years \n- Non-Alcoholic Beverages (Switzerland) - Headcount analysis resulting in a reduction of 5% of total operations costs across Europe ($9m) \n- Consumer Products (UK/Canada) - Project Manager; end-to-end solutioning and technical due-diligence of a breakthrough mobile application for Diabetics \n- Cruise Liner (UK/Norway) - Definition of the company's customer engagement strategy to improve customer service satisfaction and broaden product portfolio & offerings \n \nAreas of Focus: \n- Process redesign & corporate strategy development  \n- Commercial due diligence & M&A strategies \n- Digital & Mobile strategy for healthcare \n- Organizational restructuring \n- New Product Development & market entry Academic Research Norwegian Business School November 2010  –  May 2011  (7 months) Oslo Area, Norway – Research on the Norwegian Oil and Energy industries \n– Analysis of financing structures, R&D expenditures, labour mobility, market size \n– Economic and statistical modeling Co-founder & Developer Sleep in Warsaw / ProSpace August 2009  –  February 2011  (1 year 7 months) Warsaw Area, Poland Co-founding and managing a real-estate renting service Business Analyst Cicero Consulting September 2007  –  October 2009  (2 years 2 months) Oslo Area, Norway - Consumer Finance industry \n- Research on the Eastern European banking and financial services sector \n- Creating a database of >1000 financial products  \n- Collecting information on credit, debit, charge and prepaid cards Website coordinator and database management Scandinavian-Polish Chamber of Commerce September 2005  –  May 2006  (9 months) Warsaw Area, Poland Digital Strategist IBM Interactive Experience June 2015  – Present (3 months) Greater New York City Area We think bigger than an agency and more creatively than a consultancy and we have the power to integrate the whole system. Digital Strategist IBM Interactive Experience June 2015  – Present (3 months) Greater New York City Area We think bigger than an agency and more creatively than a consultancy and we have the power to integrate the whole system. Senior Strategy & Analytics Consultant IBM July 2012  –  June 2015  (3 years) London, United Kingdom IBM Global Business Services \n \nIndustries: \n- Consumer Products (Food, Beverages and Tobacco) \n- Industrial sector (O&G, Automotive, Machinery, Industrial Products) \n \nProjects; \n- Fragrances Business (Netherlands) – Managing 9 client teams of 5-10 client team members each from Asia, Latam, North America and Europe to develop a New Product Development tool \n- Tobacco Company (London, UK) - Analysis of the company’s tobacco manufacturing process in developing markets, development of a global solution for tobacco manufacturing  \n- IBM Institute for Business Value (New York, US) – Study on consumer behaviour and trends in the FMCG market \n- Industrial Products (Sweden) – Workstream lead for the definition of an operating model for Supply Chain for a company with operations in >130 countries \n- High-End Engineering (UK) – Lead business analyst, strategy formulation & implementation, identification of acquisition targets, and go-to-market proposition resulting in a ~30% YoY revenue growth over 5 years \n- Non-Alcoholic Beverages (Switzerland) - Headcount analysis resulting in a reduction of 5% of total operations costs across Europe ($9m) \n- Consumer Products (UK/Canada) - Project Manager; end-to-end solutioning and technical due-diligence of a breakthrough mobile application for Diabetics \n- Cruise Liner (UK/Norway) - Definition of the company's customer engagement strategy to improve customer service satisfaction and broaden product portfolio & offerings \n \nAreas of Focus: \n- Process redesign & corporate strategy development  \n- Commercial due diligence & M&A strategies \n- Digital & Mobile strategy for healthcare \n- Organizational restructuring \n- New Product Development & market entry Senior Strategy & Analytics Consultant IBM July 2012  –  June 2015  (3 years) London, United Kingdom IBM Global Business Services \n \nIndustries: \n- Consumer Products (Food, Beverages and Tobacco) \n- Industrial sector (O&G, Automotive, Machinery, Industrial Products) \n \nProjects; \n- Fragrances Business (Netherlands) – Managing 9 client teams of 5-10 client team members each from Asia, Latam, North America and Europe to develop a New Product Development tool \n- Tobacco Company (London, UK) - Analysis of the company’s tobacco manufacturing process in developing markets, development of a global solution for tobacco manufacturing  \n- IBM Institute for Business Value (New York, US) – Study on consumer behaviour and trends in the FMCG market \n- Industrial Products (Sweden) – Workstream lead for the definition of an operating model for Supply Chain for a company with operations in >130 countries \n- High-End Engineering (UK) – Lead business analyst, strategy formulation & implementation, identification of acquisition targets, and go-to-market proposition resulting in a ~30% YoY revenue growth over 5 years \n- Non-Alcoholic Beverages (Switzerland) - Headcount analysis resulting in a reduction of 5% of total operations costs across Europe ($9m) \n- Consumer Products (UK/Canada) - Project Manager; end-to-end solutioning and technical due-diligence of a breakthrough mobile application for Diabetics \n- Cruise Liner (UK/Norway) - Definition of the company's customer engagement strategy to improve customer service satisfaction and broaden product portfolio & offerings \n \nAreas of Focus: \n- Process redesign & corporate strategy development  \n- Commercial due diligence & M&A strategies \n- Digital & Mobile strategy for healthcare \n- Organizational restructuring \n- New Product Development & market entry Academic Research Norwegian Business School November 2010  –  May 2011  (7 months) Oslo Area, Norway – Research on the Norwegian Oil and Energy industries \n– Analysis of financing structures, R&D expenditures, labour mobility, market size \n– Economic and statistical modeling Academic Research Norwegian Business School November 2010  –  May 2011  (7 months) Oslo Area, Norway – Research on the Norwegian Oil and Energy industries \n– Analysis of financing structures, R&D expenditures, labour mobility, market size \n– Economic and statistical modeling Co-founder & Developer Sleep in Warsaw / ProSpace August 2009  –  February 2011  (1 year 7 months) Warsaw Area, Poland Co-founding and managing a real-estate renting service Co-founder & Developer Sleep in Warsaw / ProSpace August 2009  –  February 2011  (1 year 7 months) Warsaw Area, Poland Co-founding and managing a real-estate renting service Business Analyst Cicero Consulting September 2007  –  October 2009  (2 years 2 months) Oslo Area, Norway - Consumer Finance industry \n- Research on the Eastern European banking and financial services sector \n- Creating a database of >1000 financial products  \n- Collecting information on credit, debit, charge and prepaid cards Business Analyst Cicero Consulting September 2007  –  October 2009  (2 years 2 months) Oslo Area, Norway - Consumer Finance industry \n- Research on the Eastern European banking and financial services sector \n- Creating a database of >1000 financial products  \n- Collecting information on credit, debit, charge and prepaid cards Website coordinator and database management Scandinavian-Polish Chamber of Commerce September 2005  –  May 2006  (9 months) Warsaw Area, Poland Website coordinator and database management Scandinavian-Polish Chamber of Commerce September 2005  –  May 2006  (9 months) Warsaw Area, Poland Languages English Native or bilingual proficiency Polish Native or bilingual proficiency Norwegian Native or bilingual proficiency French Elementary proficiency German Elementary proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency Norwegian Native or bilingual proficiency French Elementary proficiency German Elementary proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency Norwegian Native or bilingual proficiency French Elementary proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Strategy Skills  Strategy Strategy Strategy Education BI Norwegian Business School Masters,  Master of Science in Business and Economics 2010  – 2012 Activities and Societies:  Master Thesis - The Norwegian subsea industry BI Norwegian Business School Masters,  Master of Science in Political Economy 2009  – 2010 BI Norwegian Business School Bachelor,  Bachelor in Business Administration - Finance 2006  – 2009 BI Norwegian Business School Masters,  Master of Science in Business and Economics 2010  – 2012 Activities and Societies:  Master Thesis - The Norwegian subsea industry BI Norwegian Business School Masters,  Master of Science in Business and Economics 2010  – 2012 Activities and Societies:  Master Thesis - The Norwegian subsea industry BI Norwegian Business School Masters,  Master of Science in Business and Economics 2010  – 2012 Activities and Societies:  Master Thesis - The Norwegian subsea industry BI Norwegian Business School Masters,  Master of Science in Political Economy 2009  – 2010 BI Norwegian Business School Masters,  Master of Science in Political Economy 2009  – 2010 BI Norwegian Business School Masters,  Master of Science in Political Economy 2009  – 2010 BI Norwegian Business School Bachelor,  Bachelor in Business Administration - Finance 2006  – 2009 BI Norwegian Business School Bachelor,  Bachelor in Business Administration - Finance 2006  – 2009 BI Norwegian Business School Bachelor,  Bachelor in Business Administration - Finance 2006  – 2009 ", "Summary Willkommen auf meinem Profil, schön Dich hier zu sehen!  \n \nMein Name ist Timo. Ich bin Dualer Student bei IBM und lebe in Stuttgart. Mich faszinieren vor allem die Themen Social Media und Web 2.0.  \nAls Millennial bin ich darüber hinaus an der Schnittstelle von Social Business, Soziologie, Nachhaltigkeit und Innovation interessiert. \n \nHier findest du meine #CloudOfInterest: Summary Willkommen auf meinem Profil, schön Dich hier zu sehen!  \n \nMein Name ist Timo. Ich bin Dualer Student bei IBM und lebe in Stuttgart. Mich faszinieren vor allem die Themen Social Media und Web 2.0.  \nAls Millennial bin ich darüber hinaus an der Schnittstelle von Social Business, Soziologie, Nachhaltigkeit und Innovation interessiert. \n \nHier findest du meine #CloudOfInterest: Willkommen auf meinem Profil, schön Dich hier zu sehen!  \n \nMein Name ist Timo. Ich bin Dualer Student bei IBM und lebe in Stuttgart. Mich faszinieren vor allem die Themen Social Media und Web 2.0.  \nAls Millennial bin ich darüber hinaus an der Schnittstelle von Social Business, Soziologie, Nachhaltigkeit und Innovation interessiert. \n \nHier findest du meine #CloudOfInterest: Willkommen auf meinem Profil, schön Dich hier zu sehen!  \n \nMein Name ist Timo. Ich bin Dualer Student bei IBM und lebe in Stuttgart. Mich faszinieren vor allem die Themen Social Media und Web 2.0.  \nAls Millennial bin ich darüber hinaus an der Schnittstelle von Social Business, Soziologie, Nachhaltigkeit und Innovation interessiert. \n \nHier findest du meine #CloudOfInterest: Experience Digital & Social Media Coordinator - Events IBM Deutschland August 2015  – Present (1 month) Ehningen Planung, Koordination und Durchführung von Social Media Aktivitäten vor, während und nach Events von IBM in Deutschland, Österreich und der Schweiz. Integration der entsprechenden Experten aus dem Bereich Digital Marketing sowie der Fachbereiche. Fokus auf die Besonderheiten und neuen Möglichkeiten von Web 2.0 sowie die Konzeption kreativer Ideen zur Verknüpfung von \"Offline\"​ und \"Online\"​ bei Events. Nutzung von soziologischen Erkentnissen in Bezug auf Konsum, Events und Kommunikation zur Verbesserung der \"Customer Journey\" bei den Events und Digital. Dualer Student - Wirtschaftsinformatik IBM Deutschland October 2012  – Present (2 years 11 months) Herrenberg Duales Studium bei IBM in Kooperation mit der Dualen Hochschule Baden-Württemberg (DHBW) Stuttgart.  \nDas Duale Studium ermöglicht es Praxis und Theorie in ein Studium zu integrieren. Die Praxisphasen bei IBM können frei und nach den eigenen Interessen absolviert werden. Weiterhin fördert IBM die Fähigkeiten der Teilnehmer durch zahlreiche Schulungen und Workshops wie beispielsweise Sales Workshops, Consulting Workshops, Präsentationsschulungen, SAP-Schulungen und Team-Training Workshops. Digital Marketing Strategist IBM Deutschland February 2015  –  May 2015  (4 months) Ehningen Zuständig für alle Social Media Brand Accounts von IBM Deutschland. Entwicklung einer Social Media Live Kommunikationsstrategie für die offiziellen IBM Deutschland Social Media Kanäle rund um die CeBIT 2015 (#cebit15 und #ibmcebit). Listening und Monitoring während der fünf Messetage. Konzeption eines Digital Asset Management Tools für die Verteilung und Verwaltung von Social Media Assets in Unternehmen (Mehr dazu auf: http://blog.buehlertimo.de). Entwicklung einer Social Media Risiko Strategie. Consulting Assistent im Bereich Organizational Change Management für Social Business IBM Deutschland September 2014  –  October 2014  (2 months) Frankfurt Am Main Area, Germany Analyse und Auswertung der Ergebnisse der Make Change Work 2 Studie, die vom Organizational Change Management (OCM) Team von IBM durchgeführt wurde. Unterstützung eines Senior Strategy Consultants für Social Business Projekte. Programm Assistent Corporate Citizenship IBM USA June 2014  –  August 2014  (3 months) Armonk Das Corporate Service Corps Programm ist Teil eines weitreichenden Programmportfolios das IBM im Bereich Corporate Social Responsibility anzubieten hat. IBM Mitarbeiter von überall auf der Welt können sich über einen Bewerbungsprozess bewerben und bekommen so die Chance in einem multikulturellen Team in einem anderen Land an den verschiedensten Projekten zu arbeiten.  \nAls Teil des Programmteams war ich zuständig für den Entwurf und die Implementierung einer integrierten und globalen Social Media Strategie für das Corporate Service Corps. Hierbei war der Fokus vor allem auf der Identifikation und dem Aufbau eines Netzwerks mit relevanten Influencern. \nDes weiteren habe ich die Prozesse des Teams auf unser internes Social Media Tool abgebildet um Informationsstaus zu verhindern und den Arbeitsalltag mit Hilfe von diesem kollaborativen Tool zu vereinfachen. Digital Marketing Strategist IBM Deutschland January 2014  –  February 2014  (2 months) Ehningen Als erneuter Teil des Digital und Social Media Teams der IBM Deutschland, Österreich und Schweiz habe ich an verschiedenen Projekten mitgewirkt. \nDas größte beschäftigte sich mit der Neukonzeptionierung von verschiedenen Strategien für die existierenden Social Media Kanäle wie zum Beispiel den IBM BlueBlog oder die IBM Deutschland Facebook Seite. Des Weiteren habe ich die Implementierung von neuen Marketingstrukturen unterstützt. In meiner Rolle als Assistent der Digital Lederin für Deutschland, Österreich und Schweiz hatte ich die Chance viele Erfahrungen in den verschiedensten Bereichen des Digital Marketing zu sammeln wie zum Beispiel Social Media, SEO und Websites. Vertriebsassistent im Bereich Business Analytics IBM Deutschland December 2013  –  January 2014  (2 months) Ehningen Als Assistent eines Vertriebsassistenten im Bereich Business Analytics habe ich mich vorrangig mit Themen aus diesem Bereich beschäftigt. Vor allem war der Fokus auf Sales Performance Management. Die Vor- und Nachbereitung von Kundenterminen sowie die Organisation von Marketingaktionen standen darüber hinaus im Mittelpunkt meiner praktischen Erfahrungen. Digital Marketing Strategist IBM Deutschland July 2013  –  August 2013  (2 months) Ehningen Die Digital Abteilung der IBM Deutschland, Österreich und Schweiz beschäftigt sich vor allem mit der strategischen Ausrichtung des digitalen Footprints der IBM. Dazu gehört unter anderem auch die strategische Ausrichtung sowie die direkte Administration aller offiziellen IBM Unternehmenskanäle für diese drei Länder. \nAls Teil des Teams habe ich basierend auf einer weltweiten Initiative eine integrierte Social Media Strategie entwickelt und implementiert. Dazu zählt auch die Entwicklung einer Social Media Content Strategie für diese offiziellen Unternehmenskanäle. Des weiteren hatte ich als Assistent der Digital Leaderin für Deutschland, Österreich und Schweiz die Chance viele Erfahrungen in den verschiedensten Bereichen des Digital Marketing zu sammeln wie zum Beispiel Social Media, SEO und Websites. Vertriebsassistent im Bereich Enterprise 2.0 IBM Deutschland January 2013  –  March 2013  (3 months) Ehningen Als Enterprise 2.0 Evangelist habe ich viele interne Präsentationen mit Fokus auf das Thema Social Software und Unternehmen der Zukunft gehalten. Weiterhin habe ich die Vor- und Nachbereitung von diversen Kundenterminen übernommen. Das größte Projekt war die Organisation eines Demopunktes für die CeBIT 2013 im Bereich Social Business (Der Meetingraum der Zukunft – IBM in Kooperation mit GIS und foresee – ineracTable). Als persönlicher Assistent der Social Business Sales Leaderin für Deutschland konnte ich viele Einblicke in neue und innovative Arbeitsweisen gewinnen. Assistenz der Geschäftsleitung Pangalactic Records July 2009  –  July 2012  (3 years 1 month) Heimsheim Planung und Organisation von Events sowie Übernahme von administrativen Aufgaben. Umgestaltung der bestehenden Homepage von Pangalactic Records. Aufbau von Social Media Präsenzen für das Unternehmen und Künstler des Unternehmens. Digital & Social Media Coordinator - Events IBM Deutschland August 2015  – Present (1 month) Ehningen Planung, Koordination und Durchführung von Social Media Aktivitäten vor, während und nach Events von IBM in Deutschland, Österreich und der Schweiz. Integration der entsprechenden Experten aus dem Bereich Digital Marketing sowie der Fachbereiche. Fokus auf die Besonderheiten und neuen Möglichkeiten von Web 2.0 sowie die Konzeption kreativer Ideen zur Verknüpfung von \"Offline\"​ und \"Online\"​ bei Events. Nutzung von soziologischen Erkentnissen in Bezug auf Konsum, Events und Kommunikation zur Verbesserung der \"Customer Journey\" bei den Events und Digital. Digital & Social Media Coordinator - Events IBM Deutschland August 2015  – Present (1 month) Ehningen Planung, Koordination und Durchführung von Social Media Aktivitäten vor, während und nach Events von IBM in Deutschland, Österreich und der Schweiz. Integration der entsprechenden Experten aus dem Bereich Digital Marketing sowie der Fachbereiche. Fokus auf die Besonderheiten und neuen Möglichkeiten von Web 2.0 sowie die Konzeption kreativer Ideen zur Verknüpfung von \"Offline\"​ und \"Online\"​ bei Events. Nutzung von soziologischen Erkentnissen in Bezug auf Konsum, Events und Kommunikation zur Verbesserung der \"Customer Journey\" bei den Events und Digital. Dualer Student - Wirtschaftsinformatik IBM Deutschland October 2012  – Present (2 years 11 months) Herrenberg Duales Studium bei IBM in Kooperation mit der Dualen Hochschule Baden-Württemberg (DHBW) Stuttgart.  \nDas Duale Studium ermöglicht es Praxis und Theorie in ein Studium zu integrieren. Die Praxisphasen bei IBM können frei und nach den eigenen Interessen absolviert werden. Weiterhin fördert IBM die Fähigkeiten der Teilnehmer durch zahlreiche Schulungen und Workshops wie beispielsweise Sales Workshops, Consulting Workshops, Präsentationsschulungen, SAP-Schulungen und Team-Training Workshops. Dualer Student - Wirtschaftsinformatik IBM Deutschland October 2012  – Present (2 years 11 months) Herrenberg Duales Studium bei IBM in Kooperation mit der Dualen Hochschule Baden-Württemberg (DHBW) Stuttgart.  \nDas Duale Studium ermöglicht es Praxis und Theorie in ein Studium zu integrieren. Die Praxisphasen bei IBM können frei und nach den eigenen Interessen absolviert werden. Weiterhin fördert IBM die Fähigkeiten der Teilnehmer durch zahlreiche Schulungen und Workshops wie beispielsweise Sales Workshops, Consulting Workshops, Präsentationsschulungen, SAP-Schulungen und Team-Training Workshops. Digital Marketing Strategist IBM Deutschland February 2015  –  May 2015  (4 months) Ehningen Zuständig für alle Social Media Brand Accounts von IBM Deutschland. Entwicklung einer Social Media Live Kommunikationsstrategie für die offiziellen IBM Deutschland Social Media Kanäle rund um die CeBIT 2015 (#cebit15 und #ibmcebit). Listening und Monitoring während der fünf Messetage. Konzeption eines Digital Asset Management Tools für die Verteilung und Verwaltung von Social Media Assets in Unternehmen (Mehr dazu auf: http://blog.buehlertimo.de). Entwicklung einer Social Media Risiko Strategie. Digital Marketing Strategist IBM Deutschland February 2015  –  May 2015  (4 months) Ehningen Zuständig für alle Social Media Brand Accounts von IBM Deutschland. Entwicklung einer Social Media Live Kommunikationsstrategie für die offiziellen IBM Deutschland Social Media Kanäle rund um die CeBIT 2015 (#cebit15 und #ibmcebit). Listening und Monitoring während der fünf Messetage. Konzeption eines Digital Asset Management Tools für die Verteilung und Verwaltung von Social Media Assets in Unternehmen (Mehr dazu auf: http://blog.buehlertimo.de). Entwicklung einer Social Media Risiko Strategie. Consulting Assistent im Bereich Organizational Change Management für Social Business IBM Deutschland September 2014  –  October 2014  (2 months) Frankfurt Am Main Area, Germany Analyse und Auswertung der Ergebnisse der Make Change Work 2 Studie, die vom Organizational Change Management (OCM) Team von IBM durchgeführt wurde. Unterstützung eines Senior Strategy Consultants für Social Business Projekte. Consulting Assistent im Bereich Organizational Change Management für Social Business IBM Deutschland September 2014  –  October 2014  (2 months) Frankfurt Am Main Area, Germany Analyse und Auswertung der Ergebnisse der Make Change Work 2 Studie, die vom Organizational Change Management (OCM) Team von IBM durchgeführt wurde. Unterstützung eines Senior Strategy Consultants für Social Business Projekte. Programm Assistent Corporate Citizenship IBM USA June 2014  –  August 2014  (3 months) Armonk Das Corporate Service Corps Programm ist Teil eines weitreichenden Programmportfolios das IBM im Bereich Corporate Social Responsibility anzubieten hat. IBM Mitarbeiter von überall auf der Welt können sich über einen Bewerbungsprozess bewerben und bekommen so die Chance in einem multikulturellen Team in einem anderen Land an den verschiedensten Projekten zu arbeiten.  \nAls Teil des Programmteams war ich zuständig für den Entwurf und die Implementierung einer integrierten und globalen Social Media Strategie für das Corporate Service Corps. Hierbei war der Fokus vor allem auf der Identifikation und dem Aufbau eines Netzwerks mit relevanten Influencern. \nDes weiteren habe ich die Prozesse des Teams auf unser internes Social Media Tool abgebildet um Informationsstaus zu verhindern und den Arbeitsalltag mit Hilfe von diesem kollaborativen Tool zu vereinfachen. Programm Assistent Corporate Citizenship IBM USA June 2014  –  August 2014  (3 months) Armonk Das Corporate Service Corps Programm ist Teil eines weitreichenden Programmportfolios das IBM im Bereich Corporate Social Responsibility anzubieten hat. IBM Mitarbeiter von überall auf der Welt können sich über einen Bewerbungsprozess bewerben und bekommen so die Chance in einem multikulturellen Team in einem anderen Land an den verschiedensten Projekten zu arbeiten.  \nAls Teil des Programmteams war ich zuständig für den Entwurf und die Implementierung einer integrierten und globalen Social Media Strategie für das Corporate Service Corps. Hierbei war der Fokus vor allem auf der Identifikation und dem Aufbau eines Netzwerks mit relevanten Influencern. \nDes weiteren habe ich die Prozesse des Teams auf unser internes Social Media Tool abgebildet um Informationsstaus zu verhindern und den Arbeitsalltag mit Hilfe von diesem kollaborativen Tool zu vereinfachen. Digital Marketing Strategist IBM Deutschland January 2014  –  February 2014  (2 months) Ehningen Als erneuter Teil des Digital und Social Media Teams der IBM Deutschland, Österreich und Schweiz habe ich an verschiedenen Projekten mitgewirkt. \nDas größte beschäftigte sich mit der Neukonzeptionierung von verschiedenen Strategien für die existierenden Social Media Kanäle wie zum Beispiel den IBM BlueBlog oder die IBM Deutschland Facebook Seite. Des Weiteren habe ich die Implementierung von neuen Marketingstrukturen unterstützt. In meiner Rolle als Assistent der Digital Lederin für Deutschland, Österreich und Schweiz hatte ich die Chance viele Erfahrungen in den verschiedensten Bereichen des Digital Marketing zu sammeln wie zum Beispiel Social Media, SEO und Websites. Digital Marketing Strategist IBM Deutschland January 2014  –  February 2014  (2 months) Ehningen Als erneuter Teil des Digital und Social Media Teams der IBM Deutschland, Österreich und Schweiz habe ich an verschiedenen Projekten mitgewirkt. \nDas größte beschäftigte sich mit der Neukonzeptionierung von verschiedenen Strategien für die existierenden Social Media Kanäle wie zum Beispiel den IBM BlueBlog oder die IBM Deutschland Facebook Seite. Des Weiteren habe ich die Implementierung von neuen Marketingstrukturen unterstützt. In meiner Rolle als Assistent der Digital Lederin für Deutschland, Österreich und Schweiz hatte ich die Chance viele Erfahrungen in den verschiedensten Bereichen des Digital Marketing zu sammeln wie zum Beispiel Social Media, SEO und Websites. Vertriebsassistent im Bereich Business Analytics IBM Deutschland December 2013  –  January 2014  (2 months) Ehningen Als Assistent eines Vertriebsassistenten im Bereich Business Analytics habe ich mich vorrangig mit Themen aus diesem Bereich beschäftigt. Vor allem war der Fokus auf Sales Performance Management. Die Vor- und Nachbereitung von Kundenterminen sowie die Organisation von Marketingaktionen standen darüber hinaus im Mittelpunkt meiner praktischen Erfahrungen. Vertriebsassistent im Bereich Business Analytics IBM Deutschland December 2013  –  January 2014  (2 months) Ehningen Als Assistent eines Vertriebsassistenten im Bereich Business Analytics habe ich mich vorrangig mit Themen aus diesem Bereich beschäftigt. Vor allem war der Fokus auf Sales Performance Management. Die Vor- und Nachbereitung von Kundenterminen sowie die Organisation von Marketingaktionen standen darüber hinaus im Mittelpunkt meiner praktischen Erfahrungen. Digital Marketing Strategist IBM Deutschland July 2013  –  August 2013  (2 months) Ehningen Die Digital Abteilung der IBM Deutschland, Österreich und Schweiz beschäftigt sich vor allem mit der strategischen Ausrichtung des digitalen Footprints der IBM. Dazu gehört unter anderem auch die strategische Ausrichtung sowie die direkte Administration aller offiziellen IBM Unternehmenskanäle für diese drei Länder. \nAls Teil des Teams habe ich basierend auf einer weltweiten Initiative eine integrierte Social Media Strategie entwickelt und implementiert. Dazu zählt auch die Entwicklung einer Social Media Content Strategie für diese offiziellen Unternehmenskanäle. Des weiteren hatte ich als Assistent der Digital Leaderin für Deutschland, Österreich und Schweiz die Chance viele Erfahrungen in den verschiedensten Bereichen des Digital Marketing zu sammeln wie zum Beispiel Social Media, SEO und Websites. Digital Marketing Strategist IBM Deutschland July 2013  –  August 2013  (2 months) Ehningen Die Digital Abteilung der IBM Deutschland, Österreich und Schweiz beschäftigt sich vor allem mit der strategischen Ausrichtung des digitalen Footprints der IBM. Dazu gehört unter anderem auch die strategische Ausrichtung sowie die direkte Administration aller offiziellen IBM Unternehmenskanäle für diese drei Länder. \nAls Teil des Teams habe ich basierend auf einer weltweiten Initiative eine integrierte Social Media Strategie entwickelt und implementiert. Dazu zählt auch die Entwicklung einer Social Media Content Strategie für diese offiziellen Unternehmenskanäle. Des weiteren hatte ich als Assistent der Digital Leaderin für Deutschland, Österreich und Schweiz die Chance viele Erfahrungen in den verschiedensten Bereichen des Digital Marketing zu sammeln wie zum Beispiel Social Media, SEO und Websites. Vertriebsassistent im Bereich Enterprise 2.0 IBM Deutschland January 2013  –  March 2013  (3 months) Ehningen Als Enterprise 2.0 Evangelist habe ich viele interne Präsentationen mit Fokus auf das Thema Social Software und Unternehmen der Zukunft gehalten. Weiterhin habe ich die Vor- und Nachbereitung von diversen Kundenterminen übernommen. Das größte Projekt war die Organisation eines Demopunktes für die CeBIT 2013 im Bereich Social Business (Der Meetingraum der Zukunft – IBM in Kooperation mit GIS und foresee – ineracTable). Als persönlicher Assistent der Social Business Sales Leaderin für Deutschland konnte ich viele Einblicke in neue und innovative Arbeitsweisen gewinnen. Vertriebsassistent im Bereich Enterprise 2.0 IBM Deutschland January 2013  –  March 2013  (3 months) Ehningen Als Enterprise 2.0 Evangelist habe ich viele interne Präsentationen mit Fokus auf das Thema Social Software und Unternehmen der Zukunft gehalten. Weiterhin habe ich die Vor- und Nachbereitung von diversen Kundenterminen übernommen. Das größte Projekt war die Organisation eines Demopunktes für die CeBIT 2013 im Bereich Social Business (Der Meetingraum der Zukunft – IBM in Kooperation mit GIS und foresee – ineracTable). Als persönlicher Assistent der Social Business Sales Leaderin für Deutschland konnte ich viele Einblicke in neue und innovative Arbeitsweisen gewinnen. Assistenz der Geschäftsleitung Pangalactic Records July 2009  –  July 2012  (3 years 1 month) Heimsheim Planung und Organisation von Events sowie Übernahme von administrativen Aufgaben. Umgestaltung der bestehenden Homepage von Pangalactic Records. Aufbau von Social Media Präsenzen für das Unternehmen und Künstler des Unternehmens. Assistenz der Geschäftsleitung Pangalactic Records July 2009  –  July 2012  (3 years 1 month) Heimsheim Planung und Organisation von Events sowie Übernahme von administrativen Aufgaben. Umgestaltung der bestehenden Homepage von Pangalactic Records. Aufbau von Social Media Präsenzen für das Unternehmen und Künstler des Unternehmens. Languages Deutsch Native or bilingual proficiency Englisch Full professional proficiency Französisch Elementary proficiency Deutsch Native or bilingual proficiency Englisch Full professional proficiency Französisch Elementary proficiency Deutsch Native or bilingual proficiency Englisch Full professional proficiency Französisch Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills Social Media Social Media Marketing Digital Marketing Social Business Web 2.0 Digital Strategy Social Media... Corporate Citizenship Philanthropy Eventmanagement Microsoft Office Digitales Marketing IBM Connections Consulting Social Media Integration IBM Notes Corporate Social... Analytik Web Marketing Digital-Asset-Management VBA IBM SmartCloud Enterprise 2.0 Sustainability Social Media Monitoring Social Media Risk... Influencer Marketing Marketing Resource... Web Analytics Social-Media-Kommunikati... Social Media Outreach Sociology Eventplanung See 18+     See less Skills  Social Media Social Media Marketing Digital Marketing Social Business Web 2.0 Digital Strategy Social Media... Corporate Citizenship Philanthropy Eventmanagement Microsoft Office Digitales Marketing IBM Connections Consulting Social Media Integration IBM Notes Corporate Social... Analytik Web Marketing Digital-Asset-Management VBA IBM SmartCloud Enterprise 2.0 Sustainability Social Media Monitoring Social Media Risk... Influencer Marketing Marketing Resource... Web Analytics Social-Media-Kommunikati... Social Media Outreach Sociology Eventplanung See 18+     See less Social Media Social Media Marketing Digital Marketing Social Business Web 2.0 Digital Strategy Social Media... Corporate Citizenship Philanthropy Eventmanagement Microsoft Office Digitales Marketing IBM Connections Consulting Social Media Integration IBM Notes Corporate Social... Analytik Web Marketing Digital-Asset-Management VBA IBM SmartCloud Enterprise 2.0 Sustainability Social Media Monitoring Social Media Risk... Influencer Marketing Marketing Resource... Web Analytics Social-Media-Kommunikati... Social Media Outreach Sociology Eventplanung See 18+     See less Social Media Social Media Marketing Digital Marketing Social Business Web 2.0 Digital Strategy Social Media... Corporate Citizenship Philanthropy Eventmanagement Microsoft Office Digitales Marketing IBM Connections Consulting Social Media Integration IBM Notes Corporate Social... Analytik Web Marketing Digital-Asset-Management VBA IBM SmartCloud Enterprise 2.0 Sustainability Social Media Monitoring Social Media Risk... Influencer Marketing Marketing Resource... Web Analytics Social-Media-Kommunikati... Social Media Outreach Sociology Eventplanung See 18+     See less Education Duale Hochschule Baden-Württemberg Bachelor of Science (B. Sc.),  Wirtschaftsinformatik 2012  – 2015 Studium an der Dualen Hochschule Bade-Württemberg (DHBW) mit dem Abschluss Bachelor of Science im Studiengang Wirtschaftsinformatik.  \nDie enge Verknüpfung von IT und ökonomisch bezogenen Themen steht im Mittelpunkt des Studiums. Neben Kenntnissen in den Bereichen Programmierung, Anwendungsentwicklung, Buchführung, BWL und Marketing werden Kenntnisse über Projektmanagement, Präsentation und Moderation vermittelt. \nDie Verknüpfung der beiden großen Themengebiete ermöglicht es Projekte und Probleme aus unterschiedlichen Aspekten zu betrachten, zu bewerten, durchzuführen und zu lösen. Johannes-Kepler-Gymnasium Weil der Stadt Abitur,  Leistungskurse: Wirtschaft, Mathematik, Physik, Deutsch, Englisch 2004  – 2012 Während meiner Schulzeit habe ich neben dem normalen Schulalltag als Ton- und Lichttechniker der Schule alle Veranstaltungen, wie unter anderem auch die Theateraufführungen, begleitet. In der Kursstufe hatte ich die Leistungskurse: Wirtschaft, Mathematik, Physik, Deutsch, Englisch. Im Rahmen des Wirtschaftskurses war ich technischer Leiter eines im Kurs gegründeten Unternehmens im Rahmen des JUNIOR-Projektes. Activities and Societies:  Ton- und Lichttechniker der Schule ,  Junior Projekt Duale Hochschule Baden-Württemberg Bachelor of Science (B. Sc.),  Wirtschaftsinformatik 2012  – 2015 Studium an der Dualen Hochschule Bade-Württemberg (DHBW) mit dem Abschluss Bachelor of Science im Studiengang Wirtschaftsinformatik.  \nDie enge Verknüpfung von IT und ökonomisch bezogenen Themen steht im Mittelpunkt des Studiums. Neben Kenntnissen in den Bereichen Programmierung, Anwendungsentwicklung, Buchführung, BWL und Marketing werden Kenntnisse über Projektmanagement, Präsentation und Moderation vermittelt. \nDie Verknüpfung der beiden großen Themengebiete ermöglicht es Projekte und Probleme aus unterschiedlichen Aspekten zu betrachten, zu bewerten, durchzuführen und zu lösen. Duale Hochschule Baden-Württemberg Bachelor of Science (B. Sc.),  Wirtschaftsinformatik 2012  – 2015 Studium an der Dualen Hochschule Bade-Württemberg (DHBW) mit dem Abschluss Bachelor of Science im Studiengang Wirtschaftsinformatik.  \nDie enge Verknüpfung von IT und ökonomisch bezogenen Themen steht im Mittelpunkt des Studiums. Neben Kenntnissen in den Bereichen Programmierung, Anwendungsentwicklung, Buchführung, BWL und Marketing werden Kenntnisse über Projektmanagement, Präsentation und Moderation vermittelt. \nDie Verknüpfung der beiden großen Themengebiete ermöglicht es Projekte und Probleme aus unterschiedlichen Aspekten zu betrachten, zu bewerten, durchzuführen und zu lösen. Duale Hochschule Baden-Württemberg Bachelor of Science (B. Sc.),  Wirtschaftsinformatik 2012  – 2015 Studium an der Dualen Hochschule Bade-Württemberg (DHBW) mit dem Abschluss Bachelor of Science im Studiengang Wirtschaftsinformatik.  \nDie enge Verknüpfung von IT und ökonomisch bezogenen Themen steht im Mittelpunkt des Studiums. Neben Kenntnissen in den Bereichen Programmierung, Anwendungsentwicklung, Buchführung, BWL und Marketing werden Kenntnisse über Projektmanagement, Präsentation und Moderation vermittelt. \nDie Verknüpfung der beiden großen Themengebiete ermöglicht es Projekte und Probleme aus unterschiedlichen Aspekten zu betrachten, zu bewerten, durchzuführen und zu lösen. Johannes-Kepler-Gymnasium Weil der Stadt Abitur,  Leistungskurse: Wirtschaft, Mathematik, Physik, Deutsch, Englisch 2004  – 2012 Während meiner Schulzeit habe ich neben dem normalen Schulalltag als Ton- und Lichttechniker der Schule alle Veranstaltungen, wie unter anderem auch die Theateraufführungen, begleitet. In der Kursstufe hatte ich die Leistungskurse: Wirtschaft, Mathematik, Physik, Deutsch, Englisch. Im Rahmen des Wirtschaftskurses war ich technischer Leiter eines im Kurs gegründeten Unternehmens im Rahmen des JUNIOR-Projektes. Activities and Societies:  Ton- und Lichttechniker der Schule ,  Junior Projekt Johannes-Kepler-Gymnasium Weil der Stadt Abitur,  Leistungskurse: Wirtschaft, Mathematik, Physik, Deutsch, Englisch 2004  – 2012 Während meiner Schulzeit habe ich neben dem normalen Schulalltag als Ton- und Lichttechniker der Schule alle Veranstaltungen, wie unter anderem auch die Theateraufführungen, begleitet. In der Kursstufe hatte ich die Leistungskurse: Wirtschaft, Mathematik, Physik, Deutsch, Englisch. Im Rahmen des Wirtschaftskurses war ich technischer Leiter eines im Kurs gegründeten Unternehmens im Rahmen des JUNIOR-Projektes. Activities and Societies:  Ton- und Lichttechniker der Schule ,  Junior Projekt Johannes-Kepler-Gymnasium Weil der Stadt Abitur,  Leistungskurse: Wirtschaft, Mathematik, Physik, Deutsch, Englisch 2004  – 2012 Während meiner Schulzeit habe ich neben dem normalen Schulalltag als Ton- und Lichttechniker der Schule alle Veranstaltungen, wie unter anderem auch die Theateraufführungen, begleitet. In der Kursstufe hatte ich die Leistungskurse: Wirtschaft, Mathematik, Physik, Deutsch, Englisch. Im Rahmen des Wirtschaftskurses war ich technischer Leiter eines im Kurs gegründeten Unternehmens im Rahmen des JUNIOR-Projektes. Activities and Societies:  Ton- und Lichttechniker der Schule ,  Junior Projekt Honors & Awards ", "Experience Digital Strategist, IBM Commerce IBM January 2014  – Present (1 year 8 months) San Francisco, CA I lead digital/web strategy for the Marketing and Merchandising software team. This division consists primarily of IBM software products from the acquisitions of Coremetrics, Unica, DemandTec, Tealeaf, Xtify and Silverpop. I spend my days working on content & usability, offer management & demand generation, SEO/SEM, and building out new solutions marketing sites/landing pages. Sr. Manager, eMarketing Tealeaf, an IBM Company August 2010  –  December 2013  (3 years 5 months) San Francisco, CA (Tealeaf was acquired by IBM in 2012 -- at the end of 2013 I transitioned fully to IBM) \n \n- Managed all aspects of corporate website, blog and other web properties. Responsible for site maintenance (content and usability), online demand gen programs, lead capture integration with CRM (SalesForce), SEO/SEM and web analytics. \n- Ran all email marketing programs and marketing automation platform (Marketo). Created lead nurturing system, set up lead flow & assignment automation, built all email templates and landing pages, reported on campaign and lead flow analytics to executive staff. \n- Manager/administrator for all other third party web channels/applications such as SlideShare, YouTube, CoTweet, Google Analytics & AdWords, Facebook, LinkedIn, Feedburner, Twitter, ExactTarget, etc. Marketing Manager AmberPoint September 2005  –  March 2010  (4 years 7 months) Oakland, CA - Webmaster/Web Developer, external and internal sites (corporate site, intranet, blog, bbs, partner portal, etc.) Responsible for planning, development, SEO, redesign and maintenance of all sites.  \n- E-marketing Manager (newsletters, lead gen campaigns, event invitations/follow-ups, etc.) Designed, built, sent and tracked html emails; worked with field to analyze and segment results for sales purposes.  \n- Events Manager (trade shows, seminars, webcasts, etc.) Planned and coordinated all events, live or virtual, and tracked results to determine ROI. \n- Partner Marketing Specialist (managed partner program) Director of Client Relations Tenrec, Inc. March 2000  –  August 2005  (5 years 6 months) San Francisco, CA - Managed all aspects of client relations, including customer service, after-market sales and website maintenance. As primary point of contact for all clients after initial project completion, managed development team, coding, graphic design and information achitecture for all ensuing site maintenance work. Also responsible for signing clients to maintenance contracts. \n- Acted as Developer responsible for building HTML/CSS structure of websites. Customer Support Director EducAide July 1996  –  February 2000  (3 years 8 months) Vallejo, CA Managed all customer support and sales support, which included training, technical support, events, sales, product demonstrations and more. Also served as webmaster, creating, maintaining and regularly updating the company website. Account Manager, Latin America Software Publishing Corporation June 1992  –  December 1995  (3 years 7 months) Santa Clara, CA Managed distributors in Chile, Colombia, Ecuador, Peru & Venezuela, reporting to Regional Director of Asia Pacific and Latin America. Position involved the sales, marketing and support of the entire SPC product line and included frequent travel to Latin America. Digital Strategist, IBM Commerce IBM January 2014  – Present (1 year 8 months) San Francisco, CA I lead digital/web strategy for the Marketing and Merchandising software team. This division consists primarily of IBM software products from the acquisitions of Coremetrics, Unica, DemandTec, Tealeaf, Xtify and Silverpop. I spend my days working on content & usability, offer management & demand generation, SEO/SEM, and building out new solutions marketing sites/landing pages. Digital Strategist, IBM Commerce IBM January 2014  – Present (1 year 8 months) San Francisco, CA I lead digital/web strategy for the Marketing and Merchandising software team. This division consists primarily of IBM software products from the acquisitions of Coremetrics, Unica, DemandTec, Tealeaf, Xtify and Silverpop. I spend my days working on content & usability, offer management & demand generation, SEO/SEM, and building out new solutions marketing sites/landing pages. Sr. Manager, eMarketing Tealeaf, an IBM Company August 2010  –  December 2013  (3 years 5 months) San Francisco, CA (Tealeaf was acquired by IBM in 2012 -- at the end of 2013 I transitioned fully to IBM) \n \n- Managed all aspects of corporate website, blog and other web properties. Responsible for site maintenance (content and usability), online demand gen programs, lead capture integration with CRM (SalesForce), SEO/SEM and web analytics. \n- Ran all email marketing programs and marketing automation platform (Marketo). Created lead nurturing system, set up lead flow & assignment automation, built all email templates and landing pages, reported on campaign and lead flow analytics to executive staff. \n- Manager/administrator for all other third party web channels/applications such as SlideShare, YouTube, CoTweet, Google Analytics & AdWords, Facebook, LinkedIn, Feedburner, Twitter, ExactTarget, etc. Sr. Manager, eMarketing Tealeaf, an IBM Company August 2010  –  December 2013  (3 years 5 months) San Francisco, CA (Tealeaf was acquired by IBM in 2012 -- at the end of 2013 I transitioned fully to IBM) \n \n- Managed all aspects of corporate website, blog and other web properties. Responsible for site maintenance (content and usability), online demand gen programs, lead capture integration with CRM (SalesForce), SEO/SEM and web analytics. \n- Ran all email marketing programs and marketing automation platform (Marketo). Created lead nurturing system, set up lead flow & assignment automation, built all email templates and landing pages, reported on campaign and lead flow analytics to executive staff. \n- Manager/administrator for all other third party web channels/applications such as SlideShare, YouTube, CoTweet, Google Analytics & AdWords, Facebook, LinkedIn, Feedburner, Twitter, ExactTarget, etc. Marketing Manager AmberPoint September 2005  –  March 2010  (4 years 7 months) Oakland, CA - Webmaster/Web Developer, external and internal sites (corporate site, intranet, blog, bbs, partner portal, etc.) Responsible for planning, development, SEO, redesign and maintenance of all sites.  \n- E-marketing Manager (newsletters, lead gen campaigns, event invitations/follow-ups, etc.) Designed, built, sent and tracked html emails; worked with field to analyze and segment results for sales purposes.  \n- Events Manager (trade shows, seminars, webcasts, etc.) Planned and coordinated all events, live or virtual, and tracked results to determine ROI. \n- Partner Marketing Specialist (managed partner program) Marketing Manager AmberPoint September 2005  –  March 2010  (4 years 7 months) Oakland, CA - Webmaster/Web Developer, external and internal sites (corporate site, intranet, blog, bbs, partner portal, etc.) Responsible for planning, development, SEO, redesign and maintenance of all sites.  \n- E-marketing Manager (newsletters, lead gen campaigns, event invitations/follow-ups, etc.) Designed, built, sent and tracked html emails; worked with field to analyze and segment results for sales purposes.  \n- Events Manager (trade shows, seminars, webcasts, etc.) Planned and coordinated all events, live or virtual, and tracked results to determine ROI. \n- Partner Marketing Specialist (managed partner program) Director of Client Relations Tenrec, Inc. March 2000  –  August 2005  (5 years 6 months) San Francisco, CA - Managed all aspects of client relations, including customer service, after-market sales and website maintenance. As primary point of contact for all clients after initial project completion, managed development team, coding, graphic design and information achitecture for all ensuing site maintenance work. Also responsible for signing clients to maintenance contracts. \n- Acted as Developer responsible for building HTML/CSS structure of websites. Director of Client Relations Tenrec, Inc. March 2000  –  August 2005  (5 years 6 months) San Francisco, CA - Managed all aspects of client relations, including customer service, after-market sales and website maintenance. As primary point of contact for all clients after initial project completion, managed development team, coding, graphic design and information achitecture for all ensuing site maintenance work. Also responsible for signing clients to maintenance contracts. \n- Acted as Developer responsible for building HTML/CSS structure of websites. Customer Support Director EducAide July 1996  –  February 2000  (3 years 8 months) Vallejo, CA Managed all customer support and sales support, which included training, technical support, events, sales, product demonstrations and more. Also served as webmaster, creating, maintaining and regularly updating the company website. Customer Support Director EducAide July 1996  –  February 2000  (3 years 8 months) Vallejo, CA Managed all customer support and sales support, which included training, technical support, events, sales, product demonstrations and more. Also served as webmaster, creating, maintaining and regularly updating the company website. Account Manager, Latin America Software Publishing Corporation June 1992  –  December 1995  (3 years 7 months) Santa Clara, CA Managed distributors in Chile, Colombia, Ecuador, Peru & Venezuela, reporting to Regional Director of Asia Pacific and Latin America. Position involved the sales, marketing and support of the entire SPC product line and included frequent travel to Latin America. Account Manager, Latin America Software Publishing Corporation June 1992  –  December 1995  (3 years 7 months) Santa Clara, CA Managed distributors in Chile, Colombia, Ecuador, Peru & Venezuela, reporting to Regional Director of Asia Pacific and Latin America. Position involved the sales, marketing and support of the entire SPC product line and included frequent travel to Latin America. Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills HTML + CSS Website Development Website Management Web Analytics Digital Marketing SEM SEO HTML emails Email Marketing Marketo Salesforce.com... Salesforce.com Google Adwords Multi-channel Marketing Start-ups CRM Analytics SaaS Lead Generation Demand Generation Strategy See 6+     See less Skills  HTML + CSS Website Development Website Management Web Analytics Digital Marketing SEM SEO HTML emails Email Marketing Marketo Salesforce.com... Salesforce.com Google Adwords Multi-channel Marketing Start-ups CRM Analytics SaaS Lead Generation Demand Generation Strategy See 6+     See less HTML + CSS Website Development Website Management Web Analytics Digital Marketing SEM SEO HTML emails Email Marketing Marketo Salesforce.com... Salesforce.com Google Adwords Multi-channel Marketing Start-ups CRM Analytics SaaS Lead Generation Demand Generation Strategy See 6+     See less HTML + CSS Website Development Website Management Web Analytics Digital Marketing SEM SEO HTML emails Email Marketing Marketo Salesforce.com... Salesforce.com Google Adwords Multi-channel Marketing Start-ups CRM Analytics SaaS Lead Generation Demand Generation Strategy See 6+     See less Education Washington and Lee University BA,  Spanish 1988  – 1992 University of Valencia Spanish Literature 1990  – 1990 Foreign study program - Fall semester, 1990 Palo Alto High School 1984  – 1988 Washington and Lee University BA,  Spanish 1988  – 1992 Washington and Lee University BA,  Spanish 1988  – 1992 Washington and Lee University BA,  Spanish 1988  – 1992 University of Valencia Spanish Literature 1990  – 1990 Foreign study program - Fall semester, 1990 University of Valencia Spanish Literature 1990  – 1990 Foreign study program - Fall semester, 1990 University of Valencia Spanish Literature 1990  – 1990 Foreign study program - Fall semester, 1990 Palo Alto High School 1984  – 1988 Palo Alto High School 1984  – 1988 Palo Alto High School 1984  – 1988 ", "Skills Digital Marketing Web Analytics Demand Generation Sales Enablement SEO Program Management Web Development Advertising Multi-channel Marketing Social Media E-commerce Online Marketing User Experience Mobile Devices Web Marketing JavaScript Information Architecture B2B Marketing Product Marketing CSS Social Media Marketing Analytics SaaS Content Management Web 2.0 Lead Generation SEM Web Project Management Digital Strategy Web Content Management Mobile Applications Google Analytics Website Development Mobile Marketing Corporate Communications Integrated Marketing Content Strategy Email Marketing Strategic Partnerships Online Advertising Thought Leadership User Interface Design Usability Go-to-market Strategy See 29+     See less Skills  Digital Marketing Web Analytics Demand Generation Sales Enablement SEO Program Management Web Development Advertising Multi-channel Marketing Social Media E-commerce Online Marketing User Experience Mobile Devices Web Marketing JavaScript Information Architecture B2B Marketing Product Marketing CSS Social Media Marketing Analytics SaaS Content Management Web 2.0 Lead Generation SEM Web Project Management Digital Strategy Web Content Management Mobile Applications Google Analytics Website Development Mobile Marketing Corporate Communications Integrated Marketing Content Strategy Email Marketing Strategic Partnerships Online Advertising Thought Leadership User Interface Design Usability Go-to-market Strategy See 29+     See less Digital Marketing Web Analytics Demand Generation Sales Enablement SEO Program Management Web Development Advertising Multi-channel Marketing Social Media E-commerce Online Marketing User Experience Mobile Devices Web Marketing JavaScript Information Architecture B2B Marketing Product Marketing CSS Social Media Marketing Analytics SaaS Content Management Web 2.0 Lead Generation SEM Web Project Management Digital Strategy Web Content Management Mobile Applications Google Analytics Website Development Mobile Marketing Corporate Communications Integrated Marketing Content Strategy Email Marketing Strategic Partnerships Online Advertising Thought Leadership User Interface Design Usability Go-to-market Strategy See 29+     See less Digital Marketing Web Analytics Demand Generation Sales Enablement SEO Program Management Web Development Advertising Multi-channel Marketing Social Media E-commerce Online Marketing User Experience Mobile Devices Web Marketing JavaScript Information Architecture B2B Marketing Product Marketing CSS Social Media Marketing Analytics SaaS Content Management Web 2.0 Lead Generation SEM Web Project Management Digital Strategy Web Content Management Mobile Applications Google Analytics Website Development Mobile Marketing Corporate Communications Integrated Marketing Content Strategy Email Marketing Strategic Partnerships Online Advertising Thought Leadership User Interface Design Usability Go-to-market Strategy See 29+     See less ", "Experience Social/Digital Strategist IBM August 2015  – Present (1 month) New York, New York Social Media Analytics - YouTube Google August 2014  –  July 2015  (1 year) Greater New York City Area Director, Client Services Tracx March 2012  –  August 2014  (2 years 6 months) Greater New York City Area The tracx Social Media Management System (SMMS) is a modular and fully scalable platform designed to provide professional users all the tools necessary to build, manage and monetize their social media presence. \n \nThe tracx solution supports the full social media activity life-cycle; from planning and analysis, content distribution and engagement, influencer management, real-time conversations and in-depth success measurement and ROI. \n \nBased on the company's proprietary technology, tracx refines masses of raw data across all social media channels, blogs, forums, news and retail sites, turning the posts and interactions into full conversations with intelligence around the participants. The platform provides actionable insights into customer and competitor behaviors within a defined vertical, highlighting marketing intelligence, providing a social media ROI and creating business opportunities. Manager, Services & Implementation Visible Technologies June 2011  –  March 2012  (10 months) New York, New York Senior Account Manager Visible Technologies January 2009  –  June 2011  (2 years 6 months) Account Manager Slifter August 2007  –  December 2008  (1 year 5 months) Social/Digital Strategist IBM August 2015  – Present (1 month) New York, New York Social/Digital Strategist IBM August 2015  – Present (1 month) New York, New York Social Media Analytics - YouTube Google August 2014  –  July 2015  (1 year) Greater New York City Area Social Media Analytics - YouTube Google August 2014  –  July 2015  (1 year) Greater New York City Area Director, Client Services Tracx March 2012  –  August 2014  (2 years 6 months) Greater New York City Area The tracx Social Media Management System (SMMS) is a modular and fully scalable platform designed to provide professional users all the tools necessary to build, manage and monetize their social media presence. \n \nThe tracx solution supports the full social media activity life-cycle; from planning and analysis, content distribution and engagement, influencer management, real-time conversations and in-depth success measurement and ROI. \n \nBased on the company's proprietary technology, tracx refines masses of raw data across all social media channels, blogs, forums, news and retail sites, turning the posts and interactions into full conversations with intelligence around the participants. The platform provides actionable insights into customer and competitor behaviors within a defined vertical, highlighting marketing intelligence, providing a social media ROI and creating business opportunities. Director, Client Services Tracx March 2012  –  August 2014  (2 years 6 months) Greater New York City Area The tracx Social Media Management System (SMMS) is a modular and fully scalable platform designed to provide professional users all the tools necessary to build, manage and monetize their social media presence. \n \nThe tracx solution supports the full social media activity life-cycle; from planning and analysis, content distribution and engagement, influencer management, real-time conversations and in-depth success measurement and ROI. \n \nBased on the company's proprietary technology, tracx refines masses of raw data across all social media channels, blogs, forums, news and retail sites, turning the posts and interactions into full conversations with intelligence around the participants. The platform provides actionable insights into customer and competitor behaviors within a defined vertical, highlighting marketing intelligence, providing a social media ROI and creating business opportunities. Manager, Services & Implementation Visible Technologies June 2011  –  March 2012  (10 months) New York, New York Manager, Services & Implementation Visible Technologies June 2011  –  March 2012  (10 months) New York, New York Senior Account Manager Visible Technologies January 2009  –  June 2011  (2 years 6 months) Senior Account Manager Visible Technologies January 2009  –  June 2011  (2 years 6 months) Account Manager Slifter August 2007  –  December 2008  (1 year 5 months) Account Manager Slifter August 2007  –  December 2008  (1 year 5 months) Skills Social Media Measurement Social Media Marketing Social Media Digital Strategy Mobile Marketing Digital Marketing Analytics Digital Media Web Analytics Interactive Marketing SEM Online Advertising Salesforce.com Integrated Marketing Email Marketing Account Management Social Marketing Lead Generation E-commerce SaaS SEO Online Marketing Google Analytics Strategic Partnerships Marketing Strategy PPC Emerging Technologies Emerging Media Strategy Mobile Technology Mobile Applications Start-ups CRM Business Intelligence Blogging Mobile Devices See 20+     See less Skills  Social Media Measurement Social Media Marketing Social Media Digital Strategy Mobile Marketing Digital Marketing Analytics Digital Media Web Analytics Interactive Marketing SEM Online Advertising Salesforce.com Integrated Marketing Email Marketing Account Management Social Marketing Lead Generation E-commerce SaaS SEO Online Marketing Google Analytics Strategic Partnerships Marketing Strategy PPC Emerging Technologies Emerging Media Strategy Mobile Technology Mobile Applications Start-ups CRM Business Intelligence Blogging Mobile Devices See 20+     See less Social Media Measurement Social Media Marketing Social Media Digital Strategy Mobile Marketing Digital Marketing Analytics Digital Media Web Analytics Interactive Marketing SEM Online Advertising Salesforce.com Integrated Marketing Email Marketing Account Management Social Marketing Lead Generation E-commerce SaaS SEO Online Marketing Google Analytics Strategic Partnerships Marketing Strategy PPC Emerging Technologies Emerging Media Strategy Mobile Technology Mobile Applications Start-ups CRM Business Intelligence Blogging Mobile Devices See 20+     See less Social Media Measurement Social Media Marketing Social Media Digital Strategy Mobile Marketing Digital Marketing Analytics Digital Media Web Analytics Interactive Marketing SEM Online Advertising Salesforce.com Integrated Marketing Email Marketing Account Management Social Marketing Lead Generation E-commerce SaaS SEO Online Marketing Google Analytics Strategic Partnerships Marketing Strategy PPC Emerging Technologies Emerging Media Strategy Mobile Technology Mobile Applications Start-ups CRM Business Intelligence Blogging Mobile Devices See 20+     See less Education Providence College 1994  – 1998 Providence College 1994  – 1998 Providence College 1994  – 1998 Providence College 1994  – 1998 ", "Summary Seize années d'expérience en PME et grande entreprise (IBM) \n \nDouble formation Bac +5 siences humaines (master 2 management et organisation à Paris Dauphine, spécialité management, travail et développement social) et école supérieure de commerce (INSEEC paris) \n \n- Animation d'équipe et recrutement \n \n- Lancement de marque, marketing opérationnel et stratégique dans différents pays d'Europe (France, Benelux et Espagne) : marketing direct, publicité, management de l'agence de presse,  \ngestion des événements et des conférences utilisateurs, segmentation et mise en place du mix marketing \n \n- Gestion de budget (environ 400K annuels) \n \n- Développement de partenariats, communication interne et externe pour lancement de projets innovants, lancement d'extranet et de sites webs d'entreprise \n \n- Lancement de programmes partenaires (éditeurs de logiciels), start-ups et développement de l'écosystème des start-ups  \n \n- Développement du channel, segmentation  \n \n- Formations type workshops pour des populations commerciales et management  \n \n- Consultant interne en marketing  Summary Seize années d'expérience en PME et grande entreprise (IBM) \n \nDouble formation Bac +5 siences humaines (master 2 management et organisation à Paris Dauphine, spécialité management, travail et développement social) et école supérieure de commerce (INSEEC paris) \n \n- Animation d'équipe et recrutement \n \n- Lancement de marque, marketing opérationnel et stratégique dans différents pays d'Europe (France, Benelux et Espagne) : marketing direct, publicité, management de l'agence de presse,  \ngestion des événements et des conférences utilisateurs, segmentation et mise en place du mix marketing \n \n- Gestion de budget (environ 400K annuels) \n \n- Développement de partenariats, communication interne et externe pour lancement de projets innovants, lancement d'extranet et de sites webs d'entreprise \n \n- Lancement de programmes partenaires (éditeurs de logiciels), start-ups et développement de l'écosystème des start-ups  \n \n- Développement du channel, segmentation  \n \n- Formations type workshops pour des populations commerciales et management  \n \n- Consultant interne en marketing  Seize années d'expérience en PME et grande entreprise (IBM) \n \nDouble formation Bac +5 siences humaines (master 2 management et organisation à Paris Dauphine, spécialité management, travail et développement social) et école supérieure de commerce (INSEEC paris) \n \n- Animation d'équipe et recrutement \n \n- Lancement de marque, marketing opérationnel et stratégique dans différents pays d'Europe (France, Benelux et Espagne) : marketing direct, publicité, management de l'agence de presse,  \ngestion des événements et des conférences utilisateurs, segmentation et mise en place du mix marketing \n \n- Gestion de budget (environ 400K annuels) \n \n- Développement de partenariats, communication interne et externe pour lancement de projets innovants, lancement d'extranet et de sites webs d'entreprise \n \n- Lancement de programmes partenaires (éditeurs de logiciels), start-ups et développement de l'écosystème des start-ups  \n \n- Développement du channel, segmentation  \n \n- Formations type workshops pour des populations commerciales et management  \n \n- Consultant interne en marketing  Seize années d'expérience en PME et grande entreprise (IBM) \n \nDouble formation Bac +5 siences humaines (master 2 management et organisation à Paris Dauphine, spécialité management, travail et développement social) et école supérieure de commerce (INSEEC paris) \n \n- Animation d'équipe et recrutement \n \n- Lancement de marque, marketing opérationnel et stratégique dans différents pays d'Europe (France, Benelux et Espagne) : marketing direct, publicité, management de l'agence de presse,  \ngestion des événements et des conférences utilisateurs, segmentation et mise en place du mix marketing \n \n- Gestion de budget (environ 400K annuels) \n \n- Développement de partenariats, communication interne et externe pour lancement de projets innovants, lancement d'extranet et de sites webs d'entreprise \n \n- Lancement de programmes partenaires (éditeurs de logiciels), start-ups et développement de l'écosystème des start-ups  \n \n- Développement du channel, segmentation  \n \n- Formations type workshops pour des populations commerciales et management  \n \n- Consultant interne en marketing  Experience Digital strategist IBM France Lab June 2015  – Present (3 months) Bois colombes - Develops and Executes the Geo digital strategy and lead key initiatives to optimize demand for the category on the web. Responsibilities include inbound digital marketing, social media strategy, search programs, paid media, content syndication and nurture streams  \n- Applies analytics to better target, retarget and nurture leads through and “always on” engagement model \n \n Consultant senior, développement de nouveaux marchés IBM France February 2015  – Present (7 months) Bois Colombes - Réalisation d'études et d'interviews pour préconisations en vue de la construction de plans stratégiques pour le comptes de directeurs d'IBM (cible développeurs chez tous types d'entreprises, y compris start-ups) Digital strategist IBM France Lab June 2015  – Present (3 months) Bois colombes - Develops and Executes the Geo digital strategy and lead key initiatives to optimize demand for the category on the web. Responsibilities include inbound digital marketing, social media strategy, search programs, paid media, content syndication and nurture streams  \n- Applies analytics to better target, retarget and nurture leads through and “always on” engagement model \n \n Digital strategist IBM France Lab June 2015  – Present (3 months) Bois colombes - Develops and Executes the Geo digital strategy and lead key initiatives to optimize demand for the category on the web. Responsibilities include inbound digital marketing, social media strategy, search programs, paid media, content syndication and nurture streams  \n- Applies analytics to better target, retarget and nurture leads through and “always on” engagement model \n \n Consultant senior, développement de nouveaux marchés IBM France February 2015  – Present (7 months) Bois Colombes - Réalisation d'études et d'interviews pour préconisations en vue de la construction de plans stratégiques pour le comptes de directeurs d'IBM (cible développeurs chez tous types d'entreprises, y compris start-ups) Consultant senior, développement de nouveaux marchés IBM France February 2015  – Present (7 months) Bois Colombes - Réalisation d'études et d'interviews pour préconisations en vue de la construction de plans stratégiques pour le comptes de directeurs d'IBM (cible développeurs chez tous types d'entreprises, y compris start-ups) Languages English Spanish English Spanish English Spanish Skills Marketing Management Cloud Computing Sales Enablement Management Marketing Strategy Direct Marketing Lead Generation Start-ups Public Relations Enterprise Software Competitive Analysis Multi-channel Marketing Demand Generation Corporate Communications Event Management Advertising Messaging Strategic Partnerships CRM Product Marketing Business Development Advertising Sales Product Launch Social Networking Go-to-market Strategy Leadership Internal Communications Business Alliances Human Resource... Social Sciences Consulting Labour Issues HR Consulting Marketing Strategy Solution Selling Online Marketing Digital Digital Marketing See 24+     See less Skills  Marketing Management Cloud Computing Sales Enablement Management Marketing Strategy Direct Marketing Lead Generation Start-ups Public Relations Enterprise Software Competitive Analysis Multi-channel Marketing Demand Generation Corporate Communications Event Management Advertising Messaging Strategic Partnerships CRM Product Marketing Business Development Advertising Sales Product Launch Social Networking Go-to-market Strategy Leadership Internal Communications Business Alliances Human Resource... Social Sciences Consulting Labour Issues HR Consulting Marketing Strategy Solution Selling Online Marketing Digital Digital Marketing See 24+     See less Marketing Management Cloud Computing Sales Enablement Management Marketing Strategy Direct Marketing Lead Generation Start-ups Public Relations Enterprise Software Competitive Analysis Multi-channel Marketing Demand Generation Corporate Communications Event Management Advertising Messaging Strategic Partnerships CRM Product Marketing Business Development Advertising Sales Product Launch Social Networking Go-to-market Strategy Leadership Internal Communications Business Alliances Human Resource... Social Sciences Consulting Labour Issues HR Consulting Marketing Strategy Solution Selling Online Marketing Digital Digital Marketing See 24+     See less Marketing Management Cloud Computing Sales Enablement Management Marketing Strategy Direct Marketing Lead Generation Start-ups Public Relations Enterprise Software Competitive Analysis Multi-channel Marketing Demand Generation Corporate Communications Event Management Advertising Messaging Strategic Partnerships CRM Product Marketing Business Development Advertising Sales Product Launch Social Networking Go-to-market Strategy Leadership Internal Communications Business Alliances Human Resource... Social Sciences Consulting Labour Issues HR Consulting Marketing Strategy Solution Selling Online Marketing Digital Digital Marketing See 24+     See less Education Universite Paris Dauphine Master's Degree,  Management et organisation , M2 2013  – 2015 - comprendre les enjeux des entreprises et de leurs acteurs en mobilisant les principaux concepts des sciences sociales, \n- analyser les situations en s’appuyant sur des méthodes et des outils éprouvés, \n- intervenir et prescrire en tirant partie de pratiques professionnelles reconnues \n- construire un projet professionnel opératoire. \n \nRéalisation d'une étude appliquée : \n \nLa production, sous la responsabilité d'un tuteur, d'un mémoire. Une formation à la transmission de résultats et à l’intervention. Un regard réflexif portant sur les postures professionnelles. Activities and Societies:  Diagnostic et intervention ,  sociologie des organisations (y compris conduire une enquête sociologique) ,  relations sociales et négociation ,  management ,  gestion ,  ergonomie ,  droit social ,  clinique du travail ,  diversité et interculturel Cegos Cycle 9 jours responsable de la communication,  Communication , General, Digital 2010  – 2010 INSEEC MARKETING,  Business Administration and Management , General 1994  – 1997 INSEEC PARIS Master's Degree,  High Business school 1994  – 1997 University of Roosevelt, Chicago, US Marketing and HR at Roosevelt University - summer session,  Ecole Supérieure de commerce , SUMMER SESSION 1996  – 1996 ISTH (prepa HEC) Economics 1992  – 1994 Universite Paris Dauphine Master's Degree,  Management et organisation , M2 2013  – 2015 - comprendre les enjeux des entreprises et de leurs acteurs en mobilisant les principaux concepts des sciences sociales, \n- analyser les situations en s’appuyant sur des méthodes et des outils éprouvés, \n- intervenir et prescrire en tirant partie de pratiques professionnelles reconnues \n- construire un projet professionnel opératoire. \n \nRéalisation d'une étude appliquée : \n \nLa production, sous la responsabilité d'un tuteur, d'un mémoire. Une formation à la transmission de résultats et à l’intervention. Un regard réflexif portant sur les postures professionnelles. Activities and Societies:  Diagnostic et intervention ,  sociologie des organisations (y compris conduire une enquête sociologique) ,  relations sociales et négociation ,  management ,  gestion ,  ergonomie ,  droit social ,  clinique du travail ,  diversité et interculturel Universite Paris Dauphine Master's Degree,  Management et organisation , M2 2013  – 2015 - comprendre les enjeux des entreprises et de leurs acteurs en mobilisant les principaux concepts des sciences sociales, \n- analyser les situations en s’appuyant sur des méthodes et des outils éprouvés, \n- intervenir et prescrire en tirant partie de pratiques professionnelles reconnues \n- construire un projet professionnel opératoire. \n \nRéalisation d'une étude appliquée : \n \nLa production, sous la responsabilité d'un tuteur, d'un mémoire. Une formation à la transmission de résultats et à l’intervention. Un regard réflexif portant sur les postures professionnelles. Activities and Societies:  Diagnostic et intervention ,  sociologie des organisations (y compris conduire une enquête sociologique) ,  relations sociales et négociation ,  management ,  gestion ,  ergonomie ,  droit social ,  clinique du travail ,  diversité et interculturel Universite Paris Dauphine Master's Degree,  Management et organisation , M2 2013  – 2015 - comprendre les enjeux des entreprises et de leurs acteurs en mobilisant les principaux concepts des sciences sociales, \n- analyser les situations en s’appuyant sur des méthodes et des outils éprouvés, \n- intervenir et prescrire en tirant partie de pratiques professionnelles reconnues \n- construire un projet professionnel opératoire. \n \nRéalisation d'une étude appliquée : \n \nLa production, sous la responsabilité d'un tuteur, d'un mémoire. Une formation à la transmission de résultats et à l’intervention. Un regard réflexif portant sur les postures professionnelles. Activities and Societies:  Diagnostic et intervention ,  sociologie des organisations (y compris conduire une enquête sociologique) ,  relations sociales et négociation ,  management ,  gestion ,  ergonomie ,  droit social ,  clinique du travail ,  diversité et interculturel Cegos Cycle 9 jours responsable de la communication,  Communication , General, Digital 2010  – 2010 Cegos Cycle 9 jours responsable de la communication,  Communication , General, Digital 2010  – 2010 Cegos Cycle 9 jours responsable de la communication,  Communication , General, Digital 2010  – 2010 INSEEC MARKETING,  Business Administration and Management , General 1994  – 1997 INSEEC MARKETING,  Business Administration and Management , General 1994  – 1997 INSEEC MARKETING,  Business Administration and Management , General 1994  – 1997 INSEEC PARIS Master's Degree,  High Business school 1994  – 1997 INSEEC PARIS Master's Degree,  High Business school 1994  – 1997 INSEEC PARIS Master's Degree,  High Business school 1994  – 1997 University of Roosevelt, Chicago, US Marketing and HR at Roosevelt University - summer session,  Ecole Supérieure de commerce , SUMMER SESSION 1996  – 1996 University of Roosevelt, Chicago, US Marketing and HR at Roosevelt University - summer session,  Ecole Supérieure de commerce , SUMMER SESSION 1996  – 1996 University of Roosevelt, Chicago, US Marketing and HR at Roosevelt University - summer session,  Ecole Supérieure de commerce , SUMMER SESSION 1996  – 1996 ISTH (prepa HEC) Economics 1992  – 1994 ISTH (prepa HEC) Economics 1992  – 1994 ISTH (prepa HEC) Economics 1992  – 1994 ", "Skills Content Management Marketing Management Project Management SharePoint Web Content Management Web Analytics Online Advertising Digital Marketing Email Marketing Social Media Marketing SEO Content Strategy Web Project Management Content Development Product Marketing Team Management Operational Efficiency Program Management Corporate Social Media Email Strategy Social Media PPC Marketing Communications E-commerce Newsletters Management Digital Strategy Web Content Analytics Google Analytics B2B Marketing Online Marketing CRM Advertising Marketing Blogging Integrated Marketing CMS User Experience Business Intelligence SEM Multi-channel Marketing Public Relations Interactive Marketing See 29+     See less Skills  Content Management Marketing Management Project Management SharePoint Web Content Management Web Analytics Online Advertising Digital Marketing Email Marketing Social Media Marketing SEO Content Strategy Web Project Management Content Development Product Marketing Team Management Operational Efficiency Program Management Corporate Social Media Email Strategy Social Media PPC Marketing Communications E-commerce Newsletters Management Digital Strategy Web Content Analytics Google Analytics B2B Marketing Online Marketing CRM Advertising Marketing Blogging Integrated Marketing CMS User Experience Business Intelligence SEM Multi-channel Marketing Public Relations Interactive Marketing See 29+     See less Content Management Marketing Management Project Management SharePoint Web Content Management Web Analytics Online Advertising Digital Marketing Email Marketing Social Media Marketing SEO Content Strategy Web Project Management Content Development Product Marketing Team Management Operational Efficiency Program Management Corporate Social Media Email Strategy Social Media PPC Marketing Communications E-commerce Newsletters Management Digital Strategy Web Content Analytics Google Analytics B2B Marketing Online Marketing CRM Advertising Marketing Blogging Integrated Marketing CMS User Experience Business Intelligence SEM Multi-channel Marketing Public Relations Interactive Marketing See 29+     See less Content Management Marketing Management Project Management SharePoint Web Content Management Web Analytics Online Advertising Digital Marketing Email Marketing Social Media Marketing SEO Content Strategy Web Project Management Content Development Product Marketing Team Management Operational Efficiency Program Management Corporate Social Media Email Strategy Social Media PPC Marketing Communications E-commerce Newsletters Management Digital Strategy Web Content Analytics Google Analytics B2B Marketing Online Marketing CRM Advertising Marketing Blogging Integrated Marketing CMS User Experience Business Intelligence SEM Multi-channel Marketing Public Relations Interactive Marketing See 29+     See less ", "Summary Digital marketing strategist with 13 years of proven experience. Leverage a mixed model of innovation, technology, and data analysis to deliver measurable strategies which meet business needs. Strong leader with a history of effective executive/stakeholder management. \n \nSpecialties:  \n•\tDigital marketing strategy \n•\tMobile app development and optimization \n•\tIntegrated search marketing \n•\tweb experience strategy \n•\tsocial media \n•\tmultivariate testing \n•\tPPC strategy \n•\tdemand generation \n•\tweb analytics \n•\tdata analytics \n•\tdirect marketing \n•\tcontent development \n•\tcontent management \n \nTo see some examples of proven successes, please send me a message and I will reply with my resume. Summary Digital marketing strategist with 13 years of proven experience. Leverage a mixed model of innovation, technology, and data analysis to deliver measurable strategies which meet business needs. Strong leader with a history of effective executive/stakeholder management. \n \nSpecialties:  \n•\tDigital marketing strategy \n•\tMobile app development and optimization \n•\tIntegrated search marketing \n•\tweb experience strategy \n•\tsocial media \n•\tmultivariate testing \n•\tPPC strategy \n•\tdemand generation \n•\tweb analytics \n•\tdata analytics \n•\tdirect marketing \n•\tcontent development \n•\tcontent management \n \nTo see some examples of proven successes, please send me a message and I will reply with my resume. Digital marketing strategist with 13 years of proven experience. Leverage a mixed model of innovation, technology, and data analysis to deliver measurable strategies which meet business needs. Strong leader with a history of effective executive/stakeholder management. \n \nSpecialties:  \n•\tDigital marketing strategy \n•\tMobile app development and optimization \n•\tIntegrated search marketing \n•\tweb experience strategy \n•\tsocial media \n•\tmultivariate testing \n•\tPPC strategy \n•\tdemand generation \n•\tweb analytics \n•\tdata analytics \n•\tdirect marketing \n•\tcontent development \n•\tcontent management \n \nTo see some examples of proven successes, please send me a message and I will reply with my resume. Digital marketing strategist with 13 years of proven experience. Leverage a mixed model of innovation, technology, and data analysis to deliver measurable strategies which meet business needs. Strong leader with a history of effective executive/stakeholder management. \n \nSpecialties:  \n•\tDigital marketing strategy \n•\tMobile app development and optimization \n•\tIntegrated search marketing \n•\tweb experience strategy \n•\tsocial media \n•\tmultivariate testing \n•\tPPC strategy \n•\tdemand generation \n•\tweb analytics \n•\tdata analytics \n•\tdirect marketing \n•\tcontent development \n•\tcontent management \n \nTo see some examples of proven successes, please send me a message and I will reply with my resume. Experience Digital Strategist, IBM MobileFirst for iOS IBM April 2015  – Present (5 months) Product Owner, IBM Studios IBM July 2014  –  April 2015  (10 months) Product Owner of two internal mobile apps and websites working in an agile environment.  Vice President, Digital Strategy JPMorgan Chase August 2011  –  April 2014  (2 years 9 months) NY, NY Manager, Integrated Search Marketing Strategy SAP January 2010  –  August 2011  (1 year 8 months) Marketing Strategist, Small and Midsize Enterprise Demand Generation SAP January 2008  –  December 2009  (2 years) Senior Associate, Small and Midsize Enterprise Marketing SAP July 2006  –  December 2007  (1 year 6 months) Marketing Manager Appraisal.com October 2004  –  July 2006  (1 year 10 months) Operations Manager,Traffic Manager, Editor After 50 Publishing 2003  –  2004  (1 year) Traffic Coordinator Buffalo Spree Publishing 2002  –  2003  (1 year) Digital Strategist, IBM MobileFirst for iOS IBM April 2015  – Present (5 months) Digital Strategist, IBM MobileFirst for iOS IBM April 2015  – Present (5 months) Product Owner, IBM Studios IBM July 2014  –  April 2015  (10 months) Product Owner of two internal mobile apps and websites working in an agile environment.  Product Owner, IBM Studios IBM July 2014  –  April 2015  (10 months) Product Owner of two internal mobile apps and websites working in an agile environment.  Vice President, Digital Strategy JPMorgan Chase August 2011  –  April 2014  (2 years 9 months) NY, NY Vice President, Digital Strategy JPMorgan Chase August 2011  –  April 2014  (2 years 9 months) NY, NY Manager, Integrated Search Marketing Strategy SAP January 2010  –  August 2011  (1 year 8 months) Manager, Integrated Search Marketing Strategy SAP January 2010  –  August 2011  (1 year 8 months) Marketing Strategist, Small and Midsize Enterprise Demand Generation SAP January 2008  –  December 2009  (2 years) Marketing Strategist, Small and Midsize Enterprise Demand Generation SAP January 2008  –  December 2009  (2 years) Senior Associate, Small and Midsize Enterprise Marketing SAP July 2006  –  December 2007  (1 year 6 months) Senior Associate, Small and Midsize Enterprise Marketing SAP July 2006  –  December 2007  (1 year 6 months) Marketing Manager Appraisal.com October 2004  –  July 2006  (1 year 10 months) Marketing Manager Appraisal.com October 2004  –  July 2006  (1 year 10 months) Operations Manager,Traffic Manager, Editor After 50 Publishing 2003  –  2004  (1 year) Operations Manager,Traffic Manager, Editor After 50 Publishing 2003  –  2004  (1 year) Traffic Coordinator Buffalo Spree Publishing 2002  –  2003  (1 year) Traffic Coordinator Buffalo Spree Publishing 2002  –  2003  (1 year) Skills Digital Marketing Digital Strategy Agile Application... Web Analytics SEM Strategy PPC Integrated Marketing Management Marketing Direct Marketing Social Media Strategic Partnerships Analytics Marketing Strategy E-commerce Demand Generation Google Adwords Online Marketing Google Analytics Market Research Leadership Content Strategy Advertising Content Management CRM Lead Generation Omniture Online Advertising Mobile Marketing Email Marketing Social Media Marketing Multivariate Testing SEO Web Marketing Enterprise Software Competitive Analysis User Experience Content Development Multi-channel Marketing Product Management Mobile Devices Mobile Applications Adobe Omniture Suite... Google Web Optimizer Adobe Test and Target Partner Marketing PPC Optimization Marketing Communications Project Management See 35+     See less Skills  Digital Marketing Digital Strategy Agile Application... Web Analytics SEM Strategy PPC Integrated Marketing Management Marketing Direct Marketing Social Media Strategic Partnerships Analytics Marketing Strategy E-commerce Demand Generation Google Adwords Online Marketing Google Analytics Market Research Leadership Content Strategy Advertising Content Management CRM Lead Generation Omniture Online Advertising Mobile Marketing Email Marketing Social Media Marketing Multivariate Testing SEO Web Marketing Enterprise Software Competitive Analysis User Experience Content Development Multi-channel Marketing Product Management Mobile Devices Mobile Applications Adobe Omniture Suite... Google Web Optimizer Adobe Test and Target Partner Marketing PPC Optimization Marketing Communications Project Management See 35+     See less Digital Marketing Digital Strategy Agile Application... Web Analytics SEM Strategy PPC Integrated Marketing Management Marketing Direct Marketing Social Media Strategic Partnerships Analytics Marketing Strategy E-commerce Demand Generation Google Adwords Online Marketing Google Analytics Market Research Leadership Content Strategy Advertising Content Management CRM Lead Generation Omniture Online Advertising Mobile Marketing Email Marketing Social Media Marketing Multivariate Testing SEO Web Marketing Enterprise Software Competitive Analysis User Experience Content Development Multi-channel Marketing Product Management Mobile Devices Mobile Applications Adobe Omniture Suite... Google Web Optimizer Adobe Test and Target Partner Marketing PPC Optimization Marketing Communications Project Management See 35+     See less Digital Marketing Digital Strategy Agile Application... Web Analytics SEM Strategy PPC Integrated Marketing Management Marketing Direct Marketing Social Media Strategic Partnerships Analytics Marketing Strategy E-commerce Demand Generation Google Adwords Online Marketing Google Analytics Market Research Leadership Content Strategy Advertising Content Management CRM Lead Generation Omniture Online Advertising Mobile Marketing Email Marketing Social Media Marketing Multivariate Testing SEO Web Marketing Enterprise Software Competitive Analysis User Experience Content Development Multi-channel Marketing Product Management Mobile Devices Mobile Applications Adobe Omniture Suite... Google Web Optimizer Adobe Test and Target Partner Marketing PPC Optimization Marketing Communications Project Management See 35+     See less Education NYU Stern School of Business MBA, 2015 2012  – 2015 University at Buffalo BA,  english , communications, management 1998  – 2002 NYU Stern School of Business MBA, 2015 2012  – 2015 NYU Stern School of Business MBA, 2015 2012  – 2015 NYU Stern School of Business MBA, 2015 2012  – 2015 University at Buffalo BA,  english , communications, management 1998  – 2002 University at Buffalo BA,  english , communications, management 1998  – 2002 University at Buffalo BA,  english , communications, management 1998  – 2002 ", "Summary I work with the IBM North America Enterprise Transformation and Account Focused Marketing teams.  \n \nI specialize in two areas 1. Digital Marketing : I am Extremely passionate about discovering new ways to drive ROI through Digital marketing. 2. Event Execution : Collaborate with our vendors to ensure high rate of engagement and lead conversion at events that are planned and executed.  \n \nSpecialties : Communication, Event Marketing , Digital Marketing, Planning, Execution, Training, opportunity identification, Teaming, leadership, \n \nI enjoy Indian classical Dance, Music, Reading, travelling . Summary I work with the IBM North America Enterprise Transformation and Account Focused Marketing teams.  \n \nI specialize in two areas 1. Digital Marketing : I am Extremely passionate about discovering new ways to drive ROI through Digital marketing. 2. Event Execution : Collaborate with our vendors to ensure high rate of engagement and lead conversion at events that are planned and executed.  \n \nSpecialties : Communication, Event Marketing , Digital Marketing, Planning, Execution, Training, opportunity identification, Teaming, leadership, \n \nI enjoy Indian classical Dance, Music, Reading, travelling . I work with the IBM North America Enterprise Transformation and Account Focused Marketing teams.  \n \nI specialize in two areas 1. Digital Marketing : I am Extremely passionate about discovering new ways to drive ROI through Digital marketing. 2. Event Execution : Collaborate with our vendors to ensure high rate of engagement and lead conversion at events that are planned and executed.  \n \nSpecialties : Communication, Event Marketing , Digital Marketing, Planning, Execution, Training, opportunity identification, Teaming, leadership, \n \nI enjoy Indian classical Dance, Music, Reading, travelling . I work with the IBM North America Enterprise Transformation and Account Focused Marketing teams.  \n \nI specialize in two areas 1. Digital Marketing : I am Extremely passionate about discovering new ways to drive ROI through Digital marketing. 2. Event Execution : Collaborate with our vendors to ensure high rate of engagement and lead conversion at events that are planned and executed.  \n \nSpecialties : Communication, Event Marketing , Digital Marketing, Planning, Execution, Training, opportunity identification, Teaming, leadership, \n \nI enjoy Indian classical Dance, Music, Reading, travelling . Experience Digital Strategist IBM June 2010  – Present (5 years 3 months) Digital Strategy, Planning , Execution. Paid media, Virtual Events, Social media, Vendor Management , Reports, Analysis and Training, Campaign Planner IBM June 2010  –  January 2014  (3 years 8 months) Campaign Management \nWork on end to end campaign planning, management and result analysis. Manage budgets & agency interactions \n \n•\tImplementing an integrated campaign strategy to achieve pipeline and revenue objective. \n•\tCreating quarterly marketing plans in collaboration with Leads and market segment managers.  \n•\tEnable and maintain an environment of strong, ongoing teamwork and collaboration with our agency partners to drive implementation of Content-led marketing, understanding our clients as individuals, to nurture and progress the conversation.  \n•\tDrive strong shift to digital and social by increasing sales/marketing personal eminence and engagement; increase marketing mix to digital within DG execution.  \n• Reporting and Analysis of campaign effectiveness and optimize campaigns to drive better results.  \n•\tMaintain a satisfactory legal and audit-ready business controls posture. \n•\tUtilize marketing automation tools like MEPT, BAT, EST, MFR and Unica ensuring thorough and accurate data, applying the Art of Nurture, to assist in significantly improving responses and lead quality. Ensuring compliance and timely deliver and execution of campaigns using the tools effectively.  \n•\tManage quarterly budgets and funding requests.  \n•\tBuilding a strong lead management plan to help the team improve results. \n•\tAs a SME on various marketing tools. Conduct training and enablement sessions as required.  Marketing Executive Karnataka Chemsyn Ltd 2009  –  2010  (1 year) Bangalore intern IIPM 2007  –  2007  (less than a year) Digital Strategist IBM June 2010  – Present (5 years 3 months) Digital Strategy, Planning , Execution. Paid media, Virtual Events, Social media, Vendor Management , Reports, Analysis and Training, Digital Strategist IBM June 2010  – Present (5 years 3 months) Digital Strategy, Planning , Execution. Paid media, Virtual Events, Social media, Vendor Management , Reports, Analysis and Training, Campaign Planner IBM June 2010  –  January 2014  (3 years 8 months) Campaign Management \nWork on end to end campaign planning, management and result analysis. Manage budgets & agency interactions \n \n•\tImplementing an integrated campaign strategy to achieve pipeline and revenue objective. \n•\tCreating quarterly marketing plans in collaboration with Leads and market segment managers.  \n•\tEnable and maintain an environment of strong, ongoing teamwork and collaboration with our agency partners to drive implementation of Content-led marketing, understanding our clients as individuals, to nurture and progress the conversation.  \n•\tDrive strong shift to digital and social by increasing sales/marketing personal eminence and engagement; increase marketing mix to digital within DG execution.  \n• Reporting and Analysis of campaign effectiveness and optimize campaigns to drive better results.  \n•\tMaintain a satisfactory legal and audit-ready business controls posture. \n•\tUtilize marketing automation tools like MEPT, BAT, EST, MFR and Unica ensuring thorough and accurate data, applying the Art of Nurture, to assist in significantly improving responses and lead quality. Ensuring compliance and timely deliver and execution of campaigns using the tools effectively.  \n•\tManage quarterly budgets and funding requests.  \n•\tBuilding a strong lead management plan to help the team improve results. \n•\tAs a SME on various marketing tools. Conduct training and enablement sessions as required.  Campaign Planner IBM June 2010  –  January 2014  (3 years 8 months) Campaign Management \nWork on end to end campaign planning, management and result analysis. Manage budgets & agency interactions \n \n•\tImplementing an integrated campaign strategy to achieve pipeline and revenue objective. \n•\tCreating quarterly marketing plans in collaboration with Leads and market segment managers.  \n•\tEnable and maintain an environment of strong, ongoing teamwork and collaboration with our agency partners to drive implementation of Content-led marketing, understanding our clients as individuals, to nurture and progress the conversation.  \n•\tDrive strong shift to digital and social by increasing sales/marketing personal eminence and engagement; increase marketing mix to digital within DG execution.  \n• Reporting and Analysis of campaign effectiveness and optimize campaigns to drive better results.  \n•\tMaintain a satisfactory legal and audit-ready business controls posture. \n•\tUtilize marketing automation tools like MEPT, BAT, EST, MFR and Unica ensuring thorough and accurate data, applying the Art of Nurture, to assist in significantly improving responses and lead quality. Ensuring compliance and timely deliver and execution of campaigns using the tools effectively.  \n•\tManage quarterly budgets and funding requests.  \n•\tBuilding a strong lead management plan to help the team improve results. \n•\tAs a SME on various marketing tools. Conduct training and enablement sessions as required.  Marketing Executive Karnataka Chemsyn Ltd 2009  –  2010  (1 year) Bangalore Marketing Executive Karnataka Chemsyn Ltd 2009  –  2010  (1 year) Bangalore intern IIPM 2007  –  2007  (less than a year) intern IIPM 2007  –  2007  (less than a year) Languages Malayalam Tamil Malayalam Tamil Malayalam Tamil Skills Digital Marketing Market Research Lead Generation Marketing Analytics Business Development Marketing Strategy Marketing Communications Marketing Management Direct Marketing Product Marketing Email Marketing Web Analytics Google Analytics Marketing Research Brand Management Negotiation See 2+     See less Skills  Digital Marketing Market Research Lead Generation Marketing Analytics Business Development Marketing Strategy Marketing Communications Marketing Management Direct Marketing Product Marketing Email Marketing Web Analytics Google Analytics Marketing Research Brand Management Negotiation See 2+     See less Digital Marketing Market Research Lead Generation Marketing Analytics Business Development Marketing Strategy Marketing Communications Marketing Management Direct Marketing Product Marketing Email Marketing Web Analytics Google Analytics Marketing Research Brand Management Negotiation See 2+     See less Digital Marketing Market Research Lead Generation Marketing Analytics Business Development Marketing Strategy Marketing Communications Marketing Management Direct Marketing Product Marketing Email Marketing Web Analytics Google Analytics Marketing Research Brand Management Negotiation See 2+     See less Education Indian Institute of Planning and Management PGDBM,  Marketing 2007  – 2009 Dual Specialization in Marketing and HR Activities and Societies:  Debates ,  Cultural events ,  placements. Don Bosco Institute of technology Bachelor of Engineering (B.E.),  Computer Science 2003  – 2007 Computer Science Engineering Activities and Societies:  public speaking and Cultural events. Indian Institute of Planning and Management PGDBM,  Marketing 2007  – 2009 Dual Specialization in Marketing and HR Activities and Societies:  Debates ,  Cultural events ,  placements. Indian Institute of Planning and Management PGDBM,  Marketing 2007  – 2009 Dual Specialization in Marketing and HR Activities and Societies:  Debates ,  Cultural events ,  placements. Indian Institute of Planning and Management PGDBM,  Marketing 2007  – 2009 Dual Specialization in Marketing and HR Activities and Societies:  Debates ,  Cultural events ,  placements. Don Bosco Institute of technology Bachelor of Engineering (B.E.),  Computer Science 2003  – 2007 Computer Science Engineering Activities and Societies:  public speaking and Cultural events. Don Bosco Institute of technology Bachelor of Engineering (B.E.),  Computer Science 2003  – 2007 Computer Science Engineering Activities and Societies:  public speaking and Cultural events. Don Bosco Institute of technology Bachelor of Engineering (B.E.),  Computer Science 2003  – 2007 Computer Science Engineering Activities and Societies:  public speaking and Cultural events. ", "Experience Global Web Operations Manager IBM January 2005  – Present (10 years 8 months) Manage Web production worldwide Global Web Operations Manager - IBM Systems Digital Strategist IBM 1995  – Present (20 years) Global Web Operations Manager IBM January 2005  – Present (10 years 8 months) Manage Web production worldwide Global Web Operations Manager IBM January 2005  – Present (10 years 8 months) Manage Web production worldwide Global Web Operations Manager - IBM Systems Digital Strategist IBM 1995  – Present (20 years) Global Web Operations Manager - IBM Systems Digital Strategist IBM 1995  – Present (20 years) Skills Program Management Digital Marketing Management Leadership Strategy Team Building Product Marketing CRM SaaS Cross-functional Team... Product Management Enterprise Software Lead Generation Cloud Computing Demand Generation Strategic Partnerships Solution Selling See 2+     See less Skills  Program Management Digital Marketing Management Leadership Strategy Team Building Product Marketing CRM SaaS Cross-functional Team... Product Management Enterprise Software Lead Generation Cloud Computing Demand Generation Strategic Partnerships Solution Selling See 2+     See less Program Management Digital Marketing Management Leadership Strategy Team Building Product Marketing CRM SaaS Cross-functional Team... Product Management Enterprise Software Lead Generation Cloud Computing Demand Generation Strategic Partnerships Solution Selling See 2+     See less Program Management Digital Marketing Management Leadership Strategy Team Building Product Marketing CRM SaaS Cross-functional Team... Product Management Enterprise Software Lead Generation Cloud Computing Demand Generation Strategic Partnerships Solution Selling See 2+     See less ", "Summary Digital Marketing, Consulting & Solutions with 11 years of job experience in Search Engine Marketing (SEM), Search Engine Optimization (SEO), Social Media Optimization (SMO), Web Content Audit, Project management, HTML scripting, Email Marketing, Business Development, Online Content Editing, Content Management Systems. \n \nWith hands on Developing and managing digital marketing campaigns, Devising strategies to drive online traffic to the company website, Improving the usability, design, content and conversion of the company website, Evaluating customer research, market conditions and competitor data. Summary Digital Marketing, Consulting & Solutions with 11 years of job experience in Search Engine Marketing (SEM), Search Engine Optimization (SEO), Social Media Optimization (SMO), Web Content Audit, Project management, HTML scripting, Email Marketing, Business Development, Online Content Editing, Content Management Systems. \n \nWith hands on Developing and managing digital marketing campaigns, Devising strategies to drive online traffic to the company website, Improving the usability, design, content and conversion of the company website, Evaluating customer research, market conditions and competitor data. Digital Marketing, Consulting & Solutions with 11 years of job experience in Search Engine Marketing (SEM), Search Engine Optimization (SEO), Social Media Optimization (SMO), Web Content Audit, Project management, HTML scripting, Email Marketing, Business Development, Online Content Editing, Content Management Systems. \n \nWith hands on Developing and managing digital marketing campaigns, Devising strategies to drive online traffic to the company website, Improving the usability, design, content and conversion of the company website, Evaluating customer research, market conditions and competitor data. Digital Marketing, Consulting & Solutions with 11 years of job experience in Search Engine Marketing (SEM), Search Engine Optimization (SEO), Social Media Optimization (SMO), Web Content Audit, Project management, HTML scripting, Email Marketing, Business Development, Online Content Editing, Content Management Systems. \n \nWith hands on Developing and managing digital marketing campaigns, Devising strategies to drive online traffic to the company website, Improving the usability, design, content and conversion of the company website, Evaluating customer research, market conditions and competitor data. Experience Digital Strategist IBM July 2015  – Present (2 months) Bengaluru Area, India Web and Search Consultant IBM October 2009  – Present (5 years 11 months) Bengaluru Area, India Digital Strategist IBM July 2015  – Present (2 months) Bengaluru Area, India Digital Strategist IBM July 2015  – Present (2 months) Bengaluru Area, India Web and Search Consultant IBM October 2009  – Present (5 years 11 months) Bengaluru Area, India Web and Search Consultant IBM October 2009  – Present (5 years 11 months) Bengaluru Area, India Languages   Skills SEO Content Management Social Media Marketing Marketing Editing Social Media Web Content Content Strategy Google Analytics Newsletters Press Releases Copy Editing Digital Marketing SEM Email Marketing Digital Strategy SMO See 2+     See less Skills  SEO Content Management Social Media Marketing Marketing Editing Social Media Web Content Content Strategy Google Analytics Newsletters Press Releases Copy Editing Digital Marketing SEM Email Marketing Digital Strategy SMO See 2+     See less SEO Content Management Social Media Marketing Marketing Editing Social Media Web Content Content Strategy Google Analytics Newsletters Press Releases Copy Editing Digital Marketing SEM Email Marketing Digital Strategy SMO See 2+     See less SEO Content Management Social Media Marketing Marketing Editing Social Media Web Content Content Strategy Google Analytics Newsletters Press Releases Copy Editing Digital Marketing SEM Email Marketing Digital Strategy SMO See 2+     See less Education Makhanlal Chaturvedi Rashtriya Patrakarita Vishwavidhyalaya Master’s Degree,  Public Relations , Advertising, and Applied Communication 2002  – 2004 North-Eastern Hill University Master’s Degree,  English Literature (British and Commonwealth) 2000  – 2002 St. Edmund's College Bachelor’s Degree,  Humanities/Humanistic Studies 1995  – 2000 Makhanlal Chaturvedi Rashtriya Patrakarita Vishwavidhyalaya Master’s Degree,  Public Relations , Advertising, and Applied Communication 2002  – 2004 Makhanlal Chaturvedi Rashtriya Patrakarita Vishwavidhyalaya Master’s Degree,  Public Relations , Advertising, and Applied Communication 2002  – 2004 Makhanlal Chaturvedi Rashtriya Patrakarita Vishwavidhyalaya Master’s Degree,  Public Relations , Advertising, and Applied Communication 2002  – 2004 North-Eastern Hill University Master’s Degree,  English Literature (British and Commonwealth) 2000  – 2002 North-Eastern Hill University Master’s Degree,  English Literature (British and Commonwealth) 2000  – 2002 North-Eastern Hill University Master’s Degree,  English Literature (British and Commonwealth) 2000  – 2002 St. Edmund's College Bachelor’s Degree,  Humanities/Humanistic Studies 1995  – 2000 St. Edmund's College Bachelor’s Degree,  Humanities/Humanistic Studies 1995  – 2000 St. Edmund's College Bachelor’s Degree,  Humanities/Humanistic Studies 1995  – 2000 "]}