{"position": "Digital Analyst", "company": "IBM", "profiles": ["Summary Digital Analyst with extensive experience in marketing within technology, automotive, and healthcare industries. Summary Digital Analyst with extensive experience in marketing within technology, automotive, and healthcare industries. Digital Analyst with extensive experience in marketing within technology, automotive, and healthcare industries. Digital Analyst with extensive experience in marketing within technology, automotive, and healthcare industries. Experience Digital Analyst IBM (CTG) August 2014  – Present (1 year 1 month) Staff Marketing Analyst Qualcomm April 2012  –  June 2014  (2 years 3 months) Greater San Diego Area Senior Analyst & Web Analytics Evangelist Digitaria, a JWT Company September 2011  –  March 2012  (7 months) Greater San Diego Area Web Analytics Manager Toyota (TPG) November 2009  –  October 2011  (2 years) Torrance, CA Web Analyst Kelley Blue Book May 2007  –  November 2009  (2 years 7 months) Irvine, CA Marketing Representative MemorialCare May 2005  –  May 2007  (2 years 1 month) Orange County, California Area Marketing Intern Allergan Pharmaceuticals May 2004  –  September 2004  (5 months) Digital Analyst IBM (CTG) August 2014  – Present (1 year 1 month) Digital Analyst IBM (CTG) August 2014  – Present (1 year 1 month) Staff Marketing Analyst Qualcomm April 2012  –  June 2014  (2 years 3 months) Greater San Diego Area Staff Marketing Analyst Qualcomm April 2012  –  June 2014  (2 years 3 months) Greater San Diego Area Senior Analyst & Web Analytics Evangelist Digitaria, a JWT Company September 2011  –  March 2012  (7 months) Greater San Diego Area Senior Analyst & Web Analytics Evangelist Digitaria, a JWT Company September 2011  –  March 2012  (7 months) Greater San Diego Area Web Analytics Manager Toyota (TPG) November 2009  –  October 2011  (2 years) Torrance, CA Web Analytics Manager Toyota (TPG) November 2009  –  October 2011  (2 years) Torrance, CA Web Analyst Kelley Blue Book May 2007  –  November 2009  (2 years 7 months) Irvine, CA Web Analyst Kelley Blue Book May 2007  –  November 2009  (2 years 7 months) Irvine, CA Marketing Representative MemorialCare May 2005  –  May 2007  (2 years 1 month) Orange County, California Area Marketing Representative MemorialCare May 2005  –  May 2007  (2 years 1 month) Orange County, California Area Marketing Intern Allergan Pharmaceuticals May 2004  –  September 2004  (5 months) Marketing Intern Allergan Pharmaceuticals May 2004  –  September 2004  (5 months) Languages English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Web Analytics Omniture A/B testing Google Analytics Online Marketing SEM Google Adwords Multivariate Testing Conversion Optimization Agile Project Management WebTrends Analytics Marketing Landing Page... SharePoint DoubleClick Site Catalyst Discover Test & Target Photoshop Illustrator Excel Client/Report... Microsoft Office PowerPoint Data Warehousing Interactive Marketing Mobile Marketing User Experience Email Marketing Microsoft Excel Data Warehouse Hitwise (Competitive... Compete (Competitive... Excel Firebug WASP (Debugger) Fiddler Revenue Science NetInsight CrimsonHexagon Simply Measured Facebook Insights APIs Leadership Web Project Management Marketing Analytics Segmentation Social Media Measurement Behavioral Targeting Analytics Data Analysis See 35+     See less Skills  Web Analytics Omniture A/B testing Google Analytics Online Marketing SEM Google Adwords Multivariate Testing Conversion Optimization Agile Project Management WebTrends Analytics Marketing Landing Page... SharePoint DoubleClick Site Catalyst Discover Test & Target Photoshop Illustrator Excel Client/Report... Microsoft Office PowerPoint Data Warehousing Interactive Marketing Mobile Marketing User Experience Email Marketing Microsoft Excel Data Warehouse Hitwise (Competitive... Compete (Competitive... Excel Firebug WASP (Debugger) Fiddler Revenue Science NetInsight CrimsonHexagon Simply Measured Facebook Insights APIs Leadership Web Project Management Marketing Analytics Segmentation Social Media Measurement Behavioral Targeting Analytics Data Analysis See 35+     See less Web Analytics Omniture A/B testing Google Analytics Online Marketing SEM Google Adwords Multivariate Testing Conversion Optimization Agile Project Management WebTrends Analytics Marketing Landing Page... SharePoint DoubleClick Site Catalyst Discover Test & Target Photoshop Illustrator Excel Client/Report... Microsoft Office PowerPoint Data Warehousing Interactive Marketing Mobile Marketing User Experience Email Marketing Microsoft Excel Data Warehouse Hitwise (Competitive... Compete (Competitive... Excel Firebug WASP (Debugger) Fiddler Revenue Science NetInsight CrimsonHexagon Simply Measured Facebook Insights APIs Leadership Web Project Management Marketing Analytics Segmentation Social Media Measurement Behavioral Targeting Analytics Data Analysis See 35+     See less Web Analytics Omniture A/B testing Google Analytics Online Marketing SEM Google Adwords Multivariate Testing Conversion Optimization Agile Project Management WebTrends Analytics Marketing Landing Page... SharePoint DoubleClick Site Catalyst Discover Test & Target Photoshop Illustrator Excel Client/Report... Microsoft Office PowerPoint Data Warehousing Interactive Marketing Mobile Marketing User Experience Email Marketing Microsoft Excel Data Warehouse Hitwise (Competitive... Compete (Competitive... Excel Firebug WASP (Debugger) Fiddler Revenue Science NetInsight CrimsonHexagon Simply Measured Facebook Insights APIs Leadership Web Project Management Marketing Analytics Segmentation Social Media Measurement Behavioral Targeting Analytics Data Analysis See 35+     See less Education California State University-Fullerton BA 2003  – 2005 California State University-Fullerton BA 2003  – 2005 California State University-Fullerton BA 2003  – 2005 California State University-Fullerton BA 2003  – 2005 Honors & Awards Additional Honors & Awards Magna Cum Laude Additional Honors & Awards Magna Cum Laude Additional Honors & Awards Magna Cum Laude Additional Honors & Awards Magna Cum Laude ", "Skills Web Analytics PPC Business Intelligence Email Marketing Omniture SEM A/B testing Web Design E-commerce Social Media Analytics Start-ups Business Development Lead Generation Online Advertising Skills  Web Analytics PPC Business Intelligence Email Marketing Omniture SEM A/B testing Web Design E-commerce Social Media Analytics Start-ups Business Development Lead Generation Online Advertising Web Analytics PPC Business Intelligence Email Marketing Omniture SEM A/B testing Web Design E-commerce Social Media Analytics Start-ups Business Development Lead Generation Online Advertising Web Analytics PPC Business Intelligence Email Marketing Omniture SEM A/B testing Web Design E-commerce Social Media Analytics Start-ups Business Development Lead Generation Online Advertising ", "Languages Spanish Spanish Spanish Skills Google Analytics SEO Information Architecture Content Strategy Usability SEM WordPress Email Marketing Dreamweaver Content Development CSS Agile Methodologies Web Content Web Analytics Web 2.0 Quality Assurance PPC Visio Technical Writing Content Writing Unica UML Analytics Java Eclipse Hibernate Spring SQL E-commerce E-commerce Optimization Conversion Rate... Web Marketing HTML Google Adwords Online Marketing Conversion Optimization See 21+     See less Skills  Google Analytics SEO Information Architecture Content Strategy Usability SEM WordPress Email Marketing Dreamweaver Content Development CSS Agile Methodologies Web Content Web Analytics Web 2.0 Quality Assurance PPC Visio Technical Writing Content Writing Unica UML Analytics Java Eclipse Hibernate Spring SQL E-commerce E-commerce Optimization Conversion Rate... Web Marketing HTML Google Adwords Online Marketing Conversion Optimization See 21+     See less Google Analytics SEO Information Architecture Content Strategy Usability SEM WordPress Email Marketing Dreamweaver Content Development CSS Agile Methodologies Web Content Web Analytics Web 2.0 Quality Assurance PPC Visio Technical Writing Content Writing Unica UML Analytics Java Eclipse Hibernate Spring SQL E-commerce E-commerce Optimization Conversion Rate... Web Marketing HTML Google Adwords Online Marketing Conversion Optimization See 21+     See less Google Analytics SEO Information Architecture Content Strategy Usability SEM WordPress Email Marketing Dreamweaver Content Development CSS Agile Methodologies Web Content Web Analytics Web 2.0 Quality Assurance PPC Visio Technical Writing Content Writing Unica UML Analytics Java Eclipse Hibernate Spring SQL E-commerce E-commerce Optimization Conversion Rate... Web Marketing HTML Google Adwords Online Marketing Conversion Optimization See 21+     See less Honors & Awards ", "Languages English Full professional proficiency German Elementary proficiency English Full professional proficiency German Elementary proficiency English Full professional proficiency German Elementary proficiency Full professional proficiency Elementary proficiency Skills Skills     ", "Experience Owner / Marketer / Online Enthusiast Smart House Marketing January 2010  – Present (5 years 8 months) direct marketing / lead generation for higher education, insurance and more. Digital Analyst IBM 2007  –  November 2009  (2 years) Owner / Marketer / Online Enthusiast Smart House Marketing January 2010  – Present (5 years 8 months) direct marketing / lead generation for higher education, insurance and more. Owner / Marketer / Online Enthusiast Smart House Marketing January 2010  – Present (5 years 8 months) direct marketing / lead generation for higher education, insurance and more. Digital Analyst IBM 2007  –  November 2009  (2 years) Digital Analyst IBM 2007  –  November 2009  (2 years) Skills Analytics Lead Generation Web Analytics Omniture Direct Marketing Skills  Analytics Lead Generation Web Analytics Omniture Direct Marketing Analytics Lead Generation Web Analytics Omniture Direct Marketing Analytics Lead Generation Web Analytics Omniture Direct Marketing Education The University of Texas at Austin Political Science and Government The University of Texas at Austin Political Science and Government The University of Texas at Austin Political Science and Government The University of Texas at Austin Political Science and Government ", "Summary I am an individual that utilizes my strong customer interface skills and proven communications ability along with my academic training in business and marketing.  \n \nSpecialties: Microsoft Office, strong customer interface skills, effective communication \n \nSmall, Steady, & Business Ready! Summary I am an individual that utilizes my strong customer interface skills and proven communications ability along with my academic training in business and marketing.  \n \nSpecialties: Microsoft Office, strong customer interface skills, effective communication \n \nSmall, Steady, & Business Ready! I am an individual that utilizes my strong customer interface skills and proven communications ability along with my academic training in business and marketing.  \n \nSpecialties: Microsoft Office, strong customer interface skills, effective communication \n \nSmall, Steady, & Business Ready! I am an individual that utilizes my strong customer interface skills and proven communications ability along with my academic training in business and marketing.  \n \nSpecialties: Microsoft Office, strong customer interface skills, effective communication \n \nSmall, Steady, & Business Ready! Experience Digital Analyst IBM July 2015  – Present (2 months) Client Services Fieldwork, Inc. March 2015  –  July 2015  (5 months) • Responsible for all administrative duties: answering a multi-line phone, managing e-mail, transferring calls, confirming appointments, checking-in respondents and clients, monitoring shipments, bringing respondents to and from focus group rooms, and paying out respondents. \n• Act as an intermediary link between administration, recruiting, and project management departments. \n• Maintain all aspects of a client’s visit: set-up and clean-up of conference, observation, and lounge rooms for market research projects, printing, food service, transportation arrangements, communication between clients and respondents.  \n• Oversee and preserve confidential client data. \n• Coordinate use of six conference rooms consecutively for market research projects. \n• Supervise audio/visual recording, equipment, and maintenance.  \n• Balance cash and card funding. \n• Maintain Swift database. \n• Cooperate successfully with seasoned market research professionals and a large Client Services team. Customer Care Spealist Humana August 2014  –  January 2015  (6 months) Assisting members to create their ideal experience with educating them on the policy or helping them with questions or concerns along with projects reaching out to members on important policy information. Sales Account Executive Schneider National June 2013  –  July 2014  (1 year 2 months) green bay, wisconsin area Developing and maintain client relationships by providing transportation solutions and excellent customer service in an open office, transactional selling environment. Sales Associate The Limited October 2012  –  May 2013  (8 months) Racine, WI Performing various tasks including greet customers, merchandising displays, customer transactions, freight processing, and maintain customer satisfaction throughout their shopping experience. Merchandising Intern Jockey International, Inc. January 2013  –  January 2013  (1 month) Kenosha, WI Worked an intensive internship in Women's Merchandising department at Jockey's corporate office. Created a marketing template for entire women's intimate product line and participated in the meeting with the executive team reviewing profitability of product line. Review women's intimate competitive scene and evaluate product market success rate of key competitive merchandise items. Impact Team Member Abercrombie & Fitch December 2007  –  January 2012  (4 years 2 months) Broad range of duties for a clothing retailer including training new employees, merchandising displays, customer transactions, inventory, maintain customer satisfaction, etc. Receptionist Cutting Edge March 2009  –  August 2009  (6 months) Coordinate scheduling of appointments, customer calls, promote products and services, maintain reception area, etc. Digital Analyst IBM July 2015  – Present (2 months) Digital Analyst IBM July 2015  – Present (2 months) Client Services Fieldwork, Inc. March 2015  –  July 2015  (5 months) • Responsible for all administrative duties: answering a multi-line phone, managing e-mail, transferring calls, confirming appointments, checking-in respondents and clients, monitoring shipments, bringing respondents to and from focus group rooms, and paying out respondents. \n• Act as an intermediary link between administration, recruiting, and project management departments. \n• Maintain all aspects of a client’s visit: set-up and clean-up of conference, observation, and lounge rooms for market research projects, printing, food service, transportation arrangements, communication between clients and respondents.  \n• Oversee and preserve confidential client data. \n• Coordinate use of six conference rooms consecutively for market research projects. \n• Supervise audio/visual recording, equipment, and maintenance.  \n• Balance cash and card funding. \n• Maintain Swift database. \n• Cooperate successfully with seasoned market research professionals and a large Client Services team. Client Services Fieldwork, Inc. March 2015  –  July 2015  (5 months) • Responsible for all administrative duties: answering a multi-line phone, managing e-mail, transferring calls, confirming appointments, checking-in respondents and clients, monitoring shipments, bringing respondents to and from focus group rooms, and paying out respondents. \n• Act as an intermediary link between administration, recruiting, and project management departments. \n• Maintain all aspects of a client’s visit: set-up and clean-up of conference, observation, and lounge rooms for market research projects, printing, food service, transportation arrangements, communication between clients and respondents.  \n• Oversee and preserve confidential client data. \n• Coordinate use of six conference rooms consecutively for market research projects. \n• Supervise audio/visual recording, equipment, and maintenance.  \n• Balance cash and card funding. \n• Maintain Swift database. \n• Cooperate successfully with seasoned market research professionals and a large Client Services team. Customer Care Spealist Humana August 2014  –  January 2015  (6 months) Assisting members to create their ideal experience with educating them on the policy or helping them with questions or concerns along with projects reaching out to members on important policy information. Customer Care Spealist Humana August 2014  –  January 2015  (6 months) Assisting members to create their ideal experience with educating them on the policy or helping them with questions or concerns along with projects reaching out to members on important policy information. Sales Account Executive Schneider National June 2013  –  July 2014  (1 year 2 months) green bay, wisconsin area Developing and maintain client relationships by providing transportation solutions and excellent customer service in an open office, transactional selling environment. Sales Account Executive Schneider National June 2013  –  July 2014  (1 year 2 months) green bay, wisconsin area Developing and maintain client relationships by providing transportation solutions and excellent customer service in an open office, transactional selling environment. Sales Associate The Limited October 2012  –  May 2013  (8 months) Racine, WI Performing various tasks including greet customers, merchandising displays, customer transactions, freight processing, and maintain customer satisfaction throughout their shopping experience. Sales Associate The Limited October 2012  –  May 2013  (8 months) Racine, WI Performing various tasks including greet customers, merchandising displays, customer transactions, freight processing, and maintain customer satisfaction throughout their shopping experience. Merchandising Intern Jockey International, Inc. January 2013  –  January 2013  (1 month) Kenosha, WI Worked an intensive internship in Women's Merchandising department at Jockey's corporate office. Created a marketing template for entire women's intimate product line and participated in the meeting with the executive team reviewing profitability of product line. Review women's intimate competitive scene and evaluate product market success rate of key competitive merchandise items. Merchandising Intern Jockey International, Inc. January 2013  –  January 2013  (1 month) Kenosha, WI Worked an intensive internship in Women's Merchandising department at Jockey's corporate office. Created a marketing template for entire women's intimate product line and participated in the meeting with the executive team reviewing profitability of product line. Review women's intimate competitive scene and evaluate product market success rate of key competitive merchandise items. Impact Team Member Abercrombie & Fitch December 2007  –  January 2012  (4 years 2 months) Broad range of duties for a clothing retailer including training new employees, merchandising displays, customer transactions, inventory, maintain customer satisfaction, etc. Impact Team Member Abercrombie & Fitch December 2007  –  January 2012  (4 years 2 months) Broad range of duties for a clothing retailer including training new employees, merchandising displays, customer transactions, inventory, maintain customer satisfaction, etc. Receptionist Cutting Edge March 2009  –  August 2009  (6 months) Coordinate scheduling of appointments, customer calls, promote products and services, maintain reception area, etc. Receptionist Cutting Edge March 2009  –  August 2009  (6 months) Coordinate scheduling of appointments, customer calls, promote products and services, maintain reception area, etc. Languages   Skills Microsoft Office Customer Service Social Media public speaking Time Management Close Attention to... Organization Team Leadership Customer Engagement Communication Skills Marketing Customer Experience Skills  Microsoft Office Customer Service Social Media public speaking Time Management Close Attention to... Organization Team Leadership Customer Engagement Communication Skills Marketing Customer Experience Microsoft Office Customer Service Social Media public speaking Time Management Close Attention to... Organization Team Leadership Customer Engagement Communication Skills Marketing Customer Experience Microsoft Office Customer Service Social Media public speaking Time Management Close Attention to... Organization Team Leadership Customer Engagement Communication Skills Marketing Customer Experience Education Carthage College Bachelor of Arts (B.A.),  Marketing & Management 2009  – 2013 Active member of Enactus sophomore through senior year. Held the position of Director of Human Resources in 2011-2012. Organization name switched from SIFE to Enactus in Fall 2012. Selected to Speak at SIFE 2011 Regional and National Competition. Carthage won the Regional Competition award and National Competition recognition in 2011. \nAlso an active member of Pi Sigma Epsilon Business Fraternity freshman through senior year. Held the position of VP of Finance in 2011-2012.  \nWorked for the Student Mailroom freshman through junior year. \n \nGraduated in May 2013 with a dual Bachelor of Arts degree in Marketing and Management along with a minor in Public Relations. Activities and Societies:  Enactus ,  Pi Sigma Epsilon Business Fraternity ,  Women's Tennis Bond University Bachelor of Arts (BA),  Business , Management, Marketing 2012  – 2012 Full semester immersion abroad cultural and educational experience at Bond University in Gold Coast, Australia. Took part in and completed the Bond Scholars Program during the semester. Carthage College Bachelor of Arts (B.A.),  Marketing & Management 2009  – 2013 Active member of Enactus sophomore through senior year. Held the position of Director of Human Resources in 2011-2012. Organization name switched from SIFE to Enactus in Fall 2012. Selected to Speak at SIFE 2011 Regional and National Competition. Carthage won the Regional Competition award and National Competition recognition in 2011. \nAlso an active member of Pi Sigma Epsilon Business Fraternity freshman through senior year. Held the position of VP of Finance in 2011-2012.  \nWorked for the Student Mailroom freshman through junior year. \n \nGraduated in May 2013 with a dual Bachelor of Arts degree in Marketing and Management along with a minor in Public Relations. Activities and Societies:  Enactus ,  Pi Sigma Epsilon Business Fraternity ,  Women's Tennis Carthage College Bachelor of Arts (B.A.),  Marketing & Management 2009  – 2013 Active member of Enactus sophomore through senior year. Held the position of Director of Human Resources in 2011-2012. Organization name switched from SIFE to Enactus in Fall 2012. Selected to Speak at SIFE 2011 Regional and National Competition. Carthage won the Regional Competition award and National Competition recognition in 2011. \nAlso an active member of Pi Sigma Epsilon Business Fraternity freshman through senior year. Held the position of VP of Finance in 2011-2012.  \nWorked for the Student Mailroom freshman through junior year. \n \nGraduated in May 2013 with a dual Bachelor of Arts degree in Marketing and Management along with a minor in Public Relations. Activities and Societies:  Enactus ,  Pi Sigma Epsilon Business Fraternity ,  Women's Tennis Carthage College Bachelor of Arts (B.A.),  Marketing & Management 2009  – 2013 Active member of Enactus sophomore through senior year. Held the position of Director of Human Resources in 2011-2012. Organization name switched from SIFE to Enactus in Fall 2012. Selected to Speak at SIFE 2011 Regional and National Competition. Carthage won the Regional Competition award and National Competition recognition in 2011. \nAlso an active member of Pi Sigma Epsilon Business Fraternity freshman through senior year. Held the position of VP of Finance in 2011-2012.  \nWorked for the Student Mailroom freshman through junior year. \n \nGraduated in May 2013 with a dual Bachelor of Arts degree in Marketing and Management along with a minor in Public Relations. Activities and Societies:  Enactus ,  Pi Sigma Epsilon Business Fraternity ,  Women's Tennis Bond University Bachelor of Arts (BA),  Business , Management, Marketing 2012  – 2012 Full semester immersion abroad cultural and educational experience at Bond University in Gold Coast, Australia. Took part in and completed the Bond Scholars Program during the semester. Bond University Bachelor of Arts (BA),  Business , Management, Marketing 2012  – 2012 Full semester immersion abroad cultural and educational experience at Bond University in Gold Coast, Australia. Took part in and completed the Bond Scholars Program during the semester. Bond University Bachelor of Arts (BA),  Business , Management, Marketing 2012  – 2012 Full semester immersion abroad cultural and educational experience at Bond University in Gold Coast, Australia. Took part in and completed the Bond Scholars Program during the semester. Honors & Awards Additional Honors & Awards Carthage Dean's List 2013 \nBond Scholars Program 2012 \nCarthage Dean's List 2010 Additional Honors & Awards Carthage Dean's List 2013 \nBond Scholars Program 2012 \nCarthage Dean's List 2010 Additional Honors & Awards Carthage Dean's List 2013 \nBond Scholars Program 2012 \nCarthage Dean's List 2010 Additional Honors & Awards Carthage Dean's List 2013 \nBond Scholars Program 2012 \nCarthage Dean's List 2010 ", "Summary I am a Geek Marketer. What is a geek marketer? Sometimes called marketing technologists, geek marketers are cross-trained specialists fluent in both Marketing and IT worlds and bridging them. That's what I do. I use technology to market better. Faster. Smarter. \n \nI am a certified B2B Inbound Marketing Professional proficient in blogging, social media, lead conversion, lead nurturing, and closed-loop analysis. Specialties:Inbound marketing, marketing automation, content management, email marketing, social media, web analytics, SEO/SEM, web development, graphic design, presentation design, public speaking Summary I am a Geek Marketer. What is a geek marketer? Sometimes called marketing technologists, geek marketers are cross-trained specialists fluent in both Marketing and IT worlds and bridging them. That's what I do. I use technology to market better. Faster. Smarter. \n \nI am a certified B2B Inbound Marketing Professional proficient in blogging, social media, lead conversion, lead nurturing, and closed-loop analysis. Specialties:Inbound marketing, marketing automation, content management, email marketing, social media, web analytics, SEO/SEM, web development, graphic design, presentation design, public speaking I am a Geek Marketer. What is a geek marketer? Sometimes called marketing technologists, geek marketers are cross-trained specialists fluent in both Marketing and IT worlds and bridging them. That's what I do. I use technology to market better. Faster. Smarter. \n \nI am a certified B2B Inbound Marketing Professional proficient in blogging, social media, lead conversion, lead nurturing, and closed-loop analysis. Specialties:Inbound marketing, marketing automation, content management, email marketing, social media, web analytics, SEO/SEM, web development, graphic design, presentation design, public speaking I am a Geek Marketer. What is a geek marketer? Sometimes called marketing technologists, geek marketers are cross-trained specialists fluent in both Marketing and IT worlds and bridging them. That's what I do. I use technology to market better. Faster. Smarter. \n \nI am a certified B2B Inbound Marketing Professional proficient in blogging, social media, lead conversion, lead nurturing, and closed-loop analysis. Specialties:Inbound marketing, marketing automation, content management, email marketing, social media, web analytics, SEO/SEM, web development, graphic design, presentation design, public speaking Experience Digital Analyst IBM December 2011  – Present (3 years 9 months) Mentor Analysis Exchange January 2010  – Present (5 years 8 months) Internet Marketing Analyst Ironworks Consulting May 2011  –  November 2011  (7 months) Sr. Communications Technology Specialist Allianz Global Assistance January 2006  –  April 2011  (5 years 4 months) Marketing Manager Xperts, Inc. February 2005  –  May 2005  (4 months) Marketing Specialist PrecisionIR Group July 2002  –  February 2005  (2 years 8 months) Digital Analyst IBM December 2011  – Present (3 years 9 months) Digital Analyst IBM December 2011  – Present (3 years 9 months) Mentor Analysis Exchange January 2010  – Present (5 years 8 months) Mentor Analysis Exchange January 2010  – Present (5 years 8 months) Internet Marketing Analyst Ironworks Consulting May 2011  –  November 2011  (7 months) Internet Marketing Analyst Ironworks Consulting May 2011  –  November 2011  (7 months) Sr. Communications Technology Specialist Allianz Global Assistance January 2006  –  April 2011  (5 years 4 months) Sr. Communications Technology Specialist Allianz Global Assistance January 2006  –  April 2011  (5 years 4 months) Marketing Manager Xperts, Inc. February 2005  –  May 2005  (4 months) Marketing Manager Xperts, Inc. February 2005  –  May 2005  (4 months) Marketing Specialist PrecisionIR Group July 2002  –  February 2005  (2 years 8 months) Marketing Specialist PrecisionIR Group July 2002  –  February 2005  (2 years 8 months) Skills Digital Analytics Web Analytics Inbound Marketing Marketing Automation Online Marketing Email Marketing Web Development Presentation Design Public Speaking Unica Marketing Graphic Design E-commerce B2B B2B Marketing Lead Generation Social Media Social Media Marketing Content Management See 4+     See less Skills  Digital Analytics Web Analytics Inbound Marketing Marketing Automation Online Marketing Email Marketing Web Development Presentation Design Public Speaking Unica Marketing Graphic Design E-commerce B2B B2B Marketing Lead Generation Social Media Social Media Marketing Content Management See 4+     See less Digital Analytics Web Analytics Inbound Marketing Marketing Automation Online Marketing Email Marketing Web Development Presentation Design Public Speaking Unica Marketing Graphic Design E-commerce B2B B2B Marketing Lead Generation Social Media Social Media Marketing Content Management See 4+     See less Digital Analytics Web Analytics Inbound Marketing Marketing Automation Online Marketing Email Marketing Web Development Presentation Design Public Speaking Unica Marketing Graphic Design E-commerce B2B B2B Marketing Lead Generation Social Media Social Media Marketing Content Management See 4+     See less Education Clarkson University MBA 2000  – 2001 Clarkson University BS 1996  – 2000 Clarkson University MBA 2000  – 2001 Clarkson University MBA 2000  – 2001 Clarkson University MBA 2000  – 2001 Clarkson University BS 1996  – 2000 Clarkson University BS 1996  – 2000 Clarkson University BS 1996  – 2000 Honors & Awards ", "Experience Digital Analyst IBM August 2012  – Present (3 years 1 month) Bratislava Digital Analyst IBM August 2012  – Present (3 years 1 month) Bratislava Digital Analyst IBM August 2012  – Present (3 years 1 month) Bratislava Languages English Full professional proficiency Russian Limited working proficiency Czech Professional working proficiency English Full professional proficiency Russian Limited working proficiency Czech Professional working proficiency English Full professional proficiency Russian Limited working proficiency Czech Professional working proficiency Full professional proficiency Limited working proficiency Professional working proficiency Skills Web Analytics Project Management Data Analysis Statistical Data... Big Data Analytics ITIL Business Analysis Skills  Web Analytics Project Management Data Analysis Statistical Data... Big Data Analytics ITIL Business Analysis Web Analytics Project Management Data Analysis Statistical Data... Big Data Analytics ITIL Business Analysis Web Analytics Project Management Data Analysis Statistical Data... Big Data Analytics ITIL Business Analysis Education University of Matej Bell Master's Degree,  Foreign Languages and Literatures , General , European Cultural Studies 2008  – 2012 University of Matej Bell Master's Degree,  Foreign Languages and Literatures , General , European Cultural Studies 2008  – 2012 University of Matej Bell Master's Degree,  Foreign Languages and Literatures , General , European Cultural Studies 2008  – 2012 University of Matej Bell Master's Degree,  Foreign Languages and Literatures , General , European Cultural Studies 2008  – 2012 ", "Experience Digital Analyst IBM September 2011  – Present (4 years) Bratislava, Slovakia Web Analytics, Digital Analytics, Social Media Analytics.  \nSpredfast, Bazaarvoice & Unica NetInsight Tools PhD. studies Comenius University in Bratislava September 2007  –  August 2011  (4 years) Bratislava Research Work, Seismic Data Interpretation, Well Data Interpretation, Teaching Data acquisition & interpretation AG&E January 2003  –  August 2011  (8 years 8 months) Bratislava, Slovakia Digital Analyst IBM September 2011  – Present (4 years) Bratislava, Slovakia Web Analytics, Digital Analytics, Social Media Analytics.  \nSpredfast, Bazaarvoice & Unica NetInsight Tools Digital Analyst IBM September 2011  – Present (4 years) Bratislava, Slovakia Web Analytics, Digital Analytics, Social Media Analytics.  \nSpredfast, Bazaarvoice & Unica NetInsight Tools PhD. studies Comenius University in Bratislava September 2007  –  August 2011  (4 years) Bratislava Research Work, Seismic Data Interpretation, Well Data Interpretation, Teaching PhD. studies Comenius University in Bratislava September 2007  –  August 2011  (4 years) Bratislava Research Work, Seismic Data Interpretation, Well Data Interpretation, Teaching Data acquisition & interpretation AG&E January 2003  –  August 2011  (8 years 8 months) Bratislava, Slovakia Data acquisition & interpretation AG&E January 2003  –  August 2011  (8 years 8 months) Bratislava, Slovakia Languages English English English Skills Web Analytics Analytics Google Analytics Landing Page... SEO Data Analysis Social Media Tableau Paid Search Campaigns Organic Search Unica Microsoft Excel Web Services Digital Marketing Skills  Web Analytics Analytics Google Analytics Landing Page... SEO Data Analysis Social Media Tableau Paid Search Campaigns Organic Search Unica Microsoft Excel Web Services Digital Marketing Web Analytics Analytics Google Analytics Landing Page... SEO Data Analysis Social Media Tableau Paid Search Campaigns Organic Search Unica Microsoft Excel Web Services Digital Marketing Web Analytics Analytics Google Analytics Landing Page... SEO Data Analysis Social Media Tableau Paid Search Campaigns Organic Search Unica Microsoft Excel Web Services Digital Marketing Education Comenius University in Bratislava Ph.D.,  Basin Analysis , Sequence Stratigraphy 2007  – 2013 Comenius University in Bratislava MSc.,  Geology 2002  – 2007 Comenius University in Bratislava Ph.D.,  Basin Analysis , Sequence Stratigraphy 2007  – 2013 Comenius University in Bratislava Ph.D.,  Basin Analysis , Sequence Stratigraphy 2007  – 2013 Comenius University in Bratislava Ph.D.,  Basin Analysis , Sequence Stratigraphy 2007  – 2013 Comenius University in Bratislava MSc.,  Geology 2002  – 2007 Comenius University in Bratislava MSc.,  Geology 2002  – 2007 Comenius University in Bratislava MSc.,  Geology 2002  – 2007 ", "Experience Sr. Digital Analyst IBM November 2010  – Present (4 years 10 months) Web Analytics Manager Elsevier May 2007  –  October 2010  (3 years 6 months) Web Analytics Consultant Coremetrics April 2006  –  April 2007  (1 year 1 month) Web Analytics Consultant IBM May 2001  –  March 2006  (4 years 11 months) Materials & Processes Engineer Lockheed Martin 1994  –  1999  (5 years) Structural Engineer LTV 1989  –  1993  (4 years) Sr. Digital Analyst IBM November 2010  – Present (4 years 10 months) Sr. Digital Analyst IBM November 2010  – Present (4 years 10 months) Web Analytics Manager Elsevier May 2007  –  October 2010  (3 years 6 months) Web Analytics Manager Elsevier May 2007  –  October 2010  (3 years 6 months) Web Analytics Consultant Coremetrics April 2006  –  April 2007  (1 year 1 month) Web Analytics Consultant Coremetrics April 2006  –  April 2007  (1 year 1 month) Web Analytics Consultant IBM May 2001  –  March 2006  (4 years 11 months) Web Analytics Consultant IBM May 2001  –  March 2006  (4 years 11 months) Materials & Processes Engineer Lockheed Martin 1994  –  1999  (5 years) Materials & Processes Engineer Lockheed Martin 1994  –  1999  (5 years) Structural Engineer LTV 1989  –  1993  (4 years) Structural Engineer LTV 1989  –  1993  (4 years) Skills Google Analytics Web Analytics Analytics Analysis Leadership Website Development SEM User Experience E-commerce Strategic Planning SEO Unix Linux Regular Expressions Data Analysis CRM Digital Marketing See 2+     See less Skills  Google Analytics Web Analytics Analytics Analysis Leadership Website Development SEM User Experience E-commerce Strategic Planning SEO Unix Linux Regular Expressions Data Analysis CRM Digital Marketing See 2+     See less Google Analytics Web Analytics Analytics Analysis Leadership Website Development SEM User Experience E-commerce Strategic Planning SEO Unix Linux Regular Expressions Data Analysis CRM Digital Marketing See 2+     See less Google Analytics Web Analytics Analytics Analysis Leadership Website Development SEM User Experience E-commerce Strategic Planning SEO Unix Linux Regular Expressions Data Analysis CRM Digital Marketing See 2+     See less Education University of North Texas MBA 2000  – 2002 Purdue University BS 1985  – 1988 University of North Texas MBA 2000  – 2002 University of North Texas MBA 2000  – 2002 University of North Texas MBA 2000  – 2002 Purdue University BS 1985  – 1988 Purdue University BS 1985  – 1988 Purdue University BS 1985  – 1988 ", "Summary With a BComm in Marketing and more than eight-year experience in online marketing, I'm a passionate Digital Marketing professional, dedicated to understand each business and provide the best way for advertising and improvement of their interactive marketing.  \nI believe in the power of Internet. I work to take advantage of this! \n \nEspecialidades: Digital Marketing, Web Analytics, Project Management, Campaign Strategy. Summary With a BComm in Marketing and more than eight-year experience in online marketing, I'm a passionate Digital Marketing professional, dedicated to understand each business and provide the best way for advertising and improvement of their interactive marketing.  \nI believe in the power of Internet. I work to take advantage of this! \n \nEspecialidades: Digital Marketing, Web Analytics, Project Management, Campaign Strategy. With a BComm in Marketing and more than eight-year experience in online marketing, I'm a passionate Digital Marketing professional, dedicated to understand each business and provide the best way for advertising and improvement of their interactive marketing.  \nI believe in the power of Internet. I work to take advantage of this! \n \nEspecialidades: Digital Marketing, Web Analytics, Project Management, Campaign Strategy. With a BComm in Marketing and more than eight-year experience in online marketing, I'm a passionate Digital Marketing professional, dedicated to understand each business and provide the best way for advertising and improvement of their interactive marketing.  \nI believe in the power of Internet. I work to take advantage of this! \n \nEspecialidades: Digital Marketing, Web Analytics, Project Management, Campaign Strategy. Experience Global Digital Analyst IBM October 2013  – Present (1 year 11 months) Mexico City Area, Mexico 1.\tDeliver top quality analytics and create high sponsor satisfaction \n2.\tDevelop higher value offerings including: \n–\tDefining KPI's and metrics strategy \n–\tInterpreting measurement results \n–\tEnd-to-end reporting covering demand generation, web, registrations and leads \n3.\tDrive efficiencies within the team with reusable assets and report generation tools \n4.\tIncrease the number of cross-offerings engagements \n5.\tMaintain strong business controls Latin America Digital Execution Specialist IBM April 2010  –  September 2013  (3 years 6 months) Buenos Aires, Argentina Create and support Digital Selling Kits for products to give the Sales Teams tools for improving and identifying new clients. \nLead and coordinate digital marketing strategy for: Mid-market sites in Latin America Region (web sites aimed for business solutions) and Geographic Expansion sites in Spanish South America (IBM coverage strategy for Growth Markets). \nCreate and deliver SEO, SEM and Banner strategies and carry out interactive marketing best practices. \nManage interactive projects for improving user experience: implement Chat Online, internal search tool, Content Management System, look & feel migrations. \nGenerate synergy with all programs and tactics by integrating with other brand sites. \nCreate the management system, coordinating Sales, Marketing and Demand Generation teams. \nAlign online and offline communications of these sites with the web strategy. \nManage Web Marketing budget and achieve expense plan. \nAnalyze web metrics for identifying trends and visitors behaviour, using web analytics suite. \n \n \nAchievements \nIncreased visitors in 18% through mid-market sites and 15% through Geographic Expansion sites this running year compared to previous year.  \nCustomer contact increment reached 117% through Chat Online in only one month after deployment. \nObtained better commitment of all stakeholders in the region, improving the quality of information by keeping an organized schedule of meetings and requirements. \nProvided 10% savings by implementing a new tool. With this budget new Digital Tools were deployed. Spanish South America General Business Web Marketing Specialist IBM April 2009  –  April 2010  (1 year 1 month) Buenos Aires, Argentina Execute mid-market web content updates, prepare drive to web campaigns and upload solutions catalog. \nCreate and deliver SEO and SEM strategies and carry out interactive marketing best practices. \nManage interactive projects for improving user experience: implement Virtual Assistant of Solutions. \nAnalyze web metrics for identifying trends and visitors behaviour, using web analytics suite. \n \n \nAchievements \nThe number of mid-market sites’ visitors increased 27% from 2009 to 2010. \nLaunch a successful SEM and banner Campaign. Investment grew up to 50%. Marketing Head Nivel Uno August 2008  –  March 2009  (8 months) Buenos Aires, Argentina Lead and plan Marketing Campaigns:  \nSEO and SEM implementation. \ne-mail marketing campaigns. \nBrochures and personal cards. \nUpdate the web content to apply marketing strategies. \nUpdate database using CRM suite. \nSearch potential clients. \nAnalyze web metrics, using Google Anaylitcs. \nLead Marketing online and Corporate Identity consultancy to different kind of companies. Web Marketing Analyst Sony August 2007  –  July 2008  (1 year) Buenos Aires, Argentina Maintenance product catalog in e-commerce site using a content management system (ATG Control Center). \nMaintain payment installments rules. \nUpdate content in corporate site. Receptionist and sales assistant (Internship) Runco S.A. May 2007  –  July 2007  (3 months) Buenos Aires, Argentina • Call center. \n• Preparation of sales budgets. \n• Update database. Global Digital Analyst IBM October 2013  – Present (1 year 11 months) Mexico City Area, Mexico 1.\tDeliver top quality analytics and create high sponsor satisfaction \n2.\tDevelop higher value offerings including: \n–\tDefining KPI's and metrics strategy \n–\tInterpreting measurement results \n–\tEnd-to-end reporting covering demand generation, web, registrations and leads \n3.\tDrive efficiencies within the team with reusable assets and report generation tools \n4.\tIncrease the number of cross-offerings engagements \n5.\tMaintain strong business controls Global Digital Analyst IBM October 2013  – Present (1 year 11 months) Mexico City Area, Mexico 1.\tDeliver top quality analytics and create high sponsor satisfaction \n2.\tDevelop higher value offerings including: \n–\tDefining KPI's and metrics strategy \n–\tInterpreting measurement results \n–\tEnd-to-end reporting covering demand generation, web, registrations and leads \n3.\tDrive efficiencies within the team with reusable assets and report generation tools \n4.\tIncrease the number of cross-offerings engagements \n5.\tMaintain strong business controls Latin America Digital Execution Specialist IBM April 2010  –  September 2013  (3 years 6 months) Buenos Aires, Argentina Create and support Digital Selling Kits for products to give the Sales Teams tools for improving and identifying new clients. \nLead and coordinate digital marketing strategy for: Mid-market sites in Latin America Region (web sites aimed for business solutions) and Geographic Expansion sites in Spanish South America (IBM coverage strategy for Growth Markets). \nCreate and deliver SEO, SEM and Banner strategies and carry out interactive marketing best practices. \nManage interactive projects for improving user experience: implement Chat Online, internal search tool, Content Management System, look & feel migrations. \nGenerate synergy with all programs and tactics by integrating with other brand sites. \nCreate the management system, coordinating Sales, Marketing and Demand Generation teams. \nAlign online and offline communications of these sites with the web strategy. \nManage Web Marketing budget and achieve expense plan. \nAnalyze web metrics for identifying trends and visitors behaviour, using web analytics suite. \n \n \nAchievements \nIncreased visitors in 18% through mid-market sites and 15% through Geographic Expansion sites this running year compared to previous year.  \nCustomer contact increment reached 117% through Chat Online in only one month after deployment. \nObtained better commitment of all stakeholders in the region, improving the quality of information by keeping an organized schedule of meetings and requirements. \nProvided 10% savings by implementing a new tool. With this budget new Digital Tools were deployed. Latin America Digital Execution Specialist IBM April 2010  –  September 2013  (3 years 6 months) Buenos Aires, Argentina Create and support Digital Selling Kits for products to give the Sales Teams tools for improving and identifying new clients. \nLead and coordinate digital marketing strategy for: Mid-market sites in Latin America Region (web sites aimed for business solutions) and Geographic Expansion sites in Spanish South America (IBM coverage strategy for Growth Markets). \nCreate and deliver SEO, SEM and Banner strategies and carry out interactive marketing best practices. \nManage interactive projects for improving user experience: implement Chat Online, internal search tool, Content Management System, look & feel migrations. \nGenerate synergy with all programs and tactics by integrating with other brand sites. \nCreate the management system, coordinating Sales, Marketing and Demand Generation teams. \nAlign online and offline communications of these sites with the web strategy. \nManage Web Marketing budget and achieve expense plan. \nAnalyze web metrics for identifying trends and visitors behaviour, using web analytics suite. \n \n \nAchievements \nIncreased visitors in 18% through mid-market sites and 15% through Geographic Expansion sites this running year compared to previous year.  \nCustomer contact increment reached 117% through Chat Online in only one month after deployment. \nObtained better commitment of all stakeholders in the region, improving the quality of information by keeping an organized schedule of meetings and requirements. \nProvided 10% savings by implementing a new tool. With this budget new Digital Tools were deployed. Spanish South America General Business Web Marketing Specialist IBM April 2009  –  April 2010  (1 year 1 month) Buenos Aires, Argentina Execute mid-market web content updates, prepare drive to web campaigns and upload solutions catalog. \nCreate and deliver SEO and SEM strategies and carry out interactive marketing best practices. \nManage interactive projects for improving user experience: implement Virtual Assistant of Solutions. \nAnalyze web metrics for identifying trends and visitors behaviour, using web analytics suite. \n \n \nAchievements \nThe number of mid-market sites’ visitors increased 27% from 2009 to 2010. \nLaunch a successful SEM and banner Campaign. Investment grew up to 50%. Spanish South America General Business Web Marketing Specialist IBM April 2009  –  April 2010  (1 year 1 month) Buenos Aires, Argentina Execute mid-market web content updates, prepare drive to web campaigns and upload solutions catalog. \nCreate and deliver SEO and SEM strategies and carry out interactive marketing best practices. \nManage interactive projects for improving user experience: implement Virtual Assistant of Solutions. \nAnalyze web metrics for identifying trends and visitors behaviour, using web analytics suite. \n \n \nAchievements \nThe number of mid-market sites’ visitors increased 27% from 2009 to 2010. \nLaunch a successful SEM and banner Campaign. Investment grew up to 50%. Marketing Head Nivel Uno August 2008  –  March 2009  (8 months) Buenos Aires, Argentina Lead and plan Marketing Campaigns:  \nSEO and SEM implementation. \ne-mail marketing campaigns. \nBrochures and personal cards. \nUpdate the web content to apply marketing strategies. \nUpdate database using CRM suite. \nSearch potential clients. \nAnalyze web metrics, using Google Anaylitcs. \nLead Marketing online and Corporate Identity consultancy to different kind of companies. Marketing Head Nivel Uno August 2008  –  March 2009  (8 months) Buenos Aires, Argentina Lead and plan Marketing Campaigns:  \nSEO and SEM implementation. \ne-mail marketing campaigns. \nBrochures and personal cards. \nUpdate the web content to apply marketing strategies. \nUpdate database using CRM suite. \nSearch potential clients. \nAnalyze web metrics, using Google Anaylitcs. \nLead Marketing online and Corporate Identity consultancy to different kind of companies. Web Marketing Analyst Sony August 2007  –  July 2008  (1 year) Buenos Aires, Argentina Maintenance product catalog in e-commerce site using a content management system (ATG Control Center). \nMaintain payment installments rules. \nUpdate content in corporate site. Web Marketing Analyst Sony August 2007  –  July 2008  (1 year) Buenos Aires, Argentina Maintenance product catalog in e-commerce site using a content management system (ATG Control Center). \nMaintain payment installments rules. \nUpdate content in corporate site. Receptionist and sales assistant (Internship) Runco S.A. May 2007  –  July 2007  (3 months) Buenos Aires, Argentina • Call center. \n• Preparation of sales budgets. \n• Update database. Receptionist and sales assistant (Internship) Runco S.A. May 2007  –  July 2007  (3 months) Buenos Aires, Argentina • Call center. \n• Preparation of sales budgets. \n• Update database. Languages English Full professional proficiency Portuguese Limited working proficiency Spanish Native or bilingual proficiency English Full professional proficiency Portuguese Limited working proficiency Spanish Native or bilingual proficiency English Full professional proficiency Portuguese Limited working proficiency Spanish Native or bilingual proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Skills Digital Marketing Web Analytics Online Marketing SEO Web Project Management Metrics E-commerce Traffic Generation SEM Unica Metrics Reporting Leadership Lead Generation Interactive Marketing Email Marketing Marketing Communications Web Marketing Marketing digital Estrategia de... Search Engine Marketing User Experience Strategy Spanish Google Analytics Analytics Marketing Management Digital Media Marketing Online Advertising Content Management Marketing Strategy Project Management Demand Generation Web 2.0 Digital Strategy Mercadotecnia Marketing en Internet Análisis web Marketing en motores de... Optimización en... Tableau Microsoft Excel Estrategia digital See 28+     See less Skills  Digital Marketing Web Analytics Online Marketing SEO Web Project Management Metrics E-commerce Traffic Generation SEM Unica Metrics Reporting Leadership Lead Generation Interactive Marketing Email Marketing Marketing Communications Web Marketing Marketing digital Estrategia de... Search Engine Marketing User Experience Strategy Spanish Google Analytics Analytics Marketing Management Digital Media Marketing Online Advertising Content Management Marketing Strategy Project Management Demand Generation Web 2.0 Digital Strategy Mercadotecnia Marketing en Internet Análisis web Marketing en motores de... Optimización en... Tableau Microsoft Excel Estrategia digital See 28+     See less Digital Marketing Web Analytics Online Marketing SEO Web Project Management Metrics E-commerce Traffic Generation SEM Unica Metrics Reporting Leadership Lead Generation Interactive Marketing Email Marketing Marketing Communications Web Marketing Marketing digital Estrategia de... Search Engine Marketing User Experience Strategy Spanish Google Analytics Analytics Marketing Management Digital Media Marketing Online Advertising Content Management Marketing Strategy Project Management Demand Generation Web 2.0 Digital Strategy Mercadotecnia Marketing en Internet Análisis web Marketing en motores de... Optimización en... Tableau Microsoft Excel Estrategia digital See 28+     See less Digital Marketing Web Analytics Online Marketing SEO Web Project Management Metrics E-commerce Traffic Generation SEM Unica Metrics Reporting Leadership Lead Generation Interactive Marketing Email Marketing Marketing Communications Web Marketing Marketing digital Estrategia de... Search Engine Marketing User Experience Strategy Spanish Google Analytics Analytics Marketing Management Digital Media Marketing Online Advertising Content Management Marketing Strategy Project Management Demand Generation Web 2.0 Digital Strategy Mercadotecnia Marketing en Internet Análisis web Marketing en motores de... Optimización en... Tableau Microsoft Excel Estrategia digital See 28+     See less Education Universidad Argentina de la Empresa Degree,  BCom Marketing 2006  – 2010 Universidad Argentina de la Empresa Licentiate degree, Marketing,  Marketing 2006  – 2010 Universidad Argentina de la Empresa Degree,  BCom Marketing 2006  – 2010 Universidad Argentina de la Empresa Degree,  BCom Marketing 2006  – 2010 Universidad Argentina de la Empresa Degree,  BCom Marketing 2006  – 2010 Universidad Argentina de la Empresa Licentiate degree, Marketing,  Marketing 2006  – 2010 Universidad Argentina de la Empresa Licentiate degree, Marketing,  Marketing 2006  – 2010 Universidad Argentina de la Empresa Licentiate degree, Marketing,  Marketing 2006  – 2010 "]}