{"position": "Director of Marketing", "company": "Intel Corporation", "profiles": ["Skills IC Skills  IC IC IC ", "Skills Product Marketing Product Management Marketing Strategy New Business Development Start-ups Strategy Product Development Business Development Program Management Telecommunications Product Launch Strategic Planning Online Marketing Lead Generation Management Marketing See 1+     See less Skills  Product Marketing Product Management Marketing Strategy New Business Development Start-ups Strategy Product Development Business Development Program Management Telecommunications Product Launch Strategic Planning Online Marketing Lead Generation Management Marketing See 1+     See less Product Marketing Product Management Marketing Strategy New Business Development Start-ups Strategy Product Development Business Development Program Management Telecommunications Product Launch Strategic Planning Online Marketing Lead Generation Management Marketing See 1+     See less Product Marketing Product Management Marketing Strategy New Business Development Start-ups Strategy Product Development Business Development Program Management Telecommunications Product Launch Strategic Planning Online Marketing Lead Generation Management Marketing See 1+     See less ", "Skills Go-to-market Strategy Semiconductors Product Marketing Product Management Intel Strategic Partnerships Embedded Systems Cloud Computing ASIC Business Alliances SoC Processors Computer Architecture Competitive Analysis Skills  Go-to-market Strategy Semiconductors Product Marketing Product Management Intel Strategic Partnerships Embedded Systems Cloud Computing ASIC Business Alliances SoC Processors Computer Architecture Competitive Analysis Go-to-market Strategy Semiconductors Product Marketing Product Management Intel Strategic Partnerships Embedded Systems Cloud Computing ASIC Business Alliances SoC Processors Computer Architecture Competitive Analysis Go-to-market Strategy Semiconductors Product Marketing Product Management Intel Strategic Partnerships Embedded Systems Cloud Computing ASIC Business Alliances SoC Processors Computer Architecture Competitive Analysis ", "Skills Line Management Product Life Cycle Value Propositions Low-power Design Semiconductors Product Marketing Go-to-market Strategy Product Management Product Planning Wireless Cross-functional Team... Product Launch Gesture Recognition Speech Technology Engineering Management Strategy Strategic Partnerships Competitive Analysis SaaS SoC Intel Project Management Product Development CRM Management Processors Technical Marketing Mobile Applications Product Lifecycle... Mobile Devices ASIC Embedded Systems Mobile Technology Segmentation User Experience See 20+     See less Skills  Line Management Product Life Cycle Value Propositions Low-power Design Semiconductors Product Marketing Go-to-market Strategy Product Management Product Planning Wireless Cross-functional Team... Product Launch Gesture Recognition Speech Technology Engineering Management Strategy Strategic Partnerships Competitive Analysis SaaS SoC Intel Project Management Product Development CRM Management Processors Technical Marketing Mobile Applications Product Lifecycle... Mobile Devices ASIC Embedded Systems Mobile Technology Segmentation User Experience See 20+     See less Line Management Product Life Cycle Value Propositions Low-power Design Semiconductors Product Marketing Go-to-market Strategy Product Management Product Planning Wireless Cross-functional Team... Product Launch Gesture Recognition Speech Technology Engineering Management Strategy Strategic Partnerships Competitive Analysis SaaS SoC Intel Project Management Product Development CRM Management Processors Technical Marketing Mobile Applications Product Lifecycle... Mobile Devices ASIC Embedded Systems Mobile Technology Segmentation User Experience See 20+     See less Line Management Product Life Cycle Value Propositions Low-power Design Semiconductors Product Marketing Go-to-market Strategy Product Management Product Planning Wireless Cross-functional Team... Product Launch Gesture Recognition Speech Technology Engineering Management Strategy Strategic Partnerships Competitive Analysis SaaS SoC Intel Project Management Product Development CRM Management Processors Technical Marketing Mobile Applications Product Lifecycle... Mobile Devices ASIC Embedded Systems Mobile Technology Segmentation User Experience See 20+     See less Honors & Awards ", "Skills Go-to-market Strategy Product Management Product Marketing Cross-functional Team... Semiconductors Competitive Analysis Product Launch Strategic Partnerships Strategy Product Development Business Strategy Start-ups Wireless Program Management Business Development Skills  Go-to-market Strategy Product Management Product Marketing Cross-functional Team... Semiconductors Competitive Analysis Product Launch Strategic Partnerships Strategy Product Development Business Strategy Start-ups Wireless Program Management Business Development Go-to-market Strategy Product Management Product Marketing Cross-functional Team... Semiconductors Competitive Analysis Product Launch Strategic Partnerships Strategy Product Development Business Strategy Start-ups Wireless Program Management Business Development Go-to-market Strategy Product Management Product Marketing Cross-functional Team... Semiconductors Competitive Analysis Product Launch Strategic Partnerships Strategy Product Development Business Strategy Start-ups Wireless Program Management Business Development ", "Summary I possess over 20 years of high technology, executive level general management, marketing and business development experience preceded by 5 years of international strategic management consulting experience. I have significant international business and multi-national team management experience with emphasis on China, Europe and Japan. I am motivated by the challenges associated with trail blazing into new areas, engaging new customers, building up or turning around an organization, and doing things “we haven’t done before”. I bring a strong track record as a strategic thinker and leader who can deliver results, an excellent marketer, and a quick study for new high technology markets. My experience spans many markets including the semiconductor, PC, high performance computing, data storage, handheld device, automotive electronics, set top box, software, online web services, wired & wireless communications systems, and display markets. My email: RVV1 at PACBELL dot NET. Specialties:Managing corporate marketing & product marketing teams, P&L management, starting up & incubating new ventures within a corporate environment, assessing/entering new markets, spinning out new companies, aligning/building ecosystems, strategic marketing/planning, developing new products, building brands, negotiating/closing business development deals, increasing organizational efficiency/effectiveness, building/coaching teams, serving as a company spokesperson to the press and at industry forums. Summary I possess over 20 years of high technology, executive level general management, marketing and business development experience preceded by 5 years of international strategic management consulting experience. I have significant international business and multi-national team management experience with emphasis on China, Europe and Japan. I am motivated by the challenges associated with trail blazing into new areas, engaging new customers, building up or turning around an organization, and doing things “we haven’t done before”. I bring a strong track record as a strategic thinker and leader who can deliver results, an excellent marketer, and a quick study for new high technology markets. My experience spans many markets including the semiconductor, PC, high performance computing, data storage, handheld device, automotive electronics, set top box, software, online web services, wired & wireless communications systems, and display markets. My email: RVV1 at PACBELL dot NET. Specialties:Managing corporate marketing & product marketing teams, P&L management, starting up & incubating new ventures within a corporate environment, assessing/entering new markets, spinning out new companies, aligning/building ecosystems, strategic marketing/planning, developing new products, building brands, negotiating/closing business development deals, increasing organizational efficiency/effectiveness, building/coaching teams, serving as a company spokesperson to the press and at industry forums. I possess over 20 years of high technology, executive level general management, marketing and business development experience preceded by 5 years of international strategic management consulting experience. I have significant international business and multi-national team management experience with emphasis on China, Europe and Japan. I am motivated by the challenges associated with trail blazing into new areas, engaging new customers, building up or turning around an organization, and doing things “we haven’t done before”. I bring a strong track record as a strategic thinker and leader who can deliver results, an excellent marketer, and a quick study for new high technology markets. My experience spans many markets including the semiconductor, PC, high performance computing, data storage, handheld device, automotive electronics, set top box, software, online web services, wired & wireless communications systems, and display markets. My email: RVV1 at PACBELL dot NET. Specialties:Managing corporate marketing & product marketing teams, P&L management, starting up & incubating new ventures within a corporate environment, assessing/entering new markets, spinning out new companies, aligning/building ecosystems, strategic marketing/planning, developing new products, building brands, negotiating/closing business development deals, increasing organizational efficiency/effectiveness, building/coaching teams, serving as a company spokesperson to the press and at industry forums. I possess over 20 years of high technology, executive level general management, marketing and business development experience preceded by 5 years of international strategic management consulting experience. I have significant international business and multi-national team management experience with emphasis on China, Europe and Japan. I am motivated by the challenges associated with trail blazing into new areas, engaging new customers, building up or turning around an organization, and doing things “we haven’t done before”. I bring a strong track record as a strategic thinker and leader who can deliver results, an excellent marketer, and a quick study for new high technology markets. My experience spans many markets including the semiconductor, PC, high performance computing, data storage, handheld device, automotive electronics, set top box, software, online web services, wired & wireless communications systems, and display markets. My email: RVV1 at PACBELL dot NET. Specialties:Managing corporate marketing & product marketing teams, P&L management, starting up & incubating new ventures within a corporate environment, assessing/entering new markets, spinning out new companies, aligning/building ecosystems, strategic marketing/planning, developing new products, building brands, negotiating/closing business development deals, increasing organizational efficiency/effectiveness, building/coaching teams, serving as a company spokesperson to the press and at industry forums. Experience President & Founder RVV Associates July 2007  – Present (8 years 2 months) Business advisor to established companies seeking to accelerate internal innovation, and incubating new venture initiatives that may lead to new business lines, or new company spin outs. Additionally, may provide business plan, market entry, early customer/partner engagement, team building, and/or introductions to potential investors for start ups focused on intriguing cloud based services for mobile phones or connected devices (AKA Internet of Things devices). Open to advisory board member roles in certain situations. CEO Vayulogic, Inc. November 2008  –  December 2010  (2 years 2 months) Vayulogic is text messaging software-as-a-service that retail, restaurant, service and entertainment businesses can use to engage in text based \"conversations\" with their customers. Our clients are able to increase customer loyalty, repeat business, and attract new customers via viral word-of-mouth text messaging. For more information about Vayulogic, see www.vayulogic.com CMO (Vice President Marketing & Product Business Management) Silicon Graphics Inc. (SGI) July 2006  –  July 2007  (1 year 1 month) President & Founder RVV Associates January 2006  –  July 2006  (7 months) Advisor and consultant providing business plan and market entry guidance, early customer, telco and partner engagement assistance, and introductions to potential investors for early stage start up teams focused on mobile phone services and/or connected device markets in the US, Europe and Asia. New Venture General Manager Intel Corporation February 2003  –  January 2006  (3 years) Investment Director, Intel Capital Intel Corporation November 1999  –  January 2003  (3 years 3 months) Director, Developer Relations Intel Corporation November 1997  –  October 1999  (2 years) Director Marketing Intel Corporation February 1993  –  October 1997  (4 years 9 months) Microprocessor Product Marketing Manager Intel Corporation July 1990  –  January 1993  (2 years 7 months) Project Manager, Senior Associate Booz Allen & Hamilton, Inc September 1985  –  July 1990  (4 years 11 months) Production Engineer Shell Oil Company 1980  –  1983  (3 years) Production engineer for oilfields in Southern California. Programmed and deployed first use of field based PCs for oilfield operations monitoring and optimization. President & Founder RVV Associates July 2007  – Present (8 years 2 months) Business advisor to established companies seeking to accelerate internal innovation, and incubating new venture initiatives that may lead to new business lines, or new company spin outs. Additionally, may provide business plan, market entry, early customer/partner engagement, team building, and/or introductions to potential investors for start ups focused on intriguing cloud based services for mobile phones or connected devices (AKA Internet of Things devices). Open to advisory board member roles in certain situations. President & Founder RVV Associates July 2007  – Present (8 years 2 months) Business advisor to established companies seeking to accelerate internal innovation, and incubating new venture initiatives that may lead to new business lines, or new company spin outs. Additionally, may provide business plan, market entry, early customer/partner engagement, team building, and/or introductions to potential investors for start ups focused on intriguing cloud based services for mobile phones or connected devices (AKA Internet of Things devices). Open to advisory board member roles in certain situations. CEO Vayulogic, Inc. November 2008  –  December 2010  (2 years 2 months) Vayulogic is text messaging software-as-a-service that retail, restaurant, service and entertainment businesses can use to engage in text based \"conversations\" with their customers. Our clients are able to increase customer loyalty, repeat business, and attract new customers via viral word-of-mouth text messaging. For more information about Vayulogic, see www.vayulogic.com CEO Vayulogic, Inc. November 2008  –  December 2010  (2 years 2 months) Vayulogic is text messaging software-as-a-service that retail, restaurant, service and entertainment businesses can use to engage in text based \"conversations\" with their customers. Our clients are able to increase customer loyalty, repeat business, and attract new customers via viral word-of-mouth text messaging. For more information about Vayulogic, see www.vayulogic.com CMO (Vice President Marketing & Product Business Management) Silicon Graphics Inc. (SGI) July 2006  –  July 2007  (1 year 1 month) CMO (Vice President Marketing & Product Business Management) Silicon Graphics Inc. (SGI) July 2006  –  July 2007  (1 year 1 month) President & Founder RVV Associates January 2006  –  July 2006  (7 months) Advisor and consultant providing business plan and market entry guidance, early customer, telco and partner engagement assistance, and introductions to potential investors for early stage start up teams focused on mobile phone services and/or connected device markets in the US, Europe and Asia. President & Founder RVV Associates January 2006  –  July 2006  (7 months) Advisor and consultant providing business plan and market entry guidance, early customer, telco and partner engagement assistance, and introductions to potential investors for early stage start up teams focused on mobile phone services and/or connected device markets in the US, Europe and Asia. New Venture General Manager Intel Corporation February 2003  –  January 2006  (3 years) New Venture General Manager Intel Corporation February 2003  –  January 2006  (3 years) Investment Director, Intel Capital Intel Corporation November 1999  –  January 2003  (3 years 3 months) Investment Director, Intel Capital Intel Corporation November 1999  –  January 2003  (3 years 3 months) Director, Developer Relations Intel Corporation November 1997  –  October 1999  (2 years) Director, Developer Relations Intel Corporation November 1997  –  October 1999  (2 years) Director Marketing Intel Corporation February 1993  –  October 1997  (4 years 9 months) Director Marketing Intel Corporation February 1993  –  October 1997  (4 years 9 months) Microprocessor Product Marketing Manager Intel Corporation July 1990  –  January 1993  (2 years 7 months) Microprocessor Product Marketing Manager Intel Corporation July 1990  –  January 1993  (2 years 7 months) Project Manager, Senior Associate Booz Allen & Hamilton, Inc September 1985  –  July 1990  (4 years 11 months) Project Manager, Senior Associate Booz Allen & Hamilton, Inc September 1985  –  July 1990  (4 years 11 months) Production Engineer Shell Oil Company 1980  –  1983  (3 years) Production engineer for oilfields in Southern California. Programmed and deployed first use of field based PCs for oilfield operations monitoring and optimization. Production Engineer Shell Oil Company 1980  –  1983  (3 years) Production engineer for oilfields in Southern California. Programmed and deployed first use of field based PCs for oilfield operations monitoring and optimization. Skills Product Innovation Start-ups Product Marketing Business Development Strategic Partnerships Go-to-market Strategy Corporate Development Product Management Venture Capital SaaS Entrepreneurship Strategy Cross-functional Team... Competitive Analysis Product Launch Mergers Enterprise Software Turn Around Management Business Alliances Mobile Devices Mergers & Acquisitions See 6+     See less Skills  Product Innovation Start-ups Product Marketing Business Development Strategic Partnerships Go-to-market Strategy Corporate Development Product Management Venture Capital SaaS Entrepreneurship Strategy Cross-functional Team... Competitive Analysis Product Launch Mergers Enterprise Software Turn Around Management Business Alliances Mobile Devices Mergers & Acquisitions See 6+     See less Product Innovation Start-ups Product Marketing Business Development Strategic Partnerships Go-to-market Strategy Corporate Development Product Management Venture Capital SaaS Entrepreneurship Strategy Cross-functional Team... Competitive Analysis Product Launch Mergers Enterprise Software Turn Around Management Business Alliances Mobile Devices Mergers & Acquisitions See 6+     See less Product Innovation Start-ups Product Marketing Business Development Strategic Partnerships Go-to-market Strategy Corporate Development Product Management Venture Capital SaaS Entrepreneurship Strategy Cross-functional Team... Competitive Analysis Product Launch Mergers Enterprise Software Turn Around Management Business Alliances Mobile Devices Mergers & Acquisitions See 6+     See less Education Stanford University Graduate School of Business MBA 1983  – 1985 Stanford University MS,  Mechanical/Electrical Engineering 1979  – 1980 Vanderbilt University BE,  Mechanical Engineering 1975  – 1979 Stanford University Graduate School of Business MBA 1983  – 1985 Stanford University Graduate School of Business MBA 1983  – 1985 Stanford University Graduate School of Business MBA 1983  – 1985 Stanford University MS,  Mechanical/Electrical Engineering 1979  – 1980 Stanford University MS,  Mechanical/Electrical Engineering 1979  – 1980 Stanford University MS,  Mechanical/Electrical Engineering 1979  – 1980 Vanderbilt University BE,  Mechanical Engineering 1975  – 1979 Vanderbilt University BE,  Mechanical Engineering 1975  – 1979 Vanderbilt University BE,  Mechanical Engineering 1975  – 1979 ", "Skills Cloud Computing Embedded Systems Product Marketing Analytics Semiconductors Strategy IC Cross-functional Team... Start-ups Big Data Integration Product Management Strategic Planning Product Development Strategic Partnerships Architecture Competitive Analysis Mobile Devices Program Management SaaS Wireless Enterprise Software Product Lifecycle... Cloud Security Embedded Software Embedded Operating... See 11+     See less Skills  Cloud Computing Embedded Systems Product Marketing Analytics Semiconductors Strategy IC Cross-functional Team... Start-ups Big Data Integration Product Management Strategic Planning Product Development Strategic Partnerships Architecture Competitive Analysis Mobile Devices Program Management SaaS Wireless Enterprise Software Product Lifecycle... Cloud Security Embedded Software Embedded Operating... See 11+     See less Cloud Computing Embedded Systems Product Marketing Analytics Semiconductors Strategy IC Cross-functional Team... Start-ups Big Data Integration Product Management Strategic Planning Product Development Strategic Partnerships Architecture Competitive Analysis Mobile Devices Program Management SaaS Wireless Enterprise Software Product Lifecycle... Cloud Security Embedded Software Embedded Operating... See 11+     See less Cloud Computing Embedded Systems Product Marketing Analytics Semiconductors Strategy IC Cross-functional Team... Start-ups Big Data Integration Product Management Strategic Planning Product Development Strategic Partnerships Architecture Competitive Analysis Mobile Devices Program Management SaaS Wireless Enterprise Software Product Lifecycle... Cloud Security Embedded Software Embedded Operating... See 11+     See less Honors & Awards Academy of Distinguished Alumni Montana State University October 2013 W.P. Carey MBA Distinguished Speaker Arizona State University October 2010 Academy of Distinguished Alumni Montana State University October 2013 Academy of Distinguished Alumni Montana State University October 2013 Academy of Distinguished Alumni Montana State University October 2013 W.P. Carey MBA Distinguished Speaker Arizona State University October 2010 W.P. Carey MBA Distinguished Speaker Arizona State University October 2010 W.P. Carey MBA Distinguished Speaker Arizona State University October 2010 ", "Experience Director of Marketing Intel Corporation Technical Assistant to the President Intel 2000  –  2003  (3 years) Lieutenant US Navy 1990  –  1995  (5 years) Director of Marketing Intel Corporation Director of Marketing Intel Corporation Technical Assistant to the President Intel 2000  –  2003  (3 years) Technical Assistant to the President Intel 2000  –  2003  (3 years) Lieutenant US Navy 1990  –  1995  (5 years) Lieutenant US Navy 1990  –  1995  (5 years) Skills Product Marketing Semiconductors Go-to-market Strategy Product Management Competitive Analysis Business Alliances Strategic Partnerships Cross-functional Team... Product Development Product Lifecycle... Product Planning Product Launch Start-ups Business Development Marketing Strategy Skills  Product Marketing Semiconductors Go-to-market Strategy Product Management Competitive Analysis Business Alliances Strategic Partnerships Cross-functional Team... Product Development Product Lifecycle... Product Planning Product Launch Start-ups Business Development Marketing Strategy Product Marketing Semiconductors Go-to-market Strategy Product Management Competitive Analysis Business Alliances Strategic Partnerships Cross-functional Team... Product Development Product Lifecycle... Product Planning Product Launch Start-ups Business Development Marketing Strategy Product Marketing Semiconductors Go-to-market Strategy Product Management Competitive Analysis Business Alliances Strategic Partnerships Cross-functional Team... Product Development Product Lifecycle... Product Planning Product Launch Start-ups Business Development Marketing Strategy Education Harvard Business School Master of Business Administration (MBA) 1995  – 1997 Vanderbilt University BE,  Mechanical Engineering 1986  – 1990 Harvard Business School Master of Business Administration (MBA) 1995  – 1997 Harvard Business School Master of Business Administration (MBA) 1995  – 1997 Harvard Business School Master of Business Administration (MBA) 1995  – 1997 Vanderbilt University BE,  Mechanical Engineering 1986  – 1990 Vanderbilt University BE,  Mechanical Engineering 1986  – 1990 Vanderbilt University BE,  Mechanical Engineering 1986  – 1990 ", "Skills Semiconductors SoC Embedded Systems Product Marketing Wireless Product Lifecycle... Cross-functional Team... Electronics Product Management Customer Engagement Microprocessors Go-to-market Strategy Product Development Strategic Partnerships Semiconductor Industry Telecommunications Business Strategy Strategy Team Leadership Intel Channel Partners Business Alliances Business Development Cloud Computing Competitive Analysis Engineering Management IC Enterprise Software Integration International Sales Management Market Analysis Marketing Mixed Signal Mobile Communications Mobile Devices Mobile Technology P&L Management Product Engineering Product Launch Program Management RF SaaS Six Sigma Software Development Solution Selling Start-ups System Architecture Technical Marketing Vendor Management See 35+     See less Skills  Semiconductors SoC Embedded Systems Product Marketing Wireless Product Lifecycle... Cross-functional Team... Electronics Product Management Customer Engagement Microprocessors Go-to-market Strategy Product Development Strategic Partnerships Semiconductor Industry Telecommunications Business Strategy Strategy Team Leadership Intel Channel Partners Business Alliances Business Development Cloud Computing Competitive Analysis Engineering Management IC Enterprise Software Integration International Sales Management Market Analysis Marketing Mixed Signal Mobile Communications Mobile Devices Mobile Technology P&L Management Product Engineering Product Launch Program Management RF SaaS Six Sigma Software Development Solution Selling Start-ups System Architecture Technical Marketing Vendor Management See 35+     See less Semiconductors SoC Embedded Systems Product Marketing Wireless Product Lifecycle... Cross-functional Team... Electronics Product Management Customer Engagement Microprocessors Go-to-market Strategy Product Development Strategic Partnerships Semiconductor Industry Telecommunications Business Strategy Strategy Team Leadership Intel Channel Partners Business Alliances Business Development Cloud Computing Competitive Analysis Engineering Management IC Enterprise Software Integration International Sales Management Market Analysis Marketing Mixed Signal Mobile Communications Mobile Devices Mobile Technology P&L Management Product Engineering Product Launch Program Management RF SaaS Six Sigma Software Development Solution Selling Start-ups System Architecture Technical Marketing Vendor Management See 35+     See less Semiconductors SoC Embedded Systems Product Marketing Wireless Product Lifecycle... Cross-functional Team... Electronics Product Management Customer Engagement Microprocessors Go-to-market Strategy Product Development Strategic Partnerships Semiconductor Industry Telecommunications Business Strategy Strategy Team Leadership Intel Channel Partners Business Alliances Business Development Cloud Computing Competitive Analysis Engineering Management IC Enterprise Software Integration International Sales Management Market Analysis Marketing Mixed Signal Mobile Communications Mobile Devices Mobile Technology P&L Management Product Engineering Product Launch Program Management RF SaaS Six Sigma Software Development Solution Selling Start-ups System Architecture Technical Marketing Vendor Management See 35+     See less ", "Skills Enterprise Architecture Product Management High Performance... Distributed Systems Semiconductors System Architecture Leadership Numerical Analysis Hardware Cross-functional Team... Product Development Program Management Computer Science Analytics Parallel Computing Go-to-market Strategy Start-ups Virtualization Management Architecture Simulations Algorithms Computer Architecture Business Planning Enterprise Software Systems Engineering Software Development Strategy R&D Cloud Computing Business Analysis Strategic Planning Perl Software Engineering Product Marketing Embedded Systems Entrepreneurship Machine Learning Microprocessors Analysis Compilers Signal Processing MPI See 28+     See less Skills  Enterprise Architecture Product Management High Performance... Distributed Systems Semiconductors System Architecture Leadership Numerical Analysis Hardware Cross-functional Team... Product Development Program Management Computer Science Analytics Parallel Computing Go-to-market Strategy Start-ups Virtualization Management Architecture Simulations Algorithms Computer Architecture Business Planning Enterprise Software Systems Engineering Software Development Strategy R&D Cloud Computing Business Analysis Strategic Planning Perl Software Engineering Product Marketing Embedded Systems Entrepreneurship Machine Learning Microprocessors Analysis Compilers Signal Processing MPI See 28+     See less Enterprise Architecture Product Management High Performance... Distributed Systems Semiconductors System Architecture Leadership Numerical Analysis Hardware Cross-functional Team... Product Development Program Management Computer Science Analytics Parallel Computing Go-to-market Strategy Start-ups Virtualization Management Architecture Simulations Algorithms Computer Architecture Business Planning Enterprise Software Systems Engineering Software Development Strategy R&D Cloud Computing Business Analysis Strategic Planning Perl Software Engineering Product Marketing Embedded Systems Entrepreneurship Machine Learning Microprocessors Analysis Compilers Signal Processing MPI See 28+     See less Enterprise Architecture Product Management High Performance... Distributed Systems Semiconductors System Architecture Leadership Numerical Analysis Hardware Cross-functional Team... Product Development Program Management Computer Science Analytics Parallel Computing Go-to-market Strategy Start-ups Virtualization Management Architecture Simulations Algorithms Computer Architecture Business Planning Enterprise Software Systems Engineering Software Development Strategy R&D Cloud Computing Business Analysis Strategic Planning Perl Software Engineering Product Marketing Embedded Systems Entrepreneurship Machine Learning Microprocessors Analysis Compilers Signal Processing MPI See 28+     See less Honors & Awards ", "Languages Spanish Spanish Spanish Skills Go-to-market Strategy Strategy Business Development Product Marketing Embedded Systems Competitive Analysis Cloud Computing Mobile Devices Business Alliances Sales New Business Development Marketing Strategy Demand Generation Product Launch Semiconductors Start-ups Leadership ARM Marketing Intel Processors Product Management Strategic Partnerships Management Embedded Linux Miller-Heiman Strategic... Strategic Planning Channel Sales VoIP Contact Centers Telecommunications Managing Distribution... Channel Partners Automotive Infotainment Telematics Salesforce.com See 21+     See less Skills  Go-to-market Strategy Strategy Business Development Product Marketing Embedded Systems Competitive Analysis Cloud Computing Mobile Devices Business Alliances Sales New Business Development Marketing Strategy Demand Generation Product Launch Semiconductors Start-ups Leadership ARM Marketing Intel Processors Product Management Strategic Partnerships Management Embedded Linux Miller-Heiman Strategic... Strategic Planning Channel Sales VoIP Contact Centers Telecommunications Managing Distribution... Channel Partners Automotive Infotainment Telematics Salesforce.com See 21+     See less Go-to-market Strategy Strategy Business Development Product Marketing Embedded Systems Competitive Analysis Cloud Computing Mobile Devices Business Alliances Sales New Business Development Marketing Strategy Demand Generation Product Launch Semiconductors Start-ups Leadership ARM Marketing Intel Processors Product Management Strategic Partnerships Management Embedded Linux Miller-Heiman Strategic... Strategic Planning Channel Sales VoIP Contact Centers Telecommunications Managing Distribution... Channel Partners Automotive Infotainment Telematics Salesforce.com See 21+     See less Go-to-market Strategy Strategy Business Development Product Marketing Embedded Systems Competitive Analysis Cloud Computing Mobile Devices Business Alliances Sales New Business Development Marketing Strategy Demand Generation Product Launch Semiconductors Start-ups Leadership ARM Marketing Intel Processors Product Management Strategic Partnerships Management Embedded Linux Miller-Heiman Strategic... Strategic Planning Channel Sales VoIP Contact Centers Telecommunications Managing Distribution... Channel Partners Automotive Infotainment Telematics Salesforce.com See 21+     See less ", "Skills Product Management Demand Generation Go-to-market Strategy Multi-channel Marketing Product Marketing Strategy Strategic Partnerships Sales Enablement Product Planning Strategic Alliances Channel Partners Marketing Communications Integrated Marketing Cross-functional Team... Product Lifecycle... Start-ups Marketing Strategy Business Alliances Product Launch Business Development Partner Management Marketing See 7+     See less Skills  Product Management Demand Generation Go-to-market Strategy Multi-channel Marketing Product Marketing Strategy Strategic Partnerships Sales Enablement Product Planning Strategic Alliances Channel Partners Marketing Communications Integrated Marketing Cross-functional Team... Product Lifecycle... Start-ups Marketing Strategy Business Alliances Product Launch Business Development Partner Management Marketing See 7+     See less Product Management Demand Generation Go-to-market Strategy Multi-channel Marketing Product Marketing Strategy Strategic Partnerships Sales Enablement Product Planning Strategic Alliances Channel Partners Marketing Communications Integrated Marketing Cross-functional Team... Product Lifecycle... Start-ups Marketing Strategy Business Alliances Product Launch Business Development Partner Management Marketing See 7+     See less Product Management Demand Generation Go-to-market Strategy Multi-channel Marketing Product Marketing Strategy Strategic Partnerships Sales Enablement Product Planning Strategic Alliances Channel Partners Marketing Communications Integrated Marketing Cross-functional Team... Product Lifecycle... Start-ups Marketing Strategy Business Alliances Product Launch Business Development Partner Management Marketing See 7+     See less ", "Experience Director Intel Corporation May 2011  – Present (4 years 4 months) santa clara, ca Strategic platform planning for Intel Business Client Solutions including security, manageability and collaboration. Joined Intel after the acquisition of SiPort in May, 2011. Managed the Intel Digital Radio Group (DRG) is part of the Intel Mobile Communications Group (MCG) before transitioning to the current role. Vice President Marketing and Business Development SiPort April 2006  –  June 2011  (5 years 3 months) SiPort is a venture backed fabless semiconductor company developing mixed signal RF and digital baseband wireless chips supporting multiple Digital Broadcast Standards that enable ubiquitous delivery of digital audio and data services to navigation devices, cell phones and other consumer platforms. Formulated strategy and drove to crucial partnership agreements with data service providers like Microsoft, Navteq and Clearchannel to embed SiPort into the high growth navigation market eco system. Drove the design-ins with leading PND and PMP OEMs in the US and Japan. Established world wide sales channels to facilitate OEM, ODM and CEM sales and support. Built a multi-dimensional technical organization to provide reference design kits, support customer design and layout efforts, design validation and system integration. GM & Senior Director NVIDIA Corporation October 2001  –  October 2005  (4 years 1 month) Product Development and Management, Establish key strategic relationships with leading Baseband Manufacturers and OS Vendors for the Handheld Business Founder and VP Sales & Marketing MediaQ 1996  –  2001  (5 years) Formulated the MediaQ business plan and played a key role in selling the vision, roadmap, and strategy to the venture capital community. Director of Marketing S3 1995  –  1996  (1 year) Product Line Manager Cirrus Logic 1993  –  1995  (2 years) Systems Engineering Manager Chips and Technologies Inc. (Acquired by Intel in 1998) 1989  –  1993  (4 years) Systems Engineering Manager Chips and Technologies 1989  –  1993  (4 years) Systems Engineer National Semiconductor 1985  –  1989  (4 years) Director Intel Corporation May 2011  – Present (4 years 4 months) santa clara, ca Strategic platform planning for Intel Business Client Solutions including security, manageability and collaboration. Joined Intel after the acquisition of SiPort in May, 2011. Managed the Intel Digital Radio Group (DRG) is part of the Intel Mobile Communications Group (MCG) before transitioning to the current role. Director Intel Corporation May 2011  – Present (4 years 4 months) santa clara, ca Strategic platform planning for Intel Business Client Solutions including security, manageability and collaboration. Joined Intel after the acquisition of SiPort in May, 2011. Managed the Intel Digital Radio Group (DRG) is part of the Intel Mobile Communications Group (MCG) before transitioning to the current role. Vice President Marketing and Business Development SiPort April 2006  –  June 2011  (5 years 3 months) SiPort is a venture backed fabless semiconductor company developing mixed signal RF and digital baseband wireless chips supporting multiple Digital Broadcast Standards that enable ubiquitous delivery of digital audio and data services to navigation devices, cell phones and other consumer platforms. Formulated strategy and drove to crucial partnership agreements with data service providers like Microsoft, Navteq and Clearchannel to embed SiPort into the high growth navigation market eco system. Drove the design-ins with leading PND and PMP OEMs in the US and Japan. Established world wide sales channels to facilitate OEM, ODM and CEM sales and support. Built a multi-dimensional technical organization to provide reference design kits, support customer design and layout efforts, design validation and system integration. Vice President Marketing and Business Development SiPort April 2006  –  June 2011  (5 years 3 months) SiPort is a venture backed fabless semiconductor company developing mixed signal RF and digital baseband wireless chips supporting multiple Digital Broadcast Standards that enable ubiquitous delivery of digital audio and data services to navigation devices, cell phones and other consumer platforms. Formulated strategy and drove to crucial partnership agreements with data service providers like Microsoft, Navteq and Clearchannel to embed SiPort into the high growth navigation market eco system. Drove the design-ins with leading PND and PMP OEMs in the US and Japan. Established world wide sales channels to facilitate OEM, ODM and CEM sales and support. Built a multi-dimensional technical organization to provide reference design kits, support customer design and layout efforts, design validation and system integration. GM & Senior Director NVIDIA Corporation October 2001  –  October 2005  (4 years 1 month) Product Development and Management, Establish key strategic relationships with leading Baseband Manufacturers and OS Vendors for the Handheld Business GM & Senior Director NVIDIA Corporation October 2001  –  October 2005  (4 years 1 month) Product Development and Management, Establish key strategic relationships with leading Baseband Manufacturers and OS Vendors for the Handheld Business Founder and VP Sales & Marketing MediaQ 1996  –  2001  (5 years) Formulated the MediaQ business plan and played a key role in selling the vision, roadmap, and strategy to the venture capital community. Founder and VP Sales & Marketing MediaQ 1996  –  2001  (5 years) Formulated the MediaQ business plan and played a key role in selling the vision, roadmap, and strategy to the venture capital community. Director of Marketing S3 1995  –  1996  (1 year) Director of Marketing S3 1995  –  1996  (1 year) Product Line Manager Cirrus Logic 1993  –  1995  (2 years) Product Line Manager Cirrus Logic 1993  –  1995  (2 years) Systems Engineering Manager Chips and Technologies Inc. (Acquired by Intel in 1998) 1989  –  1993  (4 years) Systems Engineering Manager Chips and Technologies Inc. (Acquired by Intel in 1998) 1989  –  1993  (4 years) Systems Engineering Manager Chips and Technologies 1989  –  1993  (4 years) Systems Engineering Manager Chips and Technologies 1989  –  1993  (4 years) Systems Engineer National Semiconductor 1985  –  1989  (4 years) Systems Engineer National Semiconductor 1985  –  1989  (4 years) Skills ASIC SoC Mobile Devices Semiconductors Product Management Competitive Analysis RF Strategy Wireless Consumer Electronics Product Development Product Marketing IC Solution Selling Program Management Embedded Systems Digital Signal... Start-ups Management Go-to-market Strategy Integration Mobile Communications Mixed Signal EDA Mergers & Acquisitions Executive Management See 11+     See less Skills  ASIC SoC Mobile Devices Semiconductors Product Management Competitive Analysis RF Strategy Wireless Consumer Electronics Product Development Product Marketing IC Solution Selling Program Management Embedded Systems Digital Signal... Start-ups Management Go-to-market Strategy Integration Mobile Communications Mixed Signal EDA Mergers & Acquisitions Executive Management See 11+     See less ASIC SoC Mobile Devices Semiconductors Product Management Competitive Analysis RF Strategy Wireless Consumer Electronics Product Development Product Marketing IC Solution Selling Program Management Embedded Systems Digital Signal... Start-ups Management Go-to-market Strategy Integration Mobile Communications Mixed Signal EDA Mergers & Acquisitions Executive Management See 11+     See less ASIC SoC Mobile Devices Semiconductors Product Management Competitive Analysis RF Strategy Wireless Consumer Electronics Product Development Product Marketing IC Solution Selling Program Management Embedded Systems Digital Signal... Start-ups Management Go-to-market Strategy Integration Mobile Communications Mixed Signal EDA Mergers & Acquisitions Executive Management See 11+     See less ", "Skills Product Development Business Development Electronics Business Strategy New Business Development Semiconductors Marketing Strategy Product Management Product Marketing Project Management Business Planning Wireless Sales Management Executive Management Engineering Fiber Optics International Sales Marketing Management Strategic Planning Strategic Consulting See 5+     See less Skills  Product Development Business Development Electronics Business Strategy New Business Development Semiconductors Marketing Strategy Product Management Product Marketing Project Management Business Planning Wireless Sales Management Executive Management Engineering Fiber Optics International Sales Marketing Management Strategic Planning Strategic Consulting See 5+     See less Product Development Business Development Electronics Business Strategy New Business Development Semiconductors Marketing Strategy Product Management Product Marketing Project Management Business Planning Wireless Sales Management Executive Management Engineering Fiber Optics International Sales Marketing Management Strategic Planning Strategic Consulting See 5+     See less Product Development Business Development Electronics Business Strategy New Business Development Semiconductors Marketing Strategy Product Management Product Marketing Project Management Business Planning Wireless Sales Management Executive Management Engineering Fiber Optics International Sales Marketing Management Strategic Planning Strategic Consulting See 5+     See less ", "Summary Ed is drawing his more than 25 years experience in new business creation to become the founder of Arria Live Media, a new start-up that is building the Internet of [Media] Things™.​​ \n \nFormerly with Intel Corpotation, he developed new business concepts in Intel's internal incubator, the New Business Initiatives group. There he has specialized in the Internet of Things, digital signage, media content delivery, and computational photography. He returned to Intel in June, 2005.  \n \nPrior to his return to Intel, he co-founded CineForm, Inc., a video technology company where he served as VP of Marketing for more than 2 years. Under his leadership, CineForm’s high-definition (HD) video technology became the leading solution for professional ultra high definition workflows. CineForm was acquired by GoPro in 2010.  \n \nPrior to CineForm, Mr. Arrington spent nearly 12 years with Intel Corporation where he held a variety of marketing leadership positions. He developed Intel's Extended PC strategy and founded a $35M internal business to build consumer products consistent with that strategy. He drove standards in home networking and network access including DSL, Cable-modem and wireless technology. He has chaired the DMTF, an industry standards organization, and was a product manager for high-end fax/modem products. \n \nAs an avocation, Mr. Arrington was co-founder and operator of Fedora AV, a professional live audio, video, and lighting firm providing services for business events, concerts, and community activities. \n \nMr. Arrington received his MBA from the University of Oregon where he was salutatorian for his class, and a Bachelor's Degree in Business Finance from Brigham Young University. He holds two US patents for unique consumer product design. \n \nSpecialties: Business strategies that generate growth; Internet of Things; professional audio, video, and lighting technologies. Summary Ed is drawing his more than 25 years experience in new business creation to become the founder of Arria Live Media, a new start-up that is building the Internet of [Media] Things™.​​ \n \nFormerly with Intel Corpotation, he developed new business concepts in Intel's internal incubator, the New Business Initiatives group. There he has specialized in the Internet of Things, digital signage, media content delivery, and computational photography. He returned to Intel in June, 2005.  \n \nPrior to his return to Intel, he co-founded CineForm, Inc., a video technology company where he served as VP of Marketing for more than 2 years. Under his leadership, CineForm’s high-definition (HD) video technology became the leading solution for professional ultra high definition workflows. CineForm was acquired by GoPro in 2010.  \n \nPrior to CineForm, Mr. Arrington spent nearly 12 years with Intel Corporation where he held a variety of marketing leadership positions. He developed Intel's Extended PC strategy and founded a $35M internal business to build consumer products consistent with that strategy. He drove standards in home networking and network access including DSL, Cable-modem and wireless technology. He has chaired the DMTF, an industry standards organization, and was a product manager for high-end fax/modem products. \n \nAs an avocation, Mr. Arrington was co-founder and operator of Fedora AV, a professional live audio, video, and lighting firm providing services for business events, concerts, and community activities. \n \nMr. Arrington received his MBA from the University of Oregon where he was salutatorian for his class, and a Bachelor's Degree in Business Finance from Brigham Young University. He holds two US patents for unique consumer product design. \n \nSpecialties: Business strategies that generate growth; Internet of Things; professional audio, video, and lighting technologies. Ed is drawing his more than 25 years experience in new business creation to become the founder of Arria Live Media, a new start-up that is building the Internet of [Media] Things™.​​ \n \nFormerly with Intel Corpotation, he developed new business concepts in Intel's internal incubator, the New Business Initiatives group. There he has specialized in the Internet of Things, digital signage, media content delivery, and computational photography. He returned to Intel in June, 2005.  \n \nPrior to his return to Intel, he co-founded CineForm, Inc., a video technology company where he served as VP of Marketing for more than 2 years. Under his leadership, CineForm’s high-definition (HD) video technology became the leading solution for professional ultra high definition workflows. CineForm was acquired by GoPro in 2010.  \n \nPrior to CineForm, Mr. Arrington spent nearly 12 years with Intel Corporation where he held a variety of marketing leadership positions. He developed Intel's Extended PC strategy and founded a $35M internal business to build consumer products consistent with that strategy. He drove standards in home networking and network access including DSL, Cable-modem and wireless technology. He has chaired the DMTF, an industry standards organization, and was a product manager for high-end fax/modem products. \n \nAs an avocation, Mr. Arrington was co-founder and operator of Fedora AV, a professional live audio, video, and lighting firm providing services for business events, concerts, and community activities. \n \nMr. Arrington received his MBA from the University of Oregon where he was salutatorian for his class, and a Bachelor's Degree in Business Finance from Brigham Young University. He holds two US patents for unique consumer product design. \n \nSpecialties: Business strategies that generate growth; Internet of Things; professional audio, video, and lighting technologies. Ed is drawing his more than 25 years experience in new business creation to become the founder of Arria Live Media, a new start-up that is building the Internet of [Media] Things™.​​ \n \nFormerly with Intel Corpotation, he developed new business concepts in Intel's internal incubator, the New Business Initiatives group. There he has specialized in the Internet of Things, digital signage, media content delivery, and computational photography. He returned to Intel in June, 2005.  \n \nPrior to his return to Intel, he co-founded CineForm, Inc., a video technology company where he served as VP of Marketing for more than 2 years. Under his leadership, CineForm’s high-definition (HD) video technology became the leading solution for professional ultra high definition workflows. CineForm was acquired by GoPro in 2010.  \n \nPrior to CineForm, Mr. Arrington spent nearly 12 years with Intel Corporation where he held a variety of marketing leadership positions. He developed Intel's Extended PC strategy and founded a $35M internal business to build consumer products consistent with that strategy. He drove standards in home networking and network access including DSL, Cable-modem and wireless technology. He has chaired the DMTF, an industry standards organization, and was a product manager for high-end fax/modem products. \n \nAs an avocation, Mr. Arrington was co-founder and operator of Fedora AV, a professional live audio, video, and lighting firm providing services for business events, concerts, and community activities. \n \nMr. Arrington received his MBA from the University of Oregon where he was salutatorian for his class, and a Bachelor's Degree in Business Finance from Brigham Young University. He holds two US patents for unique consumer product design. \n \nSpecialties: Business strategies that generate growth; Internet of Things; professional audio, video, and lighting technologies. Experience CEO Arria Live Media January 2013  – Present (2 years 8 months) Hillsboro, Oregon I am leading Arria Live Media, a start-up that is delivering a network-connected media platform that will be built directly into audio and video endpoints including speakers and microphones, video displays and cameras. But our platform is more than just media-enabled endpoints. Media solutions require a system-level approach that is at once complex to build and surprisingly simple to use. Our platform is at the intersection of the Internet of Things and Digital Audio/Video. \n \nArria Live Media is building the Internet of [Media] Things™.​​ Director of Marketing Intel Corporation June 2005  –  December 2013  (8 years 7 months) I retired from Intel after 20 years (in two stints). While at Intel I led business development efforts for several internal business startup within Intel's New Business Initiatives group. The most recent effort involved the intersection of digital entertainment and the Internet of Things. Owner Fedora AV January 2001  –  March 2013  (12 years 3 months) Fedora AV provides high-quality professional audio, lighting, and video services for community events and concerts. By focusing on the latest digital technologies, Fedora AV delivers a level of quality well beyond traditional analog capabilities. Fedora AV's staff of professionals produce events that surpass typical business event expectations. VP Marketing CineForm 2001  –  2003  (2 years) Conceived and co-founded CineForm, a professional High Definition video workflow company leading efforts for first $1M VC funding round. Led all marketing efforts to develop, position and launch Cineform’s flagship product, Aspect HD™. Video technologies include virtually all HD workflow solutions from 720p through Cinema 4k. Director of Marketing Intel Corporation February 1990  –  September 2001  (11 years 8 months) 12 Years increasing technology marketing experience with leadership responsibilities over all marketing disciplines including product definition and development, marketing communications, life-cycle planning and promotional strategies in both consumer products and enterprise market segments. CEO Arria Live Media January 2013  – Present (2 years 8 months) Hillsboro, Oregon I am leading Arria Live Media, a start-up that is delivering a network-connected media platform that will be built directly into audio and video endpoints including speakers and microphones, video displays and cameras. But our platform is more than just media-enabled endpoints. Media solutions require a system-level approach that is at once complex to build and surprisingly simple to use. Our platform is at the intersection of the Internet of Things and Digital Audio/Video. \n \nArria Live Media is building the Internet of [Media] Things™.​​ CEO Arria Live Media January 2013  – Present (2 years 8 months) Hillsboro, Oregon I am leading Arria Live Media, a start-up that is delivering a network-connected media platform that will be built directly into audio and video endpoints including speakers and microphones, video displays and cameras. But our platform is more than just media-enabled endpoints. Media solutions require a system-level approach that is at once complex to build and surprisingly simple to use. Our platform is at the intersection of the Internet of Things and Digital Audio/Video. \n \nArria Live Media is building the Internet of [Media] Things™.​​ Director of Marketing Intel Corporation June 2005  –  December 2013  (8 years 7 months) I retired from Intel after 20 years (in two stints). While at Intel I led business development efforts for several internal business startup within Intel's New Business Initiatives group. The most recent effort involved the intersection of digital entertainment and the Internet of Things. Director of Marketing Intel Corporation June 2005  –  December 2013  (8 years 7 months) I retired from Intel after 20 years (in two stints). While at Intel I led business development efforts for several internal business startup within Intel's New Business Initiatives group. The most recent effort involved the intersection of digital entertainment and the Internet of Things. Owner Fedora AV January 2001  –  March 2013  (12 years 3 months) Fedora AV provides high-quality professional audio, lighting, and video services for community events and concerts. By focusing on the latest digital technologies, Fedora AV delivers a level of quality well beyond traditional analog capabilities. Fedora AV's staff of professionals produce events that surpass typical business event expectations. Owner Fedora AV January 2001  –  March 2013  (12 years 3 months) Fedora AV provides high-quality professional audio, lighting, and video services for community events and concerts. By focusing on the latest digital technologies, Fedora AV delivers a level of quality well beyond traditional analog capabilities. Fedora AV's staff of professionals produce events that surpass typical business event expectations. VP Marketing CineForm 2001  –  2003  (2 years) Conceived and co-founded CineForm, a professional High Definition video workflow company leading efforts for first $1M VC funding round. Led all marketing efforts to develop, position and launch Cineform’s flagship product, Aspect HD™. Video technologies include virtually all HD workflow solutions from 720p through Cinema 4k. VP Marketing CineForm 2001  –  2003  (2 years) Conceived and co-founded CineForm, a professional High Definition video workflow company leading efforts for first $1M VC funding round. Led all marketing efforts to develop, position and launch Cineform’s flagship product, Aspect HD™. Video technologies include virtually all HD workflow solutions from 720p through Cinema 4k. Director of Marketing Intel Corporation February 1990  –  September 2001  (11 years 8 months) 12 Years increasing technology marketing experience with leadership responsibilities over all marketing disciplines including product definition and development, marketing communications, life-cycle planning and promotional strategies in both consumer products and enterprise market segments. Director of Marketing Intel Corporation February 1990  –  September 2001  (11 years 8 months) 12 Years increasing technology marketing experience with leadership responsibilities over all marketing disciplines including product definition and development, marketing communications, life-cycle planning and promotional strategies in both consumer products and enterprise market segments. Skills Product Management Product Marketing Strategy Semiconductors Go-to-market Strategy Start-ups Cross-functional Team... Marketing Strategy New Business Development Product Development Business Strategy Marketing Strategic Partnerships Enterprise Software Management Consulting Leadership Competitive Analysis Solution Selling Wireless Strategic Planning SaaS Program Management Business Planning Entrepreneurship Executive Management Consulting Business Development Product Launch Mobile Devices CRM Analytics Cloud Computing Networking Mergers & Acquisitions E-commerce Project Planning Management Business Alliances Team Leadership Lead Generation Demand Generation Venture Capital Multi-channel Marketing Marketing Management Product Lifecycle... Market Research International Business International Sales Segmentation Market Analysis See 35+     See less Skills  Product Management Product Marketing Strategy Semiconductors Go-to-market Strategy Start-ups Cross-functional Team... Marketing Strategy New Business Development Product Development Business Strategy Marketing Strategic Partnerships Enterprise Software Management Consulting Leadership Competitive Analysis Solution Selling Wireless Strategic Planning SaaS Program Management Business Planning Entrepreneurship Executive Management Consulting Business Development Product Launch Mobile Devices CRM Analytics Cloud Computing Networking Mergers & Acquisitions E-commerce Project Planning Management Business Alliances Team Leadership Lead Generation Demand Generation Venture Capital Multi-channel Marketing Marketing Management Product Lifecycle... Market Research International Business International Sales Segmentation Market Analysis See 35+     See less Product Management Product Marketing Strategy Semiconductors Go-to-market Strategy Start-ups Cross-functional Team... Marketing Strategy New Business Development Product Development Business Strategy Marketing Strategic Partnerships Enterprise Software Management Consulting Leadership Competitive Analysis Solution Selling Wireless Strategic Planning SaaS Program Management Business Planning Entrepreneurship Executive Management Consulting Business Development Product Launch Mobile Devices CRM Analytics Cloud Computing Networking Mergers & Acquisitions E-commerce Project Planning Management Business Alliances Team Leadership Lead Generation Demand Generation Venture Capital Multi-channel Marketing Marketing Management Product Lifecycle... Market Research International Business International Sales Segmentation Market Analysis See 35+     See less Product Management Product Marketing Strategy Semiconductors Go-to-market Strategy Start-ups Cross-functional Team... Marketing Strategy New Business Development Product Development Business Strategy Marketing Strategic Partnerships Enterprise Software Management Consulting Leadership Competitive Analysis Solution Selling Wireless Strategic Planning SaaS Program Management Business Planning Entrepreneurship Executive Management Consulting Business Development Product Launch Mobile Devices CRM Analytics Cloud Computing Networking Mergers & Acquisitions E-commerce Project Planning Management Business Alliances Team Leadership Lead Generation Demand Generation Venture Capital Multi-channel Marketing Marketing Management Product Lifecycle... Market Research International Business International Sales Segmentation Market Analysis See 35+     See less Education University of Oregon - Charles H. Lundquist College of Business MBA,  Business Administration 2006  – 2008 Brigham Young University BS,  Business Finance 1983  – 1986 University of Oregon - Charles H. Lundquist College of Business MBA,  Business Administration 2006  – 2008 University of Oregon - Charles H. Lundquist College of Business MBA,  Business Administration 2006  – 2008 University of Oregon - Charles H. Lundquist College of Business MBA,  Business Administration 2006  – 2008 Brigham Young University BS,  Business Finance 1983  – 1986 Brigham Young University BS,  Business Finance 1983  – 1986 Brigham Young University BS,  Business Finance 1983  – 1986 Honors & Awards Additional Honors & Awards Awarded Intel’s Achievement Award twice for impactful marketing programs. Nominated for PC Magazine’s Award for Technical Excellence for contribution in Desktop PC Management. Awarded two US Patents for Tablet PC design. Class salutatorian, University of Oregon MBA with 3.9 GPA Additional Honors & Awards Awarded Intel’s Achievement Award twice for impactful marketing programs. Nominated for PC Magazine’s Award for Technical Excellence for contribution in Desktop PC Management. Awarded two US Patents for Tablet PC design. Class salutatorian, University of Oregon MBA with 3.9 GPA Additional Honors & Awards Awarded Intel’s Achievement Award twice for impactful marketing programs. Nominated for PC Magazine’s Award for Technical Excellence for contribution in Desktop PC Management. Awarded two US Patents for Tablet PC design. Class salutatorian, University of Oregon MBA with 3.9 GPA Additional Honors & Awards Awarded Intel’s Achievement Award twice for impactful marketing programs. Nominated for PC Magazine’s Award for Technical Excellence for contribution in Desktop PC Management. Awarded two US Patents for Tablet PC design. Class salutatorian, University of Oregon MBA with 3.9 GPA ", "Summary Customer-focused business development and product management executive with unique combination of experience across both software and hardware products. Able to bring large company credibility and discipline to startups or new business areas in established companies where sales ability and technical depth is valued. Specialties:Strategic partner development, executive engagement, presentation and public speaking skills, technical depth, product management Summary Customer-focused business development and product management executive with unique combination of experience across both software and hardware products. Able to bring large company credibility and discipline to startups or new business areas in established companies where sales ability and technical depth is valued. Specialties:Strategic partner development, executive engagement, presentation and public speaking skills, technical depth, product management Customer-focused business development and product management executive with unique combination of experience across both software and hardware products. Able to bring large company credibility and discipline to startups or new business areas in established companies where sales ability and technical depth is valued. Specialties:Strategic partner development, executive engagement, presentation and public speaking skills, technical depth, product management Customer-focused business development and product management executive with unique combination of experience across both software and hardware products. Able to bring large company credibility and discipline to startups or new business areas in established companies where sales ability and technical depth is valued. Specialties:Strategic partner development, executive engagement, presentation and public speaking skills, technical depth, product management Experience Director, Software Solution Sales SanDisk April 2012  – Present (3 years 5 months) San Francisco Bay Area Lead worldwide sales team for SanDisk's enterprise software products, including FlashSoft for server flash caching. Responsible for driving all software business with focus on tier 1 server and storage OEMs. VP Product Marketing ZuluTime 2010  –  April 2012  (2 years) Led product management and strategic partner relationships for software startup company that is focused on providing indoor location of smartphones using Wi-Fi. Established strong partnerships with major industry analytics vendors, system integrators and location-based app developers. Director, Business Development RNA Networks June 2007  –  2010  (3 years) Developed strong deal-focused partner program with key network and tier 1 computer OEM companies (including HP) for innovative startup company delivering memory virtualization software for data center acceleration. Negotiated and closed reseller agreements with focus on Financial Services, Oil/Gas and Life Science verticals. Company acquired by Dell. VP Commercial & Enterprise Bus Dev ZT Systems September 2006  –  2007  (1 year) Expanded server business at computer hardware manufacturer by focusing on specific vertical markets such as software appliances and server clusters. Director of Marketing Intel Corporation 1984  –  2006  (22 years) Held positions of increasing responsibility in marketing, sales and strategic planning for Intel, including marketing director for server boards and systems, strategic planning director for the software solutions group, marketing director for desktop motherboards, field sales engineer and product management for the initial PCI core logic chip sets. Generated significant growth in established product lines while creating new business opportunities in adjacent markets of storage and telecom. Director, Software Solution Sales SanDisk April 2012  – Present (3 years 5 months) San Francisco Bay Area Lead worldwide sales team for SanDisk's enterprise software products, including FlashSoft for server flash caching. Responsible for driving all software business with focus on tier 1 server and storage OEMs. Director, Software Solution Sales SanDisk April 2012  – Present (3 years 5 months) San Francisco Bay Area Lead worldwide sales team for SanDisk's enterprise software products, including FlashSoft for server flash caching. Responsible for driving all software business with focus on tier 1 server and storage OEMs. VP Product Marketing ZuluTime 2010  –  April 2012  (2 years) Led product management and strategic partner relationships for software startup company that is focused on providing indoor location of smartphones using Wi-Fi. Established strong partnerships with major industry analytics vendors, system integrators and location-based app developers. VP Product Marketing ZuluTime 2010  –  April 2012  (2 years) Led product management and strategic partner relationships for software startup company that is focused on providing indoor location of smartphones using Wi-Fi. Established strong partnerships with major industry analytics vendors, system integrators and location-based app developers. Director, Business Development RNA Networks June 2007  –  2010  (3 years) Developed strong deal-focused partner program with key network and tier 1 computer OEM companies (including HP) for innovative startup company delivering memory virtualization software for data center acceleration. Negotiated and closed reseller agreements with focus on Financial Services, Oil/Gas and Life Science verticals. Company acquired by Dell. Director, Business Development RNA Networks June 2007  –  2010  (3 years) Developed strong deal-focused partner program with key network and tier 1 computer OEM companies (including HP) for innovative startup company delivering memory virtualization software for data center acceleration. Negotiated and closed reseller agreements with focus on Financial Services, Oil/Gas and Life Science verticals. Company acquired by Dell. VP Commercial & Enterprise Bus Dev ZT Systems September 2006  –  2007  (1 year) Expanded server business at computer hardware manufacturer by focusing on specific vertical markets such as software appliances and server clusters. VP Commercial & Enterprise Bus Dev ZT Systems September 2006  –  2007  (1 year) Expanded server business at computer hardware manufacturer by focusing on specific vertical markets such as software appliances and server clusters. Director of Marketing Intel Corporation 1984  –  2006  (22 years) Held positions of increasing responsibility in marketing, sales and strategic planning for Intel, including marketing director for server boards and systems, strategic planning director for the software solutions group, marketing director for desktop motherboards, field sales engineer and product management for the initial PCI core logic chip sets. Generated significant growth in established product lines while creating new business opportunities in adjacent markets of storage and telecom. Director of Marketing Intel Corporation 1984  –  2006  (22 years) Held positions of increasing responsibility in marketing, sales and strategic planning for Intel, including marketing director for server boards and systems, strategic planning director for the software solutions group, marketing director for desktop motherboards, field sales engineer and product management for the initial PCI core logic chip sets. Generated significant growth in established product lines while creating new business opportunities in adjacent markets of storage and telecom. Skills Strategic Partnerships New Business Development Product Marketing Marketing Management Strategic Planning Customer Presentations Product Management Product Strategy Partnership Management Channel Sales Channel Partners Start-ups Partner Management Demand Generation Go-to-market Strategy Enterprise Software Business Development Data Center Product Launch Telecommunications Sales SaaS Management Solution Selling Networking Competitive Analysis Analytics Marketing Cloud Computing Business Alliances Virtualization Storage Leadership See 18+     See less Skills  Strategic Partnerships New Business Development Product Marketing Marketing Management Strategic Planning Customer Presentations Product Management Product Strategy Partnership Management Channel Sales Channel Partners Start-ups Partner Management Demand Generation Go-to-market Strategy Enterprise Software Business Development Data Center Product Launch Telecommunications Sales SaaS Management Solution Selling Networking Competitive Analysis Analytics Marketing Cloud Computing Business Alliances Virtualization Storage Leadership See 18+     See less Strategic Partnerships New Business Development Product Marketing Marketing Management Strategic Planning Customer Presentations Product Management Product Strategy Partnership Management Channel Sales Channel Partners Start-ups Partner Management Demand Generation Go-to-market Strategy Enterprise Software Business Development Data Center Product Launch Telecommunications Sales SaaS Management Solution Selling Networking Competitive Analysis Analytics Marketing Cloud Computing Business Alliances Virtualization Storage Leadership See 18+     See less Strategic Partnerships New Business Development Product Marketing Marketing Management Strategic Planning Customer Presentations Product Management Product Strategy Partnership Management Channel Sales Channel Partners Start-ups Partner Management Demand Generation Go-to-market Strategy Enterprise Software Business Development Data Center Product Launch Telecommunications Sales SaaS Management Solution Selling Networking Competitive Analysis Analytics Marketing Cloud Computing Business Alliances Virtualization Storage Leadership See 18+     See less Education Purdue University BS,  Electrical Engineering Purdue University MS,  Industrial Administration (MBA equivalent) Purdue University BS,  Electrical Engineering Purdue University BS,  Electrical Engineering Purdue University BS,  Electrical Engineering Purdue University MS,  Industrial Administration (MBA equivalent) Purdue University MS,  Industrial Administration (MBA equivalent) Purdue University MS,  Industrial Administration (MBA equivalent) ", "Summary Insightful, passionate and engaging business leader with talent for quickly identifying new market opportunities and creating solutions to accelerate growth. Dynamic team player skilled at collaborating across business functions to build products and deliver services for increased revenue. Proven success at Intel, Accenture and G2 Web Services with client focused roles in business development, sales, marketing, and product management. Demonstrated excellence in identifying and enhancing global client and partner relationships. Outstanding skills in building, managing and leading high performance teams to deliver key wins and superior results.  \n \n \nExecutive Vice President, G2 Web Services: \nManaged business operations, marketing, client management and partnerships to achieve significant business growth resulting in sale to Primus-capital; Promoted to EVP upon sale to drive continued business growth and product improvements. \n \nChief Operating Officer, Landmark Development Ventures: \nRan real estate development portfolio in excess of $110M across 18 business entities. \n \nDirector of Marketing, Intel Corporation: \nDelivered $125M in incremental revenue through GTM programs and key customer wins for mobile field force solutions \n \nManager, Accenture: \nWorked in Technology Integration Services to design and deliver IT systems to high profile clients \n \n \nTrack record of success in both startup and Fortune 500 environments \n \nSkill Areas: \nExecutive Leadership, Business Development, Global Expansion, Operations, Client Management, Marketing, Product Development, Sales, Strategy, Business Management and Team Management. Summary Insightful, passionate and engaging business leader with talent for quickly identifying new market opportunities and creating solutions to accelerate growth. Dynamic team player skilled at collaborating across business functions to build products and deliver services for increased revenue. Proven success at Intel, Accenture and G2 Web Services with client focused roles in business development, sales, marketing, and product management. Demonstrated excellence in identifying and enhancing global client and partner relationships. Outstanding skills in building, managing and leading high performance teams to deliver key wins and superior results.  \n \n \nExecutive Vice President, G2 Web Services: \nManaged business operations, marketing, client management and partnerships to achieve significant business growth resulting in sale to Primus-capital; Promoted to EVP upon sale to drive continued business growth and product improvements. \n \nChief Operating Officer, Landmark Development Ventures: \nRan real estate development portfolio in excess of $110M across 18 business entities. \n \nDirector of Marketing, Intel Corporation: \nDelivered $125M in incremental revenue through GTM programs and key customer wins for mobile field force solutions \n \nManager, Accenture: \nWorked in Technology Integration Services to design and deliver IT systems to high profile clients \n \n \nTrack record of success in both startup and Fortune 500 environments \n \nSkill Areas: \nExecutive Leadership, Business Development, Global Expansion, Operations, Client Management, Marketing, Product Development, Sales, Strategy, Business Management and Team Management. Insightful, passionate and engaging business leader with talent for quickly identifying new market opportunities and creating solutions to accelerate growth. Dynamic team player skilled at collaborating across business functions to build products and deliver services for increased revenue. Proven success at Intel, Accenture and G2 Web Services with client focused roles in business development, sales, marketing, and product management. Demonstrated excellence in identifying and enhancing global client and partner relationships. Outstanding skills in building, managing and leading high performance teams to deliver key wins and superior results.  \n \n \nExecutive Vice President, G2 Web Services: \nManaged business operations, marketing, client management and partnerships to achieve significant business growth resulting in sale to Primus-capital; Promoted to EVP upon sale to drive continued business growth and product improvements. \n \nChief Operating Officer, Landmark Development Ventures: \nRan real estate development portfolio in excess of $110M across 18 business entities. \n \nDirector of Marketing, Intel Corporation: \nDelivered $125M in incremental revenue through GTM programs and key customer wins for mobile field force solutions \n \nManager, Accenture: \nWorked in Technology Integration Services to design and deliver IT systems to high profile clients \n \n \nTrack record of success in both startup and Fortune 500 environments \n \nSkill Areas: \nExecutive Leadership, Business Development, Global Expansion, Operations, Client Management, Marketing, Product Development, Sales, Strategy, Business Management and Team Management. Insightful, passionate and engaging business leader with talent for quickly identifying new market opportunities and creating solutions to accelerate growth. Dynamic team player skilled at collaborating across business functions to build products and deliver services for increased revenue. Proven success at Intel, Accenture and G2 Web Services with client focused roles in business development, sales, marketing, and product management. Demonstrated excellence in identifying and enhancing global client and partner relationships. Outstanding skills in building, managing and leading high performance teams to deliver key wins and superior results.  \n \n \nExecutive Vice President, G2 Web Services: \nManaged business operations, marketing, client management and partnerships to achieve significant business growth resulting in sale to Primus-capital; Promoted to EVP upon sale to drive continued business growth and product improvements. \n \nChief Operating Officer, Landmark Development Ventures: \nRan real estate development portfolio in excess of $110M across 18 business entities. \n \nDirector of Marketing, Intel Corporation: \nDelivered $125M in incremental revenue through GTM programs and key customer wins for mobile field force solutions \n \nManager, Accenture: \nWorked in Technology Integration Services to design and deliver IT systems to high profile clients \n \n \nTrack record of success in both startup and Fortune 500 environments \n \nSkill Areas: \nExecutive Leadership, Business Development, Global Expansion, Operations, Client Management, Marketing, Product Development, Sales, Strategy, Business Management and Team Management. Experience Sr Director Avanade August 2014  – Present (1 year 1 month) Greater Seattle Area Focused on accelerating application development and migration to Microsoft Azure within Avanade's Global Service Line organization under the Software and Cloud Services group. Executive Vice President G2 Web Services December 2011  –  2014  (3 years) Bellevue, WA G2 is SaaS-based provider of risk management solutions for world’s largest financial institutions and corporate brands. G2 Web Services are used to manage risk, drive compliance and combat fraud in order to build integrity, trust and confidence in payments. Clients include Visa, Mastercard, American Express, PayPal, Bank of America, Barclaycard, Bank of China, HSBC and many others.  \n \nAs EVP, I am responsible for worldwide products and development of all G2 solutions and services. My role also includes driving business development and strategic planning for G2 while forming business partnerships that expand G2’s global business. \n \n• Managed worldwide strategy and business development to deliver increased revenues and  \nglobal market leadership. Increased revenue from $7.8M to $18.8M resulting in 25% CAGR. \n• Established worldwide strategic relationships with global card networks to drive risk management  \nservices to over 240 global financial services industry clients. Secured new strategic  \npartnership through Operation Pangea for $5M worldwide brand program with American  \nExpress  \n• Created and launched three new services to address worldwide industry fraud and affiliate  \nmarketing issues as well as Global Boarding solutions to drive consistent merchant risk  \nmanagement. \n• Submitted US Provisional Patent for boarding and due diligence solution (#61/889,440). VP of Client Services and Business Operations G2 Web Services July 2009  –  January 2012  (2 years 7 months) Bellevue, WA Selected by founders as the first executive hire to the company with the role of managing worldwide business operations including the development of operational dashboards and processes to improve delivery. In this role, expanded responsibilities through establishing the marketing team and creating the client management function to drive the expansion of G2’s worldwide business. \n \n• Managed team of 43 employees across multiple business functions to delivered worldwide services at 76.94% of budget resulting in $764,000 annual cost savings. Established operational dashboard to baseline business and costs drivers for P&L management. \n• Created Client Management team to expand global service offerings, provide European and Asian presence while growing client base by 120% over three year period. Improved overall client satisfaction level from 7.9 to 8.4 as measured by annual client survey. \n• Launched G2 Risk Summit to establish thought leadership and yearly global risk management forum with participation from key clients, major brands and worldwide law enforcement agencies. Chief Operating Officer Landmark Development Ventures October 2005  –  January 2009  (3 years 4 months) Vancouver, WA Managed financial, operational and marketing responsibilities for development projects in $110M+ portfolio, including 18 entities and companies across Oregon and Washington. Drove efforts at each project stage, from opportunity identification through profitable sale of properties. Conducted due diligence, championed investment decisions, sourced project team resources, developed contracts, raised capital funding, managed projects, secure government approvals, and negotiated property sales. Supervised 3rd-party legal team, liaised with investors, and drove P&L accountability for each project. Devised and implemented corporate business development strategy including portfolio approach, investment fund, and joint venture models. Executed day-to-day project management and financial activities. \n \n• Managed real estate development portfolio in excess of $110M across 18 business entities. \n• Created and directed $3.8M investor program of SEC regulated funds from high net worth to consistently deliver in excess of 20% ROI for stakeholders. \n• Developed corporate strategy for new business development including portfolio approach, investment funds, strategic partnerships, and joint venture models. Director of Marketing Intel Corporation August 1998  –  October 2005  (7 years 3 months) Portland, Oregon Area Worldwide Mobile Solutions, 2003 - 2005 \nDrove the adoption of mobile services worldwide. Identified and developed $12B new market opportunity for mobile field workers. Cultivated partnerships with other software and hardware entities, created marketing programs, defined revenue targets, managed budgets, and delivered proof points. \n \nRegional Manager, Intel Solution Services 2000-2003 \nPioneered start-up of new professional IT consulting services catering to Fortune 500 customers; Managed P&L and business development for 30-member team of consultants, project managers, and sales professionals. \n \nProduct Marketing Engineer 1998-2000 \nManaged product marketing activities and launch for Intel's first 64-bit microprocessor Manager Accenture January 1992  –  August 1996  (4 years 8 months) Greater Chicago Area Began with company as consultant with Technology Integration Services out of worldwide technology headquarters. Promoted to Manager in 4.5 years based on proven results and demonstrated leadership. \n \n• Led strategic benchmark of customer service center for financial services company to reduce average call wait time by 62% and reduce operating costs by 15% annually through integrated voice response technology, staffing changes and overall technology improvements. \n• Managed technical architecture team of 18 professionals to design and build an information system for 400-person call center of major financial services institution. \n• Designed, developed and programmed technical infrastructure of customer information system for world-class utility company, infrastructure tools for medical products company and software applications for professional Indy Car racing team. Sr Director Avanade August 2014  – Present (1 year 1 month) Greater Seattle Area Focused on accelerating application development and migration to Microsoft Azure within Avanade's Global Service Line organization under the Software and Cloud Services group. Sr Director Avanade August 2014  – Present (1 year 1 month) Greater Seattle Area Focused on accelerating application development and migration to Microsoft Azure within Avanade's Global Service Line organization under the Software and Cloud Services group. Executive Vice President G2 Web Services December 2011  –  2014  (3 years) Bellevue, WA G2 is SaaS-based provider of risk management solutions for world’s largest financial institutions and corporate brands. G2 Web Services are used to manage risk, drive compliance and combat fraud in order to build integrity, trust and confidence in payments. Clients include Visa, Mastercard, American Express, PayPal, Bank of America, Barclaycard, Bank of China, HSBC and many others.  \n \nAs EVP, I am responsible for worldwide products and development of all G2 solutions and services. My role also includes driving business development and strategic planning for G2 while forming business partnerships that expand G2’s global business. \n \n• Managed worldwide strategy and business development to deliver increased revenues and  \nglobal market leadership. Increased revenue from $7.8M to $18.8M resulting in 25% CAGR. \n• Established worldwide strategic relationships with global card networks to drive risk management  \nservices to over 240 global financial services industry clients. Secured new strategic  \npartnership through Operation Pangea for $5M worldwide brand program with American  \nExpress  \n• Created and launched three new services to address worldwide industry fraud and affiliate  \nmarketing issues as well as Global Boarding solutions to drive consistent merchant risk  \nmanagement. \n• Submitted US Provisional Patent for boarding and due diligence solution (#61/889,440). Executive Vice President G2 Web Services December 2011  –  2014  (3 years) Bellevue, WA G2 is SaaS-based provider of risk management solutions for world’s largest financial institutions and corporate brands. G2 Web Services are used to manage risk, drive compliance and combat fraud in order to build integrity, trust and confidence in payments. Clients include Visa, Mastercard, American Express, PayPal, Bank of America, Barclaycard, Bank of China, HSBC and many others.  \n \nAs EVP, I am responsible for worldwide products and development of all G2 solutions and services. My role also includes driving business development and strategic planning for G2 while forming business partnerships that expand G2’s global business. \n \n• Managed worldwide strategy and business development to deliver increased revenues and  \nglobal market leadership. Increased revenue from $7.8M to $18.8M resulting in 25% CAGR. \n• Established worldwide strategic relationships with global card networks to drive risk management  \nservices to over 240 global financial services industry clients. Secured new strategic  \npartnership through Operation Pangea for $5M worldwide brand program with American  \nExpress  \n• Created and launched three new services to address worldwide industry fraud and affiliate  \nmarketing issues as well as Global Boarding solutions to drive consistent merchant risk  \nmanagement. \n• Submitted US Provisional Patent for boarding and due diligence solution (#61/889,440). VP of Client Services and Business Operations G2 Web Services July 2009  –  January 2012  (2 years 7 months) Bellevue, WA Selected by founders as the first executive hire to the company with the role of managing worldwide business operations including the development of operational dashboards and processes to improve delivery. In this role, expanded responsibilities through establishing the marketing team and creating the client management function to drive the expansion of G2’s worldwide business. \n \n• Managed team of 43 employees across multiple business functions to delivered worldwide services at 76.94% of budget resulting in $764,000 annual cost savings. Established operational dashboard to baseline business and costs drivers for P&L management. \n• Created Client Management team to expand global service offerings, provide European and Asian presence while growing client base by 120% over three year period. Improved overall client satisfaction level from 7.9 to 8.4 as measured by annual client survey. \n• Launched G2 Risk Summit to establish thought leadership and yearly global risk management forum with participation from key clients, major brands and worldwide law enforcement agencies. VP of Client Services and Business Operations G2 Web Services July 2009  –  January 2012  (2 years 7 months) Bellevue, WA Selected by founders as the first executive hire to the company with the role of managing worldwide business operations including the development of operational dashboards and processes to improve delivery. In this role, expanded responsibilities through establishing the marketing team and creating the client management function to drive the expansion of G2’s worldwide business. \n \n• Managed team of 43 employees across multiple business functions to delivered worldwide services at 76.94% of budget resulting in $764,000 annual cost savings. Established operational dashboard to baseline business and costs drivers for P&L management. \n• Created Client Management team to expand global service offerings, provide European and Asian presence while growing client base by 120% over three year period. Improved overall client satisfaction level from 7.9 to 8.4 as measured by annual client survey. \n• Launched G2 Risk Summit to establish thought leadership and yearly global risk management forum with participation from key clients, major brands and worldwide law enforcement agencies. Chief Operating Officer Landmark Development Ventures October 2005  –  January 2009  (3 years 4 months) Vancouver, WA Managed financial, operational and marketing responsibilities for development projects in $110M+ portfolio, including 18 entities and companies across Oregon and Washington. Drove efforts at each project stage, from opportunity identification through profitable sale of properties. Conducted due diligence, championed investment decisions, sourced project team resources, developed contracts, raised capital funding, managed projects, secure government approvals, and negotiated property sales. Supervised 3rd-party legal team, liaised with investors, and drove P&L accountability for each project. Devised and implemented corporate business development strategy including portfolio approach, investment fund, and joint venture models. Executed day-to-day project management and financial activities. \n \n• Managed real estate development portfolio in excess of $110M across 18 business entities. \n• Created and directed $3.8M investor program of SEC regulated funds from high net worth to consistently deliver in excess of 20% ROI for stakeholders. \n• Developed corporate strategy for new business development including portfolio approach, investment funds, strategic partnerships, and joint venture models. Chief Operating Officer Landmark Development Ventures October 2005  –  January 2009  (3 years 4 months) Vancouver, WA Managed financial, operational and marketing responsibilities for development projects in $110M+ portfolio, including 18 entities and companies across Oregon and Washington. Drove efforts at each project stage, from opportunity identification through profitable sale of properties. Conducted due diligence, championed investment decisions, sourced project team resources, developed contracts, raised capital funding, managed projects, secure government approvals, and negotiated property sales. Supervised 3rd-party legal team, liaised with investors, and drove P&L accountability for each project. Devised and implemented corporate business development strategy including portfolio approach, investment fund, and joint venture models. Executed day-to-day project management and financial activities. \n \n• Managed real estate development portfolio in excess of $110M across 18 business entities. \n• Created and directed $3.8M investor program of SEC regulated funds from high net worth to consistently deliver in excess of 20% ROI for stakeholders. \n• Developed corporate strategy for new business development including portfolio approach, investment funds, strategic partnerships, and joint venture models. Director of Marketing Intel Corporation August 1998  –  October 2005  (7 years 3 months) Portland, Oregon Area Worldwide Mobile Solutions, 2003 - 2005 \nDrove the adoption of mobile services worldwide. Identified and developed $12B new market opportunity for mobile field workers. Cultivated partnerships with other software and hardware entities, created marketing programs, defined revenue targets, managed budgets, and delivered proof points. \n \nRegional Manager, Intel Solution Services 2000-2003 \nPioneered start-up of new professional IT consulting services catering to Fortune 500 customers; Managed P&L and business development for 30-member team of consultants, project managers, and sales professionals. \n \nProduct Marketing Engineer 1998-2000 \nManaged product marketing activities and launch for Intel's first 64-bit microprocessor Director of Marketing Intel Corporation August 1998  –  October 2005  (7 years 3 months) Portland, Oregon Area Worldwide Mobile Solutions, 2003 - 2005 \nDrove the adoption of mobile services worldwide. Identified and developed $12B new market opportunity for mobile field workers. Cultivated partnerships with other software and hardware entities, created marketing programs, defined revenue targets, managed budgets, and delivered proof points. \n \nRegional Manager, Intel Solution Services 2000-2003 \nPioneered start-up of new professional IT consulting services catering to Fortune 500 customers; Managed P&L and business development for 30-member team of consultants, project managers, and sales professionals. \n \nProduct Marketing Engineer 1998-2000 \nManaged product marketing activities and launch for Intel's first 64-bit microprocessor Manager Accenture January 1992  –  August 1996  (4 years 8 months) Greater Chicago Area Began with company as consultant with Technology Integration Services out of worldwide technology headquarters. Promoted to Manager in 4.5 years based on proven results and demonstrated leadership. \n \n• Led strategic benchmark of customer service center for financial services company to reduce average call wait time by 62% and reduce operating costs by 15% annually through integrated voice response technology, staffing changes and overall technology improvements. \n• Managed technical architecture team of 18 professionals to design and build an information system for 400-person call center of major financial services institution. \n• Designed, developed and programmed technical infrastructure of customer information system for world-class utility company, infrastructure tools for medical products company and software applications for professional Indy Car racing team. Manager Accenture January 1992  –  August 1996  (4 years 8 months) Greater Chicago Area Began with company as consultant with Technology Integration Services out of worldwide technology headquarters. Promoted to Manager in 4.5 years based on proven results and demonstrated leadership. \n \n• Led strategic benchmark of customer service center for financial services company to reduce average call wait time by 62% and reduce operating costs by 15% annually through integrated voice response technology, staffing changes and overall technology improvements. \n• Managed technical architecture team of 18 professionals to design and build an information system for 400-person call center of major financial services institution. \n• Designed, developed and programmed technical infrastructure of customer information system for world-class utility company, infrastructure tools for medical products company and software applications for professional Indy Car racing team. Skills Strategic Planning Strategy Entrepreneurship Start-ups Business Development Product Marketing Cross-functional Team... Program Management Product Development Product Management Management Marketing E-commerce CRM Leadership Project Management Strategic Partnerships Team Building Team Leadership Vendor Management Business Strategy Risk Management Marketing Strategy New Business Development Budgets Sales Cloud Computing Consulting SaaS Partner Management See 15+     See less Skills  Strategic Planning Strategy Entrepreneurship Start-ups Business Development Product Marketing Cross-functional Team... Program Management Product Development Product Management Management Marketing E-commerce CRM Leadership Project Management Strategic Partnerships Team Building Team Leadership Vendor Management Business Strategy Risk Management Marketing Strategy New Business Development Budgets Sales Cloud Computing Consulting SaaS Partner Management See 15+     See less Strategic Planning Strategy Entrepreneurship Start-ups Business Development Product Marketing Cross-functional Team... Program Management Product Development Product Management Management Marketing E-commerce CRM Leadership Project Management Strategic Partnerships Team Building Team Leadership Vendor Management Business Strategy Risk Management Marketing Strategy New Business Development Budgets Sales Cloud Computing Consulting SaaS Partner Management See 15+     See less Strategic Planning Strategy Entrepreneurship Start-ups Business Development Product Marketing Cross-functional Team... Program Management Product Development Product Management Management Marketing E-commerce CRM Leadership Project Management Strategic Partnerships Team Building Team Leadership Vendor Management Business Strategy Risk Management Marketing Strategy New Business Development Budgets Sales Cloud Computing Consulting SaaS Partner Management See 15+     See less Education Northwestern University - Kellogg School of Management MBA,  Marketing ,  Finance and General Management 1996  – 1998 Activities and Societies:  Alumni interview committee University of Michigan BSEE,  Electrical Engineering 1987  – 1991 Activities and Societies:  University of Michigan Crew Team\nSigma Alpha Epsilon Fraternity Northwestern University - Kellogg School of Management MBA,  Marketing ,  Finance and General Management 1996  – 1998 Activities and Societies:  Alumni interview committee Northwestern University - Kellogg School of Management MBA,  Marketing ,  Finance and General Management 1996  – 1998 Activities and Societies:  Alumni interview committee Northwestern University - Kellogg School of Management MBA,  Marketing ,  Finance and General Management 1996  – 1998 Activities and Societies:  Alumni interview committee University of Michigan BSEE,  Electrical Engineering 1987  – 1991 Activities and Societies:  University of Michigan Crew Team\nSigma Alpha Epsilon Fraternity University of Michigan BSEE,  Electrical Engineering 1987  – 1991 Activities and Societies:  University of Michigan Crew Team\nSigma Alpha Epsilon Fraternity University of Michigan BSEE,  Electrical Engineering 1987  – 1991 Activities and Societies:  University of Michigan Crew Team\nSigma Alpha Epsilon Fraternity ", "Summary Insightful, passionate and engaging business leader with talent for quickly identifying new market opportunities and creating solutions to accelerate growth. Dynamic team player skilled at collaborating across business functions to build products and deliver services for increased revenue. Proven success at Intel, Accenture and G2 Web Services with client focused roles in business development, sales, marketing, and product management. Demonstrated excellence in identifying and enhancing global client and partner relationships. Outstanding skills in building, managing and leading high performance teams to deliver key wins and superior results.  \n \n \nExecutive Vice President, G2 Web Services: \nManaged business operations, marketing, client management and partnerships to achieve significant business growth resulting in sale to Primus-capital; Promoted to EVP upon sale to drive continued business growth and product improvements. \n \nChief Operating Officer, Landmark Development Ventures: \nRan real estate development portfolio in excess of $110M across 18 business entities. \n \nDirector of Marketing, Intel Corporation: \nDelivered $125M in incremental revenue through GTM programs and key customer wins for mobile field force solutions \n \nManager, Accenture: \nWorked in Technology Integration Services to design and deliver IT systems to high profile clients \n \n \nTrack record of success in both startup and Fortune 500 environments \n \nSkill Areas: \nExecutive Leadership, Business Development, Global Expansion, Operations, Client Management, Marketing, Product Development, Sales, Strategy, Business Management and Team Management. Summary Insightful, passionate and engaging business leader with talent for quickly identifying new market opportunities and creating solutions to accelerate growth. Dynamic team player skilled at collaborating across business functions to build products and deliver services for increased revenue. Proven success at Intel, Accenture and G2 Web Services with client focused roles in business development, sales, marketing, and product management. Demonstrated excellence in identifying and enhancing global client and partner relationships. Outstanding skills in building, managing and leading high performance teams to deliver key wins and superior results.  \n \n \nExecutive Vice President, G2 Web Services: \nManaged business operations, marketing, client management and partnerships to achieve significant business growth resulting in sale to Primus-capital; Promoted to EVP upon sale to drive continued business growth and product improvements. \n \nChief Operating Officer, Landmark Development Ventures: \nRan real estate development portfolio in excess of $110M across 18 business entities. \n \nDirector of Marketing, Intel Corporation: \nDelivered $125M in incremental revenue through GTM programs and key customer wins for mobile field force solutions \n \nManager, Accenture: \nWorked in Technology Integration Services to design and deliver IT systems to high profile clients \n \n \nTrack record of success in both startup and Fortune 500 environments \n \nSkill Areas: \nExecutive Leadership, Business Development, Global Expansion, Operations, Client Management, Marketing, Product Development, Sales, Strategy, Business Management and Team Management. Insightful, passionate and engaging business leader with talent for quickly identifying new market opportunities and creating solutions to accelerate growth. Dynamic team player skilled at collaborating across business functions to build products and deliver services for increased revenue. Proven success at Intel, Accenture and G2 Web Services with client focused roles in business development, sales, marketing, and product management. Demonstrated excellence in identifying and enhancing global client and partner relationships. Outstanding skills in building, managing and leading high performance teams to deliver key wins and superior results.  \n \n \nExecutive Vice President, G2 Web Services: \nManaged business operations, marketing, client management and partnerships to achieve significant business growth resulting in sale to Primus-capital; Promoted to EVP upon sale to drive continued business growth and product improvements. \n \nChief Operating Officer, Landmark Development Ventures: \nRan real estate development portfolio in excess of $110M across 18 business entities. \n \nDirector of Marketing, Intel Corporation: \nDelivered $125M in incremental revenue through GTM programs and key customer wins for mobile field force solutions \n \nManager, Accenture: \nWorked in Technology Integration Services to design and deliver IT systems to high profile clients \n \n \nTrack record of success in both startup and Fortune 500 environments \n \nSkill Areas: \nExecutive Leadership, Business Development, Global Expansion, Operations, Client Management, Marketing, Product Development, Sales, Strategy, Business Management and Team Management. Insightful, passionate and engaging business leader with talent for quickly identifying new market opportunities and creating solutions to accelerate growth. Dynamic team player skilled at collaborating across business functions to build products and deliver services for increased revenue. Proven success at Intel, Accenture and G2 Web Services with client focused roles in business development, sales, marketing, and product management. Demonstrated excellence in identifying and enhancing global client and partner relationships. Outstanding skills in building, managing and leading high performance teams to deliver key wins and superior results.  \n \n \nExecutive Vice President, G2 Web Services: \nManaged business operations, marketing, client management and partnerships to achieve significant business growth resulting in sale to Primus-capital; Promoted to EVP upon sale to drive continued business growth and product improvements. \n \nChief Operating Officer, Landmark Development Ventures: \nRan real estate development portfolio in excess of $110M across 18 business entities. \n \nDirector of Marketing, Intel Corporation: \nDelivered $125M in incremental revenue through GTM programs and key customer wins for mobile field force solutions \n \nManager, Accenture: \nWorked in Technology Integration Services to design and deliver IT systems to high profile clients \n \n \nTrack record of success in both startup and Fortune 500 environments \n \nSkill Areas: \nExecutive Leadership, Business Development, Global Expansion, Operations, Client Management, Marketing, Product Development, Sales, Strategy, Business Management and Team Management. Experience Sr Director Avanade August 2014  – Present (1 year 1 month) Greater Seattle Area Focused on accelerating application development and migration to Microsoft Azure within Avanade's Global Service Line organization under the Software and Cloud Services group. Executive Vice President G2 Web Services December 2011  –  2014  (3 years) Bellevue, WA G2 is SaaS-based provider of risk management solutions for world’s largest financial institutions and corporate brands. G2 Web Services are used to manage risk, drive compliance and combat fraud in order to build integrity, trust and confidence in payments. Clients include Visa, Mastercard, American Express, PayPal, Bank of America, Barclaycard, Bank of China, HSBC and many others.  \n \nAs EVP, I am responsible for worldwide products and development of all G2 solutions and services. My role also includes driving business development and strategic planning for G2 while forming business partnerships that expand G2’s global business. \n \n• Managed worldwide strategy and business development to deliver increased revenues and  \nglobal market leadership. Increased revenue from $7.8M to $18.8M resulting in 25% CAGR. \n• Established worldwide strategic relationships with global card networks to drive risk management  \nservices to over 240 global financial services industry clients. Secured new strategic  \npartnership through Operation Pangea for $5M worldwide brand program with American  \nExpress  \n• Created and launched three new services to address worldwide industry fraud and affiliate  \nmarketing issues as well as Global Boarding solutions to drive consistent merchant risk  \nmanagement. \n• Submitted US Provisional Patent for boarding and due diligence solution (#61/889,440). VP of Client Services and Business Operations G2 Web Services July 2009  –  January 2012  (2 years 7 months) Bellevue, WA Selected by founders as the first executive hire to the company with the role of managing worldwide business operations including the development of operational dashboards and processes to improve delivery. In this role, expanded responsibilities through establishing the marketing team and creating the client management function to drive the expansion of G2’s worldwide business. \n \n• Managed team of 43 employees across multiple business functions to delivered worldwide services at 76.94% of budget resulting in $764,000 annual cost savings. Established operational dashboard to baseline business and costs drivers for P&L management. \n• Created Client Management team to expand global service offerings, provide European and Asian presence while growing client base by 120% over three year period. Improved overall client satisfaction level from 7.9 to 8.4 as measured by annual client survey. \n• Launched G2 Risk Summit to establish thought leadership and yearly global risk management forum with participation from key clients, major brands and worldwide law enforcement agencies. Chief Operating Officer Landmark Development Ventures October 2005  –  January 2009  (3 years 4 months) Vancouver, WA Managed financial, operational and marketing responsibilities for development projects in $110M+ portfolio, including 18 entities and companies across Oregon and Washington. Drove efforts at each project stage, from opportunity identification through profitable sale of properties. Conducted due diligence, championed investment decisions, sourced project team resources, developed contracts, raised capital funding, managed projects, secure government approvals, and negotiated property sales. Supervised 3rd-party legal team, liaised with investors, and drove P&L accountability for each project. Devised and implemented corporate business development strategy including portfolio approach, investment fund, and joint venture models. Executed day-to-day project management and financial activities. \n \n• Managed real estate development portfolio in excess of $110M across 18 business entities. \n• Created and directed $3.8M investor program of SEC regulated funds from high net worth to consistently deliver in excess of 20% ROI for stakeholders. \n• Developed corporate strategy for new business development including portfolio approach, investment funds, strategic partnerships, and joint venture models. Director of Marketing Intel Corporation August 1998  –  October 2005  (7 years 3 months) Portland, Oregon Area Worldwide Mobile Solutions, 2003 - 2005 \nDrove the adoption of mobile services worldwide. Identified and developed $12B new market opportunity for mobile field workers. Cultivated partnerships with other software and hardware entities, created marketing programs, defined revenue targets, managed budgets, and delivered proof points. \n \nRegional Manager, Intel Solution Services 2000-2003 \nPioneered start-up of new professional IT consulting services catering to Fortune 500 customers; Managed P&L and business development for 30-member team of consultants, project managers, and sales professionals. \n \nProduct Marketing Engineer 1998-2000 \nManaged product marketing activities and launch for Intel's first 64-bit microprocessor Manager Accenture January 1992  –  August 1996  (4 years 8 months) Greater Chicago Area Began with company as consultant with Technology Integration Services out of worldwide technology headquarters. Promoted to Manager in 4.5 years based on proven results and demonstrated leadership. \n \n• Led strategic benchmark of customer service center for financial services company to reduce average call wait time by 62% and reduce operating costs by 15% annually through integrated voice response technology, staffing changes and overall technology improvements. \n• Managed technical architecture team of 18 professionals to design and build an information system for 400-person call center of major financial services institution. \n• Designed, developed and programmed technical infrastructure of customer information system for world-class utility company, infrastructure tools for medical products company and software applications for professional Indy Car racing team. Sr Director Avanade August 2014  – Present (1 year 1 month) Greater Seattle Area Focused on accelerating application development and migration to Microsoft Azure within Avanade's Global Service Line organization under the Software and Cloud Services group. Sr Director Avanade August 2014  – Present (1 year 1 month) Greater Seattle Area Focused on accelerating application development and migration to Microsoft Azure within Avanade's Global Service Line organization under the Software and Cloud Services group. Executive Vice President G2 Web Services December 2011  –  2014  (3 years) Bellevue, WA G2 is SaaS-based provider of risk management solutions for world’s largest financial institutions and corporate brands. G2 Web Services are used to manage risk, drive compliance and combat fraud in order to build integrity, trust and confidence in payments. Clients include Visa, Mastercard, American Express, PayPal, Bank of America, Barclaycard, Bank of China, HSBC and many others.  \n \nAs EVP, I am responsible for worldwide products and development of all G2 solutions and services. My role also includes driving business development and strategic planning for G2 while forming business partnerships that expand G2’s global business. \n \n• Managed worldwide strategy and business development to deliver increased revenues and  \nglobal market leadership. Increased revenue from $7.8M to $18.8M resulting in 25% CAGR. \n• Established worldwide strategic relationships with global card networks to drive risk management  \nservices to over 240 global financial services industry clients. Secured new strategic  \npartnership through Operation Pangea for $5M worldwide brand program with American  \nExpress  \n• Created and launched three new services to address worldwide industry fraud and affiliate  \nmarketing issues as well as Global Boarding solutions to drive consistent merchant risk  \nmanagement. \n• Submitted US Provisional Patent for boarding and due diligence solution (#61/889,440). Executive Vice President G2 Web Services December 2011  –  2014  (3 years) Bellevue, WA G2 is SaaS-based provider of risk management solutions for world’s largest financial institutions and corporate brands. G2 Web Services are used to manage risk, drive compliance and combat fraud in order to build integrity, trust and confidence in payments. Clients include Visa, Mastercard, American Express, PayPal, Bank of America, Barclaycard, Bank of China, HSBC and many others.  \n \nAs EVP, I am responsible for worldwide products and development of all G2 solutions and services. My role also includes driving business development and strategic planning for G2 while forming business partnerships that expand G2’s global business. \n \n• Managed worldwide strategy and business development to deliver increased revenues and  \nglobal market leadership. Increased revenue from $7.8M to $18.8M resulting in 25% CAGR. \n• Established worldwide strategic relationships with global card networks to drive risk management  \nservices to over 240 global financial services industry clients. Secured new strategic  \npartnership through Operation Pangea for $5M worldwide brand program with American  \nExpress  \n• Created and launched three new services to address worldwide industry fraud and affiliate  \nmarketing issues as well as Global Boarding solutions to drive consistent merchant risk  \nmanagement. \n• Submitted US Provisional Patent for boarding and due diligence solution (#61/889,440). VP of Client Services and Business Operations G2 Web Services July 2009  –  January 2012  (2 years 7 months) Bellevue, WA Selected by founders as the first executive hire to the company with the role of managing worldwide business operations including the development of operational dashboards and processes to improve delivery. In this role, expanded responsibilities through establishing the marketing team and creating the client management function to drive the expansion of G2’s worldwide business. \n \n• Managed team of 43 employees across multiple business functions to delivered worldwide services at 76.94% of budget resulting in $764,000 annual cost savings. Established operational dashboard to baseline business and costs drivers for P&L management. \n• Created Client Management team to expand global service offerings, provide European and Asian presence while growing client base by 120% over three year period. Improved overall client satisfaction level from 7.9 to 8.4 as measured by annual client survey. \n• Launched G2 Risk Summit to establish thought leadership and yearly global risk management forum with participation from key clients, major brands and worldwide law enforcement agencies. VP of Client Services and Business Operations G2 Web Services July 2009  –  January 2012  (2 years 7 months) Bellevue, WA Selected by founders as the first executive hire to the company with the role of managing worldwide business operations including the development of operational dashboards and processes to improve delivery. In this role, expanded responsibilities through establishing the marketing team and creating the client management function to drive the expansion of G2’s worldwide business. \n \n• Managed team of 43 employees across multiple business functions to delivered worldwide services at 76.94% of budget resulting in $764,000 annual cost savings. Established operational dashboard to baseline business and costs drivers for P&L management. \n• Created Client Management team to expand global service offerings, provide European and Asian presence while growing client base by 120% over three year period. Improved overall client satisfaction level from 7.9 to 8.4 as measured by annual client survey. \n• Launched G2 Risk Summit to establish thought leadership and yearly global risk management forum with participation from key clients, major brands and worldwide law enforcement agencies. Chief Operating Officer Landmark Development Ventures October 2005  –  January 2009  (3 years 4 months) Vancouver, WA Managed financial, operational and marketing responsibilities for development projects in $110M+ portfolio, including 18 entities and companies across Oregon and Washington. Drove efforts at each project stage, from opportunity identification through profitable sale of properties. Conducted due diligence, championed investment decisions, sourced project team resources, developed contracts, raised capital funding, managed projects, secure government approvals, and negotiated property sales. Supervised 3rd-party legal team, liaised with investors, and drove P&L accountability for each project. Devised and implemented corporate business development strategy including portfolio approach, investment fund, and joint venture models. Executed day-to-day project management and financial activities. \n \n• Managed real estate development portfolio in excess of $110M across 18 business entities. \n• Created and directed $3.8M investor program of SEC regulated funds from high net worth to consistently deliver in excess of 20% ROI for stakeholders. \n• Developed corporate strategy for new business development including portfolio approach, investment funds, strategic partnerships, and joint venture models. Chief Operating Officer Landmark Development Ventures October 2005  –  January 2009  (3 years 4 months) Vancouver, WA Managed financial, operational and marketing responsibilities for development projects in $110M+ portfolio, including 18 entities and companies across Oregon and Washington. Drove efforts at each project stage, from opportunity identification through profitable sale of properties. Conducted due diligence, championed investment decisions, sourced project team resources, developed contracts, raised capital funding, managed projects, secure government approvals, and negotiated property sales. Supervised 3rd-party legal team, liaised with investors, and drove P&L accountability for each project. Devised and implemented corporate business development strategy including portfolio approach, investment fund, and joint venture models. Executed day-to-day project management and financial activities. \n \n• Managed real estate development portfolio in excess of $110M across 18 business entities. \n• Created and directed $3.8M investor program of SEC regulated funds from high net worth to consistently deliver in excess of 20% ROI for stakeholders. \n• Developed corporate strategy for new business development including portfolio approach, investment funds, strategic partnerships, and joint venture models. Director of Marketing Intel Corporation August 1998  –  October 2005  (7 years 3 months) Portland, Oregon Area Worldwide Mobile Solutions, 2003 - 2005 \nDrove the adoption of mobile services worldwide. Identified and developed $12B new market opportunity for mobile field workers. Cultivated partnerships with other software and hardware entities, created marketing programs, defined revenue targets, managed budgets, and delivered proof points. \n \nRegional Manager, Intel Solution Services 2000-2003 \nPioneered start-up of new professional IT consulting services catering to Fortune 500 customers; Managed P&L and business development for 30-member team of consultants, project managers, and sales professionals. \n \nProduct Marketing Engineer 1998-2000 \nManaged product marketing activities and launch for Intel's first 64-bit microprocessor Director of Marketing Intel Corporation August 1998  –  October 2005  (7 years 3 months) Portland, Oregon Area Worldwide Mobile Solutions, 2003 - 2005 \nDrove the adoption of mobile services worldwide. Identified and developed $12B new market opportunity for mobile field workers. Cultivated partnerships with other software and hardware entities, created marketing programs, defined revenue targets, managed budgets, and delivered proof points. \n \nRegional Manager, Intel Solution Services 2000-2003 \nPioneered start-up of new professional IT consulting services catering to Fortune 500 customers; Managed P&L and business development for 30-member team of consultants, project managers, and sales professionals. \n \nProduct Marketing Engineer 1998-2000 \nManaged product marketing activities and launch for Intel's first 64-bit microprocessor Manager Accenture January 1992  –  August 1996  (4 years 8 months) Greater Chicago Area Began with company as consultant with Technology Integration Services out of worldwide technology headquarters. Promoted to Manager in 4.5 years based on proven results and demonstrated leadership. \n \n• Led strategic benchmark of customer service center for financial services company to reduce average call wait time by 62% and reduce operating costs by 15% annually through integrated voice response technology, staffing changes and overall technology improvements. \n• Managed technical architecture team of 18 professionals to design and build an information system for 400-person call center of major financial services institution. \n• Designed, developed and programmed technical infrastructure of customer information system for world-class utility company, infrastructure tools for medical products company and software applications for professional Indy Car racing team. Manager Accenture January 1992  –  August 1996  (4 years 8 months) Greater Chicago Area Began with company as consultant with Technology Integration Services out of worldwide technology headquarters. Promoted to Manager in 4.5 years based on proven results and demonstrated leadership. \n \n• Led strategic benchmark of customer service center for financial services company to reduce average call wait time by 62% and reduce operating costs by 15% annually through integrated voice response technology, staffing changes and overall technology improvements. \n• Managed technical architecture team of 18 professionals to design and build an information system for 400-person call center of major financial services institution. \n• Designed, developed and programmed technical infrastructure of customer information system for world-class utility company, infrastructure tools for medical products company and software applications for professional Indy Car racing team. Skills Strategic Planning Strategy Entrepreneurship Start-ups Business Development Product Marketing Cross-functional Team... Program Management Product Development Product Management Management Marketing E-commerce CRM Leadership Project Management Strategic Partnerships Team Building Team Leadership Vendor Management Business Strategy Risk Management Marketing Strategy New Business Development Budgets Sales Cloud Computing Consulting SaaS Partner Management See 15+     See less Skills  Strategic Planning Strategy Entrepreneurship Start-ups Business Development Product Marketing Cross-functional Team... Program Management Product Development Product Management Management Marketing E-commerce CRM Leadership Project Management Strategic Partnerships Team Building Team Leadership Vendor Management Business Strategy Risk Management Marketing Strategy New Business Development Budgets Sales Cloud Computing Consulting SaaS Partner Management See 15+     See less Strategic Planning Strategy Entrepreneurship Start-ups Business Development Product Marketing Cross-functional Team... Program Management Product Development Product Management Management Marketing E-commerce CRM Leadership Project Management Strategic Partnerships Team Building Team Leadership Vendor Management Business Strategy Risk Management Marketing Strategy New Business Development Budgets Sales Cloud Computing Consulting SaaS Partner Management See 15+     See less Strategic Planning Strategy Entrepreneurship Start-ups Business Development Product Marketing Cross-functional Team... Program Management Product Development Product Management Management Marketing E-commerce CRM Leadership Project Management Strategic Partnerships Team Building Team Leadership Vendor Management Business Strategy Risk Management Marketing Strategy New Business Development Budgets Sales Cloud Computing Consulting SaaS Partner Management See 15+     See less Education Northwestern University - Kellogg School of Management MBA,  Marketing ,  Finance and General Management 1996  – 1998 Activities and Societies:  Alumni interview committee University of Michigan BSEE,  Electrical Engineering 1987  – 1991 Activities and Societies:  University of Michigan Crew Team\nSigma Alpha Epsilon Fraternity Northwestern University - Kellogg School of Management MBA,  Marketing ,  Finance and General Management 1996  – 1998 Activities and Societies:  Alumni interview committee Northwestern University - Kellogg School of Management MBA,  Marketing ,  Finance and General Management 1996  – 1998 Activities and Societies:  Alumni interview committee Northwestern University - Kellogg School of Management MBA,  Marketing ,  Finance and General Management 1996  – 1998 Activities and Societies:  Alumni interview committee University of Michigan BSEE,  Electrical Engineering 1987  – 1991 Activities and Societies:  University of Michigan Crew Team\nSigma Alpha Epsilon Fraternity University of Michigan BSEE,  Electrical Engineering 1987  – 1991 Activities and Societies:  University of Michigan Crew Team\nSigma Alpha Epsilon Fraternity University of Michigan BSEE,  Electrical Engineering 1987  – 1991 Activities and Societies:  University of Michigan Crew Team\nSigma Alpha Epsilon Fraternity ", "Summary Tim Kober is the founding principal of Cedar Financial Advisors, an independent, fee-only financial planning firm based in Portland, Oregon.  \n \nMission: Provide individuals and families with a trusted and enduring advisory relationship so that they may realize personal goals by achieving long-term financial well-being. \n \nTim helps clients develop specific financial and life goals and then assists them in reaching those goals. Since the firm operates on a fee-only basis and does not accept commissions, Tim's advice can remain completely objective. Services include: \n \n1) Goal-based Comprehensive Financial Planning – advice is rendered in areas including cash flow and debt management, risk management, college funding, life and career changes, asset allocation and investment selection, retirement planning, stock option advice, tax planning, and estate planning.  \n \n2) Investment Management -- Focus is primarily on asset allocation and ongoing investment management using sound, academically proven strategies. \n \nSpecialties: Goal-based Financial Planning \nInvestment Management \nHealth Insurance Planning \nRetirement Planning \nFee-Only Summary Tim Kober is the founding principal of Cedar Financial Advisors, an independent, fee-only financial planning firm based in Portland, Oregon.  \n \nMission: Provide individuals and families with a trusted and enduring advisory relationship so that they may realize personal goals by achieving long-term financial well-being. \n \nTim helps clients develop specific financial and life goals and then assists them in reaching those goals. Since the firm operates on a fee-only basis and does not accept commissions, Tim's advice can remain completely objective. Services include: \n \n1) Goal-based Comprehensive Financial Planning – advice is rendered in areas including cash flow and debt management, risk management, college funding, life and career changes, asset allocation and investment selection, retirement planning, stock option advice, tax planning, and estate planning.  \n \n2) Investment Management -- Focus is primarily on asset allocation and ongoing investment management using sound, academically proven strategies. \n \nSpecialties: Goal-based Financial Planning \nInvestment Management \nHealth Insurance Planning \nRetirement Planning \nFee-Only Tim Kober is the founding principal of Cedar Financial Advisors, an independent, fee-only financial planning firm based in Portland, Oregon.  \n \nMission: Provide individuals and families with a trusted and enduring advisory relationship so that they may realize personal goals by achieving long-term financial well-being. \n \nTim helps clients develop specific financial and life goals and then assists them in reaching those goals. Since the firm operates on a fee-only basis and does not accept commissions, Tim's advice can remain completely objective. Services include: \n \n1) Goal-based Comprehensive Financial Planning – advice is rendered in areas including cash flow and debt management, risk management, college funding, life and career changes, asset allocation and investment selection, retirement planning, stock option advice, tax planning, and estate planning.  \n \n2) Investment Management -- Focus is primarily on asset allocation and ongoing investment management using sound, academically proven strategies. \n \nSpecialties: Goal-based Financial Planning \nInvestment Management \nHealth Insurance Planning \nRetirement Planning \nFee-Only Tim Kober is the founding principal of Cedar Financial Advisors, an independent, fee-only financial planning firm based in Portland, Oregon.  \n \nMission: Provide individuals and families with a trusted and enduring advisory relationship so that they may realize personal goals by achieving long-term financial well-being. \n \nTim helps clients develop specific financial and life goals and then assists them in reaching those goals. Since the firm operates on a fee-only basis and does not accept commissions, Tim's advice can remain completely objective. Services include: \n \n1) Goal-based Comprehensive Financial Planning – advice is rendered in areas including cash flow and debt management, risk management, college funding, life and career changes, asset allocation and investment selection, retirement planning, stock option advice, tax planning, and estate planning.  \n \n2) Investment Management -- Focus is primarily on asset allocation and ongoing investment management using sound, academically proven strategies. \n \nSpecialties: Goal-based Financial Planning \nInvestment Management \nHealth Insurance Planning \nRetirement Planning \nFee-Only Experience Principal Cedar Financial Advisors LLC December 2006  – Present (8 years 9 months) Principal Cedar Financial Advisors LLC December 2006  – Present (8 years 9 months) Principal Cedar Financial Advisors LLC December 2006  – Present (8 years 9 months) Skills Retirement Planning Investment Management Strategic Financial... Estate Planning Personal Finance Financial Planners Financial Advisory Investments Portfolio Management Asset Allocation Skills  Retirement Planning Investment Management Strategic Financial... Estate Planning Personal Finance Financial Planners Financial Advisory Investments Portfolio Management Asset Allocation Retirement Planning Investment Management Strategic Financial... Estate Planning Personal Finance Financial Planners Financial Advisory Investments Portfolio Management Asset Allocation Retirement Planning Investment Management Strategic Financial... Estate Planning Personal Finance Financial Planners Financial Advisory Investments Portfolio Management Asset Allocation Honors & Awards ", "Skills Business Strategy Team Leadership Marketing Program Management Skills  Business Strategy Team Leadership Marketing Program Management Business Strategy Team Leadership Marketing Program Management Business Strategy Team Leadership Marketing Program Management ", "Skills Strategy Product Marketing Semiconductors Product Management Cross-functional Team... Go-to-market Strategy Product Development Consumer Electronics Competitive Analysis SoC Product Launch IC Strategic Partnerships Product Lifecycle... Semiconductor Industry ASIC Technical Marketing Wireless Start-ups See 4+     See less Skills  Strategy Product Marketing Semiconductors Product Management Cross-functional Team... Go-to-market Strategy Product Development Consumer Electronics Competitive Analysis SoC Product Launch IC Strategic Partnerships Product Lifecycle... Semiconductor Industry ASIC Technical Marketing Wireless Start-ups See 4+     See less Strategy Product Marketing Semiconductors Product Management Cross-functional Team... Go-to-market Strategy Product Development Consumer Electronics Competitive Analysis SoC Product Launch IC Strategic Partnerships Product Lifecycle... Semiconductor Industry ASIC Technical Marketing Wireless Start-ups See 4+     See less Strategy Product Marketing Semiconductors Product Management Cross-functional Team... Go-to-market Strategy Product Development Consumer Electronics Competitive Analysis SoC Product Launch IC Strategic Partnerships Product Lifecycle... Semiconductor Industry ASIC Technical Marketing Wireless Start-ups See 4+     See less "]}