{"position": "Director, Human Resources", "company": "Google", "profiles": ["Skills Employee Engagement Change Management Leadership Development Cross-functional Team... Global HR Leadership Virtual Teams Organizational... Organizational Design Organizational... Organizational Structure Succession Planning Talent Management Learning Management Executive Coaching Growth Strategies International Growth Business Process Design Diversity & Inclusion Executive... Culture Change Workforce Planning Strategy Personnel Management Program Management Leadership Process Improvement Outsourcing Performance Improvement Management Team Building Executive Management Performance Management Human Resources Onboarding Strategic Planning HR Transformation HR Consulting See 22+     See less Skills  Employee Engagement Change Management Leadership Development Cross-functional Team... Global HR Leadership Virtual Teams Organizational... Organizational Design Organizational... Organizational Structure Succession Planning Talent Management Learning Management Executive Coaching Growth Strategies International Growth Business Process Design Diversity & Inclusion Executive... Culture Change Workforce Planning Strategy Personnel Management Program Management Leadership Process Improvement Outsourcing Performance Improvement Management Team Building Executive Management Performance Management Human Resources Onboarding Strategic Planning HR Transformation HR Consulting See 22+     See less Employee Engagement Change Management Leadership Development Cross-functional Team... Global HR Leadership Virtual Teams Organizational... Organizational Design Organizational... Organizational Structure Succession Planning Talent Management Learning Management Executive Coaching Growth Strategies International Growth Business Process Design Diversity & Inclusion Executive... Culture Change Workforce Planning Strategy Personnel Management Program Management Leadership Process Improvement Outsourcing Performance Improvement Management Team Building Executive Management Performance Management Human Resources Onboarding Strategic Planning HR Transformation HR Consulting See 22+     See less Employee Engagement Change Management Leadership Development Cross-functional Team... Global HR Leadership Virtual Teams Organizational... Organizational Design Organizational... Organizational Structure Succession Planning Talent Management Learning Management Executive Coaching Growth Strategies International Growth Business Process Design Diversity & Inclusion Executive... Culture Change Workforce Planning Strategy Personnel Management Program Management Leadership Process Improvement Outsourcing Performance Improvement Management Team Building Executive Management Performance Management Human Resources Onboarding Strategic Planning HR Transformation HR Consulting See 22+     See less ", "Languages English Native or bilingual proficiency Tagalog Native or bilingual proficiency Spanish Limited working proficiency German Elementary proficiency English Native or bilingual proficiency Tagalog Native or bilingual proficiency Spanish Limited working proficiency German Elementary proficiency English Native or bilingual proficiency Tagalog Native or bilingual proficiency Spanish Limited working proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Employee Relations Benefits Administration HR Policies Recruiting Talent Acquisition Employee Training Internal Investigations Workers' Compensation... Employee Opinion Surveys Coaching Staff Certified Hilton Trainer Labor Relations Performance Appraisal Onboarding Succession Planning Human Resources HRIS Payroll Training Management ADP Payroll Coaching Talent Management Talent Scouting See 9+     See less Skills  Employee Relations Benefits Administration HR Policies Recruiting Talent Acquisition Employee Training Internal Investigations Workers' Compensation... Employee Opinion Surveys Coaching Staff Certified Hilton Trainer Labor Relations Performance Appraisal Onboarding Succession Planning Human Resources HRIS Payroll Training Management ADP Payroll Coaching Talent Management Talent Scouting See 9+     See less Employee Relations Benefits Administration HR Policies Recruiting Talent Acquisition Employee Training Internal Investigations Workers' Compensation... Employee Opinion Surveys Coaching Staff Certified Hilton Trainer Labor Relations Performance Appraisal Onboarding Succession Planning Human Resources HRIS Payroll Training Management ADP Payroll Coaching Talent Management Talent Scouting See 9+     See less Employee Relations Benefits Administration HR Policies Recruiting Talent Acquisition Employee Training Internal Investigations Workers' Compensation... Employee Opinion Surveys Coaching Staff Certified Hilton Trainer Labor Relations Performance Appraisal Onboarding Succession Planning Human Resources HRIS Payroll Training Management ADP Payroll Coaching Talent Management Talent Scouting See 9+     See less Honors & Awards PHR (Professional in Human Resources) Certification HR Certification Institute June 2013 The certification, awarded by the HR Certification Institute, signifies that Errol Reyes possesses the theoretical knowledge and practical experience in human resource management necessary to pass a rigorous examination demonstrating a mastery of the field.  \n \n\"Certification as a human resource professional clearly demonstrates a commitment to personal excellence and to the human resource profession,\" said Mary Power, CAE, Executive Director of the HR Certification Institute.  \n \nTo become certified, an applicant must pass a comprehensive examination and demonstrate a strong background of professional human resource experience.  \n \nThe HR Certification Institute is the credentialing body for human resource professionals and is affiliated with the Society for Human Resource Management (SHRM), the world's largest organization dedicated exclusively to the human resource profession. The Institute's purpose is to promote the establishment of professional standards and to recognize professionals who meet those standards. PHR (Professional in Human Resources) Certification HR Certification Institute June 2013 The certification, awarded by the HR Certification Institute, signifies that Errol Reyes possesses the theoretical knowledge and practical experience in human resource management necessary to pass a rigorous examination demonstrating a mastery of the field.  \n \n\"Certification as a human resource professional clearly demonstrates a commitment to personal excellence and to the human resource profession,\" said Mary Power, CAE, Executive Director of the HR Certification Institute.  \n \nTo become certified, an applicant must pass a comprehensive examination and demonstrate a strong background of professional human resource experience.  \n \nThe HR Certification Institute is the credentialing body for human resource professionals and is affiliated with the Society for Human Resource Management (SHRM), the world's largest organization dedicated exclusively to the human resource profession. The Institute's purpose is to promote the establishment of professional standards and to recognize professionals who meet those standards. PHR (Professional in Human Resources) Certification HR Certification Institute June 2013 The certification, awarded by the HR Certification Institute, signifies that Errol Reyes possesses the theoretical knowledge and practical experience in human resource management necessary to pass a rigorous examination demonstrating a mastery of the field.  \n \n\"Certification as a human resource professional clearly demonstrates a commitment to personal excellence and to the human resource profession,\" said Mary Power, CAE, Executive Director of the HR Certification Institute.  \n \nTo become certified, an applicant must pass a comprehensive examination and demonstrate a strong background of professional human resource experience.  \n \nThe HR Certification Institute is the credentialing body for human resource professionals and is affiliated with the Society for Human Resource Management (SHRM), the world's largest organization dedicated exclusively to the human resource profession. The Institute's purpose is to promote the establishment of professional standards and to recognize professionals who meet those standards. PHR (Professional in Human Resources) Certification HR Certification Institute June 2013 The certification, awarded by the HR Certification Institute, signifies that Errol Reyes possesses the theoretical knowledge and practical experience in human resource management necessary to pass a rigorous examination demonstrating a mastery of the field.  \n \n\"Certification as a human resource professional clearly demonstrates a commitment to personal excellence and to the human resource profession,\" said Mary Power, CAE, Executive Director of the HR Certification Institute.  \n \nTo become certified, an applicant must pass a comprehensive examination and demonstrate a strong background of professional human resource experience.  \n \nThe HR Certification Institute is the credentialing body for human resource professionals and is affiliated with the Society for Human Resource Management (SHRM), the world's largest organization dedicated exclusively to the human resource profession. The Institute's purpose is to promote the establishment of professional standards and to recognize professionals who meet those standards. ", "Summary Carmen Cortez began her HR business partnering career at Apple Computer. She later joined Informix as a Director of Human Resources for the U.S., Canada, and Latin America Operations. After Informix, she decided to pursue experience in Asia by joining Fore Systems as the Director, HR for their Asia Pacific Operations. She commuted from San Jose, California, to Asia for two years. Once this assignment was over, Ms. Cortez joined Rational Software as the HR Director for the Global Sales organization.  \n \nThe following year, she joined Cisco Systems, Inc., where she has spent the last 12 years in several different positions, each one expanding her breadth and depth of business and HR experience. Carmen Cortez started her career at Cisco with the U.S. Service Provider Sales business. Her next assignment was as the HR leader for Canada and Latin America. In this role, she assisted with the growth of the company in Latin America and Canada by building an HR organization to support growth in these respective regions. \n \nHer next assignment took her to Europe. Ms. Cortez was promoted to the position of Director, HR for the Enterprise Sales organization across Europe, the Middle East, and Africa (EMEA).  \n \nAfter this assignment, she moved to Tokyo, Japan, to be the Country HR Leader/Director for Cisco Japan Operations. During her tenure in Japan, she also acted as the interim Employee Relations Leader for Asia Apac for six months. \n \nUpon her return to the United States, she took a role as an executive talent acquisition leader for the U.S. Sales organization. Ms. Cortez continued her success at Cisco, garnering accolades from the company.  \n \nShe then undertook responsibilities to lead HR for the Internet Business Solutions Group (IBSG), and held this position for almost six years. Concurrently, she was given different groups and senior executives to partner with. Summary Carmen Cortez began her HR business partnering career at Apple Computer. She later joined Informix as a Director of Human Resources for the U.S., Canada, and Latin America Operations. After Informix, she decided to pursue experience in Asia by joining Fore Systems as the Director, HR for their Asia Pacific Operations. She commuted from San Jose, California, to Asia for two years. Once this assignment was over, Ms. Cortez joined Rational Software as the HR Director for the Global Sales organization.  \n \nThe following year, she joined Cisco Systems, Inc., where she has spent the last 12 years in several different positions, each one expanding her breadth and depth of business and HR experience. Carmen Cortez started her career at Cisco with the U.S. Service Provider Sales business. Her next assignment was as the HR leader for Canada and Latin America. In this role, she assisted with the growth of the company in Latin America and Canada by building an HR organization to support growth in these respective regions. \n \nHer next assignment took her to Europe. Ms. Cortez was promoted to the position of Director, HR for the Enterprise Sales organization across Europe, the Middle East, and Africa (EMEA).  \n \nAfter this assignment, she moved to Tokyo, Japan, to be the Country HR Leader/Director for Cisco Japan Operations. During her tenure in Japan, she also acted as the interim Employee Relations Leader for Asia Apac for six months. \n \nUpon her return to the United States, she took a role as an executive talent acquisition leader for the U.S. Sales organization. Ms. Cortez continued her success at Cisco, garnering accolades from the company.  \n \nShe then undertook responsibilities to lead HR for the Internet Business Solutions Group (IBSG), and held this position for almost six years. Concurrently, she was given different groups and senior executives to partner with. Carmen Cortez began her HR business partnering career at Apple Computer. She later joined Informix as a Director of Human Resources for the U.S., Canada, and Latin America Operations. After Informix, she decided to pursue experience in Asia by joining Fore Systems as the Director, HR for their Asia Pacific Operations. She commuted from San Jose, California, to Asia for two years. Once this assignment was over, Ms. Cortez joined Rational Software as the HR Director for the Global Sales organization.  \n \nThe following year, she joined Cisco Systems, Inc., where she has spent the last 12 years in several different positions, each one expanding her breadth and depth of business and HR experience. Carmen Cortez started her career at Cisco with the U.S. Service Provider Sales business. Her next assignment was as the HR leader for Canada and Latin America. In this role, she assisted with the growth of the company in Latin America and Canada by building an HR organization to support growth in these respective regions. \n \nHer next assignment took her to Europe. Ms. Cortez was promoted to the position of Director, HR for the Enterprise Sales organization across Europe, the Middle East, and Africa (EMEA).  \n \nAfter this assignment, she moved to Tokyo, Japan, to be the Country HR Leader/Director for Cisco Japan Operations. During her tenure in Japan, she also acted as the interim Employee Relations Leader for Asia Apac for six months. \n \nUpon her return to the United States, she took a role as an executive talent acquisition leader for the U.S. Sales organization. Ms. Cortez continued her success at Cisco, garnering accolades from the company.  \n \nShe then undertook responsibilities to lead HR for the Internet Business Solutions Group (IBSG), and held this position for almost six years. Concurrently, she was given different groups and senior executives to partner with. Carmen Cortez began her HR business partnering career at Apple Computer. She later joined Informix as a Director of Human Resources for the U.S., Canada, and Latin America Operations. After Informix, she decided to pursue experience in Asia by joining Fore Systems as the Director, HR for their Asia Pacific Operations. She commuted from San Jose, California, to Asia for two years. Once this assignment was over, Ms. Cortez joined Rational Software as the HR Director for the Global Sales organization.  \n \nThe following year, she joined Cisco Systems, Inc., where she has spent the last 12 years in several different positions, each one expanding her breadth and depth of business and HR experience. Carmen Cortez started her career at Cisco with the U.S. Service Provider Sales business. Her next assignment was as the HR leader for Canada and Latin America. In this role, she assisted with the growth of the company in Latin America and Canada by building an HR organization to support growth in these respective regions. \n \nHer next assignment took her to Europe. Ms. Cortez was promoted to the position of Director, HR for the Enterprise Sales organization across Europe, the Middle East, and Africa (EMEA).  \n \nAfter this assignment, she moved to Tokyo, Japan, to be the Country HR Leader/Director for Cisco Japan Operations. During her tenure in Japan, she also acted as the interim Employee Relations Leader for Asia Apac for six months. \n \nUpon her return to the United States, she took a role as an executive talent acquisition leader for the U.S. Sales organization. Ms. Cortez continued her success at Cisco, garnering accolades from the company.  \n \nShe then undertook responsibilities to lead HR for the Internet Business Solutions Group (IBSG), and held this position for almost six years. Concurrently, she was given different groups and senior executives to partner with. Experience Director, Human Resources Cisco Systems January 1999  – Present (16 years 8 months) Director, Human Resources Rational Software January 1998  –  January 1999  (1 year 1 month) Director, Human Resources Cisco Systems January 1999  – Present (16 years 8 months) Director, Human Resources Cisco Systems January 1999  – Present (16 years 8 months) Director, Human Resources Rational Software January 1998  –  January 1999  (1 year 1 month) Director, Human Resources Rational Software January 1998  –  January 1999  (1 year 1 month) Education Cal State University Hayward Master of Science (MS),  Counseling University of California, Santa Cruz Bachelor of Science (BS),  Psychology Cal State University Hayward Master of Science (MS),  Counseling Cal State University Hayward Master of Science (MS),  Counseling Cal State University Hayward Master of Science (MS),  Counseling University of California, Santa Cruz Bachelor of Science (BS),  Psychology University of California, Santa Cruz Bachelor of Science (BS),  Psychology University of California, Santa Cruz Bachelor of Science (BS),  Psychology ", "Skills Organizational Design Executive Coaching Change Management Sales Compensation HR Transformation Employee Engagement Workforce Planning University Relations Organizational... Organizational Culture Call Center Works Council Behavioral Interviewing Team Building True Colors EEO Affirmative Action... Acquisition Integration Risk Management Benefits Design Organizational Learning Oracle HR HRIS Cross-functional Team... 360 Assessments Non-profit Board... Succession Planning Business Restructures Leadership Development Employee Relations Recruiting Interviews HR Consulting People Development Team Leadership See 20+     See less Skills  Organizational Design Executive Coaching Change Management Sales Compensation HR Transformation Employee Engagement Workforce Planning University Relations Organizational... Organizational Culture Call Center Works Council Behavioral Interviewing Team Building True Colors EEO Affirmative Action... Acquisition Integration Risk Management Benefits Design Organizational Learning Oracle HR HRIS Cross-functional Team... 360 Assessments Non-profit Board... Succession Planning Business Restructures Leadership Development Employee Relations Recruiting Interviews HR Consulting People Development Team Leadership See 20+     See less Organizational Design Executive Coaching Change Management Sales Compensation HR Transformation Employee Engagement Workforce Planning University Relations Organizational... Organizational Culture Call Center Works Council Behavioral Interviewing Team Building True Colors EEO Affirmative Action... Acquisition Integration Risk Management Benefits Design Organizational Learning Oracle HR HRIS Cross-functional Team... 360 Assessments Non-profit Board... Succession Planning Business Restructures Leadership Development Employee Relations Recruiting Interviews HR Consulting People Development Team Leadership See 20+     See less Organizational Design Executive Coaching Change Management Sales Compensation HR Transformation Employee Engagement Workforce Planning University Relations Organizational... Organizational Culture Call Center Works Council Behavioral Interviewing Team Building True Colors EEO Affirmative Action... Acquisition Integration Risk Management Benefits Design Organizational Learning Oracle HR HRIS Cross-functional Team... 360 Assessments Non-profit Board... Succession Planning Business Restructures Leadership Development Employee Relations Recruiting Interviews HR Consulting People Development Team Leadership See 20+     See less ", "Summary Broad range of business experience and progressively responsible positions in HR. Direct experience in sales and marketing, finance, IT, operations and HR. \n \nSpecialties: Business partnership with executives, organization development and alignment, workforce planning, change management, total compensation, benefits, program and project management. Summary Broad range of business experience and progressively responsible positions in HR. Direct experience in sales and marketing, finance, IT, operations and HR. \n \nSpecialties: Business partnership with executives, organization development and alignment, workforce planning, change management, total compensation, benefits, program and project management. Broad range of business experience and progressively responsible positions in HR. Direct experience in sales and marketing, finance, IT, operations and HR. \n \nSpecialties: Business partnership with executives, organization development and alignment, workforce planning, change management, total compensation, benefits, program and project management. Broad range of business experience and progressively responsible positions in HR. Direct experience in sales and marketing, finance, IT, operations and HR. \n \nSpecialties: Business partnership with executives, organization development and alignment, workforce planning, change management, total compensation, benefits, program and project management. Experience Chief HR Officer Asian Americans for Community Involvement (aaci.org) 2015  – Present (less than a year) San Jose, CA HR leader for non-profit organization whose mission is to focus on the diverse Asian American community and to improve the health, mental health and well-being of individuals and their families by providing an array of human services. Director, Human Resources Synaptics 2014  – Present (1 year) San Jose, CA HR business partner for WW Sales and Smart Display Division HR Director Yahoo 2013  –  2014  (1 year) Sunnyvale, CA HR business partner for Marketing and Customer Experience leaders and Platforms and Personalization Products leaders (1400 employees). Director, Human Resources Juniper Networks 2011  –  2013  (2 years) Sunnyvale, CA HR business partner for Enterprise Sales and Global Services and Support for $1B services and support business with 1,000 around 1,400 employees respectively. Director, Human Resources (Sales) Seagate Technology 2007  –  2010  (3 years) Scotts Valley, CA HR business partner for EVP - WW Sales, SVP - Sales Operations and Product Line Management, VP - Corporate/Global Marketing and other executives in Sales and Sales Operations Organizations. Vice President, Human Resources Thermo Fisher Scientific 2007  –  2007  (less than a year) Fremont, CA Led overall HR function for around $800M business with over 3,000 global employees. Director, Human Resources Thermo Fisher Scientific 2005  –  2007  (2 years) San Jose, CA Responsible for HR function for site and led Total Compensation for Division of 3,500 employees. Senior Manager, Human Resources Cisco Systems 2000  –  2005  (5 years) San Jose, CA Held roles as US Benefits Manager, HR business partner for HR and Operations, and Global Business Operations Manager for Advanced Services business. Senior Account Manager Health Net 1999  –  2000  (1 year) Managed book of business with $100M quota including key accounts such as HP, Oracle and PG&E. Health and Disability Leader GE 1994  –  1999  (5 years) San Jose, CA and Pittsfield, MA Responsible for health care and disability management programs and supplier management for budget of $50M. Diversity program leader for division. Manager Deloitte 1997  –  1997  (less than a year) San Francisco Bay Area Benefits consulting for large companies including the University of California and Stanford Chief HR Officer Asian Americans for Community Involvement (aaci.org) 2015  – Present (less than a year) San Jose, CA HR leader for non-profit organization whose mission is to focus on the diverse Asian American community and to improve the health, mental health and well-being of individuals and their families by providing an array of human services. Chief HR Officer Asian Americans for Community Involvement (aaci.org) 2015  – Present (less than a year) San Jose, CA HR leader for non-profit organization whose mission is to focus on the diverse Asian American community and to improve the health, mental health and well-being of individuals and their families by providing an array of human services. Director, Human Resources Synaptics 2014  – Present (1 year) San Jose, CA HR business partner for WW Sales and Smart Display Division Director, Human Resources Synaptics 2014  – Present (1 year) San Jose, CA HR business partner for WW Sales and Smart Display Division HR Director Yahoo 2013  –  2014  (1 year) Sunnyvale, CA HR business partner for Marketing and Customer Experience leaders and Platforms and Personalization Products leaders (1400 employees). HR Director Yahoo 2013  –  2014  (1 year) Sunnyvale, CA HR business partner for Marketing and Customer Experience leaders and Platforms and Personalization Products leaders (1400 employees). Director, Human Resources Juniper Networks 2011  –  2013  (2 years) Sunnyvale, CA HR business partner for Enterprise Sales and Global Services and Support for $1B services and support business with 1,000 around 1,400 employees respectively. Director, Human Resources Juniper Networks 2011  –  2013  (2 years) Sunnyvale, CA HR business partner for Enterprise Sales and Global Services and Support for $1B services and support business with 1,000 around 1,400 employees respectively. Director, Human Resources (Sales) Seagate Technology 2007  –  2010  (3 years) Scotts Valley, CA HR business partner for EVP - WW Sales, SVP - Sales Operations and Product Line Management, VP - Corporate/Global Marketing and other executives in Sales and Sales Operations Organizations. Director, Human Resources (Sales) Seagate Technology 2007  –  2010  (3 years) Scotts Valley, CA HR business partner for EVP - WW Sales, SVP - Sales Operations and Product Line Management, VP - Corporate/Global Marketing and other executives in Sales and Sales Operations Organizations. Vice President, Human Resources Thermo Fisher Scientific 2007  –  2007  (less than a year) Fremont, CA Led overall HR function for around $800M business with over 3,000 global employees. Vice President, Human Resources Thermo Fisher Scientific 2007  –  2007  (less than a year) Fremont, CA Led overall HR function for around $800M business with over 3,000 global employees. Director, Human Resources Thermo Fisher Scientific 2005  –  2007  (2 years) San Jose, CA Responsible for HR function for site and led Total Compensation for Division of 3,500 employees. Director, Human Resources Thermo Fisher Scientific 2005  –  2007  (2 years) San Jose, CA Responsible for HR function for site and led Total Compensation for Division of 3,500 employees. Senior Manager, Human Resources Cisco Systems 2000  –  2005  (5 years) San Jose, CA Held roles as US Benefits Manager, HR business partner for HR and Operations, and Global Business Operations Manager for Advanced Services business. Senior Manager, Human Resources Cisco Systems 2000  –  2005  (5 years) San Jose, CA Held roles as US Benefits Manager, HR business partner for HR and Operations, and Global Business Operations Manager for Advanced Services business. Senior Account Manager Health Net 1999  –  2000  (1 year) Managed book of business with $100M quota including key accounts such as HP, Oracle and PG&E. Senior Account Manager Health Net 1999  –  2000  (1 year) Managed book of business with $100M quota including key accounts such as HP, Oracle and PG&E. Health and Disability Leader GE 1994  –  1999  (5 years) San Jose, CA and Pittsfield, MA Responsible for health care and disability management programs and supplier management for budget of $50M. Diversity program leader for division. Health and Disability Leader GE 1994  –  1999  (5 years) San Jose, CA and Pittsfield, MA Responsible for health care and disability management programs and supplier management for budget of $50M. Diversity program leader for division. Manager Deloitte 1997  –  1997  (less than a year) San Francisco Bay Area Benefits consulting for large companies including the University of California and Stanford Manager Deloitte 1997  –  1997  (less than a year) San Francisco Bay Area Benefits consulting for large companies including the University of California and Stanford Skills Change Management Employee Benefits Program Management Remuneration Talent Management Employee Relations Talent Acquisition HRIS Organizational... Succession Planning Performance Management Employee Engagement Onboarding Workforce Planning Organizational... Human Resources Organizational Design Leadership Development Recruiting Personnel Management Employee Training Team Facilitation Management Leadership Coaching Strategic Planning College Recruiting Applicant Tracking... See 13+     See less Skills  Change Management Employee Benefits Program Management Remuneration Talent Management Employee Relations Talent Acquisition HRIS Organizational... Succession Planning Performance Management Employee Engagement Onboarding Workforce Planning Organizational... Human Resources Organizational Design Leadership Development Recruiting Personnel Management Employee Training Team Facilitation Management Leadership Coaching Strategic Planning College Recruiting Applicant Tracking... See 13+     See less Change Management Employee Benefits Program Management Remuneration Talent Management Employee Relations Talent Acquisition HRIS Organizational... Succession Planning Performance Management Employee Engagement Onboarding Workforce Planning Organizational... Human Resources Organizational Design Leadership Development Recruiting Personnel Management Employee Training Team Facilitation Management Leadership Coaching Strategic Planning College Recruiting Applicant Tracking... See 13+     See less Change Management Employee Benefits Program Management Remuneration Talent Management Employee Relations Talent Acquisition HRIS Organizational... Succession Planning Performance Management Employee Engagement Onboarding Workforce Planning Organizational... Human Resources Organizational Design Leadership Development Recruiting Personnel Management Employee Training Team Facilitation Management Leadership Coaching Strategic Planning College Recruiting Applicant Tracking... See 13+     See less ", "Summary Exceptional at building organizations from the ground up, Heather also drives innovation and change management in companies that are revamping themselves. She is experienced in organizational development and effectiveness, services design, strategic planning, leadership and management consulting.  \n \nHer specialization is in continuous improvement through outcome-based design and collaborative, inclusive facilitation to help the team achieve their goals. Summary Exceptional at building organizations from the ground up, Heather also drives innovation and change management in companies that are revamping themselves. She is experienced in organizational development and effectiveness, services design, strategic planning, leadership and management consulting.  \n \nHer specialization is in continuous improvement through outcome-based design and collaborative, inclusive facilitation to help the team achieve their goals. Exceptional at building organizations from the ground up, Heather also drives innovation and change management in companies that are revamping themselves. She is experienced in organizational development and effectiveness, services design, strategic planning, leadership and management consulting.  \n \nHer specialization is in continuous improvement through outcome-based design and collaborative, inclusive facilitation to help the team achieve their goals. Exceptional at building organizations from the ground up, Heather also drives innovation and change management in companies that are revamping themselves. She is experienced in organizational development and effectiveness, services design, strategic planning, leadership and management consulting.  \n \nHer specialization is in continuous improvement through outcome-based design and collaborative, inclusive facilitation to help the team achieve their goals. Experience Senior Manager, Service Supply Chain IT Cisco November 2013  – Present (1 year 10 months) RTP, NC * Accountable for $20M software portfolio responsible for managing $7B in sparing worldwide. Focus on planning, repair, replacement, order management, and asset recovery. Systems integrate with multiple third party logistics and maintenance partners (3PL/TPL/TPM) worldwide. \n \n* Leading global team implementation of BRMS (PEGA), enabling ease of doing business for changing application functionality. To date, team has created $6M in savings. \n \n* Leading team through portfolio transformation - vendor consolidation, shift to Continuous Delivery + DevOps model, simplification of architectural design. First team to move to consolidated dev/QA/support vendor model, first Agile Statement of Work written in IT, partnering with teams across IT and Global Business Services around the world. \n \n* Leading mindset shift from business requirements documentation to true customer advocacy - incorporating Design Thinking practices, and End User ethnomethodology. \n \n*Team Awards Received: Business Innovation Award (PEGAWorld, June 2014); NC Technology Associations' Tech Award - Business Value: Use of Technology (Nov 2014); Gartner’s BPM Excellence Awards for North America (Dec 2014); TS Pinnacle Award (internal to Cisco) Cultural Architect Cisco May 2011  –  November 2013  (2 years 7 months) RTP, NC Lead, Organizational Research + Development Cisco August 2010  –  June 2011  (11 months) RTP, NC Human Resources Program Manager Cisco January 2008  –  August 2010  (2 years 8 months) Performance & Compliance Manager Spherion @ Cisco February 2006  –  January 2008  (2 years) RTP, NC Freelance Writer/Marketing Freelance January 2005  –  January 2008  (3 years 1 month) Carrboro, NC Organizational Development Consultant - Acting COO Wootini August 2003  –  December 2005  (2 years 5 months) Carrboro, NC Director of Administration Charles W. Cammack Associates July 2002  –  August 2003  (1 year 2 months) New York, NY Director, Human Resources GlobalFilings, Inc. August 2000  –  December 2001  (1 year 5 months) New York, NY HR, Managing Coordinator Spherion @ PaineWebber November 1999  –  August 2000  (10 months) New York, NY Consultant Dun & Bradstreet @ Lucent Technologies September 1996  –  August 1998  (2 years) Bethlehem, PA; Basking Ridge, NJ Assistant Manager Vector Marketing August 1994  –  February 1996  (1 year 7 months) Whitehall, PA Sales Representative Vector Marketing May 1994  –  August 1994  (4 months) Whitehall, PA Senior Manager, Service Supply Chain IT Cisco November 2013  – Present (1 year 10 months) RTP, NC * Accountable for $20M software portfolio responsible for managing $7B in sparing worldwide. Focus on planning, repair, replacement, order management, and asset recovery. Systems integrate with multiple third party logistics and maintenance partners (3PL/TPL/TPM) worldwide. \n \n* Leading global team implementation of BRMS (PEGA), enabling ease of doing business for changing application functionality. To date, team has created $6M in savings. \n \n* Leading team through portfolio transformation - vendor consolidation, shift to Continuous Delivery + DevOps model, simplification of architectural design. First team to move to consolidated dev/QA/support vendor model, first Agile Statement of Work written in IT, partnering with teams across IT and Global Business Services around the world. \n \n* Leading mindset shift from business requirements documentation to true customer advocacy - incorporating Design Thinking practices, and End User ethnomethodology. \n \n*Team Awards Received: Business Innovation Award (PEGAWorld, June 2014); NC Technology Associations' Tech Award - Business Value: Use of Technology (Nov 2014); Gartner’s BPM Excellence Awards for North America (Dec 2014); TS Pinnacle Award (internal to Cisco) Senior Manager, Service Supply Chain IT Cisco November 2013  – Present (1 year 10 months) RTP, NC * Accountable for $20M software portfolio responsible for managing $7B in sparing worldwide. Focus on planning, repair, replacement, order management, and asset recovery. Systems integrate with multiple third party logistics and maintenance partners (3PL/TPL/TPM) worldwide. \n \n* Leading global team implementation of BRMS (PEGA), enabling ease of doing business for changing application functionality. To date, team has created $6M in savings. \n \n* Leading team through portfolio transformation - vendor consolidation, shift to Continuous Delivery + DevOps model, simplification of architectural design. First team to move to consolidated dev/QA/support vendor model, first Agile Statement of Work written in IT, partnering with teams across IT and Global Business Services around the world. \n \n* Leading mindset shift from business requirements documentation to true customer advocacy - incorporating Design Thinking practices, and End User ethnomethodology. \n \n*Team Awards Received: Business Innovation Award (PEGAWorld, June 2014); NC Technology Associations' Tech Award - Business Value: Use of Technology (Nov 2014); Gartner’s BPM Excellence Awards for North America (Dec 2014); TS Pinnacle Award (internal to Cisco) Cultural Architect Cisco May 2011  –  November 2013  (2 years 7 months) RTP, NC Cultural Architect Cisco May 2011  –  November 2013  (2 years 7 months) RTP, NC Lead, Organizational Research + Development Cisco August 2010  –  June 2011  (11 months) RTP, NC Lead, Organizational Research + Development Cisco August 2010  –  June 2011  (11 months) RTP, NC Human Resources Program Manager Cisco January 2008  –  August 2010  (2 years 8 months) Human Resources Program Manager Cisco January 2008  –  August 2010  (2 years 8 months) Performance & Compliance Manager Spherion @ Cisco February 2006  –  January 2008  (2 years) RTP, NC Performance & Compliance Manager Spherion @ Cisco February 2006  –  January 2008  (2 years) RTP, NC Freelance Writer/Marketing Freelance January 2005  –  January 2008  (3 years 1 month) Carrboro, NC Freelance Writer/Marketing Freelance January 2005  –  January 2008  (3 years 1 month) Carrboro, NC Organizational Development Consultant - Acting COO Wootini August 2003  –  December 2005  (2 years 5 months) Carrboro, NC Organizational Development Consultant - Acting COO Wootini August 2003  –  December 2005  (2 years 5 months) Carrboro, NC Director of Administration Charles W. Cammack Associates July 2002  –  August 2003  (1 year 2 months) New York, NY Director of Administration Charles W. Cammack Associates July 2002  –  August 2003  (1 year 2 months) New York, NY Director, Human Resources GlobalFilings, Inc. August 2000  –  December 2001  (1 year 5 months) New York, NY Director, Human Resources GlobalFilings, Inc. August 2000  –  December 2001  (1 year 5 months) New York, NY HR, Managing Coordinator Spherion @ PaineWebber November 1999  –  August 2000  (10 months) New York, NY HR, Managing Coordinator Spherion @ PaineWebber November 1999  –  August 2000  (10 months) New York, NY Consultant Dun & Bradstreet @ Lucent Technologies September 1996  –  August 1998  (2 years) Bethlehem, PA; Basking Ridge, NJ Consultant Dun & Bradstreet @ Lucent Technologies September 1996  –  August 1998  (2 years) Bethlehem, PA; Basking Ridge, NJ Assistant Manager Vector Marketing August 1994  –  February 1996  (1 year 7 months) Whitehall, PA Assistant Manager Vector Marketing August 1994  –  February 1996  (1 year 7 months) Whitehall, PA Sales Representative Vector Marketing May 1994  –  August 1994  (4 months) Whitehall, PA Sales Representative Vector Marketing May 1994  –  August 1994  (4 months) Whitehall, PA Languages   Skills Skills     Education Teachers College of Columbia University MA,  Organizational Psychology 1998  – 1999 research assistant to Dr. Caryn Block, consulted with Dr. Warner Burke Activities and Societies:  member SIOP Kutztown University of Pennsylvania BS,  Psychology 1992  – 1996 Studied abroad at the University of St. Mark/St. John in Plymouth, England Activities and Societies:  Psi Chi (Honor Society) ,  Alpha Sigma Tau (Honor Society) ,  Women's Rugby ,  SIOP Teachers College of Columbia University MA,  Organizational Psychology 1998  – 1999 research assistant to Dr. Caryn Block, consulted with Dr. Warner Burke Activities and Societies:  member SIOP Teachers College of Columbia University MA,  Organizational Psychology 1998  – 1999 research assistant to Dr. Caryn Block, consulted with Dr. Warner Burke Activities and Societies:  member SIOP Teachers College of Columbia University MA,  Organizational Psychology 1998  – 1999 research assistant to Dr. Caryn Block, consulted with Dr. Warner Burke Activities and Societies:  member SIOP Kutztown University of Pennsylvania BS,  Psychology 1992  – 1996 Studied abroad at the University of St. Mark/St. John in Plymouth, England Activities and Societies:  Psi Chi (Honor Society) ,  Alpha Sigma Tau (Honor Society) ,  Women's Rugby ,  SIOP Kutztown University of Pennsylvania BS,  Psychology 1992  – 1996 Studied abroad at the University of St. Mark/St. John in Plymouth, England Activities and Societies:  Psi Chi (Honor Society) ,  Alpha Sigma Tau (Honor Society) ,  Women's Rugby ,  SIOP Kutztown University of Pennsylvania BS,  Psychology 1992  – 1996 Studied abroad at the University of St. Mark/St. John in Plymouth, England Activities and Societies:  Psi Chi (Honor Society) ,  Alpha Sigma Tau (Honor Society) ,  Women's Rugby ,  SIOP Honors & Awards Gartner BPM Excellence Awards Gartner December 2014 Gartner, Inc. has announced the winners of the Gartner Business Process Management Excellence Awards 2014 in North America. The Awards program highlights world-class BPM programs and projects that deliver business results by broadly sharing their successes, challenges and insights. This year’s winners are: \n \nCisco – Global Service Supply Chain \nCisco’s Global Service Supply Chain (GSSC) is radically changing the way repairs and parts are \nmanaged worldwide, driving “order to return” and “source to stock” process improvements while \ngradually re-architecting specific business service areas on a shared iBPMS-based business \noperations platform. The new command center program alone delivers about $3M/year \nsavings. Indeed, this program’s success has reinvigorated a change-friendly innovative culture \nat Cisco and exemplifies how BPM discipline and technology can be the platform for an \nadaptive enterprise. NC Tech Awards: Use of Technology-Business Value North Carolina Technology Association November 2014 The North Carolina Technology Association (NCTA) is a not-for-profit, membership-driven trade association and the primary voice of the technology industry in North Carolina. NCTA is the intersection of leadership and technology, fueling the growth of North Carolina through Executive Engagement, Public Affairs, and a Knowledge Workforce. The NC Tech Awards are North Carolina's only statewide technology awards program, recognizing companies and individuals who have characterized excellence, innovation and leadership, presented by the North Carolina Technology Association (NCTA).  Business Innovation Award Pega Systems June 2014 Cisco GSSC has been selected to receive The Business Innovation Award this year at PegaWORLD.   Cisco’s vision – to change how the world works, lives, plays and learns – embodies the spirit of Pega’s Build for Change.  At the same time, you are changing Cisco, and how you solve your customers’ most important business challenges, through intelligent networks and technology architectures built on integrated products, services, and software platforms.  You are innovating new methods and models in how you work, and we recognize how you are effectively using Pega and iBPM to facilitate your rapid business transformation.  This adds up to being this year’s Business Innovation Award winner. \n Additional Honors & Awards Speaker - North Carolina PMI (2013); Center for Innovation Management Studies Spring Symposium - Keynote (2012); BASF Innovation Series (2012), Innovation in RTP (2011)  \nCisco Connections Award - Leadership 2012 \n2011 ERE Awards, Retention category \nBiltmore's Who's Who 2009 - present \nInvited Speaker: 2011 Fall NC SHRM convention + Fall SourceCon Gartner BPM Excellence Awards Gartner December 2014 Gartner, Inc. has announced the winners of the Gartner Business Process Management Excellence Awards 2014 in North America. The Awards program highlights world-class BPM programs and projects that deliver business results by broadly sharing their successes, challenges and insights. This year’s winners are: \n \nCisco – Global Service Supply Chain \nCisco’s Global Service Supply Chain (GSSC) is radically changing the way repairs and parts are \nmanaged worldwide, driving “order to return” and “source to stock” process improvements while \ngradually re-architecting specific business service areas on a shared iBPMS-based business \noperations platform. The new command center program alone delivers about $3M/year \nsavings. Indeed, this program’s success has reinvigorated a change-friendly innovative culture \nat Cisco and exemplifies how BPM discipline and technology can be the platform for an \nadaptive enterprise. Gartner BPM Excellence Awards Gartner December 2014 Gartner, Inc. has announced the winners of the Gartner Business Process Management Excellence Awards 2014 in North America. The Awards program highlights world-class BPM programs and projects that deliver business results by broadly sharing their successes, challenges and insights. This year’s winners are: \n \nCisco – Global Service Supply Chain \nCisco’s Global Service Supply Chain (GSSC) is radically changing the way repairs and parts are \nmanaged worldwide, driving “order to return” and “source to stock” process improvements while \ngradually re-architecting specific business service areas on a shared iBPMS-based business \noperations platform. The new command center program alone delivers about $3M/year \nsavings. Indeed, this program’s success has reinvigorated a change-friendly innovative culture \nat Cisco and exemplifies how BPM discipline and technology can be the platform for an \nadaptive enterprise. Gartner BPM Excellence Awards Gartner December 2014 Gartner, Inc. has announced the winners of the Gartner Business Process Management Excellence Awards 2014 in North America. The Awards program highlights world-class BPM programs and projects that deliver business results by broadly sharing their successes, challenges and insights. This year’s winners are: \n \nCisco – Global Service Supply Chain \nCisco’s Global Service Supply Chain (GSSC) is radically changing the way repairs and parts are \nmanaged worldwide, driving “order to return” and “source to stock” process improvements while \ngradually re-architecting specific business service areas on a shared iBPMS-based business \noperations platform. The new command center program alone delivers about $3M/year \nsavings. Indeed, this program’s success has reinvigorated a change-friendly innovative culture \nat Cisco and exemplifies how BPM discipline and technology can be the platform for an \nadaptive enterprise. NC Tech Awards: Use of Technology-Business Value North Carolina Technology Association November 2014 The North Carolina Technology Association (NCTA) is a not-for-profit, membership-driven trade association and the primary voice of the technology industry in North Carolina. NCTA is the intersection of leadership and technology, fueling the growth of North Carolina through Executive Engagement, Public Affairs, and a Knowledge Workforce. The NC Tech Awards are North Carolina's only statewide technology awards program, recognizing companies and individuals who have characterized excellence, innovation and leadership, presented by the North Carolina Technology Association (NCTA).  NC Tech Awards: Use of Technology-Business Value North Carolina Technology Association November 2014 The North Carolina Technology Association (NCTA) is a not-for-profit, membership-driven trade association and the primary voice of the technology industry in North Carolina. NCTA is the intersection of leadership and technology, fueling the growth of North Carolina through Executive Engagement, Public Affairs, and a Knowledge Workforce. The NC Tech Awards are North Carolina's only statewide technology awards program, recognizing companies and individuals who have characterized excellence, innovation and leadership, presented by the North Carolina Technology Association (NCTA).  NC Tech Awards: Use of Technology-Business Value North Carolina Technology Association November 2014 The North Carolina Technology Association (NCTA) is a not-for-profit, membership-driven trade association and the primary voice of the technology industry in North Carolina. NCTA is the intersection of leadership and technology, fueling the growth of North Carolina through Executive Engagement, Public Affairs, and a Knowledge Workforce. The NC Tech Awards are North Carolina's only statewide technology awards program, recognizing companies and individuals who have characterized excellence, innovation and leadership, presented by the North Carolina Technology Association (NCTA).  Business Innovation Award Pega Systems June 2014 Cisco GSSC has been selected to receive The Business Innovation Award this year at PegaWORLD.   Cisco’s vision – to change how the world works, lives, plays and learns – embodies the spirit of Pega’s Build for Change.  At the same time, you are changing Cisco, and how you solve your customers’ most important business challenges, through intelligent networks and technology architectures built on integrated products, services, and software platforms.  You are innovating new methods and models in how you work, and we recognize how you are effectively using Pega and iBPM to facilitate your rapid business transformation.  This adds up to being this year’s Business Innovation Award winner. \n Business Innovation Award Pega Systems June 2014 Cisco GSSC has been selected to receive The Business Innovation Award this year at PegaWORLD.   Cisco’s vision – to change how the world works, lives, plays and learns – embodies the spirit of Pega’s Build for Change.  At the same time, you are changing Cisco, and how you solve your customers’ most important business challenges, through intelligent networks and technology architectures built on integrated products, services, and software platforms.  You are innovating new methods and models in how you work, and we recognize how you are effectively using Pega and iBPM to facilitate your rapid business transformation.  This adds up to being this year’s Business Innovation Award winner. \n Business Innovation Award Pega Systems June 2014 Cisco GSSC has been selected to receive The Business Innovation Award this year at PegaWORLD.   Cisco’s vision – to change how the world works, lives, plays and learns – embodies the spirit of Pega’s Build for Change.  At the same time, you are changing Cisco, and how you solve your customers’ most important business challenges, through intelligent networks and technology architectures built on integrated products, services, and software platforms.  You are innovating new methods and models in how you work, and we recognize how you are effectively using Pega and iBPM to facilitate your rapid business transformation.  This adds up to being this year’s Business Innovation Award winner. \n Additional Honors & Awards Speaker - North Carolina PMI (2013); Center for Innovation Management Studies Spring Symposium - Keynote (2012); BASF Innovation Series (2012), Innovation in RTP (2011)  \nCisco Connections Award - Leadership 2012 \n2011 ERE Awards, Retention category \nBiltmore's Who's Who 2009 - present \nInvited Speaker: 2011 Fall NC SHRM convention + Fall SourceCon Additional Honors & Awards Speaker - North Carolina PMI (2013); Center for Innovation Management Studies Spring Symposium - Keynote (2012); BASF Innovation Series (2012), Innovation in RTP (2011)  \nCisco Connections Award - Leadership 2012 \n2011 ERE Awards, Retention category \nBiltmore's Who's Who 2009 - present \nInvited Speaker: 2011 Fall NC SHRM convention + Fall SourceCon Additional Honors & Awards Speaker - North Carolina PMI (2013); Center for Innovation Management Studies Spring Symposium - Keynote (2012); BASF Innovation Series (2012), Innovation in RTP (2011)  \nCisco Connections Award - Leadership 2012 \n2011 ERE Awards, Retention category \nBiltmore's Who's Who 2009 - present \nInvited Speaker: 2011 Fall NC SHRM convention + Fall SourceCon ", "Summary As a seasoned communications professional with over 20 years of proven experience in senior management and consulting roles, I focus on strategic communications and leadership development. In today's competitive market, I bring an innovative and solution-oriented approach to business challenges.  \n \nAs a speaker, author and international coach, I help women understand what motivates them and what blocks them, so they step into their more powerful selves and are even more confident in their decisions and choices. \n \nSpecialties:  \n• Speaking \n• Workshops \n• Leadership Retreats \n• Strategic Communications \n• Personal & Professional Development Summary As a seasoned communications professional with over 20 years of proven experience in senior management and consulting roles, I focus on strategic communications and leadership development. In today's competitive market, I bring an innovative and solution-oriented approach to business challenges.  \n \nAs a speaker, author and international coach, I help women understand what motivates them and what blocks them, so they step into their more powerful selves and are even more confident in their decisions and choices. \n \nSpecialties:  \n• Speaking \n• Workshops \n• Leadership Retreats \n• Strategic Communications \n• Personal & Professional Development As a seasoned communications professional with over 20 years of proven experience in senior management and consulting roles, I focus on strategic communications and leadership development. In today's competitive market, I bring an innovative and solution-oriented approach to business challenges.  \n \nAs a speaker, author and international coach, I help women understand what motivates them and what blocks them, so they step into their more powerful selves and are even more confident in their decisions and choices. \n \nSpecialties:  \n• Speaking \n• Workshops \n• Leadership Retreats \n• Strategic Communications \n• Personal & Professional Development As a seasoned communications professional with over 20 years of proven experience in senior management and consulting roles, I focus on strategic communications and leadership development. In today's competitive market, I bring an innovative and solution-oriented approach to business challenges.  \n \nAs a speaker, author and international coach, I help women understand what motivates them and what blocks them, so they step into their more powerful selves and are even more confident in their decisions and choices. \n \nSpecialties:  \n• Speaking \n• Workshops \n• Leadership Retreats \n• Strategic Communications \n• Personal & Professional Development Experience Principal/Founder Kuleana Communications May 2015  – Present (4 months) 808 McGlincy Lane, Campbell, CA 95008 Strategic Communications Consultant Cisco March 2014  – Present (1 year 6 months) San Francisco Bay Area Speaker, Author, Coach Hula For The Soul® September 2009  – Present (6 years) Campbell, CA Platinum/Elite Milllionaire Protege Club January 2010  –  January 2012  (2 years 1 month) Executive Communications Manager Cisco November 2010  –  July 2011  (9 months) Communications Consultant Cisco August 2009  –  September 2010  (1 year 2 months) Social Media Consultant, Coach & Speaker YouConnected January 2009  –  October 2009  (10 months) Marketing Communications Consultant Cisco August 2007  –  January 2009  (1 year 6 months) Communications & Operations Consultant McKenzie Event Management 2006  –  2007  (1 year) Communications Consultant - Knowledge Transfer Group France Telecom August 2005  –  May 2006  (10 months) Director of Communications, Editor-in-Chief California Apartment Association (formerly Tri-County Apartment Association) October 2001  –  October 2004  (3 years 1 month) Manager, Technical Communications gForce, Inc. February 2000  –  October 2001  (1 year 9 months) Director, Sales & Marketing ColonyNet.com (currently 2-Tier Software, Inc.) December 1999  –  February 2000  (3 months) Technical Writer/Project Coordinator Nokia Internet Communications October 1998  –  December 1999  (1 year 3 months) Director, Human Resources Sheraton Four Points Hotel May 1994  –  June 1995  (1 year 2 months) Principal/Founder Kuleana Communications May 2015  – Present (4 months) 808 McGlincy Lane, Campbell, CA 95008 Principal/Founder Kuleana Communications May 2015  – Present (4 months) 808 McGlincy Lane, Campbell, CA 95008 Strategic Communications Consultant Cisco March 2014  – Present (1 year 6 months) San Francisco Bay Area Strategic Communications Consultant Cisco March 2014  – Present (1 year 6 months) San Francisco Bay Area Speaker, Author, Coach Hula For The Soul® September 2009  – Present (6 years) Campbell, CA Speaker, Author, Coach Hula For The Soul® September 2009  – Present (6 years) Campbell, CA Platinum/Elite Milllionaire Protege Club January 2010  –  January 2012  (2 years 1 month) Platinum/Elite Milllionaire Protege Club January 2010  –  January 2012  (2 years 1 month) Executive Communications Manager Cisco November 2010  –  July 2011  (9 months) Executive Communications Manager Cisco November 2010  –  July 2011  (9 months) Communications Consultant Cisco August 2009  –  September 2010  (1 year 2 months) Communications Consultant Cisco August 2009  –  September 2010  (1 year 2 months) Social Media Consultant, Coach & Speaker YouConnected January 2009  –  October 2009  (10 months) Social Media Consultant, Coach & Speaker YouConnected January 2009  –  October 2009  (10 months) Marketing Communications Consultant Cisco August 2007  –  January 2009  (1 year 6 months) Marketing Communications Consultant Cisco August 2007  –  January 2009  (1 year 6 months) Communications & Operations Consultant McKenzie Event Management 2006  –  2007  (1 year) Communications & Operations Consultant McKenzie Event Management 2006  –  2007  (1 year) Communications Consultant - Knowledge Transfer Group France Telecom August 2005  –  May 2006  (10 months) Communications Consultant - Knowledge Transfer Group France Telecom August 2005  –  May 2006  (10 months) Director of Communications, Editor-in-Chief California Apartment Association (formerly Tri-County Apartment Association) October 2001  –  October 2004  (3 years 1 month) Director of Communications, Editor-in-Chief California Apartment Association (formerly Tri-County Apartment Association) October 2001  –  October 2004  (3 years 1 month) Manager, Technical Communications gForce, Inc. February 2000  –  October 2001  (1 year 9 months) Manager, Technical Communications gForce, Inc. February 2000  –  October 2001  (1 year 9 months) Director, Sales & Marketing ColonyNet.com (currently 2-Tier Software, Inc.) December 1999  –  February 2000  (3 months) Director, Sales & Marketing ColonyNet.com (currently 2-Tier Software, Inc.) December 1999  –  February 2000  (3 months) Technical Writer/Project Coordinator Nokia Internet Communications October 1998  –  December 1999  (1 year 3 months) Technical Writer/Project Coordinator Nokia Internet Communications October 1998  –  December 1999  (1 year 3 months) Director, Human Resources Sheraton Four Points Hotel May 1994  –  June 1995  (1 year 2 months) Director, Human Resources Sheraton Four Points Hotel May 1994  –  June 1995  (1 year 2 months) Languages English English English Skills Marketing Communications Social Media Corporate Communications Public Speaking Workshops Communication Training Retreats Internal Communications Blogging Content Development Social Media Marketing Public Relations Strategic Communications Content Management Newsletters Copywriting Strategy Press Releases Personal Development Advertising Marketing Leadership Entrepreneurship Management Social Networking Online Marketing See 11+     See less Skills  Marketing Communications Social Media Corporate Communications Public Speaking Workshops Communication Training Retreats Internal Communications Blogging Content Development Social Media Marketing Public Relations Strategic Communications Content Management Newsletters Copywriting Strategy Press Releases Personal Development Advertising Marketing Leadership Entrepreneurship Management Social Networking Online Marketing See 11+     See less Marketing Communications Social Media Corporate Communications Public Speaking Workshops Communication Training Retreats Internal Communications Blogging Content Development Social Media Marketing Public Relations Strategic Communications Content Management Newsletters Copywriting Strategy Press Releases Personal Development Advertising Marketing Leadership Entrepreneurship Management Social Networking Online Marketing See 11+     See less Marketing Communications Social Media Corporate Communications Public Speaking Workshops Communication Training Retreats Internal Communications Blogging Content Development Social Media Marketing Public Relations Strategic Communications Content Management Newsletters Copywriting Strategy Press Releases Personal Development Advertising Marketing Leadership Entrepreneurship Management Social Networking Online Marketing See 11+     See less Education San Jose State University B.S. San Jose State University Bachelor of Science (B.S.) San Jose State University B.S. San Jose State University B.S. San Jose State University B.S. San Jose State University Bachelor of Science (B.S.) San Jose State University Bachelor of Science (B.S.) San Jose State University Bachelor of Science (B.S.) Honors & Awards ", "Summary An experienced Senior Human Resources Management professional, with expertise in the areas of Talent Acquisition, Employment Law, Employee Relations, Labor Relations (union avoidance and representation elections), Compensation, Organizational Development, Succession Planning, and Leadership Development, and Safety. \n \nSpecialties: Technical Talent Acquisition, Employee Relations, Employment Law, Labor Relations, Organization and Leadership Development, Management Succession Development and Planning, Compensation and Benefits, and Global Human Resources. \n \nCompanies for whom I have worked include Cisco Systems, Nuova Systems, NextWave Broadband, AMD, Juniper Networks, Network Appliance, Trend Micro, Inc., OpenWave Systems, Philips Semiconductors, Compaq Computer Corp (now HP), Kinetic Concepts, and DataPoint Corp. Summary An experienced Senior Human Resources Management professional, with expertise in the areas of Talent Acquisition, Employment Law, Employee Relations, Labor Relations (union avoidance and representation elections), Compensation, Organizational Development, Succession Planning, and Leadership Development, and Safety. \n \nSpecialties: Technical Talent Acquisition, Employee Relations, Employment Law, Labor Relations, Organization and Leadership Development, Management Succession Development and Planning, Compensation and Benefits, and Global Human Resources. \n \nCompanies for whom I have worked include Cisco Systems, Nuova Systems, NextWave Broadband, AMD, Juniper Networks, Network Appliance, Trend Micro, Inc., OpenWave Systems, Philips Semiconductors, Compaq Computer Corp (now HP), Kinetic Concepts, and DataPoint Corp. An experienced Senior Human Resources Management professional, with expertise in the areas of Talent Acquisition, Employment Law, Employee Relations, Labor Relations (union avoidance and representation elections), Compensation, Organizational Development, Succession Planning, and Leadership Development, and Safety. \n \nSpecialties: Technical Talent Acquisition, Employee Relations, Employment Law, Labor Relations, Organization and Leadership Development, Management Succession Development and Planning, Compensation and Benefits, and Global Human Resources. \n \nCompanies for whom I have worked include Cisco Systems, Nuova Systems, NextWave Broadband, AMD, Juniper Networks, Network Appliance, Trend Micro, Inc., OpenWave Systems, Philips Semiconductors, Compaq Computer Corp (now HP), Kinetic Concepts, and DataPoint Corp. An experienced Senior Human Resources Management professional, with expertise in the areas of Talent Acquisition, Employment Law, Employee Relations, Labor Relations (union avoidance and representation elections), Compensation, Organizational Development, Succession Planning, and Leadership Development, and Safety. \n \nSpecialties: Technical Talent Acquisition, Employee Relations, Employment Law, Labor Relations, Organization and Leadership Development, Management Succession Development and Planning, Compensation and Benefits, and Global Human Resources. \n \nCompanies for whom I have worked include Cisco Systems, Nuova Systems, NextWave Broadband, AMD, Juniper Networks, Network Appliance, Trend Micro, Inc., OpenWave Systems, Philips Semiconductors, Compaq Computer Corp (now HP), Kinetic Concepts, and DataPoint Corp. Experience Sr. Talent Acquisition Advisor Cisco January 2010  – Present (5 years 8 months) Reno, Nevada Area Human Resources Consultant Jobfinders INC July 2002  –  December 2009  (7 years 6 months) Sr. Technology Talent Acquisition Consultant Nuova Systems/Cisco December 2007  –  December 2008  (1 year 1 month) San Jose, CA Sr. Human Resources Business Partner Nextwave Broadband September 2007  –  December 2007  (4 months) Sr. Staffing Consultant AMD March 2006  –  September 2007  (1 year 7 months) Sr Staffing Consultant Foxhunt, Inc October 2004  –  March 2006  (1 year 6 months) Sr. Technical Staffing Consultant Juniper Networks August 2005  –  January 2006  (6 months) Senior Staffing Consultant Trend Micro 2005  –  2005  (less than a year) Sr. Staffing Consultant Network Appliance 2005  –  2005  (less than a year) Sr. Manager, Human Resources Openwave Systems, Inc June 2001  –  May 2002  (1 year) Sr. Technical Staffing Lead Philips Semiconductors October 2000  –  May 2001  (8 months) Sr. Director, Human Resources SeeItFirst 2000  –  2000  (less than a year) Manager, Human Resources Cisco Systems 1998  –  2000  (2 years) Sr. Staffing Consultant Phoenix Technologies 1997  –  1998  (1 year) Sr. Staffing Consultant COMPAQ COMPUTER CORPORATION 1996  –  1998  (2 years) Staffing Consultant Data Race June 1995  –  June 1996  (1 year 1 month) Director, Human Resources Facilitators of Applied Clinical Trials 1991  –  1995  (4 years) Director, Employment and Employee Relations Kinetic Concepts, Inc. 1988  –  1990  (2 years) VP Operations Central Technical Services - CTS 1983  –  1988  (5 years) Director, Human Resources DataPoint Corp 1980  –  1983  (3 years) Sr. Talent Acquisition Advisor Cisco January 2010  – Present (5 years 8 months) Reno, Nevada Area Sr. Talent Acquisition Advisor Cisco January 2010  – Present (5 years 8 months) Reno, Nevada Area Human Resources Consultant Jobfinders INC July 2002  –  December 2009  (7 years 6 months) Human Resources Consultant Jobfinders INC July 2002  –  December 2009  (7 years 6 months) Sr. Technology Talent Acquisition Consultant Nuova Systems/Cisco December 2007  –  December 2008  (1 year 1 month) San Jose, CA Sr. Technology Talent Acquisition Consultant Nuova Systems/Cisco December 2007  –  December 2008  (1 year 1 month) San Jose, CA Sr. Human Resources Business Partner Nextwave Broadband September 2007  –  December 2007  (4 months) Sr. Human Resources Business Partner Nextwave Broadband September 2007  –  December 2007  (4 months) Sr. Staffing Consultant AMD March 2006  –  September 2007  (1 year 7 months) Sr. Staffing Consultant AMD March 2006  –  September 2007  (1 year 7 months) Sr Staffing Consultant Foxhunt, Inc October 2004  –  March 2006  (1 year 6 months) Sr Staffing Consultant Foxhunt, Inc October 2004  –  March 2006  (1 year 6 months) Sr. Technical Staffing Consultant Juniper Networks August 2005  –  January 2006  (6 months) Sr. Technical Staffing Consultant Juniper Networks August 2005  –  January 2006  (6 months) Senior Staffing Consultant Trend Micro 2005  –  2005  (less than a year) Senior Staffing Consultant Trend Micro 2005  –  2005  (less than a year) Sr. Staffing Consultant Network Appliance 2005  –  2005  (less than a year) Sr. Staffing Consultant Network Appliance 2005  –  2005  (less than a year) Sr. Manager, Human Resources Openwave Systems, Inc June 2001  –  May 2002  (1 year) Sr. Manager, Human Resources Openwave Systems, Inc June 2001  –  May 2002  (1 year) Sr. Technical Staffing Lead Philips Semiconductors October 2000  –  May 2001  (8 months) Sr. Technical Staffing Lead Philips Semiconductors October 2000  –  May 2001  (8 months) Sr. Director, Human Resources SeeItFirst 2000  –  2000  (less than a year) Sr. Director, Human Resources SeeItFirst 2000  –  2000  (less than a year) Manager, Human Resources Cisco Systems 1998  –  2000  (2 years) Manager, Human Resources Cisco Systems 1998  –  2000  (2 years) Sr. Staffing Consultant Phoenix Technologies 1997  –  1998  (1 year) Sr. Staffing Consultant Phoenix Technologies 1997  –  1998  (1 year) Sr. Staffing Consultant COMPAQ COMPUTER CORPORATION 1996  –  1998  (2 years) Sr. Staffing Consultant COMPAQ COMPUTER CORPORATION 1996  –  1998  (2 years) Staffing Consultant Data Race June 1995  –  June 1996  (1 year 1 month) Staffing Consultant Data Race June 1995  –  June 1996  (1 year 1 month) Director, Human Resources Facilitators of Applied Clinical Trials 1991  –  1995  (4 years) Director, Human Resources Facilitators of Applied Clinical Trials 1991  –  1995  (4 years) Director, Employment and Employee Relations Kinetic Concepts, Inc. 1988  –  1990  (2 years) Director, Employment and Employee Relations Kinetic Concepts, Inc. 1988  –  1990  (2 years) VP Operations Central Technical Services - CTS 1983  –  1988  (5 years) VP Operations Central Technical Services - CTS 1983  –  1988  (5 years) Director, Human Resources DataPoint Corp 1980  –  1983  (3 years) Director, Human Resources DataPoint Corp 1980  –  1983  (3 years) Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Italian Limited working proficiency Portuguese Limited working proficiency French Elementary proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Italian Limited working proficiency Portuguese Limited working proficiency French Elementary proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Italian Limited working proficiency Portuguese Limited working proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Elementary proficiency Skills Talent Acquisition Technical Recruiting Applicant Tracking... Recruiting Sourcing Human Resources Management Leadership Interviews Networking Employee Relations Temporary Placement Screening Resumes Deferred Compensation Program Management Talent Management HR Consulting Training College Recruiting Personnel Management Contract Recruitment Hiring Internet Recruiting Succession Planning Employer Branding Leadership Development Start-ups Executive Search Organizational... Benefits Negotiation Consulting Employee Engagement Cold Calling Search Recruitment Advertising IT Recruitment Onboarding Change Management Workforce Planning Process Improvement Performance Management Employee Benefits Labor Relations Vendor Management SDLC HRIS Staffing Services Team Building Screening HR Policies See 35+     See less Skills  Talent Acquisition Technical Recruiting Applicant Tracking... Recruiting Sourcing Human Resources Management Leadership Interviews Networking Employee Relations Temporary Placement Screening Resumes Deferred Compensation Program Management Talent Management HR Consulting Training College Recruiting Personnel Management Contract Recruitment Hiring Internet Recruiting Succession Planning Employer Branding Leadership Development Start-ups Executive Search Organizational... Benefits Negotiation Consulting Employee Engagement Cold Calling Search Recruitment Advertising IT Recruitment Onboarding Change Management Workforce Planning Process Improvement Performance Management Employee Benefits Labor Relations Vendor Management SDLC HRIS Staffing Services Team Building Screening HR Policies See 35+     See less Talent Acquisition Technical Recruiting Applicant Tracking... Recruiting Sourcing Human Resources Management Leadership Interviews Networking Employee Relations Temporary Placement Screening Resumes Deferred Compensation Program Management Talent Management HR Consulting Training College Recruiting Personnel Management Contract Recruitment Hiring Internet Recruiting Succession Planning Employer Branding Leadership Development Start-ups Executive Search Organizational... Benefits Negotiation Consulting Employee Engagement Cold Calling Search Recruitment Advertising IT Recruitment Onboarding Change Management Workforce Planning Process Improvement Performance Management Employee Benefits Labor Relations Vendor Management SDLC HRIS Staffing Services Team Building Screening HR Policies See 35+     See less Talent Acquisition Technical Recruiting Applicant Tracking... Recruiting Sourcing Human Resources Management Leadership Interviews Networking Employee Relations Temporary Placement Screening Resumes Deferred Compensation Program Management Talent Management HR Consulting Training College Recruiting Personnel Management Contract Recruitment Hiring Internet Recruiting Succession Planning Employer Branding Leadership Development Start-ups Executive Search Organizational... Benefits Negotiation Consulting Employee Engagement Cold Calling Search Recruitment Advertising IT Recruitment Onboarding Change Management Workforce Planning Process Improvement Performance Management Employee Benefits Labor Relations Vendor Management SDLC HRIS Staffing Services Team Building Screening HR Policies See 35+     See less Education Our Lady of the Lake University 1989  – 1989 Our Lady of the Lake University 1989  – 1989 Our Lady of the Lake University 1989  – 1989 Our Lady of the Lake University 1989  – 1989 Honors & Awards ", "Summary Effective at relationship building at all levels and across multi-sites and global business environments. \n \nSpecialties: Client Facing, Annual Cycle Porgrams with Budget Impact, Program Management, Data Analysis & Reporting, Coaching, Change Management, Compensation, Acquisitions, Talent Acquisition, University Relations, and Implementing Strategic Initiatives. Summary Effective at relationship building at all levels and across multi-sites and global business environments. \n \nSpecialties: Client Facing, Annual Cycle Porgrams with Budget Impact, Program Management, Data Analysis & Reporting, Coaching, Change Management, Compensation, Acquisitions, Talent Acquisition, University Relations, and Implementing Strategic Initiatives. Effective at relationship building at all levels and across multi-sites and global business environments. \n \nSpecialties: Client Facing, Annual Cycle Porgrams with Budget Impact, Program Management, Data Analysis & Reporting, Coaching, Change Management, Compensation, Acquisitions, Talent Acquisition, University Relations, and Implementing Strategic Initiatives. Effective at relationship building at all levels and across multi-sites and global business environments. \n \nSpecialties: Client Facing, Annual Cycle Porgrams with Budget Impact, Program Management, Data Analysis & Reporting, Coaching, Change Management, Compensation, Acquisitions, Talent Acquisition, University Relations, and Implementing Strategic Initiatives. Experience Manager, Human Resources Cisco Systems August 2009  – Present (6 years 1 month) Richardson, TX Manager, University Relations Cisco Systems October 2005  –  March 2008  (2 years 6 months) Human Resources Manager Cisco Systems, Inc October 1999  –  September 2005  (6 years) Director Human Resources IPCell Technologies (acquired by Cisco Systems, Inc) September 1999  –  October 2000  (1 year 2 months) Human Resource Manager Alcatel USA July 1996  –  September 1999  (3 years 3 months) Recruiting and Branch Manager Oxford & Associates July 1991  –  July 1996  (5 years 1 month) Manager, Human Resources Cisco Systems August 2009  – Present (6 years 1 month) Richardson, TX Manager, Human Resources Cisco Systems August 2009  – Present (6 years 1 month) Richardson, TX Manager, University Relations Cisco Systems October 2005  –  March 2008  (2 years 6 months) Manager, University Relations Cisco Systems October 2005  –  March 2008  (2 years 6 months) Human Resources Manager Cisco Systems, Inc October 1999  –  September 2005  (6 years) Human Resources Manager Cisco Systems, Inc October 1999  –  September 2005  (6 years) Director Human Resources IPCell Technologies (acquired by Cisco Systems, Inc) September 1999  –  October 2000  (1 year 2 months) Director Human Resources IPCell Technologies (acquired by Cisco Systems, Inc) September 1999  –  October 2000  (1 year 2 months) Human Resource Manager Alcatel USA July 1996  –  September 1999  (3 years 3 months) Human Resource Manager Alcatel USA July 1996  –  September 1999  (3 years 3 months) Recruiting and Branch Manager Oxford & Associates July 1991  –  July 1996  (5 years 1 month) Recruiting and Branch Manager Oxford & Associates July 1991  –  July 1996  (5 years 1 month) Skills Talent Acquisition Recruiting Human Resources Strategy Program Management Leadership Training Management Onboarding Succession Planning Personnel Management Change Management Applicant Tracking... Strategic Partnerships Interviews Deferred Compensation Business Development Coaching Temporary Placement Mergers & Acquisitions See 5+     See less Skills  Talent Acquisition Recruiting Human Resources Strategy Program Management Leadership Training Management Onboarding Succession Planning Personnel Management Change Management Applicant Tracking... Strategic Partnerships Interviews Deferred Compensation Business Development Coaching Temporary Placement Mergers & Acquisitions See 5+     See less Talent Acquisition Recruiting Human Resources Strategy Program Management Leadership Training Management Onboarding Succession Planning Personnel Management Change Management Applicant Tracking... Strategic Partnerships Interviews Deferred Compensation Business Development Coaching Temporary Placement Mergers & Acquisitions See 5+     See less Talent Acquisition Recruiting Human Resources Strategy Program Management Leadership Training Management Onboarding Succession Planning Personnel Management Change Management Applicant Tracking... Strategic Partnerships Interviews Deferred Compensation Business Development Coaching Temporary Placement Mergers & Acquisitions See 5+     See less Education The University of Texas at Dallas MPA 1989  – 1991 The University of Texas at Dallas BA 1986  – 1989 Wayne Memorial HS High School Diploma The University of Texas at Dallas MPA 1989  – 1991 The University of Texas at Dallas MPA 1989  – 1991 The University of Texas at Dallas MPA 1989  – 1991 The University of Texas at Dallas BA 1986  – 1989 The University of Texas at Dallas BA 1986  – 1989 The University of Texas at Dallas BA 1986  – 1989 Wayne Memorial HS High School Diploma Wayne Memorial HS High School Diploma Wayne Memorial HS High School Diploma ", "Experience Advisory Board Member Qwilt January 2012  – Present (3 years 8 months) Israel Director, Human Resources, South Europe Region Cisco Systems June 2011  – Present (4 years 3 months) Israel Director HR Mediterranean, DACH, Africa & Levant region Cisco March 2008  –  June 2011  (3 years 4 months) Madrid Area, Spain Country HR leader-Israel,Greece Cyprus & Malta Cisco January 2004  –  March 2008  (4 years 3 months) Israel HR Representative Cisco March 2000  –  2003  (3 years) Israel HR Representative LSI, an Avago Technologies Company 1998  –  1999  (1 year) Israel HR & Operation manager Nippon Electrical Industries. 1995  –  1998  (3 years) Bucharest, Romania Office manager Emda Executive Search & Consulting LTD 1993  –  1994  (1 year) Advisory Board Member Qwilt January 2012  – Present (3 years 8 months) Israel Advisory Board Member Qwilt January 2012  – Present (3 years 8 months) Israel Director, Human Resources, South Europe Region Cisco Systems June 2011  – Present (4 years 3 months) Israel Director, Human Resources, South Europe Region Cisco Systems June 2011  – Present (4 years 3 months) Israel Director HR Mediterranean, DACH, Africa & Levant region Cisco March 2008  –  June 2011  (3 years 4 months) Madrid Area, Spain Director HR Mediterranean, DACH, Africa & Levant region Cisco March 2008  –  June 2011  (3 years 4 months) Madrid Area, Spain Country HR leader-Israel,Greece Cyprus & Malta Cisco January 2004  –  March 2008  (4 years 3 months) Israel Country HR leader-Israel,Greece Cyprus & Malta Cisco January 2004  –  March 2008  (4 years 3 months) Israel HR Representative Cisco March 2000  –  2003  (3 years) Israel HR Representative Cisco March 2000  –  2003  (3 years) Israel HR Representative LSI, an Avago Technologies Company 1998  –  1999  (1 year) Israel HR Representative LSI, an Avago Technologies Company 1998  –  1999  (1 year) Israel HR & Operation manager Nippon Electrical Industries. 1995  –  1998  (3 years) Bucharest, Romania HR & Operation manager Nippon Electrical Industries. 1995  –  1998  (3 years) Bucharest, Romania Office manager Emda Executive Search & Consulting LTD 1993  –  1994  (1 year) Office manager Emda Executive Search & Consulting LTD 1993  –  1994  (1 year) Languages English Spanish Hebrew English Spanish Hebrew English Spanish Hebrew Skills Employee Relations Talent Management Succession Planning HR Consulting Performance Management Employee Engagement Human Resources Organizational... Organizational Design Deferred Compensation Personnel Management HR Policies Talent Acquisition HRIS Management Development Technical Recruiting Change Management Career Development Recruiting Strategy See 5+     See less Skills  Employee Relations Talent Management Succession Planning HR Consulting Performance Management Employee Engagement Human Resources Organizational... Organizational Design Deferred Compensation Personnel Management HR Policies Talent Acquisition HRIS Management Development Technical Recruiting Change Management Career Development Recruiting Strategy See 5+     See less Employee Relations Talent Management Succession Planning HR Consulting Performance Management Employee Engagement Human Resources Organizational... Organizational Design Deferred Compensation Personnel Management HR Policies Talent Acquisition HRIS Management Development Technical Recruiting Change Management Career Development Recruiting Strategy See 5+     See less Employee Relations Talent Management Succession Planning HR Consulting Performance Management Employee Engagement Human Resources Organizational... Organizational Design Deferred Compensation Personnel Management HR Policies Talent Acquisition HRIS Management Development Technical Recruiting Change Management Career Development Recruiting Strategy See 5+     See less ", "Skills Six Sigma Process Improvement Change Management Program Management Lean Manufacturing Kaizen Operations Management Operational Excellence Problem Solving Process Engineering Minitab JMP Management Consulting Strategy Cross-functional Team... Project Management Training Leadership Business Process... Supply Chain Management Black Belt Business Intelligence Project Portfolio... Manufacturing Business Process Strategic Planning Team Building DMAIC Supply Chain Management Human Resources Business Process... Product Development Outsourcing Product Management Business Transformation Integration Consulting Business Strategy Start-ups Team Leadership Recruiting Talent Acquisition Business Development Project Planning Business Analysis ERP CRM IT Strategy PMP See 35+     See less Skills  Six Sigma Process Improvement Change Management Program Management Lean Manufacturing Kaizen Operations Management Operational Excellence Problem Solving Process Engineering Minitab JMP Management Consulting Strategy Cross-functional Team... Project Management Training Leadership Business Process... Supply Chain Management Black Belt Business Intelligence Project Portfolio... Manufacturing Business Process Strategic Planning Team Building DMAIC Supply Chain Management Human Resources Business Process... Product Development Outsourcing Product Management Business Transformation Integration Consulting Business Strategy Start-ups Team Leadership Recruiting Talent Acquisition Business Development Project Planning Business Analysis ERP CRM IT Strategy PMP See 35+     See less Six Sigma Process Improvement Change Management Program Management Lean Manufacturing Kaizen Operations Management Operational Excellence Problem Solving Process Engineering Minitab JMP Management Consulting Strategy Cross-functional Team... Project Management Training Leadership Business Process... Supply Chain Management Black Belt Business Intelligence Project Portfolio... Manufacturing Business Process Strategic Planning Team Building DMAIC Supply Chain Management Human Resources Business Process... Product Development Outsourcing Product Management Business Transformation Integration Consulting Business Strategy Start-ups Team Leadership Recruiting Talent Acquisition Business Development Project Planning Business Analysis ERP CRM IT Strategy PMP See 35+     See less Six Sigma Process Improvement Change Management Program Management Lean Manufacturing Kaizen Operations Management Operational Excellence Problem Solving Process Engineering Minitab JMP Management Consulting Strategy Cross-functional Team... Project Management Training Leadership Business Process... Supply Chain Management Black Belt Business Intelligence Project Portfolio... Manufacturing Business Process Strategic Planning Team Building DMAIC Supply Chain Management Human Resources Business Process... Product Development Outsourcing Product Management Business Transformation Integration Consulting Business Strategy Start-ups Team Leadership Recruiting Talent Acquisition Business Development Project Planning Business Analysis ERP CRM IT Strategy PMP See 35+     See less Honors & Awards ", "Languages Japanese Chinese English Japanese Chinese English Japanese Chinese English Skills Recruiting Talent Management Executive Coaching Strategy Training Business Development Leadership Cross-functional Team... Performance Management Management Product Management Strategic Planning Leadership Development Employee Relations Talent Acquisition Change Management Succession Planning Employee Engagement Market Analysis Business Strategy Personnel Management Human Resources Mergers & Acquisitions Program Management Organizational... See 10+     See less Skills  Recruiting Talent Management Executive Coaching Strategy Training Business Development Leadership Cross-functional Team... Performance Management Management Product Management Strategic Planning Leadership Development Employee Relations Talent Acquisition Change Management Succession Planning Employee Engagement Market Analysis Business Strategy Personnel Management Human Resources Mergers & Acquisitions Program Management Organizational... See 10+     See less Recruiting Talent Management Executive Coaching Strategy Training Business Development Leadership Cross-functional Team... Performance Management Management Product Management Strategic Planning Leadership Development Employee Relations Talent Acquisition Change Management Succession Planning Employee Engagement Market Analysis Business Strategy Personnel Management Human Resources Mergers & Acquisitions Program Management Organizational... See 10+     See less Recruiting Talent Management Executive Coaching Strategy Training Business Development Leadership Cross-functional Team... Performance Management Management Product Management Strategic Planning Leadership Development Employee Relations Talent Acquisition Change Management Succession Planning Employee Engagement Market Analysis Business Strategy Personnel Management Human Resources Mergers & Acquisitions Program Management Organizational... See 10+     See less Honors & Awards ", "Summary Global Sales Business Partner ▪ Sales Compensation ▪ Executive Coaching ▪ Acquisition Expertise \n \n \n\tOffer positive reputation as building a trusted advisor relationship with all management levels; global expertise with proven success in supporting multi-million dollar organizations. \n\tStrategic thinker with keen business acumen and influencing skills used to effectively coach leaders, manage change, drive acquisition integrations, and lead start up initiatives. \n\tPossess acute sense of urgency; balance multiple priorities, collaborate with others, and creatively and diplomatically solve problems to successfully meet ever-changing business needs. \n\tExcellent relationship management, project management, and facilitation skills; deliver a synchronized leadership approach to align business plans and manage risk; balances multiple responsibilities while maintaining focus on priorities. \n\tWell-rounded HR professional, experienced working in diverse industries, skilled in developing and motivating employees, and coaching leaders to increase effectiveness. \n\tStrong communicator who is known for developing and delivering teambuilding programs used within multi-cultural work teams and cross-functionally. Summary Global Sales Business Partner ▪ Sales Compensation ▪ Executive Coaching ▪ Acquisition Expertise \n \n \n\tOffer positive reputation as building a trusted advisor relationship with all management levels; global expertise with proven success in supporting multi-million dollar organizations. \n\tStrategic thinker with keen business acumen and influencing skills used to effectively coach leaders, manage change, drive acquisition integrations, and lead start up initiatives. \n\tPossess acute sense of urgency; balance multiple priorities, collaborate with others, and creatively and diplomatically solve problems to successfully meet ever-changing business needs. \n\tExcellent relationship management, project management, and facilitation skills; deliver a synchronized leadership approach to align business plans and manage risk; balances multiple responsibilities while maintaining focus on priorities. \n\tWell-rounded HR professional, experienced working in diverse industries, skilled in developing and motivating employees, and coaching leaders to increase effectiveness. \n\tStrong communicator who is known for developing and delivering teambuilding programs used within multi-cultural work teams and cross-functionally. Global Sales Business Partner ▪ Sales Compensation ▪ Executive Coaching ▪ Acquisition Expertise \n \n \n\tOffer positive reputation as building a trusted advisor relationship with all management levels; global expertise with proven success in supporting multi-million dollar organizations. \n\tStrategic thinker with keen business acumen and influencing skills used to effectively coach leaders, manage change, drive acquisition integrations, and lead start up initiatives. \n\tPossess acute sense of urgency; balance multiple priorities, collaborate with others, and creatively and diplomatically solve problems to successfully meet ever-changing business needs. \n\tExcellent relationship management, project management, and facilitation skills; deliver a synchronized leadership approach to align business plans and manage risk; balances multiple responsibilities while maintaining focus on priorities. \n\tWell-rounded HR professional, experienced working in diverse industries, skilled in developing and motivating employees, and coaching leaders to increase effectiveness. \n\tStrong communicator who is known for developing and delivering teambuilding programs used within multi-cultural work teams and cross-functionally. Global Sales Business Partner ▪ Sales Compensation ▪ Executive Coaching ▪ Acquisition Expertise \n \n \n\tOffer positive reputation as building a trusted advisor relationship with all management levels; global expertise with proven success in supporting multi-million dollar organizations. \n\tStrategic thinker with keen business acumen and influencing skills used to effectively coach leaders, manage change, drive acquisition integrations, and lead start up initiatives. \n\tPossess acute sense of urgency; balance multiple priorities, collaborate with others, and creatively and diplomatically solve problems to successfully meet ever-changing business needs. \n\tExcellent relationship management, project management, and facilitation skills; deliver a synchronized leadership approach to align business plans and manage risk; balances multiple responsibilities while maintaining focus on priorities. \n\tWell-rounded HR professional, experienced working in diverse industries, skilled in developing and motivating employees, and coaching leaders to increase effectiveness. \n\tStrong communicator who is known for developing and delivering teambuilding programs used within multi-cultural work teams and cross-functionally. Experience Director of Human Resources Emergent BioSolutions July 2014  – Present (1 year 2 months) Director of Human Resources for US Commercial Sales for the BioScience Division and the Contract Manufacturing Plant. Partner to Senior Leadership team on human capital issues around strategy, workforce development, leadership development, employee relations and coaching. Consultant Human Resouces Consulting February 2014  –  July 2014  (6 months) Potomac Falls, VA Short term project support and career coaching. SR HR Manager Cisco Systems, Inc October 1999  –  December 2013  (14 years 3 months) Herndon, VA Senior Human Resources Manager (San José) ▪ 2001 to 2003 (Herndon, VA) ▪ 1999 to 2001 \nSupported two engineering business units with nearly 600 employees and revenue of $3.5B annually;  \nPerformed organization development role for multiple high growth software organizations located in Herndon and Richmond, VA.  \n\tEstablished two Leadership Councils focused on conducting talent reviews for top 20% and development plans for high potential employees. \n\tProject Managed implementation of ranking system used for major restructuring of an engineering organization of 13,000 employees, 2000 managers, and 60+ HR professionals. \n\tImplemented strategic programs targeted to improve teambuilding, retention, conflict management, executive coaching, and workforce planning. \n\tEarned Performance Dimensions International (PDI) 360 degree feedback certification — delivered feedback, instituted development plans, and used skills to coach all management levels. \n\tImproved productivity and relationships between development and marketing by spearheading conflict resolution intervention. Interviewed 30+ employees, coached management, and coached leaders to improve behavior and practices. Senior Human Resources Manager Cisco 1999  –  December 2013  (14 years) Herndon, VA Senior Human Resources Manager – Global Sales ▪ 2012 to 2013 ▪ Service Provider Sales ▪ 2003 to 2011 \nExecute HR strategies and practices; lead a team of five aligned to support Channels, Architectures (Cloud, Video, and Collaboration) globally. Provided HR Business Partner support to VP’s supporting multi-billion dollar service provider customers: Verizon, ATT, Google, & Microsoft. \n\tDrove strategic compensation programs, orchestrated Leadership for America’s HR development initiative, devised coaching program matching manager to coach, and managed organization-wide development programs: Influence, resilience, root cause analysis, and coaching. \n\tSuccessfully integrated 120 Starent sales employees located in 40 countries resulting in $600M in additional revenue. \no\tPartnered with executive leadership for on-boarding, compensation transitions, and change management initiatives. \no\tAchieved recognition as best practice for acquisition process management. \n\tDrove talent reviews and succession planning sessions — utilized data to fulfill key promotions, resulting in improved sharing of talent globally, and addressed key business needs. \n\tLed team to develop change management tools employed in large-scale organization changes and acquisition integrations to improve management capability and organizational success.  \n\tCreated and launched performance management training for the Service Provider sales organization; designed employee retention program which resulted in organization-wide change in management practices — increased leadership effectiveness and enhanced retention and employee engagement. Director, Human Resources Baan Company 1997  –  1999  (2 years) Reston, VA •\tBaan Company incorporated private venture capital corporations for specific product development for Supply Chain Management. Responsible for the establishment of Human Resources for the venture corporations. This was a start up environment and included establishing all HR practices, recruiting, benefits and 401k in a rapid growth environment.  \n•\tAfter 10 months, the venture companies were closed and transferred to Baan USA for the Senior Human Resources position in the US, (1300 employees and 400M in revenue). Included responsibility for the US/Canada Baan Corporate Human Resource function (staff of 14) including recruiting, HR Call Center, relocation, immigration, benefits and compensation for the Americas. The last twelve months involved extensive downsizing of the organization. Planned and implemented all phases including legal analysis, management training and implementation in U.S. and Canada. Director, HR Intersolv 1995  –  1997  (2 years) Rockville, MD Senior Human Resource position in the company, partnering with the President and Executive staff, responsible for implementation and sophistication of all human resource functions for 1500 employees, 300M in revenue. Enhanced employee benefits programs while saving over 25% annually.  \n•\tDeveloped retention and management development programs resulting in reduced turnover by 20% annually.  \n•\tSuccessfully developed and manage a recruiting function for the consulting organization resulting in 200+ hires per year. Enhanced and developed employee communications programs. Implemented a new employee handbook and on-line requisition system. Implemented employee and management development programs. Created and implemented Leadership Development Program, and other programs such as drug testing, relocation and compensation framework. Director, Human Resources Legent 1990  –  August 1995  (5 years) Herndon, VA •\tPromoted to support the Global Sales and Services Team. Strategic business partner with the Executive Vice President of Sales and the General Manager of Services for innovative human resources to meet organizational and business objectives which include organizational design of the Global Sales Team, international relocation, compensation and organizational development. Involved major acquisition of Goal Systems and integrating two US sales organizations. \n \nHuman Resources Manager \n•\tPromoted after ten months to include management of the Corporate Human Resource function and the North American Sales organization for over 900 employees. This role included leadership development and coaching, employee relations, compensation management, recruiting, and Human Resources staff development. \n•\tResponsibilities included implementation of a Corporate Managing Diversity program, research and author of the corporate relocation programs, and Affirmative Action recruiting.  \n•\tAdditional projects included a revised Service Award program and the establishment of a corporate wide employee survey. \n \nHuman Resources Manager/North American Sales \n•\tBusiness partner to the Executive Vice President of North American Sales in a generalist role. Area Employement Manager Digital Equipment 1988  –  1990  (2 years) Dallas , Texas •\tResponsible for the re-organization of an employment organization for a six state geography ($2billion in revenue, 1900 employees). Included establishment of policies for employment practices, an employee referral program, Affirmative Action hiring strategies and an in-house temporary/contractor program of 500 additional employees. \n•\tProject management of the Affirmative Action Plan. \n•\tEffective management of a corporate re-deployment program resulting in career moves for 300 employees. \n•\tReceived two Customer Excellence Awards. Director of Human Resources Emergent BioSolutions July 2014  – Present (1 year 2 months) Director of Human Resources for US Commercial Sales for the BioScience Division and the Contract Manufacturing Plant. Partner to Senior Leadership team on human capital issues around strategy, workforce development, leadership development, employee relations and coaching. Director of Human Resources Emergent BioSolutions July 2014  – Present (1 year 2 months) Director of Human Resources for US Commercial Sales for the BioScience Division and the Contract Manufacturing Plant. Partner to Senior Leadership team on human capital issues around strategy, workforce development, leadership development, employee relations and coaching. Consultant Human Resouces Consulting February 2014  –  July 2014  (6 months) Potomac Falls, VA Short term project support and career coaching. Consultant Human Resouces Consulting February 2014  –  July 2014  (6 months) Potomac Falls, VA Short term project support and career coaching. SR HR Manager Cisco Systems, Inc October 1999  –  December 2013  (14 years 3 months) Herndon, VA Senior Human Resources Manager (San José) ▪ 2001 to 2003 (Herndon, VA) ▪ 1999 to 2001 \nSupported two engineering business units with nearly 600 employees and revenue of $3.5B annually;  \nPerformed organization development role for multiple high growth software organizations located in Herndon and Richmond, VA.  \n\tEstablished two Leadership Councils focused on conducting talent reviews for top 20% and development plans for high potential employees. \n\tProject Managed implementation of ranking system used for major restructuring of an engineering organization of 13,000 employees, 2000 managers, and 60+ HR professionals. \n\tImplemented strategic programs targeted to improve teambuilding, retention, conflict management, executive coaching, and workforce planning. \n\tEarned Performance Dimensions International (PDI) 360 degree feedback certification — delivered feedback, instituted development plans, and used skills to coach all management levels. \n\tImproved productivity and relationships between development and marketing by spearheading conflict resolution intervention. Interviewed 30+ employees, coached management, and coached leaders to improve behavior and practices. SR HR Manager Cisco Systems, Inc October 1999  –  December 2013  (14 years 3 months) Herndon, VA Senior Human Resources Manager (San José) ▪ 2001 to 2003 (Herndon, VA) ▪ 1999 to 2001 \nSupported two engineering business units with nearly 600 employees and revenue of $3.5B annually;  \nPerformed organization development role for multiple high growth software organizations located in Herndon and Richmond, VA.  \n\tEstablished two Leadership Councils focused on conducting talent reviews for top 20% and development plans for high potential employees. \n\tProject Managed implementation of ranking system used for major restructuring of an engineering organization of 13,000 employees, 2000 managers, and 60+ HR professionals. \n\tImplemented strategic programs targeted to improve teambuilding, retention, conflict management, executive coaching, and workforce planning. \n\tEarned Performance Dimensions International (PDI) 360 degree feedback certification — delivered feedback, instituted development plans, and used skills to coach all management levels. \n\tImproved productivity and relationships between development and marketing by spearheading conflict resolution intervention. Interviewed 30+ employees, coached management, and coached leaders to improve behavior and practices. Senior Human Resources Manager Cisco 1999  –  December 2013  (14 years) Herndon, VA Senior Human Resources Manager – Global Sales ▪ 2012 to 2013 ▪ Service Provider Sales ▪ 2003 to 2011 \nExecute HR strategies and practices; lead a team of five aligned to support Channels, Architectures (Cloud, Video, and Collaboration) globally. Provided HR Business Partner support to VP’s supporting multi-billion dollar service provider customers: Verizon, ATT, Google, & Microsoft. \n\tDrove strategic compensation programs, orchestrated Leadership for America’s HR development initiative, devised coaching program matching manager to coach, and managed organization-wide development programs: Influence, resilience, root cause analysis, and coaching. \n\tSuccessfully integrated 120 Starent sales employees located in 40 countries resulting in $600M in additional revenue. \no\tPartnered with executive leadership for on-boarding, compensation transitions, and change management initiatives. \no\tAchieved recognition as best practice for acquisition process management. \n\tDrove talent reviews and succession planning sessions — utilized data to fulfill key promotions, resulting in improved sharing of talent globally, and addressed key business needs. \n\tLed team to develop change management tools employed in large-scale organization changes and acquisition integrations to improve management capability and organizational success.  \n\tCreated and launched performance management training for the Service Provider sales organization; designed employee retention program which resulted in organization-wide change in management practices — increased leadership effectiveness and enhanced retention and employee engagement. Senior Human Resources Manager Cisco 1999  –  December 2013  (14 years) Herndon, VA Senior Human Resources Manager – Global Sales ▪ 2012 to 2013 ▪ Service Provider Sales ▪ 2003 to 2011 \nExecute HR strategies and practices; lead a team of five aligned to support Channels, Architectures (Cloud, Video, and Collaboration) globally. Provided HR Business Partner support to VP’s supporting multi-billion dollar service provider customers: Verizon, ATT, Google, & Microsoft. \n\tDrove strategic compensation programs, orchestrated Leadership for America’s HR development initiative, devised coaching program matching manager to coach, and managed organization-wide development programs: Influence, resilience, root cause analysis, and coaching. \n\tSuccessfully integrated 120 Starent sales employees located in 40 countries resulting in $600M in additional revenue. \no\tPartnered with executive leadership for on-boarding, compensation transitions, and change management initiatives. \no\tAchieved recognition as best practice for acquisition process management. \n\tDrove talent reviews and succession planning sessions — utilized data to fulfill key promotions, resulting in improved sharing of talent globally, and addressed key business needs. \n\tLed team to develop change management tools employed in large-scale organization changes and acquisition integrations to improve management capability and organizational success.  \n\tCreated and launched performance management training for the Service Provider sales organization; designed employee retention program which resulted in organization-wide change in management practices — increased leadership effectiveness and enhanced retention and employee engagement. Director, Human Resources Baan Company 1997  –  1999  (2 years) Reston, VA •\tBaan Company incorporated private venture capital corporations for specific product development for Supply Chain Management. Responsible for the establishment of Human Resources for the venture corporations. This was a start up environment and included establishing all HR practices, recruiting, benefits and 401k in a rapid growth environment.  \n•\tAfter 10 months, the venture companies were closed and transferred to Baan USA for the Senior Human Resources position in the US, (1300 employees and 400M in revenue). Included responsibility for the US/Canada Baan Corporate Human Resource function (staff of 14) including recruiting, HR Call Center, relocation, immigration, benefits and compensation for the Americas. The last twelve months involved extensive downsizing of the organization. Planned and implemented all phases including legal analysis, management training and implementation in U.S. and Canada. Director, Human Resources Baan Company 1997  –  1999  (2 years) Reston, VA •\tBaan Company incorporated private venture capital corporations for specific product development for Supply Chain Management. Responsible for the establishment of Human Resources for the venture corporations. This was a start up environment and included establishing all HR practices, recruiting, benefits and 401k in a rapid growth environment.  \n•\tAfter 10 months, the venture companies were closed and transferred to Baan USA for the Senior Human Resources position in the US, (1300 employees and 400M in revenue). Included responsibility for the US/Canada Baan Corporate Human Resource function (staff of 14) including recruiting, HR Call Center, relocation, immigration, benefits and compensation for the Americas. The last twelve months involved extensive downsizing of the organization. Planned and implemented all phases including legal analysis, management training and implementation in U.S. and Canada. Director, HR Intersolv 1995  –  1997  (2 years) Rockville, MD Senior Human Resource position in the company, partnering with the President and Executive staff, responsible for implementation and sophistication of all human resource functions for 1500 employees, 300M in revenue. Enhanced employee benefits programs while saving over 25% annually.  \n•\tDeveloped retention and management development programs resulting in reduced turnover by 20% annually.  \n•\tSuccessfully developed and manage a recruiting function for the consulting organization resulting in 200+ hires per year. Enhanced and developed employee communications programs. Implemented a new employee handbook and on-line requisition system. Implemented employee and management development programs. Created and implemented Leadership Development Program, and other programs such as drug testing, relocation and compensation framework. Director, HR Intersolv 1995  –  1997  (2 years) Rockville, MD Senior Human Resource position in the company, partnering with the President and Executive staff, responsible for implementation and sophistication of all human resource functions for 1500 employees, 300M in revenue. Enhanced employee benefits programs while saving over 25% annually.  \n•\tDeveloped retention and management development programs resulting in reduced turnover by 20% annually.  \n•\tSuccessfully developed and manage a recruiting function for the consulting organization resulting in 200+ hires per year. Enhanced and developed employee communications programs. Implemented a new employee handbook and on-line requisition system. Implemented employee and management development programs. Created and implemented Leadership Development Program, and other programs such as drug testing, relocation and compensation framework. Director, Human Resources Legent 1990  –  August 1995  (5 years) Herndon, VA •\tPromoted to support the Global Sales and Services Team. Strategic business partner with the Executive Vice President of Sales and the General Manager of Services for innovative human resources to meet organizational and business objectives which include organizational design of the Global Sales Team, international relocation, compensation and organizational development. Involved major acquisition of Goal Systems and integrating two US sales organizations. \n \nHuman Resources Manager \n•\tPromoted after ten months to include management of the Corporate Human Resource function and the North American Sales organization for over 900 employees. This role included leadership development and coaching, employee relations, compensation management, recruiting, and Human Resources staff development. \n•\tResponsibilities included implementation of a Corporate Managing Diversity program, research and author of the corporate relocation programs, and Affirmative Action recruiting.  \n•\tAdditional projects included a revised Service Award program and the establishment of a corporate wide employee survey. \n \nHuman Resources Manager/North American Sales \n•\tBusiness partner to the Executive Vice President of North American Sales in a generalist role. Director, Human Resources Legent 1990  –  August 1995  (5 years) Herndon, VA •\tPromoted to support the Global Sales and Services Team. Strategic business partner with the Executive Vice President of Sales and the General Manager of Services for innovative human resources to meet organizational and business objectives which include organizational design of the Global Sales Team, international relocation, compensation and organizational development. Involved major acquisition of Goal Systems and integrating two US sales organizations. \n \nHuman Resources Manager \n•\tPromoted after ten months to include management of the Corporate Human Resource function and the North American Sales organization for over 900 employees. This role included leadership development and coaching, employee relations, compensation management, recruiting, and Human Resources staff development. \n•\tResponsibilities included implementation of a Corporate Managing Diversity program, research and author of the corporate relocation programs, and Affirmative Action recruiting.  \n•\tAdditional projects included a revised Service Award program and the establishment of a corporate wide employee survey. \n \nHuman Resources Manager/North American Sales \n•\tBusiness partner to the Executive Vice President of North American Sales in a generalist role. Area Employement Manager Digital Equipment 1988  –  1990  (2 years) Dallas , Texas •\tResponsible for the re-organization of an employment organization for a six state geography ($2billion in revenue, 1900 employees). Included establishment of policies for employment practices, an employee referral program, Affirmative Action hiring strategies and an in-house temporary/contractor program of 500 additional employees. \n•\tProject management of the Affirmative Action Plan. \n•\tEffective management of a corporate re-deployment program resulting in career moves for 300 employees. \n•\tReceived two Customer Excellence Awards. Area Employement Manager Digital Equipment 1988  –  1990  (2 years) Dallas , Texas •\tResponsible for the re-organization of an employment organization for a six state geography ($2billion in revenue, 1900 employees). Included establishment of policies for employment practices, an employee referral program, Affirmative Action hiring strategies and an in-house temporary/contractor program of 500 additional employees. \n•\tProject management of the Affirmative Action Plan. \n•\tEffective management of a corporate re-deployment program resulting in career moves for 300 employees. \n•\tReceived two Customer Excellence Awards. Skills Workforce Planning Onboarding Performance Management Talent Management Succession Planning Employee Relations Employee Engagement Organizational... Organizational Design Human Resources Leadership Development Coaching Strategy Recruiting Executive Coaching Leadership Personnel Management Interviews Employee Benefits Management Program Management Start-ups Team Building Mergers & Acquisitions Conflict Resolution See 10+     See less Skills  Workforce Planning Onboarding Performance Management Talent Management Succession Planning Employee Relations Employee Engagement Organizational... Organizational Design Human Resources Leadership Development Coaching Strategy Recruiting Executive Coaching Leadership Personnel Management Interviews Employee Benefits Management Program Management Start-ups Team Building Mergers & Acquisitions Conflict Resolution See 10+     See less Workforce Planning Onboarding Performance Management Talent Management Succession Planning Employee Relations Employee Engagement Organizational... Organizational Design Human Resources Leadership Development Coaching Strategy Recruiting Executive Coaching Leadership Personnel Management Interviews Employee Benefits Management Program Management Start-ups Team Building Mergers & Acquisitions Conflict Resolution See 10+     See less Workforce Planning Onboarding Performance Management Talent Management Succession Planning Employee Relations Employee Engagement Organizational... Organizational Design Human Resources Leadership Development Coaching Strategy Recruiting Executive Coaching Leadership Personnel Management Interviews Employee Benefits Management Program Management Start-ups Team Building Mergers & Acquisitions Conflict Resolution See 10+     See less Education Marymount University Masters Org Effectiveness,  HR 1994  – 1996 Activities and Societies:  Graduated with Honors Baylor University BA,  Psychology Marymount University Masters Org Effectiveness,  HR 1994  – 1996 Activities and Societies:  Graduated with Honors Marymount University Masters Org Effectiveness,  HR 1994  – 1996 Activities and Societies:  Graduated with Honors Marymount University Masters Org Effectiveness,  HR 1994  – 1996 Activities and Societies:  Graduated with Honors Baylor University BA,  Psychology Baylor University BA,  Psychology Baylor University BA,  Psychology ", "Summary High-energy and insightful HR Executive with India and Asia Pacific wide leadership experience. Proven track record of driving multi-billion dollar businesses thru strategic HR.  \n \nExtensive knowledge of Asia Pacific & India talent markets particularly in the technology industry, with over 2 decades experience in IT (hardware/ semiconductors, networking/ systems integration, e-commerce and telecommunications) and in Manufacturing. Passionate about building leadership teams that can Grow and Transform the Business in a fast paced technology environment.  \n \nCisco is special: we connect everything and innovate everywhere to benefit everyone. Our innovation and edge comes from our people. At Cisco I work every day to create a place like no other, so all of my Cisco colleagues can fulfill their professional ambitions and change the world. And achieve what they need to evolve as an individual, team, business unit, region and Cisco as a whole. We inspire, attract and recognize the best talent to support our primary goal: for Cisco to be the #1 IT company.  \n \nIf the Cisco story appeals to you, please take a look at our latest career opportunities https://jobs.cisco.com/  \n \nAre you ready for the challenge of a lifetime?  Summary High-energy and insightful HR Executive with India and Asia Pacific wide leadership experience. Proven track record of driving multi-billion dollar businesses thru strategic HR.  \n \nExtensive knowledge of Asia Pacific & India talent markets particularly in the technology industry, with over 2 decades experience in IT (hardware/ semiconductors, networking/ systems integration, e-commerce and telecommunications) and in Manufacturing. Passionate about building leadership teams that can Grow and Transform the Business in a fast paced technology environment.  \n \nCisco is special: we connect everything and innovate everywhere to benefit everyone. Our innovation and edge comes from our people. At Cisco I work every day to create a place like no other, so all of my Cisco colleagues can fulfill their professional ambitions and change the world. And achieve what they need to evolve as an individual, team, business unit, region and Cisco as a whole. We inspire, attract and recognize the best talent to support our primary goal: for Cisco to be the #1 IT company.  \n \nIf the Cisco story appeals to you, please take a look at our latest career opportunities https://jobs.cisco.com/  \n \nAre you ready for the challenge of a lifetime?  High-energy and insightful HR Executive with India and Asia Pacific wide leadership experience. Proven track record of driving multi-billion dollar businesses thru strategic HR.  \n \nExtensive knowledge of Asia Pacific & India talent markets particularly in the technology industry, with over 2 decades experience in IT (hardware/ semiconductors, networking/ systems integration, e-commerce and telecommunications) and in Manufacturing. Passionate about building leadership teams that can Grow and Transform the Business in a fast paced technology environment.  \n \nCisco is special: we connect everything and innovate everywhere to benefit everyone. Our innovation and edge comes from our people. At Cisco I work every day to create a place like no other, so all of my Cisco colleagues can fulfill their professional ambitions and change the world. And achieve what they need to evolve as an individual, team, business unit, region and Cisco as a whole. We inspire, attract and recognize the best talent to support our primary goal: for Cisco to be the #1 IT company.  \n \nIf the Cisco story appeals to you, please take a look at our latest career opportunities https://jobs.cisco.com/  \n \nAre you ready for the challenge of a lifetime?  High-energy and insightful HR Executive with India and Asia Pacific wide leadership experience. Proven track record of driving multi-billion dollar businesses thru strategic HR.  \n \nExtensive knowledge of Asia Pacific & India talent markets particularly in the technology industry, with over 2 decades experience in IT (hardware/ semiconductors, networking/ systems integration, e-commerce and telecommunications) and in Manufacturing. Passionate about building leadership teams that can Grow and Transform the Business in a fast paced technology environment.  \n \nCisco is special: we connect everything and innovate everywhere to benefit everyone. Our innovation and edge comes from our people. At Cisco I work every day to create a place like no other, so all of my Cisco colleagues can fulfill their professional ambitions and change the world. And achieve what they need to evolve as an individual, team, business unit, region and Cisco as a whole. We inspire, attract and recognize the best talent to support our primary goal: for Cisco to be the #1 IT company.  \n \nIf the Cisco story appeals to you, please take a look at our latest career opportunities https://jobs.cisco.com/  \n \nAre you ready for the challenge of a lifetime?  Experience Director and Head of Human Resources, Cisco India and SAARC Cisco January 2014  – Present (1 year 8 months) Bengaluru Area, India I feel very privileged to Partner with highly innovative and visionary business leaders that are completely re-imagining the business and driving impact out of Cisco India, for India as a country and for Cisco worldwide! Director - Human Resources Cisco Systems October 2012  – Present (2 years 11 months) Bangalore HR Partner for Cisco Services and Industry Solutions Groups across AsiaPac, Japan and China.  \nI enable business entities with combined revenue of over $2 Billion.  \nBuild integrated Talent and People Strategies, with specific focus on workforce planning, organization capability, leadership talent management to help grow the business. Leader, India HR Operations Cisco Systems May 2010  –  October 2012  (2 years 6 months) Bangalore Led a team of senior Client Facing HR Professionals to support various Business groups at Cisco India for an employee base that grew from 6000 to 9000+ in this tenure. Represented HR on the Cisco India Operations Board. Sr Manager - Human Resources Cisco Systems March 2008  –  January 2011  (2 years 11 months) Client Facing HR Partner for diverse set of business groups at Cisco Regional HR Strategic Programs Manager Intel Corporation July 2007  –  February 2008  (8 months) Managed several Strategic HR Programs across Intel Asia, including: \nIntel Asia Leadership Development \nIntel HR Leadership Conference in Shanghai HR Manager Intel Corporation June 2003  –  June 2007  (4 years 1 month) Worked as HR Partner leading Human Resources strategies for diverse business groups. Led multiple programs and projects across Intel India. HR Manager Hughes Software Systems September 2000  –  June 2003  (2 years 10 months) Head of HR for the Bangalore Development Centre of Hughes Software, later known as Aricent/ Flextronics Head HR for Microland Ltd and Planetasia.com Microland Group November 1997  –  October 2000  (3 years) Head HR for Microland Ltd and Planetasia.com Took on significant leadership responsibilities very early in my career, in a highly fast paced startup environment Director and Head of Human Resources, Cisco India and SAARC Cisco January 2014  – Present (1 year 8 months) Bengaluru Area, India I feel very privileged to Partner with highly innovative and visionary business leaders that are completely re-imagining the business and driving impact out of Cisco India, for India as a country and for Cisco worldwide! Director and Head of Human Resources, Cisco India and SAARC Cisco January 2014  – Present (1 year 8 months) Bengaluru Area, India I feel very privileged to Partner with highly innovative and visionary business leaders that are completely re-imagining the business and driving impact out of Cisco India, for India as a country and for Cisco worldwide! Director - Human Resources Cisco Systems October 2012  – Present (2 years 11 months) Bangalore HR Partner for Cisco Services and Industry Solutions Groups across AsiaPac, Japan and China.  \nI enable business entities with combined revenue of over $2 Billion.  \nBuild integrated Talent and People Strategies, with specific focus on workforce planning, organization capability, leadership talent management to help grow the business. Director - Human Resources Cisco Systems October 2012  – Present (2 years 11 months) Bangalore HR Partner for Cisco Services and Industry Solutions Groups across AsiaPac, Japan and China.  \nI enable business entities with combined revenue of over $2 Billion.  \nBuild integrated Talent and People Strategies, with specific focus on workforce planning, organization capability, leadership talent management to help grow the business. Leader, India HR Operations Cisco Systems May 2010  –  October 2012  (2 years 6 months) Bangalore Led a team of senior Client Facing HR Professionals to support various Business groups at Cisco India for an employee base that grew from 6000 to 9000+ in this tenure. Represented HR on the Cisco India Operations Board. Leader, India HR Operations Cisco Systems May 2010  –  October 2012  (2 years 6 months) Bangalore Led a team of senior Client Facing HR Professionals to support various Business groups at Cisco India for an employee base that grew from 6000 to 9000+ in this tenure. Represented HR on the Cisco India Operations Board. Sr Manager - Human Resources Cisco Systems March 2008  –  January 2011  (2 years 11 months) Client Facing HR Partner for diverse set of business groups at Cisco Sr Manager - Human Resources Cisco Systems March 2008  –  January 2011  (2 years 11 months) Client Facing HR Partner for diverse set of business groups at Cisco Regional HR Strategic Programs Manager Intel Corporation July 2007  –  February 2008  (8 months) Managed several Strategic HR Programs across Intel Asia, including: \nIntel Asia Leadership Development \nIntel HR Leadership Conference in Shanghai Regional HR Strategic Programs Manager Intel Corporation July 2007  –  February 2008  (8 months) Managed several Strategic HR Programs across Intel Asia, including: \nIntel Asia Leadership Development \nIntel HR Leadership Conference in Shanghai HR Manager Intel Corporation June 2003  –  June 2007  (4 years 1 month) Worked as HR Partner leading Human Resources strategies for diverse business groups. Led multiple programs and projects across Intel India. HR Manager Intel Corporation June 2003  –  June 2007  (4 years 1 month) Worked as HR Partner leading Human Resources strategies for diverse business groups. Led multiple programs and projects across Intel India. HR Manager Hughes Software Systems September 2000  –  June 2003  (2 years 10 months) Head of HR for the Bangalore Development Centre of Hughes Software, later known as Aricent/ Flextronics HR Manager Hughes Software Systems September 2000  –  June 2003  (2 years 10 months) Head of HR for the Bangalore Development Centre of Hughes Software, later known as Aricent/ Flextronics Head HR for Microland Ltd and Planetasia.com Microland Group November 1997  –  October 2000  (3 years) Head HR for Microland Ltd and Planetasia.com Took on significant leadership responsibilities very early in my career, in a highly fast paced startup environment Head HR for Microland Ltd and Planetasia.com Microland Group November 1997  –  October 2000  (3 years) Head HR for Microland Ltd and Planetasia.com Took on significant leadership responsibilities very early in my career, in a highly fast paced startup environment Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Marathi Native or bilingual proficiency Konkani Limited working proficiency Malayalam Elementary proficiency Gujarati Elementary proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Marathi Native or bilingual proficiency Konkani Limited working proficiency Malayalam Elementary proficiency Gujarati Elementary proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Marathi Native or bilingual proficiency Konkani Limited working proficiency Malayalam Elementary proficiency Gujarati Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Elementary proficiency Skills Talent Management Leadership Development Performance Management Strategic HR Organizational... Employee Engagement Talent Acquisition Human Resources Deferred Compensation Workforce Planning Program Management Personnel Management Leadership Management Skills  Talent Management Leadership Development Performance Management Strategic HR Organizational... Employee Engagement Talent Acquisition Human Resources Deferred Compensation Workforce Planning Program Management Personnel Management Leadership Management Talent Management Leadership Development Performance Management Strategic HR Organizational... Employee Engagement Talent Acquisition Human Resources Deferred Compensation Workforce Planning Program Management Personnel Management Leadership Management Talent Management Leadership Development Performance Management Strategic HR Organizational... Employee Engagement Talent Acquisition Human Resources Deferred Compensation Workforce Planning Program Management Personnel Management Leadership Management Education XLRI Jamshedpur MBA,  Human Resources 1992  – 1994 Poona University Bachelors Degree,  Commerce 1988  – 1991 XLRI Jamshedpur MBA,  Human Resources 1992  – 1994 XLRI Jamshedpur MBA,  Human Resources 1992  – 1994 XLRI Jamshedpur MBA,  Human Resources 1992  – 1994 Poona University Bachelors Degree,  Commerce 1988  – 1991 Poona University Bachelors Degree,  Commerce 1988  – 1991 Poona University Bachelors Degree,  Commerce 1988  – 1991 ", "Summary Career Counselor and Executive Coach. Experienced in improving organizational effectiveness through increased employee engagement. I understand the business and what motivates leaders and teams to achieve stretch goals. Specific expertise in leading engineers in a matrixed and global environment. \n \nAssessment Expertise: CLEAD 360 Certified Facilitator, Myers-Briggs Type Indicator (MBTI), FIRO, Strong Interest Inventory, CPI, EQ-i 2.0 and EQ 360 Certified Summary Career Counselor and Executive Coach. Experienced in improving organizational effectiveness through increased employee engagement. I understand the business and what motivates leaders and teams to achieve stretch goals. Specific expertise in leading engineers in a matrixed and global environment. \n \nAssessment Expertise: CLEAD 360 Certified Facilitator, Myers-Briggs Type Indicator (MBTI), FIRO, Strong Interest Inventory, CPI, EQ-i 2.0 and EQ 360 Certified Career Counselor and Executive Coach. Experienced in improving organizational effectiveness through increased employee engagement. I understand the business and what motivates leaders and teams to achieve stretch goals. Specific expertise in leading engineers in a matrixed and global environment. \n \nAssessment Expertise: CLEAD 360 Certified Facilitator, Myers-Briggs Type Indicator (MBTI), FIRO, Strong Interest Inventory, CPI, EQ-i 2.0 and EQ 360 Certified Career Counselor and Executive Coach. Experienced in improving organizational effectiveness through increased employee engagement. I understand the business and what motivates leaders and teams to achieve stretch goals. Specific expertise in leading engineers in a matrixed and global environment. \n \nAssessment Expertise: CLEAD 360 Certified Facilitator, Myers-Briggs Type Indicator (MBTI), FIRO, Strong Interest Inventory, CPI, EQ-i 2.0 and EQ 360 Certified Experience Owner, Career Counselor Career Catalyst August 2014  – Present (1 year 1 month) Raleigh, NC My goal is to help clients find more fulfillment at work and in life. We work together to find your unique strengths and interests, put a plan in place to do more of what you enjoy, and then create a path to get there. If you are interested in exploring next steps in your career, visit career-catalyst.org Learning and Development Manager Cisco April 2014  – Present (1 year 5 months) Led Leadership Development initiatives for the Americas region, covering 5,000 cross-functional leaders \nCreated and launched Cisco’s Career Advisory program, providing services to 47,000 employees in the Americas \nTrained and managed the performance of 25 industry-certified career coaches \nProvided career advising to 500 individuals in the first two quarters of operation \nDeveloped a manager as a coach center of excellence, increasing engagement and productivity through targeted skills development \nDelivered manager and director career development workshops across the Americas, improving leadership coaching fundamentals Director, Human Resources Cisco Systems October 2012  –  April 2014  (1 year 7 months) Research Triangle Park, NC Created a 5-part career development video series presented to 14,000 global services employees \nCreated an organizational alignment program for a 250-person business unit \nConducted return on investment (ROI) analysis for organizational alignment program; presented findings to executive audience, leading to a brand new position/role in the company \nScaled internal organizational alignment program to include executive coaching, group development sessions, one on one career counseling, train-the-trainer to enlist other coaches, and self service materials available to all employees; results include improving employee engagement by 13% in one quarter Career Services, Career Counselor Intern North Carolina Central University 2013  –  2013  (less than a year) Durham, NC Provided one on one career counseling to 500+ students and 25 alumni \nPerformed career assessments with students of all ages and majors \nConducted mock interviews, resume bootcamp events, and employee relations activities \nLaunched an entrepreneurial discussion panel to educate students on small business ownership \nCreated and delivered globalization workshop to increase interest in studying abroad Director, Contact Center Operations Cisco Systems 2006  –  2012  (6 years) Research Triangle Park, NC Led 500-employee Global Contact Center, delivering 800,000 multi-channel interactions per quarter \nShaped a Talent Development strategy, including the Talent for Tomorrow program which created career paths and a talent plan for the organization \nMentored Cisco Intensive Leadership Program participants \nInitiated Skill Group Optimization project, a process improvement program that yielded significant operational savings  \nLed the Smart Interactions project to introduce social media to the contact center, a “Cisco on Cisco” initiative to set the strategy for Cisco’s social media presence in Technical Services \nChaired the Employee Focus Team, RTP Talent Movement team, and Manager Development track Senior Manager, Cisco Services Cisco 2005  –  2006  (1 year) Research Triangle Park, NC Spearheaded key multi-year, cross-functional initiative to optimize and create consistency in global technical support delivery \nCreated best practice sharing relationships with Cisco’s peers and partners to enhance working relationships as well as adopt industry best practices in technical services \nImplemented improved shift model for the global technical assistance center to improve customer satisfaction by reducing unnecessary support case handoffs \nFacilitated internal best practice sharing sessions across theatres and technology groups to standardize technical support globally \nSelected for Cisco Intensive Leadership Program Manager, Cisco Services Cisco 1999  –  2006  (7 years) Research Triangle Park, NC Created new global staffing plan to address priority issues; decreasing time to initial response for new service requests \nServed as business sponsor and mentor for Cisco’s first annual RTP campus-wide career fair \nLed Cisco’s post sales technical support teams for Enterprise Voice and Core Architecture \nHired 25+ Cisco Certified Internetworking Engineers (CCIE) \nSuccessfully launched the Customer Relationship Manager program's East Coast presence \nSelected for Cisco Emerging Leader Program (EMLP) Specialist, Cisco Services Cisco 1996  –  1999  (3 years) Research Triangle Park, NC Provided superior customer support and built a strong team \nPromoted to Customer Response Center team lead position within 6 months  \nInterviewed and hired 17-person world class contact center team Helpdesk Technician Venator Corporation 1995  –  1996  (1 year) Camp Hill, PA Provided remote technical support to retail stores in Quebec, Canada, performed entirely in French \nLearned troubleshooting skills on the job Owner, Career Counselor Career Catalyst August 2014  – Present (1 year 1 month) Raleigh, NC My goal is to help clients find more fulfillment at work and in life. We work together to find your unique strengths and interests, put a plan in place to do more of what you enjoy, and then create a path to get there. If you are interested in exploring next steps in your career, visit career-catalyst.org Owner, Career Counselor Career Catalyst August 2014  – Present (1 year 1 month) Raleigh, NC My goal is to help clients find more fulfillment at work and in life. We work together to find your unique strengths and interests, put a plan in place to do more of what you enjoy, and then create a path to get there. If you are interested in exploring next steps in your career, visit career-catalyst.org Learning and Development Manager Cisco April 2014  – Present (1 year 5 months) Led Leadership Development initiatives for the Americas region, covering 5,000 cross-functional leaders \nCreated and launched Cisco’s Career Advisory program, providing services to 47,000 employees in the Americas \nTrained and managed the performance of 25 industry-certified career coaches \nProvided career advising to 500 individuals in the first two quarters of operation \nDeveloped a manager as a coach center of excellence, increasing engagement and productivity through targeted skills development \nDelivered manager and director career development workshops across the Americas, improving leadership coaching fundamentals Learning and Development Manager Cisco April 2014  – Present (1 year 5 months) Led Leadership Development initiatives for the Americas region, covering 5,000 cross-functional leaders \nCreated and launched Cisco’s Career Advisory program, providing services to 47,000 employees in the Americas \nTrained and managed the performance of 25 industry-certified career coaches \nProvided career advising to 500 individuals in the first two quarters of operation \nDeveloped a manager as a coach center of excellence, increasing engagement and productivity through targeted skills development \nDelivered manager and director career development workshops across the Americas, improving leadership coaching fundamentals Director, Human Resources Cisco Systems October 2012  –  April 2014  (1 year 7 months) Research Triangle Park, NC Created a 5-part career development video series presented to 14,000 global services employees \nCreated an organizational alignment program for a 250-person business unit \nConducted return on investment (ROI) analysis for organizational alignment program; presented findings to executive audience, leading to a brand new position/role in the company \nScaled internal organizational alignment program to include executive coaching, group development sessions, one on one career counseling, train-the-trainer to enlist other coaches, and self service materials available to all employees; results include improving employee engagement by 13% in one quarter Director, Human Resources Cisco Systems October 2012  –  April 2014  (1 year 7 months) Research Triangle Park, NC Created a 5-part career development video series presented to 14,000 global services employees \nCreated an organizational alignment program for a 250-person business unit \nConducted return on investment (ROI) analysis for organizational alignment program; presented findings to executive audience, leading to a brand new position/role in the company \nScaled internal organizational alignment program to include executive coaching, group development sessions, one on one career counseling, train-the-trainer to enlist other coaches, and self service materials available to all employees; results include improving employee engagement by 13% in one quarter Career Services, Career Counselor Intern North Carolina Central University 2013  –  2013  (less than a year) Durham, NC Provided one on one career counseling to 500+ students and 25 alumni \nPerformed career assessments with students of all ages and majors \nConducted mock interviews, resume bootcamp events, and employee relations activities \nLaunched an entrepreneurial discussion panel to educate students on small business ownership \nCreated and delivered globalization workshop to increase interest in studying abroad Career Services, Career Counselor Intern North Carolina Central University 2013  –  2013  (less than a year) Durham, NC Provided one on one career counseling to 500+ students and 25 alumni \nPerformed career assessments with students of all ages and majors \nConducted mock interviews, resume bootcamp events, and employee relations activities \nLaunched an entrepreneurial discussion panel to educate students on small business ownership \nCreated and delivered globalization workshop to increase interest in studying abroad Director, Contact Center Operations Cisco Systems 2006  –  2012  (6 years) Research Triangle Park, NC Led 500-employee Global Contact Center, delivering 800,000 multi-channel interactions per quarter \nShaped a Talent Development strategy, including the Talent for Tomorrow program which created career paths and a talent plan for the organization \nMentored Cisco Intensive Leadership Program participants \nInitiated Skill Group Optimization project, a process improvement program that yielded significant operational savings  \nLed the Smart Interactions project to introduce social media to the contact center, a “Cisco on Cisco” initiative to set the strategy for Cisco’s social media presence in Technical Services \nChaired the Employee Focus Team, RTP Talent Movement team, and Manager Development track Director, Contact Center Operations Cisco Systems 2006  –  2012  (6 years) Research Triangle Park, NC Led 500-employee Global Contact Center, delivering 800,000 multi-channel interactions per quarter \nShaped a Talent Development strategy, including the Talent for Tomorrow program which created career paths and a talent plan for the organization \nMentored Cisco Intensive Leadership Program participants \nInitiated Skill Group Optimization project, a process improvement program that yielded significant operational savings  \nLed the Smart Interactions project to introduce social media to the contact center, a “Cisco on Cisco” initiative to set the strategy for Cisco’s social media presence in Technical Services \nChaired the Employee Focus Team, RTP Talent Movement team, and Manager Development track Senior Manager, Cisco Services Cisco 2005  –  2006  (1 year) Research Triangle Park, NC Spearheaded key multi-year, cross-functional initiative to optimize and create consistency in global technical support delivery \nCreated best practice sharing relationships with Cisco’s peers and partners to enhance working relationships as well as adopt industry best practices in technical services \nImplemented improved shift model for the global technical assistance center to improve customer satisfaction by reducing unnecessary support case handoffs \nFacilitated internal best practice sharing sessions across theatres and technology groups to standardize technical support globally \nSelected for Cisco Intensive Leadership Program Senior Manager, Cisco Services Cisco 2005  –  2006  (1 year) Research Triangle Park, NC Spearheaded key multi-year, cross-functional initiative to optimize and create consistency in global technical support delivery \nCreated best practice sharing relationships with Cisco’s peers and partners to enhance working relationships as well as adopt industry best practices in technical services \nImplemented improved shift model for the global technical assistance center to improve customer satisfaction by reducing unnecessary support case handoffs \nFacilitated internal best practice sharing sessions across theatres and technology groups to standardize technical support globally \nSelected for Cisco Intensive Leadership Program Manager, Cisco Services Cisco 1999  –  2006  (7 years) Research Triangle Park, NC Created new global staffing plan to address priority issues; decreasing time to initial response for new service requests \nServed as business sponsor and mentor for Cisco’s first annual RTP campus-wide career fair \nLed Cisco’s post sales technical support teams for Enterprise Voice and Core Architecture \nHired 25+ Cisco Certified Internetworking Engineers (CCIE) \nSuccessfully launched the Customer Relationship Manager program's East Coast presence \nSelected for Cisco Emerging Leader Program (EMLP) Manager, Cisco Services Cisco 1999  –  2006  (7 years) Research Triangle Park, NC Created new global staffing plan to address priority issues; decreasing time to initial response for new service requests \nServed as business sponsor and mentor for Cisco’s first annual RTP campus-wide career fair \nLed Cisco’s post sales technical support teams for Enterprise Voice and Core Architecture \nHired 25+ Cisco Certified Internetworking Engineers (CCIE) \nSuccessfully launched the Customer Relationship Manager program's East Coast presence \nSelected for Cisco Emerging Leader Program (EMLP) Specialist, Cisco Services Cisco 1996  –  1999  (3 years) Research Triangle Park, NC Provided superior customer support and built a strong team \nPromoted to Customer Response Center team lead position within 6 months  \nInterviewed and hired 17-person world class contact center team Specialist, Cisco Services Cisco 1996  –  1999  (3 years) Research Triangle Park, NC Provided superior customer support and built a strong team \nPromoted to Customer Response Center team lead position within 6 months  \nInterviewed and hired 17-person world class contact center team Helpdesk Technician Venator Corporation 1995  –  1996  (1 year) Camp Hill, PA Provided remote technical support to retail stores in Quebec, Canada, performed entirely in French \nLearned troubleshooting skills on the job Helpdesk Technician Venator Corporation 1995  –  1996  (1 year) Camp Hill, PA Provided remote technical support to retail stores in Quebec, Canada, performed entirely in French \nLearned troubleshooting skills on the job Languages French French French Skills Cross-functional Team... Vendor Management Customer Experience Change Management Team Leadership Team Building Contact Centers Call Center Product Management Leadership Employee Engagement Training Talent Management Management Operations Management Account Management Business Process... Management Consulting Business Strategy Cisco Technologies P&L Management Performance Management Business Development Business Analysis Quality Assurance Unified Communications Customer Service Strategic Partnerships Customer Retention Professional Services Go-to-market Strategy Strategic Planning Coaching Leadership Development Business Transformation Project Planning Thought Leadership Strategy Recruiting Executive Management Customer Satisfaction Career Counseling Call Centers SaaS See 29+     See less Skills  Cross-functional Team... Vendor Management Customer Experience Change Management Team Leadership Team Building Contact Centers Call Center Product Management Leadership Employee Engagement Training Talent Management Management Operations Management Account Management Business Process... Management Consulting Business Strategy Cisco Technologies P&L Management Performance Management Business Development Business Analysis Quality Assurance Unified Communications Customer Service Strategic Partnerships Customer Retention Professional Services Go-to-market Strategy Strategic Planning Coaching Leadership Development Business Transformation Project Planning Thought Leadership Strategy Recruiting Executive Management Customer Satisfaction Career Counseling Call Centers SaaS See 29+     See less Cross-functional Team... Vendor Management Customer Experience Change Management Team Leadership Team Building Contact Centers Call Center Product Management Leadership Employee Engagement Training Talent Management Management Operations Management Account Management Business Process... Management Consulting Business Strategy Cisco Technologies P&L Management Performance Management Business Development Business Analysis Quality Assurance Unified Communications Customer Service Strategic Partnerships Customer Retention Professional Services Go-to-market Strategy Strategic Planning Coaching Leadership Development Business Transformation Project Planning Thought Leadership Strategy Recruiting Executive Management Customer Satisfaction Career Counseling Call Centers SaaS See 29+     See less Cross-functional Team... Vendor Management Customer Experience Change Management Team Leadership Team Building Contact Centers Call Center Product Management Leadership Employee Engagement Training Talent Management Management Operations Management Account Management Business Process... Management Consulting Business Strategy Cisco Technologies P&L Management Performance Management Business Development Business Analysis Quality Assurance Unified Communications Customer Service Strategic Partnerships Customer Retention Professional Services Go-to-market Strategy Strategic Planning Coaching Leadership Development Business Transformation Project Planning Thought Leadership Strategy Recruiting Executive Management Customer Satisfaction Career Counseling Call Centers SaaS See 29+     See less Education North Carolina Central University Master of Arts (M.A.),  Career Counseling and Placement , 4.0 2011  – 2013 Activities and Societies:  Chi Sigma Iota Villanova University Masters Certificate,  Strategic Organizational Leadership 2009  – 2010 Strayer University MBA,  Business Management 2003  – 2005 Dickinson College Bachelor of Arts (B.A.),  French Language and Literature North Carolina Central University Master of Arts (M.A.),  Career Counseling and Placement , 4.0 2011  – 2013 Activities and Societies:  Chi Sigma Iota North Carolina Central University Master of Arts (M.A.),  Career Counseling and Placement , 4.0 2011  – 2013 Activities and Societies:  Chi Sigma Iota North Carolina Central University Master of Arts (M.A.),  Career Counseling and Placement , 4.0 2011  – 2013 Activities and Societies:  Chi Sigma Iota Villanova University Masters Certificate,  Strategic Organizational Leadership 2009  – 2010 Villanova University Masters Certificate,  Strategic Organizational Leadership 2009  – 2010 Villanova University Masters Certificate,  Strategic Organizational Leadership 2009  – 2010 Strayer University MBA,  Business Management 2003  – 2005 Strayer University MBA,  Business Management 2003  – 2005 Strayer University MBA,  Business Management 2003  – 2005 Dickinson College Bachelor of Arts (B.A.),  French Language and Literature Dickinson College Bachelor of Arts (B.A.),  French Language and Literature Dickinson College Bachelor of Arts (B.A.),  French Language and Literature Honors & Awards NCC, National Certified Counselor National Board for Certified Counselors January 2014 LPCa, Licensed Professional Counselor Associate North Carolina Board of Professional Licensed Counselors July 2014 BCC, Board Certified Coach National Board of Certified Counselors July 2015 NCC, National Certified Counselor National Board for Certified Counselors January 2014 NCC, National Certified Counselor National Board for Certified Counselors January 2014 NCC, National Certified Counselor National Board for Certified Counselors January 2014 LPCa, Licensed Professional Counselor Associate North Carolina Board of Professional Licensed Counselors July 2014 LPCa, Licensed Professional Counselor Associate North Carolina Board of Professional Licensed Counselors July 2014 LPCa, Licensed Professional Counselor Associate North Carolina Board of Professional Licensed Counselors July 2014 BCC, Board Certified Coach National Board of Certified Counselors July 2015 BCC, Board Certified Coach National Board of Certified Counselors July 2015 BCC, Board Certified Coach National Board of Certified Counselors July 2015 ", "Skills Organizational... Mergers Strategic Planning Corporate Development Program Development Employee Relations Talent Management Employee Engagement Talent Acquisition Start-ups Program Management Executive Coaching Organizational... Change Management Compensation & Benefit Acquisition Integration Coaching Human Resources Mergers & Acquisitions See 4+     See less Skills  Organizational... Mergers Strategic Planning Corporate Development Program Development Employee Relations Talent Management Employee Engagement Talent Acquisition Start-ups Program Management Executive Coaching Organizational... Change Management Compensation & Benefit Acquisition Integration Coaching Human Resources Mergers & Acquisitions See 4+     See less Organizational... Mergers Strategic Planning Corporate Development Program Development Employee Relations Talent Management Employee Engagement Talent Acquisition Start-ups Program Management Executive Coaching Organizational... Change Management Compensation & Benefit Acquisition Integration Coaching Human Resources Mergers & Acquisitions See 4+     See less Organizational... Mergers Strategic Planning Corporate Development Program Development Employee Relations Talent Management Employee Engagement Talent Acquisition Start-ups Program Management Executive Coaching Organizational... Change Management Compensation & Benefit Acquisition Integration Coaching Human Resources Mergers & Acquisitions See 4+     See less ", "Skills Organizational... Human Resources Talent Acquisition Workforce Planning Talent Management Employee Relations Succession Planning Performance Management Employee Engagement Organizational Design Organizational... Recruiting Change Management Employer Branding Skills  Organizational... Human Resources Talent Acquisition Workforce Planning Talent Management Employee Relations Succession Planning Performance Management Employee Engagement Organizational Design Organizational... Recruiting Change Management Employer Branding Organizational... Human Resources Talent Acquisition Workforce Planning Talent Management Employee Relations Succession Planning Performance Management Employee Engagement Organizational Design Organizational... Recruiting Change Management Employer Branding Organizational... Human Resources Talent Acquisition Workforce Planning Talent Management Employee Relations Succession Planning Performance Management Employee Engagement Organizational Design Organizational... Recruiting Change Management Employer Branding ", "Experience Vice President of Human Resources Cisco October 2014  – Present (11 months) San Francisco Bay Area Sr. Director, Human Resources Cisco Systems April 2011  –  October 2014  (3 years 7 months) San Jose, CA Director, Human Resources Cisco Systems December 2005  –  April 2011  (5 years 5 months) San Jose, CA Manager, Human Resources Cisco Systems 2003  –  2005  (2 years) San Jose, CA Director, Human Resources PerkinElmer Optoelectronics 2000  –  2003  (3 years) Manager, Human Resources GE Capital 1998  –  2000  (2 years) Human Resources Manager ABB Inc. 1990  –  1998  (8 years) Vice President of Human Resources Cisco October 2014  – Present (11 months) San Francisco Bay Area Vice President of Human Resources Cisco October 2014  – Present (11 months) San Francisco Bay Area Sr. Director, Human Resources Cisco Systems April 2011  –  October 2014  (3 years 7 months) San Jose, CA Sr. Director, Human Resources Cisco Systems April 2011  –  October 2014  (3 years 7 months) San Jose, CA Director, Human Resources Cisco Systems December 2005  –  April 2011  (5 years 5 months) San Jose, CA Director, Human Resources Cisco Systems December 2005  –  April 2011  (5 years 5 months) San Jose, CA Manager, Human Resources Cisco Systems 2003  –  2005  (2 years) San Jose, CA Manager, Human Resources Cisco Systems 2003  –  2005  (2 years) San Jose, CA Director, Human Resources PerkinElmer Optoelectronics 2000  –  2003  (3 years) Director, Human Resources PerkinElmer Optoelectronics 2000  –  2003  (3 years) Manager, Human Resources GE Capital 1998  –  2000  (2 years) Manager, Human Resources GE Capital 1998  –  2000  (2 years) Human Resources Manager ABB Inc. 1990  –  1998  (8 years) Human Resources Manager ABB Inc. 1990  –  1998  (8 years) Skills Talent Management Talent Acquisition Leadership Development Onboarding Applicant Tracking... Employee Relations Employee Engagement Organizational... Human Resources Recruiting Sourcing Deferred Compensation Succession Planning College Recruiting Program Management Skills  Talent Management Talent Acquisition Leadership Development Onboarding Applicant Tracking... Employee Relations Employee Engagement Organizational... Human Resources Recruiting Sourcing Deferred Compensation Succession Planning College Recruiting Program Management Talent Management Talent Acquisition Leadership Development Onboarding Applicant Tracking... Employee Relations Employee Engagement Organizational... Human Resources Recruiting Sourcing Deferred Compensation Succession Planning College Recruiting Program Management Talent Management Talent Acquisition Leadership Development Onboarding Applicant Tracking... Employee Relations Employee Engagement Organizational... Human Resources Recruiting Sourcing Deferred Compensation Succession Planning College Recruiting Program Management Education St. Lawrence University BS 1987  – 1990 St. Lawrence University BS 1987  – 1990 St. Lawrence University BS 1987  – 1990 St. Lawrence University BS 1987  – 1990 ", "Summary As an executive business partner in the Silicon Valley, I understand all the buzzwords… leading change, transformation, innovation. I understand because I’ve been intimately involved as an executive coach and strategic partner for Cisco during a period of explosive growth and change.  \n \nI've been given the opportunity to be a catalyst and leader for real, sustainable change in a constantly evolving environment. The tech world in the Valley is as ambiguous as it is exciting, and I have dynamic and proven experience. Simply put, I deliver. \n \nMy ability to understand business-unit level goals and organizational priorities, then have challenging discussions with executive leadership, is what sets me apart from HR professionals who manage benefits and processes.  \n \nI’ve developed a reputation as the go-to resource for solving complex problems, and typically get handed the long-standing, complex and “unsolvable” problems to sort out.  \n \nHIGHLIGHTS \n► Centralized reporting, management, and financial processes for 220+ global staffing vendors to deliver a dramatically lower cost of hiring. \n► Established criteria for managing 6,000+ non W-2 work providers and tax and co-employment liability. \n► Slashed immigration team headcount by 50% and leveraged strategy and procedure to create a world-class talent pool while managing compliance for 7000 H1 employees. \n► Selected as principal change management and internal communications strategist for Project Hercules, a global compensation, talent management, and recruitment initiative.  \n► Recruited to lead organizational effectiveness by Customer Operations executives, and delivered a $4M reduction in operating expenses \n► Built an integrated business plan that effectively operationalized Operations-as-a-Service. \n \nSPECIALTIES \nEnterprise Project Management • 1099/Immigration Compliance • Domestic/Global Relocation & Mobility • Organizational Planning • Talent Management & Succession Planning •Business Process Reengineering Summary As an executive business partner in the Silicon Valley, I understand all the buzzwords… leading change, transformation, innovation. I understand because I’ve been intimately involved as an executive coach and strategic partner for Cisco during a period of explosive growth and change.  \n \nI've been given the opportunity to be a catalyst and leader for real, sustainable change in a constantly evolving environment. The tech world in the Valley is as ambiguous as it is exciting, and I have dynamic and proven experience. Simply put, I deliver. \n \nMy ability to understand business-unit level goals and organizational priorities, then have challenging discussions with executive leadership, is what sets me apart from HR professionals who manage benefits and processes.  \n \nI’ve developed a reputation as the go-to resource for solving complex problems, and typically get handed the long-standing, complex and “unsolvable” problems to sort out.  \n \nHIGHLIGHTS \n► Centralized reporting, management, and financial processes for 220+ global staffing vendors to deliver a dramatically lower cost of hiring. \n► Established criteria for managing 6,000+ non W-2 work providers and tax and co-employment liability. \n► Slashed immigration team headcount by 50% and leveraged strategy and procedure to create a world-class talent pool while managing compliance for 7000 H1 employees. \n► Selected as principal change management and internal communications strategist for Project Hercules, a global compensation, talent management, and recruitment initiative.  \n► Recruited to lead organizational effectiveness by Customer Operations executives, and delivered a $4M reduction in operating expenses \n► Built an integrated business plan that effectively operationalized Operations-as-a-Service. \n \nSPECIALTIES \nEnterprise Project Management • 1099/Immigration Compliance • Domestic/Global Relocation & Mobility • Organizational Planning • Talent Management & Succession Planning •Business Process Reengineering As an executive business partner in the Silicon Valley, I understand all the buzzwords… leading change, transformation, innovation. I understand because I’ve been intimately involved as an executive coach and strategic partner for Cisco during a period of explosive growth and change.  \n \nI've been given the opportunity to be a catalyst and leader for real, sustainable change in a constantly evolving environment. The tech world in the Valley is as ambiguous as it is exciting, and I have dynamic and proven experience. Simply put, I deliver. \n \nMy ability to understand business-unit level goals and organizational priorities, then have challenging discussions with executive leadership, is what sets me apart from HR professionals who manage benefits and processes.  \n \nI’ve developed a reputation as the go-to resource for solving complex problems, and typically get handed the long-standing, complex and “unsolvable” problems to sort out.  \n \nHIGHLIGHTS \n► Centralized reporting, management, and financial processes for 220+ global staffing vendors to deliver a dramatically lower cost of hiring. \n► Established criteria for managing 6,000+ non W-2 work providers and tax and co-employment liability. \n► Slashed immigration team headcount by 50% and leveraged strategy and procedure to create a world-class talent pool while managing compliance for 7000 H1 employees. \n► Selected as principal change management and internal communications strategist for Project Hercules, a global compensation, talent management, and recruitment initiative.  \n► Recruited to lead organizational effectiveness by Customer Operations executives, and delivered a $4M reduction in operating expenses \n► Built an integrated business plan that effectively operationalized Operations-as-a-Service. \n \nSPECIALTIES \nEnterprise Project Management • 1099/Immigration Compliance • Domestic/Global Relocation & Mobility • Organizational Planning • Talent Management & Succession Planning •Business Process Reengineering As an executive business partner in the Silicon Valley, I understand all the buzzwords… leading change, transformation, innovation. I understand because I’ve been intimately involved as an executive coach and strategic partner for Cisco during a period of explosive growth and change.  \n \nI've been given the opportunity to be a catalyst and leader for real, sustainable change in a constantly evolving environment. The tech world in the Valley is as ambiguous as it is exciting, and I have dynamic and proven experience. Simply put, I deliver. \n \nMy ability to understand business-unit level goals and organizational priorities, then have challenging discussions with executive leadership, is what sets me apart from HR professionals who manage benefits and processes.  \n \nI’ve developed a reputation as the go-to resource for solving complex problems, and typically get handed the long-standing, complex and “unsolvable” problems to sort out.  \n \nHIGHLIGHTS \n► Centralized reporting, management, and financial processes for 220+ global staffing vendors to deliver a dramatically lower cost of hiring. \n► Established criteria for managing 6,000+ non W-2 work providers and tax and co-employment liability. \n► Slashed immigration team headcount by 50% and leveraged strategy and procedure to create a world-class talent pool while managing compliance for 7000 H1 employees. \n► Selected as principal change management and internal communications strategist for Project Hercules, a global compensation, talent management, and recruitment initiative.  \n► Recruited to lead organizational effectiveness by Customer Operations executives, and delivered a $4M reduction in operating expenses \n► Built an integrated business plan that effectively operationalized Operations-as-a-Service. \n \nSPECIALTIES \nEnterprise Project Management • 1099/Immigration Compliance • Domestic/Global Relocation & Mobility • Organizational Planning • Talent Management & Succession Planning •Business Process Reengineering Experience Human Resources Executive Coaching, Change Management, Human Resources Process Optimization Human Resources Consultant October 2012  – Present (2 years 11 months) Silicon Valley Consult with executive leadership in design, development, and management of integrated HR systems, and leverage an extensive professional network to recommend and refer outsourced administration providers. \n \n► Initiate and facilitate complex discussions in small to medium sized businesses (SMB) with up to 3000 employees; assist C-Level management in in understanding and differentiating their value to attract and retain top talent. \n \n► Cultivate long-term vision and strategic operational planning to define goals and metrics for continued success. \n \n► Train executives on managing change to remain relevant in the competitive and constantly evolving Silicon Valley tech landscape. \n \nSpecialties: Change Management | Human Resources Leadership | Business Process Optimization \nOrganizational Planning Director, Shared Service Governance Office / Executive Coaching & Human Resources Operations Cisco Systems August 2010  – Present (5 years 1 month) Performance Management, Business Process Outsourcing, Strategic Planning Led strategy and planning in the service governance office as the right hand to business unit leadership. Successfully optimized performance and managed risk for nine service categories across all non-business process outsourcing (BPO) vendors. \n \n► Established disaster recovery and business continuity framework as part of an initiative sanctioned by the global CEO. \n \n► Built an integrated business plan that increased cost visibility and accountability by designing and operationalizing Operations-as-a-Service. \n \nSpecialties: Human Resources Operations | Business Continuity & Succession Planning | Executive Leadership Director, Customer Operations / Human Resources & Organizational Effectivness Cisco Systems March 2007  –  July 2010  (3 years 5 months) Change Management, Stakeholder Engagement, Operations & Resource Management Recruited by business unit leadership to steer organizational effectiveness planning for the Customer Operations group as the acting Chief Information Officer and executive board representative. Established the first-ever Operations Policy review board and developed governance and long-range financial planning metrics for all quote to cash and returns processes. \n \n► Delivered a potential $4M operating expense budget reduction after only one quarter in the role by restructuring approvals and review processes. \n \n► Improved resource utilization and reduced redundancy in work cycles with a complete overhaul of front-end engagement models in global customer operations. \n \n► Orchestrated change management platform and tactics from stakeholder analysis and engagement planning through impact assessments. \n \n► Co-developed a next-generation, enterprise-wide change leadership framework, and personally contributed curriculum content/structure and socialization plans. \n \n► Executed business unit level organizational design tactics for the Virtual Service Engine (VSE) at Cisco Systems, and both created and facilitated a four-day offsite program that successfully integrated the Customer Operations and Supply Chain Field Operations organizations. Director of Human Resources / Executive HR Business Partner, Executive Coaching Cisco Systems March 2004  –  March 2007  (3 years 1 month) Change Management, Organizational Planning, Talent Development Led change and transformation for several Vice Presidents with a +2,000-person client base comprised of team members from Corporate Quality, Information Technology, Customer Service, and Operations Business Planning/Strategy. \n \n► Selected as principal change management and internal communications strategist for Project Hercules. \n \n► Designed organizational assessments and created tools and benchmarks for multiple client organizations to drive long-term vision and strategic planning. \n \n► Piloted the Cisco Change Roadmap to create a Quote to Cash organization within six months; reorganized the employee base, created new job descriptions, and aligned managers and business leaders with best practices in hiring and interviewing to place over 70 new employees. Manager Human Resources / Change Management, Human Resources Project Management, HR Compliance Cisco Systems March 1998  –  March 2004  (6 years 1 month) Compliance, Immigration & Relocation, Global Staffing & 1099 Management Appointed as project lead for numerous complex, ambiguous, and business critical projects and processes, and created strategic, long-term solutions to achieve business goals and minimize compliance risk. \n \n► Centralized reporting, management, and financial processes for over 220 global staffing vendors; resulting procedures standardized margins and delivered a significantly lower cost of hiring. \n \n► Created processes and procedures to manage 1099 tax risk and co-employment liability for 6,000-plus non-W2 work providers, and partnered with purchasing/legal to define employment categories.  \n \n► Reduced immigration team headcount by 50% and developed strategy and procedure to create a world-class talent pool while managing compliance for up to 7000 H1 employees. \n \n► Formalized and streamlined expense reporting/reimbursements for domestic relocation, and eliminated waste and non-compliance. Business Development GE Capitol Consulting/PTC April 1997  –  February 1998  (11 months) Opportunity Creation, Recruitment/Talent Management, Project Management Sourced opportunities from cradle to grave, including recruitment of project teams and leads. Human Resources Executive Coaching, Change Management, Human Resources Process Optimization Human Resources Consultant October 2012  – Present (2 years 11 months) Silicon Valley Consult with executive leadership in design, development, and management of integrated HR systems, and leverage an extensive professional network to recommend and refer outsourced administration providers. \n \n► Initiate and facilitate complex discussions in small to medium sized businesses (SMB) with up to 3000 employees; assist C-Level management in in understanding and differentiating their value to attract and retain top talent. \n \n► Cultivate long-term vision and strategic operational planning to define goals and metrics for continued success. \n \n► Train executives on managing change to remain relevant in the competitive and constantly evolving Silicon Valley tech landscape. \n \nSpecialties: Change Management | Human Resources Leadership | Business Process Optimization \nOrganizational Planning Human Resources Executive Coaching, Change Management, Human Resources Process Optimization Human Resources Consultant October 2012  – Present (2 years 11 months) Silicon Valley Consult with executive leadership in design, development, and management of integrated HR systems, and leverage an extensive professional network to recommend and refer outsourced administration providers. \n \n► Initiate and facilitate complex discussions in small to medium sized businesses (SMB) with up to 3000 employees; assist C-Level management in in understanding and differentiating their value to attract and retain top talent. \n \n► Cultivate long-term vision and strategic operational planning to define goals and metrics for continued success. \n \n► Train executives on managing change to remain relevant in the competitive and constantly evolving Silicon Valley tech landscape. \n \nSpecialties: Change Management | Human Resources Leadership | Business Process Optimization \nOrganizational Planning Director, Shared Service Governance Office / Executive Coaching & Human Resources Operations Cisco Systems August 2010  – Present (5 years 1 month) Performance Management, Business Process Outsourcing, Strategic Planning Led strategy and planning in the service governance office as the right hand to business unit leadership. Successfully optimized performance and managed risk for nine service categories across all non-business process outsourcing (BPO) vendors. \n \n► Established disaster recovery and business continuity framework as part of an initiative sanctioned by the global CEO. \n \n► Built an integrated business plan that increased cost visibility and accountability by designing and operationalizing Operations-as-a-Service. \n \nSpecialties: Human Resources Operations | Business Continuity & Succession Planning | Executive Leadership Director, Shared Service Governance Office / Executive Coaching & Human Resources Operations Cisco Systems August 2010  – Present (5 years 1 month) Performance Management, Business Process Outsourcing, Strategic Planning Led strategy and planning in the service governance office as the right hand to business unit leadership. Successfully optimized performance and managed risk for nine service categories across all non-business process outsourcing (BPO) vendors. \n \n► Established disaster recovery and business continuity framework as part of an initiative sanctioned by the global CEO. \n \n► Built an integrated business plan that increased cost visibility and accountability by designing and operationalizing Operations-as-a-Service. \n \nSpecialties: Human Resources Operations | Business Continuity & Succession Planning | Executive Leadership Director, Customer Operations / Human Resources & Organizational Effectivness Cisco Systems March 2007  –  July 2010  (3 years 5 months) Change Management, Stakeholder Engagement, Operations & Resource Management Recruited by business unit leadership to steer organizational effectiveness planning for the Customer Operations group as the acting Chief Information Officer and executive board representative. Established the first-ever Operations Policy review board and developed governance and long-range financial planning metrics for all quote to cash and returns processes. \n \n► Delivered a potential $4M operating expense budget reduction after only one quarter in the role by restructuring approvals and review processes. \n \n► Improved resource utilization and reduced redundancy in work cycles with a complete overhaul of front-end engagement models in global customer operations. \n \n► Orchestrated change management platform and tactics from stakeholder analysis and engagement planning through impact assessments. \n \n► Co-developed a next-generation, enterprise-wide change leadership framework, and personally contributed curriculum content/structure and socialization plans. \n \n► Executed business unit level organizational design tactics for the Virtual Service Engine (VSE) at Cisco Systems, and both created and facilitated a four-day offsite program that successfully integrated the Customer Operations and Supply Chain Field Operations organizations. Director, Customer Operations / Human Resources & Organizational Effectivness Cisco Systems March 2007  –  July 2010  (3 years 5 months) Change Management, Stakeholder Engagement, Operations & Resource Management Recruited by business unit leadership to steer organizational effectiveness planning for the Customer Operations group as the acting Chief Information Officer and executive board representative. Established the first-ever Operations Policy review board and developed governance and long-range financial planning metrics for all quote to cash and returns processes. \n \n► Delivered a potential $4M operating expense budget reduction after only one quarter in the role by restructuring approvals and review processes. \n \n► Improved resource utilization and reduced redundancy in work cycles with a complete overhaul of front-end engagement models in global customer operations. \n \n► Orchestrated change management platform and tactics from stakeholder analysis and engagement planning through impact assessments. \n \n► Co-developed a next-generation, enterprise-wide change leadership framework, and personally contributed curriculum content/structure and socialization plans. \n \n► Executed business unit level organizational design tactics for the Virtual Service Engine (VSE) at Cisco Systems, and both created and facilitated a four-day offsite program that successfully integrated the Customer Operations and Supply Chain Field Operations organizations. Director of Human Resources / Executive HR Business Partner, Executive Coaching Cisco Systems March 2004  –  March 2007  (3 years 1 month) Change Management, Organizational Planning, Talent Development Led change and transformation for several Vice Presidents with a +2,000-person client base comprised of team members from Corporate Quality, Information Technology, Customer Service, and Operations Business Planning/Strategy. \n \n► Selected as principal change management and internal communications strategist for Project Hercules. \n \n► Designed organizational assessments and created tools and benchmarks for multiple client organizations to drive long-term vision and strategic planning. \n \n► Piloted the Cisco Change Roadmap to create a Quote to Cash organization within six months; reorganized the employee base, created new job descriptions, and aligned managers and business leaders with best practices in hiring and interviewing to place over 70 new employees. Director of Human Resources / Executive HR Business Partner, Executive Coaching Cisco Systems March 2004  –  March 2007  (3 years 1 month) Change Management, Organizational Planning, Talent Development Led change and transformation for several Vice Presidents with a +2,000-person client base comprised of team members from Corporate Quality, Information Technology, Customer Service, and Operations Business Planning/Strategy. \n \n► Selected as principal change management and internal communications strategist for Project Hercules. \n \n► Designed organizational assessments and created tools and benchmarks for multiple client organizations to drive long-term vision and strategic planning. \n \n► Piloted the Cisco Change Roadmap to create a Quote to Cash organization within six months; reorganized the employee base, created new job descriptions, and aligned managers and business leaders with best practices in hiring and interviewing to place over 70 new employees. Manager Human Resources / Change Management, Human Resources Project Management, HR Compliance Cisco Systems March 1998  –  March 2004  (6 years 1 month) Compliance, Immigration & Relocation, Global Staffing & 1099 Management Appointed as project lead for numerous complex, ambiguous, and business critical projects and processes, and created strategic, long-term solutions to achieve business goals and minimize compliance risk. \n \n► Centralized reporting, management, and financial processes for over 220 global staffing vendors; resulting procedures standardized margins and delivered a significantly lower cost of hiring. \n \n► Created processes and procedures to manage 1099 tax risk and co-employment liability for 6,000-plus non-W2 work providers, and partnered with purchasing/legal to define employment categories.  \n \n► Reduced immigration team headcount by 50% and developed strategy and procedure to create a world-class talent pool while managing compliance for up to 7000 H1 employees. \n \n► Formalized and streamlined expense reporting/reimbursements for domestic relocation, and eliminated waste and non-compliance. Manager Human Resources / Change Management, Human Resources Project Management, HR Compliance Cisco Systems March 1998  –  March 2004  (6 years 1 month) Compliance, Immigration & Relocation, Global Staffing & 1099 Management Appointed as project lead for numerous complex, ambiguous, and business critical projects and processes, and created strategic, long-term solutions to achieve business goals and minimize compliance risk. \n \n► Centralized reporting, management, and financial processes for over 220 global staffing vendors; resulting procedures standardized margins and delivered a significantly lower cost of hiring. \n \n► Created processes and procedures to manage 1099 tax risk and co-employment liability for 6,000-plus non-W2 work providers, and partnered with purchasing/legal to define employment categories.  \n \n► Reduced immigration team headcount by 50% and developed strategy and procedure to create a world-class talent pool while managing compliance for up to 7000 H1 employees. \n \n► Formalized and streamlined expense reporting/reimbursements for domestic relocation, and eliminated waste and non-compliance. Business Development GE Capitol Consulting/PTC April 1997  –  February 1998  (11 months) Opportunity Creation, Recruitment/Talent Management, Project Management Sourced opportunities from cradle to grave, including recruitment of project teams and leads. Business Development GE Capitol Consulting/PTC April 1997  –  February 1998  (11 months) Opportunity Creation, Recruitment/Talent Management, Project Management Sourced opportunities from cradle to grave, including recruitment of project teams and leads. Skills Organizational Design Metrics Change Leadership Organizational Change Organizational... Employee Relations Employment Law Employment Contracts Governance Customer Service New Business Development Operations Management Business Planning Executive Coaching Immigration Law Business Continuity Change Management Strategy Strategic Planning Leadership Management Recruiting Outsourcing Personnel Management Human Resources Succession Planning HRIS Business Development Enterprise Software Interviews Employee Benefits Project Planning Vendor Management Performance Management Talent Management Employee Engagement Workforce Planning Talent Acquisition Sourcing Organizational... Onboarding Cross-functional Team... Deferred Compensation Resource Management Executive Management Hiring Technical Recruiting College Recruiting Program Management Acquisition Integration See 35+     See less Skills  Organizational Design Metrics Change Leadership Organizational Change Organizational... Employee Relations Employment Law Employment Contracts Governance Customer Service New Business Development Operations Management Business Planning Executive Coaching Immigration Law Business Continuity Change Management Strategy Strategic Planning Leadership Management Recruiting Outsourcing Personnel Management Human Resources Succession Planning HRIS Business Development Enterprise Software Interviews Employee Benefits Project Planning Vendor Management Performance Management Talent Management Employee Engagement Workforce Planning Talent Acquisition Sourcing Organizational... Onboarding Cross-functional Team... Deferred Compensation Resource Management Executive Management Hiring Technical Recruiting College Recruiting Program Management Acquisition Integration See 35+     See less Organizational Design Metrics Change Leadership Organizational Change Organizational... Employee Relations Employment Law Employment Contracts Governance Customer Service New Business Development Operations Management Business Planning Executive Coaching Immigration Law Business Continuity Change Management Strategy Strategic Planning Leadership Management Recruiting Outsourcing Personnel Management Human Resources Succession Planning HRIS Business Development Enterprise Software Interviews Employee Benefits Project Planning Vendor Management Performance Management Talent Management Employee Engagement Workforce Planning Talent Acquisition Sourcing Organizational... Onboarding Cross-functional Team... Deferred Compensation Resource Management Executive Management Hiring Technical Recruiting College Recruiting Program Management Acquisition Integration See 35+     See less Organizational Design Metrics Change Leadership Organizational Change Organizational... Employee Relations Employment Law Employment Contracts Governance Customer Service New Business Development Operations Management Business Planning Executive Coaching Immigration Law Business Continuity Change Management Strategy Strategic Planning Leadership Management Recruiting Outsourcing Personnel Management Human Resources Succession Planning HRIS Business Development Enterprise Software Interviews Employee Benefits Project Planning Vendor Management Performance Management Talent Management Employee Engagement Workforce Planning Talent Acquisition Sourcing Organizational... Onboarding Cross-functional Team... Deferred Compensation Resource Management Executive Management Hiring Technical Recruiting College Recruiting Program Management Acquisition Integration See 35+     See less ", "Skills Talent Acquisition Deferred Compensation Talent Management HR Transformation Human Resources Management Onboarding Succession Planning Employee Engagement Organizational Design Performance Management College Recruiting Employee Relations HRIS Organizational... Culture Change Personnel Management Executive Development See 3+     See less Skills  Talent Acquisition Deferred Compensation Talent Management HR Transformation Human Resources Management Onboarding Succession Planning Employee Engagement Organizational Design Performance Management College Recruiting Employee Relations HRIS Organizational... Culture Change Personnel Management Executive Development See 3+     See less Talent Acquisition Deferred Compensation Talent Management HR Transformation Human Resources Management Onboarding Succession Planning Employee Engagement Organizational Design Performance Management College Recruiting Employee Relations HRIS Organizational... Culture Change Personnel Management Executive Development See 3+     See less Talent Acquisition Deferred Compensation Talent Management HR Transformation Human Resources Management Onboarding Succession Planning Employee Engagement Organizational Design Performance Management College Recruiting Employee Relations HRIS Organizational... Culture Change Personnel Management Executive Development See 3+     See less ", "Skills Unix Skills  Unix Unix Unix ", "Summary Global Human Resources leader with experience both in business and HR: specialist and generalist; field and headquarters; domestic and international. Thought leader with demonstrated ability to lead horizontally, inspire cross-functionally and perform all critical aspects of human resources management. Specialties:• Collaborative leadership \n• Business and people strategy \n• Organization alignment \n• Executive influence \n• Workforce planning \n• Performance management design \n• Compensation and HRIS Summary Global Human Resources leader with experience both in business and HR: specialist and generalist; field and headquarters; domestic and international. Thought leader with demonstrated ability to lead horizontally, inspire cross-functionally and perform all critical aspects of human resources management. Specialties:• Collaborative leadership \n• Business and people strategy \n• Organization alignment \n• Executive influence \n• Workforce planning \n• Performance management design \n• Compensation and HRIS Global Human Resources leader with experience both in business and HR: specialist and generalist; field and headquarters; domestic and international. Thought leader with demonstrated ability to lead horizontally, inspire cross-functionally and perform all critical aspects of human resources management. Specialties:• Collaborative leadership \n• Business and people strategy \n• Organization alignment \n• Executive influence \n• Workforce planning \n• Performance management design \n• Compensation and HRIS Global Human Resources leader with experience both in business and HR: specialist and generalist; field and headquarters; domestic and international. Thought leader with demonstrated ability to lead horizontally, inspire cross-functionally and perform all critical aspects of human resources management. Specialties:• Collaborative leadership \n• Business and people strategy \n• Organization alignment \n• Executive influence \n• Workforce planning \n• Performance management design \n• Compensation and HRIS Experience HR Director - Data Center & Switching Cisco Systems March 2007  – Present (8 years 6 months) HR Business Partner for a fast-paced, highly innovative $15B business with 4,500 global employees in hardware and software engineering, marketing and product management. Participate as key member of executive team, including 5 Senior Vice Presidents and over 30 Vice Presidents. Director, Human Resources Cisco Systems November 2005  –  March 2007  (1 year 5 months) Center of Excellence leader for Cisco's global engineering organization (Cisco Development Organization or CDO) of 25,000+ employees globally. Simultaneously lead Compensation, Talent Management, Employee Relations, Acquisitions, Staffing and Operations for CDO. Regularly consulted to the Chief Development Officer and later to 9 SVP leaders of the Cisco Development Council on all HR matters. Director, Human Resources Cisco Systems December 2004  –  November 2005  (1 year) Talent Management Officer for EVP of Cisco Operations, Processes and Systems (OPS) comprised of the following functions: IT, Supply Chain, Legal, Customer Service, Corporate Quality, Corporate Affairs and HR. Focused on consolidated business planning and key talent insertion. Director, Marketing NETSTREAM November 1999  –  November 2000  (1 year 1 month) Lead marketing efforts of Competitive Local Exchange Carrier (CLEC) pre-IPO start up. Senior Manager, Sales and Marketing / Customer Service MCI May 1990  –  November 1999  (9 years 7 months) Variety of roles, including Marketing, Planning and Strategy, Vendor Management, and Program Management. Lead organization of 3,000 employees; budget management of $100M/year; participated in MCI's launch into the Local markets which grew customer base from 0 to over 300k in 6 months; multi-vendor contract negotiations. HR Director - Data Center & Switching Cisco Systems March 2007  – Present (8 years 6 months) HR Business Partner for a fast-paced, highly innovative $15B business with 4,500 global employees in hardware and software engineering, marketing and product management. Participate as key member of executive team, including 5 Senior Vice Presidents and over 30 Vice Presidents. HR Director - Data Center & Switching Cisco Systems March 2007  – Present (8 years 6 months) HR Business Partner for a fast-paced, highly innovative $15B business with 4,500 global employees in hardware and software engineering, marketing and product management. Participate as key member of executive team, including 5 Senior Vice Presidents and over 30 Vice Presidents. Director, Human Resources Cisco Systems November 2005  –  March 2007  (1 year 5 months) Center of Excellence leader for Cisco's global engineering organization (Cisco Development Organization or CDO) of 25,000+ employees globally. Simultaneously lead Compensation, Talent Management, Employee Relations, Acquisitions, Staffing and Operations for CDO. Regularly consulted to the Chief Development Officer and later to 9 SVP leaders of the Cisco Development Council on all HR matters. Director, Human Resources Cisco Systems November 2005  –  March 2007  (1 year 5 months) Center of Excellence leader for Cisco's global engineering organization (Cisco Development Organization or CDO) of 25,000+ employees globally. Simultaneously lead Compensation, Talent Management, Employee Relations, Acquisitions, Staffing and Operations for CDO. Regularly consulted to the Chief Development Officer and later to 9 SVP leaders of the Cisco Development Council on all HR matters. Director, Human Resources Cisco Systems December 2004  –  November 2005  (1 year) Talent Management Officer for EVP of Cisco Operations, Processes and Systems (OPS) comprised of the following functions: IT, Supply Chain, Legal, Customer Service, Corporate Quality, Corporate Affairs and HR. Focused on consolidated business planning and key talent insertion. Director, Human Resources Cisco Systems December 2004  –  November 2005  (1 year) Talent Management Officer for EVP of Cisco Operations, Processes and Systems (OPS) comprised of the following functions: IT, Supply Chain, Legal, Customer Service, Corporate Quality, Corporate Affairs and HR. Focused on consolidated business planning and key talent insertion. Director, Marketing NETSTREAM November 1999  –  November 2000  (1 year 1 month) Lead marketing efforts of Competitive Local Exchange Carrier (CLEC) pre-IPO start up. Director, Marketing NETSTREAM November 1999  –  November 2000  (1 year 1 month) Lead marketing efforts of Competitive Local Exchange Carrier (CLEC) pre-IPO start up. Senior Manager, Sales and Marketing / Customer Service MCI May 1990  –  November 1999  (9 years 7 months) Variety of roles, including Marketing, Planning and Strategy, Vendor Management, and Program Management. Lead organization of 3,000 employees; budget management of $100M/year; participated in MCI's launch into the Local markets which grew customer base from 0 to over 300k in 6 months; multi-vendor contract negotiations. Senior Manager, Sales and Marketing / Customer Service MCI May 1990  –  November 1999  (9 years 7 months) Variety of roles, including Marketing, Planning and Strategy, Vendor Management, and Program Management. Lead organization of 3,000 employees; budget management of $100M/year; participated in MCI's launch into the Local markets which grew customer base from 0 to over 300k in 6 months; multi-vendor contract negotiations. Skills Workforce Planning Talent Management Performance Management Compensation HRIS Employee Relations Global HR Organizational... Succession Planning HR Strategy Talent Acquisition Employee Engagement Change Management HR Transformation Global Mobility Deferred Compensation Personnel Management Program Management Strategy Leadership Vendor Management Management See 7+     See less Skills  Workforce Planning Talent Management Performance Management Compensation HRIS Employee Relations Global HR Organizational... Succession Planning HR Strategy Talent Acquisition Employee Engagement Change Management HR Transformation Global Mobility Deferred Compensation Personnel Management Program Management Strategy Leadership Vendor Management Management See 7+     See less Workforce Planning Talent Management Performance Management Compensation HRIS Employee Relations Global HR Organizational... Succession Planning HR Strategy Talent Acquisition Employee Engagement Change Management HR Transformation Global Mobility Deferred Compensation Personnel Management Program Management Strategy Leadership Vendor Management Management See 7+     See less Workforce Planning Talent Management Performance Management Compensation HRIS Employee Relations Global HR Organizational... Succession Planning HR Strategy Talent Acquisition Employee Engagement Change Management HR Transformation Global Mobility Deferred Compensation Personnel Management Program Management Strategy Leadership Vendor Management Management See 7+     See less Education Smith College University of California, Davis Smith College Smith College Smith College University of California, Davis University of California, Davis University of California, Davis ", "Summary Collaborative, energetic and results focused Human Resources Leader offering 15+ years of global business and HR operational leadership, HR generalist and specialist experiences, and strategic HR consulting in an array of industries including life sciences, technology, professional services and healthcare. Possess a unique combination of day-to-day HR operations execution with C-suite interaction ranging from organizational design and leadership development to global HR service delivery, with the ongoing goal of accelerating business operations and workforce performance. \n \nSpecialties: Organization and executive development; talent management; HR generalist; workforce planning; quantitative analysis; employee relations Summary Collaborative, energetic and results focused Human Resources Leader offering 15+ years of global business and HR operational leadership, HR generalist and specialist experiences, and strategic HR consulting in an array of industries including life sciences, technology, professional services and healthcare. Possess a unique combination of day-to-day HR operations execution with C-suite interaction ranging from organizational design and leadership development to global HR service delivery, with the ongoing goal of accelerating business operations and workforce performance. \n \nSpecialties: Organization and executive development; talent management; HR generalist; workforce planning; quantitative analysis; employee relations Collaborative, energetic and results focused Human Resources Leader offering 15+ years of global business and HR operational leadership, HR generalist and specialist experiences, and strategic HR consulting in an array of industries including life sciences, technology, professional services and healthcare. Possess a unique combination of day-to-day HR operations execution with C-suite interaction ranging from organizational design and leadership development to global HR service delivery, with the ongoing goal of accelerating business operations and workforce performance. \n \nSpecialties: Organization and executive development; talent management; HR generalist; workforce planning; quantitative analysis; employee relations Collaborative, energetic and results focused Human Resources Leader offering 15+ years of global business and HR operational leadership, HR generalist and specialist experiences, and strategic HR consulting in an array of industries including life sciences, technology, professional services and healthcare. Possess a unique combination of day-to-day HR operations execution with C-suite interaction ranging from organizational design and leadership development to global HR service delivery, with the ongoing goal of accelerating business operations and workforce performance. \n \nSpecialties: Organization and executive development; talent management; HR generalist; workforce planning; quantitative analysis; employee relations Experience Director, Human Resources VMware December 2013  – Present (1 year 9 months) Palo Alto, CA Worldwide Director, Human Resources Apigee June 2013  –  December 2013  (7 months) Palo Alto, CA Director, Human Resources VMware July 2011  –  June 2013  (2 years) Palo Alto, CA Sr. Human Resources Manager Cisco Systems April 2010  –  July 2011  (1 year 4 months) HR Manager Cisco Systems March 2008  –  April 2010  (2 years 2 months) HR Manager within the Cisco Development Office (CDO), comprised of our technical leadership, engineering and product management workforce in Cisco Systems, Inc.  \n \nPositions held within Cisco include: \n-HR Manager, Access Routing Technology Group (ARTG) and Small Business Technology Group (SBTG) (Enterprise Biz Group) \n-HR Manager, Core Routing Business Unit (CRBU) and Access & Transport Technology Group (ATTG) (Service Provider Biz Group) \n-HR Manager, Service Provider Routing Technology Group (SPRTG) Director, National HR Consulting Services Kaiser Foundation Health Plan October 2006  –  March 2008  (1 year 6 months) Director, National HR Consulting Services Kaiser Permanente 2007  –  2008  (1 year) Manager, Recruitment Operations Process Improvement Kaiser Foundation Health Plan October 2006  –  October 2007  (1 year 1 month) Manager, HR Operations & Technology (Human Capital) Deloitte Consulting May 2006  –  October 2006  (6 months) Senior Consultant, HR Operations & Technology (Human Capital) Deloitte Consulting January 2005  –  April 2006  (1 year 4 months) Multiple HR positions General Electric August 2001  –  January 2005  (3 years 6 months) Director, Human Resources VMware December 2013  – Present (1 year 9 months) Palo Alto, CA Director, Human Resources VMware December 2013  – Present (1 year 9 months) Palo Alto, CA Worldwide Director, Human Resources Apigee June 2013  –  December 2013  (7 months) Palo Alto, CA Worldwide Director, Human Resources Apigee June 2013  –  December 2013  (7 months) Palo Alto, CA Director, Human Resources VMware July 2011  –  June 2013  (2 years) Palo Alto, CA Director, Human Resources VMware July 2011  –  June 2013  (2 years) Palo Alto, CA Sr. Human Resources Manager Cisco Systems April 2010  –  July 2011  (1 year 4 months) Sr. Human Resources Manager Cisco Systems April 2010  –  July 2011  (1 year 4 months) HR Manager Cisco Systems March 2008  –  April 2010  (2 years 2 months) HR Manager within the Cisco Development Office (CDO), comprised of our technical leadership, engineering and product management workforce in Cisco Systems, Inc.  \n \nPositions held within Cisco include: \n-HR Manager, Access Routing Technology Group (ARTG) and Small Business Technology Group (SBTG) (Enterprise Biz Group) \n-HR Manager, Core Routing Business Unit (CRBU) and Access & Transport Technology Group (ATTG) (Service Provider Biz Group) \n-HR Manager, Service Provider Routing Technology Group (SPRTG) HR Manager Cisco Systems March 2008  –  April 2010  (2 years 2 months) HR Manager within the Cisco Development Office (CDO), comprised of our technical leadership, engineering and product management workforce in Cisco Systems, Inc.  \n \nPositions held within Cisco include: \n-HR Manager, Access Routing Technology Group (ARTG) and Small Business Technology Group (SBTG) (Enterprise Biz Group) \n-HR Manager, Core Routing Business Unit (CRBU) and Access & Transport Technology Group (ATTG) (Service Provider Biz Group) \n-HR Manager, Service Provider Routing Technology Group (SPRTG) Director, National HR Consulting Services Kaiser Foundation Health Plan October 2006  –  March 2008  (1 year 6 months) Director, National HR Consulting Services Kaiser Foundation Health Plan October 2006  –  March 2008  (1 year 6 months) Director, National HR Consulting Services Kaiser Permanente 2007  –  2008  (1 year) Director, National HR Consulting Services Kaiser Permanente 2007  –  2008  (1 year) Manager, Recruitment Operations Process Improvement Kaiser Foundation Health Plan October 2006  –  October 2007  (1 year 1 month) Manager, Recruitment Operations Process Improvement Kaiser Foundation Health Plan October 2006  –  October 2007  (1 year 1 month) Manager, HR Operations & Technology (Human Capital) Deloitte Consulting May 2006  –  October 2006  (6 months) Manager, HR Operations & Technology (Human Capital) Deloitte Consulting May 2006  –  October 2006  (6 months) Senior Consultant, HR Operations & Technology (Human Capital) Deloitte Consulting January 2005  –  April 2006  (1 year 4 months) Senior Consultant, HR Operations & Technology (Human Capital) Deloitte Consulting January 2005  –  April 2006  (1 year 4 months) Multiple HR positions General Electric August 2001  –  January 2005  (3 years 6 months) Multiple HR positions General Electric August 2001  –  January 2005  (3 years 6 months) Skills Change Management Employee Relations HR Consulting Human Resources Leadership Leadership Development Management Organizational Design Performance Management Personnel Management Product Management Program Management Talent Acquisition Recruiting Talent Management Workforce Planning See 1+     See less Skills  Change Management Employee Relations HR Consulting Human Resources Leadership Leadership Development Management Organizational Design Performance Management Personnel Management Product Management Program Management Talent Acquisition Recruiting Talent Management Workforce Planning See 1+     See less Change Management Employee Relations HR Consulting Human Resources Leadership Leadership Development Management Organizational Design Performance Management Personnel Management Product Management Program Management Talent Acquisition Recruiting Talent Management Workforce Planning See 1+     See less Change Management Employee Relations HR Consulting Human Resources Leadership Leadership Development Management Organizational Design Performance Management Personnel Management Product Management Program Management Talent Acquisition Recruiting Talent Management Workforce Planning See 1+     See less Education Purdue University MS 1999  – 2001 Purdue University - Krannert School of Management MS,  Human Resources Management 1999  – 2001 Nebraska Wesleyan University BS,  Business Administration & Psychology 1993  – 1997 Lincoln East High School Purdue University MS 1999  – 2001 Purdue University MS 1999  – 2001 Purdue University MS 1999  – 2001 Purdue University - Krannert School of Management MS,  Human Resources Management 1999  – 2001 Purdue University - Krannert School of Management MS,  Human Resources Management 1999  – 2001 Purdue University - Krannert School of Management MS,  Human Resources Management 1999  – 2001 Nebraska Wesleyan University BS,  Business Administration & Psychology 1993  – 1997 Nebraska Wesleyan University BS,  Business Administration & Psychology 1993  – 1997 Nebraska Wesleyan University BS,  Business Administration & Psychology 1993  – 1997 Lincoln East High School Lincoln East High School Lincoln East High School ", "Summary Senior HR Leader with demonstrated ability to quickly assess business needs, develop and implement creative solutions and collaborate with others to manage change. Extensive experience working with companies from Fortune 500 to start-up companies in a variety of industries. Known for being adaptable, efficient, intuitive, self-motivated and well organized.  \n \nKey skills include: \n•\tMergers and Acquisitions \n•\tEmployee Relations \n•\tGlobal Experience \n•\tChange Management \n•\tAbility to Influence \n•\tArticulate Communicator \n•\tExecutive Coaching \n•\tExcellent Organization Skills \n•\tCompensation Planning \n•\tConsultative \n•\tStart-up Experience  \n•\tKeep the Human in HR Summary Senior HR Leader with demonstrated ability to quickly assess business needs, develop and implement creative solutions and collaborate with others to manage change. Extensive experience working with companies from Fortune 500 to start-up companies in a variety of industries. Known for being adaptable, efficient, intuitive, self-motivated and well organized.  \n \nKey skills include: \n•\tMergers and Acquisitions \n•\tEmployee Relations \n•\tGlobal Experience \n•\tChange Management \n•\tAbility to Influence \n•\tArticulate Communicator \n•\tExecutive Coaching \n•\tExcellent Organization Skills \n•\tCompensation Planning \n•\tConsultative \n•\tStart-up Experience  \n•\tKeep the Human in HR Senior HR Leader with demonstrated ability to quickly assess business needs, develop and implement creative solutions and collaborate with others to manage change. Extensive experience working with companies from Fortune 500 to start-up companies in a variety of industries. Known for being adaptable, efficient, intuitive, self-motivated and well organized.  \n \nKey skills include: \n•\tMergers and Acquisitions \n•\tEmployee Relations \n•\tGlobal Experience \n•\tChange Management \n•\tAbility to Influence \n•\tArticulate Communicator \n•\tExecutive Coaching \n•\tExcellent Organization Skills \n•\tCompensation Planning \n•\tConsultative \n•\tStart-up Experience  \n•\tKeep the Human in HR Senior HR Leader with demonstrated ability to quickly assess business needs, develop and implement creative solutions and collaborate with others to manage change. Extensive experience working with companies from Fortune 500 to start-up companies in a variety of industries. Known for being adaptable, efficient, intuitive, self-motivated and well organized.  \n \nKey skills include: \n•\tMergers and Acquisitions \n•\tEmployee Relations \n•\tGlobal Experience \n•\tChange Management \n•\tAbility to Influence \n•\tArticulate Communicator \n•\tExecutive Coaching \n•\tExcellent Organization Skills \n•\tCompensation Planning \n•\tConsultative \n•\tStart-up Experience  \n•\tKeep the Human in HR Experience Director, Human Resources Riverbed Technology March 2014  – Present (1 year 6 months) San Francisco, CA Riverbed delivers performance for the globally connected enterprise. With Riverbed, enterprises can successfully and intelligently implement strategic initiatives such as virtualization, consolidation, cloud computing, and disaster recovery without fear of compromising performance. By giving enterprises the platform they need to understand, optimize and consolidate their IT, Riverbed helps enterprises to build a fast, fluid and dynamic IT architecture that aligns with the business needs of the organization. Riverbed offers the rewarding experience of working with the best minds in the industry who are changing the world through cutting edge technology and applications. Sr. Human Resources Manager Cisco Systems May 2009  –  October 2013  (4 years 6 months) Chief of Staff for HR, 2012-2013 \nMaintained a unified approach with the HR Business Partners in managing, designing and delivering Global Human Resources projects including Executive Leadership Review, Workforce Planning, Organizational Assessment, Acquisition Integration, Change Management Planning, and all aspects of driving and delivering HR programs and initiatives to support the overall goals of the Video Collaboration Group. \n \n•\tHR Project Lead for a 5,000-person integration from 28 countries working with local and global HR Business Partners, resulting in 95% of all employees receiving a performance review.  \n \nSr. Human Resources Manager, 2009 – 2012 \nGuided Consumer / Home Networking leadership through the integration into Cisco by developing and delivering worldwide integrated people and organization solutions such as Focal, Mid-Year Career Discussions, Annual Reviews, Work Force Design, and Executive Talent Reviews. Provided Business Partner support to the Corporate Technology and Strategy Office as well as the Emerging Technologies Sales team. \n \n•\tLed and participated in several acquisitions, divestitures and assimilations across Cisco, gaining global experience in process, implementation and delivery for change management. Director, Human Resources Pure Digital Technologies February 2008  –  May 2009  (1 year 4 months) San Francisco, CA Provided strategic Human Resources leadership and counsel to the management team while being focused on high growth, excellent employee engagement and organization design. The company was ultimately acquired by Cisco Systems. Staff Human Resources Consultant Melita Group January 2006  –  January 2008  (2 years 1 month) San Francisco Bay Area Provided strategic HR consulting services to a variety of organizations ranging from public and large to private and small start-ups. Focused on developing, implementing and improving client HR functions. Director, Business Development HR Services Melita Group January 2006  –  December 2006  (1 year) San Francisco Bay Area Cultivated the relationships of current brokerage and HR Services clients as well as brought in new clients to provide HR options to address their current and future HR challenges. Also developed partnerships, community involvement and general marketing of the Melita Group. Board Member Northern California Human Resources Association 2000  –  2006  (6 years) Founding member of the Peninsula Chapter Director, Human Resources IronPort Systems, Inc. December 2004  –  December 2005  (1 year 1 month) San Francisco Bay Area Accelerated the Human Resource function with a staff of eight HR professionals in the areas of Compensation, Benefits and HRIS, Staffing and Employee Relations allowing for a smooth acquisition into Cisco. Sr. HR Consultant & Owner Orsini Consulting Group March 2000  –  December 2004  (4 years 10 months) San Francisco Bay Area High-tech, telecom, Software, Internet, Telecommunications, Supply Chain, Insurance + \nDirector, Recruiter, Sr. HR Generalist + \nProvided HR consulting services as a business partner by managing on-site HR staff, working closely with executive staff to upgrade HR infrastructure, staffing, internal communications, and restructuring strategies. Human Resources Manager Torani Italian Syrups March 1999  –  March 2000  (1 year 1 month) South San Francisco, CA Managed the HR function including extensive worker’s compensation, employee relations and career planning initiatives. Sr. HR Generalist Ridge Vineyards May 1996  –  March 1999  (2 years 11 months) Santa Cruz Mountains Strengthened the HR function by updating this 30-year-old company in the areas of legal compliance, technology, benefits and performance management. Director, Human Resources Consumers Car Club February 1993  –  May 1996  (3 years 4 months) San Francisco, CA Led the design and implementation of all aspects of HR including recruitment, benefits, compensation, employee relations and the company culture. The company grew 200% during this time. Director, Human Resources Riverbed Technology March 2014  – Present (1 year 6 months) San Francisco, CA Riverbed delivers performance for the globally connected enterprise. With Riverbed, enterprises can successfully and intelligently implement strategic initiatives such as virtualization, consolidation, cloud computing, and disaster recovery without fear of compromising performance. By giving enterprises the platform they need to understand, optimize and consolidate their IT, Riverbed helps enterprises to build a fast, fluid and dynamic IT architecture that aligns with the business needs of the organization. Riverbed offers the rewarding experience of working with the best minds in the industry who are changing the world through cutting edge technology and applications. Director, Human Resources Riverbed Technology March 2014  – Present (1 year 6 months) San Francisco, CA Riverbed delivers performance for the globally connected enterprise. With Riverbed, enterprises can successfully and intelligently implement strategic initiatives such as virtualization, consolidation, cloud computing, and disaster recovery without fear of compromising performance. By giving enterprises the platform they need to understand, optimize and consolidate their IT, Riverbed helps enterprises to build a fast, fluid and dynamic IT architecture that aligns with the business needs of the organization. Riverbed offers the rewarding experience of working with the best minds in the industry who are changing the world through cutting edge technology and applications. Sr. Human Resources Manager Cisco Systems May 2009  –  October 2013  (4 years 6 months) Chief of Staff for HR, 2012-2013 \nMaintained a unified approach with the HR Business Partners in managing, designing and delivering Global Human Resources projects including Executive Leadership Review, Workforce Planning, Organizational Assessment, Acquisition Integration, Change Management Planning, and all aspects of driving and delivering HR programs and initiatives to support the overall goals of the Video Collaboration Group. \n \n•\tHR Project Lead for a 5,000-person integration from 28 countries working with local and global HR Business Partners, resulting in 95% of all employees receiving a performance review.  \n \nSr. Human Resources Manager, 2009 – 2012 \nGuided Consumer / Home Networking leadership through the integration into Cisco by developing and delivering worldwide integrated people and organization solutions such as Focal, Mid-Year Career Discussions, Annual Reviews, Work Force Design, and Executive Talent Reviews. Provided Business Partner support to the Corporate Technology and Strategy Office as well as the Emerging Technologies Sales team. \n \n•\tLed and participated in several acquisitions, divestitures and assimilations across Cisco, gaining global experience in process, implementation and delivery for change management. Sr. Human Resources Manager Cisco Systems May 2009  –  October 2013  (4 years 6 months) Chief of Staff for HR, 2012-2013 \nMaintained a unified approach with the HR Business Partners in managing, designing and delivering Global Human Resources projects including Executive Leadership Review, Workforce Planning, Organizational Assessment, Acquisition Integration, Change Management Planning, and all aspects of driving and delivering HR programs and initiatives to support the overall goals of the Video Collaboration Group. \n \n•\tHR Project Lead for a 5,000-person integration from 28 countries working with local and global HR Business Partners, resulting in 95% of all employees receiving a performance review.  \n \nSr. Human Resources Manager, 2009 – 2012 \nGuided Consumer / Home Networking leadership through the integration into Cisco by developing and delivering worldwide integrated people and organization solutions such as Focal, Mid-Year Career Discussions, Annual Reviews, Work Force Design, and Executive Talent Reviews. Provided Business Partner support to the Corporate Technology and Strategy Office as well as the Emerging Technologies Sales team. \n \n•\tLed and participated in several acquisitions, divestitures and assimilations across Cisco, gaining global experience in process, implementation and delivery for change management. Director, Human Resources Pure Digital Technologies February 2008  –  May 2009  (1 year 4 months) San Francisco, CA Provided strategic Human Resources leadership and counsel to the management team while being focused on high growth, excellent employee engagement and organization design. The company was ultimately acquired by Cisco Systems. Director, Human Resources Pure Digital Technologies February 2008  –  May 2009  (1 year 4 months) San Francisco, CA Provided strategic Human Resources leadership and counsel to the management team while being focused on high growth, excellent employee engagement and organization design. The company was ultimately acquired by Cisco Systems. Staff Human Resources Consultant Melita Group January 2006  –  January 2008  (2 years 1 month) San Francisco Bay Area Provided strategic HR consulting services to a variety of organizations ranging from public and large to private and small start-ups. Focused on developing, implementing and improving client HR functions. Staff Human Resources Consultant Melita Group January 2006  –  January 2008  (2 years 1 month) San Francisco Bay Area Provided strategic HR consulting services to a variety of organizations ranging from public and large to private and small start-ups. Focused on developing, implementing and improving client HR functions. Director, Business Development HR Services Melita Group January 2006  –  December 2006  (1 year) San Francisco Bay Area Cultivated the relationships of current brokerage and HR Services clients as well as brought in new clients to provide HR options to address their current and future HR challenges. Also developed partnerships, community involvement and general marketing of the Melita Group. Director, Business Development HR Services Melita Group January 2006  –  December 2006  (1 year) San Francisco Bay Area Cultivated the relationships of current brokerage and HR Services clients as well as brought in new clients to provide HR options to address their current and future HR challenges. Also developed partnerships, community involvement and general marketing of the Melita Group. Board Member Northern California Human Resources Association 2000  –  2006  (6 years) Founding member of the Peninsula Chapter Board Member Northern California Human Resources Association 2000  –  2006  (6 years) Founding member of the Peninsula Chapter Director, Human Resources IronPort Systems, Inc. December 2004  –  December 2005  (1 year 1 month) San Francisco Bay Area Accelerated the Human Resource function with a staff of eight HR professionals in the areas of Compensation, Benefits and HRIS, Staffing and Employee Relations allowing for a smooth acquisition into Cisco. Director, Human Resources IronPort Systems, Inc. December 2004  –  December 2005  (1 year 1 month) San Francisco Bay Area Accelerated the Human Resource function with a staff of eight HR professionals in the areas of Compensation, Benefits and HRIS, Staffing and Employee Relations allowing for a smooth acquisition into Cisco. Sr. HR Consultant & Owner Orsini Consulting Group March 2000  –  December 2004  (4 years 10 months) San Francisco Bay Area High-tech, telecom, Software, Internet, Telecommunications, Supply Chain, Insurance + \nDirector, Recruiter, Sr. HR Generalist + \nProvided HR consulting services as a business partner by managing on-site HR staff, working closely with executive staff to upgrade HR infrastructure, staffing, internal communications, and restructuring strategies. Sr. HR Consultant & Owner Orsini Consulting Group March 2000  –  December 2004  (4 years 10 months) San Francisco Bay Area High-tech, telecom, Software, Internet, Telecommunications, Supply Chain, Insurance + \nDirector, Recruiter, Sr. HR Generalist + \nProvided HR consulting services as a business partner by managing on-site HR staff, working closely with executive staff to upgrade HR infrastructure, staffing, internal communications, and restructuring strategies. Human Resources Manager Torani Italian Syrups March 1999  –  March 2000  (1 year 1 month) South San Francisco, CA Managed the HR function including extensive worker’s compensation, employee relations and career planning initiatives. Human Resources Manager Torani Italian Syrups March 1999  –  March 2000  (1 year 1 month) South San Francisco, CA Managed the HR function including extensive worker’s compensation, employee relations and career planning initiatives. Sr. HR Generalist Ridge Vineyards May 1996  –  March 1999  (2 years 11 months) Santa Cruz Mountains Strengthened the HR function by updating this 30-year-old company in the areas of legal compliance, technology, benefits and performance management. Sr. HR Generalist Ridge Vineyards May 1996  –  March 1999  (2 years 11 months) Santa Cruz Mountains Strengthened the HR function by updating this 30-year-old company in the areas of legal compliance, technology, benefits and performance management. Director, Human Resources Consumers Car Club February 1993  –  May 1996  (3 years 4 months) San Francisco, CA Led the design and implementation of all aspects of HR including recruitment, benefits, compensation, employee relations and the company culture. The company grew 200% during this time. Director, Human Resources Consumers Car Club February 1993  –  May 1996  (3 years 4 months) San Francisco, CA Led the design and implementation of all aspects of HR including recruitment, benefits, compensation, employee relations and the company culture. The company grew 200% during this time. Skills Employee Relations Performance Management Recruiting HR Policies Employee Benefits Human Resources HRIS Personnel Management HR Consulting Employee Training Onboarding Applicant Tracking... Temporary Placement Leadership Management Strategy Hiring Start-ups Deferred Compensation Talent Management Employee Engagement Training See 7+     See less Skills  Employee Relations Performance Management Recruiting HR Policies Employee Benefits Human Resources HRIS Personnel Management HR Consulting Employee Training Onboarding Applicant Tracking... Temporary Placement Leadership Management Strategy Hiring Start-ups Deferred Compensation Talent Management Employee Engagement Training See 7+     See less Employee Relations Performance Management Recruiting HR Policies Employee Benefits Human Resources HRIS Personnel Management HR Consulting Employee Training Onboarding Applicant Tracking... Temporary Placement Leadership Management Strategy Hiring Start-ups Deferred Compensation Talent Management Employee Engagement Training See 7+     See less Employee Relations Performance Management Recruiting HR Policies Employee Benefits Human Resources HRIS Personnel Management HR Consulting Employee Training Onboarding Applicant Tracking... Temporary Placement Leadership Management Strategy Hiring Start-ups Deferred Compensation Talent Management Employee Engagement Training See 7+     See less Education Michigan State University B.S.,  Employee Relations Michigan State University B.S.,  Employee Relations Michigan State University B.S.,  Employee Relations Michigan State University B.S.,  Employee Relations Honors & Awards Additional Honors & Awards Hoffman Institute Quadrinity Process - June 2002 \n7 Habits of Highly Effective People - 1999 Additional Honors & Awards Hoffman Institute Quadrinity Process - June 2002 \n7 Habits of Highly Effective People - 1999 Additional Honors & Awards Hoffman Institute Quadrinity Process - June 2002 \n7 Habits of Highly Effective People - 1999 Additional Honors & Awards Hoffman Institute Quadrinity Process - June 2002 \n7 Habits of Highly Effective People - 1999 ", "Languages English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Talent Management Talent Acquisition Workforce Planning Employee Engagement Performance Management Employee Relations HR Consulting Human Resources Recruiting Change Management Succession Planning Employer Branding Team Leadership Leadership Personnel Management Strategy Coaching Management Organizational Design Onboarding Executive Coaching Executive Search Sourcing Organizational... Outsourcing HR Transformation Employee Training Interviews Deferred Compensation HRIS See 15+     See less Skills  Talent Management Talent Acquisition Workforce Planning Employee Engagement Performance Management Employee Relations HR Consulting Human Resources Recruiting Change Management Succession Planning Employer Branding Team Leadership Leadership Personnel Management Strategy Coaching Management Organizational Design Onboarding Executive Coaching Executive Search Sourcing Organizational... Outsourcing HR Transformation Employee Training Interviews Deferred Compensation HRIS See 15+     See less Talent Management Talent Acquisition Workforce Planning Employee Engagement Performance Management Employee Relations HR Consulting Human Resources Recruiting Change Management Succession Planning Employer Branding Team Leadership Leadership Personnel Management Strategy Coaching Management Organizational Design Onboarding Executive Coaching Executive Search Sourcing Organizational... Outsourcing HR Transformation Employee Training Interviews Deferred Compensation HRIS See 15+     See less Talent Management Talent Acquisition Workforce Planning Employee Engagement Performance Management Employee Relations HR Consulting Human Resources Recruiting Change Management Succession Planning Employer Branding Team Leadership Leadership Personnel Management Strategy Coaching Management Organizational Design Onboarding Executive Coaching Executive Search Sourcing Organizational... Outsourcing HR Transformation Employee Training Interviews Deferred Compensation HRIS See 15+     See less "]}