{"position": "Director Strategy", "company": "IBM", "profiles": ["Skills Enterprise Content... Enterprise Software Cloud Computing SOA Software Development FileNet Software Engineering Java Java Enterprise Edition Enterprise Architecture Architecture System Architecture Unix SaaS IT Strategy Integration Software Project... Agile Methodologies Web Services Requirements Analysis Solution Architecture Agile Project Management Software Design Websphere Scrum Distributed Systems UML XML Weblogic Linux Object Oriented Design Pre-sales SDLC Oracle Architectures WebSphere See 21+     See less Skills  Enterprise Content... Enterprise Software Cloud Computing SOA Software Development FileNet Software Engineering Java Java Enterprise Edition Enterprise Architecture Architecture System Architecture Unix SaaS IT Strategy Integration Software Project... Agile Methodologies Web Services Requirements Analysis Solution Architecture Agile Project Management Software Design Websphere Scrum Distributed Systems UML XML Weblogic Linux Object Oriented Design Pre-sales SDLC Oracle Architectures WebSphere See 21+     See less Enterprise Content... Enterprise Software Cloud Computing SOA Software Development FileNet Software Engineering Java Java Enterprise Edition Enterprise Architecture Architecture System Architecture Unix SaaS IT Strategy Integration Software Project... Agile Methodologies Web Services Requirements Analysis Solution Architecture Agile Project Management Software Design Websphere Scrum Distributed Systems UML XML Weblogic Linux Object Oriented Design Pre-sales SDLC Oracle Architectures WebSphere See 21+     See less Enterprise Content... Enterprise Software Cloud Computing SOA Software Development FileNet Software Engineering Java Java Enterprise Edition Enterprise Architecture Architecture System Architecture Unix SaaS IT Strategy Integration Software Project... Agile Methodologies Web Services Requirements Analysis Solution Architecture Agile Project Management Software Design Websphere Scrum Distributed Systems UML XML Weblogic Linux Object Oriented Design Pre-sales SDLC Oracle Architectures WebSphere See 21+     See less ", "Experience Director Oil & Gas Strategy ibm October 2006  – Present (8 years 11 months) Dallas/Fort Worth Area David M. Womack is Global Director of Strategy and Business Development for IBM’s Chemicals & Petroleum (C&P) industries. In this role, Mr. Womack is responsible for identifying new market and solution opportunities, managing the development of the industry-specific solution portfolio, implementing go-to-market plans for business growth and leading alliances with key business partners associated with these strategies. \n \nMr. Womack is a member of IBM’s Industry Academy, an executive group of seasoned industry leaders whose focus is to drive competitive differentiation for IBM and to apply deep industry insights to influence both an industry and client transformation agenda. Mr. Womack is an author of several IBM industry studies and research projects as well as a speaker at industry conferences. \n \nPrior to his current assignment within IBM, Mr. Womack has held positions in the IBM Systems and Technology Group, IBM Software Group, and IBM Business Consulting Group. Prior to joining IBM Mr. Womack was the COO of Solomon Associates, a management consultancy in the downstream refining, chemicals and power generation industry.  \n \nMr Womack began his career with Exxon where he held a variety of management positions including finance, operations, maintenance and reliability, and technical disciplines.  \n \nMr. Womack holds a B.S. in Chemical Engineering and an MBA in Strategy. Director Oil & Gas Strategy ibm October 2006  – Present (8 years 11 months) Dallas/Fort Worth Area David M. Womack is Global Director of Strategy and Business Development for IBM’s Chemicals & Petroleum (C&P) industries. In this role, Mr. Womack is responsible for identifying new market and solution opportunities, managing the development of the industry-specific solution portfolio, implementing go-to-market plans for business growth and leading alliances with key business partners associated with these strategies. \n \nMr. Womack is a member of IBM’s Industry Academy, an executive group of seasoned industry leaders whose focus is to drive competitive differentiation for IBM and to apply deep industry insights to influence both an industry and client transformation agenda. Mr. Womack is an author of several IBM industry studies and research projects as well as a speaker at industry conferences. \n \nPrior to his current assignment within IBM, Mr. Womack has held positions in the IBM Systems and Technology Group, IBM Software Group, and IBM Business Consulting Group. Prior to joining IBM Mr. Womack was the COO of Solomon Associates, a management consultancy in the downstream refining, chemicals and power generation industry.  \n \nMr Womack began his career with Exxon where he held a variety of management positions including finance, operations, maintenance and reliability, and technical disciplines.  \n \nMr. Womack holds a B.S. in Chemical Engineering and an MBA in Strategy. Director Oil & Gas Strategy ibm October 2006  – Present (8 years 11 months) Dallas/Fort Worth Area David M. Womack is Global Director of Strategy and Business Development for IBM’s Chemicals & Petroleum (C&P) industries. In this role, Mr. Womack is responsible for identifying new market and solution opportunities, managing the development of the industry-specific solution portfolio, implementing go-to-market plans for business growth and leading alliances with key business partners associated with these strategies. \n \nMr. Womack is a member of IBM’s Industry Academy, an executive group of seasoned industry leaders whose focus is to drive competitive differentiation for IBM and to apply deep industry insights to influence both an industry and client transformation agenda. Mr. Womack is an author of several IBM industry studies and research projects as well as a speaker at industry conferences. \n \nPrior to his current assignment within IBM, Mr. Womack has held positions in the IBM Systems and Technology Group, IBM Software Group, and IBM Business Consulting Group. Prior to joining IBM Mr. Womack was the COO of Solomon Associates, a management consultancy in the downstream refining, chemicals and power generation industry.  \n \nMr Womack began his career with Exxon where he held a variety of management positions including finance, operations, maintenance and reliability, and technical disciplines.  \n \nMr. Womack holds a B.S. in Chemical Engineering and an MBA in Strategy. Skills Management Consulting Strategy Petroleum Management Marketing Strategy IT Strategy Business Transformation Solution Selling Leadership Skills  Management Consulting Strategy Petroleum Management Marketing Strategy IT Strategy Business Transformation Solution Selling Leadership Management Consulting Strategy Petroleum Management Marketing Strategy IT Strategy Business Transformation Solution Selling Leadership Management Consulting Strategy Petroleum Management Marketing Strategy IT Strategy Business Transformation Solution Selling Leadership Education Southern Methodist University - Cox School of Business 1996  – 1997 Southern Methodist University - Cox School of Business 1996  – 1997 Southern Methodist University - Cox School of Business 1996  – 1997 Southern Methodist University - Cox School of Business 1996  – 1997 ", "Skills Product Management Cross-functional Team... Competitive Analysis Go-to-market Strategy Strategic Partnerships Product Marketing Multi-channel Marketing Strategy Analytics Business Alliances Enterprise Software Management Program Management Business Development Marketing Skills  Product Management Cross-functional Team... Competitive Analysis Go-to-market Strategy Strategic Partnerships Product Marketing Multi-channel Marketing Strategy Analytics Business Alliances Enterprise Software Management Program Management Business Development Marketing Product Management Cross-functional Team... Competitive Analysis Go-to-market Strategy Strategic Partnerships Product Marketing Multi-channel Marketing Strategy Analytics Business Alliances Enterprise Software Management Program Management Business Development Marketing Product Management Cross-functional Team... Competitive Analysis Go-to-market Strategy Strategic Partnerships Product Marketing Multi-channel Marketing Strategy Analytics Business Alliances Enterprise Software Management Program Management Business Development Marketing ", "Summary Jeff is a seasoned SaaS and IT sales executive with a broad functional background and a proven track record of successfully growing and scaling recurring revenue businesses. His prior positions in marketing, strategy, services, support and finance have helped to groom Jeff's understanding of and appreciation for all of the various functions that must work seamlessly together to produce great sales results - that minimize acquisition costs, generate profitability long-term, and create loyal customers that drive more pipeline through cross-sells and referrals. \n \nJeff has held senior positions in technology companies of all shapes and sizes from seed-round (TrackVia) to acquisition (Hyperic, Corio), to IPO (Corio) and to large-cap (IBM, Oracle). He has successfully sold Tier 1 ERP, Hosting and Applications Management, Systems Monitoring & Management, Cloud-Based SaaS Applications, and Security SaaS. He has sold to Large Enterprises, strategic OEM's, SMB's, and Consumers. And, he has managed sales organizations ranging from $1M to $130M in recurring revenues that have had a multitude of combinations of inside, field, and channel-driven sales models.  \n \nThe following common denominators have been instrumental in helping Jeff to achieve success in each of these varied situations: \n* Recruiting high-energy, high IQ and adaptable sales VP’s, Directors and Account Executives.  \n* Leading by example to build content & sales tools, to train sellers to raise their competency & confidence in the field, and to sell alongside the AE's to see what resonates with customers. \n* Rolling out simple, standardized sales processes and performance metrics. \n* Steering the team to success through solid analytics and quick adaptability. \n* Establishing trusted relationships with team members, peers, customers, and partners. Summary Jeff is a seasoned SaaS and IT sales executive with a broad functional background and a proven track record of successfully growing and scaling recurring revenue businesses. His prior positions in marketing, strategy, services, support and finance have helped to groom Jeff's understanding of and appreciation for all of the various functions that must work seamlessly together to produce great sales results - that minimize acquisition costs, generate profitability long-term, and create loyal customers that drive more pipeline through cross-sells and referrals. \n \nJeff has held senior positions in technology companies of all shapes and sizes from seed-round (TrackVia) to acquisition (Hyperic, Corio), to IPO (Corio) and to large-cap (IBM, Oracle). He has successfully sold Tier 1 ERP, Hosting and Applications Management, Systems Monitoring & Management, Cloud-Based SaaS Applications, and Security SaaS. He has sold to Large Enterprises, strategic OEM's, SMB's, and Consumers. And, he has managed sales organizations ranging from $1M to $130M in recurring revenues that have had a multitude of combinations of inside, field, and channel-driven sales models.  \n \nThe following common denominators have been instrumental in helping Jeff to achieve success in each of these varied situations: \n* Recruiting high-energy, high IQ and adaptable sales VP’s, Directors and Account Executives.  \n* Leading by example to build content & sales tools, to train sellers to raise their competency & confidence in the field, and to sell alongside the AE's to see what resonates with customers. \n* Rolling out simple, standardized sales processes and performance metrics. \n* Steering the team to success through solid analytics and quick adaptability. \n* Establishing trusted relationships with team members, peers, customers, and partners. Jeff is a seasoned SaaS and IT sales executive with a broad functional background and a proven track record of successfully growing and scaling recurring revenue businesses. His prior positions in marketing, strategy, services, support and finance have helped to groom Jeff's understanding of and appreciation for all of the various functions that must work seamlessly together to produce great sales results - that minimize acquisition costs, generate profitability long-term, and create loyal customers that drive more pipeline through cross-sells and referrals. \n \nJeff has held senior positions in technology companies of all shapes and sizes from seed-round (TrackVia) to acquisition (Hyperic, Corio), to IPO (Corio) and to large-cap (IBM, Oracle). He has successfully sold Tier 1 ERP, Hosting and Applications Management, Systems Monitoring & Management, Cloud-Based SaaS Applications, and Security SaaS. He has sold to Large Enterprises, strategic OEM's, SMB's, and Consumers. And, he has managed sales organizations ranging from $1M to $130M in recurring revenues that have had a multitude of combinations of inside, field, and channel-driven sales models.  \n \nThe following common denominators have been instrumental in helping Jeff to achieve success in each of these varied situations: \n* Recruiting high-energy, high IQ and adaptable sales VP’s, Directors and Account Executives.  \n* Leading by example to build content & sales tools, to train sellers to raise their competency & confidence in the field, and to sell alongside the AE's to see what resonates with customers. \n* Rolling out simple, standardized sales processes and performance metrics. \n* Steering the team to success through solid analytics and quick adaptability. \n* Establishing trusted relationships with team members, peers, customers, and partners. Jeff is a seasoned SaaS and IT sales executive with a broad functional background and a proven track record of successfully growing and scaling recurring revenue businesses. His prior positions in marketing, strategy, services, support and finance have helped to groom Jeff's understanding of and appreciation for all of the various functions that must work seamlessly together to produce great sales results - that minimize acquisition costs, generate profitability long-term, and create loyal customers that drive more pipeline through cross-sells and referrals. \n \nJeff has held senior positions in technology companies of all shapes and sizes from seed-round (TrackVia) to acquisition (Hyperic, Corio), to IPO (Corio) and to large-cap (IBM, Oracle). He has successfully sold Tier 1 ERP, Hosting and Applications Management, Systems Monitoring & Management, Cloud-Based SaaS Applications, and Security SaaS. He has sold to Large Enterprises, strategic OEM's, SMB's, and Consumers. And, he has managed sales organizations ranging from $1M to $130M in recurring revenues that have had a multitude of combinations of inside, field, and channel-driven sales models.  \n \nThe following common denominators have been instrumental in helping Jeff to achieve success in each of these varied situations: \n* Recruiting high-energy, high IQ and adaptable sales VP’s, Directors and Account Executives.  \n* Leading by example to build content & sales tools, to train sellers to raise their competency & confidence in the field, and to sell alongside the AE's to see what resonates with customers. \n* Rolling out simple, standardized sales processes and performance metrics. \n* Steering the team to success through solid analytics and quick adaptability. \n* Establishing trusted relationships with team members, peers, customers, and partners. Experience SVP Enterprise Sales Apttus 2015  – Present (less than a year) Greater Denver Area Apttus is the category-defining Quote-to-Cash software company that drives the vital business process between the buyer’s interest in a purchase and the realization of revenue. Apttus is delivered on the Salesforce1 Platform. Applications include Configure-Price-Quote (CPQ), Renewals, Contract Management, Billing and Revenue Management, and E-Commerce. The company has over 500 enterprise customers (75 of the F500), offices across the globe, and multiple patents pending for its X-Author technology which allows Microsoft Office to be a user-interface with full interaction and control between Salesforce and Microsoft Office. Investors include Salesforce, ICONIQ, and K1 Capital. SVP WW Field Operations Webroot 2010  –  2014  (4 years) Greater Denver Area Webroot, one of the largest privately held security firms in North America, delivers cloud-architected security solutions across endpoint, mobile and network platforms targeted towards enterprises, strategic OEM's, SMBs, and consumers around the world.  \n \nDrove and managed the Webroot top-line across all products, business segments, and geographies. Recruited, managed, coached and trained a worldwide team of 125 responsible for lead qualification, direct inside sales, field/enterprise sales, OEM sales, alliances/channels, and sales operations across the Americas, EMEA, APAC, and Japan regions. \n \nLed major transformation of organization from a legacy security company reliant on perpetual license sales to a next-generation security firm delivering a cloud-powered security portfolio that generated subscription revenues. \n \nEnterprise Milestones: Seasoned in-field sales team focused on securing strategic wins in the Financial Services, Technology, and Mobile verticals for internal use, embedded OEM, and sell-through of Webroot's entire technology portfolio. Key wins included: Cisco Ironport, Sourcefire, and Meraki; F5 Networks, Aruba Networks, Palo Alto Networks, NEC, and RSA; HSBC, Barclays, Union Bank, Ally, Hang Seng, Garanti, BB&T, and FNB. \n \nSMB Milestones: Primarily inside sales & channel sellers secured over 7,500 SMB customers across the globe driving a high-volume, low-touch 30-day sales cycle with a 40% win-rate (qualified opp to win), and +80% renewal-rate. Focus on strategic channel relationships with MSP aggregators such as ConnectWise/LabTech fueled significant reach and momentum into the segment. \n \nConsumer Milestones: Small team of online and account managers that established Webroot as the market share leader at Best Buy and #1 security SKU on Amazon, supported by over 10,000 four- and five-star reviews. These achievements vaulted Webroot to the #1 position in North America Retail (from #7) . EVP Sales & Marketing TrackVia, Inc. 2009  –  2010  (1 year) Greater Denver Area TrackVia is the world's most secure, flexible, and scalable cloud database and application platform designed for Business Users and championed by IT. The firm has +1000 customers across the globe who have in aggregate +1B records under TrackVia management. Customer wins included Brinks, Honda, Healthways, US State Department, TSA, and Dow Jones. As EVP, responsibilities included managing Direct Sales, Marketing, and Business Development. \n \nDeparted TrackVia after being recruited to Webroot by former Hyperic Chairman and current Webroot CEO. Vice President of Sales Hyperic/SpringSource (Division of VMware) 2007  –  2009  (2 years) San Francisco Bay Area VMware acquired Hyperic/SpringSource in 2009 for $450M just after Hyperic, the leader in open-source web applications management for SaaS, Web-based, & Cloud-based businesses, combined with SpringSource, the leader in open source Java development, to create the leading Enterprise Java Application Lifecycle platform allowing developers to Build java applications (Spring Framework), Run those applications on Spring-optimized middleware (tcServer), and Manage those applications in production (Hyperic HQ). \n \n2009 to VMware Acquisition - VP SpringSource WorldWide Management Sales. \n \n2007 to 2009 - VP Hyperic WorldWide Sales, Business Development, Services & Support.  \n \nEstablished 3-pronged open-source methodology that combined (a) telesales (90% closed over the phone in <60 days), (b) traditional enterprise selling (multiple six-figure transactions), and (c) indirect (OEM and channel +30% of bookings). Drove +50% annualized subscription growth and +90% renewals.  \n \nCustomer wins included Salesforce, Twitter, Proofpoint, Census Bureau (Harris), First Citizens Bank, SPAWAR, Merrill Corp, Penske, British Telecom, and Shinsei Bank. Secured OEM and strategic alliances with partners that included Amazon, Google, Red Hat, Sun, SpringSource, Mulesource. \n \nOther achievements and milestones: Leveraged productized services to improve customer experience and maximize lock-in and wallet share. Prioritized the development of core training programs for sales, pre-sales, channel, and delivery teams. Increased close conversion (~30%), customer satisfaction, and renewal stickiness by enforcing consistency from pre-sales commits through post-sales support. Vice President (Corio), Director Strategy (IBM) IBM 1999  –  2007  (8 years) San Francisco Bay Area IBM acquired Corio, the leading publicly traded (Nasdaq: CRIO) Application Services Provider, in 2005 for $250M. Corio delivered “SaaS” before the coin was termed and was focused on automating the complex management of Tier 1 ERP applications such as SAP, Oracle, PeopleSoft, & Siebel to large enterprises for a monthly recurring fee. Customers included Department of Homeland Security, Nasdaq, US Coast Guard, American Express, General Motors, and Ingersoll Rand. \n \n2005-2007 - Director of strategy for IBM's $7 Billion Infrastructure Management Services group, encompassing Server, Storage, Security, Business Continuity, and Data Center services. Worked directly with the senior leadership team in Somers NY to accelerate knowledge transfer of Corio IP and productization approach across the GTS executive team, with a specific focus on automation and process standardization. Identified and executed several acquisitions including $70M Softek for the Storage business line, and managed internal and external consulting teams responsible for market mapping, segmentation, competitive assessments, and solutions strategy development. \n \n1999-2005 - Corio Vice President, leading a variety of functions including corporate development, business development, channels & alliances, marketing/sales enablement, and strategy over a tenure that spanned from pre-revenue, IPO in 2000, the dot-com bust, through to the IBM acquisition in 2005. Channel and business/corporate development achievements of note included completing two strategic acquisitions (Qwest Cyber Solutions, a joint venture between Qwest and KPMG, and Nexus, a leading SAP ASP competitor) that eventually accounted for +50% of total Corio revenues; and establishing an exclusive OEM partnership with AT&T that enabled ATT’s +3000 sales organization to sell AT&T-branded applications management capabilities powered by Corio. Director - Industry Solutions Marketing Oracle Corporation 1998  –  1999  (1 year) San Francisco Bay Area Led a team of 20 with a $15M annual budget that provided global support for a broad array of industries/verticals including Government/Public Sector, Discrete Manufacturing, Transportation, Media & Entertainment, and Publishing. Determined strategy and executed end-to-end industry-specific marketing campaigns (“Wrap Around Marketing”), which involved creating content and sales tools, executing coordinated demand creation campaigns, and managing customer programs to support demand activities. \n \nDeparted Oracle after being recruited to Corio by several former Oracle executives. Manager - Financial Institutions Group A.T. Kearney 1995  –  1998  (3 years) San Francisco Bay Area Strategy consultant working with C-level executives in the Financial Institutions vertical on strategic projects that spanned acquisition assessments, customer service redesigns, credit card and payment system design, business process re-engineering of commissions structures, and strategic sourcing. Clients included Prudential, Citicorp, Bank of America, AT&T Universal Card. SVP Enterprise Sales Apttus 2015  – Present (less than a year) Greater Denver Area Apttus is the category-defining Quote-to-Cash software company that drives the vital business process between the buyer’s interest in a purchase and the realization of revenue. Apttus is delivered on the Salesforce1 Platform. Applications include Configure-Price-Quote (CPQ), Renewals, Contract Management, Billing and Revenue Management, and E-Commerce. The company has over 500 enterprise customers (75 of the F500), offices across the globe, and multiple patents pending for its X-Author technology which allows Microsoft Office to be a user-interface with full interaction and control between Salesforce and Microsoft Office. Investors include Salesforce, ICONIQ, and K1 Capital. SVP Enterprise Sales Apttus 2015  – Present (less than a year) Greater Denver Area Apttus is the category-defining Quote-to-Cash software company that drives the vital business process between the buyer’s interest in a purchase and the realization of revenue. Apttus is delivered on the Salesforce1 Platform. Applications include Configure-Price-Quote (CPQ), Renewals, Contract Management, Billing and Revenue Management, and E-Commerce. The company has over 500 enterprise customers (75 of the F500), offices across the globe, and multiple patents pending for its X-Author technology which allows Microsoft Office to be a user-interface with full interaction and control between Salesforce and Microsoft Office. Investors include Salesforce, ICONIQ, and K1 Capital. SVP WW Field Operations Webroot 2010  –  2014  (4 years) Greater Denver Area Webroot, one of the largest privately held security firms in North America, delivers cloud-architected security solutions across endpoint, mobile and network platforms targeted towards enterprises, strategic OEM's, SMBs, and consumers around the world.  \n \nDrove and managed the Webroot top-line across all products, business segments, and geographies. Recruited, managed, coached and trained a worldwide team of 125 responsible for lead qualification, direct inside sales, field/enterprise sales, OEM sales, alliances/channels, and sales operations across the Americas, EMEA, APAC, and Japan regions. \n \nLed major transformation of organization from a legacy security company reliant on perpetual license sales to a next-generation security firm delivering a cloud-powered security portfolio that generated subscription revenues. \n \nEnterprise Milestones: Seasoned in-field sales team focused on securing strategic wins in the Financial Services, Technology, and Mobile verticals for internal use, embedded OEM, and sell-through of Webroot's entire technology portfolio. Key wins included: Cisco Ironport, Sourcefire, and Meraki; F5 Networks, Aruba Networks, Palo Alto Networks, NEC, and RSA; HSBC, Barclays, Union Bank, Ally, Hang Seng, Garanti, BB&T, and FNB. \n \nSMB Milestones: Primarily inside sales & channel sellers secured over 7,500 SMB customers across the globe driving a high-volume, low-touch 30-day sales cycle with a 40% win-rate (qualified opp to win), and +80% renewal-rate. Focus on strategic channel relationships with MSP aggregators such as ConnectWise/LabTech fueled significant reach and momentum into the segment. \n \nConsumer Milestones: Small team of online and account managers that established Webroot as the market share leader at Best Buy and #1 security SKU on Amazon, supported by over 10,000 four- and five-star reviews. These achievements vaulted Webroot to the #1 position in North America Retail (from #7) . SVP WW Field Operations Webroot 2010  –  2014  (4 years) Greater Denver Area Webroot, one of the largest privately held security firms in North America, delivers cloud-architected security solutions across endpoint, mobile and network platforms targeted towards enterprises, strategic OEM's, SMBs, and consumers around the world.  \n \nDrove and managed the Webroot top-line across all products, business segments, and geographies. Recruited, managed, coached and trained a worldwide team of 125 responsible for lead qualification, direct inside sales, field/enterprise sales, OEM sales, alliances/channels, and sales operations across the Americas, EMEA, APAC, and Japan regions. \n \nLed major transformation of organization from a legacy security company reliant on perpetual license sales to a next-generation security firm delivering a cloud-powered security portfolio that generated subscription revenues. \n \nEnterprise Milestones: Seasoned in-field sales team focused on securing strategic wins in the Financial Services, Technology, and Mobile verticals for internal use, embedded OEM, and sell-through of Webroot's entire technology portfolio. Key wins included: Cisco Ironport, Sourcefire, and Meraki; F5 Networks, Aruba Networks, Palo Alto Networks, NEC, and RSA; HSBC, Barclays, Union Bank, Ally, Hang Seng, Garanti, BB&T, and FNB. \n \nSMB Milestones: Primarily inside sales & channel sellers secured over 7,500 SMB customers across the globe driving a high-volume, low-touch 30-day sales cycle with a 40% win-rate (qualified opp to win), and +80% renewal-rate. Focus on strategic channel relationships with MSP aggregators such as ConnectWise/LabTech fueled significant reach and momentum into the segment. \n \nConsumer Milestones: Small team of online and account managers that established Webroot as the market share leader at Best Buy and #1 security SKU on Amazon, supported by over 10,000 four- and five-star reviews. These achievements vaulted Webroot to the #1 position in North America Retail (from #7) . EVP Sales & Marketing TrackVia, Inc. 2009  –  2010  (1 year) Greater Denver Area TrackVia is the world's most secure, flexible, and scalable cloud database and application platform designed for Business Users and championed by IT. The firm has +1000 customers across the globe who have in aggregate +1B records under TrackVia management. Customer wins included Brinks, Honda, Healthways, US State Department, TSA, and Dow Jones. As EVP, responsibilities included managing Direct Sales, Marketing, and Business Development. \n \nDeparted TrackVia after being recruited to Webroot by former Hyperic Chairman and current Webroot CEO. EVP Sales & Marketing TrackVia, Inc. 2009  –  2010  (1 year) Greater Denver Area TrackVia is the world's most secure, flexible, and scalable cloud database and application platform designed for Business Users and championed by IT. The firm has +1000 customers across the globe who have in aggregate +1B records under TrackVia management. Customer wins included Brinks, Honda, Healthways, US State Department, TSA, and Dow Jones. As EVP, responsibilities included managing Direct Sales, Marketing, and Business Development. \n \nDeparted TrackVia after being recruited to Webroot by former Hyperic Chairman and current Webroot CEO. Vice President of Sales Hyperic/SpringSource (Division of VMware) 2007  –  2009  (2 years) San Francisco Bay Area VMware acquired Hyperic/SpringSource in 2009 for $450M just after Hyperic, the leader in open-source web applications management for SaaS, Web-based, & Cloud-based businesses, combined with SpringSource, the leader in open source Java development, to create the leading Enterprise Java Application Lifecycle platform allowing developers to Build java applications (Spring Framework), Run those applications on Spring-optimized middleware (tcServer), and Manage those applications in production (Hyperic HQ). \n \n2009 to VMware Acquisition - VP SpringSource WorldWide Management Sales. \n \n2007 to 2009 - VP Hyperic WorldWide Sales, Business Development, Services & Support.  \n \nEstablished 3-pronged open-source methodology that combined (a) telesales (90% closed over the phone in <60 days), (b) traditional enterprise selling (multiple six-figure transactions), and (c) indirect (OEM and channel +30% of bookings). Drove +50% annualized subscription growth and +90% renewals.  \n \nCustomer wins included Salesforce, Twitter, Proofpoint, Census Bureau (Harris), First Citizens Bank, SPAWAR, Merrill Corp, Penske, British Telecom, and Shinsei Bank. Secured OEM and strategic alliances with partners that included Amazon, Google, Red Hat, Sun, SpringSource, Mulesource. \n \nOther achievements and milestones: Leveraged productized services to improve customer experience and maximize lock-in and wallet share. Prioritized the development of core training programs for sales, pre-sales, channel, and delivery teams. Increased close conversion (~30%), customer satisfaction, and renewal stickiness by enforcing consistency from pre-sales commits through post-sales support. Vice President of Sales Hyperic/SpringSource (Division of VMware) 2007  –  2009  (2 years) San Francisco Bay Area VMware acquired Hyperic/SpringSource in 2009 for $450M just after Hyperic, the leader in open-source web applications management for SaaS, Web-based, & Cloud-based businesses, combined with SpringSource, the leader in open source Java development, to create the leading Enterprise Java Application Lifecycle platform allowing developers to Build java applications (Spring Framework), Run those applications on Spring-optimized middleware (tcServer), and Manage those applications in production (Hyperic HQ). \n \n2009 to VMware Acquisition - VP SpringSource WorldWide Management Sales. \n \n2007 to 2009 - VP Hyperic WorldWide Sales, Business Development, Services & Support.  \n \nEstablished 3-pronged open-source methodology that combined (a) telesales (90% closed over the phone in <60 days), (b) traditional enterprise selling (multiple six-figure transactions), and (c) indirect (OEM and channel +30% of bookings). Drove +50% annualized subscription growth and +90% renewals.  \n \nCustomer wins included Salesforce, Twitter, Proofpoint, Census Bureau (Harris), First Citizens Bank, SPAWAR, Merrill Corp, Penske, British Telecom, and Shinsei Bank. Secured OEM and strategic alliances with partners that included Amazon, Google, Red Hat, Sun, SpringSource, Mulesource. \n \nOther achievements and milestones: Leveraged productized services to improve customer experience and maximize lock-in and wallet share. Prioritized the development of core training programs for sales, pre-sales, channel, and delivery teams. Increased close conversion (~30%), customer satisfaction, and renewal stickiness by enforcing consistency from pre-sales commits through post-sales support. Vice President (Corio), Director Strategy (IBM) IBM 1999  –  2007  (8 years) San Francisco Bay Area IBM acquired Corio, the leading publicly traded (Nasdaq: CRIO) Application Services Provider, in 2005 for $250M. Corio delivered “SaaS” before the coin was termed and was focused on automating the complex management of Tier 1 ERP applications such as SAP, Oracle, PeopleSoft, & Siebel to large enterprises for a monthly recurring fee. Customers included Department of Homeland Security, Nasdaq, US Coast Guard, American Express, General Motors, and Ingersoll Rand. \n \n2005-2007 - Director of strategy for IBM's $7 Billion Infrastructure Management Services group, encompassing Server, Storage, Security, Business Continuity, and Data Center services. Worked directly with the senior leadership team in Somers NY to accelerate knowledge transfer of Corio IP and productization approach across the GTS executive team, with a specific focus on automation and process standardization. Identified and executed several acquisitions including $70M Softek for the Storage business line, and managed internal and external consulting teams responsible for market mapping, segmentation, competitive assessments, and solutions strategy development. \n \n1999-2005 - Corio Vice President, leading a variety of functions including corporate development, business development, channels & alliances, marketing/sales enablement, and strategy over a tenure that spanned from pre-revenue, IPO in 2000, the dot-com bust, through to the IBM acquisition in 2005. Channel and business/corporate development achievements of note included completing two strategic acquisitions (Qwest Cyber Solutions, a joint venture between Qwest and KPMG, and Nexus, a leading SAP ASP competitor) that eventually accounted for +50% of total Corio revenues; and establishing an exclusive OEM partnership with AT&T that enabled ATT’s +3000 sales organization to sell AT&T-branded applications management capabilities powered by Corio. Vice President (Corio), Director Strategy (IBM) IBM 1999  –  2007  (8 years) San Francisco Bay Area IBM acquired Corio, the leading publicly traded (Nasdaq: CRIO) Application Services Provider, in 2005 for $250M. Corio delivered “SaaS” before the coin was termed and was focused on automating the complex management of Tier 1 ERP applications such as SAP, Oracle, PeopleSoft, & Siebel to large enterprises for a monthly recurring fee. Customers included Department of Homeland Security, Nasdaq, US Coast Guard, American Express, General Motors, and Ingersoll Rand. \n \n2005-2007 - Director of strategy for IBM's $7 Billion Infrastructure Management Services group, encompassing Server, Storage, Security, Business Continuity, and Data Center services. Worked directly with the senior leadership team in Somers NY to accelerate knowledge transfer of Corio IP and productization approach across the GTS executive team, with a specific focus on automation and process standardization. Identified and executed several acquisitions including $70M Softek for the Storage business line, and managed internal and external consulting teams responsible for market mapping, segmentation, competitive assessments, and solutions strategy development. \n \n1999-2005 - Corio Vice President, leading a variety of functions including corporate development, business development, channels & alliances, marketing/sales enablement, and strategy over a tenure that spanned from pre-revenue, IPO in 2000, the dot-com bust, through to the IBM acquisition in 2005. Channel and business/corporate development achievements of note included completing two strategic acquisitions (Qwest Cyber Solutions, a joint venture between Qwest and KPMG, and Nexus, a leading SAP ASP competitor) that eventually accounted for +50% of total Corio revenues; and establishing an exclusive OEM partnership with AT&T that enabled ATT’s +3000 sales organization to sell AT&T-branded applications management capabilities powered by Corio. Director - Industry Solutions Marketing Oracle Corporation 1998  –  1999  (1 year) San Francisco Bay Area Led a team of 20 with a $15M annual budget that provided global support for a broad array of industries/verticals including Government/Public Sector, Discrete Manufacturing, Transportation, Media & Entertainment, and Publishing. Determined strategy and executed end-to-end industry-specific marketing campaigns (“Wrap Around Marketing”), which involved creating content and sales tools, executing coordinated demand creation campaigns, and managing customer programs to support demand activities. \n \nDeparted Oracle after being recruited to Corio by several former Oracle executives. Director - Industry Solutions Marketing Oracle Corporation 1998  –  1999  (1 year) San Francisco Bay Area Led a team of 20 with a $15M annual budget that provided global support for a broad array of industries/verticals including Government/Public Sector, Discrete Manufacturing, Transportation, Media & Entertainment, and Publishing. Determined strategy and executed end-to-end industry-specific marketing campaigns (“Wrap Around Marketing”), which involved creating content and sales tools, executing coordinated demand creation campaigns, and managing customer programs to support demand activities. \n \nDeparted Oracle after being recruited to Corio by several former Oracle executives. Manager - Financial Institutions Group A.T. Kearney 1995  –  1998  (3 years) San Francisco Bay Area Strategy consultant working with C-level executives in the Financial Institutions vertical on strategic projects that spanned acquisition assessments, customer service redesigns, credit card and payment system design, business process re-engineering of commissions structures, and strategic sourcing. Clients included Prudential, Citicorp, Bank of America, AT&T Universal Card. Manager - Financial Institutions Group A.T. Kearney 1995  –  1998  (3 years) San Francisco Bay Area Strategy consultant working with C-level executives in the Financial Institutions vertical on strategic projects that spanned acquisition assessments, customer service redesigns, credit card and payment system design, business process re-engineering of commissions structures, and strategic sourcing. Clients included Prudential, Citicorp, Bank of America, AT&T Universal Card. Skills Business Development Cloud Computing Professional Services Data Center SDLC Management Strategy SaaS Lead Generation Start-ups Channel VMware Databases Direct Sales Business Alliances Strategic Partnerships Leadership ITIL Sales Enterprise Software Marketing Business Intelligence See 7+     See less Skills  Business Development Cloud Computing Professional Services Data Center SDLC Management Strategy SaaS Lead Generation Start-ups Channel VMware Databases Direct Sales Business Alliances Strategic Partnerships Leadership ITIL Sales Enterprise Software Marketing Business Intelligence See 7+     See less Business Development Cloud Computing Professional Services Data Center SDLC Management Strategy SaaS Lead Generation Start-ups Channel VMware Databases Direct Sales Business Alliances Strategic Partnerships Leadership ITIL Sales Enterprise Software Marketing Business Intelligence See 7+     See less Business Development Cloud Computing Professional Services Data Center SDLC Management Strategy SaaS Lead Generation Start-ups Channel VMware Databases Direct Sales Business Alliances Strategic Partnerships Leadership ITIL Sales Enterprise Software Marketing Business Intelligence See 7+     See less Education Northwestern University - Kellogg School of Management MBA 1994  – 1996 Northwestern University BA,  Economics 1987  – 1991 Northwestern University - Kellogg School of Management MBA 1994  – 1996 Northwestern University - Kellogg School of Management MBA 1994  – 1996 Northwestern University - Kellogg School of Management MBA 1994  – 1996 Northwestern University BA,  Economics 1987  – 1991 Northwestern University BA,  Economics 1987  – 1991 Northwestern University BA,  Economics 1987  – 1991 ", "Experience Director - Strategy and Business Development IBM April 2015  – Present (5 months) Chapel Hil, NC Leading strategy and business development for IBM Analytics for industries and domains. Responsible for acquisitions, partnerships, market strategy, and portfolio strategy. Director Product Management and Strategy - Big Data portfolio IBM August 2011  – Present (4 years 1 month) Information Management, IBM Software Group Special Projects for Senior Vice President IBM Software IBM July 2010  –  July 2011  (1 year 1 month) Program Director Strategy IBM July 2009  –  July 2010  (1 year 1 month) Director - Strategy and Business Development IBM April 2015  – Present (5 months) Chapel Hil, NC Leading strategy and business development for IBM Analytics for industries and domains. Responsible for acquisitions, partnerships, market strategy, and portfolio strategy. Director - Strategy and Business Development IBM April 2015  – Present (5 months) Chapel Hil, NC Leading strategy and business development for IBM Analytics for industries and domains. Responsible for acquisitions, partnerships, market strategy, and portfolio strategy. Director Product Management and Strategy - Big Data portfolio IBM August 2011  – Present (4 years 1 month) Information Management, IBM Software Group Director Product Management and Strategy - Big Data portfolio IBM August 2011  – Present (4 years 1 month) Information Management, IBM Software Group Special Projects for Senior Vice President IBM Software IBM July 2010  –  July 2011  (1 year 1 month) Special Projects for Senior Vice President IBM Software IBM July 2010  –  July 2011  (1 year 1 month) Program Director Strategy IBM July 2009  –  July 2010  (1 year 1 month) Program Director Strategy IBM July 2009  –  July 2010  (1 year 1 month) Education Yale University BA Activities and Societies:  Honors Yale University MBA,  Finance , Strategy Yale University BA Activities and Societies:  Honors Yale University BA Activities and Societies:  Honors Yale University BA Activities and Societies:  Honors Yale University MBA,  Finance , Strategy Yale University MBA,  Finance , Strategy Yale University MBA,  Finance , Strategy ", "Skills Business Strategy New Business Development Marketing Venture Capital Budget Business Development Entrepreneurship Start-ups Competitive Analysis Strategic Planning Budgets Strategy Market Research Strategic Partnerships Cloud Computing Program Management Mergers Enterprise Software Mergers & Acquisitions Channel Partners Product Management Direct Marketing Business Alliances Leadership Go-to-market Strategy Lead Generation Product Development Marketing Strategy Executive Management Demand Generation CRM SaaS Networking Online Advertising Sales Enablement Cross-functional Team... Brand Management Management Security Project Management Storage Business Analysis Business Intelligence Solution Selling Management Consulting Virtualization Product Marketing Managed Services Business Planning Thought Leadership See 35+     See less Skills  Business Strategy New Business Development Marketing Venture Capital Budget Business Development Entrepreneurship Start-ups Competitive Analysis Strategic Planning Budgets Strategy Market Research Strategic Partnerships Cloud Computing Program Management Mergers Enterprise Software Mergers & Acquisitions Channel Partners Product Management Direct Marketing Business Alliances Leadership Go-to-market Strategy Lead Generation Product Development Marketing Strategy Executive Management Demand Generation CRM SaaS Networking Online Advertising Sales Enablement Cross-functional Team... Brand Management Management Security Project Management Storage Business Analysis Business Intelligence Solution Selling Management Consulting Virtualization Product Marketing Managed Services Business Planning Thought Leadership See 35+     See less Business Strategy New Business Development Marketing Venture Capital Budget Business Development Entrepreneurship Start-ups Competitive Analysis Strategic Planning Budgets Strategy Market Research Strategic Partnerships Cloud Computing Program Management Mergers Enterprise Software Mergers & Acquisitions Channel Partners Product Management Direct Marketing Business Alliances Leadership Go-to-market Strategy Lead Generation Product Development Marketing Strategy Executive Management Demand Generation CRM SaaS Networking Online Advertising Sales Enablement Cross-functional Team... Brand Management Management Security Project Management Storage Business Analysis Business Intelligence Solution Selling Management Consulting Virtualization Product Marketing Managed Services Business Planning Thought Leadership See 35+     See less Business Strategy New Business Development Marketing Venture Capital Budget Business Development Entrepreneurship Start-ups Competitive Analysis Strategic Planning Budgets Strategy Market Research Strategic Partnerships Cloud Computing Program Management Mergers Enterprise Software Mergers & Acquisitions Channel Partners Product Management Direct Marketing Business Alliances Leadership Go-to-market Strategy Lead Generation Product Development Marketing Strategy Executive Management Demand Generation CRM SaaS Networking Online Advertising Sales Enablement Cross-functional Team... Brand Management Management Security Project Management Storage Business Analysis Business Intelligence Solution Selling Management Consulting Virtualization Product Marketing Managed Services Business Planning Thought Leadership See 35+     See less ", "Summary I have extensive experience in product marketing, product management, and corporate marketing roles at both early-stage and well-established companies such as IBM, Unica, SPSS, NetGenesis, and ClearForest. I also hold a B.S. in Management Sciences from MIT’s Sloan School of Management and a degree from the Sorbonne (Université de Paris IV). Specialties:* Product marketing, product strategy, and product management \n* Analyzing market opportunities  \n* Crafting product positioning \n* Defining and executing go to market plans \n* Creating product requirement documents Summary I have extensive experience in product marketing, product management, and corporate marketing roles at both early-stage and well-established companies such as IBM, Unica, SPSS, NetGenesis, and ClearForest. I also hold a B.S. in Management Sciences from MIT’s Sloan School of Management and a degree from the Sorbonne (Université de Paris IV). Specialties:* Product marketing, product strategy, and product management \n* Analyzing market opportunities  \n* Crafting product positioning \n* Defining and executing go to market plans \n* Creating product requirement documents I have extensive experience in product marketing, product management, and corporate marketing roles at both early-stage and well-established companies such as IBM, Unica, SPSS, NetGenesis, and ClearForest. I also hold a B.S. in Management Sciences from MIT’s Sloan School of Management and a degree from the Sorbonne (Université de Paris IV). Specialties:* Product marketing, product strategy, and product management \n* Analyzing market opportunities  \n* Crafting product positioning \n* Defining and executing go to market plans \n* Creating product requirement documents I have extensive experience in product marketing, product management, and corporate marketing roles at both early-stage and well-established companies such as IBM, Unica, SPSS, NetGenesis, and ClearForest. I also hold a B.S. in Management Sciences from MIT’s Sloan School of Management and a degree from the Sorbonne (Université de Paris IV). Specialties:* Product marketing, product strategy, and product management \n* Analyzing market opportunities  \n* Crafting product positioning \n* Defining and executing go to market plans \n* Creating product requirement documents Skills Product Strategy Product Marketing Product Management Enterprise Software SaaS Marketing Strategy Strategic Planning Sales Enablement Product Requirements Business Development Demand Generation B2B Marketing Mobile Marketing Strategy Competitive Analysis Web Analytics Enterprise Marketing Analytics Unica Mergers & Acquisitions Marketing Go-to-market Strategy Strategic Partnerships Multi-channel Marketing Digital Marketing Marketing Automation Positioning Segmentation Lead Generation See 14+     See less Skills  Product Strategy Product Marketing Product Management Enterprise Software SaaS Marketing Strategy Strategic Planning Sales Enablement Product Requirements Business Development Demand Generation B2B Marketing Mobile Marketing Strategy Competitive Analysis Web Analytics Enterprise Marketing Analytics Unica Mergers & Acquisitions Marketing Go-to-market Strategy Strategic Partnerships Multi-channel Marketing Digital Marketing Marketing Automation Positioning Segmentation Lead Generation See 14+     See less Product Strategy Product Marketing Product Management Enterprise Software SaaS Marketing Strategy Strategic Planning Sales Enablement Product Requirements Business Development Demand Generation B2B Marketing Mobile Marketing Strategy Competitive Analysis Web Analytics Enterprise Marketing Analytics Unica Mergers & Acquisitions Marketing Go-to-market Strategy Strategic Partnerships Multi-channel Marketing Digital Marketing Marketing Automation Positioning Segmentation Lead Generation See 14+     See less Product Strategy Product Marketing Product Management Enterprise Software SaaS Marketing Strategy Strategic Planning Sales Enablement Product Requirements Business Development Demand Generation B2B Marketing Mobile Marketing Strategy Competitive Analysis Web Analytics Enterprise Marketing Analytics Unica Mergers & Acquisitions Marketing Go-to-market Strategy Strategic Partnerships Multi-channel Marketing Digital Marketing Marketing Automation Positioning Segmentation Lead Generation See 14+     See less ", "Skills Marketing Integrated Marketing Customer Insight Online Advertising Financial Services New Business Development CRM Marketing Strategy Market Research Digital Media Multi-channel Marketing Advertising Business Development Strategy Start-ups Competitive Analysis Direct Marketing Strategic Partnerships Business Strategy Entrepreneurship Social Media Online Marketing Social Networking Digital Marketing Small Business Brand Management Mobile Marketing Brand Development Email Marketing Interactive Marketing Analytics Digital Strategy See 17+     See less Skills  Marketing Integrated Marketing Customer Insight Online Advertising Financial Services New Business Development CRM Marketing Strategy Market Research Digital Media Multi-channel Marketing Advertising Business Development Strategy Start-ups Competitive Analysis Direct Marketing Strategic Partnerships Business Strategy Entrepreneurship Social Media Online Marketing Social Networking Digital Marketing Small Business Brand Management Mobile Marketing Brand Development Email Marketing Interactive Marketing Analytics Digital Strategy See 17+     See less Marketing Integrated Marketing Customer Insight Online Advertising Financial Services New Business Development CRM Marketing Strategy Market Research Digital Media Multi-channel Marketing Advertising Business Development Strategy Start-ups Competitive Analysis Direct Marketing Strategic Partnerships Business Strategy Entrepreneurship Social Media Online Marketing Social Networking Digital Marketing Small Business Brand Management Mobile Marketing Brand Development Email Marketing Interactive Marketing Analytics Digital Strategy See 17+     See less Marketing Integrated Marketing Customer Insight Online Advertising Financial Services New Business Development CRM Marketing Strategy Market Research Digital Media Multi-channel Marketing Advertising Business Development Strategy Start-ups Competitive Analysis Direct Marketing Strategic Partnerships Business Strategy Entrepreneurship Social Media Online Marketing Social Networking Digital Marketing Small Business Brand Management Mobile Marketing Brand Development Email Marketing Interactive Marketing Analytics Digital Strategy See 17+     See less ", "Summary • Has held multiple leadership positions in customer facing and staff roles  \n• Customer engagement management & sales skills \n• Skilled at solution development  \n• Significant market management, strategy development, operational experience \n• Extensive international experience, gained through assignments in Asia and Latin America Specialties:Creating, launching, and operating complex alliances in the telecom and IT marketplace Summary • Has held multiple leadership positions in customer facing and staff roles  \n• Customer engagement management & sales skills \n• Skilled at solution development  \n• Significant market management, strategy development, operational experience \n• Extensive international experience, gained through assignments in Asia and Latin America Specialties:Creating, launching, and operating complex alliances in the telecom and IT marketplace • Has held multiple leadership positions in customer facing and staff roles  \n• Customer engagement management & sales skills \n• Skilled at solution development  \n• Significant market management, strategy development, operational experience \n• Extensive international experience, gained through assignments in Asia and Latin America Specialties:Creating, launching, and operating complex alliances in the telecom and IT marketplace • Has held multiple leadership positions in customer facing and staff roles  \n• Customer engagement management & sales skills \n• Skilled at solution development  \n• Significant market management, strategy development, operational experience \n• Extensive international experience, gained through assignments in Asia and Latin America Specialties:Creating, launching, and operating complex alliances in the telecom and IT marketplace Experience Telecommunications Industry Alliance Executive IBM January 2009  – Present (6 years 8 months) Responsible for worldwide alliance development between IBM and network equipment providers for the telecom carrier market. Scope includes Technology and offering development, market development, marketing, and sales management. Program Director, Strategy IBM April 2004  –  July 2007  (3 years 4 months) I managed the Websphere Strategy team. We lead development of the the strategy and strategic initiatives and ensure execution through the management system and routes to market.  \n \nIn my last position I was a Partner in Strategy and Change in the BCS Telco Practice. I have extensive experience with IBM Global Services, having managed various organizations, P&L's, operations, and strategy. Launched start-ups of new services businesses. I have international experience, gained through assignments in Asia and Latin America. Partner IBM Global Services 2000  –  2004  (4 years) Telecom Industry Strategy and Change Consulting Partner Director, Business Integration Services IBM 1999  –  2000  (1 year) Singapore Telecommunications Industry Alliance Executive IBM January 2009  – Present (6 years 8 months) Responsible for worldwide alliance development between IBM and network equipment providers for the telecom carrier market. Scope includes Technology and offering development, market development, marketing, and sales management. Telecommunications Industry Alliance Executive IBM January 2009  – Present (6 years 8 months) Responsible for worldwide alliance development between IBM and network equipment providers for the telecom carrier market. Scope includes Technology and offering development, market development, marketing, and sales management. Program Director, Strategy IBM April 2004  –  July 2007  (3 years 4 months) I managed the Websphere Strategy team. We lead development of the the strategy and strategic initiatives and ensure execution through the management system and routes to market.  \n \nIn my last position I was a Partner in Strategy and Change in the BCS Telco Practice. I have extensive experience with IBM Global Services, having managed various organizations, P&L's, operations, and strategy. Launched start-ups of new services businesses. I have international experience, gained through assignments in Asia and Latin America. Program Director, Strategy IBM April 2004  –  July 2007  (3 years 4 months) I managed the Websphere Strategy team. We lead development of the the strategy and strategic initiatives and ensure execution through the management system and routes to market.  \n \nIn my last position I was a Partner in Strategy and Change in the BCS Telco Practice. I have extensive experience with IBM Global Services, having managed various organizations, P&L's, operations, and strategy. Launched start-ups of new services businesses. I have international experience, gained through assignments in Asia and Latin America. Partner IBM Global Services 2000  –  2004  (4 years) Telecom Industry Strategy and Change Consulting Partner Partner IBM Global Services 2000  –  2004  (4 years) Telecom Industry Strategy and Change Consulting Partner Director, Business Integration Services IBM 1999  –  2000  (1 year) Singapore Director, Business Integration Services IBM 1999  –  2000  (1 year) Singapore Languages Greek Spanish Greek Spanish Greek Spanish Skills Business Alliances Business Development Solution Selling Start-ups Strategy Go-to-market Strategy Telecommunications Strategic Planning Outsourcing Enterprise Software Channel Partners SaaS CRM Integration Cloud Computing Product Development Business Intelligence Project Management Management Leadership Cross-functional Team... Business Strategy IT Strategy Marketing Management Consulting Professional Services See 11+     See less Skills  Business Alliances Business Development Solution Selling Start-ups Strategy Go-to-market Strategy Telecommunications Strategic Planning Outsourcing Enterprise Software Channel Partners SaaS CRM Integration Cloud Computing Product Development Business Intelligence Project Management Management Leadership Cross-functional Team... Business Strategy IT Strategy Marketing Management Consulting Professional Services See 11+     See less Business Alliances Business Development Solution Selling Start-ups Strategy Go-to-market Strategy Telecommunications Strategic Planning Outsourcing Enterprise Software Channel Partners SaaS CRM Integration Cloud Computing Product Development Business Intelligence Project Management Management Leadership Cross-functional Team... Business Strategy IT Strategy Marketing Management Consulting Professional Services See 11+     See less Business Alliances Business Development Solution Selling Start-ups Strategy Go-to-market Strategy Telecommunications Strategic Planning Outsourcing Enterprise Software Channel Partners SaaS CRM Integration Cloud Computing Product Development Business Intelligence Project Management Management Leadership Cross-functional Team... Business Strategy IT Strategy Marketing Management Consulting Professional Services See 11+     See less Education Purdue University - Krannert School of Management Masters,  Management 1990  – 1991 University of Illinois at Urbana-Champaign BA,  Economics 1975  – 1978 Activities and Societies:  Sigma Phi Epsilon - President\nInter Fraternity Council - VP PR\nU of I Student advisory Committees\nThe Southwestern Company student sales manager Purdue University - Krannert School of Management Masters,  Management 1990  – 1991 Purdue University - Krannert School of Management Masters,  Management 1990  – 1991 Purdue University - Krannert School of Management Masters,  Management 1990  – 1991 University of Illinois at Urbana-Champaign BA,  Economics 1975  – 1978 Activities and Societies:  Sigma Phi Epsilon - President\nInter Fraternity Council - VP PR\nU of I Student advisory Committees\nThe Southwestern Company student sales manager University of Illinois at Urbana-Champaign BA,  Economics 1975  – 1978 Activities and Societies:  Sigma Phi Epsilon - President\nInter Fraternity Council - VP PR\nU of I Student advisory Committees\nThe Southwestern Company student sales manager University of Illinois at Urbana-Champaign BA,  Economics 1975  – 1978 Activities and Societies:  Sigma Phi Epsilon - President\nInter Fraternity Council - VP PR\nU of I Student advisory Committees\nThe Southwestern Company student sales manager ", "Summary Experienced Strategy, Competitive Intelligence, Market Insights, Product Development Executive and Board Member. Always open to new roles that require an innovative strategy leader to drive improved business performance based on data analytics and superior competitive strategies and tactics. Past experience in all aspects of strategy development, marketing and IT product development across software, hardware, IT services and financing.  \n \nSpecialties: Strategy Development, Competitive Intelligence, Competitive Analysis, Market Insights, Market Intelligence, Financial Analysis, Due Diligence, Data Analytics. Summary Experienced Strategy, Competitive Intelligence, Market Insights, Product Development Executive and Board Member. Always open to new roles that require an innovative strategy leader to drive improved business performance based on data analytics and superior competitive strategies and tactics. Past experience in all aspects of strategy development, marketing and IT product development across software, hardware, IT services and financing.  \n \nSpecialties: Strategy Development, Competitive Intelligence, Competitive Analysis, Market Insights, Market Intelligence, Financial Analysis, Due Diligence, Data Analytics. Experienced Strategy, Competitive Intelligence, Market Insights, Product Development Executive and Board Member. Always open to new roles that require an innovative strategy leader to drive improved business performance based on data analytics and superior competitive strategies and tactics. Past experience in all aspects of strategy development, marketing and IT product development across software, hardware, IT services and financing.  \n \nSpecialties: Strategy Development, Competitive Intelligence, Competitive Analysis, Market Insights, Market Intelligence, Financial Analysis, Due Diligence, Data Analytics. Experienced Strategy, Competitive Intelligence, Market Insights, Product Development Executive and Board Member. Always open to new roles that require an innovative strategy leader to drive improved business performance based on data analytics and superior competitive strategies and tactics. Past experience in all aspects of strategy development, marketing and IT product development across software, hardware, IT services and financing.  \n \nSpecialties: Strategy Development, Competitive Intelligence, Competitive Analysis, Market Insights, Market Intelligence, Financial Analysis, Due Diligence, Data Analytics. Experience Director of Strategy, Product and Offering Development IBM July 2015  – Present (2 months) Leads the global strategy development process for IBM’s Global Financing (IGF) business unit. \n \nGuides the innovation and development of new financial products and offerings, and accelerating their rollout in support of IBM's new business units. Director of Strategy for IBM Global Financing IBM January 2011  –  June 2015  (4 years 6 months) Armonk, NY Leads strategy development for IBM’s Global Financing (IGF) business unit. This includes directing the strategy and operational planning cycles, driving initiatives that are focused on key business metrics (originations growth, profit and ROE) and in growth markets (Africa), ensuring IGF strategies are communicated effectively to both internal and external stakeholders, and engaging senior leaders across IBM to drive a differentiated client experience.  \n \nDrives analytics projects that have strengthened IGF’s value proposition with brand sellers and improved seller effectiveness. \n \nGuides the market insights team supporting IGF in delivering relevant, timely and actionable insights about the market, customers and competitors. Trustee, Board of Education Rhinebeck Central School district 2004  –  2013  (9 years) I was fortunate to serve my community for nine years -- and three elected terms -- as a Trustee of the Rhinebeck Central School District’s Board of Education.  \n \nIn that role, I served as board president for 2 years and VP for 5 years; chaired the Citizen’s Facilities Advisory Board which led to successful passage of a $23M bond referendum supporting the construction of the District’s new auditorium, athletic fields, kindergarten classrooms, and science room renovations; was involved in hiring/replacing all 7 of our administrators below the Superintendent level; strengthened the role of our finance committee and the budgeting process; enhanced the function of the audit committee; represented the board and district at various New York State School Boards Association (NYSSBA) events, on the executive committee of the Dutchess County School Boards Association (DCSBA), and as ex-officio board member to the Rhinebeck Science Foundation (RSF) -- an external foundation that has provided over $250K in grant funding to the district over the past 5 years.  \n \nThe board has become one that makes student-centered and data-informed decisions, keeps focused on big long-term goals, and expects to be able to hold administrators and staff accountable for results. Manager, Competitive Intelligence IBM 2005  –  2010  (5 years) Senior Market Intelligence Manager in IBM’s Worldwide Market Intelligence community. Led a reshaping of IBM’s competitive intelligence focus and expansion of its capabilities to assess non-traditional and emerging competitors. Created predictive targeting tool to identify competitor’s client accounts likely to switch to IBM. Developed model to forecast and explain competitors’ revenue and profit through 2015, with compare/contrast to projected market growth rates and other market leading vendors. Strategy Manager IBM Global Services 2001  –  2005  (4 years) Strategy leader for IBM’s hosting business unit, which grew revenues 5x -- to well over $1B -- across a four year period. Led the creation of strategic business designs for both hosting and a related utility-services unit, and participated on the taskforce which led to IBM’s e-business On Demand initiative in 2002. Competitive Intelligence Analyst IBM 1993  –  2001  (8 years) Competitive strategist and intelligence analyst in IBM’s Global Services and Systems Groups, covering competitors such as Exodus Communications, Hitachi, Hewlett-Packard, and SGI. Published several articles and given external talks on various aspects of corporate competitive intelligence. Engineer IBM 1982  –  1993  (11 years) Development engineer and engineering manager at IBM in its Large Systems Division. Wrote microcode, tested system recovery features of the zSeries server -- known then as the 3090 -- and helped design the switch hardware inside the first-generation RS/6000 SP parallel supercomputer, a predecessor to the Deep Blue and Blue Gene supercomputing systems and the Watson cognitive computing system. Held various positions in product development, strategy, marketing and management. Director of Strategy, Product and Offering Development IBM July 2015  – Present (2 months) Leads the global strategy development process for IBM’s Global Financing (IGF) business unit. \n \nGuides the innovation and development of new financial products and offerings, and accelerating their rollout in support of IBM's new business units. Director of Strategy, Product and Offering Development IBM July 2015  – Present (2 months) Leads the global strategy development process for IBM’s Global Financing (IGF) business unit. \n \nGuides the innovation and development of new financial products and offerings, and accelerating their rollout in support of IBM's new business units. Director of Strategy for IBM Global Financing IBM January 2011  –  June 2015  (4 years 6 months) Armonk, NY Leads strategy development for IBM’s Global Financing (IGF) business unit. This includes directing the strategy and operational planning cycles, driving initiatives that are focused on key business metrics (originations growth, profit and ROE) and in growth markets (Africa), ensuring IGF strategies are communicated effectively to both internal and external stakeholders, and engaging senior leaders across IBM to drive a differentiated client experience.  \n \nDrives analytics projects that have strengthened IGF’s value proposition with brand sellers and improved seller effectiveness. \n \nGuides the market insights team supporting IGF in delivering relevant, timely and actionable insights about the market, customers and competitors. Director of Strategy for IBM Global Financing IBM January 2011  –  June 2015  (4 years 6 months) Armonk, NY Leads strategy development for IBM’s Global Financing (IGF) business unit. This includes directing the strategy and operational planning cycles, driving initiatives that are focused on key business metrics (originations growth, profit and ROE) and in growth markets (Africa), ensuring IGF strategies are communicated effectively to both internal and external stakeholders, and engaging senior leaders across IBM to drive a differentiated client experience.  \n \nDrives analytics projects that have strengthened IGF’s value proposition with brand sellers and improved seller effectiveness. \n \nGuides the market insights team supporting IGF in delivering relevant, timely and actionable insights about the market, customers and competitors. Trustee, Board of Education Rhinebeck Central School district 2004  –  2013  (9 years) I was fortunate to serve my community for nine years -- and three elected terms -- as a Trustee of the Rhinebeck Central School District’s Board of Education.  \n \nIn that role, I served as board president for 2 years and VP for 5 years; chaired the Citizen’s Facilities Advisory Board which led to successful passage of a $23M bond referendum supporting the construction of the District’s new auditorium, athletic fields, kindergarten classrooms, and science room renovations; was involved in hiring/replacing all 7 of our administrators below the Superintendent level; strengthened the role of our finance committee and the budgeting process; enhanced the function of the audit committee; represented the board and district at various New York State School Boards Association (NYSSBA) events, on the executive committee of the Dutchess County School Boards Association (DCSBA), and as ex-officio board member to the Rhinebeck Science Foundation (RSF) -- an external foundation that has provided over $250K in grant funding to the district over the past 5 years.  \n \nThe board has become one that makes student-centered and data-informed decisions, keeps focused on big long-term goals, and expects to be able to hold administrators and staff accountable for results. Trustee, Board of Education Rhinebeck Central School district 2004  –  2013  (9 years) I was fortunate to serve my community for nine years -- and three elected terms -- as a Trustee of the Rhinebeck Central School District’s Board of Education.  \n \nIn that role, I served as board president for 2 years and VP for 5 years; chaired the Citizen’s Facilities Advisory Board which led to successful passage of a $23M bond referendum supporting the construction of the District’s new auditorium, athletic fields, kindergarten classrooms, and science room renovations; was involved in hiring/replacing all 7 of our administrators below the Superintendent level; strengthened the role of our finance committee and the budgeting process; enhanced the function of the audit committee; represented the board and district at various New York State School Boards Association (NYSSBA) events, on the executive committee of the Dutchess County School Boards Association (DCSBA), and as ex-officio board member to the Rhinebeck Science Foundation (RSF) -- an external foundation that has provided over $250K in grant funding to the district over the past 5 years.  \n \nThe board has become one that makes student-centered and data-informed decisions, keeps focused on big long-term goals, and expects to be able to hold administrators and staff accountable for results. Manager, Competitive Intelligence IBM 2005  –  2010  (5 years) Senior Market Intelligence Manager in IBM’s Worldwide Market Intelligence community. Led a reshaping of IBM’s competitive intelligence focus and expansion of its capabilities to assess non-traditional and emerging competitors. Created predictive targeting tool to identify competitor’s client accounts likely to switch to IBM. Developed model to forecast and explain competitors’ revenue and profit through 2015, with compare/contrast to projected market growth rates and other market leading vendors. Manager, Competitive Intelligence IBM 2005  –  2010  (5 years) Senior Market Intelligence Manager in IBM’s Worldwide Market Intelligence community. Led a reshaping of IBM’s competitive intelligence focus and expansion of its capabilities to assess non-traditional and emerging competitors. Created predictive targeting tool to identify competitor’s client accounts likely to switch to IBM. Developed model to forecast and explain competitors’ revenue and profit through 2015, with compare/contrast to projected market growth rates and other market leading vendors. Strategy Manager IBM Global Services 2001  –  2005  (4 years) Strategy leader for IBM’s hosting business unit, which grew revenues 5x -- to well over $1B -- across a four year period. Led the creation of strategic business designs for both hosting and a related utility-services unit, and participated on the taskforce which led to IBM’s e-business On Demand initiative in 2002. Strategy Manager IBM Global Services 2001  –  2005  (4 years) Strategy leader for IBM’s hosting business unit, which grew revenues 5x -- to well over $1B -- across a four year period. Led the creation of strategic business designs for both hosting and a related utility-services unit, and participated on the taskforce which led to IBM’s e-business On Demand initiative in 2002. Competitive Intelligence Analyst IBM 1993  –  2001  (8 years) Competitive strategist and intelligence analyst in IBM’s Global Services and Systems Groups, covering competitors such as Exodus Communications, Hitachi, Hewlett-Packard, and SGI. Published several articles and given external talks on various aspects of corporate competitive intelligence. Competitive Intelligence Analyst IBM 1993  –  2001  (8 years) Competitive strategist and intelligence analyst in IBM’s Global Services and Systems Groups, covering competitors such as Exodus Communications, Hitachi, Hewlett-Packard, and SGI. Published several articles and given external talks on various aspects of corporate competitive intelligence. Engineer IBM 1982  –  1993  (11 years) Development engineer and engineering manager at IBM in its Large Systems Division. Wrote microcode, tested system recovery features of the zSeries server -- known then as the 3090 -- and helped design the switch hardware inside the first-generation RS/6000 SP parallel supercomputer, a predecessor to the Deep Blue and Blue Gene supercomputing systems and the Watson cognitive computing system. Held various positions in product development, strategy, marketing and management. Engineer IBM 1982  –  1993  (11 years) Development engineer and engineering manager at IBM in its Large Systems Division. Wrote microcode, tested system recovery features of the zSeries server -- known then as the 3090 -- and helped design the switch hardware inside the first-generation RS/6000 SP parallel supercomputer, a predecessor to the Deep Blue and Blue Gene supercomputing systems and the Watson cognitive computing system. Held various positions in product development, strategy, marketing and management. Languages English Native or bilingual proficiency German Limited working proficiency Russian Elementary proficiency English Native or bilingual proficiency German Limited working proficiency Russian Elementary proficiency English Native or bilingual proficiency German Limited working proficiency Russian Elementary proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Competitive Intelligence Strategy Market Intelligence Competitive Analysis Analysis Leadership Business Strategy Financial Analysis Product Development Segmentation Cross-functional Team... Management Cloud Computing Program Management Management Consulting New Business Development Strategic Planning Strategic Thinking Marketing Research Business Planning Go-to-market Strategy Product Management Analytics Business Intelligence Strategic Partnerships Product Marketing CRM Business Development Market Analysis Business Analysis Start-ups Consulting Executive Management IT Strategy Business Process... Outsourcing Marketing Management See 22+     See less Skills  Competitive Intelligence Strategy Market Intelligence Competitive Analysis Analysis Leadership Business Strategy Financial Analysis Product Development Segmentation Cross-functional Team... Management Cloud Computing Program Management Management Consulting New Business Development Strategic Planning Strategic Thinking Marketing Research Business Planning Go-to-market Strategy Product Management Analytics Business Intelligence Strategic Partnerships Product Marketing CRM Business Development Market Analysis Business Analysis Start-ups Consulting Executive Management IT Strategy Business Process... Outsourcing Marketing Management See 22+     See less Competitive Intelligence Strategy Market Intelligence Competitive Analysis Analysis Leadership Business Strategy Financial Analysis Product Development Segmentation Cross-functional Team... Management Cloud Computing Program Management Management Consulting New Business Development Strategic Planning Strategic Thinking Marketing Research Business Planning Go-to-market Strategy Product Management Analytics Business Intelligence Strategic Partnerships Product Marketing CRM Business Development Market Analysis Business Analysis Start-ups Consulting Executive Management IT Strategy Business Process... Outsourcing Marketing Management See 22+     See less Competitive Intelligence Strategy Market Intelligence Competitive Analysis Analysis Leadership Business Strategy Financial Analysis Product Development Segmentation Cross-functional Team... Management Cloud Computing Program Management Management Consulting New Business Development Strategic Planning Strategic Thinking Marketing Research Business Planning Go-to-market Strategy Product Management Analytics Business Intelligence Strategic Partnerships Product Marketing CRM Business Development Market Analysis Business Analysis Start-ups Consulting Executive Management IT Strategy Business Process... Outsourcing Marketing Management See 22+     See less Education State University of New York at New Paltz Certificate of Advanced Study,  School District Business Leadership (SDBL) 2009 National Technological University MS,  Management of Technology Syracuse University MS,  Electrical Engineering University of Pennsylvania BS,  Computer Engineering State University of New York at New Paltz Certificate of Advanced Study,  School District Business Leadership (SDBL) 2009 State University of New York at New Paltz Certificate of Advanced Study,  School District Business Leadership (SDBL) 2009 State University of New York at New Paltz Certificate of Advanced Study,  School District Business Leadership (SDBL) 2009 National Technological University MS,  Management of Technology National Technological University MS,  Management of Technology National Technological University MS,  Management of Technology Syracuse University MS,  Electrical Engineering Syracuse University MS,  Electrical Engineering Syracuse University MS,  Electrical Engineering University of Pennsylvania BS,  Computer Engineering University of Pennsylvania BS,  Computer Engineering University of Pennsylvania BS,  Computer Engineering ", "Experience Vice President, Strategy and Transformation IBM Global Technology Services March 2015  – Present (6 months) Vice President, Global Strategy IBM Global Technology Services September 2011  –  February 2015  (3 years 6 months) Somers, NY Director of Strategy IBM Global Technology Services August 2008  –  September 2011  (3 years 2 months) Manager, Pricing Strategy & Complex Deals IBM Software Group July 2007  –  August 2008  (1 year 2 months) Manager IBM Corporate Finance May 2004  –  June 2006  (2 years 2 months) Manager / Principal Consultant IBM Business Consulting Services 2002  –  2003  (1 year) Principal Consultant PricewaterhouseCoopers August 1997  –  October 2002  (5 years 3 months) Analyst MCA Research Corporation 1996  –  1997  (1 year) Operations Research Engineer Lockheed Martin 1995  –  1997  (2 years) Vice President, Strategy and Transformation IBM Global Technology Services March 2015  – Present (6 months) Vice President, Strategy and Transformation IBM Global Technology Services March 2015  – Present (6 months) Vice President, Global Strategy IBM Global Technology Services September 2011  –  February 2015  (3 years 6 months) Somers, NY Vice President, Global Strategy IBM Global Technology Services September 2011  –  February 2015  (3 years 6 months) Somers, NY Director of Strategy IBM Global Technology Services August 2008  –  September 2011  (3 years 2 months) Director of Strategy IBM Global Technology Services August 2008  –  September 2011  (3 years 2 months) Manager, Pricing Strategy & Complex Deals IBM Software Group July 2007  –  August 2008  (1 year 2 months) Manager, Pricing Strategy & Complex Deals IBM Software Group July 2007  –  August 2008  (1 year 2 months) Manager IBM Corporate Finance May 2004  –  June 2006  (2 years 2 months) Manager IBM Corporate Finance May 2004  –  June 2006  (2 years 2 months) Manager / Principal Consultant IBM Business Consulting Services 2002  –  2003  (1 year) Manager / Principal Consultant IBM Business Consulting Services 2002  –  2003  (1 year) Principal Consultant PricewaterhouseCoopers August 1997  –  October 2002  (5 years 3 months) Principal Consultant PricewaterhouseCoopers August 1997  –  October 2002  (5 years 3 months) Analyst MCA Research Corporation 1996  –  1997  (1 year) Analyst MCA Research Corporation 1996  –  1997  (1 year) Operations Research Engineer Lockheed Martin 1995  –  1997  (2 years) Operations Research Engineer Lockheed Martin 1995  –  1997  (2 years) Skills Business Transformation Management Consulting IT Strategy Integration Strategy Business Process... Capital Markets Strategic Financial... Financial Analysis Federal Government Airports Airspace Management Finance Enterprise Software Strategic Partnerships Solution Selling Business Process Acquisition Integration Professional Services Business Analysis Analytics Consulting Business Intelligence SaaS Cloud Computing See 10+     See less Skills  Business Transformation Management Consulting IT Strategy Integration Strategy Business Process... Capital Markets Strategic Financial... Financial Analysis Federal Government Airports Airspace Management Finance Enterprise Software Strategic Partnerships Solution Selling Business Process Acquisition Integration Professional Services Business Analysis Analytics Consulting Business Intelligence SaaS Cloud Computing See 10+     See less Business Transformation Management Consulting IT Strategy Integration Strategy Business Process... Capital Markets Strategic Financial... Financial Analysis Federal Government Airports Airspace Management Finance Enterprise Software Strategic Partnerships Solution Selling Business Process Acquisition Integration Professional Services Business Analysis Analytics Consulting Business Intelligence SaaS Cloud Computing See 10+     See less Business Transformation Management Consulting IT Strategy Integration Strategy Business Process... Capital Markets Strategic Financial... Financial Analysis Federal Government Airports Airspace Management Finance Enterprise Software Strategic Partnerships Solution Selling Business Process Acquisition Integration Professional Services Business Analysis Analytics Consulting Business Intelligence SaaS Cloud Computing See 10+     See less Education New York University - Leonard N. Stern School of Business MBA,  Finance 2000  – 2002 Executive Program Activities and Societies:  With Honors ,  Beta Sigma Gama Stony Brook University BS,  Economics & Business 1990  – 1994 Activities and Societies:  President ,  Tau Kappa Epsilon Fraternity\nDeans List New York University - Leonard N. Stern School of Business MBA,  Finance 2000  – 2002 Executive Program Activities and Societies:  With Honors ,  Beta Sigma Gama New York University - Leonard N. Stern School of Business MBA,  Finance 2000  – 2002 Executive Program Activities and Societies:  With Honors ,  Beta Sigma Gama New York University - Leonard N. Stern School of Business MBA,  Finance 2000  – 2002 Executive Program Activities and Societies:  With Honors ,  Beta Sigma Gama Stony Brook University BS,  Economics & Business 1990  – 1994 Activities and Societies:  President ,  Tau Kappa Epsilon Fraternity\nDeans List Stony Brook University BS,  Economics & Business 1990  – 1994 Activities and Societies:  President ,  Tau Kappa Epsilon Fraternity\nDeans List Stony Brook University BS,  Economics & Business 1990  – 1994 Activities and Societies:  President ,  Tau Kappa Epsilon Fraternity\nDeans List ", "Summary I worked my way up from a junior software developer to a senior executive with a proven track record in product management, product development, and strategic management. My experiences are a composite of many customer engagements, new product development projects using new technologies, leading strategic initiatives that transformed markets, and transforming organizations. I am considered a quick and eager learner with sharp analytical skills and technology know-how. Motivating and empowering organizations comes naturally, which allows my organization to achieve business objectives aligned with a bold strategic agenda with minimal churn and maximal innovation, efficiency and effectiveness. \n \nCore Skills and Experience Themes: \n- Strategy formulation and alignment, especially aligning business, market and technology strategies. \n- Business governance architecture and business and investment performance management systems. \n- Market strategy and product management: market segmentation, product line strategy, portfolio management, marketing management, channel strategy, sales program design, business development, ecosystem design and development. \n- All aspects of software product development: business, people, process, quality, software engineering management and methods. And related services offerings. \n- Seizing new technologies and delivering innovative new software products that exploit the technologies to competitive advantage in the market. Summary I worked my way up from a junior software developer to a senior executive with a proven track record in product management, product development, and strategic management. My experiences are a composite of many customer engagements, new product development projects using new technologies, leading strategic initiatives that transformed markets, and transforming organizations. I am considered a quick and eager learner with sharp analytical skills and technology know-how. Motivating and empowering organizations comes naturally, which allows my organization to achieve business objectives aligned with a bold strategic agenda with minimal churn and maximal innovation, efficiency and effectiveness. \n \nCore Skills and Experience Themes: \n- Strategy formulation and alignment, especially aligning business, market and technology strategies. \n- Business governance architecture and business and investment performance management systems. \n- Market strategy and product management: market segmentation, product line strategy, portfolio management, marketing management, channel strategy, sales program design, business development, ecosystem design and development. \n- All aspects of software product development: business, people, process, quality, software engineering management and methods. And related services offerings. \n- Seizing new technologies and delivering innovative new software products that exploit the technologies to competitive advantage in the market. I worked my way up from a junior software developer to a senior executive with a proven track record in product management, product development, and strategic management. My experiences are a composite of many customer engagements, new product development projects using new technologies, leading strategic initiatives that transformed markets, and transforming organizations. I am considered a quick and eager learner with sharp analytical skills and technology know-how. Motivating and empowering organizations comes naturally, which allows my organization to achieve business objectives aligned with a bold strategic agenda with minimal churn and maximal innovation, efficiency and effectiveness. \n \nCore Skills and Experience Themes: \n- Strategy formulation and alignment, especially aligning business, market and technology strategies. \n- Business governance architecture and business and investment performance management systems. \n- Market strategy and product management: market segmentation, product line strategy, portfolio management, marketing management, channel strategy, sales program design, business development, ecosystem design and development. \n- All aspects of software product development: business, people, process, quality, software engineering management and methods. And related services offerings. \n- Seizing new technologies and delivering innovative new software products that exploit the technologies to competitive advantage in the market. I worked my way up from a junior software developer to a senior executive with a proven track record in product management, product development, and strategic management. My experiences are a composite of many customer engagements, new product development projects using new technologies, leading strategic initiatives that transformed markets, and transforming organizations. I am considered a quick and eager learner with sharp analytical skills and technology know-how. Motivating and empowering organizations comes naturally, which allows my organization to achieve business objectives aligned with a bold strategic agenda with minimal churn and maximal innovation, efficiency and effectiveness. \n \nCore Skills and Experience Themes: \n- Strategy formulation and alignment, especially aligning business, market and technology strategies. \n- Business governance architecture and business and investment performance management systems. \n- Market strategy and product management: market segmentation, product line strategy, portfolio management, marketing management, channel strategy, sales program design, business development, ecosystem design and development. \n- All aspects of software product development: business, people, process, quality, software engineering management and methods. And related services offerings. \n- Seizing new technologies and delivering innovative new software products that exploit the technologies to competitive advantage in the market. Skills Market Strategy Enterprise Software Product Management IT Strategy Business Strategy Middleware Software Development Software Engineering Marketing Strategy OSLC Strategy Cross-functional Team... Integration Integrated Marketing Requirements Analysis SOA Program Management Product Development Business Development CRM Cloud Computing Software Project... Architecture Competitive Analysis Mobile Applications Mobile Devices Strategic Planning Marketing Management SaaS Leadership Telecommunications Team Building Management Enterprise Architecture Process Improvement Project Portfolio... Go-to-market Strategy Business Intelligence Solution Architecture Governance Business Process Professional Services Sales Enablement Pre-sales See 29+     See less Skills  Market Strategy Enterprise Software Product Management IT Strategy Business Strategy Middleware Software Development Software Engineering Marketing Strategy OSLC Strategy Cross-functional Team... Integration Integrated Marketing Requirements Analysis SOA Program Management Product Development Business Development CRM Cloud Computing Software Project... Architecture Competitive Analysis Mobile Applications Mobile Devices Strategic Planning Marketing Management SaaS Leadership Telecommunications Team Building Management Enterprise Architecture Process Improvement Project Portfolio... Go-to-market Strategy Business Intelligence Solution Architecture Governance Business Process Professional Services Sales Enablement Pre-sales See 29+     See less Market Strategy Enterprise Software Product Management IT Strategy Business Strategy Middleware Software Development Software Engineering Marketing Strategy OSLC Strategy Cross-functional Team... Integration Integrated Marketing Requirements Analysis SOA Program Management Product Development Business Development CRM Cloud Computing Software Project... Architecture Competitive Analysis Mobile Applications Mobile Devices Strategic Planning Marketing Management SaaS Leadership Telecommunications Team Building Management Enterprise Architecture Process Improvement Project Portfolio... Go-to-market Strategy Business Intelligence Solution Architecture Governance Business Process Professional Services Sales Enablement Pre-sales See 29+     See less Market Strategy Enterprise Software Product Management IT Strategy Business Strategy Middleware Software Development Software Engineering Marketing Strategy OSLC Strategy Cross-functional Team... Integration Integrated Marketing Requirements Analysis SOA Program Management Product Development Business Development CRM Cloud Computing Software Project... Architecture Competitive Analysis Mobile Applications Mobile Devices Strategic Planning Marketing Management SaaS Leadership Telecommunications Team Building Management Enterprise Architecture Process Improvement Project Portfolio... Go-to-market Strategy Business Intelligence Solution Architecture Governance Business Process Professional Services Sales Enablement Pre-sales See 29+     See less ", "Summary Product management and technical sales professional with more than 20 years experience in the information technology industry.  \n \nCurrently, Director of Worldwide Ecosystem Technical Enablement for IBM's Systems and Technology Group. Responsible for leading technical enablement in support of software vendor/system integrator partnerships worldwide. \nSpecialties: Strategy, product management, business development and sales support. Summary Product management and technical sales professional with more than 20 years experience in the information technology industry.  \n \nCurrently, Director of Worldwide Ecosystem Technical Enablement for IBM's Systems and Technology Group. Responsible for leading technical enablement in support of software vendor/system integrator partnerships worldwide. \nSpecialties: Strategy, product management, business development and sales support. Product management and technical sales professional with more than 20 years experience in the information technology industry.  \n \nCurrently, Director of Worldwide Ecosystem Technical Enablement for IBM's Systems and Technology Group. Responsible for leading technical enablement in support of software vendor/system integrator partnerships worldwide. \nSpecialties: Strategy, product management, business development and sales support. Product management and technical sales professional with more than 20 years experience in the information technology industry.  \n \nCurrently, Director of Worldwide Ecosystem Technical Enablement for IBM's Systems and Technology Group. Responsible for leading technical enablement in support of software vendor/system integrator partnerships worldwide. \nSpecialties: Strategy, product management, business development and sales support. Experience Director, Ecosystem Technical Enablement IBM Systems and Technology Group February 2013  – Present (2 years 7 months) Shanghai, China Responsible for leading worldwide organization to support both global and regional software vendor and system integrator partnerships. Responsibilities include: \n- Build out of organization of architects and IT specialists across emerging markets including China, Central Europe, Africa and Latin America. \n- Definition and roll out of governance processes and supporting systems for mission. \n- Successful collaboration with worldwide sales, marketing and brand teams to ensure achievement of revenue and expense objectives. \n- Skills transfer to local GMU teams. \n- Communication of insights derived from partnerships to worldwide and regional teams. Director, Strategy IBM Tivoli Software January 2008  –  February 2013  (5 years 2 months) Responsible for business strategy for IBM Tivoli Software division. Responsibilities include: \n- Definition of requirements and functional direction for product portfolio generating $3 billion in annual revenue. \n- Market analysis, competitive assessments and prioritization of product development. \n- Lead for Agile process transformation of development team \n- Pricing and sales channel strategies. \n- Business development including partnership and acquisition strategy. Director, Product Management IBM Tivoli Software January 2003  –  January 2008  (5 years 1 month) Austin, Texas Area Responsible for product management of several Tivoli software product families. Managed team of product managers responsible for: \n- Product requirements, definition of product releases and new product concepts. \n- Product-family level P&L. \n- Market and competitive analysis specific to product families. \n- Support of sales in communicating product strategy and direction. Director, Websphere Marketing Programs IBM September 2000  –  January 2003  (2 years 5 months) Responsible for marketing WebSphere Business Process Integration software including CrossWorlds and MQ Workflow. \n- Managed team responsible for all aspects of marketing programs to drive $200 million in revenue. \n- Led post-acquisition integration of CrossWorlds, Metamerge and Holosofx marketing programs teams into IBM. \n- Integrated 12-person telesales operation into IBM teleweb structure. \n- Developed and executed analyst relations plan for WebSphere Business Integration and emerging technologies. Program Director IBM February 1999  –  September 2000  (1 year 8 months) Led development of strategic partnerships for Global Small Business division. \n- Leading member of team responsible for acquisition of Whistle Communications in June 1999. \n- Defined and launched Application Service Provider partnering strategy. Manager, e-business Marketing Projects IBM January 1996  –  February 1999  (3 years 2 months) - Leading member of teams that researched, developed and launched IBM’s e-business marketing initiative. \n- Led funding, content development, execution and measurement of 1998 e-business Forum, a worldwide, 43-city marketing event that significantly expanded market awareness of e-business. Brand Manager, Internet Connection Software IBM December 1994  –  January 1996  (1 year 2 months) Brand manager for family of web client and server products.  \n- Developed business case for software family and obtained $14 million in corporate funding. \n- Defined marketing plan and managed plan execution to achieve revenue and expense objectives. \n- Established product identity through product packaging, training materials, web-based information and collateral. Director, Ecosystem Technical Enablement IBM Systems and Technology Group February 2013  – Present (2 years 7 months) Shanghai, China Responsible for leading worldwide organization to support both global and regional software vendor and system integrator partnerships. Responsibilities include: \n- Build out of organization of architects and IT specialists across emerging markets including China, Central Europe, Africa and Latin America. \n- Definition and roll out of governance processes and supporting systems for mission. \n- Successful collaboration with worldwide sales, marketing and brand teams to ensure achievement of revenue and expense objectives. \n- Skills transfer to local GMU teams. \n- Communication of insights derived from partnerships to worldwide and regional teams. Director, Ecosystem Technical Enablement IBM Systems and Technology Group February 2013  – Present (2 years 7 months) Shanghai, China Responsible for leading worldwide organization to support both global and regional software vendor and system integrator partnerships. Responsibilities include: \n- Build out of organization of architects and IT specialists across emerging markets including China, Central Europe, Africa and Latin America. \n- Definition and roll out of governance processes and supporting systems for mission. \n- Successful collaboration with worldwide sales, marketing and brand teams to ensure achievement of revenue and expense objectives. \n- Skills transfer to local GMU teams. \n- Communication of insights derived from partnerships to worldwide and regional teams. Director, Strategy IBM Tivoli Software January 2008  –  February 2013  (5 years 2 months) Responsible for business strategy for IBM Tivoli Software division. Responsibilities include: \n- Definition of requirements and functional direction for product portfolio generating $3 billion in annual revenue. \n- Market analysis, competitive assessments and prioritization of product development. \n- Lead for Agile process transformation of development team \n- Pricing and sales channel strategies. \n- Business development including partnership and acquisition strategy. Director, Strategy IBM Tivoli Software January 2008  –  February 2013  (5 years 2 months) Responsible for business strategy for IBM Tivoli Software division. Responsibilities include: \n- Definition of requirements and functional direction for product portfolio generating $3 billion in annual revenue. \n- Market analysis, competitive assessments and prioritization of product development. \n- Lead for Agile process transformation of development team \n- Pricing and sales channel strategies. \n- Business development including partnership and acquisition strategy. Director, Product Management IBM Tivoli Software January 2003  –  January 2008  (5 years 1 month) Austin, Texas Area Responsible for product management of several Tivoli software product families. Managed team of product managers responsible for: \n- Product requirements, definition of product releases and new product concepts. \n- Product-family level P&L. \n- Market and competitive analysis specific to product families. \n- Support of sales in communicating product strategy and direction. Director, Product Management IBM Tivoli Software January 2003  –  January 2008  (5 years 1 month) Austin, Texas Area Responsible for product management of several Tivoli software product families. Managed team of product managers responsible for: \n- Product requirements, definition of product releases and new product concepts. \n- Product-family level P&L. \n- Market and competitive analysis specific to product families. \n- Support of sales in communicating product strategy and direction. Director, Websphere Marketing Programs IBM September 2000  –  January 2003  (2 years 5 months) Responsible for marketing WebSphere Business Process Integration software including CrossWorlds and MQ Workflow. \n- Managed team responsible for all aspects of marketing programs to drive $200 million in revenue. \n- Led post-acquisition integration of CrossWorlds, Metamerge and Holosofx marketing programs teams into IBM. \n- Integrated 12-person telesales operation into IBM teleweb structure. \n- Developed and executed analyst relations plan for WebSphere Business Integration and emerging technologies. Director, Websphere Marketing Programs IBM September 2000  –  January 2003  (2 years 5 months) Responsible for marketing WebSphere Business Process Integration software including CrossWorlds and MQ Workflow. \n- Managed team responsible for all aspects of marketing programs to drive $200 million in revenue. \n- Led post-acquisition integration of CrossWorlds, Metamerge and Holosofx marketing programs teams into IBM. \n- Integrated 12-person telesales operation into IBM teleweb structure. \n- Developed and executed analyst relations plan for WebSphere Business Integration and emerging technologies. Program Director IBM February 1999  –  September 2000  (1 year 8 months) Led development of strategic partnerships for Global Small Business division. \n- Leading member of team responsible for acquisition of Whistle Communications in June 1999. \n- Defined and launched Application Service Provider partnering strategy. Program Director IBM February 1999  –  September 2000  (1 year 8 months) Led development of strategic partnerships for Global Small Business division. \n- Leading member of team responsible for acquisition of Whistle Communications in June 1999. \n- Defined and launched Application Service Provider partnering strategy. Manager, e-business Marketing Projects IBM January 1996  –  February 1999  (3 years 2 months) - Leading member of teams that researched, developed and launched IBM’s e-business marketing initiative. \n- Led funding, content development, execution and measurement of 1998 e-business Forum, a worldwide, 43-city marketing event that significantly expanded market awareness of e-business. Manager, e-business Marketing Projects IBM January 1996  –  February 1999  (3 years 2 months) - Leading member of teams that researched, developed and launched IBM’s e-business marketing initiative. \n- Led funding, content development, execution and measurement of 1998 e-business Forum, a worldwide, 43-city marketing event that significantly expanded market awareness of e-business. Brand Manager, Internet Connection Software IBM December 1994  –  January 1996  (1 year 2 months) Brand manager for family of web client and server products.  \n- Developed business case for software family and obtained $14 million in corporate funding. \n- Defined marketing plan and managed plan execution to achieve revenue and expense objectives. \n- Established product identity through product packaging, training materials, web-based information and collateral. Brand Manager, Internet Connection Software IBM December 1994  –  January 1996  (1 year 2 months) Brand manager for family of web client and server products.  \n- Developed business case for software family and obtained $14 million in corporate funding. \n- Defined marketing plan and managed plan execution to achieve revenue and expense objectives. \n- Established product identity through product packaging, training materials, web-based information and collateral. Languages English Native or bilingual proficiency Spanish Full professional proficiency Mandarin Elementary proficiency English Native or bilingual proficiency Spanish Full professional proficiency Mandarin Elementary proficiency English Native or bilingual proficiency Spanish Full professional proficiency Mandarin Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills Product Management Business Development Strategy Marketing Product Development Pricing Market Analysis Sales Enablement Enterprise Software SaaS Go-to-market Strategy Cloud Computing Channel Pre-sales Solution Selling Product Marketing Sales Operations Marketing Management IT Strategy Strategic Partnerships Cross-functional Team... Management Competitive Analysis CRM Channel Partners IBM Tivoli Integration Start-ups Multi-channel Marketing Sales Leadership See 16+     See less Skills  Product Management Business Development Strategy Marketing Product Development Pricing Market Analysis Sales Enablement Enterprise Software SaaS Go-to-market Strategy Cloud Computing Channel Pre-sales Solution Selling Product Marketing Sales Operations Marketing Management IT Strategy Strategic Partnerships Cross-functional Team... Management Competitive Analysis CRM Channel Partners IBM Tivoli Integration Start-ups Multi-channel Marketing Sales Leadership See 16+     See less Product Management Business Development Strategy Marketing Product Development Pricing Market Analysis Sales Enablement Enterprise Software SaaS Go-to-market Strategy Cloud Computing Channel Pre-sales Solution Selling Product Marketing Sales Operations Marketing Management IT Strategy Strategic Partnerships Cross-functional Team... Management Competitive Analysis CRM Channel Partners IBM Tivoli Integration Start-ups Multi-channel Marketing Sales Leadership See 16+     See less Product Management Business Development Strategy Marketing Product Development Pricing Market Analysis Sales Enablement Enterprise Software SaaS Go-to-market Strategy Cloud Computing Channel Pre-sales Solution Selling Product Marketing Sales Operations Marketing Management IT Strategy Strategic Partnerships Cross-functional Team... Management Competitive Analysis CRM Channel Partners IBM Tivoli Integration Start-ups Multi-channel Marketing Sales Leadership See 16+     See less Education Christian Brothers Academy Syracuse University BS,  Journalism Syracuse University MS,  Information Management University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA Christian Brothers Academy Christian Brothers Academy Christian Brothers Academy Syracuse University BS,  Journalism Syracuse University BS,  Journalism Syracuse University BS,  Journalism Syracuse University MS,  Information Management Syracuse University MS,  Information Management Syracuse University MS,  Information Management University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA ", "Skills Management Consulting Business Strategy Change Management Negotiation Talent Management Process Management Enterprise Risk... Governance Business Process... Risk Management Strategic Planning Leadership Outsourcing Organizational Design Business Process Design Team Management Executive Management Business Analysis IT Strategy Process Improvement Business Intelligence Organizational... Business Process Business Transformation Strategy Management Team Leadership PMO Program Management Performance Management Cross-functional Team... CRM ERP Project Portfolio... Consulting Operations Management Vendor Management Coaching Leadership Development Analytics Six Sigma See 26+     See less Skills  Management Consulting Business Strategy Change Management Negotiation Talent Management Process Management Enterprise Risk... Governance Business Process... Risk Management Strategic Planning Leadership Outsourcing Organizational Design Business Process Design Team Management Executive Management Business Analysis IT Strategy Process Improvement Business Intelligence Organizational... Business Process Business Transformation Strategy Management Team Leadership PMO Program Management Performance Management Cross-functional Team... CRM ERP Project Portfolio... Consulting Operations Management Vendor Management Coaching Leadership Development Analytics Six Sigma See 26+     See less Management Consulting Business Strategy Change Management Negotiation Talent Management Process Management Enterprise Risk... Governance Business Process... Risk Management Strategic Planning Leadership Outsourcing Organizational Design Business Process Design Team Management Executive Management Business Analysis IT Strategy Process Improvement Business Intelligence Organizational... Business Process Business Transformation Strategy Management Team Leadership PMO Program Management Performance Management Cross-functional Team... CRM ERP Project Portfolio... Consulting Operations Management Vendor Management Coaching Leadership Development Analytics Six Sigma See 26+     See less Management Consulting Business Strategy Change Management Negotiation Talent Management Process Management Enterprise Risk... Governance Business Process... Risk Management Strategic Planning Leadership Outsourcing Organizational Design Business Process Design Team Management Executive Management Business Analysis IT Strategy Process Improvement Business Intelligence Organizational... Business Process Business Transformation Strategy Management Team Leadership PMO Program Management Performance Management Cross-functional Team... CRM ERP Project Portfolio... Consulting Operations Management Vendor Management Coaching Leadership Development Analytics Six Sigma See 26+     See less Honors & Awards ", "Experience Retired IBM Executive Independent researcher August 2012  – Present (3 years 1 month) Director of Strategy IBM February 2009  –  July 2012  (3 years 6 months) Director of Strategy IBM Corporate Strategy February 2009  –  July 2012  (3 years 6 months) CTO, IBM Greater China Group IBM October 2005  –  December 2008  (3 years 3 months) Research Staff Member IBM Thomas J. Watson Research Center 1977  –  2008  (31 years) Research Staff Member IBM Thomas J. Watson Research Center 1977  –  2008  (31 years) Director of IBM China Research Lab IBM October 1998  –  October 2005  (7 years 1 month) Research Strategy, staffing the best talent, public relations, client interactions Lab Director IBM Research - China 1999  –  2005  (6 years) Research staff and Director of China Lab IBM Research 1977  –  2005  (28 years) Research Staff Member and Management IBM T.J. Watson Research Center 1977  –  1999  (22 years) President, Chairman of the Board, Board member, Teacher Northern Westchester Chinese School 1985  –  1998  (13 years) Westchester, New York Various volunteering positions at Northern Westchester Chinese School Retired IBM Executive Independent researcher August 2012  – Present (3 years 1 month) Retired IBM Executive Independent researcher August 2012  – Present (3 years 1 month) Director of Strategy IBM February 2009  –  July 2012  (3 years 6 months) Director of Strategy IBM February 2009  –  July 2012  (3 years 6 months) Director of Strategy IBM Corporate Strategy February 2009  –  July 2012  (3 years 6 months) Director of Strategy IBM Corporate Strategy February 2009  –  July 2012  (3 years 6 months) CTO, IBM Greater China Group IBM October 2005  –  December 2008  (3 years 3 months) CTO, IBM Greater China Group IBM October 2005  –  December 2008  (3 years 3 months) Research Staff Member IBM Thomas J. Watson Research Center 1977  –  2008  (31 years) Research Staff Member IBM Thomas J. Watson Research Center 1977  –  2008  (31 years) Research Staff Member IBM Thomas J. Watson Research Center 1977  –  2008  (31 years) Research Staff Member IBM Thomas J. Watson Research Center 1977  –  2008  (31 years) Director of IBM China Research Lab IBM October 1998  –  October 2005  (7 years 1 month) Research Strategy, staffing the best talent, public relations, client interactions Director of IBM China Research Lab IBM October 1998  –  October 2005  (7 years 1 month) Research Strategy, staffing the best talent, public relations, client interactions Lab Director IBM Research - China 1999  –  2005  (6 years) Lab Director IBM Research - China 1999  –  2005  (6 years) Research staff and Director of China Lab IBM Research 1977  –  2005  (28 years) Research staff and Director of China Lab IBM Research 1977  –  2005  (28 years) Research Staff Member and Management IBM T.J. Watson Research Center 1977  –  1999  (22 years) Research Staff Member and Management IBM T.J. Watson Research Center 1977  –  1999  (22 years) President, Chairman of the Board, Board member, Teacher Northern Westchester Chinese School 1985  –  1998  (13 years) Westchester, New York Various volunteering positions at Northern Westchester Chinese School President, Chairman of the Board, Board member, Teacher Northern Westchester Chinese School 1985  –  1998  (13 years) Westchester, New York Various volunteering positions at Northern Westchester Chinese School Skills Business Strategy Cloud Computing Strategy Development Strategic Planning R&D IT Strategy Strategy Management Research Cross-functional Team... Program Management Product Management Strategic Partnerships Skills  Business Strategy Cloud Computing Strategy Development Strategic Planning R&D IT Strategy Strategy Management Research Cross-functional Team... Program Management Product Management Strategic Partnerships Business Strategy Cloud Computing Strategy Development Strategic Planning R&D IT Strategy Strategy Management Research Cross-functional Team... Program Management Product Management Strategic Partnerships Business Strategy Cloud Computing Strategy Development Strategic Planning R&D IT Strategy Strategy Management Research Cross-functional Team... Program Management Product Management Strategic Partnerships Education University of Pennsylvania PhD,  Physics 1970  – 1975 Activities and Societies:  American Physical Society ,  American Vacuum Society National Taiwan University BS,  Physics 1965  – 1969 Activities and Societies:  National Taiwan University Chorus Associated High School of National Normal University High School 1959  – 1965 Great Time University of Pennsylvania PhD,  Physics 1970  – 1975 Activities and Societies:  American Physical Society ,  American Vacuum Society University of Pennsylvania PhD,  Physics 1970  – 1975 Activities and Societies:  American Physical Society ,  American Vacuum Society University of Pennsylvania PhD,  Physics 1970  – 1975 Activities and Societies:  American Physical Society ,  American Vacuum Society National Taiwan University BS,  Physics 1965  – 1969 Activities and Societies:  National Taiwan University Chorus National Taiwan University BS,  Physics 1965  – 1969 Activities and Societies:  National Taiwan University Chorus National Taiwan University BS,  Physics 1965  – 1969 Activities and Societies:  National Taiwan University Chorus Associated High School of National Normal University High School 1959  – 1965 Great Time Associated High School of National Normal University High School 1959  – 1965 Great Time Associated High School of National Normal University High School 1959  – 1965 Great Time ", "Summary Megan Dalla-Camina is a business, creative and leadership strategist, and a globally recognised speaker, coach and writer on women, leadership and wellbeing. Having worked in the international business environment for 20 years, she has driven strategies for multi-billion dollar corporations like GE, PwC and IBM in Australia, Asia and the US in the areas of business strategy, marketing, gender diversity, leadership development, organisational culture and change management. Before becoming a thriving entrepreneur, her most recent role was Head of Strategy for IBM. With Masters degrees in both Business Management, and in Wellness (Positive Psychology), and two decades as a business leader, she blends science with experience to drive results that matter.  \n \nWith deep expertise in gender diversity and women in business, Megan is the co-creator of the award winning Positive Leadership for Aspiring women program; former head of gender diversity at IBM; core Implementation Leader in the Male Champions of Change led by Elizabeth Broderick; and current PhD candidate in gender studies. She coaches and speaks to thousands of people every year on personal and professional success and new leadership thinking. \n \nA sought after executive coach and business strategist, she helps entrepreneurs and leaders reach their goals, and builds cutting edge programs to create positive leaders for the future.  \n \nMegan writes for Huffington Post, Psychology Today, Fast Company, Wellbeing, Renegade Collective and Women’s Agenda. Her work has been seen in Forbes, Fortune, BRW, CIO, Women’s Health, Marie Claire, The Australian, Human Capital and more. She has been featured on CBS News, Fox Business, NBC, Huff Post Live, Ch 10, 7, ABC & radio.  \n \nMegan was awarded the inaugural 2013 NAB/Womens Agenda Leader in the Private Sector Award and her book Getting Real About Having It All (Hay House), is the bible for working women who want to create a thriving career and life. \n \nwww.megandallacamina.com Summary Megan Dalla-Camina is a business, creative and leadership strategist, and a globally recognised speaker, coach and writer on women, leadership and wellbeing. Having worked in the international business environment for 20 years, she has driven strategies for multi-billion dollar corporations like GE, PwC and IBM in Australia, Asia and the US in the areas of business strategy, marketing, gender diversity, leadership development, organisational culture and change management. Before becoming a thriving entrepreneur, her most recent role was Head of Strategy for IBM. With Masters degrees in both Business Management, and in Wellness (Positive Psychology), and two decades as a business leader, she blends science with experience to drive results that matter.  \n \nWith deep expertise in gender diversity and women in business, Megan is the co-creator of the award winning Positive Leadership for Aspiring women program; former head of gender diversity at IBM; core Implementation Leader in the Male Champions of Change led by Elizabeth Broderick; and current PhD candidate in gender studies. She coaches and speaks to thousands of people every year on personal and professional success and new leadership thinking. \n \nA sought after executive coach and business strategist, she helps entrepreneurs and leaders reach their goals, and builds cutting edge programs to create positive leaders for the future.  \n \nMegan writes for Huffington Post, Psychology Today, Fast Company, Wellbeing, Renegade Collective and Women’s Agenda. Her work has been seen in Forbes, Fortune, BRW, CIO, Women’s Health, Marie Claire, The Australian, Human Capital and more. She has been featured on CBS News, Fox Business, NBC, Huff Post Live, Ch 10, 7, ABC & radio.  \n \nMegan was awarded the inaugural 2013 NAB/Womens Agenda Leader in the Private Sector Award and her book Getting Real About Having It All (Hay House), is the bible for working women who want to create a thriving career and life. \n \nwww.megandallacamina.com Megan Dalla-Camina is a business, creative and leadership strategist, and a globally recognised speaker, coach and writer on women, leadership and wellbeing. Having worked in the international business environment for 20 years, she has driven strategies for multi-billion dollar corporations like GE, PwC and IBM in Australia, Asia and the US in the areas of business strategy, marketing, gender diversity, leadership development, organisational culture and change management. Before becoming a thriving entrepreneur, her most recent role was Head of Strategy for IBM. With Masters degrees in both Business Management, and in Wellness (Positive Psychology), and two decades as a business leader, she blends science with experience to drive results that matter.  \n \nWith deep expertise in gender diversity and women in business, Megan is the co-creator of the award winning Positive Leadership for Aspiring women program; former head of gender diversity at IBM; core Implementation Leader in the Male Champions of Change led by Elizabeth Broderick; and current PhD candidate in gender studies. She coaches and speaks to thousands of people every year on personal and professional success and new leadership thinking. \n \nA sought after executive coach and business strategist, she helps entrepreneurs and leaders reach their goals, and builds cutting edge programs to create positive leaders for the future.  \n \nMegan writes for Huffington Post, Psychology Today, Fast Company, Wellbeing, Renegade Collective and Women’s Agenda. Her work has been seen in Forbes, Fortune, BRW, CIO, Women’s Health, Marie Claire, The Australian, Human Capital and more. She has been featured on CBS News, Fox Business, NBC, Huff Post Live, Ch 10, 7, ABC & radio.  \n \nMegan was awarded the inaugural 2013 NAB/Womens Agenda Leader in the Private Sector Award and her book Getting Real About Having It All (Hay House), is the bible for working women who want to create a thriving career and life. \n \nwww.megandallacamina.com Megan Dalla-Camina is a business, creative and leadership strategist, and a globally recognised speaker, coach and writer on women, leadership and wellbeing. Having worked in the international business environment for 20 years, she has driven strategies for multi-billion dollar corporations like GE, PwC and IBM in Australia, Asia and the US in the areas of business strategy, marketing, gender diversity, leadership development, organisational culture and change management. Before becoming a thriving entrepreneur, her most recent role was Head of Strategy for IBM. With Masters degrees in both Business Management, and in Wellness (Positive Psychology), and two decades as a business leader, she blends science with experience to drive results that matter.  \n \nWith deep expertise in gender diversity and women in business, Megan is the co-creator of the award winning Positive Leadership for Aspiring women program; former head of gender diversity at IBM; core Implementation Leader in the Male Champions of Change led by Elizabeth Broderick; and current PhD candidate in gender studies. She coaches and speaks to thousands of people every year on personal and professional success and new leadership thinking. \n \nA sought after executive coach and business strategist, she helps entrepreneurs and leaders reach their goals, and builds cutting edge programs to create positive leaders for the future.  \n \nMegan writes for Huffington Post, Psychology Today, Fast Company, Wellbeing, Renegade Collective and Women’s Agenda. Her work has been seen in Forbes, Fortune, BRW, CIO, Women’s Health, Marie Claire, The Australian, Human Capital and more. She has been featured on CBS News, Fox Business, NBC, Huff Post Live, Ch 10, 7, ABC & radio.  \n \nMegan was awarded the inaugural 2013 NAB/Womens Agenda Leader in the Private Sector Award and her book Getting Real About Having It All (Hay House), is the bible for working women who want to create a thriving career and life. \n \nwww.megandallacamina.com Experience Business, Creative and Leadership Strategist. Megan Dalla-Camina Pty Ltd 2013  – Present (2 years) Based Sydney, Working Globally Megan Dalla-Camina is a business, creative and leadership strategist, working with large organisations, creative start ups, leading entrepreneurs and passionate individuals to create positive change, and to drive results that matter. She is a globally recognised speaker, coach and writer on women, leadership and wellbeing. \n \nMegan has developed thousands of leaders in positive leadership practices over the past decade for companies like IBM where she was formerly Head of Strategy, and for her clients such as NAB, GM, CPA, CEO Forum, HR Directors Forum, Amex, AMP, Canon, Microsoft, SAP, CBA and many others.  \n \nHer executive coaching clients include diplomats, CEO's, future leaders and high potential women; and in business and creative strategy development, she works with start ups, established business owners, entrepreneurs and creatives to build strategies that drive real results, holistically. \n \nMegan speaks at events ranging from small gatherings to events in the thousands, on areas related to women in business, personal and professional thriving and positive leadership. She is deeply passionate about helping women step into their power; creating new organisations that enable flourishing and empowering new leadership. \n \nHer PhD research is on women, leadership and feminine power. \n \nMegan writes for Huffington Post, Psychology Today, Fast Company, Wellbeing, Renegade Collective and Women’s Agenda. Her work has been seen in Forbes, Fortune, BRW, CIO, Women’s Health, Marie Claire, The Australian, Human Capital, Cleo, Cosmo, Balance by Deborah Hutton; and she has been featured on CBS News, Fox Business, Fox News, NBC, Huffington Post Live, Channels 10, 7, ABC radio.  \n \nwww.megandallacamina.com \n \nSpecialties include: \n \nPositive leadership \nLeadership development for women \nPhD research in gender studies \nExecutive coaching \nBusiness strategist and coach \nFeminine Power \nCreative strategy \nCoaching for entrepreneurs  \nSpeaker \nBest selling author and writer  \nPositive psychology \n Director, Strategy IBM December 2006  –  August 2013  (6 years 9 months) Head of Strategy for IBM in Australia and New Zealand - a 5Billion dollar business with 15,000 employees. Portfolio also included Head of Gender Diversity and Head of Organisational Culture and Change. Direct report to CEO and member of Senior Leadership Team. Chairperson Sustaining Women in Business 2007  –  2012  (5 years) Chair and Curator of the premier women in business conference in Australia, running for 12 years. Foundation partners included IBM, Telstra, ANZ, KPMG, ASX and other large organisations and government departments across the country. Past keynote speakers included Naomi Wolf, Dr Sylvia Ann Hewlett, Anne Sherry, Avril Henry, and former Chair and Curator Dr Anne Summers. Director, Marketing IBM September 2004  –  December 2006  (2 years 4 months) Sydney Awarded Marketing Director of the Year by B&T Magazine, both years in this position as Director of Marketing. Also won 23 others marketing awards around the world over 2004-2006. Marketing Executive IBM Business Consulting Services 2002  –  2004  (2 years) Director of Marketing and Communications PricewaterhouseCoopers 1999  –  2002  (3 years) Asia Pacific Head of Marketing and Communications for 13 countries across AP. Played a key role in the proposed separation of PwC Consulting from PwC globally, global rebranding and IPO positioning, and then the acquisition of PwCC by IBM. Lead the integration of PwCC AP into IBM. Marketing and Communications Leader, Asia Pacific GE 1994  –  1999  (5 years) Business, Creative and Leadership Strategist. Megan Dalla-Camina Pty Ltd 2013  – Present (2 years) Based Sydney, Working Globally Megan Dalla-Camina is a business, creative and leadership strategist, working with large organisations, creative start ups, leading entrepreneurs and passionate individuals to create positive change, and to drive results that matter. She is a globally recognised speaker, coach and writer on women, leadership and wellbeing. \n \nMegan has developed thousands of leaders in positive leadership practices over the past decade for companies like IBM where she was formerly Head of Strategy, and for her clients such as NAB, GM, CPA, CEO Forum, HR Directors Forum, Amex, AMP, Canon, Microsoft, SAP, CBA and many others.  \n \nHer executive coaching clients include diplomats, CEO's, future leaders and high potential women; and in business and creative strategy development, she works with start ups, established business owners, entrepreneurs and creatives to build strategies that drive real results, holistically. \n \nMegan speaks at events ranging from small gatherings to events in the thousands, on areas related to women in business, personal and professional thriving and positive leadership. She is deeply passionate about helping women step into their power; creating new organisations that enable flourishing and empowering new leadership. \n \nHer PhD research is on women, leadership and feminine power. \n \nMegan writes for Huffington Post, Psychology Today, Fast Company, Wellbeing, Renegade Collective and Women’s Agenda. Her work has been seen in Forbes, Fortune, BRW, CIO, Women’s Health, Marie Claire, The Australian, Human Capital, Cleo, Cosmo, Balance by Deborah Hutton; and she has been featured on CBS News, Fox Business, Fox News, NBC, Huffington Post Live, Channels 10, 7, ABC radio.  \n \nwww.megandallacamina.com \n \nSpecialties include: \n \nPositive leadership \nLeadership development for women \nPhD research in gender studies \nExecutive coaching \nBusiness strategist and coach \nFeminine Power \nCreative strategy \nCoaching for entrepreneurs  \nSpeaker \nBest selling author and writer  \nPositive psychology \n Business, Creative and Leadership Strategist. Megan Dalla-Camina Pty Ltd 2013  – Present (2 years) Based Sydney, Working Globally Megan Dalla-Camina is a business, creative and leadership strategist, working with large organisations, creative start ups, leading entrepreneurs and passionate individuals to create positive change, and to drive results that matter. She is a globally recognised speaker, coach and writer on women, leadership and wellbeing. \n \nMegan has developed thousands of leaders in positive leadership practices over the past decade for companies like IBM where she was formerly Head of Strategy, and for her clients such as NAB, GM, CPA, CEO Forum, HR Directors Forum, Amex, AMP, Canon, Microsoft, SAP, CBA and many others.  \n \nHer executive coaching clients include diplomats, CEO's, future leaders and high potential women; and in business and creative strategy development, she works with start ups, established business owners, entrepreneurs and creatives to build strategies that drive real results, holistically. \n \nMegan speaks at events ranging from small gatherings to events in the thousands, on areas related to women in business, personal and professional thriving and positive leadership. She is deeply passionate about helping women step into their power; creating new organisations that enable flourishing and empowering new leadership. \n \nHer PhD research is on women, leadership and feminine power. \n \nMegan writes for Huffington Post, Psychology Today, Fast Company, Wellbeing, Renegade Collective and Women’s Agenda. Her work has been seen in Forbes, Fortune, BRW, CIO, Women’s Health, Marie Claire, The Australian, Human Capital, Cleo, Cosmo, Balance by Deborah Hutton; and she has been featured on CBS News, Fox Business, Fox News, NBC, Huffington Post Live, Channels 10, 7, ABC radio.  \n \nwww.megandallacamina.com \n \nSpecialties include: \n \nPositive leadership \nLeadership development for women \nPhD research in gender studies \nExecutive coaching \nBusiness strategist and coach \nFeminine Power \nCreative strategy \nCoaching for entrepreneurs  \nSpeaker \nBest selling author and writer  \nPositive psychology \n Director, Strategy IBM December 2006  –  August 2013  (6 years 9 months) Head of Strategy for IBM in Australia and New Zealand - a 5Billion dollar business with 15,000 employees. Portfolio also included Head of Gender Diversity and Head of Organisational Culture and Change. Direct report to CEO and member of Senior Leadership Team. Director, Strategy IBM December 2006  –  August 2013  (6 years 9 months) Head of Strategy for IBM in Australia and New Zealand - a 5Billion dollar business with 15,000 employees. Portfolio also included Head of Gender Diversity and Head of Organisational Culture and Change. Direct report to CEO and member of Senior Leadership Team. Chairperson Sustaining Women in Business 2007  –  2012  (5 years) Chair and Curator of the premier women in business conference in Australia, running for 12 years. Foundation partners included IBM, Telstra, ANZ, KPMG, ASX and other large organisations and government departments across the country. Past keynote speakers included Naomi Wolf, Dr Sylvia Ann Hewlett, Anne Sherry, Avril Henry, and former Chair and Curator Dr Anne Summers. Chairperson Sustaining Women in Business 2007  –  2012  (5 years) Chair and Curator of the premier women in business conference in Australia, running for 12 years. Foundation partners included IBM, Telstra, ANZ, KPMG, ASX and other large organisations and government departments across the country. Past keynote speakers included Naomi Wolf, Dr Sylvia Ann Hewlett, Anne Sherry, Avril Henry, and former Chair and Curator Dr Anne Summers. Director, Marketing IBM September 2004  –  December 2006  (2 years 4 months) Sydney Awarded Marketing Director of the Year by B&T Magazine, both years in this position as Director of Marketing. Also won 23 others marketing awards around the world over 2004-2006. Director, Marketing IBM September 2004  –  December 2006  (2 years 4 months) Sydney Awarded Marketing Director of the Year by B&T Magazine, both years in this position as Director of Marketing. Also won 23 others marketing awards around the world over 2004-2006. Marketing Executive IBM Business Consulting Services 2002  –  2004  (2 years) Marketing Executive IBM Business Consulting Services 2002  –  2004  (2 years) Director of Marketing and Communications PricewaterhouseCoopers 1999  –  2002  (3 years) Asia Pacific Head of Marketing and Communications for 13 countries across AP. Played a key role in the proposed separation of PwC Consulting from PwC globally, global rebranding and IPO positioning, and then the acquisition of PwCC by IBM. Lead the integration of PwCC AP into IBM. Director of Marketing and Communications PricewaterhouseCoopers 1999  –  2002  (3 years) Asia Pacific Head of Marketing and Communications for 13 countries across AP. Played a key role in the proposed separation of PwC Consulting from PwC globally, global rebranding and IPO positioning, and then the acquisition of PwCC by IBM. Lead the integration of PwCC AP into IBM. Marketing and Communications Leader, Asia Pacific GE 1994  –  1999  (5 years) Marketing and Communications Leader, Asia Pacific GE 1994  –  1999  (5 years) Skills Brand Management Workshop Facilitation Business Strategy Executive Coaching Leadership Development Public Speaking Coaching Strategy Marketing Communications Change Management Employee Engagement Leadership Strategic Planning Management Performance Management Business Development Business Planning Marketing CRM Stakeholder Management Organizational... Budgets Management Consulting Business Coaching Program Management Business Transformation Consulting Entrepreneurship Team Leadership Culture Change Business Process... Organizational Design Executive Management Start-ups Integration Talent Management Training Governance Outsourcing Team Management Career Counseling Strategic Thinking Thought Leadership See 28+     See less Skills  Brand Management Workshop Facilitation Business Strategy Executive Coaching Leadership Development Public Speaking Coaching Strategy Marketing Communications Change Management Employee Engagement Leadership Strategic Planning Management Performance Management Business Development Business Planning Marketing CRM Stakeholder Management Organizational... Budgets Management Consulting Business Coaching Program Management Business Transformation Consulting Entrepreneurship Team Leadership Culture Change Business Process... Organizational Design Executive Management Start-ups Integration Talent Management Training Governance Outsourcing Team Management Career Counseling Strategic Thinking Thought Leadership See 28+     See less Brand Management Workshop Facilitation Business Strategy Executive Coaching Leadership Development Public Speaking Coaching Strategy Marketing Communications Change Management Employee Engagement Leadership Strategic Planning Management Performance Management Business Development Business Planning Marketing CRM Stakeholder Management Organizational... Budgets Management Consulting Business Coaching Program Management Business Transformation Consulting Entrepreneurship Team Leadership Culture Change Business Process... Organizational Design Executive Management Start-ups Integration Talent Management Training Governance Outsourcing Team Management Career Counseling Strategic Thinking Thought Leadership See 28+     See less Brand Management Workshop Facilitation Business Strategy Executive Coaching Leadership Development Public Speaking Coaching Strategy Marketing Communications Change Management Employee Engagement Leadership Strategic Planning Management Performance Management Business Development Business Planning Marketing CRM Stakeholder Management Organizational... Budgets Management Consulting Business Coaching Program Management Business Transformation Consulting Entrepreneurship Team Leadership Culture Change Business Process... Organizational Design Executive Management Start-ups Integration Talent Management Training Governance Outsourcing Team Management Career Counseling Strategic Thinking Thought Leadership See 28+     See less Education Tilburg University Doctor of Philosophy (PhD),  Women's Studies 2013  – 2016 PhD dissertation on Women, Leadership and Power through The Taos Institute in the US and Tilberg University in The Netherlands Activities and Societies:  PhD research University of Pennsylvania Foundations of Positive Psychology,  Positive Psychology 2010  – 2010 Positive Psychology RMIT University Master’s Degree,  Wellness (Health Sciences) , High Distinction; Received Vice Chancellors Award for Academic Excellence 2009  – 2010 Major research thesis on Positive Leadership (based on positive psychology and positive organisational scholarship).  Macquarie University - Graduate School of Business Master’s Degree,  Business , Distinction 1999  – 2004 Masters Degree in Business Management \nMajor focus areas Leadership and Change Management. Northholm Grammar HSC 1982  – 1987 Tilburg University Doctor of Philosophy (PhD),  Women's Studies 2013  – 2016 PhD dissertation on Women, Leadership and Power through The Taos Institute in the US and Tilberg University in The Netherlands Activities and Societies:  PhD research Tilburg University Doctor of Philosophy (PhD),  Women's Studies 2013  – 2016 PhD dissertation on Women, Leadership and Power through The Taos Institute in the US and Tilberg University in The Netherlands Activities and Societies:  PhD research Tilburg University Doctor of Philosophy (PhD),  Women's Studies 2013  – 2016 PhD dissertation on Women, Leadership and Power through The Taos Institute in the US and Tilberg University in The Netherlands Activities and Societies:  PhD research University of Pennsylvania Foundations of Positive Psychology,  Positive Psychology 2010  – 2010 Positive Psychology University of Pennsylvania Foundations of Positive Psychology,  Positive Psychology 2010  – 2010 Positive Psychology University of Pennsylvania Foundations of Positive Psychology,  Positive Psychology 2010  – 2010 Positive Psychology RMIT University Master’s Degree,  Wellness (Health Sciences) , High Distinction; Received Vice Chancellors Award for Academic Excellence 2009  – 2010 Major research thesis on Positive Leadership (based on positive psychology and positive organisational scholarship).  RMIT University Master’s Degree,  Wellness (Health Sciences) , High Distinction; Received Vice Chancellors Award for Academic Excellence 2009  – 2010 Major research thesis on Positive Leadership (based on positive psychology and positive organisational scholarship).  RMIT University Master’s Degree,  Wellness (Health Sciences) , High Distinction; Received Vice Chancellors Award for Academic Excellence 2009  – 2010 Major research thesis on Positive Leadership (based on positive psychology and positive organisational scholarship).  Macquarie University - Graduate School of Business Master’s Degree,  Business , Distinction 1999  – 2004 Masters Degree in Business Management \nMajor focus areas Leadership and Change Management. Macquarie University - Graduate School of Business Master’s Degree,  Business , Distinction 1999  – 2004 Masters Degree in Business Management \nMajor focus areas Leadership and Change Management. Macquarie University - Graduate School of Business Master’s Degree,  Business , Distinction 1999  – 2004 Masters Degree in Business Management \nMajor focus areas Leadership and Change Management. Northholm Grammar HSC 1982  – 1987 Northholm Grammar HSC 1982  – 1987 Northholm Grammar HSC 1982  – 1987 Honors & Awards Emerging Leader in the Private Sector NAB/Womens Agenda February 2013 Telstra Businesswoman of the Year - Nominee February 2013 Nominated for Telstra Businesswoman of the Year twice whilst Director of Strategy at IBM Telstra Business Womens Awards - Nominee April 2015 Nominated by Emma Isaacs, CEO of Business Chicks, for Telstra Business Awards. Category - Start Up. Additional Honors & Awards 'Vice Chancellor's List' Award for Academic Excellence - RMIT Master of Wellness degree, 2011 Emerging Leader in the Private Sector NAB/Womens Agenda February 2013 Emerging Leader in the Private Sector NAB/Womens Agenda February 2013 Emerging Leader in the Private Sector NAB/Womens Agenda February 2013 Telstra Businesswoman of the Year - Nominee February 2013 Nominated for Telstra Businesswoman of the Year twice whilst Director of Strategy at IBM Telstra Businesswoman of the Year - Nominee February 2013 Nominated for Telstra Businesswoman of the Year twice whilst Director of Strategy at IBM Telstra Businesswoman of the Year - Nominee February 2013 Nominated for Telstra Businesswoman of the Year twice whilst Director of Strategy at IBM Telstra Business Womens Awards - Nominee April 2015 Nominated by Emma Isaacs, CEO of Business Chicks, for Telstra Business Awards. Category - Start Up. Telstra Business Womens Awards - Nominee April 2015 Nominated by Emma Isaacs, CEO of Business Chicks, for Telstra Business Awards. Category - Start Up. Telstra Business Womens Awards - Nominee April 2015 Nominated by Emma Isaacs, CEO of Business Chicks, for Telstra Business Awards. Category - Start Up. Additional Honors & Awards 'Vice Chancellor's List' Award for Academic Excellence - RMIT Master of Wellness degree, 2011 Additional Honors & Awards 'Vice Chancellor's List' Award for Academic Excellence - RMIT Master of Wellness degree, 2011 Additional Honors & Awards 'Vice Chancellor's List' Award for Academic Excellence - RMIT Master of Wellness degree, 2011 ", "Experience Global Director of Strategy IBM January 2010  – Present (5 years 8 months) Greater New York City Area Global Director of Strategy IBM January 2010  – Present (5 years 8 months) Greater New York City Area Global Director of Strategy IBM January 2010  – Present (5 years 8 months) Greater New York City Area Skills Business Transformation Strategic Planning Management Consulting Business Process... Outsourcing IT Strategy Business Strategy Management Executive Management Mergers & Acquisitions Financial Services Banking Marketing Strategy Leadership Skills  Business Transformation Strategic Planning Management Consulting Business Process... Outsourcing IT Strategy Business Strategy Management Executive Management Mergers & Acquisitions Financial Services Banking Marketing Strategy Leadership Business Transformation Strategic Planning Management Consulting Business Process... Outsourcing IT Strategy Business Strategy Management Executive Management Mergers & Acquisitions Financial Services Banking Marketing Strategy Leadership Business Transformation Strategic Planning Management Consulting Business Process... Outsourcing IT Strategy Business Strategy Management Executive Management Mergers & Acquisitions Financial Services Banking Marketing Strategy Leadership Education Harvard University School of Banking, Citibank University of Notre Dame Harvard University Harvard University Harvard University School of Banking, Citibank School of Banking, Citibank School of Banking, Citibank University of Notre Dame University of Notre Dame University of Notre Dame ", "Summary I am a dynamic marketeer specialized in developing and managing global & regional brands. Work experience in Romania, Italy, Germany and Austria contributes to me being a fast, adaptable learner. As a project manager I am organized, thorough and able to develop creative solutions to problems. I work on my own initiative just as readily as I enjoy being part of a successful and productive team.  \n \nMy biggest strength is my attitude: I am a very passionate and hard worker, highly communicative and empathic, always looking for opportunities to grow and develop. \n \nMy specialties are: CEE Regional Strategy & Brand Management. Summary I am a dynamic marketeer specialized in developing and managing global & regional brands. Work experience in Romania, Italy, Germany and Austria contributes to me being a fast, adaptable learner. As a project manager I am organized, thorough and able to develop creative solutions to problems. I work on my own initiative just as readily as I enjoy being part of a successful and productive team.  \n \nMy biggest strength is my attitude: I am a very passionate and hard worker, highly communicative and empathic, always looking for opportunities to grow and develop. \n \nMy specialties are: CEE Regional Strategy & Brand Management. I am a dynamic marketeer specialized in developing and managing global & regional brands. Work experience in Romania, Italy, Germany and Austria contributes to me being a fast, adaptable learner. As a project manager I am organized, thorough and able to develop creative solutions to problems. I work on my own initiative just as readily as I enjoy being part of a successful and productive team.  \n \nMy biggest strength is my attitude: I am a very passionate and hard worker, highly communicative and empathic, always looking for opportunities to grow and develop. \n \nMy specialties are: CEE Regional Strategy & Brand Management. I am a dynamic marketeer specialized in developing and managing global & regional brands. Work experience in Romania, Italy, Germany and Austria contributes to me being a fast, adaptable learner. As a project manager I am organized, thorough and able to develop creative solutions to problems. I work on my own initiative just as readily as I enjoy being part of a successful and productive team.  \n \nMy biggest strength is my attitude: I am a very passionate and hard worker, highly communicative and empathic, always looking for opportunities to grow and develop. \n \nMy specialties are: CEE Regional Strategy & Brand Management. Experience Regional Brand Management for Schwarzkopf Professional CEE & Central Asia Henkel CEE April 2013  – Present (2 years 5 months) Vienna Regional Brand Management for Consumer Adhesives CEE & Central Asia Henkel CEE April 2010  –  March 2013  (3 years) Vienna, Austria - Sustained the strategic development of 2 global & 2 regional brands (representing 45% of total adhesives portfolio) across CEE and Central Asia \n- Implemented regionally the global brand re-engineering plan contributing to a double digit growth of the business yearly  \n- Closely steered local teams to set-up and implement local strategy  \n- Conducted synthesis and follow-up of sales evolution, market development, market shares & competitors \n- Created & coordinated the first promo campaign to be executed across 10 countries \n- Prepared & gave presentations for international meetings & top management \n- Organised yearly regional marketing meetings for sharing industry updates, exchanging best practice projects & building-up the teams Assistant Brand Manager Veet (Intern) Reckitt Benckiser November 2009  –  March 2010  (5 months) Milan, Italy - Developed & proposed the Online Media Plan for 2010 \n- Created the concept and mechanics of the Veet Summer Promotion \n- Was involved in shaping the biggest media spend in Italy for Veet \n- Was responsible of accurate budget management and market tracking \n- Worked closely with senior management, sales teams and trade marketing to support local brand strategy Assistant Brand Manager Shaving & Grooming (Intern) Philips Consumer Lifestyle September 2009  –  November 2009  (3 months) Monza, Italy - Executed portfolio analysis for the optimization of the Grooming category \n- Analysed and systematised competitor’s strategy and product offering \n- Supported the Senior Customer Marketing Manager in the development of the Christmas Promotion Plan and the Global Activities Plan for 2010 \n- Collaborated with BTL and ATL media agencies for the 2009 Christmas promotion \n- Created communication materials for the promotional SKUs \n- Extracted and interpreted key financial indicators International Assistant Brand Manager Pattex (Intern) Henkel AG & Co. KGaA August 2008  –  February 2009  (7 months) Düsseldorf, Germany - Executed portfolio analysis \n- Analyzed and systematized competitor’s financial data, strategy and product offering \n- Identified market trends \n- Coordinated technical development for prospective product with Operations, Purchasing, Packaging and R&D \n- Collected product data from 29 countries across 4 continents to consolidate the SAP database \n- Conceptualized an eco-friendly adhesives product range \n- Recommended engaging in social media monitoring \n- Provided country support for local brand development \n- Assisted the International Product Managers in the development and execution of marketing plans \n- Created the presentations and trailers of the nominees for the Henkel global advertising awards (Leo), coordinating inputs accross the 3 business units and on a global level CEMS Master - Business Project IBM Venture Capital EMEA January 2008  –  May 2008  (5 months) Dublin, Ireland - Analyzed company’s internal and external environment \n- Examined and summarized the economic literature of interest \n- Interviewed the Director of Strategic Alliances and Director of Strategy of IBM USA \n- Developed solutions to attract and guide companies to avoid cultural clashes \n- Identified the right fit-in of the venture within the IBM group Student Collaborator Universita` Commerciale Luigi Bocconi September 2006  –  December 2007  (1 year 4 months) Milan, Italy - Created promotional materials for SDA Business School \n- Planned the promotion of the courses offered to institutions \n- Collected feedback from clients \n- Conducted research of the economic and financial aspects of deinstitutionalization in Italy which was used in a study by London Business School \n- Expanded by 1,000 contacts the database of US town managers for the Institute of Public Administration and Healthcare Management Junior Manager SC Futura 2000 SRL July 2004  –  August 2006  (2 years 2 months) Bucharest, Romania - Planned production and guaranteed the quality and quantity requested \n- Coordinated imports and exports \n- Achieved no delays in delivering orders to foreign customers \n- Managed foreign suppliers and purchasing budget \n- Reduced inventory \n- Managed a team of 30 workers \n- Improved relations with Customs Authorities Sales Representative Avon Cosmetics November 1999  –  November 2000  (1 year 1 month) Bucharest, Romania - Grew sales and reached 100 new customers in the first 3 months \n- Developed promotion schemes to attract new clients \n- Recruited 20 sales representatives \n- Planned and organized promotional events Volunteer Per Aspera Ad Astra 1998  –  2000  (2 years) Bucharest, Romania - Founded “Love & Care” program for the benefit of abandoned institutionalized children \n- Developed fund raising campaigns \n- Obtained substantial financial help from the Romanian Ministry of Environment \n- Administered the budget Regional Brand Management for Schwarzkopf Professional CEE & Central Asia Henkel CEE April 2013  – Present (2 years 5 months) Vienna Regional Brand Management for Schwarzkopf Professional CEE & Central Asia Henkel CEE April 2013  – Present (2 years 5 months) Vienna Regional Brand Management for Consumer Adhesives CEE & Central Asia Henkel CEE April 2010  –  March 2013  (3 years) Vienna, Austria - Sustained the strategic development of 2 global & 2 regional brands (representing 45% of total adhesives portfolio) across CEE and Central Asia \n- Implemented regionally the global brand re-engineering plan contributing to a double digit growth of the business yearly  \n- Closely steered local teams to set-up and implement local strategy  \n- Conducted synthesis and follow-up of sales evolution, market development, market shares & competitors \n- Created & coordinated the first promo campaign to be executed across 10 countries \n- Prepared & gave presentations for international meetings & top management \n- Organised yearly regional marketing meetings for sharing industry updates, exchanging best practice projects & building-up the teams Regional Brand Management for Consumer Adhesives CEE & Central Asia Henkel CEE April 2010  –  March 2013  (3 years) Vienna, Austria - Sustained the strategic development of 2 global & 2 regional brands (representing 45% of total adhesives portfolio) across CEE and Central Asia \n- Implemented regionally the global brand re-engineering plan contributing to a double digit growth of the business yearly  \n- Closely steered local teams to set-up and implement local strategy  \n- Conducted synthesis and follow-up of sales evolution, market development, market shares & competitors \n- Created & coordinated the first promo campaign to be executed across 10 countries \n- Prepared & gave presentations for international meetings & top management \n- Organised yearly regional marketing meetings for sharing industry updates, exchanging best practice projects & building-up the teams Assistant Brand Manager Veet (Intern) Reckitt Benckiser November 2009  –  March 2010  (5 months) Milan, Italy - Developed & proposed the Online Media Plan for 2010 \n- Created the concept and mechanics of the Veet Summer Promotion \n- Was involved in shaping the biggest media spend in Italy for Veet \n- Was responsible of accurate budget management and market tracking \n- Worked closely with senior management, sales teams and trade marketing to support local brand strategy Assistant Brand Manager Veet (Intern) Reckitt Benckiser November 2009  –  March 2010  (5 months) Milan, Italy - Developed & proposed the Online Media Plan for 2010 \n- Created the concept and mechanics of the Veet Summer Promotion \n- Was involved in shaping the biggest media spend in Italy for Veet \n- Was responsible of accurate budget management and market tracking \n- Worked closely with senior management, sales teams and trade marketing to support local brand strategy Assistant Brand Manager Shaving & Grooming (Intern) Philips Consumer Lifestyle September 2009  –  November 2009  (3 months) Monza, Italy - Executed portfolio analysis for the optimization of the Grooming category \n- Analysed and systematised competitor’s strategy and product offering \n- Supported the Senior Customer Marketing Manager in the development of the Christmas Promotion Plan and the Global Activities Plan for 2010 \n- Collaborated with BTL and ATL media agencies for the 2009 Christmas promotion \n- Created communication materials for the promotional SKUs \n- Extracted and interpreted key financial indicators Assistant Brand Manager Shaving & Grooming (Intern) Philips Consumer Lifestyle September 2009  –  November 2009  (3 months) Monza, Italy - Executed portfolio analysis for the optimization of the Grooming category \n- Analysed and systematised competitor’s strategy and product offering \n- Supported the Senior Customer Marketing Manager in the development of the Christmas Promotion Plan and the Global Activities Plan for 2010 \n- Collaborated with BTL and ATL media agencies for the 2009 Christmas promotion \n- Created communication materials for the promotional SKUs \n- Extracted and interpreted key financial indicators International Assistant Brand Manager Pattex (Intern) Henkel AG & Co. KGaA August 2008  –  February 2009  (7 months) Düsseldorf, Germany - Executed portfolio analysis \n- Analyzed and systematized competitor’s financial data, strategy and product offering \n- Identified market trends \n- Coordinated technical development for prospective product with Operations, Purchasing, Packaging and R&D \n- Collected product data from 29 countries across 4 continents to consolidate the SAP database \n- Conceptualized an eco-friendly adhesives product range \n- Recommended engaging in social media monitoring \n- Provided country support for local brand development \n- Assisted the International Product Managers in the development and execution of marketing plans \n- Created the presentations and trailers of the nominees for the Henkel global advertising awards (Leo), coordinating inputs accross the 3 business units and on a global level International Assistant Brand Manager Pattex (Intern) Henkel AG & Co. KGaA August 2008  –  February 2009  (7 months) Düsseldorf, Germany - Executed portfolio analysis \n- Analyzed and systematized competitor’s financial data, strategy and product offering \n- Identified market trends \n- Coordinated technical development for prospective product with Operations, Purchasing, Packaging and R&D \n- Collected product data from 29 countries across 4 continents to consolidate the SAP database \n- Conceptualized an eco-friendly adhesives product range \n- Recommended engaging in social media monitoring \n- Provided country support for local brand development \n- Assisted the International Product Managers in the development and execution of marketing plans \n- Created the presentations and trailers of the nominees for the Henkel global advertising awards (Leo), coordinating inputs accross the 3 business units and on a global level CEMS Master - Business Project IBM Venture Capital EMEA January 2008  –  May 2008  (5 months) Dublin, Ireland - Analyzed company’s internal and external environment \n- Examined and summarized the economic literature of interest \n- Interviewed the Director of Strategic Alliances and Director of Strategy of IBM USA \n- Developed solutions to attract and guide companies to avoid cultural clashes \n- Identified the right fit-in of the venture within the IBM group CEMS Master - Business Project IBM Venture Capital EMEA January 2008  –  May 2008  (5 months) Dublin, Ireland - Analyzed company’s internal and external environment \n- Examined and summarized the economic literature of interest \n- Interviewed the Director of Strategic Alliances and Director of Strategy of IBM USA \n- Developed solutions to attract and guide companies to avoid cultural clashes \n- Identified the right fit-in of the venture within the IBM group Student Collaborator Universita` Commerciale Luigi Bocconi September 2006  –  December 2007  (1 year 4 months) Milan, Italy - Created promotional materials for SDA Business School \n- Planned the promotion of the courses offered to institutions \n- Collected feedback from clients \n- Conducted research of the economic and financial aspects of deinstitutionalization in Italy which was used in a study by London Business School \n- Expanded by 1,000 contacts the database of US town managers for the Institute of Public Administration and Healthcare Management Student Collaborator Universita` Commerciale Luigi Bocconi September 2006  –  December 2007  (1 year 4 months) Milan, Italy - Created promotional materials for SDA Business School \n- Planned the promotion of the courses offered to institutions \n- Collected feedback from clients \n- Conducted research of the economic and financial aspects of deinstitutionalization in Italy which was used in a study by London Business School \n- Expanded by 1,000 contacts the database of US town managers for the Institute of Public Administration and Healthcare Management Junior Manager SC Futura 2000 SRL July 2004  –  August 2006  (2 years 2 months) Bucharest, Romania - Planned production and guaranteed the quality and quantity requested \n- Coordinated imports and exports \n- Achieved no delays in delivering orders to foreign customers \n- Managed foreign suppliers and purchasing budget \n- Reduced inventory \n- Managed a team of 30 workers \n- Improved relations with Customs Authorities Junior Manager SC Futura 2000 SRL July 2004  –  August 2006  (2 years 2 months) Bucharest, Romania - Planned production and guaranteed the quality and quantity requested \n- Coordinated imports and exports \n- Achieved no delays in delivering orders to foreign customers \n- Managed foreign suppliers and purchasing budget \n- Reduced inventory \n- Managed a team of 30 workers \n- Improved relations with Customs Authorities Sales Representative Avon Cosmetics November 1999  –  November 2000  (1 year 1 month) Bucharest, Romania - Grew sales and reached 100 new customers in the first 3 months \n- Developed promotion schemes to attract new clients \n- Recruited 20 sales representatives \n- Planned and organized promotional events Sales Representative Avon Cosmetics November 1999  –  November 2000  (1 year 1 month) Bucharest, Romania - Grew sales and reached 100 new customers in the first 3 months \n- Developed promotion schemes to attract new clients \n- Recruited 20 sales representatives \n- Planned and organized promotional events Volunteer Per Aspera Ad Astra 1998  –  2000  (2 years) Bucharest, Romania - Founded “Love & Care” program for the benefit of abandoned institutionalized children \n- Developed fund raising campaigns \n- Obtained substantial financial help from the Romanian Ministry of Environment \n- Administered the budget Volunteer Per Aspera Ad Astra 1998  –  2000  (2 years) Bucharest, Romania - Founded “Love & Care” program for the benefit of abandoned institutionalized children \n- Developed fund raising campaigns \n- Obtained substantial financial help from the Romanian Ministry of Environment \n- Administered the budget Languages English Full professional proficiency Italian Full professional proficiency Romanian Native or bilingual proficiency English Full professional proficiency Italian Full professional proficiency Romanian Native or bilingual proficiency English Full professional proficiency Italian Full professional proficiency Romanian Native or bilingual proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Skills Regional Brand... Regional Strategy Regional Project... Business Analysis Financial Analysis Business in CEE Brand Management Strategy Project Management CEE Business Strategy Marketing Market Research Management Advertising Analysis Brand Development Budgets FMCG Marketing Management See 5+     See less Skills  Regional Brand... Regional Strategy Regional Project... Business Analysis Financial Analysis Business in CEE Brand Management Strategy Project Management CEE Business Strategy Marketing Market Research Management Advertising Analysis Brand Development Budgets FMCG Marketing Management See 5+     See less Regional Brand... Regional Strategy Regional Project... Business Analysis Financial Analysis Business in CEE Brand Management Strategy Project Management CEE Business Strategy Marketing Market Research Management Advertising Analysis Brand Development Budgets FMCG Marketing Management See 5+     See less Regional Brand... Regional Strategy Regional Project... Business Analysis Financial Analysis Business in CEE Brand Management Strategy Project Management CEE Business Strategy Marketing Market Research Management Advertising Analysis Brand Development Budgets FMCG Marketing Management See 5+     See less Education CEMS CEMS MIM - Master in International Management,  International Business 2007  – 2009 CEMS - The Global Alliance in Management Education is a strategic alliance of 26 member schools from 4 continents, over 70 corporate partners and 4 social partners (NGOs). \nThe CEMS Master's in International Management (CEMS MIM) provides a unique blend of top-level education and professional experience for multilingual, multicultural postgraduate students. The Financial Times ranking rates the CEMS MIM amongst the very best Master’s in Management programmes in the world.  \n[find more on www.cems.org] Università Commerciale 'Luigi Bocconi' Master of Science in International Management,  International Business 2006  – 2009 Academia de Studii Economice din București Bachelor in Economics and Business Law,  Economics 2002  – 2006 Activities and Societies:  AEGEE CEMS CEMS MIM - Master in International Management,  International Business 2007  – 2009 CEMS - The Global Alliance in Management Education is a strategic alliance of 26 member schools from 4 continents, over 70 corporate partners and 4 social partners (NGOs). \nThe CEMS Master's in International Management (CEMS MIM) provides a unique blend of top-level education and professional experience for multilingual, multicultural postgraduate students. The Financial Times ranking rates the CEMS MIM amongst the very best Master’s in Management programmes in the world.  \n[find more on www.cems.org] CEMS CEMS MIM - Master in International Management,  International Business 2007  – 2009 CEMS - The Global Alliance in Management Education is a strategic alliance of 26 member schools from 4 continents, over 70 corporate partners and 4 social partners (NGOs). \nThe CEMS Master's in International Management (CEMS MIM) provides a unique blend of top-level education and professional experience for multilingual, multicultural postgraduate students. The Financial Times ranking rates the CEMS MIM amongst the very best Master’s in Management programmes in the world.  \n[find more on www.cems.org] CEMS CEMS MIM - Master in International Management,  International Business 2007  – 2009 CEMS - The Global Alliance in Management Education is a strategic alliance of 26 member schools from 4 continents, over 70 corporate partners and 4 social partners (NGOs). \nThe CEMS Master's in International Management (CEMS MIM) provides a unique blend of top-level education and professional experience for multilingual, multicultural postgraduate students. The Financial Times ranking rates the CEMS MIM amongst the very best Master’s in Management programmes in the world.  \n[find more on www.cems.org] Università Commerciale 'Luigi Bocconi' Master of Science in International Management,  International Business 2006  – 2009 Università Commerciale 'Luigi Bocconi' Master of Science in International Management,  International Business 2006  – 2009 Università Commerciale 'Luigi Bocconi' Master of Science in International Management,  International Business 2006  – 2009 Academia de Studii Economice din București Bachelor in Economics and Business Law,  Economics 2002  – 2006 Activities and Societies:  AEGEE Academia de Studii Economice din București Bachelor in Economics and Business Law,  Economics 2002  – 2006 Activities and Societies:  AEGEE Academia de Studii Economice din București Bachelor in Economics and Business Law,  Economics 2002  – 2006 Activities and Societies:  AEGEE Honors & Awards Additional Honors & Awards Socrates Scholarship (2008) \nISU Bocconi Scholarship (2006-2008) Additional Honors & Awards Socrates Scholarship (2008) \nISU Bocconi Scholarship (2006-2008) Additional Honors & Awards Socrates Scholarship (2008) \nISU Bocconi Scholarship (2006-2008) Additional Honors & Awards Socrates Scholarship (2008) \nISU Bocconi Scholarship (2006-2008) ", "Summary Visionary Strategy Executive with with a global perspective and extensive experience in market and competitive analysis, mergers and acquisitions, strategic framework and business case development driving strong business results. “Out-of-the- box” thinker with strong leadership and communication skills. Acknowledged industry thought leader in social business, cloud computing and enterprise software. Extensive experience in customer, press, analyst and consultancy interactions. Deep industry knowledge and experience in energy, public sector, cities and municipalities, telecommunications, and education. Summary Visionary Strategy Executive with with a global perspective and extensive experience in market and competitive analysis, mergers and acquisitions, strategic framework and business case development driving strong business results. “Out-of-the- box” thinker with strong leadership and communication skills. Acknowledged industry thought leader in social business, cloud computing and enterprise software. Extensive experience in customer, press, analyst and consultancy interactions. Deep industry knowledge and experience in energy, public sector, cities and municipalities, telecommunications, and education. Visionary Strategy Executive with with a global perspective and extensive experience in market and competitive analysis, mergers and acquisitions, strategic framework and business case development driving strong business results. “Out-of-the- box” thinker with strong leadership and communication skills. Acknowledged industry thought leader in social business, cloud computing and enterprise software. Extensive experience in customer, press, analyst and consultancy interactions. Deep industry knowledge and experience in energy, public sector, cities and municipalities, telecommunications, and education. Visionary Strategy Executive with with a global perspective and extensive experience in market and competitive analysis, mergers and acquisitions, strategic framework and business case development driving strong business results. “Out-of-the- box” thinker with strong leadership and communication skills. Acknowledged industry thought leader in social business, cloud computing and enterprise software. Extensive experience in customer, press, analyst and consultancy interactions. Deep industry knowledge and experience in energy, public sector, cities and municipalities, telecommunications, and education. Experience Co-founder and Partner CueContext September 2014  – Present (1 year) Old Greenwich CT CueContext is a design and consultancy firm that helps companies and governments deploy context adaptive mobile solutions. Member of the Board of Directors MaRS Innovation September 2013  – Present (2 years) Toronto, Canada Area Member of the investment committee. Responsible for reviewing investments/grant priorities and coaching/ developing strategic frameworks for ICT startups Chief Operating Officer Flybits February 2014  –  August 2014  (7 months) Toronto, Canada Area Flybits builds context adaptive mobile enterprise solutions. It's customers use its technology to optimize workforce, deliver citizen and tourist services, optimize transit and traffic systems, deliver compelling customer experiences, and make their events and venues smarter. \n \nFlybits delivers the content and transaction services that an end user needs to make high quality context sensitive decisions. Director of Strategy -Special Assignment App Markletplaces and API Economy IBM April 2013  –  August 2013  (5 months) Somers NY Responsible for research on developer ecosystems, app and API deployment, channels and the emerging API economy. Director of Strategy, IBM Collaboration Solutions/ Smarter Workforce Solutions IBM February 2006  –  July 2013  (7 years 6 months) Somers, New York Responsibility for the formulation of IBM's Social Business, collaboration and smarter workforce strategy including market and competitive analysis. Also Executive Sponsor of the ACM ICPC. Frequent Industry conference Speaker and consultant. Sponsorship Executive ACM ICPC IBM February 2003  –  July 2013  (10 years 6 months) Somers NY Overall responsibility for IBM's sponsorship of the ACM ICPC (Worlds programming championship). Logistics coordination, contract management, public relations spokesperson Director of Technical Strategy SWG IBM June 2003  –  February 2006  (2 years 9 months) Worldwide responsibility for IBM SWG technical strategy, Including platform support, integration coordination, Opensource, Linux, and public policy consulting. Manager of Opensource and Linux, WW public sector IBM October 2002  –  June 2003  (9 months) Somers NY Responsible for WW public sector strategy and policy consulting for Open source and standards Manager of Strategy and standards IBM Pervasive Computing IBM February 2000  –  October 2002  (2 years 9 months) Somers NY Responsible for standards and strategy for IBM pervasive computing. Represented IBM at numerous standards organizations. Chairman of the Board SyncML Initiative February 2000  –  May 2002  (2 years 4 months) Somers NY Corporate Director (IBM's representative) and Chairman of the Board. International multi company entity (120 members, 9 companies represented on board) with responsibility to develop mobile data synchronization standards and develop reference implementations and facilitate inter-company compliance testing. Merged into Open Mobile Alliance (OMA) in 2002 WW Evangelist e-business IBM January 1999  –  February 2000  (1 year 2 months) Somers NY WW responsibility for articulating IBM's SW and e-business capabilities for customers, analysts, conferences, field enablement. World wide technology evangelist. National Enterprise Software Evangelist IBM January 1998  –  December 1998  (1 year) Ottawa, Canada Area Built and delivered IBM SW premier evangelism program across Canada Enterprise Software Sales IBM January 1991  –  December 1997  (7 years) Ottawa, Canada Area Enterprise software sales responsibility for Federal Government and Eastern Canada. Responsible for object oriented programming development tools, LAN systems and Operating systems. Software Sales Repersentative IBM March 1990  –  December 1991  (1 year 10 months) Montreal, Canada Area One of the first 4 employees of IBM Software division in Canada. Sales responsibility for Quebec and eastern Canada. Systems Engineer IBM January 1989  –  March 1990  (1 year 3 months) Montreal, Canada Area Technical sales consulting. CADCAM- CATIA. Industrial manufacturing automation technology. Co-founder and Partner CueContext September 2014  – Present (1 year) Old Greenwich CT CueContext is a design and consultancy firm that helps companies and governments deploy context adaptive mobile solutions. Co-founder and Partner CueContext September 2014  – Present (1 year) Old Greenwich CT CueContext is a design and consultancy firm that helps companies and governments deploy context adaptive mobile solutions. Member of the Board of Directors MaRS Innovation September 2013  – Present (2 years) Toronto, Canada Area Member of the investment committee. Responsible for reviewing investments/grant priorities and coaching/ developing strategic frameworks for ICT startups Member of the Board of Directors MaRS Innovation September 2013  – Present (2 years) Toronto, Canada Area Member of the investment committee. Responsible for reviewing investments/grant priorities and coaching/ developing strategic frameworks for ICT startups Chief Operating Officer Flybits February 2014  –  August 2014  (7 months) Toronto, Canada Area Flybits builds context adaptive mobile enterprise solutions. It's customers use its technology to optimize workforce, deliver citizen and tourist services, optimize transit and traffic systems, deliver compelling customer experiences, and make their events and venues smarter. \n \nFlybits delivers the content and transaction services that an end user needs to make high quality context sensitive decisions. Chief Operating Officer Flybits February 2014  –  August 2014  (7 months) Toronto, Canada Area Flybits builds context adaptive mobile enterprise solutions. It's customers use its technology to optimize workforce, deliver citizen and tourist services, optimize transit and traffic systems, deliver compelling customer experiences, and make their events and venues smarter. \n \nFlybits delivers the content and transaction services that an end user needs to make high quality context sensitive decisions. Director of Strategy -Special Assignment App Markletplaces and API Economy IBM April 2013  –  August 2013  (5 months) Somers NY Responsible for research on developer ecosystems, app and API deployment, channels and the emerging API economy. Director of Strategy -Special Assignment App Markletplaces and API Economy IBM April 2013  –  August 2013  (5 months) Somers NY Responsible for research on developer ecosystems, app and API deployment, channels and the emerging API economy. Director of Strategy, IBM Collaboration Solutions/ Smarter Workforce Solutions IBM February 2006  –  July 2013  (7 years 6 months) Somers, New York Responsibility for the formulation of IBM's Social Business, collaboration and smarter workforce strategy including market and competitive analysis. Also Executive Sponsor of the ACM ICPC. Frequent Industry conference Speaker and consultant. Director of Strategy, IBM Collaboration Solutions/ Smarter Workforce Solutions IBM February 2006  –  July 2013  (7 years 6 months) Somers, New York Responsibility for the formulation of IBM's Social Business, collaboration and smarter workforce strategy including market and competitive analysis. Also Executive Sponsor of the ACM ICPC. Frequent Industry conference Speaker and consultant. Sponsorship Executive ACM ICPC IBM February 2003  –  July 2013  (10 years 6 months) Somers NY Overall responsibility for IBM's sponsorship of the ACM ICPC (Worlds programming championship). Logistics coordination, contract management, public relations spokesperson Sponsorship Executive ACM ICPC IBM February 2003  –  July 2013  (10 years 6 months) Somers NY Overall responsibility for IBM's sponsorship of the ACM ICPC (Worlds programming championship). Logistics coordination, contract management, public relations spokesperson Director of Technical Strategy SWG IBM June 2003  –  February 2006  (2 years 9 months) Worldwide responsibility for IBM SWG technical strategy, Including platform support, integration coordination, Opensource, Linux, and public policy consulting. Director of Technical Strategy SWG IBM June 2003  –  February 2006  (2 years 9 months) Worldwide responsibility for IBM SWG technical strategy, Including platform support, integration coordination, Opensource, Linux, and public policy consulting. Manager of Opensource and Linux, WW public sector IBM October 2002  –  June 2003  (9 months) Somers NY Responsible for WW public sector strategy and policy consulting for Open source and standards Manager of Opensource and Linux, WW public sector IBM October 2002  –  June 2003  (9 months) Somers NY Responsible for WW public sector strategy and policy consulting for Open source and standards Manager of Strategy and standards IBM Pervasive Computing IBM February 2000  –  October 2002  (2 years 9 months) Somers NY Responsible for standards and strategy for IBM pervasive computing. Represented IBM at numerous standards organizations. Manager of Strategy and standards IBM Pervasive Computing IBM February 2000  –  October 2002  (2 years 9 months) Somers NY Responsible for standards and strategy for IBM pervasive computing. Represented IBM at numerous standards organizations. Chairman of the Board SyncML Initiative February 2000  –  May 2002  (2 years 4 months) Somers NY Corporate Director (IBM's representative) and Chairman of the Board. International multi company entity (120 members, 9 companies represented on board) with responsibility to develop mobile data synchronization standards and develop reference implementations and facilitate inter-company compliance testing. Merged into Open Mobile Alliance (OMA) in 2002 Chairman of the Board SyncML Initiative February 2000  –  May 2002  (2 years 4 months) Somers NY Corporate Director (IBM's representative) and Chairman of the Board. International multi company entity (120 members, 9 companies represented on board) with responsibility to develop mobile data synchronization standards and develop reference implementations and facilitate inter-company compliance testing. Merged into Open Mobile Alliance (OMA) in 2002 WW Evangelist e-business IBM January 1999  –  February 2000  (1 year 2 months) Somers NY WW responsibility for articulating IBM's SW and e-business capabilities for customers, analysts, conferences, field enablement. World wide technology evangelist. WW Evangelist e-business IBM January 1999  –  February 2000  (1 year 2 months) Somers NY WW responsibility for articulating IBM's SW and e-business capabilities for customers, analysts, conferences, field enablement. World wide technology evangelist. National Enterprise Software Evangelist IBM January 1998  –  December 1998  (1 year) Ottawa, Canada Area Built and delivered IBM SW premier evangelism program across Canada National Enterprise Software Evangelist IBM January 1998  –  December 1998  (1 year) Ottawa, Canada Area Built and delivered IBM SW premier evangelism program across Canada Enterprise Software Sales IBM January 1991  –  December 1997  (7 years) Ottawa, Canada Area Enterprise software sales responsibility for Federal Government and Eastern Canada. Responsible for object oriented programming development tools, LAN systems and Operating systems. Enterprise Software Sales IBM January 1991  –  December 1997  (7 years) Ottawa, Canada Area Enterprise software sales responsibility for Federal Government and Eastern Canada. Responsible for object oriented programming development tools, LAN systems and Operating systems. Software Sales Repersentative IBM March 1990  –  December 1991  (1 year 10 months) Montreal, Canada Area One of the first 4 employees of IBM Software division in Canada. Sales responsibility for Quebec and eastern Canada. Software Sales Repersentative IBM March 1990  –  December 1991  (1 year 10 months) Montreal, Canada Area One of the first 4 employees of IBM Software division in Canada. Sales responsibility for Quebec and eastern Canada. Systems Engineer IBM January 1989  –  March 1990  (1 year 3 months) Montreal, Canada Area Technical sales consulting. CADCAM- CATIA. Industrial manufacturing automation technology. Systems Engineer IBM January 1989  –  March 1990  (1 year 3 months) Montreal, Canada Area Technical sales consulting. CADCAM- CATIA. Industrial manufacturing automation technology. Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Social Business Open Source smarter cities Government IT Document technology IT Strategy Business Strategy Public Speaking Negotiation Future Trends Information Technology Enterprise Software Strategy Enterprise Architecture Integration Outsourcing Program Management Leadership Management Consulting Business Analysis Cloud Computing SaaS Business Process... Start-ups Business Alliances Go-to-market Strategy Mobile Devices Competitive Analysis Solution Selling Professional Services Sales Enablement Thought Leadership Product Management Marketing Strategy Strategic Communications Strategic Planning See 21+     See less Skills  Social Business Open Source smarter cities Government IT Document technology IT Strategy Business Strategy Public Speaking Negotiation Future Trends Information Technology Enterprise Software Strategy Enterprise Architecture Integration Outsourcing Program Management Leadership Management Consulting Business Analysis Cloud Computing SaaS Business Process... Start-ups Business Alliances Go-to-market Strategy Mobile Devices Competitive Analysis Solution Selling Professional Services Sales Enablement Thought Leadership Product Management Marketing Strategy Strategic Communications Strategic Planning See 21+     See less Social Business Open Source smarter cities Government IT Document technology IT Strategy Business Strategy Public Speaking Negotiation Future Trends Information Technology Enterprise Software Strategy Enterprise Architecture Integration Outsourcing Program Management Leadership Management Consulting Business Analysis Cloud Computing SaaS Business Process... Start-ups Business Alliances Go-to-market Strategy Mobile Devices Competitive Analysis Solution Selling Professional Services Sales Enablement Thought Leadership Product Management Marketing Strategy Strategic Communications Strategic Planning See 21+     See less Social Business Open Source smarter cities Government IT Document technology IT Strategy Business Strategy Public Speaking Negotiation Future Trends Information Technology Enterprise Software Strategy Enterprise Architecture Integration Outsourcing Program Management Leadership Management Consulting Business Analysis Cloud Computing SaaS Business Process... Start-ups Business Alliances Go-to-market Strategy Mobile Devices Competitive Analysis Solution Selling Professional Services Sales Enablement Thought Leadership Product Management Marketing Strategy Strategic Communications Strategic Planning See 21+     See less Education Université Pierre Mendès-France (Grenoble II) MA,  Social and Economic Administration 1987  – 1988 Queen's University BAH,  Political Studies 1983  – 1987 Activities and Societies:  Debate Team Marianopolis College Economics 1982  – 1983 CEGEP Loyola High School 1978  – 1982 Montreal Université Pierre Mendès-France (Grenoble II) MA,  Social and Economic Administration 1987  – 1988 Université Pierre Mendès-France (Grenoble II) MA,  Social and Economic Administration 1987  – 1988 Université Pierre Mendès-France (Grenoble II) MA,  Social and Economic Administration 1987  – 1988 Queen's University BAH,  Political Studies 1983  – 1987 Activities and Societies:  Debate Team Queen's University BAH,  Political Studies 1983  – 1987 Activities and Societies:  Debate Team Queen's University BAH,  Political Studies 1983  – 1987 Activities and Societies:  Debate Team Marianopolis College Economics 1982  – 1983 CEGEP Marianopolis College Economics 1982  – 1983 CEGEP Marianopolis College Economics 1982  – 1983 CEGEP Loyola High School 1978  – 1982 Montreal Loyola High School 1978  – 1982 Montreal Loyola High School 1978  – 1982 Montreal Honors & Awards "]}