{"position": "Education Program Coordinator", "company": "Stanford University", "profiles": ["Summary By nature, I am a problem solver; I thrive when given a good challenge. I take the time to understand all the parts of the problem before acting. In this way each step I take is not only effective, but efficient. My passion is what drives me to work tirelessly to successfully complete any project thrown my way, no matter how complex the components are. Summary By nature, I am a problem solver; I thrive when given a good challenge. I take the time to understand all the parts of the problem before acting. In this way each step I take is not only effective, but efficient. My passion is what drives me to work tirelessly to successfully complete any project thrown my way, no matter how complex the components are. By nature, I am a problem solver; I thrive when given a good challenge. I take the time to understand all the parts of the problem before acting. In this way each step I take is not only effective, but efficient. My passion is what drives me to work tirelessly to successfully complete any project thrown my way, no matter how complex the components are. By nature, I am a problem solver; I thrive when given a good challenge. I take the time to understand all the parts of the problem before acting. In this way each step I take is not only effective, but efficient. My passion is what drives me to work tirelessly to successfully complete any project thrown my way, no matter how complex the components are. Experience Associate Director, Custom Programs Stanford University July 2015  – Present (2 months) Stanford Center for Professional Development Professional Education Program Manager Stanford University December 2013  –  July 2015  (1 year 8 months) Stanford Center for Professional Development Develop and manage all aspects of a range of Chinese Executive Education programs at Stanford, in China and online. Responsibilities include business development, proposals and contracts, course development and program execution. Professional Education Program Coordinator Stanford University March 2012  –  December 2013  (1 year 10 months) Stanford Center for Professional Development Provide program coordination for small and large, custom and open enrollment programs serving a range of clients from executives and middle managers to professors and researchers from around the world through the Stanford Center for Professional Development in the School of Engineering. Loan Closing Support First Republic Bank September 2011  –  December 2011  (4 months) San Francisco The main source of support for the Loan Closing Department, 17+ Closers, doing initial database entry, organization and distribution of files, attaining proper signatures and ensuring that deadlines for the loans were met. Implemented new procedures for logging files upon arrival into the department, substantially increasing the efficiency and still in use today. Consulted with the Executive Loan Committee members when problems were found and worked to correct them to avoid delaying the loan closing timeline. Office Assistant Sarah and Company January 2009  –  May 2011  (2 years 5 months) San Francisco Bay Area As a children’s clothing wholesaler I did everything from answering phone calls and emails to showing the lines to customers and writing orders. I also sent orders to manufactures, designed display windows and sold samples in the retail store. Media Tech California College of the Arts 2008  –  May 2011  (3 years) San Francisco Bay Area As a Media Tech I ran the lighting, sound, and projections for any events that CCA hosted. I ran events such as Architecture Lectures, Comedy Shows, and Thesis Presentations. Associate Director, Custom Programs Stanford University July 2015  – Present (2 months) Stanford Center for Professional Development Associate Director, Custom Programs Stanford University July 2015  – Present (2 months) Stanford Center for Professional Development Professional Education Program Manager Stanford University December 2013  –  July 2015  (1 year 8 months) Stanford Center for Professional Development Develop and manage all aspects of a range of Chinese Executive Education programs at Stanford, in China and online. Responsibilities include business development, proposals and contracts, course development and program execution. Professional Education Program Manager Stanford University December 2013  –  July 2015  (1 year 8 months) Stanford Center for Professional Development Develop and manage all aspects of a range of Chinese Executive Education programs at Stanford, in China and online. Responsibilities include business development, proposals and contracts, course development and program execution. Professional Education Program Coordinator Stanford University March 2012  –  December 2013  (1 year 10 months) Stanford Center for Professional Development Provide program coordination for small and large, custom and open enrollment programs serving a range of clients from executives and middle managers to professors and researchers from around the world through the Stanford Center for Professional Development in the School of Engineering. Professional Education Program Coordinator Stanford University March 2012  –  December 2013  (1 year 10 months) Stanford Center for Professional Development Provide program coordination for small and large, custom and open enrollment programs serving a range of clients from executives and middle managers to professors and researchers from around the world through the Stanford Center for Professional Development in the School of Engineering. Loan Closing Support First Republic Bank September 2011  –  December 2011  (4 months) San Francisco The main source of support for the Loan Closing Department, 17+ Closers, doing initial database entry, organization and distribution of files, attaining proper signatures and ensuring that deadlines for the loans were met. Implemented new procedures for logging files upon arrival into the department, substantially increasing the efficiency and still in use today. Consulted with the Executive Loan Committee members when problems were found and worked to correct them to avoid delaying the loan closing timeline. Loan Closing Support First Republic Bank September 2011  –  December 2011  (4 months) San Francisco The main source of support for the Loan Closing Department, 17+ Closers, doing initial database entry, organization and distribution of files, attaining proper signatures and ensuring that deadlines for the loans were met. Implemented new procedures for logging files upon arrival into the department, substantially increasing the efficiency and still in use today. Consulted with the Executive Loan Committee members when problems were found and worked to correct them to avoid delaying the loan closing timeline. Office Assistant Sarah and Company January 2009  –  May 2011  (2 years 5 months) San Francisco Bay Area As a children’s clothing wholesaler I did everything from answering phone calls and emails to showing the lines to customers and writing orders. I also sent orders to manufactures, designed display windows and sold samples in the retail store. Office Assistant Sarah and Company January 2009  –  May 2011  (2 years 5 months) San Francisco Bay Area As a children’s clothing wholesaler I did everything from answering phone calls and emails to showing the lines to customers and writing orders. I also sent orders to manufactures, designed display windows and sold samples in the retail store. Media Tech California College of the Arts 2008  –  May 2011  (3 years) San Francisco Bay Area As a Media Tech I ran the lighting, sound, and projections for any events that CCA hosted. I ran events such as Architecture Lectures, Comedy Shows, and Thesis Presentations. Media Tech California College of the Arts 2008  –  May 2011  (3 years) San Francisco Bay Area As a Media Tech I ran the lighting, sound, and projections for any events that CCA hosted. I ran events such as Architecture Lectures, Comedy Shows, and Thesis Presentations. Languages English Native or bilingual proficiency Arabic Native or bilingual proficiency English Native or bilingual proficiency Arabic Native or bilingual proficiency English Native or bilingual proficiency Arabic Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Program Management Training Adobe Creative Suite Microsoft Office Illustrator Research Photoshop InDesign Rhino Laser Cutting Editing iLife iMovie Final Cut Pro Graphic Design Maxwell Render Design Research Architecture Audacity MS Office Suite Adobe Acrobat Rendering Photography Revit After Effects Mac Fluent in Arabic Drawing Model Making See 14+     See less Skills  Program Management Training Adobe Creative Suite Microsoft Office Illustrator Research Photoshop InDesign Rhino Laser Cutting Editing iLife iMovie Final Cut Pro Graphic Design Maxwell Render Design Research Architecture Audacity MS Office Suite Adobe Acrobat Rendering Photography Revit After Effects Mac Fluent in Arabic Drawing Model Making See 14+     See less Program Management Training Adobe Creative Suite Microsoft Office Illustrator Research Photoshop InDesign Rhino Laser Cutting Editing iLife iMovie Final Cut Pro Graphic Design Maxwell Render Design Research Architecture Audacity MS Office Suite Adobe Acrobat Rendering Photography Revit After Effects Mac Fluent in Arabic Drawing Model Making See 14+     See less Program Management Training Adobe Creative Suite Microsoft Office Illustrator Research Photoshop InDesign Rhino Laser Cutting Editing iLife iMovie Final Cut Pro Graphic Design Maxwell Render Design Research Architecture Audacity MS Office Suite Adobe Acrobat Rendering Photography Revit After Effects Mac Fluent in Arabic Drawing Model Making See 14+     See less Education California College of the Arts Bachelor of Architecture,  Architecture 2006  – 2011 Activities and Societies:  Alpha Rho Chi ,  NOMAS Mercy High School - Sf 2002  – 2006 Activities and Societies:  Sophomore Co-President ,  Junior Class President ,  Associated Student Body and Campus Life Team ,  Theater and Tech California College of the Arts Bachelor of Architecture,  Architecture 2006  – 2011 Activities and Societies:  Alpha Rho Chi ,  NOMAS California College of the Arts Bachelor of Architecture,  Architecture 2006  – 2011 Activities and Societies:  Alpha Rho Chi ,  NOMAS California College of the Arts Bachelor of Architecture,  Architecture 2006  – 2011 Activities and Societies:  Alpha Rho Chi ,  NOMAS Mercy High School - Sf 2002  – 2006 Activities and Societies:  Sophomore Co-President ,  Junior Class President ,  Associated Student Body and Campus Life Team ,  Theater and Tech Mercy High School - Sf 2002  – 2006 Activities and Societies:  Sophomore Co-President ,  Junior Class President ,  Associated Student Body and Campus Life Team ,  Theater and Tech Mercy High School - Sf 2002  – 2006 Activities and Societies:  Sophomore Co-President ,  Junior Class President ,  Associated Student Body and Campus Life Team ,  Theater and Tech Honors & Awards Additional Honors & Awards Creative Achievement Award \nCCA Scholarship Additional Honors & Awards Creative Achievement Award \nCCA Scholarship Additional Honors & Awards Creative Achievement Award \nCCA Scholarship Additional Honors & Awards Creative Achievement Award \nCCA Scholarship ", "Skills Outstanding Customer... Research and Reference Effective Communications Information Management Event Planning Program Management Collaborative Teamwork Teamwork Training Library Customer Service Research Skills  Outstanding Customer... Research and Reference Effective Communications Information Management Event Planning Program Management Collaborative Teamwork Teamwork Training Library Customer Service Research Outstanding Customer... Research and Reference Effective Communications Information Management Event Planning Program Management Collaborative Teamwork Teamwork Training Library Customer Service Research Outstanding Customer... Research and Reference Effective Communications Information Management Event Planning Program Management Collaborative Teamwork Teamwork Training Library Customer Service Research Honors & Awards ", "Languages   Skills Skills     Education University of San Francisco Master of Arts (M.A.),  Counseling Psychology 2013  – 2016 Initiated creation of new school-wide MFT student resource listserv.  \nInterviewed students to learn what resources would be valuable in their academic experience.  Jagiellonian University Polish Culture and Language New York University Master of Arts (M.A.),  Student Personnel Administration / Higher Education Administration , 4.0 GPA New York University BA,  Politics ,  European Studies , 3.75 GPA Minors: Sociology, Journalism Activities and Societies:  Alpha Phi Omega (President) New York University in Prague Study Abroad Program On-site Resident Assistant responsible for counseling 100+ students, managing crisis situations.  \n Stuyvesant High School University of San Francisco Master of Arts (M.A.),  Counseling Psychology 2013  – 2016 Initiated creation of new school-wide MFT student resource listserv.  \nInterviewed students to learn what resources would be valuable in their academic experience.  University of San Francisco Master of Arts (M.A.),  Counseling Psychology 2013  – 2016 Initiated creation of new school-wide MFT student resource listserv.  \nInterviewed students to learn what resources would be valuable in their academic experience.  University of San Francisco Master of Arts (M.A.),  Counseling Psychology 2013  – 2016 Initiated creation of new school-wide MFT student resource listserv.  \nInterviewed students to learn what resources would be valuable in their academic experience.  Jagiellonian University Polish Culture and Language Jagiellonian University Polish Culture and Language Jagiellonian University Polish Culture and Language New York University Master of Arts (M.A.),  Student Personnel Administration / Higher Education Administration , 4.0 GPA New York University Master of Arts (M.A.),  Student Personnel Administration / Higher Education Administration , 4.0 GPA New York University Master of Arts (M.A.),  Student Personnel Administration / Higher Education Administration , 4.0 GPA New York University BA,  Politics ,  European Studies , 3.75 GPA Minors: Sociology, Journalism Activities and Societies:  Alpha Phi Omega (President) New York University BA,  Politics ,  European Studies , 3.75 GPA Minors: Sociology, Journalism Activities and Societies:  Alpha Phi Omega (President) New York University BA,  Politics ,  European Studies , 3.75 GPA Minors: Sociology, Journalism Activities and Societies:  Alpha Phi Omega (President) New York University in Prague Study Abroad Program On-site Resident Assistant responsible for counseling 100+ students, managing crisis situations.  \n New York University in Prague Study Abroad Program On-site Resident Assistant responsible for counseling 100+ students, managing crisis situations.  \n New York University in Prague Study Abroad Program On-site Resident Assistant responsible for counseling 100+ students, managing crisis situations.  \n Stuyvesant High School Stuyvesant High School Stuyvesant High School ", "Summary As a highly motivated professional with experience in university program development for global industry executives, I was recently a Professional Education Program Coordinator at Stanford University. An exceptional attention to detail and the ability to multitask has given me the skills needed to manage and organize large projects and interact with people from all facets of the academic and executive world. Summary As a highly motivated professional with experience in university program development for global industry executives, I was recently a Professional Education Program Coordinator at Stanford University. An exceptional attention to detail and the ability to multitask has given me the skills needed to manage and organize large projects and interact with people from all facets of the academic and executive world. As a highly motivated professional with experience in university program development for global industry executives, I was recently a Professional Education Program Coordinator at Stanford University. An exceptional attention to detail and the ability to multitask has given me the skills needed to manage and organize large projects and interact with people from all facets of the academic and executive world. As a highly motivated professional with experience in university program development for global industry executives, I was recently a Professional Education Program Coordinator at Stanford University. An exceptional attention to detail and the ability to multitask has given me the skills needed to manage and organize large projects and interact with people from all facets of the academic and executive world. Experience Professional Education Program Coordinator Stanford University March 2012  –  March 2015  (3 years 1 month) Palo Alto, CA •\tPlan and coordinate multiple projects and events for Stanford Center for Professional Development (SCPD) within the Stanford School of Engineering \n•\tDevelop and manage web-based and in-class instructor-led courses within SCPD for international industry executives and students \n•\tDevelop relationships and provide customer service to participants and faculty before, during, and after events  \n•\tManage logistics, registration, payment, and organization of course materials for events  \n•\tTrain staff on basic SCPD assignments and event planning to more specific software designed for customer evaluations  \n•\tDesign interdepartmental staff schedules for pre-planning and during events Paraeducator San Bernardino Superintendant of Schools January 2010  –  July 2011  (1 year 7 months) San Bernardino, CA •\tAssisted educators in special education between K-12 and preschool  \n•\tOne on one attention to individual students for both educational and personal needs \n•\tSubstitute teacher for the entire district, requiring the generation and execution of lesson plans Administrative Intern City of Riverside Human Resources July 2007  –  October 2007  (4 months) Riverside, CA •\tPerformed clerical skills essential to the operation of an office environment  \n•\tHandled the filing of employee disputes and created an efficient system for organizing private files  \n•\tExperience with human relations policies and filling of cases within HR department Intern Office of Mayor Ronald Loveridge January 2007  –  July 2007  (7 months) Riverside, CA •\tPersonally assisting mayoral staff in city projects, including the Multicultural Youth Festival, Mayor’s Night Out, and the Sendai Festival \n•\tMain project involved researching the best practices of graffiti maintenance, which was followed by a written report. Lab Technician Lenscrafters February 2007  –  May 2007  (4 months) Riverside, CA •\tLearned how to read Rx worksheets, pull lens stock, and use various machines that generate and finish lenses for prescription eyewear \n•\tWorked quickly and efficiently with people to produce multiple pairs of glasses within the allotted one hour Sales Representative Mobile Tron December 2005  –  January 2007  (1 year 2 months) Riverside, CA •\tDesigned a sales plan to attract customers within store and commit to service plans \n•\tInformed customers of our products and services and successfully activated cellular phones and maintained cellular equipment Professional Education Program Coordinator Stanford University March 2012  –  March 2015  (3 years 1 month) Palo Alto, CA •\tPlan and coordinate multiple projects and events for Stanford Center for Professional Development (SCPD) within the Stanford School of Engineering \n•\tDevelop and manage web-based and in-class instructor-led courses within SCPD for international industry executives and students \n•\tDevelop relationships and provide customer service to participants and faculty before, during, and after events  \n•\tManage logistics, registration, payment, and organization of course materials for events  \n•\tTrain staff on basic SCPD assignments and event planning to more specific software designed for customer evaluations  \n•\tDesign interdepartmental staff schedules for pre-planning and during events Professional Education Program Coordinator Stanford University March 2012  –  March 2015  (3 years 1 month) Palo Alto, CA •\tPlan and coordinate multiple projects and events for Stanford Center for Professional Development (SCPD) within the Stanford School of Engineering \n•\tDevelop and manage web-based and in-class instructor-led courses within SCPD for international industry executives and students \n•\tDevelop relationships and provide customer service to participants and faculty before, during, and after events  \n•\tManage logistics, registration, payment, and organization of course materials for events  \n•\tTrain staff on basic SCPD assignments and event planning to more specific software designed for customer evaluations  \n•\tDesign interdepartmental staff schedules for pre-planning and during events Paraeducator San Bernardino Superintendant of Schools January 2010  –  July 2011  (1 year 7 months) San Bernardino, CA •\tAssisted educators in special education between K-12 and preschool  \n•\tOne on one attention to individual students for both educational and personal needs \n•\tSubstitute teacher for the entire district, requiring the generation and execution of lesson plans Paraeducator San Bernardino Superintendant of Schools January 2010  –  July 2011  (1 year 7 months) San Bernardino, CA •\tAssisted educators in special education between K-12 and preschool  \n•\tOne on one attention to individual students for both educational and personal needs \n•\tSubstitute teacher for the entire district, requiring the generation and execution of lesson plans Administrative Intern City of Riverside Human Resources July 2007  –  October 2007  (4 months) Riverside, CA •\tPerformed clerical skills essential to the operation of an office environment  \n•\tHandled the filing of employee disputes and created an efficient system for organizing private files  \n•\tExperience with human relations policies and filling of cases within HR department Administrative Intern City of Riverside Human Resources July 2007  –  October 2007  (4 months) Riverside, CA •\tPerformed clerical skills essential to the operation of an office environment  \n•\tHandled the filing of employee disputes and created an efficient system for organizing private files  \n•\tExperience with human relations policies and filling of cases within HR department Intern Office of Mayor Ronald Loveridge January 2007  –  July 2007  (7 months) Riverside, CA •\tPersonally assisting mayoral staff in city projects, including the Multicultural Youth Festival, Mayor’s Night Out, and the Sendai Festival \n•\tMain project involved researching the best practices of graffiti maintenance, which was followed by a written report. Intern Office of Mayor Ronald Loveridge January 2007  –  July 2007  (7 months) Riverside, CA •\tPersonally assisting mayoral staff in city projects, including the Multicultural Youth Festival, Mayor’s Night Out, and the Sendai Festival \n•\tMain project involved researching the best practices of graffiti maintenance, which was followed by a written report. Lab Technician Lenscrafters February 2007  –  May 2007  (4 months) Riverside, CA •\tLearned how to read Rx worksheets, pull lens stock, and use various machines that generate and finish lenses for prescription eyewear \n•\tWorked quickly and efficiently with people to produce multiple pairs of glasses within the allotted one hour Lab Technician Lenscrafters February 2007  –  May 2007  (4 months) Riverside, CA •\tLearned how to read Rx worksheets, pull lens stock, and use various machines that generate and finish lenses for prescription eyewear \n•\tWorked quickly and efficiently with people to produce multiple pairs of glasses within the allotted one hour Sales Representative Mobile Tron December 2005  –  January 2007  (1 year 2 months) Riverside, CA •\tDesigned a sales plan to attract customers within store and commit to service plans \n•\tInformed customers of our products and services and successfully activated cellular phones and maintained cellular equipment Sales Representative Mobile Tron December 2005  –  January 2007  (1 year 2 months) Riverside, CA •\tDesigned a sales plan to attract customers within store and commit to service plans \n•\tInformed customers of our products and services and successfully activated cellular phones and maintained cellular equipment Skills Legal Research Legal Writing Legal Assistance Clerical Skills Education Office Administration Microsoft Office Sales Customer Service Grant Writing Event Planning Program Coordination Nonprofits Program Development Relationship Management Entrepreneurship Public Speaking Strategic Planning See 3+     See less Skills  Legal Research Legal Writing Legal Assistance Clerical Skills Education Office Administration Microsoft Office Sales Customer Service Grant Writing Event Planning Program Coordination Nonprofits Program Development Relationship Management Entrepreneurship Public Speaking Strategic Planning See 3+     See less Legal Research Legal Writing Legal Assistance Clerical Skills Education Office Administration Microsoft Office Sales Customer Service Grant Writing Event Planning Program Coordination Nonprofits Program Development Relationship Management Entrepreneurship Public Speaking Strategic Planning See 3+     See less Legal Research Legal Writing Legal Assistance Clerical Skills Education Office Administration Microsoft Office Sales Customer Service Grant Writing Event Planning Program Coordination Nonprofits Program Development Relationship Management Entrepreneurship Public Speaking Strategic Planning See 3+     See less Education California Western School of Law 2010  – 2011 University of California, Riverside Bachelor of Arts (BA),  Political Science/Law and Society 2004  – 2009 Middle school/high school California Western School of Law 2010  – 2011 California Western School of Law 2010  – 2011 California Western School of Law 2010  – 2011 University of California, Riverside Bachelor of Arts (BA),  Political Science/Law and Society 2004  – 2009 University of California, Riverside Bachelor of Arts (BA),  Political Science/Law and Society 2004  – 2009 University of California, Riverside Bachelor of Arts (BA),  Political Science/Law and Society 2004  – 2009 Middle school/high school Middle school/high school Middle school/high school ", "Summary Experienced Event Manager; I strive to deliver exceptional events from concept to execution within budgets  \n• Event Manager for Stanford Center for Professional Development which grew from $20m annual revenue to $36m+ in 4 years; for all aspects of event services with events ranging from 10 to 800 executives and 95-120 programs annually  \n• Broad project management experience with expected May 2015 completion of Advanced Project Management certificate from Stanford University  \n• Eight years of event and logistics experience that included designing, building, and leading the event services team at Stanford Center for Professional Development while advising and helping build more efficient processes  \n• Well rounded leader due to diverse work experience; can switch to varied tasks expertly and keep multiple programs running simultaneously while maintaining focus on business priorities  \n• Creative, reliable and resourceful problem solver with multiple events, timeline management and variables working independently and with teams, depending on the program Summary Experienced Event Manager; I strive to deliver exceptional events from concept to execution within budgets  \n• Event Manager for Stanford Center for Professional Development which grew from $20m annual revenue to $36m+ in 4 years; for all aspects of event services with events ranging from 10 to 800 executives and 95-120 programs annually  \n• Broad project management experience with expected May 2015 completion of Advanced Project Management certificate from Stanford University  \n• Eight years of event and logistics experience that included designing, building, and leading the event services team at Stanford Center for Professional Development while advising and helping build more efficient processes  \n• Well rounded leader due to diverse work experience; can switch to varied tasks expertly and keep multiple programs running simultaneously while maintaining focus on business priorities  \n• Creative, reliable and resourceful problem solver with multiple events, timeline management and variables working independently and with teams, depending on the program Experienced Event Manager; I strive to deliver exceptional events from concept to execution within budgets  \n• Event Manager for Stanford Center for Professional Development which grew from $20m annual revenue to $36m+ in 4 years; for all aspects of event services with events ranging from 10 to 800 executives and 95-120 programs annually  \n• Broad project management experience with expected May 2015 completion of Advanced Project Management certificate from Stanford University  \n• Eight years of event and logistics experience that included designing, building, and leading the event services team at Stanford Center for Professional Development while advising and helping build more efficient processes  \n• Well rounded leader due to diverse work experience; can switch to varied tasks expertly and keep multiple programs running simultaneously while maintaining focus on business priorities  \n• Creative, reliable and resourceful problem solver with multiple events, timeline management and variables working independently and with teams, depending on the program Experienced Event Manager; I strive to deliver exceptional events from concept to execution within budgets  \n• Event Manager for Stanford Center for Professional Development which grew from $20m annual revenue to $36m+ in 4 years; for all aspects of event services with events ranging from 10 to 800 executives and 95-120 programs annually  \n• Broad project management experience with expected May 2015 completion of Advanced Project Management certificate from Stanford University  \n• Eight years of event and logistics experience that included designing, building, and leading the event services team at Stanford Center for Professional Development while advising and helping build more efficient processes  \n• Well rounded leader due to diverse work experience; can switch to varied tasks expertly and keep multiple programs running simultaneously while maintaining focus on business priorities  \n• Creative, reliable and resourceful problem solver with multiple events, timeline management and variables working independently and with teams, depending on the program Experience Event Manager Stanford University June 2015  – Present (3 months) Munger Conference Center Professional Education Event Manager Stanford University December 2012  – Present (2 years 9 months) Stanford, CA • Manage all details of event services for the Pro-Ed group including logistics, catering, meeting spaces, decor, transportation, audio/ visual, security, parking, event labor services, janitorial and other planning processes  \n• Maintain contracts and relationships with a wide array of vendors and suppliers internal and external to the University. Obtain bids, negotiate prices and finalize vendor contracts; process and reconcile payments and resolve billing disputes \n• Developed and implemented Stanford Box Event Services platform with over 1200 orders over the last two years for all team members to access orders and costs at all times  \n• Develop and manage to budgets while maintaining the quality and level of service to satisfy participants, faculty and staff Professional Education Program Coordinator Stanford University December 2011  –  December 2012  (1 year 1 month) Stanford, Palo Alto • Evaluated the event needs for programs and negotiated details of requested services  \n• Increased efficiencies and processes for rapid growth department for event services  \n• Built and executed programs from conception to event day success working with 35 different program managers, coordinators and directors Organizational Consultant Consultant October 2010  –  January 2012  (1 year 4 months) Palo Alto, CA Nutrihand, Inc \n• Coordinated business development and marketing strategy for nutrition management website \n• Managed social media and community relations \n \nProfessional Organizer and Assistant for private client \n* Archiving and photo editing \n* Administrative tasks \n* Handling various vendors \n \nReference available on request-client prefers to be private West Coast Operations Coordinator National Mobile Television May 2006  –  April 2009  (3 years) Handled all setup, teardown and operations at 40-60 events per month ranging from sporting events to entertainment concerts. Average cost of shows ranged from $20,000-$150,000  \n• Managed all National Mobile Television televised sporting events in Bay Area, Phoenix and additional spot business in the East Coast, Alaska and Canada  \n• Coordinated all shipping, rental equipment, travel, employees and client relations for $3m+ television trucks while consistently keeping costs down Event Staff Cisco 2009  –  2009  (less than a year) Olympics NBC Olympics January 2002  –  April 2006  (4 years 4 months) Torino, Italy, Athens,Greece and Salt Lake City, Utah Practice Rink Coordinator, Torino Olympics, NBC  \n• Handled setup and teardown of studios and practice rink; coordinated camera crews, international media and worked with security  \n• Provided support for broadcast crew stationed at venue; worked with lighting crew in Studio 1 and 2 and organized tasks for runners  \n \nRunner, Athens Olympics, NBC  \n• Part of SWAT team: a specialized team that handled operations for multiple Olympic events; supported camera crews with transport, scheduling and logistics  \n \nOlympic Reporter, Deseret News \n• Responsible for covering daily news briefings and several features; published 3-4 stories per week Purchasing Manager Stanford Prevention Research Center April 2005  –  January 2006  (10 months) * Handled ordering and purchasing for clinic and maintained contracts with vendors  \n* Supported four simultaneous studies with data analysis and grant research Event Manager Stanford University June 2015  – Present (3 months) Munger Conference Center Event Manager Stanford University June 2015  – Present (3 months) Munger Conference Center Professional Education Event Manager Stanford University December 2012  – Present (2 years 9 months) Stanford, CA • Manage all details of event services for the Pro-Ed group including logistics, catering, meeting spaces, decor, transportation, audio/ visual, security, parking, event labor services, janitorial and other planning processes  \n• Maintain contracts and relationships with a wide array of vendors and suppliers internal and external to the University. Obtain bids, negotiate prices and finalize vendor contracts; process and reconcile payments and resolve billing disputes \n• Developed and implemented Stanford Box Event Services platform with over 1200 orders over the last two years for all team members to access orders and costs at all times  \n• Develop and manage to budgets while maintaining the quality and level of service to satisfy participants, faculty and staff Professional Education Event Manager Stanford University December 2012  – Present (2 years 9 months) Stanford, CA • Manage all details of event services for the Pro-Ed group including logistics, catering, meeting spaces, decor, transportation, audio/ visual, security, parking, event labor services, janitorial and other planning processes  \n• Maintain contracts and relationships with a wide array of vendors and suppliers internal and external to the University. Obtain bids, negotiate prices and finalize vendor contracts; process and reconcile payments and resolve billing disputes \n• Developed and implemented Stanford Box Event Services platform with over 1200 orders over the last two years for all team members to access orders and costs at all times  \n• Develop and manage to budgets while maintaining the quality and level of service to satisfy participants, faculty and staff Professional Education Program Coordinator Stanford University December 2011  –  December 2012  (1 year 1 month) Stanford, Palo Alto • Evaluated the event needs for programs and negotiated details of requested services  \n• Increased efficiencies and processes for rapid growth department for event services  \n• Built and executed programs from conception to event day success working with 35 different program managers, coordinators and directors Professional Education Program Coordinator Stanford University December 2011  –  December 2012  (1 year 1 month) Stanford, Palo Alto • Evaluated the event needs for programs and negotiated details of requested services  \n• Increased efficiencies and processes for rapid growth department for event services  \n• Built and executed programs from conception to event day success working with 35 different program managers, coordinators and directors Organizational Consultant Consultant October 2010  –  January 2012  (1 year 4 months) Palo Alto, CA Nutrihand, Inc \n• Coordinated business development and marketing strategy for nutrition management website \n• Managed social media and community relations \n \nProfessional Organizer and Assistant for private client \n* Archiving and photo editing \n* Administrative tasks \n* Handling various vendors \n \nReference available on request-client prefers to be private Organizational Consultant Consultant October 2010  –  January 2012  (1 year 4 months) Palo Alto, CA Nutrihand, Inc \n• Coordinated business development and marketing strategy for nutrition management website \n• Managed social media and community relations \n \nProfessional Organizer and Assistant for private client \n* Archiving and photo editing \n* Administrative tasks \n* Handling various vendors \n \nReference available on request-client prefers to be private West Coast Operations Coordinator National Mobile Television May 2006  –  April 2009  (3 years) Handled all setup, teardown and operations at 40-60 events per month ranging from sporting events to entertainment concerts. Average cost of shows ranged from $20,000-$150,000  \n• Managed all National Mobile Television televised sporting events in Bay Area, Phoenix and additional spot business in the East Coast, Alaska and Canada  \n• Coordinated all shipping, rental equipment, travel, employees and client relations for $3m+ television trucks while consistently keeping costs down West Coast Operations Coordinator National Mobile Television May 2006  –  April 2009  (3 years) Handled all setup, teardown and operations at 40-60 events per month ranging from sporting events to entertainment concerts. Average cost of shows ranged from $20,000-$150,000  \n• Managed all National Mobile Television televised sporting events in Bay Area, Phoenix and additional spot business in the East Coast, Alaska and Canada  \n• Coordinated all shipping, rental equipment, travel, employees and client relations for $3m+ television trucks while consistently keeping costs down Event Staff Cisco 2009  –  2009  (less than a year) Event Staff Cisco 2009  –  2009  (less than a year) Olympics NBC Olympics January 2002  –  April 2006  (4 years 4 months) Torino, Italy, Athens,Greece and Salt Lake City, Utah Practice Rink Coordinator, Torino Olympics, NBC  \n• Handled setup and teardown of studios and practice rink; coordinated camera crews, international media and worked with security  \n• Provided support for broadcast crew stationed at venue; worked with lighting crew in Studio 1 and 2 and organized tasks for runners  \n \nRunner, Athens Olympics, NBC  \n• Part of SWAT team: a specialized team that handled operations for multiple Olympic events; supported camera crews with transport, scheduling and logistics  \n \nOlympic Reporter, Deseret News \n• Responsible for covering daily news briefings and several features; published 3-4 stories per week Olympics NBC Olympics January 2002  –  April 2006  (4 years 4 months) Torino, Italy, Athens,Greece and Salt Lake City, Utah Practice Rink Coordinator, Torino Olympics, NBC  \n• Handled setup and teardown of studios and practice rink; coordinated camera crews, international media and worked with security  \n• Provided support for broadcast crew stationed at venue; worked with lighting crew in Studio 1 and 2 and organized tasks for runners  \n \nRunner, Athens Olympics, NBC  \n• Part of SWAT team: a specialized team that handled operations for multiple Olympic events; supported camera crews with transport, scheduling and logistics  \n \nOlympic Reporter, Deseret News \n• Responsible for covering daily news briefings and several features; published 3-4 stories per week Purchasing Manager Stanford Prevention Research Center April 2005  –  January 2006  (10 months) * Handled ordering and purchasing for clinic and maintained contracts with vendors  \n* Supported four simultaneous studies with data analysis and grant research Purchasing Manager Stanford Prevention Research Center April 2005  –  January 2006  (10 months) * Handled ordering and purchasing for clinic and maintained contracts with vendors  \n* Supported four simultaneous studies with data analysis and grant research Skills Management Event Planning Marketing Strategy Public Speaking Nonprofits Fundraising Strategic Planning Marketing Project Planning Social Media Microsoft Word Editing Team Building Strategy Media Relations Leadership Program Development Business Development Volunteer Management Project Management International Relations Social Media Marketing Microsoft Excel Budgets Data Analysis Community Outreach Television Grant Writing See 13+     See less Skills  Management Event Planning Marketing Strategy Public Speaking Nonprofits Fundraising Strategic Planning Marketing Project Planning Social Media Microsoft Word Editing Team Building Strategy Media Relations Leadership Program Development Business Development Volunteer Management Project Management International Relations Social Media Marketing Microsoft Excel Budgets Data Analysis Community Outreach Television Grant Writing See 13+     See less Management Event Planning Marketing Strategy Public Speaking Nonprofits Fundraising Strategic Planning Marketing Project Planning Social Media Microsoft Word Editing Team Building Strategy Media Relations Leadership Program Development Business Development Volunteer Management Project Management International Relations Social Media Marketing Microsoft Excel Budgets Data Analysis Community Outreach Television Grant Writing See 13+     See less Management Event Planning Marketing Strategy Public Speaking Nonprofits Fundraising Strategic Planning Marketing Project Planning Social Media Microsoft Word Editing Team Building Strategy Media Relations Leadership Program Development Business Development Volunteer Management Project Management International Relations Social Media Marketing Microsoft Excel Budgets Data Analysis Community Outreach Television Grant Writing See 13+     See less Education Stanford University Stanford Business Executive Program, Advanced Project Management 2013  – 2015 Brigham Young University Bachelors,  Communication ,  Print Journalism 1999  – 2002 Activities and Societies:  Weekend Managing Editor; Daily Universe Brigham Young University - Idaho Communications, Journalism,  Journalism 1997  – 1999 Activities and Societies:  Honors ,  Reporter and Editor for the Scroll Stanford University Stanford Business Executive Program, Advanced Project Management 2013  – 2015 Stanford University Stanford Business Executive Program, Advanced Project Management 2013  – 2015 Stanford University Stanford Business Executive Program, Advanced Project Management 2013  – 2015 Brigham Young University Bachelors,  Communication ,  Print Journalism 1999  – 2002 Activities and Societies:  Weekend Managing Editor; Daily Universe Brigham Young University Bachelors,  Communication ,  Print Journalism 1999  – 2002 Activities and Societies:  Weekend Managing Editor; Daily Universe Brigham Young University Bachelors,  Communication ,  Print Journalism 1999  – 2002 Activities and Societies:  Weekend Managing Editor; Daily Universe Brigham Young University - Idaho Communications, Journalism,  Journalism 1997  – 1999 Activities and Societies:  Honors ,  Reporter and Editor for the Scroll Brigham Young University - Idaho Communications, Journalism,  Journalism 1997  – 1999 Activities and Societies:  Honors ,  Reporter and Editor for the Scroll Brigham Young University - Idaho Communications, Journalism,  Journalism 1997  – 1999 Activities and Societies:  Honors ,  Reporter and Editor for the Scroll ", "Experience Academic Program Administrator- Technology and Policy Program MIT June 2012  – Present (3 years 3 months) Cambridge, MA Academic Office- Engineering Systems Division MIT October 2008  –  June 2012  (3 years 9 months) Cambridge, MA Human Resources Service Center Stanford University January 2005  –  October 2006  (1 year 10 months) School of Humanities and Sciences Departments of Philosophy & Religious Studies- Finance Coordinator Stanford University November 2003  –  December 2004  (1 year 2 months) GSB- Executive Education- Program Coordinator Stanford University May 2001  –  September 2003  (2 years 5 months) Academic Program Administrator- Technology and Policy Program MIT June 2012  – Present (3 years 3 months) Cambridge, MA Academic Program Administrator- Technology and Policy Program MIT June 2012  – Present (3 years 3 months) Cambridge, MA Academic Office- Engineering Systems Division MIT October 2008  –  June 2012  (3 years 9 months) Cambridge, MA Academic Office- Engineering Systems Division MIT October 2008  –  June 2012  (3 years 9 months) Cambridge, MA Human Resources Service Center Stanford University January 2005  –  October 2006  (1 year 10 months) School of Humanities and Sciences Human Resources Service Center Stanford University January 2005  –  October 2006  (1 year 10 months) School of Humanities and Sciences Departments of Philosophy & Religious Studies- Finance Coordinator Stanford University November 2003  –  December 2004  (1 year 2 months) Departments of Philosophy & Religious Studies- Finance Coordinator Stanford University November 2003  –  December 2004  (1 year 2 months) GSB- Executive Education- Program Coordinator Stanford University May 2001  –  September 2003  (2 years 5 months) GSB- Executive Education- Program Coordinator Stanford University May 2001  –  September 2003  (2 years 5 months) Education Kent State University BS Kent State University BS Kent State University BS Kent State University BS ", "Experience Health Education Program Coordinator Stanford University Health Improvement Program November 2008  – Present (6 years 10 months) Health Education Program Manager Stanford University 2008  – Present (7 years) Health Education Program Coordinator Stanford University Health Improvement Program November 2008  – Present (6 years 10 months) Health Education Program Coordinator Stanford University Health Improvement Program November 2008  – Present (6 years 10 months) Health Education Program Manager Stanford University 2008  – Present (7 years) Health Education Program Manager Stanford University 2008  – Present (7 years) Skills Fitness Health Education Nonprofits Curriculum Development Research Statistics Editing Higher Education Public Health Strategic Planning Teaching Biotechnology Microsoft Office Strength Training Data Analysis Personal Training Wellness Coaching Policy Analysis Program Evaluation Nutrition Event Management Management Public Speaking SPSS Grant Writing Science Microsoft Excel Wellness PowerPoint Health Promotion Coaching Training Fitness Training Staff Development Program Development Qualitative Research Wellbeing Prevention Treatment Fundraising Social Media Community Outreach Event Planning Nutritional Counseling Hospitals Leadership Program Management Clinical Research Volunteer Management Healthcare See 35+     See less Skills  Fitness Health Education Nonprofits Curriculum Development Research Statistics Editing Higher Education Public Health Strategic Planning Teaching Biotechnology Microsoft Office Strength Training Data Analysis Personal Training Wellness Coaching Policy Analysis Program Evaluation Nutrition Event Management Management Public Speaking SPSS Grant Writing Science Microsoft Excel Wellness PowerPoint Health Promotion Coaching Training Fitness Training Staff Development Program Development Qualitative Research Wellbeing Prevention Treatment Fundraising Social Media Community Outreach Event Planning Nutritional Counseling Hospitals Leadership Program Management Clinical Research Volunteer Management Healthcare See 35+     See less Fitness Health Education Nonprofits Curriculum Development Research Statistics Editing Higher Education Public Health Strategic Planning Teaching Biotechnology Microsoft Office Strength Training Data Analysis Personal Training Wellness Coaching Policy Analysis Program Evaluation Nutrition Event Management Management Public Speaking SPSS Grant Writing Science Microsoft Excel Wellness PowerPoint Health Promotion Coaching Training Fitness Training Staff Development Program Development Qualitative Research Wellbeing Prevention Treatment Fundraising Social Media Community Outreach Event Planning Nutritional Counseling Hospitals Leadership Program Management Clinical Research Volunteer Management Healthcare See 35+     See less Fitness Health Education Nonprofits Curriculum Development Research Statistics Editing Higher Education Public Health Strategic Planning Teaching Biotechnology Microsoft Office Strength Training Data Analysis Personal Training Wellness Coaching Policy Analysis Program Evaluation Nutrition Event Management Management Public Speaking SPSS Grant Writing Science Microsoft Excel Wellness PowerPoint Health Promotion Coaching Training Fitness Training Staff Development Program Development Qualitative Research Wellbeing Prevention Treatment Fundraising Social Media Community Outreach Event Planning Nutritional Counseling Hospitals Leadership Program Management Clinical Research Volunteer Management Healthcare See 35+     See less ", "Experience Teaching Assistant Stanford Product Realization Lab September 2014  – Present (1 year) Stanford, CA Oversee students working in machine shop environment. Teach students fundamentals of machining and product creation. Help students, plan, design, prototype, then execute a quarter-long personal project. Mechanical Engineering Intern Lime Lab June 2014  –  September 2014  (4 months) San Francisco Bay Area Developed and executed reliability and optimization tests for consumer electronics product. Designed and prototyped test fixtures and parts. Course Assistant Stanford University September 2013  –  June 2014  (10 months) Stanford Course assistant for ME80, the undergraduate Mechanics of Materials course at Stanford University. I lead office hours and review sessions, help students with in-class examples, and grade homework and tests. Engineering Intern Channel Medsystems June 2013  –  September 2013  (4 months) San Francisco Engineering intern for Channel Medystems, a medical device startup. Designed and conducted bench-top tests to improve prototype commercial version of device. Oversaw and managed complete build of clinical version of device for pilot trial. Research Assistant Stanford University June 2012  –  September 2012  (4 months) Stanford Research Assistant in the nano-scale heat transfer laboratory. Focused on the thermal properties of the boundary between carbon nanotube samples and growth substrate. Utilized infrared microscopy techniques to study these boundaries. Designed and constructed rigs to thermally cycle samples to test effects of repeated heating on these samples. Also redesigned a laboratory activity for undergraduate heat transfer course. Outdoor Education Program Coordinator Stanford University June 2011  –  September 2011  (4 months) Stanford Student logistics coordinator for Stanford Pre-Orientation Trips, a program that sends over 250 incoming freshmen on student-lead backpacking trips throughout the California Sierra mountains. One of two student coordinators on a team of five, I organized routes, gear, food, transportation, and emergency plans for over 20 individual trips. I also managed the student volunteer staff that helped prepare the trips. Teaching Assistant Stanford Product Realization Lab September 2014  – Present (1 year) Stanford, CA Oversee students working in machine shop environment. Teach students fundamentals of machining and product creation. Help students, plan, design, prototype, then execute a quarter-long personal project. Teaching Assistant Stanford Product Realization Lab September 2014  – Present (1 year) Stanford, CA Oversee students working in machine shop environment. Teach students fundamentals of machining and product creation. Help students, plan, design, prototype, then execute a quarter-long personal project. Mechanical Engineering Intern Lime Lab June 2014  –  September 2014  (4 months) San Francisco Bay Area Developed and executed reliability and optimization tests for consumer electronics product. Designed and prototyped test fixtures and parts. Mechanical Engineering Intern Lime Lab June 2014  –  September 2014  (4 months) San Francisco Bay Area Developed and executed reliability and optimization tests for consumer electronics product. Designed and prototyped test fixtures and parts. Course Assistant Stanford University September 2013  –  June 2014  (10 months) Stanford Course assistant for ME80, the undergraduate Mechanics of Materials course at Stanford University. I lead office hours and review sessions, help students with in-class examples, and grade homework and tests. Course Assistant Stanford University September 2013  –  June 2014  (10 months) Stanford Course assistant for ME80, the undergraduate Mechanics of Materials course at Stanford University. I lead office hours and review sessions, help students with in-class examples, and grade homework and tests. Engineering Intern Channel Medsystems June 2013  –  September 2013  (4 months) San Francisco Engineering intern for Channel Medystems, a medical device startup. Designed and conducted bench-top tests to improve prototype commercial version of device. Oversaw and managed complete build of clinical version of device for pilot trial. Engineering Intern Channel Medsystems June 2013  –  September 2013  (4 months) San Francisco Engineering intern for Channel Medystems, a medical device startup. Designed and conducted bench-top tests to improve prototype commercial version of device. Oversaw and managed complete build of clinical version of device for pilot trial. Research Assistant Stanford University June 2012  –  September 2012  (4 months) Stanford Research Assistant in the nano-scale heat transfer laboratory. Focused on the thermal properties of the boundary between carbon nanotube samples and growth substrate. Utilized infrared microscopy techniques to study these boundaries. Designed and constructed rigs to thermally cycle samples to test effects of repeated heating on these samples. Also redesigned a laboratory activity for undergraduate heat transfer course. Research Assistant Stanford University June 2012  –  September 2012  (4 months) Stanford Research Assistant in the nano-scale heat transfer laboratory. Focused on the thermal properties of the boundary between carbon nanotube samples and growth substrate. Utilized infrared microscopy techniques to study these boundaries. Designed and constructed rigs to thermally cycle samples to test effects of repeated heating on these samples. Also redesigned a laboratory activity for undergraduate heat transfer course. Outdoor Education Program Coordinator Stanford University June 2011  –  September 2011  (4 months) Stanford Student logistics coordinator for Stanford Pre-Orientation Trips, a program that sends over 250 incoming freshmen on student-lead backpacking trips throughout the California Sierra mountains. One of two student coordinators on a team of five, I organized routes, gear, food, transportation, and emergency plans for over 20 individual trips. I also managed the student volunteer staff that helped prepare the trips. Outdoor Education Program Coordinator Stanford University June 2011  –  September 2011  (4 months) Stanford Student logistics coordinator for Stanford Pre-Orientation Trips, a program that sends over 250 incoming freshmen on student-lead backpacking trips throughout the California Sierra mountains. One of two student coordinators on a team of five, I organized routes, gear, food, transportation, and emergency plans for over 20 individual trips. I also managed the student volunteer staff that helped prepare the trips. Languages   Skills Solidworks Mechanical Engineering Engineering Matlab CAD Project Engineering Design for Manufacturing SolidWorks Machining Skills  Solidworks Mechanical Engineering Engineering Matlab CAD Project Engineering Design for Manufacturing SolidWorks Machining Solidworks Mechanical Engineering Engineering Matlab CAD Project Engineering Design for Manufacturing SolidWorks Machining Solidworks Mechanical Engineering Engineering Matlab CAD Project Engineering Design for Manufacturing SolidWorks Machining Education Stanford University Master's Degree,  Mechanical Engineering 2013  – 2015 Stanford University BS,  Mechanical Engineering 2009  – 2013 Stanford University Master's Degree,  Mechanical Engineering 2013  – 2015 Stanford University Master's Degree,  Mechanical Engineering 2013  – 2015 Stanford University Master's Degree,  Mechanical Engineering 2013  – 2015 Stanford University BS,  Mechanical Engineering 2009  – 2013 Stanford University BS,  Mechanical Engineering 2009  – 2013 Stanford University BS,  Mechanical Engineering 2009  – 2013 Honors & Awards "]}