{"position": "Electrical Engineer", "company": "Intel Corporation", "profiles": ["Summary Technology: GSM, CDMA, EVDO, LTE, OFDM \nProgramming: C/C++, Python, Perl, Verilog \nInstruments: Signal generators, analyzers, oscilloscope, R&S TS8980, Agilent VSA, channel emulator, Sanjole wavejudge. \nTools: MATLAB, Lab-windows CVI, LabView, Wireshark, Synopsys VCS, Modelsim/Questasim. \n \nSpecialties: - System Integration and Testing, RF Summary Technology: GSM, CDMA, EVDO, LTE, OFDM \nProgramming: C/C++, Python, Perl, Verilog \nInstruments: Signal generators, analyzers, oscilloscope, R&S TS8980, Agilent VSA, channel emulator, Sanjole wavejudge. \nTools: MATLAB, Lab-windows CVI, LabView, Wireshark, Synopsys VCS, Modelsim/Questasim. \n \nSpecialties: - System Integration and Testing, RF Technology: GSM, CDMA, EVDO, LTE, OFDM \nProgramming: C/C++, Python, Perl, Verilog \nInstruments: Signal generators, analyzers, oscilloscope, R&S TS8980, Agilent VSA, channel emulator, Sanjole wavejudge. \nTools: MATLAB, Lab-windows CVI, LabView, Wireshark, Synopsys VCS, Modelsim/Questasim. \n \nSpecialties: - System Integration and Testing, RF Technology: GSM, CDMA, EVDO, LTE, OFDM \nProgramming: C/C++, Python, Perl, Verilog \nInstruments: Signal generators, analyzers, oscilloscope, R&S TS8980, Agilent VSA, channel emulator, Sanjole wavejudge. \nTools: MATLAB, Lab-windows CVI, LabView, Wireshark, Synopsys VCS, Modelsim/Questasim. \n \nSpecialties: - System Integration and Testing, RF Experience Electrical Engineer Intel Corporation February 2013  – Present (2 years 7 months) Austin, Texas Area Responsible for verifying SOC design for the next generation mobile chipset. Sr. System Engineer ( LTE System Intergration and Testing ) Motorola Mobility August 2009  –  February 2013  (3 years 7 months) Austin, Texas Area - Physical layer validation based on 3GPP involves verifying RACH, UL power control, Handover (RSRP, RSRQ), cell selection - reselection functionality. \n- RF & RRM conformance testing of LTE chipset. \n- End to End performance testing and evaluation based on various propagation channels. \n- AFC and FFE characterization. \n- Test documentation, automation using NI-CVI. Test Engineer (System Integration and Testing ) Motorola Mobility Inc June 2008  –  December 2008  (7 months) - RF conformance testing based on 3GPP standard on LTE pre-silicon platform involving documenting test procedure, automation and execution. \n- End to End data throughput testing on LTE chipset with different transmission mode, channel profiles and modulation. Electrical Engineer Intel Corporation February 2013  – Present (2 years 7 months) Austin, Texas Area Responsible for verifying SOC design for the next generation mobile chipset. Electrical Engineer Intel Corporation February 2013  – Present (2 years 7 months) Austin, Texas Area Responsible for verifying SOC design for the next generation mobile chipset. Sr. System Engineer ( LTE System Intergration and Testing ) Motorola Mobility August 2009  –  February 2013  (3 years 7 months) Austin, Texas Area - Physical layer validation based on 3GPP involves verifying RACH, UL power control, Handover (RSRP, RSRQ), cell selection - reselection functionality. \n- RF & RRM conformance testing of LTE chipset. \n- End to End performance testing and evaluation based on various propagation channels. \n- AFC and FFE characterization. \n- Test documentation, automation using NI-CVI. Sr. System Engineer ( LTE System Intergration and Testing ) Motorola Mobility August 2009  –  February 2013  (3 years 7 months) Austin, Texas Area - Physical layer validation based on 3GPP involves verifying RACH, UL power control, Handover (RSRP, RSRQ), cell selection - reselection functionality. \n- RF & RRM conformance testing of LTE chipset. \n- End to End performance testing and evaluation based on various propagation channels. \n- AFC and FFE characterization. \n- Test documentation, automation using NI-CVI. Test Engineer (System Integration and Testing ) Motorola Mobility Inc June 2008  –  December 2008  (7 months) - RF conformance testing based on 3GPP standard on LTE pre-silicon platform involving documenting test procedure, automation and execution. \n- End to End data throughput testing on LTE chipset with different transmission mode, channel profiles and modulation. Test Engineer (System Integration and Testing ) Motorola Mobility Inc June 2008  –  December 2008  (7 months) - RF conformance testing based on 3GPP standard on LTE pre-silicon platform involving documenting test procedure, automation and execution. \n- End to End data throughput testing on LTE chipset with different transmission mode, channel profiles and modulation. Skills RTOS LTE 3GPP Mobile Communications Wireshark RF Testing CDMA GSM Matlab Telecommunications Agilent Verilog Automation VHDL Oscilloscope TCP/IP Transmission Programming Software Documentation ASIC Labview Embedded Software OFDM Java C++ FPGA Perl Linux C Debugging UMTS Python Digital Signal... 3G Unix Integration Mobile Devices See 23+     See less Skills  RTOS LTE 3GPP Mobile Communications Wireshark RF Testing CDMA GSM Matlab Telecommunications Agilent Verilog Automation VHDL Oscilloscope TCP/IP Transmission Programming Software Documentation ASIC Labview Embedded Software OFDM Java C++ FPGA Perl Linux C Debugging UMTS Python Digital Signal... 3G Unix Integration Mobile Devices See 23+     See less RTOS LTE 3GPP Mobile Communications Wireshark RF Testing CDMA GSM Matlab Telecommunications Agilent Verilog Automation VHDL Oscilloscope TCP/IP Transmission Programming Software Documentation ASIC Labview Embedded Software OFDM Java C++ FPGA Perl Linux C Debugging UMTS Python Digital Signal... 3G Unix Integration Mobile Devices See 23+     See less RTOS LTE 3GPP Mobile Communications Wireshark RF Testing CDMA GSM Matlab Telecommunications Agilent Verilog Automation VHDL Oscilloscope TCP/IP Transmission Programming Software Documentation ASIC Labview Embedded Software OFDM Java C++ FPGA Perl Linux C Debugging UMTS Python Digital Signal... 3G Unix Integration Mobile Devices See 23+     See less Education The University of Texas at Arlington MS,  Electrical Engineering 2007  – 2009 University of Mumbai BE,  Electrical/Electronics 2003  – 2007 The University of Texas at Arlington MS,  Electrical Engineering 2007  – 2009 The University of Texas at Arlington MS,  Electrical Engineering 2007  – 2009 The University of Texas at Arlington MS,  Electrical Engineering 2007  – 2009 University of Mumbai BE,  Electrical/Electronics 2003  – 2007 University of Mumbai BE,  Electrical/Electronics 2003  – 2007 University of Mumbai BE,  Electrical/Electronics 2003  – 2007 ", "Experience Electrical Engineer Intel Corporation April 2014  – Present (1 year 5 months) Yakum Electrical Engineer student Intel Corporation July 2013  –  March 2014  (9 months) Jerusalem QA team leader (full time) + Automatic QA (student) Time To Know December 2008  –  December 2013  (5 years 1 month) Electrical Engineer Intel Corporation April 2014  – Present (1 year 5 months) Yakum Electrical Engineer Intel Corporation April 2014  – Present (1 year 5 months) Yakum Electrical Engineer student Intel Corporation July 2013  –  March 2014  (9 months) Jerusalem Electrical Engineer student Intel Corporation July 2013  –  March 2014  (9 months) Jerusalem QA team leader (full time) + Automatic QA (student) Time To Know December 2008  –  December 2013  (5 years 1 month) QA team leader (full time) + Automatic QA (student) Time To Know December 2008  –  December 2013  (5 years 1 month) Skills Microsoft Excel PowerPoint Microsoft Office Testing Quality Assurance Object Oriented Design HTML SQL Databases Test Automation Agile Methodologies C Software Design Linux Skills  Microsoft Excel PowerPoint Microsoft Office Testing Quality Assurance Object Oriented Design HTML SQL Databases Test Automation Agile Methodologies C Software Design Linux Microsoft Excel PowerPoint Microsoft Office Testing Quality Assurance Object Oriented Design HTML SQL Databases Test Automation Agile Methodologies C Software Design Linux Microsoft Excel PowerPoint Microsoft Office Testing Quality Assurance Object Oriented Design HTML SQL Databases Test Automation Agile Methodologies C Software Design Linux Education Ben-Gurion University of the Negev Bachelor of Applied Science (B.A.Sc.) 2011  – 2014 Ben-Gurion University of the Negev Bachelor of Applied Science (B.A.Sc.) 2011  – 2014 Ben-Gurion University of the Negev Bachelor of Applied Science (B.A.Sc.) 2011  – 2014 Ben-Gurion University of the Negev Bachelor of Applied Science (B.A.Sc.) 2011  – 2014 ", "Experience Electrical Engineer Intel Corporation 2011  – Present (4 years) Allentown, Pennsylvania Area Electrical Engineer Infineon Technologies October 2007  –  February 2011  (3 years 5 months) MTS Agere Systems 1985  –  2006  (21 years) Electrical Engineer Intel Corporation 2011  – Present (4 years) Allentown, Pennsylvania Area Electrical Engineer Intel Corporation 2011  – Present (4 years) Allentown, Pennsylvania Area Electrical Engineer Infineon Technologies October 2007  –  February 2011  (3 years 5 months) Electrical Engineer Infineon Technologies October 2007  –  February 2011  (3 years 5 months) MTS Agere Systems 1985  –  2006  (21 years) MTS Agere Systems 1985  –  2006  (21 years) Skills SoC IC Embedded Systems ASIC TCL CMOS Semiconductors Debugging Engineering FPGA Analog Unix Timing Closure Electronics Verilog Static Timing Analysis Linux Hardware Architecture EDA Mixed Signal Circuit Design VLSI Integrated Circuit... Analog Circuit Design See 9+     See less Skills  SoC IC Embedded Systems ASIC TCL CMOS Semiconductors Debugging Engineering FPGA Analog Unix Timing Closure Electronics Verilog Static Timing Analysis Linux Hardware Architecture EDA Mixed Signal Circuit Design VLSI Integrated Circuit... Analog Circuit Design See 9+     See less SoC IC Embedded Systems ASIC TCL CMOS Semiconductors Debugging Engineering FPGA Analog Unix Timing Closure Electronics Verilog Static Timing Analysis Linux Hardware Architecture EDA Mixed Signal Circuit Design VLSI Integrated Circuit... Analog Circuit Design See 9+     See less SoC IC Embedded Systems ASIC TCL CMOS Semiconductors Debugging Engineering FPGA Analog Unix Timing Closure Electronics Verilog Static Timing Analysis Linux Hardware Architecture EDA Mixed Signal Circuit Design VLSI Integrated Circuit... Analog Circuit Design See 9+     See less Education University of California, Berkeley MSEE,  EECS 1986  – 1987 Bucknell University BSEE,  Electrical Engineering / Physics 1981  – 1985 Recieved a minor in Physics Activities and Societies:  Women's Basketball Team\nSWE\nIEEE\nAlph Chi Omega University of California, Berkeley MSEE,  EECS 1986  – 1987 University of California, Berkeley MSEE,  EECS 1986  – 1987 University of California, Berkeley MSEE,  EECS 1986  – 1987 Bucknell University BSEE,  Electrical Engineering / Physics 1981  – 1985 Recieved a minor in Physics Activities and Societies:  Women's Basketball Team\nSWE\nIEEE\nAlph Chi Omega Bucknell University BSEE,  Electrical Engineering / Physics 1981  – 1985 Recieved a minor in Physics Activities and Societies:  Women's Basketball Team\nSWE\nIEEE\nAlph Chi Omega Bucknell University BSEE,  Electrical Engineering / Physics 1981  – 1985 Recieved a minor in Physics Activities and Societies:  Women's Basketball Team\nSWE\nIEEE\nAlph Chi Omega ", "Experience Electrical Engineer Intel Corporation June 2011  – Present (4 years 3 months) Aircraft Electrician United States Air Force September 1989  –  September 2009  (20 years 1 month) Electrical Engineer Intel Corporation June 2011  – Present (4 years 3 months) Electrical Engineer Intel Corporation June 2011  – Present (4 years 3 months) Aircraft Electrician United States Air Force September 1989  –  September 2009  (20 years 1 month) Aircraft Electrician United States Air Force September 1989  –  September 2009  (20 years 1 month) Skills Analog Circuit Design Mixed-Signal IC Design Product Development Management Skills  Analog Circuit Design Mixed-Signal IC Design Product Development Management Analog Circuit Design Mixed-Signal IC Design Product Development Management Analog Circuit Design Mixed-Signal IC Design Product Development Management Education California State University-Sacramento Master of Science (MS),  Electrical and Electronics Engineering 2011  – 2014 Analog and Mixed Signal IC Design California State University-Sacramento Bachelor of Science (BS),  Electrical and Electronics Engineering 2007  – 2011 Magna Cum Laude California State University-Sacramento Master of Science (MS),  Electrical and Electronics Engineering 2011  – 2014 Analog and Mixed Signal IC Design California State University-Sacramento Master of Science (MS),  Electrical and Electronics Engineering 2011  – 2014 Analog and Mixed Signal IC Design California State University-Sacramento Master of Science (MS),  Electrical and Electronics Engineering 2011  – 2014 Analog and Mixed Signal IC Design California State University-Sacramento Bachelor of Science (BS),  Electrical and Electronics Engineering 2007  – 2011 Magna Cum Laude California State University-Sacramento Bachelor of Science (BS),  Electrical and Electronics Engineering 2007  – 2011 Magna Cum Laude California State University-Sacramento Bachelor of Science (BS),  Electrical and Electronics Engineering 2007  – 2011 Magna Cum Laude ", "Experience Electrical Engineer Intel Corporation July 2013  – Present (2 years 2 months) Jerusalem, Israel QA LTGO 2008  –  2009  (1 year) Electrical Engineer Intel Corporation July 2013  – Present (2 years 2 months) Jerusalem, Israel Electrical Engineer Intel Corporation July 2013  – Present (2 years 2 months) Jerusalem, Israel QA LTGO 2008  –  2009  (1 year) QA LTGO 2008  –  2009  (1 year) Skills Program Development Microsoft Word Microsoft Excel PowerPoint Financial Analysis Community Outreach Customer Service Microsoft Office Skills  Program Development Microsoft Word Microsoft Excel PowerPoint Financial Analysis Community Outreach Customer Service Microsoft Office Program Development Microsoft Word Microsoft Excel PowerPoint Financial Analysis Community Outreach Customer Service Microsoft Office Program Development Microsoft Word Microsoft Excel PowerPoint Financial Analysis Community Outreach Customer Service Microsoft Office Education The Hebrew University Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2010  – 2014 The Hebrew University Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2010  – 2014 The Hebrew University Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2010  – 2014 The Hebrew University Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2010  – 2014 ", "Experience electrical engineer Intel Corporation August 2009  – Present (6 years 1 month) electrical engineer Intel Corporation August 2009  – Present (6 years 1 month) electrical engineer Intel Corporation August 2009  – Present (6 years 1 month) Skills Signal Processing Logic Design C Matlab Semiconductors SoC Algorithms C++ Digital Signal... VHDL Skills  Signal Processing Logic Design C Matlab Semiconductors SoC Algorithms C++ Digital Signal... VHDL Signal Processing Logic Design C Matlab Semiconductors SoC Algorithms C++ Digital Signal... VHDL Signal Processing Logic Design C Matlab Semiconductors SoC Algorithms C++ Digital Signal... VHDL Education Tel Aviv University 2012  – 2014 Technion - Israel Institute of Technology BS,  electrical engineering 2007  – 2011 Tel Aviv University 2012  – 2014 Tel Aviv University 2012  – 2014 Tel Aviv University 2012  – 2014 Technion - Israel Institute of Technology BS,  electrical engineering 2007  – 2011 Technion - Israel Institute of Technology BS,  electrical engineering 2007  – 2011 Technion - Israel Institute of Technology BS,  electrical engineering 2007  – 2011 ", "Summary Project Management, Engineering design and implementation (Electrical, Automation, Life Safety), Contracts development and negotiation. Specialties:Controls and Automation \nInstrumentation and Life / Safety \nPower Distribution \nHigh Efficiency Lighting Retrofits Summary Project Management, Engineering design and implementation (Electrical, Automation, Life Safety), Contracts development and negotiation. Specialties:Controls and Automation \nInstrumentation and Life / Safety \nPower Distribution \nHigh Efficiency Lighting Retrofits Project Management, Engineering design and implementation (Electrical, Automation, Life Safety), Contracts development and negotiation. Specialties:Controls and Automation \nInstrumentation and Life / Safety \nPower Distribution \nHigh Efficiency Lighting Retrofits Project Management, Engineering design and implementation (Electrical, Automation, Life Safety), Contracts development and negotiation. Specialties:Controls and Automation \nInstrumentation and Life / Safety \nPower Distribution \nHigh Efficiency Lighting Retrofits Experience Electrical Engineer Intel Corporation May 2013  – Present (2 years 4 months) Portland, Oregon Area Senior Facilities Electrical Engineer SEH America December 1992  –  May 2013  (20 years 6 months) Facility engineering including project engineering and sustaining maintenance responsibilities. Design systems, specify, purchase, install, and commission equipment. Coordinate contract labor and support in-house maintenance technicians. Oversee operation of distribution equipment and monitor energy use, contracts, and billing. Also design, programming and startup of various control and life safety systems such as waste treatment systems, Scrubbers and chemical distribution systems. Very familiar with various PLC systems and in particular Allen Bradley line of PLCs. \n \nProjects included: \nCommissioning of new power distribution and also all controls associated with a new scrubber building . Commissioning of new water treatment facility within Vancouver Washington campus that also included all new power distribution system and associated controls and fire alarm. Electrical project engineer and design for various phases of SEH Building 65 expansion. Project budgets in excess of $6.7 MM. Service Manager Industrial Drive Maintenance, Inc January 1991  –  January 1994  (3 years 1 month) Performed budgeting, planning and coordination with sales department for installation, design and retrofit of various control systems. Managed a group of 7 field service engineers for both in-house and also field work in Texas and Oklahoma regions. Provided in-field support for the service engineers as needed. Worked with the design group both in Dallas and Houston for successful implementation and startup of the PLC based systems. Field Service Engineer Industrial Drive Maintenance, Inc January 1986  –  January 1991  (5 years 1 month) Performed many tasks of design, modernization, installation, component level repair and startup of various automation systems consisting of AC and DC variable frequency drives , PLCs and other control systems in manufacturing facilities. These included, but not limited to many projects involving printing press automations, various forms of plastic and PVC manufacturing controls, and addition of systems in an existing building material manufacturing plant and many other projects within Texas, and Oklahoma. \n \nProjects included: \nInstallation of new and also retrofit of old automation printing equipment at Dixico, Inc in Dallas area. Design and startup of new production control system in U.S. Gypsum company in North Texas. Modification and improvements to existing equipment, electrical and controls, Electrical Engineer Intel Corporation May 2013  – Present (2 years 4 months) Portland, Oregon Area Electrical Engineer Intel Corporation May 2013  – Present (2 years 4 months) Portland, Oregon Area Senior Facilities Electrical Engineer SEH America December 1992  –  May 2013  (20 years 6 months) Facility engineering including project engineering and sustaining maintenance responsibilities. Design systems, specify, purchase, install, and commission equipment. Coordinate contract labor and support in-house maintenance technicians. Oversee operation of distribution equipment and monitor energy use, contracts, and billing. Also design, programming and startup of various control and life safety systems such as waste treatment systems, Scrubbers and chemical distribution systems. Very familiar with various PLC systems and in particular Allen Bradley line of PLCs. \n \nProjects included: \nCommissioning of new power distribution and also all controls associated with a new scrubber building . Commissioning of new water treatment facility within Vancouver Washington campus that also included all new power distribution system and associated controls and fire alarm. Electrical project engineer and design for various phases of SEH Building 65 expansion. Project budgets in excess of $6.7 MM. Senior Facilities Electrical Engineer SEH America December 1992  –  May 2013  (20 years 6 months) Facility engineering including project engineering and sustaining maintenance responsibilities. Design systems, specify, purchase, install, and commission equipment. Coordinate contract labor and support in-house maintenance technicians. Oversee operation of distribution equipment and monitor energy use, contracts, and billing. Also design, programming and startup of various control and life safety systems such as waste treatment systems, Scrubbers and chemical distribution systems. Very familiar with various PLC systems and in particular Allen Bradley line of PLCs. \n \nProjects included: \nCommissioning of new power distribution and also all controls associated with a new scrubber building . Commissioning of new water treatment facility within Vancouver Washington campus that also included all new power distribution system and associated controls and fire alarm. Electrical project engineer and design for various phases of SEH Building 65 expansion. Project budgets in excess of $6.7 MM. Service Manager Industrial Drive Maintenance, Inc January 1991  –  January 1994  (3 years 1 month) Performed budgeting, planning and coordination with sales department for installation, design and retrofit of various control systems. Managed a group of 7 field service engineers for both in-house and also field work in Texas and Oklahoma regions. Provided in-field support for the service engineers as needed. Worked with the design group both in Dallas and Houston for successful implementation and startup of the PLC based systems. Service Manager Industrial Drive Maintenance, Inc January 1991  –  January 1994  (3 years 1 month) Performed budgeting, planning and coordination with sales department for installation, design and retrofit of various control systems. Managed a group of 7 field service engineers for both in-house and also field work in Texas and Oklahoma regions. Provided in-field support for the service engineers as needed. Worked with the design group both in Dallas and Houston for successful implementation and startup of the PLC based systems. Field Service Engineer Industrial Drive Maintenance, Inc January 1986  –  January 1991  (5 years 1 month) Performed many tasks of design, modernization, installation, component level repair and startup of various automation systems consisting of AC and DC variable frequency drives , PLCs and other control systems in manufacturing facilities. These included, but not limited to many projects involving printing press automations, various forms of plastic and PVC manufacturing controls, and addition of systems in an existing building material manufacturing plant and many other projects within Texas, and Oklahoma. \n \nProjects included: \nInstallation of new and also retrofit of old automation printing equipment at Dixico, Inc in Dallas area. Design and startup of new production control system in U.S. Gypsum company in North Texas. Modification and improvements to existing equipment, electrical and controls, Field Service Engineer Industrial Drive Maintenance, Inc January 1986  –  January 1991  (5 years 1 month) Performed many tasks of design, modernization, installation, component level repair and startup of various automation systems consisting of AC and DC variable frequency drives , PLCs and other control systems in manufacturing facilities. These included, but not limited to many projects involving printing press automations, various forms of plastic and PVC manufacturing controls, and addition of systems in an existing building material manufacturing plant and many other projects within Texas, and Oklahoma. \n \nProjects included: \nInstallation of new and also retrofit of old automation printing equipment at Dixico, Inc in Dallas area. Design and startup of new production control system in U.S. Gypsum company in North Texas. Modification and improvements to existing equipment, electrical and controls, Skills Electrical Engineering Six Sigma Automation Process Control Electricians Commissioning Project Engineering Manufacturing Troubleshooting Power Distribution Electronics AutoCAD Project Planning PLC Control Systems Design Semiconductors Engineering Lean Manufacturing Process Engineering Instrumentation Electricity Project Management Construction Energy Efficiency Continuous Improvement Root Cause Analysis Allen Bradley CAD See 13+     See less Skills  Electrical Engineering Six Sigma Automation Process Control Electricians Commissioning Project Engineering Manufacturing Troubleshooting Power Distribution Electronics AutoCAD Project Planning PLC Control Systems Design Semiconductors Engineering Lean Manufacturing Process Engineering Instrumentation Electricity Project Management Construction Energy Efficiency Continuous Improvement Root Cause Analysis Allen Bradley CAD See 13+     See less Electrical Engineering Six Sigma Automation Process Control Electricians Commissioning Project Engineering Manufacturing Troubleshooting Power Distribution Electronics AutoCAD Project Planning PLC Control Systems Design Semiconductors Engineering Lean Manufacturing Process Engineering Instrumentation Electricity Project Management Construction Energy Efficiency Continuous Improvement Root Cause Analysis Allen Bradley CAD See 13+     See less Electrical Engineering Six Sigma Automation Process Control Electricians Commissioning Project Engineering Manufacturing Troubleshooting Power Distribution Electronics AutoCAD Project Planning PLC Control Systems Design Semiconductors Engineering Lean Manufacturing Process Engineering Instrumentation Electricity Project Management Construction Energy Efficiency Continuous Improvement Root Cause Analysis Allen Bradley CAD See 13+     See less Education University of Louisiana at Lafayette Bachelor of Science,  Electrical Engineering 1979  – 1983 University of Louisiana at Lafayette Bachelor of Science,  Electrical Engineering 1979  – 1983 University of Louisiana at Lafayette Bachelor of Science,  Electrical Engineering 1979  – 1983 University of Louisiana at Lafayette Bachelor of Science,  Electrical Engineering 1979  – 1983 ", "Summary Electronic packaging technology and design; high-speed optical and electrical test and measurement; mm-wave simulation, design, and characterization; wearable and flexible system development; system prototyping; signal integrity; test system design, magneto-optics, and applied electromagnetics Summary Electronic packaging technology and design; high-speed optical and electrical test and measurement; mm-wave simulation, design, and characterization; wearable and flexible system development; system prototyping; signal integrity; test system design, magneto-optics, and applied electromagnetics Electronic packaging technology and design; high-speed optical and electrical test and measurement; mm-wave simulation, design, and characterization; wearable and flexible system development; system prototyping; signal integrity; test system design, magneto-optics, and applied electromagnetics Electronic packaging technology and design; high-speed optical and electrical test and measurement; mm-wave simulation, design, and characterization; wearable and flexible system development; system prototyping; signal integrity; test system design, magneto-optics, and applied electromagnetics Experience R&D Electrical Engineer Intel Corporation July 2012  – Present (3 years 2 months) Chandler, AZ R&D Engineer, Components Research – Electronic Packaging \n Researched and enabled next-generation electronic-packaging technologies for semiconductor products with focus areas in mm-wave research, sensor development, and flexible and wearables systems \n Evaluated novel materials and architectures for mm-wave systems (up to 140 GHz) through test vehicle design, including simulation (HFSS) and measurements (VNA and probe station) of packaged structures \n Designed and implemented testing systems and methodologies for novel sensors, including system simulation, test-board PCB design and layout, system measurement and automation, and data analysis \n Identified materials and assembly methods for wearable and flexible technologies through design and electrical and mechanical evaluation of flexible boards, printed inks, and assembly test-vehicles \n Submitted 19 invention disclosures, 10 of which resulted in patent applications being filed with the Patent & Trademark Office \n Advised external University research on novel battery technology; evaluated research proposals Rotation Engineer Intel Corporation July 2011  –  January 2013  (1 year 7 months) Chandler, AZ and Santa Clara, CA Components Research Packaging - 6 month rotation \nRotation Engineering Program \nJuly 11- Jan 13 \nSilicon Photonics Organization (Intel Labs) – Optical R&D Engineer – 6 month rotation \n Characterized high-speed optical performance of SPO’s optical transceivers using optical DCA, optical spectrum analyzer, photodetectors, and other optical hardware \n Investigated propagation characteristics, including modal imaging and impact of various factors on high-speed metrics \n Supported in developing an optical test solution for high volume manufacturing – resulting in granted Patent \nSort Test Technology Development (STTD) – Test R&D Engineer – 6 month rotation \n Researched test solutions for high volume test units for signal integrity, testability, space, and cost \n Designed experiments, simulated, and evaluated signal integrity for socket pins \nTest Research Instructor of Record- Iowa State University Iowa State University May 2011  –  July 2011  (3 months) Ames, IA •\tInstructor of Record for EE442 (Introduction to Circuits and Instrumentation, 150 students) - created and executed syllabus, developed course material, and delivered lectures, managed 3 TAs \n•\tInstructor of Record for EE201 (Electric Circuits, 18 students) - created and executed syllabus, developed and delivered 34 lectures, 4 exams, daily homework, and administered 12 lab sessions Research Assistant Iowa State University August 2007  –  May 2011  (3 years 10 months) >Proposed and implemented magneto-optic, fiber-based, interferometric switch system for packet switching applications in all-optical DWDM networks \n>Designed and performed experiments and measurements on fiber optic devices and systems using optical spectrum analyzer, optical polarizer, optical power sensor, low power lasers, passive fiber-optic components (eg. optical circulator), and photodetector \n>Simulation, design, layout, development, and testing of high speed and RF electronic circuitry using MATLAB (extensive), ADS, PSPICE, AutoCAD, network analyzer, spectrum analyzer, TDR, digital oscilloscope, and picosecond pulse generator; >Automated experiments and data collection through hardware control with Matlab (via GPIB) \n>Developed magnetic imaging system materials with fiber-based system based on Faraday rotation \n>Presented at IEEE sponsored conferences (Primarily MMM and Intermag) \n>Assisted in writing grants and disclosure applications and related documents Test R&D Engineering Intel May 2010  –  July 2010  (3 months) >Designed high speed prototype board (10 Gbps) to characterize components for new test methodology \n>Used 12-port VNA to measure scattering parameters, perform TDR, and evaluate signal integrity \n> Researched and evaluated system requirements for implementation of a novel test technology \n>Presented findings along with recommendations on system implementation and component selection Hardware Engineering Digi International May 2007  –  August 2007  (4 months) - Tested Zigbee devices for thermal, range, and transmission properties \n- Designed and prototyped Zigbee enabled AC power controller \n- Tested market-ready devices at TUV for compliance with emission specifications Public Policy Associate IEEE USA May 2005  –  August 2005  (4 months) Wrote policy paper on financial incentives for wind energy and implementation issues \nPresented policy recommendations on wind energy policy focused on financial incentives \nMet with government agencies and NGOs create effective policy recommendations Embedded Software Engineering John Deere May 2005  –  August 2005  (4 months) -- Designed graphical user interface for diagnostics on the GPS Precision Farming GreenStar Display \n-- Programmed diagnostic screen for touch screen display in C++ \n-- Tested screens with equipment simulators and StarFire GPS receiver R&D Electrical Engineer Intel Corporation July 2012  – Present (3 years 2 months) Chandler, AZ R&D Engineer, Components Research – Electronic Packaging \n Researched and enabled next-generation electronic-packaging technologies for semiconductor products with focus areas in mm-wave research, sensor development, and flexible and wearables systems \n Evaluated novel materials and architectures for mm-wave systems (up to 140 GHz) through test vehicle design, including simulation (HFSS) and measurements (VNA and probe station) of packaged structures \n Designed and implemented testing systems and methodologies for novel sensors, including system simulation, test-board PCB design and layout, system measurement and automation, and data analysis \n Identified materials and assembly methods for wearable and flexible technologies through design and electrical and mechanical evaluation of flexible boards, printed inks, and assembly test-vehicles \n Submitted 19 invention disclosures, 10 of which resulted in patent applications being filed with the Patent & Trademark Office \n Advised external University research on novel battery technology; evaluated research proposals R&D Electrical Engineer Intel Corporation July 2012  – Present (3 years 2 months) Chandler, AZ R&D Engineer, Components Research – Electronic Packaging \n Researched and enabled next-generation electronic-packaging technologies for semiconductor products with focus areas in mm-wave research, sensor development, and flexible and wearables systems \n Evaluated novel materials and architectures for mm-wave systems (up to 140 GHz) through test vehicle design, including simulation (HFSS) and measurements (VNA and probe station) of packaged structures \n Designed and implemented testing systems and methodologies for novel sensors, including system simulation, test-board PCB design and layout, system measurement and automation, and data analysis \n Identified materials and assembly methods for wearable and flexible technologies through design and electrical and mechanical evaluation of flexible boards, printed inks, and assembly test-vehicles \n Submitted 19 invention disclosures, 10 of which resulted in patent applications being filed with the Patent & Trademark Office \n Advised external University research on novel battery technology; evaluated research proposals Rotation Engineer Intel Corporation July 2011  –  January 2013  (1 year 7 months) Chandler, AZ and Santa Clara, CA Components Research Packaging - 6 month rotation \nRotation Engineering Program \nJuly 11- Jan 13 \nSilicon Photonics Organization (Intel Labs) – Optical R&D Engineer – 6 month rotation \n Characterized high-speed optical performance of SPO’s optical transceivers using optical DCA, optical spectrum analyzer, photodetectors, and other optical hardware \n Investigated propagation characteristics, including modal imaging and impact of various factors on high-speed metrics \n Supported in developing an optical test solution for high volume manufacturing – resulting in granted Patent \nSort Test Technology Development (STTD) – Test R&D Engineer – 6 month rotation \n Researched test solutions for high volume test units for signal integrity, testability, space, and cost \n Designed experiments, simulated, and evaluated signal integrity for socket pins \nTest Research Rotation Engineer Intel Corporation July 2011  –  January 2013  (1 year 7 months) Chandler, AZ and Santa Clara, CA Components Research Packaging - 6 month rotation \nRotation Engineering Program \nJuly 11- Jan 13 \nSilicon Photonics Organization (Intel Labs) – Optical R&D Engineer – 6 month rotation \n Characterized high-speed optical performance of SPO’s optical transceivers using optical DCA, optical spectrum analyzer, photodetectors, and other optical hardware \n Investigated propagation characteristics, including modal imaging and impact of various factors on high-speed metrics \n Supported in developing an optical test solution for high volume manufacturing – resulting in granted Patent \nSort Test Technology Development (STTD) – Test R&D Engineer – 6 month rotation \n Researched test solutions for high volume test units for signal integrity, testability, space, and cost \n Designed experiments, simulated, and evaluated signal integrity for socket pins \nTest Research Instructor of Record- Iowa State University Iowa State University May 2011  –  July 2011  (3 months) Ames, IA •\tInstructor of Record for EE442 (Introduction to Circuits and Instrumentation, 150 students) - created and executed syllabus, developed course material, and delivered lectures, managed 3 TAs \n•\tInstructor of Record for EE201 (Electric Circuits, 18 students) - created and executed syllabus, developed and delivered 34 lectures, 4 exams, daily homework, and administered 12 lab sessions Instructor of Record- Iowa State University Iowa State University May 2011  –  July 2011  (3 months) Ames, IA •\tInstructor of Record for EE442 (Introduction to Circuits and Instrumentation, 150 students) - created and executed syllabus, developed course material, and delivered lectures, managed 3 TAs \n•\tInstructor of Record for EE201 (Electric Circuits, 18 students) - created and executed syllabus, developed and delivered 34 lectures, 4 exams, daily homework, and administered 12 lab sessions Research Assistant Iowa State University August 2007  –  May 2011  (3 years 10 months) >Proposed and implemented magneto-optic, fiber-based, interferometric switch system for packet switching applications in all-optical DWDM networks \n>Designed and performed experiments and measurements on fiber optic devices and systems using optical spectrum analyzer, optical polarizer, optical power sensor, low power lasers, passive fiber-optic components (eg. optical circulator), and photodetector \n>Simulation, design, layout, development, and testing of high speed and RF electronic circuitry using MATLAB (extensive), ADS, PSPICE, AutoCAD, network analyzer, spectrum analyzer, TDR, digital oscilloscope, and picosecond pulse generator; >Automated experiments and data collection through hardware control with Matlab (via GPIB) \n>Developed magnetic imaging system materials with fiber-based system based on Faraday rotation \n>Presented at IEEE sponsored conferences (Primarily MMM and Intermag) \n>Assisted in writing grants and disclosure applications and related documents Research Assistant Iowa State University August 2007  –  May 2011  (3 years 10 months) >Proposed and implemented magneto-optic, fiber-based, interferometric switch system for packet switching applications in all-optical DWDM networks \n>Designed and performed experiments and measurements on fiber optic devices and systems using optical spectrum analyzer, optical polarizer, optical power sensor, low power lasers, passive fiber-optic components (eg. optical circulator), and photodetector \n>Simulation, design, layout, development, and testing of high speed and RF electronic circuitry using MATLAB (extensive), ADS, PSPICE, AutoCAD, network analyzer, spectrum analyzer, TDR, digital oscilloscope, and picosecond pulse generator; >Automated experiments and data collection through hardware control with Matlab (via GPIB) \n>Developed magnetic imaging system materials with fiber-based system based on Faraday rotation \n>Presented at IEEE sponsored conferences (Primarily MMM and Intermag) \n>Assisted in writing grants and disclosure applications and related documents Test R&D Engineering Intel May 2010  –  July 2010  (3 months) >Designed high speed prototype board (10 Gbps) to characterize components for new test methodology \n>Used 12-port VNA to measure scattering parameters, perform TDR, and evaluate signal integrity \n> Researched and evaluated system requirements for implementation of a novel test technology \n>Presented findings along with recommendations on system implementation and component selection Test R&D Engineering Intel May 2010  –  July 2010  (3 months) >Designed high speed prototype board (10 Gbps) to characterize components for new test methodology \n>Used 12-port VNA to measure scattering parameters, perform TDR, and evaluate signal integrity \n> Researched and evaluated system requirements for implementation of a novel test technology \n>Presented findings along with recommendations on system implementation and component selection Hardware Engineering Digi International May 2007  –  August 2007  (4 months) - Tested Zigbee devices for thermal, range, and transmission properties \n- Designed and prototyped Zigbee enabled AC power controller \n- Tested market-ready devices at TUV for compliance with emission specifications Hardware Engineering Digi International May 2007  –  August 2007  (4 months) - Tested Zigbee devices for thermal, range, and transmission properties \n- Designed and prototyped Zigbee enabled AC power controller \n- Tested market-ready devices at TUV for compliance with emission specifications Public Policy Associate IEEE USA May 2005  –  August 2005  (4 months) Wrote policy paper on financial incentives for wind energy and implementation issues \nPresented policy recommendations on wind energy policy focused on financial incentives \nMet with government agencies and NGOs create effective policy recommendations Public Policy Associate IEEE USA May 2005  –  August 2005  (4 months) Wrote policy paper on financial incentives for wind energy and implementation issues \nPresented policy recommendations on wind energy policy focused on financial incentives \nMet with government agencies and NGOs create effective policy recommendations Embedded Software Engineering John Deere May 2005  –  August 2005  (4 months) -- Designed graphical user interface for diagnostics on the GPS Precision Farming GreenStar Display \n-- Programmed diagnostic screen for touch screen display in C++ \n-- Tested screens with equipment simulators and StarFire GPS receiver Embedded Software Engineering John Deere May 2005  –  August 2005  (4 months) -- Designed graphical user interface for diagnostics on the GPS Precision Farming GreenStar Display \n-- Programmed diagnostic screen for touch screen display in C++ \n-- Tested screens with equipment simulators and StarFire GPS receiver Languages English English English Skills Electrical Engineering Optical Engineering Testing High-speed Design Electronics Matlab Simulations Engineering RF Hardware R&D Automation Spectrum Analyzer Sensors Antenna Measurements Network Analyzer See 1+     See less Skills  Electrical Engineering Optical Engineering Testing High-speed Design Electronics Matlab Simulations Engineering RF Hardware R&D Automation Spectrum Analyzer Sensors Antenna Measurements Network Analyzer See 1+     See less Electrical Engineering Optical Engineering Testing High-speed Design Electronics Matlab Simulations Engineering RF Hardware R&D Automation Spectrum Analyzer Sensors Antenna Measurements Network Analyzer See 1+     See less Electrical Engineering Optical Engineering Testing High-speed Design Electronics Matlab Simulations Engineering RF Hardware R&D Automation Spectrum Analyzer Sensors Antenna Measurements Network Analyzer See 1+     See less Education Iowa State University Ph.D.,  Electrical Engineering 2007  – 2011 Title: Interferometric methods of magneto-optic optical switching \nConcentration: Fiber optic switching and devices, magneto-optic materials \nMajor Professors: Mani Mina and Robert J. Weber Iowa State University Bachelors of Science; ISU,  Electrical Engineering; Electrical and Computer Engineering Department 2003  – 2007 Iowa State University Ph.D.,  Electrical Engineering 2007  – 2011 Title: Interferometric methods of magneto-optic optical switching \nConcentration: Fiber optic switching and devices, magneto-optic materials \nMajor Professors: Mani Mina and Robert J. Weber Iowa State University Ph.D.,  Electrical Engineering 2007  – 2011 Title: Interferometric methods of magneto-optic optical switching \nConcentration: Fiber optic switching and devices, magneto-optic materials \nMajor Professors: Mani Mina and Robert J. Weber Iowa State University Ph.D.,  Electrical Engineering 2007  – 2011 Title: Interferometric methods of magneto-optic optical switching \nConcentration: Fiber optic switching and devices, magneto-optic materials \nMajor Professors: Mani Mina and Robert J. Weber Iowa State University Bachelors of Science; ISU,  Electrical Engineering; Electrical and Computer Engineering Department 2003  – 2007 Iowa State University Bachelors of Science; ISU,  Electrical Engineering; Electrical and Computer Engineering Department 2003  – 2007 Iowa State University Bachelors of Science; ISU,  Electrical Engineering; Electrical and Computer Engineering Department 2003  – 2007 ", "Experience Electrical Engineer Intel Corporation May 2000  – Present (15 years 4 months) Hardware Electrical Engineer at Intel Corporation with multiple years of professional experience. Ability to design and successfully implement circuitry including both digital and analog elements including architecting and designing complete embedded applications that utilize a combination of hardware, high-level, and low-level software. Software writing expertise with both high-level language support (C++), and low-level language support (Assembly). Electrical Engineer Intel Corporation May 2000  – Present (15 years 4 months) Hardware Electrical Engineer at Intel Corporation with multiple years of professional experience. Ability to design and successfully implement circuitry including both digital and analog elements including architecting and designing complete embedded applications that utilize a combination of hardware, high-level, and low-level software. Software writing expertise with both high-level language support (C++), and low-level language support (Assembly). Electrical Engineer Intel Corporation May 2000  – Present (15 years 4 months) Hardware Electrical Engineer at Intel Corporation with multiple years of professional experience. Ability to design and successfully implement circuitry including both digital and analog elements including architecting and designing complete embedded applications that utilize a combination of hardware, high-level, and low-level software. Software writing expertise with both high-level language support (C++), and low-level language support (Assembly). Skills Semiconductors Verilog Embedded Systems Debugging ASIC FPGA VHDL Analog IC Circuit Design Analog Circuit Design Hardware Architecture SoC Firmware Electrical Engineering Embedded Software PCB design VLSI Electronics Mixed Signal See 5+     See less Skills  Semiconductors Verilog Embedded Systems Debugging ASIC FPGA VHDL Analog IC Circuit Design Analog Circuit Design Hardware Architecture SoC Firmware Electrical Engineering Embedded Software PCB design VLSI Electronics Mixed Signal See 5+     See less Semiconductors Verilog Embedded Systems Debugging ASIC FPGA VHDL Analog IC Circuit Design Analog Circuit Design Hardware Architecture SoC Firmware Electrical Engineering Embedded Software PCB design VLSI Electronics Mixed Signal See 5+     See less Semiconductors Verilog Embedded Systems Debugging ASIC FPGA VHDL Analog IC Circuit Design Analog Circuit Design Hardware Architecture SoC Firmware Electrical Engineering Embedded Software PCB design VLSI Electronics Mixed Signal See 5+     See less Education Oregon Health and Science University Master of Engineering (MEng),  Electrical and Electronics Engineering 2000  – 2002 University of Portland Bachelor of Science (BS),  Electrical and Electronics Engineering 1996  – 2000 Graduated with Honors Oregon Health and Science University Master of Engineering (MEng),  Electrical and Electronics Engineering 2000  – 2002 Oregon Health and Science University Master of Engineering (MEng),  Electrical and Electronics Engineering 2000  – 2002 Oregon Health and Science University Master of Engineering (MEng),  Electrical and Electronics Engineering 2000  – 2002 University of Portland Bachelor of Science (BS),  Electrical and Electronics Engineering 1996  – 2000 Graduated with Honors University of Portland Bachelor of Science (BS),  Electrical and Electronics Engineering 1996  – 2000 Graduated with Honors University of Portland Bachelor of Science (BS),  Electrical and Electronics Engineering 1996  – 2000 Graduated with Honors ", "Experience Electrical Engineer Intel Corporation November 1994  – Present (20 years 10 months) Focus Areas: Electrical Program management for electronic package design, Technology Development for Electronic Packaging & Interconnects (wirebond, flipchip, ceramic, organic, BGA, LGA, PGA, sockets, boards); High-Speed Signaling & Signal Integrity; System, Sub-System & Bus Architectures (server, desktop, mobile, RF/wireless, DDRx, PCI, Serdes) \n \nAdditional Professional Information: Three U.S. patents issued in the area of electronic packaging; ~20 papers / conference publications in the areas of electronic packaging and computational electromagnetics; guest / adjunct instructor experience teaching engineering courses at Arizona State University; IEEE Senior member active in the Phoenix Section. Electrical Engineer Intel Corporation November 1994  – Present (20 years 10 months) Focus Areas: Electrical Program management for electronic package design, Technology Development for Electronic Packaging & Interconnects (wirebond, flipchip, ceramic, organic, BGA, LGA, PGA, sockets, boards); High-Speed Signaling & Signal Integrity; System, Sub-System & Bus Architectures (server, desktop, mobile, RF/wireless, DDRx, PCI, Serdes) \n \nAdditional Professional Information: Three U.S. patents issued in the area of electronic packaging; ~20 papers / conference publications in the areas of electronic packaging and computational electromagnetics; guest / adjunct instructor experience teaching engineering courses at Arizona State University; IEEE Senior member active in the Phoenix Section. Electrical Engineer Intel Corporation November 1994  – Present (20 years 10 months) Focus Areas: Electrical Program management for electronic package design, Technology Development for Electronic Packaging & Interconnects (wirebond, flipchip, ceramic, organic, BGA, LGA, PGA, sockets, boards); High-Speed Signaling & Signal Integrity; System, Sub-System & Bus Architectures (server, desktop, mobile, RF/wireless, DDRx, PCI, Serdes) \n \nAdditional Professional Information: Three U.S. patents issued in the area of electronic packaging; ~20 papers / conference publications in the areas of electronic packaging and computational electromagnetics; guest / adjunct instructor experience teaching engineering courses at Arizona State University; IEEE Senior member active in the Phoenix Section. Education Arizona State University B.S.E., M.S., Ph.D.,  Electrical Engineering Graduate Study Specialization: Computational Electromagnetics La Reine High School Oslo American School Arizona State University B.S.E., M.S., Ph.D.,  Electrical Engineering Graduate Study Specialization: Computational Electromagnetics Arizona State University B.S.E., M.S., Ph.D.,  Electrical Engineering Graduate Study Specialization: Computational Electromagnetics Arizona State University B.S.E., M.S., Ph.D.,  Electrical Engineering Graduate Study Specialization: Computational Electromagnetics La Reine High School La Reine High School La Reine High School Oslo American School Oslo American School Oslo American School ", "Experience Senior Electrical Engineer Intel Corporation October 2009  – Present (5 years 11 months) Israel Site electrical engineer responsible for the site maintenance and projects. \nInitiate and support cost reduction projects. \nCost and consumptions estimations. ROI for projects. \nMaintenance programs optimization for cost and labour hours. Project Manager Intel October 2008  –  October 2009  (1 year 1 month) Intel Manage site projects up to 1M$, from idea through design and construction to delivery and operation. \nResponsible for the cost estimation, design lead, value engineering, working with contactors and lead the commissioning process. Principal Electrical Engineer Intel March 1997  –  October 2008  (11 years 8 months) Israel Electrical lead of the F18 process change project. Resplonsible for the quality and schedule of the project. Lead and initiate upgrades changes and workarouns to allow project fluent flow and standing the milestones \nElectrical lead for F28 project. Responsible for the equipment qaulification design verification and systems startup and commissioning. \nLead the startup of systems from the 161KV through the 22KV down to 400V 5000 Amps and below system including UPSs, panels, MCCs VSD and more \nManager of 10-20 employees. Senior Electrical Engineer Intel Corporation October 2009  – Present (5 years 11 months) Israel Site electrical engineer responsible for the site maintenance and projects. \nInitiate and support cost reduction projects. \nCost and consumptions estimations. ROI for projects. \nMaintenance programs optimization for cost and labour hours. Senior Electrical Engineer Intel Corporation October 2009  – Present (5 years 11 months) Israel Site electrical engineer responsible for the site maintenance and projects. \nInitiate and support cost reduction projects. \nCost and consumptions estimations. ROI for projects. \nMaintenance programs optimization for cost and labour hours. Project Manager Intel October 2008  –  October 2009  (1 year 1 month) Intel Manage site projects up to 1M$, from idea through design and construction to delivery and operation. \nResponsible for the cost estimation, design lead, value engineering, working with contactors and lead the commissioning process. Project Manager Intel October 2008  –  October 2009  (1 year 1 month) Intel Manage site projects up to 1M$, from idea through design and construction to delivery and operation. \nResponsible for the cost estimation, design lead, value engineering, working with contactors and lead the commissioning process. Principal Electrical Engineer Intel March 1997  –  October 2008  (11 years 8 months) Israel Electrical lead of the F18 process change project. Resplonsible for the quality and schedule of the project. Lead and initiate upgrades changes and workarouns to allow project fluent flow and standing the milestones \nElectrical lead for F28 project. Responsible for the equipment qaulification design verification and systems startup and commissioning. \nLead the startup of systems from the 161KV through the 22KV down to 400V 5000 Amps and below system including UPSs, panels, MCCs VSD and more \nManager of 10-20 employees. Principal Electrical Engineer Intel March 1997  –  October 2008  (11 years 8 months) Israel Electrical lead of the F18 process change project. Resplonsible for the quality and schedule of the project. Lead and initiate upgrades changes and workarouns to allow project fluent flow and standing the milestones \nElectrical lead for F28 project. Responsible for the equipment qaulification design verification and systems startup and commissioning. \nLead the startup of systems from the 161KV through the 22KV down to 400V 5000 Amps and below system including UPSs, panels, MCCs VSD and more \nManager of 10-20 employees. Skills Electrical Engineering Semiconductors Microsoft Office Project Engineering MS Project Testing Manufacturing Engineering Electricians Product Management Electronics Lean Manufacturing Automation Process Engineering R&D Engineering Management Troubleshooting Product Development Quality Assurance Project Planning See 5+     See less Skills  Electrical Engineering Semiconductors Microsoft Office Project Engineering MS Project Testing Manufacturing Engineering Electricians Product Management Electronics Lean Manufacturing Automation Process Engineering R&D Engineering Management Troubleshooting Product Development Quality Assurance Project Planning See 5+     See less Electrical Engineering Semiconductors Microsoft Office Project Engineering MS Project Testing Manufacturing Engineering Electricians Product Management Electronics Lean Manufacturing Automation Process Engineering R&D Engineering Management Troubleshooting Product Development Quality Assurance Project Planning See 5+     See less Electrical Engineering Semiconductors Microsoft Office Project Engineering MS Project Testing Manufacturing Engineering Electricians Product Management Electronics Lean Manufacturing Automation Process Engineering R&D Engineering Management Troubleshooting Product Development Quality Assurance Project Planning See 5+     See less Education Hamikhlalah Ha'academit Lehandassah Sami Shamoon Engineer's Degree,  Electrical and Electronics Engineering , Bsc 2009  – 2013 Hamikhlalah Ha'academit Lehandassah Sami Shamoon Engineer's Degree,  Electrical and Electronics Engineering , Bsc 2009  – 2013 Hamikhlalah Ha'academit Lehandassah Sami Shamoon Engineer's Degree,  Electrical and Electronics Engineering , Bsc 2009  – 2013 Hamikhlalah Ha'academit Lehandassah Sami Shamoon Engineer's Degree,  Electrical and Electronics Engineering , Bsc 2009  – 2013 ", "Summary Electrical Engineering \nbiological science \nregistered US patent agent Specialties:IC design verification, ATE testers, computer programming \npatent search Summary Electrical Engineering \nbiological science \nregistered US patent agent Specialties:IC design verification, ATE testers, computer programming \npatent search Electrical Engineering \nbiological science \nregistered US patent agent Specialties:IC design verification, ATE testers, computer programming \npatent search Electrical Engineering \nbiological science \nregistered US patent agent Specialties:IC design verification, ATE testers, computer programming \npatent search Experience Electrical Engineer Intel Corporation September 2010  – Present (5 years) Conduct performance and specification validation on high speed communication and image interfaces. work with designer and other testing teams to troubleshoot issues. design analysis engineer qimonda September 2005  –  November 2008  (3 years 3 months) IC desgin analysis. validated designs and troubleshoot issues. consultant IBM 2000  –  2001  (1 year) Electrical Engineer Intel Corporation September 2010  – Present (5 years) Conduct performance and specification validation on high speed communication and image interfaces. work with designer and other testing teams to troubleshoot issues. Electrical Engineer Intel Corporation September 2010  – Present (5 years) Conduct performance and specification validation on high speed communication and image interfaces. work with designer and other testing teams to troubleshoot issues. design analysis engineer qimonda September 2005  –  November 2008  (3 years 3 months) IC desgin analysis. validated designs and troubleshoot issues. design analysis engineer qimonda September 2005  –  November 2008  (3 years 3 months) IC desgin analysis. validated designs and troubleshoot issues. consultant IBM 2000  –  2001  (1 year) consultant IBM 2000  –  2001  (1 year) Education University of North Carolina at Chapel Hill M.S.,  Biological Chemistry 1995  – 2000 Jilin University B.S.,  biochemistry 1989  – 1993 University of North Carolina at Chapel Hill M.S.,  Biological Chemistry 1995  – 2000 University of North Carolina at Chapel Hill M.S.,  Biological Chemistry 1995  – 2000 University of North Carolina at Chapel Hill M.S.,  Biological Chemistry 1995  – 2000 Jilin University B.S.,  biochemistry 1989  – 1993 Jilin University B.S.,  biochemistry 1989  – 1993 Jilin University B.S.,  biochemistry 1989  – 1993 ", "Languages English Professional working proficiency Hindi Professional working proficiency Punjabi Limited working proficiency English Professional working proficiency Hindi Professional working proficiency Punjabi Limited working proficiency English Professional working proficiency Hindi Professional working proficiency Punjabi Limited working proficiency Professional working proficiency Professional working proficiency Limited working proficiency Skills Electrical Engineering Solar Energy Power Generation Power Systems Strategic Planning SCADA Entrepreneurship Program Management Business Development Engineering Competitive Analysis Renewable Energy Analysis AutoCAD Pspice Matlab Microsoft Office C++ C Microsoft Excel Automation Simulink PSpice See 8+     See less Skills  Electrical Engineering Solar Energy Power Generation Power Systems Strategic Planning SCADA Entrepreneurship Program Management Business Development Engineering Competitive Analysis Renewable Energy Analysis AutoCAD Pspice Matlab Microsoft Office C++ C Microsoft Excel Automation Simulink PSpice See 8+     See less Electrical Engineering Solar Energy Power Generation Power Systems Strategic Planning SCADA Entrepreneurship Program Management Business Development Engineering Competitive Analysis Renewable Energy Analysis AutoCAD Pspice Matlab Microsoft Office C++ C Microsoft Excel Automation Simulink PSpice See 8+     See less Electrical Engineering Solar Energy Power Generation Power Systems Strategic Planning SCADA Entrepreneurship Program Management Business Development Engineering Competitive Analysis Renewable Energy Analysis AutoCAD Pspice Matlab Microsoft Office C++ C Microsoft Excel Automation Simulink PSpice See 8+     See less Education SUNY Buffalo Master's Degree,  Electrical Engineering , A 2013  – 2015 Specialization in Energy Systems \nCourse Undertaken : Spot Pricing of Electricity- Smart Grids, Power System Engineering, Advance Energy Grid Systems, Industrial Control System Activities and Societies:  Tech Savvy Volunteering.\nUB Volunteering IILM Academy of Higher Learning, U.P. Technical University Greater Noida BTech,  Electrical Engineering , A 2005  – 2009 Main Coursework: Engineering Mathematics & Analysis, Power systems, Power electronics, Electrical machines \nRobotics Workshop - Developed a robotics car that worked with remote control and sensors, using two stepper motors and operated on a 9 Volt DC supply \nAutomation Workshop : Overview of SCADA control system Activities and Societies:  Chess ,  Badminton ,  Dance ,  Quiz Team SUNY Buffalo Master's Degree,  Electrical Engineering , A 2013  – 2015 Specialization in Energy Systems \nCourse Undertaken : Spot Pricing of Electricity- Smart Grids, Power System Engineering, Advance Energy Grid Systems, Industrial Control System Activities and Societies:  Tech Savvy Volunteering.\nUB Volunteering SUNY Buffalo Master's Degree,  Electrical Engineering , A 2013  – 2015 Specialization in Energy Systems \nCourse Undertaken : Spot Pricing of Electricity- Smart Grids, Power System Engineering, Advance Energy Grid Systems, Industrial Control System Activities and Societies:  Tech Savvy Volunteering.\nUB Volunteering SUNY Buffalo Master's Degree,  Electrical Engineering , A 2013  – 2015 Specialization in Energy Systems \nCourse Undertaken : Spot Pricing of Electricity- Smart Grids, Power System Engineering, Advance Energy Grid Systems, Industrial Control System Activities and Societies:  Tech Savvy Volunteering.\nUB Volunteering IILM Academy of Higher Learning, U.P. Technical University Greater Noida BTech,  Electrical Engineering , A 2005  – 2009 Main Coursework: Engineering Mathematics & Analysis, Power systems, Power electronics, Electrical machines \nRobotics Workshop - Developed a robotics car that worked with remote control and sensors, using two stepper motors and operated on a 9 Volt DC supply \nAutomation Workshop : Overview of SCADA control system Activities and Societies:  Chess ,  Badminton ,  Dance ,  Quiz Team IILM Academy of Higher Learning, U.P. Technical University Greater Noida BTech,  Electrical Engineering , A 2005  – 2009 Main Coursework: Engineering Mathematics & Analysis, Power systems, Power electronics, Electrical machines \nRobotics Workshop - Developed a robotics car that worked with remote control and sensors, using two stepper motors and operated on a 9 Volt DC supply \nAutomation Workshop : Overview of SCADA control system Activities and Societies:  Chess ,  Badminton ,  Dance ,  Quiz Team IILM Academy of Higher Learning, U.P. Technical University Greater Noida BTech,  Electrical Engineering , A 2005  – 2009 Main Coursework: Engineering Mathematics & Analysis, Power systems, Power electronics, Electrical machines \nRobotics Workshop - Developed a robotics car that worked with remote control and sensors, using two stepper motors and operated on a 9 Volt DC supply \nAutomation Workshop : Overview of SCADA control system Activities and Societies:  Chess ,  Badminton ,  Dance ,  Quiz Team Honors & Awards ", "Experience Electrical Engineer Intel Corporation Electrical Engineer Intel Corporation Electrical Engineer Intel Corporation ", "Experience Electrical Engineer Savannah River Remediation LLC February 2013  – Present (2 years 7 months) Aiken, SC Electrical Engineer Jacobs Engineering October 2012  –  January 2013  (4 months) Greenville, SC Electrical Engineer Fluor Enterprises March 2012  –  October 2012  (8 months) Greenville, SC Senior Electrical Engineer CH2M Hill September 2011  –  December 2011  (4 months) Spartanburg, SC Electrical Engineer Savannah River Remediation LLC November 2010  –  September 2011  (11 months) Aken, SC Sr. Electrical Engineer Rentech December 2006  –  June 2008  (1 year 7 months) Denver, CO Electrical Engineer C&H Engineering September 2005  –  December 2006  (1 year 4 months) Denver, CO Electrical Engineer Intel Corporation August 2004  –  September 2005  (1 year 2 months) Hillsburo, OR Electrical Engineer Harris Group Inc. October 2001  –  March 2002  (6 months) Denver, CO Electrical Engineer Intel Corporation March 2000  –  April 2001  (1 year 2 months) Aloha, OR Elecrical Engineer Harris Group Inc. October 1999  –  March 2000  (6 months) Portland, OR Electrical Design Specialist Lockwood Greene Engineers, Inc July 1999  –  September 1999  (3 months) Spartanburg, SC Electrical Engineer O'Neal Engineers, Inc. May 1999  –  July 1999  (3 months) Greenville, SC Electrical Engineer / E&I Superintendent Middough October 1997  –  February 1999  (1 year 5 months) Cleveland, OH and Goosecreek, SC Electrical Engineer Day & Zimmermann International, Inc. August 1996  –  January 1997  (6 months) Greenville, SC Electrical Design Specialist Lockwood Greene Engineers, Inc. March 1996  –  July 1996  (5 months) Spartanburg, SC Electrical Engineer IDC (Industrial Design & Construction) January 1994  –  January 1996  (2 years 1 month) Portland, OR and Albuquerque, NM Electrical Engineer CRS Sirrine Engineers, Inc. June 1989  –  October 1993  (4 years 5 months) Greenville, SC and Aloha, OR Electrical Designer American Electric Power March 1989  –  June 1989  (4 months) Columbus, OH Electrical Engineer Pacific Architechs and Engineers November 1988  –  March 1989  (5 months) Mendota, CA Electrical Engineer Fluor Daniel, Inc. August 1965  –  November 1988  (23 years 4 months) Irvine, CA, Houston, TX Electrical Engineer Savannah River Remediation LLC February 2013  – Present (2 years 7 months) Aiken, SC Electrical Engineer Savannah River Remediation LLC February 2013  – Present (2 years 7 months) Aiken, SC Electrical Engineer Jacobs Engineering October 2012  –  January 2013  (4 months) Greenville, SC Electrical Engineer Jacobs Engineering October 2012  –  January 2013  (4 months) Greenville, SC Electrical Engineer Fluor Enterprises March 2012  –  October 2012  (8 months) Greenville, SC Electrical Engineer Fluor Enterprises March 2012  –  October 2012  (8 months) Greenville, SC Senior Electrical Engineer CH2M Hill September 2011  –  December 2011  (4 months) Spartanburg, SC Senior Electrical Engineer CH2M Hill September 2011  –  December 2011  (4 months) Spartanburg, SC Electrical Engineer Savannah River Remediation LLC November 2010  –  September 2011  (11 months) Aken, SC Electrical Engineer Savannah River Remediation LLC November 2010  –  September 2011  (11 months) Aken, SC Sr. Electrical Engineer Rentech December 2006  –  June 2008  (1 year 7 months) Denver, CO Sr. Electrical Engineer Rentech December 2006  –  June 2008  (1 year 7 months) Denver, CO Electrical Engineer C&H Engineering September 2005  –  December 2006  (1 year 4 months) Denver, CO Electrical Engineer C&H Engineering September 2005  –  December 2006  (1 year 4 months) Denver, CO Electrical Engineer Intel Corporation August 2004  –  September 2005  (1 year 2 months) Hillsburo, OR Electrical Engineer Intel Corporation August 2004  –  September 2005  (1 year 2 months) Hillsburo, OR Electrical Engineer Harris Group Inc. October 2001  –  March 2002  (6 months) Denver, CO Electrical Engineer Harris Group Inc. October 2001  –  March 2002  (6 months) Denver, CO Electrical Engineer Intel Corporation March 2000  –  April 2001  (1 year 2 months) Aloha, OR Electrical Engineer Intel Corporation March 2000  –  April 2001  (1 year 2 months) Aloha, OR Elecrical Engineer Harris Group Inc. October 1999  –  March 2000  (6 months) Portland, OR Elecrical Engineer Harris Group Inc. October 1999  –  March 2000  (6 months) Portland, OR Electrical Design Specialist Lockwood Greene Engineers, Inc July 1999  –  September 1999  (3 months) Spartanburg, SC Electrical Design Specialist Lockwood Greene Engineers, Inc July 1999  –  September 1999  (3 months) Spartanburg, SC Electrical Engineer O'Neal Engineers, Inc. May 1999  –  July 1999  (3 months) Greenville, SC Electrical Engineer O'Neal Engineers, Inc. May 1999  –  July 1999  (3 months) Greenville, SC Electrical Engineer / E&I Superintendent Middough October 1997  –  February 1999  (1 year 5 months) Cleveland, OH and Goosecreek, SC Electrical Engineer / E&I Superintendent Middough October 1997  –  February 1999  (1 year 5 months) Cleveland, OH and Goosecreek, SC Electrical Engineer Day & Zimmermann International, Inc. August 1996  –  January 1997  (6 months) Greenville, SC Electrical Engineer Day & Zimmermann International, Inc. August 1996  –  January 1997  (6 months) Greenville, SC Electrical Design Specialist Lockwood Greene Engineers, Inc. March 1996  –  July 1996  (5 months) Spartanburg, SC Electrical Design Specialist Lockwood Greene Engineers, Inc. March 1996  –  July 1996  (5 months) Spartanburg, SC Electrical Engineer IDC (Industrial Design & Construction) January 1994  –  January 1996  (2 years 1 month) Portland, OR and Albuquerque, NM Electrical Engineer IDC (Industrial Design & Construction) January 1994  –  January 1996  (2 years 1 month) Portland, OR and Albuquerque, NM Electrical Engineer CRS Sirrine Engineers, Inc. June 1989  –  October 1993  (4 years 5 months) Greenville, SC and Aloha, OR Electrical Engineer CRS Sirrine Engineers, Inc. June 1989  –  October 1993  (4 years 5 months) Greenville, SC and Aloha, OR Electrical Designer American Electric Power March 1989  –  June 1989  (4 months) Columbus, OH Electrical Designer American Electric Power March 1989  –  June 1989  (4 months) Columbus, OH Electrical Engineer Pacific Architechs and Engineers November 1988  –  March 1989  (5 months) Mendota, CA Electrical Engineer Pacific Architechs and Engineers November 1988  –  March 1989  (5 months) Mendota, CA Electrical Engineer Fluor Daniel, Inc. August 1965  –  November 1988  (23 years 4 months) Irvine, CA, Houston, TX Electrical Engineer Fluor Daniel, Inc. August 1965  –  November 1988  (23 years 4 months) Irvine, CA, Houston, TX ", "Summary Over sixteen years of experience in Electrical Engineering. Experience includes electrical design and analysis for commercial, industrial, institutional, and data center facilities Specialties:Industrial, commercial, institutional power distribution systems design, analysis, and maintenance. Summary Over sixteen years of experience in Electrical Engineering. Experience includes electrical design and analysis for commercial, industrial, institutional, and data center facilities Specialties:Industrial, commercial, institutional power distribution systems design, analysis, and maintenance. Over sixteen years of experience in Electrical Engineering. Experience includes electrical design and analysis for commercial, industrial, institutional, and data center facilities Specialties:Industrial, commercial, institutional power distribution systems design, analysis, and maintenance. Over sixteen years of experience in Electrical Engineering. Experience includes electrical design and analysis for commercial, industrial, institutional, and data center facilities Specialties:Industrial, commercial, institutional power distribution systems design, analysis, and maintenance. Experience Operations Administrator - Data Centers - Critical Systems ABM Engineering Services May 2008  – Present (7 years 4 months) Belleville, MI Sr. Electrical Engineer Orbital Engineering, Inc. March 2008  –  May 2008  (3 months) Detroit, MI Sr. Electrical Engineer KlingStubbins February 2007  –  March 2008  (1 year 2 months) Electrical Engineer responsible for engineering services to design, install, and commission a fully-redundant high/low voltage power distribution system to support the operation of a newly constructed 68,000 SF, Tier III data center. Systems include industrial grade power distribution systems, centralized static UPS systems, emergency generators, Power Distribution Units, Remote Power Panels, variable frequency drives, PLC’s, facilities power management systems, SRG and substation grounding, lightning protection, fire alarm, and interior/exterior lighting. Engineering calculations were subject to clients and City Department review. Lead Electrical Engineer Intel Corporation June 2000  –  February 2007  (6 years 9 months) Lead electrical engineer responsible for the design, installation, startup, and commissioning into service the power distribution system to support and sustain the operation of a newly constructed 120,000 SF, Class 1 cleanroom space. Systems include fully redundant 25MVA utility substation, H/Low voltage power distribution switchgear, rotary UPS systems, backup diesel generators, transfer switches, variable frequency drives for HVAC equipment, PLC’s, power quality monitoring systems and controls, facilities management systems (GE Cimplicity Plant Edition), fire alarm, and interior/exterior lighting systems. Lead Electrical Engineer Intel Corporation October 1994  –  June 2000  (5 years 9 months) Senior electrical engineer responsible for the design, installation, startup, and commissioning into service the power distribution system to support and sustain the operation of a newly constructed 180,000 SF, Class 1 rating cleanroom space. Systems include fully redundant 56MVA utility substation, H/L voltage distribution switchgear, static UPS systems, emergency diesel generators transfer switches, variable frequency drives for HVAC equipment, grounding, PLC based facility power management and control system, fire alarm, and interior/exterior lighting systems. Electrical Engineer General Dynamics May 1988  –  October 1994  (6 years 6 months) Electrical Engineer responsible for the upgrade/retrofit of facility's welding stations, power distribution systems, office building consolidation, and overall site electrical power distribution system improvement. Operations Administrator - Data Centers - Critical Systems ABM Engineering Services May 2008  – Present (7 years 4 months) Belleville, MI Operations Administrator - Data Centers - Critical Systems ABM Engineering Services May 2008  – Present (7 years 4 months) Belleville, MI Sr. Electrical Engineer Orbital Engineering, Inc. March 2008  –  May 2008  (3 months) Detroit, MI Sr. Electrical Engineer Orbital Engineering, Inc. March 2008  –  May 2008  (3 months) Detroit, MI Sr. Electrical Engineer KlingStubbins February 2007  –  March 2008  (1 year 2 months) Electrical Engineer responsible for engineering services to design, install, and commission a fully-redundant high/low voltage power distribution system to support the operation of a newly constructed 68,000 SF, Tier III data center. Systems include industrial grade power distribution systems, centralized static UPS systems, emergency generators, Power Distribution Units, Remote Power Panels, variable frequency drives, PLC’s, facilities power management systems, SRG and substation grounding, lightning protection, fire alarm, and interior/exterior lighting. Engineering calculations were subject to clients and City Department review. Sr. Electrical Engineer KlingStubbins February 2007  –  March 2008  (1 year 2 months) Electrical Engineer responsible for engineering services to design, install, and commission a fully-redundant high/low voltage power distribution system to support the operation of a newly constructed 68,000 SF, Tier III data center. Systems include industrial grade power distribution systems, centralized static UPS systems, emergency generators, Power Distribution Units, Remote Power Panels, variable frequency drives, PLC’s, facilities power management systems, SRG and substation grounding, lightning protection, fire alarm, and interior/exterior lighting. Engineering calculations were subject to clients and City Department review. Lead Electrical Engineer Intel Corporation June 2000  –  February 2007  (6 years 9 months) Lead electrical engineer responsible for the design, installation, startup, and commissioning into service the power distribution system to support and sustain the operation of a newly constructed 120,000 SF, Class 1 cleanroom space. Systems include fully redundant 25MVA utility substation, H/Low voltage power distribution switchgear, rotary UPS systems, backup diesel generators, transfer switches, variable frequency drives for HVAC equipment, PLC’s, power quality monitoring systems and controls, facilities management systems (GE Cimplicity Plant Edition), fire alarm, and interior/exterior lighting systems. Lead Electrical Engineer Intel Corporation June 2000  –  February 2007  (6 years 9 months) Lead electrical engineer responsible for the design, installation, startup, and commissioning into service the power distribution system to support and sustain the operation of a newly constructed 120,000 SF, Class 1 cleanroom space. Systems include fully redundant 25MVA utility substation, H/Low voltage power distribution switchgear, rotary UPS systems, backup diesel generators, transfer switches, variable frequency drives for HVAC equipment, PLC’s, power quality monitoring systems and controls, facilities management systems (GE Cimplicity Plant Edition), fire alarm, and interior/exterior lighting systems. Lead Electrical Engineer Intel Corporation October 1994  –  June 2000  (5 years 9 months) Senior electrical engineer responsible for the design, installation, startup, and commissioning into service the power distribution system to support and sustain the operation of a newly constructed 180,000 SF, Class 1 rating cleanroom space. Systems include fully redundant 56MVA utility substation, H/L voltage distribution switchgear, static UPS systems, emergency diesel generators transfer switches, variable frequency drives for HVAC equipment, grounding, PLC based facility power management and control system, fire alarm, and interior/exterior lighting systems. Lead Electrical Engineer Intel Corporation October 1994  –  June 2000  (5 years 9 months) Senior electrical engineer responsible for the design, installation, startup, and commissioning into service the power distribution system to support and sustain the operation of a newly constructed 180,000 SF, Class 1 rating cleanroom space. Systems include fully redundant 56MVA utility substation, H/L voltage distribution switchgear, static UPS systems, emergency diesel generators transfer switches, variable frequency drives for HVAC equipment, grounding, PLC based facility power management and control system, fire alarm, and interior/exterior lighting systems. Electrical Engineer General Dynamics May 1988  –  October 1994  (6 years 6 months) Electrical Engineer responsible for the upgrade/retrofit of facility's welding stations, power distribution systems, office building consolidation, and overall site electrical power distribution system improvement. Electrical Engineer General Dynamics May 1988  –  October 1994  (6 years 6 months) Electrical Engineer responsible for the upgrade/retrofit of facility's welding stations, power distribution systems, office building consolidation, and overall site electrical power distribution system improvement. Skills Power Distribution Analysis Skills  Power Distribution Analysis Power Distribution Analysis Power Distribution Analysis Education Bradley University MSEE,  Electrical Engineering 1986  – 1988 Southern Illinois University, Carbondale BSEE,  Electrical Engineering 1980  – 1984 Activities and Societies:  Dean's list with full scholarship Bradley University MSEE,  Electrical Engineering 1986  – 1988 Bradley University MSEE,  Electrical Engineering 1986  – 1988 Bradley University MSEE,  Electrical Engineering 1986  – 1988 Southern Illinois University, Carbondale BSEE,  Electrical Engineering 1980  – 1984 Activities and Societies:  Dean's list with full scholarship Southern Illinois University, Carbondale BSEE,  Electrical Engineering 1980  – 1984 Activities and Societies:  Dean's list with full scholarship Southern Illinois University, Carbondale BSEE,  Electrical Engineering 1980  – 1984 Activities and Societies:  Dean's list with full scholarship Honors & Awards Additional Honors & Awards - Best in construction award - Intel Corporation, 1995  \n- Energy savings award - 1998  \n- Best in electrical systems reliability award, 2001 \n- Who's who in America, 2000 - 2002 \n- Non-patent invention award (Welding appartous grounding device) - General Dynamics Space Systems Div. - 1990 Additional Honors & Awards - Best in construction award - Intel Corporation, 1995  \n- Energy savings award - 1998  \n- Best in electrical systems reliability award, 2001 \n- Who's who in America, 2000 - 2002 \n- Non-patent invention award (Welding appartous grounding device) - General Dynamics Space Systems Div. - 1990 Additional Honors & Awards - Best in construction award - Intel Corporation, 1995  \n- Energy savings award - 1998  \n- Best in electrical systems reliability award, 2001 \n- Who's who in America, 2000 - 2002 \n- Non-patent invention award (Welding appartous grounding device) - General Dynamics Space Systems Div. - 1990 Additional Honors & Awards - Best in construction award - Intel Corporation, 1995  \n- Energy savings award - 1998  \n- Best in electrical systems reliability award, 2001 \n- Who's who in America, 2000 - 2002 \n- Non-patent invention award (Welding appartous grounding device) - General Dynamics Space Systems Div. - 1990 ", "Experience Electrical Engineer Intel Corporation Energy Engineer RT 2008  –  2009  (1 year) Electrical Engineer Intel Corporation Electrical Engineer Intel Corporation Energy Engineer RT 2008  –  2009  (1 year) Energy Engineer RT 2008  –  2009  (1 year) Education De Anza College De Anza College De Anza College De Anza College ", "Experience Electrical Engineer Intel Corporation October 2012  – Present (2 years 11 months) Owner of Variable Frequency Drives (design, purchasing, programming and maintenance) for HVAC, UPW, Waste, Process systems.  \nWorking experience with high, medium and low voltage systems, including dry and wet transformers, UPS up to 800KVA, generators and I&C systems.  \nPerforming testing of harmonics, power quality and energy consumption. Working with electrical designers and performing drawings updates. Construction Project manager \\ Field Engineer \\ MEP Inspector Intel June 2010  –  October 2012  (2 years 5 months) Qiryat Gat, Israel Responsible for electrical, piping (process), mechanical , architectural and life safety systems design/approval in Intel Fab28 tool install project (Dry Etch area). Factory equipment installation management. Lead projects, manage subcontractors and vendors. Personal responsibility of the project while meeting strict deadlines and schedule, without prejudicing quality and safety. Work with a number of projects simultaneously in a heterogeneous environment. Technical advisor to contractors machinery installations. Experience in preparing and reviewing project costs. Performed field verification, compare prices and quantities of materials installed by trades with finance department. F28 Micro contamination \\ Mini environment Field Engineer Intel Corporation March 2009  –  June 2010  (1 year 4 months) Qiryat Gat, Israel. Clean room equipment certification for stringent cleanliness levels of 0.1 micron.Monitoring and supervising the molecular level clean room cleaning (AMC). Data base \nmanagement with PTD U.S. laboratory. Field Engineer \\ MEP Inspector Intel Corporation April 2006  –  March 2009  (3 years) Chandler, AZ, USA \\ Qiryat Gat , Israel Responsible for Dry Etch area tools install. Lead design of all earlier tool set in F28 , provided quick solutions and corrections in short time. Trained other FE's to understand design / drawings and solve the problems in the field. Supported cluster Engineer / Project manager during project. Implemented professional skills and knowledge in Fab28 ramp. F18 Manufacturing specialist Intel Corporation July 2000  –  April 2006  (5 years 10 months) Qiryat Gat, Israel Responsible for equipment maintaining and coordinating a team of 15 to 25 manufacturing technicians to achieve factory goals for safety, quality, and product output. Leading tech in Dry Etch area, providing equipment maintenance and troubleshooting. Safety and quality leader in group. Responsible for continuous improvement on safety, quality, and preventive maintenance in area. The job requires multi-tasking abilities, high logical and methodical skills, precision, details orientation, high discipline and cooperation with many stakeholders. Electrical Engineer Intel Corporation October 2012  – Present (2 years 11 months) Owner of Variable Frequency Drives (design, purchasing, programming and maintenance) for HVAC, UPW, Waste, Process systems.  \nWorking experience with high, medium and low voltage systems, including dry and wet transformers, UPS up to 800KVA, generators and I&C systems.  \nPerforming testing of harmonics, power quality and energy consumption. Working with electrical designers and performing drawings updates. Electrical Engineer Intel Corporation October 2012  – Present (2 years 11 months) Owner of Variable Frequency Drives (design, purchasing, programming and maintenance) for HVAC, UPW, Waste, Process systems.  \nWorking experience with high, medium and low voltage systems, including dry and wet transformers, UPS up to 800KVA, generators and I&C systems.  \nPerforming testing of harmonics, power quality and energy consumption. Working with electrical designers and performing drawings updates. Construction Project manager \\ Field Engineer \\ MEP Inspector Intel June 2010  –  October 2012  (2 years 5 months) Qiryat Gat, Israel Responsible for electrical, piping (process), mechanical , architectural and life safety systems design/approval in Intel Fab28 tool install project (Dry Etch area). Factory equipment installation management. Lead projects, manage subcontractors and vendors. Personal responsibility of the project while meeting strict deadlines and schedule, without prejudicing quality and safety. Work with a number of projects simultaneously in a heterogeneous environment. Technical advisor to contractors machinery installations. Experience in preparing and reviewing project costs. Performed field verification, compare prices and quantities of materials installed by trades with finance department. Construction Project manager \\ Field Engineer \\ MEP Inspector Intel June 2010  –  October 2012  (2 years 5 months) Qiryat Gat, Israel Responsible for electrical, piping (process), mechanical , architectural and life safety systems design/approval in Intel Fab28 tool install project (Dry Etch area). Factory equipment installation management. Lead projects, manage subcontractors and vendors. Personal responsibility of the project while meeting strict deadlines and schedule, without prejudicing quality and safety. Work with a number of projects simultaneously in a heterogeneous environment. Technical advisor to contractors machinery installations. Experience in preparing and reviewing project costs. Performed field verification, compare prices and quantities of materials installed by trades with finance department. F28 Micro contamination \\ Mini environment Field Engineer Intel Corporation March 2009  –  June 2010  (1 year 4 months) Qiryat Gat, Israel. Clean room equipment certification for stringent cleanliness levels of 0.1 micron.Monitoring and supervising the molecular level clean room cleaning (AMC). Data base \nmanagement with PTD U.S. laboratory. F28 Micro contamination \\ Mini environment Field Engineer Intel Corporation March 2009  –  June 2010  (1 year 4 months) Qiryat Gat, Israel. Clean room equipment certification for stringent cleanliness levels of 0.1 micron.Monitoring and supervising the molecular level clean room cleaning (AMC). Data base \nmanagement with PTD U.S. laboratory. Field Engineer \\ MEP Inspector Intel Corporation April 2006  –  March 2009  (3 years) Chandler, AZ, USA \\ Qiryat Gat , Israel Responsible for Dry Etch area tools install. Lead design of all earlier tool set in F28 , provided quick solutions and corrections in short time. Trained other FE's to understand design / drawings and solve the problems in the field. Supported cluster Engineer / Project manager during project. Implemented professional skills and knowledge in Fab28 ramp. Field Engineer \\ MEP Inspector Intel Corporation April 2006  –  March 2009  (3 years) Chandler, AZ, USA \\ Qiryat Gat , Israel Responsible for Dry Etch area tools install. Lead design of all earlier tool set in F28 , provided quick solutions and corrections in short time. Trained other FE's to understand design / drawings and solve the problems in the field. Supported cluster Engineer / Project manager during project. Implemented professional skills and knowledge in Fab28 ramp. F18 Manufacturing specialist Intel Corporation July 2000  –  April 2006  (5 years 10 months) Qiryat Gat, Israel Responsible for equipment maintaining and coordinating a team of 15 to 25 manufacturing technicians to achieve factory goals for safety, quality, and product output. Leading tech in Dry Etch area, providing equipment maintenance and troubleshooting. Safety and quality leader in group. Responsible for continuous improvement on safety, quality, and preventive maintenance in area. The job requires multi-tasking abilities, high logical and methodical skills, precision, details orientation, high discipline and cooperation with many stakeholders. F18 Manufacturing specialist Intel Corporation July 2000  –  April 2006  (5 years 10 months) Qiryat Gat, Israel Responsible for equipment maintaining and coordinating a team of 15 to 25 manufacturing technicians to achieve factory goals for safety, quality, and product output. Leading tech in Dry Etch area, providing equipment maintenance and troubleshooting. Safety and quality leader in group. Responsible for continuous improvement on safety, quality, and preventive maintenance in area. The job requires multi-tasking abilities, high logical and methodical skills, precision, details orientation, high discipline and cooperation with many stakeholders. Languages Hebrew English Russian Hebrew English Russian Hebrew English Russian Skills Electrical Engineering Project Engineering Variable Frequency... High Voltage Diesel Generators UPS Systems Project Management Time Management Teamwork High Availability Energy Conservation Foreign Languages Positive Team Player Energetic team player Circuit Design Pspice Engineering Semiconductors Manufacturing Troubleshooting Electricians Semiconductor Industry Engineering Management Electronics Project Planning Automation Testing AutoCAD R&D Fast Learner Highly Dedicated Workforce Performance Multi Tasking Highly committed Highly skilled... Problem Solving Personal Training Always Willing to Learn Coordination Of Projects See 24+     See less Skills  Electrical Engineering Project Engineering Variable Frequency... High Voltage Diesel Generators UPS Systems Project Management Time Management Teamwork High Availability Energy Conservation Foreign Languages Positive Team Player Energetic team player Circuit Design Pspice Engineering Semiconductors Manufacturing Troubleshooting Electricians Semiconductor Industry Engineering Management Electronics Project Planning Automation Testing AutoCAD R&D Fast Learner Highly Dedicated Workforce Performance Multi Tasking Highly committed Highly skilled... Problem Solving Personal Training Always Willing to Learn Coordination Of Projects See 24+     See less Electrical Engineering Project Engineering Variable Frequency... High Voltage Diesel Generators UPS Systems Project Management Time Management Teamwork High Availability Energy Conservation Foreign Languages Positive Team Player Energetic team player Circuit Design Pspice Engineering Semiconductors Manufacturing Troubleshooting Electricians Semiconductor Industry Engineering Management Electronics Project Planning Automation Testing AutoCAD R&D Fast Learner Highly Dedicated Workforce Performance Multi Tasking Highly committed Highly skilled... Problem Solving Personal Training Always Willing to Learn Coordination Of Projects See 24+     See less Electrical Engineering Project Engineering Variable Frequency... High Voltage Diesel Generators UPS Systems Project Management Time Management Teamwork High Availability Energy Conservation Foreign Languages Positive Team Player Energetic team player Circuit Design Pspice Engineering Semiconductors Manufacturing Troubleshooting Electricians Semiconductor Industry Engineering Management Electronics Project Planning Automation Testing AutoCAD R&D Fast Learner Highly Dedicated Workforce Performance Multi Tasking Highly committed Highly skilled... Problem Solving Personal Training Always Willing to Learn Coordination Of Projects See 24+     See less Education Hamikhlalah Ha'academit Lehandassah Sami Shamoon Bachelor of Science (B.Sc.),  Electrical \\ Electronics Engineering 2007  – 2011 High current specialization Ashkelon regional college Practical Engineer,  Electrical and Electronics Engineering 2001  – 2004 Hamikhlalah Ha'academit Lehandassah Sami Shamoon Bachelor of Science (B.Sc.),  Electrical \\ Electronics Engineering 2007  – 2011 High current specialization Hamikhlalah Ha'academit Lehandassah Sami Shamoon Bachelor of Science (B.Sc.),  Electrical \\ Electronics Engineering 2007  – 2011 High current specialization Hamikhlalah Ha'academit Lehandassah Sami Shamoon Bachelor of Science (B.Sc.),  Electrical \\ Electronics Engineering 2007  – 2011 High current specialization Ashkelon regional college Practical Engineer,  Electrical and Electronics Engineering 2001  – 2004 Ashkelon regional college Practical Engineer,  Electrical and Electronics Engineering 2001  – 2004 Ashkelon regional college Practical Engineer,  Electrical and Electronics Engineering 2001  – 2004 ", "Experience Electrical Engineer Intel Corporation Electrical Engineer Intel Corporation Electrical Engineer Intel Corporation Education California Polytechnic State University-San Luis Obispo 1984  – 1988 California Polytechnic State University-San Luis Obispo 1984  – 1988 California Polytechnic State University-San Luis Obispo 1984  – 1988 California Polytechnic State University-San Luis Obispo 1984  – 1988 ", "Experience Electrical Engineer Intel Corporation Electrical Engineer Intel Corporation Electrical Engineer Intel Corporation Languages German German German Skills Verilog Embedded Systems Debugging Python FPGA Semiconductors Skills  Verilog Embedded Systems Debugging Python FPGA Semiconductors Verilog Embedded Systems Debugging Python FPGA Semiconductors Verilog Embedded Systems Debugging Python FPGA Semiconductors Education University of Idaho Bachelor’s Degree,  Electrical Engineering University of Idaho Bachelor’s Degree,  Electrical Engineering University of Idaho Bachelor’s Degree,  Electrical Engineering University of Idaho Bachelor’s Degree,  Electrical Engineering ", "Experience Power Electrical Engineer Intel Corporation July 2013  – Present (2 years 2 months) Engineer/ Account Manager intel October 2010  –  July 2013  (2 years 10 months) Power Electrical Engineer Intel Corporation July 2013  – Present (2 years 2 months) Power Electrical Engineer Intel Corporation July 2013  – Present (2 years 2 months) Engineer/ Account Manager intel October 2010  –  July 2013  (2 years 10 months) Engineer/ Account Manager intel October 2010  –  July 2013  (2 years 10 months) Languages Spanish Spanish Spanish Skills Semiconductors Semiconductor Industry Product Management Product Marketing Cross-functional Team... Cloud Computing IC Wireless Embedded Systems Enterprise Software Strategic Partnerships Solution Selling Business Development Mobile Devices Account Management Product Development SaaS Start-ups Strategy Direct Sales See 5+     See less Skills  Semiconductors Semiconductor Industry Product Management Product Marketing Cross-functional Team... Cloud Computing IC Wireless Embedded Systems Enterprise Software Strategic Partnerships Solution Selling Business Development Mobile Devices Account Management Product Development SaaS Start-ups Strategy Direct Sales See 5+     See less Semiconductors Semiconductor Industry Product Management Product Marketing Cross-functional Team... Cloud Computing IC Wireless Embedded Systems Enterprise Software Strategic Partnerships Solution Selling Business Development Mobile Devices Account Management Product Development SaaS Start-ups Strategy Direct Sales See 5+     See less Semiconductors Semiconductor Industry Product Management Product Marketing Cross-functional Team... Cloud Computing IC Wireless Embedded Systems Enterprise Software Strategic Partnerships Solution Selling Business Development Mobile Devices Account Management Product Development SaaS Start-ups Strategy Direct Sales See 5+     See less Education Arizona State University Bachelor of Science (BS),  Electrical Engineering 2007  – 2010 Utah Valley University 2005  – 2007 Arizona State University Bachelor of Science (BS),  Electrical Engineering 2007  – 2010 Arizona State University Bachelor of Science (BS),  Electrical Engineering 2007  – 2010 Arizona State University Bachelor of Science (BS),  Electrical Engineering 2007  – 2010 Utah Valley University 2005  – 2007 Utah Valley University 2005  – 2007 Utah Valley University 2005  – 2007 ", "Experience Electrical engineer Intel Corporation October 2012  – Present (2 years 11 months) Student Intel Corporation November 2007  –  September 2012  (4 years 11 months) Electrical engineer Intel Corporation October 2012  – Present (2 years 11 months) Electrical engineer Intel Corporation October 2012  – Present (2 years 11 months) Student Intel Corporation November 2007  –  September 2012  (4 years 11 months) Student Intel Corporation November 2007  –  September 2012  (4 years 11 months) Languages Hebrew English Hebrew English Hebrew English Skills C Testing Matlab VHDL Microsoft Office Excel Word Windows ModelSim VBA Signal Processing Pspice Microsoft Excel FPGA TCL Electronics Simulations Analog Circuit Design C++ Perl Debugging Verilog Algorithms Image Processing ASIC Electrical Engineering Semiconductors Embedded Systems Java VLSI Microsoft Word Digital Signal... Simulink Hardware Architecture SystemVerilog RTL design See 21+     See less Skills  C Testing Matlab VHDL Microsoft Office Excel Word Windows ModelSim VBA Signal Processing Pspice Microsoft Excel FPGA TCL Electronics Simulations Analog Circuit Design C++ Perl Debugging Verilog Algorithms Image Processing ASIC Electrical Engineering Semiconductors Embedded Systems Java VLSI Microsoft Word Digital Signal... Simulink Hardware Architecture SystemVerilog RTL design See 21+     See less C Testing Matlab VHDL Microsoft Office Excel Word Windows ModelSim VBA Signal Processing Pspice Microsoft Excel FPGA TCL Electronics Simulations Analog Circuit Design C++ Perl Debugging Verilog Algorithms Image Processing ASIC Electrical Engineering Semiconductors Embedded Systems Java VLSI Microsoft Word Digital Signal... Simulink Hardware Architecture SystemVerilog RTL design See 21+     See less C Testing Matlab VHDL Microsoft Office Excel Word Windows ModelSim VBA Signal Processing Pspice Microsoft Excel FPGA TCL Electronics Simulations Analog Circuit Design C++ Perl Debugging Verilog Algorithms Image Processing ASIC Electrical Engineering Semiconductors Embedded Systems Java VLSI Microsoft Word Digital Signal... Simulink Hardware Architecture SystemVerilog RTL design See 21+     See less Education Technion - Israel Institute of Technology BSc,  EE & Physics 2006  – 2010 Technion - Israel Institute of Technology BSc,  EE & Physics 2006  – 2010 Technion - Israel Institute of Technology BSc,  EE & Physics 2006  – 2010 Technion - Israel Institute of Technology BSc,  EE & Physics 2006  – 2010 ", "Experience Electrical Engineer Intel Corporation Electrical Engineer Intel Corporation Electrical Engineer Intel Corporation ", "Summary Disciplined and self-motivated electrical and computer engineer seeking full-time position in hardware or software development which requires dynamic problem solving and communication skills and the ability to focus efforts efficiently to meet the needs of customers. Summary Disciplined and self-motivated electrical and computer engineer seeking full-time position in hardware or software development which requires dynamic problem solving and communication skills and the ability to focus efforts efficiently to meet the needs of customers. Disciplined and self-motivated electrical and computer engineer seeking full-time position in hardware or software development which requires dynamic problem solving and communication skills and the ability to focus efforts efficiently to meet the needs of customers. Disciplined and self-motivated electrical and computer engineer seeking full-time position in hardware or software development which requires dynamic problem solving and communication skills and the ability to focus efforts efficiently to meet the needs of customers. Experience Electrical Engineer Intel Corporation May 2006  – Present (9 years 4 months) Performed pre-silicon validation of graphics logic designs Electrical Engineer Intel Corporation May 2006  – Present (9 years 4 months) Performed pre-silicon validation of graphics logic designs Electrical Engineer Intel Corporation May 2006  – Present (9 years 4 months) Performed pre-silicon validation of graphics logic designs Languages Spanish Spanish Spanish Skills Verilog Semiconductors Debugging ASIC Programming Languages Object Oriented Software Management Java FPGA Embedded Systems Circuit Design Hardware Architecture VHDL SoC IC Version Control Tools Project Management See 2+     See less Skills  Verilog Semiconductors Debugging ASIC Programming Languages Object Oriented Software Management Java FPGA Embedded Systems Circuit Design Hardware Architecture VHDL SoC IC Version Control Tools Project Management See 2+     See less Verilog Semiconductors Debugging ASIC Programming Languages Object Oriented Software Management Java FPGA Embedded Systems Circuit Design Hardware Architecture VHDL SoC IC Version Control Tools Project Management See 2+     See less Verilog Semiconductors Debugging ASIC Programming Languages Object Oriented Software Management Java FPGA Embedded Systems Circuit Design Hardware Architecture VHDL SoC IC Version Control Tools Project Management See 2+     See less Education Brigham Young University BS,  Electrical Engineering 2001  – 2006 Teacher's Assistant in Digital Logic Design Lab \nApartment Maintenance Manager \nOwner Clear Reflections Window Cleaning Brigham Young University BS,  Electrical Engineering 2001  – 2006 Teacher's Assistant in Digital Logic Design Lab \nApartment Maintenance Manager \nOwner Clear Reflections Window Cleaning Brigham Young University BS,  Electrical Engineering 2001  – 2006 Teacher's Assistant in Digital Logic Design Lab \nApartment Maintenance Manager \nOwner Clear Reflections Window Cleaning Brigham Young University BS,  Electrical Engineering 2001  – 2006 Teacher's Assistant in Digital Logic Design Lab \nApartment Maintenance Manager \nOwner Clear Reflections Window Cleaning "]}