{"position": "Eng Tech", "company": "Intel Corporation", "profiles": ["Experience Eng Tech Intel Corporation Eng Tech Intel Corporation Eng Tech Intel Corporation ", "Experience Eng Tech Intel Corporation Eng Tech Intel Corporation Eng Tech Intel Corporation ", "Experience Eng. Tech Intel Corporation Eng. Tech Intel Corporation Eng. Tech Intel Corporation ", "Experience Integration Eng Tech at Intel Intel Corporation July 2011  – Present (4 years 2 months) Litho Layer Owner Intel Corporation December 1988  –  October 2011  (22 years 11 months) Process Technology Development Sr Process Eng Technician with experience in Lithography, Metrology, Yield analysis and Defect reduction. Strong Organizational, analytical and problem solving skills with a focus on defect reduction and yield enhancement for semiconductor manufacturing processes. Sustaining Eng Tech Solyndra November 2010  –  June 2011  (8 months) Sr Process Eng Tech Intel Corporation August 2009  –  October 2010  (1 year 3 months) Working in Intel Hillsboro (Oregon) F20 temp assignment Integration Eng Tech at Intel Intel Corporation July 2011  – Present (4 years 2 months) Integration Eng Tech at Intel Intel Corporation July 2011  – Present (4 years 2 months) Litho Layer Owner Intel Corporation December 1988  –  October 2011  (22 years 11 months) Process Technology Development Sr Process Eng Technician with experience in Lithography, Metrology, Yield analysis and Defect reduction. Strong Organizational, analytical and problem solving skills with a focus on defect reduction and yield enhancement for semiconductor manufacturing processes. Litho Layer Owner Intel Corporation December 1988  –  October 2011  (22 years 11 months) Process Technology Development Sr Process Eng Technician with experience in Lithography, Metrology, Yield analysis and Defect reduction. Strong Organizational, analytical and problem solving skills with a focus on defect reduction and yield enhancement for semiconductor manufacturing processes. Sustaining Eng Tech Solyndra November 2010  –  June 2011  (8 months) Sustaining Eng Tech Solyndra November 2010  –  June 2011  (8 months) Sr Process Eng Tech Intel Corporation August 2009  –  October 2010  (1 year 3 months) Working in Intel Hillsboro (Oregon) F20 temp assignment Sr Process Eng Tech Intel Corporation August 2009  –  October 2010  (1 year 3 months) Working in Intel Hillsboro (Oregon) F20 temp assignment Education Panjab University MA,  Pol. Sc Panjab University MA,  Pol. Sc Panjab University MA,  Pol. Sc Panjab University MA,  Pol. Sc ", "Experience Mfg. Tech/ Eng. Tech Intel Corporation June 1996  – Present (19 years 3 months) Mfg. Tech/ Eng. Tech Intel Corporation June 1996  – Present (19 years 3 months) Mfg. Tech/ Eng. Tech Intel Corporation June 1996  – Present (19 years 3 months) Education ITT Technical Institute-Albuquerque 1993  – 1996 ITT Technical Institute-Albuquerque 1993  – 1996 ITT Technical Institute-Albuquerque 1993  – 1996 ITT Technical Institute-Albuquerque 1993  – 1996 ", "Experience Etch Eng Tech Intel Corporation May 1988  – Present (27 years 4 months) tool installs, quals, PM's, repair, demo, training, conversions \\ upgrades Etch Eng Tech Intel Corporation May 1988  – Present (27 years 4 months) tool installs, quals, PM's, repair, demo, training, conversions \\ upgrades Etch Eng Tech Intel Corporation May 1988  – Present (27 years 4 months) tool installs, quals, PM's, repair, demo, training, conversions \\ upgrades Skills Plasma Etching Wet Chemical Etching Reactive Ion Etching Lithography Electrical... Vacuum Electro-mechanical Electricians Construction Technical Training Team Leadership Safety Skills  Plasma Etching Wet Chemical Etching Reactive Ion Etching Lithography Electrical... Vacuum Electro-mechanical Electricians Construction Technical Training Team Leadership Safety Plasma Etching Wet Chemical Etching Reactive Ion Etching Lithography Electrical... Vacuum Electro-mechanical Electricians Construction Technical Training Team Leadership Safety Plasma Etching Wet Chemical Etching Reactive Ion Etching Lithography Electrical... Vacuum Electro-mechanical Electricians Construction Technical Training Team Leadership Safety Education National University Associate of Arts and Sciences (AAS),  Avionics Maintenance Technology/Technician 1985  – 1987 reading high school 1977  – 1980 Activities and Societies:  cross country ,  electrical house wiring in vocational technical school National University Associate of Arts and Sciences (AAS),  Avionics Maintenance Technology/Technician 1985  – 1987 National University Associate of Arts and Sciences (AAS),  Avionics Maintenance Technology/Technician 1985  – 1987 National University Associate of Arts and Sciences (AAS),  Avionics Maintenance Technology/Technician 1985  – 1987 reading high school 1977  – 1980 Activities and Societies:  cross country ,  electrical house wiring in vocational technical school reading high school 1977  – 1980 Activities and Societies:  cross country ,  electrical house wiring in vocational technical school reading high school 1977  – 1980 Activities and Societies:  cross country ,  electrical house wiring in vocational technical school ", "Experience R&D ENG Tech Intel Corporation December 1995  – Present (19 years 9 months) CMP R&D Development. Equipment upgrades/design. Process Development CPO USN NAVY November 1978  –  March 1996  (17 years 5 months) Retired Electronics Technician Chief R&D ENG Tech Intel Corporation December 1995  – Present (19 years 9 months) CMP R&D Development. Equipment upgrades/design. Process Development R&D ENG Tech Intel Corporation December 1995  – Present (19 years 9 months) CMP R&D Development. Equipment upgrades/design. Process Development CPO USN NAVY November 1978  –  March 1996  (17 years 5 months) Retired Electronics Technician Chief CPO USN NAVY November 1978  –  March 1996  (17 years 5 months) Retired Electronics Technician Chief Skills Semiconductors Intel Electronics Mechanical Testing Mechanical Engineering Skills  Semiconductors Intel Electronics Mechanical Testing Mechanical Engineering Semiconductors Intel Electronics Mechanical Testing Mechanical Engineering Semiconductors Intel Electronics Mechanical Testing Mechanical Engineering Education WSU Vancouver Mechanical Engineering 1999 Old Dominion University Bachelor of Science (BS),  Electrical Systems 1986 WSU Vancouver Mechanical Engineering 1999 WSU Vancouver Mechanical Engineering 1999 WSU Vancouver Mechanical Engineering 1999 Old Dominion University Bachelor of Science (BS),  Electrical Systems 1986 Old Dominion University Bachelor of Science (BS),  Electrical Systems 1986 Old Dominion University Bachelor of Science (BS),  Electrical Systems 1986 ", "Experience Eng Tech Intel Corporation February 2012  – Present (3 years 7 months) MT Intel July 2001  –  January 2012  (10 years 7 months) Eng Tech Intel Corporation February 2012  – Present (3 years 7 months) Eng Tech Intel Corporation February 2012  – Present (3 years 7 months) MT Intel July 2001  –  January 2012  (10 years 7 months) MT Intel July 2001  –  January 2012  (10 years 7 months) ", "Experience Mfg Eng Tech Intel Corporation Mfg Eng Tech Intel Corporation Mfg Eng Tech Intel Corporation ", "Experience Microelectronic Eng. Tech Intel Corporation June 2007  – Present (8 years 3 months) Microelectronic Eng. Tech Intel Corporation June 2007  – Present (8 years 3 months) Microelectronic Eng. Tech Intel Corporation June 2007  – Present (8 years 3 months) ", "Experience Manufacturing Eng/Tech Intel Corporation Manufacturing Eng/Tech Intel Corporation Manufacturing Eng/Tech Intel Corporation Education Texas Tech University Texas Tech University Texas Tech University Texas Tech University ", "Experience Eng Tech Intel Corporation Eng Tech Intel Corporation Eng Tech Intel Corporation ", "Experience FA eng tech Intel Corporation September 1983  – Present (32 years) FA eng tech Intel Corporation September 1983  – Present (32 years) FA eng tech Intel Corporation September 1983  – Present (32 years) Skills Management Program Management Testing C++ Cross-functional Team... Manufacturing C Product Management Semiconductors Microsoft Office Engineering Engineering Management Embedded Systems Software Development Process Improvement Product Development See 1+     See less Skills  Management Program Management Testing C++ Cross-functional Team... Manufacturing C Product Management Semiconductors Microsoft Office Engineering Engineering Management Embedded Systems Software Development Process Improvement Product Development See 1+     See less Management Program Management Testing C++ Cross-functional Team... Manufacturing C Product Management Semiconductors Microsoft Office Engineering Engineering Management Embedded Systems Software Development Process Improvement Product Development See 1+     See less Management Program Management Testing C++ Cross-functional Team... Manufacturing C Product Management Semiconductors Microsoft Office Engineering Engineering Management Embedded Systems Software Development Process Improvement Product Development See 1+     See less Education Chandler/Gilbert Community College Associate of Arts and Sciences (AAS) 2005  – 2012 Miami high school Chandler/Gilbert Community College Associate of Arts and Sciences (AAS) 2005  – 2012 Chandler/Gilbert Community College Associate of Arts and Sciences (AAS) 2005  – 2012 Chandler/Gilbert Community College Associate of Arts and Sciences (AAS) 2005  – 2012 Miami high school Miami high school Miami high school ", "Experience Equipt. Eng. tech Intel Corporation Equipt. Eng. tech Intel Corporation Equipt. Eng. tech Intel Corporation ", "Experience Eng Tech Intel Corporation Eng Tech Intel Corporation Eng Tech Intel Corporation ", "Experience eng. tech Intel Corporation April 1993  – Present (22 years 5 months) Make sure all robots were running at all times and fix them when needed. Made sure product was running and sent to Sort for final shipping. high purity welder GE February 1977  –  May 1990  (13 years 4 months) Welded all high purity Aluminum, Stainless steel, Titaniun, Hexaloy, Rene 41 and other metals needed for jet engines. Some work in secret lab. eng. tech Intel Corporation April 1993  – Present (22 years 5 months) Make sure all robots were running at all times and fix them when needed. Made sure product was running and sent to Sort for final shipping. eng. tech Intel Corporation April 1993  – Present (22 years 5 months) Make sure all robots were running at all times and fix them when needed. Made sure product was running and sent to Sort for final shipping. high purity welder GE February 1977  –  May 1990  (13 years 4 months) Welded all high purity Aluminum, Stainless steel, Titaniun, Hexaloy, Rene 41 and other metals needed for jet engines. Some work in secret lab. high purity welder GE February 1977  –  May 1990  (13 years 4 months) Welded all high purity Aluminum, Stainless steel, Titaniun, Hexaloy, Rene 41 and other metals needed for jet engines. Some work in secret lab. Skills Arc Welding Drafting and surveying Eng. Tech... Skills  Arc Welding Drafting and surveying Eng. Tech... Arc Welding Drafting and surveying Eng. Tech... Arc Welding Drafting and surveying Eng. Tech... Education Albuquerque High Mach. Drafting and Surveying Albuquerque High Mach. Drafting and Surveying Albuquerque High Mach. Drafting and Surveying Albuquerque High Mach. Drafting and Surveying ", "Experience Eng. Tech Intel Corporation November 2002  – Present (12 years 10 months) DuPont, WA Worked in various groups within validation, including CV, Performance, Infrastructure and now Security Validation. \n \nAlso worked in front facing group, ESAA labs, doing real world computing validation. Eng. Tech Intel Corporation November 1996  –  July 1998  (1 year 9 months) Server/Desktop Manufacture line Eng. Tech Intel Corporation November 2002  – Present (12 years 10 months) DuPont, WA Worked in various groups within validation, including CV, Performance, Infrastructure and now Security Validation. \n \nAlso worked in front facing group, ESAA labs, doing real world computing validation. Eng. Tech Intel Corporation November 2002  – Present (12 years 10 months) DuPont, WA Worked in various groups within validation, including CV, Performance, Infrastructure and now Security Validation. \n \nAlso worked in front facing group, ESAA labs, doing real world computing validation. Eng. Tech Intel Corporation November 1996  –  July 1998  (1 year 9 months) Server/Desktop Manufacture line Eng. Tech Intel Corporation November 1996  –  July 1998  (1 year 9 months) Server/Desktop Manufacture line Skills Semiconductors Debugging Embedded Systems Analog IC SoC Semiconductor Industry Intel Failure Analysis Electronics Design of Experiments Device Drivers Metrology Engineering Management SPC Skills  Semiconductors Debugging Embedded Systems Analog IC SoC Semiconductor Industry Intel Failure Analysis Electronics Design of Experiments Device Drivers Metrology Engineering Management SPC Semiconductors Debugging Embedded Systems Analog IC SoC Semiconductor Industry Intel Failure Analysis Electronics Design of Experiments Device Drivers Metrology Engineering Management SPC Semiconductors Debugging Embedded Systems Analog IC SoC Semiconductor Industry Intel Failure Analysis Electronics Design of Experiments Device Drivers Metrology Engineering Management SPC Education Bates Technical College Network and System Administration/Administrator Studied Network Administration and CCNA. Bates Technical College Network and System Administration/Administrator Studied Network Administration and CCNA. Bates Technical College Network and System Administration/Administrator Studied Network Administration and CCNA. Bates Technical College Network and System Administration/Administrator Studied Network Administration and CCNA. ", "Experience Lithography Eng Tech Intel Corporation March 2011  – Present (4 years 6 months) Rio Rancho, NM Franchise Owner / Manager Meineke Car Care Centers, Inc. November 2007  –  October 2009  (2 years) Managed all daily aspects of the repair facility including Customer Service, Sales, Part / Inventory management, Vender coordination, Employee assignments, Dispute Resolution, and Sales and Service Report documentation. Manufacturing Engineer Spansion July 2006  –  July 2007  (1 year 1 month) Process Engineer Dupont Photomask April 2002  –  January 2005  (2 years 10 months) Module Shift Manager Advanced Micro Devices August 1989  –  October 2001  (12 years 3 months) Lithography Eng Tech Intel Corporation March 2011  – Present (4 years 6 months) Rio Rancho, NM Lithography Eng Tech Intel Corporation March 2011  – Present (4 years 6 months) Rio Rancho, NM Franchise Owner / Manager Meineke Car Care Centers, Inc. November 2007  –  October 2009  (2 years) Managed all daily aspects of the repair facility including Customer Service, Sales, Part / Inventory management, Vender coordination, Employee assignments, Dispute Resolution, and Sales and Service Report documentation. Franchise Owner / Manager Meineke Car Care Centers, Inc. November 2007  –  October 2009  (2 years) Managed all daily aspects of the repair facility including Customer Service, Sales, Part / Inventory management, Vender coordination, Employee assignments, Dispute Resolution, and Sales and Service Report documentation. Manufacturing Engineer Spansion July 2006  –  July 2007  (1 year 1 month) Manufacturing Engineer Spansion July 2006  –  July 2007  (1 year 1 month) Process Engineer Dupont Photomask April 2002  –  January 2005  (2 years 10 months) Process Engineer Dupont Photomask April 2002  –  January 2005  (2 years 10 months) Module Shift Manager Advanced Micro Devices August 1989  –  October 2001  (12 years 3 months) Module Shift Manager Advanced Micro Devices August 1989  –  October 2001  (12 years 3 months) Skills Manufacturing Contract Negotiation Training Inventory Management Customer Service Perl Product Engineering Optics Continuous Improvement CMOS Design of Experiments Cross-functional Team... Debugging Program Management Semiconductor Industry IC Automation Sales Negotiation Semiconductors Team Building Lean Manufacturing Six Sigma Engineering Engineering Management Process Simulation Simulations Team Leadership Photolithography Algorithms Electronics Management Operations Management Process Engineering Thin Films FMEA JMP Leadership Metrology Silicon Quality Assurance Process Control SPC Product Management Supply Chain Management Root Cause Analysis R&D Failure Analysis Start-ups Characterization See 35+     See less Skills  Manufacturing Contract Negotiation Training Inventory Management Customer Service Perl Product Engineering Optics Continuous Improvement CMOS Design of Experiments Cross-functional Team... Debugging Program Management Semiconductor Industry IC Automation Sales Negotiation Semiconductors Team Building Lean Manufacturing Six Sigma Engineering Engineering Management Process Simulation Simulations Team Leadership Photolithography Algorithms Electronics Management Operations Management Process Engineering Thin Films FMEA JMP Leadership Metrology Silicon Quality Assurance Process Control SPC Product Management Supply Chain Management Root Cause Analysis R&D Failure Analysis Start-ups Characterization See 35+     See less Manufacturing Contract Negotiation Training Inventory Management Customer Service Perl Product Engineering Optics Continuous Improvement CMOS Design of Experiments Cross-functional Team... Debugging Program Management Semiconductor Industry IC Automation Sales Negotiation Semiconductors Team Building Lean Manufacturing Six Sigma Engineering Engineering Management Process Simulation Simulations Team Leadership Photolithography Algorithms Electronics Management Operations Management Process Engineering Thin Films FMEA JMP Leadership Metrology Silicon Quality Assurance Process Control SPC Product Management Supply Chain Management Root Cause Analysis R&D Failure Analysis Start-ups Characterization See 35+     See less Manufacturing Contract Negotiation Training Inventory Management Customer Service Perl Product Engineering Optics Continuous Improvement CMOS Design of Experiments Cross-functional Team... Debugging Program Management Semiconductor Industry IC Automation Sales Negotiation Semiconductors Team Building Lean Manufacturing Six Sigma Engineering Engineering Management Process Simulation Simulations Team Leadership Photolithography Algorithms Electronics Management Operations Management Process Engineering Thin Films FMEA JMP Leadership Metrology Silicon Quality Assurance Process Control SPC Product Management Supply Chain Management Root Cause Analysis R&D Failure Analysis Start-ups Characterization See 35+     See less Education Texas State University BS,  Physics 1983  – 1989 Texas State University-San Marcos Texas State University BS,  Physics 1983  – 1989 Texas State University BS,  Physics 1983  – 1989 Texas State University BS,  Physics 1983  – 1989 Texas State University-San Marcos Texas State University-San Marcos Texas State University-San Marcos ", "Experience Manufacturing Eng Tech Intel Corporation June 2000  – Present (15 years 3 months) Manufacturing Technician TRW 1989  –  2000  (11 years) Manufacturing Eng Tech Intel Corporation June 2000  – Present (15 years 3 months) Manufacturing Eng Tech Intel Corporation June 2000  – Present (15 years 3 months) Manufacturing Technician TRW 1989  –  2000  (11 years) Manufacturing Technician TRW 1989  –  2000  (11 years) Skills Semiconductors SPC Design of Experiments Electronics CVD Design for Manufacturing Manufacturing Lean Manufacturing Manufacturing... FMEA Engineering Testing Root Cause Analysis Test Equipment Continuous Improvement Robotics Engineering Management Manufacturing... See 3+     See less Skills  Semiconductors SPC Design of Experiments Electronics CVD Design for Manufacturing Manufacturing Lean Manufacturing Manufacturing... FMEA Engineering Testing Root Cause Analysis Test Equipment Continuous Improvement Robotics Engineering Management Manufacturing... See 3+     See less Semiconductors SPC Design of Experiments Electronics CVD Design for Manufacturing Manufacturing Lean Manufacturing Manufacturing... FMEA Engineering Testing Root Cause Analysis Test Equipment Continuous Improvement Robotics Engineering Management Manufacturing... See 3+     See less Semiconductors SPC Design of Experiments Electronics CVD Design for Manufacturing Manufacturing Lean Manufacturing Manufacturing... FMEA Engineering Testing Root Cause Analysis Test Equipment Continuous Improvement Robotics Engineering Management Manufacturing... See 3+     See less ", "Experience ENG. TECH Intel Corporation ENG. TECH Intel Corporation ENG. TECH Intel Corporation ", "Experience Eng. Tech Intel Corporation Eng. Tech Intel Corporation Eng. Tech Intel Corporation ", "Experience eng tech Intel Corporation eng tech Intel Corporation eng tech Intel Corporation ", "Experience Eng Tech Intel Corporation Eng Tech Intel Corporation Eng Tech Intel Corporation Skills Semiconductors Skills  Semiconductors Semiconductors Semiconductors ", "Experience Eng. Tech Intel Corporation Eng. Tech Intel Corporation Eng. Tech Intel Corporation "]}