{"position": "Engineering Department Manager", "company": "Intel Corporation", "profiles": ["Experience VP, Global Supply Chain & Special Projects TowerJazz September 2014  – Present (1 year) VP, business operations TowerJazz April 2010  – Present (5 years 5 months) F28 Engineering Department Manager Intel Corporation January 2009  –  April 2010  (1 year 4 months) F28 Program office manager Intel Corporation July 2007  –  January 2009  (1 year 7 months) Program Manager Brooks Automation June 2003  –  June 2006  (3 years 1 month) Director of Manufacturing Tower Semiconductor LTD March 1993  –  June 2003  (10 years 4 months) Manafacturing manager National Semiconductor July 1988  –  March 1993  (4 years 9 months) VP, Global Supply Chain & Special Projects TowerJazz September 2014  – Present (1 year) VP, Global Supply Chain & Special Projects TowerJazz September 2014  – Present (1 year) VP, business operations TowerJazz April 2010  – Present (5 years 5 months) VP, business operations TowerJazz April 2010  – Present (5 years 5 months) F28 Engineering Department Manager Intel Corporation January 2009  –  April 2010  (1 year 4 months) F28 Engineering Department Manager Intel Corporation January 2009  –  April 2010  (1 year 4 months) F28 Program office manager Intel Corporation July 2007  –  January 2009  (1 year 7 months) F28 Program office manager Intel Corporation July 2007  –  January 2009  (1 year 7 months) Program Manager Brooks Automation June 2003  –  June 2006  (3 years 1 month) Program Manager Brooks Automation June 2003  –  June 2006  (3 years 1 month) Director of Manufacturing Tower Semiconductor LTD March 1993  –  June 2003  (10 years 4 months) Director of Manufacturing Tower Semiconductor LTD March 1993  –  June 2003  (10 years 4 months) Manafacturing manager National Semiconductor July 1988  –  March 1993  (4 years 9 months) Manafacturing manager National Semiconductor July 1988  –  March 1993  (4 years 9 months) Skills Semiconductors Engineering Management Product Engineering R&D Semiconductor Industry Metrology IC SPC Product Management Manufacturing Cross-functional Team... Product Marketing Electronics Operations Management Product Development Analog Six Sigma Optics Start-ups Intel Supply Chain Management Design of Experiments Go-to-market Strategy Failure Analysis Manufacturing... Program Management Thin Films JMP Process Engineering Yield Continuous Improvement SoC Lean Manufacturing CMOS ERP International Business Strategic Partnerships Engineering Mixed Signal ASIC See 25+     See less Skills  Semiconductors Engineering Management Product Engineering R&D Semiconductor Industry Metrology IC SPC Product Management Manufacturing Cross-functional Team... Product Marketing Electronics Operations Management Product Development Analog Six Sigma Optics Start-ups Intel Supply Chain Management Design of Experiments Go-to-market Strategy Failure Analysis Manufacturing... Program Management Thin Films JMP Process Engineering Yield Continuous Improvement SoC Lean Manufacturing CMOS ERP International Business Strategic Partnerships Engineering Mixed Signal ASIC See 25+     See less Semiconductors Engineering Management Product Engineering R&D Semiconductor Industry Metrology IC SPC Product Management Manufacturing Cross-functional Team... Product Marketing Electronics Operations Management Product Development Analog Six Sigma Optics Start-ups Intel Supply Chain Management Design of Experiments Go-to-market Strategy Failure Analysis Manufacturing... Program Management Thin Films JMP Process Engineering Yield Continuous Improvement SoC Lean Manufacturing CMOS ERP International Business Strategic Partnerships Engineering Mixed Signal ASIC See 25+     See less Semiconductors Engineering Management Product Engineering R&D Semiconductor Industry Metrology IC SPC Product Management Manufacturing Cross-functional Team... Product Marketing Electronics Operations Management Product Development Analog Six Sigma Optics Start-ups Intel Supply Chain Management Design of Experiments Go-to-market Strategy Failure Analysis Manufacturing... Program Management Thin Films JMP Process Engineering Yield Continuous Improvement SoC Lean Manufacturing CMOS ERP International Business Strategic Partnerships Engineering Mixed Signal ASIC See 25+     See less Education Reali high school 1977  – 1980 Heriot-Watt University MBA,  Business Administration University of Haifa BA,  Politicle sciense , statistics,  Economics Reali high school 1977  – 1980 Reali high school 1977  – 1980 Reali high school 1977  – 1980 Heriot-Watt University MBA,  Business Administration Heriot-Watt University MBA,  Business Administration Heriot-Watt University MBA,  Business Administration University of Haifa BA,  Politicle sciense , statistics,  Economics University of Haifa BA,  Politicle sciense , statistics,  Economics University of Haifa BA,  Politicle sciense , statistics,  Economics ", "Experience Engineering Department Manager Intel Corporation January 2010  – Present (5 years 8 months) Penang, Malaysia Responsible for tactical and strategic positioning to ensure operation health meeting the safety, quality, productivty, cost, cycle time and people development in high volume high mix factory environment. The responsibility includes timely start up for new product/technology transfer. Yield Engineering Department Manager Intel Corporation January 2008  –  September 2010  (2 years 9 months) In charge of overall process and product yield performance and various engineering tools and system improvement particularly for signal detection and response to attain yield improvement. Q&R Department Manager Intel Corporation January 2003  –  January 2008  (5 years 1 month) Established Quality Method and Systems to ensure products shipped in compliance with Intel Quality and Reliability specifications. Multi years experience in ISO9001 audit. Leadership in various excursion issues and technical solutions. Engineering Department Manager Intel Corporation January 2010  – Present (5 years 8 months) Penang, Malaysia Responsible for tactical and strategic positioning to ensure operation health meeting the safety, quality, productivty, cost, cycle time and people development in high volume high mix factory environment. The responsibility includes timely start up for new product/technology transfer. Engineering Department Manager Intel Corporation January 2010  – Present (5 years 8 months) Penang, Malaysia Responsible for tactical and strategic positioning to ensure operation health meeting the safety, quality, productivty, cost, cycle time and people development in high volume high mix factory environment. The responsibility includes timely start up for new product/technology transfer. Yield Engineering Department Manager Intel Corporation January 2008  –  September 2010  (2 years 9 months) In charge of overall process and product yield performance and various engineering tools and system improvement particularly for signal detection and response to attain yield improvement. Yield Engineering Department Manager Intel Corporation January 2008  –  September 2010  (2 years 9 months) In charge of overall process and product yield performance and various engineering tools and system improvement particularly for signal detection and response to attain yield improvement. Q&R Department Manager Intel Corporation January 2003  –  January 2008  (5 years 1 month) Established Quality Method and Systems to ensure products shipped in compliance with Intel Quality and Reliability specifications. Multi years experience in ISO9001 audit. Leadership in various excursion issues and technical solutions. Q&R Department Manager Intel Corporation January 2003  –  January 2008  (5 years 1 month) Established Quality Method and Systems to ensure products shipped in compliance with Intel Quality and Reliability specifications. Multi years experience in ISO9001 audit. Leadership in various excursion issues and technical solutions. Skills Crisis Management Critical Thinking Financial Analysis Lean Manufacturing Creative Problem Solving Quality Assurance Semiconductor Failure... Advanced Process Control Management Semiconductors Engineering Six Sigma Program Management Continuous Improvement Electronics Process Engineering Process Improvement See 2+     See less Skills  Crisis Management Critical Thinking Financial Analysis Lean Manufacturing Creative Problem Solving Quality Assurance Semiconductor Failure... Advanced Process Control Management Semiconductors Engineering Six Sigma Program Management Continuous Improvement Electronics Process Engineering Process Improvement See 2+     See less Crisis Management Critical Thinking Financial Analysis Lean Manufacturing Creative Problem Solving Quality Assurance Semiconductor Failure... Advanced Process Control Management Semiconductors Engineering Six Sigma Program Management Continuous Improvement Electronics Process Engineering Process Improvement See 2+     See less Crisis Management Critical Thinking Financial Analysis Lean Manufacturing Creative Problem Solving Quality Assurance Semiconductor Failure... Advanced Process Control Management Semiconductors Engineering Six Sigma Program Management Continuous Improvement Electronics Process Engineering Process Improvement See 2+     See less Education Malaysia University of Science Bachelor's of Materials Engineering 1988  – 1992 Activities and Societies:  Students' Society Leader. Malaysia University of Science Bachelor's of Materials Engineering 1988  – 1992 Activities and Societies:  Students' Society Leader. Malaysia University of Science Bachelor's of Materials Engineering 1988  – 1992 Activities and Societies:  Students' Society Leader. Malaysia University of Science Bachelor's of Materials Engineering 1988  – 1992 Activities and Societies:  Students' Society Leader. ", "Summary I am a 40 year old male with both US and European citizenship. I have two Master degrees from MIT and am currently the Asia Outsourcing and Procurement Manager for Intel's Boards and Systems products. Prior to that, I was the Director of Test Equipment Engineering at Intel's largest Assembly&Test factory for CPU's (Chengdu, China). My academic and professional experiences cover both the technical and business sides of an organization. My MIT degrees include an MBA and a Masters of Mechanical Engineering, where my MBA was focused on Leadership Development, Supply Chain, and Operations. My working experience includes roles that were business oriented where I have influenced product roadmaps and supply chain structures and roles that were technically oriented where my team delivered leading edge engineering solutions that has keep Intel ahead of the competition. I have rich International experience including several years in the US, a short assignment in Europe, and the last 9 years in China. I am English fluent with proficiency in Chinese. I have demonstrated success in leading large multi-national teams across multiple divisions to deliver major organizational results including Intel China’s first two mobile CPU start-ups and ramp. I also have proven capability in developing leaders and sat on the Governing Board for the China Leaders for Global Operations Program at Shanghai Jiao Tong University for four-years (as an Intel representative and advisor for developing leaders in China). Summary I am a 40 year old male with both US and European citizenship. I have two Master degrees from MIT and am currently the Asia Outsourcing and Procurement Manager for Intel's Boards and Systems products. Prior to that, I was the Director of Test Equipment Engineering at Intel's largest Assembly&Test factory for CPU's (Chengdu, China). My academic and professional experiences cover both the technical and business sides of an organization. My MIT degrees include an MBA and a Masters of Mechanical Engineering, where my MBA was focused on Leadership Development, Supply Chain, and Operations. My working experience includes roles that were business oriented where I have influenced product roadmaps and supply chain structures and roles that were technically oriented where my team delivered leading edge engineering solutions that has keep Intel ahead of the competition. I have rich International experience including several years in the US, a short assignment in Europe, and the last 9 years in China. I am English fluent with proficiency in Chinese. I have demonstrated success in leading large multi-national teams across multiple divisions to deliver major organizational results including Intel China’s first two mobile CPU start-ups and ramp. I also have proven capability in developing leaders and sat on the Governing Board for the China Leaders for Global Operations Program at Shanghai Jiao Tong University for four-years (as an Intel representative and advisor for developing leaders in China). I am a 40 year old male with both US and European citizenship. I have two Master degrees from MIT and am currently the Asia Outsourcing and Procurement Manager for Intel's Boards and Systems products. Prior to that, I was the Director of Test Equipment Engineering at Intel's largest Assembly&Test factory for CPU's (Chengdu, China). My academic and professional experiences cover both the technical and business sides of an organization. My MIT degrees include an MBA and a Masters of Mechanical Engineering, where my MBA was focused on Leadership Development, Supply Chain, and Operations. My working experience includes roles that were business oriented where I have influenced product roadmaps and supply chain structures and roles that were technically oriented where my team delivered leading edge engineering solutions that has keep Intel ahead of the competition. I have rich International experience including several years in the US, a short assignment in Europe, and the last 9 years in China. I am English fluent with proficiency in Chinese. I have demonstrated success in leading large multi-national teams across multiple divisions to deliver major organizational results including Intel China’s first two mobile CPU start-ups and ramp. I also have proven capability in developing leaders and sat on the Governing Board for the China Leaders for Global Operations Program at Shanghai Jiao Tong University for four-years (as an Intel representative and advisor for developing leaders in China). I am a 40 year old male with both US and European citizenship. I have two Master degrees from MIT and am currently the Asia Outsourcing and Procurement Manager for Intel's Boards and Systems products. Prior to that, I was the Director of Test Equipment Engineering at Intel's largest Assembly&Test factory for CPU's (Chengdu, China). My academic and professional experiences cover both the technical and business sides of an organization. My MIT degrees include an MBA and a Masters of Mechanical Engineering, where my MBA was focused on Leadership Development, Supply Chain, and Operations. My working experience includes roles that were business oriented where I have influenced product roadmaps and supply chain structures and roles that were technically oriented where my team delivered leading edge engineering solutions that has keep Intel ahead of the competition. I have rich International experience including several years in the US, a short assignment in Europe, and the last 9 years in China. I am English fluent with proficiency in Chinese. I have demonstrated success in leading large multi-national teams across multiple divisions to deliver major organizational results including Intel China’s first two mobile CPU start-ups and ramp. I also have proven capability in developing leaders and sat on the Governing Board for the China Leaders for Global Operations Program at Shanghai Jiao Tong University for four-years (as an Intel representative and advisor for developing leaders in China). Experience Asia Outsourcing & Procurement Manager Intel Corporation March 2014  – Present (1 year 6 months) Shanghai City, China Support several business units across Intel to enable and optimize a supply chain that is responsive, cost effective, socially responsible, and gives Intel a strategic advantage. My team is responsible for providing industry intelligence, negotiating, influencing, contracting, supplier management, problem solving, and factory operations. Outsourcing Program Manager Intel Corporation April 2012  – Present (3 years 5 months) Shanghai, China Responsible for commericial contract and price negotiation within Intel's Enterprise Server Division. Director of Equipment Engineering (Chengdu, China) Intel February 2010  –  March 2012  (2 years 2 months) Chengdu, China Manage a team of 240+ advanced degree engineers and technicians who are responsible for maintenance and optimization of 150+ pieces of equipment (valued at ~$200M USD and produce more than 100M units per year). The team is also responsible for all aspects of equipment performance to ensure the highest quality standards and performance including but not limited to Process Control, Preventative Maintenance, Quick Conversions (SMED), Availability, Reduced IQ Times, and cost reduction via spares management. Director of New Product Introduction Intel Corporation January 2007  –  January 2010  (3 years 1 month) Chengdu and Shanghai, China Led Intel’s first two CPU product introduction and ramps in China (code named Penryn and Arrandale) both of which garnered Intel China’s highest achievement award dubbed the “Intel China Award”. Helped quadruple factory capacity through the successful introduction of more than 40 new line items…which in turn drove a 2x reduction in cost per unit. Industrial Engineering Department Manager Intel Corporation January 2006  –  December 2006  (1 year) Shanghai, China Reduced capital spending by 50% ($14M) through a 20+% improvement in utilization as well application of LEAN and improved factory capacity by 25% by driving equipment utilization and process optimization. Systems and Software Development Manager Intel Corporation August 2002  –  December 2005  (3 years 5 months) Phoenix, Arizona Area Led a team of 100+ engineers, computer programmers, and business analysts located in five countries to develop and deploy a suite of enterprise-level applications to manage Intel’s entire back-end capacity and capital, which helped drive an 80% reduction in Intel’s customer response. Supply Chain Consultant (International Work Assignment) Eastman Kodak May 2001  –  January 2002  (9 months) Paris, France & Nottingham, England Developed and implemented a supply chain solution for administering Kodak’s European product portfolio including product introduction/discontinuance procedures, inventory control, and cost impact analysis. Portfolio optimization via packaging simplification resulted in cost savings of ~$2M USD. Asia Outsourcing & Procurement Manager Intel Corporation March 2014  – Present (1 year 6 months) Shanghai City, China Support several business units across Intel to enable and optimize a supply chain that is responsive, cost effective, socially responsible, and gives Intel a strategic advantage. My team is responsible for providing industry intelligence, negotiating, influencing, contracting, supplier management, problem solving, and factory operations. Asia Outsourcing & Procurement Manager Intel Corporation March 2014  – Present (1 year 6 months) Shanghai City, China Support several business units across Intel to enable and optimize a supply chain that is responsive, cost effective, socially responsible, and gives Intel a strategic advantage. My team is responsible for providing industry intelligence, negotiating, influencing, contracting, supplier management, problem solving, and factory operations. Outsourcing Program Manager Intel Corporation April 2012  – Present (3 years 5 months) Shanghai, China Responsible for commericial contract and price negotiation within Intel's Enterprise Server Division. Outsourcing Program Manager Intel Corporation April 2012  – Present (3 years 5 months) Shanghai, China Responsible for commericial contract and price negotiation within Intel's Enterprise Server Division. Director of Equipment Engineering (Chengdu, China) Intel February 2010  –  March 2012  (2 years 2 months) Chengdu, China Manage a team of 240+ advanced degree engineers and technicians who are responsible for maintenance and optimization of 150+ pieces of equipment (valued at ~$200M USD and produce more than 100M units per year). The team is also responsible for all aspects of equipment performance to ensure the highest quality standards and performance including but not limited to Process Control, Preventative Maintenance, Quick Conversions (SMED), Availability, Reduced IQ Times, and cost reduction via spares management. Director of Equipment Engineering (Chengdu, China) Intel February 2010  –  March 2012  (2 years 2 months) Chengdu, China Manage a team of 240+ advanced degree engineers and technicians who are responsible for maintenance and optimization of 150+ pieces of equipment (valued at ~$200M USD and produce more than 100M units per year). The team is also responsible for all aspects of equipment performance to ensure the highest quality standards and performance including but not limited to Process Control, Preventative Maintenance, Quick Conversions (SMED), Availability, Reduced IQ Times, and cost reduction via spares management. Director of New Product Introduction Intel Corporation January 2007  –  January 2010  (3 years 1 month) Chengdu and Shanghai, China Led Intel’s first two CPU product introduction and ramps in China (code named Penryn and Arrandale) both of which garnered Intel China’s highest achievement award dubbed the “Intel China Award”. Helped quadruple factory capacity through the successful introduction of more than 40 new line items…which in turn drove a 2x reduction in cost per unit. Director of New Product Introduction Intel Corporation January 2007  –  January 2010  (3 years 1 month) Chengdu and Shanghai, China Led Intel’s first two CPU product introduction and ramps in China (code named Penryn and Arrandale) both of which garnered Intel China’s highest achievement award dubbed the “Intel China Award”. Helped quadruple factory capacity through the successful introduction of more than 40 new line items…which in turn drove a 2x reduction in cost per unit. Industrial Engineering Department Manager Intel Corporation January 2006  –  December 2006  (1 year) Shanghai, China Reduced capital spending by 50% ($14M) through a 20+% improvement in utilization as well application of LEAN and improved factory capacity by 25% by driving equipment utilization and process optimization. Industrial Engineering Department Manager Intel Corporation January 2006  –  December 2006  (1 year) Shanghai, China Reduced capital spending by 50% ($14M) through a 20+% improvement in utilization as well application of LEAN and improved factory capacity by 25% by driving equipment utilization and process optimization. Systems and Software Development Manager Intel Corporation August 2002  –  December 2005  (3 years 5 months) Phoenix, Arizona Area Led a team of 100+ engineers, computer programmers, and business analysts located in five countries to develop and deploy a suite of enterprise-level applications to manage Intel’s entire back-end capacity and capital, which helped drive an 80% reduction in Intel’s customer response. Systems and Software Development Manager Intel Corporation August 2002  –  December 2005  (3 years 5 months) Phoenix, Arizona Area Led a team of 100+ engineers, computer programmers, and business analysts located in five countries to develop and deploy a suite of enterprise-level applications to manage Intel’s entire back-end capacity and capital, which helped drive an 80% reduction in Intel’s customer response. Supply Chain Consultant (International Work Assignment) Eastman Kodak May 2001  –  January 2002  (9 months) Paris, France & Nottingham, England Developed and implemented a supply chain solution for administering Kodak’s European product portfolio including product introduction/discontinuance procedures, inventory control, and cost impact analysis. Portfolio optimization via packaging simplification resulted in cost savings of ~$2M USD. Supply Chain Consultant (International Work Assignment) Eastman Kodak May 2001  –  January 2002  (9 months) Paris, France & Nottingham, England Developed and implemented a supply chain solution for administering Kodak’s European product portfolio including product introduction/discontinuance procedures, inventory control, and cost impact analysis. Portfolio optimization via packaging simplification resulted in cost savings of ~$2M USD. Languages English Native or bilingual proficiency Chinese Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills DOE SPC Semiconductors FMEA Assembly Change Management Launching Of New... Contract Negotiation Contract Management Supplier Management Capacity Planning Capacity Management Capacity Modeling Technical Presentations Presentation Coaching Influential Cost Reduction Cost Management Supply Chain... Operations Management Lean Manufacturing Manufacturing Supply Chain Management Engineering Management Supply Management Microprocessors Cross-functional Team... Design of Experiments IC Management Processors Product Launch Process Engineering Engineering Social Influence Strategy See 21+     See less Skills  DOE SPC Semiconductors FMEA Assembly Change Management Launching Of New... Contract Negotiation Contract Management Supplier Management Capacity Planning Capacity Management Capacity Modeling Technical Presentations Presentation Coaching Influential Cost Reduction Cost Management Supply Chain... Operations Management Lean Manufacturing Manufacturing Supply Chain Management Engineering Management Supply Management Microprocessors Cross-functional Team... Design of Experiments IC Management Processors Product Launch Process Engineering Engineering Social Influence Strategy See 21+     See less DOE SPC Semiconductors FMEA Assembly Change Management Launching Of New... Contract Negotiation Contract Management Supplier Management Capacity Planning Capacity Management Capacity Modeling Technical Presentations Presentation Coaching Influential Cost Reduction Cost Management Supply Chain... Operations Management Lean Manufacturing Manufacturing Supply Chain Management Engineering Management Supply Management Microprocessors Cross-functional Team... Design of Experiments IC Management Processors Product Launch Process Engineering Engineering Social Influence Strategy See 21+     See less DOE SPC Semiconductors FMEA Assembly Change Management Launching Of New... Contract Negotiation Contract Management Supplier Management Capacity Planning Capacity Management Capacity Modeling Technical Presentations Presentation Coaching Influential Cost Reduction Cost Management Supply Chain... Operations Management Lean Manufacturing Manufacturing Supply Chain Management Engineering Management Supply Management Microprocessors Cross-functional Team... Design of Experiments IC Management Processors Product Launch Process Engineering Engineering Social Influence Strategy See 21+     See less Education Massachusetts Institute of Technology MS,  Mechanical Engineering 2000  – 2002 Massachusetts Institute of Technology - Sloan School of Management MBA,  Operations and Supply Chain 2000  – 2002 The University of New Mexico BS,  Mechanical Engineering 1993  – 1998 Massachusetts Institute of Technology MS,  Mechanical Engineering 2000  – 2002 Massachusetts Institute of Technology MS,  Mechanical Engineering 2000  – 2002 Massachusetts Institute of Technology MS,  Mechanical Engineering 2000  – 2002 Massachusetts Institute of Technology - Sloan School of Management MBA,  Operations and Supply Chain 2000  – 2002 Massachusetts Institute of Technology - Sloan School of Management MBA,  Operations and Supply Chain 2000  – 2002 Massachusetts Institute of Technology - Sloan School of Management MBA,  Operations and Supply Chain 2000  – 2002 The University of New Mexico BS,  Mechanical Engineering 1993  – 1998 The University of New Mexico BS,  Mechanical Engineering 1993  – 1998 The University of New Mexico BS,  Mechanical Engineering 1993  – 1998 ", "Summary Senior manager with 10+ years experience managing large multidisciplinary populations (ranging from 250 – 1200 employees) on a 7 x 24 shift rotation in the high technology semiconductor and electronics manufacturing sectors, developing, establishing and directing execution of operation policies. Summary Senior manager with 10+ years experience managing large multidisciplinary populations (ranging from 250 – 1200 employees) on a 7 x 24 shift rotation in the high technology semiconductor and electronics manufacturing sectors, developing, establishing and directing execution of operation policies. Senior manager with 10+ years experience managing large multidisciplinary populations (ranging from 250 – 1200 employees) on a 7 x 24 shift rotation in the high technology semiconductor and electronics manufacturing sectors, developing, establishing and directing execution of operation policies. Senior manager with 10+ years experience managing large multidisciplinary populations (ranging from 250 – 1200 employees) on a 7 x 24 shift rotation in the high technology semiconductor and electronics manufacturing sectors, developing, establishing and directing execution of operation policies. Experience Engineering Department Manager Intel Corporation January 2011  – Present (4 years 8 months) Fab 24 Manufacturing Department Manager Intel Corporation June 2006  –  December 2010  (4 years 7 months) Engineering Department Manager Intel Corporation January 2011  – Present (4 years 8 months) Engineering Department Manager Intel Corporation January 2011  – Present (4 years 8 months) Fab 24 Manufacturing Department Manager Intel Corporation June 2006  –  December 2010  (4 years 7 months) Fab 24 Manufacturing Department Manager Intel Corporation June 2006  –  December 2010  (4 years 7 months) Skills Operations Management Organizational Structure Systems Thinking Strategic Planning Lean Manufacturing Staff Development Data-driven Decision... Goal-driven leader Project Management Technology Transfer Analytic Problem Solving Employee Engagement Employee Relations Employee Management Coaching Staff Management by Objectives Lean Tools Managing Start-ups Manufacturing... See 4+     See less Skills  Operations Management Organizational Structure Systems Thinking Strategic Planning Lean Manufacturing Staff Development Data-driven Decision... Goal-driven leader Project Management Technology Transfer Analytic Problem Solving Employee Engagement Employee Relations Employee Management Coaching Staff Management by Objectives Lean Tools Managing Start-ups Manufacturing... See 4+     See less Operations Management Organizational Structure Systems Thinking Strategic Planning Lean Manufacturing Staff Development Data-driven Decision... Goal-driven leader Project Management Technology Transfer Analytic Problem Solving Employee Engagement Employee Relations Employee Management Coaching Staff Management by Objectives Lean Tools Managing Start-ups Manufacturing... See 4+     See less Operations Management Organizational Structure Systems Thinking Strategic Planning Lean Manufacturing Staff Development Data-driven Decision... Goal-driven leader Project Management Technology Transfer Analytic Problem Solving Employee Engagement Employee Relations Employee Management Coaching Staff Management by Objectives Lean Tools Managing Start-ups Manufacturing... See 4+     See less Education University of Limerick Bachelor of Science (BS),  Engineering Science , 1st Class Honours 2011  – 2013 National University of Ireland, Maynooth HDip,  Information Technology 1999  – 2000 Dublin Institute of Technology Diploma,  Mechanical Engineering 1987  – 1988 University of Limerick Bachelor of Science (BS),  Engineering Science , 1st Class Honours 2011  – 2013 University of Limerick Bachelor of Science (BS),  Engineering Science , 1st Class Honours 2011  – 2013 University of Limerick Bachelor of Science (BS),  Engineering Science , 1st Class Honours 2011  – 2013 National University of Ireland, Maynooth HDip,  Information Technology 1999  – 2000 National University of Ireland, Maynooth HDip,  Information Technology 1999  – 2000 National University of Ireland, Maynooth HDip,  Information Technology 1999  – 2000 Dublin Institute of Technology Diploma,  Mechanical Engineering 1987  – 1988 Dublin Institute of Technology Diploma,  Mechanical Engineering 1987  – 1988 Dublin Institute of Technology Diploma,  Mechanical Engineering 1987  – 1988 ", "Summary Senior engineering and operations professional with extensive success in quality improvement, new process development and manufacturing.\n \n \n• Extensive experience in process development, ramping and enhancing of operations  \n• Proven track record of managing teams to optimize highly complex production processes\n \n• Repeated demonstration in improving organizational performance by focusing on shared goals, clear processes and respect for all team members\n \n• Skilled in Lean implementation, TPS, SPC, ISO9001 certification, Factory Physics, and process integration and development. Summary Senior engineering and operations professional with extensive success in quality improvement, new process development and manufacturing.\n \n \n• Extensive experience in process development, ramping and enhancing of operations  \n• Proven track record of managing teams to optimize highly complex production processes\n \n• Repeated demonstration in improving organizational performance by focusing on shared goals, clear processes and respect for all team members\n \n• Skilled in Lean implementation, TPS, SPC, ISO9001 certification, Factory Physics, and process integration and development. Senior engineering and operations professional with extensive success in quality improvement, new process development and manufacturing.\n \n \n• Extensive experience in process development, ramping and enhancing of operations  \n• Proven track record of managing teams to optimize highly complex production processes\n \n• Repeated demonstration in improving organizational performance by focusing on shared goals, clear processes and respect for all team members\n \n• Skilled in Lean implementation, TPS, SPC, ISO9001 certification, Factory Physics, and process integration and development. Senior engineering and operations professional with extensive success in quality improvement, new process development and manufacturing.\n \n \n• Extensive experience in process development, ramping and enhancing of operations  \n• Proven track record of managing teams to optimize highly complex production processes\n \n• Repeated demonstration in improving organizational performance by focusing on shared goals, clear processes and respect for all team members\n \n• Skilled in Lean implementation, TPS, SPC, ISO9001 certification, Factory Physics, and process integration and development. Experience Director of Quality, FLIR Surveillance Boston FLIR Systems March 2015  – Present (6 months) Billerica, MA Yield/Quality Dept Manager/Director, New Business Development Manager Intel Corporation January 2011  –  March 2015  (4 years 3 months) Fab 17, Hudson, MA Litho Engineering Department Manager Intel Corporation January 2009  –  January 2011  (2 years 1 month) Hudson, MA Shift Manager, Assistant Manufacturing Manager Intel Corporation July 2006  –  January 2009  (2 years 7 months) Fab 17, Hudson, MA Automation Department Manager Intel Corporation July 2005  –  July 2006  (1 year 1 month) Fab 17, Hudson, MA Etch Group Leader, Etch Department Manager Intel Corporation June 2001  –  July 2005  (4 years 2 months) Fab 17, Hudson, MA Engineer/ Manager Intel Corporation 1995  –  June 2001  (6 years) Portland, Oregon Area Director of Quality, FLIR Surveillance Boston FLIR Systems March 2015  – Present (6 months) Billerica, MA Director of Quality, FLIR Surveillance Boston FLIR Systems March 2015  – Present (6 months) Billerica, MA Yield/Quality Dept Manager/Director, New Business Development Manager Intel Corporation January 2011  –  March 2015  (4 years 3 months) Fab 17, Hudson, MA Yield/Quality Dept Manager/Director, New Business Development Manager Intel Corporation January 2011  –  March 2015  (4 years 3 months) Fab 17, Hudson, MA Litho Engineering Department Manager Intel Corporation January 2009  –  January 2011  (2 years 1 month) Hudson, MA Litho Engineering Department Manager Intel Corporation January 2009  –  January 2011  (2 years 1 month) Hudson, MA Shift Manager, Assistant Manufacturing Manager Intel Corporation July 2006  –  January 2009  (2 years 7 months) Fab 17, Hudson, MA Shift Manager, Assistant Manufacturing Manager Intel Corporation July 2006  –  January 2009  (2 years 7 months) Fab 17, Hudson, MA Automation Department Manager Intel Corporation July 2005  –  July 2006  (1 year 1 month) Fab 17, Hudson, MA Automation Department Manager Intel Corporation July 2005  –  July 2006  (1 year 1 month) Fab 17, Hudson, MA Etch Group Leader, Etch Department Manager Intel Corporation June 2001  –  July 2005  (4 years 2 months) Fab 17, Hudson, MA Etch Group Leader, Etch Department Manager Intel Corporation June 2001  –  July 2005  (4 years 2 months) Fab 17, Hudson, MA Engineer/ Manager Intel Corporation 1995  –  June 2001  (6 years) Portland, Oregon Area Engineer/ Manager Intel Corporation 1995  –  June 2001  (6 years) Portland, Oregon Area Languages   Skills Engineering Management Semiconductors Manufacturing Lithography Process Engineering Manufacturing... Intel Design of Experiments Lean Manufacturing Semiconductor Industry Failure Analysis IC SPC MEMS Yield Product Engineering Engineering Metrology Automation JMP Silicon Thin Films CMOS CVD Characterization Cross-functional Team... See 11+     See less Skills  Engineering Management Semiconductors Manufacturing Lithography Process Engineering Manufacturing... Intel Design of Experiments Lean Manufacturing Semiconductor Industry Failure Analysis IC SPC MEMS Yield Product Engineering Engineering Metrology Automation JMP Silicon Thin Films CMOS CVD Characterization Cross-functional Team... See 11+     See less Engineering Management Semiconductors Manufacturing Lithography Process Engineering Manufacturing... Intel Design of Experiments Lean Manufacturing Semiconductor Industry Failure Analysis IC SPC MEMS Yield Product Engineering Engineering Metrology Automation JMP Silicon Thin Films CMOS CVD Characterization Cross-functional Team... See 11+     See less Engineering Management Semiconductors Manufacturing Lithography Process Engineering Manufacturing... Intel Design of Experiments Lean Manufacturing Semiconductor Industry Failure Analysis IC SPC MEMS Yield Product Engineering Engineering Metrology Automation JMP Silicon Thin Films CMOS CVD Characterization Cross-functional Team... See 11+     See less Education Massachusetts Institute of Technology Bachelor of Science (BS) Massachusetts Institute of Technology Bachelor of Science (BS) Massachusetts Institute of Technology Bachelor of Science (BS) Massachusetts Institute of Technology Bachelor of Science (BS) Honors & Awards ", "Experience CEO SiliconMesa Corporation November 2011  – Present (3 years 10 months) Albuquerque, Las Cruces, El Paso, Phoenix SiliconMesa is a business service company that provides cloud-based software and secure data storage solutions for targeted business segments. Factory Manager Intel Corporation September 2009  –  October 2011  (2 years 2 months) Albuquerque, New Mexico Area Fab11X Factory Manager, responsible for managing the factory readiness, technology transfer/startup, and production ramp for Intel's 32nm technology at Intel - New Mexico. Engineering Department Manager Intel Corporation May 2004  –  September 2009  (5 years 5 months) Albuquerque, New Mexico Area Yield & Technology Integration Engineering Manager in Fab11 Engineering Group Leader Intel Corporation November 2000  –  May 2004  (3 years 7 months) Albuquerque, New Mexico Area Process Integration & Device Engineering Group Leader in Fab11 Process Integration Engineer Intel Corporation July 1999  –  November 2000  (1 year 5 months) Albuquerque, New Mexico Area Backend Process Integration Engineer in Fab11 Process Engineer Intel Corporation February 1993  –  July 1999  (6 years 6 months) Albuquerque, New Mexico Area Thin Films Process Engineer / Team Leader in Fab11 Controls Engineer General Motors May 1990  –  August 1992  (2 years 4 months) Greater Detroit Area Buick City Automobile Assembly Plant in Flint, MI Electrical Engineer Raytheon May 1989  –  August 1989  (4 months) White Sands Missile Range, NM LC-38 Patriot Missile Test Site CEO SiliconMesa Corporation November 2011  – Present (3 years 10 months) Albuquerque, Las Cruces, El Paso, Phoenix SiliconMesa is a business service company that provides cloud-based software and secure data storage solutions for targeted business segments. CEO SiliconMesa Corporation November 2011  – Present (3 years 10 months) Albuquerque, Las Cruces, El Paso, Phoenix SiliconMesa is a business service company that provides cloud-based software and secure data storage solutions for targeted business segments. Factory Manager Intel Corporation September 2009  –  October 2011  (2 years 2 months) Albuquerque, New Mexico Area Fab11X Factory Manager, responsible for managing the factory readiness, technology transfer/startup, and production ramp for Intel's 32nm technology at Intel - New Mexico. Factory Manager Intel Corporation September 2009  –  October 2011  (2 years 2 months) Albuquerque, New Mexico Area Fab11X Factory Manager, responsible for managing the factory readiness, technology transfer/startup, and production ramp for Intel's 32nm technology at Intel - New Mexico. Engineering Department Manager Intel Corporation May 2004  –  September 2009  (5 years 5 months) Albuquerque, New Mexico Area Yield & Technology Integration Engineering Manager in Fab11 Engineering Department Manager Intel Corporation May 2004  –  September 2009  (5 years 5 months) Albuquerque, New Mexico Area Yield & Technology Integration Engineering Manager in Fab11 Engineering Group Leader Intel Corporation November 2000  –  May 2004  (3 years 7 months) Albuquerque, New Mexico Area Process Integration & Device Engineering Group Leader in Fab11 Engineering Group Leader Intel Corporation November 2000  –  May 2004  (3 years 7 months) Albuquerque, New Mexico Area Process Integration & Device Engineering Group Leader in Fab11 Process Integration Engineer Intel Corporation July 1999  –  November 2000  (1 year 5 months) Albuquerque, New Mexico Area Backend Process Integration Engineer in Fab11 Process Integration Engineer Intel Corporation July 1999  –  November 2000  (1 year 5 months) Albuquerque, New Mexico Area Backend Process Integration Engineer in Fab11 Process Engineer Intel Corporation February 1993  –  July 1999  (6 years 6 months) Albuquerque, New Mexico Area Thin Films Process Engineer / Team Leader in Fab11 Process Engineer Intel Corporation February 1993  –  July 1999  (6 years 6 months) Albuquerque, New Mexico Area Thin Films Process Engineer / Team Leader in Fab11 Controls Engineer General Motors May 1990  –  August 1992  (2 years 4 months) Greater Detroit Area Buick City Automobile Assembly Plant in Flint, MI Controls Engineer General Motors May 1990  –  August 1992  (2 years 4 months) Greater Detroit Area Buick City Automobile Assembly Plant in Flint, MI Electrical Engineer Raytheon May 1989  –  August 1989  (4 months) White Sands Missile Range, NM LC-38 Patriot Missile Test Site Electrical Engineer Raytheon May 1989  –  August 1989  (4 months) White Sands Missile Range, NM LC-38 Patriot Missile Test Site Skills Testing Semiconductors Cross-functional Team... Management SPC Lean Manufacturing Product Management Manufacturing Semiconductor Industry Supply Chain Management Leadership Process Simulation Engineering Management Program Management Strategic Planning Process Engineering Thin Films Six Sigma Process Improvement Coaching Business Development Engineering Design of Experiments Product Development See 9+     See less Skills  Testing Semiconductors Cross-functional Team... Management SPC Lean Manufacturing Product Management Manufacturing Semiconductor Industry Supply Chain Management Leadership Process Simulation Engineering Management Program Management Strategic Planning Process Engineering Thin Films Six Sigma Process Improvement Coaching Business Development Engineering Design of Experiments Product Development See 9+     See less Testing Semiconductors Cross-functional Team... Management SPC Lean Manufacturing Product Management Manufacturing Semiconductor Industry Supply Chain Management Leadership Process Simulation Engineering Management Program Management Strategic Planning Process Engineering Thin Films Six Sigma Process Improvement Coaching Business Development Engineering Design of Experiments Product Development See 9+     See less Testing Semiconductors Cross-functional Team... Management SPC Lean Manufacturing Product Management Manufacturing Semiconductor Industry Supply Chain Management Leadership Process Simulation Engineering Management Program Management Strategic Planning Process Engineering Thin Films Six Sigma Process Improvement Coaching Business Development Engineering Design of Experiments Product Development See 9+     See less Education New Mexico State University B.S.,  Electrical Engineering 1988  – 1992 Activities and Societies:  (HKN) Eta Kappa Nu Electrical Engineering Honor Society ,  (TBP) Tau Beta Pi Engineering Honor Society ,  (IEEE) Institute of Electrical and Electronics Engineers Member ,  (SHPE) Society of Hispanic Professional Engineers New Mexico State University B.S.,  Electrical Engineering 1988  – 1992 Activities and Societies:  (HKN) Eta Kappa Nu Electrical Engineering Honor Society ,  (TBP) Tau Beta Pi Engineering Honor Society ,  (IEEE) Institute of Electrical and Electronics Engineers Member ,  (SHPE) Society of Hispanic Professional Engineers New Mexico State University B.S.,  Electrical Engineering 1988  – 1992 Activities and Societies:  (HKN) Eta Kappa Nu Electrical Engineering Honor Society ,  (TBP) Tau Beta Pi Engineering Honor Society ,  (IEEE) Institute of Electrical and Electronics Engineers Member ,  (SHPE) Society of Hispanic Professional Engineers New Mexico State University B.S.,  Electrical Engineering 1988  – 1992 Activities and Societies:  (HKN) Eta Kappa Nu Electrical Engineering Honor Society ,  (TBP) Tau Beta Pi Engineering Honor Society ,  (IEEE) Institute of Electrical and Electronics Engineers Member ,  (SHPE) Society of Hispanic Professional Engineers ", "Summary I love technology and the business but I am inspired by people. This combination is what excites me and fuels my passion to influence and drive change.  \n Summary I love technology and the business but I am inspired by people. This combination is what excites me and fuels my passion to influence and drive change.  \n I love technology and the business but I am inspired by people. This combination is what excites me and fuels my passion to influence and drive change.  \n I love technology and the business but I am inspired by people. This combination is what excites me and fuels my passion to influence and drive change.  \n Experience Data Center Group Operations Manager Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Area I run the Data Center Staff meetings and lead programs required to keep the Data Center Group running efficiently and effectively like Site Strategy, Risk and Control, Diversity, Leaders Summit and others Energy Sector Operations Manager Intel Corporation November 2012  –  November 2013  (1 year 1 month) As an Operations Manager had the responsibilities for the day to day execution of the various programs which were driven by the team both internal to Intel and in conjunction with external companies.  Engineering Department Manager Intel Corporation April 2007  –  December 2012  (5 years 9 months) Fab 28 in Israel and Fab 11X in New Mexico Managed a Lithography Engineering department – a large organization of >400 employees and was responsible to all technological and operational aspects including building the organization for a new technology start-up, creating the culture and setting the tone for the top for behaviors. Data Center Group Operations Manager Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Area I run the Data Center Staff meetings and lead programs required to keep the Data Center Group running efficiently and effectively like Site Strategy, Risk and Control, Diversity, Leaders Summit and others Data Center Group Operations Manager Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Area I run the Data Center Staff meetings and lead programs required to keep the Data Center Group running efficiently and effectively like Site Strategy, Risk and Control, Diversity, Leaders Summit and others Energy Sector Operations Manager Intel Corporation November 2012  –  November 2013  (1 year 1 month) As an Operations Manager had the responsibilities for the day to day execution of the various programs which were driven by the team both internal to Intel and in conjunction with external companies.  Energy Sector Operations Manager Intel Corporation November 2012  –  November 2013  (1 year 1 month) As an Operations Manager had the responsibilities for the day to day execution of the various programs which were driven by the team both internal to Intel and in conjunction with external companies.  Engineering Department Manager Intel Corporation April 2007  –  December 2012  (5 years 9 months) Fab 28 in Israel and Fab 11X in New Mexico Managed a Lithography Engineering department – a large organization of >400 employees and was responsible to all technological and operational aspects including building the organization for a new technology start-up, creating the culture and setting the tone for the top for behaviors. Engineering Department Manager Intel Corporation April 2007  –  December 2012  (5 years 9 months) Fab 28 in Israel and Fab 11X in New Mexico Managed a Lithography Engineering department – a large organization of >400 employees and was responsible to all technological and operational aspects including building the organization for a new technology start-up, creating the culture and setting the tone for the top for behaviors. Languages English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Semiconductors Intel SPC Lithography Semiconductor Industry Silicon Failure Analysis IC Thin Films Cross-functional Team... JMP Electronics Manufacturing Design of Experiments Metrology Characterization Yield R&D Materials Science Product Engineering Analog Photolithography CVD Optics CMOS Engineering Management PVD SoC Process Engineering Engineering Program Management Management See 17+     See less Skills  Semiconductors Intel SPC Lithography Semiconductor Industry Silicon Failure Analysis IC Thin Films Cross-functional Team... JMP Electronics Manufacturing Design of Experiments Metrology Characterization Yield R&D Materials Science Product Engineering Analog Photolithography CVD Optics CMOS Engineering Management PVD SoC Process Engineering Engineering Program Management Management See 17+     See less Semiconductors Intel SPC Lithography Semiconductor Industry Silicon Failure Analysis IC Thin Films Cross-functional Team... JMP Electronics Manufacturing Design of Experiments Metrology Characterization Yield R&D Materials Science Product Engineering Analog Photolithography CVD Optics CMOS Engineering Management PVD SoC Process Engineering Engineering Program Management Management See 17+     See less Semiconductors Intel SPC Lithography Semiconductor Industry Silicon Failure Analysis IC Thin Films Cross-functional Team... JMP Electronics Manufacturing Design of Experiments Metrology Characterization Yield R&D Materials Science Product Engineering Analog Photolithography CVD Optics CMOS Engineering Management PVD SoC Process Engineering Engineering Program Management Management See 17+     See less Education Ben-Gurion University of the Negev Master's degree,  Materials Science 1991  – 1996 1991–1994: B.Sc, Department of Material Engineering, Ben‐Gurion University, Israel \n1994-1996: M.Sc “Characterization of aluminum based oxide layers formed by microwave plasma”, Department of Material Engineering, Ben‐Gurion University, Israel Ben-Gurion University of the Negev Master's degree,  Materials Science 1991  – 1996 1991–1994: B.Sc, Department of Material Engineering, Ben‐Gurion University, Israel \n1994-1996: M.Sc “Characterization of aluminum based oxide layers formed by microwave plasma”, Department of Material Engineering, Ben‐Gurion University, Israel Ben-Gurion University of the Negev Master's degree,  Materials Science 1991  – 1996 1991–1994: B.Sc, Department of Material Engineering, Ben‐Gurion University, Israel \n1994-1996: M.Sc “Characterization of aluminum based oxide layers formed by microwave plasma”, Department of Material Engineering, Ben‐Gurion University, Israel Ben-Gurion University of the Negev Master's degree,  Materials Science 1991  – 1996 1991–1994: B.Sc, Department of Material Engineering, Ben‐Gurion University, Israel \n1994-1996: M.Sc “Characterization of aluminum based oxide layers formed by microwave plasma”, Department of Material Engineering, Ben‐Gurion University, Israel ", "Experience Portfolio Member Change Manager MLC Limited June 2015  – Present (3 months) Sydney Area, Australia Business Improvement Services Manager MLC Limited March 2014  –  May 2015  (1 year 3 months) Sydney Area, Australia Kaizen Tools, Capability & Community Manager MLC Limited July 2012  –  February 2014  (1 year 8 months) Sydney Area, Australia Senior Process Engineer MLC Limited October 2007  –  July 2012  (4 years 10 months) Industrial Engineering Department Manager Intel Corporation July 2005  –  September 2007  (2 years 3 months) Senior Industrial Engineer Intel Corporation May 2004  –  June 2005  (1 year 2 months) Portfolio Member Change Manager MLC Limited June 2015  – Present (3 months) Sydney Area, Australia Portfolio Member Change Manager MLC Limited June 2015  – Present (3 months) Sydney Area, Australia Business Improvement Services Manager MLC Limited March 2014  –  May 2015  (1 year 3 months) Sydney Area, Australia Business Improvement Services Manager MLC Limited March 2014  –  May 2015  (1 year 3 months) Sydney Area, Australia Kaizen Tools, Capability & Community Manager MLC Limited July 2012  –  February 2014  (1 year 8 months) Sydney Area, Australia Kaizen Tools, Capability & Community Manager MLC Limited July 2012  –  February 2014  (1 year 8 months) Sydney Area, Australia Senior Process Engineer MLC Limited October 2007  –  July 2012  (4 years 10 months) Senior Process Engineer MLC Limited October 2007  –  July 2012  (4 years 10 months) Industrial Engineering Department Manager Intel Corporation July 2005  –  September 2007  (2 years 3 months) Industrial Engineering Department Manager Intel Corporation July 2005  –  September 2007  (2 years 3 months) Senior Industrial Engineer Intel Corporation May 2004  –  June 2005  (1 year 2 months) Senior Industrial Engineer Intel Corporation May 2004  –  June 2005  (1 year 2 months) Skills Six Sigma - Black Belt Business Process... Process Engineering Process Management Project Implementation Kaizen Capability Development Process Simulation Lean Tools Business Process Mapping Change Management Facilitations Skills  Six Sigma - Black Belt Business Process... Process Engineering Process Management Project Implementation Kaizen Capability Development Process Simulation Lean Tools Business Process Mapping Change Management Facilitations Six Sigma - Black Belt Business Process... Process Engineering Process Management Project Implementation Kaizen Capability Development Process Simulation Lean Tools Business Process Mapping Change Management Facilitations Six Sigma - Black Belt Business Process... Process Engineering Process Management Project Implementation Kaizen Capability Development Process Simulation Lean Tools Business Process Mapping Change Management Facilitations Education Heriot-Watt University MBA 1999  – 2001 Universiti Teknologi Malaysia Bachelor of Engineering 1994  – 1999 CGL Heriot-Watt University MBA 1999  – 2001 Heriot-Watt University MBA 1999  – 2001 Heriot-Watt University MBA 1999  – 2001 Universiti Teknologi Malaysia Bachelor of Engineering 1994  – 1999 Universiti Teknologi Malaysia Bachelor of Engineering 1994  – 1999 Universiti Teknologi Malaysia Bachelor of Engineering 1994  – 1999 CGL CGL CGL ", "Summary Executive leader successful at establishing, growing and improving high technology manufacturing operations. Extensive experience with complex products requiring a high degree of precision, compliance and control. Track record of building strong and effective organizations. Champion of Lean/Six Sigma deployment.  \n \nSpecialties: Multi-Site Global Operations; Technology Deployment, NPI; Pilot Manufacturing, Scale-Up; Sourcing, Supply Chain, Logistics; Greenfield/Brownfield Expansion; Contract Manufacturing, Outsourcing; Quality Control/Assurance; Regulatory Compliance (cGMP); P&L Ownership (Operations); Plans, Forecasts & Budgets; Cost Reduction; Lean Manufacturing/Six Sigma Summary Executive leader successful at establishing, growing and improving high technology manufacturing operations. Extensive experience with complex products requiring a high degree of precision, compliance and control. Track record of building strong and effective organizations. Champion of Lean/Six Sigma deployment.  \n \nSpecialties: Multi-Site Global Operations; Technology Deployment, NPI; Pilot Manufacturing, Scale-Up; Sourcing, Supply Chain, Logistics; Greenfield/Brownfield Expansion; Contract Manufacturing, Outsourcing; Quality Control/Assurance; Regulatory Compliance (cGMP); P&L Ownership (Operations); Plans, Forecasts & Budgets; Cost Reduction; Lean Manufacturing/Six Sigma Executive leader successful at establishing, growing and improving high technology manufacturing operations. Extensive experience with complex products requiring a high degree of precision, compliance and control. Track record of building strong and effective organizations. Champion of Lean/Six Sigma deployment.  \n \nSpecialties: Multi-Site Global Operations; Technology Deployment, NPI; Pilot Manufacturing, Scale-Up; Sourcing, Supply Chain, Logistics; Greenfield/Brownfield Expansion; Contract Manufacturing, Outsourcing; Quality Control/Assurance; Regulatory Compliance (cGMP); P&L Ownership (Operations); Plans, Forecasts & Budgets; Cost Reduction; Lean Manufacturing/Six Sigma Executive leader successful at establishing, growing and improving high technology manufacturing operations. Extensive experience with complex products requiring a high degree of precision, compliance and control. Track record of building strong and effective organizations. Champion of Lean/Six Sigma deployment.  \n \nSpecialties: Multi-Site Global Operations; Technology Deployment, NPI; Pilot Manufacturing, Scale-Up; Sourcing, Supply Chain, Logistics; Greenfield/Brownfield Expansion; Contract Manufacturing, Outsourcing; Quality Control/Assurance; Regulatory Compliance (cGMP); P&L Ownership (Operations); Plans, Forecasts & Budgets; Cost Reduction; Lean Manufacturing/Six Sigma Experience General Manager, Sr. Director of Manufacturing Operations Waters Corporation May 2012  – Present (3 years 4 months) Milford, MA Member of Global Operations executive staff. Responsible for a $400M, 350 person, multi-plant operation chartered with introduction, manufacture and transfer of Liquid Chromatography instrumentation, spares and components. Functional responsibilities include New Product Introduction, Manufacturing (cGMP), Machining, Engineering, Test, Reliability, Production Planning and Warranty/Repair. Vice President of Operations Advanced Electron Beams April 2011  –  May 2012  (1 year 2 months) Executive team member, reporting to CEO. Responsible for pilot debug, production and delivery of company products, including direct functional responsibility for Manufacturing, Engineering, Quality, Supply Chain, Logistics, Purchasing, Facilities, EHS and IT. Vice President and General Manager, US Manufacturing Evergreen Solar January 2010  –  April 2011  (1 year 4 months) Key member of executive staff, reporting to CEO. Responsible for management and oversight of U.S. manufacturing, global supply chain, global planning and global quality. Multi-site/multi-plant responsibility including an 800 person fully integrated solar panel factory (Devens, MA), a proprietary High Temp Filament factory (Midland, MI) and support of a fully integrated solar subcontract factory (Wuhan, China). Deliver an annual revenue contribution of ~$400M. Sr. Director, Engineering Evergreen Solar May 2007  –  January 2010  (2 years 9 months) Manage 120 person engineering department. Responsible for advanced manufacturing engineering activities including improvement of manufacturing performance, capacity expansion and cost per watt reduction. Primary interface with R&D for definition and execution of the corporate technology roadmap. Key driver for establishing quality, yield, efficiency and throughput capabilities. Engineering Department Manager Intel Corporation 1998  –  2007  (9 years) Manage 70 person engineering department. Sustain and improve process capability, equipment capability, manufacturing methods and operational performance. Accountable for safety, quality, process control, cost, equipment uptime, output, cycle time, staffing/training, budgets, strategic planning and organizational effectiveness. Process Engineering Manager Digital Equipment Corporation 1991  –  1998  (7 years) Sr. Process Engineer Intel Corporation 1984  –  1991  (7 years) General Manager, Sr. Director of Manufacturing Operations Waters Corporation May 2012  – Present (3 years 4 months) Milford, MA Member of Global Operations executive staff. Responsible for a $400M, 350 person, multi-plant operation chartered with introduction, manufacture and transfer of Liquid Chromatography instrumentation, spares and components. Functional responsibilities include New Product Introduction, Manufacturing (cGMP), Machining, Engineering, Test, Reliability, Production Planning and Warranty/Repair. General Manager, Sr. Director of Manufacturing Operations Waters Corporation May 2012  – Present (3 years 4 months) Milford, MA Member of Global Operations executive staff. Responsible for a $400M, 350 person, multi-plant operation chartered with introduction, manufacture and transfer of Liquid Chromatography instrumentation, spares and components. Functional responsibilities include New Product Introduction, Manufacturing (cGMP), Machining, Engineering, Test, Reliability, Production Planning and Warranty/Repair. Vice President of Operations Advanced Electron Beams April 2011  –  May 2012  (1 year 2 months) Executive team member, reporting to CEO. Responsible for pilot debug, production and delivery of company products, including direct functional responsibility for Manufacturing, Engineering, Quality, Supply Chain, Logistics, Purchasing, Facilities, EHS and IT. Vice President of Operations Advanced Electron Beams April 2011  –  May 2012  (1 year 2 months) Executive team member, reporting to CEO. Responsible for pilot debug, production and delivery of company products, including direct functional responsibility for Manufacturing, Engineering, Quality, Supply Chain, Logistics, Purchasing, Facilities, EHS and IT. Vice President and General Manager, US Manufacturing Evergreen Solar January 2010  –  April 2011  (1 year 4 months) Key member of executive staff, reporting to CEO. Responsible for management and oversight of U.S. manufacturing, global supply chain, global planning and global quality. Multi-site/multi-plant responsibility including an 800 person fully integrated solar panel factory (Devens, MA), a proprietary High Temp Filament factory (Midland, MI) and support of a fully integrated solar subcontract factory (Wuhan, China). Deliver an annual revenue contribution of ~$400M. Vice President and General Manager, US Manufacturing Evergreen Solar January 2010  –  April 2011  (1 year 4 months) Key member of executive staff, reporting to CEO. Responsible for management and oversight of U.S. manufacturing, global supply chain, global planning and global quality. Multi-site/multi-plant responsibility including an 800 person fully integrated solar panel factory (Devens, MA), a proprietary High Temp Filament factory (Midland, MI) and support of a fully integrated solar subcontract factory (Wuhan, China). Deliver an annual revenue contribution of ~$400M. Sr. Director, Engineering Evergreen Solar May 2007  –  January 2010  (2 years 9 months) Manage 120 person engineering department. Responsible for advanced manufacturing engineering activities including improvement of manufacturing performance, capacity expansion and cost per watt reduction. Primary interface with R&D for definition and execution of the corporate technology roadmap. Key driver for establishing quality, yield, efficiency and throughput capabilities. Sr. Director, Engineering Evergreen Solar May 2007  –  January 2010  (2 years 9 months) Manage 120 person engineering department. Responsible for advanced manufacturing engineering activities including improvement of manufacturing performance, capacity expansion and cost per watt reduction. Primary interface with R&D for definition and execution of the corporate technology roadmap. Key driver for establishing quality, yield, efficiency and throughput capabilities. Engineering Department Manager Intel Corporation 1998  –  2007  (9 years) Manage 70 person engineering department. Sustain and improve process capability, equipment capability, manufacturing methods and operational performance. Accountable for safety, quality, process control, cost, equipment uptime, output, cycle time, staffing/training, budgets, strategic planning and organizational effectiveness. Engineering Department Manager Intel Corporation 1998  –  2007  (9 years) Manage 70 person engineering department. Sustain and improve process capability, equipment capability, manufacturing methods and operational performance. Accountable for safety, quality, process control, cost, equipment uptime, output, cycle time, staffing/training, budgets, strategic planning and organizational effectiveness. Process Engineering Manager Digital Equipment Corporation 1991  –  1998  (7 years) Process Engineering Manager Digital Equipment Corporation 1991  –  1998  (7 years) Sr. Process Engineer Intel Corporation 1984  –  1991  (7 years) Sr. Process Engineer Intel Corporation 1984  –  1991  (7 years) Skills Cost Reduction Supply Chain Quality Assurance Contract Manufacturing Lean Manufacturing Manufacturing Operations Quality Management Engineering Management Manufacturing... Process Engineering Management Project Planning Continuous Improvement Manufacturing Supply Management 5S Materials Management Strategic Planning Sourcing Six Sigma Materials Purchasing Engineering Budgets Design for Manufacturing Semiconductors SPC Root Cause Analysis MRP Supply Chain Management Manufacturing... Program Management Technology Transfer DMAIC Process Improvement Operational Excellence Iso 9000 Outsourcing Kaizen Electronics Design of Experiments Failure Analysis Value Stream Mapping Process Simulation Forecasting Quality System ISO FMEA R&D Product Development See 35+     See less Skills  Cost Reduction Supply Chain Quality Assurance Contract Manufacturing Lean Manufacturing Manufacturing Operations Quality Management Engineering Management Manufacturing... Process Engineering Management Project Planning Continuous Improvement Manufacturing Supply Management 5S Materials Management Strategic Planning Sourcing Six Sigma Materials Purchasing Engineering Budgets Design for Manufacturing Semiconductors SPC Root Cause Analysis MRP Supply Chain Management Manufacturing... Program Management Technology Transfer DMAIC Process Improvement Operational Excellence Iso 9000 Outsourcing Kaizen Electronics Design of Experiments Failure Analysis Value Stream Mapping Process Simulation Forecasting Quality System ISO FMEA R&D Product Development See 35+     See less Cost Reduction Supply Chain Quality Assurance Contract Manufacturing Lean Manufacturing Manufacturing Operations Quality Management Engineering Management Manufacturing... Process Engineering Management Project Planning Continuous Improvement Manufacturing Supply Management 5S Materials Management Strategic Planning Sourcing Six Sigma Materials Purchasing Engineering Budgets Design for Manufacturing Semiconductors SPC Root Cause Analysis MRP Supply Chain Management Manufacturing... Program Management Technology Transfer DMAIC Process Improvement Operational Excellence Iso 9000 Outsourcing Kaizen Electronics Design of Experiments Failure Analysis Value Stream Mapping Process Simulation Forecasting Quality System ISO FMEA R&D Product Development See 35+     See less Cost Reduction Supply Chain Quality Assurance Contract Manufacturing Lean Manufacturing Manufacturing Operations Quality Management Engineering Management Manufacturing... Process Engineering Management Project Planning Continuous Improvement Manufacturing Supply Management 5S Materials Management Strategic Planning Sourcing Six Sigma Materials Purchasing Engineering Budgets Design for Manufacturing Semiconductors SPC Root Cause Analysis MRP Supply Chain Management Manufacturing... Program Management Technology Transfer DMAIC Process Improvement Operational Excellence Iso 9000 Outsourcing Kaizen Electronics Design of Experiments Failure Analysis Value Stream Mapping Process Simulation Forecasting Quality System ISO FMEA R&D Product Development See 35+     See less Education Clarkson University Bachelor's Degree,  Chemical Engineering Clarkson University Bachelor's Degree,  Chemical Engineering Clarkson University Bachelor's Degree,  Chemical Engineering Clarkson University Bachelor's Degree,  Chemical Engineering ", "Summary After an eclectic 22-year career with Intel I \"retired\" in 2007 and have never regretted that decision. While actively pursuing a single-digit golf handicap index, I have kept busy helping high school students learn math and science. Now I also want to help other Intel folks position themselves so that they can be intentional about their decision to keep working or retire. I’m an \nengineer, not a sales guy or a financial advisor—just a retired former Intel employee who has something I need to share with other senior Intel employees past and present. Summary After an eclectic 22-year career with Intel I \"retired\" in 2007 and have never regretted that decision. While actively pursuing a single-digit golf handicap index, I have kept busy helping high school students learn math and science. Now I also want to help other Intel folks position themselves so that they can be intentional about their decision to keep working or retire. I’m an \nengineer, not a sales guy or a financial advisor—just a retired former Intel employee who has something I need to share with other senior Intel employees past and present. After an eclectic 22-year career with Intel I \"retired\" in 2007 and have never regretted that decision. While actively pursuing a single-digit golf handicap index, I have kept busy helping high school students learn math and science. Now I also want to help other Intel folks position themselves so that they can be intentional about their decision to keep working or retire. I’m an \nengineer, not a sales guy or a financial advisor—just a retired former Intel employee who has something I need to share with other senior Intel employees past and present. After an eclectic 22-year career with Intel I \"retired\" in 2007 and have never regretted that decision. While actively pursuing a single-digit golf handicap index, I have kept busy helping high school students learn math and science. Now I also want to help other Intel folks position themselves so that they can be intentional about their decision to keep working or retire. I’m an \nengineer, not a sales guy or a financial advisor—just a retired former Intel employee who has something I need to share with other senior Intel employees past and present. Experience Cordant Ambassador Cordant Wealth Partners May 2014  – Present (1 year 4 months) Portland, Oregon Area I am a Cordant client since 2005 and have successfully applied the principles and methods of wealth management espoused by Cordant Wealth Partners. I am willing to step off the golf course or out of the tutoring session long enough to share my experiences with prospective Cordant clients.  \n \nBefore I joined Cordant as a client I was referred by another colleague who had left Intel before me. Knowing how much I appreciated that guidance, I think it will be helpful to others as it was for me. It is an unusual/unique arrangement that provides a great resource for prospective clients to get the perspective of one who has gone before them at Cordant as well as through both the retirement from Intel decision and the transition out of the company \n \nIt was the combination of three things that motivated me to step slightly away from retirement: I would enjoy being back on a strong team, I could help my friends and former colleagues as I was helped, and I can contribute to the larger mission of changing the way the financial industry brings value to the client. Tutor in Math and Science Self-employed 2008  – Present (7 years) Working individually with high school students in math (Algebra, Geometry, Trigonometry, Calculus, etc.) and science (Chemistry and Physics). It is fun to be able to share my knowledge and help them gain understanding of subjects that I enjoy. Frankly I find that I learn the subjects even more by teaching them. But the best part is when a student lets me know that he doesn't need my help any more--success! Retired Intel March 2007  – Present (8 years 6 months) Program Manager Intel Corporation--ATM March 2005  –  March 2007  (2 years 1 month) Aloha, OR Lead the team responsible for preparing for and executing the ramp to high volume of Intel’s latest family of microprocessors across five assembly and test factories world wide. Deliver on time site certifications. Identify problems that put the ramp at risk and drive their solutions. Provide a “one stop shop” for all direction and decisions which will impact ATM’s readiness for start-up capability and high volume ramp.  \n \nKey Accomplishments: Resolved engineering capacity crisis that threatened to stall site certification efforts and product sampling plans that would have delayed the manufacturing/market ramps. Delivered five “Copy Exact!” compliant high volume assembly/test factories on time for 1264 production. Responded to a slip in test tool readiness that would have resulted in a loss of over 15M units of capacity. Facilitated an alternative approach that reduced the shortfall to less than 2M units. Led the task force that recommended moving die prep to sort. Product/Test Engineering Manager Intel Corporation--Polymer Memories August 2002  –  March 2005  (2 years 8 months) Aloha, OR Responsible for all aspects of testing polymer ferroelectric memories. This includes defining and developing a test environment to enable rapid yield, product, and reliability learning, developing high volume manufacturing (HVM) sort, burn-in, and final test capabilities for future products, characterizing the polymer memory array to determine process and design sources of variability, and incorporating Design for Test features into the products to enable low cost testing. \n \nKey Accomplishments: Key contributor to the team that determined the proper operation of polymer memory arrays and demonstrated it in an application to senior management. Enabled design learning and process yield improvement by developing and delivering new test capability (h/w and s/w) for three generations of test chips and 24x7 sort operation. Defined the design for testability requirements and test process for the new technology and built a virtual organization to implement it in order to enable HVM. Conducted an orderly and successful placement of all Test employees and equipment as part of the operation shutdown. Start-up Program Manager Intel Corporation--ATM February 2002  –  August 2002  (7 months) Philippines Form and manage cross-functional teams in Malaysia and the Philippines to deliver site readiness for microprocessor product development. Scope includes space, equipment, procedures, and people across multiple disciplines. \n \nKey Accomplishments: Formed two teams to execute site readiness activities in both sites. Established team goals and critical success indicators. Developed integrated project plans to identify interdependencies and critical paths. Identified major risk areas. Both sites were ready in advance of teams returning from the US. Product Engineering Department Manager Intel Corporation--ATM January 2000  –  January 2002  (2 years 1 month) Philippines Manage a growing organization of product engineering (PE) professionals to support high volume microprocessor Assembly/Test manufacturing and new product development. Plan for, hire, and allocate personnel across multiple product families and generations to ensure success in HVM. Drive continuous improvement in product health as well as speedy resolution to product issues. Provide performance management and career development for direct reports and the rest of the organization. Steer the factory as an active member of the factory manager's staff. Drive PE synergy and improvement through the site and virtual factory. Lead site initiatives and factory teams on occasion. \n \nKey Accomplishments: Grew the Cavite PE organization by >50% and established its reputation for excellence in service and support. Established PE and technician competency development programs and strategic plans to grow overall technical capability. Implemented management processes to drive department accomplishments. Conceived and drove approval and implementation for offshore product development engineering for microprocessors. Ran a role model Focal 2001 for the factory and a highly regarded work-life effectiveness program for the site. Recognized as an excellent people manager. DV and FA Lab Manager Intel Corporation--Flash Memories May 1999  –  December 2000  (1 year 8 months) Folsom, CA Lead, grow, and retain an established group of experienced senior technicians to develop, implement, and maintain lab equipment for flash memory design validation and failure analysis. Establish processes to ensure current and future customer satisfaction. Drive Division participation in site- and corporation-wide lab forums.  \n \nKey Accomplishments: Engaged lab customers actively through forums and regular 1:1s to ensure that satisfaction levels are high. Increased lab personnel's focus on strategic improvement through deployment of performance management tools. Established relationships and processes with other Folsom labs enabling easier cross-lab support. Developed a flash engineering-tools Strategic Capability Segment (SCS) to create and maintain a capability roadmap and to establish a capital equipment selection process. Advanced Silicon Contacting Program Manager Intel Corporation--Flash Memories May 1988  –  May 1999  (11 years 1 month) Folsom, CA Define and execute programs to ensure that Intel is able to reliably and cost effectively contact devices in wafer form for test and burn-in. Work with the supplier community to ensure its awareness of Intel’s needs and to identify potential solutions. Drive internal technical teams to establish selection and evaluation criteria and to execute evaluations of new equipment and tooling. Run the Flash SCS responsible for establishing and maintaining process equipment roadmaps and for selecting equipment to meet the roadmap needs. \n \nKey Accomplishments: Wrote the Intel Flash Memory Probing Roadmap to document and communicate future probing requirements. Wrote the Intel Flash Wafer Level Burn-in System Requirements Document. Established and drove buy-in to a revolutionary low cost back-end process vision. Engineering Team Leader Intel Corporation--Flash Memories August 1996  –  May 1998  (1 year 10 months) Folsom, CA Develop and lead the product engineering team responsible for creating and implementing manufacturing systems, and for achieving cross-product yield improvement to accelerate time to world-class product health and manufacturability. Lead cross-site task forces to address specific engineering and manufacturing problems on high volume flash memory products. Manage the world-wide HVM product engineering team to address cross-factory engineering issues. \n \nKey Accomplishments: Built a group of junior engineers into a contributing, performing team. Characterized, qualified, and implemented latent defect activation screen to reduce dependence on burn-in for Px27 product quality. Organized and led the infant mortality Task Force responsible for achieving significant burn in reduction on HVM Flash products. Probes Program Manager Intel Corporation--SEMATECH August 1994  –  August 1996  (2 years 1 month) Austin, TX Responsible for organizing, defining, and driving implementation of development projects to ensure probing capabilities exist for future devices with fine pitch peripheral bond pads or with area array solder bumps. Projects include probe development, probe metrology, probe evaluation test chip, and probe evaluation lab. Responsible for thrust budget of $2.3M and project budget of $1.5M. \n \nKey Accomplishments: Drove consensus of ten SEMATECH member companies on Advanced Probe Technology specification. Executed project to provide 70 mm pitch peripheral probes. Established probe evaluation lab as an industry resource. Various roles in Product Engineering Intel Corporation--Programmable Logic Devices September 1990  –  August 1994  (4 years) Folsom, CA Various roles in Fab Product Engineering/Yield Intel Corporation--Fab 3 September 1984  –  September 1990  (6 years 1 month) Livermore, CA Cordant Ambassador Cordant Wealth Partners May 2014  – Present (1 year 4 months) Portland, Oregon Area I am a Cordant client since 2005 and have successfully applied the principles and methods of wealth management espoused by Cordant Wealth Partners. I am willing to step off the golf course or out of the tutoring session long enough to share my experiences with prospective Cordant clients.  \n \nBefore I joined Cordant as a client I was referred by another colleague who had left Intel before me. Knowing how much I appreciated that guidance, I think it will be helpful to others as it was for me. It is an unusual/unique arrangement that provides a great resource for prospective clients to get the perspective of one who has gone before them at Cordant as well as through both the retirement from Intel decision and the transition out of the company \n \nIt was the combination of three things that motivated me to step slightly away from retirement: I would enjoy being back on a strong team, I could help my friends and former colleagues as I was helped, and I can contribute to the larger mission of changing the way the financial industry brings value to the client. Cordant Ambassador Cordant Wealth Partners May 2014  – Present (1 year 4 months) Portland, Oregon Area I am a Cordant client since 2005 and have successfully applied the principles and methods of wealth management espoused by Cordant Wealth Partners. I am willing to step off the golf course or out of the tutoring session long enough to share my experiences with prospective Cordant clients.  \n \nBefore I joined Cordant as a client I was referred by another colleague who had left Intel before me. Knowing how much I appreciated that guidance, I think it will be helpful to others as it was for me. It is an unusual/unique arrangement that provides a great resource for prospective clients to get the perspective of one who has gone before them at Cordant as well as through both the retirement from Intel decision and the transition out of the company \n \nIt was the combination of three things that motivated me to step slightly away from retirement: I would enjoy being back on a strong team, I could help my friends and former colleagues as I was helped, and I can contribute to the larger mission of changing the way the financial industry brings value to the client. Tutor in Math and Science Self-employed 2008  – Present (7 years) Working individually with high school students in math (Algebra, Geometry, Trigonometry, Calculus, etc.) and science (Chemistry and Physics). It is fun to be able to share my knowledge and help them gain understanding of subjects that I enjoy. Frankly I find that I learn the subjects even more by teaching them. But the best part is when a student lets me know that he doesn't need my help any more--success! Tutor in Math and Science Self-employed 2008  – Present (7 years) Working individually with high school students in math (Algebra, Geometry, Trigonometry, Calculus, etc.) and science (Chemistry and Physics). It is fun to be able to share my knowledge and help them gain understanding of subjects that I enjoy. Frankly I find that I learn the subjects even more by teaching them. But the best part is when a student lets me know that he doesn't need my help any more--success! Retired Intel March 2007  – Present (8 years 6 months) Retired Intel March 2007  – Present (8 years 6 months) Program Manager Intel Corporation--ATM March 2005  –  March 2007  (2 years 1 month) Aloha, OR Lead the team responsible for preparing for and executing the ramp to high volume of Intel’s latest family of microprocessors across five assembly and test factories world wide. Deliver on time site certifications. Identify problems that put the ramp at risk and drive their solutions. Provide a “one stop shop” for all direction and decisions which will impact ATM’s readiness for start-up capability and high volume ramp.  \n \nKey Accomplishments: Resolved engineering capacity crisis that threatened to stall site certification efforts and product sampling plans that would have delayed the manufacturing/market ramps. Delivered five “Copy Exact!” compliant high volume assembly/test factories on time for 1264 production. Responded to a slip in test tool readiness that would have resulted in a loss of over 15M units of capacity. Facilitated an alternative approach that reduced the shortfall to less than 2M units. Led the task force that recommended moving die prep to sort. Program Manager Intel Corporation--ATM March 2005  –  March 2007  (2 years 1 month) Aloha, OR Lead the team responsible for preparing for and executing the ramp to high volume of Intel’s latest family of microprocessors across five assembly and test factories world wide. Deliver on time site certifications. Identify problems that put the ramp at risk and drive their solutions. Provide a “one stop shop” for all direction and decisions which will impact ATM’s readiness for start-up capability and high volume ramp.  \n \nKey Accomplishments: Resolved engineering capacity crisis that threatened to stall site certification efforts and product sampling plans that would have delayed the manufacturing/market ramps. Delivered five “Copy Exact!” compliant high volume assembly/test factories on time for 1264 production. Responded to a slip in test tool readiness that would have resulted in a loss of over 15M units of capacity. Facilitated an alternative approach that reduced the shortfall to less than 2M units. Led the task force that recommended moving die prep to sort. Product/Test Engineering Manager Intel Corporation--Polymer Memories August 2002  –  March 2005  (2 years 8 months) Aloha, OR Responsible for all aspects of testing polymer ferroelectric memories. This includes defining and developing a test environment to enable rapid yield, product, and reliability learning, developing high volume manufacturing (HVM) sort, burn-in, and final test capabilities for future products, characterizing the polymer memory array to determine process and design sources of variability, and incorporating Design for Test features into the products to enable low cost testing. \n \nKey Accomplishments: Key contributor to the team that determined the proper operation of polymer memory arrays and demonstrated it in an application to senior management. Enabled design learning and process yield improvement by developing and delivering new test capability (h/w and s/w) for three generations of test chips and 24x7 sort operation. Defined the design for testability requirements and test process for the new technology and built a virtual organization to implement it in order to enable HVM. Conducted an orderly and successful placement of all Test employees and equipment as part of the operation shutdown. Product/Test Engineering Manager Intel Corporation--Polymer Memories August 2002  –  March 2005  (2 years 8 months) Aloha, OR Responsible for all aspects of testing polymer ferroelectric memories. This includes defining and developing a test environment to enable rapid yield, product, and reliability learning, developing high volume manufacturing (HVM) sort, burn-in, and final test capabilities for future products, characterizing the polymer memory array to determine process and design sources of variability, and incorporating Design for Test features into the products to enable low cost testing. \n \nKey Accomplishments: Key contributor to the team that determined the proper operation of polymer memory arrays and demonstrated it in an application to senior management. Enabled design learning and process yield improvement by developing and delivering new test capability (h/w and s/w) for three generations of test chips and 24x7 sort operation. Defined the design for testability requirements and test process for the new technology and built a virtual organization to implement it in order to enable HVM. Conducted an orderly and successful placement of all Test employees and equipment as part of the operation shutdown. Start-up Program Manager Intel Corporation--ATM February 2002  –  August 2002  (7 months) Philippines Form and manage cross-functional teams in Malaysia and the Philippines to deliver site readiness for microprocessor product development. Scope includes space, equipment, procedures, and people across multiple disciplines. \n \nKey Accomplishments: Formed two teams to execute site readiness activities in both sites. Established team goals and critical success indicators. Developed integrated project plans to identify interdependencies and critical paths. Identified major risk areas. Both sites were ready in advance of teams returning from the US. Start-up Program Manager Intel Corporation--ATM February 2002  –  August 2002  (7 months) Philippines Form and manage cross-functional teams in Malaysia and the Philippines to deliver site readiness for microprocessor product development. Scope includes space, equipment, procedures, and people across multiple disciplines. \n \nKey Accomplishments: Formed two teams to execute site readiness activities in both sites. Established team goals and critical success indicators. Developed integrated project plans to identify interdependencies and critical paths. Identified major risk areas. Both sites were ready in advance of teams returning from the US. Product Engineering Department Manager Intel Corporation--ATM January 2000  –  January 2002  (2 years 1 month) Philippines Manage a growing organization of product engineering (PE) professionals to support high volume microprocessor Assembly/Test manufacturing and new product development. Plan for, hire, and allocate personnel across multiple product families and generations to ensure success in HVM. Drive continuous improvement in product health as well as speedy resolution to product issues. Provide performance management and career development for direct reports and the rest of the organization. Steer the factory as an active member of the factory manager's staff. Drive PE synergy and improvement through the site and virtual factory. Lead site initiatives and factory teams on occasion. \n \nKey Accomplishments: Grew the Cavite PE organization by >50% and established its reputation for excellence in service and support. Established PE and technician competency development programs and strategic plans to grow overall technical capability. Implemented management processes to drive department accomplishments. Conceived and drove approval and implementation for offshore product development engineering for microprocessors. Ran a role model Focal 2001 for the factory and a highly regarded work-life effectiveness program for the site. Recognized as an excellent people manager. Product Engineering Department Manager Intel Corporation--ATM January 2000  –  January 2002  (2 years 1 month) Philippines Manage a growing organization of product engineering (PE) professionals to support high volume microprocessor Assembly/Test manufacturing and new product development. Plan for, hire, and allocate personnel across multiple product families and generations to ensure success in HVM. Drive continuous improvement in product health as well as speedy resolution to product issues. Provide performance management and career development for direct reports and the rest of the organization. Steer the factory as an active member of the factory manager's staff. Drive PE synergy and improvement through the site and virtual factory. Lead site initiatives and factory teams on occasion. \n \nKey Accomplishments: Grew the Cavite PE organization by >50% and established its reputation for excellence in service and support. Established PE and technician competency development programs and strategic plans to grow overall technical capability. Implemented management processes to drive department accomplishments. Conceived and drove approval and implementation for offshore product development engineering for microprocessors. Ran a role model Focal 2001 for the factory and a highly regarded work-life effectiveness program for the site. Recognized as an excellent people manager. DV and FA Lab Manager Intel Corporation--Flash Memories May 1999  –  December 2000  (1 year 8 months) Folsom, CA Lead, grow, and retain an established group of experienced senior technicians to develop, implement, and maintain lab equipment for flash memory design validation and failure analysis. Establish processes to ensure current and future customer satisfaction. Drive Division participation in site- and corporation-wide lab forums.  \n \nKey Accomplishments: Engaged lab customers actively through forums and regular 1:1s to ensure that satisfaction levels are high. Increased lab personnel's focus on strategic improvement through deployment of performance management tools. Established relationships and processes with other Folsom labs enabling easier cross-lab support. Developed a flash engineering-tools Strategic Capability Segment (SCS) to create and maintain a capability roadmap and to establish a capital equipment selection process. DV and FA Lab Manager Intel Corporation--Flash Memories May 1999  –  December 2000  (1 year 8 months) Folsom, CA Lead, grow, and retain an established group of experienced senior technicians to develop, implement, and maintain lab equipment for flash memory design validation and failure analysis. Establish processes to ensure current and future customer satisfaction. Drive Division participation in site- and corporation-wide lab forums.  \n \nKey Accomplishments: Engaged lab customers actively through forums and regular 1:1s to ensure that satisfaction levels are high. Increased lab personnel's focus on strategic improvement through deployment of performance management tools. Established relationships and processes with other Folsom labs enabling easier cross-lab support. Developed a flash engineering-tools Strategic Capability Segment (SCS) to create and maintain a capability roadmap and to establish a capital equipment selection process. Advanced Silicon Contacting Program Manager Intel Corporation--Flash Memories May 1988  –  May 1999  (11 years 1 month) Folsom, CA Define and execute programs to ensure that Intel is able to reliably and cost effectively contact devices in wafer form for test and burn-in. Work with the supplier community to ensure its awareness of Intel’s needs and to identify potential solutions. Drive internal technical teams to establish selection and evaluation criteria and to execute evaluations of new equipment and tooling. Run the Flash SCS responsible for establishing and maintaining process equipment roadmaps and for selecting equipment to meet the roadmap needs. \n \nKey Accomplishments: Wrote the Intel Flash Memory Probing Roadmap to document and communicate future probing requirements. Wrote the Intel Flash Wafer Level Burn-in System Requirements Document. Established and drove buy-in to a revolutionary low cost back-end process vision. Advanced Silicon Contacting Program Manager Intel Corporation--Flash Memories May 1988  –  May 1999  (11 years 1 month) Folsom, CA Define and execute programs to ensure that Intel is able to reliably and cost effectively contact devices in wafer form for test and burn-in. Work with the supplier community to ensure its awareness of Intel’s needs and to identify potential solutions. Drive internal technical teams to establish selection and evaluation criteria and to execute evaluations of new equipment and tooling. Run the Flash SCS responsible for establishing and maintaining process equipment roadmaps and for selecting equipment to meet the roadmap needs. \n \nKey Accomplishments: Wrote the Intel Flash Memory Probing Roadmap to document and communicate future probing requirements. Wrote the Intel Flash Wafer Level Burn-in System Requirements Document. Established and drove buy-in to a revolutionary low cost back-end process vision. Engineering Team Leader Intel Corporation--Flash Memories August 1996  –  May 1998  (1 year 10 months) Folsom, CA Develop and lead the product engineering team responsible for creating and implementing manufacturing systems, and for achieving cross-product yield improvement to accelerate time to world-class product health and manufacturability. Lead cross-site task forces to address specific engineering and manufacturing problems on high volume flash memory products. Manage the world-wide HVM product engineering team to address cross-factory engineering issues. \n \nKey Accomplishments: Built a group of junior engineers into a contributing, performing team. Characterized, qualified, and implemented latent defect activation screen to reduce dependence on burn-in for Px27 product quality. Organized and led the infant mortality Task Force responsible for achieving significant burn in reduction on HVM Flash products. Engineering Team Leader Intel Corporation--Flash Memories August 1996  –  May 1998  (1 year 10 months) Folsom, CA Develop and lead the product engineering team responsible for creating and implementing manufacturing systems, and for achieving cross-product yield improvement to accelerate time to world-class product health and manufacturability. Lead cross-site task forces to address specific engineering and manufacturing problems on high volume flash memory products. Manage the world-wide HVM product engineering team to address cross-factory engineering issues. \n \nKey Accomplishments: Built a group of junior engineers into a contributing, performing team. Characterized, qualified, and implemented latent defect activation screen to reduce dependence on burn-in for Px27 product quality. Organized and led the infant mortality Task Force responsible for achieving significant burn in reduction on HVM Flash products. Probes Program Manager Intel Corporation--SEMATECH August 1994  –  August 1996  (2 years 1 month) Austin, TX Responsible for organizing, defining, and driving implementation of development projects to ensure probing capabilities exist for future devices with fine pitch peripheral bond pads or with area array solder bumps. Projects include probe development, probe metrology, probe evaluation test chip, and probe evaluation lab. Responsible for thrust budget of $2.3M and project budget of $1.5M. \n \nKey Accomplishments: Drove consensus of ten SEMATECH member companies on Advanced Probe Technology specification. Executed project to provide 70 mm pitch peripheral probes. Established probe evaluation lab as an industry resource. Probes Program Manager Intel Corporation--SEMATECH August 1994  –  August 1996  (2 years 1 month) Austin, TX Responsible for organizing, defining, and driving implementation of development projects to ensure probing capabilities exist for future devices with fine pitch peripheral bond pads or with area array solder bumps. Projects include probe development, probe metrology, probe evaluation test chip, and probe evaluation lab. Responsible for thrust budget of $2.3M and project budget of $1.5M. \n \nKey Accomplishments: Drove consensus of ten SEMATECH member companies on Advanced Probe Technology specification. Executed project to provide 70 mm pitch peripheral probes. Established probe evaluation lab as an industry resource. Various roles in Product Engineering Intel Corporation--Programmable Logic Devices September 1990  –  August 1994  (4 years) Folsom, CA Various roles in Product Engineering Intel Corporation--Programmable Logic Devices September 1990  –  August 1994  (4 years) Folsom, CA Various roles in Fab Product Engineering/Yield Intel Corporation--Fab 3 September 1984  –  September 1990  (6 years 1 month) Livermore, CA Various roles in Fab Product Engineering/Yield Intel Corporation--Fab 3 September 1984  –  September 1990  (6 years 1 month) Livermore, CA Skills Semiconductors Semiconductor Industry Design of Experiments Silicon SPC Thin Films Product Management Product Engineering Failure Analysis Processors Engineering Management IC Microprocessors Metrology Debugging Process Engineering Process Integration See 2+     See less Skills  Semiconductors Semiconductor Industry Design of Experiments Silicon SPC Thin Films Product Management Product Engineering Failure Analysis Processors Engineering Management IC Microprocessors Metrology Debugging Process Engineering Process Integration See 2+     See less Semiconductors Semiconductor Industry Design of Experiments Silicon SPC Thin Films Product Management Product Engineering Failure Analysis Processors Engineering Management IC Microprocessors Metrology Debugging Process Engineering Process Integration See 2+     See less Semiconductors Semiconductor Industry Design of Experiments Silicon SPC Thin Films Product Management Product Engineering Failure Analysis Processors Engineering Management IC Microprocessors Metrology Debugging Process Engineering Process Integration See 2+     See less Education University of Florida MS,  Chemical Engineering 1983  – 1984 UC Davis BS,  Chemical Engineering 1979  – 1983 University of Florida MS,  Chemical Engineering 1983  – 1984 University of Florida MS,  Chemical Engineering 1983  – 1984 University of Florida MS,  Chemical Engineering 1983  – 1984 UC Davis BS,  Chemical Engineering 1979  – 1983 UC Davis BS,  Chemical Engineering 1979  – 1983 UC Davis BS,  Chemical Engineering 1979  – 1983 ", "Summary An entrepreneur with experience and background of engineering, technology, high volume manufacturing, organizational development and leadership. Specialties:Advanced Lithium Ion battery technologies and applications; Sales, marketing and distribution; Semiconductor process, device, integration and manufacturing experience; Organizational leadership and development; Lean manufacturing; Green field factory start-up; Quality control system; Customer service; Supply chain management; Summary An entrepreneur with experience and background of engineering, technology, high volume manufacturing, organizational development and leadership. Specialties:Advanced Lithium Ion battery technologies and applications; Sales, marketing and distribution; Semiconductor process, device, integration and manufacturing experience; Organizational leadership and development; Lean manufacturing; Green field factory start-up; Quality control system; Customer service; Supply chain management; An entrepreneur with experience and background of engineering, technology, high volume manufacturing, organizational development and leadership. Specialties:Advanced Lithium Ion battery technologies and applications; Sales, marketing and distribution; Semiconductor process, device, integration and manufacturing experience; Organizational leadership and development; Lean manufacturing; Green field factory start-up; Quality control system; Customer service; Supply chain management; An entrepreneur with experience and background of engineering, technology, high volume manufacturing, organizational development and leadership. Specialties:Advanced Lithium Ion battery technologies and applications; Sales, marketing and distribution; Semiconductor process, device, integration and manufacturing experience; Organizational leadership and development; Lean manufacturing; Green field factory start-up; Quality control system; Customer service; Supply chain management; Experience Co-Founder and General Manager Elite Power Solutions, LLC February 2010  – Present (5 years 7 months) Elite Power Solutions provides the safest and most cost effective Li-ion battery systems for electric vehicle and energy storage solutions. The systems include large format Li-ion batteries, battery management systems and chargers, as complete turn-key solutions. Process Engineering Department Manager Intel Corporation December 2008  –  February 2010  (1 year 3 months) Process Engineering Department Manager; Factory Start-up Process Engineering Manager; Equipment Engineering Manager STMicroelectronics January 1996  –  November 2008  (12 years 11 months) Process Engineering Manager and Equipment Engineering Manager Positions at Carrollton, Singapore and Phoenix sites. Co-Founder and General Manager Elite Power Solutions, LLC February 2010  – Present (5 years 7 months) Elite Power Solutions provides the safest and most cost effective Li-ion battery systems for electric vehicle and energy storage solutions. The systems include large format Li-ion batteries, battery management systems and chargers, as complete turn-key solutions. Co-Founder and General Manager Elite Power Solutions, LLC February 2010  – Present (5 years 7 months) Elite Power Solutions provides the safest and most cost effective Li-ion battery systems for electric vehicle and energy storage solutions. The systems include large format Li-ion batteries, battery management systems and chargers, as complete turn-key solutions. Process Engineering Department Manager Intel Corporation December 2008  –  February 2010  (1 year 3 months) Process Engineering Department Manager; Factory Start-up Process Engineering Department Manager Intel Corporation December 2008  –  February 2010  (1 year 3 months) Process Engineering Department Manager; Factory Start-up Process Engineering Manager; Equipment Engineering Manager STMicroelectronics January 1996  –  November 2008  (12 years 11 months) Process Engineering Manager and Equipment Engineering Manager Positions at Carrollton, Singapore and Phoenix sites. Process Engineering Manager; Equipment Engineering Manager STMicroelectronics January 1996  –  November 2008  (12 years 11 months) Process Engineering Manager and Equipment Engineering Manager Positions at Carrollton, Singapore and Phoenix sites. Languages English Chinese English Chinese English Chinese Skills Lithium-ion Batteries Battery Management... Battery Charger Semiconductors Electronics R&D Marketing Logistics Management Engineering Management Start-ups Process Equipment Failure Analysis IC Design of Experiments Sales Management Manufacturing SPC Thin Films See 3+     See less Skills  Lithium-ion Batteries Battery Management... Battery Charger Semiconductors Electronics R&D Marketing Logistics Management Engineering Management Start-ups Process Equipment Failure Analysis IC Design of Experiments Sales Management Manufacturing SPC Thin Films See 3+     See less Lithium-ion Batteries Battery Management... Battery Charger Semiconductors Electronics R&D Marketing Logistics Management Engineering Management Start-ups Process Equipment Failure Analysis IC Design of Experiments Sales Management Manufacturing SPC Thin Films See 3+     See less Lithium-ion Batteries Battery Management... Battery Charger Semiconductors Electronics R&D Marketing Logistics Management Engineering Management Start-ups Process Equipment Failure Analysis IC Design of Experiments Sales Management Manufacturing SPC Thin Films See 3+     See less Education North Carolina State University Ph.D.,  Physics 1990  – 1995 Fudan University BS,  Physics 1986  – 1990 North Carolina State University Ph.D.,  Physics 1990  – 1995 North Carolina State University Ph.D.,  Physics 1990  – 1995 North Carolina State University Ph.D.,  Physics 1990  – 1995 Fudan University BS,  Physics 1986  – 1990 Fudan University BS,  Physics 1986  – 1990 Fudan University BS,  Physics 1986  – 1990 ", "Skills Semiconductors Product Development Manufacturing Lean Manufacturing Supply Chain Management Project Management Engineering Management Product Engineering Cross-functional Team... Testing Product Management Electrical Engineering Skills  Semiconductors Product Development Manufacturing Lean Manufacturing Supply Chain Management Project Management Engineering Management Product Engineering Cross-functional Team... Testing Product Management Electrical Engineering Semiconductors Product Development Manufacturing Lean Manufacturing Supply Chain Management Project Management Engineering Management Product Engineering Cross-functional Team... Testing Product Management Electrical Engineering Semiconductors Product Development Manufacturing Lean Manufacturing Supply Chain Management Project Management Engineering Management Product Engineering Cross-functional Team... Testing Product Management Electrical Engineering ", "Summary Engineer, Scientist, and Humanitarian. Formal education in Systems Theory applied to topics ranging from Large Space Structures (NASA) to Semiconductor Manufacturing to Organizational Design. At Intel, managed large organizations (with over 1600 employees) and complex leading edge semiconductor manufacturing processes. Excel at developing managers and an advocate for diversity. Active in the community, most notably, as a member of the Board of Directors of the United Way of Central New Mexico. Aspire to make the world better through the use of technology and through my own personal actions. Avid biker and kayaker. Sweeper for the Bootagers Coed soccer team. Summary Engineer, Scientist, and Humanitarian. Formal education in Systems Theory applied to topics ranging from Large Space Structures (NASA) to Semiconductor Manufacturing to Organizational Design. At Intel, managed large organizations (with over 1600 employees) and complex leading edge semiconductor manufacturing processes. Excel at developing managers and an advocate for diversity. Active in the community, most notably, as a member of the Board of Directors of the United Way of Central New Mexico. Aspire to make the world better through the use of technology and through my own personal actions. Avid biker and kayaker. Sweeper for the Bootagers Coed soccer team. Engineer, Scientist, and Humanitarian. Formal education in Systems Theory applied to topics ranging from Large Space Structures (NASA) to Semiconductor Manufacturing to Organizational Design. At Intel, managed large organizations (with over 1600 employees) and complex leading edge semiconductor manufacturing processes. Excel at developing managers and an advocate for diversity. Active in the community, most notably, as a member of the Board of Directors of the United Way of Central New Mexico. Aspire to make the world better through the use of technology and through my own personal actions. Avid biker and kayaker. Sweeper for the Bootagers Coed soccer team. Engineer, Scientist, and Humanitarian. Formal education in Systems Theory applied to topics ranging from Large Space Structures (NASA) to Semiconductor Manufacturing to Organizational Design. At Intel, managed large organizations (with over 1600 employees) and complex leading edge semiconductor manufacturing processes. Excel at developing managers and an advocate for diversity. Active in the community, most notably, as a member of the Board of Directors of the United Way of Central New Mexico. Aspire to make the world better through the use of technology and through my own personal actions. Avid biker and kayaker. Sweeper for the Bootagers Coed soccer team. Experience General Manager, Americas Region Operations Intel Corporation August 2015  – Present (1 month) Corporate Services Site Manager Intel Corporation June 2011  –  July 2015  (4 years 2 months) Rio Rancho, NM Chairman of the Board Global Center for Cultural Entrepreneurs February 2011  –  December 2014  (3 years 11 months) Santa Fe, New Mexico Area The GCCE had a three-fold mission: \n1) We support cultural entrepreneurs to create and scale thier enterprises. \n2) We advocated for cultural entrepreneurship and hte value of a cultural economy. \n3) We connect a global network of cultural entrepreneurs. Director United Way of Central New Mexico March 2006  –  March 2012  (6 years 1 month) Operations Manager Intel Corporation September 2004  –  May 2007  (2 years 9 months) Engineering Department Manager Intel Corporation October 2001  –  September 2004  (3 years) Research Engineer NASA June 1989  –  May 1992  (3 years) General Manager, Americas Region Operations Intel Corporation August 2015  – Present (1 month) General Manager, Americas Region Operations Intel Corporation August 2015  – Present (1 month) Corporate Services Site Manager Intel Corporation June 2011  –  July 2015  (4 years 2 months) Rio Rancho, NM Corporate Services Site Manager Intel Corporation June 2011  –  July 2015  (4 years 2 months) Rio Rancho, NM Chairman of the Board Global Center for Cultural Entrepreneurs February 2011  –  December 2014  (3 years 11 months) Santa Fe, New Mexico Area The GCCE had a three-fold mission: \n1) We support cultural entrepreneurs to create and scale thier enterprises. \n2) We advocated for cultural entrepreneurship and hte value of a cultural economy. \n3) We connect a global network of cultural entrepreneurs. Chairman of the Board Global Center for Cultural Entrepreneurs February 2011  –  December 2014  (3 years 11 months) Santa Fe, New Mexico Area The GCCE had a three-fold mission: \n1) We support cultural entrepreneurs to create and scale thier enterprises. \n2) We advocated for cultural entrepreneurship and hte value of a cultural economy. \n3) We connect a global network of cultural entrepreneurs. Director United Way of Central New Mexico March 2006  –  March 2012  (6 years 1 month) Director United Way of Central New Mexico March 2006  –  March 2012  (6 years 1 month) Operations Manager Intel Corporation September 2004  –  May 2007  (2 years 9 months) Operations Manager Intel Corporation September 2004  –  May 2007  (2 years 9 months) Engineering Department Manager Intel Corporation October 2001  –  September 2004  (3 years) Engineering Department Manager Intel Corporation October 2001  –  September 2004  (3 years) Research Engineer NASA June 1989  –  May 1992  (3 years) Research Engineer NASA June 1989  –  May 1992  (3 years) Languages English English English Skills Manufacturing Processes Lean Manufacturing Design of Experiments Theory of Constraints Control Theory Semiconductors Skills  Manufacturing Processes Lean Manufacturing Design of Experiments Theory of Constraints Control Theory Semiconductors Manufacturing Processes Lean Manufacturing Design of Experiments Theory of Constraints Control Theory Semiconductors Manufacturing Processes Lean Manufacturing Design of Experiments Theory of Constraints Control Theory Semiconductors Education University of Michigan PhD,  Electrical Engineering 1992  – 1995 University of Michigan MSE,  Electrical Engineering 1990  – 1991 University of Michigan BSE,  Electrical Engineering 1986  – 1990 University of Michigan PhD,  Electrical Engineering 1992  – 1995 University of Michigan PhD,  Electrical Engineering 1992  – 1995 University of Michigan PhD,  Electrical Engineering 1992  – 1995 University of Michigan MSE,  Electrical Engineering 1990  – 1991 University of Michigan MSE,  Electrical Engineering 1990  – 1991 University of Michigan MSE,  Electrical Engineering 1990  – 1991 University of Michigan BSE,  Electrical Engineering 1986  – 1990 University of Michigan BSE,  Electrical Engineering 1986  – 1990 University of Michigan BSE,  Electrical Engineering 1986  – 1990 ", "Summary Seasoned engineering and management professional with experience in a fast-paced, high volume manufacturing environment. Have a strong semiconductor process engineering background with a concentration in Photolithography. Well respected manager and individual contributor who is often sought out to lead or be a core member to strengthen teams dealing with diverse technical or organizational challenges. Have made many contributions leading to significant factory changes within the realms of Safety, Quality, Output, Cost, and Organizational Change. \n \nSpecialties: Model Based Problem Solving, Six-Sigma Trained, Team Leadership and Facilitation, Engineering and Manufacturing Management, Project Management, Data Analysis (JMP), Cross-Organizational Collaboration, Lean Manufacturing Implementation, Ramp planning and execution, Organization and Planning, Effective Listening and Communication, Customer Orientation, Confident Decision Making, Quality and Change Control Systems Summary Seasoned engineering and management professional with experience in a fast-paced, high volume manufacturing environment. Have a strong semiconductor process engineering background with a concentration in Photolithography. Well respected manager and individual contributor who is often sought out to lead or be a core member to strengthen teams dealing with diverse technical or organizational challenges. Have made many contributions leading to significant factory changes within the realms of Safety, Quality, Output, Cost, and Organizational Change. \n \nSpecialties: Model Based Problem Solving, Six-Sigma Trained, Team Leadership and Facilitation, Engineering and Manufacturing Management, Project Management, Data Analysis (JMP), Cross-Organizational Collaboration, Lean Manufacturing Implementation, Ramp planning and execution, Organization and Planning, Effective Listening and Communication, Customer Orientation, Confident Decision Making, Quality and Change Control Systems Seasoned engineering and management professional with experience in a fast-paced, high volume manufacturing environment. Have a strong semiconductor process engineering background with a concentration in Photolithography. Well respected manager and individual contributor who is often sought out to lead or be a core member to strengthen teams dealing with diverse technical or organizational challenges. Have made many contributions leading to significant factory changes within the realms of Safety, Quality, Output, Cost, and Organizational Change. \n \nSpecialties: Model Based Problem Solving, Six-Sigma Trained, Team Leadership and Facilitation, Engineering and Manufacturing Management, Project Management, Data Analysis (JMP), Cross-Organizational Collaboration, Lean Manufacturing Implementation, Ramp planning and execution, Organization and Planning, Effective Listening and Communication, Customer Orientation, Confident Decision Making, Quality and Change Control Systems Seasoned engineering and management professional with experience in a fast-paced, high volume manufacturing environment. Have a strong semiconductor process engineering background with a concentration in Photolithography. Well respected manager and individual contributor who is often sought out to lead or be a core member to strengthen teams dealing with diverse technical or organizational challenges. Have made many contributions leading to significant factory changes within the realms of Safety, Quality, Output, Cost, and Organizational Change. \n \nSpecialties: Model Based Problem Solving, Six-Sigma Trained, Team Leadership and Facilitation, Engineering and Manufacturing Management, Project Management, Data Analysis (JMP), Cross-Organizational Collaboration, Lean Manufacturing Implementation, Ramp planning and execution, Organization and Planning, Effective Listening and Communication, Customer Orientation, Confident Decision Making, Quality and Change Control Systems Experience Engineering Group Manager Intel Corporation September 2013  – Present (2 years) Hudson, MA Provide technical guidance and development skills for lithography engineers through the final ramp and closing of the factory. Partnered with peer managers to quickly ramp the lithography area to 500% capacity increase in less than 4 months and maintain layer health and yields for 23 products running simultaneously. Lithography Staff Engineer Intel Corporation June 2009  –  September 2013  (4 years 4 months) Hudson Drove solutions to both lithography and other difficult factory problems using statistical knowledge and problem-solving tools. Collaborated with senior team leaders as problem solving facilitator or key team member for numerous task forces aimed at improving factory quality standards and culture, wafer costs, defect and yield concerns, and output issues during ramps in both lithography and implant. Led several significant process changes and team structure changes for critical integrated modules that improved yield and cycletime. Engineering Department Manager Intel Corporation June 2008  –  June 2009  (1 year 1 month) Hudson, MA Responsible for the technical capability and performance for 30 engineers, 40 equipment technicians and over 100 lithography tools in the process. Reorganized engineering work team structure and Equipment Manager work schedule, indoctrinating Intel's new lean culture into the organization during the factory's most challenging ramp to output max. Manufacturing Shift Manager Intel Corporation September 2005  –  June 2008  (2 years 10 months) Hudson, MA Managed one of two night-shift manufacturing teams in a 7x24 manufacturing environment. Developed a staff of Operations Managers in effective people and technical management and established a learning organization to support high volume manufacturing for ~ 200 manufacturing technicians. Engineering Group Manager Intel Corporation 1998  –  2005  (7 years) Hudson, MA Managed several different groups within lithography responsible for the first ramp and successful site qualification for Intel’s 200mm, 120nm process. Became well-versed in Copy Exact and Process Change Control methods. Engineering manager for lithography and etch responsible for the final rampdown and build-ahead of material for Digital Equipment Corporation's legacy process. Coached more than 100 engineers over this span of time on lithography knowledge, problem solving, process control, team leadership and cultural changes to help Fab 17 solve a multitude of technical challenges and be viewed as a key contributor to Intel's Virtual Factory. Engineering Group Manager/Sustaining Engineer Digital Equipment Corporation 1985  –  1998  (13 years) Hudson, MA Held various engineering and management roles in a pilot and manufacturing line in Digital’s only US Semiconductor technology development facility, fabricating cutting edge high performance CPU’s. Responsible for improving manufacturability of newly developed iline and gline lithography processes, selecting and procuring leading edge equipment, implementing process control systems, low volume manufacturing, tool availability and process cycle times. Lithography Sustaining Engineer NCR Corporation 1982  –  1984  (2 years) Fort Collins, Colorado Area Engineering Group Manager Intel Corporation September 2013  – Present (2 years) Hudson, MA Provide technical guidance and development skills for lithography engineers through the final ramp and closing of the factory. Partnered with peer managers to quickly ramp the lithography area to 500% capacity increase in less than 4 months and maintain layer health and yields for 23 products running simultaneously. Engineering Group Manager Intel Corporation September 2013  – Present (2 years) Hudson, MA Provide technical guidance and development skills for lithography engineers through the final ramp and closing of the factory. Partnered with peer managers to quickly ramp the lithography area to 500% capacity increase in less than 4 months and maintain layer health and yields for 23 products running simultaneously. Lithography Staff Engineer Intel Corporation June 2009  –  September 2013  (4 years 4 months) Hudson Drove solutions to both lithography and other difficult factory problems using statistical knowledge and problem-solving tools. Collaborated with senior team leaders as problem solving facilitator or key team member for numerous task forces aimed at improving factory quality standards and culture, wafer costs, defect and yield concerns, and output issues during ramps in both lithography and implant. Led several significant process changes and team structure changes for critical integrated modules that improved yield and cycletime. Lithography Staff Engineer Intel Corporation June 2009  –  September 2013  (4 years 4 months) Hudson Drove solutions to both lithography and other difficult factory problems using statistical knowledge and problem-solving tools. Collaborated with senior team leaders as problem solving facilitator or key team member for numerous task forces aimed at improving factory quality standards and culture, wafer costs, defect and yield concerns, and output issues during ramps in both lithography and implant. Led several significant process changes and team structure changes for critical integrated modules that improved yield and cycletime. Engineering Department Manager Intel Corporation June 2008  –  June 2009  (1 year 1 month) Hudson, MA Responsible for the technical capability and performance for 30 engineers, 40 equipment technicians and over 100 lithography tools in the process. Reorganized engineering work team structure and Equipment Manager work schedule, indoctrinating Intel's new lean culture into the organization during the factory's most challenging ramp to output max. Engineering Department Manager Intel Corporation June 2008  –  June 2009  (1 year 1 month) Hudson, MA Responsible for the technical capability and performance for 30 engineers, 40 equipment technicians and over 100 lithography tools in the process. Reorganized engineering work team structure and Equipment Manager work schedule, indoctrinating Intel's new lean culture into the organization during the factory's most challenging ramp to output max. Manufacturing Shift Manager Intel Corporation September 2005  –  June 2008  (2 years 10 months) Hudson, MA Managed one of two night-shift manufacturing teams in a 7x24 manufacturing environment. Developed a staff of Operations Managers in effective people and technical management and established a learning organization to support high volume manufacturing for ~ 200 manufacturing technicians. Manufacturing Shift Manager Intel Corporation September 2005  –  June 2008  (2 years 10 months) Hudson, MA Managed one of two night-shift manufacturing teams in a 7x24 manufacturing environment. Developed a staff of Operations Managers in effective people and technical management and established a learning organization to support high volume manufacturing for ~ 200 manufacturing technicians. Engineering Group Manager Intel Corporation 1998  –  2005  (7 years) Hudson, MA Managed several different groups within lithography responsible for the first ramp and successful site qualification for Intel’s 200mm, 120nm process. Became well-versed in Copy Exact and Process Change Control methods. Engineering manager for lithography and etch responsible for the final rampdown and build-ahead of material for Digital Equipment Corporation's legacy process. Coached more than 100 engineers over this span of time on lithography knowledge, problem solving, process control, team leadership and cultural changes to help Fab 17 solve a multitude of technical challenges and be viewed as a key contributor to Intel's Virtual Factory. Engineering Group Manager Intel Corporation 1998  –  2005  (7 years) Hudson, MA Managed several different groups within lithography responsible for the first ramp and successful site qualification for Intel’s 200mm, 120nm process. Became well-versed in Copy Exact and Process Change Control methods. Engineering manager for lithography and etch responsible for the final rampdown and build-ahead of material for Digital Equipment Corporation's legacy process. Coached more than 100 engineers over this span of time on lithography knowledge, problem solving, process control, team leadership and cultural changes to help Fab 17 solve a multitude of technical challenges and be viewed as a key contributor to Intel's Virtual Factory. Engineering Group Manager/Sustaining Engineer Digital Equipment Corporation 1985  –  1998  (13 years) Hudson, MA Held various engineering and management roles in a pilot and manufacturing line in Digital’s only US Semiconductor technology development facility, fabricating cutting edge high performance CPU’s. Responsible for improving manufacturability of newly developed iline and gline lithography processes, selecting and procuring leading edge equipment, implementing process control systems, low volume manufacturing, tool availability and process cycle times. Engineering Group Manager/Sustaining Engineer Digital Equipment Corporation 1985  –  1998  (13 years) Hudson, MA Held various engineering and management roles in a pilot and manufacturing line in Digital’s only US Semiconductor technology development facility, fabricating cutting edge high performance CPU’s. Responsible for improving manufacturability of newly developed iline and gline lithography processes, selecting and procuring leading edge equipment, implementing process control systems, low volume manufacturing, tool availability and process cycle times. Lithography Sustaining Engineer NCR Corporation 1982  –  1984  (2 years) Fort Collins, Colorado Area Lithography Sustaining Engineer NCR Corporation 1982  –  1984  (2 years) Fort Collins, Colorado Area Skills JMP Design of Experiments Silicon Process Integration Problem Solving Failure Analysis Semiconductors Yield SPC Photolithography Semiconductor Industry Thin Films Metrology Lithography Manufacturing Lean Manufacturing Cross-functional Team... CVD Engineering Management Project Management Data Analysis See 6+     See less Skills  JMP Design of Experiments Silicon Process Integration Problem Solving Failure Analysis Semiconductors Yield SPC Photolithography Semiconductor Industry Thin Films Metrology Lithography Manufacturing Lean Manufacturing Cross-functional Team... CVD Engineering Management Project Management Data Analysis See 6+     See less JMP Design of Experiments Silicon Process Integration Problem Solving Failure Analysis Semiconductors Yield SPC Photolithography Semiconductor Industry Thin Films Metrology Lithography Manufacturing Lean Manufacturing Cross-functional Team... CVD Engineering Management Project Management Data Analysis See 6+     See less JMP Design of Experiments Silicon Process Integration Problem Solving Failure Analysis Semiconductors Yield SPC Photolithography Semiconductor Industry Thin Films Metrology Lithography Manufacturing Lean Manufacturing Cross-functional Team... CVD Engineering Management Project Management Data Analysis See 6+     See less Education Yale University BS,  Chemical Engineering 1978  – 1982 Activities and Societies:  Yale Women's Outdoor Track Team (3time Ivy League Javelin Champioin) ,  Davenport College Intramural athletics Clark University MBA 1988  – 1995 Yale University BS,  Chemical Engineering 1978  – 1982 Activities and Societies:  Yale Women's Outdoor Track Team (3time Ivy League Javelin Champioin) ,  Davenport College Intramural athletics Yale University BS,  Chemical Engineering 1978  – 1982 Activities and Societies:  Yale Women's Outdoor Track Team (3time Ivy League Javelin Champioin) ,  Davenport College Intramural athletics Yale University BS,  Chemical Engineering 1978  – 1982 Activities and Societies:  Yale Women's Outdoor Track Team (3time Ivy League Javelin Champioin) ,  Davenport College Intramural athletics Clark University MBA 1988  – 1995 Clark University MBA 1988  – 1995 Clark University MBA 1988  – 1995 ", "Summary Global Operation and Supply Chain Planning Executive \n \n• Proven experience in managing global operational and supply chain units  \n• Leading cross organizational programs and integration of advanced technologies  \n• Good knowledge of Manufacturing Technology / Manufacturing Excellence (culture, processes and tools), Fab Systems & Organizational Flows \n• Five years of Relocation and Startup of a new manufacturing facility in Arizona (US) \n \ne-mail: myuval14@gmail.com Summary Global Operation and Supply Chain Planning Executive \n \n• Proven experience in managing global operational and supply chain units  \n• Leading cross organizational programs and integration of advanced technologies  \n• Good knowledge of Manufacturing Technology / Manufacturing Excellence (culture, processes and tools), Fab Systems & Organizational Flows \n• Five years of Relocation and Startup of a new manufacturing facility in Arizona (US) \n \ne-mail: myuval14@gmail.com Global Operation and Supply Chain Planning Executive \n \n• Proven experience in managing global operational and supply chain units  \n• Leading cross organizational programs and integration of advanced technologies  \n• Good knowledge of Manufacturing Technology / Manufacturing Excellence (culture, processes and tools), Fab Systems & Organizational Flows \n• Five years of Relocation and Startup of a new manufacturing facility in Arizona (US) \n \ne-mail: myuval14@gmail.com Global Operation and Supply Chain Planning Executive \n \n• Proven experience in managing global operational and supply chain units  \n• Leading cross organizational programs and integration of advanced technologies  \n• Good knowledge of Manufacturing Technology / Manufacturing Excellence (culture, processes and tools), Fab Systems & Organizational Flows \n• Five years of Relocation and Startup of a new manufacturing facility in Arizona (US) \n \ne-mail: myuval14@gmail.com Experience TGO / CEE&IS Head of OpEx Teva Pharmaceuticals July 2014  – Present (1 year 2 months) Israel Micron Israel Business Development Program Manager Micron Technology 2011  –  February 2014  (3 years) Create new business horizons  \n(new/different technologies/products) \nbased on Micron Israel core competencies and capabilities. Fab12 ME& Supply Chain Director Micron Technology 2010  –  2011  (1 year) Fab 1 ME& SCP Director Numonyx June 2007  –  March 2010  (2 years 10 months) Fab18 Manufacturing Engineering Department Manager Intel Corporation February 2000  –  May 2007  (7 years 4 months) Intel Arizona - Fab 12 Start Up - Equipment Systems Manager Intel Corporation 1995  –  1999  (4 years) Phoenix, Arizona Area Intel AZ - \nFab12 Start Up Team - Equipment System Manager \nFab12 - Shift Manager \nSite Cordinor \nIntel OR \nFab20 Manufacturing Readiness Manager Fab8 Production GL and Shift Manager Intel Corporation 1990  –  1994  (4 years) Israel Intel Fab8 Production GL and Shift Manager TGO / CEE&IS Head of OpEx Teva Pharmaceuticals July 2014  – Present (1 year 2 months) Israel TGO / CEE&IS Head of OpEx Teva Pharmaceuticals July 2014  – Present (1 year 2 months) Israel Micron Israel Business Development Program Manager Micron Technology 2011  –  February 2014  (3 years) Create new business horizons  \n(new/different technologies/products) \nbased on Micron Israel core competencies and capabilities. Micron Israel Business Development Program Manager Micron Technology 2011  –  February 2014  (3 years) Create new business horizons  \n(new/different technologies/products) \nbased on Micron Israel core competencies and capabilities. Fab12 ME& Supply Chain Director Micron Technology 2010  –  2011  (1 year) Fab12 ME& Supply Chain Director Micron Technology 2010  –  2011  (1 year) Fab 1 ME& SCP Director Numonyx June 2007  –  March 2010  (2 years 10 months) Fab 1 ME& SCP Director Numonyx June 2007  –  March 2010  (2 years 10 months) Fab18 Manufacturing Engineering Department Manager Intel Corporation February 2000  –  May 2007  (7 years 4 months) Fab18 Manufacturing Engineering Department Manager Intel Corporation February 2000  –  May 2007  (7 years 4 months) Intel Arizona - Fab 12 Start Up - Equipment Systems Manager Intel Corporation 1995  –  1999  (4 years) Phoenix, Arizona Area Intel AZ - \nFab12 Start Up Team - Equipment System Manager \nFab12 - Shift Manager \nSite Cordinor \nIntel OR \nFab20 Manufacturing Readiness Manager Intel Arizona - Fab 12 Start Up - Equipment Systems Manager Intel Corporation 1995  –  1999  (4 years) Phoenix, Arizona Area Intel AZ - \nFab12 Start Up Team - Equipment System Manager \nFab12 - Shift Manager \nSite Cordinor \nIntel OR \nFab20 Manufacturing Readiness Manager Fab8 Production GL and Shift Manager Intel Corporation 1990  –  1994  (4 years) Israel Intel Fab8 Production GL and Shift Manager Fab8 Production GL and Shift Manager Intel Corporation 1990  –  1994  (4 years) Israel Intel Fab8 Production GL and Shift Manager Skills Manufacturing Program Management Semiconductors Start-ups Management Cross-functional Team... Supply Chain Management Supply Chain Operations Management Project Management Strategy Lean Manufacturing Business Development Team Building Engineering Continuous Improvement Team Leadership Leadership Development Engineering Management See 4+     See less Skills  Manufacturing Program Management Semiconductors Start-ups Management Cross-functional Team... Supply Chain Management Supply Chain Operations Management Project Management Strategy Lean Manufacturing Business Development Team Building Engineering Continuous Improvement Team Leadership Leadership Development Engineering Management See 4+     See less Manufacturing Program Management Semiconductors Start-ups Management Cross-functional Team... Supply Chain Management Supply Chain Operations Management Project Management Strategy Lean Manufacturing Business Development Team Building Engineering Continuous Improvement Team Leadership Leadership Development Engineering Management See 4+     See less Manufacturing Program Management Semiconductors Start-ups Management Cross-functional Team... Supply Chain Management Supply Chain Operations Management Project Management Strategy Lean Manufacturing Business Development Team Building Engineering Continuous Improvement Team Leadership Leadership Development Engineering Management See 4+     See less ", "Experience Consulting Project Manager Nye County December 2007  – Present (7 years 9 months) Coordination of renewable energy feasibility studies, land use planning efforts, technical support to economic development of solar and wind projects. Sole Proprietor Directed Solutions LLC August 2005  – Present (10 years 1 month) Consulting in water resource planning, infrastructure development, economic development Hardware Engineering Manager Canon Information Systems January 1991  –  January 1999  (8 years 1 month) Network adapters for printers, scanners, copiers Engineering Department Manager Unisys Corporation June 1985  –  December 1990  (5 years 7 months) Mainframe I/O Subsystems Engineering Department Manager Intel Corporation November 1978  –  February 1985  (6 years 4 months) Advanced microprocessor system design; reliability engineering Project Leader/Section Manager Burroughs Corporation May 1971  –  October 1978  (7 years 6 months) Mainframe Computer Design Sr. Design Engineer Varian Data Machines December 1968  –  April 1971  (2 years 5 months) Minicomputer I/O Subsystems Design Engineer Rockwell International June 1962  –  November 1968  (6 years 6 months) Inertial Guidance Control Systems Consulting Project Manager Nye County December 2007  – Present (7 years 9 months) Coordination of renewable energy feasibility studies, land use planning efforts, technical support to economic development of solar and wind projects. Consulting Project Manager Nye County December 2007  – Present (7 years 9 months) Coordination of renewable energy feasibility studies, land use planning efforts, technical support to economic development of solar and wind projects. Sole Proprietor Directed Solutions LLC August 2005  – Present (10 years 1 month) Consulting in water resource planning, infrastructure development, economic development Sole Proprietor Directed Solutions LLC August 2005  – Present (10 years 1 month) Consulting in water resource planning, infrastructure development, economic development Hardware Engineering Manager Canon Information Systems January 1991  –  January 1999  (8 years 1 month) Network adapters for printers, scanners, copiers Hardware Engineering Manager Canon Information Systems January 1991  –  January 1999  (8 years 1 month) Network adapters for printers, scanners, copiers Engineering Department Manager Unisys Corporation June 1985  –  December 1990  (5 years 7 months) Mainframe I/O Subsystems Engineering Department Manager Unisys Corporation June 1985  –  December 1990  (5 years 7 months) Mainframe I/O Subsystems Engineering Department Manager Intel Corporation November 1978  –  February 1985  (6 years 4 months) Advanced microprocessor system design; reliability engineering Engineering Department Manager Intel Corporation November 1978  –  February 1985  (6 years 4 months) Advanced microprocessor system design; reliability engineering Project Leader/Section Manager Burroughs Corporation May 1971  –  October 1978  (7 years 6 months) Mainframe Computer Design Project Leader/Section Manager Burroughs Corporation May 1971  –  October 1978  (7 years 6 months) Mainframe Computer Design Sr. Design Engineer Varian Data Machines December 1968  –  April 1971  (2 years 5 months) Minicomputer I/O Subsystems Sr. Design Engineer Varian Data Machines December 1968  –  April 1971  (2 years 5 months) Minicomputer I/O Subsystems Design Engineer Rockwell International June 1962  –  November 1968  (6 years 6 months) Inertial Guidance Control Systems Design Engineer Rockwell International June 1962  –  November 1968  (6 years 6 months) Inertial Guidance Control Systems Education University of Southern California MSEE,  Electrical Engineering 1964  – 1966 Rensselaer Polytechnic Institute BSEE,  Electrical Engineering 1958  – 1962 University of Southern California MSEE,  Electrical Engineering 1964  – 1966 University of Southern California MSEE,  Electrical Engineering 1964  – 1966 University of Southern California MSEE,  Electrical Engineering 1964  – 1966 Rensselaer Polytechnic Institute BSEE,  Electrical Engineering 1958  – 1962 Rensselaer Polytechnic Institute BSEE,  Electrical Engineering 1958  – 1962 Rensselaer Polytechnic Institute BSEE,  Electrical Engineering 1958  – 1962 ", "Summary 31 years engineering and operations senior management experience across Intel and Digital Equipment and most recently with Sonex Metrology \n \nExtensive product development, Quality Engineering and productivity improvement expertise.  \n \nManaged large, local and international , teams of engineers and new product development groups for over 20 years. \n \nVery focused on delivering rapid results and tangible and sustainable improvements. \n \nIn July 2009 , I formed M.F.Cunningham & associates ltd (focus: management consulting and interim management) and since then we have worked with over 16 Irish based companies delivering improvement projects across the total spectrum from Human Resource to Financial health and engineering improvement to sales and marketing. \n \nIn Dec 2010 , I took on the role of CEO for an exciting new technology spin out company from Dublin City University(DCU) called Sonex Metrology Limited. We are the first company in the world to enable a highly innovative series of wafer fab and package device process metrology tools based on the physics of Photoacoustics. \n \nSpecialties: Delivering rapid and sustainable business improvement results using a very hands on style working onsite and within client company. Summary 31 years engineering and operations senior management experience across Intel and Digital Equipment and most recently with Sonex Metrology \n \nExtensive product development, Quality Engineering and productivity improvement expertise.  \n \nManaged large, local and international , teams of engineers and new product development groups for over 20 years. \n \nVery focused on delivering rapid results and tangible and sustainable improvements. \n \nIn July 2009 , I formed M.F.Cunningham & associates ltd (focus: management consulting and interim management) and since then we have worked with over 16 Irish based companies delivering improvement projects across the total spectrum from Human Resource to Financial health and engineering improvement to sales and marketing. \n \nIn Dec 2010 , I took on the role of CEO for an exciting new technology spin out company from Dublin City University(DCU) called Sonex Metrology Limited. We are the first company in the world to enable a highly innovative series of wafer fab and package device process metrology tools based on the physics of Photoacoustics. \n \nSpecialties: Delivering rapid and sustainable business improvement results using a very hands on style working onsite and within client company. 31 years engineering and operations senior management experience across Intel and Digital Equipment and most recently with Sonex Metrology \n \nExtensive product development, Quality Engineering and productivity improvement expertise.  \n \nManaged large, local and international , teams of engineers and new product development groups for over 20 years. \n \nVery focused on delivering rapid results and tangible and sustainable improvements. \n \nIn July 2009 , I formed M.F.Cunningham & associates ltd (focus: management consulting and interim management) and since then we have worked with over 16 Irish based companies delivering improvement projects across the total spectrum from Human Resource to Financial health and engineering improvement to sales and marketing. \n \nIn Dec 2010 , I took on the role of CEO for an exciting new technology spin out company from Dublin City University(DCU) called Sonex Metrology Limited. We are the first company in the world to enable a highly innovative series of wafer fab and package device process metrology tools based on the physics of Photoacoustics. \n \nSpecialties: Delivering rapid and sustainable business improvement results using a very hands on style working onsite and within client company. 31 years engineering and operations senior management experience across Intel and Digital Equipment and most recently with Sonex Metrology \n \nExtensive product development, Quality Engineering and productivity improvement expertise.  \n \nManaged large, local and international , teams of engineers and new product development groups for over 20 years. \n \nVery focused on delivering rapid results and tangible and sustainable improvements. \n \nIn July 2009 , I formed M.F.Cunningham & associates ltd (focus: management consulting and interim management) and since then we have worked with over 16 Irish based companies delivering improvement projects across the total spectrum from Human Resource to Financial health and engineering improvement to sales and marketing. \n \nIn Dec 2010 , I took on the role of CEO for an exciting new technology spin out company from Dublin City University(DCU) called Sonex Metrology Limited. We are the first company in the world to enable a highly innovative series of wafer fab and package device process metrology tools based on the physics of Photoacoustics. \n \nSpecialties: Delivering rapid and sustainable business improvement results using a very hands on style working onsite and within client company. Experience CEO Sonex Metrology Limited December 2010  – Present (4 years 9 months) We are the first company in the world to enable a Photoacoustics based process metrology for both the wafer fab and package manufacturing. This technology allows for sub-surface defect inspection at production speeds and totally non-invasive to the unit under inspection. Our focus for the last year has been on defect applications such as delamination, metal voiding in horizontal metal layers as well as vertically in Through Silicon Via's (TSV) and finally wafer edge mechanical damage causing slip bands and other sub-surface defects. We have many other applications in development. \n \nOur technology is designed to work as an in- process real time control monitor that can be integrated onto a process tool or standalone in the wafer fab or package manufacturing process. Managing Director m.f.cunningham & associates Ltd August 2009  –  December 2010  (1 year 5 months) I worked hand in hand with over 16 separate small to medium business's to help drive financial growth,customer satisfaction improvement and market expansion. Wafer fab yield engineering department manager Intel Corporation 2002  –  2009  (7 years) Responsible for new product and process introduction to the wafer fab, yield improvement, process Quality and Reliability control, failure analysis and all customer engagement with down stream partners in Assembly test package manufacturing that were both internal and external to Intel. Product Development Manager Intel Corporation 2000  –  2002  (2 years) Phoenix, Arizona Area Coordinated a range of products across various Intel Assembly test sites in order to optimise financial performance, yield and productivity improvement and supply chain effectiveness. Product and Quality engineering manager Intel Corporation August 1993  –  November 2000  (7 years 4 months) Engineering Department manager across various senior roles in Wafer fab, product design and final assembly test business units Senior Engineering Manager Digital Equipment corporation(DEC) 1983  –  1993  (10 years) Worked for initially for 5 years in various senior Engineering roles and then managed engineering groups in product test, Quality control, new product development and design CEO Sonex Metrology Limited December 2010  – Present (4 years 9 months) We are the first company in the world to enable a Photoacoustics based process metrology for both the wafer fab and package manufacturing. This technology allows for sub-surface defect inspection at production speeds and totally non-invasive to the unit under inspection. Our focus for the last year has been on defect applications such as delamination, metal voiding in horizontal metal layers as well as vertically in Through Silicon Via's (TSV) and finally wafer edge mechanical damage causing slip bands and other sub-surface defects. We have many other applications in development. \n \nOur technology is designed to work as an in- process real time control monitor that can be integrated onto a process tool or standalone in the wafer fab or package manufacturing process. CEO Sonex Metrology Limited December 2010  – Present (4 years 9 months) We are the first company in the world to enable a Photoacoustics based process metrology for both the wafer fab and package manufacturing. This technology allows for sub-surface defect inspection at production speeds and totally non-invasive to the unit under inspection. Our focus for the last year has been on defect applications such as delamination, metal voiding in horizontal metal layers as well as vertically in Through Silicon Via's (TSV) and finally wafer edge mechanical damage causing slip bands and other sub-surface defects. We have many other applications in development. \n \nOur technology is designed to work as an in- process real time control monitor that can be integrated onto a process tool or standalone in the wafer fab or package manufacturing process. Managing Director m.f.cunningham & associates Ltd August 2009  –  December 2010  (1 year 5 months) I worked hand in hand with over 16 separate small to medium business's to help drive financial growth,customer satisfaction improvement and market expansion. Managing Director m.f.cunningham & associates Ltd August 2009  –  December 2010  (1 year 5 months) I worked hand in hand with over 16 separate small to medium business's to help drive financial growth,customer satisfaction improvement and market expansion. Wafer fab yield engineering department manager Intel Corporation 2002  –  2009  (7 years) Responsible for new product and process introduction to the wafer fab, yield improvement, process Quality and Reliability control, failure analysis and all customer engagement with down stream partners in Assembly test package manufacturing that were both internal and external to Intel. Wafer fab yield engineering department manager Intel Corporation 2002  –  2009  (7 years) Responsible for new product and process introduction to the wafer fab, yield improvement, process Quality and Reliability control, failure analysis and all customer engagement with down stream partners in Assembly test package manufacturing that were both internal and external to Intel. Product Development Manager Intel Corporation 2000  –  2002  (2 years) Phoenix, Arizona Area Coordinated a range of products across various Intel Assembly test sites in order to optimise financial performance, yield and productivity improvement and supply chain effectiveness. Product Development Manager Intel Corporation 2000  –  2002  (2 years) Phoenix, Arizona Area Coordinated a range of products across various Intel Assembly test sites in order to optimise financial performance, yield and productivity improvement and supply chain effectiveness. Product and Quality engineering manager Intel Corporation August 1993  –  November 2000  (7 years 4 months) Engineering Department manager across various senior roles in Wafer fab, product design and final assembly test business units Product and Quality engineering manager Intel Corporation August 1993  –  November 2000  (7 years 4 months) Engineering Department manager across various senior roles in Wafer fab, product design and final assembly test business units Senior Engineering Manager Digital Equipment corporation(DEC) 1983  –  1993  (10 years) Worked for initially for 5 years in various senior Engineering roles and then managed engineering groups in product test, Quality control, new product development and design Senior Engineering Manager Digital Equipment corporation(DEC) 1983  –  1993  (10 years) Worked for initially for 5 years in various senior Engineering roles and then managed engineering groups in product test, Quality control, new product development and design Skills Management Semiconductor Industry Product Development Business Strategy Semiconductors Process Improvement Engineering Management Consulting Strategy Start-ups IC Skills  Management Semiconductor Industry Product Development Business Strategy Semiconductors Process Improvement Engineering Management Consulting Strategy Start-ups IC Management Semiconductor Industry Product Development Business Strategy Semiconductors Process Improvement Engineering Management Consulting Strategy Start-ups IC Management Semiconductor Industry Product Development Business Strategy Semiconductors Process Improvement Engineering Management Consulting Strategy Start-ups IC Education ucg be,  engineering 1979  – 1983 university college Galway be,  engineering 1979  – 1983 ucg be,  engineering 1979  – 1983 ucg be,  engineering 1979  – 1983 ucg be,  engineering 1979  – 1983 university college Galway be,  engineering 1979  – 1983 university college Galway be,  engineering 1979  – 1983 university college Galway be,  engineering 1979  – 1983 ", "Summary Entrepreneur, semiconductor engineering manager, program manager, engineer, programmer. Diverse experiences with track record in continual quality improvements, increased cost margins, reduced cycle times, raised overall equipment efficiency, prompt product delivery.  \n \nInnovative and results-oriented senior technical leader honed from managing product engineering, yield engineering, test engineering departments, I can help you deliver on the results you need in these areas. \n \nWith vital technical experience in the field of product development, testability and DFT definition, pre- and post-silicon validation, new product introduction and high-volume manufacturing product sustaining, I am very capable of motivating engineers to deliver breakthroughs, pushing continual learning, fostering teamwork and promoting satisfaction from delivering innovation. \n \nHaving proficiently pushed technical career path as an alternate professional growth for engineers, I am an advocate that a well-rounded succession plan of any company must include program particular for technically-gifted individuals. And that a robust program that fosters continual career growth for these employees can only promote more innovations and breakthroughs. \n \nSpecialties \n> Semiconductor High Volume Manufacturing Test Operations. \n> Test, Product, and Yield Engineering. \n> Manufacturing cost margin improvements, overall equipment efficiency, yield improvement.  \n> New product introduction, project management. \n> Disciple of Technical Career Ladder. Summary Entrepreneur, semiconductor engineering manager, program manager, engineer, programmer. Diverse experiences with track record in continual quality improvements, increased cost margins, reduced cycle times, raised overall equipment efficiency, prompt product delivery.  \n \nInnovative and results-oriented senior technical leader honed from managing product engineering, yield engineering, test engineering departments, I can help you deliver on the results you need in these areas. \n \nWith vital technical experience in the field of product development, testability and DFT definition, pre- and post-silicon validation, new product introduction and high-volume manufacturing product sustaining, I am very capable of motivating engineers to deliver breakthroughs, pushing continual learning, fostering teamwork and promoting satisfaction from delivering innovation. \n \nHaving proficiently pushed technical career path as an alternate professional growth for engineers, I am an advocate that a well-rounded succession plan of any company must include program particular for technically-gifted individuals. And that a robust program that fosters continual career growth for these employees can only promote more innovations and breakthroughs. \n \nSpecialties \n> Semiconductor High Volume Manufacturing Test Operations. \n> Test, Product, and Yield Engineering. \n> Manufacturing cost margin improvements, overall equipment efficiency, yield improvement.  \n> New product introduction, project management. \n> Disciple of Technical Career Ladder. Entrepreneur, semiconductor engineering manager, program manager, engineer, programmer. Diverse experiences with track record in continual quality improvements, increased cost margins, reduced cycle times, raised overall equipment efficiency, prompt product delivery.  \n \nInnovative and results-oriented senior technical leader honed from managing product engineering, yield engineering, test engineering departments, I can help you deliver on the results you need in these areas. \n \nWith vital technical experience in the field of product development, testability and DFT definition, pre- and post-silicon validation, new product introduction and high-volume manufacturing product sustaining, I am very capable of motivating engineers to deliver breakthroughs, pushing continual learning, fostering teamwork and promoting satisfaction from delivering innovation. \n \nHaving proficiently pushed technical career path as an alternate professional growth for engineers, I am an advocate that a well-rounded succession plan of any company must include program particular for technically-gifted individuals. And that a robust program that fosters continual career growth for these employees can only promote more innovations and breakthroughs. \n \nSpecialties \n> Semiconductor High Volume Manufacturing Test Operations. \n> Test, Product, and Yield Engineering. \n> Manufacturing cost margin improvements, overall equipment efficiency, yield improvement.  \n> New product introduction, project management. \n> Disciple of Technical Career Ladder. Entrepreneur, semiconductor engineering manager, program manager, engineer, programmer. Diverse experiences with track record in continual quality improvements, increased cost margins, reduced cycle times, raised overall equipment efficiency, prompt product delivery.  \n \nInnovative and results-oriented senior technical leader honed from managing product engineering, yield engineering, test engineering departments, I can help you deliver on the results you need in these areas. \n \nWith vital technical experience in the field of product development, testability and DFT definition, pre- and post-silicon validation, new product introduction and high-volume manufacturing product sustaining, I am very capable of motivating engineers to deliver breakthroughs, pushing continual learning, fostering teamwork and promoting satisfaction from delivering innovation. \n \nHaving proficiently pushed technical career path as an alternate professional growth for engineers, I am an advocate that a well-rounded succession plan of any company must include program particular for technically-gifted individuals. And that a robust program that fosters continual career growth for these employees can only promote more innovations and breakthroughs. \n \nSpecialties \n> Semiconductor High Volume Manufacturing Test Operations. \n> Test, Product, and Yield Engineering. \n> Manufacturing cost margin improvements, overall equipment efficiency, yield improvement.  \n> New product introduction, project management. \n> Disciple of Technical Career Ladder. Experience President Automated Solutions Enablers, Inc. July 2009  –  September 2012  (3 years 3 months) Runs a mobile apps and games design and development company, with 3 game title releases in Nokia's Ovi store and 2 game titles in Apple's iTunes store. Also landed a contract with Nokia Philippines for the design and development of 2 smartphone game tournaments. Test Engineering Department Manager Intel Corporation April 2007  –  June 2009  (2 years 3 months) Philippines Responsible for the equipment health of a fleet of high-speed, high-pin count ATEs, systems-level testers, integrated burn-in systems, offline binning and fusing systems and all their related automated handling equipments in Intel's largest assembly-test factory at that time. Successfully led the turn around of overall equipment performance from being the worst among Intel factories to being the best-in-class across Intel's tester network. Pushed technical career ladder across the entire factory resulting to innovations, and the tripling of technical papers including harvesting of 3 disclosures approved for US patent filing. Successfully managed and motivated his organization to maintain high level of performance throughout the site's closure activities. Product Engineering Department Manager Intel Corporation April 2003  –  March 2007  (4 years) Philippines Responsible for product introductions and sustaining of all Southbridge chipsets, network processors, microprocessors and WiFi product lines. Expanded Cavite's product engineering funtion – from product transfer and deployment roles to co-owning product development, silicon debug and characterization, from doing fundamental sustaining job to owning heavier responsibilities in product health improvement, test hole resolutions and customer returns support. Established yield engineering and delivered data-mining solutions, hastened product yield issue identification and root-causing, early detection of outlier tools and discovery of process shifts. Product Development Engineering Group Leader Intel Corporation January 1999  –  March 2003  (4 years 3 months) Philippines Managed the Northbridge (integrated memory controller hub and graphics) chipset product line. Co-managed the product development and production deployment of Intel's first multi-core programmable network processor. Led the development of testability solutions to resolve ATE issues, that became best-known-methods adopted by succeeding product generations. Product Engineer Intel Corporation June 1995  –  December 1998  (3 years 7 months) Philippines Worked on several generations of Chipset and CPU products during this time. He was a Test Developer on Tereadyne J973 tester platform where he wrote a software that converted modeling and regression trace files into actual test patterns. President Automated Solutions Enablers, Inc. July 2009  –  September 2012  (3 years 3 months) Runs a mobile apps and games design and development company, with 3 game title releases in Nokia's Ovi store and 2 game titles in Apple's iTunes store. Also landed a contract with Nokia Philippines for the design and development of 2 smartphone game tournaments. President Automated Solutions Enablers, Inc. July 2009  –  September 2012  (3 years 3 months) Runs a mobile apps and games design and development company, with 3 game title releases in Nokia's Ovi store and 2 game titles in Apple's iTunes store. Also landed a contract with Nokia Philippines for the design and development of 2 smartphone game tournaments. Test Engineering Department Manager Intel Corporation April 2007  –  June 2009  (2 years 3 months) Philippines Responsible for the equipment health of a fleet of high-speed, high-pin count ATEs, systems-level testers, integrated burn-in systems, offline binning and fusing systems and all their related automated handling equipments in Intel's largest assembly-test factory at that time. Successfully led the turn around of overall equipment performance from being the worst among Intel factories to being the best-in-class across Intel's tester network. Pushed technical career ladder across the entire factory resulting to innovations, and the tripling of technical papers including harvesting of 3 disclosures approved for US patent filing. Successfully managed and motivated his organization to maintain high level of performance throughout the site's closure activities. Test Engineering Department Manager Intel Corporation April 2007  –  June 2009  (2 years 3 months) Philippines Responsible for the equipment health of a fleet of high-speed, high-pin count ATEs, systems-level testers, integrated burn-in systems, offline binning and fusing systems and all their related automated handling equipments in Intel's largest assembly-test factory at that time. Successfully led the turn around of overall equipment performance from being the worst among Intel factories to being the best-in-class across Intel's tester network. Pushed technical career ladder across the entire factory resulting to innovations, and the tripling of technical papers including harvesting of 3 disclosures approved for US patent filing. Successfully managed and motivated his organization to maintain high level of performance throughout the site's closure activities. Product Engineering Department Manager Intel Corporation April 2003  –  March 2007  (4 years) Philippines Responsible for product introductions and sustaining of all Southbridge chipsets, network processors, microprocessors and WiFi product lines. Expanded Cavite's product engineering funtion – from product transfer and deployment roles to co-owning product development, silicon debug and characterization, from doing fundamental sustaining job to owning heavier responsibilities in product health improvement, test hole resolutions and customer returns support. Established yield engineering and delivered data-mining solutions, hastened product yield issue identification and root-causing, early detection of outlier tools and discovery of process shifts. Product Engineering Department Manager Intel Corporation April 2003  –  March 2007  (4 years) Philippines Responsible for product introductions and sustaining of all Southbridge chipsets, network processors, microprocessors and WiFi product lines. Expanded Cavite's product engineering funtion – from product transfer and deployment roles to co-owning product development, silicon debug and characterization, from doing fundamental sustaining job to owning heavier responsibilities in product health improvement, test hole resolutions and customer returns support. Established yield engineering and delivered data-mining solutions, hastened product yield issue identification and root-causing, early detection of outlier tools and discovery of process shifts. Product Development Engineering Group Leader Intel Corporation January 1999  –  March 2003  (4 years 3 months) Philippines Managed the Northbridge (integrated memory controller hub and graphics) chipset product line. Co-managed the product development and production deployment of Intel's first multi-core programmable network processor. Led the development of testability solutions to resolve ATE issues, that became best-known-methods adopted by succeeding product generations. Product Development Engineering Group Leader Intel Corporation January 1999  –  March 2003  (4 years 3 months) Philippines Managed the Northbridge (integrated memory controller hub and graphics) chipset product line. Co-managed the product development and production deployment of Intel's first multi-core programmable network processor. Led the development of testability solutions to resolve ATE issues, that became best-known-methods adopted by succeeding product generations. Product Engineer Intel Corporation June 1995  –  December 1998  (3 years 7 months) Philippines Worked on several generations of Chipset and CPU products during this time. He was a Test Developer on Tereadyne J973 tester platform where he wrote a software that converted modeling and regression trace files into actual test patterns. Product Engineer Intel Corporation June 1995  –  December 1998  (3 years 7 months) Philippines Worked on several generations of Chipset and CPU products during this time. He was a Test Developer on Tereadyne J973 tester platform where he wrote a software that converted modeling and regression trace files into actual test patterns. Languages English Filipino Iloko English Filipino Iloko English Filipino Iloko Skills Semiconductor High... Test, Product, and... Testing System Deployment Program Management Semiconductors Project Management Start-ups Manufacturing Organizational Design Operational Excellence Cross-functional Team... Product Development test time Automation Engineering Process Improvement Test Engineering Troubleshooting FMEA Lean Manufacturing Supply Chain Management Design of Experiments Integration Process Engineering See 10+     See less Skills  Semiconductor High... Test, Product, and... Testing System Deployment Program Management Semiconductors Project Management Start-ups Manufacturing Organizational Design Operational Excellence Cross-functional Team... Product Development test time Automation Engineering Process Improvement Test Engineering Troubleshooting FMEA Lean Manufacturing Supply Chain Management Design of Experiments Integration Process Engineering See 10+     See less Semiconductor High... Test, Product, and... Testing System Deployment Program Management Semiconductors Project Management Start-ups Manufacturing Organizational Design Operational Excellence Cross-functional Team... Product Development test time Automation Engineering Process Improvement Test Engineering Troubleshooting FMEA Lean Manufacturing Supply Chain Management Design of Experiments Integration Process Engineering See 10+     See less Semiconductor High... Test, Product, and... Testing System Deployment Program Management Semiconductors Project Management Start-ups Manufacturing Organizational Design Operational Excellence Cross-functional Team... Product Development test time Automation Engineering Process Improvement Test Engineering Troubleshooting FMEA Lean Manufacturing Supply Chain Management Design of Experiments Integration Process Engineering See 10+     See less Education University of Virginia - Darden Graduate School of Business Administration Leadership for Extraordinary Results 2008  – 2008 Asian Institute of Management Leadership Development Program 2004  – 2005 Saint Louis University (PH) Bachelor of Science (B.S.),  Electronics and Communications Engineering 1990  – 1995 University of Virginia - Darden Graduate School of Business Administration Leadership for Extraordinary Results 2008  – 2008 University of Virginia - Darden Graduate School of Business Administration Leadership for Extraordinary Results 2008  – 2008 University of Virginia - Darden Graduate School of Business Administration Leadership for Extraordinary Results 2008  – 2008 Asian Institute of Management Leadership Development Program 2004  – 2005 Asian Institute of Management Leadership Development Program 2004  – 2005 Asian Institute of Management Leadership Development Program 2004  – 2005 Saint Louis University (PH) Bachelor of Science (B.S.),  Electronics and Communications Engineering 1990  – 1995 Saint Louis University (PH) Bachelor of Science (B.S.),  Electronics and Communications Engineering 1990  – 1995 Saint Louis University (PH) Bachelor of Science (B.S.),  Electronics and Communications Engineering 1990  – 1995 ", "Experience Fab 11X Manufacturing Manager Intel March 2014  – Present (1 year 6 months) Rio Rancho, NM Engineering Department Manager Intel Corporation January 2011  –  March 2014  (3 years 3 months) Rio Rancho, NM Engineering Area Manager - scope included process engineering, equipment engineering, shift supervisors, and equipment technicians. Lithography Process and Operations Manager Intel Corporation January 2009  –  January 2011  (2 years 1 month) Managed the Lithography shift maintenance and operations group (supervisors and technicians) as well as the Process Engineering group. Equipment Manager Intel Corporation January 2006  –  January 2009  (3 years 1 month) Responsible for the implementation and management of HPM and LEAN including standardization of Preventative Maintenance, the maintenance and repair planning and management systems, and standardizing corrective maintenance methods. Manufacturing Shift Manager Intel Corporation January 2005  –  January 2006  (1 year 1 month) Managed night shift manufacturing team (supervisors and technicians). Fab 11X Manufacturing Manager Intel March 2014  – Present (1 year 6 months) Rio Rancho, NM Fab 11X Manufacturing Manager Intel March 2014  – Present (1 year 6 months) Rio Rancho, NM Engineering Department Manager Intel Corporation January 2011  –  March 2014  (3 years 3 months) Rio Rancho, NM Engineering Area Manager - scope included process engineering, equipment engineering, shift supervisors, and equipment technicians. Engineering Department Manager Intel Corporation January 2011  –  March 2014  (3 years 3 months) Rio Rancho, NM Engineering Area Manager - scope included process engineering, equipment engineering, shift supervisors, and equipment technicians. Lithography Process and Operations Manager Intel Corporation January 2009  –  January 2011  (2 years 1 month) Managed the Lithography shift maintenance and operations group (supervisors and technicians) as well as the Process Engineering group. Lithography Process and Operations Manager Intel Corporation January 2009  –  January 2011  (2 years 1 month) Managed the Lithography shift maintenance and operations group (supervisors and technicians) as well as the Process Engineering group. Equipment Manager Intel Corporation January 2006  –  January 2009  (3 years 1 month) Responsible for the implementation and management of HPM and LEAN including standardization of Preventative Maintenance, the maintenance and repair planning and management systems, and standardizing corrective maintenance methods. Equipment Manager Intel Corporation January 2006  –  January 2009  (3 years 1 month) Responsible for the implementation and management of HPM and LEAN including standardization of Preventative Maintenance, the maintenance and repair planning and management systems, and standardizing corrective maintenance methods. Manufacturing Shift Manager Intel Corporation January 2005  –  January 2006  (1 year 1 month) Managed night shift manufacturing team (supervisors and technicians). Manufacturing Shift Manager Intel Corporation January 2005  –  January 2006  (1 year 1 month) Managed night shift manufacturing team (supervisors and technicians). Skills Semiconductors IC Semiconductor Industry Failure Analysis Cross-functional Team... Operations Management Leadership Development Skills  Semiconductors IC Semiconductor Industry Failure Analysis Cross-functional Team... Operations Management Leadership Development Semiconductors IC Semiconductor Industry Failure Analysis Cross-functional Team... Operations Management Leadership Development Semiconductors IC Semiconductor Industry Failure Analysis Cross-functional Team... Operations Management Leadership Development Education The University of New Mexico - Robert O. Anderson School of Management Masters Business Administration and Management , General 1996  – 2000 Arizona State University Bachelor of Science (B.S.),  Biomedical/Medical Engineering 1991  – 1996 The University of New Mexico - Robert O. Anderson School of Management Masters Business Administration and Management , General 1996  – 2000 The University of New Mexico - Robert O. Anderson School of Management Masters Business Administration and Management , General 1996  – 2000 The University of New Mexico - Robert O. Anderson School of Management Masters Business Administration and Management , General 1996  – 2000 Arizona State University Bachelor of Science (B.S.),  Biomedical/Medical Engineering 1991  – 1996 Arizona State University Bachelor of Science (B.S.),  Biomedical/Medical Engineering 1991  – 1996 Arizona State University Bachelor of Science (B.S.),  Biomedical/Medical Engineering 1991  – 1996 ", "Summary 24 years of diversified management and individual contributor experience in electronics semiconductor and FMCG environment encompassing the full product life cycle phases. Have strong background and accomplishments on plant operations, process and equipment engineering, research and technology development, quality management, projects and program management. Highly results oriented, with excellent communication, analytical, and problem solving skills. Well organized with excellent team building, people development and organizational management in a multicultural environment.  \n \nMy career objective is to become part of senior leadership team of a highly successful, dynamic company that would further enhance my skills and competencies while adding a signficant value to the organization. Summary 24 years of diversified management and individual contributor experience in electronics semiconductor and FMCG environment encompassing the full product life cycle phases. Have strong background and accomplishments on plant operations, process and equipment engineering, research and technology development, quality management, projects and program management. Highly results oriented, with excellent communication, analytical, and problem solving skills. Well organized with excellent team building, people development and organizational management in a multicultural environment.  \n \nMy career objective is to become part of senior leadership team of a highly successful, dynamic company that would further enhance my skills and competencies while adding a signficant value to the organization. 24 years of diversified management and individual contributor experience in electronics semiconductor and FMCG environment encompassing the full product life cycle phases. Have strong background and accomplishments on plant operations, process and equipment engineering, research and technology development, quality management, projects and program management. Highly results oriented, with excellent communication, analytical, and problem solving skills. Well organized with excellent team building, people development and organizational management in a multicultural environment.  \n \nMy career objective is to become part of senior leadership team of a highly successful, dynamic company that would further enhance my skills and competencies while adding a signficant value to the organization. 24 years of diversified management and individual contributor experience in electronics semiconductor and FMCG environment encompassing the full product life cycle phases. Have strong background and accomplishments on plant operations, process and equipment engineering, research and technology development, quality management, projects and program management. Highly results oriented, with excellent communication, analytical, and problem solving skills. Well organized with excellent team building, people development and organizational management in a multicultural environment.  \n \nMy career objective is to become part of senior leadership team of a highly successful, dynamic company that would further enhance my skills and competencies while adding a signficant value to the organization. Experience Manufacturing Unit Associate Director Coca-Cola FEMSA Philippines Inc. November 2012  – Present (2 years 10 months) philippines Responsibilities: \n \nOver-all Manufacturing Operations Head of 10 bottling plants for Visayas and Mindanao Region. This includes PET, BIB and RGB production lines. \n \nDrive individual and regional plant performance to achieve best in class targets on Safety, Quality, Line Efficiency, Environmental, Productivity and Cost Critical Success Indicators \n \nDevelop key talents in the organization on technical and soft skills to effectively perform their tasks and achieve the business results through a highly motivated workforce. \n \nEnsure plant compliance to all regulatory requirements, customer and international certification audits Failure Analysis Manager Memjet Australia September 2010  –  November 2012  (2 years 3 months) Sydney Area, Australia Performance improvement of the team's the failure analysis cycle time and on time performance with positive feedbacks from internal and external customers. \n \nImplementation of key failure analysis capability improvement projects in alignment to the company’s product roadmap. \n \nThe team was recognized as a significant contributor in determining the problem rootcause and fixes for some critical show stopper issues that led to the problem resolution and product certification. Site Quality and Reliability Director PSI Technologies Inc. August 2008  –  September 2010  (2 years 2 months) Philippines Led the Q&R organizations for 2 manufacturing sites of PSI. \n \nAchieved 40% year to year reduction on external customer complaints occurrences with Zero reliability issues. \n \nImplemented zero defect program for the site focusing on process stability and capability, test and system robustness, manufacturing quality awareness and cost of quality programs. \n \nFull site re-certification on ISO9002, TS16949, Recipient of Most improved supplier award from key customers, SGS Merit awardee on Multiple certification and end customer audit certifications. \n \nImplemented the Advanced Product Quality Planning Methodology for a successful package technology development and ramp. Co-developed the technology development methodology for non automotive products of PSI. \n \nFactory Start-up Program Manager for Microsemi products for medical devices. Mold Operations Director PSI Technologies 2007  –  2008  (1 year) Philippines Implemented leadership and management practices to the organization that resulted to its performance improvement, efficient and effective workforce and high morale. \n \nResulted to an approximately 10% increase of asset utilization, above 90% performance against schedule performance of delivery target on a week to week basis, reduced over-time work with higher volume (30% to 5%) Product Platform Quality Program Manager Intel Corporation 2006  –  2007  (1 year) Philippines Quality Management Review Council chair for the Flash Memory Product Platform.  \n \nAchieved 50% year to year excursion reduction across the supply line network with zero major customer issues and escapees. \n \nZero test program related quality issues across the platform. \n \nZero manufacturing SOP related quality issues \n \nAchieved process capability index performance of 1.67 across all manufacturing process on selected critical input and output parameters. Process and Equipment Engineering Department Manager Intel Corporation 2005  –  2006  (1 year) Shanghai, China Was assigned in Intel Pudong site as expat assembly and test engineering manager, handling a group of 40 people that includes section managers, engineers, and technicians \n \nSuccessfully implemented the problem solving and data analysis competency development program for engineers. The program improved the throughput time of problem root cause isolation, increased problem solving competencies and implementation of permanent systemic fixes to issues.  \n \nAchieved the highest yield, quality, equipment utilization and cost for the site with no safety lost day case incident. Process and Equipment Engineering Department Manager Intel Corporation 2003  –  2005  (2 years) Philippines Department head of an engineering organization of more than 300 people that covers factory sustaining, continuous improvement, new product introduction and ramp \n \nSuccessfully closed the yield gap between subcon sites and internal sites within 2 months upon assumption to the role.  \n \nTurned around the factory quality performance to an excursion free performance in just 6 months \n \nSponsored and led some of the factories strategic programs and projects such as 5S implementation, visual factory, space productivity improvement and wireless connectivity. \n \nReached a 99.5% equipment uptime for the constraint module in the factory. \n \nReceiving manager of the highly complex package technology called Folded Stack Chip Scale Package. Successfully implemented yield and quality improvement programs to close the package cost target gaps upon endorsement from the technology development group. Product Transfer Manager for Wireless and Communications Products Intel Corporation 2002  –  2003  (1 year) Philippines Had successfully established the Assembly Operations Section in Asia with the role of transferring key communications and wireless products and packaging technologies to High Volume manufacturing sites exceeding the product manufacturing cost targets and indicators. \n \nLead the Simultaneous Technology Certification for 2 package configurations in 1 year (Flip Chip Ball Grid Array package extension and 1.2mm Stacked Chip Scale Package). Strategic Program Manager for Assembly Operations Intel Corporation 2000  –  2001  (1 year) Phoenix, Arizona Area 300mm wafer technology program manager for all Intel Assembly sites. Recognized then as the best ever wafer size conversion activity in the company.  \n \nFlawless execution of the start-up in the factories and was able to pull-in the implementation schedule by 3 months ahead of the target date. \n \nImplemented a TPM program that coincides with a new product introduction. Technical Support Group Manager Intel Corporation 1998  –  October 2000  (2 years) Philippines Process and Equipment Sustaining engineering manager owning the factory indicators of machine utilization and process yield. The organization consists of 8 supervisors, 4 engineers and 130 maintenance technicians. \nExceeded the Machine Utilization Indicators expectations on the identified constraint tools in the factory.  \n \nDemonstrated lowest spending for the spare parts and indirect materials purchases across the different sites through an aggressive spares management program.  \n \nZero Lost Day Case, and Safety Recordable Incidents for the factory through the leadership in Incident and Injury Free program. Exceeded the target and stretched goals targets in process yield. \n \nTechnical Support Group Joint Operations Team leader- led the group of TSG managers from different Intel assembly sites. Established the team structure and operational systems for technical support group across the Intel Assembly and Test sites. Process and Equipment Engineering Section Manager Intel Corporation September 1997  –  December 1998  (1 year 4 months) Costa Rica Worked as an expatriate manager for the Intel Costa Rica Microprocessor start-up team for for Die-Prep, Backend and Material Handling Operations \n \nSuccessfully trained and developed local engineers and managers for process engineering operations and management. \n \nDemonstrated the capability to exceed expectations on equipment install and qualification cycle time, achieving yield and manufacturability ramp requirement within 2 weeks upon start-up. Process and Equipment Engineering Section Manager Intel Corporation June 1997  –  September 1998  (1 year 4 months) Philippines Successfully completed the Backend Operations Pentium II site start-up and ramp exceeding the start-up indicator targets in terms of install / qual cycle time, yield, quality and productivity with no safety incidents. Achieved consistent 99.9% process yield performance. \n \nLed the module qualification of 2 critical processes and equipment. Was able to complete the requirements within 2 weeks that prevented a major delay of 2 additional factory start-ups. Technology Development Engineering Area Manager Intel Corporation October 1996  –  June 1997  (9 months) Phoenix, Arizona Area Area Manager for the backend process modules development and certification. Backend process was developed within 6 months period in time for the Pentium II product launching  \nSuccessfully transferred the Backend Process Operations in the high volume manufacturing site exceeding the target indicators.  \n \nWorked as an Assembly Capability Equipment Development engineer for the new lasermark machine equipment development and certification. Process and Equipment Engineer Intel Corporation November 1994  –  October 1996  (2 years) Philippines Module owner for product marking process for the Intel Pentium Product for the Philippine site. \n \nEnsure that the product marking process is always stable and capable to support the production operations at all times. \n \nSuccessfully transferred new process and equipment capabilities from development site to the high volume manufacturing. \n \nSME of ink and lasermark process and equipment Process and Equipment Development Engineer Amkor Technology July 1991  –  November 1994  (3 years 5 months) Philippines Qualification of new equipment capabilities, jigs and fixtures design, process development for new product qualification. Manufacturing Unit Associate Director Coca-Cola FEMSA Philippines Inc. November 2012  – Present (2 years 10 months) philippines Responsibilities: \n \nOver-all Manufacturing Operations Head of 10 bottling plants for Visayas and Mindanao Region. This includes PET, BIB and RGB production lines. \n \nDrive individual and regional plant performance to achieve best in class targets on Safety, Quality, Line Efficiency, Environmental, Productivity and Cost Critical Success Indicators \n \nDevelop key talents in the organization on technical and soft skills to effectively perform their tasks and achieve the business results through a highly motivated workforce. \n \nEnsure plant compliance to all regulatory requirements, customer and international certification audits Manufacturing Unit Associate Director Coca-Cola FEMSA Philippines Inc. November 2012  – Present (2 years 10 months) philippines Responsibilities: \n \nOver-all Manufacturing Operations Head of 10 bottling plants for Visayas and Mindanao Region. This includes PET, BIB and RGB production lines. \n \nDrive individual and regional plant performance to achieve best in class targets on Safety, Quality, Line Efficiency, Environmental, Productivity and Cost Critical Success Indicators \n \nDevelop key talents in the organization on technical and soft skills to effectively perform their tasks and achieve the business results through a highly motivated workforce. \n \nEnsure plant compliance to all regulatory requirements, customer and international certification audits Failure Analysis Manager Memjet Australia September 2010  –  November 2012  (2 years 3 months) Sydney Area, Australia Performance improvement of the team's the failure analysis cycle time and on time performance with positive feedbacks from internal and external customers. \n \nImplementation of key failure analysis capability improvement projects in alignment to the company’s product roadmap. \n \nThe team was recognized as a significant contributor in determining the problem rootcause and fixes for some critical show stopper issues that led to the problem resolution and product certification. Failure Analysis Manager Memjet Australia September 2010  –  November 2012  (2 years 3 months) Sydney Area, Australia Performance improvement of the team's the failure analysis cycle time and on time performance with positive feedbacks from internal and external customers. \n \nImplementation of key failure analysis capability improvement projects in alignment to the company’s product roadmap. \n \nThe team was recognized as a significant contributor in determining the problem rootcause and fixes for some critical show stopper issues that led to the problem resolution and product certification. Site Quality and Reliability Director PSI Technologies Inc. August 2008  –  September 2010  (2 years 2 months) Philippines Led the Q&R organizations for 2 manufacturing sites of PSI. \n \nAchieved 40% year to year reduction on external customer complaints occurrences with Zero reliability issues. \n \nImplemented zero defect program for the site focusing on process stability and capability, test and system robustness, manufacturing quality awareness and cost of quality programs. \n \nFull site re-certification on ISO9002, TS16949, Recipient of Most improved supplier award from key customers, SGS Merit awardee on Multiple certification and end customer audit certifications. \n \nImplemented the Advanced Product Quality Planning Methodology for a successful package technology development and ramp. Co-developed the technology development methodology for non automotive products of PSI. \n \nFactory Start-up Program Manager for Microsemi products for medical devices. Site Quality and Reliability Director PSI Technologies Inc. August 2008  –  September 2010  (2 years 2 months) Philippines Led the Q&R organizations for 2 manufacturing sites of PSI. \n \nAchieved 40% year to year reduction on external customer complaints occurrences with Zero reliability issues. \n \nImplemented zero defect program for the site focusing on process stability and capability, test and system robustness, manufacturing quality awareness and cost of quality programs. \n \nFull site re-certification on ISO9002, TS16949, Recipient of Most improved supplier award from key customers, SGS Merit awardee on Multiple certification and end customer audit certifications. \n \nImplemented the Advanced Product Quality Planning Methodology for a successful package technology development and ramp. Co-developed the technology development methodology for non automotive products of PSI. \n \nFactory Start-up Program Manager for Microsemi products for medical devices. Mold Operations Director PSI Technologies 2007  –  2008  (1 year) Philippines Implemented leadership and management practices to the organization that resulted to its performance improvement, efficient and effective workforce and high morale. \n \nResulted to an approximately 10% increase of asset utilization, above 90% performance against schedule performance of delivery target on a week to week basis, reduced over-time work with higher volume (30% to 5%) Mold Operations Director PSI Technologies 2007  –  2008  (1 year) Philippines Implemented leadership and management practices to the organization that resulted to its performance improvement, efficient and effective workforce and high morale. \n \nResulted to an approximately 10% increase of asset utilization, above 90% performance against schedule performance of delivery target on a week to week basis, reduced over-time work with higher volume (30% to 5%) Product Platform Quality Program Manager Intel Corporation 2006  –  2007  (1 year) Philippines Quality Management Review Council chair for the Flash Memory Product Platform.  \n \nAchieved 50% year to year excursion reduction across the supply line network with zero major customer issues and escapees. \n \nZero test program related quality issues across the platform. \n \nZero manufacturing SOP related quality issues \n \nAchieved process capability index performance of 1.67 across all manufacturing process on selected critical input and output parameters. Product Platform Quality Program Manager Intel Corporation 2006  –  2007  (1 year) Philippines Quality Management Review Council chair for the Flash Memory Product Platform.  \n \nAchieved 50% year to year excursion reduction across the supply line network with zero major customer issues and escapees. \n \nZero test program related quality issues across the platform. \n \nZero manufacturing SOP related quality issues \n \nAchieved process capability index performance of 1.67 across all manufacturing process on selected critical input and output parameters. Process and Equipment Engineering Department Manager Intel Corporation 2005  –  2006  (1 year) Shanghai, China Was assigned in Intel Pudong site as expat assembly and test engineering manager, handling a group of 40 people that includes section managers, engineers, and technicians \n \nSuccessfully implemented the problem solving and data analysis competency development program for engineers. The program improved the throughput time of problem root cause isolation, increased problem solving competencies and implementation of permanent systemic fixes to issues.  \n \nAchieved the highest yield, quality, equipment utilization and cost for the site with no safety lost day case incident. Process and Equipment Engineering Department Manager Intel Corporation 2005  –  2006  (1 year) Shanghai, China Was assigned in Intel Pudong site as expat assembly and test engineering manager, handling a group of 40 people that includes section managers, engineers, and technicians \n \nSuccessfully implemented the problem solving and data analysis competency development program for engineers. The program improved the throughput time of problem root cause isolation, increased problem solving competencies and implementation of permanent systemic fixes to issues.  \n \nAchieved the highest yield, quality, equipment utilization and cost for the site with no safety lost day case incident. Process and Equipment Engineering Department Manager Intel Corporation 2003  –  2005  (2 years) Philippines Department head of an engineering organization of more than 300 people that covers factory sustaining, continuous improvement, new product introduction and ramp \n \nSuccessfully closed the yield gap between subcon sites and internal sites within 2 months upon assumption to the role.  \n \nTurned around the factory quality performance to an excursion free performance in just 6 months \n \nSponsored and led some of the factories strategic programs and projects such as 5S implementation, visual factory, space productivity improvement and wireless connectivity. \n \nReached a 99.5% equipment uptime for the constraint module in the factory. \n \nReceiving manager of the highly complex package technology called Folded Stack Chip Scale Package. Successfully implemented yield and quality improvement programs to close the package cost target gaps upon endorsement from the technology development group. Process and Equipment Engineering Department Manager Intel Corporation 2003  –  2005  (2 years) Philippines Department head of an engineering organization of more than 300 people that covers factory sustaining, continuous improvement, new product introduction and ramp \n \nSuccessfully closed the yield gap between subcon sites and internal sites within 2 months upon assumption to the role.  \n \nTurned around the factory quality performance to an excursion free performance in just 6 months \n \nSponsored and led some of the factories strategic programs and projects such as 5S implementation, visual factory, space productivity improvement and wireless connectivity. \n \nReached a 99.5% equipment uptime for the constraint module in the factory. \n \nReceiving manager of the highly complex package technology called Folded Stack Chip Scale Package. Successfully implemented yield and quality improvement programs to close the package cost target gaps upon endorsement from the technology development group. Product Transfer Manager for Wireless and Communications Products Intel Corporation 2002  –  2003  (1 year) Philippines Had successfully established the Assembly Operations Section in Asia with the role of transferring key communications and wireless products and packaging technologies to High Volume manufacturing sites exceeding the product manufacturing cost targets and indicators. \n \nLead the Simultaneous Technology Certification for 2 package configurations in 1 year (Flip Chip Ball Grid Array package extension and 1.2mm Stacked Chip Scale Package). Product Transfer Manager for Wireless and Communications Products Intel Corporation 2002  –  2003  (1 year) Philippines Had successfully established the Assembly Operations Section in Asia with the role of transferring key communications and wireless products and packaging technologies to High Volume manufacturing sites exceeding the product manufacturing cost targets and indicators. \n \nLead the Simultaneous Technology Certification for 2 package configurations in 1 year (Flip Chip Ball Grid Array package extension and 1.2mm Stacked Chip Scale Package). Strategic Program Manager for Assembly Operations Intel Corporation 2000  –  2001  (1 year) Phoenix, Arizona Area 300mm wafer technology program manager for all Intel Assembly sites. Recognized then as the best ever wafer size conversion activity in the company.  \n \nFlawless execution of the start-up in the factories and was able to pull-in the implementation schedule by 3 months ahead of the target date. \n \nImplemented a TPM program that coincides with a new product introduction. Strategic Program Manager for Assembly Operations Intel Corporation 2000  –  2001  (1 year) Phoenix, Arizona Area 300mm wafer technology program manager for all Intel Assembly sites. Recognized then as the best ever wafer size conversion activity in the company.  \n \nFlawless execution of the start-up in the factories and was able to pull-in the implementation schedule by 3 months ahead of the target date. \n \nImplemented a TPM program that coincides with a new product introduction. Technical Support Group Manager Intel Corporation 1998  –  October 2000  (2 years) Philippines Process and Equipment Sustaining engineering manager owning the factory indicators of machine utilization and process yield. The organization consists of 8 supervisors, 4 engineers and 130 maintenance technicians. \nExceeded the Machine Utilization Indicators expectations on the identified constraint tools in the factory.  \n \nDemonstrated lowest spending for the spare parts and indirect materials purchases across the different sites through an aggressive spares management program.  \n \nZero Lost Day Case, and Safety Recordable Incidents for the factory through the leadership in Incident and Injury Free program. Exceeded the target and stretched goals targets in process yield. \n \nTechnical Support Group Joint Operations Team leader- led the group of TSG managers from different Intel assembly sites. Established the team structure and operational systems for technical support group across the Intel Assembly and Test sites. Technical Support Group Manager Intel Corporation 1998  –  October 2000  (2 years) Philippines Process and Equipment Sustaining engineering manager owning the factory indicators of machine utilization and process yield. The organization consists of 8 supervisors, 4 engineers and 130 maintenance technicians. \nExceeded the Machine Utilization Indicators expectations on the identified constraint tools in the factory.  \n \nDemonstrated lowest spending for the spare parts and indirect materials purchases across the different sites through an aggressive spares management program.  \n \nZero Lost Day Case, and Safety Recordable Incidents for the factory through the leadership in Incident and Injury Free program. Exceeded the target and stretched goals targets in process yield. \n \nTechnical Support Group Joint Operations Team leader- led the group of TSG managers from different Intel assembly sites. Established the team structure and operational systems for technical support group across the Intel Assembly and Test sites. Process and Equipment Engineering Section Manager Intel Corporation September 1997  –  December 1998  (1 year 4 months) Costa Rica Worked as an expatriate manager for the Intel Costa Rica Microprocessor start-up team for for Die-Prep, Backend and Material Handling Operations \n \nSuccessfully trained and developed local engineers and managers for process engineering operations and management. \n \nDemonstrated the capability to exceed expectations on equipment install and qualification cycle time, achieving yield and manufacturability ramp requirement within 2 weeks upon start-up. Process and Equipment Engineering Section Manager Intel Corporation September 1997  –  December 1998  (1 year 4 months) Costa Rica Worked as an expatriate manager for the Intel Costa Rica Microprocessor start-up team for for Die-Prep, Backend and Material Handling Operations \n \nSuccessfully trained and developed local engineers and managers for process engineering operations and management. \n \nDemonstrated the capability to exceed expectations on equipment install and qualification cycle time, achieving yield and manufacturability ramp requirement within 2 weeks upon start-up. Process and Equipment Engineering Section Manager Intel Corporation June 1997  –  September 1998  (1 year 4 months) Philippines Successfully completed the Backend Operations Pentium II site start-up and ramp exceeding the start-up indicator targets in terms of install / qual cycle time, yield, quality and productivity with no safety incidents. Achieved consistent 99.9% process yield performance. \n \nLed the module qualification of 2 critical processes and equipment. Was able to complete the requirements within 2 weeks that prevented a major delay of 2 additional factory start-ups. Process and Equipment Engineering Section Manager Intel Corporation June 1997  –  September 1998  (1 year 4 months) Philippines Successfully completed the Backend Operations Pentium II site start-up and ramp exceeding the start-up indicator targets in terms of install / qual cycle time, yield, quality and productivity with no safety incidents. Achieved consistent 99.9% process yield performance. \n \nLed the module qualification of 2 critical processes and equipment. Was able to complete the requirements within 2 weeks that prevented a major delay of 2 additional factory start-ups. Technology Development Engineering Area Manager Intel Corporation October 1996  –  June 1997  (9 months) Phoenix, Arizona Area Area Manager for the backend process modules development and certification. Backend process was developed within 6 months period in time for the Pentium II product launching  \nSuccessfully transferred the Backend Process Operations in the high volume manufacturing site exceeding the target indicators.  \n \nWorked as an Assembly Capability Equipment Development engineer for the new lasermark machine equipment development and certification. Technology Development Engineering Area Manager Intel Corporation October 1996  –  June 1997  (9 months) Phoenix, Arizona Area Area Manager for the backend process modules development and certification. Backend process was developed within 6 months period in time for the Pentium II product launching  \nSuccessfully transferred the Backend Process Operations in the high volume manufacturing site exceeding the target indicators.  \n \nWorked as an Assembly Capability Equipment Development engineer for the new lasermark machine equipment development and certification. Process and Equipment Engineer Intel Corporation November 1994  –  October 1996  (2 years) Philippines Module owner for product marking process for the Intel Pentium Product for the Philippine site. \n \nEnsure that the product marking process is always stable and capable to support the production operations at all times. \n \nSuccessfully transferred new process and equipment capabilities from development site to the high volume manufacturing. \n \nSME of ink and lasermark process and equipment Process and Equipment Engineer Intel Corporation November 1994  –  October 1996  (2 years) Philippines Module owner for product marking process for the Intel Pentium Product for the Philippine site. \n \nEnsure that the product marking process is always stable and capable to support the production operations at all times. \n \nSuccessfully transferred new process and equipment capabilities from development site to the high volume manufacturing. \n \nSME of ink and lasermark process and equipment Process and Equipment Development Engineer Amkor Technology July 1991  –  November 1994  (3 years 5 months) Philippines Qualification of new equipment capabilities, jigs and fixtures design, process development for new product qualification. Process and Equipment Development Engineer Amkor Technology July 1991  –  November 1994  (3 years 5 months) Philippines Qualification of new equipment capabilities, jigs and fixtures design, process development for new product qualification. Languages English Full professional proficiency Tagalog Native or bilingual proficiency Spanish Elementary proficiency English Full professional proficiency Tagalog Native or bilingual proficiency Spanish Elementary proficiency English Full professional proficiency Tagalog Native or bilingual proficiency Spanish Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Manufacturing Engineering Quality Management Failure Analysis FMEA Lean Manufacturing Continuous Improvement Product Development Program Management Change Management Coaching Process Engineering SPC Six Sigma Quality Assurance Excel Process Improvement Quality Systems Microsoft Office Word Problem Solving PowerPoint Strategic Planning Semiconductors Documentation Process Development Analysis R&D Reliability Microsoft Word Process Simulation Microsoft Excel Electronics 5S Cross-functional Team... Design of Experiments Management Quality System Root Cause Analysis Software Documentation Supply Chain Supply Chain Management Testing Design for Manufacturing Start-ups Strategy Manufacturing Operations Automation Quality Control Manufacturing... See 35+     See less Skills  Manufacturing Engineering Quality Management Failure Analysis FMEA Lean Manufacturing Continuous Improvement Product Development Program Management Change Management Coaching Process Engineering SPC Six Sigma Quality Assurance Excel Process Improvement Quality Systems Microsoft Office Word Problem Solving PowerPoint Strategic Planning Semiconductors Documentation Process Development Analysis R&D Reliability Microsoft Word Process Simulation Microsoft Excel Electronics 5S Cross-functional Team... Design of Experiments Management Quality System Root Cause Analysis Software Documentation Supply Chain Supply Chain Management Testing Design for Manufacturing Start-ups Strategy Manufacturing Operations Automation Quality Control Manufacturing... See 35+     See less Manufacturing Engineering Quality Management Failure Analysis FMEA Lean Manufacturing Continuous Improvement Product Development Program Management Change Management Coaching Process Engineering SPC Six Sigma Quality Assurance Excel Process Improvement Quality Systems Microsoft Office Word Problem Solving PowerPoint Strategic Planning Semiconductors Documentation Process Development Analysis R&D Reliability Microsoft Word Process Simulation Microsoft Excel Electronics 5S Cross-functional Team... Design of Experiments Management Quality System Root Cause Analysis Software Documentation Supply Chain Supply Chain Management Testing Design for Manufacturing Start-ups Strategy Manufacturing Operations Automation Quality Control Manufacturing... See 35+     See less Manufacturing Engineering Quality Management Failure Analysis FMEA Lean Manufacturing Continuous Improvement Product Development Program Management Change Management Coaching Process Engineering SPC Six Sigma Quality Assurance Excel Process Improvement Quality Systems Microsoft Office Word Problem Solving PowerPoint Strategic Planning Semiconductors Documentation Process Development Analysis R&D Reliability Microsoft Word Process Simulation Microsoft Excel Electronics 5S Cross-functional Team... Design of Experiments Management Quality System Root Cause Analysis Software Documentation Supply Chain Supply Chain Management Testing Design for Manufacturing Start-ups Strategy Manufacturing Operations Automation Quality Control Manufacturing... See 35+     See less Education Mapua Institute of Technology Bachelor's degree,  Mechanical Engineering 1986  – 1991 Activities and Societies:  Philippine Society of Mechanical Engineers Mapua Institute of Technology Bachelor's degree,  Mechanical Engineering 1986  – 1991 Activities and Societies:  Philippine Society of Mechanical Engineers Mapua Institute of Technology Bachelor's degree,  Mechanical Engineering 1986  – 1991 Activities and Societies:  Philippine Society of Mechanical Engineers Mapua Institute of Technology Bachelor's degree,  Mechanical Engineering 1986  – 1991 Activities and Societies:  Philippine Society of Mechanical Engineers ", "Experience Engineering Department Manager Intel Corporation April 1997  – Present (18 years 5 months) Manage Electrical Engineering Department for Mobile Platform Group \n \nIncludes Board/System Design & Validation, high speed interconnect simulation and analysis, power delivery, and power integrity package/PCB analysis Electrical Engineer Naval Underwater Warfare Engineering Station 1987  –  1997  (10 years) Student University of North Dakota 1983  –  1987  (4 years) Engineering Department Manager Intel Corporation April 1997  – Present (18 years 5 months) Manage Electrical Engineering Department for Mobile Platform Group \n \nIncludes Board/System Design & Validation, high speed interconnect simulation and analysis, power delivery, and power integrity package/PCB analysis Engineering Department Manager Intel Corporation April 1997  – Present (18 years 5 months) Manage Electrical Engineering Department for Mobile Platform Group \n \nIncludes Board/System Design & Validation, high speed interconnect simulation and analysis, power delivery, and power integrity package/PCB analysis Electrical Engineer Naval Underwater Warfare Engineering Station 1987  –  1997  (10 years) Electrical Engineer Naval Underwater Warfare Engineering Station 1987  –  1997  (10 years) Student University of North Dakota 1983  –  1987  (4 years) Student University of North Dakota 1983  –  1987  (4 years) Skills Electrical Engineering Intel Semiconductors Engineering Simulations Computer Architecture IC Hardware Architecture Program Management Analysis Cross-functional Team... Mobile Devices Management ASIC Product Development Processors Engineering Management SoC Embedded Systems Debugging Product Management See 6+     See less Skills  Electrical Engineering Intel Semiconductors Engineering Simulations Computer Architecture IC Hardware Architecture Program Management Analysis Cross-functional Team... Mobile Devices Management ASIC Product Development Processors Engineering Management SoC Embedded Systems Debugging Product Management See 6+     See less Electrical Engineering Intel Semiconductors Engineering Simulations Computer Architecture IC Hardware Architecture Program Management Analysis Cross-functional Team... Mobile Devices Management ASIC Product Development Processors Engineering Management SoC Embedded Systems Debugging Product Management See 6+     See less Electrical Engineering Intel Semiconductors Engineering Simulations Computer Architecture IC Hardware Architecture Program Management Analysis Cross-functional Team... Mobile Devices Management ASIC Product Development Processors Engineering Management SoC Embedded Systems Debugging Product Management See 6+     See less Education The University of North Dakota 1983  – 1987 The University of North Dakota 1983  – 1987 The University of North Dakota 1983  – 1987 The University of North Dakota 1983  – 1987 ", "Experience G450c General Manager of Industry and Strategy Intel Corporation June 2015  – Present (3 months) Albany, New York Industrial Engineering Staff Technologist Intel Corporation August 2011  – Present (4 years 1 month) Albuquerque, New Mexico Area Project Manager and Senior Engineer for Transfer and production ramp of Bond Production module. \n•Defined and managed project capital budget, equipment specifications, and final equipment selections. \n•Lead Intel/supplier teams managing equipment design, manufacture, installation, and process qualification. \n•Conducted supplier site audits for analysis of R&D part processing capabilities and validation of performance against specifications. \n•Implemented Lean business processes for sustained assessment of supplier quality systems and equipment change notifications, and supply chain requirements. \n•Managed daily operations and production scheduling for module output, unit cycle time, equipment utilization, and labor resourcing. \n•All quality assurance and production monitoring systems defined/developed, supply chain needs defined and healthy, and all equipment and production goals met. \n \nSurplus capital harvest program developer and leader. \n•Developed standardized process for identification and ROI calculations of Virtual Factory capital harvest opportunities. \n•Program successful cost avoidance typical at $100k weekly. \nF11x Engineering Safety Team Leader. \n•Managed cross module engineering team responsible for assessment and improvements in equipment maintenance activities in accordance with EHS and IH requirements, and factory Safety goals and initiatives. \n•Key accomplishment included standardized equipment specification safety sections, LOTO and CoHE periodic inspection programs, Electrical Safety flash requirements and controls. Process Engineering Department Manager Intel Corporation March 2009  –  August 2011  (2 years 6 months) Albuquerque, New Mexico Area •2nd level manager of +150 person department consisting of engineering and production teams. Responsible for the safe, quality, and on-time production for all Front End and Back End Dry Etch operations and equipment. \n•Established departmental culture of Continuous Improvement through direct leadership, clear expectation setting, structured problem solving, hypothesis testing, process capability analysis, and statistical process control. \n•Department Champion for application of Lean Manufacturing principles and Total Predictive (TPM) tools such as Kaizen, 5S, Process Mapping, and waste elimination activities to achieve organizational goals. \n•Led tactical operational management which included Statistical Process Control chart reviews, Model Based problem solving activities, unit production output and cycle time performance reviews, and projected staffing requirements. \n•Provided leadership to Department staff on professional and personal development by providing growth opportunities, constructive coaching, continual learning, and performance management. \n Process Engineering Group Manager Intel Corporation May 2003  –  March 2009  (5 years 11 months) New Mexico •Front line manager of Engineering group consisting of 12 to 15 Equipment and Process engineers. \n•Dry etch process transfer leader for two 300mm technologies. Partnered with trades & contractors, equipment vendors, and transferring site engineers to design, install, and qualify for production the group's manufacturing equipment. \n•Directly applied Lean Manufacturing and Total Productive Maintenance (TPM) principles as tools for continuous improvement. Drove etch organizations to execute on standardization, controlled change, and iterative learning cycles. Presenter at Divisional \"Intel Manufacturing Excellence\" Conference for breakthrough performance as a result of TPM and Lean tool implementation. \n•Led the creation of Intel's Lean based High Precision Maintenance course. Integrated in Lean and TPM principles and tools such as Kaizen, Andon cords, Kanban, 5S, PM mapping, etc... Served as lead instructor for the course attended by students across. \n•Team leader for module's quality systems including statistical process reviews, quality performance reviews, continuous improvement roadmaps, and learning cycles. \n•Manager of Intel and supplier relations, and evaluations of supplier performance against contractual requirements associated with spares supply chain management, supplier field service engineer staffing. \n•Provided leadership to etch module staff on professional and personal development by providing growth opportunities and positive and constructive coaching. \n Equipment Engineer Intel Corporation January 1997  –  May 2003  (6 years 5 months) Albuquerque, New Mexico Area •Sustaining Equipment engineer for over 30 units of manufacturing equipment, responsible for safe and quality equipment processing. \n•Served as receiving site transfer engineer for three separate 8\" technologies. \n•Utilized model based problem solving to resolve quality issues and statistical process controls to monitor equipment health. \n•Intel representative for supplier performance, parts quality and availability management, and equipment change notification implementation. \n•Responsible for equipment installation including scheduling, blueprints and installation design packages. Including power, water, vacuum and process gases facilities reviews Power, water, vacuum, and process gases. \n G450c General Manager of Industry and Strategy Intel Corporation June 2015  – Present (3 months) Albany, New York G450c General Manager of Industry and Strategy Intel Corporation June 2015  – Present (3 months) Albany, New York Industrial Engineering Staff Technologist Intel Corporation August 2011  – Present (4 years 1 month) Albuquerque, New Mexico Area Project Manager and Senior Engineer for Transfer and production ramp of Bond Production module. \n•Defined and managed project capital budget, equipment specifications, and final equipment selections. \n•Lead Intel/supplier teams managing equipment design, manufacture, installation, and process qualification. \n•Conducted supplier site audits for analysis of R&D part processing capabilities and validation of performance against specifications. \n•Implemented Lean business processes for sustained assessment of supplier quality systems and equipment change notifications, and supply chain requirements. \n•Managed daily operations and production scheduling for module output, unit cycle time, equipment utilization, and labor resourcing. \n•All quality assurance and production monitoring systems defined/developed, supply chain needs defined and healthy, and all equipment and production goals met. \n \nSurplus capital harvest program developer and leader. \n•Developed standardized process for identification and ROI calculations of Virtual Factory capital harvest opportunities. \n•Program successful cost avoidance typical at $100k weekly. \nF11x Engineering Safety Team Leader. \n•Managed cross module engineering team responsible for assessment and improvements in equipment maintenance activities in accordance with EHS and IH requirements, and factory Safety goals and initiatives. \n•Key accomplishment included standardized equipment specification safety sections, LOTO and CoHE periodic inspection programs, Electrical Safety flash requirements and controls. Industrial Engineering Staff Technologist Intel Corporation August 2011  – Present (4 years 1 month) Albuquerque, New Mexico Area Project Manager and Senior Engineer for Transfer and production ramp of Bond Production module. \n•Defined and managed project capital budget, equipment specifications, and final equipment selections. \n•Lead Intel/supplier teams managing equipment design, manufacture, installation, and process qualification. \n•Conducted supplier site audits for analysis of R&D part processing capabilities and validation of performance against specifications. \n•Implemented Lean business processes for sustained assessment of supplier quality systems and equipment change notifications, and supply chain requirements. \n•Managed daily operations and production scheduling for module output, unit cycle time, equipment utilization, and labor resourcing. \n•All quality assurance and production monitoring systems defined/developed, supply chain needs defined and healthy, and all equipment and production goals met. \n \nSurplus capital harvest program developer and leader. \n•Developed standardized process for identification and ROI calculations of Virtual Factory capital harvest opportunities. \n•Program successful cost avoidance typical at $100k weekly. \nF11x Engineering Safety Team Leader. \n•Managed cross module engineering team responsible for assessment and improvements in equipment maintenance activities in accordance with EHS and IH requirements, and factory Safety goals and initiatives. \n•Key accomplishment included standardized equipment specification safety sections, LOTO and CoHE periodic inspection programs, Electrical Safety flash requirements and controls. Process Engineering Department Manager Intel Corporation March 2009  –  August 2011  (2 years 6 months) Albuquerque, New Mexico Area •2nd level manager of +150 person department consisting of engineering and production teams. Responsible for the safe, quality, and on-time production for all Front End and Back End Dry Etch operations and equipment. \n•Established departmental culture of Continuous Improvement through direct leadership, clear expectation setting, structured problem solving, hypothesis testing, process capability analysis, and statistical process control. \n•Department Champion for application of Lean Manufacturing principles and Total Predictive (TPM) tools such as Kaizen, 5S, Process Mapping, and waste elimination activities to achieve organizational goals. \n•Led tactical operational management which included Statistical Process Control chart reviews, Model Based problem solving activities, unit production output and cycle time performance reviews, and projected staffing requirements. \n•Provided leadership to Department staff on professional and personal development by providing growth opportunities, constructive coaching, continual learning, and performance management. \n Process Engineering Department Manager Intel Corporation March 2009  –  August 2011  (2 years 6 months) Albuquerque, New Mexico Area •2nd level manager of +150 person department consisting of engineering and production teams. Responsible for the safe, quality, and on-time production for all Front End and Back End Dry Etch operations and equipment. \n•Established departmental culture of Continuous Improvement through direct leadership, clear expectation setting, structured problem solving, hypothesis testing, process capability analysis, and statistical process control. \n•Department Champion for application of Lean Manufacturing principles and Total Predictive (TPM) tools such as Kaizen, 5S, Process Mapping, and waste elimination activities to achieve organizational goals. \n•Led tactical operational management which included Statistical Process Control chart reviews, Model Based problem solving activities, unit production output and cycle time performance reviews, and projected staffing requirements. \n•Provided leadership to Department staff on professional and personal development by providing growth opportunities, constructive coaching, continual learning, and performance management. \n Process Engineering Group Manager Intel Corporation May 2003  –  March 2009  (5 years 11 months) New Mexico •Front line manager of Engineering group consisting of 12 to 15 Equipment and Process engineers. \n•Dry etch process transfer leader for two 300mm technologies. Partnered with trades & contractors, equipment vendors, and transferring site engineers to design, install, and qualify for production the group's manufacturing equipment. \n•Directly applied Lean Manufacturing and Total Productive Maintenance (TPM) principles as tools for continuous improvement. Drove etch organizations to execute on standardization, controlled change, and iterative learning cycles. Presenter at Divisional \"Intel Manufacturing Excellence\" Conference for breakthrough performance as a result of TPM and Lean tool implementation. \n•Led the creation of Intel's Lean based High Precision Maintenance course. Integrated in Lean and TPM principles and tools such as Kaizen, Andon cords, Kanban, 5S, PM mapping, etc... Served as lead instructor for the course attended by students across. \n•Team leader for module's quality systems including statistical process reviews, quality performance reviews, continuous improvement roadmaps, and learning cycles. \n•Manager of Intel and supplier relations, and evaluations of supplier performance against contractual requirements associated with spares supply chain management, supplier field service engineer staffing. \n•Provided leadership to etch module staff on professional and personal development by providing growth opportunities and positive and constructive coaching. \n Process Engineering Group Manager Intel Corporation May 2003  –  March 2009  (5 years 11 months) New Mexico •Front line manager of Engineering group consisting of 12 to 15 Equipment and Process engineers. \n•Dry etch process transfer leader for two 300mm technologies. Partnered with trades & contractors, equipment vendors, and transferring site engineers to design, install, and qualify for production the group's manufacturing equipment. \n•Directly applied Lean Manufacturing and Total Productive Maintenance (TPM) principles as tools for continuous improvement. Drove etch organizations to execute on standardization, controlled change, and iterative learning cycles. Presenter at Divisional \"Intel Manufacturing Excellence\" Conference for breakthrough performance as a result of TPM and Lean tool implementation. \n•Led the creation of Intel's Lean based High Precision Maintenance course. Integrated in Lean and TPM principles and tools such as Kaizen, Andon cords, Kanban, 5S, PM mapping, etc... Served as lead instructor for the course attended by students across. \n•Team leader for module's quality systems including statistical process reviews, quality performance reviews, continuous improvement roadmaps, and learning cycles. \n•Manager of Intel and supplier relations, and evaluations of supplier performance against contractual requirements associated with spares supply chain management, supplier field service engineer staffing. \n•Provided leadership to etch module staff on professional and personal development by providing growth opportunities and positive and constructive coaching. \n Equipment Engineer Intel Corporation January 1997  –  May 2003  (6 years 5 months) Albuquerque, New Mexico Area •Sustaining Equipment engineer for over 30 units of manufacturing equipment, responsible for safe and quality equipment processing. \n•Served as receiving site transfer engineer for three separate 8\" technologies. \n•Utilized model based problem solving to resolve quality issues and statistical process controls to monitor equipment health. \n•Intel representative for supplier performance, parts quality and availability management, and equipment change notification implementation. \n•Responsible for equipment installation including scheduling, blueprints and installation design packages. Including power, water, vacuum and process gases facilities reviews Power, water, vacuum, and process gases. \n Equipment Engineer Intel Corporation January 1997  –  May 2003  (6 years 5 months) Albuquerque, New Mexico Area •Sustaining Equipment engineer for over 30 units of manufacturing equipment, responsible for safe and quality equipment processing. \n•Served as receiving site transfer engineer for three separate 8\" technologies. \n•Utilized model based problem solving to resolve quality issues and statistical process controls to monitor equipment health. \n•Intel representative for supplier performance, parts quality and availability management, and equipment change notification implementation. \n•Responsible for equipment installation including scheduling, blueprints and installation design packages. Including power, water, vacuum and process gases facilities reviews Power, water, vacuum, and process gases. \n Skills Business Development Supply Chain Management Automation Management Electronics Data Analysis Data Mining Semiconductor Industry Product Management Start-ups Process Engineering Program Management SPC Six Sigma JMP Engineering Project Management Semiconductors Design of Experiments R&D Engineering Management Business Strategy Process Improvement Manufacturing Operations Management Product Development Strategic Planning Cross-functional Team... Lean Manufacturing Continuous Improvement See 15+     See less Skills  Business Development Supply Chain Management Automation Management Electronics Data Analysis Data Mining Semiconductor Industry Product Management Start-ups Process Engineering Program Management SPC Six Sigma JMP Engineering Project Management Semiconductors Design of Experiments R&D Engineering Management Business Strategy Process Improvement Manufacturing Operations Management Product Development Strategic Planning Cross-functional Team... Lean Manufacturing Continuous Improvement See 15+     See less Business Development Supply Chain Management Automation Management Electronics Data Analysis Data Mining Semiconductor Industry Product Management Start-ups Process Engineering Program Management SPC Six Sigma JMP Engineering Project Management Semiconductors Design of Experiments R&D Engineering Management Business Strategy Process Improvement Manufacturing Operations Management Product Development Strategic Planning Cross-functional Team... Lean Manufacturing Continuous Improvement See 15+     See less Business Development Supply Chain Management Automation Management Electronics Data Analysis Data Mining Semiconductor Industry Product Management Start-ups Process Engineering Program Management SPC Six Sigma JMP Engineering Project Management Semiconductors Design of Experiments R&D Engineering Management Business Strategy Process Improvement Manufacturing Operations Management Product Development Strategic Planning Cross-functional Team... Lean Manufacturing Continuous Improvement See 15+     See less Education The University of New Mexico Bachelor's Degree,  Manufacturing and Robotics , 3.4 1992  – 1996 The University of New Mexico Bachelor's Degree,  Manufacturing and Robotics , 3.4 1992  – 1996 The University of New Mexico Bachelor's Degree,  Manufacturing and Robotics , 3.4 1992  – 1996 The University of New Mexico Bachelor's Degree,  Manufacturing and Robotics , 3.4 1992  – 1996 ", "Summary • Experienced manager of technical operations with large scope and significant engineering challenges  \n• Demonstrated ability creating new programs and roles to address business needs \n• Extensive international work experience in China and Europe \n \nSpecialties: Medical Device Manufacturing; Semiconductor manufacturing; process engineering; international business; Technical program management; advanced technology transfer and startup Summary • Experienced manager of technical operations with large scope and significant engineering challenges  \n• Demonstrated ability creating new programs and roles to address business needs \n• Extensive international work experience in China and Europe \n \nSpecialties: Medical Device Manufacturing; Semiconductor manufacturing; process engineering; international business; Technical program management; advanced technology transfer and startup • Experienced manager of technical operations with large scope and significant engineering challenges  \n• Demonstrated ability creating new programs and roles to address business needs \n• Extensive international work experience in China and Europe \n \nSpecialties: Medical Device Manufacturing; Semiconductor manufacturing; process engineering; international business; Technical program management; advanced technology transfer and startup • Experienced manager of technical operations with large scope and significant engineering challenges  \n• Demonstrated ability creating new programs and roles to address business needs \n• Extensive international work experience in China and Europe \n \nSpecialties: Medical Device Manufacturing; Semiconductor manufacturing; process engineering; international business; Technical program management; advanced technology transfer and startup Experience Director Longhorn Asset Management June 2014  – Present (1 year 3 months) Program Manager Medtronic November 2011  –  June 2014  (2 years 8 months) Tempe, Arizona Manufacturing readiness manager for new product introduction: ensuring product schedules, manufacturing systems, and regulatory compliance for new product launches. Engineering Program Manager Intel Corporation January 2006  –  January 2011  (5 years 1 month) Program manager for Intel's wafer fabrication plan startup in Dalian, China. \nResponsible for program schedule to meet safety, quality, and cost goals for startup of Intel’s greenfield wafer fabrication plant in China.  \n•\tInnovative cost control: used performance-specifications for construction to reduce cost while matching process transfer requirements  \n•\tIntegrated risk management: owned the risk assessment and mitigation strategy for successful startup  \n•\tStartup methodology: trained all employees on priority, quality, and workload expectations Capital and Capacity Management Intel Corporation December 1999  –  December 2005  (6 years 1 month) Reduced capital requirements to meet production ramps through capacity improvement and equipment reallocation. Improved safety and quality of tool transfers among sites by standardizing equipment relocation procedures. \n•\tEliminated high-risk safety incidents; reduced property damage rate from 50%->5%  \n•\tCreated process to target engineering resources for capacity improvement on all equipment types \n•\tReceived Intel’s highest recognition for innovation in reducing capital requirements by >$100M Industrial Engineering Department Manager, Fab 12 Intel Corporation June 1997  –  December 1999  (2 years 7 months) Responsible for ~50 person department, including group leaders, and ownership of capital budgets, layout, and labor modeling during two technology process transfers.  \n•\tDeveloped tool marathon process to test capacity during early installation \n•\tInitiated group leader training program to develop leadership and supervisory capability Process Engineering Manager, Fab 6 Intel Corporation June 1996  –  June 1997  (1 year 1 month) Managed group of process engineers and engineering technicians in lithography. \n- 90% reduction in complexity of quality response checklists ( improved equipment uptime) \n- Re-target of process parameters (improved process capability and customer quality levels) Manufacturing Manager, Fab 6 Intel Corporation January 1993  –  June 1996  (3 years 6 months) Responsible for 24x7 operations, including five production shifts (~90 employees/shift) \n- Extensive training and hiring, to support Arizona site growth and train for other ramping sites \n- Multiple iterations of ramping and de-ramping production workload (capacity, headcount, shifts) Industrial Engineering Department Manager Intel Corporation January 1989  –  December 1992  (4 years) Managed group of engineers and technicians dedicated to operations improvements, capacity improvements, and space planning. Developed operations management models and solutions, including: \n- Constraint management: required throughput time improvements by operation \n- Labor: headcount requirements for technology transfers \n- Lead-time reduction: order release strategy and line sequencing for customized products Component Technology Manufacturing Engineer Intel Corporation May 1987  –  December 1988  (1 year 8 months) Supported all wafer fabs with operations improvement projects, including simulation modeling. Projects included equipment performance modeling, lot prioritization assessments, and labor staffing improvements. Simulation Manufacturing Engineer IBM January 1980  –  April 1987  (7 years 4 months) Vimercate, Italy and Tucson, AZ, USA Director Longhorn Asset Management June 2014  – Present (1 year 3 months) Director Longhorn Asset Management June 2014  – Present (1 year 3 months) Program Manager Medtronic November 2011  –  June 2014  (2 years 8 months) Tempe, Arizona Manufacturing readiness manager for new product introduction: ensuring product schedules, manufacturing systems, and regulatory compliance for new product launches. Program Manager Medtronic November 2011  –  June 2014  (2 years 8 months) Tempe, Arizona Manufacturing readiness manager for new product introduction: ensuring product schedules, manufacturing systems, and regulatory compliance for new product launches. Engineering Program Manager Intel Corporation January 2006  –  January 2011  (5 years 1 month) Program manager for Intel's wafer fabrication plan startup in Dalian, China. \nResponsible for program schedule to meet safety, quality, and cost goals for startup of Intel’s greenfield wafer fabrication plant in China.  \n•\tInnovative cost control: used performance-specifications for construction to reduce cost while matching process transfer requirements  \n•\tIntegrated risk management: owned the risk assessment and mitigation strategy for successful startup  \n•\tStartup methodology: trained all employees on priority, quality, and workload expectations Engineering Program Manager Intel Corporation January 2006  –  January 2011  (5 years 1 month) Program manager for Intel's wafer fabrication plan startup in Dalian, China. \nResponsible for program schedule to meet safety, quality, and cost goals for startup of Intel’s greenfield wafer fabrication plant in China.  \n•\tInnovative cost control: used performance-specifications for construction to reduce cost while matching process transfer requirements  \n•\tIntegrated risk management: owned the risk assessment and mitigation strategy for successful startup  \n•\tStartup methodology: trained all employees on priority, quality, and workload expectations Capital and Capacity Management Intel Corporation December 1999  –  December 2005  (6 years 1 month) Reduced capital requirements to meet production ramps through capacity improvement and equipment reallocation. Improved safety and quality of tool transfers among sites by standardizing equipment relocation procedures. \n•\tEliminated high-risk safety incidents; reduced property damage rate from 50%->5%  \n•\tCreated process to target engineering resources for capacity improvement on all equipment types \n•\tReceived Intel’s highest recognition for innovation in reducing capital requirements by >$100M Capital and Capacity Management Intel Corporation December 1999  –  December 2005  (6 years 1 month) Reduced capital requirements to meet production ramps through capacity improvement and equipment reallocation. Improved safety and quality of tool transfers among sites by standardizing equipment relocation procedures. \n•\tEliminated high-risk safety incidents; reduced property damage rate from 50%->5%  \n•\tCreated process to target engineering resources for capacity improvement on all equipment types \n•\tReceived Intel’s highest recognition for innovation in reducing capital requirements by >$100M Industrial Engineering Department Manager, Fab 12 Intel Corporation June 1997  –  December 1999  (2 years 7 months) Responsible for ~50 person department, including group leaders, and ownership of capital budgets, layout, and labor modeling during two technology process transfers.  \n•\tDeveloped tool marathon process to test capacity during early installation \n•\tInitiated group leader training program to develop leadership and supervisory capability Industrial Engineering Department Manager, Fab 12 Intel Corporation June 1997  –  December 1999  (2 years 7 months) Responsible for ~50 person department, including group leaders, and ownership of capital budgets, layout, and labor modeling during two technology process transfers.  \n•\tDeveloped tool marathon process to test capacity during early installation \n•\tInitiated group leader training program to develop leadership and supervisory capability Process Engineering Manager, Fab 6 Intel Corporation June 1996  –  June 1997  (1 year 1 month) Managed group of process engineers and engineering technicians in lithography. \n- 90% reduction in complexity of quality response checklists ( improved equipment uptime) \n- Re-target of process parameters (improved process capability and customer quality levels) Process Engineering Manager, Fab 6 Intel Corporation June 1996  –  June 1997  (1 year 1 month) Managed group of process engineers and engineering technicians in lithography. \n- 90% reduction in complexity of quality response checklists ( improved equipment uptime) \n- Re-target of process parameters (improved process capability and customer quality levels) Manufacturing Manager, Fab 6 Intel Corporation January 1993  –  June 1996  (3 years 6 months) Responsible for 24x7 operations, including five production shifts (~90 employees/shift) \n- Extensive training and hiring, to support Arizona site growth and train for other ramping sites \n- Multiple iterations of ramping and de-ramping production workload (capacity, headcount, shifts) Manufacturing Manager, Fab 6 Intel Corporation January 1993  –  June 1996  (3 years 6 months) Responsible for 24x7 operations, including five production shifts (~90 employees/shift) \n- Extensive training and hiring, to support Arizona site growth and train for other ramping sites \n- Multiple iterations of ramping and de-ramping production workload (capacity, headcount, shifts) Industrial Engineering Department Manager Intel Corporation January 1989  –  December 1992  (4 years) Managed group of engineers and technicians dedicated to operations improvements, capacity improvements, and space planning. Developed operations management models and solutions, including: \n- Constraint management: required throughput time improvements by operation \n- Labor: headcount requirements for technology transfers \n- Lead-time reduction: order release strategy and line sequencing for customized products Industrial Engineering Department Manager Intel Corporation January 1989  –  December 1992  (4 years) Managed group of engineers and technicians dedicated to operations improvements, capacity improvements, and space planning. Developed operations management models and solutions, including: \n- Constraint management: required throughput time improvements by operation \n- Labor: headcount requirements for technology transfers \n- Lead-time reduction: order release strategy and line sequencing for customized products Component Technology Manufacturing Engineer Intel Corporation May 1987  –  December 1988  (1 year 8 months) Supported all wafer fabs with operations improvement projects, including simulation modeling. Projects included equipment performance modeling, lot prioritization assessments, and labor staffing improvements. Component Technology Manufacturing Engineer Intel Corporation May 1987  –  December 1988  (1 year 8 months) Supported all wafer fabs with operations improvement projects, including simulation modeling. Projects included equipment performance modeling, lot prioritization assessments, and labor staffing improvements. Simulation Manufacturing Engineer IBM January 1980  –  April 1987  (7 years 4 months) Vimercate, Italy and Tucson, AZ, USA Simulation Manufacturing Engineer IBM January 1980  –  April 1987  (7 years 4 months) Vimercate, Italy and Tucson, AZ, USA Languages Italian Italian Italian Skills Manufacturing... Six Sigma Industrial Engineering Manufacturing SPC Process Improvement Process Engineering Management Strategy Program Management Semiconductors Start-ups Testing Cross-functional Team... Leadership Design of Experiments Operations Management Engineering Failure Analysis Engineering Management Lean Manufacturing Root Cause Analysis Thin Films DMAIC Continuous Improvement JMP Product Development Product Engineering Metrology Semiconductor Industry FMEA Design for Manufacturing Simulations Process Simulation Electronics R&D Minitab ISO 13485 Quality System Medical Devices See 25+     See less Skills  Manufacturing... Six Sigma Industrial Engineering Manufacturing SPC Process Improvement Process Engineering Management Strategy Program Management Semiconductors Start-ups Testing Cross-functional Team... Leadership Design of Experiments Operations Management Engineering Failure Analysis Engineering Management Lean Manufacturing Root Cause Analysis Thin Films DMAIC Continuous Improvement JMP Product Development Product Engineering Metrology Semiconductor Industry FMEA Design for Manufacturing Simulations Process Simulation Electronics R&D Minitab ISO 13485 Quality System Medical Devices See 25+     See less Manufacturing... Six Sigma Industrial Engineering Manufacturing SPC Process Improvement Process Engineering Management Strategy Program Management Semiconductors Start-ups Testing Cross-functional Team... Leadership Design of Experiments Operations Management Engineering Failure Analysis Engineering Management Lean Manufacturing Root Cause Analysis Thin Films DMAIC Continuous Improvement JMP Product Development Product Engineering Metrology Semiconductor Industry FMEA Design for Manufacturing Simulations Process Simulation Electronics R&D Minitab ISO 13485 Quality System Medical Devices See 25+     See less Manufacturing... Six Sigma Industrial Engineering Manufacturing SPC Process Improvement Process Engineering Management Strategy Program Management Semiconductors Start-ups Testing Cross-functional Team... Leadership Design of Experiments Operations Management Engineering Failure Analysis Engineering Management Lean Manufacturing Root Cause Analysis Thin Films DMAIC Continuous Improvement JMP Product Development Product Engineering Metrology Semiconductor Industry FMEA Design for Manufacturing Simulations Process Simulation Electronics R&D Minitab ISO 13485 Quality System Medical Devices See 25+     See less Education Purdue University BSIE,  Engineering 1975  – 1979 Co-op program graduate Activities and Societies:  Society of Women Engineers ,  Tau Beta Pi ,  Alpha Pi Mu Purdue University BSIE,  Engineering 1975  – 1979 Co-op program graduate Activities and Societies:  Society of Women Engineers ,  Tau Beta Pi ,  Alpha Pi Mu Purdue University BSIE,  Engineering 1975  – 1979 Co-op program graduate Activities and Societies:  Society of Women Engineers ,  Tau Beta Pi ,  Alpha Pi Mu Purdue University BSIE,  Engineering 1975  – 1979 Co-op program graduate Activities and Societies:  Society of Women Engineers ,  Tau Beta Pi ,  Alpha Pi Mu Honors & Awards Additional Honors & Awards PROFESSIONAL ASSOCIATIONS \nSociety of Women Engineers (SWE) 2005-2010: Management sponsor for Intel’s relationship with SWE  \nArizona State University: 2005-2009: Dean’s Corporate Advisory Council, Provost’s Advisory Council. \nUniversity of Arizona: invited speaker, Women’s Leadership Conference (2004, 2005, 2007, 2008, 2011) \n \nPRESENTATIONS \nSociety of Women Engineers Region B Conference: invited speaker, March, 2013: \"Lessons Learned from China\" \nSociety of Women Engineers National Conference: invited speaker, October, 2011: \"Get Ready for Your Global Workplace\" \nAmerican Society for Quality, Phoenix Section: invited speaker, May, 2011: \"Succeeding in the Global Workplace\" \nIEEE International Symposium on Semiconductor Manufacturing (ISSM): invited speaker, April, 2005: \"Lean and Agile Capacity Management\" \nSEMATECH: Robert Noyce Award, Best Presentation, Manufacturing Management Symposium, April, 1992: “Factory Performance Analysis” Additional Honors & Awards PROFESSIONAL ASSOCIATIONS \nSociety of Women Engineers (SWE) 2005-2010: Management sponsor for Intel’s relationship with SWE  \nArizona State University: 2005-2009: Dean’s Corporate Advisory Council, Provost’s Advisory Council. \nUniversity of Arizona: invited speaker, Women’s Leadership Conference (2004, 2005, 2007, 2008, 2011) \n \nPRESENTATIONS \nSociety of Women Engineers Region B Conference: invited speaker, March, 2013: \"Lessons Learned from China\" \nSociety of Women Engineers National Conference: invited speaker, October, 2011: \"Get Ready for Your Global Workplace\" \nAmerican Society for Quality, Phoenix Section: invited speaker, May, 2011: \"Succeeding in the Global Workplace\" \nIEEE International Symposium on Semiconductor Manufacturing (ISSM): invited speaker, April, 2005: \"Lean and Agile Capacity Management\" \nSEMATECH: Robert Noyce Award, Best Presentation, Manufacturing Management Symposium, April, 1992: “Factory Performance Analysis” Additional Honors & Awards PROFESSIONAL ASSOCIATIONS \nSociety of Women Engineers (SWE) 2005-2010: Management sponsor for Intel’s relationship with SWE  \nArizona State University: 2005-2009: Dean’s Corporate Advisory Council, Provost’s Advisory Council. \nUniversity of Arizona: invited speaker, Women’s Leadership Conference (2004, 2005, 2007, 2008, 2011) \n \nPRESENTATIONS \nSociety of Women Engineers Region B Conference: invited speaker, March, 2013: \"Lessons Learned from China\" \nSociety of Women Engineers National Conference: invited speaker, October, 2011: \"Get Ready for Your Global Workplace\" \nAmerican Society for Quality, Phoenix Section: invited speaker, May, 2011: \"Succeeding in the Global Workplace\" \nIEEE International Symposium on Semiconductor Manufacturing (ISSM): invited speaker, April, 2005: \"Lean and Agile Capacity Management\" \nSEMATECH: Robert Noyce Award, Best Presentation, Manufacturing Management Symposium, April, 1992: “Factory Performance Analysis” Additional Honors & Awards PROFESSIONAL ASSOCIATIONS \nSociety of Women Engineers (SWE) 2005-2010: Management sponsor for Intel’s relationship with SWE  \nArizona State University: 2005-2009: Dean’s Corporate Advisory Council, Provost’s Advisory Council. \nUniversity of Arizona: invited speaker, Women’s Leadership Conference (2004, 2005, 2007, 2008, 2011) \n \nPRESENTATIONS \nSociety of Women Engineers Region B Conference: invited speaker, March, 2013: \"Lessons Learned from China\" \nSociety of Women Engineers National Conference: invited speaker, October, 2011: \"Get Ready for Your Global Workplace\" \nAmerican Society for Quality, Phoenix Section: invited speaker, May, 2011: \"Succeeding in the Global Workplace\" \nIEEE International Symposium on Semiconductor Manufacturing (ISSM): invited speaker, April, 2005: \"Lean and Agile Capacity Management\" \nSEMATECH: Robert Noyce Award, Best Presentation, Manufacturing Management Symposium, April, 1992: “Factory Performance Analysis” "]}