{"position": "Engineering Intern", "company": "Intel Corporation", "profiles": ["Summary A self-driven, detail-oriented individual looking for opportunities in fast-moving, team-oriented companies in the software engineering and big data analytics space. Areas of expertise include software engineering, Linux kernel architecture, scripting languages, and customer engagement. Carl Strickland - Resume - 2014 Edit Summary A self-driven, detail-oriented individual looking for opportunities in fast-moving, team-oriented companies in the software engineering and big data analytics space. Areas of expertise include software engineering, Linux kernel architecture, scripting languages, and customer engagement. Carl Strickland - Resume - 2014 Edit A self-driven, detail-oriented individual looking for opportunities in fast-moving, team-oriented companies in the software engineering and big data analytics space. Areas of expertise include software engineering, Linux kernel architecture, scripting languages, and customer engagement. A self-driven, detail-oriented individual looking for opportunities in fast-moving, team-oriented companies in the software engineering and big data analytics space. Areas of expertise include software engineering, Linux kernel architecture, scripting languages, and customer engagement. Carl Strickland - Resume - 2014 Edit Carl Strickland - Resume - 2014 Edit Carl Strickland - Resume - 2014 Edit Carl Strickland - Resume - 2014  Carl Strickland - Resume - 2014  Experience Software Engineer 1 Garmin International January 2015  – Present (8 months) Chandler, AZ Application Engineering Intern Intel Corporation May 2014  –  December 2014  (8 months) Chandler, AZ Engaged with a major big data ISV to identify opportunities for joint optimization with Intel. Worked with the ISV to define and develop a workload for analysis and optimization. \n \nAnalyzed a major enterprise workload on a simulator for future Intel platforms. Extracted traces of the workload under various configurations that are used to influence future platform design. (Open) 6 honors and awards Recognized by Team Member Recognized by team member for helping resolve a networking issue with Simics. View Recognized by Department Recognized for supporting enterprise workload characterization using the Simics full system simulator. View Recognized by Group Recognized for supporting enterprise workload characterization using the Simics full system simulator. View Recognized by Team Member Recognized by team member for supporting their work using the Simics full system simulator. View Recognized by Team Member Recognized for helping identify and resolve a significant workload configuration issue. View Recognized by Team Member Recognized for identifying improvements to Intel's memory latency checker. View Application Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Chandler, AZ Researched performance collection and analysis on clusters using R and PANDAS to enable future analytics. \n \nEngaged with the Intel Cache Acceleration Software (ICAS) team to benchmark and provide recommendations for customers using an industry leading analytics stack on Intel platforms and SSDs. Application Engineering Intern Intel Corporation July 2011  –  January 2013  (1 year 7 months) Chandler, AZ Prototyped a new energy efficient mechanism for the Linux kernel to allocate physical memory pages based on power-efficient co-location algorithms. Rewrote the memory management system in the Linux kernel in order to achieve this, and measured power savings on real hardware. This work was published in a paper as part of the 9th ACM SIGPLAN/SIGOPS international conference on Virtual execution environments <http://dl.acm.org/citation.cfm?id=2451512>. \n \nCoauthored a software library using processor features to monitor platform power consumption – Intel(R) Power Governor <software.intel.com/articles/power-gov>. \n \nAutomated system configuration and workload execution for platform checkout activities on SUSE and Red Hat Enterprise Linux distributions. (Open) 1 project Intel(r) Power Governor Intel® Power Governor is a software utility and library, which allows developers to (a) monitor power and (b) regulate power at very fine time granularity on latest generation Intel® platforms. View Replenishment Target November 2008  –  January 2010  (1 year 3 months) Mesa, Arizona Worked in replenishment, inventory, cashiering, price management, freshness, and layout. \n \nEmployee of the Month, May 2009 Software Engineer 1 Garmin International January 2015  – Present (8 months) Chandler, AZ Software Engineer 1 Garmin International January 2015  – Present (8 months) Chandler, AZ Application Engineering Intern Intel Corporation May 2014  –  December 2014  (8 months) Chandler, AZ Engaged with a major big data ISV to identify opportunities for joint optimization with Intel. Worked with the ISV to define and develop a workload for analysis and optimization. \n \nAnalyzed a major enterprise workload on a simulator for future Intel platforms. Extracted traces of the workload under various configurations that are used to influence future platform design. (Open) 6 honors and awards Recognized by Team Member Recognized by team member for helping resolve a networking issue with Simics. View Recognized by Department Recognized for supporting enterprise workload characterization using the Simics full system simulator. View Recognized by Group Recognized for supporting enterprise workload characterization using the Simics full system simulator. View Recognized by Team Member Recognized by team member for supporting their work using the Simics full system simulator. View Recognized by Team Member Recognized for helping identify and resolve a significant workload configuration issue. View Recognized by Team Member Recognized for identifying improvements to Intel's memory latency checker. View Application Engineering Intern Intel Corporation May 2014  –  December 2014  (8 months) Chandler, AZ Engaged with a major big data ISV to identify opportunities for joint optimization with Intel. Worked with the ISV to define and develop a workload for analysis and optimization. \n \nAnalyzed a major enterprise workload on a simulator for future Intel platforms. Extracted traces of the workload under various configurations that are used to influence future platform design. (Open) 6 honors and awards Recognized by Team Member Recognized by team member for helping resolve a networking issue with Simics. View Recognized by Department Recognized for supporting enterprise workload characterization using the Simics full system simulator. View Recognized by Group Recognized for supporting enterprise workload characterization using the Simics full system simulator. View Recognized by Team Member Recognized by team member for supporting their work using the Simics full system simulator. View Recognized by Team Member Recognized for helping identify and resolve a significant workload configuration issue. View Recognized by Team Member Recognized for identifying improvements to Intel's memory latency checker. View Application Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Chandler, AZ Researched performance collection and analysis on clusters using R and PANDAS to enable future analytics. \n \nEngaged with the Intel Cache Acceleration Software (ICAS) team to benchmark and provide recommendations for customers using an industry leading analytics stack on Intel platforms and SSDs. Application Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Chandler, AZ Researched performance collection and analysis on clusters using R and PANDAS to enable future analytics. \n \nEngaged with the Intel Cache Acceleration Software (ICAS) team to benchmark and provide recommendations for customers using an industry leading analytics stack on Intel platforms and SSDs. Application Engineering Intern Intel Corporation July 2011  –  January 2013  (1 year 7 months) Chandler, AZ Prototyped a new energy efficient mechanism for the Linux kernel to allocate physical memory pages based on power-efficient co-location algorithms. Rewrote the memory management system in the Linux kernel in order to achieve this, and measured power savings on real hardware. This work was published in a paper as part of the 9th ACM SIGPLAN/SIGOPS international conference on Virtual execution environments <http://dl.acm.org/citation.cfm?id=2451512>. \n \nCoauthored a software library using processor features to monitor platform power consumption – Intel(R) Power Governor <software.intel.com/articles/power-gov>. \n \nAutomated system configuration and workload execution for platform checkout activities on SUSE and Red Hat Enterprise Linux distributions. (Open) 1 project Intel(r) Power Governor Intel® Power Governor is a software utility and library, which allows developers to (a) monitor power and (b) regulate power at very fine time granularity on latest generation Intel® platforms. View Application Engineering Intern Intel Corporation July 2011  –  January 2013  (1 year 7 months) Chandler, AZ Prototyped a new energy efficient mechanism for the Linux kernel to allocate physical memory pages based on power-efficient co-location algorithms. Rewrote the memory management system in the Linux kernel in order to achieve this, and measured power savings on real hardware. This work was published in a paper as part of the 9th ACM SIGPLAN/SIGOPS international conference on Virtual execution environments <http://dl.acm.org/citation.cfm?id=2451512>. \n \nCoauthored a software library using processor features to monitor platform power consumption – Intel(R) Power Governor <software.intel.com/articles/power-gov>. \n \nAutomated system configuration and workload execution for platform checkout activities on SUSE and Red Hat Enterprise Linux distributions. (Open) 1 project Intel(r) Power Governor Intel® Power Governor is a software utility and library, which allows developers to (a) monitor power and (b) regulate power at very fine time granularity on latest generation Intel® platforms. View Replenishment Target November 2008  –  January 2010  (1 year 3 months) Mesa, Arizona Worked in replenishment, inventory, cashiering, price management, freshness, and layout. \n \nEmployee of the Month, May 2009 Replenishment Target November 2008  –  January 2010  (1 year 3 months) Mesa, Arizona Worked in replenishment, inventory, cashiering, price management, freshness, and layout. \n \nEmployee of the Month, May 2009 Languages   Skills Top Skills 2 Python 2 Software Engineering 1 Linux 1 Perl 2 C 1 Automation 2 C++ 1 Hardware 1 Java 1 Nonprofits Carl also knows about... 0 SQL 0 Ruby 0 LaTeX 0 C# 0 Excel VBA 0 Verilog 0 Git 0 Subversion 0 HTML 0 Assembly Skills  Top Skills 2 Python 2 Software Engineering 1 Linux 1 Perl 2 C 1 Automation 2 C++ 1 Hardware 1 Java 1 Nonprofits Carl also knows about... 0 SQL 0 Ruby 0 LaTeX 0 C# 0 Excel VBA 0 Verilog 0 Git 0 Subversion 0 HTML 0 Assembly Top Skills 2 Python 2 Software Engineering 1 Linux 1 Perl 2 C 1 Automation 2 C++ 1 Hardware 1 Java 1 Nonprofits Carl also knows about... 0 SQL 0 Ruby 0 LaTeX 0 C# 0 Excel VBA 0 Verilog 0 Git 0 Subversion 0 HTML 0 Assembly Top Skills 2 Python 2 Software Engineering 1 Linux 1 Perl 2 C 1 Automation 2 C++ 1 Hardware 1 Java 1 Nonprofits Carl also knows about... 0 SQL 0 Ruby 0 LaTeX 0 C# 0 Excel VBA 0 Verilog 0 Git 0 Subversion 0 HTML 0 Assembly                     0 SQL 0 Ruby 0 LaTeX 0 C# 0 Excel VBA 0 Verilog 0 Git 0 Subversion 0 HTML 0 Assembly Education Arizona State University BSE,  Computer Systems Engineering , 4.0 2010  – 2014 Mesa Community College AS,  General Studies , 3.9 2005  – 2008 Arizona State University BSE,  Computer Systems Engineering , 4.0 2010  – 2014 Arizona State University BSE,  Computer Systems Engineering , 4.0 2010  – 2014 Arizona State University BSE,  Computer Systems Engineering , 4.0 2010  – 2014 Mesa Community College AS,  General Studies , 3.9 2005  – 2008 Mesa Community College AS,  General Studies , 3.9 2005  – 2008 Mesa Community College AS,  General Studies , 3.9 2005  – 2008 Honors & Awards Recognized by Team Member Intel Corporation December 2014 Recognized by team member for helping resolve a networking issue with Simics. Recognized by Department Intel Corporation October 2014 Recognized for supporting enterprise workload characterization using the Simics full system simulator. Recognized by Group Intel Corporation September 2014 Recognized for supporting enterprise workload characterization using the Simics full system simulator. Recognized by Team Member Intel Corporation September 2014 Recognized by team member for supporting their work using the Simics full system simulator. Recognized by Team Member Intel Corporation July 2014 Recognized for helping identify and resolve a significant workload configuration issue. Recognized by Team Member Intel Corporation July 2014 Recognized for identifying improvements to Intel's memory latency checker. Recognized by Team Member Intel Corporation December 2014 Recognized by team member for helping resolve a networking issue with Simics. Recognized by Team Member Intel Corporation December 2014 Recognized by team member for helping resolve a networking issue with Simics. Recognized by Team Member Intel Corporation December 2014 Recognized by team member for helping resolve a networking issue with Simics. Recognized by Department Intel Corporation October 2014 Recognized for supporting enterprise workload characterization using the Simics full system simulator. Recognized by Department Intel Corporation October 2014 Recognized for supporting enterprise workload characterization using the Simics full system simulator. Recognized by Department Intel Corporation October 2014 Recognized for supporting enterprise workload characterization using the Simics full system simulator. Recognized by Group Intel Corporation September 2014 Recognized for supporting enterprise workload characterization using the Simics full system simulator. Recognized by Group Intel Corporation September 2014 Recognized for supporting enterprise workload characterization using the Simics full system simulator. Recognized by Group Intel Corporation September 2014 Recognized for supporting enterprise workload characterization using the Simics full system simulator. Recognized by Team Member Intel Corporation September 2014 Recognized by team member for supporting their work using the Simics full system simulator. Recognized by Team Member Intel Corporation September 2014 Recognized by team member for supporting their work using the Simics full system simulator. Recognized by Team Member Intel Corporation September 2014 Recognized by team member for supporting their work using the Simics full system simulator. Recognized by Team Member Intel Corporation July 2014 Recognized for helping identify and resolve a significant workload configuration issue. Recognized by Team Member Intel Corporation July 2014 Recognized for helping identify and resolve a significant workload configuration issue. Recognized by Team Member Intel Corporation July 2014 Recognized for helping identify and resolve a significant workload configuration issue. Recognized by Team Member Intel Corporation July 2014 Recognized for identifying improvements to Intel's memory latency checker. Recognized by Team Member Intel Corporation July 2014 Recognized for identifying improvements to Intel's memory latency checker. Recognized by Team Member Intel Corporation July 2014 Recognized for identifying improvements to Intel's memory latency checker. ", "Experience Engineer Intel Corporation December 2004  – Present (10 years 9 months) Engineering Intern Intel Corporation November 2003  –  December 2004  (1 year 2 months) Engineering Intern Intel Corporation June 2000  –  August 2000  (3 months) Engineer Intel Corporation December 2004  – Present (10 years 9 months) Engineer Intel Corporation December 2004  – Present (10 years 9 months) Engineering Intern Intel Corporation November 2003  –  December 2004  (1 year 2 months) Engineering Intern Intel Corporation November 2003  –  December 2004  (1 year 2 months) Engineering Intern Intel Corporation June 2000  –  August 2000  (3 months) Engineering Intern Intel Corporation June 2000  –  August 2000  (3 months) Skills Skills     Education Portland State University MS,  Electrical and Computer Engineering 2002  – 2004 University of Portland BS,  Electrical Engineering 1997  – 2001 Portland State University MS,  Electrical and Computer Engineering 2002  – 2004 Portland State University MS,  Electrical and Computer Engineering 2002  – 2004 Portland State University MS,  Electrical and Computer Engineering 2002  – 2004 University of Portland BS,  Electrical Engineering 1997  – 2001 University of Portland BS,  Electrical Engineering 1997  – 2001 University of Portland BS,  Electrical Engineering 1997  – 2001 ", "Experience SCDC Engineering Intern Intel Corporation May 2015  –  August 2015  (4 months) Santa Clara, CA Develop / modify systemVerilog OVM test sequences to verify functionality of the IDI to IOSF translator RTL block within the uncore for server products. \n \nDevelop scripts to facilitate test runs and identification of raised assertions. \n \nIntegrate Bus functional Models delivered into the existing test environment for peer to peer transactions. Post Si Validation Engineering Intern Intel Corporation May 2013  –  July 2014  (1 year 3 months) Folsom, Ca • Validate system level functionality of power management features in the chipset (Low-Power modes) \n• Work with Designers and Architects in order to root cause bugs in firmware, BIOS, and RTL \n• Develop python scripts to automate verification of pass/fail criteria \n• Program owner of correct chipset fusing for all SKUs \n• Validate signal timings and proper power gating and un-gating of the chipset’s logic blocks \n• Post-Si verification using Logic Analyzers, XDP, and On-Die debug tools Undergraduate Teaching Assistant University of Central Florida December 2012  –  May 2013  (6 months) University of Central Florida •\tExplain the fundamentals of Embedded System Design \n•\tDebug, Test, and validate student laboratory code \n•\tEvaluate Student performance based on the instructor guidelines \n•\tPrepare and Test Laboratory hardware prior to Lab sessions SCDC Engineering Intern Intel Corporation May 2015  –  August 2015  (4 months) Santa Clara, CA Develop / modify systemVerilog OVM test sequences to verify functionality of the IDI to IOSF translator RTL block within the uncore for server products. \n \nDevelop scripts to facilitate test runs and identification of raised assertions. \n \nIntegrate Bus functional Models delivered into the existing test environment for peer to peer transactions. SCDC Engineering Intern Intel Corporation May 2015  –  August 2015  (4 months) Santa Clara, CA Develop / modify systemVerilog OVM test sequences to verify functionality of the IDI to IOSF translator RTL block within the uncore for server products. \n \nDevelop scripts to facilitate test runs and identification of raised assertions. \n \nIntegrate Bus functional Models delivered into the existing test environment for peer to peer transactions. Post Si Validation Engineering Intern Intel Corporation May 2013  –  July 2014  (1 year 3 months) Folsom, Ca • Validate system level functionality of power management features in the chipset (Low-Power modes) \n• Work with Designers and Architects in order to root cause bugs in firmware, BIOS, and RTL \n• Develop python scripts to automate verification of pass/fail criteria \n• Program owner of correct chipset fusing for all SKUs \n• Validate signal timings and proper power gating and un-gating of the chipset’s logic blocks \n• Post-Si verification using Logic Analyzers, XDP, and On-Die debug tools Post Si Validation Engineering Intern Intel Corporation May 2013  –  July 2014  (1 year 3 months) Folsom, Ca • Validate system level functionality of power management features in the chipset (Low-Power modes) \n• Work with Designers and Architects in order to root cause bugs in firmware, BIOS, and RTL \n• Develop python scripts to automate verification of pass/fail criteria \n• Program owner of correct chipset fusing for all SKUs \n• Validate signal timings and proper power gating and un-gating of the chipset’s logic blocks \n• Post-Si verification using Logic Analyzers, XDP, and On-Die debug tools Undergraduate Teaching Assistant University of Central Florida December 2012  –  May 2013  (6 months) University of Central Florida •\tExplain the fundamentals of Embedded System Design \n•\tDebug, Test, and validate student laboratory code \n•\tEvaluate Student performance based on the instructor guidelines \n•\tPrepare and Test Laboratory hardware prior to Lab sessions Undergraduate Teaching Assistant University of Central Florida December 2012  –  May 2013  (6 months) University of Central Florida •\tExplain the fundamentals of Embedded System Design \n•\tDebug, Test, and validate student laboratory code \n•\tEvaluate Student performance based on the instructor guidelines \n•\tPrepare and Test Laboratory hardware prior to Lab sessions Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 3 Analog Circuit Design 0 Keysight ADS 13 Matlab 5 Python 1 Unix 0 Cadence 3 VLSI 0 Keysight momentum 6 Simulink 5 Digital Signal... Martin also knows about... 3 C++ 2 PSpice 3 Debugging 3 Embedded Systems 1 SystemVerilog 3 NI LabVIEW 3 Signal Processing 5 Multisim 8 Microsoft Office 1 RF Design 0 Code Composer Studio 0 EagleCAD 0 Eclipse 3 Engineering 0 OVM Skills  Top Skills 3 Analog Circuit Design 0 Keysight ADS 13 Matlab 5 Python 1 Unix 0 Cadence 3 VLSI 0 Keysight momentum 6 Simulink 5 Digital Signal... Martin also knows about... 3 C++ 2 PSpice 3 Debugging 3 Embedded Systems 1 SystemVerilog 3 NI LabVIEW 3 Signal Processing 5 Multisim 8 Microsoft Office 1 RF Design 0 Code Composer Studio 0 EagleCAD 0 Eclipse 3 Engineering 0 OVM Top Skills 3 Analog Circuit Design 0 Keysight ADS 13 Matlab 5 Python 1 Unix 0 Cadence 3 VLSI 0 Keysight momentum 6 Simulink 5 Digital Signal... Martin also knows about... 3 C++ 2 PSpice 3 Debugging 3 Embedded Systems 1 SystemVerilog 3 NI LabVIEW 3 Signal Processing 5 Multisim 8 Microsoft Office 1 RF Design 0 Code Composer Studio 0 EagleCAD 0 Eclipse 3 Engineering 0 OVM Top Skills 3 Analog Circuit Design 0 Keysight ADS 13 Matlab 5 Python 1 Unix 0 Cadence 3 VLSI 0 Keysight momentum 6 Simulink 5 Digital Signal... Martin also knows about... 3 C++ 2 PSpice 3 Debugging 3 Embedded Systems 1 SystemVerilog 3 NI LabVIEW 3 Signal Processing 5 Multisim 8 Microsoft Office 1 RF Design 0 Code Composer Studio 0 EagleCAD 0 Eclipse 3 Engineering 0 OVM                     3 C++ 2 PSpice 3 Debugging 3 Embedded Systems 1 SystemVerilog 3 NI LabVIEW 3 Signal Processing 5 Multisim 8 Microsoft Office 1 RF Design 0 Code Composer Studio 0 EagleCAD 0 Eclipse 3 Engineering 0 OVM Education Georgia Institute of Technology Master’s Degree,  Analog/RF IC design , 4.0 2014  – 2015 Activities and Societies:  IEEE Member University of Central Florida Bachelor's Degree,  Electrical engineering , Cum Laude 2008  – 2013 Minor in Mathematics Activities and Societies:  Eta Kappa Nu – Engineering High Honor Society Georgia Institute of Technology Master’s Degree,  Analog/RF IC design , 4.0 2014  – 2015 Activities and Societies:  IEEE Member Georgia Institute of Technology Master’s Degree,  Analog/RF IC design , 4.0 2014  – 2015 Activities and Societies:  IEEE Member Georgia Institute of Technology Master’s Degree,  Analog/RF IC design , 4.0 2014  – 2015 Activities and Societies:  IEEE Member University of Central Florida Bachelor's Degree,  Electrical engineering , Cum Laude 2008  – 2013 Minor in Mathematics Activities and Societies:  Eta Kappa Nu – Engineering High Honor Society University of Central Florida Bachelor's Degree,  Electrical engineering , Cum Laude 2008  – 2013 Minor in Mathematics Activities and Societies:  Eta Kappa Nu – Engineering High Honor Society University of Central Florida Bachelor's Degree,  Electrical engineering , Cum Laude 2008  – 2013 Minor in Mathematics Activities and Societies:  Eta Kappa Nu – Engineering High Honor Society Honors & Awards GEM Fellow Intel Corporation & Georgia Institute of Technology August 2014 GEM Employers sponsor highly qualified fellowship applicants to matriculate in a STEM graduate program by providing a contribution of $22,500 per student and paid internships. GEM Fellow Intel Corporation & Georgia Institute of Technology August 2014 GEM Employers sponsor highly qualified fellowship applicants to matriculate in a STEM graduate program by providing a contribution of $22,500 per student and paid internships. GEM Fellow Intel Corporation & Georgia Institute of Technology August 2014 GEM Employers sponsor highly qualified fellowship applicants to matriculate in a STEM graduate program by providing a contribution of $22,500 per student and paid internships. GEM Fellow Intel Corporation & Georgia Institute of Technology August 2014 GEM Employers sponsor highly qualified fellowship applicants to matriculate in a STEM graduate program by providing a contribution of $22,500 per student and paid internships. ", "Summary I am a PhD student in Electrical and Computer Engineering at UC Davis. Summary I am a PhD student in Electrical and Computer Engineering at UC Davis. I am a PhD student in Electrical and Computer Engineering at UC Davis. I am a PhD student in Electrical and Computer Engineering at UC Davis. Experience Graduate Student UC Davis September 2011  – Present (4 years) Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Water Resources Intern San Antonio Water System June 2011  –  August 2011  (3 months) San Antonio, Texas Area NSF Research Experience for Undergraduates University of Houston May 2009  –  July 2009  (3 months) Graduate Student UC Davis September 2011  – Present (4 years) Graduate Student UC Davis September 2011  – Present (4 years) Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Water Resources Intern San Antonio Water System June 2011  –  August 2011  (3 months) San Antonio, Texas Area Water Resources Intern San Antonio Water System June 2011  –  August 2011  (3 months) San Antonio, Texas Area NSF Research Experience for Undergraduates University of Houston May 2009  –  July 2009  (3 months) NSF Research Experience for Undergraduates University of Houston May 2009  –  July 2009  (3 months) Skills Skills     Education University of California, Davis 2011  – 2016 Trinity University BS, BA,  Engineering Science ,  Physics 2007  – 2011 Activities and Societies:  SWE ,  Water Polo ,  Graffiti Wipeout ,  IEEE ,  Cat Alliance University of California, Davis 2011  – 2016 University of California, Davis 2011  – 2016 University of California, Davis 2011  – 2016 Trinity University BS, BA,  Engineering Science ,  Physics 2007  – 2011 Activities and Societies:  SWE ,  Water Polo ,  Graffiti Wipeout ,  IEEE ,  Cat Alliance Trinity University BS, BA,  Engineering Science ,  Physics 2007  – 2011 Activities and Societies:  SWE ,  Water Polo ,  Graffiti Wipeout ,  IEEE ,  Cat Alliance Trinity University BS, BA,  Engineering Science ,  Physics 2007  – 2011 Activities and Societies:  SWE ,  Water Polo ,  Graffiti Wipeout ,  IEEE ,  Cat Alliance ", "Experience Research and Development Associate Engineer (Intern) W2BI, Inc. (a member of the Advantest Group) June 2015  – Present (3 months) San Jose, CA Android Support/QA Testing WeVideo January 2014  –  September 2014  (9 months) Moutain View, CA Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Folsom, CA Software Engineering Intern Intel Corporation May 2012  –  August 2012  (4 months) Research and Development Associate Engineer (Intern) W2BI, Inc. (a member of the Advantest Group) June 2015  – Present (3 months) San Jose, CA Research and Development Associate Engineer (Intern) W2BI, Inc. (a member of the Advantest Group) June 2015  – Present (3 months) San Jose, CA Android Support/QA Testing WeVideo January 2014  –  September 2014  (9 months) Moutain View, CA Android Support/QA Testing WeVideo January 2014  –  September 2014  (9 months) Moutain View, CA Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Folsom, CA Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Folsom, CA Software Engineering Intern Intel Corporation May 2012  –  August 2012  (4 months) Software Engineering Intern Intel Corporation May 2012  –  August 2012  (4 months) Skills Verilog Debugging Embedded Systems VHDL Device Drivers SoC C FPGA Computer Architecture Python TCL Programming Team Leadership C++ Skills  Verilog Debugging Embedded Systems VHDL Device Drivers SoC C FPGA Computer Architecture Python TCL Programming Team Leadership C++ Verilog Debugging Embedded Systems VHDL Device Drivers SoC C FPGA Computer Architecture Python TCL Programming Team Leadership C++ Verilog Debugging Embedded Systems VHDL Device Drivers SoC C FPGA Computer Architecture Python TCL Programming Team Leadership C++ Education Santa Clara University Computer Science and Engineering 2013  – 2016 California Baptist University 2011  – 2012 Folsom Lake College 2010  – 2011 La Sierra University 2013 Santa Clara University Computer Science and Engineering 2013  – 2016 Santa Clara University Computer Science and Engineering 2013  – 2016 Santa Clara University Computer Science and Engineering 2013  – 2016 California Baptist University 2011  – 2012 California Baptist University 2011  – 2012 California Baptist University 2011  – 2012 Folsom Lake College 2010  – 2011 Folsom Lake College 2010  – 2011 Folsom Lake College 2010  – 2011 La Sierra University 2013 La Sierra University 2013 La Sierra University 2013 ", "Summary I am a hard working and determined student at Wartburg College, majoring in Computer Science. I have a significant amount of Internship experience that has been monumental for the development of my engineering and communication skills. Summary I am a hard working and determined student at Wartburg College, majoring in Computer Science. I have a significant amount of Internship experience that has been monumental for the development of my engineering and communication skills. I am a hard working and determined student at Wartburg College, majoring in Computer Science. I have a significant amount of Internship experience that has been monumental for the development of my engineering and communication skills. I am a hard working and determined student at Wartburg College, majoring in Computer Science. I have a significant amount of Internship experience that has been monumental for the development of my engineering and communication skills. Experience Undergrad Software Engineering Intern Intel Corporation June 2015  – Present (3 months) Folsom, California Utilizing the robust programming language of Python, and more specifically, the PyVisa library, I am automating several engineering tools(oscilloscope, network analyzer, external power supply). Through enabling the automation of these tools, I have saved many hours of, what would be, in-person debugging on computer memory technologies. \n \nI am also in charge of low power DDR3 and DDR4 memory test execution, as well as automating the validation and failure characterization of those devices. The automation is done via a Python program which parses the log file and organizes the data in a logical and easy to understand matter. The program then produces a very readable excel report. Web Developer Intern Field Squared January 2015  –  April 2015  (4 months) Denver, CO At Field Squared I worked on the Web App aspect of their product, fixing bugs and defects, and also implementing requested features. \n \nWhile working here, I am contributed many client side AngularJS (JavaScript), HTML and CSS bug fixes in a fast paced development environment. Undergraduate Software Engineering Intern Intel Corporation May 2014  –  December 2014  (8 months) Folsom, CA I worked in Test and Validation for PMO(Platform Memory Operations). PMO works with memory suppliers to help test, develop, and validate computer memory.  \n \nWhile at Intel: \n \n• Conducted functional and environmental tests on Dynamic Random-Access \nMemory (DRAM) chips, in Platform Memory Operations. \n• Automated validation processes by developing Python scripts, reducing task \ntime from 3 hours to 0 hours per chip. \n• Developed test flow code that helps test and debug DRAM chips, using C/C++. \n• Enabled remote control over environmental testing through a GPIB cable, and \nworked on a C program that allowed for scripting the temperature changes. Software Engineering Undergraduate Intern Rockwell Collins August 2011  –  March 2014  (2 years 8 months) Cedar Rapids, Iowa Area At Rockwell Collins I started out in the high school internship program. It was a select program that gave Juniors and Seniors in highschoolers a chance to intern with several groups at Rockwell. After I graduated high school my position changed to a software engineering undergrad intern. Between the various groups i interned with, I learned a lot of technical and soft skills. \n \nSome achievements are: \n• Obtained a United States Government security clearance in order to \nautomate classified XML data retrieval and testing, using Java. \n• Helped to create a streamlined Linux development environment that nearly \neliminated the lengthy process of setting up a working environment for the \ntarget hardware. \n• Wrote a front-end in Java for the UCC (Unified Code Count) tool, which \nhelped to drastically reduce user interaction time amongst team members. \n• Wrote Python scripts that simulated communication between a Rockwell \nCollins product and an airport’s ground control which helped release the \nproduct within its intended schedule. \n• Participant of a select high school internship program from 2011 to 2012. Undergrad Software Engineering Intern Intel Corporation June 2015  – Present (3 months) Folsom, California Utilizing the robust programming language of Python, and more specifically, the PyVisa library, I am automating several engineering tools(oscilloscope, network analyzer, external power supply). Through enabling the automation of these tools, I have saved many hours of, what would be, in-person debugging on computer memory technologies. \n \nI am also in charge of low power DDR3 and DDR4 memory test execution, as well as automating the validation and failure characterization of those devices. The automation is done via a Python program which parses the log file and organizes the data in a logical and easy to understand matter. The program then produces a very readable excel report. Undergrad Software Engineering Intern Intel Corporation June 2015  – Present (3 months) Folsom, California Utilizing the robust programming language of Python, and more specifically, the PyVisa library, I am automating several engineering tools(oscilloscope, network analyzer, external power supply). Through enabling the automation of these tools, I have saved many hours of, what would be, in-person debugging on computer memory technologies. \n \nI am also in charge of low power DDR3 and DDR4 memory test execution, as well as automating the validation and failure characterization of those devices. The automation is done via a Python program which parses the log file and organizes the data in a logical and easy to understand matter. The program then produces a very readable excel report. Web Developer Intern Field Squared January 2015  –  April 2015  (4 months) Denver, CO At Field Squared I worked on the Web App aspect of their product, fixing bugs and defects, and also implementing requested features. \n \nWhile working here, I am contributed many client side AngularJS (JavaScript), HTML and CSS bug fixes in a fast paced development environment. Web Developer Intern Field Squared January 2015  –  April 2015  (4 months) Denver, CO At Field Squared I worked on the Web App aspect of their product, fixing bugs and defects, and also implementing requested features. \n \nWhile working here, I am contributed many client side AngularJS (JavaScript), HTML and CSS bug fixes in a fast paced development environment. Undergraduate Software Engineering Intern Intel Corporation May 2014  –  December 2014  (8 months) Folsom, CA I worked in Test and Validation for PMO(Platform Memory Operations). PMO works with memory suppliers to help test, develop, and validate computer memory.  \n \nWhile at Intel: \n \n• Conducted functional and environmental tests on Dynamic Random-Access \nMemory (DRAM) chips, in Platform Memory Operations. \n• Automated validation processes by developing Python scripts, reducing task \ntime from 3 hours to 0 hours per chip. \n• Developed test flow code that helps test and debug DRAM chips, using C/C++. \n• Enabled remote control over environmental testing through a GPIB cable, and \nworked on a C program that allowed for scripting the temperature changes. Undergraduate Software Engineering Intern Intel Corporation May 2014  –  December 2014  (8 months) Folsom, CA I worked in Test and Validation for PMO(Platform Memory Operations). PMO works with memory suppliers to help test, develop, and validate computer memory.  \n \nWhile at Intel: \n \n• Conducted functional and environmental tests on Dynamic Random-Access \nMemory (DRAM) chips, in Platform Memory Operations. \n• Automated validation processes by developing Python scripts, reducing task \ntime from 3 hours to 0 hours per chip. \n• Developed test flow code that helps test and debug DRAM chips, using C/C++. \n• Enabled remote control over environmental testing through a GPIB cable, and \nworked on a C program that allowed for scripting the temperature changes. Software Engineering Undergraduate Intern Rockwell Collins August 2011  –  March 2014  (2 years 8 months) Cedar Rapids, Iowa Area At Rockwell Collins I started out in the high school internship program. It was a select program that gave Juniors and Seniors in highschoolers a chance to intern with several groups at Rockwell. After I graduated high school my position changed to a software engineering undergrad intern. Between the various groups i interned with, I learned a lot of technical and soft skills. \n \nSome achievements are: \n• Obtained a United States Government security clearance in order to \nautomate classified XML data retrieval and testing, using Java. \n• Helped to create a streamlined Linux development environment that nearly \neliminated the lengthy process of setting up a working environment for the \ntarget hardware. \n• Wrote a front-end in Java for the UCC (Unified Code Count) tool, which \nhelped to drastically reduce user interaction time amongst team members. \n• Wrote Python scripts that simulated communication between a Rockwell \nCollins product and an airport’s ground control which helped release the \nproduct within its intended schedule. \n• Participant of a select high school internship program from 2011 to 2012. Software Engineering Undergraduate Intern Rockwell Collins August 2011  –  March 2014  (2 years 8 months) Cedar Rapids, Iowa Area At Rockwell Collins I started out in the high school internship program. It was a select program that gave Juniors and Seniors in highschoolers a chance to intern with several groups at Rockwell. After I graduated high school my position changed to a software engineering undergrad intern. Between the various groups i interned with, I learned a lot of technical and soft skills. \n \nSome achievements are: \n• Obtained a United States Government security clearance in order to \nautomate classified XML data retrieval and testing, using Java. \n• Helped to create a streamlined Linux development environment that nearly \neliminated the lengthy process of setting up a working environment for the \ntarget hardware. \n• Wrote a front-end in Java for the UCC (Unified Code Count) tool, which \nhelped to drastically reduce user interaction time amongst team members. \n• Wrote Python scripts that simulated communication between a Rockwell \nCollins product and an airport’s ground control which helped release the \nproduct within its intended schedule. \n• Participant of a select high school internship program from 2011 to 2012. Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Software Engineering Python C++ Testing Linux Web Development JavaScript HTML5 Test Automation AngularJS jQuery Automation Team Leadership People Skills Object Oriented Design Java GUI development Microsoft Office See 3+     See less Skills  Software Engineering Python C++ Testing Linux Web Development JavaScript HTML5 Test Automation AngularJS jQuery Automation Team Leadership People Skills Object Oriented Design Java GUI development Microsoft Office See 3+     See less Software Engineering Python C++ Testing Linux Web Development JavaScript HTML5 Test Automation AngularJS jQuery Automation Team Leadership People Skills Object Oriented Design Java GUI development Microsoft Office See 3+     See less Software Engineering Python C++ Testing Linux Web Development JavaScript HTML5 Test Automation AngularJS jQuery Automation Team Leadership People Skills Object Oriented Design Java GUI development Microsoft Office See 3+     See less Education Wartburg College Bachelor's Degree,  Computer Science , Junior 2012  – 2016 Wartburg College is a small, liberal arts college in Waverly, Iowa. Here, I am pursuing my degree in Computer Science. Activities and Societies:  Symphonic Band ,  and private lessons for Alto Saxophone.\nWartburg Service trips. Linn-mar High School Wartburg College Bachelor's Degree,  Computer Science , Junior 2012  – 2016 Wartburg College is a small, liberal arts college in Waverly, Iowa. Here, I am pursuing my degree in Computer Science. Activities and Societies:  Symphonic Band ,  and private lessons for Alto Saxophone.\nWartburg Service trips. Wartburg College Bachelor's Degree,  Computer Science , Junior 2012  – 2016 Wartburg College is a small, liberal arts college in Waverly, Iowa. Here, I am pursuing my degree in Computer Science. Activities and Societies:  Symphonic Band ,  and private lessons for Alto Saxophone.\nWartburg Service trips. Wartburg College Bachelor's Degree,  Computer Science , Junior 2012  – 2016 Wartburg College is a small, liberal arts college in Waverly, Iowa. Here, I am pursuing my degree in Computer Science. Activities and Societies:  Symphonic Band ,  and private lessons for Alto Saxophone.\nWartburg Service trips. Linn-mar High School Linn-mar High School Linn-mar High School Honors & Awards ", "Summary Results-oriented engineer with solid grasp of embedded system design, software/ hardware interfacing, and several programming languages. Takes pride in being a team player, strategic innovator, and an entrepreneurial spirit. Consistently earned outstanding reviews from the four prior internships at Intel. Has led multi-disciplinary teams, produced award-winning publications, and received recognition at start-up events. Available full-time from 06/13. Summary Results-oriented engineer with solid grasp of embedded system design, software/ hardware interfacing, and several programming languages. Takes pride in being a team player, strategic innovator, and an entrepreneurial spirit. Consistently earned outstanding reviews from the four prior internships at Intel. Has led multi-disciplinary teams, produced award-winning publications, and received recognition at start-up events. Available full-time from 06/13. Results-oriented engineer with solid grasp of embedded system design, software/ hardware interfacing, and several programming languages. Takes pride in being a team player, strategic innovator, and an entrepreneurial spirit. Consistently earned outstanding reviews from the four prior internships at Intel. Has led multi-disciplinary teams, produced award-winning publications, and received recognition at start-up events. Available full-time from 06/13. Results-oriented engineer with solid grasp of embedded system design, software/ hardware interfacing, and several programming languages. Takes pride in being a team player, strategic innovator, and an entrepreneurial spirit. Consistently earned outstanding reviews from the four prior internships at Intel. Has led multi-disciplinary teams, produced award-winning publications, and received recognition at start-up events. Available full-time from 06/13. Experience Software Performance Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, OR CEO and Founder PressVi January 2012  – Present (3 years 8 months) Portland, OR Intel Architecture Group (IAG) – BIOS Engineering Intern Intel Corporation July 2012  –  December 2012  (6 months) Hillsboro, OR - Pioneered a novel methodology for BIOS performance testing on Haswell client reference boards by automating flashing and booting (from S3, S4, warm boot and cold boot power states). This solution provides real-time feedback on code check-ins, accelerates throughput, and saves countless team hours. \n \n- Created a code formatter tool to standardize BIOS code per EDKII C standards. This solution saves hundreds of hours of code reviews and delivers a high quality output to PC OEM/ODM customers. Intel Software Services Group (SSG) – Win8 Application Engineering Intern Intel Corporation April 2012  –  July 2012  (4 months) Hillsboro, OR - Designed and delivered ‘Intel Dash’ – a Win8 Modern UI App – with custom push notifications, which integrates PC consumer’s digital life on a single dashboard, aggregating Google News, Weather, Gmail, Facebook, Twitter, Flickr, and Groupon using Node.js. Received accolades from Intel Senior Management. Intel Architecture Group (IAG) – Software Engineering Intern Intel Corporation June 2010  –  December 2010  (7 months) Hillsboro, OR - Built Intel’s ‘SoftwarePedia’ site, using AJAX and DOM control with JavaScript to create a dynamic framework; wrote a migration tool in PHP to port format intact pages into the Confluence enterprise Wiki. SoftwarePedia is now a central repository of all Intel software knowledge and is in extensive use. Intel Architecture Group (IAG) – System on Chip (SoC) Design Intern Intel Corporation February 2009  –  September 2009  (8 months) Hillsboro, OR - Developed a secure web Document Management System (DMS) from concept, using PHP to dynamically generate HTML and JavaScript pages. This is being used for IP and specification documents organization. Software Performance Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, OR Software Performance Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, OR CEO and Founder PressVi January 2012  – Present (3 years 8 months) Portland, OR CEO and Founder PressVi January 2012  – Present (3 years 8 months) Portland, OR Intel Architecture Group (IAG) – BIOS Engineering Intern Intel Corporation July 2012  –  December 2012  (6 months) Hillsboro, OR - Pioneered a novel methodology for BIOS performance testing on Haswell client reference boards by automating flashing and booting (from S3, S4, warm boot and cold boot power states). This solution provides real-time feedback on code check-ins, accelerates throughput, and saves countless team hours. \n \n- Created a code formatter tool to standardize BIOS code per EDKII C standards. This solution saves hundreds of hours of code reviews and delivers a high quality output to PC OEM/ODM customers. Intel Architecture Group (IAG) – BIOS Engineering Intern Intel Corporation July 2012  –  December 2012  (6 months) Hillsboro, OR - Pioneered a novel methodology for BIOS performance testing on Haswell client reference boards by automating flashing and booting (from S3, S4, warm boot and cold boot power states). This solution provides real-time feedback on code check-ins, accelerates throughput, and saves countless team hours. \n \n- Created a code formatter tool to standardize BIOS code per EDKII C standards. This solution saves hundreds of hours of code reviews and delivers a high quality output to PC OEM/ODM customers. Intel Software Services Group (SSG) – Win8 Application Engineering Intern Intel Corporation April 2012  –  July 2012  (4 months) Hillsboro, OR - Designed and delivered ‘Intel Dash’ – a Win8 Modern UI App – with custom push notifications, which integrates PC consumer’s digital life on a single dashboard, aggregating Google News, Weather, Gmail, Facebook, Twitter, Flickr, and Groupon using Node.js. Received accolades from Intel Senior Management. Intel Software Services Group (SSG) – Win8 Application Engineering Intern Intel Corporation April 2012  –  July 2012  (4 months) Hillsboro, OR - Designed and delivered ‘Intel Dash’ – a Win8 Modern UI App – with custom push notifications, which integrates PC consumer’s digital life on a single dashboard, aggregating Google News, Weather, Gmail, Facebook, Twitter, Flickr, and Groupon using Node.js. Received accolades from Intel Senior Management. Intel Architecture Group (IAG) – Software Engineering Intern Intel Corporation June 2010  –  December 2010  (7 months) Hillsboro, OR - Built Intel’s ‘SoftwarePedia’ site, using AJAX and DOM control with JavaScript to create a dynamic framework; wrote a migration tool in PHP to port format intact pages into the Confluence enterprise Wiki. SoftwarePedia is now a central repository of all Intel software knowledge and is in extensive use. Intel Architecture Group (IAG) – Software Engineering Intern Intel Corporation June 2010  –  December 2010  (7 months) Hillsboro, OR - Built Intel’s ‘SoftwarePedia’ site, using AJAX and DOM control with JavaScript to create a dynamic framework; wrote a migration tool in PHP to port format intact pages into the Confluence enterprise Wiki. SoftwarePedia is now a central repository of all Intel software knowledge and is in extensive use. Intel Architecture Group (IAG) – System on Chip (SoC) Design Intern Intel Corporation February 2009  –  September 2009  (8 months) Hillsboro, OR - Developed a secure web Document Management System (DMS) from concept, using PHP to dynamically generate HTML and JavaScript pages. This is being used for IP and specification documents organization. Intel Architecture Group (IAG) – System on Chip (SoC) Design Intern Intel Corporation February 2009  –  September 2009  (8 months) Hillsboro, OR - Developed a secure web Document Management System (DMS) from concept, using PHP to dynamically generate HTML and JavaScript pages. This is being used for IP and specification documents organization. Skills Verilog Computer Architecture SoC FPGA Circuit Design C Java Semiconductors HTML JavaScript Debugging Matlab C++ Logic Design Python Microsoft SQL Server Quartus Embedded Systems PHP CSS Algorithms AJAX Processors C# Perl Device Drivers See 11+     See less Skills  Verilog Computer Architecture SoC FPGA Circuit Design C Java Semiconductors HTML JavaScript Debugging Matlab C++ Logic Design Python Microsoft SQL Server Quartus Embedded Systems PHP CSS Algorithms AJAX Processors C# Perl Device Drivers See 11+     See less Verilog Computer Architecture SoC FPGA Circuit Design C Java Semiconductors HTML JavaScript Debugging Matlab C++ Logic Design Python Microsoft SQL Server Quartus Embedded Systems PHP CSS Algorithms AJAX Processors C# Perl Device Drivers See 11+     See less Verilog Computer Architecture SoC FPGA Circuit Design C Java Semiconductors HTML JavaScript Debugging Matlab C++ Logic Design Python Microsoft SQL Server Quartus Embedded Systems PHP CSS Algorithms AJAX Processors C# Perl Device Drivers See 11+     See less Education Portland State University BS,  Computer Engineering 2011  – 2013 Activities and Societies:  Co-Author of 5 papers University of California, Santa Barbara BS,  Computer Engineering 2009  – 2011 Activities and Societies:  Dean's Honors; Co-Author of 3 papers Portland State University BS,  Computer Engineering 2011  – 2013 Activities and Societies:  Co-Author of 5 papers Portland State University BS,  Computer Engineering 2011  – 2013 Activities and Societies:  Co-Author of 5 papers Portland State University BS,  Computer Engineering 2011  – 2013 Activities and Societies:  Co-Author of 5 papers University of California, Santa Barbara BS,  Computer Engineering 2009  – 2011 Activities and Societies:  Dean's Honors; Co-Author of 3 papers University of California, Santa Barbara BS,  Computer Engineering 2009  – 2011 Activities and Societies:  Dean's Honors; Co-Author of 3 papers University of California, Santa Barbara BS,  Computer Engineering 2009  – 2011 Activities and Societies:  Dean's Honors; Co-Author of 3 papers Honors & Awards ", "Skills Software Engineering Debugging Electrical Engineering Hardware Engineering Verilog FPGA Image Processing Simulations High Performance... Algorthms Compiler Optimization Skills  Software Engineering Debugging Electrical Engineering Hardware Engineering Verilog FPGA Image Processing Simulations High Performance... Algorthms Compiler Optimization Software Engineering Debugging Electrical Engineering Hardware Engineering Verilog FPGA Image Processing Simulations High Performance... Algorthms Compiler Optimization Software Engineering Debugging Electrical Engineering Hardware Engineering Verilog FPGA Image Processing Simulations High Performance... Algorthms Compiler Optimization ", "Experience Software Engineer Intel Corporation June 2014  – Present (1 year 3 months) Santa Clara Software Engineer Intel Corporation June 2014  – Present (1 year 3 months) Santa Clara Software Engineer Intel Corporation June 2014  – Present (1 year 3 months) Santa Clara Languages   Skills Skills     Education University of Southern California Master of Science (MS) 2012  – 2014 P. E. S. Institute of Technology Bachelor of Engineering 2004  – 2008 University of Southern California Master of Science (MS) 2012  – 2014 University of Southern California Master of Science (MS) 2012  – 2014 University of Southern California Master of Science (MS) 2012  – 2014 P. E. S. Institute of Technology Bachelor of Engineering 2004  – 2008 P. E. S. Institute of Technology Bachelor of Engineering 2004  – 2008 P. E. S. Institute of Technology Bachelor of Engineering 2004  – 2008 ", "Summary Graduate student at Portland State University seeking opportunities in Digital IC Design, ASIC Design, RTL Design, Architecture, Verification and Validation areas. \n \nI'm seeking a role in Hardware Engineering field that would allow me to apply skills and knowledge obtained in my coursework and also get exposed to industry level applications of my skills.  \n \nProficient Coding skills in C++, PERL and VERILOG HDL.  \n \nExperience with EDA tools viz. Xilinx ISE , ModelSim and Cadence Virtuoso. Experience with version control tools, Git Hub and Changeman. Worked on Windows and Unix environments. \n \nKnowledge of Computer Architecture, Microprocessor System Design, Digital Integrated Circuit Design ASIC Design. Summary Graduate student at Portland State University seeking opportunities in Digital IC Design, ASIC Design, RTL Design, Architecture, Verification and Validation areas. \n \nI'm seeking a role in Hardware Engineering field that would allow me to apply skills and knowledge obtained in my coursework and also get exposed to industry level applications of my skills.  \n \nProficient Coding skills in C++, PERL and VERILOG HDL.  \n \nExperience with EDA tools viz. Xilinx ISE , ModelSim and Cadence Virtuoso. Experience with version control tools, Git Hub and Changeman. Worked on Windows and Unix environments. \n \nKnowledge of Computer Architecture, Microprocessor System Design, Digital Integrated Circuit Design ASIC Design. Graduate student at Portland State University seeking opportunities in Digital IC Design, ASIC Design, RTL Design, Architecture, Verification and Validation areas. \n \nI'm seeking a role in Hardware Engineering field that would allow me to apply skills and knowledge obtained in my coursework and also get exposed to industry level applications of my skills.  \n \nProficient Coding skills in C++, PERL and VERILOG HDL.  \n \nExperience with EDA tools viz. Xilinx ISE , ModelSim and Cadence Virtuoso. Experience with version control tools, Git Hub and Changeman. Worked on Windows and Unix environments. \n \nKnowledge of Computer Architecture, Microprocessor System Design, Digital Integrated Circuit Design ASIC Design. Graduate student at Portland State University seeking opportunities in Digital IC Design, ASIC Design, RTL Design, Architecture, Verification and Validation areas. \n \nI'm seeking a role in Hardware Engineering field that would allow me to apply skills and knowledge obtained in my coursework and also get exposed to industry level applications of my skills.  \n \nProficient Coding skills in C++, PERL and VERILOG HDL.  \n \nExperience with EDA tools viz. Xilinx ISE , ModelSim and Cadence Virtuoso. Experience with version control tools, Git Hub and Changeman. Worked on Windows and Unix environments. \n \nKnowledge of Computer Architecture, Microprocessor System Design, Digital Integrated Circuit Design ASIC Design. Experience System Validation Engineering Intern Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Involved in DFX IP design and development using system Verilog. Responsible for the setup of FPGA tools and development board, which was used in clock jitter analysis IP development.Designed and developed multiple system clock architectures using Xilinx’s MMCM and clock buffering schemes, which were characterize with the developed IP.  \nCharacterized the implemented clock architecture with TEK DPOjet jitter software and with JBert test equipment.Validated the design with VCS simulator using numerous simulation test cases and created various unix scripts related to post processing of the data. \nProfessionally documented project requirements and best-known-methods for FPGA Prototyping. \nExperience with Synopsys VCS, Vivado Design Suite, Matlab, Python, and Unix shell scripts during the internship. \n \n Graphics Hardware Engineering Intern Intel Corporation October 2014  –  December 2014  (3 months) Folsom, California Area Pre-Silicon validation of Graphics subsystems. \nDeveloped and enabled testing of new RTL designs for HDCP encryption protocols. \nValidated upcoming ultra-HD 5K video standards using Ruby scripting and RTL emulation. \nCreated a binary file parsing tool in Perl to analyze Wigig audio packet structure and contents. \nProfessionally documented project requirements and best-known-methods for the team wiki page. Systems Engineer Infosys Technologies Ltd June 2011  –  August 2013  (2 years 3 months) Bangalore Worked as a software developer and provided L3 production support. Involved in minor and major enhancements to the existing production code and also in development area, unit testing, debugging and fixing bugs in existing production code. System Validation Engineering Intern Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Involved in DFX IP design and development using system Verilog. Responsible for the setup of FPGA tools and development board, which was used in clock jitter analysis IP development.Designed and developed multiple system clock architectures using Xilinx’s MMCM and clock buffering schemes, which were characterize with the developed IP.  \nCharacterized the implemented clock architecture with TEK DPOjet jitter software and with JBert test equipment.Validated the design with VCS simulator using numerous simulation test cases and created various unix scripts related to post processing of the data. \nProfessionally documented project requirements and best-known-methods for FPGA Prototyping. \nExperience with Synopsys VCS, Vivado Design Suite, Matlab, Python, and Unix shell scripts during the internship. \n \n System Validation Engineering Intern Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Involved in DFX IP design and development using system Verilog. Responsible for the setup of FPGA tools and development board, which was used in clock jitter analysis IP development.Designed and developed multiple system clock architectures using Xilinx’s MMCM and clock buffering schemes, which were characterize with the developed IP.  \nCharacterized the implemented clock architecture with TEK DPOjet jitter software and with JBert test equipment.Validated the design with VCS simulator using numerous simulation test cases and created various unix scripts related to post processing of the data. \nProfessionally documented project requirements and best-known-methods for FPGA Prototyping. \nExperience with Synopsys VCS, Vivado Design Suite, Matlab, Python, and Unix shell scripts during the internship. \n \n Graphics Hardware Engineering Intern Intel Corporation October 2014  –  December 2014  (3 months) Folsom, California Area Pre-Silicon validation of Graphics subsystems. \nDeveloped and enabled testing of new RTL designs for HDCP encryption protocols. \nValidated upcoming ultra-HD 5K video standards using Ruby scripting and RTL emulation. \nCreated a binary file parsing tool in Perl to analyze Wigig audio packet structure and contents. \nProfessionally documented project requirements and best-known-methods for the team wiki page. Graphics Hardware Engineering Intern Intel Corporation October 2014  –  December 2014  (3 months) Folsom, California Area Pre-Silicon validation of Graphics subsystems. \nDeveloped and enabled testing of new RTL designs for HDCP encryption protocols. \nValidated upcoming ultra-HD 5K video standards using Ruby scripting and RTL emulation. \nCreated a binary file parsing tool in Perl to analyze Wigig audio packet structure and contents. \nProfessionally documented project requirements and best-known-methods for the team wiki page. Systems Engineer Infosys Technologies Ltd June 2011  –  August 2013  (2 years 3 months) Bangalore Worked as a software developer and provided L3 production support. Involved in minor and major enhancements to the existing production code and also in development area, unit testing, debugging and fixing bugs in existing production code. Systems Engineer Infosys Technologies Ltd June 2011  –  August 2013  (2 years 3 months) Bangalore Worked as a software developer and provided L3 production support. Involved in minor and major enhancements to the existing production code and also in development area, unit testing, debugging and fixing bugs in existing production code. Languages Telugu Native or bilingual proficiency Hindi Elementary proficiency Kannada Native or bilingual proficiency English Full professional proficiency Telugu Native or bilingual proficiency Hindi Elementary proficiency Kannada Native or bilingual proficiency English Full professional proficiency Telugu Native or bilingual proficiency Hindi Elementary proficiency Kannada Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Elementary proficiency Native or bilingual proficiency Full professional proficiency Skills Verilog ModelSim Debugging COBOL Cadence Virtuoso C++ Mainframe RTL design Computer Architecture Linux ASIC Integrated Circuit... Unix Perl Microprocessors EDA Xilinx ISE Github RTL Design See 4+     See less Skills  Verilog ModelSim Debugging COBOL Cadence Virtuoso C++ Mainframe RTL design Computer Architecture Linux ASIC Integrated Circuit... Unix Perl Microprocessors EDA Xilinx ISE Github RTL Design See 4+     See less Verilog ModelSim Debugging COBOL Cadence Virtuoso C++ Mainframe RTL design Computer Architecture Linux ASIC Integrated Circuit... Unix Perl Microprocessors EDA Xilinx ISE Github RTL Design See 4+     See less Verilog ModelSim Debugging COBOL Cadence Virtuoso C++ Mainframe RTL design Computer Architecture Linux ASIC Integrated Circuit... Unix Perl Microprocessors EDA Xilinx ISE Github RTL Design See 4+     See less Education Portland State University Graduate,  Electrical and Computer Engineering 2014  – 2015 Atria Institute Of Technology Bachelor's Degree,  Telecommunications Engineering , 84% 2007  – 2011 Stands 8th in VTU for telecommunication engineering in Karnataka Portland State University Graduate,  Electrical and Computer Engineering 2014  – 2015 Portland State University Graduate,  Electrical and Computer Engineering 2014  – 2015 Portland State University Graduate,  Electrical and Computer Engineering 2014  – 2015 Atria Institute Of Technology Bachelor's Degree,  Telecommunications Engineering , 84% 2007  – 2011 Stands 8th in VTU for telecommunication engineering in Karnataka Atria Institute Of Technology Bachelor's Degree,  Telecommunications Engineering , 84% 2007  – 2011 Stands 8th in VTU for telecommunication engineering in Karnataka Atria Institute Of Technology Bachelor's Degree,  Telecommunications Engineering , 84% 2007  – 2011 Stands 8th in VTU for telecommunication engineering in Karnataka Honors & Awards University Rank Holder Visvesvaraya Technological University, India June 2011 Stands 8th rank in university for Telecommunication Engineering for the year 2007-2011 \n \nCollege Webpage For Achievements : http://www.atria.edu/Achievements.html University Rank Holder Visvesvaraya Technological University, India June 2011 Stands 8th rank in university for Telecommunication Engineering for the year 2007-2011 \n \nCollege Webpage For Achievements : http://www.atria.edu/Achievements.html University Rank Holder Visvesvaraya Technological University, India June 2011 Stands 8th rank in university for Telecommunication Engineering for the year 2007-2011 \n \nCollege Webpage For Achievements : http://www.atria.edu/Achievements.html University Rank Holder Visvesvaraya Technological University, India June 2011 Stands 8th rank in university for Telecommunication Engineering for the year 2007-2011 \n \nCollege Webpage For Achievements : http://www.atria.edu/Achievements.html ", "Summary Dr. Simpson obtained the B.S. and Ph.D. degrees in electrical engineering from Northwestern University, Evanston, IL, in 2003 and 2007, respectively. Her Ph.D. advisor was Prof. Allen Taflove. As a graduate student, Dr. Simpson was a recipient of the National Science Foundation (NSF) Graduate Research Fellowship, and also received fellowships, awards, and grants-in-aid from the Institute of Electrical and Electronics Engineers (IEEE) Antennas and Propagation Society (AP-S), IEEE Microwave Theory and Techniques Society (MTT-S), McCormick School of Engineering, and Intel Corporation. She worked through a grant from the German Academic Exchange Service (DAAD) in Prof. Heyno Garbe's Electromagnetic Compatibility Lab at the University of Hannover, Germany in summer of 2002. In summers of 2003 - 2006, she worked as an engineering intern at Intel Corporation in Hillsboro, OR. \n \nIn August 2007, Dr. Simpson joined the Electrical and Computer Engineering Department at the University of New Mexico (UNM) as a tenure-track assistant professor. As of July 1, 2012, she will be an associate professor in the ECE Department at the University of Utah. Dr. Simpson's research lab encompasses the application of FDTD to modeling electromagnetic phenomena at frequencies over 15 orders of magnitude (~1 Hz vs. ~600 THz). To date, her research activities have been funded by Sandia National Labs, Los Alamos National Labs, Intel Corporation, the Department of Energy, the Air Force Office of Scientific Research, and the NSF. Prof. Simpson has received research and teaching awards, including a 2010 NSF CAREER Award (entitled \"3-D Global Full-Maxwell's Equations Modeling of the Effects of a Coronal Mass Ejection on the Earth\") and the 2012 IEEE Antennas and Propagation Society Donald G. Dudley, Jr. Undergraduate Teaching Award. She currently serves as associate editor of IEEE Transactions on Antennas and Propagation. Specialties:* Computational electromagnetics (CEM) theory and applications, especially FDTD solutions to Maxwell’s equations \n* Electromagnetic propagation and phenomena in the Earth-ionosphere system \n* Photonic applications, including photonic interconnects and biophotonics \n* Smart lighting \n* Novel ultrawideband waveguiding interconnects for ultrahigh-speed digital data buses \n* Electromagnetic compatibility problems arising in ultracompact portable electronic devices Summary Dr. Simpson obtained the B.S. and Ph.D. degrees in electrical engineering from Northwestern University, Evanston, IL, in 2003 and 2007, respectively. Her Ph.D. advisor was Prof. Allen Taflove. As a graduate student, Dr. Simpson was a recipient of the National Science Foundation (NSF) Graduate Research Fellowship, and also received fellowships, awards, and grants-in-aid from the Institute of Electrical and Electronics Engineers (IEEE) Antennas and Propagation Society (AP-S), IEEE Microwave Theory and Techniques Society (MTT-S), McCormick School of Engineering, and Intel Corporation. She worked through a grant from the German Academic Exchange Service (DAAD) in Prof. Heyno Garbe's Electromagnetic Compatibility Lab at the University of Hannover, Germany in summer of 2002. In summers of 2003 - 2006, she worked as an engineering intern at Intel Corporation in Hillsboro, OR. \n \nIn August 2007, Dr. Simpson joined the Electrical and Computer Engineering Department at the University of New Mexico (UNM) as a tenure-track assistant professor. As of July 1, 2012, she will be an associate professor in the ECE Department at the University of Utah. Dr. Simpson's research lab encompasses the application of FDTD to modeling electromagnetic phenomena at frequencies over 15 orders of magnitude (~1 Hz vs. ~600 THz). To date, her research activities have been funded by Sandia National Labs, Los Alamos National Labs, Intel Corporation, the Department of Energy, the Air Force Office of Scientific Research, and the NSF. Prof. Simpson has received research and teaching awards, including a 2010 NSF CAREER Award (entitled \"3-D Global Full-Maxwell's Equations Modeling of the Effects of a Coronal Mass Ejection on the Earth\") and the 2012 IEEE Antennas and Propagation Society Donald G. Dudley, Jr. Undergraduate Teaching Award. She currently serves as associate editor of IEEE Transactions on Antennas and Propagation. Specialties:* Computational electromagnetics (CEM) theory and applications, especially FDTD solutions to Maxwell’s equations \n* Electromagnetic propagation and phenomena in the Earth-ionosphere system \n* Photonic applications, including photonic interconnects and biophotonics \n* Smart lighting \n* Novel ultrawideband waveguiding interconnects for ultrahigh-speed digital data buses \n* Electromagnetic compatibility problems arising in ultracompact portable electronic devices Dr. Simpson obtained the B.S. and Ph.D. degrees in electrical engineering from Northwestern University, Evanston, IL, in 2003 and 2007, respectively. Her Ph.D. advisor was Prof. Allen Taflove. As a graduate student, Dr. Simpson was a recipient of the National Science Foundation (NSF) Graduate Research Fellowship, and also received fellowships, awards, and grants-in-aid from the Institute of Electrical and Electronics Engineers (IEEE) Antennas and Propagation Society (AP-S), IEEE Microwave Theory and Techniques Society (MTT-S), McCormick School of Engineering, and Intel Corporation. She worked through a grant from the German Academic Exchange Service (DAAD) in Prof. Heyno Garbe's Electromagnetic Compatibility Lab at the University of Hannover, Germany in summer of 2002. In summers of 2003 - 2006, she worked as an engineering intern at Intel Corporation in Hillsboro, OR. \n \nIn August 2007, Dr. Simpson joined the Electrical and Computer Engineering Department at the University of New Mexico (UNM) as a tenure-track assistant professor. As of July 1, 2012, she will be an associate professor in the ECE Department at the University of Utah. Dr. Simpson's research lab encompasses the application of FDTD to modeling electromagnetic phenomena at frequencies over 15 orders of magnitude (~1 Hz vs. ~600 THz). To date, her research activities have been funded by Sandia National Labs, Los Alamos National Labs, Intel Corporation, the Department of Energy, the Air Force Office of Scientific Research, and the NSF. Prof. Simpson has received research and teaching awards, including a 2010 NSF CAREER Award (entitled \"3-D Global Full-Maxwell's Equations Modeling of the Effects of a Coronal Mass Ejection on the Earth\") and the 2012 IEEE Antennas and Propagation Society Donald G. Dudley, Jr. Undergraduate Teaching Award. She currently serves as associate editor of IEEE Transactions on Antennas and Propagation. Specialties:* Computational electromagnetics (CEM) theory and applications, especially FDTD solutions to Maxwell’s equations \n* Electromagnetic propagation and phenomena in the Earth-ionosphere system \n* Photonic applications, including photonic interconnects and biophotonics \n* Smart lighting \n* Novel ultrawideband waveguiding interconnects for ultrahigh-speed digital data buses \n* Electromagnetic compatibility problems arising in ultracompact portable electronic devices Dr. Simpson obtained the B.S. and Ph.D. degrees in electrical engineering from Northwestern University, Evanston, IL, in 2003 and 2007, respectively. Her Ph.D. advisor was Prof. Allen Taflove. As a graduate student, Dr. Simpson was a recipient of the National Science Foundation (NSF) Graduate Research Fellowship, and also received fellowships, awards, and grants-in-aid from the Institute of Electrical and Electronics Engineers (IEEE) Antennas and Propagation Society (AP-S), IEEE Microwave Theory and Techniques Society (MTT-S), McCormick School of Engineering, and Intel Corporation. She worked through a grant from the German Academic Exchange Service (DAAD) in Prof. Heyno Garbe's Electromagnetic Compatibility Lab at the University of Hannover, Germany in summer of 2002. In summers of 2003 - 2006, she worked as an engineering intern at Intel Corporation in Hillsboro, OR. \n \nIn August 2007, Dr. Simpson joined the Electrical and Computer Engineering Department at the University of New Mexico (UNM) as a tenure-track assistant professor. As of July 1, 2012, she will be an associate professor in the ECE Department at the University of Utah. Dr. Simpson's research lab encompasses the application of FDTD to modeling electromagnetic phenomena at frequencies over 15 orders of magnitude (~1 Hz vs. ~600 THz). To date, her research activities have been funded by Sandia National Labs, Los Alamos National Labs, Intel Corporation, the Department of Energy, the Air Force Office of Scientific Research, and the NSF. Prof. Simpson has received research and teaching awards, including a 2010 NSF CAREER Award (entitled \"3-D Global Full-Maxwell's Equations Modeling of the Effects of a Coronal Mass Ejection on the Earth\") and the 2012 IEEE Antennas and Propagation Society Donald G. Dudley, Jr. Undergraduate Teaching Award. She currently serves as associate editor of IEEE Transactions on Antennas and Propagation. Specialties:* Computational electromagnetics (CEM) theory and applications, especially FDTD solutions to Maxwell’s equations \n* Electromagnetic propagation and phenomena in the Earth-ionosphere system \n* Photonic applications, including photonic interconnects and biophotonics \n* Smart lighting \n* Novel ultrawideband waveguiding interconnects for ultrahigh-speed digital data buses \n* Electromagnetic compatibility problems arising in ultracompact portable electronic devices Experience Associate Professor University of Utah July 2012  – Present (3 years 2 months) Salt Lake City Assistant Professor University of New Mexico August 2007  –  June 2012  (4 years 11 months) Albuquerque, NM Engineering Intern Intel Corporation June 2003  –  September 2006  (3 years 4 months) Spent four summer internships at Intel Corporation developing and porting to NSF Teragrid supercomputers original three-dimensional (3-D) finite-difference time-domain (FDTD) computational electromagnetics models of novel substrate integrated waveguides (SIWs) for use as board-level interconnects between advanced digital processors. Optimized SIWs using FDTD modeling results and subsequently tested prototypes at Intel Corporation. SIWs were found to yield bit rates more than 10 times those of present interconnects, thereby showing the potential to satisfy Intel’s needs for at least the next decade. Associate Professor University of Utah July 2012  – Present (3 years 2 months) Salt Lake City Associate Professor University of Utah July 2012  – Present (3 years 2 months) Salt Lake City Assistant Professor University of New Mexico August 2007  –  June 2012  (4 years 11 months) Albuquerque, NM Assistant Professor University of New Mexico August 2007  –  June 2012  (4 years 11 months) Albuquerque, NM Engineering Intern Intel Corporation June 2003  –  September 2006  (3 years 4 months) Spent four summer internships at Intel Corporation developing and porting to NSF Teragrid supercomputers original three-dimensional (3-D) finite-difference time-domain (FDTD) computational electromagnetics models of novel substrate integrated waveguides (SIWs) for use as board-level interconnects between advanced digital processors. Optimized SIWs using FDTD modeling results and subsequently tested prototypes at Intel Corporation. SIWs were found to yield bit rates more than 10 times those of present interconnects, thereby showing the potential to satisfy Intel’s needs for at least the next decade. Engineering Intern Intel Corporation June 2003  –  September 2006  (3 years 4 months) Spent four summer internships at Intel Corporation developing and porting to NSF Teragrid supercomputers original three-dimensional (3-D) finite-difference time-domain (FDTD) computational electromagnetics models of novel substrate integrated waveguides (SIWs) for use as board-level interconnects between advanced digital processors. Optimized SIWs using FDTD modeling results and subsequently tested prototypes at Intel Corporation. SIWs were found to yield bit rates more than 10 times those of present interconnects, thereby showing the potential to satisfy Intel’s needs for at least the next decade. Education Northwestern University B.S. (2003), Ph.D. (2007),  Electrical Engineering 1999  – 2007 Ph.D. Dissertation Title: “Three-Dimensional FDTD Modeling of Impulsive Extremely Low-Frequency Electromagnetic Wave Propagation in the Global Earth-Ionosphere Waveguide below 30 kHz” \nPh.D. Advisor: Prof. Allen Taflove Activities and Societies:  Assistant Master ,  Shepard Residential College (2004 - 2007) ,  Resident Assistant ,  Slivka Residential College (2002-2003) ,  Resident Assistant ,  Goodrich House (2001-2002) Northwestern University B.S. (2003), Ph.D. (2007),  Electrical Engineering 1999  – 2007 Ph.D. Dissertation Title: “Three-Dimensional FDTD Modeling of Impulsive Extremely Low-Frequency Electromagnetic Wave Propagation in the Global Earth-Ionosphere Waveguide below 30 kHz” \nPh.D. Advisor: Prof. Allen Taflove Activities and Societies:  Assistant Master ,  Shepard Residential College (2004 - 2007) ,  Resident Assistant ,  Slivka Residential College (2002-2003) ,  Resident Assistant ,  Goodrich House (2001-2002) Northwestern University B.S. (2003), Ph.D. (2007),  Electrical Engineering 1999  – 2007 Ph.D. Dissertation Title: “Three-Dimensional FDTD Modeling of Impulsive Extremely Low-Frequency Electromagnetic Wave Propagation in the Global Earth-Ionosphere Waveguide below 30 kHz” \nPh.D. Advisor: Prof. Allen Taflove Activities and Societies:  Assistant Master ,  Shepard Residential College (2004 - 2007) ,  Resident Assistant ,  Slivka Residential College (2002-2003) ,  Resident Assistant ,  Goodrich House (2001-2002) Northwestern University B.S. (2003), Ph.D. (2007),  Electrical Engineering 1999  – 2007 Ph.D. Dissertation Title: “Three-Dimensional FDTD Modeling of Impulsive Extremely Low-Frequency Electromagnetic Wave Propagation in the Global Earth-Ionosphere Waveguide below 30 kHz” \nPh.D. Advisor: Prof. Allen Taflove Activities and Societies:  Assistant Master ,  Shepard Residential College (2004 - 2007) ,  Resident Assistant ,  Slivka Residential College (2002-2003) ,  Resident Assistant ,  Goodrich House (2001-2002) Honors & Awards Additional Honors & Awards 2001 Summer Grant, Northwestern University Undergraduate Research Grants Committee; 2001-03 Undergraduate research assistantship funded by Intel Corporation; 2002 German Academic Exchange Service (DAAD) Undergraduate Award; 2003 IEEE AP-S International Symposium Student Paper Contest Finalist; 2003-04 Northwestern University McCormick School of Engineering Murphy First-Year Graduate Fellowship; 2004-05 IEEE AP-S Graduate Research Award; 2004-05 Graduate research assistantship funded by Intel Corporation; 2005-07 NSF Graduate Fellowship; 2006 IEEE MTT-S Graduate Fellowship; 2006-07 Northwestern University McCormick School of Engineering Richter Dissertation- Year Fellowship (declined due to prior NSF Graduate Fellowship); 2007 Best Ph.D. Dissertation Award, Electrical Engineering and Computer Science Department, Northwestern University; 2010 National Science Foundation CAREER Award; 2011 UNM SOE Junior Faculty Teaching Excellence Award; 2011 Air Force Summer Faculty Fellowship Additional Honors & Awards 2001 Summer Grant, Northwestern University Undergraduate Research Grants Committee; 2001-03 Undergraduate research assistantship funded by Intel Corporation; 2002 German Academic Exchange Service (DAAD) Undergraduate Award; 2003 IEEE AP-S International Symposium Student Paper Contest Finalist; 2003-04 Northwestern University McCormick School of Engineering Murphy First-Year Graduate Fellowship; 2004-05 IEEE AP-S Graduate Research Award; 2004-05 Graduate research assistantship funded by Intel Corporation; 2005-07 NSF Graduate Fellowship; 2006 IEEE MTT-S Graduate Fellowship; 2006-07 Northwestern University McCormick School of Engineering Richter Dissertation- Year Fellowship (declined due to prior NSF Graduate Fellowship); 2007 Best Ph.D. Dissertation Award, Electrical Engineering and Computer Science Department, Northwestern University; 2010 National Science Foundation CAREER Award; 2011 UNM SOE Junior Faculty Teaching Excellence Award; 2011 Air Force Summer Faculty Fellowship Additional Honors & Awards 2001 Summer Grant, Northwestern University Undergraduate Research Grants Committee; 2001-03 Undergraduate research assistantship funded by Intel Corporation; 2002 German Academic Exchange Service (DAAD) Undergraduate Award; 2003 IEEE AP-S International Symposium Student Paper Contest Finalist; 2003-04 Northwestern University McCormick School of Engineering Murphy First-Year Graduate Fellowship; 2004-05 IEEE AP-S Graduate Research Award; 2004-05 Graduate research assistantship funded by Intel Corporation; 2005-07 NSF Graduate Fellowship; 2006 IEEE MTT-S Graduate Fellowship; 2006-07 Northwestern University McCormick School of Engineering Richter Dissertation- Year Fellowship (declined due to prior NSF Graduate Fellowship); 2007 Best Ph.D. Dissertation Award, Electrical Engineering and Computer Science Department, Northwestern University; 2010 National Science Foundation CAREER Award; 2011 UNM SOE Junior Faculty Teaching Excellence Award; 2011 Air Force Summer Faculty Fellowship Additional Honors & Awards 2001 Summer Grant, Northwestern University Undergraduate Research Grants Committee; 2001-03 Undergraduate research assistantship funded by Intel Corporation; 2002 German Academic Exchange Service (DAAD) Undergraduate Award; 2003 IEEE AP-S International Symposium Student Paper Contest Finalist; 2003-04 Northwestern University McCormick School of Engineering Murphy First-Year Graduate Fellowship; 2004-05 IEEE AP-S Graduate Research Award; 2004-05 Graduate research assistantship funded by Intel Corporation; 2005-07 NSF Graduate Fellowship; 2006 IEEE MTT-S Graduate Fellowship; 2006-07 Northwestern University McCormick School of Engineering Richter Dissertation- Year Fellowship (declined due to prior NSF Graduate Fellowship); 2007 Best Ph.D. Dissertation Award, Electrical Engineering and Computer Science Department, Northwestern University; 2010 National Science Foundation CAREER Award; 2011 UNM SOE Junior Faculty Teaching Excellence Award; 2011 Air Force Summer Faculty Fellowship ", "Experience Document Control Manager Intel Corporation January 2013  –  October 2013  (10 months) Duties include information management for the Arizona Ocotillo site, shared drive and ICCT (Intel Construction Collaboration Tool) management and administration (managing shared project and sustaining files and user accesses), and the development, implementation, and management of business processes. Site Infrastructure Engineer Intel Corporation December 2010  –  January 2013  (2 years 2 months) Duties included database and information management for the Arizona and California manufacturing plants, business process innovation and improvement. Construction Project Engineering Intern Intel Corporation May 2008  –  August 2008  (4 months) Chandler, AZ Duties included implementing a new business process in information management. Construction Project Engineering Intern Intel Corporation May 2007  –  August 2007  (4 months) Chandler, AZ Duties included telecom and spec gas data loading in a new software database (USM2) for Fab32. USM2 enables significant improvement in evaluating potential facility layout and re-use options. Construction Project Engineering Intern Intel Corporation June 2006  –  August 2006  (3 months) Chandler, AZ Duties included auditing and documenting all Fab12 process tool points of connection to required lateral and main utilities in the sub-fab. Ensuring data accuracy was the first step in the process of implementing construction engineering’s USM2/re-plan project. Document Control Manager Intel Corporation January 2013  –  October 2013  (10 months) Duties include information management for the Arizona Ocotillo site, shared drive and ICCT (Intel Construction Collaboration Tool) management and administration (managing shared project and sustaining files and user accesses), and the development, implementation, and management of business processes. Document Control Manager Intel Corporation January 2013  –  October 2013  (10 months) Duties include information management for the Arizona Ocotillo site, shared drive and ICCT (Intel Construction Collaboration Tool) management and administration (managing shared project and sustaining files and user accesses), and the development, implementation, and management of business processes. Site Infrastructure Engineer Intel Corporation December 2010  –  January 2013  (2 years 2 months) Duties included database and information management for the Arizona and California manufacturing plants, business process innovation and improvement. Site Infrastructure Engineer Intel Corporation December 2010  –  January 2013  (2 years 2 months) Duties included database and information management for the Arizona and California manufacturing plants, business process innovation and improvement. Construction Project Engineering Intern Intel Corporation May 2008  –  August 2008  (4 months) Chandler, AZ Duties included implementing a new business process in information management. Construction Project Engineering Intern Intel Corporation May 2008  –  August 2008  (4 months) Chandler, AZ Duties included implementing a new business process in information management. Construction Project Engineering Intern Intel Corporation May 2007  –  August 2007  (4 months) Chandler, AZ Duties included telecom and spec gas data loading in a new software database (USM2) for Fab32. USM2 enables significant improvement in evaluating potential facility layout and re-use options. Construction Project Engineering Intern Intel Corporation May 2007  –  August 2007  (4 months) Chandler, AZ Duties included telecom and spec gas data loading in a new software database (USM2) for Fab32. USM2 enables significant improvement in evaluating potential facility layout and re-use options. Construction Project Engineering Intern Intel Corporation June 2006  –  August 2006  (3 months) Chandler, AZ Duties included auditing and documenting all Fab12 process tool points of connection to required lateral and main utilities in the sub-fab. Ensuring data accuracy was the first step in the process of implementing construction engineering’s USM2/re-plan project. Construction Project Engineering Intern Intel Corporation June 2006  –  August 2006  (3 months) Chandler, AZ Duties included auditing and documenting all Fab12 process tool points of connection to required lateral and main utilities in the sub-fab. Ensuring data accuracy was the first step in the process of implementing construction engineering’s USM2/re-plan project. Skills Semiconductors Testing Electronics Software Documentation IC Cross-functional Team... Semiconductor Industry Databases Business Process Management Telecommunications SPC Project Engineering Engineering Management Product Engineering Program Management Manufacturing Engineering Microsoft Office See 4+     See less Skills  Semiconductors Testing Electronics Software Documentation IC Cross-functional Team... Semiconductor Industry Databases Business Process Management Telecommunications SPC Project Engineering Engineering Management Product Engineering Program Management Manufacturing Engineering Microsoft Office See 4+     See less Semiconductors Testing Electronics Software Documentation IC Cross-functional Team... Semiconductor Industry Databases Business Process Management Telecommunications SPC Project Engineering Engineering Management Product Engineering Program Management Manufacturing Engineering Microsoft Office See 4+     See less Semiconductors Testing Electronics Software Documentation IC Cross-functional Team... Semiconductor Industry Databases Business Process Management Telecommunications SPC Project Engineering Engineering Management Product Engineering Program Management Manufacturing Engineering Microsoft Office See 4+     See less Education Arizona State University Bachelor of Science (BS),  Engineering , 3.6 2005  – 2009 Arizona State University Bachelor of Science (BS),  Engineering , 3.6 2005  – 2009 Arizona State University Bachelor of Science (BS),  Engineering , 3.6 2005  – 2009 Arizona State University Bachelor of Science (BS),  Engineering , 3.6 2005  – 2009 ", "Experience Silicon Architect Engineer Intel Corporation September 2008  – Present (7 years) Involved with various aspects of the design and verification of next generation server processors. Graduate Student Princeton University September 2003  –  August 2008  (5 years) Investigated advanced bit manipulation instructions : architecture, implementations and applications. \n \nProposed new instructions PEXT and PDEP that have been included in Intel64 (x86) architecture as of HSW generation of chips. Graduate Engineering Intern Intel Corporation June 2006  –  September 2006  (4 months) Investigated the benefits of augmenting Intel Architecture with advanced bit manipulation instructions . Graduate Engineering Intern Intel Corporation June 2005  –  September 2005  (4 months) Vetted the security of the communications stack of the Intel Active Management Technology. Silicon Architect Engineer Intel Corporation September 2008  – Present (7 years) Involved with various aspects of the design and verification of next generation server processors. Silicon Architect Engineer Intel Corporation September 2008  – Present (7 years) Involved with various aspects of the design and verification of next generation server processors. Graduate Student Princeton University September 2003  –  August 2008  (5 years) Investigated advanced bit manipulation instructions : architecture, implementations and applications. \n \nProposed new instructions PEXT and PDEP that have been included in Intel64 (x86) architecture as of HSW generation of chips. Graduate Student Princeton University September 2003  –  August 2008  (5 years) Investigated advanced bit manipulation instructions : architecture, implementations and applications. \n \nProposed new instructions PEXT and PDEP that have been included in Intel64 (x86) architecture as of HSW generation of chips. Graduate Engineering Intern Intel Corporation June 2006  –  September 2006  (4 months) Investigated the benefits of augmenting Intel Architecture with advanced bit manipulation instructions . Graduate Engineering Intern Intel Corporation June 2006  –  September 2006  (4 months) Investigated the benefits of augmenting Intel Architecture with advanced bit manipulation instructions . Graduate Engineering Intern Intel Corporation June 2005  –  September 2005  (4 months) Vetted the security of the communications stack of the Intel Active Management Technology. Graduate Engineering Intern Intel Corporation June 2005  –  September 2005  (4 months) Vetted the security of the communications stack of the Intel Active Management Technology. Skills RTL design Logic Design Circuit Design Timing Closure Static Timing Analysis Power Analysis Signal Integrity Logic Verification SystemVerilog Synopsys tools Processors Microprocessors ASIC SoC Functional Verification DFT VLSI Microarchitecture Computer Architecture Verilog IC See 6+     See less Skills  RTL design Logic Design Circuit Design Timing Closure Static Timing Analysis Power Analysis Signal Integrity Logic Verification SystemVerilog Synopsys tools Processors Microprocessors ASIC SoC Functional Verification DFT VLSI Microarchitecture Computer Architecture Verilog IC See 6+     See less RTL design Logic Design Circuit Design Timing Closure Static Timing Analysis Power Analysis Signal Integrity Logic Verification SystemVerilog Synopsys tools Processors Microprocessors ASIC SoC Functional Verification DFT VLSI Microarchitecture Computer Architecture Verilog IC See 6+     See less RTL design Logic Design Circuit Design Timing Closure Static Timing Analysis Power Analysis Signal Integrity Logic Verification SystemVerilog Synopsys tools Processors Microprocessors ASIC SoC Functional Verification DFT VLSI Microarchitecture Computer Architecture Verilog IC See 6+     See less Education Princeton University PhD,  Electrical/Computer Engineering 2003  – 2008 Thesis: Advanced Bit Manipulation Instructions: Architecture, Implementation and Applications The Cooper Union for the Advancement of Science and Art BEng,  Electrical Engineering 1999  – 2003 Princeton University PhD,  Electrical/Computer Engineering 2003  – 2008 Thesis: Advanced Bit Manipulation Instructions: Architecture, Implementation and Applications Princeton University PhD,  Electrical/Computer Engineering 2003  – 2008 Thesis: Advanced Bit Manipulation Instructions: Architecture, Implementation and Applications Princeton University PhD,  Electrical/Computer Engineering 2003  – 2008 Thesis: Advanced Bit Manipulation Instructions: Architecture, Implementation and Applications The Cooper Union for the Advancement of Science and Art BEng,  Electrical Engineering 1999  – 2003 The Cooper Union for the Advancement of Science and Art BEng,  Electrical Engineering 1999  – 2003 The Cooper Union for the Advancement of Science and Art BEng,  Electrical Engineering 1999  – 2003 Honors & Awards Additional Honors & Awards NSF Graduate Research Fellowship, 2003-2008 \nHertz Foundation Graduate Fellowship, 2003-2008 Additional Honors & Awards NSF Graduate Research Fellowship, 2003-2008 \nHertz Foundation Graduate Fellowship, 2003-2008 Additional Honors & Awards NSF Graduate Research Fellowship, 2003-2008 \nHertz Foundation Graduate Fellowship, 2003-2008 Additional Honors & Awards NSF Graduate Research Fellowship, 2003-2008 \nHertz Foundation Graduate Fellowship, 2003-2008 ", "Summary Excitable, curious and perpetually learning new things. Currently, learning Java and Android programming along with the trials and tribulations of getting funding for the startup WellWaze. \n \nSkills: Java, Android Development, C and C++, Perl, HTML, PHP, Revit, AutoCAD, Photoshop, InDesign, Illustrator, Sketchup, Microsoft Office, Summary Excitable, curious and perpetually learning new things. Currently, learning Java and Android programming along with the trials and tribulations of getting funding for the startup WellWaze. \n \nSkills: Java, Android Development, C and C++, Perl, HTML, PHP, Revit, AutoCAD, Photoshop, InDesign, Illustrator, Sketchup, Microsoft Office, Excitable, curious and perpetually learning new things. Currently, learning Java and Android programming along with the trials and tribulations of getting funding for the startup WellWaze. \n \nSkills: Java, Android Development, C and C++, Perl, HTML, PHP, Revit, AutoCAD, Photoshop, InDesign, Illustrator, Sketchup, Microsoft Office, Excitable, curious and perpetually learning new things. Currently, learning Java and Android programming along with the trials and tribulations of getting funding for the startup WellWaze. \n \nSkills: Java, Android Development, C and C++, Perl, HTML, PHP, Revit, AutoCAD, Photoshop, InDesign, Illustrator, Sketchup, Microsoft Office, Experience Android programmer WellWaze June 2014  – Present (1 year 3 months) Portland, Oregon Area • Developing software on the Android platform to interface with the medicine minder mechanical prototype \n• Actively engaged in branding, business and product development Designer Bainbridge Design, Inc. August 2012  –  June 2014  (1 year 11 months) Portland, Oregon Area • Delivered tailored space plans and branded interior solutions for corporate clients such as, Umpqua Bank and the City of Portland \n• Worked in a highly collaborative environment on projects from programming and design development through to construction administration Interior Designer / Revit Modeler Market Contractors August 2011  –  August 2012  (1 year 1 month) • Creating 3D models in Revit 2011 \n• Developing construction documentation Design Intern OrangeWall Studios & JHL Designs, April 2011  –  June 2011  (3 months) Portland, OR • Assisted designers in technical drawings, finish selections, diagram creation; utilizing AutoCAD, InDesign, Photoshop and Sketchup \nskills on a variety of commercial and residential projects \n• Updated the dc202 website, foyer video display and other computer related tasks Peer Tutor The Art Institute of Portland January 2010  –  June 2011  (1 year 6 months) Portland, OR • Tutored students in Revit, AutoCAD, InDesign, Photoshop, digital rendering, perspectives and space planning Software Engineer Intel Corporation June 2005  –  July 2009  (4 years 2 months) Portland, OR Portland Technology Development Distributed Systems Engineering Team \n• Supported systems for R&D and High-Volume 300mm Silicon Manufacturing Facility \n• Created statistical models to remove faulty Defect Metrology tools from production \n• Designed applications for streamlining internal business models \n• Troubleshot issues on 600 individual processing tools on a 24 hour on-call basis regularly \n• Balanced troubleshooting, daily operations, urgent issues and project work in fast-paced and demanding environment Engineering Intern Intel Corporation June 2004  –  August 2004  (3 months) Portland, OR Automated Material Handling System (AMHS) Team \nIntel Honors Internship Program (iHIP) \n• Developed methods to improve recovery times and reduce error count on frequent and costly Daifuku stocker errors \n• Planned and executed firmware and software upgrades for AMHS hardware Engineering Intern Intel Corporation January 2003  –  June 2003  (6 months) Portland, OR Automated Material Handling System (AMHS) Team \nIntel Honors Internship Program (iHIP) \n• Reduced costly Daifuku Cleanway errors by identifying issues and implementing hardware changes \n• Defined procedures for recovering 300mm White Systems carousel errors \n• Planned and executed firmware and software upgrades for AMHS hardware \n• Created a web based system for retrieving Daifuku error recovery procedures Engineering Intern Intel Corporation May 2002  –  August 2002  (4 months) Portland, OR Logic Technology Development Design Automation Team \nIntel Honors Internship Program (iHIP) \n• Wrote Perl scripts to compare delay, setup and hold times between cell library releases \n• Learned tools associated with VSLI cell design Engineering Intern Intel Corporation May 2001  –  August 2001  (4 months) Portland, OR Fab 20 Automation Integration Team \nIntel Honors Internship Program (iHIP) \n• Created web based request tracking software for gathering and tracking projects; currently used in 5 facilities Engineering Intern Intel Corporation May 2000  –  August 2000  (4 months) Portland, OR Fab 20 Factory Automation Support Team \nIntel Honors Internship Program (iHIP) \n• Setup MS NT servers and web based tools \n• Level 1 tech support in call center for 200mm Silicon Manufacturing Facility Engineering Intern Intel Corporation June 1999  –  August 1999  (3 months) Portland, OR Portland Technology Development Intranet Team \nIntel Honors Internship Program (iHIP) \n• Researched and documented color blindness as it relates to web site usability in the cleanroom \n• Extensive work with HTML, ASP, JavaScript, Frontpage and Photoshop Engineering Intern Intel Corporation June 1998  –  August 1998  (3 months) Portland, OR Self-Sustaining Technician in Fab 15 Lithography, I-line/Nikon \nIntel Honors Internship Program (iHIP) \n• Performed WIP movement and machine maintenance tasks in 200mm cleanroom Android programmer WellWaze June 2014  – Present (1 year 3 months) Portland, Oregon Area • Developing software on the Android platform to interface with the medicine minder mechanical prototype \n• Actively engaged in branding, business and product development Android programmer WellWaze June 2014  – Present (1 year 3 months) Portland, Oregon Area • Developing software on the Android platform to interface with the medicine minder mechanical prototype \n• Actively engaged in branding, business and product development Designer Bainbridge Design, Inc. August 2012  –  June 2014  (1 year 11 months) Portland, Oregon Area • Delivered tailored space plans and branded interior solutions for corporate clients such as, Umpqua Bank and the City of Portland \n• Worked in a highly collaborative environment on projects from programming and design development through to construction administration Designer Bainbridge Design, Inc. August 2012  –  June 2014  (1 year 11 months) Portland, Oregon Area • Delivered tailored space plans and branded interior solutions for corporate clients such as, Umpqua Bank and the City of Portland \n• Worked in a highly collaborative environment on projects from programming and design development through to construction administration Interior Designer / Revit Modeler Market Contractors August 2011  –  August 2012  (1 year 1 month) • Creating 3D models in Revit 2011 \n• Developing construction documentation Interior Designer / Revit Modeler Market Contractors August 2011  –  August 2012  (1 year 1 month) • Creating 3D models in Revit 2011 \n• Developing construction documentation Design Intern OrangeWall Studios & JHL Designs, April 2011  –  June 2011  (3 months) Portland, OR • Assisted designers in technical drawings, finish selections, diagram creation; utilizing AutoCAD, InDesign, Photoshop and Sketchup \nskills on a variety of commercial and residential projects \n• Updated the dc202 website, foyer video display and other computer related tasks Design Intern OrangeWall Studios & JHL Designs, April 2011  –  June 2011  (3 months) Portland, OR • Assisted designers in technical drawings, finish selections, diagram creation; utilizing AutoCAD, InDesign, Photoshop and Sketchup \nskills on a variety of commercial and residential projects \n• Updated the dc202 website, foyer video display and other computer related tasks Peer Tutor The Art Institute of Portland January 2010  –  June 2011  (1 year 6 months) Portland, OR • Tutored students in Revit, AutoCAD, InDesign, Photoshop, digital rendering, perspectives and space planning Peer Tutor The Art Institute of Portland January 2010  –  June 2011  (1 year 6 months) Portland, OR • Tutored students in Revit, AutoCAD, InDesign, Photoshop, digital rendering, perspectives and space planning Software Engineer Intel Corporation June 2005  –  July 2009  (4 years 2 months) Portland, OR Portland Technology Development Distributed Systems Engineering Team \n• Supported systems for R&D and High-Volume 300mm Silicon Manufacturing Facility \n• Created statistical models to remove faulty Defect Metrology tools from production \n• Designed applications for streamlining internal business models \n• Troubleshot issues on 600 individual processing tools on a 24 hour on-call basis regularly \n• Balanced troubleshooting, daily operations, urgent issues and project work in fast-paced and demanding environment Software Engineer Intel Corporation June 2005  –  July 2009  (4 years 2 months) Portland, OR Portland Technology Development Distributed Systems Engineering Team \n• Supported systems for R&D and High-Volume 300mm Silicon Manufacturing Facility \n• Created statistical models to remove faulty Defect Metrology tools from production \n• Designed applications for streamlining internal business models \n• Troubleshot issues on 600 individual processing tools on a 24 hour on-call basis regularly \n• Balanced troubleshooting, daily operations, urgent issues and project work in fast-paced and demanding environment Engineering Intern Intel Corporation June 2004  –  August 2004  (3 months) Portland, OR Automated Material Handling System (AMHS) Team \nIntel Honors Internship Program (iHIP) \n• Developed methods to improve recovery times and reduce error count on frequent and costly Daifuku stocker errors \n• Planned and executed firmware and software upgrades for AMHS hardware Engineering Intern Intel Corporation June 2004  –  August 2004  (3 months) Portland, OR Automated Material Handling System (AMHS) Team \nIntel Honors Internship Program (iHIP) \n• Developed methods to improve recovery times and reduce error count on frequent and costly Daifuku stocker errors \n• Planned and executed firmware and software upgrades for AMHS hardware Engineering Intern Intel Corporation January 2003  –  June 2003  (6 months) Portland, OR Automated Material Handling System (AMHS) Team \nIntel Honors Internship Program (iHIP) \n• Reduced costly Daifuku Cleanway errors by identifying issues and implementing hardware changes \n• Defined procedures for recovering 300mm White Systems carousel errors \n• Planned and executed firmware and software upgrades for AMHS hardware \n• Created a web based system for retrieving Daifuku error recovery procedures Engineering Intern Intel Corporation January 2003  –  June 2003  (6 months) Portland, OR Automated Material Handling System (AMHS) Team \nIntel Honors Internship Program (iHIP) \n• Reduced costly Daifuku Cleanway errors by identifying issues and implementing hardware changes \n• Defined procedures for recovering 300mm White Systems carousel errors \n• Planned and executed firmware and software upgrades for AMHS hardware \n• Created a web based system for retrieving Daifuku error recovery procedures Engineering Intern Intel Corporation May 2002  –  August 2002  (4 months) Portland, OR Logic Technology Development Design Automation Team \nIntel Honors Internship Program (iHIP) \n• Wrote Perl scripts to compare delay, setup and hold times between cell library releases \n• Learned tools associated with VSLI cell design Engineering Intern Intel Corporation May 2002  –  August 2002  (4 months) Portland, OR Logic Technology Development Design Automation Team \nIntel Honors Internship Program (iHIP) \n• Wrote Perl scripts to compare delay, setup and hold times between cell library releases \n• Learned tools associated with VSLI cell design Engineering Intern Intel Corporation May 2001  –  August 2001  (4 months) Portland, OR Fab 20 Automation Integration Team \nIntel Honors Internship Program (iHIP) \n• Created web based request tracking software for gathering and tracking projects; currently used in 5 facilities Engineering Intern Intel Corporation May 2001  –  August 2001  (4 months) Portland, OR Fab 20 Automation Integration Team \nIntel Honors Internship Program (iHIP) \n• Created web based request tracking software for gathering and tracking projects; currently used in 5 facilities Engineering Intern Intel Corporation May 2000  –  August 2000  (4 months) Portland, OR Fab 20 Factory Automation Support Team \nIntel Honors Internship Program (iHIP) \n• Setup MS NT servers and web based tools \n• Level 1 tech support in call center for 200mm Silicon Manufacturing Facility Engineering Intern Intel Corporation May 2000  –  August 2000  (4 months) Portland, OR Fab 20 Factory Automation Support Team \nIntel Honors Internship Program (iHIP) \n• Setup MS NT servers and web based tools \n• Level 1 tech support in call center for 200mm Silicon Manufacturing Facility Engineering Intern Intel Corporation June 1999  –  August 1999  (3 months) Portland, OR Portland Technology Development Intranet Team \nIntel Honors Internship Program (iHIP) \n• Researched and documented color blindness as it relates to web site usability in the cleanroom \n• Extensive work with HTML, ASP, JavaScript, Frontpage and Photoshop Engineering Intern Intel Corporation June 1999  –  August 1999  (3 months) Portland, OR Portland Technology Development Intranet Team \nIntel Honors Internship Program (iHIP) \n• Researched and documented color blindness as it relates to web site usability in the cleanroom \n• Extensive work with HTML, ASP, JavaScript, Frontpage and Photoshop Engineering Intern Intel Corporation June 1998  –  August 1998  (3 months) Portland, OR Self-Sustaining Technician in Fab 15 Lithography, I-line/Nikon \nIntel Honors Internship Program (iHIP) \n• Performed WIP movement and machine maintenance tasks in 200mm cleanroom Engineering Intern Intel Corporation June 1998  –  August 1998  (3 months) Portland, OR Self-Sustaining Technician in Fab 15 Lithography, I-line/Nikon \nIntel Honors Internship Program (iHIP) \n• Performed WIP movement and machine maintenance tasks in 200mm cleanroom Skills AutoCAD Revit SketchUp Photoshop PHP Microsoft Office InDesign HTML Perl C++ Troubleshooting CAD 3D Rendering Architecture Skills  AutoCAD Revit SketchUp Photoshop PHP Microsoft Office InDesign HTML Perl C++ Troubleshooting CAD 3D Rendering Architecture AutoCAD Revit SketchUp Photoshop PHP Microsoft Office InDesign HTML Perl C++ Troubleshooting CAD 3D Rendering Architecture AutoCAD Revit SketchUp Photoshop PHP Microsoft Office InDesign HTML Perl C++ Troubleshooting CAD 3D Rendering Architecture Education The Art Institute of Portland BFA,  Interior Design 2009  – 2011 Activities and Societies:  ASID student member University of Southern California MS,  Computer Science 2003  – 2005 Activities and Societies:  Focus in Intelligent Robotics University of Southern California BS,  Computer Engineering 1998  – 2002 Activities and Societies:  Minor in Multimedia & Creative Technologies The Art Institute of Portland BFA,  Interior Design 2009  – 2011 Activities and Societies:  ASID student member The Art Institute of Portland BFA,  Interior Design 2009  – 2011 Activities and Societies:  ASID student member The Art Institute of Portland BFA,  Interior Design 2009  – 2011 Activities and Societies:  ASID student member University of Southern California MS,  Computer Science 2003  – 2005 Activities and Societies:  Focus in Intelligent Robotics University of Southern California MS,  Computer Science 2003  – 2005 Activities and Societies:  Focus in Intelligent Robotics University of Southern California MS,  Computer Science 2003  – 2005 Activities and Societies:  Focus in Intelligent Robotics University of Southern California BS,  Computer Engineering 1998  – 2002 Activities and Societies:  Minor in Multimedia & Creative Technologies University of Southern California BS,  Computer Engineering 1998  – 2002 Activities and Societies:  Minor in Multimedia & Creative Technologies University of Southern California BS,  Computer Engineering 1998  – 2002 Activities and Societies:  Minor in Multimedia & Creative Technologies ", "Experience Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Engineering Intern Intel Corporation May 2012  –  August 2012  (4 months) Sort Test Technology Development \n• Designed and developed an Android tablet application to interface with \na prototype thermal control module \n• Communicated user input for machine settings over USB and Wi-Fi \n• Implemented data logging, real-time data graphing, and user control \nof the thermal module into the application for a seamless experience Research Assistant Georgia Institute of Technology January 2012  –  May 2012  (5 months) Embedded Pervasive Lab \n• Researched transient social networks to find out how to embed them \ninto mobile applications for creating on the y networks for various \npurposes \n• Developed Walksafe, an Android application, with a team to \ndemonstrate transient social networks and how they can be used. \n• Walksafe: http://www.projecttsn.com/walksafe/index.html \n• Awarded First Place People’s Choice award in the UROC \ncompetition Counter Intelligence Agent Geek Squad July 2009  –  January 2011  (1 year 7 months) · Diagnosed and repaired issues with computers \n· Provided customers with the technical assistance they required to fix issues in person and \nover the phone Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Engineering Intern Intel Corporation May 2012  –  August 2012  (4 months) Sort Test Technology Development \n• Designed and developed an Android tablet application to interface with \na prototype thermal control module \n• Communicated user input for machine settings over USB and Wi-Fi \n• Implemented data logging, real-time data graphing, and user control \nof the thermal module into the application for a seamless experience Engineering Intern Intel Corporation May 2012  –  August 2012  (4 months) Sort Test Technology Development \n• Designed and developed an Android tablet application to interface with \na prototype thermal control module \n• Communicated user input for machine settings over USB and Wi-Fi \n• Implemented data logging, real-time data graphing, and user control \nof the thermal module into the application for a seamless experience Research Assistant Georgia Institute of Technology January 2012  –  May 2012  (5 months) Embedded Pervasive Lab \n• Researched transient social networks to find out how to embed them \ninto mobile applications for creating on the y networks for various \npurposes \n• Developed Walksafe, an Android application, with a team to \ndemonstrate transient social networks and how they can be used. \n• Walksafe: http://www.projecttsn.com/walksafe/index.html \n• Awarded First Place People’s Choice award in the UROC \ncompetition Research Assistant Georgia Institute of Technology January 2012  –  May 2012  (5 months) Embedded Pervasive Lab \n• Researched transient social networks to find out how to embed them \ninto mobile applications for creating on the y networks for various \npurposes \n• Developed Walksafe, an Android application, with a team to \ndemonstrate transient social networks and how they can be used. \n• Walksafe: http://www.projecttsn.com/walksafe/index.html \n• Awarded First Place People’s Choice award in the UROC \ncompetition Counter Intelligence Agent Geek Squad July 2009  –  January 2011  (1 year 7 months) · Diagnosed and repaired issues with computers \n· Provided customers with the technical assistance they required to fix issues in person and \nover the phone Counter Intelligence Agent Geek Squad July 2009  –  January 2011  (1 year 7 months) · Diagnosed and repaired issues with computers \n· Provided customers with the technical assistance they required to fix issues in person and \nover the phone Languages   Skills C++ Java Linux C Operating Systems Android SQL JavaScript Visual Studio Unix Computer Science Windows Skills  C++ Java Linux C Operating Systems Android SQL JavaScript Visual Studio Unix Computer Science Windows C++ Java Linux C Operating Systems Android SQL JavaScript Visual Studio Unix Computer Science Windows C++ Java Linux C Operating Systems Android SQL JavaScript Visual Studio Unix Computer Science Windows Education Georgia Institute of Technology Master of Science (M.S.),  Computer Science 2013  – 2015 Specialization in Systems Georgia Institute of Technology Bachelor of Science (B.S.),  Computer Science 2011  – 2012 Hope Scholarship, Deans List Kennesaw State University May 2011 Bachelor of Science (B.S.),  Computer Science 2009  – 2011 Georgia Institute of Technology Master of Science (M.S.),  Computer Science 2013  – 2015 Specialization in Systems Georgia Institute of Technology Master of Science (M.S.),  Computer Science 2013  – 2015 Specialization in Systems Georgia Institute of Technology Master of Science (M.S.),  Computer Science 2013  – 2015 Specialization in Systems Georgia Institute of Technology Bachelor of Science (B.S.),  Computer Science 2011  – 2012 Hope Scholarship, Deans List Georgia Institute of Technology Bachelor of Science (B.S.),  Computer Science 2011  – 2012 Hope Scholarship, Deans List Georgia Institute of Technology Bachelor of Science (B.S.),  Computer Science 2011  – 2012 Hope Scholarship, Deans List Kennesaw State University May 2011 Bachelor of Science (B.S.),  Computer Science 2009  – 2011 Kennesaw State University May 2011 Bachelor of Science (B.S.),  Computer Science 2009  – 2011 Kennesaw State University May 2011 Bachelor of Science (B.S.),  Computer Science 2009  – 2011 Honors & Awards Additional Honors & Awards Dean's List \nHope Scholarship Additional Honors & Awards Dean's List \nHope Scholarship Additional Honors & Awards Dean's List \nHope Scholarship Additional Honors & Awards Dean's List \nHope Scholarship ", "Experience Senior Developer Bloomberg LP April 2014  – Present (1 year 5 months) New York, NY Fixed Income Infrastructure Team (R&D) Software Development Engineer 2 Microsoft November 2005  –  September 2013  (7 years 11 months) Redmond, WA Developer on the Windows Application Compatibility and Device Compatibility team. Primary focus is on telemetry and mitigations to ensure the highest level of application compatibility from one Windows release to the next. Hardware Engineering Intern Intel Corporation June 2004  –  September 2004  (4 months) Hudson, MA Software Engineering Intern Intel Corporation June 2003  –  September 2003  (4 months) Hillsboro, OR Hardware Engineering Intern Intel July 2002  –  January 2003  (7 months) Hillsboro, OR Senior Developer Bloomberg LP April 2014  – Present (1 year 5 months) New York, NY Fixed Income Infrastructure Team (R&D) Senior Developer Bloomberg LP April 2014  – Present (1 year 5 months) New York, NY Fixed Income Infrastructure Team (R&D) Software Development Engineer 2 Microsoft November 2005  –  September 2013  (7 years 11 months) Redmond, WA Developer on the Windows Application Compatibility and Device Compatibility team. Primary focus is on telemetry and mitigations to ensure the highest level of application compatibility from one Windows release to the next. Software Development Engineer 2 Microsoft November 2005  –  September 2013  (7 years 11 months) Redmond, WA Developer on the Windows Application Compatibility and Device Compatibility team. Primary focus is on telemetry and mitigations to ensure the highest level of application compatibility from one Windows release to the next. Hardware Engineering Intern Intel Corporation June 2004  –  September 2004  (4 months) Hudson, MA Hardware Engineering Intern Intel Corporation June 2004  –  September 2004  (4 months) Hudson, MA Software Engineering Intern Intel Corporation June 2003  –  September 2003  (4 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2003  –  September 2003  (4 months) Hillsboro, OR Hardware Engineering Intern Intel July 2002  –  January 2003  (7 months) Hillsboro, OR Hardware Engineering Intern Intel July 2002  –  January 2003  (7 months) Hillsboro, OR Languages   Skills C++ Software Engineering Software Development Windows Software Design C# Algorithms Visual Studio Agile Methodologies Object Oriented Design C Debugging Win32 API Skills  C++ Software Engineering Software Development Windows Software Design C# Algorithms Visual Studio Agile Methodologies Object Oriented Design C Debugging Win32 API C++ Software Engineering Software Development Windows Software Design C# Algorithms Visual Studio Agile Methodologies Object Oriented Design C Debugging Win32 API C++ Software Engineering Software Development Windows Software Design C# Algorithms Visual Studio Agile Methodologies Object Oriented Design C Debugging Win32 API Education University of Washington Computer Engineering,  Physics 1999  – 2006 University of Washington Computer Engineering,  Physics 1999  – 2006 University of Washington Computer Engineering,  Physics 1999  – 2006 University of Washington Computer Engineering,  Physics 1999  – 2006 ", "Experience Associate Howard B. Rockman P.C. May 2013  – Present (2 years 4 months) Chicago, IL Drafted patent applications, responded to office actions, patentability and freedom to use search request letters, letters of opinion, and memorandums. Drafted trademark and service mark applications and responded to office actions. Evaluated prior art and conducted legal research on all fields of intellectual property. Law Clerk Howard B. Rockman P.C. January 2011  –  May 2013  (2 years 5 months) Chicago, IL Drafted patent applications, responded to office actions, patentability and freedom to use search request letters, letters of opinion, and memorandums. Evaluated prior art and conducted legal research on all fields of intellectual property. Engineering Intern Intel Corporation June 2001  –  September 2001  (4 months) Designed and managed a database and a website. Database interacted with and was used through the website. Engineering Intern Intel Corporation May 2000  –  September 2000  (5 months) Reproduced customer issues. Tested security driver applications and worked on security driver customer evaluations. Assisted with customer management and obtained and researched customer specific requirements. Engineering Intern Intel Corporation May 1998  –  September 1998  (5 months) Assisted in developing the thermal mechanical solutions for the Mobile Pentium II packaged as the mini-cartridge as well as the Embedded Pentium II Module (EMC-2). Created a web research report on the latest heatsink, fan, and heatpipe technology. Tracked vendor milestones on a regular basis to ensure that the project stayed on schedule and provided feedback to vendors for design modifications. Procured and reviewed mechanical drawings of thermal solutions. Evaluated and recommended thermal attachment methods such as pins, clips, and fasteners. Evaluated and recommended thermal interface materials. Drove the thermal and mechanical performance testing. Published a customer presentation and thermal application note. This information was published on Intel’s website. Associate Howard B. Rockman P.C. May 2013  – Present (2 years 4 months) Chicago, IL Drafted patent applications, responded to office actions, patentability and freedom to use search request letters, letters of opinion, and memorandums. Drafted trademark and service mark applications and responded to office actions. Evaluated prior art and conducted legal research on all fields of intellectual property. Associate Howard B. Rockman P.C. May 2013  – Present (2 years 4 months) Chicago, IL Drafted patent applications, responded to office actions, patentability and freedom to use search request letters, letters of opinion, and memorandums. Drafted trademark and service mark applications and responded to office actions. Evaluated prior art and conducted legal research on all fields of intellectual property. Law Clerk Howard B. Rockman P.C. January 2011  –  May 2013  (2 years 5 months) Chicago, IL Drafted patent applications, responded to office actions, patentability and freedom to use search request letters, letters of opinion, and memorandums. Evaluated prior art and conducted legal research on all fields of intellectual property. Law Clerk Howard B. Rockman P.C. January 2011  –  May 2013  (2 years 5 months) Chicago, IL Drafted patent applications, responded to office actions, patentability and freedom to use search request letters, letters of opinion, and memorandums. Evaluated prior art and conducted legal research on all fields of intellectual property. Engineering Intern Intel Corporation June 2001  –  September 2001  (4 months) Designed and managed a database and a website. Database interacted with and was used through the website. Engineering Intern Intel Corporation June 2001  –  September 2001  (4 months) Designed and managed a database and a website. Database interacted with and was used through the website. Engineering Intern Intel Corporation May 2000  –  September 2000  (5 months) Reproduced customer issues. Tested security driver applications and worked on security driver customer evaluations. Assisted with customer management and obtained and researched customer specific requirements. Engineering Intern Intel Corporation May 2000  –  September 2000  (5 months) Reproduced customer issues. Tested security driver applications and worked on security driver customer evaluations. Assisted with customer management and obtained and researched customer specific requirements. Engineering Intern Intel Corporation May 1998  –  September 1998  (5 months) Assisted in developing the thermal mechanical solutions for the Mobile Pentium II packaged as the mini-cartridge as well as the Embedded Pentium II Module (EMC-2). Created a web research report on the latest heatsink, fan, and heatpipe technology. Tracked vendor milestones on a regular basis to ensure that the project stayed on schedule and provided feedback to vendors for design modifications. Procured and reviewed mechanical drawings of thermal solutions. Evaluated and recommended thermal attachment methods such as pins, clips, and fasteners. Evaluated and recommended thermal interface materials. Drove the thermal and mechanical performance testing. Published a customer presentation and thermal application note. This information was published on Intel’s website. Engineering Intern Intel Corporation May 1998  –  September 1998  (5 months) Assisted in developing the thermal mechanical solutions for the Mobile Pentium II packaged as the mini-cartridge as well as the Embedded Pentium II Module (EMC-2). Created a web research report on the latest heatsink, fan, and heatpipe technology. Tracked vendor milestones on a regular basis to ensure that the project stayed on schedule and provided feedback to vendors for design modifications. Procured and reviewed mechanical drawings of thermal solutions. Evaluated and recommended thermal attachment methods such as pins, clips, and fasteners. Evaluated and recommended thermal interface materials. Drove the thermal and mechanical performance testing. Published a customer presentation and thermal application note. This information was published on Intel’s website. Languages Castellano Castellano Castellano Skills Intellectual Property Legal Research Microsoft Office HTML C++ C Java Windows Research PowerPoint Microsoft Excel Microsoft Word ASP Oracle SQL Visual Basic Visual Studio Patent Prosecution See 2+     See less Skills  Intellectual Property Legal Research Microsoft Office HTML C++ C Java Windows Research PowerPoint Microsoft Excel Microsoft Word ASP Oracle SQL Visual Basic Visual Studio Patent Prosecution See 2+     See less Intellectual Property Legal Research Microsoft Office HTML C++ C Java Windows Research PowerPoint Microsoft Excel Microsoft Word ASP Oracle SQL Visual Basic Visual Studio Patent Prosecution See 2+     See less Intellectual Property Legal Research Microsoft Office HTML C++ C Java Windows Research PowerPoint Microsoft Excel Microsoft Word ASP Oracle SQL Visual Basic Visual Studio Patent Prosecution See 2+     See less Education The John Marshall Law School Doctor of Law (JD),  Intellectual Property Law 2006  – 2012 Activities and Societies:  Dean's Scholarship Purdue University Computer Engineering 2001  – 2002 Activities and Societies:  GEM Fellowship Recipient University of Michigan BSE,  Computer Engineering , Cum Laude 1996  – 2001 Activities and Societies:  Dean's Scholarship;\nIntel Scholarship;\nMichigan Marching Band The John Marshall Law School Doctor of Law (JD),  Intellectual Property Law 2006  – 2012 Activities and Societies:  Dean's Scholarship The John Marshall Law School Doctor of Law (JD),  Intellectual Property Law 2006  – 2012 Activities and Societies:  Dean's Scholarship The John Marshall Law School Doctor of Law (JD),  Intellectual Property Law 2006  – 2012 Activities and Societies:  Dean's Scholarship Purdue University Computer Engineering 2001  – 2002 Activities and Societies:  GEM Fellowship Recipient Purdue University Computer Engineering 2001  – 2002 Activities and Societies:  GEM Fellowship Recipient Purdue University Computer Engineering 2001  – 2002 Activities and Societies:  GEM Fellowship Recipient University of Michigan BSE,  Computer Engineering , Cum Laude 1996  – 2001 Activities and Societies:  Dean's Scholarship;\nIntel Scholarship;\nMichigan Marching Band University of Michigan BSE,  Computer Engineering , Cum Laude 1996  – 2001 Activities and Societies:  Dean's Scholarship;\nIntel Scholarship;\nMichigan Marching Band University of Michigan BSE,  Computer Engineering , Cum Laude 1996  – 2001 Activities and Societies:  Dean's Scholarship;\nIntel Scholarship;\nMichigan Marching Band ", "Experience Software Engineering Intern Intel Corporation July 2014  –  September 2014  (3 months) Hillsboro, OR Wrote and documented a simpler API for the configuration package Buxton. Developed a new notification system for the Tizen-specific Buxton package. Research Assistant Portland State University January 2014  –  July 2014  (7 months) Portland, OR Complete broad range of work on a Corpus Linguistics study \nFormat documents to preserve anonymity and prepare for concordancing software \nWrote a program to aid researchers in quickly fixing commonly mis-tagged words Grader Portland State University September 2013  –  April 2014  (8 months) Portland, Oregon Area Graded programs for a Programming Systems class Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Worked with a team to leverage my linguistics background to develop an algorithm for detecting question syntax in a natural language text. I cut costs for the implementation by replacing 3rd party software with a solution implemented with open source software. I compiled training and testing sets from available source corpora. Precision and recall both increased after using the system I developed. At the end of the internship, I demonstrated the uses for a group of managers by integrating it with Outlook as a plug-in. \n \nPatent pending for Question Detection in Natural Language. Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Developed open source ConnMan network manager command line interface and successfully finished, merged and distributed it online within deadline. \nBecame proficient in C programming language and Linux/ Unix tools with no prior experience. \nLearned the open source software development work flow Software Engineering Intern Intel Corporation July 2014  –  September 2014  (3 months) Hillsboro, OR Wrote and documented a simpler API for the configuration package Buxton. Developed a new notification system for the Tizen-specific Buxton package. Software Engineering Intern Intel Corporation July 2014  –  September 2014  (3 months) Hillsboro, OR Wrote and documented a simpler API for the configuration package Buxton. Developed a new notification system for the Tizen-specific Buxton package. Research Assistant Portland State University January 2014  –  July 2014  (7 months) Portland, OR Complete broad range of work on a Corpus Linguistics study \nFormat documents to preserve anonymity and prepare for concordancing software \nWrote a program to aid researchers in quickly fixing commonly mis-tagged words Research Assistant Portland State University January 2014  –  July 2014  (7 months) Portland, OR Complete broad range of work on a Corpus Linguistics study \nFormat documents to preserve anonymity and prepare for concordancing software \nWrote a program to aid researchers in quickly fixing commonly mis-tagged words Grader Portland State University September 2013  –  April 2014  (8 months) Portland, Oregon Area Graded programs for a Programming Systems class Grader Portland State University September 2013  –  April 2014  (8 months) Portland, Oregon Area Graded programs for a Programming Systems class Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Worked with a team to leverage my linguistics background to develop an algorithm for detecting question syntax in a natural language text. I cut costs for the implementation by replacing 3rd party software with a solution implemented with open source software. I compiled training and testing sets from available source corpora. Precision and recall both increased after using the system I developed. At the end of the internship, I demonstrated the uses for a group of managers by integrating it with Outlook as a plug-in. \n \nPatent pending for Question Detection in Natural Language. Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Worked with a team to leverage my linguistics background to develop an algorithm for detecting question syntax in a natural language text. I cut costs for the implementation by replacing 3rd party software with a solution implemented with open source software. I compiled training and testing sets from available source corpora. Precision and recall both increased after using the system I developed. At the end of the internship, I demonstrated the uses for a group of managers by integrating it with Outlook as a plug-in. \n \nPatent pending for Question Detection in Natural Language. Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Developed open source ConnMan network manager command line interface and successfully finished, merged and distributed it online within deadline. \nBecame proficient in C programming language and Linux/ Unix tools with no prior experience. \nLearned the open source software development work flow Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Developed open source ConnMan network manager command line interface and successfully finished, merged and distributed it online within deadline. \nBecame proficient in C programming language and Linux/ Unix tools with no prior experience. \nLearned the open source software development work flow Languages English French English French English French Skills Natural Language... Computational... Applied Linguistics Linguistics Software Development Software Engineering Corpus Linguistics Machine Learning Skills  Natural Language... Computational... Applied Linguistics Linguistics Software Development Software Engineering Corpus Linguistics Machine Learning Natural Language... Computational... Applied Linguistics Linguistics Software Development Software Engineering Corpus Linguistics Machine Learning Natural Language... Computational... Applied Linguistics Linguistics Software Development Software Engineering Corpus Linguistics Machine Learning Education University of Washington Master of Science (M.S.),  Computational Linguistics 2014  – 2015 Received a Computational Linguistics Scholarship \nImplemented a grammar fragment of Yakima Sahaptin in the HPSG framework using the Delph-in LinGo grammar matrix \nImplemented a variety of machine learning algorithms \nImplemented various types of gammars and parsers Portland State University Bachelor of Arts (B.A.),  Applied Linguistics , 3.8 2010  – 2014 Minors in Computer Science and French University of Washington Master of Science (M.S.),  Computational Linguistics 2014  – 2015 Received a Computational Linguistics Scholarship \nImplemented a grammar fragment of Yakima Sahaptin in the HPSG framework using the Delph-in LinGo grammar matrix \nImplemented a variety of machine learning algorithms \nImplemented various types of gammars and parsers University of Washington Master of Science (M.S.),  Computational Linguistics 2014  – 2015 Received a Computational Linguistics Scholarship \nImplemented a grammar fragment of Yakima Sahaptin in the HPSG framework using the Delph-in LinGo grammar matrix \nImplemented a variety of machine learning algorithms \nImplemented various types of gammars and parsers University of Washington Master of Science (M.S.),  Computational Linguistics 2014  – 2015 Received a Computational Linguistics Scholarship \nImplemented a grammar fragment of Yakima Sahaptin in the HPSG framework using the Delph-in LinGo grammar matrix \nImplemented a variety of machine learning algorithms \nImplemented various types of gammars and parsers Portland State University Bachelor of Arts (B.A.),  Applied Linguistics , 3.8 2010  – 2014 Minors in Computer Science and French Portland State University Bachelor of Arts (B.A.),  Applied Linguistics , 3.8 2010  – 2014 Minors in Computer Science and French Portland State University Bachelor of Arts (B.A.),  Applied Linguistics , 3.8 2010  – 2014 Minors in Computer Science and French ", "Summary Chris S. Crawford Jr. is a Computer and Information Science Ph.D. student at the University of Florida (UF). Before attending UF, Chris received his B.S. in Computer Science from the University of Alabama. Currently he is looking into ways to integrate new leading edge technologies with his research in Brain-Robot Interaction. Chis currently also serves as Technical Architect for Ubind and Lead Software Engineer for SeniorGeek Communications, LLC. Summary Chris S. Crawford Jr. is a Computer and Information Science Ph.D. student at the University of Florida (UF). Before attending UF, Chris received his B.S. in Computer Science from the University of Alabama. Currently he is looking into ways to integrate new leading edge technologies with his research in Brain-Robot Interaction. Chis currently also serves as Technical Architect for Ubind and Lead Software Engineer for SeniorGeek Communications, LLC. Chris S. Crawford Jr. is a Computer and Information Science Ph.D. student at the University of Florida (UF). Before attending UF, Chris received his B.S. in Computer Science from the University of Alabama. Currently he is looking into ways to integrate new leading edge technologies with his research in Brain-Robot Interaction. Chis currently also serves as Technical Architect for Ubind and Lead Software Engineer for SeniorGeek Communications, LLC. Chris S. Crawford Jr. is a Computer and Information Science Ph.D. student at the University of Florida (UF). Before attending UF, Chris received his B.S. in Computer Science from the University of Alabama. Currently he is looking into ways to integrate new leading edge technologies with his research in Brain-Robot Interaction. Chis currently also serves as Technical Architect for Ubind and Lead Software Engineer for SeniorGeek Communications, LLC. Experience Software Engineering Intern Intel Corporation May 2014  – Present (1 year 4 months) Santa Clara, CA Working on perceptual computing project. Lead Software Engineer SeniorGeek Communications, LLC April 2013  – Present (2 years 5 months) Overseas software product development/design. Technical Architect Ubind August 2011  – Present (4 years 1 month) Consulted Ubind business development team on overall architecture helping to stream line the  \ntechnical design and development process. \nConstructed Ubind’s Drupal platform as well as, the company’s overall infrastructure, also \nconfigured the mySQL database and Apache server. \nCreated and initiated development standards including but not limited to spacing, naming  \nconventions, and letter case; which in turn made the code easier to read and uniform. Software Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Santa Clara, CA Developed real-time interactive programming tool to assist developers. Computer Science Department Undergradute Reseracher University of Alabama May 2010  –  May 2012  (2 years 1 month) Robotics research \nWeb-based application development \nRobotic simulation development \nClient server system development Software Engineering Intern Intel Corporation May 2014  – Present (1 year 4 months) Santa Clara, CA Working on perceptual computing project. Software Engineering Intern Intel Corporation May 2014  – Present (1 year 4 months) Santa Clara, CA Working on perceptual computing project. Lead Software Engineer SeniorGeek Communications, LLC April 2013  – Present (2 years 5 months) Overseas software product development/design. Lead Software Engineer SeniorGeek Communications, LLC April 2013  – Present (2 years 5 months) Overseas software product development/design. Technical Architect Ubind August 2011  – Present (4 years 1 month) Consulted Ubind business development team on overall architecture helping to stream line the  \ntechnical design and development process. \nConstructed Ubind’s Drupal platform as well as, the company’s overall infrastructure, also \nconfigured the mySQL database and Apache server. \nCreated and initiated development standards including but not limited to spacing, naming  \nconventions, and letter case; which in turn made the code easier to read and uniform. Technical Architect Ubind August 2011  – Present (4 years 1 month) Consulted Ubind business development team on overall architecture helping to stream line the  \ntechnical design and development process. \nConstructed Ubind’s Drupal platform as well as, the company’s overall infrastructure, also \nconfigured the mySQL database and Apache server. \nCreated and initiated development standards including but not limited to spacing, naming  \nconventions, and letter case; which in turn made the code easier to read and uniform. Software Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Santa Clara, CA Developed real-time interactive programming tool to assist developers. Software Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Santa Clara, CA Developed real-time interactive programming tool to assist developers. Computer Science Department Undergradute Reseracher University of Alabama May 2010  –  May 2012  (2 years 1 month) Robotics research \nWeb-based application development \nRobotic simulation development \nClient server system development Computer Science Department Undergradute Reseracher University of Alabama May 2010  –  May 2012  (2 years 1 month) Robotics research \nWeb-based application development \nRobotic simulation development \nClient server system development Skills HTML SQL C++ Java jQuery Node.js C Python JavaScript Robotics Skills  HTML SQL C++ Java jQuery Node.js C Python JavaScript Robotics HTML SQL C++ Java jQuery Node.js C Python JavaScript Robotics HTML SQL C++ Java jQuery Node.js C Python JavaScript Robotics Education University of Florida Doctor of Philosophy (PhD),  Computer & Information Science & Engineering Department 2014  – 2017 University of Alabama Bachelor of Science (BS),  Computer Science , 3.64 2008  – 2012 University of Florida Doctor of Philosophy (PhD),  Computer & Information Science & Engineering Department 2014  – 2017 University of Florida Doctor of Philosophy (PhD),  Computer & Information Science & Engineering Department 2014  – 2017 University of Florida Doctor of Philosophy (PhD),  Computer & Information Science & Engineering Department 2014  – 2017 University of Alabama Bachelor of Science (BS),  Computer Science , 3.64 2008  – 2012 University of Alabama Bachelor of Science (BS),  Computer Science , 3.64 2008  – 2012 University of Alabama Bachelor of Science (BS),  Computer Science , 3.64 2008  – 2012 ", "Experience Research Intern Microsoft June 2015  – Present (3 months) Greater New York City Area Research Assistant Brown University 2013  – Present (2 years) Teaching Assistant - First Byte of Computer Science Brown University January 2015  –  May 2015  (5 months) Teaching Assistant - Artificial Intelligence Brown University September 2014  –  December 2014  (4 months) Teaching Assistant - Data Structures Carleton College January 2013  –  March 2013  (3 months) Teaching Assistant - Logic Carleton College September 2012  –  November 2012  (3 months) Northfield, MN Engineering Intern - Graphics Qualcomm June 2012  –  August 2012  (3 months) Boulder, CO Teaching Assistant - Intro To Computer Science Carleton College May 2011  –  June 2012  (1 year 2 months) Northfield, MN Software Engineering Intern Qualcomm June 2011  –  August 2011  (3 months) Boulder, CO Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, Oregon Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, OR Research Intern Microsoft June 2015  – Present (3 months) Greater New York City Area Research Intern Microsoft June 2015  – Present (3 months) Greater New York City Area Research Assistant Brown University 2013  – Present (2 years) Research Assistant Brown University 2013  – Present (2 years) Teaching Assistant - First Byte of Computer Science Brown University January 2015  –  May 2015  (5 months) Teaching Assistant - First Byte of Computer Science Brown University January 2015  –  May 2015  (5 months) Teaching Assistant - Artificial Intelligence Brown University September 2014  –  December 2014  (4 months) Teaching Assistant - Artificial Intelligence Brown University September 2014  –  December 2014  (4 months) Teaching Assistant - Data Structures Carleton College January 2013  –  March 2013  (3 months) Teaching Assistant - Data Structures Carleton College January 2013  –  March 2013  (3 months) Teaching Assistant - Logic Carleton College September 2012  –  November 2012  (3 months) Northfield, MN Teaching Assistant - Logic Carleton College September 2012  –  November 2012  (3 months) Northfield, MN Engineering Intern - Graphics Qualcomm June 2012  –  August 2012  (3 months) Boulder, CO Engineering Intern - Graphics Qualcomm June 2012  –  August 2012  (3 months) Boulder, CO Teaching Assistant - Intro To Computer Science Carleton College May 2011  –  June 2012  (1 year 2 months) Northfield, MN Teaching Assistant - Intro To Computer Science Carleton College May 2011  –  June 2012  (1 year 2 months) Northfield, MN Software Engineering Intern Qualcomm June 2011  –  August 2011  (3 months) Boulder, CO Software Engineering Intern Qualcomm June 2011  –  August 2011  (3 months) Boulder, CO Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, Oregon Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, Oregon Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, OR Skills Algorithms Computer Science Artificial Intelligence Reinforcement Learning Philosophy Discrete Mathematics Teaching Machine Learning LaTeX Python Logic Software Development Java C Programming Matlab Academic Tutoring Research See 3+     See less Skills  Algorithms Computer Science Artificial Intelligence Reinforcement Learning Philosophy Discrete Mathematics Teaching Machine Learning LaTeX Python Logic Software Development Java C Programming Matlab Academic Tutoring Research See 3+     See less Algorithms Computer Science Artificial Intelligence Reinforcement Learning Philosophy Discrete Mathematics Teaching Machine Learning LaTeX Python Logic Software Development Java C Programming Matlab Academic Tutoring Research See 3+     See less Algorithms Computer Science Artificial Intelligence Reinforcement Learning Philosophy Discrete Mathematics Teaching Machine Learning LaTeX Python Logic Software Development Java C Programming Matlab Academic Tutoring Research See 3+     See less Education Brown University Doctor of Philosophy (Ph.D.) 2015  – 2020 Brown University Master of Science (M.S.) 2013  – 2015 Carleton College Bachelor of Arts (B.A.) 2009  – 2013 Brown University Doctor of Philosophy (Ph.D.) 2015  – 2020 Brown University Doctor of Philosophy (Ph.D.) 2015  – 2020 Brown University Doctor of Philosophy (Ph.D.) 2015  – 2020 Brown University Master of Science (M.S.) 2013  – 2015 Brown University Master of Science (M.S.) 2013  – 2015 Brown University Master of Science (M.S.) 2013  – 2015 Carleton College Bachelor of Arts (B.A.) 2009  – 2013 Carleton College Bachelor of Arts (B.A.) 2009  – 2013 Carleton College Bachelor of Arts (B.A.) 2009  – 2013 ", "Languages English Native or bilingual proficiency Taiwanese Elementary proficiency French Elementary proficiency English Native or bilingual proficiency Taiwanese Elementary proficiency French Elementary proficiency English Native or bilingual proficiency Taiwanese Elementary proficiency French Elementary proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Consumer Products Customer Insight Strategy Marketing Management Product Management Strategic Planning Product Marketing Marketing Market Planning Cross-functional Team... Technical Marketing Product Development Product Innovation Marketing Strategy Product Launch E-commerce Competitive Analysis Segmentation Positioning See 4+     See less Skills  Consumer Products Customer Insight Strategy Marketing Management Product Management Strategic Planning Product Marketing Marketing Market Planning Cross-functional Team... Technical Marketing Product Development Product Innovation Marketing Strategy Product Launch E-commerce Competitive Analysis Segmentation Positioning See 4+     See less Consumer Products Customer Insight Strategy Marketing Management Product Management Strategic Planning Product Marketing Marketing Market Planning Cross-functional Team... Technical Marketing Product Development Product Innovation Marketing Strategy Product Launch E-commerce Competitive Analysis Segmentation Positioning See 4+     See less Consumer Products Customer Insight Strategy Marketing Management Product Management Strategic Planning Product Marketing Marketing Market Planning Cross-functional Team... Technical Marketing Product Development Product Innovation Marketing Strategy Product Launch E-commerce Competitive Analysis Segmentation Positioning See 4+     See less ", "Summary I am a PhD student at the University of California, Irvine. I obtained my BS in electrical and computer engineering from The Ohio State University and my MS in computer science from the University of Michigan. Summary I am a PhD student at the University of California, Irvine. I obtained my BS in electrical and computer engineering from The Ohio State University and my MS in computer science from the University of Michigan. I am a PhD student at the University of California, Irvine. I obtained my BS in electrical and computer engineering from The Ohio State University and my MS in computer science from the University of Michigan. I am a PhD student at the University of California, Irvine. I obtained my BS in electrical and computer engineering from The Ohio State University and my MS in computer science from the University of Michigan. Experience Machine Learning Research Intern Microsoft June 2015  – Present (3 months) Beijing City, China Machine Learning Research Intern Adobe May 2014  – Present (1 year 4 months) San Francisco Bay Area Computer Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Santa Clara, California Create software tools to automate the design of circuits. Computer Engineering Intern Intel Corporation April 2012  –  August 2012  (5 months) Create software tools to automate the design of circuits. Computer Engineering Intern Intel Corporation June 2011  –  September 2011  (4 months) Create software tools to automate the design of circuits. Machine Learning Research Intern Microsoft June 2015  – Present (3 months) Beijing City, China Machine Learning Research Intern Microsoft June 2015  – Present (3 months) Beijing City, China Machine Learning Research Intern Adobe May 2014  – Present (1 year 4 months) San Francisco Bay Area Machine Learning Research Intern Adobe May 2014  – Present (1 year 4 months) San Francisco Bay Area Computer Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Santa Clara, California Create software tools to automate the design of circuits. Computer Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Santa Clara, California Create software tools to automate the design of circuits. Computer Engineering Intern Intel Corporation April 2012  –  August 2012  (5 months) Create software tools to automate the design of circuits. Computer Engineering Intern Intel Corporation April 2012  –  August 2012  (5 months) Create software tools to automate the design of circuits. Computer Engineering Intern Intel Corporation June 2011  –  September 2011  (4 months) Create software tools to automate the design of circuits. Computer Engineering Intern Intel Corporation June 2011  –  September 2011  (4 months) Create software tools to automate the design of circuits. Languages English Native or bilingual proficiency Spanish Limited working proficiency Chinese Elementary proficiency English Native or bilingual proficiency Spanish Limited working proficiency Chinese Elementary proficiency English Native or bilingual proficiency Spanish Limited working proficiency Chinese Elementary proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Java Matlab VHDL SPICE Simulink C++ Programming Electrical Engineering Machine Learning Artificial Neural... Perl TCL Weka dSPACE C ModelSim Altera Quartus Algorithms See 3+     See less Skills  Java Matlab VHDL SPICE Simulink C++ Programming Electrical Engineering Machine Learning Artificial Neural... Perl TCL Weka dSPACE C ModelSim Altera Quartus Algorithms See 3+     See less Java Matlab VHDL SPICE Simulink C++ Programming Electrical Engineering Machine Learning Artificial Neural... Perl TCL Weka dSPACE C ModelSim Altera Quartus Algorithms See 3+     See less Java Matlab VHDL SPICE Simulink C++ Programming Electrical Engineering Machine Learning Artificial Neural... Perl TCL Weka dSPACE C ModelSim Altera Quartus Algorithms See 3+     See less Education University of California, Irvine Computer Science (PhD),  Machine Learning 2014  – 2018 University of Michigan Master of Science (MS),  Machine Learning 2012  – 2014 Activities and Societies:  SMES-G ,  Engineering Outreach The Ohio State University Bachelor of Science (BS),  Computer Engineering 2008  – 2012 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Lambda Psi ,  Europa (Ohio State CSE Research Group) ,  Electrical Engineering Outreach Program Saint John's College High School University of California, Irvine Computer Science (PhD),  Machine Learning 2014  – 2018 University of California, Irvine Computer Science (PhD),  Machine Learning 2014  – 2018 University of California, Irvine Computer Science (PhD),  Machine Learning 2014  – 2018 University of Michigan Master of Science (MS),  Machine Learning 2012  – 2014 Activities and Societies:  SMES-G ,  Engineering Outreach University of Michigan Master of Science (MS),  Machine Learning 2012  – 2014 Activities and Societies:  SMES-G ,  Engineering Outreach University of Michigan Master of Science (MS),  Machine Learning 2012  – 2014 Activities and Societies:  SMES-G ,  Engineering Outreach The Ohio State University Bachelor of Science (BS),  Computer Engineering 2008  – 2012 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Lambda Psi ,  Europa (Ohio State CSE Research Group) ,  Electrical Engineering Outreach Program The Ohio State University Bachelor of Science (BS),  Computer Engineering 2008  – 2012 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Lambda Psi ,  Europa (Ohio State CSE Research Group) ,  Electrical Engineering Outreach Program The Ohio State University Bachelor of Science (BS),  Computer Engineering 2008  – 2012 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Lambda Psi ,  Europa (Ohio State CSE Research Group) ,  Electrical Engineering Outreach Program Saint John's College High School Saint John's College High School Saint John's College High School Honors & Awards "]}