{"position": "Engineering TD Manager", "company": "Intel Corporation", "profiles": ["Experience Engineering TD Manager Intel Corporation August 2013  – Present (2 years 1 month) Process Engineering - Intel Corporation Intel Corporation September 1996  – Present (19 years) Field Service Engineer Lam Research October 1993  –  August 1996  (2 years 11 months) Engineering TD Manager Intel Corporation August 2013  – Present (2 years 1 month) Engineering TD Manager Intel Corporation August 2013  – Present (2 years 1 month) Process Engineering - Intel Corporation Intel Corporation September 1996  – Present (19 years) Process Engineering - Intel Corporation Intel Corporation September 1996  – Present (19 years) Field Service Engineer Lam Research October 1993  –  August 1996  (2 years 11 months) Field Service Engineer Lam Research October 1993  –  August 1996  (2 years 11 months) Skills SoC Semiconductors Lean Manufacturing SPC JMP Design of Experiments Failure Analysis Process Engineering Skills  SoC Semiconductors Lean Manufacturing SPC JMP Design of Experiments Failure Analysis Process Engineering SoC Semiconductors Lean Manufacturing SPC JMP Design of Experiments Failure Analysis Process Engineering SoC Semiconductors Lean Manufacturing SPC JMP Design of Experiments Failure Analysis Process Engineering Education DeVry University 1991  – 1993 DeVry University 1991  – 1993 DeVry University 1991  – 1993 DeVry University 1991  – 1993 ", "Summary Specialties:Semiconductor Processing Summary Specialties:Semiconductor Processing Specialties:Semiconductor Processing Specialties:Semiconductor Processing Experience Engineering TD Manager Intel Corporation June 2012  – Present (3 years 3 months) Hillsboro, OR Sr. Process Engineer Intel Corporation October 2004  –  June 2012  (7 years 9 months) Sr Process Engineer in the Front End Metallization Division. Graduate Research Assistant University of California, Los Angeles January 2001  –  October 2004  (3 years 10 months) Teaching Assistant University of California, Los Angeles January 2001  –  October 2004  (3 years 10 months) Summer Intern Zuari Industries Ltd May 2003  –  July 2003  (3 months) Engineering TD Manager Intel Corporation June 2012  – Present (3 years 3 months) Hillsboro, OR Engineering TD Manager Intel Corporation June 2012  – Present (3 years 3 months) Hillsboro, OR Sr. Process Engineer Intel Corporation October 2004  –  June 2012  (7 years 9 months) Sr Process Engineer in the Front End Metallization Division. Sr. Process Engineer Intel Corporation October 2004  –  June 2012  (7 years 9 months) Sr Process Engineer in the Front End Metallization Division. Graduate Research Assistant University of California, Los Angeles January 2001  –  October 2004  (3 years 10 months) Graduate Research Assistant University of California, Los Angeles January 2001  –  October 2004  (3 years 10 months) Teaching Assistant University of California, Los Angeles January 2001  –  October 2004  (3 years 10 months) Teaching Assistant University of California, Los Angeles January 2001  –  October 2004  (3 years 10 months) Summer Intern Zuari Industries Ltd May 2003  –  July 2003  (3 months) Summer Intern Zuari Industries Ltd May 2003  –  July 2003  (3 months) Skills Failure Analysis PVD JMP CMOS Photolithography Manufacturing Matlab Nanotechnology Thin Films Engineering CVD Semiconductor Industry R&D Process Simulation Engineering Management Etching Simulations IC SPC Process Engineering Chemical Engineering Characterization See 7+     See less Skills  Failure Analysis PVD JMP CMOS Photolithography Manufacturing Matlab Nanotechnology Thin Films Engineering CVD Semiconductor Industry R&D Process Simulation Engineering Management Etching Simulations IC SPC Process Engineering Chemical Engineering Characterization See 7+     See less Failure Analysis PVD JMP CMOS Photolithography Manufacturing Matlab Nanotechnology Thin Films Engineering CVD Semiconductor Industry R&D Process Simulation Engineering Management Etching Simulations IC SPC Process Engineering Chemical Engineering Characterization See 7+     See less Failure Analysis PVD JMP CMOS Photolithography Manufacturing Matlab Nanotechnology Thin Films Engineering CVD Semiconductor Industry R&D Process Simulation Engineering Management Etching Simulations IC SPC Process Engineering Chemical Engineering Characterization See 7+     See less Education University of California, Los Angeles Ph.D,  Chemical Engineering 2000  – 2004 Thesis: Experimental and Theoretical Studies of High-k Dielectrics on Silicon Indian Institute of Technology, Kharagpur B. Tech (Hons.),  Chemical Engineering 1996  – 2000 University of California, Los Angeles Ph.D,  Chemical Engineering 2000  – 2004 Thesis: Experimental and Theoretical Studies of High-k Dielectrics on Silicon University of California, Los Angeles Ph.D,  Chemical Engineering 2000  – 2004 Thesis: Experimental and Theoretical Studies of High-k Dielectrics on Silicon University of California, Los Angeles Ph.D,  Chemical Engineering 2000  – 2004 Thesis: Experimental and Theoretical Studies of High-k Dielectrics on Silicon Indian Institute of Technology, Kharagpur B. Tech (Hons.),  Chemical Engineering 1996  – 2000 Indian Institute of Technology, Kharagpur B. Tech (Hons.),  Chemical Engineering 1996  – 2000 Indian Institute of Technology, Kharagpur B. Tech (Hons.),  Chemical Engineering 1996  – 2000 ", "Experience Engineering Technology Development Manager Intel Corporation January 2008  – Present (7 years 8 months) Design Automation Engineer Intel Corporation September 2001  –  December 2007  (6 years 4 months) Engineering Technology Development Manager Intel Corporation January 2008  – Present (7 years 8 months) Engineering Technology Development Manager Intel Corporation January 2008  – Present (7 years 8 months) Design Automation Engineer Intel Corporation September 2001  –  December 2007  (6 years 4 months) Design Automation Engineer Intel Corporation September 2001  –  December 2007  (6 years 4 months) Languages Hindi Hindi Hindi Skills CAD Tools EDA Project Management Circuit Simulators Parasitic Extraction Technical Staff... Skills  CAD Tools EDA Project Management Circuit Simulators Parasitic Extraction Technical Staff... CAD Tools EDA Project Management Circuit Simulators Parasitic Extraction Technical Staff... CAD Tools EDA Project Management Circuit Simulators Parasitic Extraction Technical Staff... Education University of Illinois at Chicago Master of Science (MS),  Computer Engineering University of Mumbai Bachelor of Science (BS),  Electrical and Electronics Engineering University of Illinois at Chicago Master of Science (MS),  Computer Engineering University of Illinois at Chicago Master of Science (MS),  Computer Engineering University of Illinois at Chicago Master of Science (MS),  Computer Engineering University of Mumbai Bachelor of Science (BS),  Electrical and Electronics Engineering University of Mumbai Bachelor of Science (BS),  Electrical and Electronics Engineering University of Mumbai Bachelor of Science (BS),  Electrical and Electronics Engineering ", "Experience Engineering TD manager Intel Corporation June 2011  – Present (4 years 3 months) Chandler, Arizona Development of next generation HDI substrate manufacturing and HDI device packaging technology Staff engineer Intel Corporation April 2008  –  March 2013  (5 years) Chandler, AZ HDI substrate development in support of 22nm and 14nm HDI technology enabling; integration of vaious technology building blocks and coordination of internal and external development resources; supplier tech enabling and management; path finding research on disruptive technologies; technology roadmap definition and enabling; next generation HDI packaging technology development Sr. Process Engineer Intel Corporation November 2005  –  March 2008  (2 years 5 months) Chandler, AZ HDI substrate process development in support of 45nm and 32nm HDI technology enabling; supplier tech enabling and management; technology roadmap definition and enabling for certain modules; path finding research on disruptive technologies; project management. Sr. Scientist Controlled Semiconductor, Inc. November 2004  –  October 2005  (1 year) Orlando, Florida Area Development of laser based tools for semiconductor industry Research Scientist Excel Technology, Inc. October 2002  –  November 2004  (2 years 2 months) Orlando, Florida Area Development of laser applications for microprocessing and microfabrication of various materials; laser based system integration with main responsibilities in lasers and optics (laser selection, optical train design, laser beam manipulation and delivery mechanisms); process and tool co-optimization for quality and cost of ownership Engineering TD manager Intel Corporation June 2011  – Present (4 years 3 months) Chandler, Arizona Development of next generation HDI substrate manufacturing and HDI device packaging technology Engineering TD manager Intel Corporation June 2011  – Present (4 years 3 months) Chandler, Arizona Development of next generation HDI substrate manufacturing and HDI device packaging technology Staff engineer Intel Corporation April 2008  –  March 2013  (5 years) Chandler, AZ HDI substrate development in support of 22nm and 14nm HDI technology enabling; integration of vaious technology building blocks and coordination of internal and external development resources; supplier tech enabling and management; path finding research on disruptive technologies; technology roadmap definition and enabling; next generation HDI packaging technology development Staff engineer Intel Corporation April 2008  –  March 2013  (5 years) Chandler, AZ HDI substrate development in support of 22nm and 14nm HDI technology enabling; integration of vaious technology building blocks and coordination of internal and external development resources; supplier tech enabling and management; path finding research on disruptive technologies; technology roadmap definition and enabling; next generation HDI packaging technology development Sr. Process Engineer Intel Corporation November 2005  –  March 2008  (2 years 5 months) Chandler, AZ HDI substrate process development in support of 45nm and 32nm HDI technology enabling; supplier tech enabling and management; technology roadmap definition and enabling for certain modules; path finding research on disruptive technologies; project management. Sr. Process Engineer Intel Corporation November 2005  –  March 2008  (2 years 5 months) Chandler, AZ HDI substrate process development in support of 45nm and 32nm HDI technology enabling; supplier tech enabling and management; technology roadmap definition and enabling for certain modules; path finding research on disruptive technologies; project management. Sr. Scientist Controlled Semiconductor, Inc. November 2004  –  October 2005  (1 year) Orlando, Florida Area Development of laser based tools for semiconductor industry Sr. Scientist Controlled Semiconductor, Inc. November 2004  –  October 2005  (1 year) Orlando, Florida Area Development of laser based tools for semiconductor industry Research Scientist Excel Technology, Inc. October 2002  –  November 2004  (2 years 2 months) Orlando, Florida Area Development of laser applications for microprocessing and microfabrication of various materials; laser based system integration with main responsibilities in lasers and optics (laser selection, optical train design, laser beam manipulation and delivery mechanisms); process and tool co-optimization for quality and cost of ownership Research Scientist Excel Technology, Inc. October 2002  –  November 2004  (2 years 2 months) Orlando, Florida Area Development of laser applications for microprocessing and microfabrication of various materials; laser based system integration with main responsibilities in lasers and optics (laser selection, optical train design, laser beam manipulation and delivery mechanisms); process and tool co-optimization for quality and cost of ownership Languages English Chinese English Chinese English Chinese Skills Semiconductors Photonics Materials Science IC Materials engineering, HDI substrate and... Laser material... Laser microprocessing Laser system... Structured problem... Project management Engineering management Nanotechnology Process Integration PVD Laser Engineering Management Optics Simulations Process Simulation Electronics Engineering R&D SPC Manufacturing See 10+     See less Skills  Semiconductors Photonics Materials Science IC Materials engineering, HDI substrate and... Laser material... Laser microprocessing Laser system... Structured problem... Project management Engineering management Nanotechnology Process Integration PVD Laser Engineering Management Optics Simulations Process Simulation Electronics Engineering R&D SPC Manufacturing See 10+     See less Semiconductors Photonics Materials Science IC Materials engineering, HDI substrate and... Laser material... Laser microprocessing Laser system... Structured problem... Project management Engineering management Nanotechnology Process Integration PVD Laser Engineering Management Optics Simulations Process Simulation Electronics Engineering R&D SPC Manufacturing See 10+     See less Semiconductors Photonics Materials Science IC Materials engineering, HDI substrate and... Laser material... Laser microprocessing Laser system... Structured problem... Project management Engineering management Nanotechnology Process Integration PVD Laser Engineering Management Optics Simulations Process Simulation Electronics Engineering R&D SPC Manufacturing See 10+     See less Education CREOL/School of Optics, University of Central Florida Doctor of Philosophy (Ph.D.),  Material Sci. & Eng. 1999  – 2012 Department of Mater. Sci. & Eng., Tsinghua University Master's degree,  Laser Material Processing and Materials Engineering 1991  – 1994 Department of Mater. Sci. & Eng., Tsinghua University Bachelor's degree,  Materials Science 1986  – 1991 CREOL/School of Optics, University of Central Florida Doctor of Philosophy (Ph.D.),  Material Sci. & Eng. 1999  – 2012 CREOL/School of Optics, University of Central Florida Doctor of Philosophy (Ph.D.),  Material Sci. & Eng. 1999  – 2012 CREOL/School of Optics, University of Central Florida Doctor of Philosophy (Ph.D.),  Material Sci. & Eng. 1999  – 2012 Department of Mater. Sci. & Eng., Tsinghua University Master's degree,  Laser Material Processing and Materials Engineering 1991  – 1994 Department of Mater. Sci. & Eng., Tsinghua University Master's degree,  Laser Material Processing and Materials Engineering 1991  – 1994 Department of Mater. Sci. & Eng., Tsinghua University Master's degree,  Laser Material Processing and Materials Engineering 1991  – 1994 Department of Mater. Sci. & Eng., Tsinghua University Bachelor's degree,  Materials Science 1986  – 1991 Department of Mater. Sci. & Eng., Tsinghua University Bachelor's degree,  Materials Science 1986  – 1991 Department of Mater. Sci. & Eng., Tsinghua University Bachelor's degree,  Materials Science 1986  – 1991 ", "Summary I'm an Engineering TD manager in Intel's manufacturing R&D organization in Hillsboro, OR. I manage a team currently working on defect review SEM tool development for the 10 and 7 nm manufacturing process. Summary I'm an Engineering TD manager in Intel's manufacturing R&D organization in Hillsboro, OR. I manage a team currently working on defect review SEM tool development for the 10 and 7 nm manufacturing process. I'm an Engineering TD manager in Intel's manufacturing R&D organization in Hillsboro, OR. I manage a team currently working on defect review SEM tool development for the 10 and 7 nm manufacturing process. I'm an Engineering TD manager in Intel's manufacturing R&D organization in Hillsboro, OR. I manage a team currently working on defect review SEM tool development for the 10 and 7 nm manufacturing process. Experience Engineering TD manager Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, OR I manage the defect review SEM group in Intel's 10 and 7 nm TD organization. Senior Process Engineer Intel January 2008  –  October 2013  (5 years 10 months) Defect metrology engineer that worked on SEM tool development and associated systems for Intel's 32, 22, and 14 nm manufacturing process.  Research Scientist Brookhaven National Laboratory January 2007  –  January 2008  (1 year 1 month) I worked on fabrication and testing of RF superconducting cavities for Energy recovery linear accelerators. Engineering TD manager Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, OR I manage the defect review SEM group in Intel's 10 and 7 nm TD organization. Engineering TD manager Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, OR I manage the defect review SEM group in Intel's 10 and 7 nm TD organization. Senior Process Engineer Intel January 2008  –  October 2013  (5 years 10 months) Defect metrology engineer that worked on SEM tool development and associated systems for Intel's 32, 22, and 14 nm manufacturing process.  Senior Process Engineer Intel January 2008  –  October 2013  (5 years 10 months) Defect metrology engineer that worked on SEM tool development and associated systems for Intel's 32, 22, and 14 nm manufacturing process.  Research Scientist Brookhaven National Laboratory January 2007  –  January 2008  (1 year 1 month) I worked on fabrication and testing of RF superconducting cavities for Energy recovery linear accelerators. Research Scientist Brookhaven National Laboratory January 2007  –  January 2008  (1 year 1 month) I worked on fabrication and testing of RF superconducting cavities for Energy recovery linear accelerators. Languages   Skills Skills     Education University of Arizona Ph.D.,  Optics/Optical Sciences 2003  – 2006 PhD in Optical Sciences Activities and Societies:  IEEE ,  SPIE Rutgers University-New Brunswick MS,  Electrical Engineering 2001  – 2003 MS in Electrical and Computer Engineering University of Mumbai BE,  Electonics Engineering 1997  – 2001 BS in Electronics Engineering University of Arizona Ph.D.,  Optics/Optical Sciences 2003  – 2006 PhD in Optical Sciences Activities and Societies:  IEEE ,  SPIE University of Arizona Ph.D.,  Optics/Optical Sciences 2003  – 2006 PhD in Optical Sciences Activities and Societies:  IEEE ,  SPIE University of Arizona Ph.D.,  Optics/Optical Sciences 2003  – 2006 PhD in Optical Sciences Activities and Societies:  IEEE ,  SPIE Rutgers University-New Brunswick MS,  Electrical Engineering 2001  – 2003 MS in Electrical and Computer Engineering Rutgers University-New Brunswick MS,  Electrical Engineering 2001  – 2003 MS in Electrical and Computer Engineering Rutgers University-New Brunswick MS,  Electrical Engineering 2001  – 2003 MS in Electrical and Computer Engineering University of Mumbai BE,  Electonics Engineering 1997  – 2001 BS in Electronics Engineering University of Mumbai BE,  Electonics Engineering 1997  – 2001 BS in Electronics Engineering University of Mumbai BE,  Electonics Engineering 1997  – 2001 BS in Electronics Engineering ", "Experience Engineering TD Manager Intel Corporation Engineering TD Manager Intel Corporation Engineering TD Manager Intel Corporation ", "Summary Highly accomplished and self-driven engineering manager with 10 years of experience in CMOS process/product development covering both R&D and high volume manufacturing development. Extensive knowledge and experiences in process development, DOEs, data analysis, statistical tools, defect metrology development, yield improvement, process tool development, inline/end-of-line E-test development, and Burn-In reliability stress module development. Highly skilled at project management including current position as an engaged manager to two teams of 9 technical engineers. Strong analytical thinking and attention to details with ability to excel in diverse technical fields and adaptability to dynamic and fast-paced environments. Summary Highly accomplished and self-driven engineering manager with 10 years of experience in CMOS process/product development covering both R&D and high volume manufacturing development. Extensive knowledge and experiences in process development, DOEs, data analysis, statistical tools, defect metrology development, yield improvement, process tool development, inline/end-of-line E-test development, and Burn-In reliability stress module development. Highly skilled at project management including current position as an engaged manager to two teams of 9 technical engineers. Strong analytical thinking and attention to details with ability to excel in diverse technical fields and adaptability to dynamic and fast-paced environments. Highly accomplished and self-driven engineering manager with 10 years of experience in CMOS process/product development covering both R&D and high volume manufacturing development. Extensive knowledge and experiences in process development, DOEs, data analysis, statistical tools, defect metrology development, yield improvement, process tool development, inline/end-of-line E-test development, and Burn-In reliability stress module development. Highly skilled at project management including current position as an engaged manager to two teams of 9 technical engineers. Strong analytical thinking and attention to details with ability to excel in diverse technical fields and adaptability to dynamic and fast-paced environments. Highly accomplished and self-driven engineering manager with 10 years of experience in CMOS process/product development covering both R&D and high volume manufacturing development. Extensive knowledge and experiences in process development, DOEs, data analysis, statistical tools, defect metrology development, yield improvement, process tool development, inline/end-of-line E-test development, and Burn-In reliability stress module development. Highly skilled at project management including current position as an engaged manager to two teams of 9 technical engineers. Strong analytical thinking and attention to details with ability to excel in diverse technical fields and adaptability to dynamic and fast-paced environments. Experience Engineering TD Manager Intel Corporation, Portland Technology Development June 2012  – Present (3 years 3 months) Portland, Oregon Area Worked until July 2014 as the defect reduction group leader for 10nm CMOS process BEOL interconnect process technology development and leaded a team of 13 Ph.D defect reduction engineers and managed the resources to drive the process improvement, defect reduction and yield improvement. Since August 2014, I have been managing the burn-In reliability stress module group to provide high quality burn-in stress data for 14nm process and develop cutting-edge burn-In test capabilities for 10nm process reliability test. Also, I am managing the team of e-test module and PE engineers to develop the DC and high freq. RF parametric e-test systems for a new novel memory test chip development.  Senior Process Engineer/Staff Engineer Intel Corporation August 2005  –  June 2012  (6 years 11 months) Portland, Oregon Area As a defect reduction engineer, I worked on numerous defect reduction and yield improvement projects for the development of 45nm and 22nm CMOS process technologies from the beginning to the HVM process technology transfer to the manufacturing factories located in the USA and abroad. \n-\t45nm node Front-End CMOS process technology development (industry-1st HiK/Metal gate transistor) focusing on the metal-gate and contact process  \n-\t22nm node Front-End CMOS process technology development (industry-1st use of Tri-gate 3-D transistor) focusing on the FIN patterning through Poly gate formation process Consultant and Technical Assistant Macalester College, Physics Department January 2004  –  May 2005  (1 year 5 months) Greater Minneapolis-St. Paul Area Processing modulation-doped InGaAlAs parabolic quantum well samples for the project called “Ultrafast Terahertz Spectroscopy of Carrier Dynamics in Semiconductors” including fabrication and optimization of ohmic and transparent ITO (Indium Tin Oxide) gate contacts, depth-controlled wet-chemical etching, and other general semiconductor processing. Graduate Research Assistant University of Minnesota, Physics Department July 2001  –  May 2005  (3 years 11 months) Greater Minneapolis-St. Paul Area Thesis research using the time- and space-resolved magneto-optic Kerr effect to investigate spin dynamics in micron and nanometer size patterned ferromagnetic thin films and exchange-bias samples (in collaboration with Prof. Christopher Leighton in the department of Chemical Engineering and Materials Science at the University of Minnesota) with picosecond time resolution and few hundreds of nanometer spatial resolution. Graduate Research Assistant University of Buffalo, Institute for Lasers, Photonics, and Biophotonics June 2000  –  May 2001  (1 year) buffalo/niagara, new york area Graduate Teaching Assistant University of Buffalo, Physics Department January 2000  –  July 2000  (7 months) buffalo/niagara, new york area Engineering TD Manager Intel Corporation, Portland Technology Development June 2012  – Present (3 years 3 months) Portland, Oregon Area Worked until July 2014 as the defect reduction group leader for 10nm CMOS process BEOL interconnect process technology development and leaded a team of 13 Ph.D defect reduction engineers and managed the resources to drive the process improvement, defect reduction and yield improvement. Since August 2014, I have been managing the burn-In reliability stress module group to provide high quality burn-in stress data for 14nm process and develop cutting-edge burn-In test capabilities for 10nm process reliability test. Also, I am managing the team of e-test module and PE engineers to develop the DC and high freq. RF parametric e-test systems for a new novel memory test chip development.  Engineering TD Manager Intel Corporation, Portland Technology Development June 2012  – Present (3 years 3 months) Portland, Oregon Area Worked until July 2014 as the defect reduction group leader for 10nm CMOS process BEOL interconnect process technology development and leaded a team of 13 Ph.D defect reduction engineers and managed the resources to drive the process improvement, defect reduction and yield improvement. Since August 2014, I have been managing the burn-In reliability stress module group to provide high quality burn-in stress data for 14nm process and develop cutting-edge burn-In test capabilities for 10nm process reliability test. Also, I am managing the team of e-test module and PE engineers to develop the DC and high freq. RF parametric e-test systems for a new novel memory test chip development.  Senior Process Engineer/Staff Engineer Intel Corporation August 2005  –  June 2012  (6 years 11 months) Portland, Oregon Area As a defect reduction engineer, I worked on numerous defect reduction and yield improvement projects for the development of 45nm and 22nm CMOS process technologies from the beginning to the HVM process technology transfer to the manufacturing factories located in the USA and abroad. \n-\t45nm node Front-End CMOS process technology development (industry-1st HiK/Metal gate transistor) focusing on the metal-gate and contact process  \n-\t22nm node Front-End CMOS process technology development (industry-1st use of Tri-gate 3-D transistor) focusing on the FIN patterning through Poly gate formation process Senior Process Engineer/Staff Engineer Intel Corporation August 2005  –  June 2012  (6 years 11 months) Portland, Oregon Area As a defect reduction engineer, I worked on numerous defect reduction and yield improvement projects for the development of 45nm and 22nm CMOS process technologies from the beginning to the HVM process technology transfer to the manufacturing factories located in the USA and abroad. \n-\t45nm node Front-End CMOS process technology development (industry-1st HiK/Metal gate transistor) focusing on the metal-gate and contact process  \n-\t22nm node Front-End CMOS process technology development (industry-1st use of Tri-gate 3-D transistor) focusing on the FIN patterning through Poly gate formation process Consultant and Technical Assistant Macalester College, Physics Department January 2004  –  May 2005  (1 year 5 months) Greater Minneapolis-St. Paul Area Processing modulation-doped InGaAlAs parabolic quantum well samples for the project called “Ultrafast Terahertz Spectroscopy of Carrier Dynamics in Semiconductors” including fabrication and optimization of ohmic and transparent ITO (Indium Tin Oxide) gate contacts, depth-controlled wet-chemical etching, and other general semiconductor processing. Consultant and Technical Assistant Macalester College, Physics Department January 2004  –  May 2005  (1 year 5 months) Greater Minneapolis-St. Paul Area Processing modulation-doped InGaAlAs parabolic quantum well samples for the project called “Ultrafast Terahertz Spectroscopy of Carrier Dynamics in Semiconductors” including fabrication and optimization of ohmic and transparent ITO (Indium Tin Oxide) gate contacts, depth-controlled wet-chemical etching, and other general semiconductor processing. Graduate Research Assistant University of Minnesota, Physics Department July 2001  –  May 2005  (3 years 11 months) Greater Minneapolis-St. Paul Area Thesis research using the time- and space-resolved magneto-optic Kerr effect to investigate spin dynamics in micron and nanometer size patterned ferromagnetic thin films and exchange-bias samples (in collaboration with Prof. Christopher Leighton in the department of Chemical Engineering and Materials Science at the University of Minnesota) with picosecond time resolution and few hundreds of nanometer spatial resolution. Graduate Research Assistant University of Minnesota, Physics Department July 2001  –  May 2005  (3 years 11 months) Greater Minneapolis-St. Paul Area Thesis research using the time- and space-resolved magneto-optic Kerr effect to investigate spin dynamics in micron and nanometer size patterned ferromagnetic thin films and exchange-bias samples (in collaboration with Prof. Christopher Leighton in the department of Chemical Engineering and Materials Science at the University of Minnesota) with picosecond time resolution and few hundreds of nanometer spatial resolution. Graduate Research Assistant University of Buffalo, Institute for Lasers, Photonics, and Biophotonics June 2000  –  May 2001  (1 year) buffalo/niagara, new york area Graduate Research Assistant University of Buffalo, Institute for Lasers, Photonics, and Biophotonics June 2000  –  May 2001  (1 year) buffalo/niagara, new york area Graduate Teaching Assistant University of Buffalo, Physics Department January 2000  –  July 2000  (7 months) buffalo/niagara, new york area Graduate Teaching Assistant University of Buffalo, Physics Department January 2000  –  July 2000  (7 months) buffalo/niagara, new york area Languages English Full professional proficiency Korean Native or bilingual proficiency English Full professional proficiency Korean Native or bilingual proficiency English Full professional proficiency Korean Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Semiconductors Design of Experiments Six Sigma Engineering Management Technology Transfer Defect Metrology Defect Reduction Yield Manufacturing Team Building and... Creative and... Project Management Process Integration CMP Patterning Thin Films JMP Data Analysis Statistical Data... Programming Optics Laser Physics Spin Dynamics Low Temp Cryogenic... Analysis Tools... Microwave Systems Magnetics Complexity Reduction C Cross-functional Team... Electronics Engineering Image Processing Management Matlab Research See 21+     See less Skills  Semiconductors Design of Experiments Six Sigma Engineering Management Technology Transfer Defect Metrology Defect Reduction Yield Manufacturing Team Building and... Creative and... Project Management Process Integration CMP Patterning Thin Films JMP Data Analysis Statistical Data... Programming Optics Laser Physics Spin Dynamics Low Temp Cryogenic... Analysis Tools... Microwave Systems Magnetics Complexity Reduction C Cross-functional Team... Electronics Engineering Image Processing Management Matlab Research See 21+     See less Semiconductors Design of Experiments Six Sigma Engineering Management Technology Transfer Defect Metrology Defect Reduction Yield Manufacturing Team Building and... Creative and... Project Management Process Integration CMP Patterning Thin Films JMP Data Analysis Statistical Data... Programming Optics Laser Physics Spin Dynamics Low Temp Cryogenic... Analysis Tools... Microwave Systems Magnetics Complexity Reduction C Cross-functional Team... Electronics Engineering Image Processing Management Matlab Research See 21+     See less Semiconductors Design of Experiments Six Sigma Engineering Management Technology Transfer Defect Metrology Defect Reduction Yield Manufacturing Team Building and... Creative and... Project Management Process Integration CMP Patterning Thin Films JMP Data Analysis Statistical Data... Programming Optics Laser Physics Spin Dynamics Low Temp Cryogenic... Analysis Tools... Microwave Systems Magnetics Complexity Reduction C Cross-functional Team... Electronics Engineering Image Processing Management Matlab Research See 21+     See less Education University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Condensed Matter and Materials Physics , GPA 4.00/4.00 2001  – 2005 Thesis research using the time- and space-resolved magneto-optic Kerr effect to investigate spin dynamics in micron and nanometer size patterned ferromagnetic thin films and exchange-bias samples with picosecond time resolution and few hundreds of nanometer spatial resolution. Activities and Societies:  •\tMentor Connection Academic Program for Senior High School Students\n(Intermediate District 287 ,  MN ,  August 2003 – May 2004)\n•\tMentoring Program for New Physics Graduate Students (University of Minnesota ,  June 2003 – May 2004): Organized this program with four other mentors to provide a resource and information for the first years and to strengthen the community of the department State University of New York at Buffalo Master's degree,  Condensed Matter and Materials Physics , GPA 3.80/4.00 1999  – 2001 My research was focused on making a novel class of inorganic nanocrystal:polymer composites and characterizing physical properties such as photorefractivity, photoconductivity, and mobility of carriers. Chung-Ang University, Seoul Korea Bachelor of Science (B.S.),  Physics 1988  – 1998 summa cum laude University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Condensed Matter and Materials Physics , GPA 4.00/4.00 2001  – 2005 Thesis research using the time- and space-resolved magneto-optic Kerr effect to investigate spin dynamics in micron and nanometer size patterned ferromagnetic thin films and exchange-bias samples with picosecond time resolution and few hundreds of nanometer spatial resolution. Activities and Societies:  •\tMentor Connection Academic Program for Senior High School Students\n(Intermediate District 287 ,  MN ,  August 2003 – May 2004)\n•\tMentoring Program for New Physics Graduate Students (University of Minnesota ,  June 2003 – May 2004): Organized this program with four other mentors to provide a resource and information for the first years and to strengthen the community of the department University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Condensed Matter and Materials Physics , GPA 4.00/4.00 2001  – 2005 Thesis research using the time- and space-resolved magneto-optic Kerr effect to investigate spin dynamics in micron and nanometer size patterned ferromagnetic thin films and exchange-bias samples with picosecond time resolution and few hundreds of nanometer spatial resolution. Activities and Societies:  •\tMentor Connection Academic Program for Senior High School Students\n(Intermediate District 287 ,  MN ,  August 2003 – May 2004)\n•\tMentoring Program for New Physics Graduate Students (University of Minnesota ,  June 2003 – May 2004): Organized this program with four other mentors to provide a resource and information for the first years and to strengthen the community of the department University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Condensed Matter and Materials Physics , GPA 4.00/4.00 2001  – 2005 Thesis research using the time- and space-resolved magneto-optic Kerr effect to investigate spin dynamics in micron and nanometer size patterned ferromagnetic thin films and exchange-bias samples with picosecond time resolution and few hundreds of nanometer spatial resolution. Activities and Societies:  •\tMentor Connection Academic Program for Senior High School Students\n(Intermediate District 287 ,  MN ,  August 2003 – May 2004)\n•\tMentoring Program for New Physics Graduate Students (University of Minnesota ,  June 2003 – May 2004): Organized this program with four other mentors to provide a resource and information for the first years and to strengthen the community of the department State University of New York at Buffalo Master's degree,  Condensed Matter and Materials Physics , GPA 3.80/4.00 1999  – 2001 My research was focused on making a novel class of inorganic nanocrystal:polymer composites and characterizing physical properties such as photorefractivity, photoconductivity, and mobility of carriers. State University of New York at Buffalo Master's degree,  Condensed Matter and Materials Physics , GPA 3.80/4.00 1999  – 2001 My research was focused on making a novel class of inorganic nanocrystal:polymer composites and characterizing physical properties such as photorefractivity, photoconductivity, and mobility of carriers. State University of New York at Buffalo Master's degree,  Condensed Matter and Materials Physics , GPA 3.80/4.00 1999  – 2001 My research was focused on making a novel class of inorganic nanocrystal:polymer composites and characterizing physical properties such as photorefractivity, photoconductivity, and mobility of carriers. Chung-Ang University, Seoul Korea Bachelor of Science (B.S.),  Physics 1988  – 1998 summa cum laude Chung-Ang University, Seoul Korea Bachelor of Science (B.S.),  Physics 1988  – 1998 summa cum laude Chung-Ang University, Seoul Korea Bachelor of Science (B.S.),  Physics 1988  – 1998 summa cum laude ", "Summary Engineering solutions by exhibiting robust decision-making based on known information and justifiable judgement. Summary Engineering solutions by exhibiting robust decision-making based on known information and justifiable judgement. Engineering solutions by exhibiting robust decision-making based on known information and justifiable judgement. Engineering solutions by exhibiting robust decision-making based on known information and justifiable judgement. Experience Engineering - TD Manager Intel Corporation July 2013  – Present (2 years 2 months) Staff Process Engineer - EUV systems Intel Corporation August 2011  –  June 2013  (1 year 11 months) Staff Process Engineer Intel Corporation April 2010  –  August 2011  (1 year 5 months) Senior Process Engineer Intel Corporation January 2006  –  April 2010  (4 years 4 months) Engineering - TD Manager Intel Corporation July 2013  – Present (2 years 2 months) Engineering - TD Manager Intel Corporation July 2013  – Present (2 years 2 months) Staff Process Engineer - EUV systems Intel Corporation August 2011  –  June 2013  (1 year 11 months) Staff Process Engineer - EUV systems Intel Corporation August 2011  –  June 2013  (1 year 11 months) Staff Process Engineer Intel Corporation April 2010  –  August 2011  (1 year 5 months) Staff Process Engineer Intel Corporation April 2010  –  August 2011  (1 year 5 months) Senior Process Engineer Intel Corporation January 2006  –  April 2010  (4 years 4 months) Senior Process Engineer Intel Corporation January 2006  –  April 2010  (4 years 4 months) Skills Semiconductors Chemical Engineering Engineering Lithography Design of Experiments JMP Thin Films Process Simulation Simulations Characterization Materials Science SPC Skills  Semiconductors Chemical Engineering Engineering Lithography Design of Experiments JMP Thin Films Process Simulation Simulations Characterization Materials Science SPC Semiconductors Chemical Engineering Engineering Lithography Design of Experiments JMP Thin Films Process Simulation Simulations Characterization Materials Science SPC Semiconductors Chemical Engineering Engineering Lithography Design of Experiments JMP Thin Films Process Simulation Simulations Characterization Materials Science SPC Education University of Colorado Boulder PhD,  Chemical Engineering 2001  – 2005 University of Colorado Boulder MS,  Chemical Engineering 2001  – 2003 University of Mumbai BChem Eng - UDCT (now UICT),  Chemical Engineering 1997  – 2001 University of Colorado Boulder PhD,  Chemical Engineering 2001  – 2005 University of Colorado Boulder PhD,  Chemical Engineering 2001  – 2005 University of Colorado Boulder PhD,  Chemical Engineering 2001  – 2005 University of Colorado Boulder MS,  Chemical Engineering 2001  – 2003 University of Colorado Boulder MS,  Chemical Engineering 2001  – 2003 University of Colorado Boulder MS,  Chemical Engineering 2001  – 2003 University of Mumbai BChem Eng - UDCT (now UICT),  Chemical Engineering 1997  – 2001 University of Mumbai BChem Eng - UDCT (now UICT),  Chemical Engineering 1997  – 2001 University of Mumbai BChem Eng - UDCT (now UICT),  Chemical Engineering 1997  – 2001 ", "Experience Engineering TD Manager Intel Corporation October 2011  – Present (3 years 11 months) InfoTech Manager Intel Corporation August 2007  –  September 2011  (4 years 2 months) Engineering TD Manager Intel Corporation October 2011  – Present (3 years 11 months) Engineering TD Manager Intel Corporation October 2011  – Present (3 years 11 months) InfoTech Manager Intel Corporation August 2007  –  September 2011  (4 years 2 months) InfoTech Manager Intel Corporation August 2007  –  September 2011  (4 years 2 months) Skills Management Skills  Management Management Management ", "Experience Engineering TD manager Intel Corporation January 2006  – Present (9 years 8 months) Process development Fairchild Semiconductor September 2000  –  January 2006  (5 years 5 months) Development engineer Honeywell February 1998  –  September 2001  (3 years 8 months) Engineering TD manager Intel Corporation January 2006  – Present (9 years 8 months) Engineering TD manager Intel Corporation January 2006  – Present (9 years 8 months) Process development Fairchild Semiconductor September 2000  –  January 2006  (5 years 5 months) Process development Fairchild Semiconductor September 2000  –  January 2006  (5 years 5 months) Development engineer Honeywell February 1998  –  September 2001  (3 years 8 months) Development engineer Honeywell February 1998  –  September 2001  (3 years 8 months) Education University of Idaho University of Idaho University of Idaho University of Idaho ", "Experience Engineering TD Manager Intel Corporation September 2012  – Present (3 years) Process TD Engineer Intel Corporation February 2006  –  September 2012  (6 years 8 months) Engineering TD Manager Intel Corporation September 2012  – Present (3 years) Engineering TD Manager Intel Corporation September 2012  – Present (3 years) Process TD Engineer Intel Corporation February 2006  –  September 2012  (6 years 8 months) Process TD Engineer Intel Corporation February 2006  –  September 2012  (6 years 8 months) Education University of Florida Master of Science (MS),  Materials Science 2000  – 2005 University of Florida Master of Science (MS),  Materials Science 2000  – 2005 University of Florida Master of Science (MS),  Materials Science 2000  – 2005 University of Florida Master of Science (MS),  Materials Science 2000  – 2005 ", "Experience Reliability Engineer Intel Corporation Reliability Engineer Intel Corporation Reliability Engineer Intel Corporation Skills Failure Analysis Semiconductor Industry Semiconductors CMOS IC Silicon SoC Reliability Engineering JMP Design of Experiments Simulations VLSI Skills  Failure Analysis Semiconductor Industry Semiconductors CMOS IC Silicon SoC Reliability Engineering JMP Design of Experiments Simulations VLSI Failure Analysis Semiconductor Industry Semiconductors CMOS IC Silicon SoC Reliability Engineering JMP Design of Experiments Simulations VLSI Failure Analysis Semiconductor Industry Semiconductors CMOS IC Silicon SoC Reliability Engineering JMP Design of Experiments Simulations VLSI Education Duke University MS,PhD,  Electrical Engineering 1998  – 2004 University of Southern California BS,  Biomedical and Electrical Engineering 1994  – 1998 Duke University MS,PhD,  Electrical Engineering 1998  – 2004 Duke University MS,PhD,  Electrical Engineering 1998  – 2004 Duke University MS,PhD,  Electrical Engineering 1998  – 2004 University of Southern California BS,  Biomedical and Electrical Engineering 1994  – 1998 University of Southern California BS,  Biomedical and Electrical Engineering 1994  – 1998 University of Southern California BS,  Biomedical and Electrical Engineering 1994  – 1998 ", "Summary - Failure analysis, failure isolation, and simulation on Intel 45nm, 32nm, 22nm, and 14nm devices to improve yield and reliability  \n- Competitive analysis on Intel 90nm, 65nm, 45nm, 22nm, 14nm devices, TSMC 55nm, 40nm, 28nm devices, Samsumg 45nm, 32nm devices and AMD 65nm,45nm, 32nm devices to bench-mark device performance on CPU/GPU and SOC chips from different companies  \n- Technique development for failure analysis and nano-probing on Intel latest process generation \n- Functional debug and scan chain analysis/debug for defect localization \n- SOC process and device debug for yield improvement  \n \nSpecialties: Device physics and manufacture process, Device electrical characterization, Device failure modeling, Nano-probing, Scan chain testing and debug, CPU functional test, IREM (infrared emission microscope), LADA (laser assisted device alteration), and LTM (laser timing module) analysis, Circuit analysis for debug Summary - Failure analysis, failure isolation, and simulation on Intel 45nm, 32nm, 22nm, and 14nm devices to improve yield and reliability  \n- Competitive analysis on Intel 90nm, 65nm, 45nm, 22nm, 14nm devices, TSMC 55nm, 40nm, 28nm devices, Samsumg 45nm, 32nm devices and AMD 65nm,45nm, 32nm devices to bench-mark device performance on CPU/GPU and SOC chips from different companies  \n- Technique development for failure analysis and nano-probing on Intel latest process generation \n- Functional debug and scan chain analysis/debug for defect localization \n- SOC process and device debug for yield improvement  \n \nSpecialties: Device physics and manufacture process, Device electrical characterization, Device failure modeling, Nano-probing, Scan chain testing and debug, CPU functional test, IREM (infrared emission microscope), LADA (laser assisted device alteration), and LTM (laser timing module) analysis, Circuit analysis for debug - Failure analysis, failure isolation, and simulation on Intel 45nm, 32nm, 22nm, and 14nm devices to improve yield and reliability  \n- Competitive analysis on Intel 90nm, 65nm, 45nm, 22nm, 14nm devices, TSMC 55nm, 40nm, 28nm devices, Samsumg 45nm, 32nm devices and AMD 65nm,45nm, 32nm devices to bench-mark device performance on CPU/GPU and SOC chips from different companies  \n- Technique development for failure analysis and nano-probing on Intel latest process generation \n- Functional debug and scan chain analysis/debug for defect localization \n- SOC process and device debug for yield improvement  \n \nSpecialties: Device physics and manufacture process, Device electrical characterization, Device failure modeling, Nano-probing, Scan chain testing and debug, CPU functional test, IREM (infrared emission microscope), LADA (laser assisted device alteration), and LTM (laser timing module) analysis, Circuit analysis for debug - Failure analysis, failure isolation, and simulation on Intel 45nm, 32nm, 22nm, and 14nm devices to improve yield and reliability  \n- Competitive analysis on Intel 90nm, 65nm, 45nm, 22nm, 14nm devices, TSMC 55nm, 40nm, 28nm devices, Samsumg 45nm, 32nm devices and AMD 65nm,45nm, 32nm devices to bench-mark device performance on CPU/GPU and SOC chips from different companies  \n- Technique development for failure analysis and nano-probing on Intel latest process generation \n- Functional debug and scan chain analysis/debug for defect localization \n- SOC process and device debug for yield improvement  \n \nSpecialties: Device physics and manufacture process, Device electrical characterization, Device failure modeling, Nano-probing, Scan chain testing and debug, CPU functional test, IREM (infrared emission microscope), LADA (laser assisted device alteration), and LTM (laser timing module) analysis, Circuit analysis for debug Experience Failure Isolation/Analysis Technology Development Engineer Intel Corporation June 2005  – Present (10 years 3 months) To support Intel latest process development by performing failure isolation/analysis to understand failure mechanisms Failure Isolation/Analysis Technology Development Engineer Intel Corporation June 2005  – Present (10 years 3 months) To support Intel latest process development by performing failure isolation/analysis to understand failure mechanisms Failure Isolation/Analysis Technology Development Engineer Intel Corporation June 2005  – Present (10 years 3 months) To support Intel latest process development by performing failure isolation/analysis to understand failure mechanisms Skills Failure Analysis Device Physics Characterization Testing Simulation MEMS Reliability Semiconductor... Semiconductors AFM CMOS Technology Development Simulations Skills  Failure Analysis Device Physics Characterization Testing Simulation MEMS Reliability Semiconductor... Semiconductors AFM CMOS Technology Development Simulations Failure Analysis Device Physics Characterization Testing Simulation MEMS Reliability Semiconductor... Semiconductors AFM CMOS Technology Development Simulations Failure Analysis Device Physics Characterization Testing Simulation MEMS Reliability Semiconductor... Semiconductors AFM CMOS Technology Development Simulations Education University of Maryland College Park Doctor of Philosophy,  Electrical Engineering 2001  – 2005 Advisor: Professor Reza Ghodssi \nMajor area: Microelectronics and MEMS \nMinor Area: Electrophysics Activities and Societies:  During his Ph.D. study ,  Wen-Hien has been involved in a research project collaborating with NASA Goddard Space Flight Center (GSFC) to develop the first MEMS (micro-electro-mechanical system) device that will be used in the James Webb Space Telescope in outer space.He is the first person trying to understand electrical/mechanical/reliability properties of micro-/nano-scale thin film materials at cryogenic temperatures. National Cheng Kung University, Taiwan M.S.,  Electrical Engineering 1994  – 1998 University of Maryland - A. James Clark School of Engineering University of Maryland College Park Doctor of Philosophy,  Electrical Engineering 2001  – 2005 Advisor: Professor Reza Ghodssi \nMajor area: Microelectronics and MEMS \nMinor Area: Electrophysics Activities and Societies:  During his Ph.D. study ,  Wen-Hien has been involved in a research project collaborating with NASA Goddard Space Flight Center (GSFC) to develop the first MEMS (micro-electro-mechanical system) device that will be used in the James Webb Space Telescope in outer space.He is the first person trying to understand electrical/mechanical/reliability properties of micro-/nano-scale thin film materials at cryogenic temperatures. University of Maryland College Park Doctor of Philosophy,  Electrical Engineering 2001  – 2005 Advisor: Professor Reza Ghodssi \nMajor area: Microelectronics and MEMS \nMinor Area: Electrophysics Activities and Societies:  During his Ph.D. study ,  Wen-Hien has been involved in a research project collaborating with NASA Goddard Space Flight Center (GSFC) to develop the first MEMS (micro-electro-mechanical system) device that will be used in the James Webb Space Telescope in outer space.He is the first person trying to understand electrical/mechanical/reliability properties of micro-/nano-scale thin film materials at cryogenic temperatures. University of Maryland College Park Doctor of Philosophy,  Electrical Engineering 2001  – 2005 Advisor: Professor Reza Ghodssi \nMajor area: Microelectronics and MEMS \nMinor Area: Electrophysics Activities and Societies:  During his Ph.D. study ,  Wen-Hien has been involved in a research project collaborating with NASA Goddard Space Flight Center (GSFC) to develop the first MEMS (micro-electro-mechanical system) device that will be used in the James Webb Space Telescope in outer space.He is the first person trying to understand electrical/mechanical/reliability properties of micro-/nano-scale thin film materials at cryogenic temperatures. National Cheng Kung University, Taiwan M.S.,  Electrical Engineering 1994  – 1998 National Cheng Kung University, Taiwan M.S.,  Electrical Engineering 1994  – 1998 National Cheng Kung University, Taiwan M.S.,  Electrical Engineering 1994  – 1998 University of Maryland - A. James Clark School of Engineering University of Maryland - A. James Clark School of Engineering University of Maryland - A. James Clark School of Engineering ", "Experience Engineering TD Manager Intel Corporation July 2008  – Present (7 years 2 months) Process Development Engineer Novellus Systems acquired by Lam Research Corporation March 2008  –  July 2008  (5 months) san jose,california Process Development Engineer (Intern) Micron Technology May 2006  –  August 2006  (4 months) Boise, Idaho Area Assistant Manager BPL June 2002  –  July 2003  (1 year 2 months) Bangalore, India Engineering TD Manager Intel Corporation July 2008  – Present (7 years 2 months) Engineering TD Manager Intel Corporation July 2008  – Present (7 years 2 months) Process Development Engineer Novellus Systems acquired by Lam Research Corporation March 2008  –  July 2008  (5 months) san jose,california Process Development Engineer Novellus Systems acquired by Lam Research Corporation March 2008  –  July 2008  (5 months) san jose,california Process Development Engineer (Intern) Micron Technology May 2006  –  August 2006  (4 months) Boise, Idaho Area Process Development Engineer (Intern) Micron Technology May 2006  –  August 2006  (4 months) Boise, Idaho Area Assistant Manager BPL June 2002  –  July 2003  (1 year 2 months) Bangalore, India Assistant Manager BPL June 2002  –  July 2003  (1 year 2 months) Bangalore, India Skills Leadership Program Management Cross-functional Team... Manufacturing Product Development Product Management Testing Microsoft Office Characterization Materials Science Engineering Design of Experiments Nanotechnology Semiconductors Semiconductor Industry Skills  Leadership Program Management Cross-functional Team... Manufacturing Product Development Product Management Testing Microsoft Office Characterization Materials Science Engineering Design of Experiments Nanotechnology Semiconductors Semiconductor Industry Leadership Program Management Cross-functional Team... Manufacturing Product Development Product Management Testing Microsoft Office Characterization Materials Science Engineering Design of Experiments Nanotechnology Semiconductors Semiconductor Industry Leadership Program Management Cross-functional Team... Manufacturing Product Development Product Management Testing Microsoft Office Characterization Materials Science Engineering Design of Experiments Nanotechnology Semiconductors Semiconductor Industry Education University of Arizona Ph.D,  Materials science and engineering 2003  – 2008 CECRI Bachelor of Technology (B.Tech.),  Chemical and electrochemical engineering 1998  – 2002 University of Arizona Ph.D,  Materials science and engineering 2003  – 2008 University of Arizona Ph.D,  Materials science and engineering 2003  – 2008 University of Arizona Ph.D,  Materials science and engineering 2003  – 2008 CECRI Bachelor of Technology (B.Tech.),  Chemical and electrochemical engineering 1998  – 2002 CECRI Bachelor of Technology (B.Tech.),  Chemical and electrochemical engineering 1998  – 2002 CECRI Bachelor of Technology (B.Tech.),  Chemical and electrochemical engineering 1998  – 2002 ", "Summary Highly motivated and results-oriented Engineering Manager with technical ability to solve problems quickly, communicate effectively and lead cross-functional teams. Demonstrated expertise in project management, system development and process optimization Summary Highly motivated and results-oriented Engineering Manager with technical ability to solve problems quickly, communicate effectively and lead cross-functional teams. Demonstrated expertise in project management, system development and process optimization Highly motivated and results-oriented Engineering Manager with technical ability to solve problems quickly, communicate effectively and lead cross-functional teams. Demonstrated expertise in project management, system development and process optimization Highly motivated and results-oriented Engineering Manager with technical ability to solve problems quickly, communicate effectively and lead cross-functional teams. Demonstrated expertise in project management, system development and process optimization Experience Engineering TD Manager Intel Corporation January 2014  – Present (1 year 8 months) Portland, Oregon Area Sr. Process Engineer Intel Corporation August 2004  –  December 2013  (9 years 5 months) Santa Clara, CA Internship Procter & Gamble May 2003  –  August 2003  (4 months) Cincinnati Area Low voltage microanalysis for elemental characterization of deposits, thin films and nano-particles on P&G relevant samples using Hitachi S-5200 scanning electron microscope Production Engineer Tata Motors August 1997  –  June 2000  (2 years 11 months) Jamshedpur Area, India Shift engineer responsible for delivering production goals with highest quality and ensuring the production line runs efficiently by solving problems on a timely manner Engineering TD Manager Intel Corporation January 2014  – Present (1 year 8 months) Portland, Oregon Area Engineering TD Manager Intel Corporation January 2014  – Present (1 year 8 months) Portland, Oregon Area Sr. Process Engineer Intel Corporation August 2004  –  December 2013  (9 years 5 months) Santa Clara, CA Sr. Process Engineer Intel Corporation August 2004  –  December 2013  (9 years 5 months) Santa Clara, CA Internship Procter & Gamble May 2003  –  August 2003  (4 months) Cincinnati Area Low voltage microanalysis for elemental characterization of deposits, thin films and nano-particles on P&G relevant samples using Hitachi S-5200 scanning electron microscope Internship Procter & Gamble May 2003  –  August 2003  (4 months) Cincinnati Area Low voltage microanalysis for elemental characterization of deposits, thin films and nano-particles on P&G relevant samples using Hitachi S-5200 scanning electron microscope Production Engineer Tata Motors August 1997  –  June 2000  (2 years 11 months) Jamshedpur Area, India Shift engineer responsible for delivering production goals with highest quality and ensuring the production line runs efficiently by solving problems on a timely manner Production Engineer Tata Motors August 1997  –  June 2000  (2 years 11 months) Jamshedpur Area, India Shift engineer responsible for delivering production goals with highest quality and ensuring the production line runs efficiently by solving problems on a timely manner Skills Process Engineering Data Analysis Characterization SPC Vendor Relationships Project Management E3 Metrology Design of Experiments Manufacturing Skills  Process Engineering Data Analysis Characterization SPC Vendor Relationships Project Management E3 Metrology Design of Experiments Manufacturing Process Engineering Data Analysis Characterization SPC Vendor Relationships Project Management E3 Metrology Design of Experiments Manufacturing Process Engineering Data Analysis Characterization SPC Vendor Relationships Project Management E3 Metrology Design of Experiments Manufacturing Education University of Tennessee-Knoxville PhD,  Materials Science 2000  – 2004 University of Tennessee-Knoxville PhD,  Materials Science 2000  – 2004 University of Tennessee-Knoxville PhD,  Materials Science 2000  – 2004 University of Tennessee-Knoxville PhD,  Materials Science 2000  – 2004 Honors & Awards Experimental Design Excellence Award Technology Development Division September 2010 Divisional Recognition Award Technology Development Division July 2008 Distinguished Scholar Award Microbeam Analysis Society (MAS) August 2002 Experimental Design Excellence Award Technology Development Division September 2010 Experimental Design Excellence Award Technology Development Division September 2010 Experimental Design Excellence Award Technology Development Division September 2010 Divisional Recognition Award Technology Development Division July 2008 Divisional Recognition Award Technology Development Division July 2008 Divisional Recognition Award Technology Development Division July 2008 Distinguished Scholar Award Microbeam Analysis Society (MAS) August 2002 Distinguished Scholar Award Microbeam Analysis Society (MAS) August 2002 Distinguished Scholar Award Microbeam Analysis Society (MAS) August 2002 "]}