{"position": "Engineering Technician - Contractor", "company": "Intel Corporation", "profiles": ["Summary With over 15 years of experience in the photonics industry with extensive experience building, aligning, testing and troubleshooting prototype components such as opto-mechanical, laser based test and measurement equipment, fiber optics and MEMS Based switches. \nI'm Self-motivated team player that thrives in both R&D and manufacturing environments. Summary With over 15 years of experience in the photonics industry with extensive experience building, aligning, testing and troubleshooting prototype components such as opto-mechanical, laser based test and measurement equipment, fiber optics and MEMS Based switches. \nI'm Self-motivated team player that thrives in both R&D and manufacturing environments. With over 15 years of experience in the photonics industry with extensive experience building, aligning, testing and troubleshooting prototype components such as opto-mechanical, laser based test and measurement equipment, fiber optics and MEMS Based switches. \nI'm Self-motivated team player that thrives in both R&D and manufacturing environments. With over 15 years of experience in the photonics industry with extensive experience building, aligning, testing and troubleshooting prototype components such as opto-mechanical, laser based test and measurement equipment, fiber optics and MEMS Based switches. \nI'm Self-motivated team player that thrives in both R&D and manufacturing environments. Experience Sr. Laboratory Technician InvenSense, Inc. September 2013  –  April 2014  (8 months) San Jose Ca Conduct failure analysis testing on MEMS based semiconductor motion devices \nResponsible for FA testing and reporting results to the engineering Associate Manufacturing Engineer Prysm May 2012  –  February 2013  (10 months) San Jose CA Responsible for pilot line production of LPD (laser phosphate display) video display panels \n• Subassembly, assembly and system level building, integration, alignment and testing of laser light engine modules \n• Contribute to the development of tooling, fixtures and process for assembly and testing \n• Developed, wrote, preformed and documented assembly and testing procedures \n• Inspected optical parts to mechanical and optical specifications Sr. Engineering Technician Capella Photonics 2005  –  2012  (7 years) San Jose Ca Assisted in the development of 3rd generation Wavelength Selective Switches (WSS) ROADM, to manage traffic through the next-generation optical networks. A MEMS based system. \n•\tCompletely setup and ran a full pilot production line to qualify the manufacturability of the WSS optical switch product. \n•\tSuccessfully transfer products and manufacturing lines to the contract manufacturer in Thailand and Japan. \n•\tResponsible for qualifying next generation product design, test and measure prototype modules including MEMS based switch components.  \n•\tAssist with training manufacturing groups and support troubleshooting of technical issues with optical switch and process flow. \n•\tConduct a Failure analyses on RMA’s (Return Material Authorization) units from the field. \n•\tWorked with part vendors to insure product meet company specifications and process flow Optics Specialist Contractor Rockwell Collins 2004  –  2005  (1 year) San Jose Ca Manufacturing support on visual displays instrument panels for military use.  \nResponsible for all Quarter wave plate assemblies as well process improvement. Engineering Technician Contractor Intel Corporation 2003  –  2004  (1 year) Fremont Ca Successfully completed an R&D project that developed Electrical Transceivers for 10 Gigabit Ethernet switches and routers for optical and copper base networks  \n•\tResponsible for all prototypes builds and test processes of the CX4 XENPAK modules. \n•\tTest and compile all characterization data to be reported to the project engineers. \n•\tImproved process and reduce product cost for product introduction. \n•\tLiaison between R&D, manufacturing and technical support for manufacturing. R&D Technician Gigabit Optics 2001  –  2002  (1 year) Sunnyvale Ca Worked on optical components to create sub-assemblies for use in optical networks for a variety of WDM applications including multi-port transmitters, receivers, and transceivers.  \n•\tResponsible for assembly and optical alignment of prototype Micro-MUX/DeMUX,  \n•\tDocumenting test processes and engineering changes. \n•\tSetup assembly station for Pilot production runs. Sr. Optoelectronics Technician New Focus 1997  –  2001  (4 years) San Jose Ca Collaborated on a research project to develop a tunable laser module for the optical network industry. Responsible for the integration and installation of prototype laser cavity into final package. Constructed and managed development labs and test stations. Evaluated all prototype modules at final test station. Complied final test data to be presented to develop engineering. Laser Technician Liconix inc 1996  –  1997  (1 year) Santa Clara Ca Responsible for troubleshooting and repairing all small and mid-size (Helium-Cadmium) lasers. Sr. Laboratory Technician InvenSense, Inc. September 2013  –  April 2014  (8 months) San Jose Ca Conduct failure analysis testing on MEMS based semiconductor motion devices \nResponsible for FA testing and reporting results to the engineering Sr. Laboratory Technician InvenSense, Inc. September 2013  –  April 2014  (8 months) San Jose Ca Conduct failure analysis testing on MEMS based semiconductor motion devices \nResponsible for FA testing and reporting results to the engineering Associate Manufacturing Engineer Prysm May 2012  –  February 2013  (10 months) San Jose CA Responsible for pilot line production of LPD (laser phosphate display) video display panels \n• Subassembly, assembly and system level building, integration, alignment and testing of laser light engine modules \n• Contribute to the development of tooling, fixtures and process for assembly and testing \n• Developed, wrote, preformed and documented assembly and testing procedures \n• Inspected optical parts to mechanical and optical specifications Associate Manufacturing Engineer Prysm May 2012  –  February 2013  (10 months) San Jose CA Responsible for pilot line production of LPD (laser phosphate display) video display panels \n• Subassembly, assembly and system level building, integration, alignment and testing of laser light engine modules \n• Contribute to the development of tooling, fixtures and process for assembly and testing \n• Developed, wrote, preformed and documented assembly and testing procedures \n• Inspected optical parts to mechanical and optical specifications Sr. Engineering Technician Capella Photonics 2005  –  2012  (7 years) San Jose Ca Assisted in the development of 3rd generation Wavelength Selective Switches (WSS) ROADM, to manage traffic through the next-generation optical networks. A MEMS based system. \n•\tCompletely setup and ran a full pilot production line to qualify the manufacturability of the WSS optical switch product. \n•\tSuccessfully transfer products and manufacturing lines to the contract manufacturer in Thailand and Japan. \n•\tResponsible for qualifying next generation product design, test and measure prototype modules including MEMS based switch components.  \n•\tAssist with training manufacturing groups and support troubleshooting of technical issues with optical switch and process flow. \n•\tConduct a Failure analyses on RMA’s (Return Material Authorization) units from the field. \n•\tWorked with part vendors to insure product meet company specifications and process flow Sr. Engineering Technician Capella Photonics 2005  –  2012  (7 years) San Jose Ca Assisted in the development of 3rd generation Wavelength Selective Switches (WSS) ROADM, to manage traffic through the next-generation optical networks. A MEMS based system. \n•\tCompletely setup and ran a full pilot production line to qualify the manufacturability of the WSS optical switch product. \n•\tSuccessfully transfer products and manufacturing lines to the contract manufacturer in Thailand and Japan. \n•\tResponsible for qualifying next generation product design, test and measure prototype modules including MEMS based switch components.  \n•\tAssist with training manufacturing groups and support troubleshooting of technical issues with optical switch and process flow. \n•\tConduct a Failure analyses on RMA’s (Return Material Authorization) units from the field. \n•\tWorked with part vendors to insure product meet company specifications and process flow Optics Specialist Contractor Rockwell Collins 2004  –  2005  (1 year) San Jose Ca Manufacturing support on visual displays instrument panels for military use.  \nResponsible for all Quarter wave plate assemblies as well process improvement. Optics Specialist Contractor Rockwell Collins 2004  –  2005  (1 year) San Jose Ca Manufacturing support on visual displays instrument panels for military use.  \nResponsible for all Quarter wave plate assemblies as well process improvement. Engineering Technician Contractor Intel Corporation 2003  –  2004  (1 year) Fremont Ca Successfully completed an R&D project that developed Electrical Transceivers for 10 Gigabit Ethernet switches and routers for optical and copper base networks  \n•\tResponsible for all prototypes builds and test processes of the CX4 XENPAK modules. \n•\tTest and compile all characterization data to be reported to the project engineers. \n•\tImproved process and reduce product cost for product introduction. \n•\tLiaison between R&D, manufacturing and technical support for manufacturing. Engineering Technician Contractor Intel Corporation 2003  –  2004  (1 year) Fremont Ca Successfully completed an R&D project that developed Electrical Transceivers for 10 Gigabit Ethernet switches and routers for optical and copper base networks  \n•\tResponsible for all prototypes builds and test processes of the CX4 XENPAK modules. \n•\tTest and compile all characterization data to be reported to the project engineers. \n•\tImproved process and reduce product cost for product introduction. \n•\tLiaison between R&D, manufacturing and technical support for manufacturing. R&D Technician Gigabit Optics 2001  –  2002  (1 year) Sunnyvale Ca Worked on optical components to create sub-assemblies for use in optical networks for a variety of WDM applications including multi-port transmitters, receivers, and transceivers.  \n•\tResponsible for assembly and optical alignment of prototype Micro-MUX/DeMUX,  \n•\tDocumenting test processes and engineering changes. \n•\tSetup assembly station for Pilot production runs. R&D Technician Gigabit Optics 2001  –  2002  (1 year) Sunnyvale Ca Worked on optical components to create sub-assemblies for use in optical networks for a variety of WDM applications including multi-port transmitters, receivers, and transceivers.  \n•\tResponsible for assembly and optical alignment of prototype Micro-MUX/DeMUX,  \n•\tDocumenting test processes and engineering changes. \n•\tSetup assembly station for Pilot production runs. Sr. Optoelectronics Technician New Focus 1997  –  2001  (4 years) San Jose Ca Collaborated on a research project to develop a tunable laser module for the optical network industry. Responsible for the integration and installation of prototype laser cavity into final package. Constructed and managed development labs and test stations. Evaluated all prototype modules at final test station. Complied final test data to be presented to develop engineering. Sr. Optoelectronics Technician New Focus 1997  –  2001  (4 years) San Jose Ca Collaborated on a research project to develop a tunable laser module for the optical network industry. Responsible for the integration and installation of prototype laser cavity into final package. Constructed and managed development labs and test stations. Evaluated all prototype modules at final test station. Complied final test data to be presented to develop engineering. Laser Technician Liconix inc 1996  –  1997  (1 year) Santa Clara Ca Responsible for troubleshooting and repairing all small and mid-size (Helium-Cadmium) lasers. Laser Technician Liconix inc 1996  –  1997  (1 year) Santa Clara Ca Responsible for troubleshooting and repairing all small and mid-size (Helium-Cadmium) lasers. Languages   Skills Optics Optoelectronics Semiconductors Fiber Optics Photonics Testing R&D Product Development Manufacturing Optical Fiber Electronics Failure Analysis Laser Labview Thin Films Contract Manufacturing MRP Design for Manufacturing Technical Documentation MEMS Optical Communications Cross-functional Team... Engineering Sensors Design of Experiments GPIB Engineering Management Optical Engineering Embedded Systems Mixed Signal Laser Diodes Simulations SPC Telecommunications Debugging Analog Prototype NPI Opto-mechanical Hardware Diagnostics Field Service... Test Lab Management See 27+     See less Skills  Optics Optoelectronics Semiconductors Fiber Optics Photonics Testing R&D Product Development Manufacturing Optical Fiber Electronics Failure Analysis Laser Labview Thin Films Contract Manufacturing MRP Design for Manufacturing Technical Documentation MEMS Optical Communications Cross-functional Team... Engineering Sensors Design of Experiments GPIB Engineering Management Optical Engineering Embedded Systems Mixed Signal Laser Diodes Simulations SPC Telecommunications Debugging Analog Prototype NPI Opto-mechanical Hardware Diagnostics Field Service... Test Lab Management See 27+     See less Optics Optoelectronics Semiconductors Fiber Optics Photonics Testing R&D Product Development Manufacturing Optical Fiber Electronics Failure Analysis Laser Labview Thin Films Contract Manufacturing MRP Design for Manufacturing Technical Documentation MEMS Optical Communications Cross-functional Team... Engineering Sensors Design of Experiments GPIB Engineering Management Optical Engineering Embedded Systems Mixed Signal Laser Diodes Simulations SPC Telecommunications Debugging Analog Prototype NPI Opto-mechanical Hardware Diagnostics Field Service... Test Lab Management See 27+     See less Optics Optoelectronics Semiconductors Fiber Optics Photonics Testing R&D Product Development Manufacturing Optical Fiber Electronics Failure Analysis Laser Labview Thin Films Contract Manufacturing MRP Design for Manufacturing Technical Documentation MEMS Optical Communications Cross-functional Team... Engineering Sensors Design of Experiments GPIB Engineering Management Optical Engineering Embedded Systems Mixed Signal Laser Diodes Simulations SPC Telecommunications Debugging Analog Prototype NPI Opto-mechanical Hardware Diagnostics Field Service... Test Lab Management See 27+     See less Education San Jose City College AA AS,  Physics , Laser Technology,  Electronics 1998  – 2002 Gilroy High school High School San Jose City College AA AS,  Physics , Laser Technology,  Electronics 1998  – 2002 San Jose City College AA AS,  Physics , Laser Technology,  Electronics 1998  – 2002 San Jose City College AA AS,  Physics , Laser Technology,  Electronics 1998  – 2002 Gilroy High school High School Gilroy High school High School Gilroy High school High School Honors & Awards ", "Experience DLNA Certification Administrator/Technical Operations Digital Living Network Alliance (DLNA) November 2010  – Present (4 years 10 months) Portland, Oregon Area Responsible for being an expert on all aspects of the DLNA Certification Program and on DLNA Certified devices and their operation. \n \nManage web development vendor and provide project management, defect tracking, and assist in design for updates to the web based certification system interface and database of certified products.\t \n \nProvide technical demonstrations of DLNA devices at tradeshows (such as CES/IBC) and other meetings/events of the organization.  \n \nManage setup and coordination for global events including tradeshows and interoperability events and recruit new member companies.  \n \nManage wireless networking and product scheduling at DLNA Plugfests. \n \nAssist marketing with technical details of DLNA guidelines and implementations. Frimware Test Engineer (Contractor) Hewlett-Packard April 2009  –  October 2010  (1 year 7 months) Vancouver, Wa Writing and developing test cases and test scripts for printer firmware testing, managing tests and scripts, working with test teams to ensure accuracy of results, working with developers to implement test coverage for requirements, scheduling and maintenance of print quality and various other test environments. Technologies used for development include REST/LEDM, XML, and VB Scripting. SoftwareTest Engineer (Contractor) Intel Corporation February 2009  –  April 2009  (3 months) Hillsboro, Or Writing and developing test cases for third party and proprietary software solutions in an agile environment. Building SQL server networks from the ground, QA testing of the software and software environment. \n \nManage, write, and track defects and implement test cases around new defects and issues during agile testing.  \n \nVerifying fixes to third party applications as well as proprietary software. \n \nWorking close with engineers to ensure the software schedule deadlines were met. Handset Test Technician (Contractor TEK Systems) AT&T September 2008  –  December 2008  (4 months) Austin, Texas Area Testing of various third party vendor GSM mobile devices (2G and 3G) against AT&T 10776 requirements on Anite test systems to ensure stability from occurring network changes. Experience in SIM programming, SAS software, automation testing, and manual interactive testing. Hardware/Software Test Engineer (Contractor) Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, Or Responsibilities included building PCs from ground up, develop test cases, identify bugs, debug issues, file bug reports, troubleshoot hardware issues, configure BIOS settings, BIOS manipulation, RAID configuration, test low-level system functionality, check OS drivers for HW components, execute test cases, and communicate results. QA Engineer – RAPIDGate® Secure Vetting System Eid Passport August 2007  –  May 2008  (10 months) Hillsboro, Or QA testing on proprietary software (3-tier business logic system) designed for the U.S. government (military and civilian) to ensure the product is ready for distribution in a production environment. \n \nTesting of new hardware, tools, and utilities were also part of my job responsibilities. \n \nOther duties included building stations for deployment to new locations and beta test units for existing vendors. \n \nConfiguring all wireless and handheld devices to ensure, when deployed, they work properly in the field. \n \nSQL Server Installation, SQL queries, manipulating tables, running Jobs, verifying SQL table entries. Hardware/Software Verification Engineering Technician\t(Contractor) Intel Corporation August 2006  –  July 2007  (1 year) Hillsboro, OR Reviewing of testing requirements, writing of test cases, unit and interoperability testing of network media devices, routers, various stress and wireless networking tests, firmware testing, building of test systems, BIOS upgrading and manipulation, and streaming media over various network configurations. \n \nIn addition to testing, other responsibilities include writing and submitting defects, defect regression, defect tracking, inventory, writing documentation and instructions, learning new testing equipment/software tools, training technicians and various other tasks. Software & Firmware Test Technician (Contractor) Hewlett-Packard February 2006  –  August 2006  (7 months) Vancouver, Wa Defect triage of various printer platforms and products, building and testing of firmware builds using Linux, defect regression, script execution and editing, using a probe to pinpoint problems within firmware code, releasing firmware after it has been tested, Ad hoc testing, writing and editing defects in proprietary database, help in development of new processes, strong communication with lead engineers, and various other tasks. Hardware/Software Test Engineer Intel Corporation February 2005  –  February 2006  (1 year 1 month) Hillsboro, Or Reviewing testing requirements, writing test cases, unit and interoperability testing of Digital Media Adapters, Routers, and Sync N Go devices (MP3 Players, Personal Media Devices, PDA’s), writing test plans and procedures, various stress and wireless networking tests, building systems, BIOS upgrading, and streaming media over various network configurations. \n \nOther responsibilities include writing and submitting defects, defect regression, defect tracking, inventory, writing documentation and instructions, learning new testing equipment/software tools, training technicians and various other tasks. Hardware/Software Lead QA Test Technician/Trainer (Contractor) Hewlett-Packard June 2004  –  February 2005  (9 months) Vancouver, Wa Extensive hardware/software testing, including Bluetooth testing and 802.11, WHQL certification testing, all print functionality testing. Firmware testing, driver verification and testing, WHQL, debugging test scripts, digital imaging quality assessments, as well as training of technicians to learn firmware testing and troubleshooting as well as writing, regressing, and validating defects. Frequent participation in test process improvement. DLNA Certification Administrator/Technical Operations Digital Living Network Alliance (DLNA) November 2010  – Present (4 years 10 months) Portland, Oregon Area Responsible for being an expert on all aspects of the DLNA Certification Program and on DLNA Certified devices and their operation. \n \nManage web development vendor and provide project management, defect tracking, and assist in design for updates to the web based certification system interface and database of certified products.\t \n \nProvide technical demonstrations of DLNA devices at tradeshows (such as CES/IBC) and other meetings/events of the organization.  \n \nManage setup and coordination for global events including tradeshows and interoperability events and recruit new member companies.  \n \nManage wireless networking and product scheduling at DLNA Plugfests. \n \nAssist marketing with technical details of DLNA guidelines and implementations. DLNA Certification Administrator/Technical Operations Digital Living Network Alliance (DLNA) November 2010  – Present (4 years 10 months) Portland, Oregon Area Responsible for being an expert on all aspects of the DLNA Certification Program and on DLNA Certified devices and their operation. \n \nManage web development vendor and provide project management, defect tracking, and assist in design for updates to the web based certification system interface and database of certified products.\t \n \nProvide technical demonstrations of DLNA devices at tradeshows (such as CES/IBC) and other meetings/events of the organization.  \n \nManage setup and coordination for global events including tradeshows and interoperability events and recruit new member companies.  \n \nManage wireless networking and product scheduling at DLNA Plugfests. \n \nAssist marketing with technical details of DLNA guidelines and implementations. Frimware Test Engineer (Contractor) Hewlett-Packard April 2009  –  October 2010  (1 year 7 months) Vancouver, Wa Writing and developing test cases and test scripts for printer firmware testing, managing tests and scripts, working with test teams to ensure accuracy of results, working with developers to implement test coverage for requirements, scheduling and maintenance of print quality and various other test environments. Technologies used for development include REST/LEDM, XML, and VB Scripting. Frimware Test Engineer (Contractor) Hewlett-Packard April 2009  –  October 2010  (1 year 7 months) Vancouver, Wa Writing and developing test cases and test scripts for printer firmware testing, managing tests and scripts, working with test teams to ensure accuracy of results, working with developers to implement test coverage for requirements, scheduling and maintenance of print quality and various other test environments. Technologies used for development include REST/LEDM, XML, and VB Scripting. SoftwareTest Engineer (Contractor) Intel Corporation February 2009  –  April 2009  (3 months) Hillsboro, Or Writing and developing test cases for third party and proprietary software solutions in an agile environment. Building SQL server networks from the ground, QA testing of the software and software environment. \n \nManage, write, and track defects and implement test cases around new defects and issues during agile testing.  \n \nVerifying fixes to third party applications as well as proprietary software. \n \nWorking close with engineers to ensure the software schedule deadlines were met. SoftwareTest Engineer (Contractor) Intel Corporation February 2009  –  April 2009  (3 months) Hillsboro, Or Writing and developing test cases for third party and proprietary software solutions in an agile environment. Building SQL server networks from the ground, QA testing of the software and software environment. \n \nManage, write, and track defects and implement test cases around new defects and issues during agile testing.  \n \nVerifying fixes to third party applications as well as proprietary software. \n \nWorking close with engineers to ensure the software schedule deadlines were met. Handset Test Technician (Contractor TEK Systems) AT&T September 2008  –  December 2008  (4 months) Austin, Texas Area Testing of various third party vendor GSM mobile devices (2G and 3G) against AT&T 10776 requirements on Anite test systems to ensure stability from occurring network changes. Experience in SIM programming, SAS software, automation testing, and manual interactive testing. Handset Test Technician (Contractor TEK Systems) AT&T September 2008  –  December 2008  (4 months) Austin, Texas Area Testing of various third party vendor GSM mobile devices (2G and 3G) against AT&T 10776 requirements on Anite test systems to ensure stability from occurring network changes. Experience in SIM programming, SAS software, automation testing, and manual interactive testing. Hardware/Software Test Engineer (Contractor) Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, Or Responsibilities included building PCs from ground up, develop test cases, identify bugs, debug issues, file bug reports, troubleshoot hardware issues, configure BIOS settings, BIOS manipulation, RAID configuration, test low-level system functionality, check OS drivers for HW components, execute test cases, and communicate results. Hardware/Software Test Engineer (Contractor) Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, Or Responsibilities included building PCs from ground up, develop test cases, identify bugs, debug issues, file bug reports, troubleshoot hardware issues, configure BIOS settings, BIOS manipulation, RAID configuration, test low-level system functionality, check OS drivers for HW components, execute test cases, and communicate results. QA Engineer – RAPIDGate® Secure Vetting System Eid Passport August 2007  –  May 2008  (10 months) Hillsboro, Or QA testing on proprietary software (3-tier business logic system) designed for the U.S. government (military and civilian) to ensure the product is ready for distribution in a production environment. \n \nTesting of new hardware, tools, and utilities were also part of my job responsibilities. \n \nOther duties included building stations for deployment to new locations and beta test units for existing vendors. \n \nConfiguring all wireless and handheld devices to ensure, when deployed, they work properly in the field. \n \nSQL Server Installation, SQL queries, manipulating tables, running Jobs, verifying SQL table entries. QA Engineer – RAPIDGate® Secure Vetting System Eid Passport August 2007  –  May 2008  (10 months) Hillsboro, Or QA testing on proprietary software (3-tier business logic system) designed for the U.S. government (military and civilian) to ensure the product is ready for distribution in a production environment. \n \nTesting of new hardware, tools, and utilities were also part of my job responsibilities. \n \nOther duties included building stations for deployment to new locations and beta test units for existing vendors. \n \nConfiguring all wireless and handheld devices to ensure, when deployed, they work properly in the field. \n \nSQL Server Installation, SQL queries, manipulating tables, running Jobs, verifying SQL table entries. Hardware/Software Verification Engineering Technician\t(Contractor) Intel Corporation August 2006  –  July 2007  (1 year) Hillsboro, OR Reviewing of testing requirements, writing of test cases, unit and interoperability testing of network media devices, routers, various stress and wireless networking tests, firmware testing, building of test systems, BIOS upgrading and manipulation, and streaming media over various network configurations. \n \nIn addition to testing, other responsibilities include writing and submitting defects, defect regression, defect tracking, inventory, writing documentation and instructions, learning new testing equipment/software tools, training technicians and various other tasks. Hardware/Software Verification Engineering Technician\t(Contractor) Intel Corporation August 2006  –  July 2007  (1 year) Hillsboro, OR Reviewing of testing requirements, writing of test cases, unit and interoperability testing of network media devices, routers, various stress and wireless networking tests, firmware testing, building of test systems, BIOS upgrading and manipulation, and streaming media over various network configurations. \n \nIn addition to testing, other responsibilities include writing and submitting defects, defect regression, defect tracking, inventory, writing documentation and instructions, learning new testing equipment/software tools, training technicians and various other tasks. Software & Firmware Test Technician (Contractor) Hewlett-Packard February 2006  –  August 2006  (7 months) Vancouver, Wa Defect triage of various printer platforms and products, building and testing of firmware builds using Linux, defect regression, script execution and editing, using a probe to pinpoint problems within firmware code, releasing firmware after it has been tested, Ad hoc testing, writing and editing defects in proprietary database, help in development of new processes, strong communication with lead engineers, and various other tasks. Software & Firmware Test Technician (Contractor) Hewlett-Packard February 2006  –  August 2006  (7 months) Vancouver, Wa Defect triage of various printer platforms and products, building and testing of firmware builds using Linux, defect regression, script execution and editing, using a probe to pinpoint problems within firmware code, releasing firmware after it has been tested, Ad hoc testing, writing and editing defects in proprietary database, help in development of new processes, strong communication with lead engineers, and various other tasks. Hardware/Software Test Engineer Intel Corporation February 2005  –  February 2006  (1 year 1 month) Hillsboro, Or Reviewing testing requirements, writing test cases, unit and interoperability testing of Digital Media Adapters, Routers, and Sync N Go devices (MP3 Players, Personal Media Devices, PDA’s), writing test plans and procedures, various stress and wireless networking tests, building systems, BIOS upgrading, and streaming media over various network configurations. \n \nOther responsibilities include writing and submitting defects, defect regression, defect tracking, inventory, writing documentation and instructions, learning new testing equipment/software tools, training technicians and various other tasks. Hardware/Software Test Engineer Intel Corporation February 2005  –  February 2006  (1 year 1 month) Hillsboro, Or Reviewing testing requirements, writing test cases, unit and interoperability testing of Digital Media Adapters, Routers, and Sync N Go devices (MP3 Players, Personal Media Devices, PDA’s), writing test plans and procedures, various stress and wireless networking tests, building systems, BIOS upgrading, and streaming media over various network configurations. \n \nOther responsibilities include writing and submitting defects, defect regression, defect tracking, inventory, writing documentation and instructions, learning new testing equipment/software tools, training technicians and various other tasks. Hardware/Software Lead QA Test Technician/Trainer (Contractor) Hewlett-Packard June 2004  –  February 2005  (9 months) Vancouver, Wa Extensive hardware/software testing, including Bluetooth testing and 802.11, WHQL certification testing, all print functionality testing. Firmware testing, driver verification and testing, WHQL, debugging test scripts, digital imaging quality assessments, as well as training of technicians to learn firmware testing and troubleshooting as well as writing, regressing, and validating defects. Frequent participation in test process improvement. Hardware/Software Lead QA Test Technician/Trainer (Contractor) Hewlett-Packard June 2004  –  February 2005  (9 months) Vancouver, Wa Extensive hardware/software testing, including Bluetooth testing and 802.11, WHQL certification testing, all print functionality testing. Firmware testing, driver verification and testing, WHQL, debugging test scripts, digital imaging quality assessments, as well as training of technicians to learn firmware testing and troubleshooting as well as writing, regressing, and validating defects. Frequent participation in test process improvement. Languages Spanish Spanish Spanish Skills Testing Hardware Wireless Troubleshooting Firmware Test Planning QA Test Engineering International Tradeshows Network Engineering Technical Demonstrations Press and Media... Event Management Marketing Member Recruitment Operating Systems Linux Mobile Devices Recruiting Debugging Test Automation Embedded Systems Product Management Networking Software Development See 9+     See less Skills  Testing Hardware Wireless Troubleshooting Firmware Test Planning QA Test Engineering International Tradeshows Network Engineering Technical Demonstrations Press and Media... Event Management Marketing Member Recruitment Operating Systems Linux Mobile Devices Recruiting Debugging Test Automation Embedded Systems Product Management Networking Software Development See 9+     See less Testing Hardware Wireless Troubleshooting Firmware Test Planning QA Test Engineering International Tradeshows Network Engineering Technical Demonstrations Press and Media... Event Management Marketing Member Recruitment Operating Systems Linux Mobile Devices Recruiting Debugging Test Automation Embedded Systems Product Management Networking Software Development See 9+     See less Testing Hardware Wireless Troubleshooting Firmware Test Planning QA Test Engineering International Tradeshows Network Engineering Technical Demonstrations Press and Media... Event Management Marketing Member Recruitment Operating Systems Linux Mobile Devices Recruiting Debugging Test Automation Embedded Systems Product Management Networking Software Development See 9+     See less Education Mt. Hood Community College AAS,  Computer Applications 2001  – 2003 Mt. Hood Community College AAS,  Computer Applications 2001  – 2003 Mt. Hood Community College AAS,  Computer Applications 2001  – 2003 Mt. Hood Community College AAS,  Computer Applications 2001  – 2003 ", "Summary Engineering Technician; Electrical Maintenance Technician; Lab Technician; Sincere, focused, tenacious, goal driven, creative problem solver. Background in safety compliance testing, medical device testing, telecom, troubleshooting & repair of analog and electrical systems. Passionate about audio and recording technology. Strengths include strong analytical and creative ability, excellent electronic and mechanical aptitude. Excels in team corroborations, independent project management and technical support roles.  \n \n \nOVERVIEW \n•\t8 years experience in the semiconductor industry; Intel, Toshiba, Fairchild \n•\t5 years experience Senior Lab Technician with Underwriters Laboratories \n•\tTechnical experience in a variety of fields: telecom, electronic repair & calibration \n•\tExperience with Tektronix high-speed storage scopes, power meters \n•\tOver 15 years soldering experience including SMD & Mil-Spec wiring \n•\t+15 years public speaking and teaching experience on a weekly basis \n•\tAbility to develop instant rapport with customers and coworkers \n•\tSkilled at restoring, rebuilding, modifying, and building and electronic devices  \n•\tGuitar amplifier design, fabrication, modifcation, & repairs \n•\tGuitar effects building & repair \n•\tSpeaker enclosure design, fabrication, wiring, reconing \n•\tAA Degree Graduate September 2011; GPA – 3.8 \n \n \nSpecialties: Technical: Mechanical & Electronic Assembly; Vacuum tube technology; schematic & layout drawing; audio devices; soldering & SMT rework; prototyping; hand held GPS devices; lighting tech ● Lab Testing: Medical devices; lighting; audio preamps and amplifiers; switching power supplies; neon power supplies High voltage testing; EMC testing ● Public Speaking & Teaching: Use of illustrations, charts, drawings & multimedia; directing public forum; staff technical training. Summary Engineering Technician; Electrical Maintenance Technician; Lab Technician; Sincere, focused, tenacious, goal driven, creative problem solver. Background in safety compliance testing, medical device testing, telecom, troubleshooting & repair of analog and electrical systems. Passionate about audio and recording technology. Strengths include strong analytical and creative ability, excellent electronic and mechanical aptitude. Excels in team corroborations, independent project management and technical support roles.  \n \n \nOVERVIEW \n•\t8 years experience in the semiconductor industry; Intel, Toshiba, Fairchild \n•\t5 years experience Senior Lab Technician with Underwriters Laboratories \n•\tTechnical experience in a variety of fields: telecom, electronic repair & calibration \n•\tExperience with Tektronix high-speed storage scopes, power meters \n•\tOver 15 years soldering experience including SMD & Mil-Spec wiring \n•\t+15 years public speaking and teaching experience on a weekly basis \n•\tAbility to develop instant rapport with customers and coworkers \n•\tSkilled at restoring, rebuilding, modifying, and building and electronic devices  \n•\tGuitar amplifier design, fabrication, modifcation, & repairs \n•\tGuitar effects building & repair \n•\tSpeaker enclosure design, fabrication, wiring, reconing \n•\tAA Degree Graduate September 2011; GPA – 3.8 \n \n \nSpecialties: Technical: Mechanical & Electronic Assembly; Vacuum tube technology; schematic & layout drawing; audio devices; soldering & SMT rework; prototyping; hand held GPS devices; lighting tech ● Lab Testing: Medical devices; lighting; audio preamps and amplifiers; switching power supplies; neon power supplies High voltage testing; EMC testing ● Public Speaking & Teaching: Use of illustrations, charts, drawings & multimedia; directing public forum; staff technical training. Engineering Technician; Electrical Maintenance Technician; Lab Technician; Sincere, focused, tenacious, goal driven, creative problem solver. Background in safety compliance testing, medical device testing, telecom, troubleshooting & repair of analog and electrical systems. Passionate about audio and recording technology. Strengths include strong analytical and creative ability, excellent electronic and mechanical aptitude. Excels in team corroborations, independent project management and technical support roles.  \n \n \nOVERVIEW \n•\t8 years experience in the semiconductor industry; Intel, Toshiba, Fairchild \n•\t5 years experience Senior Lab Technician with Underwriters Laboratories \n•\tTechnical experience in a variety of fields: telecom, electronic repair & calibration \n•\tExperience with Tektronix high-speed storage scopes, power meters \n•\tOver 15 years soldering experience including SMD & Mil-Spec wiring \n•\t+15 years public speaking and teaching experience on a weekly basis \n•\tAbility to develop instant rapport with customers and coworkers \n•\tSkilled at restoring, rebuilding, modifying, and building and electronic devices  \n•\tGuitar amplifier design, fabrication, modifcation, & repairs \n•\tGuitar effects building & repair \n•\tSpeaker enclosure design, fabrication, wiring, reconing \n•\tAA Degree Graduate September 2011; GPA – 3.8 \n \n \nSpecialties: Technical: Mechanical & Electronic Assembly; Vacuum tube technology; schematic & layout drawing; audio devices; soldering & SMT rework; prototyping; hand held GPS devices; lighting tech ● Lab Testing: Medical devices; lighting; audio preamps and amplifiers; switching power supplies; neon power supplies High voltage testing; EMC testing ● Public Speaking & Teaching: Use of illustrations, charts, drawings & multimedia; directing public forum; staff technical training. Engineering Technician; Electrical Maintenance Technician; Lab Technician; Sincere, focused, tenacious, goal driven, creative problem solver. Background in safety compliance testing, medical device testing, telecom, troubleshooting & repair of analog and electrical systems. Passionate about audio and recording technology. Strengths include strong analytical and creative ability, excellent electronic and mechanical aptitude. Excels in team corroborations, independent project management and technical support roles.  \n \n \nOVERVIEW \n•\t8 years experience in the semiconductor industry; Intel, Toshiba, Fairchild \n•\t5 years experience Senior Lab Technician with Underwriters Laboratories \n•\tTechnical experience in a variety of fields: telecom, electronic repair & calibration \n•\tExperience with Tektronix high-speed storage scopes, power meters \n•\tOver 15 years soldering experience including SMD & Mil-Spec wiring \n•\t+15 years public speaking and teaching experience on a weekly basis \n•\tAbility to develop instant rapport with customers and coworkers \n•\tSkilled at restoring, rebuilding, modifying, and building and electronic devices  \n•\tGuitar amplifier design, fabrication, modifcation, & repairs \n•\tGuitar effects building & repair \n•\tSpeaker enclosure design, fabrication, wiring, reconing \n•\tAA Degree Graduate September 2011; GPA – 3.8 \n \n \nSpecialties: Technical: Mechanical & Electronic Assembly; Vacuum tube technology; schematic & layout drawing; audio devices; soldering & SMT rework; prototyping; hand held GPS devices; lighting tech ● Lab Testing: Medical devices; lighting; audio preamps and amplifiers; switching power supplies; neon power supplies High voltage testing; EMC testing ● Public Speaking & Teaching: Use of illustrations, charts, drawings & multimedia; directing public forum; staff technical training. Experience Validation Hardware Engineering Technician Intel Corporation September 2013  – Present (2 years) Jones Farm Campus, Hillsboro, OR Fabrication, testing, troubleshooting, and programming of prototype validation platforms. Test Equipment and supplies inventory and organization; SMD Rework; Domestic and International shipping. Manufacturing Technician INTEL CORPORATION January 2011  – Present (4 years 8 months) Jones Farm, Hillsboro, OR Control center operation. Performed preventative maintenance, chemical bottle changes, Bidaily, and weekly PM’s & engineering projects for 300mm wafer processing equipment Ronler Acres D1D/D1X fab. \n•\tLevel One Certs: Litho: Slam/Barc, Implant/Epi/RTA: RTA/UFR TFR, FTT, LSA, UDK, UDC \n•\tLevel Two Certs: CGA/MES300, AMAT Tweaks; CoHE, Subfab; RVI-RVN, RTA/RTP Senior Engineering Technician / Contractor INTEL CORPORATION January 2007  – Present (8 years 8 months) Jones Farm Campus, Hillsboro, OR Verified specifications of high voltage switching DC power supplies & power converters within six week deadline \n*\tFabricate test setup: electronic loads, power analyzer, network analyzer, oscilloscope, and DC power supply \n*\tPurchased, organized, maintain inventory of electronic components, supplies for R&D Lab \n*\tCreated daily progress reports in Excel, Setup test equipment, perform abnormal operation testing Associates Degree Graduate ITT Technical Institute September 2009  –  September 2011  (2 years 1 month) Computer and Electronics Engineering Technology MDU CAD Enginneer NORTHSKY COMMUNICATIONS January 2008  –  January 2009  (1 year 1 month) Produced underground and overhead construction layouts for Verizon FIOS fiber-optic installation projects. \n•\tDesigned and drafted construction layouts for Verizon underground & overhead fiber-optic networks MTU Engineer/ Contractor VERIZON FIOS January 2007  –  January 2008  (1 year 1 month) Measured & documented Portland area commercial telecom plant layout & construction drawings. Interpret & update overhead / underground construction schematic diagrams. Make customer contact & perform telecom interface inspections. Diagram & photograph telecom rooms & equipment.  \n•\tProduced complete documentation of Portland area underground & overhead fiber-optic networks \n•\tFinished assignment six months ahead of schedule yielding a $158K savings Senior Engineering Technician / Contractor INTEL CORPERATION January 2007  –  December 2007  (1 year) Hillsboro, OR Verified specs for high efficiency, high voltage, DC power supply prototype. Set up power analyzer, network analyzer, oscilloscopes, electronic loads, and DC power supplies, taking accurate measurements and documentation of all test results. \n•\tVerified specifications of high voltage DC power supply within six week deadline \n•\tPurchased, organized, maintained inventory of electronic components for R&D Lab \n•\tCreated daily progress reports in Excel \n•\tSetup test equipment and performed abnormal operation testing CAD TECHNICIAN / CONTRACTOR Tallman Engineering January 2004  –  December 2005  (2 years) Canby, OR ·\tDrafted civil engineering projects and assisted with land surveying for private and municipal projects \n·\tLocated property lines, read Plat maps, edited redline drawings in AutoCAD Senior Lab Technician UNDERWRITER'S LABORATORIES January 1998  –  October 2003  (5 years 10 months) Santa Clara, CA Performed safety compliance testing, multiple product categories including: Medical devices, power supplies, AC/DC motors, lighting, (H.V. neon supplies, LED lamping, emergency, fluorescent ballasts, sodium, mercury vapor etc…) Accurate test result documentation; EMC testing, setup & operate engineering projects. \nGenerated $14K within 1st month of developing new neon switching power supply test procedures \n•\tIncreased testing efficiency, capacity by fabricating new neon test loads and portable abnormal test cart \n•\tAchieved revenues of $32K/mo within 3 months by setting up new southern CA lab for I.T. & medical testing \n•\tIncreased safety and test efficiency by developing test manual and weekly training sessions for engineers \n•\tIncreased revenues and testing capacity by designing & constructing U.L. certified test stations and fixtures Validation Hardware Engineering Technician Intel Corporation September 2013  – Present (2 years) Jones Farm Campus, Hillsboro, OR Fabrication, testing, troubleshooting, and programming of prototype validation platforms. Test Equipment and supplies inventory and organization; SMD Rework; Domestic and International shipping. Validation Hardware Engineering Technician Intel Corporation September 2013  – Present (2 years) Jones Farm Campus, Hillsboro, OR Fabrication, testing, troubleshooting, and programming of prototype validation platforms. Test Equipment and supplies inventory and organization; SMD Rework; Domestic and International shipping. Manufacturing Technician INTEL CORPORATION January 2011  – Present (4 years 8 months) Jones Farm, Hillsboro, OR Control center operation. Performed preventative maintenance, chemical bottle changes, Bidaily, and weekly PM’s & engineering projects for 300mm wafer processing equipment Ronler Acres D1D/D1X fab. \n•\tLevel One Certs: Litho: Slam/Barc, Implant/Epi/RTA: RTA/UFR TFR, FTT, LSA, UDK, UDC \n•\tLevel Two Certs: CGA/MES300, AMAT Tweaks; CoHE, Subfab; RVI-RVN, RTA/RTP Manufacturing Technician INTEL CORPORATION January 2011  – Present (4 years 8 months) Jones Farm, Hillsboro, OR Control center operation. Performed preventative maintenance, chemical bottle changes, Bidaily, and weekly PM’s & engineering projects for 300mm wafer processing equipment Ronler Acres D1D/D1X fab. \n•\tLevel One Certs: Litho: Slam/Barc, Implant/Epi/RTA: RTA/UFR TFR, FTT, LSA, UDK, UDC \n•\tLevel Two Certs: CGA/MES300, AMAT Tweaks; CoHE, Subfab; RVI-RVN, RTA/RTP Senior Engineering Technician / Contractor INTEL CORPORATION January 2007  – Present (8 years 8 months) Jones Farm Campus, Hillsboro, OR Verified specifications of high voltage switching DC power supplies & power converters within six week deadline \n*\tFabricate test setup: electronic loads, power analyzer, network analyzer, oscilloscope, and DC power supply \n*\tPurchased, organized, maintain inventory of electronic components, supplies for R&D Lab \n*\tCreated daily progress reports in Excel, Setup test equipment, perform abnormal operation testing Senior Engineering Technician / Contractor INTEL CORPORATION January 2007  – Present (8 years 8 months) Jones Farm Campus, Hillsboro, OR Verified specifications of high voltage switching DC power supplies & power converters within six week deadline \n*\tFabricate test setup: electronic loads, power analyzer, network analyzer, oscilloscope, and DC power supply \n*\tPurchased, organized, maintain inventory of electronic components, supplies for R&D Lab \n*\tCreated daily progress reports in Excel, Setup test equipment, perform abnormal operation testing Associates Degree Graduate ITT Technical Institute September 2009  –  September 2011  (2 years 1 month) Computer and Electronics Engineering Technology Associates Degree Graduate ITT Technical Institute September 2009  –  September 2011  (2 years 1 month) Computer and Electronics Engineering Technology MDU CAD Enginneer NORTHSKY COMMUNICATIONS January 2008  –  January 2009  (1 year 1 month) Produced underground and overhead construction layouts for Verizon FIOS fiber-optic installation projects. \n•\tDesigned and drafted construction layouts for Verizon underground & overhead fiber-optic networks MDU CAD Enginneer NORTHSKY COMMUNICATIONS January 2008  –  January 2009  (1 year 1 month) Produced underground and overhead construction layouts for Verizon FIOS fiber-optic installation projects. \n•\tDesigned and drafted construction layouts for Verizon underground & overhead fiber-optic networks MTU Engineer/ Contractor VERIZON FIOS January 2007  –  January 2008  (1 year 1 month) Measured & documented Portland area commercial telecom plant layout & construction drawings. Interpret & update overhead / underground construction schematic diagrams. Make customer contact & perform telecom interface inspections. Diagram & photograph telecom rooms & equipment.  \n•\tProduced complete documentation of Portland area underground & overhead fiber-optic networks \n•\tFinished assignment six months ahead of schedule yielding a $158K savings MTU Engineer/ Contractor VERIZON FIOS January 2007  –  January 2008  (1 year 1 month) Measured & documented Portland area commercial telecom plant layout & construction drawings. Interpret & update overhead / underground construction schematic diagrams. Make customer contact & perform telecom interface inspections. Diagram & photograph telecom rooms & equipment.  \n•\tProduced complete documentation of Portland area underground & overhead fiber-optic networks \n•\tFinished assignment six months ahead of schedule yielding a $158K savings Senior Engineering Technician / Contractor INTEL CORPERATION January 2007  –  December 2007  (1 year) Hillsboro, OR Verified specs for high efficiency, high voltage, DC power supply prototype. Set up power analyzer, network analyzer, oscilloscopes, electronic loads, and DC power supplies, taking accurate measurements and documentation of all test results. \n•\tVerified specifications of high voltage DC power supply within six week deadline \n•\tPurchased, organized, maintained inventory of electronic components for R&D Lab \n•\tCreated daily progress reports in Excel \n•\tSetup test equipment and performed abnormal operation testing Senior Engineering Technician / Contractor INTEL CORPERATION January 2007  –  December 2007  (1 year) Hillsboro, OR Verified specs for high efficiency, high voltage, DC power supply prototype. Set up power analyzer, network analyzer, oscilloscopes, electronic loads, and DC power supplies, taking accurate measurements and documentation of all test results. \n•\tVerified specifications of high voltage DC power supply within six week deadline \n•\tPurchased, organized, maintained inventory of electronic components for R&D Lab \n•\tCreated daily progress reports in Excel \n•\tSetup test equipment and performed abnormal operation testing CAD TECHNICIAN / CONTRACTOR Tallman Engineering January 2004  –  December 2005  (2 years) Canby, OR ·\tDrafted civil engineering projects and assisted with land surveying for private and municipal projects \n·\tLocated property lines, read Plat maps, edited redline drawings in AutoCAD CAD TECHNICIAN / CONTRACTOR Tallman Engineering January 2004  –  December 2005  (2 years) Canby, OR ·\tDrafted civil engineering projects and assisted with land surveying for private and municipal projects \n·\tLocated property lines, read Plat maps, edited redline drawings in AutoCAD Senior Lab Technician UNDERWRITER'S LABORATORIES January 1998  –  October 2003  (5 years 10 months) Santa Clara, CA Performed safety compliance testing, multiple product categories including: Medical devices, power supplies, AC/DC motors, lighting, (H.V. neon supplies, LED lamping, emergency, fluorescent ballasts, sodium, mercury vapor etc…) Accurate test result documentation; EMC testing, setup & operate engineering projects. \nGenerated $14K within 1st month of developing new neon switching power supply test procedures \n•\tIncreased testing efficiency, capacity by fabricating new neon test loads and portable abnormal test cart \n•\tAchieved revenues of $32K/mo within 3 months by setting up new southern CA lab for I.T. & medical testing \n•\tIncreased safety and test efficiency by developing test manual and weekly training sessions for engineers \n•\tIncreased revenues and testing capacity by designing & constructing U.L. certified test stations and fixtures Senior Lab Technician UNDERWRITER'S LABORATORIES January 1998  –  October 2003  (5 years 10 months) Santa Clara, CA Performed safety compliance testing, multiple product categories including: Medical devices, power supplies, AC/DC motors, lighting, (H.V. neon supplies, LED lamping, emergency, fluorescent ballasts, sodium, mercury vapor etc…) Accurate test result documentation; EMC testing, setup & operate engineering projects. \nGenerated $14K within 1st month of developing new neon switching power supply test procedures \n•\tIncreased testing efficiency, capacity by fabricating new neon test loads and portable abnormal test cart \n•\tAchieved revenues of $32K/mo within 3 months by setting up new southern CA lab for I.T. & medical testing \n•\tIncreased safety and test efficiency by developing test manual and weekly training sessions for engineers \n•\tIncreased revenues and testing capacity by designing & constructing U.L. certified test stations and fixtures Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Mechanical Assembly Electronic... Telecom Service Tech Public Speaking Soldering Electrical Electronics Welding Writing Electricians Test Equipment Troubleshooting Oscilloscope Circuit Design Vintage Audio... Electronic Repair Computer Hardware Training Sound Reinforcement Sound Editing Live Sound Audio Processing Electronics Repair Software Documentation Analog Power Supplies Analog Circuit Design Multimeter Calibration Microprocessors Digital Electronics VHDL Circuit Analysis Schematic Networking Assembly Language Multisim Manufacturing Telecommunications Spectrum Analyzer Semiconductor Industry Function Generator Electro-mechanical PLC PCB design Failure Analysis Network Analyzer RF Hardware Architecture Schematic Capture See 35+     See less Skills  Mechanical Assembly Electronic... Telecom Service Tech Public Speaking Soldering Electrical Electronics Welding Writing Electricians Test Equipment Troubleshooting Oscilloscope Circuit Design Vintage Audio... Electronic Repair Computer Hardware Training Sound Reinforcement Sound Editing Live Sound Audio Processing Electronics Repair Software Documentation Analog Power Supplies Analog Circuit Design Multimeter Calibration Microprocessors Digital Electronics VHDL Circuit Analysis Schematic Networking Assembly Language Multisim Manufacturing Telecommunications Spectrum Analyzer Semiconductor Industry Function Generator Electro-mechanical PLC PCB design Failure Analysis Network Analyzer RF Hardware Architecture Schematic Capture See 35+     See less Mechanical Assembly Electronic... Telecom Service Tech Public Speaking Soldering Electrical Electronics Welding Writing Electricians Test Equipment Troubleshooting Oscilloscope Circuit Design Vintage Audio... Electronic Repair Computer Hardware Training Sound Reinforcement Sound Editing Live Sound Audio Processing Electronics Repair Software Documentation Analog Power Supplies Analog Circuit Design Multimeter Calibration Microprocessors Digital Electronics VHDL Circuit Analysis Schematic Networking Assembly Language Multisim Manufacturing Telecommunications Spectrum Analyzer Semiconductor Industry Function Generator Electro-mechanical PLC PCB design Failure Analysis Network Analyzer RF Hardware Architecture Schematic Capture See 35+     See less Mechanical Assembly Electronic... Telecom Service Tech Public Speaking Soldering Electrical Electronics Welding Writing Electricians Test Equipment Troubleshooting Oscilloscope Circuit Design Vintage Audio... Electronic Repair Computer Hardware Training Sound Reinforcement Sound Editing Live Sound Audio Processing Electronics Repair Software Documentation Analog Power Supplies Analog Circuit Design Multimeter Calibration Microprocessors Digital Electronics VHDL Circuit Analysis Schematic Networking Assembly Language Multisim Manufacturing Telecommunications Spectrum Analyzer Semiconductor Industry Function Generator Electro-mechanical PLC PCB design Failure Analysis Network Analyzer RF Hardware Architecture Schematic Capture See 35+     See less Education ITT Technical Institute AAS,  Computer and Electronics Engineering 2009  – 2011 Portland Community College undergraduate studies,  Trades Preparation 2008  – 2008 ITT Technical Institute AAS,  Computer and Electronics Engineering 2009  – 2011 ITT Technical Institute AAS,  Computer and Electronics Engineering 2009  – 2011 ITT Technical Institute AAS,  Computer and Electronics Engineering 2009  – 2011 Portland Community College undergraduate studies,  Trades Preparation 2008  – 2008 Portland Community College undergraduate studies,  Trades Preparation 2008  – 2008 Portland Community College undergraduate studies,  Trades Preparation 2008  – 2008 Honors & Awards ITT Technical Institute Magma Cum Laude Graduate ITT Technical Institute September 2011 Dean's List Highest Honors; GPA 3.84 Member National Honors Society ALPHA BETA KAPPA ITT TECHNICAL INSTITUTE Beta of Oregon September 2011 Customer Service Exellence Award Underwriter's Laboratories September 2001 Chosen by peers for providing outstanding customer service Additional Honors & Awards Elected to National Honor Society ALPHA BETA KAPPA 2011; Deans List 2009, 2010, 2011; Customer Service Award UL 2001; Golden Key Awards Excellence in Fine Arts; ITT Technical Institute Magma Cum Laude Graduate ITT Technical Institute September 2011 Dean's List Highest Honors; GPA 3.84 ITT Technical Institute Magma Cum Laude Graduate ITT Technical Institute September 2011 Dean's List Highest Honors; GPA 3.84 ITT Technical Institute Magma Cum Laude Graduate ITT Technical Institute September 2011 Dean's List Highest Honors; GPA 3.84 Member National Honors Society ALPHA BETA KAPPA ITT TECHNICAL INSTITUTE Beta of Oregon September 2011 Member National Honors Society ALPHA BETA KAPPA ITT TECHNICAL INSTITUTE Beta of Oregon September 2011 Member National Honors Society ALPHA BETA KAPPA ITT TECHNICAL INSTITUTE Beta of Oregon September 2011 Customer Service Exellence Award Underwriter's Laboratories September 2001 Chosen by peers for providing outstanding customer service Customer Service Exellence Award Underwriter's Laboratories September 2001 Chosen by peers for providing outstanding customer service Customer Service Exellence Award Underwriter's Laboratories September 2001 Chosen by peers for providing outstanding customer service Additional Honors & Awards Elected to National Honor Society ALPHA BETA KAPPA 2011; Deans List 2009, 2010, 2011; Customer Service Award UL 2001; Golden Key Awards Excellence in Fine Arts; Additional Honors & Awards Elected to National Honor Society ALPHA BETA KAPPA 2011; Deans List 2009, 2010, 2011; Customer Service Award UL 2001; Golden Key Awards Excellence in Fine Arts; Additional Honors & Awards Elected to National Honor Society ALPHA BETA KAPPA 2011; Deans List 2009, 2010, 2011; Customer Service Award UL 2001; Golden Key Awards Excellence in Fine Arts; ", "Experience DE Technician Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro Lab manager for 10 to 15 engineers and technicians, assisting design engineering with electrical validation of new hardware, fault analysis of customer returns. Test Engineer Grass Valley March 2004  –  June 2008  (4 years 4 months) Beaverton Product test development through software diagnostics, JTAG verification, and manual verification. Contract manufacturer test process setup and implementation. Engineering Technician Contractor Intel Corporation April 2002  –  June 2003  (1 year 3 months) Hillsboro Motherboard electrical margin testing, Automated test script development Electronics Technician Tektronix June 1988  –  October 2001  (13 years 5 months) Beaverton Product Test and debug. Spectrum Analyzers, Television test equipment, Board level debug. DE Technician Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro Lab manager for 10 to 15 engineers and technicians, assisting design engineering with electrical validation of new hardware, fault analysis of customer returns. DE Technician Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro Lab manager for 10 to 15 engineers and technicians, assisting design engineering with electrical validation of new hardware, fault analysis of customer returns. Test Engineer Grass Valley March 2004  –  June 2008  (4 years 4 months) Beaverton Product test development through software diagnostics, JTAG verification, and manual verification. Contract manufacturer test process setup and implementation. Test Engineer Grass Valley March 2004  –  June 2008  (4 years 4 months) Beaverton Product test development through software diagnostics, JTAG verification, and manual verification. Contract manufacturer test process setup and implementation. Engineering Technician Contractor Intel Corporation April 2002  –  June 2003  (1 year 3 months) Hillsboro Motherboard electrical margin testing, Automated test script development Engineering Technician Contractor Intel Corporation April 2002  –  June 2003  (1 year 3 months) Hillsboro Motherboard electrical margin testing, Automated test script development Electronics Technician Tektronix June 1988  –  October 2001  (13 years 5 months) Beaverton Product Test and debug. Spectrum Analyzers, Television test equipment, Board level debug. Electronics Technician Tektronix June 1988  –  October 2001  (13 years 5 months) Beaverton Product Test and debug. Spectrum Analyzers, Television test equipment, Board level debug. Skills Electronics Skills  Electronics Electronics Electronics Education Oregon Institute of Technology Bachelor of Science (BS),  Renewable Energy Engineering 2009  – 2013 Activities and Societies:  IEEE Student Member\nASHRAE Student Member Blue Mountain Community College Associate of Science,  Electronic Engineering Technology Oregon Institute of Technology Bachelor of Science (BS),  Renewable Energy Engineering 2009  – 2013 Activities and Societies:  IEEE Student Member\nASHRAE Student Member Oregon Institute of Technology Bachelor of Science (BS),  Renewable Energy Engineering 2009  – 2013 Activities and Societies:  IEEE Student Member\nASHRAE Student Member Oregon Institute of Technology Bachelor of Science (BS),  Renewable Energy Engineering 2009  – 2013 Activities and Societies:  IEEE Student Member\nASHRAE Student Member Blue Mountain Community College Associate of Science,  Electronic Engineering Technology Blue Mountain Community College Associate of Science,  Electronic Engineering Technology Blue Mountain Community College Associate of Science,  Electronic Engineering Technology ", "Summary Diagnostic Equipment: Aerial Lift, Analog Meter, BGA/QFP Rework System, Cable Locator, DAQ (NI USB-6289), DediProg SF600, Digital Analyzer, Digital Multimeter, Flying Probe, Function Generator, Hot Air Soldering Station, Labtool Compact Programmer, Mechanical/Fusion Fiber Splicing Equipment, PACE PRC-2000 Soldering Workstation, RF Signal Analyzer, Signature Analyzer, Oscilloscopes, TTL Logic Probe, UV Eraser, Frequency Counter \n \nSoftware: Active Directory, Altium Viewer, AutoCAD, Backup Exec 2010 and 2012, Cadence Allegro Physical Viewer, Code Composer Studio, CMS 5.x, Electronic Workbench, GPO, Hyper-Terminal, Labelview 8.6 and 10, Mentor Pads Flow, McAfee EPO 4.5, MRO Maximo, MS Office, NI LabVIEW 2010, OpenOffice, Phone Flash Tool, ProComm, Remedy, Scribus, TRAC, Virtualbox, VMware vShpere 5, WSUS, Xilinx Web Kit \n \nOperating Systems: Android, Linux Servers (Debian, Fedora, openSUSE, Ubuntu), Windows 8, Windows 7, Vista, XP Pro, Server 2008, Server 2003, and 2000 Pro, Windows NT 4.0/3.5, Windows CE, DOS, eCos, Angstrom, IBM i5/OS AS400 \n \nCERTIFICATIONS \n \nPace Certification in Surface Mount Technology, IAW J-Standard & IPC-A-610J \nPace Certification in Advanced Thru-Hole Rework and Repair, IAW J-Standard & IPC-A-610J Summary Diagnostic Equipment: Aerial Lift, Analog Meter, BGA/QFP Rework System, Cable Locator, DAQ (NI USB-6289), DediProg SF600, Digital Analyzer, Digital Multimeter, Flying Probe, Function Generator, Hot Air Soldering Station, Labtool Compact Programmer, Mechanical/Fusion Fiber Splicing Equipment, PACE PRC-2000 Soldering Workstation, RF Signal Analyzer, Signature Analyzer, Oscilloscopes, TTL Logic Probe, UV Eraser, Frequency Counter \n \nSoftware: Active Directory, Altium Viewer, AutoCAD, Backup Exec 2010 and 2012, Cadence Allegro Physical Viewer, Code Composer Studio, CMS 5.x, Electronic Workbench, GPO, Hyper-Terminal, Labelview 8.6 and 10, Mentor Pads Flow, McAfee EPO 4.5, MRO Maximo, MS Office, NI LabVIEW 2010, OpenOffice, Phone Flash Tool, ProComm, Remedy, Scribus, TRAC, Virtualbox, VMware vShpere 5, WSUS, Xilinx Web Kit \n \nOperating Systems: Android, Linux Servers (Debian, Fedora, openSUSE, Ubuntu), Windows 8, Windows 7, Vista, XP Pro, Server 2008, Server 2003, and 2000 Pro, Windows NT 4.0/3.5, Windows CE, DOS, eCos, Angstrom, IBM i5/OS AS400 \n \nCERTIFICATIONS \n \nPace Certification in Surface Mount Technology, IAW J-Standard & IPC-A-610J \nPace Certification in Advanced Thru-Hole Rework and Repair, IAW J-Standard & IPC-A-610J Diagnostic Equipment: Aerial Lift, Analog Meter, BGA/QFP Rework System, Cable Locator, DAQ (NI USB-6289), DediProg SF600, Digital Analyzer, Digital Multimeter, Flying Probe, Function Generator, Hot Air Soldering Station, Labtool Compact Programmer, Mechanical/Fusion Fiber Splicing Equipment, PACE PRC-2000 Soldering Workstation, RF Signal Analyzer, Signature Analyzer, Oscilloscopes, TTL Logic Probe, UV Eraser, Frequency Counter \n \nSoftware: Active Directory, Altium Viewer, AutoCAD, Backup Exec 2010 and 2012, Cadence Allegro Physical Viewer, Code Composer Studio, CMS 5.x, Electronic Workbench, GPO, Hyper-Terminal, Labelview 8.6 and 10, Mentor Pads Flow, McAfee EPO 4.5, MRO Maximo, MS Office, NI LabVIEW 2010, OpenOffice, Phone Flash Tool, ProComm, Remedy, Scribus, TRAC, Virtualbox, VMware vShpere 5, WSUS, Xilinx Web Kit \n \nOperating Systems: Android, Linux Servers (Debian, Fedora, openSUSE, Ubuntu), Windows 8, Windows 7, Vista, XP Pro, Server 2008, Server 2003, and 2000 Pro, Windows NT 4.0/3.5, Windows CE, DOS, eCos, Angstrom, IBM i5/OS AS400 \n \nCERTIFICATIONS \n \nPace Certification in Surface Mount Technology, IAW J-Standard & IPC-A-610J \nPace Certification in Advanced Thru-Hole Rework and Repair, IAW J-Standard & IPC-A-610J Diagnostic Equipment: Aerial Lift, Analog Meter, BGA/QFP Rework System, Cable Locator, DAQ (NI USB-6289), DediProg SF600, Digital Analyzer, Digital Multimeter, Flying Probe, Function Generator, Hot Air Soldering Station, Labtool Compact Programmer, Mechanical/Fusion Fiber Splicing Equipment, PACE PRC-2000 Soldering Workstation, RF Signal Analyzer, Signature Analyzer, Oscilloscopes, TTL Logic Probe, UV Eraser, Frequency Counter \n \nSoftware: Active Directory, Altium Viewer, AutoCAD, Backup Exec 2010 and 2012, Cadence Allegro Physical Viewer, Code Composer Studio, CMS 5.x, Electronic Workbench, GPO, Hyper-Terminal, Labelview 8.6 and 10, Mentor Pads Flow, McAfee EPO 4.5, MRO Maximo, MS Office, NI LabVIEW 2010, OpenOffice, Phone Flash Tool, ProComm, Remedy, Scribus, TRAC, Virtualbox, VMware vShpere 5, WSUS, Xilinx Web Kit \n \nOperating Systems: Android, Linux Servers (Debian, Fedora, openSUSE, Ubuntu), Windows 8, Windows 7, Vista, XP Pro, Server 2008, Server 2003, and 2000 Pro, Windows NT 4.0/3.5, Windows CE, DOS, eCos, Angstrom, IBM i5/OS AS400 \n \nCERTIFICATIONS \n \nPace Certification in Surface Mount Technology, IAW J-Standard & IPC-A-610J \nPace Certification in Advanced Thru-Hole Rework and Repair, IAW J-Standard & IPC-A-610J Experience IT Manager Kutta Technologies, Inc. November 2013  – Present (1 year 10 months) Phoenix, Arizona Area Electronics Engineering Technician (Contractor) Intel Corporation August 2013  –  November 2013  (4 months) Chandler, AZ Work with Intel’s Early Device and Power Lab Application Engineers on leading-edge technologies for PCs, phones, and tablets. Interface with: Driver, OS, and System Software power and performance labs. Create and replicate BKC (best known configuration) for installation of drivers, early operating systems, and firmware on alpha phase devices. Perform Linux-based OS installation, rooting, and Linux software build processes. File bug reports against issues discovered during early device checkout. Responsible for board bring-up from firmware level to OS, reworks (ECNs), troubleshooting, instrumentation of devices for analysis, and power and performance analysis workloads. IT Manager Martinrea International June 2012  –  July 2013  (1 year 2 months) Columbia, TN As the Internet Technologies Manager, it is my responsibility to maintain, troubleshoot, and support servers, desktops, laptops, phone systems, and software applications in a production environment consisting of approximately 50 end users. Oversee hardware and software deployment. Assure the disaster recovery of information systems and implement internal controls to ensure compliance with Bill 198 \\ SOX and JIT standards. \n \nRecommend improvements in network systems. Plan, schedule, and purchase required resources for timely and efficient upgrades of all IT infrastructure. Liaison with outside consultants, vendors, and service providers. Develop action plans and maintain procedural documentation to meet corporate IT standards. Prepare daily activity reports for departmental meetings by collecting, analyzing, and summarizing data pertinent to IT system integrity. IT Analyst Martinrea International August 2011  –  June 2012  (11 months) Columbia, TN Electronics Engineering Technician / System Administrator Grip Innovations June 2007  –  August 2011  (4 years 3 months) Glendale, AZ Responsible for network administration of Apache, FTP, MySQL, Samba, SSH, Subversion, TRAC, and VPN servers, ensuring uptime and network security. Coordinate with software and hardware teams to implement collaborative web-based tools. Analyze systems to ensure network availability and performance objectives are being met. Develop documentation for system specifications and operating instructions. Assist engineers in the development, testing, manufacturing, and design verification of prototype electronics. Provide technical assistance when engineering problems are encountered. Electronics Engineering Technician Kutta Technologies, Inc. July 2007  –  April 2011  (3 years 10 months) Phoenix, AZ Provide research and development groups with technical assistance during all phases of development (design, build, debug, and testing). Fabricate electronic system prototypes with size and portability constraints, meeting engineers' design specifications. Repair or modify electronic prototypes, assemblies, and systems to correct functional deviations. Test prototype equipment to evaluate performance of developmental parts, assemblies, or systems under simulated operating conditions, recording results. Prepare project BoMs, determining cost and work-time estimates. Conduct inspections for quality control, reporting findings and recommendations. Review electronic schematics, assembly drawings, and make necessary revisions to engineering change notifications (ECN). Electronics Engineering Technician Safeway September 2005  –  February 2008  (2 years 6 months) Tempe, AZ Perform extensive hardware evaluations for global deployment. Collaborate to support 142 hardware devices including routers, switches, and access points. Build vendor relations, as primary contact with corporations such as Motorola and Cisco. Implement research and development with prototype units, assessing device for marketability and serviceability improvements. Enhance organizational efficiency through training in various technical roles. Create documentation for equipment installation, upgrades, troubleshooting and repair. Diagnose and rework devices to component level without schematics, including TTL/CMOS microprocessors. Provide detailed failure tracking and trend analysis to determine design deficiencies and direct next generation hardware. Technical Support Specialist 2Wire 2005  –  2005  (less than a year) IT Manager Kutta Technologies, Inc. November 2013  – Present (1 year 10 months) Phoenix, Arizona Area IT Manager Kutta Technologies, Inc. November 2013  – Present (1 year 10 months) Phoenix, Arizona Area Electronics Engineering Technician (Contractor) Intel Corporation August 2013  –  November 2013  (4 months) Chandler, AZ Work with Intel’s Early Device and Power Lab Application Engineers on leading-edge technologies for PCs, phones, and tablets. Interface with: Driver, OS, and System Software power and performance labs. Create and replicate BKC (best known configuration) for installation of drivers, early operating systems, and firmware on alpha phase devices. Perform Linux-based OS installation, rooting, and Linux software build processes. File bug reports against issues discovered during early device checkout. Responsible for board bring-up from firmware level to OS, reworks (ECNs), troubleshooting, instrumentation of devices for analysis, and power and performance analysis workloads. Electronics Engineering Technician (Contractor) Intel Corporation August 2013  –  November 2013  (4 months) Chandler, AZ Work with Intel’s Early Device and Power Lab Application Engineers on leading-edge technologies for PCs, phones, and tablets. Interface with: Driver, OS, and System Software power and performance labs. Create and replicate BKC (best known configuration) for installation of drivers, early operating systems, and firmware on alpha phase devices. Perform Linux-based OS installation, rooting, and Linux software build processes. File bug reports against issues discovered during early device checkout. Responsible for board bring-up from firmware level to OS, reworks (ECNs), troubleshooting, instrumentation of devices for analysis, and power and performance analysis workloads. IT Manager Martinrea International June 2012  –  July 2013  (1 year 2 months) Columbia, TN As the Internet Technologies Manager, it is my responsibility to maintain, troubleshoot, and support servers, desktops, laptops, phone systems, and software applications in a production environment consisting of approximately 50 end users. Oversee hardware and software deployment. Assure the disaster recovery of information systems and implement internal controls to ensure compliance with Bill 198 \\ SOX and JIT standards. \n \nRecommend improvements in network systems. Plan, schedule, and purchase required resources for timely and efficient upgrades of all IT infrastructure. Liaison with outside consultants, vendors, and service providers. Develop action plans and maintain procedural documentation to meet corporate IT standards. Prepare daily activity reports for departmental meetings by collecting, analyzing, and summarizing data pertinent to IT system integrity. IT Manager Martinrea International June 2012  –  July 2013  (1 year 2 months) Columbia, TN As the Internet Technologies Manager, it is my responsibility to maintain, troubleshoot, and support servers, desktops, laptops, phone systems, and software applications in a production environment consisting of approximately 50 end users. Oversee hardware and software deployment. Assure the disaster recovery of information systems and implement internal controls to ensure compliance with Bill 198 \\ SOX and JIT standards. \n \nRecommend improvements in network systems. Plan, schedule, and purchase required resources for timely and efficient upgrades of all IT infrastructure. Liaison with outside consultants, vendors, and service providers. Develop action plans and maintain procedural documentation to meet corporate IT standards. Prepare daily activity reports for departmental meetings by collecting, analyzing, and summarizing data pertinent to IT system integrity. IT Analyst Martinrea International August 2011  –  June 2012  (11 months) Columbia, TN IT Analyst Martinrea International August 2011  –  June 2012  (11 months) Columbia, TN Electronics Engineering Technician / System Administrator Grip Innovations June 2007  –  August 2011  (4 years 3 months) Glendale, AZ Responsible for network administration of Apache, FTP, MySQL, Samba, SSH, Subversion, TRAC, and VPN servers, ensuring uptime and network security. Coordinate with software and hardware teams to implement collaborative web-based tools. Analyze systems to ensure network availability and performance objectives are being met. Develop documentation for system specifications and operating instructions. Assist engineers in the development, testing, manufacturing, and design verification of prototype electronics. Provide technical assistance when engineering problems are encountered. Electronics Engineering Technician / System Administrator Grip Innovations June 2007  –  August 2011  (4 years 3 months) Glendale, AZ Responsible for network administration of Apache, FTP, MySQL, Samba, SSH, Subversion, TRAC, and VPN servers, ensuring uptime and network security. Coordinate with software and hardware teams to implement collaborative web-based tools. Analyze systems to ensure network availability and performance objectives are being met. Develop documentation for system specifications and operating instructions. Assist engineers in the development, testing, manufacturing, and design verification of prototype electronics. Provide technical assistance when engineering problems are encountered. Electronics Engineering Technician Kutta Technologies, Inc. July 2007  –  April 2011  (3 years 10 months) Phoenix, AZ Provide research and development groups with technical assistance during all phases of development (design, build, debug, and testing). Fabricate electronic system prototypes with size and portability constraints, meeting engineers' design specifications. Repair or modify electronic prototypes, assemblies, and systems to correct functional deviations. Test prototype equipment to evaluate performance of developmental parts, assemblies, or systems under simulated operating conditions, recording results. Prepare project BoMs, determining cost and work-time estimates. Conduct inspections for quality control, reporting findings and recommendations. Review electronic schematics, assembly drawings, and make necessary revisions to engineering change notifications (ECN). Electronics Engineering Technician Kutta Technologies, Inc. July 2007  –  April 2011  (3 years 10 months) Phoenix, AZ Provide research and development groups with technical assistance during all phases of development (design, build, debug, and testing). Fabricate electronic system prototypes with size and portability constraints, meeting engineers' design specifications. Repair or modify electronic prototypes, assemblies, and systems to correct functional deviations. Test prototype equipment to evaluate performance of developmental parts, assemblies, or systems under simulated operating conditions, recording results. Prepare project BoMs, determining cost and work-time estimates. Conduct inspections for quality control, reporting findings and recommendations. Review electronic schematics, assembly drawings, and make necessary revisions to engineering change notifications (ECN). Electronics Engineering Technician Safeway September 2005  –  February 2008  (2 years 6 months) Tempe, AZ Perform extensive hardware evaluations for global deployment. Collaborate to support 142 hardware devices including routers, switches, and access points. Build vendor relations, as primary contact with corporations such as Motorola and Cisco. Implement research and development with prototype units, assessing device for marketability and serviceability improvements. Enhance organizational efficiency through training in various technical roles. Create documentation for equipment installation, upgrades, troubleshooting and repair. Diagnose and rework devices to component level without schematics, including TTL/CMOS microprocessors. Provide detailed failure tracking and trend analysis to determine design deficiencies and direct next generation hardware. Electronics Engineering Technician Safeway September 2005  –  February 2008  (2 years 6 months) Tempe, AZ Perform extensive hardware evaluations for global deployment. Collaborate to support 142 hardware devices including routers, switches, and access points. Build vendor relations, as primary contact with corporations such as Motorola and Cisco. Implement research and development with prototype units, assessing device for marketability and serviceability improvements. Enhance organizational efficiency through training in various technical roles. Create documentation for equipment installation, upgrades, troubleshooting and repair. Diagnose and rework devices to component level without schematics, including TTL/CMOS microprocessors. Provide detailed failure tracking and trend analysis to determine design deficiencies and direct next generation hardware. Technical Support Specialist 2Wire 2005  –  2005  (less than a year) Technical Support Specialist 2Wire 2005  –  2005  (less than a year) Skills Active Directory Servers Windows Server Windows 7 Testing Troubleshooting Electronics Computer Hardware Windows Engineering Hardware Operating Systems Product Development Linux Embedded Systems Cisco Technologies Wireless Networking Technical Support C++ Programming Network Administration Software Documentation Networking VMware Network Security Switches Disaster Recovery VPN Manufacturing Routers Integration XP TCP/IP Laptops Debugging Software Installation Group Policy Systems Engineering PCB design Security WAN Network Engineering System Administration Unix See 29+     See less Skills  Active Directory Servers Windows Server Windows 7 Testing Troubleshooting Electronics Computer Hardware Windows Engineering Hardware Operating Systems Product Development Linux Embedded Systems Cisco Technologies Wireless Networking Technical Support C++ Programming Network Administration Software Documentation Networking VMware Network Security Switches Disaster Recovery VPN Manufacturing Routers Integration XP TCP/IP Laptops Debugging Software Installation Group Policy Systems Engineering PCB design Security WAN Network Engineering System Administration Unix See 29+     See less Active Directory Servers Windows Server Windows 7 Testing Troubleshooting Electronics Computer Hardware Windows Engineering Hardware Operating Systems Product Development Linux Embedded Systems Cisco Technologies Wireless Networking Technical Support C++ Programming Network Administration Software Documentation Networking VMware Network Security Switches Disaster Recovery VPN Manufacturing Routers Integration XP TCP/IP Laptops Debugging Software Installation Group Policy Systems Engineering PCB design Security WAN Network Engineering System Administration Unix See 29+     See less Active Directory Servers Windows Server Windows 7 Testing Troubleshooting Electronics Computer Hardware Windows Engineering Hardware Operating Systems Product Development Linux Embedded Systems Cisco Technologies Wireless Networking Technical Support C++ Programming Network Administration Software Documentation Networking VMware Network Security Switches Disaster Recovery VPN Manufacturing Routers Integration XP TCP/IP Laptops Debugging Software Installation Group Policy Systems Engineering PCB design Security WAN Network Engineering System Administration Unix See 29+     See less Education JJC AAS,  Electronics Engineering Technology 2003  – 2005 Activities and Societies:  Robotics Club Administrator VMware vSphere JJC AAS,  Electronics Engineering Technology 2003  – 2005 Activities and Societies:  Robotics Club Administrator JJC AAS,  Electronics Engineering Technology 2003  – 2005 Activities and Societies:  Robotics Club Administrator JJC AAS,  Electronics Engineering Technology 2003  – 2005 Activities and Societies:  Robotics Club Administrator VMware vSphere VMware vSphere VMware vSphere "]}