{"position": "Engineering Research Associate", "company": "Stanford University", "profiles": ["Skills Physics Scientific Computing Computational Physics Nanotechnology Materials Science Nanomaterials Fortran Numerical Analysis LaTeX Thin Films Simulations Semiconductors Characterization Spectroscopy Optics AFM Science Monte Carlo Simulation Algorithms Experimentation Mathematical Modeling Mathematica Photonics Nanofabrication Solid State Physics MEMS See 11+     See less Skills  Physics Scientific Computing Computational Physics Nanotechnology Materials Science Nanomaterials Fortran Numerical Analysis LaTeX Thin Films Simulations Semiconductors Characterization Spectroscopy Optics AFM Science Monte Carlo Simulation Algorithms Experimentation Mathematical Modeling Mathematica Photonics Nanofabrication Solid State Physics MEMS See 11+     See less Physics Scientific Computing Computational Physics Nanotechnology Materials Science Nanomaterials Fortran Numerical Analysis LaTeX Thin Films Simulations Semiconductors Characterization Spectroscopy Optics AFM Science Monte Carlo Simulation Algorithms Experimentation Mathematical Modeling Mathematica Photonics Nanofabrication Solid State Physics MEMS See 11+     See less Physics Scientific Computing Computational Physics Nanotechnology Materials Science Nanomaterials Fortran Numerical Analysis LaTeX Thin Films Simulations Semiconductors Characterization Spectroscopy Optics AFM Science Monte Carlo Simulation Algorithms Experimentation Mathematical Modeling Mathematica Photonics Nanofabrication Solid State Physics MEMS See 11+     See less ", "Summary Statistical signal processing and machine learning algorithm research and development, including but not limited to speech signal processing, EEG recognition, speech recognition and speech emotion recognition. Summary Statistical signal processing and machine learning algorithm research and development, including but not limited to speech signal processing, EEG recognition, speech recognition and speech emotion recognition. Statistical signal processing and machine learning algorithm research and development, including but not limited to speech signal processing, EEG recognition, speech recognition and speech emotion recognition. Statistical signal processing and machine learning algorithm research and development, including but not limited to speech signal processing, EEG recognition, speech recognition and speech emotion recognition. Experience Engineering Research Associate Stanford University June 2011  – Present (4 years 3 months) Stanford, CA - Mechanisms of emotion processing in the brain. Build machine learning models to recognize the emotion expressed in speech using brain waves and speech signals.  \n- The isomorphic mappings between speech waves and the corresponding EEG brainwaves. Develop statistical methods of recognizing phonemes using EEG. Research Assistant as Graduate Student Stanford University September 2003  –  March 2011  (7 years 7 months) - Doctoral Dissertation Research: Recognizing phonemes and their distinctive features in the brain. \n- Enhance the computer-based language education program using speech processing \ntechnology. Develop a speech recognition baseline program and an automatic pronunciation scoring program for on-line second language courses using Hidden Markov Model. Engineering Research Associate Stanford University June 2011  – Present (4 years 3 months) Stanford, CA - Mechanisms of emotion processing in the brain. Build machine learning models to recognize the emotion expressed in speech using brain waves and speech signals.  \n- The isomorphic mappings between speech waves and the corresponding EEG brainwaves. Develop statistical methods of recognizing phonemes using EEG. Engineering Research Associate Stanford University June 2011  – Present (4 years 3 months) Stanford, CA - Mechanisms of emotion processing in the brain. Build machine learning models to recognize the emotion expressed in speech using brain waves and speech signals.  \n- The isomorphic mappings between speech waves and the corresponding EEG brainwaves. Develop statistical methods of recognizing phonemes using EEG. Research Assistant as Graduate Student Stanford University September 2003  –  March 2011  (7 years 7 months) - Doctoral Dissertation Research: Recognizing phonemes and their distinctive features in the brain. \n- Enhance the computer-based language education program using speech processing \ntechnology. Develop a speech recognition baseline program and an automatic pronunciation scoring program for on-line second language courses using Hidden Markov Model. Research Assistant as Graduate Student Stanford University September 2003  –  March 2011  (7 years 7 months) - Doctoral Dissertation Research: Recognizing phonemes and their distinctive features in the brain. \n- Enhance the computer-based language education program using speech processing \ntechnology. Develop a speech recognition baseline program and an automatic pronunciation scoring program for on-line second language courses using Hidden Markov Model. Skills Machine Learning Speech Signal Processing Electroencephalography... Speech Recognition MATLAB R C++ Skills  Machine Learning Speech Signal Processing Electroencephalography... Speech Recognition MATLAB R C++ Machine Learning Speech Signal Processing Electroencephalography... Speech Recognition MATLAB R C++ Machine Learning Speech Signal Processing Electroencephalography... Speech Recognition MATLAB R C++ Education Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2003  – 2011 Dissertation: Recognizing phonemes and their distinctive features in the brain. Tsinghua University Master's Degree,  Circuits and systems 2000  – 2003 Master's degree research: The fast computation methods of Continuous Hidden Markov Model (CHMM). Implement a CHMM-based Mandarin speech recognizer on a small-footprint digital signal processor. Tsinghua University Bachelor's Degree,  Electrical and Electronics Engineering 1996  – 2000 Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2003  – 2011 Dissertation: Recognizing phonemes and their distinctive features in the brain. Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2003  – 2011 Dissertation: Recognizing phonemes and their distinctive features in the brain. Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2003  – 2011 Dissertation: Recognizing phonemes and their distinctive features in the brain. Tsinghua University Master's Degree,  Circuits and systems 2000  – 2003 Master's degree research: The fast computation methods of Continuous Hidden Markov Model (CHMM). Implement a CHMM-based Mandarin speech recognizer on a small-footprint digital signal processor. Tsinghua University Master's Degree,  Circuits and systems 2000  – 2003 Master's degree research: The fast computation methods of Continuous Hidden Markov Model (CHMM). Implement a CHMM-based Mandarin speech recognizer on a small-footprint digital signal processor. Tsinghua University Master's Degree,  Circuits and systems 2000  – 2003 Master's degree research: The fast computation methods of Continuous Hidden Markov Model (CHMM). Implement a CHMM-based Mandarin speech recognizer on a small-footprint digital signal processor. Tsinghua University Bachelor's Degree,  Electrical and Electronics Engineering 1996  – 2000 Tsinghua University Bachelor's Degree,  Electrical and Electronics Engineering 1996  – 2000 Tsinghua University Bachelor's Degree,  Electrical and Electronics Engineering 1996  – 2000 ", "Summary I am passionate about designing new algorithms that enable real-time predictions of physical systems Summary I am passionate about designing new algorithms that enable real-time predictions of physical systems I am passionate about designing new algorithms that enable real-time predictions of physical systems I am passionate about designing new algorithms that enable real-time predictions of physical systems Experience Engineering Research Associate Stanford University September 2010  – Present (5 years) Developing new algorithms for the fast simulation of aeronautical systems Engineering Research Associate Stanford University September 2010  – Present (5 years) Developing new algorithms for the fast simulation of aeronautical systems Engineering Research Associate Stanford University September 2010  – Present (5 years) Developing new algorithms for the fast simulation of aeronautical systems Languages French Native or bilingual proficiency English Full professional proficiency Italian Native or bilingual proficiency Japanese Limited working proficiency French Native or bilingual proficiency English Full professional proficiency Italian Native or bilingual proficiency Japanese Limited working proficiency French Native or bilingual proficiency English Full professional proficiency Italian Native or bilingual proficiency Japanese Limited working proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Skills Mathematical Modeling Simulations Algorithms Numerical Analysis Matlab LaTeX Applied Mathematics Computer Science Physics Programming Finite Element Analysis Machine Learning Numerical Simulation CFD Skills  Mathematical Modeling Simulations Algorithms Numerical Analysis Matlab LaTeX Applied Mathematics Computer Science Physics Programming Finite Element Analysis Machine Learning Numerical Simulation CFD Mathematical Modeling Simulations Algorithms Numerical Analysis Matlab LaTeX Applied Mathematics Computer Science Physics Programming Finite Element Analysis Machine Learning Numerical Simulation CFD Mathematical Modeling Simulations Algorithms Numerical Analysis Matlab LaTeX Applied Mathematics Computer Science Physics Programming Finite Element Analysis Machine Learning Numerical Simulation CFD Education Stanford University Doctor of Philosophy (Ph.D.),  Aerospace , Aeronautical and Astronautical Engineering, Computational and Mathematical Engineering 2007  – 2010 Stanford University Master's degree,  Aerospace , Aeronautical and Astronautical Engineering 2005  – 2007 Kyushu University Aeronautics and Astronautics 2005  – 2005 Internship in the Aerospace Propulsion Laboratory Ecole polytechnique Ingénieur de l'Ecole Polytechnique,  Applied Mathematics and Fluids Mechanics 2002  – 2005 Activities and Societies:  JTX ,  X-Japon ,  International Fencing Challenge Lycée du Parc, Lyon Classe préparatoire Scientifique aux Grandes Ecoles,  Mathematics 2000  – 2002 Stanford University Doctor of Philosophy (Ph.D.),  Aerospace , Aeronautical and Astronautical Engineering, Computational and Mathematical Engineering 2007  – 2010 Stanford University Doctor of Philosophy (Ph.D.),  Aerospace , Aeronautical and Astronautical Engineering, Computational and Mathematical Engineering 2007  – 2010 Stanford University Doctor of Philosophy (Ph.D.),  Aerospace , Aeronautical and Astronautical Engineering, Computational and Mathematical Engineering 2007  – 2010 Stanford University Master's degree,  Aerospace , Aeronautical and Astronautical Engineering 2005  – 2007 Stanford University Master's degree,  Aerospace , Aeronautical and Astronautical Engineering 2005  – 2007 Stanford University Master's degree,  Aerospace , Aeronautical and Astronautical Engineering 2005  – 2007 Kyushu University Aeronautics and Astronautics 2005  – 2005 Internship in the Aerospace Propulsion Laboratory Kyushu University Aeronautics and Astronautics 2005  – 2005 Internship in the Aerospace Propulsion Laboratory Kyushu University Aeronautics and Astronautics 2005  – 2005 Internship in the Aerospace Propulsion Laboratory Ecole polytechnique Ingénieur de l'Ecole Polytechnique,  Applied Mathematics and Fluids Mechanics 2002  – 2005 Activities and Societies:  JTX ,  X-Japon ,  International Fencing Challenge Ecole polytechnique Ingénieur de l'Ecole Polytechnique,  Applied Mathematics and Fluids Mechanics 2002  – 2005 Activities and Societies:  JTX ,  X-Japon ,  International Fencing Challenge Ecole polytechnique Ingénieur de l'Ecole Polytechnique,  Applied Mathematics and Fluids Mechanics 2002  – 2005 Activities and Societies:  JTX ,  X-Japon ,  International Fencing Challenge Lycée du Parc, Lyon Classe préparatoire Scientifique aux Grandes Ecoles,  Mathematics 2000  – 2002 Lycée du Parc, Lyon Classe préparatoire Scientifique aux Grandes Ecoles,  Mathematics 2000  – 2002 Lycée du Parc, Lyon Classe préparatoire Scientifique aux Grandes Ecoles,  Mathematics 2000  – 2002 Honors & Awards 2010 William F. Ballhaus Prize for Outstanding Doctoral Dissertation in Aeronautics Stanford University June 2010 Best Instructor Award, AHPCRC Undergraduate Summer Institute in Computational Science and Engineering, Stanford University August 2010 Alston S. Householder Best Poster Award Householder Symposium June 2011 Alston S. Householder Prize Finalist for Best Dissertation in Numerical Linear Algebra Householder Symposium June 2011 2010 William F. Ballhaus Prize for Outstanding Doctoral Dissertation in Aeronautics Stanford University June 2010 2010 William F. Ballhaus Prize for Outstanding Doctoral Dissertation in Aeronautics Stanford University June 2010 2010 William F. Ballhaus Prize for Outstanding Doctoral Dissertation in Aeronautics Stanford University June 2010 Best Instructor Award, AHPCRC Undergraduate Summer Institute in Computational Science and Engineering, Stanford University August 2010 Best Instructor Award, AHPCRC Undergraduate Summer Institute in Computational Science and Engineering, Stanford University August 2010 Best Instructor Award, AHPCRC Undergraduate Summer Institute in Computational Science and Engineering, Stanford University August 2010 Alston S. Householder Best Poster Award Householder Symposium June 2011 Alston S. Householder Best Poster Award Householder Symposium June 2011 Alston S. Householder Best Poster Award Householder Symposium June 2011 Alston S. Householder Prize Finalist for Best Dissertation in Numerical Linear Algebra Householder Symposium June 2011 Alston S. Householder Prize Finalist for Best Dissertation in Numerical Linear Algebra Householder Symposium June 2011 Alston S. Householder Prize Finalist for Best Dissertation in Numerical Linear Algebra Householder Symposium June 2011 ", "Skills Biomechanics Matlab Biomedical Engineering Research Labview Programming Java C Image Processing Computer Vision Engineering Data Analysis Microsoft Office R&D Program Management Technical Writing Signal Processing Statistics Simulations LabVIEW See 5+     See less Skills  Biomechanics Matlab Biomedical Engineering Research Labview Programming Java C Image Processing Computer Vision Engineering Data Analysis Microsoft Office R&D Program Management Technical Writing Signal Processing Statistics Simulations LabVIEW See 5+     See less Biomechanics Matlab Biomedical Engineering Research Labview Programming Java C Image Processing Computer Vision Engineering Data Analysis Microsoft Office R&D Program Management Technical Writing Signal Processing Statistics Simulations LabVIEW See 5+     See less Biomechanics Matlab Biomedical Engineering Research Labview Programming Java C Image Processing Computer Vision Engineering Data Analysis Microsoft Office R&D Program Management Technical Writing Signal Processing Statistics Simulations LabVIEW See 5+     See less ", "Experience Senior Engineering Research Associate Stanford University February 2014  – Present (1 year 7 months) Stanford, California, USA Engineering Research Associate Stanford University 2010  –  2014  (4 years) Stanford, Calfifornia,USA Senior Research Engineer Neurobehavioral Research Inc. October 2008  –  July 2010  (1 year 10 months) Honolulu, Hawaii,USA Research Associate/ Doctoral Student/ Post-Doc University of Oxford October 2004  –  September 2008  (4 years) Oxford, United Kingdom Senior Engineering Research Associate Stanford University February 2014  – Present (1 year 7 months) Stanford, California, USA Senior Engineering Research Associate Stanford University February 2014  – Present (1 year 7 months) Stanford, California, USA Engineering Research Associate Stanford University 2010  –  2014  (4 years) Stanford, Calfifornia,USA Engineering Research Associate Stanford University 2010  –  2014  (4 years) Stanford, Calfifornia,USA Senior Research Engineer Neurobehavioral Research Inc. October 2008  –  July 2010  (1 year 10 months) Honolulu, Hawaii,USA Senior Research Engineer Neurobehavioral Research Inc. October 2008  –  July 2010  (1 year 10 months) Honolulu, Hawaii,USA Research Associate/ Doctoral Student/ Post-Doc University of Oxford October 2004  –  September 2008  (4 years) Oxford, United Kingdom Research Associate/ Doctoral Student/ Post-Doc University of Oxford October 2004  –  September 2008  (4 years) Oxford, United Kingdom Skills Machine Learning Algorithms Neuroscience Matlab C++ C Research Statistics Data Analysis Teaching Science LaTeX OpenGL Linear Algebra Skills  Machine Learning Algorithms Neuroscience Matlab C++ C Research Statistics Data Analysis Teaching Science LaTeX OpenGL Linear Algebra Machine Learning Algorithms Neuroscience Matlab C++ C Research Statistics Data Analysis Teaching Science LaTeX OpenGL Linear Algebra Machine Learning Algorithms Neuroscience Matlab C++ C Research Statistics Data Analysis Teaching Science LaTeX OpenGL Linear Algebra ", "Experience Science & Engineering Research Associate Stanford University April 2006  – Present (9 years 5 months) Manager of the Environmental Measurements 1 Facility (EM1) at Stanford University. EM1 provides quantitative analysis and technical expertise to members of the Stanford community needing to conduct soil, gas, and water measurements. Lab Manager Stanford University October 2000  – Present (14 years 11 months) Manage laboratory operations for Dr. Pamela Matson, School of Earth Sciences, Stanford University. Science & Engineering Research Associate Stanford University April 2006  – Present (9 years 5 months) Manager of the Environmental Measurements 1 Facility (EM1) at Stanford University. EM1 provides quantitative analysis and technical expertise to members of the Stanford community needing to conduct soil, gas, and water measurements. Science & Engineering Research Associate Stanford University April 2006  – Present (9 years 5 months) Manager of the Environmental Measurements 1 Facility (EM1) at Stanford University. EM1 provides quantitative analysis and technical expertise to members of the Stanford community needing to conduct soil, gas, and water measurements. Lab Manager Stanford University October 2000  – Present (14 years 11 months) Manage laboratory operations for Dr. Pamela Matson, School of Earth Sciences, Stanford University. Lab Manager Stanford University October 2000  – Present (14 years 11 months) Manage laboratory operations for Dr. Pamela Matson, School of Earth Sciences, Stanford University. Skills Environmental Awareness Statistics Science Data Analysis Water Research Management Ecology Biomedical Engineering Environmental Science Climate Change Grant Writing Lifesciences Skills  Environmental Awareness Statistics Science Data Analysis Water Research Management Ecology Biomedical Engineering Environmental Science Climate Change Grant Writing Lifesciences Environmental Awareness Statistics Science Data Analysis Water Research Management Ecology Biomedical Engineering Environmental Science Climate Change Grant Writing Lifesciences Environmental Awareness Statistics Science Data Analysis Water Research Management Ecology Biomedical Engineering Environmental Science Climate Change Grant Writing Lifesciences Education Stanford University 1994  – 1998 Stanford University 1994  – 1998 Stanford University 1994  – 1998 Stanford University 1994  – 1998 ", "Skills Nanophotonics Plasmonics Nanoscale Apertures Metallic Waveguide... Metamaterials Metamaterials -... Metamaterials - Large... CMOS Sensors Image Sensors Pixel Optics Optics Matlab Physics Signal Processing Nanotechnology Numerical... Simulations Image Processing See 4+     See less Skills  Nanophotonics Plasmonics Nanoscale Apertures Metallic Waveguide... Metamaterials Metamaterials -... Metamaterials - Large... CMOS Sensors Image Sensors Pixel Optics Optics Matlab Physics Signal Processing Nanotechnology Numerical... Simulations Image Processing See 4+     See less Nanophotonics Plasmonics Nanoscale Apertures Metallic Waveguide... Metamaterials Metamaterials -... Metamaterials - Large... CMOS Sensors Image Sensors Pixel Optics Optics Matlab Physics Signal Processing Nanotechnology Numerical... Simulations Image Processing See 4+     See less Nanophotonics Plasmonics Nanoscale Apertures Metallic Waveguide... Metamaterials Metamaterials -... Metamaterials - Large... CMOS Sensors Image Sensors Pixel Optics Optics Matlab Physics Signal Processing Nanotechnology Numerical... Simulations Image Processing See 4+     See less ", "Languages Hebrew Hebrew Hebrew Skills MRI Medical Imaging Electrical Engineering Signal Processing Computer Science Image Processing Matlab Algorithms Machine Learning Biomedical Engineering Physics LaTeX Mathematical Modeling Simulations Computer Vision Pattern Recognition Science Image Analysis See 3+     See less Skills  MRI Medical Imaging Electrical Engineering Signal Processing Computer Science Image Processing Matlab Algorithms Machine Learning Biomedical Engineering Physics LaTeX Mathematical Modeling Simulations Computer Vision Pattern Recognition Science Image Analysis See 3+     See less MRI Medical Imaging Electrical Engineering Signal Processing Computer Science Image Processing Matlab Algorithms Machine Learning Biomedical Engineering Physics LaTeX Mathematical Modeling Simulations Computer Vision Pattern Recognition Science Image Analysis See 3+     See less MRI Medical Imaging Electrical Engineering Signal Processing Computer Science Image Processing Matlab Algorithms Machine Learning Biomedical Engineering Physics LaTeX Mathematical Modeling Simulations Computer Vision Pattern Recognition Science Image Analysis See 3+     See less Honors & Awards ", "Summary Keen interest of technology and gadgets, started writing code at early age. Joined a startup for the first web boom-bust cycle (Alibaba competitor). Moved on to part-time code consulting and studies in Informatics and Systems Design. Went on an exchange to UC San Diego and studied Cognitive Science and Human-Computer Interaction. Returned to Sweden to do a Masters in the same. Focused on using eye tracking to control computers. Led to a PhD program at the ITU Copenhagen where I developed gaze-driven interfaces and concepts such as eye controlled robots. Took up an offer from Stanford University to work with eye tracking in Radiology. Developed a custom research platform and decided to stay on as Research Associate. Relocated with the job to Duke University. Stayed in touch with the fellow eye tracking experts in Copenhagen and continued co-developing the ITU Gaze Tracker. Returned to Copenhagen to start a company called The Eye Tribe. Summary Keen interest of technology and gadgets, started writing code at early age. Joined a startup for the first web boom-bust cycle (Alibaba competitor). Moved on to part-time code consulting and studies in Informatics and Systems Design. Went on an exchange to UC San Diego and studied Cognitive Science and Human-Computer Interaction. Returned to Sweden to do a Masters in the same. Focused on using eye tracking to control computers. Led to a PhD program at the ITU Copenhagen where I developed gaze-driven interfaces and concepts such as eye controlled robots. Took up an offer from Stanford University to work with eye tracking in Radiology. Developed a custom research platform and decided to stay on as Research Associate. Relocated with the job to Duke University. Stayed in touch with the fellow eye tracking experts in Copenhagen and continued co-developing the ITU Gaze Tracker. Returned to Copenhagen to start a company called The Eye Tribe. Keen interest of technology and gadgets, started writing code at early age. Joined a startup for the first web boom-bust cycle (Alibaba competitor). Moved on to part-time code consulting and studies in Informatics and Systems Design. Went on an exchange to UC San Diego and studied Cognitive Science and Human-Computer Interaction. Returned to Sweden to do a Masters in the same. Focused on using eye tracking to control computers. Led to a PhD program at the ITU Copenhagen where I developed gaze-driven interfaces and concepts such as eye controlled robots. Took up an offer from Stanford University to work with eye tracking in Radiology. Developed a custom research platform and decided to stay on as Research Associate. Relocated with the job to Duke University. Stayed in touch with the fellow eye tracking experts in Copenhagen and continued co-developing the ITU Gaze Tracker. Returned to Copenhagen to start a company called The Eye Tribe. Keen interest of technology and gadgets, started writing code at early age. Joined a startup for the first web boom-bust cycle (Alibaba competitor). Moved on to part-time code consulting and studies in Informatics and Systems Design. Went on an exchange to UC San Diego and studied Cognitive Science and Human-Computer Interaction. Returned to Sweden to do a Masters in the same. Focused on using eye tracking to control computers. Led to a PhD program at the ITU Copenhagen where I developed gaze-driven interfaces and concepts such as eye controlled robots. Took up an offer from Stanford University to work with eye tracking in Radiology. Developed a custom research platform and decided to stay on as Research Associate. Relocated with the job to Duke University. Stayed in touch with the fellow eye tracking experts in Copenhagen and continued co-developing the ITU Gaze Tracker. Returned to Copenhagen to start a company called The Eye Tribe. Experience Sn. Software Engineer / Researcher Duke University March 2011  –  September 2011  (7 months) Durham, North Carolina, USA Research on the perceptual capabilities of Radiologists searching medical image datasets for cancer lesions, more specifically lung nodules in chest CT. Research carried out at the Department of Radiology at the C.R Advanced Imaging Laboratories. Development of research specific platform supporting high speed eye trackers and massive CT volumes with participant management and analysis tools. Engineering Research Associate Stanford University May 2009  –  April 2011  (2 years) Palo Alto, California Part of an international multidisciplinary research group investigating how medical doctors navigate and evaluate large volumetric datasets created by imaging modalities such as CT-scanners. Focus on development of methodology and technical platform for gaze data acquisition, analysis and visualizations. Systems Manager Campeon September 2003  –  August 2006  (3 years) Sweden Systems manager with responsibility for installing, maintaining, upgrading the infrastructure w/ multiple Linux servers and ~120 Windows clients. Development of a tailormade web application for keeping track of students, courses and grades. Exporting data to the Swedish national grade database and generating individual PDF's for archive and printing grades. (LAMP).  \n \nTech: Suse Linux 9.1, Samba, Squid proxy, Apache, SSL, mySQL, openLDAP, Zyxel Zywall 70 (firewall), Sendmail, HP Procurve gigabit switches, Dell/Compaq servers. Lacie NAS, Windows XP, OpenOffice. \n \nPerforming security audits, automated backups etc Software Developer Foxguard.se June 2005  –  May 2006  (1 year) Analyzing and implementing a web based solution supporting a large number of resellers across Sweden. Developing specific software for enhancing the business process both from the resellers and internal perspective.  \n \nTechnologies; \nApache, MySQL Database, PHP, Customized Microsoft Excel data export Software Developer Aupaircenter.com September 2002  –  December 2002  (4 months) Developing website for aupair and host-family matchmaking and backend management. 3 month project. Platform: LAMP Software Developer Business Opportunities Network (Boppnet.com) January 2000  –  May 2002  (2 years 5 months) Enterprise scale B2B web application used to establish connections between suppliers and purchasers on an global scale. Showcase of products, matchmaking, automatic search agents, integration of logicstics with Danza. Payment solution for creditcards (DebiTech) and custom made invoice tracking. \n \nDirect competitor to Alibaba.com and very similar in concept..  \n \nTechnical: Oracle 8i DB / Application Server + PL/SQL application logic, clustering of servers (TurboLinux), image handling w/ ImageMagick. RedHat Linux. Perl and shell scripting. Sn. Software Engineer / Researcher Duke University March 2011  –  September 2011  (7 months) Durham, North Carolina, USA Research on the perceptual capabilities of Radiologists searching medical image datasets for cancer lesions, more specifically lung nodules in chest CT. Research carried out at the Department of Radiology at the C.R Advanced Imaging Laboratories. Development of research specific platform supporting high speed eye trackers and massive CT volumes with participant management and analysis tools. Sn. Software Engineer / Researcher Duke University March 2011  –  September 2011  (7 months) Durham, North Carolina, USA Research on the perceptual capabilities of Radiologists searching medical image datasets for cancer lesions, more specifically lung nodules in chest CT. Research carried out at the Department of Radiology at the C.R Advanced Imaging Laboratories. Development of research specific platform supporting high speed eye trackers and massive CT volumes with participant management and analysis tools. Engineering Research Associate Stanford University May 2009  –  April 2011  (2 years) Palo Alto, California Part of an international multidisciplinary research group investigating how medical doctors navigate and evaluate large volumetric datasets created by imaging modalities such as CT-scanners. Focus on development of methodology and technical platform for gaze data acquisition, analysis and visualizations. Engineering Research Associate Stanford University May 2009  –  April 2011  (2 years) Palo Alto, California Part of an international multidisciplinary research group investigating how medical doctors navigate and evaluate large volumetric datasets created by imaging modalities such as CT-scanners. Focus on development of methodology and technical platform for gaze data acquisition, analysis and visualizations. Systems Manager Campeon September 2003  –  August 2006  (3 years) Sweden Systems manager with responsibility for installing, maintaining, upgrading the infrastructure w/ multiple Linux servers and ~120 Windows clients. Development of a tailormade web application for keeping track of students, courses and grades. Exporting data to the Swedish national grade database and generating individual PDF's for archive and printing grades. (LAMP).  \n \nTech: Suse Linux 9.1, Samba, Squid proxy, Apache, SSL, mySQL, openLDAP, Zyxel Zywall 70 (firewall), Sendmail, HP Procurve gigabit switches, Dell/Compaq servers. Lacie NAS, Windows XP, OpenOffice. \n \nPerforming security audits, automated backups etc Systems Manager Campeon September 2003  –  August 2006  (3 years) Sweden Systems manager with responsibility for installing, maintaining, upgrading the infrastructure w/ multiple Linux servers and ~120 Windows clients. Development of a tailormade web application for keeping track of students, courses and grades. Exporting data to the Swedish national grade database and generating individual PDF's for archive and printing grades. (LAMP).  \n \nTech: Suse Linux 9.1, Samba, Squid proxy, Apache, SSL, mySQL, openLDAP, Zyxel Zywall 70 (firewall), Sendmail, HP Procurve gigabit switches, Dell/Compaq servers. Lacie NAS, Windows XP, OpenOffice. \n \nPerforming security audits, automated backups etc Software Developer Foxguard.se June 2005  –  May 2006  (1 year) Analyzing and implementing a web based solution supporting a large number of resellers across Sweden. Developing specific software for enhancing the business process both from the resellers and internal perspective.  \n \nTechnologies; \nApache, MySQL Database, PHP, Customized Microsoft Excel data export Software Developer Foxguard.se June 2005  –  May 2006  (1 year) Analyzing and implementing a web based solution supporting a large number of resellers across Sweden. Developing specific software for enhancing the business process both from the resellers and internal perspective.  \n \nTechnologies; \nApache, MySQL Database, PHP, Customized Microsoft Excel data export Software Developer Aupaircenter.com September 2002  –  December 2002  (4 months) Developing website for aupair and host-family matchmaking and backend management. 3 month project. Platform: LAMP Software Developer Aupaircenter.com September 2002  –  December 2002  (4 months) Developing website for aupair and host-family matchmaking and backend management. 3 month project. Platform: LAMP Software Developer Business Opportunities Network (Boppnet.com) January 2000  –  May 2002  (2 years 5 months) Enterprise scale B2B web application used to establish connections between suppliers and purchasers on an global scale. Showcase of products, matchmaking, automatic search agents, integration of logicstics with Danza. Payment solution for creditcards (DebiTech) and custom made invoice tracking. \n \nDirect competitor to Alibaba.com and very similar in concept..  \n \nTechnical: Oracle 8i DB / Application Server + PL/SQL application logic, clustering of servers (TurboLinux), image handling w/ ImageMagick. RedHat Linux. Perl and shell scripting. Software Developer Business Opportunities Network (Boppnet.com) January 2000  –  May 2002  (2 years 5 months) Enterprise scale B2B web application used to establish connections between suppliers and purchasers on an global scale. Showcase of products, matchmaking, automatic search agents, integration of logicstics with Danza. Payment solution for creditcards (DebiTech) and custom made invoice tracking. \n \nDirect competitor to Alibaba.com and very similar in concept..  \n \nTechnical: Oracle 8i DB / Application Server + PL/SQL application logic, clustering of servers (TurboLinux), image handling w/ ImageMagick. RedHat Linux. Perl and shell scripting. Skills Eye Tracking Software Development User Interface Design Human-computer... Research Image Processing Human Computer... Computer Vision User Experience PHP MySQL Java User Interface Web Applications SQL Apache Programming Project Management Web Development See 4+     See less Skills  Eye Tracking Software Development User Interface Design Human-computer... Research Image Processing Human Computer... Computer Vision User Experience PHP MySQL Java User Interface Web Applications SQL Apache Programming Project Management Web Development See 4+     See less Eye Tracking Software Development User Interface Design Human-computer... Research Image Processing Human Computer... Computer Vision User Experience PHP MySQL Java User Interface Web Applications SQL Apache Programming Project Management Web Development See 4+     See less Eye Tracking Software Development User Interface Design Human-computer... Research Image Processing Human Computer... Computer Vision User Experience PHP MySQL Java User Interface Web Applications SQL Apache Programming Project Management Web Development See 4+     See less Education IT-Universitetet i København Doctor of Philosophy (PhD),  Eye tracking and gaze interaction , Dropout. 2008  – 2009 R&D gaze interaction interfaces using eye trackers. Multi-modality. Assistive technology, human-factors, cognitive engineering. Discontinued due to job offer from Stanford. Lund University M.Sc,  Cognitive Science 2007  – 2008 Specialization in cognitive neuroscience and eye tracking. Thesis on gaze interaction interface components (google Neovisus) University of California, San Diego 1yr Specialization,  Cognitive Engineering, Enterprise Webapps - J2EE, Human Computer Interaction, Cognitive Neuroscience 2006  – 2007 Selected for EAP exchange program to University of California by Lund University. Studies focus on Human Computer Interaction, Enterprise Web Applications (J2EE) Additional classes include Cognitive Engineering and Cognitive Neurobiology/Neuroscience. Activities and Societies:  Teaching Assistant for Cognitive Science 11 ,  Minds and Brains ,  teaching a section of 35 students ,  lecturing ,  grading etc. Lund University Ba,  Informatics ,  System Analysis and Design 2004  – 2006 Strong focus on strategic management, business analysis, process analysis and design, and change management. Techniques used include ER+UML modeling, distributed systems & networking. Programming in Java using JSP/Servlets/Java Server Faces/Struts etc.against RDMS / SQL databases. Human Computer Interaction. Semcon Education Software Development 1999  – 2000 One year coding in C, C++ and Java combined with classes in Technical English and Project management. Swedish National Army Corporal,  IT/IS 9000 Advance field com.sys / Leadership psychology 1997  – 1998 Served as Corporal with a five men unit specialized in add-hoc field communications (IT/IS 9000). Training on Alcatel Fiberopics, Ericsson radiolink switches, SCO Unix and Win NT servers, dedicated encryption hardware, leadership/group psychology. IT-Universitetet i København Doctor of Philosophy (PhD),  Eye tracking and gaze interaction , Dropout. 2008  – 2009 R&D gaze interaction interfaces using eye trackers. Multi-modality. Assistive technology, human-factors, cognitive engineering. Discontinued due to job offer from Stanford. IT-Universitetet i København Doctor of Philosophy (PhD),  Eye tracking and gaze interaction , Dropout. 2008  – 2009 R&D gaze interaction interfaces using eye trackers. Multi-modality. Assistive technology, human-factors, cognitive engineering. Discontinued due to job offer from Stanford. IT-Universitetet i København Doctor of Philosophy (PhD),  Eye tracking and gaze interaction , Dropout. 2008  – 2009 R&D gaze interaction interfaces using eye trackers. Multi-modality. Assistive technology, human-factors, cognitive engineering. Discontinued due to job offer from Stanford. Lund University M.Sc,  Cognitive Science 2007  – 2008 Specialization in cognitive neuroscience and eye tracking. Thesis on gaze interaction interface components (google Neovisus) Lund University M.Sc,  Cognitive Science 2007  – 2008 Specialization in cognitive neuroscience and eye tracking. Thesis on gaze interaction interface components (google Neovisus) Lund University M.Sc,  Cognitive Science 2007  – 2008 Specialization in cognitive neuroscience and eye tracking. Thesis on gaze interaction interface components (google Neovisus) University of California, San Diego 1yr Specialization,  Cognitive Engineering, Enterprise Webapps - J2EE, Human Computer Interaction, Cognitive Neuroscience 2006  – 2007 Selected for EAP exchange program to University of California by Lund University. Studies focus on Human Computer Interaction, Enterprise Web Applications (J2EE) Additional classes include Cognitive Engineering and Cognitive Neurobiology/Neuroscience. Activities and Societies:  Teaching Assistant for Cognitive Science 11 ,  Minds and Brains ,  teaching a section of 35 students ,  lecturing ,  grading etc. University of California, San Diego 1yr Specialization,  Cognitive Engineering, Enterprise Webapps - J2EE, Human Computer Interaction, Cognitive Neuroscience 2006  – 2007 Selected for EAP exchange program to University of California by Lund University. Studies focus on Human Computer Interaction, Enterprise Web Applications (J2EE) Additional classes include Cognitive Engineering and Cognitive Neurobiology/Neuroscience. Activities and Societies:  Teaching Assistant for Cognitive Science 11 ,  Minds and Brains ,  teaching a section of 35 students ,  lecturing ,  grading etc. University of California, San Diego 1yr Specialization,  Cognitive Engineering, Enterprise Webapps - J2EE, Human Computer Interaction, Cognitive Neuroscience 2006  – 2007 Selected for EAP exchange program to University of California by Lund University. Studies focus on Human Computer Interaction, Enterprise Web Applications (J2EE) Additional classes include Cognitive Engineering and Cognitive Neurobiology/Neuroscience. Activities and Societies:  Teaching Assistant for Cognitive Science 11 ,  Minds and Brains ,  teaching a section of 35 students ,  lecturing ,  grading etc. Lund University Ba,  Informatics ,  System Analysis and Design 2004  – 2006 Strong focus on strategic management, business analysis, process analysis and design, and change management. Techniques used include ER+UML modeling, distributed systems & networking. Programming in Java using JSP/Servlets/Java Server Faces/Struts etc.against RDMS / SQL databases. Human Computer Interaction. Lund University Ba,  Informatics ,  System Analysis and Design 2004  – 2006 Strong focus on strategic management, business analysis, process analysis and design, and change management. Techniques used include ER+UML modeling, distributed systems & networking. Programming in Java using JSP/Servlets/Java Server Faces/Struts etc.against RDMS / SQL databases. Human Computer Interaction. Lund University Ba,  Informatics ,  System Analysis and Design 2004  – 2006 Strong focus on strategic management, business analysis, process analysis and design, and change management. Techniques used include ER+UML modeling, distributed systems & networking. Programming in Java using JSP/Servlets/Java Server Faces/Struts etc.against RDMS / SQL databases. Human Computer Interaction. Semcon Education Software Development 1999  – 2000 One year coding in C, C++ and Java combined with classes in Technical English and Project management. Semcon Education Software Development 1999  – 2000 One year coding in C, C++ and Java combined with classes in Technical English and Project management. Semcon Education Software Development 1999  – 2000 One year coding in C, C++ and Java combined with classes in Technical English and Project management. Swedish National Army Corporal,  IT/IS 9000 Advance field com.sys / Leadership psychology 1997  – 1998 Served as Corporal with a five men unit specialized in add-hoc field communications (IT/IS 9000). Training on Alcatel Fiberopics, Ericsson radiolink switches, SCO Unix and Win NT servers, dedicated encryption hardware, leadership/group psychology. Swedish National Army Corporal,  IT/IS 9000 Advance field com.sys / Leadership psychology 1997  – 1998 Served as Corporal with a five men unit specialized in add-hoc field communications (IT/IS 9000). Training on Alcatel Fiberopics, Ericsson radiolink switches, SCO Unix and Win NT servers, dedicated encryption hardware, leadership/group psychology. Swedish National Army Corporal,  IT/IS 9000 Advance field com.sys / Leadership psychology 1997  – 1998 Served as Corporal with a five men unit specialized in add-hoc field communications (IT/IS 9000). Training on Alcatel Fiberopics, Ericsson radiolink switches, SCO Unix and Win NT servers, dedicated encryption hardware, leadership/group psychology. ", "Experience Engineering Research Associate Stanford University 2007  – Present (8 years) Stanford, CA Expertise in X-ray imaging applied to rock and porous media , meso and nano scale.  \n \nResearch topics:  \nUnconventional resources.  \nCO2 injection for EOR.  \nWaterflooding on diatomite.  \nGas and oil shale characterization.  \nTwo-phase relative permeability measurement. Engineering Research Associate Stanford University 2007  – Present (8 years) Stanford, CA Expertise in X-ray imaging applied to rock and porous media , meso and nano scale.  \n \nResearch topics:  \nUnconventional resources.  \nCO2 injection for EOR.  \nWaterflooding on diatomite.  \nGas and oil shale characterization.  \nTwo-phase relative permeability measurement. Engineering Research Associate Stanford University 2007  – Present (8 years) Stanford, CA Expertise in X-ray imaging applied to rock and porous media , meso and nano scale.  \n \nResearch topics:  \nUnconventional resources.  \nCO2 injection for EOR.  \nWaterflooding on diatomite.  \nGas and oil shale characterization.  \nTwo-phase relative permeability measurement. Languages Spanish Native or bilingual proficiency English Full professional proficiency Italian Limited working proficiency Spanish Native or bilingual proficiency English Full professional proficiency Italian Limited working proficiency Spanish Native or bilingual proficiency English Full professional proficiency Italian Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Skills Reservoir Engineering Petroleum Engineering EOR Multiphase Flow Petroleum Fluids Chemical Engineering Energy Matlab Reservoir Management Reservoir Simulation Engineering Gas R&D Process Simulation Product Optimization See 1+     See less Skills  Reservoir Engineering Petroleum Engineering EOR Multiphase Flow Petroleum Fluids Chemical Engineering Energy Matlab Reservoir Management Reservoir Simulation Engineering Gas R&D Process Simulation Product Optimization See 1+     See less Reservoir Engineering Petroleum Engineering EOR Multiphase Flow Petroleum Fluids Chemical Engineering Energy Matlab Reservoir Management Reservoir Simulation Engineering Gas R&D Process Simulation Product Optimization See 1+     See less Reservoir Engineering Petroleum Engineering EOR Multiphase Flow Petroleum Fluids Chemical Engineering Energy Matlab Reservoir Management Reservoir Simulation Engineering Gas R&D Process Simulation Product Optimization See 1+     See less Education Stanford University MSc.,  Petroleum Engineering 1998  – 2000 Universidad Simón Bolívar BSc.,  Chemical Engineering 1990  – 1996 Activities and Societies:  Chem.Eng. USB Students Association Stanford University MSc.,  Petroleum Engineering 1998  – 2000 Stanford University MSc.,  Petroleum Engineering 1998  – 2000 Stanford University MSc.,  Petroleum Engineering 1998  – 2000 Universidad Simón Bolívar BSc.,  Chemical Engineering 1990  – 1996 Activities and Societies:  Chem.Eng. USB Students Association Universidad Simón Bolívar BSc.,  Chemical Engineering 1990  – 1996 Activities and Societies:  Chem.Eng. USB Students Association Universidad Simón Bolívar BSc.,  Chemical Engineering 1990  – 1996 Activities and Societies:  Chem.Eng. USB Students Association ", "Summary Science, Engineering, and Education Summary Science, Engineering, and Education Science, Engineering, and Education Science, Engineering, and Education Experience Visiting Assistant Professor University of Colorado Boulder May 2015  – Present (4 months) Boulder, CO Engineering Research Associate Stanford University May 2013  – Present (2 years 4 months) Department of Aeronautics and Astronautics Engineering Research Associate Stanford University May 2011  –  April 2013  (2 years) Electrical Engineering Department Program Management, Student Advising, Research, Proposal Preparation Research Scientist Boston University October 2009  –  May 2011  (1 year 8 months) Research Scientist in the Center for Space Physics. Postdoctoral Scholar Stanford University May 2009  –  October 2009  (6 months) Research Assistant Stanford University September 2002  –  May 2009  (6 years 9 months) I completed my Master's in Electrical Engineering at Stanford in May 2004, and my Ph.D in May 2009. Teaching Fellow Stanford University May 2008  –  August 2008  (4 months) Teaching Fellow for graduate-level course in Numerical Electromagnetics (EE 256) at Stanford. \nSolely responsible for all aspects of the course (lectures, homework assignments, office hours, grading, solutions). Teaching assistant Stanford University March 2005  –  August 2007  (2 years 6 months) Teaching assistant for EE 256 (Numerical Electromagnetics) at Stanford University, under Prof. Umran Inan.  \nResponsible for creating homework sets and solutions, grading homeworks, holding problem sessions, and lecturing in Prof. Inan's absence (~15 times over two quarters) Visiting Assistant Professor University of Colorado Boulder May 2015  – Present (4 months) Boulder, CO Visiting Assistant Professor University of Colorado Boulder May 2015  – Present (4 months) Boulder, CO Engineering Research Associate Stanford University May 2013  – Present (2 years 4 months) Department of Aeronautics and Astronautics Engineering Research Associate Stanford University May 2013  – Present (2 years 4 months) Department of Aeronautics and Astronautics Engineering Research Associate Stanford University May 2011  –  April 2013  (2 years) Electrical Engineering Department Program Management, Student Advising, Research, Proposal Preparation Engineering Research Associate Stanford University May 2011  –  April 2013  (2 years) Electrical Engineering Department Program Management, Student Advising, Research, Proposal Preparation Research Scientist Boston University October 2009  –  May 2011  (1 year 8 months) Research Scientist in the Center for Space Physics. Research Scientist Boston University October 2009  –  May 2011  (1 year 8 months) Research Scientist in the Center for Space Physics. Postdoctoral Scholar Stanford University May 2009  –  October 2009  (6 months) Postdoctoral Scholar Stanford University May 2009  –  October 2009  (6 months) Research Assistant Stanford University September 2002  –  May 2009  (6 years 9 months) I completed my Master's in Electrical Engineering at Stanford in May 2004, and my Ph.D in May 2009. Research Assistant Stanford University September 2002  –  May 2009  (6 years 9 months) I completed my Master's in Electrical Engineering at Stanford in May 2004, and my Ph.D in May 2009. Teaching Fellow Stanford University May 2008  –  August 2008  (4 months) Teaching Fellow for graduate-level course in Numerical Electromagnetics (EE 256) at Stanford. \nSolely responsible for all aspects of the course (lectures, homework assignments, office hours, grading, solutions). Teaching Fellow Stanford University May 2008  –  August 2008  (4 months) Teaching Fellow for graduate-level course in Numerical Electromagnetics (EE 256) at Stanford. \nSolely responsible for all aspects of the course (lectures, homework assignments, office hours, grading, solutions). Teaching assistant Stanford University March 2005  –  August 2007  (2 years 6 months) Teaching assistant for EE 256 (Numerical Electromagnetics) at Stanford University, under Prof. Umran Inan.  \nResponsible for creating homework sets and solutions, grading homeworks, holding problem sessions, and lecturing in Prof. Inan's absence (~15 times over two quarters) Teaching assistant Stanford University March 2005  –  August 2007  (2 years 6 months) Teaching assistant for EE 256 (Numerical Electromagnetics) at Stanford University, under Prof. Umran Inan.  \nResponsible for creating homework sets and solutions, grading homeworks, holding problem sessions, and lecturing in Prof. Inan's absence (~15 times over two quarters) Skills Numerical Analysis Monte Carlo Simulation Signal Processing LaTeX Optical Design Instrument Design Matlab Optics Spectroscopy Image Processing Algorithms Simulations Electromagnetics Data Analysis Physics Scientific Computing Mathematical Modeling Sensors See 3+     See less Skills  Numerical Analysis Monte Carlo Simulation Signal Processing LaTeX Optical Design Instrument Design Matlab Optics Spectroscopy Image Processing Algorithms Simulations Electromagnetics Data Analysis Physics Scientific Computing Mathematical Modeling Sensors See 3+     See less Numerical Analysis Monte Carlo Simulation Signal Processing LaTeX Optical Design Instrument Design Matlab Optics Spectroscopy Image Processing Algorithms Simulations Electromagnetics Data Analysis Physics Scientific Computing Mathematical Modeling Sensors See 3+     See less Numerical Analysis Monte Carlo Simulation Signal Processing LaTeX Optical Design Instrument Design Matlab Optics Spectroscopy Image Processing Algorithms Simulations Electromagnetics Data Analysis Physics Scientific Computing Mathematical Modeling Sensors See 3+     See less Education Stanford University Ph.D,  Electrical Engineering 2004  – 2009 Defense: October 2008; Degree Conferral: June 2009. \nDissertation Advisor: Umran S. Inan \nDissertation Title: VLF Radio Signatures of Transient Luminous Events Above Thunderstorms Stanford University, 2004 Master of Science,  Electrical Engineering 2002  – 2009 Electrical Engineering, with focus in Electromagnetics, Optics, and Plasma Physics University of Southern California Bachelor of Science,  Electrical Engineering 1998  – 2002 Electrical Engineering, with focus in Electromagnetics Stanford University Ph.D,  Electrical Engineering 2004  – 2009 Defense: October 2008; Degree Conferral: June 2009. \nDissertation Advisor: Umran S. Inan \nDissertation Title: VLF Radio Signatures of Transient Luminous Events Above Thunderstorms Stanford University Ph.D,  Electrical Engineering 2004  – 2009 Defense: October 2008; Degree Conferral: June 2009. \nDissertation Advisor: Umran S. Inan \nDissertation Title: VLF Radio Signatures of Transient Luminous Events Above Thunderstorms Stanford University Ph.D,  Electrical Engineering 2004  – 2009 Defense: October 2008; Degree Conferral: June 2009. \nDissertation Advisor: Umran S. Inan \nDissertation Title: VLF Radio Signatures of Transient Luminous Events Above Thunderstorms Stanford University, 2004 Master of Science,  Electrical Engineering 2002  – 2009 Electrical Engineering, with focus in Electromagnetics, Optics, and Plasma Physics Stanford University, 2004 Master of Science,  Electrical Engineering 2002  – 2009 Electrical Engineering, with focus in Electromagnetics, Optics, and Plasma Physics Stanford University, 2004 Master of Science,  Electrical Engineering 2002  – 2009 Electrical Engineering, with focus in Electromagnetics, Optics, and Plasma Physics University of Southern California Bachelor of Science,  Electrical Engineering 1998  – 2002 Electrical Engineering, with focus in Electromagnetics University of Southern California Bachelor of Science,  Electrical Engineering 1998  – 2002 Electrical Engineering, with focus in Electromagnetics University of Southern California Bachelor of Science,  Electrical Engineering 1998  – 2002 Electrical Engineering, with focus in Electromagnetics Honors & Awards Additional Honors & Awards Texas Instruments Stanford Graduate Fellow, 2002-2005 \nAGU Outstanding Student Paper Award, Fall Meeting 2004 \n1st Place, URSI Student Paper Competition, Ottawa, July 2007 \nAGU Outstanding Student Paper Award, Fall Meeting 2008 \nStanford Lieberman Fellow, 2008-2009 \nAndor Insight Award, 2011 Additional Honors & Awards Texas Instruments Stanford Graduate Fellow, 2002-2005 \nAGU Outstanding Student Paper Award, Fall Meeting 2004 \n1st Place, URSI Student Paper Competition, Ottawa, July 2007 \nAGU Outstanding Student Paper Award, Fall Meeting 2008 \nStanford Lieberman Fellow, 2008-2009 \nAndor Insight Award, 2011 Additional Honors & Awards Texas Instruments Stanford Graduate Fellow, 2002-2005 \nAGU Outstanding Student Paper Award, Fall Meeting 2004 \n1st Place, URSI Student Paper Competition, Ottawa, July 2007 \nAGU Outstanding Student Paper Award, Fall Meeting 2008 \nStanford Lieberman Fellow, 2008-2009 \nAndor Insight Award, 2011 Additional Honors & Awards Texas Instruments Stanford Graduate Fellow, 2002-2005 \nAGU Outstanding Student Paper Award, Fall Meeting 2004 \n1st Place, URSI Student Paper Competition, Ottawa, July 2007 \nAGU Outstanding Student Paper Award, Fall Meeting 2008 \nStanford Lieberman Fellow, 2008-2009 \nAndor Insight Award, 2011 ", "Experience Engineering Research Associate Stanford University Engineering Research Associate Stanford University Engineering Research Associate Stanford University ", "Summary I am a researcher at Imagination Lab, Adobe Research. Currently, I am developing machine learning algorithms for digital marketing products. Broadly, I am interested in applying AI techniques to intelligent applications such as personal assistant agents, intelligent tutoring, spoken dialogue systems, multimodal intefaces, conversational video games. \n \nSpecialties: Speech and Language Technologies, Machine Learning, Software Development, Network Design. Summary I am a researcher at Imagination Lab, Adobe Research. Currently, I am developing machine learning algorithms for digital marketing products. Broadly, I am interested in applying AI techniques to intelligent applications such as personal assistant agents, intelligent tutoring, spoken dialogue systems, multimodal intefaces, conversational video games. \n \nSpecialties: Speech and Language Technologies, Machine Learning, Software Development, Network Design. I am a researcher at Imagination Lab, Adobe Research. Currently, I am developing machine learning algorithms for digital marketing products. Broadly, I am interested in applying AI techniques to intelligent applications such as personal assistant agents, intelligent tutoring, spoken dialogue systems, multimodal intefaces, conversational video games. \n \nSpecialties: Speech and Language Technologies, Machine Learning, Software Development, Network Design. I am a researcher at Imagination Lab, Adobe Research. Currently, I am developing machine learning algorithms for digital marketing products. Broadly, I am interested in applying AI techniques to intelligent applications such as personal assistant agents, intelligent tutoring, spoken dialogue systems, multimodal intefaces, conversational video games. \n \nSpecialties: Speech and Language Technologies, Machine Learning, Software Development, Network Design. Experience Sr. Analytics Researcher Adobe April 2012  – Present (3 years 5 months) San Francisco Bay Area Develop machine learning algorithms (reinforcement learning, Makov Decision Processes, Partially Observable Markov Decision Processes) for Digital Marketing products Researcher and Development Manager North Side Inc. September 2010  –  April 2012  (1 year 8 months) Led the language group (6 PhD researchers and 6 software developers) to build the back-end server for the Bot Colony Game. \nWorked on the dialogue management module for the Bot Colony game. Bot Colony is the first game ever that allows players to converse naturally with different virtual characters (robots) in 3D environments. Engineering Research Associate Stanford University January 2009  –  July 2010  (1 year 7 months) Developed and implemented algorithms to extract decisions from meeting corpora using graphical models in the framework of the DARPA Cognitive Agent that Learns and Organizes (CALO) project. CALO spun off Siri. Researcher University of Twente November 2004  –  January 2009  (4 years 3 months) Designed and developed tractable POMDP-based dialogue management methods for statistical dialogue applications in the framework of the Interactive Collaborative Information Systems (ICIS) project. ICIS is a research project funded by the Dutch government (2004-2009).  \nInvestigated POMDP dialog models for the Sustained Emotionally colored Machine-human Interaction using Nonverbal Expression (SEMAINE) project. SEMAINE was funded by European FP7 ICT research grant. \nInvented a novel approach to developing multimodal interfaces that are able to handle a large number of applications smoothly and transparently Research Assistant EPFL December 2002  –  October 2004  (1 year 11 months) Designed and implemented a rapid dialogue prototyping methodology for a quick production of frame-based dialogue models and the associated dialogue driven-interfaces in the framework of the INSPIRE and IM2-MDM projects. INSPIRE (INfotainment management with SPeech interaction via REmote-microphones and telephone interfaces, 2002-2004) is funded by the European FP5 IST research grant and IM2-MDM (Multimodal Dialogue Management, 2004), is funded by Swiss National Centre of Competence in Research grant System Engineer Vietnam DataCommunication Company August 1997  –  November 2002  (5 years 4 months) Participated in the design and administration of the Vietnam Internet Backbone Infrastructure, especially the firewall and the router systems IT Manager Military Bank - Vietnam June 1997  –  July 1997  (2 months) Participated in the design and development of a number of small-scale database engineering projects and intranet networks Software and Network Developer Advanced Informatics-Technology Corporation (AIC)-Vietnam June 1996  –  May 1997  (1 year) Participated in the design and development of a number of small-scale database engineering projects and intranet networks Sr. Analytics Researcher Adobe April 2012  – Present (3 years 5 months) San Francisco Bay Area Develop machine learning algorithms (reinforcement learning, Makov Decision Processes, Partially Observable Markov Decision Processes) for Digital Marketing products Sr. Analytics Researcher Adobe April 2012  – Present (3 years 5 months) San Francisco Bay Area Develop machine learning algorithms (reinforcement learning, Makov Decision Processes, Partially Observable Markov Decision Processes) for Digital Marketing products Researcher and Development Manager North Side Inc. September 2010  –  April 2012  (1 year 8 months) Led the language group (6 PhD researchers and 6 software developers) to build the back-end server for the Bot Colony Game. \nWorked on the dialogue management module for the Bot Colony game. Bot Colony is the first game ever that allows players to converse naturally with different virtual characters (robots) in 3D environments. Researcher and Development Manager North Side Inc. September 2010  –  April 2012  (1 year 8 months) Led the language group (6 PhD researchers and 6 software developers) to build the back-end server for the Bot Colony Game. \nWorked on the dialogue management module for the Bot Colony game. Bot Colony is the first game ever that allows players to converse naturally with different virtual characters (robots) in 3D environments. Engineering Research Associate Stanford University January 2009  –  July 2010  (1 year 7 months) Developed and implemented algorithms to extract decisions from meeting corpora using graphical models in the framework of the DARPA Cognitive Agent that Learns and Organizes (CALO) project. CALO spun off Siri. Engineering Research Associate Stanford University January 2009  –  July 2010  (1 year 7 months) Developed and implemented algorithms to extract decisions from meeting corpora using graphical models in the framework of the DARPA Cognitive Agent that Learns and Organizes (CALO) project. CALO spun off Siri. Researcher University of Twente November 2004  –  January 2009  (4 years 3 months) Designed and developed tractable POMDP-based dialogue management methods for statistical dialogue applications in the framework of the Interactive Collaborative Information Systems (ICIS) project. ICIS is a research project funded by the Dutch government (2004-2009).  \nInvestigated POMDP dialog models for the Sustained Emotionally colored Machine-human Interaction using Nonverbal Expression (SEMAINE) project. SEMAINE was funded by European FP7 ICT research grant. \nInvented a novel approach to developing multimodal interfaces that are able to handle a large number of applications smoothly and transparently Researcher University of Twente November 2004  –  January 2009  (4 years 3 months) Designed and developed tractable POMDP-based dialogue management methods for statistical dialogue applications in the framework of the Interactive Collaborative Information Systems (ICIS) project. ICIS is a research project funded by the Dutch government (2004-2009).  \nInvestigated POMDP dialog models for the Sustained Emotionally colored Machine-human Interaction using Nonverbal Expression (SEMAINE) project. SEMAINE was funded by European FP7 ICT research grant. \nInvented a novel approach to developing multimodal interfaces that are able to handle a large number of applications smoothly and transparently Research Assistant EPFL December 2002  –  October 2004  (1 year 11 months) Designed and implemented a rapid dialogue prototyping methodology for a quick production of frame-based dialogue models and the associated dialogue driven-interfaces in the framework of the INSPIRE and IM2-MDM projects. INSPIRE (INfotainment management with SPeech interaction via REmote-microphones and telephone interfaces, 2002-2004) is funded by the European FP5 IST research grant and IM2-MDM (Multimodal Dialogue Management, 2004), is funded by Swiss National Centre of Competence in Research grant Research Assistant EPFL December 2002  –  October 2004  (1 year 11 months) Designed and implemented a rapid dialogue prototyping methodology for a quick production of frame-based dialogue models and the associated dialogue driven-interfaces in the framework of the INSPIRE and IM2-MDM projects. INSPIRE (INfotainment management with SPeech interaction via REmote-microphones and telephone interfaces, 2002-2004) is funded by the European FP5 IST research grant and IM2-MDM (Multimodal Dialogue Management, 2004), is funded by Swiss National Centre of Competence in Research grant System Engineer Vietnam DataCommunication Company August 1997  –  November 2002  (5 years 4 months) Participated in the design and administration of the Vietnam Internet Backbone Infrastructure, especially the firewall and the router systems System Engineer Vietnam DataCommunication Company August 1997  –  November 2002  (5 years 4 months) Participated in the design and administration of the Vietnam Internet Backbone Infrastructure, especially the firewall and the router systems IT Manager Military Bank - Vietnam June 1997  –  July 1997  (2 months) Participated in the design and development of a number of small-scale database engineering projects and intranet networks IT Manager Military Bank - Vietnam June 1997  –  July 1997  (2 months) Participated in the design and development of a number of small-scale database engineering projects and intranet networks Software and Network Developer Advanced Informatics-Technology Corporation (AIC)-Vietnam June 1996  –  May 1997  (1 year) Participated in the design and development of a number of small-scale database engineering projects and intranet networks Software and Network Developer Advanced Informatics-Technology Corporation (AIC)-Vietnam June 1996  –  May 1997  (1 year) Participated in the design and development of a number of small-scale database engineering projects and intranet networks Languages Vietnamese Native or bilingual proficiency English Professional working proficiency French Limited working proficiency Dutch Elementary proficiency Vietnamese Native or bilingual proficiency English Professional working proficiency French Limited working proficiency Dutch Elementary proficiency Vietnamese Native or bilingual proficiency English Professional working proficiency French Limited working proficiency Dutch Elementary proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Elementary proficiency Skills Java Eclipse Maven Scrum Versant Game Development MySQL Machine Learning Matlab CCNA Bayesian networks Natural Language... Language Technology Reinforcement Learning Human-computer... Hidden Markov Models JProfiler JIRA Human Computer... Python Pattern Recognition Neural Networks See 7+     See less Skills  Java Eclipse Maven Scrum Versant Game Development MySQL Machine Learning Matlab CCNA Bayesian networks Natural Language... Language Technology Reinforcement Learning Human-computer... Hidden Markov Models JProfiler JIRA Human Computer... Python Pattern Recognition Neural Networks See 7+     See less Java Eclipse Maven Scrum Versant Game Development MySQL Machine Learning Matlab CCNA Bayesian networks Natural Language... Language Technology Reinforcement Learning Human-computer... Hidden Markov Models JProfiler JIRA Human Computer... Python Pattern Recognition Neural Networks See 7+     See less Java Eclipse Maven Scrum Versant Game Development MySQL Machine Learning Matlab CCNA Bayesian networks Natural Language... Language Technology Reinforcement Learning Human-computer... Hidden Markov Models JProfiler JIRA Human Computer... Python Pattern Recognition Neural Networks See 7+     See less Education University of Twente Ph.D.,  Computer Science 2004  – 2008 Pre-Doctoral Program,  Computer Science 2002  – 2003 Institut de la Francophonie pour l'Informatique M.Sc.,  Computer Science 2000  – 2002 Truòng Dai hoc Bách Khoa Hànôi B.Eng.,  Computer Science 1992  – 1997 University of Twente Ph.D.,  Computer Science 2004  – 2008 University of Twente Ph.D.,  Computer Science 2004  – 2008 University of Twente Ph.D.,  Computer Science 2004  – 2008 Pre-Doctoral Program,  Computer Science 2002  – 2003 Pre-Doctoral Program,  Computer Science 2002  – 2003 Pre-Doctoral Program,  Computer Science 2002  – 2003 Institut de la Francophonie pour l'Informatique M.Sc.,  Computer Science 2000  – 2002 Institut de la Francophonie pour l'Informatique M.Sc.,  Computer Science 2000  – 2002 Institut de la Francophonie pour l'Informatique M.Sc.,  Computer Science 2000  – 2002 Truòng Dai hoc Bách Khoa Hànôi B.Eng.,  Computer Science 1992  – 1997 Truòng Dai hoc Bách Khoa Hànôi B.Eng.,  Computer Science 1992  – 1997 Truòng Dai hoc Bách Khoa Hànôi B.Eng.,  Computer Science 1992  – 1997 ", "Skills Characterization Matlab Nanotechnology Research Management Materials Science Product Development Engineering Simulations Skills  Characterization Matlab Nanotechnology Research Management Materials Science Product Development Engineering Simulations Characterization Matlab Nanotechnology Research Management Materials Science Product Development Engineering Simulations Characterization Matlab Nanotechnology Research Management Materials Science Product Development Engineering Simulations ", "Summary Specialties:Research and development; prototyping; evaluation and testing of new medical devices and technologies. Summary Specialties:Research and development; prototyping; evaluation and testing of new medical devices and technologies. Specialties:Research and development; prototyping; evaluation and testing of new medical devices and technologies. Specialties:Research and development; prototyping; evaluation and testing of new medical devices and technologies. Experience Engineering Research Associate Stanford University February 2014  – Present (1 year 7 months) - Identify new translational and clinical research opportunities \n- Facilitate cross-campus collaborations between Urology and Urologic Oncology with departments of Electrical, Mechanical and Bioengineering \n \n Associate Research Scientist - Department of Urology Yale University School of Medicine March 2012  –  February 2014  (2 years) ◦ Co-Founder and Inaugural Engineering Research Director for the Yale Center for Biomedical and Interventional Technology \n◦ Successfully raised funding support for a new medical device incubator on Yale campus, leveraging resources from the School of Engineering & Applied Sciences and Yale School of Medicine \n◦ Supported new projects and grant submissions on a wide variety of topics, ranging from Diagnostic Radiology, Biomedical Engineering, Orthopedic Surgery and Urology. \n◦ Developed a business and financial plan to establish a consortium of on-campus engineers, scientists and clinicians to address gaps in medical device (MedTech) research and development \n◦ Initiated grassroots efforts to work with and gain support from Yale School of Medicine (YSM), Yale School for Engineering and Applied Sciences (SEAS) and Yale School of Management (SOM) \n◦ Established new research projects opportunities for undergraduate, graduate and medical students in YSM and SEAS, translating engineering prototypes to clinical research \n◦ Industry outreach to establish new internship, fellowship and sponsored research relationships \n \n \nLecturer – Mechanical Engineering – Yale School of Engineering & Applied Sciences (Fall 2013) \n◦ Co-developer and co-instructor of a new undergraduate course: MENG 404 – Medical Device Design and Innovation, an ABET elective course featured by Yale News and the New Haven Register. \n◦ Innovative curriculum bringing in four physician mentors from YSM to coach teams of 5 students on projects ranging from surgical tools, organ preservation systems, drug delivery devices and seizure monitor instruments. \n◦ Topics covered include: design thinking, ideation, prototyping, benchmarking, experimental design, regulatory affairs, pre-clinical and clinical testing, intellectual property, entrepreneurship \n◦ Follow-on from students after the end of the course include invention disclosures, abstract/paper submissions, grant submissions and student business competitions. Postdoc in the Division of General Surgery, UCLA Center for Advanced Surgical and Interventional Technology January 2011  –  February 2012  (1 year 2 months) ◦ Working in the Center for Advanced Surgical and Interventional Technology (CASIT), a joint research program between the UCLA School of Engineering and Applied Sciences and the School of Medicine \n◦ Coordinating teams of clinicians and engineers to develop new research projects and technologies, while also focused on translating existing bench-top devices to clinical trials and marketplace \n◦ Other research areas include: prosthetics, rehabilitation engineering, minimally invasive surgical tools, robotic surgery and ultrasound diagnostics & therapeutics Graduate Student Researcher in Biomedical Engineering UCLA September 2006  –  December 2010  (4 years 4 months) ◦ Developed a novel system to provide auxiliary sensory feedback system for persons with lower-limb sensory deficits; taking a research concept from inception to human clinical testing \n◦ Designed integrated system controller and apparatus to translate detected plantar pressures at the base of a prosthetic foot to a tactile feedback sensory mapping on the residual limb of a transtibial amputee \n◦ Refined silicone balloon actuator design to provide dynamic tactile feedback to the residual limb that resists sensory adaptation \n◦ Performed human clinical trials - biomechanical gait analysis with persons with transtibial amputation with collaborators at Naval Medical Center, San Diego \n◦ Mentor and research advisor to graduate, undergraduate and high-school students as part of the UCLA Center for Excellence in Engineering and Diversity (CEED) \n◦ Also worked on a variety of other projects including: haptic feedback for robotic surgery, a refreshable Braille display, astronaut extravehicular activity gloves and a torso-mounted balance assist system. Software Engineering Intern Honeywell Aerospace May 2004  –  August 2004  (4 months) Engineering Research Associate Stanford University February 2014  – Present (1 year 7 months) - Identify new translational and clinical research opportunities \n- Facilitate cross-campus collaborations between Urology and Urologic Oncology with departments of Electrical, Mechanical and Bioengineering \n \n Engineering Research Associate Stanford University February 2014  – Present (1 year 7 months) - Identify new translational and clinical research opportunities \n- Facilitate cross-campus collaborations between Urology and Urologic Oncology with departments of Electrical, Mechanical and Bioengineering \n \n Associate Research Scientist - Department of Urology Yale University School of Medicine March 2012  –  February 2014  (2 years) ◦ Co-Founder and Inaugural Engineering Research Director for the Yale Center for Biomedical and Interventional Technology \n◦ Successfully raised funding support for a new medical device incubator on Yale campus, leveraging resources from the School of Engineering & Applied Sciences and Yale School of Medicine \n◦ Supported new projects and grant submissions on a wide variety of topics, ranging from Diagnostic Radiology, Biomedical Engineering, Orthopedic Surgery and Urology. \n◦ Developed a business and financial plan to establish a consortium of on-campus engineers, scientists and clinicians to address gaps in medical device (MedTech) research and development \n◦ Initiated grassroots efforts to work with and gain support from Yale School of Medicine (YSM), Yale School for Engineering and Applied Sciences (SEAS) and Yale School of Management (SOM) \n◦ Established new research projects opportunities for undergraduate, graduate and medical students in YSM and SEAS, translating engineering prototypes to clinical research \n◦ Industry outreach to establish new internship, fellowship and sponsored research relationships \n \n \nLecturer – Mechanical Engineering – Yale School of Engineering & Applied Sciences (Fall 2013) \n◦ Co-developer and co-instructor of a new undergraduate course: MENG 404 – Medical Device Design and Innovation, an ABET elective course featured by Yale News and the New Haven Register. \n◦ Innovative curriculum bringing in four physician mentors from YSM to coach teams of 5 students on projects ranging from surgical tools, organ preservation systems, drug delivery devices and seizure monitor instruments. \n◦ Topics covered include: design thinking, ideation, prototyping, benchmarking, experimental design, regulatory affairs, pre-clinical and clinical testing, intellectual property, entrepreneurship \n◦ Follow-on from students after the end of the course include invention disclosures, abstract/paper submissions, grant submissions and student business competitions. Associate Research Scientist - Department of Urology Yale University School of Medicine March 2012  –  February 2014  (2 years) ◦ Co-Founder and Inaugural Engineering Research Director for the Yale Center for Biomedical and Interventional Technology \n◦ Successfully raised funding support for a new medical device incubator on Yale campus, leveraging resources from the School of Engineering & Applied Sciences and Yale School of Medicine \n◦ Supported new projects and grant submissions on a wide variety of topics, ranging from Diagnostic Radiology, Biomedical Engineering, Orthopedic Surgery and Urology. \n◦ Developed a business and financial plan to establish a consortium of on-campus engineers, scientists and clinicians to address gaps in medical device (MedTech) research and development \n◦ Initiated grassroots efforts to work with and gain support from Yale School of Medicine (YSM), Yale School for Engineering and Applied Sciences (SEAS) and Yale School of Management (SOM) \n◦ Established new research projects opportunities for undergraduate, graduate and medical students in YSM and SEAS, translating engineering prototypes to clinical research \n◦ Industry outreach to establish new internship, fellowship and sponsored research relationships \n \n \nLecturer – Mechanical Engineering – Yale School of Engineering & Applied Sciences (Fall 2013) \n◦ Co-developer and co-instructor of a new undergraduate course: MENG 404 – Medical Device Design and Innovation, an ABET elective course featured by Yale News and the New Haven Register. \n◦ Innovative curriculum bringing in four physician mentors from YSM to coach teams of 5 students on projects ranging from surgical tools, organ preservation systems, drug delivery devices and seizure monitor instruments. \n◦ Topics covered include: design thinking, ideation, prototyping, benchmarking, experimental design, regulatory affairs, pre-clinical and clinical testing, intellectual property, entrepreneurship \n◦ Follow-on from students after the end of the course include invention disclosures, abstract/paper submissions, grant submissions and student business competitions. Postdoc in the Division of General Surgery, UCLA Center for Advanced Surgical and Interventional Technology January 2011  –  February 2012  (1 year 2 months) ◦ Working in the Center for Advanced Surgical and Interventional Technology (CASIT), a joint research program between the UCLA School of Engineering and Applied Sciences and the School of Medicine \n◦ Coordinating teams of clinicians and engineers to develop new research projects and technologies, while also focused on translating existing bench-top devices to clinical trials and marketplace \n◦ Other research areas include: prosthetics, rehabilitation engineering, minimally invasive surgical tools, robotic surgery and ultrasound diagnostics & therapeutics Postdoc in the Division of General Surgery, UCLA Center for Advanced Surgical and Interventional Technology January 2011  –  February 2012  (1 year 2 months) ◦ Working in the Center for Advanced Surgical and Interventional Technology (CASIT), a joint research program between the UCLA School of Engineering and Applied Sciences and the School of Medicine \n◦ Coordinating teams of clinicians and engineers to develop new research projects and technologies, while also focused on translating existing bench-top devices to clinical trials and marketplace \n◦ Other research areas include: prosthetics, rehabilitation engineering, minimally invasive surgical tools, robotic surgery and ultrasound diagnostics & therapeutics Graduate Student Researcher in Biomedical Engineering UCLA September 2006  –  December 2010  (4 years 4 months) ◦ Developed a novel system to provide auxiliary sensory feedback system for persons with lower-limb sensory deficits; taking a research concept from inception to human clinical testing \n◦ Designed integrated system controller and apparatus to translate detected plantar pressures at the base of a prosthetic foot to a tactile feedback sensory mapping on the residual limb of a transtibial amputee \n◦ Refined silicone balloon actuator design to provide dynamic tactile feedback to the residual limb that resists sensory adaptation \n◦ Performed human clinical trials - biomechanical gait analysis with persons with transtibial amputation with collaborators at Naval Medical Center, San Diego \n◦ Mentor and research advisor to graduate, undergraduate and high-school students as part of the UCLA Center for Excellence in Engineering and Diversity (CEED) \n◦ Also worked on a variety of other projects including: haptic feedback for robotic surgery, a refreshable Braille display, astronaut extravehicular activity gloves and a torso-mounted balance assist system. Graduate Student Researcher in Biomedical Engineering UCLA September 2006  –  December 2010  (4 years 4 months) ◦ Developed a novel system to provide auxiliary sensory feedback system for persons with lower-limb sensory deficits; taking a research concept from inception to human clinical testing \n◦ Designed integrated system controller and apparatus to translate detected plantar pressures at the base of a prosthetic foot to a tactile feedback sensory mapping on the residual limb of a transtibial amputee \n◦ Refined silicone balloon actuator design to provide dynamic tactile feedback to the residual limb that resists sensory adaptation \n◦ Performed human clinical trials - biomechanical gait analysis with persons with transtibial amputation with collaborators at Naval Medical Center, San Diego \n◦ Mentor and research advisor to graduate, undergraduate and high-school students as part of the UCLA Center for Excellence in Engineering and Diversity (CEED) \n◦ Also worked on a variety of other projects including: haptic feedback for robotic surgery, a refreshable Braille display, astronaut extravehicular activity gloves and a torso-mounted balance assist system. Software Engineering Intern Honeywell Aerospace May 2004  –  August 2004  (4 months) Software Engineering Intern Honeywell Aerospace May 2004  –  August 2004  (4 months) Skills Biomedical Engineering Medical Devices Signal Processing Matlab LaTeX Clinical Trials Labview R&D Embedded Systems Product Development Mathematica C++ Solidworks Research Clinical Research Image Processing 3D Printing Rapid Prototyping Surgical Instruments Electrical Engineering Design See 6+     See less Skills  Biomedical Engineering Medical Devices Signal Processing Matlab LaTeX Clinical Trials Labview R&D Embedded Systems Product Development Mathematica C++ Solidworks Research Clinical Research Image Processing 3D Printing Rapid Prototyping Surgical Instruments Electrical Engineering Design See 6+     See less Biomedical Engineering Medical Devices Signal Processing Matlab LaTeX Clinical Trials Labview R&D Embedded Systems Product Development Mathematica C++ Solidworks Research Clinical Research Image Processing 3D Printing Rapid Prototyping Surgical Instruments Electrical Engineering Design See 6+     See less Biomedical Engineering Medical Devices Signal Processing Matlab LaTeX Clinical Trials Labview R&D Embedded Systems Product Development Mathematica C++ Solidworks Research Clinical Research Image Processing 3D Printing Rapid Prototyping Surgical Instruments Electrical Engineering Design See 6+     See less Education University of California, Los Angeles PhD,  Biomedical Engineering 2006  – 2010 University of California, Los Angeles MS,  Electrical Engineering 2005  – 2006 University of Arizona BS,  Electrical Engineering 2001  – 2005 University of California, Los Angeles PhD,  Biomedical Engineering 2006  – 2010 University of California, Los Angeles PhD,  Biomedical Engineering 2006  – 2010 University of California, Los Angeles PhD,  Biomedical Engineering 2006  – 2010 University of California, Los Angeles MS,  Electrical Engineering 2005  – 2006 University of California, Los Angeles MS,  Electrical Engineering 2005  – 2006 University of California, Los Angeles MS,  Electrical Engineering 2005  – 2006 University of Arizona BS,  Electrical Engineering 2001  – 2005 University of Arizona BS,  Electrical Engineering 2001  – 2005 University of Arizona BS,  Electrical Engineering 2001  – 2005 ", "Summary Strong research and educational background in antenna design and microwave technology. Extensive project experiences in collaboration with automotive industry leader and governmental organizations. Currently as a visiting scholar in Stanford University EE Dept., I have been driving critical efforts in cutting edge research projects in the field of biomedical application using microwave technology, which has drawn major media attention such as BBC News. Track records of innovation and research capability including 2 filed patents, and publications on 11 journals and 22 conference papers.  \n \nOpen for industrial opportunity in biomedical system R&D and applications leveraging microwave technology. Interested in partnering with passionate entrepreneurs with shared background, value and vision to incorporate business entity that focuses on advancing and revolutionizing microwave empowered biomedical application landscape. Summary Strong research and educational background in antenna design and microwave technology. Extensive project experiences in collaboration with automotive industry leader and governmental organizations. Currently as a visiting scholar in Stanford University EE Dept., I have been driving critical efforts in cutting edge research projects in the field of biomedical application using microwave technology, which has drawn major media attention such as BBC News. Track records of innovation and research capability including 2 filed patents, and publications on 11 journals and 22 conference papers.  \n \nOpen for industrial opportunity in biomedical system R&D and applications leveraging microwave technology. Interested in partnering with passionate entrepreneurs with shared background, value and vision to incorporate business entity that focuses on advancing and revolutionizing microwave empowered biomedical application landscape. Strong research and educational background in antenna design and microwave technology. Extensive project experiences in collaboration with automotive industry leader and governmental organizations. Currently as a visiting scholar in Stanford University EE Dept., I have been driving critical efforts in cutting edge research projects in the field of biomedical application using microwave technology, which has drawn major media attention such as BBC News. Track records of innovation and research capability including 2 filed patents, and publications on 11 journals and 22 conference papers.  \n \nOpen for industrial opportunity in biomedical system R&D and applications leveraging microwave technology. Interested in partnering with passionate entrepreneurs with shared background, value and vision to incorporate business entity that focuses on advancing and revolutionizing microwave empowered biomedical application landscape. Strong research and educational background in antenna design and microwave technology. Extensive project experiences in collaboration with automotive industry leader and governmental organizations. Currently as a visiting scholar in Stanford University EE Dept., I have been driving critical efforts in cutting edge research projects in the field of biomedical application using microwave technology, which has drawn major media attention such as BBC News. Track records of innovation and research capability including 2 filed patents, and publications on 11 journals and 22 conference papers.  \n \nOpen for industrial opportunity in biomedical system R&D and applications leveraging microwave technology. Interested in partnering with passionate entrepreneurs with shared background, value and vision to incorporate business entity that focuses on advancing and revolutionizing microwave empowered biomedical application landscape. Experience Engineering Research Associate Stanford University October 2014  – Present (11 months) Stanford, CA • Wireless biomedical implantable devices for multi-site pacing \n• RF wireless lead for the treatment of migraine corroborate with St. Jude Medical, Inc. \n• A wirelessly-powered, fully-internal implant that enables optogenetic stimulation \n• Wireless cuff for nerve stimulation Visiting Scholar Stanford University August 2011  – Present (4 years 1 month) Palo Alto, CA ・Design of system for wireless power transfer to deep-tissue microchip-implants \n・A project for a wearable impact measurement device with wireless power and data communication \n・Design of beam focused transmitter and receiving coils for microchip implantable devices for biomedical application, presented in ISAP2012 conference \n・Wireless powering of microchip Implants in biological tissue by a cross-slot antenna, presented in APMC2012 conference \n・Wideband antenna design for 60GHz wireless communication \n・Real-time 3D vector localization system for biomedical applications \n・Experimental experiences in microchip injection into live animals Engineering Manager AET Associates, Inc. March 2011  – Present (4 years 6 months) Cupertino ・Accomplished major sales deals of microwave simulation software with industrial and institutional leaders, establishing strong customer relationship for future business  \n・Creating new intercultural products (anechoic chamber and Wheeler cap for antenna characteristics measurement system) adding to existing product portfolio Lab Instructor Stanford University October 2012  –  December 2013  (1 year 3 months) Department of Electrical Engineering Lecturing EE graduate level course: Antenna Theory EE252 lab session Research Associate Waseda University April 2009  –  March 2011  (2 years) Japan ・Collaborative research with TOYOTA R&D Dept. \n・Teaching assistant of graduate level course (Digital signal processing, Mobile wireless communications) \n・Created and defined funding proposals to Japan Society for the Promotion of Science  \n・Represented EE Dept. and successfully delivered presentation at 5 academic conferences, Engineering Research Associate Stanford University October 2014  – Present (11 months) Stanford, CA • Wireless biomedical implantable devices for multi-site pacing \n• RF wireless lead for the treatment of migraine corroborate with St. Jude Medical, Inc. \n• A wirelessly-powered, fully-internal implant that enables optogenetic stimulation \n• Wireless cuff for nerve stimulation Engineering Research Associate Stanford University October 2014  – Present (11 months) Stanford, CA • Wireless biomedical implantable devices for multi-site pacing \n• RF wireless lead for the treatment of migraine corroborate with St. Jude Medical, Inc. \n• A wirelessly-powered, fully-internal implant that enables optogenetic stimulation \n• Wireless cuff for nerve stimulation Visiting Scholar Stanford University August 2011  – Present (4 years 1 month) Palo Alto, CA ・Design of system for wireless power transfer to deep-tissue microchip-implants \n・A project for a wearable impact measurement device with wireless power and data communication \n・Design of beam focused transmitter and receiving coils for microchip implantable devices for biomedical application, presented in ISAP2012 conference \n・Wireless powering of microchip Implants in biological tissue by a cross-slot antenna, presented in APMC2012 conference \n・Wideband antenna design for 60GHz wireless communication \n・Real-time 3D vector localization system for biomedical applications \n・Experimental experiences in microchip injection into live animals Visiting Scholar Stanford University August 2011  – Present (4 years 1 month) Palo Alto, CA ・Design of system for wireless power transfer to deep-tissue microchip-implants \n・A project for a wearable impact measurement device with wireless power and data communication \n・Design of beam focused transmitter and receiving coils for microchip implantable devices for biomedical application, presented in ISAP2012 conference \n・Wireless powering of microchip Implants in biological tissue by a cross-slot antenna, presented in APMC2012 conference \n・Wideband antenna design for 60GHz wireless communication \n・Real-time 3D vector localization system for biomedical applications \n・Experimental experiences in microchip injection into live animals Engineering Manager AET Associates, Inc. March 2011  – Present (4 years 6 months) Cupertino ・Accomplished major sales deals of microwave simulation software with industrial and institutional leaders, establishing strong customer relationship for future business  \n・Creating new intercultural products (anechoic chamber and Wheeler cap for antenna characteristics measurement system) adding to existing product portfolio Engineering Manager AET Associates, Inc. March 2011  – Present (4 years 6 months) Cupertino ・Accomplished major sales deals of microwave simulation software with industrial and institutional leaders, establishing strong customer relationship for future business  \n・Creating new intercultural products (anechoic chamber and Wheeler cap for antenna characteristics measurement system) adding to existing product portfolio Lab Instructor Stanford University October 2012  –  December 2013  (1 year 3 months) Department of Electrical Engineering Lecturing EE graduate level course: Antenna Theory EE252 lab session Lab Instructor Stanford University October 2012  –  December 2013  (1 year 3 months) Department of Electrical Engineering Lecturing EE graduate level course: Antenna Theory EE252 lab session Research Associate Waseda University April 2009  –  March 2011  (2 years) Japan ・Collaborative research with TOYOTA R&D Dept. \n・Teaching assistant of graduate level course (Digital signal processing, Mobile wireless communications) \n・Created and defined funding proposals to Japan Society for the Promotion of Science  \n・Represented EE Dept. and successfully delivered presentation at 5 academic conferences, Research Associate Waseda University April 2009  –  March 2011  (2 years) Japan ・Collaborative research with TOYOTA R&D Dept. \n・Teaching assistant of graduate level course (Digital signal processing, Mobile wireless communications) \n・Created and defined funding proposals to Japan Society for the Promotion of Science  \n・Represented EE Dept. and successfully delivered presentation at 5 academic conferences, Languages Japanese English Japanese English Japanese English Skills Matlab Simulations Physics Mathematical Modeling Nanotechnology Mathematica Python Labview Research High Performance... Antenna design Optics Biomedical engineering Microchip implants Electromagnetics Biomedical Engineering See 1+     See less Skills  Matlab Simulations Physics Mathematical Modeling Nanotechnology Mathematica Python Labview Research High Performance... Antenna design Optics Biomedical engineering Microchip implants Electromagnetics Biomedical Engineering See 1+     See less Matlab Simulations Physics Mathematical Modeling Nanotechnology Mathematica Python Labview Research High Performance... Antenna design Optics Biomedical engineering Microchip implants Electromagnetics Biomedical Engineering See 1+     See less Matlab Simulations Physics Mathematical Modeling Nanotechnology Mathematica Python Labview Research High Performance... Antenna design Optics Biomedical engineering Microchip implants Electromagnetics Biomedical Engineering See 1+     See less Education Waseda University Ph.D.,  Engineering 2004  – 2011 Activities and Societies:  Led collaborative research projects with TOYOTA R&D Dept. from 2004-2011\n1. Ultra wideband wireless communication in automotive applications (front-end circuit and antenna design)\n2. Non-invasive vital signal monitoring system for vehicle drivers by using microwave (Antenna and sensor design) Stanford University Waseda University Ph.D.,  Engineering 2004  – 2011 Activities and Societies:  Led collaborative research projects with TOYOTA R&D Dept. from 2004-2011\n1. Ultra wideband wireless communication in automotive applications (front-end circuit and antenna design)\n2. Non-invasive vital signal monitoring system for vehicle drivers by using microwave (Antenna and sensor design) Waseda University Ph.D.,  Engineering 2004  – 2011 Activities and Societies:  Led collaborative research projects with TOYOTA R&D Dept. from 2004-2011\n1. Ultra wideband wireless communication in automotive applications (front-end circuit and antenna design)\n2. Non-invasive vital signal monitoring system for vehicle drivers by using microwave (Antenna and sensor design) Waseda University Ph.D.,  Engineering 2004  – 2011 Activities and Societies:  Led collaborative research projects with TOYOTA R&D Dept. from 2004-2011\n1. Ultra wideband wireless communication in automotive applications (front-end circuit and antenna design)\n2. Non-invasive vital signal monitoring system for vehicle drivers by using microwave (Antenna and sensor design) Stanford University Stanford University Stanford University ", "Skills Java C++ Perl Python Machine Learning Natural Language... Speech Recognition Bioinformatics XML Bash Dialogue C MySQL Linux SQL HTML Unix Eclipse Windows PostgreSQL Shell Scripting Programming CVS AJAX Computational... Apache Artificial Intelligence Information Extraction R Statistics Epidemiology LaTeX Text Mining Genomics Information Retrieval Data Mining Computer Science See 22+     See less Skills  Java C++ Perl Python Machine Learning Natural Language... Speech Recognition Bioinformatics XML Bash Dialogue C MySQL Linux SQL HTML Unix Eclipse Windows PostgreSQL Shell Scripting Programming CVS AJAX Computational... Apache Artificial Intelligence Information Extraction R Statistics Epidemiology LaTeX Text Mining Genomics Information Retrieval Data Mining Computer Science See 22+     See less Java C++ Perl Python Machine Learning Natural Language... Speech Recognition Bioinformatics XML Bash Dialogue C MySQL Linux SQL HTML Unix Eclipse Windows PostgreSQL Shell Scripting Programming CVS AJAX Computational... Apache Artificial Intelligence Information Extraction R Statistics Epidemiology LaTeX Text Mining Genomics Information Retrieval Data Mining Computer Science See 22+     See less Java C++ Perl Python Machine Learning Natural Language... Speech Recognition Bioinformatics XML Bash Dialogue C MySQL Linux SQL HTML Unix Eclipse Windows PostgreSQL Shell Scripting Programming CVS AJAX Computational... Apache Artificial Intelligence Information Extraction R Statistics Epidemiology LaTeX Text Mining Genomics Information Retrieval Data Mining Computer Science See 22+     See less Honors & Awards ", "Experience Engineering Research Associate Stanford University December 2014  – Present (9 months) San Francisco Bay Area IMPACTS OF AIR PURIFIERS ON INDOOR AIR QUALITY AND CHILDREN'S HEALTH  \n-- Investigating the effectiveness of a commercially-available air purifier at reducing airborne dust and allergen levels in Fresno homes. \n-- Evaluating the influence of air purifiers on asthma and allergic rhinitis-related health outcomes in children with asthma and/or allergic rhinitis. \n-- Characterizing the relationship between exposure to indoor bioaerosols and allergic health outcomes. \n \nCHARACTERIZING THE PATTERNS OF CONCENTRATION TIME SERIES CLOSE TO INDOOR AIR POLLUTION SOURCES FOR ACUTE EXPOSURE PREDICTION \n-- Formulated a research idea and wrote a proposal (submitted to Stanford Data Science Initiative) on using big data science for assessments of acute exposures to indoor air toxics.  \n-- Using, for the first time, the spectral analysis method to characterize the rapid concentration fluctuations close to an indoor emission source. \n-- Developing an algorithm to track the spatial and temporal evolution of indoor air toxics plumes. Research Scientist California Department of Public Health February 2013  –  November 2014  (1 year 10 months) San Francisco Bay Area ASSESSMENT OF INHALATION EXPOSURE TO VOLATILE ORGANIC COMPOUNDS FROM CLEANING PRODUCTS\t \n-- Examining the influence of different floor mopping methods on janitors' and occupants' exposures to volatile organic compounds (VOCs).  \n-- Characterizing the time-varying emissions of VOCs during and after the floor cleaning activities. Postdoctoral Researcher Stanford University January 2011  –  February 2013  (2 years 2 months) San Francisco Bay Area MODELING SHORT-TERM EXPOSURE IN CLOSE PROXIMITY TO INDOOR AIR POLLUTION SOURCES \n-- Developed a stochastic transport model to simulate the meandering cigarette smoke stream in space \n-- Published the first model to predict the probabilistic distributions of highly-variable transient exposures near actively-emitting indoor air pollution sources \n \nIDENTIFYING AND MEASURING SHS IN MULTI-UNIT DWELLINGS\t \n-- Identification of physical and chemical markers for secondhand smoke  \n-- Field investigation of the secondhand smoke infiltration between units  \n-- Determination of the calibration and emission factors for multiple indoor particle sources Research Assistant Stanford University 2007  –  2010  (3 years) San Francisco Bay Area CHARACTERIZING AND MODELING CLOSE-PROXIMITY EXPOSURE TO AN AIR POLLUTION SOURCE IN NATURALLY VENTILATED RESIDENCES \n-- Conducted the first monitoring array study to measure spatial and temporal variations of \nconcentrations close to an air pollution source in residences \n-- Developed an algorithm to reconstruct accurate concentration time series from readings of diffusion based gas sensors \n-- Experimentally determined the first set of turbulent diffusion coefficient estimates in residences. \n-- Published the first model to predict indoor turbulent diffusion coefficients based on air change rates and room dimensions \n \nHUMAN EXPOSURE ANALYSIS FOR POLLUTANTS FROM SECONDHAND SMOKE \n-- First large-scale field survey on airborne particulate matter concentrations in casinos  \n-- Characterization of monitor responses to different particulate matter emission sources \n-- Examination of personal exposures to fine and ultrafine particles close to indoor and outdoor cigarette smoking  Engineering Research Associate Stanford University December 2014  – Present (9 months) San Francisco Bay Area IMPACTS OF AIR PURIFIERS ON INDOOR AIR QUALITY AND CHILDREN'S HEALTH  \n-- Investigating the effectiveness of a commercially-available air purifier at reducing airborne dust and allergen levels in Fresno homes. \n-- Evaluating the influence of air purifiers on asthma and allergic rhinitis-related health outcomes in children with asthma and/or allergic rhinitis. \n-- Characterizing the relationship between exposure to indoor bioaerosols and allergic health outcomes. \n \nCHARACTERIZING THE PATTERNS OF CONCENTRATION TIME SERIES CLOSE TO INDOOR AIR POLLUTION SOURCES FOR ACUTE EXPOSURE PREDICTION \n-- Formulated a research idea and wrote a proposal (submitted to Stanford Data Science Initiative) on using big data science for assessments of acute exposures to indoor air toxics.  \n-- Using, for the first time, the spectral analysis method to characterize the rapid concentration fluctuations close to an indoor emission source. \n-- Developing an algorithm to track the spatial and temporal evolution of indoor air toxics plumes. Engineering Research Associate Stanford University December 2014  – Present (9 months) San Francisco Bay Area IMPACTS OF AIR PURIFIERS ON INDOOR AIR QUALITY AND CHILDREN'S HEALTH  \n-- Investigating the effectiveness of a commercially-available air purifier at reducing airborne dust and allergen levels in Fresno homes. \n-- Evaluating the influence of air purifiers on asthma and allergic rhinitis-related health outcomes in children with asthma and/or allergic rhinitis. \n-- Characterizing the relationship between exposure to indoor bioaerosols and allergic health outcomes. \n \nCHARACTERIZING THE PATTERNS OF CONCENTRATION TIME SERIES CLOSE TO INDOOR AIR POLLUTION SOURCES FOR ACUTE EXPOSURE PREDICTION \n-- Formulated a research idea and wrote a proposal (submitted to Stanford Data Science Initiative) on using big data science for assessments of acute exposures to indoor air toxics.  \n-- Using, for the first time, the spectral analysis method to characterize the rapid concentration fluctuations close to an indoor emission source. \n-- Developing an algorithm to track the spatial and temporal evolution of indoor air toxics plumes. Research Scientist California Department of Public Health February 2013  –  November 2014  (1 year 10 months) San Francisco Bay Area ASSESSMENT OF INHALATION EXPOSURE TO VOLATILE ORGANIC COMPOUNDS FROM CLEANING PRODUCTS\t \n-- Examining the influence of different floor mopping methods on janitors' and occupants' exposures to volatile organic compounds (VOCs).  \n-- Characterizing the time-varying emissions of VOCs during and after the floor cleaning activities. Research Scientist California Department of Public Health February 2013  –  November 2014  (1 year 10 months) San Francisco Bay Area ASSESSMENT OF INHALATION EXPOSURE TO VOLATILE ORGANIC COMPOUNDS FROM CLEANING PRODUCTS\t \n-- Examining the influence of different floor mopping methods on janitors' and occupants' exposures to volatile organic compounds (VOCs).  \n-- Characterizing the time-varying emissions of VOCs during and after the floor cleaning activities. Postdoctoral Researcher Stanford University January 2011  –  February 2013  (2 years 2 months) San Francisco Bay Area MODELING SHORT-TERM EXPOSURE IN CLOSE PROXIMITY TO INDOOR AIR POLLUTION SOURCES \n-- Developed a stochastic transport model to simulate the meandering cigarette smoke stream in space \n-- Published the first model to predict the probabilistic distributions of highly-variable transient exposures near actively-emitting indoor air pollution sources \n \nIDENTIFYING AND MEASURING SHS IN MULTI-UNIT DWELLINGS\t \n-- Identification of physical and chemical markers for secondhand smoke  \n-- Field investigation of the secondhand smoke infiltration between units  \n-- Determination of the calibration and emission factors for multiple indoor particle sources Postdoctoral Researcher Stanford University January 2011  –  February 2013  (2 years 2 months) San Francisco Bay Area MODELING SHORT-TERM EXPOSURE IN CLOSE PROXIMITY TO INDOOR AIR POLLUTION SOURCES \n-- Developed a stochastic transport model to simulate the meandering cigarette smoke stream in space \n-- Published the first model to predict the probabilistic distributions of highly-variable transient exposures near actively-emitting indoor air pollution sources \n \nIDENTIFYING AND MEASURING SHS IN MULTI-UNIT DWELLINGS\t \n-- Identification of physical and chemical markers for secondhand smoke  \n-- Field investigation of the secondhand smoke infiltration between units  \n-- Determination of the calibration and emission factors for multiple indoor particle sources Research Assistant Stanford University 2007  –  2010  (3 years) San Francisco Bay Area CHARACTERIZING AND MODELING CLOSE-PROXIMITY EXPOSURE TO AN AIR POLLUTION SOURCE IN NATURALLY VENTILATED RESIDENCES \n-- Conducted the first monitoring array study to measure spatial and temporal variations of \nconcentrations close to an air pollution source in residences \n-- Developed an algorithm to reconstruct accurate concentration time series from readings of diffusion based gas sensors \n-- Experimentally determined the first set of turbulent diffusion coefficient estimates in residences. \n-- Published the first model to predict indoor turbulent diffusion coefficients based on air change rates and room dimensions \n \nHUMAN EXPOSURE ANALYSIS FOR POLLUTANTS FROM SECONDHAND SMOKE \n-- First large-scale field survey on airborne particulate matter concentrations in casinos  \n-- Characterization of monitor responses to different particulate matter emission sources \n-- Examination of personal exposures to fine and ultrafine particles close to indoor and outdoor cigarette smoking  Research Assistant Stanford University 2007  –  2010  (3 years) San Francisco Bay Area CHARACTERIZING AND MODELING CLOSE-PROXIMITY EXPOSURE TO AN AIR POLLUTION SOURCE IN NATURALLY VENTILATED RESIDENCES \n-- Conducted the first monitoring array study to measure spatial and temporal variations of \nconcentrations close to an air pollution source in residences \n-- Developed an algorithm to reconstruct accurate concentration time series from readings of diffusion based gas sensors \n-- Experimentally determined the first set of turbulent diffusion coefficient estimates in residences. \n-- Published the first model to predict indoor turbulent diffusion coefficients based on air change rates and room dimensions \n \nHUMAN EXPOSURE ANALYSIS FOR POLLUTANTS FROM SECONDHAND SMOKE \n-- First large-scale field survey on airborne particulate matter concentrations in casinos  \n-- Characterization of monitor responses to different particulate matter emission sources \n-- Examination of personal exposures to fine and ultrafine particles close to indoor and outdoor cigarette smoking  Languages English Chinese English Chinese English Chinese Skills Indoor Air Quality Exposure Assessment Aerosol Physics Air Monitoring... Air Pollution Control Numerical Simulation Matlab Statistical Modeling Air Pollution Modeling Mathematical Modeling Statistics Environmental... Science Energy Efficiency Environmental Science Environmental Impact... Climate Change R Water Quality Sustainability See 6+     See less Skills  Indoor Air Quality Exposure Assessment Aerosol Physics Air Monitoring... Air Pollution Control Numerical Simulation Matlab Statistical Modeling Air Pollution Modeling Mathematical Modeling Statistics Environmental... Science Energy Efficiency Environmental Science Environmental Impact... Climate Change R Water Quality Sustainability See 6+     See less Indoor Air Quality Exposure Assessment Aerosol Physics Air Monitoring... Air Pollution Control Numerical Simulation Matlab Statistical Modeling Air Pollution Modeling Mathematical Modeling Statistics Environmental... Science Energy Efficiency Environmental Science Environmental Impact... Climate Change R Water Quality Sustainability See 6+     See less Indoor Air Quality Exposure Assessment Aerosol Physics Air Monitoring... Air Pollution Control Numerical Simulation Matlab Statistical Modeling Air Pollution Modeling Mathematical Modeling Statistics Environmental... Science Energy Efficiency Environmental Science Environmental Impact... Climate Change R Water Quality Sustainability See 6+     See less Education Stanford University Doctor of Philosophy (Ph.D.),  Environmental/Environmental Health Engineering 2006  – 2011 National Chiao Tung University Master of Science (MS),  Environmental Engineering Technology/Environmental Technology 2000  – 2002 Stanford University Doctor of Philosophy (Ph.D.),  Environmental/Environmental Health Engineering 2006  – 2011 Stanford University Doctor of Philosophy (Ph.D.),  Environmental/Environmental Health Engineering 2006  – 2011 Stanford University Doctor of Philosophy (Ph.D.),  Environmental/Environmental Health Engineering 2006  – 2011 National Chiao Tung University Master of Science (MS),  Environmental Engineering Technology/Environmental Technology 2000  – 2002 National Chiao Tung University Master of Science (MS),  Environmental Engineering Technology/Environmental Technology 2000  – 2002 National Chiao Tung University Master of Science (MS),  Environmental Engineering Technology/Environmental Technology 2000  – 2002 Honors & Awards ", "Experience Engineering Research Associate Stanford University March 2014  – Present (1 year 6 months) Sr. Clinical Research Associate Solta Medical, Inc. October 2012  –  March 2014  (1 year 6 months) Hayward, CA Consultant Moximed May 2011  –  October 2012  (1 year 6 months) •\tConsultant for R&D and Marketing teams at orthopaedic medical device start-up. Research Biomedical Engineer Department of Veterans Affairs June 2010  –  October 2012  (2 years 5 months) Palo Alto, CA •\tPrincipal Investigator of translational biomechanics research.  \n•\tAwarded 2-year career development grant to investigate the role of elevated levels of serum biomarkers and abnormal gait mechanics in disease progression in an osteoarthritic population using a prospective design.  \n•\tManage and oversee several research projects including study design, IRB approval, subject recruitment, subject testing, data analysis and interpretation, project reports, and scientific writing.  \n•\tPerform clinical gait analysis, magnetic resonance imaging, and serum biomarker testing of healthy patients and patients with knee osteoarthritis.  \n•\tMentor graduate and undergraduate students in clinical biomechanics projects. \n•\tLead writing of new grant submissions to agencies such as the NIH, NIA, and VA. Visiting Scholar Stanford University June 2010  –  October 2012  (2 years 5 months) •\tCollaborate with colleagues in the Stanford Biomotion Laboratory on translational biomechanics research projects. Postdoctoral Fellow Stanford University January 2009  –  June 2010  (1 year 6 months) •\tWorked with experts in musculoskeletal imaging to investigate the relationship between pain, regional cartilage thinning, and walking mechanics in an osteoarthritic population. \n•\tServed as point contact for outside vendor to develop shoe intervention (resulting from PhD work) for mass market production. Provide product testing and analysis. \n•\tInitiated 3-year VA-funded research project to identify mechanical and biological factors that predispose obese individuals to developing knee osteoarthritis in a cross-sectional study of 200 participants.  \n•\tLed clinical coordination of subject recruitment, IRB approval and reporting, and subject testing. Research Assistant Stanford University September 2004  –  December 2008  (4 years 4 months) •\tConducted 1-year prospective placebo-controlled clinical trial to evaluate a novel load-modifying footwear intervention for knee osteoarthritis. Performed clinical gait analysis,magnetic resonance imaging, data analysis, and scientific writing.  \n•\tDeveloped and implemented subject recruitment plans, identified barriers to patient enrollment, tracked enrollment toward goals, and worked with an interdisciplinary team of researchers and medical personnel. \n•\tResearch provided the motivation to make the intervention available to the public. Research Assistant University of Pittsburgh 2002  –  2004  (2 years) Arthritis Institute Lupus Center of Excellence •\tDeveloped and validated a novel system to measure vascular stiffness through ex-vivo perfusion testing in a murine model of systemic lupus erythematosus.  \n•\tPerformed animal dissection and testing, histochemical analyses, and mechanical testing. Engineering Research Associate Stanford University March 2014  – Present (1 year 6 months) Engineering Research Associate Stanford University March 2014  – Present (1 year 6 months) Sr. Clinical Research Associate Solta Medical, Inc. October 2012  –  March 2014  (1 year 6 months) Hayward, CA Sr. Clinical Research Associate Solta Medical, Inc. October 2012  –  March 2014  (1 year 6 months) Hayward, CA Consultant Moximed May 2011  –  October 2012  (1 year 6 months) •\tConsultant for R&D and Marketing teams at orthopaedic medical device start-up. Consultant Moximed May 2011  –  October 2012  (1 year 6 months) •\tConsultant for R&D and Marketing teams at orthopaedic medical device start-up. Research Biomedical Engineer Department of Veterans Affairs June 2010  –  October 2012  (2 years 5 months) Palo Alto, CA •\tPrincipal Investigator of translational biomechanics research.  \n•\tAwarded 2-year career development grant to investigate the role of elevated levels of serum biomarkers and abnormal gait mechanics in disease progression in an osteoarthritic population using a prospective design.  \n•\tManage and oversee several research projects including study design, IRB approval, subject recruitment, subject testing, data analysis and interpretation, project reports, and scientific writing.  \n•\tPerform clinical gait analysis, magnetic resonance imaging, and serum biomarker testing of healthy patients and patients with knee osteoarthritis.  \n•\tMentor graduate and undergraduate students in clinical biomechanics projects. \n•\tLead writing of new grant submissions to agencies such as the NIH, NIA, and VA. Research Biomedical Engineer Department of Veterans Affairs June 2010  –  October 2012  (2 years 5 months) Palo Alto, CA •\tPrincipal Investigator of translational biomechanics research.  \n•\tAwarded 2-year career development grant to investigate the role of elevated levels of serum biomarkers and abnormal gait mechanics in disease progression in an osteoarthritic population using a prospective design.  \n•\tManage and oversee several research projects including study design, IRB approval, subject recruitment, subject testing, data analysis and interpretation, project reports, and scientific writing.  \n•\tPerform clinical gait analysis, magnetic resonance imaging, and serum biomarker testing of healthy patients and patients with knee osteoarthritis.  \n•\tMentor graduate and undergraduate students in clinical biomechanics projects. \n•\tLead writing of new grant submissions to agencies such as the NIH, NIA, and VA. Visiting Scholar Stanford University June 2010  –  October 2012  (2 years 5 months) •\tCollaborate with colleagues in the Stanford Biomotion Laboratory on translational biomechanics research projects. Visiting Scholar Stanford University June 2010  –  October 2012  (2 years 5 months) •\tCollaborate with colleagues in the Stanford Biomotion Laboratory on translational biomechanics research projects. Postdoctoral Fellow Stanford University January 2009  –  June 2010  (1 year 6 months) •\tWorked with experts in musculoskeletal imaging to investigate the relationship between pain, regional cartilage thinning, and walking mechanics in an osteoarthritic population. \n•\tServed as point contact for outside vendor to develop shoe intervention (resulting from PhD work) for mass market production. Provide product testing and analysis. \n•\tInitiated 3-year VA-funded research project to identify mechanical and biological factors that predispose obese individuals to developing knee osteoarthritis in a cross-sectional study of 200 participants.  \n•\tLed clinical coordination of subject recruitment, IRB approval and reporting, and subject testing. Postdoctoral Fellow Stanford University January 2009  –  June 2010  (1 year 6 months) •\tWorked with experts in musculoskeletal imaging to investigate the relationship between pain, regional cartilage thinning, and walking mechanics in an osteoarthritic population. \n•\tServed as point contact for outside vendor to develop shoe intervention (resulting from PhD work) for mass market production. Provide product testing and analysis. \n•\tInitiated 3-year VA-funded research project to identify mechanical and biological factors that predispose obese individuals to developing knee osteoarthritis in a cross-sectional study of 200 participants.  \n•\tLed clinical coordination of subject recruitment, IRB approval and reporting, and subject testing. Research Assistant Stanford University September 2004  –  December 2008  (4 years 4 months) •\tConducted 1-year prospective placebo-controlled clinical trial to evaluate a novel load-modifying footwear intervention for knee osteoarthritis. Performed clinical gait analysis,magnetic resonance imaging, data analysis, and scientific writing.  \n•\tDeveloped and implemented subject recruitment plans, identified barriers to patient enrollment, tracked enrollment toward goals, and worked with an interdisciplinary team of researchers and medical personnel. \n•\tResearch provided the motivation to make the intervention available to the public. Research Assistant Stanford University September 2004  –  December 2008  (4 years 4 months) •\tConducted 1-year prospective placebo-controlled clinical trial to evaluate a novel load-modifying footwear intervention for knee osteoarthritis. Performed clinical gait analysis,magnetic resonance imaging, data analysis, and scientific writing.  \n•\tDeveloped and implemented subject recruitment plans, identified barriers to patient enrollment, tracked enrollment toward goals, and worked with an interdisciplinary team of researchers and medical personnel. \n•\tResearch provided the motivation to make the intervention available to the public. Research Assistant University of Pittsburgh 2002  –  2004  (2 years) Arthritis Institute Lupus Center of Excellence •\tDeveloped and validated a novel system to measure vascular stiffness through ex-vivo perfusion testing in a murine model of systemic lupus erythematosus.  \n•\tPerformed animal dissection and testing, histochemical analyses, and mechanical testing. Research Assistant University of Pittsburgh 2002  –  2004  (2 years) Arthritis Institute Lupus Center of Excellence •\tDeveloped and validated a novel system to measure vascular stiffness through ex-vivo perfusion testing in a murine model of systemic lupus erythematosus.  \n•\tPerformed animal dissection and testing, histochemical analyses, and mechanical testing. Skills Biomechanics Motion Analysis Technical Writing Biomedical Engineering R&D Medical Devices Research Gait Analysis MRI Statistics Data Analysis Grant Writing Clinical Research Scientific Writing Orthopedic Bioengineering Science Medical Imaging See 3+     See less Skills  Biomechanics Motion Analysis Technical Writing Biomedical Engineering R&D Medical Devices Research Gait Analysis MRI Statistics Data Analysis Grant Writing Clinical Research Scientific Writing Orthopedic Bioengineering Science Medical Imaging See 3+     See less Biomechanics Motion Analysis Technical Writing Biomedical Engineering R&D Medical Devices Research Gait Analysis MRI Statistics Data Analysis Grant Writing Clinical Research Scientific Writing Orthopedic Bioengineering Science Medical Imaging See 3+     See less Biomechanics Motion Analysis Technical Writing Biomedical Engineering R&D Medical Devices Research Gait Analysis MRI Statistics Data Analysis Grant Writing Clinical Research Scientific Writing Orthopedic Bioengineering Science Medical Imaging See 3+     See less Education Stanford University MS, PhD,  Mechanical Engineering 2004  – 2008 Depth in Biomechanical Engineering  \n \nThesis: Efficacy of a variable-stiffness footwear intervention for treatment of medial compartment knee osteoarthritis \n \nAdvisor: Thomas Andriacchi, Ph.D. \n \nNational Science Foundation Graduate Research Fellowship \nVeterans Affairs Pre-Doctoral Associated Health Rehabilitation Research Fellowship Penn State University BS,  Mechanical Engineering 2000  – 2004 Minor in Bioengineering \n \nSchreyer Honors College Thesis: Development of a murine model of cardiovascular disease in systemic lupus erythematosus \n \nBarry M. Goldwater Scholar \nPenn State College of Engineering Student Marshal Stanford University MS, PhD,  Mechanical Engineering 2004  – 2008 Depth in Biomechanical Engineering  \n \nThesis: Efficacy of a variable-stiffness footwear intervention for treatment of medial compartment knee osteoarthritis \n \nAdvisor: Thomas Andriacchi, Ph.D. \n \nNational Science Foundation Graduate Research Fellowship \nVeterans Affairs Pre-Doctoral Associated Health Rehabilitation Research Fellowship Stanford University MS, PhD,  Mechanical Engineering 2004  – 2008 Depth in Biomechanical Engineering  \n \nThesis: Efficacy of a variable-stiffness footwear intervention for treatment of medial compartment knee osteoarthritis \n \nAdvisor: Thomas Andriacchi, Ph.D. \n \nNational Science Foundation Graduate Research Fellowship \nVeterans Affairs Pre-Doctoral Associated Health Rehabilitation Research Fellowship Stanford University MS, PhD,  Mechanical Engineering 2004  – 2008 Depth in Biomechanical Engineering  \n \nThesis: Efficacy of a variable-stiffness footwear intervention for treatment of medial compartment knee osteoarthritis \n \nAdvisor: Thomas Andriacchi, Ph.D. \n \nNational Science Foundation Graduate Research Fellowship \nVeterans Affairs Pre-Doctoral Associated Health Rehabilitation Research Fellowship Penn State University BS,  Mechanical Engineering 2000  – 2004 Minor in Bioengineering \n \nSchreyer Honors College Thesis: Development of a murine model of cardiovascular disease in systemic lupus erythematosus \n \nBarry M. Goldwater Scholar \nPenn State College of Engineering Student Marshal Penn State University BS,  Mechanical Engineering 2000  – 2004 Minor in Bioengineering \n \nSchreyer Honors College Thesis: Development of a murine model of cardiovascular disease in systemic lupus erythematosus \n \nBarry M. Goldwater Scholar \nPenn State College of Engineering Student Marshal Penn State University BS,  Mechanical Engineering 2000  – 2004 Minor in Bioengineering \n \nSchreyer Honors College Thesis: Development of a murine model of cardiovascular disease in systemic lupus erythematosus \n \nBarry M. Goldwater Scholar \nPenn State College of Engineering Student Marshal ", "Skills Entrepreneurship Skills  Entrepreneurship Entrepreneurship Entrepreneurship ", "Skills Programming High Performance... Aerodynamics CAD Aerospace Aeronautics Engineering Fortran Matlab C++ Python CFD Finite Element Analysis Numerical Analysis Aircraft Design Mechanical Engineering Software Engineering Catia Systems Engineering Engineering Management Modeling Solidworks HPCC Cloud Computing Wind Tunnel Testing Fluid Dynamics Aerospace Engineering Physics Simulations Optimization ANSYS Numerical Simulation Heat Transfer Thermodynamics See 19+     See less Skills  Programming High Performance... Aerodynamics CAD Aerospace Aeronautics Engineering Fortran Matlab C++ Python CFD Finite Element Analysis Numerical Analysis Aircraft Design Mechanical Engineering Software Engineering Catia Systems Engineering Engineering Management Modeling Solidworks HPCC Cloud Computing Wind Tunnel Testing Fluid Dynamics Aerospace Engineering Physics Simulations Optimization ANSYS Numerical Simulation Heat Transfer Thermodynamics See 19+     See less Programming High Performance... Aerodynamics CAD Aerospace Aeronautics Engineering Fortran Matlab C++ Python CFD Finite Element Analysis Numerical Analysis Aircraft Design Mechanical Engineering Software Engineering Catia Systems Engineering Engineering Management Modeling Solidworks HPCC Cloud Computing Wind Tunnel Testing Fluid Dynamics Aerospace Engineering Physics Simulations Optimization ANSYS Numerical Simulation Heat Transfer Thermodynamics See 19+     See less Programming High Performance... Aerodynamics CAD Aerospace Aeronautics Engineering Fortran Matlab C++ Python CFD Finite Element Analysis Numerical Analysis Aircraft Design Mechanical Engineering Software Engineering Catia Systems Engineering Engineering Management Modeling Solidworks HPCC Cloud Computing Wind Tunnel Testing Fluid Dynamics Aerospace Engineering Physics Simulations Optimization ANSYS Numerical Simulation Heat Transfer Thermodynamics See 19+     See less ", "Experience Edward B. Diethrich Associate Professor of Surgery and Biomedical Engineering University of Michigan August 2014  – Present (1 year 1 month) Ann Arbor, MI Associate Editor ASME Journal of Biomechanical Engineering June 2015  – Present (3 months) http://biomechanical.asmedigitalcollection.asme.org/journal.aspx Honorary Senior Lecturer in Biomedical Engineering King's College London June 2014  – Present (1 year 3 months) London, United Kingdom Member Board of Directors VPH Institute September 2013  – Present (2 years) http://www.vph-institute.org Medical Device Consultant Various Medical Device Companies May 2011  – Present (4 years 4 months) Editor Frontiers in Pediatric Cardiology October 2012  – Present (2 years 11 months) Guest Editor International Journal of Numerical Methods in Biomedical Engineering April 2012  – Present (3 years 5 months) Editor Journal of Endovascular Therapy January 2011  – Present (4 years 8 months) http://www.jevt.org/ Edward B. Diethrich Associate Professor of Surgery and Biomedical Engineering University of Michigan August 2014  – Present (1 year 1 month) Ann Arbor, MI Edward B. Diethrich Associate Professor of Surgery and Biomedical Engineering University of Michigan August 2014  – Present (1 year 1 month) Ann Arbor, MI Associate Editor ASME Journal of Biomechanical Engineering June 2015  – Present (3 months) http://biomechanical.asmedigitalcollection.asme.org/journal.aspx Associate Editor ASME Journal of Biomechanical Engineering June 2015  – Present (3 months) http://biomechanical.asmedigitalcollection.asme.org/journal.aspx Honorary Senior Lecturer in Biomedical Engineering King's College London June 2014  – Present (1 year 3 months) London, United Kingdom Honorary Senior Lecturer in Biomedical Engineering King's College London June 2014  – Present (1 year 3 months) London, United Kingdom Member Board of Directors VPH Institute September 2013  – Present (2 years) http://www.vph-institute.org Member Board of Directors VPH Institute September 2013  – Present (2 years) http://www.vph-institute.org Medical Device Consultant Various Medical Device Companies May 2011  – Present (4 years 4 months) Medical Device Consultant Various Medical Device Companies May 2011  – Present (4 years 4 months) Editor Frontiers in Pediatric Cardiology October 2012  – Present (2 years 11 months) Editor Frontiers in Pediatric Cardiology October 2012  – Present (2 years 11 months) Guest Editor International Journal of Numerical Methods in Biomedical Engineering April 2012  – Present (3 years 5 months) Guest Editor International Journal of Numerical Methods in Biomedical Engineering April 2012  – Present (3 years 5 months) Editor Journal of Endovascular Therapy January 2011  – Present (4 years 8 months) http://www.jevt.org/ Editor Journal of Endovascular Therapy January 2011  – Present (4 years 8 months) http://www.jevt.org/ Languages English Spanish French Galician English Spanish French Galician English Spanish French Galician Skills Biomedical Engineering Biomechanics Modeling Lifesciences Finite Element Analysis Mathematical Modeling Numerical Analysis Technical Writing Research R&D Simulations Medical Devices Applied Mathematics Mechanical Engineering Fluid-Structure... Clinical Research Life Sciences Physics Matlab See 4+     See less Skills  Biomedical Engineering Biomechanics Modeling Lifesciences Finite Element Analysis Mathematical Modeling Numerical Analysis Technical Writing Research R&D Simulations Medical Devices Applied Mathematics Mechanical Engineering Fluid-Structure... Clinical Research Life Sciences Physics Matlab See 4+     See less Biomedical Engineering Biomechanics Modeling Lifesciences Finite Element Analysis Mathematical Modeling Numerical Analysis Technical Writing Research R&D Simulations Medical Devices Applied Mathematics Mechanical Engineering Fluid-Structure... Clinical Research Life Sciences Physics Matlab See 4+     See less Biomedical Engineering Biomechanics Modeling Lifesciences Finite Element Analysis Mathematical Modeling Numerical Analysis Technical Writing Research R&D Simulations Medical Devices Applied Mathematics Mechanical Engineering Fluid-Structure... Clinical Research Life Sciences Physics Matlab See 4+     See less Education Stanford University Ph.D 2001  – 2006 Stanford University M.S. 1999  – 2001 Universidad de A Coruna B.S. and M.S. 1993  – 1998 Stanford University Ph.D 2001  – 2006 Stanford University Ph.D 2001  – 2006 Stanford University Ph.D 2001  – 2006 Stanford University M.S. 1999  – 2001 Stanford University M.S. 1999  – 2001 Stanford University M.S. 1999  – 2001 Universidad de A Coruna B.S. and M.S. 1993  – 1998 Universidad de A Coruna B.S. and M.S. 1993  – 1998 Universidad de A Coruna B.S. and M.S. 1993  – 1998 ", "Summary Extensive experience in all aspects of High Performance Computing (HPC): algorithms, processors, high performance networking, and storage. Specialties:C and C++ (including the use of MPI, OpenMP, and SIMD vectorization); Fortran 77, 90, & 95 (including the use of MPI and OpenMP); Python (including the use of F2PY, SWIG, and pyMPI); NVIDIA CUDA and OpenCL; Linux / UNIX and Mac OS X system administration Summary Extensive experience in all aspects of High Performance Computing (HPC): algorithms, processors, high performance networking, and storage. Specialties:C and C++ (including the use of MPI, OpenMP, and SIMD vectorization); Fortran 77, 90, & 95 (including the use of MPI and OpenMP); Python (including the use of F2PY, SWIG, and pyMPI); NVIDIA CUDA and OpenCL; Linux / UNIX and Mac OS X system administration Extensive experience in all aspects of High Performance Computing (HPC): algorithms, processors, high performance networking, and storage. Specialties:C and C++ (including the use of MPI, OpenMP, and SIMD vectorization); Fortran 77, 90, & 95 (including the use of MPI and OpenMP); Python (including the use of F2PY, SWIG, and pyMPI); NVIDIA CUDA and OpenCL; Linux / UNIX and Mac OS X system administration Extensive experience in all aspects of High Performance Computing (HPC): algorithms, processors, high performance networking, and storage. Specialties:C and C++ (including the use of MPI, OpenMP, and SIMD vectorization); Fortran 77, 90, & 95 (including the use of MPI and OpenMP); Python (including the use of F2PY, SWIG, and pyMPI); NVIDIA CUDA and OpenCL; Linux / UNIX and Mac OS X system administration Experience Research Scientist Baidu, Inc. 2015  – Present (less than a year) Sunnyvale, CA Lecturer Stanford University 2012  –  2015  (3 years) Stanford, CA Lecturer in the Institute for Computational and Mathematical Engineering (ICME) at Stanford University. Founding Engineer Clover January 2011  –  August 2011  (8 months) Machine learning for recommendation systems and data analytics using Hadoop and Apache Pig (MapReduce). Staff Engineer, Software Life Technologies (Applied Biosystems) July 2009  –  January 2011  (1 year 7 months) Collaborate on High Performance Computing (HPC) algorithms and system architecture design with business units in the Genetic Systems division. This includes SOLiD sequencing instruments, “Starlight” single molecule sequencing, and bioinformatics. Responsibilities include understanding computational algorithms, matching potential algorithms to appropriate hardware, and developing specifications for hardware. Also work to educate staff and managers in the division on HPC hardware, programming models, and algorithms through seminars. Senior Applied Engineer NVIDIA June 2007  –  July 2009  (2 years 2 months) Led the technical relationship with customers and partners in the areas of Computational Fluid Dynamics (CFD) and Finite Element Analysis (FEA). Primary duties included benchmarking, porting, and optimizing these applications for the CUDA GPU computing architecture. Co-developed and delivered (via conference presentations and webinars) training for CUDA developers. Created and analyzed benchmarks for future hardware development. Co-developed the CUDA Fortran language design specification in conjunction with The Portland Group (PGI). Developed, tested, documented, and maintained the Rocks cluster CUDA Roll. Engineering Research Associate Stanford University January 2006  –  June 2007  (1 year 6 months) Lead academic research staff member working with two graduate students on the porting of NSSUS (Navier-Stokes Stanford University Solver), a massively parallel Computational Fluid Dynamics (CFD) code for internal and external aerodynamics, to emerging multicore architectures such as the Cell Processor and GPU. The goal of this work was to demonstrate the feasibility of using accelerators for Department of Energy (DOE) Advanced Simulation and Computing (ASC) class applications. HPC Specialist Penguin Computing / Scyld Software 2004  –  2005  (1 year) Provided porting, profiling, and benchmarking support for both in-house and commercial science and engineering applications running on the Scyld Beowulf cluster operating system. Research Scientist Baidu, Inc. 2015  – Present (less than a year) Sunnyvale, CA Research Scientist Baidu, Inc. 2015  – Present (less than a year) Sunnyvale, CA Lecturer Stanford University 2012  –  2015  (3 years) Stanford, CA Lecturer in the Institute for Computational and Mathematical Engineering (ICME) at Stanford University. Lecturer Stanford University 2012  –  2015  (3 years) Stanford, CA Lecturer in the Institute for Computational and Mathematical Engineering (ICME) at Stanford University. Founding Engineer Clover January 2011  –  August 2011  (8 months) Machine learning for recommendation systems and data analytics using Hadoop and Apache Pig (MapReduce). Founding Engineer Clover January 2011  –  August 2011  (8 months) Machine learning for recommendation systems and data analytics using Hadoop and Apache Pig (MapReduce). Staff Engineer, Software Life Technologies (Applied Biosystems) July 2009  –  January 2011  (1 year 7 months) Collaborate on High Performance Computing (HPC) algorithms and system architecture design with business units in the Genetic Systems division. This includes SOLiD sequencing instruments, “Starlight” single molecule sequencing, and bioinformatics. Responsibilities include understanding computational algorithms, matching potential algorithms to appropriate hardware, and developing specifications for hardware. Also work to educate staff and managers in the division on HPC hardware, programming models, and algorithms through seminars. Staff Engineer, Software Life Technologies (Applied Biosystems) July 2009  –  January 2011  (1 year 7 months) Collaborate on High Performance Computing (HPC) algorithms and system architecture design with business units in the Genetic Systems division. This includes SOLiD sequencing instruments, “Starlight” single molecule sequencing, and bioinformatics. Responsibilities include understanding computational algorithms, matching potential algorithms to appropriate hardware, and developing specifications for hardware. Also work to educate staff and managers in the division on HPC hardware, programming models, and algorithms through seminars. Senior Applied Engineer NVIDIA June 2007  –  July 2009  (2 years 2 months) Led the technical relationship with customers and partners in the areas of Computational Fluid Dynamics (CFD) and Finite Element Analysis (FEA). Primary duties included benchmarking, porting, and optimizing these applications for the CUDA GPU computing architecture. Co-developed and delivered (via conference presentations and webinars) training for CUDA developers. Created and analyzed benchmarks for future hardware development. Co-developed the CUDA Fortran language design specification in conjunction with The Portland Group (PGI). Developed, tested, documented, and maintained the Rocks cluster CUDA Roll. Senior Applied Engineer NVIDIA June 2007  –  July 2009  (2 years 2 months) Led the technical relationship with customers and partners in the areas of Computational Fluid Dynamics (CFD) and Finite Element Analysis (FEA). Primary duties included benchmarking, porting, and optimizing these applications for the CUDA GPU computing architecture. Co-developed and delivered (via conference presentations and webinars) training for CUDA developers. Created and analyzed benchmarks for future hardware development. Co-developed the CUDA Fortran language design specification in conjunction with The Portland Group (PGI). Developed, tested, documented, and maintained the Rocks cluster CUDA Roll. Engineering Research Associate Stanford University January 2006  –  June 2007  (1 year 6 months) Lead academic research staff member working with two graduate students on the porting of NSSUS (Navier-Stokes Stanford University Solver), a massively parallel Computational Fluid Dynamics (CFD) code for internal and external aerodynamics, to emerging multicore architectures such as the Cell Processor and GPU. The goal of this work was to demonstrate the feasibility of using accelerators for Department of Energy (DOE) Advanced Simulation and Computing (ASC) class applications. Engineering Research Associate Stanford University January 2006  –  June 2007  (1 year 6 months) Lead academic research staff member working with two graduate students on the porting of NSSUS (Navier-Stokes Stanford University Solver), a massively parallel Computational Fluid Dynamics (CFD) code for internal and external aerodynamics, to emerging multicore architectures such as the Cell Processor and GPU. The goal of this work was to demonstrate the feasibility of using accelerators for Department of Energy (DOE) Advanced Simulation and Computing (ASC) class applications. HPC Specialist Penguin Computing / Scyld Software 2004  –  2005  (1 year) Provided porting, profiling, and benchmarking support for both in-house and commercial science and engineering applications running on the Scyld Beowulf cluster operating system. HPC Specialist Penguin Computing / Scyld Software 2004  –  2005  (1 year) Provided porting, profiling, and benchmarking support for both in-house and commercial science and engineering applications running on the Scyld Beowulf cluster operating system. Skills MPI CUDA OpenMP Fortran CFD Optimization C++ GPGPU OpenCL Parallel Computing Parallel Programming Parallel Algorithms Parallel Processing Aerodynamics Threads Beowulf Clusters High Performance... Performance Tuning GPU Scientific Computing C Simulations Linux Algorithms Python See 10+     See less Skills  MPI CUDA OpenMP Fortran CFD Optimization C++ GPGPU OpenCL Parallel Computing Parallel Programming Parallel Algorithms Parallel Processing Aerodynamics Threads Beowulf Clusters High Performance... Performance Tuning GPU Scientific Computing C Simulations Linux Algorithms Python See 10+     See less MPI CUDA OpenMP Fortran CFD Optimization C++ GPGPU OpenCL Parallel Computing Parallel Programming Parallel Algorithms Parallel Processing Aerodynamics Threads Beowulf Clusters High Performance... Performance Tuning GPU Scientific Computing C Simulations Linux Algorithms Python See 10+     See less MPI CUDA OpenMP Fortran CFD Optimization C++ GPGPU OpenCL Parallel Computing Parallel Programming Parallel Algorithms Parallel Processing Aerodynamics Threads Beowulf Clusters High Performance... Performance Tuning GPU Scientific Computing C Simulations Linux Algorithms Python See 10+     See less Education Stanford University PhD,  Aeronautics and Astronautics 1999  – 2005 Stanford University MS,  Aeronautics and Astronautics 1998  – 1999 The University of Kansas BS,  Aerospace Engineering 1994  – 1998 Stanford University PhD,  Aeronautics and Astronautics 1999  – 2005 Stanford University PhD,  Aeronautics and Astronautics 1999  – 2005 Stanford University PhD,  Aeronautics and Astronautics 1999  – 2005 Stanford University MS,  Aeronautics and Astronautics 1998  – 1999 Stanford University MS,  Aeronautics and Astronautics 1998  – 1999 Stanford University MS,  Aeronautics and Astronautics 1998  – 1999 The University of Kansas BS,  Aerospace Engineering 1994  – 1998 The University of Kansas BS,  Aerospace Engineering 1994  – 1998 The University of Kansas BS,  Aerospace Engineering 1994  – 1998 ", "Summary Extensive experience in developing novel systems and algorithms for image retrieval, image analysis, image processing, machine learning, and augmented reality. Designed and implemented real-time applications on phones, tablets, smart glasses, and smart TVs in many projects. \n \nProgrammed routinely in C/C++, Java, Python, PHP, Javascript, Objective-C, Symbian-C, and MATLAB/Octave. Familiar with OpenCV and OpenGL. Developed numerous applications on Android, iOS, Symbian, Maemo, Unix/Linux, Macintosh, and Windows. Summary Extensive experience in developing novel systems and algorithms for image retrieval, image analysis, image processing, machine learning, and augmented reality. Designed and implemented real-time applications on phones, tablets, smart glasses, and smart TVs in many projects. \n \nProgrammed routinely in C/C++, Java, Python, PHP, Javascript, Objective-C, Symbian-C, and MATLAB/Octave. Familiar with OpenCV and OpenGL. Developed numerous applications on Android, iOS, Symbian, Maemo, Unix/Linux, Macintosh, and Windows. Extensive experience in developing novel systems and algorithms for image retrieval, image analysis, image processing, machine learning, and augmented reality. Designed and implemented real-time applications on phones, tablets, smart glasses, and smart TVs in many projects. \n \nProgrammed routinely in C/C++, Java, Python, PHP, Javascript, Objective-C, Symbian-C, and MATLAB/Octave. Familiar with OpenCV and OpenGL. Developed numerous applications on Android, iOS, Symbian, Maemo, Unix/Linux, Macintosh, and Windows. Extensive experience in developing novel systems and algorithms for image retrieval, image analysis, image processing, machine learning, and augmented reality. Designed and implemented real-time applications on phones, tablets, smart glasses, and smart TVs in many projects. \n \nProgrammed routinely in C/C++, Java, Python, PHP, Javascript, Objective-C, Symbian-C, and MATLAB/Octave. Familiar with OpenCV and OpenGL. Developed numerous applications on Android, iOS, Symbian, Maemo, Unix/Linux, Macintosh, and Windows. Experience Engineering Research Associate Stanford University May 2014  –  October 2014  (6 months) Stanford, California, USA • Developed mobile augmented reality system on smart glasses. \n• Created mobile augmented reality system for art recognition. \n• Created system for searching news videos based on image queries. Research Intern Nokia Research Center April 2009  –  March 2012  (3 years) Palo Alto, California, USA • Developed landmark recognition system.  \n• Developed road sign recognition system.  \n• Developed product recognition system.  \n• Invented algorithms for large-scale image retrieval.  \n• Contributed to standardization of compact descriptors for visual search.  \n• Research resulted in 11 peer-reviewed publications and multiple patent applications. Research Intern Deutsche Telekom AG January 2008  –  April 2011  (3 years 4 months) Los Altos, California, USA • Developed system for media cover recognition.  \n• Developed system for asset management (including recognition) of book spines.  \n• Research resulted in 11 peer-reviewed publications and a patent application. Image Processing Engineer 3D Geo, Inc. June 2007  –  September 2007  (4 months) Santa Clara, California, USA • Developed techniques for fast rendering and visualization of 3D volumes typically encountered in seismic imaging.  \n• Research resulted in publication in American Geophysical Union Annual Conference. Research Intern Department of Geophysics at Stanford June 2006  –  January 2007  (8 months) Stanford, California, USA • Created new data fusion algorithms for merging high-frequency and low-frequency images.  \n• Developed new algorithm for projecting paths in seismic volumes.  \n• Research resulted in publication in American Geophysical Union Annual Conference. Research Intern Space, Telecommunications, and Radioscience Laboratory at Stanford June 2005  –  April 2006  (11 months) Stanford, California, USA • Developed pattern recognition algorithms for locating echoes in plasmagrams.  \n• Successfully applied algorithms to NASA satellite data.  \n• Research resulted in publication in Journal of Geophysical Research. Research Intern Stanford Linear Accelerator Center June 2003  –  September 2004  (1 year 4 months) Menlo Park, California, USA • Developed statistical models for the behavior of large ensembles of particles.  \n• Created simulations of particle bombardment on sensitive detector equipment.  \n• Research resulted in publication in European Particle Accelerator Conference. Engineering Research Associate Stanford University May 2014  –  October 2014  (6 months) Stanford, California, USA • Developed mobile augmented reality system on smart glasses. \n• Created mobile augmented reality system for art recognition. \n• Created system for searching news videos based on image queries. Engineering Research Associate Stanford University May 2014  –  October 2014  (6 months) Stanford, California, USA • Developed mobile augmented reality system on smart glasses. \n• Created mobile augmented reality system for art recognition. \n• Created system for searching news videos based on image queries. Research Intern Nokia Research Center April 2009  –  March 2012  (3 years) Palo Alto, California, USA • Developed landmark recognition system.  \n• Developed road sign recognition system.  \n• Developed product recognition system.  \n• Invented algorithms for large-scale image retrieval.  \n• Contributed to standardization of compact descriptors for visual search.  \n• Research resulted in 11 peer-reviewed publications and multiple patent applications. Research Intern Nokia Research Center April 2009  –  March 2012  (3 years) Palo Alto, California, USA • Developed landmark recognition system.  \n• Developed road sign recognition system.  \n• Developed product recognition system.  \n• Invented algorithms for large-scale image retrieval.  \n• Contributed to standardization of compact descriptors for visual search.  \n• Research resulted in 11 peer-reviewed publications and multiple patent applications. Research Intern Deutsche Telekom AG January 2008  –  April 2011  (3 years 4 months) Los Altos, California, USA • Developed system for media cover recognition.  \n• Developed system for asset management (including recognition) of book spines.  \n• Research resulted in 11 peer-reviewed publications and a patent application. Research Intern Deutsche Telekom AG January 2008  –  April 2011  (3 years 4 months) Los Altos, California, USA • Developed system for media cover recognition.  \n• Developed system for asset management (including recognition) of book spines.  \n• Research resulted in 11 peer-reviewed publications and a patent application. Image Processing Engineer 3D Geo, Inc. June 2007  –  September 2007  (4 months) Santa Clara, California, USA • Developed techniques for fast rendering and visualization of 3D volumes typically encountered in seismic imaging.  \n• Research resulted in publication in American Geophysical Union Annual Conference. Image Processing Engineer 3D Geo, Inc. June 2007  –  September 2007  (4 months) Santa Clara, California, USA • Developed techniques for fast rendering and visualization of 3D volumes typically encountered in seismic imaging.  \n• Research resulted in publication in American Geophysical Union Annual Conference. Research Intern Department of Geophysics at Stanford June 2006  –  January 2007  (8 months) Stanford, California, USA • Created new data fusion algorithms for merging high-frequency and low-frequency images.  \n• Developed new algorithm for projecting paths in seismic volumes.  \n• Research resulted in publication in American Geophysical Union Annual Conference. Research Intern Department of Geophysics at Stanford June 2006  –  January 2007  (8 months) Stanford, California, USA • Created new data fusion algorithms for merging high-frequency and low-frequency images.  \n• Developed new algorithm for projecting paths in seismic volumes.  \n• Research resulted in publication in American Geophysical Union Annual Conference. Research Intern Space, Telecommunications, and Radioscience Laboratory at Stanford June 2005  –  April 2006  (11 months) Stanford, California, USA • Developed pattern recognition algorithms for locating echoes in plasmagrams.  \n• Successfully applied algorithms to NASA satellite data.  \n• Research resulted in publication in Journal of Geophysical Research. Research Intern Space, Telecommunications, and Radioscience Laboratory at Stanford June 2005  –  April 2006  (11 months) Stanford, California, USA • Developed pattern recognition algorithms for locating echoes in plasmagrams.  \n• Successfully applied algorithms to NASA satellite data.  \n• Research resulted in publication in Journal of Geophysical Research. Research Intern Stanford Linear Accelerator Center June 2003  –  September 2004  (1 year 4 months) Menlo Park, California, USA • Developed statistical models for the behavior of large ensembles of particles.  \n• Created simulations of particle bombardment on sensitive detector equipment.  \n• Research resulted in publication in European Particle Accelerator Conference. Research Intern Stanford Linear Accelerator Center June 2003  –  September 2004  (1 year 4 months) Menlo Park, California, USA • Developed statistical models for the behavior of large ensembles of particles.  \n• Created simulations of particle bombardment on sensitive detector equipment.  \n• Research resulted in publication in European Particle Accelerator Conference. Languages Chinese English Chinese English Chinese English Skills Image Processing Algorithms Signal Processing Computer Vision Pattern Recognition Digital Image Processing Simulations Machine Learning Software Development Matlab C++ Mobile Applications Video Compression Image Analysis Computer Science Image Compression C OpenCV Software Engineering Python Algorithm Design Distributed Systems Data Mining Digital Signal... LaTeX Optimization Computational... Optimizations OpenGL Embedded Systems Programming Computer Architecture Java Augmented Reality Linux Android Computer Graphics Technical Publication PHP HTML Eclipse Artificial Intelligence Mobile Devices Unix Git Subversion See 31+     See less Skills  Image Processing Algorithms Signal Processing Computer Vision Pattern Recognition Digital Image Processing Simulations Machine Learning Software Development Matlab C++ Mobile Applications Video Compression Image Analysis Computer Science Image Compression C OpenCV Software Engineering Python Algorithm Design Distributed Systems Data Mining Digital Signal... LaTeX Optimization Computational... Optimizations OpenGL Embedded Systems Programming Computer Architecture Java Augmented Reality Linux Android Computer Graphics Technical Publication PHP HTML Eclipse Artificial Intelligence Mobile Devices Unix Git Subversion See 31+     See less Image Processing Algorithms Signal Processing Computer Vision Pattern Recognition Digital Image Processing Simulations Machine Learning Software Development Matlab C++ Mobile Applications Video Compression Image Analysis Computer Science Image Compression C OpenCV Software Engineering Python Algorithm Design Distributed Systems Data Mining Digital Signal... LaTeX Optimization Computational... Optimizations OpenGL Embedded Systems Programming Computer Architecture Java Augmented Reality Linux Android Computer Graphics Technical Publication PHP HTML Eclipse Artificial Intelligence Mobile Devices Unix Git Subversion See 31+     See less Image Processing Algorithms Signal Processing Computer Vision Pattern Recognition Digital Image Processing Simulations Machine Learning Software Development Matlab C++ Mobile Applications Video Compression Image Analysis Computer Science Image Compression C OpenCV Software Engineering Python Algorithm Design Distributed Systems Data Mining Digital Signal... LaTeX Optimization Computational... Optimizations OpenGL Embedded Systems Programming Computer Architecture Java Augmented Reality Linux Android Computer Graphics Technical Publication PHP HTML Eclipse Artificial Intelligence Mobile Devices Unix Git Subversion See 31+     See less Education Stanford University Doctor of Philosophy,  Electrical Engineering , 4.09/4.00 2008  – 2014 Stanford University Master of Science,  Electrical Engineering , 4.02/4.00 2007  – 2008 Studied image processing and imaging systems. Activities and Societies:  Image and Signal Processing Stanford University Bachelor of Science,  Electrical Engineering , 3.92/4.00 2003  – 2006 Studied signal and image processing. Activities and Societies:  Graduated with Distinction Stanford University Doctor of Philosophy,  Electrical Engineering , 4.09/4.00 2008  – 2014 Stanford University Doctor of Philosophy,  Electrical Engineering , 4.09/4.00 2008  – 2014 Stanford University Doctor of Philosophy,  Electrical Engineering , 4.09/4.00 2008  – 2014 Stanford University Master of Science,  Electrical Engineering , 4.02/4.00 2007  – 2008 Studied image processing and imaging systems. Activities and Societies:  Image and Signal Processing Stanford University Master of Science,  Electrical Engineering , 4.02/4.00 2007  – 2008 Studied image processing and imaging systems. Activities and Societies:  Image and Signal Processing Stanford University Master of Science,  Electrical Engineering , 4.02/4.00 2007  – 2008 Studied image processing and imaging systems. Activities and Societies:  Image and Signal Processing Stanford University Bachelor of Science,  Electrical Engineering , 3.92/4.00 2003  – 2006 Studied signal and image processing. Activities and Societies:  Graduated with Distinction Stanford University Bachelor of Science,  Electrical Engineering , 3.92/4.00 2003  – 2006 Studied signal and image processing. Activities and Societies:  Graduated with Distinction Stanford University Bachelor of Science,  Electrical Engineering , 3.92/4.00 2003  – 2006 Studied signal and image processing. Activities and Societies:  Graduated with Distinction Honors & Awards Additional Honors & Awards Capocelli Award for Best Student Paper, Data Compression Conference (2014) \nFellow of the Brown Institute for Media Innovation (2012-2014) \nSchool of Engineering, Centennial Teaching Assistant Award (Spring 2012) \nDepartment of Electrical Engineering, Outstanding Teaching Assistant Award (Spring 2010) Additional Honors & Awards Capocelli Award for Best Student Paper, Data Compression Conference (2014) \nFellow of the Brown Institute for Media Innovation (2012-2014) \nSchool of Engineering, Centennial Teaching Assistant Award (Spring 2012) \nDepartment of Electrical Engineering, Outstanding Teaching Assistant Award (Spring 2010) Additional Honors & Awards Capocelli Award for Best Student Paper, Data Compression Conference (2014) \nFellow of the Brown Institute for Media Innovation (2012-2014) \nSchool of Engineering, Centennial Teaching Assistant Award (Spring 2012) \nDepartment of Electrical Engineering, Outstanding Teaching Assistant Award (Spring 2010) Additional Honors & Awards Capocelli Award for Best Student Paper, Data Compression Conference (2014) \nFellow of the Brown Institute for Media Innovation (2012-2014) \nSchool of Engineering, Centennial Teaching Assistant Award (Spring 2012) \nDepartment of Electrical Engineering, Outstanding Teaching Assistant Award (Spring 2010) "]}