{"position": "Enterprise Architect", "company": "Intel Corporation", "profiles": ["Summary Enterprise Architect responsible for the strategic and solution architecture supporting Intel Corporate Services application portfolio which encompassed a broad range of capabilities including corporate real estate, construction management, finance, facilities operations, EHS, corporate security, and global services. Responsible for design and integration of Enterprise solutions, project review and governance of all Corporate Services architecture. Key influencer of IT strategies related to emerging technologies, adoption and proliferation of service oriented architecture, data management, business intelligence, and mobile application development. Summary Enterprise Architect responsible for the strategic and solution architecture supporting Intel Corporate Services application portfolio which encompassed a broad range of capabilities including corporate real estate, construction management, finance, facilities operations, EHS, corporate security, and global services. Responsible for design and integration of Enterprise solutions, project review and governance of all Corporate Services architecture. Key influencer of IT strategies related to emerging technologies, adoption and proliferation of service oriented architecture, data management, business intelligence, and mobile application development. Enterprise Architect responsible for the strategic and solution architecture supporting Intel Corporate Services application portfolio which encompassed a broad range of capabilities including corporate real estate, construction management, finance, facilities operations, EHS, corporate security, and global services. Responsible for design and integration of Enterprise solutions, project review and governance of all Corporate Services architecture. Key influencer of IT strategies related to emerging technologies, adoption and proliferation of service oriented architecture, data management, business intelligence, and mobile application development. Enterprise Architect responsible for the strategic and solution architecture supporting Intel Corporate Services application portfolio which encompassed a broad range of capabilities including corporate real estate, construction management, finance, facilities operations, EHS, corporate security, and global services. Responsible for design and integration of Enterprise solutions, project review and governance of all Corporate Services architecture. Key influencer of IT strategies related to emerging technologies, adoption and proliferation of service oriented architecture, data management, business intelligence, and mobile application development. Experience Enterprise Architect Intel Corporation February 2011  – Present (4 years 7 months) Enterprise Architect responsible for the strategic and solution architecture supporting Intel Corporate Services application portfolio which encompassed a broad range of capabilities including corporate real estate, construction management, finance, facilities operations, EHS, corporate security, and global services. Responsible for design and integration of Enterprise solutions, project review and governance of all Corporate Services architecture. Key influencer of IT strategies related to emerging technologies, adoption and proliferation of service oriented architecture, data management, business intelligence, and mobile application development. Software Solutions Architect - IOTG Intel Corporation May 2015  –  May 2015  (1 month) Chandler, Arizona Sabbatical coverage DOT assignment working as software solution architect within a embedded products development team. Sr. Systems Analyst Intel Corporation March 2004  –  February 2011  (7 years) Sr. Systems Administrator Core3 Solutions July 2003  –  July 2004  (1 year 1 month) Projects included:  \nExchange 5.5 to Exchange 2003 migration  \nActive Directory migration / consolidation  \nNetApp implementation using iSCSI  \nADP Oracle upgrade,  \nUpgrade Citrix server farm  \nDeploy .NET web applications Sr. Systems Administrator Genuity October 2000  –  August 2002  (1 year 11 months) 3rd-Tier problem resolution, on-call support, and incident response for managed web hosting services including disaster recovery and security intrusions, hardware/software upgrades  \nProject Lead for server upgrades, web migrations, patch deployment Sr. Network Engineer CopperKey Technologies February 2000  –  October 2000  (9 months) Technical Analyst II Inacom Information Systems December 1998  –  February 2000  (1 year 3 months) Enterprise Architect Intel Corporation February 2011  – Present (4 years 7 months) Enterprise Architect responsible for the strategic and solution architecture supporting Intel Corporate Services application portfolio which encompassed a broad range of capabilities including corporate real estate, construction management, finance, facilities operations, EHS, corporate security, and global services. Responsible for design and integration of Enterprise solutions, project review and governance of all Corporate Services architecture. Key influencer of IT strategies related to emerging technologies, adoption and proliferation of service oriented architecture, data management, business intelligence, and mobile application development. Enterprise Architect Intel Corporation February 2011  – Present (4 years 7 months) Enterprise Architect responsible for the strategic and solution architecture supporting Intel Corporate Services application portfolio which encompassed a broad range of capabilities including corporate real estate, construction management, finance, facilities operations, EHS, corporate security, and global services. Responsible for design and integration of Enterprise solutions, project review and governance of all Corporate Services architecture. Key influencer of IT strategies related to emerging technologies, adoption and proliferation of service oriented architecture, data management, business intelligence, and mobile application development. Software Solutions Architect - IOTG Intel Corporation May 2015  –  May 2015  (1 month) Chandler, Arizona Sabbatical coverage DOT assignment working as software solution architect within a embedded products development team. Software Solutions Architect - IOTG Intel Corporation May 2015  –  May 2015  (1 month) Chandler, Arizona Sabbatical coverage DOT assignment working as software solution architect within a embedded products development team. Sr. Systems Analyst Intel Corporation March 2004  –  February 2011  (7 years) Sr. Systems Analyst Intel Corporation March 2004  –  February 2011  (7 years) Sr. Systems Administrator Core3 Solutions July 2003  –  July 2004  (1 year 1 month) Projects included:  \nExchange 5.5 to Exchange 2003 migration  \nActive Directory migration / consolidation  \nNetApp implementation using iSCSI  \nADP Oracle upgrade,  \nUpgrade Citrix server farm  \nDeploy .NET web applications Sr. Systems Administrator Core3 Solutions July 2003  –  July 2004  (1 year 1 month) Projects included:  \nExchange 5.5 to Exchange 2003 migration  \nActive Directory migration / consolidation  \nNetApp implementation using iSCSI  \nADP Oracle upgrade,  \nUpgrade Citrix server farm  \nDeploy .NET web applications Sr. Systems Administrator Genuity October 2000  –  August 2002  (1 year 11 months) 3rd-Tier problem resolution, on-call support, and incident response for managed web hosting services including disaster recovery and security intrusions, hardware/software upgrades  \nProject Lead for server upgrades, web migrations, patch deployment Sr. Systems Administrator Genuity October 2000  –  August 2002  (1 year 11 months) 3rd-Tier problem resolution, on-call support, and incident response for managed web hosting services including disaster recovery and security intrusions, hardware/software upgrades  \nProject Lead for server upgrades, web migrations, patch deployment Sr. Network Engineer CopperKey Technologies February 2000  –  October 2000  (9 months) Sr. Network Engineer CopperKey Technologies February 2000  –  October 2000  (9 months) Technical Analyst II Inacom Information Systems December 1998  –  February 2000  (1 year 3 months) Technical Analyst II Inacom Information Systems December 1998  –  February 2000  (1 year 3 months) Skills Active Directory Servers Disaster Recovery Microsoft Exchange Security Oracle Virtualization SDLC Cross-functional Team... Project Management Agile Methodologies SharePoint IIS Visio Resourceful... Integration Requirements Analysis Software Documentation Microsoft SQL Server Cloud Computing ITIL Process Improvement Enterprise Architecture Business Objects Team Leadership Business Process... Scrum Perl Windows Server PMP Software Project... Data Center IT Management Software Development Software Solution... Software Architectural... Enterprise Software Architecture Solution Architecture Networking System Architecture Strategy Web Applications System Deployment See 29+     See less Skills  Active Directory Servers Disaster Recovery Microsoft Exchange Security Oracle Virtualization SDLC Cross-functional Team... Project Management Agile Methodologies SharePoint IIS Visio Resourceful... Integration Requirements Analysis Software Documentation Microsoft SQL Server Cloud Computing ITIL Process Improvement Enterprise Architecture Business Objects Team Leadership Business Process... Scrum Perl Windows Server PMP Software Project... Data Center IT Management Software Development Software Solution... Software Architectural... Enterprise Software Architecture Solution Architecture Networking System Architecture Strategy Web Applications System Deployment See 29+     See less Active Directory Servers Disaster Recovery Microsoft Exchange Security Oracle Virtualization SDLC Cross-functional Team... Project Management Agile Methodologies SharePoint IIS Visio Resourceful... Integration Requirements Analysis Software Documentation Microsoft SQL Server Cloud Computing ITIL Process Improvement Enterprise Architecture Business Objects Team Leadership Business Process... Scrum Perl Windows Server PMP Software Project... Data Center IT Management Software Development Software Solution... Software Architectural... Enterprise Software Architecture Solution Architecture Networking System Architecture Strategy Web Applications System Deployment See 29+     See less Active Directory Servers Disaster Recovery Microsoft Exchange Security Oracle Virtualization SDLC Cross-functional Team... Project Management Agile Methodologies SharePoint IIS Visio Resourceful... Integration Requirements Analysis Software Documentation Microsoft SQL Server Cloud Computing ITIL Process Improvement Enterprise Architecture Business Objects Team Leadership Business Process... Scrum Perl Windows Server PMP Software Project... Data Center IT Management Software Development Software Solution... Software Architectural... Enterprise Software Architecture Solution Architecture Networking System Architecture Strategy Web Applications System Deployment See 29+     See less Education Arizona State University B.S.,  Liberal Arts 1989  – 1992 Arizona State University B.S.,  Liberal Arts 1989  – 1992 Arizona State University B.S.,  Liberal Arts 1989  – 1992 Arizona State University B.S.,  Liberal Arts 1989  – 1992 ", "Summary I have more than 20 years of experience designing and developing software applications for Intel Corporation, and have successfully taken many projects through the full software development life-cycle. My areas of expertise include architecture design for large and complex business software applications, software reuse, software development life-cycles (especially agile methods), service-oriented architecture, enterprise architecture process and governance, project management and team leadership. I am also certified as an IT Master Architect by the Open Group. In my current role, I am focused on developing strategic and solution architectures, and roadmaps for Intel's Identity and Access Management platform. My primary goal is to be a technical leader. I want to develop high quality, leading edge solutions for my customers and work hard to ensure results are delivered on schedule, minimizing bureaucracy along the way. Summary I have more than 20 years of experience designing and developing software applications for Intel Corporation, and have successfully taken many projects through the full software development life-cycle. My areas of expertise include architecture design for large and complex business software applications, software reuse, software development life-cycles (especially agile methods), service-oriented architecture, enterprise architecture process and governance, project management and team leadership. I am also certified as an IT Master Architect by the Open Group. In my current role, I am focused on developing strategic and solution architectures, and roadmaps for Intel's Identity and Access Management platform. My primary goal is to be a technical leader. I want to develop high quality, leading edge solutions for my customers and work hard to ensure results are delivered on schedule, minimizing bureaucracy along the way. I have more than 20 years of experience designing and developing software applications for Intel Corporation, and have successfully taken many projects through the full software development life-cycle. My areas of expertise include architecture design for large and complex business software applications, software reuse, software development life-cycles (especially agile methods), service-oriented architecture, enterprise architecture process and governance, project management and team leadership. I am also certified as an IT Master Architect by the Open Group. In my current role, I am focused on developing strategic and solution architectures, and roadmaps for Intel's Identity and Access Management platform. My primary goal is to be a technical leader. I want to develop high quality, leading edge solutions for my customers and work hard to ensure results are delivered on schedule, minimizing bureaucracy along the way. I have more than 20 years of experience designing and developing software applications for Intel Corporation, and have successfully taken many projects through the full software development life-cycle. My areas of expertise include architecture design for large and complex business software applications, software reuse, software development life-cycles (especially agile methods), service-oriented architecture, enterprise architecture process and governance, project management and team leadership. I am also certified as an IT Master Architect by the Open Group. In my current role, I am focused on developing strategic and solution architectures, and roadmaps for Intel's Identity and Access Management platform. My primary goal is to be a technical leader. I want to develop high quality, leading edge solutions for my customers and work hard to ensure results are delivered on schedule, minimizing bureaucracy along the way. Experience Enterprise Architect Intel Corporation December 2007  – Present (7 years 9 months) Primarily responsible for developing the strategic architecture visions and roadmaps for large business problem domains. Recent engagements include developing architectures for Identity and Access Management (IAM), CRM solutions, Customer Master Data Management (MDM), User Registration and Profile Management, Product Issue Management, Application Lifecycle Management (ALM), SaaS and SOA reference architectures. Continued support for evolving Intel IT's Enterprise Architecture methodologies and tools. Lead Solution Architect Intel Corporation October 2003  –  November 2007  (4 years 2 months) Responsible for developing the solution architecture for many software applications across the Intel business landscape. This included engaging on many projects and programs to develop optimal architectural designs that maximize reuse of existings assets and minimize the total cost of ownership. Spent 2 years in EMEA region establishing architecture process and governance, and directing the solution architecture design across more than 30 projects. Upon returning to the US, spent time developing the architecture on several significant programs such as PLM and SOA. Other responsibilities included helping to establish the practice of Enterprise Architecture within Intel's IT organization. This involved the adoption of TOGAF ADM and E2AF. Internet Staff Manager Intel Corporation April 1999  –  October 2003  (4 years 7 months) Managed a large program using program management practices, which involved directing the work of more than 40 people to build a new scalable extranet server farm. This server farm was comprised of more than 100 servers and the flawless migration of more than 40 web-based applications used by thousands of users from the old environment to the new. Additionally, people managed a team of individual contributors responsible for the development, integration, deployment and support of core software capabilities hosted on Intel's supplier facing extranet, supplier.intel.com. This included implementing solutions such as user registration and entitlement, on-line collaboration and web portals. Senior Software Engineer Intel Corporation March 1996  –  March 1999  (3 years 1 month) Designed and implemented Intel's external (DMZ) internet user account management system, responsible for maintaining more than 1 million user accounts. Primary responsibility consisted of web page user interface implementation including support for delivering web pages in many different languages to enable users to log in, change their password, maintain their information and create a perception of a single login user experience across a large virtual mesh of heterogeneous computer systems. Also designed and implemented Intel's internal user account management system responsible for managing more than 500,000 accounts across hundreds of systems within Intel. Enterprise Architect Intel Corporation December 2007  – Present (7 years 9 months) Primarily responsible for developing the strategic architecture visions and roadmaps for large business problem domains. Recent engagements include developing architectures for Identity and Access Management (IAM), CRM solutions, Customer Master Data Management (MDM), User Registration and Profile Management, Product Issue Management, Application Lifecycle Management (ALM), SaaS and SOA reference architectures. Continued support for evolving Intel IT's Enterprise Architecture methodologies and tools. Enterprise Architect Intel Corporation December 2007  – Present (7 years 9 months) Primarily responsible for developing the strategic architecture visions and roadmaps for large business problem domains. Recent engagements include developing architectures for Identity and Access Management (IAM), CRM solutions, Customer Master Data Management (MDM), User Registration and Profile Management, Product Issue Management, Application Lifecycle Management (ALM), SaaS and SOA reference architectures. Continued support for evolving Intel IT's Enterprise Architecture methodologies and tools. Lead Solution Architect Intel Corporation October 2003  –  November 2007  (4 years 2 months) Responsible for developing the solution architecture for many software applications across the Intel business landscape. This included engaging on many projects and programs to develop optimal architectural designs that maximize reuse of existings assets and minimize the total cost of ownership. Spent 2 years in EMEA region establishing architecture process and governance, and directing the solution architecture design across more than 30 projects. Upon returning to the US, spent time developing the architecture on several significant programs such as PLM and SOA. Other responsibilities included helping to establish the practice of Enterprise Architecture within Intel's IT organization. This involved the adoption of TOGAF ADM and E2AF. Lead Solution Architect Intel Corporation October 2003  –  November 2007  (4 years 2 months) Responsible for developing the solution architecture for many software applications across the Intel business landscape. This included engaging on many projects and programs to develop optimal architectural designs that maximize reuse of existings assets and minimize the total cost of ownership. Spent 2 years in EMEA region establishing architecture process and governance, and directing the solution architecture design across more than 30 projects. Upon returning to the US, spent time developing the architecture on several significant programs such as PLM and SOA. Other responsibilities included helping to establish the practice of Enterprise Architecture within Intel's IT organization. This involved the adoption of TOGAF ADM and E2AF. Internet Staff Manager Intel Corporation April 1999  –  October 2003  (4 years 7 months) Managed a large program using program management practices, which involved directing the work of more than 40 people to build a new scalable extranet server farm. This server farm was comprised of more than 100 servers and the flawless migration of more than 40 web-based applications used by thousands of users from the old environment to the new. Additionally, people managed a team of individual contributors responsible for the development, integration, deployment and support of core software capabilities hosted on Intel's supplier facing extranet, supplier.intel.com. This included implementing solutions such as user registration and entitlement, on-line collaboration and web portals. Internet Staff Manager Intel Corporation April 1999  –  October 2003  (4 years 7 months) Managed a large program using program management practices, which involved directing the work of more than 40 people to build a new scalable extranet server farm. This server farm was comprised of more than 100 servers and the flawless migration of more than 40 web-based applications used by thousands of users from the old environment to the new. Additionally, people managed a team of individual contributors responsible for the development, integration, deployment and support of core software capabilities hosted on Intel's supplier facing extranet, supplier.intel.com. This included implementing solutions such as user registration and entitlement, on-line collaboration and web portals. Senior Software Engineer Intel Corporation March 1996  –  March 1999  (3 years 1 month) Designed and implemented Intel's external (DMZ) internet user account management system, responsible for maintaining more than 1 million user accounts. Primary responsibility consisted of web page user interface implementation including support for delivering web pages in many different languages to enable users to log in, change their password, maintain their information and create a perception of a single login user experience across a large virtual mesh of heterogeneous computer systems. Also designed and implemented Intel's internal user account management system responsible for managing more than 500,000 accounts across hundreds of systems within Intel. Senior Software Engineer Intel Corporation March 1996  –  March 1999  (3 years 1 month) Designed and implemented Intel's external (DMZ) internet user account management system, responsible for maintaining more than 1 million user accounts. Primary responsibility consisted of web page user interface implementation including support for delivering web pages in many different languages to enable users to log in, change their password, maintain their information and create a perception of a single login user experience across a large virtual mesh of heterogeneous computer systems. Also designed and implemented Intel's internal user account management system responsible for managing more than 500,000 accounts across hundreds of systems within Intel. Skills Enterprise Architecture SOA Solution Architecture Integration Web Services Software Development Agile Methodologies Project Management Identity Management Customer Support Issue Management Master Data Management Program Management Software Project... Architecture SaaS Cloud Computing System Architecture Governance Strategy Architectures See 6+     See less Skills  Enterprise Architecture SOA Solution Architecture Integration Web Services Software Development Agile Methodologies Project Management Identity Management Customer Support Issue Management Master Data Management Program Management Software Project... Architecture SaaS Cloud Computing System Architecture Governance Strategy Architectures See 6+     See less Enterprise Architecture SOA Solution Architecture Integration Web Services Software Development Agile Methodologies Project Management Identity Management Customer Support Issue Management Master Data Management Program Management Software Project... Architecture SaaS Cloud Computing System Architecture Governance Strategy Architectures See 6+     See less Enterprise Architecture SOA Solution Architecture Integration Web Services Software Development Agile Methodologies Project Management Identity Management Customer Support Issue Management Master Data Management Program Management Software Project... Architecture SaaS Cloud Computing System Architecture Governance Strategy Architectures See 6+     See less Education Imperial College London BSc(Eng) 1989  – 1992 New College, Swindon 3 x A-Levels, Grades A, A and B 1987  – 1989 Imperial College London BSc(Eng) 1989  – 1992 Imperial College London BSc(Eng) 1989  – 1992 Imperial College London BSc(Eng) 1989  – 1992 New College, Swindon 3 x A-Levels, Grades A, A and B 1987  – 1989 New College, Swindon 3 x A-Levels, Grades A, A and B 1987  – 1989 New College, Swindon 3 x A-Levels, Grades A, A and B 1987  – 1989 ", "Summary PROFESSIONAL SUMMARY: \nA senior Enterprise Architect in the Information Technology organization at Intel Corporation. Is very passionate about continuously improving business conditions and enabling business value. Brings a unique blend of strong technical and business acumen to help bridge the gaps between customer requirements/needs and IT Solutions. \n \nSUMMARY OF QUALIFICATIONS \n- Twenty three years’ work experience in Information Technology field. \n- Ability to evaluate complex business models, develop/define business processes, and propose solutions.  \n- Ability to drive change in organizational behavior through the focus of business value, process improvements, and cost management. \n- Strong balance between customer service & technical skills. \n- Ability to manage virtual & cross-organizational teams to generate results. \n- Good communication skills, both verbal and written. Summary PROFESSIONAL SUMMARY: \nA senior Enterprise Architect in the Information Technology organization at Intel Corporation. Is very passionate about continuously improving business conditions and enabling business value. Brings a unique blend of strong technical and business acumen to help bridge the gaps between customer requirements/needs and IT Solutions. \n \nSUMMARY OF QUALIFICATIONS \n- Twenty three years’ work experience in Information Technology field. \n- Ability to evaluate complex business models, develop/define business processes, and propose solutions.  \n- Ability to drive change in organizational behavior through the focus of business value, process improvements, and cost management. \n- Strong balance between customer service & technical skills. \n- Ability to manage virtual & cross-organizational teams to generate results. \n- Good communication skills, both verbal and written. PROFESSIONAL SUMMARY: \nA senior Enterprise Architect in the Information Technology organization at Intel Corporation. Is very passionate about continuously improving business conditions and enabling business value. Brings a unique blend of strong technical and business acumen to help bridge the gaps between customer requirements/needs and IT Solutions. \n \nSUMMARY OF QUALIFICATIONS \n- Twenty three years’ work experience in Information Technology field. \n- Ability to evaluate complex business models, develop/define business processes, and propose solutions.  \n- Ability to drive change in organizational behavior through the focus of business value, process improvements, and cost management. \n- Strong balance between customer service & technical skills. \n- Ability to manage virtual & cross-organizational teams to generate results. \n- Good communication skills, both verbal and written. PROFESSIONAL SUMMARY: \nA senior Enterprise Architect in the Information Technology organization at Intel Corporation. Is very passionate about continuously improving business conditions and enabling business value. Brings a unique blend of strong technical and business acumen to help bridge the gaps between customer requirements/needs and IT Solutions. \n \nSUMMARY OF QUALIFICATIONS \n- Twenty three years’ work experience in Information Technology field. \n- Ability to evaluate complex business models, develop/define business processes, and propose solutions.  \n- Ability to drive change in organizational behavior through the focus of business value, process improvements, and cost management. \n- Strong balance between customer service & technical skills. \n- Ability to manage virtual & cross-organizational teams to generate results. \n- Good communication skills, both verbal and written. Experience Enterprise Architect Intel Corporation February 2013  – Present (2 years 7 months) Lead for IT SW Developer Community improvements and enhancements. Drive and prioritize the development activities for a Developer-Centric Application focused on tools, code, process, and other developer resources. Promote and help establish DevOps practices across the IT Organization. Enterprise Architect Intel Corporation January 2007  – Present (8 years 8 months) Responsible for strategic architecture and direction/governance for the Business to Business (B2B) domain. This is done through development and execution of the architecture processes to maximize the value of business strategies. As an EA, I participate in architectural forums, evaluations, research and consulting, and tracking of industry trends to ensure optimal architectural solutions. IT Business Architect Intel Corporation November 2004  –  January 2007  (2 years 3 months) Defined the organization’s value chains and how its business processes fit together, were managed and measured. This was done by documenting biz level detail (goals, process models, metrics, etc) to link biz strategy to implementation plans. Operations Manager Intel Corporation April 2004  –  December 2005  (1 year 9 months) As the Biz Ops Manager, helped form and staff a new organization. This was a cross organizational role that owned general staff administration / controls, org improvement efforts, customer engagement, metrics and Plan-of-Record for the organization. This also included leading organization-wide activities within the team. IT Program/Project Manager Intel Corporation 2002  –  March 2004  (2 years) Lead the day-to-day management of various programs/projects ranging from Lab Networks to Wireless for conference events. This involved managing the resources and project plan through the entire project lifecycle. IT Account Manager Intel Corporation 1998  –  2002  (4 years) Performed the role of a liaison between IT and the Technology Development organizations. This involved having significant knowledge in subject matters pertaining to both IT and the business. As a result, was responsible for understanding the business, assisting in the prioritization of projects, ensuring that projects align with the technology that best provided maximum value, and direct IT strategy in support of the overall business strategy. Extended Services Consultant / Client Ops Coordinator Intel Corporation 1997  –  1998  (1 year) Led the development of the Ops Coordinator roles and responsibilities for the site. This role involved managing and driving down site wide customer missed commitments to help improve customer satisfaction and developing several process improvements. Also involved the creation and management of Campus Computing Councils, which were focused on advocating unique customer needs to help align IT Product & Services with the business requirements. Also worked with business units to implement custom / dedicated client services technicians for their unique needs. Customer Service Representative Intel Corporation September 1995  –  1997  (2 years) Successfully managed the day-to-day campus operations while leading a team of 4 technicians. This involved the creation and implementation of a Site Incident Management Ticket Qualification process, which resulted in significant savings. In addition, this role involved managing and improving Customer Satisfaction and Missed Commitments metrics. Online Faxback Manager Instant InfoSystems January 1994  –  July 1995  (1 year 7 months) Managed the online faxback systems for many business customers. This involved transforming the collateral and integrating it with the online faxback system, testing quality, and managing the various systems. Technical Services Call Consultant Loyola Marymount University 1992  –  1994  (2 years) Helped manage the on-campus Information Systems product (HW/SW) inventory. Provided first level support for faculty and students requesting technical support. Enterprise Architect Intel Corporation February 2013  – Present (2 years 7 months) Lead for IT SW Developer Community improvements and enhancements. Drive and prioritize the development activities for a Developer-Centric Application focused on tools, code, process, and other developer resources. Promote and help establish DevOps practices across the IT Organization. Enterprise Architect Intel Corporation February 2013  – Present (2 years 7 months) Lead for IT SW Developer Community improvements and enhancements. Drive and prioritize the development activities for a Developer-Centric Application focused on tools, code, process, and other developer resources. Promote and help establish DevOps practices across the IT Organization. Enterprise Architect Intel Corporation January 2007  – Present (8 years 8 months) Responsible for strategic architecture and direction/governance for the Business to Business (B2B) domain. This is done through development and execution of the architecture processes to maximize the value of business strategies. As an EA, I participate in architectural forums, evaluations, research and consulting, and tracking of industry trends to ensure optimal architectural solutions. Enterprise Architect Intel Corporation January 2007  – Present (8 years 8 months) Responsible for strategic architecture and direction/governance for the Business to Business (B2B) domain. This is done through development and execution of the architecture processes to maximize the value of business strategies. As an EA, I participate in architectural forums, evaluations, research and consulting, and tracking of industry trends to ensure optimal architectural solutions. IT Business Architect Intel Corporation November 2004  –  January 2007  (2 years 3 months) Defined the organization’s value chains and how its business processes fit together, were managed and measured. This was done by documenting biz level detail (goals, process models, metrics, etc) to link biz strategy to implementation plans. IT Business Architect Intel Corporation November 2004  –  January 2007  (2 years 3 months) Defined the organization’s value chains and how its business processes fit together, were managed and measured. This was done by documenting biz level detail (goals, process models, metrics, etc) to link biz strategy to implementation plans. Operations Manager Intel Corporation April 2004  –  December 2005  (1 year 9 months) As the Biz Ops Manager, helped form and staff a new organization. This was a cross organizational role that owned general staff administration / controls, org improvement efforts, customer engagement, metrics and Plan-of-Record for the organization. This also included leading organization-wide activities within the team. Operations Manager Intel Corporation April 2004  –  December 2005  (1 year 9 months) As the Biz Ops Manager, helped form and staff a new organization. This was a cross organizational role that owned general staff administration / controls, org improvement efforts, customer engagement, metrics and Plan-of-Record for the organization. This also included leading organization-wide activities within the team. IT Program/Project Manager Intel Corporation 2002  –  March 2004  (2 years) Lead the day-to-day management of various programs/projects ranging from Lab Networks to Wireless for conference events. This involved managing the resources and project plan through the entire project lifecycle. IT Program/Project Manager Intel Corporation 2002  –  March 2004  (2 years) Lead the day-to-day management of various programs/projects ranging from Lab Networks to Wireless for conference events. This involved managing the resources and project plan through the entire project lifecycle. IT Account Manager Intel Corporation 1998  –  2002  (4 years) Performed the role of a liaison between IT and the Technology Development organizations. This involved having significant knowledge in subject matters pertaining to both IT and the business. As a result, was responsible for understanding the business, assisting in the prioritization of projects, ensuring that projects align with the technology that best provided maximum value, and direct IT strategy in support of the overall business strategy. IT Account Manager Intel Corporation 1998  –  2002  (4 years) Performed the role of a liaison between IT and the Technology Development organizations. This involved having significant knowledge in subject matters pertaining to both IT and the business. As a result, was responsible for understanding the business, assisting in the prioritization of projects, ensuring that projects align with the technology that best provided maximum value, and direct IT strategy in support of the overall business strategy. Extended Services Consultant / Client Ops Coordinator Intel Corporation 1997  –  1998  (1 year) Led the development of the Ops Coordinator roles and responsibilities for the site. This role involved managing and driving down site wide customer missed commitments to help improve customer satisfaction and developing several process improvements. Also involved the creation and management of Campus Computing Councils, which were focused on advocating unique customer needs to help align IT Product & Services with the business requirements. Also worked with business units to implement custom / dedicated client services technicians for their unique needs. Extended Services Consultant / Client Ops Coordinator Intel Corporation 1997  –  1998  (1 year) Led the development of the Ops Coordinator roles and responsibilities for the site. This role involved managing and driving down site wide customer missed commitments to help improve customer satisfaction and developing several process improvements. Also involved the creation and management of Campus Computing Councils, which were focused on advocating unique customer needs to help align IT Product & Services with the business requirements. Also worked with business units to implement custom / dedicated client services technicians for their unique needs. Customer Service Representative Intel Corporation September 1995  –  1997  (2 years) Successfully managed the day-to-day campus operations while leading a team of 4 technicians. This involved the creation and implementation of a Site Incident Management Ticket Qualification process, which resulted in significant savings. In addition, this role involved managing and improving Customer Satisfaction and Missed Commitments metrics. Customer Service Representative Intel Corporation September 1995  –  1997  (2 years) Successfully managed the day-to-day campus operations while leading a team of 4 technicians. This involved the creation and implementation of a Site Incident Management Ticket Qualification process, which resulted in significant savings. In addition, this role involved managing and improving Customer Satisfaction and Missed Commitments metrics. Online Faxback Manager Instant InfoSystems January 1994  –  July 1995  (1 year 7 months) Managed the online faxback systems for many business customers. This involved transforming the collateral and integrating it with the online faxback system, testing quality, and managing the various systems. Online Faxback Manager Instant InfoSystems January 1994  –  July 1995  (1 year 7 months) Managed the online faxback systems for many business customers. This involved transforming the collateral and integrating it with the online faxback system, testing quality, and managing the various systems. Technical Services Call Consultant Loyola Marymount University 1992  –  1994  (2 years) Helped manage the on-campus Information Systems product (HW/SW) inventory. Provided first level support for faculty and students requesting technical support. Technical Services Call Consultant Loyola Marymount University 1992  –  1994  (2 years) Helped manage the on-campus Information Systems product (HW/SW) inventory. Provided first level support for faculty and students requesting technical support. Languages   Skills Program Management Product Management Project Management Business Intelligence IT Strategy Six Sigma Vendor Management Architecture Software Project... Cloud Computing Process Improvement Process Engineering Team Leadership Intel Business Process Product Marketing B2B Middleware Integration Cross-functional Team... ITIL IT Service Management Supply Chain Management Business Process... Enterprise Architecture Strategic Planning Account Management Business Process Mapping Business Process... Business Architecture System Architecture IT Management Requirements Analysis PMP Management Strategy Software Documentation Project Portfolio... Business Strategy SDLC Business Analysis Agile Methodologies Enterprise Software Solution Architecture Data Center PMO ERP Agile Project Management Data Modeling Architectures See 35+     See less Skills  Program Management Product Management Project Management Business Intelligence IT Strategy Six Sigma Vendor Management Architecture Software Project... Cloud Computing Process Improvement Process Engineering Team Leadership Intel Business Process Product Marketing B2B Middleware Integration Cross-functional Team... ITIL IT Service Management Supply Chain Management Business Process... Enterprise Architecture Strategic Planning Account Management Business Process Mapping Business Process... Business Architecture System Architecture IT Management Requirements Analysis PMP Management Strategy Software Documentation Project Portfolio... Business Strategy SDLC Business Analysis Agile Methodologies Enterprise Software Solution Architecture Data Center PMO ERP Agile Project Management Data Modeling Architectures See 35+     See less Program Management Product Management Project Management Business Intelligence IT Strategy Six Sigma Vendor Management Architecture Software Project... Cloud Computing Process Improvement Process Engineering Team Leadership Intel Business Process Product Marketing B2B Middleware Integration Cross-functional Team... ITIL IT Service Management Supply Chain Management Business Process... Enterprise Architecture Strategic Planning Account Management Business Process Mapping Business Process... Business Architecture System Architecture IT Management Requirements Analysis PMP Management Strategy Software Documentation Project Portfolio... Business Strategy SDLC Business Analysis Agile Methodologies Enterprise Software Solution Architecture Data Center PMO ERP Agile Project Management Data Modeling Architectures See 35+     See less Program Management Product Management Project Management Business Intelligence IT Strategy Six Sigma Vendor Management Architecture Software Project... Cloud Computing Process Improvement Process Engineering Team Leadership Intel Business Process Product Marketing B2B Middleware Integration Cross-functional Team... ITIL IT Service Management Supply Chain Management Business Process... Enterprise Architecture Strategic Planning Account Management Business Process Mapping Business Process... Business Architecture System Architecture IT Management Requirements Analysis PMP Management Strategy Software Documentation Project Portfolio... Business Strategy SDLC Business Analysis Agile Methodologies Enterprise Software Solution Architecture Data Center PMO ERP Agile Project Management Data Modeling Architectures See 35+     See less Education Arizona State University - W. P. Carey School of Business MBA,  Supply Chain Management 2002  – 2004 Activities and Societies:  Beta Gamma Sigma Loyola Marymount University BS,  Civil Engineering 1990  – 1994 Activities and Societies:  SHPE ,  LBSA Arizona State University - W. P. Carey School of Business MBA,  Supply Chain Management 2002  – 2004 Activities and Societies:  Beta Gamma Sigma Arizona State University - W. P. Carey School of Business MBA,  Supply Chain Management 2002  – 2004 Activities and Societies:  Beta Gamma Sigma Arizona State University - W. P. Carey School of Business MBA,  Supply Chain Management 2002  – 2004 Activities and Societies:  Beta Gamma Sigma Loyola Marymount University BS,  Civil Engineering 1990  – 1994 Activities and Societies:  SHPE ,  LBSA Loyola Marymount University BS,  Civil Engineering 1990  – 1994 Activities and Societies:  SHPE ,  LBSA Loyola Marymount University BS,  Civil Engineering 1990  – 1994 Activities and Societies:  SHPE ,  LBSA Honors & Awards ", "Skills Virtualization Cloud Computing Integration Cross-functional Team... Linux Product Management Requirements Analysis System Architecture Vendor Management Management Servers PMO Process Improvement Program Management Project Management ITIL IT Management Risk Management Six Sigma Strategic Planning Team Leadership Virtual Desktop... Windows Server Network Engineering Remote Desktop Systems Engineering See 11+     See less Skills  Virtualization Cloud Computing Integration Cross-functional Team... Linux Product Management Requirements Analysis System Architecture Vendor Management Management Servers PMO Process Improvement Program Management Project Management ITIL IT Management Risk Management Six Sigma Strategic Planning Team Leadership Virtual Desktop... Windows Server Network Engineering Remote Desktop Systems Engineering See 11+     See less Virtualization Cloud Computing Integration Cross-functional Team... Linux Product Management Requirements Analysis System Architecture Vendor Management Management Servers PMO Process Improvement Program Management Project Management ITIL IT Management Risk Management Six Sigma Strategic Planning Team Leadership Virtual Desktop... Windows Server Network Engineering Remote Desktop Systems Engineering See 11+     See less Virtualization Cloud Computing Integration Cross-functional Team... Linux Product Management Requirements Analysis System Architecture Vendor Management Management Servers PMO Process Improvement Program Management Project Management ITIL IT Management Risk Management Six Sigma Strategic Planning Team Leadership Virtual Desktop... Windows Server Network Engineering Remote Desktop Systems Engineering See 11+     See less ", "Skills Intel Semiconductors Debugging Enterprise Architecture Service Oriented... Cryptography Mobile Payments Payment Systems Software Development Network Architecture Software Project... Software Engineering Enterprise Software Architectures System Architecture Mobile Devices Agile Methodologies Program Management Management See 4+     See less Skills  Intel Semiconductors Debugging Enterprise Architecture Service Oriented... Cryptography Mobile Payments Payment Systems Software Development Network Architecture Software Project... Software Engineering Enterprise Software Architectures System Architecture Mobile Devices Agile Methodologies Program Management Management See 4+     See less Intel Semiconductors Debugging Enterprise Architecture Service Oriented... Cryptography Mobile Payments Payment Systems Software Development Network Architecture Software Project... Software Engineering Enterprise Software Architectures System Architecture Mobile Devices Agile Methodologies Program Management Management See 4+     See less Intel Semiconductors Debugging Enterprise Architecture Service Oriented... Cryptography Mobile Payments Payment Systems Software Development Network Architecture Software Project... Software Engineering Enterprise Software Architectures System Architecture Mobile Devices Agile Methodologies Program Management Management See 4+     See less ", "Summary I am a passionate, customer focused ebusiness leader with 14 years experience in programming and product/people management for web applications. What gets me up in the morning? Turning innovative ideas for web applications into reality. Over the years I have collected, and dare I say in some cases \"mastered\" a host of skills including: \n \nRequirements Gathering, Business Process Modeling, Project Management/SDLC, Cross-Geo Stakeholder Management, Software Team Management (local & international), Software Design (Object Oriented Software Modeling, Database Design, Web Design, SEO/SEM, MVT, A/B Split Testing, User Interaction Modeling, User Personas, Web Copy Writing, Analytics (Omniture, Google/Urchin), W3C Standards, Information Architecture / Taxonomies, Wireframes \n \nPHP(Codeigniter), SVN, Javascript(jQuery), MySQL 5 (inc. Workbench), Adobe Fireworks CS4, Adobe AIR, Drupal 5.x, Expression Engine, Aptana Studio, Firebug, MS SQL Server 2000/2005 (inc. T-SQL, Stored Procedures & SSRS), XML(XSD/DTD,XSLT), ASP(VBScript,C#.NET) Javascript(AJAX,DHTML,DOM), HTML, CSS, JSP, SOAP/Web Services, Commergent, Interwoven Teamsite, Kapow, MS Excel 2003/2007 (inc. functions & pivot tables) \n \nSpecialties: Idea incubating & web product design, software team management, large scale web content migration Summary I am a passionate, customer focused ebusiness leader with 14 years experience in programming and product/people management for web applications. What gets me up in the morning? Turning innovative ideas for web applications into reality. Over the years I have collected, and dare I say in some cases \"mastered\" a host of skills including: \n \nRequirements Gathering, Business Process Modeling, Project Management/SDLC, Cross-Geo Stakeholder Management, Software Team Management (local & international), Software Design (Object Oriented Software Modeling, Database Design, Web Design, SEO/SEM, MVT, A/B Split Testing, User Interaction Modeling, User Personas, Web Copy Writing, Analytics (Omniture, Google/Urchin), W3C Standards, Information Architecture / Taxonomies, Wireframes \n \nPHP(Codeigniter), SVN, Javascript(jQuery), MySQL 5 (inc. Workbench), Adobe Fireworks CS4, Adobe AIR, Drupal 5.x, Expression Engine, Aptana Studio, Firebug, MS SQL Server 2000/2005 (inc. T-SQL, Stored Procedures & SSRS), XML(XSD/DTD,XSLT), ASP(VBScript,C#.NET) Javascript(AJAX,DHTML,DOM), HTML, CSS, JSP, SOAP/Web Services, Commergent, Interwoven Teamsite, Kapow, MS Excel 2003/2007 (inc. functions & pivot tables) \n \nSpecialties: Idea incubating & web product design, software team management, large scale web content migration I am a passionate, customer focused ebusiness leader with 14 years experience in programming and product/people management for web applications. What gets me up in the morning? Turning innovative ideas for web applications into reality. Over the years I have collected, and dare I say in some cases \"mastered\" a host of skills including: \n \nRequirements Gathering, Business Process Modeling, Project Management/SDLC, Cross-Geo Stakeholder Management, Software Team Management (local & international), Software Design (Object Oriented Software Modeling, Database Design, Web Design, SEO/SEM, MVT, A/B Split Testing, User Interaction Modeling, User Personas, Web Copy Writing, Analytics (Omniture, Google/Urchin), W3C Standards, Information Architecture / Taxonomies, Wireframes \n \nPHP(Codeigniter), SVN, Javascript(jQuery), MySQL 5 (inc. Workbench), Adobe Fireworks CS4, Adobe AIR, Drupal 5.x, Expression Engine, Aptana Studio, Firebug, MS SQL Server 2000/2005 (inc. T-SQL, Stored Procedures & SSRS), XML(XSD/DTD,XSLT), ASP(VBScript,C#.NET) Javascript(AJAX,DHTML,DOM), HTML, CSS, JSP, SOAP/Web Services, Commergent, Interwoven Teamsite, Kapow, MS Excel 2003/2007 (inc. functions & pivot tables) \n \nSpecialties: Idea incubating & web product design, software team management, large scale web content migration I am a passionate, customer focused ebusiness leader with 14 years experience in programming and product/people management for web applications. What gets me up in the morning? Turning innovative ideas for web applications into reality. Over the years I have collected, and dare I say in some cases \"mastered\" a host of skills including: \n \nRequirements Gathering, Business Process Modeling, Project Management/SDLC, Cross-Geo Stakeholder Management, Software Team Management (local & international), Software Design (Object Oriented Software Modeling, Database Design, Web Design, SEO/SEM, MVT, A/B Split Testing, User Interaction Modeling, User Personas, Web Copy Writing, Analytics (Omniture, Google/Urchin), W3C Standards, Information Architecture / Taxonomies, Wireframes \n \nPHP(Codeigniter), SVN, Javascript(jQuery), MySQL 5 (inc. Workbench), Adobe Fireworks CS4, Adobe AIR, Drupal 5.x, Expression Engine, Aptana Studio, Firebug, MS SQL Server 2000/2005 (inc. T-SQL, Stored Procedures & SSRS), XML(XSD/DTD,XSLT), ASP(VBScript,C#.NET) Javascript(AJAX,DHTML,DOM), HTML, CSS, JSP, SOAP/Web Services, Commergent, Interwoven Teamsite, Kapow, MS Excel 2003/2007 (inc. functions & pivot tables) \n \nSpecialties: Idea incubating & web product design, software team management, large scale web content migration Experience Enterprise Architect Intel Corporation 2011  – Present (4 years) Enterprise Architect responsible for Platform Architecture and leading a Capability Engineering team establishing engineering guidelines and reference designs. Providing architectural guidance for a portfolio of globally distributed projects representing tens of millions of dollars in business value. \n \nPrimary focus is on enterprise level Business Process Management and Business Rules Management. Owner Endstate January 2008  –  2012  (4 years) As a founding partner with duel roles as the head of business development and technical architecture, responsible for driving multiple CxO level client engagements, architecting the solutions to complex business challenges and hiring and managing a distributed technical team. In just two short years, this firm has delivered several important projects including multiple social networking sites, ecommerce sites, a custom enterprise digital asset management application, web site redesigns and extensive consulting on very large scale content migration projects. \n \nTech: PHP (Codeigniter), Javascript (jQuery), Drupal, Expression Engine, MySQL 5.x (inc. Workbench) Product Manager Intel Corporation November 2007  –  2011  (4 years) Drive the tools and processes that support Intel's enterprise product naming, including automated naming for over 90,000 products. Ensuring consistent, high quality product data across the enterprise with dozens of touch points into other enterprise IT aps including SAP and other sales and order management applications. \n \nTech: MS SQL Server 2005 Queries & SSRS, Teradata, MS Excel Sr. eBusiness Analyst Intel January 2007  –  June 2007  (6 months) Primary liaison between a large software team and the business teams of Intel’s distributors across the globe. Responsible for engaging at the CTO level, planning and overseeing the business & technical integration of the distributor’s order management systems into Intel’s Channel Marketplace, a J2EE & XML-based (Commergent) ecommerce portal. A high visibility position on a breakthrough project requiring extensive international travel. \n \nTech: XML, Commergent (DTDs & XSLTs), SQL Server 2000 ET&L (DTS) Owner Auction Hound February 2006  –  December 2006  (11 months) Responsible for business planning, financial indicators, web marketing strategies and product roadmaps for a start-up web company. Designed, developed and deployed two custom ecommerce systems. \n \nTech: Java/JSP, PHP, MySQL & the eBay & Amazon SOAP SDKs. Web Content Management Product/Program Manager Intel August 2001  –  December 2006  (5 years 5 months) Managed global stakeholder relationships and the features roadmap for Intel’s web application platform & content management system. Provided key contributions to usability and information architecture efforts for Intel.com while working with several agencies including EURO/RSCG, McCann, R/GA, MRM, & Anderson Sloane. \n \nManaged the day to day operations of a 31 person off-shore (India) web software development team. Responsible for staffing many parallel projects, owning demanding customer relationships, and driving the professional services program roadmap. Lead several $million+ projects migrating and integrating hundreds of thousands of Intel.com content assets into a web content management system using XML-based technologies.  \n \nTech: XML/XSLT Technical Lead Intel January 2000  –  August 2001  (1 year 8 months) Provided leadership for a team of 9 software engineers while responsible for managing diverse groups of customer stakeholders, generating the business & technical requirements for each project, analyzing solution trade-offs, overseeing the creation of project deliverables and owning the entire SDLC for many web software projects. Included hands-on programming and software architecting. \n \nTech: ASP, SQL Server 2000, XML, Interwoven Teamsite, HTML/CSS & Javascript Enterprise Architect Intel Corporation 2011  – Present (4 years) Enterprise Architect responsible for Platform Architecture and leading a Capability Engineering team establishing engineering guidelines and reference designs. Providing architectural guidance for a portfolio of globally distributed projects representing tens of millions of dollars in business value. \n \nPrimary focus is on enterprise level Business Process Management and Business Rules Management. Enterprise Architect Intel Corporation 2011  – Present (4 years) Enterprise Architect responsible for Platform Architecture and leading a Capability Engineering team establishing engineering guidelines and reference designs. Providing architectural guidance for a portfolio of globally distributed projects representing tens of millions of dollars in business value. \n \nPrimary focus is on enterprise level Business Process Management and Business Rules Management. Owner Endstate January 2008  –  2012  (4 years) As a founding partner with duel roles as the head of business development and technical architecture, responsible for driving multiple CxO level client engagements, architecting the solutions to complex business challenges and hiring and managing a distributed technical team. In just two short years, this firm has delivered several important projects including multiple social networking sites, ecommerce sites, a custom enterprise digital asset management application, web site redesigns and extensive consulting on very large scale content migration projects. \n \nTech: PHP (Codeigniter), Javascript (jQuery), Drupal, Expression Engine, MySQL 5.x (inc. Workbench) Owner Endstate January 2008  –  2012  (4 years) As a founding partner with duel roles as the head of business development and technical architecture, responsible for driving multiple CxO level client engagements, architecting the solutions to complex business challenges and hiring and managing a distributed technical team. In just two short years, this firm has delivered several important projects including multiple social networking sites, ecommerce sites, a custom enterprise digital asset management application, web site redesigns and extensive consulting on very large scale content migration projects. \n \nTech: PHP (Codeigniter), Javascript (jQuery), Drupal, Expression Engine, MySQL 5.x (inc. Workbench) Product Manager Intel Corporation November 2007  –  2011  (4 years) Drive the tools and processes that support Intel's enterprise product naming, including automated naming for over 90,000 products. Ensuring consistent, high quality product data across the enterprise with dozens of touch points into other enterprise IT aps including SAP and other sales and order management applications. \n \nTech: MS SQL Server 2005 Queries & SSRS, Teradata, MS Excel Product Manager Intel Corporation November 2007  –  2011  (4 years) Drive the tools and processes that support Intel's enterprise product naming, including automated naming for over 90,000 products. Ensuring consistent, high quality product data across the enterprise with dozens of touch points into other enterprise IT aps including SAP and other sales and order management applications. \n \nTech: MS SQL Server 2005 Queries & SSRS, Teradata, MS Excel Sr. eBusiness Analyst Intel January 2007  –  June 2007  (6 months) Primary liaison between a large software team and the business teams of Intel’s distributors across the globe. Responsible for engaging at the CTO level, planning and overseeing the business & technical integration of the distributor’s order management systems into Intel’s Channel Marketplace, a J2EE & XML-based (Commergent) ecommerce portal. A high visibility position on a breakthrough project requiring extensive international travel. \n \nTech: XML, Commergent (DTDs & XSLTs), SQL Server 2000 ET&L (DTS) Sr. eBusiness Analyst Intel January 2007  –  June 2007  (6 months) Primary liaison between a large software team and the business teams of Intel’s distributors across the globe. Responsible for engaging at the CTO level, planning and overseeing the business & technical integration of the distributor’s order management systems into Intel’s Channel Marketplace, a J2EE & XML-based (Commergent) ecommerce portal. A high visibility position on a breakthrough project requiring extensive international travel. \n \nTech: XML, Commergent (DTDs & XSLTs), SQL Server 2000 ET&L (DTS) Owner Auction Hound February 2006  –  December 2006  (11 months) Responsible for business planning, financial indicators, web marketing strategies and product roadmaps for a start-up web company. Designed, developed and deployed two custom ecommerce systems. \n \nTech: Java/JSP, PHP, MySQL & the eBay & Amazon SOAP SDKs. Owner Auction Hound February 2006  –  December 2006  (11 months) Responsible for business planning, financial indicators, web marketing strategies and product roadmaps for a start-up web company. Designed, developed and deployed two custom ecommerce systems. \n \nTech: Java/JSP, PHP, MySQL & the eBay & Amazon SOAP SDKs. Web Content Management Product/Program Manager Intel August 2001  –  December 2006  (5 years 5 months) Managed global stakeholder relationships and the features roadmap for Intel’s web application platform & content management system. Provided key contributions to usability and information architecture efforts for Intel.com while working with several agencies including EURO/RSCG, McCann, R/GA, MRM, & Anderson Sloane. \n \nManaged the day to day operations of a 31 person off-shore (India) web software development team. Responsible for staffing many parallel projects, owning demanding customer relationships, and driving the professional services program roadmap. Lead several $million+ projects migrating and integrating hundreds of thousands of Intel.com content assets into a web content management system using XML-based technologies.  \n \nTech: XML/XSLT Web Content Management Product/Program Manager Intel August 2001  –  December 2006  (5 years 5 months) Managed global stakeholder relationships and the features roadmap for Intel’s web application platform & content management system. Provided key contributions to usability and information architecture efforts for Intel.com while working with several agencies including EURO/RSCG, McCann, R/GA, MRM, & Anderson Sloane. \n \nManaged the day to day operations of a 31 person off-shore (India) web software development team. Responsible for staffing many parallel projects, owning demanding customer relationships, and driving the professional services program roadmap. Lead several $million+ projects migrating and integrating hundreds of thousands of Intel.com content assets into a web content management system using XML-based technologies.  \n \nTech: XML/XSLT Technical Lead Intel January 2000  –  August 2001  (1 year 8 months) Provided leadership for a team of 9 software engineers while responsible for managing diverse groups of customer stakeholders, generating the business & technical requirements for each project, analyzing solution trade-offs, overseeing the creation of project deliverables and owning the entire SDLC for many web software projects. Included hands-on programming and software architecting. \n \nTech: ASP, SQL Server 2000, XML, Interwoven Teamsite, HTML/CSS & Javascript Technical Lead Intel January 2000  –  August 2001  (1 year 8 months) Provided leadership for a team of 9 software engineers while responsible for managing diverse groups of customer stakeholders, generating the business & technical requirements for each project, analyzing solution trade-offs, overseeing the creation of project deliverables and owning the entire SDLC for many web software projects. Included hands-on programming and software architecting. \n \nTech: ASP, SQL Server 2000, XML, Interwoven Teamsite, HTML/CSS & Javascript Skills jQuery E-commerce CSS JavaScript AJAX Software Development XML Software Project... Microsoft SQL Server Integration SDLC Web Applications Enterprise Software MySQL Subversion Skills  jQuery E-commerce CSS JavaScript AJAX Software Development XML Software Project... Microsoft SQL Server Integration SDLC Web Applications Enterprise Software MySQL Subversion jQuery E-commerce CSS JavaScript AJAX Software Development XML Software Project... Microsoft SQL Server Integration SDLC Web Applications Enterprise Software MySQL Subversion jQuery E-commerce CSS JavaScript AJAX Software Development XML Software Project... Microsoft SQL Server Integration SDLC Web Applications Enterprise Software MySQL Subversion Education California State University-Sacramento B.A California State University-Sacramento B.A California State University-Sacramento B.A California State University-Sacramento B.A ", "Experience Enterprise Architect Intel Corporation Enterprise Architect Intel Corporation Enterprise Architect Intel Corporation ", "Experience Freelance Enterprise Architect Intel Corporation March 2015  – Present (6 months) Evaluate technologies for various organizations at Intel. Currently looking at VM interoperability between hypervisors as part of an ODCA project and the effects of latency on application performance. Big Data and Analytics Content Marketing Manager Intel Corporation October 2014  – Present (11 months) Defines and implements Intel IT’s external messaging about Big Data and Analytics projects in order to showcase Intel products and Intel technology. Software Engineer Intel Corporation - Intel Labs May 2014  –  September 2014  (5 months) Developed proof of conception implementations of Cloud and Data Center Use Cases that use upcoming security features of Intel processors. Enterprise Architect/Researcher Intel IT 2005  –  April 2014  (9 years) Enterprise architect in Intel's IT Research Group focusing on cloud computing and associated security issues. Research Engineer Intel Corporation 2003  –  2005  (2 years) Research staff working on PlanetLab and Virtualization Network Engineer Intel Online Services 2000  –  2003  (3 years) Engineered and managed network service products, including DNS, Firewall Policy, and mail forwarding policies, for hosting customers and for the hosting infrastructure. Freelance Enterprise Architect Intel Corporation March 2015  – Present (6 months) Evaluate technologies for various organizations at Intel. Currently looking at VM interoperability between hypervisors as part of an ODCA project and the effects of latency on application performance. Freelance Enterprise Architect Intel Corporation March 2015  – Present (6 months) Evaluate technologies for various organizations at Intel. Currently looking at VM interoperability between hypervisors as part of an ODCA project and the effects of latency on application performance. Big Data and Analytics Content Marketing Manager Intel Corporation October 2014  – Present (11 months) Defines and implements Intel IT’s external messaging about Big Data and Analytics projects in order to showcase Intel products and Intel technology. Big Data and Analytics Content Marketing Manager Intel Corporation October 2014  – Present (11 months) Defines and implements Intel IT’s external messaging about Big Data and Analytics projects in order to showcase Intel products and Intel technology. Software Engineer Intel Corporation - Intel Labs May 2014  –  September 2014  (5 months) Developed proof of conception implementations of Cloud and Data Center Use Cases that use upcoming security features of Intel processors. Software Engineer Intel Corporation - Intel Labs May 2014  –  September 2014  (5 months) Developed proof of conception implementations of Cloud and Data Center Use Cases that use upcoming security features of Intel processors. Enterprise Architect/Researcher Intel IT 2005  –  April 2014  (9 years) Enterprise architect in Intel's IT Research Group focusing on cloud computing and associated security issues. Enterprise Architect/Researcher Intel IT 2005  –  April 2014  (9 years) Enterprise architect in Intel's IT Research Group focusing on cloud computing and associated security issues. Research Engineer Intel Corporation 2003  –  2005  (2 years) Research staff working on PlanetLab and Virtualization Research Engineer Intel Corporation 2003  –  2005  (2 years) Research staff working on PlanetLab and Virtualization Network Engineer Intel Online Services 2000  –  2003  (3 years) Engineered and managed network service products, including DNS, Firewall Policy, and mail forwarding policies, for hosting customers and for the hosting infrastructure. Network Engineer Intel Online Services 2000  –  2003  (3 years) Engineered and managed network service products, including DNS, Firewall Policy, and mail forwarding policies, for hosting customers and for the hosting infrastructure. Languages   Skills Virtualization Network Administration Cloud Computing Network Security Load Balancing System Architecture Distributed Systems Perl Enterprise Software Information Technology Unix Firewalls Software Engineering Security Information Security Linux Networking Computer Architecture TCP/IP Network Architecture Integration Enterprise Architecture Shell Scripting Software Development Data Center Debugging Information Security... Servers Computer Security Storage Apache Pig Hadoop Big Data Big Data Analytics See 19+     See less Skills  Virtualization Network Administration Cloud Computing Network Security Load Balancing System Architecture Distributed Systems Perl Enterprise Software Information Technology Unix Firewalls Software Engineering Security Information Security Linux Networking Computer Architecture TCP/IP Network Architecture Integration Enterprise Architecture Shell Scripting Software Development Data Center Debugging Information Security... Servers Computer Security Storage Apache Pig Hadoop Big Data Big Data Analytics See 19+     See less Virtualization Network Administration Cloud Computing Network Security Load Balancing System Architecture Distributed Systems Perl Enterprise Software Information Technology Unix Firewalls Software Engineering Security Information Security Linux Networking Computer Architecture TCP/IP Network Architecture Integration Enterprise Architecture Shell Scripting Software Development Data Center Debugging Information Security... Servers Computer Security Storage Apache Pig Hadoop Big Data Big Data Analytics See 19+     See less Virtualization Network Administration Cloud Computing Network Security Load Balancing System Architecture Distributed Systems Perl Enterprise Software Information Technology Unix Firewalls Software Engineering Security Information Security Linux Networking Computer Architecture TCP/IP Network Architecture Integration Enterprise Architecture Shell Scripting Software Development Data Center Debugging Information Security... Servers Computer Security Storage Apache Pig Hadoop Big Data Big Data Analytics See 19+     See less ", "Skills Data Center Software Development Integration Software Engineering Program Management Enterprise Network... Big Data CISSP Linux System Architecture Enterprise Software IT Strategy Debugging Programming Virtualization Enterprise Architecture SDLC Architectures Architecture Networking Hardware Software Project... TCP/IP IT Management Cross-functional Team... Intel Business Intelligence See 12+     See less Skills  Data Center Software Development Integration Software Engineering Program Management Enterprise Network... Big Data CISSP Linux System Architecture Enterprise Software IT Strategy Debugging Programming Virtualization Enterprise Architecture SDLC Architectures Architecture Networking Hardware Software Project... TCP/IP IT Management Cross-functional Team... Intel Business Intelligence See 12+     See less Data Center Software Development Integration Software Engineering Program Management Enterprise Network... Big Data CISSP Linux System Architecture Enterprise Software IT Strategy Debugging Programming Virtualization Enterprise Architecture SDLC Architectures Architecture Networking Hardware Software Project... TCP/IP IT Management Cross-functional Team... Intel Business Intelligence See 12+     See less Data Center Software Development Integration Software Engineering Program Management Enterprise Network... Big Data CISSP Linux System Architecture Enterprise Software IT Strategy Debugging Programming Virtualization Enterprise Architecture SDLC Architectures Architecture Networking Hardware Software Project... TCP/IP IT Management Cross-functional Team... Intel Business Intelligence See 12+     See less ", "Experience Enterprise Architect Intel Corporation Enterprise Architect Intel Corporation Enterprise Architect Intel Corporation Education California State University-Chico 1983  – 1985 California State University-Chico 1983  – 1985 California State University-Chico 1983  – 1985 California State University-Chico 1983  – 1985 ", "Skills Enterprise Architecture Software Project... Agile Methodologies Integration System Architecture Enterprise Software Software Development Solution Architecture Requirements Analysis Skills  Enterprise Architecture Software Project... Agile Methodologies Integration System Architecture Enterprise Software Software Development Solution Architecture Requirements Analysis Enterprise Architecture Software Project... Agile Methodologies Integration System Architecture Enterprise Software Software Development Solution Architecture Requirements Analysis Enterprise Architecture Software Project... Agile Methodologies Integration System Architecture Enterprise Software Software Development Solution Architecture Requirements Analysis ", "Experience Lead Enterprise Architect Intel Corporation Lead Enterprise Architect Intel Corporation Lead Enterprise Architect Intel Corporation Education International University in Germany Bruchsal 2000  – 2002 International University in Germany Bruchsal 2000  – 2002 International University in Germany Bruchsal 2000  – 2002 International University in Germany Bruchsal 2000  – 2002 ", "Experience Enterprise Architect Intel Corporation Enterprise Architect Intel Corporation Enterprise Architect Intel Corporation Education University of Colorado Boulder 1976  – 1980 University of Colorado Boulder 1976  – 1980 University of Colorado Boulder 1976  – 1980 University of Colorado Boulder 1976  – 1980 ", "Summary A long time enterprise architect, focusing on promoting practical enterprise architecture, and enterprise application integration with SOA APIs/services. Truly believe that sound SOA API/service practice can bring agility, TTM and cost saving advantage for any corporation.  Summary A long time enterprise architect, focusing on promoting practical enterprise architecture, and enterprise application integration with SOA APIs/services. Truly believe that sound SOA API/service practice can bring agility, TTM and cost saving advantage for any corporation.  A long time enterprise architect, focusing on promoting practical enterprise architecture, and enterprise application integration with SOA APIs/services. Truly believe that sound SOA API/service practice can bring agility, TTM and cost saving advantage for any corporation.  A long time enterprise architect, focusing on promoting practical enterprise architecture, and enterprise application integration with SOA APIs/services. Truly believe that sound SOA API/service practice can bring agility, TTM and cost saving advantage for any corporation.  Experience Enterprise Architect Intel Corporation February 1994  – Present (21 years 7 months) Phoenix, Arizona Area Leader of Intel IT SOA API Management and Reuse program. Leading Intel IT SOA API strategy, standard, technical guidance, governance, and API Management capability effort, focusing on enterprise API Management capability build-up, reusable enterprise APIs/services planning and development for enterprise application integrations between SaaS-to-SaaS, SaaS-to-On-premise, and full-On-premise. Driving SOA design patterns, sample code and training for Intel IT development community to increase IT solution development velocity, agility and cost reduction for Intel business needs. \n \nSince joining Intel in 1994, Jian has taken many leadership roles as engineering manager, program/project manager, senior architect, lead software engineer/developer. Project Engineer Control Logic, Inc. September 1991  –  January 1994  (2 years 5 months) Led system architecture design, development and on-site integration for large scale USPS mail facility automation processing systems. Responsible for system functionality, quality, on-time delivery and customer satisfaction. Sr Software Engineer NARI - Nanjing Automation Research Institute July 1982  –  August 1989  (7 years 2 months) Nanjing, Jiangsu, China Responsible for software architecture, design, development and integration for large scale power grid control systems. Specialized in real-time process control, real-time database, real-time OS, data communication and system integration. Enterprise Architect Intel Corporation February 1994  – Present (21 years 7 months) Phoenix, Arizona Area Leader of Intel IT SOA API Management and Reuse program. Leading Intel IT SOA API strategy, standard, technical guidance, governance, and API Management capability effort, focusing on enterprise API Management capability build-up, reusable enterprise APIs/services planning and development for enterprise application integrations between SaaS-to-SaaS, SaaS-to-On-premise, and full-On-premise. Driving SOA design patterns, sample code and training for Intel IT development community to increase IT solution development velocity, agility and cost reduction for Intel business needs. \n \nSince joining Intel in 1994, Jian has taken many leadership roles as engineering manager, program/project manager, senior architect, lead software engineer/developer. Enterprise Architect Intel Corporation February 1994  – Present (21 years 7 months) Phoenix, Arizona Area Leader of Intel IT SOA API Management and Reuse program. Leading Intel IT SOA API strategy, standard, technical guidance, governance, and API Management capability effort, focusing on enterprise API Management capability build-up, reusable enterprise APIs/services planning and development for enterprise application integrations between SaaS-to-SaaS, SaaS-to-On-premise, and full-On-premise. Driving SOA design patterns, sample code and training for Intel IT development community to increase IT solution development velocity, agility and cost reduction for Intel business needs. \n \nSince joining Intel in 1994, Jian has taken many leadership roles as engineering manager, program/project manager, senior architect, lead software engineer/developer. Project Engineer Control Logic, Inc. September 1991  –  January 1994  (2 years 5 months) Led system architecture design, development and on-site integration for large scale USPS mail facility automation processing systems. Responsible for system functionality, quality, on-time delivery and customer satisfaction. Project Engineer Control Logic, Inc. September 1991  –  January 1994  (2 years 5 months) Led system architecture design, development and on-site integration for large scale USPS mail facility automation processing systems. Responsible for system functionality, quality, on-time delivery and customer satisfaction. Sr Software Engineer NARI - Nanjing Automation Research Institute July 1982  –  August 1989  (7 years 2 months) Nanjing, Jiangsu, China Responsible for software architecture, design, development and integration for large scale power grid control systems. Specialized in real-time process control, real-time database, real-time OS, data communication and system integration. Sr Software Engineer NARI - Nanjing Automation Research Institute July 1982  –  August 1989  (7 years 2 months) Nanjing, Jiangsu, China Responsible for software architecture, design, development and integration for large scale power grid control systems. Specialized in real-time process control, real-time database, real-time OS, data communication and system integration. Languages Chinese English Chinese English Chinese English Skills Technical Leadership Software Engineering Software Development Software Design C C#, C++ Engineering Management Project/Program... Strategic planning Enterprise architecture Software Lifecycle Software Architectural... API Management and... Supply Chain Management Technical consulting SOA architecting, design Enterprise Architecture Agile Methodologies System Architecture Integration Enterprise Software See 6+     See less Skills  Technical Leadership Software Engineering Software Development Software Design C C#, C++ Engineering Management Project/Program... Strategic planning Enterprise architecture Software Lifecycle Software Architectural... API Management and... Supply Chain Management Technical consulting SOA architecting, design Enterprise Architecture Agile Methodologies System Architecture Integration Enterprise Software See 6+     See less Technical Leadership Software Engineering Software Development Software Design C C#, C++ Engineering Management Project/Program... Strategic planning Enterprise architecture Software Lifecycle Software Architectural... API Management and... Supply Chain Management Technical consulting SOA architecting, design Enterprise Architecture Agile Methodologies System Architecture Integration Enterprise Software See 6+     See less Technical Leadership Software Engineering Software Development Software Design C C#, C++ Engineering Management Project/Program... Strategic planning Enterprise architecture Software Lifecycle Software Architectural... API Management and... Supply Chain Management Technical consulting SOA architecting, design Enterprise Architecture Agile Methodologies System Architecture Integration Enterprise Software See 6+     See less Education Arizona State University MS,  Computer Science and Engineering 1989  – 1991 Southeast University Bachelor of Science (BS),  Computer Science 1978  – 1982 Arizona State University MS,  Computer Science and Engineering 1989  – 1991 Arizona State University MS,  Computer Science and Engineering 1989  – 1991 Arizona State University MS,  Computer Science and Engineering 1989  – 1991 Southeast University Bachelor of Science (BS),  Computer Science 1978  – 1982 Southeast University Bachelor of Science (BS),  Computer Science 1978  – 1982 Southeast University Bachelor of Science (BS),  Computer Science 1978  – 1982 ", "Skills Program Management Cross-functional Team... Software Development Software Project... Product Management Agile Methodologies Integration Agile Project Management Cloud Computing SDLC Requirements Analysis Enterprise Software Enterprise Architecture System Architecture Solution Architecture Skills  Program Management Cross-functional Team... Software Development Software Project... Product Management Agile Methodologies Integration Agile Project Management Cloud Computing SDLC Requirements Analysis Enterprise Software Enterprise Architecture System Architecture Solution Architecture Program Management Cross-functional Team... Software Development Software Project... Product Management Agile Methodologies Integration Agile Project Management Cloud Computing SDLC Requirements Analysis Enterprise Software Enterprise Architecture System Architecture Solution Architecture Program Management Cross-functional Team... Software Development Software Project... Product Management Agile Methodologies Integration Agile Project Management Cloud Computing SDLC Requirements Analysis Enterprise Software Enterprise Architecture System Architecture Solution Architecture ", "Experience Enterprise Architect Intel Corporation 1995  – Present (20 years) Enterprise Architect Intel Corporation 1995  – Present (20 years) Enterprise Architect Intel Corporation 1995  – Present (20 years) ", "Languages English English English Skills Agile Methodologies Scrum Software Development Debugging Software Engineering Technical Leadership Object Oriented Design Agile Project Management OOP C# Java Software Project... Architecture Requirements Analysis Software Design System Architecture .NET See 2+     See less Skills  Agile Methodologies Scrum Software Development Debugging Software Engineering Technical Leadership Object Oriented Design Agile Project Management OOP C# Java Software Project... Architecture Requirements Analysis Software Design System Architecture .NET See 2+     See less Agile Methodologies Scrum Software Development Debugging Software Engineering Technical Leadership Object Oriented Design Agile Project Management OOP C# Java Software Project... Architecture Requirements Analysis Software Design System Architecture .NET See 2+     See less Agile Methodologies Scrum Software Development Debugging Software Engineering Technical Leadership Object Oriented Design Agile Project Management OOP C# Java Software Project... Architecture Requirements Analysis Software Design System Architecture .NET See 2+     See less ", "Summary Over 18 years experience with Internet technologies as a developer, architect, and evangelist.  \n \nBuilt a strong network of friends across the industry that has lead to many opportunities such as speaking at conferences, reviewing/writing books, and writing forewords for books. \n \nCreative background from working at a design agency. Still work on creative design and photography in free time and whenever possible at day job. Specialties:Service Oriented Architecture, Application Architecture, Research and Development, Prototyping, Web Development, Vendor Evaluations and Strategy. Summary Over 18 years experience with Internet technologies as a developer, architect, and evangelist.  \n \nBuilt a strong network of friends across the industry that has lead to many opportunities such as speaking at conferences, reviewing/writing books, and writing forewords for books. \n \nCreative background from working at a design agency. Still work on creative design and photography in free time and whenever possible at day job. Specialties:Service Oriented Architecture, Application Architecture, Research and Development, Prototyping, Web Development, Vendor Evaluations and Strategy. Over 18 years experience with Internet technologies as a developer, architect, and evangelist.  \n \nBuilt a strong network of friends across the industry that has lead to many opportunities such as speaking at conferences, reviewing/writing books, and writing forewords for books. \n \nCreative background from working at a design agency. Still work on creative design and photography in free time and whenever possible at day job. Specialties:Service Oriented Architecture, Application Architecture, Research and Development, Prototyping, Web Development, Vendor Evaluations and Strategy. Over 18 years experience with Internet technologies as a developer, architect, and evangelist.  \n \nBuilt a strong network of friends across the industry that has lead to many opportunities such as speaking at conferences, reviewing/writing books, and writing forewords for books. \n \nCreative background from working at a design agency. Still work on creative design and photography in free time and whenever possible at day job. Specialties:Service Oriented Architecture, Application Architecture, Research and Development, Prototyping, Web Development, Vendor Evaluations and Strategy. Experience Enterprise Architect Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Responsible for uplifting skill sets of Intel developers to meet the growing demand of users to perform their duties regardless of platform or device they are using. Mobile Developer Intel Corporation January 2012  – Present (3 years 8 months) Hillsboro, OR Responsible for developing solutions for mobile devices in support of corporate services. Current project: an iOS app. Architect Intel Corporation October 2009  –  March 2012  (2 years 6 months) Responsible for automating the validation process for applications submitted to the Intel AppUp(sm) center. President Plain Paper Consulting April 2008  –  December 2011  (3 years 9 months) Provide SOA education, guidance, and consulting to clients. Enterprise Architect Intel Corporation October 2005  –  April 2008  (2 years 7 months) Develop and evangelize a service-oriented architecture for the enterprise. Senior Software Engineer Intel Corporation October 1999  –  September 2005  (6 years) Lead software engineer responsible for architecting, developing and evangelizing .NET solutions in IT. Webmaster Cablesoft March 1997  –  October 1999  (2 years 8 months) Sole owner/developer of internal and external web sites as well as other infrastructure such as email server. Enterprise Architect Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Responsible for uplifting skill sets of Intel developers to meet the growing demand of users to perform their duties regardless of platform or device they are using. Enterprise Architect Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Responsible for uplifting skill sets of Intel developers to meet the growing demand of users to perform their duties regardless of platform or device they are using. Mobile Developer Intel Corporation January 2012  – Present (3 years 8 months) Hillsboro, OR Responsible for developing solutions for mobile devices in support of corporate services. Current project: an iOS app. Mobile Developer Intel Corporation January 2012  – Present (3 years 8 months) Hillsboro, OR Responsible for developing solutions for mobile devices in support of corporate services. Current project: an iOS app. Architect Intel Corporation October 2009  –  March 2012  (2 years 6 months) Responsible for automating the validation process for applications submitted to the Intel AppUp(sm) center. Architect Intel Corporation October 2009  –  March 2012  (2 years 6 months) Responsible for automating the validation process for applications submitted to the Intel AppUp(sm) center. President Plain Paper Consulting April 2008  –  December 2011  (3 years 9 months) Provide SOA education, guidance, and consulting to clients. President Plain Paper Consulting April 2008  –  December 2011  (3 years 9 months) Provide SOA education, guidance, and consulting to clients. Enterprise Architect Intel Corporation October 2005  –  April 2008  (2 years 7 months) Develop and evangelize a service-oriented architecture for the enterprise. Enterprise Architect Intel Corporation October 2005  –  April 2008  (2 years 7 months) Develop and evangelize a service-oriented architecture for the enterprise. Senior Software Engineer Intel Corporation October 1999  –  September 2005  (6 years) Lead software engineer responsible for architecting, developing and evangelizing .NET solutions in IT. Senior Software Engineer Intel Corporation October 1999  –  September 2005  (6 years) Lead software engineer responsible for architecting, developing and evangelizing .NET solutions in IT. Webmaster Cablesoft March 1997  –  October 1999  (2 years 8 months) Sole owner/developer of internal and external web sites as well as other infrastructure such as email server. Webmaster Cablesoft March 1997  –  October 1999  (2 years 8 months) Sole owner/developer of internal and external web sites as well as other infrastructure such as email server. Skills Application Architecture SOA Web Development Research Prototyping Software Development Software Engineering Agile Methodologies Enterprise Architecture Prototype System Architecture Web Services Distributed Systems Integration Cloud Computing Mobile Applications Android Mobile Devices Software Design Visual Studio Agile Project Management Object Oriented Design Perl Architectures Scrum Architecture See 11+     See less Skills  Application Architecture SOA Web Development Research Prototyping Software Development Software Engineering Agile Methodologies Enterprise Architecture Prototype System Architecture Web Services Distributed Systems Integration Cloud Computing Mobile Applications Android Mobile Devices Software Design Visual Studio Agile Project Management Object Oriented Design Perl Architectures Scrum Architecture See 11+     See less Application Architecture SOA Web Development Research Prototyping Software Development Software Engineering Agile Methodologies Enterprise Architecture Prototype System Architecture Web Services Distributed Systems Integration Cloud Computing Mobile Applications Android Mobile Devices Software Design Visual Studio Agile Project Management Object Oriented Design Perl Architectures Scrum Architecture See 11+     See less Application Architecture SOA Web Development Research Prototyping Software Development Software Engineering Agile Methodologies Enterprise Architecture Prototype System Architecture Web Services Distributed Systems Integration Cloud Computing Mobile Applications Android Mobile Devices Software Design Visual Studio Agile Project Management Object Oriented Design Perl Architectures Scrum Architecture See 11+     See less Education Luther College Education,  Mathematics 1989  – 1993 Activities and Societies:  Cross Country (co-captain) Luther College Education,  Mathematics 1989  – 1993 Activities and Societies:  Cross Country (co-captain) Luther College Education,  Mathematics 1989  – 1993 Activities and Societies:  Cross Country (co-captain) Luther College Education,  Mathematics 1989  – 1993 Activities and Societies:  Cross Country (co-captain) Honors & Awards Additional Honors & Awards – Patent for handling large files via web services \n– Award for implementing first internal blog site at Intel \n– Award for designing and deploying SOA solution at Intel Additional Honors & Awards – Patent for handling large files via web services \n– Award for implementing first internal blog site at Intel \n– Award for designing and deploying SOA solution at Intel Additional Honors & Awards – Patent for handling large files via web services \n– Award for implementing first internal blog site at Intel \n– Award for designing and deploying SOA solution at Intel Additional Honors & Awards – Patent for handling large files via web services \n– Award for implementing first internal blog site at Intel \n– Award for designing and deploying SOA solution at Intel ", "Experience Enterprise Architect Intel Corporation March 2004  – Present (11 years 6 months) Applications Developer Intel / Synergy Seven 2004  –  2005  (1 year) IT Director Signature Media Services 1995  –  1999  (4 years) Enterprise Architect Intel Corporation March 2004  – Present (11 years 6 months) Enterprise Architect Intel Corporation March 2004  – Present (11 years 6 months) Applications Developer Intel / Synergy Seven 2004  –  2005  (1 year) Applications Developer Intel / Synergy Seven 2004  –  2005  (1 year) IT Director Signature Media Services 1995  –  1999  (4 years) IT Director Signature Media Services 1995  –  1999  (4 years) Skills Software Project... Cloud Computing Software Development Microsoft SQL Server ASP.NET Data Center Integration Software Design Information Technology .NET Architecture SQL Security SDLC ITIL Database Design C# Agile Methodologies Software Engineering Unix Solution Architecture See 6+     See less Skills  Software Project... Cloud Computing Software Development Microsoft SQL Server ASP.NET Data Center Integration Software Design Information Technology .NET Architecture SQL Security SDLC ITIL Database Design C# Agile Methodologies Software Engineering Unix Solution Architecture See 6+     See less Software Project... Cloud Computing Software Development Microsoft SQL Server ASP.NET Data Center Integration Software Design Information Technology .NET Architecture SQL Security SDLC ITIL Database Design C# Agile Methodologies Software Engineering Unix Solution Architecture See 6+     See less Software Project... Cloud Computing Software Development Microsoft SQL Server ASP.NET Data Center Integration Software Design Information Technology .NET Architecture SQL Security SDLC ITIL Database Design C# Agile Methodologies Software Engineering Unix Solution Architecture See 6+     See less Education Pacific Lutheran University B.S.,  Computer Science 1992  – 1996 Pacific Lutheran University B.S.,  Computer Science 1992  – 1996 Pacific Lutheran University B.S.,  Computer Science 1992  – 1996 Pacific Lutheran University B.S.,  Computer Science 1992  – 1996 ", "Skills Intel System Architecture Computer Architecture Semiconductors Debugging Embedded Systems High Performance... Go-to-market Strategy Device Drivers EDA Hardware Embedded Software Multithreading Skills  Intel System Architecture Computer Architecture Semiconductors Debugging Embedded Systems High Performance... Go-to-market Strategy Device Drivers EDA Hardware Embedded Software Multithreading Intel System Architecture Computer Architecture Semiconductors Debugging Embedded Systems High Performance... Go-to-market Strategy Device Drivers EDA Hardware Embedded Software Multithreading Intel System Architecture Computer Architecture Semiconductors Debugging Embedded Systems High Performance... Go-to-market Strategy Device Drivers EDA Hardware Embedded Software Multithreading ", "Summary Design, develop and deploy software applications to help keep the internals of a company running smoothly utilizing any technology to get the job done. Experienced in all Microsoft tools, languages and hosting environments as well as MGI, CFM, and PHP. Specialties:Software Design, Interface Design, User Experience, Social Media Summary Design, develop and deploy software applications to help keep the internals of a company running smoothly utilizing any technology to get the job done. Experienced in all Microsoft tools, languages and hosting environments as well as MGI, CFM, and PHP. Specialties:Software Design, Interface Design, User Experience, Social Media Design, develop and deploy software applications to help keep the internals of a company running smoothly utilizing any technology to get the job done. Experienced in all Microsoft tools, languages and hosting environments as well as MGI, CFM, and PHP. Specialties:Software Design, Interface Design, User Experience, Social Media Design, develop and deploy software applications to help keep the internals of a company running smoothly utilizing any technology to get the job done. Experienced in all Microsoft tools, languages and hosting environments as well as MGI, CFM, and PHP. Specialties:Software Design, Interface Design, User Experience, Social Media Experience Enterprise Architect Intel Corporation July 2010  – Present (5 years 2 months) Chandler, Arizona Intel IT Strategy, Architecture and Innovation (SAI) as an Enterprise Architect focusing on application development, mobilization and collaboration technologies. Software Engineer/Architect Intel Corporation April 1995  –  July 2010  (15 years 4 months) Design, Build, Deploy and Support applications used internally to assist in the effective running of our company. Administrator Halo.Bungie.Org 2000  –  2008  (8 years) Helped manage activities on multiple sections of the site including forum, submissions, news and administrator collaboration. Nuclear Chemical Technician US Navy December 1986  –  April 1995  (8 years 5 months) Was an Engineering Laboratory Technician (MM1/SS), running a department as the Leading Petty Officer on the USS Bluefish for five years.. During my 8+ years in the Navy, I was a student, a teacher (Nuclear Prototype, MTS-635) and a leader. Enterprise Architect Intel Corporation July 2010  – Present (5 years 2 months) Chandler, Arizona Intel IT Strategy, Architecture and Innovation (SAI) as an Enterprise Architect focusing on application development, mobilization and collaboration technologies. Enterprise Architect Intel Corporation July 2010  – Present (5 years 2 months) Chandler, Arizona Intel IT Strategy, Architecture and Innovation (SAI) as an Enterprise Architect focusing on application development, mobilization and collaboration technologies. Software Engineer/Architect Intel Corporation April 1995  –  July 2010  (15 years 4 months) Design, Build, Deploy and Support applications used internally to assist in the effective running of our company. Software Engineer/Architect Intel Corporation April 1995  –  July 2010  (15 years 4 months) Design, Build, Deploy and Support applications used internally to assist in the effective running of our company. Administrator Halo.Bungie.Org 2000  –  2008  (8 years) Helped manage activities on multiple sections of the site including forum, submissions, news and administrator collaboration. Administrator Halo.Bungie.Org 2000  –  2008  (8 years) Helped manage activities on multiple sections of the site including forum, submissions, news and administrator collaboration. Nuclear Chemical Technician US Navy December 1986  –  April 1995  (8 years 5 months) Was an Engineering Laboratory Technician (MM1/SS), running a department as the Leading Petty Officer on the USS Bluefish for five years.. During my 8+ years in the Navy, I was a student, a teacher (Nuclear Prototype, MTS-635) and a leader. Nuclear Chemical Technician US Navy December 1986  –  April 1995  (8 years 5 months) Was an Engineering Laboratory Technician (MM1/SS), running a department as the Leading Petty Officer on the USS Bluefish for five years.. During my 8+ years in the Navy, I was a student, a teacher (Nuclear Prototype, MTS-635) and a leader. Skills Software Design User Interface Design User Experience Social Media Software Development Architecture Perl .NET Web Services Agile Methodologies XML C# IT Strategy Mobile Applications PHP SOA Architectures Scrum Cloud Computing Enterprise Architecture Enterprise Software HTML 5 jQuery Software Engineering Business Process Java Integration Software Project... HTML See 14+     See less Skills  Software Design User Interface Design User Experience Social Media Software Development Architecture Perl .NET Web Services Agile Methodologies XML C# IT Strategy Mobile Applications PHP SOA Architectures Scrum Cloud Computing Enterprise Architecture Enterprise Software HTML 5 jQuery Software Engineering Business Process Java Integration Software Project... HTML See 14+     See less Software Design User Interface Design User Experience Social Media Software Development Architecture Perl .NET Web Services Agile Methodologies XML C# IT Strategy Mobile Applications PHP SOA Architectures Scrum Cloud Computing Enterprise Architecture Enterprise Software HTML 5 jQuery Software Engineering Business Process Java Integration Software Project... HTML See 14+     See less Software Design User Interface Design User Experience Social Media Software Development Architecture Perl .NET Web Services Agile Methodologies XML C# IT Strategy Mobile Applications PHP SOA Architectures Scrum Cloud Computing Enterprise Architecture Enterprise Software HTML 5 jQuery Software Engineering Business Process Java Integration Software Project... HTML See 14+     See less ", "Languages English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency Ukrainian Limited working proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency Ukrainian Limited working proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency Ukrainian Limited working proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Computer Architecture Programming Multithreading Systems Engineering Embedded Systems Verilog Semiconductors Debugging Embedded Software Software Development Processors System Architecture R&D Software Engineering Software Design Enterprise Architecture Enterprise Software Microsoft SQL Server SQL Tuning Business Intelligence Microsoft BI Suite C# Python Object Oriented Design See 9+     See less Skills  Computer Architecture Programming Multithreading Systems Engineering Embedded Systems Verilog Semiconductors Debugging Embedded Software Software Development Processors System Architecture R&D Software Engineering Software Design Enterprise Architecture Enterprise Software Microsoft SQL Server SQL Tuning Business Intelligence Microsoft BI Suite C# Python Object Oriented Design See 9+     See less Computer Architecture Programming Multithreading Systems Engineering Embedded Systems Verilog Semiconductors Debugging Embedded Software Software Development Processors System Architecture R&D Software Engineering Software Design Enterprise Architecture Enterprise Software Microsoft SQL Server SQL Tuning Business Intelligence Microsoft BI Suite C# Python Object Oriented Design See 9+     See less Computer Architecture Programming Multithreading Systems Engineering Embedded Systems Verilog Semiconductors Debugging Embedded Software Software Development Processors System Architecture R&D Software Engineering Software Design Enterprise Architecture Enterprise Software Microsoft SQL Server SQL Tuning Business Intelligence Microsoft BI Suite C# Python Object Oriented Design See 9+     See less "]}