{"position": "Event Manager", "company": "Intel Corporation", "profiles": ["Experience Software Community Manager Intel Corporation January 2014  – Present (1 year 8 months) Shanghai City, China - Manage Intel® IoT (Internet of Things) Developer Program in PRC which includes the development kit, developer community, and program marketing; \n- Manage Intel® Academic Community of Intel® Developer Zone in PRC to accelerate Intel technology adoption in Chinese academia. \n- Explore new working methodology to scale Intel developer program impact to broader audience. Training & Academic Program Manager Intel Corporation January 2007  –  December 2013  (7 years) Shanghai City, China - Manage Intel academic programs including university program planning & execution; faculty training workshop, student contest, industry-academia collaboration; \n- Manage the online Chinese version Intel academic community to support Intel university program, and build the community as one-stop resource sharing and communication platform for faculties; \n- Collaborate with 3rd party partner to scale Intel university program to Tier 2/3 universities;  \n- Manage Intel Software College training program in PRC, including training consultancy, class delivery, program marketing, course content refresh and instructor development; APAC Training Event Manager Intel Corporation November 2004  –  December 2006  (2 years 2 months) Shanghai City, China - Manage Intel Software College training events in APAC, including training requirement analyses, course customization, resource consolidation, HW & SW environment setup and training quality control; \n- Work with WW training event team on training setup and lab validation process, as well as training delivery management; \n- Lead worldwide Intel Software College instructor development, as well as develop local instructors and maintain the relationship with linked teams; Software Community Manager Intel Corporation January 2014  – Present (1 year 8 months) Shanghai City, China - Manage Intel® IoT (Internet of Things) Developer Program in PRC which includes the development kit, developer community, and program marketing; \n- Manage Intel® Academic Community of Intel® Developer Zone in PRC to accelerate Intel technology adoption in Chinese academia. \n- Explore new working methodology to scale Intel developer program impact to broader audience. Software Community Manager Intel Corporation January 2014  – Present (1 year 8 months) Shanghai City, China - Manage Intel® IoT (Internet of Things) Developer Program in PRC which includes the development kit, developer community, and program marketing; \n- Manage Intel® Academic Community of Intel® Developer Zone in PRC to accelerate Intel technology adoption in Chinese academia. \n- Explore new working methodology to scale Intel developer program impact to broader audience. Training & Academic Program Manager Intel Corporation January 2007  –  December 2013  (7 years) Shanghai City, China - Manage Intel academic programs including university program planning & execution; faculty training workshop, student contest, industry-academia collaboration; \n- Manage the online Chinese version Intel academic community to support Intel university program, and build the community as one-stop resource sharing and communication platform for faculties; \n- Collaborate with 3rd party partner to scale Intel university program to Tier 2/3 universities;  \n- Manage Intel Software College training program in PRC, including training consultancy, class delivery, program marketing, course content refresh and instructor development; Training & Academic Program Manager Intel Corporation January 2007  –  December 2013  (7 years) Shanghai City, China - Manage Intel academic programs including university program planning & execution; faculty training workshop, student contest, industry-academia collaboration; \n- Manage the online Chinese version Intel academic community to support Intel university program, and build the community as one-stop resource sharing and communication platform for faculties; \n- Collaborate with 3rd party partner to scale Intel university program to Tier 2/3 universities;  \n- Manage Intel Software College training program in PRC, including training consultancy, class delivery, program marketing, course content refresh and instructor development; APAC Training Event Manager Intel Corporation November 2004  –  December 2006  (2 years 2 months) Shanghai City, China - Manage Intel Software College training events in APAC, including training requirement analyses, course customization, resource consolidation, HW & SW environment setup and training quality control; \n- Work with WW training event team on training setup and lab validation process, as well as training delivery management; \n- Lead worldwide Intel Software College instructor development, as well as develop local instructors and maintain the relationship with linked teams; APAC Training Event Manager Intel Corporation November 2004  –  December 2006  (2 years 2 months) Shanghai City, China - Manage Intel Software College training events in APAC, including training requirement analyses, course customization, resource consolidation, HW & SW environment setup and training quality control; \n- Work with WW training event team on training setup and lab validation process, as well as training delivery management; \n- Lead worldwide Intel Software College instructor development, as well as develop local instructors and maintain the relationship with linked teams; Languages English English English Skills Customer Relations Coordination Intel Training Customer Service Management CRM Program Management Cross-functional Team... Analysis Marketing Product Management Go-to-market Strategy Embedded Systems Computer Architecture Software Development Cloud Computing Strategy Product Marketing See 4+     See less Skills  Customer Relations Coordination Intel Training Customer Service Management CRM Program Management Cross-functional Team... Analysis Marketing Product Management Go-to-market Strategy Embedded Systems Computer Architecture Software Development Cloud Computing Strategy Product Marketing See 4+     See less Customer Relations Coordination Intel Training Customer Service Management CRM Program Management Cross-functional Team... Analysis Marketing Product Management Go-to-market Strategy Embedded Systems Computer Architecture Software Development Cloud Computing Strategy Product Marketing See 4+     See less Customer Relations Coordination Intel Training Customer Service Management CRM Program Management Cross-functional Team... Analysis Marketing Product Management Go-to-market Strategy Embedded Systems Computer Architecture Software Development Cloud Computing Strategy Product Marketing See 4+     See less Education Northwestern Poly-technical University Master of Software Project Management,  Computer Software Engineering 1999  – 2006 Study Computer Science knowledge to get my BC & MS degree. Northwestern Poly-technicalUniversity Master of Computer Science & Technology,  Computer Software Engineering 1999  – 2006 Study Computer Science knowledge to get my BC & MS degree Northwestern Poly-technical University Master of Software Project Management,  Computer Software Engineering 1999  – 2006 Study Computer Science knowledge to get my BC & MS degree. Northwestern Poly-technical University Master of Software Project Management,  Computer Software Engineering 1999  – 2006 Study Computer Science knowledge to get my BC & MS degree. Northwestern Poly-technical University Master of Software Project Management,  Computer Software Engineering 1999  – 2006 Study Computer Science knowledge to get my BC & MS degree. Northwestern Poly-technicalUniversity Master of Computer Science & Technology,  Computer Software Engineering 1999  – 2006 Study Computer Science knowledge to get my BC & MS degree Northwestern Poly-technicalUniversity Master of Computer Science & Technology,  Computer Software Engineering 1999  – 2006 Study Computer Science knowledge to get my BC & MS degree Northwestern Poly-technicalUniversity Master of Computer Science & Technology,  Computer Software Engineering 1999  – 2006 Study Computer Science knowledge to get my BC & MS degree ", "Experience Marketing manager Intel Corporation June 2011  – Present (4 years 3 months) Swindon, United Kingdom Marketing and loyalty programme Co-ordinator ICLP May 2010  –  June 2011  (1 year 2 months) I work for ICLP a marketing and loyalty agency, responsible for running a membership benefit for a large bluechip company. Membership Events Co-ordinator for RCO Intel EMEA Intel July 2008  –  August 2009  (1 year 2 months) The main project during this position, was facilitating and co-owning a prestigious event for over 800 Intel Channel Members held in Prague. The position involved overseeing all areas of the event, from marketing and communications, event messaging, event logistics, tactical positioning and event data analysis. \n \nThe project-led role included the facilitation of channel events and trainings throughout the EMEA region. Marketing manager Intel Corporation June 2011  – Present (4 years 3 months) Swindon, United Kingdom Marketing manager Intel Corporation June 2011  – Present (4 years 3 months) Swindon, United Kingdom Marketing and loyalty programme Co-ordinator ICLP May 2010  –  June 2011  (1 year 2 months) I work for ICLP a marketing and loyalty agency, responsible for running a membership benefit for a large bluechip company. Marketing and loyalty programme Co-ordinator ICLP May 2010  –  June 2011  (1 year 2 months) I work for ICLP a marketing and loyalty agency, responsible for running a membership benefit for a large bluechip company. Membership Events Co-ordinator for RCO Intel EMEA Intel July 2008  –  August 2009  (1 year 2 months) The main project during this position, was facilitating and co-owning a prestigious event for over 800 Intel Channel Members held in Prague. The position involved overseeing all areas of the event, from marketing and communications, event messaging, event logistics, tactical positioning and event data analysis. \n \nThe project-led role included the facilitation of channel events and trainings throughout the EMEA region. Membership Events Co-ordinator for RCO Intel EMEA Intel July 2008  –  August 2009  (1 year 2 months) The main project during this position, was facilitating and co-owning a prestigious event for over 800 Intel Channel Members held in Prague. The position involved overseeing all areas of the event, from marketing and communications, event messaging, event logistics, tactical positioning and event data analysis. \n \nThe project-led role included the facilitation of channel events and trainings throughout the EMEA region. Skills Event Planning Intel Conferences Event Management Product Marketing Fundraising Channel Promotions Market Development Embedded Systems Resellers Marketing Management B2B Marketing Management Go-to-market Strategy Marketing Strategy See 1+     See less Skills  Event Planning Intel Conferences Event Management Product Marketing Fundraising Channel Promotions Market Development Embedded Systems Resellers Marketing Management B2B Marketing Management Go-to-market Strategy Marketing Strategy See 1+     See less Event Planning Intel Conferences Event Management Product Marketing Fundraising Channel Promotions Market Development Embedded Systems Resellers Marketing Management B2B Marketing Management Go-to-market Strategy Marketing Strategy See 1+     See less Event Planning Intel Conferences Event Management Product Marketing Fundraising Channel Promotions Market Development Embedded Systems Resellers Marketing Management B2B Marketing Management Go-to-market Strategy Marketing Strategy See 1+     See less Education University of Gloucestershire BA hons,  Events Management 2006  – 2010 University of Gloucestershire BA hons,  Events Management 2006  – 2010 University of Gloucestershire BA hons,  Events Management 2006  – 2010 University of Gloucestershire BA hons,  Events Management 2006  – 2010 ", "Experience Director Brand Box Entertainment Pvt. Ltd. January 2007  – Present (8 years 8 months) Mumbai Area, India \"Every success is built on the ability to do better than good enough.\" \n \nA brand is often built in a boardroom long before it reaches the markets. Brand Box specializes in providing strategic brand building inputs, taking into account the category momentum, consumer insights and available positions in the consumer's mind, which the brand can occupy and own. \n \nWe believe in being partners rather than suppliers to our clients,  \nliving the process of brand building and offering new strategic inputs or modifying existing ones at each step of the process. \n \nOur Expertise: \nBTL Activities \nEvent Conceptualization & Management \nIntegrated Marketing Solutions \nCorporate Brand Communications \nRetail Identity Programs \nTrade Channel Solutions \nMedia Related Services \n \nThe Moto of our organization is Innovation, Ideation & Perfection and our work completely reflects the same. Head - Client Servicing R K Swamy BBDO Group, Hansa Events 2005  –  2007  (2 years) Mumbai Area, India Headed the client servicing in Mumbai, conceptualizing and executing integrated market services, activation and retail programs for clients nationally which would enhance their brand awareness. In-charge of key accounts like ‘HSBC Bank, Raymond, Kodak, Birla Sunlife Insurance, Piaggio, Palmolive, VISA etc. \n \nKey Achievements: \n• Successfully executed Pan India grooming workshops for Raymond in major corporate's and educational institutions (Management & Engineering colleges). \n• Executed a Maha-Utsav spanning 44 cities and a roadshow covering 130 cities and towns for Piaggio’s three wheeler- Ape’. \n• Planned and executed Pan India basis the first ever HSBC Bank Premier Banking - Go Green Activity. \n• Planned and executed, the first ever music launch event for a Bollywood film, aboard the aircraft carrier, IMS Vikrant, for 1971. Head - Marketing & Event Asapp Media Pvt. Ltd. 2005  –  2005  (less than a year) Mumbai Area, India - Conceptualized & Successfully executed the 1st ever Corporate Award Function, CONSTRUCTION WORLD ANNUAL AWARDS attended by Blue Chip Corporate CEO's & COO's which was covered in NDTV. \n- CW ARCHITECT & BUILDER AWARDS which felicitate the top architects and builders in the country \n- KPMG INFRASTRUCTURE TODAY AWARDS, India's first-ever infrastructure awards, which recognize excellence across infrastructure sectors. Sr. Financial Adviser (HNI) & Event Manager Citigroup 2003  –  2005  (2 years) Mumbai Area, India - Handling a team of 15 Sr. Financial Advisors and under them 125 sales field advisors.  \nTo create a successful brand stands up for Women's Banking. \n- Handle and manage annual media budgets for customer acquisition through campaigns for BTL, web, radio, direct mail, email marketing. \n- Work closely with Marketing Research team to obtain relevant information, including the development and implementation of the Product initiative.  \n- Designing Cross Branding Activities in collaboration with Channel Partners & Retailers.  \n- Liaison with Vendors, Retailers for all BTL activities \n- BTL & ATL Planning for all ATL (Promotions, Radio, Print Plans & Outdoor) campaigns. \n- Understand the market gaps & customer perspective on all Women Banking products. \n- Collaborate with cross-functional teams from Legal, produce development, compliance and sales for sales campaign management and performance tracking \n \nKey Achievements: \n•\tAppreciated as Best Team Manager Woman’s Department – (All India sales). \n•\tAppreciated as Best Trainer month on month by Business Manager (Asia Pacific). \n•\tAppreciated as Best Event Organized and Managed (Oct – Nov – Dec’03/ May – June’04) by Vice President Woman’s Banking. \n•\tAppreciated as “Shooting Star Award” for 2nd and 3rd Quarter. Event Manager Intel Corporation - J.L.Marketing Services Pvt. Ltd. March 1999  –  September 2003  (4 years 7 months) Mumbai Area, India Key Responsibilities \n- Managing Retail Channel Relationship  \n- Supporting Intel Marketing Team to Design, Develop & Execute B2B & B2C BTL activities. \n- Motivating Retail dealers and increasing sales by supporting them thru promotions & events. \n- Analyzing and sending daily, weekly and monthly Sales report of Retail Channel Partners to the Head Office & Intel \n- Coordinating with Intel officials and Retail Channel Partners for Training's, Exhibition and Promo Launches  \n- Expansion of Dealers & Retail Channel breadth \n- Branding of Intel in the market, by giving and putting POP support to all GID and Retail Channel Partners \n \nKey Achievements: \n• Appreciated as the BEST Presenter award in “Intel – Idea for Tomorrow” program. \n• Conducted the first ever Roadshow Pan India in India \n• Successfully conceptualized, Executed & Managed many BTL activities for B2C & B2B. \n• Awarded the “Youngest Event Buzzer” award during Intel – Road to Success Director Brand Box Entertainment Pvt. Ltd. January 2007  – Present (8 years 8 months) Mumbai Area, India \"Every success is built on the ability to do better than good enough.\" \n \nA brand is often built in a boardroom long before it reaches the markets. Brand Box specializes in providing strategic brand building inputs, taking into account the category momentum, consumer insights and available positions in the consumer's mind, which the brand can occupy and own. \n \nWe believe in being partners rather than suppliers to our clients,  \nliving the process of brand building and offering new strategic inputs or modifying existing ones at each step of the process. \n \nOur Expertise: \nBTL Activities \nEvent Conceptualization & Management \nIntegrated Marketing Solutions \nCorporate Brand Communications \nRetail Identity Programs \nTrade Channel Solutions \nMedia Related Services \n \nThe Moto of our organization is Innovation, Ideation & Perfection and our work completely reflects the same. Director Brand Box Entertainment Pvt. Ltd. January 2007  – Present (8 years 8 months) Mumbai Area, India \"Every success is built on the ability to do better than good enough.\" \n \nA brand is often built in a boardroom long before it reaches the markets. Brand Box specializes in providing strategic brand building inputs, taking into account the category momentum, consumer insights and available positions in the consumer's mind, which the brand can occupy and own. \n \nWe believe in being partners rather than suppliers to our clients,  \nliving the process of brand building and offering new strategic inputs or modifying existing ones at each step of the process. \n \nOur Expertise: \nBTL Activities \nEvent Conceptualization & Management \nIntegrated Marketing Solutions \nCorporate Brand Communications \nRetail Identity Programs \nTrade Channel Solutions \nMedia Related Services \n \nThe Moto of our organization is Innovation, Ideation & Perfection and our work completely reflects the same. Head - Client Servicing R K Swamy BBDO Group, Hansa Events 2005  –  2007  (2 years) Mumbai Area, India Headed the client servicing in Mumbai, conceptualizing and executing integrated market services, activation and retail programs for clients nationally which would enhance their brand awareness. In-charge of key accounts like ‘HSBC Bank, Raymond, Kodak, Birla Sunlife Insurance, Piaggio, Palmolive, VISA etc. \n \nKey Achievements: \n• Successfully executed Pan India grooming workshops for Raymond in major corporate's and educational institutions (Management & Engineering colleges). \n• Executed a Maha-Utsav spanning 44 cities and a roadshow covering 130 cities and towns for Piaggio’s three wheeler- Ape’. \n• Planned and executed Pan India basis the first ever HSBC Bank Premier Banking - Go Green Activity. \n• Planned and executed, the first ever music launch event for a Bollywood film, aboard the aircraft carrier, IMS Vikrant, for 1971. Head - Client Servicing R K Swamy BBDO Group, Hansa Events 2005  –  2007  (2 years) Mumbai Area, India Headed the client servicing in Mumbai, conceptualizing and executing integrated market services, activation and retail programs for clients nationally which would enhance their brand awareness. In-charge of key accounts like ‘HSBC Bank, Raymond, Kodak, Birla Sunlife Insurance, Piaggio, Palmolive, VISA etc. \n \nKey Achievements: \n• Successfully executed Pan India grooming workshops for Raymond in major corporate's and educational institutions (Management & Engineering colleges). \n• Executed a Maha-Utsav spanning 44 cities and a roadshow covering 130 cities and towns for Piaggio’s three wheeler- Ape’. \n• Planned and executed Pan India basis the first ever HSBC Bank Premier Banking - Go Green Activity. \n• Planned and executed, the first ever music launch event for a Bollywood film, aboard the aircraft carrier, IMS Vikrant, for 1971. Head - Marketing & Event Asapp Media Pvt. Ltd. 2005  –  2005  (less than a year) Mumbai Area, India - Conceptualized & Successfully executed the 1st ever Corporate Award Function, CONSTRUCTION WORLD ANNUAL AWARDS attended by Blue Chip Corporate CEO's & COO's which was covered in NDTV. \n- CW ARCHITECT & BUILDER AWARDS which felicitate the top architects and builders in the country \n- KPMG INFRASTRUCTURE TODAY AWARDS, India's first-ever infrastructure awards, which recognize excellence across infrastructure sectors. Head - Marketing & Event Asapp Media Pvt. Ltd. 2005  –  2005  (less than a year) Mumbai Area, India - Conceptualized & Successfully executed the 1st ever Corporate Award Function, CONSTRUCTION WORLD ANNUAL AWARDS attended by Blue Chip Corporate CEO's & COO's which was covered in NDTV. \n- CW ARCHITECT & BUILDER AWARDS which felicitate the top architects and builders in the country \n- KPMG INFRASTRUCTURE TODAY AWARDS, India's first-ever infrastructure awards, which recognize excellence across infrastructure sectors. Sr. Financial Adviser (HNI) & Event Manager Citigroup 2003  –  2005  (2 years) Mumbai Area, India - Handling a team of 15 Sr. Financial Advisors and under them 125 sales field advisors.  \nTo create a successful brand stands up for Women's Banking. \n- Handle and manage annual media budgets for customer acquisition through campaigns for BTL, web, radio, direct mail, email marketing. \n- Work closely with Marketing Research team to obtain relevant information, including the development and implementation of the Product initiative.  \n- Designing Cross Branding Activities in collaboration with Channel Partners & Retailers.  \n- Liaison with Vendors, Retailers for all BTL activities \n- BTL & ATL Planning for all ATL (Promotions, Radio, Print Plans & Outdoor) campaigns. \n- Understand the market gaps & customer perspective on all Women Banking products. \n- Collaborate with cross-functional teams from Legal, produce development, compliance and sales for sales campaign management and performance tracking \n \nKey Achievements: \n•\tAppreciated as Best Team Manager Woman’s Department – (All India sales). \n•\tAppreciated as Best Trainer month on month by Business Manager (Asia Pacific). \n•\tAppreciated as Best Event Organized and Managed (Oct – Nov – Dec’03/ May – June’04) by Vice President Woman’s Banking. \n•\tAppreciated as “Shooting Star Award” for 2nd and 3rd Quarter. Sr. Financial Adviser (HNI) & Event Manager Citigroup 2003  –  2005  (2 years) Mumbai Area, India - Handling a team of 15 Sr. Financial Advisors and under them 125 sales field advisors.  \nTo create a successful brand stands up for Women's Banking. \n- Handle and manage annual media budgets for customer acquisition through campaigns for BTL, web, radio, direct mail, email marketing. \n- Work closely with Marketing Research team to obtain relevant information, including the development and implementation of the Product initiative.  \n- Designing Cross Branding Activities in collaboration with Channel Partners & Retailers.  \n- Liaison with Vendors, Retailers for all BTL activities \n- BTL & ATL Planning for all ATL (Promotions, Radio, Print Plans & Outdoor) campaigns. \n- Understand the market gaps & customer perspective on all Women Banking products. \n- Collaborate with cross-functional teams from Legal, produce development, compliance and sales for sales campaign management and performance tracking \n \nKey Achievements: \n•\tAppreciated as Best Team Manager Woman’s Department – (All India sales). \n•\tAppreciated as Best Trainer month on month by Business Manager (Asia Pacific). \n•\tAppreciated as Best Event Organized and Managed (Oct – Nov – Dec’03/ May – June’04) by Vice President Woman’s Banking. \n•\tAppreciated as “Shooting Star Award” for 2nd and 3rd Quarter. Event Manager Intel Corporation - J.L.Marketing Services Pvt. Ltd. March 1999  –  September 2003  (4 years 7 months) Mumbai Area, India Key Responsibilities \n- Managing Retail Channel Relationship  \n- Supporting Intel Marketing Team to Design, Develop & Execute B2B & B2C BTL activities. \n- Motivating Retail dealers and increasing sales by supporting them thru promotions & events. \n- Analyzing and sending daily, weekly and monthly Sales report of Retail Channel Partners to the Head Office & Intel \n- Coordinating with Intel officials and Retail Channel Partners for Training's, Exhibition and Promo Launches  \n- Expansion of Dealers & Retail Channel breadth \n- Branding of Intel in the market, by giving and putting POP support to all GID and Retail Channel Partners \n \nKey Achievements: \n• Appreciated as the BEST Presenter award in “Intel – Idea for Tomorrow” program. \n• Conducted the first ever Roadshow Pan India in India \n• Successfully conceptualized, Executed & Managed many BTL activities for B2C & B2B. \n• Awarded the “Youngest Event Buzzer” award during Intel – Road to Success Event Manager Intel Corporation - J.L.Marketing Services Pvt. Ltd. March 1999  –  September 2003  (4 years 7 months) Mumbai Area, India Key Responsibilities \n- Managing Retail Channel Relationship  \n- Supporting Intel Marketing Team to Design, Develop & Execute B2B & B2C BTL activities. \n- Motivating Retail dealers and increasing sales by supporting them thru promotions & events. \n- Analyzing and sending daily, weekly and monthly Sales report of Retail Channel Partners to the Head Office & Intel \n- Coordinating with Intel officials and Retail Channel Partners for Training's, Exhibition and Promo Launches  \n- Expansion of Dealers & Retail Channel breadth \n- Branding of Intel in the market, by giving and putting POP support to all GID and Retail Channel Partners \n \nKey Achievements: \n• Appreciated as the BEST Presenter award in “Intel – Idea for Tomorrow” program. \n• Conducted the first ever Roadshow Pan India in India \n• Successfully conceptualized, Executed & Managed many BTL activities for B2C & B2B. \n• Awarded the “Youngest Event Buzzer” award during Intel – Road to Success Languages English Native or bilingual proficiency Hindi Marathi Gujarati Tulu Limited working proficiency English Native or bilingual proficiency Hindi Marathi Gujarati Tulu Limited working proficiency English Native or bilingual proficiency Hindi Marathi Gujarati Tulu Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Event Management Customer Satisfaction Marketing Strategy Marketing Team Management CRM Brand Management Competitive Analysis Business Development Market Research Marketing Management Project Planning Product Launch Integrated Marketing Skills  Event Management Customer Satisfaction Marketing Strategy Marketing Team Management CRM Brand Management Competitive Analysis Business Development Market Research Marketing Management Project Planning Product Launch Integrated Marketing Event Management Customer Satisfaction Marketing Strategy Marketing Team Management CRM Brand Management Competitive Analysis Business Development Market Research Marketing Management Project Planning Product Launch Integrated Marketing Event Management Customer Satisfaction Marketing Strategy Marketing Team Management CRM Brand Management Competitive Analysis Business Development Market Research Marketing Management Project Planning Product Launch Integrated Marketing Education Mumbai University Bachelor in Management Studies,  Finance 2003 United Business Institute - Belgium International Masters in Business Management - MBA,  Marketing 2010 Mumbai University Bachelor in Management Studies,  Finance 2003 Mumbai University Bachelor in Management Studies,  Finance 2003 Mumbai University Bachelor in Management Studies,  Finance 2003 United Business Institute - Belgium International Masters in Business Management - MBA,  Marketing 2010 United Business Institute - Belgium International Masters in Business Management - MBA,  Marketing 2010 United Business Institute - Belgium International Masters in Business Management - MBA,  Marketing 2010 ", "Summary  7 years experiences in event marketing promotion, management and execution \n Strong ability to develop and implement marketing communications programs \n Strong ability to gain stake holders and partner's loyalty \n Rich experience in suppliers and vendors selection, management and evaluation Summary  7 years experiences in event marketing promotion, management and execution \n Strong ability to develop and implement marketing communications programs \n Strong ability to gain stake holders and partner's loyalty \n Rich experience in suppliers and vendors selection, management and evaluation  7 years experiences in event marketing promotion, management and execution \n Strong ability to develop and implement marketing communications programs \n Strong ability to gain stake holders and partner's loyalty \n Rich experience in suppliers and vendors selection, management and evaluation  7 years experiences in event marketing promotion, management and execution \n Strong ability to develop and implement marketing communications programs \n Strong ability to gain stake holders and partner's loyalty \n Rich experience in suppliers and vendors selection, management and evaluation Experience Marcom Manager Alstom Group June 2011  – Present (4 years 3 months) Beijing City, China - Design and execute external marcom events and media event for Corporate and Business Units of Transport, Power and Grid, such as Exhibition, Customer Event, Seminar according to Country Comms Plan and ad-hoc requests from Corporate and Sectors. \n \n- Supervise Services Providers of event execution, fabrication, AV, manpower, logistics etc.to meet high standers. \n \n- Familiar with company’s branding guidelines and graphic charts and ensure of company’s branding guideline consistency in all term of application. \n \n- Social Media Platform Management: Content support on development of social media and its platform management; Follower subscription program. \n \n- Develop local version of business and sectors videos, brochures and promotional tools in the frame of visual identity guidelines. Supervise services providers of translation, printing etc. To meet company’s global publication and visual standards. Event Manager Intel Corporation December 2010  –  May 2011  (6 months) Beijing City, China - In charge of organizing Executives Meeting, Media Event, Filed Team Program, Event \nSales & Sponsorship and other marketing program. \n \n- Intel Developer Forum (IDF) Project Manager to assist APAC Project Lead. IDF participants Engagement program. \n \n- Event Postmortem and post event evaluation. Senior Event Manager George P Johnson Experience Marketing February 2007  –  November 2010  (3 years 10 months) Beijing City, China - Annually manage more than 20 various levels of projects, from Grand Conference, CEO visit to channel meeting and road-show. \n \n- Develop and produce innovative, profitable event concepts and budget proposals in accordance with client's brief. \n \n- Ensure that accurate terms and conditions together with relevant purchase orders are raised, dispatched and returned in accordance with the client's stated schedule. \n \n- Supervise service providers of Fabrication, Production, Audio and Video, Manpower, Logistics etc to meet the event standard with high quality. \n \n- Timely post event evaluation, and budget reconciliation and billing. Marcom Manager Alstom Group June 2011  – Present (4 years 3 months) Beijing City, China - Design and execute external marcom events and media event for Corporate and Business Units of Transport, Power and Grid, such as Exhibition, Customer Event, Seminar according to Country Comms Plan and ad-hoc requests from Corporate and Sectors. \n \n- Supervise Services Providers of event execution, fabrication, AV, manpower, logistics etc.to meet high standers. \n \n- Familiar with company’s branding guidelines and graphic charts and ensure of company’s branding guideline consistency in all term of application. \n \n- Social Media Platform Management: Content support on development of social media and its platform management; Follower subscription program. \n \n- Develop local version of business and sectors videos, brochures and promotional tools in the frame of visual identity guidelines. Supervise services providers of translation, printing etc. To meet company’s global publication and visual standards. Marcom Manager Alstom Group June 2011  – Present (4 years 3 months) Beijing City, China - Design and execute external marcom events and media event for Corporate and Business Units of Transport, Power and Grid, such as Exhibition, Customer Event, Seminar according to Country Comms Plan and ad-hoc requests from Corporate and Sectors. \n \n- Supervise Services Providers of event execution, fabrication, AV, manpower, logistics etc.to meet high standers. \n \n- Familiar with company’s branding guidelines and graphic charts and ensure of company’s branding guideline consistency in all term of application. \n \n- Social Media Platform Management: Content support on development of social media and its platform management; Follower subscription program. \n \n- Develop local version of business and sectors videos, brochures and promotional tools in the frame of visual identity guidelines. Supervise services providers of translation, printing etc. To meet company’s global publication and visual standards. Event Manager Intel Corporation December 2010  –  May 2011  (6 months) Beijing City, China - In charge of organizing Executives Meeting, Media Event, Filed Team Program, Event \nSales & Sponsorship and other marketing program. \n \n- Intel Developer Forum (IDF) Project Manager to assist APAC Project Lead. IDF participants Engagement program. \n \n- Event Postmortem and post event evaluation. Event Manager Intel Corporation December 2010  –  May 2011  (6 months) Beijing City, China - In charge of organizing Executives Meeting, Media Event, Filed Team Program, Event \nSales & Sponsorship and other marketing program. \n \n- Intel Developer Forum (IDF) Project Manager to assist APAC Project Lead. IDF participants Engagement program. \n \n- Event Postmortem and post event evaluation. Senior Event Manager George P Johnson Experience Marketing February 2007  –  November 2010  (3 years 10 months) Beijing City, China - Annually manage more than 20 various levels of projects, from Grand Conference, CEO visit to channel meeting and road-show. \n \n- Develop and produce innovative, profitable event concepts and budget proposals in accordance with client's brief. \n \n- Ensure that accurate terms and conditions together with relevant purchase orders are raised, dispatched and returned in accordance with the client's stated schedule. \n \n- Supervise service providers of Fabrication, Production, Audio and Video, Manpower, Logistics etc to meet the event standard with high quality. \n \n- Timely post event evaluation, and budget reconciliation and billing. Senior Event Manager George P Johnson Experience Marketing February 2007  –  November 2010  (3 years 10 months) Beijing City, China - Annually manage more than 20 various levels of projects, from Grand Conference, CEO visit to channel meeting and road-show. \n \n- Develop and produce innovative, profitable event concepts and budget proposals in accordance with client's brief. \n \n- Ensure that accurate terms and conditions together with relevant purchase orders are raised, dispatched and returned in accordance with the client's stated schedule. \n \n- Supervise service providers of Fabrication, Production, Audio and Video, Manpower, Logistics etc to meet the event standard with high quality. \n \n- Timely post event evaluation, and budget reconciliation and billing. Languages English Professional working proficiency French Elementary proficiency Chinese Native or bilingual proficiency English Professional working proficiency French Elementary proficiency Chinese Native or bilingual proficiency English Professional working proficiency French Elementary proficiency Chinese Native or bilingual proficiency Professional working proficiency Elementary proficiency Native or bilingual proficiency Skills Event Management Marketing Communications Public Relations Project Planning Management Event Planning Marketing Management Marketing Strategy Market Research Corporate Communications Integrated Marketing 营销传播 活动管理 活动策划 社交媒体 项目管理 数字化营销 See 2+     See less Skills  Event Management Marketing Communications Public Relations Project Planning Management Event Planning Marketing Management Marketing Strategy Market Research Corporate Communications Integrated Marketing 营销传播 活动管理 活动策划 社交媒体 项目管理 数字化营销 See 2+     See less Event Management Marketing Communications Public Relations Project Planning Management Event Planning Marketing Management Marketing Strategy Market Research Corporate Communications Integrated Marketing 营销传播 活动管理 活动策划 社交媒体 项目管理 数字化营销 See 2+     See less Event Management Marketing Communications Public Relations Project Planning Management Event Planning Marketing Management Marketing Strategy Market Research Corporate Communications Integrated Marketing 营销传播 活动管理 活动策划 社交媒体 项目管理 数字化营销 See 2+     See less ", "Experience Marketing Event Manager Intel Corporation April 2015  – Present (5 months) BGA BANGALORE Senior Client Executive Wizcraft International Entertainment Pvt. Ltd. April 2013  –  April 2015  (2 years 1 month) Bengaluru Area, India Marketing Event Manager Intel Corporation April 2015  – Present (5 months) BGA BANGALORE Marketing Event Manager Intel Corporation April 2015  – Present (5 months) BGA BANGALORE Senior Client Executive Wizcraft International Entertainment Pvt. Ltd. April 2013  –  April 2015  (2 years 1 month) Bengaluru Area, India Senior Client Executive Wizcraft International Entertainment Pvt. Ltd. April 2013  –  April 2015  (2 years 1 month) Bengaluru Area, India Skills PowerPoint Management Microsoft Word Business Development Research Training Microsoft Office Event Management Marketing Event Planning Skills  PowerPoint Management Microsoft Word Business Development Research Training Microsoft Office Event Management Marketing Event Planning PowerPoint Management Microsoft Word Business Development Research Training Microsoft Office Event Management Marketing Event Planning PowerPoint Management Microsoft Word Business Development Research Training Microsoft Office Event Management Marketing Event Planning Education Aligarh Muslim University senior secondary high school IFIM Business School PGDM,  Marketing Aligarh Muslim University senior secondary high school Aligarh Muslim University senior secondary high school Aligarh Muslim University senior secondary high school IFIM Business School PGDM,  Marketing IFIM Business School PGDM,  Marketing IFIM Business School PGDM,  Marketing ", "Summary As a critical member of any marketing team, I am experienced in creating, managing and executing integrated marketing plans and programs that meet the strategic objectives of marketing and sales organizations. Summary As a critical member of any marketing team, I am experienced in creating, managing and executing integrated marketing plans and programs that meet the strategic objectives of marketing and sales organizations. As a critical member of any marketing team, I am experienced in creating, managing and executing integrated marketing plans and programs that meet the strategic objectives of marketing and sales organizations. As a critical member of any marketing team, I am experienced in creating, managing and executing integrated marketing plans and programs that meet the strategic objectives of marketing and sales organizations. Experience Corporate Initiatives Strategic Marketing Manager Intel Corporation January 2013  – Present (2 years 8 months) Folsom, CA Corporate Initiatives Strategic Marketing Manager Intel Corporation January 2013  – Present (2 years 8 months) Folsom, CA Corporate Initiatives Strategic Marketing Manager Intel Corporation January 2013  – Present (2 years 8 months) Folsom, CA Skills Integrated Marketing Analyst Relations Global Marketing Cross-functional Team... Marketing Strategy Messaging Direct Marketing Product Marketing Management Strategic Communications Software Development Marketing Management Strategy Marketing Program Management Product Development Marketing Communications See 2+     See less Skills  Integrated Marketing Analyst Relations Global Marketing Cross-functional Team... Marketing Strategy Messaging Direct Marketing Product Marketing Management Strategic Communications Software Development Marketing Management Strategy Marketing Program Management Product Development Marketing Communications See 2+     See less Integrated Marketing Analyst Relations Global Marketing Cross-functional Team... Marketing Strategy Messaging Direct Marketing Product Marketing Management Strategic Communications Software Development Marketing Management Strategy Marketing Program Management Product Development Marketing Communications See 2+     See less Integrated Marketing Analyst Relations Global Marketing Cross-functional Team... Marketing Strategy Messaging Direct Marketing Product Marketing Management Strategic Communications Software Development Marketing Management Strategy Marketing Program Management Product Development Marketing Communications See 2+     See less Education Brooks Institute of Photography BA,  Industrial Scientific Photography/Color Technology 1982  – 1985 Brooks Institute of Photography BA,  Industrial Scientific Photography/Color Technology 1982  – 1985 Brooks Institute of Photography BA,  Industrial Scientific Photography/Color Technology 1982  – 1985 Brooks Institute of Photography BA,  Industrial Scientific Photography/Color Technology 1982  – 1985 ", "Experience Event Manager Cisco December 2013  – Present (1 year 9 months) Amsterdam Freelance Event Project Manager HD Event Management December 2013  – Present (1 year 9 months) Amsterdam Area, Netherlands Event Manager Cisco December 2013  – Present (1 year 9 months) Amsterdam Event Manager Cisco December 2013  – Present (1 year 9 months) Amsterdam Freelance Event Project Manager HD Event Management December 2013  – Present (1 year 9 months) Amsterdam Area, Netherlands Freelance Event Project Manager HD Event Management December 2013  – Present (1 year 9 months) Amsterdam Area, Netherlands Languages English Native or bilingual proficiency Dutch Professional working proficiency English Native or bilingual proficiency Dutch Professional working proficiency English Native or bilingual proficiency Dutch Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Skills     ", "Skills Cross-functional Team... Product Marketing Product Management Program Management Project Management Competitive Analysis Management Strategy Process Improvement Strategic Planning Product Development Leadership Marketing Strategy Vendor Management Budgets Semiconductors Business Development See 2+     See less Skills  Cross-functional Team... Product Marketing Product Management Program Management Project Management Competitive Analysis Management Strategy Process Improvement Strategic Planning Product Development Leadership Marketing Strategy Vendor Management Budgets Semiconductors Business Development See 2+     See less Cross-functional Team... Product Marketing Product Management Program Management Project Management Competitive Analysis Management Strategy Process Improvement Strategic Planning Product Development Leadership Marketing Strategy Vendor Management Budgets Semiconductors Business Development See 2+     See less Cross-functional Team... Product Marketing Product Management Program Management Project Management Competitive Analysis Management Strategy Process Improvement Strategic Planning Product Development Leadership Marketing Strategy Vendor Management Budgets Semiconductors Business Development See 2+     See less ", "Summary I am a highly motivated Executive Assistant with a consistent record of going the extra mile to meet corporate objectives. I have over 25 years experience in supporting C Level executives. I enjoy the support role, meeting new people and having fun! I work hard and play hard! Specialties:capable of handling heavy volumes of domestic and international travel, managing heavy calendars, for not just one, but sometimes several executives, scheduling of meetings and handling special events and conferences. I have a strong sense of loyalty, professionalism, and the ability to communicate with all levels of an organization. Summary I am a highly motivated Executive Assistant with a consistent record of going the extra mile to meet corporate objectives. I have over 25 years experience in supporting C Level executives. I enjoy the support role, meeting new people and having fun! I work hard and play hard! Specialties:capable of handling heavy volumes of domestic and international travel, managing heavy calendars, for not just one, but sometimes several executives, scheduling of meetings and handling special events and conferences. I have a strong sense of loyalty, professionalism, and the ability to communicate with all levels of an organization. I am a highly motivated Executive Assistant with a consistent record of going the extra mile to meet corporate objectives. I have over 25 years experience in supporting C Level executives. I enjoy the support role, meeting new people and having fun! I work hard and play hard! Specialties:capable of handling heavy volumes of domestic and international travel, managing heavy calendars, for not just one, but sometimes several executives, scheduling of meetings and handling special events and conferences. I have a strong sense of loyalty, professionalism, and the ability to communicate with all levels of an organization. I am a highly motivated Executive Assistant with a consistent record of going the extra mile to meet corporate objectives. I have over 25 years experience in supporting C Level executives. I enjoy the support role, meeting new people and having fun! I work hard and play hard! Specialties:capable of handling heavy volumes of domestic and international travel, managing heavy calendars, for not just one, but sometimes several executives, scheduling of meetings and handling special events and conferences. I have a strong sense of loyalty, professionalism, and the ability to communicate with all levels of an organization. Experience Executive Assistant To COO VMC March 2014  – Present (1 year 6 months) Redmond, WA Responsible for supporting the COO, as well as the executive staff in all areas of administrative and support requirements. Working closely with the Executives to drive results on a variety of activities. requiring a proactive approach, and highly skilled & motivated. Primary responsibilities include: calendar management, travel arrangements, managing the Executives' mail, processing documents, etc. to more robust deliverables such as creating PowerPoint presentations, performing data analysis, creating comprehensive Excel based reports, tracking pertinent information and formatting materials. EXECUTIVE & PERSONAL ASSISTANT TO THE PRESIDENT & CEO(TEMP) Medvice, Inc. March 2013  –  August 2013  (6 months) Mercer Island, WA Assisted the President & CEO with preparation of client graphical presentations and consulting reports, including MS PowerPoint presentations. Prioritized and managed multiple projects, followed through on issues, informed all parties of current status. Managed incoming and outgoing electronic communications, as well as incoming phone calls. Reviewed and summarized miscellaneous reports and documents; prepared corporate documents and outgoing mail. Researched information and assisted with special projects as needed. Responsible for managing and maintaining office equipment & supplies. Arranged travel reservations and scheduled multiple meetings. Assist with various professional and personal errands and projects. Assist with planning and arranging family travel. EXECUTIVE ASSISTANT to CHIEF MEDICAL OFFICER CYTOKINETICS, INC February 2011  –  February 2013  (2 years 1 month) So. San Francisco, CA Responsible for supporting the Chief Medical Officer for the Clinical and Research Development organization, as well as his direct reports. Primary responsibilities are: \nComplex calendar maintenance, scheduling internal and external meetings on a regular basis. \nDeveloped and maintained detailed travel arrangements (travel/hotel/limo/rental car, etc.) both domestic and international. Additionally, assisted guests and / or other visitors with travel arrangements as required. \nAssisted with various clinical programs (scheduling meetings, tracking contacts, maintaining information and filing system, travel coordination). \nDeveloped and maintained agenda and minutes of the CMO's Senior Staff meetings \nLiaison with outside physician experts on various clinical programs and meetings.  \nAllocated and managed office space for current and new Clinical team members. \nWorked with and made recommendations to internal group to determine meeting requirements for particular industry events, such as type of venue, catering, amenities, and including budget management.  \nManaged and implemented logistics for all Clinical & Regulatory events in conjunction with industry conference (i.e., ASN, SAB Meetings, ERA-EDTA, ASCO, etc.) \nSelected and negotiated services with outside vendors, ensuring the best quality and value while remaining within budget guidelines.  \nExcellent verbal and written communications skills \nExperience in handling sensitive and confidential information  \nPreparation of expense reports for individuals as appropriate. \nProvided general administrative support and other projects and duties as needed. EXECUTIVE ASSISTANT to CHIEF MEDICAL OFFICER AFFYMAX, INC May 2006  –  December 2010  (4 years 8 months) Palo Alto, CA Responsible for supporting the Chief Medical Officer for the Clinical, Regulatory Affairs & Biostatistics organization, as well as her direct reports. Primary responsibilities were: \nMaintained several heavy calendars, scheduling internal and external meetings on a regular basis. \nAssisted with various clinical programs (scheduling meetings, tracking contacts, maintaining information and filing system, travel coordination). \nDeveloped and maintained agenda and minutes of the CMO's Senior Staff meetings \nAssisted with the production of regulatory documentation and maintaining regulatory filing. \nLiaison with outside physician experts on various clinical programs and meetings.  \nAllocated and managed office space for current and new Clinical Operations team members. \nWorked with and made recommendations to internal group to determine meeting requirements for particular industry events, such as type of venue, catering, amenities, and including budget management.  \nManaged and implemented logistics for all Clinical & Regulatory events in conjunction with industry conference (i.e., ASN, SAB Meetings, ERA-EDTA, ASCO, etc.) \nSelected and negotiated services with outside vendors, ensuring the best quality and value while remaining within budget guidelines.  \nAttended events, as required, to ensure deliverables are met. \nMaintained the CMO/Direct Reports travel schedule, making detailed travel arrangements (travel/hotel/limo/rental car, etc.) both domestic and international. Additionally assist guests and / or other visitors with travel arrangements as required. \nExcellent verbal and written communications skills \nExperience in handling sensitive and confidential information  \nPreparation of expense reports for individuals as appropriate. \nProvided general administrative support and other projects and duties as needed. EXECUTIVE ASSISTANT to CEO (Temp Contract) SUCCESSFACTORS, INC October 2005  –  March 2006  (6 months) San Mateo, CA Responsible for assisting and supporting the Founder and CEO. Primary responsibilities included: \nMaintained CEO's calendar, scheduling internal and external meetings on a regular basis. \nSupported other executives on special projects as assigned. \nMaintained the CEO's extensive travel schedule, making detailed travel arrangements (travel/hotel/limo/rental car, etc.) both domestic and international. Additionally assisted guests and / or other visitors with travel arrangements as needed. \nExcellent verbal and written communications skills required \nExperience in handling sensitive and confidential information  \nPrepared expense reports for individuals as appropriate. \nProvided general administrative support and other projects and duties as needed. EXECUTIVE ASSISTANT/EVENT MANAGER Intel Corporation July 1999  –  March 2005  (5 years 9 months) Santa Clara, CA Primary responsibilities: \nSupported and worked closely with the President and CEO of Intel while traveling with him. \nDeveloped, staged and executed his keynote events worldwide. \nArranged domestic/international flights and hotel accommodations for the CEO and our executive team. \nPlanned several elite business dinners/functions with a variety of international dignitaries, such as the Prime Ministers of Thailand, England, India, etc. \nManaged day to day administrative functions while traveling with the CEO. \nProvided executive assistance including proactively and consistently performing daily duties of managing projects, processing incoming information, prioritizing and implementing tasks, creating schedules and planning events. \nClosely monitored company related projects to ensure that timelines and deadlines were being met \nDealt with sensitive and confidential information in a professional manner. \nPrepared correspondence, memoranda, reports, etc. \nPerforms other related duties as assigned or requested. EVENT MANAGER Rosenbluth International August 1997  –  July 1999  (2 years) Santa Clara, CA Primary Responsibilities: \nPlanned, implemented and management of Corporate marketing events.  \nWork closely with Executive Senior Management within Intel to develop, stage and execute Executive Keynotes, Seminars and Intel Events worldwide. Corporate programs included product launches, press events, analyst meetings and all worldwide tours with the President and CEO of Intel. MARKETING PROGRAM MANAGER NOVELL, INC March 1997  –  August 1997  (6 months) San Jose, CA Primary Responsibilities: \nResponsible for management and development of marketing programs for Host Connectivity products.  \nMarketing programs included: Business partner events (e.g. Seminars, Solutions roadshows, and other co-sponsored events), Direct Mail Programs, Product announcement and management of launch programs, Liaison with Marcom team. Executive Assistant/Event Manager Boole & Babbage June 1983  –  November 1996  (13 years 6 months) San Jose, CA Responsible for assisting and supporting the VP of Sales & Marketing and his direct reports. Primary responsibilities included: \nAnswered phones in a professional and friendly manner \nEdited and formatted documents \nAssisted with managing of and daily operation of databases \nMaintained project and company filing systems \nRegularly assessed supplies and ordered more as needed \nAssisted with scheduling staff \nOrganized office materials and electronic media \nConduct research as directed \nPrepared transmittal letters and shipped packages and letters Executive Assistant To COO VMC March 2014  – Present (1 year 6 months) Redmond, WA Responsible for supporting the COO, as well as the executive staff in all areas of administrative and support requirements. Working closely with the Executives to drive results on a variety of activities. requiring a proactive approach, and highly skilled & motivated. Primary responsibilities include: calendar management, travel arrangements, managing the Executives' mail, processing documents, etc. to more robust deliverables such as creating PowerPoint presentations, performing data analysis, creating comprehensive Excel based reports, tracking pertinent information and formatting materials. Executive Assistant To COO VMC March 2014  – Present (1 year 6 months) Redmond, WA Responsible for supporting the COO, as well as the executive staff in all areas of administrative and support requirements. Working closely with the Executives to drive results on a variety of activities. requiring a proactive approach, and highly skilled & motivated. Primary responsibilities include: calendar management, travel arrangements, managing the Executives' mail, processing documents, etc. to more robust deliverables such as creating PowerPoint presentations, performing data analysis, creating comprehensive Excel based reports, tracking pertinent information and formatting materials. EXECUTIVE & PERSONAL ASSISTANT TO THE PRESIDENT & CEO(TEMP) Medvice, Inc. March 2013  –  August 2013  (6 months) Mercer Island, WA Assisted the President & CEO with preparation of client graphical presentations and consulting reports, including MS PowerPoint presentations. Prioritized and managed multiple projects, followed through on issues, informed all parties of current status. Managed incoming and outgoing electronic communications, as well as incoming phone calls. Reviewed and summarized miscellaneous reports and documents; prepared corporate documents and outgoing mail. Researched information and assisted with special projects as needed. Responsible for managing and maintaining office equipment & supplies. Arranged travel reservations and scheduled multiple meetings. Assist with various professional and personal errands and projects. Assist with planning and arranging family travel. EXECUTIVE & PERSONAL ASSISTANT TO THE PRESIDENT & CEO(TEMP) Medvice, Inc. March 2013  –  August 2013  (6 months) Mercer Island, WA Assisted the President & CEO with preparation of client graphical presentations and consulting reports, including MS PowerPoint presentations. Prioritized and managed multiple projects, followed through on issues, informed all parties of current status. Managed incoming and outgoing electronic communications, as well as incoming phone calls. Reviewed and summarized miscellaneous reports and documents; prepared corporate documents and outgoing mail. Researched information and assisted with special projects as needed. Responsible for managing and maintaining office equipment & supplies. Arranged travel reservations and scheduled multiple meetings. Assist with various professional and personal errands and projects. Assist with planning and arranging family travel. EXECUTIVE ASSISTANT to CHIEF MEDICAL OFFICER CYTOKINETICS, INC February 2011  –  February 2013  (2 years 1 month) So. San Francisco, CA Responsible for supporting the Chief Medical Officer for the Clinical and Research Development organization, as well as his direct reports. Primary responsibilities are: \nComplex calendar maintenance, scheduling internal and external meetings on a regular basis. \nDeveloped and maintained detailed travel arrangements (travel/hotel/limo/rental car, etc.) both domestic and international. Additionally, assisted guests and / or other visitors with travel arrangements as required. \nAssisted with various clinical programs (scheduling meetings, tracking contacts, maintaining information and filing system, travel coordination). \nDeveloped and maintained agenda and minutes of the CMO's Senior Staff meetings \nLiaison with outside physician experts on various clinical programs and meetings.  \nAllocated and managed office space for current and new Clinical team members. \nWorked with and made recommendations to internal group to determine meeting requirements for particular industry events, such as type of venue, catering, amenities, and including budget management.  \nManaged and implemented logistics for all Clinical & Regulatory events in conjunction with industry conference (i.e., ASN, SAB Meetings, ERA-EDTA, ASCO, etc.) \nSelected and negotiated services with outside vendors, ensuring the best quality and value while remaining within budget guidelines.  \nExcellent verbal and written communications skills \nExperience in handling sensitive and confidential information  \nPreparation of expense reports for individuals as appropriate. \nProvided general administrative support and other projects and duties as needed. EXECUTIVE ASSISTANT to CHIEF MEDICAL OFFICER CYTOKINETICS, INC February 2011  –  February 2013  (2 years 1 month) So. San Francisco, CA Responsible for supporting the Chief Medical Officer for the Clinical and Research Development organization, as well as his direct reports. Primary responsibilities are: \nComplex calendar maintenance, scheduling internal and external meetings on a regular basis. \nDeveloped and maintained detailed travel arrangements (travel/hotel/limo/rental car, etc.) both domestic and international. Additionally, assisted guests and / or other visitors with travel arrangements as required. \nAssisted with various clinical programs (scheduling meetings, tracking contacts, maintaining information and filing system, travel coordination). \nDeveloped and maintained agenda and minutes of the CMO's Senior Staff meetings \nLiaison with outside physician experts on various clinical programs and meetings.  \nAllocated and managed office space for current and new Clinical team members. \nWorked with and made recommendations to internal group to determine meeting requirements for particular industry events, such as type of venue, catering, amenities, and including budget management.  \nManaged and implemented logistics for all Clinical & Regulatory events in conjunction with industry conference (i.e., ASN, SAB Meetings, ERA-EDTA, ASCO, etc.) \nSelected and negotiated services with outside vendors, ensuring the best quality and value while remaining within budget guidelines.  \nExcellent verbal and written communications skills \nExperience in handling sensitive and confidential information  \nPreparation of expense reports for individuals as appropriate. \nProvided general administrative support and other projects and duties as needed. EXECUTIVE ASSISTANT to CHIEF MEDICAL OFFICER AFFYMAX, INC May 2006  –  December 2010  (4 years 8 months) Palo Alto, CA Responsible for supporting the Chief Medical Officer for the Clinical, Regulatory Affairs & Biostatistics organization, as well as her direct reports. Primary responsibilities were: \nMaintained several heavy calendars, scheduling internal and external meetings on a regular basis. \nAssisted with various clinical programs (scheduling meetings, tracking contacts, maintaining information and filing system, travel coordination). \nDeveloped and maintained agenda and minutes of the CMO's Senior Staff meetings \nAssisted with the production of regulatory documentation and maintaining regulatory filing. \nLiaison with outside physician experts on various clinical programs and meetings.  \nAllocated and managed office space for current and new Clinical Operations team members. \nWorked with and made recommendations to internal group to determine meeting requirements for particular industry events, such as type of venue, catering, amenities, and including budget management.  \nManaged and implemented logistics for all Clinical & Regulatory events in conjunction with industry conference (i.e., ASN, SAB Meetings, ERA-EDTA, ASCO, etc.) \nSelected and negotiated services with outside vendors, ensuring the best quality and value while remaining within budget guidelines.  \nAttended events, as required, to ensure deliverables are met. \nMaintained the CMO/Direct Reports travel schedule, making detailed travel arrangements (travel/hotel/limo/rental car, etc.) both domestic and international. Additionally assist guests and / or other visitors with travel arrangements as required. \nExcellent verbal and written communications skills \nExperience in handling sensitive and confidential information  \nPreparation of expense reports for individuals as appropriate. \nProvided general administrative support and other projects and duties as needed. EXECUTIVE ASSISTANT to CHIEF MEDICAL OFFICER AFFYMAX, INC May 2006  –  December 2010  (4 years 8 months) Palo Alto, CA Responsible for supporting the Chief Medical Officer for the Clinical, Regulatory Affairs & Biostatistics organization, as well as her direct reports. Primary responsibilities were: \nMaintained several heavy calendars, scheduling internal and external meetings on a regular basis. \nAssisted with various clinical programs (scheduling meetings, tracking contacts, maintaining information and filing system, travel coordination). \nDeveloped and maintained agenda and minutes of the CMO's Senior Staff meetings \nAssisted with the production of regulatory documentation and maintaining regulatory filing. \nLiaison with outside physician experts on various clinical programs and meetings.  \nAllocated and managed office space for current and new Clinical Operations team members. \nWorked with and made recommendations to internal group to determine meeting requirements for particular industry events, such as type of venue, catering, amenities, and including budget management.  \nManaged and implemented logistics for all Clinical & Regulatory events in conjunction with industry conference (i.e., ASN, SAB Meetings, ERA-EDTA, ASCO, etc.) \nSelected and negotiated services with outside vendors, ensuring the best quality and value while remaining within budget guidelines.  \nAttended events, as required, to ensure deliverables are met. \nMaintained the CMO/Direct Reports travel schedule, making detailed travel arrangements (travel/hotel/limo/rental car, etc.) both domestic and international. Additionally assist guests and / or other visitors with travel arrangements as required. \nExcellent verbal and written communications skills \nExperience in handling sensitive and confidential information  \nPreparation of expense reports for individuals as appropriate. \nProvided general administrative support and other projects and duties as needed. EXECUTIVE ASSISTANT to CEO (Temp Contract) SUCCESSFACTORS, INC October 2005  –  March 2006  (6 months) San Mateo, CA Responsible for assisting and supporting the Founder and CEO. Primary responsibilities included: \nMaintained CEO's calendar, scheduling internal and external meetings on a regular basis. \nSupported other executives on special projects as assigned. \nMaintained the CEO's extensive travel schedule, making detailed travel arrangements (travel/hotel/limo/rental car, etc.) both domestic and international. Additionally assisted guests and / or other visitors with travel arrangements as needed. \nExcellent verbal and written communications skills required \nExperience in handling sensitive and confidential information  \nPrepared expense reports for individuals as appropriate. \nProvided general administrative support and other projects and duties as needed. EXECUTIVE ASSISTANT to CEO (Temp Contract) SUCCESSFACTORS, INC October 2005  –  March 2006  (6 months) San Mateo, CA Responsible for assisting and supporting the Founder and CEO. Primary responsibilities included: \nMaintained CEO's calendar, scheduling internal and external meetings on a regular basis. \nSupported other executives on special projects as assigned. \nMaintained the CEO's extensive travel schedule, making detailed travel arrangements (travel/hotel/limo/rental car, etc.) both domestic and international. Additionally assisted guests and / or other visitors with travel arrangements as needed. \nExcellent verbal and written communications skills required \nExperience in handling sensitive and confidential information  \nPrepared expense reports for individuals as appropriate. \nProvided general administrative support and other projects and duties as needed. EXECUTIVE ASSISTANT/EVENT MANAGER Intel Corporation July 1999  –  March 2005  (5 years 9 months) Santa Clara, CA Primary responsibilities: \nSupported and worked closely with the President and CEO of Intel while traveling with him. \nDeveloped, staged and executed his keynote events worldwide. \nArranged domestic/international flights and hotel accommodations for the CEO and our executive team. \nPlanned several elite business dinners/functions with a variety of international dignitaries, such as the Prime Ministers of Thailand, England, India, etc. \nManaged day to day administrative functions while traveling with the CEO. \nProvided executive assistance including proactively and consistently performing daily duties of managing projects, processing incoming information, prioritizing and implementing tasks, creating schedules and planning events. \nClosely monitored company related projects to ensure that timelines and deadlines were being met \nDealt with sensitive and confidential information in a professional manner. \nPrepared correspondence, memoranda, reports, etc. \nPerforms other related duties as assigned or requested. EXECUTIVE ASSISTANT/EVENT MANAGER Intel Corporation July 1999  –  March 2005  (5 years 9 months) Santa Clara, CA Primary responsibilities: \nSupported and worked closely with the President and CEO of Intel while traveling with him. \nDeveloped, staged and executed his keynote events worldwide. \nArranged domestic/international flights and hotel accommodations for the CEO and our executive team. \nPlanned several elite business dinners/functions with a variety of international dignitaries, such as the Prime Ministers of Thailand, England, India, etc. \nManaged day to day administrative functions while traveling with the CEO. \nProvided executive assistance including proactively and consistently performing daily duties of managing projects, processing incoming information, prioritizing and implementing tasks, creating schedules and planning events. \nClosely monitored company related projects to ensure that timelines and deadlines were being met \nDealt with sensitive and confidential information in a professional manner. \nPrepared correspondence, memoranda, reports, etc. \nPerforms other related duties as assigned or requested. EVENT MANAGER Rosenbluth International August 1997  –  July 1999  (2 years) Santa Clara, CA Primary Responsibilities: \nPlanned, implemented and management of Corporate marketing events.  \nWork closely with Executive Senior Management within Intel to develop, stage and execute Executive Keynotes, Seminars and Intel Events worldwide. Corporate programs included product launches, press events, analyst meetings and all worldwide tours with the President and CEO of Intel. EVENT MANAGER Rosenbluth International August 1997  –  July 1999  (2 years) Santa Clara, CA Primary Responsibilities: \nPlanned, implemented and management of Corporate marketing events.  \nWork closely with Executive Senior Management within Intel to develop, stage and execute Executive Keynotes, Seminars and Intel Events worldwide. Corporate programs included product launches, press events, analyst meetings and all worldwide tours with the President and CEO of Intel. MARKETING PROGRAM MANAGER NOVELL, INC March 1997  –  August 1997  (6 months) San Jose, CA Primary Responsibilities: \nResponsible for management and development of marketing programs for Host Connectivity products.  \nMarketing programs included: Business partner events (e.g. Seminars, Solutions roadshows, and other co-sponsored events), Direct Mail Programs, Product announcement and management of launch programs, Liaison with Marcom team. MARKETING PROGRAM MANAGER NOVELL, INC March 1997  –  August 1997  (6 months) San Jose, CA Primary Responsibilities: \nResponsible for management and development of marketing programs for Host Connectivity products.  \nMarketing programs included: Business partner events (e.g. Seminars, Solutions roadshows, and other co-sponsored events), Direct Mail Programs, Product announcement and management of launch programs, Liaison with Marcom team. Executive Assistant/Event Manager Boole & Babbage June 1983  –  November 1996  (13 years 6 months) San Jose, CA Responsible for assisting and supporting the VP of Sales & Marketing and his direct reports. Primary responsibilities included: \nAnswered phones in a professional and friendly manner \nEdited and formatted documents \nAssisted with managing of and daily operation of databases \nMaintained project and company filing systems \nRegularly assessed supplies and ordered more as needed \nAssisted with scheduling staff \nOrganized office materials and electronic media \nConduct research as directed \nPrepared transmittal letters and shipped packages and letters Executive Assistant/Event Manager Boole & Babbage June 1983  –  November 1996  (13 years 6 months) San Jose, CA Responsible for assisting and supporting the VP of Sales & Marketing and his direct reports. Primary responsibilities included: \nAnswered phones in a professional and friendly manner \nEdited and formatted documents \nAssisted with managing of and daily operation of databases \nMaintained project and company filing systems \nRegularly assessed supplies and ordered more as needed \nAssisted with scheduling staff \nOrganized office materials and electronic media \nConduct research as directed \nPrepared transmittal letters and shipped packages and letters Skills Conferences Outlook Excel Scheduling PowerPoint Word Microsoft Office Event Management Administration Microsoft Excel Microsoft Word Administrative... Process Scheduler Event Planning Research System Administration Budgets Marketing Communications Marketing Project Management Software Documentation Management Editing Teamwork Customer Service Strategic Planning Team Leadership Biotechnology GCP Team Building CRO Healthcare Databases Sop Access Clinical Trials Program Management Project Planning Clinical Development Regulatory Affairs Pharmaceutical Industry FDA Oncology CTMS Lifesciences Data Management EDC Data Analysis Infectious Diseases Medical Devices See 35+     See less Skills  Conferences Outlook Excel Scheduling PowerPoint Word Microsoft Office Event Management Administration Microsoft Excel Microsoft Word Administrative... Process Scheduler Event Planning Research System Administration Budgets Marketing Communications Marketing Project Management Software Documentation Management Editing Teamwork Customer Service Strategic Planning Team Leadership Biotechnology GCP Team Building CRO Healthcare Databases Sop Access Clinical Trials Program Management Project Planning Clinical Development Regulatory Affairs Pharmaceutical Industry FDA Oncology CTMS Lifesciences Data Management EDC Data Analysis Infectious Diseases Medical Devices See 35+     See less Conferences Outlook Excel Scheduling PowerPoint Word Microsoft Office Event Management Administration Microsoft Excel Microsoft Word Administrative... Process Scheduler Event Planning Research System Administration Budgets Marketing Communications Marketing Project Management Software Documentation Management Editing Teamwork Customer Service Strategic Planning Team Leadership Biotechnology GCP Team Building CRO Healthcare Databases Sop Access Clinical Trials Program Management Project Planning Clinical Development Regulatory Affairs Pharmaceutical Industry FDA Oncology CTMS Lifesciences Data Management EDC Data Analysis Infectious Diseases Medical Devices See 35+     See less Conferences Outlook Excel Scheduling PowerPoint Word Microsoft Office Event Management Administration Microsoft Excel Microsoft Word Administrative... Process Scheduler Event Planning Research System Administration Budgets Marketing Communications Marketing Project Management Software Documentation Management Editing Teamwork Customer Service Strategic Planning Team Leadership Biotechnology GCP Team Building CRO Healthcare Databases Sop Access Clinical Trials Program Management Project Planning Clinical Development Regulatory Affairs Pharmaceutical Industry FDA Oncology CTMS Lifesciences Data Management EDC Data Analysis Infectious Diseases Medical Devices See 35+     See less Education San Jose State University Certificate,  Marketing Communications 1993  – 1995 studied marketing communications San Jose State University Certificate,  Marketing Communications 1993  – 1995 studied marketing communications San Jose State University Certificate,  Marketing Communications 1993  – 1995 studied marketing communications San Jose State University Certificate,  Marketing Communications 1993  – 1995 studied marketing communications ", "Skills Product Marketing Strategy Strategic Partnerships Mergers & Acquisitions Skills  Product Marketing Strategy Strategic Partnerships Mergers & Acquisitions Product Marketing Strategy Strategic Partnerships Mergers & Acquisitions Product Marketing Strategy Strategic Partnerships Mergers & Acquisitions ", "Summary Contact: Davidcu2001@hotmail.com.  \n \nMy passion is in digital marketing and digital asset management, product and program management with an expertise in global marketing automation systems and support.  \n \nA results-driven channel marketing, engagement and account management expert in partner and stakeholder relationships. I operate with an eager eye on the outcome and the impact on business. \n \nHave developed, executed, and supervised a wide variety of integrated channel marketing and communications roles at start-ups as well as at Microsoft, Intel and other Fortune 500 companies.  \n \nHighlights:  \n \nMicrosoft Windows Marketing group responsible for World Wide Field Readiness and Operations most recently, supporting a team of over 1,500. This role included traveling to global teams to deliver onsite training and updates.  \n \nPrevious roles include delivering global marketing automation solutions, worldwide Field readiness, managing internal and external global events with attendance from 75 -3,000, and delivering targeted marketing campaigns using CRM systems and tools.  \n \nAreas of expertise include: \n \n• Global Marketing Automation Systems and Tools  \n• Digital Marketing and Retention Strategy \n•\tProgram / Product Management \n•\tGlobal Cross Group Collaboration \n•\tBusiness Development \n•\tDigital Asset Management and Distribution \n•\tStrategic Partner and Field Relationships \n•\tData-driven Marketing Strategy  \n•\tCustomer Loyalty / CRM Marketing Strategy \n•\tAudience / Field Engagement and Readiness Programs \n•\tAgency/Vendor Relations and Management \n \n \nTechnologies: MS Windows, MS Office, SharePoint, Global Marketing Automation and CRM, Lead Management, and Reporting Systems. Summary Contact: Davidcu2001@hotmail.com.  \n \nMy passion is in digital marketing and digital asset management, product and program management with an expertise in global marketing automation systems and support.  \n \nA results-driven channel marketing, engagement and account management expert in partner and stakeholder relationships. I operate with an eager eye on the outcome and the impact on business. \n \nHave developed, executed, and supervised a wide variety of integrated channel marketing and communications roles at start-ups as well as at Microsoft, Intel and other Fortune 500 companies.  \n \nHighlights:  \n \nMicrosoft Windows Marketing group responsible for World Wide Field Readiness and Operations most recently, supporting a team of over 1,500. This role included traveling to global teams to deliver onsite training and updates.  \n \nPrevious roles include delivering global marketing automation solutions, worldwide Field readiness, managing internal and external global events with attendance from 75 -3,000, and delivering targeted marketing campaigns using CRM systems and tools.  \n \nAreas of expertise include: \n \n• Global Marketing Automation Systems and Tools  \n• Digital Marketing and Retention Strategy \n•\tProgram / Product Management \n•\tGlobal Cross Group Collaboration \n•\tBusiness Development \n•\tDigital Asset Management and Distribution \n•\tStrategic Partner and Field Relationships \n•\tData-driven Marketing Strategy  \n•\tCustomer Loyalty / CRM Marketing Strategy \n•\tAudience / Field Engagement and Readiness Programs \n•\tAgency/Vendor Relations and Management \n \n \nTechnologies: MS Windows, MS Office, SharePoint, Global Marketing Automation and CRM, Lead Management, and Reporting Systems. Contact: Davidcu2001@hotmail.com.  \n \nMy passion is in digital marketing and digital asset management, product and program management with an expertise in global marketing automation systems and support.  \n \nA results-driven channel marketing, engagement and account management expert in partner and stakeholder relationships. I operate with an eager eye on the outcome and the impact on business. \n \nHave developed, executed, and supervised a wide variety of integrated channel marketing and communications roles at start-ups as well as at Microsoft, Intel and other Fortune 500 companies.  \n \nHighlights:  \n \nMicrosoft Windows Marketing group responsible for World Wide Field Readiness and Operations most recently, supporting a team of over 1,500. This role included traveling to global teams to deliver onsite training and updates.  \n \nPrevious roles include delivering global marketing automation solutions, worldwide Field readiness, managing internal and external global events with attendance from 75 -3,000, and delivering targeted marketing campaigns using CRM systems and tools.  \n \nAreas of expertise include: \n \n• Global Marketing Automation Systems and Tools  \n• Digital Marketing and Retention Strategy \n•\tProgram / Product Management \n•\tGlobal Cross Group Collaboration \n•\tBusiness Development \n•\tDigital Asset Management and Distribution \n•\tStrategic Partner and Field Relationships \n•\tData-driven Marketing Strategy  \n•\tCustomer Loyalty / CRM Marketing Strategy \n•\tAudience / Field Engagement and Readiness Programs \n•\tAgency/Vendor Relations and Management \n \n \nTechnologies: MS Windows, MS Office, SharePoint, Global Marketing Automation and CRM, Lead Management, and Reporting Systems. Contact: Davidcu2001@hotmail.com.  \n \nMy passion is in digital marketing and digital asset management, product and program management with an expertise in global marketing automation systems and support.  \n \nA results-driven channel marketing, engagement and account management expert in partner and stakeholder relationships. I operate with an eager eye on the outcome and the impact on business. \n \nHave developed, executed, and supervised a wide variety of integrated channel marketing and communications roles at start-ups as well as at Microsoft, Intel and other Fortune 500 companies.  \n \nHighlights:  \n \nMicrosoft Windows Marketing group responsible for World Wide Field Readiness and Operations most recently, supporting a team of over 1,500. This role included traveling to global teams to deliver onsite training and updates.  \n \nPrevious roles include delivering global marketing automation solutions, worldwide Field readiness, managing internal and external global events with attendance from 75 -3,000, and delivering targeted marketing campaigns using CRM systems and tools.  \n \nAreas of expertise include: \n \n• Global Marketing Automation Systems and Tools  \n• Digital Marketing and Retention Strategy \n•\tProgram / Product Management \n•\tGlobal Cross Group Collaboration \n•\tBusiness Development \n•\tDigital Asset Management and Distribution \n•\tStrategic Partner and Field Relationships \n•\tData-driven Marketing Strategy  \n•\tCustomer Loyalty / CRM Marketing Strategy \n•\tAudience / Field Engagement and Readiness Programs \n•\tAgency/Vendor Relations and Management \n \n \nTechnologies: MS Windows, MS Office, SharePoint, Global Marketing Automation and CRM, Lead Management, and Reporting Systems. Experience Sr. Marketing Manager Bridge Partners Consulting June 2015  – Present (3 months) Greater Seattle Area I am a Senior Marketing Manager working with Microsoft in the Windows team. I am responsible for assisting the SMB team with their integration into the US marketing initiatives across all the current campaigns and programs. Building out and branding Windows 10 SMB campaigns to drive upgrades to Windows 10 and Pro across the US. This includes digital and social marketing as well as retail and distributor programs that are taking advantage of the Windows Devices in Modern Biz initiative. Responsible for managing the development and distribution of all the OEM, Digital and Field sales marketing assets that are designed to support Windows 10 marketing across the segment.  Senior Marketing and Operations Executive Seeking new opportunities September 2014  –  June 2015  (10 months) Greater Seattle Area I am looking to put my over 20 years of extensive and varied marketing and operations, product and program management experience to good use in a tech-savvy company and at the same time growing my career and marketing acumen. Seeking opportunities that will allow me to put my digital expertise and enthusiasm to good use developing and launching marketing campaigns and processes through the use of data and systems & tools including marketing automation and CRM. I have very well respected Field Management and Readiness experience and a drive for building and nurturing highly effective teams. My ability to build and sustain high-level relationships and my superior account management expertise and business development capabilities allow me to be very flexible in my career direction. Global Field Operations / Marketing Program Manager – Windows Phone Microsoft 2012  –  2014  (2 years) Redmond, WA. Delivered all communications from corp. to the Global Windows Marketing (Phone) Field including OEM, Operator Channel, Retail, and Developers. Acted as the strategic Field advocate and voice back to corp. to ensure that the materials being provided were “Aiming and Arming” internal and external stakeholders to excel in their roles.  \n• Tripled readership of weekly Field newsletter and attendance of 2X monthly Field calls to over 750 stakeholders in 6 months by creating a community of stakeholders that shared best practices and worked more closely together as a cohesive team. \n• Drove in excess of 2X sell-in opportunity by planning, managing, and attending 4 Windows Phone 8.1 Global Field Summits held in Redmond, WA, Ft. Lauderdale, Amsterdam, and Singapore. Summits were designed to provide advance release details to Windows Phone Category Leads, Technical Sales, Operator Channel, and Mobile Operator Client Directors.  \n• Developed and provided all readiness programs and materials for global Windows Phone Field.  \n• Owned and administered global secure SharePoint site for all marketing assets and strategic annual planning documentation.  \n• Managed delivery of all digital marketing assets from Product Marketing, Mobile Operator / OEM, Apps, Windows Store and Developer teams to the World Wide Field for their use in ranging and commercialization of devices with customers and partners.  \n• Technical Program Manager for Microsoft internal events including TechReady (twice annual Developer conference held in Seattle), START (annual global marketing kick-off meeting) and MGX (annual global sales meeting).  \n• Developed and delivered all readiness programs for continued stakeholder and Field education. Global Marketing Operations, Sr. Marketing Manager – Digital Campaign Management and Reporting Microsoft Corporation 2006  –  2012  (6 years) Bellevue, WA. Manager and Business Owner of US Marketing Campaign Operations team in the Global Marketing Operations (GMO) team. Managed all digital and above and below the line marketing campaign set-up and validation in Marketing Automation tools for US Subsidiary. Responsible, end to end, for all campaign set-up, monitoring, lead management, and Return on Marketing Investment (ROMI) analysis reporting during and post campaign. Effective and trusted communicator to upper level management and looked to as a distinguished and intuitive self-starter with excellent problem resolution and presentation skills. \n• Managed highly successful operations team of 18 people by focusing on operational excellence as a foundation, and up-leveling high performers to become strategic partners with stakeholders. Managed annual budget of more than $2M. \n• Instilled high customer satisfaction as key tenet of team culture through tying performance to satisfaction goals, resulting in a 95% satisfaction score for the team every quarter, even during periods when marketing demand grew faster than our services budget. US Business Solutions, Partner Recruitment Manager – Microsoft Dynamics Microsoft 2005  –  2006  (1 year) Redmond, WA. & Fargo, ND. Created, executed, and managed spend on annual marketing plans with a $1M budget, designed to recruit new partners into the Microsoft Business Solutions Partner Program. Partners were responsible for reselling ERP, (Microsoft Dynamics GP, AX, NAV, SL) Small Business Financials, and CRM.  \n• Managed telesales vendor to call all lists and respond to all inbound 800# calls from postings via digital marketing and below the line advertising.  \n• Managed many creative agencies that developed both print and digital marketing campaigns and collateral to provide leads to the channel development team. Attained banner ad click-through stats of over .65% for top sites. Microsoft Learning, Small and Mid-Market Marketing Manager - Server and Tools Microsoft 2004  –  2005  (1 year) Redmond, WA. Created integrated marketing plans targeted at small and mid-market business customers. Evangelized Microsoft Learning as the premier learning resource to both internal and external customers. Successfully managed annual marketing budget and spends against it. \n• Managed creative agencies that developed both print and digital marketing campaigns and collateral. Microsoft Learning, World Wide Channel Marketing Manager Microsoft 2002  –  2004  (2 years) Redmond, WA. Created and implemented marketing campaigns and materials that drove Microsoft Learning growth in the WW training space as well as preparing our Certified Partner for Learning Solutions channel to use and deploy new programs and tools provided by Microsoft.  \n• Built and executed marketing strategies for the World Wide Learning Solutions Partner channel that defined and enhanced the Microsoft Learning products portfolio and in turn supported the channels selling process. \n• Collaborated with program management to deliver new Microsoft Learning tools and programs to Learning Solutions partners. Intel Online Services - Global Trade Show and Event Manager Intel Corporation 1999  –  2002  (3 years) Seattle, WA. & Portland, OR. Managed 15 global trade shows and events per year. Managed global relationship with creative agencies to produce all marketing communications deliverables to clearly communicate the corporate message. Technical consultant for trade show teams.  \n• Established annual trade show budget of more than $2M and determined appropriate international and domestic events for corporate participation. Received Group Marketing Award for contribution to a successful European launch and awarded Divisional Recognition by company President for excellence in executing worldwide programs. Marketing Manager iCat Corporation April 1997  –  May 1999  (2 years 2 months) Seattle, WA. Managed database of 400 reseller partner files, sales reports, product inventory, and communications.  \n• Determined eligibility criteria for Marketing Development Fund program for reseller partners. Budget: $200K. \n• Co-wrote and produced all collateral and informational binders for each new reseller partner.  \n• Co-managed the International iCat Partner Conference held in Seattle. Over 300 representatives from 250 Global partners attended this three-day event, which included educational sessions and social activities. Budget: $200K. Account Manager Landor Associates 1996  –  1997  (1 year) Seattle, WA. Account Manager for Microsoft Corporation – Interactive Media Division, Internet Tools & Platforms,  \nConsumer Appliance Group. (Games & hardware)  \n• Managed team of six writers, designers, and electronic engineers for production of software product FPP.  \n• Advised client on implementation of new designs into both printed collateral and online advertising. \n• Created and managed individual budgets of up to $200K for multiple projects and established specific timelines for completion.  \n• Represented agency in presentation of all concepts, copy, and designs to the client. Production & Fulfillment Manager SPRYSOFT Div of CompuServe 1995  –  1996  (1 year) Greater Seattle Area Start-up Internet Service Provider and Software Manufacturer with Annual Sales of $10M. Sr. Marketing Manager Bridge Partners Consulting June 2015  – Present (3 months) Greater Seattle Area I am a Senior Marketing Manager working with Microsoft in the Windows team. I am responsible for assisting the SMB team with their integration into the US marketing initiatives across all the current campaigns and programs. Building out and branding Windows 10 SMB campaigns to drive upgrades to Windows 10 and Pro across the US. This includes digital and social marketing as well as retail and distributor programs that are taking advantage of the Windows Devices in Modern Biz initiative. Responsible for managing the development and distribution of all the OEM, Digital and Field sales marketing assets that are designed to support Windows 10 marketing across the segment.  Sr. Marketing Manager Bridge Partners Consulting June 2015  – Present (3 months) Greater Seattle Area I am a Senior Marketing Manager working with Microsoft in the Windows team. I am responsible for assisting the SMB team with their integration into the US marketing initiatives across all the current campaigns and programs. Building out and branding Windows 10 SMB campaigns to drive upgrades to Windows 10 and Pro across the US. This includes digital and social marketing as well as retail and distributor programs that are taking advantage of the Windows Devices in Modern Biz initiative. Responsible for managing the development and distribution of all the OEM, Digital and Field sales marketing assets that are designed to support Windows 10 marketing across the segment.  Senior Marketing and Operations Executive Seeking new opportunities September 2014  –  June 2015  (10 months) Greater Seattle Area I am looking to put my over 20 years of extensive and varied marketing and operations, product and program management experience to good use in a tech-savvy company and at the same time growing my career and marketing acumen. Seeking opportunities that will allow me to put my digital expertise and enthusiasm to good use developing and launching marketing campaigns and processes through the use of data and systems & tools including marketing automation and CRM. I have very well respected Field Management and Readiness experience and a drive for building and nurturing highly effective teams. My ability to build and sustain high-level relationships and my superior account management expertise and business development capabilities allow me to be very flexible in my career direction. Senior Marketing and Operations Executive Seeking new opportunities September 2014  –  June 2015  (10 months) Greater Seattle Area I am looking to put my over 20 years of extensive and varied marketing and operations, product and program management experience to good use in a tech-savvy company and at the same time growing my career and marketing acumen. Seeking opportunities that will allow me to put my digital expertise and enthusiasm to good use developing and launching marketing campaigns and processes through the use of data and systems & tools including marketing automation and CRM. I have very well respected Field Management and Readiness experience and a drive for building and nurturing highly effective teams. My ability to build and sustain high-level relationships and my superior account management expertise and business development capabilities allow me to be very flexible in my career direction. Global Field Operations / Marketing Program Manager – Windows Phone Microsoft 2012  –  2014  (2 years) Redmond, WA. Delivered all communications from corp. to the Global Windows Marketing (Phone) Field including OEM, Operator Channel, Retail, and Developers. Acted as the strategic Field advocate and voice back to corp. to ensure that the materials being provided were “Aiming and Arming” internal and external stakeholders to excel in their roles.  \n• Tripled readership of weekly Field newsletter and attendance of 2X monthly Field calls to over 750 stakeholders in 6 months by creating a community of stakeholders that shared best practices and worked more closely together as a cohesive team. \n• Drove in excess of 2X sell-in opportunity by planning, managing, and attending 4 Windows Phone 8.1 Global Field Summits held in Redmond, WA, Ft. Lauderdale, Amsterdam, and Singapore. Summits were designed to provide advance release details to Windows Phone Category Leads, Technical Sales, Operator Channel, and Mobile Operator Client Directors.  \n• Developed and provided all readiness programs and materials for global Windows Phone Field.  \n• Owned and administered global secure SharePoint site for all marketing assets and strategic annual planning documentation.  \n• Managed delivery of all digital marketing assets from Product Marketing, Mobile Operator / OEM, Apps, Windows Store and Developer teams to the World Wide Field for their use in ranging and commercialization of devices with customers and partners.  \n• Technical Program Manager for Microsoft internal events including TechReady (twice annual Developer conference held in Seattle), START (annual global marketing kick-off meeting) and MGX (annual global sales meeting).  \n• Developed and delivered all readiness programs for continued stakeholder and Field education. Global Field Operations / Marketing Program Manager – Windows Phone Microsoft 2012  –  2014  (2 years) Redmond, WA. Delivered all communications from corp. to the Global Windows Marketing (Phone) Field including OEM, Operator Channel, Retail, and Developers. Acted as the strategic Field advocate and voice back to corp. to ensure that the materials being provided were “Aiming and Arming” internal and external stakeholders to excel in their roles.  \n• Tripled readership of weekly Field newsletter and attendance of 2X monthly Field calls to over 750 stakeholders in 6 months by creating a community of stakeholders that shared best practices and worked more closely together as a cohesive team. \n• Drove in excess of 2X sell-in opportunity by planning, managing, and attending 4 Windows Phone 8.1 Global Field Summits held in Redmond, WA, Ft. Lauderdale, Amsterdam, and Singapore. Summits were designed to provide advance release details to Windows Phone Category Leads, Technical Sales, Operator Channel, and Mobile Operator Client Directors.  \n• Developed and provided all readiness programs and materials for global Windows Phone Field.  \n• Owned and administered global secure SharePoint site for all marketing assets and strategic annual planning documentation.  \n• Managed delivery of all digital marketing assets from Product Marketing, Mobile Operator / OEM, Apps, Windows Store and Developer teams to the World Wide Field for their use in ranging and commercialization of devices with customers and partners.  \n• Technical Program Manager for Microsoft internal events including TechReady (twice annual Developer conference held in Seattle), START (annual global marketing kick-off meeting) and MGX (annual global sales meeting).  \n• Developed and delivered all readiness programs for continued stakeholder and Field education. Global Marketing Operations, Sr. Marketing Manager – Digital Campaign Management and Reporting Microsoft Corporation 2006  –  2012  (6 years) Bellevue, WA. Manager and Business Owner of US Marketing Campaign Operations team in the Global Marketing Operations (GMO) team. Managed all digital and above and below the line marketing campaign set-up and validation in Marketing Automation tools for US Subsidiary. Responsible, end to end, for all campaign set-up, monitoring, lead management, and Return on Marketing Investment (ROMI) analysis reporting during and post campaign. Effective and trusted communicator to upper level management and looked to as a distinguished and intuitive self-starter with excellent problem resolution and presentation skills. \n• Managed highly successful operations team of 18 people by focusing on operational excellence as a foundation, and up-leveling high performers to become strategic partners with stakeholders. Managed annual budget of more than $2M. \n• Instilled high customer satisfaction as key tenet of team culture through tying performance to satisfaction goals, resulting in a 95% satisfaction score for the team every quarter, even during periods when marketing demand grew faster than our services budget. Global Marketing Operations, Sr. Marketing Manager – Digital Campaign Management and Reporting Microsoft Corporation 2006  –  2012  (6 years) Bellevue, WA. Manager and Business Owner of US Marketing Campaign Operations team in the Global Marketing Operations (GMO) team. Managed all digital and above and below the line marketing campaign set-up and validation in Marketing Automation tools for US Subsidiary. Responsible, end to end, for all campaign set-up, monitoring, lead management, and Return on Marketing Investment (ROMI) analysis reporting during and post campaign. Effective and trusted communicator to upper level management and looked to as a distinguished and intuitive self-starter with excellent problem resolution and presentation skills. \n• Managed highly successful operations team of 18 people by focusing on operational excellence as a foundation, and up-leveling high performers to become strategic partners with stakeholders. Managed annual budget of more than $2M. \n• Instilled high customer satisfaction as key tenet of team culture through tying performance to satisfaction goals, resulting in a 95% satisfaction score for the team every quarter, even during periods when marketing demand grew faster than our services budget. US Business Solutions, Partner Recruitment Manager – Microsoft Dynamics Microsoft 2005  –  2006  (1 year) Redmond, WA. & Fargo, ND. Created, executed, and managed spend on annual marketing plans with a $1M budget, designed to recruit new partners into the Microsoft Business Solutions Partner Program. Partners were responsible for reselling ERP, (Microsoft Dynamics GP, AX, NAV, SL) Small Business Financials, and CRM.  \n• Managed telesales vendor to call all lists and respond to all inbound 800# calls from postings via digital marketing and below the line advertising.  \n• Managed many creative agencies that developed both print and digital marketing campaigns and collateral to provide leads to the channel development team. Attained banner ad click-through stats of over .65% for top sites. US Business Solutions, Partner Recruitment Manager – Microsoft Dynamics Microsoft 2005  –  2006  (1 year) Redmond, WA. & Fargo, ND. Created, executed, and managed spend on annual marketing plans with a $1M budget, designed to recruit new partners into the Microsoft Business Solutions Partner Program. Partners were responsible for reselling ERP, (Microsoft Dynamics GP, AX, NAV, SL) Small Business Financials, and CRM.  \n• Managed telesales vendor to call all lists and respond to all inbound 800# calls from postings via digital marketing and below the line advertising.  \n• Managed many creative agencies that developed both print and digital marketing campaigns and collateral to provide leads to the channel development team. Attained banner ad click-through stats of over .65% for top sites. Microsoft Learning, Small and Mid-Market Marketing Manager - Server and Tools Microsoft 2004  –  2005  (1 year) Redmond, WA. Created integrated marketing plans targeted at small and mid-market business customers. Evangelized Microsoft Learning as the premier learning resource to both internal and external customers. Successfully managed annual marketing budget and spends against it. \n• Managed creative agencies that developed both print and digital marketing campaigns and collateral. Microsoft Learning, Small and Mid-Market Marketing Manager - Server and Tools Microsoft 2004  –  2005  (1 year) Redmond, WA. Created integrated marketing plans targeted at small and mid-market business customers. Evangelized Microsoft Learning as the premier learning resource to both internal and external customers. Successfully managed annual marketing budget and spends against it. \n• Managed creative agencies that developed both print and digital marketing campaigns and collateral. Microsoft Learning, World Wide Channel Marketing Manager Microsoft 2002  –  2004  (2 years) Redmond, WA. Created and implemented marketing campaigns and materials that drove Microsoft Learning growth in the WW training space as well as preparing our Certified Partner for Learning Solutions channel to use and deploy new programs and tools provided by Microsoft.  \n• Built and executed marketing strategies for the World Wide Learning Solutions Partner channel that defined and enhanced the Microsoft Learning products portfolio and in turn supported the channels selling process. \n• Collaborated with program management to deliver new Microsoft Learning tools and programs to Learning Solutions partners. Microsoft Learning, World Wide Channel Marketing Manager Microsoft 2002  –  2004  (2 years) Redmond, WA. Created and implemented marketing campaigns and materials that drove Microsoft Learning growth in the WW training space as well as preparing our Certified Partner for Learning Solutions channel to use and deploy new programs and tools provided by Microsoft.  \n• Built and executed marketing strategies for the World Wide Learning Solutions Partner channel that defined and enhanced the Microsoft Learning products portfolio and in turn supported the channels selling process. \n• Collaborated with program management to deliver new Microsoft Learning tools and programs to Learning Solutions partners. Intel Online Services - Global Trade Show and Event Manager Intel Corporation 1999  –  2002  (3 years) Seattle, WA. & Portland, OR. Managed 15 global trade shows and events per year. Managed global relationship with creative agencies to produce all marketing communications deliverables to clearly communicate the corporate message. Technical consultant for trade show teams.  \n• Established annual trade show budget of more than $2M and determined appropriate international and domestic events for corporate participation. Received Group Marketing Award for contribution to a successful European launch and awarded Divisional Recognition by company President for excellence in executing worldwide programs. Intel Online Services - Global Trade Show and Event Manager Intel Corporation 1999  –  2002  (3 years) Seattle, WA. & Portland, OR. Managed 15 global trade shows and events per year. Managed global relationship with creative agencies to produce all marketing communications deliverables to clearly communicate the corporate message. Technical consultant for trade show teams.  \n• Established annual trade show budget of more than $2M and determined appropriate international and domestic events for corporate participation. Received Group Marketing Award for contribution to a successful European launch and awarded Divisional Recognition by company President for excellence in executing worldwide programs. Marketing Manager iCat Corporation April 1997  –  May 1999  (2 years 2 months) Seattle, WA. Managed database of 400 reseller partner files, sales reports, product inventory, and communications.  \n• Determined eligibility criteria for Marketing Development Fund program for reseller partners. Budget: $200K. \n• Co-wrote and produced all collateral and informational binders for each new reseller partner.  \n• Co-managed the International iCat Partner Conference held in Seattle. Over 300 representatives from 250 Global partners attended this three-day event, which included educational sessions and social activities. Budget: $200K. Marketing Manager iCat Corporation April 1997  –  May 1999  (2 years 2 months) Seattle, WA. Managed database of 400 reseller partner files, sales reports, product inventory, and communications.  \n• Determined eligibility criteria for Marketing Development Fund program for reseller partners. Budget: $200K. \n• Co-wrote and produced all collateral and informational binders for each new reseller partner.  \n• Co-managed the International iCat Partner Conference held in Seattle. Over 300 representatives from 250 Global partners attended this three-day event, which included educational sessions and social activities. Budget: $200K. Account Manager Landor Associates 1996  –  1997  (1 year) Seattle, WA. Account Manager for Microsoft Corporation – Interactive Media Division, Internet Tools & Platforms,  \nConsumer Appliance Group. (Games & hardware)  \n• Managed team of six writers, designers, and electronic engineers for production of software product FPP.  \n• Advised client on implementation of new designs into both printed collateral and online advertising. \n• Created and managed individual budgets of up to $200K for multiple projects and established specific timelines for completion.  \n• Represented agency in presentation of all concepts, copy, and designs to the client. Account Manager Landor Associates 1996  –  1997  (1 year) Seattle, WA. Account Manager for Microsoft Corporation – Interactive Media Division, Internet Tools & Platforms,  \nConsumer Appliance Group. (Games & hardware)  \n• Managed team of six writers, designers, and electronic engineers for production of software product FPP.  \n• Advised client on implementation of new designs into both printed collateral and online advertising. \n• Created and managed individual budgets of up to $200K for multiple projects and established specific timelines for completion.  \n• Represented agency in presentation of all concepts, copy, and designs to the client. Production & Fulfillment Manager SPRYSOFT Div of CompuServe 1995  –  1996  (1 year) Greater Seattle Area Start-up Internet Service Provider and Software Manufacturer with Annual Sales of $10M. Production & Fulfillment Manager SPRYSOFT Div of CompuServe 1995  –  1996  (1 year) Greater Seattle Area Start-up Internet Service Provider and Software Manufacturer with Annual Sales of $10M. Languages French Limited working proficiency French Limited working proficiency French Limited working proficiency Limited working proficiency Skills Online Advertising Start-ups Marketing Team Management Integrated Marketing Digital Marketing Online Marketing Product Marketing Lead Management Analytics Management Mobile Devices Leadership Strategic Partnerships Marketing Communications Enterprise Software Multi-channel Marketing CRM Strategy Marketing Management Marketing Strategy Account Management Program Management Cross-functional Team... Field Marketing Business Intelligence Sales Process Go-to-market Strategy Product Management Competitive Analysis Consulting Lead Generation Demand Generation Partner Management Project Management Solution Selling Business Strategy Training Strategic Planning E-commerce Vendor Management Business Process Team Leadership Email Marketing Channel Partners Business Alliances Budgets SaaS Sales Business Development See 35+     See less Skills  Online Advertising Start-ups Marketing Team Management Integrated Marketing Digital Marketing Online Marketing Product Marketing Lead Management Analytics Management Mobile Devices Leadership Strategic Partnerships Marketing Communications Enterprise Software Multi-channel Marketing CRM Strategy Marketing Management Marketing Strategy Account Management Program Management Cross-functional Team... Field Marketing Business Intelligence Sales Process Go-to-market Strategy Product Management Competitive Analysis Consulting Lead Generation Demand Generation Partner Management Project Management Solution Selling Business Strategy Training Strategic Planning E-commerce Vendor Management Business Process Team Leadership Email Marketing Channel Partners Business Alliances Budgets SaaS Sales Business Development See 35+     See less Online Advertising Start-ups Marketing Team Management Integrated Marketing Digital Marketing Online Marketing Product Marketing Lead Management Analytics Management Mobile Devices Leadership Strategic Partnerships Marketing Communications Enterprise Software Multi-channel Marketing CRM Strategy Marketing Management Marketing Strategy Account Management Program Management Cross-functional Team... Field Marketing Business Intelligence Sales Process Go-to-market Strategy Product Management Competitive Analysis Consulting Lead Generation Demand Generation Partner Management Project Management Solution Selling Business Strategy Training Strategic Planning E-commerce Vendor Management Business Process Team Leadership Email Marketing Channel Partners Business Alliances Budgets SaaS Sales Business Development See 35+     See less Online Advertising Start-ups Marketing Team Management Integrated Marketing Digital Marketing Online Marketing Product Marketing Lead Management Analytics Management Mobile Devices Leadership Strategic Partnerships Marketing Communications Enterprise Software Multi-channel Marketing CRM Strategy Marketing Management Marketing Strategy Account Management Program Management Cross-functional Team... Field Marketing Business Intelligence Sales Process Go-to-market Strategy Product Management Competitive Analysis Consulting Lead Generation Demand Generation Partner Management Project Management Solution Selling Business Strategy Training Strategic Planning E-commerce Vendor Management Business Process Team Leadership Email Marketing Channel Partners Business Alliances Budgets SaaS Sales Business Development See 35+     See less Education Colorado College BA,  English 1984  – 1988 Activities and Societies:  Phi Delta Theta King's College School Wimbledon O and A Levels,  Biology ,  Economics & English 1976  – 1984 Activities and Societies:  Rowing team - 2nd 8 ,  X country ,  Swimming Colorado College BA,  English 1984  – 1988 Activities and Societies:  Phi Delta Theta Colorado College BA,  English 1984  – 1988 Activities and Societies:  Phi Delta Theta Colorado College BA,  English 1984  – 1988 Activities and Societies:  Phi Delta Theta King's College School Wimbledon O and A Levels,  Biology ,  Economics & English 1976  – 1984 Activities and Societies:  Rowing team - 2nd 8 ,  X country ,  Swimming King's College School Wimbledon O and A Levels,  Biology ,  Economics & English 1976  – 1984 Activities and Societies:  Rowing team - 2nd 8 ,  X country ,  Swimming King's College School Wimbledon O and A Levels,  Biology ,  Economics & English 1976  – 1984 Activities and Societies:  Rowing team - 2nd 8 ,  X country ,  Swimming Honors & Awards Microsoft \"Ship It\" Awards 2014 \"Ship It\" awards for both Windows Phone 8 and 8.1.  Microsoft \"Ship It\" Awards 2014 \"Ship It\" awards for both Windows Phone 8 and 8.1.  Microsoft \"Ship It\" Awards 2014 \"Ship It\" awards for both Windows Phone 8 and 8.1.  Microsoft \"Ship It\" Awards 2014 \"Ship It\" awards for both Windows Phone 8 and 8.1.  ", "Skills Intel Cross-functional Team... Product Management Software Development Product Development Program Management Semiconductors Manufacturing Project Planning Business Process Management Go-to-market Strategy Budgets Product Marketing Skills  Intel Cross-functional Team... Product Management Software Development Product Development Program Management Semiconductors Manufacturing Project Planning Business Process Management Go-to-market Strategy Budgets Product Marketing Intel Cross-functional Team... Product Management Software Development Product Development Program Management Semiconductors Manufacturing Project Planning Business Process Management Go-to-market Strategy Budgets Product Marketing Intel Cross-functional Team... Product Management Software Development Product Development Program Management Semiconductors Manufacturing Project Planning Business Process Management Go-to-market Strategy Budgets Product Marketing ", "Experience Event Program Manager Intel July 2000  – Present (15 years 2 months) Speakership and Program Event Manager Intel July 2000  –  December 2006  (6 years 6 months) • Generated $90 million in qualified leads by designing and developing a “Roadshow Seminar Series” 3 years running including content, logistics, and an invitation & registration system that enabled 3,000+ people to attend across 23 cities worldwide. \n• Planned and coordinated demonstrations and class curriculum logistics for annual Intel Sales and Marketing Conference that brought together key technical experts from various disciplines throughout the company.  \n• Established and maintained a “Communications Group Speakership Program” that generated more than 100 technical speakerships at conferences throughout the world each year. \n• Oversaw $1.5 million dollar budget to build and coordinate a successful and innovative booth and sponsorship presence at large and medium sized conferences and events critical to targeting and attracting diverse audiences.  \n• Oversaw logistics and placement of up to 25 demos for the very popular Technology Showcase - Intel Developers Forum. Senior Instructional Systems Designer RWD Technologies February 1999  –  July 2000  (1 year 6 months) Led analysis, design, and development of high quality training and performance improvement projects to support customers including Hewlett-Packard, AutoDesk, Fujitsu, and the Lawrence Livermore National Laboratory. Created company training policy and procedures. Prepared and delivered training via CD-ROM and Internet media platforms. Conferred with stakeholders to identify training needs based on processes, changes, and other factors. Principle Instructional Technologist, Idaho National Laboratory January 1991  –  February 1999  (8 years 2 months) Directed the design, development, and implementation of nationwide training and performance-based programs and workshops for Department of Energy and related contractors. Event Program Manager Intel July 2000  – Present (15 years 2 months) Event Program Manager Intel July 2000  – Present (15 years 2 months) Speakership and Program Event Manager Intel July 2000  –  December 2006  (6 years 6 months) • Generated $90 million in qualified leads by designing and developing a “Roadshow Seminar Series” 3 years running including content, logistics, and an invitation & registration system that enabled 3,000+ people to attend across 23 cities worldwide. \n• Planned and coordinated demonstrations and class curriculum logistics for annual Intel Sales and Marketing Conference that brought together key technical experts from various disciplines throughout the company.  \n• Established and maintained a “Communications Group Speakership Program” that generated more than 100 technical speakerships at conferences throughout the world each year. \n• Oversaw $1.5 million dollar budget to build and coordinate a successful and innovative booth and sponsorship presence at large and medium sized conferences and events critical to targeting and attracting diverse audiences.  \n• Oversaw logistics and placement of up to 25 demos for the very popular Technology Showcase - Intel Developers Forum. Speakership and Program Event Manager Intel July 2000  –  December 2006  (6 years 6 months) • Generated $90 million in qualified leads by designing and developing a “Roadshow Seminar Series” 3 years running including content, logistics, and an invitation & registration system that enabled 3,000+ people to attend across 23 cities worldwide. \n• Planned and coordinated demonstrations and class curriculum logistics for annual Intel Sales and Marketing Conference that brought together key technical experts from various disciplines throughout the company.  \n• Established and maintained a “Communications Group Speakership Program” that generated more than 100 technical speakerships at conferences throughout the world each year. \n• Oversaw $1.5 million dollar budget to build and coordinate a successful and innovative booth and sponsorship presence at large and medium sized conferences and events critical to targeting and attracting diverse audiences.  \n• Oversaw logistics and placement of up to 25 demos for the very popular Technology Showcase - Intel Developers Forum. Senior Instructional Systems Designer RWD Technologies February 1999  –  July 2000  (1 year 6 months) Led analysis, design, and development of high quality training and performance improvement projects to support customers including Hewlett-Packard, AutoDesk, Fujitsu, and the Lawrence Livermore National Laboratory. Created company training policy and procedures. Prepared and delivered training via CD-ROM and Internet media platforms. Conferred with stakeholders to identify training needs based on processes, changes, and other factors. Senior Instructional Systems Designer RWD Technologies February 1999  –  July 2000  (1 year 6 months) Led analysis, design, and development of high quality training and performance improvement projects to support customers including Hewlett-Packard, AutoDesk, Fujitsu, and the Lawrence Livermore National Laboratory. Created company training policy and procedures. Prepared and delivered training via CD-ROM and Internet media platforms. Conferred with stakeholders to identify training needs based on processes, changes, and other factors. Principle Instructional Technologist, Idaho National Laboratory January 1991  –  February 1999  (8 years 2 months) Directed the design, development, and implementation of nationwide training and performance-based programs and workshops for Department of Energy and related contractors. Principle Instructional Technologist, Idaho National Laboratory January 1991  –  February 1999  (8 years 2 months) Directed the design, development, and implementation of nationwide training and performance-based programs and workshops for Department of Energy and related contractors. Skills Training Program Management Instructional Design Policy Budgets Analysis Logistics Project Management Process Improvement Strategic Planning Cross-functional Team... Product Management Strategy Team Leadership Management Strategic Partnerships Leadership See 2+     See less Skills  Training Program Management Instructional Design Policy Budgets Analysis Logistics Project Management Process Improvement Strategic Planning Cross-functional Team... Product Management Strategy Team Leadership Management Strategic Partnerships Leadership See 2+     See less Training Program Management Instructional Design Policy Budgets Analysis Logistics Project Management Process Improvement Strategic Planning Cross-functional Team... Product Management Strategy Team Leadership Management Strategic Partnerships Leadership See 2+     See less Training Program Management Instructional Design Policy Budgets Analysis Logistics Project Management Process Improvement Strategic Planning Cross-functional Team... Product Management Strategy Team Leadership Management Strategic Partnerships Leadership See 2+     See less Education Utah State University MS,  Instructional Technology 1989  – 1991 Brigham Young University 1982  – 1988 Utah State University MS,  Instructional Technology 1989  – 1991 Utah State University MS,  Instructional Technology 1989  – 1991 Utah State University MS,  Instructional Technology 1989  – 1991 Brigham Young University 1982  – 1988 Brigham Young University 1982  – 1988 Brigham Young University 1982  – 1988 ", "Skills Product Marketing Marketing Communications Corporate Communications Public Relations Marketing Strategy Brand Management Telecommunications Strategic Partnerships Leadership Event Planning Marketing Program Management Business Development Media Relations Event Management Management Project Management Social Media Marketing Strategy Marketing Automation Salesforce.com Training Strategic Communications Cross Channel Marketing Advertising Budgets Social Media Negotiation Change Management Competitive Analysis B2B Integrated Marketing Strategic Partnership Customer Experience See 19+     See less Skills  Product Marketing Marketing Communications Corporate Communications Public Relations Marketing Strategy Brand Management Telecommunications Strategic Partnerships Leadership Event Planning Marketing Program Management Business Development Media Relations Event Management Management Project Management Social Media Marketing Strategy Marketing Automation Salesforce.com Training Strategic Communications Cross Channel Marketing Advertising Budgets Social Media Negotiation Change Management Competitive Analysis B2B Integrated Marketing Strategic Partnership Customer Experience See 19+     See less Product Marketing Marketing Communications Corporate Communications Public Relations Marketing Strategy Brand Management Telecommunications Strategic Partnerships Leadership Event Planning Marketing Program Management Business Development Media Relations Event Management Management Project Management Social Media Marketing Strategy Marketing Automation Salesforce.com Training Strategic Communications Cross Channel Marketing Advertising Budgets Social Media Negotiation Change Management Competitive Analysis B2B Integrated Marketing Strategic Partnership Customer Experience See 19+     See less Product Marketing Marketing Communications Corporate Communications Public Relations Marketing Strategy Brand Management Telecommunications Strategic Partnerships Leadership Event Planning Marketing Program Management Business Development Media Relations Event Management Management Project Management Social Media Marketing Strategy Marketing Automation Salesforce.com Training Strategic Communications Cross Channel Marketing Advertising Budgets Social Media Negotiation Change Management Competitive Analysis B2B Integrated Marketing Strategic Partnership Customer Experience See 19+     See less ", "Experience Event/Program Mangement - Cisco's Americas Partner Organization Cisco Systems February 2008  – Present (7 years 7 months) Research Triangle Park, NC Cisco's Americas Partner Organization - US Central Area; Cloud & Service Providers and Software & Solutions Innovation (Security) Training Program Manager (via Adecco Staffing) Credit Suisse February 2007  –  August 2007  (7 months) Press Relations Event Manager Intel Corporation April 1999  –  December 2006  (7 years 9 months) Marketing Assistant Hewlett-Packard January 1998  –  April 1999  (1 year 4 months) Executive Assistant Kiva Software May 1997  –  December 1997  (8 months) Sales Assistant Bay Networks September 1996  –  June 1997  (10 months) Event/Program Mangement - Cisco's Americas Partner Organization Cisco Systems February 2008  – Present (7 years 7 months) Research Triangle Park, NC Cisco's Americas Partner Organization - US Central Area; Cloud & Service Providers and Software & Solutions Innovation (Security) Event/Program Mangement - Cisco's Americas Partner Organization Cisco Systems February 2008  – Present (7 years 7 months) Research Triangle Park, NC Cisco's Americas Partner Organization - US Central Area; Cloud & Service Providers and Software & Solutions Innovation (Security) Training Program Manager (via Adecco Staffing) Credit Suisse February 2007  –  August 2007  (7 months) Training Program Manager (via Adecco Staffing) Credit Suisse February 2007  –  August 2007  (7 months) Press Relations Event Manager Intel Corporation April 1999  –  December 2006  (7 years 9 months) Press Relations Event Manager Intel Corporation April 1999  –  December 2006  (7 years 9 months) Marketing Assistant Hewlett-Packard January 1998  –  April 1999  (1 year 4 months) Marketing Assistant Hewlett-Packard January 1998  –  April 1999  (1 year 4 months) Executive Assistant Kiva Software May 1997  –  December 1997  (8 months) Executive Assistant Kiva Software May 1997  –  December 1997  (8 months) Sales Assistant Bay Networks September 1996  –  June 1997  (10 months) Sales Assistant Bay Networks September 1996  –  June 1997  (10 months) Skills Program Management Product Marketing Cross-functional Team... Management Event Planning Leadership Cisco Technologies Business Strategy Networking Strategic Planning Marketing Unified Communications Team Leadership Strategic Partnerships Training SaaS Cloud Computing Sales Strategy Competitive Analysis Product Management Start-ups Vendor Management Solution Selling Account Management See 10+     See less Skills  Program Management Product Marketing Cross-functional Team... Management Event Planning Leadership Cisco Technologies Business Strategy Networking Strategic Planning Marketing Unified Communications Team Leadership Strategic Partnerships Training SaaS Cloud Computing Sales Strategy Competitive Analysis Product Management Start-ups Vendor Management Solution Selling Account Management See 10+     See less Program Management Product Marketing Cross-functional Team... Management Event Planning Leadership Cisco Technologies Business Strategy Networking Strategic Planning Marketing Unified Communications Team Leadership Strategic Partnerships Training SaaS Cloud Computing Sales Strategy Competitive Analysis Product Management Start-ups Vendor Management Solution Selling Account Management See 10+     See less Program Management Product Marketing Cross-functional Team... Management Event Planning Leadership Cisco Technologies Business Strategy Networking Strategic Planning Marketing Unified Communications Team Leadership Strategic Partnerships Training SaaS Cloud Computing Sales Strategy Competitive Analysis Product Management Start-ups Vendor Management Solution Selling Account Management See 10+     See less Education Lynbrook 1974  – 1977 Lynbrook 1974  – 1977 Lynbrook 1974  – 1977 Lynbrook 1974  – 1977 ", "Experience Open Source Event Manager Intel Corporation April 2014  – Present (1 year 5 months) HIllsboro, OR Linux Enabling Program Manager Intel Corporation November 2012  –  April 2014  (1 year 6 months) Hillsboro, OR Project Coordinator Intel Corporation June 2012  –  January 2013  (8 months) Hillsboro, OR Vendor Business Management Intel Corporation March 2011  –  June 2012  (1 year 4 months) Portland, Oregon Area Project Analyst/Coordinator Intel Corporation July 2010  –  March 2011  (9 months) Hillsboro, OR Business Operations Manager Intel Corporation October 2009  –  July 2010  (10 months) Hillsboro, OR Project Coordinator for SDP program Intel Corporation October 2007  –  October 2009  (2 years 1 month) Sr Administrative Assistant Intel Corporation October 2005  –  October 2007  (2 years 1 month) Portland, Oregon Area Open Source Event Manager Intel Corporation April 2014  – Present (1 year 5 months) HIllsboro, OR Open Source Event Manager Intel Corporation April 2014  – Present (1 year 5 months) HIllsboro, OR Linux Enabling Program Manager Intel Corporation November 2012  –  April 2014  (1 year 6 months) Hillsboro, OR Linux Enabling Program Manager Intel Corporation November 2012  –  April 2014  (1 year 6 months) Hillsboro, OR Project Coordinator Intel Corporation June 2012  –  January 2013  (8 months) Hillsboro, OR Project Coordinator Intel Corporation June 2012  –  January 2013  (8 months) Hillsboro, OR Vendor Business Management Intel Corporation March 2011  –  June 2012  (1 year 4 months) Portland, Oregon Area Vendor Business Management Intel Corporation March 2011  –  June 2012  (1 year 4 months) Portland, Oregon Area Project Analyst/Coordinator Intel Corporation July 2010  –  March 2011  (9 months) Hillsboro, OR Project Analyst/Coordinator Intel Corporation July 2010  –  March 2011  (9 months) Hillsboro, OR Business Operations Manager Intel Corporation October 2009  –  July 2010  (10 months) Hillsboro, OR Business Operations Manager Intel Corporation October 2009  –  July 2010  (10 months) Hillsboro, OR Project Coordinator for SDP program Intel Corporation October 2007  –  October 2009  (2 years 1 month) Project Coordinator for SDP program Intel Corporation October 2007  –  October 2009  (2 years 1 month) Sr Administrative Assistant Intel Corporation October 2005  –  October 2007  (2 years 1 month) Portland, Oregon Area Sr Administrative Assistant Intel Corporation October 2005  –  October 2007  (2 years 1 month) Portland, Oregon Area Skills Cross-functional Team... Program Management Scrum Agile Project Management Agile Methodologies SharePoint JIRA Process Improvement Data Analysis Project Management Business Analysis Testing Linux Team Management Management Software Project... See 1+     See less Skills  Cross-functional Team... Program Management Scrum Agile Project Management Agile Methodologies SharePoint JIRA Process Improvement Data Analysis Project Management Business Analysis Testing Linux Team Management Management Software Project... See 1+     See less Cross-functional Team... Program Management Scrum Agile Project Management Agile Methodologies SharePoint JIRA Process Improvement Data Analysis Project Management Business Analysis Testing Linux Team Management Management Software Project... See 1+     See less Cross-functional Team... Program Management Scrum Agile Project Management Agile Methodologies SharePoint JIRA Process Improvement Data Analysis Project Management Business Analysis Testing Linux Team Management Management Software Project... See 1+     See less ", "Experience Training & Event Manager Intel Corporation Training & Event Manager Intel Corporation Training & Event Manager Intel Corporation ", "Summary A curse, yet equally a blessing, I see the world \"in marketing.\" Not technicolor. Not numbers. Not in cool little shapes and doodles, but marketing. It's my paintbrush. My language. I was once told, \"Toy, I swear. You watch commercials more than you watch the actual show.\" At the time, I was an aspiring journalist who had no clue that marketing was part of my DNA.  \n \nFor me, I absolutely get a kick out of helping clients understand the voice of their brand through the voice of their target audience and a thoughtful content/communications strategy. Helping them reach that eureka moment is equivalent to a doctor handing a new mom and dad their baby for the very first time. In marketing, it's at that very moment that a client \"gets it\" that I can truly build a marketing strategy and content-based framework that helps them truly reach their audience through all the necessary channels. From \"tip to tail,\" I love to outline a solid strategy and execute all the marketing tactics that drive results, while mapping back to the business goal.  \n \nIf you need a marketer who sees the world in marketing and has a knack for telling a great story, I'm the marketer for you. I'm analytical, research-oriented, customer-centric and deadline driven. At the end of the day, it's key that I work with those who - like me - have a diverse set of skills and share my drive to deliver stellar, memorable work that excites the stakeholder and their intended audience. Summary A curse, yet equally a blessing, I see the world \"in marketing.\" Not technicolor. Not numbers. Not in cool little shapes and doodles, but marketing. It's my paintbrush. My language. I was once told, \"Toy, I swear. You watch commercials more than you watch the actual show.\" At the time, I was an aspiring journalist who had no clue that marketing was part of my DNA.  \n \nFor me, I absolutely get a kick out of helping clients understand the voice of their brand through the voice of their target audience and a thoughtful content/communications strategy. Helping them reach that eureka moment is equivalent to a doctor handing a new mom and dad their baby for the very first time. In marketing, it's at that very moment that a client \"gets it\" that I can truly build a marketing strategy and content-based framework that helps them truly reach their audience through all the necessary channels. From \"tip to tail,\" I love to outline a solid strategy and execute all the marketing tactics that drive results, while mapping back to the business goal.  \n \nIf you need a marketer who sees the world in marketing and has a knack for telling a great story, I'm the marketer for you. I'm analytical, research-oriented, customer-centric and deadline driven. At the end of the day, it's key that I work with those who - like me - have a diverse set of skills and share my drive to deliver stellar, memorable work that excites the stakeholder and their intended audience. A curse, yet equally a blessing, I see the world \"in marketing.\" Not technicolor. Not numbers. Not in cool little shapes and doodles, but marketing. It's my paintbrush. My language. I was once told, \"Toy, I swear. You watch commercials more than you watch the actual show.\" At the time, I was an aspiring journalist who had no clue that marketing was part of my DNA.  \n \nFor me, I absolutely get a kick out of helping clients understand the voice of their brand through the voice of their target audience and a thoughtful content/communications strategy. Helping them reach that eureka moment is equivalent to a doctor handing a new mom and dad their baby for the very first time. In marketing, it's at that very moment that a client \"gets it\" that I can truly build a marketing strategy and content-based framework that helps them truly reach their audience through all the necessary channels. From \"tip to tail,\" I love to outline a solid strategy and execute all the marketing tactics that drive results, while mapping back to the business goal.  \n \nIf you need a marketer who sees the world in marketing and has a knack for telling a great story, I'm the marketer for you. I'm analytical, research-oriented, customer-centric and deadline driven. At the end of the day, it's key that I work with those who - like me - have a diverse set of skills and share my drive to deliver stellar, memorable work that excites the stakeholder and their intended audience. A curse, yet equally a blessing, I see the world \"in marketing.\" Not technicolor. Not numbers. Not in cool little shapes and doodles, but marketing. It's my paintbrush. My language. I was once told, \"Toy, I swear. You watch commercials more than you watch the actual show.\" At the time, I was an aspiring journalist who had no clue that marketing was part of my DNA.  \n \nFor me, I absolutely get a kick out of helping clients understand the voice of their brand through the voice of their target audience and a thoughtful content/communications strategy. Helping them reach that eureka moment is equivalent to a doctor handing a new mom and dad their baby for the very first time. In marketing, it's at that very moment that a client \"gets it\" that I can truly build a marketing strategy and content-based framework that helps them truly reach their audience through all the necessary channels. From \"tip to tail,\" I love to outline a solid strategy and execute all the marketing tactics that drive results, while mapping back to the business goal.  \n \nIf you need a marketer who sees the world in marketing and has a knack for telling a great story, I'm the marketer for you. I'm analytical, research-oriented, customer-centric and deadline driven. At the end of the day, it's key that I work with those who - like me - have a diverse set of skills and share my drive to deliver stellar, memorable work that excites the stakeholder and their intended audience. Experience Senior Digital Marketing Manager Continental Mills March 2014  – Present (1 year 6 months) Founder | Marketing and Web Consultant Jumper Consulting, LLC July 2010  –  March 2014  (3 years 9 months) greater seattle area At Jumper Consulting, I work as a Marketing and Web Consultant to emerging small to mid-sized businesses. I evaluate the needs and goals of a company to build a solid foundation for start-ups or to reinvigorate a \"stalled\" business. Using this information, I create a comprehensive marketing plan that incorporates editorial (i.e., copy writing, copy editing) and web presence (i.e., web design, social media). At Jumper Consulting, I also develop business plans, create logos (plus overall branding), create press kits, offer video production for site enhancement and optimize my clients' web presence (e.g., company sites, LinkedIn, Facebook, Yelp, etc.). Senior Marketing Manager BuzzBee Company December 2012  –  October 2013  (11 months) Seattle, WA As my team's (Team Microsoft One) Marketing Strategist, I developed, established and maintained marketing initiatives designed to meet the business goals of our clients. From the creation of marketing build of materials to collateral assets to website content, I enabled my clients to communicate a succinct, relevant message to their key stakeholders, field sales teams and - ultimately - the customers. In partnership with our design team, I was able to translate key proof points around product/service offerings, value propositions and key benefits through the Creative Team's visual communications. As project lead, I was responsible for ensuring that the team met deadlines, articulating project scope/strategy, maintaining timeline and contingency planning, while setting budgets, managing approval channels and monitoring performance. Relationship Campaign Marketing Manager Microsoft Corporation (Vendor) July 2010  –  December 2010  (6 months) Redmond, WA In this contract role (Amaxra), I addressed a gap of communication between Microsoft and its Dynamics CRM Existing Customer base. While we had done a great job of communicating with these customers within a trial capacity, I successfully launched an email-based relationship management (RM) program that addressed customers after they've purchased the product. My goal was to build a relationship with these customers by providing relevant, timely information that would help customers understand the full value of their investment. Furthermore, I broke away from the notion of corporate speak and spoke the language of customers by offering them information they wanted to hear and sought, not simply what we thought they wanted to hear.  \n \nI was also responsible for the rollout of a Targeted Account Management event series in which we offered one-to-few velocity events to build a stronger relationship with key accounts. This gave our sales reps an opportunity to expose their clients to the ways in which Microsoft Dynamics CRM is equipped to match the needs of their specific industries. Senior Copy Writer Microsoft Corporation (Vendor) May 2010  –  July 2010  (3 months) Redmond, WA In this project-based, contract role (Mactus Group), I was commissioned to write three comprehensive white papers about the rollout of a global human resource strategy within Microsoft Corporation. I interviewed key HR and executive figures within the company that understood the value of the globalized, expansion strategy and could lend helpful insight to other execs within the company. International Online Project Marketing Manager Microsoft Corporation (Vendor) September 2009  –  February 2010  (6 months) Redmond, WA In this contract role (Mactus Group), I successfully drove the launch of twelve international Global Career Sites, with a 100% deadline success rate. I rationalized and evaluated each subsidiary's existing site content to recommend relevant site structure and content strategy within the new global platform adoption. I went on to edit and rewrite the copy for 65% of the revamped websites to ensure content remained “on brand,” while presenting the new voice and tone of Employment Branding. Within an international capacity, I led daily calls with subsidiaries to effectively evangelize the approved platform and global employment brand to increase throughput of qualified candidates. It was key that I broker cross-functional and cross-team relationships between country stakeholders and the web operations team to efficiently drive localization of custom content. Marketing Manager Microsoft Corporation (FTE) October 2006  –  July 2009  (2 years 10 months) Redmond, WA *Please note that all three roles were within the same team.  \n \nCIO AUDIENCE, MARKETING MANAGER (07/08 - 07/09) \nI drove prioritized FY09 Depth campaigns of Mid-Market, CIO-based events through a comprehensive, overarching message. I went on to merge our efforts with the enterprise segment's customer-facing website to strengthen relationship with CIOs through the use of digital media, demos and CFO conversation support materials. Within our organization, I served as the strategic subject-matter expert and gatekeeper of all issues surrounding the CIO audience within the Upper Mid-Market Segment, including targeting, segmentation, messaging, relationship building and execution.  \n \nFIELD ENGAGEMENT, MARKETING MANAGER (07/07 - 07/08) \nI spearheaded the US rollout and on-boarding process of the Worldwide Annuity Dashboard tool and readiness materials within Field Marketing and Sales. I also directed Depth Segment, Field Marketing, Anti-Piracy, Security, CPE and Deployment teams in overall H2 FY08 and FY09 marketing planning and execution efforts. Lastly, I facilitated seamless interaction between Field Marketing and Depth Segment teams through weekly calls and the provision of relevant BOM materials to help drive field sales quota.  \n \nBUSINESS INTELLIGENCE AND DATA ANALYTICS, MARKETING MANAGER (10/06 - 07/07) \nIn this role, I strengthened the quality of the Mid-Market Relationship Program reporting protocols by creating a monthly reporting process and revenue scorecard. I designed the business report scorecard to highlight weak field sales areas, which enabled the Leadership Team to monitor and adjust their sales activity execution. I also provided direction and leadership to Annuity Leads by reporting end-to-end business results to drive efficiencies and increase renewal revenue awareness. Product Marketing Manager Microsoft Corporation (Vendor) June 2005  –  June 2006  (1 year 1 month) Redmond, WA In this contract role (Corestaff), I identified customer perception of the product (Windows XP Media Center Edition 2005) and online behavior to successfully relaunch the product website, managing a cross-functional team and internal partners. I strengthened overall consumer understanding of product by creating an interactive, take-home demo that offered a walkthrough of the product's features. Upon directing all messaging, product presence, giveaways and staffing at Digital Life 2005 and CES 2006, I created and presented event post mortems, identifying attendance, contest participation, and survey results. At CES, I went on to own and manage Microsoft's primary presence within the NextGen Home Experience, along with 13 booths. I drove branding, messaging and positioning guidelines across the organization through the development of an internal SharePoint site, Marketing and Communications Guidelines stylebook and repository for all supportive media.  \n \nFor the Media Center DVR, I managed the relationship with Best Buy, monitored sell-thru performance and adjusted marketing planning to drive sales of product with OEM partners. I also revamped the product's positioning/messaging frameworks and its website to strengthen the messaging and coordinate co-advertising initiatives. Marketing Programs and Event Manager Intel Corporation August 2004  –  April 2005  (9 months) Chandler, AZ I restructured a partner-based survey process from an existing 19-page document into three role-based, yet concise, online versions, increasing respondent activity by 58% and strengthening the level of accuracy. Organizing and managing three global teams (i.e., APAC, EMEA and LATAM), I implemented co-marketing programming to offer ISV partners a more customized approach to joint marketing. I went on to spearhead co-marketing activity with key global companies to support trade show sponsorships, value-added events, collateral creation and website development. I also rebranded and launched a worldwide technical training event, with an overall success rate of 98% and 27% increased attendance from the original event. Graduate Assistant Clark Atlanta University September 2003  –  May 2004  (9 months) Atlanta, GA Within the Office of Planning, Assessment and Research, I collected and researched structural data to shed light on the productivity and compliance of each department at the university. I presented findings to department leaders to allow them to detect and assess \"red flags\" within their respective academic and administrative infrastructures. By offering a qualitative and quantitative story for each department, this allowed administrators to implement measures to improve and augment each department's value to the University. MBA Marketing Communications Intern Intel Corporation June 2003  –  September 2003  (4 months) Folsom, CA As the catalyst that lead to a full-time offer upon graduation, my MBA internship allowed me to lead a global, cross-company team. As a group, we spearheaded the development and implementation of a viral marketing web initiative designed to create brand resonance and preference among IT professionals seeking open source resources. I developed a communications kit to support the media, potential founding members, analysts and others. Furthermore, I researched and identified IT-based trend analysis and supportive data to strengthen CIO’s (Doug Busch, Intel Corporation) presentation at Oracle AppsWorld Conference 2003 in London. Public Relations Specialist Clark Atlanta University July 2001  –  October 2002  (1 year 4 months) Atlanta, GA In this position, I developed the content strategy of the School of Business' alumni magazine. I wrote 85% of all copy, while managing and editing the remaining copy as submitted by students. I also supervised a team of 20 students in a donations call center operation, increasing alumni and corporate contributions by 12%. With our corporate sponsors, I went on to create an ad with Whirlpool Corporation for Black Enterprise magazine, managed the event planning for an annual show with Ford Motor Company and led a successful blood drive with the American Red Cross. Copy Editor Adair-Greene Advertising, Inc. February 2000  –  June 2001  (1 year 5 months) Atlanta, GA *Please note, agency was acquired by McCann-Erickson and currently is defunct.  \n \nAt Adair-Greene Advertising, I copy edited and signed-off on content for an array of client types, including pharmaceutical (e.g., Abbott Laboratories, Novartis, Bausch & Lomb), communications (e.g., BellSouth), non-profit (e.g., Hands on Atlanta) and consumer goods (e.g., Coca-Cola) organizations. I ensured compliance with antitrust regulations (per client) and consistency for each ad campaign. I become proficient in Chicago Manual and AMA Manual of style to effectively proofread copy for billboards, prescribing information, direct mailers, radio and messaging scripts, calendars, brochures, calendars, web content and branding \"playbooks.\" News Reporter The News Daily February 1999  –  February 2000  (1 year 1 month) Greater Atlanta Area As a rookie journalist, I broadened the newspaper's reach to younger readers by writing articles and covering topics that mirrored their interests, such as tattooing, illegal street racing and alternative career options. I owned the Business, Health and Education beats. I went on to strengthen local interest in a variety of causes, such as the area's no-kill animal shelter (lead to an increase in adoptions) and a women's violence safe haven. News Reporter The Atlanta Journal-Constitution June 1998  –  February 1999  (9 months) Greater Atlanta Area Along with managing the obituary section, I interviewed the loved ones of featured persons to write daily memorial articles. I also covered upcoming events within the area, by writing articles that gave readers a sneak peak at alternative weekend activities. Editorial Assistant | Assistant Editor UPSCALE Magazine 1997  –  1998  (1 year) Atlanta, GA During the second semester of my junior year in college, I was the editorial assistant intern, which involved clerical work and learning more about the publishing industry. Due to my tireless work and natural curiosity around magazines, I was asked to return the second semester of my senior year to serve as the Assistant Editor intern. In that role, I owned three editorial departments (Hair, Beauty and Books) and established the content strategy while mapping it to the magazine's overall editorial calendar. I also managed a team of writers and photographers, providing article and imagery assignments, respectively. I would copy edit all submitted work. Senior Digital Marketing Manager Continental Mills March 2014  – Present (1 year 6 months) Senior Digital Marketing Manager Continental Mills March 2014  – Present (1 year 6 months) Founder | Marketing and Web Consultant Jumper Consulting, LLC July 2010  –  March 2014  (3 years 9 months) greater seattle area At Jumper Consulting, I work as a Marketing and Web Consultant to emerging small to mid-sized businesses. I evaluate the needs and goals of a company to build a solid foundation for start-ups or to reinvigorate a \"stalled\" business. Using this information, I create a comprehensive marketing plan that incorporates editorial (i.e., copy writing, copy editing) and web presence (i.e., web design, social media). At Jumper Consulting, I also develop business plans, create logos (plus overall branding), create press kits, offer video production for site enhancement and optimize my clients' web presence (e.g., company sites, LinkedIn, Facebook, Yelp, etc.). Founder | Marketing and Web Consultant Jumper Consulting, LLC July 2010  –  March 2014  (3 years 9 months) greater seattle area At Jumper Consulting, I work as a Marketing and Web Consultant to emerging small to mid-sized businesses. I evaluate the needs and goals of a company to build a solid foundation for start-ups or to reinvigorate a \"stalled\" business. Using this information, I create a comprehensive marketing plan that incorporates editorial (i.e., copy writing, copy editing) and web presence (i.e., web design, social media). At Jumper Consulting, I also develop business plans, create logos (plus overall branding), create press kits, offer video production for site enhancement and optimize my clients' web presence (e.g., company sites, LinkedIn, Facebook, Yelp, etc.). Senior Marketing Manager BuzzBee Company December 2012  –  October 2013  (11 months) Seattle, WA As my team's (Team Microsoft One) Marketing Strategist, I developed, established and maintained marketing initiatives designed to meet the business goals of our clients. From the creation of marketing build of materials to collateral assets to website content, I enabled my clients to communicate a succinct, relevant message to their key stakeholders, field sales teams and - ultimately - the customers. In partnership with our design team, I was able to translate key proof points around product/service offerings, value propositions and key benefits through the Creative Team's visual communications. As project lead, I was responsible for ensuring that the team met deadlines, articulating project scope/strategy, maintaining timeline and contingency planning, while setting budgets, managing approval channels and monitoring performance. Senior Marketing Manager BuzzBee Company December 2012  –  October 2013  (11 months) Seattle, WA As my team's (Team Microsoft One) Marketing Strategist, I developed, established and maintained marketing initiatives designed to meet the business goals of our clients. From the creation of marketing build of materials to collateral assets to website content, I enabled my clients to communicate a succinct, relevant message to their key stakeholders, field sales teams and - ultimately - the customers. In partnership with our design team, I was able to translate key proof points around product/service offerings, value propositions and key benefits through the Creative Team's visual communications. As project lead, I was responsible for ensuring that the team met deadlines, articulating project scope/strategy, maintaining timeline and contingency planning, while setting budgets, managing approval channels and monitoring performance. Relationship Campaign Marketing Manager Microsoft Corporation (Vendor) July 2010  –  December 2010  (6 months) Redmond, WA In this contract role (Amaxra), I addressed a gap of communication between Microsoft and its Dynamics CRM Existing Customer base. While we had done a great job of communicating with these customers within a trial capacity, I successfully launched an email-based relationship management (RM) program that addressed customers after they've purchased the product. My goal was to build a relationship with these customers by providing relevant, timely information that would help customers understand the full value of their investment. Furthermore, I broke away from the notion of corporate speak and spoke the language of customers by offering them information they wanted to hear and sought, not simply what we thought they wanted to hear.  \n \nI was also responsible for the rollout of a Targeted Account Management event series in which we offered one-to-few velocity events to build a stronger relationship with key accounts. This gave our sales reps an opportunity to expose their clients to the ways in which Microsoft Dynamics CRM is equipped to match the needs of their specific industries. Relationship Campaign Marketing Manager Microsoft Corporation (Vendor) July 2010  –  December 2010  (6 months) Redmond, WA In this contract role (Amaxra), I addressed a gap of communication between Microsoft and its Dynamics CRM Existing Customer base. While we had done a great job of communicating with these customers within a trial capacity, I successfully launched an email-based relationship management (RM) program that addressed customers after they've purchased the product. My goal was to build a relationship with these customers by providing relevant, timely information that would help customers understand the full value of their investment. Furthermore, I broke away from the notion of corporate speak and spoke the language of customers by offering them information they wanted to hear and sought, not simply what we thought they wanted to hear.  \n \nI was also responsible for the rollout of a Targeted Account Management event series in which we offered one-to-few velocity events to build a stronger relationship with key accounts. This gave our sales reps an opportunity to expose their clients to the ways in which Microsoft Dynamics CRM is equipped to match the needs of their specific industries. Senior Copy Writer Microsoft Corporation (Vendor) May 2010  –  July 2010  (3 months) Redmond, WA In this project-based, contract role (Mactus Group), I was commissioned to write three comprehensive white papers about the rollout of a global human resource strategy within Microsoft Corporation. I interviewed key HR and executive figures within the company that understood the value of the globalized, expansion strategy and could lend helpful insight to other execs within the company. Senior Copy Writer Microsoft Corporation (Vendor) May 2010  –  July 2010  (3 months) Redmond, WA In this project-based, contract role (Mactus Group), I was commissioned to write three comprehensive white papers about the rollout of a global human resource strategy within Microsoft Corporation. I interviewed key HR and executive figures within the company that understood the value of the globalized, expansion strategy and could lend helpful insight to other execs within the company. International Online Project Marketing Manager Microsoft Corporation (Vendor) September 2009  –  February 2010  (6 months) Redmond, WA In this contract role (Mactus Group), I successfully drove the launch of twelve international Global Career Sites, with a 100% deadline success rate. I rationalized and evaluated each subsidiary's existing site content to recommend relevant site structure and content strategy within the new global platform adoption. I went on to edit and rewrite the copy for 65% of the revamped websites to ensure content remained “on brand,” while presenting the new voice and tone of Employment Branding. Within an international capacity, I led daily calls with subsidiaries to effectively evangelize the approved platform and global employment brand to increase throughput of qualified candidates. It was key that I broker cross-functional and cross-team relationships between country stakeholders and the web operations team to efficiently drive localization of custom content. International Online Project Marketing Manager Microsoft Corporation (Vendor) September 2009  –  February 2010  (6 months) Redmond, WA In this contract role (Mactus Group), I successfully drove the launch of twelve international Global Career Sites, with a 100% deadline success rate. I rationalized and evaluated each subsidiary's existing site content to recommend relevant site structure and content strategy within the new global platform adoption. I went on to edit and rewrite the copy for 65% of the revamped websites to ensure content remained “on brand,” while presenting the new voice and tone of Employment Branding. Within an international capacity, I led daily calls with subsidiaries to effectively evangelize the approved platform and global employment brand to increase throughput of qualified candidates. It was key that I broker cross-functional and cross-team relationships between country stakeholders and the web operations team to efficiently drive localization of custom content. Marketing Manager Microsoft Corporation (FTE) October 2006  –  July 2009  (2 years 10 months) Redmond, WA *Please note that all three roles were within the same team.  \n \nCIO AUDIENCE, MARKETING MANAGER (07/08 - 07/09) \nI drove prioritized FY09 Depth campaigns of Mid-Market, CIO-based events through a comprehensive, overarching message. I went on to merge our efforts with the enterprise segment's customer-facing website to strengthen relationship with CIOs through the use of digital media, demos and CFO conversation support materials. Within our organization, I served as the strategic subject-matter expert and gatekeeper of all issues surrounding the CIO audience within the Upper Mid-Market Segment, including targeting, segmentation, messaging, relationship building and execution.  \n \nFIELD ENGAGEMENT, MARKETING MANAGER (07/07 - 07/08) \nI spearheaded the US rollout and on-boarding process of the Worldwide Annuity Dashboard tool and readiness materials within Field Marketing and Sales. I also directed Depth Segment, Field Marketing, Anti-Piracy, Security, CPE and Deployment teams in overall H2 FY08 and FY09 marketing planning and execution efforts. Lastly, I facilitated seamless interaction between Field Marketing and Depth Segment teams through weekly calls and the provision of relevant BOM materials to help drive field sales quota.  \n \nBUSINESS INTELLIGENCE AND DATA ANALYTICS, MARKETING MANAGER (10/06 - 07/07) \nIn this role, I strengthened the quality of the Mid-Market Relationship Program reporting protocols by creating a monthly reporting process and revenue scorecard. I designed the business report scorecard to highlight weak field sales areas, which enabled the Leadership Team to monitor and adjust their sales activity execution. I also provided direction and leadership to Annuity Leads by reporting end-to-end business results to drive efficiencies and increase renewal revenue awareness. Marketing Manager Microsoft Corporation (FTE) October 2006  –  July 2009  (2 years 10 months) Redmond, WA *Please note that all three roles were within the same team.  \n \nCIO AUDIENCE, MARKETING MANAGER (07/08 - 07/09) \nI drove prioritized FY09 Depth campaigns of Mid-Market, CIO-based events through a comprehensive, overarching message. I went on to merge our efforts with the enterprise segment's customer-facing website to strengthen relationship with CIOs through the use of digital media, demos and CFO conversation support materials. Within our organization, I served as the strategic subject-matter expert and gatekeeper of all issues surrounding the CIO audience within the Upper Mid-Market Segment, including targeting, segmentation, messaging, relationship building and execution.  \n \nFIELD ENGAGEMENT, MARKETING MANAGER (07/07 - 07/08) \nI spearheaded the US rollout and on-boarding process of the Worldwide Annuity Dashboard tool and readiness materials within Field Marketing and Sales. I also directed Depth Segment, Field Marketing, Anti-Piracy, Security, CPE and Deployment teams in overall H2 FY08 and FY09 marketing planning and execution efforts. Lastly, I facilitated seamless interaction between Field Marketing and Depth Segment teams through weekly calls and the provision of relevant BOM materials to help drive field sales quota.  \n \nBUSINESS INTELLIGENCE AND DATA ANALYTICS, MARKETING MANAGER (10/06 - 07/07) \nIn this role, I strengthened the quality of the Mid-Market Relationship Program reporting protocols by creating a monthly reporting process and revenue scorecard. I designed the business report scorecard to highlight weak field sales areas, which enabled the Leadership Team to monitor and adjust their sales activity execution. I also provided direction and leadership to Annuity Leads by reporting end-to-end business results to drive efficiencies and increase renewal revenue awareness. Product Marketing Manager Microsoft Corporation (Vendor) June 2005  –  June 2006  (1 year 1 month) Redmond, WA In this contract role (Corestaff), I identified customer perception of the product (Windows XP Media Center Edition 2005) and online behavior to successfully relaunch the product website, managing a cross-functional team and internal partners. I strengthened overall consumer understanding of product by creating an interactive, take-home demo that offered a walkthrough of the product's features. Upon directing all messaging, product presence, giveaways and staffing at Digital Life 2005 and CES 2006, I created and presented event post mortems, identifying attendance, contest participation, and survey results. At CES, I went on to own and manage Microsoft's primary presence within the NextGen Home Experience, along with 13 booths. I drove branding, messaging and positioning guidelines across the organization through the development of an internal SharePoint site, Marketing and Communications Guidelines stylebook and repository for all supportive media.  \n \nFor the Media Center DVR, I managed the relationship with Best Buy, monitored sell-thru performance and adjusted marketing planning to drive sales of product with OEM partners. I also revamped the product's positioning/messaging frameworks and its website to strengthen the messaging and coordinate co-advertising initiatives. Product Marketing Manager Microsoft Corporation (Vendor) June 2005  –  June 2006  (1 year 1 month) Redmond, WA In this contract role (Corestaff), I identified customer perception of the product (Windows XP Media Center Edition 2005) and online behavior to successfully relaunch the product website, managing a cross-functional team and internal partners. I strengthened overall consumer understanding of product by creating an interactive, take-home demo that offered a walkthrough of the product's features. Upon directing all messaging, product presence, giveaways and staffing at Digital Life 2005 and CES 2006, I created and presented event post mortems, identifying attendance, contest participation, and survey results. At CES, I went on to own and manage Microsoft's primary presence within the NextGen Home Experience, along with 13 booths. I drove branding, messaging and positioning guidelines across the organization through the development of an internal SharePoint site, Marketing and Communications Guidelines stylebook and repository for all supportive media.  \n \nFor the Media Center DVR, I managed the relationship with Best Buy, monitored sell-thru performance and adjusted marketing planning to drive sales of product with OEM partners. I also revamped the product's positioning/messaging frameworks and its website to strengthen the messaging and coordinate co-advertising initiatives. Marketing Programs and Event Manager Intel Corporation August 2004  –  April 2005  (9 months) Chandler, AZ I restructured a partner-based survey process from an existing 19-page document into three role-based, yet concise, online versions, increasing respondent activity by 58% and strengthening the level of accuracy. Organizing and managing three global teams (i.e., APAC, EMEA and LATAM), I implemented co-marketing programming to offer ISV partners a more customized approach to joint marketing. I went on to spearhead co-marketing activity with key global companies to support trade show sponsorships, value-added events, collateral creation and website development. I also rebranded and launched a worldwide technical training event, with an overall success rate of 98% and 27% increased attendance from the original event. Marketing Programs and Event Manager Intel Corporation August 2004  –  April 2005  (9 months) Chandler, AZ I restructured a partner-based survey process from an existing 19-page document into three role-based, yet concise, online versions, increasing respondent activity by 58% and strengthening the level of accuracy. Organizing and managing three global teams (i.e., APAC, EMEA and LATAM), I implemented co-marketing programming to offer ISV partners a more customized approach to joint marketing. I went on to spearhead co-marketing activity with key global companies to support trade show sponsorships, value-added events, collateral creation and website development. I also rebranded and launched a worldwide technical training event, with an overall success rate of 98% and 27% increased attendance from the original event. Graduate Assistant Clark Atlanta University September 2003  –  May 2004  (9 months) Atlanta, GA Within the Office of Planning, Assessment and Research, I collected and researched structural data to shed light on the productivity and compliance of each department at the university. I presented findings to department leaders to allow them to detect and assess \"red flags\" within their respective academic and administrative infrastructures. By offering a qualitative and quantitative story for each department, this allowed administrators to implement measures to improve and augment each department's value to the University. Graduate Assistant Clark Atlanta University September 2003  –  May 2004  (9 months) Atlanta, GA Within the Office of Planning, Assessment and Research, I collected and researched structural data to shed light on the productivity and compliance of each department at the university. I presented findings to department leaders to allow them to detect and assess \"red flags\" within their respective academic and administrative infrastructures. By offering a qualitative and quantitative story for each department, this allowed administrators to implement measures to improve and augment each department's value to the University. MBA Marketing Communications Intern Intel Corporation June 2003  –  September 2003  (4 months) Folsom, CA As the catalyst that lead to a full-time offer upon graduation, my MBA internship allowed me to lead a global, cross-company team. As a group, we spearheaded the development and implementation of a viral marketing web initiative designed to create brand resonance and preference among IT professionals seeking open source resources. I developed a communications kit to support the media, potential founding members, analysts and others. Furthermore, I researched and identified IT-based trend analysis and supportive data to strengthen CIO’s (Doug Busch, Intel Corporation) presentation at Oracle AppsWorld Conference 2003 in London. MBA Marketing Communications Intern Intel Corporation June 2003  –  September 2003  (4 months) Folsom, CA As the catalyst that lead to a full-time offer upon graduation, my MBA internship allowed me to lead a global, cross-company team. As a group, we spearheaded the development and implementation of a viral marketing web initiative designed to create brand resonance and preference among IT professionals seeking open source resources. I developed a communications kit to support the media, potential founding members, analysts and others. Furthermore, I researched and identified IT-based trend analysis and supportive data to strengthen CIO’s (Doug Busch, Intel Corporation) presentation at Oracle AppsWorld Conference 2003 in London. Public Relations Specialist Clark Atlanta University July 2001  –  October 2002  (1 year 4 months) Atlanta, GA In this position, I developed the content strategy of the School of Business' alumni magazine. I wrote 85% of all copy, while managing and editing the remaining copy as submitted by students. I also supervised a team of 20 students in a donations call center operation, increasing alumni and corporate contributions by 12%. With our corporate sponsors, I went on to create an ad with Whirlpool Corporation for Black Enterprise magazine, managed the event planning for an annual show with Ford Motor Company and led a successful blood drive with the American Red Cross. Public Relations Specialist Clark Atlanta University July 2001  –  October 2002  (1 year 4 months) Atlanta, GA In this position, I developed the content strategy of the School of Business' alumni magazine. I wrote 85% of all copy, while managing and editing the remaining copy as submitted by students. I also supervised a team of 20 students in a donations call center operation, increasing alumni and corporate contributions by 12%. With our corporate sponsors, I went on to create an ad with Whirlpool Corporation for Black Enterprise magazine, managed the event planning for an annual show with Ford Motor Company and led a successful blood drive with the American Red Cross. Copy Editor Adair-Greene Advertising, Inc. February 2000  –  June 2001  (1 year 5 months) Atlanta, GA *Please note, agency was acquired by McCann-Erickson and currently is defunct.  \n \nAt Adair-Greene Advertising, I copy edited and signed-off on content for an array of client types, including pharmaceutical (e.g., Abbott Laboratories, Novartis, Bausch & Lomb), communications (e.g., BellSouth), non-profit (e.g., Hands on Atlanta) and consumer goods (e.g., Coca-Cola) organizations. I ensured compliance with antitrust regulations (per client) and consistency for each ad campaign. I become proficient in Chicago Manual and AMA Manual of style to effectively proofread copy for billboards, prescribing information, direct mailers, radio and messaging scripts, calendars, brochures, calendars, web content and branding \"playbooks.\" Copy Editor Adair-Greene Advertising, Inc. February 2000  –  June 2001  (1 year 5 months) Atlanta, GA *Please note, agency was acquired by McCann-Erickson and currently is defunct.  \n \nAt Adair-Greene Advertising, I copy edited and signed-off on content for an array of client types, including pharmaceutical (e.g., Abbott Laboratories, Novartis, Bausch & Lomb), communications (e.g., BellSouth), non-profit (e.g., Hands on Atlanta) and consumer goods (e.g., Coca-Cola) organizations. I ensured compliance with antitrust regulations (per client) and consistency for each ad campaign. I become proficient in Chicago Manual and AMA Manual of style to effectively proofread copy for billboards, prescribing information, direct mailers, radio and messaging scripts, calendars, brochures, calendars, web content and branding \"playbooks.\" News Reporter The News Daily February 1999  –  February 2000  (1 year 1 month) Greater Atlanta Area As a rookie journalist, I broadened the newspaper's reach to younger readers by writing articles and covering topics that mirrored their interests, such as tattooing, illegal street racing and alternative career options. I owned the Business, Health and Education beats. I went on to strengthen local interest in a variety of causes, such as the area's no-kill animal shelter (lead to an increase in adoptions) and a women's violence safe haven. News Reporter The News Daily February 1999  –  February 2000  (1 year 1 month) Greater Atlanta Area As a rookie journalist, I broadened the newspaper's reach to younger readers by writing articles and covering topics that mirrored their interests, such as tattooing, illegal street racing and alternative career options. I owned the Business, Health and Education beats. I went on to strengthen local interest in a variety of causes, such as the area's no-kill animal shelter (lead to an increase in adoptions) and a women's violence safe haven. News Reporter The Atlanta Journal-Constitution June 1998  –  February 1999  (9 months) Greater Atlanta Area Along with managing the obituary section, I interviewed the loved ones of featured persons to write daily memorial articles. I also covered upcoming events within the area, by writing articles that gave readers a sneak peak at alternative weekend activities. News Reporter The Atlanta Journal-Constitution June 1998  –  February 1999  (9 months) Greater Atlanta Area Along with managing the obituary section, I interviewed the loved ones of featured persons to write daily memorial articles. I also covered upcoming events within the area, by writing articles that gave readers a sneak peak at alternative weekend activities. Editorial Assistant | Assistant Editor UPSCALE Magazine 1997  –  1998  (1 year) Atlanta, GA During the second semester of my junior year in college, I was the editorial assistant intern, which involved clerical work and learning more about the publishing industry. Due to my tireless work and natural curiosity around magazines, I was asked to return the second semester of my senior year to serve as the Assistant Editor intern. In that role, I owned three editorial departments (Hair, Beauty and Books) and established the content strategy while mapping it to the magazine's overall editorial calendar. I also managed a team of writers and photographers, providing article and imagery assignments, respectively. I would copy edit all submitted work. Editorial Assistant | Assistant Editor UPSCALE Magazine 1997  –  1998  (1 year) Atlanta, GA During the second semester of my junior year in college, I was the editorial assistant intern, which involved clerical work and learning more about the publishing industry. Due to my tireless work and natural curiosity around magazines, I was asked to return the second semester of my senior year to serve as the Assistant Editor intern. In that role, I owned three editorial departments (Hair, Beauty and Books) and established the content strategy while mapping it to the magazine's overall editorial calendar. I also managed a team of writers and photographers, providing article and imagery assignments, respectively. I would copy edit all submitted work. Languages   Skills Skills     Education Clark Atlanta University MBA,  Marketing 2002  – 2004 Activities and Societies:  Director of Marketing for the “Development of Self” Conference Clark Atlanta University B.A.,  English 1994  – 1998 Activities and Societies:  Clark Atlanta University's Honors Program Clark Atlanta University MBA,  Marketing 2002  – 2004 Activities and Societies:  Director of Marketing for the “Development of Self” Conference Clark Atlanta University MBA,  Marketing 2002  – 2004 Activities and Societies:  Director of Marketing for the “Development of Self” Conference Clark Atlanta University MBA,  Marketing 2002  – 2004 Activities and Societies:  Director of Marketing for the “Development of Self” Conference Clark Atlanta University B.A.,  English 1994  – 1998 Activities and Societies:  Clark Atlanta University's Honors Program Clark Atlanta University B.A.,  English 1994  – 1998 Activities and Societies:  Clark Atlanta University's Honors Program Clark Atlanta University B.A.,  English 1994  – 1998 Activities and Societies:  Clark Atlanta University's Honors Program Honors & Awards Excellent Performance Award BuzzBee Company February 2013 Excellent Performance in a Team BuzzBee Company April 2013 2000 Excellence in Media Award Professional Association of Georgia’s Educators February 2000 For my coverage of Education in the State of Georgia.  Excellent Performance Award BuzzBee Company February 2013 Excellent Performance Award BuzzBee Company February 2013 Excellent Performance Award BuzzBee Company February 2013 Excellent Performance in a Team BuzzBee Company April 2013 Excellent Performance in a Team BuzzBee Company April 2013 Excellent Performance in a Team BuzzBee Company April 2013 2000 Excellence in Media Award Professional Association of Georgia’s Educators February 2000 For my coverage of Education in the State of Georgia.  2000 Excellence in Media Award Professional Association of Georgia’s Educators February 2000 For my coverage of Education in the State of Georgia.  2000 Excellence in Media Award Professional Association of Georgia’s Educators February 2000 For my coverage of Education in the State of Georgia.  ", "Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Digital Marketing Management Marketing Mobile Marketing Mobile Devices Online Marketing Multi-channel Marketing CRM Marketing Strategy Sales Corporate Events Event Planning Event Management Internal Communications Business Analysis Data Analysis B2B Marketing Business Development Mobile Technology Mobile Communications Telecommunications Web Marketing Product Marketing See 8+     See less Skills  Digital Marketing Management Marketing Mobile Marketing Mobile Devices Online Marketing Multi-channel Marketing CRM Marketing Strategy Sales Corporate Events Event Planning Event Management Internal Communications Business Analysis Data Analysis B2B Marketing Business Development Mobile Technology Mobile Communications Telecommunications Web Marketing Product Marketing See 8+     See less Digital Marketing Management Marketing Mobile Marketing Mobile Devices Online Marketing Multi-channel Marketing CRM Marketing Strategy Sales Corporate Events Event Planning Event Management Internal Communications Business Analysis Data Analysis B2B Marketing Business Development Mobile Technology Mobile Communications Telecommunications Web Marketing Product Marketing See 8+     See less Digital Marketing Management Marketing Mobile Marketing Mobile Devices Online Marketing Multi-channel Marketing CRM Marketing Strategy Sales Corporate Events Event Planning Event Management Internal Communications Business Analysis Data Analysis B2B Marketing Business Development Mobile Technology Mobile Communications Telecommunications Web Marketing Product Marketing See 8+     See less ", "Skills Vendor Management Program Management Product Management Semiconductors Product Marketing XML Process Improvement Software Development Project Management Strategic Partnerships HTML Cross-functional Team... Strategic Planning Strategy Management Content Management See 1+     See less Skills  Vendor Management Program Management Product Management Semiconductors Product Marketing XML Process Improvement Software Development Project Management Strategic Partnerships HTML Cross-functional Team... Strategic Planning Strategy Management Content Management See 1+     See less Vendor Management Program Management Product Management Semiconductors Product Marketing XML Process Improvement Software Development Project Management Strategic Partnerships HTML Cross-functional Team... Strategic Planning Strategy Management Content Management See 1+     See less Vendor Management Program Management Product Management Semiconductors Product Marketing XML Process Improvement Software Development Project Management Strategic Partnerships HTML Cross-functional Team... Strategic Planning Strategy Management Content Management See 1+     See less "]}