{"position": "External Relations", "company": "IBM", "profiles": ["Skills Analyst Relations Press Releases Public Relations Crisis Communications Editing Marketing Communications Thought Leadership Media Relations Strategic Communications Copywriting Leadership Messaging Social Media Writing Product Marketing Corporate Communications Strategy Social Networking Internal Communications Marketing Competitive Analysis Communication Training Program Management Integrated Marketing Journalism Product Launch Community Outreach Content Management Content Strategy Publications Content Development Bass Guitar Executive... Blogging Storytelling Crisis Management Enterprise Software Newsletters Web Content Speech Writing Positioning New Media See 27+     See less Skills  Analyst Relations Press Releases Public Relations Crisis Communications Editing Marketing Communications Thought Leadership Media Relations Strategic Communications Copywriting Leadership Messaging Social Media Writing Product Marketing Corporate Communications Strategy Social Networking Internal Communications Marketing Competitive Analysis Communication Training Program Management Integrated Marketing Journalism Product Launch Community Outreach Content Management Content Strategy Publications Content Development Bass Guitar Executive... Blogging Storytelling Crisis Management Enterprise Software Newsletters Web Content Speech Writing Positioning New Media See 27+     See less Analyst Relations Press Releases Public Relations Crisis Communications Editing Marketing Communications Thought Leadership Media Relations Strategic Communications Copywriting Leadership Messaging Social Media Writing Product Marketing Corporate Communications Strategy Social Networking Internal Communications Marketing Competitive Analysis Communication Training Program Management Integrated Marketing Journalism Product Launch Community Outreach Content Management Content Strategy Publications Content Development Bass Guitar Executive... Blogging Storytelling Crisis Management Enterprise Software Newsletters Web Content Speech Writing Positioning New Media See 27+     See less Analyst Relations Press Releases Public Relations Crisis Communications Editing Marketing Communications Thought Leadership Media Relations Strategic Communications Copywriting Leadership Messaging Social Media Writing Product Marketing Corporate Communications Strategy Social Networking Internal Communications Marketing Competitive Analysis Communication Training Program Management Integrated Marketing Journalism Product Launch Community Outreach Content Management Content Strategy Publications Content Development Bass Guitar Executive... Blogging Storytelling Crisis Management Enterprise Software Newsletters Web Content Speech Writing Positioning New Media See 27+     See less ", "Skills Media Relations Press Releases Crisis Communications Public Relations Strategic Communications Corporate Communications Social Media Internal Communications Message Development Facebook Blogging Content Strategy Digital Marketing Copywriting Marketing Social Networking See 1+     See less Skills  Media Relations Press Releases Crisis Communications Public Relations Strategic Communications Corporate Communications Social Media Internal Communications Message Development Facebook Blogging Content Strategy Digital Marketing Copywriting Marketing Social Networking See 1+     See less Media Relations Press Releases Crisis Communications Public Relations Strategic Communications Corporate Communications Social Media Internal Communications Message Development Facebook Blogging Content Strategy Digital Marketing Copywriting Marketing Social Networking See 1+     See less Media Relations Press Releases Crisis Communications Public Relations Strategic Communications Corporate Communications Social Media Internal Communications Message Development Facebook Blogging Content Strategy Digital Marketing Copywriting Marketing Social Networking See 1+     See less ", "Skills Executive Communications Internal Communications Corporate Communications Strategic Communications Content Management Media Relations Analyst Relations Crisis Communications Brand Communications Speech Writing Opinion Writing Content Strategy Content Development Content Writing Strategic... Communication Training Translation Public Relations Public Affairs Press Releases Copywriting Messaging Social Media Corporate Branding Marketing Communications Corporate Social... See 11+     See less Skills  Executive Communications Internal Communications Corporate Communications Strategic Communications Content Management Media Relations Analyst Relations Crisis Communications Brand Communications Speech Writing Opinion Writing Content Strategy Content Development Content Writing Strategic... Communication Training Translation Public Relations Public Affairs Press Releases Copywriting Messaging Social Media Corporate Branding Marketing Communications Corporate Social... See 11+     See less Executive Communications Internal Communications Corporate Communications Strategic Communications Content Management Media Relations Analyst Relations Crisis Communications Brand Communications Speech Writing Opinion Writing Content Strategy Content Development Content Writing Strategic... Communication Training Translation Public Relations Public Affairs Press Releases Copywriting Messaging Social Media Corporate Branding Marketing Communications Corporate Social... See 11+     See less Executive Communications Internal Communications Corporate Communications Strategic Communications Content Management Media Relations Analyst Relations Crisis Communications Brand Communications Speech Writing Opinion Writing Content Strategy Content Development Content Writing Strategic... Communication Training Translation Public Relations Public Affairs Press Releases Copywriting Messaging Social Media Corporate Branding Marketing Communications Corporate Social... See 11+     See less ", "Summary I am an IBM executive with more than 18 years experience in translating complex ideas and issues into understandable business strategies. I've held several media relations, executive communications and internal communications positions at the company. Currently I lead IBM's global workforce communications and enablement (aka internal communications) for the company -- a role that blends expertise in marketing and communications. Beyond communicating to employees, we drive culture change programs across the company. Our mission is to help IBMers understand our strategy and live up to our corporate character: our purpose, our values are how we engage and show up as IBMers in front of all the people we care about. In other words, how IBM is actually experienced by clients, investors, partners, fellow IBMers and individuals in the communities we live and operate in. Summary I am an IBM executive with more than 18 years experience in translating complex ideas and issues into understandable business strategies. I've held several media relations, executive communications and internal communications positions at the company. Currently I lead IBM's global workforce communications and enablement (aka internal communications) for the company -- a role that blends expertise in marketing and communications. Beyond communicating to employees, we drive culture change programs across the company. Our mission is to help IBMers understand our strategy and live up to our corporate character: our purpose, our values are how we engage and show up as IBMers in front of all the people we care about. In other words, how IBM is actually experienced by clients, investors, partners, fellow IBMers and individuals in the communities we live and operate in. I am an IBM executive with more than 18 years experience in translating complex ideas and issues into understandable business strategies. I've held several media relations, executive communications and internal communications positions at the company. Currently I lead IBM's global workforce communications and enablement (aka internal communications) for the company -- a role that blends expertise in marketing and communications. Beyond communicating to employees, we drive culture change programs across the company. Our mission is to help IBMers understand our strategy and live up to our corporate character: our purpose, our values are how we engage and show up as IBMers in front of all the people we care about. In other words, how IBM is actually experienced by clients, investors, partners, fellow IBMers and individuals in the communities we live and operate in. I am an IBM executive with more than 18 years experience in translating complex ideas and issues into understandable business strategies. I've held several media relations, executive communications and internal communications positions at the company. Currently I lead IBM's global workforce communications and enablement (aka internal communications) for the company -- a role that blends expertise in marketing and communications. Beyond communicating to employees, we drive culture change programs across the company. Our mission is to help IBMers understand our strategy and live up to our corporate character: our purpose, our values are how we engage and show up as IBMers in front of all the people we care about. In other words, how IBM is actually experienced by clients, investors, partners, fellow IBMers and individuals in the communities we live and operate in. Experience Vice President, Corporate Marketing and Communications IBM May 2014  – Present (1 year 4 months) Vice President, Workforce Communications and Enablement IBM January 2010  – Present (5 years 8 months) Armonk, NY I lead a global team of IBM communications professionals who help IBMers understand our strategy and live our values. We build and deploy strategic programs and digital platforms designed to drive transformative change in how we work. We actively collaborate across the business - with HR, CIO and many others -- in our work. I am currently leading a transformation of our internal communications organization from traditional corporate communications to a much richer set of capabilities at the intersection of brand and culture. Deploying strategic communications and employee engagement platforms for the CEO and other senior leaders to engage with more than 430,000 employees in 170 countries through both high-touch, in-person programs and innovative digital platforms. Establishing the connection between IBM’s values and the behaviors that bring those values to life through communications and learning programs that help IBMers build belief and act on those behaviors, including an online brainstorming Jam with more than 250,000 employees who helped define the work. Advise the senior vice president, human resource on employee engagement and internal communications issues and opportunities. Director, Corporate Communications IBM June 2008  –  January 2010  (1 year 8 months) Served as a strategic advisor and chief of staff to the senior vice president of IBM Marketing and Communications during the integration of three functions into one and the creation of IBM's Smarter Planet strategy. Director, External Relations IBM June 2006  –  June 2008  (2 years 1 month) Led external relations for IBM's Research and Development teams and co-created and oversaw the launch of key innovation platforms, including IBM's Next 5-in-5, Imagine the World in 2050, Made in IBM Labs, and others that have led to positive brand positioning and press coverage for IBM Research and IBM. Positioned complex scientific and technical breakthroughs, resulting in hundreds of positive press mentions in major media and social media. Was part of the initial Marketing and Communications team who helped conceive of and pitch the Watson-Jeopardy concept -- successfully selling the concept to IBM Management and to Sony/Jeopardy producers. Manager, External Relations and Internal Communications IBM June 1996  –  June 2006  (10 years 1 month) Various Held various external, internal communications, speechwriting and special assignments (including IBM's Global Innovation Outlook, the annual report and annual shareholders meeting) at IBM during my first decade with the company. Helped to launch many successful IBM products and service, work on competitive positioning campaigns and strategic corporate initiatives, including the IBM-pioneered companywide online brainstorming \"Jams\". Worked in many business units: Systems and Technology, Software Group, Global Business Services, Corporate Communications and IBM Research. Vice President, Corporate Marketing and Communications IBM May 2014  – Present (1 year 4 months) Vice President, Corporate Marketing and Communications IBM May 2014  – Present (1 year 4 months) Vice President, Workforce Communications and Enablement IBM January 2010  – Present (5 years 8 months) Armonk, NY I lead a global team of IBM communications professionals who help IBMers understand our strategy and live our values. We build and deploy strategic programs and digital platforms designed to drive transformative change in how we work. We actively collaborate across the business - with HR, CIO and many others -- in our work. I am currently leading a transformation of our internal communications organization from traditional corporate communications to a much richer set of capabilities at the intersection of brand and culture. Deploying strategic communications and employee engagement platforms for the CEO and other senior leaders to engage with more than 430,000 employees in 170 countries through both high-touch, in-person programs and innovative digital platforms. Establishing the connection between IBM’s values and the behaviors that bring those values to life through communications and learning programs that help IBMers build belief and act on those behaviors, including an online brainstorming Jam with more than 250,000 employees who helped define the work. Advise the senior vice president, human resource on employee engagement and internal communications issues and opportunities. Vice President, Workforce Communications and Enablement IBM January 2010  – Present (5 years 8 months) Armonk, NY I lead a global team of IBM communications professionals who help IBMers understand our strategy and live our values. We build and deploy strategic programs and digital platforms designed to drive transformative change in how we work. We actively collaborate across the business - with HR, CIO and many others -- in our work. I am currently leading a transformation of our internal communications organization from traditional corporate communications to a much richer set of capabilities at the intersection of brand and culture. Deploying strategic communications and employee engagement platforms for the CEO and other senior leaders to engage with more than 430,000 employees in 170 countries through both high-touch, in-person programs and innovative digital platforms. Establishing the connection between IBM’s values and the behaviors that bring those values to life through communications and learning programs that help IBMers build belief and act on those behaviors, including an online brainstorming Jam with more than 250,000 employees who helped define the work. Advise the senior vice president, human resource on employee engagement and internal communications issues and opportunities. Director, Corporate Communications IBM June 2008  –  January 2010  (1 year 8 months) Served as a strategic advisor and chief of staff to the senior vice president of IBM Marketing and Communications during the integration of three functions into one and the creation of IBM's Smarter Planet strategy. Director, Corporate Communications IBM June 2008  –  January 2010  (1 year 8 months) Served as a strategic advisor and chief of staff to the senior vice president of IBM Marketing and Communications during the integration of three functions into one and the creation of IBM's Smarter Planet strategy. Director, External Relations IBM June 2006  –  June 2008  (2 years 1 month) Led external relations for IBM's Research and Development teams and co-created and oversaw the launch of key innovation platforms, including IBM's Next 5-in-5, Imagine the World in 2050, Made in IBM Labs, and others that have led to positive brand positioning and press coverage for IBM Research and IBM. Positioned complex scientific and technical breakthroughs, resulting in hundreds of positive press mentions in major media and social media. Was part of the initial Marketing and Communications team who helped conceive of and pitch the Watson-Jeopardy concept -- successfully selling the concept to IBM Management and to Sony/Jeopardy producers. Director, External Relations IBM June 2006  –  June 2008  (2 years 1 month) Led external relations for IBM's Research and Development teams and co-created and oversaw the launch of key innovation platforms, including IBM's Next 5-in-5, Imagine the World in 2050, Made in IBM Labs, and others that have led to positive brand positioning and press coverage for IBM Research and IBM. Positioned complex scientific and technical breakthroughs, resulting in hundreds of positive press mentions in major media and social media. Was part of the initial Marketing and Communications team who helped conceive of and pitch the Watson-Jeopardy concept -- successfully selling the concept to IBM Management and to Sony/Jeopardy producers. Manager, External Relations and Internal Communications IBM June 1996  –  June 2006  (10 years 1 month) Various Held various external, internal communications, speechwriting and special assignments (including IBM's Global Innovation Outlook, the annual report and annual shareholders meeting) at IBM during my first decade with the company. Helped to launch many successful IBM products and service, work on competitive positioning campaigns and strategic corporate initiatives, including the IBM-pioneered companywide online brainstorming \"Jams\". Worked in many business units: Systems and Technology, Software Group, Global Business Services, Corporate Communications and IBM Research. Manager, External Relations and Internal Communications IBM June 1996  –  June 2006  (10 years 1 month) Various Held various external, internal communications, speechwriting and special assignments (including IBM's Global Innovation Outlook, the annual report and annual shareholders meeting) at IBM during my first decade with the company. Helped to launch many successful IBM products and service, work on competitive positioning campaigns and strategic corporate initiatives, including the IBM-pioneered companywide online brainstorming \"Jams\". Worked in many business units: Systems and Technology, Software Group, Global Business Services, Corporate Communications and IBM Research. Skills Internal Communications Program Management Media Relations Social Media Marketing Strategy Public Relations Corporate Communications Product Marketing Strategic Communications Crisis Communications Marketing Strategy Integrated Marketing Digital Media Messaging Communication Training Thought Leadership Digital Marketing Marketing Communications Marketing Management Digital Strategy Strategic Partnerships Content Management Direct Marketing Analyst Relations Demand Generation Sales Enablement Speech Writing B2B Marketing Brand Management Content Strategy Go-to-market Strategy Content Development Multi-channel Marketing Lead Generation See 20+     See less Skills  Internal Communications Program Management Media Relations Social Media Marketing Strategy Public Relations Corporate Communications Product Marketing Strategic Communications Crisis Communications Marketing Strategy Integrated Marketing Digital Media Messaging Communication Training Thought Leadership Digital Marketing Marketing Communications Marketing Management Digital Strategy Strategic Partnerships Content Management Direct Marketing Analyst Relations Demand Generation Sales Enablement Speech Writing B2B Marketing Brand Management Content Strategy Go-to-market Strategy Content Development Multi-channel Marketing Lead Generation See 20+     See less Internal Communications Program Management Media Relations Social Media Marketing Strategy Public Relations Corporate Communications Product Marketing Strategic Communications Crisis Communications Marketing Strategy Integrated Marketing Digital Media Messaging Communication Training Thought Leadership Digital Marketing Marketing Communications Marketing Management Digital Strategy Strategic Partnerships Content Management Direct Marketing Analyst Relations Demand Generation Sales Enablement Speech Writing B2B Marketing Brand Management Content Strategy Go-to-market Strategy Content Development Multi-channel Marketing Lead Generation See 20+     See less Internal Communications Program Management Media Relations Social Media Marketing Strategy Public Relations Corporate Communications Product Marketing Strategic Communications Crisis Communications Marketing Strategy Integrated Marketing Digital Media Messaging Communication Training Thought Leadership Digital Marketing Marketing Communications Marketing Management Digital Strategy Strategic Partnerships Content Management Direct Marketing Analyst Relations Demand Generation Sales Enablement Speech Writing B2B Marketing Brand Management Content Strategy Go-to-market Strategy Content Development Multi-channel Marketing Lead Generation See 20+     See less Education Fordham University - Graduate School of Business Administration Master of Business,  Communications and Media Management 1998  – 2001 While working at IBM, I earned my MBA at Fordham University, attending class on nights and weekends to build out my understanding of business and financial matters relevant to my job and career. Fordham University Bachelor of Arts,  Communications 1990  – 1994 During my studies at Fordham, I held internship positions at advertising firm Foote, Cone and Belding, with WABC-TV in the promotions department (my desk was just outside of Regis Philbin's office, and I can confirm he acts the same on and off the air) and with a film production company out of Los Angeles. I also worked at Yankee Stadium which was close by, managing the Sidewalk Cafe (I went to the home games, but never saw a single play in that time, too busy working). I also played Rugby and was the team's fundraising lead my junior year and President during my senior year. Fordham University - Graduate School of Business Administration Master of Business,  Communications and Media Management 1998  – 2001 While working at IBM, I earned my MBA at Fordham University, attending class on nights and weekends to build out my understanding of business and financial matters relevant to my job and career. Fordham University - Graduate School of Business Administration Master of Business,  Communications and Media Management 1998  – 2001 While working at IBM, I earned my MBA at Fordham University, attending class on nights and weekends to build out my understanding of business and financial matters relevant to my job and career. Fordham University - Graduate School of Business Administration Master of Business,  Communications and Media Management 1998  – 2001 While working at IBM, I earned my MBA at Fordham University, attending class on nights and weekends to build out my understanding of business and financial matters relevant to my job and career. Fordham University Bachelor of Arts,  Communications 1990  – 1994 During my studies at Fordham, I held internship positions at advertising firm Foote, Cone and Belding, with WABC-TV in the promotions department (my desk was just outside of Regis Philbin's office, and I can confirm he acts the same on and off the air) and with a film production company out of Los Angeles. I also worked at Yankee Stadium which was close by, managing the Sidewalk Cafe (I went to the home games, but never saw a single play in that time, too busy working). I also played Rugby and was the team's fundraising lead my junior year and President during my senior year. Fordham University Bachelor of Arts,  Communications 1990  – 1994 During my studies at Fordham, I held internship positions at advertising firm Foote, Cone and Belding, with WABC-TV in the promotions department (my desk was just outside of Regis Philbin's office, and I can confirm he acts the same on and off the air) and with a film production company out of Los Angeles. I also worked at Yankee Stadium which was close by, managing the Sidewalk Cafe (I went to the home games, but never saw a single play in that time, too busy working). I also played Rugby and was the team's fundraising lead my junior year and President during my senior year. Fordham University Bachelor of Arts,  Communications 1990  – 1994 During my studies at Fordham, I held internship positions at advertising firm Foote, Cone and Belding, with WABC-TV in the promotions department (my desk was just outside of Regis Philbin's office, and I can confirm he acts the same on and off the air) and with a film production company out of Los Angeles. I also worked at Yankee Stadium which was close by, managing the Sidewalk Cafe (I went to the home games, but never saw a single play in that time, too busy working). I also played Rugby and was the team's fundraising lead my junior year and President during my senior year. ", "Summary Jessica draws on a background of more than 10 years of professional experience practicing communications and media relations in New Zealand, Australia and the United Kingdom. She has worked for a number of large corporations and public relations agencies, including IBM, IAG, Ernst & Young and Citigate Dewe Rogerson. \n \nJessica's most recent experience is four years with IBM. During this time she managed the external relations for IBM Global Business Services in Australia and New Zealand. This included securing and preparing for high visibility media, analyst and speaking engagements. She also worked closely with the managing director to develop her executive profile and brand affinity in New Zealand. This resulted in her being featured in a number of interviews with print, electronic and broadcast media. \n \nJessica's experience includes developing and driving thought leadership PR campaigns to address specific challenges with external audiences. One such campaign was recognised by the Public Relations Institute of Australia (PRIA) receiving a best in category award for B2B marketing. Another campaign was recognised by the New Zealand Marketing Association (NZMA) receiving a finalist award for B2B marketing. \n \nJessica’s experience includes business and technology, corporate, financial and professional services sectors. \n \nJessica holds a Graduate Diploma in Business Studies (Communication Management) from Massey University. \n \nSpecialities: Corporate Communications, Public Relations, Executive Communications, Thought Leadership, Executive Profiling Summary Jessica draws on a background of more than 10 years of professional experience practicing communications and media relations in New Zealand, Australia and the United Kingdom. She has worked for a number of large corporations and public relations agencies, including IBM, IAG, Ernst & Young and Citigate Dewe Rogerson. \n \nJessica's most recent experience is four years with IBM. During this time she managed the external relations for IBM Global Business Services in Australia and New Zealand. This included securing and preparing for high visibility media, analyst and speaking engagements. She also worked closely with the managing director to develop her executive profile and brand affinity in New Zealand. This resulted in her being featured in a number of interviews with print, electronic and broadcast media. \n \nJessica's experience includes developing and driving thought leadership PR campaigns to address specific challenges with external audiences. One such campaign was recognised by the Public Relations Institute of Australia (PRIA) receiving a best in category award for B2B marketing. Another campaign was recognised by the New Zealand Marketing Association (NZMA) receiving a finalist award for B2B marketing. \n \nJessica’s experience includes business and technology, corporate, financial and professional services sectors. \n \nJessica holds a Graduate Diploma in Business Studies (Communication Management) from Massey University. \n \nSpecialities: Corporate Communications, Public Relations, Executive Communications, Thought Leadership, Executive Profiling Jessica draws on a background of more than 10 years of professional experience practicing communications and media relations in New Zealand, Australia and the United Kingdom. She has worked for a number of large corporations and public relations agencies, including IBM, IAG, Ernst & Young and Citigate Dewe Rogerson. \n \nJessica's most recent experience is four years with IBM. During this time she managed the external relations for IBM Global Business Services in Australia and New Zealand. This included securing and preparing for high visibility media, analyst and speaking engagements. She also worked closely with the managing director to develop her executive profile and brand affinity in New Zealand. This resulted in her being featured in a number of interviews with print, electronic and broadcast media. \n \nJessica's experience includes developing and driving thought leadership PR campaigns to address specific challenges with external audiences. One such campaign was recognised by the Public Relations Institute of Australia (PRIA) receiving a best in category award for B2B marketing. Another campaign was recognised by the New Zealand Marketing Association (NZMA) receiving a finalist award for B2B marketing. \n \nJessica’s experience includes business and technology, corporate, financial and professional services sectors. \n \nJessica holds a Graduate Diploma in Business Studies (Communication Management) from Massey University. \n \nSpecialities: Corporate Communications, Public Relations, Executive Communications, Thought Leadership, Executive Profiling Jessica draws on a background of more than 10 years of professional experience practicing communications and media relations in New Zealand, Australia and the United Kingdom. She has worked for a number of large corporations and public relations agencies, including IBM, IAG, Ernst & Young and Citigate Dewe Rogerson. \n \nJessica's most recent experience is four years with IBM. During this time she managed the external relations for IBM Global Business Services in Australia and New Zealand. This included securing and preparing for high visibility media, analyst and speaking engagements. She also worked closely with the managing director to develop her executive profile and brand affinity in New Zealand. This resulted in her being featured in a number of interviews with print, electronic and broadcast media. \n \nJessica's experience includes developing and driving thought leadership PR campaigns to address specific challenges with external audiences. One such campaign was recognised by the Public Relations Institute of Australia (PRIA) receiving a best in category award for B2B marketing. Another campaign was recognised by the New Zealand Marketing Association (NZMA) receiving a finalist award for B2B marketing. \n \nJessica’s experience includes business and technology, corporate, financial and professional services sectors. \n \nJessica holds a Graduate Diploma in Business Studies (Communication Management) from Massey University. \n \nSpecialities: Corporate Communications, Public Relations, Executive Communications, Thought Leadership, Executive Profiling Experience Director Affinity PR New Zealand May 2014  – Present (1 year 4 months) Auckland, New Zealand Affinity PR New Zealand is an Auckland-based corporate communications company, specialising in strategic executive communications and thought leadership PR.  \n \nAt Affinity PR, we develop and execute thought leadership PR campaigns that intrigue, challenge and inspire people to become familiar with your company and to create brand affinity with your executives. We establish your executives as expert resources, allowing them to shape the conversation, and influence senior decision makers early in the buying journey. We allow your audience to get to know your executives so your company can begin the process of becoming a social business.  \n \nAffinity PR provides every client with a tailored thought leadership PR strategy that includes media opportunities and speaking engagements to showcase expertise and capabilities. We focus on media, establishing your executives as effective and reliable media sources for expert interviews tied to industry issues and advice. We also consider authored article placements for your executives. In addition, we also consider an expert social media campaign. We also focus on speaking engagements. Speaking engagements are valuable for reaching your business customers and for the overall identity of your company. We support your speaking engagements with speechwriting, on-site media exposure, and more.  \n \nFor more information, email: Jessica.Griffin@affinitypr.co.nz or phone: +6421 2214 822. Senior Communications Specialist, External Relations, Australia and New Zealand IBM September 2010  –  October 2012  (2 years 2 months) Auckland, New Zealand Jessica managed the external relations for IBM Global Business Services in Australia and New Zealand. \n \nShe specialised in developing and implementing communications programmes for client contract announcements and case studies. She worked on a number of high profile contract announcements such as the IBM and NBN Co Limited contract, and the IBM and National E-Health Transition Authority contract, both in Australia. \n \nShe also specialised in developing and implementing integrated thought leadership PR campaigns that provoked genuine discussion, debate and action. She worked on a high profile thought leadership campaign such as the IBM Commuter Pain Study in Australia and New Zealand, developing thought leadership properties that were used for multiple purposes, from roundtable debates to digital marketing campaigns, and from political engagement to media relations. This campaign was recognised by the Public Relations Institute of Australia (PRIA), receiving a ‘best in category award’ for B2B marketing. Communications Specialist, New Zealand IBM April 2008  –  September 2010  (2 years 6 months) Auckland, New Zealand Jessica managed the internal and external relations for IBM Global Business Services, Business Partners, Sales, Marketing, as well as the Midmarket and Public Sector in New Zealand. She also worked closely with the managing director to develop her executive profile and brand affinity in New Zealand. This resulted in her being featured in a number of interviews with print, electronic and broadcast media. \n \nShe specialised in developing and implementing integrated thought leadership PR campaigns that provoked genuine discussion, debate and action. She worked on a number of high profile thought leadership campaigns such as the IBM Smarter Cities agenda in New Zealand. This resulted in a number of high profile interviews with print, electronic and broadcast media. As well as the IBM Business Insight campaign in New Zealand, which was recognised by the New Zealand Marketing Association (NZMA), receiving a ‘finalist award’ for B2B marketing. Communications and Media Consultant IAG New Zealand January 2006  –  March 2008  (2 years 3 months) Auckland, New Zealand Managed the internal and external relations for NZI, as well as strategic development and execution of corporate communications for IAG New Zealand. She also helped to develop the executive profile of the Head of NZI in New Zealand, as well as the CEO of IAG New Zealand, through media opportunities and speaking engagements. Communications Executive Ernst & Young April 2005  –  November 2005  (8 months) London, United Kingdom Managed the internal relations for Business Risk Services in the UK.  \nJessica also helped to develop an internal profile of the managing partner for Business Risk Services in the UK. Communications and Media Advisor IAG New Zealand August 2003  –  December 2004  (1 year 5 months) Auckland, New Zealand Strategic development and execution of internal and external relations programmes for IAG New Zealand. Jessica also helped to develop the profile of the CEO of IAG New Zealand through media opportunities and speaking engagements. Public Relations Executive Citigate Dewe Rogerson August 2002  –  June 2003  (11 months) London, United Kingdom Execution of public relations, financial and corporate communications programmes in the UK. Marketing Assistant GfK Martin Hamblin January 2002  –  August 2002  (8 months) London, United Kingdom Execution of marketing programmes in the UK. Director Affinity PR New Zealand May 2014  – Present (1 year 4 months) Auckland, New Zealand Affinity PR New Zealand is an Auckland-based corporate communications company, specialising in strategic executive communications and thought leadership PR.  \n \nAt Affinity PR, we develop and execute thought leadership PR campaigns that intrigue, challenge and inspire people to become familiar with your company and to create brand affinity with your executives. We establish your executives as expert resources, allowing them to shape the conversation, and influence senior decision makers early in the buying journey. We allow your audience to get to know your executives so your company can begin the process of becoming a social business.  \n \nAffinity PR provides every client with a tailored thought leadership PR strategy that includes media opportunities and speaking engagements to showcase expertise and capabilities. We focus on media, establishing your executives as effective and reliable media sources for expert interviews tied to industry issues and advice. We also consider authored article placements for your executives. In addition, we also consider an expert social media campaign. We also focus on speaking engagements. Speaking engagements are valuable for reaching your business customers and for the overall identity of your company. We support your speaking engagements with speechwriting, on-site media exposure, and more.  \n \nFor more information, email: Jessica.Griffin@affinitypr.co.nz or phone: +6421 2214 822. Director Affinity PR New Zealand May 2014  – Present (1 year 4 months) Auckland, New Zealand Affinity PR New Zealand is an Auckland-based corporate communications company, specialising in strategic executive communications and thought leadership PR.  \n \nAt Affinity PR, we develop and execute thought leadership PR campaigns that intrigue, challenge and inspire people to become familiar with your company and to create brand affinity with your executives. We establish your executives as expert resources, allowing them to shape the conversation, and influence senior decision makers early in the buying journey. We allow your audience to get to know your executives so your company can begin the process of becoming a social business.  \n \nAffinity PR provides every client with a tailored thought leadership PR strategy that includes media opportunities and speaking engagements to showcase expertise and capabilities. We focus on media, establishing your executives as effective and reliable media sources for expert interviews tied to industry issues and advice. We also consider authored article placements for your executives. In addition, we also consider an expert social media campaign. We also focus on speaking engagements. Speaking engagements are valuable for reaching your business customers and for the overall identity of your company. We support your speaking engagements with speechwriting, on-site media exposure, and more.  \n \nFor more information, email: Jessica.Griffin@affinitypr.co.nz or phone: +6421 2214 822. Senior Communications Specialist, External Relations, Australia and New Zealand IBM September 2010  –  October 2012  (2 years 2 months) Auckland, New Zealand Jessica managed the external relations for IBM Global Business Services in Australia and New Zealand. \n \nShe specialised in developing and implementing communications programmes for client contract announcements and case studies. She worked on a number of high profile contract announcements such as the IBM and NBN Co Limited contract, and the IBM and National E-Health Transition Authority contract, both in Australia. \n \nShe also specialised in developing and implementing integrated thought leadership PR campaigns that provoked genuine discussion, debate and action. She worked on a high profile thought leadership campaign such as the IBM Commuter Pain Study in Australia and New Zealand, developing thought leadership properties that were used for multiple purposes, from roundtable debates to digital marketing campaigns, and from political engagement to media relations. This campaign was recognised by the Public Relations Institute of Australia (PRIA), receiving a ‘best in category award’ for B2B marketing. Senior Communications Specialist, External Relations, Australia and New Zealand IBM September 2010  –  October 2012  (2 years 2 months) Auckland, New Zealand Jessica managed the external relations for IBM Global Business Services in Australia and New Zealand. \n \nShe specialised in developing and implementing communications programmes for client contract announcements and case studies. She worked on a number of high profile contract announcements such as the IBM and NBN Co Limited contract, and the IBM and National E-Health Transition Authority contract, both in Australia. \n \nShe also specialised in developing and implementing integrated thought leadership PR campaigns that provoked genuine discussion, debate and action. She worked on a high profile thought leadership campaign such as the IBM Commuter Pain Study in Australia and New Zealand, developing thought leadership properties that were used for multiple purposes, from roundtable debates to digital marketing campaigns, and from political engagement to media relations. This campaign was recognised by the Public Relations Institute of Australia (PRIA), receiving a ‘best in category award’ for B2B marketing. Communications Specialist, New Zealand IBM April 2008  –  September 2010  (2 years 6 months) Auckland, New Zealand Jessica managed the internal and external relations for IBM Global Business Services, Business Partners, Sales, Marketing, as well as the Midmarket and Public Sector in New Zealand. She also worked closely with the managing director to develop her executive profile and brand affinity in New Zealand. This resulted in her being featured in a number of interviews with print, electronic and broadcast media. \n \nShe specialised in developing and implementing integrated thought leadership PR campaigns that provoked genuine discussion, debate and action. She worked on a number of high profile thought leadership campaigns such as the IBM Smarter Cities agenda in New Zealand. This resulted in a number of high profile interviews with print, electronic and broadcast media. As well as the IBM Business Insight campaign in New Zealand, which was recognised by the New Zealand Marketing Association (NZMA), receiving a ‘finalist award’ for B2B marketing. Communications Specialist, New Zealand IBM April 2008  –  September 2010  (2 years 6 months) Auckland, New Zealand Jessica managed the internal and external relations for IBM Global Business Services, Business Partners, Sales, Marketing, as well as the Midmarket and Public Sector in New Zealand. She also worked closely with the managing director to develop her executive profile and brand affinity in New Zealand. This resulted in her being featured in a number of interviews with print, electronic and broadcast media. \n \nShe specialised in developing and implementing integrated thought leadership PR campaigns that provoked genuine discussion, debate and action. She worked on a number of high profile thought leadership campaigns such as the IBM Smarter Cities agenda in New Zealand. This resulted in a number of high profile interviews with print, electronic and broadcast media. As well as the IBM Business Insight campaign in New Zealand, which was recognised by the New Zealand Marketing Association (NZMA), receiving a ‘finalist award’ for B2B marketing. Communications and Media Consultant IAG New Zealand January 2006  –  March 2008  (2 years 3 months) Auckland, New Zealand Managed the internal and external relations for NZI, as well as strategic development and execution of corporate communications for IAG New Zealand. She also helped to develop the executive profile of the Head of NZI in New Zealand, as well as the CEO of IAG New Zealand, through media opportunities and speaking engagements. Communications and Media Consultant IAG New Zealand January 2006  –  March 2008  (2 years 3 months) Auckland, New Zealand Managed the internal and external relations for NZI, as well as strategic development and execution of corporate communications for IAG New Zealand. She also helped to develop the executive profile of the Head of NZI in New Zealand, as well as the CEO of IAG New Zealand, through media opportunities and speaking engagements. Communications Executive Ernst & Young April 2005  –  November 2005  (8 months) London, United Kingdom Managed the internal relations for Business Risk Services in the UK.  \nJessica also helped to develop an internal profile of the managing partner for Business Risk Services in the UK. Communications Executive Ernst & Young April 2005  –  November 2005  (8 months) London, United Kingdom Managed the internal relations for Business Risk Services in the UK.  \nJessica also helped to develop an internal profile of the managing partner for Business Risk Services in the UK. Communications and Media Advisor IAG New Zealand August 2003  –  December 2004  (1 year 5 months) Auckland, New Zealand Strategic development and execution of internal and external relations programmes for IAG New Zealand. Jessica also helped to develop the profile of the CEO of IAG New Zealand through media opportunities and speaking engagements. Communications and Media Advisor IAG New Zealand August 2003  –  December 2004  (1 year 5 months) Auckland, New Zealand Strategic development and execution of internal and external relations programmes for IAG New Zealand. Jessica also helped to develop the profile of the CEO of IAG New Zealand through media opportunities and speaking engagements. Public Relations Executive Citigate Dewe Rogerson August 2002  –  June 2003  (11 months) London, United Kingdom Execution of public relations, financial and corporate communications programmes in the UK. Public Relations Executive Citigate Dewe Rogerson August 2002  –  June 2003  (11 months) London, United Kingdom Execution of public relations, financial and corporate communications programmes in the UK. Marketing Assistant GfK Martin Hamblin January 2002  –  August 2002  (8 months) London, United Kingdom Execution of marketing programmes in the UK. Marketing Assistant GfK Martin Hamblin January 2002  –  August 2002  (8 months) London, United Kingdom Execution of marketing programmes in the UK. Languages German Elementary proficiency German Elementary proficiency German Elementary proficiency Elementary proficiency Skills Corporate Communications Media Relations Internal Communications Public Relations Marketing Communications Speech Writing Change Management Strategic Communications Communication Training Business-to-Business... Management Crisis Management Brand Management Digital Media & PR Editing Employee Engagement Employee Communications Event Management Thought Leadership Crisis Communications Business Strategy See 6+     See less Skills  Corporate Communications Media Relations Internal Communications Public Relations Marketing Communications Speech Writing Change Management Strategic Communications Communication Training Business-to-Business... Management Crisis Management Brand Management Digital Media & PR Editing Employee Engagement Employee Communications Event Management Thought Leadership Crisis Communications Business Strategy See 6+     See less Corporate Communications Media Relations Internal Communications Public Relations Marketing Communications Speech Writing Change Management Strategic Communications Communication Training Business-to-Business... Management Crisis Management Brand Management Digital Media & PR Editing Employee Engagement Employee Communications Event Management Thought Leadership Crisis Communications Business Strategy See 6+     See less Corporate Communications Media Relations Internal Communications Public Relations Marketing Communications Speech Writing Change Management Strategic Communications Communication Training Business-to-Business... Management Crisis Management Brand Management Digital Media & PR Editing Employee Engagement Employee Communications Event Management Thought Leadership Crisis Communications Business Strategy See 6+     See less Education Massey University Graduate Diploma in Business,  Communication Management Communications Management Massey University Graduate Diploma in Business,  Communication Management Communications Management Massey University Graduate Diploma in Business,  Communication Management Communications Management Massey University Graduate Diploma in Business,  Communication Management Communications Management Honors & Awards ‘best in category award’ for B2B marketing Public Relations Institute of Australia (PRIA) ‘finalist award’ for B2B marketing New Zealand Marketing Association (NZMA) ‘best in category award’ for B2B marketing Public Relations Institute of Australia (PRIA) ‘best in category award’ for B2B marketing Public Relations Institute of Australia (PRIA) ‘best in category award’ for B2B marketing Public Relations Institute of Australia (PRIA) ‘finalist award’ for B2B marketing New Zealand Marketing Association (NZMA) ‘finalist award’ for B2B marketing New Zealand Marketing Association (NZMA) ‘finalist award’ for B2B marketing New Zealand Marketing Association (NZMA) ", "Skills Skills     Honors & Awards ", "Skills Communication Training Media Relations Analyst Relations Internal Communications Corporate Communications Social Media Digital Strategy Content Management Strategic Communications Crisis Management Messaging Public Relations Corporate Social... Public Speaking Strategy B2B Marketing Business Alliances Cloud Computing Thought Leadership Social Media Marketing Digital Marketing Marketing Communications Integrated Marketing Marketing Management Marketing Strategy Business Strategy Crisis Communications Strategic Planning Product Marketing Content Development Web Content Management Communications Planning Speech Writing Demand Generation Program Management Content Strategy See 21+     See less Skills  Communication Training Media Relations Analyst Relations Internal Communications Corporate Communications Social Media Digital Strategy Content Management Strategic Communications Crisis Management Messaging Public Relations Corporate Social... Public Speaking Strategy B2B Marketing Business Alliances Cloud Computing Thought Leadership Social Media Marketing Digital Marketing Marketing Communications Integrated Marketing Marketing Management Marketing Strategy Business Strategy Crisis Communications Strategic Planning Product Marketing Content Development Web Content Management Communications Planning Speech Writing Demand Generation Program Management Content Strategy See 21+     See less Communication Training Media Relations Analyst Relations Internal Communications Corporate Communications Social Media Digital Strategy Content Management Strategic Communications Crisis Management Messaging Public Relations Corporate Social... Public Speaking Strategy B2B Marketing Business Alliances Cloud Computing Thought Leadership Social Media Marketing Digital Marketing Marketing Communications Integrated Marketing Marketing Management Marketing Strategy Business Strategy Crisis Communications Strategic Planning Product Marketing Content Development Web Content Management Communications Planning Speech Writing Demand Generation Program Management Content Strategy See 21+     See less Communication Training Media Relations Analyst Relations Internal Communications Corporate Communications Social Media Digital Strategy Content Management Strategic Communications Crisis Management Messaging Public Relations Corporate Social... Public Speaking Strategy B2B Marketing Business Alliances Cloud Computing Thought Leadership Social Media Marketing Digital Marketing Marketing Communications Integrated Marketing Marketing Management Marketing Strategy Business Strategy Crisis Communications Strategic Planning Product Marketing Content Development Web Content Management Communications Planning Speech Writing Demand Generation Program Management Content Strategy See 21+     See less ", "Experience Vice President, External Relations IBM Vice President, External Relations IBM Vice President, External Relations IBM ", "Experience Manager, IBMer Engagement, Corporate Communications IBM March 2014  – Present (1 year 6 months) Boise, Idaho and Armonk, New York Engage IBMers around the IBM Strategy  \n-- Create and implement resources, tools and techniques to help IBMers understand the IBM strategy and rethink their work as it relates to the strategy \n-- Connect IBMers to the IBM Strategy through “Made with IBM;” put IBM Strategy into context for IBMers to help them contribute \n-- Drive communication, engagement and reinforcement of the IBM Strategy; create and teach techniques for innovation for IBMers – build belief, drive action, confidence and advocacy \n--Partner with HR on multiple annual and ongoing initiatives and programs including the IBMer Engagement Survey, the annual Deeper Insight virtual conference for new hires and senior leadership engagement \n--Serve as strategic advisor to HR leaders and their teams on a range of programs and initiatives \n-- Drive workforce transformation projects while working to protect the IBM brand and create opportunities for IBMer engagement Communications Manager, IBM Smarter Cities & IBM Research IBM October 2003  –  March 2014  (10 years 6 months) San Francisco Bay Area and Boise, Idaho Communications Manager, Smarter Cities/Sustainable Resources \nWater, Energy, Buildings, Weather, Transportation \n•\tLead external communications across IBM Sustainable Resources initiatives including water, energy, buildings, weather and transportation as part of IBM’s corporate Smarter Planet/Smarter Cities marketing and communications team \n•\tIncorporate social media to seed messages with specific influencers, identify new influencers and broaden the scope of overall communications efforts \n•\tProvide strategic counsel and guidance to key executives  \n•\tPlan and execute announcements and events worldwide through an industries lens focused on key IBM priorities Cloud, Mobile, Big Data Analytics, Social and Watson; team with colleagues across the company to identify and create opportunities including op eds and events \n•\tCreate and grow relationships with top-tier reporters and other influencers \n•\tManage client references, proactively seeking opportunities for announcements with clients  \n \nCommunications Manager, IBM Research - Almaden \n•\tOversee internal and external relations for IBM’s second largest Research lab.  \n•\tWork closely with marketing and communications leadership to ensure alignment with overall strategy, messaging and Smarter Planet themes \n•\tPlan and execute announcements and events locally and worldwide; team with colleagues across the company to identify and create opportunities including op eds and events \n•\tTrusted advisor to lab vice president and executives for strategic counsel, guidance, executive communications and crisis communications \n•\tCreate and grow relationships with top-tier reporters and other influencers \n•\tManage client references, identify opportunities for announcements with clients and partners \n•\tManage team of internal and external communications specialists \n•\tIncorporate social media to seed messages with specific influencers, identify new influencers and broaden the scope of overall communications efforts Director Magnet Communications 2000  –  2003  (3 years) San Francisco Bay Area Magnet Communications 2/2000 – 9/2003 \n \nTechnology Practice Account Director \n•\tPrincipal contact for key technology accounts; responsible for all aspects of program development and implementation; contribute to account and agency growth and expansion; manage client budgets and billings \n•\tDevelop strategic positioning and messaging: perform market analysis, serve as senior counselor  \n•\tSupervise and grow multiple accounts in biotech and enterprise software: staff and mentor teams, manage expectations, and develop PR plans and budgets  \n•\tContribute to agency growth by generating new clients and renewing annual contracts, participating in management meetings, forecasting budgets, supervising staff and providing performance evaluations, and assisting in the selection of new candidates \n \nTechnology Practice Account Supervisor \n•\tCreate goal-oriented PR programs that build awareness, generate leads and elevate client position in market, obtain targeted press coverage, influence key analysts, secure key customer references and leverage adjunct marketing programs \n•\tOversee development of written materials including bylined articles, press releases, technical papers, marketing collateral and executive speeches \n•\tPrepare executives for media interviews; provide strategic responses to current news and relevant trends, ensure key messages delivered  \n•\tManage and mentor account teams, manage budget, billing and expenses, produce activity reports \n \nTechnology Practice Account Manager \n•\tDay-to-day liaison with key technology clients \n•\tCultivate strong media, analyst and influencer relationships \n•\tDevelop and pitch press releases, feature stories and op eds; plan and execute new product and company press and analyst tours and influencer events Manager, IBMer Engagement, Corporate Communications IBM March 2014  – Present (1 year 6 months) Boise, Idaho and Armonk, New York Engage IBMers around the IBM Strategy  \n-- Create and implement resources, tools and techniques to help IBMers understand the IBM strategy and rethink their work as it relates to the strategy \n-- Connect IBMers to the IBM Strategy through “Made with IBM;” put IBM Strategy into context for IBMers to help them contribute \n-- Drive communication, engagement and reinforcement of the IBM Strategy; create and teach techniques for innovation for IBMers – build belief, drive action, confidence and advocacy \n--Partner with HR on multiple annual and ongoing initiatives and programs including the IBMer Engagement Survey, the annual Deeper Insight virtual conference for new hires and senior leadership engagement \n--Serve as strategic advisor to HR leaders and their teams on a range of programs and initiatives \n-- Drive workforce transformation projects while working to protect the IBM brand and create opportunities for IBMer engagement Manager, IBMer Engagement, Corporate Communications IBM March 2014  – Present (1 year 6 months) Boise, Idaho and Armonk, New York Engage IBMers around the IBM Strategy  \n-- Create and implement resources, tools and techniques to help IBMers understand the IBM strategy and rethink their work as it relates to the strategy \n-- Connect IBMers to the IBM Strategy through “Made with IBM;” put IBM Strategy into context for IBMers to help them contribute \n-- Drive communication, engagement and reinforcement of the IBM Strategy; create and teach techniques for innovation for IBMers – build belief, drive action, confidence and advocacy \n--Partner with HR on multiple annual and ongoing initiatives and programs including the IBMer Engagement Survey, the annual Deeper Insight virtual conference for new hires and senior leadership engagement \n--Serve as strategic advisor to HR leaders and their teams on a range of programs and initiatives \n-- Drive workforce transformation projects while working to protect the IBM brand and create opportunities for IBMer engagement Communications Manager, IBM Smarter Cities & IBM Research IBM October 2003  –  March 2014  (10 years 6 months) San Francisco Bay Area and Boise, Idaho Communications Manager, Smarter Cities/Sustainable Resources \nWater, Energy, Buildings, Weather, Transportation \n•\tLead external communications across IBM Sustainable Resources initiatives including water, energy, buildings, weather and transportation as part of IBM’s corporate Smarter Planet/Smarter Cities marketing and communications team \n•\tIncorporate social media to seed messages with specific influencers, identify new influencers and broaden the scope of overall communications efforts \n•\tProvide strategic counsel and guidance to key executives  \n•\tPlan and execute announcements and events worldwide through an industries lens focused on key IBM priorities Cloud, Mobile, Big Data Analytics, Social and Watson; team with colleagues across the company to identify and create opportunities including op eds and events \n•\tCreate and grow relationships with top-tier reporters and other influencers \n•\tManage client references, proactively seeking opportunities for announcements with clients  \n \nCommunications Manager, IBM Research - Almaden \n•\tOversee internal and external relations for IBM’s second largest Research lab.  \n•\tWork closely with marketing and communications leadership to ensure alignment with overall strategy, messaging and Smarter Planet themes \n•\tPlan and execute announcements and events locally and worldwide; team with colleagues across the company to identify and create opportunities including op eds and events \n•\tTrusted advisor to lab vice president and executives for strategic counsel, guidance, executive communications and crisis communications \n•\tCreate and grow relationships with top-tier reporters and other influencers \n•\tManage client references, identify opportunities for announcements with clients and partners \n•\tManage team of internal and external communications specialists \n•\tIncorporate social media to seed messages with specific influencers, identify new influencers and broaden the scope of overall communications efforts Communications Manager, IBM Smarter Cities & IBM Research IBM October 2003  –  March 2014  (10 years 6 months) San Francisco Bay Area and Boise, Idaho Communications Manager, Smarter Cities/Sustainable Resources \nWater, Energy, Buildings, Weather, Transportation \n•\tLead external communications across IBM Sustainable Resources initiatives including water, energy, buildings, weather and transportation as part of IBM’s corporate Smarter Planet/Smarter Cities marketing and communications team \n•\tIncorporate social media to seed messages with specific influencers, identify new influencers and broaden the scope of overall communications efforts \n•\tProvide strategic counsel and guidance to key executives  \n•\tPlan and execute announcements and events worldwide through an industries lens focused on key IBM priorities Cloud, Mobile, Big Data Analytics, Social and Watson; team with colleagues across the company to identify and create opportunities including op eds and events \n•\tCreate and grow relationships with top-tier reporters and other influencers \n•\tManage client references, proactively seeking opportunities for announcements with clients  \n \nCommunications Manager, IBM Research - Almaden \n•\tOversee internal and external relations for IBM’s second largest Research lab.  \n•\tWork closely with marketing and communications leadership to ensure alignment with overall strategy, messaging and Smarter Planet themes \n•\tPlan and execute announcements and events locally and worldwide; team with colleagues across the company to identify and create opportunities including op eds and events \n•\tTrusted advisor to lab vice president and executives for strategic counsel, guidance, executive communications and crisis communications \n•\tCreate and grow relationships with top-tier reporters and other influencers \n•\tManage client references, identify opportunities for announcements with clients and partners \n•\tManage team of internal and external communications specialists \n•\tIncorporate social media to seed messages with specific influencers, identify new influencers and broaden the scope of overall communications efforts Director Magnet Communications 2000  –  2003  (3 years) San Francisco Bay Area Magnet Communications 2/2000 – 9/2003 \n \nTechnology Practice Account Director \n•\tPrincipal contact for key technology accounts; responsible for all aspects of program development and implementation; contribute to account and agency growth and expansion; manage client budgets and billings \n•\tDevelop strategic positioning and messaging: perform market analysis, serve as senior counselor  \n•\tSupervise and grow multiple accounts in biotech and enterprise software: staff and mentor teams, manage expectations, and develop PR plans and budgets  \n•\tContribute to agency growth by generating new clients and renewing annual contracts, participating in management meetings, forecasting budgets, supervising staff and providing performance evaluations, and assisting in the selection of new candidates \n \nTechnology Practice Account Supervisor \n•\tCreate goal-oriented PR programs that build awareness, generate leads and elevate client position in market, obtain targeted press coverage, influence key analysts, secure key customer references and leverage adjunct marketing programs \n•\tOversee development of written materials including bylined articles, press releases, technical papers, marketing collateral and executive speeches \n•\tPrepare executives for media interviews; provide strategic responses to current news and relevant trends, ensure key messages delivered  \n•\tManage and mentor account teams, manage budget, billing and expenses, produce activity reports \n \nTechnology Practice Account Manager \n•\tDay-to-day liaison with key technology clients \n•\tCultivate strong media, analyst and influencer relationships \n•\tDevelop and pitch press releases, feature stories and op eds; plan and execute new product and company press and analyst tours and influencer events Director Magnet Communications 2000  –  2003  (3 years) San Francisco Bay Area Magnet Communications 2/2000 – 9/2003 \n \nTechnology Practice Account Director \n•\tPrincipal contact for key technology accounts; responsible for all aspects of program development and implementation; contribute to account and agency growth and expansion; manage client budgets and billings \n•\tDevelop strategic positioning and messaging: perform market analysis, serve as senior counselor  \n•\tSupervise and grow multiple accounts in biotech and enterprise software: staff and mentor teams, manage expectations, and develop PR plans and budgets  \n•\tContribute to agency growth by generating new clients and renewing annual contracts, participating in management meetings, forecasting budgets, supervising staff and providing performance evaluations, and assisting in the selection of new candidates \n \nTechnology Practice Account Supervisor \n•\tCreate goal-oriented PR programs that build awareness, generate leads and elevate client position in market, obtain targeted press coverage, influence key analysts, secure key customer references and leverage adjunct marketing programs \n•\tOversee development of written materials including bylined articles, press releases, technical papers, marketing collateral and executive speeches \n•\tPrepare executives for media interviews; provide strategic responses to current news and relevant trends, ensure key messages delivered  \n•\tManage and mentor account teams, manage budget, billing and expenses, produce activity reports \n \nTechnology Practice Account Manager \n•\tDay-to-day liaison with key technology clients \n•\tCultivate strong media, analyst and influencer relationships \n•\tDevelop and pitch press releases, feature stories and op eds; plan and execute new product and company press and analyst tours and influencer events Skills public relations water management Public Relations Corporate Communications Media Relations Internal Communications Strategic Communications Thought Leadership Messaging Content Development Digital Media Communication Training Strategic Partnerships Social Networking Crisis Communications Digital Marketing Analyst Relations Digital Strategy Product Marketing Press Releases Marketing Communications Communications Planning Integrated Marketing Corporate Social... Content Strategy Strategy Speech Writing Social Media Editing Leadership See 15+     See less Skills  public relations water management Public Relations Corporate Communications Media Relations Internal Communications Strategic Communications Thought Leadership Messaging Content Development Digital Media Communication Training Strategic Partnerships Social Networking Crisis Communications Digital Marketing Analyst Relations Digital Strategy Product Marketing Press Releases Marketing Communications Communications Planning Integrated Marketing Corporate Social... Content Strategy Strategy Speech Writing Social Media Editing Leadership See 15+     See less public relations water management Public Relations Corporate Communications Media Relations Internal Communications Strategic Communications Thought Leadership Messaging Content Development Digital Media Communication Training Strategic Partnerships Social Networking Crisis Communications Digital Marketing Analyst Relations Digital Strategy Product Marketing Press Releases Marketing Communications Communications Planning Integrated Marketing Corporate Social... Content Strategy Strategy Speech Writing Social Media Editing Leadership See 15+     See less public relations water management Public Relations Corporate Communications Media Relations Internal Communications Strategic Communications Thought Leadership Messaging Content Development Digital Media Communication Training Strategic Partnerships Social Networking Crisis Communications Digital Marketing Analyst Relations Digital Strategy Product Marketing Press Releases Marketing Communications Communications Planning Integrated Marketing Corporate Social... Content Strategy Strategy Speech Writing Social Media Editing Leadership See 15+     See less Education University of California, Davis BA,  English 1989  – 1993 Berkeley High School 1984  – 1988 University of California, Davis BA,  English 1989  – 1993 University of California, Davis BA,  English 1989  – 1993 University of California, Davis BA,  English 1989  – 1993 Berkeley High School 1984  – 1988 Berkeley High School 1984  – 1988 Berkeley High School 1984  – 1988 ", "Skills Public Relations Strategic Communications Digital Media Media Relations Corporate Communications Social Media Digital Strategy Messaging Content Strategy Crisis Communications Strategy Journalism Message Development Press Releases Communications Strategy Skills  Public Relations Strategic Communications Digital Media Media Relations Corporate Communications Social Media Digital Strategy Messaging Content Strategy Crisis Communications Strategy Journalism Message Development Press Releases Communications Strategy Public Relations Strategic Communications Digital Media Media Relations Corporate Communications Social Media Digital Strategy Messaging Content Strategy Crisis Communications Strategy Journalism Message Development Press Releases Communications Strategy Public Relations Strategic Communications Digital Media Media Relations Corporate Communications Social Media Digital Strategy Messaging Content Strategy Crisis Communications Strategy Journalism Message Development Press Releases Communications Strategy ", "Languages Inglese Francese Inglese Francese Inglese Francese Skills Corporate Communications Marketing Communications Public Relations Media Relations Internal Communications Strategic Communications Event Management Social Networking Press Releases New Media B2B Marketing Program Management Online Advertising Digital Strategy Crisis Communications Management Budgets Blogging B2B Marketing Competitive Analysis Digital Marketing Sales International Relations Messaging Integrated Marketing Copywriting Marketing Management Social Media Online Marketing Direct Marketing Market Research CRM Digital Media Product Marketing Email Marketing Strategy Social Media Marketing Lead Generation Web Content Management Web 2.0 Marketing Strategy Pubbliche relazioni Marketing communication Relazioni con i media Comunicazioni aziendali Comunicazioni interne Social media See 33+     See less Skills  Corporate Communications Marketing Communications Public Relations Media Relations Internal Communications Strategic Communications Event Management Social Networking Press Releases New Media B2B Marketing Program Management Online Advertising Digital Strategy Crisis Communications Management Budgets Blogging B2B Marketing Competitive Analysis Digital Marketing Sales International Relations Messaging Integrated Marketing Copywriting Marketing Management Social Media Online Marketing Direct Marketing Market Research CRM Digital Media Product Marketing Email Marketing Strategy Social Media Marketing Lead Generation Web Content Management Web 2.0 Marketing Strategy Pubbliche relazioni Marketing communication Relazioni con i media Comunicazioni aziendali Comunicazioni interne Social media See 33+     See less Corporate Communications Marketing Communications Public Relations Media Relations Internal Communications Strategic Communications Event Management Social Networking Press Releases New Media B2B Marketing Program Management Online Advertising Digital Strategy Crisis Communications Management Budgets Blogging B2B Marketing Competitive Analysis Digital Marketing Sales International Relations Messaging Integrated Marketing Copywriting Marketing Management Social Media Online Marketing Direct Marketing Market Research CRM Digital Media Product Marketing Email Marketing Strategy Social Media Marketing Lead Generation Web Content Management Web 2.0 Marketing Strategy Pubbliche relazioni Marketing communication Relazioni con i media Comunicazioni aziendali Comunicazioni interne Social media See 33+     See less Corporate Communications Marketing Communications Public Relations Media Relations Internal Communications Strategic Communications Event Management Social Networking Press Releases New Media B2B Marketing Program Management Online Advertising Digital Strategy Crisis Communications Management Budgets Blogging B2B Marketing Competitive Analysis Digital Marketing Sales International Relations Messaging Integrated Marketing Copywriting Marketing Management Social Media Online Marketing Direct Marketing Market Research CRM Digital Media Product Marketing Email Marketing Strategy Social Media Marketing Lead Generation Web Content Management Web 2.0 Marketing Strategy Pubbliche relazioni Marketing communication Relazioni con i media Comunicazioni aziendali Comunicazioni interne Social media See 33+     See less ", "Experience Manager, External Relations, IBM Research IBM June 2011  – Present (4 years 3 months) Greater New York City Area Develop integrated communications strategies that support the scientific discoveries, breakthroughs and innovations of IBM Research, which serve as the technical headlights of the IBM company. \n \nPromote IBM’s accomplishments across areas such as IBM Watson, physical sciences, computational biology, quantum computing, systems research, artificial intelligence and cognitive computing. Senior Account Supervisor Hill & Knowlton September 2006  –  May 2011  (4 years 9 months) Greater New York City Area Managed full-service PR programs as part of the Technology Practice. Served as day-to-day account lead for clients including Ford Motor Company (technology product communications), Hewlett Packard (corporate executive communications), Deloitte & Touche (Audit Enterprise & Risk Services), and Tata Communications (telecommunications).  \n \nAccolades: PR Week 2011 Awards Winner – Technology Campaign of the Year/Ford Motor Company; PR Week 2011 Awards Finalist – Campaign of the Year/Ford Motor Company Technology Intern Ruder Finn January 2006  –  June 2006  (6 months) Greater Los Angeles Area Technology Intern Blanc & Otus June 2005  –  September 2005  (4 months) San Francisco Bay Area Account Management Intern Deutsch January 2005  –  April 2005  (4 months) Greater Los Angeles Area Manager, External Relations, IBM Research IBM June 2011  – Present (4 years 3 months) Greater New York City Area Develop integrated communications strategies that support the scientific discoveries, breakthroughs and innovations of IBM Research, which serve as the technical headlights of the IBM company. \n \nPromote IBM’s accomplishments across areas such as IBM Watson, physical sciences, computational biology, quantum computing, systems research, artificial intelligence and cognitive computing. Manager, External Relations, IBM Research IBM June 2011  – Present (4 years 3 months) Greater New York City Area Develop integrated communications strategies that support the scientific discoveries, breakthroughs and innovations of IBM Research, which serve as the technical headlights of the IBM company. \n \nPromote IBM’s accomplishments across areas such as IBM Watson, physical sciences, computational biology, quantum computing, systems research, artificial intelligence and cognitive computing. Senior Account Supervisor Hill & Knowlton September 2006  –  May 2011  (4 years 9 months) Greater New York City Area Managed full-service PR programs as part of the Technology Practice. Served as day-to-day account lead for clients including Ford Motor Company (technology product communications), Hewlett Packard (corporate executive communications), Deloitte & Touche (Audit Enterprise & Risk Services), and Tata Communications (telecommunications).  \n \nAccolades: PR Week 2011 Awards Winner – Technology Campaign of the Year/Ford Motor Company; PR Week 2011 Awards Finalist – Campaign of the Year/Ford Motor Company Senior Account Supervisor Hill & Knowlton September 2006  –  May 2011  (4 years 9 months) Greater New York City Area Managed full-service PR programs as part of the Technology Practice. Served as day-to-day account lead for clients including Ford Motor Company (technology product communications), Hewlett Packard (corporate executive communications), Deloitte & Touche (Audit Enterprise & Risk Services), and Tata Communications (telecommunications).  \n \nAccolades: PR Week 2011 Awards Winner – Technology Campaign of the Year/Ford Motor Company; PR Week 2011 Awards Finalist – Campaign of the Year/Ford Motor Company Technology Intern Ruder Finn January 2006  –  June 2006  (6 months) Greater Los Angeles Area Technology Intern Ruder Finn January 2006  –  June 2006  (6 months) Greater Los Angeles Area Technology Intern Blanc & Otus June 2005  –  September 2005  (4 months) San Francisco Bay Area Technology Intern Blanc & Otus June 2005  –  September 2005  (4 months) San Francisco Bay Area Account Management Intern Deutsch January 2005  –  April 2005  (4 months) Greater Los Angeles Area Account Management Intern Deutsch January 2005  –  April 2005  (4 months) Greater Los Angeles Area Languages   Skills Marketing Communications Strategic Communications Social Media Corporate Communications Crisis Communications Media Relations Internal Communications Press Releases Integrated Marketing Public Relations Social Media Marketing International Relations Marketing Strategy Communication Training Skills  Marketing Communications Strategic Communications Social Media Corporate Communications Crisis Communications Media Relations Internal Communications Press Releases Integrated Marketing Public Relations Social Media Marketing International Relations Marketing Strategy Communication Training Marketing Communications Strategic Communications Social Media Corporate Communications Crisis Communications Media Relations Internal Communications Press Releases Integrated Marketing Public Relations Social Media Marketing International Relations Marketing Strategy Communication Training Marketing Communications Strategic Communications Social Media Corporate Communications Crisis Communications Media Relations Internal Communications Press Releases Integrated Marketing Public Relations Social Media Marketing International Relations Marketing Strategy Communication Training Education University of California, Los Angeles Double Bachelor of Arts (B.A.),  Business Economics and Communications ,  Minor in French Language Activities and Societies:  Distinctions - Governor’s Scholar (State-issued award); Scholar with Distinction (The College Board); American Advertising Federation Delegate Institut d'Etudes Politiques de Lyon Enrolled for one year as a full-time student at leading political science university in France. Courses - International Commercial Relations, Financial Markets, Business Economics, Global Information, Economy of the Media University of California, Los Angeles Double Bachelor of Arts (B.A.),  Business Economics and Communications ,  Minor in French Language Activities and Societies:  Distinctions - Governor’s Scholar (State-issued award); Scholar with Distinction (The College Board); American Advertising Federation Delegate University of California, Los Angeles Double Bachelor of Arts (B.A.),  Business Economics and Communications ,  Minor in French Language Activities and Societies:  Distinctions - Governor’s Scholar (State-issued award); Scholar with Distinction (The College Board); American Advertising Federation Delegate University of California, Los Angeles Double Bachelor of Arts (B.A.),  Business Economics and Communications ,  Minor in French Language Activities and Societies:  Distinctions - Governor’s Scholar (State-issued award); Scholar with Distinction (The College Board); American Advertising Federation Delegate Institut d'Etudes Politiques de Lyon Enrolled for one year as a full-time student at leading political science university in France. Courses - International Commercial Relations, Financial Markets, Business Economics, Global Information, Economy of the Media Institut d'Etudes Politiques de Lyon Enrolled for one year as a full-time student at leading political science university in France. Courses - International Commercial Relations, Financial Markets, Business Economics, Global Information, Economy of the Media Institut d'Etudes Politiques de Lyon Enrolled for one year as a full-time student at leading political science university in France. Courses - International Commercial Relations, Financial Markets, Business Economics, Global Information, Economy of the Media Honors & Awards ", "Summary Media Relations for IBM Analytics: June 2015 - Present \nMedia Relations for IBM Cloud: November 2013 - June 2015 Summary Media Relations for IBM Analytics: June 2015 - Present \nMedia Relations for IBM Cloud: November 2013 - June 2015 Media Relations for IBM Analytics: June 2015 - Present \nMedia Relations for IBM Cloud: November 2013 - June 2015 Media Relations for IBM Analytics: June 2015 - Present \nMedia Relations for IBM Cloud: November 2013 - June 2015 Experience External Relations IBM November 2013  – Present (1 year 10 months) Associate/ Senior Associate Burson-Marsteller January 2012  –  November 2013  (1 year 11 months) Greater New York City Area Account Executive/ Senior Account Executive Text 100 August 2010  –  January 2012  (1 year 6 months) Account Coordinator/ Account Executive Griffin Integrated Communications July 2009  –  August 2010  (1 year 2 months) External Relations IBM November 2013  – Present (1 year 10 months) External Relations IBM November 2013  – Present (1 year 10 months) Associate/ Senior Associate Burson-Marsteller January 2012  –  November 2013  (1 year 11 months) Greater New York City Area Associate/ Senior Associate Burson-Marsteller January 2012  –  November 2013  (1 year 11 months) Greater New York City Area Account Executive/ Senior Account Executive Text 100 August 2010  –  January 2012  (1 year 6 months) Account Executive/ Senior Account Executive Text 100 August 2010  –  January 2012  (1 year 6 months) Account Coordinator/ Account Executive Griffin Integrated Communications July 2009  –  August 2010  (1 year 2 months) Account Coordinator/ Account Executive Griffin Integrated Communications July 2009  –  August 2010  (1 year 2 months) Skills Media Relations Press Releases Public Relations Strategic Communications Crisis Communications Corporate Communications Research Reputation Management Internal Communications Social Media Publicity Facebook Marketing Communications Social Media Marketing Integrated Marketing Skills  Media Relations Press Releases Public Relations Strategic Communications Crisis Communications Corporate Communications Research Reputation Management Internal Communications Social Media Publicity Facebook Marketing Communications Social Media Marketing Integrated Marketing Media Relations Press Releases Public Relations Strategic Communications Crisis Communications Corporate Communications Research Reputation Management Internal Communications Social Media Publicity Facebook Marketing Communications Social Media Marketing Integrated Marketing Media Relations Press Releases Public Relations Strategic Communications Crisis Communications Corporate Communications Research Reputation Management Internal Communications Social Media Publicity Facebook Marketing Communications Social Media Marketing Integrated Marketing Education Arizona State University Bachelor of Arts 2005  – 2009 Activities and Societies:  Public Relations Student Society of America ,  Dean's List ,  PBS/Channel 8 Production Arizona State University Bachelor of Arts 2005  – 2009 Activities and Societies:  Public Relations Student Society of America ,  Dean's List ,  PBS/Channel 8 Production Arizona State University Bachelor of Arts 2005  – 2009 Activities and Societies:  Public Relations Student Society of America ,  Dean's List ,  PBS/Channel 8 Production Arizona State University Bachelor of Arts 2005  – 2009 Activities and Societies:  Public Relations Student Society of America ,  Dean's List ,  PBS/Channel 8 Production ", "Skills Strategy Corporate Communications Public Relations Media Relations Strategic Communications Crisis Communications Strategic Partnerships Integrated Marketing Internal Communications Strategic Planning Marketing Communications Communication Training Marketing Thought Leadership Content Development Digital Marketing See 1+     See less Skills  Strategy Corporate Communications Public Relations Media Relations Strategic Communications Crisis Communications Strategic Partnerships Integrated Marketing Internal Communications Strategic Planning Marketing Communications Communication Training Marketing Thought Leadership Content Development Digital Marketing See 1+     See less Strategy Corporate Communications Public Relations Media Relations Strategic Communications Crisis Communications Strategic Partnerships Integrated Marketing Internal Communications Strategic Planning Marketing Communications Communication Training Marketing Thought Leadership Content Development Digital Marketing See 1+     See less Strategy Corporate Communications Public Relations Media Relations Strategic Communications Crisis Communications Strategic Partnerships Integrated Marketing Internal Communications Strategic Planning Marketing Communications Communication Training Marketing Thought Leadership Content Development Digital Marketing See 1+     See less ", "Summary Specialties: leading large global teams, storytelling, public affairs and influencer programs focused on reputation management, crisis communications, IPOs, and technology services/product launches Summary Specialties: leading large global teams, storytelling, public affairs and influencer programs focused on reputation management, crisis communications, IPOs, and technology services/product launches Specialties: leading large global teams, storytelling, public affairs and influencer programs focused on reputation management, crisis communications, IPOs, and technology services/product launches Specialties: leading large global teams, storytelling, public affairs and influencer programs focused on reputation management, crisis communications, IPOs, and technology services/product launches Skills Reputation Management Media Relations Corporate Communications Corporate Social... Issues Management Public Relations Strategic Communications Social Media Event Planning Press Releases Digital Media Digital Marketing Crisis Management Thought Leadership Messaging Crisis Communications Marketing Communications Internal Communications Brand Development Communications Planning Communication Training Blogging Crisis Communications... Management Event Management Corporate Social Media Content Strategy Digital Strategy Marketing Management Content Development Sponsorship Speech Writing Integrated Marketing Newsletters Content Management Public Affairs Analyst Relations Corporate Branding Campaigns Web Content Social Media Measurement Strategic Thinking Copywriting Cross-functional Team... Program Management B2B Marketing Brand Management Strategic Partnerships See 33+     See less Skills  Reputation Management Media Relations Corporate Communications Corporate Social... Issues Management Public Relations Strategic Communications Social Media Event Planning Press Releases Digital Media Digital Marketing Crisis Management Thought Leadership Messaging Crisis Communications Marketing Communications Internal Communications Brand Development Communications Planning Communication Training Blogging Crisis Communications... Management Event Management Corporate Social Media Content Strategy Digital Strategy Marketing Management Content Development Sponsorship Speech Writing Integrated Marketing Newsletters Content Management Public Affairs Analyst Relations Corporate Branding Campaigns Web Content Social Media Measurement Strategic Thinking Copywriting Cross-functional Team... Program Management B2B Marketing Brand Management Strategic Partnerships See 33+     See less Reputation Management Media Relations Corporate Communications Corporate Social... Issues Management Public Relations Strategic Communications Social Media Event Planning Press Releases Digital Media Digital Marketing Crisis Management Thought Leadership Messaging Crisis Communications Marketing Communications Internal Communications Brand Development Communications Planning Communication Training Blogging Crisis Communications... Management Event Management Corporate Social Media Content Strategy Digital Strategy Marketing Management Content Development Sponsorship Speech Writing Integrated Marketing Newsletters Content Management Public Affairs Analyst Relations Corporate Branding Campaigns Web Content Social Media Measurement Strategic Thinking Copywriting Cross-functional Team... Program Management B2B Marketing Brand Management Strategic Partnerships See 33+     See less Reputation Management Media Relations Corporate Communications Corporate Social... Issues Management Public Relations Strategic Communications Social Media Event Planning Press Releases Digital Media Digital Marketing Crisis Management Thought Leadership Messaging Crisis Communications Marketing Communications Internal Communications Brand Development Communications Planning Communication Training Blogging Crisis Communications... Management Event Management Corporate Social Media Content Strategy Digital Strategy Marketing Management Content Development Sponsorship Speech Writing Integrated Marketing Newsletters Content Management Public Affairs Analyst Relations Corporate Branding Campaigns Web Content Social Media Measurement Strategic Thinking Copywriting Cross-functional Team... Program Management B2B Marketing Brand Management Strategic Partnerships See 33+     See less Honors & Awards ", "Experience Corporate Communications and External Relations IBM June 2015  – Present (3 months) Armonk Account Supervisor MSLGROUP May 2013  –  February 2015  (1 year 10 months) New York Senior Associate, Consumer & Brand Marketing Burson-Marsteller April 2011  –  February 2013  (1 year 11 months) Special Projects Associate Burson-Marsteller February 2009  –  April 2011  (2 years 3 months) Members Services Coordinator Council of Public Relations Firms October 2006  –  February 2009  (2 years 5 months) Corporate Communications and External Relations IBM June 2015  – Present (3 months) Armonk Corporate Communications and External Relations IBM June 2015  – Present (3 months) Armonk Account Supervisor MSLGROUP May 2013  –  February 2015  (1 year 10 months) New York Account Supervisor MSLGROUP May 2013  –  February 2015  (1 year 10 months) New York Senior Associate, Consumer & Brand Marketing Burson-Marsteller April 2011  –  February 2013  (1 year 11 months) Senior Associate, Consumer & Brand Marketing Burson-Marsteller April 2011  –  February 2013  (1 year 11 months) Special Projects Associate Burson-Marsteller February 2009  –  April 2011  (2 years 3 months) Special Projects Associate Burson-Marsteller February 2009  –  April 2011  (2 years 3 months) Members Services Coordinator Council of Public Relations Firms October 2006  –  February 2009  (2 years 5 months) Members Services Coordinator Council of Public Relations Firms October 2006  –  February 2009  (2 years 5 months) Languages Spanish Spanish Spanish Skills Digital Strategy Crisis Communications Social Media Marketing Media Relations Marketing Communications Publicity Blogging Strategic Communications Public Relations Corporate Communications Speech Writing Marketing Cision Newsletters Digital Media Social Media Measurement See 1+     See less Skills  Digital Strategy Crisis Communications Social Media Marketing Media Relations Marketing Communications Publicity Blogging Strategic Communications Public Relations Corporate Communications Speech Writing Marketing Cision Newsletters Digital Media Social Media Measurement See 1+     See less Digital Strategy Crisis Communications Social Media Marketing Media Relations Marketing Communications Publicity Blogging Strategic Communications Public Relations Corporate Communications Speech Writing Marketing Cision Newsletters Digital Media Social Media Measurement See 1+     See less Digital Strategy Crisis Communications Social Media Marketing Media Relations Marketing Communications Publicity Blogging Strategic Communications Public Relations Corporate Communications Speech Writing Marketing Cision Newsletters Digital Media Social Media Measurement See 1+     See less Education New York University M.A.,  Public Relations Rutgers University-New Brunswick B.A.,  Communications New York University M.A.,  Public Relations New York University M.A.,  Public Relations New York University M.A.,  Public Relations Rutgers University-New Brunswick B.A.,  Communications Rutgers University-New Brunswick B.A.,  Communications Rutgers University-New Brunswick B.A.,  Communications ", "Experience External Relations IBM June 2014  – Present (1 year 3 months) New York , NY Manager Burson-Marsteller 2010  –  June 2014  (4 years) New York, NY Manager Bite Communications 2008  –  2009  (1 year) New York, NY Technology and corporate communications Account Director MWW Group 2005  –  2008  (3 years) Greater New York City Area Technology and corporate communications Associate Citigate Cunningham 2004  –  2005  (1 year) Cambridge, MA Technology communications  Assistant Editor Medscape 2000  –  2003  (3 years) New York, NY External Relations IBM June 2014  – Present (1 year 3 months) New York , NY External Relations IBM June 2014  – Present (1 year 3 months) New York , NY Manager Burson-Marsteller 2010  –  June 2014  (4 years) New York, NY Manager Burson-Marsteller 2010  –  June 2014  (4 years) New York, NY Manager Bite Communications 2008  –  2009  (1 year) New York, NY Technology and corporate communications Manager Bite Communications 2008  –  2009  (1 year) New York, NY Technology and corporate communications Account Director MWW Group 2005  –  2008  (3 years) Greater New York City Area Technology and corporate communications Account Director MWW Group 2005  –  2008  (3 years) Greater New York City Area Technology and corporate communications Associate Citigate Cunningham 2004  –  2005  (1 year) Cambridge, MA Technology communications  Associate Citigate Cunningham 2004  –  2005  (1 year) Cambridge, MA Technology communications  Assistant Editor Medscape 2000  –  2003  (3 years) New York, NY Assistant Editor Medscape 2000  –  2003  (3 years) New York, NY Skills Media Relations Corporate Communications Strategic Communications Public Relations Publicity Social Media Reputation Management Internal Communications Marketing Communications Writing Event Planning Event Management Copy Editing Editing Press Release... Blogging Global Communications Speech Writing See 3+     See less Skills  Media Relations Corporate Communications Strategic Communications Public Relations Publicity Social Media Reputation Management Internal Communications Marketing Communications Writing Event Planning Event Management Copy Editing Editing Press Release... Blogging Global Communications Speech Writing See 3+     See less Media Relations Corporate Communications Strategic Communications Public Relations Publicity Social Media Reputation Management Internal Communications Marketing Communications Writing Event Planning Event Management Copy Editing Editing Press Release... Blogging Global Communications Speech Writing See 3+     See less Media Relations Corporate Communications Strategic Communications Public Relations Publicity Social Media Reputation Management Internal Communications Marketing Communications Writing Event Planning Event Management Copy Editing Editing Press Release... Blogging Global Communications Speech Writing See 3+     See less Education Marist College Bachelor of Arts (B.A.),  English 1996  – 2000 English literature Marist College Bachelor of Arts (B.A.),  English Language and Literature , General 1996  – 2000 Marist College Bachelor of Arts (B.A.),  English 1996  – 2000 English literature Marist College Bachelor of Arts (B.A.),  English 1996  – 2000 English literature Marist College Bachelor of Arts (B.A.),  English 1996  – 2000 English literature Marist College Bachelor of Arts (B.A.),  English Language and Literature , General 1996  – 2000 Marist College Bachelor of Arts (B.A.),  English Language and Literature , General 1996  – 2000 Marist College Bachelor of Arts (B.A.),  English Language and Literature , General 1996  – 2000 ", "Summary Senior strategic communications executive with a successful history of creating and executing the communications strategies for early startups and major corporations. I intuitively understand how to craft, package and deliver an authentic story for any audience over any channel with one goal in mind... shaping perceptions. \n \nDuring my 20-year career, I have had a front-row seat for the birth of World Wide Web and the glory days of Microsoft as a technology reporter for BusinessWeek and PC Week. In the years since, I have helped the likes of Marc Andreessen, HP, Xerox, IBM and now Marketo tell their stories and shape their brand. Along the way, I have had a bit of fun too. Summary Senior strategic communications executive with a successful history of creating and executing the communications strategies for early startups and major corporations. I intuitively understand how to craft, package and deliver an authentic story for any audience over any channel with one goal in mind... shaping perceptions. \n \nDuring my 20-year career, I have had a front-row seat for the birth of World Wide Web and the glory days of Microsoft as a technology reporter for BusinessWeek and PC Week. In the years since, I have helped the likes of Marc Andreessen, HP, Xerox, IBM and now Marketo tell their stories and shape their brand. Along the way, I have had a bit of fun too. Senior strategic communications executive with a successful history of creating and executing the communications strategies for early startups and major corporations. I intuitively understand how to craft, package and deliver an authentic story for any audience over any channel with one goal in mind... shaping perceptions. \n \nDuring my 20-year career, I have had a front-row seat for the birth of World Wide Web and the glory days of Microsoft as a technology reporter for BusinessWeek and PC Week. In the years since, I have helped the likes of Marc Andreessen, HP, Xerox, IBM and now Marketo tell their stories and shape their brand. Along the way, I have had a bit of fun too. Senior strategic communications executive with a successful history of creating and executing the communications strategies for early startups and major corporations. I intuitively understand how to craft, package and deliver an authentic story for any audience over any channel with one goal in mind... shaping perceptions. \n \nDuring my 20-year career, I have had a front-row seat for the birth of World Wide Web and the glory days of Microsoft as a technology reporter for BusinessWeek and PC Week. In the years since, I have helped the likes of Marc Andreessen, HP, Xerox, IBM and now Marketo tell their stories and shape their brand. Along the way, I have had a bit of fun too. Experience Vice President, Brand and Communications Marketo February 2014  – Present (1 year 7 months) San Mateo Responsible for global public relations, executive communications, employee communication, brand strategy, social and advertising. Focused on building Marketo's brand awareness and expanding its reach into new markets. During the first six months, I overhauled our brand positioning, introduced Marketo into the consumer space, developed a 24-month strategy for establishing our presence in the Fortune 500, began building a team, and increased the CEO's external profile. Promoted from senior director to vice president after the first six weeks. Vice President, Communications Avaya June 2013  –  November 2013  (6 months) Santa Clara Hired to revamp the all aspects of the Avaya brand and public perception. Responsible for external, internal and executive communications as well as industry analyst relations and field communications. Managed a global team of 17 with a budget of $10M annually. Crafted a new company narrative and implemented a multi-disciplined strategy to roll out the “story” globally to all audiences both internal and external. Orchestrated the most successful launch in the company’s history after only two months at the company. Implemented a proactive and crisis plan for the Sochi Winter Olympics designed to maximize awareness for the brand. Director, External Relations IBM May 2010  –  June 2013  (3 years 2 months) Oversaw all aspects of external relations for IBM Software where I had global responsibility for crafting and developing the overall communications strategies and messaging for IBM's security strategy, cloud computing, mobility, and its venture capital strategy. Teamed to promote, core aspects of IBM's Smarter Planet strategy and the software that enables IBM's Smarter Cities efforts. Deeply involved in building out the communications strategy for IBM's emerging market efforts with a specific emphasis on IBM's strategic expansion into Africa.  \n \nFirst joined IBM in May 2010 where I was responsible for the external communications efforts supporting IBM's $60B+ Global Technology Services business unit until November 2011. Director Corporate Public Relations Xerox May 2007  –  April 2010  (3 years) Responsible for the corporate public relations for Xerox Corporation. Oversaw all financial, crisis, environmental, brand and R&D public relations programs. Manage community relations programs. Head up earnings in conjunction with investor relations. Helped oversee the acquistion of ACS and the CEO transition from Anne Mulcahy to Ursula Burns and the first major rebrand of Xerox. Director, Corporate Media Relations HP July 2003  –  May 2007  (3 years 11 months) Oversaw crisis communications and proactive corporate PR programs for HP. Accountable for a wide array of strategic focus areas including: Promotion of the corporate strategy, R&D/HP Labs, M&A, emerging markets, and strategic alliances. Led projects such as the CEO transition from Carly Fiorina to Mark Hurd and the board of directors spying/pretexting scandal. Drove dozens of major features in the business media including cover stories in Fortune, Forbes, WSJ, NYT, BusinessWeek, etc... \n \nManaged both an internal team and external PR agencies with a budget of more than $2 million annually. Head of Public Relations Loudcloud/Opsware November 1999  –  June 2003  (3 years 8 months) Was one of the first 15 employees hired by Marc Andreessen and Ben Horowitz to help tell the story of Loudcloud -- their first start-up after Netscape. Oversaw communications for the company -- handling everything from the launching of the company (we were arguably the first cloud company ever) and to messaging the IPO as the dotcom bubble burst IPO. Helped the company transform itself from a hosting/early cloud provider to a software company and the renaming of the company into Opsware. Reporter BusinessWeek 1998  –  1999  (1 year) During my time at BusinessWeek, I covered the technology market with a specific interest in Microsoft and the software industry. Delivered one of the first stories on the Gates Foundation as well as profiles of Bill Gates, Larry Ellison, and other leaders of the software industry Senior Editor PC Week Magazine May 1994  –  January 1998  (3 years 9 months) Reported on the software industry and the birth of the World Wide Web. Spent good portion of my time covering Microsoft and Netscape. Editor Edittech International March 1991  –  May 1994  (3 years 3 months) Reporter covering the high tech industry for international business newspapers and magazines. Vice President, Brand and Communications Marketo February 2014  – Present (1 year 7 months) San Mateo Responsible for global public relations, executive communications, employee communication, brand strategy, social and advertising. Focused on building Marketo's brand awareness and expanding its reach into new markets. During the first six months, I overhauled our brand positioning, introduced Marketo into the consumer space, developed a 24-month strategy for establishing our presence in the Fortune 500, began building a team, and increased the CEO's external profile. Promoted from senior director to vice president after the first six weeks. Vice President, Brand and Communications Marketo February 2014  – Present (1 year 7 months) San Mateo Responsible for global public relations, executive communications, employee communication, brand strategy, social and advertising. Focused on building Marketo's brand awareness and expanding its reach into new markets. During the first six months, I overhauled our brand positioning, introduced Marketo into the consumer space, developed a 24-month strategy for establishing our presence in the Fortune 500, began building a team, and increased the CEO's external profile. Promoted from senior director to vice president after the first six weeks. Vice President, Communications Avaya June 2013  –  November 2013  (6 months) Santa Clara Hired to revamp the all aspects of the Avaya brand and public perception. Responsible for external, internal and executive communications as well as industry analyst relations and field communications. Managed a global team of 17 with a budget of $10M annually. Crafted a new company narrative and implemented a multi-disciplined strategy to roll out the “story” globally to all audiences both internal and external. Orchestrated the most successful launch in the company’s history after only two months at the company. Implemented a proactive and crisis plan for the Sochi Winter Olympics designed to maximize awareness for the brand. Vice President, Communications Avaya June 2013  –  November 2013  (6 months) Santa Clara Hired to revamp the all aspects of the Avaya brand and public perception. Responsible for external, internal and executive communications as well as industry analyst relations and field communications. Managed a global team of 17 with a budget of $10M annually. Crafted a new company narrative and implemented a multi-disciplined strategy to roll out the “story” globally to all audiences both internal and external. Orchestrated the most successful launch in the company’s history after only two months at the company. Implemented a proactive and crisis plan for the Sochi Winter Olympics designed to maximize awareness for the brand. Director, External Relations IBM May 2010  –  June 2013  (3 years 2 months) Oversaw all aspects of external relations for IBM Software where I had global responsibility for crafting and developing the overall communications strategies and messaging for IBM's security strategy, cloud computing, mobility, and its venture capital strategy. Teamed to promote, core aspects of IBM's Smarter Planet strategy and the software that enables IBM's Smarter Cities efforts. Deeply involved in building out the communications strategy for IBM's emerging market efforts with a specific emphasis on IBM's strategic expansion into Africa.  \n \nFirst joined IBM in May 2010 where I was responsible for the external communications efforts supporting IBM's $60B+ Global Technology Services business unit until November 2011. Director, External Relations IBM May 2010  –  June 2013  (3 years 2 months) Oversaw all aspects of external relations for IBM Software where I had global responsibility for crafting and developing the overall communications strategies and messaging for IBM's security strategy, cloud computing, mobility, and its venture capital strategy. Teamed to promote, core aspects of IBM's Smarter Planet strategy and the software that enables IBM's Smarter Cities efforts. Deeply involved in building out the communications strategy for IBM's emerging market efforts with a specific emphasis on IBM's strategic expansion into Africa.  \n \nFirst joined IBM in May 2010 where I was responsible for the external communications efforts supporting IBM's $60B+ Global Technology Services business unit until November 2011. Director Corporate Public Relations Xerox May 2007  –  April 2010  (3 years) Responsible for the corporate public relations for Xerox Corporation. Oversaw all financial, crisis, environmental, brand and R&D public relations programs. Manage community relations programs. Head up earnings in conjunction with investor relations. Helped oversee the acquistion of ACS and the CEO transition from Anne Mulcahy to Ursula Burns and the first major rebrand of Xerox. Director Corporate Public Relations Xerox May 2007  –  April 2010  (3 years) Responsible for the corporate public relations for Xerox Corporation. Oversaw all financial, crisis, environmental, brand and R&D public relations programs. Manage community relations programs. Head up earnings in conjunction with investor relations. Helped oversee the acquistion of ACS and the CEO transition from Anne Mulcahy to Ursula Burns and the first major rebrand of Xerox. Director, Corporate Media Relations HP July 2003  –  May 2007  (3 years 11 months) Oversaw crisis communications and proactive corporate PR programs for HP. Accountable for a wide array of strategic focus areas including: Promotion of the corporate strategy, R&D/HP Labs, M&A, emerging markets, and strategic alliances. Led projects such as the CEO transition from Carly Fiorina to Mark Hurd and the board of directors spying/pretexting scandal. Drove dozens of major features in the business media including cover stories in Fortune, Forbes, WSJ, NYT, BusinessWeek, etc... \n \nManaged both an internal team and external PR agencies with a budget of more than $2 million annually. Director, Corporate Media Relations HP July 2003  –  May 2007  (3 years 11 months) Oversaw crisis communications and proactive corporate PR programs for HP. Accountable for a wide array of strategic focus areas including: Promotion of the corporate strategy, R&D/HP Labs, M&A, emerging markets, and strategic alliances. Led projects such as the CEO transition from Carly Fiorina to Mark Hurd and the board of directors spying/pretexting scandal. Drove dozens of major features in the business media including cover stories in Fortune, Forbes, WSJ, NYT, BusinessWeek, etc... \n \nManaged both an internal team and external PR agencies with a budget of more than $2 million annually. Head of Public Relations Loudcloud/Opsware November 1999  –  June 2003  (3 years 8 months) Was one of the first 15 employees hired by Marc Andreessen and Ben Horowitz to help tell the story of Loudcloud -- their first start-up after Netscape. Oversaw communications for the company -- handling everything from the launching of the company (we were arguably the first cloud company ever) and to messaging the IPO as the dotcom bubble burst IPO. Helped the company transform itself from a hosting/early cloud provider to a software company and the renaming of the company into Opsware. Head of Public Relations Loudcloud/Opsware November 1999  –  June 2003  (3 years 8 months) Was one of the first 15 employees hired by Marc Andreessen and Ben Horowitz to help tell the story of Loudcloud -- their first start-up after Netscape. Oversaw communications for the company -- handling everything from the launching of the company (we were arguably the first cloud company ever) and to messaging the IPO as the dotcom bubble burst IPO. Helped the company transform itself from a hosting/early cloud provider to a software company and the renaming of the company into Opsware. Reporter BusinessWeek 1998  –  1999  (1 year) During my time at BusinessWeek, I covered the technology market with a specific interest in Microsoft and the software industry. Delivered one of the first stories on the Gates Foundation as well as profiles of Bill Gates, Larry Ellison, and other leaders of the software industry Reporter BusinessWeek 1998  –  1999  (1 year) During my time at BusinessWeek, I covered the technology market with a specific interest in Microsoft and the software industry. Delivered one of the first stories on the Gates Foundation as well as profiles of Bill Gates, Larry Ellison, and other leaders of the software industry Senior Editor PC Week Magazine May 1994  –  January 1998  (3 years 9 months) Reported on the software industry and the birth of the World Wide Web. Spent good portion of my time covering Microsoft and Netscape. Senior Editor PC Week Magazine May 1994  –  January 1998  (3 years 9 months) Reported on the software industry and the birth of the World Wide Web. Spent good portion of my time covering Microsoft and Netscape. Editor Edittech International March 1991  –  May 1994  (3 years 3 months) Reporter covering the high tech industry for international business newspapers and magazines. Editor Edittech International March 1991  –  May 1994  (3 years 3 months) Reporter covering the high tech industry for international business newspapers and magazines. Skills Strategic Communications Skills  Strategic Communications Strategic Communications Strategic Communications Education San Jose State University BA,  Journalism 1987  – 1991 San Jose State University BA,  Journalism 1987  – 1991 San Jose State University BA,  Journalism 1987  – 1991 San Jose State University BA,  Journalism 1987  – 1991 Honors & Awards PR Campaign of the Year 2012 PR Week B2B Marketing Team of the Year Marketers that Matter May 2014 PR Campaign of the Year 2012 PR Week PR Campaign of the Year 2012 PR Week PR Campaign of the Year 2012 PR Week B2B Marketing Team of the Year Marketers that Matter May 2014 B2B Marketing Team of the Year Marketers that Matter May 2014 B2B Marketing Team of the Year Marketers that Matter May 2014 ", "Summary I'm a communications and digital content strategist with more than 25 years experience on both sides of the media aisle: journalism and public relations.  \n \nI have been building and managing integrated public relations strategies and programs for two Fortune 500 companies since 2005. In addition to managing and motivating teams of PR professionals, some of my prime responsibilities have included speech and script writing, press release creation and management, video production management, launch messaging, event planning and crisis management. Through it all, I've maintained a simple rule: set goals and build strategies to achieve them.  \n \nPrior to my transition into public relations, I spent 17 years as a reporter and then Executive Editor, News, for a top national high-tech business publication. In my role as EE I lead 25 of the best investigative journalists and editors in the industry, chronicling the rapidly changing tech landscape from the advent of email, through the birth of the Web, to Cloud. Oversaw the day-to-day operation of the newsroom, for both print and online; operation served as the \"news service\" for the entire publishing company.  \n \nBoth experiences have provided me a unique insight into the value and impact of honest, effective story telling. \n \nSpecialties: Message creation, writing, editing, team management, customer relationship building Summary I'm a communications and digital content strategist with more than 25 years experience on both sides of the media aisle: journalism and public relations.  \n \nI have been building and managing integrated public relations strategies and programs for two Fortune 500 companies since 2005. In addition to managing and motivating teams of PR professionals, some of my prime responsibilities have included speech and script writing, press release creation and management, video production management, launch messaging, event planning and crisis management. Through it all, I've maintained a simple rule: set goals and build strategies to achieve them.  \n \nPrior to my transition into public relations, I spent 17 years as a reporter and then Executive Editor, News, for a top national high-tech business publication. In my role as EE I lead 25 of the best investigative journalists and editors in the industry, chronicling the rapidly changing tech landscape from the advent of email, through the birth of the Web, to Cloud. Oversaw the day-to-day operation of the newsroom, for both print and online; operation served as the \"news service\" for the entire publishing company.  \n \nBoth experiences have provided me a unique insight into the value and impact of honest, effective story telling. \n \nSpecialties: Message creation, writing, editing, team management, customer relationship building I'm a communications and digital content strategist with more than 25 years experience on both sides of the media aisle: journalism and public relations.  \n \nI have been building and managing integrated public relations strategies and programs for two Fortune 500 companies since 2005. In addition to managing and motivating teams of PR professionals, some of my prime responsibilities have included speech and script writing, press release creation and management, video production management, launch messaging, event planning and crisis management. Through it all, I've maintained a simple rule: set goals and build strategies to achieve them.  \n \nPrior to my transition into public relations, I spent 17 years as a reporter and then Executive Editor, News, for a top national high-tech business publication. In my role as EE I lead 25 of the best investigative journalists and editors in the industry, chronicling the rapidly changing tech landscape from the advent of email, through the birth of the Web, to Cloud. Oversaw the day-to-day operation of the newsroom, for both print and online; operation served as the \"news service\" for the entire publishing company.  \n \nBoth experiences have provided me a unique insight into the value and impact of honest, effective story telling. \n \nSpecialties: Message creation, writing, editing, team management, customer relationship building I'm a communications and digital content strategist with more than 25 years experience on both sides of the media aisle: journalism and public relations.  \n \nI have been building and managing integrated public relations strategies and programs for two Fortune 500 companies since 2005. In addition to managing and motivating teams of PR professionals, some of my prime responsibilities have included speech and script writing, press release creation and management, video production management, launch messaging, event planning and crisis management. Through it all, I've maintained a simple rule: set goals and build strategies to achieve them.  \n \nPrior to my transition into public relations, I spent 17 years as a reporter and then Executive Editor, News, for a top national high-tech business publication. In my role as EE I lead 25 of the best investigative journalists and editors in the industry, chronicling the rapidly changing tech landscape from the advent of email, through the birth of the Web, to Cloud. Oversaw the day-to-day operation of the newsroom, for both print and online; operation served as the \"news service\" for the entire publishing company.  \n \nBoth experiences have provided me a unique insight into the value and impact of honest, effective story telling. \n \nSpecialties: Message creation, writing, editing, team management, customer relationship building Languages   Skills Editing Content Development Content Management Content Strategy Social Media Public Relations Press Releases Integrated Marketing Media Relations Publishing Editorial Journalism Marketing Strategy Management Skills  Editing Content Development Content Management Content Strategy Social Media Public Relations Press Releases Integrated Marketing Media Relations Publishing Editorial Journalism Marketing Strategy Management Editing Content Development Content Management Content Strategy Social Media Public Relations Press Releases Integrated Marketing Media Relations Publishing Editorial Journalism Marketing Strategy Management Editing Content Development Content Management Content Strategy Social Media Public Relations Press Releases Integrated Marketing Media Relations Publishing Editorial Journalism Marketing Strategy Management Honors & Awards ", "Skills Corporate Communications Strategic Communications Crisis Communications Media Relations Communication Training Reputation Management Messaging Public Relations Message Development Internal Communications Crisis Management Analyst Relations Strategy Reputation B2B Stakeholder Engagement Thought Leadership Blogging Stakeholder Management International Relations Positioning Public Affairs Executive Communications Issues Management Writing Communications Strategy Global Communications Corporate Positioning Social Media Social Networking See 15+     See less Skills  Corporate Communications Strategic Communications Crisis Communications Media Relations Communication Training Reputation Management Messaging Public Relations Message Development Internal Communications Crisis Management Analyst Relations Strategy Reputation B2B Stakeholder Engagement Thought Leadership Blogging Stakeholder Management International Relations Positioning Public Affairs Executive Communications Issues Management Writing Communications Strategy Global Communications Corporate Positioning Social Media Social Networking See 15+     See less Corporate Communications Strategic Communications Crisis Communications Media Relations Communication Training Reputation Management Messaging Public Relations Message Development Internal Communications Crisis Management Analyst Relations Strategy Reputation B2B Stakeholder Engagement Thought Leadership Blogging Stakeholder Management International Relations Positioning Public Affairs Executive Communications Issues Management Writing Communications Strategy Global Communications Corporate Positioning Social Media Social Networking See 15+     See less Corporate Communications Strategic Communications Crisis Communications Media Relations Communication Training Reputation Management Messaging Public Relations Message Development Internal Communications Crisis Management Analyst Relations Strategy Reputation B2B Stakeholder Engagement Thought Leadership Blogging Stakeholder Management International Relations Positioning Public Affairs Executive Communications Issues Management Writing Communications Strategy Global Communications Corporate Positioning Social Media Social Networking See 15+     See less ", "Summary After a master's degree in Economics at the University of Verona, I have worked for more than 20 years in IBM Italy, where I have had the opportunity to play different roles from technical instructor, sales representative, people manager with business responsibility for the Europe South Region, leader at European level, with also global virtual assignment, up to market segment manager and communication leader. \nToday within the IBM External Relations team, I am responsible for media, analysts and influencer relations for Cloud Computing, Security and IT Services. I deal with media, journalists, analysts, influencers, content makers and pr agencies, trying to invent every day innovative way to talk about the value of emerging technologies for businesses and people. I strongly believe that innovation and breakthrough thinking could enable differentiating value. \n \nCharacteristics: creativity, proactivity, results-oriented approach, client first approach, \ncommunication skills, ability to work in an international context. \n \nGoals: continuous learning, driving innovation, breakthrough thinking \n \nSpecialties: Learning, e-learning, Sales, Marketing, Corporate Communications, Strategic Communications, External (Media, Analyst, Influencer) Relations, Issue Management, Social Media, Marketing Communications. Summary After a master's degree in Economics at the University of Verona, I have worked for more than 20 years in IBM Italy, where I have had the opportunity to play different roles from technical instructor, sales representative, people manager with business responsibility for the Europe South Region, leader at European level, with also global virtual assignment, up to market segment manager and communication leader. \nToday within the IBM External Relations team, I am responsible for media, analysts and influencer relations for Cloud Computing, Security and IT Services. I deal with media, journalists, analysts, influencers, content makers and pr agencies, trying to invent every day innovative way to talk about the value of emerging technologies for businesses and people. I strongly believe that innovation and breakthrough thinking could enable differentiating value. \n \nCharacteristics: creativity, proactivity, results-oriented approach, client first approach, \ncommunication skills, ability to work in an international context. \n \nGoals: continuous learning, driving innovation, breakthrough thinking \n \nSpecialties: Learning, e-learning, Sales, Marketing, Corporate Communications, Strategic Communications, External (Media, Analyst, Influencer) Relations, Issue Management, Social Media, Marketing Communications. After a master's degree in Economics at the University of Verona, I have worked for more than 20 years in IBM Italy, where I have had the opportunity to play different roles from technical instructor, sales representative, people manager with business responsibility for the Europe South Region, leader at European level, with also global virtual assignment, up to market segment manager and communication leader. \nToday within the IBM External Relations team, I am responsible for media, analysts and influencer relations for Cloud Computing, Security and IT Services. I deal with media, journalists, analysts, influencers, content makers and pr agencies, trying to invent every day innovative way to talk about the value of emerging technologies for businesses and people. I strongly believe that innovation and breakthrough thinking could enable differentiating value. \n \nCharacteristics: creativity, proactivity, results-oriented approach, client first approach, \ncommunication skills, ability to work in an international context. \n \nGoals: continuous learning, driving innovation, breakthrough thinking \n \nSpecialties: Learning, e-learning, Sales, Marketing, Corporate Communications, Strategic Communications, External (Media, Analyst, Influencer) Relations, Issue Management, Social Media, Marketing Communications. After a master's degree in Economics at the University of Verona, I have worked for more than 20 years in IBM Italy, where I have had the opportunity to play different roles from technical instructor, sales representative, people manager with business responsibility for the Europe South Region, leader at European level, with also global virtual assignment, up to market segment manager and communication leader. \nToday within the IBM External Relations team, I am responsible for media, analysts and influencer relations for Cloud Computing, Security and IT Services. I deal with media, journalists, analysts, influencers, content makers and pr agencies, trying to invent every day innovative way to talk about the value of emerging technologies for businesses and people. I strongly believe that innovation and breakthrough thinking could enable differentiating value. \n \nCharacteristics: creativity, proactivity, results-oriented approach, client first approach, \ncommunication skills, ability to work in an international context. \n \nGoals: continuous learning, driving innovation, breakthrough thinking \n \nSpecialties: Learning, e-learning, Sales, Marketing, Corporate Communications, Strategic Communications, External (Media, Analyst, Influencer) Relations, Issue Management, Social Media, Marketing Communications. Experience External Relations IBM January 2014  – Present (1 year 8 months) Milan Area, Italy I'm responsible for the Media, Analysts and Influencer Relations at IBM in the area of Cloud Computing, Security and Infrastructure Services. I deal with media, journalists, analysts, influencers, content makers and pr agencies, trying to invent every day innovative way to talk about the value of emerging technologies for businesses and people. Media Relations IBM Italy February 2008  –  December 2013  (5 years 11 months) Milan In this position I've been mainly engaged with media relation development and management, corporate image, as well as business marketing and internal communication support.  \nI've been also part of international teams focused on specific projects. The role consists in managing communication contents; alignment of international messages and campaigns with local business priorities; definition of local communication plans, Executives and Directors media briefing and support; communication events; push-pull communication opportunities; external public relation agencies activities; internal communication programs support; marketing events support; sales force feed with competitive marketing information and timely, relevant and actionable insights; qualified messages among key influencer groups. GTS Market Segment Manager IBM February 2004  –  2008  (4 years) In this role I've been responsible for Marketing of IBM Strategic Outsourcing Services and for IBM Infrastructure Management Services. I coordinated the marketing activities to support business in these services areas, integrating the IBM IT services value proposition within the IBM corporate marketing programs. I had also the responsibility for the Client Reference Program for IBM Global Technology Services. Learning Principal IBM Emea, Belgium January 2001  –  February 2004  (3 years 2 months) La Hulpe I was responsible for the design and implementation of the LBTO (Learning Business Transformation Outsourcing) Offering at European level. In this role I was supporting the IBM Emea Regions in developing and selling this business, with business engagement responsibilyt for the South Region (Italy, Spain, Portugal, Greece and Turkey). e-learning Manager IBM Italia February 1998  –  January 2001  (3 years) Novedrate I was e-learning Offering and Delivery Manager with the responsibility of e-learning business growth in the South Region, that was made by Italy, Spain, Portugal, Israel, Turkey and Israel.  \nIn this position I overachieved this goal, with extraordinary performance in terms of number, value and type of projects, making South Region the best IBM Region in e-learning at ww level.  \nI managed consultant and delivery team in the Region (10 people direct reportees in Italy) and gave functional guidance also to the IBM Knowledge Factory development team in Bari (other 10 people). Education Sales Representative for Banking&Finance IBM Italia July 1994  –  February 1998  (3 years 8 months) Milan Instructor IBM Italia April 1990  –  July 1994  (4 years 4 months) Milan Area, Italy External Relations IBM January 2014  – Present (1 year 8 months) Milan Area, Italy I'm responsible for the Media, Analysts and Influencer Relations at IBM in the area of Cloud Computing, Security and Infrastructure Services. I deal with media, journalists, analysts, influencers, content makers and pr agencies, trying to invent every day innovative way to talk about the value of emerging technologies for businesses and people. External Relations IBM January 2014  – Present (1 year 8 months) Milan Area, Italy I'm responsible for the Media, Analysts and Influencer Relations at IBM in the area of Cloud Computing, Security and Infrastructure Services. I deal with media, journalists, analysts, influencers, content makers and pr agencies, trying to invent every day innovative way to talk about the value of emerging technologies for businesses and people. Media Relations IBM Italy February 2008  –  December 2013  (5 years 11 months) Milan In this position I've been mainly engaged with media relation development and management, corporate image, as well as business marketing and internal communication support.  \nI've been also part of international teams focused on specific projects. The role consists in managing communication contents; alignment of international messages and campaigns with local business priorities; definition of local communication plans, Executives and Directors media briefing and support; communication events; push-pull communication opportunities; external public relation agencies activities; internal communication programs support; marketing events support; sales force feed with competitive marketing information and timely, relevant and actionable insights; qualified messages among key influencer groups. Media Relations IBM Italy February 2008  –  December 2013  (5 years 11 months) Milan In this position I've been mainly engaged with media relation development and management, corporate image, as well as business marketing and internal communication support.  \nI've been also part of international teams focused on specific projects. The role consists in managing communication contents; alignment of international messages and campaigns with local business priorities; definition of local communication plans, Executives and Directors media briefing and support; communication events; push-pull communication opportunities; external public relation agencies activities; internal communication programs support; marketing events support; sales force feed with competitive marketing information and timely, relevant and actionable insights; qualified messages among key influencer groups. GTS Market Segment Manager IBM February 2004  –  2008  (4 years) In this role I've been responsible for Marketing of IBM Strategic Outsourcing Services and for IBM Infrastructure Management Services. I coordinated the marketing activities to support business in these services areas, integrating the IBM IT services value proposition within the IBM corporate marketing programs. I had also the responsibility for the Client Reference Program for IBM Global Technology Services. GTS Market Segment Manager IBM February 2004  –  2008  (4 years) In this role I've been responsible for Marketing of IBM Strategic Outsourcing Services and for IBM Infrastructure Management Services. I coordinated the marketing activities to support business in these services areas, integrating the IBM IT services value proposition within the IBM corporate marketing programs. I had also the responsibility for the Client Reference Program for IBM Global Technology Services. Learning Principal IBM Emea, Belgium January 2001  –  February 2004  (3 years 2 months) La Hulpe I was responsible for the design and implementation of the LBTO (Learning Business Transformation Outsourcing) Offering at European level. In this role I was supporting the IBM Emea Regions in developing and selling this business, with business engagement responsibilyt for the South Region (Italy, Spain, Portugal, Greece and Turkey). Learning Principal IBM Emea, Belgium January 2001  –  February 2004  (3 years 2 months) La Hulpe I was responsible for the design and implementation of the LBTO (Learning Business Transformation Outsourcing) Offering at European level. In this role I was supporting the IBM Emea Regions in developing and selling this business, with business engagement responsibilyt for the South Region (Italy, Spain, Portugal, Greece and Turkey). e-learning Manager IBM Italia February 1998  –  January 2001  (3 years) Novedrate I was e-learning Offering and Delivery Manager with the responsibility of e-learning business growth in the South Region, that was made by Italy, Spain, Portugal, Israel, Turkey and Israel.  \nIn this position I overachieved this goal, with extraordinary performance in terms of number, value and type of projects, making South Region the best IBM Region in e-learning at ww level.  \nI managed consultant and delivery team in the Region (10 people direct reportees in Italy) and gave functional guidance also to the IBM Knowledge Factory development team in Bari (other 10 people). e-learning Manager IBM Italia February 1998  –  January 2001  (3 years) Novedrate I was e-learning Offering and Delivery Manager with the responsibility of e-learning business growth in the South Region, that was made by Italy, Spain, Portugal, Israel, Turkey and Israel.  \nIn this position I overachieved this goal, with extraordinary performance in terms of number, value and type of projects, making South Region the best IBM Region in e-learning at ww level.  \nI managed consultant and delivery team in the Region (10 people direct reportees in Italy) and gave functional guidance also to the IBM Knowledge Factory development team in Bari (other 10 people). Education Sales Representative for Banking&Finance IBM Italia July 1994  –  February 1998  (3 years 8 months) Milan Education Sales Representative for Banking&Finance IBM Italia July 1994  –  February 1998  (3 years 8 months) Milan Instructor IBM Italia April 1990  –  July 1994  (4 years 4 months) Milan Area, Italy Instructor IBM Italia April 1990  –  July 1994  (4 years 4 months) Milan Area, Italy Languages English Full professional proficiency German Limited working proficiency English Full professional proficiency German Limited working proficiency English Full professional proficiency German Limited working proficiency Full professional proficiency Limited working proficiency Skills Media Relations Digital Marketing Marketing Communications Influencer Relations Analyst Relations Corporate Communications Marketing Strategy Social Media Marketing Content Management Cloud Computing Information Security Marketing Demand Generation Team Leadership Project Management Organizational... Management E-Learning Learning Management... Learning Management Trainging & Development Education Training Pre-sales Solution Selling Direct Sales CRM See 12+     See less Skills  Media Relations Digital Marketing Marketing Communications Influencer Relations Analyst Relations Corporate Communications Marketing Strategy Social Media Marketing Content Management Cloud Computing Information Security Marketing Demand Generation Team Leadership Project Management Organizational... Management E-Learning Learning Management... Learning Management Trainging & Development Education Training Pre-sales Solution Selling Direct Sales CRM See 12+     See less Media Relations Digital Marketing Marketing Communications Influencer Relations Analyst Relations Corporate Communications Marketing Strategy Social Media Marketing Content Management Cloud Computing Information Security Marketing Demand Generation Team Leadership Project Management Organizational... Management E-Learning Learning Management... Learning Management Trainging & Development Education Training Pre-sales Solution Selling Direct Sales CRM See 12+     See less Media Relations Digital Marketing Marketing Communications Influencer Relations Analyst Relations Corporate Communications Marketing Strategy Social Media Marketing Content Management Cloud Computing Information Security Marketing Demand Generation Team Leadership Project Management Organizational... Management E-Learning Learning Management... Learning Management Trainging & Development Education Training Pre-sales Solution Selling Direct Sales CRM See 12+     See less Education Università degli Studi di Verona Master's Degree in Economics,  Business Administration and Management , graduated cum laude 1983  – 1989 Activities and Societies:  I've worked in Finland partecipating to AIESEC association Luigi Einaudi - Verona Diploma Perito Aziendale e Corrispondente in Lingue Estere 1978  – 1983 Università degli Studi di Verona Master's Degree in Economics,  Business Administration and Management , graduated cum laude 1983  – 1989 Activities and Societies:  I've worked in Finland partecipating to AIESEC association Università degli Studi di Verona Master's Degree in Economics,  Business Administration and Management , graduated cum laude 1983  – 1989 Activities and Societies:  I've worked in Finland partecipating to AIESEC association Università degli Studi di Verona Master's Degree in Economics,  Business Administration and Management , graduated cum laude 1983  – 1989 Activities and Societies:  I've worked in Finland partecipating to AIESEC association Luigi Einaudi - Verona Diploma Perito Aziendale e Corrispondente in Lingue Estere 1978  – 1983 Luigi Einaudi - Verona Diploma Perito Aziendale e Corrispondente in Lingue Estere 1978  – 1983 Luigi Einaudi - Verona Diploma Perito Aziendale e Corrispondente in Lingue Estere 1978  – 1983 ", "Summary Perfil realizado por IBM Watson Personality Insights: \n \nCarolina es audaz, analítica y creativa. Le interesan las nuevas experiencias y desafíos profesionales que le brindan una sensación de auto-expresión. Es imaginativa, cualidad que aplica en su trabajo diario para crear nuevas maneras de comunicar, en prensa y redes sociales. Su curiosidad la impulsa a aprender sobre diversos temas a la vez y comprender su impacto en los negocios. Para Carolina, alcanzar el éxito la guía en gran parte de lo que hace, busca oportunidades para auto-superarse y demostrar que es una persona capaz. Es relativamente indiferente a las tradiciones, le importa seguir su propio camino. Además es empática, siente lo que otros sienten y es compasiva con ellos. \n \nCreá el tuyo: https://watson-pi-demo.mybluemix.net Summary Perfil realizado por IBM Watson Personality Insights: \n \nCarolina es audaz, analítica y creativa. Le interesan las nuevas experiencias y desafíos profesionales que le brindan una sensación de auto-expresión. Es imaginativa, cualidad que aplica en su trabajo diario para crear nuevas maneras de comunicar, en prensa y redes sociales. Su curiosidad la impulsa a aprender sobre diversos temas a la vez y comprender su impacto en los negocios. Para Carolina, alcanzar el éxito la guía en gran parte de lo que hace, busca oportunidades para auto-superarse y demostrar que es una persona capaz. Es relativamente indiferente a las tradiciones, le importa seguir su propio camino. Además es empática, siente lo que otros sienten y es compasiva con ellos. \n \nCreá el tuyo: https://watson-pi-demo.mybluemix.net Perfil realizado por IBM Watson Personality Insights: \n \nCarolina es audaz, analítica y creativa. Le interesan las nuevas experiencias y desafíos profesionales que le brindan una sensación de auto-expresión. Es imaginativa, cualidad que aplica en su trabajo diario para crear nuevas maneras de comunicar, en prensa y redes sociales. Su curiosidad la impulsa a aprender sobre diversos temas a la vez y comprender su impacto en los negocios. Para Carolina, alcanzar el éxito la guía en gran parte de lo que hace, busca oportunidades para auto-superarse y demostrar que es una persona capaz. Es relativamente indiferente a las tradiciones, le importa seguir su propio camino. Además es empática, siente lo que otros sienten y es compasiva con ellos. \n \nCreá el tuyo: https://watson-pi-demo.mybluemix.net Perfil realizado por IBM Watson Personality Insights: \n \nCarolina es audaz, analítica y creativa. Le interesan las nuevas experiencias y desafíos profesionales que le brindan una sensación de auto-expresión. Es imaginativa, cualidad que aplica en su trabajo diario para crear nuevas maneras de comunicar, en prensa y redes sociales. Su curiosidad la impulsa a aprender sobre diversos temas a la vez y comprender su impacto en los negocios. Para Carolina, alcanzar el éxito la guía en gran parte de lo que hace, busca oportunidades para auto-superarse y demostrar que es una persona capaz. Es relativamente indiferente a las tradiciones, le importa seguir su propio camino. Además es empática, siente lo que otros sienten y es compasiva con ellos. \n \nCreá el tuyo: https://watson-pi-demo.mybluemix.net Skills Marketing Communications Corporate Communications Spanish Community Management Social Media Internal Communications Public Relations Media Relations English Digital Marketing Social Media Marketing Journalism Web 2.0 Strategic Communications Corporate Social... Team Leadership Marketing Strategy Blogging Strategic Planning Marketing Brand Strategy  Relaciones públicas Español Inglés Relaciones con los... Comunicaciones... Periodismo Redes sociales Comunicaciones internas Comunicaciones de... See 15+     See less Skills  Marketing Communications Corporate Communications Spanish Community Management Social Media Internal Communications Public Relations Media Relations English Digital Marketing Social Media Marketing Journalism Web 2.0 Strategic Communications Corporate Social... Team Leadership Marketing Strategy Blogging Strategic Planning Marketing Brand Strategy  Relaciones públicas Español Inglés Relaciones con los... Comunicaciones... Periodismo Redes sociales Comunicaciones internas Comunicaciones de... See 15+     See less Marketing Communications Corporate Communications Spanish Community Management Social Media Internal Communications Public Relations Media Relations English Digital Marketing Social Media Marketing Journalism Web 2.0 Strategic Communications Corporate Social... Team Leadership Marketing Strategy Blogging Strategic Planning Marketing Brand Strategy  Relaciones públicas Español Inglés Relaciones con los... Comunicaciones... Periodismo Redes sociales Comunicaciones internas Comunicaciones de... See 15+     See less Marketing Communications Corporate Communications Spanish Community Management Social Media Internal Communications Public Relations Media Relations English Digital Marketing Social Media Marketing Journalism Web 2.0 Strategic Communications Corporate Social... Team Leadership Marketing Strategy Blogging Strategic Planning Marketing Brand Strategy  Relaciones públicas Español Inglés Relaciones con los... Comunicaciones... Periodismo Redes sociales Comunicaciones internas Comunicaciones de... See 15+     See less "]}