{"position": "Facilities Mechanical Engineer", "company": "Intel Corporation", "profiles": ["Experience Mechanical Designer Peters Engineering - Mechanical Electrical and Plumbing May 2015  – Present (4 months) Sacramento, CA Facilities Mechanical Engineer Intel Corporation June 2014  –  May 2015  (1 year) Santa Clara, CA Facilities Mechanical Engineer Intel Corporation June 2013  –  May 2014  (1 year) Folsom, CA Mechanical Designer Peters Engineering - Mechanical Electrical and Plumbing May 2015  – Present (4 months) Sacramento, CA Mechanical Designer Peters Engineering - Mechanical Electrical and Plumbing May 2015  – Present (4 months) Sacramento, CA Facilities Mechanical Engineer Intel Corporation June 2014  –  May 2015  (1 year) Santa Clara, CA Facilities Mechanical Engineer Intel Corporation June 2014  –  May 2015  (1 year) Santa Clara, CA Facilities Mechanical Engineer Intel Corporation June 2013  –  May 2014  (1 year) Folsom, CA Facilities Mechanical Engineer Intel Corporation June 2013  –  May 2014  (1 year) Folsom, CA Skills Mechanical Engineering AutoCAD Mechanical Trane Trace 700 Title 24 Sustainability HVAC Energy Conservation Heat Transfer Skills  Mechanical Engineering AutoCAD Mechanical Trane Trace 700 Title 24 Sustainability HVAC Energy Conservation Heat Transfer Mechanical Engineering AutoCAD Mechanical Trane Trace 700 Title 24 Sustainability HVAC Energy Conservation Heat Transfer Mechanical Engineering AutoCAD Mechanical Trane Trace 700 Title 24 Sustainability HVAC Energy Conservation Heat Transfer Education California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2008  – 2013 Activities and Societies:  ASHRAE ,  Week of Orientation Leader California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2008  – 2013 Activities and Societies:  ASHRAE ,  Week of Orientation Leader California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2008  – 2013 Activities and Societies:  ASHRAE ,  Week of Orientation Leader California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2008  – 2013 Activities and Societies:  ASHRAE ,  Week of Orientation Leader ", "Experience Facilities Mechanical Engineer Intel Corporation June 2012  – Present (3 years 3 months) Hillsboro, OR Technical Sales Intern Ashland Hercules Water Technologies June 2011  –  August 2011  (3 months) New York, NY Energy Project Engineer Co-op Boise Inc. October 2010  –  March 2011  (6 months) St. Helens, OR Worked jointly with the Energy Trust of Oregon (ETO) & Cascade Energy Engineering at the Boise, St. Helens facility. Technical Sales Intern Ashland Hercules Water Technologies June 2010  –  September 2010  (4 months) Evansville, IN Process Engineer Intern Nippon Paper Industries USA June 2009  –  September 2009  (4 months) Port Angeles, WA Research & Development Intern Sharp Electronics June 2007  –  September 2007  (4 months) Camas, WA Facilities Mechanical Engineer Intel Corporation June 2012  – Present (3 years 3 months) Hillsboro, OR Facilities Mechanical Engineer Intel Corporation June 2012  – Present (3 years 3 months) Hillsboro, OR Technical Sales Intern Ashland Hercules Water Technologies June 2011  –  August 2011  (3 months) New York, NY Technical Sales Intern Ashland Hercules Water Technologies June 2011  –  August 2011  (3 months) New York, NY Energy Project Engineer Co-op Boise Inc. October 2010  –  March 2011  (6 months) St. Helens, OR Worked jointly with the Energy Trust of Oregon (ETO) & Cascade Energy Engineering at the Boise, St. Helens facility. Energy Project Engineer Co-op Boise Inc. October 2010  –  March 2011  (6 months) St. Helens, OR Worked jointly with the Energy Trust of Oregon (ETO) & Cascade Energy Engineering at the Boise, St. Helens facility. Technical Sales Intern Ashland Hercules Water Technologies June 2010  –  September 2010  (4 months) Evansville, IN Technical Sales Intern Ashland Hercules Water Technologies June 2010  –  September 2010  (4 months) Evansville, IN Process Engineer Intern Nippon Paper Industries USA June 2009  –  September 2009  (4 months) Port Angeles, WA Process Engineer Intern Nippon Paper Industries USA June 2009  –  September 2009  (4 months) Port Angeles, WA Research & Development Intern Sharp Electronics June 2007  –  September 2007  (4 months) Camas, WA Research & Development Intern Sharp Electronics June 2007  –  September 2007  (4 months) Camas, WA Skills Chemical Engineering Design of Experiments Process Engineering Process Simulation Process Optimization Engineering Product Development Root Cause Analysis Manufacturing Energy Lean Manufacturing Minitab Six Sigma R&D Matlab Cross-functional Team... Microsoft Office See 2+     See less Skills  Chemical Engineering Design of Experiments Process Engineering Process Simulation Process Optimization Engineering Product Development Root Cause Analysis Manufacturing Energy Lean Manufacturing Minitab Six Sigma R&D Matlab Cross-functional Team... Microsoft Office See 2+     See less Chemical Engineering Design of Experiments Process Engineering Process Simulation Process Optimization Engineering Product Development Root Cause Analysis Manufacturing Energy Lean Manufacturing Minitab Six Sigma R&D Matlab Cross-functional Team... Microsoft Office See 2+     See less Chemical Engineering Design of Experiments Process Engineering Process Simulation Process Optimization Engineering Product Development Root Cause Analysis Manufacturing Energy Lean Manufacturing Minitab Six Sigma R&D Matlab Cross-functional Team... Microsoft Office See 2+     See less Education University of Washington BS,  Bioresource Science & Engineering 2007  – 2012 Activities and Societies:  Society of Women Engineers ,  TAPPI University of Washington BS,  Bioresource Science & Engineering 2007  – 2012 Activities and Societies:  Society of Women Engineers ,  TAPPI University of Washington BS,  Bioresource Science & Engineering 2007  – 2012 Activities and Societies:  Society of Women Engineers ,  TAPPI University of Washington BS,  Bioresource Science & Engineering 2007  – 2012 Activities and Societies:  Society of Women Engineers ,  TAPPI ", "Experience Fire Protection Engineer Vanderweil Engineers July 2013  – Present (2 years 2 months) Boston Engineering of active fire protection and fire alarm systems for diverse building types including high rises, data centers and commercial buildings. Graduate Student Worcester Polytechnic Institute September 2012  –  2014  (2 years) Worcester, Massachusetts Specialize in Fire Protection Systems, Advanced Suppression, Performance Based Design, Building and Fire Safety, Detection, Alarm & Smoke Control, Fire Dynamics, Fire Modeling, Fire & Materials, Fire Safety Analysis and Forensic Analysis. Facilities Mechanical Engineer Intel Corporation June 2012  –  January 2013  (8 months) Hudson Ma Provide Facilities engineering leadership to the site organizations in support of Safety, Reliability, Quality, Environmental and Cost objectives. Responsibilities include: Owning safety within area of influence; ensuring systems operate reliably to avoid manufacturing/facility (or operations) impacts by meeting uptime goals; overlooking projects to meet design criteria, scope, budget, and schedule; oversight of planning, design, reconfiguration, construction, maintenance, and modifications to equipment, machinery, facilities systems, buildings, and structures as required to support business requirements; delivering operational efficiency, maintenance, testing and commissioning solutions; effective collaboration with construction and operations teams to coordinate work in the field; identify and implement opportunities to achieve lowest cost of ownership to key stakeholders while maintaining reliability. Results are delivered through the application of engineering skills and tools; systematic problem solving; statistical validation of system performance; collaboration with the Site Facility management team, suppliers, key stakeholders and through in-depth understanding of the operating systems to determine and ensure compliance to existing standards, specifications, building codes, and processes. Fire Protection Engineer Vanderweil Engineers July 2013  – Present (2 years 2 months) Boston Engineering of active fire protection and fire alarm systems for diverse building types including high rises, data centers and commercial buildings. Fire Protection Engineer Vanderweil Engineers July 2013  – Present (2 years 2 months) Boston Engineering of active fire protection and fire alarm systems for diverse building types including high rises, data centers and commercial buildings. Graduate Student Worcester Polytechnic Institute September 2012  –  2014  (2 years) Worcester, Massachusetts Specialize in Fire Protection Systems, Advanced Suppression, Performance Based Design, Building and Fire Safety, Detection, Alarm & Smoke Control, Fire Dynamics, Fire Modeling, Fire & Materials, Fire Safety Analysis and Forensic Analysis. Graduate Student Worcester Polytechnic Institute September 2012  –  2014  (2 years) Worcester, Massachusetts Specialize in Fire Protection Systems, Advanced Suppression, Performance Based Design, Building and Fire Safety, Detection, Alarm & Smoke Control, Fire Dynamics, Fire Modeling, Fire & Materials, Fire Safety Analysis and Forensic Analysis. Facilities Mechanical Engineer Intel Corporation June 2012  –  January 2013  (8 months) Hudson Ma Provide Facilities engineering leadership to the site organizations in support of Safety, Reliability, Quality, Environmental and Cost objectives. Responsibilities include: Owning safety within area of influence; ensuring systems operate reliably to avoid manufacturing/facility (or operations) impacts by meeting uptime goals; overlooking projects to meet design criteria, scope, budget, and schedule; oversight of planning, design, reconfiguration, construction, maintenance, and modifications to equipment, machinery, facilities systems, buildings, and structures as required to support business requirements; delivering operational efficiency, maintenance, testing and commissioning solutions; effective collaboration with construction and operations teams to coordinate work in the field; identify and implement opportunities to achieve lowest cost of ownership to key stakeholders while maintaining reliability. Results are delivered through the application of engineering skills and tools; systematic problem solving; statistical validation of system performance; collaboration with the Site Facility management team, suppliers, key stakeholders and through in-depth understanding of the operating systems to determine and ensure compliance to existing standards, specifications, building codes, and processes. Facilities Mechanical Engineer Intel Corporation June 2012  –  January 2013  (8 months) Hudson Ma Provide Facilities engineering leadership to the site organizations in support of Safety, Reliability, Quality, Environmental and Cost objectives. Responsibilities include: Owning safety within area of influence; ensuring systems operate reliably to avoid manufacturing/facility (or operations) impacts by meeting uptime goals; overlooking projects to meet design criteria, scope, budget, and schedule; oversight of planning, design, reconfiguration, construction, maintenance, and modifications to equipment, machinery, facilities systems, buildings, and structures as required to support business requirements; delivering operational efficiency, maintenance, testing and commissioning solutions; effective collaboration with construction and operations teams to coordinate work in the field; identify and implement opportunities to achieve lowest cost of ownership to key stakeholders while maintaining reliability. Results are delivered through the application of engineering skills and tools; systematic problem solving; statistical validation of system performance; collaboration with the Site Facility management team, suppliers, key stakeholders and through in-depth understanding of the operating systems to determine and ensure compliance to existing standards, specifications, building codes, and processes. Skills Revit AutoCAD PyroSim Pathfinder Fire Dynamics Simulator... Engineering HydraCALC Lean Thinking Mechanical Engineering Technical Writing Leadership MathCAD Solid Works Labview Solidworks Testing Commissioning See 2+     See less Skills  Revit AutoCAD PyroSim Pathfinder Fire Dynamics Simulator... Engineering HydraCALC Lean Thinking Mechanical Engineering Technical Writing Leadership MathCAD Solid Works Labview Solidworks Testing Commissioning See 2+     See less Revit AutoCAD PyroSim Pathfinder Fire Dynamics Simulator... Engineering HydraCALC Lean Thinking Mechanical Engineering Technical Writing Leadership MathCAD Solid Works Labview Solidworks Testing Commissioning See 2+     See less Revit AutoCAD PyroSim Pathfinder Fire Dynamics Simulator... Engineering HydraCALC Lean Thinking Mechanical Engineering Technical Writing Leadership MathCAD Solid Works Labview Solidworks Testing Commissioning See 2+     See less Education Worcester Polytechnic Institute Master's Degree,  Fire Protection Engineering 2012  – 2014 One of two graduate level fire engineering programs in the country, WPI Fire Protection Engineering has driven more research, developed more real-world solutions, and graduated more in-demand experts in the last 30 years. \n \nWhether performing risk analyses with architects, engineering safer ships, investigating explosions, or influencing regulations around the world, fire protection engineers are working in this heroic science to save lives. Protecting our increasingly crowded world from the risk of fire means diving into a stimulating mix of engineering disciplines, mathematics, computer science, and even psychology. \n \n \nSpecialize in Fire Protection Systems, Advanced Suppression, Performance Based Design, Building and Fire Safety, Alarm & Smoke Control, Fire Dynamics, Fire Modeling, Fire & Materials, Fire Safety Analysis and Forensic Analysis. Worcester Polytechnic Institute Bachelor of Science (BS),  Mechanical Engineering 2008  – 2012 Worcester Polytechnic Institute Master's Degree,  Fire Protection Engineering 2012  – 2014 One of two graduate level fire engineering programs in the country, WPI Fire Protection Engineering has driven more research, developed more real-world solutions, and graduated more in-demand experts in the last 30 years. \n \nWhether performing risk analyses with architects, engineering safer ships, investigating explosions, or influencing regulations around the world, fire protection engineers are working in this heroic science to save lives. Protecting our increasingly crowded world from the risk of fire means diving into a stimulating mix of engineering disciplines, mathematics, computer science, and even psychology. \n \n \nSpecialize in Fire Protection Systems, Advanced Suppression, Performance Based Design, Building and Fire Safety, Alarm & Smoke Control, Fire Dynamics, Fire Modeling, Fire & Materials, Fire Safety Analysis and Forensic Analysis. Worcester Polytechnic Institute Master's Degree,  Fire Protection Engineering 2012  – 2014 One of two graduate level fire engineering programs in the country, WPI Fire Protection Engineering has driven more research, developed more real-world solutions, and graduated more in-demand experts in the last 30 years. \n \nWhether performing risk analyses with architects, engineering safer ships, investigating explosions, or influencing regulations around the world, fire protection engineers are working in this heroic science to save lives. Protecting our increasingly crowded world from the risk of fire means diving into a stimulating mix of engineering disciplines, mathematics, computer science, and even psychology. \n \n \nSpecialize in Fire Protection Systems, Advanced Suppression, Performance Based Design, Building and Fire Safety, Alarm & Smoke Control, Fire Dynamics, Fire Modeling, Fire & Materials, Fire Safety Analysis and Forensic Analysis. Worcester Polytechnic Institute Master's Degree,  Fire Protection Engineering 2012  – 2014 One of two graduate level fire engineering programs in the country, WPI Fire Protection Engineering has driven more research, developed more real-world solutions, and graduated more in-demand experts in the last 30 years. \n \nWhether performing risk analyses with architects, engineering safer ships, investigating explosions, or influencing regulations around the world, fire protection engineers are working in this heroic science to save lives. Protecting our increasingly crowded world from the risk of fire means diving into a stimulating mix of engineering disciplines, mathematics, computer science, and even psychology. \n \n \nSpecialize in Fire Protection Systems, Advanced Suppression, Performance Based Design, Building and Fire Safety, Alarm & Smoke Control, Fire Dynamics, Fire Modeling, Fire & Materials, Fire Safety Analysis and Forensic Analysis. Worcester Polytechnic Institute Bachelor of Science (BS),  Mechanical Engineering 2008  – 2012 Worcester Polytechnic Institute Bachelor of Science (BS),  Mechanical Engineering 2008  – 2012 Worcester Polytechnic Institute Bachelor of Science (BS),  Mechanical Engineering 2008  – 2012 ", "Summary Highly motivated Facilities Engineering professional with key knowledge and experience in the areas of facilities mechanical systems and energy conservation. \n \nResults oriented self-starter with strong analytical and problem-solving skills. Ability to take an overall systems view to assess and improve operating efficiency of a mechanical system.  \n \nBegan working career installing and servicing HVAC equipment following Tech School. Hired by Digital Equipment as an HVAC Technician then moved into Project Management and Engineering positions while achieving BSME at night.  \n \nMoved to Digital Hudson site as Project Manager and was soon recruited into a Mechanical Engineering role for the expansion of the Semiconductor Fab. Currently Facilities Sr. Mechanical Engineer for Intel in the same location. \n \nAchieved the Association for Facilities Engineering \"Certified Plant Engineer\" (CPE) and \"Certified Professional Maintenance Manager\" (CPMM) accreditations, as well as the Association of Energy Engineers \"Certified Energy Manager\" (CEM). \n \nStrong interest in Energy Conservation and an active member of the Intel Global Energy Team for ~10 years, leading efforts to reduce the Hudson site's annual energy costs by ~$6m in that role.  \n \nI come from a Family of 5 children, and I am proud to say I have a wonderful Wife, 3 Sons, and 3 Grandsons to love and enjoy life with. Summary Highly motivated Facilities Engineering professional with key knowledge and experience in the areas of facilities mechanical systems and energy conservation. \n \nResults oriented self-starter with strong analytical and problem-solving skills. Ability to take an overall systems view to assess and improve operating efficiency of a mechanical system.  \n \nBegan working career installing and servicing HVAC equipment following Tech School. Hired by Digital Equipment as an HVAC Technician then moved into Project Management and Engineering positions while achieving BSME at night.  \n \nMoved to Digital Hudson site as Project Manager and was soon recruited into a Mechanical Engineering role for the expansion of the Semiconductor Fab. Currently Facilities Sr. Mechanical Engineer for Intel in the same location. \n \nAchieved the Association for Facilities Engineering \"Certified Plant Engineer\" (CPE) and \"Certified Professional Maintenance Manager\" (CPMM) accreditations, as well as the Association of Energy Engineers \"Certified Energy Manager\" (CEM). \n \nStrong interest in Energy Conservation and an active member of the Intel Global Energy Team for ~10 years, leading efforts to reduce the Hudson site's annual energy costs by ~$6m in that role.  \n \nI come from a Family of 5 children, and I am proud to say I have a wonderful Wife, 3 Sons, and 3 Grandsons to love and enjoy life with. Highly motivated Facilities Engineering professional with key knowledge and experience in the areas of facilities mechanical systems and energy conservation. \n \nResults oriented self-starter with strong analytical and problem-solving skills. Ability to take an overall systems view to assess and improve operating efficiency of a mechanical system.  \n \nBegan working career installing and servicing HVAC equipment following Tech School. Hired by Digital Equipment as an HVAC Technician then moved into Project Management and Engineering positions while achieving BSME at night.  \n \nMoved to Digital Hudson site as Project Manager and was soon recruited into a Mechanical Engineering role for the expansion of the Semiconductor Fab. Currently Facilities Sr. Mechanical Engineer for Intel in the same location. \n \nAchieved the Association for Facilities Engineering \"Certified Plant Engineer\" (CPE) and \"Certified Professional Maintenance Manager\" (CPMM) accreditations, as well as the Association of Energy Engineers \"Certified Energy Manager\" (CEM). \n \nStrong interest in Energy Conservation and an active member of the Intel Global Energy Team for ~10 years, leading efforts to reduce the Hudson site's annual energy costs by ~$6m in that role.  \n \nI come from a Family of 5 children, and I am proud to say I have a wonderful Wife, 3 Sons, and 3 Grandsons to love and enjoy life with. Highly motivated Facilities Engineering professional with key knowledge and experience in the areas of facilities mechanical systems and energy conservation. \n \nResults oriented self-starter with strong analytical and problem-solving skills. Ability to take an overall systems view to assess and improve operating efficiency of a mechanical system.  \n \nBegan working career installing and servicing HVAC equipment following Tech School. Hired by Digital Equipment as an HVAC Technician then moved into Project Management and Engineering positions while achieving BSME at night.  \n \nMoved to Digital Hudson site as Project Manager and was soon recruited into a Mechanical Engineering role for the expansion of the Semiconductor Fab. Currently Facilities Sr. Mechanical Engineer for Intel in the same location. \n \nAchieved the Association for Facilities Engineering \"Certified Plant Engineer\" (CPE) and \"Certified Professional Maintenance Manager\" (CPMM) accreditations, as well as the Association of Energy Engineers \"Certified Energy Manager\" (CEM). \n \nStrong interest in Energy Conservation and an active member of the Intel Global Energy Team for ~10 years, leading efforts to reduce the Hudson site's annual energy costs by ~$6m in that role.  \n \nI come from a Family of 5 children, and I am proud to say I have a wonderful Wife, 3 Sons, and 3 Grandsons to love and enjoy life with. Experience FACILITIES SENIOR MECHANICAL ENGINEER Intel Corporation 1998  – Present (17 years) Hudson Ma. Primary engineering responsibility for all dry mechanical systems, including make-up and recirculation air systems for a 100k sq. ft. Class-1 cleanroom, process exhaust, and all HVAC systems serving support areas, labs, data centers, and general office space throughout the 1.3m sq.ft. multi-building campus.  \n \nCurrent responsibilities are highly focused on sustaining engineering duties such as daily review of mechanical system issues/alarms, reliability improvement, work plan creation and review, development of system operating sequences and procedures, and optimization of system efficiency for energy reduction. Develop annual maintenance/repair budgets. Lead incident investigations for root cause determination and implementation of corrective measures. \n \nIntel Global Energy Conservation Team site leader, with responsibility to drive innovative project solutions to achieve Hudson site energy reduction targets (typ. $500K - $1m annual savings).  \n \nProject support responsibilities include scope of work development, engineering design guidance and review, field issue resolution, punch list generation, and commissioning acceptance.  \n \nHudson site fire protection system engineering owner with responsibilities for ensuring all systems are in good working order and all required testing and inspections are completed as required. \n \nStrong emphasis on safety with values engrained from intensive Intel training and day to day safety focus due to the inherent hazards associated with Semiconductor Manufacturing. FACILITIES SENIOR MECHANICAL ENGINEER Intel Corporation 1998  – Present (17 years) Hudson Ma. Primary engineering responsibility for all dry mechanical systems, including make-up and recirculation air systems for a 100k sq. ft. Class-1 cleanroom, process exhaust, and all HVAC systems serving support areas, labs, data centers, and general office space throughout the 1.3m sq.ft. multi-building campus.  \n \nCurrent responsibilities are highly focused on sustaining engineering duties such as daily review of mechanical system issues/alarms, reliability improvement, work plan creation and review, development of system operating sequences and procedures, and optimization of system efficiency for energy reduction. Develop annual maintenance/repair budgets. Lead incident investigations for root cause determination and implementation of corrective measures. \n \nIntel Global Energy Conservation Team site leader, with responsibility to drive innovative project solutions to achieve Hudson site energy reduction targets (typ. $500K - $1m annual savings).  \n \nProject support responsibilities include scope of work development, engineering design guidance and review, field issue resolution, punch list generation, and commissioning acceptance.  \n \nHudson site fire protection system engineering owner with responsibilities for ensuring all systems are in good working order and all required testing and inspections are completed as required. \n \nStrong emphasis on safety with values engrained from intensive Intel training and day to day safety focus due to the inherent hazards associated with Semiconductor Manufacturing. FACILITIES SENIOR MECHANICAL ENGINEER Intel Corporation 1998  – Present (17 years) Hudson Ma. Primary engineering responsibility for all dry mechanical systems, including make-up and recirculation air systems for a 100k sq. ft. Class-1 cleanroom, process exhaust, and all HVAC systems serving support areas, labs, data centers, and general office space throughout the 1.3m sq.ft. multi-building campus.  \n \nCurrent responsibilities are highly focused on sustaining engineering duties such as daily review of mechanical system issues/alarms, reliability improvement, work plan creation and review, development of system operating sequences and procedures, and optimization of system efficiency for energy reduction. Develop annual maintenance/repair budgets. Lead incident investigations for root cause determination and implementation of corrective measures. \n \nIntel Global Energy Conservation Team site leader, with responsibility to drive innovative project solutions to achieve Hudson site energy reduction targets (typ. $500K - $1m annual savings).  \n \nProject support responsibilities include scope of work development, engineering design guidance and review, field issue resolution, punch list generation, and commissioning acceptance.  \n \nHudson site fire protection system engineering owner with responsibilities for ensuring all systems are in good working order and all required testing and inspections are completed as required. \n \nStrong emphasis on safety with values engrained from intensive Intel training and day to day safety focus due to the inherent hazards associated with Semiconductor Manufacturing. Skills SPC Semiconductors Manufacturing Engineering Failure Analysis Design of Experiments Engineering Management HVAC Energy Conservation Process Engineering Automation Facilities Management Preventive Maintenance Electrical Engineering JMP Solar Energy Electronics Photovoltaics Semiconductor Industry Manufacturing... Metrology Process Control Electricians Root Cause Analysis FMEA Lean Manufacturing Mechanical Engineering Continuous Improvement Energy Management Maintenance Management Project Engineering See 16+     See less Skills  SPC Semiconductors Manufacturing Engineering Failure Analysis Design of Experiments Engineering Management HVAC Energy Conservation Process Engineering Automation Facilities Management Preventive Maintenance Electrical Engineering JMP Solar Energy Electronics Photovoltaics Semiconductor Industry Manufacturing... Metrology Process Control Electricians Root Cause Analysis FMEA Lean Manufacturing Mechanical Engineering Continuous Improvement Energy Management Maintenance Management Project Engineering See 16+     See less SPC Semiconductors Manufacturing Engineering Failure Analysis Design of Experiments Engineering Management HVAC Energy Conservation Process Engineering Automation Facilities Management Preventive Maintenance Electrical Engineering JMP Solar Energy Electronics Photovoltaics Semiconductor Industry Manufacturing... Metrology Process Control Electricians Root Cause Analysis FMEA Lean Manufacturing Mechanical Engineering Continuous Improvement Energy Management Maintenance Management Project Engineering See 16+     See less SPC Semiconductors Manufacturing Engineering Failure Analysis Design of Experiments Engineering Management HVAC Energy Conservation Process Engineering Automation Facilities Management Preventive Maintenance Electrical Engineering JMP Solar Energy Electronics Photovoltaics Semiconductor Industry Manufacturing... Metrology Process Control Electricians Root Cause Analysis FMEA Lean Manufacturing Mechanical Engineering Continuous Improvement Energy Management Maintenance Management Project Engineering See 16+     See less Education Johnson & Wales School of Technology, Worcester, MA Bachelor of Science Johnson & Wales School of Technology, Worcester, MA Bachelor of Science Johnson & Wales School of Technology, Worcester, MA Bachelor of Science Johnson & Wales School of Technology, Worcester, MA Bachelor of Science ", "Experience Facilities Mechanical Engineer Intel Corporation May 2013  – Present (2 years 4 months) Penang, Malaysia Responsibilities: \n-\tEnsuring systems operate reliably to avoid manufacturing/ facility (or operations) impacts by meeting uptime goals. \n-\tOverseeing projects to meet design criteria, scope, budget, and schedule; oversight of planning, design, reconfiguration, construction, maintenance, and modifications to equipment, machinery, facilities systems, buildings, and structures as required to support business requirements. \n-\tDelivering operational efficiency, maintenance, testing and commissioning solutions; effective collaboration with construction and operations teams to coordinate work in the field; identify and implement opportunities to achieve lowest cost of ownership to key stakeholders while maintaining reliability. \n \nAdditional portfolio: Energy Conservation Engineer \n \nResponsibilities: \n-\tProviding energy efficiency advice and training. \n-\tLiaising with contractors, facility engineer and operator and customers. \n-\tDeveloping, implementing and monitoring energy consumption reduction policies and strategies. \n-\tAnalyzing data and collating information. \n-\tMaintaining accurate records. \n-\tWriting plans and reports. \n-\tUndertaking energy surveys/site inspections. \n-\tKeeping up to date with changes in legislation and initiatives. \n-\tPromoting energy conservation awareness via events such as presentations, workshops and conservation projects and company newsletter. Project & Application Engineer BICT Engineering Sdn Bhd October 2011  –  April 2013  (1 year 7 months) Penang, Malaysia Responsibilities: \n \n-\tEvaluate, organise and priortise workload within a schedule. \n-\tLiaise with customers on a regular basis to ensure the successful design and manufacture of products to agreed budgets. \n-\tInterpret clients’ requirements. \n-\tTake responsibility for a team of engineers. \n-\tManaging changes of requests. \n-\tInvestigating problems and complaints. \n-\tProvide technical support to the project team and wider regional teams. \n-\tResponsible for overseeing the review, initiation and execution of contracts. \n-\tManaging project budgets and keeping costs down. \n-\tResponsible for the completion of all documentation. \n-\tProducing Test Plans and reports. \n-\tWrite programming to the project eg. PLC, BMS programming. \n \n \nProject:  \n- Legoland Malaysia (Leader & Programmer) \n- Escape Penang (Leader & Programmer) \n- Osram Penang (Leader & Programmer) \n- Altera Penang (Leader & Programmer) \n- First Solar Kulim & USA (Programmer) Area Supervisor Grey Two Sdn. Bhd January 2009  –  September 2010  (1 year 9 months) Penang, Malaysia 1) Pre-Execution \n2) Collect props from G2 Activation team. \n3) Proactively check with AE for any changes/updates.  \n4) Ensure all BAs have store letters.  \n5) Call each BA to recap objectives, target, update changes, reinforce attendance and punctuality as well as test them on product knowledge and demo spiel.  \n6) Call store managers to remind them of G2 BAs coming in.  \n7) Execution \n8) Ensure BA attendance and punctuality 1 hour prior to working hour. Inform G2 immediately if the BA is on MC or no-show.  \n9) Report all issues and recommended solutions (where possible) to G2.  \n10) You must conduct store checks and ensure BAs performance through their communication of key messages and mechanics.  \n11) Motivate, train and coach BAs to achieve sales target \n12) Required to secure the location and build relationship with store managers.  \n13) Post Execution  \n14) Responsible for the completion and collection of the daily report by the BAs.  \n15) Responsible to submit the completed daily report (with pictures), feedback/score card, incident report, sell in letter and competitive report by every Monday before 12noon after the execution each week. Facilities Mechanical Engineer Intel Corporation May 2013  – Present (2 years 4 months) Penang, Malaysia Responsibilities: \n-\tEnsuring systems operate reliably to avoid manufacturing/ facility (or operations) impacts by meeting uptime goals. \n-\tOverseeing projects to meet design criteria, scope, budget, and schedule; oversight of planning, design, reconfiguration, construction, maintenance, and modifications to equipment, machinery, facilities systems, buildings, and structures as required to support business requirements. \n-\tDelivering operational efficiency, maintenance, testing and commissioning solutions; effective collaboration with construction and operations teams to coordinate work in the field; identify and implement opportunities to achieve lowest cost of ownership to key stakeholders while maintaining reliability. \n \nAdditional portfolio: Energy Conservation Engineer \n \nResponsibilities: \n-\tProviding energy efficiency advice and training. \n-\tLiaising with contractors, facility engineer and operator and customers. \n-\tDeveloping, implementing and monitoring energy consumption reduction policies and strategies. \n-\tAnalyzing data and collating information. \n-\tMaintaining accurate records. \n-\tWriting plans and reports. \n-\tUndertaking energy surveys/site inspections. \n-\tKeeping up to date with changes in legislation and initiatives. \n-\tPromoting energy conservation awareness via events such as presentations, workshops and conservation projects and company newsletter. Facilities Mechanical Engineer Intel Corporation May 2013  – Present (2 years 4 months) Penang, Malaysia Responsibilities: \n-\tEnsuring systems operate reliably to avoid manufacturing/ facility (or operations) impacts by meeting uptime goals. \n-\tOverseeing projects to meet design criteria, scope, budget, and schedule; oversight of planning, design, reconfiguration, construction, maintenance, and modifications to equipment, machinery, facilities systems, buildings, and structures as required to support business requirements. \n-\tDelivering operational efficiency, maintenance, testing and commissioning solutions; effective collaboration with construction and operations teams to coordinate work in the field; identify and implement opportunities to achieve lowest cost of ownership to key stakeholders while maintaining reliability. \n \nAdditional portfolio: Energy Conservation Engineer \n \nResponsibilities: \n-\tProviding energy efficiency advice and training. \n-\tLiaising with contractors, facility engineer and operator and customers. \n-\tDeveloping, implementing and monitoring energy consumption reduction policies and strategies. \n-\tAnalyzing data and collating information. \n-\tMaintaining accurate records. \n-\tWriting plans and reports. \n-\tUndertaking energy surveys/site inspections. \n-\tKeeping up to date with changes in legislation and initiatives. \n-\tPromoting energy conservation awareness via events such as presentations, workshops and conservation projects and company newsletter. Project & Application Engineer BICT Engineering Sdn Bhd October 2011  –  April 2013  (1 year 7 months) Penang, Malaysia Responsibilities: \n \n-\tEvaluate, organise and priortise workload within a schedule. \n-\tLiaise with customers on a regular basis to ensure the successful design and manufacture of products to agreed budgets. \n-\tInterpret clients’ requirements. \n-\tTake responsibility for a team of engineers. \n-\tManaging changes of requests. \n-\tInvestigating problems and complaints. \n-\tProvide technical support to the project team and wider regional teams. \n-\tResponsible for overseeing the review, initiation and execution of contracts. \n-\tManaging project budgets and keeping costs down. \n-\tResponsible for the completion of all documentation. \n-\tProducing Test Plans and reports. \n-\tWrite programming to the project eg. PLC, BMS programming. \n \n \nProject:  \n- Legoland Malaysia (Leader & Programmer) \n- Escape Penang (Leader & Programmer) \n- Osram Penang (Leader & Programmer) \n- Altera Penang (Leader & Programmer) \n- First Solar Kulim & USA (Programmer) Project & Application Engineer BICT Engineering Sdn Bhd October 2011  –  April 2013  (1 year 7 months) Penang, Malaysia Responsibilities: \n \n-\tEvaluate, organise and priortise workload within a schedule. \n-\tLiaise with customers on a regular basis to ensure the successful design and manufacture of products to agreed budgets. \n-\tInterpret clients’ requirements. \n-\tTake responsibility for a team of engineers. \n-\tManaging changes of requests. \n-\tInvestigating problems and complaints. \n-\tProvide technical support to the project team and wider regional teams. \n-\tResponsible for overseeing the review, initiation and execution of contracts. \n-\tManaging project budgets and keeping costs down. \n-\tResponsible for the completion of all documentation. \n-\tProducing Test Plans and reports. \n-\tWrite programming to the project eg. PLC, BMS programming. \n \n \nProject:  \n- Legoland Malaysia (Leader & Programmer) \n- Escape Penang (Leader & Programmer) \n- Osram Penang (Leader & Programmer) \n- Altera Penang (Leader & Programmer) \n- First Solar Kulim & USA (Programmer) Area Supervisor Grey Two Sdn. Bhd January 2009  –  September 2010  (1 year 9 months) Penang, Malaysia 1) Pre-Execution \n2) Collect props from G2 Activation team. \n3) Proactively check with AE for any changes/updates.  \n4) Ensure all BAs have store letters.  \n5) Call each BA to recap objectives, target, update changes, reinforce attendance and punctuality as well as test them on product knowledge and demo spiel.  \n6) Call store managers to remind them of G2 BAs coming in.  \n7) Execution \n8) Ensure BA attendance and punctuality 1 hour prior to working hour. Inform G2 immediately if the BA is on MC or no-show.  \n9) Report all issues and recommended solutions (where possible) to G2.  \n10) You must conduct store checks and ensure BAs performance through their communication of key messages and mechanics.  \n11) Motivate, train and coach BAs to achieve sales target \n12) Required to secure the location and build relationship with store managers.  \n13) Post Execution  \n14) Responsible for the completion and collection of the daily report by the BAs.  \n15) Responsible to submit the completed daily report (with pictures), feedback/score card, incident report, sell in letter and competitive report by every Monday before 12noon after the execution each week. Area Supervisor Grey Two Sdn. Bhd January 2009  –  September 2010  (1 year 9 months) Penang, Malaysia 1) Pre-Execution \n2) Collect props from G2 Activation team. \n3) Proactively check with AE for any changes/updates.  \n4) Ensure all BAs have store letters.  \n5) Call each BA to recap objectives, target, update changes, reinforce attendance and punctuality as well as test them on product knowledge and demo spiel.  \n6) Call store managers to remind them of G2 BAs coming in.  \n7) Execution \n8) Ensure BA attendance and punctuality 1 hour prior to working hour. Inform G2 immediately if the BA is on MC or no-show.  \n9) Report all issues and recommended solutions (where possible) to G2.  \n10) You must conduct store checks and ensure BAs performance through their communication of key messages and mechanics.  \n11) Motivate, train and coach BAs to achieve sales target \n12) Required to secure the location and build relationship with store managers.  \n13) Post Execution  \n14) Responsible for the completion and collection of the daily report by the BAs.  \n15) Responsible to submit the completed daily report (with pictures), feedback/score card, incident report, sell in letter and competitive report by every Monday before 12noon after the execution each week. Languages English Professional working proficiency Chinese Native or bilingual proficiency Malay Professional working proficiency Hokkien Native or bilingual proficiency Cantonese Elementary proficiency English Professional working proficiency Chinese Native or bilingual proficiency Malay Professional working proficiency Hokkien Native or bilingual proficiency Cantonese Elementary proficiency English Professional working proficiency Chinese Native or bilingual proficiency Malay Professional working proficiency Hokkien Native or bilingual proficiency Cantonese Elementary proficiency Professional working proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Elementary proficiency Skills Customer Service Photoshop Microsoft Word Sales C++ Microsoft Office Testing Microsoft Excel PowerPoint Store Management Windows Outlook Budgets Team Leadership PLC Allen Bradley Energy Audits See 1+     See less Skills  Customer Service Photoshop Microsoft Word Sales C++ Microsoft Office Testing Microsoft Excel PowerPoint Store Management Windows Outlook Budgets Team Leadership PLC Allen Bradley Energy Audits See 1+     See less Customer Service Photoshop Microsoft Word Sales C++ Microsoft Office Testing Microsoft Excel PowerPoint Store Management Windows Outlook Budgets Team Leadership PLC Allen Bradley Energy Audits See 1+     See less Customer Service Photoshop Microsoft Word Sales C++ Microsoft Office Testing Microsoft Excel PowerPoint Store Management Windows Outlook Budgets Team Leadership PLC Allen Bradley Energy Audits See 1+     See less Education Staffordshire University Bachelor's Degree,  Mechatronics , Robotics, and Automation Engineering , Second Class Honours: 1st Division 2010  – 2011 Staffordshire University Bachelor's Degree,  Mechatronics , Robotics, and Automation Engineering , Second Class Honours: 1st Division 2010  – 2011 Staffordshire University Bachelor's Degree,  Mechatronics , Robotics, and Automation Engineering , Second Class Honours: 1st Division 2010  – 2011 Staffordshire University Bachelor's Degree,  Mechatronics , Robotics, and Automation Engineering , Second Class Honours: 1st Division 2010  – 2011 ", "Summary •\tUnited States Patent Attorney (Reg. No. 71764) and California Attorney (Bar No. 226537) \n•\tOver 10 years of legal experience and 13 years of engineering experience. \n•\tMasters in Engineering from Cal Poly, B.S. in Mechanical Engineering from Drexel University.  \n•\tNegotiated settlements experienced in mediations, arbitrations, trials, and filed and appeals.  \n•\tExperienced in preparing and responding to pleadings, discovery, motions, and depositions. \n•\tCurrently preparing patent applications for electrical, medical, and mechanical inventions. Summary •\tUnited States Patent Attorney (Reg. No. 71764) and California Attorney (Bar No. 226537) \n•\tOver 10 years of legal experience and 13 years of engineering experience. \n•\tMasters in Engineering from Cal Poly, B.S. in Mechanical Engineering from Drexel University.  \n•\tNegotiated settlements experienced in mediations, arbitrations, trials, and filed and appeals.  \n•\tExperienced in preparing and responding to pleadings, discovery, motions, and depositions. \n•\tCurrently preparing patent applications for electrical, medical, and mechanical inventions. •\tUnited States Patent Attorney (Reg. No. 71764) and California Attorney (Bar No. 226537) \n•\tOver 10 years of legal experience and 13 years of engineering experience. \n•\tMasters in Engineering from Cal Poly, B.S. in Mechanical Engineering from Drexel University.  \n•\tNegotiated settlements experienced in mediations, arbitrations, trials, and filed and appeals.  \n•\tExperienced in preparing and responding to pleadings, discovery, motions, and depositions. \n•\tCurrently preparing patent applications for electrical, medical, and mechanical inventions. •\tUnited States Patent Attorney (Reg. No. 71764) and California Attorney (Bar No. 226537) \n•\tOver 10 years of legal experience and 13 years of engineering experience. \n•\tMasters in Engineering from Cal Poly, B.S. in Mechanical Engineering from Drexel University.  \n•\tNegotiated settlements experienced in mediations, arbitrations, trials, and filed and appeals.  \n•\tExperienced in preparing and responding to pleadings, discovery, motions, and depositions. \n•\tCurrently preparing patent applications for electrical, medical, and mechanical inventions. Experience Legal Counsel Baja Construction Co. Inc. June 2014  – Present (1 year 3 months) Martinez, CA * Drafted contracts for the design and installation of support systems for solar panels. \n* Negotiated contract terms with owners and general contractors for design and construction work. \n* Prepared updates to contracts, proposals, releases, and employee handbook. \n* Reviewed customer’s proposed contract language and edited into final agreement. \n* Developed business relationships with customers by standardizing terms for future contracts. \n* Responded to subpoenas, and public entity inquiries. \n* Filed Mechanic’s Liens and claims on Payment Bonds to recover funds owed by customers. \n* Negotiated settlements on projects involving disputes regarding delays and additional work. \n* Analyzed software packages for licensing latest technological innovations. \n* Evaluated Non Disclosure Agreements. \n \n \n Senior Litigation Associate Pandell Law March 2010  –  June 2014  (4 years 4 months) Walnut Creek, CA •\tRepresented engineer in litigation involving his patent. \n•\tPrevailed on Motion for Summary Judgment for engineering client \n•\tRepresented architect in litigation involving his novel corrosion resistant design for indoor pool. \n•\tObtained dismissal for engineer for a nominal amount through a demurrer. \n•\tNegotiated nominal settlement for engineer after exposing weaknesses in plaintiff’s claims. Associate Attorney Brady, Vorwerck, Ryder & Caspino May 2009  –  March 2010  (11 months) Concord, CA •\tRepresented general contractor in litigation involving a new home project. \n•\tNegotiated many settlements for subcontractor clients in construction defect litigation. \n•\tRepresented and defended clients in numerous depositions. \n•\tSuccessfully brought motions to continue trial and to amend a cross-complaint. Associate Attorney Bradley, Curley, Asiano, Barrabee, & Gale February 2006  –  May 2009  (3 years 4 months) Larkspur, CA •\tDefended public entities through appeal in cases involving the American with Disabilities Act. \n•\tRepresented developers and general contractors in construction defect litigation. \n•\tExperienced in matters ranging from personal injuries, vehicle accidents, and alleged negligence. \n•\tExposed weakness in plaintiff’s case, which resulted in plaintiff’s demand being greatly reduced.  \n•\tNegotiated settlement of defective product claim to a fraction of the initial demand. \n•\tPrepared Motions for Summary Judgment to allow clients to settle for nominal amounts. Associate Attorney Law Offices of David W. Ginn February 2004  –  January 2006  (2 years) Walnut Creek, CA •\tExperience in bringing owner claims against contractors.  \n•\tDeveloped legal analysis and prepared mediation briefs for claims involving defective work, incomplete work, undisclosed defects, and delays. \n•\tDefended claims brought by contractors against public entities and private business owners. \n•\tPrepared legal analysis for claims involving change order disputes, design errors, and delays. \n•\tDeveloped claims against contractor, who performed defective work on public works project.  \n•\tPrepared exhibits for trial and acted as second chair at trial. Associate Attorney/ Paralegal Last & Faoro, Attorneys at Law June 2003  –  February 2004  (9 months) San Mateo, CA •\tBrought claims against contractors and owners for delays, disruptions, and coordination issues. \n•\tDefended claims brought by owner concerning work performed on a private construction project. \n•\tNegotiated settlements to cases for a small fraction of the claimed damages. Senior Facilities Engineer/ Project Manager Seagate Technology LLC January 1999  –  June 2003  (4 years 6 months) Milpitas, CA •\tManaged construction work on time and on budget for projects to expand a disk drive manufacturing facility by converting office area and a loading dock into a Class 100 clean room.  \n•\tManaged projects to install new manufacturing equipment, utilities, and conveyor systems. \n•\tPrepared Requests for Proposals detailing work for Architects and Engineers.  \n•\tReviewed bids, submittals, and Requests for Information.  \n•\tSupervised work, coordinated shutdowns, and negotiated change order proposals. Facilities/ Mechanical Engineer Intel Corporation January 1994  –  January 1999  (5 years 1 month) Santa Clara, CA •\tAssisted in optimizing the design of a new semiconductor manufacturing facility by evaluating the cost of design changes and benchmarking against competitors. \n•\tEstimated the capacity of existing utility systems from drawings, data sheets, on-site inspections, and interviews with system owners. \n•\tGenerated reports detailing the quantity, type, and cost of utilities for various projects. \n•\tSupervised four co-op students during each of their six-month co-op assignments. Engineer (Graduate Student Intern/ Co-op) Phillips Lab, United States Air Force March 1991  –  September 1993  (2 years 7 months) Edwards, CA •\tConducted tests on a high-pressure water system to simulate the spray patterns of a fuel and an oxidizer for the development of liquid rocket engine nozzles. \n•\tAssisted in designing a rocket test stand for testing liquid rocket engines. \n•\tRequested bids for work, reviewed proposals, and negotiated prices. Co-op Engineer (Student Intern) Sun Refining and Marketing March 1990  –  September 1990  (7 months) Philadelphia, PA •\tInspected mechanical systems to identify required maintenance work. \n•\tSupervised the progress of contractors. Compared work performed against the schedule. \n•\tOrdered replacement parts, supervised contractors, and reported on construction progress. Co-op Engineer (Student Intern) RCA/GE Aerospace June 1987  –  March 1989  (1 year 10 months) Camden, NJ •\tDirected environmental tests on electronic equipment to military specifications. \n•\tRecorded data, investigated failed tests, and wrote test plans and reports. Co-op Engineer (Student Intern) Bechtel Corporation September 1986  –  December 1986  (4 months) Delta, PA •\tLocated and identified equipment throughout the Peach Bottom Nuclear Power Plant. \n•\tAssisted in setting up a database for recording the repair history of facility equipment. Legal Counsel Baja Construction Co. Inc. June 2014  – Present (1 year 3 months) Martinez, CA * Drafted contracts for the design and installation of support systems for solar panels. \n* Negotiated contract terms with owners and general contractors for design and construction work. \n* Prepared updates to contracts, proposals, releases, and employee handbook. \n* Reviewed customer’s proposed contract language and edited into final agreement. \n* Developed business relationships with customers by standardizing terms for future contracts. \n* Responded to subpoenas, and public entity inquiries. \n* Filed Mechanic’s Liens and claims on Payment Bonds to recover funds owed by customers. \n* Negotiated settlements on projects involving disputes regarding delays and additional work. \n* Analyzed software packages for licensing latest technological innovations. \n* Evaluated Non Disclosure Agreements. \n \n \n Legal Counsel Baja Construction Co. Inc. June 2014  – Present (1 year 3 months) Martinez, CA * Drafted contracts for the design and installation of support systems for solar panels. \n* Negotiated contract terms with owners and general contractors for design and construction work. \n* Prepared updates to contracts, proposals, releases, and employee handbook. \n* Reviewed customer’s proposed contract language and edited into final agreement. \n* Developed business relationships with customers by standardizing terms for future contracts. \n* Responded to subpoenas, and public entity inquiries. \n* Filed Mechanic’s Liens and claims on Payment Bonds to recover funds owed by customers. \n* Negotiated settlements on projects involving disputes regarding delays and additional work. \n* Analyzed software packages for licensing latest technological innovations. \n* Evaluated Non Disclosure Agreements. \n \n \n Senior Litigation Associate Pandell Law March 2010  –  June 2014  (4 years 4 months) Walnut Creek, CA •\tRepresented engineer in litigation involving his patent. \n•\tPrevailed on Motion for Summary Judgment for engineering client \n•\tRepresented architect in litigation involving his novel corrosion resistant design for indoor pool. \n•\tObtained dismissal for engineer for a nominal amount through a demurrer. \n•\tNegotiated nominal settlement for engineer after exposing weaknesses in plaintiff’s claims. Senior Litigation Associate Pandell Law March 2010  –  June 2014  (4 years 4 months) Walnut Creek, CA •\tRepresented engineer in litigation involving his patent. \n•\tPrevailed on Motion for Summary Judgment for engineering client \n•\tRepresented architect in litigation involving his novel corrosion resistant design for indoor pool. \n•\tObtained dismissal for engineer for a nominal amount through a demurrer. \n•\tNegotiated nominal settlement for engineer after exposing weaknesses in plaintiff’s claims. Associate Attorney Brady, Vorwerck, Ryder & Caspino May 2009  –  March 2010  (11 months) Concord, CA •\tRepresented general contractor in litigation involving a new home project. \n•\tNegotiated many settlements for subcontractor clients in construction defect litigation. \n•\tRepresented and defended clients in numerous depositions. \n•\tSuccessfully brought motions to continue trial and to amend a cross-complaint. Associate Attorney Brady, Vorwerck, Ryder & Caspino May 2009  –  March 2010  (11 months) Concord, CA •\tRepresented general contractor in litigation involving a new home project. \n•\tNegotiated many settlements for subcontractor clients in construction defect litigation. \n•\tRepresented and defended clients in numerous depositions. \n•\tSuccessfully brought motions to continue trial and to amend a cross-complaint. Associate Attorney Bradley, Curley, Asiano, Barrabee, & Gale February 2006  –  May 2009  (3 years 4 months) Larkspur, CA •\tDefended public entities through appeal in cases involving the American with Disabilities Act. \n•\tRepresented developers and general contractors in construction defect litigation. \n•\tExperienced in matters ranging from personal injuries, vehicle accidents, and alleged negligence. \n•\tExposed weakness in plaintiff’s case, which resulted in plaintiff’s demand being greatly reduced.  \n•\tNegotiated settlement of defective product claim to a fraction of the initial demand. \n•\tPrepared Motions for Summary Judgment to allow clients to settle for nominal amounts. Associate Attorney Bradley, Curley, Asiano, Barrabee, & Gale February 2006  –  May 2009  (3 years 4 months) Larkspur, CA •\tDefended public entities through appeal in cases involving the American with Disabilities Act. \n•\tRepresented developers and general contractors in construction defect litigation. \n•\tExperienced in matters ranging from personal injuries, vehicle accidents, and alleged negligence. \n•\tExposed weakness in plaintiff’s case, which resulted in plaintiff’s demand being greatly reduced.  \n•\tNegotiated settlement of defective product claim to a fraction of the initial demand. \n•\tPrepared Motions for Summary Judgment to allow clients to settle for nominal amounts. Associate Attorney Law Offices of David W. Ginn February 2004  –  January 2006  (2 years) Walnut Creek, CA •\tExperience in bringing owner claims against contractors.  \n•\tDeveloped legal analysis and prepared mediation briefs for claims involving defective work, incomplete work, undisclosed defects, and delays. \n•\tDefended claims brought by contractors against public entities and private business owners. \n•\tPrepared legal analysis for claims involving change order disputes, design errors, and delays. \n•\tDeveloped claims against contractor, who performed defective work on public works project.  \n•\tPrepared exhibits for trial and acted as second chair at trial. Associate Attorney Law Offices of David W. Ginn February 2004  –  January 2006  (2 years) Walnut Creek, CA •\tExperience in bringing owner claims against contractors.  \n•\tDeveloped legal analysis and prepared mediation briefs for claims involving defective work, incomplete work, undisclosed defects, and delays. \n•\tDefended claims brought by contractors against public entities and private business owners. \n•\tPrepared legal analysis for claims involving change order disputes, design errors, and delays. \n•\tDeveloped claims against contractor, who performed defective work on public works project.  \n•\tPrepared exhibits for trial and acted as second chair at trial. Associate Attorney/ Paralegal Last & Faoro, Attorneys at Law June 2003  –  February 2004  (9 months) San Mateo, CA •\tBrought claims against contractors and owners for delays, disruptions, and coordination issues. \n•\tDefended claims brought by owner concerning work performed on a private construction project. \n•\tNegotiated settlements to cases for a small fraction of the claimed damages. Associate Attorney/ Paralegal Last & Faoro, Attorneys at Law June 2003  –  February 2004  (9 months) San Mateo, CA •\tBrought claims against contractors and owners for delays, disruptions, and coordination issues. \n•\tDefended claims brought by owner concerning work performed on a private construction project. \n•\tNegotiated settlements to cases for a small fraction of the claimed damages. Senior Facilities Engineer/ Project Manager Seagate Technology LLC January 1999  –  June 2003  (4 years 6 months) Milpitas, CA •\tManaged construction work on time and on budget for projects to expand a disk drive manufacturing facility by converting office area and a loading dock into a Class 100 clean room.  \n•\tManaged projects to install new manufacturing equipment, utilities, and conveyor systems. \n•\tPrepared Requests for Proposals detailing work for Architects and Engineers.  \n•\tReviewed bids, submittals, and Requests for Information.  \n•\tSupervised work, coordinated shutdowns, and negotiated change order proposals. Senior Facilities Engineer/ Project Manager Seagate Technology LLC January 1999  –  June 2003  (4 years 6 months) Milpitas, CA •\tManaged construction work on time and on budget for projects to expand a disk drive manufacturing facility by converting office area and a loading dock into a Class 100 clean room.  \n•\tManaged projects to install new manufacturing equipment, utilities, and conveyor systems. \n•\tPrepared Requests for Proposals detailing work for Architects and Engineers.  \n•\tReviewed bids, submittals, and Requests for Information.  \n•\tSupervised work, coordinated shutdowns, and negotiated change order proposals. Facilities/ Mechanical Engineer Intel Corporation January 1994  –  January 1999  (5 years 1 month) Santa Clara, CA •\tAssisted in optimizing the design of a new semiconductor manufacturing facility by evaluating the cost of design changes and benchmarking against competitors. \n•\tEstimated the capacity of existing utility systems from drawings, data sheets, on-site inspections, and interviews with system owners. \n•\tGenerated reports detailing the quantity, type, and cost of utilities for various projects. \n•\tSupervised four co-op students during each of their six-month co-op assignments. Facilities/ Mechanical Engineer Intel Corporation January 1994  –  January 1999  (5 years 1 month) Santa Clara, CA •\tAssisted in optimizing the design of a new semiconductor manufacturing facility by evaluating the cost of design changes and benchmarking against competitors. \n•\tEstimated the capacity of existing utility systems from drawings, data sheets, on-site inspections, and interviews with system owners. \n•\tGenerated reports detailing the quantity, type, and cost of utilities for various projects. \n•\tSupervised four co-op students during each of their six-month co-op assignments. Engineer (Graduate Student Intern/ Co-op) Phillips Lab, United States Air Force March 1991  –  September 1993  (2 years 7 months) Edwards, CA •\tConducted tests on a high-pressure water system to simulate the spray patterns of a fuel and an oxidizer for the development of liquid rocket engine nozzles. \n•\tAssisted in designing a rocket test stand for testing liquid rocket engines. \n•\tRequested bids for work, reviewed proposals, and negotiated prices. Engineer (Graduate Student Intern/ Co-op) Phillips Lab, United States Air Force March 1991  –  September 1993  (2 years 7 months) Edwards, CA •\tConducted tests on a high-pressure water system to simulate the spray patterns of a fuel and an oxidizer for the development of liquid rocket engine nozzles. \n•\tAssisted in designing a rocket test stand for testing liquid rocket engines. \n•\tRequested bids for work, reviewed proposals, and negotiated prices. Co-op Engineer (Student Intern) Sun Refining and Marketing March 1990  –  September 1990  (7 months) Philadelphia, PA •\tInspected mechanical systems to identify required maintenance work. \n•\tSupervised the progress of contractors. Compared work performed against the schedule. \n•\tOrdered replacement parts, supervised contractors, and reported on construction progress. Co-op Engineer (Student Intern) Sun Refining and Marketing March 1990  –  September 1990  (7 months) Philadelphia, PA •\tInspected mechanical systems to identify required maintenance work. \n•\tSupervised the progress of contractors. Compared work performed against the schedule. \n•\tOrdered replacement parts, supervised contractors, and reported on construction progress. Co-op Engineer (Student Intern) RCA/GE Aerospace June 1987  –  March 1989  (1 year 10 months) Camden, NJ •\tDirected environmental tests on electronic equipment to military specifications. \n•\tRecorded data, investigated failed tests, and wrote test plans and reports. Co-op Engineer (Student Intern) RCA/GE Aerospace June 1987  –  March 1989  (1 year 10 months) Camden, NJ •\tDirected environmental tests on electronic equipment to military specifications. \n•\tRecorded data, investigated failed tests, and wrote test plans and reports. Co-op Engineer (Student Intern) Bechtel Corporation September 1986  –  December 1986  (4 months) Delta, PA •\tLocated and identified equipment throughout the Peach Bottom Nuclear Power Plant. \n•\tAssisted in setting up a database for recording the repair history of facility equipment. Co-op Engineer (Student Intern) Bechtel Corporation September 1986  –  December 1986  (4 months) Delta, PA •\tLocated and identified equipment throughout the Peach Bottom Nuclear Power Plant. \n•\tAssisted in setting up a database for recording the repair history of facility equipment. Skills Manufacturing Construction Intellectual Property Litigation Civil Litigation Contract Negotiation Commercial Litigation Legal Writing Licensing Project Management Dispute Resolution Mediation Construction Law Product Liability Patent Litigation United States Patent... Arbitration Trademarks Trade Secrets Appeals Trials Personal Injury Courts Patents Patent Prosecution See 10+     See less Skills  Manufacturing Construction Intellectual Property Litigation Civil Litigation Contract Negotiation Commercial Litigation Legal Writing Licensing Project Management Dispute Resolution Mediation Construction Law Product Liability Patent Litigation United States Patent... Arbitration Trademarks Trade Secrets Appeals Trials Personal Injury Courts Patents Patent Prosecution See 10+     See less Manufacturing Construction Intellectual Property Litigation Civil Litigation Contract Negotiation Commercial Litigation Legal Writing Licensing Project Management Dispute Resolution Mediation Construction Law Product Liability Patent Litigation United States Patent... Arbitration Trademarks Trade Secrets Appeals Trials Personal Injury Courts Patents Patent Prosecution See 10+     See less Manufacturing Construction Intellectual Property Litigation Civil Litigation Contract Negotiation Commercial Litigation Legal Writing Licensing Project Management Dispute Resolution Mediation Construction Law Product Liability Patent Litigation United States Patent... Arbitration Trademarks Trade Secrets Appeals Trials Personal Injury Courts Patents Patent Prosecution See 10+     See less Education San Francisco Law School Doctor of Law (J.D.),  Law 1998  – 2001 •\tJ.D.; June 2001. \n•\tGraduated in top half of class. \n•\tDean's List for the 1999-2000 school year. \n•\tWitkin Award for Federal Taxation. \n•\tCo-authored a law review article entitled: Limitations on the Use of the Ellis Act in San Francisco’s Rental Market for the San Francisco Law Review; Volume 10, 2001. Activities and Societies:  Delta Theta Phi ,  Law Fraternity International California Polytechnic State University-San Luis Obispo MS Engineering,  Mechanical Engineering 1990  – 1994 •\tM.S. in Engineering; December 1994 \n•\tGPA: 3.4 of 4.0 Drexel University Bachelor of Science (BS),  Mechanical Engineering 1985  – 1990 •\tB.S. Mechanical Engineering; June 1990. \n•\tGPA: 3.2 of 4.0 over the last three years. DeAnza College, Cupertino, CA Paralegal Studies,  Law 1996  – 1998 •\tParalegal Certificate, June 1998. Activities and Societies:  Completed course in Intellectual Property Law Scranton Preparatory High School Diploma,  Academics 1981  – 1985 Activities and Societies:  Co-captain of cross-country team San Francisco Law School Doctor of Law (J.D.),  Law 1998  – 2001 •\tJ.D.; June 2001. \n•\tGraduated in top half of class. \n•\tDean's List for the 1999-2000 school year. \n•\tWitkin Award for Federal Taxation. \n•\tCo-authored a law review article entitled: Limitations on the Use of the Ellis Act in San Francisco’s Rental Market for the San Francisco Law Review; Volume 10, 2001. Activities and Societies:  Delta Theta Phi ,  Law Fraternity International San Francisco Law School Doctor of Law (J.D.),  Law 1998  – 2001 •\tJ.D.; June 2001. \n•\tGraduated in top half of class. \n•\tDean's List for the 1999-2000 school year. \n•\tWitkin Award for Federal Taxation. \n•\tCo-authored a law review article entitled: Limitations on the Use of the Ellis Act in San Francisco’s Rental Market for the San Francisco Law Review; Volume 10, 2001. Activities and Societies:  Delta Theta Phi ,  Law Fraternity International San Francisco Law School Doctor of Law (J.D.),  Law 1998  – 2001 •\tJ.D.; June 2001. \n•\tGraduated in top half of class. \n•\tDean's List for the 1999-2000 school year. \n•\tWitkin Award for Federal Taxation. \n•\tCo-authored a law review article entitled: Limitations on the Use of the Ellis Act in San Francisco’s Rental Market for the San Francisco Law Review; Volume 10, 2001. Activities and Societies:  Delta Theta Phi ,  Law Fraternity International California Polytechnic State University-San Luis Obispo MS Engineering,  Mechanical Engineering 1990  – 1994 •\tM.S. in Engineering; December 1994 \n•\tGPA: 3.4 of 4.0 California Polytechnic State University-San Luis Obispo MS Engineering,  Mechanical Engineering 1990  – 1994 •\tM.S. in Engineering; December 1994 \n•\tGPA: 3.4 of 4.0 California Polytechnic State University-San Luis Obispo MS Engineering,  Mechanical Engineering 1990  – 1994 •\tM.S. in Engineering; December 1994 \n•\tGPA: 3.4 of 4.0 Drexel University Bachelor of Science (BS),  Mechanical Engineering 1985  – 1990 •\tB.S. Mechanical Engineering; June 1990. \n•\tGPA: 3.2 of 4.0 over the last three years. Drexel University Bachelor of Science (BS),  Mechanical Engineering 1985  – 1990 •\tB.S. Mechanical Engineering; June 1990. \n•\tGPA: 3.2 of 4.0 over the last three years. Drexel University Bachelor of Science (BS),  Mechanical Engineering 1985  – 1990 •\tB.S. Mechanical Engineering; June 1990. \n•\tGPA: 3.2 of 4.0 over the last three years. DeAnza College, Cupertino, CA Paralegal Studies,  Law 1996  – 1998 •\tParalegal Certificate, June 1998. Activities and Societies:  Completed course in Intellectual Property Law DeAnza College, Cupertino, CA Paralegal Studies,  Law 1996  – 1998 •\tParalegal Certificate, June 1998. Activities and Societies:  Completed course in Intellectual Property Law DeAnza College, Cupertino, CA Paralegal Studies,  Law 1996  – 1998 •\tParalegal Certificate, June 1998. Activities and Societies:  Completed course in Intellectual Property Law Scranton Preparatory High School Diploma,  Academics 1981  – 1985 Activities and Societies:  Co-captain of cross-country team Scranton Preparatory High School Diploma,  Academics 1981  – 1985 Activities and Societies:  Co-captain of cross-country team Scranton Preparatory High School Diploma,  Academics 1981  – 1985 Activities and Societies:  Co-captain of cross-country team ", "Experience Facilities Engineer Seagate Technology May 2014  – Present (1 year 4 months) Penang, Malaysia Fire Protection System \nIn charge of maintaining good operations of:- \n- Fire Sprinkler System. \n- CO2 & FM200 System \n- Smoke Detectors, Heat Detectors, & ASD/ HSSD. \n- Fire Alarm System, conventional FACP, HSSD/ASP FACP. \n- Bomba Audits, EICC audit. \n \nFacilities Projects/ Utilities \n- Handles requests pertaining to facilities utilities. \n- Manage installations of utilities CDA, Chilled Water, Vacuum, N2 and Exhaust system. \n- Familiar with DOE application for Chimney installations. \n- Maintaining existing utilities in good working condition. Eg, Booster Pumps, chilled water system, ect. \n- Arrange for air analysis per DOE requirement. \n- JKKP Inspection. \n- Experienced in Clean Room and non- Clean Room environment. \n \nAdditional responsibilities:- \n- Scissors Lift \n- ESD Tester Turnstile Facilities Mechanical Engineer Intel Corporation August 2013  –  May 2014  (10 months) Penang, Malaysia Throughout his tenure, he worked as an understudy to an engineer. He was exposed to various systems serving a facility:- \n \nOil Free Air/ Compressed Dry Air System \n- Maintaining good operations of Oil Free Air Compressor \n \nHVAC System \n- Chilled Water System. Chiller & CHWP.  \n- Condenser Water System. Cooling Tower & CWP. \n- Air Conditioning System. Air Handler, Air Fan Unit, Air Dehumidifier Unit, & DEH. Also, FCU, Split units & ceiling cassettes.  \n \nProcess Cooling Water System Facilities Engineer Seagate Technology May 2014  – Present (1 year 4 months) Penang, Malaysia Fire Protection System \nIn charge of maintaining good operations of:- \n- Fire Sprinkler System. \n- CO2 & FM200 System \n- Smoke Detectors, Heat Detectors, & ASD/ HSSD. \n- Fire Alarm System, conventional FACP, HSSD/ASP FACP. \n- Bomba Audits, EICC audit. \n \nFacilities Projects/ Utilities \n- Handles requests pertaining to facilities utilities. \n- Manage installations of utilities CDA, Chilled Water, Vacuum, N2 and Exhaust system. \n- Familiar with DOE application for Chimney installations. \n- Maintaining existing utilities in good working condition. Eg, Booster Pumps, chilled water system, ect. \n- Arrange for air analysis per DOE requirement. \n- JKKP Inspection. \n- Experienced in Clean Room and non- Clean Room environment. \n \nAdditional responsibilities:- \n- Scissors Lift \n- ESD Tester Turnstile Facilities Engineer Seagate Technology May 2014  – Present (1 year 4 months) Penang, Malaysia Fire Protection System \nIn charge of maintaining good operations of:- \n- Fire Sprinkler System. \n- CO2 & FM200 System \n- Smoke Detectors, Heat Detectors, & ASD/ HSSD. \n- Fire Alarm System, conventional FACP, HSSD/ASP FACP. \n- Bomba Audits, EICC audit. \n \nFacilities Projects/ Utilities \n- Handles requests pertaining to facilities utilities. \n- Manage installations of utilities CDA, Chilled Water, Vacuum, N2 and Exhaust system. \n- Familiar with DOE application for Chimney installations. \n- Maintaining existing utilities in good working condition. Eg, Booster Pumps, chilled water system, ect. \n- Arrange for air analysis per DOE requirement. \n- JKKP Inspection. \n- Experienced in Clean Room and non- Clean Room environment. \n \nAdditional responsibilities:- \n- Scissors Lift \n- ESD Tester Turnstile Facilities Mechanical Engineer Intel Corporation August 2013  –  May 2014  (10 months) Penang, Malaysia Throughout his tenure, he worked as an understudy to an engineer. He was exposed to various systems serving a facility:- \n \nOil Free Air/ Compressed Dry Air System \n- Maintaining good operations of Oil Free Air Compressor \n \nHVAC System \n- Chilled Water System. Chiller & CHWP.  \n- Condenser Water System. Cooling Tower & CWP. \n- Air Conditioning System. Air Handler, Air Fan Unit, Air Dehumidifier Unit, & DEH. Also, FCU, Split units & ceiling cassettes.  \n \nProcess Cooling Water System Facilities Mechanical Engineer Intel Corporation August 2013  –  May 2014  (10 months) Penang, Malaysia Throughout his tenure, he worked as an understudy to an engineer. He was exposed to various systems serving a facility:- \n \nOil Free Air/ Compressed Dry Air System \n- Maintaining good operations of Oil Free Air Compressor \n \nHVAC System \n- Chilled Water System. Chiller & CHWP.  \n- Condenser Water System. Cooling Tower & CWP. \n- Air Conditioning System. Air Handler, Air Fan Unit, Air Dehumidifier Unit, & DEH. Also, FCU, Split units & ceiling cassettes.  \n \nProcess Cooling Water System Languages English Professional working proficiency Malay Professional working proficiency English Professional working proficiency Malay Professional working proficiency English Professional working proficiency Malay Professional working proficiency Professional working proficiency Professional working proficiency Skills Semiconductors Fire Protection... Facilities Engineering Facilities Operations Microsoft Office Microsoft Excel Matlab Engineering AutoCAD Mechanical Engineering HVAC Skills  Semiconductors Fire Protection... Facilities Engineering Facilities Operations Microsoft Office Microsoft Excel Matlab Engineering AutoCAD Mechanical Engineering HVAC Semiconductors Fire Protection... Facilities Engineering Facilities Operations Microsoft Office Microsoft Excel Matlab Engineering AutoCAD Mechanical Engineering HVAC Semiconductors Fire Protection... Facilities Engineering Facilities Operations Microsoft Office Microsoft Excel Matlab Engineering AutoCAD Mechanical Engineering HVAC Education Multimedia University Bachelor of Engineering (B.E.),  Mechanical Engineering 2010  – 2013 Multimedia University Bachelor of Engineering (B.E.),  Mechanical Engineering 2010  – 2013 Multimedia University Bachelor of Engineering (B.E.),  Mechanical Engineering 2010  – 2013 Multimedia University Bachelor of Engineering (B.E.),  Mechanical Engineering 2010  – 2013 ", "Experience Research Engineer Georgia Institute of Technology August 2015  – Present (1 month) Atlanta, GA Facilities Mechanical Engineer Intel Corporation February 2013  –  July 2015  (2 years 6 months) Portland, Oregon Area Central utilities building mechanical system owner at Intel's facilities technology development organization. Responsible for 24x7 operations of heat recovery chilled water and boiler plant supporting Intel's most advanced technology development factory \n-Developed operational and maintenance expertise on centrifugal chillers, natural gas boilers, centrifugal pumps, and cooling towers \n-Experienced in facilities systems controls to support a manufacturing facility \n \nJob role involved starting up and supporting major site expansion\t \n-Oversaw construction and start up of a variable primary-only pumping heat recovery chilled water and boiler plant  \n-Commissioned and verified design on all cooling and heating water systems for a new factory, two manufacturing support buildings, as well as a combined office and manufacturing building \n-Created and executed plans to tie the new buildings into the existing central plant system live without any interrupts to the operating factory already supported by the central plant \n \nPlanned and executed various energy and efficiency savings projects such as AFD install on chiller compressors \n \nAdvanced ability to work in a multisdisciplinary team environment and make fast data driven decisions \n Graduate Research Assistant University of Texas at Austin January 2011  –  December 2012  (2 years) * Researched hygroscopic salt contaminants in cleanroom environments \n* Designed and constructed an experimental apparatus to test contamination from HEPA filters under humid airflow conditions \n* Developed and tested experimental techniques for observing effects of hygroscopic salts on wafer surfaces under a variety of humidities \n \nAdvisor: Dr. Ofodike Ezekoye Undergraduate Research Assistant The University of Texas at Austin January 2010  –  January 2011  (1 year 1 month) * Conducted heat transfer research in microfluidics \n* Developed a microfluidic device with dynamically controlled complexity to direct fluid flow through desired channels \n* Gained cleanroom experience while constructing and designing test sections Mechanical Engineering Intern DP Engineering / DP-NXA June 2009  –  August 2009  (3 months) * Designed plant modifications for nuclear power plants \n* Worked on various consulting projects mainly for Lockheed-Martin Co. \n Research Engineer Georgia Institute of Technology August 2015  – Present (1 month) Atlanta, GA Research Engineer Georgia Institute of Technology August 2015  – Present (1 month) Atlanta, GA Facilities Mechanical Engineer Intel Corporation February 2013  –  July 2015  (2 years 6 months) Portland, Oregon Area Central utilities building mechanical system owner at Intel's facilities technology development organization. Responsible for 24x7 operations of heat recovery chilled water and boiler plant supporting Intel's most advanced technology development factory \n-Developed operational and maintenance expertise on centrifugal chillers, natural gas boilers, centrifugal pumps, and cooling towers \n-Experienced in facilities systems controls to support a manufacturing facility \n \nJob role involved starting up and supporting major site expansion\t \n-Oversaw construction and start up of a variable primary-only pumping heat recovery chilled water and boiler plant  \n-Commissioned and verified design on all cooling and heating water systems for a new factory, two manufacturing support buildings, as well as a combined office and manufacturing building \n-Created and executed plans to tie the new buildings into the existing central plant system live without any interrupts to the operating factory already supported by the central plant \n \nPlanned and executed various energy and efficiency savings projects such as AFD install on chiller compressors \n \nAdvanced ability to work in a multisdisciplinary team environment and make fast data driven decisions \n Facilities Mechanical Engineer Intel Corporation February 2013  –  July 2015  (2 years 6 months) Portland, Oregon Area Central utilities building mechanical system owner at Intel's facilities technology development organization. Responsible for 24x7 operations of heat recovery chilled water and boiler plant supporting Intel's most advanced technology development factory \n-Developed operational and maintenance expertise on centrifugal chillers, natural gas boilers, centrifugal pumps, and cooling towers \n-Experienced in facilities systems controls to support a manufacturing facility \n \nJob role involved starting up and supporting major site expansion\t \n-Oversaw construction and start up of a variable primary-only pumping heat recovery chilled water and boiler plant  \n-Commissioned and verified design on all cooling and heating water systems for a new factory, two manufacturing support buildings, as well as a combined office and manufacturing building \n-Created and executed plans to tie the new buildings into the existing central plant system live without any interrupts to the operating factory already supported by the central plant \n \nPlanned and executed various energy and efficiency savings projects such as AFD install on chiller compressors \n \nAdvanced ability to work in a multisdisciplinary team environment and make fast data driven decisions \n Graduate Research Assistant University of Texas at Austin January 2011  –  December 2012  (2 years) * Researched hygroscopic salt contaminants in cleanroom environments \n* Designed and constructed an experimental apparatus to test contamination from HEPA filters under humid airflow conditions \n* Developed and tested experimental techniques for observing effects of hygroscopic salts on wafer surfaces under a variety of humidities \n \nAdvisor: Dr. Ofodike Ezekoye Graduate Research Assistant University of Texas at Austin January 2011  –  December 2012  (2 years) * Researched hygroscopic salt contaminants in cleanroom environments \n* Designed and constructed an experimental apparatus to test contamination from HEPA filters under humid airflow conditions \n* Developed and tested experimental techniques for observing effects of hygroscopic salts on wafer surfaces under a variety of humidities \n \nAdvisor: Dr. Ofodike Ezekoye Undergraduate Research Assistant The University of Texas at Austin January 2010  –  January 2011  (1 year 1 month) * Conducted heat transfer research in microfluidics \n* Developed a microfluidic device with dynamically controlled complexity to direct fluid flow through desired channels \n* Gained cleanroom experience while constructing and designing test sections Undergraduate Research Assistant The University of Texas at Austin January 2010  –  January 2011  (1 year 1 month) * Conducted heat transfer research in microfluidics \n* Developed a microfluidic device with dynamically controlled complexity to direct fluid flow through desired channels \n* Gained cleanroom experience while constructing and designing test sections Mechanical Engineering Intern DP Engineering / DP-NXA June 2009  –  August 2009  (3 months) * Designed plant modifications for nuclear power plants \n* Worked on various consulting projects mainly for Lockheed-Martin Co. \n Mechanical Engineering Intern DP Engineering / DP-NXA June 2009  –  August 2009  (3 months) * Designed plant modifications for nuclear power plants \n* Worked on various consulting projects mainly for Lockheed-Martin Co. \n Languages English Native or bilingual proficiency Finnish Native or bilingual proficiency English Native or bilingual proficiency Finnish Native or bilingual proficiency English Native or bilingual proficiency Finnish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Labview Matlab Solidworks Heat Transfer Mechanical Engineering Heat Recovery Systems Experimentation LaTeX Fluid Mechanics SciPy NumPy Thermodynamics Simulations Testing Manufacturing Skills  Labview Matlab Solidworks Heat Transfer Mechanical Engineering Heat Recovery Systems Experimentation LaTeX Fluid Mechanics SciPy NumPy Thermodynamics Simulations Testing Manufacturing Labview Matlab Solidworks Heat Transfer Mechanical Engineering Heat Recovery Systems Experimentation LaTeX Fluid Mechanics SciPy NumPy Thermodynamics Simulations Testing Manufacturing Labview Matlab Solidworks Heat Transfer Mechanical Engineering Heat Recovery Systems Experimentation LaTeX Fluid Mechanics SciPy NumPy Thermodynamics Simulations Testing Manufacturing Education The University of Texas at Austin Master of Science,  Mechanical Engineering , 3.63/4.00 2010  – 2012 Emphasis in Thermal-Fluids Systems Activities and Societies:  Society of Fire Protection Engineers\n-Treasurer ,  Spring 2011 The University of Texas at Austin Bachelor of Science,  Mechanical Engineering , 3.86/4.00 2007  – 2010 With High Honors Activities and Societies:  Pi Tau Sigma ,  Texas Kappa Chapter\n-President ,  Spring 2010\n-Corporate Liaison ,  Fall 2009\nMember ,  Tau Beta Pi ,  Texas Alpha Chapter ,  Fall 2009 - Present\nAmerican Society of Mechanical Engineers ,  University of Texas at Austin Chapter\n-Academic Affairs Officer ,  2008-2009\n-Freshman Representative ,  2007-2008 The University of Texas at Austin Master of Science,  Mechanical Engineering , 3.63/4.00 2010  – 2012 Emphasis in Thermal-Fluids Systems Activities and Societies:  Society of Fire Protection Engineers\n-Treasurer ,  Spring 2011 The University of Texas at Austin Master of Science,  Mechanical Engineering , 3.63/4.00 2010  – 2012 Emphasis in Thermal-Fluids Systems Activities and Societies:  Society of Fire Protection Engineers\n-Treasurer ,  Spring 2011 The University of Texas at Austin Master of Science,  Mechanical Engineering , 3.63/4.00 2010  – 2012 Emphasis in Thermal-Fluids Systems Activities and Societies:  Society of Fire Protection Engineers\n-Treasurer ,  Spring 2011 The University of Texas at Austin Bachelor of Science,  Mechanical Engineering , 3.86/4.00 2007  – 2010 With High Honors Activities and Societies:  Pi Tau Sigma ,  Texas Kappa Chapter\n-President ,  Spring 2010\n-Corporate Liaison ,  Fall 2009\nMember ,  Tau Beta Pi ,  Texas Alpha Chapter ,  Fall 2009 - Present\nAmerican Society of Mechanical Engineers ,  University of Texas at Austin Chapter\n-Academic Affairs Officer ,  2008-2009\n-Freshman Representative ,  2007-2008 The University of Texas at Austin Bachelor of Science,  Mechanical Engineering , 3.86/4.00 2007  – 2010 With High Honors Activities and Societies:  Pi Tau Sigma ,  Texas Kappa Chapter\n-President ,  Spring 2010\n-Corporate Liaison ,  Fall 2009\nMember ,  Tau Beta Pi ,  Texas Alpha Chapter ,  Fall 2009 - Present\nAmerican Society of Mechanical Engineers ,  University of Texas at Austin Chapter\n-Academic Affairs Officer ,  2008-2009\n-Freshman Representative ,  2007-2008 The University of Texas at Austin Bachelor of Science,  Mechanical Engineering , 3.86/4.00 2007  – 2010 With High Honors Activities and Societies:  Pi Tau Sigma ,  Texas Kappa Chapter\n-President ,  Spring 2010\n-Corporate Liaison ,  Fall 2009\nMember ,  Tau Beta Pi ,  Texas Alpha Chapter ,  Fall 2009 - Present\nAmerican Society of Mechanical Engineers ,  University of Texas at Austin Chapter\n-Academic Affairs Officer ,  2008-2009\n-Freshman Representative ,  2007-2008 ", "Experience Mechanical Engineer CH2M HILL October 2014  – Present (11 months) Portland, Oregon Area Mechanical Designer Glumac March 2014  –  September 2014  (7 months) Portland, Oregon My primary project role in Glumac's Industrial Group was partial build-out design and construction administration services for a new 450mm semiconductor manufacturing cleanroom. Other project opportunities there included energy modeling in eQUEST, design of a data center expansion, and high rise office tenant improvements. Facilities Mechanical Engineer Intel Corporation July 2010  –  February 2014  (3 years 8 months) Hillsboro, OR As a Facilities Mechanical Engineer at Intel I was responsible for daily operations of compressed air, chilled water, heating water, and HVAC systems supporting a semiconductor factory. My roles included developing maintenance procedures, overseeing design of system expansions, coordinating construction activities, and driving energy conservation projects. Project Management Intern Western Allied Mechanical June 2009  –  August 2009  (3 months) Menlo Park, CA Assisted Project Managers at a design/build mechanical contractor. Projects included estimating, creating and editing drawings in AutoCAD, and submittal preparation. Tutor Cal Poly Academic Skills Center January 2009  –  August 2009  (8 months) San Luis Obispo, CA Lead student study groups in Mechanical and Civil Engineering classes. Fundraiser Cal Poly Fund December 2007  –  July 2008  (8 months) San Luis Obispo, CA Raised money for student programs by calling parents and alumni. Mechanical Engineer CH2M HILL October 2014  – Present (11 months) Portland, Oregon Area Mechanical Engineer CH2M HILL October 2014  – Present (11 months) Portland, Oregon Area Mechanical Designer Glumac March 2014  –  September 2014  (7 months) Portland, Oregon My primary project role in Glumac's Industrial Group was partial build-out design and construction administration services for a new 450mm semiconductor manufacturing cleanroom. Other project opportunities there included energy modeling in eQUEST, design of a data center expansion, and high rise office tenant improvements. Mechanical Designer Glumac March 2014  –  September 2014  (7 months) Portland, Oregon My primary project role in Glumac's Industrial Group was partial build-out design and construction administration services for a new 450mm semiconductor manufacturing cleanroom. Other project opportunities there included energy modeling in eQUEST, design of a data center expansion, and high rise office tenant improvements. Facilities Mechanical Engineer Intel Corporation July 2010  –  February 2014  (3 years 8 months) Hillsboro, OR As a Facilities Mechanical Engineer at Intel I was responsible for daily operations of compressed air, chilled water, heating water, and HVAC systems supporting a semiconductor factory. My roles included developing maintenance procedures, overseeing design of system expansions, coordinating construction activities, and driving energy conservation projects. Facilities Mechanical Engineer Intel Corporation July 2010  –  February 2014  (3 years 8 months) Hillsboro, OR As a Facilities Mechanical Engineer at Intel I was responsible for daily operations of compressed air, chilled water, heating water, and HVAC systems supporting a semiconductor factory. My roles included developing maintenance procedures, overseeing design of system expansions, coordinating construction activities, and driving energy conservation projects. Project Management Intern Western Allied Mechanical June 2009  –  August 2009  (3 months) Menlo Park, CA Assisted Project Managers at a design/build mechanical contractor. Projects included estimating, creating and editing drawings in AutoCAD, and submittal preparation. Project Management Intern Western Allied Mechanical June 2009  –  August 2009  (3 months) Menlo Park, CA Assisted Project Managers at a design/build mechanical contractor. Projects included estimating, creating and editing drawings in AutoCAD, and submittal preparation. Tutor Cal Poly Academic Skills Center January 2009  –  August 2009  (8 months) San Luis Obispo, CA Lead student study groups in Mechanical and Civil Engineering classes. Tutor Cal Poly Academic Skills Center January 2009  –  August 2009  (8 months) San Luis Obispo, CA Lead student study groups in Mechanical and Civil Engineering classes. Fundraiser Cal Poly Fund December 2007  –  July 2008  (8 months) San Luis Obispo, CA Raised money for student programs by calling parents and alumni. Fundraiser Cal Poly Fund December 2007  –  July 2008  (8 months) San Luis Obispo, CA Raised money for student programs by calling parents and alumni. Skills HVAC Design Commissioning Energy Conservation Revit MEP PIPE-FLO Professional AutoCAD Trane TRACE 700 eQUEST HVAC Mechanical Engineering HVAC Operations Presenting to... Project Management Strong Interpersonal... Effective Collaboration Self-motivated Managing many... Writing technical... Construction Engineering Management Facilities Management Engineering Factory SPC Design for Manufacturing Root Cause Analysis Design of Experiments Manufacturing Revit Process Engineering Oregon PE License See 16+     See less Skills  HVAC Design Commissioning Energy Conservation Revit MEP PIPE-FLO Professional AutoCAD Trane TRACE 700 eQUEST HVAC Mechanical Engineering HVAC Operations Presenting to... Project Management Strong Interpersonal... Effective Collaboration Self-motivated Managing many... Writing technical... Construction Engineering Management Facilities Management Engineering Factory SPC Design for Manufacturing Root Cause Analysis Design of Experiments Manufacturing Revit Process Engineering Oregon PE License See 16+     See less HVAC Design Commissioning Energy Conservation Revit MEP PIPE-FLO Professional AutoCAD Trane TRACE 700 eQUEST HVAC Mechanical Engineering HVAC Operations Presenting to... Project Management Strong Interpersonal... Effective Collaboration Self-motivated Managing many... Writing technical... Construction Engineering Management Facilities Management Engineering Factory SPC Design for Manufacturing Root Cause Analysis Design of Experiments Manufacturing Revit Process Engineering Oregon PE License See 16+     See less HVAC Design Commissioning Energy Conservation Revit MEP PIPE-FLO Professional AutoCAD Trane TRACE 700 eQUEST HVAC Mechanical Engineering HVAC Operations Presenting to... Project Management Strong Interpersonal... Effective Collaboration Self-motivated Managing many... Writing technical... Construction Engineering Management Facilities Management Engineering Factory SPC Design for Manufacturing Root Cause Analysis Design of Experiments Manufacturing Revit Process Engineering Oregon PE License See 16+     See less Education California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2005  – 2010 BS Mechanical Engineering  \nConcentration: HVAC&R \n \nSpecialized Coursework: \nFundamentals of HVAC Systems \nHVAC Air and Water Distribution System Design \nRefrigeration Principles and Design \nBuilding Heating and Cooling Loads \n \nThird Place entry in the 2010 ASHRAE Student Design Competition. Student team ran energy optimization models in TRACE 700 for multi-story hospital building. Final report included several different central plant and terminal unit configurations in addition to on-site energy production. Activities and Societies:  ASHRAE ,  Water Polo California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2005  – 2010 BS Mechanical Engineering  \nConcentration: HVAC&R \n \nSpecialized Coursework: \nFundamentals of HVAC Systems \nHVAC Air and Water Distribution System Design \nRefrigeration Principles and Design \nBuilding Heating and Cooling Loads \n \nThird Place entry in the 2010 ASHRAE Student Design Competition. Student team ran energy optimization models in TRACE 700 for multi-story hospital building. Final report included several different central plant and terminal unit configurations in addition to on-site energy production. Activities and Societies:  ASHRAE ,  Water Polo California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2005  – 2010 BS Mechanical Engineering  \nConcentration: HVAC&R \n \nSpecialized Coursework: \nFundamentals of HVAC Systems \nHVAC Air and Water Distribution System Design \nRefrigeration Principles and Design \nBuilding Heating and Cooling Loads \n \nThird Place entry in the 2010 ASHRAE Student Design Competition. Student team ran energy optimization models in TRACE 700 for multi-story hospital building. Final report included several different central plant and terminal unit configurations in addition to on-site energy production. Activities and Societies:  ASHRAE ,  Water Polo California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2005  – 2010 BS Mechanical Engineering  \nConcentration: HVAC&R \n \nSpecialized Coursework: \nFundamentals of HVAC Systems \nHVAC Air and Water Distribution System Design \nRefrigeration Principles and Design \nBuilding Heating and Cooling Loads \n \nThird Place entry in the 2010 ASHRAE Student Design Competition. Student team ran energy optimization models in TRACE 700 for multi-story hospital building. Final report included several different central plant and terminal unit configurations in addition to on-site energy production. Activities and Societies:  ASHRAE ,  Water Polo ", "Experience Facilities Senior Mechanical Engineer Intel Corporation February 2010  – Present (5 years 7 months) Chandler, AZ Responsible for system design, improvement and sustaining expansion project for facility mechanical system includes compressed air systems, process exhaust, oxygen generation systems, process cooling water, chiller plant, boiler systems, HVAC and vacuum systems. Duties include sustaining mechanical system without interruption to production, close warranty defects inside systems, and continuous improve system to support factory ramp. Develop utility specification, with the ability of monitoring system with SPC tool to make sure of critical mechanical parameter matching, continuous improve system reliability and performance, coaching & training technicians to certified level. Facilities Industrial Waste Treatment Engineer Intel Corporation August 2004  –  February 2010  (5 years 7 months) Facilities Senior Mechanical Engineer Intel Corporation February 2010  – Present (5 years 7 months) Chandler, AZ Responsible for system design, improvement and sustaining expansion project for facility mechanical system includes compressed air systems, process exhaust, oxygen generation systems, process cooling water, chiller plant, boiler systems, HVAC and vacuum systems. Duties include sustaining mechanical system without interruption to production, close warranty defects inside systems, and continuous improve system to support factory ramp. Develop utility specification, with the ability of monitoring system with SPC tool to make sure of critical mechanical parameter matching, continuous improve system reliability and performance, coaching & training technicians to certified level. Facilities Senior Mechanical Engineer Intel Corporation February 2010  – Present (5 years 7 months) Chandler, AZ Responsible for system design, improvement and sustaining expansion project for facility mechanical system includes compressed air systems, process exhaust, oxygen generation systems, process cooling water, chiller plant, boiler systems, HVAC and vacuum systems. Duties include sustaining mechanical system without interruption to production, close warranty defects inside systems, and continuous improve system to support factory ramp. Develop utility specification, with the ability of monitoring system with SPC tool to make sure of critical mechanical parameter matching, continuous improve system reliability and performance, coaching & training technicians to certified level. Facilities Industrial Waste Treatment Engineer Intel Corporation August 2004  –  February 2010  (5 years 7 months) Facilities Industrial Waste Treatment Engineer Intel Corporation August 2004  –  February 2010  (5 years 7 months) Skills Chemical Engineering Mechanical Engineering Commissioning Semiconductors Systems Engineering Operations Management Failure Analysis SPC Root Cause Analysis JMP Project Management Semiconductor Industry Air Compressors System Design Factory Process Engineering Project Planning Engineering Engineering Management Manufacturing See 5+     See less Skills  Chemical Engineering Mechanical Engineering Commissioning Semiconductors Systems Engineering Operations Management Failure Analysis SPC Root Cause Analysis JMP Project Management Semiconductor Industry Air Compressors System Design Factory Process Engineering Project Planning Engineering Engineering Management Manufacturing See 5+     See less Chemical Engineering Mechanical Engineering Commissioning Semiconductors Systems Engineering Operations Management Failure Analysis SPC Root Cause Analysis JMP Project Management Semiconductor Industry Air Compressors System Design Factory Process Engineering Project Planning Engineering Engineering Management Manufacturing See 5+     See less Chemical Engineering Mechanical Engineering Commissioning Semiconductors Systems Engineering Operations Management Failure Analysis SPC Root Cause Analysis JMP Project Management Semiconductor Industry Air Compressors System Design Factory Process Engineering Project Planning Engineering Engineering Management Manufacturing See 5+     See less Education North Carolina State University Bachelor of Science (B.S.),  Chemical Engineering 2000  – 2004 Activities and Societies:  American Institute of Chemical Engineers North Carolina State University Bachelor of Science (B.S.),  Chemical Engineering 2000  – 2004 Activities and Societies:  American Institute of Chemical Engineers North Carolina State University Bachelor of Science (B.S.),  Chemical Engineering 2000  – 2004 Activities and Societies:  American Institute of Chemical Engineers North Carolina State University Bachelor of Science (B.S.),  Chemical Engineering 2000  – 2004 Activities and Societies:  American Institute of Chemical Engineers ", "Summary Seeking opportunities to broaden my mechanical engineering knowledge and skills, and apply them in ways that help progress my company to new performance and efficiency capabilities. I also strive to develop supervisory experience in an environment where my expertise will be fully utilized. Summary Seeking opportunities to broaden my mechanical engineering knowledge and skills, and apply them in ways that help progress my company to new performance and efficiency capabilities. I also strive to develop supervisory experience in an environment where my expertise will be fully utilized. Seeking opportunities to broaden my mechanical engineering knowledge and skills, and apply them in ways that help progress my company to new performance and efficiency capabilities. I also strive to develop supervisory experience in an environment where my expertise will be fully utilized. Seeking opportunities to broaden my mechanical engineering knowledge and skills, and apply them in ways that help progress my company to new performance and efficiency capabilities. I also strive to develop supervisory experience in an environment where my expertise will be fully utilized. Experience Process Facilities Mechanical Engineer Intel Corporation July 2011  – Present (4 years 2 months) Portland, Oregon Area Sole Mechanical Facilities Operations Engineer for all systems serving 2.46 million sq. ft. of Oregon Offices, Labs and Data Centers including HVAC, exhaust, boilers, chillers, vacuum, compressed air and closed loop water systems (10/13 - Present).  \n \nResponsible and accountable for maintaining safety, quality, output and efficient 24/7 operation of systems under my ownership.  \n \nExecute projects to reach annual energy savings goal of $569,000.  \n \nEnsure compliance with all Intel and local regulatory requirements including air emissions, waste water, and regular inspection and reporting of pressure vessel, backflow preventer, and fire suppression systems.  \n \nInterface directly with customers to troubleshoot, provide understanding of system operations, and assist in feasibility studies. \n \nLogic Facilities Technology Development system engineer in Intel's lead development factory D1D (7/11 - 10/13).  \n \nSystem owner for exhaust fans and abatement systems, process cooling water loop systems, and process vacuum systems. \n \nPerformed start up tasks for exhaust systems in Intel’s newest and largest Development factory, D1X. \n \nTransfer technical skills & knowledge to technicians and engineering counterparts at the five High Volume Manufacturing sites around the world to ensure efficient decision making & system reliability across the organization. . \n \nConduct monthly presentations to company Vice Presidents and various other levels of management regarding the quality and performance of operational systems.  \n \nDevelop and implement Lean projects to drive efficiency and improve performance such as eliminating unnecessary equipment maintenance, and automating equipment functions that previously required two or more technicians to perform. Corporate Services Hiring Team Recruiter Intel Corporation January 2013  –  March 2014  (1 year 3 months) Portland, Oregon Area Served on Intel Corporate Services hiring team to recruit top engineering candidates, improve organization integration process, boost new hire retention, and develop intern program. Process Facilities Mechanical Engineering Intern Intel Corporation May 2010  –  September 2010  (5 months) Portland, Oregon Area Analyzed feasibility of installing evaporative cooling system into Process Cooling Water system. \n \nInvestigated cost and energy savings of installing Adjustable Frequency Drives on chillers for the chilled water loop, and completed Net Profit Cost analysis resulting in ~ $300,000 annual savings per factory.  \n \nInvestigated energy savings for Oil Free Air systems pre-cooling and after coolers on compressors, ultimately finding that the return on investment was not high enough to proceed. Process Facilities Mechanical Engineering Intern Intel Corporation May 2009  –  September 2009  (5 months) Albuquerque, New Mexico Area Helped plan Heat Recovery Water to Reverse Osmosis Preheat system installation.  \n \nLed wasteful exhaust reduction, and daytime exterior lighting reduction projects as part of an energy conservation effort.  \n \nReceived approval for $762,000 of PNM rebates for New Mexico site energy conservation projects. Nanotechnology student researcher University of Michigan May 2008  –  August 2008  (4 months) Studied different methods of creating thin films using spin coating procedure, and finding an effective means to melt them using lasers or other heat processes. Presented research at the 2008 Regional Summer Research Opportunity Program Conference. Engineering Technician Department of Defense - Space and Naval Warfare 2006  –  2007  (1 year) Obtained Federal Secret Security Clearance, and assisted engineers in upgrading radio and computer communication system for Navy ships Process Facilities Mechanical Engineer Intel Corporation July 2011  – Present (4 years 2 months) Portland, Oregon Area Sole Mechanical Facilities Operations Engineer for all systems serving 2.46 million sq. ft. of Oregon Offices, Labs and Data Centers including HVAC, exhaust, boilers, chillers, vacuum, compressed air and closed loop water systems (10/13 - Present).  \n \nResponsible and accountable for maintaining safety, quality, output and efficient 24/7 operation of systems under my ownership.  \n \nExecute projects to reach annual energy savings goal of $569,000.  \n \nEnsure compliance with all Intel and local regulatory requirements including air emissions, waste water, and regular inspection and reporting of pressure vessel, backflow preventer, and fire suppression systems.  \n \nInterface directly with customers to troubleshoot, provide understanding of system operations, and assist in feasibility studies. \n \nLogic Facilities Technology Development system engineer in Intel's lead development factory D1D (7/11 - 10/13).  \n \nSystem owner for exhaust fans and abatement systems, process cooling water loop systems, and process vacuum systems. \n \nPerformed start up tasks for exhaust systems in Intel’s newest and largest Development factory, D1X. \n \nTransfer technical skills & knowledge to technicians and engineering counterparts at the five High Volume Manufacturing sites around the world to ensure efficient decision making & system reliability across the organization. . \n \nConduct monthly presentations to company Vice Presidents and various other levels of management regarding the quality and performance of operational systems.  \n \nDevelop and implement Lean projects to drive efficiency and improve performance such as eliminating unnecessary equipment maintenance, and automating equipment functions that previously required two or more technicians to perform. Process Facilities Mechanical Engineer Intel Corporation July 2011  – Present (4 years 2 months) Portland, Oregon Area Sole Mechanical Facilities Operations Engineer for all systems serving 2.46 million sq. ft. of Oregon Offices, Labs and Data Centers including HVAC, exhaust, boilers, chillers, vacuum, compressed air and closed loop water systems (10/13 - Present).  \n \nResponsible and accountable for maintaining safety, quality, output and efficient 24/7 operation of systems under my ownership.  \n \nExecute projects to reach annual energy savings goal of $569,000.  \n \nEnsure compliance with all Intel and local regulatory requirements including air emissions, waste water, and regular inspection and reporting of pressure vessel, backflow preventer, and fire suppression systems.  \n \nInterface directly with customers to troubleshoot, provide understanding of system operations, and assist in feasibility studies. \n \nLogic Facilities Technology Development system engineer in Intel's lead development factory D1D (7/11 - 10/13).  \n \nSystem owner for exhaust fans and abatement systems, process cooling water loop systems, and process vacuum systems. \n \nPerformed start up tasks for exhaust systems in Intel’s newest and largest Development factory, D1X. \n \nTransfer technical skills & knowledge to technicians and engineering counterparts at the five High Volume Manufacturing sites around the world to ensure efficient decision making & system reliability across the organization. . \n \nConduct monthly presentations to company Vice Presidents and various other levels of management regarding the quality and performance of operational systems.  \n \nDevelop and implement Lean projects to drive efficiency and improve performance such as eliminating unnecessary equipment maintenance, and automating equipment functions that previously required two or more technicians to perform. Corporate Services Hiring Team Recruiter Intel Corporation January 2013  –  March 2014  (1 year 3 months) Portland, Oregon Area Served on Intel Corporate Services hiring team to recruit top engineering candidates, improve organization integration process, boost new hire retention, and develop intern program. Corporate Services Hiring Team Recruiter Intel Corporation January 2013  –  March 2014  (1 year 3 months) Portland, Oregon Area Served on Intel Corporate Services hiring team to recruit top engineering candidates, improve organization integration process, boost new hire retention, and develop intern program. Process Facilities Mechanical Engineering Intern Intel Corporation May 2010  –  September 2010  (5 months) Portland, Oregon Area Analyzed feasibility of installing evaporative cooling system into Process Cooling Water system. \n \nInvestigated cost and energy savings of installing Adjustable Frequency Drives on chillers for the chilled water loop, and completed Net Profit Cost analysis resulting in ~ $300,000 annual savings per factory.  \n \nInvestigated energy savings for Oil Free Air systems pre-cooling and after coolers on compressors, ultimately finding that the return on investment was not high enough to proceed. Process Facilities Mechanical Engineering Intern Intel Corporation May 2010  –  September 2010  (5 months) Portland, Oregon Area Analyzed feasibility of installing evaporative cooling system into Process Cooling Water system. \n \nInvestigated cost and energy savings of installing Adjustable Frequency Drives on chillers for the chilled water loop, and completed Net Profit Cost analysis resulting in ~ $300,000 annual savings per factory.  \n \nInvestigated energy savings for Oil Free Air systems pre-cooling and after coolers on compressors, ultimately finding that the return on investment was not high enough to proceed. Process Facilities Mechanical Engineering Intern Intel Corporation May 2009  –  September 2009  (5 months) Albuquerque, New Mexico Area Helped plan Heat Recovery Water to Reverse Osmosis Preheat system installation.  \n \nLed wasteful exhaust reduction, and daytime exterior lighting reduction projects as part of an energy conservation effort.  \n \nReceived approval for $762,000 of PNM rebates for New Mexico site energy conservation projects. Process Facilities Mechanical Engineering Intern Intel Corporation May 2009  –  September 2009  (5 months) Albuquerque, New Mexico Area Helped plan Heat Recovery Water to Reverse Osmosis Preheat system installation.  \n \nLed wasteful exhaust reduction, and daytime exterior lighting reduction projects as part of an energy conservation effort.  \n \nReceived approval for $762,000 of PNM rebates for New Mexico site energy conservation projects. Nanotechnology student researcher University of Michigan May 2008  –  August 2008  (4 months) Studied different methods of creating thin films using spin coating procedure, and finding an effective means to melt them using lasers or other heat processes. Presented research at the 2008 Regional Summer Research Opportunity Program Conference. Nanotechnology student researcher University of Michigan May 2008  –  August 2008  (4 months) Studied different methods of creating thin films using spin coating procedure, and finding an effective means to melt them using lasers or other heat processes. Presented research at the 2008 Regional Summer Research Opportunity Program Conference. Engineering Technician Department of Defense - Space and Naval Warfare 2006  –  2007  (1 year) Obtained Federal Secret Security Clearance, and assisted engineers in upgrading radio and computer communication system for Navy ships Engineering Technician Department of Defense - Space and Naval Warfare 2006  –  2007  (1 year) Obtained Federal Secret Security Clearance, and assisted engineers in upgrading radio and computer communication system for Navy ships Skills Engineering SPC Design of Experiments Failure Analysis Matlab Simulations Solidworks Finite Element Analysis Semiconductors Labview Automation Troubleshooting Manufacturing Six Sigma Mechanical Engineering SolidWorks LabVIEW See 2+     See less Skills  Engineering SPC Design of Experiments Failure Analysis Matlab Simulations Solidworks Finite Element Analysis Semiconductors Labview Automation Troubleshooting Manufacturing Six Sigma Mechanical Engineering SolidWorks LabVIEW See 2+     See less Engineering SPC Design of Experiments Failure Analysis Matlab Simulations Solidworks Finite Element Analysis Semiconductors Labview Automation Troubleshooting Manufacturing Six Sigma Mechanical Engineering SolidWorks LabVIEW See 2+     See less Engineering SPC Design of Experiments Failure Analysis Matlab Simulations Solidworks Finite Element Analysis Semiconductors Labview Automation Troubleshooting Manufacturing Six Sigma Mechanical Engineering SolidWorks LabVIEW See 2+     See less Education University of Michigan Mechanical Engineering 2008  – 2011 Theta Tau Professional Engineering Fraternity – Pledge Class Regent, Social Committee Chair \nLed pledge class in meeting deadlines, fundraised $500 for the chapter, and planned and organized fraternity social events \n \nMEPO (Multicultural Engineering Program Outreach) \nServed as mentor and guide for freshman engineers to ensure their first year was successful and positive \n \nNational Society of Black Engineers (NSBE) \nServed as ACT Prep course mentor for Ypsilanti, Michigan high school students Activities and Societies:  Theta Tau Professional Engineering Fraternity ,  MEPO (Multicultural Engineering Program Outreach) ,  National Society of Black Engineers (NSBE) Morehouse College Applied Physics 2005  – 2008 Society of Physics Students – Treasurer  \nManaged chapter funds and how they were allocated for chapter needs Activities and Societies:  Society of Physics Students University of Michigan Mechanical Engineering 2008  – 2011 Theta Tau Professional Engineering Fraternity – Pledge Class Regent, Social Committee Chair \nLed pledge class in meeting deadlines, fundraised $500 for the chapter, and planned and organized fraternity social events \n \nMEPO (Multicultural Engineering Program Outreach) \nServed as mentor and guide for freshman engineers to ensure their first year was successful and positive \n \nNational Society of Black Engineers (NSBE) \nServed as ACT Prep course mentor for Ypsilanti, Michigan high school students Activities and Societies:  Theta Tau Professional Engineering Fraternity ,  MEPO (Multicultural Engineering Program Outreach) ,  National Society of Black Engineers (NSBE) University of Michigan Mechanical Engineering 2008  – 2011 Theta Tau Professional Engineering Fraternity – Pledge Class Regent, Social Committee Chair \nLed pledge class in meeting deadlines, fundraised $500 for the chapter, and planned and organized fraternity social events \n \nMEPO (Multicultural Engineering Program Outreach) \nServed as mentor and guide for freshman engineers to ensure their first year was successful and positive \n \nNational Society of Black Engineers (NSBE) \nServed as ACT Prep course mentor for Ypsilanti, Michigan high school students Activities and Societies:  Theta Tau Professional Engineering Fraternity ,  MEPO (Multicultural Engineering Program Outreach) ,  National Society of Black Engineers (NSBE) University of Michigan Mechanical Engineering 2008  – 2011 Theta Tau Professional Engineering Fraternity – Pledge Class Regent, Social Committee Chair \nLed pledge class in meeting deadlines, fundraised $500 for the chapter, and planned and organized fraternity social events \n \nMEPO (Multicultural Engineering Program Outreach) \nServed as mentor and guide for freshman engineers to ensure their first year was successful and positive \n \nNational Society of Black Engineers (NSBE) \nServed as ACT Prep course mentor for Ypsilanti, Michigan high school students Activities and Societies:  Theta Tau Professional Engineering Fraternity ,  MEPO (Multicultural Engineering Program Outreach) ,  National Society of Black Engineers (NSBE) Morehouse College Applied Physics 2005  – 2008 Society of Physics Students – Treasurer  \nManaged chapter funds and how they were allocated for chapter needs Activities and Societies:  Society of Physics Students Morehouse College Applied Physics 2005  – 2008 Society of Physics Students – Treasurer  \nManaged chapter funds and how they were allocated for chapter needs Activities and Societies:  Society of Physics Students Morehouse College Applied Physics 2005  – 2008 Society of Physics Students – Treasurer  \nManaged chapter funds and how they were allocated for chapter needs Activities and Societies:  Society of Physics Students ", "Experience Facilities Mechanical Engineer, Intel Corporation October 2014  – Present (11 months) Hillsboro, OR Virtual Test Engineer NACCO Materials Handling Group July 2004  –  October 2014  (10 years 4 months) Test Technician NACCO Materials Handling Group September 2003  –  July 2004  (11 months) Fairview, OR Facilities Mechanical Engineer, Intel Corporation October 2014  – Present (11 months) Hillsboro, OR Facilities Mechanical Engineer, Intel Corporation October 2014  – Present (11 months) Hillsboro, OR Virtual Test Engineer NACCO Materials Handling Group July 2004  –  October 2014  (10 years 4 months) Virtual Test Engineer NACCO Materials Handling Group July 2004  –  October 2014  (10 years 4 months) Test Technician NACCO Materials Handling Group September 2003  –  July 2004  (11 months) Fairview, OR Test Technician NACCO Materials Handling Group September 2003  –  July 2004  (11 months) Fairview, OR Education University of Portland BS,  Mechanical Engineering 1997  – 2001 University of Portland BS,  Mechanical Engineering 1997  – 2001 University of Portland BS,  Mechanical Engineering 1997  – 2001 University of Portland BS,  Mechanical Engineering 1997  – 2001 ", "Experience Facilities Operations Manager Intel Corporation June 2010  – Present (5 years 3 months) Albuquerque, New Mexico Area Manage various Facilities Operations teams: Electrical/Instrumentation & Controls/Life Safety Systems, Cleanroom/Mechanical, Ultra Pure Water/Industrial Waste, Sub Fab Vacuum & Abatement, Bulk and Specialty Gases/Bulk Chemical Delivery systems; supporting facilities operations, maintenance, projects, commissioning, start-up, and process transfer.  \nGroup Leader with Area Manager experience for Facilities teams consisting of operations/maintenance technicians, engineering staff, and operations supervision.  \nEnsure safe and reliable operation for Lean Manufacturing, TPM, autonomous maintenance improvements, problem resolution, capital project support, cost/energy reduction and optimization. \nConduct resource and performance management (focal process) for teams. Facilities Mechanical Engineer Intel Corporation July 2004  –  June 2010  (6 years) Albuquerque, New Mexico Area Provided engineering support to ensure safe and reliable operations for various systems and applications including process cooling water, process & house vacuum systems, compressed dry air, chilled water, condenser water, cleanroom HVAC, process exhaust, fire protection, and heating (steam and heat recovery) systems. Design Engineer Brown and Caldwell August 2003  –  June 2004  (11 months) El Paso, Texas Area Generated cost evaluation reports to determine if construction cost estimated by the clients were in line with industry benchmarks. Analyzed contractor’s construction submittals to determine whether they conformed to project specifications. Performed duty as inspector for construction sites including reverse osmosis filtered wells, water lines and sewer lines to ensure construction activities complied with plans and specifications. Performed surveying activities by making field measurements to determine site elevations. Created basic design layouts for city water lines. Engineering Co-Op Ethicon, Inc. May 2002  –  January 2003  (9 months) Albuquerque, New Mexico Area Performed startup, commission, and integration activities for new ink jet and conveying equipment in custom packaging. Participated in >15 packaging validations and tests. Assisted with troubleshooting of packaging equipment. Obtained, general knowledge of cGMP/ISO regulations, validation principles and guidelines working in a medical device/manufacturing environment. Facilities Operations Manager Intel Corporation June 2010  – Present (5 years 3 months) Albuquerque, New Mexico Area Manage various Facilities Operations teams: Electrical/Instrumentation & Controls/Life Safety Systems, Cleanroom/Mechanical, Ultra Pure Water/Industrial Waste, Sub Fab Vacuum & Abatement, Bulk and Specialty Gases/Bulk Chemical Delivery systems; supporting facilities operations, maintenance, projects, commissioning, start-up, and process transfer.  \nGroup Leader with Area Manager experience for Facilities teams consisting of operations/maintenance technicians, engineering staff, and operations supervision.  \nEnsure safe and reliable operation for Lean Manufacturing, TPM, autonomous maintenance improvements, problem resolution, capital project support, cost/energy reduction and optimization. \nConduct resource and performance management (focal process) for teams. Facilities Operations Manager Intel Corporation June 2010  – Present (5 years 3 months) Albuquerque, New Mexico Area Manage various Facilities Operations teams: Electrical/Instrumentation & Controls/Life Safety Systems, Cleanroom/Mechanical, Ultra Pure Water/Industrial Waste, Sub Fab Vacuum & Abatement, Bulk and Specialty Gases/Bulk Chemical Delivery systems; supporting facilities operations, maintenance, projects, commissioning, start-up, and process transfer.  \nGroup Leader with Area Manager experience for Facilities teams consisting of operations/maintenance technicians, engineering staff, and operations supervision.  \nEnsure safe and reliable operation for Lean Manufacturing, TPM, autonomous maintenance improvements, problem resolution, capital project support, cost/energy reduction and optimization. \nConduct resource and performance management (focal process) for teams. Facilities Mechanical Engineer Intel Corporation July 2004  –  June 2010  (6 years) Albuquerque, New Mexico Area Provided engineering support to ensure safe and reliable operations for various systems and applications including process cooling water, process & house vacuum systems, compressed dry air, chilled water, condenser water, cleanroom HVAC, process exhaust, fire protection, and heating (steam and heat recovery) systems. Facilities Mechanical Engineer Intel Corporation July 2004  –  June 2010  (6 years) Albuquerque, New Mexico Area Provided engineering support to ensure safe and reliable operations for various systems and applications including process cooling water, process & house vacuum systems, compressed dry air, chilled water, condenser water, cleanroom HVAC, process exhaust, fire protection, and heating (steam and heat recovery) systems. Design Engineer Brown and Caldwell August 2003  –  June 2004  (11 months) El Paso, Texas Area Generated cost evaluation reports to determine if construction cost estimated by the clients were in line with industry benchmarks. Analyzed contractor’s construction submittals to determine whether they conformed to project specifications. Performed duty as inspector for construction sites including reverse osmosis filtered wells, water lines and sewer lines to ensure construction activities complied with plans and specifications. Performed surveying activities by making field measurements to determine site elevations. Created basic design layouts for city water lines. Design Engineer Brown and Caldwell August 2003  –  June 2004  (11 months) El Paso, Texas Area Generated cost evaluation reports to determine if construction cost estimated by the clients were in line with industry benchmarks. Analyzed contractor’s construction submittals to determine whether they conformed to project specifications. Performed duty as inspector for construction sites including reverse osmosis filtered wells, water lines and sewer lines to ensure construction activities complied with plans and specifications. Performed surveying activities by making field measurements to determine site elevations. Created basic design layouts for city water lines. Engineering Co-Op Ethicon, Inc. May 2002  –  January 2003  (9 months) Albuquerque, New Mexico Area Performed startup, commission, and integration activities for new ink jet and conveying equipment in custom packaging. Participated in >15 packaging validations and tests. Assisted with troubleshooting of packaging equipment. Obtained, general knowledge of cGMP/ISO regulations, validation principles and guidelines working in a medical device/manufacturing environment. Engineering Co-Op Ethicon, Inc. May 2002  –  January 2003  (9 months) Albuquerque, New Mexico Area Performed startup, commission, and integration activities for new ink jet and conveying equipment in custom packaging. Participated in >15 packaging validations and tests. Assisted with troubleshooting of packaging equipment. Obtained, general knowledge of cGMP/ISO regulations, validation principles and guidelines working in a medical device/manufacturing environment. Skills Semiconductors Design of Experiments SPC Engineering Semiconductor Industry Root Cause Analysis Lean Manufacturing Process Improvement Program Management Cross-functional Team... Operations Management Strategic Planning Manufacturing Project Management Six Sigma Continuous Improvement Management Intel See 3+     See less Skills  Semiconductors Design of Experiments SPC Engineering Semiconductor Industry Root Cause Analysis Lean Manufacturing Process Improvement Program Management Cross-functional Team... Operations Management Strategic Planning Manufacturing Project Management Six Sigma Continuous Improvement Management Intel See 3+     See less Semiconductors Design of Experiments SPC Engineering Semiconductor Industry Root Cause Analysis Lean Manufacturing Process Improvement Program Management Cross-functional Team... Operations Management Strategic Planning Manufacturing Project Management Six Sigma Continuous Improvement Management Intel See 3+     See less Semiconductors Design of Experiments SPC Engineering Semiconductor Industry Root Cause Analysis Lean Manufacturing Process Improvement Program Management Cross-functional Team... Operations Management Strategic Planning Manufacturing Project Management Six Sigma Continuous Improvement Management Intel See 3+     See less Education New Mexico State University Bachelor's degree,  Mechanical Engineering 1998  – 2003 New Mexico State University Bachelor's degree,  Mechanical Engineering 1998  – 2003 New Mexico State University Bachelor's degree,  Mechanical Engineering 1998  – 2003 New Mexico State University Bachelor's degree,  Mechanical Engineering 1998  – 2003 ", "Summary Responsibilities include investigation and analysis of mechanical system failures of plumbing components/systems, appliances, heating, ventilation, and air conditioning (HVAC) equipment. Specific facility system equipment including heat transfer components, exhaust systems, and compressed air systems. Also responsible for collection of evidence in the field and conducting laboratory examinations to determine root cause(s) of failure Summary Responsibilities include investigation and analysis of mechanical system failures of plumbing components/systems, appliances, heating, ventilation, and air conditioning (HVAC) equipment. Specific facility system equipment including heat transfer components, exhaust systems, and compressed air systems. Also responsible for collection of evidence in the field and conducting laboratory examinations to determine root cause(s) of failure Responsibilities include investigation and analysis of mechanical system failures of plumbing components/systems, appliances, heating, ventilation, and air conditioning (HVAC) equipment. Specific facility system equipment including heat transfer components, exhaust systems, and compressed air systems. Also responsible for collection of evidence in the field and conducting laboratory examinations to determine root cause(s) of failure Responsibilities include investigation and analysis of mechanical system failures of plumbing components/systems, appliances, heating, ventilation, and air conditioning (HVAC) equipment. Specific facility system equipment including heat transfer components, exhaust systems, and compressed air systems. Also responsible for collection of evidence in the field and conducting laboratory examinations to determine root cause(s) of failure Experience Forensics Engineer SEA, Ltd. August 2014  – Present (1 year 1 month) Ft. Lauderdale, Florida Facilities Mechanical Engineer Intel Corporation July 2010  –  August 2014  (4 years 2 months) Hillsboro, OR As a cleanroom facilities system engineer, my responsibilities included operating, commissioning, and designing HVAC systems for cleanrooms, support utility buildings, and office spaces. The equipment is started up now serves multiple 100% up-time factories with a combined area over one million square feet which requires impact mitigation management and execution. Surveying Technician Intern Fermilab June 2009  –  September 2009  (4 months) Batavia, IL While working with engineers and surveyors in the metrology and alignment group I was able to develop a survey control network and streamline field data collection. The data we collected was used to locate and align system components of a particle accelerator relative to a control network and to each other within a specification of 50 mils. Due to the limited machine shutdown schedule we had three months to collect and analyze our data in order to make appropriate adjustments to achieve an ultimate machine level design spec of four inches over a four mile circumference. Electrical Engineering Intern City of St. Charles, Illinois June 2008  –  September 2008  (4 months) St. Charles, IL The engineering team I was assigned to had no plan of record for the city electrical distribution grid. As one of the first steps to create an as built plan of record, I visually located and recorded every transformer location, switchgear service distribution, and phase transfer within the city limits. To provide easy information access for city engineers I helped to integrate the electric distribution information I collected into the city’s global information system (GIS). \n \nWhile working with experienced electrical engineers I learned the fundamentals of electric distribution, as well as how voltage is divided and phases are optimized for transportation and consumption. The knowledge I learned from this experience helped me build a solid understanding of electricity and how it integrates with mechanical equipment. Machine Shop Technician Fermilab June 2007  –  September 2007  (4 months) Batavia, IL Working with experienced welders, machinists, and mechanics taught me the fundamentals and limitations of mechanical construction. Having the hands on experience of rebuilding the 1993 AMSE landmark largest cryogenic cooling system, taught me how critical constructability is in design. Forensics Engineer SEA, Ltd. August 2014  – Present (1 year 1 month) Ft. Lauderdale, Florida Forensics Engineer SEA, Ltd. August 2014  – Present (1 year 1 month) Ft. Lauderdale, Florida Facilities Mechanical Engineer Intel Corporation July 2010  –  August 2014  (4 years 2 months) Hillsboro, OR As a cleanroom facilities system engineer, my responsibilities included operating, commissioning, and designing HVAC systems for cleanrooms, support utility buildings, and office spaces. The equipment is started up now serves multiple 100% up-time factories with a combined area over one million square feet which requires impact mitigation management and execution. Facilities Mechanical Engineer Intel Corporation July 2010  –  August 2014  (4 years 2 months) Hillsboro, OR As a cleanroom facilities system engineer, my responsibilities included operating, commissioning, and designing HVAC systems for cleanrooms, support utility buildings, and office spaces. The equipment is started up now serves multiple 100% up-time factories with a combined area over one million square feet which requires impact mitigation management and execution. Surveying Technician Intern Fermilab June 2009  –  September 2009  (4 months) Batavia, IL While working with engineers and surveyors in the metrology and alignment group I was able to develop a survey control network and streamline field data collection. The data we collected was used to locate and align system components of a particle accelerator relative to a control network and to each other within a specification of 50 mils. Due to the limited machine shutdown schedule we had three months to collect and analyze our data in order to make appropriate adjustments to achieve an ultimate machine level design spec of four inches over a four mile circumference. Surveying Technician Intern Fermilab June 2009  –  September 2009  (4 months) Batavia, IL While working with engineers and surveyors in the metrology and alignment group I was able to develop a survey control network and streamline field data collection. The data we collected was used to locate and align system components of a particle accelerator relative to a control network and to each other within a specification of 50 mils. Due to the limited machine shutdown schedule we had three months to collect and analyze our data in order to make appropriate adjustments to achieve an ultimate machine level design spec of four inches over a four mile circumference. Electrical Engineering Intern City of St. Charles, Illinois June 2008  –  September 2008  (4 months) St. Charles, IL The engineering team I was assigned to had no plan of record for the city electrical distribution grid. As one of the first steps to create an as built plan of record, I visually located and recorded every transformer location, switchgear service distribution, and phase transfer within the city limits. To provide easy information access for city engineers I helped to integrate the electric distribution information I collected into the city’s global information system (GIS). \n \nWhile working with experienced electrical engineers I learned the fundamentals of electric distribution, as well as how voltage is divided and phases are optimized for transportation and consumption. The knowledge I learned from this experience helped me build a solid understanding of electricity and how it integrates with mechanical equipment. Electrical Engineering Intern City of St. Charles, Illinois June 2008  –  September 2008  (4 months) St. Charles, IL The engineering team I was assigned to had no plan of record for the city electrical distribution grid. As one of the first steps to create an as built plan of record, I visually located and recorded every transformer location, switchgear service distribution, and phase transfer within the city limits. To provide easy information access for city engineers I helped to integrate the electric distribution information I collected into the city’s global information system (GIS). \n \nWhile working with experienced electrical engineers I learned the fundamentals of electric distribution, as well as how voltage is divided and phases are optimized for transportation and consumption. The knowledge I learned from this experience helped me build a solid understanding of electricity and how it integrates with mechanical equipment. Machine Shop Technician Fermilab June 2007  –  September 2007  (4 months) Batavia, IL Working with experienced welders, machinists, and mechanics taught me the fundamentals and limitations of mechanical construction. Having the hands on experience of rebuilding the 1993 AMSE landmark largest cryogenic cooling system, taught me how critical constructability is in design. Machine Shop Technician Fermilab June 2007  –  September 2007  (4 months) Batavia, IL Working with experienced welders, machinists, and mechanics taught me the fundamentals and limitations of mechanical construction. Having the hands on experience of rebuilding the 1993 AMSE landmark largest cryogenic cooling system, taught me how critical constructability is in design. Languages English French English French English French Skills Engineering Commissioning HVAC Engineering Management Management Facilities Management Mechanical Engineering Design for Manufacturing Design of Experiments Finite Element Analysis Troubleshooting Factory Manufacturing Failure Analysis Pro Engineer Surveying Solidworks Labview SPC GD&T Heat Transfer Manufacturing... Simulations Root Cause Analysis Process Engineering Machining Tolerance Analysis FMEA Lean Manufacturing Automation Electrical Engineering LabVIEW SolidWorks See 18+     See less Skills  Engineering Commissioning HVAC Engineering Management Management Facilities Management Mechanical Engineering Design for Manufacturing Design of Experiments Finite Element Analysis Troubleshooting Factory Manufacturing Failure Analysis Pro Engineer Surveying Solidworks Labview SPC GD&T Heat Transfer Manufacturing... Simulations Root Cause Analysis Process Engineering Machining Tolerance Analysis FMEA Lean Manufacturing Automation Electrical Engineering LabVIEW SolidWorks See 18+     See less Engineering Commissioning HVAC Engineering Management Management Facilities Management Mechanical Engineering Design for Manufacturing Design of Experiments Finite Element Analysis Troubleshooting Factory Manufacturing Failure Analysis Pro Engineer Surveying Solidworks Labview SPC GD&T Heat Transfer Manufacturing... Simulations Root Cause Analysis Process Engineering Machining Tolerance Analysis FMEA Lean Manufacturing Automation Electrical Engineering LabVIEW SolidWorks See 18+     See less Engineering Commissioning HVAC Engineering Management Management Facilities Management Mechanical Engineering Design for Manufacturing Design of Experiments Finite Element Analysis Troubleshooting Factory Manufacturing Failure Analysis Pro Engineer Surveying Solidworks Labview SPC GD&T Heat Transfer Manufacturing... Simulations Root Cause Analysis Process Engineering Machining Tolerance Analysis FMEA Lean Manufacturing Automation Electrical Engineering LabVIEW SolidWorks See 18+     See less Education California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2005  – 2010 Lycee Prelles Vichy, France Honorary Diploma,  Culture and Science 2004  – 2005 Batavia High School High School,  General Studies , 3.5 2000  – 2004 Taking classes such as AP Calculus and AP French challenged me and taught me the benefit to organization. Chemistry and Physics sparked my curiosity in the physical sciences and propelled me into engineering. My literature and economics Professor Dr. Dryden taught me how to cross reference multiple sources and develop a logical line of argument. My multiple extracurricular activities kept me physically fit while challenging my mind in artistic and creative ways. Activities and Societies:  Imperial School of Music (guitar student) ,  Eternal Echo (improvisational music group) ,  Mike Neil Traditional Martial Arts (student and teacher) ,  Football team (center and linebacker) ,  French trip (2003) California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2005  – 2010 California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2005  – 2010 California Polytechnic State University-San Luis Obispo Bachelor of Science (BS),  Mechanical Engineering 2005  – 2010 Lycee Prelles Vichy, France Honorary Diploma,  Culture and Science 2004  – 2005 Lycee Prelles Vichy, France Honorary Diploma,  Culture and Science 2004  – 2005 Lycee Prelles Vichy, France Honorary Diploma,  Culture and Science 2004  – 2005 Batavia High School High School,  General Studies , 3.5 2000  – 2004 Taking classes such as AP Calculus and AP French challenged me and taught me the benefit to organization. Chemistry and Physics sparked my curiosity in the physical sciences and propelled me into engineering. My literature and economics Professor Dr. Dryden taught me how to cross reference multiple sources and develop a logical line of argument. My multiple extracurricular activities kept me physically fit while challenging my mind in artistic and creative ways. Activities and Societies:  Imperial School of Music (guitar student) ,  Eternal Echo (improvisational music group) ,  Mike Neil Traditional Martial Arts (student and teacher) ,  Football team (center and linebacker) ,  French trip (2003) Batavia High School High School,  General Studies , 3.5 2000  – 2004 Taking classes such as AP Calculus and AP French challenged me and taught me the benefit to organization. Chemistry and Physics sparked my curiosity in the physical sciences and propelled me into engineering. My literature and economics Professor Dr. Dryden taught me how to cross reference multiple sources and develop a logical line of argument. My multiple extracurricular activities kept me physically fit while challenging my mind in artistic and creative ways. Activities and Societies:  Imperial School of Music (guitar student) ,  Eternal Echo (improvisational music group) ,  Mike Neil Traditional Martial Arts (student and teacher) ,  Football team (center and linebacker) ,  French trip (2003) Batavia High School High School,  General Studies , 3.5 2000  – 2004 Taking classes such as AP Calculus and AP French challenged me and taught me the benefit to organization. Chemistry and Physics sparked my curiosity in the physical sciences and propelled me into engineering. My literature and economics Professor Dr. Dryden taught me how to cross reference multiple sources and develop a logical line of argument. My multiple extracurricular activities kept me physically fit while challenging my mind in artistic and creative ways. Activities and Societies:  Imperial School of Music (guitar student) ,  Eternal Echo (improvisational music group) ,  Mike Neil Traditional Martial Arts (student and teacher) ,  Football team (center and linebacker) ,  French trip (2003) Honors & Awards International Mechanical Engineering Society Pi Tau Sigma September 2008 PI TAU SIGMA members are chosen on a basis of sound engineering ability, scholarship (upper 35%), personality, and probable future success in their chosen field of Mechanical Engineering. There are three grades of membership: Honorary, Graduate, and Active. Honorary members are technical graduates actively engaged in engineering work; or members of mechanical engineering faculties. Graduate membership is conferred upon persons who would have been eligible had Pi Tau Sigma been established earlier in schools not having chapters, or upon those continuing graduate study. Active members are selected from the junior and senior mechanical engineering classes at their respective schools whose mechanical engineering curriculum must be accredited by ABET.  Honorary Diploma Lycee Prelles June 2005 Taking the French equivalent of high school senior year I concentrated in sciences and mathematics as well as learned to speak conversational French. My year culminated with passing the Baccalaureate exam, which is similar to the SAT/ACT exams. International Mechanical Engineering Society Pi Tau Sigma September 2008 PI TAU SIGMA members are chosen on a basis of sound engineering ability, scholarship (upper 35%), personality, and probable future success in their chosen field of Mechanical Engineering. There are three grades of membership: Honorary, Graduate, and Active. Honorary members are technical graduates actively engaged in engineering work; or members of mechanical engineering faculties. Graduate membership is conferred upon persons who would have been eligible had Pi Tau Sigma been established earlier in schools not having chapters, or upon those continuing graduate study. Active members are selected from the junior and senior mechanical engineering classes at their respective schools whose mechanical engineering curriculum must be accredited by ABET.  International Mechanical Engineering Society Pi Tau Sigma September 2008 PI TAU SIGMA members are chosen on a basis of sound engineering ability, scholarship (upper 35%), personality, and probable future success in their chosen field of Mechanical Engineering. There are three grades of membership: Honorary, Graduate, and Active. Honorary members are technical graduates actively engaged in engineering work; or members of mechanical engineering faculties. Graduate membership is conferred upon persons who would have been eligible had Pi Tau Sigma been established earlier in schools not having chapters, or upon those continuing graduate study. Active members are selected from the junior and senior mechanical engineering classes at their respective schools whose mechanical engineering curriculum must be accredited by ABET.  International Mechanical Engineering Society Pi Tau Sigma September 2008 PI TAU SIGMA members are chosen on a basis of sound engineering ability, scholarship (upper 35%), personality, and probable future success in their chosen field of Mechanical Engineering. There are three grades of membership: Honorary, Graduate, and Active. Honorary members are technical graduates actively engaged in engineering work; or members of mechanical engineering faculties. Graduate membership is conferred upon persons who would have been eligible had Pi Tau Sigma been established earlier in schools not having chapters, or upon those continuing graduate study. Active members are selected from the junior and senior mechanical engineering classes at their respective schools whose mechanical engineering curriculum must be accredited by ABET.  Honorary Diploma Lycee Prelles June 2005 Taking the French equivalent of high school senior year I concentrated in sciences and mathematics as well as learned to speak conversational French. My year culminated with passing the Baccalaureate exam, which is similar to the SAT/ACT exams. Honorary Diploma Lycee Prelles June 2005 Taking the French equivalent of high school senior year I concentrated in sciences and mathematics as well as learned to speak conversational French. My year culminated with passing the Baccalaureate exam, which is similar to the SAT/ACT exams. Honorary Diploma Lycee Prelles June 2005 Taking the French equivalent of high school senior year I concentrated in sciences and mathematics as well as learned to speak conversational French. My year culminated with passing the Baccalaureate exam, which is similar to the SAT/ACT exams. ", "Experience Sr. Mechanical Engineer Intel June 2013  – Present (2 years 3 months) Chandler, Arizona Facilities Mechanical Engineer Intel Corporation June 2001  –  June 2013  (12 years 1 month) Chandler--Ocotillo, Arizona Responsible for system design, improvement and sustaining expansion project for facility mechanical system includes Cleanroom, makeup and recirculation air handlers, process exhaust, boilers, compressed air, central cooling plant, vacuum systems, FFU and ICW system. Duties include sustaining mechanical system without interruption to production, close warranty defects inside systems, and continuous improve system to support factory ramp. Develop utility specification, with the ability of monitoring system with SPC tool to make sure of critical mechanical parameter matching, continuous improve system reliability and performance, coaching & training technicians to certified level. Project Manager BOC Edwards Kachina June 1997  –  June 2001  (4 years 1 month) Phoenix, Arizona Area Sr. Mechanical Engineer Intel June 2013  – Present (2 years 3 months) Chandler, Arizona Sr. Mechanical Engineer Intel June 2013  – Present (2 years 3 months) Chandler, Arizona Facilities Mechanical Engineer Intel Corporation June 2001  –  June 2013  (12 years 1 month) Chandler--Ocotillo, Arizona Responsible for system design, improvement and sustaining expansion project for facility mechanical system includes Cleanroom, makeup and recirculation air handlers, process exhaust, boilers, compressed air, central cooling plant, vacuum systems, FFU and ICW system. Duties include sustaining mechanical system without interruption to production, close warranty defects inside systems, and continuous improve system to support factory ramp. Develop utility specification, with the ability of monitoring system with SPC tool to make sure of critical mechanical parameter matching, continuous improve system reliability and performance, coaching & training technicians to certified level. Facilities Mechanical Engineer Intel Corporation June 2001  –  June 2013  (12 years 1 month) Chandler--Ocotillo, Arizona Responsible for system design, improvement and sustaining expansion project for facility mechanical system includes Cleanroom, makeup and recirculation air handlers, process exhaust, boilers, compressed air, central cooling plant, vacuum systems, FFU and ICW system. Duties include sustaining mechanical system without interruption to production, close warranty defects inside systems, and continuous improve system to support factory ramp. Develop utility specification, with the ability of monitoring system with SPC tool to make sure of critical mechanical parameter matching, continuous improve system reliability and performance, coaching & training technicians to certified level. Project Manager BOC Edwards Kachina June 1997  –  June 2001  (4 years 1 month) Phoenix, Arizona Area Project Manager BOC Edwards Kachina June 1997  –  June 2001  (4 years 1 month) Phoenix, Arizona Area Skills Engineering Management Manufacturing... Semiconductors Manufacturing Failure Analysis SPC Root Cause Analysis Design for Manufacturing Semiconductor Industry R&D Engineering Systems Engineering Factory Pro Engineer Skills  Engineering Management Manufacturing... Semiconductors Manufacturing Failure Analysis SPC Root Cause Analysis Design for Manufacturing Semiconductor Industry R&D Engineering Systems Engineering Factory Pro Engineer Engineering Management Manufacturing... Semiconductors Manufacturing Failure Analysis SPC Root Cause Analysis Design for Manufacturing Semiconductor Industry R&D Engineering Systems Engineering Factory Pro Engineer Engineering Management Manufacturing... Semiconductors Manufacturing Failure Analysis SPC Root Cause Analysis Design for Manufacturing Semiconductor Industry R&D Engineering Systems Engineering Factory Pro Engineer Education Texas Tech University Bachelor of Science (BS),  Mechanical Engineering 1989  – 1994 Texas Tech University Bachelor of Science (BS),  Mechanical Engineering 1989  – 1994 Texas Tech University Bachelor of Science (BS),  Mechanical Engineering 1989  – 1994 Texas Tech University Bachelor of Science (BS),  Mechanical Engineering 1989  – 1994 ", "Experience Facilities Mechanical Engineer Intel Corporation May 2005  – Present (10 years 4 months) Maintenance technican RPS Group 2004  –  2005  (1 year) Facilites Managment lead George S Halls September 2003  –  September 2004  (1 year 1 month) Hewlett Packard Facilities Mechanical Engineer Intel Corporation May 2005  – Present (10 years 4 months) Facilities Mechanical Engineer Intel Corporation May 2005  – Present (10 years 4 months) Maintenance technican RPS Group 2004  –  2005  (1 year) Maintenance technican RPS Group 2004  –  2005  (1 year) Facilites Managment lead George S Halls September 2003  –  September 2004  (1 year 1 month) Hewlett Packard Facilites Managment lead George S Halls September 2003  –  September 2004  (1 year 1 month) Hewlett Packard Skills Engineering Fluid Mechanics Manufacturing Robotics HVAC Preventive Maintenance Pneumatics Reliability Engineering Continuous Improvement Mechanical Engineering Process Engineering Electronics CAD PLC Commissioning Pro Engineer Automation Product Development Lean Manufacturing Project Engineering Instrumentation AutoCAD Process Control Matlab Calibration Validation See 11+     See less Skills  Engineering Fluid Mechanics Manufacturing Robotics HVAC Preventive Maintenance Pneumatics Reliability Engineering Continuous Improvement Mechanical Engineering Process Engineering Electronics CAD PLC Commissioning Pro Engineer Automation Product Development Lean Manufacturing Project Engineering Instrumentation AutoCAD Process Control Matlab Calibration Validation See 11+     See less Engineering Fluid Mechanics Manufacturing Robotics HVAC Preventive Maintenance Pneumatics Reliability Engineering Continuous Improvement Mechanical Engineering Process Engineering Electronics CAD PLC Commissioning Pro Engineer Automation Product Development Lean Manufacturing Project Engineering Instrumentation AutoCAD Process Control Matlab Calibration Validation See 11+     See less Engineering Fluid Mechanics Manufacturing Robotics HVAC Preventive Maintenance Pneumatics Reliability Engineering Continuous Improvement Mechanical Engineering Process Engineering Electronics CAD PLC Commissioning Pro Engineer Automation Product Development Lean Manufacturing Project Engineering Instrumentation AutoCAD Process Control Matlab Calibration Validation See 11+     See less Education Arizona State University Facilities Managers Development program 2011  – 2012 ITT Dublin Bachelor's degree,  Mechanical Engineering 2009  – 2012 Apprentice Fitter/Turner Bolton Street Senior Trades in Fitting/turning,  Fitting/turning 1989  – 1993 Arizona State University Facilities Managers Development program 2011  – 2012 Arizona State University Facilities Managers Development program 2011  – 2012 Arizona State University Facilities Managers Development program 2011  – 2012 ITT Dublin Bachelor's degree,  Mechanical Engineering 2009  – 2012 Apprentice Fitter/Turner ITT Dublin Bachelor's degree,  Mechanical Engineering 2009  – 2012 Apprentice Fitter/Turner ITT Dublin Bachelor's degree,  Mechanical Engineering 2009  – 2012 Apprentice Fitter/Turner Bolton Street Senior Trades in Fitting/turning,  Fitting/turning 1989  – 1993 Bolton Street Senior Trades in Fitting/turning,  Fitting/turning 1989  – 1993 Bolton Street Senior Trades in Fitting/turning,  Fitting/turning 1989  – 1993 ", "Experience CloudPath Infrastructure Manager Amazon Web Services July 2015  – Present (2 months) Seattle, Washington Infrastructure Fleet Management Facilities Mechanical Engineer Intel Corporation June 2010  –  June 2015  (5 years 1 month) Engineering system ownership of mechanical and process mechanical systems supporting multiple semiconductor manufacturing plants. Duties include technical writing, white papers, statistical process control (SPC), configuration control, capacity ownership, system optimization, energy conservation, commissioning activities, advanced troubleshooting and engineering support for operations on exhaust abatement, compressed clean dry air (CDA), steam, hot water, chilled water, vacuum, process cooling water and HVAC systems. Mechanical Engineering Intern CDM Smith May 2009  –  August 2009  (4 months) Albany, New York Area Responsible for spearheading creation of building energy usage models using e-Quest software as a tool for analyzing the effects of implementing various energy conservation techniques/technologies in design. Also, assisted senior engineers in design, drafting, and submittal review for small projects involving mechanical, HVAC, and process system design. CloudPath Infrastructure Manager Amazon Web Services July 2015  – Present (2 months) Seattle, Washington Infrastructure Fleet Management CloudPath Infrastructure Manager Amazon Web Services July 2015  – Present (2 months) Seattle, Washington Infrastructure Fleet Management Facilities Mechanical Engineer Intel Corporation June 2010  –  June 2015  (5 years 1 month) Engineering system ownership of mechanical and process mechanical systems supporting multiple semiconductor manufacturing plants. Duties include technical writing, white papers, statistical process control (SPC), configuration control, capacity ownership, system optimization, energy conservation, commissioning activities, advanced troubleshooting and engineering support for operations on exhaust abatement, compressed clean dry air (CDA), steam, hot water, chilled water, vacuum, process cooling water and HVAC systems. Facilities Mechanical Engineer Intel Corporation June 2010  –  June 2015  (5 years 1 month) Engineering system ownership of mechanical and process mechanical systems supporting multiple semiconductor manufacturing plants. Duties include technical writing, white papers, statistical process control (SPC), configuration control, capacity ownership, system optimization, energy conservation, commissioning activities, advanced troubleshooting and engineering support for operations on exhaust abatement, compressed clean dry air (CDA), steam, hot water, chilled water, vacuum, process cooling water and HVAC systems. Mechanical Engineering Intern CDM Smith May 2009  –  August 2009  (4 months) Albany, New York Area Responsible for spearheading creation of building energy usage models using e-Quest software as a tool for analyzing the effects of implementing various energy conservation techniques/technologies in design. Also, assisted senior engineers in design, drafting, and submittal review for small projects involving mechanical, HVAC, and process system design. Mechanical Engineering Intern CDM Smith May 2009  –  August 2009  (4 months) Albany, New York Area Responsible for spearheading creation of building energy usage models using e-Quest software as a tool for analyzing the effects of implementing various energy conservation techniques/technologies in design. Also, assisted senior engineers in design, drafting, and submittal review for small projects involving mechanical, HVAC, and process system design. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Strategic Planning Adaptability Collaborative Problem... Interdisciplinary... Sense Of Urgency Strong Ownership Skilled Multi-tasker Microsoft Office Excellent... JMP AutoCAD eQuest Java High Achiever Skills  Strategic Planning Adaptability Collaborative Problem... Interdisciplinary... Sense Of Urgency Strong Ownership Skilled Multi-tasker Microsoft Office Excellent... JMP AutoCAD eQuest Java High Achiever Strategic Planning Adaptability Collaborative Problem... Interdisciplinary... Sense Of Urgency Strong Ownership Skilled Multi-tasker Microsoft Office Excellent... JMP AutoCAD eQuest Java High Achiever Strategic Planning Adaptability Collaborative Problem... Interdisciplinary... Sense Of Urgency Strong Ownership Skilled Multi-tasker Microsoft Office Excellent... JMP AutoCAD eQuest Java High Achiever Education Arizona State University Master of Engineering (MEng),  Systems Engineering 2013  – 2015 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA) 2013  – 2015 Columbia University in the City of New York Bachelor of Science (B.S.),  Mechanical Engineering 2006  – 2010 Activities and Societies:  Society of Hispanic Professional Engineers (SHPE) and Community Impact Arizona State University Master of Engineering (MEng),  Systems Engineering 2013  – 2015 Arizona State University Master of Engineering (MEng),  Systems Engineering 2013  – 2015 Arizona State University Master of Engineering (MEng),  Systems Engineering 2013  – 2015 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA) 2013  – 2015 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA) 2013  – 2015 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA) 2013  – 2015 Columbia University in the City of New York Bachelor of Science (B.S.),  Mechanical Engineering 2006  – 2010 Activities and Societies:  Society of Hispanic Professional Engineers (SHPE) and Community Impact Columbia University in the City of New York Bachelor of Science (B.S.),  Mechanical Engineering 2006  – 2010 Activities and Societies:  Society of Hispanic Professional Engineers (SHPE) and Community Impact Columbia University in the City of New York Bachelor of Science (B.S.),  Mechanical Engineering 2006  – 2010 Activities and Societies:  Society of Hispanic Professional Engineers (SHPE) and Community Impact ", "Experience Senior Engineer Albuquerque Bernalillo County Water Utility Authority April 2015  – Present (5 months) Albuquerque, New Mexico Area Industrial Waste and Ultrapure Water Engineer Intel Corporation January 2012  – Present (3 years 8 months) Albuquerque, New Mexico Area As an Industrial Waste and Ultrapure water engineer at Intel New Mexico, I'm responsible for working with operations to ensure waste and ultrapure water systems operate reliably within EHS and factory criteria. My primary focus is increasing system efficiency resulting in decreased operation cost and water usage. Facilities/Mechanical Engineer Intel Corporation June 2008  –  January 2012  (3 years 8 months) Albuquerque, New Mexico Area While in the Mechanical Module at Intel, I was responsible for maintaining, streamlining, and increasing reliability of site exhaust and abatement systems. I utilized test and balance field data and Pipe-Flo modeling software to investigate pressure drop pinch-points in ducting systems. I then lead multiple projects to modify ducting systems to reduce the overall pressure drop of exhaust systems, resulting in increased system capacity at minimum cost. \n \nAs part of my system ownership I performed equipment commissioning, start ups, and factory integration of fans, wet scrubber, solvent destruct units, and exhaust systems. I coordinated abatement equipment start up with factory and EHS customers to ensure systems operated within site criteria. Senior Engineer Albuquerque Bernalillo County Water Utility Authority April 2015  – Present (5 months) Albuquerque, New Mexico Area Senior Engineer Albuquerque Bernalillo County Water Utility Authority April 2015  – Present (5 months) Albuquerque, New Mexico Area Industrial Waste and Ultrapure Water Engineer Intel Corporation January 2012  – Present (3 years 8 months) Albuquerque, New Mexico Area As an Industrial Waste and Ultrapure water engineer at Intel New Mexico, I'm responsible for working with operations to ensure waste and ultrapure water systems operate reliably within EHS and factory criteria. My primary focus is increasing system efficiency resulting in decreased operation cost and water usage. Industrial Waste and Ultrapure Water Engineer Intel Corporation January 2012  – Present (3 years 8 months) Albuquerque, New Mexico Area As an Industrial Waste and Ultrapure water engineer at Intel New Mexico, I'm responsible for working with operations to ensure waste and ultrapure water systems operate reliably within EHS and factory criteria. My primary focus is increasing system efficiency resulting in decreased operation cost and water usage. Facilities/Mechanical Engineer Intel Corporation June 2008  –  January 2012  (3 years 8 months) Albuquerque, New Mexico Area While in the Mechanical Module at Intel, I was responsible for maintaining, streamlining, and increasing reliability of site exhaust and abatement systems. I utilized test and balance field data and Pipe-Flo modeling software to investigate pressure drop pinch-points in ducting systems. I then lead multiple projects to modify ducting systems to reduce the overall pressure drop of exhaust systems, resulting in increased system capacity at minimum cost. \n \nAs part of my system ownership I performed equipment commissioning, start ups, and factory integration of fans, wet scrubber, solvent destruct units, and exhaust systems. I coordinated abatement equipment start up with factory and EHS customers to ensure systems operated within site criteria. Facilities/Mechanical Engineer Intel Corporation June 2008  –  January 2012  (3 years 8 months) Albuquerque, New Mexico Area While in the Mechanical Module at Intel, I was responsible for maintaining, streamlining, and increasing reliability of site exhaust and abatement systems. I utilized test and balance field data and Pipe-Flo modeling software to investigate pressure drop pinch-points in ducting systems. I then lead multiple projects to modify ducting systems to reduce the overall pressure drop of exhaust systems, resulting in increased system capacity at minimum cost. \n \nAs part of my system ownership I performed equipment commissioning, start ups, and factory integration of fans, wet scrubber, solvent destruct units, and exhaust systems. I coordinated abatement equipment start up with factory and EHS customers to ensure systems operated within site criteria. Languages   Skills Semiconductors Design of Experiments SPC Semiconductor Industry IC Failure Analysis JMP Simulations Characterization Process Simulation Skills  Semiconductors Design of Experiments SPC Semiconductor Industry IC Failure Analysis JMP Simulations Characterization Process Simulation Semiconductors Design of Experiments SPC Semiconductor Industry IC Failure Analysis JMP Simulations Characterization Process Simulation Semiconductors Design of Experiments SPC Semiconductor Industry IC Failure Analysis JMP Simulations Characterization Process Simulation Education The University of New Mexico Master's degree,  Chemical Engineering 2005  – 2008 The University of New Mexico Bachelor's degree,  Chemical Engineering 2002  – 2005 The University of New Mexico Master's degree,  Chemical Engineering 2005  – 2008 The University of New Mexico Master's degree,  Chemical Engineering 2005  – 2008 The University of New Mexico Master's degree,  Chemical Engineering 2005  – 2008 The University of New Mexico Bachelor's degree,  Chemical Engineering 2002  – 2005 The University of New Mexico Bachelor's degree,  Chemical Engineering 2002  – 2005 The University of New Mexico Bachelor's degree,  Chemical Engineering 2002  – 2005 Honors & Awards ", "Summary I have been working on facilities management and operations since 2002. Plant building and start up. Electromechanical systems maintenance and troubleshooting, building maintenance, people and contracts management, energy management and expense / capital budget management are part of my scope of work. \n \nI'm self motivated, issues solver and with a strong orientation to costumers striving to attend their requirements with a high sense of urgency. \n \nLooking forward for better communication abilities in order to improve the expectations between customers and the organization strategic objectives. \n \nAchievements \n- Recovering and operation a biological waste water treatment plant and a nitrogen destilating plant.  \n- Management of the Facilities department for a medical devices manufacturing plant.  \n- Starting from green field a 40k m2 medical manufacturing plant and supported all the mechanical construction activities and contractors. \n- Development of the entire maintenance and operations program for electromechanical systems required to support ISO class 7 & 8 clean rooms continuous operation. At this moment, I'm in charge of Facilities Sustaining operations of this plant with great contribution on cost savings thru energy conservation initiatives. Summary I have been working on facilities management and operations since 2002. Plant building and start up. Electromechanical systems maintenance and troubleshooting, building maintenance, people and contracts management, energy management and expense / capital budget management are part of my scope of work. \n \nI'm self motivated, issues solver and with a strong orientation to costumers striving to attend their requirements with a high sense of urgency. \n \nLooking forward for better communication abilities in order to improve the expectations between customers and the organization strategic objectives. \n \nAchievements \n- Recovering and operation a biological waste water treatment plant and a nitrogen destilating plant.  \n- Management of the Facilities department for a medical devices manufacturing plant.  \n- Starting from green field a 40k m2 medical manufacturing plant and supported all the mechanical construction activities and contractors. \n- Development of the entire maintenance and operations program for electromechanical systems required to support ISO class 7 & 8 clean rooms continuous operation. At this moment, I'm in charge of Facilities Sustaining operations of this plant with great contribution on cost savings thru energy conservation initiatives. I have been working on facilities management and operations since 2002. Plant building and start up. Electromechanical systems maintenance and troubleshooting, building maintenance, people and contracts management, energy management and expense / capital budget management are part of my scope of work. \n \nI'm self motivated, issues solver and with a strong orientation to costumers striving to attend their requirements with a high sense of urgency. \n \nLooking forward for better communication abilities in order to improve the expectations between customers and the organization strategic objectives. \n \nAchievements \n- Recovering and operation a biological waste water treatment plant and a nitrogen destilating plant.  \n- Management of the Facilities department for a medical devices manufacturing plant.  \n- Starting from green field a 40k m2 medical manufacturing plant and supported all the mechanical construction activities and contractors. \n- Development of the entire maintenance and operations program for electromechanical systems required to support ISO class 7 & 8 clean rooms continuous operation. At this moment, I'm in charge of Facilities Sustaining operations of this plant with great contribution on cost savings thru energy conservation initiatives. I have been working on facilities management and operations since 2002. Plant building and start up. Electromechanical systems maintenance and troubleshooting, building maintenance, people and contracts management, energy management and expense / capital budget management are part of my scope of work. \n \nI'm self motivated, issues solver and with a strong orientation to costumers striving to attend their requirements with a high sense of urgency. \n \nLooking forward for better communication abilities in order to improve the expectations between customers and the organization strategic objectives. \n \nAchievements \n- Recovering and operation a biological waste water treatment plant and a nitrogen destilating plant.  \n- Management of the Facilities department for a medical devices manufacturing plant.  \n- Starting from green field a 40k m2 medical manufacturing plant and supported all the mechanical construction activities and contractors. \n- Development of the entire maintenance and operations program for electromechanical systems required to support ISO class 7 & 8 clean rooms continuous operation. At this moment, I'm in charge of Facilities Sustaining operations of this plant with great contribution on cost savings thru energy conservation initiatives. Experience Facilities Principal Engineer St . Jude Medical March 2014  – Present (1 year 6 months) Leadership and technical support for all the Facilities including employee services, building maintenance and contracts, security, all electromechanical systems and BMS, and Facilities Budget management. senior Facilities Operations Section Leader St. Jude Medical September 2009  – Present (6 years) alajuela, costa rica Responsible for the operation of electromechanical systems supporting Clean Room Manufacturing processes and overall building infrastructure. In charge of engineers and maintenance technicians providing leadership and growth thru coaching and assertive communication. Highly oriented to Safety and Environmental operations. Budget planning and control. Experienced with contracts management and contractors' performance control. Knowledgable of Maintenance (corrective, preventive and predictive maintenance), structured problem solving and troubleshooting experience on Ultra Pure Water, Exhaust, Vacuum, HVAC, Fire Protection and Life Safety Systems, Oil Free Compressed Air, Nitrogen and Hydronic systems. Support Building Construction projects through field inspections, commissioning and testing. Experience and knowledge on air and hidronic test and balance for building and clean rooms HVAC systems. Knowledgeable of Business continuity and emergency response plans. Facilities supervisor ATEK Medical November 2008  –  September 2009  (11 months) responsible for the flawless operation of mechanical facilities supporting manufacturing process. Maintenance and trouble shooting experience on exhaust, vacuum, HVAC, oil free air and hydronic systems. Support Building Systems through corrective, preventive and predictive maintenance. Facilities mechanical engineer Intel Corporation June 2002  –  November 2008  (6 years 6 months) Heredia, Belen, la Ribera. Responsible for the flawless operation of mechanical facilities that supports 24 by 7 manufacturing process. Maintenance and troubleshooting experience on exhaust, vacuum, HVAC, Data Centers AC, Oil free compressed air, hydronic, Fire protection and LSS, Wastewater treatment systems and nitrogen distillation plant. Support Building Systems through corrective, preventive and predictive maintenance. Provides engineering services in projects design reviews, construction support and commissioning/startup process. Ensures factory and equipment reliability by preventing, detecting and solving abnormalities using prompt response and statistical analysis tools. Data analysis using statistical tools for structured problem solving. Environmental, Health and Safety experience. \n \nMechanical project engineer, project implementation for new process integration.  \nResponsible for the long lead items acquisition process, budget and schedule control and general mechanical operations. This includes the mechanical installation and start up of HVAC equipment such as 1 chiller, 2 air handler units, 1 cooling tower and 2 centrifugal pumps, ductwork, metal piping for cooling water and ventilation fans. Facilities Principal Engineer St . Jude Medical March 2014  – Present (1 year 6 months) Leadership and technical support for all the Facilities including employee services, building maintenance and contracts, security, all electromechanical systems and BMS, and Facilities Budget management. Facilities Principal Engineer St . Jude Medical March 2014  – Present (1 year 6 months) Leadership and technical support for all the Facilities including employee services, building maintenance and contracts, security, all electromechanical systems and BMS, and Facilities Budget management. senior Facilities Operations Section Leader St. Jude Medical September 2009  – Present (6 years) alajuela, costa rica Responsible for the operation of electromechanical systems supporting Clean Room Manufacturing processes and overall building infrastructure. In charge of engineers and maintenance technicians providing leadership and growth thru coaching and assertive communication. Highly oriented to Safety and Environmental operations. Budget planning and control. Experienced with contracts management and contractors' performance control. Knowledgable of Maintenance (corrective, preventive and predictive maintenance), structured problem solving and troubleshooting experience on Ultra Pure Water, Exhaust, Vacuum, HVAC, Fire Protection and Life Safety Systems, Oil Free Compressed Air, Nitrogen and Hydronic systems. Support Building Construction projects through field inspections, commissioning and testing. Experience and knowledge on air and hidronic test and balance for building and clean rooms HVAC systems. Knowledgeable of Business continuity and emergency response plans. senior Facilities Operations Section Leader St. Jude Medical September 2009  – Present (6 years) alajuela, costa rica Responsible for the operation of electromechanical systems supporting Clean Room Manufacturing processes and overall building infrastructure. In charge of engineers and maintenance technicians providing leadership and growth thru coaching and assertive communication. Highly oriented to Safety and Environmental operations. Budget planning and control. Experienced with contracts management and contractors' performance control. Knowledgable of Maintenance (corrective, preventive and predictive maintenance), structured problem solving and troubleshooting experience on Ultra Pure Water, Exhaust, Vacuum, HVAC, Fire Protection and Life Safety Systems, Oil Free Compressed Air, Nitrogen and Hydronic systems. Support Building Construction projects through field inspections, commissioning and testing. Experience and knowledge on air and hidronic test and balance for building and clean rooms HVAC systems. Knowledgeable of Business continuity and emergency response plans. Facilities supervisor ATEK Medical November 2008  –  September 2009  (11 months) responsible for the flawless operation of mechanical facilities supporting manufacturing process. Maintenance and trouble shooting experience on exhaust, vacuum, HVAC, oil free air and hydronic systems. Support Building Systems through corrective, preventive and predictive maintenance. Facilities supervisor ATEK Medical November 2008  –  September 2009  (11 months) responsible for the flawless operation of mechanical facilities supporting manufacturing process. Maintenance and trouble shooting experience on exhaust, vacuum, HVAC, oil free air and hydronic systems. Support Building Systems through corrective, preventive and predictive maintenance. Facilities mechanical engineer Intel Corporation June 2002  –  November 2008  (6 years 6 months) Heredia, Belen, la Ribera. Responsible for the flawless operation of mechanical facilities that supports 24 by 7 manufacturing process. Maintenance and troubleshooting experience on exhaust, vacuum, HVAC, Data Centers AC, Oil free compressed air, hydronic, Fire protection and LSS, Wastewater treatment systems and nitrogen distillation plant. Support Building Systems through corrective, preventive and predictive maintenance. Provides engineering services in projects design reviews, construction support and commissioning/startup process. Ensures factory and equipment reliability by preventing, detecting and solving abnormalities using prompt response and statistical analysis tools. Data analysis using statistical tools for structured problem solving. Environmental, Health and Safety experience. \n \nMechanical project engineer, project implementation for new process integration.  \nResponsible for the long lead items acquisition process, budget and schedule control and general mechanical operations. This includes the mechanical installation and start up of HVAC equipment such as 1 chiller, 2 air handler units, 1 cooling tower and 2 centrifugal pumps, ductwork, metal piping for cooling water and ventilation fans. Facilities mechanical engineer Intel Corporation June 2002  –  November 2008  (6 years 6 months) Heredia, Belen, la Ribera. Responsible for the flawless operation of mechanical facilities that supports 24 by 7 manufacturing process. Maintenance and troubleshooting experience on exhaust, vacuum, HVAC, Data Centers AC, Oil free compressed air, hydronic, Fire protection and LSS, Wastewater treatment systems and nitrogen distillation plant. Support Building Systems through corrective, preventive and predictive maintenance. Provides engineering services in projects design reviews, construction support and commissioning/startup process. Ensures factory and equipment reliability by preventing, detecting and solving abnormalities using prompt response and statistical analysis tools. Data analysis using statistical tools for structured problem solving. Environmental, Health and Safety experience. \n \nMechanical project engineer, project implementation for new process integration.  \nResponsible for the long lead items acquisition process, budget and schedule control and general mechanical operations. This includes the mechanical installation and start up of HVAC equipment such as 1 chiller, 2 air handler units, 1 cooling tower and 2 centrifugal pumps, ductwork, metal piping for cooling water and ventilation fans. Languages Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Engineering Commissioning HVAC Preventive Maintenance Piping Testing Project Planning Facilities Management Factory Troubleshooting Contract Management Ventilation Medical Devices Department Budget... HVAC Controls HVAC test and balance building maintenance Quality System CAPA FMEA 5S Root Cause Analysis MS Project Clean Rooms Mechanical Engineering Maintenance  DMAIC Facilities Operations ISO 13485 Energy Management Facilities Engineering Leadership Supervisory Skills Maintenance Management SPC Manufacturing Department Budgeting Continuous Improvement Equipment Installation Equipment Maintenance Electro-mechanical Budgets Operational Excellence See 28+     See less Skills  Engineering Commissioning HVAC Preventive Maintenance Piping Testing Project Planning Facilities Management Factory Troubleshooting Contract Management Ventilation Medical Devices Department Budget... HVAC Controls HVAC test and balance building maintenance Quality System CAPA FMEA 5S Root Cause Analysis MS Project Clean Rooms Mechanical Engineering Maintenance  DMAIC Facilities Operations ISO 13485 Energy Management Facilities Engineering Leadership Supervisory Skills Maintenance Management SPC Manufacturing Department Budgeting Continuous Improvement Equipment Installation Equipment Maintenance Electro-mechanical Budgets Operational Excellence See 28+     See less Engineering Commissioning HVAC Preventive Maintenance Piping Testing Project Planning Facilities Management Factory Troubleshooting Contract Management Ventilation Medical Devices Department Budget... HVAC Controls HVAC test and balance building maintenance Quality System CAPA FMEA 5S Root Cause Analysis MS Project Clean Rooms Mechanical Engineering Maintenance  DMAIC Facilities Operations ISO 13485 Energy Management Facilities Engineering Leadership Supervisory Skills Maintenance Management SPC Manufacturing Department Budgeting Continuous Improvement Equipment Installation Equipment Maintenance Electro-mechanical Budgets Operational Excellence See 28+     See less Engineering Commissioning HVAC Preventive Maintenance Piping Testing Project Planning Facilities Management Factory Troubleshooting Contract Management Ventilation Medical Devices Department Budget... HVAC Controls HVAC test and balance building maintenance Quality System CAPA FMEA 5S Root Cause Analysis MS Project Clean Rooms Mechanical Engineering Maintenance  DMAIC Facilities Operations ISO 13485 Energy Management Facilities Engineering Leadership Supervisory Skills Maintenance Management SPC Manufacturing Department Budgeting Continuous Improvement Equipment Installation Equipment Maintenance Electro-mechanical Budgets Operational Excellence See 28+     See less Education Tecnológico de Costa Rica Master,  Project Management 2012  – 2014 Seminars and conferences Fire Protection 2004  – 2006 Reprocom, San José, Costa Rica\tNFPA 71, NEC National electrical code training \n2005, NFPA, Garbo y Asoc, San José, Costa Rica\tNFPA 101, Life safety code certification \n2005, NFPA, Garbo y Asoc, San José, Costa Rica NFPA 13, Installation of sprinklers training \n2003, Universidad de Costa Rica, San José, Costa Rica\tHVAC Fundamentals \n2002, ENTEK/IRD Rockwell Automation, Philadelphia, EEUU\tVibration analysis, cert level 1 Instituto Tecnológico de Costa Rica Bachelor,  Electromechanical engineering , Maintenance engineer 1995  – 2001 Tecnológico de Costa Rica Master,  Project Management 2012  – 2014 Tecnológico de Costa Rica Master,  Project Management 2012  – 2014 Tecnológico de Costa Rica Master,  Project Management 2012  – 2014 Seminars and conferences Fire Protection 2004  – 2006 Reprocom, San José, Costa Rica\tNFPA 71, NEC National electrical code training \n2005, NFPA, Garbo y Asoc, San José, Costa Rica\tNFPA 101, Life safety code certification \n2005, NFPA, Garbo y Asoc, San José, Costa Rica NFPA 13, Installation of sprinklers training \n2003, Universidad de Costa Rica, San José, Costa Rica\tHVAC Fundamentals \n2002, ENTEK/IRD Rockwell Automation, Philadelphia, EEUU\tVibration analysis, cert level 1 Seminars and conferences Fire Protection 2004  – 2006 Reprocom, San José, Costa Rica\tNFPA 71, NEC National electrical code training \n2005, NFPA, Garbo y Asoc, San José, Costa Rica\tNFPA 101, Life safety code certification \n2005, NFPA, Garbo y Asoc, San José, Costa Rica NFPA 13, Installation of sprinklers training \n2003, Universidad de Costa Rica, San José, Costa Rica\tHVAC Fundamentals \n2002, ENTEK/IRD Rockwell Automation, Philadelphia, EEUU\tVibration analysis, cert level 1 Seminars and conferences Fire Protection 2004  – 2006 Reprocom, San José, Costa Rica\tNFPA 71, NEC National electrical code training \n2005, NFPA, Garbo y Asoc, San José, Costa Rica\tNFPA 101, Life safety code certification \n2005, NFPA, Garbo y Asoc, San José, Costa Rica NFPA 13, Installation of sprinklers training \n2003, Universidad de Costa Rica, San José, Costa Rica\tHVAC Fundamentals \n2002, ENTEK/IRD Rockwell Automation, Philadelphia, EEUU\tVibration analysis, cert level 1 Instituto Tecnológico de Costa Rica Bachelor,  Electromechanical engineering , Maintenance engineer 1995  – 2001 Instituto Tecnológico de Costa Rica Bachelor,  Electromechanical engineering , Maintenance engineer 1995  – 2001 Instituto Tecnológico de Costa Rica Bachelor,  Electromechanical engineering , Maintenance engineer 1995  – 2001 ", "Summary A Sr. Reliability Engineer with comprehensive technical abilities, people skills and global experience in Production Operations, Facilities Engineering, Project Management, Operational Excellence and Team Leadership. A creative leader able to conceptualize and secure new opportunities, resolve problems, increase revenue and reduce expenses. \n \nAREAS OF EXPERTISE \n• Project/Contract Management  \n• Strategic Planning \n• Relationship Development  \n• Staff and Team Development \n• Budget Development  \n• International Program Implementation \n• Continuous Improvement/Six Sigma \n• Quality Systems  \n• New Business Development  \n \nPROVEN ACCOMPLISHMENTS \nDeveloped a new product enabling equipment modification to meet Customer needs. Conceptualized, designed and managed installation of new equipment components at Asian manufacturing facility. RESULTS: On time new product introduction with revenues increasing from $10 million to over $20 million annually over past four years. \n \nImplemented an OSHA Compliant Electrical Safety Program globally to reduce employee exposure to electric shock and ArcFlash hazards and to eliminate a non-compliance issue. Managed Engineering Consultant’s evaluation and documentation of the electrical systems hazard levels. RESULTS: Globally, no Energized Work Permits have been issued for the last five years and no employees have been injured doing electrical work. \n \nAnalyzed the high failure rate of mixer seals with a global cost impact of $480,000 per year. Documented current replacement process and identified opportunities for reductions. Recommended bringing rebuild activities in-house, standardized seal installation procedures and trained personnel. RESULTS: Mixer seal parts and motor replacement costs were reduced by $350,000 per year. Summary A Sr. Reliability Engineer with comprehensive technical abilities, people skills and global experience in Production Operations, Facilities Engineering, Project Management, Operational Excellence and Team Leadership. A creative leader able to conceptualize and secure new opportunities, resolve problems, increase revenue and reduce expenses. \n \nAREAS OF EXPERTISE \n• Project/Contract Management  \n• Strategic Planning \n• Relationship Development  \n• Staff and Team Development \n• Budget Development  \n• International Program Implementation \n• Continuous Improvement/Six Sigma \n• Quality Systems  \n• New Business Development  \n \nPROVEN ACCOMPLISHMENTS \nDeveloped a new product enabling equipment modification to meet Customer needs. Conceptualized, designed and managed installation of new equipment components at Asian manufacturing facility. RESULTS: On time new product introduction with revenues increasing from $10 million to over $20 million annually over past four years. \n \nImplemented an OSHA Compliant Electrical Safety Program globally to reduce employee exposure to electric shock and ArcFlash hazards and to eliminate a non-compliance issue. Managed Engineering Consultant’s evaluation and documentation of the electrical systems hazard levels. RESULTS: Globally, no Energized Work Permits have been issued for the last five years and no employees have been injured doing electrical work. \n \nAnalyzed the high failure rate of mixer seals with a global cost impact of $480,000 per year. Documented current replacement process and identified opportunities for reductions. Recommended bringing rebuild activities in-house, standardized seal installation procedures and trained personnel. RESULTS: Mixer seal parts and motor replacement costs were reduced by $350,000 per year. A Sr. Reliability Engineer with comprehensive technical abilities, people skills and global experience in Production Operations, Facilities Engineering, Project Management, Operational Excellence and Team Leadership. A creative leader able to conceptualize and secure new opportunities, resolve problems, increase revenue and reduce expenses. \n \nAREAS OF EXPERTISE \n• Project/Contract Management  \n• Strategic Planning \n• Relationship Development  \n• Staff and Team Development \n• Budget Development  \n• International Program Implementation \n• Continuous Improvement/Six Sigma \n• Quality Systems  \n• New Business Development  \n \nPROVEN ACCOMPLISHMENTS \nDeveloped a new product enabling equipment modification to meet Customer needs. Conceptualized, designed and managed installation of new equipment components at Asian manufacturing facility. RESULTS: On time new product introduction with revenues increasing from $10 million to over $20 million annually over past four years. \n \nImplemented an OSHA Compliant Electrical Safety Program globally to reduce employee exposure to electric shock and ArcFlash hazards and to eliminate a non-compliance issue. Managed Engineering Consultant’s evaluation and documentation of the electrical systems hazard levels. RESULTS: Globally, no Energized Work Permits have been issued for the last five years and no employees have been injured doing electrical work. \n \nAnalyzed the high failure rate of mixer seals with a global cost impact of $480,000 per year. Documented current replacement process and identified opportunities for reductions. Recommended bringing rebuild activities in-house, standardized seal installation procedures and trained personnel. RESULTS: Mixer seal parts and motor replacement costs were reduced by $350,000 per year. A Sr. Reliability Engineer with comprehensive technical abilities, people skills and global experience in Production Operations, Facilities Engineering, Project Management, Operational Excellence and Team Leadership. A creative leader able to conceptualize and secure new opportunities, resolve problems, increase revenue and reduce expenses. \n \nAREAS OF EXPERTISE \n• Project/Contract Management  \n• Strategic Planning \n• Relationship Development  \n• Staff and Team Development \n• Budget Development  \n• International Program Implementation \n• Continuous Improvement/Six Sigma \n• Quality Systems  \n• New Business Development  \n \nPROVEN ACCOMPLISHMENTS \nDeveloped a new product enabling equipment modification to meet Customer needs. Conceptualized, designed and managed installation of new equipment components at Asian manufacturing facility. RESULTS: On time new product introduction with revenues increasing from $10 million to over $20 million annually over past four years. \n \nImplemented an OSHA Compliant Electrical Safety Program globally to reduce employee exposure to electric shock and ArcFlash hazards and to eliminate a non-compliance issue. Managed Engineering Consultant’s evaluation and documentation of the electrical systems hazard levels. RESULTS: Globally, no Energized Work Permits have been issued for the last five years and no employees have been injured doing electrical work. \n \nAnalyzed the high failure rate of mixer seals with a global cost impact of $480,000 per year. Documented current replacement process and identified opportunities for reductions. Recommended bringing rebuild activities in-house, standardized seal installation procedures and trained personnel. RESULTS: Mixer seal parts and motor replacement costs were reduced by $350,000 per year. Experience Sr. Reliability Engineer Cabot Microelectronics 2004  – Present (11 years) •\tResponsible for improving the mechanical reliability of production and facilities equipment and reducing their cost of operation in our global operations. \n•\tOversee Engineering and management of capital projects for facility and production equipment upgrades. \n•\tMonitor and communicate project status to internal stake holders. Coordinate production and construction schedules with equipment availability and document procedural changes resulting from equipment modifications.  \n•\tManage project budgets, write Requests for Proposals and scope of work documents and solicit equipment operational issues from Operations and Maintenance. \n•\tConduct equipment hazard reviews and mentor Junior Project Engineers / Managers. TPM Program Manager /TPM Content Expert Intel Corporation 1999  –  2002  (3 years) •\tEstablished the TPM systems in the global Facility Operations groups. \n•\tCreated TPM support structure at manufacturing sites, developed and deployed Sr. Level Manager and TPM Pillar Leader training.  \n•\tGuided goal / roadmap development, coached global Pillar teams and employees.  \n•\tMaintained up-to-date training materials, coached managers and staff, reviewed individual sites’ progress-to-goals and provided feedback and guidance. \n•\tCoached TPM Pillar Leaders and mentored Operations Technicians and Engineers. Operations Engineering Supervisor Intel Corporation 1995  –  1999  (4 years) Operations Engineering Supervisor (1996 – 1999) \n•\tManaged the factory expansion facilities start-up services and the Computerized Maintenance Management System (CMMS) operations teams and led the Infrared and Vibration Predictive Maintenance working groups. \n•\tResponsible for staffing, monitoring and reporting on progress to goals for start-up activities, managing and reducing spending for two general ledger budget accounts, coordinating upgrades to the CMMS and guiding development of standards of training, experience levels and staffing for Predictive Maintenance personnel.  \n•\tConducted quarterly reviews of direct reports’ Personal Development Plans. \n•\tMonitored spending trend-to-plan on projects funded via managed general ledger accounts, coordinated CMMS daily activity and managing upgrades, communicated planned maintenance and repair backlog / aging to Shift Supervisors. Senior Facilities Mechanical Engineer Intel Corporation 1995  –  1996  (1 year) •\tCommissioned the “dirty” facility processes at the FAB 12 manufacturing facility and the mechanical systems serving the office and café facilities. \n•\tResponsible for monitoring construction progress-to-goals and specifications, inspecting and approving equipment and installation work, performing Functional and Performance Acceptance Tests, training Operations Technicians, and documenting operating and maintenance procedures. \n•\tTasks conducted on a daily basis: Inspecting equipment and systems; monitoring system operational performance, providing guidance to improve capability; training Operations Technicians on system features, operating, safety hazards and maintenance requirements; writing Basic, Intermediate and Advanced system operating instructions; reviewing and approving equipment submittal documents; resolving operational issues; reviewing and approving maintenance procedure documents. ADDITIONAL EXPERIENCE Various 1990  –  1994  (4 years) Consulting Engineering: Principal mechanical engineer responsible for the design of heating, ventilation and air-conditioning, process piping, plumbing and fire protection systems for domestic and international industrial, manufacturing, institutional, municipal, educational, health-care, amusement and commercial facilities. Led project management, budget projection, new business development, personnel development, and project status reviews.  \n \nComprehensive Certifications: Registered Professional Engineer, Japan Institute of Plant Maintenance Certified TPM Instructor, Certified Six Sigma Green-Belt, Six-Sigma Black-Belt Trained. Level 1 Certified IR Thermographer \n \nSpeaker: Japan Institute of Plant Maintenance International TPM Conferences  \n \nInternational Experience: Ireland, Israel, China, Malaysia, Costa Rica, Singapore, Philippines, Japan, Canada  \n \nRegistration: Arizona Registered Professional Engineer (Mechanical) Sr. Reliability Engineer Cabot Microelectronics 2004  – Present (11 years) •\tResponsible for improving the mechanical reliability of production and facilities equipment and reducing their cost of operation in our global operations. \n•\tOversee Engineering and management of capital projects for facility and production equipment upgrades. \n•\tMonitor and communicate project status to internal stake holders. Coordinate production and construction schedules with equipment availability and document procedural changes resulting from equipment modifications.  \n•\tManage project budgets, write Requests for Proposals and scope of work documents and solicit equipment operational issues from Operations and Maintenance. \n•\tConduct equipment hazard reviews and mentor Junior Project Engineers / Managers. Sr. Reliability Engineer Cabot Microelectronics 2004  – Present (11 years) •\tResponsible for improving the mechanical reliability of production and facilities equipment and reducing their cost of operation in our global operations. \n•\tOversee Engineering and management of capital projects for facility and production equipment upgrades. \n•\tMonitor and communicate project status to internal stake holders. Coordinate production and construction schedules with equipment availability and document procedural changes resulting from equipment modifications.  \n•\tManage project budgets, write Requests for Proposals and scope of work documents and solicit equipment operational issues from Operations and Maintenance. \n•\tConduct equipment hazard reviews and mentor Junior Project Engineers / Managers. TPM Program Manager /TPM Content Expert Intel Corporation 1999  –  2002  (3 years) •\tEstablished the TPM systems in the global Facility Operations groups. \n•\tCreated TPM support structure at manufacturing sites, developed and deployed Sr. Level Manager and TPM Pillar Leader training.  \n•\tGuided goal / roadmap development, coached global Pillar teams and employees.  \n•\tMaintained up-to-date training materials, coached managers and staff, reviewed individual sites’ progress-to-goals and provided feedback and guidance. \n•\tCoached TPM Pillar Leaders and mentored Operations Technicians and Engineers. TPM Program Manager /TPM Content Expert Intel Corporation 1999  –  2002  (3 years) •\tEstablished the TPM systems in the global Facility Operations groups. \n•\tCreated TPM support structure at manufacturing sites, developed and deployed Sr. Level Manager and TPM Pillar Leader training.  \n•\tGuided goal / roadmap development, coached global Pillar teams and employees.  \n•\tMaintained up-to-date training materials, coached managers and staff, reviewed individual sites’ progress-to-goals and provided feedback and guidance. \n•\tCoached TPM Pillar Leaders and mentored Operations Technicians and Engineers. Operations Engineering Supervisor Intel Corporation 1995  –  1999  (4 years) Operations Engineering Supervisor (1996 – 1999) \n•\tManaged the factory expansion facilities start-up services and the Computerized Maintenance Management System (CMMS) operations teams and led the Infrared and Vibration Predictive Maintenance working groups. \n•\tResponsible for staffing, monitoring and reporting on progress to goals for start-up activities, managing and reducing spending for two general ledger budget accounts, coordinating upgrades to the CMMS and guiding development of standards of training, experience levels and staffing for Predictive Maintenance personnel.  \n•\tConducted quarterly reviews of direct reports’ Personal Development Plans. \n•\tMonitored spending trend-to-plan on projects funded via managed general ledger accounts, coordinated CMMS daily activity and managing upgrades, communicated planned maintenance and repair backlog / aging to Shift Supervisors. Operations Engineering Supervisor Intel Corporation 1995  –  1999  (4 years) Operations Engineering Supervisor (1996 – 1999) \n•\tManaged the factory expansion facilities start-up services and the Computerized Maintenance Management System (CMMS) operations teams and led the Infrared and Vibration Predictive Maintenance working groups. \n•\tResponsible for staffing, monitoring and reporting on progress to goals for start-up activities, managing and reducing spending for two general ledger budget accounts, coordinating upgrades to the CMMS and guiding development of standards of training, experience levels and staffing for Predictive Maintenance personnel.  \n•\tConducted quarterly reviews of direct reports’ Personal Development Plans. \n•\tMonitored spending trend-to-plan on projects funded via managed general ledger accounts, coordinated CMMS daily activity and managing upgrades, communicated planned maintenance and repair backlog / aging to Shift Supervisors. Senior Facilities Mechanical Engineer Intel Corporation 1995  –  1996  (1 year) •\tCommissioned the “dirty” facility processes at the FAB 12 manufacturing facility and the mechanical systems serving the office and café facilities. \n•\tResponsible for monitoring construction progress-to-goals and specifications, inspecting and approving equipment and installation work, performing Functional and Performance Acceptance Tests, training Operations Technicians, and documenting operating and maintenance procedures. \n•\tTasks conducted on a daily basis: Inspecting equipment and systems; monitoring system operational performance, providing guidance to improve capability; training Operations Technicians on system features, operating, safety hazards and maintenance requirements; writing Basic, Intermediate and Advanced system operating instructions; reviewing and approving equipment submittal documents; resolving operational issues; reviewing and approving maintenance procedure documents. Senior Facilities Mechanical Engineer Intel Corporation 1995  –  1996  (1 year) •\tCommissioned the “dirty” facility processes at the FAB 12 manufacturing facility and the mechanical systems serving the office and café facilities. \n•\tResponsible for monitoring construction progress-to-goals and specifications, inspecting and approving equipment and installation work, performing Functional and Performance Acceptance Tests, training Operations Technicians, and documenting operating and maintenance procedures. \n•\tTasks conducted on a daily basis: Inspecting equipment and systems; monitoring system operational performance, providing guidance to improve capability; training Operations Technicians on system features, operating, safety hazards and maintenance requirements; writing Basic, Intermediate and Advanced system operating instructions; reviewing and approving equipment submittal documents; resolving operational issues; reviewing and approving maintenance procedure documents. ADDITIONAL EXPERIENCE Various 1990  –  1994  (4 years) Consulting Engineering: Principal mechanical engineer responsible for the design of heating, ventilation and air-conditioning, process piping, plumbing and fire protection systems for domestic and international industrial, manufacturing, institutional, municipal, educational, health-care, amusement and commercial facilities. Led project management, budget projection, new business development, personnel development, and project status reviews.  \n \nComprehensive Certifications: Registered Professional Engineer, Japan Institute of Plant Maintenance Certified TPM Instructor, Certified Six Sigma Green-Belt, Six-Sigma Black-Belt Trained. Level 1 Certified IR Thermographer \n \nSpeaker: Japan Institute of Plant Maintenance International TPM Conferences  \n \nInternational Experience: Ireland, Israel, China, Malaysia, Costa Rica, Singapore, Philippines, Japan, Canada  \n \nRegistration: Arizona Registered Professional Engineer (Mechanical) ADDITIONAL EXPERIENCE Various 1990  –  1994  (4 years) Consulting Engineering: Principal mechanical engineer responsible for the design of heating, ventilation and air-conditioning, process piping, plumbing and fire protection systems for domestic and international industrial, manufacturing, institutional, municipal, educational, health-care, amusement and commercial facilities. Led project management, budget projection, new business development, personnel development, and project status reviews.  \n \nComprehensive Certifications: Registered Professional Engineer, Japan Institute of Plant Maintenance Certified TPM Instructor, Certified Six Sigma Green-Belt, Six-Sigma Black-Belt Trained. Level 1 Certified IR Thermographer \n \nSpeaker: Japan Institute of Plant Maintenance International TPM Conferences  \n \nInternational Experience: Ireland, Israel, China, Malaysia, Costa Rica, Singapore, Philippines, Japan, Canada  \n \nRegistration: Arizona Registered Professional Engineer (Mechanical) Skills Microsoft Excel, Word,... Lotus Notes MiniTab Rev.15 Visio Project Engineering Six Sigma Engineering Management Engineering Leadership Factory Process Engineering Minitab Product Development Training Microsoft Excel Management Project Management PowerPoint Process Improvement Quality System Manufacturing Software Documentation Continuous Improvement Failure Analysis Design of Experiments Root Cause Analysis Lean Manufacturing DMAIC FMEA Predictive Maintenance Operational Excellence TPM Capital Projects Maintenance Management Plant Maintenance Reliability Engineering See 21+     See less Skills  Microsoft Excel, Word,... Lotus Notes MiniTab Rev.15 Visio Project Engineering Six Sigma Engineering Management Engineering Leadership Factory Process Engineering Minitab Product Development Training Microsoft Excel Management Project Management PowerPoint Process Improvement Quality System Manufacturing Software Documentation Continuous Improvement Failure Analysis Design of Experiments Root Cause Analysis Lean Manufacturing DMAIC FMEA Predictive Maintenance Operational Excellence TPM Capital Projects Maintenance Management Plant Maintenance Reliability Engineering See 21+     See less Microsoft Excel, Word,... Lotus Notes MiniTab Rev.15 Visio Project Engineering Six Sigma Engineering Management Engineering Leadership Factory Process Engineering Minitab Product Development Training Microsoft Excel Management Project Management PowerPoint Process Improvement Quality System Manufacturing Software Documentation Continuous Improvement Failure Analysis Design of Experiments Root Cause Analysis Lean Manufacturing DMAIC FMEA Predictive Maintenance Operational Excellence TPM Capital Projects Maintenance Management Plant Maintenance Reliability Engineering See 21+     See less Microsoft Excel, Word,... Lotus Notes MiniTab Rev.15 Visio Project Engineering Six Sigma Engineering Management Engineering Leadership Factory Process Engineering Minitab Product Development Training Microsoft Excel Management Project Management PowerPoint Process Improvement Quality System Manufacturing Software Documentation Continuous Improvement Failure Analysis Design of Experiments Root Cause Analysis Lean Manufacturing DMAIC FMEA Predictive Maintenance Operational Excellence TPM Capital Projects Maintenance Management Plant Maintenance Reliability Engineering See 21+     See less Education Registered Professional Engineer University of New Brunswick Bachelor of Science (BS),  Mechanical Engineering Registered Professional Engineer Registered Professional Engineer Registered Professional Engineer University of New Brunswick Bachelor of Science (BS),  Mechanical Engineering University of New Brunswick Bachelor of Science (BS),  Mechanical Engineering University of New Brunswick Bachelor of Science (BS),  Mechanical Engineering ", "Summary Operations and Maintenance of industrial facilities including central plant systems and HVAC. Summary Operations and Maintenance of industrial facilities including central plant systems and HVAC. Operations and Maintenance of industrial facilities including central plant systems and HVAC. Operations and Maintenance of industrial facilities including central plant systems and HVAC. Experience Data Center Manager ViaWest May 2015  – Present (4 months) Sr. Data Center Engineer ViaWest 2013  – Present (2 years) Phoenix, Arizona Area Operations and Maintenance of Data Center Facilities. Critical Facilities Engineer, Critical Infrastructure Management Cox Communications 2010  –  2013  (3 years) Phoenix, AZ Responsible for Corporate Data Center Mechanical and HVAC Operations and Maintenence. Facilities Mechanical Engineer Intel Corporation 2005  –  2009  (4 years) Chandler, AZ Mechanical and HVAC operations and maintenance engineer for large scale semiconductor facility. CAD/Project Construction Division AR Utility Sepcialists, Inc. 2003  –  2005  (2 years) Construction division support for fire protection, small building construction, and environmental remediation projects. Data Center Manager ViaWest May 2015  – Present (4 months) Data Center Manager ViaWest May 2015  – Present (4 months) Sr. Data Center Engineer ViaWest 2013  – Present (2 years) Phoenix, Arizona Area Operations and Maintenance of Data Center Facilities. Sr. Data Center Engineer ViaWest 2013  – Present (2 years) Phoenix, Arizona Area Operations and Maintenance of Data Center Facilities. Critical Facilities Engineer, Critical Infrastructure Management Cox Communications 2010  –  2013  (3 years) Phoenix, AZ Responsible for Corporate Data Center Mechanical and HVAC Operations and Maintenence. Critical Facilities Engineer, Critical Infrastructure Management Cox Communications 2010  –  2013  (3 years) Phoenix, AZ Responsible for Corporate Data Center Mechanical and HVAC Operations and Maintenence. Facilities Mechanical Engineer Intel Corporation 2005  –  2009  (4 years) Chandler, AZ Mechanical and HVAC operations and maintenance engineer for large scale semiconductor facility. Facilities Mechanical Engineer Intel Corporation 2005  –  2009  (4 years) Chandler, AZ Mechanical and HVAC operations and maintenance engineer for large scale semiconductor facility. CAD/Project Construction Division AR Utility Sepcialists, Inc. 2003  –  2005  (2 years) Construction division support for fire protection, small building construction, and environmental remediation projects. CAD/Project Construction Division AR Utility Sepcialists, Inc. 2003  –  2005  (2 years) Construction division support for fire protection, small building construction, and environmental remediation projects. Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Skills     Education Polytechnic University of Puerto Rico BSME,  Mechanical Engineering 1998  – 2002 Polytechnic University of Puerto Rico BSME,  Mechanical Engineering 1998  – 2002 Polytechnic University of Puerto Rico BSME,  Mechanical Engineering 1998  – 2002 Polytechnic University of Puerto Rico BSME,  Mechanical Engineering 1998  – 2002 ", "Summary I have a B.S. in Mechanical Engineering and an M.S. in Industrial Engineering. Summary I have a B.S. in Mechanical Engineering and an M.S. in Industrial Engineering. I have a B.S. in Mechanical Engineering and an M.S. in Industrial Engineering. I have a B.S. in Mechanical Engineering and an M.S. in Industrial Engineering. Experience Facilities Mechanical Engineer Intel Corporation July 2014  – Present (1 year 2 months) Mechanical Project Engineer Intel Corporation 2013  –  July 2014  (1 year) Portland, Oregon Area As the Mechanical PE in Intel's New Build Design group, I am responsible for delivering positioning, programming and capacity design of new fab construction programs. I manage all participating stakeholders and all suppliers during the design phase of construction projects. Responsibilities also include driving code compliance, code interpretation, and resolution of technical code issues during detailed design. Mechanical systems include; HVAC, exhaust, chilled/hot water, fire protection systems, natural gas distribution. Process mechanical systems include; oil free air, process cooling water, vacuum systems, low purity oxygen. Mechanical Engineer Physical Science Laboratory September 2009  –  December 2012  (3 years 4 months) Las Cruces, New Mexico NASA Suborbital Center of Excellence of NMSU's Physical Science Laboratory Facilities Mechanical Engineer Intel Corporation July 2014  – Present (1 year 2 months) Facilities Mechanical Engineer Intel Corporation July 2014  – Present (1 year 2 months) Mechanical Project Engineer Intel Corporation 2013  –  July 2014  (1 year) Portland, Oregon Area As the Mechanical PE in Intel's New Build Design group, I am responsible for delivering positioning, programming and capacity design of new fab construction programs. I manage all participating stakeholders and all suppliers during the design phase of construction projects. Responsibilities also include driving code compliance, code interpretation, and resolution of technical code issues during detailed design. Mechanical systems include; HVAC, exhaust, chilled/hot water, fire protection systems, natural gas distribution. Process mechanical systems include; oil free air, process cooling water, vacuum systems, low purity oxygen. Mechanical Project Engineer Intel Corporation 2013  –  July 2014  (1 year) Portland, Oregon Area As the Mechanical PE in Intel's New Build Design group, I am responsible for delivering positioning, programming and capacity design of new fab construction programs. I manage all participating stakeholders and all suppliers during the design phase of construction projects. Responsibilities also include driving code compliance, code interpretation, and resolution of technical code issues during detailed design. Mechanical systems include; HVAC, exhaust, chilled/hot water, fire protection systems, natural gas distribution. Process mechanical systems include; oil free air, process cooling water, vacuum systems, low purity oxygen. Mechanical Engineer Physical Science Laboratory September 2009  –  December 2012  (3 years 4 months) Las Cruces, New Mexico NASA Suborbital Center of Excellence of NMSU's Physical Science Laboratory Mechanical Engineer Physical Science Laboratory September 2009  –  December 2012  (3 years 4 months) Las Cruces, New Mexico NASA Suborbital Center of Excellence of NMSU's Physical Science Laboratory Skills Engineering Labview Solidworks Matlab Mechanical Engineering Testing Simulations Pro Engineer Unigraphics AutoCAD Finite Element Analysis Microsoft Office Quick Witted Project Engineering Analysis People Skills See 1+     See less Skills  Engineering Labview Solidworks Matlab Mechanical Engineering Testing Simulations Pro Engineer Unigraphics AutoCAD Finite Element Analysis Microsoft Office Quick Witted Project Engineering Analysis People Skills See 1+     See less Engineering Labview Solidworks Matlab Mechanical Engineering Testing Simulations Pro Engineer Unigraphics AutoCAD Finite Element Analysis Microsoft Office Quick Witted Project Engineering Analysis People Skills See 1+     See less Engineering Labview Solidworks Matlab Mechanical Engineering Testing Simulations Pro Engineer Unigraphics AutoCAD Finite Element Analysis Microsoft Office Quick Witted Project Engineering Analysis People Skills See 1+     See less Education New Mexico State University Master's degree,  Industrial Engineering , 3.8 2011  – 2012 New Mexico State University Bachelors,  Mechanical Engineering 2005  – 2010 Activities and Societies:  NMSU Senator\nASME Engineering Council\nKappa Sigma New Mexico State University Master's degree,  Industrial Engineering , 3.8 2011  – 2012 New Mexico State University Master's degree,  Industrial Engineering , 3.8 2011  – 2012 New Mexico State University Master's degree,  Industrial Engineering , 3.8 2011  – 2012 New Mexico State University Bachelors,  Mechanical Engineering 2005  – 2010 Activities and Societies:  NMSU Senator\nASME Engineering Council\nKappa Sigma New Mexico State University Bachelors,  Mechanical Engineering 2005  – 2010 Activities and Societies:  NMSU Senator\nASME Engineering Council\nKappa Sigma New Mexico State University Bachelors,  Mechanical Engineering 2005  – 2010 Activities and Societies:  NMSU Senator\nASME Engineering Council\nKappa Sigma ", "Experience Senior Facilities Mechanical Engineer Intel Corporation Senior Facilities Mechanical Engineer Intel Corporation Senior Facilities Mechanical Engineer Intel Corporation ", "Experience Facilities Mechanical Engineer Intel Corporation June 2012  – Present (3 years 3 months) Kulim Competent person for Industrial Hygiene Technician 2 - JKKP HIE 127/171-3/2(201). Innovate and improve on system’s reliability to reduce Interruption for Manufacturing and improve efficiency of current system. Coordinate and execute improvement projects and upgrades to equipment for system robustness. Troubleshooting facilities equipment to maintain product quality in manufacturing. Monitor system performance and reliability though Preventive Excursion Management System and Building Management System. Application of FMEA on critical areas to increase reliability and to harden the system. Velocity projects: LEAN application to simplify, streamline facility processes and tasks to obtain savings in terms of man-hours and costs. Implementation of energy saving projects in current facility and operational tasks through application of new technology and innovative execution. Lead coordinator for factory cold down/warm down projects and activities. Operation Coordinator Dynamic Primajaya Sdn Bhd June 2009  –  December 2012  (3 years 7 months) Intel Technology, Kulim Part time employee. Managing projects and operation jobs involving multiple discipline - mechanical, electrical and civil. I.e : As-Built Drawing Mechanical & Electrical Utilities Point Of Connection (POC) update project, Dehumidifier Installation, Exhaust Fan System Upgrade, Interstitial Walkable Platform Installation, Direct Cooling Coil (DCC) system cleaning and etc. Engineering Intern Dynamic Primajaya Sdn Bhd December 2008  –  May 2009  (6 months) Intel Technology, Kulim Exhaust balancing team leader Facilities Mechanical Engineer Intel Corporation June 2012  – Present (3 years 3 months) Kulim Competent person for Industrial Hygiene Technician 2 - JKKP HIE 127/171-3/2(201). Innovate and improve on system’s reliability to reduce Interruption for Manufacturing and improve efficiency of current system. Coordinate and execute improvement projects and upgrades to equipment for system robustness. Troubleshooting facilities equipment to maintain product quality in manufacturing. Monitor system performance and reliability though Preventive Excursion Management System and Building Management System. Application of FMEA on critical areas to increase reliability and to harden the system. Velocity projects: LEAN application to simplify, streamline facility processes and tasks to obtain savings in terms of man-hours and costs. Implementation of energy saving projects in current facility and operational tasks through application of new technology and innovative execution. Lead coordinator for factory cold down/warm down projects and activities. Facilities Mechanical Engineer Intel Corporation June 2012  – Present (3 years 3 months) Kulim Competent person for Industrial Hygiene Technician 2 - JKKP HIE 127/171-3/2(201). Innovate and improve on system’s reliability to reduce Interruption for Manufacturing and improve efficiency of current system. Coordinate and execute improvement projects and upgrades to equipment for system robustness. Troubleshooting facilities equipment to maintain product quality in manufacturing. Monitor system performance and reliability though Preventive Excursion Management System and Building Management System. Application of FMEA on critical areas to increase reliability and to harden the system. Velocity projects: LEAN application to simplify, streamline facility processes and tasks to obtain savings in terms of man-hours and costs. Implementation of energy saving projects in current facility and operational tasks through application of new technology and innovative execution. Lead coordinator for factory cold down/warm down projects and activities. Operation Coordinator Dynamic Primajaya Sdn Bhd June 2009  –  December 2012  (3 years 7 months) Intel Technology, Kulim Part time employee. Managing projects and operation jobs involving multiple discipline - mechanical, electrical and civil. I.e : As-Built Drawing Mechanical & Electrical Utilities Point Of Connection (POC) update project, Dehumidifier Installation, Exhaust Fan System Upgrade, Interstitial Walkable Platform Installation, Direct Cooling Coil (DCC) system cleaning and etc. Operation Coordinator Dynamic Primajaya Sdn Bhd June 2009  –  December 2012  (3 years 7 months) Intel Technology, Kulim Part time employee. Managing projects and operation jobs involving multiple discipline - mechanical, electrical and civil. I.e : As-Built Drawing Mechanical & Electrical Utilities Point Of Connection (POC) update project, Dehumidifier Installation, Exhaust Fan System Upgrade, Interstitial Walkable Platform Installation, Direct Cooling Coil (DCC) system cleaning and etc. Engineering Intern Dynamic Primajaya Sdn Bhd December 2008  –  May 2009  (6 months) Intel Technology, Kulim Exhaust balancing team leader Engineering Intern Dynamic Primajaya Sdn Bhd December 2008  –  May 2009  (6 months) Intel Technology, Kulim Exhaust balancing team leader Skills Semiconductors SoC Manufacturing SolidWorks Project Engineering Microsoft Office Electricians Commissioning Engineering Skills  Semiconductors SoC Manufacturing SolidWorks Project Engineering Microsoft Office Electricians Commissioning Engineering Semiconductors SoC Manufacturing SolidWorks Project Engineering Microsoft Office Electricians Commissioning Engineering Semiconductors SoC Manufacturing SolidWorks Project Engineering Microsoft Office Electricians Commissioning Engineering Education Universiti Malaysia Pahang Bachelor's Degree,  Mechanical Engineering , First Class Honours 2009  – 2012 Thesis: Shashi Kumar A/L S A Karagaratnan, 2012, A Study of Thermal Comfort at Power Plant Industries, Bachelor of Mechanical Engineering, Universiti Malaysia Pahang \n \nInternational Conference \nA.R. Ismail, N. K. Makhtar, S.K. Karagaratnan, 2011, A Review on Thermal Comfort Assessment: Case Studies in Malaysia Building, 29th Conference of ASEAN Federation of Engineering Organizations (CAFEO29), 27th Nov – 30th Nov 2011, Rizqun Hotel, Gadong, Bandar Seri Begawan, Brunei. \n \nNational Conference \nA.R. Ismail, S.K.S.A. Karagaratnan, K. Kadirgama, M.M. Rahman, B.M. Deros, M.N.A. Rahman, 2011, A Review on Thermal Comfort Assessment at Industries, Advanced Processess & System in Manufacturing (APSIM 2011), 14th – 15th December 2011, The Royale Bintang, Kuala Lumpur. \n \nJournals \nAhmad Rasdan Ismail, Shashi Kumar Karagaratnan, Kumaran Kadirgama, 2012, Thermal Comfort Findings: Scenario at Malaysian Automotive Industry, Thermal Science, ISSN: 0354 – 9836. (Impact Factor:0.8) Universiti Malaysia Pahang Diploma,  Mechanical Engineering , First Class Honours 2006  – 2009 Universiti Malaysia Pahang Bachelor's Degree,  Mechanical Engineering , First Class Honours 2009  – 2012 Thesis: Shashi Kumar A/L S A Karagaratnan, 2012, A Study of Thermal Comfort at Power Plant Industries, Bachelor of Mechanical Engineering, Universiti Malaysia Pahang \n \nInternational Conference \nA.R. Ismail, N. K. Makhtar, S.K. Karagaratnan, 2011, A Review on Thermal Comfort Assessment: Case Studies in Malaysia Building, 29th Conference of ASEAN Federation of Engineering Organizations (CAFEO29), 27th Nov – 30th Nov 2011, Rizqun Hotel, Gadong, Bandar Seri Begawan, Brunei. \n \nNational Conference \nA.R. Ismail, S.K.S.A. Karagaratnan, K. Kadirgama, M.M. Rahman, B.M. Deros, M.N.A. Rahman, 2011, A Review on Thermal Comfort Assessment at Industries, Advanced Processess & System in Manufacturing (APSIM 2011), 14th – 15th December 2011, The Royale Bintang, Kuala Lumpur. \n \nJournals \nAhmad Rasdan Ismail, Shashi Kumar Karagaratnan, Kumaran Kadirgama, 2012, Thermal Comfort Findings: Scenario at Malaysian Automotive Industry, Thermal Science, ISSN: 0354 – 9836. (Impact Factor:0.8) Universiti Malaysia Pahang Bachelor's Degree,  Mechanical Engineering , First Class Honours 2009  – 2012 Thesis: Shashi Kumar A/L S A Karagaratnan, 2012, A Study of Thermal Comfort at Power Plant Industries, Bachelor of Mechanical Engineering, Universiti Malaysia Pahang \n \nInternational Conference \nA.R. Ismail, N. K. Makhtar, S.K. Karagaratnan, 2011, A Review on Thermal Comfort Assessment: Case Studies in Malaysia Building, 29th Conference of ASEAN Federation of Engineering Organizations (CAFEO29), 27th Nov – 30th Nov 2011, Rizqun Hotel, Gadong, Bandar Seri Begawan, Brunei. \n \nNational Conference \nA.R. Ismail, S.K.S.A. Karagaratnan, K. Kadirgama, M.M. Rahman, B.M. Deros, M.N.A. Rahman, 2011, A Review on Thermal Comfort Assessment at Industries, Advanced Processess & System in Manufacturing (APSIM 2011), 14th – 15th December 2011, The Royale Bintang, Kuala Lumpur. \n \nJournals \nAhmad Rasdan Ismail, Shashi Kumar Karagaratnan, Kumaran Kadirgama, 2012, Thermal Comfort Findings: Scenario at Malaysian Automotive Industry, Thermal Science, ISSN: 0354 – 9836. (Impact Factor:0.8) Universiti Malaysia Pahang Bachelor's Degree,  Mechanical Engineering , First Class Honours 2009  – 2012 Thesis: Shashi Kumar A/L S A Karagaratnan, 2012, A Study of Thermal Comfort at Power Plant Industries, Bachelor of Mechanical Engineering, Universiti Malaysia Pahang \n \nInternational Conference \nA.R. Ismail, N. K. Makhtar, S.K. Karagaratnan, 2011, A Review on Thermal Comfort Assessment: Case Studies in Malaysia Building, 29th Conference of ASEAN Federation of Engineering Organizations (CAFEO29), 27th Nov – 30th Nov 2011, Rizqun Hotel, Gadong, Bandar Seri Begawan, Brunei. \n \nNational Conference \nA.R. Ismail, S.K.S.A. Karagaratnan, K. Kadirgama, M.M. Rahman, B.M. Deros, M.N.A. Rahman, 2011, A Review on Thermal Comfort Assessment at Industries, Advanced Processess & System in Manufacturing (APSIM 2011), 14th – 15th December 2011, The Royale Bintang, Kuala Lumpur. \n \nJournals \nAhmad Rasdan Ismail, Shashi Kumar Karagaratnan, Kumaran Kadirgama, 2012, Thermal Comfort Findings: Scenario at Malaysian Automotive Industry, Thermal Science, ISSN: 0354 – 9836. (Impact Factor:0.8) Universiti Malaysia Pahang Diploma,  Mechanical Engineering , First Class Honours 2006  – 2009 Universiti Malaysia Pahang Diploma,  Mechanical Engineering , First Class Honours 2006  – 2009 Universiti Malaysia Pahang Diploma,  Mechanical Engineering , First Class Honours 2006  – 2009 "]}