{"position": "Factory Planning Manager", "company": "Intel Corporation", "profiles": ["Summary Proven global supply chain expert with both international and domestic experience; a results driven individual and motivational team leader with the ability to solve complex problems and deliver sustainable and scalable solutions with proven track record for stakeholder alignment across multiple geographies cross-functional areas and bridging the cultures resulted in lasting positive partnerships for organizations. \nCommunity and regional non-profit arts Arts management, consulting, and production. Organizational development Board/leadership development. Summary Proven global supply chain expert with both international and domestic experience; a results driven individual and motivational team leader with the ability to solve complex problems and deliver sustainable and scalable solutions with proven track record for stakeholder alignment across multiple geographies cross-functional areas and bridging the cultures resulted in lasting positive partnerships for organizations. \nCommunity and regional non-profit arts Arts management, consulting, and production. Organizational development Board/leadership development. Proven global supply chain expert with both international and domestic experience; a results driven individual and motivational team leader with the ability to solve complex problems and deliver sustainable and scalable solutions with proven track record for stakeholder alignment across multiple geographies cross-functional areas and bridging the cultures resulted in lasting positive partnerships for organizations. \nCommunity and regional non-profit arts Arts management, consulting, and production. Organizational development Board/leadership development. Proven global supply chain expert with both international and domestic experience; a results driven individual and motivational team leader with the ability to solve complex problems and deliver sustainable and scalable solutions with proven track record for stakeholder alignment across multiple geographies cross-functional areas and bridging the cultures resulted in lasting positive partnerships for organizations. \nCommunity and regional non-profit arts Arts management, consulting, and production. Organizational development Board/leadership development. Experience Global Strategic Capabilities Manager - Manufacturing Planning Intel Corporation June 2014  – Present (1 year 3 months) Owner: Strategic Planning Process – coordinate/drive twice yearly cycle and drive future process enhancements. Organization Capability Team (OCT) representative. Drive future development of manufacturing metrics and their associated business processes. Drive proper prioritization of projects and ensure adequate resource support for the Strategic Capabilities roadmap. Work with Staff to align on priorities and roadmap, identify roadblocks and opportunities. Work with New Business & Materials Planning team as key interface to ensure support of our new business initiatives. \n• SPO Biz Ops key interface – be the FSM Planning owner of cross SPO initiatives driven by the Biz Ops team. Mentor Intel/Cibola High School Mentorship Program September 2014  – Present (1 year) Cibola High School To increase the graduation rate of minority high school students by serving as academic advisor, leader and role model within the school community. Executive Producer: Shakespeare on the Plaza (City of Albuquerque and the Vortex Theater) Vortex Theater January 2014  –  August 2014  (8 months) Albuquerque, New Mexico Area Non-profit community arts production. \nProductions of Romeo and Juliet and Midsummer Night's Dream reflecting the face of New Mexico! Factory Planning Manager Intel Corporation 1999  –  June 2014  (15 years) Executive Producer - Will Power IV Shakespeare Festival Vortex Theater January 2013  –  August 2013  (8 months) Albuquerque, New Mexico Area Non-profit community arts production. \nSeason consists of As You Like It, Measure for Measure, and Macbeth. President of the Board Albuquerque Theatre Guild 2009  –  2011  (2 years) Non-profit community arts development, promotion, and funding. President The American Shakepeare Project 2003  –  2007  (4 years) Non-profit community arts production. Archon ShoPonies Productions 1989  –  1992  (3 years) Global Strategic Capabilities Manager - Manufacturing Planning Intel Corporation June 2014  – Present (1 year 3 months) Owner: Strategic Planning Process – coordinate/drive twice yearly cycle and drive future process enhancements. Organization Capability Team (OCT) representative. Drive future development of manufacturing metrics and their associated business processes. Drive proper prioritization of projects and ensure adequate resource support for the Strategic Capabilities roadmap. Work with Staff to align on priorities and roadmap, identify roadblocks and opportunities. Work with New Business & Materials Planning team as key interface to ensure support of our new business initiatives. \n• SPO Biz Ops key interface – be the FSM Planning owner of cross SPO initiatives driven by the Biz Ops team. Global Strategic Capabilities Manager - Manufacturing Planning Intel Corporation June 2014  – Present (1 year 3 months) Owner: Strategic Planning Process – coordinate/drive twice yearly cycle and drive future process enhancements. Organization Capability Team (OCT) representative. Drive future development of manufacturing metrics and their associated business processes. Drive proper prioritization of projects and ensure adequate resource support for the Strategic Capabilities roadmap. Work with Staff to align on priorities and roadmap, identify roadblocks and opportunities. Work with New Business & Materials Planning team as key interface to ensure support of our new business initiatives. \n• SPO Biz Ops key interface – be the FSM Planning owner of cross SPO initiatives driven by the Biz Ops team. Mentor Intel/Cibola High School Mentorship Program September 2014  – Present (1 year) Cibola High School To increase the graduation rate of minority high school students by serving as academic advisor, leader and role model within the school community. Mentor Intel/Cibola High School Mentorship Program September 2014  – Present (1 year) Cibola High School To increase the graduation rate of minority high school students by serving as academic advisor, leader and role model within the school community. Executive Producer: Shakespeare on the Plaza (City of Albuquerque and the Vortex Theater) Vortex Theater January 2014  –  August 2014  (8 months) Albuquerque, New Mexico Area Non-profit community arts production. \nProductions of Romeo and Juliet and Midsummer Night's Dream reflecting the face of New Mexico! Executive Producer: Shakespeare on the Plaza (City of Albuquerque and the Vortex Theater) Vortex Theater January 2014  –  August 2014  (8 months) Albuquerque, New Mexico Area Non-profit community arts production. \nProductions of Romeo and Juliet and Midsummer Night's Dream reflecting the face of New Mexico! Factory Planning Manager Intel Corporation 1999  –  June 2014  (15 years) Factory Planning Manager Intel Corporation 1999  –  June 2014  (15 years) Executive Producer - Will Power IV Shakespeare Festival Vortex Theater January 2013  –  August 2013  (8 months) Albuquerque, New Mexico Area Non-profit community arts production. \nSeason consists of As You Like It, Measure for Measure, and Macbeth. Executive Producer - Will Power IV Shakespeare Festival Vortex Theater January 2013  –  August 2013  (8 months) Albuquerque, New Mexico Area Non-profit community arts production. \nSeason consists of As You Like It, Measure for Measure, and Macbeth. President of the Board Albuquerque Theatre Guild 2009  –  2011  (2 years) Non-profit community arts development, promotion, and funding. President of the Board Albuquerque Theatre Guild 2009  –  2011  (2 years) Non-profit community arts development, promotion, and funding. President The American Shakepeare Project 2003  –  2007  (4 years) Non-profit community arts production. President The American Shakepeare Project 2003  –  2007  (4 years) Non-profit community arts production. Archon ShoPonies Productions 1989  –  1992  (3 years) Archon ShoPonies Productions 1989  –  1992  (3 years) Skills Strategy Strategic Planning Business Strategy Cross-functional Team... Product Marketing Program Management Semiconductors Event Management Product Management Lean Manufacturing Management Leadership Process Improvement Public Speaking Skills  Strategy Strategic Planning Business Strategy Cross-functional Team... Product Marketing Program Management Semiconductors Event Management Product Management Lean Manufacturing Management Leadership Process Improvement Public Speaking Strategy Strategic Planning Business Strategy Cross-functional Team... Product Marketing Program Management Semiconductors Event Management Product Management Lean Manufacturing Management Leadership Process Improvement Public Speaking Strategy Strategic Planning Business Strategy Cross-functional Team... Product Marketing Program Management Semiconductors Event Management Product Management Lean Manufacturing Management Leadership Process Improvement Public Speaking Education West Virginia University 1980  – 1990 Parkersburg High School 1977  – 1980 West Virginia University 1980  – 1990 West Virginia University 1980  – 1990 West Virginia University 1980  – 1990 Parkersburg High School 1977  – 1980 Parkersburg High School 1977  – 1980 Parkersburg High School 1977  – 1980 ", "Experience Supply Chain Manager Intel Corporation 2005  – Present (10 years) Supply Chain Manager Intel Corporation 2005  – Present (10 years) Supply Chain Manager Intel Corporation 2005  – Present (10 years) Skills Semiconductors Supply Chain Semiconductor Industry Lean Manufacturing Skills  Semiconductors Supply Chain Semiconductor Industry Lean Manufacturing Semiconductors Supply Chain Semiconductor Industry Lean Manufacturing Semiconductors Supply Chain Semiconductor Industry Lean Manufacturing ", "Experience Manufacturing Manager/ Lean Leader Intel Corporation July 2010  –  November 2013  (3 years 5 months) Costa Rica I managed a 591 K sq. ft. High Volume Assembly/Test manufacturing facility with < 500 pieces of process equipment. Led a 27% increase in production volume while reducing quality errors by 57%, and reducing product cycle time by 25%. Directed the Lean efforts for the manufacturing facility with structured training and activities. I worked directly with customers in the Latin America Region (LAR) to educate them in Lean Manufacturing practices and in the process documented $30M in reduced costs and a 30% improvement in productivity. Total Productive Maintenance Manager Intel Corporation June 2007  –  June 2010  (3 years 1 month) Hudson, MA Directed the Total Productive Maintenance (TPM) Strategy for the Process Engineering and Manufacturing Technician Populations. The team was recognized for sustaining the \"Best in Class\" equipment performance for Output/System/Week. I developed and led a totally new \"Equipment Maintenance Standardization Boot Camp\" process that was recognized as a \"Breakthrough Methodology\" at the 2008 Intel Manufacturing Excellence Conference. Manufacturing Manager Intel Corporation January 2006  –  May 2007  (1 year 5 months) Hudson, MA Co-managed a wafer fabrication manufacturing organization of 700 personnel with > 350 pieces of process equipment. Responsible for the execution and the continuous improvement of safety, quality, output, cost and personnel development indicators. Led a 16% improvement in factory output, during cleanroom construction and equipment installs, while fully loaded. An Intel first. Attained a 28% reduction in cycle time, from 72 days to 52 days, exceeding the goal. Achieved a 50% reduction in overtime spending. Factory Planning Manager Intel Corporation November 2004  –  January 2006  (1 year 3 months) Hudson, MA Responsible for Strategic Capacity Planning, Production Planning and Production Control. Implemented the first variable wafer start system, improving cycle time by 14% in 2 months. Manufacturing Manager/ Lean Leader Intel Corporation July 2010  –  November 2013  (3 years 5 months) Costa Rica I managed a 591 K sq. ft. High Volume Assembly/Test manufacturing facility with < 500 pieces of process equipment. Led a 27% increase in production volume while reducing quality errors by 57%, and reducing product cycle time by 25%. Directed the Lean efforts for the manufacturing facility with structured training and activities. I worked directly with customers in the Latin America Region (LAR) to educate them in Lean Manufacturing practices and in the process documented $30M in reduced costs and a 30% improvement in productivity. Manufacturing Manager/ Lean Leader Intel Corporation July 2010  –  November 2013  (3 years 5 months) Costa Rica I managed a 591 K sq. ft. High Volume Assembly/Test manufacturing facility with < 500 pieces of process equipment. Led a 27% increase in production volume while reducing quality errors by 57%, and reducing product cycle time by 25%. Directed the Lean efforts for the manufacturing facility with structured training and activities. I worked directly with customers in the Latin America Region (LAR) to educate them in Lean Manufacturing practices and in the process documented $30M in reduced costs and a 30% improvement in productivity. Total Productive Maintenance Manager Intel Corporation June 2007  –  June 2010  (3 years 1 month) Hudson, MA Directed the Total Productive Maintenance (TPM) Strategy for the Process Engineering and Manufacturing Technician Populations. The team was recognized for sustaining the \"Best in Class\" equipment performance for Output/System/Week. I developed and led a totally new \"Equipment Maintenance Standardization Boot Camp\" process that was recognized as a \"Breakthrough Methodology\" at the 2008 Intel Manufacturing Excellence Conference. Total Productive Maintenance Manager Intel Corporation June 2007  –  June 2010  (3 years 1 month) Hudson, MA Directed the Total Productive Maintenance (TPM) Strategy for the Process Engineering and Manufacturing Technician Populations. The team was recognized for sustaining the \"Best in Class\" equipment performance for Output/System/Week. I developed and led a totally new \"Equipment Maintenance Standardization Boot Camp\" process that was recognized as a \"Breakthrough Methodology\" at the 2008 Intel Manufacturing Excellence Conference. Manufacturing Manager Intel Corporation January 2006  –  May 2007  (1 year 5 months) Hudson, MA Co-managed a wafer fabrication manufacturing organization of 700 personnel with > 350 pieces of process equipment. Responsible for the execution and the continuous improvement of safety, quality, output, cost and personnel development indicators. Led a 16% improvement in factory output, during cleanroom construction and equipment installs, while fully loaded. An Intel first. Attained a 28% reduction in cycle time, from 72 days to 52 days, exceeding the goal. Achieved a 50% reduction in overtime spending. Manufacturing Manager Intel Corporation January 2006  –  May 2007  (1 year 5 months) Hudson, MA Co-managed a wafer fabrication manufacturing organization of 700 personnel with > 350 pieces of process equipment. Responsible for the execution and the continuous improvement of safety, quality, output, cost and personnel development indicators. Led a 16% improvement in factory output, during cleanroom construction and equipment installs, while fully loaded. An Intel first. Attained a 28% reduction in cycle time, from 72 days to 52 days, exceeding the goal. Achieved a 50% reduction in overtime spending. Factory Planning Manager Intel Corporation November 2004  –  January 2006  (1 year 3 months) Hudson, MA Responsible for Strategic Capacity Planning, Production Planning and Production Control. Implemented the first variable wafer start system, improving cycle time by 14% in 2 months. Factory Planning Manager Intel Corporation November 2004  –  January 2006  (1 year 3 months) Hudson, MA Responsible for Strategic Capacity Planning, Production Planning and Production Control. Implemented the first variable wafer start system, improving cycle time by 14% in 2 months. Languages   Skills Lean Manufacturing Manufacturing Process Engineering Continuous Improvement Operational Excellence Operations Management SPC Manufacturing... Design of Experiments Lean Value Stream Mapping Management Strategy Engineering Management Kaizen Cross-functional Team... High Precision... Project Management Six Sigma See 4+     See less Skills  Lean Manufacturing Manufacturing Process Engineering Continuous Improvement Operational Excellence Operations Management SPC Manufacturing... Design of Experiments Lean Value Stream Mapping Management Strategy Engineering Management Kaizen Cross-functional Team... High Precision... Project Management Six Sigma See 4+     See less Lean Manufacturing Manufacturing Process Engineering Continuous Improvement Operational Excellence Operations Management SPC Manufacturing... Design of Experiments Lean Value Stream Mapping Management Strategy Engineering Management Kaizen Cross-functional Team... High Precision... Project Management Six Sigma See 4+     See less Lean Manufacturing Manufacturing Process Engineering Continuous Improvement Operational Excellence Operations Management SPC Manufacturing... Design of Experiments Lean Value Stream Mapping Management Strategy Engineering Management Kaizen Cross-functional Team... High Precision... Project Management Six Sigma See 4+     See less Education West Virginia University Institute of Technology Bachelor of Applied Science (B.A.Sc.),  Mechanical Engineering 1978  – 1983 West Virginia University Institute of Technology Bachelor of Applied Science (B.A.Sc.),  Mechanical Engineering 1978  – 1983 West Virginia University Institute of Technology Bachelor of Applied Science (B.A.Sc.),  Mechanical Engineering 1978  – 1983 West Virginia University Institute of Technology Bachelor of Applied Science (B.A.Sc.),  Mechanical Engineering 1978  – 1983 Honors & Awards ", "Skills Semiconductors Cross-functional Team... Supply Chain Management Skills  Semiconductors Cross-functional Team... Supply Chain Management Semiconductors Cross-functional Team... Supply Chain Management Semiconductors Cross-functional Team... Supply Chain Management ", "Experience Factory Planning Manager Intel Corporation September 2012  – Present (3 years) Chengdu, Sichuan, China Factory Planning Manager is leading the factory planning organization to support CD site 2 factories (Chipset/CPU), setting directions, developing and implementing people solutions, site guidelines, policies, and factory budget. Responsible for managing the Product Line Mangers and group of individual contributors that supports the mid-range planning and tactical execution that supports the revenue production and engineering builds. Product Line Manager Intel Corporation July 2009  –  August 2012  (3 years 2 months) Chengdu, Sichuan, China PLM responsible for managing group of planning analysts and leads the supply chain activities within the product line/functional areas to supports the mid-range plan and tactical execution; responsible for balancing the support of three key areas of ATM business: new product introduction/Engineering/Customer samples and Revenue meeting customer expectations; set direction, establish priorities for the product line and drive issues resolution; manage the factory planning HC resource for the team, resource allocation, strategic planning. Master Planner, Production Control Planner Intel Corporation September 2006  –  June 2009  (2 years 10 months) Chengdu, Sichuan, China Own factory schedule in Build Plan horizon of month 1 to month 9. Be responsible for coordination, analysis and communication of Build Plan vs. factory capacity, translating demand forecast into supply schedule beyond execution period. Analyze the effect of product mix changes against factory resources. Understand and roll out factory roadmap / Resource Requirement Planning (RRP) with consideration of new products, major constraints in capacity, space, headcount, and material. Product Business Analyst Intel Corporation May 2008  –  December 2008  (8 months) Folsom, CA, US Mobile Vertical PBA: joined MMBP Chipset Div team from June’08 to Dec’08 to perform order & supply Management, provide customer criticals/hotlists support base on business strategies, initiatives and positioning thru CCP process; meanwhile is helping to link between Div and factory team about demand forecast/build plan reset/wafer starts/inventory strategy business insight, build up very strong network/relationship with Division partners. Factory Planning Manager Intel Corporation September 2012  – Present (3 years) Chengdu, Sichuan, China Factory Planning Manager is leading the factory planning organization to support CD site 2 factories (Chipset/CPU), setting directions, developing and implementing people solutions, site guidelines, policies, and factory budget. Responsible for managing the Product Line Mangers and group of individual contributors that supports the mid-range planning and tactical execution that supports the revenue production and engineering builds. Factory Planning Manager Intel Corporation September 2012  – Present (3 years) Chengdu, Sichuan, China Factory Planning Manager is leading the factory planning organization to support CD site 2 factories (Chipset/CPU), setting directions, developing and implementing people solutions, site guidelines, policies, and factory budget. Responsible for managing the Product Line Mangers and group of individual contributors that supports the mid-range planning and tactical execution that supports the revenue production and engineering builds. Product Line Manager Intel Corporation July 2009  –  August 2012  (3 years 2 months) Chengdu, Sichuan, China PLM responsible for managing group of planning analysts and leads the supply chain activities within the product line/functional areas to supports the mid-range plan and tactical execution; responsible for balancing the support of three key areas of ATM business: new product introduction/Engineering/Customer samples and Revenue meeting customer expectations; set direction, establish priorities for the product line and drive issues resolution; manage the factory planning HC resource for the team, resource allocation, strategic planning. Product Line Manager Intel Corporation July 2009  –  August 2012  (3 years 2 months) Chengdu, Sichuan, China PLM responsible for managing group of planning analysts and leads the supply chain activities within the product line/functional areas to supports the mid-range plan and tactical execution; responsible for balancing the support of three key areas of ATM business: new product introduction/Engineering/Customer samples and Revenue meeting customer expectations; set direction, establish priorities for the product line and drive issues resolution; manage the factory planning HC resource for the team, resource allocation, strategic planning. Master Planner, Production Control Planner Intel Corporation September 2006  –  June 2009  (2 years 10 months) Chengdu, Sichuan, China Own factory schedule in Build Plan horizon of month 1 to month 9. Be responsible for coordination, analysis and communication of Build Plan vs. factory capacity, translating demand forecast into supply schedule beyond execution period. Analyze the effect of product mix changes against factory resources. Understand and roll out factory roadmap / Resource Requirement Planning (RRP) with consideration of new products, major constraints in capacity, space, headcount, and material. Master Planner, Production Control Planner Intel Corporation September 2006  –  June 2009  (2 years 10 months) Chengdu, Sichuan, China Own factory schedule in Build Plan horizon of month 1 to month 9. Be responsible for coordination, analysis and communication of Build Plan vs. factory capacity, translating demand forecast into supply schedule beyond execution period. Analyze the effect of product mix changes against factory resources. Understand and roll out factory roadmap / Resource Requirement Planning (RRP) with consideration of new products, major constraints in capacity, space, headcount, and material. Product Business Analyst Intel Corporation May 2008  –  December 2008  (8 months) Folsom, CA, US Mobile Vertical PBA: joined MMBP Chipset Div team from June’08 to Dec’08 to perform order & supply Management, provide customer criticals/hotlists support base on business strategies, initiatives and positioning thru CCP process; meanwhile is helping to link between Div and factory team about demand forecast/build plan reset/wafer starts/inventory strategy business insight, build up very strong network/relationship with Division partners. Product Business Analyst Intel Corporation May 2008  –  December 2008  (8 months) Folsom, CA, US Mobile Vertical PBA: joined MMBP Chipset Div team from June’08 to Dec’08 to perform order & supply Management, provide customer criticals/hotlists support base on business strategies, initiatives and positioning thru CCP process; meanwhile is helping to link between Div and factory team about demand forecast/build plan reset/wafer starts/inventory strategy business insight, build up very strong network/relationship with Division partners. Education Sichuan University Master's degree,  Management Science and Engineering 2001  – 2004 Sichuan University Bachelor's degree,  Applied Mathematics 1997  – 2001 Sichuan University Master's degree,  Management Science and Engineering 2001  – 2004 Sichuan University Master's degree,  Management Science and Engineering 2001  – 2004 Sichuan University Master's degree,  Management Science and Engineering 2001  – 2004 Sichuan University Bachelor's degree,  Applied Mathematics 1997  – 2001 Sichuan University Bachelor's degree,  Applied Mathematics 1997  – 2001 Sichuan University Bachelor's degree,  Applied Mathematics 1997  – 2001 ", "Skills Supply Management Supply Chain Product Development Program Management Six Sigma Supply Chain... Demand Planning Leadership Process Improvement Continuous Improvement Project Management Management Project Planning MRP Lean Manufacturing Supply Chain Management Strategic Planning Cross-functional Team... Materials Management Semiconductors Semiconductor Industry Strategy Business Strategy SPC Strategic Sourcing Business Process... Competitive Analysis Product Management See 13+     See less Skills  Supply Management Supply Chain Product Development Program Management Six Sigma Supply Chain... Demand Planning Leadership Process Improvement Continuous Improvement Project Management Management Project Planning MRP Lean Manufacturing Supply Chain Management Strategic Planning Cross-functional Team... Materials Management Semiconductors Semiconductor Industry Strategy Business Strategy SPC Strategic Sourcing Business Process... Competitive Analysis Product Management See 13+     See less Supply Management Supply Chain Product Development Program Management Six Sigma Supply Chain... Demand Planning Leadership Process Improvement Continuous Improvement Project Management Management Project Planning MRP Lean Manufacturing Supply Chain Management Strategic Planning Cross-functional Team... Materials Management Semiconductors Semiconductor Industry Strategy Business Strategy SPC Strategic Sourcing Business Process... Competitive Analysis Product Management See 13+     See less Supply Management Supply Chain Product Development Program Management Six Sigma Supply Chain... Demand Planning Leadership Process Improvement Continuous Improvement Project Management Management Project Planning MRP Lean Manufacturing Supply Chain Management Strategic Planning Cross-functional Team... Materials Management Semiconductors Semiconductor Industry Strategy Business Strategy SPC Strategic Sourcing Business Process... Competitive Analysis Product Management See 13+     See less ", "Summary High-Tech Executive with extensive experience in Supply Chain Mangement, Business Operations, IT, HR, Manufacturing and Organizational Management. Direct experience in growing new organizations, managing a world wide team and driving process and tool improvements, specifically in the Supply Chain Arena. Experience with both process improvement and integrating process with Software tools such as SAP and I2. \n \nSpecialties: Supply Chain, SAP, RapidResponse (Kinaxis), Business Operations, Organizational Development, Organizational Growth (recuiting, staffing, development) Summary High-Tech Executive with extensive experience in Supply Chain Mangement, Business Operations, IT, HR, Manufacturing and Organizational Management. Direct experience in growing new organizations, managing a world wide team and driving process and tool improvements, specifically in the Supply Chain Arena. Experience with both process improvement and integrating process with Software tools such as SAP and I2. \n \nSpecialties: Supply Chain, SAP, RapidResponse (Kinaxis), Business Operations, Organizational Development, Organizational Growth (recuiting, staffing, development) High-Tech Executive with extensive experience in Supply Chain Mangement, Business Operations, IT, HR, Manufacturing and Organizational Management. Direct experience in growing new organizations, managing a world wide team and driving process and tool improvements, specifically in the Supply Chain Arena. Experience with both process improvement and integrating process with Software tools such as SAP and I2. \n \nSpecialties: Supply Chain, SAP, RapidResponse (Kinaxis), Business Operations, Organizational Development, Organizational Growth (recuiting, staffing, development) High-Tech Executive with extensive experience in Supply Chain Mangement, Business Operations, IT, HR, Manufacturing and Organizational Management. Direct experience in growing new organizations, managing a world wide team and driving process and tool improvements, specifically in the Supply Chain Arena. Experience with both process improvement and integrating process with Software tools such as SAP and I2. \n \nSpecialties: Supply Chain, SAP, RapidResponse (Kinaxis), Business Operations, Organizational Development, Organizational Growth (recuiting, staffing, development) Experience Supply Chain Executive / Change Agent On Hiatus March 2015  – Present (6 months) Beaverton, Oregon On Hiatus from Corporate America while pursuing my Integral Coaching Certificate from New Ventures West (San Francisco California). Time to invest in my own skill set to enable others to advance theirs. \n \nWilling to consider leadership or consulting opportunities that align with my skills and experience and where I can make a difference to the bottom line. Senior Director: Worldwide Operations Planning TriQuint Semiconductor September 2010  –  March 2015  (4 years 7 months) Hillsboro, Oregon Supply Chain Management from Customer Forecast through Order Fulfilment. Currently leading a direct team of ~ 50 employees worldwide. Focus areas include revenue and capital/cost management as well as driving corporate wide improvement process for customer delivery, S&OP, business analytics and engineering planning. Highly skilled with business analytic systems, including the implementation and usage of RapidResponse (Kinaxis). Expert public speaker on a variety of topics from business systems to management & leadership to employee coaching and development. Director of Operations Intel Corporation April 2006  –  May 2010  (4 years 2 months) Provide Business Operational support for a Graphics Device Development team, specifically in Strategic Organizational development and growth, program office management, Critical Success Indicators and supporting processes, day to day org management. Also support corporate wide team management for R&D Co-location efforts, reporting directly into the CEO. Also provided same level support for Intel's Wi-Max effort. Director of Human Resources Intel Corporation February 2007  –  May 2007  (4 months) Sabbatical Coverage for DEG organization, 12,000 employees, supporting all elements of HR.... peformance management, staffing, org development Director of Supply Chain Improvement Intel Corporation 2001  –  2006  (5 years) Provided managerial leadership and Chief Architect support for supply chain process and tools improvements for Supply/Demand elements of Intel's SC. Led business process design, and oversaw supporting IT technical tool development and deployments. Programs delivered over $1B in cost improvement or revenue uplift. Programs included demand forecasting tools (I2), factory scheduling optimizers (SAP APO), as well as customer global demand alignment. Director of Planning: Boards & Systems Intel June 1999  –  August 2001  (2 years 3 months) Supply /Demand and Capacity Management planning direction for Intel's Boards and Systems Group. WW Fab Planning Director Intel Corporation May 1997  –  June 1999  (2 years 2 months) Rio Rancho, New Mexico Management of all supply chain elements associated with Intel's world wide fab planning organization. Planning responsiblity for 15 fab manufacturing fabs, factory capacity analysis, supply demand analysis and process control. Factory Planning Manager Intel Corporation May 1983  –  June 1999  (16 years 2 months) Responsible for all factory planning elements for a variety of different fabs over the year span. Factory capacity, output commitents, wafer starts, excursion management. Specicalized in low cost, high volume manufacturing Planning Supervisor: Fab Operator Training Intel Corp 1981  –  1983  (2 years) Supervision for 15-25 Fab Trainers across 4 factory shifts Supply Chain Executive / Change Agent On Hiatus March 2015  – Present (6 months) Beaverton, Oregon On Hiatus from Corporate America while pursuing my Integral Coaching Certificate from New Ventures West (San Francisco California). Time to invest in my own skill set to enable others to advance theirs. \n \nWilling to consider leadership or consulting opportunities that align with my skills and experience and where I can make a difference to the bottom line. Supply Chain Executive / Change Agent On Hiatus March 2015  – Present (6 months) Beaverton, Oregon On Hiatus from Corporate America while pursuing my Integral Coaching Certificate from New Ventures West (San Francisco California). Time to invest in my own skill set to enable others to advance theirs. \n \nWilling to consider leadership or consulting opportunities that align with my skills and experience and where I can make a difference to the bottom line. Senior Director: Worldwide Operations Planning TriQuint Semiconductor September 2010  –  March 2015  (4 years 7 months) Hillsboro, Oregon Supply Chain Management from Customer Forecast through Order Fulfilment. Currently leading a direct team of ~ 50 employees worldwide. Focus areas include revenue and capital/cost management as well as driving corporate wide improvement process for customer delivery, S&OP, business analytics and engineering planning. Highly skilled with business analytic systems, including the implementation and usage of RapidResponse (Kinaxis). Expert public speaker on a variety of topics from business systems to management & leadership to employee coaching and development. Senior Director: Worldwide Operations Planning TriQuint Semiconductor September 2010  –  March 2015  (4 years 7 months) Hillsboro, Oregon Supply Chain Management from Customer Forecast through Order Fulfilment. Currently leading a direct team of ~ 50 employees worldwide. Focus areas include revenue and capital/cost management as well as driving corporate wide improvement process for customer delivery, S&OP, business analytics and engineering planning. Highly skilled with business analytic systems, including the implementation and usage of RapidResponse (Kinaxis). Expert public speaker on a variety of topics from business systems to management & leadership to employee coaching and development. Director of Operations Intel Corporation April 2006  –  May 2010  (4 years 2 months) Provide Business Operational support for a Graphics Device Development team, specifically in Strategic Organizational development and growth, program office management, Critical Success Indicators and supporting processes, day to day org management. Also support corporate wide team management for R&D Co-location efforts, reporting directly into the CEO. Also provided same level support for Intel's Wi-Max effort. Director of Operations Intel Corporation April 2006  –  May 2010  (4 years 2 months) Provide Business Operational support for a Graphics Device Development team, specifically in Strategic Organizational development and growth, program office management, Critical Success Indicators and supporting processes, day to day org management. Also support corporate wide team management for R&D Co-location efforts, reporting directly into the CEO. Also provided same level support for Intel's Wi-Max effort. Director of Human Resources Intel Corporation February 2007  –  May 2007  (4 months) Sabbatical Coverage for DEG organization, 12,000 employees, supporting all elements of HR.... peformance management, staffing, org development Director of Human Resources Intel Corporation February 2007  –  May 2007  (4 months) Sabbatical Coverage for DEG organization, 12,000 employees, supporting all elements of HR.... peformance management, staffing, org development Director of Supply Chain Improvement Intel Corporation 2001  –  2006  (5 years) Provided managerial leadership and Chief Architect support for supply chain process and tools improvements for Supply/Demand elements of Intel's SC. Led business process design, and oversaw supporting IT technical tool development and deployments. Programs delivered over $1B in cost improvement or revenue uplift. Programs included demand forecasting tools (I2), factory scheduling optimizers (SAP APO), as well as customer global demand alignment. Director of Supply Chain Improvement Intel Corporation 2001  –  2006  (5 years) Provided managerial leadership and Chief Architect support for supply chain process and tools improvements for Supply/Demand elements of Intel's SC. Led business process design, and oversaw supporting IT technical tool development and deployments. Programs delivered over $1B in cost improvement or revenue uplift. Programs included demand forecasting tools (I2), factory scheduling optimizers (SAP APO), as well as customer global demand alignment. Director of Planning: Boards & Systems Intel June 1999  –  August 2001  (2 years 3 months) Supply /Demand and Capacity Management planning direction for Intel's Boards and Systems Group. Director of Planning: Boards & Systems Intel June 1999  –  August 2001  (2 years 3 months) Supply /Demand and Capacity Management planning direction for Intel's Boards and Systems Group. WW Fab Planning Director Intel Corporation May 1997  –  June 1999  (2 years 2 months) Rio Rancho, New Mexico Management of all supply chain elements associated with Intel's world wide fab planning organization. Planning responsiblity for 15 fab manufacturing fabs, factory capacity analysis, supply demand analysis and process control. WW Fab Planning Director Intel Corporation May 1997  –  June 1999  (2 years 2 months) Rio Rancho, New Mexico Management of all supply chain elements associated with Intel's world wide fab planning organization. Planning responsiblity for 15 fab manufacturing fabs, factory capacity analysis, supply demand analysis and process control. Factory Planning Manager Intel Corporation May 1983  –  June 1999  (16 years 2 months) Responsible for all factory planning elements for a variety of different fabs over the year span. Factory capacity, output commitents, wafer starts, excursion management. Specicalized in low cost, high volume manufacturing Planning Factory Planning Manager Intel Corporation May 1983  –  June 1999  (16 years 2 months) Responsible for all factory planning elements for a variety of different fabs over the year span. Factory capacity, output commitents, wafer starts, excursion management. Specicalized in low cost, high volume manufacturing Planning Supervisor: Fab Operator Training Intel Corp 1981  –  1983  (2 years) Supervision for 15-25 Fab Trainers across 4 factory shifts Supervisor: Fab Operator Training Intel Corp 1981  –  1983  (2 years) Supervision for 15-25 Fab Trainers across 4 factory shifts Skills Supply Chain SAP I2 Business Operations Organizational... Supply Chain Management Process Improvement Strategy Team Building Program Management Cross-functional Team... Management Operations Management Project Planning Supply Management Strategic Planning Manufacturing Process Engineering Product Management Team Management Lean Manufacturing Leadership Analysis Training Enterprise Software Performance Management Recruiting Human Resources Six Sigma Semiconductors Semiconductor Industry SPC Continuous Improvement Manufacturing... Engineering Management See 20+     See less Skills  Supply Chain SAP I2 Business Operations Organizational... Supply Chain Management Process Improvement Strategy Team Building Program Management Cross-functional Team... Management Operations Management Project Planning Supply Management Strategic Planning Manufacturing Process Engineering Product Management Team Management Lean Manufacturing Leadership Analysis Training Enterprise Software Performance Management Recruiting Human Resources Six Sigma Semiconductors Semiconductor Industry SPC Continuous Improvement Manufacturing... Engineering Management See 20+     See less Supply Chain SAP I2 Business Operations Organizational... Supply Chain Management Process Improvement Strategy Team Building Program Management Cross-functional Team... Management Operations Management Project Planning Supply Management Strategic Planning Manufacturing Process Engineering Product Management Team Management Lean Manufacturing Leadership Analysis Training Enterprise Software Performance Management Recruiting Human Resources Six Sigma Semiconductors Semiconductor Industry SPC Continuous Improvement Manufacturing... Engineering Management See 20+     See less Supply Chain SAP I2 Business Operations Organizational... Supply Chain Management Process Improvement Strategy Team Building Program Management Cross-functional Team... Management Operations Management Project Planning Supply Management Strategic Planning Manufacturing Process Engineering Product Management Team Management Lean Manufacturing Leadership Analysis Training Enterprise Software Performance Management Recruiting Human Resources Six Sigma Semiconductors Semiconductor Industry SPC Continuous Improvement Manufacturing... Engineering Management See 20+     See less Education University of Portland BBA,  Marketing , Management 1978  – 1981 Completed 5 year dual major degree in 3 years University of Portland BBA,  Marketing , Management 1978  – 1981 Completed 5 year dual major degree in 3 years University of Portland BBA,  Marketing , Management 1978  – 1981 Completed 5 year dual major degree in 3 years University of Portland BBA,  Marketing , Management 1978  – 1981 Completed 5 year dual major degree in 3 years Honors & Awards C.P.I.M. American Production & Inventory Control Society July 1985 CPIM designation is a professional certification offered by APICS The Association for Operations Management. APICS CPIM designees learn essential terminology, concepts, and strategies related to demand management, procurement and supplier planning, material requirements planning, capacity requirements planning, sales and operations planning, master scheduling, performance measurements, supplier relationships, quality control, and continuous improvement. \n \nTo earn the APICS CPIM designation, operations management professionals must successfully complete five exams: Basics of Supply Chain Management, Master Planning of Resources, Detailed Scheduling and Planning, Execution and Control of Operations, Strategic Management of Resources \n C.P.I.M. American Production & Inventory Control Society July 1985 CPIM designation is a professional certification offered by APICS The Association for Operations Management. APICS CPIM designees learn essential terminology, concepts, and strategies related to demand management, procurement and supplier planning, material requirements planning, capacity requirements planning, sales and operations planning, master scheduling, performance measurements, supplier relationships, quality control, and continuous improvement. \n \nTo earn the APICS CPIM designation, operations management professionals must successfully complete five exams: Basics of Supply Chain Management, Master Planning of Resources, Detailed Scheduling and Planning, Execution and Control of Operations, Strategic Management of Resources \n C.P.I.M. American Production & Inventory Control Society July 1985 CPIM designation is a professional certification offered by APICS The Association for Operations Management. APICS CPIM designees learn essential terminology, concepts, and strategies related to demand management, procurement and supplier planning, material requirements planning, capacity requirements planning, sales and operations planning, master scheduling, performance measurements, supplier relationships, quality control, and continuous improvement. \n \nTo earn the APICS CPIM designation, operations management professionals must successfully complete five exams: Basics of Supply Chain Management, Master Planning of Resources, Detailed Scheduling and Planning, Execution and Control of Operations, Strategic Management of Resources \n C.P.I.M. American Production & Inventory Control Society July 1985 CPIM designation is a professional certification offered by APICS The Association for Operations Management. APICS CPIM designees learn essential terminology, concepts, and strategies related to demand management, procurement and supplier planning, material requirements planning, capacity requirements planning, sales and operations planning, master scheduling, performance measurements, supplier relationships, quality control, and continuous improvement. \n \nTo earn the APICS CPIM designation, operations management professionals must successfully complete five exams: Basics of Supply Chain Management, Master Planning of Resources, Detailed Scheduling and Planning, Execution and Control of Operations, Strategic Management of Resources \n ", "Experience Business Transformation Consulting Manager Intel Corporation October 2012  – Present (2 years 11 months) Hudson, MA Manage a globally dispersed team of Business Transformation Consultants pairing deep business acumen with excellent systems thinking to engage with business leaders to design, build and transform organizations to help them successfully fulfill their role in Intel’s current and future success. Human Resources Manager Intel Corporation September 2010  –  October 2012  (2 years 2 months) Provide strategic Human Resource direction to the factory staff and organization, implement Strategic HR initiatives and programs. Partner with site leadership team to understand indicators and trends and build effective responses where issues exist. Factory Planning Manager Intel Corporation 2006  –  2010  (4 years) Led the factory planning organization, setting direction in developing and implementing product family and supply strategies in support of production. Drove results in factory load plans, die out support, and new product introductions. Identify and drive continuous improvements within the factory and across the Virtual Factory network. Industrial Engineering Group Leader Intel Corporation 2002  –  2006  (4 years) Led the F17 Industrial Engineering group responsible for people management and results for 16 IEs developing, coordinating, and driving factory long range strategic planning, tactical capacity optimization, manufacturing execution systems, and capital management practices. Industrial Engineer Intel Corporation 2000  –  2002  (2 years) Responsible for layout development and strategic capacity analysis and coordination for new technology start up and ramp Material Handling Systems Engineer Intel Corporation 1998  –  2000  (2 years) Developed models used to design and test Automated Material Handling Systems used in Intel’s factories Industrial Engineering Intern SEMATECH 1995  –  1996  (1 year) Business Transformation Consulting Manager Intel Corporation October 2012  – Present (2 years 11 months) Hudson, MA Manage a globally dispersed team of Business Transformation Consultants pairing deep business acumen with excellent systems thinking to engage with business leaders to design, build and transform organizations to help them successfully fulfill their role in Intel’s current and future success. Business Transformation Consulting Manager Intel Corporation October 2012  – Present (2 years 11 months) Hudson, MA Manage a globally dispersed team of Business Transformation Consultants pairing deep business acumen with excellent systems thinking to engage with business leaders to design, build and transform organizations to help them successfully fulfill their role in Intel’s current and future success. Human Resources Manager Intel Corporation September 2010  –  October 2012  (2 years 2 months) Provide strategic Human Resource direction to the factory staff and organization, implement Strategic HR initiatives and programs. Partner with site leadership team to understand indicators and trends and build effective responses where issues exist. Human Resources Manager Intel Corporation September 2010  –  October 2012  (2 years 2 months) Provide strategic Human Resource direction to the factory staff and organization, implement Strategic HR initiatives and programs. Partner with site leadership team to understand indicators and trends and build effective responses where issues exist. Factory Planning Manager Intel Corporation 2006  –  2010  (4 years) Led the factory planning organization, setting direction in developing and implementing product family and supply strategies in support of production. Drove results in factory load plans, die out support, and new product introductions. Identify and drive continuous improvements within the factory and across the Virtual Factory network. Factory Planning Manager Intel Corporation 2006  –  2010  (4 years) Led the factory planning organization, setting direction in developing and implementing product family and supply strategies in support of production. Drove results in factory load plans, die out support, and new product introductions. Identify and drive continuous improvements within the factory and across the Virtual Factory network. Industrial Engineering Group Leader Intel Corporation 2002  –  2006  (4 years) Led the F17 Industrial Engineering group responsible for people management and results for 16 IEs developing, coordinating, and driving factory long range strategic planning, tactical capacity optimization, manufacturing execution systems, and capital management practices. Industrial Engineering Group Leader Intel Corporation 2002  –  2006  (4 years) Led the F17 Industrial Engineering group responsible for people management and results for 16 IEs developing, coordinating, and driving factory long range strategic planning, tactical capacity optimization, manufacturing execution systems, and capital management practices. Industrial Engineer Intel Corporation 2000  –  2002  (2 years) Responsible for layout development and strategic capacity analysis and coordination for new technology start up and ramp Industrial Engineer Intel Corporation 2000  –  2002  (2 years) Responsible for layout development and strategic capacity analysis and coordination for new technology start up and ramp Material Handling Systems Engineer Intel Corporation 1998  –  2000  (2 years) Developed models used to design and test Automated Material Handling Systems used in Intel’s factories Material Handling Systems Engineer Intel Corporation 1998  –  2000  (2 years) Developed models used to design and test Automated Material Handling Systems used in Intel’s factories Industrial Engineering Intern SEMATECH 1995  –  1996  (1 year) Industrial Engineering Intern SEMATECH 1995  –  1996  (1 year) Skills Lean Manufacturing Semiconductors SPC Six Sigma Continuous Improvement Process Engineering Strategy Management Industrial Engineering Program Management Start-ups Analysis Leadership Strategic Planning Product Development Skills  Lean Manufacturing Semiconductors SPC Six Sigma Continuous Improvement Process Engineering Strategy Management Industrial Engineering Program Management Start-ups Analysis Leadership Strategic Planning Product Development Lean Manufacturing Semiconductors SPC Six Sigma Continuous Improvement Process Engineering Strategy Management Industrial Engineering Program Management Start-ups Analysis Leadership Strategic Planning Product Development Lean Manufacturing Semiconductors SPC Six Sigma Continuous Improvement Process Engineering Strategy Management Industrial Engineering Program Management Start-ups Analysis Leadership Strategic Planning Product Development Education Rochester Institute of Technology BS,  Industrial Engineering 1993  – 1998 Activities and Societies:  Zeta Tau Alpha Rochester Institute of Technology BS,  Industrial Engineering 1993  – 1998 Activities and Societies:  Zeta Tau Alpha Rochester Institute of Technology BS,  Industrial Engineering 1993  – 1998 Activities and Societies:  Zeta Tau Alpha Rochester Institute of Technology BS,  Industrial Engineering 1993  – 1998 Activities and Societies:  Zeta Tau Alpha "]}