{"position": "Finance Controller", "company": "Intel Corporation", "profiles": ["Experience Finance Controller Intel Corporation June 2011  – Present (4 years 3 months) FP&A for Mobile and Communications Group, one of Intel's largest divisions. Responsible for Revenue/Gross Margin, Spending, Capital, Controls, Financial Systems, and Strategy. Lead a team of 18 Finance Professionals. Finance Controller Intel Corporation December 2007  –  June 2011  (3 years 7 months) World Wide Revenue Controller \nRevenue Planning, Forecasting, Reporting, and Control for all Intel Geographies and Business Units. Sr Finance Manager Intel 2005  –  2007  (2 years) Long Range Planning Finance \nFinancial Planning and Analysis for Corporate 5 Year Demand, Capacity, and Competitive Environment. Developed and Presented CPU and Corporate Long Range Financial Statements to Executive Management. Pricing and Revenue Analysis, Support. Finance Manager Intel 2002  –  2004  (2 years) Financial Planning and Analysis for Product Division. Product Roadmap Analysis and Recommendations, FP&A for R&D and Capital, Spending Forecasting, Reporting and Control. Negotiation/Contract Analysis, Support, and Control. Sr Finance Analyst Intel 2000  –  2001  (1 year) Product Cost and Product Roadmap Analyst. Financial Analysis for Si Product Definition and Marketing Strategies. Manufacturing Analysis for Cost Optimization. Cost Forecasting, Reporting and Control. Finance Controller Intel Corporation June 2011  – Present (4 years 3 months) FP&A for Mobile and Communications Group, one of Intel's largest divisions. Responsible for Revenue/Gross Margin, Spending, Capital, Controls, Financial Systems, and Strategy. Lead a team of 18 Finance Professionals. Finance Controller Intel Corporation June 2011  – Present (4 years 3 months) FP&A for Mobile and Communications Group, one of Intel's largest divisions. Responsible for Revenue/Gross Margin, Spending, Capital, Controls, Financial Systems, and Strategy. Lead a team of 18 Finance Professionals. Finance Controller Intel Corporation December 2007  –  June 2011  (3 years 7 months) World Wide Revenue Controller \nRevenue Planning, Forecasting, Reporting, and Control for all Intel Geographies and Business Units. Finance Controller Intel Corporation December 2007  –  June 2011  (3 years 7 months) World Wide Revenue Controller \nRevenue Planning, Forecasting, Reporting, and Control for all Intel Geographies and Business Units. Sr Finance Manager Intel 2005  –  2007  (2 years) Long Range Planning Finance \nFinancial Planning and Analysis for Corporate 5 Year Demand, Capacity, and Competitive Environment. Developed and Presented CPU and Corporate Long Range Financial Statements to Executive Management. Pricing and Revenue Analysis, Support. Sr Finance Manager Intel 2005  –  2007  (2 years) Long Range Planning Finance \nFinancial Planning and Analysis for Corporate 5 Year Demand, Capacity, and Competitive Environment. Developed and Presented CPU and Corporate Long Range Financial Statements to Executive Management. Pricing and Revenue Analysis, Support. Finance Manager Intel 2002  –  2004  (2 years) Financial Planning and Analysis for Product Division. Product Roadmap Analysis and Recommendations, FP&A for R&D and Capital, Spending Forecasting, Reporting and Control. Negotiation/Contract Analysis, Support, and Control. Finance Manager Intel 2002  –  2004  (2 years) Financial Planning and Analysis for Product Division. Product Roadmap Analysis and Recommendations, FP&A for R&D and Capital, Spending Forecasting, Reporting and Control. Negotiation/Contract Analysis, Support, and Control. Sr Finance Analyst Intel 2000  –  2001  (1 year) Product Cost and Product Roadmap Analyst. Financial Analysis for Si Product Definition and Marketing Strategies. Manufacturing Analysis for Cost Optimization. Cost Forecasting, Reporting and Control. Sr Finance Analyst Intel 2000  –  2001  (1 year) Product Cost and Product Roadmap Analyst. Financial Analysis for Si Product Definition and Marketing Strategies. Manufacturing Analysis for Cost Optimization. Cost Forecasting, Reporting and Control. Skills Financial Modeling Financial Analysis Strategy Strategic Financial... Cross-functional Team... Forecasting Analysis Pricing Financial Forecasting Product Development Management Project Planning Finance Marketing Strategy Competitive Analysis Skills  Financial Modeling Financial Analysis Strategy Strategic Financial... Cross-functional Team... Forecasting Analysis Pricing Financial Forecasting Product Development Management Project Planning Finance Marketing Strategy Competitive Analysis Financial Modeling Financial Analysis Strategy Strategic Financial... Cross-functional Team... Forecasting Analysis Pricing Financial Forecasting Product Development Management Project Planning Finance Marketing Strategy Competitive Analysis Financial Modeling Financial Analysis Strategy Strategic Financial... Cross-functional Team... Forecasting Analysis Pricing Financial Forecasting Product Development Management Project Planning Finance Marketing Strategy Competitive Analysis Education The Hebrew University MBA,  Finance 1997  – 1999 University of California, Los Angeles BA 1990  – 1994 The Hebrew University MBA,  Finance 1997  – 1999 The Hebrew University MBA,  Finance 1997  – 1999 The Hebrew University MBA,  Finance 1997  – 1999 University of California, Los Angeles BA 1990  – 1994 University of California, Los Angeles BA 1990  – 1994 University of California, Los Angeles BA 1990  – 1994 ", "Skills Financial Analysis Mergers & Acquisitions Mergers Financial Modeling Cross-functional Team... Start-ups Forecasting Competitive Analysis Corporate Finance Finance Strategy Venture Capital Due Diligence Valuation Corporate Development Team Management Coaching See 2+     See less Skills  Financial Analysis Mergers & Acquisitions Mergers Financial Modeling Cross-functional Team... Start-ups Forecasting Competitive Analysis Corporate Finance Finance Strategy Venture Capital Due Diligence Valuation Corporate Development Team Management Coaching See 2+     See less Financial Analysis Mergers & Acquisitions Mergers Financial Modeling Cross-functional Team... Start-ups Forecasting Competitive Analysis Corporate Finance Finance Strategy Venture Capital Due Diligence Valuation Corporate Development Team Management Coaching See 2+     See less Financial Analysis Mergers & Acquisitions Mergers Financial Modeling Cross-functional Team... Start-ups Forecasting Competitive Analysis Corporate Finance Finance Strategy Venture Capital Due Diligence Valuation Corporate Development Team Management Coaching See 2+     See less ", "Experience Finance Controller Intel Corporation January 2011  – Present (4 years 8 months) Austin, Texas Area Sr Finance Manager Intel Corp 2006  –  2010  (4 years) Product Engineer Chrysler 1998  –  2002  (4 years) Finance Controller Intel Corporation January 2011  – Present (4 years 8 months) Austin, Texas Area Finance Controller Intel Corporation January 2011  – Present (4 years 8 months) Austin, Texas Area Sr Finance Manager Intel Corp 2006  –  2010  (4 years) Sr Finance Manager Intel Corp 2006  –  2010  (4 years) Product Engineer Chrysler 1998  –  2002  (4 years) Product Engineer Chrysler 1998  –  2002  (4 years) Languages Hindi Hindi Hindi Skills Project Management Cross-functional Team... Management Product Development Business Development Project Planning Analysis Accounting Finance Pricing Managerial Finance Financial Modeling Financial Analysis Budgets Financial Reporting Skills  Project Management Cross-functional Team... Management Product Development Business Development Project Planning Analysis Accounting Finance Pricing Managerial Finance Financial Modeling Financial Analysis Budgets Financial Reporting Project Management Cross-functional Team... Management Product Development Business Development Project Planning Analysis Accounting Finance Pricing Managerial Finance Financial Modeling Financial Analysis Budgets Financial Reporting Project Management Cross-functional Team... Management Product Development Business Development Project Planning Analysis Accounting Finance Pricing Managerial Finance Financial Modeling Financial Analysis Budgets Financial Reporting Education University of Michigan - Stephen M. Ross School of Business Master of Business Administration (MBA) 1999  – 2002 Delhi College of Engineering University of Michigan - Stephen M. Ross School of Business Master of Business Administration (MBA) 1999  – 2002 University of Michigan - Stephen M. Ross School of Business Master of Business Administration (MBA) 1999  – 2002 University of Michigan - Stephen M. Ross School of Business Master of Business Administration (MBA) 1999  – 2002 Delhi College of Engineering Delhi College of Engineering Delhi College of Engineering ", "Summary Motivated and strong organizational leader that has defined and executed significant results through effective strategy development. Well rounded financial skillset including strategy formulation, operational budgeting, and compliance & risk management. Proven leader of large worldwide teams across U.S., Latin America and Asia.  \n \nRecent specialties include supply chain strategy, technology development investment, and manufacturing finance. Summary Motivated and strong organizational leader that has defined and executed significant results through effective strategy development. Well rounded financial skillset including strategy formulation, operational budgeting, and compliance & risk management. Proven leader of large worldwide teams across U.S., Latin America and Asia.  \n \nRecent specialties include supply chain strategy, technology development investment, and manufacturing finance. Motivated and strong organizational leader that has defined and executed significant results through effective strategy development. Well rounded financial skillset including strategy formulation, operational budgeting, and compliance & risk management. Proven leader of large worldwide teams across U.S., Latin America and Asia.  \n \nRecent specialties include supply chain strategy, technology development investment, and manufacturing finance. Motivated and strong organizational leader that has defined and executed significant results through effective strategy development. Well rounded financial skillset including strategy formulation, operational budgeting, and compliance & risk management. Proven leader of large worldwide teams across U.S., Latin America and Asia.  \n \nRecent specialties include supply chain strategy, technology development investment, and manufacturing finance. Experience Vice President of Finance, Assembly Test & Customer Fulfilment Intel Corporation March 2013  – Present (2 years 6 months) Chandler, AZ Designs and implements cost strategies and fiduciary controls for a worldwide assembly & test factory network that spans across five countries in Asia, Latin America and the U.S. Also provides financial support for supply chain planning, warehouse and logistics operations, and regulatory customs compliance. Global Sourcing & Procurement, Finance Director Intel Corporation March 2010  –  March 2013  (3 years 1 month) Chandler, AZ Strategic supplier management and negotiation planning on a worldwide procurement scope of $15B annually. Also drives operational budget and complete solutions for company-wide req-to-settle controls and risk mitigation. Technology Development, Sr. Finance Controller Intel Corporation 2003  –  2010  (7 years) Delivered cost strategies worth $1B+ annually on Intel’s CPU platforms. Prioritized investments and budgets for new technology architectures in substrates, assembly, and test. Fab Manufacturing, Finance Controller Intel Corporation 1999  –  2002  (3 years) Technology & Manufacturing Engineering, Finance Manager Intel Corporation 1996  –  1998  (2 years) Corporate Quality, Finance Manager Intel Corporation 1995  –  1996  (1 year) Embedded Microcontrollers Division, P&L Finance Analyst Intel Corporation 1992  –  1994  (2 years) Network & Systems Division, Finance Analyst Intel Corporation 1990  –  1991  (1 year) Workstation & Computing Group, Cost Accountant intern Hewlett-Packard 1988  –  1988  (less than a year) Fort Collins, Colorado Area Vice President of Finance, Assembly Test & Customer Fulfilment Intel Corporation March 2013  – Present (2 years 6 months) Chandler, AZ Designs and implements cost strategies and fiduciary controls for a worldwide assembly & test factory network that spans across five countries in Asia, Latin America and the U.S. Also provides financial support for supply chain planning, warehouse and logistics operations, and regulatory customs compliance. Vice President of Finance, Assembly Test & Customer Fulfilment Intel Corporation March 2013  – Present (2 years 6 months) Chandler, AZ Designs and implements cost strategies and fiduciary controls for a worldwide assembly & test factory network that spans across five countries in Asia, Latin America and the U.S. Also provides financial support for supply chain planning, warehouse and logistics operations, and regulatory customs compliance. Global Sourcing & Procurement, Finance Director Intel Corporation March 2010  –  March 2013  (3 years 1 month) Chandler, AZ Strategic supplier management and negotiation planning on a worldwide procurement scope of $15B annually. Also drives operational budget and complete solutions for company-wide req-to-settle controls and risk mitigation. Global Sourcing & Procurement, Finance Director Intel Corporation March 2010  –  March 2013  (3 years 1 month) Chandler, AZ Strategic supplier management and negotiation planning on a worldwide procurement scope of $15B annually. Also drives operational budget and complete solutions for company-wide req-to-settle controls and risk mitigation. Technology Development, Sr. Finance Controller Intel Corporation 2003  –  2010  (7 years) Delivered cost strategies worth $1B+ annually on Intel’s CPU platforms. Prioritized investments and budgets for new technology architectures in substrates, assembly, and test. Technology Development, Sr. Finance Controller Intel Corporation 2003  –  2010  (7 years) Delivered cost strategies worth $1B+ annually on Intel’s CPU platforms. Prioritized investments and budgets for new technology architectures in substrates, assembly, and test. Fab Manufacturing, Finance Controller Intel Corporation 1999  –  2002  (3 years) Fab Manufacturing, Finance Controller Intel Corporation 1999  –  2002  (3 years) Technology & Manufacturing Engineering, Finance Manager Intel Corporation 1996  –  1998  (2 years) Technology & Manufacturing Engineering, Finance Manager Intel Corporation 1996  –  1998  (2 years) Corporate Quality, Finance Manager Intel Corporation 1995  –  1996  (1 year) Corporate Quality, Finance Manager Intel Corporation 1995  –  1996  (1 year) Embedded Microcontrollers Division, P&L Finance Analyst Intel Corporation 1992  –  1994  (2 years) Embedded Microcontrollers Division, P&L Finance Analyst Intel Corporation 1992  –  1994  (2 years) Network & Systems Division, Finance Analyst Intel Corporation 1990  –  1991  (1 year) Network & Systems Division, Finance Analyst Intel Corporation 1990  –  1991  (1 year) Workstation & Computing Group, Cost Accountant intern Hewlett-Packard 1988  –  1988  (less than a year) Fort Collins, Colorado Area Workstation & Computing Group, Cost Accountant intern Hewlett-Packard 1988  –  1988  (less than a year) Fort Collins, Colorado Area Skills Corporate Finance Business Strategy Manufacturing Finance Organizational... Compliance Supply Chain Management Budget Process Budgets Project Planning Financial Modeling Strategy Leadership Finance Forecasting Internal Controls Manufacturing See 1+     See less Skills  Corporate Finance Business Strategy Manufacturing Finance Organizational... Compliance Supply Chain Management Budget Process Budgets Project Planning Financial Modeling Strategy Leadership Finance Forecasting Internal Controls Manufacturing See 1+     See less Corporate Finance Business Strategy Manufacturing Finance Organizational... Compliance Supply Chain Management Budget Process Budgets Project Planning Financial Modeling Strategy Leadership Finance Forecasting Internal Controls Manufacturing See 1+     See less Corporate Finance Business Strategy Manufacturing Finance Organizational... Compliance Supply Chain Management Budget Process Budgets Project Planning Financial Modeling Strategy Leadership Finance Forecasting Internal Controls Manufacturing See 1+     See less Education Arizona State University, W. P. Carey School of Business MBA,  Business Administration , Management and Operations 1988  – 1990 Arizona State University Bachelor of Science (B.S.),  Finance , General Arizona State University, W. P. Carey School of Business MBA,  Business Administration , Management and Operations 1988  – 1990 Arizona State University, W. P. Carey School of Business MBA,  Business Administration , Management and Operations 1988  – 1990 Arizona State University, W. P. Carey School of Business MBA,  Business Administration , Management and Operations 1988  – 1990 Arizona State University Bachelor of Science (B.S.),  Finance , General Arizona State University Bachelor of Science (B.S.),  Finance , General Arizona State University Bachelor of Science (B.S.),  Finance , General ", "Experience Channel Finance Controller Intel Corporation October 2007  – Present (7 years 11 months) EMEA Stragic Finance Manager Intel Corporation August 2005  –  October 2008  (3 years 3 months) Channel Finance Controller Intel Corporation October 2007  – Present (7 years 11 months) Channel Finance Controller Intel Corporation October 2007  – Present (7 years 11 months) EMEA Stragic Finance Manager Intel Corporation August 2005  –  October 2008  (3 years 3 months) EMEA Stragic Finance Manager Intel Corporation August 2005  –  October 2008  (3 years 3 months) Skills Financial Analysis Forecasting Skills  Financial Analysis Forecasting Financial Analysis Forecasting Financial Analysis Forecasting Education University of the West of England 1982  – 1987 University of the West of England 1982  – 1987 University of the West of England 1982  – 1987 University of the West of England 1982  – 1987 ", "Experience EMEA Strategic Finance Controller Intel Corporation October 2011  – Present (3 years 11 months) Swindon, UK EMEA Finance Operations & Risk Management Controller Intel Corporation July 2008  –  October 2011  (3 years 4 months) EMEA Marketing Finance Manager Intel Corporation July 2006  –  June 2008  (2 years) EMEA Accounting Manager Intel July 2003  –  June 2006  (3 years) EMEA Revenue Finance Manager Intel Corporation June 2001  –  July 2003  (2 years 2 months) EMEA Sales & Marketing Budgets & Planning Manager Intel Corporation September 1999  –  June 2001  (1 year 10 months) Commercial Finance Manager Wincanton June 1994  –  August 1999  (5 years 3 months) EMEA Strategic Finance Controller Intel Corporation October 2011  – Present (3 years 11 months) Swindon, UK EMEA Strategic Finance Controller Intel Corporation October 2011  – Present (3 years 11 months) Swindon, UK EMEA Finance Operations & Risk Management Controller Intel Corporation July 2008  –  October 2011  (3 years 4 months) EMEA Finance Operations & Risk Management Controller Intel Corporation July 2008  –  October 2011  (3 years 4 months) EMEA Marketing Finance Manager Intel Corporation July 2006  –  June 2008  (2 years) EMEA Marketing Finance Manager Intel Corporation July 2006  –  June 2008  (2 years) EMEA Accounting Manager Intel July 2003  –  June 2006  (3 years) EMEA Accounting Manager Intel July 2003  –  June 2006  (3 years) EMEA Revenue Finance Manager Intel Corporation June 2001  –  July 2003  (2 years 2 months) EMEA Revenue Finance Manager Intel Corporation June 2001  –  July 2003  (2 years 2 months) EMEA Sales & Marketing Budgets & Planning Manager Intel Corporation September 1999  –  June 2001  (1 year 10 months) EMEA Sales & Marketing Budgets & Planning Manager Intel Corporation September 1999  –  June 2001  (1 year 10 months) Commercial Finance Manager Wincanton June 1994  –  August 1999  (5 years 3 months) Commercial Finance Manager Wincanton June 1994  –  August 1999  (5 years 3 months) Skills Business Strategy Financial Planning &... Financial Accounting Marketing Finance Risk Management Internal Controls Management Of... Cross-functional Team... Logistics EMEA Finance Project Planning Forecasting Budgets Skills  Business Strategy Financial Planning &... Financial Accounting Marketing Finance Risk Management Internal Controls Management Of... Cross-functional Team... Logistics EMEA Finance Project Planning Forecasting Budgets Business Strategy Financial Planning &... Financial Accounting Marketing Finance Risk Management Internal Controls Management Of... Cross-functional Team... Logistics EMEA Finance Project Planning Forecasting Budgets Business Strategy Financial Planning &... Financial Accounting Marketing Finance Risk Management Internal Controls Management Of... Cross-functional Team... Logistics EMEA Finance Project Planning Forecasting Budgets Education The University of Edinburgh MA,  Economics & Law 1985  – 1989 The University of Edinburgh MA,  Economics & Law 1985  – 1989 The University of Edinburgh MA,  Economics & Law 1985  – 1989 The University of Edinburgh MA,  Economics & Law 1985  – 1989 ", "Experience Finance Controller Intel Corporation February 2011  – Present (4 years 7 months) Senior Finance Manager Intel Capital November 2000  –  February 2011  (10 years 4 months) Assistant Vice President, Commercial Banking Union Bank of California January 1997  –  October 2000  (3 years 10 months) Finance Controller Intel Corporation February 2011  – Present (4 years 7 months) Finance Controller Intel Corporation February 2011  – Present (4 years 7 months) Senior Finance Manager Intel Capital November 2000  –  February 2011  (10 years 4 months) Senior Finance Manager Intel Capital November 2000  –  February 2011  (10 years 4 months) Assistant Vice President, Commercial Banking Union Bank of California January 1997  –  October 2000  (3 years 10 months) Assistant Vice President, Commercial Banking Union Bank of California January 1997  –  October 2000  (3 years 10 months) Skills Venture Capital Financial Modeling Mergers Financial Analysis Corporate Finance Mergers & Acquisitions Investments Valuation Due Diligence Corporate Development Skills  Venture Capital Financial Modeling Mergers Financial Analysis Corporate Finance Mergers & Acquisitions Investments Valuation Due Diligence Corporate Development Venture Capital Financial Modeling Mergers Financial Analysis Corporate Finance Mergers & Acquisitions Investments Valuation Due Diligence Corporate Development Venture Capital Financial Modeling Mergers Financial Analysis Corporate Finance Mergers & Acquisitions Investments Valuation Due Diligence Corporate Development Education Harvard Business School Executive Education,  Program for Leadership Development 2008  – 2009 University of Oregon - Charles H. Lundquist College of Business MBA,  General Business 1993  – 1995 University of Oregon Bachelor of Science,  Economics 1990  – 1994 Harvard Business School Executive Education,  Program for Leadership Development 2008  – 2009 Harvard Business School Executive Education,  Program for Leadership Development 2008  – 2009 Harvard Business School Executive Education,  Program for Leadership Development 2008  – 2009 University of Oregon - Charles H. Lundquist College of Business MBA,  General Business 1993  – 1995 University of Oregon - Charles H. Lundquist College of Business MBA,  General Business 1993  – 1995 University of Oregon - Charles H. Lundquist College of Business MBA,  General Business 1993  – 1995 University of Oregon Bachelor of Science,  Economics 1990  – 1994 University of Oregon Bachelor of Science,  Economics 1990  – 1994 University of Oregon Bachelor of Science,  Economics 1990  – 1994 ", "Experience Asia Construction Finance Controller Intel Corporation January 2008  – Present (7 years 8 months) Hong Kong Construction finance & cost control Regional Finance Project Controls Manager US Company June 2005  – Present (10 years 3 months) Manager M+W Group 1995  –  2003  (8 years) Asia Construction Finance Controller Intel Corporation January 2008  – Present (7 years 8 months) Hong Kong Construction finance & cost control Asia Construction Finance Controller Intel Corporation January 2008  – Present (7 years 8 months) Hong Kong Construction finance & cost control Regional Finance Project Controls Manager US Company June 2005  – Present (10 years 3 months) Regional Finance Project Controls Manager US Company June 2005  – Present (10 years 3 months) Manager M+W Group 1995  –  2003  (8 years) Manager M+W Group 1995  –  2003  (8 years) Skills Project Management Semiconductors Contract Negotiation Business Strategy Start-ups Finance Cross-functional Team... Program Management Procurement Project Control Financial Modeling Contract Management Strategic Planning Auditing Cost Control Process Improvement Process Engineering Operations Management Risk Management Forecasting Project Planning See 6+     See less Skills  Project Management Semiconductors Contract Negotiation Business Strategy Start-ups Finance Cross-functional Team... Program Management Procurement Project Control Financial Modeling Contract Management Strategic Planning Auditing Cost Control Process Improvement Process Engineering Operations Management Risk Management Forecasting Project Planning See 6+     See less Project Management Semiconductors Contract Negotiation Business Strategy Start-ups Finance Cross-functional Team... Program Management Procurement Project Control Financial Modeling Contract Management Strategic Planning Auditing Cost Control Process Improvement Process Engineering Operations Management Risk Management Forecasting Project Planning See 6+     See less Project Management Semiconductors Contract Negotiation Business Strategy Start-ups Finance Cross-functional Team... Program Management Procurement Project Control Financial Modeling Contract Management Strategic Planning Auditing Cost Control Process Improvement Process Engineering Operations Management Risk Management Forecasting Project Planning See 6+     See less ", "Experience Corporate Planning Finance Controller Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara, CA Operations Finance Controller, Non-volatile Memory Group Intel Corporation April 2012  –  April 2014  (2 years 1 month) Folsom, CA Business Development Finance Controller, Non-Volatile Memory Group Intel Corporation November 2010  –  April 2012  (1 year 6 months) Folsom, CA Strategic Planner, Non-volatile Memory Group Intel Corporation May 2009  –  November 2010  (1 year 7 months) Folsom, CA Strategic Finance Controller, Non-volatile Memory Group Intel April 2008  –  May 2009  (1 year 2 months) Folsom, CA Strategic Finance Manager, Non-Volatile Memory Group Intel Corporation January 2006  –  April 2008  (2 years 4 months) Folsom, CA Strategic Finance Manager, Flash Memory Group Intel February 2005  –  January 2006  (1 year) Folsom, CA Senior Finance Analyst Intel May 1999  –  February 2005  (5 years 10 months) Finance Intern EDS May 1998  –  August 1998  (4 months) Corporate Planning Finance Controller Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara, CA Corporate Planning Finance Controller Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara, CA Operations Finance Controller, Non-volatile Memory Group Intel Corporation April 2012  –  April 2014  (2 years 1 month) Folsom, CA Operations Finance Controller, Non-volatile Memory Group Intel Corporation April 2012  –  April 2014  (2 years 1 month) Folsom, CA Business Development Finance Controller, Non-Volatile Memory Group Intel Corporation November 2010  –  April 2012  (1 year 6 months) Folsom, CA Business Development Finance Controller, Non-Volatile Memory Group Intel Corporation November 2010  –  April 2012  (1 year 6 months) Folsom, CA Strategic Planner, Non-volatile Memory Group Intel Corporation May 2009  –  November 2010  (1 year 7 months) Folsom, CA Strategic Planner, Non-volatile Memory Group Intel Corporation May 2009  –  November 2010  (1 year 7 months) Folsom, CA Strategic Finance Controller, Non-volatile Memory Group Intel April 2008  –  May 2009  (1 year 2 months) Folsom, CA Strategic Finance Controller, Non-volatile Memory Group Intel April 2008  –  May 2009  (1 year 2 months) Folsom, CA Strategic Finance Manager, Non-Volatile Memory Group Intel Corporation January 2006  –  April 2008  (2 years 4 months) Folsom, CA Strategic Finance Manager, Non-Volatile Memory Group Intel Corporation January 2006  –  April 2008  (2 years 4 months) Folsom, CA Strategic Finance Manager, Flash Memory Group Intel February 2005  –  January 2006  (1 year) Folsom, CA Strategic Finance Manager, Flash Memory Group Intel February 2005  –  January 2006  (1 year) Folsom, CA Senior Finance Analyst Intel May 1999  –  February 2005  (5 years 10 months) Senior Finance Analyst Intel May 1999  –  February 2005  (5 years 10 months) Finance Intern EDS May 1998  –  August 1998  (4 months) Finance Intern EDS May 1998  –  August 1998  (4 months) Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Financial Analysis Financial Modeling Business Planning Process Improvement Finance Forecasting Auditing Strategic Financial... Budgets Cross-functional Team... Business Strategy Managerial Finance Variance Analysis Portfolio Management Mergers & Acquisitions Due Diligence Corporate Finance Financial Reporting Analysis Internal Controls Strategic Planning Leadership Strategy Sarbanes-Oxley Act Financial Planning See 10+     See less Skills  Financial Analysis Financial Modeling Business Planning Process Improvement Finance Forecasting Auditing Strategic Financial... Budgets Cross-functional Team... Business Strategy Managerial Finance Variance Analysis Portfolio Management Mergers & Acquisitions Due Diligence Corporate Finance Financial Reporting Analysis Internal Controls Strategic Planning Leadership Strategy Sarbanes-Oxley Act Financial Planning See 10+     See less Financial Analysis Financial Modeling Business Planning Process Improvement Finance Forecasting Auditing Strategic Financial... Budgets Cross-functional Team... Business Strategy Managerial Finance Variance Analysis Portfolio Management Mergers & Acquisitions Due Diligence Corporate Finance Financial Reporting Analysis Internal Controls Strategic Planning Leadership Strategy Sarbanes-Oxley Act Financial Planning See 10+     See less Financial Analysis Financial Modeling Business Planning Process Improvement Finance Forecasting Auditing Strategic Financial... Budgets Cross-functional Team... Business Strategy Managerial Finance Variance Analysis Portfolio Management Mergers & Acquisitions Due Diligence Corporate Finance Financial Reporting Analysis Internal Controls Strategic Planning Leadership Strategy Sarbanes-Oxley Act Financial Planning See 10+     See less Education Brigham Young University MBA,  Finance 1997  – 1999 Brigham Young University MS,  Civil Engineering 1990  – 1997 Brigham Young University MBA,  Finance 1997  – 1999 Brigham Young University MBA,  Finance 1997  – 1999 Brigham Young University MBA,  Finance 1997  – 1999 Brigham Young University MS,  Civil Engineering 1990  – 1997 Brigham Young University MS,  Civil Engineering 1990  – 1997 Brigham Young University MS,  Civil Engineering 1990  – 1997 ", "Summary My career thus far has been a set of diverse experiences. Spanning from full financial planning & analysis for a publicly reported segment, to leading organizations and people through challenging environments, to strategic business planning. \n \nI'm seeking opportunities to network, continue on this path, and grow the breadth and depth of my career experiences. Summary My career thus far has been a set of diverse experiences. Spanning from full financial planning & analysis for a publicly reported segment, to leading organizations and people through challenging environments, to strategic business planning. \n \nI'm seeking opportunities to network, continue on this path, and grow the breadth and depth of my career experiences. My career thus far has been a set of diverse experiences. Spanning from full financial planning & analysis for a publicly reported segment, to leading organizations and people through challenging environments, to strategic business planning. \n \nI'm seeking opportunities to network, continue on this path, and grow the breadth and depth of my career experiences. My career thus far has been a set of diverse experiences. Spanning from full financial planning & analysis for a publicly reported segment, to leading organizations and people through challenging environments, to strategic business planning. \n \nI'm seeking opportunities to network, continue on this path, and grow the breadth and depth of my career experiences. Experience IoT (Internet of Things) Finance Controller Intel Corporation September 2013  – Present (2 years) Phoenix, Arizona Area Led an organization of 13 individuals including management staff, responsibilities included Financial Planning and Analysis of a $2.5B externally reported P&L, Risk Management including Audit, Investment Portfolio Management, Business Development, and External Deal Management. Intelligent Systems Financial Planning & Analysis Finance Manager Intel Corporation August 2012  –  September 2013  (1 year 2 months) Directly managed a team of 5 financial analysts, the team owned and managed the financial statements for a $2B business including Income Statement, Balance Sheet, and Quarter End and Year End Close. Intelligent Systems Strategic Portfolio Management & M&A Finance Specialist Intel Corporation January 2011  –  August 2012  (1 year 8 months) Created a strategic portfolio management process for a $2B business, with $500M in annual investment on over 90 investment choices. Influenced the use of Stanford’s Decision Quality in an organization of 1600+ people; teaching, coaching, and mentoring on 10+ projects and 50 individuals. \n \nAnalyzed and facilitated two $100M+ acquisitions, 5 collaborative ventures, and a portfolio of 50 potential acquisitions for a business with $2B in annual revenue. Semiconductor Substrate Technology Sr. Financial Analyst Intel Corporation January 2009  –  January 2011  (2 years 1 month) Drove strategic technology decisions for $1B in spending for semiconductor substrates, $400M in savings achieved through proactive engagement with suppliers in Japan, Korea, Taiwan, and the Philippines on technology decisions. Government Grants and Semiconductor R&D Financial Analyst Intel Corporation May 2007  –  January 2009  (1 year 9 months) Led negotiations with the government of Ireland on a successful $25M R&D grant for communications semiconductor investment, and developed an advanced economic model to achieve a $15M R&D grant from the Malaysian government. Aerospace & Navigation Finance Intern Honeywell June 2005  –  September 2005  (4 months) Accounts Receivable Clerk Picciano & Scahill, P.C. June 2004  –  September 2004  (4 months) IoT (Internet of Things) Finance Controller Intel Corporation September 2013  – Present (2 years) Phoenix, Arizona Area Led an organization of 13 individuals including management staff, responsibilities included Financial Planning and Analysis of a $2.5B externally reported P&L, Risk Management including Audit, Investment Portfolio Management, Business Development, and External Deal Management. IoT (Internet of Things) Finance Controller Intel Corporation September 2013  – Present (2 years) Phoenix, Arizona Area Led an organization of 13 individuals including management staff, responsibilities included Financial Planning and Analysis of a $2.5B externally reported P&L, Risk Management including Audit, Investment Portfolio Management, Business Development, and External Deal Management. Intelligent Systems Financial Planning & Analysis Finance Manager Intel Corporation August 2012  –  September 2013  (1 year 2 months) Directly managed a team of 5 financial analysts, the team owned and managed the financial statements for a $2B business including Income Statement, Balance Sheet, and Quarter End and Year End Close. Intelligent Systems Financial Planning & Analysis Finance Manager Intel Corporation August 2012  –  September 2013  (1 year 2 months) Directly managed a team of 5 financial analysts, the team owned and managed the financial statements for a $2B business including Income Statement, Balance Sheet, and Quarter End and Year End Close. Intelligent Systems Strategic Portfolio Management & M&A Finance Specialist Intel Corporation January 2011  –  August 2012  (1 year 8 months) Created a strategic portfolio management process for a $2B business, with $500M in annual investment on over 90 investment choices. Influenced the use of Stanford’s Decision Quality in an organization of 1600+ people; teaching, coaching, and mentoring on 10+ projects and 50 individuals. \n \nAnalyzed and facilitated two $100M+ acquisitions, 5 collaborative ventures, and a portfolio of 50 potential acquisitions for a business with $2B in annual revenue. Intelligent Systems Strategic Portfolio Management & M&A Finance Specialist Intel Corporation January 2011  –  August 2012  (1 year 8 months) Created a strategic portfolio management process for a $2B business, with $500M in annual investment on over 90 investment choices. Influenced the use of Stanford’s Decision Quality in an organization of 1600+ people; teaching, coaching, and mentoring on 10+ projects and 50 individuals. \n \nAnalyzed and facilitated two $100M+ acquisitions, 5 collaborative ventures, and a portfolio of 50 potential acquisitions for a business with $2B in annual revenue. Semiconductor Substrate Technology Sr. Financial Analyst Intel Corporation January 2009  –  January 2011  (2 years 1 month) Drove strategic technology decisions for $1B in spending for semiconductor substrates, $400M in savings achieved through proactive engagement with suppliers in Japan, Korea, Taiwan, and the Philippines on technology decisions. Semiconductor Substrate Technology Sr. Financial Analyst Intel Corporation January 2009  –  January 2011  (2 years 1 month) Drove strategic technology decisions for $1B in spending for semiconductor substrates, $400M in savings achieved through proactive engagement with suppliers in Japan, Korea, Taiwan, and the Philippines on technology decisions. Government Grants and Semiconductor R&D Financial Analyst Intel Corporation May 2007  –  January 2009  (1 year 9 months) Led negotiations with the government of Ireland on a successful $25M R&D grant for communications semiconductor investment, and developed an advanced economic model to achieve a $15M R&D grant from the Malaysian government. Government Grants and Semiconductor R&D Financial Analyst Intel Corporation May 2007  –  January 2009  (1 year 9 months) Led negotiations with the government of Ireland on a successful $25M R&D grant for communications semiconductor investment, and developed an advanced economic model to achieve a $15M R&D grant from the Malaysian government. Aerospace & Navigation Finance Intern Honeywell June 2005  –  September 2005  (4 months) Aerospace & Navigation Finance Intern Honeywell June 2005  –  September 2005  (4 months) Accounts Receivable Clerk Picciano & Scahill, P.C. June 2004  –  September 2004  (4 months) Accounts Receivable Clerk Picciano & Scahill, P.C. June 2004  –  September 2004  (4 months) Skills Mergers & Acquisitions Strategic Financial... Government Contract... Professional Mentoring Investment Portfolio Real Options Analysis Game Theory International Business Team Leadership Organizational Culture Employee Training Financial Reporting Corporate Finance Decision Analysis Financial Accounting Management Accounting See 1+     See less Skills  Mergers & Acquisitions Strategic Financial... Government Contract... Professional Mentoring Investment Portfolio Real Options Analysis Game Theory International Business Team Leadership Organizational Culture Employee Training Financial Reporting Corporate Finance Decision Analysis Financial Accounting Management Accounting See 1+     See less Mergers & Acquisitions Strategic Financial... Government Contract... Professional Mentoring Investment Portfolio Real Options Analysis Game Theory International Business Team Leadership Organizational Culture Employee Training Financial Reporting Corporate Finance Decision Analysis Financial Accounting Management Accounting See 1+     See less Mergers & Acquisitions Strategic Financial... Government Contract... Professional Mentoring Investment Portfolio Real Options Analysis Game Theory International Business Team Leadership Organizational Culture Employee Training Financial Reporting Corporate Finance Decision Analysis Financial Accounting Management Accounting See 1+     See less Education Arizona State University, W. P. Carey School of Business Bachelor's Degree,  Finance , General , 4.0 2003  – 2007 Arizona State University, W. P. Carey School of Business Bachelor's Degree,  Finance , General , 4.0 2003  – 2007 Arizona State University, W. P. Carey School of Business Bachelor's Degree,  Finance , General , 4.0 2003  – 2007 Arizona State University, W. P. Carey School of Business Bachelor's Degree,  Finance , General , 4.0 2003  – 2007 ", "Skills Corporate Finance Financial Modeling Financial Forecasting Forecasting Financial Analysis Cross-functional Team... Business Process... Managerial Finance Sarbanes-Oxley Act Strategy Management Analysis Variance Analysis Business Strategy Pricing Internal Controls Leadership Accounting See 3+     See less Skills  Corporate Finance Financial Modeling Financial Forecasting Forecasting Financial Analysis Cross-functional Team... Business Process... Managerial Finance Sarbanes-Oxley Act Strategy Management Analysis Variance Analysis Business Strategy Pricing Internal Controls Leadership Accounting See 3+     See less Corporate Finance Financial Modeling Financial Forecasting Forecasting Financial Analysis Cross-functional Team... Business Process... Managerial Finance Sarbanes-Oxley Act Strategy Management Analysis Variance Analysis Business Strategy Pricing Internal Controls Leadership Accounting See 3+     See less Corporate Finance Financial Modeling Financial Forecasting Forecasting Financial Analysis Cross-functional Team... Business Process... Managerial Finance Sarbanes-Oxley Act Strategy Management Analysis Variance Analysis Business Strategy Pricing Internal Controls Leadership Accounting See 3+     See less ", "Skills Strategy Program Management Finance Intel Manufacturing Internal Controls Procurement Sarbanes-Oxley Act Forecasting Financial Analysis Semiconductors Business Process... Budgets Cross-functional Team... Competitive Analysis Business Strategy Accounting Financial Modeling Data Analysis Analysis Strategic Planning Purchasing Management Integration Process Improvement See 10+     See less Skills  Strategy Program Management Finance Intel Manufacturing Internal Controls Procurement Sarbanes-Oxley Act Forecasting Financial Analysis Semiconductors Business Process... Budgets Cross-functional Team... Competitive Analysis Business Strategy Accounting Financial Modeling Data Analysis Analysis Strategic Planning Purchasing Management Integration Process Improvement See 10+     See less Strategy Program Management Finance Intel Manufacturing Internal Controls Procurement Sarbanes-Oxley Act Forecasting Financial Analysis Semiconductors Business Process... Budgets Cross-functional Team... Competitive Analysis Business Strategy Accounting Financial Modeling Data Analysis Analysis Strategic Planning Purchasing Management Integration Process Improvement See 10+     See less Strategy Program Management Finance Intel Manufacturing Internal Controls Procurement Sarbanes-Oxley Act Forecasting Financial Analysis Semiconductors Business Process... Budgets Cross-functional Team... Competitive Analysis Business Strategy Accounting Financial Modeling Data Analysis Analysis Strategic Planning Purchasing Management Integration Process Improvement See 10+     See less ", "Summary 1996 - Current: Intel Corporation \n2013 - Current: Director of Finance, Malaysia \n2010 - 2013: Malaysia Operations Finance Controller \n2007 - 2010: Asia Finance Controller - Construction \n2003 - 2007: Malaysia Operations Finance Controller \n2001 - 2003: Asia Internal Audit Manager - Singapore \n2000 - 2001: Philippines Operations Finance Controller \n1996 - 2000: Mfg Capital Equipment Mgr & Product Financial Analyst - Arizona, USA \n1994 - 1996: American Airlines Network Engineering Financial Analyst - Texas, USA \n1993 - 1994: Internal Revenue Service Budget Analyst - Kentucky, USA Summary 1996 - Current: Intel Corporation \n2013 - Current: Director of Finance, Malaysia \n2010 - 2013: Malaysia Operations Finance Controller \n2007 - 2010: Asia Finance Controller - Construction \n2003 - 2007: Malaysia Operations Finance Controller \n2001 - 2003: Asia Internal Audit Manager - Singapore \n2000 - 2001: Philippines Operations Finance Controller \n1996 - 2000: Mfg Capital Equipment Mgr & Product Financial Analyst - Arizona, USA \n1994 - 1996: American Airlines Network Engineering Financial Analyst - Texas, USA \n1993 - 1994: Internal Revenue Service Budget Analyst - Kentucky, USA 1996 - Current: Intel Corporation \n2013 - Current: Director of Finance, Malaysia \n2010 - 2013: Malaysia Operations Finance Controller \n2007 - 2010: Asia Finance Controller - Construction \n2003 - 2007: Malaysia Operations Finance Controller \n2001 - 2003: Asia Internal Audit Manager - Singapore \n2000 - 2001: Philippines Operations Finance Controller \n1996 - 2000: Mfg Capital Equipment Mgr & Product Financial Analyst - Arizona, USA \n1994 - 1996: American Airlines Network Engineering Financial Analyst - Texas, USA \n1993 - 1994: Internal Revenue Service Budget Analyst - Kentucky, USA 1996 - Current: Intel Corporation \n2013 - Current: Director of Finance, Malaysia \n2010 - 2013: Malaysia Operations Finance Controller \n2007 - 2010: Asia Finance Controller - Construction \n2003 - 2007: Malaysia Operations Finance Controller \n2001 - 2003: Asia Internal Audit Manager - Singapore \n2000 - 2001: Philippines Operations Finance Controller \n1996 - 2000: Mfg Capital Equipment Mgr & Product Financial Analyst - Arizona, USA \n1994 - 1996: American Airlines Network Engineering Financial Analyst - Texas, USA \n1993 - 1994: Internal Revenue Service Budget Analyst - Kentucky, USA Experience Director of Finance Intel Corporation November 2013  – Present (1 year 10 months) Penang Malaysia Malaysia Operations Finance Controller Intel Corporation November 2010  –  November 2013  (3 years 1 month) Asia Finance Controller - Facility Construction Intel Corporation March 2007  –  November 2010  (3 years 9 months) Malaysia Malaysia Operations Finance Controller Intel Corporation June 2003  –  March 2007  (3 years 10 months) Asia Internal Audit Manager Intel Corporation March 2001  –  June 2003  (2 years 4 months) Singapore Based in Singapore Philippines Operations Finance Controller Intel Corporation 2000  –  2001  (1 year) Philippines Director of Finance Intel Corporation November 2013  – Present (1 year 10 months) Penang Malaysia Director of Finance Intel Corporation November 2013  – Present (1 year 10 months) Penang Malaysia Malaysia Operations Finance Controller Intel Corporation November 2010  –  November 2013  (3 years 1 month) Malaysia Operations Finance Controller Intel Corporation November 2010  –  November 2013  (3 years 1 month) Asia Finance Controller - Facility Construction Intel Corporation March 2007  –  November 2010  (3 years 9 months) Malaysia Asia Finance Controller - Facility Construction Intel Corporation March 2007  –  November 2010  (3 years 9 months) Malaysia Malaysia Operations Finance Controller Intel Corporation June 2003  –  March 2007  (3 years 10 months) Malaysia Operations Finance Controller Intel Corporation June 2003  –  March 2007  (3 years 10 months) Asia Internal Audit Manager Intel Corporation March 2001  –  June 2003  (2 years 4 months) Singapore Based in Singapore Asia Internal Audit Manager Intel Corporation March 2001  –  June 2003  (2 years 4 months) Singapore Based in Singapore Philippines Operations Finance Controller Intel Corporation 2000  –  2001  (1 year) Philippines Philippines Operations Finance Controller Intel Corporation 2000  –  2001  (1 year) Philippines Education Northern Kentucky University Bachelor of Science,  Finance & Economics 1990  – 1994 University of Cincinnati 1990  – 1991 King's College London, U. of London Study Abroad Certificate,  International Finance Northern Kentucky University Bachelor of Science,  Finance & Economics 1990  – 1994 Northern Kentucky University Bachelor of Science,  Finance & Economics 1990  – 1994 Northern Kentucky University Bachelor of Science,  Finance & Economics 1990  – 1994 University of Cincinnati 1990  – 1991 University of Cincinnati 1990  – 1991 University of Cincinnati 1990  – 1991 King's College London, U. of London Study Abroad Certificate,  International Finance King's College London, U. of London Study Abroad Certificate,  International Finance King's College London, U. of London Study Abroad Certificate,  International Finance ", "Experience Malaysia Site Finance Controller Intel Corporation August 2008  – Present (7 years 1 month) Over the past 30 years Intel Malaysia has grown into the largest, most mature manufacturing facility outside of the United States. Intel Malaysia now comprises three campuses and employs more than 8,500 people. Intel Penang is a key assembly and testing site, Intel Kulim assembles processor packaging and is an important operations center for mobile modules, and Intel Kuala Lumpur includes a multimedia super-corridor development center as well as a sales and marketing office. \n \nKnown for its world-class safety standards in the global semiconductor industry, Intel Malaysia is also a two-time winner of the Prime Minister's Quality Award, a symbol of excellence honored to public and private organizations that implement outstanding total-quality management programs and contribute significantly to the country's economy and community. Malaysia itself is a tropical paradise and a true melting pot, a land rich with a great deal of cultural diversity. Business Computing Group - Finance Controller Intel January 2005  –  August 2008  (3 years 8 months) The Business Client Group (BCG) is responsible for directing Intel's vision for delivering innovative business client solutions and for the definition, development, and marketing of Intel's desktop platform solutions. This includes products such as Intel® Core™2 processors with vPro™ technology which are designed to provide increased security and manageability, and deliver energ-efficient performance. Finance Manager - Systems Manufacturing Organization Intel corporation July 2002  –  January 2005  (2 years 7 months) Systems Manufacturing Organization is responsibile for supporting all of Intel's non silicon related outsourced manufacturing and material procurement needs. The organization operates world wide within over 12 different countries and utilizes a network of external ODM's of 15 and an external materials supplier base of over 15,000 suppliers. The SMO organization supports all of Intel's boards and systems manufacturing requirements ranging from servers to desktop to LADs and NIC cards. Intel Capital - Mergers and Acquisitions Intel Corporation January 1998  –  July 2002  (4 years 7 months) Intel Capital seeks out and invests in promising technology companies worldwide. Our goals are to spur innovation and inspire entrepreneurial spirit, while generating positive financial return. We focus on both established and new technologies that help to develop industry solutions, drive global Internet growth, facilitate new usage models, and advance computing and communications platforms. At Intel Capital, we provide unrivaled access to the latest technology developments in the industry. Malaysia Site Finance Controller Intel Corporation August 2008  – Present (7 years 1 month) Over the past 30 years Intel Malaysia has grown into the largest, most mature manufacturing facility outside of the United States. Intel Malaysia now comprises three campuses and employs more than 8,500 people. Intel Penang is a key assembly and testing site, Intel Kulim assembles processor packaging and is an important operations center for mobile modules, and Intel Kuala Lumpur includes a multimedia super-corridor development center as well as a sales and marketing office. \n \nKnown for its world-class safety standards in the global semiconductor industry, Intel Malaysia is also a two-time winner of the Prime Minister's Quality Award, a symbol of excellence honored to public and private organizations that implement outstanding total-quality management programs and contribute significantly to the country's economy and community. Malaysia itself is a tropical paradise and a true melting pot, a land rich with a great deal of cultural diversity. Malaysia Site Finance Controller Intel Corporation August 2008  – Present (7 years 1 month) Over the past 30 years Intel Malaysia has grown into the largest, most mature manufacturing facility outside of the United States. Intel Malaysia now comprises three campuses and employs more than 8,500 people. Intel Penang is a key assembly and testing site, Intel Kulim assembles processor packaging and is an important operations center for mobile modules, and Intel Kuala Lumpur includes a multimedia super-corridor development center as well as a sales and marketing office. \n \nKnown for its world-class safety standards in the global semiconductor industry, Intel Malaysia is also a two-time winner of the Prime Minister's Quality Award, a symbol of excellence honored to public and private organizations that implement outstanding total-quality management programs and contribute significantly to the country's economy and community. Malaysia itself is a tropical paradise and a true melting pot, a land rich with a great deal of cultural diversity. Business Computing Group - Finance Controller Intel January 2005  –  August 2008  (3 years 8 months) The Business Client Group (BCG) is responsible for directing Intel's vision for delivering innovative business client solutions and for the definition, development, and marketing of Intel's desktop platform solutions. This includes products such as Intel® Core™2 processors with vPro™ technology which are designed to provide increased security and manageability, and deliver energ-efficient performance. Business Computing Group - Finance Controller Intel January 2005  –  August 2008  (3 years 8 months) The Business Client Group (BCG) is responsible for directing Intel's vision for delivering innovative business client solutions and for the definition, development, and marketing of Intel's desktop platform solutions. This includes products such as Intel® Core™2 processors with vPro™ technology which are designed to provide increased security and manageability, and deliver energ-efficient performance. Finance Manager - Systems Manufacturing Organization Intel corporation July 2002  –  January 2005  (2 years 7 months) Systems Manufacturing Organization is responsibile for supporting all of Intel's non silicon related outsourced manufacturing and material procurement needs. The organization operates world wide within over 12 different countries and utilizes a network of external ODM's of 15 and an external materials supplier base of over 15,000 suppliers. The SMO organization supports all of Intel's boards and systems manufacturing requirements ranging from servers to desktop to LADs and NIC cards. Finance Manager - Systems Manufacturing Organization Intel corporation July 2002  –  January 2005  (2 years 7 months) Systems Manufacturing Organization is responsibile for supporting all of Intel's non silicon related outsourced manufacturing and material procurement needs. The organization operates world wide within over 12 different countries and utilizes a network of external ODM's of 15 and an external materials supplier base of over 15,000 suppliers. The SMO organization supports all of Intel's boards and systems manufacturing requirements ranging from servers to desktop to LADs and NIC cards. Intel Capital - Mergers and Acquisitions Intel Corporation January 1998  –  July 2002  (4 years 7 months) Intel Capital seeks out and invests in promising technology companies worldwide. Our goals are to spur innovation and inspire entrepreneurial spirit, while generating positive financial return. We focus on both established and new technologies that help to develop industry solutions, drive global Internet growth, facilitate new usage models, and advance computing and communications platforms. At Intel Capital, we provide unrivaled access to the latest technology developments in the industry. Intel Capital - Mergers and Acquisitions Intel Corporation January 1998  –  July 2002  (4 years 7 months) Intel Capital seeks out and invests in promising technology companies worldwide. Our goals are to spur innovation and inspire entrepreneurial spirit, while generating positive financial return. We focus on both established and new technologies that help to develop industry solutions, drive global Internet growth, facilitate new usage models, and advance computing and communications platforms. At Intel Capital, we provide unrivaled access to the latest technology developments in the industry. Skills Mergers & Acquisitions Entrepreneurship Financial Modeling Program Management Testing Cross-functional Team... Manufacturing Management Financial Analysis Semiconductor Industry Procurement Outsourcing Skills  Mergers & Acquisitions Entrepreneurship Financial Modeling Program Management Testing Cross-functional Team... Manufacturing Management Financial Analysis Semiconductor Industry Procurement Outsourcing Mergers & Acquisitions Entrepreneurship Financial Modeling Program Management Testing Cross-functional Team... Manufacturing Management Financial Analysis Semiconductor Industry Procurement Outsourcing Mergers & Acquisitions Entrepreneurship Financial Modeling Program Management Testing Cross-functional Team... Manufacturing Management Financial Analysis Semiconductor Industry Procurement Outsourcing Education Purdue University - Krannert School of Management MSM (MBA),  Finance , Strategy 1996  – 1998 Activities and Societies:  Student Managed Investment Fund (founder) ,  Internatioanl Finance Society ,  Finance Club ,  Purdue Boilermaker Social Club San Diego State University-California State University BA,  Business Management / International Management 1988  – 1993 Purdue University - Krannert School of Management MSM (MBA),  Finance , Strategy 1996  – 1998 Activities and Societies:  Student Managed Investment Fund (founder) ,  Internatioanl Finance Society ,  Finance Club ,  Purdue Boilermaker Social Club Purdue University - Krannert School of Management MSM (MBA),  Finance , Strategy 1996  – 1998 Activities and Societies:  Student Managed Investment Fund (founder) ,  Internatioanl Finance Society ,  Finance Club ,  Purdue Boilermaker Social Club Purdue University - Krannert School of Management MSM (MBA),  Finance , Strategy 1996  – 1998 Activities and Societies:  Student Managed Investment Fund (founder) ,  Internatioanl Finance Society ,  Finance Club ,  Purdue Boilermaker Social Club San Diego State University-California State University BA,  Business Management / International Management 1988  – 1993 San Diego State University-California State University BA,  Business Management / International Management 1988  – 1993 San Diego State University-California State University BA,  Business Management / International Management 1988  – 1993 ", "Skills Forecasting Cross-functional Team... Sarbanes-Oxley Act Process Improvement Business Strategy Management Competitive Analysis Finance Budgets Marketing Start-ups Mergers & Acquisitions Internal Controls Mergers Negotiation Latin America Product Management Purchasing Project Planning Business Planning Strategy Analysis See 7+     See less Skills  Forecasting Cross-functional Team... Sarbanes-Oxley Act Process Improvement Business Strategy Management Competitive Analysis Finance Budgets Marketing Start-ups Mergers & Acquisitions Internal Controls Mergers Negotiation Latin America Product Management Purchasing Project Planning Business Planning Strategy Analysis See 7+     See less Forecasting Cross-functional Team... Sarbanes-Oxley Act Process Improvement Business Strategy Management Competitive Analysis Finance Budgets Marketing Start-ups Mergers & Acquisitions Internal Controls Mergers Negotiation Latin America Product Management Purchasing Project Planning Business Planning Strategy Analysis See 7+     See less Forecasting Cross-functional Team... Sarbanes-Oxley Act Process Improvement Business Strategy Management Competitive Analysis Finance Budgets Marketing Start-ups Mergers & Acquisitions Internal Controls Mergers Negotiation Latin America Product Management Purchasing Project Planning Business Planning Strategy Analysis See 7+     See less ", "Experience Finance Controller Intel Corporation 2013  – Present (2 years) Corporate Services, Asia / Assembly Test Manufacturing Operations Industrial Engineering Manager Intel Malaysia 2003  –  2011  (8 years) Site Purchasing Manager, Asia Regional Commodity Manager Intel Malaysia 2000  –  2003  (3 years) Shift Manager, Manufacturing Intel Malaysia 1998  –  2000  (2 years) Finance Controller Intel Corporation 2013  – Present (2 years) Corporate Services, Asia / Assembly Test Manufacturing Operations Finance Controller Intel Corporation 2013  – Present (2 years) Corporate Services, Asia / Assembly Test Manufacturing Operations Industrial Engineering Manager Intel Malaysia 2003  –  2011  (8 years) Industrial Engineering Manager Intel Malaysia 2003  –  2011  (8 years) Site Purchasing Manager, Asia Regional Commodity Manager Intel Malaysia 2000  –  2003  (3 years) Site Purchasing Manager, Asia Regional Commodity Manager Intel Malaysia 2000  –  2003  (3 years) Shift Manager, Manufacturing Intel Malaysia 1998  –  2000  (2 years) Shift Manager, Manufacturing Intel Malaysia 1998  –  2000  (2 years) Skills Cross-functional Team... Financial Modeling Financial Analysis Semiconductors Process Improvement Financial Reporting Managerial Finance Finance Strategic Financial... Competitive Analysis Financial Forecasting Internal Controls Skills  Cross-functional Team... Financial Modeling Financial Analysis Semiconductors Process Improvement Financial Reporting Managerial Finance Finance Strategic Financial... Competitive Analysis Financial Forecasting Internal Controls Cross-functional Team... Financial Modeling Financial Analysis Semiconductors Process Improvement Financial Reporting Managerial Finance Finance Strategic Financial... Competitive Analysis Financial Forecasting Internal Controls Cross-functional Team... Financial Modeling Financial Analysis Semiconductors Process Improvement Financial Reporting Managerial Finance Finance Strategic Financial... Competitive Analysis Financial Forecasting Internal Controls Education Heriot-Watt University MBA University Science Malaysia (USM) Chemistry Heriot-Watt University MBA Heriot-Watt University MBA Heriot-Watt University MBA University Science Malaysia (USM) Chemistry University Science Malaysia (USM) Chemistry University Science Malaysia (USM) Chemistry ", "Summary Ambitious and results driven finance professional with proven track record of product roadmap optimization, P&L management, supply chain efficiency, reporting and controls in a multi-billion dollar high tech company.  \nDemonstrated ability to drive efficiency and bottom line improvement through leadership, strategic influence, superior business partnership, and strong analytics. \n \nSpecialties:  \n- Product roadmap optimization \n- P&L Management \n- Pricing \n- Strategic planning and influencing \n- Cost reduction and Inventory valuation improvements \n- Budgets, reporting and controls \n- Supply chain optimization \n- Financial modeling \n- Competitive analysis Summary Ambitious and results driven finance professional with proven track record of product roadmap optimization, P&L management, supply chain efficiency, reporting and controls in a multi-billion dollar high tech company.  \nDemonstrated ability to drive efficiency and bottom line improvement through leadership, strategic influence, superior business partnership, and strong analytics. \n \nSpecialties:  \n- Product roadmap optimization \n- P&L Management \n- Pricing \n- Strategic planning and influencing \n- Cost reduction and Inventory valuation improvements \n- Budgets, reporting and controls \n- Supply chain optimization \n- Financial modeling \n- Competitive analysis Ambitious and results driven finance professional with proven track record of product roadmap optimization, P&L management, supply chain efficiency, reporting and controls in a multi-billion dollar high tech company.  \nDemonstrated ability to drive efficiency and bottom line improvement through leadership, strategic influence, superior business partnership, and strong analytics. \n \nSpecialties:  \n- Product roadmap optimization \n- P&L Management \n- Pricing \n- Strategic planning and influencing \n- Cost reduction and Inventory valuation improvements \n- Budgets, reporting and controls \n- Supply chain optimization \n- Financial modeling \n- Competitive analysis Ambitious and results driven finance professional with proven track record of product roadmap optimization, P&L management, supply chain efficiency, reporting and controls in a multi-billion dollar high tech company.  \nDemonstrated ability to drive efficiency and bottom line improvement through leadership, strategic influence, superior business partnership, and strong analytics. \n \nSpecialties:  \n- Product roadmap optimization \n- P&L Management \n- Pricing \n- Strategic planning and influencing \n- Cost reduction and Inventory valuation improvements \n- Budgets, reporting and controls \n- Supply chain optimization \n- Financial modeling \n- Competitive analysis Experience Finance Controller Intel Corporation September 2014  – Present (1 year) Folsom Division Finance Controller P&L Finance Manager Intel Corporation February 2013  – Present (2 years 7 months) Folsom, CA Responsible for accurately reporting & forecasting the client chipset and multiple segment P&Ls.  \n \nPartnered and influenced across multiple highly matrixed organizations to increase profitability for the division in 2 year time horizon. \n \nManaged a team of senior finance analysts, coached them to develop and grow their professional careers. Strategic Finance Specialist Intel Corporation May 2011  –  February 2013  (1 year 10 months) Folsom, CA Finance lead on Intel’s client Graphics roadmap and Strategy with the primary goal of driving max ROI processor graphics IP. Director Faridi Enterprises September 2007  –  May 2011  (3 years 9 months) Full operational and financial control of mixed use real estate development company. Finance Specialist (Finance Lead) Intel Corporation September 2005  –  September 2007  (2 years 1 month) Provided finance analysis and decision support for Americas Sales and Marketing Organization.  \n \nPlayed a significant role in driving critical pricing deals and supply chain efficiency programs with key Intel customers. Sr. Strategic Finance Analyst Intel Corporation January 2004  –  September 2005  (1 year 9 months) Provided Long Range Planning and Roadmap analysis support for Intel's Chipset Group. \n \nDrove Roadmap analysis, cost reduction activities, cost targets, and supported Corporate strategic discussions.  \n \nDeveloped Chipset Group P&L, owned and improved the ROI, ROIC, and EVA models. Sr. Finance Analyst Intel Corporation April 2002  –  January 2004  (1 year 10 months) Provided Cost and Inventory financial analysis support for Flash Product Group. \n \nDeveloped Group P&L, provided product cost analysis, capacity analysis, trade off analysis, and drove inventory valuation improvements and compliance. Finance Analyst Intel Corporation June 2000  –  April 2002  (1 year 11 months) Finance planning and analysis support for IT division.  \n \nResponsible for quarterly and yearly budgets, planning and controls. Finance Controller Intel Corporation September 2014  – Present (1 year) Folsom Division Finance Controller Finance Controller Intel Corporation September 2014  – Present (1 year) Folsom Division Finance Controller P&L Finance Manager Intel Corporation February 2013  – Present (2 years 7 months) Folsom, CA Responsible for accurately reporting & forecasting the client chipset and multiple segment P&Ls.  \n \nPartnered and influenced across multiple highly matrixed organizations to increase profitability for the division in 2 year time horizon. \n \nManaged a team of senior finance analysts, coached them to develop and grow their professional careers. P&L Finance Manager Intel Corporation February 2013  – Present (2 years 7 months) Folsom, CA Responsible for accurately reporting & forecasting the client chipset and multiple segment P&Ls.  \n \nPartnered and influenced across multiple highly matrixed organizations to increase profitability for the division in 2 year time horizon. \n \nManaged a team of senior finance analysts, coached them to develop and grow their professional careers. Strategic Finance Specialist Intel Corporation May 2011  –  February 2013  (1 year 10 months) Folsom, CA Finance lead on Intel’s client Graphics roadmap and Strategy with the primary goal of driving max ROI processor graphics IP. Strategic Finance Specialist Intel Corporation May 2011  –  February 2013  (1 year 10 months) Folsom, CA Finance lead on Intel’s client Graphics roadmap and Strategy with the primary goal of driving max ROI processor graphics IP. Director Faridi Enterprises September 2007  –  May 2011  (3 years 9 months) Full operational and financial control of mixed use real estate development company. Director Faridi Enterprises September 2007  –  May 2011  (3 years 9 months) Full operational and financial control of mixed use real estate development company. Finance Specialist (Finance Lead) Intel Corporation September 2005  –  September 2007  (2 years 1 month) Provided finance analysis and decision support for Americas Sales and Marketing Organization.  \n \nPlayed a significant role in driving critical pricing deals and supply chain efficiency programs with key Intel customers. Finance Specialist (Finance Lead) Intel Corporation September 2005  –  September 2007  (2 years 1 month) Provided finance analysis and decision support for Americas Sales and Marketing Organization.  \n \nPlayed a significant role in driving critical pricing deals and supply chain efficiency programs with key Intel customers. Sr. Strategic Finance Analyst Intel Corporation January 2004  –  September 2005  (1 year 9 months) Provided Long Range Planning and Roadmap analysis support for Intel's Chipset Group. \n \nDrove Roadmap analysis, cost reduction activities, cost targets, and supported Corporate strategic discussions.  \n \nDeveloped Chipset Group P&L, owned and improved the ROI, ROIC, and EVA models. Sr. Strategic Finance Analyst Intel Corporation January 2004  –  September 2005  (1 year 9 months) Provided Long Range Planning and Roadmap analysis support for Intel's Chipset Group. \n \nDrove Roadmap analysis, cost reduction activities, cost targets, and supported Corporate strategic discussions.  \n \nDeveloped Chipset Group P&L, owned and improved the ROI, ROIC, and EVA models. Sr. Finance Analyst Intel Corporation April 2002  –  January 2004  (1 year 10 months) Provided Cost and Inventory financial analysis support for Flash Product Group. \n \nDeveloped Group P&L, provided product cost analysis, capacity analysis, trade off analysis, and drove inventory valuation improvements and compliance. Sr. Finance Analyst Intel Corporation April 2002  –  January 2004  (1 year 10 months) Provided Cost and Inventory financial analysis support for Flash Product Group. \n \nDeveloped Group P&L, provided product cost analysis, capacity analysis, trade off analysis, and drove inventory valuation improvements and compliance. Finance Analyst Intel Corporation June 2000  –  April 2002  (1 year 11 months) Finance planning and analysis support for IT division.  \n \nResponsible for quarterly and yearly budgets, planning and controls. Finance Analyst Intel Corporation June 2000  –  April 2002  (1 year 11 months) Finance planning and analysis support for IT division.  \n \nResponsible for quarterly and yearly budgets, planning and controls. Skills Forecasting Financial Analysis Cross-functional Team... Competitive Analysis Financial Modeling Management Process Improvement Strategy Finance Skills  Forecasting Financial Analysis Cross-functional Team... Competitive Analysis Financial Modeling Management Process Improvement Strategy Finance Forecasting Financial Analysis Cross-functional Team... Competitive Analysis Financial Modeling Management Process Improvement Strategy Finance Forecasting Financial Analysis Cross-functional Team... Competitive Analysis Financial Modeling Management Process Improvement Strategy Finance Education University of California, Davis - Graduate School of Management MBA,  Finance 2004  – 2006 California State University-Sacramento Bachelors,  Business Administration (Finance) 1996  – 2000 Activities and Societies:  Finance Society ,  Investment Society ,  Theta Chi University of California, Davis - Graduate School of Management MBA,  Finance 2004  – 2006 University of California, Davis - Graduate School of Management MBA,  Finance 2004  – 2006 University of California, Davis - Graduate School of Management MBA,  Finance 2004  – 2006 California State University-Sacramento Bachelors,  Business Administration (Finance) 1996  – 2000 Activities and Societies:  Finance Society ,  Investment Society ,  Theta Chi California State University-Sacramento Bachelors,  Business Administration (Finance) 1996  – 2000 Activities and Societies:  Finance Society ,  Investment Society ,  Theta Chi California State University-Sacramento Bachelors,  Business Administration (Finance) 1996  – 2000 Activities and Societies:  Finance Society ,  Investment Society ,  Theta Chi ", "Experience Senior Director of Finance Microsoft July 2014  – Present (1 year 2 months) Espoo, Finland On assignment in Finland to work on the integration of the acquired Phones business. Manage a team of > 30 reports, responsible for the corporate close and reporting for the consolidated phones business (ex Nokia). Also focused on broader finance integration activities. Senior Director of Finance Microsoft October 2007  –  June 2014  (6 years 9 months) Redmond, WA Managing a team of ~40 finance professional, I have responsibility for overall Hardware/Devices COGS controllership and P&L reporting at Microsoft. Supporting the Manufacturing and Supply Chain organization at Microsoft, other areas of focus include policy & controls leadership across the hardware business & SAP/system finance design and implementation. Prior responsibilities included Xbox Hardware R&D FP&A Business support, Supply Chain FP&A finance leadership & XBox P&L reporting/controllership.Expertise & skills include - cost accounting, manufacturing & supply chain FP&A, warranty & returns, policy and controls design/implementation, investment appraisal, M&A activity, commercial deal support, all aspects of financial planning & analysis, decision support, capital/asset management & accounting. Finance Controller Intel Corporation July 2005  –  October 2007  (2 years 4 months) Systems Materials Controller - all financial responsbility for the cost & sourcing/procurement side of the systems and motherboard business at Intel. Scope ~$2bn annually. Managed a team of ~10. Finance Controller Intel Corporation February 2003  –  July 2005  (2 years 6 months) Corporate Fixed Asset Accounting Controller - responsible for company wide fixed asset accounting (scope $50bn+ gross balance sheet value), including controls, SOX, all accounting policy, asset management & control procedures. Managed a team of 20+ directs plus a 10+ global virtual team. Senior Finance Manager Intel Corporation September 2000  –  February 2003  (2 years 6 months) Primary roles included - European Accounting Manager - responsible for a team of 20, and all accounting, corporate and statutory reporting for European subisidaries. Prior, was SAP EMEA Implementation - responsible for the business implementation of SAP GL & reporting systems across all European finance teams. Prior, worked on M&A integration in Europe. \nPrior to 2000, experience included Internal Audit. Senior Director of Finance Microsoft July 2014  – Present (1 year 2 months) Espoo, Finland On assignment in Finland to work on the integration of the acquired Phones business. Manage a team of > 30 reports, responsible for the corporate close and reporting for the consolidated phones business (ex Nokia). Also focused on broader finance integration activities. Senior Director of Finance Microsoft July 2014  – Present (1 year 2 months) Espoo, Finland On assignment in Finland to work on the integration of the acquired Phones business. Manage a team of > 30 reports, responsible for the corporate close and reporting for the consolidated phones business (ex Nokia). Also focused on broader finance integration activities. Senior Director of Finance Microsoft October 2007  –  June 2014  (6 years 9 months) Redmond, WA Managing a team of ~40 finance professional, I have responsibility for overall Hardware/Devices COGS controllership and P&L reporting at Microsoft. Supporting the Manufacturing and Supply Chain organization at Microsoft, other areas of focus include policy & controls leadership across the hardware business & SAP/system finance design and implementation. Prior responsibilities included Xbox Hardware R&D FP&A Business support, Supply Chain FP&A finance leadership & XBox P&L reporting/controllership.Expertise & skills include - cost accounting, manufacturing & supply chain FP&A, warranty & returns, policy and controls design/implementation, investment appraisal, M&A activity, commercial deal support, all aspects of financial planning & analysis, decision support, capital/asset management & accounting. Senior Director of Finance Microsoft October 2007  –  June 2014  (6 years 9 months) Redmond, WA Managing a team of ~40 finance professional, I have responsibility for overall Hardware/Devices COGS controllership and P&L reporting at Microsoft. Supporting the Manufacturing and Supply Chain organization at Microsoft, other areas of focus include policy & controls leadership across the hardware business & SAP/system finance design and implementation. Prior responsibilities included Xbox Hardware R&D FP&A Business support, Supply Chain FP&A finance leadership & XBox P&L reporting/controllership.Expertise & skills include - cost accounting, manufacturing & supply chain FP&A, warranty & returns, policy and controls design/implementation, investment appraisal, M&A activity, commercial deal support, all aspects of financial planning & analysis, decision support, capital/asset management & accounting. Finance Controller Intel Corporation July 2005  –  October 2007  (2 years 4 months) Systems Materials Controller - all financial responsbility for the cost & sourcing/procurement side of the systems and motherboard business at Intel. Scope ~$2bn annually. Managed a team of ~10. Finance Controller Intel Corporation July 2005  –  October 2007  (2 years 4 months) Systems Materials Controller - all financial responsbility for the cost & sourcing/procurement side of the systems and motherboard business at Intel. Scope ~$2bn annually. Managed a team of ~10. Finance Controller Intel Corporation February 2003  –  July 2005  (2 years 6 months) Corporate Fixed Asset Accounting Controller - responsible for company wide fixed asset accounting (scope $50bn+ gross balance sheet value), including controls, SOX, all accounting policy, asset management & control procedures. Managed a team of 20+ directs plus a 10+ global virtual team. Finance Controller Intel Corporation February 2003  –  July 2005  (2 years 6 months) Corporate Fixed Asset Accounting Controller - responsible for company wide fixed asset accounting (scope $50bn+ gross balance sheet value), including controls, SOX, all accounting policy, asset management & control procedures. Managed a team of 20+ directs plus a 10+ global virtual team. Senior Finance Manager Intel Corporation September 2000  –  February 2003  (2 years 6 months) Primary roles included - European Accounting Manager - responsible for a team of 20, and all accounting, corporate and statutory reporting for European subisidaries. Prior, was SAP EMEA Implementation - responsible for the business implementation of SAP GL & reporting systems across all European finance teams. Prior, worked on M&A integration in Europe. \nPrior to 2000, experience included Internal Audit. Senior Finance Manager Intel Corporation September 2000  –  February 2003  (2 years 6 months) Primary roles included - European Accounting Manager - responsible for a team of 20, and all accounting, corporate and statutory reporting for European subisidaries. Prior, was SAP EMEA Implementation - responsible for the business implementation of SAP GL & reporting systems across all European finance teams. Prior, worked on M&A integration in Europe. \nPrior to 2000, experience included Internal Audit. Skills Sarbanes-Oxley Act Internal Controls SAP Managerial Finance Mergers Financial Analysis Financial Reporting Finance Financial Accounting Strategic Financial... Cost Accounting Cost Management Cost Control Cost Reporting Skills  Sarbanes-Oxley Act Internal Controls SAP Managerial Finance Mergers Financial Analysis Financial Reporting Finance Financial Accounting Strategic Financial... Cost Accounting Cost Management Cost Control Cost Reporting Sarbanes-Oxley Act Internal Controls SAP Managerial Finance Mergers Financial Analysis Financial Reporting Finance Financial Accounting Strategic Financial... Cost Accounting Cost Management Cost Control Cost Reporting Sarbanes-Oxley Act Internal Controls SAP Managerial Finance Mergers Financial Analysis Financial Reporting Finance Financial Accounting Strategic Financial... Cost Accounting Cost Management Cost Control Cost Reporting Education Institute of Chartered Accountants in England and Wales ACA,  Accounting Associate Chartered Institue of Banking (UK) ACIB Lancaster University BA (Hons),  Economics Institute of Chartered Accountants in England and Wales ACA,  Accounting Institute of Chartered Accountants in England and Wales ACA,  Accounting Institute of Chartered Accountants in England and Wales ACA,  Accounting Associate Chartered Institue of Banking (UK) ACIB Associate Chartered Institue of Banking (UK) ACIB Associate Chartered Institue of Banking (UK) ACIB Lancaster University BA (Hons),  Economics Lancaster University BA (Hons),  Economics Lancaster University BA (Hons),  Economics ", "Experience Finance Controller Intel Corporation March 2000  – Present (15 years 6 months) Finance Manager Ford Motor Company October 1995  –  March 2000  (4 years 6 months) Dearborn, MI Lieutenant Commander US Navy May 1984  –  September 1995  (11 years 5 months) Finance Controller Intel Corporation March 2000  – Present (15 years 6 months) Finance Controller Intel Corporation March 2000  – Present (15 years 6 months) Finance Manager Ford Motor Company October 1995  –  March 2000  (4 years 6 months) Dearborn, MI Finance Manager Ford Motor Company October 1995  –  March 2000  (4 years 6 months) Dearborn, MI Lieutenant Commander US Navy May 1984  –  September 1995  (11 years 5 months) Lieutenant Commander US Navy May 1984  –  September 1995  (11 years 5 months) Skills Finance Program Management Management Skills  Finance Program Management Management Finance Program Management Management Finance Program Management Management Education University of Detroit Mercy Master of Business Administration (MBA) 1996  – 1999 University of Notre Dame Bachelor of Science (BS),  Electrical and Electronics Engineering 1980  – 1984 University of Detroit Mercy Master of Business Administration (MBA) 1996  – 1999 University of Detroit Mercy Master of Business Administration (MBA) 1996  – 1999 University of Detroit Mercy Master of Business Administration (MBA) 1996  – 1999 University of Notre Dame Bachelor of Science (BS),  Electrical and Electronics Engineering 1980  – 1984 University of Notre Dame Bachelor of Science (BS),  Electrical and Electronics Engineering 1980  – 1984 University of Notre Dame Bachelor of Science (BS),  Electrical and Electronics Engineering 1980  – 1984 ", "Summary Over 15 years of experience in financial and business management functions of various groups across Intel. Responsible for planning and managing group financials as well as providing analytical decision support for technology roadmap and strategic investment portfolios. Influenced several initiatives related to operational excellence and execution, competitive intelligence, globalization strategy, supply chain management, and market segmentation. Additionally, drove significant external focus about impact of Information Technology on various sectors by engaging with customers in several countries and developing patented models to measure financial and economic impact of IT. Recognized for strategic thinking, risk taking, and change management. \n \nPrior to Intel, 10 years of diversified project management and business development experience with petrochemical and engineering consulting firms. Responsibilities included developing feasibility studies, decision tree analyses, operational planning, and financial justification for multi-million dollar projects. Managed projects from conceptual phase through completion in accordance with engineering codes and regulations through management of personnel, vendors, and engineering contractors. \n \nSpecialties: \n- Investment Portfolio and P&L Management \n- Product Roadmap and Market Segmentation \n- Strategic Long Range Planning \n- Competitive Intelligence Tools \n- Globalization Strategy \n- M&A Integration, Due Diligence \n- General Management and Mentoring Summary Over 15 years of experience in financial and business management functions of various groups across Intel. Responsible for planning and managing group financials as well as providing analytical decision support for technology roadmap and strategic investment portfolios. Influenced several initiatives related to operational excellence and execution, competitive intelligence, globalization strategy, supply chain management, and market segmentation. Additionally, drove significant external focus about impact of Information Technology on various sectors by engaging with customers in several countries and developing patented models to measure financial and economic impact of IT. Recognized for strategic thinking, risk taking, and change management. \n \nPrior to Intel, 10 years of diversified project management and business development experience with petrochemical and engineering consulting firms. Responsibilities included developing feasibility studies, decision tree analyses, operational planning, and financial justification for multi-million dollar projects. Managed projects from conceptual phase through completion in accordance with engineering codes and regulations through management of personnel, vendors, and engineering contractors. \n \nSpecialties: \n- Investment Portfolio and P&L Management \n- Product Roadmap and Market Segmentation \n- Strategic Long Range Planning \n- Competitive Intelligence Tools \n- Globalization Strategy \n- M&A Integration, Due Diligence \n- General Management and Mentoring Over 15 years of experience in financial and business management functions of various groups across Intel. Responsible for planning and managing group financials as well as providing analytical decision support for technology roadmap and strategic investment portfolios. Influenced several initiatives related to operational excellence and execution, competitive intelligence, globalization strategy, supply chain management, and market segmentation. Additionally, drove significant external focus about impact of Information Technology on various sectors by engaging with customers in several countries and developing patented models to measure financial and economic impact of IT. Recognized for strategic thinking, risk taking, and change management. \n \nPrior to Intel, 10 years of diversified project management and business development experience with petrochemical and engineering consulting firms. Responsibilities included developing feasibility studies, decision tree analyses, operational planning, and financial justification for multi-million dollar projects. Managed projects from conceptual phase through completion in accordance with engineering codes and regulations through management of personnel, vendors, and engineering contractors. \n \nSpecialties: \n- Investment Portfolio and P&L Management \n- Product Roadmap and Market Segmentation \n- Strategic Long Range Planning \n- Competitive Intelligence Tools \n- Globalization Strategy \n- M&A Integration, Due Diligence \n- General Management and Mentoring Over 15 years of experience in financial and business management functions of various groups across Intel. Responsible for planning and managing group financials as well as providing analytical decision support for technology roadmap and strategic investment portfolios. Influenced several initiatives related to operational excellence and execution, competitive intelligence, globalization strategy, supply chain management, and market segmentation. Additionally, drove significant external focus about impact of Information Technology on various sectors by engaging with customers in several countries and developing patented models to measure financial and economic impact of IT. Recognized for strategic thinking, risk taking, and change management. \n \nPrior to Intel, 10 years of diversified project management and business development experience with petrochemical and engineering consulting firms. Responsibilities included developing feasibility studies, decision tree analyses, operational planning, and financial justification for multi-million dollar projects. Managed projects from conceptual phase through completion in accordance with engineering codes and regulations through management of personnel, vendors, and engineering contractors. \n \nSpecialties: \n- Investment Portfolio and P&L Management \n- Product Roadmap and Market Segmentation \n- Strategic Long Range Planning \n- Competitive Intelligence Tools \n- Globalization Strategy \n- M&A Integration, Due Diligence \n- General Management and Mentoring Experience Mobile Platform Operations Controller Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, CA Mobile Client Platform Group, Intel: \n• Responsible for managing finance organization in support of Intel's $19B notebook business with primary focus on product roadmap, skuing and pricing, and overall P&L management. Partnering with operations for long range planning, market segmentation strategy, and customer portfolio management. Additional focus on driving innovative categories such as 2 in 1s and Ultrabooks for the mobile PC market. Finance Controller Intel Corporation June 2012  –  July 2014  (2 years 2 months) India Intel India Development Center Controller \n• Responsible for building and managing finance organization to support Intel India R&D group with 2,500 employees, $220+M in spending across several business units. Established finance agenda and focus areas in support of Intel strategy in India, ensuring IP controls, and driving strategic options for R&D operation based on tax policies and market trends. Partnered with operations to develop framework and processes to monitor R&D competitive intelligence and ecosystem trends in the region. Drove outsourcing strategy and sweeping actions at corporate level for worldwide supplier consolidation, outcome based contractual agreements, and cost savings. Finance Controller Intel Corporation January 2010  –  May 2012  (2 years 5 months) Folsom, CA Client Chipset Group, Intel: \n• Responsible for managing finance organization and developing a results oriented culture to support the group with 1,200 employees, $230M in R&D delivering $6.5B in annual revenue. Primary focus areas include financial forecasting, planning, monthly and quarterly close, analyses, and reporting. \n• Influenced product competitiveness, R&D efficiency, IP planning, low power capabilities on Intel architecture, and software and services strategy. \n• Established new processes for milestone based funding to effectively manage incubation portfolio of long lead technologies and contractual negotiations for external IP providers. Finance Controller Intel May 2005  –  December 2009  (4 years 8 months) Folsom, CA Digital Health Group (DHeG), Intel: \n• Recruited and built finance organization to establish rapidly growing group’s financial planning and reporting processes, prepare annual operating and capital budgets, and to shape growth strategies for the group with senior VPs. \n• Analyzed worldwide Healthcare IT trends, barriers and opportunities for IT adoption, and impact of Intel products and solutions on various market segments. \n• Played a key role in facilitating corporate strategic discussions, reviews with Board of Directors, and analyzing long range plans leading to successful negotiations and joint venture with GE Healthcare. \n• Engaged with healthcare executives in the US, UK, China, India, and Singapore to develop a white paper and patented financial models on economic impact of Healthcare IT adoption. Strategic Finance Manager Intel 2003  –  April 2005  (2 years) Technology and Manufacturing Group, Intel: \n• Responsible for leading a team of analysts for budget planning, affordability analysis, influencing supplier negotiations, and driving optimal inventory levels of DRAM memory worldwide. Led a cross division finance team to analyze the memory industry trend and influence long term R&D and platform strategy thru supplier negotiations and agreements. Finance Manager Intel July 2002  –  November 2003  (1 year 5 months) Wireless Computing and Communications Group, Intel: \n• Managed a team of strategic analysts and partnered with engineering, marketing, and manufacturing teams to drive affordable product roadmap for application and communication processors delivering $250M in revenue with $200M in annual R&D. \n• Played critical role in business decisions related to feature portfolio, product cost targets, sku based pricing, long range forecasting, and capital affordability. Finance Specialist Intel February 2001  –  July 2002  (1 year 6 months) IT/eBusiness Group, Intel:  \n• Business partner with manufacturing planning and eBusiness applications development groups focused on delivering systems for end to end manufacturing planning and agile decision making. Led a cross functional finance team to influence long term technology and strategy roadmaps as well as off shore staffing and execution plans to ensure success. Mobile Platform Operations Controller Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, CA Mobile Client Platform Group, Intel: \n• Responsible for managing finance organization in support of Intel's $19B notebook business with primary focus on product roadmap, skuing and pricing, and overall P&L management. Partnering with operations for long range planning, market segmentation strategy, and customer portfolio management. Additional focus on driving innovative categories such as 2 in 1s and Ultrabooks for the mobile PC market. Mobile Platform Operations Controller Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, CA Mobile Client Platform Group, Intel: \n• Responsible for managing finance organization in support of Intel's $19B notebook business with primary focus on product roadmap, skuing and pricing, and overall P&L management. Partnering with operations for long range planning, market segmentation strategy, and customer portfolio management. Additional focus on driving innovative categories such as 2 in 1s and Ultrabooks for the mobile PC market. Finance Controller Intel Corporation June 2012  –  July 2014  (2 years 2 months) India Intel India Development Center Controller \n• Responsible for building and managing finance organization to support Intel India R&D group with 2,500 employees, $220+M in spending across several business units. Established finance agenda and focus areas in support of Intel strategy in India, ensuring IP controls, and driving strategic options for R&D operation based on tax policies and market trends. Partnered with operations to develop framework and processes to monitor R&D competitive intelligence and ecosystem trends in the region. Drove outsourcing strategy and sweeping actions at corporate level for worldwide supplier consolidation, outcome based contractual agreements, and cost savings. Finance Controller Intel Corporation June 2012  –  July 2014  (2 years 2 months) India Intel India Development Center Controller \n• Responsible for building and managing finance organization to support Intel India R&D group with 2,500 employees, $220+M in spending across several business units. Established finance agenda and focus areas in support of Intel strategy in India, ensuring IP controls, and driving strategic options for R&D operation based on tax policies and market trends. Partnered with operations to develop framework and processes to monitor R&D competitive intelligence and ecosystem trends in the region. Drove outsourcing strategy and sweeping actions at corporate level for worldwide supplier consolidation, outcome based contractual agreements, and cost savings. Finance Controller Intel Corporation January 2010  –  May 2012  (2 years 5 months) Folsom, CA Client Chipset Group, Intel: \n• Responsible for managing finance organization and developing a results oriented culture to support the group with 1,200 employees, $230M in R&D delivering $6.5B in annual revenue. Primary focus areas include financial forecasting, planning, monthly and quarterly close, analyses, and reporting. \n• Influenced product competitiveness, R&D efficiency, IP planning, low power capabilities on Intel architecture, and software and services strategy. \n• Established new processes for milestone based funding to effectively manage incubation portfolio of long lead technologies and contractual negotiations for external IP providers. Finance Controller Intel Corporation January 2010  –  May 2012  (2 years 5 months) Folsom, CA Client Chipset Group, Intel: \n• Responsible for managing finance organization and developing a results oriented culture to support the group with 1,200 employees, $230M in R&D delivering $6.5B in annual revenue. Primary focus areas include financial forecasting, planning, monthly and quarterly close, analyses, and reporting. \n• Influenced product competitiveness, R&D efficiency, IP planning, low power capabilities on Intel architecture, and software and services strategy. \n• Established new processes for milestone based funding to effectively manage incubation portfolio of long lead technologies and contractual negotiations for external IP providers. Finance Controller Intel May 2005  –  December 2009  (4 years 8 months) Folsom, CA Digital Health Group (DHeG), Intel: \n• Recruited and built finance organization to establish rapidly growing group’s financial planning and reporting processes, prepare annual operating and capital budgets, and to shape growth strategies for the group with senior VPs. \n• Analyzed worldwide Healthcare IT trends, barriers and opportunities for IT adoption, and impact of Intel products and solutions on various market segments. \n• Played a key role in facilitating corporate strategic discussions, reviews with Board of Directors, and analyzing long range plans leading to successful negotiations and joint venture with GE Healthcare. \n• Engaged with healthcare executives in the US, UK, China, India, and Singapore to develop a white paper and patented financial models on economic impact of Healthcare IT adoption. Finance Controller Intel May 2005  –  December 2009  (4 years 8 months) Folsom, CA Digital Health Group (DHeG), Intel: \n• Recruited and built finance organization to establish rapidly growing group’s financial planning and reporting processes, prepare annual operating and capital budgets, and to shape growth strategies for the group with senior VPs. \n• Analyzed worldwide Healthcare IT trends, barriers and opportunities for IT adoption, and impact of Intel products and solutions on various market segments. \n• Played a key role in facilitating corporate strategic discussions, reviews with Board of Directors, and analyzing long range plans leading to successful negotiations and joint venture with GE Healthcare. \n• Engaged with healthcare executives in the US, UK, China, India, and Singapore to develop a white paper and patented financial models on economic impact of Healthcare IT adoption. Strategic Finance Manager Intel 2003  –  April 2005  (2 years) Technology and Manufacturing Group, Intel: \n• Responsible for leading a team of analysts for budget planning, affordability analysis, influencing supplier negotiations, and driving optimal inventory levels of DRAM memory worldwide. Led a cross division finance team to analyze the memory industry trend and influence long term R&D and platform strategy thru supplier negotiations and agreements. Strategic Finance Manager Intel 2003  –  April 2005  (2 years) Technology and Manufacturing Group, Intel: \n• Responsible for leading a team of analysts for budget planning, affordability analysis, influencing supplier negotiations, and driving optimal inventory levels of DRAM memory worldwide. Led a cross division finance team to analyze the memory industry trend and influence long term R&D and platform strategy thru supplier negotiations and agreements. Finance Manager Intel July 2002  –  November 2003  (1 year 5 months) Wireless Computing and Communications Group, Intel: \n• Managed a team of strategic analysts and partnered with engineering, marketing, and manufacturing teams to drive affordable product roadmap for application and communication processors delivering $250M in revenue with $200M in annual R&D. \n• Played critical role in business decisions related to feature portfolio, product cost targets, sku based pricing, long range forecasting, and capital affordability. Finance Manager Intel July 2002  –  November 2003  (1 year 5 months) Wireless Computing and Communications Group, Intel: \n• Managed a team of strategic analysts and partnered with engineering, marketing, and manufacturing teams to drive affordable product roadmap for application and communication processors delivering $250M in revenue with $200M in annual R&D. \n• Played critical role in business decisions related to feature portfolio, product cost targets, sku based pricing, long range forecasting, and capital affordability. Finance Specialist Intel February 2001  –  July 2002  (1 year 6 months) IT/eBusiness Group, Intel:  \n• Business partner with manufacturing planning and eBusiness applications development groups focused on delivering systems for end to end manufacturing planning and agile decision making. Led a cross functional finance team to influence long term technology and strategy roadmaps as well as off shore staffing and execution plans to ensure success. Finance Specialist Intel February 2001  –  July 2002  (1 year 6 months) IT/eBusiness Group, Intel:  \n• Business partner with manufacturing planning and eBusiness applications development groups focused on delivering systems for end to end manufacturing planning and agile decision making. Led a cross functional finance team to influence long term technology and strategy roadmaps as well as off shore staffing and execution plans to ensure success. Skills Financial Modeling Cross-functional Team... Financial Analysis Forecasting Competitive Analysis Business Strategy Mergers Financial Forecasting Corporate Finance Process Improvement Managerial Finance Acquisition Integration Program Management Pricing Start-ups Strategic Planning Capital Budgeting Strategic Financial... Business Planning Business Analysis See 5+     See less Skills  Financial Modeling Cross-functional Team... Financial Analysis Forecasting Competitive Analysis Business Strategy Mergers Financial Forecasting Corporate Finance Process Improvement Managerial Finance Acquisition Integration Program Management Pricing Start-ups Strategic Planning Capital Budgeting Strategic Financial... Business Planning Business Analysis See 5+     See less Financial Modeling Cross-functional Team... Financial Analysis Forecasting Competitive Analysis Business Strategy Mergers Financial Forecasting Corporate Finance Process Improvement Managerial Finance Acquisition Integration Program Management Pricing Start-ups Strategic Planning Capital Budgeting Strategic Financial... Business Planning Business Analysis See 5+     See less Financial Modeling Cross-functional Team... Financial Analysis Forecasting Competitive Analysis Business Strategy Mergers Financial Forecasting Corporate Finance Process Improvement Managerial Finance Acquisition Integration Program Management Pricing Start-ups Strategic Planning Capital Budgeting Strategic Financial... Business Planning Business Analysis See 5+     See less Education Claremont Graduate University - Peter F. Drucker and Masatoshi Ito Graduate School of Management MBA,  Finance 1997  – 1999 New Jersey Institute of Technology MS,  Manufacturing Engineering 1989  – 1990 Maharaja Sayajirao University, India BS,  Mechanical Engineering 1983  – 1987 Claremont Graduate University - Peter F. Drucker and Masatoshi Ito Graduate School of Management MBA,  Finance 1997  – 1999 Claremont Graduate University - Peter F. Drucker and Masatoshi Ito Graduate School of Management MBA,  Finance 1997  – 1999 Claremont Graduate University - Peter F. Drucker and Masatoshi Ito Graduate School of Management MBA,  Finance 1997  – 1999 New Jersey Institute of Technology MS,  Manufacturing Engineering 1989  – 1990 New Jersey Institute of Technology MS,  Manufacturing Engineering 1989  – 1990 New Jersey Institute of Technology MS,  Manufacturing Engineering 1989  – 1990 Maharaja Sayajirao University, India BS,  Mechanical Engineering 1983  – 1987 Maharaja Sayajirao University, India BS,  Mechanical Engineering 1983  – 1987 Maharaja Sayajirao University, India BS,  Mechanical Engineering 1983  – 1987 "]}