{"position": "Financial Analyst", "company": "Google", "profiles": ["Experience Sr. Financial Analyst Cisco January 2014  – Present (1 year 8 months) san jose Sr. Financial Analyst Cisco January 2014  – Present (1 year 8 months) san jose Sr. Financial Analyst Cisco January 2014  – Present (1 year 8 months) san jose Skills Access Variance Analysis Forecasting Essbase Analysis Cross-functional Team... Finance Business Process Process Improvement Business Analysis Financial Analysis Analytics Financial Modeling Accounting Budgets Financial Reporting See 1+     See less Skills  Access Variance Analysis Forecasting Essbase Analysis Cross-functional Team... Finance Business Process Process Improvement Business Analysis Financial Analysis Analytics Financial Modeling Accounting Budgets Financial Reporting See 1+     See less Access Variance Analysis Forecasting Essbase Analysis Cross-functional Team... Finance Business Process Process Improvement Business Analysis Financial Analysis Analytics Financial Modeling Accounting Budgets Financial Reporting See 1+     See less Access Variance Analysis Forecasting Essbase Analysis Cross-functional Team... Finance Business Process Process Improvement Business Analysis Financial Analysis Analytics Financial Modeling Accounting Budgets Financial Reporting See 1+     See less ", "Summary Supply Chain Finance \nCommercial Finance \nBU Finance at Cisco Systems SPVTG \n \nMBA - Jacksonville State University \nB.S. Finance Summary Supply Chain Finance \nCommercial Finance \nBU Finance at Cisco Systems SPVTG \n \nMBA - Jacksonville State University \nB.S. Finance Supply Chain Finance \nCommercial Finance \nBU Finance at Cisco Systems SPVTG \n \nMBA - Jacksonville State University \nB.S. Finance Supply Chain Finance \nCommercial Finance \nBU Finance at Cisco Systems SPVTG \n \nMBA - Jacksonville State University \nB.S. Finance Experience Senior Financial Analyst Cisco August 2015  – Present (1 month) Supply Chain Finance Financial Analyst Cisco March 2014  –  August 2015  (1 year 6 months) Commercial Finance LATAM Financial Analyst Cisco Systems February 2011  –  March 2014  (3 years 2 months) BU Finace Service Providers Video Infrastructure Graduate Assistant College of Commerce January 2009  –  December 2010  (2 years) Executive work. \nProjects that Faculty Staff assigns me to do \nResearch for Finance and Economic Professors Accounting Assistant Jacksonville State University Foundation October 2007  –  May 2008  (8 months) Track donations of JSU alumni, update information of alumni and donors using Donor2.  \nUsed AccountMate to keep balance sheets, add new accounts, and keep track of old \naccounts. \nMade corrections to mistaken records. Finance Intern Ameriprise Financial Services June 2007  –  August 2007  (3 months) Analyzed clients' portfolios  \nAnalyzed mutual funds  \nCreated disability incomes for existing clients  \nCreated new financial plans for clients with no cash on accounts Senior Financial Analyst Cisco August 2015  – Present (1 month) Supply Chain Finance Senior Financial Analyst Cisco August 2015  – Present (1 month) Supply Chain Finance Financial Analyst Cisco March 2014  –  August 2015  (1 year 6 months) Commercial Finance LATAM Financial Analyst Cisco March 2014  –  August 2015  (1 year 6 months) Commercial Finance LATAM Financial Analyst Cisco Systems February 2011  –  March 2014  (3 years 2 months) BU Finace Service Providers Video Infrastructure Financial Analyst Cisco Systems February 2011  –  March 2014  (3 years 2 months) BU Finace Service Providers Video Infrastructure Graduate Assistant College of Commerce January 2009  –  December 2010  (2 years) Executive work. \nProjects that Faculty Staff assigns me to do \nResearch for Finance and Economic Professors Graduate Assistant College of Commerce January 2009  –  December 2010  (2 years) Executive work. \nProjects that Faculty Staff assigns me to do \nResearch for Finance and Economic Professors Accounting Assistant Jacksonville State University Foundation October 2007  –  May 2008  (8 months) Track donations of JSU alumni, update information of alumni and donors using Donor2.  \nUsed AccountMate to keep balance sheets, add new accounts, and keep track of old \naccounts. \nMade corrections to mistaken records. Accounting Assistant Jacksonville State University Foundation October 2007  –  May 2008  (8 months) Track donations of JSU alumni, update information of alumni and donors using Donor2.  \nUsed AccountMate to keep balance sheets, add new accounts, and keep track of old \naccounts. \nMade corrections to mistaken records. Finance Intern Ameriprise Financial Services June 2007  –  August 2007  (3 months) Analyzed clients' portfolios  \nAnalyzed mutual funds  \nCreated disability incomes for existing clients  \nCreated new financial plans for clients with no cash on accounts Finance Intern Ameriprise Financial Services June 2007  –  August 2007  (3 months) Analyzed clients' portfolios  \nAnalyzed mutual funds  \nCreated disability incomes for existing clients  \nCreated new financial plans for clients with no cash on accounts Skills Accounts Payable Portfolio Management Financial Reporting Economics Accounting Financial Analysis Corporate Finance Research Essbase Finance Forecasting Financial Modeling Process Improvement PowerPoint Microsoft Excel Skills  Accounts Payable Portfolio Management Financial Reporting Economics Accounting Financial Analysis Corporate Finance Research Essbase Finance Forecasting Financial Modeling Process Improvement PowerPoint Microsoft Excel Accounts Payable Portfolio Management Financial Reporting Economics Accounting Financial Analysis Corporate Finance Research Essbase Finance Forecasting Financial Modeling Process Improvement PowerPoint Microsoft Excel Accounts Payable Portfolio Management Financial Reporting Economics Accounting Financial Analysis Corporate Finance Research Essbase Finance Forecasting Financial Modeling Process Improvement PowerPoint Microsoft Excel Education Jacksonville State University MBA,  Finance 2009  – 2010 Jacksonville State University Bachelor of Science,  Finance 2004  – 2008 Jacksonville State University MBA,  Finance 2009  – 2010 Jacksonville State University MBA,  Finance 2009  – 2010 Jacksonville State University MBA,  Finance 2009  – 2010 Jacksonville State University Bachelor of Science,  Finance 2004  – 2008 Jacksonville State University Bachelor of Science,  Finance 2004  – 2008 Jacksonville State University Bachelor of Science,  Finance 2004  – 2008 Honors & Awards Additional Honors & Awards Ohio Valley Conference All Team '05 '06 '07 '08 \nOhio Valley Conference Freshman of the Year 2005. \nOhio Valley Conference Player of the Year 2008. \n \nFinancial Manager Association scholarship award. Additional Honors & Awards Ohio Valley Conference All Team '05 '06 '07 '08 \nOhio Valley Conference Freshman of the Year 2005. \nOhio Valley Conference Player of the Year 2008. \n \nFinancial Manager Association scholarship award. Additional Honors & Awards Ohio Valley Conference All Team '05 '06 '07 '08 \nOhio Valley Conference Freshman of the Year 2005. \nOhio Valley Conference Player of the Year 2008. \n \nFinancial Manager Association scholarship award. Additional Honors & Awards Ohio Valley Conference All Team '05 '06 '07 '08 \nOhio Valley Conference Freshman of the Year 2005. \nOhio Valley Conference Player of the Year 2008. \n \nFinancial Manager Association scholarship award. ", "Experience Financial Analyst - Supply Chain Finance Cisco March 2015  – Present (6 months) San Jose, CA •\tCost manufacturer analyst and partner financials point of contact \n•\tManaging $20M OPEX budget Financial Analyst - Sales Services Finance Cisco August 2014  –  March 2015  (8 months) San Jose, CA •\tManaged services bookings forecast for the America’s region ($7B revenue) \n•\tUsed pipeline analytics to identify revenue rich deals \n•\tImproved forecast accuracy by determining historical close rates from historical forecast and sales pipeline data \n•\tWorked with director to identify risk/upside in forecast \n•\tDrove initiative to clean up Salesforce.com data in order to improve revenue forecasting Financial Analyst - Payroll Accounting Cisco August 2013  –  August 2014  (1 year 1 month) San Jose, CA •\tBalanced, posted and processed payroll with ADP and Oracle applications \n•\tLead and implemented a paperless initiative for journal entry and reconciliation archiving \n•\tBalanced and processed the Employee Stock Purchase for US and Canada \n•\tCreated journal entries for and reconciled over 20 monthly accounts Finance Intern - Sales Services Finance Cisco June 2012  –  August 2012  (3 months) San Jose, CA •\tCreated a process to clean up backlog of deals that are booked, but not yet invoiced \n•\tBenchmarked Cisco services financials and sales information against other services competitors \n•\tAnalyzed historical revenue and bookings data to identify trends of different types of services contracts Financial Analyst - Supply Chain Finance Cisco March 2015  – Present (6 months) San Jose, CA •\tCost manufacturer analyst and partner financials point of contact \n•\tManaging $20M OPEX budget Financial Analyst - Supply Chain Finance Cisco March 2015  – Present (6 months) San Jose, CA •\tCost manufacturer analyst and partner financials point of contact \n•\tManaging $20M OPEX budget Financial Analyst - Sales Services Finance Cisco August 2014  –  March 2015  (8 months) San Jose, CA •\tManaged services bookings forecast for the America’s region ($7B revenue) \n•\tUsed pipeline analytics to identify revenue rich deals \n•\tImproved forecast accuracy by determining historical close rates from historical forecast and sales pipeline data \n•\tWorked with director to identify risk/upside in forecast \n•\tDrove initiative to clean up Salesforce.com data in order to improve revenue forecasting Financial Analyst - Sales Services Finance Cisco August 2014  –  March 2015  (8 months) San Jose, CA •\tManaged services bookings forecast for the America’s region ($7B revenue) \n•\tUsed pipeline analytics to identify revenue rich deals \n•\tImproved forecast accuracy by determining historical close rates from historical forecast and sales pipeline data \n•\tWorked with director to identify risk/upside in forecast \n•\tDrove initiative to clean up Salesforce.com data in order to improve revenue forecasting Financial Analyst - Payroll Accounting Cisco August 2013  –  August 2014  (1 year 1 month) San Jose, CA •\tBalanced, posted and processed payroll with ADP and Oracle applications \n•\tLead and implemented a paperless initiative for journal entry and reconciliation archiving \n•\tBalanced and processed the Employee Stock Purchase for US and Canada \n•\tCreated journal entries for and reconciled over 20 monthly accounts Financial Analyst - Payroll Accounting Cisco August 2013  –  August 2014  (1 year 1 month) San Jose, CA •\tBalanced, posted and processed payroll with ADP and Oracle applications \n•\tLead and implemented a paperless initiative for journal entry and reconciliation archiving \n•\tBalanced and processed the Employee Stock Purchase for US and Canada \n•\tCreated journal entries for and reconciled over 20 monthly accounts Finance Intern - Sales Services Finance Cisco June 2012  –  August 2012  (3 months) San Jose, CA •\tCreated a process to clean up backlog of deals that are booked, but not yet invoiced \n•\tBenchmarked Cisco services financials and sales information against other services competitors \n•\tAnalyzed historical revenue and bookings data to identify trends of different types of services contracts Finance Intern - Sales Services Finance Cisco June 2012  –  August 2012  (3 months) San Jose, CA •\tCreated a process to clean up backlog of deals that are booked, but not yet invoiced \n•\tBenchmarked Cisco services financials and sales information against other services competitors \n•\tAnalyzed historical revenue and bookings data to identify trends of different types of services contracts Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Microsoft Office Financial Modeling PowerPoint Financial Analysis Microsoft Excel Forecasting Social Media Acquisition Integration Spanish-speaking Microsoft Word Negotiation Operational Excellence Essbase Golf Finance Data Analysis SQL Salesforce.com See 3+     See less Skills  Microsoft Office Financial Modeling PowerPoint Financial Analysis Microsoft Excel Forecasting Social Media Acquisition Integration Spanish-speaking Microsoft Word Negotiation Operational Excellence Essbase Golf Finance Data Analysis SQL Salesforce.com See 3+     See less Microsoft Office Financial Modeling PowerPoint Financial Analysis Microsoft Excel Forecasting Social Media Acquisition Integration Spanish-speaking Microsoft Word Negotiation Operational Excellence Essbase Golf Finance Data Analysis SQL Salesforce.com See 3+     See less Microsoft Office Financial Modeling PowerPoint Financial Analysis Microsoft Excel Forecasting Social Media Acquisition Integration Spanish-speaking Microsoft Word Negotiation Operational Excellence Essbase Golf Finance Data Analysis SQL Salesforce.com See 3+     See less Education Clemson University - College of Business and Behavioral Science Bachelor of Science (B.S.),  Economics 2009  – 2013 Clemson University - College of Business and Behavioral Science Bachelor of Science (B.S.),  Economics 2009  – 2013 Clemson University - College of Business and Behavioral Science Bachelor of Science (B.S.),  Economics 2009  – 2013 Clemson University - College of Business and Behavioral Science Bachelor of Science (B.S.),  Economics 2009  – 2013 ", "Skills Financial Modeling Essbase Forecasting Budgets Skills  Financial Modeling Essbase Forecasting Budgets Financial Modeling Essbase Forecasting Budgets Financial Modeling Essbase Forecasting Budgets ", "Summary I am currently in my second rotation within the Finance Rotation Program at Cisco Systems. The Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Summary I am currently in my second rotation within the Finance Rotation Program at Cisco Systems. The Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. I am currently in my second rotation within the Finance Rotation Program at Cisco Systems. The Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. I am currently in my second rotation within the Finance Rotation Program at Cisco Systems. The Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Experience Financial Analyst (Business Technology & Operations Finance) Cisco March 2015  – Present (6 months) Support two business units in the Service Provider Mobility Group \nComplete weekly bookings reports and monthly revenue/margin forecasts by working with management and engineering teams. \nLoad the P&L forecast to Hyperion Planning on a monthly basis \n Financial Analyst (Technical Services) Cisco August 2014  –  March 2015  (8 months) Supported three directors in Technical Services by completing all month end reporting, forecasting of expenses and the quarterly recommit of spending targets. \nEnsured budgets stayed within a +1/-2% of commit, by maintaining constant communication with the business, approving acceptable purchase requisitions, and accurate forecasting. \nInvestigated and reported on variances versus commit, prior quarter, and prior year (monthly) using FINBI Essbase and Oracle General Ledger. \nApproved purchase requisitions and monitored for compliance and obtained feedback on all purchase orders for accurate accruals. \n SOX Specialist Cisco August 2013  –  August 2014  (1 year 1 month) Performed and documented quarterly testing of operational effectiveness for key financial controls for the Financial Consolidations and Reporting, Financial Statement Close, and Financial Planning and Analysis processes. \nFacilitated quarterly meetings with business partners to report results, communicate concerns, and develop effective solutions, ensuring operational effectiveness of controls.  \n Finance Intern Cisco Systems June 2012  –  August 2012  (3 months) Raleigh-Durham, North Carolina Area • Updated weekly headcount reports, managed monthly open purchase order reports, and \nprepared the 2013 team budget of $3 million. \n• Maintained an accurate budget by communicating effectively with mangers and controllers, \nensuring the approval of correct purchase requisitions. \n• Organized 1,200 departments by creating new department nodes and moved departments \naccordingly for more accurate reporting. Financial Analyst (Business Technology & Operations Finance) Cisco March 2015  – Present (6 months) Support two business units in the Service Provider Mobility Group \nComplete weekly bookings reports and monthly revenue/margin forecasts by working with management and engineering teams. \nLoad the P&L forecast to Hyperion Planning on a monthly basis \n Financial Analyst (Business Technology & Operations Finance) Cisco March 2015  – Present (6 months) Support two business units in the Service Provider Mobility Group \nComplete weekly bookings reports and monthly revenue/margin forecasts by working with management and engineering teams. \nLoad the P&L forecast to Hyperion Planning on a monthly basis \n Financial Analyst (Technical Services) Cisco August 2014  –  March 2015  (8 months) Supported three directors in Technical Services by completing all month end reporting, forecasting of expenses and the quarterly recommit of spending targets. \nEnsured budgets stayed within a +1/-2% of commit, by maintaining constant communication with the business, approving acceptable purchase requisitions, and accurate forecasting. \nInvestigated and reported on variances versus commit, prior quarter, and prior year (monthly) using FINBI Essbase and Oracle General Ledger. \nApproved purchase requisitions and monitored for compliance and obtained feedback on all purchase orders for accurate accruals. \n Financial Analyst (Technical Services) Cisco August 2014  –  March 2015  (8 months) Supported three directors in Technical Services by completing all month end reporting, forecasting of expenses and the quarterly recommit of spending targets. \nEnsured budgets stayed within a +1/-2% of commit, by maintaining constant communication with the business, approving acceptable purchase requisitions, and accurate forecasting. \nInvestigated and reported on variances versus commit, prior quarter, and prior year (monthly) using FINBI Essbase and Oracle General Ledger. \nApproved purchase requisitions and monitored for compliance and obtained feedback on all purchase orders for accurate accruals. \n SOX Specialist Cisco August 2013  –  August 2014  (1 year 1 month) Performed and documented quarterly testing of operational effectiveness for key financial controls for the Financial Consolidations and Reporting, Financial Statement Close, and Financial Planning and Analysis processes. \nFacilitated quarterly meetings with business partners to report results, communicate concerns, and develop effective solutions, ensuring operational effectiveness of controls.  \n SOX Specialist Cisco August 2013  –  August 2014  (1 year 1 month) Performed and documented quarterly testing of operational effectiveness for key financial controls for the Financial Consolidations and Reporting, Financial Statement Close, and Financial Planning and Analysis processes. \nFacilitated quarterly meetings with business partners to report results, communicate concerns, and develop effective solutions, ensuring operational effectiveness of controls.  \n Finance Intern Cisco Systems June 2012  –  August 2012  (3 months) Raleigh-Durham, North Carolina Area • Updated weekly headcount reports, managed monthly open purchase order reports, and \nprepared the 2013 team budget of $3 million. \n• Maintained an accurate budget by communicating effectively with mangers and controllers, \nensuring the approval of correct purchase requisitions. \n• Organized 1,200 departments by creating new department nodes and moved departments \naccordingly for more accurate reporting. Finance Intern Cisco Systems June 2012  –  August 2012  (3 months) Raleigh-Durham, North Carolina Area • Updated weekly headcount reports, managed monthly open purchase order reports, and \nprepared the 2013 team budget of $3 million. \n• Maintained an accurate budget by communicating effectively with mangers and controllers, \nensuring the approval of correct purchase requisitions. \n• Organized 1,200 departments by creating new department nodes and moved departments \naccordingly for more accurate reporting. Skills Financial Analysis Financial Modeling Budgets Finance Skills  Financial Analysis Financial Modeling Budgets Finance Financial Analysis Financial Modeling Budgets Finance Financial Analysis Financial Modeling Budgets Finance Education North Carolina State University - Poole College of Management B.S.,  Business Administration , Finance , 3.85 GPA 2009  – 2013 North Carolina State University Hamilton Scholars Program: 2009 to 2013:  \n•Dual degree, foreign language and study abroad requirement. \n \nNorth Carolina State University Scholars Program: 2009 to 2013 (by invitiation):  \n•Attendy bi-weekly events \n• Completed 12+ hours of Honors classes Activities and Societies:  North Carolina State University Scholars Program member\nNorth Carolina State University Hamilton Scholars member\nSociety of Human Resource Management (SHRM) North Carolina State University B.A.,  International Studies - Europe , 3.8 GPA 2009  – 2013 North Carolina State University Hamilton Scholars Program: 2009 to 2013:  \n•Dual degree, foreign language and study abroad requirement. North Carolina State University - Poole College of Management B.S.,  Business Administration , Finance , 3.85 GPA 2009  – 2013 North Carolina State University Hamilton Scholars Program: 2009 to 2013:  \n•Dual degree, foreign language and study abroad requirement. \n \nNorth Carolina State University Scholars Program: 2009 to 2013 (by invitiation):  \n•Attendy bi-weekly events \n• Completed 12+ hours of Honors classes Activities and Societies:  North Carolina State University Scholars Program member\nNorth Carolina State University Hamilton Scholars member\nSociety of Human Resource Management (SHRM) North Carolina State University - Poole College of Management B.S.,  Business Administration , Finance , 3.85 GPA 2009  – 2013 North Carolina State University Hamilton Scholars Program: 2009 to 2013:  \n•Dual degree, foreign language and study abroad requirement. \n \nNorth Carolina State University Scholars Program: 2009 to 2013 (by invitiation):  \n•Attendy bi-weekly events \n• Completed 12+ hours of Honors classes Activities and Societies:  North Carolina State University Scholars Program member\nNorth Carolina State University Hamilton Scholars member\nSociety of Human Resource Management (SHRM) North Carolina State University - Poole College of Management B.S.,  Business Administration , Finance , 3.85 GPA 2009  – 2013 North Carolina State University Hamilton Scholars Program: 2009 to 2013:  \n•Dual degree, foreign language and study abroad requirement. \n \nNorth Carolina State University Scholars Program: 2009 to 2013 (by invitiation):  \n•Attendy bi-weekly events \n• Completed 12+ hours of Honors classes Activities and Societies:  North Carolina State University Scholars Program member\nNorth Carolina State University Hamilton Scholars member\nSociety of Human Resource Management (SHRM) North Carolina State University B.A.,  International Studies - Europe , 3.8 GPA 2009  – 2013 North Carolina State University Hamilton Scholars Program: 2009 to 2013:  \n•Dual degree, foreign language and study abroad requirement. North Carolina State University B.A.,  International Studies - Europe , 3.8 GPA 2009  – 2013 North Carolina State University Hamilton Scholars Program: 2009 to 2013:  \n•Dual degree, foreign language and study abroad requirement. North Carolina State University B.A.,  International Studies - Europe , 3.8 GPA 2009  – 2013 North Carolina State University Hamilton Scholars Program: 2009 to 2013:  \n•Dual degree, foreign language and study abroad requirement. ", "Experience Finance Manager Cisco Systems July 2011  – Present (4 years 2 months) Commerce Finance Financial Analyst Cisco 2001  – Present (14 years) Sr. Financial Analyst Cisco Systems 2000  –  July 2011  (11 years) Financial analyst Cisco Systems 2000  –  2009  (9 years) Accounting manager Digital Equipment Corporation 1986  –  1991  (5 years) Finance Manager Cisco Systems July 2011  – Present (4 years 2 months) Commerce Finance Finance Manager Cisco Systems July 2011  – Present (4 years 2 months) Commerce Finance Financial Analyst Cisco 2001  – Present (14 years) Financial Analyst Cisco 2001  – Present (14 years) Sr. Financial Analyst Cisco Systems 2000  –  July 2011  (11 years) Sr. Financial Analyst Cisco Systems 2000  –  July 2011  (11 years) Financial analyst Cisco Systems 2000  –  2009  (9 years) Financial analyst Cisco Systems 2000  –  2009  (9 years) Accounting manager Digital Equipment Corporation 1986  –  1991  (5 years) Accounting manager Digital Equipment Corporation 1986  –  1991  (5 years) Skills Essbase Variance Analysis Financial Modeling Accounting Revenue Recognition Strategic Financial... Consolidation Finance Forecasting Hyperion Enterprise Managerial Finance Sarbanes-Oxley Act Financial Reporting Financial Analysis Skills  Essbase Variance Analysis Financial Modeling Accounting Revenue Recognition Strategic Financial... Consolidation Finance Forecasting Hyperion Enterprise Managerial Finance Sarbanes-Oxley Act Financial Reporting Financial Analysis Essbase Variance Analysis Financial Modeling Accounting Revenue Recognition Strategic Financial... Consolidation Finance Forecasting Hyperion Enterprise Managerial Finance Sarbanes-Oxley Act Financial Reporting Financial Analysis Essbase Variance Analysis Financial Modeling Accounting Revenue Recognition Strategic Financial... Consolidation Finance Forecasting Hyperion Enterprise Managerial Finance Sarbanes-Oxley Act Financial Reporting Financial Analysis Education Suffolk University - Sawyer School of Management EMBA,  Finance 1981  – 1982 Bentley University Bachelor of Science,  Accounting Suffolk University - Sawyer School of Management EMBA,  Finance 1981  – 1982 Suffolk University - Sawyer School of Management EMBA,  Finance 1981  – 1982 Suffolk University - Sawyer School of Management EMBA,  Finance 1981  – 1982 Bentley University Bachelor of Science,  Accounting Bentley University Bachelor of Science,  Accounting Bentley University Bachelor of Science,  Accounting ", "Experience Sr. Financial Analyst Cloud Services Cisco Systems June 2014  – Present (1 year 3 months) San Jose Flexible Consumption Modeling for XaaS business \nManage Individual Customer P&L's for XaaS \nDedicated Financial support for Cisco's new Hybrid Cloud Business \n Sr. Financial Analyst FP&A Data Center Cisco Systems August 2013  – Present (2 years 1 month) San Jose Manage quarterly headcount, operating expense, capital budgets, and accruals across Data Center BU; \nLead the quarterly budgeting process with Engineering, Product Marketing, and Operations;  \nAdvise business partners on portfolio prioritization, project ROI’s, and strategic business decisions; \nDevelop reporting metrics to drive business growth and operational excellence; Financial Analyst Corporate Accounting Cisco Systems August 2011  –  August 2013  (2 years 1 month) San Jose Consolidation Accounting & Financial Reporting; \nMonitor general ledger controls, balance sheet reconciliations, & worldwide accruals; \nPrepare/present analytical analysis of WW Balance Sheet and P&L activity; Business Ops Intern Cisco Systems August 2010  –  September 2010  (2 months) Sports & Entertainment Solutions Group Intern; \nContributed to stadium vision mobile app GTM strategy; \nAnalyzed Stadium Vision Total Addressable Market ($400M) for US professional league teams & analyzed market penetration rates relative to competitors Financial Analyst Intern Cisco Systems June 2010  –  August 2010  (3 months) Corporate Revenue Intern; \nCreated process improvement related training that reached an audience of 400+ finance professionals detailing the life-cycle of non-standard deals process; \nDeveloped metrics package for non-standard deals; Sr. Financial Analyst Cloud Services Cisco Systems June 2014  – Present (1 year 3 months) San Jose Flexible Consumption Modeling for XaaS business \nManage Individual Customer P&L's for XaaS \nDedicated Financial support for Cisco's new Hybrid Cloud Business \n Sr. Financial Analyst Cloud Services Cisco Systems June 2014  – Present (1 year 3 months) San Jose Flexible Consumption Modeling for XaaS business \nManage Individual Customer P&L's for XaaS \nDedicated Financial support for Cisco's new Hybrid Cloud Business \n Sr. Financial Analyst FP&A Data Center Cisco Systems August 2013  – Present (2 years 1 month) San Jose Manage quarterly headcount, operating expense, capital budgets, and accruals across Data Center BU; \nLead the quarterly budgeting process with Engineering, Product Marketing, and Operations;  \nAdvise business partners on portfolio prioritization, project ROI’s, and strategic business decisions; \nDevelop reporting metrics to drive business growth and operational excellence; Sr. Financial Analyst FP&A Data Center Cisco Systems August 2013  – Present (2 years 1 month) San Jose Manage quarterly headcount, operating expense, capital budgets, and accruals across Data Center BU; \nLead the quarterly budgeting process with Engineering, Product Marketing, and Operations;  \nAdvise business partners on portfolio prioritization, project ROI’s, and strategic business decisions; \nDevelop reporting metrics to drive business growth and operational excellence; Financial Analyst Corporate Accounting Cisco Systems August 2011  –  August 2013  (2 years 1 month) San Jose Consolidation Accounting & Financial Reporting; \nMonitor general ledger controls, balance sheet reconciliations, & worldwide accruals; \nPrepare/present analytical analysis of WW Balance Sheet and P&L activity; Financial Analyst Corporate Accounting Cisco Systems August 2011  –  August 2013  (2 years 1 month) San Jose Consolidation Accounting & Financial Reporting; \nMonitor general ledger controls, balance sheet reconciliations, & worldwide accruals; \nPrepare/present analytical analysis of WW Balance Sheet and P&L activity; Business Ops Intern Cisco Systems August 2010  –  September 2010  (2 months) Sports & Entertainment Solutions Group Intern; \nContributed to stadium vision mobile app GTM strategy; \nAnalyzed Stadium Vision Total Addressable Market ($400M) for US professional league teams & analyzed market penetration rates relative to competitors Business Ops Intern Cisco Systems August 2010  –  September 2010  (2 months) Sports & Entertainment Solutions Group Intern; \nContributed to stadium vision mobile app GTM strategy; \nAnalyzed Stadium Vision Total Addressable Market ($400M) for US professional league teams & analyzed market penetration rates relative to competitors Financial Analyst Intern Cisco Systems June 2010  –  August 2010  (3 months) Corporate Revenue Intern; \nCreated process improvement related training that reached an audience of 400+ finance professionals detailing the life-cycle of non-standard deals process; \nDeveloped metrics package for non-standard deals; Financial Analyst Intern Cisco Systems June 2010  –  August 2010  (3 months) Corporate Revenue Intern; \nCreated process improvement related training that reached an audience of 400+ finance professionals detailing the life-cycle of non-standard deals process; \nDeveloped metrics package for non-standard deals; Skills Financial Reporting Leadership Finance Process Improvement Competitive Analysis Microsoft Office Microsoft Excel PowerPoint Analysis Business Analysis Accounting Financial Analysis Corporate Finance Internal Controls Skills  Financial Reporting Leadership Finance Process Improvement Competitive Analysis Microsoft Office Microsoft Excel PowerPoint Analysis Business Analysis Accounting Financial Analysis Corporate Finance Internal Controls Financial Reporting Leadership Finance Process Improvement Competitive Analysis Microsoft Office Microsoft Excel PowerPoint Analysis Business Analysis Accounting Financial Analysis Corporate Finance Internal Controls Financial Reporting Leadership Finance Process Improvement Competitive Analysis Microsoft Office Microsoft Excel PowerPoint Analysis Business Analysis Accounting Financial Analysis Corporate Finance Internal Controls Education California Polytechnic State University-San Luis Obispo Business,  Accounting , Finance 2007  – 2011 Accounting Activities and Societies:  Member of CPAC:Cal Poly Accounting Club\nSigma Kappa Sorority: 2007-2009\nCEA Study Abroad Program:I spent four months in Spain studying and exploring commerce and international marketing patterns of the European Union and the Spanish language.\nDeloitte & Touche Research Project:Researched and presented a case to Deloitte and Touche partners regarding accounting treatment of manufacturing facility disposal. California Polytechnic State University-San Luis Obispo Business,  Accounting , Finance 2007  – 2011 Accounting Activities and Societies:  Member of CPAC:Cal Poly Accounting Club\nSigma Kappa Sorority: 2007-2009\nCEA Study Abroad Program:I spent four months in Spain studying and exploring commerce and international marketing patterns of the European Union and the Spanish language.\nDeloitte & Touche Research Project:Researched and presented a case to Deloitte and Touche partners regarding accounting treatment of manufacturing facility disposal. California Polytechnic State University-San Luis Obispo Business,  Accounting , Finance 2007  – 2011 Accounting Activities and Societies:  Member of CPAC:Cal Poly Accounting Club\nSigma Kappa Sorority: 2007-2009\nCEA Study Abroad Program:I spent four months in Spain studying and exploring commerce and international marketing patterns of the European Union and the Spanish language.\nDeloitte & Touche Research Project:Researched and presented a case to Deloitte and Touche partners regarding accounting treatment of manufacturing facility disposal. California Polytechnic State University-San Luis Obispo Business,  Accounting , Finance 2007  – 2011 Accounting Activities and Societies:  Member of CPAC:Cal Poly Accounting Club\nSigma Kappa Sorority: 2007-2009\nCEA Study Abroad Program:I spent four months in Spain studying and exploring commerce and international marketing patterns of the European Union and the Spanish language.\nDeloitte & Touche Research Project:Researched and presented a case to Deloitte and Touche partners regarding accounting treatment of manufacturing facility disposal. Honors & Awards Additional Honors & Awards 2005 Women's Varisty Soccer All-League  \n2007 Physics Student of the Year \n2007 Female Scholor Athlete of the Year Additional Honors & Awards 2005 Women's Varisty Soccer All-League  \n2007 Physics Student of the Year \n2007 Female Scholor Athlete of the Year Additional Honors & Awards 2005 Women's Varisty Soccer All-League  \n2007 Physics Student of the Year \n2007 Female Scholor Athlete of the Year Additional Honors & Awards 2005 Women's Varisty Soccer All-League  \n2007 Physics Student of the Year \n2007 Female Scholor Athlete of the Year ", "Experience Financial Analyst - Commercial Finance Cisco April 2015  – Present (5 months) London, United Kingdom Participant in Cisco's Finance Rotation Program. This accelerated program provides participants with the opportunity to experience four areas of corporate finance and accounting by means of six-month rotations. The breadth of knowledge that I have gained so far has allowed me to grow personally and professionally, at an exceptional rate. \n \nFor this role in commercial finance, I have been given the opportunity to move to London to work with the Sales & Services Finance team for the EMEAR regions. Core duties included deal management for the Global Service Provider business within Europe's northern region. I worked directly with our sales team, reviewing, approving and optimizing deals of all sizes and complexities in our companies most challenge sector. I was also responsible for creating reports that allowed our finance leadership team to better understand the discount trends occurring within our EMEAR sales force. This included experience with Oracle database retrieval and creation of automated reports through utilizing VBA programming language.  Financial Analyst - External Reporting Cisco August 2014  –  March 2015  (8 months) San Jose, Ca Participant in Cisco's Finance Rotation Program. This accelerated program provides participants with the opportunity to experience four areas of corporate finance and accounting by means of six-month rotations. The breadth of knowledge that I have gained so far has allowed me to grow personally and professionally, at an exceptional rate. \n \nFor the past six months I have worked in Cisco's external reporting team, responsible for the companies compliance to the SEC reporting requirements. Responsibilities in the role have included: \n \n- Public filing benchmarking against industry peers \n- Ownership of 6 of 18 of the financial statement footnotes \n- Management of executive team quarterly earnings binder \n- Quality assurance of XBRL taxonomy Financial Analyst - Corporate Development Cisco January 2014  –  August 2014  (8 months) San Jose, CA Participant in Cisco's Finance Rotation Program. This accelerated program provides participants with the opportunity to experience four areas of corporate finance and accounting by means of six-month rotations. The breadth of knowledge that I have gained so far has allowed me to grow personally and professionally, at an exceptional rate. \n \nFinancial analyst in Cisco's highly active M&A group. As a key line of support for the companies Business Development team, the CDF team is responsible for everything from OPEX budget management to potential acquisition target valuation. My primary responsibilities consisted of the following: \n \n- Quarterly FP&A of OPEX budget. \n- Quartely valuation of investment portfolio (both direct & indirect investments) \n- Quarterly venture fund commitment reporting Customer and Program Management Intern Cisco Systems June 2013  –  December 2013  (7 months) San Jose, CA Data Analyst Intern Genentech June 2012  –  August 2012  (3 months) Vacaville Work with Microsoft Excel analyze material testing efficiency and SAP forecast adherence to plan. Financial Analyst - Commercial Finance Cisco April 2015  – Present (5 months) London, United Kingdom Participant in Cisco's Finance Rotation Program. This accelerated program provides participants with the opportunity to experience four areas of corporate finance and accounting by means of six-month rotations. The breadth of knowledge that I have gained so far has allowed me to grow personally and professionally, at an exceptional rate. \n \nFor this role in commercial finance, I have been given the opportunity to move to London to work with the Sales & Services Finance team for the EMEAR regions. Core duties included deal management for the Global Service Provider business within Europe's northern region. I worked directly with our sales team, reviewing, approving and optimizing deals of all sizes and complexities in our companies most challenge sector. I was also responsible for creating reports that allowed our finance leadership team to better understand the discount trends occurring within our EMEAR sales force. This included experience with Oracle database retrieval and creation of automated reports through utilizing VBA programming language.  Financial Analyst - Commercial Finance Cisco April 2015  – Present (5 months) London, United Kingdom Participant in Cisco's Finance Rotation Program. This accelerated program provides participants with the opportunity to experience four areas of corporate finance and accounting by means of six-month rotations. The breadth of knowledge that I have gained so far has allowed me to grow personally and professionally, at an exceptional rate. \n \nFor this role in commercial finance, I have been given the opportunity to move to London to work with the Sales & Services Finance team for the EMEAR regions. Core duties included deal management for the Global Service Provider business within Europe's northern region. I worked directly with our sales team, reviewing, approving and optimizing deals of all sizes and complexities in our companies most challenge sector. I was also responsible for creating reports that allowed our finance leadership team to better understand the discount trends occurring within our EMEAR sales force. This included experience with Oracle database retrieval and creation of automated reports through utilizing VBA programming language.  Financial Analyst - External Reporting Cisco August 2014  –  March 2015  (8 months) San Jose, Ca Participant in Cisco's Finance Rotation Program. This accelerated program provides participants with the opportunity to experience four areas of corporate finance and accounting by means of six-month rotations. The breadth of knowledge that I have gained so far has allowed me to grow personally and professionally, at an exceptional rate. \n \nFor the past six months I have worked in Cisco's external reporting team, responsible for the companies compliance to the SEC reporting requirements. Responsibilities in the role have included: \n \n- Public filing benchmarking against industry peers \n- Ownership of 6 of 18 of the financial statement footnotes \n- Management of executive team quarterly earnings binder \n- Quality assurance of XBRL taxonomy Financial Analyst - External Reporting Cisco August 2014  –  March 2015  (8 months) San Jose, Ca Participant in Cisco's Finance Rotation Program. This accelerated program provides participants with the opportunity to experience four areas of corporate finance and accounting by means of six-month rotations. The breadth of knowledge that I have gained so far has allowed me to grow personally and professionally, at an exceptional rate. \n \nFor the past six months I have worked in Cisco's external reporting team, responsible for the companies compliance to the SEC reporting requirements. Responsibilities in the role have included: \n \n- Public filing benchmarking against industry peers \n- Ownership of 6 of 18 of the financial statement footnotes \n- Management of executive team quarterly earnings binder \n- Quality assurance of XBRL taxonomy Financial Analyst - Corporate Development Cisco January 2014  –  August 2014  (8 months) San Jose, CA Participant in Cisco's Finance Rotation Program. This accelerated program provides participants with the opportunity to experience four areas of corporate finance and accounting by means of six-month rotations. The breadth of knowledge that I have gained so far has allowed me to grow personally and professionally, at an exceptional rate. \n \nFinancial analyst in Cisco's highly active M&A group. As a key line of support for the companies Business Development team, the CDF team is responsible for everything from OPEX budget management to potential acquisition target valuation. My primary responsibilities consisted of the following: \n \n- Quarterly FP&A of OPEX budget. \n- Quartely valuation of investment portfolio (both direct & indirect investments) \n- Quarterly venture fund commitment reporting Financial Analyst - Corporate Development Cisco January 2014  –  August 2014  (8 months) San Jose, CA Participant in Cisco's Finance Rotation Program. This accelerated program provides participants with the opportunity to experience four areas of corporate finance and accounting by means of six-month rotations. The breadth of knowledge that I have gained so far has allowed me to grow personally and professionally, at an exceptional rate. \n \nFinancial analyst in Cisco's highly active M&A group. As a key line of support for the companies Business Development team, the CDF team is responsible for everything from OPEX budget management to potential acquisition target valuation. My primary responsibilities consisted of the following: \n \n- Quarterly FP&A of OPEX budget. \n- Quartely valuation of investment portfolio (both direct & indirect investments) \n- Quarterly venture fund commitment reporting Customer and Program Management Intern Cisco Systems June 2013  –  December 2013  (7 months) San Jose, CA Customer and Program Management Intern Cisco Systems June 2013  –  December 2013  (7 months) San Jose, CA Data Analyst Intern Genentech June 2012  –  August 2012  (3 months) Vacaville Work with Microsoft Excel analyze material testing efficiency and SAP forecast adherence to plan. Data Analyst Intern Genentech June 2012  –  August 2012  (3 months) Vacaville Work with Microsoft Excel analyze material testing efficiency and SAP forecast adherence to plan. Skills Data Analysis Analysis Microsoft Office Microsoft Excel SAP Finance Financial Analysis Time Management Accounting Access Forecasting Financial Modeling Financial Reporting Skills  Data Analysis Analysis Microsoft Office Microsoft Excel SAP Finance Financial Analysis Time Management Accounting Access Forecasting Financial Modeling Financial Reporting Data Analysis Analysis Microsoft Office Microsoft Excel SAP Finance Financial Analysis Time Management Accounting Access Forecasting Financial Modeling Financial Reporting Data Analysis Analysis Microsoft Office Microsoft Excel SAP Finance Financial Analysis Time Management Accounting Access Forecasting Financial Modeling Financial Reporting Education San Jose State University B.S.,  Accounting and Finance 2011  – 2013 BS in Finance San Jose State University B.S.,  Accounting and Finance 2011  – 2013 BS in Finance San Jose State University B.S.,  Accounting and Finance 2011  – 2013 BS in Finance San Jose State University B.S.,  Accounting and Finance 2011  – 2013 BS in Finance ", "Summary Currently in my third rotation within the Finance Rotation Program at Cisco Systems. Cisco's highly-regarded Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Summary Currently in my third rotation within the Finance Rotation Program at Cisco Systems. Cisco's highly-regarded Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Currently in my third rotation within the Finance Rotation Program at Cisco Systems. Cisco's highly-regarded Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Currently in my third rotation within the Finance Rotation Program at Cisco Systems. Cisco's highly-regarded Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Experience Financial Analyst (Sales & Service Finance) Cisco Systems February 2015  – Present (7 months) Raleigh-Durham, North Carolina Area Controlling the requisitions, cross charges and systems integrator hierarchy \nManaging the OpEx for SSF and providing commentary on actuals vs forecast Financial Analyst (Worldwide Partner Finance) Cisco Systems September 2014  –  February 2015  (6 months) Raleigh-Durham, North Carolina Area Forecasted for the Network Assessments partner promotion program \nOrganized and audited payments for Network Assessments and Big Bets programs \nEvaluated the effectiveness of all partner promotion programs \nCreated reports on promotions to analyze the bookings and pipeline numbers Financial Analyst (Cisco Capital Accounting) Cisco Systems August 2013  –  August 2014  (1 year 1 month) Raleigh-Durham, North Carolina Area Prepare journal entries and reconciliations for the pre-owned equipment business \nManage the aging of open operating expense purchase orders \nSupport team with Project Connect close deadlines \nOrganize and complete Project Connect Report Testing Finance Intern (Commercial Finance Acquisitions) Cisco Systems June 2012  –  August 2012  (3 months) Raleigh-Durham, North Carolina Area Developed a process to audit the team's deal approval system. \nCreated and implemented a tool to promote team acknowledgement through discount reduction. \nGained a basic understanding of complex customer deal financing. Data Analyst Intern Lenovo E-commerce June 2011  –  November 2011  (6 months) Raleigh-Durham, North Carolina Area Analyzed, edited, tested, and updated the product pages of the website \nPioneered a project on redesigning the product comparison feature on website Cashier Cold Stone Creamery January 2008  –  September 2008  (9 months) •\tObtained excellent communication, multitasking, and problem solving skills Financial Analyst (Sales & Service Finance) Cisco Systems February 2015  – Present (7 months) Raleigh-Durham, North Carolina Area Controlling the requisitions, cross charges and systems integrator hierarchy \nManaging the OpEx for SSF and providing commentary on actuals vs forecast Financial Analyst (Sales & Service Finance) Cisco Systems February 2015  – Present (7 months) Raleigh-Durham, North Carolina Area Controlling the requisitions, cross charges and systems integrator hierarchy \nManaging the OpEx for SSF and providing commentary on actuals vs forecast Financial Analyst (Worldwide Partner Finance) Cisco Systems September 2014  –  February 2015  (6 months) Raleigh-Durham, North Carolina Area Forecasted for the Network Assessments partner promotion program \nOrganized and audited payments for Network Assessments and Big Bets programs \nEvaluated the effectiveness of all partner promotion programs \nCreated reports on promotions to analyze the bookings and pipeline numbers Financial Analyst (Worldwide Partner Finance) Cisco Systems September 2014  –  February 2015  (6 months) Raleigh-Durham, North Carolina Area Forecasted for the Network Assessments partner promotion program \nOrganized and audited payments for Network Assessments and Big Bets programs \nEvaluated the effectiveness of all partner promotion programs \nCreated reports on promotions to analyze the bookings and pipeline numbers Financial Analyst (Cisco Capital Accounting) Cisco Systems August 2013  –  August 2014  (1 year 1 month) Raleigh-Durham, North Carolina Area Prepare journal entries and reconciliations for the pre-owned equipment business \nManage the aging of open operating expense purchase orders \nSupport team with Project Connect close deadlines \nOrganize and complete Project Connect Report Testing Financial Analyst (Cisco Capital Accounting) Cisco Systems August 2013  –  August 2014  (1 year 1 month) Raleigh-Durham, North Carolina Area Prepare journal entries and reconciliations for the pre-owned equipment business \nManage the aging of open operating expense purchase orders \nSupport team with Project Connect close deadlines \nOrganize and complete Project Connect Report Testing Finance Intern (Commercial Finance Acquisitions) Cisco Systems June 2012  –  August 2012  (3 months) Raleigh-Durham, North Carolina Area Developed a process to audit the team's deal approval system. \nCreated and implemented a tool to promote team acknowledgement through discount reduction. \nGained a basic understanding of complex customer deal financing. Finance Intern (Commercial Finance Acquisitions) Cisco Systems June 2012  –  August 2012  (3 months) Raleigh-Durham, North Carolina Area Developed a process to audit the team's deal approval system. \nCreated and implemented a tool to promote team acknowledgement through discount reduction. \nGained a basic understanding of complex customer deal financing. Data Analyst Intern Lenovo E-commerce June 2011  –  November 2011  (6 months) Raleigh-Durham, North Carolina Area Analyzed, edited, tested, and updated the product pages of the website \nPioneered a project on redesigning the product comparison feature on website Data Analyst Intern Lenovo E-commerce June 2011  –  November 2011  (6 months) Raleigh-Durham, North Carolina Area Analyzed, edited, tested, and updated the product pages of the website \nPioneered a project on redesigning the product comparison feature on website Cashier Cold Stone Creamery January 2008  –  September 2008  (9 months) •\tObtained excellent communication, multitasking, and problem solving skills Cashier Cold Stone Creamery January 2008  –  September 2008  (9 months) •\tObtained excellent communication, multitasking, and problem solving skills Skills Organizational... Meeting Deadlines Priority Management Finance Microsoft Excel PowerPoint Microsoft Word Data Analysis Auditing Process Improvement Six Sigma Public Speaking Skills  Organizational... Meeting Deadlines Priority Management Finance Microsoft Excel PowerPoint Microsoft Word Data Analysis Auditing Process Improvement Six Sigma Public Speaking Organizational... Meeting Deadlines Priority Management Finance Microsoft Excel PowerPoint Microsoft Word Data Analysis Auditing Process Improvement Six Sigma Public Speaking Organizational... Meeting Deadlines Priority Management Finance Microsoft Excel PowerPoint Microsoft Word Data Analysis Auditing Process Improvement Six Sigma Public Speaking Education Appalachian State University Bachelor of Science,  Business Administration; Computer Information Systems & Finance and Banking; Supply Chain Management 2009  – 2013 GPA: 3.93 \n \nDean’s List – 8 consecutive semesters \nChancellor’s List – 7 consecutive semesters \n \nStudy Abroad/International Experience in Costa Rica Activities and Societies:  Walker College of Business Honors Program ,  University Honors College ,  Appalachian Supply Chain Club ,  Women's Varsity Soccer Appalachian State University Bachelor of Science,  Business Administration; Computer Information Systems & Finance and Banking; Supply Chain Management 2009  – 2013 GPA: 3.93 \n \nDean’s List – 8 consecutive semesters \nChancellor’s List – 7 consecutive semesters \n \nStudy Abroad/International Experience in Costa Rica Activities and Societies:  Walker College of Business Honors Program ,  University Honors College ,  Appalachian Supply Chain Club ,  Women's Varsity Soccer Appalachian State University Bachelor of Science,  Business Administration; Computer Information Systems & Finance and Banking; Supply Chain Management 2009  – 2013 GPA: 3.93 \n \nDean’s List – 8 consecutive semesters \nChancellor’s List – 7 consecutive semesters \n \nStudy Abroad/International Experience in Costa Rica Activities and Societies:  Walker College of Business Honors Program ,  University Honors College ,  Appalachian Supply Chain Club ,  Women's Varsity Soccer Appalachian State University Bachelor of Science,  Business Administration; Computer Information Systems & Finance and Banking; Supply Chain Management 2009  – 2013 GPA: 3.93 \n \nDean’s List – 8 consecutive semesters \nChancellor’s List – 7 consecutive semesters \n \nStudy Abroad/International Experience in Costa Rica Activities and Societies:  Walker College of Business Honors Program ,  University Honors College ,  Appalachian Supply Chain Club ,  Women's Varsity Soccer Honors & Awards Additional Honors & Awards Walker College of Business Honors Program \n•\tPursued connections with prestigious, well-connected professors  \n•\tFocused on learning in-depth material through discussions, group work, and papers \n \nUniversity Honors College \n•\tImproved verbal and written skills through smaller classes and individual attention \n•\tMaintained great responsibility and individualism Additional Honors & Awards Walker College of Business Honors Program \n•\tPursued connections with prestigious, well-connected professors  \n•\tFocused on learning in-depth material through discussions, group work, and papers \n \nUniversity Honors College \n•\tImproved verbal and written skills through smaller classes and individual attention \n•\tMaintained great responsibility and individualism Additional Honors & Awards Walker College of Business Honors Program \n•\tPursued connections with prestigious, well-connected professors  \n•\tFocused on learning in-depth material through discussions, group work, and papers \n \nUniversity Honors College \n•\tImproved verbal and written skills through smaller classes and individual attention \n•\tMaintained great responsibility and individualism Additional Honors & Awards Walker College of Business Honors Program \n•\tPursued connections with prestigious, well-connected professors  \n•\tFocused on learning in-depth material through discussions, group work, and papers \n \nUniversity Honors College \n•\tImproved verbal and written skills through smaller classes and individual attention \n•\tMaintained great responsibility and individualism ", "Summary Experienced financial profile with more than 10 years of experience in a multinational company in the Finance and Administration area. \n \nAdapts easily to multi-cultural and new environments (part of expat family having lived and worked in Mexico from 1986 to 1991). \n \nEager to learn and assume responsibilities. \n \nProactive and creative mind. Summary Experienced financial profile with more than 10 years of experience in a multinational company in the Finance and Administration area. \n \nAdapts easily to multi-cultural and new environments (part of expat family having lived and worked in Mexico from 1986 to 1991). \n \nEager to learn and assume responsibilities. \n \nProactive and creative mind. Experienced financial profile with more than 10 years of experience in a multinational company in the Finance and Administration area. \n \nAdapts easily to multi-cultural and new environments (part of expat family having lived and worked in Mexico from 1986 to 1991). \n \nEager to learn and assume responsibilities. \n \nProactive and creative mind. Experienced financial profile with more than 10 years of experience in a multinational company in the Finance and Administration area. \n \nAdapts easily to multi-cultural and new environments (part of expat family having lived and worked in Mexico from 1986 to 1991). \n \nEager to learn and assume responsibilities. \n \nProactive and creative mind. Experience Senior Financial Analyst Cisco May 2012  – Present (3 years 4 months) Vimercate, Milan Italy Management of the financial accounts of: \n \n-Cisco Systems Italy S.r.l (Buy/Sell Entity) \n-Cisco Photonics Italy S.r.l.  \n \nFinancial management tasks:  \n \n- Fixed Assets \n \n•\tReview and perform the monthly addition, depreciation and retirements, overview of the capitalization related processes verifying US GAAP and Local Statutory requirements. \n•\tManagement of tracking process activity of Fixed Assets, Prototypes and Loans including liaison with Customs and with local support agent for all regulatory reporting and Tax requirements. \n•\tIntrastat declaration. \n \n \n- Intercompany \n \n•\tReview and perform of the cross charge accounting process between entities, control and record retention verifying US GAAP and Local Statutory requirements. \n•\tReview of the Cost Plus and Transfer Pricing activity dealing as well with Tax team and TP Team on True-up and Forecast adjustments. \n \n- Inventory \n \n•\tReview and analysis of the Inventory process, liaison with Global Inventory Team on US GAAP and local statutory requirements on Spares and COGS related operations and reconciliation process. \n \n- Revenue \n \n•\tRevenue analysis and liaison with Revenue Team on US GAAP and local statutory requirements. \nPerform and review of the monthly Revenue balance sheet file for the Revenue Related BS Flux Review call. \n \n- Procurement \n \n•\tAct as point of contact for procurement processes, verifying as well the compliance to the local policies. \n \n \n- Reconciliation of the financial accounts of corporate (US GAAP) and Tax books for the above areas providing support to the Country Finance Manager, Business Partners and External Auditors for the year-end Financial Statement review. \n \n- GRID 4EU Project Controller \n \n•\tParticipate in the GRID 4EU European Commission Project, act as point of contact for Financial part of the project as cost claim activity and audit activity, supporting business as well in the relationship with EU project coordinators. \n Financial Analyst Cisco April 2011  –  May 2012  (1 year 2 months) Vimercate, Milan Italy Process Lead of the following countries: \n \nCisco Systems Italy S.r.l. \nCisco Photonics Italy S.r.l.  \nCisco Systems Belgium SPRL \nCisco Systems Luxembourg SARL \nCisco Systems Croatia \nCisco Systems Slovenia \nCisco Systems Slovakia \n \nMonitoring the processes relating to cash, fixed assets, intercompany, payroll and OPEX, point of contact for US GAAP accounting activities, liaison with business partners, Country Finance Manager and external Auditors. \n \n- Reporting \n \n•\tReview of Accruals, Big Bills, Prepaid and Open Po accruals, \n•\tExpense analysis \n•\tLiaison with business partners regarding OPEX analysis \n \n-Payroll \n \n•\tReconciliations of Payroll accounts, liaison between Payroll department and Country Finance Manager for payroll accounting processes.. \n \n \n- Fixed Assets \n \n•\tReview of the monthly addition, depreciation and retirements, overview of the capitalization related processes. \n \n- Intercompany \n \n•\tCross charge accounting process between entities, control and record retention, cost plus activity. \n \n- Cash \n \n•\tLiaison with Treasury and Banks for all reporting requirements, \n \n- Procurement \n \n•\tAct as point of contact for procurement processes, issues of purchase orders, review and check of the accounts of the purchase requisition verifying as well the compliance to the local policies \n \n \n \n-Reconciliation of the financial accounts of corporate (US GAAP) and Tax books for the above areas providing support to the Country Finance Manager, Business Partners and External Auditors for year-end Financial Statement review. \n \n Accountant Cisco July 2004  –  April 2011  (6 years 10 months) Vimercate, Milan Italy Management of the financial accounts of: \nCisco Systems Italy S.r.l. \nCisco Photonics Italy S.r.l.  \n \n- Reporting: \n•\tAccruals, month end close activity, \n•\tExpense analysis \n•\tLiaison with business partners \n \n- VAT: \n•\tVat declarations, checking and analysis \n \n- Procurement \n \n•\tAct as point of contact for procurement processes, issues of purchase orders, review and check of the accounts of the purchase requisition verifying as well the compliance to the local policies \n \n \n- Asset management: \n•\tMaintain fixed asset, depreciation and intangible asset records.- Oracle 11i (ERP) \n•\tImplementation and management of tracking process activity of Fixed Assets, Prototypes and Loans including liaison with Customs and with local support agent for all regulatory reporting and Tax requirements \n•\tIntrastat declaration \n \n \n- Intercompany \n•\tCross charge accounting process between entities, control and record retention. \n \n \n \n- Cash management: \n•\tLiaison with Treasury and Banks for all reporting requirements \n•\tBank statement control, reconciliation (corporate and local) \n•\tCash Forecast \n•\tPayments \n \n- Reconciliation of the financial accounts of corporate (US GAAP) and Tax books for the above areas providing support to the Country Finance Manager, Business Partners and External Auditors for year-end Financial Statement review. \n \n \n• Content Manager for GSD (Global Service Delivery) intranet of: \n•\tSouth EMEA region \n•\tEmerging EMEA region Accountant Cisco December 2003  –  July 2004  (8 months) Vimercate, Milan Italy •\tAccounts Payable, ensure timely and accurate booking of invoices, credit notes, purchase orders, vendor setup database maintenance, liaise with vendors, collections arrears control. \n \n•\tCash management  \n \n•\tIntrastat declaration Web Designer WonderArts January 2000  –  December 2001  (2 years) Legnano, Milan Italy - Web design,  \n- Project management \n- Sales management. \n Senior Financial Analyst Cisco May 2012  – Present (3 years 4 months) Vimercate, Milan Italy Management of the financial accounts of: \n \n-Cisco Systems Italy S.r.l (Buy/Sell Entity) \n-Cisco Photonics Italy S.r.l.  \n \nFinancial management tasks:  \n \n- Fixed Assets \n \n•\tReview and perform the monthly addition, depreciation and retirements, overview of the capitalization related processes verifying US GAAP and Local Statutory requirements. \n•\tManagement of tracking process activity of Fixed Assets, Prototypes and Loans including liaison with Customs and with local support agent for all regulatory reporting and Tax requirements. \n•\tIntrastat declaration. \n \n \n- Intercompany \n \n•\tReview and perform of the cross charge accounting process between entities, control and record retention verifying US GAAP and Local Statutory requirements. \n•\tReview of the Cost Plus and Transfer Pricing activity dealing as well with Tax team and TP Team on True-up and Forecast adjustments. \n \n- Inventory \n \n•\tReview and analysis of the Inventory process, liaison with Global Inventory Team on US GAAP and local statutory requirements on Spares and COGS related operations and reconciliation process. \n \n- Revenue \n \n•\tRevenue analysis and liaison with Revenue Team on US GAAP and local statutory requirements. \nPerform and review of the monthly Revenue balance sheet file for the Revenue Related BS Flux Review call. \n \n- Procurement \n \n•\tAct as point of contact for procurement processes, verifying as well the compliance to the local policies. \n \n \n- Reconciliation of the financial accounts of corporate (US GAAP) and Tax books for the above areas providing support to the Country Finance Manager, Business Partners and External Auditors for the year-end Financial Statement review. \n \n- GRID 4EU Project Controller \n \n•\tParticipate in the GRID 4EU European Commission Project, act as point of contact for Financial part of the project as cost claim activity and audit activity, supporting business as well in the relationship with EU project coordinators. \n Senior Financial Analyst Cisco May 2012  – Present (3 years 4 months) Vimercate, Milan Italy Management of the financial accounts of: \n \n-Cisco Systems Italy S.r.l (Buy/Sell Entity) \n-Cisco Photonics Italy S.r.l.  \n \nFinancial management tasks:  \n \n- Fixed Assets \n \n•\tReview and perform the monthly addition, depreciation and retirements, overview of the capitalization related processes verifying US GAAP and Local Statutory requirements. \n•\tManagement of tracking process activity of Fixed Assets, Prototypes and Loans including liaison with Customs and with local support agent for all regulatory reporting and Tax requirements. \n•\tIntrastat declaration. \n \n \n- Intercompany \n \n•\tReview and perform of the cross charge accounting process between entities, control and record retention verifying US GAAP and Local Statutory requirements. \n•\tReview of the Cost Plus and Transfer Pricing activity dealing as well with Tax team and TP Team on True-up and Forecast adjustments. \n \n- Inventory \n \n•\tReview and analysis of the Inventory process, liaison with Global Inventory Team on US GAAP and local statutory requirements on Spares and COGS related operations and reconciliation process. \n \n- Revenue \n \n•\tRevenue analysis and liaison with Revenue Team on US GAAP and local statutory requirements. \nPerform and review of the monthly Revenue balance sheet file for the Revenue Related BS Flux Review call. \n \n- Procurement \n \n•\tAct as point of contact for procurement processes, verifying as well the compliance to the local policies. \n \n \n- Reconciliation of the financial accounts of corporate (US GAAP) and Tax books for the above areas providing support to the Country Finance Manager, Business Partners and External Auditors for the year-end Financial Statement review. \n \n- GRID 4EU Project Controller \n \n•\tParticipate in the GRID 4EU European Commission Project, act as point of contact for Financial part of the project as cost claim activity and audit activity, supporting business as well in the relationship with EU project coordinators. \n Financial Analyst Cisco April 2011  –  May 2012  (1 year 2 months) Vimercate, Milan Italy Process Lead of the following countries: \n \nCisco Systems Italy S.r.l. \nCisco Photonics Italy S.r.l.  \nCisco Systems Belgium SPRL \nCisco Systems Luxembourg SARL \nCisco Systems Croatia \nCisco Systems Slovenia \nCisco Systems Slovakia \n \nMonitoring the processes relating to cash, fixed assets, intercompany, payroll and OPEX, point of contact for US GAAP accounting activities, liaison with business partners, Country Finance Manager and external Auditors. \n \n- Reporting \n \n•\tReview of Accruals, Big Bills, Prepaid and Open Po accruals, \n•\tExpense analysis \n•\tLiaison with business partners regarding OPEX analysis \n \n-Payroll \n \n•\tReconciliations of Payroll accounts, liaison between Payroll department and Country Finance Manager for payroll accounting processes.. \n \n \n- Fixed Assets \n \n•\tReview of the monthly addition, depreciation and retirements, overview of the capitalization related processes. \n \n- Intercompany \n \n•\tCross charge accounting process between entities, control and record retention, cost plus activity. \n \n- Cash \n \n•\tLiaison with Treasury and Banks for all reporting requirements, \n \n- Procurement \n \n•\tAct as point of contact for procurement processes, issues of purchase orders, review and check of the accounts of the purchase requisition verifying as well the compliance to the local policies \n \n \n \n-Reconciliation of the financial accounts of corporate (US GAAP) and Tax books for the above areas providing support to the Country Finance Manager, Business Partners and External Auditors for year-end Financial Statement review. \n \n Financial Analyst Cisco April 2011  –  May 2012  (1 year 2 months) Vimercate, Milan Italy Process Lead of the following countries: \n \nCisco Systems Italy S.r.l. \nCisco Photonics Italy S.r.l.  \nCisco Systems Belgium SPRL \nCisco Systems Luxembourg SARL \nCisco Systems Croatia \nCisco Systems Slovenia \nCisco Systems Slovakia \n \nMonitoring the processes relating to cash, fixed assets, intercompany, payroll and OPEX, point of contact for US GAAP accounting activities, liaison with business partners, Country Finance Manager and external Auditors. \n \n- Reporting \n \n•\tReview of Accruals, Big Bills, Prepaid and Open Po accruals, \n•\tExpense analysis \n•\tLiaison with business partners regarding OPEX analysis \n \n-Payroll \n \n•\tReconciliations of Payroll accounts, liaison between Payroll department and Country Finance Manager for payroll accounting processes.. \n \n \n- Fixed Assets \n \n•\tReview of the monthly addition, depreciation and retirements, overview of the capitalization related processes. \n \n- Intercompany \n \n•\tCross charge accounting process between entities, control and record retention, cost plus activity. \n \n- Cash \n \n•\tLiaison with Treasury and Banks for all reporting requirements, \n \n- Procurement \n \n•\tAct as point of contact for procurement processes, issues of purchase orders, review and check of the accounts of the purchase requisition verifying as well the compliance to the local policies \n \n \n \n-Reconciliation of the financial accounts of corporate (US GAAP) and Tax books for the above areas providing support to the Country Finance Manager, Business Partners and External Auditors for year-end Financial Statement review. \n \n Accountant Cisco July 2004  –  April 2011  (6 years 10 months) Vimercate, Milan Italy Management of the financial accounts of: \nCisco Systems Italy S.r.l. \nCisco Photonics Italy S.r.l.  \n \n- Reporting: \n•\tAccruals, month end close activity, \n•\tExpense analysis \n•\tLiaison with business partners \n \n- VAT: \n•\tVat declarations, checking and analysis \n \n- Procurement \n \n•\tAct as point of contact for procurement processes, issues of purchase orders, review and check of the accounts of the purchase requisition verifying as well the compliance to the local policies \n \n \n- Asset management: \n•\tMaintain fixed asset, depreciation and intangible asset records.- Oracle 11i (ERP) \n•\tImplementation and management of tracking process activity of Fixed Assets, Prototypes and Loans including liaison with Customs and with local support agent for all regulatory reporting and Tax requirements \n•\tIntrastat declaration \n \n \n- Intercompany \n•\tCross charge accounting process between entities, control and record retention. \n \n \n \n- Cash management: \n•\tLiaison with Treasury and Banks for all reporting requirements \n•\tBank statement control, reconciliation (corporate and local) \n•\tCash Forecast \n•\tPayments \n \n- Reconciliation of the financial accounts of corporate (US GAAP) and Tax books for the above areas providing support to the Country Finance Manager, Business Partners and External Auditors for year-end Financial Statement review. \n \n \n• Content Manager for GSD (Global Service Delivery) intranet of: \n•\tSouth EMEA region \n•\tEmerging EMEA region Accountant Cisco July 2004  –  April 2011  (6 years 10 months) Vimercate, Milan Italy Management of the financial accounts of: \nCisco Systems Italy S.r.l. \nCisco Photonics Italy S.r.l.  \n \n- Reporting: \n•\tAccruals, month end close activity, \n•\tExpense analysis \n•\tLiaison with business partners \n \n- VAT: \n•\tVat declarations, checking and analysis \n \n- Procurement \n \n•\tAct as point of contact for procurement processes, issues of purchase orders, review and check of the accounts of the purchase requisition verifying as well the compliance to the local policies \n \n \n- Asset management: \n•\tMaintain fixed asset, depreciation and intangible asset records.- Oracle 11i (ERP) \n•\tImplementation and management of tracking process activity of Fixed Assets, Prototypes and Loans including liaison with Customs and with local support agent for all regulatory reporting and Tax requirements \n•\tIntrastat declaration \n \n \n- Intercompany \n•\tCross charge accounting process between entities, control and record retention. \n \n \n \n- Cash management: \n•\tLiaison with Treasury and Banks for all reporting requirements \n•\tBank statement control, reconciliation (corporate and local) \n•\tCash Forecast \n•\tPayments \n \n- Reconciliation of the financial accounts of corporate (US GAAP) and Tax books for the above areas providing support to the Country Finance Manager, Business Partners and External Auditors for year-end Financial Statement review. \n \n \n• Content Manager for GSD (Global Service Delivery) intranet of: \n•\tSouth EMEA region \n•\tEmerging EMEA region Accountant Cisco December 2003  –  July 2004  (8 months) Vimercate, Milan Italy •\tAccounts Payable, ensure timely and accurate booking of invoices, credit notes, purchase orders, vendor setup database maintenance, liaise with vendors, collections arrears control. \n \n•\tCash management  \n \n•\tIntrastat declaration Accountant Cisco December 2003  –  July 2004  (8 months) Vimercate, Milan Italy •\tAccounts Payable, ensure timely and accurate booking of invoices, credit notes, purchase orders, vendor setup database maintenance, liaise with vendors, collections arrears control. \n \n•\tCash management  \n \n•\tIntrastat declaration Web Designer WonderArts January 2000  –  December 2001  (2 years) Legnano, Milan Italy - Web design,  \n- Project management \n- Sales management. \n Web Designer WonderArts January 2000  –  December 2001  (2 years) Legnano, Milan Italy - Web design,  \n- Project management \n- Sales management. \n Languages English Full professional proficiency Spanish Native or bilingual proficiency Italian Native or bilingual proficiency French Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency Italian Native or bilingual proficiency French Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency Italian Native or bilingual proficiency French Elementary proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Skills     Education Università Carlo Cattaneo Bachelor’s Degree,  Business/Managerial Economics 2003 Università Carlo Cattaneo Bachelor’s Degree,  Business/Managerial Economics 2003 Università Carlo Cattaneo Bachelor’s Degree,  Business/Managerial Economics 2003 Università Carlo Cattaneo Bachelor’s Degree,  Business/Managerial Economics 2003 ", "Summary A seasoned Finance professional with over 8 years of experience across functions.  \n \nSpecialties: \n \n1. Financial Analysis, modeling, Management Reporting (MIS) \n2. Budgeting, Forecasting, Variance analysis. \n3.Great working with people & mentoring  \n4. Hands on experience working with Business Objects, Essbase, EPS (Cisco Enterprise Pricing Solution tool), BPC (SAP), Oracle BI tools, Sales Force dot Com. \n5. Quick learner and self starter.  \n6. First participant to be chosen to work in an Internal Audit role for Cisco through a Compliance Development Program (a Cisco CFO initiative) \n7. Experience working with a Boutique investment bank on the sell side M&A transactions, compaines looking for seed and growth capital. \n8. Received various awards and recognitions for coming up with process efficiencies, identifying huge cost savings to the company and playing a critical role in setting up and streamlining processes.  \n Summary A seasoned Finance professional with over 8 years of experience across functions.  \n \nSpecialties: \n \n1. Financial Analysis, modeling, Management Reporting (MIS) \n2. Budgeting, Forecasting, Variance analysis. \n3.Great working with people & mentoring  \n4. Hands on experience working with Business Objects, Essbase, EPS (Cisco Enterprise Pricing Solution tool), BPC (SAP), Oracle BI tools, Sales Force dot Com. \n5. Quick learner and self starter.  \n6. First participant to be chosen to work in an Internal Audit role for Cisco through a Compliance Development Program (a Cisco CFO initiative) \n7. Experience working with a Boutique investment bank on the sell side M&A transactions, compaines looking for seed and growth capital. \n8. Received various awards and recognitions for coming up with process efficiencies, identifying huge cost savings to the company and playing a critical role in setting up and streamlining processes.  \n A seasoned Finance professional with over 8 years of experience across functions.  \n \nSpecialties: \n \n1. Financial Analysis, modeling, Management Reporting (MIS) \n2. Budgeting, Forecasting, Variance analysis. \n3.Great working with people & mentoring  \n4. Hands on experience working with Business Objects, Essbase, EPS (Cisco Enterprise Pricing Solution tool), BPC (SAP), Oracle BI tools, Sales Force dot Com. \n5. Quick learner and self starter.  \n6. First participant to be chosen to work in an Internal Audit role for Cisco through a Compliance Development Program (a Cisco CFO initiative) \n7. Experience working with a Boutique investment bank on the sell side M&A transactions, compaines looking for seed and growth capital. \n8. Received various awards and recognitions for coming up with process efficiencies, identifying huge cost savings to the company and playing a critical role in setting up and streamlining processes.  \n A seasoned Finance professional with over 8 years of experience across functions.  \n \nSpecialties: \n \n1. Financial Analysis, modeling, Management Reporting (MIS) \n2. Budgeting, Forecasting, Variance analysis. \n3.Great working with people & mentoring  \n4. Hands on experience working with Business Objects, Essbase, EPS (Cisco Enterprise Pricing Solution tool), BPC (SAP), Oracle BI tools, Sales Force dot Com. \n5. Quick learner and self starter.  \n6. First participant to be chosen to work in an Internal Audit role for Cisco through a Compliance Development Program (a Cisco CFO initiative) \n7. Experience working with a Boutique investment bank on the sell side M&A transactions, compaines looking for seed and growth capital. \n8. Received various awards and recognitions for coming up with process efficiencies, identifying huge cost savings to the company and playing a critical role in setting up and streamlining processes.  \n Experience Senior Financial Analyst Cisco Systems May 2013  – Present (2 years 4 months) Bangalore - Drive and manage all Financial Planning & Analysis (FPA) activities with respect to Cisco Switching portfolio (which represents 60% of Cisco business) \n- Publish and analyze bookings, P&L, headcount, Opex data \n- Track key KPI, Top customer analytics, cross selling opportunities within the Enterprise segment of Cisco. \n- India point of contact responsible for bookings and expense forecast tracking for India Engineering site head. Single point of contact for Switching India engineering teams \n- Tracking ‘Very Large Opportunities’ in sales pipeline to give guidance to sales heads.  \n- Prepare and present the Business Financial Performance at monthly and quarterly Business review meetings. \n Senior Financial Analyst Cisco Systems February 2015  –  April 2015  (3 months) Bengaluru Area, India Internal Audit - Compliance Risk and Controls \n \n- Part of Internal Audit team for Cisco, involved in two audits – NDS process audit (Co. acquired by Cisco) and India site audit \n- Identified key risks and controls within the business process, came up with the Audit work program by performing risk assessment of the function. \n- Identified the scope of the audit and handled end-to-end audit of the Quote-to-cash process independently.  \n- Made audit documentation at every stage of the audit in parlance with Big4 process and documentation benchmark. \n- Identified key findings from the audit, communicated the same to management, identified MAP (Management Action Plan) owners, and got the observation remedied.  \n Senior Financial Analyst VMware June 2012  –  May 2013  (1 year) Bengaluru Area, India - Financial Planning, Forecasting for spend for entire VMware IT organization.  \n- Track Headcount, assist in month/Quarter end activities including accruals, re-class etc. \n- Submitting Flash/ bridge for corporate meetings. \n- Loading the forecasts and budget numbers into BPC tool (SAP) \n- Assist Budged Managers and Project Managers with requests in managing their budgets. \n- MIS reporting of financials. \n- Preparing slide deck for MIS reporting. \n Business Analyst Cisco Systems June 2010  –  May 2012  (2 years) Bengaluru Area, India - MIS Reporting – Financial reporting for Cisco WebEx worldwide Sales Finance \n- Preparation of Financial Models to populate informative reports. \n- Preparing Quarterly Dashboard (Scorecard) with important highlights for the quarter to the different Business Units. \n- Getting forecast numbers through forecast calls on a weekly basis and collating Billing and Revenue forecast. \n- Calculating variances from budget and giving a summary of the findings. \n- Preparation of Channel report, collating data for SP, UC certified partners. \n- Preparing the Headcount summary report for the Sales organization. \n- Preparing Power point presentations for senior management based out of Cisco U.S.A. \n- Presenting Monthly, Quarterly, and Yearly MIS information to Management based out of India. \n- Internal audit of Sales bookings process of Cisco WebEx sales operation. \n- Working extensively with Sales Force dot com in assisting sales operations team. \n- Providing post sales support to Customer Success Managers. \n- Transactional support and calculating credits due to Customer Success Managers in lead generation and conversion process.  \n Senior Associate Singhi Advisors August 2007  –  February 2008  (7 months) Bengaluru Area, India - Investment Banking, Financial Modeling, Budgeting and Forecasting \n- Deal Sourcing, Client Relationship Management \n- Represent Buy Side / Sell Side in M&A and other Investment Banking transactions. \n- Financial Modeling for clients. \n- Provide advisory services to clients on M&A transactions, raising Growth Capital \n- Prepare Information Memorandum / Valuation Memorandums for proposals \n- Conducting market research from secondary data \n- Interacted extensively with Top Management of the Clients \n Senior Financial Analyst Cisco Systems May 2013  – Present (2 years 4 months) Bangalore - Drive and manage all Financial Planning & Analysis (FPA) activities with respect to Cisco Switching portfolio (which represents 60% of Cisco business) \n- Publish and analyze bookings, P&L, headcount, Opex data \n- Track key KPI, Top customer analytics, cross selling opportunities within the Enterprise segment of Cisco. \n- India point of contact responsible for bookings and expense forecast tracking for India Engineering site head. Single point of contact for Switching India engineering teams \n- Tracking ‘Very Large Opportunities’ in sales pipeline to give guidance to sales heads.  \n- Prepare and present the Business Financial Performance at monthly and quarterly Business review meetings. \n Senior Financial Analyst Cisco Systems May 2013  – Present (2 years 4 months) Bangalore - Drive and manage all Financial Planning & Analysis (FPA) activities with respect to Cisco Switching portfolio (which represents 60% of Cisco business) \n- Publish and analyze bookings, P&L, headcount, Opex data \n- Track key KPI, Top customer analytics, cross selling opportunities within the Enterprise segment of Cisco. \n- India point of contact responsible for bookings and expense forecast tracking for India Engineering site head. Single point of contact for Switching India engineering teams \n- Tracking ‘Very Large Opportunities’ in sales pipeline to give guidance to sales heads.  \n- Prepare and present the Business Financial Performance at monthly and quarterly Business review meetings. \n Senior Financial Analyst Cisco Systems February 2015  –  April 2015  (3 months) Bengaluru Area, India Internal Audit - Compliance Risk and Controls \n \n- Part of Internal Audit team for Cisco, involved in two audits – NDS process audit (Co. acquired by Cisco) and India site audit \n- Identified key risks and controls within the business process, came up with the Audit work program by performing risk assessment of the function. \n- Identified the scope of the audit and handled end-to-end audit of the Quote-to-cash process independently.  \n- Made audit documentation at every stage of the audit in parlance with Big4 process and documentation benchmark. \n- Identified key findings from the audit, communicated the same to management, identified MAP (Management Action Plan) owners, and got the observation remedied.  \n Senior Financial Analyst Cisco Systems February 2015  –  April 2015  (3 months) Bengaluru Area, India Internal Audit - Compliance Risk and Controls \n \n- Part of Internal Audit team for Cisco, involved in two audits – NDS process audit (Co. acquired by Cisco) and India site audit \n- Identified key risks and controls within the business process, came up with the Audit work program by performing risk assessment of the function. \n- Identified the scope of the audit and handled end-to-end audit of the Quote-to-cash process independently.  \n- Made audit documentation at every stage of the audit in parlance with Big4 process and documentation benchmark. \n- Identified key findings from the audit, communicated the same to management, identified MAP (Management Action Plan) owners, and got the observation remedied.  \n Senior Financial Analyst VMware June 2012  –  May 2013  (1 year) Bengaluru Area, India - Financial Planning, Forecasting for spend for entire VMware IT organization.  \n- Track Headcount, assist in month/Quarter end activities including accruals, re-class etc. \n- Submitting Flash/ bridge for corporate meetings. \n- Loading the forecasts and budget numbers into BPC tool (SAP) \n- Assist Budged Managers and Project Managers with requests in managing their budgets. \n- MIS reporting of financials. \n- Preparing slide deck for MIS reporting. \n Senior Financial Analyst VMware June 2012  –  May 2013  (1 year) Bengaluru Area, India - Financial Planning, Forecasting for spend for entire VMware IT organization.  \n- Track Headcount, assist in month/Quarter end activities including accruals, re-class etc. \n- Submitting Flash/ bridge for corporate meetings. \n- Loading the forecasts and budget numbers into BPC tool (SAP) \n- Assist Budged Managers and Project Managers with requests in managing their budgets. \n- MIS reporting of financials. \n- Preparing slide deck for MIS reporting. \n Business Analyst Cisco Systems June 2010  –  May 2012  (2 years) Bengaluru Area, India - MIS Reporting – Financial reporting for Cisco WebEx worldwide Sales Finance \n- Preparation of Financial Models to populate informative reports. \n- Preparing Quarterly Dashboard (Scorecard) with important highlights for the quarter to the different Business Units. \n- Getting forecast numbers through forecast calls on a weekly basis and collating Billing and Revenue forecast. \n- Calculating variances from budget and giving a summary of the findings. \n- Preparation of Channel report, collating data for SP, UC certified partners. \n- Preparing the Headcount summary report for the Sales organization. \n- Preparing Power point presentations for senior management based out of Cisco U.S.A. \n- Presenting Monthly, Quarterly, and Yearly MIS information to Management based out of India. \n- Internal audit of Sales bookings process of Cisco WebEx sales operation. \n- Working extensively with Sales Force dot com in assisting sales operations team. \n- Providing post sales support to Customer Success Managers. \n- Transactional support and calculating credits due to Customer Success Managers in lead generation and conversion process.  \n Business Analyst Cisco Systems June 2010  –  May 2012  (2 years) Bengaluru Area, India - MIS Reporting – Financial reporting for Cisco WebEx worldwide Sales Finance \n- Preparation of Financial Models to populate informative reports. \n- Preparing Quarterly Dashboard (Scorecard) with important highlights for the quarter to the different Business Units. \n- Getting forecast numbers through forecast calls on a weekly basis and collating Billing and Revenue forecast. \n- Calculating variances from budget and giving a summary of the findings. \n- Preparation of Channel report, collating data for SP, UC certified partners. \n- Preparing the Headcount summary report for the Sales organization. \n- Preparing Power point presentations for senior management based out of Cisco U.S.A. \n- Presenting Monthly, Quarterly, and Yearly MIS information to Management based out of India. \n- Internal audit of Sales bookings process of Cisco WebEx sales operation. \n- Working extensively with Sales Force dot com in assisting sales operations team. \n- Providing post sales support to Customer Success Managers. \n- Transactional support and calculating credits due to Customer Success Managers in lead generation and conversion process.  \n Senior Associate Singhi Advisors August 2007  –  February 2008  (7 months) Bengaluru Area, India - Investment Banking, Financial Modeling, Budgeting and Forecasting \n- Deal Sourcing, Client Relationship Management \n- Represent Buy Side / Sell Side in M&A and other Investment Banking transactions. \n- Financial Modeling for clients. \n- Provide advisory services to clients on M&A transactions, raising Growth Capital \n- Prepare Information Memorandum / Valuation Memorandums for proposals \n- Conducting market research from secondary data \n- Interacted extensively with Top Management of the Clients \n Senior Associate Singhi Advisors August 2007  –  February 2008  (7 months) Bengaluru Area, India - Investment Banking, Financial Modeling, Budgeting and Forecasting \n- Deal Sourcing, Client Relationship Management \n- Represent Buy Side / Sell Side in M&A and other Investment Banking transactions. \n- Financial Modeling for clients. \n- Provide advisory services to clients on M&A transactions, raising Growth Capital \n- Prepare Information Memorandum / Valuation Memorandums for proposals \n- Conducting market research from secondary data \n- Interacted extensively with Top Management of the Clients \n Skills Financial Modeling Financial Analysis Forecasting Finance Mergers & Acquisitions Management Investment Banking Variance Analysis Strategic Financial... Business Objects MIS Budgets Corporate Finance Valuation Business Analysis Financial Reporting GAAP Capital Budgeting Process Improvement See 4+     See less Skills  Financial Modeling Financial Analysis Forecasting Finance Mergers & Acquisitions Management Investment Banking Variance Analysis Strategic Financial... Business Objects MIS Budgets Corporate Finance Valuation Business Analysis Financial Reporting GAAP Capital Budgeting Process Improvement See 4+     See less Financial Modeling Financial Analysis Forecasting Finance Mergers & Acquisitions Management Investment Banking Variance Analysis Strategic Financial... Business Objects MIS Budgets Corporate Finance Valuation Business Analysis Financial Reporting GAAP Capital Budgeting Process Improvement See 4+     See less Financial Modeling Financial Analysis Forecasting Finance Mergers & Acquisitions Management Investment Banking Variance Analysis Strategic Financial... Business Objects MIS Budgets Corporate Finance Valuation Business Analysis Financial Reporting GAAP Capital Budgeting Process Improvement See 4+     See less Education Indian Institute of Management, Bangalore 2010  – 2010 California State University-East Bay MBA,  Finance 2003  – 2005 Indian Institute of Management, Bangalore 2010  – 2010 Indian Institute of Management, Bangalore 2010  – 2010 Indian Institute of Management, Bangalore 2010  – 2010 California State University-East Bay MBA,  Finance 2003  – 2005 California State University-East Bay MBA,  Finance 2003  – 2005 California State University-East Bay MBA,  Finance 2003  – 2005 Honors & Awards \"You Amaze” and “You Inspire” awards - Cisco Systems Director December 2014 \"You Amaze” and “You Inspire” awarded for playing a critical role in setting up Cisco COE Bangalore operations. \"CAP (Cisco Achievement Program) Award” Manager January 2012 “CAP (Cisco Achievement Program) Award” from Cisco Systems for process efficiency, huge cost savings to company by identifying process gaps “CAP (Cisco Achievement Program) Award” from Cisco Systems Manager Cisco Systems August 2011 \t“CAP (Cisco Achievement Program) Award” from Cisco Systems for process efficiency, cost savings to company, consistent delivery of Management reports with accuracy “Pride at Cisco” - Cisco Systems Manager Cisco Systems November 2010 \t“Pride at Cisco” awarded by Cisco Systems for the period November 2010  \"You Amaze” and “You Inspire” awards - Cisco Systems Director December 2014 \"You Amaze” and “You Inspire” awarded for playing a critical role in setting up Cisco COE Bangalore operations. \"You Amaze” and “You Inspire” awards - Cisco Systems Director December 2014 \"You Amaze” and “You Inspire” awarded for playing a critical role in setting up Cisco COE Bangalore operations. \"You Amaze” and “You Inspire” awards - Cisco Systems Director December 2014 \"You Amaze” and “You Inspire” awarded for playing a critical role in setting up Cisco COE Bangalore operations. \"CAP (Cisco Achievement Program) Award” Manager January 2012 “CAP (Cisco Achievement Program) Award” from Cisco Systems for process efficiency, huge cost savings to company by identifying process gaps \"CAP (Cisco Achievement Program) Award” Manager January 2012 “CAP (Cisco Achievement Program) Award” from Cisco Systems for process efficiency, huge cost savings to company by identifying process gaps \"CAP (Cisco Achievement Program) Award” Manager January 2012 “CAP (Cisco Achievement Program) Award” from Cisco Systems for process efficiency, huge cost savings to company by identifying process gaps “CAP (Cisco Achievement Program) Award” from Cisco Systems Manager Cisco Systems August 2011 \t“CAP (Cisco Achievement Program) Award” from Cisco Systems for process efficiency, cost savings to company, consistent delivery of Management reports with accuracy “CAP (Cisco Achievement Program) Award” from Cisco Systems Manager Cisco Systems August 2011 \t“CAP (Cisco Achievement Program) Award” from Cisco Systems for process efficiency, cost savings to company, consistent delivery of Management reports with accuracy “CAP (Cisco Achievement Program) Award” from Cisco Systems Manager Cisco Systems August 2011 \t“CAP (Cisco Achievement Program) Award” from Cisco Systems for process efficiency, cost savings to company, consistent delivery of Management reports with accuracy “Pride at Cisco” - Cisco Systems Manager Cisco Systems November 2010 \t“Pride at Cisco” awarded by Cisco Systems for the period November 2010  “Pride at Cisco” - Cisco Systems Manager Cisco Systems November 2010 \t“Pride at Cisco” awarded by Cisco Systems for the period November 2010  “Pride at Cisco” - Cisco Systems Manager Cisco Systems November 2010 \t“Pride at Cisco” awarded by Cisco Systems for the period November 2010  ", "Skills Expense Budget... Financial Modeling Financial Analysis P&L Accountability Microsoft Excel Essbase Hyperion Planning Resource Management Trusted Business Partner Microsoft Office Presentation Development Cross-functional Team... Cisco Business... WebEx Conferencing Management P See 1+     See less Skills  Expense Budget... Financial Modeling Financial Analysis P&L Accountability Microsoft Excel Essbase Hyperion Planning Resource Management Trusted Business Partner Microsoft Office Presentation Development Cross-functional Team... Cisco Business... WebEx Conferencing Management P See 1+     See less Expense Budget... Financial Modeling Financial Analysis P&L Accountability Microsoft Excel Essbase Hyperion Planning Resource Management Trusted Business Partner Microsoft Office Presentation Development Cross-functional Team... Cisco Business... WebEx Conferencing Management P See 1+     See less Expense Budget... Financial Modeling Financial Analysis P&L Accountability Microsoft Excel Essbase Hyperion Planning Resource Management Trusted Business Partner Microsoft Office Presentation Development Cross-functional Team... Cisco Business... WebEx Conferencing Management P See 1+     See less Education North Carolina State University - College of Management Valedictorian; Bachelor's Degree Business Administration,  Dual Concentration in Finance and Marketing , University Valedictorian; College of Management Highest Ranking Senior 2007  – 2010 Valedictorian, Class of December 2010. \nAwarded \"Highest Ranking Senior\" of The Poole College of Management. \n\"Student of the Year\" Finalist. \n \nRelevant coursework: marketing fundamentals, marketing research, international marketing, marketing strategy, product and brand management, business statistics- intermediate and advanced, accounting, economics, interpersonal communications, corporate finance, personal finance- intermediate and advanced, communication for business management, business ethics, and business law. North Carolina State University - College of Management Valedictorian; Bachelor's Degree Business Administration,  Dual Concentration in Finance and Marketing , University Valedictorian; College of Management Highest Ranking Senior 2007  – 2010 Valedictorian, Class of December 2010. \nAwarded \"Highest Ranking Senior\" of The Poole College of Management. \n\"Student of the Year\" Finalist. \n \nRelevant coursework: marketing fundamentals, marketing research, international marketing, marketing strategy, product and brand management, business statistics- intermediate and advanced, accounting, economics, interpersonal communications, corporate finance, personal finance- intermediate and advanced, communication for business management, business ethics, and business law. North Carolina State University - College of Management Valedictorian; Bachelor's Degree Business Administration,  Dual Concentration in Finance and Marketing , University Valedictorian; College of Management Highest Ranking Senior 2007  – 2010 Valedictorian, Class of December 2010. \nAwarded \"Highest Ranking Senior\" of The Poole College of Management. \n\"Student of the Year\" Finalist. \n \nRelevant coursework: marketing fundamentals, marketing research, international marketing, marketing strategy, product and brand management, business statistics- intermediate and advanced, accounting, economics, interpersonal communications, corporate finance, personal finance- intermediate and advanced, communication for business management, business ethics, and business law. North Carolina State University - College of Management Valedictorian; Bachelor's Degree Business Administration,  Dual Concentration in Finance and Marketing , University Valedictorian; College of Management Highest Ranking Senior 2007  – 2010 Valedictorian, Class of December 2010. \nAwarded \"Highest Ranking Senior\" of The Poole College of Management. \n\"Student of the Year\" Finalist. \n \nRelevant coursework: marketing fundamentals, marketing research, international marketing, marketing strategy, product and brand management, business statistics- intermediate and advanced, accounting, economics, interpersonal communications, corporate finance, personal finance- intermediate and advanced, communication for business management, business ethics, and business law. Honors & Awards ", "Summary Currently working in Worldwide Services FP&A within Cisco's Finance Rotational Program. My future plans include running a business within a field I am passionate about alongside other ambitious people! Summary Currently working in Worldwide Services FP&A within Cisco's Finance Rotational Program. My future plans include running a business within a field I am passionate about alongside other ambitious people! Currently working in Worldwide Services FP&A within Cisco's Finance Rotational Program. My future plans include running a business within a field I am passionate about alongside other ambitious people! Currently working in Worldwide Services FP&A within Cisco's Finance Rotational Program. My future plans include running a business within a field I am passionate about alongside other ambitious people! Experience Financial Analyst Cisco March 2015  – Present (6 months) San Jose, CA Cisco Finance Rotational Program \n \nWorldwide Services FP&A (Mar'15-Current) \n \n• Provide budget management and expense forecasting support to Cisco Global Strategy Development and Operations (GSDO) organization \n• Consolidate and process all US & Canada month-end journal entries for Cisco Services departments \n• Prepare balance sheet account reconciliations for corporate accounting team and investigate drivers of balance changes Financial Analyst Cisco September 2014  –  February 2015  (6 months) San Jose, CA Cisco Finance Rotational Program \n \nSupply Chain Finance (Aug'14- Feb'15) \n \n• Streamlined and refined financial health assessment process for Cisco’s EMS partners- a risk assessment centered around a deep dive into partners’ financial statements \n• Managed OpEx for Logistics/Manufacturing team with over $15M annual spend \n• Presented business partners with scenario modeling, affordability analysis, and accounting support on an ongoing basis \n• Created and distributed earnings summaries for Cisco's major EMS partners and contributed additional insight into Cisco-specific market segments and partners’ impact on Cisco Financial Analyst Cisco May 2013  –  August 2014  (1 year 4 months) San Jose, CA Cisco Finance Rotational Program \n \nCorporate Financial Planning & Analysis- OPEX (May13-Aug14) \n \n• Built an OPEX spend-per-head model to promote accelerated reporting \n• Improved and streamlined semi-monthly transactional foreign-exchange file to support corporate treasury hedging based on currency valuation and transactional trends \n• Wrote Essbase and Business Objects queries to facilitate corporate headcount consolidation reporting \n• Provided C-level management adaptable, focused weekly headcount metrics to permit functional, geographic, and grade level analysis Cost Management Financial Analyst Pratt & Whitney June 2012  –  April 2013  (11 months) Greater San Diego Area • Developed and analyzed new, custom period cost reports for executive management, ensuring costs and credits were properly categorized in general ledger accounts \n• Investigated purchase price variances for all AeroPower parts; forecasted cost reduction transition part savings, and led month-end reconciliation with corporate finance team \n• Facilitated standard cost-setting process for San Diego branch plant which impacted cost of sales in excess of $350 million and inventory re-valuation Intern-Cost Reduction/Aftermarket Hamilton Sundstrand April 2011  –  May 2012  (1 year 2 months) Greater San Diego Area • Created a department-wide financial forecasting model for spend/save on major sourcing projects \n• Was exposed to the global sourcing and aftermarket sides of aerospace production, along with corporate operational processes Property Preservation Coordinator Jamor Enterprises LLC May 2010  –  December 2010  (8 months) Upland, CA/ San Diego, CA • Acted as a means of communication between contractors and banks \n• Supported the upkeep of properties and make them available for re-sale Intern LPL Financial February 2010  –  May 2010  (4 months) Greater San Diego Area • Learned the process of client acquisition, development of a financial plan, how to manage client relationships, and basic investment tools Student-Athlete Mathematics Tutor University of San Diego September 2009  –  January 2010  (5 months) Greater San Diego Area • Tutored student-athletes in various math classes such as Multivariable Calculus, Single-Variable Calculus, Intermediate Algebra, Math Logic, and Survey of Calculus. Financial Analyst Cisco March 2015  – Present (6 months) San Jose, CA Cisco Finance Rotational Program \n \nWorldwide Services FP&A (Mar'15-Current) \n \n• Provide budget management and expense forecasting support to Cisco Global Strategy Development and Operations (GSDO) organization \n• Consolidate and process all US & Canada month-end journal entries for Cisco Services departments \n• Prepare balance sheet account reconciliations for corporate accounting team and investigate drivers of balance changes Financial Analyst Cisco March 2015  – Present (6 months) San Jose, CA Cisco Finance Rotational Program \n \nWorldwide Services FP&A (Mar'15-Current) \n \n• Provide budget management and expense forecasting support to Cisco Global Strategy Development and Operations (GSDO) organization \n• Consolidate and process all US & Canada month-end journal entries for Cisco Services departments \n• Prepare balance sheet account reconciliations for corporate accounting team and investigate drivers of balance changes Financial Analyst Cisco September 2014  –  February 2015  (6 months) San Jose, CA Cisco Finance Rotational Program \n \nSupply Chain Finance (Aug'14- Feb'15) \n \n• Streamlined and refined financial health assessment process for Cisco’s EMS partners- a risk assessment centered around a deep dive into partners’ financial statements \n• Managed OpEx for Logistics/Manufacturing team with over $15M annual spend \n• Presented business partners with scenario modeling, affordability analysis, and accounting support on an ongoing basis \n• Created and distributed earnings summaries for Cisco's major EMS partners and contributed additional insight into Cisco-specific market segments and partners’ impact on Cisco Financial Analyst Cisco September 2014  –  February 2015  (6 months) San Jose, CA Cisco Finance Rotational Program \n \nSupply Chain Finance (Aug'14- Feb'15) \n \n• Streamlined and refined financial health assessment process for Cisco’s EMS partners- a risk assessment centered around a deep dive into partners’ financial statements \n• Managed OpEx for Logistics/Manufacturing team with over $15M annual spend \n• Presented business partners with scenario modeling, affordability analysis, and accounting support on an ongoing basis \n• Created and distributed earnings summaries for Cisco's major EMS partners and contributed additional insight into Cisco-specific market segments and partners’ impact on Cisco Financial Analyst Cisco May 2013  –  August 2014  (1 year 4 months) San Jose, CA Cisco Finance Rotational Program \n \nCorporate Financial Planning & Analysis- OPEX (May13-Aug14) \n \n• Built an OPEX spend-per-head model to promote accelerated reporting \n• Improved and streamlined semi-monthly transactional foreign-exchange file to support corporate treasury hedging based on currency valuation and transactional trends \n• Wrote Essbase and Business Objects queries to facilitate corporate headcount consolidation reporting \n• Provided C-level management adaptable, focused weekly headcount metrics to permit functional, geographic, and grade level analysis Financial Analyst Cisco May 2013  –  August 2014  (1 year 4 months) San Jose, CA Cisco Finance Rotational Program \n \nCorporate Financial Planning & Analysis- OPEX (May13-Aug14) \n \n• Built an OPEX spend-per-head model to promote accelerated reporting \n• Improved and streamlined semi-monthly transactional foreign-exchange file to support corporate treasury hedging based on currency valuation and transactional trends \n• Wrote Essbase and Business Objects queries to facilitate corporate headcount consolidation reporting \n• Provided C-level management adaptable, focused weekly headcount metrics to permit functional, geographic, and grade level analysis Cost Management Financial Analyst Pratt & Whitney June 2012  –  April 2013  (11 months) Greater San Diego Area • Developed and analyzed new, custom period cost reports for executive management, ensuring costs and credits were properly categorized in general ledger accounts \n• Investigated purchase price variances for all AeroPower parts; forecasted cost reduction transition part savings, and led month-end reconciliation with corporate finance team \n• Facilitated standard cost-setting process for San Diego branch plant which impacted cost of sales in excess of $350 million and inventory re-valuation Cost Management Financial Analyst Pratt & Whitney June 2012  –  April 2013  (11 months) Greater San Diego Area • Developed and analyzed new, custom period cost reports for executive management, ensuring costs and credits were properly categorized in general ledger accounts \n• Investigated purchase price variances for all AeroPower parts; forecasted cost reduction transition part savings, and led month-end reconciliation with corporate finance team \n• Facilitated standard cost-setting process for San Diego branch plant which impacted cost of sales in excess of $350 million and inventory re-valuation Intern-Cost Reduction/Aftermarket Hamilton Sundstrand April 2011  –  May 2012  (1 year 2 months) Greater San Diego Area • Created a department-wide financial forecasting model for spend/save on major sourcing projects \n• Was exposed to the global sourcing and aftermarket sides of aerospace production, along with corporate operational processes Intern-Cost Reduction/Aftermarket Hamilton Sundstrand April 2011  –  May 2012  (1 year 2 months) Greater San Diego Area • Created a department-wide financial forecasting model for spend/save on major sourcing projects \n• Was exposed to the global sourcing and aftermarket sides of aerospace production, along with corporate operational processes Property Preservation Coordinator Jamor Enterprises LLC May 2010  –  December 2010  (8 months) Upland, CA/ San Diego, CA • Acted as a means of communication between contractors and banks \n• Supported the upkeep of properties and make them available for re-sale Property Preservation Coordinator Jamor Enterprises LLC May 2010  –  December 2010  (8 months) Upland, CA/ San Diego, CA • Acted as a means of communication between contractors and banks \n• Supported the upkeep of properties and make them available for re-sale Intern LPL Financial February 2010  –  May 2010  (4 months) Greater San Diego Area • Learned the process of client acquisition, development of a financial plan, how to manage client relationships, and basic investment tools Intern LPL Financial February 2010  –  May 2010  (4 months) Greater San Diego Area • Learned the process of client acquisition, development of a financial plan, how to manage client relationships, and basic investment tools Student-Athlete Mathematics Tutor University of San Diego September 2009  –  January 2010  (5 months) Greater San Diego Area • Tutored student-athletes in various math classes such as Multivariable Calculus, Single-Variable Calculus, Intermediate Algebra, Math Logic, and Survey of Calculus. Student-Athlete Mathematics Tutor University of San Diego September 2009  –  January 2010  (5 months) Greater San Diego Area • Tutored student-athletes in various math classes such as Multivariable Calculus, Single-Variable Calculus, Intermediate Algebra, Math Logic, and Survey of Calculus. Skills PowerPoint Microsoft Word Mathematical Analysis Microsoft Excel Access Data Analysis Microsoft Office Financial Analysis Budgets Supply Chain Management Essbase Plan-It Trend Analysis FX Hedging FX Rate Models Business Objects Finance Financial Modeling Analysis See 4+     See less Skills  PowerPoint Microsoft Word Mathematical Analysis Microsoft Excel Access Data Analysis Microsoft Office Financial Analysis Budgets Supply Chain Management Essbase Plan-It Trend Analysis FX Hedging FX Rate Models Business Objects Finance Financial Modeling Analysis See 4+     See less PowerPoint Microsoft Word Mathematical Analysis Microsoft Excel Access Data Analysis Microsoft Office Financial Analysis Budgets Supply Chain Management Essbase Plan-It Trend Analysis FX Hedging FX Rate Models Business Objects Finance Financial Modeling Analysis See 4+     See less PowerPoint Microsoft Word Mathematical Analysis Microsoft Excel Access Data Analysis Microsoft Office Financial Analysis Budgets Supply Chain Management Essbase Plan-It Trend Analysis FX Hedging FX Rate Models Business Objects Finance Financial Modeling Analysis See 4+     See less Education University of San Diego Bachelor of Business Administration (B.B.A.),  Business/Managerial Economics 2008  – 2012 University of San Diego Bachelor of Business Administration (B.B.A.),  Business/Managerial Economics 2008  – 2012 University of San Diego Bachelor of Business Administration (B.B.A.),  Business/Managerial Economics 2008  – 2012 University of San Diego Bachelor of Business Administration (B.B.A.),  Business/Managerial Economics 2008  – 2012 Honors & Awards Additional Honors & Awards University of San Diego School of Business Scholastic Award - Business Economics (highest GPA for major); University of San Diego Honors Program graduate; University of San Diego Trustee Scholarship 2008-2012; University of San Diego Dean's List, First Honors: Fall 2009, Spring 2010, Fall 2011; University of San Diego Dean's List, Second Honors: Spring 2009, Fall 2010, Spring 2011; Damien High School Differential Equations Top Student Award (2008) Additional Honors & Awards University of San Diego School of Business Scholastic Award - Business Economics (highest GPA for major); University of San Diego Honors Program graduate; University of San Diego Trustee Scholarship 2008-2012; University of San Diego Dean's List, First Honors: Fall 2009, Spring 2010, Fall 2011; University of San Diego Dean's List, Second Honors: Spring 2009, Fall 2010, Spring 2011; Damien High School Differential Equations Top Student Award (2008) Additional Honors & Awards University of San Diego School of Business Scholastic Award - Business Economics (highest GPA for major); University of San Diego Honors Program graduate; University of San Diego Trustee Scholarship 2008-2012; University of San Diego Dean's List, First Honors: Fall 2009, Spring 2010, Fall 2011; University of San Diego Dean's List, Second Honors: Spring 2009, Fall 2010, Spring 2011; Damien High School Differential Equations Top Student Award (2008) Additional Honors & Awards University of San Diego School of Business Scholastic Award - Business Economics (highest GPA for major); University of San Diego Honors Program graduate; University of San Diego Trustee Scholarship 2008-2012; University of San Diego Dean's List, First Honors: Fall 2009, Spring 2010, Fall 2011; University of San Diego Dean's List, Second Honors: Spring 2009, Fall 2010, Spring 2011; Damien High School Differential Equations Top Student Award (2008) ", "Summary I'm an experienced senior financial analyst with expertise in budget planning and forecasting, general ledger and accounts payable. Effective in managing the month-end and quarter-end close, driving the quarterly and yearly planning process. Proven track record in providing financial analysis to meet the other business groups to be able to manage and track their investment in people and programs. Proficient in Accounting Programs including Oracle Rel. 11i & r12, SQL navigator, Equity Edge, Hyperion Essbase, Summary I'm an experienced senior financial analyst with expertise in budget planning and forecasting, general ledger and accounts payable. Effective in managing the month-end and quarter-end close, driving the quarterly and yearly planning process. Proven track record in providing financial analysis to meet the other business groups to be able to manage and track their investment in people and programs. Proficient in Accounting Programs including Oracle Rel. 11i & r12, SQL navigator, Equity Edge, Hyperion Essbase, I'm an experienced senior financial analyst with expertise in budget planning and forecasting, general ledger and accounts payable. Effective in managing the month-end and quarter-end close, driving the quarterly and yearly planning process. Proven track record in providing financial analysis to meet the other business groups to be able to manage and track their investment in people and programs. Proficient in Accounting Programs including Oracle Rel. 11i & r12, SQL navigator, Equity Edge, Hyperion Essbase, I'm an experienced senior financial analyst with expertise in budget planning and forecasting, general ledger and accounts payable. Effective in managing the month-end and quarter-end close, driving the quarterly and yearly planning process. Proven track record in providing financial analysis to meet the other business groups to be able to manage and track their investment in people and programs. Proficient in Accounting Programs including Oracle Rel. 11i & r12, SQL navigator, Equity Edge, Hyperion Essbase, Experience Sr. Financial Analyst Cisco June 2014  – Present (1 year 3 months) San Jose AP Analyst Twitter 2014  –  2014  (less than a year) Financial Analyst Cisco Systems August 2008  –  May 2013  (4 years 10 months) San Jose, CA Partnered with the Global Business Services (GBS) teams to provide them with financial support which included: managing the month-end and quarter-end close, driving the quarterly and yearly planning process, and proving ad hoc analysis to meet the reporting requirements of the teams in order for them to be able to manage and track their investment in people and programs. Additionally, I educated the teams on strong financial and business controls, including PO and accrual management, budgeting, and forecasting. \n \n•Performed a consolidated PO accrual process and vouchered-off $15M to $20M on a monthly and quarterly basis for the Global Sales Operation Group (GSO). \n•Processed intercompany and other cross charges, non PO and manual accruals, and Balance Sheet account reconciliation.  \n•Provided accurate and reliable financial planning and analysis support for a $65M annual budget including headcount and operating expenses, forecasting and budgeting for GSO on a monthly basis.  \n•Managed the annual and quarterly budget recommit planning for various groups and used Plan-it (longview) to load budget changes. \n•Delivered capacity planning and vendor analysis reporting for outside services for a quarterly $25M budget. Financial Analyst Cisco Systems August 1997  –  July 2008  (11 years) Sa Jose, CA Successfully managed 200 plus independent external supplier where I delivered on a daily basis the following: supplier payments on-or-before the scheduled deadline, accurately accounted for vendor liabilities, and ensured that issues are dealt with in a timely manner. In addition to my daily responsibilities, I resolved old invoices that were previously on-hold and kept the number of invoices on-hold to a minimum. I reviewed and researched un-invoiced receipts and provided additional support to the team for month end closes. \n \n•Researched un-invoiced receipts against supplier statements and vouchered-off $41.5M worth of old receipts that resulted in reducing the company’s liability. \n•Audited complex vendor accounts, maintained zero invoices over 200 days old, and improved customer relations which resulted in the satisfaction of the suppliers. \n•Partnered with external auditors for S-ox review on the work flow process in order reduce invoices on hold. \n•Managed the American Express account for the entire company including working cross-functionally with the travel department to avoid late charges on invoice which saved the company money.\t \n•Assisted the IT department in the development of the OSI (On-line supplier inquiry) tool which was then used by company employees and outside suppliers to facilitate timely invoice and payment inquiries. This tool provided PO statuses along with the ability to print the supplier Invoice On-hold Report when needed which resulted in employee’s proficiency as it freed up time. \n•Preformed preliminary testing on behalf of the company for a Web electric commerce (Web EC) invoicing tool that the company had create but not yet released to the suppliers. This tool allowed suppliers to send invoices electronically which allowed them to receive payments within the invoice terms. Supervisor, Accounts Payable & Receivable Boole and Babbage 1991  –  1996  (5 years) San Jose, CA Managed an accounts payable and receivable team consisting of four people. Responsible for AP and AR closings, audit, input and payment for employee expense reports, reconciling month end related and other accounts like bank recon and long/short term leases. Reviewed and compiled quarterly and yearly reports for auditors. Implemented the conversion from ADP AR system to the Oracle AR/RA system. Set up processes and policies for the accounts receivable. \n \n•Implemented the conversion from ADP AR system to the Oracle AR/RA system. Set up processes and policies for the accounts receivable which resulted in internal control of accounts receivable for the company. \n•Maintained Fixed Asset Sub Ledger using Oracle and FAS systems, and reconciled fixed asset accounts. \n•Reconciled and maintained the following on a monthly and quarterly basis which resulted in a 5-day close instead of a 2-weeks close: bank accounts, notes receivable, unapplied cash, interest expense, unrealized gain & loss, tax withholding, AP trade account, accrued rents, travel advance, operating leases, prepaid expenses, deposit accounts for accounts payable, and deferred interest schedules and long term/short term split leases for revenue accounting. Sr. Financial Analyst Cisco June 2014  – Present (1 year 3 months) San Jose Sr. Financial Analyst Cisco June 2014  – Present (1 year 3 months) San Jose AP Analyst Twitter 2014  –  2014  (less than a year) AP Analyst Twitter 2014  –  2014  (less than a year) Financial Analyst Cisco Systems August 2008  –  May 2013  (4 years 10 months) San Jose, CA Partnered with the Global Business Services (GBS) teams to provide them with financial support which included: managing the month-end and quarter-end close, driving the quarterly and yearly planning process, and proving ad hoc analysis to meet the reporting requirements of the teams in order for them to be able to manage and track their investment in people and programs. Additionally, I educated the teams on strong financial and business controls, including PO and accrual management, budgeting, and forecasting. \n \n•Performed a consolidated PO accrual process and vouchered-off $15M to $20M on a monthly and quarterly basis for the Global Sales Operation Group (GSO). \n•Processed intercompany and other cross charges, non PO and manual accruals, and Balance Sheet account reconciliation.  \n•Provided accurate and reliable financial planning and analysis support for a $65M annual budget including headcount and operating expenses, forecasting and budgeting for GSO on a monthly basis.  \n•Managed the annual and quarterly budget recommit planning for various groups and used Plan-it (longview) to load budget changes. \n•Delivered capacity planning and vendor analysis reporting for outside services for a quarterly $25M budget. Financial Analyst Cisco Systems August 2008  –  May 2013  (4 years 10 months) San Jose, CA Partnered with the Global Business Services (GBS) teams to provide them with financial support which included: managing the month-end and quarter-end close, driving the quarterly and yearly planning process, and proving ad hoc analysis to meet the reporting requirements of the teams in order for them to be able to manage and track their investment in people and programs. Additionally, I educated the teams on strong financial and business controls, including PO and accrual management, budgeting, and forecasting. \n \n•Performed a consolidated PO accrual process and vouchered-off $15M to $20M on a monthly and quarterly basis for the Global Sales Operation Group (GSO). \n•Processed intercompany and other cross charges, non PO and manual accruals, and Balance Sheet account reconciliation.  \n•Provided accurate and reliable financial planning and analysis support for a $65M annual budget including headcount and operating expenses, forecasting and budgeting for GSO on a monthly basis.  \n•Managed the annual and quarterly budget recommit planning for various groups and used Plan-it (longview) to load budget changes. \n•Delivered capacity planning and vendor analysis reporting for outside services for a quarterly $25M budget. Financial Analyst Cisco Systems August 1997  –  July 2008  (11 years) Sa Jose, CA Successfully managed 200 plus independent external supplier where I delivered on a daily basis the following: supplier payments on-or-before the scheduled deadline, accurately accounted for vendor liabilities, and ensured that issues are dealt with in a timely manner. In addition to my daily responsibilities, I resolved old invoices that were previously on-hold and kept the number of invoices on-hold to a minimum. I reviewed and researched un-invoiced receipts and provided additional support to the team for month end closes. \n \n•Researched un-invoiced receipts against supplier statements and vouchered-off $41.5M worth of old receipts that resulted in reducing the company’s liability. \n•Audited complex vendor accounts, maintained zero invoices over 200 days old, and improved customer relations which resulted in the satisfaction of the suppliers. \n•Partnered with external auditors for S-ox review on the work flow process in order reduce invoices on hold. \n•Managed the American Express account for the entire company including working cross-functionally with the travel department to avoid late charges on invoice which saved the company money.\t \n•Assisted the IT department in the development of the OSI (On-line supplier inquiry) tool which was then used by company employees and outside suppliers to facilitate timely invoice and payment inquiries. This tool provided PO statuses along with the ability to print the supplier Invoice On-hold Report when needed which resulted in employee’s proficiency as it freed up time. \n•Preformed preliminary testing on behalf of the company for a Web electric commerce (Web EC) invoicing tool that the company had create but not yet released to the suppliers. This tool allowed suppliers to send invoices electronically which allowed them to receive payments within the invoice terms. Financial Analyst Cisco Systems August 1997  –  July 2008  (11 years) Sa Jose, CA Successfully managed 200 plus independent external supplier where I delivered on a daily basis the following: supplier payments on-or-before the scheduled deadline, accurately accounted for vendor liabilities, and ensured that issues are dealt with in a timely manner. In addition to my daily responsibilities, I resolved old invoices that were previously on-hold and kept the number of invoices on-hold to a minimum. I reviewed and researched un-invoiced receipts and provided additional support to the team for month end closes. \n \n•Researched un-invoiced receipts against supplier statements and vouchered-off $41.5M worth of old receipts that resulted in reducing the company’s liability. \n•Audited complex vendor accounts, maintained zero invoices over 200 days old, and improved customer relations which resulted in the satisfaction of the suppliers. \n•Partnered with external auditors for S-ox review on the work flow process in order reduce invoices on hold. \n•Managed the American Express account for the entire company including working cross-functionally with the travel department to avoid late charges on invoice which saved the company money.\t \n•Assisted the IT department in the development of the OSI (On-line supplier inquiry) tool which was then used by company employees and outside suppliers to facilitate timely invoice and payment inquiries. This tool provided PO statuses along with the ability to print the supplier Invoice On-hold Report when needed which resulted in employee’s proficiency as it freed up time. \n•Preformed preliminary testing on behalf of the company for a Web electric commerce (Web EC) invoicing tool that the company had create but not yet released to the suppliers. This tool allowed suppliers to send invoices electronically which allowed them to receive payments within the invoice terms. Supervisor, Accounts Payable & Receivable Boole and Babbage 1991  –  1996  (5 years) San Jose, CA Managed an accounts payable and receivable team consisting of four people. Responsible for AP and AR closings, audit, input and payment for employee expense reports, reconciling month end related and other accounts like bank recon and long/short term leases. Reviewed and compiled quarterly and yearly reports for auditors. Implemented the conversion from ADP AR system to the Oracle AR/RA system. Set up processes and policies for the accounts receivable. \n \n•Implemented the conversion from ADP AR system to the Oracle AR/RA system. Set up processes and policies for the accounts receivable which resulted in internal control of accounts receivable for the company. \n•Maintained Fixed Asset Sub Ledger using Oracle and FAS systems, and reconciled fixed asset accounts. \n•Reconciled and maintained the following on a monthly and quarterly basis which resulted in a 5-day close instead of a 2-weeks close: bank accounts, notes receivable, unapplied cash, interest expense, unrealized gain & loss, tax withholding, AP trade account, accrued rents, travel advance, operating leases, prepaid expenses, deposit accounts for accounts payable, and deferred interest schedules and long term/short term split leases for revenue accounting. Supervisor, Accounts Payable & Receivable Boole and Babbage 1991  –  1996  (5 years) San Jose, CA Managed an accounts payable and receivable team consisting of four people. Responsible for AP and AR closings, audit, input and payment for employee expense reports, reconciling month end related and other accounts like bank recon and long/short term leases. Reviewed and compiled quarterly and yearly reports for auditors. Implemented the conversion from ADP AR system to the Oracle AR/RA system. Set up processes and policies for the accounts receivable. \n \n•Implemented the conversion from ADP AR system to the Oracle AR/RA system. Set up processes and policies for the accounts receivable which resulted in internal control of accounts receivable for the company. \n•Maintained Fixed Asset Sub Ledger using Oracle and FAS systems, and reconciled fixed asset accounts. \n•Reconciled and maintained the following on a monthly and quarterly basis which resulted in a 5-day close instead of a 2-weeks close: bank accounts, notes receivable, unapplied cash, interest expense, unrealized gain & loss, tax withholding, AP trade account, accrued rents, travel advance, operating leases, prepaid expenses, deposit accounts for accounts payable, and deferred interest schedules and long term/short term split leases for revenue accounting. Languages Hindi Hindi Hindi Skills Finance Forecasting Revenue Recognition Sarbanes-Oxley Act Financial Analysis Oracle E-Business Suite Cross-functional Team... Variance Analysis Process Improvement Oracle Applications Vendor Management Analysis Business Analysis Financial Reporting Program Management Business Process... Accounts Payable Accounting Accounts Receivable Auditing Budgets General Ledger Financial Modeling Fixed Assets Account Reconciliation Invoicing Accruals Cost Accounting Internal Audit See 14+     See less Skills  Finance Forecasting Revenue Recognition Sarbanes-Oxley Act Financial Analysis Oracle E-Business Suite Cross-functional Team... Variance Analysis Process Improvement Oracle Applications Vendor Management Analysis Business Analysis Financial Reporting Program Management Business Process... Accounts Payable Accounting Accounts Receivable Auditing Budgets General Ledger Financial Modeling Fixed Assets Account Reconciliation Invoicing Accruals Cost Accounting Internal Audit See 14+     See less Finance Forecasting Revenue Recognition Sarbanes-Oxley Act Financial Analysis Oracle E-Business Suite Cross-functional Team... Variance Analysis Process Improvement Oracle Applications Vendor Management Analysis Business Analysis Financial Reporting Program Management Business Process... Accounts Payable Accounting Accounts Receivable Auditing Budgets General Ledger Financial Modeling Fixed Assets Account Reconciliation Invoicing Accruals Cost Accounting Internal Audit See 14+     See less Finance Forecasting Revenue Recognition Sarbanes-Oxley Act Financial Analysis Oracle E-Business Suite Cross-functional Team... Variance Analysis Process Improvement Oracle Applications Vendor Management Analysis Business Analysis Financial Reporting Program Management Business Process... Accounts Payable Accounting Accounts Receivable Auditing Budgets General Ledger Financial Modeling Fixed Assets Account Reconciliation Invoicing Accruals Cost Accounting Internal Audit See 14+     See less Education Gujarat University Bachelor of Arts (BA),  Accounting and Finance Gujarat University Bachelor of Arts (BA),  Accounting and Finance Gujarat University Bachelor of Arts (BA),  Accounting and Finance Gujarat University Bachelor of Arts (BA),  Accounting and Finance ", "Summary More than Two Years combined experience in Sales Finance, Corporate Finance, Program Management and Data Analysis. \nTwelve years of Process Development, Applications Development & Customer Management experience in semiconductor industry. \nProficient in Business Objects and advanced Excel including pivot tables, lookups.  \nQuick learner, problem solver and a positive work attitude. \nExtensive global customer interaction experience. Excellent communication skills. Specialties:Finance, Business Analyst, Program Manager Summary More than Two Years combined experience in Sales Finance, Corporate Finance, Program Management and Data Analysis. \nTwelve years of Process Development, Applications Development & Customer Management experience in semiconductor industry. \nProficient in Business Objects and advanced Excel including pivot tables, lookups.  \nQuick learner, problem solver and a positive work attitude. \nExtensive global customer interaction experience. Excellent communication skills. Specialties:Finance, Business Analyst, Program Manager More than Two Years combined experience in Sales Finance, Corporate Finance, Program Management and Data Analysis. \nTwelve years of Process Development, Applications Development & Customer Management experience in semiconductor industry. \nProficient in Business Objects and advanced Excel including pivot tables, lookups.  \nQuick learner, problem solver and a positive work attitude. \nExtensive global customer interaction experience. Excellent communication skills. Specialties:Finance, Business Analyst, Program Manager More than Two Years combined experience in Sales Finance, Corporate Finance, Program Management and Data Analysis. \nTwelve years of Process Development, Applications Development & Customer Management experience in semiconductor industry. \nProficient in Business Objects and advanced Excel including pivot tables, lookups.  \nQuick learner, problem solver and a positive work attitude. \nExtensive global customer interaction experience. Excellent communication skills. Specialties:Finance, Business Analyst, Program Manager Experience Senior Financial Analyst Cisco Systems January 2012  – Present (3 years 8 months) San Jose,CA Providing Weekly, Monthly and Quarterly forecast for the US Small Business Sales Team. Created forecast model. \nPreparing monthly and quarterly executive updates. \nUsing Business Intelligence and Data Analysis to analyze Bookings trends, discount and margin. \nWorking with Opex team to keep expenses inline Financial Analyst Cisco Systems 2012  –  2012  (less than a year) Business Analyst InPlace Remarketing, Cisco Capital, Cisco Systems February 2011  –  July 2011  (6 months) Created a tracker in Excel for a $150M account to reconcile quarterly asset changes by location to calculate tax and rent. \nDetermined the major cause of data integrity issues in our asset reporting system through extensive data reconciliation and analysis. \nSupported the US team in the end of lease process specifically in bankruptcy related issues, quoting and invoicing. \nImproved customer satisfaction and productivity both internally as well as externally with leasing managers and customers through timely asset reports and lease summaries. Data Analyst Cisco Systems April 2010  –  January 2011  (10 months) Improved fulfillment metrics by a factor of two, from 4-6 months to two months, for the Foreign Military Financing program. \nCreated Monthly and Quarterly Metrics reports in Business Objects on Lead Time, On Time Shipment, Order Saturation and Adoption. Financial Analyst Cisco Systems November 2009  –  April 2010  (6 months) Drove consolidation of revenues and margins for the Service Provide Business Unit and published Monthly Bookings Forecast and Margins Forecast.  \nPublished weekly bookings pipeline report. Provided Business Level commentary of forecast. Gained expertise with Business Objects, Hyperion Essbase. \nDrove budgeting, marketing forecast. Helped in Budget allocation for capex and opex.  \nWorked with product marketing and demand planning on monthly forecasting. Applications Technologist Revera September 2004  –  February 2009  (4 years 6 months) Drove revenue recognition and global customer tool acceptance as a key member of the Applications Team. Improved global customer satisfaction significantly. \nLeader of Demos for customers including planning, data collection and reporting results, to support sales and bookings. Resulted in multiple tool orders from leading semiconductor manufacturers.  \nDeveloped new measurement protocols that improved throughput and Cost of Ownership, by reducing measurement time in half. Process Engineer Applied Materials March 2003  –  September 2004  (1 year 7 months) Improved operational efficiency that increased equipment uptime of semiconductor lithography cluster by 30%. \nKey member of Engineering Task Force that reduced defects and process excursions in pilot semiconductor manufacturing by 20%. Senior Design Engineer ASML Track Division March 1997  –  March 2003  (6 years 1 month) R & D Leader on teams that improved process uniformity by 30% and also enabled reduction in chemical consumption. \nKey member of technical team that reduced process time by more than 40% and reduced defect density by factor of 2 in advanced semiconductor processing. Senior Financial Analyst Cisco Systems January 2012  – Present (3 years 8 months) San Jose,CA Providing Weekly, Monthly and Quarterly forecast for the US Small Business Sales Team. Created forecast model. \nPreparing monthly and quarterly executive updates. \nUsing Business Intelligence and Data Analysis to analyze Bookings trends, discount and margin. \nWorking with Opex team to keep expenses inline Senior Financial Analyst Cisco Systems January 2012  – Present (3 years 8 months) San Jose,CA Providing Weekly, Monthly and Quarterly forecast for the US Small Business Sales Team. Created forecast model. \nPreparing monthly and quarterly executive updates. \nUsing Business Intelligence and Data Analysis to analyze Bookings trends, discount and margin. \nWorking with Opex team to keep expenses inline Financial Analyst Cisco Systems 2012  –  2012  (less than a year) Financial Analyst Cisco Systems 2012  –  2012  (less than a year) Business Analyst InPlace Remarketing, Cisco Capital, Cisco Systems February 2011  –  July 2011  (6 months) Created a tracker in Excel for a $150M account to reconcile quarterly asset changes by location to calculate tax and rent. \nDetermined the major cause of data integrity issues in our asset reporting system through extensive data reconciliation and analysis. \nSupported the US team in the end of lease process specifically in bankruptcy related issues, quoting and invoicing. \nImproved customer satisfaction and productivity both internally as well as externally with leasing managers and customers through timely asset reports and lease summaries. Business Analyst InPlace Remarketing, Cisco Capital, Cisco Systems February 2011  –  July 2011  (6 months) Created a tracker in Excel for a $150M account to reconcile quarterly asset changes by location to calculate tax and rent. \nDetermined the major cause of data integrity issues in our asset reporting system through extensive data reconciliation and analysis. \nSupported the US team in the end of lease process specifically in bankruptcy related issues, quoting and invoicing. \nImproved customer satisfaction and productivity both internally as well as externally with leasing managers and customers through timely asset reports and lease summaries. Data Analyst Cisco Systems April 2010  –  January 2011  (10 months) Improved fulfillment metrics by a factor of two, from 4-6 months to two months, for the Foreign Military Financing program. \nCreated Monthly and Quarterly Metrics reports in Business Objects on Lead Time, On Time Shipment, Order Saturation and Adoption. Data Analyst Cisco Systems April 2010  –  January 2011  (10 months) Improved fulfillment metrics by a factor of two, from 4-6 months to two months, for the Foreign Military Financing program. \nCreated Monthly and Quarterly Metrics reports in Business Objects on Lead Time, On Time Shipment, Order Saturation and Adoption. Financial Analyst Cisco Systems November 2009  –  April 2010  (6 months) Drove consolidation of revenues and margins for the Service Provide Business Unit and published Monthly Bookings Forecast and Margins Forecast.  \nPublished weekly bookings pipeline report. Provided Business Level commentary of forecast. Gained expertise with Business Objects, Hyperion Essbase. \nDrove budgeting, marketing forecast. Helped in Budget allocation for capex and opex.  \nWorked with product marketing and demand planning on monthly forecasting. Financial Analyst Cisco Systems November 2009  –  April 2010  (6 months) Drove consolidation of revenues and margins for the Service Provide Business Unit and published Monthly Bookings Forecast and Margins Forecast.  \nPublished weekly bookings pipeline report. Provided Business Level commentary of forecast. Gained expertise with Business Objects, Hyperion Essbase. \nDrove budgeting, marketing forecast. Helped in Budget allocation for capex and opex.  \nWorked with product marketing and demand planning on monthly forecasting. Applications Technologist Revera September 2004  –  February 2009  (4 years 6 months) Drove revenue recognition and global customer tool acceptance as a key member of the Applications Team. Improved global customer satisfaction significantly. \nLeader of Demos for customers including planning, data collection and reporting results, to support sales and bookings. Resulted in multiple tool orders from leading semiconductor manufacturers.  \nDeveloped new measurement protocols that improved throughput and Cost of Ownership, by reducing measurement time in half. Applications Technologist Revera September 2004  –  February 2009  (4 years 6 months) Drove revenue recognition and global customer tool acceptance as a key member of the Applications Team. Improved global customer satisfaction significantly. \nLeader of Demos for customers including planning, data collection and reporting results, to support sales and bookings. Resulted in multiple tool orders from leading semiconductor manufacturers.  \nDeveloped new measurement protocols that improved throughput and Cost of Ownership, by reducing measurement time in half. Process Engineer Applied Materials March 2003  –  September 2004  (1 year 7 months) Improved operational efficiency that increased equipment uptime of semiconductor lithography cluster by 30%. \nKey member of Engineering Task Force that reduced defects and process excursions in pilot semiconductor manufacturing by 20%. Process Engineer Applied Materials March 2003  –  September 2004  (1 year 7 months) Improved operational efficiency that increased equipment uptime of semiconductor lithography cluster by 30%. \nKey member of Engineering Task Force that reduced defects and process excursions in pilot semiconductor manufacturing by 20%. Senior Design Engineer ASML Track Division March 1997  –  March 2003  (6 years 1 month) R & D Leader on teams that improved process uniformity by 30% and also enabled reduction in chemical consumption. \nKey member of technical team that reduced process time by more than 40% and reduced defect density by factor of 2 in advanced semiconductor processing. Senior Design Engineer ASML Track Division March 1997  –  March 2003  (6 years 1 month) R & D Leader on teams that improved process uniformity by 30% and also enabled reduction in chemical consumption. \nKey member of technical team that reduced process time by more than 40% and reduced defect density by factor of 2 in advanced semiconductor processing. Skills Analysis Business Intelligence Skills  Analysis Business Intelligence Analysis Business Intelligence Analysis Business Intelligence Education Santa Clara University MBA,  Finance 2006  – 2009 Courses Related to Corporate Finance \n \nRisk Management with Derivative Securities \nBusiness Valuation  \nFinancial Markets and Institutions  \nCorporate Financial Reporting  \nFinancial Accounting  \nInvestments  \nFinancial Management \nSpreadsheet Modeling & Decision Analysis, Statistics Activities and Societies:  Member of Beta Gamma Sigma Society University of Missouri-Columbia M.S,  Chemical Engineering 1994  – 1996 Activities and Societies:  Secretary ,  Cultural Association of India Birla Institute of Technology and Science, Pilani BE,  Chemical Engineering 1989  – 1994 Santa Clara University MBA,  Finance 2006  – 2009 Courses Related to Corporate Finance \n \nRisk Management with Derivative Securities \nBusiness Valuation  \nFinancial Markets and Institutions  \nCorporate Financial Reporting  \nFinancial Accounting  \nInvestments  \nFinancial Management \nSpreadsheet Modeling & Decision Analysis, Statistics Activities and Societies:  Member of Beta Gamma Sigma Society Santa Clara University MBA,  Finance 2006  – 2009 Courses Related to Corporate Finance \n \nRisk Management with Derivative Securities \nBusiness Valuation  \nFinancial Markets and Institutions  \nCorporate Financial Reporting  \nFinancial Accounting  \nInvestments  \nFinancial Management \nSpreadsheet Modeling & Decision Analysis, Statistics Activities and Societies:  Member of Beta Gamma Sigma Society Santa Clara University MBA,  Finance 2006  – 2009 Courses Related to Corporate Finance \n \nRisk Management with Derivative Securities \nBusiness Valuation  \nFinancial Markets and Institutions  \nCorporate Financial Reporting  \nFinancial Accounting  \nInvestments  \nFinancial Management \nSpreadsheet Modeling & Decision Analysis, Statistics Activities and Societies:  Member of Beta Gamma Sigma Society University of Missouri-Columbia M.S,  Chemical Engineering 1994  – 1996 Activities and Societies:  Secretary ,  Cultural Association of India University of Missouri-Columbia M.S,  Chemical Engineering 1994  – 1996 Activities and Societies:  Secretary ,  Cultural Association of India University of Missouri-Columbia M.S,  Chemical Engineering 1994  – 1996 Activities and Societies:  Secretary ,  Cultural Association of India Birla Institute of Technology and Science, Pilani BE,  Chemical Engineering 1989  – 1994 Birla Institute of Technology and Science, Pilani BE,  Chemical Engineering 1989  – 1994 Birla Institute of Technology and Science, Pilani BE,  Chemical Engineering 1989  – 1994 ", "Summary Even though the opportunity to go to college was not available to me when I moved in to this country about 12 years ago, I always knew that the only way to accomplish the well-known \"American dream\" was through making sacrifices and never giving up. Through commitment, dedication and the desire of becoming a professional, I was able to complete my Bachelor’s Degree in four years while also working full-time.  \n \nAdditionally, I got involved in various organizations in school, including the Poole College of Management Peer Leaders in which I was introduced to 10 new students who I mentored and guided through their transition to college. I also participated in a Study Abroad Program in Madrid, Spain. This opportunity allowed me to network with people from several countries. Not only this expanded my cultural background, but it also helped me to realize that my desire was to work for a company involved in communications, technology and diversity. \n \nFortunately, when I came back from Spain, I was offered an internship at EMC. My performance in the Finance department enabled me to extend a summer internship into a full year internship. I learned about Fixed Assets management through various ERP systems including ORACLE and SAP. \nAfter graduating in May 2013, I was hired to be part of a Finance Rotation Program (FRP) at Cisco Systems. The participants of this program spend a year in Accounting and a year in Finance with the opportunity to complete training in finance, soft and system skills as well.  \n \nI am currently part of the Business Enablement Accounting Team where I work closely with about 15 Cisco's acquisitions. My team is mainly responsible for the compliance of the acquired companies with GAAP and Corporate Policy. Additionally, my team works with the integration teams to facilitate the assimilation of the acquired companies’ accounting process into the Cisco systems and processes. Summary Even though the opportunity to go to college was not available to me when I moved in to this country about 12 years ago, I always knew that the only way to accomplish the well-known \"American dream\" was through making sacrifices and never giving up. Through commitment, dedication and the desire of becoming a professional, I was able to complete my Bachelor’s Degree in four years while also working full-time.  \n \nAdditionally, I got involved in various organizations in school, including the Poole College of Management Peer Leaders in which I was introduced to 10 new students who I mentored and guided through their transition to college. I also participated in a Study Abroad Program in Madrid, Spain. This opportunity allowed me to network with people from several countries. Not only this expanded my cultural background, but it also helped me to realize that my desire was to work for a company involved in communications, technology and diversity. \n \nFortunately, when I came back from Spain, I was offered an internship at EMC. My performance in the Finance department enabled me to extend a summer internship into a full year internship. I learned about Fixed Assets management through various ERP systems including ORACLE and SAP. \nAfter graduating in May 2013, I was hired to be part of a Finance Rotation Program (FRP) at Cisco Systems. The participants of this program spend a year in Accounting and a year in Finance with the opportunity to complete training in finance, soft and system skills as well.  \n \nI am currently part of the Business Enablement Accounting Team where I work closely with about 15 Cisco's acquisitions. My team is mainly responsible for the compliance of the acquired companies with GAAP and Corporate Policy. Additionally, my team works with the integration teams to facilitate the assimilation of the acquired companies’ accounting process into the Cisco systems and processes. Even though the opportunity to go to college was not available to me when I moved in to this country about 12 years ago, I always knew that the only way to accomplish the well-known \"American dream\" was through making sacrifices and never giving up. Through commitment, dedication and the desire of becoming a professional, I was able to complete my Bachelor’s Degree in four years while also working full-time.  \n \nAdditionally, I got involved in various organizations in school, including the Poole College of Management Peer Leaders in which I was introduced to 10 new students who I mentored and guided through their transition to college. I also participated in a Study Abroad Program in Madrid, Spain. This opportunity allowed me to network with people from several countries. Not only this expanded my cultural background, but it also helped me to realize that my desire was to work for a company involved in communications, technology and diversity. \n \nFortunately, when I came back from Spain, I was offered an internship at EMC. My performance in the Finance department enabled me to extend a summer internship into a full year internship. I learned about Fixed Assets management through various ERP systems including ORACLE and SAP. \nAfter graduating in May 2013, I was hired to be part of a Finance Rotation Program (FRP) at Cisco Systems. The participants of this program spend a year in Accounting and a year in Finance with the opportunity to complete training in finance, soft and system skills as well.  \n \nI am currently part of the Business Enablement Accounting Team where I work closely with about 15 Cisco's acquisitions. My team is mainly responsible for the compliance of the acquired companies with GAAP and Corporate Policy. Additionally, my team works with the integration teams to facilitate the assimilation of the acquired companies’ accounting process into the Cisco systems and processes. Even though the opportunity to go to college was not available to me when I moved in to this country about 12 years ago, I always knew that the only way to accomplish the well-known \"American dream\" was through making sacrifices and never giving up. Through commitment, dedication and the desire of becoming a professional, I was able to complete my Bachelor’s Degree in four years while also working full-time.  \n \nAdditionally, I got involved in various organizations in school, including the Poole College of Management Peer Leaders in which I was introduced to 10 new students who I mentored and guided through their transition to college. I also participated in a Study Abroad Program in Madrid, Spain. This opportunity allowed me to network with people from several countries. Not only this expanded my cultural background, but it also helped me to realize that my desire was to work for a company involved in communications, technology and diversity. \n \nFortunately, when I came back from Spain, I was offered an internship at EMC. My performance in the Finance department enabled me to extend a summer internship into a full year internship. I learned about Fixed Assets management through various ERP systems including ORACLE and SAP. \nAfter graduating in May 2013, I was hired to be part of a Finance Rotation Program (FRP) at Cisco Systems. The participants of this program spend a year in Accounting and a year in Finance with the opportunity to complete training in finance, soft and system skills as well.  \n \nI am currently part of the Business Enablement Accounting Team where I work closely with about 15 Cisco's acquisitions. My team is mainly responsible for the compliance of the acquired companies with GAAP and Corporate Policy. Additionally, my team works with the integration teams to facilitate the assimilation of the acquired companies’ accounting process into the Cisco systems and processes. Experience Financial Analyst, Cisco Capital Accounting Cisco March 2015  – Present (6 months) Raleigh-Durham, North Carolina Area Cisco's Finance Rotation Program: Third Rotation \n•\tResponsible for Pre-owned Equipment accounting monthly activities including remarketing and transfer pricing journal entries as well as balance sheet account reconciliations for each period  \n•\tAccountable for the Mexico OLFM close in a daily basis, which includes running requests and reports in this tool as well as raising IT tickets to clear process errors and rejects \n•\tSupport the main accountant for the Mexico and Canada Captives for Cisco Capital with ad hoc projects including balance sheet account reconciliations, Deloitte monthly audit package, intercompany balances clearance, etc. \n Financial Analyst, WW Services FP&A Cisco September 2014  –  February 2015  (6 months) Raleigh-Durham, North Carolina Area Cisco's Finance Rotation Program: Second Rotation \n \n• Support the Global, Strategy, Development, and Operations (GSDO) organization under Worldwide Services by managing its budget, target allocation and forecasting. \n• Main point of contact to process month-end activities including open PO accruals, reclasses and cross charges. \n• Responsible for the preparation of balance sheet account reconciliations as well as providing feedback to Corporate Accounting during monthly meetings after month-end close. Financial Analyst Cisco August 2013  –  August 2014  (1 year 1 month) Raleigh-Durham, North Carolina Area Cisco's Finance Rotation Program: First Rotation \n \n• Support entity controllers and accounting teams for Cisco’s acquisitions in executing accounting transactions in compliance with Generally Accepted Accounting Principles (GAAP). \n• Responsible for revenue recognition, reporting, journal entry preparation, and Oracle general ledger processing. \n• Execute the complete balance sheet reconciliation process for all entities managed by the team while providing guidance to new acquisitions on the importance of the process and the mechanics of the process.\t \n• Support tax activities and internal reporting through report generation, account validation, and providing other essential data.\t \n• Accountable for transactional accounting including, Accounts Payable, Accounts Receivables, and Cash Application. \n• Involve in the process of transferring sensitive accounting records of recent acquisitions to Cisco's Enterprise Document Management (EDM) system. Financial Asset Analyst EMC July 2012  –  July 2013  (1 year 1 month) • Established a reconciliation process for the fixed assets records for two of the major business units onsite allowing these to track all the physical assets that arrived to their labs in the fiscal year. \n• Helped in the final transition from ORACLE to SAP Enterprise Resource Planning systems in which the department’s main focus was to ensure every fixed asset listed in our location in ORACLE was accurately transferred to SAP. \n• Assisted the Finance department on a monthly basis to gather financial data such as headcount and lab usage for all of the business units currently onsite to properly allocate and forecast costs in the following month. \n• Responsible for preparing invoices on a monthly basis in order to bill the business units their lab usage in terms of square footage, power, and number of racks occupied in the labs. Sales Support Representative AT&T August 2009  –  August 2011  (2 years 1 month) raleigh-durham, north carolina area • Implemented AT&T’s five key behaviors leading the store to increase net representative satisfaction to an overall 100 % in the month of March, 2011. \n• Assisted sales representatives to ensure all promotions in regards to wireless and wired services were being offered to all eligible customers. Consequently, the store was able to reach 100 % of sales goals for the month of January, 2011. \n• Improved our inventory and paperwork audit score from 70% in the month of December, 2010 to 100% in the month of February, 2011. \n• Successfully trained five new hires for the position in the Brier Creek and Cary Towne Center locations. Financial Analyst, Cisco Capital Accounting Cisco March 2015  – Present (6 months) Raleigh-Durham, North Carolina Area Cisco's Finance Rotation Program: Third Rotation \n•\tResponsible for Pre-owned Equipment accounting monthly activities including remarketing and transfer pricing journal entries as well as balance sheet account reconciliations for each period  \n•\tAccountable for the Mexico OLFM close in a daily basis, which includes running requests and reports in this tool as well as raising IT tickets to clear process errors and rejects \n•\tSupport the main accountant for the Mexico and Canada Captives for Cisco Capital with ad hoc projects including balance sheet account reconciliations, Deloitte monthly audit package, intercompany balances clearance, etc. \n Financial Analyst, Cisco Capital Accounting Cisco March 2015  – Present (6 months) Raleigh-Durham, North Carolina Area Cisco's Finance Rotation Program: Third Rotation \n•\tResponsible for Pre-owned Equipment accounting monthly activities including remarketing and transfer pricing journal entries as well as balance sheet account reconciliations for each period  \n•\tAccountable for the Mexico OLFM close in a daily basis, which includes running requests and reports in this tool as well as raising IT tickets to clear process errors and rejects \n•\tSupport the main accountant for the Mexico and Canada Captives for Cisco Capital with ad hoc projects including balance sheet account reconciliations, Deloitte monthly audit package, intercompany balances clearance, etc. \n Financial Analyst, WW Services FP&A Cisco September 2014  –  February 2015  (6 months) Raleigh-Durham, North Carolina Area Cisco's Finance Rotation Program: Second Rotation \n \n• Support the Global, Strategy, Development, and Operations (GSDO) organization under Worldwide Services by managing its budget, target allocation and forecasting. \n• Main point of contact to process month-end activities including open PO accruals, reclasses and cross charges. \n• Responsible for the preparation of balance sheet account reconciliations as well as providing feedback to Corporate Accounting during monthly meetings after month-end close. Financial Analyst, WW Services FP&A Cisco September 2014  –  February 2015  (6 months) Raleigh-Durham, North Carolina Area Cisco's Finance Rotation Program: Second Rotation \n \n• Support the Global, Strategy, Development, and Operations (GSDO) organization under Worldwide Services by managing its budget, target allocation and forecasting. \n• Main point of contact to process month-end activities including open PO accruals, reclasses and cross charges. \n• Responsible for the preparation of balance sheet account reconciliations as well as providing feedback to Corporate Accounting during monthly meetings after month-end close. Financial Analyst Cisco August 2013  –  August 2014  (1 year 1 month) Raleigh-Durham, North Carolina Area Cisco's Finance Rotation Program: First Rotation \n \n• Support entity controllers and accounting teams for Cisco’s acquisitions in executing accounting transactions in compliance with Generally Accepted Accounting Principles (GAAP). \n• Responsible for revenue recognition, reporting, journal entry preparation, and Oracle general ledger processing. \n• Execute the complete balance sheet reconciliation process for all entities managed by the team while providing guidance to new acquisitions on the importance of the process and the mechanics of the process.\t \n• Support tax activities and internal reporting through report generation, account validation, and providing other essential data.\t \n• Accountable for transactional accounting including, Accounts Payable, Accounts Receivables, and Cash Application. \n• Involve in the process of transferring sensitive accounting records of recent acquisitions to Cisco's Enterprise Document Management (EDM) system. Financial Analyst Cisco August 2013  –  August 2014  (1 year 1 month) Raleigh-Durham, North Carolina Area Cisco's Finance Rotation Program: First Rotation \n \n• Support entity controllers and accounting teams for Cisco’s acquisitions in executing accounting transactions in compliance with Generally Accepted Accounting Principles (GAAP). \n• Responsible for revenue recognition, reporting, journal entry preparation, and Oracle general ledger processing. \n• Execute the complete balance sheet reconciliation process for all entities managed by the team while providing guidance to new acquisitions on the importance of the process and the mechanics of the process.\t \n• Support tax activities and internal reporting through report generation, account validation, and providing other essential data.\t \n• Accountable for transactional accounting including, Accounts Payable, Accounts Receivables, and Cash Application. \n• Involve in the process of transferring sensitive accounting records of recent acquisitions to Cisco's Enterprise Document Management (EDM) system. Financial Asset Analyst EMC July 2012  –  July 2013  (1 year 1 month) • Established a reconciliation process for the fixed assets records for two of the major business units onsite allowing these to track all the physical assets that arrived to their labs in the fiscal year. \n• Helped in the final transition from ORACLE to SAP Enterprise Resource Planning systems in which the department’s main focus was to ensure every fixed asset listed in our location in ORACLE was accurately transferred to SAP. \n• Assisted the Finance department on a monthly basis to gather financial data such as headcount and lab usage for all of the business units currently onsite to properly allocate and forecast costs in the following month. \n• Responsible for preparing invoices on a monthly basis in order to bill the business units their lab usage in terms of square footage, power, and number of racks occupied in the labs. Financial Asset Analyst EMC July 2012  –  July 2013  (1 year 1 month) • Established a reconciliation process for the fixed assets records for two of the major business units onsite allowing these to track all the physical assets that arrived to their labs in the fiscal year. \n• Helped in the final transition from ORACLE to SAP Enterprise Resource Planning systems in which the department’s main focus was to ensure every fixed asset listed in our location in ORACLE was accurately transferred to SAP. \n• Assisted the Finance department on a monthly basis to gather financial data such as headcount and lab usage for all of the business units currently onsite to properly allocate and forecast costs in the following month. \n• Responsible for preparing invoices on a monthly basis in order to bill the business units their lab usage in terms of square footage, power, and number of racks occupied in the labs. Sales Support Representative AT&T August 2009  –  August 2011  (2 years 1 month) raleigh-durham, north carolina area • Implemented AT&T’s five key behaviors leading the store to increase net representative satisfaction to an overall 100 % in the month of March, 2011. \n• Assisted sales representatives to ensure all promotions in regards to wireless and wired services were being offered to all eligible customers. Consequently, the store was able to reach 100 % of sales goals for the month of January, 2011. \n• Improved our inventory and paperwork audit score from 70% in the month of December, 2010 to 100% in the month of February, 2011. \n• Successfully trained five new hires for the position in the Brier Creek and Cary Towne Center locations. Sales Support Representative AT&T August 2009  –  August 2011  (2 years 1 month) raleigh-durham, north carolina area • Implemented AT&T’s five key behaviors leading the store to increase net representative satisfaction to an overall 100 % in the month of March, 2011. \n• Assisted sales representatives to ensure all promotions in regards to wireless and wired services were being offered to all eligible customers. Consequently, the store was able to reach 100 % of sales goals for the month of January, 2011. \n• Improved our inventory and paperwork audit score from 70% in the month of December, 2010 to 100% in the month of February, 2011. \n• Successfully trained five new hires for the position in the Brier Creek and Cary Towne Center locations. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Account Reconciliation Acquisition Integration Financial Accounting Fixed Asset Management Enterprise Software QuickBooks Forecasting Sales Direct Sales Customer Service Wireless Telecommunications Managed Services Cloud Computing Management Skills  Account Reconciliation Acquisition Integration Financial Accounting Fixed Asset Management Enterprise Software QuickBooks Forecasting Sales Direct Sales Customer Service Wireless Telecommunications Managed Services Cloud Computing Management Account Reconciliation Acquisition Integration Financial Accounting Fixed Asset Management Enterprise Software QuickBooks Forecasting Sales Direct Sales Customer Service Wireless Telecommunications Managed Services Cloud Computing Management Account Reconciliation Acquisition Integration Financial Accounting Fixed Asset Management Enterprise Software QuickBooks Forecasting Sales Direct Sales Customer Service Wireless Telecommunications Managed Services Cloud Computing Management Education North Carolina State University Bachelor of Business Administration (BBA),  Finance , General 2011  – 2013 Minored in Accounting and Spanish. Participated in a Study Abroad program at Universidad Pontificia Comillas in Madrid, Spain. Focused on Communication for Business and Management, Business Ethics, Marketing Management, and Operations Management. Activities and Societies:  Poole College of Management Peer Leaders ,  Mi Familia NCSU Wake Technical Community College Associate of Arts (AA) 2008  – 2010 North Carolina State University Bachelor of Business Administration (BBA),  Finance , General 2011  – 2013 Minored in Accounting and Spanish. Participated in a Study Abroad program at Universidad Pontificia Comillas in Madrid, Spain. Focused on Communication for Business and Management, Business Ethics, Marketing Management, and Operations Management. Activities and Societies:  Poole College of Management Peer Leaders ,  Mi Familia NCSU North Carolina State University Bachelor of Business Administration (BBA),  Finance , General 2011  – 2013 Minored in Accounting and Spanish. Participated in a Study Abroad program at Universidad Pontificia Comillas in Madrid, Spain. Focused on Communication for Business and Management, Business Ethics, Marketing Management, and Operations Management. Activities and Societies:  Poole College of Management Peer Leaders ,  Mi Familia NCSU North Carolina State University Bachelor of Business Administration (BBA),  Finance , General 2011  – 2013 Minored in Accounting and Spanish. Participated in a Study Abroad program at Universidad Pontificia Comillas in Madrid, Spain. Focused on Communication for Business and Management, Business Ethics, Marketing Management, and Operations Management. Activities and Societies:  Poole College of Management Peer Leaders ,  Mi Familia NCSU Wake Technical Community College Associate of Arts (AA) 2008  – 2010 Wake Technical Community College Associate of Arts (AA) 2008  – 2010 Wake Technical Community College Associate of Arts (AA) 2008  – 2010 ", "Experience Financial Analyst, Global Accounting & Reporting Cisco March 2015  – Present (6 months) London, United Kingdom Support for the United Kingdom and Netherlands Financial Analyst, Enterprise Networking Group Cisco September 2014  –  February 2015  (6 months) San Francisco Bay Area Support for Enterprise and Data Center Switching \nInsieme and Core Catalyst bookings analysis/forecast \nMarket share, competitor, customer, and deal analysis \nHelped to build a database for Catalyst to provide ad-hoc KPI's (PowerPivot) Financial Analyst, Corporate FP&A Cisco January 2014  –  August 2014  (8 months) San Francisco Bay Area Support for Quarterly Business Review and Annual Plan \nData consolidation for business entities, region, and sales/services teams \nManaged templates to be used across Finance for executive reviews \nHelped to create executive content for BoD presentations Finance Intern, Corporate FP&A Polycom June 2013  –  September 2013  (4 months) San Francisco Bay Area Support for Director of Corporate FP&A \nCreated, audited, and updated financial reports \nCreated a 30-page Hyperion process document for month and quarter-end Financial Analyst, Global Accounting & Reporting Cisco March 2015  – Present (6 months) London, United Kingdom Support for the United Kingdom and Netherlands Financial Analyst, Global Accounting & Reporting Cisco March 2015  – Present (6 months) London, United Kingdom Support for the United Kingdom and Netherlands Financial Analyst, Enterprise Networking Group Cisco September 2014  –  February 2015  (6 months) San Francisco Bay Area Support for Enterprise and Data Center Switching \nInsieme and Core Catalyst bookings analysis/forecast \nMarket share, competitor, customer, and deal analysis \nHelped to build a database for Catalyst to provide ad-hoc KPI's (PowerPivot) Financial Analyst, Enterprise Networking Group Cisco September 2014  –  February 2015  (6 months) San Francisco Bay Area Support for Enterprise and Data Center Switching \nInsieme and Core Catalyst bookings analysis/forecast \nMarket share, competitor, customer, and deal analysis \nHelped to build a database for Catalyst to provide ad-hoc KPI's (PowerPivot) Financial Analyst, Corporate FP&A Cisco January 2014  –  August 2014  (8 months) San Francisco Bay Area Support for Quarterly Business Review and Annual Plan \nData consolidation for business entities, region, and sales/services teams \nManaged templates to be used across Finance for executive reviews \nHelped to create executive content for BoD presentations Financial Analyst, Corporate FP&A Cisco January 2014  –  August 2014  (8 months) San Francisco Bay Area Support for Quarterly Business Review and Annual Plan \nData consolidation for business entities, region, and sales/services teams \nManaged templates to be used across Finance for executive reviews \nHelped to create executive content for BoD presentations Finance Intern, Corporate FP&A Polycom June 2013  –  September 2013  (4 months) San Francisco Bay Area Support for Director of Corporate FP&A \nCreated, audited, and updated financial reports \nCreated a 30-page Hyperion process document for month and quarter-end Finance Intern, Corporate FP&A Polycom June 2013  –  September 2013  (4 months) San Francisco Bay Area Support for Director of Corporate FP&A \nCreated, audited, and updated financial reports \nCreated a 30-page Hyperion process document for month and quarter-end Languages   Skills Skills     Education San Jose State University Bachelor of Business Administration (BBA) 2013 Activities and Societies:  Financial Management Association (3+ years of leadership) San Jose State University Bachelor of Business Administration (BBA) 2013 Activities and Societies:  Financial Management Association (3+ years of leadership) San Jose State University Bachelor of Business Administration (BBA) 2013 Activities and Societies:  Financial Management Association (3+ years of leadership) San Jose State University Bachelor of Business Administration (BBA) 2013 Activities and Societies:  Financial Management Association (3+ years of leadership) Honors & Awards ", "Summary Profile:\tDetail oriented Finance Professional with over ten years experience in budgeting, forecasting, tax and financial reporting. \n \nSpecialties: Financial Reporting Summary Profile:\tDetail oriented Finance Professional with over ten years experience in budgeting, forecasting, tax and financial reporting. \n \nSpecialties: Financial Reporting Profile:\tDetail oriented Finance Professional with over ten years experience in budgeting, forecasting, tax and financial reporting. \n \nSpecialties: Financial Reporting Profile:\tDetail oriented Finance Professional with over ten years experience in budgeting, forecasting, tax and financial reporting. \n \nSpecialties: Financial Reporting Experience Finance Manager Cisco January 2014  – Present (1 year 8 months) RTP, NC Manage financial reporting, planning, and budgeting representing IT Function for large scale solutions and country enablement programs.  \n \nFinance partner for leadership team supporting Country Enablement and Security organizations \n \nDevelop key organizational metrics, and provide spend transparency to business leads, Security/ Trust and IT partners \n \nDrive strategic and financial plans between IT and business teams \n \nArticulate program benefits and capabilities to cross-functional business teams in conjunction with technology roadmap \n \nDrive financial and operational processes and projects to completion  \n Sr. Financial Analyst Cisco February 2011  – Present (4 years 7 months) RTP, NC Senior Financial Analyst Aviat Networks April 2010  –  February 2011  (11 months) Senior Tax Analyst Aviat Networks Inc June 2008  –  April 2010  (1 year 11 months) Financial Analyst Cisco contractor March 2008  –  May 2008  (3 months) Sales Manager New Homes July 2003  –  December 2006  (3 years 6 months) Senior Financial Analyst Nike December 2000  –  June 2003  (2 years 7 months) Senior Tax Accountant Nike September 1998  –  December 2000  (2 years 4 months) Tax Analyst Mentor Graphics Corporation December 1995  –  September 1998  (2 years 10 months) Asset Manager The Arcand Company July 1995  –  December 1995  (6 months) Acquisition Analyst The Arcand Company May 1993  –  July 1995  (2 years 3 months) Finance Manager Cisco January 2014  – Present (1 year 8 months) RTP, NC Manage financial reporting, planning, and budgeting representing IT Function for large scale solutions and country enablement programs.  \n \nFinance partner for leadership team supporting Country Enablement and Security organizations \n \nDevelop key organizational metrics, and provide spend transparency to business leads, Security/ Trust and IT partners \n \nDrive strategic and financial plans between IT and business teams \n \nArticulate program benefits and capabilities to cross-functional business teams in conjunction with technology roadmap \n \nDrive financial and operational processes and projects to completion  \n Finance Manager Cisco January 2014  – Present (1 year 8 months) RTP, NC Manage financial reporting, planning, and budgeting representing IT Function for large scale solutions and country enablement programs.  \n \nFinance partner for leadership team supporting Country Enablement and Security organizations \n \nDevelop key organizational metrics, and provide spend transparency to business leads, Security/ Trust and IT partners \n \nDrive strategic and financial plans between IT and business teams \n \nArticulate program benefits and capabilities to cross-functional business teams in conjunction with technology roadmap \n \nDrive financial and operational processes and projects to completion  \n Sr. Financial Analyst Cisco February 2011  – Present (4 years 7 months) RTP, NC Sr. Financial Analyst Cisco February 2011  – Present (4 years 7 months) RTP, NC Senior Financial Analyst Aviat Networks April 2010  –  February 2011  (11 months) Senior Financial Analyst Aviat Networks April 2010  –  February 2011  (11 months) Senior Tax Analyst Aviat Networks Inc June 2008  –  April 2010  (1 year 11 months) Senior Tax Analyst Aviat Networks Inc June 2008  –  April 2010  (1 year 11 months) Financial Analyst Cisco contractor March 2008  –  May 2008  (3 months) Financial Analyst Cisco contractor March 2008  –  May 2008  (3 months) Sales Manager New Homes July 2003  –  December 2006  (3 years 6 months) Sales Manager New Homes July 2003  –  December 2006  (3 years 6 months) Senior Financial Analyst Nike December 2000  –  June 2003  (2 years 7 months) Senior Financial Analyst Nike December 2000  –  June 2003  (2 years 7 months) Senior Tax Accountant Nike September 1998  –  December 2000  (2 years 4 months) Senior Tax Accountant Nike September 1998  –  December 2000  (2 years 4 months) Tax Analyst Mentor Graphics Corporation December 1995  –  September 1998  (2 years 10 months) Tax Analyst Mentor Graphics Corporation December 1995  –  September 1998  (2 years 10 months) Asset Manager The Arcand Company July 1995  –  December 1995  (6 months) Asset Manager The Arcand Company July 1995  –  December 1995  (6 months) Acquisition Analyst The Arcand Company May 1993  –  July 1995  (2 years 3 months) Acquisition Analyst The Arcand Company May 1993  –  July 1995  (2 years 3 months) Skills Financial Reporting Variance Analysis Financial Modeling Budgets Financial Analysis Microsoft Excel Hyperion Enterprise Essbase Budgeting Tax Hyperion Due Diligence Excel Tableau Forecasting Finance See 1+     See less Skills  Financial Reporting Variance Analysis Financial Modeling Budgets Financial Analysis Microsoft Excel Hyperion Enterprise Essbase Budgeting Tax Hyperion Due Diligence Excel Tableau Forecasting Finance See 1+     See less Financial Reporting Variance Analysis Financial Modeling Budgets Financial Analysis Microsoft Excel Hyperion Enterprise Essbase Budgeting Tax Hyperion Due Diligence Excel Tableau Forecasting Finance See 1+     See less Financial Reporting Variance Analysis Financial Modeling Budgets Financial Analysis Microsoft Excel Hyperion Enterprise Essbase Budgeting Tax Hyperion Due Diligence Excel Tableau Forecasting Finance See 1+     See less Education California State Polytechnic University B.S. Business Administration 1993 California State Polytechnic University B.S. Business Administration 1993 California State Polytechnic University B.S. Business Administration 1993 California State Polytechnic University B.S. Business Administration 1993 ", "Summary Currently in my second rotation within the Finance Rotation Program at Cisco Systems. Cisco's highly-regarded Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Summary Currently in my second rotation within the Finance Rotation Program at Cisco Systems. Cisco's highly-regarded Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Currently in my second rotation within the Finance Rotation Program at Cisco Systems. Cisco's highly-regarded Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Currently in my second rotation within the Finance Rotation Program at Cisco Systems. Cisco's highly-regarded Finance Rotation Program (FRP) is a two-year, entry-level accelerated development program for new college graduates, which develops skills through a rotation of finance job assignments, a defined training curriculum, and exposure to senior finance leadership. The program is led by finance professionals and supported by exceptional finance managers and mentors. The program is committed to developing early-in-career employees as world-class financial leaders for exciting and successful careers within finance at Cisco. Experience Financial Analyst (Corporate Development M&A Finance) Cisco March 2015  – Present (6 months) San Jose, California Actively monitor and perform quarterly valuations of 17 direct investments and 11 venture funds in Cisco's investment portfolio \nManage Purchase Intangibles and Impairments for 30+ acquisitions by reviewing quarterly templates for acquisitions with NBV>$15M to track for major business changes with the Director of Corporate Development, M&A Accounting, and PWC \nAct as a the Process Team Lead for internal SOX controls to ensure adequate evidence is provided for controls concerning Purchase Price Allocation, Acquisitions, Investments, Purchase Intangibles, and Venture Funds Financial Analyst (Business Technology & Operations Finance) Cisco August 2014  – Present (1 year 1 month) Raleigh-Durham, North Carolina Area Supported two business units within the Service Provider Mobility Business Group to drive financial and operational processes and achieve business results \nConstructed weekly bookings reports and monthly revenue/margin forecasts by partnering with engineering and product management teams \nDrove and prepared presentations for monthly bookings forecast meetings with senior management \nResponsible for loading P&L forecast to Hyperion Planning on a monthly basis Financial Analyst (Commercial Finance Acquisition Integration) Cisco August 2013  –  August 2014  (1 year 1 month) Raleigh-Durham, North Carolina Area Single point of contact for renewal business pricing on content security deals for accounts in the US and Asia to create profitable business for Cisco \nPerform margin analysis and advise account teams on the business unit's pricing strategy \nNegotiate pricing and non-standard terms by collaborating with cross-functional teams (sales, corporate revenue, legal,etc...) to create potential upside for Cisco Finance Intern (Customer Information Clearinghouse) Cisco June 2012  –  August 2012  (3 months) Raleigh-Durham, North Carolina Area Created a comprehensive shared assessment of 1,000+ questions and answers about data privacy, information security, business resiliency, asset management, risk management, etc... to be sent to clients requesting information about these topics. \nAnswered questionnaires from customers about data privacy and information security. Public Relations/Communications Intern UNC Hospital Volunteer Association August 2011  –  December 2011  (5 months) Chapel Hill, NC Wrote articles on volunteer and community outreach programs and collaborated with another intern to create and publish the association's quarterly newsletter. \nAudited the association's communications and worked with the association to plan for future opportunities, such as a Twitter and Facebook account for the organization to promote weekly fundraising activities and build awareness about the hospital's patient services. Summer Intern Headway Capital Partners May 2011  –  July 2011  (3 months) London, United Kingdom Produced initial analyses and valuations of portfolio companies for potential investment. \nPerformed and compiled industry and company research with regard to financial standings and operations. \nCreated the firm's pipeline database to track a portfolio or fund's position in the deal process. Document Management Associate Principal Financial Group July 2008  –  July 2011  (3 years 1 month) Raleigh, NC Digitized 250 file drawers of all of the company's paper files to be accessed through a computer-generated database. \nDeveloped and tested IT test sets for new and upgraded software. \nBuilt funds in the client database to be used by financial analysts for asset evaluation. Financial Analyst (Corporate Development M&A Finance) Cisco March 2015  – Present (6 months) San Jose, California Actively monitor and perform quarterly valuations of 17 direct investments and 11 venture funds in Cisco's investment portfolio \nManage Purchase Intangibles and Impairments for 30+ acquisitions by reviewing quarterly templates for acquisitions with NBV>$15M to track for major business changes with the Director of Corporate Development, M&A Accounting, and PWC \nAct as a the Process Team Lead for internal SOX controls to ensure adequate evidence is provided for controls concerning Purchase Price Allocation, Acquisitions, Investments, Purchase Intangibles, and Venture Funds Financial Analyst (Corporate Development M&A Finance) Cisco March 2015  – Present (6 months) San Jose, California Actively monitor and perform quarterly valuations of 17 direct investments and 11 venture funds in Cisco's investment portfolio \nManage Purchase Intangibles and Impairments for 30+ acquisitions by reviewing quarterly templates for acquisitions with NBV>$15M to track for major business changes with the Director of Corporate Development, M&A Accounting, and PWC \nAct as a the Process Team Lead for internal SOX controls to ensure adequate evidence is provided for controls concerning Purchase Price Allocation, Acquisitions, Investments, Purchase Intangibles, and Venture Funds Financial Analyst (Business Technology & Operations Finance) Cisco August 2014  – Present (1 year 1 month) Raleigh-Durham, North Carolina Area Supported two business units within the Service Provider Mobility Business Group to drive financial and operational processes and achieve business results \nConstructed weekly bookings reports and monthly revenue/margin forecasts by partnering with engineering and product management teams \nDrove and prepared presentations for monthly bookings forecast meetings with senior management \nResponsible for loading P&L forecast to Hyperion Planning on a monthly basis Financial Analyst (Business Technology & Operations Finance) Cisco August 2014  – Present (1 year 1 month) Raleigh-Durham, North Carolina Area Supported two business units within the Service Provider Mobility Business Group to drive financial and operational processes and achieve business results \nConstructed weekly bookings reports and monthly revenue/margin forecasts by partnering with engineering and product management teams \nDrove and prepared presentations for monthly bookings forecast meetings with senior management \nResponsible for loading P&L forecast to Hyperion Planning on a monthly basis Financial Analyst (Commercial Finance Acquisition Integration) Cisco August 2013  –  August 2014  (1 year 1 month) Raleigh-Durham, North Carolina Area Single point of contact for renewal business pricing on content security deals for accounts in the US and Asia to create profitable business for Cisco \nPerform margin analysis and advise account teams on the business unit's pricing strategy \nNegotiate pricing and non-standard terms by collaborating with cross-functional teams (sales, corporate revenue, legal,etc...) to create potential upside for Cisco Financial Analyst (Commercial Finance Acquisition Integration) Cisco August 2013  –  August 2014  (1 year 1 month) Raleigh-Durham, North Carolina Area Single point of contact for renewal business pricing on content security deals for accounts in the US and Asia to create profitable business for Cisco \nPerform margin analysis and advise account teams on the business unit's pricing strategy \nNegotiate pricing and non-standard terms by collaborating with cross-functional teams (sales, corporate revenue, legal,etc...) to create potential upside for Cisco Finance Intern (Customer Information Clearinghouse) Cisco June 2012  –  August 2012  (3 months) Raleigh-Durham, North Carolina Area Created a comprehensive shared assessment of 1,000+ questions and answers about data privacy, information security, business resiliency, asset management, risk management, etc... to be sent to clients requesting information about these topics. \nAnswered questionnaires from customers about data privacy and information security. Finance Intern (Customer Information Clearinghouse) Cisco June 2012  –  August 2012  (3 months) Raleigh-Durham, North Carolina Area Created a comprehensive shared assessment of 1,000+ questions and answers about data privacy, information security, business resiliency, asset management, risk management, etc... to be sent to clients requesting information about these topics. \nAnswered questionnaires from customers about data privacy and information security. Public Relations/Communications Intern UNC Hospital Volunteer Association August 2011  –  December 2011  (5 months) Chapel Hill, NC Wrote articles on volunteer and community outreach programs and collaborated with another intern to create and publish the association's quarterly newsletter. \nAudited the association's communications and worked with the association to plan for future opportunities, such as a Twitter and Facebook account for the organization to promote weekly fundraising activities and build awareness about the hospital's patient services. Public Relations/Communications Intern UNC Hospital Volunteer Association August 2011  –  December 2011  (5 months) Chapel Hill, NC Wrote articles on volunteer and community outreach programs and collaborated with another intern to create and publish the association's quarterly newsletter. \nAudited the association's communications and worked with the association to plan for future opportunities, such as a Twitter and Facebook account for the organization to promote weekly fundraising activities and build awareness about the hospital's patient services. Summer Intern Headway Capital Partners May 2011  –  July 2011  (3 months) London, United Kingdom Produced initial analyses and valuations of portfolio companies for potential investment. \nPerformed and compiled industry and company research with regard to financial standings and operations. \nCreated the firm's pipeline database to track a portfolio or fund's position in the deal process. Summer Intern Headway Capital Partners May 2011  –  July 2011  (3 months) London, United Kingdom Produced initial analyses and valuations of portfolio companies for potential investment. \nPerformed and compiled industry and company research with regard to financial standings and operations. \nCreated the firm's pipeline database to track a portfolio or fund's position in the deal process. Document Management Associate Principal Financial Group July 2008  –  July 2011  (3 years 1 month) Raleigh, NC Digitized 250 file drawers of all of the company's paper files to be accessed through a computer-generated database. \nDeveloped and tested IT test sets for new and upgraded software. \nBuilt funds in the client database to be used by financial analysts for asset evaluation. Document Management Associate Principal Financial Group July 2008  –  July 2011  (3 years 1 month) Raleigh, NC Digitized 250 file drawers of all of the company's paper files to be accessed through a computer-generated database. \nDeveloped and tested IT test sets for new and upgraded software. \nBuilt funds in the client database to be used by financial analysts for asset evaluation. Skills Analysis PowerPoint Microsoft Office Microsoft Excel Leadership Finance Microsoft Word French Social Media Skills  Analysis PowerPoint Microsoft Office Microsoft Excel Leadership Finance Microsoft Word French Social Media Analysis PowerPoint Microsoft Office Microsoft Excel Leadership Finance Microsoft Word French Social Media Analysis PowerPoint Microsoft Office Microsoft Excel Leadership Finance Microsoft Word French Social Media Education University of North Carolina at Chapel Hill - Kenan-Flagler Business School Bachelor of Business Administration (B.B.A.),  Finance , General 2009  – 2013 Journalism & Mass Communications Minor in the Public Relations Sequence \n \nGlobal Immersion Leadership Scholarship, Kenan-Flagler Business School, Summer 2011 \n \nBeta Gamma Sigma Member \n \nDean's List - 7 Consecutive Semesters \n \nStudy Abroad/International Business Experience in the United Kingdom Activities and Societies:  Carolina Women in Business & Habitat for Humanity University of North Carolina at Chapel Hill - Kenan-Flagler Business School Bachelor of Science (B.S.),  Business Administration and Management , General 2009  – 2013 University of North Carolina at Chapel Hill - Kenan-Flagler Business School Bachelor of Business Administration (B.B.A.),  Finance , General 2009  – 2013 Journalism & Mass Communications Minor in the Public Relations Sequence \n \nGlobal Immersion Leadership Scholarship, Kenan-Flagler Business School, Summer 2011 \n \nBeta Gamma Sigma Member \n \nDean's List - 7 Consecutive Semesters \n \nStudy Abroad/International Business Experience in the United Kingdom Activities and Societies:  Carolina Women in Business & Habitat for Humanity University of North Carolina at Chapel Hill - Kenan-Flagler Business School Bachelor of Business Administration (B.B.A.),  Finance , General 2009  – 2013 Journalism & Mass Communications Minor in the Public Relations Sequence \n \nGlobal Immersion Leadership Scholarship, Kenan-Flagler Business School, Summer 2011 \n \nBeta Gamma Sigma Member \n \nDean's List - 7 Consecutive Semesters \n \nStudy Abroad/International Business Experience in the United Kingdom Activities and Societies:  Carolina Women in Business & Habitat for Humanity University of North Carolina at Chapel Hill - Kenan-Flagler Business School Bachelor of Business Administration (B.B.A.),  Finance , General 2009  – 2013 Journalism & Mass Communications Minor in the Public Relations Sequence \n \nGlobal Immersion Leadership Scholarship, Kenan-Flagler Business School, Summer 2011 \n \nBeta Gamma Sigma Member \n \nDean's List - 7 Consecutive Semesters \n \nStudy Abroad/International Business Experience in the United Kingdom Activities and Societies:  Carolina Women in Business & Habitat for Humanity University of North Carolina at Chapel Hill - Kenan-Flagler Business School Bachelor of Science (B.S.),  Business Administration and Management , General 2009  – 2013 University of North Carolina at Chapel Hill - Kenan-Flagler Business School Bachelor of Science (B.S.),  Business Administration and Management , General 2009  – 2013 University of North Carolina at Chapel Hill - Kenan-Flagler Business School Bachelor of Science (B.S.),  Business Administration and Management , General 2009  – 2013 "]}