{"position": "Finance Director", "company": "Intel Corporation", "profiles": ["Summary Finance professional with over 17+ years of experience across the technology, investment banking, and engineering services industries. \n \nHave successfully provided financial management of large budgets exceeding $1B annually with 1,000+ employees worldwide, and supported multiple VP's at Intel Corporation and senior leaders at the CEO/SVP level at other firms. Have supported organizations with employees throughout Europe, Asia and Latin America, including China, India, Russia, and Argentina. \n \nExperienced people manager with over 10+ years of progressively increasing responsibility. Currently manage an organization of 25 finance professionals across multiple geographies. \n \nStrong track record in growing P&L businesses. \n \nSignificant experience in deals, with a focus on acquistions. Have supported over $2B in deals covering acquisitions, licensing, partnerships, product sales, and equity investments over my career. \n \nServed on the managing board of NordicEdge, a software company based in Stockholm, Sweden that was acquired by Intel in 2011. Summary Finance professional with over 17+ years of experience across the technology, investment banking, and engineering services industries. \n \nHave successfully provided financial management of large budgets exceeding $1B annually with 1,000+ employees worldwide, and supported multiple VP's at Intel Corporation and senior leaders at the CEO/SVP level at other firms. Have supported organizations with employees throughout Europe, Asia and Latin America, including China, India, Russia, and Argentina. \n \nExperienced people manager with over 10+ years of progressively increasing responsibility. Currently manage an organization of 25 finance professionals across multiple geographies. \n \nStrong track record in growing P&L businesses. \n \nSignificant experience in deals, with a focus on acquistions. Have supported over $2B in deals covering acquisitions, licensing, partnerships, product sales, and equity investments over my career. \n \nServed on the managing board of NordicEdge, a software company based in Stockholm, Sweden that was acquired by Intel in 2011. Finance professional with over 17+ years of experience across the technology, investment banking, and engineering services industries. \n \nHave successfully provided financial management of large budgets exceeding $1B annually with 1,000+ employees worldwide, and supported multiple VP's at Intel Corporation and senior leaders at the CEO/SVP level at other firms. Have supported organizations with employees throughout Europe, Asia and Latin America, including China, India, Russia, and Argentina. \n \nExperienced people manager with over 10+ years of progressively increasing responsibility. Currently manage an organization of 25 finance professionals across multiple geographies. \n \nStrong track record in growing P&L businesses. \n \nSignificant experience in deals, with a focus on acquistions. Have supported over $2B in deals covering acquisitions, licensing, partnerships, product sales, and equity investments over my career. \n \nServed on the managing board of NordicEdge, a software company based in Stockholm, Sweden that was acquired by Intel in 2011. Finance professional with over 17+ years of experience across the technology, investment banking, and engineering services industries. \n \nHave successfully provided financial management of large budgets exceeding $1B annually with 1,000+ employees worldwide, and supported multiple VP's at Intel Corporation and senior leaders at the CEO/SVP level at other firms. Have supported organizations with employees throughout Europe, Asia and Latin America, including China, India, Russia, and Argentina. \n \nExperienced people manager with over 10+ years of progressively increasing responsibility. Currently manage an organization of 25 finance professionals across multiple geographies. \n \nStrong track record in growing P&L businesses. \n \nSignificant experience in deals, with a focus on acquistions. Have supported over $2B in deals covering acquisitions, licensing, partnerships, product sales, and equity investments over my career. \n \nServed on the managing board of NordicEdge, a software company based in Stockholm, Sweden that was acquired by Intel in 2011. Experience Senior Finance Controller - Outsourced Manufacturing & Supply Chain Intel Corporation July 2013  – Present (2 years 2 months) Responsible for external materials and manufacturing deals across a range of product lines at Intel. Lead deal negotiations with suppliers worldwide on behalf of Intel product divisions to secure the most optimal terms for materials and manufacturing services. \n \nManage an organization of 25 finance professionals. Senior Finance Controller - Outsourced Manufacturing & Supply Chain Intel Corporation July 2013  – Present (2 years 2 months) Responsible for external materials and manufacturing deals across a range of product lines at Intel. Lead deal negotiations with suppliers worldwide on behalf of Intel product divisions to secure the most optimal terms for materials and manufacturing services. \n \nManage an organization of 25 finance professionals. Senior Finance Controller - Outsourced Manufacturing & Supply Chain Intel Corporation July 2013  – Present (2 years 2 months) Responsible for external materials and manufacturing deals across a range of product lines at Intel. Lead deal negotiations with suppliers worldwide on behalf of Intel product divisions to secure the most optimal terms for materials and manufacturing services. \n \nManage an organization of 25 finance professionals. Skills Mergers  Strategic Partnerships Business Development Leadership Acquisition Integration Enterprise Software Corporate Finance Financial Modeling Competitive Analysis Forecasting Cross-functional Team... Finance Financial Reporting Strategy Financial Analysis Strategic Financial... Semiconductors Mergers & Acquisitions Financial Forecasting Capital Budgeting Product Management Pricing Budgets Start-ups See 9+     See less Skills  Mergers  Strategic Partnerships Business Development Leadership Acquisition Integration Enterprise Software Corporate Finance Financial Modeling Competitive Analysis Forecasting Cross-functional Team... Finance Financial Reporting Strategy Financial Analysis Strategic Financial... Semiconductors Mergers & Acquisitions Financial Forecasting Capital Budgeting Product Management Pricing Budgets Start-ups See 9+     See less Mergers  Strategic Partnerships Business Development Leadership Acquisition Integration Enterprise Software Corporate Finance Financial Modeling Competitive Analysis Forecasting Cross-functional Team... Finance Financial Reporting Strategy Financial Analysis Strategic Financial... Semiconductors Mergers & Acquisitions Financial Forecasting Capital Budgeting Product Management Pricing Budgets Start-ups See 9+     See less Mergers  Strategic Partnerships Business Development Leadership Acquisition Integration Enterprise Software Corporate Finance Financial Modeling Competitive Analysis Forecasting Cross-functional Team... Finance Financial Reporting Strategy Financial Analysis Strategic Financial... Semiconductors Mergers & Acquisitions Financial Forecasting Capital Budgeting Product Management Pricing Budgets Start-ups See 9+     See less Education Boston University Questrom School of Business MBA,  Finance / Marketing 1998  – 2000 St. Olaf College BA,  Political Science Boston University Questrom School of Business MBA,  Finance / Marketing 1998  – 2000 Boston University Questrom School of Business MBA,  Finance / Marketing 1998  – 2000 Boston University Questrom School of Business MBA,  Finance / Marketing 1998  – 2000 St. Olaf College BA,  Political Science St. Olaf College BA,  Political Science St. Olaf College BA,  Political Science ", "Summary Versatile professional in Finance and Operations with global experience and mindset making difference through leading people. Summary Versatile professional in Finance and Operations with global experience and mindset making difference through leading people. Versatile professional in Finance and Operations with global experience and mindset making difference through leading people. Versatile professional in Finance and Operations with global experience and mindset making difference through leading people. Experience Russia and CIS Finance Director Intel Corporation November 2011  – Present (3 years 10 months) Moscow, Russian Federation Responsible for finance management in Russia and CIS, including statutory and GAAP accounting, Tax and Trade, Sales and R&D controllership, credit and corporate finance. Key responsibilities: establishing and maintaining the right level of controls for overall Intel business in Russia and CIS; driving budgeting processes for above organizations; establishing the tax and transfer pricing structure for local subsidiaries; managing 30+ direct and matrix reports. Operations are spread across 4 sites and multiple smaller sales offices across RCIS with 1200+ employees and 4 legal entities. ~$1.5B in sales, 800 people research and development organization and regional support hub. Russia and CIS Corporate Finance Controller Intel Corporation September 2010  –  October 2011  (1 year 2 months) Managing 20+ people organization. Responsible for all aspects of local and US GAAP accounting for four legal entities in RCIS, financial and operational controls and distribution finance. Malaysia Boards and Systems Financial Controller Intel Corporation June 2008  –  February 2011  (2 years 9 months) Penang, Malaysia Systems Manufacturing (SM) group of Intel Corporation is a dynamic $2B+ operation providing boards and systems manufacturing support, New Product Introduction (NPI) and Post Sales Support (PSS) to multiple Intel Business Units. Responsibilities: management of 20+ member strong direct and matrix finance organization that spans across Systems Manufacturing, Materials and Intel Business Units. Driving positive business change for Boards and Systems business strategy in Global Manufacturing Operations. Development of the Reference Design Vehicles long term roadmap and business strategy; and driving improved capabilities and cross group synergy for the Kulim based organization. Achievements: drove 20% reduction in overall spending; managed finance side of the group reorganization for better functional alighnment. Learned how to manage in downturn and divest effectively. General Manager of Nizhny Novgorod Laboratories Intel Corporation June 2006  –  May 2008  (2 years) Nizhny Novgorod, Russia Responsibilities: overall operations of Nizhny Novgorod branch of ZAO \"Intel A/O\" - 500 strong organization including R&D operations, Russia Marketing Center and operations hub for Intel in Russia. \nAchievements: drove external agenda with regional government, established site long term development plan, worked to attract new projects to Nizhny Novgorod. Optimized infrastructure of Nizhny Labs - consolidated three campuses into one with significant savings, drove $22M purchase of the main office building and its re-design. In the first half of 2008 acted as Intel Russia Operations Manager responsible for overall operations of Intel in Russia. Learned stakeholder management and importance of personal influence. Russia R&D Finance controller Intel June 2004  –  May 2006  (2 years) Responsibilities: management of Russia R&D Finance team. Oversight of finance processes of R&D sites in Russia (Nizhny, Sarov, Moscow, St Pete, Novosibirsk) with 1,200 employees and consolidated annual budget of more then $70M in expense and $50M in capital investments. Supervision of B&P processes for Russia R&D and relationship management with business groups finance. Partnership with key R&D business unit managers in Russia, investments coordination and analysis. Achievements: Managed finance side of 2 acquisitions ($70M paid in cash and 600 people joining Intel); established finance support for 3 newly added sites; drove optimization of infrastructure between 5 Intel sites in Russia; >$10M in cash savings by the team. Learned how to manage integration of large teams and the importance of timely engagement. Finance Manager Intel Nizhny Novgorod Laboratories November 2002  –  May 2003  (7 months) Responsibilities: overall financial management of Intel Nizhny Novgorod R&D site.  \nAchievements: developed scalable finance support for growing R&D operations in Nizhny and Sarov sites, which grew from 150 to 400 employees over the course of 2 years. Learned how big corporations work and how to bring value and influence when you don't always have direct control. Director The Russian Microfinance Center January 2001  –  January 2002  (1 year 1 month) The Russian Microfinance Center (RMC) is a project of Development Alternatives, Inc (DAI) financed by the USAID. Center's major activities are: training and consulting to microfinance institutions in Russian Federation, accumulation and dissemination of best practices in the region, development of capacity of Russian microfinance institutions, information services and policy work to improve the legal environment for microfinance in Russia. \nResponsibilities: managing overall operations of the Center. Achievements: started up the Russian Microfinance Center. Developed organizational strategy, hired personnel, established operations. Now it is a consultancy with ~$1M in revenue. Learned how to establish organizational strategy and manage a start up. Independent Consultant CGAP/ World Bank Group January 2000  –  January 2001  (1 year 1 month) Consultancy with The World Bank (CGAP), the Microfinance Centre for Central and Eastern Europe (MFC) and Development Alternatives, Inc in Bosnia; Achievements: worked as a certified trainer for CGAP courses on finance and management topics. Developed training courses, conducted organizational assessments and audits. Monitored development of loan portfolio management system for Opportunity International - Russia. Learned importance of networking and that the world is flat. Financial and Information Systems Analyst Opportunity International January 1996  –  January 2000  (4 years 1 month) Opportunity International is a network of 65 microfinance institutions in 35 countries. Opportunity International has partners in 7 regions of Russia. Currently operates in Russia through Forus Bank. \nResponsibilities: financial analysis, planning, budgeting, program reporting and systems development. Achievements: managed the development of Portfolio Management System for Opportunity in Russia that was employed by OI partners across Eastern Europe for more then 7 years after launch. Learned fundamentals of financial analysis, project management and how to work with programmers. Executive Director's Assistant NGO Vozmozhnost, Nizhny January 1994  –  January 1996  (2 years 1 month) Vozmozhnost is one of the first microcredit programs in Russia providing individual and group micro loans, equipment leases, business incubation services, professional and business training.  \nResponsibilities: a member of Vozmozhnost start up team, owner of financial and information systems, secretary of the Board of Directors. Achievenments: Developed a format for international financial reporting and analysis for Opportunity Russia. Developed an electronic system for transition of standard Russian accounting information into GAAP format for Opportunity Partners in Russia. Learnt basics of banking business and corporate governance. Owner Private entrepreneur January 1994  –  November 1994  (11 months) Food wholesales in Nizhny Novgorod, Russia. Learned what it means to run my own business and importance of controls. Officer White See and Onega Company January 1992  –  January 1993  (1 year 1 month) Responsible for navigational equipment, cash operations and financial documentation on the ship. Learned cash management and importance of the team. Russia and CIS Finance Director Intel Corporation November 2011  – Present (3 years 10 months) Moscow, Russian Federation Responsible for finance management in Russia and CIS, including statutory and GAAP accounting, Tax and Trade, Sales and R&D controllership, credit and corporate finance. Key responsibilities: establishing and maintaining the right level of controls for overall Intel business in Russia and CIS; driving budgeting processes for above organizations; establishing the tax and transfer pricing structure for local subsidiaries; managing 30+ direct and matrix reports. Operations are spread across 4 sites and multiple smaller sales offices across RCIS with 1200+ employees and 4 legal entities. ~$1.5B in sales, 800 people research and development organization and regional support hub. Russia and CIS Finance Director Intel Corporation November 2011  – Present (3 years 10 months) Moscow, Russian Federation Responsible for finance management in Russia and CIS, including statutory and GAAP accounting, Tax and Trade, Sales and R&D controllership, credit and corporate finance. Key responsibilities: establishing and maintaining the right level of controls for overall Intel business in Russia and CIS; driving budgeting processes for above organizations; establishing the tax and transfer pricing structure for local subsidiaries; managing 30+ direct and matrix reports. Operations are spread across 4 sites and multiple smaller sales offices across RCIS with 1200+ employees and 4 legal entities. ~$1.5B in sales, 800 people research and development organization and regional support hub. Russia and CIS Corporate Finance Controller Intel Corporation September 2010  –  October 2011  (1 year 2 months) Managing 20+ people organization. Responsible for all aspects of local and US GAAP accounting for four legal entities in RCIS, financial and operational controls and distribution finance. Russia and CIS Corporate Finance Controller Intel Corporation September 2010  –  October 2011  (1 year 2 months) Managing 20+ people organization. Responsible for all aspects of local and US GAAP accounting for four legal entities in RCIS, financial and operational controls and distribution finance. Malaysia Boards and Systems Financial Controller Intel Corporation June 2008  –  February 2011  (2 years 9 months) Penang, Malaysia Systems Manufacturing (SM) group of Intel Corporation is a dynamic $2B+ operation providing boards and systems manufacturing support, New Product Introduction (NPI) and Post Sales Support (PSS) to multiple Intel Business Units. Responsibilities: management of 20+ member strong direct and matrix finance organization that spans across Systems Manufacturing, Materials and Intel Business Units. Driving positive business change for Boards and Systems business strategy in Global Manufacturing Operations. Development of the Reference Design Vehicles long term roadmap and business strategy; and driving improved capabilities and cross group synergy for the Kulim based organization. Achievements: drove 20% reduction in overall spending; managed finance side of the group reorganization for better functional alighnment. Learned how to manage in downturn and divest effectively. Malaysia Boards and Systems Financial Controller Intel Corporation June 2008  –  February 2011  (2 years 9 months) Penang, Malaysia Systems Manufacturing (SM) group of Intel Corporation is a dynamic $2B+ operation providing boards and systems manufacturing support, New Product Introduction (NPI) and Post Sales Support (PSS) to multiple Intel Business Units. Responsibilities: management of 20+ member strong direct and matrix finance organization that spans across Systems Manufacturing, Materials and Intel Business Units. Driving positive business change for Boards and Systems business strategy in Global Manufacturing Operations. Development of the Reference Design Vehicles long term roadmap and business strategy; and driving improved capabilities and cross group synergy for the Kulim based organization. Achievements: drove 20% reduction in overall spending; managed finance side of the group reorganization for better functional alighnment. Learned how to manage in downturn and divest effectively. General Manager of Nizhny Novgorod Laboratories Intel Corporation June 2006  –  May 2008  (2 years) Nizhny Novgorod, Russia Responsibilities: overall operations of Nizhny Novgorod branch of ZAO \"Intel A/O\" - 500 strong organization including R&D operations, Russia Marketing Center and operations hub for Intel in Russia. \nAchievements: drove external agenda with regional government, established site long term development plan, worked to attract new projects to Nizhny Novgorod. Optimized infrastructure of Nizhny Labs - consolidated three campuses into one with significant savings, drove $22M purchase of the main office building and its re-design. In the first half of 2008 acted as Intel Russia Operations Manager responsible for overall operations of Intel in Russia. Learned stakeholder management and importance of personal influence. General Manager of Nizhny Novgorod Laboratories Intel Corporation June 2006  –  May 2008  (2 years) Nizhny Novgorod, Russia Responsibilities: overall operations of Nizhny Novgorod branch of ZAO \"Intel A/O\" - 500 strong organization including R&D operations, Russia Marketing Center and operations hub for Intel in Russia. \nAchievements: drove external agenda with regional government, established site long term development plan, worked to attract new projects to Nizhny Novgorod. Optimized infrastructure of Nizhny Labs - consolidated three campuses into one with significant savings, drove $22M purchase of the main office building and its re-design. In the first half of 2008 acted as Intel Russia Operations Manager responsible for overall operations of Intel in Russia. Learned stakeholder management and importance of personal influence. Russia R&D Finance controller Intel June 2004  –  May 2006  (2 years) Responsibilities: management of Russia R&D Finance team. Oversight of finance processes of R&D sites in Russia (Nizhny, Sarov, Moscow, St Pete, Novosibirsk) with 1,200 employees and consolidated annual budget of more then $70M in expense and $50M in capital investments. Supervision of B&P processes for Russia R&D and relationship management with business groups finance. Partnership with key R&D business unit managers in Russia, investments coordination and analysis. Achievements: Managed finance side of 2 acquisitions ($70M paid in cash and 600 people joining Intel); established finance support for 3 newly added sites; drove optimization of infrastructure between 5 Intel sites in Russia; >$10M in cash savings by the team. Learned how to manage integration of large teams and the importance of timely engagement. Russia R&D Finance controller Intel June 2004  –  May 2006  (2 years) Responsibilities: management of Russia R&D Finance team. Oversight of finance processes of R&D sites in Russia (Nizhny, Sarov, Moscow, St Pete, Novosibirsk) with 1,200 employees and consolidated annual budget of more then $70M in expense and $50M in capital investments. Supervision of B&P processes for Russia R&D and relationship management with business groups finance. Partnership with key R&D business unit managers in Russia, investments coordination and analysis. Achievements: Managed finance side of 2 acquisitions ($70M paid in cash and 600 people joining Intel); established finance support for 3 newly added sites; drove optimization of infrastructure between 5 Intel sites in Russia; >$10M in cash savings by the team. Learned how to manage integration of large teams and the importance of timely engagement. Finance Manager Intel Nizhny Novgorod Laboratories November 2002  –  May 2003  (7 months) Responsibilities: overall financial management of Intel Nizhny Novgorod R&D site.  \nAchievements: developed scalable finance support for growing R&D operations in Nizhny and Sarov sites, which grew from 150 to 400 employees over the course of 2 years. Learned how big corporations work and how to bring value and influence when you don't always have direct control. Finance Manager Intel Nizhny Novgorod Laboratories November 2002  –  May 2003  (7 months) Responsibilities: overall financial management of Intel Nizhny Novgorod R&D site.  \nAchievements: developed scalable finance support for growing R&D operations in Nizhny and Sarov sites, which grew from 150 to 400 employees over the course of 2 years. Learned how big corporations work and how to bring value and influence when you don't always have direct control. Director The Russian Microfinance Center January 2001  –  January 2002  (1 year 1 month) The Russian Microfinance Center (RMC) is a project of Development Alternatives, Inc (DAI) financed by the USAID. Center's major activities are: training and consulting to microfinance institutions in Russian Federation, accumulation and dissemination of best practices in the region, development of capacity of Russian microfinance institutions, information services and policy work to improve the legal environment for microfinance in Russia. \nResponsibilities: managing overall operations of the Center. Achievements: started up the Russian Microfinance Center. Developed organizational strategy, hired personnel, established operations. Now it is a consultancy with ~$1M in revenue. Learned how to establish organizational strategy and manage a start up. Director The Russian Microfinance Center January 2001  –  January 2002  (1 year 1 month) The Russian Microfinance Center (RMC) is a project of Development Alternatives, Inc (DAI) financed by the USAID. Center's major activities are: training and consulting to microfinance institutions in Russian Federation, accumulation and dissemination of best practices in the region, development of capacity of Russian microfinance institutions, information services and policy work to improve the legal environment for microfinance in Russia. \nResponsibilities: managing overall operations of the Center. Achievements: started up the Russian Microfinance Center. Developed organizational strategy, hired personnel, established operations. Now it is a consultancy with ~$1M in revenue. Learned how to establish organizational strategy and manage a start up. Independent Consultant CGAP/ World Bank Group January 2000  –  January 2001  (1 year 1 month) Consultancy with The World Bank (CGAP), the Microfinance Centre for Central and Eastern Europe (MFC) and Development Alternatives, Inc in Bosnia; Achievements: worked as a certified trainer for CGAP courses on finance and management topics. Developed training courses, conducted organizational assessments and audits. Monitored development of loan portfolio management system for Opportunity International - Russia. Learned importance of networking and that the world is flat. Independent Consultant CGAP/ World Bank Group January 2000  –  January 2001  (1 year 1 month) Consultancy with The World Bank (CGAP), the Microfinance Centre for Central and Eastern Europe (MFC) and Development Alternatives, Inc in Bosnia; Achievements: worked as a certified trainer for CGAP courses on finance and management topics. Developed training courses, conducted organizational assessments and audits. Monitored development of loan portfolio management system for Opportunity International - Russia. Learned importance of networking and that the world is flat. Financial and Information Systems Analyst Opportunity International January 1996  –  January 2000  (4 years 1 month) Opportunity International is a network of 65 microfinance institutions in 35 countries. Opportunity International has partners in 7 regions of Russia. Currently operates in Russia through Forus Bank. \nResponsibilities: financial analysis, planning, budgeting, program reporting and systems development. Achievements: managed the development of Portfolio Management System for Opportunity in Russia that was employed by OI partners across Eastern Europe for more then 7 years after launch. Learned fundamentals of financial analysis, project management and how to work with programmers. Financial and Information Systems Analyst Opportunity International January 1996  –  January 2000  (4 years 1 month) Opportunity International is a network of 65 microfinance institutions in 35 countries. Opportunity International has partners in 7 regions of Russia. Currently operates in Russia through Forus Bank. \nResponsibilities: financial analysis, planning, budgeting, program reporting and systems development. Achievements: managed the development of Portfolio Management System for Opportunity in Russia that was employed by OI partners across Eastern Europe for more then 7 years after launch. Learned fundamentals of financial analysis, project management and how to work with programmers. Executive Director's Assistant NGO Vozmozhnost, Nizhny January 1994  –  January 1996  (2 years 1 month) Vozmozhnost is one of the first microcredit programs in Russia providing individual and group micro loans, equipment leases, business incubation services, professional and business training.  \nResponsibilities: a member of Vozmozhnost start up team, owner of financial and information systems, secretary of the Board of Directors. Achievenments: Developed a format for international financial reporting and analysis for Opportunity Russia. Developed an electronic system for transition of standard Russian accounting information into GAAP format for Opportunity Partners in Russia. Learnt basics of banking business and corporate governance. Executive Director's Assistant NGO Vozmozhnost, Nizhny January 1994  –  January 1996  (2 years 1 month) Vozmozhnost is one of the first microcredit programs in Russia providing individual and group micro loans, equipment leases, business incubation services, professional and business training.  \nResponsibilities: a member of Vozmozhnost start up team, owner of financial and information systems, secretary of the Board of Directors. Achievenments: Developed a format for international financial reporting and analysis for Opportunity Russia. Developed an electronic system for transition of standard Russian accounting information into GAAP format for Opportunity Partners in Russia. Learnt basics of banking business and corporate governance. Owner Private entrepreneur January 1994  –  November 1994  (11 months) Food wholesales in Nizhny Novgorod, Russia. Learned what it means to run my own business and importance of controls. Owner Private entrepreneur January 1994  –  November 1994  (11 months) Food wholesales in Nizhny Novgorod, Russia. Learned what it means to run my own business and importance of controls. Officer White See and Onega Company January 1992  –  January 1993  (1 year 1 month) Responsible for navigational equipment, cash operations and financial documentation on the ship. Learned cash management and importance of the team. Officer White See and Onega Company January 1992  –  January 1993  (1 year 1 month) Responsible for navigational equipment, cash operations and financial documentation on the ship. Learned cash management and importance of the team. Languages English Full professional proficiency Russian Native or bilingual proficiency English Full professional proficiency Russian Native or bilingual proficiency English Full professional proficiency Russian Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Intel Financial Forecasting Financial Modeling Financial Analysis Semiconductors Financial Control Corporate Finance Budgeting NPV Emerging Markets Internal Controls People Management Finance Operations Start-ups Business Strategy Strategy Development Strategic Planning Acquisition Integration Management Finance Budgets Project Management Program Management Strategy Financial Audits Analysis Change Management Auditing Managerial Finance Leadership Integration Project Planning Banking Strategic Financial... Cross-functional Team... Forecasting Training See 22+     See less Skills  Intel Financial Forecasting Financial Modeling Financial Analysis Semiconductors Financial Control Corporate Finance Budgeting NPV Emerging Markets Internal Controls People Management Finance Operations Start-ups Business Strategy Strategy Development Strategic Planning Acquisition Integration Management Finance Budgets Project Management Program Management Strategy Financial Audits Analysis Change Management Auditing Managerial Finance Leadership Integration Project Planning Banking Strategic Financial... Cross-functional Team... Forecasting Training See 22+     See less Intel Financial Forecasting Financial Modeling Financial Analysis Semiconductors Financial Control Corporate Finance Budgeting NPV Emerging Markets Internal Controls People Management Finance Operations Start-ups Business Strategy Strategy Development Strategic Planning Acquisition Integration Management Finance Budgets Project Management Program Management Strategy Financial Audits Analysis Change Management Auditing Managerial Finance Leadership Integration Project Planning Banking Strategic Financial... Cross-functional Team... Forecasting Training See 22+     See less Intel Financial Forecasting Financial Modeling Financial Analysis Semiconductors Financial Control Corporate Finance Budgeting NPV Emerging Markets Internal Controls People Management Finance Operations Start-ups Business Strategy Strategy Development Strategic Planning Acquisition Integration Management Finance Budgets Project Management Program Management Strategy Financial Audits Analysis Change Management Auditing Managerial Finance Leadership Integration Project Planning Banking Strategic Financial... Cross-functional Team... Forecasting Training See 22+     See less Education The Open University Master of Science in Finance,  Finance and Accounting 2008  – 2009 The Open University MBA,  Finance and Management 2004  – 2006 Professional Trainer Program (CGAP) Certificate,  Training and Facilitation 2000  – 2001 Water Transport Engineering Academy Master's degree,  engineering 1986  – 1992 The Open University Master of Science in Finance,  Finance and Accounting 2008  – 2009 The Open University Master of Science in Finance,  Finance and Accounting 2008  – 2009 The Open University Master of Science in Finance,  Finance and Accounting 2008  – 2009 The Open University MBA,  Finance and Management 2004  – 2006 The Open University MBA,  Finance and Management 2004  – 2006 The Open University MBA,  Finance and Management 2004  – 2006 Professional Trainer Program (CGAP) Certificate,  Training and Facilitation 2000  – 2001 Professional Trainer Program (CGAP) Certificate,  Training and Facilitation 2000  – 2001 Professional Trainer Program (CGAP) Certificate,  Training and Facilitation 2000  – 2001 Water Transport Engineering Academy Master's degree,  engineering 1986  – 1992 Water Transport Engineering Academy Master's degree,  engineering 1986  – 1992 Water Transport Engineering Academy Master's degree,  engineering 1986  – 1992 ", "Summary Senior finance executive with broad and deep experience in financial management, business leadership, working with C-level staff and Board of Directors. ‘Hands-on’ and detail-oriented professional with an established record of success in leadership for start-up to Fortune 50 businesses. Direct experience managing end-to-end FP&A and accounting activities related to hardware and software products, SaaS/Cloud computing and E-commerce.  \n \nExpertise: Financial analysis & strategic planning, P&L and cash flow management, budgeting and forecasting, restructuring and business turnaround, e-Commerce & B2B (MM, Enterprise) SaaS, strategic global alliance management, internal controls under Sarbanes-Oxley, revenue recognition, credit and risk management, equity and debt management; M&A. Summary Senior finance executive with broad and deep experience in financial management, business leadership, working with C-level staff and Board of Directors. ‘Hands-on’ and detail-oriented professional with an established record of success in leadership for start-up to Fortune 50 businesses. Direct experience managing end-to-end FP&A and accounting activities related to hardware and software products, SaaS/Cloud computing and E-commerce.  \n \nExpertise: Financial analysis & strategic planning, P&L and cash flow management, budgeting and forecasting, restructuring and business turnaround, e-Commerce & B2B (MM, Enterprise) SaaS, strategic global alliance management, internal controls under Sarbanes-Oxley, revenue recognition, credit and risk management, equity and debt management; M&A. Senior finance executive with broad and deep experience in financial management, business leadership, working with C-level staff and Board of Directors. ‘Hands-on’ and detail-oriented professional with an established record of success in leadership for start-up to Fortune 50 businesses. Direct experience managing end-to-end FP&A and accounting activities related to hardware and software products, SaaS/Cloud computing and E-commerce.  \n \nExpertise: Financial analysis & strategic planning, P&L and cash flow management, budgeting and forecasting, restructuring and business turnaround, e-Commerce & B2B (MM, Enterprise) SaaS, strategic global alliance management, internal controls under Sarbanes-Oxley, revenue recognition, credit and risk management, equity and debt management; M&A. Senior finance executive with broad and deep experience in financial management, business leadership, working with C-level staff and Board of Directors. ‘Hands-on’ and detail-oriented professional with an established record of success in leadership for start-up to Fortune 50 businesses. Direct experience managing end-to-end FP&A and accounting activities related to hardware and software products, SaaS/Cloud computing and E-commerce.  \n \nExpertise: Financial analysis & strategic planning, P&L and cash flow management, budgeting and forecasting, restructuring and business turnaround, e-Commerce & B2B (MM, Enterprise) SaaS, strategic global alliance management, internal controls under Sarbanes-Oxley, revenue recognition, credit and risk management, equity and debt management; M&A. Experience Senior Finance Director Intel Corporation June 2015  – Present (3 months) Santa Clara, California Intel’s Client Computing Group empower the world with the best personal computing experiences. Head of Financial Planning & Analysis Jawbone January 2015  –  June 2015  (6 months) San Francisco Bay Area Provide leadership to the financial planning & analysis team responsible for all aspects of business planning cycle including: strategic planning, annual planning, quarterly and monthly forecasting, COGS and OPEX management as well as finance business partner to product, engineering and the technology team. Vice President of Finance Deem, Inc. October 2011  –  December 2014  (3 years 3 months) San Francisco Bay Area Vice President, Finance\tDec 2012-Present \nResponsible for corporate FP&A, controllership, sales operations, pricing review, stock administration, and internal control functions for a VC backed SaaS company. As acting CFO (18 months) reported directly to the CEO, and served as liaison to the Board of Directors for financial affairs; led lenders committee.  \n•\tManaged global staff of 20+ finance staff \n•\tDeveloped as part of executive team, strategic business plans and evaluation of alternative opportunities including expansion in overseas markets, product, pricing and licensing strategy for business growth.  \n•\tDeveloped and executed restructuring that resulted in 83% improvement in operating margin.  \n•\tReduced OPEX by >25%; implemented vendor management processes, renegotiated vendor contracts and office consolidation. \n•\tAs interim CFO, led recapitalization initiative resulting in a successful closing of $70M+ equity round.  \n \nSenior Director, Finance\tOct 2011-Nov 2012 \nLed financial analysis team responsible for all aspects of business planning cycle including: strategic planning, quota setting, annual planning, quarterly and monthly forecasting.  \n•\tBuilt complex financial models, including liquidity preference, cash flow, marginal cost and investor ROI.  \n•\tImproved forecasting process; expanded to a rolling six quarter forecast.  \n•\tDeveloped executive dashboard and analytics and worked with product, sales and marketing organizations on strategies to improve customer acquisition costs and lifetime value, pricing, attrition, cost of revenues and operating expenses. \n•\tDrove direct links between KPIs and financial plans. Implemented software revenue recognition policy. \n•\tManaged and reviewed new and existing deals/contracts, created and implemented an enhanced sales compensation model for the software sales team to increase productivity and deal yield by more than 25%. Chief Financial Officer SCI Pavement Services, LP January 2010  –  September 2011  (1 year 9 months) Rialto, California Led corporate FP&A, controllership, business operations, business analytics & reporting, human resources, recruiting and information technology for a $15M+ annual revenue PE backed company with 100+ employees. Created all financial models, including liquidation preferences, cash flow, marginal cost and investor ROI. Handled all Board and Investor communications and reported directly to the Chairman/CEO.  \n•\tIncreased revenues by 200% in the first year and improved operating margin by 200 points.  \n•\tDivested unprofitable services and focused the team on core profitable services. \n•\tImplemented estimating strategies, resulting in backlog growth of over 300%. \n•\tEliminated non-business critical overhead costs and streamlined operations, resulting in over 50% cost savings. \n•\tImplemented ERP software (ComputerEase) to automate manual accounting tasks (GAAP requirements) providing visibility to financial and business results. Senior Finance Manager Intuit, Inc. October 2005  –  January 2010  (4 years 4 months) Mountain View, California Responsible for financial planning, analysis and reporting for the Intuit Small Business Payroll products. Provided leadership to the Revenue team responsible for managing the Payroll business end-to-end. \n•\tLed 10–member cross-functional team in product and pricing re-architecture for the payroll products. \n•\tSuccessfully partnered with key business owners to develop 3-5 year strategic business plans for this business and ensured alignment between R&D, and Sales & Marketing. \n•\tDrove and presented the detailed financial and business analyses that were used to prioritize payroll business strategy during the Intuit annual business planning reviews. \n•\tPerformed detailed analysis in support of payroll channel strategy/expansion into Retails, Web and OEM.  \n•\tEstablished monthly process to effectively monitor and review Payroll KPI metrics with the leadership team. \n•\tPartnered with the product line General Manager to evaluate strategic businesses/revenue opportunities. \n•\tSupported PayCycle acquisition due diligence and successfully integrated their financial and operational processes into Intuit’s Payroll business structure. Improved business management reporting, budgeting and forecasting to a rolling monthly process with increased forward visibility on bookings and performance. Senior Finance and Business Strategy Manager Microsoft Corporation August 2003  –  September 2005  (2 years 2 months) Redmond, Washington Managed finance and strategic planning for Retail Management System (RMS), Point Of Sale (POS), and Live Business Services.  \n•\tSuccessfully partnered with key business owners to develop 3-5 year strategic business plans for these businesses, ensuring alignment between R & D, Sales & Marketing on product line strategies.  \n•\tDrove and presented the detailed financial and business analyses that were used to prioritize POS business strategy during the Microsoft Annual Business Planning Reviews.  \n•\tPerformed detailed analysis in support of POS channel strategy/expansion into Retails, Banks, OEM, Office distribution as well as prioritization of international roll-out of SBP product and data center hosting location. Various Senior Finance Positions Hewlett-Packard Company August 1990  –  July 2003  (13 years) San Francisco Bay Area Global Alliance Manager, Global Alliance Org.\t2002 - 2003 \nManaged the $150M+ AOL Time Warner/HP alliance relationship worldwide across four multi-billion dollar HP businesses to provide fully integrated, comprehensive and complete solutions to Customers.  \n•\tLed the business case and negotiation strategy allowing HP sales team to secure a favorable position with AOL Time Warner IT. Resulted in incremental revenue of $2M per year to HP.  \n•\tDeveloped and funded marketing program with service providers that increased subscriber revenues by $2M. \n \nOther HP Finance Experience \nController, HP Wireless and Internet Services Division\t2000 – 2002 \nFinancial Operations Manager, Channel Credit & Risk Management (CCRMO)\t1998 – 2000 \nFinance Manager, NA Consumer Products Business Organization (NACPBO) 1997- 1998 \nBusiness Analyst, Software Services & Technology Division\t1995 –1997 \nSenior Financial Analyst, Santa Clara Site\t1993 - 1995 \nCredit Analyst, Personal Computer and Distribution Organization\t1990 - 1993 Senior Finance Director Intel Corporation June 2015  – Present (3 months) Santa Clara, California Intel’s Client Computing Group empower the world with the best personal computing experiences. Senior Finance Director Intel Corporation June 2015  – Present (3 months) Santa Clara, California Intel’s Client Computing Group empower the world with the best personal computing experiences. Head of Financial Planning & Analysis Jawbone January 2015  –  June 2015  (6 months) San Francisco Bay Area Provide leadership to the financial planning & analysis team responsible for all aspects of business planning cycle including: strategic planning, annual planning, quarterly and monthly forecasting, COGS and OPEX management as well as finance business partner to product, engineering and the technology team. Head of Financial Planning & Analysis Jawbone January 2015  –  June 2015  (6 months) San Francisco Bay Area Provide leadership to the financial planning & analysis team responsible for all aspects of business planning cycle including: strategic planning, annual planning, quarterly and monthly forecasting, COGS and OPEX management as well as finance business partner to product, engineering and the technology team. Vice President of Finance Deem, Inc. October 2011  –  December 2014  (3 years 3 months) San Francisco Bay Area Vice President, Finance\tDec 2012-Present \nResponsible for corporate FP&A, controllership, sales operations, pricing review, stock administration, and internal control functions for a VC backed SaaS company. As acting CFO (18 months) reported directly to the CEO, and served as liaison to the Board of Directors for financial affairs; led lenders committee.  \n•\tManaged global staff of 20+ finance staff \n•\tDeveloped as part of executive team, strategic business plans and evaluation of alternative opportunities including expansion in overseas markets, product, pricing and licensing strategy for business growth.  \n•\tDeveloped and executed restructuring that resulted in 83% improvement in operating margin.  \n•\tReduced OPEX by >25%; implemented vendor management processes, renegotiated vendor contracts and office consolidation. \n•\tAs interim CFO, led recapitalization initiative resulting in a successful closing of $70M+ equity round.  \n \nSenior Director, Finance\tOct 2011-Nov 2012 \nLed financial analysis team responsible for all aspects of business planning cycle including: strategic planning, quota setting, annual planning, quarterly and monthly forecasting.  \n•\tBuilt complex financial models, including liquidity preference, cash flow, marginal cost and investor ROI.  \n•\tImproved forecasting process; expanded to a rolling six quarter forecast.  \n•\tDeveloped executive dashboard and analytics and worked with product, sales and marketing organizations on strategies to improve customer acquisition costs and lifetime value, pricing, attrition, cost of revenues and operating expenses. \n•\tDrove direct links between KPIs and financial plans. Implemented software revenue recognition policy. \n•\tManaged and reviewed new and existing deals/contracts, created and implemented an enhanced sales compensation model for the software sales team to increase productivity and deal yield by more than 25%. Vice President of Finance Deem, Inc. October 2011  –  December 2014  (3 years 3 months) San Francisco Bay Area Vice President, Finance\tDec 2012-Present \nResponsible for corporate FP&A, controllership, sales operations, pricing review, stock administration, and internal control functions for a VC backed SaaS company. As acting CFO (18 months) reported directly to the CEO, and served as liaison to the Board of Directors for financial affairs; led lenders committee.  \n•\tManaged global staff of 20+ finance staff \n•\tDeveloped as part of executive team, strategic business plans and evaluation of alternative opportunities including expansion in overseas markets, product, pricing and licensing strategy for business growth.  \n•\tDeveloped and executed restructuring that resulted in 83% improvement in operating margin.  \n•\tReduced OPEX by >25%; implemented vendor management processes, renegotiated vendor contracts and office consolidation. \n•\tAs interim CFO, led recapitalization initiative resulting in a successful closing of $70M+ equity round.  \n \nSenior Director, Finance\tOct 2011-Nov 2012 \nLed financial analysis team responsible for all aspects of business planning cycle including: strategic planning, quota setting, annual planning, quarterly and monthly forecasting.  \n•\tBuilt complex financial models, including liquidity preference, cash flow, marginal cost and investor ROI.  \n•\tImproved forecasting process; expanded to a rolling six quarter forecast.  \n•\tDeveloped executive dashboard and analytics and worked with product, sales and marketing organizations on strategies to improve customer acquisition costs and lifetime value, pricing, attrition, cost of revenues and operating expenses. \n•\tDrove direct links between KPIs and financial plans. Implemented software revenue recognition policy. \n•\tManaged and reviewed new and existing deals/contracts, created and implemented an enhanced sales compensation model for the software sales team to increase productivity and deal yield by more than 25%. Chief Financial Officer SCI Pavement Services, LP January 2010  –  September 2011  (1 year 9 months) Rialto, California Led corporate FP&A, controllership, business operations, business analytics & reporting, human resources, recruiting and information technology for a $15M+ annual revenue PE backed company with 100+ employees. Created all financial models, including liquidation preferences, cash flow, marginal cost and investor ROI. Handled all Board and Investor communications and reported directly to the Chairman/CEO.  \n•\tIncreased revenues by 200% in the first year and improved operating margin by 200 points.  \n•\tDivested unprofitable services and focused the team on core profitable services. \n•\tImplemented estimating strategies, resulting in backlog growth of over 300%. \n•\tEliminated non-business critical overhead costs and streamlined operations, resulting in over 50% cost savings. \n•\tImplemented ERP software (ComputerEase) to automate manual accounting tasks (GAAP requirements) providing visibility to financial and business results. Chief Financial Officer SCI Pavement Services, LP January 2010  –  September 2011  (1 year 9 months) Rialto, California Led corporate FP&A, controllership, business operations, business analytics & reporting, human resources, recruiting and information technology for a $15M+ annual revenue PE backed company with 100+ employees. Created all financial models, including liquidation preferences, cash flow, marginal cost and investor ROI. Handled all Board and Investor communications and reported directly to the Chairman/CEO.  \n•\tIncreased revenues by 200% in the first year and improved operating margin by 200 points.  \n•\tDivested unprofitable services and focused the team on core profitable services. \n•\tImplemented estimating strategies, resulting in backlog growth of over 300%. \n•\tEliminated non-business critical overhead costs and streamlined operations, resulting in over 50% cost savings. \n•\tImplemented ERP software (ComputerEase) to automate manual accounting tasks (GAAP requirements) providing visibility to financial and business results. Senior Finance Manager Intuit, Inc. October 2005  –  January 2010  (4 years 4 months) Mountain View, California Responsible for financial planning, analysis and reporting for the Intuit Small Business Payroll products. Provided leadership to the Revenue team responsible for managing the Payroll business end-to-end. \n•\tLed 10–member cross-functional team in product and pricing re-architecture for the payroll products. \n•\tSuccessfully partnered with key business owners to develop 3-5 year strategic business plans for this business and ensured alignment between R&D, and Sales & Marketing. \n•\tDrove and presented the detailed financial and business analyses that were used to prioritize payroll business strategy during the Intuit annual business planning reviews. \n•\tPerformed detailed analysis in support of payroll channel strategy/expansion into Retails, Web and OEM.  \n•\tEstablished monthly process to effectively monitor and review Payroll KPI metrics with the leadership team. \n•\tPartnered with the product line General Manager to evaluate strategic businesses/revenue opportunities. \n•\tSupported PayCycle acquisition due diligence and successfully integrated their financial and operational processes into Intuit’s Payroll business structure. Improved business management reporting, budgeting and forecasting to a rolling monthly process with increased forward visibility on bookings and performance. Senior Finance Manager Intuit, Inc. October 2005  –  January 2010  (4 years 4 months) Mountain View, California Responsible for financial planning, analysis and reporting for the Intuit Small Business Payroll products. Provided leadership to the Revenue team responsible for managing the Payroll business end-to-end. \n•\tLed 10–member cross-functional team in product and pricing re-architecture for the payroll products. \n•\tSuccessfully partnered with key business owners to develop 3-5 year strategic business plans for this business and ensured alignment between R&D, and Sales & Marketing. \n•\tDrove and presented the detailed financial and business analyses that were used to prioritize payroll business strategy during the Intuit annual business planning reviews. \n•\tPerformed detailed analysis in support of payroll channel strategy/expansion into Retails, Web and OEM.  \n•\tEstablished monthly process to effectively monitor and review Payroll KPI metrics with the leadership team. \n•\tPartnered with the product line General Manager to evaluate strategic businesses/revenue opportunities. \n•\tSupported PayCycle acquisition due diligence and successfully integrated their financial and operational processes into Intuit’s Payroll business structure. Improved business management reporting, budgeting and forecasting to a rolling monthly process with increased forward visibility on bookings and performance. Senior Finance and Business Strategy Manager Microsoft Corporation August 2003  –  September 2005  (2 years 2 months) Redmond, Washington Managed finance and strategic planning for Retail Management System (RMS), Point Of Sale (POS), and Live Business Services.  \n•\tSuccessfully partnered with key business owners to develop 3-5 year strategic business plans for these businesses, ensuring alignment between R & D, Sales & Marketing on product line strategies.  \n•\tDrove and presented the detailed financial and business analyses that were used to prioritize POS business strategy during the Microsoft Annual Business Planning Reviews.  \n•\tPerformed detailed analysis in support of POS channel strategy/expansion into Retails, Banks, OEM, Office distribution as well as prioritization of international roll-out of SBP product and data center hosting location. Senior Finance and Business Strategy Manager Microsoft Corporation August 2003  –  September 2005  (2 years 2 months) Redmond, Washington Managed finance and strategic planning for Retail Management System (RMS), Point Of Sale (POS), and Live Business Services.  \n•\tSuccessfully partnered with key business owners to develop 3-5 year strategic business plans for these businesses, ensuring alignment between R & D, Sales & Marketing on product line strategies.  \n•\tDrove and presented the detailed financial and business analyses that were used to prioritize POS business strategy during the Microsoft Annual Business Planning Reviews.  \n•\tPerformed detailed analysis in support of POS channel strategy/expansion into Retails, Banks, OEM, Office distribution as well as prioritization of international roll-out of SBP product and data center hosting location. Various Senior Finance Positions Hewlett-Packard Company August 1990  –  July 2003  (13 years) San Francisco Bay Area Global Alliance Manager, Global Alliance Org.\t2002 - 2003 \nManaged the $150M+ AOL Time Warner/HP alliance relationship worldwide across four multi-billion dollar HP businesses to provide fully integrated, comprehensive and complete solutions to Customers.  \n•\tLed the business case and negotiation strategy allowing HP sales team to secure a favorable position with AOL Time Warner IT. Resulted in incremental revenue of $2M per year to HP.  \n•\tDeveloped and funded marketing program with service providers that increased subscriber revenues by $2M. \n \nOther HP Finance Experience \nController, HP Wireless and Internet Services Division\t2000 – 2002 \nFinancial Operations Manager, Channel Credit & Risk Management (CCRMO)\t1998 – 2000 \nFinance Manager, NA Consumer Products Business Organization (NACPBO) 1997- 1998 \nBusiness Analyst, Software Services & Technology Division\t1995 –1997 \nSenior Financial Analyst, Santa Clara Site\t1993 - 1995 \nCredit Analyst, Personal Computer and Distribution Organization\t1990 - 1993 Various Senior Finance Positions Hewlett-Packard Company August 1990  –  July 2003  (13 years) San Francisco Bay Area Global Alliance Manager, Global Alliance Org.\t2002 - 2003 \nManaged the $150M+ AOL Time Warner/HP alliance relationship worldwide across four multi-billion dollar HP businesses to provide fully integrated, comprehensive and complete solutions to Customers.  \n•\tLed the business case and negotiation strategy allowing HP sales team to secure a favorable position with AOL Time Warner IT. Resulted in incremental revenue of $2M per year to HP.  \n•\tDeveloped and funded marketing program with service providers that increased subscriber revenues by $2M. \n \nOther HP Finance Experience \nController, HP Wireless and Internet Services Division\t2000 – 2002 \nFinancial Operations Manager, Channel Credit & Risk Management (CCRMO)\t1998 – 2000 \nFinance Manager, NA Consumer Products Business Organization (NACPBO) 1997- 1998 \nBusiness Analyst, Software Services & Technology Division\t1995 –1997 \nSenior Financial Analyst, Santa Clara Site\t1993 - 1995 \nCredit Analyst, Personal Computer and Distribution Organization\t1990 - 1993 Skills Cross-functional Team... Operational Excellence Growth Management Revenue Recognition Business Planning Business Strategy Management Enterprise Software Accounting Strategic Partnerships Risk Management Internal Audit Leadership Mergers Managerial Finance P&L Management Strategic Planning Finance Financial Modeling Venture Capital Mergers & Acquisitions Accounts Receivable Start-ups Executive Management Budgets Financial Analysis Analysis Business Development Strategy Corporate Finance Process Improvement Acquisition Integration Internal Controls Forecasting Organizational... Negotiation Financial Reporting Auditing Analytics SaaS Cloud Computing See 26+     See less Skills  Cross-functional Team... Operational Excellence Growth Management Revenue Recognition Business Planning Business Strategy Management Enterprise Software Accounting Strategic Partnerships Risk Management Internal Audit Leadership Mergers Managerial Finance P&L Management Strategic Planning Finance Financial Modeling Venture Capital Mergers & Acquisitions Accounts Receivable Start-ups Executive Management Budgets Financial Analysis Analysis Business Development Strategy Corporate Finance Process Improvement Acquisition Integration Internal Controls Forecasting Organizational... Negotiation Financial Reporting Auditing Analytics SaaS Cloud Computing See 26+     See less Cross-functional Team... Operational Excellence Growth Management Revenue Recognition Business Planning Business Strategy Management Enterprise Software Accounting Strategic Partnerships Risk Management Internal Audit Leadership Mergers Managerial Finance P&L Management Strategic Planning Finance Financial Modeling Venture Capital Mergers & Acquisitions Accounts Receivable Start-ups Executive Management Budgets Financial Analysis Analysis Business Development Strategy Corporate Finance Process Improvement Acquisition Integration Internal Controls Forecasting Organizational... Negotiation Financial Reporting Auditing Analytics SaaS Cloud Computing See 26+     See less Cross-functional Team... Operational Excellence Growth Management Revenue Recognition Business Planning Business Strategy Management Enterprise Software Accounting Strategic Partnerships Risk Management Internal Audit Leadership Mergers Managerial Finance P&L Management Strategic Planning Finance Financial Modeling Venture Capital Mergers & Acquisitions Accounts Receivable Start-ups Executive Management Budgets Financial Analysis Analysis Business Development Strategy Corporate Finance Process Improvement Acquisition Integration Internal Controls Forecasting Organizational... Negotiation Financial Reporting Auditing Analytics SaaS Cloud Computing See 26+     See less Education Pepperdine University, The George L. Graziadio School of Business and Management MBA,  Finance & Strategic Management 1998  – 2000 California State University-East Bay BSc.,  Accounting and Finance 1986  – 1990 Activities and Societies:  Member of NABA Pepperdine University, The George L. Graziadio School of Business and Management MBA,  Finance & Strategic Management 1998  – 2000 Pepperdine University, The George L. Graziadio School of Business and Management MBA,  Finance & Strategic Management 1998  – 2000 Pepperdine University, The George L. Graziadio School of Business and Management MBA,  Finance & Strategic Management 1998  – 2000 California State University-East Bay BSc.,  Accounting and Finance 1986  – 1990 Activities and Societies:  Member of NABA California State University-East Bay BSc.,  Accounting and Finance 1986  – 1990 Activities and Societies:  Member of NABA California State University-East Bay BSc.,  Accounting and Finance 1986  – 1990 Activities and Societies:  Member of NABA "]}