{"position": "Firmware Engineer", "company": "IBM", "profiles": ["Experience Senior Firmware Engineer IBM May 2008  – Present (7 years 4 months) Bangalore Associate Engineer Tech Mahindra January 2006  –  May 2008  (2 years 5 months) Senior Firmware Engineer IBM May 2008  – Present (7 years 4 months) Bangalore Senior Firmware Engineer IBM May 2008  – Present (7 years 4 months) Bangalore Associate Engineer Tech Mahindra January 2006  –  May 2008  (2 years 5 months) Associate Engineer Tech Mahindra January 2006  –  May 2008  (2 years 5 months) Skills Virtualization Firmware Engineer Operating Systems Shell Scripting Perl Script Onsite Coordination REST APIs C Skills  Virtualization Firmware Engineer Operating Systems Shell Scripting Perl Script Onsite Coordination REST APIs C Virtualization Firmware Engineer Operating Systems Shell Scripting Perl Script Onsite Coordination REST APIs C Virtualization Firmware Engineer Operating Systems Shell Scripting Perl Script Onsite Coordination REST APIs C Education BITS Pilani M.S,  Software Systems 2009  – 2010 BITS Pilani M.S,  Software Systems 2009  – 2010 BITS Pilani M.S,  Software Systems 2009  – 2010 BITS Pilani M.S,  Software Systems 2009  – 2010 ", "Experience Advisory Firmware Engineer IBM November 2008  –  March 2012  (3 years 5 months) Tucson, Arizona Area Principal Product Engineer - Software TRW November 2004  –  November 2008  (4 years 1 month) Winona, MN Principal R&D Engineer, Electronics & Software Design Mettler-Toledo International, Inc 1996  –  2004  (8 years) Spartanburg, SC Process Control Engineer Regulating Control System INC 1985  –  1996  (11 years) Portage, Indiana Advisory Firmware Engineer IBM November 2008  –  March 2012  (3 years 5 months) Tucson, Arizona Area Advisory Firmware Engineer IBM November 2008  –  March 2012  (3 years 5 months) Tucson, Arizona Area Principal Product Engineer - Software TRW November 2004  –  November 2008  (4 years 1 month) Winona, MN Principal Product Engineer - Software TRW November 2004  –  November 2008  (4 years 1 month) Winona, MN Principal R&D Engineer, Electronics & Software Design Mettler-Toledo International, Inc 1996  –  2004  (8 years) Spartanburg, SC Principal R&D Engineer, Electronics & Software Design Mettler-Toledo International, Inc 1996  –  2004  (8 years) Spartanburg, SC Process Control Engineer Regulating Control System INC 1985  –  1996  (11 years) Portage, Indiana Process Control Engineer Regulating Control System INC 1985  –  1996  (11 years) Portage, Indiana Education Purdue University Calumet Electrical Engineering Valparaiso Technical Institute Valparaiso Technical Institute Associate of Science (A.S.),  Electrical Engineering Purdue University Calumet Electrical Engineering Purdue University Calumet Electrical Engineering Purdue University Calumet Electrical Engineering Valparaiso Technical Institute Valparaiso Technical Institute Valparaiso Technical Institute Valparaiso Technical Institute Associate of Science (A.S.),  Electrical Engineering Valparaiso Technical Institute Associate of Science (A.S.),  Electrical Engineering Valparaiso Technical Institute Associate of Science (A.S.),  Electrical Engineering ", "Experience Firmware Engineer IBM April 2013  – Present (2 years 5 months) Design Verification Engineer IBM April 1996  –  April 2013  (17 years 1 month) Firmware Engineer IBM April 2013  – Present (2 years 5 months) Firmware Engineer IBM April 2013  – Present (2 years 5 months) Design Verification Engineer IBM April 1996  –  April 2013  (17 years 1 month) Design Verification Engineer IBM April 1996  –  April 2013  (17 years 1 month) Skills Verilog Unix Shell Scripting ASIC Computer Architecture Functional Verification C C++ Debugging VHDL Static Timing Analysis Microprocessors Hardware Architecture Processors FPGA Perl Logic Design TCL Embedded Systems EDA SoC VLSI Timing Closure RTL design Firmware PowerPC Simulations Hardware CVS Assembly Language Embedded Software Circuit Design Integrated Circuit... CMOS Semiconductors Computer Engineering Software Engineering RTOS SystemVerilog Ethernet ModelSim Physical Design Signal Integrity X86 Veritas Cluster Server Embedded Linux ARM NCSim Cadence Virtuoso Linux See 35+     See less Skills  Verilog Unix Shell Scripting ASIC Computer Architecture Functional Verification C C++ Debugging VHDL Static Timing Analysis Microprocessors Hardware Architecture Processors FPGA Perl Logic Design TCL Embedded Systems EDA SoC VLSI Timing Closure RTL design Firmware PowerPC Simulations Hardware CVS Assembly Language Embedded Software Circuit Design Integrated Circuit... CMOS Semiconductors Computer Engineering Software Engineering RTOS SystemVerilog Ethernet ModelSim Physical Design Signal Integrity X86 Veritas Cluster Server Embedded Linux ARM NCSim Cadence Virtuoso Linux See 35+     See less Verilog Unix Shell Scripting ASIC Computer Architecture Functional Verification C C++ Debugging VHDL Static Timing Analysis Microprocessors Hardware Architecture Processors FPGA Perl Logic Design TCL Embedded Systems EDA SoC VLSI Timing Closure RTL design Firmware PowerPC Simulations Hardware CVS Assembly Language Embedded Software Circuit Design Integrated Circuit... CMOS Semiconductors Computer Engineering Software Engineering RTOS SystemVerilog Ethernet ModelSim Physical Design Signal Integrity X86 Veritas Cluster Server Embedded Linux ARM NCSim Cadence Virtuoso Linux See 35+     See less Verilog Unix Shell Scripting ASIC Computer Architecture Functional Verification C C++ Debugging VHDL Static Timing Analysis Microprocessors Hardware Architecture Processors FPGA Perl Logic Design TCL Embedded Systems EDA SoC VLSI Timing Closure RTL design Firmware PowerPC Simulations Hardware CVS Assembly Language Embedded Software Circuit Design Integrated Circuit... CMOS Semiconductors Computer Engineering Software Engineering RTOS SystemVerilog Ethernet ModelSim Physical Design Signal Integrity X86 Veritas Cluster Server Embedded Linux ARM NCSim Cadence Virtuoso Linux See 35+     See less Education St Cloud State University BSEE St Cloud State University BSEE St Cloud State University BSEE St Cloud State University BSEE ", "Experience Firmware Engineer IBM November 2008  –  October 2011  (3 years) Project Engineer Wipro Technologies August 2005  –  October 2008  (3 years 3 months) Project Trainee SAP Labs January 2005  –  July 2005  (7 months) Firmware Engineer IBM November 2008  –  October 2011  (3 years) Firmware Engineer IBM November 2008  –  October 2011  (3 years) Project Engineer Wipro Technologies August 2005  –  October 2008  (3 years 3 months) Project Engineer Wipro Technologies August 2005  –  October 2008  (3 years 3 months) Project Trainee SAP Labs January 2005  –  July 2005  (7 months) Project Trainee SAP Labs January 2005  –  July 2005  (7 months) Education National Institute of Technology Karnataka MCA 2002  – 2005 National Institute of Technology Karnataka MCA 2002  – 2005 National Institute of Technology Karnataka MCA 2002  – 2005 National Institute of Technology Karnataka MCA 2002  – 2005 ", "Skills Agile Methodologies SaaS Enterprise Software Cloud Computing Scrum Enterprise Architecture Software Development BMC Patrol XML Software Project... Software Engineering Unix Systems Management Architecture Distributed Systems SDLC Agile Project Management SOA Virtualization Integration Requirements Analysis Solution Architecture AIX Linux Operating Systems Shell Scripting Solaris System Architecture Pre-sales Web Applications Web Services Software Design See 17+     See less Skills  Agile Methodologies SaaS Enterprise Software Cloud Computing Scrum Enterprise Architecture Software Development BMC Patrol XML Software Project... Software Engineering Unix Systems Management Architecture Distributed Systems SDLC Agile Project Management SOA Virtualization Integration Requirements Analysis Solution Architecture AIX Linux Operating Systems Shell Scripting Solaris System Architecture Pre-sales Web Applications Web Services Software Design See 17+     See less Agile Methodologies SaaS Enterprise Software Cloud Computing Scrum Enterprise Architecture Software Development BMC Patrol XML Software Project... Software Engineering Unix Systems Management Architecture Distributed Systems SDLC Agile Project Management SOA Virtualization Integration Requirements Analysis Solution Architecture AIX Linux Operating Systems Shell Scripting Solaris System Architecture Pre-sales Web Applications Web Services Software Design See 17+     See less Agile Methodologies SaaS Enterprise Software Cloud Computing Scrum Enterprise Architecture Software Development BMC Patrol XML Software Project... Software Engineering Unix Systems Management Architecture Distributed Systems SDLC Agile Project Management SOA Virtualization Integration Requirements Analysis Solution Architecture AIX Linux Operating Systems Shell Scripting Solaris System Architecture Pre-sales Web Applications Web Services Software Design See 17+     See less ", "Experience FIrmware Engineer IBM RAID Firmware Engineer IBM 1998  –  2001  (3 years) FIrmware Engineer IBM FIrmware Engineer IBM RAID Firmware Engineer IBM 1998  –  2001  (3 years) RAID Firmware Engineer IBM 1998  –  2001  (3 years) ", "Skills SCSI Embedded Software RAID Fibre Channel Storage Firmware Embedded Systems ARM SATA Unix Device Drivers Software Development Enterprise Storage FCoE iSCSI Debugging TCP/IP RTOS ASIC SAN Ethernet C++ PCIe Software Engineering Storage Area Networks Perl See 11+     See less Skills  SCSI Embedded Software RAID Fibre Channel Storage Firmware Embedded Systems ARM SATA Unix Device Drivers Software Development Enterprise Storage FCoE iSCSI Debugging TCP/IP RTOS ASIC SAN Ethernet C++ PCIe Software Engineering Storage Area Networks Perl See 11+     See less SCSI Embedded Software RAID Fibre Channel Storage Firmware Embedded Systems ARM SATA Unix Device Drivers Software Development Enterprise Storage FCoE iSCSI Debugging TCP/IP RTOS ASIC SAN Ethernet C++ PCIe Software Engineering Storage Area Networks Perl See 11+     See less SCSI Embedded Software RAID Fibre Channel Storage Firmware Embedded Systems ARM SATA Unix Device Drivers Software Development Enterprise Storage FCoE iSCSI Debugging TCP/IP RTOS ASIC SAN Ethernet C++ PCIe Software Engineering Storage Area Networks Perl See 11+     See less ", "Experience Firmware Engineer IBM October 1998  – Present (16 years 11 months) Firmware Engineer IBM October 1998  – Present (16 years 11 months) Firmware Engineer IBM October 1998  – Present (16 years 11 months) Skills Storage Linux Debugging Embedded Systems Perl Unix C Hardware System Architecture Operating Systems Firmware Testing ASIC Software Engineering Hardware Architecture Skills  Storage Linux Debugging Embedded Systems Perl Unix C Hardware System Architecture Operating Systems Firmware Testing ASIC Software Engineering Hardware Architecture Storage Linux Debugging Embedded Systems Perl Unix C Hardware System Architecture Operating Systems Firmware Testing ASIC Software Engineering Hardware Architecture Storage Linux Debugging Embedded Systems Perl Unix C Hardware System Architecture Operating Systems Firmware Testing ASIC Software Engineering Hardware Architecture ", "Experience Advisory Firmware Engineer IBM August 2013  – Present (2 years 1 month) Develop and maintain firmware that runs on an embedded Fibre Channel adapter for the z Systems mainframe. Firmware Execution Lead IBM May 2012  – Present (3 years 4 months) Manage the day to day operations of a development team working on firmware for an embedded Fibre Channel adapter for the z Systems mainframe. Staff Firmware Engineer IBM July 2011  –  August 2013  (2 years 2 months) Develop and maintain firmware that runs on an embedded Fibre Channel adapter for the z Systems mainframe. Firmware Engineer IBM June 2006  –  July 2011  (5 years 2 months) Develop and maintain firmware that runs on an embedded Fibre Channel adapter for the z Systems mainframe. Advisory Firmware Engineer IBM August 2013  – Present (2 years 1 month) Develop and maintain firmware that runs on an embedded Fibre Channel adapter for the z Systems mainframe. Advisory Firmware Engineer IBM August 2013  – Present (2 years 1 month) Develop and maintain firmware that runs on an embedded Fibre Channel adapter for the z Systems mainframe. Firmware Execution Lead IBM May 2012  – Present (3 years 4 months) Manage the day to day operations of a development team working on firmware for an embedded Fibre Channel adapter for the z Systems mainframe. Firmware Execution Lead IBM May 2012  – Present (3 years 4 months) Manage the day to day operations of a development team working on firmware for an embedded Fibre Channel adapter for the z Systems mainframe. Staff Firmware Engineer IBM July 2011  –  August 2013  (2 years 2 months) Develop and maintain firmware that runs on an embedded Fibre Channel adapter for the z Systems mainframe. Staff Firmware Engineer IBM July 2011  –  August 2013  (2 years 2 months) Develop and maintain firmware that runs on an embedded Fibre Channel adapter for the z Systems mainframe. Firmware Engineer IBM June 2006  –  July 2011  (5 years 2 months) Develop and maintain firmware that runs on an embedded Fibre Channel adapter for the z Systems mainframe. Firmware Engineer IBM June 2006  –  July 2011  (5 years 2 months) Develop and maintain firmware that runs on an embedded Fibre Channel adapter for the z Systems mainframe. Skills Fibre Channel Firmware Embedded Systems Debugging Device Drivers Shell Scripting Software Engineering C VHDL PowerPC Processors Computer Engineering Microprocessors Embedded C Microcode Computer Architecture C++ Mainframe AIX Programming Verilog Unix Hardware Eclipse Operating Systems Testing Software Development FICON IBM Mainframe Embedded Software See 15+     See less Skills  Fibre Channel Firmware Embedded Systems Debugging Device Drivers Shell Scripting Software Engineering C VHDL PowerPC Processors Computer Engineering Microprocessors Embedded C Microcode Computer Architecture C++ Mainframe AIX Programming Verilog Unix Hardware Eclipse Operating Systems Testing Software Development FICON IBM Mainframe Embedded Software See 15+     See less Fibre Channel Firmware Embedded Systems Debugging Device Drivers Shell Scripting Software Engineering C VHDL PowerPC Processors Computer Engineering Microprocessors Embedded C Microcode Computer Architecture C++ Mainframe AIX Programming Verilog Unix Hardware Eclipse Operating Systems Testing Software Development FICON IBM Mainframe Embedded Software See 15+     See less Fibre Channel Firmware Embedded Systems Debugging Device Drivers Shell Scripting Software Engineering C VHDL PowerPC Processors Computer Engineering Microprocessors Embedded C Microcode Computer Architecture C++ Mainframe AIX Programming Verilog Unix Hardware Eclipse Operating Systems Testing Software Development FICON IBM Mainframe Embedded Software See 15+     See less Education Binghamton University MS,  Electrical Engineering 2004  – 2006 Graduated Magna Cum Laude \nConcentration in Computer Engineering \nMasters Thesis: \"Efficient Register File Management Through Reallocation,\" August 2006 Binghamton University BS,  Computer Engineering 2000  – 2004 Graduated Magna Cum Laude \nReceived Award for Outstanding Academic Achievement in Baccalaureate Studies in Computer Engineering Activities and Societies:  Member of Tau Beta Pi and Eta Kappa Nu engineering Honor Societies Binghamton University MS,  Electrical Engineering 2004  – 2006 Graduated Magna Cum Laude \nConcentration in Computer Engineering \nMasters Thesis: \"Efficient Register File Management Through Reallocation,\" August 2006 Binghamton University MS,  Electrical Engineering 2004  – 2006 Graduated Magna Cum Laude \nConcentration in Computer Engineering \nMasters Thesis: \"Efficient Register File Management Through Reallocation,\" August 2006 Binghamton University MS,  Electrical Engineering 2004  – 2006 Graduated Magna Cum Laude \nConcentration in Computer Engineering \nMasters Thesis: \"Efficient Register File Management Through Reallocation,\" August 2006 Binghamton University BS,  Computer Engineering 2000  – 2004 Graduated Magna Cum Laude \nReceived Award for Outstanding Academic Achievement in Baccalaureate Studies in Computer Engineering Activities and Societies:  Member of Tau Beta Pi and Eta Kappa Nu engineering Honor Societies Binghamton University BS,  Computer Engineering 2000  – 2004 Graduated Magna Cum Laude \nReceived Award for Outstanding Academic Achievement in Baccalaureate Studies in Computer Engineering Activities and Societies:  Member of Tau Beta Pi and Eta Kappa Nu engineering Honor Societies Binghamton University BS,  Computer Engineering 2000  – 2004 Graduated Magna Cum Laude \nReceived Award for Outstanding Academic Achievement in Baccalaureate Studies in Computer Engineering Activities and Societies:  Member of Tau Beta Pi and Eta Kappa Nu engineering Honor Societies ", "Summary Application development (win32, linux, c++, java), firmware development (linux-ppc64/mips/arm, atmega, h8), networks (from ethernet to http), multimedia, linux kernel, powerpc, ppc64, qemu, kvm. \n \nThe goal is to continue with the stuff above, any combination. \n \nSpecialties: development, debugging, support Summary Application development (win32, linux, c++, java), firmware development (linux-ppc64/mips/arm, atmega, h8), networks (from ethernet to http), multimedia, linux kernel, powerpc, ppc64, qemu, kvm. \n \nThe goal is to continue with the stuff above, any combination. \n \nSpecialties: development, debugging, support Application development (win32, linux, c++, java), firmware development (linux-ppc64/mips/arm, atmega, h8), networks (from ethernet to http), multimedia, linux kernel, powerpc, ppc64, qemu, kvm. \n \nThe goal is to continue with the stuff above, any combination. \n \nSpecialties: development, debugging, support Application development (win32, linux, c++, java), firmware development (linux-ppc64/mips/arm, atmega, h8), networks (from ethernet to http), multimedia, linux kernel, powerpc, ppc64, qemu, kvm. \n \nThe goal is to continue with the stuff above, any combination. \n \nSpecialties: development, debugging, support Experience Linux Kernel Engineer IBM Australia August 2010  – Present (5 years 1 month) Canberra Area, Australia Linux kernel - KVM on POWER, i.e. qemu, virtio, ibmvio, pci, vfio, etc. Firmware engineer IBM February 2007  –  August 2010  (3 years 7 months) SLOF QS21/QS22 Firmware and Software Engineer IBM East Europe/Asia Ltd. February 2007  –  July 2010  (3 years 6 months) An IEEE1275 compliant host firmware for the CellBE-based BladeServers QS21/QS22 - the servers which made bigger part of the IBM RoadRunner - the first computer reached 1 Petaflop performance. Implemented a SAS disc and 10Gb Ethernet drivers to boot the server from SAS storages and 10Gb Ethernet networks in different chassis, in Forth and C languages. \n \nQS21/QS22 servers Last Level Support. Implemented set of PCI scan and diagnosis tools for the host firmware, installed and administered the local infrastructure, and made various investigations and fixed defect coming from the customer side. \n \nA zHybrid network project. Such networks are designed to use a combination of IBM zSystem reliability with IBM BladeServer unique performance. Implemented various network configuration tools for managing Junuper Ethernet and IBM BladeCenter switches, developed a network monitoring tool which detects and shows in a human-friendly form all the faults happened in the zHybrid network. The project works in Linux environment and makes use of C++, Java, perl, shell and IBM-designed COM-alike object model. Firmware Engineer IBM 2007  –  July 2010  (3 years) SLOF QS21/QS22 firmware engineer EMCraft Systems 2004  –  2007  (3 years) IPMI controllers Firmware engineer Pigeon Point Systems 2004  –  2007  (3 years) A reference board design and flexible firmware for a service processor for telecommunication blade servers designed by ATCA/mTCA standard (based on IPMI). Developed the firmware for the Atmel AtMega microcontroller and ported it to a more powerful and featured Renesas H8 microcontroller. Implemented new ATCA/mTCA protocol features, supported various hardware (I2C EEPROMs, fan control and tachometry, flash programming, power and thermal management etc). Designed Ethernet/IP/UDP stack. \nSupported clients in the firmware configuration and performed remote firmware and hardware debugging. \n \nAn ATCA/mTCA chassis management module called \"ShMM\". This module is what the blade server service processor communicates with and this module makes decisions regarding the whole chassis work and intercommunication. Fixed defects in the host firmware and the management software running on the module. Software engineer, project manager Agava 1999  –  2004  (5 years) Dolgoprudny Windows - win32 api, ole2, com, dcom, directshow, winsocket, GUI, windows shell, script, posix, ftp, http, dns and many more. Linux Kernel Engineer IBM Australia August 2010  – Present (5 years 1 month) Canberra Area, Australia Linux kernel - KVM on POWER, i.e. qemu, virtio, ibmvio, pci, vfio, etc. Linux Kernel Engineer IBM Australia August 2010  – Present (5 years 1 month) Canberra Area, Australia Linux kernel - KVM on POWER, i.e. qemu, virtio, ibmvio, pci, vfio, etc. Firmware engineer IBM February 2007  –  August 2010  (3 years 7 months) SLOF QS21/QS22 Firmware engineer IBM February 2007  –  August 2010  (3 years 7 months) SLOF QS21/QS22 Firmware and Software Engineer IBM East Europe/Asia Ltd. February 2007  –  July 2010  (3 years 6 months) An IEEE1275 compliant host firmware for the CellBE-based BladeServers QS21/QS22 - the servers which made bigger part of the IBM RoadRunner - the first computer reached 1 Petaflop performance. Implemented a SAS disc and 10Gb Ethernet drivers to boot the server from SAS storages and 10Gb Ethernet networks in different chassis, in Forth and C languages. \n \nQS21/QS22 servers Last Level Support. Implemented set of PCI scan and diagnosis tools for the host firmware, installed and administered the local infrastructure, and made various investigations and fixed defect coming from the customer side. \n \nA zHybrid network project. Such networks are designed to use a combination of IBM zSystem reliability with IBM BladeServer unique performance. Implemented various network configuration tools for managing Junuper Ethernet and IBM BladeCenter switches, developed a network monitoring tool which detects and shows in a human-friendly form all the faults happened in the zHybrid network. The project works in Linux environment and makes use of C++, Java, perl, shell and IBM-designed COM-alike object model. Firmware and Software Engineer IBM East Europe/Asia Ltd. February 2007  –  July 2010  (3 years 6 months) An IEEE1275 compliant host firmware for the CellBE-based BladeServers QS21/QS22 - the servers which made bigger part of the IBM RoadRunner - the first computer reached 1 Petaflop performance. Implemented a SAS disc and 10Gb Ethernet drivers to boot the server from SAS storages and 10Gb Ethernet networks in different chassis, in Forth and C languages. \n \nQS21/QS22 servers Last Level Support. Implemented set of PCI scan and diagnosis tools for the host firmware, installed and administered the local infrastructure, and made various investigations and fixed defect coming from the customer side. \n \nA zHybrid network project. Such networks are designed to use a combination of IBM zSystem reliability with IBM BladeServer unique performance. Implemented various network configuration tools for managing Junuper Ethernet and IBM BladeCenter switches, developed a network monitoring tool which detects and shows in a human-friendly form all the faults happened in the zHybrid network. The project works in Linux environment and makes use of C++, Java, perl, shell and IBM-designed COM-alike object model. Firmware Engineer IBM 2007  –  July 2010  (3 years) SLOF QS21/QS22 Firmware Engineer IBM 2007  –  July 2010  (3 years) SLOF QS21/QS22 firmware engineer EMCraft Systems 2004  –  2007  (3 years) IPMI controllers firmware engineer EMCraft Systems 2004  –  2007  (3 years) IPMI controllers Firmware engineer Pigeon Point Systems 2004  –  2007  (3 years) A reference board design and flexible firmware for a service processor for telecommunication blade servers designed by ATCA/mTCA standard (based on IPMI). Developed the firmware for the Atmel AtMega microcontroller and ported it to a more powerful and featured Renesas H8 microcontroller. Implemented new ATCA/mTCA protocol features, supported various hardware (I2C EEPROMs, fan control and tachometry, flash programming, power and thermal management etc). Designed Ethernet/IP/UDP stack. \nSupported clients in the firmware configuration and performed remote firmware and hardware debugging. \n \nAn ATCA/mTCA chassis management module called \"ShMM\". This module is what the blade server service processor communicates with and this module makes decisions regarding the whole chassis work and intercommunication. Fixed defects in the host firmware and the management software running on the module. Firmware engineer Pigeon Point Systems 2004  –  2007  (3 years) A reference board design and flexible firmware for a service processor for telecommunication blade servers designed by ATCA/mTCA standard (based on IPMI). Developed the firmware for the Atmel AtMega microcontroller and ported it to a more powerful and featured Renesas H8 microcontroller. Implemented new ATCA/mTCA protocol features, supported various hardware (I2C EEPROMs, fan control and tachometry, flash programming, power and thermal management etc). Designed Ethernet/IP/UDP stack. \nSupported clients in the firmware configuration and performed remote firmware and hardware debugging. \n \nAn ATCA/mTCA chassis management module called \"ShMM\". This module is what the blade server service processor communicates with and this module makes decisions regarding the whole chassis work and intercommunication. Fixed defects in the host firmware and the management software running on the module. Software engineer, project manager Agava 1999  –  2004  (5 years) Dolgoprudny Windows - win32 api, ole2, com, dcom, directshow, winsocket, GUI, windows shell, script, posix, ftp, http, dns and many more. Software engineer, project manager Agava 1999  –  2004  (5 years) Dolgoprudny Windows - win32 api, ole2, com, dcom, directshow, winsocket, GUI, windows shell, script, posix, ftp, http, dns and many more. Languages English Professional working proficiency Russian Native or bilingual proficiency English Professional working proficiency Russian Native or bilingual proficiency English Professional working proficiency Russian Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Debugging Linux Software Development Embedded Systems Win32 API Firmware Device Drivers C Linux Kernel Programming C++ Hardware Embedded Software Software Engineering Perl Unix Embedded Linux Architecture PowerPC System Architecture Software Design See 6+     See less Skills  Debugging Linux Software Development Embedded Systems Win32 API Firmware Device Drivers C Linux Kernel Programming C++ Hardware Embedded Software Software Engineering Perl Unix Embedded Linux Architecture PowerPC System Architecture Software Design See 6+     See less Debugging Linux Software Development Embedded Systems Win32 API Firmware Device Drivers C Linux Kernel Programming C++ Hardware Embedded Software Software Engineering Perl Unix Embedded Linux Architecture PowerPC System Architecture Software Design See 6+     See less Debugging Linux Software Development Embedded Systems Win32 API Firmware Device Drivers C Linux Kernel Programming C++ Hardware Embedded Software Software Engineering Perl Unix Embedded Linux Architecture PowerPC System Architecture Software Design See 6+     See less Education Moscow State University of Transport (MIIT) Master's degree,  Computer Software Engineering 1992  – 1997 Moscow State University of Transport (MIIT) Master's degree,  Computer Software Engineering 1992  – 1997 Moscow State University of Transport (MIIT) Master's degree,  Computer Software Engineering 1992  – 1997 Moscow State University of Transport (MIIT) Master's degree,  Computer Software Engineering 1992  – 1997 ", "Summary Extensive experience in firmware development for IBM System Z's I/O and Cryptographic adapter. Summary Extensive experience in firmware development for IBM System Z's I/O and Cryptographic adapter. Extensive experience in firmware development for IBM System Z's I/O and Cryptographic adapter. Extensive experience in firmware development for IBM System Z's I/O and Cryptographic adapter. Experience Advisory Software/Firmware Engineer IBM August 1999  – Present (16 years 1 month) Poughkeepsie, NY • In depth experience in POST code development for IBM System Z's I/O and Cryptographic adapter - flash based and dynamic boot loading.  \n \n• Specializing in bootstrap and diagnostic firmware for many generations of PowerPC based I/O ASIC. \n \n• Over 14 years experience in firmware design and development in C and PowerPC assembly. \n \n• Over 10 years experience developing PCI based Ethernet adapter diagnostic. \n \n• In depth experience in fault detection HW and firmware. Debugging expertise in I2C and JTAG \n \n• Granted 4 patents in I/O Emulation in mainframe environment \n \n• Over 8 years experience in developing emulation and simulation environment for PowerPC based I/O ASIC. Advisory Software/Firmware Engineer IBM August 1999  – Present (16 years 1 month) Poughkeepsie, NY • In depth experience in POST code development for IBM System Z's I/O and Cryptographic adapter - flash based and dynamic boot loading.  \n \n• Specializing in bootstrap and diagnostic firmware for many generations of PowerPC based I/O ASIC. \n \n• Over 14 years experience in firmware design and development in C and PowerPC assembly. \n \n• Over 10 years experience developing PCI based Ethernet adapter diagnostic. \n \n• In depth experience in fault detection HW and firmware. Debugging expertise in I2C and JTAG \n \n• Granted 4 patents in I/O Emulation in mainframe environment \n \n• Over 8 years experience in developing emulation and simulation environment for PowerPC based I/O ASIC. Advisory Software/Firmware Engineer IBM August 1999  – Present (16 years 1 month) Poughkeepsie, NY • In depth experience in POST code development for IBM System Z's I/O and Cryptographic adapter - flash based and dynamic boot loading.  \n \n• Specializing in bootstrap and diagnostic firmware for many generations of PowerPC based I/O ASIC. \n \n• Over 14 years experience in firmware design and development in C and PowerPC assembly. \n \n• Over 10 years experience developing PCI based Ethernet adapter diagnostic. \n \n• In depth experience in fault detection HW and firmware. Debugging expertise in I2C and JTAG \n \n• Granted 4 patents in I/O Emulation in mainframe environment \n \n• Over 8 years experience in developing emulation and simulation environment for PowerPC based I/O ASIC. Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills C Software Engineering Embedded Systems Software Development Debugging Shell Scripting Firmware Embedded Software Embedded Linux Device Drivers Skills  C Software Engineering Embedded Systems Software Development Debugging Shell Scripting Firmware Embedded Software Embedded Linux Device Drivers C Software Engineering Embedded Systems Software Development Debugging Shell Scripting Firmware Embedded Software Embedded Linux Device Drivers C Software Engineering Embedded Systems Software Development Debugging Shell Scripting Firmware Embedded Software Embedded Linux Device Drivers Education Rensselaer Polytechnic Institute Master of Science (MS),  Computer Science 2000  – 2002 Penn State University Bachelor of Science (BS),  Computer Engineering 1994  – 1999 Rensselaer Polytechnic Institute Master of Science (MS),  Computer Science 2000  – 2002 Rensselaer Polytechnic Institute Master of Science (MS),  Computer Science 2000  – 2002 Rensselaer Polytechnic Institute Master of Science (MS),  Computer Science 2000  – 2002 Penn State University Bachelor of Science (BS),  Computer Engineering 1994  – 1999 Penn State University Bachelor of Science (BS),  Computer Engineering 1994  – 1999 Penn State University Bachelor of Science (BS),  Computer Engineering 1994  – 1999 ", "Summary Firmware Engineer responsible for developing high quality firmware on Enterprise class servers where down time is not an option. I am part of a global firmware team and actively work with fellow developers on the East/West coasts, Germany and India. Development is done in multiple languages such as Java and C. Myself along with several others have worked hard to deploy a modern continuous integration environment with unit test, static code analysis and simulation to aid in the development process. Summary Firmware Engineer responsible for developing high quality firmware on Enterprise class servers where down time is not an option. I am part of a global firmware team and actively work with fellow developers on the East/West coasts, Germany and India. Development is done in multiple languages such as Java and C. Myself along with several others have worked hard to deploy a modern continuous integration environment with unit test, static code analysis and simulation to aid in the development process. Firmware Engineer responsible for developing high quality firmware on Enterprise class servers where down time is not an option. I am part of a global firmware team and actively work with fellow developers on the East/West coasts, Germany and India. Development is done in multiple languages such as Java and C. Myself along with several others have worked hard to deploy a modern continuous integration environment with unit test, static code analysis and simulation to aid in the development process. Firmware Engineer responsible for developing high quality firmware on Enterprise class servers where down time is not an option. I am part of a global firmware team and actively work with fellow developers on the East/West coasts, Germany and India. Development is done in multiple languages such as Java and C. Myself along with several others have worked hard to deploy a modern continuous integration environment with unit test, static code analysis and simulation to aid in the development process. Experience Firmware Engineer IBM June 2010  – Present (5 years 3 months) Firmware development for Fibre Channel Adapters.  \n- Primary responsibilities are to design and develop new features/functions/enhancements for the zFCP protocol (SCSI) on IBM System Z Mainframe channel adapters. \n- Design and develop enhancements for Emulex Fibre Channel HBA device driver firmware \n- Development lead responsible for redesign of firmware to support QLogic Fibre Channel HBA.  \n- Implementation of firmware changes to improve reliability and maintainability. \n \n- Responsible for development and deployment of the Continuous Integration environment which covers multiple firmware teams. Firmware Engineer IBM June 2004  –  June 2010  (6 years 1 month) Firmware development for Fibre Channel Adapters: \n- Development of FICON protocol for IBM System Z Mainframes. Responsibilities include design and implementation of new features and function.  \n- Develop and maintain device drivers for 3rd party HBA's. Intern IBM June 2003  –  August 2003  (3 months) Worked on firmware simulation of the FICON fibre channel code base. Intern IBM June 2002  –  August 2002  (3 months) - Worked on testing and bring-up of ESCON fibre channel adapter for new IBM System Z machine. Firmware Engineer IBM June 2010  – Present (5 years 3 months) Firmware development for Fibre Channel Adapters.  \n- Primary responsibilities are to design and develop new features/functions/enhancements for the zFCP protocol (SCSI) on IBM System Z Mainframe channel adapters. \n- Design and develop enhancements for Emulex Fibre Channel HBA device driver firmware \n- Development lead responsible for redesign of firmware to support QLogic Fibre Channel HBA.  \n- Implementation of firmware changes to improve reliability and maintainability. \n \n- Responsible for development and deployment of the Continuous Integration environment which covers multiple firmware teams. Firmware Engineer IBM June 2010  – Present (5 years 3 months) Firmware development for Fibre Channel Adapters.  \n- Primary responsibilities are to design and develop new features/functions/enhancements for the zFCP protocol (SCSI) on IBM System Z Mainframe channel adapters. \n- Design and develop enhancements for Emulex Fibre Channel HBA device driver firmware \n- Development lead responsible for redesign of firmware to support QLogic Fibre Channel HBA.  \n- Implementation of firmware changes to improve reliability and maintainability. \n \n- Responsible for development and deployment of the Continuous Integration environment which covers multiple firmware teams. Firmware Engineer IBM June 2004  –  June 2010  (6 years 1 month) Firmware development for Fibre Channel Adapters: \n- Development of FICON protocol for IBM System Z Mainframes. Responsibilities include design and implementation of new features and function.  \n- Develop and maintain device drivers for 3rd party HBA's. Firmware Engineer IBM June 2004  –  June 2010  (6 years 1 month) Firmware development for Fibre Channel Adapters: \n- Development of FICON protocol for IBM System Z Mainframes. Responsibilities include design and implementation of new features and function.  \n- Develop and maintain device drivers for 3rd party HBA's. Intern IBM June 2003  –  August 2003  (3 months) Worked on firmware simulation of the FICON fibre channel code base. Intern IBM June 2003  –  August 2003  (3 months) Worked on firmware simulation of the FICON fibre channel code base. Intern IBM June 2002  –  August 2002  (3 months) - Worked on testing and bring-up of ESCON fibre channel adapter for new IBM System Z machine. Intern IBM June 2002  –  August 2002  (3 months) - Worked on testing and bring-up of ESCON fibre channel adapter for new IBM System Z machine. Skills Continuous Integration C++ Java C Linux SQL Software Development Fibre Channel Jenkins Xemacs Firmware OOP Eclipse SCSI Python Shell Scripting Testing Software Engineering Object Oriented Design Perl Debugging Embedded Systems Device Drivers Unix See 9+     See less Skills  Continuous Integration C++ Java C Linux SQL Software Development Fibre Channel Jenkins Xemacs Firmware OOP Eclipse SCSI Python Shell Scripting Testing Software Engineering Object Oriented Design Perl Debugging Embedded Systems Device Drivers Unix See 9+     See less Continuous Integration C++ Java C Linux SQL Software Development Fibre Channel Jenkins Xemacs Firmware OOP Eclipse SCSI Python Shell Scripting Testing Software Engineering Object Oriented Design Perl Debugging Embedded Systems Device Drivers Unix See 9+     See less Continuous Integration C++ Java C Linux SQL Software Development Fibre Channel Jenkins Xemacs Firmware OOP Eclipse SCSI Python Shell Scripting Testing Software Engineering Object Oriented Design Perl Debugging Embedded Systems Device Drivers Unix See 9+     See less Education State University of New York at Buffalo Bachelor of Science (BS),  Computer Engineering 2000  – 2004 State University of New York at Buffalo Bachelor of Science (BS),  Computer Engineering 2000  – 2004 State University of New York at Buffalo Bachelor of Science (BS),  Computer Engineering 2000  – 2004 State University of New York at Buffalo Bachelor of Science (BS),  Computer Engineering 2000  – 2004 ", "Experience Firmware Engineer IBM May 2007  – Present (8 years 4 months) Firmware Engineer IBM May 2007  – Present (8 years 4 months) Firmware Engineer IBM May 2007  – Present (8 years 4 months) Skills Software Development Software Engineering Linux Perl C Unix C++ Debugging Shell Scripting Embedded Systems Firmware Python Bash System Simulation Eclipse Object Oriented Design Embedded Software See 2+     See less Skills  Software Development Software Engineering Linux Perl C Unix C++ Debugging Shell Scripting Embedded Systems Firmware Python Bash System Simulation Eclipse Object Oriented Design Embedded Software See 2+     See less Software Development Software Engineering Linux Perl C Unix C++ Debugging Shell Scripting Embedded Systems Firmware Python Bash System Simulation Eclipse Object Oriented Design Embedded Software See 2+     See less Software Development Software Engineering Linux Perl C Unix C++ Debugging Shell Scripting Embedded Systems Firmware Python Bash System Simulation Eclipse Object Oriented Design Embedded Software See 2+     See less Education Iowa State University Bachelor of Science,  Computer Science 2003  – 2007 Iowa State University Bachelor of Science,  Computer Science 2003  – 2007 Iowa State University Bachelor of Science,  Computer Science 2003  – 2007 Iowa State University Bachelor of Science,  Computer Science 2003  – 2007 ", "Summary I am a professional controls system engineer with over twelve years of experience on firmware development and architecture design for servers and embedded devices with focus on power and thermal subsystems. I have successfully led technical projects through the entire product cycle. I have worked with domestic and international customers to both gather technical requirements and demonstrate system firmware capabilities. My experience also includes disseminating new technologies through publications in journals and conferences as well as protecting innovative ideas through patent disclosures. \n \n► My core competencies are: \n✔ Power and Thermal Control System Design \n✔ Firmware Architecture \n✔ Test Planning and Execution \n✔ Technical Leadership \n✔ Patent Writeup \n \nTECHNICAL SKILLS \nPlatforms: \nWindows, UNIX (AIX, Solaris, Linux), ThreadX \n \nLanguages: \nJava, H8 Assembler, C, Perl, SQL \n \nOther: \nMatlab, Network Security, Agile Development, Rational Software Summary I am a professional controls system engineer with over twelve years of experience on firmware development and architecture design for servers and embedded devices with focus on power and thermal subsystems. I have successfully led technical projects through the entire product cycle. I have worked with domestic and international customers to both gather technical requirements and demonstrate system firmware capabilities. My experience also includes disseminating new technologies through publications in journals and conferences as well as protecting innovative ideas through patent disclosures. \n \n► My core competencies are: \n✔ Power and Thermal Control System Design \n✔ Firmware Architecture \n✔ Test Planning and Execution \n✔ Technical Leadership \n✔ Patent Writeup \n \nTECHNICAL SKILLS \nPlatforms: \nWindows, UNIX (AIX, Solaris, Linux), ThreadX \n \nLanguages: \nJava, H8 Assembler, C, Perl, SQL \n \nOther: \nMatlab, Network Security, Agile Development, Rational Software I am a professional controls system engineer with over twelve years of experience on firmware development and architecture design for servers and embedded devices with focus on power and thermal subsystems. I have successfully led technical projects through the entire product cycle. I have worked with domestic and international customers to both gather technical requirements and demonstrate system firmware capabilities. My experience also includes disseminating new technologies through publications in journals and conferences as well as protecting innovative ideas through patent disclosures. \n \n► My core competencies are: \n✔ Power and Thermal Control System Design \n✔ Firmware Architecture \n✔ Test Planning and Execution \n✔ Technical Leadership \n✔ Patent Writeup \n \nTECHNICAL SKILLS \nPlatforms: \nWindows, UNIX (AIX, Solaris, Linux), ThreadX \n \nLanguages: \nJava, H8 Assembler, C, Perl, SQL \n \nOther: \nMatlab, Network Security, Agile Development, Rational Software I am a professional controls system engineer with over twelve years of experience on firmware development and architecture design for servers and embedded devices with focus on power and thermal subsystems. I have successfully led technical projects through the entire product cycle. I have worked with domestic and international customers to both gather technical requirements and demonstrate system firmware capabilities. My experience also includes disseminating new technologies through publications in journals and conferences as well as protecting innovative ideas through patent disclosures. \n \n► My core competencies are: \n✔ Power and Thermal Control System Design \n✔ Firmware Architecture \n✔ Test Planning and Execution \n✔ Technical Leadership \n✔ Patent Writeup \n \nTECHNICAL SKILLS \nPlatforms: \nWindows, UNIX (AIX, Solaris, Linux), ThreadX \n \nLanguages: \nJava, H8 Assembler, C, Perl, SQL \n \nOther: \nMatlab, Network Security, Agile Development, Rational Software Experience Power and Thermal Firmware Engineer IBM November 2006  – Present (8 years 10 months) Design and implement system firmware architecture for EnergyScale Technology. \nResearch and develop thermal and power control systems for POWER servers. \nReceived two Outstanding Technical Achievement Awards (OTAA) as a result of contributions to the development of EnergyScale Technology. \nWorked as a Technical Concierge for Interbank and Specialist Distribution Group through the Technical Advocate Program. \nWorked as a liaison between the Firmware Development Group and the IBM Austin Research Lab to materialize prototypes into full-fledged products. Bringup Technical Lead IBM February 2003  –  October 2006  (3 years 9 months) Low-level Firmware Engineer IBM February 2001  –  February 2003  (2 years 1 month) Power and Thermal Firmware Engineer IBM November 2006  – Present (8 years 10 months) Design and implement system firmware architecture for EnergyScale Technology. \nResearch and develop thermal and power control systems for POWER servers. \nReceived two Outstanding Technical Achievement Awards (OTAA) as a result of contributions to the development of EnergyScale Technology. \nWorked as a Technical Concierge for Interbank and Specialist Distribution Group through the Technical Advocate Program. \nWorked as a liaison between the Firmware Development Group and the IBM Austin Research Lab to materialize prototypes into full-fledged products. Power and Thermal Firmware Engineer IBM November 2006  – Present (8 years 10 months) Design and implement system firmware architecture for EnergyScale Technology. \nResearch and develop thermal and power control systems for POWER servers. \nReceived two Outstanding Technical Achievement Awards (OTAA) as a result of contributions to the development of EnergyScale Technology. \nWorked as a Technical Concierge for Interbank and Specialist Distribution Group through the Technical Advocate Program. \nWorked as a liaison between the Firmware Development Group and the IBM Austin Research Lab to materialize prototypes into full-fledged products. Bringup Technical Lead IBM February 2003  –  October 2006  (3 years 9 months) Bringup Technical Lead IBM February 2003  –  October 2006  (3 years 9 months) Low-level Firmware Engineer IBM February 2001  –  February 2003  (2 years 1 month) Low-level Firmware Engineer IBM February 2001  –  February 2003  (2 years 1 month) Languages   Skills Linux Software Development C Unix Java C++ Software Engineering Perl Embedded Systems Storage Agile Methodologies Shell Scripting Eclipse Testing XML Debugging Embedded Software Software Design System Architecture Device Drivers ClearCase Object Oriented Design TCP/IP See 8+     See less Skills  Linux Software Development C Unix Java C++ Software Engineering Perl Embedded Systems Storage Agile Methodologies Shell Scripting Eclipse Testing XML Debugging Embedded Software Software Design System Architecture Device Drivers ClearCase Object Oriented Design TCP/IP See 8+     See less Linux Software Development C Unix Java C++ Software Engineering Perl Embedded Systems Storage Agile Methodologies Shell Scripting Eclipse Testing XML Debugging Embedded Software Software Design System Architecture Device Drivers ClearCase Object Oriented Design TCP/IP See 8+     See less Linux Software Development C Unix Java C++ Software Engineering Perl Embedded Systems Storage Agile Methodologies Shell Scripting Eclipse Testing XML Debugging Embedded Software Software Design System Architecture Device Drivers ClearCase Object Oriented Design TCP/IP See 8+     See less Education Texas A&M University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering 1996  – 2000 Pontificia Universidad Católica del Perú Bachelor of Science (B.S.),  Electrical and Electronics Engineering 1990  – 1995 Texas A&M University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering 1996  – 2000 Texas A&M University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering 1996  – 2000 Texas A&M University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering 1996  – 2000 Pontificia Universidad Católica del Perú Bachelor of Science (B.S.),  Electrical and Electronics Engineering 1990  – 1995 Pontificia Universidad Católica del Perú Bachelor of Science (B.S.),  Electrical and Electronics Engineering 1990  – 1995 Pontificia Universidad Católica del Perú Bachelor of Science (B.S.),  Electrical and Electronics Engineering 1990  – 1995 Honors & Awards ", "Experience Software Architect IBM Hursley Laboratories 2003  – Present (12 years) Firmware Engineer Hitachi GST January 2003  –  July 2003  (7 months) San Jose, California Firmware Engineer IBM January 1999  –  December 2002  (4 years) San Jose, California Firmware Engineer IBM Hursley Laboratories August 1981  –  December 1999  (18 years 5 months) Software Architect IBM Hursley Laboratories 2003  – Present (12 years) Software Architect IBM Hursley Laboratories 2003  – Present (12 years) Firmware Engineer Hitachi GST January 2003  –  July 2003  (7 months) San Jose, California Firmware Engineer Hitachi GST January 2003  –  July 2003  (7 months) San Jose, California Firmware Engineer IBM January 1999  –  December 2002  (4 years) San Jose, California Firmware Engineer IBM January 1999  –  December 2002  (4 years) San Jose, California Firmware Engineer IBM Hursley Laboratories August 1981  –  December 1999  (18 years 5 months) Firmware Engineer IBM Hursley Laboratories August 1981  –  December 1999  (18 years 5 months) Skills Software Development C Software Engineering Agile Methodologies Embedded Systems XML Linux Eclipse Perl Skills  Software Development C Software Engineering Agile Methodologies Embedded Systems XML Linux Eclipse Perl Software Development C Software Engineering Agile Methodologies Embedded Systems XML Linux Eclipse Perl Software Development C Software Engineering Agile Methodologies Embedded Systems XML Linux Eclipse Perl Education Imperial College London BSc (Eng),  Computer Science 1978  – 1981 Imperial College London BSc (Eng),  Computer Science 1978  – 1981 Imperial College London BSc (Eng),  Computer Science 1978  – 1981 Imperial College London BSc (Eng),  Computer Science 1978  – 1981 ", "Summary Specialties:Fibre Channel protocol (FC), SCSI, FIPS 140, encryption, C++, SQL Summary Specialties:Fibre Channel protocol (FC), SCSI, FIPS 140, encryption, C++, SQL Specialties:Fibre Channel protocol (FC), SCSI, FIPS 140, encryption, C++, SQL Specialties:Fibre Channel protocol (FC), SCSI, FIPS 140, encryption, C++, SQL Experience Firmware Engineer IBM August 2005  – Present (10 years 1 month) Develop firmware for storage devices, including encryption and fibre channel (FC). Analyze and debug customer problems. Coordinate FIPS certification for encryption solutions. Test Engineer IBM September 2000  –  August 2005  (5 years) Tested storage devices using statistical models. Main focus of testing was SCSI SSC command set and fibre channel (FC) protocol. Coordinated testing with other test groups and development. Firmware Engineer IBM August 2005  – Present (10 years 1 month) Develop firmware for storage devices, including encryption and fibre channel (FC). Analyze and debug customer problems. Coordinate FIPS certification for encryption solutions. Firmware Engineer IBM August 2005  – Present (10 years 1 month) Develop firmware for storage devices, including encryption and fibre channel (FC). Analyze and debug customer problems. Coordinate FIPS certification for encryption solutions. Test Engineer IBM September 2000  –  August 2005  (5 years) Tested storage devices using statistical models. Main focus of testing was SCSI SSC command set and fibre channel (FC) protocol. Coordinated testing with other test groups and development. Test Engineer IBM September 2000  –  August 2005  (5 years) Tested storage devices using statistical models. Main focus of testing was SCSI SSC command set and fibre channel (FC) protocol. Coordinated testing with other test groups and development. Languages English English English Skills SCSI C++ Encryption Fibre Channel Firmware C Assembly Processors SQL Testing Shell Scripting Storage Hardware Unix TCP/IP Manufacturing Cloud Computing Debugging See 3+     See less Skills  SCSI C++ Encryption Fibre Channel Firmware C Assembly Processors SQL Testing Shell Scripting Storage Hardware Unix TCP/IP Manufacturing Cloud Computing Debugging See 3+     See less SCSI C++ Encryption Fibre Channel Firmware C Assembly Processors SQL Testing Shell Scripting Storage Hardware Unix TCP/IP Manufacturing Cloud Computing Debugging See 3+     See less SCSI C++ Encryption Fibre Channel Firmware C Assembly Processors SQL Testing Shell Scripting Storage Hardware Unix TCP/IP Manufacturing Cloud Computing Debugging See 3+     See less Education Virginia Polytechnic Institute and State University Bachelor of Science (BS),  Computer Engineering Virginia Polytechnic Institute and State University Bachelor of Science (BS),  Computer Engineering Virginia Polytechnic Institute and State University Bachelor of Science (BS),  Computer Engineering Virginia Polytechnic Institute and State University Bachelor of Science (BS),  Computer Engineering ", "Experience Software/Firmware Engineer IBM June 2006  – Present (9 years 3 months) Software/Firmware Engineer IBM June 2006  – Present (9 years 3 months) Software/Firmware Engineer IBM June 2006  – Present (9 years 3 months) Skills Firmware C++ Debugging X86 Device Drivers Processors Skills  Firmware C++ Debugging X86 Device Drivers Processors Firmware C++ Debugging X86 Device Drivers Processors Firmware C++ Debugging X86 Device Drivers Processors ", "Experience M. Sc., Firmware engineer IBM Deutschland Entwicklung GmbH July 2001  – Present (14 years 2 months) systems engineer Moog Components Group November 1998  –  July 2001  (2 years 9 months) M. Sc., Firmware engineer IBM Deutschland Entwicklung GmbH July 2001  – Present (14 years 2 months) M. Sc., Firmware engineer IBM Deutschland Entwicklung GmbH July 2001  – Present (14 years 2 months) systems engineer Moog Components Group November 1998  –  July 2001  (2 years 9 months) systems engineer Moog Components Group November 1998  –  July 2001  (2 years 9 months) Languages English Professional working proficiency Swedish Native or bilingual proficiency German Native or bilingual proficiency French Elementary proficiency English Professional working proficiency Swedish Native or bilingual proficiency German Native or bilingual proficiency French Elementary proficiency English Professional working proficiency Swedish Native or bilingual proficiency German Native or bilingual proficiency French Elementary proficiency Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills C++ OO Software Development Clean Code Development Python Linux Shell Scripting YAML Bash Unix Perl XML Requirements Analysis Operating Systems Software Development Skills  C++ OO Software Development Clean Code Development Python Linux Shell Scripting YAML Bash Unix Perl XML Requirements Analysis Operating Systems Software Development C++ OO Software Development Clean Code Development Python Linux Shell Scripting YAML Bash Unix Perl XML Requirements Analysis Operating Systems Software Development C++ OO Software Development Clean Code Development Python Linux Shell Scripting YAML Bash Unix Perl XML Requirements Analysis Operating Systems Software Development Education Uppsala University Master's Degree,  Master of Science in Engineering Physics (M.Sc.ENG.) 1991  – 1998 Engineering Physics, Teknisk Fysik, Beräkningsgrenen, Inriktning Reglerteknik \nIdé- och lärdomshistoria 20 poäng (Sept 1993 - March 1994) Activities and Societies:  Östgöta Nation i Uppsala:\n- Klubbverk ,  Sept 1993 - Jan 1994\n- Ljustekniker ,  1994\nÖvrigt i Uppsala:\n- Glansbandet\n- Amnesti\n- Feuerbachs fotnötter (Volleyboll) Rudbecksskolan, Örebro high school graduation 1988  – 1991 Uppsala University Master's Degree,  Master of Science in Engineering Physics (M.Sc.ENG.) 1991  – 1998 Engineering Physics, Teknisk Fysik, Beräkningsgrenen, Inriktning Reglerteknik \nIdé- och lärdomshistoria 20 poäng (Sept 1993 - March 1994) Activities and Societies:  Östgöta Nation i Uppsala:\n- Klubbverk ,  Sept 1993 - Jan 1994\n- Ljustekniker ,  1994\nÖvrigt i Uppsala:\n- Glansbandet\n- Amnesti\n- Feuerbachs fotnötter (Volleyboll) Uppsala University Master's Degree,  Master of Science in Engineering Physics (M.Sc.ENG.) 1991  – 1998 Engineering Physics, Teknisk Fysik, Beräkningsgrenen, Inriktning Reglerteknik \nIdé- och lärdomshistoria 20 poäng (Sept 1993 - March 1994) Activities and Societies:  Östgöta Nation i Uppsala:\n- Klubbverk ,  Sept 1993 - Jan 1994\n- Ljustekniker ,  1994\nÖvrigt i Uppsala:\n- Glansbandet\n- Amnesti\n- Feuerbachs fotnötter (Volleyboll) Uppsala University Master's Degree,  Master of Science in Engineering Physics (M.Sc.ENG.) 1991  – 1998 Engineering Physics, Teknisk Fysik, Beräkningsgrenen, Inriktning Reglerteknik \nIdé- och lärdomshistoria 20 poäng (Sept 1993 - March 1994) Activities and Societies:  Östgöta Nation i Uppsala:\n- Klubbverk ,  Sept 1993 - Jan 1994\n- Ljustekniker ,  1994\nÖvrigt i Uppsala:\n- Glansbandet\n- Amnesti\n- Feuerbachs fotnötter (Volleyboll) Rudbecksskolan, Örebro high school graduation 1988  – 1991 Rudbecksskolan, Örebro high school graduation 1988  – 1991 Rudbecksskolan, Örebro high school graduation 1988  – 1991 ", "Experience Embedded Firmware Engineer IBM Embedded Firmware Engineer IBM Embedded Firmware Engineer IBM Skills Linux Shell Scripting Software Engineering Embedded Systems Cloud Computing Integration Software Development Debugging C Firmware Agile Methodologies Device Drivers System Architecture Software Design C++ Embedded Linux Testing Software Project... Object Oriented Design Hardware Subversion Java Perl Unix Operating Systems TCP/IP Embedded Software Storage Programming Python See 15+     See less Skills  Linux Shell Scripting Software Engineering Embedded Systems Cloud Computing Integration Software Development Debugging C Firmware Agile Methodologies Device Drivers System Architecture Software Design C++ Embedded Linux Testing Software Project... Object Oriented Design Hardware Subversion Java Perl Unix Operating Systems TCP/IP Embedded Software Storage Programming Python See 15+     See less Linux Shell Scripting Software Engineering Embedded Systems Cloud Computing Integration Software Development Debugging C Firmware Agile Methodologies Device Drivers System Architecture Software Design C++ Embedded Linux Testing Software Project... Object Oriented Design Hardware Subversion Java Perl Unix Operating Systems TCP/IP Embedded Software Storage Programming Python See 15+     See less Linux Shell Scripting Software Engineering Embedded Systems Cloud Computing Integration Software Development Debugging C Firmware Agile Methodologies Device Drivers System Architecture Software Design C++ Embedded Linux Testing Software Project... Object Oriented Design Hardware Subversion Java Perl Unix Operating Systems TCP/IP Embedded Software Storage Programming Python See 15+     See less Education North Carolina State University 1985  – 1992 North Carolina State University 1985  – 1992 North Carolina State University 1985  – 1992 North Carolina State University 1985  – 1992 ", "Experience Firmware Engineer IBM Corporation 2006  – Present (9 years) Software/Firmware Engineer DataLogic, Inc. 2003  –  2006  (3 years) Software/Firmware Engineer Celox Networks, Inc. 2000  –  2002  (2 years) Software/Firmware Engineer Nortel Networks, Inc. 1999  –  2000  (1 year) Software Engineer GTE Laboratories, Inc. 1997  –  1999  (2 years) Software/Firmware Engineer Summa Four, Inc. 1996  –  1997  (1 year) Software/Firmware Engineer Cabletron Systems, Inc. 1993  –  1996  (3 years) Firmware Engineer IBM Corporation 2006  – Present (9 years) Firmware Engineer IBM Corporation 2006  – Present (9 years) Software/Firmware Engineer DataLogic, Inc. 2003  –  2006  (3 years) Software/Firmware Engineer DataLogic, Inc. 2003  –  2006  (3 years) Software/Firmware Engineer Celox Networks, Inc. 2000  –  2002  (2 years) Software/Firmware Engineer Celox Networks, Inc. 2000  –  2002  (2 years) Software/Firmware Engineer Nortel Networks, Inc. 1999  –  2000  (1 year) Software/Firmware Engineer Nortel Networks, Inc. 1999  –  2000  (1 year) Software Engineer GTE Laboratories, Inc. 1997  –  1999  (2 years) Software Engineer GTE Laboratories, Inc. 1997  –  1999  (2 years) Software/Firmware Engineer Summa Four, Inc. 1996  –  1997  (1 year) Software/Firmware Engineer Summa Four, Inc. 1996  –  1997  (1 year) Software/Firmware Engineer Cabletron Systems, Inc. 1993  –  1996  (3 years) Software/Firmware Engineer Cabletron Systems, Inc. 1993  –  1996  (3 years) Education City University of New York City College 1900  – 1900 City University of New York City College 1900  – 1900 City University of New York City College 1900  – 1900 City University of New York City College 1900  – 1900 ", "Experience Firmware Engineer IBM September 2005  –  February 2013  (7 years 6 months) Disk Adapter Boot code: Updated embedded code that tested and initialized hardware subsystems and loaded the kernel code into memory on various IBM designed RAID adapters that were repurchased from Adaptec. Worked on a joint development to port IBM code to a non-IBM hardware for potential use in xSeries servers. Modified a limited host driver to do the initial code load into flash and test cards as part of the manufacturing process. Redesigned the code to handle switching from a internally produced kernel to the vxWorks kernel while maintaining some specialized requirements of the hardware. Firmware Engineer Adaptec July 2004  –  September 2005  (1 year 3 months) Firmware Engineer IBM August 1988  –  July 2004  (16 years) Firmware Engineer IBM September 2005  –  February 2013  (7 years 6 months) Disk Adapter Boot code: Updated embedded code that tested and initialized hardware subsystems and loaded the kernel code into memory on various IBM designed RAID adapters that were repurchased from Adaptec. Worked on a joint development to port IBM code to a non-IBM hardware for potential use in xSeries servers. Modified a limited host driver to do the initial code load into flash and test cards as part of the manufacturing process. Redesigned the code to handle switching from a internally produced kernel to the vxWorks kernel while maintaining some specialized requirements of the hardware. Firmware Engineer IBM September 2005  –  February 2013  (7 years 6 months) Disk Adapter Boot code: Updated embedded code that tested and initialized hardware subsystems and loaded the kernel code into memory on various IBM designed RAID adapters that were repurchased from Adaptec. Worked on a joint development to port IBM code to a non-IBM hardware for potential use in xSeries servers. Modified a limited host driver to do the initial code load into flash and test cards as part of the manufacturing process. Redesigned the code to handle switching from a internally produced kernel to the vxWorks kernel while maintaining some specialized requirements of the hardware. Firmware Engineer Adaptec July 2004  –  September 2005  (1 year 3 months) Firmware Engineer Adaptec July 2004  –  September 2005  (1 year 3 months) Firmware Engineer IBM August 1988  –  July 2004  (16 years) Firmware Engineer IBM August 1988  –  July 2004  (16 years) Skills C Software Engineering Firmware Embedded Systems C++ Software Development Debugging RTOS Device Drivers Embedded Software System Architecture Kernel Testing Hardware VxWorks Skills  C Software Engineering Firmware Embedded Systems C++ Software Development Debugging RTOS Device Drivers Embedded Software System Architecture Kernel Testing Hardware VxWorks C Software Engineering Firmware Embedded Systems C++ Software Development Debugging RTOS Device Drivers Embedded Software System Architecture Kernel Testing Hardware VxWorks C Software Engineering Firmware Embedded Systems C++ Software Development Debugging RTOS Device Drivers Embedded Software System Architecture Kernel Testing Hardware VxWorks Education University of Michigan Bachelor of Engineering (BEng),  Electrical and Electronics Engineering 1984  – 1988 University of Michigan Bachelor of Engineering (BEng),  Electrical and Electronics Engineering 1984  – 1988 University of Michigan Bachelor of Engineering (BEng),  Electrical and Electronics Engineering 1984  – 1988 University of Michigan Bachelor of Engineering (BEng),  Electrical and Electronics Engineering 1984  – 1988 ", "Summary Innovative Firmware Engineer with extensive experience in the design, coding, testing and debugging of embedded code or firmware that controls I/O subsystems within IBM mainframes. Diversified experience includes IBM z/OS and NetWare device driver development. Proven success enhancing existing systems with new innovative features and performance improvements. Have solid C programming background as well and currently working on firmware written in C++. Eager to expand my skills by learning other software technologies. Summary Innovative Firmware Engineer with extensive experience in the design, coding, testing and debugging of embedded code or firmware that controls I/O subsystems within IBM mainframes. Diversified experience includes IBM z/OS and NetWare device driver development. Proven success enhancing existing systems with new innovative features and performance improvements. Have solid C programming background as well and currently working on firmware written in C++. Eager to expand my skills by learning other software technologies. Innovative Firmware Engineer with extensive experience in the design, coding, testing and debugging of embedded code or firmware that controls I/O subsystems within IBM mainframes. Diversified experience includes IBM z/OS and NetWare device driver development. Proven success enhancing existing systems with new innovative features and performance improvements. Have solid C programming background as well and currently working on firmware written in C++. Eager to expand my skills by learning other software technologies. Innovative Firmware Engineer with extensive experience in the design, coding, testing and debugging of embedded code or firmware that controls I/O subsystems within IBM mainframes. Diversified experience includes IBM z/OS and NetWare device driver development. Proven success enhancing existing systems with new innovative features and performance improvements. Have solid C programming background as well and currently working on firmware written in C++. Eager to expand my skills by learning other software technologies. Languages   Skills Skills     Honors & Awards "]}