{"position": "Graduate Teaching Assistant", "company": "Stanford University", "profiles": ["Experience Graduate Teaching Assistant Stanford University March 2015  – Present (6 months) Teaching assistant in Computer Organizations and Systems (CS107). Hold office hours to give students guidance on course material, grade exams, create problem sets, teach lab section every week. Venture and Growth Fund Accel Partners October 2014  – Present (11 months) Palo Alto Business Development Associate Flextronics June 2014  – Present (1 year 3 months) -Conducted market analysis for multiple disruptive technologies. Selected suppliers and engaged with them to bring them on board the Flextronic’s Open Innovation Program; struck partnerships with four electronics manufacturers  \n-Created an internal web tool to improve tracking of manufacturing revenue coming from design made by in-house design centers \n-Organized and lead meetings within the CTO office with current Flex partners and members of C-level staff to align incentives  \n Director, Engineer, US Operations Technology Consultant Italia Innovation Program June 2014  –  July 2014  (2 months) Treviso Area, Italy -building program within Stanford Engineering department to give students opportunity to work abroad \n-involved in recruiting undergrad, engineering master's, and business school students worldwide \n-recruited Stanford Professors in D-school/School of Engineering to work alongside students abroad in various projects for Italian companies \n-Gained C-level access and consultation from top firms in the Northeast Italy wine, fashion and manufacturing sectors. \n-Staffed full-time on a project at Moncler and played both an engineering and business strategy role along with business and law students, with the mentorship of international experienced professors and practitioners. Charles Blyth Fund Blyth Fund April 2013  –  May 2014  (1 year 2 months) Stanford The group manages a real money six-figure portfolio of domestic and international equities. We conduct research, make pitches, and invest. Intern Merrill Lynch July 2012  –  September 2012  (3 months) Superstition Springs I worked for Assistant VP Larry Lytle in various projects including building proposals for potential clients, evaluating existing equity and MF holdings, conducting market research and then using market research to make investment recommendations, building databases using Access, track my boss's investments and make recommended changes, and putting together key marketing pieces. Recommendation from Larry Lytle is readily available. Intern/ Research Assistant Stanford University Medical Center January 2012  –  June 2012  (6 months) Stanford, CA I served as research assistant to Dr. Ramasamy Paulmurugan in the Radiology Department. My work included cell cultures, transfection, transformations, alterations on DNA plasmids and ER-beta cells. I was also involved in conducting individual research projects regarding gene therapy Intern/ Research Assistant Banner Health June 2010  –  July 2010  (2 months) Sun City, AZ As part of Dr. Thomas Beach’s neuropathology lab, conducted research on Alzheimer’s and Parkinson’s; Performed multiple experiments that explored correlations between the deteriorating state of mind and the presence of neurological plaques and tangles. Analyzed brain tissue and examined the effect of Lewis bodies on the mind. Assisted head doctors in conducting an experiment on a group of patients with dementia. Attended and helped out in a full-body autopsy. Presented own research at a symposium carried out by Banner in front of the institute’s doctors and researchers. Graduate Teaching Assistant Stanford University March 2015  – Present (6 months) Teaching assistant in Computer Organizations and Systems (CS107). Hold office hours to give students guidance on course material, grade exams, create problem sets, teach lab section every week. Graduate Teaching Assistant Stanford University March 2015  – Present (6 months) Teaching assistant in Computer Organizations and Systems (CS107). Hold office hours to give students guidance on course material, grade exams, create problem sets, teach lab section every week. Venture and Growth Fund Accel Partners October 2014  – Present (11 months) Palo Alto Venture and Growth Fund Accel Partners October 2014  – Present (11 months) Palo Alto Business Development Associate Flextronics June 2014  – Present (1 year 3 months) -Conducted market analysis for multiple disruptive technologies. Selected suppliers and engaged with them to bring them on board the Flextronic’s Open Innovation Program; struck partnerships with four electronics manufacturers  \n-Created an internal web tool to improve tracking of manufacturing revenue coming from design made by in-house design centers \n-Organized and lead meetings within the CTO office with current Flex partners and members of C-level staff to align incentives  \n Business Development Associate Flextronics June 2014  – Present (1 year 3 months) -Conducted market analysis for multiple disruptive technologies. Selected suppliers and engaged with them to bring them on board the Flextronic’s Open Innovation Program; struck partnerships with four electronics manufacturers  \n-Created an internal web tool to improve tracking of manufacturing revenue coming from design made by in-house design centers \n-Organized and lead meetings within the CTO office with current Flex partners and members of C-level staff to align incentives  \n Director, Engineer, US Operations Technology Consultant Italia Innovation Program June 2014  –  July 2014  (2 months) Treviso Area, Italy -building program within Stanford Engineering department to give students opportunity to work abroad \n-involved in recruiting undergrad, engineering master's, and business school students worldwide \n-recruited Stanford Professors in D-school/School of Engineering to work alongside students abroad in various projects for Italian companies \n-Gained C-level access and consultation from top firms in the Northeast Italy wine, fashion and manufacturing sectors. \n-Staffed full-time on a project at Moncler and played both an engineering and business strategy role along with business and law students, with the mentorship of international experienced professors and practitioners. Director, Engineer, US Operations Technology Consultant Italia Innovation Program June 2014  –  July 2014  (2 months) Treviso Area, Italy -building program within Stanford Engineering department to give students opportunity to work abroad \n-involved in recruiting undergrad, engineering master's, and business school students worldwide \n-recruited Stanford Professors in D-school/School of Engineering to work alongside students abroad in various projects for Italian companies \n-Gained C-level access and consultation from top firms in the Northeast Italy wine, fashion and manufacturing sectors. \n-Staffed full-time on a project at Moncler and played both an engineering and business strategy role along with business and law students, with the mentorship of international experienced professors and practitioners. Charles Blyth Fund Blyth Fund April 2013  –  May 2014  (1 year 2 months) Stanford The group manages a real money six-figure portfolio of domestic and international equities. We conduct research, make pitches, and invest. Charles Blyth Fund Blyth Fund April 2013  –  May 2014  (1 year 2 months) Stanford The group manages a real money six-figure portfolio of domestic and international equities. We conduct research, make pitches, and invest. Intern Merrill Lynch July 2012  –  September 2012  (3 months) Superstition Springs I worked for Assistant VP Larry Lytle in various projects including building proposals for potential clients, evaluating existing equity and MF holdings, conducting market research and then using market research to make investment recommendations, building databases using Access, track my boss's investments and make recommended changes, and putting together key marketing pieces. Recommendation from Larry Lytle is readily available. Intern Merrill Lynch July 2012  –  September 2012  (3 months) Superstition Springs I worked for Assistant VP Larry Lytle in various projects including building proposals for potential clients, evaluating existing equity and MF holdings, conducting market research and then using market research to make investment recommendations, building databases using Access, track my boss's investments and make recommended changes, and putting together key marketing pieces. Recommendation from Larry Lytle is readily available. Intern/ Research Assistant Stanford University Medical Center January 2012  –  June 2012  (6 months) Stanford, CA I served as research assistant to Dr. Ramasamy Paulmurugan in the Radiology Department. My work included cell cultures, transfection, transformations, alterations on DNA plasmids and ER-beta cells. I was also involved in conducting individual research projects regarding gene therapy Intern/ Research Assistant Stanford University Medical Center January 2012  –  June 2012  (6 months) Stanford, CA I served as research assistant to Dr. Ramasamy Paulmurugan in the Radiology Department. My work included cell cultures, transfection, transformations, alterations on DNA plasmids and ER-beta cells. I was also involved in conducting individual research projects regarding gene therapy Intern/ Research Assistant Banner Health June 2010  –  July 2010  (2 months) Sun City, AZ As part of Dr. Thomas Beach’s neuropathology lab, conducted research on Alzheimer’s and Parkinson’s; Performed multiple experiments that explored correlations between the deteriorating state of mind and the presence of neurological plaques and tangles. Analyzed brain tissue and examined the effect of Lewis bodies on the mind. Assisted head doctors in conducting an experiment on a group of patients with dementia. Attended and helped out in a full-body autopsy. Presented own research at a symposium carried out by Banner in front of the institute’s doctors and researchers. Intern/ Research Assistant Banner Health June 2010  –  July 2010  (2 months) Sun City, AZ As part of Dr. Thomas Beach’s neuropathology lab, conducted research on Alzheimer’s and Parkinson’s; Performed multiple experiments that explored correlations between the deteriorating state of mind and the presence of neurological plaques and tangles. Analyzed brain tissue and examined the effect of Lewis bodies on the mind. Assisted head doctors in conducting an experiment on a group of patients with dementia. Attended and helped out in a full-body autopsy. Presented own research at a symposium carried out by Banner in front of the institute’s doctors and researchers. Languages English Native or bilingual proficiency French Professional working proficiency Bulgarian Native or bilingual proficiency English Native or bilingual proficiency French Professional working proficiency Bulgarian Native or bilingual proficiency English Native or bilingual proficiency French Professional working proficiency Bulgarian Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Market Research Data Analysis Public Speaking Access Research Microsoft Office Wine Tasting Fashion Wine Viticulture Microsoft Excel PowerPoint Microsoft Word Financial Analysis Matlab Teamwork Java C++ HTML Business Development Sales Financial Modeling Optimization JavaScript Portfolio Optimization Portfolio Management NFC Machine Learning Entrepreneurship... Natural Language... Artificial Neural... See 16+     See less Skills  Market Research Data Analysis Public Speaking Access Research Microsoft Office Wine Tasting Fashion Wine Viticulture Microsoft Excel PowerPoint Microsoft Word Financial Analysis Matlab Teamwork Java C++ HTML Business Development Sales Financial Modeling Optimization JavaScript Portfolio Optimization Portfolio Management NFC Machine Learning Entrepreneurship... Natural Language... Artificial Neural... See 16+     See less Market Research Data Analysis Public Speaking Access Research Microsoft Office Wine Tasting Fashion Wine Viticulture Microsoft Excel PowerPoint Microsoft Word Financial Analysis Matlab Teamwork Java C++ HTML Business Development Sales Financial Modeling Optimization JavaScript Portfolio Optimization Portfolio Management NFC Machine Learning Entrepreneurship... Natural Language... Artificial Neural... See 16+     See less Market Research Data Analysis Public Speaking Access Research Microsoft Office Wine Tasting Fashion Wine Viticulture Microsoft Excel PowerPoint Microsoft Word Financial Analysis Matlab Teamwork Java C++ HTML Business Development Sales Financial Modeling Optimization JavaScript Portfolio Optimization Portfolio Management NFC Machine Learning Entrepreneurship... Natural Language... Artificial Neural... See 16+     See less Education Stanford University Master of Science (M.S.) in Computer Science 2015  – 2016 Stanford University Bachelor's degree,  Management Science and Engineering 2011  – 2015 Activities and Societies:  Stanford Lacrosse Stanford University Master of Science (M.S.) in Computer Science 2015  – 2016 Stanford University Master of Science (M.S.) in Computer Science 2015  – 2016 Stanford University Master of Science (M.S.) in Computer Science 2015  – 2016 Stanford University Bachelor's degree,  Management Science and Engineering 2011  – 2015 Activities and Societies:  Stanford Lacrosse Stanford University Bachelor's degree,  Management Science and Engineering 2011  – 2015 Activities and Societies:  Stanford Lacrosse Stanford University Bachelor's degree,  Management Science and Engineering 2011  – 2015 Activities and Societies:  Stanford Lacrosse ", "Experience PhD Candidate Stanford University September 2010  – Present (5 years) Swartz Laboratory, Dept. Chem Eng.; Advisor: Prof. James Swartz \nDeveloping a fully defined in vitro activation for the assembly and maturation of [Fe-Fe] hydrogenases to enable commercialization of sustainable hydrogen production from sunlight and electricity; Apply methods for protein engineering of hydrogenases for development of solar and glucose based H2-production, enable high throughput hydrogenase library screening, and improved in vivo and cell free hydrogenase expression and activation. Graduate Teaching Assistant Stanford University March 2013  –  June 2013  (4 months) Chemical Engineering 355: Advanced Biochemical Engineering,  \nServed as teaching assistant for a 35 student graduate level advanced biochemical engineering course, covering recombinant DNA technology and synthetic biology (metabolic engineering), production of protein pharmaceuticals, fermentation technology and process development within the framework of current business and regulatory requirement; prepared and led a weekly discussion review section, held office hours twice a week, put together and graded homework assignments and exams. Graduate Teaching Assistant Stanford University March 2012  –  June 2012  (4 months) Chemical Engineering 25B: Biotechnology \nTeaching assistant for a 110 student undergraduate survey course in biotechnology covering genetic engineering, cell culture, protein production, pharmaceutics, genomics, viruses, gene therapy, immunology, antibodies, cloning, stem cells, transgenic animals, intellectual property, government regulation, and ethics; Held office hours weekly and prepared and led a discussion review session for students. Graduate Student Researcher Stanford University September 2011  –  March 2012  (7 months) Spormann Laboratory, Chemical Engineering; Investigated biogas production from waste water in microbial electrochemical cells; Created mutants to test electron transfer of E. coli for electro synthesis. Private Tutor, Athletic Academic Resource Center Stanford University September 2011  –  December 2011  (4 months) Engineering 30: Engineering Thermodynamics \nWorked with nine student athletes weekly to cover course content, including how energy and entropy principles are applied in thermodynamic analyses directed towards understanding the performances of engineering systems. Prepared extra practice problem sets, where methods and problems covered socially responsible economic generation and utilization of energy in central power generation plants, solar systems, refrigeration devices, and automobile, jet and gas-turbine engines. Undergraduate Researcher UCSF May 2009  –  September 2009  (5 months) McKnight Lab, Dept. of Radiology and Biomedical Imaging; Research Adviser: Prof. Tracy McKnight \nCreated quantitative maps from magnetic resonance (MR) images of diffusion and T2 relaxation times in mouse models of the human U87 malignant glioma by writing MATLAB programs for analysis; measured physiological changes in tissue assessed for pre-clinical studies, including metabolite concentrations through magnetic resonance spectroscopy. Undergraduate Researcher UC Berkeley May 2008  –  December 2008  (8 months) Laboratory for the Science and Application of Catalysis, Dept. Chem. Eng.; Research Adviser: Prof. Enrique Iglesia; Investigated the catalytic conversion of glycerol, a major byproduct of biodiesel formation, to maximize chemical utility and reusability through zeolites and polyoxometalate catalysts; presented work at various conferences. PhD Candidate Stanford University September 2010  – Present (5 years) Swartz Laboratory, Dept. Chem Eng.; Advisor: Prof. James Swartz \nDeveloping a fully defined in vitro activation for the assembly and maturation of [Fe-Fe] hydrogenases to enable commercialization of sustainable hydrogen production from sunlight and electricity; Apply methods for protein engineering of hydrogenases for development of solar and glucose based H2-production, enable high throughput hydrogenase library screening, and improved in vivo and cell free hydrogenase expression and activation. PhD Candidate Stanford University September 2010  – Present (5 years) Swartz Laboratory, Dept. Chem Eng.; Advisor: Prof. James Swartz \nDeveloping a fully defined in vitro activation for the assembly and maturation of [Fe-Fe] hydrogenases to enable commercialization of sustainable hydrogen production from sunlight and electricity; Apply methods for protein engineering of hydrogenases for development of solar and glucose based H2-production, enable high throughput hydrogenase library screening, and improved in vivo and cell free hydrogenase expression and activation. Graduate Teaching Assistant Stanford University March 2013  –  June 2013  (4 months) Chemical Engineering 355: Advanced Biochemical Engineering,  \nServed as teaching assistant for a 35 student graduate level advanced biochemical engineering course, covering recombinant DNA technology and synthetic biology (metabolic engineering), production of protein pharmaceuticals, fermentation technology and process development within the framework of current business and regulatory requirement; prepared and led a weekly discussion review section, held office hours twice a week, put together and graded homework assignments and exams. Graduate Teaching Assistant Stanford University March 2013  –  June 2013  (4 months) Chemical Engineering 355: Advanced Biochemical Engineering,  \nServed as teaching assistant for a 35 student graduate level advanced biochemical engineering course, covering recombinant DNA technology and synthetic biology (metabolic engineering), production of protein pharmaceuticals, fermentation technology and process development within the framework of current business and regulatory requirement; prepared and led a weekly discussion review section, held office hours twice a week, put together and graded homework assignments and exams. Graduate Teaching Assistant Stanford University March 2012  –  June 2012  (4 months) Chemical Engineering 25B: Biotechnology \nTeaching assistant for a 110 student undergraduate survey course in biotechnology covering genetic engineering, cell culture, protein production, pharmaceutics, genomics, viruses, gene therapy, immunology, antibodies, cloning, stem cells, transgenic animals, intellectual property, government regulation, and ethics; Held office hours weekly and prepared and led a discussion review session for students. Graduate Teaching Assistant Stanford University March 2012  –  June 2012  (4 months) Chemical Engineering 25B: Biotechnology \nTeaching assistant for a 110 student undergraduate survey course in biotechnology covering genetic engineering, cell culture, protein production, pharmaceutics, genomics, viruses, gene therapy, immunology, antibodies, cloning, stem cells, transgenic animals, intellectual property, government regulation, and ethics; Held office hours weekly and prepared and led a discussion review session for students. Graduate Student Researcher Stanford University September 2011  –  March 2012  (7 months) Spormann Laboratory, Chemical Engineering; Investigated biogas production from waste water in microbial electrochemical cells; Created mutants to test electron transfer of E. coli for electro synthesis. Graduate Student Researcher Stanford University September 2011  –  March 2012  (7 months) Spormann Laboratory, Chemical Engineering; Investigated biogas production from waste water in microbial electrochemical cells; Created mutants to test electron transfer of E. coli for electro synthesis. Private Tutor, Athletic Academic Resource Center Stanford University September 2011  –  December 2011  (4 months) Engineering 30: Engineering Thermodynamics \nWorked with nine student athletes weekly to cover course content, including how energy and entropy principles are applied in thermodynamic analyses directed towards understanding the performances of engineering systems. Prepared extra practice problem sets, where methods and problems covered socially responsible economic generation and utilization of energy in central power generation plants, solar systems, refrigeration devices, and automobile, jet and gas-turbine engines. Private Tutor, Athletic Academic Resource Center Stanford University September 2011  –  December 2011  (4 months) Engineering 30: Engineering Thermodynamics \nWorked with nine student athletes weekly to cover course content, including how energy and entropy principles are applied in thermodynamic analyses directed towards understanding the performances of engineering systems. Prepared extra practice problem sets, where methods and problems covered socially responsible economic generation and utilization of energy in central power generation plants, solar systems, refrigeration devices, and automobile, jet and gas-turbine engines. Undergraduate Researcher UCSF May 2009  –  September 2009  (5 months) McKnight Lab, Dept. of Radiology and Biomedical Imaging; Research Adviser: Prof. Tracy McKnight \nCreated quantitative maps from magnetic resonance (MR) images of diffusion and T2 relaxation times in mouse models of the human U87 malignant glioma by writing MATLAB programs for analysis; measured physiological changes in tissue assessed for pre-clinical studies, including metabolite concentrations through magnetic resonance spectroscopy. Undergraduate Researcher UCSF May 2009  –  September 2009  (5 months) McKnight Lab, Dept. of Radiology and Biomedical Imaging; Research Adviser: Prof. Tracy McKnight \nCreated quantitative maps from magnetic resonance (MR) images of diffusion and T2 relaxation times in mouse models of the human U87 malignant glioma by writing MATLAB programs for analysis; measured physiological changes in tissue assessed for pre-clinical studies, including metabolite concentrations through magnetic resonance spectroscopy. Undergraduate Researcher UC Berkeley May 2008  –  December 2008  (8 months) Laboratory for the Science and Application of Catalysis, Dept. Chem. Eng.; Research Adviser: Prof. Enrique Iglesia; Investigated the catalytic conversion of glycerol, a major byproduct of biodiesel formation, to maximize chemical utility and reusability through zeolites and polyoxometalate catalysts; presented work at various conferences. Undergraduate Researcher UC Berkeley May 2008  –  December 2008  (8 months) Laboratory for the Science and Application of Catalysis, Dept. Chem. Eng.; Research Adviser: Prof. Enrique Iglesia; Investigated the catalytic conversion of glycerol, a major byproduct of biodiesel formation, to maximize chemical utility and reusability through zeolites and polyoxometalate catalysts; presented work at various conferences. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Protein Engineering Chemical Engineering Protein Expression Protein Purification Metabolic Engineering Molecular Biology Enzyme Kinetics Fermentation Technology Bioprocessing Biotechnology Environmental... Renewable Energy Reaction Kinetics Matlab Aspen Plus Simulink COMSOL ImageJ Chemstation Bacterial Cell Culture Protein Assays AKTA HPLC Materials Science Cell Culture Data Analysis Laboratory Research Science Spectroscopy See 15+     See less Skills  Protein Engineering Chemical Engineering Protein Expression Protein Purification Metabolic Engineering Molecular Biology Enzyme Kinetics Fermentation Technology Bioprocessing Biotechnology Environmental... Renewable Energy Reaction Kinetics Matlab Aspen Plus Simulink COMSOL ImageJ Chemstation Bacterial Cell Culture Protein Assays AKTA HPLC Materials Science Cell Culture Data Analysis Laboratory Research Science Spectroscopy See 15+     See less Protein Engineering Chemical Engineering Protein Expression Protein Purification Metabolic Engineering Molecular Biology Enzyme Kinetics Fermentation Technology Bioprocessing Biotechnology Environmental... Renewable Energy Reaction Kinetics Matlab Aspen Plus Simulink COMSOL ImageJ Chemstation Bacterial Cell Culture Protein Assays AKTA HPLC Materials Science Cell Culture Data Analysis Laboratory Research Science Spectroscopy See 15+     See less Protein Engineering Chemical Engineering Protein Expression Protein Purification Metabolic Engineering Molecular Biology Enzyme Kinetics Fermentation Technology Bioprocessing Biotechnology Environmental... Renewable Energy Reaction Kinetics Matlab Aspen Plus Simulink COMSOL ImageJ Chemstation Bacterial Cell Culture Protein Assays AKTA HPLC Materials Science Cell Culture Data Analysis Laboratory Research Science Spectroscopy See 15+     See less Education Stanford University Master of Science (M.S.),  Chemical Engineering 2010  – 2012 UC Berkeley Bachelor of Science (B.S.),  Chemical Engineering 2006  – 2010 Stanford University Master of Science (M.S.),  Chemical Engineering 2010  – 2012 Stanford University Master of Science (M.S.),  Chemical Engineering 2010  – 2012 Stanford University Master of Science (M.S.),  Chemical Engineering 2010  – 2012 UC Berkeley Bachelor of Science (B.S.),  Chemical Engineering 2006  – 2010 UC Berkeley Bachelor of Science (B.S.),  Chemical Engineering 2006  – 2010 UC Berkeley Bachelor of Science (B.S.),  Chemical Engineering 2006  – 2010 Honors & Awards National Science Foundation Graduate Research Fellowship April 2010 Diversifying Academia Recruiting Excellence Fellowship September 2013 Stanford Vice Provost for Graduate Education Fellowship for Academic Career Exploration Genentech Scholars Program Fellow March 2009 Genentech Fellow award to outstanding undergraduate in a Bay Area university Chevron Chemical Engineering Fellow, March 2009 UC Berkeley Chemical Engineering nomination for outstanding undergraduate in ChemE Dept National Science Foundation Graduate Research Fellowship April 2010 National Science Foundation Graduate Research Fellowship April 2010 National Science Foundation Graduate Research Fellowship April 2010 Diversifying Academia Recruiting Excellence Fellowship September 2013 Stanford Vice Provost for Graduate Education Fellowship for Academic Career Exploration Diversifying Academia Recruiting Excellence Fellowship September 2013 Stanford Vice Provost for Graduate Education Fellowship for Academic Career Exploration Diversifying Academia Recruiting Excellence Fellowship September 2013 Stanford Vice Provost for Graduate Education Fellowship for Academic Career Exploration Genentech Scholars Program Fellow March 2009 Genentech Fellow award to outstanding undergraduate in a Bay Area university Genentech Scholars Program Fellow March 2009 Genentech Fellow award to outstanding undergraduate in a Bay Area university Genentech Scholars Program Fellow March 2009 Genentech Fellow award to outstanding undergraduate in a Bay Area university Chevron Chemical Engineering Fellow, March 2009 UC Berkeley Chemical Engineering nomination for outstanding undergraduate in ChemE Dept Chevron Chemical Engineering Fellow, March 2009 UC Berkeley Chemical Engineering nomination for outstanding undergraduate in ChemE Dept Chevron Chemical Engineering Fellow, March 2009 UC Berkeley Chemical Engineering nomination for outstanding undergraduate in ChemE Dept ", "Summary I enjoy building new profitable businesses with great people. :)  Summary I enjoy building new profitable businesses with great people. :)  I enjoy building new profitable businesses with great people. :)  I enjoy building new profitable businesses with great people. :)  Experience Co-Founder, Customer Experience Team SurveyMonkey April 2014  – Present (1 year 5 months) Palo Alto Product Manager SurveyMonkey March 2013  –  April 2014  (1 year 2 months) Palo Alto Product manager for APIs, survey alerts, mobile billing and the SurveyMonkey Salesforce App Cofounder k-Factor Labs June 2012  –  March 2013  (10 months) San Francisco Bay Area Started a social gaming company that specialized in pure social growth optimization. Team was acquired by Survey Monkey in 2013. CTO and Cofounder Davia November 2010  –  May 2012  (1 year 7 months) Built large parts of the core technical architecture including database systems with billions of records, viral interfaces with tens of thousands of requests per second, solo.  \n \nWe were the Art of Gifting. \n \nAcquired by OKWave CTO Groupit 2010  –  2011  (1 year) Palo Alto, California Architected cutting edge cross domain SDK for groupit in pure javascript. Changed the way payments were done for group purchases, PCI compliant, and zero risk. \n \nBuilt a payment processing system for sharing payments securely with credit cards and directly with bank account. \n \nWrote entire platform, javascript sdk, all the build tools, all the tests and the apis. Used to be www.groupit.com Graduate Teaching Assistant Stanford University November 2009  –  December 2010  (1 year 2 months) Stanford, California Taught classes in human computer interaction, web design and fundamental programming. \n \nHelped create curriculum for CS105, CS294H, taught students on a one by one basis, graded projects, general mentor to students and assistant to world renowned professors. Full-ride Scholarship through GEM Lexmark June 2010  –  August 2010  (3 months) Lexington, Kentucky Area Took a lead role in the software i invented a year back, was invited to help with management, started a patent proposal. Made friends with some amazing people working at the only software job in kentucky. Senior Software Engineer Nunahealth January 2010  –  April 2010  (4 months) Best in class healthcare and insurance analytics tool for large corporations. Helped write the core algorithms for healthcare analysis at large well known companies (names are still private) \n \n \nBenefits analytics products have remained slow, complicated, and expensive for far too long. Our goal is to change that. We made sure to complement a sleek and simple design with a serious data crunching engine to help you visualize the true ROI of your programs, including wellness, created by some of the best engineers and PhD's in the world. We pride ourselves in knowing that every part of our product was created, tested, and approved by benefits pros, for benefits pros. Cofounder Inherithealth October 2008  –  November 2009  (1 year 2 months) Worked at inherithealth back in college. Was my first legitimate startup. Managed to push out a mix between a family tree and bio informatics software to the stanford research clinic. GEM Software Engineer Lexmark International June 2009  –  August 2009  (3 months) Integrating Adobe LiveCycle rights management services on embedded hardware for Lexmark's next generation printers.\t \n \nBuilt a perceptual differencing automated testing system for halftone images. Drastically reducing manual testing, thereby drastically improving Lexmark's development cycle. Researcher Stanford Undergraduate Research January 2008  –  August 2008  (8 months) Invented a novel interface for simulating, recording, and visualizing sensor traces. Co-Founder, Customer Experience Team SurveyMonkey April 2014  – Present (1 year 5 months) Palo Alto Co-Founder, Customer Experience Team SurveyMonkey April 2014  – Present (1 year 5 months) Palo Alto Product Manager SurveyMonkey March 2013  –  April 2014  (1 year 2 months) Palo Alto Product manager for APIs, survey alerts, mobile billing and the SurveyMonkey Salesforce App Product Manager SurveyMonkey March 2013  –  April 2014  (1 year 2 months) Palo Alto Product manager for APIs, survey alerts, mobile billing and the SurveyMonkey Salesforce App Cofounder k-Factor Labs June 2012  –  March 2013  (10 months) San Francisco Bay Area Started a social gaming company that specialized in pure social growth optimization. Team was acquired by Survey Monkey in 2013. Cofounder k-Factor Labs June 2012  –  March 2013  (10 months) San Francisco Bay Area Started a social gaming company that specialized in pure social growth optimization. Team was acquired by Survey Monkey in 2013. CTO and Cofounder Davia November 2010  –  May 2012  (1 year 7 months) Built large parts of the core technical architecture including database systems with billions of records, viral interfaces with tens of thousands of requests per second, solo.  \n \nWe were the Art of Gifting. \n \nAcquired by OKWave CTO and Cofounder Davia November 2010  –  May 2012  (1 year 7 months) Built large parts of the core technical architecture including database systems with billions of records, viral interfaces with tens of thousands of requests per second, solo.  \n \nWe were the Art of Gifting. \n \nAcquired by OKWave CTO Groupit 2010  –  2011  (1 year) Palo Alto, California Architected cutting edge cross domain SDK for groupit in pure javascript. Changed the way payments were done for group purchases, PCI compliant, and zero risk. \n \nBuilt a payment processing system for sharing payments securely with credit cards and directly with bank account. \n \nWrote entire platform, javascript sdk, all the build tools, all the tests and the apis. Used to be www.groupit.com CTO Groupit 2010  –  2011  (1 year) Palo Alto, California Architected cutting edge cross domain SDK for groupit in pure javascript. Changed the way payments were done for group purchases, PCI compliant, and zero risk. \n \nBuilt a payment processing system for sharing payments securely with credit cards and directly with bank account. \n \nWrote entire platform, javascript sdk, all the build tools, all the tests and the apis. Used to be www.groupit.com Graduate Teaching Assistant Stanford University November 2009  –  December 2010  (1 year 2 months) Stanford, California Taught classes in human computer interaction, web design and fundamental programming. \n \nHelped create curriculum for CS105, CS294H, taught students on a one by one basis, graded projects, general mentor to students and assistant to world renowned professors. Graduate Teaching Assistant Stanford University November 2009  –  December 2010  (1 year 2 months) Stanford, California Taught classes in human computer interaction, web design and fundamental programming. \n \nHelped create curriculum for CS105, CS294H, taught students on a one by one basis, graded projects, general mentor to students and assistant to world renowned professors. Full-ride Scholarship through GEM Lexmark June 2010  –  August 2010  (3 months) Lexington, Kentucky Area Took a lead role in the software i invented a year back, was invited to help with management, started a patent proposal. Made friends with some amazing people working at the only software job in kentucky. Full-ride Scholarship through GEM Lexmark June 2010  –  August 2010  (3 months) Lexington, Kentucky Area Took a lead role in the software i invented a year back, was invited to help with management, started a patent proposal. Made friends with some amazing people working at the only software job in kentucky. Senior Software Engineer Nunahealth January 2010  –  April 2010  (4 months) Best in class healthcare and insurance analytics tool for large corporations. Helped write the core algorithms for healthcare analysis at large well known companies (names are still private) \n \n \nBenefits analytics products have remained slow, complicated, and expensive for far too long. Our goal is to change that. We made sure to complement a sleek and simple design with a serious data crunching engine to help you visualize the true ROI of your programs, including wellness, created by some of the best engineers and PhD's in the world. We pride ourselves in knowing that every part of our product was created, tested, and approved by benefits pros, for benefits pros. Senior Software Engineer Nunahealth January 2010  –  April 2010  (4 months) Best in class healthcare and insurance analytics tool for large corporations. Helped write the core algorithms for healthcare analysis at large well known companies (names are still private) \n \n \nBenefits analytics products have remained slow, complicated, and expensive for far too long. Our goal is to change that. We made sure to complement a sleek and simple design with a serious data crunching engine to help you visualize the true ROI of your programs, including wellness, created by some of the best engineers and PhD's in the world. We pride ourselves in knowing that every part of our product was created, tested, and approved by benefits pros, for benefits pros. Cofounder Inherithealth October 2008  –  November 2009  (1 year 2 months) Worked at inherithealth back in college. Was my first legitimate startup. Managed to push out a mix between a family tree and bio informatics software to the stanford research clinic. Cofounder Inherithealth October 2008  –  November 2009  (1 year 2 months) Worked at inherithealth back in college. Was my first legitimate startup. Managed to push out a mix between a family tree and bio informatics software to the stanford research clinic. GEM Software Engineer Lexmark International June 2009  –  August 2009  (3 months) Integrating Adobe LiveCycle rights management services on embedded hardware for Lexmark's next generation printers.\t \n \nBuilt a perceptual differencing automated testing system for halftone images. Drastically reducing manual testing, thereby drastically improving Lexmark's development cycle. GEM Software Engineer Lexmark International June 2009  –  August 2009  (3 months) Integrating Adobe LiveCycle rights management services on embedded hardware for Lexmark's next generation printers.\t \n \nBuilt a perceptual differencing automated testing system for halftone images. Drastically reducing manual testing, thereby drastically improving Lexmark's development cycle. Researcher Stanford Undergraduate Research January 2008  –  August 2008  (8 months) Invented a novel interface for simulating, recording, and visualizing sensor traces. Researcher Stanford Undergraduate Research January 2008  –  August 2008  (8 months) Invented a novel interface for simulating, recording, and visualizing sensor traces. Skills Algorithms Ruby Programming Scalability Entrepreneurship Web Services Ruby on Rails Python Computer Vision Human Computer... Objective-C iOS development Git Software Engineering Computer Science JavaScript See 1+     See less Skills  Algorithms Ruby Programming Scalability Entrepreneurship Web Services Ruby on Rails Python Computer Vision Human Computer... Objective-C iOS development Git Software Engineering Computer Science JavaScript See 1+     See less Algorithms Ruby Programming Scalability Entrepreneurship Web Services Ruby on Rails Python Computer Vision Human Computer... Objective-C iOS development Git Software Engineering Computer Science JavaScript See 1+     See less Algorithms Ruby Programming Scalability Entrepreneurship Web Services Ruby on Rails Python Computer Vision Human Computer... Objective-C iOS development Git Software Engineering Computer Science JavaScript See 1+     See less Education Stanford University MS,  Computer Science 2009  – 2011 This degree is in progress and I am on permanent leave until further notice. Stanford University BS in Computer Science and Engineering, Minor in Economics,  Human Computer Interaction and Systems 2005  – 2009 Activities and Societies:  SSEA (Stanford summer engineering academy) ,  Research in HCI ,  SSCLES (Stanford's Society of Latino and Chicano Engineers and Scientists) ,  SHPE (Society of Hispanic Professional Engineers) Stanford University MS,  Computer Science 2009  – 2011 This degree is in progress and I am on permanent leave until further notice. Stanford University MS,  Computer Science 2009  – 2011 This degree is in progress and I am on permanent leave until further notice. Stanford University MS,  Computer Science 2009  – 2011 This degree is in progress and I am on permanent leave until further notice. Stanford University BS in Computer Science and Engineering, Minor in Economics,  Human Computer Interaction and Systems 2005  – 2009 Activities and Societies:  SSEA (Stanford summer engineering academy) ,  Research in HCI ,  SSCLES (Stanford's Society of Latino and Chicano Engineers and Scientists) ,  SHPE (Society of Hispanic Professional Engineers) Stanford University BS in Computer Science and Engineering, Minor in Economics,  Human Computer Interaction and Systems 2005  – 2009 Activities and Societies:  SSEA (Stanford summer engineering academy) ,  Research in HCI ,  SSCLES (Stanford's Society of Latino and Chicano Engineers and Scientists) ,  SHPE (Society of Hispanic Professional Engineers) Stanford University BS in Computer Science and Engineering, Minor in Economics,  Human Computer Interaction and Systems 2005  – 2009 Activities and Societies:  SSEA (Stanford summer engineering academy) ,  Research in HCI ,  SSCLES (Stanford's Society of Latino and Chicano Engineers and Scientists) ,  SHPE (Society of Hispanic Professional Engineers) Honors & Awards Additional Honors & Awards GEM Fellow: Stanford University - Full ride Additional Honors & Awards GEM Fellow: Stanford University - Full ride Additional Honors & Awards GEM Fellow: Stanford University - Full ride Additional Honors & Awards GEM Fellow: Stanford University - Full ride ", "Summary Genny Pang is a researcher with degrees in mechanical engineering, including her Ph.D. and M.S. from Stanford University and her B.S. from the University of California Los Angeles. Her research interests are in laser diagnostics and spectroscopy. She is currently an Alexander von Humboldt Fellow in at the Technical University of Munich. \n \nPreviously at Stanford, Genny worked in the Thermal Sciences Division of the Mechanical Engineering Department in the laboratory of Professor Ronald K. Hanson where she focused on applying laser diagnostics to shock tube experiments for improving detailed chemical kinetic modeling on the combustion of petroleum-derived and renewable fuel sources. Prior to her work at Stanford, she investigated thermal, fluid, and chemical science research problems related to energy and aerospace applications at the National Renewable Energy Laboratory, NASA Langley Research Center, and NASA Ames Research Center. In addition to her research experience, Genny has held teaching assistant positions at Stanford for graduate-level courses in optical diagnostics and chemically reacting flows.  \n \nGenny's other interests include mentoring youth in pre-college robotics programs, inspiring young women to become leaders in science and technology, and traveling to learn about the role of technology in different cultures. Her experiences include coaching an all-girls high school robotics team, volunteering through Latin America with energy-related projects, and judging youth technology challenges in Germany and the Netherlands. \n \nSpecialties: \n•\tExpert in the theory and application of optical diagnostics and thermal/energy systems  \n•\tExperienced in designing, modeling, operating, improving, troubleshooting and fixing problems in various electro-mechanical-optical-thermal systems \n•\tStrong written and oral communicator with audiences of varying levels of scientific background Summary Genny Pang is a researcher with degrees in mechanical engineering, including her Ph.D. and M.S. from Stanford University and her B.S. from the University of California Los Angeles. Her research interests are in laser diagnostics and spectroscopy. She is currently an Alexander von Humboldt Fellow in at the Technical University of Munich. \n \nPreviously at Stanford, Genny worked in the Thermal Sciences Division of the Mechanical Engineering Department in the laboratory of Professor Ronald K. Hanson where she focused on applying laser diagnostics to shock tube experiments for improving detailed chemical kinetic modeling on the combustion of petroleum-derived and renewable fuel sources. Prior to her work at Stanford, she investigated thermal, fluid, and chemical science research problems related to energy and aerospace applications at the National Renewable Energy Laboratory, NASA Langley Research Center, and NASA Ames Research Center. In addition to her research experience, Genny has held teaching assistant positions at Stanford for graduate-level courses in optical diagnostics and chemically reacting flows.  \n \nGenny's other interests include mentoring youth in pre-college robotics programs, inspiring young women to become leaders in science and technology, and traveling to learn about the role of technology in different cultures. Her experiences include coaching an all-girls high school robotics team, volunteering through Latin America with energy-related projects, and judging youth technology challenges in Germany and the Netherlands. \n \nSpecialties: \n•\tExpert in the theory and application of optical diagnostics and thermal/energy systems  \n•\tExperienced in designing, modeling, operating, improving, troubleshooting and fixing problems in various electro-mechanical-optical-thermal systems \n•\tStrong written and oral communicator with audiences of varying levels of scientific background Genny Pang is a researcher with degrees in mechanical engineering, including her Ph.D. and M.S. from Stanford University and her B.S. from the University of California Los Angeles. Her research interests are in laser diagnostics and spectroscopy. She is currently an Alexander von Humboldt Fellow in at the Technical University of Munich. \n \nPreviously at Stanford, Genny worked in the Thermal Sciences Division of the Mechanical Engineering Department in the laboratory of Professor Ronald K. Hanson where she focused on applying laser diagnostics to shock tube experiments for improving detailed chemical kinetic modeling on the combustion of petroleum-derived and renewable fuel sources. Prior to her work at Stanford, she investigated thermal, fluid, and chemical science research problems related to energy and aerospace applications at the National Renewable Energy Laboratory, NASA Langley Research Center, and NASA Ames Research Center. In addition to her research experience, Genny has held teaching assistant positions at Stanford for graduate-level courses in optical diagnostics and chemically reacting flows.  \n \nGenny's other interests include mentoring youth in pre-college robotics programs, inspiring young women to become leaders in science and technology, and traveling to learn about the role of technology in different cultures. Her experiences include coaching an all-girls high school robotics team, volunteering through Latin America with energy-related projects, and judging youth technology challenges in Germany and the Netherlands. \n \nSpecialties: \n•\tExpert in the theory and application of optical diagnostics and thermal/energy systems  \n•\tExperienced in designing, modeling, operating, improving, troubleshooting and fixing problems in various electro-mechanical-optical-thermal systems \n•\tStrong written and oral communicator with audiences of varying levels of scientific background Genny Pang is a researcher with degrees in mechanical engineering, including her Ph.D. and M.S. from Stanford University and her B.S. from the University of California Los Angeles. Her research interests are in laser diagnostics and spectroscopy. She is currently an Alexander von Humboldt Fellow in at the Technical University of Munich. \n \nPreviously at Stanford, Genny worked in the Thermal Sciences Division of the Mechanical Engineering Department in the laboratory of Professor Ronald K. Hanson where she focused on applying laser diagnostics to shock tube experiments for improving detailed chemical kinetic modeling on the combustion of petroleum-derived and renewable fuel sources. Prior to her work at Stanford, she investigated thermal, fluid, and chemical science research problems related to energy and aerospace applications at the National Renewable Energy Laboratory, NASA Langley Research Center, and NASA Ames Research Center. In addition to her research experience, Genny has held teaching assistant positions at Stanford for graduate-level courses in optical diagnostics and chemically reacting flows.  \n \nGenny's other interests include mentoring youth in pre-college robotics programs, inspiring young women to become leaders in science and technology, and traveling to learn about the role of technology in different cultures. Her experiences include coaching an all-girls high school robotics team, volunteering through Latin America with energy-related projects, and judging youth technology challenges in Germany and the Netherlands. \n \nSpecialties: \n•\tExpert in the theory and application of optical diagnostics and thermal/energy systems  \n•\tExperienced in designing, modeling, operating, improving, troubleshooting and fixing problems in various electro-mechanical-optical-thermal systems \n•\tStrong written and oral communicator with audiences of varying levels of scientific background Experience Alexander von Humboldt Postdoctoral Fellow Technische Universität München March 2015  – Present (6 months) Munich Area, Germany Institute of Hydrochemistry and Chair of Analytical Chemistry TUM University Foundation Fellow Technische Universität München January 2014  –  December 2014  (1 year) Munich Area, Germany Chair for Biological Imaging Guest Scientist HelmholtzZentrum München January 2014  –  December 2014  (1 year) Munich Area, Germany Institute for Biological and Medical Imaging Postdoctoral Research Scientist HelmholtzZentrum München April 2013  –  December 2013  (9 months) Munich Area, Germany Institute for Biological and Medical Imaging \n \n•\tResearch in spectral and optoacoustic properties of soft tissues for developmemt of optoacoustic sensing techniques in biomedical applications \n•\tFocus in real-time detection systems for feedback and control of surgical ablation treatments Rural Electrification Project Engineer WindAid February 2013  –  March 2013  (2 months) Trujillo, Peru Providing wind turbines for communities who lack electricity. \n \n•\tWind turbine construction (resin, fiberglass, carbon fiber, welding) and installation \n•\tSystem integration with local communities (families, businesses, parks, and schools) \n \nPart of the highest altitude wind turbine June 2013 Guinness World Record team. Mechanical Engineer Alterna Social Business Cultivator January 2013  –  January 2013  (1 month) Quetzeltenango, Guatemala Doña Dora project for fuel efficient biomass stoves. \n \n•\tContributed experimental and theoretical expertise in combustion, heat transfer, and thermodynamics for improving stove design. Postdoctoral Research Associate Stanford University October 2012  –  December 2012  (3 months) Stanford, CA High Temperature Gasdynamics Laboratory Graduate Research Assistant Stanford University September 2006  –  September 2012  (6 years 1 month) Stanford, CA High Temperature Gasdynamics Laboratory. Shock tube chemical kinetics and laser diagnostics \n \n•\tExperimental investigation of ignition phenomena in shock tubes  \n•\tImplementation of optical diagnostics (narrow-linewidth laser absorption and spontaneous emission collection) to quantitatively probe gas-phase mixtures and high-temperature chemistry \n•\tSupporting development of renewable fuels (butanol) as a viable replacement for petroleum by developing chemical kinetic mechanisms for combustion \n•\tOperation and maintenance of various laser systems and shock tube facility components (vacuum pumps, pressure measurement devices, gas-phase flow handling systems) Graduate Teaching Assistant Stanford University March 2008  –  March 2011  (3 years 1 month) Stanford, CA Course: Mechanical Engineering 367: Optical diagnostics and spectroscopy laboratory (Graduate Level) \n \n• Prepared lectures on optical diagnostics as regarding to shock tubes and chemical kinetics \n• Redesigned the laboratory assignment to include study of current research topics in shock tube experiments and also to increase the student involvement in experiment setup and facility operation \n \nCourse: Mechanical Engineering 362B: Non-equilibrium processes in high-temperature gas dynamics (Graduate Level) \n \n• Guest lectured on chemical kinetic modeling \n• Developed hundreds of pages of supplementary course material (including course reader), new problem sets, and exam questions \n• Awarded Centennial Teaching Assistant Award from Stanford University Robotics Program Director Notre Dame High School, San Jose August 2008  –  June 2010  (1 year 11 months) San Jose, CA FIRST Robotics Team 1967 \n \n•\tManaged a multi-disciplinary team of engineers to aid and mentor high school students in an engineering project for a international high school robotics competition. \n•\tExpanded the program significantly in budget, size, and impact through sponsor applications, recruiting of students and mentors, and intelligent planning and decision making. \n•\tInstructed computer programming, sensors and circuits, pneumatics, engineering design, and project management outside of the high school curriculum. \n•\tTaught applications of traditional high school subjects such as math, physics, chemistry, and English applied in a mock small-business environment with a robotics product. \n•\tDiagnosed and repaired problems in robotics systems (mechanical, electrical, and programming) during fast-paced robotics competition environment Undergraduate Research Fellow NASA Langley Research Center September 2005  –  December 2005  (4 months) Langley, VA NASA USRP (Undergraduate Student Research Program) Fellow \n \nFUN3D development team \n \n•\tApplied the FUN3D (Fully Unstructured Navier-Stokes) research code to a new application area \n•\tAwarded runner-up for Best Student Paper for work presented at the 2006 Region VI AIAA Student Conference in Irvine, CA Undergraduate Research Fellow National Renewable Energy Laboratory June 2004  –  August 2004  (3 months) Golden, CO NASA USRP (Undergraduate Student Research Program) Fellow \n \nAdvanced vehicles and fuels. Ancillary loads reduction team Student Apprentice NASA Ames Research Center June 2002  –  August 2002  (3 months) Moffett Field, CA NASA SHARP (Summer High School Apprenticeship Program) \n \nThermo-Physics Facilities Branch. Reacting flow environments Student Apprentice NASA Ames Research Center June 2001  –  August 2001  (3 months) Moffett Field, CA NASA SHARP (Summer High School Apprenticeship Program)  \n \nNASA Quest. Office of Education Alexander von Humboldt Postdoctoral Fellow Technische Universität München March 2015  – Present (6 months) Munich Area, Germany Institute of Hydrochemistry and Chair of Analytical Chemistry Alexander von Humboldt Postdoctoral Fellow Technische Universität München March 2015  – Present (6 months) Munich Area, Germany Institute of Hydrochemistry and Chair of Analytical Chemistry TUM University Foundation Fellow Technische Universität München January 2014  –  December 2014  (1 year) Munich Area, Germany Chair for Biological Imaging TUM University Foundation Fellow Technische Universität München January 2014  –  December 2014  (1 year) Munich Area, Germany Chair for Biological Imaging Guest Scientist HelmholtzZentrum München January 2014  –  December 2014  (1 year) Munich Area, Germany Institute for Biological and Medical Imaging Guest Scientist HelmholtzZentrum München January 2014  –  December 2014  (1 year) Munich Area, Germany Institute for Biological and Medical Imaging Postdoctoral Research Scientist HelmholtzZentrum München April 2013  –  December 2013  (9 months) Munich Area, Germany Institute for Biological and Medical Imaging \n \n•\tResearch in spectral and optoacoustic properties of soft tissues for developmemt of optoacoustic sensing techniques in biomedical applications \n•\tFocus in real-time detection systems for feedback and control of surgical ablation treatments Postdoctoral Research Scientist HelmholtzZentrum München April 2013  –  December 2013  (9 months) Munich Area, Germany Institute for Biological and Medical Imaging \n \n•\tResearch in spectral and optoacoustic properties of soft tissues for developmemt of optoacoustic sensing techniques in biomedical applications \n•\tFocus in real-time detection systems for feedback and control of surgical ablation treatments Rural Electrification Project Engineer WindAid February 2013  –  March 2013  (2 months) Trujillo, Peru Providing wind turbines for communities who lack electricity. \n \n•\tWind turbine construction (resin, fiberglass, carbon fiber, welding) and installation \n•\tSystem integration with local communities (families, businesses, parks, and schools) \n \nPart of the highest altitude wind turbine June 2013 Guinness World Record team. Rural Electrification Project Engineer WindAid February 2013  –  March 2013  (2 months) Trujillo, Peru Providing wind turbines for communities who lack electricity. \n \n•\tWind turbine construction (resin, fiberglass, carbon fiber, welding) and installation \n•\tSystem integration with local communities (families, businesses, parks, and schools) \n \nPart of the highest altitude wind turbine June 2013 Guinness World Record team. Mechanical Engineer Alterna Social Business Cultivator January 2013  –  January 2013  (1 month) Quetzeltenango, Guatemala Doña Dora project for fuel efficient biomass stoves. \n \n•\tContributed experimental and theoretical expertise in combustion, heat transfer, and thermodynamics for improving stove design. Mechanical Engineer Alterna Social Business Cultivator January 2013  –  January 2013  (1 month) Quetzeltenango, Guatemala Doña Dora project for fuel efficient biomass stoves. \n \n•\tContributed experimental and theoretical expertise in combustion, heat transfer, and thermodynamics for improving stove design. Postdoctoral Research Associate Stanford University October 2012  –  December 2012  (3 months) Stanford, CA High Temperature Gasdynamics Laboratory Postdoctoral Research Associate Stanford University October 2012  –  December 2012  (3 months) Stanford, CA High Temperature Gasdynamics Laboratory Graduate Research Assistant Stanford University September 2006  –  September 2012  (6 years 1 month) Stanford, CA High Temperature Gasdynamics Laboratory. Shock tube chemical kinetics and laser diagnostics \n \n•\tExperimental investigation of ignition phenomena in shock tubes  \n•\tImplementation of optical diagnostics (narrow-linewidth laser absorption and spontaneous emission collection) to quantitatively probe gas-phase mixtures and high-temperature chemistry \n•\tSupporting development of renewable fuels (butanol) as a viable replacement for petroleum by developing chemical kinetic mechanisms for combustion \n•\tOperation and maintenance of various laser systems and shock tube facility components (vacuum pumps, pressure measurement devices, gas-phase flow handling systems) Graduate Research Assistant Stanford University September 2006  –  September 2012  (6 years 1 month) Stanford, CA High Temperature Gasdynamics Laboratory. Shock tube chemical kinetics and laser diagnostics \n \n•\tExperimental investigation of ignition phenomena in shock tubes  \n•\tImplementation of optical diagnostics (narrow-linewidth laser absorption and spontaneous emission collection) to quantitatively probe gas-phase mixtures and high-temperature chemistry \n•\tSupporting development of renewable fuels (butanol) as a viable replacement for petroleum by developing chemical kinetic mechanisms for combustion \n•\tOperation and maintenance of various laser systems and shock tube facility components (vacuum pumps, pressure measurement devices, gas-phase flow handling systems) Graduate Teaching Assistant Stanford University March 2008  –  March 2011  (3 years 1 month) Stanford, CA Course: Mechanical Engineering 367: Optical diagnostics and spectroscopy laboratory (Graduate Level) \n \n• Prepared lectures on optical diagnostics as regarding to shock tubes and chemical kinetics \n• Redesigned the laboratory assignment to include study of current research topics in shock tube experiments and also to increase the student involvement in experiment setup and facility operation \n \nCourse: Mechanical Engineering 362B: Non-equilibrium processes in high-temperature gas dynamics (Graduate Level) \n \n• Guest lectured on chemical kinetic modeling \n• Developed hundreds of pages of supplementary course material (including course reader), new problem sets, and exam questions \n• Awarded Centennial Teaching Assistant Award from Stanford University Graduate Teaching Assistant Stanford University March 2008  –  March 2011  (3 years 1 month) Stanford, CA Course: Mechanical Engineering 367: Optical diagnostics and spectroscopy laboratory (Graduate Level) \n \n• Prepared lectures on optical diagnostics as regarding to shock tubes and chemical kinetics \n• Redesigned the laboratory assignment to include study of current research topics in shock tube experiments and also to increase the student involvement in experiment setup and facility operation \n \nCourse: Mechanical Engineering 362B: Non-equilibrium processes in high-temperature gas dynamics (Graduate Level) \n \n• Guest lectured on chemical kinetic modeling \n• Developed hundreds of pages of supplementary course material (including course reader), new problem sets, and exam questions \n• Awarded Centennial Teaching Assistant Award from Stanford University Robotics Program Director Notre Dame High School, San Jose August 2008  –  June 2010  (1 year 11 months) San Jose, CA FIRST Robotics Team 1967 \n \n•\tManaged a multi-disciplinary team of engineers to aid and mentor high school students in an engineering project for a international high school robotics competition. \n•\tExpanded the program significantly in budget, size, and impact through sponsor applications, recruiting of students and mentors, and intelligent planning and decision making. \n•\tInstructed computer programming, sensors and circuits, pneumatics, engineering design, and project management outside of the high school curriculum. \n•\tTaught applications of traditional high school subjects such as math, physics, chemistry, and English applied in a mock small-business environment with a robotics product. \n•\tDiagnosed and repaired problems in robotics systems (mechanical, electrical, and programming) during fast-paced robotics competition environment Robotics Program Director Notre Dame High School, San Jose August 2008  –  June 2010  (1 year 11 months) San Jose, CA FIRST Robotics Team 1967 \n \n•\tManaged a multi-disciplinary team of engineers to aid and mentor high school students in an engineering project for a international high school robotics competition. \n•\tExpanded the program significantly in budget, size, and impact through sponsor applications, recruiting of students and mentors, and intelligent planning and decision making. \n•\tInstructed computer programming, sensors and circuits, pneumatics, engineering design, and project management outside of the high school curriculum. \n•\tTaught applications of traditional high school subjects such as math, physics, chemistry, and English applied in a mock small-business environment with a robotics product. \n•\tDiagnosed and repaired problems in robotics systems (mechanical, electrical, and programming) during fast-paced robotics competition environment Undergraduate Research Fellow NASA Langley Research Center September 2005  –  December 2005  (4 months) Langley, VA NASA USRP (Undergraduate Student Research Program) Fellow \n \nFUN3D development team \n \n•\tApplied the FUN3D (Fully Unstructured Navier-Stokes) research code to a new application area \n•\tAwarded runner-up for Best Student Paper for work presented at the 2006 Region VI AIAA Student Conference in Irvine, CA Undergraduate Research Fellow NASA Langley Research Center September 2005  –  December 2005  (4 months) Langley, VA NASA USRP (Undergraduate Student Research Program) Fellow \n \nFUN3D development team \n \n•\tApplied the FUN3D (Fully Unstructured Navier-Stokes) research code to a new application area \n•\tAwarded runner-up for Best Student Paper for work presented at the 2006 Region VI AIAA Student Conference in Irvine, CA Undergraduate Research Fellow National Renewable Energy Laboratory June 2004  –  August 2004  (3 months) Golden, CO NASA USRP (Undergraduate Student Research Program) Fellow \n \nAdvanced vehicles and fuels. Ancillary loads reduction team Undergraduate Research Fellow National Renewable Energy Laboratory June 2004  –  August 2004  (3 months) Golden, CO NASA USRP (Undergraduate Student Research Program) Fellow \n \nAdvanced vehicles and fuels. Ancillary loads reduction team Student Apprentice NASA Ames Research Center June 2002  –  August 2002  (3 months) Moffett Field, CA NASA SHARP (Summer High School Apprenticeship Program) \n \nThermo-Physics Facilities Branch. Reacting flow environments Student Apprentice NASA Ames Research Center June 2002  –  August 2002  (3 months) Moffett Field, CA NASA SHARP (Summer High School Apprenticeship Program) \n \nThermo-Physics Facilities Branch. Reacting flow environments Student Apprentice NASA Ames Research Center June 2001  –  August 2001  (3 months) Moffett Field, CA NASA SHARP (Summer High School Apprenticeship Program)  \n \nNASA Quest. Office of Education Student Apprentice NASA Ames Research Center June 2001  –  August 2001  (3 months) Moffett Field, CA NASA SHARP (Summer High School Apprenticeship Program)  \n \nNASA Quest. Office of Education Languages English Native or bilingual proficiency German Professional working proficiency Spanish Limited working proficiency Chinese Elementary proficiency Cantonese Elementary proficiency English Native or bilingual proficiency German Professional working proficiency Spanish Limited working proficiency Chinese Elementary proficiency Cantonese Elementary proficiency English Native or bilingual proficiency German Professional working proficiency Spanish Limited working proficiency Chinese Elementary proficiency Cantonese Elementary proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Elementary proficiency Elementary proficiency Skills Experimentation Numerical Analysis Heat Transfer Mechanical Engineering Spectroscopy Thermodynamics Sensors Engineering Skills  Experimentation Numerical Analysis Heat Transfer Mechanical Engineering Spectroscopy Thermodynamics Sensors Engineering Experimentation Numerical Analysis Heat Transfer Mechanical Engineering Spectroscopy Thermodynamics Sensors Engineering Experimentation Numerical Analysis Heat Transfer Mechanical Engineering Spectroscopy Thermodynamics Sensors Engineering Education Stanford University MS, PhD,  Mechanical Engineering University of California, Los Angeles BS,  Mechanical Engineering Stanford University MS, PhD,  Mechanical Engineering Stanford University MS, PhD,  Mechanical Engineering Stanford University MS, PhD,  Mechanical Engineering University of California, Los Angeles BS,  Mechanical Engineering University of California, Los Angeles BS,  Mechanical Engineering University of California, Los Angeles BS,  Mechanical Engineering Honors & Awards ", "Languages English Chinese English Chinese English Chinese Skills Java Software Development Linux C  Artificial Intelligence C Human Computer... SQL Unix Eclipse SOA Requirements Analysis Object Oriented Design Subversion Software Project... Integration Knowledge Management Machine Learning Algorithms Natural Language... High Performance... Data Mining Text Mining Computer Science Distributed Systems Software Engineering Programming Parallel Computing Big Data Computational... Text Analytics Analysis J2EE Application... NetBeans Expert Systems C++ JPA NP-Hard Problems Constraint Satisfaction... Web Services Maven UML OpenGL Scrum Agile Methodologies Software Design Tomcat REST Intelligent Agents OOP See 35+     See less Skills  Java Software Development Linux C  Artificial Intelligence C Human Computer... SQL Unix Eclipse SOA Requirements Analysis Object Oriented Design Subversion Software Project... Integration Knowledge Management Machine Learning Algorithms Natural Language... High Performance... Data Mining Text Mining Computer Science Distributed Systems Software Engineering Programming Parallel Computing Big Data Computational... Text Analytics Analysis J2EE Application... NetBeans Expert Systems C++ JPA NP-Hard Problems Constraint Satisfaction... Web Services Maven UML OpenGL Scrum Agile Methodologies Software Design Tomcat REST Intelligent Agents OOP See 35+     See less Java Software Development Linux C  Artificial Intelligence C Human Computer... SQL Unix Eclipse SOA Requirements Analysis Object Oriented Design Subversion Software Project... Integration Knowledge Management Machine Learning Algorithms Natural Language... High Performance... Data Mining Text Mining Computer Science Distributed Systems Software Engineering Programming Parallel Computing Big Data Computational... Text Analytics Analysis J2EE Application... NetBeans Expert Systems C++ JPA NP-Hard Problems Constraint Satisfaction... Web Services Maven UML OpenGL Scrum Agile Methodologies Software Design Tomcat REST Intelligent Agents OOP See 35+     See less Java Software Development Linux C  Artificial Intelligence C Human Computer... SQL Unix Eclipse SOA Requirements Analysis Object Oriented Design Subversion Software Project... Integration Knowledge Management Machine Learning Algorithms Natural Language... High Performance... Data Mining Text Mining Computer Science Distributed Systems Software Engineering Programming Parallel Computing Big Data Computational... Text Analytics Analysis J2EE Application... NetBeans Expert Systems C++ JPA NP-Hard Problems Constraint Satisfaction... Web Services Maven UML OpenGL Scrum Agile Methodologies Software Design Tomcat REST Intelligent Agents OOP See 35+     See less ", "Summary Social policy analyst with experience in both qualitative and quantitative research. Academic interests include Ethnic Conflict, Democratization and Authoritarianism in the Developing World, and Terrorism. \n \nSpecialties: Excellent writing, editing, and research skills. \nHave understanding of the value of integrity and persistence in working toward short- and long-term personal and institutional goals.  \n \nNonprofit advocacy, government relations, coalition building, public speaking. \nCampaign experience related to coordinating campaign strategy, budget, operations and volunteers. Multicultural competencies. Social Media strategy to promote ideas and policy. Summary Social policy analyst with experience in both qualitative and quantitative research. Academic interests include Ethnic Conflict, Democratization and Authoritarianism in the Developing World, and Terrorism. \n \nSpecialties: Excellent writing, editing, and research skills. \nHave understanding of the value of integrity and persistence in working toward short- and long-term personal and institutional goals.  \n \nNonprofit advocacy, government relations, coalition building, public speaking. \nCampaign experience related to coordinating campaign strategy, budget, operations and volunteers. Multicultural competencies. Social Media strategy to promote ideas and policy. Social policy analyst with experience in both qualitative and quantitative research. Academic interests include Ethnic Conflict, Democratization and Authoritarianism in the Developing World, and Terrorism. \n \nSpecialties: Excellent writing, editing, and research skills. \nHave understanding of the value of integrity and persistence in working toward short- and long-term personal and institutional goals.  \n \nNonprofit advocacy, government relations, coalition building, public speaking. \nCampaign experience related to coordinating campaign strategy, budget, operations and volunteers. Multicultural competencies. Social Media strategy to promote ideas and policy. Social policy analyst with experience in both qualitative and quantitative research. Academic interests include Ethnic Conflict, Democratization and Authoritarianism in the Developing World, and Terrorism. \n \nSpecialties: Excellent writing, editing, and research skills. \nHave understanding of the value of integrity and persistence in working toward short- and long-term personal and institutional goals.  \n \nNonprofit advocacy, government relations, coalition building, public speaking. \nCampaign experience related to coordinating campaign strategy, budget, operations and volunteers. Multicultural competencies. Social Media strategy to promote ideas and policy. Experience Graduate Teaching Assistant Stanford University January 2015  – Present (8 months) Stanford, California Research Assistant- Dr. Robert Donaldson Political Science Department, University of Tulsa August 2011  –  May 2013  (1 year 10 months) Tulsa, Oklahoma Area Conducted research to catalog articles on foreign policy of Russia, focusing on policy after the war with Georgia.  \nPerformed data entry operations to prepare and create databases on research conducted on Russian politics to be used for future references. \nRead and analyzed over 200 articles providing key points of Russia’s interaction with the Common Wealth of Independent States, Europe, and the world beyond. PPIA Junior Summer Institute at University of Michigan Gerald R. Ford School of Public Policy Gerald R. Ford School of Public Policy June 2012  –  August 2012  (3 months) Ann Arbor MI PPIA is an intensive seven-week summer program that focuses on preparing students for graduate programs in public policy and international affairs. \n1 of 18 Fellows chosen from an applicant pool of nearly 300 applicants across the nation. \nPerformed statistical data analysis using STATA and Microsoft Excel and presented research on policy. \nDeveloped policy memos on topics including healthcare, the global financial crisis, and education. Intern Tulsa Committee on Foreign Relations September 2010  –  December 2011  (1 year 4 months) Tulsa, Oklahoma Area Assisted with set up of monthly meetings, where the Committee members engage with international experts and foreign policy officials in constructive discussion and debate on world issues. Help the Committee promote other educational programs and forums on international affairs. Summer Undergraduate Intership Program Leadership Alliance University of Pennsylvania June 2011  –  August 2011  (3 months) Greater Philadelphia Area 2011 Summer Research Early Identification Program in the School of Arts and Sciences at the University of Pennsylvania-the Leadership Alliance.  \nWorked with Professor Brendan O'Leary- \nConducted researched in the Political Science program. Investigated if there is a relationship between ethnic conflict and the IMF. Conducted research to see if specific conditions or internal country arrangements make conflict more likely. \nAnalyzed and compiled summaries on the International Monetary Fund’s Conditioned Agreements and the connection to ethnic conflict using various political theories. \nBecame familiar with several electronic reference databases such as, Worldwide Political Science Abstracts , Public Affairs Information Service, and library on-line journals. \nPrepared and delivered speech at the Leadership Alliance National Symposium. \nPresented research findings at the SUIP Research Symposium. Research Assistant-Political Science Department Dr. Saylor University of Tulsa December 2010  –  April 2011  (5 months) Researched state building and political development; politics of developing societies, particularly African and Latin American politics. Examining the intersection of international commodity booms, coalitional politics, and state building dynamics in the post-colonial world. \nProvided research assistance for book manuscript, Windows of Opportunity: Commodity Booms, Coalitional Politics, and State Building in Latin America and Africa. Intern One Oklahoma Coalition August 2010  –  November 2010  (4 months) The One Oklahoma Coalition is a non-partisan, diverse, statewide association working to safeguard the progress being made in Oklahoma schools and across the state. One Oklahoma was created as an umbrella organization for many groups and individuals to oppose passage of SQ 744 \nEngaged in grassroots organizing \nResearch  \nField work \nGained knowledge of political strategy when working with non-partisan diverse groups Social Media and Events Campaign Aid Bob Anderson For US Congress MN May 2010  –  August 2010  (4 months) Oversaw the creation and implementation of the Facebook Fan page for campaign \nWorked with campaign staff to fulfill their social media needs and gained experience working with political aids \nWorked with my team members on the implementation and creation of general campaigns events Campaign Volunteer Norm Coleman for US Senate Campaign May 2008  –  September 2008  (5 months) Volunteered for the campaign, attended rallies, canvassed, and participated in public promotions.  \nAssisted with inventory and recording of donations \nResearched polls and political data Graduate Teaching Assistant Stanford University January 2015  – Present (8 months) Stanford, California Graduate Teaching Assistant Stanford University January 2015  – Present (8 months) Stanford, California Research Assistant- Dr. Robert Donaldson Political Science Department, University of Tulsa August 2011  –  May 2013  (1 year 10 months) Tulsa, Oklahoma Area Conducted research to catalog articles on foreign policy of Russia, focusing on policy after the war with Georgia.  \nPerformed data entry operations to prepare and create databases on research conducted on Russian politics to be used for future references. \nRead and analyzed over 200 articles providing key points of Russia’s interaction with the Common Wealth of Independent States, Europe, and the world beyond. Research Assistant- Dr. Robert Donaldson Political Science Department, University of Tulsa August 2011  –  May 2013  (1 year 10 months) Tulsa, Oklahoma Area Conducted research to catalog articles on foreign policy of Russia, focusing on policy after the war with Georgia.  \nPerformed data entry operations to prepare and create databases on research conducted on Russian politics to be used for future references. \nRead and analyzed over 200 articles providing key points of Russia’s interaction with the Common Wealth of Independent States, Europe, and the world beyond. PPIA Junior Summer Institute at University of Michigan Gerald R. Ford School of Public Policy Gerald R. Ford School of Public Policy June 2012  –  August 2012  (3 months) Ann Arbor MI PPIA is an intensive seven-week summer program that focuses on preparing students for graduate programs in public policy and international affairs. \n1 of 18 Fellows chosen from an applicant pool of nearly 300 applicants across the nation. \nPerformed statistical data analysis using STATA and Microsoft Excel and presented research on policy. \nDeveloped policy memos on topics including healthcare, the global financial crisis, and education. PPIA Junior Summer Institute at University of Michigan Gerald R. Ford School of Public Policy Gerald R. Ford School of Public Policy June 2012  –  August 2012  (3 months) Ann Arbor MI PPIA is an intensive seven-week summer program that focuses on preparing students for graduate programs in public policy and international affairs. \n1 of 18 Fellows chosen from an applicant pool of nearly 300 applicants across the nation. \nPerformed statistical data analysis using STATA and Microsoft Excel and presented research on policy. \nDeveloped policy memos on topics including healthcare, the global financial crisis, and education. Intern Tulsa Committee on Foreign Relations September 2010  –  December 2011  (1 year 4 months) Tulsa, Oklahoma Area Assisted with set up of monthly meetings, where the Committee members engage with international experts and foreign policy officials in constructive discussion and debate on world issues. Help the Committee promote other educational programs and forums on international affairs. Intern Tulsa Committee on Foreign Relations September 2010  –  December 2011  (1 year 4 months) Tulsa, Oklahoma Area Assisted with set up of monthly meetings, where the Committee members engage with international experts and foreign policy officials in constructive discussion and debate on world issues. Help the Committee promote other educational programs and forums on international affairs. Summer Undergraduate Intership Program Leadership Alliance University of Pennsylvania June 2011  –  August 2011  (3 months) Greater Philadelphia Area 2011 Summer Research Early Identification Program in the School of Arts and Sciences at the University of Pennsylvania-the Leadership Alliance.  \nWorked with Professor Brendan O'Leary- \nConducted researched in the Political Science program. Investigated if there is a relationship between ethnic conflict and the IMF. Conducted research to see if specific conditions or internal country arrangements make conflict more likely. \nAnalyzed and compiled summaries on the International Monetary Fund’s Conditioned Agreements and the connection to ethnic conflict using various political theories. \nBecame familiar with several electronic reference databases such as, Worldwide Political Science Abstracts , Public Affairs Information Service, and library on-line journals. \nPrepared and delivered speech at the Leadership Alliance National Symposium. \nPresented research findings at the SUIP Research Symposium. Summer Undergraduate Intership Program Leadership Alliance University of Pennsylvania June 2011  –  August 2011  (3 months) Greater Philadelphia Area 2011 Summer Research Early Identification Program in the School of Arts and Sciences at the University of Pennsylvania-the Leadership Alliance.  \nWorked with Professor Brendan O'Leary- \nConducted researched in the Political Science program. Investigated if there is a relationship between ethnic conflict and the IMF. Conducted research to see if specific conditions or internal country arrangements make conflict more likely. \nAnalyzed and compiled summaries on the International Monetary Fund’s Conditioned Agreements and the connection to ethnic conflict using various political theories. \nBecame familiar with several electronic reference databases such as, Worldwide Political Science Abstracts , Public Affairs Information Service, and library on-line journals. \nPrepared and delivered speech at the Leadership Alliance National Symposium. \nPresented research findings at the SUIP Research Symposium. Research Assistant-Political Science Department Dr. Saylor University of Tulsa December 2010  –  April 2011  (5 months) Researched state building and political development; politics of developing societies, particularly African and Latin American politics. Examining the intersection of international commodity booms, coalitional politics, and state building dynamics in the post-colonial world. \nProvided research assistance for book manuscript, Windows of Opportunity: Commodity Booms, Coalitional Politics, and State Building in Latin America and Africa. Research Assistant-Political Science Department Dr. Saylor University of Tulsa December 2010  –  April 2011  (5 months) Researched state building and political development; politics of developing societies, particularly African and Latin American politics. Examining the intersection of international commodity booms, coalitional politics, and state building dynamics in the post-colonial world. \nProvided research assistance for book manuscript, Windows of Opportunity: Commodity Booms, Coalitional Politics, and State Building in Latin America and Africa. Intern One Oklahoma Coalition August 2010  –  November 2010  (4 months) The One Oklahoma Coalition is a non-partisan, diverse, statewide association working to safeguard the progress being made in Oklahoma schools and across the state. One Oklahoma was created as an umbrella organization for many groups and individuals to oppose passage of SQ 744 \nEngaged in grassroots organizing \nResearch  \nField work \nGained knowledge of political strategy when working with non-partisan diverse groups Intern One Oklahoma Coalition August 2010  –  November 2010  (4 months) The One Oklahoma Coalition is a non-partisan, diverse, statewide association working to safeguard the progress being made in Oklahoma schools and across the state. One Oklahoma was created as an umbrella organization for many groups and individuals to oppose passage of SQ 744 \nEngaged in grassroots organizing \nResearch  \nField work \nGained knowledge of political strategy when working with non-partisan diverse groups Social Media and Events Campaign Aid Bob Anderson For US Congress MN May 2010  –  August 2010  (4 months) Oversaw the creation and implementation of the Facebook Fan page for campaign \nWorked with campaign staff to fulfill their social media needs and gained experience working with political aids \nWorked with my team members on the implementation and creation of general campaigns events Social Media and Events Campaign Aid Bob Anderson For US Congress MN May 2010  –  August 2010  (4 months) Oversaw the creation and implementation of the Facebook Fan page for campaign \nWorked with campaign staff to fulfill their social media needs and gained experience working with political aids \nWorked with my team members on the implementation and creation of general campaigns events Campaign Volunteer Norm Coleman for US Senate Campaign May 2008  –  September 2008  (5 months) Volunteered for the campaign, attended rallies, canvassed, and participated in public promotions.  \nAssisted with inventory and recording of donations \nResearched polls and political data Campaign Volunteer Norm Coleman for US Senate Campaign May 2008  –  September 2008  (5 months) Volunteered for the campaign, attended rallies, canvassed, and participated in public promotions.  \nAssisted with inventory and recording of donations \nResearched polls and political data Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Skills     Education Stanford University Doctor of Philosophy (Ph.D.),  Political Science and Government 2013  – 2018 EDGE-SBE Fellow \nEnhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences (EDGE-SBE) program funded by the National Science Foundation aimed at increasing the number of underrepresented minorities in the social, behavioral and economic sciences, who enter and complete PhD programs and go on to academic jobs. \nhttps://iriss.stanford.edu/edge/fellows Activities and Societies:  EDGE-SBE Fellow ,  Judicial Panel Pool University of Tulsa Bachelor of Arts Summa cum Laude,  Economics and Political Science- Certificate in International Studies 2009  – 2013 Student Association Senator for the School of Arts and Science -Spring 2010-Fall 2012 \nElected by students to represent their voice on campus and help with funding decisions for organizations  \nPhi Eta Sigma Academic Honor Society- -Social Chair Fall 2010- Spring 2011 \nJohn Mabee Hall- University of Tulsa –President 2009-2010  \nCoordinate, review, and delegate dorm activities; negotiate housing policy, and conduct dorm government meetings twice a month. \nPrepared monthly academic, social, service oriented, multicultural, and athletic events for hall residents Activities and Societies:  Mentor for Leaders Incorporated -(LINC) a peer mentoring program available to incoming minority students.\nTU Leadership Experience Conference- Training that cover topics such as social justice and diversity ,  leadership styles ,  and leadership in the workforce\nPhi Eta Sigma Honor Society\nMember of Students for Liberty ,  Student Abolitionist\nVolunteer “Tulsa Time” student host.\nRepresentative to the Resident Hall Association-University of Tulsa University of Michigan-Gerald R Ford School of Public Policy PPIA FEllow 2012  – 2012 Universidad Antonio de Nebrija Spanish Language and Culture 2012  – 2012 Study abroad-Courses in Spanish Language and Culture- Completing intensive Spanish language courses and European History.  \nExtensive travel throughout Europe and North Africa Woodbury High School 2007  – 2009 Stanford University Doctor of Philosophy (Ph.D.),  Political Science and Government 2013  – 2018 EDGE-SBE Fellow \nEnhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences (EDGE-SBE) program funded by the National Science Foundation aimed at increasing the number of underrepresented minorities in the social, behavioral and economic sciences, who enter and complete PhD programs and go on to academic jobs. \nhttps://iriss.stanford.edu/edge/fellows Activities and Societies:  EDGE-SBE Fellow ,  Judicial Panel Pool Stanford University Doctor of Philosophy (Ph.D.),  Political Science and Government 2013  – 2018 EDGE-SBE Fellow \nEnhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences (EDGE-SBE) program funded by the National Science Foundation aimed at increasing the number of underrepresented minorities in the social, behavioral and economic sciences, who enter and complete PhD programs and go on to academic jobs. \nhttps://iriss.stanford.edu/edge/fellows Activities and Societies:  EDGE-SBE Fellow ,  Judicial Panel Pool Stanford University Doctor of Philosophy (Ph.D.),  Political Science and Government 2013  – 2018 EDGE-SBE Fellow \nEnhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences (EDGE-SBE) program funded by the National Science Foundation aimed at increasing the number of underrepresented minorities in the social, behavioral and economic sciences, who enter and complete PhD programs and go on to academic jobs. \nhttps://iriss.stanford.edu/edge/fellows Activities and Societies:  EDGE-SBE Fellow ,  Judicial Panel Pool University of Tulsa Bachelor of Arts Summa cum Laude,  Economics and Political Science- Certificate in International Studies 2009  – 2013 Student Association Senator for the School of Arts and Science -Spring 2010-Fall 2012 \nElected by students to represent their voice on campus and help with funding decisions for organizations  \nPhi Eta Sigma Academic Honor Society- -Social Chair Fall 2010- Spring 2011 \nJohn Mabee Hall- University of Tulsa –President 2009-2010  \nCoordinate, review, and delegate dorm activities; negotiate housing policy, and conduct dorm government meetings twice a month. \nPrepared monthly academic, social, service oriented, multicultural, and athletic events for hall residents Activities and Societies:  Mentor for Leaders Incorporated -(LINC) a peer mentoring program available to incoming minority students.\nTU Leadership Experience Conference- Training that cover topics such as social justice and diversity ,  leadership styles ,  and leadership in the workforce\nPhi Eta Sigma Honor Society\nMember of Students for Liberty ,  Student Abolitionist\nVolunteer “Tulsa Time” student host.\nRepresentative to the Resident Hall Association-University of Tulsa University of Tulsa Bachelor of Arts Summa cum Laude,  Economics and Political Science- Certificate in International Studies 2009  – 2013 Student Association Senator for the School of Arts and Science -Spring 2010-Fall 2012 \nElected by students to represent their voice on campus and help with funding decisions for organizations  \nPhi Eta Sigma Academic Honor Society- -Social Chair Fall 2010- Spring 2011 \nJohn Mabee Hall- University of Tulsa –President 2009-2010  \nCoordinate, review, and delegate dorm activities; negotiate housing policy, and conduct dorm government meetings twice a month. \nPrepared monthly academic, social, service oriented, multicultural, and athletic events for hall residents Activities and Societies:  Mentor for Leaders Incorporated -(LINC) a peer mentoring program available to incoming minority students.\nTU Leadership Experience Conference- Training that cover topics such as social justice and diversity ,  leadership styles ,  and leadership in the workforce\nPhi Eta Sigma Honor Society\nMember of Students for Liberty ,  Student Abolitionist\nVolunteer “Tulsa Time” student host.\nRepresentative to the Resident Hall Association-University of Tulsa University of Tulsa Bachelor of Arts Summa cum Laude,  Economics and Political Science- Certificate in International Studies 2009  – 2013 Student Association Senator for the School of Arts and Science -Spring 2010-Fall 2012 \nElected by students to represent their voice on campus and help with funding decisions for organizations  \nPhi Eta Sigma Academic Honor Society- -Social Chair Fall 2010- Spring 2011 \nJohn Mabee Hall- University of Tulsa –President 2009-2010  \nCoordinate, review, and delegate dorm activities; negotiate housing policy, and conduct dorm government meetings twice a month. \nPrepared monthly academic, social, service oriented, multicultural, and athletic events for hall residents Activities and Societies:  Mentor for Leaders Incorporated -(LINC) a peer mentoring program available to incoming minority students.\nTU Leadership Experience Conference- Training that cover topics such as social justice and diversity ,  leadership styles ,  and leadership in the workforce\nPhi Eta Sigma Honor Society\nMember of Students for Liberty ,  Student Abolitionist\nVolunteer “Tulsa Time” student host.\nRepresentative to the Resident Hall Association-University of Tulsa University of Michigan-Gerald R Ford School of Public Policy PPIA FEllow 2012  – 2012 University of Michigan-Gerald R Ford School of Public Policy PPIA FEllow 2012  – 2012 University of Michigan-Gerald R Ford School of Public Policy PPIA FEllow 2012  – 2012 Universidad Antonio de Nebrija Spanish Language and Culture 2012  – 2012 Study abroad-Courses in Spanish Language and Culture- Completing intensive Spanish language courses and European History.  \nExtensive travel throughout Europe and North Africa Universidad Antonio de Nebrija Spanish Language and Culture 2012  – 2012 Study abroad-Courses in Spanish Language and Culture- Completing intensive Spanish language courses and European History.  \nExtensive travel throughout Europe and North Africa Universidad Antonio de Nebrija Spanish Language and Culture 2012  – 2012 Study abroad-Courses in Spanish Language and Culture- Completing intensive Spanish language courses and European History.  \nExtensive travel throughout Europe and North Africa Woodbury High School 2007  – 2009 Woodbury High School 2007  – 2009 Woodbury High School 2007  – 2009 Honors & Awards Fellow at the Stanford Enhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences Stanford University EDGE-SBE September 2013 The Enhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences (EDGE-SBE) program is a National Science Foundation (NSF) initiative with two overarching aims. The first is to boost recruitment and enrollment of under-represented minorities in graduate programs. The second is to improve retention and to research the educational experiences of under-represented minorities who are already enrolled in graduate programs. American Political Science Association Minority Fellow American Political Science Association November 2012 APSA Minority Fellows, based on undergraduate course work, GPA, GRE scores, extracurricular activities, and recommendations from political science faculty.\n \nhttp://www.apsanet.org/content_68895.cfm\n \n Graduated Summa cum Laude University of Tulsa May 2013 Recipient of the William Vernon and Pauline Holloway Scholarship Award University of Tulsa May 2013 Recipient of the award Junior and Senior year. ( 3 time recipient) \nAward given to the Outstanding Political Science Major Institutional Nominee from the University of Tulsa for the Harry S. Truman Scholarship University of Tulsa September 2011 Selected as Institutional Nominee from the University of Tulsa for the Harry S. Truman Scholarship. \n Membership Honorary The National Association of College and University Residence Halls May 2010 The National Residence Hall Honorary (NRHH) is the premiere honorary supported by the leading national organization advocating for the interests and welfare of residence hall students, while also providing opportunities for their personal growth and development. NRHH strives to provide recognition for individuals who have contributed to the advancement of college and university housing. It ensures the advancement of member chapters through resource sharing, programming, and leadership development opportunities to contribute and support the vision of the National Association of College and University Residence Halls, Incorporated. Phi Beta Kappa Honors Society Phi Beta Kappa Honors Society April 2012 Phi Kappa Phi Honors Society- Phi Kappa Phi Honors Society- May 2012 Pi Sigma Alpha Honor Society - Pi Sigma Alpha Honor Society April 2011 Additional Honors & Awards American Political Science Association MInority Fellow 2012-2013 \nJess Chouteau Outstanding Senior for 2012 at the University of Tulsa. \nInstitutional nominee Truman Scholar- University of Tulsa  \nRecipient of the William Vernon and Pauline Holloway Scholarship Award -Political Science Department 2010-2011-2013 \nFreshman Leadership Institute Essay Winner- University of Tulsa 2010 \nMember of the University of Tulsa Honors Program \nPhi Eta Sigma Freshman Honor Society \nNational Merit Hispanic Scholar \nNational AP Scholar \nSouth East Area YMCA MN Y Partners campaign fundraiser- Recipient of Leadership Award Fellow at the Stanford Enhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences Stanford University EDGE-SBE September 2013 The Enhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences (EDGE-SBE) program is a National Science Foundation (NSF) initiative with two overarching aims. The first is to boost recruitment and enrollment of under-represented minorities in graduate programs. The second is to improve retention and to research the educational experiences of under-represented minorities who are already enrolled in graduate programs. Fellow at the Stanford Enhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences Stanford University EDGE-SBE September 2013 The Enhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences (EDGE-SBE) program is a National Science Foundation (NSF) initiative with two overarching aims. The first is to boost recruitment and enrollment of under-represented minorities in graduate programs. The second is to improve retention and to research the educational experiences of under-represented minorities who are already enrolled in graduate programs. Fellow at the Stanford Enhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences Stanford University EDGE-SBE September 2013 The Enhancing Diversity in Graduate Education in the Social, Behavioral and Economic Sciences (EDGE-SBE) program is a National Science Foundation (NSF) initiative with two overarching aims. The first is to boost recruitment and enrollment of under-represented minorities in graduate programs. The second is to improve retention and to research the educational experiences of under-represented minorities who are already enrolled in graduate programs. American Political Science Association Minority Fellow American Political Science Association November 2012 APSA Minority Fellows, based on undergraduate course work, GPA, GRE scores, extracurricular activities, and recommendations from political science faculty.\n \nhttp://www.apsanet.org/content_68895.cfm\n \n American Political Science Association Minority Fellow American Political Science Association November 2012 APSA Minority Fellows, based on undergraduate course work, GPA, GRE scores, extracurricular activities, and recommendations from political science faculty.\n \nhttp://www.apsanet.org/content_68895.cfm\n \n American Political Science Association Minority Fellow American Political Science Association November 2012 APSA Minority Fellows, based on undergraduate course work, GPA, GRE scores, extracurricular activities, and recommendations from political science faculty.\n \nhttp://www.apsanet.org/content_68895.cfm\n \n Graduated Summa cum Laude University of Tulsa May 2013 Graduated Summa cum Laude University of Tulsa May 2013 Graduated Summa cum Laude University of Tulsa May 2013 Recipient of the William Vernon and Pauline Holloway Scholarship Award University of Tulsa May 2013 Recipient of the award Junior and Senior year. ( 3 time recipient) \nAward given to the Outstanding Political Science Major Recipient of the William Vernon and Pauline Holloway Scholarship Award University of Tulsa May 2013 Recipient of the award Junior and Senior year. ( 3 time recipient) \nAward given to the Outstanding Political Science Major Recipient of the William Vernon and Pauline Holloway Scholarship Award University of Tulsa May 2013 Recipient of the award Junior and Senior year. ( 3 time recipient) \nAward given to the Outstanding Political Science Major Institutional Nominee from the University of Tulsa for the Harry S. Truman Scholarship University of Tulsa September 2011 Selected as Institutional Nominee from the University of Tulsa for the Harry S. Truman Scholarship. \n Institutional Nominee from the University of Tulsa for the Harry S. Truman Scholarship University of Tulsa September 2011 Selected as Institutional Nominee from the University of Tulsa for the Harry S. Truman Scholarship. \n Institutional Nominee from the University of Tulsa for the Harry S. Truman Scholarship University of Tulsa September 2011 Selected as Institutional Nominee from the University of Tulsa for the Harry S. Truman Scholarship. \n Membership Honorary The National Association of College and University Residence Halls May 2010 The National Residence Hall Honorary (NRHH) is the premiere honorary supported by the leading national organization advocating for the interests and welfare of residence hall students, while also providing opportunities for their personal growth and development. NRHH strives to provide recognition for individuals who have contributed to the advancement of college and university housing. It ensures the advancement of member chapters through resource sharing, programming, and leadership development opportunities to contribute and support the vision of the National Association of College and University Residence Halls, Incorporated. Membership Honorary The National Association of College and University Residence Halls May 2010 The National Residence Hall Honorary (NRHH) is the premiere honorary supported by the leading national organization advocating for the interests and welfare of residence hall students, while also providing opportunities for their personal growth and development. NRHH strives to provide recognition for individuals who have contributed to the advancement of college and university housing. It ensures the advancement of member chapters through resource sharing, programming, and leadership development opportunities to contribute and support the vision of the National Association of College and University Residence Halls, Incorporated. Membership Honorary The National Association of College and University Residence Halls May 2010 The National Residence Hall Honorary (NRHH) is the premiere honorary supported by the leading national organization advocating for the interests and welfare of residence hall students, while also providing opportunities for their personal growth and development. NRHH strives to provide recognition for individuals who have contributed to the advancement of college and university housing. It ensures the advancement of member chapters through resource sharing, programming, and leadership development opportunities to contribute and support the vision of the National Association of College and University Residence Halls, Incorporated. Phi Beta Kappa Honors Society Phi Beta Kappa Honors Society April 2012 Phi Beta Kappa Honors Society Phi Beta Kappa Honors Society April 2012 Phi Beta Kappa Honors Society Phi Beta Kappa Honors Society April 2012 Phi Kappa Phi Honors Society- Phi Kappa Phi Honors Society- May 2012 Phi Kappa Phi Honors Society- Phi Kappa Phi Honors Society- May 2012 Phi Kappa Phi Honors Society- Phi Kappa Phi Honors Society- May 2012 Pi Sigma Alpha Honor Society - Pi Sigma Alpha Honor Society April 2011 Pi Sigma Alpha Honor Society - Pi Sigma Alpha Honor Society April 2011 Pi Sigma Alpha Honor Society - Pi Sigma Alpha Honor Society April 2011 Additional Honors & Awards American Political Science Association MInority Fellow 2012-2013 \nJess Chouteau Outstanding Senior for 2012 at the University of Tulsa. \nInstitutional nominee Truman Scholar- University of Tulsa  \nRecipient of the William Vernon and Pauline Holloway Scholarship Award -Political Science Department 2010-2011-2013 \nFreshman Leadership Institute Essay Winner- University of Tulsa 2010 \nMember of the University of Tulsa Honors Program \nPhi Eta Sigma Freshman Honor Society \nNational Merit Hispanic Scholar \nNational AP Scholar \nSouth East Area YMCA MN Y Partners campaign fundraiser- Recipient of Leadership Award Additional Honors & Awards American Political Science Association MInority Fellow 2012-2013 \nJess Chouteau Outstanding Senior for 2012 at the University of Tulsa. \nInstitutional nominee Truman Scholar- University of Tulsa  \nRecipient of the William Vernon and Pauline Holloway Scholarship Award -Political Science Department 2010-2011-2013 \nFreshman Leadership Institute Essay Winner- University of Tulsa 2010 \nMember of the University of Tulsa Honors Program \nPhi Eta Sigma Freshman Honor Society \nNational Merit Hispanic Scholar \nNational AP Scholar \nSouth East Area YMCA MN Y Partners campaign fundraiser- Recipient of Leadership Award Additional Honors & Awards American Political Science Association MInority Fellow 2012-2013 \nJess Chouteau Outstanding Senior for 2012 at the University of Tulsa. \nInstitutional nominee Truman Scholar- University of Tulsa  \nRecipient of the William Vernon and Pauline Holloway Scholarship Award -Political Science Department 2010-2011-2013 \nFreshman Leadership Institute Essay Winner- University of Tulsa 2010 \nMember of the University of Tulsa Honors Program \nPhi Eta Sigma Freshman Honor Society \nNational Merit Hispanic Scholar \nNational AP Scholar \nSouth East Area YMCA MN Y Partners campaign fundraiser- Recipient of Leadership Award ", "Experience Graduate Teaching Assistant Stanford University September 2014  –  December 2014  (4 months) Teaching Assistant for CS229 Machine Learning (772 enrollment) Graduate Teaching Assistant Stanford University September 2013  –  January 2014  (5 months) Stanford, CA Teaching Assistant for PhD Linear Optimization (21 enrollment) Research Assistant Dalian University of Technology March 2008  –  July 2009  (1 year 5 months) Dalian, China Developed state-space superstructure and mixed integer nonlinear optimization models for process schedules, batch water-allocation network design and integrated separation network design. Designed an effective hybrid algorithm for solving the resulting mixed integer nonlinear optimization models. Graduate Teaching Assistant Stanford University September 2014  –  December 2014  (4 months) Teaching Assistant for CS229 Machine Learning (772 enrollment) Graduate Teaching Assistant Stanford University September 2014  –  December 2014  (4 months) Teaching Assistant for CS229 Machine Learning (772 enrollment) Graduate Teaching Assistant Stanford University September 2013  –  January 2014  (5 months) Stanford, CA Teaching Assistant for PhD Linear Optimization (21 enrollment) Graduate Teaching Assistant Stanford University September 2013  –  January 2014  (5 months) Stanford, CA Teaching Assistant for PhD Linear Optimization (21 enrollment) Research Assistant Dalian University of Technology March 2008  –  July 2009  (1 year 5 months) Dalian, China Developed state-space superstructure and mixed integer nonlinear optimization models for process schedules, batch water-allocation network design and integrated separation network design. Designed an effective hybrid algorithm for solving the resulting mixed integer nonlinear optimization models. Research Assistant Dalian University of Technology March 2008  –  July 2009  (1 year 5 months) Dalian, China Developed state-space superstructure and mixed integer nonlinear optimization models for process schedules, batch water-allocation network design and integrated separation network design. Designed an effective hybrid algorithm for solving the resulting mixed integer nonlinear optimization models. Languages English Chinese Native or bilingual proficiency English Chinese Native or bilingual proficiency English Chinese Native or bilingual proficiency Native or bilingual proficiency Skills Machine Learning Optimization Algorithm Design Process Analysis Process Simulation Signal Processing C++ Python Skills  Machine Learning Optimization Algorithm Design Process Analysis Process Simulation Signal Processing C++ Python Machine Learning Optimization Algorithm Design Process Analysis Process Simulation Signal Processing C++ Python Machine Learning Optimization Algorithm Design Process Analysis Process Simulation Signal Processing C++ Python Education Stanford University Master of Science (MS),  Electrical Engineering , 3.98/4.00 2012  – 2014 Stanford University Master of Science (MS),  Electrical Engineering , 3.98/4.00 2012  – 2014 Stanford University Master of Science (MS),  Electrical Engineering , 3.98/4.00 2012  – 2014 Stanford University Master of Science (MS),  Electrical Engineering , 3.98/4.00 2012  – 2014 ", "Languages French Limited working proficiency Microsoft Office Suite Full professional proficiency Adobe Suite Professional working proficiency French Limited working proficiency Microsoft Office Suite Full professional proficiency Adobe Suite Professional working proficiency French Limited working proficiency Microsoft Office Suite Full professional proficiency Adobe Suite Professional working proficiency Limited working proficiency Full professional proficiency Professional working proficiency Skills Design Strategy Design Thinking User-centered Design Ethnography Experience Design User Experience Design Management Concept Development Research Design User Research Design Research Concept Design Concept Generation Contextual Inquiry Data Visualization Product Development Service Design Sketching Strategic Design Strategy Systems Thinking User Experience Design User Interface Design See 8+     See less Skills  Design Strategy Design Thinking User-centered Design Ethnography Experience Design User Experience Design Management Concept Development Research Design User Research Design Research Concept Design Concept Generation Contextual Inquiry Data Visualization Product Development Service Design Sketching Strategic Design Strategy Systems Thinking User Experience Design User Interface Design See 8+     See less Design Strategy Design Thinking User-centered Design Ethnography Experience Design User Experience Design Management Concept Development Research Design User Research Design Research Concept Design Concept Generation Contextual Inquiry Data Visualization Product Development Service Design Sketching Strategic Design Strategy Systems Thinking User Experience Design User Interface Design See 8+     See less Design Strategy Design Thinking User-centered Design Ethnography Experience Design User Experience Design Management Concept Development Research Design User Research Design Research Concept Design Concept Generation Contextual Inquiry Data Visualization Product Development Service Design Sketching Strategic Design Strategy Systems Thinking User Experience Design User Interface Design See 8+     See less ", "Summary A dynamic and proven leader with an outstanding track record delivering programs and extensive, diverse project management experience. Expertise with design thinking in a broad range of projects. Highly collaborative problem solver, effective across business functions and industries, leading to breakthrough solutions for business operations. Accomplishments and significant expertise in improving operations and processes, program development and implementation, and cross-cultural exchange, driving improvements in resource management, personnel operations, costs, and quality. Summary A dynamic and proven leader with an outstanding track record delivering programs and extensive, diverse project management experience. Expertise with design thinking in a broad range of projects. Highly collaborative problem solver, effective across business functions and industries, leading to breakthrough solutions for business operations. Accomplishments and significant expertise in improving operations and processes, program development and implementation, and cross-cultural exchange, driving improvements in resource management, personnel operations, costs, and quality. A dynamic and proven leader with an outstanding track record delivering programs and extensive, diverse project management experience. Expertise with design thinking in a broad range of projects. Highly collaborative problem solver, effective across business functions and industries, leading to breakthrough solutions for business operations. Accomplishments and significant expertise in improving operations and processes, program development and implementation, and cross-cultural exchange, driving improvements in resource management, personnel operations, costs, and quality. A dynamic and proven leader with an outstanding track record delivering programs and extensive, diverse project management experience. Expertise with design thinking in a broad range of projects. Highly collaborative problem solver, effective across business functions and industries, leading to breakthrough solutions for business operations. Accomplishments and significant expertise in improving operations and processes, program development and implementation, and cross-cultural exchange, driving improvements in resource management, personnel operations, costs, and quality. Experience Innovation Catalyst, Design Thinking Facilitator Fidelity Investments August 2014  – Present (1 year 1 month) Creativity and Innovation Graduate Teaching Assistant Stanford University December 2013  –  June 2014  (7 months) Part of the teaching team for Creativity and Innovation in Stanford's Design School (d.school). Developed course material and lesson plans, responsible for course logistics and student communication, created and wrote materials such as a syllabus, visual aids, supplementary notes, and course websites. Tutored and mentored project groups with design thinking and group dynamics. Medical Operations Officer United States Army Reserve October 2011  –  October 2013  (2 years 1 month) Devens, MA Managed training plans, communications, staff synchronization, and operations for a Combat Support Hospital. Battle Captain for the operations center, responsible for managing communications, synchronizing resources, and maintaining the commander's common operating picture. Marketing Intern Astrodyne June 2013  –  August 2013  (3 months) Mansfield, MA Conduct market research for the military and aerospace division of Astrodyne, focusing on In-Flight Entertainment, Cabin Management Systems, other aviation applications, and satellite communications. Assist with other marketing and people operations projects, such as developing a standard for Astrodyne's training needs assessment, coordinating an employee health fair, and marketing communication efforts. Medical Logistics Officer US Army January 2010  –  August 2011  (1 year 8 months) Fort Drum, NY and Afghanistan • Established first American medical logistics footprint in Afghanistan’s Regional Command-North \n• Provided medical logistics support to units encompassing over 6,000 service-members \n• Designed and built a new medical warehouse in order to improve efficiency Operations Officer US Army June 2009  –  December 2009  (7 months) Medical Operations Officer US Army July 2008  –  March 2009  (9 months) Treatment Platoon Leader US Army December 2007  –  July 2008  (8 months) Executive Officer United States Army January 2007  –  November 2007  (11 months) English Teaching Assistant Fulbright Korea July 2005  –  July 2006  (1 year 1 month) Gyeryong, Chungcheongnam-do, Korea • Served as cultural ambassador and English teacher in rural Korea \n• Developed English lesson plans and taught over 900 students of varying abilities in a co-ed middle school Innovation Catalyst, Design Thinking Facilitator Fidelity Investments August 2014  – Present (1 year 1 month) Innovation Catalyst, Design Thinking Facilitator Fidelity Investments August 2014  – Present (1 year 1 month) Creativity and Innovation Graduate Teaching Assistant Stanford University December 2013  –  June 2014  (7 months) Part of the teaching team for Creativity and Innovation in Stanford's Design School (d.school). Developed course material and lesson plans, responsible for course logistics and student communication, created and wrote materials such as a syllabus, visual aids, supplementary notes, and course websites. Tutored and mentored project groups with design thinking and group dynamics. Creativity and Innovation Graduate Teaching Assistant Stanford University December 2013  –  June 2014  (7 months) Part of the teaching team for Creativity and Innovation in Stanford's Design School (d.school). Developed course material and lesson plans, responsible for course logistics and student communication, created and wrote materials such as a syllabus, visual aids, supplementary notes, and course websites. Tutored and mentored project groups with design thinking and group dynamics. Medical Operations Officer United States Army Reserve October 2011  –  October 2013  (2 years 1 month) Devens, MA Managed training plans, communications, staff synchronization, and operations for a Combat Support Hospital. Battle Captain for the operations center, responsible for managing communications, synchronizing resources, and maintaining the commander's common operating picture. Medical Operations Officer United States Army Reserve October 2011  –  October 2013  (2 years 1 month) Devens, MA Managed training plans, communications, staff synchronization, and operations for a Combat Support Hospital. Battle Captain for the operations center, responsible for managing communications, synchronizing resources, and maintaining the commander's common operating picture. Marketing Intern Astrodyne June 2013  –  August 2013  (3 months) Mansfield, MA Conduct market research for the military and aerospace division of Astrodyne, focusing on In-Flight Entertainment, Cabin Management Systems, other aviation applications, and satellite communications. Assist with other marketing and people operations projects, such as developing a standard for Astrodyne's training needs assessment, coordinating an employee health fair, and marketing communication efforts. Marketing Intern Astrodyne June 2013  –  August 2013  (3 months) Mansfield, MA Conduct market research for the military and aerospace division of Astrodyne, focusing on In-Flight Entertainment, Cabin Management Systems, other aviation applications, and satellite communications. Assist with other marketing and people operations projects, such as developing a standard for Astrodyne's training needs assessment, coordinating an employee health fair, and marketing communication efforts. Medical Logistics Officer US Army January 2010  –  August 2011  (1 year 8 months) Fort Drum, NY and Afghanistan • Established first American medical logistics footprint in Afghanistan’s Regional Command-North \n• Provided medical logistics support to units encompassing over 6,000 service-members \n• Designed and built a new medical warehouse in order to improve efficiency Medical Logistics Officer US Army January 2010  –  August 2011  (1 year 8 months) Fort Drum, NY and Afghanistan • Established first American medical logistics footprint in Afghanistan’s Regional Command-North \n• Provided medical logistics support to units encompassing over 6,000 service-members \n• Designed and built a new medical warehouse in order to improve efficiency Operations Officer US Army June 2009  –  December 2009  (7 months) Operations Officer US Army June 2009  –  December 2009  (7 months) Medical Operations Officer US Army July 2008  –  March 2009  (9 months) Medical Operations Officer US Army July 2008  –  March 2009  (9 months) Treatment Platoon Leader US Army December 2007  –  July 2008  (8 months) Treatment Platoon Leader US Army December 2007  –  July 2008  (8 months) Executive Officer United States Army January 2007  –  November 2007  (11 months) Executive Officer United States Army January 2007  –  November 2007  (11 months) English Teaching Assistant Fulbright Korea July 2005  –  July 2006  (1 year 1 month) Gyeryong, Chungcheongnam-do, Korea • Served as cultural ambassador and English teacher in rural Korea \n• Developed English lesson plans and taught over 900 students of varying abilities in a co-ed middle school English Teaching Assistant Fulbright Korea July 2005  –  July 2006  (1 year 1 month) Gyeryong, Chungcheongnam-do, Korea • Served as cultural ambassador and English teacher in rural Korea \n• Developed English lesson plans and taught over 900 students of varying abilities in a co-ed middle school Skills Creativity Design Thinking Leadership Development Organizational Design Operations Management Project Management Training Management Teaching Healthcare Management Negotiation Operational Planning Program Management Public Speaking Army Military Logistics Command Military Government Military Operations Microsoft Office Training Leadership Team Building Customer Insight Management See 10+     See less Skills  Creativity Design Thinking Leadership Development Organizational Design Operations Management Project Management Training Management Teaching Healthcare Management Negotiation Operational Planning Program Management Public Speaking Army Military Logistics Command Military Government Military Operations Microsoft Office Training Leadership Team Building Customer Insight Management See 10+     See less Creativity Design Thinking Leadership Development Organizational Design Operations Management Project Management Training Management Teaching Healthcare Management Negotiation Operational Planning Program Management Public Speaking Army Military Logistics Command Military Government Military Operations Microsoft Office Training Leadership Team Building Customer Insight Management See 10+     See less Creativity Design Thinking Leadership Development Organizational Design Operations Management Project Management Training Management Teaching Healthcare Management Negotiation Operational Planning Program Management Public Speaking Army Military Logistics Command Military Government Military Operations Microsoft Office Training Leadership Team Building Customer Insight Management See 10+     See less Education Stanford University Master of Science (M.S.),  Management Science and Engineering (MS&E) 2012  – 2014 Concentration in Organization, Design, Technology, and Entrepreneurship \n \n• Relevant Coursework: Creativity and Innovation, Design Leadership in Context, Designing for Sustainable Abundance, Organizational Behavior, Negotiation, Advanced Negotiation, Sustainable Product Development, CEE Entrepreneurship, Transformational Leadership, Decision Analysis \n \n• Relevant Projects: Sustainable New Product Design; Design School creativity project \n \n• Teaching Assistant for Creativity and Innovation Activities and Societies:  Founder and President of the MS&E Graduate Student Association;\nTour guide at the Design School The College of William and Mary BBA,  Business Adminstration 2001  – 2005 Activities and Societies:  Army ROTC ,  Residence Hall Council ,  Student Leadership Foundation ,  Democracy Matters ,  University Activities Board ,  Founder of Pirate Adventure and JBall Stanford University Master of Science (M.S.),  Management Science and Engineering (MS&E) 2012  – 2014 Concentration in Organization, Design, Technology, and Entrepreneurship \n \n• Relevant Coursework: Creativity and Innovation, Design Leadership in Context, Designing for Sustainable Abundance, Organizational Behavior, Negotiation, Advanced Negotiation, Sustainable Product Development, CEE Entrepreneurship, Transformational Leadership, Decision Analysis \n \n• Relevant Projects: Sustainable New Product Design; Design School creativity project \n \n• Teaching Assistant for Creativity and Innovation Activities and Societies:  Founder and President of the MS&E Graduate Student Association;\nTour guide at the Design School Stanford University Master of Science (M.S.),  Management Science and Engineering (MS&E) 2012  – 2014 Concentration in Organization, Design, Technology, and Entrepreneurship \n \n• Relevant Coursework: Creativity and Innovation, Design Leadership in Context, Designing for Sustainable Abundance, Organizational Behavior, Negotiation, Advanced Negotiation, Sustainable Product Development, CEE Entrepreneurship, Transformational Leadership, Decision Analysis \n \n• Relevant Projects: Sustainable New Product Design; Design School creativity project \n \n• Teaching Assistant for Creativity and Innovation Activities and Societies:  Founder and President of the MS&E Graduate Student Association;\nTour guide at the Design School Stanford University Master of Science (M.S.),  Management Science and Engineering (MS&E) 2012  – 2014 Concentration in Organization, Design, Technology, and Entrepreneurship \n \n• Relevant Coursework: Creativity and Innovation, Design Leadership in Context, Designing for Sustainable Abundance, Organizational Behavior, Negotiation, Advanced Negotiation, Sustainable Product Development, CEE Entrepreneurship, Transformational Leadership, Decision Analysis \n \n• Relevant Projects: Sustainable New Product Design; Design School creativity project \n \n• Teaching Assistant for Creativity and Innovation Activities and Societies:  Founder and President of the MS&E Graduate Student Association;\nTour guide at the Design School The College of William and Mary BBA,  Business Adminstration 2001  – 2005 Activities and Societies:  Army ROTC ,  Residence Hall Council ,  Student Leadership Foundation ,  Democracy Matters ,  University Activities Board ,  Founder of Pirate Adventure and JBall The College of William and Mary BBA,  Business Adminstration 2001  – 2005 Activities and Societies:  Army ROTC ,  Residence Hall Council ,  Student Leadership Foundation ,  Democracy Matters ,  University Activities Board ,  Founder of Pirate Adventure and JBall The College of William and Mary BBA,  Business Adminstration 2001  – 2005 Activities and Societies:  Army ROTC ,  Residence Hall Council ,  Student Leadership Foundation ,  Democracy Matters ,  University Activities Board ,  Founder of Pirate Adventure and JBall ", "Experience Graduate Teaching Assistant Stanford University September 2014  – Present (1 year) United States President Construction Management Association of America-Stanford Chapter September 2013  – Present (2 years) Stanford Graduate Teaching Assistant Stanford University September 2014  – Present (1 year) United States Graduate Teaching Assistant Stanford University September 2014  – Present (1 year) United States President Construction Management Association of America-Stanford Chapter September 2013  – Present (2 years) Stanford President Construction Management Association of America-Stanford Chapter September 2013  – Present (2 years) Stanford Languages English Spanish Hebrew English Spanish Hebrew English Spanish Hebrew Skills Skills     Education Stanford University M.S. Construction Engineering and Management,  Civil Engineering 2013  – 2014 Activities and Societies:  Construction Management Association of America ,  Association of Students Promoting Innovation in Real Estate Virginia Tech Bachelor of Science (B.S.),  Civil Engineering , Cum Laude 2009  – 2013 Stanford University M.S. Construction Engineering and Management,  Civil Engineering 2013  – 2014 Activities and Societies:  Construction Management Association of America ,  Association of Students Promoting Innovation in Real Estate Stanford University M.S. Construction Engineering and Management,  Civil Engineering 2013  – 2014 Activities and Societies:  Construction Management Association of America ,  Association of Students Promoting Innovation in Real Estate Stanford University M.S. Construction Engineering and Management,  Civil Engineering 2013  – 2014 Activities and Societies:  Construction Management Association of America ,  Association of Students Promoting Innovation in Real Estate Virginia Tech Bachelor of Science (B.S.),  Civil Engineering , Cum Laude 2009  – 2013 Virginia Tech Bachelor of Science (B.S.),  Civil Engineering , Cum Laude 2009  – 2013 Virginia Tech Bachelor of Science (B.S.),  Civil Engineering , Cum Laude 2009  – 2013 Honors & Awards Additional Honors & Awards -Recipient of CMAA NorCal Chapter Scholarship Award, 2014 \n-Sponsored by Stanford CMAA student chapter to attend Rising CM conference, 2013 \n-Recipient of CMAA National Capital Chapter Scholarship Award, 2012 \n-Recipient of Virginia Tech AEPi 4.0 Saperstone Scholarship Award, 2012 \n-Sponsored by CMAA student chapter to attend Rising CM conference, 2012 \n-Sponsored by Civil Engineering department to attend SHPE National Conference, 2012 \n-Recipient of Pratt Engineering Scholarship, 2010 \n-Dean’s list: Fall 2009, 2011; Spring 2013, Spring 2012 (with distinction); Fall 2012 (with distinction) Additional Honors & Awards -Recipient of CMAA NorCal Chapter Scholarship Award, 2014 \n-Sponsored by Stanford CMAA student chapter to attend Rising CM conference, 2013 \n-Recipient of CMAA National Capital Chapter Scholarship Award, 2012 \n-Recipient of Virginia Tech AEPi 4.0 Saperstone Scholarship Award, 2012 \n-Sponsored by CMAA student chapter to attend Rising CM conference, 2012 \n-Sponsored by Civil Engineering department to attend SHPE National Conference, 2012 \n-Recipient of Pratt Engineering Scholarship, 2010 \n-Dean’s list: Fall 2009, 2011; Spring 2013, Spring 2012 (with distinction); Fall 2012 (with distinction) Additional Honors & Awards -Recipient of CMAA NorCal Chapter Scholarship Award, 2014 \n-Sponsored by Stanford CMAA student chapter to attend Rising CM conference, 2013 \n-Recipient of CMAA National Capital Chapter Scholarship Award, 2012 \n-Recipient of Virginia Tech AEPi 4.0 Saperstone Scholarship Award, 2012 \n-Sponsored by CMAA student chapter to attend Rising CM conference, 2012 \n-Sponsored by Civil Engineering department to attend SHPE National Conference, 2012 \n-Recipient of Pratt Engineering Scholarship, 2010 \n-Dean’s list: Fall 2009, 2011; Spring 2013, Spring 2012 (with distinction); Fall 2012 (with distinction) Additional Honors & Awards -Recipient of CMAA NorCal Chapter Scholarship Award, 2014 \n-Sponsored by Stanford CMAA student chapter to attend Rising CM conference, 2013 \n-Recipient of CMAA National Capital Chapter Scholarship Award, 2012 \n-Recipient of Virginia Tech AEPi 4.0 Saperstone Scholarship Award, 2012 \n-Sponsored by CMAA student chapter to attend Rising CM conference, 2012 \n-Sponsored by Civil Engineering department to attend SHPE National Conference, 2012 \n-Recipient of Pratt Engineering Scholarship, 2010 \n-Dean’s list: Fall 2009, 2011; Spring 2013, Spring 2012 (with distinction); Fall 2012 (with distinction) ", "Summary Specialties / Interests: \n:: RF / analog / mixed-signal system and transistor-level circuit design, optimization and automation. \n:: RFIC architecture and specification development for 2G/3G/4G cellular standards. Summary Specialties / Interests: \n:: RF / analog / mixed-signal system and transistor-level circuit design, optimization and automation. \n:: RFIC architecture and specification development for 2G/3G/4G cellular standards. Specialties / Interests: \n:: RF / analog / mixed-signal system and transistor-level circuit design, optimization and automation. \n:: RFIC architecture and specification development for 2G/3G/4G cellular standards. Specialties / Interests: \n:: RF / analog / mixed-signal system and transistor-level circuit design, optimization and automation. \n:: RFIC architecture and specification development for 2G/3G/4G cellular standards. Experience Staff Engineer Samsung Semiconductor Inc. March 2015  – Present (6 months) San Jose Senior Engineer Samsung Semiconductor Inc. June 2013  –  February 2015  (1 year 9 months) San Jose Graduate Research Assistant Stanford University September 2008  –  June 2013  (4 years 10 months) Stanford Research assistant at the Murmann Mixed-Signal Research Group, Department of Electrical Engineering. \nThesis projects: RF and analog circuits using MEMS, amplifier and active-filter optimization. \nCollaborated projects: Multi-GHz quadrature VCO's, adaptively biased RF front-ends. Intern LitePoint June 2010  –  September 2010  (4 months) Sunnyvale Design and PCB layout of RF test instruments for WiFi / FM / GPS chain. Graduate Teaching Assistant Stanford University April 2008  –  June 2010  (2 years 3 months) Stanford Teaching assistant for graduate RFIC and system design courses at Stanford popular with industry professionals and students: \nEE314 - RF Integrated Circuit Design \nEE344 - High Frequency Laboratory \nEE414 - RF Transceiver Design Laboratory Intern Broadcom June 2008  –  September 2008  (4 months) San Jose Design and layout of a common-mode voltage calibration loop for an ADC. Design Intern National Semiconductor June 2007  –  September 2007  (4 months) Sunnyvale Design, layout and testing of a product line 189 ksps SAR ADC with programmable 12-10-8 bit resolution and I2C interface. Research Intern Microsoft May 2005  –  July 2005  (3 months) Redmond Worked on MSR Sense: Spreadsheet Based Programming & Managing of Sensor Networks, at the Networked Embedded Computing Group, Microsoft Research. Staff Engineer Samsung Semiconductor Inc. March 2015  – Present (6 months) San Jose Staff Engineer Samsung Semiconductor Inc. March 2015  – Present (6 months) San Jose Senior Engineer Samsung Semiconductor Inc. June 2013  –  February 2015  (1 year 9 months) San Jose Senior Engineer Samsung Semiconductor Inc. June 2013  –  February 2015  (1 year 9 months) San Jose Graduate Research Assistant Stanford University September 2008  –  June 2013  (4 years 10 months) Stanford Research assistant at the Murmann Mixed-Signal Research Group, Department of Electrical Engineering. \nThesis projects: RF and analog circuits using MEMS, amplifier and active-filter optimization. \nCollaborated projects: Multi-GHz quadrature VCO's, adaptively biased RF front-ends. Graduate Research Assistant Stanford University September 2008  –  June 2013  (4 years 10 months) Stanford Research assistant at the Murmann Mixed-Signal Research Group, Department of Electrical Engineering. \nThesis projects: RF and analog circuits using MEMS, amplifier and active-filter optimization. \nCollaborated projects: Multi-GHz quadrature VCO's, adaptively biased RF front-ends. Intern LitePoint June 2010  –  September 2010  (4 months) Sunnyvale Design and PCB layout of RF test instruments for WiFi / FM / GPS chain. Intern LitePoint June 2010  –  September 2010  (4 months) Sunnyvale Design and PCB layout of RF test instruments for WiFi / FM / GPS chain. Graduate Teaching Assistant Stanford University April 2008  –  June 2010  (2 years 3 months) Stanford Teaching assistant for graduate RFIC and system design courses at Stanford popular with industry professionals and students: \nEE314 - RF Integrated Circuit Design \nEE344 - High Frequency Laboratory \nEE414 - RF Transceiver Design Laboratory Graduate Teaching Assistant Stanford University April 2008  –  June 2010  (2 years 3 months) Stanford Teaching assistant for graduate RFIC and system design courses at Stanford popular with industry professionals and students: \nEE314 - RF Integrated Circuit Design \nEE344 - High Frequency Laboratory \nEE414 - RF Transceiver Design Laboratory Intern Broadcom June 2008  –  September 2008  (4 months) San Jose Design and layout of a common-mode voltage calibration loop for an ADC. Intern Broadcom June 2008  –  September 2008  (4 months) San Jose Design and layout of a common-mode voltage calibration loop for an ADC. Design Intern National Semiconductor June 2007  –  September 2007  (4 months) Sunnyvale Design, layout and testing of a product line 189 ksps SAR ADC with programmable 12-10-8 bit resolution and I2C interface. Design Intern National Semiconductor June 2007  –  September 2007  (4 months) Sunnyvale Design, layout and testing of a product line 189 ksps SAR ADC with programmable 12-10-8 bit resolution and I2C interface. Research Intern Microsoft May 2005  –  July 2005  (3 months) Redmond Worked on MSR Sense: Spreadsheet Based Programming & Managing of Sensor Networks, at the Networked Embedded Computing Group, Microsoft Research. Research Intern Microsoft May 2005  –  July 2005  (3 months) Redmond Worked on MSR Sense: Spreadsheet Based Programming & Managing of Sensor Networks, at the Networked Embedded Computing Group, Microsoft Research. Languages   Skills Cellular RF RF circuits Mixed Signal Analog Circuit Design IC Integrated Circuit... 4G LTE PCB design Matlab Simulations Electrical Engineering Cadence Virtuoso C MEMS Verilog Wireless VCO Analog Filters Amplifiers Circuit Optimization Communication Systems CAD PCB Design Analog See 9+     See less Skills  Cellular RF RF circuits Mixed Signal Analog Circuit Design IC Integrated Circuit... 4G LTE PCB design Matlab Simulations Electrical Engineering Cadence Virtuoso C MEMS Verilog Wireless VCO Analog Filters Amplifiers Circuit Optimization Communication Systems CAD PCB Design Analog See 9+     See less Cellular RF RF circuits Mixed Signal Analog Circuit Design IC Integrated Circuit... 4G LTE PCB design Matlab Simulations Electrical Engineering Cadence Virtuoso C MEMS Verilog Wireless VCO Analog Filters Amplifiers Circuit Optimization Communication Systems CAD PCB Design Analog See 9+     See less Cellular RF RF circuits Mixed Signal Analog Circuit Design IC Integrated Circuit... 4G LTE PCB design Matlab Simulations Electrical Engineering Cadence Virtuoso C MEMS Verilog Wireless VCO Analog Filters Amplifiers Circuit Optimization Communication Systems CAD PCB Design Analog See 9+     See less Education Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2008  – 2013 Stanford University MS,  Electrical Engineering 2006  – 2008 Indian Institute of Technology, Kharagpur Bachelor of Technology (B.Tech.),  Electronics and Electrical Communication Engineering 2002  – 2006 Thesis projects: Sampled analog architecture for 1-D DCT switched-current circuits, UWB signal generation and application. Activities and Societies:  Inter Hall Technology GC Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2008  – 2013 Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2008  – 2013 Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2008  – 2013 Stanford University MS,  Electrical Engineering 2006  – 2008 Stanford University MS,  Electrical Engineering 2006  – 2008 Stanford University MS,  Electrical Engineering 2006  – 2008 Indian Institute of Technology, Kharagpur Bachelor of Technology (B.Tech.),  Electronics and Electrical Communication Engineering 2002  – 2006 Thesis projects: Sampled analog architecture for 1-D DCT switched-current circuits, UWB signal generation and application. Activities and Societies:  Inter Hall Technology GC Indian Institute of Technology, Kharagpur Bachelor of Technology (B.Tech.),  Electronics and Electrical Communication Engineering 2002  – 2006 Thesis projects: Sampled analog architecture for 1-D DCT switched-current circuits, UWB signal generation and application. Activities and Societies:  Inter Hall Technology GC Indian Institute of Technology, Kharagpur Bachelor of Technology (B.Tech.),  Electronics and Electrical Communication Engineering 2002  – 2006 Thesis projects: Sampled analog architecture for 1-D DCT switched-current circuits, UWB signal generation and application. Activities and Societies:  Inter Hall Technology GC Honors & Awards Dr. B. C. Roy Gold Medal IIT Kharagpur July 2006 Awarded for best all-round performance in the Institute. Institute Silver Medal Department of Electronics and Electrical Communication Engineering, IIT Kharagpur July 2006 Robert Bosch Stanford Graduate Fellowship (SGF) Stanford University July 2006 Analog Devices Outstanding Student Designer Award Analog Devices February 2011 Dr. B. C. Roy Gold Medal IIT Kharagpur July 2006 Awarded for best all-round performance in the Institute. Dr. B. C. Roy Gold Medal IIT Kharagpur July 2006 Awarded for best all-round performance in the Institute. Dr. B. C. Roy Gold Medal IIT Kharagpur July 2006 Awarded for best all-round performance in the Institute. Institute Silver Medal Department of Electronics and Electrical Communication Engineering, IIT Kharagpur July 2006 Institute Silver Medal Department of Electronics and Electrical Communication Engineering, IIT Kharagpur July 2006 Institute Silver Medal Department of Electronics and Electrical Communication Engineering, IIT Kharagpur July 2006 Robert Bosch Stanford Graduate Fellowship (SGF) Stanford University July 2006 Robert Bosch Stanford Graduate Fellowship (SGF) Stanford University July 2006 Robert Bosch Stanford Graduate Fellowship (SGF) Stanford University July 2006 Analog Devices Outstanding Student Designer Award Analog Devices February 2011 Analog Devices Outstanding Student Designer Award Analog Devices February 2011 Analog Devices Outstanding Student Designer Award Analog Devices February 2011 ", "Summary John is a registered US Patent Agent with over 18 years of experience in intellectual property and computer technology. John was trained in patent drafting and prosecution at a leading nationwide IP law firm. Before his transition to patent law, John worked for many years as a hardware engineer on microprocessor design teams at Intel and HP. John also spent several years designing UNIX software for high-speed printing applications. As a graduate teaching assistant at Stanford University, John taught classes relating to software algorithms, compilers, networking, distributed software, C++, and web site design, and gained valuable experience teaching technical concepts to non-technical audiences. John’s technical experience and legal background enable him to provide uniquely insightful technical opinions and comprehensive patent analyses which are highly respected throughout the industry. John is an inventor on 15 US patents, with 24 additional applications pending. Specialties:Patent analysis, claim-charting, valuation, reverse engineering, validity research, litigation support, computer hardware, computer software, computer architecture, microprocessors, digital circuits, gaming, 3D graphics, operating systems, databases, user interfaces, printer software, iPhone software applications Summary John is a registered US Patent Agent with over 18 years of experience in intellectual property and computer technology. John was trained in patent drafting and prosecution at a leading nationwide IP law firm. Before his transition to patent law, John worked for many years as a hardware engineer on microprocessor design teams at Intel and HP. John also spent several years designing UNIX software for high-speed printing applications. As a graduate teaching assistant at Stanford University, John taught classes relating to software algorithms, compilers, networking, distributed software, C++, and web site design, and gained valuable experience teaching technical concepts to non-technical audiences. John’s technical experience and legal background enable him to provide uniquely insightful technical opinions and comprehensive patent analyses which are highly respected throughout the industry. John is an inventor on 15 US patents, with 24 additional applications pending. Specialties:Patent analysis, claim-charting, valuation, reverse engineering, validity research, litigation support, computer hardware, computer software, computer architecture, microprocessors, digital circuits, gaming, 3D graphics, operating systems, databases, user interfaces, printer software, iPhone software applications John is a registered US Patent Agent with over 18 years of experience in intellectual property and computer technology. John was trained in patent drafting and prosecution at a leading nationwide IP law firm. Before his transition to patent law, John worked for many years as a hardware engineer on microprocessor design teams at Intel and HP. John also spent several years designing UNIX software for high-speed printing applications. As a graduate teaching assistant at Stanford University, John taught classes relating to software algorithms, compilers, networking, distributed software, C++, and web site design, and gained valuable experience teaching technical concepts to non-technical audiences. John’s technical experience and legal background enable him to provide uniquely insightful technical opinions and comprehensive patent analyses which are highly respected throughout the industry. John is an inventor on 15 US patents, with 24 additional applications pending. Specialties:Patent analysis, claim-charting, valuation, reverse engineering, validity research, litigation support, computer hardware, computer software, computer architecture, microprocessors, digital circuits, gaming, 3D graphics, operating systems, databases, user interfaces, printer software, iPhone software applications John is a registered US Patent Agent with over 18 years of experience in intellectual property and computer technology. John was trained in patent drafting and prosecution at a leading nationwide IP law firm. Before his transition to patent law, John worked for many years as a hardware engineer on microprocessor design teams at Intel and HP. John also spent several years designing UNIX software for high-speed printing applications. As a graduate teaching assistant at Stanford University, John taught classes relating to software algorithms, compilers, networking, distributed software, C++, and web site design, and gained valuable experience teaching technical concepts to non-technical audiences. John’s technical experience and legal background enable him to provide uniquely insightful technical opinions and comprehensive patent analyses which are highly respected throughout the industry. John is an inventor on 15 US patents, with 24 additional applications pending. Specialties:Patent analysis, claim-charting, valuation, reverse engineering, validity research, litigation support, computer hardware, computer software, computer architecture, microprocessors, digital circuits, gaming, 3D graphics, operating systems, databases, user interfaces, printer software, iPhone software applications Experience President John Maly & Associates, Inc. 2005  – Present (10 years) Provide intellectual property consulting services to technology companies and law firms worldwide. Utilize extensive knowledge and expertise in IP and technical fields to deliver high quality solutions for a wide variety of clients. Services include patent and technology analysis, offensive and defensive claim charting, technical opinions, reverse engineering, network traffic analysis, digital discovery, expert witnesses, and IP portfolio valuation, strategy, and marketing. Patent Agent Merchant & Gould February 2004  –  July 2005  (1 year 6 months) Drafted and prosecuted technical patent applications for Fortune 100 clients. Conducted technical and legal research and review in support of litigation matters, and draft infringement memos. Consulted with clients regarding technical aspects of prosecution and litigation. Drafted technical opinions and responses to Patent Office Actions. Communicated with Patent Examiners regarding pending applications. Managed outside technical experts. Hardware Engineer Hewlett Packard 2000  –  2004  (4 years) Detected and characterized bugs in microprocessor design. Designed and implemented Random Code Generator for microcontroller. Designed memory agent checker for new point-to-point bus interface memory agent. Upgraded processor initializers for next generation processor architecture. Created regression suite to monitor design quality. Drove process to improve design and verification process quality resulting in significantly increased model quality and decreased regression times by more than 60%. Graduate Teaching Assistant Stanford University June 1999  –  December 2000  (1 year 7 months) Presented lectures, conducted review sessions, and graded assignments for classes relating to software algorithms, compilers, networking, distributed software, C++, and web site design. Gained experience teaching technical concepts to both technical and non-technical audiences. Class sizes ranged from 50 to 250 students. Graduate Technical Intern Intel May 2000  –  September 2000  (5 months) Performed pre-silicon design verification for multithreading technology on Pentium IV and follow-on chips. Designed and developed an automated random x86 architectural state test generator to support multi-processor testing. Conducted full-chip debug of RTL simulation. Co-Op Entire, Inc. June 1996  –  June 1998  (2 years 1 month) Designed and debugged C++ and interactive shell code for high-speed printer image transport software and X Window System graphical interface. Performed package creation, installation, and documentation in Solaris. Used GUI toolkits to design and modify OpenWindows applications. Gained experience with Sun SPARC hardware and Xerox 4000-series printers. Intern Kraft General Foods June 1993  –  September 1993  (4 months) Responsible for technical support, including PC repair and upgrade. Wrote hardware and software installation manuals. Successfully debugged gateway connecting two company sites. Frequent use of TCP/IP software, UNIX, and mainframes. Promoted to Corporate Headquarters position; assigned special project to track worldwide plant incidents. Owner Custom PC Solutions January 1991  –  September 1993  (2 years 9 months) Owned and operated small business providing services such as PC assembly/sales, repair, upgrade, troubleshooting, consulting, and training. President John Maly & Associates, Inc. 2005  – Present (10 years) Provide intellectual property consulting services to technology companies and law firms worldwide. Utilize extensive knowledge and expertise in IP and technical fields to deliver high quality solutions for a wide variety of clients. Services include patent and technology analysis, offensive and defensive claim charting, technical opinions, reverse engineering, network traffic analysis, digital discovery, expert witnesses, and IP portfolio valuation, strategy, and marketing. President John Maly & Associates, Inc. 2005  – Present (10 years) Provide intellectual property consulting services to technology companies and law firms worldwide. Utilize extensive knowledge and expertise in IP and technical fields to deliver high quality solutions for a wide variety of clients. Services include patent and technology analysis, offensive and defensive claim charting, technical opinions, reverse engineering, network traffic analysis, digital discovery, expert witnesses, and IP portfolio valuation, strategy, and marketing. Patent Agent Merchant & Gould February 2004  –  July 2005  (1 year 6 months) Drafted and prosecuted technical patent applications for Fortune 100 clients. Conducted technical and legal research and review in support of litigation matters, and draft infringement memos. Consulted with clients regarding technical aspects of prosecution and litigation. Drafted technical opinions and responses to Patent Office Actions. Communicated with Patent Examiners regarding pending applications. Managed outside technical experts. Patent Agent Merchant & Gould February 2004  –  July 2005  (1 year 6 months) Drafted and prosecuted technical patent applications for Fortune 100 clients. Conducted technical and legal research and review in support of litigation matters, and draft infringement memos. Consulted with clients regarding technical aspects of prosecution and litigation. Drafted technical opinions and responses to Patent Office Actions. Communicated with Patent Examiners regarding pending applications. Managed outside technical experts. Hardware Engineer Hewlett Packard 2000  –  2004  (4 years) Detected and characterized bugs in microprocessor design. Designed and implemented Random Code Generator for microcontroller. Designed memory agent checker for new point-to-point bus interface memory agent. Upgraded processor initializers for next generation processor architecture. Created regression suite to monitor design quality. Drove process to improve design and verification process quality resulting in significantly increased model quality and decreased regression times by more than 60%. Hardware Engineer Hewlett Packard 2000  –  2004  (4 years) Detected and characterized bugs in microprocessor design. Designed and implemented Random Code Generator for microcontroller. Designed memory agent checker for new point-to-point bus interface memory agent. Upgraded processor initializers for next generation processor architecture. Created regression suite to monitor design quality. Drove process to improve design and verification process quality resulting in significantly increased model quality and decreased regression times by more than 60%. Graduate Teaching Assistant Stanford University June 1999  –  December 2000  (1 year 7 months) Presented lectures, conducted review sessions, and graded assignments for classes relating to software algorithms, compilers, networking, distributed software, C++, and web site design. Gained experience teaching technical concepts to both technical and non-technical audiences. Class sizes ranged from 50 to 250 students. Graduate Teaching Assistant Stanford University June 1999  –  December 2000  (1 year 7 months) Presented lectures, conducted review sessions, and graded assignments for classes relating to software algorithms, compilers, networking, distributed software, C++, and web site design. Gained experience teaching technical concepts to both technical and non-technical audiences. Class sizes ranged from 50 to 250 students. Graduate Technical Intern Intel May 2000  –  September 2000  (5 months) Performed pre-silicon design verification for multithreading technology on Pentium IV and follow-on chips. Designed and developed an automated random x86 architectural state test generator to support multi-processor testing. Conducted full-chip debug of RTL simulation. Graduate Technical Intern Intel May 2000  –  September 2000  (5 months) Performed pre-silicon design verification for multithreading technology on Pentium IV and follow-on chips. Designed and developed an automated random x86 architectural state test generator to support multi-processor testing. Conducted full-chip debug of RTL simulation. Co-Op Entire, Inc. June 1996  –  June 1998  (2 years 1 month) Designed and debugged C++ and interactive shell code for high-speed printer image transport software and X Window System graphical interface. Performed package creation, installation, and documentation in Solaris. Used GUI toolkits to design and modify OpenWindows applications. Gained experience with Sun SPARC hardware and Xerox 4000-series printers. Co-Op Entire, Inc. June 1996  –  June 1998  (2 years 1 month) Designed and debugged C++ and interactive shell code for high-speed printer image transport software and X Window System graphical interface. Performed package creation, installation, and documentation in Solaris. Used GUI toolkits to design and modify OpenWindows applications. Gained experience with Sun SPARC hardware and Xerox 4000-series printers. Intern Kraft General Foods June 1993  –  September 1993  (4 months) Responsible for technical support, including PC repair and upgrade. Wrote hardware and software installation manuals. Successfully debugged gateway connecting two company sites. Frequent use of TCP/IP software, UNIX, and mainframes. Promoted to Corporate Headquarters position; assigned special project to track worldwide plant incidents. Intern Kraft General Foods June 1993  –  September 1993  (4 months) Responsible for technical support, including PC repair and upgrade. Wrote hardware and software installation manuals. Successfully debugged gateway connecting two company sites. Frequent use of TCP/IP software, UNIX, and mainframes. Promoted to Corporate Headquarters position; assigned special project to track worldwide plant incidents. Owner Custom PC Solutions January 1991  –  September 1993  (2 years 9 months) Owned and operated small business providing services such as PC assembly/sales, repair, upgrade, troubleshooting, consulting, and training. Owner Custom PC Solutions January 1991  –  September 1993  (2 years 9 months) Owned and operated small business providing services such as PC assembly/sales, repair, upgrade, troubleshooting, consulting, and training. Languages English Native or bilingual proficiency Czech Elementary proficiency French Elementary proficiency Lithuanian Elementary proficiency Russian Elementary proficiency English Native or bilingual proficiency Czech Elementary proficiency French Elementary proficiency Lithuanian Elementary proficiency Russian Elementary proficiency English Native or bilingual proficiency Czech Elementary proficiency French Elementary proficiency Lithuanian Elementary proficiency Russian Elementary proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Elementary proficiency Elementary proficiency Skills Patents Intellectual Property Licensing Patent Litigation Patent Prosecution Legal Research IP Software Development Litigation Strategy Litigation Support Software Patents Intellectual Property... Invention Reverse Engineering Patent Portfolio Mining Expert Witness Patent Validity Research Patent Licensing Computer Architecture Microprocessor Patents Patent Analysis Computer Hardware... Patent Valuation Patent Strategy Patent Litigation... Claim Charting Intellectual Property... Patent Claim Analysis Emerging Technologies Patent Research Patent Invalidity... Evidence of Use Operating System Patents Database Patents API Patents Computer Game Patents Digital Circuit Patents 3D Graphics Patents E-commerce Patents Social Networking... Game Console Patents Semiconductor Patents Chipset Patents Image Processing Patents Artificial Intelligence... Smartphone Patents Smartphone Application... Network Traffic Analysis Patent Portfolio... See 35+     See less Skills  Patents Intellectual Property Licensing Patent Litigation Patent Prosecution Legal Research IP Software Development Litigation Strategy Litigation Support Software Patents Intellectual Property... Invention Reverse Engineering Patent Portfolio Mining Expert Witness Patent Validity Research Patent Licensing Computer Architecture Microprocessor Patents Patent Analysis Computer Hardware... Patent Valuation Patent Strategy Patent Litigation... Claim Charting Intellectual Property... Patent Claim Analysis Emerging Technologies Patent Research Patent Invalidity... Evidence of Use Operating System Patents Database Patents API Patents Computer Game Patents Digital Circuit Patents 3D Graphics Patents E-commerce Patents Social Networking... Game Console Patents Semiconductor Patents Chipset Patents Image Processing Patents Artificial Intelligence... Smartphone Patents Smartphone Application... Network Traffic Analysis Patent Portfolio... See 35+     See less Patents Intellectual Property Licensing Patent Litigation Patent Prosecution Legal Research IP Software Development Litigation Strategy Litigation Support Software Patents Intellectual Property... Invention Reverse Engineering Patent Portfolio Mining Expert Witness Patent Validity Research Patent Licensing Computer Architecture Microprocessor Patents Patent Analysis Computer Hardware... Patent Valuation Patent Strategy Patent Litigation... Claim Charting Intellectual Property... Patent Claim Analysis Emerging Technologies Patent Research Patent Invalidity... Evidence of Use Operating System Patents Database Patents API Patents Computer Game Patents Digital Circuit Patents 3D Graphics Patents E-commerce Patents Social Networking... Game Console Patents Semiconductor Patents Chipset Patents Image Processing Patents Artificial Intelligence... Smartphone Patents Smartphone Application... Network Traffic Analysis Patent Portfolio... See 35+     See less Patents Intellectual Property Licensing Patent Litigation Patent Prosecution Legal Research IP Software Development Litigation Strategy Litigation Support Software Patents Intellectual Property... Invention Reverse Engineering Patent Portfolio Mining Expert Witness Patent Validity Research Patent Licensing Computer Architecture Microprocessor Patents Patent Analysis Computer Hardware... Patent Valuation Patent Strategy Patent Litigation... Claim Charting Intellectual Property... Patent Claim Analysis Emerging Technologies Patent Research Patent Invalidity... Evidence of Use Operating System Patents Database Patents API Patents Computer Game Patents Digital Circuit Patents 3D Graphics Patents E-commerce Patents Social Networking... Game Console Patents Semiconductor Patents Chipset Patents Image Processing Patents Artificial Intelligence... Smartphone Patents Smartphone Application... Network Traffic Analysis Patent Portfolio... See 35+     See less Education Stanford University Certificate Program,  Novel Writing 2011  – 2014 University of Denver - Sturm College of Law JD,  Law 2004  – 2008 Stanford University MS,  Computer Science 1999  – 2000 Activities and Societies:  Teaching Assistant (taught software algorithms ,  compilers ,  networking ,  distributed software design ,  C++ ,  and web site design courses) Syracuse University BS,  Computer Engineering 1993  – 1999 Graduated magna cum laude, with honors \nHonors thesis topic: Simulation and performance comparison of distributed processing system topologies Activities and Societies:  IEEE ,  Tau Beta Pi ,  Eta Kappa Nu Syracuse University BA,  Psychology 1993  – 1999 Minor in mathematics Stanford University Certificate Program,  Novel Writing 2011  – 2014 Stanford University Certificate Program,  Novel Writing 2011  – 2014 Stanford University Certificate Program,  Novel Writing 2011  – 2014 University of Denver - Sturm College of Law JD,  Law 2004  – 2008 University of Denver - Sturm College of Law JD,  Law 2004  – 2008 University of Denver - Sturm College of Law JD,  Law 2004  – 2008 Stanford University MS,  Computer Science 1999  – 2000 Activities and Societies:  Teaching Assistant (taught software algorithms ,  compilers ,  networking ,  distributed software design ,  C++ ,  and web site design courses) Stanford University MS,  Computer Science 1999  – 2000 Activities and Societies:  Teaching Assistant (taught software algorithms ,  compilers ,  networking ,  distributed software design ,  C++ ,  and web site design courses) Stanford University MS,  Computer Science 1999  – 2000 Activities and Societies:  Teaching Assistant (taught software algorithms ,  compilers ,  networking ,  distributed software design ,  C++ ,  and web site design courses) Syracuse University BS,  Computer Engineering 1993  – 1999 Graduated magna cum laude, with honors \nHonors thesis topic: Simulation and performance comparison of distributed processing system topologies Activities and Societies:  IEEE ,  Tau Beta Pi ,  Eta Kappa Nu Syracuse University BS,  Computer Engineering 1993  – 1999 Graduated magna cum laude, with honors \nHonors thesis topic: Simulation and performance comparison of distributed processing system topologies Activities and Societies:  IEEE ,  Tau Beta Pi ,  Eta Kappa Nu Syracuse University BS,  Computer Engineering 1993  – 1999 Graduated magna cum laude, with honors \nHonors thesis topic: Simulation and performance comparison of distributed processing system topologies Activities and Societies:  IEEE ,  Tau Beta Pi ,  Eta Kappa Nu Syracuse University BA,  Psychology 1993  – 1999 Minor in mathematics Syracuse University BA,  Psychology 1993  – 1999 Minor in mathematics Syracuse University BA,  Psychology 1993  – 1999 Minor in mathematics Honors & Awards Additional Honors & Awards PADI-certified Divemaster \nNRA-certified Rifle Instructor, Pistol Instructor, Shotgun Instructor, and Home Firearms Safety Instructor \niPhone application developer Additional Honors & Awards PADI-certified Divemaster \nNRA-certified Rifle Instructor, Pistol Instructor, Shotgun Instructor, and Home Firearms Safety Instructor \niPhone application developer Additional Honors & Awards PADI-certified Divemaster \nNRA-certified Rifle Instructor, Pistol Instructor, Shotgun Instructor, and Home Firearms Safety Instructor \niPhone application developer Additional Honors & Awards PADI-certified Divemaster \nNRA-certified Rifle Instructor, Pistol Instructor, Shotgun Instructor, and Home Firearms Safety Instructor \niPhone application developer ", "Experience Graduate Teaching Assistant Stanford University September 2014  –  December 2014  (4 months) Project Engineer Intern WEBCOR Builders July 2014  –  September 2014  (3 months) San Francisco Bay Area Summer Analyst Goldman Sachs January 2013  –  June 2013  (6 months) Bengaluru Area, India Graduate Teaching Assistant Stanford University September 2014  –  December 2014  (4 months) Graduate Teaching Assistant Stanford University September 2014  –  December 2014  (4 months) Project Engineer Intern WEBCOR Builders July 2014  –  September 2014  (3 months) San Francisco Bay Area Project Engineer Intern WEBCOR Builders July 2014  –  September 2014  (3 months) San Francisco Bay Area Summer Analyst Goldman Sachs January 2013  –  June 2013  (6 months) Bengaluru Area, India Summer Analyst Goldman Sachs January 2013  –  June 2013  (6 months) Bengaluru Area, India Languages Telugu Native or bilingual proficiency Hindi Professional working proficiency English Native or bilingual proficiency Telugu Native or bilingual proficiency Hindi Professional working proficiency English Native or bilingual proficiency Telugu Native or bilingual proficiency Hindi Professional working proficiency English Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Skills     Honors & Awards ASCE 2015 Student Essay Scholarship Award American Society of Civil Engineers (ASCE) April 2015 CMAA NorCal Chapter 2015 Scholarship Award Construction Management Association of America (CMAA) May 2015 ASCE 2015 Student Essay Scholarship Award American Society of Civil Engineers (ASCE) April 2015 ASCE 2015 Student Essay Scholarship Award American Society of Civil Engineers (ASCE) April 2015 ASCE 2015 Student Essay Scholarship Award American Society of Civil Engineers (ASCE) April 2015 CMAA NorCal Chapter 2015 Scholarship Award Construction Management Association of America (CMAA) May 2015 CMAA NorCal Chapter 2015 Scholarship Award Construction Management Association of America (CMAA) May 2015 CMAA NorCal Chapter 2015 Scholarship Award Construction Management Association of America (CMAA) May 2015 ", "Experience User Experience Researcher Bosch Research and Technology Center North America September 2014  – Present (1 year) Pal Alto, CA Responsible for: \n \n-\tconducting user experience research for self-driving vehicles and collaborating with leading academic institutes  \n- collecting and analyzing user behavior through surveys, lab studies and controlled lab experiments  \n-\tdeveloping and testing user experience, Human-Machine Interface concepts for self-driving cars as shown in the video below \n-\tcreating user experience guidelines and principles for Bosch self-driving vehicles \n-\trepresenting Bosch for response to the upcoming task order on the Naturalistic Study for Level 2 Automated Vehicle Functions \n User Experience Researcher Bosch Research and Technology Center North America September 2014  – Present (1 year) Pal Alto, CA Responsible for: \n \n-\tconducting user experience research for self-driving vehicles and collaborating with leading academic institutes  \n- collecting and analyzing user behavior through surveys, lab studies and controlled lab experiments  \n-\tdeveloping and testing user experience, Human-Machine Interface concepts for self-driving cars as shown in the video below \n-\tcreating user experience guidelines and principles for Bosch self-driving vehicles \n-\trepresenting Bosch for response to the upcoming task order on the Naturalistic Study for Level 2 Automated Vehicle Functions \n User Experience Researcher Bosch Research and Technology Center North America September 2014  – Present (1 year) Pal Alto, CA Responsible for: \n \n-\tconducting user experience research for self-driving vehicles and collaborating with leading academic institutes  \n- collecting and analyzing user behavior through surveys, lab studies and controlled lab experiments  \n-\tdeveloping and testing user experience, Human-Machine Interface concepts for self-driving cars as shown in the video below \n-\tcreating user experience guidelines and principles for Bosch self-driving vehicles \n-\trepresenting Bosch for response to the upcoming task order on the Naturalistic Study for Level 2 Automated Vehicle Functions \n Languages   Skills Human Computer... Questionnaire Design Research Design Psychology User Experience Testing Data Analysis Quantitative Data R SPSS Skills  Human Computer... Questionnaire Design Research Design Psychology User Experience Testing Data Analysis Quantitative Data R SPSS Human Computer... Questionnaire Design Research Design Psychology User Experience Testing Data Analysis Quantitative Data R SPSS Human Computer... Questionnaire Design Research Design Psychology User Experience Testing Data Analysis Quantitative Data R SPSS Education Stanford University Doctor of Philosophy (Ph.D.),  Communication (Human-Computer Interaction) ,  Ph.D. Minor in Psychology 2008  – 2014 University of California, Davis Master's Degree,  Communication 2006  – 2008 Ewha Womans University Bachelor of Arts (BA),  Media Studies 1999  – 2004 Stanford University Doctor of Philosophy (Ph.D.),  Communication (Human-Computer Interaction) ,  Ph.D. Minor in Psychology 2008  – 2014 Stanford University Doctor of Philosophy (Ph.D.),  Communication (Human-Computer Interaction) ,  Ph.D. Minor in Psychology 2008  – 2014 Stanford University Doctor of Philosophy (Ph.D.),  Communication (Human-Computer Interaction) ,  Ph.D. Minor in Psychology 2008  – 2014 University of California, Davis Master's Degree,  Communication 2006  – 2008 University of California, Davis Master's Degree,  Communication 2006  – 2008 University of California, Davis Master's Degree,  Communication 2006  – 2008 Ewha Womans University Bachelor of Arts (BA),  Media Studies 1999  – 2004 Ewha Womans University Bachelor of Arts (BA),  Media Studies 1999  – 2004 Ewha Womans University Bachelor of Arts (BA),  Media Studies 1999  – 2004 Honors & Awards ", "Summary Experienced R&D manager, award-winning inventor, and optical engineer. Founded Kinetic River Corp., a research and product development company with a passion for creating and enabling tools for innovative and disruptive life science research, biomedical instrumentation, and clinical diagnostics. \n \nSpecialties: biophotonics, biosensors, cell analysis, concept development, data analysis, design, due diligence, flow cytometry, fluorescence, hematology, intellectual property, in vitro diagnostics, LabVIEW, lasers, light scattering, lightwave, medical devices, modeling, new product development, optics, physics, programming, project management, project planning, prototyping, research, simulation, system engineering Summary Experienced R&D manager, award-winning inventor, and optical engineer. Founded Kinetic River Corp., a research and product development company with a passion for creating and enabling tools for innovative and disruptive life science research, biomedical instrumentation, and clinical diagnostics. \n \nSpecialties: biophotonics, biosensors, cell analysis, concept development, data analysis, design, due diligence, flow cytometry, fluorescence, hematology, intellectual property, in vitro diagnostics, LabVIEW, lasers, light scattering, lightwave, medical devices, modeling, new product development, optics, physics, programming, project management, project planning, prototyping, research, simulation, system engineering Experienced R&D manager, award-winning inventor, and optical engineer. Founded Kinetic River Corp., a research and product development company with a passion for creating and enabling tools for innovative and disruptive life science research, biomedical instrumentation, and clinical diagnostics. \n \nSpecialties: biophotonics, biosensors, cell analysis, concept development, data analysis, design, due diligence, flow cytometry, fluorescence, hematology, intellectual property, in vitro diagnostics, LabVIEW, lasers, light scattering, lightwave, medical devices, modeling, new product development, optics, physics, programming, project management, project planning, prototyping, research, simulation, system engineering Experienced R&D manager, award-winning inventor, and optical engineer. Founded Kinetic River Corp., a research and product development company with a passion for creating and enabling tools for innovative and disruptive life science research, biomedical instrumentation, and clinical diagnostics. \n \nSpecialties: biophotonics, biosensors, cell analysis, concept development, data analysis, design, due diligence, flow cytometry, fluorescence, hematology, intellectual property, in vitro diagnostics, LabVIEW, lasers, light scattering, lightwave, medical devices, modeling, new product development, optics, physics, programming, project management, project planning, prototyping, research, simulation, system engineering Experience Founder & President Kinetic River Corp. 2010  – Present (5 years) San Jose, CA * Technical consulting in applications of optics, microfluidics, and system modeling \n* Intellectual property consulting, prior art searching, competitive landscaping \n* Application areas: life science research, biomedical research, medical devices, medical diagnostics Volwiler Research Fellow Abbott Laboratories 2010  –  2011  (1 year) * Organized and hosted IP harvesting workshop leading to 130 new disclosures in strategic flow cytometry areas \n* Successfully completed multi-year research & feasibility program for breakthrough hematology platform Intellectual Property Manager Abbott Laboratories 2007  –  2011  (4 years) * Responsible for managing hematology IP portfolio (disclosures, patent applications, nationalization, and abandonment) \n* Held IP training session, implemented IP tracking metrics, and substantially increased site disclosures and applications \n* Hematology business unit representative on Diagnostics Division-wide Patent Governance Board R&D Program Manager Abbott Laboratories March 2005  –  2011  (6 years) * Responsible for early-stage R&D and feasibility of next-generation hematology analyzers \n* Managed engineering group of 15 direct reports and an $XM budget for R&D and product support projects \n* Invented novel optical technique for hematology and flow cytometry, demonstrated principle, and led project through feasibility with working prototype \n* Developed interactive simulation platforms to model operation of on-market hematology analyzers, and to explore virtual models of proposed architectures \n* Participated in launch and major upgrade of CELL-DYN Ruby analyzer and five major upgrades to the CELL-DYN Sapphire analyzer with feasibility, integration, and testing \n* Supported two 510(k) class-II medical device submissions to the FDA with data analysis and feasibility reports \n* Coordinated response to field actions on CELL-DYN products, from root cause investigation to issue resolution \n* Carried out technical due diligence on four companies for prospective licensing and acquisition transactions \n* Created and championed adoption of resource tracking tools for project planning and execution Product Marketing Manager Picarro, Inc. January 2004  –  March 2005  (1 year 3 months) * Responsible for company's largest revenue-producing product line \n* Identified new applications, market segments, and potential customers, quantified business opportunities and developed new business \n* Created detailed new product specifications to address largest market opportunities  \n* Resolved service and applications issues at customer sites, managed integration issues, and trained customers' staff of field service engineers \n* Directed information exchange between customers, sales, R&D, engineering, and manufacturing \n* Tracked book/ship/backlog and prioritized shipments for manufacturing, managed inventory and schedule of demonstration units, and wrote and presented marketing material \nto customers Project Leader and Optical Engineer Picarro, Inc. September 2002  –  December 2003  (1 year 4 months) * Headed project to develop narrow-linewidth infrared lasers for spectroscopy applications \n* Led team of 6 people in new product development program, from proof-of-concept demonstrations through on-time and under-budget delivery of alpha prototypes \n* Invented and demonstrated optical designs geared for manufacturing stable, widely tunable lasers  \n* Invented and developed signal processing tools used to increase manufacturing yield  \n* Developed and built visible and infrared laser prototypes based on novel architectures Design Physicist Lightwave Microsystems Corp. April 2000  –  September 2002  (2 years 6 months) * Invented microfluidic technology and developed prototypes for use in planar lightwave circuits (PLCs) \n* Designed and established new laboratory for research and development in microfluidics and optics \n* Led team for development of novel PLCs based on microfluidics  \n* Designed dynamic PLCs based on silica optical waveguides \n* Developed interactive optical modeling tools used to predict the optical performance of PLCs \n* Analyzed data on the optical performance of PLCs in order to optimize fabrication processes Graduate Research Assistant Stanford University September 1994  –  September 2001  (7 years 1 month) * Invented ultrafast light scattering technique to probe microscopic fluid dynamics \n* Built laboratory for laser-based research on ultrafast phenomena in fluid dynamics \n* Planned, organized, and conducted experiments and computer simulations, analyzed data, and wrote technical reports for publication \n* Trained undergraduates and directed theoretical and experimental student research projects  \n* Wrote grant proposals to obtain funding for research in ultrafast optics and fluid dynamics Graduate Teaching Assistant Stanford University September 1996  –  June 1999  (2 years 10 months) * Led discussion and laboratory sessions, held office hours, and graded assignments for advanced physics laboratory courses and introductory physics classes Associate Physicist Exxon Research and Engineering Company September 1991  –  July 1994  (2 years 11 months) * Conducted x-ray scattering experiments to characterize complex fluids, thin films, and composite materials \n* Designed and constructed experimental equipment to study multiphase flow in porous media \n* Maintained and repaired x-ray equipment used in analytical studies and product development research Undergraduate Research Assistant Harvard University June 1990  –  September 1990  (4 months) * Investigated atomic transport processes in silicon using differential scanning Founder & President Kinetic River Corp. 2010  – Present (5 years) San Jose, CA * Technical consulting in applications of optics, microfluidics, and system modeling \n* Intellectual property consulting, prior art searching, competitive landscaping \n* Application areas: life science research, biomedical research, medical devices, medical diagnostics Founder & President Kinetic River Corp. 2010  – Present (5 years) San Jose, CA * Technical consulting in applications of optics, microfluidics, and system modeling \n* Intellectual property consulting, prior art searching, competitive landscaping \n* Application areas: life science research, biomedical research, medical devices, medical diagnostics Volwiler Research Fellow Abbott Laboratories 2010  –  2011  (1 year) * Organized and hosted IP harvesting workshop leading to 130 new disclosures in strategic flow cytometry areas \n* Successfully completed multi-year research & feasibility program for breakthrough hematology platform Volwiler Research Fellow Abbott Laboratories 2010  –  2011  (1 year) * Organized and hosted IP harvesting workshop leading to 130 new disclosures in strategic flow cytometry areas \n* Successfully completed multi-year research & feasibility program for breakthrough hematology platform Intellectual Property Manager Abbott Laboratories 2007  –  2011  (4 years) * Responsible for managing hematology IP portfolio (disclosures, patent applications, nationalization, and abandonment) \n* Held IP training session, implemented IP tracking metrics, and substantially increased site disclosures and applications \n* Hematology business unit representative on Diagnostics Division-wide Patent Governance Board Intellectual Property Manager Abbott Laboratories 2007  –  2011  (4 years) * Responsible for managing hematology IP portfolio (disclosures, patent applications, nationalization, and abandonment) \n* Held IP training session, implemented IP tracking metrics, and substantially increased site disclosures and applications \n* Hematology business unit representative on Diagnostics Division-wide Patent Governance Board R&D Program Manager Abbott Laboratories March 2005  –  2011  (6 years) * Responsible for early-stage R&D and feasibility of next-generation hematology analyzers \n* Managed engineering group of 15 direct reports and an $XM budget for R&D and product support projects \n* Invented novel optical technique for hematology and flow cytometry, demonstrated principle, and led project through feasibility with working prototype \n* Developed interactive simulation platforms to model operation of on-market hematology analyzers, and to explore virtual models of proposed architectures \n* Participated in launch and major upgrade of CELL-DYN Ruby analyzer and five major upgrades to the CELL-DYN Sapphire analyzer with feasibility, integration, and testing \n* Supported two 510(k) class-II medical device submissions to the FDA with data analysis and feasibility reports \n* Coordinated response to field actions on CELL-DYN products, from root cause investigation to issue resolution \n* Carried out technical due diligence on four companies for prospective licensing and acquisition transactions \n* Created and championed adoption of resource tracking tools for project planning and execution R&D Program Manager Abbott Laboratories March 2005  –  2011  (6 years) * Responsible for early-stage R&D and feasibility of next-generation hematology analyzers \n* Managed engineering group of 15 direct reports and an $XM budget for R&D and product support projects \n* Invented novel optical technique for hematology and flow cytometry, demonstrated principle, and led project through feasibility with working prototype \n* Developed interactive simulation platforms to model operation of on-market hematology analyzers, and to explore virtual models of proposed architectures \n* Participated in launch and major upgrade of CELL-DYN Ruby analyzer and five major upgrades to the CELL-DYN Sapphire analyzer with feasibility, integration, and testing \n* Supported two 510(k) class-II medical device submissions to the FDA with data analysis and feasibility reports \n* Coordinated response to field actions on CELL-DYN products, from root cause investigation to issue resolution \n* Carried out technical due diligence on four companies for prospective licensing and acquisition transactions \n* Created and championed adoption of resource tracking tools for project planning and execution Product Marketing Manager Picarro, Inc. January 2004  –  March 2005  (1 year 3 months) * Responsible for company's largest revenue-producing product line \n* Identified new applications, market segments, and potential customers, quantified business opportunities and developed new business \n* Created detailed new product specifications to address largest market opportunities  \n* Resolved service and applications issues at customer sites, managed integration issues, and trained customers' staff of field service engineers \n* Directed information exchange between customers, sales, R&D, engineering, and manufacturing \n* Tracked book/ship/backlog and prioritized shipments for manufacturing, managed inventory and schedule of demonstration units, and wrote and presented marketing material \nto customers Product Marketing Manager Picarro, Inc. January 2004  –  March 2005  (1 year 3 months) * Responsible for company's largest revenue-producing product line \n* Identified new applications, market segments, and potential customers, quantified business opportunities and developed new business \n* Created detailed new product specifications to address largest market opportunities  \n* Resolved service and applications issues at customer sites, managed integration issues, and trained customers' staff of field service engineers \n* Directed information exchange between customers, sales, R&D, engineering, and manufacturing \n* Tracked book/ship/backlog and prioritized shipments for manufacturing, managed inventory and schedule of demonstration units, and wrote and presented marketing material \nto customers Project Leader and Optical Engineer Picarro, Inc. September 2002  –  December 2003  (1 year 4 months) * Headed project to develop narrow-linewidth infrared lasers for spectroscopy applications \n* Led team of 6 people in new product development program, from proof-of-concept demonstrations through on-time and under-budget delivery of alpha prototypes \n* Invented and demonstrated optical designs geared for manufacturing stable, widely tunable lasers  \n* Invented and developed signal processing tools used to increase manufacturing yield  \n* Developed and built visible and infrared laser prototypes based on novel architectures Project Leader and Optical Engineer Picarro, Inc. September 2002  –  December 2003  (1 year 4 months) * Headed project to develop narrow-linewidth infrared lasers for spectroscopy applications \n* Led team of 6 people in new product development program, from proof-of-concept demonstrations through on-time and under-budget delivery of alpha prototypes \n* Invented and demonstrated optical designs geared for manufacturing stable, widely tunable lasers  \n* Invented and developed signal processing tools used to increase manufacturing yield  \n* Developed and built visible and infrared laser prototypes based on novel architectures Design Physicist Lightwave Microsystems Corp. April 2000  –  September 2002  (2 years 6 months) * Invented microfluidic technology and developed prototypes for use in planar lightwave circuits (PLCs) \n* Designed and established new laboratory for research and development in microfluidics and optics \n* Led team for development of novel PLCs based on microfluidics  \n* Designed dynamic PLCs based on silica optical waveguides \n* Developed interactive optical modeling tools used to predict the optical performance of PLCs \n* Analyzed data on the optical performance of PLCs in order to optimize fabrication processes Design Physicist Lightwave Microsystems Corp. April 2000  –  September 2002  (2 years 6 months) * Invented microfluidic technology and developed prototypes for use in planar lightwave circuits (PLCs) \n* Designed and established new laboratory for research and development in microfluidics and optics \n* Led team for development of novel PLCs based on microfluidics  \n* Designed dynamic PLCs based on silica optical waveguides \n* Developed interactive optical modeling tools used to predict the optical performance of PLCs \n* Analyzed data on the optical performance of PLCs in order to optimize fabrication processes Graduate Research Assistant Stanford University September 1994  –  September 2001  (7 years 1 month) * Invented ultrafast light scattering technique to probe microscopic fluid dynamics \n* Built laboratory for laser-based research on ultrafast phenomena in fluid dynamics \n* Planned, organized, and conducted experiments and computer simulations, analyzed data, and wrote technical reports for publication \n* Trained undergraduates and directed theoretical and experimental student research projects  \n* Wrote grant proposals to obtain funding for research in ultrafast optics and fluid dynamics Graduate Research Assistant Stanford University September 1994  –  September 2001  (7 years 1 month) * Invented ultrafast light scattering technique to probe microscopic fluid dynamics \n* Built laboratory for laser-based research on ultrafast phenomena in fluid dynamics \n* Planned, organized, and conducted experiments and computer simulations, analyzed data, and wrote technical reports for publication \n* Trained undergraduates and directed theoretical and experimental student research projects  \n* Wrote grant proposals to obtain funding for research in ultrafast optics and fluid dynamics Graduate Teaching Assistant Stanford University September 1996  –  June 1999  (2 years 10 months) * Led discussion and laboratory sessions, held office hours, and graded assignments for advanced physics laboratory courses and introductory physics classes Graduate Teaching Assistant Stanford University September 1996  –  June 1999  (2 years 10 months) * Led discussion and laboratory sessions, held office hours, and graded assignments for advanced physics laboratory courses and introductory physics classes Associate Physicist Exxon Research and Engineering Company September 1991  –  July 1994  (2 years 11 months) * Conducted x-ray scattering experiments to characterize complex fluids, thin films, and composite materials \n* Designed and constructed experimental equipment to study multiphase flow in porous media \n* Maintained and repaired x-ray equipment used in analytical studies and product development research Associate Physicist Exxon Research and Engineering Company September 1991  –  July 1994  (2 years 11 months) * Conducted x-ray scattering experiments to characterize complex fluids, thin films, and composite materials \n* Designed and constructed experimental equipment to study multiphase flow in porous media \n* Maintained and repaired x-ray equipment used in analytical studies and product development research Undergraduate Research Assistant Harvard University June 1990  –  September 1990  (4 months) * Investigated atomic transport processes in silicon using differential scanning Undergraduate Research Assistant Harvard University June 1990  –  September 1990  (4 months) * Investigated atomic transport processes in silicon using differential scanning Languages English Native or bilingual proficiency Italian Native or bilingual proficiency Spanish Limited working proficiency French Limited working proficiency Chinese Elementary proficiency German Elementary proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency Spanish Limited working proficiency French Limited working proficiency Chinese Elementary proficiency German Elementary proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency Spanish Limited working proficiency French Limited working proficiency Chinese Elementary proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Elementary proficiency Elementary proficiency Skills Optics Product Development Medical Devices Labview Research Physics Diagnostics Data Analysis Due Diligence Modeling Hematology Flow Cytometry R&D Patents Life Sciences Engineering Competitive Analysis Systems Engineering Intellectual Property Laser Simulations Hardware Diagnostics Lifesciences ISO 13485 Chemistry Spectroscopy Commercialization Strategy Biotechnology Technology Transfer Manufacturing Nanotechnology Experimentation Design of Experiments Cell FDA Signal Processing Testing Characterization Sensors Thin Films Product Marketing Semiconductors Laboratory Genomics Validation Drug Discovery Biosensors Microfluidics Immunology See 35+     See less Skills  Optics Product Development Medical Devices Labview Research Physics Diagnostics Data Analysis Due Diligence Modeling Hematology Flow Cytometry R&D Patents Life Sciences Engineering Competitive Analysis Systems Engineering Intellectual Property Laser Simulations Hardware Diagnostics Lifesciences ISO 13485 Chemistry Spectroscopy Commercialization Strategy Biotechnology Technology Transfer Manufacturing Nanotechnology Experimentation Design of Experiments Cell FDA Signal Processing Testing Characterization Sensors Thin Films Product Marketing Semiconductors Laboratory Genomics Validation Drug Discovery Biosensors Microfluidics Immunology See 35+     See less Optics Product Development Medical Devices Labview Research Physics Diagnostics Data Analysis Due Diligence Modeling Hematology Flow Cytometry R&D Patents Life Sciences Engineering Competitive Analysis Systems Engineering Intellectual Property Laser Simulations Hardware Diagnostics Lifesciences ISO 13485 Chemistry Spectroscopy Commercialization Strategy Biotechnology Technology Transfer Manufacturing Nanotechnology Experimentation Design of Experiments Cell FDA Signal Processing Testing Characterization Sensors Thin Films Product Marketing Semiconductors Laboratory Genomics Validation Drug Discovery Biosensors Microfluidics Immunology See 35+     See less Optics Product Development Medical Devices Labview Research Physics Diagnostics Data Analysis Due Diligence Modeling Hematology Flow Cytometry R&D Patents Life Sciences Engineering Competitive Analysis Systems Engineering Intellectual Property Laser Simulations Hardware Diagnostics Lifesciences ISO 13485 Chemistry Spectroscopy Commercialization Strategy Biotechnology Technology Transfer Manufacturing Nanotechnology Experimentation Design of Experiments Cell FDA Signal Processing Testing Characterization Sensors Thin Films Product Marketing Semiconductors Laboratory Genomics Validation Drug Discovery Biosensors Microfluidics Immunology See 35+     See less Education Stanford University Ph.D. 1994  – 2001 Harvard University M.A. 1990  – 1991 Harvard University B.A. 1987  – 1990 L. B. Pearson United World College International Baccalaureate 1985  – 1987 Stanford University Ph.D. 1994  – 2001 Stanford University Ph.D. 1994  – 2001 Stanford University Ph.D. 1994  – 2001 Harvard University M.A. 1990  – 1991 Harvard University M.A. 1990  – 1991 Harvard University M.A. 1990  – 1991 Harvard University B.A. 1987  – 1990 Harvard University B.A. 1987  – 1990 Harvard University B.A. 1987  – 1990 L. B. Pearson United World College International Baccalaureate 1985  – 1987 L. B. Pearson United World College International Baccalaureate 1985  – 1987 L. B. Pearson United World College International Baccalaureate 1985  – 1987 ", "Summary Accomplished writer, research scientist, and educator: \n \n15 years of technical writing experience \n25+ years of research experience and leadership in physics and astrophysics \nOver 50 research publications \nNine years of teaching experience \n \nTechnical writing and information architecture \nUndergraduate and graduate teaching \nPhysics/astrophysics (research/education) \nComputer systems and applications \nProficient in Spanish and French \n \nSpecialties: Technical authoring, electronic publishing, content management, mathematical modeling, theoretical and engineering physics, astrophysics. \n \nFor comprehensive scientific and academic accomplishments, publications, and background, see personal website: \n \nhttp://home.earthlink.net/~dckennedy/edwork.html Summary Accomplished writer, research scientist, and educator: \n \n15 years of technical writing experience \n25+ years of research experience and leadership in physics and astrophysics \nOver 50 research publications \nNine years of teaching experience \n \nTechnical writing and information architecture \nUndergraduate and graduate teaching \nPhysics/astrophysics (research/education) \nComputer systems and applications \nProficient in Spanish and French \n \nSpecialties: Technical authoring, electronic publishing, content management, mathematical modeling, theoretical and engineering physics, astrophysics. \n \nFor comprehensive scientific and academic accomplishments, publications, and background, see personal website: \n \nhttp://home.earthlink.net/~dckennedy/edwork.html Accomplished writer, research scientist, and educator: \n \n15 years of technical writing experience \n25+ years of research experience and leadership in physics and astrophysics \nOver 50 research publications \nNine years of teaching experience \n \nTechnical writing and information architecture \nUndergraduate and graduate teaching \nPhysics/astrophysics (research/education) \nComputer systems and applications \nProficient in Spanish and French \n \nSpecialties: Technical authoring, electronic publishing, content management, mathematical modeling, theoretical and engineering physics, astrophysics. \n \nFor comprehensive scientific and academic accomplishments, publications, and background, see personal website: \n \nhttp://home.earthlink.net/~dckennedy/edwork.html Accomplished writer, research scientist, and educator: \n \n15 years of technical writing experience \n25+ years of research experience and leadership in physics and astrophysics \nOver 50 research publications \nNine years of teaching experience \n \nTechnical writing and information architecture \nUndergraduate and graduate teaching \nPhysics/astrophysics (research/education) \nComputer systems and applications \nProficient in Spanish and French \n \nSpecialties: Technical authoring, electronic publishing, content management, mathematical modeling, theoretical and engineering physics, astrophysics. \n \nFor comprehensive scientific and academic accomplishments, publications, and background, see personal website: \n \nhttp://home.earthlink.net/~dckennedy/edwork.html Languages English Native or bilingual proficiency Spanish Limited working proficiency French Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency French Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Mathematical Physics Applied Mathematics Technical Writing Mathematical Modeling College Teaching Electronic Publishing MATLAB/Simulink Computer Programming Operating Systems Windows Desktop HTML and Web authoring Content Management XML Wiki/SharePoint FrameMaker Dreamweaver Programming Web Authoring HTML Publications Online Publishing Physics Online Help Research Proposal Writing Technical Communication Information Architecture Software Documentation Software Engineering LaTeX Manuals Usability Testing User Interface Design Adobe Acrobat Technical Documentation Wikis SnagIt Editing Perforce User Interface User Experience Java Perl Unix Software Development See 30+     See less Skills  Mathematical Physics Applied Mathematics Technical Writing Mathematical Modeling College Teaching Electronic Publishing MATLAB/Simulink Computer Programming Operating Systems Windows Desktop HTML and Web authoring Content Management XML Wiki/SharePoint FrameMaker Dreamweaver Programming Web Authoring HTML Publications Online Publishing Physics Online Help Research Proposal Writing Technical Communication Information Architecture Software Documentation Software Engineering LaTeX Manuals Usability Testing User Interface Design Adobe Acrobat Technical Documentation Wikis SnagIt Editing Perforce User Interface User Experience Java Perl Unix Software Development See 30+     See less Mathematical Physics Applied Mathematics Technical Writing Mathematical Modeling College Teaching Electronic Publishing MATLAB/Simulink Computer Programming Operating Systems Windows Desktop HTML and Web authoring Content Management XML Wiki/SharePoint FrameMaker Dreamweaver Programming Web Authoring HTML Publications Online Publishing Physics Online Help Research Proposal Writing Technical Communication Information Architecture Software Documentation Software Engineering LaTeX Manuals Usability Testing User Interface Design Adobe Acrobat Technical Documentation Wikis SnagIt Editing Perforce User Interface User Experience Java Perl Unix Software Development See 30+     See less Mathematical Physics Applied Mathematics Technical Writing Mathematical Modeling College Teaching Electronic Publishing MATLAB/Simulink Computer Programming Operating Systems Windows Desktop HTML and Web authoring Content Management XML Wiki/SharePoint FrameMaker Dreamweaver Programming Web Authoring HTML Publications Online Publishing Physics Online Help Research Proposal Writing Technical Communication Information Architecture Software Documentation Software Engineering LaTeX Manuals Usability Testing User Interface Design Adobe Acrobat Technical Documentation Wikis SnagIt Editing Perforce User Interface User Experience Java Perl Unix Software Development See 30+     See less Honors & Awards ", "Experience Thermosciences Graduate Teaching Assistant Stanford University September 2013  –  June 2015  (1 year 10 months) ME70: Fluid Mechanics \nME250: Internal Combustion Engines \nME140: Advanced Thermal Systems Graduate Research Assistant Stanford University June 2014  –  September 2014  (4 months) Ginzton Lab Professor Shanhui Fan \nDepartment of Electrical Engineering \nDOE ARPA-E Radiative Cooling Project  Research Assistant Stanford University June 2013  –  September 2013  (4 months) Advanced Energy Systems Laboratory Professor Chris Edwards  \nAdvanced Energy Systems Lab \nDepartment of Mechanical Engineering \nBosch-DOE-Stanford High Load HCCI Combustion Project Graduate Teaching Assistant Stanford University April 2013  –  June 2013  (3 months) ME257/357: Propulsion System Analysis: Internal Combustion Engines, Gas Turbines and Rockets \nInstructor: Professor Matthias Ihme \n Research Team Member Stanford University September 2011  –  September 2012  (1 year 1 month) Reinventing the Toilet Challenge, Bill and Melinda Gates Foundation \nStanford Grand Challenge Grant Team \nHonors Thesis Topic \n \nCo-wrote a computational thermodynamic model to design a sanitation facility that processes human waste into electricity and charcoal for community scale deployment in India and Africa. Alfried Krupp Foundation Intern Siemens June 2011  –  September 2011  (4 months) Berlin, Germany Projects focused on photogrammetry and computational modeling to predict rotor instability for large electric drives. Research Assistant Stanford University July 2010  –  September 2010  (3 months) Chavin de Huntar, Ancash, Peru Chavin de Huantar Excavation, Professor John Rick Thermosciences Graduate Teaching Assistant Stanford University September 2013  –  June 2015  (1 year 10 months) ME70: Fluid Mechanics \nME250: Internal Combustion Engines \nME140: Advanced Thermal Systems Thermosciences Graduate Teaching Assistant Stanford University September 2013  –  June 2015  (1 year 10 months) ME70: Fluid Mechanics \nME250: Internal Combustion Engines \nME140: Advanced Thermal Systems Graduate Research Assistant Stanford University June 2014  –  September 2014  (4 months) Ginzton Lab Professor Shanhui Fan \nDepartment of Electrical Engineering \nDOE ARPA-E Radiative Cooling Project  Graduate Research Assistant Stanford University June 2014  –  September 2014  (4 months) Ginzton Lab Professor Shanhui Fan \nDepartment of Electrical Engineering \nDOE ARPA-E Radiative Cooling Project  Research Assistant Stanford University June 2013  –  September 2013  (4 months) Advanced Energy Systems Laboratory Professor Chris Edwards  \nAdvanced Energy Systems Lab \nDepartment of Mechanical Engineering \nBosch-DOE-Stanford High Load HCCI Combustion Project Research Assistant Stanford University June 2013  –  September 2013  (4 months) Advanced Energy Systems Laboratory Professor Chris Edwards  \nAdvanced Energy Systems Lab \nDepartment of Mechanical Engineering \nBosch-DOE-Stanford High Load HCCI Combustion Project Graduate Teaching Assistant Stanford University April 2013  –  June 2013  (3 months) ME257/357: Propulsion System Analysis: Internal Combustion Engines, Gas Turbines and Rockets \nInstructor: Professor Matthias Ihme \n Graduate Teaching Assistant Stanford University April 2013  –  June 2013  (3 months) ME257/357: Propulsion System Analysis: Internal Combustion Engines, Gas Turbines and Rockets \nInstructor: Professor Matthias Ihme \n Research Team Member Stanford University September 2011  –  September 2012  (1 year 1 month) Reinventing the Toilet Challenge, Bill and Melinda Gates Foundation \nStanford Grand Challenge Grant Team \nHonors Thesis Topic \n \nCo-wrote a computational thermodynamic model to design a sanitation facility that processes human waste into electricity and charcoal for community scale deployment in India and Africa. Research Team Member Stanford University September 2011  –  September 2012  (1 year 1 month) Reinventing the Toilet Challenge, Bill and Melinda Gates Foundation \nStanford Grand Challenge Grant Team \nHonors Thesis Topic \n \nCo-wrote a computational thermodynamic model to design a sanitation facility that processes human waste into electricity and charcoal for community scale deployment in India and Africa. Alfried Krupp Foundation Intern Siemens June 2011  –  September 2011  (4 months) Berlin, Germany Projects focused on photogrammetry and computational modeling to predict rotor instability for large electric drives. Alfried Krupp Foundation Intern Siemens June 2011  –  September 2011  (4 months) Berlin, Germany Projects focused on photogrammetry and computational modeling to predict rotor instability for large electric drives. Research Assistant Stanford University July 2010  –  September 2010  (3 months) Chavin de Huntar, Ancash, Peru Chavin de Huantar Excavation, Professor John Rick Research Assistant Stanford University July 2010  –  September 2010  (3 months) Chavin de Huntar, Ancash, Peru Chavin de Huantar Excavation, Professor John Rick Languages   Skills Matlab Skills  Matlab Matlab Matlab Education Stanford University Master's Degree,  Mechanical Engineering 2012  – 2015 Concentration in Energy Systems | Breadths in Manufacturing, Fluid Mechanics & Mechatronics  Stanford University Bachelor's Degree with Honors,  Mechanical Engineering 2008  – 2013 Honors, Department of Mechanical Engineering, \"Thermodynamic Analysis for a Community-Scale Human Waste Sanitation Facility\" \n \nStudy Abroad: Berlin, Germany (6 months), Chavin de Huntar, Peru (2 months), Belize (1 month) Activities and Societies:  Stanford American Indian Organization ,  American Indian Science and Engineering Society ,  Stanford Club Water Polo Stanford University Master's Degree,  Mechanical Engineering 2012  – 2015 Concentration in Energy Systems | Breadths in Manufacturing, Fluid Mechanics & Mechatronics  Stanford University Master's Degree,  Mechanical Engineering 2012  – 2015 Concentration in Energy Systems | Breadths in Manufacturing, Fluid Mechanics & Mechatronics  Stanford University Master's Degree,  Mechanical Engineering 2012  – 2015 Concentration in Energy Systems | Breadths in Manufacturing, Fluid Mechanics & Mechatronics  Stanford University Bachelor's Degree with Honors,  Mechanical Engineering 2008  – 2013 Honors, Department of Mechanical Engineering, \"Thermodynamic Analysis for a Community-Scale Human Waste Sanitation Facility\" \n \nStudy Abroad: Berlin, Germany (6 months), Chavin de Huntar, Peru (2 months), Belize (1 month) Activities and Societies:  Stanford American Indian Organization ,  American Indian Science and Engineering Society ,  Stanford Club Water Polo Stanford University Bachelor's Degree with Honors,  Mechanical Engineering 2008  – 2013 Honors, Department of Mechanical Engineering, \"Thermodynamic Analysis for a Community-Scale Human Waste Sanitation Facility\" \n \nStudy Abroad: Berlin, Germany (6 months), Chavin de Huntar, Peru (2 months), Belize (1 month) Activities and Societies:  Stanford American Indian Organization ,  American Indian Science and Engineering Society ,  Stanford Club Water Polo Stanford University Bachelor's Degree with Honors,  Mechanical Engineering 2008  – 2013 Honors, Department of Mechanical Engineering, \"Thermodynamic Analysis for a Community-Scale Human Waste Sanitation Facility\" \n \nStudy Abroad: Berlin, Germany (6 months), Chavin de Huntar, Peru (2 months), Belize (1 month) Activities and Societies:  Stanford American Indian Organization ,  American Indian Science and Engineering Society ,  Stanford Club Water Polo Honors & Awards ", "Summary We at @WalmartLabs work on various innovative ideas to redefine commerce at the intersection of mobile, social and big data. We are seeking visionary computer scientists to solve a bunch of nifty technical challenges in areas like Big Data, Data Mining, Social Analytics, Machine Learning, NLP, Search, Large Scale Systems, Cloud Computing, etc. If this excites you, feel free to email me at aapte@walmartlabs.com. Summary We at @WalmartLabs work on various innovative ideas to redefine commerce at the intersection of mobile, social and big data. We are seeking visionary computer scientists to solve a bunch of nifty technical challenges in areas like Big Data, Data Mining, Social Analytics, Machine Learning, NLP, Search, Large Scale Systems, Cloud Computing, etc. If this excites you, feel free to email me at aapte@walmartlabs.com. We at @WalmartLabs work on various innovative ideas to redefine commerce at the intersection of mobile, social and big data. We are seeking visionary computer scientists to solve a bunch of nifty technical challenges in areas like Big Data, Data Mining, Social Analytics, Machine Learning, NLP, Search, Large Scale Systems, Cloud Computing, etc. If this excites you, feel free to email me at aapte@walmartlabs.com. We at @WalmartLabs work on various innovative ideas to redefine commerce at the intersection of mobile, social and big data. We are seeking visionary computer scientists to solve a bunch of nifty technical challenges in areas like Big Data, Data Mining, Social Analytics, Machine Learning, NLP, Search, Large Scale Systems, Cloud Computing, etc. If this excites you, feel free to email me at aapte@walmartlabs.com. Experience Staff Engineer - Data Science, Team Lead @WalmartLabs May 2014  – Present (1 year 4 months) Bengaluru Area, India Enrich the customer's purchase experience by providing the right product content on the Walmart.com product page. Use data science tools to identify the right content for each product, and organize it effectively and efficiently. Graduate Teaching Assistant Stanford University January 2014  –  March 2014  (3 months) CS246 - Mining Massive Data Sets \n \nhttp://snap.stanford.edu/class/cs246-2014/ \n \nCreate, assign and grade problem sets. \nCreate and grade exams. \nHold weekly office hours. Graduate Teaching Assistant Stanford University September 2013  –  December 2013  (4 months) CS224W - Social and Information Network Analysis \n \nhttp://snap.stanford.edu/class/cs224w-2013/ \n \nCreate, assign and grade problem sets. \nMentor project groups. \nHold weekly office hours. Intern @WalmartLabs June 2013  –  August 2013  (3 months) Bangalore Data Mining to discover rich information modules for Walmart.com product pages. Graduate Teaching Assistant Stanford University April 2013  –  June 2013  (3 months) MS&E 261 - Supply Chain Management \n \nAssign, collect and grade assignments. \nMentor class project groups. \nHold weekly office hours. Partner Ozone Ventures June 2009  –  July 2012  (3 years 2 months) Pune, India • Entrepreneurial venture, for importing and wholesaling bicycles and accessories \n• Sole distributors for Bergamont (German) bicycles in India \n• Appointed and managed dealers across India \n• Managed portfolio of bikes for Indian market \n• Provided key inputs to product designers in Germany \n• Ramped up sales from 300 bikes in 2010 to 1200 in 2011 Director Rapid Machining Technologies Pvt. Ltd January 2008  –  July 2011  (3 years 7 months) Pune, India • Manufacturers of precision machined engine components, 80 employees \n• Sat on the Board of Directors, participated in and implemented strategic decisions \n• Led the Quality function, responsible for ISO 9001:2008 QMS implementation \n• Delivered zero-defect supplies to customers for entire product line (4 families, 41 items) \n• Drove 6-Sigma and Continual Improvement initiatives \n• Assessed, appointed and managed suppliers for over 30 outsourced components \n• Managed key customer accounts worth 40% of company’s sales: Cummins, Delphi, Bosch \n• Led initiatives to acquire new customers in India and abroad \n• Managed capacity expansion project with investments of USD 1.2mn in plant and machinery Manager – Reconditioning & Product Manager Kennametal India Ltd June 2006  –  October 2007  (1 year 5 months) Bangalore, India • Multi-national cutting tools manufacturer, 1200 employees (India) \n• Set up reconditioning facilities for drilling tools across India, delivered RoI target of 15% \n• Established logistics network across India \n• Managed portfolio of drilling tools (12 categories, 40+ catalog items) \n• Drove India sales of $10mn through 6 product specialists and 200 sales representatives \n• Interacted with global product and engineering teams \n• Trained sales teams in application areas \n• Created marketing and sales-ready literature (catalogs, brochures) \n• Received Outstanding Performance Award in 2007 Staff Engineer - Data Science, Team Lead @WalmartLabs May 2014  – Present (1 year 4 months) Bengaluru Area, India Enrich the customer's purchase experience by providing the right product content on the Walmart.com product page. Use data science tools to identify the right content for each product, and organize it effectively and efficiently. Staff Engineer - Data Science, Team Lead @WalmartLabs May 2014  – Present (1 year 4 months) Bengaluru Area, India Enrich the customer's purchase experience by providing the right product content on the Walmart.com product page. Use data science tools to identify the right content for each product, and organize it effectively and efficiently. Graduate Teaching Assistant Stanford University January 2014  –  March 2014  (3 months) CS246 - Mining Massive Data Sets \n \nhttp://snap.stanford.edu/class/cs246-2014/ \n \nCreate, assign and grade problem sets. \nCreate and grade exams. \nHold weekly office hours. Graduate Teaching Assistant Stanford University January 2014  –  March 2014  (3 months) CS246 - Mining Massive Data Sets \n \nhttp://snap.stanford.edu/class/cs246-2014/ \n \nCreate, assign and grade problem sets. \nCreate and grade exams. \nHold weekly office hours. Graduate Teaching Assistant Stanford University September 2013  –  December 2013  (4 months) CS224W - Social and Information Network Analysis \n \nhttp://snap.stanford.edu/class/cs224w-2013/ \n \nCreate, assign and grade problem sets. \nMentor project groups. \nHold weekly office hours. Graduate Teaching Assistant Stanford University September 2013  –  December 2013  (4 months) CS224W - Social and Information Network Analysis \n \nhttp://snap.stanford.edu/class/cs224w-2013/ \n \nCreate, assign and grade problem sets. \nMentor project groups. \nHold weekly office hours. Intern @WalmartLabs June 2013  –  August 2013  (3 months) Bangalore Data Mining to discover rich information modules for Walmart.com product pages. Intern @WalmartLabs June 2013  –  August 2013  (3 months) Bangalore Data Mining to discover rich information modules for Walmart.com product pages. Graduate Teaching Assistant Stanford University April 2013  –  June 2013  (3 months) MS&E 261 - Supply Chain Management \n \nAssign, collect and grade assignments. \nMentor class project groups. \nHold weekly office hours. Graduate Teaching Assistant Stanford University April 2013  –  June 2013  (3 months) MS&E 261 - Supply Chain Management \n \nAssign, collect and grade assignments. \nMentor class project groups. \nHold weekly office hours. Partner Ozone Ventures June 2009  –  July 2012  (3 years 2 months) Pune, India • Entrepreneurial venture, for importing and wholesaling bicycles and accessories \n• Sole distributors for Bergamont (German) bicycles in India \n• Appointed and managed dealers across India \n• Managed portfolio of bikes for Indian market \n• Provided key inputs to product designers in Germany \n• Ramped up sales from 300 bikes in 2010 to 1200 in 2011 Partner Ozone Ventures June 2009  –  July 2012  (3 years 2 months) Pune, India • Entrepreneurial venture, for importing and wholesaling bicycles and accessories \n• Sole distributors for Bergamont (German) bicycles in India \n• Appointed and managed dealers across India \n• Managed portfolio of bikes for Indian market \n• Provided key inputs to product designers in Germany \n• Ramped up sales from 300 bikes in 2010 to 1200 in 2011 Director Rapid Machining Technologies Pvt. Ltd January 2008  –  July 2011  (3 years 7 months) Pune, India • Manufacturers of precision machined engine components, 80 employees \n• Sat on the Board of Directors, participated in and implemented strategic decisions \n• Led the Quality function, responsible for ISO 9001:2008 QMS implementation \n• Delivered zero-defect supplies to customers for entire product line (4 families, 41 items) \n• Drove 6-Sigma and Continual Improvement initiatives \n• Assessed, appointed and managed suppliers for over 30 outsourced components \n• Managed key customer accounts worth 40% of company’s sales: Cummins, Delphi, Bosch \n• Led initiatives to acquire new customers in India and abroad \n• Managed capacity expansion project with investments of USD 1.2mn in plant and machinery Director Rapid Machining Technologies Pvt. Ltd January 2008  –  July 2011  (3 years 7 months) Pune, India • Manufacturers of precision machined engine components, 80 employees \n• Sat on the Board of Directors, participated in and implemented strategic decisions \n• Led the Quality function, responsible for ISO 9001:2008 QMS implementation \n• Delivered zero-defect supplies to customers for entire product line (4 families, 41 items) \n• Drove 6-Sigma and Continual Improvement initiatives \n• Assessed, appointed and managed suppliers for over 30 outsourced components \n• Managed key customer accounts worth 40% of company’s sales: Cummins, Delphi, Bosch \n• Led initiatives to acquire new customers in India and abroad \n• Managed capacity expansion project with investments of USD 1.2mn in plant and machinery Manager – Reconditioning & Product Manager Kennametal India Ltd June 2006  –  October 2007  (1 year 5 months) Bangalore, India • Multi-national cutting tools manufacturer, 1200 employees (India) \n• Set up reconditioning facilities for drilling tools across India, delivered RoI target of 15% \n• Established logistics network across India \n• Managed portfolio of drilling tools (12 categories, 40+ catalog items) \n• Drove India sales of $10mn through 6 product specialists and 200 sales representatives \n• Interacted with global product and engineering teams \n• Trained sales teams in application areas \n• Created marketing and sales-ready literature (catalogs, brochures) \n• Received Outstanding Performance Award in 2007 Manager – Reconditioning & Product Manager Kennametal India Ltd June 2006  –  October 2007  (1 year 5 months) Bangalore, India • Multi-national cutting tools manufacturer, 1200 employees (India) \n• Set up reconditioning facilities for drilling tools across India, delivered RoI target of 15% \n• Established logistics network across India \n• Managed portfolio of drilling tools (12 categories, 40+ catalog items) \n• Drove India sales of $10mn through 6 product specialists and 200 sales representatives \n• Interacted with global product and engineering teams \n• Trained sales teams in application areas \n• Created marketing and sales-ready literature (catalogs, brochures) \n• Received Outstanding Performance Award in 2007 Languages Hindi, Marathi Hindi, Marathi Hindi, Marathi Skills Skills     Education Stanford University Master of Science (MS),  Management Science & Engineering 2012  – 2014 Specializing in Data Science Indian Institute of Management, Lucknow Post Graduate Diploma in Management (MBA),  Operations Management 2004  – 2006 Activities and Societies:  Campus Co-ordinator ,  Placement Cell University of Pune MSc,  Electronics , O (Outstanding) 2002  – 2004 2nd Rank in Pune University Fergusson College Bachelor of Science (B.Sc.),  Electronics Science , First Class with Distinction 1999  – 2002 1st Rank in Pune University Stanford University Master of Science (MS),  Management Science & Engineering 2012  – 2014 Specializing in Data Science Stanford University Master of Science (MS),  Management Science & Engineering 2012  – 2014 Specializing in Data Science Stanford University Master of Science (MS),  Management Science & Engineering 2012  – 2014 Specializing in Data Science Indian Institute of Management, Lucknow Post Graduate Diploma in Management (MBA),  Operations Management 2004  – 2006 Activities and Societies:  Campus Co-ordinator ,  Placement Cell Indian Institute of Management, Lucknow Post Graduate Diploma in Management (MBA),  Operations Management 2004  – 2006 Activities and Societies:  Campus Co-ordinator ,  Placement Cell Indian Institute of Management, Lucknow Post Graduate Diploma in Management (MBA),  Operations Management 2004  – 2006 Activities and Societies:  Campus Co-ordinator ,  Placement Cell University of Pune MSc,  Electronics , O (Outstanding) 2002  – 2004 2nd Rank in Pune University University of Pune MSc,  Electronics , O (Outstanding) 2002  – 2004 2nd Rank in Pune University University of Pune MSc,  Electronics , O (Outstanding) 2002  – 2004 2nd Rank in Pune University Fergusson College Bachelor of Science (B.Sc.),  Electronics Science , First Class with Distinction 1999  – 2002 1st Rank in Pune University Fergusson College Bachelor of Science (B.Sc.),  Electronics Science , First Class with Distinction 1999  – 2002 1st Rank in Pune University Fergusson College Bachelor of Science (B.Sc.),  Electronics Science , First Class with Distinction 1999  – 2002 1st Rank in Pune University ", "Summary I'm an experimental researcher with experience in synthesis and characterization of materials for alternative energy applications using various imaging and spectroscopic techniques. Interested in leveraging my experience in research, analytics and design through a position in Silicon Valley \n \n \nhttp://web.stanford.edu/~chinmayn/ Summary I'm an experimental researcher with experience in synthesis and characterization of materials for alternative energy applications using various imaging and spectroscopic techniques. Interested in leveraging my experience in research, analytics and design through a position in Silicon Valley \n \n \nhttp://web.stanford.edu/~chinmayn/ I'm an experimental researcher with experience in synthesis and characterization of materials for alternative energy applications using various imaging and spectroscopic techniques. Interested in leveraging my experience in research, analytics and design through a position in Silicon Valley \n \n \nhttp://web.stanford.edu/~chinmayn/ I'm an experimental researcher with experience in synthesis and characterization of materials for alternative energy applications using various imaging and spectroscopic techniques. Interested in leveraging my experience in research, analytics and design through a position in Silicon Valley \n \n \nhttp://web.stanford.edu/~chinmayn/ Experience PhD Candidate Stanford University September 2009  – Present (6 years) Stanford, CA My research involves studying processing of nanoscale materials for solar energy conversion, under Prof. Bruce Clemens Graduate Teaching Assistant Stanford University August 2012  – Present (3 years 1 month) Stanford, CA http://f12.class2go.stanford.edu/solar/Fall2012/ \n- Leading teaching assistant team for Solar Cells, Fuel Cells and Batteries, an on-campus as well as Massively Open Online Course (MOOC), reaching thousands of students all over the world. This is a pilot class for Stanford University's Class2Go online learning initiative. \n- Creation, design and implementation of web-based content for the online version. \n- Also involved in designing methods for implementing the flipped classroom for the on-campus version of the course \n- Involved in usability testing for the new Class2Go learning interface Graduate Teaching Assistant Stanford University January 2012  –  March 2012  (3 months) Stanford, CA MATSCI 195/205 Waves and Diffraction in Solids Graduate Teaching Assistant Stanford University September 2011  –  December 2011  (4 months) Stanford, CA MATSCI 156/256 Solar Cells, Fuel Cells and Batteries Summer Research Intern Seco Tools AB May 2008  –  July 2008  (3 months) Investigated machinability of Ca-treated steel C45 in turning using coated cemented carbide tools Summer Research Intern Bharat Forge Ltd May 2007  –  June 2007  (2 months) PhD Candidate Stanford University September 2009  – Present (6 years) Stanford, CA My research involves studying processing of nanoscale materials for solar energy conversion, under Prof. Bruce Clemens PhD Candidate Stanford University September 2009  – Present (6 years) Stanford, CA My research involves studying processing of nanoscale materials for solar energy conversion, under Prof. Bruce Clemens Graduate Teaching Assistant Stanford University August 2012  – Present (3 years 1 month) Stanford, CA http://f12.class2go.stanford.edu/solar/Fall2012/ \n- Leading teaching assistant team for Solar Cells, Fuel Cells and Batteries, an on-campus as well as Massively Open Online Course (MOOC), reaching thousands of students all over the world. This is a pilot class for Stanford University's Class2Go online learning initiative. \n- Creation, design and implementation of web-based content for the online version. \n- Also involved in designing methods for implementing the flipped classroom for the on-campus version of the course \n- Involved in usability testing for the new Class2Go learning interface Graduate Teaching Assistant Stanford University August 2012  – Present (3 years 1 month) Stanford, CA http://f12.class2go.stanford.edu/solar/Fall2012/ \n- Leading teaching assistant team for Solar Cells, Fuel Cells and Batteries, an on-campus as well as Massively Open Online Course (MOOC), reaching thousands of students all over the world. This is a pilot class for Stanford University's Class2Go online learning initiative. \n- Creation, design and implementation of web-based content for the online version. \n- Also involved in designing methods for implementing the flipped classroom for the on-campus version of the course \n- Involved in usability testing for the new Class2Go learning interface Graduate Teaching Assistant Stanford University January 2012  –  March 2012  (3 months) Stanford, CA MATSCI 195/205 Waves and Diffraction in Solids Graduate Teaching Assistant Stanford University January 2012  –  March 2012  (3 months) Stanford, CA MATSCI 195/205 Waves and Diffraction in Solids Graduate Teaching Assistant Stanford University September 2011  –  December 2011  (4 months) Stanford, CA MATSCI 156/256 Solar Cells, Fuel Cells and Batteries Graduate Teaching Assistant Stanford University September 2011  –  December 2011  (4 months) Stanford, CA MATSCI 156/256 Solar Cells, Fuel Cells and Batteries Summer Research Intern Seco Tools AB May 2008  –  July 2008  (3 months) Investigated machinability of Ca-treated steel C45 in turning using coated cemented carbide tools Summer Research Intern Seco Tools AB May 2008  –  July 2008  (3 months) Investigated machinability of Ca-treated steel C45 in turning using coated cemented carbide tools Summer Research Intern Bharat Forge Ltd May 2007  –  June 2007  (2 months) Summer Research Intern Bharat Forge Ltd May 2007  –  June 2007  (2 months) Languages English Native or bilingual proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Thin Films Materials Science Nanomaterials Matlab Photovoltaics Batteries Python PVD Nanoparticles Higher Education Design Thinking Scientific Writing Editing Sputtering Scanning Electron... Solar Cells Powder X-ray Diffraction LaTeX Web Development Thin Film... X-ray crystallography X-ray spectroscopy Auger electron... Raman Microscopy Vacuum Chambers Compound Semiconductors Characterization See 12+     See less Skills  Thin Films Materials Science Nanomaterials Matlab Photovoltaics Batteries Python PVD Nanoparticles Higher Education Design Thinking Scientific Writing Editing Sputtering Scanning Electron... Solar Cells Powder X-ray Diffraction LaTeX Web Development Thin Film... X-ray crystallography X-ray spectroscopy Auger electron... Raman Microscopy Vacuum Chambers Compound Semiconductors Characterization See 12+     See less Thin Films Materials Science Nanomaterials Matlab Photovoltaics Batteries Python PVD Nanoparticles Higher Education Design Thinking Scientific Writing Editing Sputtering Scanning Electron... Solar Cells Powder X-ray Diffraction LaTeX Web Development Thin Film... X-ray crystallography X-ray spectroscopy Auger electron... Raman Microscopy Vacuum Chambers Compound Semiconductors Characterization See 12+     See less Thin Films Materials Science Nanomaterials Matlab Photovoltaics Batteries Python PVD Nanoparticles Higher Education Design Thinking Scientific Writing Editing Sputtering Scanning Electron... Solar Cells Powder X-ray Diffraction LaTeX Web Development Thin Film... X-ray crystallography X-ray spectroscopy Auger electron... Raman Microscopy Vacuum Chambers Compound Semiconductors Characterization See 12+     See less Education Stanford University Doctor of Philosophy (PhD),  Materials Science 2009  – 2015 Stanford University Master of Science (M.S.),  Materials Science and Engineering 2009  – 2013 Indian Institute of Technology, Bombay B.Tech,  Materials Science and Engineering 2005  – 2009 Activities and Societies:  Institute Mentorship Programme ,  Literary Arts Society Stanford University Doctor of Philosophy (PhD),  Materials Science 2009  – 2015 Stanford University Doctor of Philosophy (PhD),  Materials Science 2009  – 2015 Stanford University Doctor of Philosophy (PhD),  Materials Science 2009  – 2015 Stanford University Master of Science (M.S.),  Materials Science and Engineering 2009  – 2013 Stanford University Master of Science (M.S.),  Materials Science and Engineering 2009  – 2013 Stanford University Master of Science (M.S.),  Materials Science and Engineering 2009  – 2013 Indian Institute of Technology, Bombay B.Tech,  Materials Science and Engineering 2005  – 2009 Activities and Societies:  Institute Mentorship Programme ,  Literary Arts Society Indian Institute of Technology, Bombay B.Tech,  Materials Science and Engineering 2005  – 2009 Activities and Societies:  Institute Mentorship Programme ,  Literary Arts Society Indian Institute of Technology, Bombay B.Tech,  Materials Science and Engineering 2005  – 2009 Activities and Societies:  Institute Mentorship Programme ,  Literary Arts Society Honors & Awards Institute Silver Medal IIT Bombay June 2009 Awarded to the student ranked first in graduating class Centennial Teaching Assistant Award Stanford University Institute Silver Medal IIT Bombay June 2009 Awarded to the student ranked first in graduating class Institute Silver Medal IIT Bombay June 2009 Awarded to the student ranked first in graduating class Institute Silver Medal IIT Bombay June 2009 Awarded to the student ranked first in graduating class Centennial Teaching Assistant Award Stanford University Centennial Teaching Assistant Award Stanford University Centennial Teaching Assistant Award Stanford University ", "Summary Experienced business leader with expertise in management consulting, energy efficiency and green buildings, software technical leadership, and commercial construction management \n \nActively seeking my next opportunity driving adoption of next-generation energy infrastructure or developing technology products that push the boundary in cleantech Summary Experienced business leader with expertise in management consulting, energy efficiency and green buildings, software technical leadership, and commercial construction management \n \nActively seeking my next opportunity driving adoption of next-generation energy infrastructure or developing technology products that push the boundary in cleantech Experienced business leader with expertise in management consulting, energy efficiency and green buildings, software technical leadership, and commercial construction management \n \nActively seeking my next opportunity driving adoption of next-generation energy infrastructure or developing technology products that push the boundary in cleantech Experienced business leader with expertise in management consulting, energy efficiency and green buildings, software technical leadership, and commercial construction management \n \nActively seeking my next opportunity driving adoption of next-generation energy infrastructure or developing technology products that push the boundary in cleantech Skills Software Development Engineering Management Start-ups Project Management Analysis Construction Simulations Research Management Consulting C++ Matlab Product Development Energy Algorithms Modeling Consulting Data Analysis Java Financial Modeling Strategy Business Strategy Entrepreneurship Energy Efficiency Sustainability See 10+     See less Skills  Software Development Engineering Management Start-ups Project Management Analysis Construction Simulations Research Management Consulting C++ Matlab Product Development Energy Algorithms Modeling Consulting Data Analysis Java Financial Modeling Strategy Business Strategy Entrepreneurship Energy Efficiency Sustainability See 10+     See less Software Development Engineering Management Start-ups Project Management Analysis Construction Simulations Research Management Consulting C++ Matlab Product Development Energy Algorithms Modeling Consulting Data Analysis Java Financial Modeling Strategy Business Strategy Entrepreneurship Energy Efficiency Sustainability See 10+     See less Software Development Engineering Management Start-ups Project Management Analysis Construction Simulations Research Management Consulting C++ Matlab Product Development Energy Algorithms Modeling Consulting Data Analysis Java Financial Modeling Strategy Business Strategy Entrepreneurship Energy Efficiency Sustainability See 10+     See less Education Stanford Graduate School of Business 2011  – 2011 Stanford University MS 2009  – 2011 Georgetown University MA 2003  – 2006 Stanford University BS 1998  – 2002 Stanford Graduate School of Business 2011  – 2011 Stanford Graduate School of Business 2011  – 2011 Stanford Graduate School of Business 2011  – 2011 Stanford University MS 2009  – 2011 Stanford University MS 2009  – 2011 Stanford University MS 2009  – 2011 Georgetown University MA 2003  – 2006 Georgetown University MA 2003  – 2006 Georgetown University MA 2003  – 2006 Stanford University BS 1998  – 2002 Stanford University BS 1998  – 2002 Stanford University BS 1998  – 2002 Honors & Awards ", "Summary I am currently a PhD student in the Computer Science & Artificial Intelligence Laboratory (CSAIL) at MIT. \n \nResearch Interests: data-management platforms/tools, databases, distributed systems, human-computer interaction Summary I am currently a PhD student in the Computer Science & Artificial Intelligence Laboratory (CSAIL) at MIT. \n \nResearch Interests: data-management platforms/tools, databases, distributed systems, human-computer interaction I am currently a PhD student in the Computer Science & Artificial Intelligence Laboratory (CSAIL) at MIT. \n \nResearch Interests: data-management platforms/tools, databases, distributed systems, human-computer interaction I am currently a PhD student in the Computer Science & Artificial Intelligence Laboratory (CSAIL) at MIT. \n \nResearch Interests: data-management platforms/tools, databases, distributed systems, human-computer interaction Experience Research Assistant MIT Computer Science & Artificial Intelligence Laboratory (CSAIL) September 2012  – Present (3 years) Greater Boston Area Haystack, and Database Groups Research Intern Google June 2014  –  September 2014  (4 months) San Francisco Bay Area Search Team Graduate Teaching Assistant Massachusetts Institute of Technology (MIT) January 2014  –  May 2014  (5 months) Greater Boston Area User Interface Design and Implementation (6.813) Research Intern Google May 2013  –  August 2013  (4 months) Mountain View Search Team Instructor Massachusetts Institute of Technology (MIT) January 2013  –  February 2013  (2 months) Cambridge, MA Introduction to Programming in Java (6.092) Engineering Consultant Sookasa June 2012  –  August 2012  (3 months) Mountain View Server Infrastructure Graduate Teaching Assistant Stanford University March 2012  –  June 2012  (4 months) Stanford Web Applications (CS 142) Graduate Teaching Assistant Stanford University January 2012  –  March 2012  (3 months) Stanford HCI: Interaction Design Studio (CS 247) Graduate Teaching Assistant Stanford University September 2011  –  December 2011  (4 months) Stanford Object Oriented Programming from Modeling and Simulation Perspective (CS 249A) Software Engineering Intern Oracle June 2011  –  September 2011  (4 months) Redwood City OPAM Team Research Assistant Stanford University January 2011  –  June 2011  (6 months) Stanford Elias Lab Product Developer BMC Software July 2007  –  August 2010  (3 years 2 months) Pune Marimba Research Assistant MIT Computer Science & Artificial Intelligence Laboratory (CSAIL) September 2012  – Present (3 years) Greater Boston Area Haystack, and Database Groups Research Assistant MIT Computer Science & Artificial Intelligence Laboratory (CSAIL) September 2012  – Present (3 years) Greater Boston Area Haystack, and Database Groups Research Intern Google June 2014  –  September 2014  (4 months) San Francisco Bay Area Search Team Research Intern Google June 2014  –  September 2014  (4 months) San Francisco Bay Area Search Team Graduate Teaching Assistant Massachusetts Institute of Technology (MIT) January 2014  –  May 2014  (5 months) Greater Boston Area User Interface Design and Implementation (6.813) Graduate Teaching Assistant Massachusetts Institute of Technology (MIT) January 2014  –  May 2014  (5 months) Greater Boston Area User Interface Design and Implementation (6.813) Research Intern Google May 2013  –  August 2013  (4 months) Mountain View Search Team Research Intern Google May 2013  –  August 2013  (4 months) Mountain View Search Team Instructor Massachusetts Institute of Technology (MIT) January 2013  –  February 2013  (2 months) Cambridge, MA Introduction to Programming in Java (6.092) Instructor Massachusetts Institute of Technology (MIT) January 2013  –  February 2013  (2 months) Cambridge, MA Introduction to Programming in Java (6.092) Engineering Consultant Sookasa June 2012  –  August 2012  (3 months) Mountain View Server Infrastructure Engineering Consultant Sookasa June 2012  –  August 2012  (3 months) Mountain View Server Infrastructure Graduate Teaching Assistant Stanford University March 2012  –  June 2012  (4 months) Stanford Web Applications (CS 142) Graduate Teaching Assistant Stanford University March 2012  –  June 2012  (4 months) Stanford Web Applications (CS 142) Graduate Teaching Assistant Stanford University January 2012  –  March 2012  (3 months) Stanford HCI: Interaction Design Studio (CS 247) Graduate Teaching Assistant Stanford University January 2012  –  March 2012  (3 months) Stanford HCI: Interaction Design Studio (CS 247) Graduate Teaching Assistant Stanford University September 2011  –  December 2011  (4 months) Stanford Object Oriented Programming from Modeling and Simulation Perspective (CS 249A) Graduate Teaching Assistant Stanford University September 2011  –  December 2011  (4 months) Stanford Object Oriented Programming from Modeling and Simulation Perspective (CS 249A) Software Engineering Intern Oracle June 2011  –  September 2011  (4 months) Redwood City OPAM Team Software Engineering Intern Oracle June 2011  –  September 2011  (4 months) Redwood City OPAM Team Research Assistant Stanford University January 2011  –  June 2011  (6 months) Stanford Elias Lab Research Assistant Stanford University January 2011  –  June 2011  (6 months) Stanford Elias Lab Product Developer BMC Software July 2007  –  August 2010  (3 years 2 months) Pune Marimba Product Developer BMC Software July 2007  –  August 2010  (3 years 2 months) Pune Marimba Skills Python C Java PHP JavaScript Computer Science Programming Databases Web Applications Algorithms C++ Software Engineering Machine Learning Hadoop Human Computer... Distributed Systems See 1+     See less Skills  Python C Java PHP JavaScript Computer Science Programming Databases Web Applications Algorithms C++ Software Engineering Machine Learning Hadoop Human Computer... Distributed Systems See 1+     See less Python C Java PHP JavaScript Computer Science Programming Databases Web Applications Algorithms C++ Software Engineering Machine Learning Hadoop Human Computer... Distributed Systems See 1+     See less Python C Java PHP JavaScript Computer Science Programming Databases Web Applications Algorithms C++ Software Engineering Machine Learning Hadoop Human Computer... Distributed Systems See 1+     See less Education Massachusetts Institute of Technology Doctor of Philosophy (PhD),  Computer Science 2012  – 2016 Stanford University Master of Science (MS),  Computer Science 2010  – 2012 University of Pune Bachelor of Engineering (BE),  Computer Science 2003  – 2007 Massachusetts Institute of Technology Doctor of Philosophy (PhD),  Computer Science 2012  – 2016 Massachusetts Institute of Technology Doctor of Philosophy (PhD),  Computer Science 2012  – 2016 Massachusetts Institute of Technology Doctor of Philosophy (PhD),  Computer Science 2012  – 2016 Stanford University Master of Science (MS),  Computer Science 2010  – 2012 Stanford University Master of Science (MS),  Computer Science 2010  – 2012 Stanford University Master of Science (MS),  Computer Science 2010  – 2012 University of Pune Bachelor of Engineering (BE),  Computer Science 2003  – 2007 University of Pune Bachelor of Engineering (BE),  Computer Science 2003  – 2007 University of Pune Bachelor of Engineering (BE),  Computer Science 2003  – 2007 ", "Summary My background is in modeling and control, with an emphasis on vehicle dynamics. I have a wide range of mechanical engineering experience including hands-on design and manufacturing, control system design for mass production, and theoretical analysis of dynamic systems.  \n \nSpecialties: Dynamics, nonlinear and linear control, control system design for mass production, vehicle dynamics, system modeling, Vehicle Envelope Control, mechanical design for control, mechatronics, HDD system dynamics Summary My background is in modeling and control, with an emphasis on vehicle dynamics. I have a wide range of mechanical engineering experience including hands-on design and manufacturing, control system design for mass production, and theoretical analysis of dynamic systems.  \n \nSpecialties: Dynamics, nonlinear and linear control, control system design for mass production, vehicle dynamics, system modeling, Vehicle Envelope Control, mechanical design for control, mechatronics, HDD system dynamics My background is in modeling and control, with an emphasis on vehicle dynamics. I have a wide range of mechanical engineering experience including hands-on design and manufacturing, control system design for mass production, and theoretical analysis of dynamic systems.  \n \nSpecialties: Dynamics, nonlinear and linear control, control system design for mass production, vehicle dynamics, system modeling, Vehicle Envelope Control, mechanical design for control, mechatronics, HDD system dynamics My background is in modeling and control, with an emphasis on vehicle dynamics. I have a wide range of mechanical engineering experience including hands-on design and manufacturing, control system design for mass production, and theoretical analysis of dynamic systems.  \n \nSpecialties: Dynamics, nonlinear and linear control, control system design for mass production, vehicle dynamics, system modeling, Vehicle Envelope Control, mechanical design for control, mechatronics, HDD system dynamics Experience Senior Researcher Renault Innovation Silicon Valley April 2015  – Present (5 months) Senior Researcher Renault Innovation Silicon Valley April 2015  – Present (5 months) Senior Researcher Renault Innovation Silicon Valley April 2015  – Present (5 months) Languages English Mandarin English Mandarin English Mandarin Skills Mechatronics Vehicle Dynamics Control Systems Design Robotics Dynamics Matlab Simulations Simulink Machining Solidworks Mandarin Modeling Product Design Mechanical Engineering C MSC.ADAMS XPC Suspension Design Envelope Control Servo Control Failure Analysis Testing Research Sensors Product Development Design for Manufacturing Hard Drives SolidWorks See 13+     See less Skills  Mechatronics Vehicle Dynamics Control Systems Design Robotics Dynamics Matlab Simulations Simulink Machining Solidworks Mandarin Modeling Product Design Mechanical Engineering C MSC.ADAMS XPC Suspension Design Envelope Control Servo Control Failure Analysis Testing Research Sensors Product Development Design for Manufacturing Hard Drives SolidWorks See 13+     See less Mechatronics Vehicle Dynamics Control Systems Design Robotics Dynamics Matlab Simulations Simulink Machining Solidworks Mandarin Modeling Product Design Mechanical Engineering C MSC.ADAMS XPC Suspension Design Envelope Control Servo Control Failure Analysis Testing Research Sensors Product Development Design for Manufacturing Hard Drives SolidWorks See 13+     See less Mechatronics Vehicle Dynamics Control Systems Design Robotics Dynamics Matlab Simulations Simulink Machining Solidworks Mandarin Modeling Product Design Mechanical Engineering C MSC.ADAMS XPC Suspension Design Envelope Control Servo Control Failure Analysis Testing Research Sensors Product Development Design for Manufacturing Hard Drives SolidWorks See 13+     See less Education Stanford University BS, MS, PhD 2002  – 2012 Stanford University BS, MS, PhD 2002  – 2012 Stanford University BS, MS, PhD 2002  – 2012 Stanford University BS, MS, PhD 2002  – 2012 Honors & Awards ", "Skills Winging it Ebooks Hacking Android Video Editing Simulation Software Performance Analysis Debugging High Performance... Linux Computer Architecture C++ Software Engineering Customer Experience Git Scalability RTL design Technical Leadership OOP Agile Methodologies Rapid Prototyping Microarchitecture Market Analysis Cloud Computing System Simulation BitKeeper Scrum Modeling Extortion Mentoring Project Execution Volunteer Leadership Agile Project Management Public Speaking Amazon Kindle Prison Ministry ePublisher Capital Budgeting Product Validation Parallel Computing Idea Generation Runway Sony Vegas Post Production DaVinci Resolve See 30+     See less Skills  Winging it Ebooks Hacking Android Video Editing Simulation Software Performance Analysis Debugging High Performance... Linux Computer Architecture C++ Software Engineering Customer Experience Git Scalability RTL design Technical Leadership OOP Agile Methodologies Rapid Prototyping Microarchitecture Market Analysis Cloud Computing System Simulation BitKeeper Scrum Modeling Extortion Mentoring Project Execution Volunteer Leadership Agile Project Management Public Speaking Amazon Kindle Prison Ministry ePublisher Capital Budgeting Product Validation Parallel Computing Idea Generation Runway Sony Vegas Post Production DaVinci Resolve See 30+     See less Winging it Ebooks Hacking Android Video Editing Simulation Software Performance Analysis Debugging High Performance... Linux Computer Architecture C++ Software Engineering Customer Experience Git Scalability RTL design Technical Leadership OOP Agile Methodologies Rapid Prototyping Microarchitecture Market Analysis Cloud Computing System Simulation BitKeeper Scrum Modeling Extortion Mentoring Project Execution Volunteer Leadership Agile Project Management Public Speaking Amazon Kindle Prison Ministry ePublisher Capital Budgeting Product Validation Parallel Computing Idea Generation Runway Sony Vegas Post Production DaVinci Resolve See 30+     See less Winging it Ebooks Hacking Android Video Editing Simulation Software Performance Analysis Debugging High Performance... Linux Computer Architecture C++ Software Engineering Customer Experience Git Scalability RTL design Technical Leadership OOP Agile Methodologies Rapid Prototyping Microarchitecture Market Analysis Cloud Computing System Simulation BitKeeper Scrum Modeling Extortion Mentoring Project Execution Volunteer Leadership Agile Project Management Public Speaking Amazon Kindle Prison Ministry ePublisher Capital Budgeting Product Validation Parallel Computing Idea Generation Runway Sony Vegas Post Production DaVinci Resolve See 30+     See less Education Stanford University MS January 2000  – June 2002 Brown University Sc.B. September 1995  – May 1999 Niles West High School 1991  – 1995 Stanford University MS January 2000  – June 2002 Stanford University MS January 2000  – June 2002 Stanford University MS January 2000  – June 2002 Brown University Sc.B. September 1995  – May 1999 Brown University Sc.B. September 1995  – May 1999 Brown University Sc.B. September 1995  – May 1999 Niles West High School 1991  – 1995 Niles West High School 1991  – 1995 Niles West High School 1991  – 1995 ", "Summary One Concern, Inc is trying to make the world a safer place from natural disasters using artificial intelligence on natural science phenomena sciences.  \n \nIf you are like us and like fiddling with creating a super scalable website over the weekend or pushing to github like crazy; all over 50 cups of coffee, then this is a match made in heaven!  \n \nWe are currently looking for  \n1) Full Stack Software Engineers \n2) Full Stack Designers \n3) Data Scientists \n \nAlso, in general, we are always on the look out for amazing people.  \n \nHelp us build systems that matter. Contact us at careers@oneconcern.com Summary One Concern, Inc is trying to make the world a safer place from natural disasters using artificial intelligence on natural science phenomena sciences.  \n \nIf you are like us and like fiddling with creating a super scalable website over the weekend or pushing to github like crazy; all over 50 cups of coffee, then this is a match made in heaven!  \n \nWe are currently looking for  \n1) Full Stack Software Engineers \n2) Full Stack Designers \n3) Data Scientists \n \nAlso, in general, we are always on the look out for amazing people.  \n \nHelp us build systems that matter. Contact us at careers@oneconcern.com One Concern, Inc is trying to make the world a safer place from natural disasters using artificial intelligence on natural science phenomena sciences.  \n \nIf you are like us and like fiddling with creating a super scalable website over the weekend or pushing to github like crazy; all over 50 cups of coffee, then this is a match made in heaven!  \n \nWe are currently looking for  \n1) Full Stack Software Engineers \n2) Full Stack Designers \n3) Data Scientists \n \nAlso, in general, we are always on the look out for amazing people.  \n \nHelp us build systems that matter. Contact us at careers@oneconcern.com One Concern, Inc is trying to make the world a safer place from natural disasters using artificial intelligence on natural science phenomena sciences.  \n \nIf you are like us and like fiddling with creating a super scalable website over the weekend or pushing to github like crazy; all over 50 cups of coffee, then this is a match made in heaven!  \n \nWe are currently looking for  \n1) Full Stack Software Engineers \n2) Full Stack Designers \n3) Data Scientists \n \nAlso, in general, we are always on the look out for amazing people.  \n \nHelp us build systems that matter. Contact us at careers@oneconcern.com Experience Co Founder and CEO One Concern, Inc. May 2015  – Present (4 months) Palo Alto, CA One Concern, Inc. fundamentally changes the way society plans for, responds to, and recovers from all types of emergencies and natural disasters. Resident Stanford Graduate School of Business January 2015  – Present (8 months) Stanford GSB Venture Studio Structural Design Intern Degenkolb Engineers January 2015  –  March 2015  (3 months) San Francisco, California Graduate Teaching Assistant Stanford University September 2014  –  December 2014  (4 months) CEE 280 - Advanced Structural Analysis with Professor Gregory Deierlein Graduate Research Assistant Stanford University July 2014  –  August 2014  (2 months) Rotation Algorithm for Earthquake Damage Estimation of MDOF Systems \n \nThe main objective of the study was to optimize the order of the polynomial, the number of sensors and their locations, resulting in minimum algorithm error for an MDOF system, thus facilitating the best estimate of damage. Several optimization techniques including genetic algorithm were also used to quickly arrive at sensor combinations having a reasonably acceptable error. \nProject Supervisor: Professor Anne Kiremidjian Structural Engineering Intern Hohbach-Lewin Structural and Civil Engineers June 2014  –  August 2014  (3 months) Graduate Teaching Assistant Stanford University April 2014  –  June 2014  (3 months) CEE 290 - Structural Performance and Failures with Professor Piotr Moncarz Assistant Manager (Civil Construction Department) NTPC August 2012  –  July 2013  (1 year) Solapur, Maharashtra Managing Teams of 8-10 engineers on-site. \nPlanning and execution of Main Plant and Offsite civil construction including boiler, ESP and other major structures \nPlanning and Execution of 275m high Twin Flue Chimney for 660X2 MW NTPC Solapur, using Slipform Arrangement Executive NTPC (National Thermal Power Corporation) Ltd. August 2011  –  July 2012  (1 year) Mouda Super Thermal Power Plant, Nagpur structural erection /  \ncoal accident analysis, risk quantification /  \nsite surveillance / project management Trainee (TAJ Dwarka Project) L&T Ltd., ECC Division December 2010  –  February 2011  (3 months) Involved in construction, planning and design activities (Top Down Construction) Co Founder and CEO One Concern, Inc. May 2015  – Present (4 months) Palo Alto, CA One Concern, Inc. fundamentally changes the way society plans for, responds to, and recovers from all types of emergencies and natural disasters. Co Founder and CEO One Concern, Inc. May 2015  – Present (4 months) Palo Alto, CA One Concern, Inc. fundamentally changes the way society plans for, responds to, and recovers from all types of emergencies and natural disasters. Resident Stanford Graduate School of Business January 2015  – Present (8 months) Stanford GSB Venture Studio Resident Stanford Graduate School of Business January 2015  – Present (8 months) Stanford GSB Venture Studio Structural Design Intern Degenkolb Engineers January 2015  –  March 2015  (3 months) San Francisco, California Structural Design Intern Degenkolb Engineers January 2015  –  March 2015  (3 months) San Francisco, California Graduate Teaching Assistant Stanford University September 2014  –  December 2014  (4 months) CEE 280 - Advanced Structural Analysis with Professor Gregory Deierlein Graduate Teaching Assistant Stanford University September 2014  –  December 2014  (4 months) CEE 280 - Advanced Structural Analysis with Professor Gregory Deierlein Graduate Research Assistant Stanford University July 2014  –  August 2014  (2 months) Rotation Algorithm for Earthquake Damage Estimation of MDOF Systems \n \nThe main objective of the study was to optimize the order of the polynomial, the number of sensors and their locations, resulting in minimum algorithm error for an MDOF system, thus facilitating the best estimate of damage. Several optimization techniques including genetic algorithm were also used to quickly arrive at sensor combinations having a reasonably acceptable error. \nProject Supervisor: Professor Anne Kiremidjian Graduate Research Assistant Stanford University July 2014  –  August 2014  (2 months) Rotation Algorithm for Earthquake Damage Estimation of MDOF Systems \n \nThe main objective of the study was to optimize the order of the polynomial, the number of sensors and their locations, resulting in minimum algorithm error for an MDOF system, thus facilitating the best estimate of damage. Several optimization techniques including genetic algorithm were also used to quickly arrive at sensor combinations having a reasonably acceptable error. \nProject Supervisor: Professor Anne Kiremidjian Structural Engineering Intern Hohbach-Lewin Structural and Civil Engineers June 2014  –  August 2014  (3 months) Structural Engineering Intern Hohbach-Lewin Structural and Civil Engineers June 2014  –  August 2014  (3 months) Graduate Teaching Assistant Stanford University April 2014  –  June 2014  (3 months) CEE 290 - Structural Performance and Failures with Professor Piotr Moncarz Graduate Teaching Assistant Stanford University April 2014  –  June 2014  (3 months) CEE 290 - Structural Performance and Failures with Professor Piotr Moncarz Assistant Manager (Civil Construction Department) NTPC August 2012  –  July 2013  (1 year) Solapur, Maharashtra Managing Teams of 8-10 engineers on-site. \nPlanning and execution of Main Plant and Offsite civil construction including boiler, ESP and other major structures \nPlanning and Execution of 275m high Twin Flue Chimney for 660X2 MW NTPC Solapur, using Slipform Arrangement Assistant Manager (Civil Construction Department) NTPC August 2012  –  July 2013  (1 year) Solapur, Maharashtra Managing Teams of 8-10 engineers on-site. \nPlanning and execution of Main Plant and Offsite civil construction including boiler, ESP and other major structures \nPlanning and Execution of 275m high Twin Flue Chimney for 660X2 MW NTPC Solapur, using Slipform Arrangement Executive NTPC (National Thermal Power Corporation) Ltd. August 2011  –  July 2012  (1 year) Mouda Super Thermal Power Plant, Nagpur structural erection /  \ncoal accident analysis, risk quantification /  \nsite surveillance / project management Executive NTPC (National Thermal Power Corporation) Ltd. August 2011  –  July 2012  (1 year) Mouda Super Thermal Power Plant, Nagpur structural erection /  \ncoal accident analysis, risk quantification /  \nsite surveillance / project management Trainee (TAJ Dwarka Project) L&T Ltd., ECC Division December 2010  –  February 2011  (3 months) Involved in construction, planning and design activities (Top Down Construction) Trainee (TAJ Dwarka Project) L&T Ltd., ECC Division December 2010  –  February 2011  (3 months) Involved in construction, planning and design activities (Top Down Construction) Languages   Skills Entrepreneurship Social Entrepreneurship OpenGL Structural Engineering Project Planning Civil Engineering Structural Analysis STAAD Primavera P6 Project Management Power Plants Bridge AutoCAD C++ Concrete Geotechnical Engineering Factory Construction Finite Element Analysis Structural Modeling Earthquake Resistant... Earthquake Engineering Construction Drawings Steel Structures Quantitative Risk... Disaster Risk Reduction Access Fire Safety Abaqus ANSYS ETABS MASTAN Matlab See 18+     See less Skills  Entrepreneurship Social Entrepreneurship OpenGL Structural Engineering Project Planning Civil Engineering Structural Analysis STAAD Primavera P6 Project Management Power Plants Bridge AutoCAD C++ Concrete Geotechnical Engineering Factory Construction Finite Element Analysis Structural Modeling Earthquake Resistant... Earthquake Engineering Construction Drawings Steel Structures Quantitative Risk... Disaster Risk Reduction Access Fire Safety Abaqus ANSYS ETABS MASTAN Matlab See 18+     See less Entrepreneurship Social Entrepreneurship OpenGL Structural Engineering Project Planning Civil Engineering Structural Analysis STAAD Primavera P6 Project Management Power Plants Bridge AutoCAD C++ Concrete Geotechnical Engineering Factory Construction Finite Element Analysis Structural Modeling Earthquake Resistant... Earthquake Engineering Construction Drawings Steel Structures Quantitative Risk... Disaster Risk Reduction Access Fire Safety Abaqus ANSYS ETABS MASTAN Matlab See 18+     See less Entrepreneurship Social Entrepreneurship OpenGL Structural Engineering Project Planning Civil Engineering Structural Analysis STAAD Primavera P6 Project Management Power Plants Bridge AutoCAD C++ Concrete Geotechnical Engineering Factory Construction Finite Element Analysis Structural Modeling Earthquake Resistant... Earthquake Engineering Construction Drawings Steel Structures Quantitative Risk... Disaster Risk Reduction Access Fire Safety Abaqus ANSYS ETABS MASTAN Matlab See 18+     See less Education Stanford University Master's Degree,  Structural Engineering 2013  – 2015 Activities and Societies:  Stanford Venture Studio National Institute of Technology, Srinagar B Tech (Civil Engineering),  Civil/ Structural/ Construction Engineering 2007  – 2011 Activities and Societies:  Chairman ,  Institution of Engineers ,  Students' chapter ,  NIT Srinagar\nGATE/ IES forum coordinator Tyndale Biscoe School Senior Secondary School 2005  – 2007 Burn Hall School Secondary School 1991  – 2005 Stanford University Master's Degree,  Structural Engineering 2013  – 2015 Activities and Societies:  Stanford Venture Studio Stanford University Master's Degree,  Structural Engineering 2013  – 2015 Activities and Societies:  Stanford Venture Studio Stanford University Master's Degree,  Structural Engineering 2013  – 2015 Activities and Societies:  Stanford Venture Studio National Institute of Technology, Srinagar B Tech (Civil Engineering),  Civil/ Structural/ Construction Engineering 2007  – 2011 Activities and Societies:  Chairman ,  Institution of Engineers ,  Students' chapter ,  NIT Srinagar\nGATE/ IES forum coordinator National Institute of Technology, Srinagar B Tech (Civil Engineering),  Civil/ Structural/ Construction Engineering 2007  – 2011 Activities and Societies:  Chairman ,  Institution of Engineers ,  Students' chapter ,  NIT Srinagar\nGATE/ IES forum coordinator National Institute of Technology, Srinagar B Tech (Civil Engineering),  Civil/ Structural/ Construction Engineering 2007  – 2011 Activities and Societies:  Chairman ,  Institution of Engineers ,  Students' chapter ,  NIT Srinagar\nGATE/ IES forum coordinator Tyndale Biscoe School Senior Secondary School 2005  – 2007 Tyndale Biscoe School Senior Secondary School 2005  – 2007 Tyndale Biscoe School Senior Secondary School 2005  – 2007 Burn Hall School Secondary School 1991  – 2005 Burn Hall School Secondary School 1991  – 2005 Burn Hall School Secondary School 1991  – 2005 Honors & Awards First Place (Stanford Data Science Challenge) December 2014 Predicting top trending news stories - Hackernews ‘Gold Medalist’ National Institute of Technology July 2011 (Institutional/ University Topper and Branch Topper) with a CGPA of 9.603 on 10 General Manager’s Award National Thermal Power Corporation, (NTPC) Solapur, India January 2013 Achieving the construction target (main plant boiler-I handover) 21 days ahead of schedule. First Place (Stanford Data Science Challenge) December 2014 Predicting top trending news stories - Hackernews First Place (Stanford Data Science Challenge) December 2014 Predicting top trending news stories - Hackernews First Place (Stanford Data Science Challenge) December 2014 Predicting top trending news stories - Hackernews ‘Gold Medalist’ National Institute of Technology July 2011 (Institutional/ University Topper and Branch Topper) with a CGPA of 9.603 on 10 ‘Gold Medalist’ National Institute of Technology July 2011 (Institutional/ University Topper and Branch Topper) with a CGPA of 9.603 on 10 ‘Gold Medalist’ National Institute of Technology July 2011 (Institutional/ University Topper and Branch Topper) with a CGPA of 9.603 on 10 General Manager’s Award National Thermal Power Corporation, (NTPC) Solapur, India January 2013 Achieving the construction target (main plant boiler-I handover) 21 days ahead of schedule. General Manager’s Award National Thermal Power Corporation, (NTPC) Solapur, India January 2013 Achieving the construction target (main plant boiler-I handover) 21 days ahead of schedule. General Manager’s Award National Thermal Power Corporation, (NTPC) Solapur, India January 2013 Achieving the construction target (main plant boiler-I handover) 21 days ahead of schedule. "]}