{"position": "Graduate Process Engineer", "company": "Intel Corporation", "profiles": ["Experience Process Engineer Intel Corporation October 2013  – Present (1 year 11 months) Ireland, Leixlip Researcher Internship Consiglio Nazionale delle Ricerche April 2013  –  October 2013  (7 months) Milan Area, Italy Supply Teacher ITI Galilei Crema Secondary School December 2009  –  January 2010  (2 months) Crema, Italy Mechanical Designer SCR Technical Office April 2007  –  April 2009  (2 years 1 month) Sergnano, Italy Process Engineer Intel Corporation October 2013  – Present (1 year 11 months) Ireland, Leixlip Process Engineer Intel Corporation October 2013  – Present (1 year 11 months) Ireland, Leixlip Researcher Internship Consiglio Nazionale delle Ricerche April 2013  –  October 2013  (7 months) Milan Area, Italy Researcher Internship Consiglio Nazionale delle Ricerche April 2013  –  October 2013  (7 months) Milan Area, Italy Supply Teacher ITI Galilei Crema Secondary School December 2009  –  January 2010  (2 months) Crema, Italy Supply Teacher ITI Galilei Crema Secondary School December 2009  –  January 2010  (2 months) Crema, Italy Mechanical Designer SCR Technical Office April 2007  –  April 2009  (2 years 1 month) Sergnano, Italy Mechanical Designer SCR Technical Office April 2007  –  April 2009  (2 years 1 month) Sergnano, Italy Languages Italian Native or bilingual proficiency English Professional working proficiency Italian Native or bilingual proficiency English Professional working proficiency Italian Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Mechanical Engineering Finite Element Analysis Curriculum Design Abaqus Autodesk Software Structural Engineering Matlab Materials Science Skills  Mechanical Engineering Finite Element Analysis Curriculum Design Abaqus Autodesk Software Structural Engineering Matlab Materials Science Mechanical Engineering Finite Element Analysis Curriculum Design Abaqus Autodesk Software Structural Engineering Matlab Materials Science Mechanical Engineering Finite Element Analysis Curriculum Design Abaqus Autodesk Software Structural Engineering Matlab Materials Science Education University of Bergamo Master of Science (MSc),  Mechanical Engineering , Cum laude 2011  – 2013 Fairleigh Dickinson University-Metropolitan Campus Exchange Program,  Mechanical Engineering 2012  – 2012 University of Bergamo Bachelor's degree,  Mechanical Engineering 2006  – 2011 University of Bergamo Master of Science (MSc),  Mechanical Engineering , Cum laude 2011  – 2013 University of Bergamo Master of Science (MSc),  Mechanical Engineering , Cum laude 2011  – 2013 University of Bergamo Master of Science (MSc),  Mechanical Engineering , Cum laude 2011  – 2013 Fairleigh Dickinson University-Metropolitan Campus Exchange Program,  Mechanical Engineering 2012  – 2012 Fairleigh Dickinson University-Metropolitan Campus Exchange Program,  Mechanical Engineering 2012  – 2012 Fairleigh Dickinson University-Metropolitan Campus Exchange Program,  Mechanical Engineering 2012  – 2012 University of Bergamo Bachelor's degree,  Mechanical Engineering 2006  – 2011 University of Bergamo Bachelor's degree,  Mechanical Engineering 2006  – 2011 University of Bergamo Bachelor's degree,  Mechanical Engineering 2006  – 2011 Honors & Awards ", "Experience Graduate Process Engineer Intel Corporation September 2013  – Present (2 years) Leixlip Student Dublin Institute of Technology 2008  –  2013  (5 years) Graduate Process Engineer Intel Corporation September 2013  – Present (2 years) Leixlip Graduate Process Engineer Intel Corporation September 2013  – Present (2 years) Leixlip Student Dublin Institute of Technology 2008  –  2013  (5 years) Student Dublin Institute of Technology 2008  –  2013  (5 years) Skills Solidworks AutoCAD ANSYS Heat Transfer Fluid Mechanics Mechanical Engineering Engineering Design Finite Element Analysis Microsoft Office Mechanics Mechanical Analysis Solid Modeling Thermodynamics Renewable Energy CFD Process Engineering Preventive Maintenance Electro-mechanical... Semiconductor Industry Semiconductor Process Wet Chemical Etching JMP See 7+     See less Skills  Solidworks AutoCAD ANSYS Heat Transfer Fluid Mechanics Mechanical Engineering Engineering Design Finite Element Analysis Microsoft Office Mechanics Mechanical Analysis Solid Modeling Thermodynamics Renewable Energy CFD Process Engineering Preventive Maintenance Electro-mechanical... Semiconductor Industry Semiconductor Process Wet Chemical Etching JMP See 7+     See less Solidworks AutoCAD ANSYS Heat Transfer Fluid Mechanics Mechanical Engineering Engineering Design Finite Element Analysis Microsoft Office Mechanics Mechanical Analysis Solid Modeling Thermodynamics Renewable Energy CFD Process Engineering Preventive Maintenance Electro-mechanical... Semiconductor Industry Semiconductor Process Wet Chemical Etching JMP See 7+     See less Solidworks AutoCAD ANSYS Heat Transfer Fluid Mechanics Mechanical Engineering Engineering Design Finite Element Analysis Microsoft Office Mechanics Mechanical Analysis Solid Modeling Thermodynamics Renewable Energy CFD Process Engineering Preventive Maintenance Electro-mechanical... Semiconductor Industry Semiconductor Process Wet Chemical Etching JMP See 7+     See less Education Dublin Institute of Technology Bachelor of Engineering (BEng),  Mechanical Engineering 2011  – 2013 Dublin Institute of Technology BEngTech,  Mechanical Engineering 2008  – 2011 Dublin Institute of Technology Bachelor of Engineering (BEng),  Mechanical Engineering 2011  – 2013 Dublin Institute of Technology Bachelor of Engineering (BEng),  Mechanical Engineering 2011  – 2013 Dublin Institute of Technology Bachelor of Engineering (BEng),  Mechanical Engineering 2011  – 2013 Dublin Institute of Technology BEngTech,  Mechanical Engineering 2008  – 2011 Dublin Institute of Technology BEngTech,  Mechanical Engineering 2008  – 2011 Dublin Institute of Technology BEngTech,  Mechanical Engineering 2008  – 2011 ", "Experience Graduate Process Engineer Intel Corporation November 2013  – Present (1 year 10 months) Dublin Applied Mathematics & Theoretical Physics Masters Student Dublin Institute of Technology September 2011  –  September 2013  (2 years 1 month) Theoretical Physics Student Trinity College Dublin September 2006  –  June 2011  (4 years 10 months) SS Theoretical Physics Student in TCD UREKA scholarship research assistant FOCAS Institute Dublin June 2010  –  September 2010  (4 months) UREKA scholarship research assistant at FOCAS Institute Dublin Graduate Process Engineer Intel Corporation November 2013  – Present (1 year 10 months) Dublin Graduate Process Engineer Intel Corporation November 2013  – Present (1 year 10 months) Dublin Applied Mathematics & Theoretical Physics Masters Student Dublin Institute of Technology September 2011  –  September 2013  (2 years 1 month) Applied Mathematics & Theoretical Physics Masters Student Dublin Institute of Technology September 2011  –  September 2013  (2 years 1 month) Theoretical Physics Student Trinity College Dublin September 2006  –  June 2011  (4 years 10 months) SS Theoretical Physics Student in TCD Theoretical Physics Student Trinity College Dublin September 2006  –  June 2011  (4 years 10 months) SS Theoretical Physics Student in TCD UREKA scholarship research assistant FOCAS Institute Dublin June 2010  –  September 2010  (4 months) UREKA scholarship research assistant at FOCAS Institute Dublin UREKA scholarship research assistant FOCAS Institute Dublin June 2010  –  September 2010  (4 months) UREKA scholarship research assistant at FOCAS Institute Dublin Skills Physics Research Spectroscopy Optics Nanotechnology Mathematics Skills  Physics Research Spectroscopy Optics Nanotechnology Mathematics Physics Research Spectroscopy Optics Nanotechnology Mathematics Physics Research Spectroscopy Optics Nanotechnology Mathematics Education Trinity College, Dublin B.A Mod,  Theoretical Physics 2006  – 2011 Trinity College, Dublin B.A Mod,  Theoretical Physics 2006  – 2011 Trinity College, Dublin B.A Mod,  Theoretical Physics 2006  – 2011 Trinity College, Dublin B.A Mod,  Theoretical Physics 2006  – 2011 ", "Experience Graduate Technical Engineer CDE Global Ltd July 2014  –  June 2015  (1 year) Graduate Process Engineer Intel Corporation 2015  –  2015  (less than a year) Graduate Technical Engineer CDE Global Ltd July 2014  –  June 2015  (1 year) Graduate Technical Engineer CDE Global Ltd July 2014  –  June 2015  (1 year) Graduate Process Engineer Intel Corporation 2015  –  2015  (less than a year) Graduate Process Engineer Intel Corporation 2015  –  2015  (less than a year) Skills SolidWorks AutoCAD Microsoft Office Engineering Product Development Manufacturing CAD Project Management Continuous Improvement Project Planning Engineering Management Project Engineering Mechanical Engineering Microsoft Project Skills  SolidWorks AutoCAD Microsoft Office Engineering Product Development Manufacturing CAD Project Management Continuous Improvement Project Planning Engineering Management Project Engineering Mechanical Engineering Microsoft Project SolidWorks AutoCAD Microsoft Office Engineering Product Development Manufacturing CAD Project Management Continuous Improvement Project Planning Engineering Management Project Engineering Mechanical Engineering Microsoft Project SolidWorks AutoCAD Microsoft Office Engineering Product Development Manufacturing CAD Project Management Continuous Improvement Project Planning Engineering Management Project Engineering Mechanical Engineering Microsoft Project Education Dublin Institute of Technology Master of Engineering (MEng),  Mechanical Engineering , 2.1 2013  – 2014 Dublin Institute of Technology Bachelor of Engineering (BEng),  Mechanical Engineering , 2.1 2011  – 2013 Dublin Institute of Technology BEng Tech,  Mechanical Engineering , Merit Upper Division 2008  – 2011 Dublin Institute of Technology Master of Engineering (MEng),  Mechanical Engineering , 2.1 2013  – 2014 Dublin Institute of Technology Master of Engineering (MEng),  Mechanical Engineering , 2.1 2013  – 2014 Dublin Institute of Technology Master of Engineering (MEng),  Mechanical Engineering , 2.1 2013  – 2014 Dublin Institute of Technology Bachelor of Engineering (BEng),  Mechanical Engineering , 2.1 2011  – 2013 Dublin Institute of Technology Bachelor of Engineering (BEng),  Mechanical Engineering , 2.1 2011  – 2013 Dublin Institute of Technology Bachelor of Engineering (BEng),  Mechanical Engineering , 2.1 2011  – 2013 Dublin Institute of Technology BEng Tech,  Mechanical Engineering , Merit Upper Division 2008  – 2011 Dublin Institute of Technology BEng Tech,  Mechanical Engineering , Merit Upper Division 2008  – 2011 Dublin Institute of Technology BEng Tech,  Mechanical Engineering , Merit Upper Division 2008  – 2011 ", "Summary  Photolithography engineer in high volume manufacturing environment,  \nowner of fleet of lithography scanners and responsible of technology  \ntransfer, production and sustaining. Previously worked on the micro-fabrication  \nand characterization of piezoelectric and superconductive devices during PhD. \n Summary  Photolithography engineer in high volume manufacturing environment,  \nowner of fleet of lithography scanners and responsible of technology  \ntransfer, production and sustaining. Previously worked on the micro-fabrication  \nand characterization of piezoelectric and superconductive devices during PhD. \n  Photolithography engineer in high volume manufacturing environment,  \nowner of fleet of lithography scanners and responsible of technology  \ntransfer, production and sustaining. Previously worked on the micro-fabrication  \nand characterization of piezoelectric and superconductive devices during PhD. \n  Photolithography engineer in high volume manufacturing environment,  \nowner of fleet of lithography scanners and responsible of technology  \ntransfer, production and sustaining. Previously worked on the micro-fabrication  \nand characterization of piezoelectric and superconductive devices during PhD. \n Experience Graduate Process Engineer Intel Corporation September 2012  – Present (3 years) Leixlip (Dublin) (February –July 2014 working at Intel site in Ronler Acres Hillsboro OR). My core duties include sustaining and improvement of the lithography scanner equipments and associated process performance, excursion prevention, process and equipment improvements using statistical process control methods. I am also responsible for the technology transfer of my scanner equipments from the Intel developing site to the Intel site in Ireland. PHD & Postgraduate teaching assistant University of Birmingham September 2008  –  December 2011  (3 years 4 months) Activity of teaching assistance in the following fields: \ndesign of basic logic circuits, design and implementation of finite state machines and introduction to the use of C programming for embedded computing.  \nFundamental methodologies and techniques for qualitative and quantitative analysis of signals and systems. Internship CNR-IMM May 2007  –  June 2007  (2 months) Investigation on a silicon nanograin cluster. \nSimulation of the cluster strucure (by using the Atlas simulator) to work out the capacitive coefficients of a silicon nanograin, and comparison with the STM (Scanning tunneling microscope) measurements. Internship STMicroelectronics May 2004  –  September 2004  (5 months) Characterization of D.I.B. (Dielectrically isolated BICMOS) mos and bipolar transistor for rad hard applications. Graduate Process Engineer Intel Corporation September 2012  – Present (3 years) Leixlip (Dublin) (February –July 2014 working at Intel site in Ronler Acres Hillsboro OR). My core duties include sustaining and improvement of the lithography scanner equipments and associated process performance, excursion prevention, process and equipment improvements using statistical process control methods. I am also responsible for the technology transfer of my scanner equipments from the Intel developing site to the Intel site in Ireland. Graduate Process Engineer Intel Corporation September 2012  – Present (3 years) Leixlip (Dublin) (February –July 2014 working at Intel site in Ronler Acres Hillsboro OR). My core duties include sustaining and improvement of the lithography scanner equipments and associated process performance, excursion prevention, process and equipment improvements using statistical process control methods. I am also responsible for the technology transfer of my scanner equipments from the Intel developing site to the Intel site in Ireland. PHD & Postgraduate teaching assistant University of Birmingham September 2008  –  December 2011  (3 years 4 months) Activity of teaching assistance in the following fields: \ndesign of basic logic circuits, design and implementation of finite state machines and introduction to the use of C programming for embedded computing.  \nFundamental methodologies and techniques for qualitative and quantitative analysis of signals and systems. PHD & Postgraduate teaching assistant University of Birmingham September 2008  –  December 2011  (3 years 4 months) Activity of teaching assistance in the following fields: \ndesign of basic logic circuits, design and implementation of finite state machines and introduction to the use of C programming for embedded computing.  \nFundamental methodologies and techniques for qualitative and quantitative analysis of signals and systems. Internship CNR-IMM May 2007  –  June 2007  (2 months) Investigation on a silicon nanograin cluster. \nSimulation of the cluster strucure (by using the Atlas simulator) to work out the capacitive coefficients of a silicon nanograin, and comparison with the STM (Scanning tunneling microscope) measurements. Internship CNR-IMM May 2007  –  June 2007  (2 months) Investigation on a silicon nanograin cluster. \nSimulation of the cluster strucure (by using the Atlas simulator) to work out the capacitive coefficients of a silicon nanograin, and comparison with the STM (Scanning tunneling microscope) measurements. Internship STMicroelectronics May 2004  –  September 2004  (5 months) Characterization of D.I.B. (Dielectrically isolated BICMOS) mos and bipolar transistor for rad hard applications. Internship STMicroelectronics May 2004  –  September 2004  (5 months) Characterization of D.I.B. (Dielectrically isolated BICMOS) mos and bipolar transistor for rad hard applications. Skills Photolithography AFM Thin Films Characterization Materials Science Depositions Clean Rooms Vacuum Systems Data Acquisition Etching Semiconductor Industry Semiconductor Process Semiconductor... Wet Etching Labview XRD Programmable Logic X-ray Diffraction... Pulsed Laser Deposition SPC Semiconductors LaTex Microelectronics Six Sigma LabVIEW LaTeX See 11+     See less Skills  Photolithography AFM Thin Films Characterization Materials Science Depositions Clean Rooms Vacuum Systems Data Acquisition Etching Semiconductor Industry Semiconductor Process Semiconductor... Wet Etching Labview XRD Programmable Logic X-ray Diffraction... Pulsed Laser Deposition SPC Semiconductors LaTex Microelectronics Six Sigma LabVIEW LaTeX See 11+     See less Photolithography AFM Thin Films Characterization Materials Science Depositions Clean Rooms Vacuum Systems Data Acquisition Etching Semiconductor Industry Semiconductor Process Semiconductor... Wet Etching Labview XRD Programmable Logic X-ray Diffraction... Pulsed Laser Deposition SPC Semiconductors LaTex Microelectronics Six Sigma LabVIEW LaTeX See 11+     See less Photolithography AFM Thin Films Characterization Materials Science Depositions Clean Rooms Vacuum Systems Data Acquisition Etching Semiconductor Industry Semiconductor Process Semiconductor... Wet Etching Labview XRD Programmable Logic X-ray Diffraction... Pulsed Laser Deposition SPC Semiconductors LaTex Microelectronics Six Sigma LabVIEW LaTeX See 11+     See less Education School of Electrical Electronic and Computer Engineering, Univesity of Birmingham PHD,  Electronic engineering 2008  – 2011 Projects: \n-Fabrication and investigation of Josephson junctions involving oxide superconductors \n-Fabrication and investigation of piezoelectric devices for microscale energy generation. \nAcquired skills: Pulsed laser deposition, optical photolithography, argon ion beam milling, wet etching, Atomic force microscope investigation, Wirebonding, X-ray diffraction, clean room experience, experience with vacuum systems, electrical measurements in cryostatic setup, impedance measurements, hysteresis loop measurements for ferroelectric materials, real time data acquisition by using the labview environment. Università di Catania Master degree (Laurea specialistica) 110/110 with honours,  Microelectronic Engineering 2004  – 2007 Thesis: \"Spectroscopy on silicon nanograins\" \nThis work has been developed at DMFCI (Dipartimento di metodologie chimiche e fisiche per l'ingegneria) Catania and at IMM-CNR, section of Catania. Università di Catania Degree (Laurea triennale),  110/110 Electronic Engineering 2001  – 2004 Thesis: \n\"Characterization of DIB devices for rad hard application\". \n \nFour month stage (May-September 2004) at STMicroelectonics (Catania site) for thesis development. Activities and Societies:  Thesis:\n\"Characterization of DIB devices for rad hard application\" Liceo Scientifico Statale Michele Amari di Giarre sezione di Linguaglossa 1996  – 2001 School of Electrical Electronic and Computer Engineering, Univesity of Birmingham PHD,  Electronic engineering 2008  – 2011 Projects: \n-Fabrication and investigation of Josephson junctions involving oxide superconductors \n-Fabrication and investigation of piezoelectric devices for microscale energy generation. \nAcquired skills: Pulsed laser deposition, optical photolithography, argon ion beam milling, wet etching, Atomic force microscope investigation, Wirebonding, X-ray diffraction, clean room experience, experience with vacuum systems, electrical measurements in cryostatic setup, impedance measurements, hysteresis loop measurements for ferroelectric materials, real time data acquisition by using the labview environment. School of Electrical Electronic and Computer Engineering, Univesity of Birmingham PHD,  Electronic engineering 2008  – 2011 Projects: \n-Fabrication and investigation of Josephson junctions involving oxide superconductors \n-Fabrication and investigation of piezoelectric devices for microscale energy generation. \nAcquired skills: Pulsed laser deposition, optical photolithography, argon ion beam milling, wet etching, Atomic force microscope investigation, Wirebonding, X-ray diffraction, clean room experience, experience with vacuum systems, electrical measurements in cryostatic setup, impedance measurements, hysteresis loop measurements for ferroelectric materials, real time data acquisition by using the labview environment. School of Electrical Electronic and Computer Engineering, Univesity of Birmingham PHD,  Electronic engineering 2008  – 2011 Projects: \n-Fabrication and investigation of Josephson junctions involving oxide superconductors \n-Fabrication and investigation of piezoelectric devices for microscale energy generation. \nAcquired skills: Pulsed laser deposition, optical photolithography, argon ion beam milling, wet etching, Atomic force microscope investigation, Wirebonding, X-ray diffraction, clean room experience, experience with vacuum systems, electrical measurements in cryostatic setup, impedance measurements, hysteresis loop measurements for ferroelectric materials, real time data acquisition by using the labview environment. Università di Catania Master degree (Laurea specialistica) 110/110 with honours,  Microelectronic Engineering 2004  – 2007 Thesis: \"Spectroscopy on silicon nanograins\" \nThis work has been developed at DMFCI (Dipartimento di metodologie chimiche e fisiche per l'ingegneria) Catania and at IMM-CNR, section of Catania. Università di Catania Master degree (Laurea specialistica) 110/110 with honours,  Microelectronic Engineering 2004  – 2007 Thesis: \"Spectroscopy on silicon nanograins\" \nThis work has been developed at DMFCI (Dipartimento di metodologie chimiche e fisiche per l'ingegneria) Catania and at IMM-CNR, section of Catania. Università di Catania Master degree (Laurea specialistica) 110/110 with honours,  Microelectronic Engineering 2004  – 2007 Thesis: \"Spectroscopy on silicon nanograins\" \nThis work has been developed at DMFCI (Dipartimento di metodologie chimiche e fisiche per l'ingegneria) Catania and at IMM-CNR, section of Catania. Università di Catania Degree (Laurea triennale),  110/110 Electronic Engineering 2001  – 2004 Thesis: \n\"Characterization of DIB devices for rad hard application\". \n \nFour month stage (May-September 2004) at STMicroelectonics (Catania site) for thesis development. Activities and Societies:  Thesis:\n\"Characterization of DIB devices for rad hard application\" Università di Catania Degree (Laurea triennale),  110/110 Electronic Engineering 2001  – 2004 Thesis: \n\"Characterization of DIB devices for rad hard application\". \n \nFour month stage (May-September 2004) at STMicroelectonics (Catania site) for thesis development. Activities and Societies:  Thesis:\n\"Characterization of DIB devices for rad hard application\" Università di Catania Degree (Laurea triennale),  110/110 Electronic Engineering 2001  – 2004 Thesis: \n\"Characterization of DIB devices for rad hard application\". \n \nFour month stage (May-September 2004) at STMicroelectonics (Catania site) for thesis development. Activities and Societies:  Thesis:\n\"Characterization of DIB devices for rad hard application\" Liceo Scientifico Statale Michele Amari di Giarre sezione di Linguaglossa 1996  – 2001 Liceo Scientifico Statale Michele Amari di Giarre sezione di Linguaglossa 1996  – 2001 Liceo Scientifico Statale Michele Amari di Giarre sezione di Linguaglossa 1996  – 2001 ", "Experience Process Chemist Eli Lilly and Company January 2015  – Present (8 months) Graduate Process Engineer Intel Corporation December 2013  –  January 2015  (1 year 2 months) PhD student University College Dublin September 2009  –  November 2013  (4 years 3 months) Final year PhD candidate in Chemistry: ‘Applications of oxazoline-containing ligands in asymmetric catalysis’ under the supervision of Prof. Patrick Guiry. \nCollaboration with Bristol-Myers-Squibb: ‘Study into the kinetics of arginine imine formation’ under the supervision of Prof. Rory More O’ Ferrall.  \nDublin Chemistry Graduate Programme - modules completed: ‘Catalylic Asymmetric Synthesis’, ‘Synthetic Chemistry Masterclass’, ‘Environmental Chemistry Masterclass’ (Grades –Distinction). Research and Development Chemist Henkel June 2011  –  August 2011  (3 months) My internship at Henkel centred around the synthesis of a new adhesive for rubber to metal bonding. Process Chemist Eli Lilly and Company January 2015  – Present (8 months) Process Chemist Eli Lilly and Company January 2015  – Present (8 months) Graduate Process Engineer Intel Corporation December 2013  –  January 2015  (1 year 2 months) Graduate Process Engineer Intel Corporation December 2013  –  January 2015  (1 year 2 months) PhD student University College Dublin September 2009  –  November 2013  (4 years 3 months) Final year PhD candidate in Chemistry: ‘Applications of oxazoline-containing ligands in asymmetric catalysis’ under the supervision of Prof. Patrick Guiry. \nCollaboration with Bristol-Myers-Squibb: ‘Study into the kinetics of arginine imine formation’ under the supervision of Prof. Rory More O’ Ferrall.  \nDublin Chemistry Graduate Programme - modules completed: ‘Catalylic Asymmetric Synthesis’, ‘Synthetic Chemistry Masterclass’, ‘Environmental Chemistry Masterclass’ (Grades –Distinction). PhD student University College Dublin September 2009  –  November 2013  (4 years 3 months) Final year PhD candidate in Chemistry: ‘Applications of oxazoline-containing ligands in asymmetric catalysis’ under the supervision of Prof. Patrick Guiry. \nCollaboration with Bristol-Myers-Squibb: ‘Study into the kinetics of arginine imine formation’ under the supervision of Prof. Rory More O’ Ferrall.  \nDublin Chemistry Graduate Programme - modules completed: ‘Catalylic Asymmetric Synthesis’, ‘Synthetic Chemistry Masterclass’, ‘Environmental Chemistry Masterclass’ (Grades –Distinction). Research and Development Chemist Henkel June 2011  –  August 2011  (3 months) My internship at Henkel centred around the synthesis of a new adhesive for rubber to metal bonding. Research and Development Chemist Henkel June 2011  –  August 2011  (3 months) My internship at Henkel centred around the synthesis of a new adhesive for rubber to metal bonding. Skills NMR spectroscopy Mass Spectrometry NMR Chemistry Organic Synthesis Organic Chemistry Organometallic Chemistry Analytical Chemistry HPLC Spectroscopy Science IR Chromatography UV/Vis Gas Chromatography Scientific Writing Purification Protein Chemistry Characterization Synthetic Organic... ChemDraw LC-MS IR Spectroscopy See 8+     See less Skills  NMR spectroscopy Mass Spectrometry NMR Chemistry Organic Synthesis Organic Chemistry Organometallic Chemistry Analytical Chemistry HPLC Spectroscopy Science IR Chromatography UV/Vis Gas Chromatography Scientific Writing Purification Protein Chemistry Characterization Synthetic Organic... ChemDraw LC-MS IR Spectroscopy See 8+     See less NMR spectroscopy Mass Spectrometry NMR Chemistry Organic Synthesis Organic Chemistry Organometallic Chemistry Analytical Chemistry HPLC Spectroscopy Science IR Chromatography UV/Vis Gas Chromatography Scientific Writing Purification Protein Chemistry Characterization Synthetic Organic... ChemDraw LC-MS IR Spectroscopy See 8+     See less NMR spectroscopy Mass Spectrometry NMR Chemistry Organic Synthesis Organic Chemistry Organometallic Chemistry Analytical Chemistry HPLC Spectroscopy Science IR Chromatography UV/Vis Gas Chromatography Scientific Writing Purification Protein Chemistry Characterization Synthetic Organic... ChemDraw LC-MS IR Spectroscopy See 8+     See less Education University College Dublin Bachelor of Science (BSc),  Chemistry , 1st Class Honours 2005  – 2009 University College Dublin Bachelor of Science (BSc),  Chemistry , 1st Class Honours 2005  – 2009 University College Dublin Bachelor of Science (BSc),  Chemistry , 1st Class Honours 2005  – 2009 University College Dublin Bachelor of Science (BSc),  Chemistry , 1st Class Honours 2005  – 2009 ", "Experience Process Engineer Intel Corporation January 2013  – Present (2 years 8 months) Leixlip, Kildare Graduate Process Engineer Intel Corporation August 2012  –  December 2012  (5 months) Intel, Leixlip, Ireland Lifeguard / Swimming Teacher Portarlington Leisure Centre September 2011  –  November 2012  (1 year 3 months) Portarlington Lifeguard swimming pool and teach swimming lessons as required Lifeguard Ballyfermot Leisure Centre June 2009  –  June 2011  (2 years 1 month) lifeguard swimming pool and teach swimming lessons as required Process Engineer Intel Corporation January 2013  – Present (2 years 8 months) Leixlip, Kildare Process Engineer Intel Corporation January 2013  – Present (2 years 8 months) Leixlip, Kildare Graduate Process Engineer Intel Corporation August 2012  –  December 2012  (5 months) Intel, Leixlip, Ireland Graduate Process Engineer Intel Corporation August 2012  –  December 2012  (5 months) Intel, Leixlip, Ireland Lifeguard / Swimming Teacher Portarlington Leisure Centre September 2011  –  November 2012  (1 year 3 months) Portarlington Lifeguard swimming pool and teach swimming lessons as required Lifeguard / Swimming Teacher Portarlington Leisure Centre September 2011  –  November 2012  (1 year 3 months) Portarlington Lifeguard swimming pool and teach swimming lessons as required Lifeguard Ballyfermot Leisure Centre June 2009  –  June 2011  (2 years 1 month) lifeguard swimming pool and teach swimming lessons as required Lifeguard Ballyfermot Leisure Centre June 2009  –  June 2011  (2 years 1 month) lifeguard swimming pool and teach swimming lessons as required Skills AutoCAD Programming Solidworks Microsoft Office ANSYS Microsoft Excel Teamwork Microsoft Word PowerPoint SQL JMP MS Project Visual Basic Engineering Manufacturing Data Analysis See 1+     See less Skills  AutoCAD Programming Solidworks Microsoft Office ANSYS Microsoft Excel Teamwork Microsoft Word PowerPoint SQL JMP MS Project Visual Basic Engineering Manufacturing Data Analysis See 1+     See less AutoCAD Programming Solidworks Microsoft Office ANSYS Microsoft Excel Teamwork Microsoft Word PowerPoint SQL JMP MS Project Visual Basic Engineering Manufacturing Data Analysis See 1+     See less AutoCAD Programming Solidworks Microsoft Office ANSYS Microsoft Excel Teamwork Microsoft Word PowerPoint SQL JMP MS Project Visual Basic Engineering Manufacturing Data Analysis See 1+     See less Education IT Carlow Bachelor of Engineering,  Mechanical Engineering (Honours) , Merit Grade 2 2011  – 2012 IT Carlow Bachelor of Engineering,  Mechanical Engineering (Ordinary) , Pass 2009  – 2011 IT Carlow Bachelor of Engineering,  Aircraft Systems , Merit Grade 1 2006  – 2009 IT Carlow Bachelor of Engineering,  Mechanical Engineering (Honours) , Merit Grade 2 2011  – 2012 IT Carlow Bachelor of Engineering,  Mechanical Engineering (Honours) , Merit Grade 2 2011  – 2012 IT Carlow Bachelor of Engineering,  Mechanical Engineering (Honours) , Merit Grade 2 2011  – 2012 IT Carlow Bachelor of Engineering,  Mechanical Engineering (Ordinary) , Pass 2009  – 2011 IT Carlow Bachelor of Engineering,  Mechanical Engineering (Ordinary) , Pass 2009  – 2011 IT Carlow Bachelor of Engineering,  Mechanical Engineering (Ordinary) , Pass 2009  – 2011 IT Carlow Bachelor of Engineering,  Aircraft Systems , Merit Grade 1 2006  – 2009 IT Carlow Bachelor of Engineering,  Aircraft Systems , Merit Grade 1 2006  – 2009 IT Carlow Bachelor of Engineering,  Aircraft Systems , Merit Grade 1 2006  – 2009 ", "Summary Currently an on shift Process Engineer at Intel Ireland. Demonstrated capability in problem solving, decision making, prioritization, results orientation and communication.  \n \n \n Summary Currently an on shift Process Engineer at Intel Ireland. Demonstrated capability in problem solving, decision making, prioritization, results orientation and communication.  \n \n \n Currently an on shift Process Engineer at Intel Ireland. Demonstrated capability in problem solving, decision making, prioritization, results orientation and communication.  \n \n \n Currently an on shift Process Engineer at Intel Ireland. Demonstrated capability in problem solving, decision making, prioritization, results orientation and communication.  \n \n \n Experience Graduate Process Engineer Intel Corporation February 2013  – Present (2 years 7 months) Ireland Student Ambassador Kingston University February 2012  –  September 2012  (8 months) Kingston upon Thames, United Kingdom As a student ambassador I share my experiences of third level education with a wide range of people to demonstrate that university is a viable option for anyone who wants to go. I also take part in running and supporting various events run by the university including open days and revision sessions aimed at second level students. Stage Manager Company D November 2007  –  January 2011  (3 years 3 months) Dublin, Republic Of Ireland I was the stage manager for an amateur theatre company that had recently formed known as Company D. My role was to support the actors wherever possible and ensure that each performance ran as smoothly as possible. This required the ability to think on my feet and be able to deal with problems as they arose and the flexibility to adapt to the needs of each show. Intern Formulation Chemist Oriflame February 2008  –  August 2008  (7 months) Wicklow, Republic of Ireland During my time at Oriflame I took on a project to introduce new natural deodorant actives. I tested potential materials in formulation and checking them for stability and efficacy. I also assissted in the testing and refining of products developed by other chemists working in the company Special Needs Assisstant Scoil Chiaran July 2004  –  July 2006  (2 years 1 month) Dublin, Republic of Ireland The summer program ran for the month of July and I worked there for three consecutive summers. I worked as a teachers assistant with children between the ages of four and thirteen who had various levels of Autism. Involved working with children who had behavioural problems both moderate and severe. The work included, but was not limited to, teaching basic hygiene skills, hand eye coordination, social skills and academic skills of reading, writing and arithmetic. The job required a great deal of patience and the ability to work calmly in a stressful environment. It often required the ability to take in and process a situation quickly and make instant judgements due to the unpredictable nature of the students Graduate Process Engineer Intel Corporation February 2013  – Present (2 years 7 months) Ireland Graduate Process Engineer Intel Corporation February 2013  – Present (2 years 7 months) Ireland Student Ambassador Kingston University February 2012  –  September 2012  (8 months) Kingston upon Thames, United Kingdom As a student ambassador I share my experiences of third level education with a wide range of people to demonstrate that university is a viable option for anyone who wants to go. I also take part in running and supporting various events run by the university including open days and revision sessions aimed at second level students. Student Ambassador Kingston University February 2012  –  September 2012  (8 months) Kingston upon Thames, United Kingdom As a student ambassador I share my experiences of third level education with a wide range of people to demonstrate that university is a viable option for anyone who wants to go. I also take part in running and supporting various events run by the university including open days and revision sessions aimed at second level students. Stage Manager Company D November 2007  –  January 2011  (3 years 3 months) Dublin, Republic Of Ireland I was the stage manager for an amateur theatre company that had recently formed known as Company D. My role was to support the actors wherever possible and ensure that each performance ran as smoothly as possible. This required the ability to think on my feet and be able to deal with problems as they arose and the flexibility to adapt to the needs of each show. Stage Manager Company D November 2007  –  January 2011  (3 years 3 months) Dublin, Republic Of Ireland I was the stage manager for an amateur theatre company that had recently formed known as Company D. My role was to support the actors wherever possible and ensure that each performance ran as smoothly as possible. This required the ability to think on my feet and be able to deal with problems as they arose and the flexibility to adapt to the needs of each show. Intern Formulation Chemist Oriflame February 2008  –  August 2008  (7 months) Wicklow, Republic of Ireland During my time at Oriflame I took on a project to introduce new natural deodorant actives. I tested potential materials in formulation and checking them for stability and efficacy. I also assissted in the testing and refining of products developed by other chemists working in the company Intern Formulation Chemist Oriflame February 2008  –  August 2008  (7 months) Wicklow, Republic of Ireland During my time at Oriflame I took on a project to introduce new natural deodorant actives. I tested potential materials in formulation and checking them for stability and efficacy. I also assissted in the testing and refining of products developed by other chemists working in the company Special Needs Assisstant Scoil Chiaran July 2004  –  July 2006  (2 years 1 month) Dublin, Republic of Ireland The summer program ran for the month of July and I worked there for three consecutive summers. I worked as a teachers assistant with children between the ages of four and thirteen who had various levels of Autism. Involved working with children who had behavioural problems both moderate and severe. The work included, but was not limited to, teaching basic hygiene skills, hand eye coordination, social skills and academic skills of reading, writing and arithmetic. The job required a great deal of patience and the ability to work calmly in a stressful environment. It often required the ability to take in and process a situation quickly and make instant judgements due to the unpredictable nature of the students Special Needs Assisstant Scoil Chiaran July 2004  –  July 2006  (2 years 1 month) Dublin, Republic of Ireland The summer program ran for the month of July and I worked there for three consecutive summers. I worked as a teachers assistant with children between the ages of four and thirteen who had various levels of Autism. Involved working with children who had behavioural problems both moderate and severe. The work included, but was not limited to, teaching basic hygiene skills, hand eye coordination, social skills and academic skills of reading, writing and arithmetic. The job required a great deal of patience and the ability to work calmly in a stressful environment. It often required the ability to take in and process a situation quickly and make instant judgements due to the unpredictable nature of the students Skills Microsoft Word Microsoft Excel PowerPoint Creative Writing Communication Always Willing to Learn Jiu-Jitsu Taekwondo SpinWorks Skills  Microsoft Word Microsoft Excel PowerPoint Creative Writing Communication Always Willing to Learn Jiu-Jitsu Taekwondo SpinWorks Microsoft Word Microsoft Excel PowerPoint Creative Writing Communication Always Willing to Learn Jiu-Jitsu Taekwondo SpinWorks Microsoft Word Microsoft Excel PowerPoint Creative Writing Communication Always Willing to Learn Jiu-Jitsu Taekwondo SpinWorks Education Kingston University Master of Science (MSc),  Forensic Analysis 2011  – 2012 Completed a Masters in Forensic Analysis graduating with distinction. This masters included a dissertation project involving GC-MS, HPLC-MS and H1 NMR analysis Activities and Societies:  Class Rep ,  Jiu Jitsu Dublin Institute of Technology Bachelor of Science (BSc),  Forensic and Environmental Analysis , 2.2 2005  – 2010 Thesis: Development and Validation of a Method to Analyse Preservatives in Cosmetics using HPLC-UV and GC-MS Activities and Societies:  Governing Council ,  Class Rep ,  Drama Society St. Mary's Holy Faith, Secondary School Honours,  English A2 ,  Maths D3 , French C3, Physics C2, Chemistry C3,  Geography B2 1998  – 2005 Ordinary: Irish B1 Activities and Societies:  Volleyball ,  Swimming ,  Athletics ,  Badminton Kingston University Master of Science (MSc),  Forensic Analysis 2011  – 2012 Completed a Masters in Forensic Analysis graduating with distinction. This masters included a dissertation project involving GC-MS, HPLC-MS and H1 NMR analysis Activities and Societies:  Class Rep ,  Jiu Jitsu Kingston University Master of Science (MSc),  Forensic Analysis 2011  – 2012 Completed a Masters in Forensic Analysis graduating with distinction. This masters included a dissertation project involving GC-MS, HPLC-MS and H1 NMR analysis Activities and Societies:  Class Rep ,  Jiu Jitsu Kingston University Master of Science (MSc),  Forensic Analysis 2011  – 2012 Completed a Masters in Forensic Analysis graduating with distinction. This masters included a dissertation project involving GC-MS, HPLC-MS and H1 NMR analysis Activities and Societies:  Class Rep ,  Jiu Jitsu Dublin Institute of Technology Bachelor of Science (BSc),  Forensic and Environmental Analysis , 2.2 2005  – 2010 Thesis: Development and Validation of a Method to Analyse Preservatives in Cosmetics using HPLC-UV and GC-MS Activities and Societies:  Governing Council ,  Class Rep ,  Drama Society Dublin Institute of Technology Bachelor of Science (BSc),  Forensic and Environmental Analysis , 2.2 2005  – 2010 Thesis: Development and Validation of a Method to Analyse Preservatives in Cosmetics using HPLC-UV and GC-MS Activities and Societies:  Governing Council ,  Class Rep ,  Drama Society Dublin Institute of Technology Bachelor of Science (BSc),  Forensic and Environmental Analysis , 2.2 2005  – 2010 Thesis: Development and Validation of a Method to Analyse Preservatives in Cosmetics using HPLC-UV and GC-MS Activities and Societies:  Governing Council ,  Class Rep ,  Drama Society St. Mary's Holy Faith, Secondary School Honours,  English A2 ,  Maths D3 , French C3, Physics C2, Chemistry C3,  Geography B2 1998  – 2005 Ordinary: Irish B1 Activities and Societies:  Volleyball ,  Swimming ,  Athletics ,  Badminton St. Mary's Holy Faith, Secondary School Honours,  English A2 ,  Maths D3 , French C3, Physics C2, Chemistry C3,  Geography B2 1998  – 2005 Ordinary: Irish B1 Activities and Societies:  Volleyball ,  Swimming ,  Athletics ,  Badminton St. Mary's Holy Faith, Secondary School Honours,  English A2 ,  Maths D3 , French C3, Physics C2, Chemistry C3,  Geography B2 1998  – 2005 Ordinary: Irish B1 Activities and Societies:  Volleyball ,  Swimming ,  Athletics ,  Badminton Honors & Awards Gaisce - The Presidents Award (Silver) The President of the Republic of Ireland May 2003 The Presidents Award is the highest award a civilian in Ireland can receive. There are three levels, gold, silver and bronze and the award is issued once the requirements in four areas are met. The areas are community involvement, personal skill, physical recreation and adventure journey. I achieved the bronze and silver while at St Mary's Secondary School Gaisce - The Presidents Award (Silver) The President of the Republic of Ireland May 2003 The Presidents Award is the highest award a civilian in Ireland can receive. There are three levels, gold, silver and bronze and the award is issued once the requirements in four areas are met. The areas are community involvement, personal skill, physical recreation and adventure journey. I achieved the bronze and silver while at St Mary's Secondary School Gaisce - The Presidents Award (Silver) The President of the Republic of Ireland May 2003 The Presidents Award is the highest award a civilian in Ireland can receive. There are three levels, gold, silver and bronze and the award is issued once the requirements in four areas are met. The areas are community involvement, personal skill, physical recreation and adventure journey. I achieved the bronze and silver while at St Mary's Secondary School Gaisce - The Presidents Award (Silver) The President of the Republic of Ireland May 2003 The Presidents Award is the highest award a civilian in Ireland can receive. There are three levels, gold, silver and bronze and the award is issued once the requirements in four areas are met. The areas are community involvement, personal skill, physical recreation and adventure journey. I achieved the bronze and silver while at St Mary's Secondary School ", "Summary Motivated and creative young researcher interested in all areas of science particularly semiconductor physics, astrophysics, geophysics and nuclear science. My experience of working at Intel, Inc. (Ireland), CERN (Switzerland), Linköping University (Sweden) and Dublin City University (Ireland) has shown me the class and organisation required to work in modern research and engineering.  \n \nI have formed long-lasting relationships with scientists and non-scientists alike from various institutions in my roles and the work I've performed has lead to several publications in high impact peer-reviewed scientific journals. \n \nI have also presented my work many times to the scientific community and the broader public, both as a speaker and at poster sessions/competitions, particularly at MRS Boston (a major semiconductor science conference) where I was a speaker. \n \nI am interested in scientific outreach and communication and have an established record of successfully presenting my work to the scientific and broader community. I have received several awards for my presentations, both as a speaker and for poster presentations. I have also acted as a reviewer for publications submitted to peer-reviewed journals such as Chemical Physics Letters and Journal of Applied Physics. \n \nI was a volunteer at the very successful Festival of Curiosity event in Dublin, Ireland in 2013 and 2014 which attracted more than 30,000 attendees. I also volunteered at the BT Young Scientist Competition in 2013 working at the Institute of Physics exhibit showcasing physics to young and old visitors. Summary Motivated and creative young researcher interested in all areas of science particularly semiconductor physics, astrophysics, geophysics and nuclear science. My experience of working at Intel, Inc. (Ireland), CERN (Switzerland), Linköping University (Sweden) and Dublin City University (Ireland) has shown me the class and organisation required to work in modern research and engineering.  \n \nI have formed long-lasting relationships with scientists and non-scientists alike from various institutions in my roles and the work I've performed has lead to several publications in high impact peer-reviewed scientific journals. \n \nI have also presented my work many times to the scientific community and the broader public, both as a speaker and at poster sessions/competitions, particularly at MRS Boston (a major semiconductor science conference) where I was a speaker. \n \nI am interested in scientific outreach and communication and have an established record of successfully presenting my work to the scientific and broader community. I have received several awards for my presentations, both as a speaker and for poster presentations. I have also acted as a reviewer for publications submitted to peer-reviewed journals such as Chemical Physics Letters and Journal of Applied Physics. \n \nI was a volunteer at the very successful Festival of Curiosity event in Dublin, Ireland in 2013 and 2014 which attracted more than 30,000 attendees. I also volunteered at the BT Young Scientist Competition in 2013 working at the Institute of Physics exhibit showcasing physics to young and old visitors. Motivated and creative young researcher interested in all areas of science particularly semiconductor physics, astrophysics, geophysics and nuclear science. My experience of working at Intel, Inc. (Ireland), CERN (Switzerland), Linköping University (Sweden) and Dublin City University (Ireland) has shown me the class and organisation required to work in modern research and engineering.  \n \nI have formed long-lasting relationships with scientists and non-scientists alike from various institutions in my roles and the work I've performed has lead to several publications in high impact peer-reviewed scientific journals. \n \nI have also presented my work many times to the scientific community and the broader public, both as a speaker and at poster sessions/competitions, particularly at MRS Boston (a major semiconductor science conference) where I was a speaker. \n \nI am interested in scientific outreach and communication and have an established record of successfully presenting my work to the scientific and broader community. I have received several awards for my presentations, both as a speaker and for poster presentations. I have also acted as a reviewer for publications submitted to peer-reviewed journals such as Chemical Physics Letters and Journal of Applied Physics. \n \nI was a volunteer at the very successful Festival of Curiosity event in Dublin, Ireland in 2013 and 2014 which attracted more than 30,000 attendees. I also volunteered at the BT Young Scientist Competition in 2013 working at the Institute of Physics exhibit showcasing physics to young and old visitors. Motivated and creative young researcher interested in all areas of science particularly semiconductor physics, astrophysics, geophysics and nuclear science. My experience of working at Intel, Inc. (Ireland), CERN (Switzerland), Linköping University (Sweden) and Dublin City University (Ireland) has shown me the class and organisation required to work in modern research and engineering.  \n \nI have formed long-lasting relationships with scientists and non-scientists alike from various institutions in my roles and the work I've performed has lead to several publications in high impact peer-reviewed scientific journals. \n \nI have also presented my work many times to the scientific community and the broader public, both as a speaker and at poster sessions/competitions, particularly at MRS Boston (a major semiconductor science conference) where I was a speaker. \n \nI am interested in scientific outreach and communication and have an established record of successfully presenting my work to the scientific and broader community. I have received several awards for my presentations, both as a speaker and for poster presentations. I have also acted as a reviewer for publications submitted to peer-reviewed journals such as Chemical Physics Letters and Journal of Applied Physics. \n \nI was a volunteer at the very successful Festival of Curiosity event in Dublin, Ireland in 2013 and 2014 which attracted more than 30,000 attendees. I also volunteered at the BT Young Scientist Competition in 2013 working at the Institute of Physics exhibit showcasing physics to young and old visitors. Experience Process Engineer Intel Corporation September 2014  – Present (1 year) Ireland Graduate Process Engineer responsible for dry etch processing with Intel Ireland, Ltd. \n \nResponsible for the quality of the material processed on our equipment which form an integral component in the production of semiconductor wafers. This requires a precise understanding of tool-specific process techniques and a broader understanding of our role within the production environment. \n \nClear and effective communication to stakeholders is required at all stages of production and in this role that includes the communication of complex technical data obtained from frequent monitoring of tool behaviour and activities. Project Coordinator University College Dublin (UCD) Job Vacancies April 2014  –  May 2014  (2 months) Ireland As Project Coordinator for the Science Foundation Ireland (SFI) Centres funding call in University College Dublin I was involved in coordinating academic and industry applicants for two separate proposals. Each of the two proposals was worth in the region of €30 million.  \n \nIn this role I worked closely with program managers at UCD Research to ensure accurate and timely delivery of proposals. This required strong communication and coordination skills to work within a precise framework. Postdoctoral Researcher Linköping University September 2013  –  February 2014  (6 months) linkoping, sweden As a PostDoctoral Researcher in the Functional Electronic Materials group at Linköping University I was responsible for measuring and characterising semiconductor materials.  \n \nThese materials (for example, the wide bandgap semiconductor ZnO) are of critical interest to emerging fields such as spintronics and solid state lighting. \n \nMeasurements are performed at various temperatures by exciting the electrons in the valence band of the semiconductor into the conduction band. From there the electron can couple with a hole, forming an exciton. The behaviour of this exciton can reveal a great deal of information about the fundamental properties of the material. \n \nI specialise in photoluminescence, magneto-optics, Raman spectroscopy and time-resolved measurements. Semiconductor physicist CERN February 2009  –  January 2014  (5 years) Switzerland My PhD work involved many hours spent working at the ISOLDE isotope separator facility at CERN, Geneva. Samples (mostly ZnO) were implanted with radioactive elements and the sample emission monitored over time as the radioactive element decayed into its daughter isotopes. PhD Student Dublin City University November 2008  –  December 2012  (4 years 2 months) Ireland My PhD work has encompassed many hours spent teaching eager undergraduates the wonders of physics! Unfortunately it's not always so straight-forward to teach the wonders of physics... Sales Assistant Games Workshop March 2005  –  October 2005  (8 months) Ireland Sales assistant for major miniature gaming company Games Workshop Limited, an extremely enjoyable experience which helped build my customer service ability to a professional standard. Process Engineer Intel Corporation September 2014  – Present (1 year) Ireland Graduate Process Engineer responsible for dry etch processing with Intel Ireland, Ltd. \n \nResponsible for the quality of the material processed on our equipment which form an integral component in the production of semiconductor wafers. This requires a precise understanding of tool-specific process techniques and a broader understanding of our role within the production environment. \n \nClear and effective communication to stakeholders is required at all stages of production and in this role that includes the communication of complex technical data obtained from frequent monitoring of tool behaviour and activities. Process Engineer Intel Corporation September 2014  – Present (1 year) Ireland Graduate Process Engineer responsible for dry etch processing with Intel Ireland, Ltd. \n \nResponsible for the quality of the material processed on our equipment which form an integral component in the production of semiconductor wafers. This requires a precise understanding of tool-specific process techniques and a broader understanding of our role within the production environment. \n \nClear and effective communication to stakeholders is required at all stages of production and in this role that includes the communication of complex technical data obtained from frequent monitoring of tool behaviour and activities. Project Coordinator University College Dublin (UCD) Job Vacancies April 2014  –  May 2014  (2 months) Ireland As Project Coordinator for the Science Foundation Ireland (SFI) Centres funding call in University College Dublin I was involved in coordinating academic and industry applicants for two separate proposals. Each of the two proposals was worth in the region of €30 million.  \n \nIn this role I worked closely with program managers at UCD Research to ensure accurate and timely delivery of proposals. This required strong communication and coordination skills to work within a precise framework. Project Coordinator University College Dublin (UCD) Job Vacancies April 2014  –  May 2014  (2 months) Ireland As Project Coordinator for the Science Foundation Ireland (SFI) Centres funding call in University College Dublin I was involved in coordinating academic and industry applicants for two separate proposals. Each of the two proposals was worth in the region of €30 million.  \n \nIn this role I worked closely with program managers at UCD Research to ensure accurate and timely delivery of proposals. This required strong communication and coordination skills to work within a precise framework. Postdoctoral Researcher Linköping University September 2013  –  February 2014  (6 months) linkoping, sweden As a PostDoctoral Researcher in the Functional Electronic Materials group at Linköping University I was responsible for measuring and characterising semiconductor materials.  \n \nThese materials (for example, the wide bandgap semiconductor ZnO) are of critical interest to emerging fields such as spintronics and solid state lighting. \n \nMeasurements are performed at various temperatures by exciting the electrons in the valence band of the semiconductor into the conduction band. From there the electron can couple with a hole, forming an exciton. The behaviour of this exciton can reveal a great deal of information about the fundamental properties of the material. \n \nI specialise in photoluminescence, magneto-optics, Raman spectroscopy and time-resolved measurements. Postdoctoral Researcher Linköping University September 2013  –  February 2014  (6 months) linkoping, sweden As a PostDoctoral Researcher in the Functional Electronic Materials group at Linköping University I was responsible for measuring and characterising semiconductor materials.  \n \nThese materials (for example, the wide bandgap semiconductor ZnO) are of critical interest to emerging fields such as spintronics and solid state lighting. \n \nMeasurements are performed at various temperatures by exciting the electrons in the valence band of the semiconductor into the conduction band. From there the electron can couple with a hole, forming an exciton. The behaviour of this exciton can reveal a great deal of information about the fundamental properties of the material. \n \nI specialise in photoluminescence, magneto-optics, Raman spectroscopy and time-resolved measurements. Semiconductor physicist CERN February 2009  –  January 2014  (5 years) Switzerland My PhD work involved many hours spent working at the ISOLDE isotope separator facility at CERN, Geneva. Samples (mostly ZnO) were implanted with radioactive elements and the sample emission monitored over time as the radioactive element decayed into its daughter isotopes. Semiconductor physicist CERN February 2009  –  January 2014  (5 years) Switzerland My PhD work involved many hours spent working at the ISOLDE isotope separator facility at CERN, Geneva. Samples (mostly ZnO) were implanted with radioactive elements and the sample emission monitored over time as the radioactive element decayed into its daughter isotopes. PhD Student Dublin City University November 2008  –  December 2012  (4 years 2 months) Ireland My PhD work has encompassed many hours spent teaching eager undergraduates the wonders of physics! Unfortunately it's not always so straight-forward to teach the wonders of physics... PhD Student Dublin City University November 2008  –  December 2012  (4 years 2 months) Ireland My PhD work has encompassed many hours spent teaching eager undergraduates the wonders of physics! Unfortunately it's not always so straight-forward to teach the wonders of physics... Sales Assistant Games Workshop March 2005  –  October 2005  (8 months) Ireland Sales assistant for major miniature gaming company Games Workshop Limited, an extremely enjoyable experience which helped build my customer service ability to a professional standard. Sales Assistant Games Workshop March 2005  –  October 2005  (8 months) Ireland Sales assistant for major miniature gaming company Games Workshop Limited, an extremely enjoyable experience which helped build my customer service ability to a professional standard. Languages Spanish Professional working proficiency Irish Limited working proficiency English Native or bilingual proficiency German Elementary proficiency French Elementary proficiency Spanish Professional working proficiency Irish Limited working proficiency English Native or bilingual proficiency German Elementary proficiency French Elementary proficiency Spanish Professional working proficiency Irish Limited working proficiency English Native or bilingual proficiency German Elementary proficiency French Elementary proficiency Professional working proficiency Limited working proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Nanotechnology Data Analysis Materials Science Spectroscopy Thin Films Semiconductors Characterization Radioactive Materials Photoluminescence Nanomaterials Plasma Physics LaTeX Scanning Electron... Photolithography Powder X-ray Diffraction Microfabrication Optics Sputtering Applied Physics Statistics Ion Implantation Presentations Communication Semiconductor... Etching Plasma Etch Lithography See 12+     See less Skills  Nanotechnology Data Analysis Materials Science Spectroscopy Thin Films Semiconductors Characterization Radioactive Materials Photoluminescence Nanomaterials Plasma Physics LaTeX Scanning Electron... Photolithography Powder X-ray Diffraction Microfabrication Optics Sputtering Applied Physics Statistics Ion Implantation Presentations Communication Semiconductor... Etching Plasma Etch Lithography See 12+     See less Nanotechnology Data Analysis Materials Science Spectroscopy Thin Films Semiconductors Characterization Radioactive Materials Photoluminescence Nanomaterials Plasma Physics LaTeX Scanning Electron... Photolithography Powder X-ray Diffraction Microfabrication Optics Sputtering Applied Physics Statistics Ion Implantation Presentations Communication Semiconductor... Etching Plasma Etch Lithography See 12+     See less Nanotechnology Data Analysis Materials Science Spectroscopy Thin Films Semiconductors Characterization Radioactive Materials Photoluminescence Nanomaterials Plasma Physics LaTeX Scanning Electron... Photolithography Powder X-ray Diffraction Microfabrication Optics Sputtering Applied Physics Statistics Ion Implantation Presentations Communication Semiconductor... Etching Plasma Etch Lithography See 12+     See less Education Dublin City University Doctor of Philosophy (PhD),  Physics 2008  – 2012 Activities and Societies:  Games Society ,  DCU Rugby ,  PhysEng ,  DCU Postgraduate Society Tyndall National Institute Semiconductor Manufacturing Technology , - 2012  – 2013 Activities and Societies:  Semiconductor fabrication\nPhotolithography\nChemical etching Dublin City University Graduate School 2008  – 2012 Maynooth University Bachelor of Science (B.Sc.) Hons,  Physics with Astrophysics 2004  – 2008 Activities and Societies:  Omega ,  Games Society ,  Astro2 ,  Alternative Music ,  Mikado Crana College Leaving Certificate,  Physics ,  Chemistry ,  Biology , Mathematics, Spanish, History,  English ,  Irish 1999  – 2004 Activities and Societies:  Student Council Representative (2003-2004) Dublin City University Doctor of Philosophy (PhD),  Physics 2008  – 2012 Activities and Societies:  Games Society ,  DCU Rugby ,  PhysEng ,  DCU Postgraduate Society Dublin City University Doctor of Philosophy (PhD),  Physics 2008  – 2012 Activities and Societies:  Games Society ,  DCU Rugby ,  PhysEng ,  DCU Postgraduate Society Dublin City University Doctor of Philosophy (PhD),  Physics 2008  – 2012 Activities and Societies:  Games Society ,  DCU Rugby ,  PhysEng ,  DCU Postgraduate Society Tyndall National Institute Semiconductor Manufacturing Technology , - 2012  – 2013 Activities and Societies:  Semiconductor fabrication\nPhotolithography\nChemical etching Tyndall National Institute Semiconductor Manufacturing Technology , - 2012  – 2013 Activities and Societies:  Semiconductor fabrication\nPhotolithography\nChemical etching Tyndall National Institute Semiconductor Manufacturing Technology , - 2012  – 2013 Activities and Societies:  Semiconductor fabrication\nPhotolithography\nChemical etching Dublin City University Graduate School 2008  – 2012 Dublin City University Graduate School 2008  – 2012 Dublin City University Graduate School 2008  – 2012 Maynooth University Bachelor of Science (B.Sc.) Hons,  Physics with Astrophysics 2004  – 2008 Activities and Societies:  Omega ,  Games Society ,  Astro2 ,  Alternative Music ,  Mikado Maynooth University Bachelor of Science (B.Sc.) Hons,  Physics with Astrophysics 2004  – 2008 Activities and Societies:  Omega ,  Games Society ,  Astro2 ,  Alternative Music ,  Mikado Maynooth University Bachelor of Science (B.Sc.) Hons,  Physics with Astrophysics 2004  – 2008 Activities and Societies:  Omega ,  Games Society ,  Astro2 ,  Alternative Music ,  Mikado Crana College Leaving Certificate,  Physics ,  Chemistry ,  Biology , Mathematics, Spanish, History,  English ,  Irish 1999  – 2004 Activities and Societies:  Student Council Representative (2003-2004) Crana College Leaving Certificate,  Physics ,  Chemistry ,  Biology , Mathematics, Spanish, History,  English ,  Irish 1999  – 2004 Activities and Societies:  Student Council Representative (2003-2004) Crana College Leaving Certificate,  Physics ,  Chemistry ,  Biology , Mathematics, Spanish, History,  English ,  Irish 1999  – 2004 Activities and Societies:  Student Council Representative (2003-2004) Honors & Awards Additional Honors & Awards 1st Place, Poster Presentation, National Centre for Plasma Science and Technology Meeting (DCU, 2012) \n \nFinalist – Rosse Medal (Institute of Physics Ireland, 2012) \n \nRunner-Up – Rosse Medal (Institute of Physics Ireland, 2011) \n \n2nd Place, 3rd National Centre for Plasma Science and Technology Postgraduate Poster Competition (2011) \n \n1st Place, Early Stage Researcher, 2nd National Centre for Plasma Science and Technology Postgraduate Poster Competition (2010) \n \nBest Presentation – Intellectual Property and Commercialisation Project (2010) Additional Honors & Awards 1st Place, Poster Presentation, National Centre for Plasma Science and Technology Meeting (DCU, 2012) \n \nFinalist – Rosse Medal (Institute of Physics Ireland, 2012) \n \nRunner-Up – Rosse Medal (Institute of Physics Ireland, 2011) \n \n2nd Place, 3rd National Centre for Plasma Science and Technology Postgraduate Poster Competition (2011) \n \n1st Place, Early Stage Researcher, 2nd National Centre for Plasma Science and Technology Postgraduate Poster Competition (2010) \n \nBest Presentation – Intellectual Property and Commercialisation Project (2010) Additional Honors & Awards 1st Place, Poster Presentation, National Centre for Plasma Science and Technology Meeting (DCU, 2012) \n \nFinalist – Rosse Medal (Institute of Physics Ireland, 2012) \n \nRunner-Up – Rosse Medal (Institute of Physics Ireland, 2011) \n \n2nd Place, 3rd National Centre for Plasma Science and Technology Postgraduate Poster Competition (2011) \n \n1st Place, Early Stage Researcher, 2nd National Centre for Plasma Science and Technology Postgraduate Poster Competition (2010) \n \nBest Presentation – Intellectual Property and Commercialisation Project (2010) Additional Honors & Awards 1st Place, Poster Presentation, National Centre for Plasma Science and Technology Meeting (DCU, 2012) \n \nFinalist – Rosse Medal (Institute of Physics Ireland, 2012) \n \nRunner-Up – Rosse Medal (Institute of Physics Ireland, 2011) \n \n2nd Place, 3rd National Centre for Plasma Science and Technology Postgraduate Poster Competition (2011) \n \n1st Place, Early Stage Researcher, 2nd National Centre for Plasma Science and Technology Postgraduate Poster Competition (2010) \n \nBest Presentation – Intellectual Property and Commercialisation Project (2010) ", "Summary I am an adaptable, reliable and dedicated mechanical engineer with a diverse set of engineering skills. I produce excellent work and I can perform to strict deadlines. I enjoy facing challenges and remain determined until the task is complete. I am excellent in performing as part of a team or in solo environments. Summary I am an adaptable, reliable and dedicated mechanical engineer with a diverse set of engineering skills. I produce excellent work and I can perform to strict deadlines. I enjoy facing challenges and remain determined until the task is complete. I am excellent in performing as part of a team or in solo environments. I am an adaptable, reliable and dedicated mechanical engineer with a diverse set of engineering skills. I produce excellent work and I can perform to strict deadlines. I enjoy facing challenges and remain determined until the task is complete. I am excellent in performing as part of a team or in solo environments. I am an adaptable, reliable and dedicated mechanical engineer with a diverse set of engineering skills. I produce excellent work and I can perform to strict deadlines. I enjoy facing challenges and remain determined until the task is complete. I am excellent in performing as part of a team or in solo environments. Experience Process Engineer Intel Corporation March 2015  – Present (6 months) Leixlip, Ireland Student Queens University Belfast September 2013  –  September 2014  (1 year 1 month) Process Engineer Intel Corporation March 2015  – Present (6 months) Leixlip, Ireland Process Engineer Intel Corporation March 2015  – Present (6 months) Leixlip, Ireland Student Queens University Belfast September 2013  –  September 2014  (1 year 1 month) Student Queens University Belfast September 2013  –  September 2014  (1 year 1 month) Skills Microsoft Office Microsoft Excel Microsoft Word PowerPoint Research Teamwork Social Media Public Speaking Upholstery Abaqus Matlab Solidworks Skills  Microsoft Office Microsoft Excel Microsoft Word PowerPoint Research Teamwork Social Media Public Speaking Upholstery Abaqus Matlab Solidworks Microsoft Office Microsoft Excel Microsoft Word PowerPoint Research Teamwork Social Media Public Speaking Upholstery Abaqus Matlab Solidworks Microsoft Office Microsoft Excel Microsoft Word PowerPoint Research Teamwork Social Media Public Speaking Upholstery Abaqus Matlab Solidworks Education Queens University Belfast Master of Science (MSc),  Mechanical Engineering 2013  – 2014 Activities and Societies:  Gaelic Football Dundalk Institute of Technology Bachelor's degree,  Mechanical Engineering 2008  – 2013 Queens University Belfast Master of Science (MSc),  Mechanical Engineering 2013  – 2014 Activities and Societies:  Gaelic Football Queens University Belfast Master of Science (MSc),  Mechanical Engineering 2013  – 2014 Activities and Societies:  Gaelic Football Queens University Belfast Master of Science (MSc),  Mechanical Engineering 2013  – 2014 Activities and Societies:  Gaelic Football Dundalk Institute of Technology Bachelor's degree,  Mechanical Engineering 2008  – 2013 Dundalk Institute of Technology Bachelor's degree,  Mechanical Engineering 2008  – 2013 Dundalk Institute of Technology Bachelor's degree,  Mechanical Engineering 2008  – 2013 ", "Summary A highly motivated master’s graduate from a Chemical Engineering background, seeking a challenging role to apply and develop my technical and project management skills. Specialities include troubleshooting through the use of analytical and logical skills, quality management and safety awareness. Summary A highly motivated master’s graduate from a Chemical Engineering background, seeking a challenging role to apply and develop my technical and project management skills. Specialities include troubleshooting through the use of analytical and logical skills, quality management and safety awareness. A highly motivated master’s graduate from a Chemical Engineering background, seeking a challenging role to apply and develop my technical and project management skills. Specialities include troubleshooting through the use of analytical and logical skills, quality management and safety awareness. A highly motivated master’s graduate from a Chemical Engineering background, seeking a challenging role to apply and develop my technical and project management skills. Specialities include troubleshooting through the use of analytical and logical skills, quality management and safety awareness. Experience Process Engineer Decora Blind Systems June 2014  – Present (1 year 3 months) Responsible for the effective implementation of new and improved manufacturing and logistical processes using lean manufacturing techniques for existing and new product ranges, in-line with the following key objectives – Efficiency, Quality, Waste and Capacity. \n \nWith aims to improve productivity and reduce costs, I am always heavily involed in contributing and initialising project's within the company. Projects include the design and implementation of an Optimisation scheme and the initation of 5s throughout the company. \n \nAccountable for two areas within Decora as the lead engineer, I lead by example through my technical knowledge and management skills. Installation and Qualification Project Engineer Intel Corporation October 2013  –  June 2014  (9 months) Leixllip, Ireland Lithography Installation and Qualification project engineer, responsible for qualifying state of the art manufacturing technology in the semiconductor industry, within a cost and time plan. Graduate Process Engineer Intel Corporation July 2013  –  June 2014  (1 year) Process Engineer Decora Blind Systems June 2014  – Present (1 year 3 months) Responsible for the effective implementation of new and improved manufacturing and logistical processes using lean manufacturing techniques for existing and new product ranges, in-line with the following key objectives – Efficiency, Quality, Waste and Capacity. \n \nWith aims to improve productivity and reduce costs, I am always heavily involed in contributing and initialising project's within the company. Projects include the design and implementation of an Optimisation scheme and the initation of 5s throughout the company. \n \nAccountable for two areas within Decora as the lead engineer, I lead by example through my technical knowledge and management skills. Process Engineer Decora Blind Systems June 2014  – Present (1 year 3 months) Responsible for the effective implementation of new and improved manufacturing and logistical processes using lean manufacturing techniques for existing and new product ranges, in-line with the following key objectives – Efficiency, Quality, Waste and Capacity. \n \nWith aims to improve productivity and reduce costs, I am always heavily involed in contributing and initialising project's within the company. Projects include the design and implementation of an Optimisation scheme and the initation of 5s throughout the company. \n \nAccountable for two areas within Decora as the lead engineer, I lead by example through my technical knowledge and management skills. Installation and Qualification Project Engineer Intel Corporation October 2013  –  June 2014  (9 months) Leixllip, Ireland Lithography Installation and Qualification project engineer, responsible for qualifying state of the art manufacturing technology in the semiconductor industry, within a cost and time plan. Installation and Qualification Project Engineer Intel Corporation October 2013  –  June 2014  (9 months) Leixllip, Ireland Lithography Installation and Qualification project engineer, responsible for qualifying state of the art manufacturing technology in the semiconductor industry, within a cost and time plan. Graduate Process Engineer Intel Corporation July 2013  –  June 2014  (1 year) Graduate Process Engineer Intel Corporation July 2013  –  June 2014  (1 year) Languages   Skills Troubleshooting Process Engineering Semiconductor... Lean Manufacturing 5S AutoCAD Chemical Engineering Matlab Hydrophobic Interaction Research Industrial Safety Quality Management Renewable Energy Textile Industry Skills  Troubleshooting Process Engineering Semiconductor... Lean Manufacturing 5S AutoCAD Chemical Engineering Matlab Hydrophobic Interaction Research Industrial Safety Quality Management Renewable Energy Textile Industry Troubleshooting Process Engineering Semiconductor... Lean Manufacturing 5S AutoCAD Chemical Engineering Matlab Hydrophobic Interaction Research Industrial Safety Quality Management Renewable Energy Textile Industry Troubleshooting Process Engineering Semiconductor... Lean Manufacturing 5S AutoCAD Chemical Engineering Matlab Hydrophobic Interaction Research Industrial Safety Quality Management Renewable Energy Textile Industry Education Queen's University Belfast Master's Degree,  Chemical Engineering , First Class Honours 2008  – 2013 During my time at Queen's University Belfast I developed a great understanding of many subjects including Oil and Gas Process Engineering, Energy and Quality Management and Heat and Mass Transfer as well as excelling in design work. \n \nFor my final year project I worked directly with the Belfast Trust to investigate what was causing contamination of healthcare taps at the Royal Victoria Hospital and Belfast City Hospital. It involved the synthesis of superhydrophobic coatings and investigating their application to health care taps. \n \nMajor group projects involved the designing of a plant to make Phthalic Anhydride.The project included heat and mass balances, costing strategies, chemical engineering design and process control. Our Lady and St Patrick's College Knock 2001  – 2008 3 A-Levels: Business Studies A, Chemistry B and Mathematics B.  \n10 GCSEs: 1 A* , 6 A's and 3 B's Queen's University Belfast Master's Degree,  Chemical Engineering , First Class Honours 2008  – 2013 During my time at Queen's University Belfast I developed a great understanding of many subjects including Oil and Gas Process Engineering, Energy and Quality Management and Heat and Mass Transfer as well as excelling in design work. \n \nFor my final year project I worked directly with the Belfast Trust to investigate what was causing contamination of healthcare taps at the Royal Victoria Hospital and Belfast City Hospital. It involved the synthesis of superhydrophobic coatings and investigating their application to health care taps. \n \nMajor group projects involved the designing of a plant to make Phthalic Anhydride.The project included heat and mass balances, costing strategies, chemical engineering design and process control. Queen's University Belfast Master's Degree,  Chemical Engineering , First Class Honours 2008  – 2013 During my time at Queen's University Belfast I developed a great understanding of many subjects including Oil and Gas Process Engineering, Energy and Quality Management and Heat and Mass Transfer as well as excelling in design work. \n \nFor my final year project I worked directly with the Belfast Trust to investigate what was causing contamination of healthcare taps at the Royal Victoria Hospital and Belfast City Hospital. It involved the synthesis of superhydrophobic coatings and investigating their application to health care taps. \n \nMajor group projects involved the designing of a plant to make Phthalic Anhydride.The project included heat and mass balances, costing strategies, chemical engineering design and process control. Queen's University Belfast Master's Degree,  Chemical Engineering , First Class Honours 2008  – 2013 During my time at Queen's University Belfast I developed a great understanding of many subjects including Oil and Gas Process Engineering, Energy and Quality Management and Heat and Mass Transfer as well as excelling in design work. \n \nFor my final year project I worked directly with the Belfast Trust to investigate what was causing contamination of healthcare taps at the Royal Victoria Hospital and Belfast City Hospital. It involved the synthesis of superhydrophobic coatings and investigating their application to health care taps. \n \nMajor group projects involved the designing of a plant to make Phthalic Anhydride.The project included heat and mass balances, costing strategies, chemical engineering design and process control. Our Lady and St Patrick's College Knock 2001  – 2008 3 A-Levels: Business Studies A, Chemistry B and Mathematics B.  \n10 GCSEs: 1 A* , 6 A's and 3 B's Our Lady and St Patrick's College Knock 2001  – 2008 3 A-Levels: Business Studies A, Chemistry B and Mathematics B.  \n10 GCSEs: 1 A* , 6 A's and 3 B's Our Lady and St Patrick's College Knock 2001  – 2008 3 A-Levels: Business Studies A, Chemistry B and Mathematics B.  \n10 GCSEs: 1 A* , 6 A's and 3 B's Honors & Awards ", "Experience Scientific Analyst European Monitoring Centre for Drugs and Drug Addiction (EMCDDA) July 2014  – Present (1 year 2 months) Graduate Process Engineer Intel Corporation 2013  –  July 2014  (1 year) Phd in Forensic Chemistry Dublin Institute of Technology December 2009  –  November 2013  (4 years) Dublin Forensic analysis, synthesis and characterisation of new psychoactive substances of abuse Quality Manager and Laboratory Manager Oldcastle Laboratories September 2009  –  November 2009  (3 months) Oldcastle, Co. Meath Scientific Officer and Safety Rep Environmental Protection Agency Ireland July 2008  –  July 2009  (1 year 1 month) Student Placement Environmental Protection Agency Ireland February 2007  –  September 2007  (8 months) Post Mortem Technician St. James's Hospital June 2000  –  August 2003  (3 years 3 months) Post Mortem Room Scientific Analyst European Monitoring Centre for Drugs and Drug Addiction (EMCDDA) July 2014  – Present (1 year 2 months) Scientific Analyst European Monitoring Centre for Drugs and Drug Addiction (EMCDDA) July 2014  – Present (1 year 2 months) Graduate Process Engineer Intel Corporation 2013  –  July 2014  (1 year) Graduate Process Engineer Intel Corporation 2013  –  July 2014  (1 year) Phd in Forensic Chemistry Dublin Institute of Technology December 2009  –  November 2013  (4 years) Dublin Forensic analysis, synthesis and characterisation of new psychoactive substances of abuse Phd in Forensic Chemistry Dublin Institute of Technology December 2009  –  November 2013  (4 years) Dublin Forensic analysis, synthesis and characterisation of new psychoactive substances of abuse Quality Manager and Laboratory Manager Oldcastle Laboratories September 2009  –  November 2009  (3 months) Oldcastle, Co. Meath Quality Manager and Laboratory Manager Oldcastle Laboratories September 2009  –  November 2009  (3 months) Oldcastle, Co. Meath Scientific Officer and Safety Rep Environmental Protection Agency Ireland July 2008  –  July 2009  (1 year 1 month) Scientific Officer and Safety Rep Environmental Protection Agency Ireland July 2008  –  July 2009  (1 year 1 month) Student Placement Environmental Protection Agency Ireland February 2007  –  September 2007  (8 months) Student Placement Environmental Protection Agency Ireland February 2007  –  September 2007  (8 months) Post Mortem Technician St. James's Hospital June 2000  –  August 2003  (3 years 3 months) Post Mortem Room Post Mortem Technician St. James's Hospital June 2000  –  August 2003  (3 years 3 months) Post Mortem Room Languages French French French Skills Spectroscopy UV/Vis Chemistry IR spectroscopy GC-MS HPLC Science Raman spectroscopy Analytical Chemistry Characterization Skills  Spectroscopy UV/Vis Chemistry IR spectroscopy GC-MS HPLC Science Raman spectroscopy Analytical Chemistry Characterization Spectroscopy UV/Vis Chemistry IR spectroscopy GC-MS HPLC Science Raman spectroscopy Analytical Chemistry Characterization Spectroscopy UV/Vis Chemistry IR spectroscopy GC-MS HPLC Science Raman spectroscopy Analytical Chemistry Characterization Education Dublin Institute of Technology Doctor of Philosophy (PhD),  Forensic Chemistry 2009  – 2013 Dublin Institute of Technology BSc (Hons) Forensic and Environmental Analysis,  Chemistry , 2.1 Honours 2004  – 2008 Loreto Secondary School, Balbriggan, Co. Dublin Leaving Certificate 1993  – 1999 Dublin Institute of Technology Doctor of Philosophy (PhD),  Forensic Chemistry 2009  – 2013 Dublin Institute of Technology Doctor of Philosophy (PhD),  Forensic Chemistry 2009  – 2013 Dublin Institute of Technology Doctor of Philosophy (PhD),  Forensic Chemistry 2009  – 2013 Dublin Institute of Technology BSc (Hons) Forensic and Environmental Analysis,  Chemistry , 2.1 Honours 2004  – 2008 Dublin Institute of Technology BSc (Hons) Forensic and Environmental Analysis,  Chemistry , 2.1 Honours 2004  – 2008 Dublin Institute of Technology BSc (Hons) Forensic and Environmental Analysis,  Chemistry , 2.1 Honours 2004  – 2008 Loreto Secondary School, Balbriggan, Co. Dublin Leaving Certificate 1993  – 1999 Loreto Secondary School, Balbriggan, Co. Dublin Leaving Certificate 1993  – 1999 Loreto Secondary School, Balbriggan, Co. Dublin Leaving Certificate 1993  – 1999 ", "Summary Hoping to expand on my experience in working outside Ireland and would be willing to relocate to make this happen. Relocation to the U.S would be easily achieved as i am capable of obtaining a one year graduate visa.  \n \nI have tried incredibly hard over the years to tailor myself into a well rounded individual, understanding that engineering is not just about technical competency I believe that to be truly successful in the forthcoming era a broad knowledge is required, such as the ability to identify and solve technical problems, the effectiveness to which you communicate ideas with fellow workmates, high ethical values and to recognize the importance of life long learning.  \n \nMasters Degree in Energy Systems Engineering from the National University of Ireland Galway. Bachelors degree in Mechanical Engineering with Renewable energy, and an Honors Degree in sustainable energy Engineering from Athlone Institute of Technology \n \nDuring my time at NUIG and AIT I have gained and consolidated knowledge of energy management, and energy systems. All the courses outlined were taught in such a manner that the transition to industry would lessen the strain to any company employing. \n \nDiligent and highly motivated individual, capable of working well within a team environment building working alliances or under his own initiative. Very reliable at managing time, prioritizing tasks and meeting deadlines. Eager to start my career and start learning from like minded individuals, furthermore i have clear concise expectations for myself and plan to work hard and rise to a manager's role and further in the near future. Summary Hoping to expand on my experience in working outside Ireland and would be willing to relocate to make this happen. Relocation to the U.S would be easily achieved as i am capable of obtaining a one year graduate visa.  \n \nI have tried incredibly hard over the years to tailor myself into a well rounded individual, understanding that engineering is not just about technical competency I believe that to be truly successful in the forthcoming era a broad knowledge is required, such as the ability to identify and solve technical problems, the effectiveness to which you communicate ideas with fellow workmates, high ethical values and to recognize the importance of life long learning.  \n \nMasters Degree in Energy Systems Engineering from the National University of Ireland Galway. Bachelors degree in Mechanical Engineering with Renewable energy, and an Honors Degree in sustainable energy Engineering from Athlone Institute of Technology \n \nDuring my time at NUIG and AIT I have gained and consolidated knowledge of energy management, and energy systems. All the courses outlined were taught in such a manner that the transition to industry would lessen the strain to any company employing. \n \nDiligent and highly motivated individual, capable of working well within a team environment building working alliances or under his own initiative. Very reliable at managing time, prioritizing tasks and meeting deadlines. Eager to start my career and start learning from like minded individuals, furthermore i have clear concise expectations for myself and plan to work hard and rise to a manager's role and further in the near future. Hoping to expand on my experience in working outside Ireland and would be willing to relocate to make this happen. Relocation to the U.S would be easily achieved as i am capable of obtaining a one year graduate visa.  \n \nI have tried incredibly hard over the years to tailor myself into a well rounded individual, understanding that engineering is not just about technical competency I believe that to be truly successful in the forthcoming era a broad knowledge is required, such as the ability to identify and solve technical problems, the effectiveness to which you communicate ideas with fellow workmates, high ethical values and to recognize the importance of life long learning.  \n \nMasters Degree in Energy Systems Engineering from the National University of Ireland Galway. Bachelors degree in Mechanical Engineering with Renewable energy, and an Honors Degree in sustainable energy Engineering from Athlone Institute of Technology \n \nDuring my time at NUIG and AIT I have gained and consolidated knowledge of energy management, and energy systems. All the courses outlined were taught in such a manner that the transition to industry would lessen the strain to any company employing. \n \nDiligent and highly motivated individual, capable of working well within a team environment building working alliances or under his own initiative. Very reliable at managing time, prioritizing tasks and meeting deadlines. Eager to start my career and start learning from like minded individuals, furthermore i have clear concise expectations for myself and plan to work hard and rise to a manager's role and further in the near future. Hoping to expand on my experience in working outside Ireland and would be willing to relocate to make this happen. Relocation to the U.S would be easily achieved as i am capable of obtaining a one year graduate visa.  \n \nI have tried incredibly hard over the years to tailor myself into a well rounded individual, understanding that engineering is not just about technical competency I believe that to be truly successful in the forthcoming era a broad knowledge is required, such as the ability to identify and solve technical problems, the effectiveness to which you communicate ideas with fellow workmates, high ethical values and to recognize the importance of life long learning.  \n \nMasters Degree in Energy Systems Engineering from the National University of Ireland Galway. Bachelors degree in Mechanical Engineering with Renewable energy, and an Honors Degree in sustainable energy Engineering from Athlone Institute of Technology \n \nDuring my time at NUIG and AIT I have gained and consolidated knowledge of energy management, and energy systems. All the courses outlined were taught in such a manner that the transition to industry would lessen the strain to any company employing. \n \nDiligent and highly motivated individual, capable of working well within a team environment building working alliances or under his own initiative. Very reliable at managing time, prioritizing tasks and meeting deadlines. Eager to start my career and start learning from like minded individuals, furthermore i have clear concise expectations for myself and plan to work hard and rise to a manager's role and further in the near future. Experience Graduate process engineer Intel Corporation August 2015  – Present (1 month) Leixlip Electrical Technician O Hara & Harrison Electrical Contractors June 2014  – Present (1 year 3 months) Ireland Worked as part of a team in a high paced and high quality environment including industrial, commercial ,healthcare and educational institutions. Works consisted of first fixing that included Installation of containment for electrical services, i.e, tray, trunking and steel/Plastic conduit, in addition to numerous second fixing services. Electrical Technician O Hara & Harrison Electrical Contractors May 2013  –  September 2013  (5 months) Ireland Wind turbine technician CMD Electrical September 2012  –  April 2013  (8 months) >Termination of stator cables from generator in the transformer panel TRA.  \n \n>Securing of low voltage encoder and fibre-optic cables from anemometer and photocells on roof of nacelle along tower in cable trays to be terminated in base.  \n \n>Earthing of Towers. \n \n>Worked on a number of different turbines including RePower Systems (The Netherlands) and Nordex (Scotland,Wales, Ireland) Engineering Intern Water and environment department Donegal County Council June 2012  –  August 2012  (3 months) Corporate HQ, Lifford, Co Donegal > Analyzed tenders for large reservoir projects within Donegal  \n> Prepared safety snag list by reviewing AutoCad drawings prepared by contractors and relating any issues associated with them as per council guidelines back to the principal contractor.  \n>Involved in countrywide online telemetry, which consisted of real time water flow rates, water levels etc and prepared reports from this information. Graduate process engineer Intel Corporation August 2015  – Present (1 month) Leixlip Graduate process engineer Intel Corporation August 2015  – Present (1 month) Leixlip Electrical Technician O Hara & Harrison Electrical Contractors June 2014  – Present (1 year 3 months) Ireland Worked as part of a team in a high paced and high quality environment including industrial, commercial ,healthcare and educational institutions. Works consisted of first fixing that included Installation of containment for electrical services, i.e, tray, trunking and steel/Plastic conduit, in addition to numerous second fixing services. Electrical Technician O Hara & Harrison Electrical Contractors June 2014  – Present (1 year 3 months) Ireland Worked as part of a team in a high paced and high quality environment including industrial, commercial ,healthcare and educational institutions. Works consisted of first fixing that included Installation of containment for electrical services, i.e, tray, trunking and steel/Plastic conduit, in addition to numerous second fixing services. Electrical Technician O Hara & Harrison Electrical Contractors May 2013  –  September 2013  (5 months) Ireland Electrical Technician O Hara & Harrison Electrical Contractors May 2013  –  September 2013  (5 months) Ireland Wind turbine technician CMD Electrical September 2012  –  April 2013  (8 months) >Termination of stator cables from generator in the transformer panel TRA.  \n \n>Securing of low voltage encoder and fibre-optic cables from anemometer and photocells on roof of nacelle along tower in cable trays to be terminated in base.  \n \n>Earthing of Towers. \n \n>Worked on a number of different turbines including RePower Systems (The Netherlands) and Nordex (Scotland,Wales, Ireland) Wind turbine technician CMD Electrical September 2012  –  April 2013  (8 months) >Termination of stator cables from generator in the transformer panel TRA.  \n \n>Securing of low voltage encoder and fibre-optic cables from anemometer and photocells on roof of nacelle along tower in cable trays to be terminated in base.  \n \n>Earthing of Towers. \n \n>Worked on a number of different turbines including RePower Systems (The Netherlands) and Nordex (Scotland,Wales, Ireland) Engineering Intern Water and environment department Donegal County Council June 2012  –  August 2012  (3 months) Corporate HQ, Lifford, Co Donegal > Analyzed tenders for large reservoir projects within Donegal  \n> Prepared safety snag list by reviewing AutoCad drawings prepared by contractors and relating any issues associated with them as per council guidelines back to the principal contractor.  \n>Involved in countrywide online telemetry, which consisted of real time water flow rates, water levels etc and prepared reports from this information. Engineering Intern Water and environment department Donegal County Council June 2012  –  August 2012  (3 months) Corporate HQ, Lifford, Co Donegal > Analyzed tenders for large reservoir projects within Donegal  \n> Prepared safety snag list by reviewing AutoCad drawings prepared by contractors and relating any issues associated with them as per council guidelines back to the principal contractor.  \n>Involved in countrywide online telemetry, which consisted of real time water flow rates, water levels etc and prepared reports from this information. Languages English Native or bilingual proficiency Gaelic Limited working proficiency English Native or bilingual proficiency Gaelic Limited working proficiency English Native or bilingual proficiency Gaelic Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Renewable Energy Electrical Theory Data Analysis Sustainable Energy Wind Turbines Energy AutoCAD Energy Management Engineering Energy Efficiency Microsoft Office Solar Energy Pro Engineer SCADA Photovoltaics Mechanical Engineering Wind Power Thermodynamics Wind Project Management Wind turbine rescue and... Matlab Manual Handling Fire Safety Fluid Dynamics Fluid Mechanics Simulink Physics Environmental Awareness Electricians Instrumentation Hydraulics Fortran DIVAST( depth... ISO14001 Environmental... ISO50001 Energy... Tecplot Investments SEAI Energy map Technical Drawing Fortran 77 Investment Strategies See 27+     See less Skills  Renewable Energy Electrical Theory Data Analysis Sustainable Energy Wind Turbines Energy AutoCAD Energy Management Engineering Energy Efficiency Microsoft Office Solar Energy Pro Engineer SCADA Photovoltaics Mechanical Engineering Wind Power Thermodynamics Wind Project Management Wind turbine rescue and... Matlab Manual Handling Fire Safety Fluid Dynamics Fluid Mechanics Simulink Physics Environmental Awareness Electricians Instrumentation Hydraulics Fortran DIVAST( depth... ISO14001 Environmental... ISO50001 Energy... Tecplot Investments SEAI Energy map Technical Drawing Fortran 77 Investment Strategies See 27+     See less Renewable Energy Electrical Theory Data Analysis Sustainable Energy Wind Turbines Energy AutoCAD Energy Management Engineering Energy Efficiency Microsoft Office Solar Energy Pro Engineer SCADA Photovoltaics Mechanical Engineering Wind Power Thermodynamics Wind Project Management Wind turbine rescue and... Matlab Manual Handling Fire Safety Fluid Dynamics Fluid Mechanics Simulink Physics Environmental Awareness Electricians Instrumentation Hydraulics Fortran DIVAST( depth... ISO14001 Environmental... ISO50001 Energy... Tecplot Investments SEAI Energy map Technical Drawing Fortran 77 Investment Strategies See 27+     See less Renewable Energy Electrical Theory Data Analysis Sustainable Energy Wind Turbines Energy AutoCAD Energy Management Engineering Energy Efficiency Microsoft Office Solar Energy Pro Engineer SCADA Photovoltaics Mechanical Engineering Wind Power Thermodynamics Wind Project Management Wind turbine rescue and... Matlab Manual Handling Fire Safety Fluid Dynamics Fluid Mechanics Simulink Physics Environmental Awareness Electricians Instrumentation Hydraulics Fortran DIVAST( depth... ISO14001 Environmental... ISO50001 Energy... Tecplot Investments SEAI Energy map Technical Drawing Fortran 77 Investment Strategies See 27+     See less Education National University of Ireland, Galway Master of Engineering (MEng),  Energy systems Engineering 2013  – 2014 Modules: \n \nAdvanced Energy systems  \nCoastal & Offshore Engineering  \nLean Systems \nSustainable Energy & Energy in Buildings \nRenewable Energy Economics \nProject Management  \nThe Built Environment Activities and Societies:  Energy Society Athlone Institute of Technology Bachelor of Engineering (B.Eng.H), Sustainable Energy Engineering, , Second Class Honors grade 1 2011  – 2012 Modules: \n \nEnergy Efficient Buildings \nSustainable Energy Economics \nBuilding Energy Control Systems \nEnergy Efficient Buildings \nSustainable Energy Systems and Storage \nBuilding Services \nEnergy and the Environment \nSustainable Energy Management  \nThesis: Characterization of the wave energy potential of the West coast of Ireland Activities and Societies:  Gaelic Football ,  Hurling Athlone Institute of Technology Bachelor of Engineering (B.Eng.), Mechanical Engineering & Renewable Energy, , Second Class Honors Grade 1 2008  – 2011 Modules included, \n \nProcesses and Operations Management, \nPolymer design  \nControl and Power Technology  \nElectrical and Energy Science \nMechanics \nMaths  \nMaterials and Processes  \nEngineering Workshop Drawing, Auto-CAD and Pro-Engineer \nCommunications and Computer Applications \nInstrumentation  \nEnergy Systems and Thermo-fluids National University of Ireland, Galway Master of Engineering (MEng),  Energy systems Engineering 2013  – 2014 Modules: \n \nAdvanced Energy systems  \nCoastal & Offshore Engineering  \nLean Systems \nSustainable Energy & Energy in Buildings \nRenewable Energy Economics \nProject Management  \nThe Built Environment Activities and Societies:  Energy Society National University of Ireland, Galway Master of Engineering (MEng),  Energy systems Engineering 2013  – 2014 Modules: \n \nAdvanced Energy systems  \nCoastal & Offshore Engineering  \nLean Systems \nSustainable Energy & Energy in Buildings \nRenewable Energy Economics \nProject Management  \nThe Built Environment Activities and Societies:  Energy Society National University of Ireland, Galway Master of Engineering (MEng),  Energy systems Engineering 2013  – 2014 Modules: \n \nAdvanced Energy systems  \nCoastal & Offshore Engineering  \nLean Systems \nSustainable Energy & Energy in Buildings \nRenewable Energy Economics \nProject Management  \nThe Built Environment Activities and Societies:  Energy Society Athlone Institute of Technology Bachelor of Engineering (B.Eng.H), Sustainable Energy Engineering, , Second Class Honors grade 1 2011  – 2012 Modules: \n \nEnergy Efficient Buildings \nSustainable Energy Economics \nBuilding Energy Control Systems \nEnergy Efficient Buildings \nSustainable Energy Systems and Storage \nBuilding Services \nEnergy and the Environment \nSustainable Energy Management  \nThesis: Characterization of the wave energy potential of the West coast of Ireland Activities and Societies:  Gaelic Football ,  Hurling Athlone Institute of Technology Bachelor of Engineering (B.Eng.H), Sustainable Energy Engineering, , Second Class Honors grade 1 2011  – 2012 Modules: \n \nEnergy Efficient Buildings \nSustainable Energy Economics \nBuilding Energy Control Systems \nEnergy Efficient Buildings \nSustainable Energy Systems and Storage \nBuilding Services \nEnergy and the Environment \nSustainable Energy Management  \nThesis: Characterization of the wave energy potential of the West coast of Ireland Activities and Societies:  Gaelic Football ,  Hurling Athlone Institute of Technology Bachelor of Engineering (B.Eng.H), Sustainable Energy Engineering, , Second Class Honors grade 1 2011  – 2012 Modules: \n \nEnergy Efficient Buildings \nSustainable Energy Economics \nBuilding Energy Control Systems \nEnergy Efficient Buildings \nSustainable Energy Systems and Storage \nBuilding Services \nEnergy and the Environment \nSustainable Energy Management  \nThesis: Characterization of the wave energy potential of the West coast of Ireland Activities and Societies:  Gaelic Football ,  Hurling Athlone Institute of Technology Bachelor of Engineering (B.Eng.), Mechanical Engineering & Renewable Energy, , Second Class Honors Grade 1 2008  – 2011 Modules included, \n \nProcesses and Operations Management, \nPolymer design  \nControl and Power Technology  \nElectrical and Energy Science \nMechanics \nMaths  \nMaterials and Processes  \nEngineering Workshop Drawing, Auto-CAD and Pro-Engineer \nCommunications and Computer Applications \nInstrumentation  \nEnergy Systems and Thermo-fluids Athlone Institute of Technology Bachelor of Engineering (B.Eng.), Mechanical Engineering & Renewable Energy, , Second Class Honors Grade 1 2008  – 2011 Modules included, \n \nProcesses and Operations Management, \nPolymer design  \nControl and Power Technology  \nElectrical and Energy Science \nMechanics \nMaths  \nMaterials and Processes  \nEngineering Workshop Drawing, Auto-CAD and Pro-Engineer \nCommunications and Computer Applications \nInstrumentation  \nEnergy Systems and Thermo-fluids Athlone Institute of Technology Bachelor of Engineering (B.Eng.), Mechanical Engineering & Renewable Energy, , Second Class Honors Grade 1 2008  – 2011 Modules included, \n \nProcesses and Operations Management, \nPolymer design  \nControl and Power Technology  \nElectrical and Energy Science \nMechanics \nMaths  \nMaterials and Processes  \nEngineering Workshop Drawing, Auto-CAD and Pro-Engineer \nCommunications and Computer Applications \nInstrumentation  \nEnergy Systems and Thermo-fluids Honors & Awards Engineering student of the year Scoil mhuire convent of mercy 2008 Engineering student of the year Scoil mhuire convent of mercy 2006 Engineering student of the year Scoil mhuire convent of mercy 2008 Engineering student of the year Scoil mhuire convent of mercy 2008 Engineering student of the year Scoil mhuire convent of mercy 2008 Engineering student of the year Scoil mhuire convent of mercy 2006 Engineering student of the year Scoil mhuire convent of mercy 2006 Engineering student of the year Scoil mhuire convent of mercy 2006 ", "Summary •\tMEng in Electronic Engineering with Nanotechnology \n•\tMore than three years’ experience in experimental and computational skills \n•\tExperimental experience includes the use of AFM, STM, SEM-FIB, TCSPC, UV-vis, FTIR and PPMS \n•\tInterest in and familiarity with current progress in the self-assembly of nanoparticle arrays and nanoplasmonic theory as well as the physical properties of ZnO nanowires Summary •\tMEng in Electronic Engineering with Nanotechnology \n•\tMore than three years’ experience in experimental and computational skills \n•\tExperimental experience includes the use of AFM, STM, SEM-FIB, TCSPC, UV-vis, FTIR and PPMS \n•\tInterest in and familiarity with current progress in the self-assembly of nanoparticle arrays and nanoplasmonic theory as well as the physical properties of ZnO nanowires •\tMEng in Electronic Engineering with Nanotechnology \n•\tMore than three years’ experience in experimental and computational skills \n•\tExperimental experience includes the use of AFM, STM, SEM-FIB, TCSPC, UV-vis, FTIR and PPMS \n•\tInterest in and familiarity with current progress in the self-assembly of nanoparticle arrays and nanoplasmonic theory as well as the physical properties of ZnO nanowires •\tMEng in Electronic Engineering with Nanotechnology \n•\tMore than three years’ experience in experimental and computational skills \n•\tExperimental experience includes the use of AFM, STM, SEM-FIB, TCSPC, UV-vis, FTIR and PPMS \n•\tInterest in and familiarity with current progress in the self-assembly of nanoparticle arrays and nanoplasmonic theory as well as the physical properties of ZnO nanowires Experience Graduate Process Engineer Intel Corporation September 2013  –  May 2015  (1 year 9 months) F24 IR-Leixlip Summer Internship London Centre for Nanotechnology June 2012  –  August 2012  (3 months) Bloomsbury - London Interfacing Keithley 4200-SCS to the PPMS MultiVu software with NI LabVIEW application program UCL Summer Research University College London June 2011  –  August 2011  (3 months) Torrington Place, London Structural studies of self-assembled nanoparticle arrays. Funded by the “Nuffied Foundation Undergraduate Research Bursary” UCL 2010 Summer Work Experience Programme University College London June 2010  –  September 2010  (4 months) Torrington Place - London PCB design of current source for DS-DBR laser and voltage controller for Mach-Zehnder interferometer modulator Graduate Process Engineer Intel Corporation September 2013  –  May 2015  (1 year 9 months) F24 IR-Leixlip Graduate Process Engineer Intel Corporation September 2013  –  May 2015  (1 year 9 months) F24 IR-Leixlip Summer Internship London Centre for Nanotechnology June 2012  –  August 2012  (3 months) Bloomsbury - London Interfacing Keithley 4200-SCS to the PPMS MultiVu software with NI LabVIEW application program Summer Internship London Centre for Nanotechnology June 2012  –  August 2012  (3 months) Bloomsbury - London Interfacing Keithley 4200-SCS to the PPMS MultiVu software with NI LabVIEW application program UCL Summer Research University College London June 2011  –  August 2011  (3 months) Torrington Place, London Structural studies of self-assembled nanoparticle arrays. Funded by the “Nuffied Foundation Undergraduate Research Bursary” UCL Summer Research University College London June 2011  –  August 2011  (3 months) Torrington Place, London Structural studies of self-assembled nanoparticle arrays. Funded by the “Nuffied Foundation Undergraduate Research Bursary” UCL 2010 Summer Work Experience Programme University College London June 2010  –  September 2010  (4 months) Torrington Place - London PCB design of current source for DS-DBR laser and voltage controller for Mach-Zehnder interferometer modulator UCL 2010 Summer Work Experience Programme University College London June 2010  –  September 2010  (4 months) Torrington Place - London PCB design of current source for DS-DBR laser and voltage controller for Mach-Zehnder interferometer modulator Languages Hebrew English Hebrew English Hebrew English Skills Matlab AFM Labview Java Lumerical FDTD TCSPC UV-Vis-NIR FTIR PPMS FIB-SEM Algorithms Physics Nanoparticles Nanotechnology UV/Vis Powder X-ray Diffraction Nanomaterials Materials Science See 3+     See less Skills  Matlab AFM Labview Java Lumerical FDTD TCSPC UV-Vis-NIR FTIR PPMS FIB-SEM Algorithms Physics Nanoparticles Nanotechnology UV/Vis Powder X-ray Diffraction Nanomaterials Materials Science See 3+     See less Matlab AFM Labview Java Lumerical FDTD TCSPC UV-Vis-NIR FTIR PPMS FIB-SEM Algorithms Physics Nanoparticles Nanotechnology UV/Vis Powder X-ray Diffraction Nanomaterials Materials Science See 3+     See less Matlab AFM Labview Java Lumerical FDTD TCSPC UV-Vis-NIR FTIR PPMS FIB-SEM Algorithms Physics Nanoparticles Nanotechnology UV/Vis Powder X-ray Diffraction Nanomaterials Materials Science See 3+     See less Education University College London, U. of London Master of Engineering (MEng),  Electronic Engineering with Nanotechnology 2009  – 2013 Birkbeck College, University of London Certificate of Higher Education in Physics and Mathematics,  Physics and Mathematics , Distinction 2008  – 2009 University College London, U. of London Master of Engineering (MEng),  Electronic Engineering with Nanotechnology 2009  – 2013 University College London, U. of London Master of Engineering (MEng),  Electronic Engineering with Nanotechnology 2009  – 2013 University College London, U. of London Master of Engineering (MEng),  Electronic Engineering with Nanotechnology 2009  – 2013 Birkbeck College, University of London Certificate of Higher Education in Physics and Mathematics,  Physics and Mathematics , Distinction 2008  – 2009 Birkbeck College, University of London Certificate of Higher Education in Physics and Mathematics,  Physics and Mathematics , Distinction 2008  – 2009 Birkbeck College, University of London Certificate of Higher Education in Physics and Mathematics,  Physics and Mathematics , Distinction 2008  – 2009 Honors & Awards Departmental Project Prize Department of Electronic & Electrical Engineering - University College London July 2012 Sessional for 2011-12 academic year in recognition of results achieved and outstanding third year project Goldsmid Prize Department of Electronic & Electrical Engineering - University College London July 2011 Sessional for 2010-11 academic year in recognition of results achieved Goldsmid Prize Department of Electronic & Electrical Engineering - University College London July 2010 Sessional for 2009-10 academic year in recognition of results achieved Departmental Project Prize Department of Electronic & Electrical Engineering - University College London July 2013 Sessional for 2012-13 academic year in recognition of results achieved and outstanding Fourth Year project Departmental Project Prize Department of Electronic & Electrical Engineering - University College London July 2012 Sessional for 2011-12 academic year in recognition of results achieved and outstanding third year project Departmental Project Prize Department of Electronic & Electrical Engineering - University College London July 2012 Sessional for 2011-12 academic year in recognition of results achieved and outstanding third year project Departmental Project Prize Department of Electronic & Electrical Engineering - University College London July 2012 Sessional for 2011-12 academic year in recognition of results achieved and outstanding third year project Goldsmid Prize Department of Electronic & Electrical Engineering - University College London July 2011 Sessional for 2010-11 academic year in recognition of results achieved Goldsmid Prize Department of Electronic & Electrical Engineering - University College London July 2011 Sessional for 2010-11 academic year in recognition of results achieved Goldsmid Prize Department of Electronic & Electrical Engineering - University College London July 2011 Sessional for 2010-11 academic year in recognition of results achieved Goldsmid Prize Department of Electronic & Electrical Engineering - University College London July 2010 Sessional for 2009-10 academic year in recognition of results achieved Goldsmid Prize Department of Electronic & Electrical Engineering - University College London July 2010 Sessional for 2009-10 academic year in recognition of results achieved Goldsmid Prize Department of Electronic & Electrical Engineering - University College London July 2010 Sessional for 2009-10 academic year in recognition of results achieved Departmental Project Prize Department of Electronic & Electrical Engineering - University College London July 2013 Sessional for 2012-13 academic year in recognition of results achieved and outstanding Fourth Year project Departmental Project Prize Department of Electronic & Electrical Engineering - University College London July 2013 Sessional for 2012-13 academic year in recognition of results achieved and outstanding Fourth Year project Departmental Project Prize Department of Electronic & Electrical Engineering - University College London July 2013 Sessional for 2012-13 academic year in recognition of results achieved and outstanding Fourth Year project ", "Experience Consultant EY September 2014  – Present (1 year) London, United Kingdom Graduate Process Engineer Intel Corporation October 2013  –  August 2014  (11 months) Lieutenant Cyprus National Guard July 2007  –  August 2009  (2 years 2 months) Consultant EY September 2014  – Present (1 year) London, United Kingdom Consultant EY September 2014  – Present (1 year) London, United Kingdom Graduate Process Engineer Intel Corporation October 2013  –  August 2014  (11 months) Graduate Process Engineer Intel Corporation October 2013  –  August 2014  (11 months) Lieutenant Cyprus National Guard July 2007  –  August 2009  (2 years 2 months) Lieutenant Cyprus National Guard July 2007  –  August 2009  (2 years 2 months) Skills Physics Simulations C++ Matlab Statistics Fortran Mathematica LaTeX Engineering Labview Microsoft Excel Microsoft Word PowerPoint Skills  Physics Simulations C++ Matlab Statistics Fortran Mathematica LaTeX Engineering Labview Microsoft Excel Microsoft Word PowerPoint Physics Simulations C++ Matlab Statistics Fortran Mathematica LaTeX Engineering Labview Microsoft Excel Microsoft Word PowerPoint Physics Simulations C++ Matlab Statistics Fortran Mathematica LaTeX Engineering Labview Microsoft Excel Microsoft Word PowerPoint Education Imperial College London MSc,  Physics , Merit 2012  – 2013 Imperial College London BSc,  Physics with Theoretical Physics , 2-1 2009  – 2012 Activities and Societies:  Imperial College Football Club Imperial College London MSc,  Physics , Merit 2012  – 2013 Imperial College London MSc,  Physics , Merit 2012  – 2013 Imperial College London MSc,  Physics , Merit 2012  – 2013 Imperial College London BSc,  Physics with Theoretical Physics , 2-1 2009  – 2012 Activities and Societies:  Imperial College Football Club Imperial College London BSc,  Physics with Theoretical Physics , 2-1 2009  – 2012 Activities and Societies:  Imperial College Football Club Imperial College London BSc,  Physics with Theoretical Physics , 2-1 2009  – 2012 Activities and Societies:  Imperial College Football Club ", "Summary Young, hardworking, innovative materials science and engineering masters graduate. Currently working as a photolithography engineer at Intel. Summary Young, hardworking, innovative materials science and engineering masters graduate. Currently working as a photolithography engineer at Intel. Young, hardworking, innovative materials science and engineering masters graduate. Currently working as a photolithography engineer at Intel. Young, hardworking, innovative materials science and engineering masters graduate. Currently working as a photolithography engineer at Intel. Experience Graduate Process Engineer Intel Corporation March 2015  – Present (6 months) Leixlip, Kildare, Ireland Photolithography Scanner Engineer Student UCD September 2009  –  September 2014  (5 years 1 month) Three Year Bsc. Mechanical Engineering: \nPhysics, Chemistry, Mechanics, Mathematics, Applied Dynamics, Heat Transfer, Computer Science, Fluid Mechanics etc. \nTwo Year ME Materials Science & Engineering: \nTechnical Ceramics, Fracture Mechanics, Nanomaterials, Solid State Electronics, Thermodynamics & Kinetics of Materials, Professional Work Placement, Research Project (Biomaterials) etc. Student Manufacturing Process Engineer Nypro January 2013  –  August 2013  (8 months) Corke Abbey, Bray, Co. Dublin Set up & Managed Toolroom Operations Board (Lean Manufacturing), \nTool Service Preventative Maintenance Instructions, \nIMM Repair Analysis Labourer Fencemaster May 2009  –  September 2012  (3 years 5 months) Fence Erecting Summer Internship Bellurgan Precision Engineering May 2011  –  September 2011  (5 months) Compiling and Structuring BOM’s/BOO’s for new main frame ERP system Temporary Clerical Officer Revenue Comissioners June 2010  –  September 2010  (4 months) Telephone switchboard, transferring calls, dealing with queries, external lines for calls abroad Barman (Part time) Blue Anchor Pub May 2007  –  September 2010  (3 years 5 months) Bellurgan Point, Dundalk Serving Customers, General Bar Work Graduate Process Engineer Intel Corporation March 2015  – Present (6 months) Leixlip, Kildare, Ireland Photolithography Scanner Engineer Graduate Process Engineer Intel Corporation March 2015  – Present (6 months) Leixlip, Kildare, Ireland Photolithography Scanner Engineer Student UCD September 2009  –  September 2014  (5 years 1 month) Three Year Bsc. Mechanical Engineering: \nPhysics, Chemistry, Mechanics, Mathematics, Applied Dynamics, Heat Transfer, Computer Science, Fluid Mechanics etc. \nTwo Year ME Materials Science & Engineering: \nTechnical Ceramics, Fracture Mechanics, Nanomaterials, Solid State Electronics, Thermodynamics & Kinetics of Materials, Professional Work Placement, Research Project (Biomaterials) etc. Student UCD September 2009  –  September 2014  (5 years 1 month) Three Year Bsc. Mechanical Engineering: \nPhysics, Chemistry, Mechanics, Mathematics, Applied Dynamics, Heat Transfer, Computer Science, Fluid Mechanics etc. \nTwo Year ME Materials Science & Engineering: \nTechnical Ceramics, Fracture Mechanics, Nanomaterials, Solid State Electronics, Thermodynamics & Kinetics of Materials, Professional Work Placement, Research Project (Biomaterials) etc. Student Manufacturing Process Engineer Nypro January 2013  –  August 2013  (8 months) Corke Abbey, Bray, Co. Dublin Set up & Managed Toolroom Operations Board (Lean Manufacturing), \nTool Service Preventative Maintenance Instructions, \nIMM Repair Analysis Student Manufacturing Process Engineer Nypro January 2013  –  August 2013  (8 months) Corke Abbey, Bray, Co. Dublin Set up & Managed Toolroom Operations Board (Lean Manufacturing), \nTool Service Preventative Maintenance Instructions, \nIMM Repair Analysis Labourer Fencemaster May 2009  –  September 2012  (3 years 5 months) Fence Erecting Labourer Fencemaster May 2009  –  September 2012  (3 years 5 months) Fence Erecting Summer Internship Bellurgan Precision Engineering May 2011  –  September 2011  (5 months) Compiling and Structuring BOM’s/BOO’s for new main frame ERP system Summer Internship Bellurgan Precision Engineering May 2011  –  September 2011  (5 months) Compiling and Structuring BOM’s/BOO’s for new main frame ERP system Temporary Clerical Officer Revenue Comissioners June 2010  –  September 2010  (4 months) Telephone switchboard, transferring calls, dealing with queries, external lines for calls abroad Temporary Clerical Officer Revenue Comissioners June 2010  –  September 2010  (4 months) Telephone switchboard, transferring calls, dealing with queries, external lines for calls abroad Barman (Part time) Blue Anchor Pub May 2007  –  September 2010  (3 years 5 months) Bellurgan Point, Dundalk Serving Customers, General Bar Work Barman (Part time) Blue Anchor Pub May 2007  –  September 2010  (3 years 5 months) Bellurgan Point, Dundalk Serving Customers, General Bar Work Skills Microsoft Office Microsoft Excel Microsoft Word PowerPoint Pro Engineer Engineering Cambridge Engineering... C+ Maintenance Management Materials Science Mechanical Engineering Materials Research Teamwork Skills  Microsoft Office Microsoft Excel Microsoft Word PowerPoint Pro Engineer Engineering Cambridge Engineering... C+ Maintenance Management Materials Science Mechanical Engineering Materials Research Teamwork Microsoft Office Microsoft Excel Microsoft Word PowerPoint Pro Engineer Engineering Cambridge Engineering... C+ Maintenance Management Materials Science Mechanical Engineering Materials Research Teamwork Microsoft Office Microsoft Excel Microsoft Word PowerPoint Pro Engineer Engineering Cambridge Engineering... C+ Maintenance Management Materials Science Mechanical Engineering Materials Research Teamwork Education UCD Master's degree,  Materials Science & Engineering , 2.1 (Expected) 2012  – 2014 2 Year ME in Materials Science & Engineering Activities and Societies:  Eng.Soc. ,  Pool Society ,  LawSoc. ,  L&H Soc. ,  Comedy Soc. University College Dublin Bachelor's Degree,  Mechanical Engineering , 2nd Class Honours, Grade 2 (GPA 2.74) 2009  – 2012 3 Year Mechanical Engineering Degree Activities and Societies:  Engineering Society ,  Pool & Snooker Club Bush Post Primary School Leaving Certificate 2004  – 2009 UCD Master's degree,  Materials Science & Engineering , 2.1 (Expected) 2012  – 2014 2 Year ME in Materials Science & Engineering Activities and Societies:  Eng.Soc. ,  Pool Society ,  LawSoc. ,  L&H Soc. ,  Comedy Soc. UCD Master's degree,  Materials Science & Engineering , 2.1 (Expected) 2012  – 2014 2 Year ME in Materials Science & Engineering Activities and Societies:  Eng.Soc. ,  Pool Society ,  LawSoc. ,  L&H Soc. ,  Comedy Soc. UCD Master's degree,  Materials Science & Engineering , 2.1 (Expected) 2012  – 2014 2 Year ME in Materials Science & Engineering Activities and Societies:  Eng.Soc. ,  Pool Society ,  LawSoc. ,  L&H Soc. ,  Comedy Soc. University College Dublin Bachelor's Degree,  Mechanical Engineering , 2nd Class Honours, Grade 2 (GPA 2.74) 2009  – 2012 3 Year Mechanical Engineering Degree Activities and Societies:  Engineering Society ,  Pool & Snooker Club University College Dublin Bachelor's Degree,  Mechanical Engineering , 2nd Class Honours, Grade 2 (GPA 2.74) 2009  – 2012 3 Year Mechanical Engineering Degree Activities and Societies:  Engineering Society ,  Pool & Snooker Club University College Dublin Bachelor's Degree,  Mechanical Engineering , 2nd Class Honours, Grade 2 (GPA 2.74) 2009  – 2012 3 Year Mechanical Engineering Degree Activities and Societies:  Engineering Society ,  Pool & Snooker Club Bush Post Primary School Leaving Certificate 2004  – 2009 Bush Post Primary School Leaving Certificate 2004  – 2009 Bush Post Primary School Leaving Certificate 2004  – 2009 "]}