{"position": "Hardware Verification Engineer", "company": "IBM", "profiles": ["Experience Hardware Verification Engineer Apple July 2014  – Present (1 year 2 months) Cupertino, CA Senior Hardware Verification Engineer IBM November 2011  –  June 2014  (2 years 8 months) Poughkeepsie, NY, USA Processor verification lead for System z chips. Senior Hardware Verification Engineer IBM October 2003  –  October 2011  (8 years 1 month) Boeblingen, Germany Student at University of Cooperative Education IBM Deutschland GmbH October 2000  –  September 2003  (3 years) Technical Support Engineer bits + bytes it-solutions gmbh + co. kg October 1997  –  August 2000  (2 years 11 months) Hardware Verification Engineer Apple July 2014  – Present (1 year 2 months) Cupertino, CA Hardware Verification Engineer Apple July 2014  – Present (1 year 2 months) Cupertino, CA Senior Hardware Verification Engineer IBM November 2011  –  June 2014  (2 years 8 months) Poughkeepsie, NY, USA Processor verification lead for System z chips. Senior Hardware Verification Engineer IBM November 2011  –  June 2014  (2 years 8 months) Poughkeepsie, NY, USA Processor verification lead for System z chips. Senior Hardware Verification Engineer IBM October 2003  –  October 2011  (8 years 1 month) Boeblingen, Germany Senior Hardware Verification Engineer IBM October 2003  –  October 2011  (8 years 1 month) Boeblingen, Germany Student at University of Cooperative Education IBM Deutschland GmbH October 2000  –  September 2003  (3 years) Student at University of Cooperative Education IBM Deutschland GmbH October 2000  –  September 2003  (3 years) Technical Support Engineer bits + bytes it-solutions gmbh + co. kg October 1997  –  August 2000  (2 years 11 months) Technical Support Engineer bits + bytes it-solutions gmbh + co. kg October 1997  –  August 2000  (2 years 11 months) Skills Functional Verification Formal Verification Computer Architecture VHDL Microprocessors Perl C++ C Hardware Simulation Unix Java Hardware Verification Test Planning Analysis ASIC EDA RTL design Hardware Design Debugging Development Tools CVS Assembly Shell Scripting Scripting Computer Hardware OOP Object Oriented Design Linux Process Development Testing Computer Science Processors Programming PowerPC Algorithms Hardware Architecture Software Development Bash Unix Shell Scripting Assembly Language Verilog Logic Design VLSI SoC See 30+     See less Skills  Functional Verification Formal Verification Computer Architecture VHDL Microprocessors Perl C++ C Hardware Simulation Unix Java Hardware Verification Test Planning Analysis ASIC EDA RTL design Hardware Design Debugging Development Tools CVS Assembly Shell Scripting Scripting Computer Hardware OOP Object Oriented Design Linux Process Development Testing Computer Science Processors Programming PowerPC Algorithms Hardware Architecture Software Development Bash Unix Shell Scripting Assembly Language Verilog Logic Design VLSI SoC See 30+     See less Functional Verification Formal Verification Computer Architecture VHDL Microprocessors Perl C++ C Hardware Simulation Unix Java Hardware Verification Test Planning Analysis ASIC EDA RTL design Hardware Design Debugging Development Tools CVS Assembly Shell Scripting Scripting Computer Hardware OOP Object Oriented Design Linux Process Development Testing Computer Science Processors Programming PowerPC Algorithms Hardware Architecture Software Development Bash Unix Shell Scripting Assembly Language Verilog Logic Design VLSI SoC See 30+     See less Functional Verification Formal Verification Computer Architecture VHDL Microprocessors Perl C++ C Hardware Simulation Unix Java Hardware Verification Test Planning Analysis ASIC EDA RTL design Hardware Design Debugging Development Tools CVS Assembly Shell Scripting Scripting Computer Hardware OOP Object Oriented Design Linux Process Development Testing Computer Science Processors Programming PowerPC Algorithms Hardware Architecture Software Development Bash Unix Shell Scripting Assembly Language Verilog Logic Design VLSI SoC See 30+     See less Education Berufsakademie Stuttgart Diplom-Ingenieur(BA),  Computer-Science , Engineering 2000  – 2003 Open University - London Bachelor of Science,  Computer Science 2000  – 2003 Berufsakademie Stuttgart Diplom-Ingenieur(BA),  Computer-Science , Engineering 2000  – 2003 Berufsakademie Stuttgart Diplom-Ingenieur(BA),  Computer-Science , Engineering 2000  – 2003 Berufsakademie Stuttgart Diplom-Ingenieur(BA),  Computer-Science , Engineering 2000  – 2003 Open University - London Bachelor of Science,  Computer Science 2000  – 2003 Open University - London Bachelor of Science,  Computer Science 2000  – 2003 Open University - London Bachelor of Science,  Computer Science 2000  – 2003 ", "Experience Microprocessor Hardware Verification Engineer IBM Microprocessor Hardware Verification Engineer IBM Microprocessor Hardware Verification Engineer IBM ", "Summary Mr. Brower provides information architecture expertise by transforming stagnant data into contextual, rich information. He has a technical background working with very large, complex systems and fusing disparate data sets. This exposure has provided him with a fresh perspective for applying emerging methodologies and state-of-the-art technology to create actionable intelligence for customers. Mr. Brower is able to use his experience to articulate discussions at various layers of abstraction to audiences, enabling him to communicate clearly with developers and customer alike. With expertise in customer development, training, system support, and product management. Mr. Brower is interested opportunities that will allow him to leverage experience, continue his professional development, and to incorporate his vision to aid in solving critical customer problems. Summary Mr. Brower provides information architecture expertise by transforming stagnant data into contextual, rich information. He has a technical background working with very large, complex systems and fusing disparate data sets. This exposure has provided him with a fresh perspective for applying emerging methodologies and state-of-the-art technology to create actionable intelligence for customers. Mr. Brower is able to use his experience to articulate discussions at various layers of abstraction to audiences, enabling him to communicate clearly with developers and customer alike. With expertise in customer development, training, system support, and product management. Mr. Brower is interested opportunities that will allow him to leverage experience, continue his professional development, and to incorporate his vision to aid in solving critical customer problems. Mr. Brower provides information architecture expertise by transforming stagnant data into contextual, rich information. He has a technical background working with very large, complex systems and fusing disparate data sets. This exposure has provided him with a fresh perspective for applying emerging methodologies and state-of-the-art technology to create actionable intelligence for customers. Mr. Brower is able to use his experience to articulate discussions at various layers of abstraction to audiences, enabling him to communicate clearly with developers and customer alike. With expertise in customer development, training, system support, and product management. Mr. Brower is interested opportunities that will allow him to leverage experience, continue his professional development, and to incorporate his vision to aid in solving critical customer problems. Mr. Brower provides information architecture expertise by transforming stagnant data into contextual, rich information. He has a technical background working with very large, complex systems and fusing disparate data sets. This exposure has provided him with a fresh perspective for applying emerging methodologies and state-of-the-art technology to create actionable intelligence for customers. Mr. Brower is able to use his experience to articulate discussions at various layers of abstraction to audiences, enabling him to communicate clearly with developers and customer alike. With expertise in customer development, training, system support, and product management. Mr. Brower is interested opportunities that will allow him to leverage experience, continue his professional development, and to incorporate his vision to aid in solving critical customer problems. Experience Founder Virtual Team Captain February 2014  – Present (1 year 7 months) When it comes to team sports, I am huge advocate of getting my game on. I have played sports since my college days, and while I love playing I was never a big fan of the duties and responsibilities that come with being a team captain. I love getting out there to play and lead, but when you mix business and pleasure with friends it can be tough. Streamlining the burden of managing a team should not be a responsibility one person should have to take on, so make it a team effort with Virtual Team Captain. Get your game on, and let us worry about the details! Design Engineer Design by Etzel, LLC March 2010  – Present (5 years 6 months) Northern Virginia Innovation has to incorporate design, yet it is commonly one of the most overlooked aspects when creating a solution. My experience working with customers in the Information Technology Industry has shown me that understanding their problems is a critical step towards identifying any viable solution. The more refined that understanding, the better the solution can be. If you are looking to infuse design into your next big project, feel free to reach out. Here's to putting designs together that are so cool, ... they have you thinking whether you are in the same house! Design Engineer Verite Group, Inc. May 2014  – Present (1 year 4 months) Dulles, VA Provide business development and data analytics expertise to a specialty engineering and research incubator. My responsibilities include establishing business and data analysis strategy for the next generation of Verite's products. I really enjoy working with our customers to help solve their problems, no matter what industry they are working within. With the aid of technology and process, I have enjoyed synthesizing solutions to advance our customers goals and missions. Business Development Consultant Verite Educational Systems May 2014  – Present (1 year 4 months) Development and execution of the short and long term business development strategy for Net-Ref, a product positioned to help teachers control how their students use the Internet. Responsibilities include managing our social media presence, communications and press releases, customer relationships, and branding. Embedded Analyst Palantir Technologies September 2010  –  January 2014  (3 years 5 months) McLean, VA Development of strong customer relationships for access to their most challenging problems  \nApplication of user adoption methodologies to achieve product usage and retention milestones  \nSupport of product management lifecycle via direct user engagement and facilitated feedback  \nConfiguration and deployment of Palantir products to include the Palantir Gotham Workspace, Palantir Web, Executive Dashboard, and Primer Video Training Portal  \nProvision of Tier 1 / Tier 2 technical support and administration for enterprise product offerings  \nCreation of training curriculums, demonstrations, marketing materials, and value added capabilities for customers on site Product Manager Cobham Analytic Solutions (formerly Sparta, Inc) October 2007  –  September 2010  (3 years) •\tManages requirements, features, and release schedule for enterprise deployments \n•\tFacilitates requirements gathering / generation, design, and implementation using Version One, Word, Visio, and Excel \n•\tExecutes functional and performance testing with the aid of Gemini / Version One, Subversion, Trac, Hudson, Glassfish, Wireshark, and Microsoft SQL Server in Windows XP/Server and Linux Red Hat / Debian environments \n•\tResearch and applies strategies, techniques, and new technologies to deployments to provide value added capabilities \n•\tStage, integrate, and maintain testbeds using RackMonkey, VMware, and VPNs  \n•\tOn-site technical support utilizing Debian and Red Hat Linux shell scripting, Microsoft SQL Server, MySQL, and custom software applications \n•\tProvides analyst training and operational support Senior Network Engineer Trace Systems March 2007  –  September 2007  (7 months) •\tTechnical SME for C4ISR Terrestrial and Wireless Networking, Mobile Satellite technology, and associate service offerings \n•\tDrafted marketing and technical whitepapers for State-of-the-Art Communications Technology \n•\tWrote technical proposals for marketing and contracting engagements \n•\tAided in the Mergers and Acquisitions due diligence process with financial analysis and technical support \n•\tIdentified and pursued opportunities enable strategic positioning and technology immersion Software Engineer August Schell Enterprises September 2006  –  March 2007  (7 months) •\tUtilized Subversion, Apache Maven, and Unix scripting to create a common project structure, automated documentation generation, project websites, and an automated build process (PKI Team) \n•\tCustomized the Endeca Information Access Platform to establish, discover, and analyze patterns between massive amounts of information using Java, Perl, and XML (Endeca Federal Team) Senior Consultant Booz Allen Hamilton July 2004  –  September 2006  (2 years 3 months) •\tSupported various DoD GIG networking projects, including JTEO/MJPO & TSAT, JTRS, GIG E2E SE Working Groups (i.e. Supported the Transport Services WG and IP Multicast WG, and lead the TCP Performance Enhancement Sub-WB) \n•\tCreated intellectual capital through the development and demonstration of emerging technologies, such as IP Header Compression \n•\tConducted advanced research and analysis for Network Performance Enhancement in the areas of IP Header Compression, IPsec, and IP Multicast \n•\tParticipated in IETF standardization efforts involving Header Compression and IPsec (IETF RFCs 5856 / 5857) \n•\tServed as the Hybrid Communications Lab Manager for the Center for Network and Systems Innovation procuring and maintaining equipment, as well as assisting with client projects and testbeds Hardware Verification Engineer IBM May 2003  –  August 2003  (4 months) Advanced Hardware Verification \n- Automated of Chart Debugging Database with Unix Programming \n- Functionally verified functions for IBM’s T-saurs chip using C \n- Attended IBM Verification Class for practical experience with tools and methods \n- Transformed IBM’s online verification tutorial from AIX to a web based environment using Java Founder Virtual Team Captain February 2014  – Present (1 year 7 months) When it comes to team sports, I am huge advocate of getting my game on. I have played sports since my college days, and while I love playing I was never a big fan of the duties and responsibilities that come with being a team captain. I love getting out there to play and lead, but when you mix business and pleasure with friends it can be tough. Streamlining the burden of managing a team should not be a responsibility one person should have to take on, so make it a team effort with Virtual Team Captain. Get your game on, and let us worry about the details! Founder Virtual Team Captain February 2014  – Present (1 year 7 months) When it comes to team sports, I am huge advocate of getting my game on. I have played sports since my college days, and while I love playing I was never a big fan of the duties and responsibilities that come with being a team captain. I love getting out there to play and lead, but when you mix business and pleasure with friends it can be tough. Streamlining the burden of managing a team should not be a responsibility one person should have to take on, so make it a team effort with Virtual Team Captain. Get your game on, and let us worry about the details! Design Engineer Design by Etzel, LLC March 2010  – Present (5 years 6 months) Northern Virginia Innovation has to incorporate design, yet it is commonly one of the most overlooked aspects when creating a solution. My experience working with customers in the Information Technology Industry has shown me that understanding their problems is a critical step towards identifying any viable solution. The more refined that understanding, the better the solution can be. If you are looking to infuse design into your next big project, feel free to reach out. Here's to putting designs together that are so cool, ... they have you thinking whether you are in the same house! Design Engineer Design by Etzel, LLC March 2010  – Present (5 years 6 months) Northern Virginia Innovation has to incorporate design, yet it is commonly one of the most overlooked aspects when creating a solution. My experience working with customers in the Information Technology Industry has shown me that understanding their problems is a critical step towards identifying any viable solution. The more refined that understanding, the better the solution can be. If you are looking to infuse design into your next big project, feel free to reach out. Here's to putting designs together that are so cool, ... they have you thinking whether you are in the same house! Design Engineer Verite Group, Inc. May 2014  – Present (1 year 4 months) Dulles, VA Provide business development and data analytics expertise to a specialty engineering and research incubator. My responsibilities include establishing business and data analysis strategy for the next generation of Verite's products. I really enjoy working with our customers to help solve their problems, no matter what industry they are working within. With the aid of technology and process, I have enjoyed synthesizing solutions to advance our customers goals and missions. Design Engineer Verite Group, Inc. May 2014  – Present (1 year 4 months) Dulles, VA Provide business development and data analytics expertise to a specialty engineering and research incubator. My responsibilities include establishing business and data analysis strategy for the next generation of Verite's products. I really enjoy working with our customers to help solve their problems, no matter what industry they are working within. With the aid of technology and process, I have enjoyed synthesizing solutions to advance our customers goals and missions. Business Development Consultant Verite Educational Systems May 2014  – Present (1 year 4 months) Development and execution of the short and long term business development strategy for Net-Ref, a product positioned to help teachers control how their students use the Internet. Responsibilities include managing our social media presence, communications and press releases, customer relationships, and branding. Business Development Consultant Verite Educational Systems May 2014  – Present (1 year 4 months) Development and execution of the short and long term business development strategy for Net-Ref, a product positioned to help teachers control how their students use the Internet. Responsibilities include managing our social media presence, communications and press releases, customer relationships, and branding. Embedded Analyst Palantir Technologies September 2010  –  January 2014  (3 years 5 months) McLean, VA Development of strong customer relationships for access to their most challenging problems  \nApplication of user adoption methodologies to achieve product usage and retention milestones  \nSupport of product management lifecycle via direct user engagement and facilitated feedback  \nConfiguration and deployment of Palantir products to include the Palantir Gotham Workspace, Palantir Web, Executive Dashboard, and Primer Video Training Portal  \nProvision of Tier 1 / Tier 2 technical support and administration for enterprise product offerings  \nCreation of training curriculums, demonstrations, marketing materials, and value added capabilities for customers on site Embedded Analyst Palantir Technologies September 2010  –  January 2014  (3 years 5 months) McLean, VA Development of strong customer relationships for access to their most challenging problems  \nApplication of user adoption methodologies to achieve product usage and retention milestones  \nSupport of product management lifecycle via direct user engagement and facilitated feedback  \nConfiguration and deployment of Palantir products to include the Palantir Gotham Workspace, Palantir Web, Executive Dashboard, and Primer Video Training Portal  \nProvision of Tier 1 / Tier 2 technical support and administration for enterprise product offerings  \nCreation of training curriculums, demonstrations, marketing materials, and value added capabilities for customers on site Product Manager Cobham Analytic Solutions (formerly Sparta, Inc) October 2007  –  September 2010  (3 years) •\tManages requirements, features, and release schedule for enterprise deployments \n•\tFacilitates requirements gathering / generation, design, and implementation using Version One, Word, Visio, and Excel \n•\tExecutes functional and performance testing with the aid of Gemini / Version One, Subversion, Trac, Hudson, Glassfish, Wireshark, and Microsoft SQL Server in Windows XP/Server and Linux Red Hat / Debian environments \n•\tResearch and applies strategies, techniques, and new technologies to deployments to provide value added capabilities \n•\tStage, integrate, and maintain testbeds using RackMonkey, VMware, and VPNs  \n•\tOn-site technical support utilizing Debian and Red Hat Linux shell scripting, Microsoft SQL Server, MySQL, and custom software applications \n•\tProvides analyst training and operational support Product Manager Cobham Analytic Solutions (formerly Sparta, Inc) October 2007  –  September 2010  (3 years) •\tManages requirements, features, and release schedule for enterprise deployments \n•\tFacilitates requirements gathering / generation, design, and implementation using Version One, Word, Visio, and Excel \n•\tExecutes functional and performance testing with the aid of Gemini / Version One, Subversion, Trac, Hudson, Glassfish, Wireshark, and Microsoft SQL Server in Windows XP/Server and Linux Red Hat / Debian environments \n•\tResearch and applies strategies, techniques, and new technologies to deployments to provide value added capabilities \n•\tStage, integrate, and maintain testbeds using RackMonkey, VMware, and VPNs  \n•\tOn-site technical support utilizing Debian and Red Hat Linux shell scripting, Microsoft SQL Server, MySQL, and custom software applications \n•\tProvides analyst training and operational support Senior Network Engineer Trace Systems March 2007  –  September 2007  (7 months) •\tTechnical SME for C4ISR Terrestrial and Wireless Networking, Mobile Satellite technology, and associate service offerings \n•\tDrafted marketing and technical whitepapers for State-of-the-Art Communications Technology \n•\tWrote technical proposals for marketing and contracting engagements \n•\tAided in the Mergers and Acquisitions due diligence process with financial analysis and technical support \n•\tIdentified and pursued opportunities enable strategic positioning and technology immersion Senior Network Engineer Trace Systems March 2007  –  September 2007  (7 months) •\tTechnical SME for C4ISR Terrestrial and Wireless Networking, Mobile Satellite technology, and associate service offerings \n•\tDrafted marketing and technical whitepapers for State-of-the-Art Communications Technology \n•\tWrote technical proposals for marketing and contracting engagements \n•\tAided in the Mergers and Acquisitions due diligence process with financial analysis and technical support \n•\tIdentified and pursued opportunities enable strategic positioning and technology immersion Software Engineer August Schell Enterprises September 2006  –  March 2007  (7 months) •\tUtilized Subversion, Apache Maven, and Unix scripting to create a common project structure, automated documentation generation, project websites, and an automated build process (PKI Team) \n•\tCustomized the Endeca Information Access Platform to establish, discover, and analyze patterns between massive amounts of information using Java, Perl, and XML (Endeca Federal Team) Software Engineer August Schell Enterprises September 2006  –  March 2007  (7 months) •\tUtilized Subversion, Apache Maven, and Unix scripting to create a common project structure, automated documentation generation, project websites, and an automated build process (PKI Team) \n•\tCustomized the Endeca Information Access Platform to establish, discover, and analyze patterns between massive amounts of information using Java, Perl, and XML (Endeca Federal Team) Senior Consultant Booz Allen Hamilton July 2004  –  September 2006  (2 years 3 months) •\tSupported various DoD GIG networking projects, including JTEO/MJPO & TSAT, JTRS, GIG E2E SE Working Groups (i.e. Supported the Transport Services WG and IP Multicast WG, and lead the TCP Performance Enhancement Sub-WB) \n•\tCreated intellectual capital through the development and demonstration of emerging technologies, such as IP Header Compression \n•\tConducted advanced research and analysis for Network Performance Enhancement in the areas of IP Header Compression, IPsec, and IP Multicast \n•\tParticipated in IETF standardization efforts involving Header Compression and IPsec (IETF RFCs 5856 / 5857) \n•\tServed as the Hybrid Communications Lab Manager for the Center for Network and Systems Innovation procuring and maintaining equipment, as well as assisting with client projects and testbeds Senior Consultant Booz Allen Hamilton July 2004  –  September 2006  (2 years 3 months) •\tSupported various DoD GIG networking projects, including JTEO/MJPO & TSAT, JTRS, GIG E2E SE Working Groups (i.e. Supported the Transport Services WG and IP Multicast WG, and lead the TCP Performance Enhancement Sub-WB) \n•\tCreated intellectual capital through the development and demonstration of emerging technologies, such as IP Header Compression \n•\tConducted advanced research and analysis for Network Performance Enhancement in the areas of IP Header Compression, IPsec, and IP Multicast \n•\tParticipated in IETF standardization efforts involving Header Compression and IPsec (IETF RFCs 5856 / 5857) \n•\tServed as the Hybrid Communications Lab Manager for the Center for Network and Systems Innovation procuring and maintaining equipment, as well as assisting with client projects and testbeds Hardware Verification Engineer IBM May 2003  –  August 2003  (4 months) Advanced Hardware Verification \n- Automated of Chart Debugging Database with Unix Programming \n- Functionally verified functions for IBM’s T-saurs chip using C \n- Attended IBM Verification Class for practical experience with tools and methods \n- Transformed IBM’s online verification tutorial from AIX to a web based environment using Java Hardware Verification Engineer IBM May 2003  –  August 2003  (4 months) Advanced Hardware Verification \n- Automated of Chart Debugging Database with Unix Programming \n- Functionally verified functions for IBM’s T-saurs chip using C \n- Attended IBM Verification Class for practical experience with tools and methods \n- Transformed IBM’s online verification tutorial from AIX to a web based environment using Java Languages   Skills Product Management Shell Scripting Embedded Systems Management Systems Engineering Linux Security Integration Enterprise Software Cloud Computing Unix Agile Methodologies Mobile Devices VoIP Perl Telecommunications SQL Software Development See 3+     See less Skills  Product Management Shell Scripting Embedded Systems Management Systems Engineering Linux Security Integration Enterprise Software Cloud Computing Unix Agile Methodologies Mobile Devices VoIP Perl Telecommunications SQL Software Development See 3+     See less Product Management Shell Scripting Embedded Systems Management Systems Engineering Linux Security Integration Enterprise Software Cloud Computing Unix Agile Methodologies Mobile Devices VoIP Perl Telecommunications SQL Software Development See 3+     See less Product Management Shell Scripting Embedded Systems Management Systems Engineering Linux Security Integration Enterprise Software Cloud Computing Unix Agile Methodologies Mobile Devices VoIP Perl Telecommunications SQL Software Development See 3+     See less Education Carnegie Mellon University Masters,  Electrical and Computer Engineering 2003  – 2003 Advanced Digital Design Project - Spring ’03 - Participated in a hardware/software co-design project focusing on GALS heterogeneous SOC design. Designed and implemented VoIP network device with encryption, conference calling, and mp3 playback capabilities over the course of a semester.  \nDistributed Embedded System - Fall ‘02 - Simulated a fully functional, safety critical elevator using UML and a Java-based design framework focusing on Software and Distributed Systems Integration. \nDistributed System - Spring ‘02 - Created a Virtual Boardroom, a highly available web service targeting group projects and communications, utilizing SQL, Java, HTML, and JSP. Service provided peer-to-peer file-sharing combining query techniques with decentralized file storage to allow users to access information from one another. Activities and Societies:  CMU Ice Hockey Team\nCMU Roller Hockey Team Carnegie Mellon University Bachelors,  Electrical and Computer Engineering 1999  – 2003 OS Kernel for Sound Card Fall ‘01 \nImplemented a multi-tasking operating system kernel in a 4-person group using C and Assembly. The system required support of multiple tasks while processing a real-time data stream. Development required utilization of cooperative multi-tasking with context switching and prioritized process control blocks. \nMulti-Stage, Pipelined Processor Spring ‘01 \nSimulated a fully functional 5-stage, pipelined MIPS processor utilizing Verilog and Assembly. In a 2-person team, created a functional processor composed of a complete instruction set architecture and error detection codes. We then expanded the design to include pipelines, attending to hazard detection, dependencies, and forwarding. Activities and Societies:  CMU Ice Hockey ,  CMU Roller Hockey Abington High School Diploma,  General 1995  – 1999 Carnegie Mellon University Masters,  Electrical and Computer Engineering 2003  – 2003 Advanced Digital Design Project - Spring ’03 - Participated in a hardware/software co-design project focusing on GALS heterogeneous SOC design. Designed and implemented VoIP network device with encryption, conference calling, and mp3 playback capabilities over the course of a semester.  \nDistributed Embedded System - Fall ‘02 - Simulated a fully functional, safety critical elevator using UML and a Java-based design framework focusing on Software and Distributed Systems Integration. \nDistributed System - Spring ‘02 - Created a Virtual Boardroom, a highly available web service targeting group projects and communications, utilizing SQL, Java, HTML, and JSP. Service provided peer-to-peer file-sharing combining query techniques with decentralized file storage to allow users to access information from one another. Activities and Societies:  CMU Ice Hockey Team\nCMU Roller Hockey Team Carnegie Mellon University Masters,  Electrical and Computer Engineering 2003  – 2003 Advanced Digital Design Project - Spring ’03 - Participated in a hardware/software co-design project focusing on GALS heterogeneous SOC design. Designed and implemented VoIP network device with encryption, conference calling, and mp3 playback capabilities over the course of a semester.  \nDistributed Embedded System - Fall ‘02 - Simulated a fully functional, safety critical elevator using UML and a Java-based design framework focusing on Software and Distributed Systems Integration. \nDistributed System - Spring ‘02 - Created a Virtual Boardroom, a highly available web service targeting group projects and communications, utilizing SQL, Java, HTML, and JSP. Service provided peer-to-peer file-sharing combining query techniques with decentralized file storage to allow users to access information from one another. Activities and Societies:  CMU Ice Hockey Team\nCMU Roller Hockey Team Carnegie Mellon University Masters,  Electrical and Computer Engineering 2003  – 2003 Advanced Digital Design Project - Spring ’03 - Participated in a hardware/software co-design project focusing on GALS heterogeneous SOC design. Designed and implemented VoIP network device with encryption, conference calling, and mp3 playback capabilities over the course of a semester.  \nDistributed Embedded System - Fall ‘02 - Simulated a fully functional, safety critical elevator using UML and a Java-based design framework focusing on Software and Distributed Systems Integration. \nDistributed System - Spring ‘02 - Created a Virtual Boardroom, a highly available web service targeting group projects and communications, utilizing SQL, Java, HTML, and JSP. Service provided peer-to-peer file-sharing combining query techniques with decentralized file storage to allow users to access information from one another. Activities and Societies:  CMU Ice Hockey Team\nCMU Roller Hockey Team Carnegie Mellon University Bachelors,  Electrical and Computer Engineering 1999  – 2003 OS Kernel for Sound Card Fall ‘01 \nImplemented a multi-tasking operating system kernel in a 4-person group using C and Assembly. The system required support of multiple tasks while processing a real-time data stream. Development required utilization of cooperative multi-tasking with context switching and prioritized process control blocks. \nMulti-Stage, Pipelined Processor Spring ‘01 \nSimulated a fully functional 5-stage, pipelined MIPS processor utilizing Verilog and Assembly. In a 2-person team, created a functional processor composed of a complete instruction set architecture and error detection codes. We then expanded the design to include pipelines, attending to hazard detection, dependencies, and forwarding. Activities and Societies:  CMU Ice Hockey ,  CMU Roller Hockey Carnegie Mellon University Bachelors,  Electrical and Computer Engineering 1999  – 2003 OS Kernel for Sound Card Fall ‘01 \nImplemented a multi-tasking operating system kernel in a 4-person group using C and Assembly. The system required support of multiple tasks while processing a real-time data stream. Development required utilization of cooperative multi-tasking with context switching and prioritized process control blocks. \nMulti-Stage, Pipelined Processor Spring ‘01 \nSimulated a fully functional 5-stage, pipelined MIPS processor utilizing Verilog and Assembly. In a 2-person team, created a functional processor composed of a complete instruction set architecture and error detection codes. We then expanded the design to include pipelines, attending to hazard detection, dependencies, and forwarding. Activities and Societies:  CMU Ice Hockey ,  CMU Roller Hockey Carnegie Mellon University Bachelors,  Electrical and Computer Engineering 1999  – 2003 OS Kernel for Sound Card Fall ‘01 \nImplemented a multi-tasking operating system kernel in a 4-person group using C and Assembly. The system required support of multiple tasks while processing a real-time data stream. Development required utilization of cooperative multi-tasking with context switching and prioritized process control blocks. \nMulti-Stage, Pipelined Processor Spring ‘01 \nSimulated a fully functional 5-stage, pipelined MIPS processor utilizing Verilog and Assembly. In a 2-person team, created a functional processor composed of a complete instruction set architecture and error detection codes. We then expanded the design to include pipelines, attending to hazard detection, dependencies, and forwarding. Activities and Societies:  CMU Ice Hockey ,  CMU Roller Hockey Abington High School Diploma,  General 1995  – 1999 Abington High School Diploma,  General 1995  – 1999 Abington High School Diploma,  General 1995  – 1999 Honors & Awards ", "Summary Xu Qian is a ASIC Verification Engineer in IBM Chip Design Center.She joined IBM China in April 2010. Her working experience focuses on IP core verification especially mixed signal cores like HSS, DDR PHY. She also has experience on digital cores like FEC and ECC security IP.  \n \nPlease contact me xqxuqian110@163.com \n \nKEY SKILLS: \nChip Verification: UVM/OVM methodology, Mixed Signal Verification, Formal Verification, Pervasive Verification \nProgramming & Development Languages: SystemVerilog, Verilog, C/C++, Shell Script Fundamental. \nEDA tools: Cadence IES, Simvision, Modelsim, Synplify, Altera Quartus, Xilinx ISE, MESA, AWAN. \nKnowledge Reserve: High Speed Serdes, DDR3/4 PHY, FEC encoding, Computer Architecture, DFT, Data Structure and Algorithm, Publci Key ALgorithm etc Summary Xu Qian is a ASIC Verification Engineer in IBM Chip Design Center.She joined IBM China in April 2010. Her working experience focuses on IP core verification especially mixed signal cores like HSS, DDR PHY. She also has experience on digital cores like FEC and ECC security IP.  \n \nPlease contact me xqxuqian110@163.com \n \nKEY SKILLS: \nChip Verification: UVM/OVM methodology, Mixed Signal Verification, Formal Verification, Pervasive Verification \nProgramming & Development Languages: SystemVerilog, Verilog, C/C++, Shell Script Fundamental. \nEDA tools: Cadence IES, Simvision, Modelsim, Synplify, Altera Quartus, Xilinx ISE, MESA, AWAN. \nKnowledge Reserve: High Speed Serdes, DDR3/4 PHY, FEC encoding, Computer Architecture, DFT, Data Structure and Algorithm, Publci Key ALgorithm etc Xu Qian is a ASIC Verification Engineer in IBM Chip Design Center.She joined IBM China in April 2010. Her working experience focuses on IP core verification especially mixed signal cores like HSS, DDR PHY. She also has experience on digital cores like FEC and ECC security IP.  \n \nPlease contact me xqxuqian110@163.com \n \nKEY SKILLS: \nChip Verification: UVM/OVM methodology, Mixed Signal Verification, Formal Verification, Pervasive Verification \nProgramming & Development Languages: SystemVerilog, Verilog, C/C++, Shell Script Fundamental. \nEDA tools: Cadence IES, Simvision, Modelsim, Synplify, Altera Quartus, Xilinx ISE, MESA, AWAN. \nKnowledge Reserve: High Speed Serdes, DDR3/4 PHY, FEC encoding, Computer Architecture, DFT, Data Structure and Algorithm, Publci Key ALgorithm etc Xu Qian is a ASIC Verification Engineer in IBM Chip Design Center.She joined IBM China in April 2010. Her working experience focuses on IP core verification especially mixed signal cores like HSS, DDR PHY. She also has experience on digital cores like FEC and ECC security IP.  \n \nPlease contact me xqxuqian110@163.com \n \nKEY SKILLS: \nChip Verification: UVM/OVM methodology, Mixed Signal Verification, Formal Verification, Pervasive Verification \nProgramming & Development Languages: SystemVerilog, Verilog, C/C++, Shell Script Fundamental. \nEDA tools: Cadence IES, Simvision, Modelsim, Synplify, Altera Quartus, Xilinx ISE, MESA, AWAN. \nKnowledge Reserve: High Speed Serdes, DDR3/4 PHY, FEC encoding, Computer Architecture, DFT, Data Structure and Algorithm, Publci Key ALgorithm etc Experience Hardware Verification Engineer IBM April 2010  – Present (5 years 5 months) Shanghai City, China Hardware Verification Engineer IBM April 2010  – Present (5 years 5 months) Shanghai City, China Hardware Verification Engineer IBM April 2010  – Present (5 years 5 months) Shanghai City, China Skills System verilog Functional Verification Debugging Perl Computer Architecture OVM/UVM verification... SystemVerilog C C++ Verilog Skills  System verilog Functional Verification Debugging Perl Computer Architecture OVM/UVM verification... SystemVerilog C C++ Verilog System verilog Functional Verification Debugging Perl Computer Architecture OVM/UVM verification... SystemVerilog C C++ Verilog System verilog Functional Verification Debugging Perl Computer Architecture OVM/UVM verification... SystemVerilog C C++ Verilog Education Shanghai Jiao Tong University Master of Science (MS),  Electrical and Electronics Engineering 2007  – 2010 Shanghai Jiao Tong University Master of Science (MS),  Electrical and Electronics Engineering 2007  – 2010 Shanghai Jiao Tong University Master of Science (MS),  Electrical and Electronics Engineering 2007  – 2010 Shanghai Jiao Tong University Master of Science (MS),  Electrical and Electronics Engineering 2007  – 2010 Honors & Awards Key technical contributions to “DDR PHY Development” IBM December 2013 Key technical contributions to “DDR PHY Development” IBM December 2013 Key technical contributions to “DDR PHY Development” IBM December 2013 Key technical contributions to “DDR PHY Development” IBM December 2013 ", "Summary A results driven electrical engineer experienced in microprocessor and server validation, characterization, system bring up and debug, failure analysis, and verification related programming. \n \n \nTools include logic probes and probe cards, oscilloscopes, function generators, and chillers. \nProgramming in SQL, Java, C, Perl, Tcl/Tk, learned Python, and shell scripts. \nHave worked on CPUs from Intel, AMD, and IBM PowerPC. Summary A results driven electrical engineer experienced in microprocessor and server validation, characterization, system bring up and debug, failure analysis, and verification related programming. \n \n \nTools include logic probes and probe cards, oscilloscopes, function generators, and chillers. \nProgramming in SQL, Java, C, Perl, Tcl/Tk, learned Python, and shell scripts. \nHave worked on CPUs from Intel, AMD, and IBM PowerPC. A results driven electrical engineer experienced in microprocessor and server validation, characterization, system bring up and debug, failure analysis, and verification related programming. \n \n \nTools include logic probes and probe cards, oscilloscopes, function generators, and chillers. \nProgramming in SQL, Java, C, Perl, Tcl/Tk, learned Python, and shell scripts. \nHave worked on CPUs from Intel, AMD, and IBM PowerPC. A results driven electrical engineer experienced in microprocessor and server validation, characterization, system bring up and debug, failure analysis, and verification related programming. \n \n \nTools include logic probes and probe cards, oscilloscopes, function generators, and chillers. \nProgramming in SQL, Java, C, Perl, Tcl/Tk, learned Python, and shell scripts. \nHave worked on CPUs from Intel, AMD, and IBM PowerPC. Experience Emulation and fleet support engineer at Intel Infosys March 2015  –  August 2015  (6 months) Austin, Texas Area Day to day emulation fleet support and operations. \n- Investigated various emulation issues, from non-functioning emulators to requesting changes to code, so daily \nduties were addressed. \n- Kept daily status of emulators so other engineers were aware which were operational and which were down. \n- Trained to check FPGA units and addressed problems so as to maintain working units. \n- Looked at problems in the emulator code and fixed issues which prevented proper functionality. Test Operator at AMD Volt June 2014  –  November 2014  (6 months) Austin, Texas Verified post-silicon microprocessors on Automated Test Equipment (ATE). \n- Tests include characterization, power, thermal, I/O, circuit sensitivity, and PLL.  \n- Programmed for Device Under Test (DUT) on multiple operating systems and multiple platforms. Configuration included type of device, test code, and operation parameters. \n- Reviewed output files and documented results to maintain status. Contractor at 3M Volt April 2014  –  June 2014  (3 months) Austin, Texas Area Production line testing. \n- Analyzed panels for physical defects. \n- Tested panels on test fixtures running software that verified whether parts passed or failed. \n- Placed DUT in test fixtures running software that verified whether it passed or failed so yields could be determined. \n- - Maintained status records on daily basis. Assistant Technician Go2IT Group November 2013  –  March 2014  (5 months) Temple, Austin, and San Antonio Texas Configuration of system servers, workstations, printers, and uninterruptible power supplies. \n- Assigned system component identification for proper identification and tracking.  \n- Verified system hard drives with various levels of sensitivity for new software installation. \n- Verified accountability of equipment.  \n- Replaced and configured software for new networked computers. Student Consulting Solutions.Net 2013  –  2013  (less than a year) Austin, Texas Area Trained in SQL and Java to become certified in both. Contractor Mindlance August 2011  –  September 2011  (2 months) Austin, Texas Area Post-silicon jitter tolerance compliance tested Atom microprocessor and conduct analysis on suspect faulty signals. \n- Applied and performed equipment engineering changes. \n- Learned Python in order to interface maintenance equipment with the workstation. Contractor ICONMA December 2010  –  December 2010  (1 month) Round Rock, TX Assembled Windows servers to conduct validation and failure analysis testing. Hardware Systems Test Engineer Computer Task Group October 2009  –  September 2010  (1 year) Austin, Texas Area Configured and ran tests on the IBM Power 770/780 medium-range servers in order to verify hardware and software configurations, test servers under various setups, and ensure that no errors existed that could possibly lead to larger problems in the future. \nAdded new hardware when systems were on or off, including attaching remote SAN storage via optical fiber channel connections, in order to verify operational functionality of the system. \nInstalled new operating system levels and upgraded firmware onto the servers as well as the Hardware Management Consoles that were used to interface with the servers over the network. This way new changes could be implemented and the software remained up to date. \nCreated defects on crashes, unexpected results, or errors encountered during testing or during system setup. This was to ensure the correct engineers were aware of the problem and that it would be resolved as soon as possible. \nCommunicated status on servers and updates on defects at a daily meeting to keep track of progress and ensure team leads were aware of all issues. \nCommunicated with team members and with engineers as far away as India to help troubleshoot systems, configure the servers for tests, or monitor systems during test runs. \nModified and edited test code used to run on the servers in order to obtain specific performance characteristics that would test specific areas of hardware. PowerPC Hardware Validation Engr. Contractor Computer Task Group (2005-2009) & Sai Peoples Solution (2004) June 2004  –  January 2009  (4 years 8 months) Austin, Texas Area Executed test code running with the IBM RISCWatch Debugger at various frequencies, temperatures, and voltages on the CPUs of the Sony PlayStation 3 and Microsoft Xbox 360 gaming consoles in order to verify basic functionality, obtain minimum and maximum performance numbers, and isolate failed parts. \nScreened chips to verify after changes to fab test methods that microprocessors still functioned by the standards set for system behavior and did not negatively impact yields. \nCommunicated daily updates to document progress, identify fail trends, and verify results in support of short- and long-term screening target priorities. \nDuring unexpected emergency screened over 1,000 chips in three and a half days, obtaining recognition and keeping shipments on target. \nVerified hardware and software configurations with lab test boards and workstations and implemented changes when necessary in order to maintain daily operational work status. \nModified Linux shell scripts and Perl code to screen or characterize microprocessors with unique performance characteristics or to help identify and isolate specific fail signatures. Hardware Verification Engineer IBM July 2001  –  February 2004  (2 years 8 months) Austin, Texas Area Maintained/developed fab test code for the screening of 64-bit Power4/4+ microprocessors using object-oriented Perl. \nRecommended and implemented modifications to test code, improving yield and reducing test time by 30%. \nExecuted test programs to screen defective Power4/4+ microprocessors and isolate root cause of fails. \nPresented daily updates to maintain efficient progress on failure analysis and ensure upper managers and senior engineers were informed on high priority defects involving customers. \nVerified system configurations to secure proper functional operation of IBM pSeries servers. \nScreened/tested Power4/4+ microprocessors under varied frequencies, temperatures, and voltages to establish baseline and maximum performance numbers. \nAnalyzed log files from manufacturing over daily/quarterly periods to validate if failures were from the microprocessor, influenced by test code, or related to test server hardware, as well as to identify fail trends and track yield performance. Cooperative Internship IBM January 2000  –  June 2000  (6 months) Austin, Texas Area Working in the Pervasive Department, verified the performance monitor functions of the Power4 microprocessor with a cycle simulator to determine if operational instructions were correctly executed. Analyzed and validated output signals from simulations to confirm that results didn't just match expected values, but that they were obtained within an acceptable number of clock cycles. Programmed C++ code in order to create test case lists for regression buckets, ensuring proper conditions were setup for simulation runs. Cooperative Internship IBM January 1999  –  August 1999  (8 months) Austin, Texas Area Created a graphical user interface to edit and customize PowerPC 630 microprocessor stress and performance test code, allowing other hardware engineers to modify or create tests for specialized purposes. Executed test programs to verify server hardware was functioning correctly and to bring up systems equipped with the PowerPC 630 microprocessor. Semiconductor Manufacturing Technology Internship Intel May 1996  –  August 1996  (4 months) Rio Rancho, NM Obtained Certification as a Deep Ultraviolet Lithography Production Technician. Maintained proper operation of production tools by troubleshooting system malfunctions and alerting technicians to high severity problems. Emulation and fleet support engineer at Intel Infosys March 2015  –  August 2015  (6 months) Austin, Texas Area Day to day emulation fleet support and operations. \n- Investigated various emulation issues, from non-functioning emulators to requesting changes to code, so daily \nduties were addressed. \n- Kept daily status of emulators so other engineers were aware which were operational and which were down. \n- Trained to check FPGA units and addressed problems so as to maintain working units. \n- Looked at problems in the emulator code and fixed issues which prevented proper functionality. Emulation and fleet support engineer at Intel Infosys March 2015  –  August 2015  (6 months) Austin, Texas Area Day to day emulation fleet support and operations. \n- Investigated various emulation issues, from non-functioning emulators to requesting changes to code, so daily \nduties were addressed. \n- Kept daily status of emulators so other engineers were aware which were operational and which were down. \n- Trained to check FPGA units and addressed problems so as to maintain working units. \n- Looked at problems in the emulator code and fixed issues which prevented proper functionality. Test Operator at AMD Volt June 2014  –  November 2014  (6 months) Austin, Texas Verified post-silicon microprocessors on Automated Test Equipment (ATE). \n- Tests include characterization, power, thermal, I/O, circuit sensitivity, and PLL.  \n- Programmed for Device Under Test (DUT) on multiple operating systems and multiple platforms. Configuration included type of device, test code, and operation parameters. \n- Reviewed output files and documented results to maintain status. Test Operator at AMD Volt June 2014  –  November 2014  (6 months) Austin, Texas Verified post-silicon microprocessors on Automated Test Equipment (ATE). \n- Tests include characterization, power, thermal, I/O, circuit sensitivity, and PLL.  \n- Programmed for Device Under Test (DUT) on multiple operating systems and multiple platforms. Configuration included type of device, test code, and operation parameters. \n- Reviewed output files and documented results to maintain status. Contractor at 3M Volt April 2014  –  June 2014  (3 months) Austin, Texas Area Production line testing. \n- Analyzed panels for physical defects. \n- Tested panels on test fixtures running software that verified whether parts passed or failed. \n- Placed DUT in test fixtures running software that verified whether it passed or failed so yields could be determined. \n- - Maintained status records on daily basis. Contractor at 3M Volt April 2014  –  June 2014  (3 months) Austin, Texas Area Production line testing. \n- Analyzed panels for physical defects. \n- Tested panels on test fixtures running software that verified whether parts passed or failed. \n- Placed DUT in test fixtures running software that verified whether it passed or failed so yields could be determined. \n- - Maintained status records on daily basis. Assistant Technician Go2IT Group November 2013  –  March 2014  (5 months) Temple, Austin, and San Antonio Texas Configuration of system servers, workstations, printers, and uninterruptible power supplies. \n- Assigned system component identification for proper identification and tracking.  \n- Verified system hard drives with various levels of sensitivity for new software installation. \n- Verified accountability of equipment.  \n- Replaced and configured software for new networked computers. Assistant Technician Go2IT Group November 2013  –  March 2014  (5 months) Temple, Austin, and San Antonio Texas Configuration of system servers, workstations, printers, and uninterruptible power supplies. \n- Assigned system component identification for proper identification and tracking.  \n- Verified system hard drives with various levels of sensitivity for new software installation. \n- Verified accountability of equipment.  \n- Replaced and configured software for new networked computers. Student Consulting Solutions.Net 2013  –  2013  (less than a year) Austin, Texas Area Trained in SQL and Java to become certified in both. Student Consulting Solutions.Net 2013  –  2013  (less than a year) Austin, Texas Area Trained in SQL and Java to become certified in both. Contractor Mindlance August 2011  –  September 2011  (2 months) Austin, Texas Area Post-silicon jitter tolerance compliance tested Atom microprocessor and conduct analysis on suspect faulty signals. \n- Applied and performed equipment engineering changes. \n- Learned Python in order to interface maintenance equipment with the workstation. Contractor Mindlance August 2011  –  September 2011  (2 months) Austin, Texas Area Post-silicon jitter tolerance compliance tested Atom microprocessor and conduct analysis on suspect faulty signals. \n- Applied and performed equipment engineering changes. \n- Learned Python in order to interface maintenance equipment with the workstation. Contractor ICONMA December 2010  –  December 2010  (1 month) Round Rock, TX Assembled Windows servers to conduct validation and failure analysis testing. Contractor ICONMA December 2010  –  December 2010  (1 month) Round Rock, TX Assembled Windows servers to conduct validation and failure analysis testing. Hardware Systems Test Engineer Computer Task Group October 2009  –  September 2010  (1 year) Austin, Texas Area Configured and ran tests on the IBM Power 770/780 medium-range servers in order to verify hardware and software configurations, test servers under various setups, and ensure that no errors existed that could possibly lead to larger problems in the future. \nAdded new hardware when systems were on or off, including attaching remote SAN storage via optical fiber channel connections, in order to verify operational functionality of the system. \nInstalled new operating system levels and upgraded firmware onto the servers as well as the Hardware Management Consoles that were used to interface with the servers over the network. This way new changes could be implemented and the software remained up to date. \nCreated defects on crashes, unexpected results, or errors encountered during testing or during system setup. This was to ensure the correct engineers were aware of the problem and that it would be resolved as soon as possible. \nCommunicated status on servers and updates on defects at a daily meeting to keep track of progress and ensure team leads were aware of all issues. \nCommunicated with team members and with engineers as far away as India to help troubleshoot systems, configure the servers for tests, or monitor systems during test runs. \nModified and edited test code used to run on the servers in order to obtain specific performance characteristics that would test specific areas of hardware. Hardware Systems Test Engineer Computer Task Group October 2009  –  September 2010  (1 year) Austin, Texas Area Configured and ran tests on the IBM Power 770/780 medium-range servers in order to verify hardware and software configurations, test servers under various setups, and ensure that no errors existed that could possibly lead to larger problems in the future. \nAdded new hardware when systems were on or off, including attaching remote SAN storage via optical fiber channel connections, in order to verify operational functionality of the system. \nInstalled new operating system levels and upgraded firmware onto the servers as well as the Hardware Management Consoles that were used to interface with the servers over the network. This way new changes could be implemented and the software remained up to date. \nCreated defects on crashes, unexpected results, or errors encountered during testing or during system setup. This was to ensure the correct engineers were aware of the problem and that it would be resolved as soon as possible. \nCommunicated status on servers and updates on defects at a daily meeting to keep track of progress and ensure team leads were aware of all issues. \nCommunicated with team members and with engineers as far away as India to help troubleshoot systems, configure the servers for tests, or monitor systems during test runs. \nModified and edited test code used to run on the servers in order to obtain specific performance characteristics that would test specific areas of hardware. PowerPC Hardware Validation Engr. Contractor Computer Task Group (2005-2009) & Sai Peoples Solution (2004) June 2004  –  January 2009  (4 years 8 months) Austin, Texas Area Executed test code running with the IBM RISCWatch Debugger at various frequencies, temperatures, and voltages on the CPUs of the Sony PlayStation 3 and Microsoft Xbox 360 gaming consoles in order to verify basic functionality, obtain minimum and maximum performance numbers, and isolate failed parts. \nScreened chips to verify after changes to fab test methods that microprocessors still functioned by the standards set for system behavior and did not negatively impact yields. \nCommunicated daily updates to document progress, identify fail trends, and verify results in support of short- and long-term screening target priorities. \nDuring unexpected emergency screened over 1,000 chips in three and a half days, obtaining recognition and keeping shipments on target. \nVerified hardware and software configurations with lab test boards and workstations and implemented changes when necessary in order to maintain daily operational work status. \nModified Linux shell scripts and Perl code to screen or characterize microprocessors with unique performance characteristics or to help identify and isolate specific fail signatures. PowerPC Hardware Validation Engr. Contractor Computer Task Group (2005-2009) & Sai Peoples Solution (2004) June 2004  –  January 2009  (4 years 8 months) Austin, Texas Area Executed test code running with the IBM RISCWatch Debugger at various frequencies, temperatures, and voltages on the CPUs of the Sony PlayStation 3 and Microsoft Xbox 360 gaming consoles in order to verify basic functionality, obtain minimum and maximum performance numbers, and isolate failed parts. \nScreened chips to verify after changes to fab test methods that microprocessors still functioned by the standards set for system behavior and did not negatively impact yields. \nCommunicated daily updates to document progress, identify fail trends, and verify results in support of short- and long-term screening target priorities. \nDuring unexpected emergency screened over 1,000 chips in three and a half days, obtaining recognition and keeping shipments on target. \nVerified hardware and software configurations with lab test boards and workstations and implemented changes when necessary in order to maintain daily operational work status. \nModified Linux shell scripts and Perl code to screen or characterize microprocessors with unique performance characteristics or to help identify and isolate specific fail signatures. Hardware Verification Engineer IBM July 2001  –  February 2004  (2 years 8 months) Austin, Texas Area Maintained/developed fab test code for the screening of 64-bit Power4/4+ microprocessors using object-oriented Perl. \nRecommended and implemented modifications to test code, improving yield and reducing test time by 30%. \nExecuted test programs to screen defective Power4/4+ microprocessors and isolate root cause of fails. \nPresented daily updates to maintain efficient progress on failure analysis and ensure upper managers and senior engineers were informed on high priority defects involving customers. \nVerified system configurations to secure proper functional operation of IBM pSeries servers. \nScreened/tested Power4/4+ microprocessors under varied frequencies, temperatures, and voltages to establish baseline and maximum performance numbers. \nAnalyzed log files from manufacturing over daily/quarterly periods to validate if failures were from the microprocessor, influenced by test code, or related to test server hardware, as well as to identify fail trends and track yield performance. Hardware Verification Engineer IBM July 2001  –  February 2004  (2 years 8 months) Austin, Texas Area Maintained/developed fab test code for the screening of 64-bit Power4/4+ microprocessors using object-oriented Perl. \nRecommended and implemented modifications to test code, improving yield and reducing test time by 30%. \nExecuted test programs to screen defective Power4/4+ microprocessors and isolate root cause of fails. \nPresented daily updates to maintain efficient progress on failure analysis and ensure upper managers and senior engineers were informed on high priority defects involving customers. \nVerified system configurations to secure proper functional operation of IBM pSeries servers. \nScreened/tested Power4/4+ microprocessors under varied frequencies, temperatures, and voltages to establish baseline and maximum performance numbers. \nAnalyzed log files from manufacturing over daily/quarterly periods to validate if failures were from the microprocessor, influenced by test code, or related to test server hardware, as well as to identify fail trends and track yield performance. Cooperative Internship IBM January 2000  –  June 2000  (6 months) Austin, Texas Area Working in the Pervasive Department, verified the performance monitor functions of the Power4 microprocessor with a cycle simulator to determine if operational instructions were correctly executed. Analyzed and validated output signals from simulations to confirm that results didn't just match expected values, but that they were obtained within an acceptable number of clock cycles. Programmed C++ code in order to create test case lists for regression buckets, ensuring proper conditions were setup for simulation runs. Cooperative Internship IBM January 2000  –  June 2000  (6 months) Austin, Texas Area Working in the Pervasive Department, verified the performance monitor functions of the Power4 microprocessor with a cycle simulator to determine if operational instructions were correctly executed. Analyzed and validated output signals from simulations to confirm that results didn't just match expected values, but that they were obtained within an acceptable number of clock cycles. Programmed C++ code in order to create test case lists for regression buckets, ensuring proper conditions were setup for simulation runs. Cooperative Internship IBM January 1999  –  August 1999  (8 months) Austin, Texas Area Created a graphical user interface to edit and customize PowerPC 630 microprocessor stress and performance test code, allowing other hardware engineers to modify or create tests for specialized purposes. Executed test programs to verify server hardware was functioning correctly and to bring up systems equipped with the PowerPC 630 microprocessor. Cooperative Internship IBM January 1999  –  August 1999  (8 months) Austin, Texas Area Created a graphical user interface to edit and customize PowerPC 630 microprocessor stress and performance test code, allowing other hardware engineers to modify or create tests for specialized purposes. Executed test programs to verify server hardware was functioning correctly and to bring up systems equipped with the PowerPC 630 microprocessor. Semiconductor Manufacturing Technology Internship Intel May 1996  –  August 1996  (4 months) Rio Rancho, NM Obtained Certification as a Deep Ultraviolet Lithography Production Technician. Maintained proper operation of production tools by troubleshooting system malfunctions and alerting technicians to high severity problems. Semiconductor Manufacturing Technology Internship Intel May 1996  –  August 1996  (4 months) Rio Rancho, NM Obtained Certification as a Deep Ultraviolet Lithography Production Technician. Maintained proper operation of production tools by troubleshooting system malfunctions and alerting technicians to high severity problems. Languages Spanish Spanish Spanish Skills Scripting Perl Python C Tcl-Tk Testing Java SQL Hardware Programming Semiconductors C++ Shell Scripting Operating Systems Troubleshooting Debugging Servers See 2+     See less Skills  Scripting Perl Python C Tcl-Tk Testing Java SQL Hardware Programming Semiconductors C++ Shell Scripting Operating Systems Troubleshooting Debugging Servers See 2+     See less Scripting Perl Python C Tcl-Tk Testing Java SQL Hardware Programming Semiconductors C++ Shell Scripting Operating Systems Troubleshooting Debugging Servers See 2+     See less Scripting Perl Python C Tcl-Tk Testing Java SQL Hardware Programming Semiconductors C++ Shell Scripting Operating Systems Troubleshooting Debugging Servers See 2+     See less Education Consulting Solutions.Net Trained in Java and SQL 2013  – 2013 New Mexico State University Bachelor of Science (B.S.),  Electrical Engineering 1995  – 2001 Electrical Engineering Activities and Societies:  Intramural soccer Consulting Solutions.Net Trained in Java and SQL 2013  – 2013 Consulting Solutions.Net Trained in Java and SQL 2013  – 2013 Consulting Solutions.Net Trained in Java and SQL 2013  – 2013 New Mexico State University Bachelor of Science (B.S.),  Electrical Engineering 1995  – 2001 Electrical Engineering Activities and Societies:  Intramural soccer New Mexico State University Bachelor of Science (B.S.),  Electrical Engineering 1995  – 2001 Electrical Engineering Activities and Societies:  Intramural soccer New Mexico State University Bachelor of Science (B.S.),  Electrical Engineering 1995  – 2001 Electrical Engineering Activities and Societies:  Intramural soccer Honors & Awards Additional Honors & Awards CTG Exceptional Contribution Award, May 2007 \nSTI Design Delivery Organization Team Award, May 2007 \nCTG MVP of the Quarter, October 2007 Additional Honors & Awards CTG Exceptional Contribution Award, May 2007 \nSTI Design Delivery Organization Team Award, May 2007 \nCTG MVP of the Quarter, October 2007 Additional Honors & Awards CTG Exceptional Contribution Award, May 2007 \nSTI Design Delivery Organization Team Award, May 2007 \nCTG MVP of the Quarter, October 2007 Additional Honors & Awards CTG Exceptional Contribution Award, May 2007 \nSTI Design Delivery Organization Team Award, May 2007 \nCTG MVP of the Quarter, October 2007 ", "Summary 5+ years of professional engineering experience in design, development, test, and quality. Specialties:Test development experience in DOS, Windows, Linux, AIX, manufacturing environments. \nEmbedded design experience with Atmel, Freescale, PIC microcontrollers, TI DSP’s, Cypress PSoC’s. \nProgramming experience in C, C++, LabView, Visual Basic, Java, and Perl. \nLab experience using datasheets, schematics, oscilloscopes, bus analyzers, multi-meters, etc. Summary 5+ years of professional engineering experience in design, development, test, and quality. Specialties:Test development experience in DOS, Windows, Linux, AIX, manufacturing environments. \nEmbedded design experience with Atmel, Freescale, PIC microcontrollers, TI DSP’s, Cypress PSoC’s. \nProgramming experience in C, C++, LabView, Visual Basic, Java, and Perl. \nLab experience using datasheets, schematics, oscilloscopes, bus analyzers, multi-meters, etc. 5+ years of professional engineering experience in design, development, test, and quality. Specialties:Test development experience in DOS, Windows, Linux, AIX, manufacturing environments. \nEmbedded design experience with Atmel, Freescale, PIC microcontrollers, TI DSP’s, Cypress PSoC’s. \nProgramming experience in C, C++, LabView, Visual Basic, Java, and Perl. \nLab experience using datasheets, schematics, oscilloscopes, bus analyzers, multi-meters, etc. 5+ years of professional engineering experience in design, development, test, and quality. Specialties:Test development experience in DOS, Windows, Linux, AIX, manufacturing environments. \nEmbedded design experience with Atmel, Freescale, PIC microcontrollers, TI DSP’s, Cypress PSoC’s. \nProgramming experience in C, C++, LabView, Visual Basic, Java, and Perl. \nLab experience using datasheets, schematics, oscilloscopes, bus analyzers, multi-meters, etc. Experience Electronics Engineer NAVAIR April 2012  – Present (3 years 5 months) Cherry Point, NC Supporting the Fleet. Substitute Teacher Escambia County Schools September 2011  –  February 2012  (6 months) Pensacola, FL I Performed essential classroom duties in a variety of classroom settings (preK-12), often with little notice or guidance, while maintaining district educational and behavioral guidelines. I also developed and maintained positive interactions with students, faculty, and administrators, gaining respect and trust to ensure an environment conducive to learning. I received a high feedback rating and was requested to return to multiple classrooms across multiple schools, age groups, and subjects. Systems Integration and Test Engineer Hitachi GST February 2010  –  May 2011  (1 year 4 months) Rochester, MN Led SATA hard disk drive (HDD) qualifications for multiple customers to ensure each new drive performs up to and beyond the customer’s specifications. Conducted comprehensive testing to determine the cause of known, unknown, and vaguely described HDD errors (e.g. command timing errors, system faults specific to Hitachi HDD, etc). \nDeveloped PERL and VBA scripts to automate testing, data collection, and analysis. Mentored and supervised cooperative education students hired into the department Hardware Verification Engineer IBM March 2008  –  February 2010  (2 years) Rochester, MN Created C/C++ cycle based verification test environments to verify RTL logic design within an ASIC. Simulations were run to test VHDL logic within test environments to verify proper functionality and ensure coverage of chip functionality. Electrical Systems Engineer IBM January 2006  –  February 2008  (2 years 2 months) Rochester, MN Focused on medical devices for the Global Services Department. This ranged from small embedded systems with a few sensor inputs to large customized systems. Led both hardware and firmware designs as well as testing and lab bring-up work. Electrical Engineering Intern Aveso Displays May 2005  –  January 2006  (9 months) Fridley, MN Assisted in research, design, and testing of electro-chromatric displays. Developed vision system software using LabView to automate and more accurately report our findings. Electronics Engineer NAVAIR April 2012  – Present (3 years 5 months) Cherry Point, NC Supporting the Fleet. Electronics Engineer NAVAIR April 2012  – Present (3 years 5 months) Cherry Point, NC Supporting the Fleet. Substitute Teacher Escambia County Schools September 2011  –  February 2012  (6 months) Pensacola, FL I Performed essential classroom duties in a variety of classroom settings (preK-12), often with little notice or guidance, while maintaining district educational and behavioral guidelines. I also developed and maintained positive interactions with students, faculty, and administrators, gaining respect and trust to ensure an environment conducive to learning. I received a high feedback rating and was requested to return to multiple classrooms across multiple schools, age groups, and subjects. Substitute Teacher Escambia County Schools September 2011  –  February 2012  (6 months) Pensacola, FL I Performed essential classroom duties in a variety of classroom settings (preK-12), often with little notice or guidance, while maintaining district educational and behavioral guidelines. I also developed and maintained positive interactions with students, faculty, and administrators, gaining respect and trust to ensure an environment conducive to learning. I received a high feedback rating and was requested to return to multiple classrooms across multiple schools, age groups, and subjects. Systems Integration and Test Engineer Hitachi GST February 2010  –  May 2011  (1 year 4 months) Rochester, MN Led SATA hard disk drive (HDD) qualifications for multiple customers to ensure each new drive performs up to and beyond the customer’s specifications. Conducted comprehensive testing to determine the cause of known, unknown, and vaguely described HDD errors (e.g. command timing errors, system faults specific to Hitachi HDD, etc). \nDeveloped PERL and VBA scripts to automate testing, data collection, and analysis. Mentored and supervised cooperative education students hired into the department Systems Integration and Test Engineer Hitachi GST February 2010  –  May 2011  (1 year 4 months) Rochester, MN Led SATA hard disk drive (HDD) qualifications for multiple customers to ensure each new drive performs up to and beyond the customer’s specifications. Conducted comprehensive testing to determine the cause of known, unknown, and vaguely described HDD errors (e.g. command timing errors, system faults specific to Hitachi HDD, etc). \nDeveloped PERL and VBA scripts to automate testing, data collection, and analysis. Mentored and supervised cooperative education students hired into the department Hardware Verification Engineer IBM March 2008  –  February 2010  (2 years) Rochester, MN Created C/C++ cycle based verification test environments to verify RTL logic design within an ASIC. Simulations were run to test VHDL logic within test environments to verify proper functionality and ensure coverage of chip functionality. Hardware Verification Engineer IBM March 2008  –  February 2010  (2 years) Rochester, MN Created C/C++ cycle based verification test environments to verify RTL logic design within an ASIC. Simulations were run to test VHDL logic within test environments to verify proper functionality and ensure coverage of chip functionality. Electrical Systems Engineer IBM January 2006  –  February 2008  (2 years 2 months) Rochester, MN Focused on medical devices for the Global Services Department. This ranged from small embedded systems with a few sensor inputs to large customized systems. Led both hardware and firmware designs as well as testing and lab bring-up work. Electrical Systems Engineer IBM January 2006  –  February 2008  (2 years 2 months) Rochester, MN Focused on medical devices for the Global Services Department. This ranged from small embedded systems with a few sensor inputs to large customized systems. Led both hardware and firmware designs as well as testing and lab bring-up work. Electrical Engineering Intern Aveso Displays May 2005  –  January 2006  (9 months) Fridley, MN Assisted in research, design, and testing of electro-chromatric displays. Developed vision system software using LabView to automate and more accurately report our findings. Electrical Engineering Intern Aveso Displays May 2005  –  January 2006  (9 months) Fridley, MN Assisted in research, design, and testing of electro-chromatric displays. Developed vision system software using LabView to automate and more accurately report our findings. Skills Linux Perl C++ Labview Java Windows Visual Basic Microchip PIC Freescale AIX C Embedded Systems Automation Storage Skills  Linux Perl C++ Labview Java Windows Visual Basic Microchip PIC Freescale AIX C Embedded Systems Automation Storage Linux Perl C++ Labview Java Windows Visual Basic Microchip PIC Freescale AIX C Embedded Systems Automation Storage Linux Perl C++ Labview Java Windows Visual Basic Microchip PIC Freescale AIX C Embedded Systems Automation Storage Education University of Saint Thomas BS,  Electrical Engineering 2001  – 2005 Collaborated with Lockheed Martin for Senior Design Class to develop a tracking system that could be mounted on various vehicles. Activities and Societies:  VP of IEEE University of Saint Thomas BA,  Physics 2001  – 2005 University of Saint Thomas BS,  Electrical Engineering 2001  – 2005 Collaborated with Lockheed Martin for Senior Design Class to develop a tracking system that could be mounted on various vehicles. Activities and Societies:  VP of IEEE University of Saint Thomas BS,  Electrical Engineering 2001  – 2005 Collaborated with Lockheed Martin for Senior Design Class to develop a tracking system that could be mounted on various vehicles. Activities and Societies:  VP of IEEE University of Saint Thomas BS,  Electrical Engineering 2001  – 2005 Collaborated with Lockheed Martin for Senior Design Class to develop a tracking system that could be mounted on various vehicles. Activities and Societies:  VP of IEEE University of Saint Thomas BA,  Physics 2001  – 2005 University of Saint Thomas BA,  Physics 2001  – 2005 University of Saint Thomas BA,  Physics 2001  – 2005 ", "Experience Advisory Engineer IBM Hardware Verification Engineer IBM 2014  – Present (1 year) Packaging Design IBM 2013  –  2014  (1 year) System Simulation, HW-SW Co-simulation IBM 1998  –  2012  (14 years) Manufacturing Test Development IBM 1993  –  1997  (4 years) Chip Test and Functional Card Test IBM 1987  –  1993  (6 years) Advisory Engineer IBM Advisory Engineer IBM Hardware Verification Engineer IBM 2014  – Present (1 year) Hardware Verification Engineer IBM 2014  – Present (1 year) Packaging Design IBM 2013  –  2014  (1 year) Packaging Design IBM 2013  –  2014  (1 year) System Simulation, HW-SW Co-simulation IBM 1998  –  2012  (14 years) System Simulation, HW-SW Co-simulation IBM 1998  –  2012  (14 years) Manufacturing Test Development IBM 1993  –  1997  (4 years) Manufacturing Test Development IBM 1993  –  1997  (4 years) Chip Test and Functional Card Test IBM 1987  –  1993  (6 years) Chip Test and Functional Card Test IBM 1987  –  1993  (6 years) Languages German English German English German English Skills Testing Product Lifecycle... Manufacturing Product Development Hardware Semiconductors Simulations Debugging Computer Architecture Hardware Architecture System Architecture Skills  Testing Product Lifecycle... Manufacturing Product Development Hardware Semiconductors Simulations Debugging Computer Architecture Hardware Architecture System Architecture Testing Product Lifecycle... Manufacturing Product Development Hardware Semiconductors Simulations Debugging Computer Architecture Hardware Architecture System Architecture Testing Product Lifecycle... Manufacturing Product Development Hardware Semiconductors Simulations Debugging Computer Architecture Hardware Architecture System Architecture Education FHT Esslingen Techn Informatik 1983  – 1987 FHT Esslingen Techn Informatik 1983  – 1987 FHT Esslingen Techn Informatik 1983  – 1987 FHT Esslingen Techn Informatik 1983  – 1987 ", "Experience Principal Design Engineer ARM June 2013  – Present (2 years 3 months) Austin, Texas Area Senior Hardware Verification Engineer IBM September 1998  –  June 2013  (14 years 10 months) Austin Responsible for hardware verification across entire life cycle of products from high level design to hardware lab failure analysis for many generations of IBM Power and Z series systems.  \n \n- Power8, Power7, Power6 \nInstruction fetch/decode unit verification team lead - responsible for leading international team developing and implementing verification plan for unit level verification of instruction fetch, instruction decode, branch prediction, and branch execution logic for processor core. \n \n- Power 5 \nInstruction fetch/decode unit verification team lead - responsible for leading team developing and implementing verification plan for unit level verification of instruction decode logic for processor core. \n \n- Power 4 \nResponsible for verification of processor core fixed point and floating point arithmetic functions \n \n- Z Series \nAssisted in various verification efforts on different projects with verifying elements of instruction issue unit, and with various elements of core level fault tolerance mechanisms. Software Engineer Tandem Computers August 1997  –  August 1998  (1 year 1 month) Austin, Texas Area Responsible for verification of frame relay card hardware and device driver running under real-time operating system, for a highly fault tolerant system designed for Motorola cellular systems. Developed testbench using C,C++, Perl running on real time operating system. Diagnosed device driver software and hardware problems. Software Engineer Raytheon May 1995  –  August 1997  (2 years 4 months) Dallas/Fort Worth Area Developed distributed fault tolerant transaction processing system across multiple platforms including Sun, SGI, Cray, IBM systems for government agency requiring SSBI clearance. Particular responsibilities included process and resource management control, primarily using C++ and Perl on unix platforms. Principal Design Engineer ARM June 2013  – Present (2 years 3 months) Austin, Texas Area Principal Design Engineer ARM June 2013  – Present (2 years 3 months) Austin, Texas Area Senior Hardware Verification Engineer IBM September 1998  –  June 2013  (14 years 10 months) Austin Responsible for hardware verification across entire life cycle of products from high level design to hardware lab failure analysis for many generations of IBM Power and Z series systems.  \n \n- Power8, Power7, Power6 \nInstruction fetch/decode unit verification team lead - responsible for leading international team developing and implementing verification plan for unit level verification of instruction fetch, instruction decode, branch prediction, and branch execution logic for processor core. \n \n- Power 5 \nInstruction fetch/decode unit verification team lead - responsible for leading team developing and implementing verification plan for unit level verification of instruction decode logic for processor core. \n \n- Power 4 \nResponsible for verification of processor core fixed point and floating point arithmetic functions \n \n- Z Series \nAssisted in various verification efforts on different projects with verifying elements of instruction issue unit, and with various elements of core level fault tolerance mechanisms. Senior Hardware Verification Engineer IBM September 1998  –  June 2013  (14 years 10 months) Austin Responsible for hardware verification across entire life cycle of products from high level design to hardware lab failure analysis for many generations of IBM Power and Z series systems.  \n \n- Power8, Power7, Power6 \nInstruction fetch/decode unit verification team lead - responsible for leading international team developing and implementing verification plan for unit level verification of instruction fetch, instruction decode, branch prediction, and branch execution logic for processor core. \n \n- Power 5 \nInstruction fetch/decode unit verification team lead - responsible for leading team developing and implementing verification plan for unit level verification of instruction decode logic for processor core. \n \n- Power 4 \nResponsible for verification of processor core fixed point and floating point arithmetic functions \n \n- Z Series \nAssisted in various verification efforts on different projects with verifying elements of instruction issue unit, and with various elements of core level fault tolerance mechanisms. Software Engineer Tandem Computers August 1997  –  August 1998  (1 year 1 month) Austin, Texas Area Responsible for verification of frame relay card hardware and device driver running under real-time operating system, for a highly fault tolerant system designed for Motorola cellular systems. Developed testbench using C,C++, Perl running on real time operating system. Diagnosed device driver software and hardware problems. Software Engineer Tandem Computers August 1997  –  August 1998  (1 year 1 month) Austin, Texas Area Responsible for verification of frame relay card hardware and device driver running under real-time operating system, for a highly fault tolerant system designed for Motorola cellular systems. Developed testbench using C,C++, Perl running on real time operating system. Diagnosed device driver software and hardware problems. Software Engineer Raytheon May 1995  –  August 1997  (2 years 4 months) Dallas/Fort Worth Area Developed distributed fault tolerant transaction processing system across multiple platforms including Sun, SGI, Cray, IBM systems for government agency requiring SSBI clearance. Particular responsibilities included process and resource management control, primarily using C++ and Perl on unix platforms. Software Engineer Raytheon May 1995  –  August 1997  (2 years 4 months) Dallas/Fort Worth Area Developed distributed fault tolerant transaction processing system across multiple platforms including Sun, SGI, Cray, IBM systems for government agency requiring SSBI clearance. Particular responsibilities included process and resource management control, primarily using C++ and Perl on unix platforms. Skills C++ Java Eclipse Perl CVS Hardware Verification Functional Verification Object Oriented Design Android Ant Software Engineering Hardware Unix Operating Systems Distributed Systems Debugging C See 2+     See less Skills  C++ Java Eclipse Perl CVS Hardware Verification Functional Verification Object Oriented Design Android Ant Software Engineering Hardware Unix Operating Systems Distributed Systems Debugging C See 2+     See less C++ Java Eclipse Perl CVS Hardware Verification Functional Verification Object Oriented Design Android Ant Software Engineering Hardware Unix Operating Systems Distributed Systems Debugging C See 2+     See less C++ Java Eclipse Perl CVS Hardware Verification Functional Verification Object Oriented Design Android Ant Software Engineering Hardware Unix Operating Systems Distributed Systems Debugging C See 2+     See less Education The University of Texas at Austin MSE,  Software Engineering 1998  – 1999 The University of Texas at Austin BS,  Computer Science 1992  – 1995 Texas Academy of Mathematics and Science 1988  – 1990 The University of Texas at Austin MSE,  Software Engineering 1998  – 1999 The University of Texas at Austin MSE,  Software Engineering 1998  – 1999 The University of Texas at Austin MSE,  Software Engineering 1998  – 1999 The University of Texas at Austin BS,  Computer Science 1992  – 1995 The University of Texas at Austin BS,  Computer Science 1992  – 1995 The University of Texas at Austin BS,  Computer Science 1992  – 1995 Texas Academy of Mathematics and Science 1988  – 1990 Texas Academy of Mathematics and Science 1988  – 1990 Texas Academy of Mathematics and Science 1988  – 1990 ", "Experience Medical Student University of North Dakota August 2014  – Present (1 year 1 month) Hardware and Verification Engineer IBM October 2008  – Present (6 years 11 months) Medical Student University of North Dakota August 2014  – Present (1 year 1 month) Medical Student University of North Dakota August 2014  – Present (1 year 1 month) Hardware and Verification Engineer IBM October 2008  – Present (6 years 11 months) Hardware and Verification Engineer IBM October 2008  – Present (6 years 11 months) Languages   Skills Skills     Education The University of North Dakota Doctor of Medicine (MD) 2014 University of Minnesota-Rochester University of Wisconsin-Madison MS 2006  – 2008 North Dakota State University BS 2001  – 2006 The University of North Dakota Doctor of Medicine (MD) 2014 The University of North Dakota Doctor of Medicine (MD) 2014 The University of North Dakota Doctor of Medicine (MD) 2014 University of Minnesota-Rochester University of Minnesota-Rochester University of Minnesota-Rochester University of Wisconsin-Madison MS 2006  – 2008 University of Wisconsin-Madison MS 2006  – 2008 University of Wisconsin-Madison MS 2006  – 2008 North Dakota State University BS 2001  – 2006 North Dakota State University BS 2001  – 2006 North Dakota State University BS 2001  – 2006 Honors & Awards ", "Experience Hardware Verification Engineer, AMD contractor SiliconService April 2006  – Present (9 years 5 months) 2006 - 2008 : Ethernet IPv6 and PCIExpress Gen2 cores verification;  \n2008 - present: Gatelevel & full chip verification in x86 multicore architecture; Hardware Verification Engineer, IBM Haifa Labs contractor AsicArt April 2006  –  December 2007  (1 year 9 months) Hardware Verification Engineer, AMD contractor SiliconService April 2006  – Present (9 years 5 months) 2006 - 2008 : Ethernet IPv6 and PCIExpress Gen2 cores verification;  \n2008 - present: Gatelevel & full chip verification in x86 multicore architecture; Hardware Verification Engineer, AMD contractor SiliconService April 2006  – Present (9 years 5 months) 2006 - 2008 : Ethernet IPv6 and PCIExpress Gen2 cores verification;  \n2008 - present: Gatelevel & full chip verification in x86 multicore architecture; Hardware Verification Engineer, IBM Haifa Labs contractor AsicArt April 2006  –  December 2007  (1 year 9 months) Hardware Verification Engineer, IBM Haifa Labs contractor AsicArt April 2006  –  December 2007  (1 year 9 months) Skills VCS C++ VHDL x86 Architecture Verilog System Verilog Simulation Functional Verification Digital Design Perl Debugging SoC Embedded Systems ASIC Ethernet SystemVerilog X86 Integrated Circuit... Computer Architecture Hardware Architecture Formal Verification Specman Simulations Hardware EDA Microprocessors TCL Static Timing Analysis ModelSim Open Verification... VMM RTL design FPGA UVM Veritas Cluster Server Processors VLSI See 22+     See less Skills  VCS C++ VHDL x86 Architecture Verilog System Verilog Simulation Functional Verification Digital Design Perl Debugging SoC Embedded Systems ASIC Ethernet SystemVerilog X86 Integrated Circuit... Computer Architecture Hardware Architecture Formal Verification Specman Simulations Hardware EDA Microprocessors TCL Static Timing Analysis ModelSim Open Verification... VMM RTL design FPGA UVM Veritas Cluster Server Processors VLSI See 22+     See less VCS C++ VHDL x86 Architecture Verilog System Verilog Simulation Functional Verification Digital Design Perl Debugging SoC Embedded Systems ASIC Ethernet SystemVerilog X86 Integrated Circuit... Computer Architecture Hardware Architecture Formal Verification Specman Simulations Hardware EDA Microprocessors TCL Static Timing Analysis ModelSim Open Verification... VMM RTL design FPGA UVM Veritas Cluster Server Processors VLSI See 22+     See less VCS C++ VHDL x86 Architecture Verilog System Verilog Simulation Functional Verification Digital Design Perl Debugging SoC Embedded Systems ASIC Ethernet SystemVerilog X86 Integrated Circuit... Computer Architecture Hardware Architecture Formal Verification Specman Simulations Hardware EDA Microprocessors TCL Static Timing Analysis ModelSim Open Verification... VMM RTL design FPGA UVM Veritas Cluster Server Processors VLSI See 22+     See less Education Diploma Engineer,  Computer Engineering Department 2001  – 2006 Diploma Engineer,  Computer Engineering Department 2001  – 2006 Diploma Engineer,  Computer Engineering Department 2001  – 2006 Diploma Engineer,  Computer Engineering Department 2001  – 2006 ", "Summary Working on leading edge microprocessors in presilicon verification \nCreate directed random simulation environments \nFind the bugs while it's cheap and easy to fix. \nWork closely with logic design team Summary Working on leading edge microprocessors in presilicon verification \nCreate directed random simulation environments \nFind the bugs while it's cheap and easy to fix. \nWork closely with logic design team Working on leading edge microprocessors in presilicon verification \nCreate directed random simulation environments \nFind the bugs while it's cheap and easy to fix. \nWork closely with logic design team Working on leading edge microprocessors in presilicon verification \nCreate directed random simulation environments \nFind the bugs while it's cheap and easy to fix. \nWork closely with logic design team Experience Core RTX Lead IBM February 2014  – Present (1 year 7 months) Austin, TX Core Architectural Level Checking \n \nCoreCommon code \n \nSimulation Model build Hardware Verification Engineer IBM January 2002  – Present (13 years 8 months) Austin, TX Functional Simulation and Verification of IBM Power Series Processors.  \n \nFocus on LoadStore, Address Translation, and InstrFetch Units. \n \nPrior Projects: Power5+, Power6, Power7, Power8 Core RTX Lead IBM February 2014  – Present (1 year 7 months) Austin, TX Core Architectural Level Checking \n \nCoreCommon code \n \nSimulation Model build Core RTX Lead IBM February 2014  – Present (1 year 7 months) Austin, TX Core Architectural Level Checking \n \nCoreCommon code \n \nSimulation Model build Hardware Verification Engineer IBM January 2002  – Present (13 years 8 months) Austin, TX Functional Simulation and Verification of IBM Power Series Processors.  \n \nFocus on LoadStore, Address Translation, and InstrFetch Units. \n \nPrior Projects: Power5+, Power6, Power7, Power8 Hardware Verification Engineer IBM January 2002  – Present (13 years 8 months) Austin, TX Functional Simulation and Verification of IBM Power Series Processors.  \n \nFocus on LoadStore, Address Translation, and InstrFetch Units. \n \nPrior Projects: Power5+, Power6, Power7, Power8 Skills Computer Architecture Logic Design Perl Unix Linux C Java Software Engineering C++ Debugging Embedded Systems Verilog Shell Scripting Functional Verification VHDL Simulations Ksh PowerPC Power Address... Microprocessors Processors Hardware Architecture VLSI ASIC See 9+     See less Skills  Computer Architecture Logic Design Perl Unix Linux C Java Software Engineering C++ Debugging Embedded Systems Verilog Shell Scripting Functional Verification VHDL Simulations Ksh PowerPC Power Address... Microprocessors Processors Hardware Architecture VLSI ASIC See 9+     See less Computer Architecture Logic Design Perl Unix Linux C Java Software Engineering C++ Debugging Embedded Systems Verilog Shell Scripting Functional Verification VHDL Simulations Ksh PowerPC Power Address... Microprocessors Processors Hardware Architecture VLSI ASIC See 9+     See less Computer Architecture Logic Design Perl Unix Linux C Java Software Engineering C++ Debugging Embedded Systems Verilog Shell Scripting Functional Verification VHDL Simulations Ksh PowerPC Power Address... Microprocessors Processors Hardware Architecture VLSI ASIC See 9+     See less Education University of Wisconsin-Madison Bachelor of Science (BS),  Computer Engineering ,  Computer Science 1996  – 2001 Double major in Electrical Computer Engineer (focus on Digital Computer Design) and Computer Science. Activities and Societies:  IEEE ,  amateur ice hockey University of Wisconsin-Madison Bachelor of Science (BS),  Computer Engineering ,  Computer Science 1996  – 2001 Double major in Electrical Computer Engineer (focus on Digital Computer Design) and Computer Science. Activities and Societies:  IEEE ,  amateur ice hockey University of Wisconsin-Madison Bachelor of Science (BS),  Computer Engineering ,  Computer Science 1996  – 2001 Double major in Electrical Computer Engineer (focus on Digital Computer Design) and Computer Science. Activities and Societies:  IEEE ,  amateur ice hockey University of Wisconsin-Madison Bachelor of Science (BS),  Computer Engineering ,  Computer Science 1996  – 2001 Double major in Electrical Computer Engineer (focus on Digital Computer Design) and Computer Science. Activities and Societies:  IEEE ,  amateur ice hockey ", "Experience Senior Engineer -- Hardware Performance Verification and Validation IBM January 2014  – Present (1 year 8 months) Boeblingen, Germany Senior engineer and team leader in System Z and POWER hardware development. \nFocus is on hardware performance verification and validation on pre-silicon models and functional verification.  Senior Hardware Verification Engineer IBM November 2011  – Present (3 years 10 months) Boeblingen, Germany Senior engineer and team leader with focus on System Z hardware development. Technical Consultant IBM July 2011  –  November 2011  (5 months) IBM Hardware Verification Engineer IBM February 2001  –  June 2011  (10 years 5 months) IBM Hardware verification engineer and team leader in various hardware development projects. Senior Software Developer Program Development Cooperation January 2000  –  January 2001  (1 year 1 month) White Plains, NY, USA Development of software for grid generation of computational physics code, i.e. computational fluid dynamics.  \nSupport for sales and marketing. Computational Fluid Dynamics (CFD) Engineer and Researcher Center of Logistics and Expert Systems February 1994  –  December 1999  (5 years 11 months) -Research on \"Strategies for Parallel and Numerical Scalability for Complex Computational Fluid Dynamics Codes\". \n-CFD code development  \n-Contract works for the European Space Agency (ESTEC) \n-Development of domain decomposition software \n-Visualization of fluid flow of complex geometries \n-Lectures and short courses on high performance computing \n-CFD process automation and improvements \n-Grid generation \n-High Performance Computing, Cluster Computing \n \n Senior Engineer -- Hardware Performance Verification and Validation IBM January 2014  – Present (1 year 8 months) Boeblingen, Germany Senior engineer and team leader in System Z and POWER hardware development. \nFocus is on hardware performance verification and validation on pre-silicon models and functional verification.  Senior Engineer -- Hardware Performance Verification and Validation IBM January 2014  – Present (1 year 8 months) Boeblingen, Germany Senior engineer and team leader in System Z and POWER hardware development. \nFocus is on hardware performance verification and validation on pre-silicon models and functional verification.  Senior Hardware Verification Engineer IBM November 2011  – Present (3 years 10 months) Boeblingen, Germany Senior engineer and team leader with focus on System Z hardware development. Senior Hardware Verification Engineer IBM November 2011  – Present (3 years 10 months) Boeblingen, Germany Senior engineer and team leader with focus on System Z hardware development. Technical Consultant IBM July 2011  –  November 2011  (5 months) IBM Technical Consultant IBM July 2011  –  November 2011  (5 months) IBM Hardware Verification Engineer IBM February 2001  –  June 2011  (10 years 5 months) IBM Hardware verification engineer and team leader in various hardware development projects. Hardware Verification Engineer IBM February 2001  –  June 2011  (10 years 5 months) IBM Hardware verification engineer and team leader in various hardware development projects. Senior Software Developer Program Development Cooperation January 2000  –  January 2001  (1 year 1 month) White Plains, NY, USA Development of software for grid generation of computational physics code, i.e. computational fluid dynamics.  \nSupport for sales and marketing. Senior Software Developer Program Development Cooperation January 2000  –  January 2001  (1 year 1 month) White Plains, NY, USA Development of software for grid generation of computational physics code, i.e. computational fluid dynamics.  \nSupport for sales and marketing. Computational Fluid Dynamics (CFD) Engineer and Researcher Center of Logistics and Expert Systems February 1994  –  December 1999  (5 years 11 months) -Research on \"Strategies for Parallel and Numerical Scalability for Complex Computational Fluid Dynamics Codes\". \n-CFD code development  \n-Contract works for the European Space Agency (ESTEC) \n-Development of domain decomposition software \n-Visualization of fluid flow of complex geometries \n-Lectures and short courses on high performance computing \n-CFD process automation and improvements \n-Grid generation \n-High Performance Computing, Cluster Computing \n \n Computational Fluid Dynamics (CFD) Engineer and Researcher Center of Logistics and Expert Systems February 1994  –  December 1999  (5 years 11 months) -Research on \"Strategies for Parallel and Numerical Scalability for Complex Computational Fluid Dynamics Codes\". \n-CFD code development  \n-Contract works for the European Space Agency (ESTEC) \n-Development of domain decomposition software \n-Visualization of fluid flow of complex geometries \n-Lectures and short courses on high performance computing \n-CFD process automation and improvements \n-Grid generation \n-High Performance Computing, Cluster Computing \n \n Skills Hardware Performance Computer Performance Functional Verification High Performance... Debugging Software Design CFD Simulation Software Software Development Programming EDA IBM Mainframe Hardware Architecture Microprocessors Computational Geometry Grid Generation Load Balancing Fluid Simulation Test Planning Test Processes Analysis Requirements Analysis Consulting Business Development Aerodynamics See 10+     See less Skills  Hardware Performance Computer Performance Functional Verification High Performance... Debugging Software Design CFD Simulation Software Software Development Programming EDA IBM Mainframe Hardware Architecture Microprocessors Computational Geometry Grid Generation Load Balancing Fluid Simulation Test Planning Test Processes Analysis Requirements Analysis Consulting Business Development Aerodynamics See 10+     See less Hardware Performance Computer Performance Functional Verification High Performance... Debugging Software Design CFD Simulation Software Software Development Programming EDA IBM Mainframe Hardware Architecture Microprocessors Computational Geometry Grid Generation Load Balancing Fluid Simulation Test Planning Test Processes Analysis Requirements Analysis Consulting Business Development Aerodynamics See 10+     See less Hardware Performance Computer Performance Functional Verification High Performance... Debugging Software Design CFD Simulation Software Software Development Programming EDA IBM Mainframe Hardware Architecture Microprocessors Computational Geometry Grid Generation Load Balancing Fluid Simulation Test Planning Test Processes Analysis Requirements Analysis Consulting Business Development Aerodynamics See 10+     See less Education University of Greenwich PhD,  Computer Science 1994  – 1999 California Institute of Technology High Performance Computing in Aerospace 1996  – 1998 Invited visits at CACR during the summers. \nResearch on the field of high performance computing for computational fluid dynamics. Fachhochschule Braunschweig-Wolfenbüttel Dipl.-Ing.,  Computer Science 1990  – 1994 University of California, Berkeley Computational physics for buildings 1992  – 1992 University of Greenwich PhD,  Computer Science 1994  – 1999 University of Greenwich PhD,  Computer Science 1994  – 1999 University of Greenwich PhD,  Computer Science 1994  – 1999 California Institute of Technology High Performance Computing in Aerospace 1996  – 1998 Invited visits at CACR during the summers. \nResearch on the field of high performance computing for computational fluid dynamics. California Institute of Technology High Performance Computing in Aerospace 1996  – 1998 Invited visits at CACR during the summers. \nResearch on the field of high performance computing for computational fluid dynamics. California Institute of Technology High Performance Computing in Aerospace 1996  – 1998 Invited visits at CACR during the summers. \nResearch on the field of high performance computing for computational fluid dynamics. Fachhochschule Braunschweig-Wolfenbüttel Dipl.-Ing.,  Computer Science 1990  – 1994 Fachhochschule Braunschweig-Wolfenbüttel Dipl.-Ing.,  Computer Science 1990  – 1994 Fachhochschule Braunschweig-Wolfenbüttel Dipl.-Ing.,  Computer Science 1990  – 1994 University of California, Berkeley Computational physics for buildings 1992  – 1992 University of California, Berkeley Computational physics for buildings 1992  – 1992 University of California, Berkeley Computational physics for buildings 1992  – 1992 ", "Experience Hardware Verification Engineer IBM Hardware Verification Engineer IBM Hardware Verification Engineer IBM ", "Summary Highly motivated electrical engineer with a broad background in underwater acoustics, Radar systems, and signal processing algorithm development. Demonstrated ability to lead sonar/radar projects from contract acquisition to completion. Experienced in the process of obtaining funding through DOD and government agencies. Currently pursuing a PhD in Ocean Engineering at URI. US citizen with active TOP SECRET clearance and DHS Suitability. \n \nSpecialties:  \n• 10+ years of MATLAB and Simulink experience with a signal processing/communications bias.  \n• Sonar/Radar system performance modeling and design. \n• Conducting field tests for Sonar and Radar systems. \n• Oases, Bellhop, Kraken underwater ocean acoustic modeling software. \n• Business development and outreach within government agencies and the underwater acoustic field. Summary Highly motivated electrical engineer with a broad background in underwater acoustics, Radar systems, and signal processing algorithm development. Demonstrated ability to lead sonar/radar projects from contract acquisition to completion. Experienced in the process of obtaining funding through DOD and government agencies. Currently pursuing a PhD in Ocean Engineering at URI. US citizen with active TOP SECRET clearance and DHS Suitability. \n \nSpecialties:  \n• 10+ years of MATLAB and Simulink experience with a signal processing/communications bias.  \n• Sonar/Radar system performance modeling and design. \n• Conducting field tests for Sonar and Radar systems. \n• Oases, Bellhop, Kraken underwater ocean acoustic modeling software. \n• Business development and outreach within government agencies and the underwater acoustic field. Highly motivated electrical engineer with a broad background in underwater acoustics, Radar systems, and signal processing algorithm development. Demonstrated ability to lead sonar/radar projects from contract acquisition to completion. Experienced in the process of obtaining funding through DOD and government agencies. Currently pursuing a PhD in Ocean Engineering at URI. US citizen with active TOP SECRET clearance and DHS Suitability. \n \nSpecialties:  \n• 10+ years of MATLAB and Simulink experience with a signal processing/communications bias.  \n• Sonar/Radar system performance modeling and design. \n• Conducting field tests for Sonar and Radar systems. \n• Oases, Bellhop, Kraken underwater ocean acoustic modeling software. \n• Business development and outreach within government agencies and the underwater acoustic field. Highly motivated electrical engineer with a broad background in underwater acoustics, Radar systems, and signal processing algorithm development. Demonstrated ability to lead sonar/radar projects from contract acquisition to completion. Experienced in the process of obtaining funding through DOD and government agencies. Currently pursuing a PhD in Ocean Engineering at URI. US citizen with active TOP SECRET clearance and DHS Suitability. \n \nSpecialties:  \n• 10+ years of MATLAB and Simulink experience with a signal processing/communications bias.  \n• Sonar/Radar system performance modeling and design. \n• Conducting field tests for Sonar and Radar systems. \n• Oases, Bellhop, Kraken underwater ocean acoustic modeling software. \n• Business development and outreach within government agencies and the underwater acoustic field. Experience Lead Sensor Systems Engineer MITRE May 2014  – Present (1 year 4 months) Bedford, MA • Leading development of MITRE's Underwater Acoustic research program including: \n-- applications in multi-statics \n-- customer outreach  \n-- government collaboration  \n• Accepted into the MITRE Accelerated Graduate Degree Program (AGDP) to pursue PhD in Underwater Acoustics  \n• MXR Modeling Lead: \n--modeling system performance of various radar systems in MITRE's Experimental Radar (MXR) portfolio. \n--involved in day-to-day design decisions. \n• Algorithmic development of tracking algorithms for Radar and Sonar systems. \n• Overseeing and participation in field tests for various Radar systems in the MXR portfolio. \n• Dept hiring lead Co-Founder, Managing Partner Dictum Meum Pactum, LLC August 2008  – Present (7 years 1 month) Senior Sensors Systems Engineer MITRE June 2011  –  May 2014  (3 years) Bedford, MA • Principle Investigator on MITRE Inovation Program (MIP) internal research project exploring multi-static sonar signal processing algorithms. \n• Member of Exploitation Modeling team: \n--modeling system performance of various radar systems in MITRE's Experimental Radar (MXR) portfolio. \n--involved in day-to-day design decisions. \n• Algorithmic development of tracking algorithms for Radar and Sonar systems. \n• Overseeing and participation in field tests for various Radar systems in the MXR portfolio. Acoustic Research Scientist Scientific Solutions, Inc. June 2008  –  May 2011  (3 years) • Technical Lead/Project Manager for SBIR phase 1 contract to design a low power, low physical footprint sonar system for marine mammal mitigation. \n• Involved in business development/outreach by writing SBIR proposals, meeting with potential customers, presenting papers at conferences, and acting as a sonar consultant.  \n• Designed detection, localization, tracking, and classification algorithms for swimmer and marine mammal tracking sonar systems.  \n• Created underwater acoustical models using OASES, KRAKEN, and BELLHOP modeling software for sonar systems. \n• Responsible for the migration of signal processing algorithms to hardware using Xilinx FPGAs.  \n• Oversaw and conducted in-field acoustical and system performance tests in both domestic and international locations. Communications Engineer MITRE June 2007  –  May 2008  (1 year) • Responsible for alternative design and implementation plan for satellite data rate re-sampler. \n• Designed re-sampler using Farrow Filter structure to allow arbitrary sampling rate changes. \n• Researched Farrow Filter characteristics in MATLAB and SIMULINK to determine suitability for re-sampler design. Teaching Assistant Tufts University September 2006  –  May 2008  (1 year 9 months) • Taught labs for Junior and Senior Electrical Engineers for Intro to Radio, Communication Theory 1 & 2. \n• Held office hours for students to help them with homework and test preparation. Research Assistant University of Vermont November 2005  –  May 2006  (7 months) • Performed functionality analysis on Cypress WirelessUSB kit for Goodrich Corp. \n• Developed performance tests based on Goodrich Corp. specifications. \n• Created tests to determine suitability for non-critical flight wireless sensor and actuator systems Pre-Professional Hardware Verification Engineer IBM May 2005  –  November 2005  (7 months) • Performed hardware verification for Power PC microprocessors. \n• Identified circuit/process sensitivities in microprocessors improving reliability and performance. \n• Debugged customer returns to find root cause of defect Test Technichian 2 Nexus Custom Electronics Corp. June 2004  –  August 2004  (3 months) • Performed testing on digital/analog servo driver, Military spec power supply, and Diop boards. \n• Utilized GenRad In-circuit tester, Functional Test modules, and Intel microprocessor technology. \n• Participated in decision-making process for purchase of new digital scopes Lead Sensor Systems Engineer MITRE May 2014  – Present (1 year 4 months) Bedford, MA • Leading development of MITRE's Underwater Acoustic research program including: \n-- applications in multi-statics \n-- customer outreach  \n-- government collaboration  \n• Accepted into the MITRE Accelerated Graduate Degree Program (AGDP) to pursue PhD in Underwater Acoustics  \n• MXR Modeling Lead: \n--modeling system performance of various radar systems in MITRE's Experimental Radar (MXR) portfolio. \n--involved in day-to-day design decisions. \n• Algorithmic development of tracking algorithms for Radar and Sonar systems. \n• Overseeing and participation in field tests for various Radar systems in the MXR portfolio. \n• Dept hiring lead Lead Sensor Systems Engineer MITRE May 2014  – Present (1 year 4 months) Bedford, MA • Leading development of MITRE's Underwater Acoustic research program including: \n-- applications in multi-statics \n-- customer outreach  \n-- government collaboration  \n• Accepted into the MITRE Accelerated Graduate Degree Program (AGDP) to pursue PhD in Underwater Acoustics  \n• MXR Modeling Lead: \n--modeling system performance of various radar systems in MITRE's Experimental Radar (MXR) portfolio. \n--involved in day-to-day design decisions. \n• Algorithmic development of tracking algorithms for Radar and Sonar systems. \n• Overseeing and participation in field tests for various Radar systems in the MXR portfolio. \n• Dept hiring lead Co-Founder, Managing Partner Dictum Meum Pactum, LLC August 2008  – Present (7 years 1 month) Co-Founder, Managing Partner Dictum Meum Pactum, LLC August 2008  – Present (7 years 1 month) Senior Sensors Systems Engineer MITRE June 2011  –  May 2014  (3 years) Bedford, MA • Principle Investigator on MITRE Inovation Program (MIP) internal research project exploring multi-static sonar signal processing algorithms. \n• Member of Exploitation Modeling team: \n--modeling system performance of various radar systems in MITRE's Experimental Radar (MXR) portfolio. \n--involved in day-to-day design decisions. \n• Algorithmic development of tracking algorithms for Radar and Sonar systems. \n• Overseeing and participation in field tests for various Radar systems in the MXR portfolio. Senior Sensors Systems Engineer MITRE June 2011  –  May 2014  (3 years) Bedford, MA • Principle Investigator on MITRE Inovation Program (MIP) internal research project exploring multi-static sonar signal processing algorithms. \n• Member of Exploitation Modeling team: \n--modeling system performance of various radar systems in MITRE's Experimental Radar (MXR) portfolio. \n--involved in day-to-day design decisions. \n• Algorithmic development of tracking algorithms for Radar and Sonar systems. \n• Overseeing and participation in field tests for various Radar systems in the MXR portfolio. Acoustic Research Scientist Scientific Solutions, Inc. June 2008  –  May 2011  (3 years) • Technical Lead/Project Manager for SBIR phase 1 contract to design a low power, low physical footprint sonar system for marine mammal mitigation. \n• Involved in business development/outreach by writing SBIR proposals, meeting with potential customers, presenting papers at conferences, and acting as a sonar consultant.  \n• Designed detection, localization, tracking, and classification algorithms for swimmer and marine mammal tracking sonar systems.  \n• Created underwater acoustical models using OASES, KRAKEN, and BELLHOP modeling software for sonar systems. \n• Responsible for the migration of signal processing algorithms to hardware using Xilinx FPGAs.  \n• Oversaw and conducted in-field acoustical and system performance tests in both domestic and international locations. Acoustic Research Scientist Scientific Solutions, Inc. June 2008  –  May 2011  (3 years) • Technical Lead/Project Manager for SBIR phase 1 contract to design a low power, low physical footprint sonar system for marine mammal mitigation. \n• Involved in business development/outreach by writing SBIR proposals, meeting with potential customers, presenting papers at conferences, and acting as a sonar consultant.  \n• Designed detection, localization, tracking, and classification algorithms for swimmer and marine mammal tracking sonar systems.  \n• Created underwater acoustical models using OASES, KRAKEN, and BELLHOP modeling software for sonar systems. \n• Responsible for the migration of signal processing algorithms to hardware using Xilinx FPGAs.  \n• Oversaw and conducted in-field acoustical and system performance tests in both domestic and international locations. Communications Engineer MITRE June 2007  –  May 2008  (1 year) • Responsible for alternative design and implementation plan for satellite data rate re-sampler. \n• Designed re-sampler using Farrow Filter structure to allow arbitrary sampling rate changes. \n• Researched Farrow Filter characteristics in MATLAB and SIMULINK to determine suitability for re-sampler design. Communications Engineer MITRE June 2007  –  May 2008  (1 year) • Responsible for alternative design and implementation plan for satellite data rate re-sampler. \n• Designed re-sampler using Farrow Filter structure to allow arbitrary sampling rate changes. \n• Researched Farrow Filter characteristics in MATLAB and SIMULINK to determine suitability for re-sampler design. Teaching Assistant Tufts University September 2006  –  May 2008  (1 year 9 months) • Taught labs for Junior and Senior Electrical Engineers for Intro to Radio, Communication Theory 1 & 2. \n• Held office hours for students to help them with homework and test preparation. Teaching Assistant Tufts University September 2006  –  May 2008  (1 year 9 months) • Taught labs for Junior and Senior Electrical Engineers for Intro to Radio, Communication Theory 1 & 2. \n• Held office hours for students to help them with homework and test preparation. Research Assistant University of Vermont November 2005  –  May 2006  (7 months) • Performed functionality analysis on Cypress WirelessUSB kit for Goodrich Corp. \n• Developed performance tests based on Goodrich Corp. specifications. \n• Created tests to determine suitability for non-critical flight wireless sensor and actuator systems Research Assistant University of Vermont November 2005  –  May 2006  (7 months) • Performed functionality analysis on Cypress WirelessUSB kit for Goodrich Corp. \n• Developed performance tests based on Goodrich Corp. specifications. \n• Created tests to determine suitability for non-critical flight wireless sensor and actuator systems Pre-Professional Hardware Verification Engineer IBM May 2005  –  November 2005  (7 months) • Performed hardware verification for Power PC microprocessors. \n• Identified circuit/process sensitivities in microprocessors improving reliability and performance. \n• Debugged customer returns to find root cause of defect Pre-Professional Hardware Verification Engineer IBM May 2005  –  November 2005  (7 months) • Performed hardware verification for Power PC microprocessors. \n• Identified circuit/process sensitivities in microprocessors improving reliability and performance. \n• Debugged customer returns to find root cause of defect Test Technichian 2 Nexus Custom Electronics Corp. June 2004  –  August 2004  (3 months) • Performed testing on digital/analog servo driver, Military spec power supply, and Diop boards. \n• Utilized GenRad In-circuit tester, Functional Test modules, and Intel microprocessor technology. \n• Participated in decision-making process for purchase of new digital scopes Test Technichian 2 Nexus Custom Electronics Corp. June 2004  –  August 2004  (3 months) • Performed testing on digital/analog servo driver, Military spec power supply, and Diop boards. \n• Utilized GenRad In-circuit tester, Functional Test modules, and Intel microprocessor technology. \n• Participated in decision-making process for purchase of new digital scopes Languages   Skills Radar Signal Processing Algorithm Design Acoustics Matlab Simulink Sensors Electrical Engineering Algorithms DoD Data Analysis Proposal Writing Distributed Systems Algorithm Development Sonar Performance Analysis System Modeling Algorithm Optimization Underwater Acoustics Security Clearance Modeling DSP System Design Microsoft Office MS Project Systems Engineering Simulation Technical Writing Research Simulations Image Processing Software Engineering See 17+     See less Skills  Radar Signal Processing Algorithm Design Acoustics Matlab Simulink Sensors Electrical Engineering Algorithms DoD Data Analysis Proposal Writing Distributed Systems Algorithm Development Sonar Performance Analysis System Modeling Algorithm Optimization Underwater Acoustics Security Clearance Modeling DSP System Design Microsoft Office MS Project Systems Engineering Simulation Technical Writing Research Simulations Image Processing Software Engineering See 17+     See less Radar Signal Processing Algorithm Design Acoustics Matlab Simulink Sensors Electrical Engineering Algorithms DoD Data Analysis Proposal Writing Distributed Systems Algorithm Development Sonar Performance Analysis System Modeling Algorithm Optimization Underwater Acoustics Security Clearance Modeling DSP System Design Microsoft Office MS Project Systems Engineering Simulation Technical Writing Research Simulations Image Processing Software Engineering See 17+     See less Radar Signal Processing Algorithm Design Acoustics Matlab Simulink Sensors Electrical Engineering Algorithms DoD Data Analysis Proposal Writing Distributed Systems Algorithm Development Sonar Performance Analysis System Modeling Algorithm Optimization Underwater Acoustics Security Clearance Modeling DSP System Design Microsoft Office MS Project Systems Engineering Simulation Technical Writing Research Simulations Image Processing Software Engineering See 17+     See less Education University of Rhode Island Doctor of Philosophy (Ph.D.),  Ocean Engineering - Underwater Acoustics 2014  – 2018 Tufts University MSEE,  Electrical Engineering 2006  – 2008 University of Vermont BSEE,  Electrical Engineering 2002  – 2006 Activities and Societies:  Tau Beta Pi ,  IEEE ,  National Deans List Georgia Tech Principles of Modern Radar Course Penn State University Short Course in Underwater Acoustics and Signal Processing NATO Undersea Research Centre Course 2010-02: Port security: basics of defense against underwater intruders Wayland High School 1999  – 2002 University of Rhode Island Doctor of Philosophy (Ph.D.),  Ocean Engineering - Underwater Acoustics 2014  – 2018 University of Rhode Island Doctor of Philosophy (Ph.D.),  Ocean Engineering - Underwater Acoustics 2014  – 2018 University of Rhode Island Doctor of Philosophy (Ph.D.),  Ocean Engineering - Underwater Acoustics 2014  – 2018 Tufts University MSEE,  Electrical Engineering 2006  – 2008 Tufts University MSEE,  Electrical Engineering 2006  – 2008 Tufts University MSEE,  Electrical Engineering 2006  – 2008 University of Vermont BSEE,  Electrical Engineering 2002  – 2006 Activities and Societies:  Tau Beta Pi ,  IEEE ,  National Deans List University of Vermont BSEE,  Electrical Engineering 2002  – 2006 Activities and Societies:  Tau Beta Pi ,  IEEE ,  National Deans List University of Vermont BSEE,  Electrical Engineering 2002  – 2006 Activities and Societies:  Tau Beta Pi ,  IEEE ,  National Deans List Georgia Tech Principles of Modern Radar Course Georgia Tech Principles of Modern Radar Course Georgia Tech Principles of Modern Radar Course Penn State University Short Course in Underwater Acoustics and Signal Processing Penn State University Short Course in Underwater Acoustics and Signal Processing Penn State University Short Course in Underwater Acoustics and Signal Processing NATO Undersea Research Centre Course 2010-02: Port security: basics of defense against underwater intruders NATO Undersea Research Centre Course 2010-02: Port security: basics of defense against underwater intruders NATO Undersea Research Centre Course 2010-02: Port security: basics of defense against underwater intruders Wayland High School 1999  – 2002 Wayland High School 1999  – 2002 Wayland High School 1999  – 2002 Honors & Awards ECE Sophomore Achievment Award University of Vermont ECE Dept. April 2003 10x Special Recognition Award MITRE Corp March 2013 Spot Award - FY14 MITRE Innovation Program (MIP) MITRE April 2013 ECE Sophomore Achievment Award University of Vermont ECE Dept. April 2003 ECE Sophomore Achievment Award University of Vermont ECE Dept. April 2003 ECE Sophomore Achievment Award University of Vermont ECE Dept. April 2003 10x Special Recognition Award MITRE Corp March 2013 10x Special Recognition Award MITRE Corp March 2013 10x Special Recognition Award MITRE Corp March 2013 Spot Award - FY14 MITRE Innovation Program (MIP) MITRE April 2013 Spot Award - FY14 MITRE Innovation Program (MIP) MITRE April 2013 Spot Award - FY14 MITRE Innovation Program (MIP) MITRE April 2013 ", "Experience Mathematics Advisor Empire Edge September 2013  –  June 2014  (10 months) New York, NY Tutored students one-on-one in Algebra, Geometry, Honors Geometry, Algebra II/Trigonometry, Precalculus, Honors Precalculus, and Computer Science. High School Math Teacher The Bronx High School of Science September 2009  –  August 2013  (4 years) Bronx, NY · Planned and executed unit and lesson plans for Geometry, Precalculus, and Computer Science Projects. \n· Integrated real world problems and applications based on student career interests to demonstrate the relevance and importance of mathematics. \n· Created hands on activities to promote an interactive, discovery based approach to learning. \n· Utilized discussion based lessons in order to promote a deeper understanding of the topics. \n· Incorporated various technologies into the classroom, including Geometer’s Sketchpad, Smartboards, and graphing calculators. \n· Collaborated with colleagues to establish best practices and curriculum maps that integrated the Common Core Standards. \n· Mentored and advised the all female FIRST FRC Robotics Team, the FeMaidens. Hardware Verification Engineer IBM June 2002  –  May 2008  (6 years) Poughkeepsie, NY Mathematics Advisor Empire Edge September 2013  –  June 2014  (10 months) New York, NY Tutored students one-on-one in Algebra, Geometry, Honors Geometry, Algebra II/Trigonometry, Precalculus, Honors Precalculus, and Computer Science. Mathematics Advisor Empire Edge September 2013  –  June 2014  (10 months) New York, NY Tutored students one-on-one in Algebra, Geometry, Honors Geometry, Algebra II/Trigonometry, Precalculus, Honors Precalculus, and Computer Science. High School Math Teacher The Bronx High School of Science September 2009  –  August 2013  (4 years) Bronx, NY · Planned and executed unit and lesson plans for Geometry, Precalculus, and Computer Science Projects. \n· Integrated real world problems and applications based on student career interests to demonstrate the relevance and importance of mathematics. \n· Created hands on activities to promote an interactive, discovery based approach to learning. \n· Utilized discussion based lessons in order to promote a deeper understanding of the topics. \n· Incorporated various technologies into the classroom, including Geometer’s Sketchpad, Smartboards, and graphing calculators. \n· Collaborated with colleagues to establish best practices and curriculum maps that integrated the Common Core Standards. \n· Mentored and advised the all female FIRST FRC Robotics Team, the FeMaidens. High School Math Teacher The Bronx High School of Science September 2009  –  August 2013  (4 years) Bronx, NY · Planned and executed unit and lesson plans for Geometry, Precalculus, and Computer Science Projects. \n· Integrated real world problems and applications based on student career interests to demonstrate the relevance and importance of mathematics. \n· Created hands on activities to promote an interactive, discovery based approach to learning. \n· Utilized discussion based lessons in order to promote a deeper understanding of the topics. \n· Incorporated various technologies into the classroom, including Geometer’s Sketchpad, Smartboards, and graphing calculators. \n· Collaborated with colleagues to establish best practices and curriculum maps that integrated the Common Core Standards. \n· Mentored and advised the all female FIRST FRC Robotics Team, the FeMaidens. Hardware Verification Engineer IBM June 2002  –  May 2008  (6 years) Poughkeepsie, NY Hardware Verification Engineer IBM June 2002  –  May 2008  (6 years) Poughkeepsie, NY Skills C++ Linux Unix Java C Skills  C++ Linux Unix Java C C++ Linux Unix Java C C++ Linux Unix Java C Education Bard College MAT,  Mathematics 2008  – 2009 Syracuse University Bachelor's Degree,  Electrical and Electronics Engineering 1998  – 2002 Bard College MAT,  Mathematics 2008  – 2009 Bard College MAT,  Mathematics 2008  – 2009 Bard College MAT,  Mathematics 2008  – 2009 Syracuse University Bachelor's Degree,  Electrical and Electronics Engineering 1998  – 2002 Syracuse University Bachelor's Degree,  Electrical and Electronics Engineering 1998  – 2002 Syracuse University Bachelor's Degree,  Electrical and Electronics Engineering 1998  – 2002 ", "Experience Hardware Verification Engineer IBM June 2013  – Present (2 years 3 months) Rochester Mi Associate Programmer South Dakota State University May 2011  –  May 2013  (2 years 1 month) Brookings, SD Student Tech Fellow South Dakota State University September 2009  –  May 2011  (1 year 9 months) Hardware Verification Engineer IBM June 2013  – Present (2 years 3 months) Rochester Mi Hardware Verification Engineer IBM June 2013  – Present (2 years 3 months) Rochester Mi Associate Programmer South Dakota State University May 2011  –  May 2013  (2 years 1 month) Brookings, SD Associate Programmer South Dakota State University May 2011  –  May 2013  (2 years 1 month) Brookings, SD Student Tech Fellow South Dakota State University September 2009  –  May 2011  (1 year 9 months) Student Tech Fellow South Dakota State University September 2009  –  May 2011  (1 year 9 months) Education South Dakota State University Bachelor's Degree,  Electrical Engineering 2009  – 2013 South Dakota State University Bachelor's Degree,  Electrical Engineering 2009  – 2013 South Dakota State University Bachelor's Degree,  Electrical Engineering 2009  – 2013 South Dakota State University Bachelor's Degree,  Electrical Engineering 2009  – 2013 ", "Skills SoC ASIC Embedded Systems Bluetooth System Architecture Bluetooth Low Energy Verilog Debugging Semiconductors IC VLSI Wireless RTL design FPGA Hardware Architecture Processors Embedded Software ARM Integrated Circuit... See 4+     See less Skills  SoC ASIC Embedded Systems Bluetooth System Architecture Bluetooth Low Energy Verilog Debugging Semiconductors IC VLSI Wireless RTL design FPGA Hardware Architecture Processors Embedded Software ARM Integrated Circuit... See 4+     See less SoC ASIC Embedded Systems Bluetooth System Architecture Bluetooth Low Energy Verilog Debugging Semiconductors IC VLSI Wireless RTL design FPGA Hardware Architecture Processors Embedded Software ARM Integrated Circuit... See 4+     See less SoC ASIC Embedded Systems Bluetooth System Architecture Bluetooth Low Energy Verilog Debugging Semiconductors IC VLSI Wireless RTL design FPGA Hardware Architecture Processors Embedded Software ARM Integrated Circuit... See 4+     See less ", "Summary A BS/MS student at The Ohio State University interested in Internship/Co-Op or Full Time opportunities in Software and Hardware areas. Have completed rigorous undergraduate work in Electrical and Computer Engineering, and currently enrolled in M.Sc program at OSU. Have multiple engineering internship and work experience. Strong technical and communication skills. I am passionate and well versed about engineering, technology, history, art, science, sports and a lot of general topics. I am always interested in finding an exciting opportunity where I am constantly challenged and solving challenging problems. I am always passionate about learning new things and meeting new people. I am interested in volunteerism, helping others, and forming new connections. Summary A BS/MS student at The Ohio State University interested in Internship/Co-Op or Full Time opportunities in Software and Hardware areas. Have completed rigorous undergraduate work in Electrical and Computer Engineering, and currently enrolled in M.Sc program at OSU. Have multiple engineering internship and work experience. Strong technical and communication skills. I am passionate and well versed about engineering, technology, history, art, science, sports and a lot of general topics. I am always interested in finding an exciting opportunity where I am constantly challenged and solving challenging problems. I am always passionate about learning new things and meeting new people. I am interested in volunteerism, helping others, and forming new connections. A BS/MS student at The Ohio State University interested in Internship/Co-Op or Full Time opportunities in Software and Hardware areas. Have completed rigorous undergraduate work in Electrical and Computer Engineering, and currently enrolled in M.Sc program at OSU. Have multiple engineering internship and work experience. Strong technical and communication skills. I am passionate and well versed about engineering, technology, history, art, science, sports and a lot of general topics. I am always interested in finding an exciting opportunity where I am constantly challenged and solving challenging problems. I am always passionate about learning new things and meeting new people. I am interested in volunteerism, helping others, and forming new connections. A BS/MS student at The Ohio State University interested in Internship/Co-Op or Full Time opportunities in Software and Hardware areas. Have completed rigorous undergraduate work in Electrical and Computer Engineering, and currently enrolled in M.Sc program at OSU. Have multiple engineering internship and work experience. Strong technical and communication skills. I am passionate and well versed about engineering, technology, history, art, science, sports and a lot of general topics. I am always interested in finding an exciting opportunity where I am constantly challenged and solving challenging problems. I am always passionate about learning new things and meeting new people. I am interested in volunteerism, helping others, and forming new connections. Experience Hardware Verification Engineer IBM July 2015  – Present (2 months) Greater New York City Area Student Research Assistant Ohio State Center for Automotive Research January 2015  –  May 2015  (5 months) Columbus, Ohio Area Intern, Product Certification Engineer Rockwell Automation May 2013  –  May 2015  (2 years 1 month) Cleveland/Akron, Ohio Area Residential Advisor The Ohio State University September 2011  –  May 2014  (2 years 9 months) Columbus, Ohio Area Lab Monitor (Ohio State Art Department) The Ohio State University January 2013  –  September 2013  (9 months) Columbus, Ohio Area Intern, Electrical Engineering Parker Hannifin June 2012  –  August 2012  (3 months) Cleveland/Akron, Ohio Area AmeriCorps Volunteer The Ohio State University October 2010  –  February 2012  (1 year 5 months) Columbus, Ohio Area Intern, Electrical Engineering Parker Hannifin June 2011  –  September 2011  (4 months) Cleveland/Akron, Ohio Area Hardware Verification Engineer IBM July 2015  – Present (2 months) Greater New York City Area Hardware Verification Engineer IBM July 2015  – Present (2 months) Greater New York City Area Student Research Assistant Ohio State Center for Automotive Research January 2015  –  May 2015  (5 months) Columbus, Ohio Area Student Research Assistant Ohio State Center for Automotive Research January 2015  –  May 2015  (5 months) Columbus, Ohio Area Intern, Product Certification Engineer Rockwell Automation May 2013  –  May 2015  (2 years 1 month) Cleveland/Akron, Ohio Area Intern, Product Certification Engineer Rockwell Automation May 2013  –  May 2015  (2 years 1 month) Cleveland/Akron, Ohio Area Residential Advisor The Ohio State University September 2011  –  May 2014  (2 years 9 months) Columbus, Ohio Area Residential Advisor The Ohio State University September 2011  –  May 2014  (2 years 9 months) Columbus, Ohio Area Lab Monitor (Ohio State Art Department) The Ohio State University January 2013  –  September 2013  (9 months) Columbus, Ohio Area Lab Monitor (Ohio State Art Department) The Ohio State University January 2013  –  September 2013  (9 months) Columbus, Ohio Area Intern, Electrical Engineering Parker Hannifin June 2012  –  August 2012  (3 months) Cleveland/Akron, Ohio Area Intern, Electrical Engineering Parker Hannifin June 2012  –  August 2012  (3 months) Cleveland/Akron, Ohio Area AmeriCorps Volunteer The Ohio State University October 2010  –  February 2012  (1 year 5 months) Columbus, Ohio Area AmeriCorps Volunteer The Ohio State University October 2010  –  February 2012  (1 year 5 months) Columbus, Ohio Area Intern, Electrical Engineering Parker Hannifin June 2011  –  September 2011  (4 months) Cleveland/Akron, Ohio Area Intern, Electrical Engineering Parker Hannifin June 2011  –  September 2011  (4 months) Cleveland/Akron, Ohio Area Languages English Native or bilingual proficiency Amharic Native or bilingual proficiency English Native or bilingual proficiency Amharic Native or bilingual proficiency English Native or bilingual proficiency Amharic Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Matlab Microsoft Excel Microsoft Office Programming PowerPoint C++ C Microsoft Word Windows Java Social Media VHDL Leadership Assembly Language Research Public Speaking Teamwork Time Management Some C++ Linux See 5+     See less Skills  Matlab Microsoft Excel Microsoft Office Programming PowerPoint C++ C Microsoft Word Windows Java Social Media VHDL Leadership Assembly Language Research Public Speaking Teamwork Time Management Some C++ Linux See 5+     See less Matlab Microsoft Excel Microsoft Office Programming PowerPoint C++ C Microsoft Word Windows Java Social Media VHDL Leadership Assembly Language Research Public Speaking Teamwork Time Management Some C++ Linux See 5+     See less Matlab Microsoft Excel Microsoft Office Programming PowerPoint C++ C Microsoft Word Windows Java Social Media VHDL Leadership Assembly Language Research Public Speaking Teamwork Time Management Some C++ Linux See 5+     See less Education The Ohio State University BS/MS,  Electrical & Computer Engineering- CE specialization 2010  – 2015 Activities and Societies:  IEEE Secretary ,  IEEE Treasurer ,  LambdaPsi Honorary ,  NSBE ,  HKN Honorary Cleveland State University Post Secondary 2009  – 2010 The Ohio State University BS/MS,  Electrical & Computer Engineering- CE specialization 2010  – 2015 Activities and Societies:  IEEE Secretary ,  IEEE Treasurer ,  LambdaPsi Honorary ,  NSBE ,  HKN Honorary The Ohio State University BS/MS,  Electrical & Computer Engineering- CE specialization 2010  – 2015 Activities and Societies:  IEEE Secretary ,  IEEE Treasurer ,  LambdaPsi Honorary ,  NSBE ,  HKN Honorary The Ohio State University BS/MS,  Electrical & Computer Engineering- CE specialization 2010  – 2015 Activities and Societies:  IEEE Secretary ,  IEEE Treasurer ,  LambdaPsi Honorary ,  NSBE ,  HKN Honorary Cleveland State University Post Secondary 2009  – 2010 Cleveland State University Post Secondary 2009  – 2010 Cleveland State University Post Secondary 2009  – 2010 ", "Languages Tamil Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency French Elementary proficiency Tamil Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency French Elementary proficiency Tamil Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Solution Architecture Agile Methodologies IT Strategy Integration Software Development Unix Perl AIX Requirements Analysis Storage Testing Enterprise Architecture Cloud Computing Servers System Architecture Oracle SOA Pre-sales Enterprise Software Project Management Hardware Lean Tools Business Strategy Virtualization Business Development ETL Tools Project Planning See 12+     See less Skills  Solution Architecture Agile Methodologies IT Strategy Integration Software Development Unix Perl AIX Requirements Analysis Storage Testing Enterprise Architecture Cloud Computing Servers System Architecture Oracle SOA Pre-sales Enterprise Software Project Management Hardware Lean Tools Business Strategy Virtualization Business Development ETL Tools Project Planning See 12+     See less Solution Architecture Agile Methodologies IT Strategy Integration Software Development Unix Perl AIX Requirements Analysis Storage Testing Enterprise Architecture Cloud Computing Servers System Architecture Oracle SOA Pre-sales Enterprise Software Project Management Hardware Lean Tools Business Strategy Virtualization Business Development ETL Tools Project Planning See 12+     See less Solution Architecture Agile Methodologies IT Strategy Integration Software Development Unix Perl AIX Requirements Analysis Storage Testing Enterprise Architecture Cloud Computing Servers System Architecture Oracle SOA Pre-sales Enterprise Software Project Management Hardware Lean Tools Business Strategy Virtualization Business Development ETL Tools Project Planning See 12+     See less Honors & Awards Public Sector Partner SA of the Quarter Red Hat June 2015 Management Values Award IBM December 2007 Aspiring Asians in Management IBM August 2006 National Woman of Color Rising Star in Technology Women of Color STEM Conference October 2005 Leadership Excellence IBM December 2004 Multicultural Professional Leadership Institute October 2004 Management Perspectives Seminar IBM December 2002 Additional Honors & Awards - Deloitte's Federal Tech Trends (May 2013) \n- Master Certified IT Specialist in Cross Systems (Feb 2010) \n- IBM Academy of Technology Study “Innovator’s Innovator” – (Dec 2008) \n- Patent “Method to Populate Chat Buddies in an Instant Messaging System” (Jul 2008) \n- IBM Management Values Award (Dec 2007) \n- IBM Academy of Technology Study “Joint Innovation in the Client Environment” (Sep 2007) \n- Webcast \"Oracle on Air: PeopleSoft Global Payroll (France) Benchmark on IBM Power6 versus IBM Power5\" (Jun 2007) \n- IBM Aspiring Asians in Management (Aug 2006) \n- Paper \"Reuse in System Level Stimuli Generation\"  \npublished in High Level Design Validation and Test Workshop (Dec 2005) \n- Women of Color Rising Star Award (Oct 2005) \n- IBM Leadership Excellence Award (Dec 2004) \n- IBM Multicultural Professionals Leadership Institute (Oct 2004) \n- Patent \"System for Generation of High Level Coverage of a Computer Design (July 2004) \n- IBM Management Perspectives Seminar (Dec 2002) Public Sector Partner SA of the Quarter Red Hat June 2015 Public Sector Partner SA of the Quarter Red Hat June 2015 Public Sector Partner SA of the Quarter Red Hat June 2015 Management Values Award IBM December 2007 Management Values Award IBM December 2007 Management Values Award IBM December 2007 Aspiring Asians in Management IBM August 2006 Aspiring Asians in Management IBM August 2006 Aspiring Asians in Management IBM August 2006 National Woman of Color Rising Star in Technology Women of Color STEM Conference October 2005 National Woman of Color Rising Star in Technology Women of Color STEM Conference October 2005 National Woman of Color Rising Star in Technology Women of Color STEM Conference October 2005 Leadership Excellence IBM December 2004 Leadership Excellence IBM December 2004 Leadership Excellence IBM December 2004 Multicultural Professional Leadership Institute October 2004 Multicultural Professional Leadership Institute October 2004 Multicultural Professional Leadership Institute October 2004 Management Perspectives Seminar IBM December 2002 Management Perspectives Seminar IBM December 2002 Management Perspectives Seminar IBM December 2002 Additional Honors & Awards - Deloitte's Federal Tech Trends (May 2013) \n- Master Certified IT Specialist in Cross Systems (Feb 2010) \n- IBM Academy of Technology Study “Innovator’s Innovator” – (Dec 2008) \n- Patent “Method to Populate Chat Buddies in an Instant Messaging System” (Jul 2008) \n- IBM Management Values Award (Dec 2007) \n- IBM Academy of Technology Study “Joint Innovation in the Client Environment” (Sep 2007) \n- Webcast \"Oracle on Air: PeopleSoft Global Payroll (France) Benchmark on IBM Power6 versus IBM Power5\" (Jun 2007) \n- IBM Aspiring Asians in Management (Aug 2006) \n- Paper \"Reuse in System Level Stimuli Generation\"  \npublished in High Level Design Validation and Test Workshop (Dec 2005) \n- Women of Color Rising Star Award (Oct 2005) \n- IBM Leadership Excellence Award (Dec 2004) \n- IBM Multicultural Professionals Leadership Institute (Oct 2004) \n- Patent \"System for Generation of High Level Coverage of a Computer Design (July 2004) \n- IBM Management Perspectives Seminar (Dec 2002) Additional Honors & Awards - Deloitte's Federal Tech Trends (May 2013) \n- Master Certified IT Specialist in Cross Systems (Feb 2010) \n- IBM Academy of Technology Study “Innovator’s Innovator” – (Dec 2008) \n- Patent “Method to Populate Chat Buddies in an Instant Messaging System” (Jul 2008) \n- IBM Management Values Award (Dec 2007) \n- IBM Academy of Technology Study “Joint Innovation in the Client Environment” (Sep 2007) \n- Webcast \"Oracle on Air: PeopleSoft Global Payroll (France) Benchmark on IBM Power6 versus IBM Power5\" (Jun 2007) \n- IBM Aspiring Asians in Management (Aug 2006) \n- Paper \"Reuse in System Level Stimuli Generation\"  \npublished in High Level Design Validation and Test Workshop (Dec 2005) \n- Women of Color Rising Star Award (Oct 2005) \n- IBM Leadership Excellence Award (Dec 2004) \n- IBM Multicultural Professionals Leadership Institute (Oct 2004) \n- Patent \"System for Generation of High Level Coverage of a Computer Design (July 2004) \n- IBM Management Perspectives Seminar (Dec 2002) Additional Honors & Awards - Deloitte's Federal Tech Trends (May 2013) \n- Master Certified IT Specialist in Cross Systems (Feb 2010) \n- IBM Academy of Technology Study “Innovator’s Innovator” – (Dec 2008) \n- Patent “Method to Populate Chat Buddies in an Instant Messaging System” (Jul 2008) \n- IBM Management Values Award (Dec 2007) \n- IBM Academy of Technology Study “Joint Innovation in the Client Environment” (Sep 2007) \n- Webcast \"Oracle on Air: PeopleSoft Global Payroll (France) Benchmark on IBM Power6 versus IBM Power5\" (Jun 2007) \n- IBM Aspiring Asians in Management (Aug 2006) \n- Paper \"Reuse in System Level Stimuli Generation\"  \npublished in High Level Design Validation and Test Workshop (Dec 2005) \n- Women of Color Rising Star Award (Oct 2005) \n- IBM Leadership Excellence Award (Dec 2004) \n- IBM Multicultural Professionals Leadership Institute (Oct 2004) \n- Patent \"System for Generation of High Level Coverage of a Computer Design (July 2004) \n- IBM Management Perspectives Seminar (Dec 2002) ", "Experience Lead Software Engineer HARMAN International May 2014  – Present (1 year 4 months) Farmington Hills, MI Software Engineering Supervisor Alpine Electronics of America, Inc. October 2011  –  May 2014  (2 years 8 months) Farmington Hills, MI 48331 Hardware Verification Engineer IBM 1998  –  2000  (2 years) Lead Software Engineer HARMAN International May 2014  – Present (1 year 4 months) Farmington Hills, MI Lead Software Engineer HARMAN International May 2014  – Present (1 year 4 months) Farmington Hills, MI Software Engineering Supervisor Alpine Electronics of America, Inc. October 2011  –  May 2014  (2 years 8 months) Farmington Hills, MI 48331 Software Engineering Supervisor Alpine Electronics of America, Inc. October 2011  –  May 2014  (2 years 8 months) Farmington Hills, MI 48331 Hardware Verification Engineer IBM 1998  –  2000  (2 years) Hardware Verification Engineer IBM 1998  –  2000  (2 years) Skills Engineering Management Systems Engineering Vector CANalyzer Testing Automotive Program Management Vehicles Embedded Systems Product Development Electrical Engineering C++ Manufacturing Electronics Skills  Engineering Management Systems Engineering Vector CANalyzer Testing Automotive Program Management Vehicles Embedded Systems Product Development Electrical Engineering C++ Manufacturing Electronics Engineering Management Systems Engineering Vector CANalyzer Testing Automotive Program Management Vehicles Embedded Systems Product Development Electrical Engineering C++ Manufacturing Electronics Engineering Management Systems Engineering Vector CANalyzer Testing Automotive Program Management Vehicles Embedded Systems Product Development Electrical Engineering C++ Manufacturing Electronics Education Michigan State University Electrical Engineering 1993  – 1998 Michigan State University Electrical Engineering 1993  – 1998 Michigan State University Electrical Engineering 1993  – 1998 Michigan State University Electrical Engineering 1993  – 1998 ", "Experience Hardware Verification Engineer IBM Hardware Verification Engineer IBM Hardware Verification Engineer IBM Education New York University - Polytechnic School of Engineering 1991  – 1998 New York University - Polytechnic School of Engineering 1991  – 1998 New York University - Polytechnic School of Engineering 1991  – 1998 New York University - Polytechnic School of Engineering 1991  – 1998 ", "Experience Hardware Verification Engineer IBM India Private Limited May 2011  – Present (4 years 4 months) Bengaluru Area, India Currently working on verification of a PowerPC lite processor engine using Genesys Pro tool and in-house Fusion/C++ verification methodology. Scope involves verifying processor ISA, exception model, and processor debugging techniques, environment development, test generation, implementing checkers and regressions. \nWorked on verification of I2C bus controller logic using Fusion and graph based Trek methodology. \nFamiliar with parallel on chip bus protocols, arbiter logic, serial protocols like I2C. \nBasic working experience of Shell scripting. \nResponsible for test plan development, coverage definition, execution regression testing and tracking. \nSupport higher level verification activities and chip lab bring up when required. Hardware Verification Engineer IBM India Private Limited May 2011  – Present (4 years 4 months) Bengaluru Area, India Currently working on verification of a PowerPC lite processor engine using Genesys Pro tool and in-house Fusion/C++ verification methodology. Scope involves verifying processor ISA, exception model, and processor debugging techniques, environment development, test generation, implementing checkers and regressions. \nWorked on verification of I2C bus controller logic using Fusion and graph based Trek methodology. \nFamiliar with parallel on chip bus protocols, arbiter logic, serial protocols like I2C. \nBasic working experience of Shell scripting. \nResponsible for test plan development, coverage definition, execution regression testing and tracking. \nSupport higher level verification activities and chip lab bring up when required. Hardware Verification Engineer IBM India Private Limited May 2011  – Present (4 years 4 months) Bengaluru Area, India Currently working on verification of a PowerPC lite processor engine using Genesys Pro tool and in-house Fusion/C++ verification methodology. Scope involves verifying processor ISA, exception model, and processor debugging techniques, environment development, test generation, implementing checkers and regressions. \nWorked on verification of I2C bus controller logic using Fusion and graph based Trek methodology. \nFamiliar with parallel on chip bus protocols, arbiter logic, serial protocols like I2C. \nBasic working experience of Shell scripting. \nResponsible for test plan development, coverage definition, execution regression testing and tracking. \nSupport higher level verification activities and chip lab bring up when required. Skills Functional Verification C++ Processors PowerPC ISA I2C OOP Debugging Test Planning Test Cases Regression Testing SystemVerilog PCIe VHDL AMBA AHB Cache Coherency See 1+     See less Skills  Functional Verification C++ Processors PowerPC ISA I2C OOP Debugging Test Planning Test Cases Regression Testing SystemVerilog PCIe VHDL AMBA AHB Cache Coherency See 1+     See less Functional Verification C++ Processors PowerPC ISA I2C OOP Debugging Test Planning Test Cases Regression Testing SystemVerilog PCIe VHDL AMBA AHB Cache Coherency See 1+     See less Functional Verification C++ Processors PowerPC ISA I2C OOP Debugging Test Planning Test Cases Regression Testing SystemVerilog PCIe VHDL AMBA AHB Cache Coherency See 1+     See less Education Centre for Development of Advanced Computing Master of Technology (M.Tech.),  VLSI and Embedded Systems , Distinction 2009  – 2011 Successfully completed a 1 year live verification project with Hardware Design group of C-DAC Thiruvananthapuram. A generation 1 3 layer PCIe controller logic was verified using OVM methodology. \n \nScope of the project included test plan development, verification environment development, writing checkers, test generation, debugging and coverage analysis. \n \nUsed QuestaSim for simulations. National Institute of Technology Calicut Bachelor of Technology (B.Tech.),  Electrical and Electronics Engineering , Distinction 2004  – 2008 Centre for Development of Advanced Computing Master of Technology (M.Tech.),  VLSI and Embedded Systems , Distinction 2009  – 2011 Successfully completed a 1 year live verification project with Hardware Design group of C-DAC Thiruvananthapuram. A generation 1 3 layer PCIe controller logic was verified using OVM methodology. \n \nScope of the project included test plan development, verification environment development, writing checkers, test generation, debugging and coverage analysis. \n \nUsed QuestaSim for simulations. Centre for Development of Advanced Computing Master of Technology (M.Tech.),  VLSI and Embedded Systems , Distinction 2009  – 2011 Successfully completed a 1 year live verification project with Hardware Design group of C-DAC Thiruvananthapuram. A generation 1 3 layer PCIe controller logic was verified using OVM methodology. \n \nScope of the project included test plan development, verification environment development, writing checkers, test generation, debugging and coverage analysis. \n \nUsed QuestaSim for simulations. Centre for Development of Advanced Computing Master of Technology (M.Tech.),  VLSI and Embedded Systems , Distinction 2009  – 2011 Successfully completed a 1 year live verification project with Hardware Design group of C-DAC Thiruvananthapuram. A generation 1 3 layer PCIe controller logic was verified using OVM methodology. \n \nScope of the project included test plan development, verification environment development, writing checkers, test generation, debugging and coverage analysis. \n \nUsed QuestaSim for simulations. National Institute of Technology Calicut Bachelor of Technology (B.Tech.),  Electrical and Electronics Engineering , Distinction 2004  – 2008 National Institute of Technology Calicut Bachelor of Technology (B.Tech.),  Electrical and Electronics Engineering , Distinction 2004  – 2008 National Institute of Technology Calicut Bachelor of Technology (B.Tech.),  Electrical and Electronics Engineering , Distinction 2004  – 2008 ", "Experience Programmer LKCS October 2007  – Present (7 years 11 months) Technician HR Imaging Partners Inc. 2003  –  October 2007  (4 years) Hardware Verification Engineer IBM 2001  –  2002  (1 year) Programmer LKCS October 2007  – Present (7 years 11 months) Programmer LKCS October 2007  – Present (7 years 11 months) Technician HR Imaging Partners Inc. 2003  –  October 2007  (4 years) Technician HR Imaging Partners Inc. 2003  –  October 2007  (4 years) Hardware Verification Engineer IBM 2001  –  2002  (1 year) Hardware Verification Engineer IBM 2001  –  2002  (1 year) Education University of Illinois at Urbana-Champaign B.S.,  Computer Engineering 1997  – 2001 University of Illinois at Urbana-Champaign B.S.,  Computer Engineering 1997  – 2001 University of Illinois at Urbana-Champaign B.S.,  Computer Engineering 1997  – 2001 University of Illinois at Urbana-Champaign B.S.,  Computer Engineering 1997  – 2001 "]}