{"position": "Human Resource Manager", "company": "Intel Corporation", "profiles": ["Summary An Intel Corporation leader with 20+ years of service, I love building things. Teams. Factories. Organizations. People. I believe in continual improvement, not only of ourselves, but of the people around us, the work that we do and the environment in which we do it. I've lived and worked in 3 countries and explored countless others and believe in the fundamental goodness of people and our ability as a human race to overcome any obstacle or challenge. Summary An Intel Corporation leader with 20+ years of service, I love building things. Teams. Factories. Organizations. People. I believe in continual improvement, not only of ourselves, but of the people around us, the work that we do and the environment in which we do it. I've lived and worked in 3 countries and explored countless others and believe in the fundamental goodness of people and our ability as a human race to overcome any obstacle or challenge. An Intel Corporation leader with 20+ years of service, I love building things. Teams. Factories. Organizations. People. I believe in continual improvement, not only of ourselves, but of the people around us, the work that we do and the environment in which we do it. I've lived and worked in 3 countries and explored countless others and believe in the fundamental goodness of people and our ability as a human race to overcome any obstacle or challenge. An Intel Corporation leader with 20+ years of service, I love building things. Teams. Factories. Organizations. People. I believe in continual improvement, not only of ourselves, but of the people around us, the work that we do and the environment in which we do it. I've lived and worked in 3 countries and explored countless others and believe in the fundamental goodness of people and our ability as a human race to overcome any obstacle or challenge. Experience Human Resource Manager Intel Corporation March 2012  – Present (3 years 6 months) Hillsboro, OR Back to headquarters! I now manage an HR Business Partner team based in Oregon. We focus on Organizational Assessment, Complex Change and Transition Management, Leader Development and Leadership Pipeline Development and Strategic Workforce Planning. We work closely with other Business HR teams focusing on Internal Consulting and Employee Engagement, and often work on teams with Intel's Talent Organization, Compensation and Development Organization, and the Executive Development Team. Director, Vietnam Human Resources, Intel Corporation April 2009  –  March 2012  (3 years) Ho Chi Minh City, Vietnam Reporting to Regional Managing Director of Human Resources, Responsible for all aspects of Human Resources for Intel's operations in Vietnam including a greenfield factory startup of the company's largest assembly and test facility on the planet. Director, Chengdu, PRC Human Resources Intel Corporation October 2007  –  March 2009  (1 year 6 months) Chengdu, Sichuan, China Reporting to PRC Human Resources Director, responsible for all aspects of Human Resources at Intel's Chengdu site including the startup of a second factory at the site and doubling the site headcount in 15 months. Also led Sichuan Earthquake Recovery following the 8.0 magnitude earthquake that occured ~50 miles from Intel and received Intel's highest level of internal recognition for the work. Human Resources Manager, Research and Development Intel Corporation January 2004  –  October 2007  (3 years 10 months) Reporting to the Manufacturing and Technology Development HR Manager, responsible for all aspects of Human Resource Management for an Arizona, Malaysia and China based R&D group. Senior Recruiter Intel Corporation 2000  –  2004  (4 years) Chandler, AZ Campus Recruiting Manager/ Business Recruiting Consultant- search, screening & selection of top University talent at Tier 1 and Tier 2 MBA schools throughout the US, as well as search, screening & selection of top PhD talent from leading research universities. Operations Manager Intel Corporation 1999  –  2000  (1 year) Chandler, AZ I supervised teams of 15-30 Manufacturing and Test Technicians in a 24*7 wafer fabrication environment including Test, Surface Mount and Lithography. I was responsible for all aspects of safety, quality and operations excellence for my team and functional area Shift Coordinator/Shift Manager Intel Corporation 1994  –  1998  (4 years) Chandler, AZ I was responsible for managing teams of 20-60 Manufacturing Technicians in a 24x7 Electronics Assembly and Test Factory Environment including the Safety, Quality and Operational Excellence of my team and functional area. Manufacturing Technician Intel Corporation 1992  –  1994  (2 years) Chandler, AZ Responsible for the safe, high-quality assembly of Intel Products on the factory floor. Human Resource Manager Intel Corporation March 2012  – Present (3 years 6 months) Hillsboro, OR Back to headquarters! I now manage an HR Business Partner team based in Oregon. We focus on Organizational Assessment, Complex Change and Transition Management, Leader Development and Leadership Pipeline Development and Strategic Workforce Planning. We work closely with other Business HR teams focusing on Internal Consulting and Employee Engagement, and often work on teams with Intel's Talent Organization, Compensation and Development Organization, and the Executive Development Team. Human Resource Manager Intel Corporation March 2012  – Present (3 years 6 months) Hillsboro, OR Back to headquarters! I now manage an HR Business Partner team based in Oregon. We focus on Organizational Assessment, Complex Change and Transition Management, Leader Development and Leadership Pipeline Development and Strategic Workforce Planning. We work closely with other Business HR teams focusing on Internal Consulting and Employee Engagement, and often work on teams with Intel's Talent Organization, Compensation and Development Organization, and the Executive Development Team. Director, Vietnam Human Resources, Intel Corporation April 2009  –  March 2012  (3 years) Ho Chi Minh City, Vietnam Reporting to Regional Managing Director of Human Resources, Responsible for all aspects of Human Resources for Intel's operations in Vietnam including a greenfield factory startup of the company's largest assembly and test facility on the planet. Director, Vietnam Human Resources, Intel Corporation April 2009  –  March 2012  (3 years) Ho Chi Minh City, Vietnam Reporting to Regional Managing Director of Human Resources, Responsible for all aspects of Human Resources for Intel's operations in Vietnam including a greenfield factory startup of the company's largest assembly and test facility on the planet. Director, Chengdu, PRC Human Resources Intel Corporation October 2007  –  March 2009  (1 year 6 months) Chengdu, Sichuan, China Reporting to PRC Human Resources Director, responsible for all aspects of Human Resources at Intel's Chengdu site including the startup of a second factory at the site and doubling the site headcount in 15 months. Also led Sichuan Earthquake Recovery following the 8.0 magnitude earthquake that occured ~50 miles from Intel and received Intel's highest level of internal recognition for the work. Director, Chengdu, PRC Human Resources Intel Corporation October 2007  –  March 2009  (1 year 6 months) Chengdu, Sichuan, China Reporting to PRC Human Resources Director, responsible for all aspects of Human Resources at Intel's Chengdu site including the startup of a second factory at the site and doubling the site headcount in 15 months. Also led Sichuan Earthquake Recovery following the 8.0 magnitude earthquake that occured ~50 miles from Intel and received Intel's highest level of internal recognition for the work. Human Resources Manager, Research and Development Intel Corporation January 2004  –  October 2007  (3 years 10 months) Reporting to the Manufacturing and Technology Development HR Manager, responsible for all aspects of Human Resource Management for an Arizona, Malaysia and China based R&D group. Human Resources Manager, Research and Development Intel Corporation January 2004  –  October 2007  (3 years 10 months) Reporting to the Manufacturing and Technology Development HR Manager, responsible for all aspects of Human Resource Management for an Arizona, Malaysia and China based R&D group. Senior Recruiter Intel Corporation 2000  –  2004  (4 years) Chandler, AZ Campus Recruiting Manager/ Business Recruiting Consultant- search, screening & selection of top University talent at Tier 1 and Tier 2 MBA schools throughout the US, as well as search, screening & selection of top PhD talent from leading research universities. Senior Recruiter Intel Corporation 2000  –  2004  (4 years) Chandler, AZ Campus Recruiting Manager/ Business Recruiting Consultant- search, screening & selection of top University talent at Tier 1 and Tier 2 MBA schools throughout the US, as well as search, screening & selection of top PhD talent from leading research universities. Operations Manager Intel Corporation 1999  –  2000  (1 year) Chandler, AZ I supervised teams of 15-30 Manufacturing and Test Technicians in a 24*7 wafer fabrication environment including Test, Surface Mount and Lithography. I was responsible for all aspects of safety, quality and operations excellence for my team and functional area Operations Manager Intel Corporation 1999  –  2000  (1 year) Chandler, AZ I supervised teams of 15-30 Manufacturing and Test Technicians in a 24*7 wafer fabrication environment including Test, Surface Mount and Lithography. I was responsible for all aspects of safety, quality and operations excellence for my team and functional area Shift Coordinator/Shift Manager Intel Corporation 1994  –  1998  (4 years) Chandler, AZ I was responsible for managing teams of 20-60 Manufacturing Technicians in a 24x7 Electronics Assembly and Test Factory Environment including the Safety, Quality and Operational Excellence of my team and functional area. Shift Coordinator/Shift Manager Intel Corporation 1994  –  1998  (4 years) Chandler, AZ I was responsible for managing teams of 20-60 Manufacturing Technicians in a 24x7 Electronics Assembly and Test Factory Environment including the Safety, Quality and Operational Excellence of my team and functional area. Manufacturing Technician Intel Corporation 1992  –  1994  (2 years) Chandler, AZ Responsible for the safe, high-quality assembly of Intel Products on the factory floor. Manufacturing Technician Intel Corporation 1992  –  1994  (2 years) Chandler, AZ Responsible for the safe, high-quality assembly of Intel Products on the factory floor. Languages Spanish Limited working proficiency Chinese Elementary proficiency Spanish Limited working proficiency Chinese Elementary proficiency Spanish Limited working proficiency Chinese Elementary proficiency Limited working proficiency Elementary proficiency Skills Workforce Planning Talent Management Employee Relations Performance Management Intel Employee Engagement Change Management Coaching Manufacturing Employee Recognition Employment Law Deferred Compensation HR Consulting Management Consulting Cultural Diversity HRIS Labor Relations College Recruiting Onboarding Talent Acquisition Partnering Public Speaking Writing Terminations Investigation Performance Appraisal Safety Management Corporate Culture Diversity Strategy Leadership Business Strategy Global Management Organizational... Organizational... Leadership Development Compensation & Benefit Workforce Development Management Workforce Management Operations Management Employee Management Employment Contracts Global Operations Global Mobility Greater China China Manufacturing Human Resources Employee Benefits Training Facilitation Hiring See 35+     See less Skills  Workforce Planning Talent Management Employee Relations Performance Management Intel Employee Engagement Change Management Coaching Manufacturing Employee Recognition Employment Law Deferred Compensation HR Consulting Management Consulting Cultural Diversity HRIS Labor Relations College Recruiting Onboarding Talent Acquisition Partnering Public Speaking Writing Terminations Investigation Performance Appraisal Safety Management Corporate Culture Diversity Strategy Leadership Business Strategy Global Management Organizational... Organizational... Leadership Development Compensation & Benefit Workforce Development Management Workforce Management Operations Management Employee Management Employment Contracts Global Operations Global Mobility Greater China China Manufacturing Human Resources Employee Benefits Training Facilitation Hiring See 35+     See less Workforce Planning Talent Management Employee Relations Performance Management Intel Employee Engagement Change Management Coaching Manufacturing Employee Recognition Employment Law Deferred Compensation HR Consulting Management Consulting Cultural Diversity HRIS Labor Relations College Recruiting Onboarding Talent Acquisition Partnering Public Speaking Writing Terminations Investigation Performance Appraisal Safety Management Corporate Culture Diversity Strategy Leadership Business Strategy Global Management Organizational... Organizational... Leadership Development Compensation & Benefit Workforce Development Management Workforce Management Operations Management Employee Management Employment Contracts Global Operations Global Mobility Greater China China Manufacturing Human Resources Employee Benefits Training Facilitation Hiring See 35+     See less Workforce Planning Talent Management Employee Relations Performance Management Intel Employee Engagement Change Management Coaching Manufacturing Employee Recognition Employment Law Deferred Compensation HR Consulting Management Consulting Cultural Diversity HRIS Labor Relations College Recruiting Onboarding Talent Acquisition Partnering Public Speaking Writing Terminations Investigation Performance Appraisal Safety Management Corporate Culture Diversity Strategy Leadership Business Strategy Global Management Organizational... Organizational... Leadership Development Compensation & Benefit Workforce Development Management Workforce Management Operations Management Employee Management Employment Contracts Global Operations Global Mobility Greater China China Manufacturing Human Resources Employee Benefits Training Facilitation Hiring See 35+     See less Education University of Phoenix Master of Organizational Management,  HR , Management, Business 1998  – 1999 Organizational Managent. A blend of Organizational Development/HR and traditional MBA University of Phoenix Master of Organizational Management,  HR , Management, Business 1998  – 1999 Organizational Managent. A blend of Organizational Development/HR and traditional MBA University of Phoenix Master of Organizational Management,  HR , Management, Business 1998  – 1999 Organizational Managent. A blend of Organizational Development/HR and traditional MBA University of Phoenix Master of Organizational Management,  HR , Management, Business 1998  – 1999 Organizational Managent. A blend of Organizational Development/HR and traditional MBA "]}