{"position": "Information Technology Manager", "company": "Intel Corporation", "profiles": ["Experience Information Technology Manager Intel Corporation October 1997  – Present (17 years 11 months) Costa Rica Information Technology Manager Intel Corporation October 1997  – Present (17 years 11 months) Costa Rica Information Technology Manager Intel Corporation October 1997  – Present (17 years 11 months) Costa Rica Skills Skills     ", "Experience Manufacturing Information Technology Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Manufacturing Information Technology Manager Intel Corporation June 2013  –  June 2015  (2 years 1 month) Albuquerque, New Mexico Area MIS Group Leader Intel February 2000  –  June 2013  (13 years 5 months) Albuquerque, New Mexico Area Manufacturing Information Technology Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Manufacturing Information Technology Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Manufacturing Information Technology Manager Intel Corporation June 2013  –  June 2015  (2 years 1 month) Albuquerque, New Mexico Area Manufacturing Information Technology Manager Intel Corporation June 2013  –  June 2015  (2 years 1 month) Albuquerque, New Mexico Area MIS Group Leader Intel February 2000  –  June 2013  (13 years 5 months) Albuquerque, New Mexico Area MIS Group Leader Intel February 2000  –  June 2013  (13 years 5 months) Albuquerque, New Mexico Area Skills 6 Leadership 5 Management 4 Program Management 3 Cross-functional Team... 2 Product Management 0 C++ 0 C 0 Product Development 0 Microsoft Excel Skills  6 Leadership 5 Management 4 Program Management 3 Cross-functional Team... 2 Product Management 0 C++ 0 C 0 Product Development 0 Microsoft Excel 6 Leadership 5 Management 4 Program Management 3 Cross-functional Team... 2 Product Management 0 C++ 0 C 0 Product Development 0 Microsoft Excel 6 Leadership 5 Management 4 Program Management 3 Cross-functional Team... 2 Product Management 0 C++ 0 C 0 Product Development 0 Microsoft Excel                   Education The University of New Mexico - Robert O. Anderson School of Management Management Information Systems and Services 1985  – 1991 The University of New Mexico - Robert O. Anderson School of Management Management Information Systems and Services 1985  – 1991 The University of New Mexico - Robert O. Anderson School of Management Management Information Systems and Services 1985  – 1991 The University of New Mexico - Robert O. Anderson School of Management Management Information Systems and Services 1985  – 1991 ", "Experience Information Technology Manager Intel Corporation January 2009  – Present (6 years 8 months) Systems Analyst Intel Corporation October 1996  –  December 2008  (12 years 3 months) Information Technology Manager Intel Corporation January 2009  – Present (6 years 8 months) Information Technology Manager Intel Corporation January 2009  – Present (6 years 8 months) Systems Analyst Intel Corporation October 1996  –  December 2008  (12 years 3 months) Systems Analyst Intel Corporation October 1996  –  December 2008  (12 years 3 months) Skills 2 Intel 2 Linux 2 Perl 1 Semiconductors 1 Software Project... 1 Software Development 1 Vendor Management Skills  2 Intel 2 Linux 2 Perl 1 Semiconductors 1 Software Project... 1 Software Development 1 Vendor Management 2 Intel 2 Linux 2 Perl 1 Semiconductors 1 Software Project... 1 Software Development 1 Vendor Management 2 Intel 2 Linux 2 Perl 1 Semiconductors 1 Software Project... 1 Software Development 1 Vendor Management               Education Universiti Utara Malaysia Master of Business Administration (M.B.A.),  Logistics ,  Materials ,  and Supply Chain Management 2008  – 2011 Coventry University Bachelor of Science (B.Sc.),  Computer Science 1995  – 1996 Universiti Utara Malaysia Master of Business Administration (M.B.A.),  Logistics ,  Materials ,  and Supply Chain Management 2008  – 2011 Universiti Utara Malaysia Master of Business Administration (M.B.A.),  Logistics ,  Materials ,  and Supply Chain Management 2008  – 2011 Universiti Utara Malaysia Master of Business Administration (M.B.A.),  Logistics ,  Materials ,  and Supply Chain Management 2008  – 2011 Coventry University Bachelor of Science (B.Sc.),  Computer Science 1995  – 1996 Coventry University Bachelor of Science (B.Sc.),  Computer Science 1995  – 1996 Coventry University Bachelor of Science (B.Sc.),  Computer Science 1995  – 1996 ", "Summary Senior IT professional with over 15 years of experience in full software life cycle development with emphasis on Scrum/Project management, Analysis, Design, data modeling, programming and support of business applications and decision support systems in Internet and client server technologies. Summary Senior IT professional with over 15 years of experience in full software life cycle development with emphasis on Scrum/Project management, Analysis, Design, data modeling, programming and support of business applications and decision support systems in Internet and client server technologies. Senior IT professional with over 15 years of experience in full software life cycle development with emphasis on Scrum/Project management, Analysis, Design, data modeling, programming and support of business applications and decision support systems in Internet and client server technologies. Senior IT professional with over 15 years of experience in full software life cycle development with emphasis on Scrum/Project management, Analysis, Design, data modeling, programming and support of business applications and decision support systems in Internet and client server technologies. Experience Information Technology Manager Intel Corporation March 2015  – Present (6 months) Phoenix, Arizona Area Responsible for management of technical System Programmers/Integrators. Responsible for day-to-day functional management of the organization, including performance management, training/developing, forecasting/reporting, budgeting/expense control and expanding the long-term capabilities of the team which includes championing new methodologies and technologies that foster increased velocity and improved sustainability.  System Anayst / Application Owner Intel September 2004  – Present (11 years) Information Technology Manager Intel Corporation March 2015  – Present (6 months) Phoenix, Arizona Area Responsible for management of technical System Programmers/Integrators. Responsible for day-to-day functional management of the organization, including performance management, training/developing, forecasting/reporting, budgeting/expense control and expanding the long-term capabilities of the team which includes championing new methodologies and technologies that foster increased velocity and improved sustainability.  Information Technology Manager Intel Corporation March 2015  – Present (6 months) Phoenix, Arizona Area Responsible for management of technical System Programmers/Integrators. Responsible for day-to-day functional management of the organization, including performance management, training/developing, forecasting/reporting, budgeting/expense control and expanding the long-term capabilities of the team which includes championing new methodologies and technologies that foster increased velocity and improved sustainability.  System Anayst / Application Owner Intel September 2004  – Present (11 years) System Anayst / Application Owner Intel September 2004  – Present (11 years) Languages English Full professional proficiency Hindi Native or bilingual proficiency Tamil Native or bilingual proficiency Kannada Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Tamil Native or bilingual proficiency Kannada Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Tamil Native or bilingual proficiency Kannada Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 6 Agile Methodologies 6 Requirements Analysis 6 Software Development 3 Business Intelligence 3 Testing 2 Software Engineering 2 Software System Analysis 2 System Architecture 2 SDLC 2 Agile Project Management vijaya also knows about... 1 Cloud Computing 1 Perl 1 Business Process 1 Business Analysis 0 Data Analysis 0 Scrum 0 BPMN Skills  Top Skills 6 Agile Methodologies 6 Requirements Analysis 6 Software Development 3 Business Intelligence 3 Testing 2 Software Engineering 2 Software System Analysis 2 System Architecture 2 SDLC 2 Agile Project Management vijaya also knows about... 1 Cloud Computing 1 Perl 1 Business Process 1 Business Analysis 0 Data Analysis 0 Scrum 0 BPMN Top Skills 6 Agile Methodologies 6 Requirements Analysis 6 Software Development 3 Business Intelligence 3 Testing 2 Software Engineering 2 Software System Analysis 2 System Architecture 2 SDLC 2 Agile Project Management vijaya also knows about... 1 Cloud Computing 1 Perl 1 Business Process 1 Business Analysis 0 Data Analysis 0 Scrum 0 BPMN Top Skills 6 Agile Methodologies 6 Requirements Analysis 6 Software Development 3 Business Intelligence 3 Testing 2 Software Engineering 2 Software System Analysis 2 System Architecture 2 SDLC 2 Agile Project Management vijaya also knows about... 1 Cloud Computing 1 Perl 1 Business Process 1 Business Analysis 0 Data Analysis 0 Scrum 0 BPMN                     1 Cloud Computing 1 Perl 1 Business Process 1 Business Analysis 0 Data Analysis 0 Scrum 0 BPMN Education S.J.C.E, Mysore India Master's Degree,  Computer Science S.J.C.E, Mysore India Master's Degree,  Computer Science S.J.C.E, Mysore India Master's Degree,  Computer Science S.J.C.E, Mysore India Master's Degree,  Computer Science ", "Experience Information Technology Manager Intel Corporation Information Technology Manager Intel Corporation Information Technology Manager Intel Corporation Skills 2 Strategic Planning 2 Intel 2 Cross-functional Team... 1 Engineering Management 1 Semiconductors 1 Process Improvement 1 Program Management Skills  2 Strategic Planning 2 Intel 2 Cross-functional Team... 1 Engineering Management 1 Semiconductors 1 Process Improvement 1 Program Management 2 Strategic Planning 2 Intel 2 Cross-functional Team... 1 Engineering Management 1 Semiconductors 1 Process Improvement 1 Program Management 2 Strategic Planning 2 Intel 2 Cross-functional Team... 1 Engineering Management 1 Semiconductors 1 Process Improvement 1 Program Management               ", "Summary Within 14 years of IT experience, Sonali serves as the Service Level Mgr, Project manager and People manager. Sonali currently works with Service management and teaches the ITSM Class. Sonali also is an certified instructor at the Sac Chapter of PMI. Lastly Sonali welcomes the new employess using the orientation program. Summary Within 14 years of IT experience, Sonali serves as the Service Level Mgr, Project manager and People manager. Sonali currently works with Service management and teaches the ITSM Class. Sonali also is an certified instructor at the Sac Chapter of PMI. Lastly Sonali welcomes the new employess using the orientation program. Within 14 years of IT experience, Sonali serves as the Service Level Mgr, Project manager and People manager. Sonali currently works with Service management and teaches the ITSM Class. Sonali also is an certified instructor at the Sac Chapter of PMI. Lastly Sonali welcomes the new employess using the orientation program. Within 14 years of IT experience, Sonali serves as the Service Level Mgr, Project manager and People manager. Sonali currently works with Service management and teaches the ITSM Class. Sonali also is an certified instructor at the Sac Chapter of PMI. Lastly Sonali welcomes the new employess using the orientation program. Experience Information Technology Manager Intel Corporation January 2006  – Present (9 years 8 months) Intel Develops a team of application developers, system engineers to support the customized Service Now platform used with the company. Additionally runs Scrum Teams using Agile SDLC. Also publishes SLA/OLA and support documents for healthy service management (Open) 1 course ITIL Expert See more (Open) 3 recommendations, including: Georgina Gonzalez-Hall CR content Solutions Manager at Intel Corporation Sonali is really capable employee with a strong technical background, supported by several MBAs and a bachelor in computer... View Machelle Chandler, MS, PMP, ITIL Expert ITSM Solution Architect at Salem Health Sonali is an outstanding resource and project manager. Many of the people who work for her have commented on how well they... View 1 more recommendation President IndeDev May 2009  –  May 2014  (5 years 1 month) Rancho Cordova Ran a small business web design, development and hosting company to help develop e-commerce and dynamic websites. System Analyst Intel June 2000  –  December 2005  (5 years 7 months) Supported/developed multiple software applications used by HR and Engineering teams in Intel. Information Technology Manager Intel Corporation January 2006  – Present (9 years 8 months) Intel Develops a team of application developers, system engineers to support the customized Service Now platform used with the company. Additionally runs Scrum Teams using Agile SDLC. Also publishes SLA/OLA and support documents for healthy service management (Open) 1 course ITIL Expert See more (Open) 3 recommendations, including: Georgina Gonzalez-Hall CR content Solutions Manager at Intel Corporation Sonali is really capable employee with a strong technical background, supported by several MBAs and a bachelor in computer... View Machelle Chandler, MS, PMP, ITIL Expert ITSM Solution Architect at Salem Health Sonali is an outstanding resource and project manager. Many of the people who work for her have commented on how well they... View 1 more recommendation Information Technology Manager Intel Corporation January 2006  – Present (9 years 8 months) Intel Develops a team of application developers, system engineers to support the customized Service Now platform used with the company. Additionally runs Scrum Teams using Agile SDLC. Also publishes SLA/OLA and support documents for healthy service management (Open) 1 course ITIL Expert See more (Open) 3 recommendations, including: Georgina Gonzalez-Hall CR content Solutions Manager at Intel Corporation Sonali is really capable employee with a strong technical background, supported by several MBAs and a bachelor in computer... View Machelle Chandler, MS, PMP, ITIL Expert ITSM Solution Architect at Salem Health Sonali is an outstanding resource and project manager. Many of the people who work for her have commented on how well they... View 1 more recommendation President IndeDev May 2009  –  May 2014  (5 years 1 month) Rancho Cordova Ran a small business web design, development and hosting company to help develop e-commerce and dynamic websites. President IndeDev May 2009  –  May 2014  (5 years 1 month) Rancho Cordova Ran a small business web design, development and hosting company to help develop e-commerce and dynamic websites. System Analyst Intel June 2000  –  December 2005  (5 years 7 months) Supported/developed multiple software applications used by HR and Engineering teams in Intel. System Analyst Intel June 2000  –  December 2005  (5 years 7 months) Supported/developed multiple software applications used by HR and Engineering teams in Intel. Languages English Full professional proficiency Hindi Full professional proficiency Marathi Professional working proficiency Kannada Limited working proficiency Konkani Professional working proficiency English Full professional proficiency Hindi Full professional proficiency Marathi Professional working proficiency Kannada Limited working proficiency Konkani Professional working proficiency English Full professional proficiency Hindi Full professional proficiency Marathi Professional working proficiency Kannada Limited working proficiency Konkani Professional working proficiency Full professional proficiency Full professional proficiency Professional working proficiency Limited working proficiency Professional working proficiency Skills Top Skills 10 PMP 7 Project Management 6 Software Project... 6 Agile Methodologies 6 IT Service Management 5 Software Development 4 Scrum 3 Agile Project Management 3 Requirements Analysis 3 SDLC Sonali also knows about... 3 ITIL 3 Management 2 Program Management 1 Business Analysis 1 Enterprise Architecture 1 Business Process 1 SQL Skills  Top Skills 10 PMP 7 Project Management 6 Software Project... 6 Agile Methodologies 6 IT Service Management 5 Software Development 4 Scrum 3 Agile Project Management 3 Requirements Analysis 3 SDLC Sonali also knows about... 3 ITIL 3 Management 2 Program Management 1 Business Analysis 1 Enterprise Architecture 1 Business Process 1 SQL Top Skills 10 PMP 7 Project Management 6 Software Project... 6 Agile Methodologies 6 IT Service Management 5 Software Development 4 Scrum 3 Agile Project Management 3 Requirements Analysis 3 SDLC Sonali also knows about... 3 ITIL 3 Management 2 Program Management 1 Business Analysis 1 Enterprise Architecture 1 Business Process 1 SQL Top Skills 10 PMP 7 Project Management 6 Software Project... 6 Agile Methodologies 6 IT Service Management 5 Software Development 4 Scrum 3 Agile Project Management 3 Requirements Analysis 3 SDLC Sonali also knows about... 3 ITIL 3 Management 2 Program Management 1 Business Analysis 1 Enterprise Architecture 1 Business Process 1 SQL                     3 ITIL 3 Management 2 Program Management 1 Business Analysis 1 Enterprise Architecture 1 Business Process 1 SQL Education ITIL ITIL,  IT Service Management 2009  – 2009 PMI PMP,  Project Management 2008  – 2008 University of California, Davis - Graduate School of Management MBA,  Marketing 2003  – 2006 University of Tulsa MS,  Computer Science 1998  – 2000 Activities and Societies:  President of Indian Student Association during 1998-1999 Sardar Patel University Bachelor of Science (BS),  EE 1992  – 1996 ITIL ITIL,  IT Service Management 2009  – 2009 ITIL ITIL,  IT Service Management 2009  – 2009 ITIL ITIL,  IT Service Management 2009  – 2009 PMI PMP,  Project Management 2008  – 2008 PMI PMP,  Project Management 2008  – 2008 PMI PMP,  Project Management 2008  – 2008 University of California, Davis - Graduate School of Management MBA,  Marketing 2003  – 2006 University of California, Davis - Graduate School of Management MBA,  Marketing 2003  – 2006 University of California, Davis - Graduate School of Management MBA,  Marketing 2003  – 2006 University of Tulsa MS,  Computer Science 1998  – 2000 Activities and Societies:  President of Indian Student Association during 1998-1999 University of Tulsa MS,  Computer Science 1998  – 2000 Activities and Societies:  President of Indian Student Association during 1998-1999 University of Tulsa MS,  Computer Science 1998  – 2000 Activities and Societies:  President of Indian Student Association during 1998-1999 Sardar Patel University Bachelor of Science (BS),  EE 1992  – 1996 Sardar Patel University Bachelor of Science (BS),  EE 1992  – 1996 Sardar Patel University Bachelor of Science (BS),  EE 1992  – 1996 ", "Experience Information Technology Manager Intel Corporation July 2008  – Present (7 years 2 months) Managing a team of Business Relationship Managers managing the delivery of IT services to the Design Engineering business units at Intel. Personally managing the strategic relationship program between IT and the Business Units where IT responses back to the design engineering groups as an early end user of their products before the products are taken to market. Information Technology Manager Intel May 2008  – Present (7 years 4 months) Managing a team within Enterprise Platform Application Capabilities Group delivering enterprise level software tools, PLM and Software Metrics. Results Manager for Business Unit/IT Relationship Manager team developing group strategy and metrics. West Region Operations Intel Solution Services July 2004  –  May 2008  (3 years 11 months) Responsible for developing and driving strategies to ensure operating efficiency through tracking and analysis of business metrics. Negotiated Master Service Agreement contracts for the West Region (Open) 2 recommendations Bob Kavula Biz Dev at Intel Corporation Dave is a wonderful person to work with. He is always available and always has a \"can do\" approach to things. You can... View Jesus Garcia Business Client ISV Alliance Marketing Manager David ensured our organization ran smoothly by streamlining our forecasting and legal processes. He goes out of his way to... View Project Manager/Advanced Data Center Manager Intel January 2001  –  July 2004  (3 years 7 months) Managed a team of engineers to deploy enterprise level data center consulting services, supported the worldwide service development group, and delivered on personal PM responsibilities. Business Development Manager/Project Manager Intel May 1999  –  January 2001  (1 year 9 months) Developed and implemented strategic and tactical business development plans to generate revenue for the business group while managing projects. Account Manager International Billing Services 1991  –  1998  (7 years) •\tProject Manager developing client interface software automating the bill run submission process, requiring analysis, design, prototyping, as well as documenting specifications (and test plans). Project management duties included: directing, supervising other team members; planning, estimating and scheduling all tasks; producing status reports and running progress meetings with stakeholders; quality control and the mentoring and training of staff. Responsible for total client satisfaction with software development efforts. Information Technology Manager Intel Corporation July 2008  – Present (7 years 2 months) Managing a team of Business Relationship Managers managing the delivery of IT services to the Design Engineering business units at Intel. Personally managing the strategic relationship program between IT and the Business Units where IT responses back to the design engineering groups as an early end user of their products before the products are taken to market. Information Technology Manager Intel Corporation July 2008  – Present (7 years 2 months) Managing a team of Business Relationship Managers managing the delivery of IT services to the Design Engineering business units at Intel. Personally managing the strategic relationship program between IT and the Business Units where IT responses back to the design engineering groups as an early end user of their products before the products are taken to market. Information Technology Manager Intel May 2008  – Present (7 years 4 months) Managing a team within Enterprise Platform Application Capabilities Group delivering enterprise level software tools, PLM and Software Metrics. Results Manager for Business Unit/IT Relationship Manager team developing group strategy and metrics. Information Technology Manager Intel May 2008  – Present (7 years 4 months) Managing a team within Enterprise Platform Application Capabilities Group delivering enterprise level software tools, PLM and Software Metrics. Results Manager for Business Unit/IT Relationship Manager team developing group strategy and metrics. West Region Operations Intel Solution Services July 2004  –  May 2008  (3 years 11 months) Responsible for developing and driving strategies to ensure operating efficiency through tracking and analysis of business metrics. Negotiated Master Service Agreement contracts for the West Region (Open) 2 recommendations Bob Kavula Biz Dev at Intel Corporation Dave is a wonderful person to work with. He is always available and always has a \"can do\" approach to things. You can... View Jesus Garcia Business Client ISV Alliance Marketing Manager David ensured our organization ran smoothly by streamlining our forecasting and legal processes. He goes out of his way to... View West Region Operations Intel Solution Services July 2004  –  May 2008  (3 years 11 months) Responsible for developing and driving strategies to ensure operating efficiency through tracking and analysis of business metrics. Negotiated Master Service Agreement contracts for the West Region (Open) 2 recommendations Bob Kavula Biz Dev at Intel Corporation Dave is a wonderful person to work with. He is always available and always has a \"can do\" approach to things. You can... View Jesus Garcia Business Client ISV Alliance Marketing Manager David ensured our organization ran smoothly by streamlining our forecasting and legal processes. He goes out of his way to... View Project Manager/Advanced Data Center Manager Intel January 2001  –  July 2004  (3 years 7 months) Managed a team of engineers to deploy enterprise level data center consulting services, supported the worldwide service development group, and delivered on personal PM responsibilities. Project Manager/Advanced Data Center Manager Intel January 2001  –  July 2004  (3 years 7 months) Managed a team of engineers to deploy enterprise level data center consulting services, supported the worldwide service development group, and delivered on personal PM responsibilities. Business Development Manager/Project Manager Intel May 1999  –  January 2001  (1 year 9 months) Developed and implemented strategic and tactical business development plans to generate revenue for the business group while managing projects. Business Development Manager/Project Manager Intel May 1999  –  January 2001  (1 year 9 months) Developed and implemented strategic and tactical business development plans to generate revenue for the business group while managing projects. Account Manager International Billing Services 1991  –  1998  (7 years) •\tProject Manager developing client interface software automating the bill run submission process, requiring analysis, design, prototyping, as well as documenting specifications (and test plans). Project management duties included: directing, supervising other team members; planning, estimating and scheduling all tasks; producing status reports and running progress meetings with stakeholders; quality control and the mentoring and training of staff. Responsible for total client satisfaction with software development efforts. Account Manager International Billing Services 1991  –  1998  (7 years) •\tProject Manager developing client interface software automating the bill run submission process, requiring analysis, design, prototyping, as well as documenting specifications (and test plans). Project management duties included: directing, supervising other team members; planning, estimating and scheduling all tasks; producing status reports and running progress meetings with stakeholders; quality control and the mentoring and training of staff. Responsible for total client satisfaction with software development efforts. Skills Skills     Education Golden Gate University MBA,  Business 1995  – 1997 California State University-East Bay BS,  Management Information Systems 1984  – 1987 Golden Gate University MBA,  Business 1995  – 1997 Golden Gate University MBA,  Business 1995  – 1997 Golden Gate University MBA,  Business 1995  – 1997 California State University-East Bay BS,  Management Information Systems 1984  – 1987 California State University-East Bay BS,  Management Information Systems 1984  – 1987 California State University-East Bay BS,  Management Information Systems 1984  – 1987 ", "Experience Information Technology Manager Intel Corporation November 2013  – Present (1 year 10 months) Automation Engineer Intel Corporation May 2000  –  November 2013  (13 years 7 months) Information Technology Manager Intel Corporation November 2013  – Present (1 year 10 months) Information Technology Manager Intel Corporation November 2013  – Present (1 year 10 months) Automation Engineer Intel Corporation May 2000  –  November 2013  (13 years 7 months) Automation Engineer Intel Corporation May 2000  –  November 2013  (13 years 7 months) Skills Top Skills 10 Manufacturing 9 Process Improvement 7 Cross-functional Team... 6 Lean Manufacturing 5 Project Management 4 Strategic Planning 3 Intel 2 Team Leadership 2 Operations Management 2 Leadership Paul also knows about... 2 Engineering 2 Microsoft SQL Server 1 Customer Service 1 MS Project 1 Inventory Management 1 Forecasting 1 Continuous Improvement 1 Microsoft Office 1 Business Strategy 1 Project Planning 1 Business Development 1 Data Analysis 1 SQL Skills  Top Skills 10 Manufacturing 9 Process Improvement 7 Cross-functional Team... 6 Lean Manufacturing 5 Project Management 4 Strategic Planning 3 Intel 2 Team Leadership 2 Operations Management 2 Leadership Paul also knows about... 2 Engineering 2 Microsoft SQL Server 1 Customer Service 1 MS Project 1 Inventory Management 1 Forecasting 1 Continuous Improvement 1 Microsoft Office 1 Business Strategy 1 Project Planning 1 Business Development 1 Data Analysis 1 SQL Top Skills 10 Manufacturing 9 Process Improvement 7 Cross-functional Team... 6 Lean Manufacturing 5 Project Management 4 Strategic Planning 3 Intel 2 Team Leadership 2 Operations Management 2 Leadership Paul also knows about... 2 Engineering 2 Microsoft SQL Server 1 Customer Service 1 MS Project 1 Inventory Management 1 Forecasting 1 Continuous Improvement 1 Microsoft Office 1 Business Strategy 1 Project Planning 1 Business Development 1 Data Analysis 1 SQL Top Skills 10 Manufacturing 9 Process Improvement 7 Cross-functional Team... 6 Lean Manufacturing 5 Project Management 4 Strategic Planning 3 Intel 2 Team Leadership 2 Operations Management 2 Leadership Paul also knows about... 2 Engineering 2 Microsoft SQL Server 1 Customer Service 1 MS Project 1 Inventory Management 1 Forecasting 1 Continuous Improvement 1 Microsoft Office 1 Business Strategy 1 Project Planning 1 Business Development 1 Data Analysis 1 SQL                     2 Engineering 2 Microsoft SQL Server 1 Customer Service 1 MS Project 1 Inventory Management 1 Forecasting 1 Continuous Improvement 1 Microsoft Office 1 Business Strategy 1 Project Planning 1 Business Development 1 Data Analysis 1 SQL Education Arizona State University Master of Business Administration (M.B.A.) 2010  – 2012 Arizona State University Bachelor of Science (B.S.),  Computer Information Systems 1995  – 2000 Arizona State University Master of Business Administration (M.B.A.) 2010  – 2012 Arizona State University Master of Business Administration (M.B.A.) 2010  – 2012 Arizona State University Master of Business Administration (M.B.A.) 2010  – 2012 Arizona State University Bachelor of Science (B.S.),  Computer Information Systems 1995  – 2000 Arizona State University Bachelor of Science (B.S.),  Computer Information Systems 1995  – 2000 Arizona State University Bachelor of Science (B.S.),  Computer Information Systems 1995  – 2000 ", "Summary I recently purchased Apex Fun Run AZ, which is a fund raising company for elementary schools in the Arizona territories. Our program focus on fitness and character building for the kids, while providing an excellent, hassle free fund raising opportunity for the school. Our 25 person company served over 100 schools and raised over $2m for Arizona schools in the 2014/15 school year! Summary I recently purchased Apex Fun Run AZ, which is a fund raising company for elementary schools in the Arizona territories. Our program focus on fitness and character building for the kids, while providing an excellent, hassle free fund raising opportunity for the school. Our 25 person company served over 100 schools and raised over $2m for Arizona schools in the 2014/15 school year! I recently purchased Apex Fun Run AZ, which is a fund raising company for elementary schools in the Arizona territories. Our program focus on fitness and character building for the kids, while providing an excellent, hassle free fund raising opportunity for the school. Our 25 person company served over 100 schools and raised over $2m for Arizona schools in the 2014/15 school year! I recently purchased Apex Fun Run AZ, which is a fund raising company for elementary schools in the Arizona territories. Our program focus on fitness and character building for the kids, while providing an excellent, hassle free fund raising opportunity for the school. Our 25 person company served over 100 schools and raised over $2m for Arizona schools in the 2014/15 school year! Experience Owner/Director of Apex Fun Run in Arizona Program/Operational Management or Outsource Transitions March 2015  – Present (6 months) Tempe, Arizona Owner and Director of Apex Fun Run in AZ. This company does 2 week fund raising programs for elementary schools in Arizona. Programs focus on fitness and character building for the kids, while providing an excellent, hassel free fund raising opportunity for the school. We currently have 7 teams operating mostly in the Phoenix and Tuscon areas, but also serve the rest of Arizona. Our 25 person company served over 100 schools and raised over $2m for Arizona schools in the 2014/15 school year! \nhttps://www.apexfunrun.com \n Program and Operational Manager Intel Corporation January 2010  –  July 2014  (4 years 7 months) Chandler, Arizona I was responsible for managing various operational processes and indicators for the Supply Fulfillment organization (approx 200 employees world wide). Areas under my control included headcount and all spending (all organization discretionary spending as well as project budgets of between $8m to $15m per year). I was also program manager for all outsource engagements for the Supply Network group (approx 800 employees world wide). In this role I helped managed outsource vendor evaluations for all of Intel's IT Division, approx 650 contract workers requiring a spend of about $55m annually. I personally managed vendor transitions to the selected vendor for all Supply Network engagements (approx 180 contract workers, $14m annually). The entire program projected a 25% reduction in Outsourcing cost over a 3 year period. Program Manager Intel Corporation January 2003  –  January 2010  (7 years 1 month) Chandler, Arizona I was Program Manager for various efforts around the world for the SDIS (Supply Demand Information Systems) organization. These Programs, enabled key Supply Chain vectors – cycle time reduction, responsiveness, productivity and reduction of spreadsheets. I was also responsible for planning, tracking, and staffing, program resources by interfacing with the various other IT organizations and Outsource vendors. I was responsible for vendor management of Outsourced resources, planning, staffing and managing the vendor relationship for our organization. (Open) 1 project Intel IT Outsource Vendor Consolidation and Transition Owned and represented all Outsourced engagements for the Supply Chain IT organization as part of an IT wide vendor consolidation. Overall program impacted over 600 outsource workers world wide, with a total annual spend of about $50m. ... View Information Technology Manager Intel Corporation April 1998  –  January 2004  (5 years 10 months) Chandler, Arizona I was responsible for Organizational management (2nd level) of the Biz-X (Business Execution Systems). Under my leadership this international group grew from 20 employees to about 40 by 2003. The organization also employed a number of contract workers making the total size about 50 workers. Biz-X, later to be renamed Supply Network Planning Applications (SNPA) was responsible for development and support Supply Chain Manufacturing Planning Applications. During this time my organization established a very high reliability record and developed numerous new applications enhancing our planning capabilities. I personally oversaw the Year 2000 application certifications and we had ZERO issues across all of our applications. Information Technology Manager Intel Corporation April 1993  –  March 1998  (5 years) Chandler, AZ Technical manager of a group of approx 15 Programmer/Analyst and Contracted workers in the Components Manufacturing Planning Systems organization. Our group was responsible for development and support of Planning applications for the Supply Chain factories. Group was responsible for all aspects of IT, including new application development, enhancement, and production support (24x7). Senior Programmer/Analyst Intel Corporation April 1992  –  March 1993  (1 year) Chandler, Arizona I was responsible for application development and support of various applications owned by the Components Manufacturing Planning Systems organization. I would take over management of this team in 1993. Programmer/Analyst Intel Corporation September 1991  –  April 1992  (8 months) Chandler, Arizona I took a transfer from Folsom CA, to Arizona to join the Components Manufacturing Planning Systems organization. I was responsible for application development and support of various applications owned by this organization. Programmer/Analyst Intel Corporation September 1988  –  August 1991  (3 years) Folsom, California My entry position at Intel. I worked for the Sales and Marketing group doing production support for their Order Processing system. Owner/Director of Apex Fun Run in Arizona Program/Operational Management or Outsource Transitions March 2015  – Present (6 months) Tempe, Arizona Owner and Director of Apex Fun Run in AZ. This company does 2 week fund raising programs for elementary schools in Arizona. Programs focus on fitness and character building for the kids, while providing an excellent, hassel free fund raising opportunity for the school. We currently have 7 teams operating mostly in the Phoenix and Tuscon areas, but also serve the rest of Arizona. Our 25 person company served over 100 schools and raised over $2m for Arizona schools in the 2014/15 school year! \nhttps://www.apexfunrun.com \n Owner/Director of Apex Fun Run in Arizona Program/Operational Management or Outsource Transitions March 2015  – Present (6 months) Tempe, Arizona Owner and Director of Apex Fun Run in AZ. This company does 2 week fund raising programs for elementary schools in Arizona. Programs focus on fitness and character building for the kids, while providing an excellent, hassel free fund raising opportunity for the school. We currently have 7 teams operating mostly in the Phoenix and Tuscon areas, but also serve the rest of Arizona. Our 25 person company served over 100 schools and raised over $2m for Arizona schools in the 2014/15 school year! \nhttps://www.apexfunrun.com \n Program and Operational Manager Intel Corporation January 2010  –  July 2014  (4 years 7 months) Chandler, Arizona I was responsible for managing various operational processes and indicators for the Supply Fulfillment organization (approx 200 employees world wide). Areas under my control included headcount and all spending (all organization discretionary spending as well as project budgets of between $8m to $15m per year). I was also program manager for all outsource engagements for the Supply Network group (approx 800 employees world wide). In this role I helped managed outsource vendor evaluations for all of Intel's IT Division, approx 650 contract workers requiring a spend of about $55m annually. I personally managed vendor transitions to the selected vendor for all Supply Network engagements (approx 180 contract workers, $14m annually). The entire program projected a 25% reduction in Outsourcing cost over a 3 year period. Program and Operational Manager Intel Corporation January 2010  –  July 2014  (4 years 7 months) Chandler, Arizona I was responsible for managing various operational processes and indicators for the Supply Fulfillment organization (approx 200 employees world wide). Areas under my control included headcount and all spending (all organization discretionary spending as well as project budgets of between $8m to $15m per year). I was also program manager for all outsource engagements for the Supply Network group (approx 800 employees world wide). In this role I helped managed outsource vendor evaluations for all of Intel's IT Division, approx 650 contract workers requiring a spend of about $55m annually. I personally managed vendor transitions to the selected vendor for all Supply Network engagements (approx 180 contract workers, $14m annually). The entire program projected a 25% reduction in Outsourcing cost over a 3 year period. Program Manager Intel Corporation January 2003  –  January 2010  (7 years 1 month) Chandler, Arizona I was Program Manager for various efforts around the world for the SDIS (Supply Demand Information Systems) organization. These Programs, enabled key Supply Chain vectors – cycle time reduction, responsiveness, productivity and reduction of spreadsheets. I was also responsible for planning, tracking, and staffing, program resources by interfacing with the various other IT organizations and Outsource vendors. I was responsible for vendor management of Outsourced resources, planning, staffing and managing the vendor relationship for our organization. (Open) 1 project Intel IT Outsource Vendor Consolidation and Transition Owned and represented all Outsourced engagements for the Supply Chain IT organization as part of an IT wide vendor consolidation. Overall program impacted over 600 outsource workers world wide, with a total annual spend of about $50m. ... View Program Manager Intel Corporation January 2003  –  January 2010  (7 years 1 month) Chandler, Arizona I was Program Manager for various efforts around the world for the SDIS (Supply Demand Information Systems) organization. These Programs, enabled key Supply Chain vectors – cycle time reduction, responsiveness, productivity and reduction of spreadsheets. I was also responsible for planning, tracking, and staffing, program resources by interfacing with the various other IT organizations and Outsource vendors. I was responsible for vendor management of Outsourced resources, planning, staffing and managing the vendor relationship for our organization. (Open) 1 project Intel IT Outsource Vendor Consolidation and Transition Owned and represented all Outsourced engagements for the Supply Chain IT organization as part of an IT wide vendor consolidation. Overall program impacted over 600 outsource workers world wide, with a total annual spend of about $50m. ... View Information Technology Manager Intel Corporation April 1998  –  January 2004  (5 years 10 months) Chandler, Arizona I was responsible for Organizational management (2nd level) of the Biz-X (Business Execution Systems). Under my leadership this international group grew from 20 employees to about 40 by 2003. The organization also employed a number of contract workers making the total size about 50 workers. Biz-X, later to be renamed Supply Network Planning Applications (SNPA) was responsible for development and support Supply Chain Manufacturing Planning Applications. During this time my organization established a very high reliability record and developed numerous new applications enhancing our planning capabilities. I personally oversaw the Year 2000 application certifications and we had ZERO issues across all of our applications. Information Technology Manager Intel Corporation April 1998  –  January 2004  (5 years 10 months) Chandler, Arizona I was responsible for Organizational management (2nd level) of the Biz-X (Business Execution Systems). Under my leadership this international group grew from 20 employees to about 40 by 2003. The organization also employed a number of contract workers making the total size about 50 workers. Biz-X, later to be renamed Supply Network Planning Applications (SNPA) was responsible for development and support Supply Chain Manufacturing Planning Applications. During this time my organization established a very high reliability record and developed numerous new applications enhancing our planning capabilities. I personally oversaw the Year 2000 application certifications and we had ZERO issues across all of our applications. Information Technology Manager Intel Corporation April 1993  –  March 1998  (5 years) Chandler, AZ Technical manager of a group of approx 15 Programmer/Analyst and Contracted workers in the Components Manufacturing Planning Systems organization. Our group was responsible for development and support of Planning applications for the Supply Chain factories. Group was responsible for all aspects of IT, including new application development, enhancement, and production support (24x7). Information Technology Manager Intel Corporation April 1993  –  March 1998  (5 years) Chandler, AZ Technical manager of a group of approx 15 Programmer/Analyst and Contracted workers in the Components Manufacturing Planning Systems organization. Our group was responsible for development and support of Planning applications for the Supply Chain factories. Group was responsible for all aspects of IT, including new application development, enhancement, and production support (24x7). Senior Programmer/Analyst Intel Corporation April 1992  –  March 1993  (1 year) Chandler, Arizona I was responsible for application development and support of various applications owned by the Components Manufacturing Planning Systems organization. I would take over management of this team in 1993. Senior Programmer/Analyst Intel Corporation April 1992  –  March 1993  (1 year) Chandler, Arizona I was responsible for application development and support of various applications owned by the Components Manufacturing Planning Systems organization. I would take over management of this team in 1993. Programmer/Analyst Intel Corporation September 1991  –  April 1992  (8 months) Chandler, Arizona I took a transfer from Folsom CA, to Arizona to join the Components Manufacturing Planning Systems organization. I was responsible for application development and support of various applications owned by this organization. Programmer/Analyst Intel Corporation September 1991  –  April 1992  (8 months) Chandler, Arizona I took a transfer from Folsom CA, to Arizona to join the Components Manufacturing Planning Systems organization. I was responsible for application development and support of various applications owned by this organization. Programmer/Analyst Intel Corporation September 1988  –  August 1991  (3 years) Folsom, California My entry position at Intel. I worked for the Sales and Marketing group doing production support for their Order Processing system. Programmer/Analyst Intel Corporation September 1988  –  August 1991  (3 years) Folsom, California My entry position at Intel. I worked for the Sales and Marketing group doing production support for their Order Processing system. Skills Top Skills 2 Program Management 0 IT Outsourcing 0 Transformational... 0 IT Service Management 0 IT Operations Chris also knows about... 0 IT Strategy 1 Outsourcing 0 Outsourcing Management 0 Offshore Outsourcing 0 Software Development 1 Project Management 1 Software Project... 0 Project Planning 0 Information Technology 0 Production Support 0 Workforce Management 0 Operations Management 0 Resource Management 0 Technical Support 0 IT Management Skills  Top Skills 2 Program Management 0 IT Outsourcing 0 Transformational... 0 IT Service Management 0 IT Operations Chris also knows about... 0 IT Strategy 1 Outsourcing 0 Outsourcing Management 0 Offshore Outsourcing 0 Software Development 1 Project Management 1 Software Project... 0 Project Planning 0 Information Technology 0 Production Support 0 Workforce Management 0 Operations Management 0 Resource Management 0 Technical Support 0 IT Management Top Skills 2 Program Management 0 IT Outsourcing 0 Transformational... 0 IT Service Management 0 IT Operations Chris also knows about... 0 IT Strategy 1 Outsourcing 0 Outsourcing Management 0 Offshore Outsourcing 0 Software Development 1 Project Management 1 Software Project... 0 Project Planning 0 Information Technology 0 Production Support 0 Workforce Management 0 Operations Management 0 Resource Management 0 Technical Support 0 IT Management Top Skills 2 Program Management 0 IT Outsourcing 0 Transformational... 0 IT Service Management 0 IT Operations Chris also knows about... 0 IT Strategy 1 Outsourcing 0 Outsourcing Management 0 Offshore Outsourcing 0 Software Development 1 Project Management 1 Software Project... 0 Project Planning 0 Information Technology 0 Production Support 0 Workforce Management 0 Operations Management 0 Resource Management 0 Technical Support 0 IT Management           0 IT Strategy 1 Outsourcing 0 Outsourcing Management 0 Offshore Outsourcing 0 Software Development 1 Project Management 1 Software Project... 0 Project Planning 0 Information Technology 0 Production Support 0 Workforce Management 0 Operations Management 0 Resource Management 0 Technical Support 0 IT Management Education University of Wyoming Bachelor's Degree,  Management Information Systems ,  General , 3.0 1980  – 1988 Withdrew from school during 1981 to 1984 University of Wyoming Bachelor's Degree,  Management Information Systems ,  General , 3.0 1980  – 1988 Withdrew from school during 1981 to 1984 University of Wyoming Bachelor's Degree,  Management Information Systems ,  General , 3.0 1980  – 1988 Withdrew from school during 1981 to 1984 University of Wyoming Bachelor's Degree,  Management Information Systems ,  General , 3.0 1980  – 1988 Withdrew from school during 1981 to 1984 ", "Experience Information Technology Manager Intel Corporation August 2012  – Present (3 years 1 month) Chandler, AZ Manage the operational, infrastructure (network and security), BC/DR, and physical security aspects of the facility and team that I work within and for respectively. (Open) 1 organization IEEE View Information Security Specialist Intel Corporation February 2005  –  September 2012  (7 years 8 months) Performed as team lead for the System Security Engineering team, the BC/DR team, and the Infrastructure Security (System and Network) team. (Open) 1 organization ISC2 View System Programmer Intel Corporation February 2005  –  March 2012  (7 years 2 months) Developed and supported Web/SQL-based applications for various groups and projects. SQL DBA/Developer Intel Corporation February 2002  –  February 2005  (3 years 1 month) Designed, developed, and supported enterprise level SQL server databases. Interior Communications Technician (IC1 SS) US Navy February 1988  –  February 1996  (8 years 1 month) Groton, CT I am a US Navy Submarine Veteran. I served from 1988 – 1996. My rate was Interior Communication Technician, and my rank when I was honorably discharged was E6, i.e. IC1 SS. While on active duty, I attended A and C school in San Diego, CA, Sub school in Groton, CT, and served about the USS Miami and USS Springfield, both fast attack nuclear submarines out of Groton, CT. Information Technology Manager Intel Corporation August 2012  – Present (3 years 1 month) Chandler, AZ Manage the operational, infrastructure (network and security), BC/DR, and physical security aspects of the facility and team that I work within and for respectively. (Open) 1 organization IEEE View Information Technology Manager Intel Corporation August 2012  – Present (3 years 1 month) Chandler, AZ Manage the operational, infrastructure (network and security), BC/DR, and physical security aspects of the facility and team that I work within and for respectively. (Open) 1 organization IEEE View Information Security Specialist Intel Corporation February 2005  –  September 2012  (7 years 8 months) Performed as team lead for the System Security Engineering team, the BC/DR team, and the Infrastructure Security (System and Network) team. (Open) 1 organization ISC2 View Information Security Specialist Intel Corporation February 2005  –  September 2012  (7 years 8 months) Performed as team lead for the System Security Engineering team, the BC/DR team, and the Infrastructure Security (System and Network) team. (Open) 1 organization ISC2 View System Programmer Intel Corporation February 2005  –  March 2012  (7 years 2 months) Developed and supported Web/SQL-based applications for various groups and projects. System Programmer Intel Corporation February 2005  –  March 2012  (7 years 2 months) Developed and supported Web/SQL-based applications for various groups and projects. SQL DBA/Developer Intel Corporation February 2002  –  February 2005  (3 years 1 month) Designed, developed, and supported enterprise level SQL server databases. SQL DBA/Developer Intel Corporation February 2002  –  February 2005  (3 years 1 month) Designed, developed, and supported enterprise level SQL server databases. Interior Communications Technician (IC1 SS) US Navy February 1988  –  February 1996  (8 years 1 month) Groton, CT I am a US Navy Submarine Veteran. I served from 1988 – 1996. My rate was Interior Communication Technician, and my rank when I was honorably discharged was E6, i.e. IC1 SS. While on active duty, I attended A and C school in San Diego, CA, Sub school in Groton, CT, and served about the USS Miami and USS Springfield, both fast attack nuclear submarines out of Groton, CT. Interior Communications Technician (IC1 SS) US Navy February 1988  –  February 1996  (8 years 1 month) Groton, CT I am a US Navy Submarine Veteran. I served from 1988 – 1996. My rate was Interior Communication Technician, and my rank when I was honorably discharged was E6, i.e. IC1 SS. While on active duty, I attended A and C school in San Diego, CA, Sub school in Groton, CT, and served about the USS Miami and USS Springfield, both fast attack nuclear submarines out of Groton, CT. Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Top Skills 2 Computer Security 1 Linux 1 Debugging 1 Operating Systems 1 Intel 1 Cryptography 1 C++ 1 Software Development 1 System Administration 1 Programming Michael also knows about... 1 Testing 1 Troubleshooting 1 Microsoft SQL Server 1 Information Security... 1 SAN Skills  Top Skills 2 Computer Security 1 Linux 1 Debugging 1 Operating Systems 1 Intel 1 Cryptography 1 C++ 1 Software Development 1 System Administration 1 Programming Michael also knows about... 1 Testing 1 Troubleshooting 1 Microsoft SQL Server 1 Information Security... 1 SAN Top Skills 2 Computer Security 1 Linux 1 Debugging 1 Operating Systems 1 Intel 1 Cryptography 1 C++ 1 Software Development 1 System Administration 1 Programming Michael also knows about... 1 Testing 1 Troubleshooting 1 Microsoft SQL Server 1 Information Security... 1 SAN Top Skills 2 Computer Security 1 Linux 1 Debugging 1 Operating Systems 1 Intel 1 Cryptography 1 C++ 1 Software Development 1 System Administration 1 Programming Michael also knows about... 1 Testing 1 Troubleshooting 1 Microsoft SQL Server 1 Information Security... 1 SAN                     1 Testing 1 Troubleshooting 1 Microsoft SQL Server 1 Information Security... 1 SAN Education Norwich University Master of Science (MS),  Computer and Information Systems Security/Information Assurance 2010  – 2012 Activities and Societies:  Upsilon Pi Epsilon University of Phoenix Bachelor of Science (BS),  Information Technology 1999  – 2001 Self Study MCSE NT4,  Microsoft Certified System Engineer 1999  – 1999 Certified MCSE NT4 and MCP+I The University of New Mexico Biology ,  General 1986  – 1987 Norwich University Master of Science (MS),  Computer and Information Systems Security/Information Assurance 2010  – 2012 Activities and Societies:  Upsilon Pi Epsilon Norwich University Master of Science (MS),  Computer and Information Systems Security/Information Assurance 2010  – 2012 Activities and Societies:  Upsilon Pi Epsilon Norwich University Master of Science (MS),  Computer and Information Systems Security/Information Assurance 2010  – 2012 Activities and Societies:  Upsilon Pi Epsilon University of Phoenix Bachelor of Science (BS),  Information Technology 1999  – 2001 University of Phoenix Bachelor of Science (BS),  Information Technology 1999  – 2001 University of Phoenix Bachelor of Science (BS),  Information Technology 1999  – 2001 Self Study MCSE NT4,  Microsoft Certified System Engineer 1999  – 1999 Certified MCSE NT4 and MCP+I Self Study MCSE NT4,  Microsoft Certified System Engineer 1999  – 1999 Certified MCSE NT4 and MCP+I Self Study MCSE NT4,  Microsoft Certified System Engineer 1999  – 1999 Certified MCSE NT4 and MCP+I The University of New Mexico Biology ,  General 1986  – 1987 The University of New Mexico Biology ,  General 1986  – 1987 The University of New Mexico Biology ,  General 1986  – 1987 ", "Experience Information Technology Mgr. Intel Corporation March 1980  – Present (35 years 6 months) (Open) 1 recommendation Stephen Mintz Technology Consultant at Techbadger LLC Darlene James is one of the best managers I have had in my 20 years in the technology industry.\nNot only is she a knowledge source on the technologies she manages but she is one of those wonderful managers and encourages, enriches and motivates... View Information Technology Mgr. Intel Corporation March 1980  – Present (35 years 6 months) (Open) 1 recommendation Stephen Mintz Technology Consultant at Techbadger LLC Darlene James is one of the best managers I have had in my 20 years in the technology industry.\nNot only is she a knowledge source on the technologies she manages but she is one of those wonderful managers and encourages, enriches and motivates... View Information Technology Mgr. Intel Corporation March 1980  – Present (35 years 6 months) (Open) 1 recommendation Stephen Mintz Technology Consultant at Techbadger LLC Darlene James is one of the best managers I have had in my 20 years in the technology industry.\nNot only is she a knowledge source on the technologies she manages but she is one of those wonderful managers and encourages, enriches and motivates... View Skills Top Skills 30 Intel 13 Computer Architecture 13 Management 11 Semiconductors 11 Hardware 10 Program Management 7 Linux 6 System Architecture 6 Unix 5 Information Technology Darlene also knows about... 5 Data Center 4 High Performance... 4 Debugging 3 IT Management 2 Embedded Systems 2 Process Improvement 2 Disaster Recovery 1 Processors 1 IT Operations 1 TCL 1 Project Management 1 Information Security 1 Network Security Skills  Top Skills 30 Intel 13 Computer Architecture 13 Management 11 Semiconductors 11 Hardware 10 Program Management 7 Linux 6 System Architecture 6 Unix 5 Information Technology Darlene also knows about... 5 Data Center 4 High Performance... 4 Debugging 3 IT Management 2 Embedded Systems 2 Process Improvement 2 Disaster Recovery 1 Processors 1 IT Operations 1 TCL 1 Project Management 1 Information Security 1 Network Security Top Skills 30 Intel 13 Computer Architecture 13 Management 11 Semiconductors 11 Hardware 10 Program Management 7 Linux 6 System Architecture 6 Unix 5 Information Technology Darlene also knows about... 5 Data Center 4 High Performance... 4 Debugging 3 IT Management 2 Embedded Systems 2 Process Improvement 2 Disaster Recovery 1 Processors 1 IT Operations 1 TCL 1 Project Management 1 Information Security 1 Network Security Top Skills 30 Intel 13 Computer Architecture 13 Management 11 Semiconductors 11 Hardware 10 Program Management 7 Linux 6 System Architecture 6 Unix 5 Information Technology Darlene also knows about... 5 Data Center 4 High Performance... 4 Debugging 3 IT Management 2 Embedded Systems 2 Process Improvement 2 Disaster Recovery 1 Processors 1 IT Operations 1 TCL 1 Project Management 1 Information Security 1 Network Security                     5 Data Center 4 High Performance... 4 Debugging 3 IT Management 2 Embedded Systems 2 Process Improvement 2 Disaster Recovery 1 Processors 1 IT Operations 1 TCL 1 Project Management 1 Information Security 1 Network Security ", "Experience Information Technology Manager Intel Corporation June 2013  – Present (2 years 3 months) Shanghai City, China Manage IT Solution Development Team, create Intel Private Cloud Solutions for R&D Labs. Software Engineer Intel Corporation April 2012  –  June 2013  (1 year 3 months) Shanghai City, China Leader of joint team of China DCSG-PEG and IT-EC on “Huangpu River” Project (iLab on OpenStack). \nManage outsourcing workers to guarantee an effective contribution to TEMS and iLab projects. \nPerform leadership in agile practice within EC and cross Bus, deliver agile bootcamp training to all EC China Development team and DCSG-EPSD software team, coach junior Scrum Masters in team and bring agile best practice. System Programmer Intel May 2008  –  June 2013  (5 years 2 months) Solution Researcher Digital Technical Support June 2007  –  April 2008  (11 months) Nanjing Information Technology Manager Intel Corporation June 2013  – Present (2 years 3 months) Shanghai City, China Manage IT Solution Development Team, create Intel Private Cloud Solutions for R&D Labs. Information Technology Manager Intel Corporation June 2013  – Present (2 years 3 months) Shanghai City, China Manage IT Solution Development Team, create Intel Private Cloud Solutions for R&D Labs. Software Engineer Intel Corporation April 2012  –  June 2013  (1 year 3 months) Shanghai City, China Leader of joint team of China DCSG-PEG and IT-EC on “Huangpu River” Project (iLab on OpenStack). \nManage outsourcing workers to guarantee an effective contribution to TEMS and iLab projects. \nPerform leadership in agile practice within EC and cross Bus, deliver agile bootcamp training to all EC China Development team and DCSG-EPSD software team, coach junior Scrum Masters in team and bring agile best practice. Software Engineer Intel Corporation April 2012  –  June 2013  (1 year 3 months) Shanghai City, China Leader of joint team of China DCSG-PEG and IT-EC on “Huangpu River” Project (iLab on OpenStack). \nManage outsourcing workers to guarantee an effective contribution to TEMS and iLab projects. \nPerform leadership in agile practice within EC and cross Bus, deliver agile bootcamp training to all EC China Development team and DCSG-EPSD software team, coach junior Scrum Masters in team and bring agile best practice. System Programmer Intel May 2008  –  June 2013  (5 years 2 months) System Programmer Intel May 2008  –  June 2013  (5 years 2 months) Solution Researcher Digital Technical Support June 2007  –  April 2008  (11 months) Nanjing Solution Researcher Digital Technical Support June 2007  –  April 2008  (11 months) Nanjing Skills Top Skills 13 Software Engineering 8 Agile Methodologies 7 Linux 6 Agile Project Management 6 Distributed Systems 5 Software Development 4 Business Intelligence 4 Scrum 4 Software Project... 3 C# Kevin also knows about... 2 Private Cloud 2 Object Oriented Design 2 SOA 2 C++ Skills  Top Skills 13 Software Engineering 8 Agile Methodologies 7 Linux 6 Agile Project Management 6 Distributed Systems 5 Software Development 4 Business Intelligence 4 Scrum 4 Software Project... 3 C# Kevin also knows about... 2 Private Cloud 2 Object Oriented Design 2 SOA 2 C++ Top Skills 13 Software Engineering 8 Agile Methodologies 7 Linux 6 Agile Project Management 6 Distributed Systems 5 Software Development 4 Business Intelligence 4 Scrum 4 Software Project... 3 C# Kevin also knows about... 2 Private Cloud 2 Object Oriented Design 2 SOA 2 C++ Top Skills 13 Software Engineering 8 Agile Methodologies 7 Linux 6 Agile Project Management 6 Distributed Systems 5 Software Development 4 Business Intelligence 4 Scrum 4 Software Project... 3 C# Kevin also knows about... 2 Private Cloud 2 Object Oriented Design 2 SOA 2 C++                     2 Private Cloud 2 Object Oriented Design 2 SOA 2 C++ Education Nanjing University Master,  Software Engineer 2007  – 2009 M.S. Software Engineering: IDS (Intrusion Detection System) based on Snort, Business Intelligence over SOA Nanjing University Bachelor,  Software Engineering 2003  – 2007 Nanjing University Master,  Software Engineer 2007  – 2009 M.S. Software Engineering: IDS (Intrusion Detection System) based on Snort, Business Intelligence over SOA Nanjing University Master,  Software Engineer 2007  – 2009 M.S. Software Engineering: IDS (Intrusion Detection System) based on Snort, Business Intelligence over SOA Nanjing University Master,  Software Engineer 2007  – 2009 M.S. Software Engineering: IDS (Intrusion Detection System) based on Snort, Business Intelligence over SOA Nanjing University Bachelor,  Software Engineering 2003  – 2007 Nanjing University Bachelor,  Software Engineering 2003  – 2007 Nanjing University Bachelor,  Software Engineering 2003  – 2007 ", "Languages   Skills Skills     Education Project Management Institute PMP- Credential,  Project Management 2008  – 2008 Keller Graduate School MBA,  Business Administration/Project Management 2005  – 2007 Graduated with Honors \nGraduate Certificate in Project Management (Open) 1 recommendation Sanjel Mishra, MBA Operations Leader Robert has excellent leadership abilities and posses a great sense in pride for his work. He is very savy with MS Office Products. He was a critical part in the accomplishement of our projects. View University of Denver BA,  Communications 1990  – 1995 Project Management Institute PMP- Credential,  Project Management 2008  – 2008 Project Management Institute PMP- Credential,  Project Management 2008  – 2008 Project Management Institute PMP- Credential,  Project Management 2008  – 2008 Keller Graduate School MBA,  Business Administration/Project Management 2005  – 2007 Graduated with Honors \nGraduate Certificate in Project Management (Open) 1 recommendation Sanjel Mishra, MBA Operations Leader Robert has excellent leadership abilities and posses a great sense in pride for his work. He is very savy with MS Office Products. He was a critical part in the accomplishement of our projects. View Keller Graduate School MBA,  Business Administration/Project Management 2005  – 2007 Graduated with Honors \nGraduate Certificate in Project Management (Open) 1 recommendation Sanjel Mishra, MBA Operations Leader Robert has excellent leadership abilities and posses a great sense in pride for his work. He is very savy with MS Office Products. He was a critical part in the accomplishement of our projects. View Keller Graduate School MBA,  Business Administration/Project Management 2005  – 2007 Graduated with Honors \nGraduate Certificate in Project Management (Open) 1 recommendation Sanjel Mishra, MBA Operations Leader Robert has excellent leadership abilities and posses a great sense in pride for his work. He is very savy with MS Office Products. He was a critical part in the accomplishement of our projects. View University of Denver BA,  Communications 1990  – 1995 University of Denver BA,  Communications 1990  – 1995 University of Denver BA,  Communications 1990  – 1995 Honors & Awards ", "Experience Information Technology Manager Intel Corporation Information Technology Manager Intel Corporation Information Technology Manager Intel Corporation Skills Top Skills 6 Semiconductors 5 Intel 4 Cross-functional Team... 3 Process Improvement 2 Process Engineering 2 Six Sigma 2 Program Management 1 Design of Experiments 1 SPC 1 Software Development Ricardo P also knows about... 1 Troubleshooting Skills  Top Skills 6 Semiconductors 5 Intel 4 Cross-functional Team... 3 Process Improvement 2 Process Engineering 2 Six Sigma 2 Program Management 1 Design of Experiments 1 SPC 1 Software Development Ricardo P also knows about... 1 Troubleshooting Top Skills 6 Semiconductors 5 Intel 4 Cross-functional Team... 3 Process Improvement 2 Process Engineering 2 Six Sigma 2 Program Management 1 Design of Experiments 1 SPC 1 Software Development Ricardo P also knows about... 1 Troubleshooting Top Skills 6 Semiconductors 5 Intel 4 Cross-functional Team... 3 Process Improvement 2 Process Engineering 2 Six Sigma 2 Program Management 1 Design of Experiments 1 SPC 1 Software Development Ricardo P also knows about... 1 Troubleshooting                     1 Troubleshooting Education The University of Texas-Pan American 1992  – 1996 The University of Texas-Pan American 1992  – 1996 The University of Texas-Pan American 1992  – 1996 The University of Texas-Pan American 1992  – 1996 ", "Experience Information Technology Manager Intel Corporation June 2000  – Present (15 years 3 months) Financial Analyst CDI Corporation February 2000  –  June 2000  (5 months) Pricing and Contract Anaylst Parker Hannifin December 1997  –  November 1999  (2 years) Information Technology Manager Intel Corporation June 2000  – Present (15 years 3 months) Information Technology Manager Intel Corporation June 2000  – Present (15 years 3 months) Financial Analyst CDI Corporation February 2000  –  June 2000  (5 months) Financial Analyst CDI Corporation February 2000  –  June 2000  (5 months) Pricing and Contract Anaylst Parker Hannifin December 1997  –  November 1999  (2 years) Pricing and Contract Anaylst Parker Hannifin December 1997  –  November 1999  (2 years) Skills Top Skills 5 Cross-functional Team... 3 Program Management 1 Software Project... 1 Integration 1 Project Management 0 Process Improvement 0 Management 0 Vendor Management 0 Business Analysis 0 Software Development Skills  Top Skills 5 Cross-functional Team... 3 Program Management 1 Software Project... 1 Integration 1 Project Management 0 Process Improvement 0 Management 0 Vendor Management 0 Business Analysis 0 Software Development Top Skills 5 Cross-functional Team... 3 Program Management 1 Software Project... 1 Integration 1 Project Management 0 Process Improvement 0 Management 0 Vendor Management 0 Business Analysis 0 Software Development Top Skills 5 Cross-functional Team... 3 Program Management 1 Software Project... 1 Integration 1 Project Management 0 Process Improvement 0 Management 0 Vendor Management 0 Business Analysis 0 Software Development                     Education University of Utah Bachelor's Degree,  Accounting University of Utah Bachelor's Degree,  Accounting University of Utah Bachelor's Degree,  Accounting University of Utah Bachelor's Degree,  Accounting ", "Skills Top Skills 35 Perl 32 Security 30 Firewalls 16 Intel 15 Security Architecture... 15 System Architecture 13 Network Security 9 PHP 9 Shell Scripting 8 TCP/IP Ken also knows about... 8 Computer Security 8 Data Center 7 Network Architecture 6 Debugging 5 Programming 5 Unix 5 Integration 5 Hardware 4 Semiconductors 4 Computer Architecture 3 Internet Security 3 Information Security 2 Linux 1 Website Building 1 Information Security... 1 Servers 1 Systems Engineering 0 Website Construction See 3+     See less Skills  Top Skills 35 Perl 32 Security 30 Firewalls 16 Intel 15 Security Architecture... 15 System Architecture 13 Network Security 9 PHP 9 Shell Scripting 8 TCP/IP Ken also knows about... 8 Computer Security 8 Data Center 7 Network Architecture 6 Debugging 5 Programming 5 Unix 5 Integration 5 Hardware 4 Semiconductors 4 Computer Architecture 3 Internet Security 3 Information Security 2 Linux 1 Website Building 1 Information Security... 1 Servers 1 Systems Engineering 0 Website Construction See 3+     See less Top Skills 35 Perl 32 Security 30 Firewalls 16 Intel 15 Security Architecture... 15 System Architecture 13 Network Security 9 PHP 9 Shell Scripting 8 TCP/IP Ken also knows about... 8 Computer Security 8 Data Center 7 Network Architecture 6 Debugging 5 Programming 5 Unix 5 Integration 5 Hardware 4 Semiconductors 4 Computer Architecture 3 Internet Security 3 Information Security 2 Linux 1 Website Building 1 Information Security... 1 Servers 1 Systems Engineering 0 Website Construction See 3+     See less Top Skills 35 Perl 32 Security 30 Firewalls 16 Intel 15 Security Architecture... 15 System Architecture 13 Network Security 9 PHP 9 Shell Scripting 8 TCP/IP Ken also knows about... 8 Computer Security 8 Data Center 7 Network Architecture 6 Debugging 5 Programming 5 Unix 5 Integration 5 Hardware 4 Semiconductors 4 Computer Architecture 3 Internet Security 3 Information Security 2 Linux 1 Website Building 1 Information Security... 1 Servers 1 Systems Engineering 0 Website Construction See 3+     See less                     8 Computer Security 8 Data Center 7 Network Architecture 6 Debugging 5 Programming 5 Unix 5 Integration 5 Hardware 4 Semiconductors 4 Computer Architecture 3 Internet Security 3 Information Security 2 Linux 1 Website Building 1 Information Security... 1 Servers 1 Systems Engineering 0 Website Construction Honors & Awards ", "Experience Information Technology Manager Intel Corporation July 2015  – Present (2 months) Bengaluru Area, India Info Tech Manager(People Manager) for Supply Planning Team (July 2015 onwards) \n Design Team Lead for enabling Transportation Management/Warehousing in Supply Chain IT Intel Corporation January 2013  –  June 2015  (2 years 6 months) Bengaluru Area, India Designing and Implementing Solutions in SAP in Logistics functionality in TM and WM for Distribution Network of Intel Functional Lead for SAP Projects in Intel Supply Chain Intel June 2009  –  March 2012  (2 years 10 months) Designing and Implementing IT Solutions in SAP for Intel Supply Chain QM Specialist QM Specialist in SAP Labs India Pvt Limited May 2004  –  July 2005  (1 year 3 months) AUtomation of Testing efforts for the Logistics Domain Information Technology Manager Intel Corporation July 2015  – Present (2 months) Bengaluru Area, India Info Tech Manager(People Manager) for Supply Planning Team (July 2015 onwards) \n Information Technology Manager Intel Corporation July 2015  – Present (2 months) Bengaluru Area, India Info Tech Manager(People Manager) for Supply Planning Team (July 2015 onwards) \n Design Team Lead for enabling Transportation Management/Warehousing in Supply Chain IT Intel Corporation January 2013  –  June 2015  (2 years 6 months) Bengaluru Area, India Designing and Implementing Solutions in SAP in Logistics functionality in TM and WM for Distribution Network of Intel Design Team Lead for enabling Transportation Management/Warehousing in Supply Chain IT Intel Corporation January 2013  –  June 2015  (2 years 6 months) Bengaluru Area, India Designing and Implementing Solutions in SAP in Logistics functionality in TM and WM for Distribution Network of Intel Functional Lead for SAP Projects in Intel Supply Chain Intel June 2009  –  March 2012  (2 years 10 months) Designing and Implementing IT Solutions in SAP for Intel Supply Chain Functional Lead for SAP Projects in Intel Supply Chain Intel June 2009  –  March 2012  (2 years 10 months) Designing and Implementing IT Solutions in SAP for Intel Supply Chain QM Specialist QM Specialist in SAP Labs India Pvt Limited May 2004  –  July 2005  (1 year 3 months) AUtomation of Testing efforts for the Logistics Domain QM Specialist QM Specialist in SAP Labs India Pvt Limited May 2004  –  July 2005  (1 year 3 months) AUtomation of Testing efforts for the Logistics Domain Skills Top Skills 2 SAP 1 Testing 1 Supply Chain 1 Logistics 1 Quality Management 1 Software Project... 1 Requirements Analysis 1 Supply Chain Management 1 Business Analysis 1 Business Process Ramesh also knows about... 1 Requirements Gathering 0 ERP 0 Program Management 0 SDLC 0 Product Management Skills  Top Skills 2 SAP 1 Testing 1 Supply Chain 1 Logistics 1 Quality Management 1 Software Project... 1 Requirements Analysis 1 Supply Chain Management 1 Business Analysis 1 Business Process Ramesh also knows about... 1 Requirements Gathering 0 ERP 0 Program Management 0 SDLC 0 Product Management Top Skills 2 SAP 1 Testing 1 Supply Chain 1 Logistics 1 Quality Management 1 Software Project... 1 Requirements Analysis 1 Supply Chain Management 1 Business Analysis 1 Business Process Ramesh also knows about... 1 Requirements Gathering 0 ERP 0 Program Management 0 SDLC 0 Product Management Top Skills 2 SAP 1 Testing 1 Supply Chain 1 Logistics 1 Quality Management 1 Software Project... 1 Requirements Analysis 1 Supply Chain Management 1 Business Analysis 1 Business Process Ramesh also knows about... 1 Requirements Gathering 0 ERP 0 Program Management 0 SDLC 0 Product Management                     1 Requirements Gathering 0 ERP 0 Program Management 0 SDLC 0 Product Management Education Raja college of Engineering and Tech, Madurai Bachelor of Engineering (BE),  ECE 1997  – 2001 Activities and Societies:  BE TVS Lakshmi MHSS Higher Secondary 1996  – 1997 Raja college of Engineering and Tech, Madurai Bachelor of Engineering (BE),  ECE 1997  – 2001 Activities and Societies:  BE Raja college of Engineering and Tech, Madurai Bachelor of Engineering (BE),  ECE 1997  – 2001 Activities and Societies:  BE Raja college of Engineering and Tech, Madurai Bachelor of Engineering (BE),  ECE 1997  – 2001 Activities and Societies:  BE TVS Lakshmi MHSS Higher Secondary 1996  – 1997 TVS Lakshmi MHSS Higher Secondary 1996  – 1997 TVS Lakshmi MHSS Higher Secondary 1996  – 1997 ", "Summary Over 16 years of Industry experience in handling global operations, managing geographically dispersed teams, and leading multiple functions. Strong mix of academic and professional experience demonstrated through the management of successful projects, balanced people management skills, and compassionate coaching/instruction experience. Excellent communication skills, with emphasis on building strong client relationships; self-motivated team player and mentor, outstanding organizational skills, and results oriented. Summary Over 16 years of Industry experience in handling global operations, managing geographically dispersed teams, and leading multiple functions. Strong mix of academic and professional experience demonstrated through the management of successful projects, balanced people management skills, and compassionate coaching/instruction experience. Excellent communication skills, with emphasis on building strong client relationships; self-motivated team player and mentor, outstanding organizational skills, and results oriented. Over 16 years of Industry experience in handling global operations, managing geographically dispersed teams, and leading multiple functions. Strong mix of academic and professional experience demonstrated through the management of successful projects, balanced people management skills, and compassionate coaching/instruction experience. Excellent communication skills, with emphasis on building strong client relationships; self-motivated team player and mentor, outstanding organizational skills, and results oriented. Over 16 years of Industry experience in handling global operations, managing geographically dispersed teams, and leading multiple functions. Strong mix of academic and professional experience demonstrated through the management of successful projects, balanced people management skills, and compassionate coaching/instruction experience. Excellent communication skills, with emphasis on building strong client relationships; self-motivated team player and mentor, outstanding organizational skills, and results oriented. Experience Project Manager, Certified Leadership Coach Intel 2010  – Present (5 years) Folsom, CA, USA Certified Leadership Coach under Internal Leadership Coaching program at Intel, coached multiple Intel employees across multiple geos with excellent feedback. Certified instructor for internal courses as well vendor-led courses - Delivered 135+ internal sessions over last five years (Jan’09 onwards) with instructor feedback of 90% or higher. Recognized as top 5% instructors across Intel during 2009, 2010, and 2012, and Instructor of the Year for 2011 and 2013. Information Technology Manager Intel Corporation 2005  –  2009  (4 years) Folsom, CA Managed a team of 14+ systems engineers spread across 7 sites to deliver Windows Server and Database engineering support to design teams spread across Intel. Engineering Computing TCE (Total Customer Experience) role for the key design teams. Multiple International Assignments Intel Corporation 2004  –  2007  (3 years) Bangalore, India Successfully completed three assignments in Bangalore including multiple management roles. Dalvinder value added by having in-depth knowledge of EC environment, India culture background and seasoned management experience. Information Technology Manager Intel Corporation 2002  –  2005  (3 years) Folsom, CA Manage a team of 7+ software engineers to develop and support design / validation tracking software. Program-manage cross functional work groups to prioritize business needs and translate business needs into technical solutions. Develop metrics to measure and improve supportability and support quality. Project Manager, Certified Leadership Coach Intel 2010  – Present (5 years) Folsom, CA, USA Certified Leadership Coach under Internal Leadership Coaching program at Intel, coached multiple Intel employees across multiple geos with excellent feedback. Certified instructor for internal courses as well vendor-led courses - Delivered 135+ internal sessions over last five years (Jan’09 onwards) with instructor feedback of 90% or higher. Recognized as top 5% instructors across Intel during 2009, 2010, and 2012, and Instructor of the Year for 2011 and 2013. Project Manager, Certified Leadership Coach Intel 2010  – Present (5 years) Folsom, CA, USA Certified Leadership Coach under Internal Leadership Coaching program at Intel, coached multiple Intel employees across multiple geos with excellent feedback. Certified instructor for internal courses as well vendor-led courses - Delivered 135+ internal sessions over last five years (Jan’09 onwards) with instructor feedback of 90% or higher. Recognized as top 5% instructors across Intel during 2009, 2010, and 2012, and Instructor of the Year for 2011 and 2013. Information Technology Manager Intel Corporation 2005  –  2009  (4 years) Folsom, CA Managed a team of 14+ systems engineers spread across 7 sites to deliver Windows Server and Database engineering support to design teams spread across Intel. Engineering Computing TCE (Total Customer Experience) role for the key design teams. Information Technology Manager Intel Corporation 2005  –  2009  (4 years) Folsom, CA Managed a team of 14+ systems engineers spread across 7 sites to deliver Windows Server and Database engineering support to design teams spread across Intel. Engineering Computing TCE (Total Customer Experience) role for the key design teams. Multiple International Assignments Intel Corporation 2004  –  2007  (3 years) Bangalore, India Successfully completed three assignments in Bangalore including multiple management roles. Dalvinder value added by having in-depth knowledge of EC environment, India culture background and seasoned management experience. Multiple International Assignments Intel Corporation 2004  –  2007  (3 years) Bangalore, India Successfully completed three assignments in Bangalore including multiple management roles. Dalvinder value added by having in-depth knowledge of EC environment, India culture background and seasoned management experience. Information Technology Manager Intel Corporation 2002  –  2005  (3 years) Folsom, CA Manage a team of 7+ software engineers to develop and support design / validation tracking software. Program-manage cross functional work groups to prioritize business needs and translate business needs into technical solutions. Develop metrics to measure and improve supportability and support quality. Information Technology Manager Intel Corporation 2002  –  2005  (3 years) Folsom, CA Manage a team of 7+ software engineers to develop and support design / validation tracking software. Program-manage cross functional work groups to prioritize business needs and translate business needs into technical solutions. Develop metrics to measure and improve supportability and support quality. Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 41 Program Management 31 Cross-functional Team... 17 Software Project... 16 Project Management 14 Management 11 Software Development 8 Perl 8 Computer Architecture 6 Process Improvement 5 Intel Dalvinder also knows about... 5 SDLC 3 Vendor Management 3 Team Leadership 3 PMP 2 IT Strategy 1 Semiconductors Skills  Top Skills 41 Program Management 31 Cross-functional Team... 17 Software Project... 16 Project Management 14 Management 11 Software Development 8 Perl 8 Computer Architecture 6 Process Improvement 5 Intel Dalvinder also knows about... 5 SDLC 3 Vendor Management 3 Team Leadership 3 PMP 2 IT Strategy 1 Semiconductors Top Skills 41 Program Management 31 Cross-functional Team... 17 Software Project... 16 Project Management 14 Management 11 Software Development 8 Perl 8 Computer Architecture 6 Process Improvement 5 Intel Dalvinder also knows about... 5 SDLC 3 Vendor Management 3 Team Leadership 3 PMP 2 IT Strategy 1 Semiconductors Top Skills 41 Program Management 31 Cross-functional Team... 17 Software Project... 16 Project Management 14 Management 11 Software Development 8 Perl 8 Computer Architecture 6 Process Improvement 5 Intel Dalvinder also knows about... 5 SDLC 3 Vendor Management 3 Team Leadership 3 PMP 2 IT Strategy 1 Semiconductors                     5 SDLC 3 Vendor Management 3 Team Leadership 3 PMP 2 IT Strategy 1 Semiconductors Education University of California, Davis - Graduate School of Management MBA,  General Management 1997  – 2000 University of Minnesota-Twin Cities MS,  Computer Science 1996  – 1998 Indian Institute of Technology, Roorkee BE,  Computer Science 1992  – 1996 University of California, Davis - Graduate School of Management MBA,  General Management 1997  – 2000 University of California, Davis - Graduate School of Management MBA,  General Management 1997  – 2000 University of California, Davis - Graduate School of Management MBA,  General Management 1997  – 2000 University of Minnesota-Twin Cities MS,  Computer Science 1996  – 1998 University of Minnesota-Twin Cities MS,  Computer Science 1996  – 1998 University of Minnesota-Twin Cities MS,  Computer Science 1996  – 1998 Indian Institute of Technology, Roorkee BE,  Computer Science 1992  – 1996 Indian Institute of Technology, Roorkee BE,  Computer Science 1992  – 1996 Indian Institute of Technology, Roorkee BE,  Computer Science 1992  – 1996 "]}