{"position": "Information Security Analyst", "company": "Intel Corporation", "profiles": ["Experience Information Security Analyst Intel Corporation January 2012  – Present (3 years 8 months) Information Security Analyst Intel Corporation January 2012  – Present (3 years 8 months) Information Security Analyst Intel Corporation January 2012  – Present (3 years 8 months) Skills Perl Microsoft SQL Server Unix Linux Troubleshooting Skills  Perl Microsoft SQL Server Unix Linux Troubleshooting Perl Microsoft SQL Server Unix Linux Troubleshooting Perl Microsoft SQL Server Unix Linux Troubleshooting ", "Summary I am a Senior Business student at Chico State University studying Management Information Systems. I would describe myself as a problem solver, a fast learner, and a leader with a strong interest in technology and its various uses in business. Summary I am a Senior Business student at Chico State University studying Management Information Systems. I would describe myself as a problem solver, a fast learner, and a leader with a strong interest in technology and its various uses in business. I am a Senior Business student at Chico State University studying Management Information Systems. I would describe myself as a problem solver, a fast learner, and a leader with a strong interest in technology and its various uses in business. I am a Senior Business student at Chico State University studying Management Information Systems. I would describe myself as a problem solver, a fast learner, and a leader with a strong interest in technology and its various uses in business. Experience Information Security Analyst Intel Corporation June 2015  –  August 2015  (3 months) Folsom, CA -Undergrad Systems Analyst Technical Intern working in Information Security Operations: Patching, Optimization, and Compliance Management.  \n-Worked Primarily in Enforcement: Getting internal Clients and Servers compliant with Intels Minumum Security Standards to prevent security breaches via cyber attacks. Information Security Analyst Intel Corporation June 2015  –  August 2015  (3 months) Folsom, CA -Undergrad Systems Analyst Technical Intern working in Information Security Operations: Patching, Optimization, and Compliance Management.  \n-Worked Primarily in Enforcement: Getting internal Clients and Servers compliant with Intels Minumum Security Standards to prevent security breaches via cyber attacks. Information Security Analyst Intel Corporation June 2015  –  August 2015  (3 months) Folsom, CA -Undergrad Systems Analyst Technical Intern working in Information Security Operations: Patching, Optimization, and Compliance Management.  \n-Worked Primarily in Enforcement: Getting internal Clients and Servers compliant with Intels Minumum Security Standards to prevent security breaches via cyber attacks. Languages English English English Skills Analytic Problem Solving Leadership Project Management Information Technology Information Security Microsoft Excel Microsoft Office Social Media SAP Customer Service Management Microsoft Word PowerPoint Research Skills  Analytic Problem Solving Leadership Project Management Information Technology Information Security Microsoft Excel Microsoft Office Social Media SAP Customer Service Management Microsoft Word PowerPoint Research Analytic Problem Solving Leadership Project Management Information Technology Information Security Microsoft Excel Microsoft Office Social Media SAP Customer Service Management Microsoft Word PowerPoint Research Analytic Problem Solving Leadership Project Management Information Technology Information Security Microsoft Excel Microsoft Office Social Media SAP Customer Service Management Microsoft Word PowerPoint Research Education California State University-Chico Business Information Systems, option in Management Information Systems,  Business Administration and Management , General 2014  – 2016 Activities and Societies:  Business Information Systems Society California State University-Chico Business Information Systems, option in Management Information Systems,  Business Administration and Management , General 2014  – 2016 Activities and Societies:  Business Information Systems Society California State University-Chico Business Information Systems, option in Management Information Systems,  Business Administration and Management , General 2014  – 2016 Activities and Societies:  Business Information Systems Society California State University-Chico Business Information Systems, option in Management Information Systems,  Business Administration and Management , General 2014  – 2016 Activities and Societies:  Business Information Systems Society ", "Summary Highly analytical, versatile and persuasive senior security analyst with 18 years experience in IT. Strengths include managing cross functional information security / IT programs, innovative problem solving and developing cost saving ideas. Also skilled in compliance auditing, project management, policy creation, assisting executive decision making, research and development. Looking to manage information security risk across an enterprise. Summary Highly analytical, versatile and persuasive senior security analyst with 18 years experience in IT. Strengths include managing cross functional information security / IT programs, innovative problem solving and developing cost saving ideas. Also skilled in compliance auditing, project management, policy creation, assisting executive decision making, research and development. Looking to manage information security risk across an enterprise. Highly analytical, versatile and persuasive senior security analyst with 18 years experience in IT. Strengths include managing cross functional information security / IT programs, innovative problem solving and developing cost saving ideas. Also skilled in compliance auditing, project management, policy creation, assisting executive decision making, research and development. Looking to manage information security risk across an enterprise. Highly analytical, versatile and persuasive senior security analyst with 18 years experience in IT. Strengths include managing cross functional information security / IT programs, innovative problem solving and developing cost saving ideas. Also skilled in compliance auditing, project management, policy creation, assisting executive decision making, research and development. Looking to manage information security risk across an enterprise. Experience Lead Information Security Analyst California ISO November 2006  – Present (8 years 10 months) Senior Information Security Analyst Intel Corporation February 1994  –  November 2006  (12 years 10 months) Lead Information Security Analyst California ISO November 2006  – Present (8 years 10 months) Lead Information Security Analyst California ISO November 2006  – Present (8 years 10 months) Senior Information Security Analyst Intel Corporation February 1994  –  November 2006  (12 years 10 months) Senior Information Security Analyst Intel Corporation February 1994  –  November 2006  (12 years 10 months) Skills CISSP Information Security CISA Information Security... Security NERC Vulnerability Assessment Skills  CISSP Information Security CISA Information Security... Security NERC Vulnerability Assessment CISSP Information Security CISA Information Security... Security NERC Vulnerability Assessment CISSP Information Security CISA Information Security... Security NERC Vulnerability Assessment ", "Experience Information Security Analyst Intel Corporation May 2015  – Present (4 months) Heredia Information Security Analyst Intel Corporation May 2015  – Present (4 months) Heredia Information Security Analyst Intel Corporation May 2015  – Present (4 months) Heredia Languages   Skills Skills     Honors & Awards ", "Experience Systems Analyst Intel Corporation September 2013  – Present (2 years) Systems Analyst Intel Corporation September 2013  – Present (2 years) Systems Analyst Intel Corporation September 2013  – Present (2 years) Languages Spanish Spanish Spanish Skills Process Improvement Computer Security Network Security Information Security Troubleshooting Security Hardware Program Management System Administration Information Security... Software Project... Integration Requirements Analysis SQL Business Analysis Business Process See 1+     See less Skills  Process Improvement Computer Security Network Security Information Security Troubleshooting Security Hardware Program Management System Administration Information Security... Software Project... Integration Requirements Analysis SQL Business Analysis Business Process See 1+     See less Process Improvement Computer Security Network Security Information Security Troubleshooting Security Hardware Program Management System Administration Information Security... Software Project... Integration Requirements Analysis SQL Business Analysis Business Process See 1+     See less Process Improvement Computer Security Network Security Information Security Troubleshooting Security Hardware Program Management System Administration Information Security... Software Project... Integration Requirements Analysis SQL Business Analysis Business Process See 1+     See less ", "Summary Currently seeking an opportunity to serve as a Compliance Analyst. Over eight years of experience building and managing effective, global compliance programs. Areas of expertise are in privacy and data security laws and regulations with exposure in other regulatory areas. Strong skills in strategic planning and establishing operational frameworks to achieve compliance objectives. Including the leadership, patience, persistence and interpersonal skills needed to carry out the program’s execution. Known for being results oriented, delivering quality results and performing with high integrity. Summary Currently seeking an opportunity to serve as a Compliance Analyst. Over eight years of experience building and managing effective, global compliance programs. Areas of expertise are in privacy and data security laws and regulations with exposure in other regulatory areas. Strong skills in strategic planning and establishing operational frameworks to achieve compliance objectives. Including the leadership, patience, persistence and interpersonal skills needed to carry out the program’s execution. Known for being results oriented, delivering quality results and performing with high integrity. Currently seeking an opportunity to serve as a Compliance Analyst. Over eight years of experience building and managing effective, global compliance programs. Areas of expertise are in privacy and data security laws and regulations with exposure in other regulatory areas. Strong skills in strategic planning and establishing operational frameworks to achieve compliance objectives. Including the leadership, patience, persistence and interpersonal skills needed to carry out the program’s execution. Known for being results oriented, delivering quality results and performing with high integrity. Currently seeking an opportunity to serve as a Compliance Analyst. Over eight years of experience building and managing effective, global compliance programs. Areas of expertise are in privacy and data security laws and regulations with exposure in other regulatory areas. Strong skills in strategic planning and establishing operational frameworks to achieve compliance objectives. Including the leadership, patience, persistence and interpersonal skills needed to carry out the program’s execution. Known for being results oriented, delivering quality results and performing with high integrity. Experience Staff Privacy Analyst Qualcomm May 2012  –  October 2014  (2 years 6 months) Greater San Diego Area Senior Privacy Analyst Intel Corporation February 2006  –  May 2012  (6 years 4 months) Virtual IT Security Service Engagement Manager Intel Corporation January 2003  –  January 2006  (3 years 1 month) Virtual Information Security Analyst Intel Corporation September 1995  –  January 2003  (7 years 5 months) Virtual Staff Privacy Analyst Qualcomm May 2012  –  October 2014  (2 years 6 months) Greater San Diego Area Staff Privacy Analyst Qualcomm May 2012  –  October 2014  (2 years 6 months) Greater San Diego Area Senior Privacy Analyst Intel Corporation February 2006  –  May 2012  (6 years 4 months) Virtual Senior Privacy Analyst Intel Corporation February 2006  –  May 2012  (6 years 4 months) Virtual IT Security Service Engagement Manager Intel Corporation January 2003  –  January 2006  (3 years 1 month) Virtual IT Security Service Engagement Manager Intel Corporation January 2003  –  January 2006  (3 years 1 month) Virtual Information Security Analyst Intel Corporation September 1995  –  January 2003  (7 years 5 months) Virtual Information Security Analyst Intel Corporation September 1995  –  January 2003  (7 years 5 months) Virtual Languages Spanish Spanish Spanish Skills Privacy Policies Program Management Information Security... Data Privacy Information Security Privacy Law Risk Assessment Disaster Recovery IT Strategy Information Security... Analysis Vendor Management Security Computer Security Governance Information Technology CISSP HIPAA Risk Management Strategy Training Management Integration Strategic Partnerships Process Improvement Networking Cross-functional Team... Leadership See 13+     See less Skills  Privacy Policies Program Management Information Security... Data Privacy Information Security Privacy Law Risk Assessment Disaster Recovery IT Strategy Information Security... Analysis Vendor Management Security Computer Security Governance Information Technology CISSP HIPAA Risk Management Strategy Training Management Integration Strategic Partnerships Process Improvement Networking Cross-functional Team... Leadership See 13+     See less Privacy Policies Program Management Information Security... Data Privacy Information Security Privacy Law Risk Assessment Disaster Recovery IT Strategy Information Security... Analysis Vendor Management Security Computer Security Governance Information Technology CISSP HIPAA Risk Management Strategy Training Management Integration Strategic Partnerships Process Improvement Networking Cross-functional Team... Leadership See 13+     See less Privacy Policies Program Management Information Security... Data Privacy Information Security Privacy Law Risk Assessment Disaster Recovery IT Strategy Information Security... Analysis Vendor Management Security Computer Security Governance Information Technology CISSP HIPAA Risk Management Strategy Training Management Integration Strategic Partnerships Process Improvement Networking Cross-functional Team... Leadership See 13+     See less ", "Experience Security Service Manager Emerson June 2013  – Present (2 years 3 months) Costa Rica Risk Manager Intel Corporation June 2011  –  June 2013  (2 years 1 month) Costa Rica Information Security Analyst Intel Corporation March 2006  –  June 2013  (7 years 4 months) Costa Rica Cisco TAC Support Engineer Sykes December 2004  –  March 2006  (1 year 4 months) Costa Rica Security Service Manager Emerson June 2013  – Present (2 years 3 months) Costa Rica Security Service Manager Emerson June 2013  – Present (2 years 3 months) Costa Rica Risk Manager Intel Corporation June 2011  –  June 2013  (2 years 1 month) Costa Rica Risk Manager Intel Corporation June 2011  –  June 2013  (2 years 1 month) Costa Rica Information Security Analyst Intel Corporation March 2006  –  June 2013  (7 years 4 months) Costa Rica Information Security Analyst Intel Corporation March 2006  –  June 2013  (7 years 4 months) Costa Rica Cisco TAC Support Engineer Sykes December 2004  –  March 2006  (1 year 4 months) Costa Rica Cisco TAC Support Engineer Sykes December 2004  –  March 2006  (1 year 4 months) Costa Rica Languages English Professional working proficiency Portuguese Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Portuguese Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Portuguese Professional working proficiency Spanish Native or bilingual proficiency Professional working proficiency Professional working proficiency Native or bilingual proficiency Skills Information Security Network Security IT Governance Team Leadership ITIL Process Risk Management Customer Service Service Management CISSP Product Management Cloud Security Negotiation Information Technology Business Continuity ITIL Skills  Information Security Network Security IT Governance Team Leadership ITIL Process Risk Management Customer Service Service Management CISSP Product Management Cloud Security Negotiation Information Technology Business Continuity ITIL Information Security Network Security IT Governance Team Leadership ITIL Process Risk Management Customer Service Service Management CISSP Product Management Cloud Security Negotiation Information Technology Business Continuity ITIL Information Security Network Security IT Governance Team Leadership ITIL Process Risk Management Customer Service Service Management CISSP Product Management Cloud Security Negotiation Information Technology Business Continuity ITIL Education Universidad Latina de Costa Rica Master of Business Administration (MBA) 2012  – 2014 Universidad Latina de Costa Rica Bachelor's Degree,  Engineering in Computer Systems 2001  – 2005 Universidad Latina de Costa Rica Master of Business Administration (MBA) 2012  – 2014 Universidad Latina de Costa Rica Master of Business Administration (MBA) 2012  – 2014 Universidad Latina de Costa Rica Master of Business Administration (MBA) 2012  – 2014 Universidad Latina de Costa Rica Bachelor's Degree,  Engineering in Computer Systems 2001  – 2005 Universidad Latina de Costa Rica Bachelor's Degree,  Engineering in Computer Systems 2001  – 2005 Universidad Latina de Costa Rica Bachelor's Degree,  Engineering in Computer Systems 2001  – 2005 ", "Skills Information Security Business Continuity Security Perl CISSP Network Security Intel System Architecture Computer Security TCP/IP Information Security... Linux Program Management Unix Data Center Virtualization Cross-functional Team... Cloud Computing Hardware Disaster Recovery See 5+     See less Skills  Information Security Business Continuity Security Perl CISSP Network Security Intel System Architecture Computer Security TCP/IP Information Security... Linux Program Management Unix Data Center Virtualization Cross-functional Team... Cloud Computing Hardware Disaster Recovery See 5+     See less Information Security Business Continuity Security Perl CISSP Network Security Intel System Architecture Computer Security TCP/IP Information Security... Linux Program Management Unix Data Center Virtualization Cross-functional Team... Cloud Computing Hardware Disaster Recovery See 5+     See less Information Security Business Continuity Security Perl CISSP Network Security Intel System Architecture Computer Security TCP/IP Information Security... Linux Program Management Unix Data Center Virtualization Cross-functional Team... Cloud Computing Hardware Disaster Recovery See 5+     See less ", "Summary Solid foundation in operations and customer relationship management. Extensive international assignment’s with diverse challenges. Ranging from start-up of global operations centers in Asia and USA to a Greenfield campus with two factories in China. Ability to listen, adapt and deliver are the qualities I bring with me. Consistently recognized for my creative solutions that deliver increased productivity for a customer or internal IT organization.  \nAbility to present technology value to operational support personnel and to senior directors. ‘Hands on” experience. Over 25 years in IT from delivering custom solutions for accounting software clients to coaching poor performing IT Operation’s teams to top tier performers.  \n \nSummary of qualifications: \n•\tDeliver results in ambiguous and audacious assignments  \n•\tTurn around projects and operation teams to success \n•\tWith minimum oversight thrive at any point on the globe \n•\tDiverse technical background with over 25 years in IT operations/sales \n•\tDeliver solutions that enable customers to accelerate their success \n \nSpecialties: IT Infrastructure and Applications Operations Management, process automation, ITIL service framework, Cloud/Virtualization, Infrastructure as a Service, Information Security, Project and data center management. Summary Solid foundation in operations and customer relationship management. Extensive international assignment’s with diverse challenges. Ranging from start-up of global operations centers in Asia and USA to a Greenfield campus with two factories in China. Ability to listen, adapt and deliver are the qualities I bring with me. Consistently recognized for my creative solutions that deliver increased productivity for a customer or internal IT organization.  \nAbility to present technology value to operational support personnel and to senior directors. ‘Hands on” experience. Over 25 years in IT from delivering custom solutions for accounting software clients to coaching poor performing IT Operation’s teams to top tier performers.  \n \nSummary of qualifications: \n•\tDeliver results in ambiguous and audacious assignments  \n•\tTurn around projects and operation teams to success \n•\tWith minimum oversight thrive at any point on the globe \n•\tDiverse technical background with over 25 years in IT operations/sales \n•\tDeliver solutions that enable customers to accelerate their success \n \nSpecialties: IT Infrastructure and Applications Operations Management, process automation, ITIL service framework, Cloud/Virtualization, Infrastructure as a Service, Information Security, Project and data center management. Solid foundation in operations and customer relationship management. Extensive international assignment’s with diverse challenges. Ranging from start-up of global operations centers in Asia and USA to a Greenfield campus with two factories in China. Ability to listen, adapt and deliver are the qualities I bring with me. Consistently recognized for my creative solutions that deliver increased productivity for a customer or internal IT organization.  \nAbility to present technology value to operational support personnel and to senior directors. ‘Hands on” experience. Over 25 years in IT from delivering custom solutions for accounting software clients to coaching poor performing IT Operation’s teams to top tier performers.  \n \nSummary of qualifications: \n•\tDeliver results in ambiguous and audacious assignments  \n•\tTurn around projects and operation teams to success \n•\tWith minimum oversight thrive at any point on the globe \n•\tDiverse technical background with over 25 years in IT operations/sales \n•\tDeliver solutions that enable customers to accelerate their success \n \nSpecialties: IT Infrastructure and Applications Operations Management, process automation, ITIL service framework, Cloud/Virtualization, Infrastructure as a Service, Information Security, Project and data center management. Solid foundation in operations and customer relationship management. Extensive international assignment’s with diverse challenges. Ranging from start-up of global operations centers in Asia and USA to a Greenfield campus with two factories in China. Ability to listen, adapt and deliver are the qualities I bring with me. Consistently recognized for my creative solutions that deliver increased productivity for a customer or internal IT organization.  \nAbility to present technology value to operational support personnel and to senior directors. ‘Hands on” experience. Over 25 years in IT from delivering custom solutions for accounting software clients to coaching poor performing IT Operation’s teams to top tier performers.  \n \nSummary of qualifications: \n•\tDeliver results in ambiguous and audacious assignments  \n•\tTurn around projects and operation teams to success \n•\tWith minimum oversight thrive at any point on the globe \n•\tDiverse technical background with over 25 years in IT operations/sales \n•\tDeliver solutions that enable customers to accelerate their success \n \nSpecialties: IT Infrastructure and Applications Operations Management, process automation, ITIL service framework, Cloud/Virtualization, Infrastructure as a Service, Information Security, Project and data center management. Experience Information Security Analyst Intel Corporation January 2015  – Present (8 months) Folsom, CA External Web Application Security Operations Team Open Cloud Operations Team Intel Corporation November 2012  – Present (2 years 10 months) Folsom, CA DevOps team supporting Puppet in Open Stack Instance Data Center Capacity Planner Intel Corporation May 2012  –  November 2012  (7 months) Foslom, CA Manage demand forecasts to enable delivery of Data Center Compute services Service Level Manager for Intel’s Internal Cloud Intel Corporation November 2009  –  June 2012  (2 years 8 months) Folsom, CA •\tDivision recognition award for server backup provisioning automation \n•\tDeveloped, measured and published service level objectives \n•\tLed Brown Bag sessions on value of Infrastructure as a Service  \n•\tOwner of Service Delivery Design manual for Internal Cloud IT eDiscovery Operations Intel Corporation October 2006  –  November 2009  (3 years 2 months) Folsom, CA Secure data collections using Guidance's EnCase tool set.to support Intel Legal’s litigation and internal investigations Site IT Manager - China Intel Corporation June 2005  –  March 2007  (1 year 10 months) Chengdu, Sichuan, China Greenfield site - start-up of two Assembly-Test factories, warehouse, and office building with IT infrastructure with zero IT excursions. \nAudit findings of the Chengdu IT infrastructure and processes were a level of maturity above two other factories sites with over 20 years of experience each. \nManaged the team supporting the site LAN, WAN, PBX, Data Center, WLAN, and Audio/Visual  \nCreated data center and IT infrastructure risk assessment with BCP plans. Incident Commander for IT Global Emergency Response Team Intel Corporation January 2003  –  June 2005  (2 years 6 months) Penang, Malaysia Incident Commander for managing global IT Emergency Response events to resolution. Including Cyber, Infrastructure, and Facilities. IT Server Infrastructure Manager Intel Corporation January 2003  –  June 2005  (2 years 6 months) Penang, Malaysia Managing a team supporting ~500 servers and four SAN environments at nine data centers Security Operations Center - Project Manager Intel Corporation January 2003  –  January 2004  (1 year 1 month) Penang, Malaysia Project manager for landing the Security Operation Center capability in the Malaysia. Onsite trainer for the IT Emergency Response process. Responsible for resolving Penang/Folsom Global Operations Center operational/cultural cross site support issues. Global Operations Manager - Remote Server Support Team Intel Corporation September 1997  –  December 2002  (5 years 4 months) Folsom, CA Global Operations Center: \nManager of remote server support team - resolving excursions related to OS, backups, connectivity, event management for a TAM of ~ 3000 servers Information Security Analyst Intel Corporation January 2015  – Present (8 months) Folsom, CA External Web Application Security Operations Team Information Security Analyst Intel Corporation January 2015  – Present (8 months) Folsom, CA External Web Application Security Operations Team Open Cloud Operations Team Intel Corporation November 2012  – Present (2 years 10 months) Folsom, CA DevOps team supporting Puppet in Open Stack Instance Open Cloud Operations Team Intel Corporation November 2012  – Present (2 years 10 months) Folsom, CA DevOps team supporting Puppet in Open Stack Instance Data Center Capacity Planner Intel Corporation May 2012  –  November 2012  (7 months) Foslom, CA Manage demand forecasts to enable delivery of Data Center Compute services Data Center Capacity Planner Intel Corporation May 2012  –  November 2012  (7 months) Foslom, CA Manage demand forecasts to enable delivery of Data Center Compute services Service Level Manager for Intel’s Internal Cloud Intel Corporation November 2009  –  June 2012  (2 years 8 months) Folsom, CA •\tDivision recognition award for server backup provisioning automation \n•\tDeveloped, measured and published service level objectives \n•\tLed Brown Bag sessions on value of Infrastructure as a Service  \n•\tOwner of Service Delivery Design manual for Internal Cloud Service Level Manager for Intel’s Internal Cloud Intel Corporation November 2009  –  June 2012  (2 years 8 months) Folsom, CA •\tDivision recognition award for server backup provisioning automation \n•\tDeveloped, measured and published service level objectives \n•\tLed Brown Bag sessions on value of Infrastructure as a Service  \n•\tOwner of Service Delivery Design manual for Internal Cloud IT eDiscovery Operations Intel Corporation October 2006  –  November 2009  (3 years 2 months) Folsom, CA Secure data collections using Guidance's EnCase tool set.to support Intel Legal’s litigation and internal investigations IT eDiscovery Operations Intel Corporation October 2006  –  November 2009  (3 years 2 months) Folsom, CA Secure data collections using Guidance's EnCase tool set.to support Intel Legal’s litigation and internal investigations Site IT Manager - China Intel Corporation June 2005  –  March 2007  (1 year 10 months) Chengdu, Sichuan, China Greenfield site - start-up of two Assembly-Test factories, warehouse, and office building with IT infrastructure with zero IT excursions. \nAudit findings of the Chengdu IT infrastructure and processes were a level of maturity above two other factories sites with over 20 years of experience each. \nManaged the team supporting the site LAN, WAN, PBX, Data Center, WLAN, and Audio/Visual  \nCreated data center and IT infrastructure risk assessment with BCP plans. Site IT Manager - China Intel Corporation June 2005  –  March 2007  (1 year 10 months) Chengdu, Sichuan, China Greenfield site - start-up of two Assembly-Test factories, warehouse, and office building with IT infrastructure with zero IT excursions. \nAudit findings of the Chengdu IT infrastructure and processes were a level of maturity above two other factories sites with over 20 years of experience each. \nManaged the team supporting the site LAN, WAN, PBX, Data Center, WLAN, and Audio/Visual  \nCreated data center and IT infrastructure risk assessment with BCP plans. Incident Commander for IT Global Emergency Response Team Intel Corporation January 2003  –  June 2005  (2 years 6 months) Penang, Malaysia Incident Commander for managing global IT Emergency Response events to resolution. Including Cyber, Infrastructure, and Facilities. Incident Commander for IT Global Emergency Response Team Intel Corporation January 2003  –  June 2005  (2 years 6 months) Penang, Malaysia Incident Commander for managing global IT Emergency Response events to resolution. Including Cyber, Infrastructure, and Facilities. IT Server Infrastructure Manager Intel Corporation January 2003  –  June 2005  (2 years 6 months) Penang, Malaysia Managing a team supporting ~500 servers and four SAN environments at nine data centers IT Server Infrastructure Manager Intel Corporation January 2003  –  June 2005  (2 years 6 months) Penang, Malaysia Managing a team supporting ~500 servers and four SAN environments at nine data centers Security Operations Center - Project Manager Intel Corporation January 2003  –  January 2004  (1 year 1 month) Penang, Malaysia Project manager for landing the Security Operation Center capability in the Malaysia. Onsite trainer for the IT Emergency Response process. Responsible for resolving Penang/Folsom Global Operations Center operational/cultural cross site support issues. Security Operations Center - Project Manager Intel Corporation January 2003  –  January 2004  (1 year 1 month) Penang, Malaysia Project manager for landing the Security Operation Center capability in the Malaysia. Onsite trainer for the IT Emergency Response process. Responsible for resolving Penang/Folsom Global Operations Center operational/cultural cross site support issues. Global Operations Manager - Remote Server Support Team Intel Corporation September 1997  –  December 2002  (5 years 4 months) Folsom, CA Global Operations Center: \nManager of remote server support team - resolving excursions related to OS, backups, connectivity, event management for a TAM of ~ 3000 servers Global Operations Manager - Remote Server Support Team Intel Corporation September 1997  –  December 2002  (5 years 4 months) Folsom, CA Global Operations Center: \nManager of remote server support team - resolving excursions related to OS, backups, connectivity, event management for a TAM of ~ 3000 servers Languages French Spanish French Spanish French Spanish Skills Project Management CISSP IT Operations ITIL IT Service Management Program Management IT Management Incident Management Vendor Management Data Center IT Strategy Virtualization Information Security Service Management Infrastructure Cloud Computing Cross-functional Team... Outsourcing Process Improvement Management Security ITIL Service Strategy Servers Disaster Recovery Operating Systems Computer Security Service Delivery Operations Management Integration Information Technology See 15+     See less Skills  Project Management CISSP IT Operations ITIL IT Service Management Program Management IT Management Incident Management Vendor Management Data Center IT Strategy Virtualization Information Security Service Management Infrastructure Cloud Computing Cross-functional Team... Outsourcing Process Improvement Management Security ITIL Service Strategy Servers Disaster Recovery Operating Systems Computer Security Service Delivery Operations Management Integration Information Technology See 15+     See less Project Management CISSP IT Operations ITIL IT Service Management Program Management IT Management Incident Management Vendor Management Data Center IT Strategy Virtualization Information Security Service Management Infrastructure Cloud Computing Cross-functional Team... Outsourcing Process Improvement Management Security ITIL Service Strategy Servers Disaster Recovery Operating Systems Computer Security Service Delivery Operations Management Integration Information Technology See 15+     See less Project Management CISSP IT Operations ITIL IT Service Management Program Management IT Management Incident Management Vendor Management Data Center IT Strategy Virtualization Information Security Service Management Infrastructure Cloud Computing Cross-functional Team... Outsourcing Process Improvement Management Security ITIL Service Strategy Servers Disaster Recovery Operating Systems Computer Security Service Delivery Operations Management Integration Information Technology See 15+     See less Education Franklin University Switzerland, Lugano, Switzerland AA,  International Business 1972  – 1974 Activities and Societies:  International Business Club Insitute de Francais, Villefranche-sur-Mer, France Fluency,  French language 1972  – 1974 Franklin University Switzerland, Lugano, Switzerland AA,  International Business 1972  – 1974 Activities and Societies:  International Business Club Franklin University Switzerland, Lugano, Switzerland AA,  International Business 1972  – 1974 Activities and Societies:  International Business Club Franklin University Switzerland, Lugano, Switzerland AA,  International Business 1972  – 1974 Activities and Societies:  International Business Club Insitute de Francais, Villefranche-sur-Mer, France Fluency,  French language 1972  – 1974 Insitute de Francais, Villefranche-sur-Mer, France Fluency,  French language 1972  – 1974 Insitute de Francais, Villefranche-sur-Mer, France Fluency,  French language 1972  – 1974 ", "Summary • Managed and Authored Corporate Risk Information Security Policy for Fortune 50 Transnational Corporation. \n• Engineered External Presence (DMZ) solutions for Enterprise Platforms.  \n• Designed and Deployed Trusted Zone Architecture for Global Business Networks. \n \nSpecialties: Information Security, External Presence & Trusted Zone Architecture, Social Media, Networking, Policy Summary • Managed and Authored Corporate Risk Information Security Policy for Fortune 50 Transnational Corporation. \n• Engineered External Presence (DMZ) solutions for Enterprise Platforms.  \n• Designed and Deployed Trusted Zone Architecture for Global Business Networks. \n \nSpecialties: Information Security, External Presence & Trusted Zone Architecture, Social Media, Networking, Policy • Managed and Authored Corporate Risk Information Security Policy for Fortune 50 Transnational Corporation. \n• Engineered External Presence (DMZ) solutions for Enterprise Platforms.  \n• Designed and Deployed Trusted Zone Architecture for Global Business Networks. \n \nSpecialties: Information Security, External Presence & Trusted Zone Architecture, Social Media, Networking, Policy • Managed and Authored Corporate Risk Information Security Policy for Fortune 50 Transnational Corporation. \n• Engineered External Presence (DMZ) solutions for Enterprise Platforms.  \n• Designed and Deployed Trusted Zone Architecture for Global Business Networks. \n \nSpecialties: Information Security, External Presence & Trusted Zone Architecture, Social Media, Networking, Policy Experience Enterprise Network Engineer F5 Networks February 2014  – Present (1 year 7 months) Portland, Oregon Area BigIP Access Technology Enterprise Network Engineer for Access Policy Management. \nSecurity Response Team Membership. Co-owner Wells & Verne May 2012  – Present (3 years 4 months) Portland, Oregon Area Co-owner and Operator of brick & mortar store focusing on Neo-Victorian, Gothic, Industrial and Steampunk fashion, apparel and accessories. Information Security Specialist Intel Corporation August 2010  –  July 2013  (3 years) Hillsboro, OR Overview: Specialist within the Information Risk and Security Management (IRSM) organization; member of the Secure Outsourcing and External Presence (SOEP) team within IRSM; Manage cross-functional teams/working groups. \n– Team lead for External Presence policy, architecture and governance review. \n– Distinguished as the corporate expert on External Presence governance program. \n– Project manager and primary author for External Presence Information Security Policy. \n– Security engagement leader for Offshore Development Centers, Business Partners and Subsidiaries. \n– Primary technical lead for the Firewall Technical Design Review governance review and landing process. \nKey Contributions: \n-\tRecognized Corporate Expert, External Presence Governance Program: Creation of customer application templates, security architecture engagements with developers, Security Development Lifecycle management with software program managers, security policy awareness training and technical design for a team that reviewed 900+ Internet/Intranet application changes during 2012. \n- Security Organizational Lead, Custom Security Solutions: Each project requires custom security architectural engineering for unique customer, partner, vendor, merger, acquisition or third-party joint project designs. Accountable for protecting intellectual property, ensuring joint development is promoted and maintaining confidentiality until the projects are publically announced. \n- External Presence Policy Completion: Led successful completion of Information Security Collateral Documents. Updated Remote Connectivity Policies to better align with current technologies and business direction. \n- Company-to-Company Sharing Security: Recognized Subject Matter Expert concerning all functions associated with the management of data sharing requests with partner companies. Partnered routinely with IT Legal on each request and led the appropriate acceptance of sharing agreements between departments and organizations. Information Security Analyst Intel Corporation November 2008  –  July 2010  (1 year 9 months) Hillsboro, OR Overview: Information Security Lead for Corporate Risk Information Security Policies, Waivers/Exceptions and Security Engagement Requests. \n– Oversee Information Security Policy for the entire corporation: Policy Life Cycle Management, Add/Modify/Change of Policy text, global organizational feedback, regular/ad-hoc review meetings. \n– Managed cross team managerial approval: Final policy publishing and delivering notifications of all changes to the corporate community. \nKey Contributions: \n-\tProvided annual training, tool access control, scheduling maintenance, hardware upgrade acquisitions and the fulfillment of staffing needs for software upgrades in support of a tool used for tracking all business approved temporary exceptions for Information Security Policy. \n-\tManaged ticketing systems for all Information Security Engagements for a 200+ person organization including routing and assigning engagements to the correct sub-teams, rerouting misrouted tickets, updating/realigning service queues after business unit reorganization and a ticketing tool upgrade — in addition to reporting ticket throughput metrics to management. Network Security Engineer Intel Corporation April 2000  –  October 2008  (8 years 7 months) Hillsboro, OR Overview: Network Operations Lead for Enterprise Application & Utility DMZ, Enclave & Trusted Zone architecture. Led projects including architecting and securing multi-tier technology for External Presence applications. \nKey Contributions: \n-\tNetwork Engineer contributing to multi-layered network segmentation designs for secure Internet accessible application deployments. \n-\tFrequent attendee of security conventions such as DefCon, ToorCon, CanSecWest and Chaos Communication Congress to keep current with the most recent technology vulnerabilities. Executive Producer Doppler Effect Records 1997  –  2002  (5 years) Portland, OR Released obscure electronic music focusing on Pacific Northwest & UK artists. UNIX Security Engineer Intel Corporation June 1996  –  March 2000  (3 years 10 months) Hillsboro, OR Overview: Operations Lead for complex computing infrastructure of interconnected UNIX workstations and file servers. \nKey Contributions: \n-\tDevelopment support for world’s first Teraflop super computer, ASCII Red, which debuted on December 11, 1996. \n-\tDeployed common workstation builds, with extensive patch management, data backup and recovery. \n-\tBuilt, maintained and managed common tools suites utilized across multiple platforms with version controls. Unix System Administration Caterpillar Corporation June 1994  –  May 1996  (2 years) Computing Consultant Purdue University May 1993  –  April 1995  (2 years) Enterprise Network Engineer F5 Networks February 2014  – Present (1 year 7 months) Portland, Oregon Area BigIP Access Technology Enterprise Network Engineer for Access Policy Management. \nSecurity Response Team Membership. Enterprise Network Engineer F5 Networks February 2014  – Present (1 year 7 months) Portland, Oregon Area BigIP Access Technology Enterprise Network Engineer for Access Policy Management. \nSecurity Response Team Membership. Co-owner Wells & Verne May 2012  – Present (3 years 4 months) Portland, Oregon Area Co-owner and Operator of brick & mortar store focusing on Neo-Victorian, Gothic, Industrial and Steampunk fashion, apparel and accessories. Co-owner Wells & Verne May 2012  – Present (3 years 4 months) Portland, Oregon Area Co-owner and Operator of brick & mortar store focusing on Neo-Victorian, Gothic, Industrial and Steampunk fashion, apparel and accessories. Information Security Specialist Intel Corporation August 2010  –  July 2013  (3 years) Hillsboro, OR Overview: Specialist within the Information Risk and Security Management (IRSM) organization; member of the Secure Outsourcing and External Presence (SOEP) team within IRSM; Manage cross-functional teams/working groups. \n– Team lead for External Presence policy, architecture and governance review. \n– Distinguished as the corporate expert on External Presence governance program. \n– Project manager and primary author for External Presence Information Security Policy. \n– Security engagement leader for Offshore Development Centers, Business Partners and Subsidiaries. \n– Primary technical lead for the Firewall Technical Design Review governance review and landing process. \nKey Contributions: \n-\tRecognized Corporate Expert, External Presence Governance Program: Creation of customer application templates, security architecture engagements with developers, Security Development Lifecycle management with software program managers, security policy awareness training and technical design for a team that reviewed 900+ Internet/Intranet application changes during 2012. \n- Security Organizational Lead, Custom Security Solutions: Each project requires custom security architectural engineering for unique customer, partner, vendor, merger, acquisition or third-party joint project designs. Accountable for protecting intellectual property, ensuring joint development is promoted and maintaining confidentiality until the projects are publically announced. \n- External Presence Policy Completion: Led successful completion of Information Security Collateral Documents. Updated Remote Connectivity Policies to better align with current technologies and business direction. \n- Company-to-Company Sharing Security: Recognized Subject Matter Expert concerning all functions associated with the management of data sharing requests with partner companies. Partnered routinely with IT Legal on each request and led the appropriate acceptance of sharing agreements between departments and organizations. Information Security Specialist Intel Corporation August 2010  –  July 2013  (3 years) Hillsboro, OR Overview: Specialist within the Information Risk and Security Management (IRSM) organization; member of the Secure Outsourcing and External Presence (SOEP) team within IRSM; Manage cross-functional teams/working groups. \n– Team lead for External Presence policy, architecture and governance review. \n– Distinguished as the corporate expert on External Presence governance program. \n– Project manager and primary author for External Presence Information Security Policy. \n– Security engagement leader for Offshore Development Centers, Business Partners and Subsidiaries. \n– Primary technical lead for the Firewall Technical Design Review governance review and landing process. \nKey Contributions: \n-\tRecognized Corporate Expert, External Presence Governance Program: Creation of customer application templates, security architecture engagements with developers, Security Development Lifecycle management with software program managers, security policy awareness training and technical design for a team that reviewed 900+ Internet/Intranet application changes during 2012. \n- Security Organizational Lead, Custom Security Solutions: Each project requires custom security architectural engineering for unique customer, partner, vendor, merger, acquisition or third-party joint project designs. Accountable for protecting intellectual property, ensuring joint development is promoted and maintaining confidentiality until the projects are publically announced. \n- External Presence Policy Completion: Led successful completion of Information Security Collateral Documents. Updated Remote Connectivity Policies to better align with current technologies and business direction. \n- Company-to-Company Sharing Security: Recognized Subject Matter Expert concerning all functions associated with the management of data sharing requests with partner companies. Partnered routinely with IT Legal on each request and led the appropriate acceptance of sharing agreements between departments and organizations. Information Security Analyst Intel Corporation November 2008  –  July 2010  (1 year 9 months) Hillsboro, OR Overview: Information Security Lead for Corporate Risk Information Security Policies, Waivers/Exceptions and Security Engagement Requests. \n– Oversee Information Security Policy for the entire corporation: Policy Life Cycle Management, Add/Modify/Change of Policy text, global organizational feedback, regular/ad-hoc review meetings. \n– Managed cross team managerial approval: Final policy publishing and delivering notifications of all changes to the corporate community. \nKey Contributions: \n-\tProvided annual training, tool access control, scheduling maintenance, hardware upgrade acquisitions and the fulfillment of staffing needs for software upgrades in support of a tool used for tracking all business approved temporary exceptions for Information Security Policy. \n-\tManaged ticketing systems for all Information Security Engagements for a 200+ person organization including routing and assigning engagements to the correct sub-teams, rerouting misrouted tickets, updating/realigning service queues after business unit reorganization and a ticketing tool upgrade — in addition to reporting ticket throughput metrics to management. Information Security Analyst Intel Corporation November 2008  –  July 2010  (1 year 9 months) Hillsboro, OR Overview: Information Security Lead for Corporate Risk Information Security Policies, Waivers/Exceptions and Security Engagement Requests. \n– Oversee Information Security Policy for the entire corporation: Policy Life Cycle Management, Add/Modify/Change of Policy text, global organizational feedback, regular/ad-hoc review meetings. \n– Managed cross team managerial approval: Final policy publishing and delivering notifications of all changes to the corporate community. \nKey Contributions: \n-\tProvided annual training, tool access control, scheduling maintenance, hardware upgrade acquisitions and the fulfillment of staffing needs for software upgrades in support of a tool used for tracking all business approved temporary exceptions for Information Security Policy. \n-\tManaged ticketing systems for all Information Security Engagements for a 200+ person organization including routing and assigning engagements to the correct sub-teams, rerouting misrouted tickets, updating/realigning service queues after business unit reorganization and a ticketing tool upgrade — in addition to reporting ticket throughput metrics to management. Network Security Engineer Intel Corporation April 2000  –  October 2008  (8 years 7 months) Hillsboro, OR Overview: Network Operations Lead for Enterprise Application & Utility DMZ, Enclave & Trusted Zone architecture. Led projects including architecting and securing multi-tier technology for External Presence applications. \nKey Contributions: \n-\tNetwork Engineer contributing to multi-layered network segmentation designs for secure Internet accessible application deployments. \n-\tFrequent attendee of security conventions such as DefCon, ToorCon, CanSecWest and Chaos Communication Congress to keep current with the most recent technology vulnerabilities. Network Security Engineer Intel Corporation April 2000  –  October 2008  (8 years 7 months) Hillsboro, OR Overview: Network Operations Lead for Enterprise Application & Utility DMZ, Enclave & Trusted Zone architecture. Led projects including architecting and securing multi-tier technology for External Presence applications. \nKey Contributions: \n-\tNetwork Engineer contributing to multi-layered network segmentation designs for secure Internet accessible application deployments. \n-\tFrequent attendee of security conventions such as DefCon, ToorCon, CanSecWest and Chaos Communication Congress to keep current with the most recent technology vulnerabilities. Executive Producer Doppler Effect Records 1997  –  2002  (5 years) Portland, OR Released obscure electronic music focusing on Pacific Northwest & UK artists. Executive Producer Doppler Effect Records 1997  –  2002  (5 years) Portland, OR Released obscure electronic music focusing on Pacific Northwest & UK artists. UNIX Security Engineer Intel Corporation June 1996  –  March 2000  (3 years 10 months) Hillsboro, OR Overview: Operations Lead for complex computing infrastructure of interconnected UNIX workstations and file servers. \nKey Contributions: \n-\tDevelopment support for world’s first Teraflop super computer, ASCII Red, which debuted on December 11, 1996. \n-\tDeployed common workstation builds, with extensive patch management, data backup and recovery. \n-\tBuilt, maintained and managed common tools suites utilized across multiple platforms with version controls. UNIX Security Engineer Intel Corporation June 1996  –  March 2000  (3 years 10 months) Hillsboro, OR Overview: Operations Lead for complex computing infrastructure of interconnected UNIX workstations and file servers. \nKey Contributions: \n-\tDevelopment support for world’s first Teraflop super computer, ASCII Red, which debuted on December 11, 1996. \n-\tDeployed common workstation builds, with extensive patch management, data backup and recovery. \n-\tBuilt, maintained and managed common tools suites utilized across multiple platforms with version controls. Unix System Administration Caterpillar Corporation June 1994  –  May 1996  (2 years) Unix System Administration Caterpillar Corporation June 1994  –  May 1996  (2 years) Computing Consultant Purdue University May 1993  –  April 1995  (2 years) Computing Consultant Purdue University May 1993  –  April 1995  (2 years) Skills Information Security Networking Social Media Security Linux Network Security Unix TCP/IP Troubleshooting System Administration Computer Security Operating Systems Computer Hardware Firewalls Skills  Information Security Networking Social Media Security Linux Network Security Unix TCP/IP Troubleshooting System Administration Computer Security Operating Systems Computer Hardware Firewalls Information Security Networking Social Media Security Linux Network Security Unix TCP/IP Troubleshooting System Administration Computer Security Operating Systems Computer Hardware Firewalls Information Security Networking Social Media Security Linux Network Security Unix TCP/IP Troubleshooting System Administration Computer Security Operating Systems Computer Hardware Firewalls Education Purdue University BS, AS,  Information Technology 1991  – 1996 KAMSC High School,  Mathematics & Science 1986  – 1991 Loy Norrix High School High School 1986  – 1991 Purdue University BS, AS,  Information Technology 1991  – 1996 Purdue University BS, AS,  Information Technology 1991  – 1996 Purdue University BS, AS,  Information Technology 1991  – 1996 KAMSC High School,  Mathematics & Science 1986  – 1991 KAMSC High School,  Mathematics & Science 1986  – 1991 KAMSC High School,  Mathematics & Science 1986  – 1991 Loy Norrix High School High School 1986  – 1991 Loy Norrix High School High School 1986  – 1991 Loy Norrix High School High School 1986  – 1991 ", "Summary Quick learner and eager of challenges, always looking to improve, driven for good results Summary Quick learner and eager of challenges, always looking to improve, driven for good results Quick learner and eager of challenges, always looking to improve, driven for good results Quick learner and eager of challenges, always looking to improve, driven for good results Experience Information Security Analyst Intel Corporation January 2014  – Present (1 year 8 months) Costa Rica Cyber Security Center \nInformation Security Analyst protect Company assets and intellectual property by developing, implementing, and enforcing information security directions and policies to be followed by employees throughout the corporation.  \nThis also includes maintaining (external) regulatory and (internal) protection compliance. With a solid understanding of information security in general and the specific behaviors that would secure Intel’s information assets and intellectual property. ISAs work in both proactive and reactive modes.  \nProactively, they anticipate information security challenges and provide solutions for them before they arise. Reactively, ISAs must respond to unanticipated incidents and security challenges as they arise. It is the ISA’s responsibility to determine when a situation merits a new policy or an update to an existing policy. IT Support Specialist Intel Corporation October 2006  –  December 2013  (7 years 3 months) •\tNew Business Landing: \no\tAssess and plan for new and existing applications or services to enter IT Support.  \no\tIdentify and assist with neutralizing potential high contact deployments into the Service Desk by involvement at planning level onward for IT projects. \no\tLeverage technology and process to alleviate problematic areas of doing business, partner with other organizations and business partners to find solutions. \n•\tSecond Level team member: \no\tIn charge of giving support to first level agents with any higher level issues that may arise when assisting customers. \no\tTaking care of escalations that cannot be handled by the first level agents because of the complexity of the case or when they come directly from management as they have to be taken as high priority. \no\tWork with business partners with the different tools available in the environment to report issues with them, for additional solutions and to keep the documentation updated. \no\tAlso in charge of developing new troubleshooting methods and updating the current ones in case of any room for improvement. \no\tPart of the training team in charge of delivering training to the new hires in different topics and also for new tools that are develop for the environment. \n•\tFirst Level Agent: \no\tCustomer service (general issues). \no\tTechnical support and troubleshooting. \no\tPerforming as Technical Lead. \no\tWorking in several departments TMG (Manufacturing Group) PDS (Platform Development Group) SMG (Sales and Marketing Group) PS (Product Specialization). \no\tProviding support on Office Applications, Windows OS, MAC OS, Networks including Wireless, VPN and Home Networks, Handheld devices such as BlackBerrys and PDAs and Intel specific applications for every group. Customer Service, Technical Support and QA Sykes April 2005  –  September 2006  (1 year 6 months) •\tCustomer service (general issues) \n•\tTechnical support and troubleshooting \n•\tPerforming as team lead \n•\tMember of the Quality Assurance team Customer Service and Technical Support Qualfon April 2004  –  April 2005  (1 year 1 month) •\tCustomer service (general issues) \n•\tTechnical support and troubleshooting \n•\tSales agent for phone airtime and equipment \n•\tSolving tickets in the warehouse department \n•\tPerforming as team lead Information Security Analyst Intel Corporation January 2014  – Present (1 year 8 months) Costa Rica Cyber Security Center \nInformation Security Analyst protect Company assets and intellectual property by developing, implementing, and enforcing information security directions and policies to be followed by employees throughout the corporation.  \nThis also includes maintaining (external) regulatory and (internal) protection compliance. With a solid understanding of information security in general and the specific behaviors that would secure Intel’s information assets and intellectual property. ISAs work in both proactive and reactive modes.  \nProactively, they anticipate information security challenges and provide solutions for them before they arise. Reactively, ISAs must respond to unanticipated incidents and security challenges as they arise. It is the ISA’s responsibility to determine when a situation merits a new policy or an update to an existing policy. Information Security Analyst Intel Corporation January 2014  – Present (1 year 8 months) Costa Rica Cyber Security Center \nInformation Security Analyst protect Company assets and intellectual property by developing, implementing, and enforcing information security directions and policies to be followed by employees throughout the corporation.  \nThis also includes maintaining (external) regulatory and (internal) protection compliance. With a solid understanding of information security in general and the specific behaviors that would secure Intel’s information assets and intellectual property. ISAs work in both proactive and reactive modes.  \nProactively, they anticipate information security challenges and provide solutions for them before they arise. Reactively, ISAs must respond to unanticipated incidents and security challenges as they arise. It is the ISA’s responsibility to determine when a situation merits a new policy or an update to an existing policy. IT Support Specialist Intel Corporation October 2006  –  December 2013  (7 years 3 months) •\tNew Business Landing: \no\tAssess and plan for new and existing applications or services to enter IT Support.  \no\tIdentify and assist with neutralizing potential high contact deployments into the Service Desk by involvement at planning level onward for IT projects. \no\tLeverage technology and process to alleviate problematic areas of doing business, partner with other organizations and business partners to find solutions. \n•\tSecond Level team member: \no\tIn charge of giving support to first level agents with any higher level issues that may arise when assisting customers. \no\tTaking care of escalations that cannot be handled by the first level agents because of the complexity of the case or when they come directly from management as they have to be taken as high priority. \no\tWork with business partners with the different tools available in the environment to report issues with them, for additional solutions and to keep the documentation updated. \no\tAlso in charge of developing new troubleshooting methods and updating the current ones in case of any room for improvement. \no\tPart of the training team in charge of delivering training to the new hires in different topics and also for new tools that are develop for the environment. \n•\tFirst Level Agent: \no\tCustomer service (general issues). \no\tTechnical support and troubleshooting. \no\tPerforming as Technical Lead. \no\tWorking in several departments TMG (Manufacturing Group) PDS (Platform Development Group) SMG (Sales and Marketing Group) PS (Product Specialization). \no\tProviding support on Office Applications, Windows OS, MAC OS, Networks including Wireless, VPN and Home Networks, Handheld devices such as BlackBerrys and PDAs and Intel specific applications for every group. IT Support Specialist Intel Corporation October 2006  –  December 2013  (7 years 3 months) •\tNew Business Landing: \no\tAssess and plan for new and existing applications or services to enter IT Support.  \no\tIdentify and assist with neutralizing potential high contact deployments into the Service Desk by involvement at planning level onward for IT projects. \no\tLeverage technology and process to alleviate problematic areas of doing business, partner with other organizations and business partners to find solutions. \n•\tSecond Level team member: \no\tIn charge of giving support to first level agents with any higher level issues that may arise when assisting customers. \no\tTaking care of escalations that cannot be handled by the first level agents because of the complexity of the case or when they come directly from management as they have to be taken as high priority. \no\tWork with business partners with the different tools available in the environment to report issues with them, for additional solutions and to keep the documentation updated. \no\tAlso in charge of developing new troubleshooting methods and updating the current ones in case of any room for improvement. \no\tPart of the training team in charge of delivering training to the new hires in different topics and also for new tools that are develop for the environment. \n•\tFirst Level Agent: \no\tCustomer service (general issues). \no\tTechnical support and troubleshooting. \no\tPerforming as Technical Lead. \no\tWorking in several departments TMG (Manufacturing Group) PDS (Platform Development Group) SMG (Sales and Marketing Group) PS (Product Specialization). \no\tProviding support on Office Applications, Windows OS, MAC OS, Networks including Wireless, VPN and Home Networks, Handheld devices such as BlackBerrys and PDAs and Intel specific applications for every group. Customer Service, Technical Support and QA Sykes April 2005  –  September 2006  (1 year 6 months) •\tCustomer service (general issues) \n•\tTechnical support and troubleshooting \n•\tPerforming as team lead \n•\tMember of the Quality Assurance team Customer Service, Technical Support and QA Sykes April 2005  –  September 2006  (1 year 6 months) •\tCustomer service (general issues) \n•\tTechnical support and troubleshooting \n•\tPerforming as team lead \n•\tMember of the Quality Assurance team Customer Service and Technical Support Qualfon April 2004  –  April 2005  (1 year 1 month) •\tCustomer service (general issues) \n•\tTechnical support and troubleshooting \n•\tSales agent for phone airtime and equipment \n•\tSolving tickets in the warehouse department \n•\tPerforming as team lead Customer Service and Technical Support Qualfon April 2004  –  April 2005  (1 year 1 month) •\tCustomer service (general issues) \n•\tTechnical support and troubleshooting \n•\tSales agent for phone airtime and equipment \n•\tSolving tickets in the warehouse department \n•\tPerforming as team lead Languages Spanish English Portuguese Spanish English Portuguese Spanish English Portuguese Skills •\tComputer knowledge:... •\tComputer knowledge:... Proactive Team work People-oriented Problem Solving Excellent Communication Capable of working... Teamwork Troubleshooting Software Documentation Technical Support Project Management IT Service Management VPN Windows System Administration Linux Wireless Windows Server Quality Assurance Training Team Leadership Process Improvement See 9+     See less Skills  •\tComputer knowledge:... •\tComputer knowledge:... Proactive Team work People-oriented Problem Solving Excellent Communication Capable of working... Teamwork Troubleshooting Software Documentation Technical Support Project Management IT Service Management VPN Windows System Administration Linux Wireless Windows Server Quality Assurance Training Team Leadership Process Improvement See 9+     See less •\tComputer knowledge:... •\tComputer knowledge:... Proactive Team work People-oriented Problem Solving Excellent Communication Capable of working... Teamwork Troubleshooting Software Documentation Technical Support Project Management IT Service Management VPN Windows System Administration Linux Wireless Windows Server Quality Assurance Training Team Leadership Process Improvement See 9+     See less •\tComputer knowledge:... •\tComputer knowledge:... Proactive Team work People-oriented Problem Solving Excellent Communication Capable of working... Teamwork Troubleshooting Software Documentation Technical Support Project Management IT Service Management VPN Windows System Administration Linux Wireless Windows Server Quality Assurance Training Team Leadership Process Improvement See 9+     See less Education Universidad Latina de Costa Rica Master's degree,  Networks and Telematics 2011  – 2012 ULACIT Licentiate degree,  Networks and Telematics 2009  – 2010 Universidad Latina de Costa Rica Master's degree,  Networks and Telematics 2011  – 2012 Universidad Latina de Costa Rica Master's degree,  Networks and Telematics 2011  – 2012 Universidad Latina de Costa Rica Master's degree,  Networks and Telematics 2011  – 2012 ULACIT Licentiate degree,  Networks and Telematics 2009  – 2010 ULACIT Licentiate degree,  Networks and Telematics 2009  – 2010 ULACIT Licentiate degree,  Networks and Telematics 2009  – 2010 ", "Summary Great sense of humor, hard worker, compromised with objectives, confident and a huge Code of Conduct feature Summary Great sense of humor, hard worker, compromised with objectives, confident and a huge Code of Conduct feature Great sense of humor, hard worker, compromised with objectives, confident and a huge Code of Conduct feature Great sense of humor, hard worker, compromised with objectives, confident and a huge Code of Conduct feature Experience Security Correlation Engineer IBM January 2015  – Present (8 months) Costa Rica • Perform analysis on security vendor Intrusion Detection and Prevention System (IDPS) signatures to capture data facets and group them appropriately  \n• Create and Manage correlation rules in Java for the dedicated Security Information and Event Management (SIEM) offering  \n• Work with engineering team to provide enhancements to correlation tools to optimize and improve how we detect and respond to cyber threats  \n• Work with security analysts to continually improve the correlation rule set to eliminate false positives and provide more granular method of attack detection  \n• Integrate our data analytics mission into day to day operations through our common tool set  \n• Provide assistance into the dedicated SIEM offering on correlation rules and attack patterns \n \n SIEM Threat Analysis IBM December 2013  – Present (1 year 9 months) Costa Rica IBM Security Operations Center (SOC) has Ricardo as SIEM Threat Analyst (Security Information and Event Management Analyst); an individual contributor to work within the IBM Costa Rica SOC. The SIEM Threat Analyst will be responsible for providing IT security services to clients within the IBM Security Services (ISS) Managed Security Services organization. As a member of a team, or working independently, this role will perform an analytical and technical role in implementation, integration and delivery of technical IT security solutions, specifically SIEM Solutions, for the assigned clients. This includes the use of inter-operational processes and procedures. Deliver high quality technical and/or consulting solutions to clients in response to security requirements. Perform multiple assigned technical tasks including system administration, monitoring, research, and analysis of the security solutions. This SIEM Threat Analysts will need to have network security product, technology, threat, vulnerability and MSS offering specialized skills. Using IT Security Industry experience, monitor client security systems and events to detect and investigate threats, and work regularly with client teams to enhance current solutions to improve client security posture. Ricardo must enhanced professional, operational and inter-personal skills to function effectively in collaborative high stakes and high stress situations with clients. He must possess skills that include strong networking, security technologies experience, strong understanding of security best practices, strong written and oral communications, must be detail oriented, must be customer focused and willing to work in a 24/7 shift environment. Information Security Analyst Intel Corporation August 2009  –  November 2013  (4 years 4 months) Costa Rica Information Security Specialists (ISSs) are responsible for protecting Intel’s assets and intellectual property by developing, implementing, and enforcing information security directions and policies to be followed by employees throughout the corporation. This also includes providing Incident Management support for the applications/systems based on service level agreements and supporting internal employees in security related matters. ISSs have a solid understanding of information security in general and the specific behaviors that would secure Intel’s information assets and intellectual property. ISSs may be engaged in special information security related projects as needed. ISSs must weigh individual employees’ or business units’ requirements and behaviors against Intel’s corporate information security needs based on existing policies. They must be strong problem solvers with the ability to methodically and objectively analyze and resolve information security challenges. ISSs work in both proactive and reactive modes. Proactively, they anticipate information security challenges and provide solutions for them before they arise. Reactively, ISSs must respond to unanticipated incidents and security challenges as they arise. IT NCSD (Networking Core Service Desk) Intel Corporation July 2008  –  August 2009  (1 year 2 months) Costa Rica Basic Networking support to Intel Co-Workers and Small Form Factors such as Handheld devices and its Operating Systems. Blackberry Manager support to these devices. IT TAC (Technical Assistance Center) Intel Corporation November 2006  –  August 2007  (10 months) Responsible for providing support to Internal Intel Co-Workers with Office and Collaboration tools. Provide VPN and Roaming Profile support. English Professor New Hope Bilingual High School January 2003  –  October 2006  (3 years 10 months) San Juan, Santa Barbara, Heredia, Costa Rica Ricardo was responsible of providing classes in the following fields: Literature, Conversation, Social Studies and Science. He was assigned Primary and Secondary groups. Warehouse Worker Mediterranean Marble December 2001  –  December 2002  (1 year 1 month) Naples, Florida Area Ricardo crafted and installed innovative and luxurious flooring, countertops, tub and fireplace surrounds, general slab work and exterior cladding in a variety of exquisite materials for high profile clients and numerous CEOs of fortune 500 companies, among others. The biggest projects Ricardo worked with were located in Navona and Moraya Bay. He provided to the company high discipline with extra mile work to finish the projects ahead time. Consejo Academico (CONSACA) Universidad Nacional de Costa Rica January 2001  –  December 2001  (1 year) Heredia, Costa Rica Ricardo was an Academic and Advisor Counselor at the Universidad Nacional. He had an on-going, intentional, educational partnership dedicated to student academic success. It was to his advantage to meet with students at least 4 times per month. Ricardo provided accurate and complete information about every students' request to the Dean and Vice Rectory. Ricardo was knowledgeable about university policies and could help students learn to make decisions about their college experience. Ricardo investigated degree programs and careers for assistance such as Scholarships and food tickets. Video Jockey and Bartender La Cascada Bar and Restaurant March 1999  –  December 2000  (1 year 10 months) Perez Zeledon, Costa Rica Ricardo innovated the opportunity to play music in a different way. He offered his system to provide music videos and have a different environment in the bar. This accomplishment generated more people to go to the bar, increasing sales to his owner (Douglas Flores). Also, he worked as bartender to provide very good service to Second Language clients. This helped Ricardo to have the chance to finish his studies and apply for another job. Sport's Seller (Tennis Shoes Area) 3E Sport Store December 1997  –  February 1998  (3 months) Perez Zeledon, Costa Rica Ricardo was responsible for having the inventory and sell for the sports area. This short period was done for vacation time only. He sold the whole inventory for 4 months in 3 weeks, making a very good commission and income for the store. Security Correlation Engineer IBM January 2015  – Present (8 months) Costa Rica • Perform analysis on security vendor Intrusion Detection and Prevention System (IDPS) signatures to capture data facets and group them appropriately  \n• Create and Manage correlation rules in Java for the dedicated Security Information and Event Management (SIEM) offering  \n• Work with engineering team to provide enhancements to correlation tools to optimize and improve how we detect and respond to cyber threats  \n• Work with security analysts to continually improve the correlation rule set to eliminate false positives and provide more granular method of attack detection  \n• Integrate our data analytics mission into day to day operations through our common tool set  \n• Provide assistance into the dedicated SIEM offering on correlation rules and attack patterns \n \n Security Correlation Engineer IBM January 2015  – Present (8 months) Costa Rica • Perform analysis on security vendor Intrusion Detection and Prevention System (IDPS) signatures to capture data facets and group them appropriately  \n• Create and Manage correlation rules in Java for the dedicated Security Information and Event Management (SIEM) offering  \n• Work with engineering team to provide enhancements to correlation tools to optimize and improve how we detect and respond to cyber threats  \n• Work with security analysts to continually improve the correlation rule set to eliminate false positives and provide more granular method of attack detection  \n• Integrate our data analytics mission into day to day operations through our common tool set  \n• Provide assistance into the dedicated SIEM offering on correlation rules and attack patterns \n \n SIEM Threat Analysis IBM December 2013  – Present (1 year 9 months) Costa Rica IBM Security Operations Center (SOC) has Ricardo as SIEM Threat Analyst (Security Information and Event Management Analyst); an individual contributor to work within the IBM Costa Rica SOC. The SIEM Threat Analyst will be responsible for providing IT security services to clients within the IBM Security Services (ISS) Managed Security Services organization. As a member of a team, or working independently, this role will perform an analytical and technical role in implementation, integration and delivery of technical IT security solutions, specifically SIEM Solutions, for the assigned clients. This includes the use of inter-operational processes and procedures. Deliver high quality technical and/or consulting solutions to clients in response to security requirements. Perform multiple assigned technical tasks including system administration, monitoring, research, and analysis of the security solutions. This SIEM Threat Analysts will need to have network security product, technology, threat, vulnerability and MSS offering specialized skills. Using IT Security Industry experience, monitor client security systems and events to detect and investigate threats, and work regularly with client teams to enhance current solutions to improve client security posture. Ricardo must enhanced professional, operational and inter-personal skills to function effectively in collaborative high stakes and high stress situations with clients. He must possess skills that include strong networking, security technologies experience, strong understanding of security best practices, strong written and oral communications, must be detail oriented, must be customer focused and willing to work in a 24/7 shift environment. SIEM Threat Analysis IBM December 2013  – Present (1 year 9 months) Costa Rica IBM Security Operations Center (SOC) has Ricardo as SIEM Threat Analyst (Security Information and Event Management Analyst); an individual contributor to work within the IBM Costa Rica SOC. The SIEM Threat Analyst will be responsible for providing IT security services to clients within the IBM Security Services (ISS) Managed Security Services organization. As a member of a team, or working independently, this role will perform an analytical and technical role in implementation, integration and delivery of technical IT security solutions, specifically SIEM Solutions, for the assigned clients. This includes the use of inter-operational processes and procedures. Deliver high quality technical and/or consulting solutions to clients in response to security requirements. Perform multiple assigned technical tasks including system administration, monitoring, research, and analysis of the security solutions. This SIEM Threat Analysts will need to have network security product, technology, threat, vulnerability and MSS offering specialized skills. Using IT Security Industry experience, monitor client security systems and events to detect and investigate threats, and work regularly with client teams to enhance current solutions to improve client security posture. Ricardo must enhanced professional, operational and inter-personal skills to function effectively in collaborative high stakes and high stress situations with clients. He must possess skills that include strong networking, security technologies experience, strong understanding of security best practices, strong written and oral communications, must be detail oriented, must be customer focused and willing to work in a 24/7 shift environment. Information Security Analyst Intel Corporation August 2009  –  November 2013  (4 years 4 months) Costa Rica Information Security Specialists (ISSs) are responsible for protecting Intel’s assets and intellectual property by developing, implementing, and enforcing information security directions and policies to be followed by employees throughout the corporation. This also includes providing Incident Management support for the applications/systems based on service level agreements and supporting internal employees in security related matters. ISSs have a solid understanding of information security in general and the specific behaviors that would secure Intel’s information assets and intellectual property. ISSs may be engaged in special information security related projects as needed. ISSs must weigh individual employees’ or business units’ requirements and behaviors against Intel’s corporate information security needs based on existing policies. They must be strong problem solvers with the ability to methodically and objectively analyze and resolve information security challenges. ISSs work in both proactive and reactive modes. Proactively, they anticipate information security challenges and provide solutions for them before they arise. Reactively, ISSs must respond to unanticipated incidents and security challenges as they arise. Information Security Analyst Intel Corporation August 2009  –  November 2013  (4 years 4 months) Costa Rica Information Security Specialists (ISSs) are responsible for protecting Intel’s assets and intellectual property by developing, implementing, and enforcing information security directions and policies to be followed by employees throughout the corporation. This also includes providing Incident Management support for the applications/systems based on service level agreements and supporting internal employees in security related matters. ISSs have a solid understanding of information security in general and the specific behaviors that would secure Intel’s information assets and intellectual property. ISSs may be engaged in special information security related projects as needed. ISSs must weigh individual employees’ or business units’ requirements and behaviors against Intel’s corporate information security needs based on existing policies. They must be strong problem solvers with the ability to methodically and objectively analyze and resolve information security challenges. ISSs work in both proactive and reactive modes. Proactively, they anticipate information security challenges and provide solutions for them before they arise. Reactively, ISSs must respond to unanticipated incidents and security challenges as they arise. IT NCSD (Networking Core Service Desk) Intel Corporation July 2008  –  August 2009  (1 year 2 months) Costa Rica Basic Networking support to Intel Co-Workers and Small Form Factors such as Handheld devices and its Operating Systems. Blackberry Manager support to these devices. IT NCSD (Networking Core Service Desk) Intel Corporation July 2008  –  August 2009  (1 year 2 months) Costa Rica Basic Networking support to Intel Co-Workers and Small Form Factors such as Handheld devices and its Operating Systems. Blackberry Manager support to these devices. IT TAC (Technical Assistance Center) Intel Corporation November 2006  –  August 2007  (10 months) Responsible for providing support to Internal Intel Co-Workers with Office and Collaboration tools. Provide VPN and Roaming Profile support. IT TAC (Technical Assistance Center) Intel Corporation November 2006  –  August 2007  (10 months) Responsible for providing support to Internal Intel Co-Workers with Office and Collaboration tools. Provide VPN and Roaming Profile support. English Professor New Hope Bilingual High School January 2003  –  October 2006  (3 years 10 months) San Juan, Santa Barbara, Heredia, Costa Rica Ricardo was responsible of providing classes in the following fields: Literature, Conversation, Social Studies and Science. He was assigned Primary and Secondary groups. English Professor New Hope Bilingual High School January 2003  –  October 2006  (3 years 10 months) San Juan, Santa Barbara, Heredia, Costa Rica Ricardo was responsible of providing classes in the following fields: Literature, Conversation, Social Studies and Science. He was assigned Primary and Secondary groups. Warehouse Worker Mediterranean Marble December 2001  –  December 2002  (1 year 1 month) Naples, Florida Area Ricardo crafted and installed innovative and luxurious flooring, countertops, tub and fireplace surrounds, general slab work and exterior cladding in a variety of exquisite materials for high profile clients and numerous CEOs of fortune 500 companies, among others. The biggest projects Ricardo worked with were located in Navona and Moraya Bay. He provided to the company high discipline with extra mile work to finish the projects ahead time. Warehouse Worker Mediterranean Marble December 2001  –  December 2002  (1 year 1 month) Naples, Florida Area Ricardo crafted and installed innovative and luxurious flooring, countertops, tub and fireplace surrounds, general slab work and exterior cladding in a variety of exquisite materials for high profile clients and numerous CEOs of fortune 500 companies, among others. The biggest projects Ricardo worked with were located in Navona and Moraya Bay. He provided to the company high discipline with extra mile work to finish the projects ahead time. Consejo Academico (CONSACA) Universidad Nacional de Costa Rica January 2001  –  December 2001  (1 year) Heredia, Costa Rica Ricardo was an Academic and Advisor Counselor at the Universidad Nacional. He had an on-going, intentional, educational partnership dedicated to student academic success. It was to his advantage to meet with students at least 4 times per month. Ricardo provided accurate and complete information about every students' request to the Dean and Vice Rectory. Ricardo was knowledgeable about university policies and could help students learn to make decisions about their college experience. Ricardo investigated degree programs and careers for assistance such as Scholarships and food tickets. Consejo Academico (CONSACA) Universidad Nacional de Costa Rica January 2001  –  December 2001  (1 year) Heredia, Costa Rica Ricardo was an Academic and Advisor Counselor at the Universidad Nacional. He had an on-going, intentional, educational partnership dedicated to student academic success. It was to his advantage to meet with students at least 4 times per month. Ricardo provided accurate and complete information about every students' request to the Dean and Vice Rectory. Ricardo was knowledgeable about university policies and could help students learn to make decisions about their college experience. Ricardo investigated degree programs and careers for assistance such as Scholarships and food tickets. Video Jockey and Bartender La Cascada Bar and Restaurant March 1999  –  December 2000  (1 year 10 months) Perez Zeledon, Costa Rica Ricardo innovated the opportunity to play music in a different way. He offered his system to provide music videos and have a different environment in the bar. This accomplishment generated more people to go to the bar, increasing sales to his owner (Douglas Flores). Also, he worked as bartender to provide very good service to Second Language clients. This helped Ricardo to have the chance to finish his studies and apply for another job. Video Jockey and Bartender La Cascada Bar and Restaurant March 1999  –  December 2000  (1 year 10 months) Perez Zeledon, Costa Rica Ricardo innovated the opportunity to play music in a different way. He offered his system to provide music videos and have a different environment in the bar. This accomplishment generated more people to go to the bar, increasing sales to his owner (Douglas Flores). Also, he worked as bartender to provide very good service to Second Language clients. This helped Ricardo to have the chance to finish his studies and apply for another job. Sport's Seller (Tennis Shoes Area) 3E Sport Store December 1997  –  February 1998  (3 months) Perez Zeledon, Costa Rica Ricardo was responsible for having the inventory and sell for the sports area. This short period was done for vacation time only. He sold the whole inventory for 4 months in 3 weeks, making a very good commission and income for the store. Sport's Seller (Tennis Shoes Area) 3E Sport Store December 1997  –  February 1998  (3 months) Perez Zeledon, Costa Rica Ricardo was responsible for having the inventory and sell for the sports area. This short period was done for vacation time only. He sold the whole inventory for 4 months in 3 weeks, making a very good commission and income for the store. Languages English Spanish English Spanish English Spanish Skills Networking Windows Server Microsoft Office ArcSight Malware Analysis Incident Management Windows 7 Bluecoat Data Forensics Viruses StealthWatch Damballa Sensage New Malware Variants Advanced Persistent... Akamai KONA web Security Network Security Security Computer Security Information Security Management Operating Systems Integration Team Leadership Linux Troubleshooting IT Service Management See 12+     See less Skills  Networking Windows Server Microsoft Office ArcSight Malware Analysis Incident Management Windows 7 Bluecoat Data Forensics Viruses StealthWatch Damballa Sensage New Malware Variants Advanced Persistent... Akamai KONA web Security Network Security Security Computer Security Information Security Management Operating Systems Integration Team Leadership Linux Troubleshooting IT Service Management See 12+     See less Networking Windows Server Microsoft Office ArcSight Malware Analysis Incident Management Windows 7 Bluecoat Data Forensics Viruses StealthWatch Damballa Sensage New Malware Variants Advanced Persistent... Akamai KONA web Security Network Security Security Computer Security Information Security Management Operating Systems Integration Team Leadership Linux Troubleshooting IT Service Management See 12+     See less Networking Windows Server Microsoft Office ArcSight Malware Analysis Incident Management Windows 7 Bluecoat Data Forensics Viruses StealthWatch Damballa Sensage New Malware Variants Advanced Persistent... Akamai KONA web Security Network Security Security Computer Security Information Security Management Operating Systems Integration Team Leadership Linux Troubleshooting IT Service Management See 12+     See less Education CENFOTEC Univeristy Master's Degree,  Cybersecurity , MCS 2014  – 2016 El profesional en seguridad de la información requiere conocimientos y habilidades especiales que le permitan diseñar e implementar medidas de seguridad que eviten el robo, pérdida, daño y alteración de la información, permitiendo la operación de una forma eficiente y eficaz, mediante el balance adecuado entre seguridad y objetivos del negocio. Su rol en las organizaciones modernas es ampliamente reconocido, indispensable y primordial. \n \nEl programa de Ciberseguridad de la Universidad Cenfotec ofrece una preparación especializada y una base sólida en la seguridad de las tecnologías de información y comunicación, en un programa que combina experiencia, conocimiento, educación y ética. Activities and Societies:  Ricardo is participating in a Government project to create the CSIRT for Costa Rica with Esteban Jimenez Cabezas (IBM) ,  Cenfotec leaders and The Ministry of Science ,  Technology and Telecommunications (MICITT) University of Maryland College Park Cybersecurity Specialization,  Computer and Information Systems Security/Information Assurance , Certification 2014  – 2015 Appreciation and understanding of commonly used cryptosystems.Techniques for avoiding, finding and fixing software vulnerabilities. Incorporating principles of usability into the design of secure systems. Hardware design and security vulnerabilities. Activities and Societies:  Join online to present homeworks and investigations Universidad Latina de Costa Rica Master of Business Administration (MBA) Project Management,  Currently taking it 2012  – 2015 Networking Activities and Societies:  Cybersecurity Week ,  2012 Universidad Nacional de Costa Rica Bachelor of Education. ESL English,  Bachelor 1998  – 2004 English Bachelor Activities and Societies:  Asociacion de Estudiantes\nConsejo Academico de la UNA CENFOTEC Univeristy Master's Degree,  Cybersecurity , MCS 2014  – 2016 El profesional en seguridad de la información requiere conocimientos y habilidades especiales que le permitan diseñar e implementar medidas de seguridad que eviten el robo, pérdida, daño y alteración de la información, permitiendo la operación de una forma eficiente y eficaz, mediante el balance adecuado entre seguridad y objetivos del negocio. Su rol en las organizaciones modernas es ampliamente reconocido, indispensable y primordial. \n \nEl programa de Ciberseguridad de la Universidad Cenfotec ofrece una preparación especializada y una base sólida en la seguridad de las tecnologías de información y comunicación, en un programa que combina experiencia, conocimiento, educación y ética. Activities and Societies:  Ricardo is participating in a Government project to create the CSIRT for Costa Rica with Esteban Jimenez Cabezas (IBM) ,  Cenfotec leaders and The Ministry of Science ,  Technology and Telecommunications (MICITT) CENFOTEC Univeristy Master's Degree,  Cybersecurity , MCS 2014  – 2016 El profesional en seguridad de la información requiere conocimientos y habilidades especiales que le permitan diseñar e implementar medidas de seguridad que eviten el robo, pérdida, daño y alteración de la información, permitiendo la operación de una forma eficiente y eficaz, mediante el balance adecuado entre seguridad y objetivos del negocio. Su rol en las organizaciones modernas es ampliamente reconocido, indispensable y primordial. \n \nEl programa de Ciberseguridad de la Universidad Cenfotec ofrece una preparación especializada y una base sólida en la seguridad de las tecnologías de información y comunicación, en un programa que combina experiencia, conocimiento, educación y ética. Activities and Societies:  Ricardo is participating in a Government project to create the CSIRT for Costa Rica with Esteban Jimenez Cabezas (IBM) ,  Cenfotec leaders and The Ministry of Science ,  Technology and Telecommunications (MICITT) CENFOTEC Univeristy Master's Degree,  Cybersecurity , MCS 2014  – 2016 El profesional en seguridad de la información requiere conocimientos y habilidades especiales que le permitan diseñar e implementar medidas de seguridad que eviten el robo, pérdida, daño y alteración de la información, permitiendo la operación de una forma eficiente y eficaz, mediante el balance adecuado entre seguridad y objetivos del negocio. Su rol en las organizaciones modernas es ampliamente reconocido, indispensable y primordial. \n \nEl programa de Ciberseguridad de la Universidad Cenfotec ofrece una preparación especializada y una base sólida en la seguridad de las tecnologías de información y comunicación, en un programa que combina experiencia, conocimiento, educación y ética. Activities and Societies:  Ricardo is participating in a Government project to create the CSIRT for Costa Rica with Esteban Jimenez Cabezas (IBM) ,  Cenfotec leaders and The Ministry of Science ,  Technology and Telecommunications (MICITT) University of Maryland College Park Cybersecurity Specialization,  Computer and Information Systems Security/Information Assurance , Certification 2014  – 2015 Appreciation and understanding of commonly used cryptosystems.Techniques for avoiding, finding and fixing software vulnerabilities. Incorporating principles of usability into the design of secure systems. Hardware design and security vulnerabilities. Activities and Societies:  Join online to present homeworks and investigations University of Maryland College Park Cybersecurity Specialization,  Computer and Information Systems Security/Information Assurance , Certification 2014  – 2015 Appreciation and understanding of commonly used cryptosystems.Techniques for avoiding, finding and fixing software vulnerabilities. Incorporating principles of usability into the design of secure systems. Hardware design and security vulnerabilities. Activities and Societies:  Join online to present homeworks and investigations University of Maryland College Park Cybersecurity Specialization,  Computer and Information Systems Security/Information Assurance , Certification 2014  – 2015 Appreciation and understanding of commonly used cryptosystems.Techniques for avoiding, finding and fixing software vulnerabilities. Incorporating principles of usability into the design of secure systems. Hardware design and security vulnerabilities. Activities and Societies:  Join online to present homeworks and investigations Universidad Latina de Costa Rica Master of Business Administration (MBA) Project Management,  Currently taking it 2012  – 2015 Networking Activities and Societies:  Cybersecurity Week ,  2012 Universidad Latina de Costa Rica Master of Business Administration (MBA) Project Management,  Currently taking it 2012  – 2015 Networking Activities and Societies:  Cybersecurity Week ,  2012 Universidad Latina de Costa Rica Master of Business Administration (MBA) Project Management,  Currently taking it 2012  – 2015 Networking Activities and Societies:  Cybersecurity Week ,  2012 Universidad Nacional de Costa Rica Bachelor of Education. ESL English,  Bachelor 1998  – 2004 English Bachelor Activities and Societies:  Asociacion de Estudiantes\nConsejo Academico de la UNA Universidad Nacional de Costa Rica Bachelor of Education. ESL English,  Bachelor 1998  – 2004 English Bachelor Activities and Societies:  Asociacion de Estudiantes\nConsejo Academico de la UNA Universidad Nacional de Costa Rica Bachelor of Education. ESL English,  Bachelor 1998  – 2004 English Bachelor Activities and Societies:  Asociacion de Estudiantes\nConsejo Academico de la UNA "]}