{"position": "Inside Sales Account Manager", "company": "IBM", "profiles": ["Summary I am an experienced Account Manager and Channel Development executive with a demonstrated track record of achievements and high degree of drive and determination. A business development executive who understands company's corporate views, support and defend them. Channel proponent with customer centric attitude and dedication to being a trusted advisor. I have a passion for helping organizations solve their problems through latest technologies. I have the proven ability to gain customer commitments, build momentum and accelerate the sales cycle. I posses great teaming skills and demonstrated ability to understand sales barriers and how to overcome initial technology hurdles to close business. \n \nMy clients include Fortune 1000 and mid-sized companies in various industries including manufacturing, healthcare, transportation and logistics. Summary I am an experienced Account Manager and Channel Development executive with a demonstrated track record of achievements and high degree of drive and determination. A business development executive who understands company's corporate views, support and defend them. Channel proponent with customer centric attitude and dedication to being a trusted advisor. I have a passion for helping organizations solve their problems through latest technologies. I have the proven ability to gain customer commitments, build momentum and accelerate the sales cycle. I posses great teaming skills and demonstrated ability to understand sales barriers and how to overcome initial technology hurdles to close business. \n \nMy clients include Fortune 1000 and mid-sized companies in various industries including manufacturing, healthcare, transportation and logistics. I am an experienced Account Manager and Channel Development executive with a demonstrated track record of achievements and high degree of drive and determination. A business development executive who understands company's corporate views, support and defend them. Channel proponent with customer centric attitude and dedication to being a trusted advisor. I have a passion for helping organizations solve their problems through latest technologies. I have the proven ability to gain customer commitments, build momentum and accelerate the sales cycle. I posses great teaming skills and demonstrated ability to understand sales barriers and how to overcome initial technology hurdles to close business. \n \nMy clients include Fortune 1000 and mid-sized companies in various industries including manufacturing, healthcare, transportation and logistics. I am an experienced Account Manager and Channel Development executive with a demonstrated track record of achievements and high degree of drive and determination. A business development executive who understands company's corporate views, support and defend them. Channel proponent with customer centric attitude and dedication to being a trusted advisor. I have a passion for helping organizations solve their problems through latest technologies. I have the proven ability to gain customer commitments, build momentum and accelerate the sales cycle. I posses great teaming skills and demonstrated ability to understand sales barriers and how to overcome initial technology hurdles to close business. \n \nMy clients include Fortune 1000 and mid-sized companies in various industries including manufacturing, healthcare, transportation and logistics. Experience Channel Account Manager Zebra Technologies (Formerly Motorola Solutions) June 2014  – Present (1 year 3 months) Greater Atlanta Area Channel Account Manager Motorola Mobility & WLAN infrastructure Security Solutions June 2010  –  June 2014  (4 years 1 month) Alpharetta GA Inside Territory/Channel Account Manager-Canada Motorola WLAN & Air Defense Security Solutions June 2010  –  July 2012  (2 years 2 months) Alpharetta GA Independent Consultant Independent Sales & Marketing Adviser April 2009  –  June 2010  (1 year 3 months) Greater Atlanta Area Account Executive VersionOne February 2008  –  April 2009  (1 year 3 months) Greater Atlanta Area District Sales Manager SPI Dynamics Hewlett-Packard- June 2006  –  January 2008  (1 year 8 months) Greater Atlanta Area Account Manager/Team Lead IBM Internet Security Systems April 2004  –  June 2006  (2 years 3 months) Inside Sales Account Manager IBM Security July 2000  –  April 2004  (3 years 10 months) Greater Atlanta Area Technical Education Consultant Ingram Micro February 1998  –  June 2000  (2 years 5 months) Toronto, Canada Area Channel Account Manager Zebra Technologies (Formerly Motorola Solutions) June 2014  – Present (1 year 3 months) Greater Atlanta Area Channel Account Manager Zebra Technologies (Formerly Motorola Solutions) June 2014  – Present (1 year 3 months) Greater Atlanta Area Channel Account Manager Motorola Mobility & WLAN infrastructure Security Solutions June 2010  –  June 2014  (4 years 1 month) Alpharetta GA Channel Account Manager Motorola Mobility & WLAN infrastructure Security Solutions June 2010  –  June 2014  (4 years 1 month) Alpharetta GA Inside Territory/Channel Account Manager-Canada Motorola WLAN & Air Defense Security Solutions June 2010  –  July 2012  (2 years 2 months) Alpharetta GA Inside Territory/Channel Account Manager-Canada Motorola WLAN & Air Defense Security Solutions June 2010  –  July 2012  (2 years 2 months) Alpharetta GA Independent Consultant Independent Sales & Marketing Adviser April 2009  –  June 2010  (1 year 3 months) Greater Atlanta Area Independent Consultant Independent Sales & Marketing Adviser April 2009  –  June 2010  (1 year 3 months) Greater Atlanta Area Account Executive VersionOne February 2008  –  April 2009  (1 year 3 months) Greater Atlanta Area Account Executive VersionOne February 2008  –  April 2009  (1 year 3 months) Greater Atlanta Area District Sales Manager SPI Dynamics Hewlett-Packard- June 2006  –  January 2008  (1 year 8 months) Greater Atlanta Area District Sales Manager SPI Dynamics Hewlett-Packard- June 2006  –  January 2008  (1 year 8 months) Greater Atlanta Area Account Manager/Team Lead IBM Internet Security Systems April 2004  –  June 2006  (2 years 3 months) Account Manager/Team Lead IBM Internet Security Systems April 2004  –  June 2006  (2 years 3 months) Inside Sales Account Manager IBM Security July 2000  –  April 2004  (3 years 10 months) Greater Atlanta Area Inside Sales Account Manager IBM Security July 2000  –  April 2004  (3 years 10 months) Greater Atlanta Area Technical Education Consultant Ingram Micro February 1998  –  June 2000  (2 years 5 months) Toronto, Canada Area Technical Education Consultant Ingram Micro February 1998  –  June 2000  (2 years 5 months) Toronto, Canada Area Languages   Skills Skills     Honors & Awards Motorola CEO Circle Motorola Solutions Inc. May 2013 Top Sales Award Sales Excellence Award Motorola Solutions February 2013 Sales Quta Performance Sales Excellence Award Motorola Solutions Inc. February 2012 Sales Quota Performance Sales Excellence Award Motorola Solutions Inc. February 2011 Sales Quota Performance President's Club ISS-IBM April 2001 Six Sigma Yellow Belt Motorola Solutions Inc. March 2012 Additional Honors & Awards Customer Centric Selling Certified \nComplex Sale \nTrain The Trainer \nMiller Heiman Sales Training Motorola CEO Circle Motorola Solutions Inc. May 2013 Top Sales Award Motorola CEO Circle Motorola Solutions Inc. May 2013 Top Sales Award Motorola CEO Circle Motorola Solutions Inc. May 2013 Top Sales Award Sales Excellence Award Motorola Solutions February 2013 Sales Quta Performance Sales Excellence Award Motorola Solutions February 2013 Sales Quta Performance Sales Excellence Award Motorola Solutions February 2013 Sales Quta Performance Sales Excellence Award Motorola Solutions Inc. February 2012 Sales Quota Performance Sales Excellence Award Motorola Solutions Inc. February 2012 Sales Quota Performance Sales Excellence Award Motorola Solutions Inc. February 2012 Sales Quota Performance Sales Excellence Award Motorola Solutions Inc. February 2011 Sales Quota Performance Sales Excellence Award Motorola Solutions Inc. February 2011 Sales Quota Performance Sales Excellence Award Motorola Solutions Inc. February 2011 Sales Quota Performance President's Club ISS-IBM April 2001 President's Club ISS-IBM April 2001 President's Club ISS-IBM April 2001 Six Sigma Yellow Belt Motorola Solutions Inc. March 2012 Six Sigma Yellow Belt Motorola Solutions Inc. March 2012 Six Sigma Yellow Belt Motorola Solutions Inc. March 2012 Additional Honors & Awards Customer Centric Selling Certified \nComplex Sale \nTrain The Trainer \nMiller Heiman Sales Training Additional Honors & Awards Customer Centric Selling Certified \nComplex Sale \nTrain The Trainer \nMiller Heiman Sales Training Additional Honors & Awards Customer Centric Selling Certified \nComplex Sale \nTrain The Trainer \nMiller Heiman Sales Training ", "Summary Proven track record of business development success in B2B sales throughout a wide range of industries, geographies, roles, and economic conditions. Possess a proven ability to develop mutually beneficial customer relationships with key stakeholders at all levels up to C-level decision-makers. Meet/exceed challenging lead development, revenue generation, and account retention targets through the use of persistent, professional, sales outreach tactics, coupled with an ability to assess and satisfy the most challenging customer requirements. Summary Proven track record of business development success in B2B sales throughout a wide range of industries, geographies, roles, and economic conditions. Possess a proven ability to develop mutually beneficial customer relationships with key stakeholders at all levels up to C-level decision-makers. Meet/exceed challenging lead development, revenue generation, and account retention targets through the use of persistent, professional, sales outreach tactics, coupled with an ability to assess and satisfy the most challenging customer requirements. Proven track record of business development success in B2B sales throughout a wide range of industries, geographies, roles, and economic conditions. Possess a proven ability to develop mutually beneficial customer relationships with key stakeholders at all levels up to C-level decision-makers. Meet/exceed challenging lead development, revenue generation, and account retention targets through the use of persistent, professional, sales outreach tactics, coupled with an ability to assess and satisfy the most challenging customer requirements. Proven track record of business development success in B2B sales throughout a wide range of industries, geographies, roles, and economic conditions. Possess a proven ability to develop mutually beneficial customer relationships with key stakeholders at all levels up to C-level decision-makers. Meet/exceed challenging lead development, revenue generation, and account retention targets through the use of persistent, professional, sales outreach tactics, coupled with an ability to assess and satisfy the most challenging customer requirements. Experience Lead Development Representative/Inside Sales Account Manager IBM Canada Ltd. July 2010  –  June 2013  (3 years) Markham, Ontario,Canada Fulfill mandate to identify and progress IT sales opportunities throughout the US for the IBM Power Servers Group.Reach out to existing install base, dormant, and white space SMB & MM clients. Target industry verticals including Healthcare, Retail, Wholesale, and Distribution. Contact ‘C’ Level and Mid-Level Executives to identify their IT needs and challenges and subsequently engage internal resources / Channel Partners to develop the ideal technology solution to meet their business requirements. Consultant - Major Appliances Sears Canada 2009  –  2010  (1 year) Scarborough,Ontario, Canada Provided face-to-face sales and customer relations services in order to optimize revenue and customer satisfaction. Media Consultant/ Sales Representative, Durham & Scarborough Regions TORONTO STAR GOLD BOOK 2007  –  2008  (1 year) Whitby, Ontario, Canada Created brand awareness among retail businesses, corporations and professionals throughout assigned region. Successfully generated new sales, launched new advertising products, and enhanced corporate focus on internet advertising. Business Solutions Consultant/Inside Sales Representative YELLOW PAGES GROUP 2004  –  2007  (3 years) Scarborough,Ontario,Canada Met aggressive revenue and renewal targets by actively reaching out to existing and net new customers. Developed and successfully implemented sales strategic plans for the GTA market. Liaised with customer stakeholders and internal Graphics Department to provide accurate and timely production of ads. Product Manager & Country Lead – Air Conditioners Samsung Electronics 2003  –  2004  (1 year) New Delhi, India Led Sales & Marketing activities for air conditioner product category. Managed team of 18 Sales Reps in several different branches. Managed Marketing activities including event management, pricing, demand forecasting, and inventory control. Oversaw production and timely release of high-impact marketing & advertising campaigns. Regional Sales Manager – Air Conditioners SAMSUNG ELECTRONICS 2000  –  2003  (3 years) Chandigarh,Punjab,India Mentored and managed team of Sales Reps in Punjab territory for the air conditioner product category. Developed and maintained Business Partners for retail channel and exclusive sales and service channel for air conditioners. Responsible for demand forecasting and inventory control for the territory. Developed new business strategies to enhance sales. Assistant Manager CARRIER REFRIGERATION LTD 1998  –  2000  (2 years) Chandigarh,Punjab,India Managed team of Sales Reps for sales of Deep Freezers, Visi Coolers and Cold Rooms. Developed retail sales channel for Deep Freezers. Coordinated with client, vendors, and subcontractors to ensure timely completion of projects. Coordinated with internal departments for timely delivery and technical support. Managed office administration and working expenses Service Supervisor VOLTAS LTD 1992  –  1998  (6 years) Chandigarh, Punjab, India Oversaw team responsible for servicing of central air conditioning plants and packaged units. Lead Development Representative/Inside Sales Account Manager IBM Canada Ltd. July 2010  –  June 2013  (3 years) Markham, Ontario,Canada Fulfill mandate to identify and progress IT sales opportunities throughout the US for the IBM Power Servers Group.Reach out to existing install base, dormant, and white space SMB & MM clients. Target industry verticals including Healthcare, Retail, Wholesale, and Distribution. Contact ‘C’ Level and Mid-Level Executives to identify their IT needs and challenges and subsequently engage internal resources / Channel Partners to develop the ideal technology solution to meet their business requirements. Lead Development Representative/Inside Sales Account Manager IBM Canada Ltd. July 2010  –  June 2013  (3 years) Markham, Ontario,Canada Fulfill mandate to identify and progress IT sales opportunities throughout the US for the IBM Power Servers Group.Reach out to existing install base, dormant, and white space SMB & MM clients. Target industry verticals including Healthcare, Retail, Wholesale, and Distribution. Contact ‘C’ Level and Mid-Level Executives to identify their IT needs and challenges and subsequently engage internal resources / Channel Partners to develop the ideal technology solution to meet their business requirements. Consultant - Major Appliances Sears Canada 2009  –  2010  (1 year) Scarborough,Ontario, Canada Provided face-to-face sales and customer relations services in order to optimize revenue and customer satisfaction. Consultant - Major Appliances Sears Canada 2009  –  2010  (1 year) Scarborough,Ontario, Canada Provided face-to-face sales and customer relations services in order to optimize revenue and customer satisfaction. Media Consultant/ Sales Representative, Durham & Scarborough Regions TORONTO STAR GOLD BOOK 2007  –  2008  (1 year) Whitby, Ontario, Canada Created brand awareness among retail businesses, corporations and professionals throughout assigned region. Successfully generated new sales, launched new advertising products, and enhanced corporate focus on internet advertising. Media Consultant/ Sales Representative, Durham & Scarborough Regions TORONTO STAR GOLD BOOK 2007  –  2008  (1 year) Whitby, Ontario, Canada Created brand awareness among retail businesses, corporations and professionals throughout assigned region. Successfully generated new sales, launched new advertising products, and enhanced corporate focus on internet advertising. Business Solutions Consultant/Inside Sales Representative YELLOW PAGES GROUP 2004  –  2007  (3 years) Scarborough,Ontario,Canada Met aggressive revenue and renewal targets by actively reaching out to existing and net new customers. Developed and successfully implemented sales strategic plans for the GTA market. Liaised with customer stakeholders and internal Graphics Department to provide accurate and timely production of ads. Business Solutions Consultant/Inside Sales Representative YELLOW PAGES GROUP 2004  –  2007  (3 years) Scarborough,Ontario,Canada Met aggressive revenue and renewal targets by actively reaching out to existing and net new customers. Developed and successfully implemented sales strategic plans for the GTA market. Liaised with customer stakeholders and internal Graphics Department to provide accurate and timely production of ads. Product Manager & Country Lead – Air Conditioners Samsung Electronics 2003  –  2004  (1 year) New Delhi, India Led Sales & Marketing activities for air conditioner product category. Managed team of 18 Sales Reps in several different branches. Managed Marketing activities including event management, pricing, demand forecasting, and inventory control. Oversaw production and timely release of high-impact marketing & advertising campaigns. Product Manager & Country Lead – Air Conditioners Samsung Electronics 2003  –  2004  (1 year) New Delhi, India Led Sales & Marketing activities for air conditioner product category. Managed team of 18 Sales Reps in several different branches. Managed Marketing activities including event management, pricing, demand forecasting, and inventory control. Oversaw production and timely release of high-impact marketing & advertising campaigns. Regional Sales Manager – Air Conditioners SAMSUNG ELECTRONICS 2000  –  2003  (3 years) Chandigarh,Punjab,India Mentored and managed team of Sales Reps in Punjab territory for the air conditioner product category. Developed and maintained Business Partners for retail channel and exclusive sales and service channel for air conditioners. Responsible for demand forecasting and inventory control for the territory. Developed new business strategies to enhance sales. Regional Sales Manager – Air Conditioners SAMSUNG ELECTRONICS 2000  –  2003  (3 years) Chandigarh,Punjab,India Mentored and managed team of Sales Reps in Punjab territory for the air conditioner product category. Developed and maintained Business Partners for retail channel and exclusive sales and service channel for air conditioners. Responsible for demand forecasting and inventory control for the territory. Developed new business strategies to enhance sales. Assistant Manager CARRIER REFRIGERATION LTD 1998  –  2000  (2 years) Chandigarh,Punjab,India Managed team of Sales Reps for sales of Deep Freezers, Visi Coolers and Cold Rooms. Developed retail sales channel for Deep Freezers. Coordinated with client, vendors, and subcontractors to ensure timely completion of projects. Coordinated with internal departments for timely delivery and technical support. Managed office administration and working expenses Assistant Manager CARRIER REFRIGERATION LTD 1998  –  2000  (2 years) Chandigarh,Punjab,India Managed team of Sales Reps for sales of Deep Freezers, Visi Coolers and Cold Rooms. Developed retail sales channel for Deep Freezers. Coordinated with client, vendors, and subcontractors to ensure timely completion of projects. Coordinated with internal departments for timely delivery and technical support. Managed office administration and working expenses Service Supervisor VOLTAS LTD 1992  –  1998  (6 years) Chandigarh, Punjab, India Oversaw team responsible for servicing of central air conditioning plants and packaged units. Service Supervisor VOLTAS LTD 1992  –  1998  (6 years) Chandigarh, Punjab, India Oversaw team responsible for servicing of central air conditioning plants and packaged units. Languages English Full professional proficiency Hindi Full professional proficiency Punjabi Full professional proficiency English Full professional proficiency Hindi Full professional proficiency Punjabi Full professional proficiency English Full professional proficiency Hindi Full professional proficiency Punjabi Full professional proficiency Full professional proficiency Full professional proficiency Full professional proficiency Skills Windows Virtualization Proficient with... Competent with CRM... Knowledgeable of IBM... Sales Operations Channel Partners CRM Skills  Windows Virtualization Proficient with... Competent with CRM... Knowledgeable of IBM... Sales Operations Channel Partners CRM Windows Virtualization Proficient with... Competent with CRM... Knowledgeable of IBM... Sales Operations Channel Partners CRM Windows Virtualization Proficient with... Competent with CRM... Knowledgeable of IBM... Sales Operations Channel Partners CRM Education YMCA Institute of Engineering, Faridabad, India Post-graduate Diploma,  Mechanical Engineering 1988  – 1992 Activities and Societies:  Active member of Music and Drama Club. Organized annual institute festivals. Represented Institute in Regional Quiz Competitions. YMCA Institute of Engineering, Faridabad, India Post-graduate Diploma,  Mechanical Engineering 1988  – 1992 Activities and Societies:  Active member of Music and Drama Club. Organized annual institute festivals. Represented Institute in Regional Quiz Competitions. YMCA Institute of Engineering, Faridabad, India Post-graduate Diploma,  Mechanical Engineering 1988  – 1992 Activities and Societies:  Active member of Music and Drama Club. Organized annual institute festivals. Represented Institute in Regional Quiz Competitions. YMCA Institute of Engineering, Faridabad, India Post-graduate Diploma,  Mechanical Engineering 1988  – 1992 Activities and Societies:  Active member of Music and Drama Club. Organized annual institute festivals. Represented Institute in Regional Quiz Competitions. ", "Skills Salesforce.com Account Management Customer Service Building Relationships Territory Management Territory Growth Professional Services Training Web Content Management Software Sales Lead Generation Selling Skills Sales Process Enterprise Software Sales Operations Selling Solution Selling CRM Sales Software Industry New Business Development See 6+     See less Skills  Salesforce.com Account Management Customer Service Building Relationships Territory Management Territory Growth Professional Services Training Web Content Management Software Sales Lead Generation Selling Skills Sales Process Enterprise Software Sales Operations Selling Solution Selling CRM Sales Software Industry New Business Development See 6+     See less Salesforce.com Account Management Customer Service Building Relationships Territory Management Territory Growth Professional Services Training Web Content Management Software Sales Lead Generation Selling Skills Sales Process Enterprise Software Sales Operations Selling Solution Selling CRM Sales Software Industry New Business Development See 6+     See less Salesforce.com Account Management Customer Service Building Relationships Territory Management Territory Growth Professional Services Training Web Content Management Software Sales Lead Generation Selling Skills Sales Process Enterprise Software Sales Operations Selling Solution Selling CRM Sales Software Industry New Business Development See 6+     See less ", "Experience Business Manager Apple May 2013  – Present (2 years 4 months) Brescia Area, Italy Working with business professionals and entrepreneurs to discover and create innovative solutions that can help their companies succeed.  \nHiring, coaching, and developing the Business Team as well as educating other personnel about Apple unique business services.  \nGenerating new leads and relationships, connecting over the phone or through in-store workshops and events.  \nLeveraging relationships with internal Apple groups and other partners to develop business and generate additional revenue, while tracking success with various metrics. Business Specialist Apple Retail March 2012  –  April 2013  (1 year 2 months) Bologna Area, Italy Building up successful business relationships with existing customers and prospects. \nPipeline management through acquisition activity and KPI tracking. \nPlanning and delivering briefings with business customers. \nPlanning and supporting Apple business events. \nCoaching other team members in practicing and developing successful business interactions when dealing with business customers. \nInfluencing and liaising with different store teams and managers to be able to deliver the best customer experience, a wider business awareness and remarkable business results. \nReporting and data analysis. Business Development Manager IBM SW Tech Data November 2011  –  March 2012  (5 months) Milan Area, Italy Responsible for developing profitable business relationships with IBM SW Business Partners linked to Tech Data Italia, an IBM SW Value Added Distributor. \nPromoting and developing sales for the whole IBM SW offer, through marketing campaigns, workshops, enablement activities for BPs and targeted technical/commercial support. \nScheduling and conducting sales visits at assigned accounts and prospects. Business Unit Manager Avnet Technology Solutions June 2011  –  October 2011  (5 months) Cusano Milanino Responsible for developing BPs and Vendor relationships. \nScheduling and conducting sales visits at assigned accounts. \nResponsible for setting and reviewing budgets for the IBM SW Business Unit over the quarters. \nCoordinating roles/communication across the team members. \nManaging processes and resources to meet customer needs, organizing and prioritizing the tasks to be performed within the team. \nResponding to internal and external customer inquiries as needed, providing assistance, resolving problems and facilitating sales transition. \nCoaching, supporting and developing direct reports providing directions. \nConducting performance appraisal for direct reports and setting goals/objectives, discussing tasks, assignments and projects. \nDefining the Business Plan for the IBM SW division, involving the CEO for approval. \nCommunicating the Company and the Division strategic business plans. \nAssigning duties and responsibilities based on the skills and abilities of each team member. Product Manager IBM Software Avnet Technology Solutions December 2010  –  May 2011  (6 months) Working closely with the Distribution Channel (Vendor and BPs) to develop the IBM SW sales in the Italian market. \nPromoting and developing sales for specific IBM SW brands, through marketing campaigns, workshops, enablement activities for BPs and targeted technical/commercial support. \nAlways up-to-date on new Vendor's rebate programs, promotions, campaigns, keeping colleagues and BPs informed. \nResponsible for IBM SW profit and lost, margins and related rebates.  \nWorking closely with sales, marketing and support to ensure revenue and customer satisfaction goals are met. Inside Sales Account Manager IBM February 2010  –  November 2010  (10 months) Handling the IBM Passport Advantage Software Renewals process for a number of clients based in central Italy, both through Direct and Channel (Business Partners) sales. \nEnhancing the relationship with customers and the cooperation with IBM distributors (Computer Gross Italia Spa, Avnet) and certified Business Partners in country. \nFollowing up the deal from the quotation phase till the order processing. \nWorking on product migrations for customers acquired through a number of Acquisitions (Filenet, Cognos). Order Management Account Rep IBM December 2008  –  February 2010  (1 year 3 months) Acting as an interface between the customer and the IBM sales department. \nValidation of orders, backlog management. \nProcessing purchase orders using SAP. \nPerforming transaction activities such as supply, delivery, billing, billing query resolution, contract status checks. \nResolving fulfillment related problems and disputes. \nMaintaining awareness of orders and returns, and communicating issues to the customer and appropriate IBM contact points. \nParticipated to the Business Design Strategy Team, analysing, improving and developing the daily business processes for a smoother and easier way of working. Apple Products Sales Representative Mondadori Retail S.p.A. October 2005  –  March 2007  (1 year 6 months) Sales, Customer service and support for Apple Computer products. Internship in Marketing INCH3 Marketing Agency - Bielefeld / Germany February 2004  –  April 2004  (3 months) Marketing, advertising, IT products promotion, including products/services by O2 Germany, leading german mobile communication company. Business Manager Apple May 2013  – Present (2 years 4 months) Brescia Area, Italy Working with business professionals and entrepreneurs to discover and create innovative solutions that can help their companies succeed.  \nHiring, coaching, and developing the Business Team as well as educating other personnel about Apple unique business services.  \nGenerating new leads and relationships, connecting over the phone or through in-store workshops and events.  \nLeveraging relationships with internal Apple groups and other partners to develop business and generate additional revenue, while tracking success with various metrics. Business Manager Apple May 2013  – Present (2 years 4 months) Brescia Area, Italy Working with business professionals and entrepreneurs to discover and create innovative solutions that can help their companies succeed.  \nHiring, coaching, and developing the Business Team as well as educating other personnel about Apple unique business services.  \nGenerating new leads and relationships, connecting over the phone or through in-store workshops and events.  \nLeveraging relationships with internal Apple groups and other partners to develop business and generate additional revenue, while tracking success with various metrics. Business Specialist Apple Retail March 2012  –  April 2013  (1 year 2 months) Bologna Area, Italy Building up successful business relationships with existing customers and prospects. \nPipeline management through acquisition activity and KPI tracking. \nPlanning and delivering briefings with business customers. \nPlanning and supporting Apple business events. \nCoaching other team members in practicing and developing successful business interactions when dealing with business customers. \nInfluencing and liaising with different store teams and managers to be able to deliver the best customer experience, a wider business awareness and remarkable business results. \nReporting and data analysis. Business Specialist Apple Retail March 2012  –  April 2013  (1 year 2 months) Bologna Area, Italy Building up successful business relationships with existing customers and prospects. \nPipeline management through acquisition activity and KPI tracking. \nPlanning and delivering briefings with business customers. \nPlanning and supporting Apple business events. \nCoaching other team members in practicing and developing successful business interactions when dealing with business customers. \nInfluencing and liaising with different store teams and managers to be able to deliver the best customer experience, a wider business awareness and remarkable business results. \nReporting and data analysis. Business Development Manager IBM SW Tech Data November 2011  –  March 2012  (5 months) Milan Area, Italy Responsible for developing profitable business relationships with IBM SW Business Partners linked to Tech Data Italia, an IBM SW Value Added Distributor. \nPromoting and developing sales for the whole IBM SW offer, through marketing campaigns, workshops, enablement activities for BPs and targeted technical/commercial support. \nScheduling and conducting sales visits at assigned accounts and prospects. Business Development Manager IBM SW Tech Data November 2011  –  March 2012  (5 months) Milan Area, Italy Responsible for developing profitable business relationships with IBM SW Business Partners linked to Tech Data Italia, an IBM SW Value Added Distributor. \nPromoting and developing sales for the whole IBM SW offer, through marketing campaigns, workshops, enablement activities for BPs and targeted technical/commercial support. \nScheduling and conducting sales visits at assigned accounts and prospects. Business Unit Manager Avnet Technology Solutions June 2011  –  October 2011  (5 months) Cusano Milanino Responsible for developing BPs and Vendor relationships. \nScheduling and conducting sales visits at assigned accounts. \nResponsible for setting and reviewing budgets for the IBM SW Business Unit over the quarters. \nCoordinating roles/communication across the team members. \nManaging processes and resources to meet customer needs, organizing and prioritizing the tasks to be performed within the team. \nResponding to internal and external customer inquiries as needed, providing assistance, resolving problems and facilitating sales transition. \nCoaching, supporting and developing direct reports providing directions. \nConducting performance appraisal for direct reports and setting goals/objectives, discussing tasks, assignments and projects. \nDefining the Business Plan for the IBM SW division, involving the CEO for approval. \nCommunicating the Company and the Division strategic business plans. \nAssigning duties and responsibilities based on the skills and abilities of each team member. Business Unit Manager Avnet Technology Solutions June 2011  –  October 2011  (5 months) Cusano Milanino Responsible for developing BPs and Vendor relationships. \nScheduling and conducting sales visits at assigned accounts. \nResponsible for setting and reviewing budgets for the IBM SW Business Unit over the quarters. \nCoordinating roles/communication across the team members. \nManaging processes and resources to meet customer needs, organizing and prioritizing the tasks to be performed within the team. \nResponding to internal and external customer inquiries as needed, providing assistance, resolving problems and facilitating sales transition. \nCoaching, supporting and developing direct reports providing directions. \nConducting performance appraisal for direct reports and setting goals/objectives, discussing tasks, assignments and projects. \nDefining the Business Plan for the IBM SW division, involving the CEO for approval. \nCommunicating the Company and the Division strategic business plans. \nAssigning duties and responsibilities based on the skills and abilities of each team member. Product Manager IBM Software Avnet Technology Solutions December 2010  –  May 2011  (6 months) Working closely with the Distribution Channel (Vendor and BPs) to develop the IBM SW sales in the Italian market. \nPromoting and developing sales for specific IBM SW brands, through marketing campaigns, workshops, enablement activities for BPs and targeted technical/commercial support. \nAlways up-to-date on new Vendor's rebate programs, promotions, campaigns, keeping colleagues and BPs informed. \nResponsible for IBM SW profit and lost, margins and related rebates.  \nWorking closely with sales, marketing and support to ensure revenue and customer satisfaction goals are met. Product Manager IBM Software Avnet Technology Solutions December 2010  –  May 2011  (6 months) Working closely with the Distribution Channel (Vendor and BPs) to develop the IBM SW sales in the Italian market. \nPromoting and developing sales for specific IBM SW brands, through marketing campaigns, workshops, enablement activities for BPs and targeted technical/commercial support. \nAlways up-to-date on new Vendor's rebate programs, promotions, campaigns, keeping colleagues and BPs informed. \nResponsible for IBM SW profit and lost, margins and related rebates.  \nWorking closely with sales, marketing and support to ensure revenue and customer satisfaction goals are met. Inside Sales Account Manager IBM February 2010  –  November 2010  (10 months) Handling the IBM Passport Advantage Software Renewals process for a number of clients based in central Italy, both through Direct and Channel (Business Partners) sales. \nEnhancing the relationship with customers and the cooperation with IBM distributors (Computer Gross Italia Spa, Avnet) and certified Business Partners in country. \nFollowing up the deal from the quotation phase till the order processing. \nWorking on product migrations for customers acquired through a number of Acquisitions (Filenet, Cognos). Inside Sales Account Manager IBM February 2010  –  November 2010  (10 months) Handling the IBM Passport Advantage Software Renewals process for a number of clients based in central Italy, both through Direct and Channel (Business Partners) sales. \nEnhancing the relationship with customers and the cooperation with IBM distributors (Computer Gross Italia Spa, Avnet) and certified Business Partners in country. \nFollowing up the deal from the quotation phase till the order processing. \nWorking on product migrations for customers acquired through a number of Acquisitions (Filenet, Cognos). Order Management Account Rep IBM December 2008  –  February 2010  (1 year 3 months) Acting as an interface between the customer and the IBM sales department. \nValidation of orders, backlog management. \nProcessing purchase orders using SAP. \nPerforming transaction activities such as supply, delivery, billing, billing query resolution, contract status checks. \nResolving fulfillment related problems and disputes. \nMaintaining awareness of orders and returns, and communicating issues to the customer and appropriate IBM contact points. \nParticipated to the Business Design Strategy Team, analysing, improving and developing the daily business processes for a smoother and easier way of working. Order Management Account Rep IBM December 2008  –  February 2010  (1 year 3 months) Acting as an interface between the customer and the IBM sales department. \nValidation of orders, backlog management. \nProcessing purchase orders using SAP. \nPerforming transaction activities such as supply, delivery, billing, billing query resolution, contract status checks. \nResolving fulfillment related problems and disputes. \nMaintaining awareness of orders and returns, and communicating issues to the customer and appropriate IBM contact points. \nParticipated to the Business Design Strategy Team, analysing, improving and developing the daily business processes for a smoother and easier way of working. Apple Products Sales Representative Mondadori Retail S.p.A. October 2005  –  March 2007  (1 year 6 months) Sales, Customer service and support for Apple Computer products. Apple Products Sales Representative Mondadori Retail S.p.A. October 2005  –  March 2007  (1 year 6 months) Sales, Customer service and support for Apple Computer products. Internship in Marketing INCH3 Marketing Agency - Bielefeld / Germany February 2004  –  April 2004  (3 months) Marketing, advertising, IT products promotion, including products/services by O2 Germany, leading german mobile communication company. Internship in Marketing INCH3 Marketing Agency - Bielefeld / Germany February 2004  –  April 2004  (3 months) Marketing, advertising, IT products promotion, including products/services by O2 Germany, leading german mobile communication company. Languages Italiano Native or bilingual proficiency Inglese Full professional proficiency Tedesco Limited working proficiency Italiano Native or bilingual proficiency Inglese Full professional proficiency Tedesco Limited working proficiency Italiano Native or bilingual proficiency Inglese Full professional proficiency Tedesco Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Skills Sales Management People Management Italian Product Marketing Sales Operations Inside Sales Software Sales Fluent English German Order Management SAP Microsoft Office Apple Apple Macintosh Negotiation Prospects Forecasting IBM Coaching Business Strategy New Business Development Product Management Margin Profit & Loss Management Margin Analysis Lotus Notes Outlook Salesforce.com Siebel Identifying New... Team Leadership Team leadership Gestione prodotti Marketing di prodotto New business development Sales operations Strategia d'impresa Gestione vendite Trattative Previsioni See 25+     See less Skills  Sales Management People Management Italian Product Marketing Sales Operations Inside Sales Software Sales Fluent English German Order Management SAP Microsoft Office Apple Apple Macintosh Negotiation Prospects Forecasting IBM Coaching Business Strategy New Business Development Product Management Margin Profit & Loss Management Margin Analysis Lotus Notes Outlook Salesforce.com Siebel Identifying New... Team Leadership Team leadership Gestione prodotti Marketing di prodotto New business development Sales operations Strategia d'impresa Gestione vendite Trattative Previsioni See 25+     See less Sales Management People Management Italian Product Marketing Sales Operations Inside Sales Software Sales Fluent English German Order Management SAP Microsoft Office Apple Apple Macintosh Negotiation Prospects Forecasting IBM Coaching Business Strategy New Business Development Product Management Margin Profit & Loss Management Margin Analysis Lotus Notes Outlook Salesforce.com Siebel Identifying New... Team Leadership Team leadership Gestione prodotti Marketing di prodotto New business development Sales operations Strategia d'impresa Gestione vendite Trattative Previsioni See 25+     See less Sales Management People Management Italian Product Marketing Sales Operations Inside Sales Software Sales Fluent English German Order Management SAP Microsoft Office Apple Apple Macintosh Negotiation Prospects Forecasting IBM Coaching Business Strategy New Business Development Product Management Margin Profit & Loss Management Margin Analysis Lotus Notes Outlook Salesforce.com Siebel Identifying New... Team Leadership Team leadership Gestione prodotti Marketing di prodotto New business development Sales operations Strategia d'impresa Gestione vendite Trattative Previsioni See 25+     See less Education IBM Global Sales School 2010  – 2010 Economia,  Marketing IBM Global Sales School 2010  – 2010 IBM Global Sales School 2010  – 2010 IBM Global Sales School 2010  – 2010 Economia,  Marketing Economia,  Marketing Economia,  Marketing ", "Summary Experienced sales, marketing and management professional who is highly motivated and self directed. I have the unique ability to communicate to business owners and individuals among many platforms and to bring people together to achieve a common goal. I possess exceptional interpersonal skills to lead and develop effective strategies in an organization. I am a dynamic and motivational leader with the unique ability to build rapport with clients to result in long term relationships and referral business. Summary Experienced sales, marketing and management professional who is highly motivated and self directed. I have the unique ability to communicate to business owners and individuals among many platforms and to bring people together to achieve a common goal. I possess exceptional interpersonal skills to lead and develop effective strategies in an organization. I am a dynamic and motivational leader with the unique ability to build rapport with clients to result in long term relationships and referral business. Experienced sales, marketing and management professional who is highly motivated and self directed. I have the unique ability to communicate to business owners and individuals among many platforms and to bring people together to achieve a common goal. I possess exceptional interpersonal skills to lead and develop effective strategies in an organization. I am a dynamic and motivational leader with the unique ability to build rapport with clients to result in long term relationships and referral business. Experienced sales, marketing and management professional who is highly motivated and self directed. I have the unique ability to communicate to business owners and individuals among many platforms and to bring people together to achieve a common goal. I possess exceptional interpersonal skills to lead and develop effective strategies in an organization. I am a dynamic and motivational leader with the unique ability to build rapport with clients to result in long term relationships and referral business. Experience Manager, Search Engine Marketing (SEM) Force Marketing July 2015  – Present (2 months) Greater Atlanta Area -Oversee a team of SEM Specialists to execute and develop online campaigns. \n-Coach, train and equip team members with effective digital marketing strategies to drive key KPIs and ROI. \n- Conduct daily meetings with senior management and clients to discuss opportunities for development. Manager, Program Sales - Google AdWords Agency Team - North America Revana November 2014  –  June 2015  (8 months) Tempe, AZ • Manages a team of certified adwords agency professionals to maximize sales revenue and meet company objectives. \n• Establishes and manages effective programs to coach, appraise and train team members to achieve and exceed goals \n• Accurately forecasts quarterly, monthly and weekly revenue streams. \n• Develops specific plans to ensure revenue growth in the Google agency program \n• Provides quarterly assessments of agency consultant’s productivity. \n• Coordinates proper company resources to ensure efficient and stable sales results. \n• Assists Google agency sales personnel in establishing personal contact and rapport with top echelon decision-makers. \n• Educates agency consultants by establishing programs in the areas of new account sales and agency growth, multi-product sales, profitability, and improved presentation strategies so as to improve revenue.. \n• Coach and mentor agency consultants to effectively build and maintain relationships so as to drive sales and revenue \n• Conduct daily meetings with senior management and clients to discuss KPIs and opportunities for development. Google Adwords Agency Consultant & Program Coach Revana October 2012  –  October 2014  (2 years 1 month) Worked as a Consultant with SEO, SEM & Website Management/Development Agencies to provide excellent support, recommendations, product knowledge, and effective marketing strategies so as to improve ROI and market share. This is executed by: \n \n• Effectively assisted agencies to create and optimize pay-per-click (PPC) digital advertising \ncampaigns. \n \n• Helped organizations to develop tailored strategy to execute Search, Display, Video, PLA &  \nRe-marketing campaigns to exceed client set goals.  \n \n• Analyzed PPC & Analytics data to devise strategies and inform positive actions that lead to \nexcellent results. \n \nCoaching Duties: \n \nThis involved training and developing sales representatives with regards to specific company best practices.  \n \n• Determined the organization's quality standards by assessing inbound and outbound calls by sales representatives; conducted role plays with representatives to ensure and maintain quality. \n \n• Verified results by measuring skills in product knowledge, sales and service ability, greeting, diction, listening, etiquette, objection handling, efficiency, and courteous close of call. \n \n• Provided feedback to employees by monitoring calls; conducting weekly help sessions. \n \n• Evaluated employee's approach by rating the overall effectiveness of calls; providing quality ratings and make recommendations for improvement. \n \n• Contributed to team effort by accomplishing related results as needed. Inside Sales Account Manager IBM June 2011  –  September 2012  (1 year 4 months) Effectively solicited and managed accounts for small to large size businesses in the western region in the area of servers/storage solutions. Created and developed strategies to effectively compete in the market climate so as to improve IBM's sales performance, resulting in an increase of 40%market share for IBM systemX products during my tenure. Actively managed client's pipelines and opportunities through CRM based software that allowed me to actively engage with prospects and funnel them through the sales cycle to a Win. Became very effective with time management, engaging key decision makers, lead and opportunity management and providing complex solutions based on client specific needs. Google Sales Professional-Team Leader Revana February 2010  –  May 2011  (1 year 4 months) Responsible for launching Google Tags/ Boost as well as providing high visibility place pages for clients from all over the United States and Canada. Successfully developed, executed and maintained relationshps with clients. Coached Sales representatives in achieving organizational goals and objectives. Successfully mentored team members in improving sales. Thus resulted in the expansion of the Google Tags program at DAC from ten (10) representatives to three hundred (300) during my tenure. Manager, Search Engine Marketing (SEM) Force Marketing July 2015  – Present (2 months) Greater Atlanta Area -Oversee a team of SEM Specialists to execute and develop online campaigns. \n-Coach, train and equip team members with effective digital marketing strategies to drive key KPIs and ROI. \n- Conduct daily meetings with senior management and clients to discuss opportunities for development. Manager, Search Engine Marketing (SEM) Force Marketing July 2015  – Present (2 months) Greater Atlanta Area -Oversee a team of SEM Specialists to execute and develop online campaigns. \n-Coach, train and equip team members with effective digital marketing strategies to drive key KPIs and ROI. \n- Conduct daily meetings with senior management and clients to discuss opportunities for development. Manager, Program Sales - Google AdWords Agency Team - North America Revana November 2014  –  June 2015  (8 months) Tempe, AZ • Manages a team of certified adwords agency professionals to maximize sales revenue and meet company objectives. \n• Establishes and manages effective programs to coach, appraise and train team members to achieve and exceed goals \n• Accurately forecasts quarterly, monthly and weekly revenue streams. \n• Develops specific plans to ensure revenue growth in the Google agency program \n• Provides quarterly assessments of agency consultant’s productivity. \n• Coordinates proper company resources to ensure efficient and stable sales results. \n• Assists Google agency sales personnel in establishing personal contact and rapport with top echelon decision-makers. \n• Educates agency consultants by establishing programs in the areas of new account sales and agency growth, multi-product sales, profitability, and improved presentation strategies so as to improve revenue.. \n• Coach and mentor agency consultants to effectively build and maintain relationships so as to drive sales and revenue \n• Conduct daily meetings with senior management and clients to discuss KPIs and opportunities for development. Manager, Program Sales - Google AdWords Agency Team - North America Revana November 2014  –  June 2015  (8 months) Tempe, AZ • Manages a team of certified adwords agency professionals to maximize sales revenue and meet company objectives. \n• Establishes and manages effective programs to coach, appraise and train team members to achieve and exceed goals \n• Accurately forecasts quarterly, monthly and weekly revenue streams. \n• Develops specific plans to ensure revenue growth in the Google agency program \n• Provides quarterly assessments of agency consultant’s productivity. \n• Coordinates proper company resources to ensure efficient and stable sales results. \n• Assists Google agency sales personnel in establishing personal contact and rapport with top echelon decision-makers. \n• Educates agency consultants by establishing programs in the areas of new account sales and agency growth, multi-product sales, profitability, and improved presentation strategies so as to improve revenue.. \n• Coach and mentor agency consultants to effectively build and maintain relationships so as to drive sales and revenue \n• Conduct daily meetings with senior management and clients to discuss KPIs and opportunities for development. Google Adwords Agency Consultant & Program Coach Revana October 2012  –  October 2014  (2 years 1 month) Worked as a Consultant with SEO, SEM & Website Management/Development Agencies to provide excellent support, recommendations, product knowledge, and effective marketing strategies so as to improve ROI and market share. This is executed by: \n \n• Effectively assisted agencies to create and optimize pay-per-click (PPC) digital advertising \ncampaigns. \n \n• Helped organizations to develop tailored strategy to execute Search, Display, Video, PLA &  \nRe-marketing campaigns to exceed client set goals.  \n \n• Analyzed PPC & Analytics data to devise strategies and inform positive actions that lead to \nexcellent results. \n \nCoaching Duties: \n \nThis involved training and developing sales representatives with regards to specific company best practices.  \n \n• Determined the organization's quality standards by assessing inbound and outbound calls by sales representatives; conducted role plays with representatives to ensure and maintain quality. \n \n• Verified results by measuring skills in product knowledge, sales and service ability, greeting, diction, listening, etiquette, objection handling, efficiency, and courteous close of call. \n \n• Provided feedback to employees by monitoring calls; conducting weekly help sessions. \n \n• Evaluated employee's approach by rating the overall effectiveness of calls; providing quality ratings and make recommendations for improvement. \n \n• Contributed to team effort by accomplishing related results as needed. Google Adwords Agency Consultant & Program Coach Revana October 2012  –  October 2014  (2 years 1 month) Worked as a Consultant with SEO, SEM & Website Management/Development Agencies to provide excellent support, recommendations, product knowledge, and effective marketing strategies so as to improve ROI and market share. This is executed by: \n \n• Effectively assisted agencies to create and optimize pay-per-click (PPC) digital advertising \ncampaigns. \n \n• Helped organizations to develop tailored strategy to execute Search, Display, Video, PLA &  \nRe-marketing campaigns to exceed client set goals.  \n \n• Analyzed PPC & Analytics data to devise strategies and inform positive actions that lead to \nexcellent results. \n \nCoaching Duties: \n \nThis involved training and developing sales representatives with regards to specific company best practices.  \n \n• Determined the organization's quality standards by assessing inbound and outbound calls by sales representatives; conducted role plays with representatives to ensure and maintain quality. \n \n• Verified results by measuring skills in product knowledge, sales and service ability, greeting, diction, listening, etiquette, objection handling, efficiency, and courteous close of call. \n \n• Provided feedback to employees by monitoring calls; conducting weekly help sessions. \n \n• Evaluated employee's approach by rating the overall effectiveness of calls; providing quality ratings and make recommendations for improvement. \n \n• Contributed to team effort by accomplishing related results as needed. Inside Sales Account Manager IBM June 2011  –  September 2012  (1 year 4 months) Effectively solicited and managed accounts for small to large size businesses in the western region in the area of servers/storage solutions. Created and developed strategies to effectively compete in the market climate so as to improve IBM's sales performance, resulting in an increase of 40%market share for IBM systemX products during my tenure. Actively managed client's pipelines and opportunities through CRM based software that allowed me to actively engage with prospects and funnel them through the sales cycle to a Win. Became very effective with time management, engaging key decision makers, lead and opportunity management and providing complex solutions based on client specific needs. Inside Sales Account Manager IBM June 2011  –  September 2012  (1 year 4 months) Effectively solicited and managed accounts for small to large size businesses in the western region in the area of servers/storage solutions. Created and developed strategies to effectively compete in the market climate so as to improve IBM's sales performance, resulting in an increase of 40%market share for IBM systemX products during my tenure. Actively managed client's pipelines and opportunities through CRM based software that allowed me to actively engage with prospects and funnel them through the sales cycle to a Win. Became very effective with time management, engaging key decision makers, lead and opportunity management and providing complex solutions based on client specific needs. Google Sales Professional-Team Leader Revana February 2010  –  May 2011  (1 year 4 months) Responsible for launching Google Tags/ Boost as well as providing high visibility place pages for clients from all over the United States and Canada. Successfully developed, executed and maintained relationshps with clients. Coached Sales representatives in achieving organizational goals and objectives. Successfully mentored team members in improving sales. Thus resulted in the expansion of the Google Tags program at DAC from ten (10) representatives to three hundred (300) during my tenure. Google Sales Professional-Team Leader Revana February 2010  –  May 2011  (1 year 4 months) Responsible for launching Google Tags/ Boost as well as providing high visibility place pages for clients from all over the United States and Canada. Successfully developed, executed and maintained relationshps with clients. Coached Sales representatives in achieving organizational goals and objectives. Successfully mentored team members in improving sales. Thus resulted in the expansion of the Google Tags program at DAC from ten (10) representatives to three hundred (300) during my tenure. Skills Salesforce.com Sales Leadership Marketing Solution Selling Account Management Direct Sales Sales Process Lead Generation Cloud Computing Cold Calling Sales Operations Sales Management Channel Partners Time Management New Business Development CRM Business Development Call Centers Customer Satisfaction Team Building Marketing Strategy Strategic Planning SEO Coaching Management SaaS Strategic Partnerships Selling B2B Customer Retention Sales Presentations Enterprise Software Product Marketing Google Adwords See 20+     See less Skills  Salesforce.com Sales Leadership Marketing Solution Selling Account Management Direct Sales Sales Process Lead Generation Cloud Computing Cold Calling Sales Operations Sales Management Channel Partners Time Management New Business Development CRM Business Development Call Centers Customer Satisfaction Team Building Marketing Strategy Strategic Planning SEO Coaching Management SaaS Strategic Partnerships Selling B2B Customer Retention Sales Presentations Enterprise Software Product Marketing Google Adwords See 20+     See less Salesforce.com Sales Leadership Marketing Solution Selling Account Management Direct Sales Sales Process Lead Generation Cloud Computing Cold Calling Sales Operations Sales Management Channel Partners Time Management New Business Development CRM Business Development Call Centers Customer Satisfaction Team Building Marketing Strategy Strategic Planning SEO Coaching Management SaaS Strategic Partnerships Selling B2B Customer Retention Sales Presentations Enterprise Software Product Marketing Google Adwords See 20+     See less Salesforce.com Sales Leadership Marketing Solution Selling Account Management Direct Sales Sales Process Lead Generation Cloud Computing Cold Calling Sales Operations Sales Management Channel Partners Time Management New Business Development CRM Business Development Call Centers Customer Satisfaction Team Building Marketing Strategy Strategic Planning SEO Coaching Management SaaS Strategic Partnerships Selling B2B Customer Retention Sales Presentations Enterprise Software Product Marketing Google Adwords See 20+     See less Education University of Sunderland MBA,  Marketing 2008  – 2010 University of the West Indies, Mona Bsc,  Management Studies 2001  – 2004 University of Sunderland MBA,  Marketing 2008  – 2010 University of Sunderland MBA,  Marketing 2008  – 2010 University of Sunderland MBA,  Marketing 2008  – 2010 University of the West Indies, Mona Bsc,  Management Studies 2001  – 2004 University of the West Indies, Mona Bsc,  Management Studies 2001  – 2004 University of the West Indies, Mona Bsc,  Management Studies 2001  – 2004 Honors & Awards Google Adwords Fundamental Google,Inc April 2015 Google Search Advertising Google,Inc May 2015 Google Analytics Google Inc June 2015 Google Display Advertising Google Inc June 2015 Google Video Advertising Google Inc June 2015 Additional Honors & Awards 2009-2010 Platinum Sales Leader -Google Map Sales \n2010-2011 Platinum Sales Leader -Google Map Sales \n2011-2012 IBM Certified Systems and Sales Expert \n2014-2015 Manager of the Quarter Google Adwords Fundamental Google,Inc April 2015 Google Adwords Fundamental Google,Inc April 2015 Google Adwords Fundamental Google,Inc April 2015 Google Search Advertising Google,Inc May 2015 Google Search Advertising Google,Inc May 2015 Google Search Advertising Google,Inc May 2015 Google Analytics Google Inc June 2015 Google Analytics Google Inc June 2015 Google Analytics Google Inc June 2015 Google Display Advertising Google Inc June 2015 Google Display Advertising Google Inc June 2015 Google Display Advertising Google Inc June 2015 Google Video Advertising Google Inc June 2015 Google Video Advertising Google Inc June 2015 Google Video Advertising Google Inc June 2015 Additional Honors & Awards 2009-2010 Platinum Sales Leader -Google Map Sales \n2010-2011 Platinum Sales Leader -Google Map Sales \n2011-2012 IBM Certified Systems and Sales Expert \n2014-2015 Manager of the Quarter Additional Honors & Awards 2009-2010 Platinum Sales Leader -Google Map Sales \n2010-2011 Platinum Sales Leader -Google Map Sales \n2011-2012 IBM Certified Systems and Sales Expert \n2014-2015 Manager of the Quarter Additional Honors & Awards 2009-2010 Platinum Sales Leader -Google Map Sales \n2010-2011 Platinum Sales Leader -Google Map Sales \n2011-2012 IBM Certified Systems and Sales Expert \n2014-2015 Manager of the Quarter ", "Skills Channel Partners Managed Services SAN Sales Storage Storage Area Networks Storage Solutions Virtualization NAS Storage Virtualization VMware Skills  Channel Partners Managed Services SAN Sales Storage Storage Area Networks Storage Solutions Virtualization NAS Storage Virtualization VMware Channel Partners Managed Services SAN Sales Storage Storage Area Networks Storage Solutions Virtualization NAS Storage Virtualization VMware Channel Partners Managed Services SAN Sales Storage Storage Area Networks Storage Solutions Virtualization NAS Storage Virtualization VMware ", "Experience WebEx Territory Sales Representative Cisco Systems December 2013  – Present (1 year 9 months) Phoenix, Arizona Area System X Inside Sales Account Manager at IBM IBM June 2012  –  December 2013  (1 year 7 months) Tempe, AZ Certified System X and Storage Sales Consultant \nAccount Acquisition \nStrategic Planning \nProject Management \nNew Business Development / Sales \nSales Forecasting Certified Google AdWords Consultant Direct Alliance October 2010  –  June 2012  (1 year 9 months) Tempe Generate sales / revenues through inbound calls and cultivation of warm leads through outbound calls, educating / offering clients a good ROI for investing in enhancement of online presence; develop opportunities, deliver benefits presentations, demonstrate value, close sales and build referral base. \n \n• Noted for recognizing opportunities to upsell large clients, providing education and strategy to meet their marketing needs. \n• Consistently in top 3% of Account reps that earned Rewards for Exceeding goals month after month. \n \nCreating and managing Google AdWords accounts of varying budgets; and implementing Google's best practices for search, display and rich media; including YouTube, Google TV and mobile advertisements. \n \n. SMB Account Manager Hewlett-Packard January 2010  –  October 2010  (10 months) Channel Account Manager Secure Resolutions January 2008  –  December 2009  (2 years) Senior Account Manager MicroAge August 2006  –  December 2007  (1 year 5 months) Tempe, AZ Owner Shutters Up August 2004  –  August 2006  (2 years 1 month) Maricopa, AZ Territory Account Manager Insight Public Sector 2000  –  2004  (4 years) WebEx Territory Sales Representative Cisco Systems December 2013  – Present (1 year 9 months) Phoenix, Arizona Area WebEx Territory Sales Representative Cisco Systems December 2013  – Present (1 year 9 months) Phoenix, Arizona Area System X Inside Sales Account Manager at IBM IBM June 2012  –  December 2013  (1 year 7 months) Tempe, AZ Certified System X and Storage Sales Consultant \nAccount Acquisition \nStrategic Planning \nProject Management \nNew Business Development / Sales \nSales Forecasting System X Inside Sales Account Manager at IBM IBM June 2012  –  December 2013  (1 year 7 months) Tempe, AZ Certified System X and Storage Sales Consultant \nAccount Acquisition \nStrategic Planning \nProject Management \nNew Business Development / Sales \nSales Forecasting Certified Google AdWords Consultant Direct Alliance October 2010  –  June 2012  (1 year 9 months) Tempe Generate sales / revenues through inbound calls and cultivation of warm leads through outbound calls, educating / offering clients a good ROI for investing in enhancement of online presence; develop opportunities, deliver benefits presentations, demonstrate value, close sales and build referral base. \n \n• Noted for recognizing opportunities to upsell large clients, providing education and strategy to meet their marketing needs. \n• Consistently in top 3% of Account reps that earned Rewards for Exceeding goals month after month. \n \nCreating and managing Google AdWords accounts of varying budgets; and implementing Google's best practices for search, display and rich media; including YouTube, Google TV and mobile advertisements. \n \n. Certified Google AdWords Consultant Direct Alliance October 2010  –  June 2012  (1 year 9 months) Tempe Generate sales / revenues through inbound calls and cultivation of warm leads through outbound calls, educating / offering clients a good ROI for investing in enhancement of online presence; develop opportunities, deliver benefits presentations, demonstrate value, close sales and build referral base. \n \n• Noted for recognizing opportunities to upsell large clients, providing education and strategy to meet their marketing needs. \n• Consistently in top 3% of Account reps that earned Rewards for Exceeding goals month after month. \n \nCreating and managing Google AdWords accounts of varying budgets; and implementing Google's best practices for search, display and rich media; including YouTube, Google TV and mobile advertisements. \n \n. SMB Account Manager Hewlett-Packard January 2010  –  October 2010  (10 months) SMB Account Manager Hewlett-Packard January 2010  –  October 2010  (10 months) Channel Account Manager Secure Resolutions January 2008  –  December 2009  (2 years) Channel Account Manager Secure Resolutions January 2008  –  December 2009  (2 years) Senior Account Manager MicroAge August 2006  –  December 2007  (1 year 5 months) Tempe, AZ Senior Account Manager MicroAge August 2006  –  December 2007  (1 year 5 months) Tempe, AZ Owner Shutters Up August 2004  –  August 2006  (2 years 1 month) Maricopa, AZ Owner Shutters Up August 2004  –  August 2006  (2 years 1 month) Maricopa, AZ Territory Account Manager Insight Public Sector 2000  –  2004  (4 years) Territory Account Manager Insight Public Sector 2000  –  2004  (4 years) Skills Software Licensing Salesforce.com Solution Selling Call Centers Sales Operations Channel Partners Disaster Recovery Marketing SaaS Tablets Cloud Computing Start-ups Laptops Managed Services Printers New Business Development Strategy Enterprise Storage See 3+     See less Skills  Software Licensing Salesforce.com Solution Selling Call Centers Sales Operations Channel Partners Disaster Recovery Marketing SaaS Tablets Cloud Computing Start-ups Laptops Managed Services Printers New Business Development Strategy Enterprise Storage See 3+     See less Software Licensing Salesforce.com Solution Selling Call Centers Sales Operations Channel Partners Disaster Recovery Marketing SaaS Tablets Cloud Computing Start-ups Laptops Managed Services Printers New Business Development Strategy Enterprise Storage See 3+     See less Software Licensing Salesforce.com Solution Selling Call Centers Sales Operations Channel Partners Disaster Recovery Marketing SaaS Tablets Cloud Computing Start-ups Laptops Managed Services Printers New Business Development Strategy Enterprise Storage See 3+     See less Education University of Arizona BS,  Chemistry 1994  – 1998 University of Arizona BS,  Chemistry 1994  – 1998 University of Arizona BS,  Chemistry 1994  – 1998 University of Arizona BS,  Chemistry 1994  – 1998 ", "Experience System X Inside Sales Account Manager IBM June 2012  – Present (3 years 3 months) Phoenix Territory Account Manager Insight 2000  –  2004  (4 years) System X Inside Sales Account Manager IBM June 2012  – Present (3 years 3 months) Phoenix System X Inside Sales Account Manager IBM June 2012  – Present (3 years 3 months) Phoenix Territory Account Manager Insight 2000  –  2004  (4 years) Territory Account Manager Insight 2000  –  2004  (4 years) Education University of Arizona Bachelor of Science,  Chemistry 1995  – 1998 University of Arizona Bachelor of Science,  Chemistry 1995  – 1998 University of Arizona Bachelor of Science,  Chemistry 1995  – 1998 University of Arizona Bachelor of Science,  Chemistry 1995  – 1998 ", "Experience Director, US Education Panasonic USA 2015  – Present (less than a year) Tampa/St. Petersburg, Florida Area Leading a talented team of sales people focused on building the Panasonic brand in Higher Education and K-12 Education. By utilizing Panasonic's breadth of high quality solutions in the areas of Security, Mobility, A/V, Projectors and Displays, we are helping universities meet their students and faculty needs. In the K-12 market we are helping schools with Panasonic's Connected Classroom solution, which allows digital learning to take place anywhere in the classroom or outside the classroom. VP of Sales/Channels Hapara 2014  –  2015  (1 year) Tampa/St. Petersburg, Florida Area VP of Sales, Software & Solutions Promethean October 2011  –  October 2014  (3 years 1 month) Dallas/Fort Worth Area Regional Sales Director AchieveGlobal November 2008  –  October 2011  (3 years) Exec. Dir. of Inside Sales & Channels, North America Nortel January 2006  –  November 2007  (1 year 11 months) US Education Software Sales Manager Apple Computer 2000  –  2005  (5 years) Territory Manager/BI Sales Oracle Corporation 1995  –  2000  (5 years) Account Manager / System Engineer Information Builders 1991  –  1995  (4 years) Inside Sales Account Manager IBM September 1987  –  April 1991  (3 years 8 months) Tampa/St. Petersburg, Florida Area US Navy US Navy 1981  –  1987  (6 years) Director, US Education Panasonic USA 2015  – Present (less than a year) Tampa/St. Petersburg, Florida Area Leading a talented team of sales people focused on building the Panasonic brand in Higher Education and K-12 Education. By utilizing Panasonic's breadth of high quality solutions in the areas of Security, Mobility, A/V, Projectors and Displays, we are helping universities meet their students and faculty needs. In the K-12 market we are helping schools with Panasonic's Connected Classroom solution, which allows digital learning to take place anywhere in the classroom or outside the classroom. Director, US Education Panasonic USA 2015  – Present (less than a year) Tampa/St. Petersburg, Florida Area Leading a talented team of sales people focused on building the Panasonic brand in Higher Education and K-12 Education. By utilizing Panasonic's breadth of high quality solutions in the areas of Security, Mobility, A/V, Projectors and Displays, we are helping universities meet their students and faculty needs. In the K-12 market we are helping schools with Panasonic's Connected Classroom solution, which allows digital learning to take place anywhere in the classroom or outside the classroom. VP of Sales/Channels Hapara 2014  –  2015  (1 year) Tampa/St. Petersburg, Florida Area VP of Sales/Channels Hapara 2014  –  2015  (1 year) Tampa/St. Petersburg, Florida Area VP of Sales, Software & Solutions Promethean October 2011  –  October 2014  (3 years 1 month) Dallas/Fort Worth Area VP of Sales, Software & Solutions Promethean October 2011  –  October 2014  (3 years 1 month) Dallas/Fort Worth Area Regional Sales Director AchieveGlobal November 2008  –  October 2011  (3 years) Regional Sales Director AchieveGlobal November 2008  –  October 2011  (3 years) Exec. Dir. of Inside Sales & Channels, North America Nortel January 2006  –  November 2007  (1 year 11 months) Exec. Dir. of Inside Sales & Channels, North America Nortel January 2006  –  November 2007  (1 year 11 months) US Education Software Sales Manager Apple Computer 2000  –  2005  (5 years) US Education Software Sales Manager Apple Computer 2000  –  2005  (5 years) Territory Manager/BI Sales Oracle Corporation 1995  –  2000  (5 years) Territory Manager/BI Sales Oracle Corporation 1995  –  2000  (5 years) Account Manager / System Engineer Information Builders 1991  –  1995  (4 years) Account Manager / System Engineer Information Builders 1991  –  1995  (4 years) Inside Sales Account Manager IBM September 1987  –  April 1991  (3 years 8 months) Tampa/St. Petersburg, Florida Area Inside Sales Account Manager IBM September 1987  –  April 1991  (3 years 8 months) Tampa/St. Petersburg, Florida Area US Navy US Navy 1981  –  1987  (6 years) US Navy US Navy 1981  –  1987  (6 years) Skills Sales Process Organizational... Solution Selling Positioning Business Development Sales Management Leadership Succession Planning Qualifying Prospects Account Management Sales Operations Strategy Sales Blended Learning Management Selling Skills Training Recruiting Leadership Development Selling CRM Coaching Performance Management Instructional Design Program Management Change Management See 11+     See less Skills  Sales Process Organizational... Solution Selling Positioning Business Development Sales Management Leadership Succession Planning Qualifying Prospects Account Management Sales Operations Strategy Sales Blended Learning Management Selling Skills Training Recruiting Leadership Development Selling CRM Coaching Performance Management Instructional Design Program Management Change Management See 11+     See less Sales Process Organizational... Solution Selling Positioning Business Development Sales Management Leadership Succession Planning Qualifying Prospects Account Management Sales Operations Strategy Sales Blended Learning Management Selling Skills Training Recruiting Leadership Development Selling CRM Coaching Performance Management Instructional Design Program Management Change Management See 11+     See less Sales Process Organizational... Solution Selling Positioning Business Development Sales Management Leadership Succession Planning Qualifying Prospects Account Management Sales Operations Strategy Sales Blended Learning Management Selling Skills Training Recruiting Leadership Development Selling CRM Coaching Performance Management Instructional Design Program Management Change Management See 11+     See less Education University of South Florida - College of Business Administration Bachelor of Science (BS) 1987  – 1990 University of South Florida - College of Business Administration Bachelor of Science (BS) 1987  – 1990 University of South Florida - College of Business Administration Bachelor of Science (BS) 1987  – 1990 University of South Florida - College of Business Administration Bachelor of Science (BS) 1987  – 1990 ", "Skills Skills     Honors & Awards Salesperson of the Month Red Door Homes April 2014 Salesperson of the Month Red Door Homes April 2014 Salesperson of the Month Red Door Homes April 2014 Salesperson of the Month Red Door Homes April 2014 ", "Experience Account Executive Google January 2015  – Present (8 months) Toronto, Canada Area Account Executive Google January 2015  – Present (8 months) Toronto, Canada Area Account Executive Google January 2015  – Present (8 months) Toronto, Canada Area Skills Advertising Sales Sales SEM Mobile Advertising Online Advertising Account Management Local Search Lead Generation Mobile Marketing B2B PPC Online Marketing SEO Digital Marketing Google Adwords Web Analytics Digital Media Search Advertising Marketing Strategy Customer Acquisition Strategy Digital Strategy Business Development Google Analytics Conversion Optimization Email Marketing Social Media Marketing Organic Search Direct Marketing Web Marketing See 15+     See less Skills  Advertising Sales Sales SEM Mobile Advertising Online Advertising Account Management Local Search Lead Generation Mobile Marketing B2B PPC Online Marketing SEO Digital Marketing Google Adwords Web Analytics Digital Media Search Advertising Marketing Strategy Customer Acquisition Strategy Digital Strategy Business Development Google Analytics Conversion Optimization Email Marketing Social Media Marketing Organic Search Direct Marketing Web Marketing See 15+     See less Advertising Sales Sales SEM Mobile Advertising Online Advertising Account Management Local Search Lead Generation Mobile Marketing B2B PPC Online Marketing SEO Digital Marketing Google Adwords Web Analytics Digital Media Search Advertising Marketing Strategy Customer Acquisition Strategy Digital Strategy Business Development Google Analytics Conversion Optimization Email Marketing Social Media Marketing Organic Search Direct Marketing Web Marketing See 15+     See less Advertising Sales Sales SEM Mobile Advertising Online Advertising Account Management Local Search Lead Generation Mobile Marketing B2B PPC Online Marketing SEO Digital Marketing Google Adwords Web Analytics Digital Media Search Advertising Marketing Strategy Customer Acquisition Strategy Digital Strategy Business Development Google Analytics Conversion Optimization Email Marketing Social Media Marketing Organic Search Direct Marketing Web Marketing See 15+     See less Education Ryerson University Business Commerce 1998  – 2001 Ryerson University Business Commerce 1998  – 2001 Ryerson University Business Commerce 1998  – 2001 Ryerson University Business Commerce 1998  – 2001 ", "Experience Inside Sales Account Manager IBM June 2012  – Present (3 years 3 months) Munich Area, Germany Inside Sales / Account Manager Open Text May 2011  – Present (4 years 4 months) Account Manager BLS Clinical Services April 2005  –  December 2009  (4 years 9 months) Berlin Area, Germany Inside Sales Representative Vignette February 2004  –  March 2005  (1 year 2 months) Frankfurt Am Main Area, Germany Inside Sales Account Manager IBM June 2012  – Present (3 years 3 months) Munich Area, Germany Inside Sales Account Manager IBM June 2012  – Present (3 years 3 months) Munich Area, Germany Inside Sales / Account Manager Open Text May 2011  – Present (4 years 4 months) Inside Sales / Account Manager Open Text May 2011  – Present (4 years 4 months) Account Manager BLS Clinical Services April 2005  –  December 2009  (4 years 9 months) Berlin Area, Germany Account Manager BLS Clinical Services April 2005  –  December 2009  (4 years 9 months) Berlin Area, Germany Inside Sales Representative Vignette February 2004  –  March 2005  (1 year 2 months) Frankfurt Am Main Area, Germany Inside Sales Representative Vignette February 2004  –  March 2005  (1 year 2 months) Frankfurt Am Main Area, Germany Skills Intercultural... Project Management International Sales Team Building TeamPlay Solution Selling Enterprise Software SaaS Cloud Computing Salesforce.com Direct Sales Strategic Partnerships Inside Sales CRM Lead Generation Marketing Strategy Business Development New Business Development Management See 4+     See less Skills  Intercultural... Project Management International Sales Team Building TeamPlay Solution Selling Enterprise Software SaaS Cloud Computing Salesforce.com Direct Sales Strategic Partnerships Inside Sales CRM Lead Generation Marketing Strategy Business Development New Business Development Management See 4+     See less Intercultural... Project Management International Sales Team Building TeamPlay Solution Selling Enterprise Software SaaS Cloud Computing Salesforce.com Direct Sales Strategic Partnerships Inside Sales CRM Lead Generation Marketing Strategy Business Development New Business Development Management See 4+     See less Intercultural... Project Management International Sales Team Building TeamPlay Solution Selling Enterprise Software SaaS Cloud Computing Salesforce.com Direct Sales Strategic Partnerships Inside Sales CRM Lead Generation Marketing Strategy Business Development New Business Development Management See 4+     See less Education Universität Karlsruhe (TH) Universität Karlsruhe (TH) Universität Karlsruhe (TH) Universität Karlsruhe (TH) ", "Experience Inside Sales Account Manager IBM IBM July 2009  –  December 2013  (4 years 6 months) System x Sales Certified, Pure Systems and VMware Sales Certified Product Manager II - IBM Insight February 2002  –  April 2009  (7 years 3 months) Tempe, Arizona Managed relationship with External Customer IBM, Product Sales, Marketing, Training. Customer Engineer Revana formerly Direct Alliance 1999  –  2000  (1 year) Inside Sales Account Manager IBM IBM July 2009  –  December 2013  (4 years 6 months) System x Sales Certified, Pure Systems and VMware Sales Certified Inside Sales Account Manager IBM IBM July 2009  –  December 2013  (4 years 6 months) System x Sales Certified, Pure Systems and VMware Sales Certified Product Manager II - IBM Insight February 2002  –  April 2009  (7 years 3 months) Tempe, Arizona Managed relationship with External Customer IBM, Product Sales, Marketing, Training. Product Manager II - IBM Insight February 2002  –  April 2009  (7 years 3 months) Tempe, Arizona Managed relationship with External Customer IBM, Product Sales, Marketing, Training. Customer Engineer Revana formerly Direct Alliance 1999  –  2000  (1 year) Customer Engineer Revana formerly Direct Alliance 1999  –  2000  (1 year) Skills Pre-Sales Technical... Product Management VMware Direct Sales Cloud Computing Solution Selling Selling System X Vendor Management Channel Partners Partner Engagement Vendor Partnerships IBM System x Servers Event Designing Planning & Execution of... Storage Solutions Sales Professional Services Sales Process Salesforce.com Sales Operations Sales Management Account Management Partner Management Software Industry Storage Data Center Demand Generation Pre-sales Go-to-market Strategy Virtualization Business Alliances Unified Communications Resellers Lead Generation Channel Sales Strategic Partnerships Storage Area Networks HP Enterprise Storage Storage Virtualization Complex Sales SMB VDI CRM NAS Partner Development Sales Presentations Product Marketing Multi-channel Marketing See 35+     See less Skills  Pre-Sales Technical... Product Management VMware Direct Sales Cloud Computing Solution Selling Selling System X Vendor Management Channel Partners Partner Engagement Vendor Partnerships IBM System x Servers Event Designing Planning & Execution of... Storage Solutions Sales Professional Services Sales Process Salesforce.com Sales Operations Sales Management Account Management Partner Management Software Industry Storage Data Center Demand Generation Pre-sales Go-to-market Strategy Virtualization Business Alliances Unified Communications Resellers Lead Generation Channel Sales Strategic Partnerships Storage Area Networks HP Enterprise Storage Storage Virtualization Complex Sales SMB VDI CRM NAS Partner Development Sales Presentations Product Marketing Multi-channel Marketing See 35+     See less Pre-Sales Technical... Product Management VMware Direct Sales Cloud Computing Solution Selling Selling System X Vendor Management Channel Partners Partner Engagement Vendor Partnerships IBM System x Servers Event Designing Planning & Execution of... Storage Solutions Sales Professional Services Sales Process Salesforce.com Sales Operations Sales Management Account Management Partner Management Software Industry Storage Data Center Demand Generation Pre-sales Go-to-market Strategy Virtualization Business Alliances Unified Communications Resellers Lead Generation Channel Sales Strategic Partnerships Storage Area Networks HP Enterprise Storage Storage Virtualization Complex Sales SMB VDI CRM NAS Partner Development Sales Presentations Product Marketing Multi-channel Marketing See 35+     See less Pre-Sales Technical... Product Management VMware Direct Sales Cloud Computing Solution Selling Selling System X Vendor Management Channel Partners Partner Engagement Vendor Partnerships IBM System x Servers Event Designing Planning & Execution of... Storage Solutions Sales Professional Services Sales Process Salesforce.com Sales Operations Sales Management Account Management Partner Management Software Industry Storage Data Center Demand Generation Pre-sales Go-to-market Strategy Virtualization Business Alliances Unified Communications Resellers Lead Generation Channel Sales Strategic Partnerships Storage Area Networks HP Enterprise Storage Storage Virtualization Complex Sales SMB VDI CRM NAS Partner Development Sales Presentations Product Marketing Multi-channel Marketing See 35+     See less Education West Chester Henderson West Chester Henderson West Chester Henderson West Chester Henderson ", "Languages English Italian Spanish English Italian Spanish English Italian Spanish Skills Direct Sales Hardware Security Negotiation Business Planning Teamwork English Operating Systems Forecasting Social Media Databases Selling Sales Spanish Problem Solving Pre-sales Team Building CRM Enterprise Software Channel Partners Management Sales Process Data Center Consultative Selling Call Centers See 10+     See less Skills  Direct Sales Hardware Security Negotiation Business Planning Teamwork English Operating Systems Forecasting Social Media Databases Selling Sales Spanish Problem Solving Pre-sales Team Building CRM Enterprise Software Channel Partners Management Sales Process Data Center Consultative Selling Call Centers See 10+     See less Direct Sales Hardware Security Negotiation Business Planning Teamwork English Operating Systems Forecasting Social Media Databases Selling Sales Spanish Problem Solving Pre-sales Team Building CRM Enterprise Software Channel Partners Management Sales Process Data Center Consultative Selling Call Centers See 10+     See less Direct Sales Hardware Security Negotiation Business Planning Teamwork English Operating Systems Forecasting Social Media Databases Selling Sales Spanish Problem Solving Pre-sales Team Building CRM Enterprise Software Channel Partners Management Sales Process Data Center Consultative Selling Call Centers See 10+     See less Honors & Awards Hundred Percent Club 2013 IBM 2013 Hundred Percent Club 2012 IBM 2012 Hundred Percent Club 2011 IBM 2011 Hundred Percent Club 2010 IBM 2010 Internal sales recognition for top performers (100%+ quota achieved) Hundred Percent Club 2013 IBM 2013 Hundred Percent Club 2013 IBM 2013 Hundred Percent Club 2013 IBM 2013 Hundred Percent Club 2012 IBM 2012 Hundred Percent Club 2012 IBM 2012 Hundred Percent Club 2012 IBM 2012 Hundred Percent Club 2011 IBM 2011 Hundred Percent Club 2011 IBM 2011 Hundred Percent Club 2011 IBM 2011 Hundred Percent Club 2010 IBM 2010 Internal sales recognition for top performers (100%+ quota achieved) Hundred Percent Club 2010 IBM 2010 Internal sales recognition for top performers (100%+ quota achieved) Hundred Percent Club 2010 IBM 2010 Internal sales recognition for top performers (100%+ quota achieved) ", "Experience Account Manager Spirent Communications August 2014  – Present (1 year 1 month) Inside Account Manager - B2B Hewlett-Packard November 2012  –  June 2013  (8 months) PLANO, TX Consultant Consultant March 2012  –  November 2012  (9 months) Dallas, TX Inside Sales Account Manager IBM October 2010  –  January 2012  (1 year 4 months) Coppell, TX Channel Mgr Convergys (acquired Intervoice) March 2009  –  September 2010  (1 year 7 months) Dallas/Fort Worth Area Inside Territory Account Manager Nortel July 2006  –  March 2009  (2 years 9 months) Richardson, TX Account Executive (field) Paycom August 2005  –  July 2006  (1 year) Lewisville, TX Consultant Consultant September 2000  –  June 2005  (4 years 10 months) Dallas, TX Major Account Executve Sterling Commerce (acquired by AT&T, then IBM) February 2000  –  August 2000  (7 months) Irving, TX Regional Sales Mgr & Account Mgr-EDS Candle Corporation June 1996  –  January 2000  (3 years 8 months) Dallas, TX Consultant Consultant February 1995  –  December 1995  (11 months) Dallas, Tx Inside Sales Manager-Government / OPS Mgr The Future Now January 1994  –  December 1994  (1 year) Fairfax, VA Inside Sales Mgr Micrografx October 1989  –  March 1993  (3 years 6 months) Richardson, TX Account Manager Spirent Communications August 2014  – Present (1 year 1 month) Account Manager Spirent Communications August 2014  – Present (1 year 1 month) Inside Account Manager - B2B Hewlett-Packard November 2012  –  June 2013  (8 months) PLANO, TX Inside Account Manager - B2B Hewlett-Packard November 2012  –  June 2013  (8 months) PLANO, TX Consultant Consultant March 2012  –  November 2012  (9 months) Dallas, TX Consultant Consultant March 2012  –  November 2012  (9 months) Dallas, TX Inside Sales Account Manager IBM October 2010  –  January 2012  (1 year 4 months) Coppell, TX Inside Sales Account Manager IBM October 2010  –  January 2012  (1 year 4 months) Coppell, TX Channel Mgr Convergys (acquired Intervoice) March 2009  –  September 2010  (1 year 7 months) Dallas/Fort Worth Area Channel Mgr Convergys (acquired Intervoice) March 2009  –  September 2010  (1 year 7 months) Dallas/Fort Worth Area Inside Territory Account Manager Nortel July 2006  –  March 2009  (2 years 9 months) Richardson, TX Inside Territory Account Manager Nortel July 2006  –  March 2009  (2 years 9 months) Richardson, TX Account Executive (field) Paycom August 2005  –  July 2006  (1 year) Lewisville, TX Account Executive (field) Paycom August 2005  –  July 2006  (1 year) Lewisville, TX Consultant Consultant September 2000  –  June 2005  (4 years 10 months) Dallas, TX Consultant Consultant September 2000  –  June 2005  (4 years 10 months) Dallas, TX Major Account Executve Sterling Commerce (acquired by AT&T, then IBM) February 2000  –  August 2000  (7 months) Irving, TX Major Account Executve Sterling Commerce (acquired by AT&T, then IBM) February 2000  –  August 2000  (7 months) Irving, TX Regional Sales Mgr & Account Mgr-EDS Candle Corporation June 1996  –  January 2000  (3 years 8 months) Dallas, TX Regional Sales Mgr & Account Mgr-EDS Candle Corporation June 1996  –  January 2000  (3 years 8 months) Dallas, TX Consultant Consultant February 1995  –  December 1995  (11 months) Dallas, Tx Consultant Consultant February 1995  –  December 1995  (11 months) Dallas, Tx Inside Sales Manager-Government / OPS Mgr The Future Now January 1994  –  December 1994  (1 year) Fairfax, VA Inside Sales Manager-Government / OPS Mgr The Future Now January 1994  –  December 1994  (1 year) Fairfax, VA Inside Sales Mgr Micrografx October 1989  –  March 1993  (3 years 6 months) Richardson, TX Inside Sales Mgr Micrografx October 1989  –  March 1993  (3 years 6 months) Richardson, TX Skills Selling Channel Partners Channel Solution Selling Software Solutions Consultative Selling SaaS IVR Hosted Services Cloud Computing Software Sales Channel Management Complex Sales Unified Communications WebEx Managed Services VoIP Partner Management SMB Major Accounts Enterprise Software Direct Sales Account Management Sales Management Sales Process Collaboration Solutions Enterprise Mobility IP Telecommunications Telepresence Value Proposition Sales Presentations PBX Telephony Cold Calling Start-ups Go-to-market Strategy Professional Services Management Sales Sales Enablement Security Salesforce.com Business Alliances Strategic Partnerships Demand Generation Pre-sales Lead Generation CRM Customer Satisfaction See 35+     See less Skills  Selling Channel Partners Channel Solution Selling Software Solutions Consultative Selling SaaS IVR Hosted Services Cloud Computing Software Sales Channel Management Complex Sales Unified Communications WebEx Managed Services VoIP Partner Management SMB Major Accounts Enterprise Software Direct Sales Account Management Sales Management Sales Process Collaboration Solutions Enterprise Mobility IP Telecommunications Telepresence Value Proposition Sales Presentations PBX Telephony Cold Calling Start-ups Go-to-market Strategy Professional Services Management Sales Sales Enablement Security Salesforce.com Business Alliances Strategic Partnerships Demand Generation Pre-sales Lead Generation CRM Customer Satisfaction See 35+     See less Selling Channel Partners Channel Solution Selling Software Solutions Consultative Selling SaaS IVR Hosted Services Cloud Computing Software Sales Channel Management Complex Sales Unified Communications WebEx Managed Services VoIP Partner Management SMB Major Accounts Enterprise Software Direct Sales Account Management Sales Management Sales Process Collaboration Solutions Enterprise Mobility IP Telecommunications Telepresence Value Proposition Sales Presentations PBX Telephony Cold Calling Start-ups Go-to-market Strategy Professional Services Management Sales Sales Enablement Security Salesforce.com Business Alliances Strategic Partnerships Demand Generation Pre-sales Lead Generation CRM Customer Satisfaction See 35+     See less Selling Channel Partners Channel Solution Selling Software Solutions Consultative Selling SaaS IVR Hosted Services Cloud Computing Software Sales Channel Management Complex Sales Unified Communications WebEx Managed Services VoIP Partner Management SMB Major Accounts Enterprise Software Direct Sales Account Management Sales Management Sales Process Collaboration Solutions Enterprise Mobility IP Telecommunications Telepresence Value Proposition Sales Presentations PBX Telephony Cold Calling Start-ups Go-to-market Strategy Professional Services Management Sales Sales Enablement Security Salesforce.com Business Alliances Strategic Partnerships Demand Generation Pre-sales Lead Generation CRM Customer Satisfaction See 35+     See less ", "Experience Account Executive-Acquisitions Dell Inc January 2015  – Present (8 months) Greater Chicago Area Selling Dell's End to End Solutions on Client, Server, Storage, Software and Services to Acquisition accounts in and around Chicago. Enterprise Account Executive Lenovo August 2012  –  May 2014  (1 year 10 months) Greater Chicago Area Focusing on customers PC needs and driving new lines of business with Software, Intel based servers, storage and services. Direct sales and business development functions including customer relationship development, product presentations, roadmap overviews, solution selling and pricing negotiations. Focus on management of territory through business partners and growing territory through joint account mapping strategies, joint sales calls and engaging channel resources. Some of the accounts in my territory are State Farm, Walgreens, CNA, Molex, Medline, Kirkland & Ellis, Winston & Strawn and Sidley Austin. Sever and Technology Group Sales Representative IBM July 2007  –  August 2012  (5 years 2 months) Chicago, Illinois Worked in competitive territory focusing on IBM Storage and Power Systems. The last year focused on IBM Storage only. \nMade IBM 100 Percent Club in 2008 and 2010. PC Sales Executive Lenovo May 2005  –  June 2007  (2 years 2 months) Chicago, Illinois Focused on Client hardware for Fortune 1000 customers in Chicago area. Business development from the ground up for this new territory. Worked the territory from nothing to making 100 Percent Club in 2005 and 2006. Honors included Champion Award in 2006. PC Sales IBM October 2000  –  May 2005  (4 years 8 months) Chicago Focused on Client hardware for Fortune 1000 customers in Chicago area. Business development from the ground up for this new territory. Worked the territory from nothing to making 100 Percent Club in 2002, 2003, 2004, 2005. Honors included Sales Person of the Year in 2003. Inside Sales Account Manager- IBM DB2 Software Computer Associates, Inc June 1999  –  August 2000  (1 year 3 months) Lisle, IL Responsible for sales of IBM DB2 products in the Midwest Region focusing on Small/Mid-Market accounts. Worked closely with Account Managers selling to C-Level and Information Technology Executives. Inside Sales Representative Platinum Technology November 1998  –  June 1999  (8 months) Lisle, Illinois Initially hired for Inbound Sales generation and achieved upward advancement to Inside Sales Representative for DB2 Software in Midwest Region selling to Small/Mid-market accounts. Account Executive-Acquisitions Dell Inc January 2015  – Present (8 months) Greater Chicago Area Selling Dell's End to End Solutions on Client, Server, Storage, Software and Services to Acquisition accounts in and around Chicago. Account Executive-Acquisitions Dell Inc January 2015  – Present (8 months) Greater Chicago Area Selling Dell's End to End Solutions on Client, Server, Storage, Software and Services to Acquisition accounts in and around Chicago. Enterprise Account Executive Lenovo August 2012  –  May 2014  (1 year 10 months) Greater Chicago Area Focusing on customers PC needs and driving new lines of business with Software, Intel based servers, storage and services. Direct sales and business development functions including customer relationship development, product presentations, roadmap overviews, solution selling and pricing negotiations. Focus on management of territory through business partners and growing territory through joint account mapping strategies, joint sales calls and engaging channel resources. Some of the accounts in my territory are State Farm, Walgreens, CNA, Molex, Medline, Kirkland & Ellis, Winston & Strawn and Sidley Austin. Enterprise Account Executive Lenovo August 2012  –  May 2014  (1 year 10 months) Greater Chicago Area Focusing on customers PC needs and driving new lines of business with Software, Intel based servers, storage and services. Direct sales and business development functions including customer relationship development, product presentations, roadmap overviews, solution selling and pricing negotiations. Focus on management of territory through business partners and growing territory through joint account mapping strategies, joint sales calls and engaging channel resources. Some of the accounts in my territory are State Farm, Walgreens, CNA, Molex, Medline, Kirkland & Ellis, Winston & Strawn and Sidley Austin. Sever and Technology Group Sales Representative IBM July 2007  –  August 2012  (5 years 2 months) Chicago, Illinois Worked in competitive territory focusing on IBM Storage and Power Systems. The last year focused on IBM Storage only. \nMade IBM 100 Percent Club in 2008 and 2010. Sever and Technology Group Sales Representative IBM July 2007  –  August 2012  (5 years 2 months) Chicago, Illinois Worked in competitive territory focusing on IBM Storage and Power Systems. The last year focused on IBM Storage only. \nMade IBM 100 Percent Club in 2008 and 2010. PC Sales Executive Lenovo May 2005  –  June 2007  (2 years 2 months) Chicago, Illinois Focused on Client hardware for Fortune 1000 customers in Chicago area. Business development from the ground up for this new territory. Worked the territory from nothing to making 100 Percent Club in 2005 and 2006. Honors included Champion Award in 2006. PC Sales Executive Lenovo May 2005  –  June 2007  (2 years 2 months) Chicago, Illinois Focused on Client hardware for Fortune 1000 customers in Chicago area. Business development from the ground up for this new territory. Worked the territory from nothing to making 100 Percent Club in 2005 and 2006. Honors included Champion Award in 2006. PC Sales IBM October 2000  –  May 2005  (4 years 8 months) Chicago Focused on Client hardware for Fortune 1000 customers in Chicago area. Business development from the ground up for this new territory. Worked the territory from nothing to making 100 Percent Club in 2002, 2003, 2004, 2005. Honors included Sales Person of the Year in 2003. PC Sales IBM October 2000  –  May 2005  (4 years 8 months) Chicago Focused on Client hardware for Fortune 1000 customers in Chicago area. Business development from the ground up for this new territory. Worked the territory from nothing to making 100 Percent Club in 2002, 2003, 2004, 2005. Honors included Sales Person of the Year in 2003. Inside Sales Account Manager- IBM DB2 Software Computer Associates, Inc June 1999  –  August 2000  (1 year 3 months) Lisle, IL Responsible for sales of IBM DB2 products in the Midwest Region focusing on Small/Mid-Market accounts. Worked closely with Account Managers selling to C-Level and Information Technology Executives. Inside Sales Account Manager- IBM DB2 Software Computer Associates, Inc June 1999  –  August 2000  (1 year 3 months) Lisle, IL Responsible for sales of IBM DB2 products in the Midwest Region focusing on Small/Mid-Market accounts. Worked closely with Account Managers selling to C-Level and Information Technology Executives. Inside Sales Representative Platinum Technology November 1998  –  June 1999  (8 months) Lisle, Illinois Initially hired for Inbound Sales generation and achieved upward advancement to Inside Sales Representative for DB2 Software in Midwest Region selling to Small/Mid-market accounts. Inside Sales Representative Platinum Technology November 1998  –  June 1999  (8 months) Lisle, Illinois Initially hired for Inbound Sales generation and achieved upward advancement to Inside Sales Representative for DB2 Software in Midwest Region selling to Small/Mid-market accounts. Skills DS4000 Cloud Computing Enterprise Software Pre-sales Key Account Management Data Center Business Alliances Partner Management Sales SaaS Servers Professional Services Storage Solutions Managed Services CRM Salesforce.com Solution Selling Infrastructure Storage See 4+     See less Skills  DS4000 Cloud Computing Enterprise Software Pre-sales Key Account Management Data Center Business Alliances Partner Management Sales SaaS Servers Professional Services Storage Solutions Managed Services CRM Salesforce.com Solution Selling Infrastructure Storage See 4+     See less DS4000 Cloud Computing Enterprise Software Pre-sales Key Account Management Data Center Business Alliances Partner Management Sales SaaS Servers Professional Services Storage Solutions Managed Services CRM Salesforce.com Solution Selling Infrastructure Storage See 4+     See less DS4000 Cloud Computing Enterprise Software Pre-sales Key Account Management Data Center Business Alliances Partner Management Sales SaaS Servers Professional Services Storage Solutions Managed Services CRM Salesforce.com Solution Selling Infrastructure Storage See 4+     See less Education St. Norbert College Business Administration,  Business Spent a semester studying abroad in London, traveled extensively throughout Europe. Activities and Societies:  4 Year Letterman in Football Richmond, The American International University in London International/Global Studies St. Norbert College Business Administration,  Business Spent a semester studying abroad in London, traveled extensively throughout Europe. Activities and Societies:  4 Year Letterman in Football St. Norbert College Business Administration,  Business Spent a semester studying abroad in London, traveled extensively throughout Europe. Activities and Societies:  4 Year Letterman in Football St. Norbert College Business Administration,  Business Spent a semester studying abroad in London, traveled extensively throughout Europe. Activities and Societies:  4 Year Letterman in Football Richmond, The American International University in London International/Global Studies Richmond, The American International University in London International/Global Studies Richmond, The American International University in London International/Global Studies ", "Experience Inside Sales Account Manager Arrow Electronics Inc, Enterprise Computing Solutions October 2006  – Present (8 years 11 months) Indianapolis, Indiana Area •\tInside Sales Account Manager, IBM Group (July 2014 – Current) \nForecasting assigned account’s revenue attainment and gross profit for total opportunity management, increased focus on IBM Technical Support Services portfolio, proactively provide assistance and training in a Team Lead role. \n•\tInside Sales Representative Senior, IBM Group (October 2006 – July 2014) \nResponsible for the sales support, account management, and customer service activities for assigned accounts. Assist IBM Business Partners / Resellers in determining and understanding end user’s requirements for maintenance offerings and Technical Support Services. Assist with designing solutions for their customers. Create quotes and contracts using IBM tools and manage customer orders thru billing reconciliation. Director of Sales White Lodging Services Corporation March 1997  –  October 2006  (9 years 8 months) Indianapolis, Indiana Area •\tDirector of Sales (February 2005 – October 2006) \nOversee marketing initiatives, all proactive and reactive sales efforts for the Indianapolis Airport Cluster Hotels \n•\tGroup Sales Manager (October 2002 – December 2003 & November 2004 – February 2005) \nBuild relationships with new and existing clients, negotiate contracts for meeting space and group room blocks for the Downtown Indianapolis Cluster Hotels \n•\tInventory Revenue Manager (January 2004 – October 2004) \nMaintain group and transient guest room inventory for four downtown Indianapolis hotels, forecasting, budgeting room sales & revenue for the Downtown Indianapolis Cluster Hotels \n•\tGroup Housing Coordinator (February 2001 – October 2002) \nCreate group room blocks per negotiated contracts, assist with rooming lists and reservations, pre-blocking, group billing arrangements for Downtown Indianapolis Cluster Hotels \n•\tSales & Marketing Assistant, Pre-Opening Team (April 2000 – February 2001) \nSupport Director of Marketing and senior sales managers on proposals and contracts, administrative responsibilities for the Indianapolis Marriott Downtown \n•\tOperations Manager (June 1999 – April 2000) \nManage staff of 25 associates, administrative responsibilities, scheduling, payroll, accounting, guest relations, training, and orientation for the Fairfield Inn & Suites Indianapolis Airport \n•\tOperations Supervisor (March 1997 – June 1999) \nGuest service representative, supervise front office and housekeeping staff, guest relations, training, accounts receivable, and accounts payable for the Courtyard Marriott at the Capital Inside Sales Account Manager Arrow Electronics Inc, Enterprise Computing Solutions October 2006  – Present (8 years 11 months) Indianapolis, Indiana Area •\tInside Sales Account Manager, IBM Group (July 2014 – Current) \nForecasting assigned account’s revenue attainment and gross profit for total opportunity management, increased focus on IBM Technical Support Services portfolio, proactively provide assistance and training in a Team Lead role. \n•\tInside Sales Representative Senior, IBM Group (October 2006 – July 2014) \nResponsible for the sales support, account management, and customer service activities for assigned accounts. Assist IBM Business Partners / Resellers in determining and understanding end user’s requirements for maintenance offerings and Technical Support Services. Assist with designing solutions for their customers. Create quotes and contracts using IBM tools and manage customer orders thru billing reconciliation. Inside Sales Account Manager Arrow Electronics Inc, Enterprise Computing Solutions October 2006  – Present (8 years 11 months) Indianapolis, Indiana Area •\tInside Sales Account Manager, IBM Group (July 2014 – Current) \nForecasting assigned account’s revenue attainment and gross profit for total opportunity management, increased focus on IBM Technical Support Services portfolio, proactively provide assistance and training in a Team Lead role. \n•\tInside Sales Representative Senior, IBM Group (October 2006 – July 2014) \nResponsible for the sales support, account management, and customer service activities for assigned accounts. Assist IBM Business Partners / Resellers in determining and understanding end user’s requirements for maintenance offerings and Technical Support Services. Assist with designing solutions for their customers. Create quotes and contracts using IBM tools and manage customer orders thru billing reconciliation. Director of Sales White Lodging Services Corporation March 1997  –  October 2006  (9 years 8 months) Indianapolis, Indiana Area •\tDirector of Sales (February 2005 – October 2006) \nOversee marketing initiatives, all proactive and reactive sales efforts for the Indianapolis Airport Cluster Hotels \n•\tGroup Sales Manager (October 2002 – December 2003 & November 2004 – February 2005) \nBuild relationships with new and existing clients, negotiate contracts for meeting space and group room blocks for the Downtown Indianapolis Cluster Hotels \n•\tInventory Revenue Manager (January 2004 – October 2004) \nMaintain group and transient guest room inventory for four downtown Indianapolis hotels, forecasting, budgeting room sales & revenue for the Downtown Indianapolis Cluster Hotels \n•\tGroup Housing Coordinator (February 2001 – October 2002) \nCreate group room blocks per negotiated contracts, assist with rooming lists and reservations, pre-blocking, group billing arrangements for Downtown Indianapolis Cluster Hotels \n•\tSales & Marketing Assistant, Pre-Opening Team (April 2000 – February 2001) \nSupport Director of Marketing and senior sales managers on proposals and contracts, administrative responsibilities for the Indianapolis Marriott Downtown \n•\tOperations Manager (June 1999 – April 2000) \nManage staff of 25 associates, administrative responsibilities, scheduling, payroll, accounting, guest relations, training, and orientation for the Fairfield Inn & Suites Indianapolis Airport \n•\tOperations Supervisor (March 1997 – June 1999) \nGuest service representative, supervise front office and housekeeping staff, guest relations, training, accounts receivable, and accounts payable for the Courtyard Marriott at the Capital Director of Sales White Lodging Services Corporation March 1997  –  October 2006  (9 years 8 months) Indianapolis, Indiana Area •\tDirector of Sales (February 2005 – October 2006) \nOversee marketing initiatives, all proactive and reactive sales efforts for the Indianapolis Airport Cluster Hotels \n•\tGroup Sales Manager (October 2002 – December 2003 & November 2004 – February 2005) \nBuild relationships with new and existing clients, negotiate contracts for meeting space and group room blocks for the Downtown Indianapolis Cluster Hotels \n•\tInventory Revenue Manager (January 2004 – October 2004) \nMaintain group and transient guest room inventory for four downtown Indianapolis hotels, forecasting, budgeting room sales & revenue for the Downtown Indianapolis Cluster Hotels \n•\tGroup Housing Coordinator (February 2001 – October 2002) \nCreate group room blocks per negotiated contracts, assist with rooming lists and reservations, pre-blocking, group billing arrangements for Downtown Indianapolis Cluster Hotels \n•\tSales & Marketing Assistant, Pre-Opening Team (April 2000 – February 2001) \nSupport Director of Marketing and senior sales managers on proposals and contracts, administrative responsibilities for the Indianapolis Marriott Downtown \n•\tOperations Manager (June 1999 – April 2000) \nManage staff of 25 associates, administrative responsibilities, scheduling, payroll, accounting, guest relations, training, and orientation for the Fairfield Inn & Suites Indianapolis Airport \n•\tOperations Supervisor (March 1997 – June 1999) \nGuest service representative, supervise front office and housekeeping staff, guest relations, training, accounts receivable, and accounts payable for the Courtyard Marriott at the Capital Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Customer Service Sales Hotels Management Forecasting Inventory Management Sales Management Contract Negotiation Hospitality Marketing Team Building Negotiation Account Management Event Management Pricing Sales Process Strategic Planning Marketing Strategy Budgets Sales Operations Direct Sales Customer Satisfaction Tourism Revenue Analysis Trade Shows Hospitality Management Strategy Solution Selling Training Channel Partners Salesforce.com CRM Selling B2B See 19+     See less Skills  Customer Service Sales Hotels Management Forecasting Inventory Management Sales Management Contract Negotiation Hospitality Marketing Team Building Negotiation Account Management Event Management Pricing Sales Process Strategic Planning Marketing Strategy Budgets Sales Operations Direct Sales Customer Satisfaction Tourism Revenue Analysis Trade Shows Hospitality Management Strategy Solution Selling Training Channel Partners Salesforce.com CRM Selling B2B See 19+     See less Customer Service Sales Hotels Management Forecasting Inventory Management Sales Management Contract Negotiation Hospitality Marketing Team Building Negotiation Account Management Event Management Pricing Sales Process Strategic Planning Marketing Strategy Budgets Sales Operations Direct Sales Customer Satisfaction Tourism Revenue Analysis Trade Shows Hospitality Management Strategy Solution Selling Training Channel Partners Salesforce.com CRM Selling B2B See 19+     See less Customer Service Sales Hotels Management Forecasting Inventory Management Sales Management Contract Negotiation Hospitality Marketing Team Building Negotiation Account Management Event Management Pricing Sales Process Strategic Planning Marketing Strategy Budgets Sales Operations Direct Sales Customer Satisfaction Tourism Revenue Analysis Trade Shows Hospitality Management Strategy Solution Selling Training Channel Partners Salesforce.com CRM Selling B2B See 19+     See less Education Indiana University-Purdue University at Indianapolis Associate’s Degree,  Restaurant , Hotel, Institutional and Tourism Management 1996  – 1999 Hospitality Management, Foodservice, and Lodging Supervision Associate of Science Degree Activities and Societies:  Member of IUPUI Chapter of the Phi Eta Sigma National Honor Society Indiana University-Purdue University at Indianapolis Associate’s Degree,  Restaurant , Hotel, Institutional and Tourism Management 1996  – 1999 Hospitality Management, Foodservice, and Lodging Supervision Associate of Science Degree Activities and Societies:  Member of IUPUI Chapter of the Phi Eta Sigma National Honor Society Indiana University-Purdue University at Indianapolis Associate’s Degree,  Restaurant , Hotel, Institutional and Tourism Management 1996  – 1999 Hospitality Management, Foodservice, and Lodging Supervision Associate of Science Degree Activities and Societies:  Member of IUPUI Chapter of the Phi Eta Sigma National Honor Society Indiana University-Purdue University at Indianapolis Associate’s Degree,  Restaurant , Hotel, Institutional and Tourism Management 1996  – 1999 Hospitality Management, Foodservice, and Lodging Supervision Associate of Science Degree Activities and Societies:  Member of IUPUI Chapter of the Phi Eta Sigma National Honor Society Honors & Awards Additional Honors & Awards Honored by Arrow Enterprise Computing Solutions with the 2010 Service Excellence Award Additional Honors & Awards Honored by Arrow Enterprise Computing Solutions with the 2010 Service Excellence Award Additional Honors & Awards Honored by Arrow Enterprise Computing Solutions with the 2010 Service Excellence Award Additional Honors & Awards Honored by Arrow Enterprise Computing Solutions with the 2010 Service Excellence Award ", "Summary I have over 10 years experience in the sales and management industry. \nI am a target driven individual with a proven track record of excelling under pressure and exceeding targets. \n \nI am a highly trained salesperson and business development consultant. \n \nExperienced in business to business telesales/sales and an expert at conversing with key decision makers to negotiate and close sales. \n \nExcellent communication, interpersonal and influencing skills.  \nI am hard working enthusiastic and have a passion for sales and business development. \n \nI have built up strong relationships with business owners and would have a large network of contacts. Summary I have over 10 years experience in the sales and management industry. \nI am a target driven individual with a proven track record of excelling under pressure and exceeding targets. \n \nI am a highly trained salesperson and business development consultant. \n \nExperienced in business to business telesales/sales and an expert at conversing with key decision makers to negotiate and close sales. \n \nExcellent communication, interpersonal and influencing skills.  \nI am hard working enthusiastic and have a passion for sales and business development. \n \nI have built up strong relationships with business owners and would have a large network of contacts. I have over 10 years experience in the sales and management industry. \nI am a target driven individual with a proven track record of excelling under pressure and exceeding targets. \n \nI am a highly trained salesperson and business development consultant. \n \nExperienced in business to business telesales/sales and an expert at conversing with key decision makers to negotiate and close sales. \n \nExcellent communication, interpersonal and influencing skills.  \nI am hard working enthusiastic and have a passion for sales and business development. \n \nI have built up strong relationships with business owners and would have a large network of contacts. I have over 10 years experience in the sales and management industry. \nI am a target driven individual with a proven track record of excelling under pressure and exceeding targets. \n \nI am a highly trained salesperson and business development consultant. \n \nExperienced in business to business telesales/sales and an expert at conversing with key decision makers to negotiate and close sales. \n \nExcellent communication, interpersonal and influencing skills.  \nI am hard working enthusiastic and have a passion for sales and business development. \n \nI have built up strong relationships with business owners and would have a large network of contacts. Experience Business Development Manager Focus Media Group February 2014  –  February 2015  (1 year 1 month) Suite 238 The Caple Building , Mary's Abbey Dublin 7 Inside Sales Account Manager IBM October 2012  –  January 2014  (1 year 4 months) lepordstown 12 Month Contract Inside Sales Specialist Chill Insurance March 2012  –  September 2012  (7 months) 6 Month Contract Inside Sales Account Executive Creditsafe February 2011  –  March 2012  (1 year 2 months) Managing Director A&A Contract Cleaning December 2008  –  December 2010  (2 years 1 month) Sales Manager Belgard Motors August 2006  –  September 2008  (2 years 2 months) Business Development Manager Focus Media Group February 2014  –  February 2015  (1 year 1 month) Suite 238 The Caple Building , Mary's Abbey Dublin 7 Business Development Manager Focus Media Group February 2014  –  February 2015  (1 year 1 month) Suite 238 The Caple Building , Mary's Abbey Dublin 7 Inside Sales Account Manager IBM October 2012  –  January 2014  (1 year 4 months) lepordstown 12 Month Contract Inside Sales Account Manager IBM October 2012  –  January 2014  (1 year 4 months) lepordstown 12 Month Contract Inside Sales Specialist Chill Insurance March 2012  –  September 2012  (7 months) 6 Month Contract Inside Sales Specialist Chill Insurance March 2012  –  September 2012  (7 months) 6 Month Contract Inside Sales Account Executive Creditsafe February 2011  –  March 2012  (1 year 2 months) Inside Sales Account Executive Creditsafe February 2011  –  March 2012  (1 year 2 months) Managing Director A&A Contract Cleaning December 2008  –  December 2010  (2 years 1 month) Managing Director A&A Contract Cleaning December 2008  –  December 2010  (2 years 1 month) Sales Manager Belgard Motors August 2006  –  September 2008  (2 years 2 months) Sales Manager Belgard Motors August 2006  –  September 2008  (2 years 2 months) Skills Solution Selling Cloud Computing Direct Sales B2B Business Development Sales Customer Service Leadership Salesforce.com CRM New Business Development Cold Calling Sales Presentations Contract Negotiation Account Management Lead Generation Customer Satisfaction Management Networking Team Leadership Key Account Management SaaS Customer Retention Social Networking Teamwork Selling Sales Management Sales Process Team Management Negotiation Sales Operations Strategy Online Marketing Marketing Strategy See 19+     See less Skills  Solution Selling Cloud Computing Direct Sales B2B Business Development Sales Customer Service Leadership Salesforce.com CRM New Business Development Cold Calling Sales Presentations Contract Negotiation Account Management Lead Generation Customer Satisfaction Management Networking Team Leadership Key Account Management SaaS Customer Retention Social Networking Teamwork Selling Sales Management Sales Process Team Management Negotiation Sales Operations Strategy Online Marketing Marketing Strategy See 19+     See less Solution Selling Cloud Computing Direct Sales B2B Business Development Sales Customer Service Leadership Salesforce.com CRM New Business Development Cold Calling Sales Presentations Contract Negotiation Account Management Lead Generation Customer Satisfaction Management Networking Team Leadership Key Account Management SaaS Customer Retention Social Networking Teamwork Selling Sales Management Sales Process Team Management Negotiation Sales Operations Strategy Online Marketing Marketing Strategy See 19+     See less Solution Selling Cloud Computing Direct Sales B2B Business Development Sales Customer Service Leadership Salesforce.com CRM New Business Development Cold Calling Sales Presentations Contract Negotiation Account Management Lead Generation Customer Satisfaction Management Networking Team Leadership Key Account Management SaaS Customer Retention Social Networking Teamwork Selling Sales Management Sales Process Team Management Negotiation Sales Operations Strategy Online Marketing Marketing Strategy See 19+     See less Education Firhouse Community College Fitzwilliam Institute Diploma,  Sales and Marketing Firhouse Community College Firhouse Community College Firhouse Community College Fitzwilliam Institute Diploma,  Sales and Marketing Fitzwilliam Institute Diploma,  Sales and Marketing Fitzwilliam Institute Diploma,  Sales and Marketing ", "Summary Sales professional with 12 years field sales experience in both new Business Development and Account Management. I am a customer and revenue focused individual, who embraces the challenge of both acquiring and growing sales accounts. I have a proven track record in exceeding monthly targets, through generating new business and developing longstanding profitable relationships with customers at both corporate and SME level. Summary Sales professional with 12 years field sales experience in both new Business Development and Account Management. I am a customer and revenue focused individual, who embraces the challenge of both acquiring and growing sales accounts. I have a proven track record in exceeding monthly targets, through generating new business and developing longstanding profitable relationships with customers at both corporate and SME level. Sales professional with 12 years field sales experience in both new Business Development and Account Management. I am a customer and revenue focused individual, who embraces the challenge of both acquiring and growing sales accounts. I have a proven track record in exceeding monthly targets, through generating new business and developing longstanding profitable relationships with customers at both corporate and SME level. Sales professional with 12 years field sales experience in both new Business Development and Account Management. I am a customer and revenue focused individual, who embraces the challenge of both acquiring and growing sales accounts. I have a proven track record in exceeding monthly targets, through generating new business and developing longstanding profitable relationships with customers at both corporate and SME level. Experience S&S Renewals Inside Sales Account Manager IBM August 2013  – Present (2 years 1 month) Ballycoolin, Dublin Responsible for managing IBM Software renewals for accounts within the UK Public Sector. Business Account Manager eircom for business September 2009  –  November 2012  (3 years 3 months) Dublin Field based Account Manager, managing a base of key eMobile accounts with combined revenue of approximately €600k per annum. Responsible for retaining and growing this business year on year. \n \nResponsible for resolving billing, coverage or technical issues for customers. I worked closely with my landline and data specialist colleagues in providing end to end ICT and mobile solutions for our customers. Business Development Manager Meteor Mobile Communications October 2000  –  August 2009  (8 years 11 months) Meteor Mobile Communications •Field based business sales role, responsible for achieving monthly voice and broadband sales targets by acquiring high quality business customers and maximizing customer satisfaction and loyalty.  \n \n•New business was generated through cold calling/ converting inbound leads, networking or through referrals from existing customers. Activity was recorded and tracked through Salesforce which we updated on a daily basis. \n \n•Consistently achieved and exceeded monthly sales targets. I developed good pipeline management skills in this role over the last number of years. S&S Renewals Inside Sales Account Manager IBM August 2013  – Present (2 years 1 month) Ballycoolin, Dublin Responsible for managing IBM Software renewals for accounts within the UK Public Sector. S&S Renewals Inside Sales Account Manager IBM August 2013  – Present (2 years 1 month) Ballycoolin, Dublin Responsible for managing IBM Software renewals for accounts within the UK Public Sector. Business Account Manager eircom for business September 2009  –  November 2012  (3 years 3 months) Dublin Field based Account Manager, managing a base of key eMobile accounts with combined revenue of approximately €600k per annum. Responsible for retaining and growing this business year on year. \n \nResponsible for resolving billing, coverage or technical issues for customers. I worked closely with my landline and data specialist colleagues in providing end to end ICT and mobile solutions for our customers. Business Account Manager eircom for business September 2009  –  November 2012  (3 years 3 months) Dublin Field based Account Manager, managing a base of key eMobile accounts with combined revenue of approximately €600k per annum. Responsible for retaining and growing this business year on year. \n \nResponsible for resolving billing, coverage or technical issues for customers. I worked closely with my landline and data specialist colleagues in providing end to end ICT and mobile solutions for our customers. Business Development Manager Meteor Mobile Communications October 2000  –  August 2009  (8 years 11 months) Meteor Mobile Communications •Field based business sales role, responsible for achieving monthly voice and broadband sales targets by acquiring high quality business customers and maximizing customer satisfaction and loyalty.  \n \n•New business was generated through cold calling/ converting inbound leads, networking or through referrals from existing customers. Activity was recorded and tracked through Salesforce which we updated on a daily basis. \n \n•Consistently achieved and exceeded monthly sales targets. I developed good pipeline management skills in this role over the last number of years. Business Development Manager Meteor Mobile Communications October 2000  –  August 2009  (8 years 11 months) Meteor Mobile Communications •Field based business sales role, responsible for achieving monthly voice and broadband sales targets by acquiring high quality business customers and maximizing customer satisfaction and loyalty.  \n \n•New business was generated through cold calling/ converting inbound leads, networking or through referrals from existing customers. Activity was recorded and tracked through Salesforce which we updated on a daily basis. \n \n•Consistently achieved and exceeded monthly sales targets. I developed good pipeline management skills in this role over the last number of years. Languages French Limited working proficiency German Limited working proficiency French Limited working proficiency German Limited working proficiency French Limited working proficiency German Limited working proficiency Limited working proficiency Limited working proficiency Skills Mobile Communications Telecommunications Direct Sales Broadband Customer Service Mobile Devices Management Managed Services Customer Satisfaction Customer Experience Sales New Business Development Relationship Management Communication Key Account Management Solution Selling Analytical Skills Negotiation Networking Customer Retention Call Centers B2B Business Development Sales Operations Team Management Selling Sales Process New Business... Sales Management See 14+     See less Skills  Mobile Communications Telecommunications Direct Sales Broadband Customer Service Mobile Devices Management Managed Services Customer Satisfaction Customer Experience Sales New Business Development Relationship Management Communication Key Account Management Solution Selling Analytical Skills Negotiation Networking Customer Retention Call Centers B2B Business Development Sales Operations Team Management Selling Sales Process New Business... Sales Management See 14+     See less Mobile Communications Telecommunications Direct Sales Broadband Customer Service Mobile Devices Management Managed Services Customer Satisfaction Customer Experience Sales New Business Development Relationship Management Communication Key Account Management Solution Selling Analytical Skills Negotiation Networking Customer Retention Call Centers B2B Business Development Sales Operations Team Management Selling Sales Process New Business... Sales Management See 14+     See less Mobile Communications Telecommunications Direct Sales Broadband Customer Service Mobile Devices Management Managed Services Customer Satisfaction Customer Experience Sales New Business Development Relationship Management Communication Key Account Management Solution Selling Analytical Skills Negotiation Networking Customer Retention Call Centers B2B Business Development Sales Operations Team Management Selling Sales Process New Business... Sales Management See 14+     See less Education IBM Global Sales School IBM Global Sales School Programme 2013  – 2015 This is a two year educational programme which covers a wide range of IBM products and services and how to sell the IBM way. Dublin Institute of Technology Diploma,  Direct Marketing 1999  – 2000 Diploma in Direct Marketing Dublin Business School Diploma,  Business Studies 1991  – 1992 Postgraduate Diploma in Business Studies University College Dublin HDIP,  French and German 1990  – 1991 Bachelor of Arts Degree in French and German University College Dublin BA,  French and German 1987  – 1990 Higher Diploma in Eduction IBM Global Sales School IBM Global Sales School Programme 2013  – 2015 This is a two year educational programme which covers a wide range of IBM products and services and how to sell the IBM way. IBM Global Sales School IBM Global Sales School Programme 2013  – 2015 This is a two year educational programme which covers a wide range of IBM products and services and how to sell the IBM way. IBM Global Sales School IBM Global Sales School Programme 2013  – 2015 This is a two year educational programme which covers a wide range of IBM products and services and how to sell the IBM way. Dublin Institute of Technology Diploma,  Direct Marketing 1999  – 2000 Diploma in Direct Marketing Dublin Institute of Technology Diploma,  Direct Marketing 1999  – 2000 Diploma in Direct Marketing Dublin Institute of Technology Diploma,  Direct Marketing 1999  – 2000 Diploma in Direct Marketing Dublin Business School Diploma,  Business Studies 1991  – 1992 Postgraduate Diploma in Business Studies Dublin Business School Diploma,  Business Studies 1991  – 1992 Postgraduate Diploma in Business Studies Dublin Business School Diploma,  Business Studies 1991  – 1992 Postgraduate Diploma in Business Studies University College Dublin HDIP,  French and German 1990  – 1991 Bachelor of Arts Degree in French and German University College Dublin HDIP,  French and German 1990  – 1991 Bachelor of Arts Degree in French and German University College Dublin HDIP,  French and German 1990  – 1991 Bachelor of Arts Degree in French and German University College Dublin BA,  French and German 1987  – 1990 Higher Diploma in Eduction University College Dublin BA,  French and German 1987  – 1990 Higher Diploma in Eduction University College Dublin BA,  French and German 1987  – 1990 Higher Diploma in Eduction ", "Summary Accomplished sales leader with a proven track record in identifying and driving revenue from multimillion-dollar opportunities. Applies a business savvy and entrepreneurial spirit to build relationships with C-level decision makers. Able to understand current and future business needs, and position products that increase efficiency, lower cost and drive sales growth. \n \nSpecialties: C-Level Presentations & Communication, New Business Development and Retention, Sales Account Management, Complex Contract Negotiations, Team Leadership Summary Accomplished sales leader with a proven track record in identifying and driving revenue from multimillion-dollar opportunities. Applies a business savvy and entrepreneurial spirit to build relationships with C-level decision makers. Able to understand current and future business needs, and position products that increase efficiency, lower cost and drive sales growth. \n \nSpecialties: C-Level Presentations & Communication, New Business Development and Retention, Sales Account Management, Complex Contract Negotiations, Team Leadership Accomplished sales leader with a proven track record in identifying and driving revenue from multimillion-dollar opportunities. Applies a business savvy and entrepreneurial spirit to build relationships with C-level decision makers. Able to understand current and future business needs, and position products that increase efficiency, lower cost and drive sales growth. \n \nSpecialties: C-Level Presentations & Communication, New Business Development and Retention, Sales Account Management, Complex Contract Negotiations, Team Leadership Accomplished sales leader with a proven track record in identifying and driving revenue from multimillion-dollar opportunities. Applies a business savvy and entrepreneurial spirit to build relationships with C-level decision makers. Able to understand current and future business needs, and position products that increase efficiency, lower cost and drive sales growth. \n \nSpecialties: C-Level Presentations & Communication, New Business Development and Retention, Sales Account Management, Complex Contract Negotiations, Team Leadership Experience Senior Account Executive PayPal July 2013  – Present (2 years 2 months) Chandler, Arizona Strategic consultant responsible for positioning PayPal Merchant Services with large e-Commerce merchants. Collaborate with multiple departments within large corporations and outside developers to ensure a smooth transition to PayPal.  Account Executive PayPal September 2012  – Present (3 years) Chandler, Arizona Healthcare IT Sales Executive DrFirst January 2012  –  September 2012  (9 months) Phoenix, Arizona Area Work with small to medium ambulatory care practices providing guidance in the transition to a paperless environment.  \n \nWork with office managers, practice managers and physicians selling a modular EMR.  \n \nHelp guide practices through the conundrum of meaningful use, misconceptions and help them make educated decisions to increase their bottom line, control their patient population and maintain their current workflow. Inside Sales Specialist Mobile Mini Inc April 2011  –  January 2012  (10 months) Call customers generated from both advertising and self generated leads \nManage and grow existing customer accounts in a true service driven manner \nWork with individual branches all across the United States and Canada logistically for deliveries and product availability for the customers. Inside Sales Account Manager- IBM Technical Services Direct Alliance March 2006  –  May 2011  (5 years 3 months) Contracted by IBM Corporation. Develop relationships with customers acting as a consultant to their business and work with them to make sure their needs are being met. \n \nIdentify accounts that may have hidden assets to maximize productivity and enhance customer service. \n \nProactively develop relationships with client representatives in the field, and work with them to make sure the customers are serviced correctly while collaboratively working out solutions for the customer to maximize profitability for the company. Account Manager Customer Funding Group December 2005  –  March 2006  (4 months) Managed accounts maintained accounts by teaching best practices to other companies on how to best utilize product.  \n \nResponsible for up selling other accounts and building long term relationships with clients. Sales Manager Customer Funding Group February 2005  –  December 2005  (11 months) Hired, trained, supervised and mentored 12 sales people  \n \nMotivated staff to meet and exceed established sales goals and objectives by developing effective sales incentives.  \n \nGave final approval on all sales.  \n \nMonitored and reported sales volume to Executive Vice President. Sales Executive Customer Funding Group November 2003  –  February 2005  (1 year 4 months) Responsible for generating new business by way of cold calling in strategic markets across the United States.  \n \nMet and consistently exceeded monthly goals and objectives in a fast paced saturated market. Weekend General Manager Pure Firness March 2002  –  November 2003  (1 year 9 months) Reported to general manager. Responsible for 100% of clubs gross sales Friday, Saturday, and Sunday. Managed a team to drive the club to hit sales quota for the weekends. Train and enhance the skills of other team members. Sales Consultant/ Trainer Pure Fitness December 2001  –  March 2002  (4 months) Worked in membership sales helping people get involved in fitness and achieve their goals. Also set up personal training programs based on customers goals. Assistant General Manager 24 Hour Fitness January 2000  –  December 2001  (2 years) Assisted the general manager with tasks including management of staff, hitting goals, and also responsible for entire club when manager was absent \n \nHired, trained, and enhanced the skills of other team members while maintaining own goals and sales quotas Senior Account Executive PayPal July 2013  – Present (2 years 2 months) Chandler, Arizona Strategic consultant responsible for positioning PayPal Merchant Services with large e-Commerce merchants. Collaborate with multiple departments within large corporations and outside developers to ensure a smooth transition to PayPal.  Senior Account Executive PayPal July 2013  – Present (2 years 2 months) Chandler, Arizona Strategic consultant responsible for positioning PayPal Merchant Services with large e-Commerce merchants. Collaborate with multiple departments within large corporations and outside developers to ensure a smooth transition to PayPal.  Account Executive PayPal September 2012  – Present (3 years) Chandler, Arizona Account Executive PayPal September 2012  – Present (3 years) Chandler, Arizona Healthcare IT Sales Executive DrFirst January 2012  –  September 2012  (9 months) Phoenix, Arizona Area Work with small to medium ambulatory care practices providing guidance in the transition to a paperless environment.  \n \nWork with office managers, practice managers and physicians selling a modular EMR.  \n \nHelp guide practices through the conundrum of meaningful use, misconceptions and help them make educated decisions to increase their bottom line, control their patient population and maintain their current workflow. Healthcare IT Sales Executive DrFirst January 2012  –  September 2012  (9 months) Phoenix, Arizona Area Work with small to medium ambulatory care practices providing guidance in the transition to a paperless environment.  \n \nWork with office managers, practice managers and physicians selling a modular EMR.  \n \nHelp guide practices through the conundrum of meaningful use, misconceptions and help them make educated decisions to increase their bottom line, control their patient population and maintain their current workflow. Inside Sales Specialist Mobile Mini Inc April 2011  –  January 2012  (10 months) Call customers generated from both advertising and self generated leads \nManage and grow existing customer accounts in a true service driven manner \nWork with individual branches all across the United States and Canada logistically for deliveries and product availability for the customers. Inside Sales Specialist Mobile Mini Inc April 2011  –  January 2012  (10 months) Call customers generated from both advertising and self generated leads \nManage and grow existing customer accounts in a true service driven manner \nWork with individual branches all across the United States and Canada logistically for deliveries and product availability for the customers. Inside Sales Account Manager- IBM Technical Services Direct Alliance March 2006  –  May 2011  (5 years 3 months) Contracted by IBM Corporation. Develop relationships with customers acting as a consultant to their business and work with them to make sure their needs are being met. \n \nIdentify accounts that may have hidden assets to maximize productivity and enhance customer service. \n \nProactively develop relationships with client representatives in the field, and work with them to make sure the customers are serviced correctly while collaboratively working out solutions for the customer to maximize profitability for the company. Inside Sales Account Manager- IBM Technical Services Direct Alliance March 2006  –  May 2011  (5 years 3 months) Contracted by IBM Corporation. Develop relationships with customers acting as a consultant to their business and work with them to make sure their needs are being met. \n \nIdentify accounts that may have hidden assets to maximize productivity and enhance customer service. \n \nProactively develop relationships with client representatives in the field, and work with them to make sure the customers are serviced correctly while collaboratively working out solutions for the customer to maximize profitability for the company. Account Manager Customer Funding Group December 2005  –  March 2006  (4 months) Managed accounts maintained accounts by teaching best practices to other companies on how to best utilize product.  \n \nResponsible for up selling other accounts and building long term relationships with clients. Account Manager Customer Funding Group December 2005  –  March 2006  (4 months) Managed accounts maintained accounts by teaching best practices to other companies on how to best utilize product.  \n \nResponsible for up selling other accounts and building long term relationships with clients. Sales Manager Customer Funding Group February 2005  –  December 2005  (11 months) Hired, trained, supervised and mentored 12 sales people  \n \nMotivated staff to meet and exceed established sales goals and objectives by developing effective sales incentives.  \n \nGave final approval on all sales.  \n \nMonitored and reported sales volume to Executive Vice President. Sales Manager Customer Funding Group February 2005  –  December 2005  (11 months) Hired, trained, supervised and mentored 12 sales people  \n \nMotivated staff to meet and exceed established sales goals and objectives by developing effective sales incentives.  \n \nGave final approval on all sales.  \n \nMonitored and reported sales volume to Executive Vice President. Sales Executive Customer Funding Group November 2003  –  February 2005  (1 year 4 months) Responsible for generating new business by way of cold calling in strategic markets across the United States.  \n \nMet and consistently exceeded monthly goals and objectives in a fast paced saturated market. Sales Executive Customer Funding Group November 2003  –  February 2005  (1 year 4 months) Responsible for generating new business by way of cold calling in strategic markets across the United States.  \n \nMet and consistently exceeded monthly goals and objectives in a fast paced saturated market. Weekend General Manager Pure Firness March 2002  –  November 2003  (1 year 9 months) Reported to general manager. Responsible for 100% of clubs gross sales Friday, Saturday, and Sunday. Managed a team to drive the club to hit sales quota for the weekends. Train and enhance the skills of other team members. Weekend General Manager Pure Firness March 2002  –  November 2003  (1 year 9 months) Reported to general manager. Responsible for 100% of clubs gross sales Friday, Saturday, and Sunday. Managed a team to drive the club to hit sales quota for the weekends. Train and enhance the skills of other team members. Sales Consultant/ Trainer Pure Fitness December 2001  –  March 2002  (4 months) Worked in membership sales helping people get involved in fitness and achieve their goals. Also set up personal training programs based on customers goals. Sales Consultant/ Trainer Pure Fitness December 2001  –  March 2002  (4 months) Worked in membership sales helping people get involved in fitness and achieve their goals. Also set up personal training programs based on customers goals. Assistant General Manager 24 Hour Fitness January 2000  –  December 2001  (2 years) Assisted the general manager with tasks including management of staff, hitting goals, and also responsible for entire club when manager was absent \n \nHired, trained, and enhanced the skills of other team members while maintaining own goals and sales quotas Assistant General Manager 24 Hour Fitness January 2000  –  December 2001  (2 years) Assisted the general manager with tasks including management of staff, hitting goals, and also responsible for entire club when manager was absent \n \nHired, trained, and enhanced the skills of other team members while maintaining own goals and sales quotas Languages English English English Skills Sales Management Account Management Cold Calling B2B Consultative Selling Salesforce.com Customer Relations Customer Retention Word Excel PowerPoint Forecasting Microsoft Office Solution Selling Value Selling Outlook Email Marketing Mass Mailings Advertising Sales New Business Development Sales Process EHR EMR Healthcare Information... Consulting GoToMeeting NetSuite Product Demonstration Sales Presentations Microsoft Word Microsoft Excel Sales Selling Sales Operations Management Direct Sales Marketing Customer Service Training Banking Strategy Leadership Lead Generation Advertising Time Management Program Management Strategic Partnerships SaaS Business Development Call Centers See 35+     See less Skills  Sales Management Account Management Cold Calling B2B Consultative Selling Salesforce.com Customer Relations Customer Retention Word Excel PowerPoint Forecasting Microsoft Office Solution Selling Value Selling Outlook Email Marketing Mass Mailings Advertising Sales New Business Development Sales Process EHR EMR Healthcare Information... Consulting GoToMeeting NetSuite Product Demonstration Sales Presentations Microsoft Word Microsoft Excel Sales Selling Sales Operations Management Direct Sales Marketing Customer Service Training Banking Strategy Leadership Lead Generation Advertising Time Management Program Management Strategic Partnerships SaaS Business Development Call Centers See 35+     See less Sales Management Account Management Cold Calling B2B Consultative Selling Salesforce.com Customer Relations Customer Retention Word Excel PowerPoint Forecasting Microsoft Office Solution Selling Value Selling Outlook Email Marketing Mass Mailings Advertising Sales New Business Development Sales Process EHR EMR Healthcare Information... Consulting GoToMeeting NetSuite Product Demonstration Sales Presentations Microsoft Word Microsoft Excel Sales Selling Sales Operations Management Direct Sales Marketing Customer Service Training Banking Strategy Leadership Lead Generation Advertising Time Management Program Management Strategic Partnerships SaaS Business Development Call Centers See 35+     See less Sales Management Account Management Cold Calling B2B Consultative Selling Salesforce.com Customer Relations Customer Retention Word Excel PowerPoint Forecasting Microsoft Office Solution Selling Value Selling Outlook Email Marketing Mass Mailings Advertising Sales New Business Development Sales Process EHR EMR Healthcare Information... Consulting GoToMeeting NetSuite Product Demonstration Sales Presentations Microsoft Word Microsoft Excel Sales Selling Sales Operations Management Direct Sales Marketing Customer Service Training Banking Strategy Leadership Lead Generation Advertising Time Management Program Management Strategic Partnerships SaaS Business Development Call Centers See 35+     See less Education CPTC N/A,  General Studies 1998  – 1999 Woodrow Wilson High School Diploma,  General Studies 1994  – 1998 Activities and Societies:  Wrestlng-Varsity CPTC N/A,  General Studies 1998  – 1999 CPTC N/A,  General Studies 1998  – 1999 CPTC N/A,  General Studies 1998  – 1999 Woodrow Wilson High School Diploma,  General Studies 1994  – 1998 Activities and Societies:  Wrestlng-Varsity Woodrow Wilson High School Diploma,  General Studies 1994  – 1998 Activities and Societies:  Wrestlng-Varsity Woodrow Wilson High School Diploma,  General Studies 1994  – 1998 Activities and Societies:  Wrestlng-Varsity Honors & Awards Additional Honors & Awards Employee of the Year 2005 \nAssosiate of the month- April 2006, May 2006, June 2006, July 2006, September 2006, October 2006, December 2006, January 2007, April 2007, August 2007, November 2007, December 2007, March 2008, November 2008, January 2009, March 2009, July 2009. \n147% Quota Quarter 3 Fiscal Year 2012 Additional Honors & Awards Employee of the Year 2005 \nAssosiate of the month- April 2006, May 2006, June 2006, July 2006, September 2006, October 2006, December 2006, January 2007, April 2007, August 2007, November 2007, December 2007, March 2008, November 2008, January 2009, March 2009, July 2009. \n147% Quota Quarter 3 Fiscal Year 2012 Additional Honors & Awards Employee of the Year 2005 \nAssosiate of the month- April 2006, May 2006, June 2006, July 2006, September 2006, October 2006, December 2006, January 2007, April 2007, August 2007, November 2007, December 2007, March 2008, November 2008, January 2009, March 2009, July 2009. \n147% Quota Quarter 3 Fiscal Year 2012 Additional Honors & Awards Employee of the Year 2005 \nAssosiate of the month- April 2006, May 2006, June 2006, July 2006, September 2006, October 2006, December 2006, January 2007, April 2007, August 2007, November 2007, December 2007, March 2008, November 2008, January 2009, March 2009, July 2009. \n147% Quota Quarter 3 Fiscal Year 2012 "]}