{"position": "Inventory Planner", "company": "IBM", "profiles": ["Experience Top Inputs Volumes Planner IBM October 2012  – Present (2 years 11 months) Inventory Planner IBM October 2005  –  October 2012  (7 years 1 month) Forecast quarterly inventory levels to provide management with accurate expectations to use in business decisions. Define and implement inventory reduction activities to minimize the impact of inventory to the company. Direct Line Feed Coordinator IBM March 2004  –  October 2005  (1 year 8 months) Rochester, Minnesota Area Manage movement of inventory from vendor owned warehouse to manufacturing to maximize capacity and minimize in-house inventory Card Fulfillment Short Parts expeditor IBM March 2002  –  March 2004  (2 years 1 month) Rochester, Minnesota Area Track and complete short parted orders for manufacturing, working with technical leads to prioritize kit completion based on manufacturing needs. Feature Planner IBM August 2000  –  March 2002  (1 year 8 months) Rochester, Minnesota Area Set and manage attach ratios for featurized content used server computers. SAP WHSE Module System Analyst IBM October 1999  –  August 2000  (11 months) Rochester, Minnesota Area Analyze and mange transition plan from legacy systems to SAP environment for Warehouse module, focused on inventory control. Variance Coordinator IBM January 1998  –  October 1999  (1 year 10 months) Rochester, Minnesota Area Investigate root cause and implement corrective action for inventory variances in the manufacturing line. Manage weekly and monthly inventory reconciliations, providing root cause for any variances found. In Process Inventory Control IBM June 1997  –  January 1998  (8 months) Rochester, Minnesota Area Manage movement of inventory from warehouse to specific line locations in manufacturing. Managing re-order points and timely receipt of material and fulfilling requests for shipment to other manufacturing plants/locations within plant. Top Inputs Volumes Planner IBM October 2012  – Present (2 years 11 months) Top Inputs Volumes Planner IBM October 2012  – Present (2 years 11 months) Inventory Planner IBM October 2005  –  October 2012  (7 years 1 month) Forecast quarterly inventory levels to provide management with accurate expectations to use in business decisions. Define and implement inventory reduction activities to minimize the impact of inventory to the company. Inventory Planner IBM October 2005  –  October 2012  (7 years 1 month) Forecast quarterly inventory levels to provide management with accurate expectations to use in business decisions. Define and implement inventory reduction activities to minimize the impact of inventory to the company. Direct Line Feed Coordinator IBM March 2004  –  October 2005  (1 year 8 months) Rochester, Minnesota Area Manage movement of inventory from vendor owned warehouse to manufacturing to maximize capacity and minimize in-house inventory Direct Line Feed Coordinator IBM March 2004  –  October 2005  (1 year 8 months) Rochester, Minnesota Area Manage movement of inventory from vendor owned warehouse to manufacturing to maximize capacity and minimize in-house inventory Card Fulfillment Short Parts expeditor IBM March 2002  –  March 2004  (2 years 1 month) Rochester, Minnesota Area Track and complete short parted orders for manufacturing, working with technical leads to prioritize kit completion based on manufacturing needs. Card Fulfillment Short Parts expeditor IBM March 2002  –  March 2004  (2 years 1 month) Rochester, Minnesota Area Track and complete short parted orders for manufacturing, working with technical leads to prioritize kit completion based on manufacturing needs. Feature Planner IBM August 2000  –  March 2002  (1 year 8 months) Rochester, Minnesota Area Set and manage attach ratios for featurized content used server computers. Feature Planner IBM August 2000  –  March 2002  (1 year 8 months) Rochester, Minnesota Area Set and manage attach ratios for featurized content used server computers. SAP WHSE Module System Analyst IBM October 1999  –  August 2000  (11 months) Rochester, Minnesota Area Analyze and mange transition plan from legacy systems to SAP environment for Warehouse module, focused on inventory control. SAP WHSE Module System Analyst IBM October 1999  –  August 2000  (11 months) Rochester, Minnesota Area Analyze and mange transition plan from legacy systems to SAP environment for Warehouse module, focused on inventory control. Variance Coordinator IBM January 1998  –  October 1999  (1 year 10 months) Rochester, Minnesota Area Investigate root cause and implement corrective action for inventory variances in the manufacturing line. Manage weekly and monthly inventory reconciliations, providing root cause for any variances found. Variance Coordinator IBM January 1998  –  October 1999  (1 year 10 months) Rochester, Minnesota Area Investigate root cause and implement corrective action for inventory variances in the manufacturing line. Manage weekly and monthly inventory reconciliations, providing root cause for any variances found. In Process Inventory Control IBM June 1997  –  January 1998  (8 months) Rochester, Minnesota Area Manage movement of inventory from warehouse to specific line locations in manufacturing. Managing re-order points and timely receipt of material and fulfilling requests for shipment to other manufacturing plants/locations within plant. In Process Inventory Control IBM June 1997  –  January 1998  (8 months) Rochester, Minnesota Area Manage movement of inventory from warehouse to specific line locations in manufacturing. Managing re-order points and timely receipt of material and fulfilling requests for shipment to other manufacturing plants/locations within plant. Skills Inventory Management Inventory Control Inventory Accuracy Root Cause Analysis Excel Forecasting Supply Chain Program Management Management Analysis Microsoft Excel Process Improvement Manufacturing Supply Chain Management Warehousing Skills  Inventory Management Inventory Control Inventory Accuracy Root Cause Analysis Excel Forecasting Supply Chain Program Management Management Analysis Microsoft Excel Process Improvement Manufacturing Supply Chain Management Warehousing Inventory Management Inventory Control Inventory Accuracy Root Cause Analysis Excel Forecasting Supply Chain Program Management Management Analysis Microsoft Excel Process Improvement Manufacturing Supply Chain Management Warehousing Inventory Management Inventory Control Inventory Accuracy Root Cause Analysis Excel Forecasting Supply Chain Program Management Management Analysis Microsoft Excel Process Improvement Manufacturing Supply Chain Management Warehousing Education University of Minnesota-Duluth MBA 2008  – 2011 Minnesota State University, Mankato Bachelor of Science (BS),  Biology , General , 3.2 1993  – 1997 Major in Biology with focus on technology, with a minor in Business Activities and Societies:  MSU Biology Club University of Minnesota-Duluth MBA 2008  – 2011 University of Minnesota-Duluth MBA 2008  – 2011 University of Minnesota-Duluth MBA 2008  – 2011 Minnesota State University, Mankato Bachelor of Science (BS),  Biology , General , 3.2 1993  – 1997 Major in Biology with focus on technology, with a minor in Business Activities and Societies:  MSU Biology Club Minnesota State University, Mankato Bachelor of Science (BS),  Biology , General , 3.2 1993  – 1997 Major in Biology with focus on technology, with a minor in Business Activities and Societies:  MSU Biology Club Minnesota State University, Mankato Bachelor of Science (BS),  Biology , General , 3.2 1993  – 1997 Major in Biology with focus on technology, with a minor in Business Activities and Societies:  MSU Biology Club ", "Experience Sr. Logistics Analyst LSI, an Avago Technologies Company 1997  – Present (18 years) Transportation analytics Senior Inventory Planner IBM Greater China & Asia Pacific/Japan 1992  –  1997  (5 years) Sr. Logistics Analyst LSI, an Avago Technologies Company 1997  – Present (18 years) Transportation analytics Sr. Logistics Analyst LSI, an Avago Technologies Company 1997  – Present (18 years) Transportation analytics Senior Inventory Planner IBM Greater China & Asia Pacific/Japan 1992  –  1997  (5 years) Senior Inventory Planner IBM Greater China & Asia Pacific/Japan 1992  –  1997  (5 years) Skills Supply Chain Management Supply Chain Materials Management Supply Management Supply Chain... Continuous Improvement Cross-functional Team... Demand Planning Skills  Supply Chain Management Supply Chain Materials Management Supply Management Supply Chain... Continuous Improvement Cross-functional Team... Demand Planning Supply Chain Management Supply Chain Materials Management Supply Management Supply Chain... Continuous Improvement Cross-functional Team... Demand Planning Supply Chain Management Supply Chain Materials Management Supply Management Supply Chain... Continuous Improvement Cross-functional Team... Demand Planning Education Saint Louis University (PH) 1976  – 1980 Saint Louis University (PH) 1976  – 1980 Saint Louis University (PH) 1976  – 1980 Saint Louis University (PH) 1976  – 1980 ", "Skills Strategic Sourcing Supply Management Supply Chain Management Vendor Management Procurement Supply Chain Cross-functional Team... Process Improvement Global Sourcing Program Management Six Sigma Contract Negotiation Project Management Outsourcing Business Process... Materials Management Contract Management Management Negotiation Leadership Start-ups Risk Management Strategy See 8+     See less Skills  Strategic Sourcing Supply Management Supply Chain Management Vendor Management Procurement Supply Chain Cross-functional Team... Process Improvement Global Sourcing Program Management Six Sigma Contract Negotiation Project Management Outsourcing Business Process... Materials Management Contract Management Management Negotiation Leadership Start-ups Risk Management Strategy See 8+     See less Strategic Sourcing Supply Management Supply Chain Management Vendor Management Procurement Supply Chain Cross-functional Team... Process Improvement Global Sourcing Program Management Six Sigma Contract Negotiation Project Management Outsourcing Business Process... Materials Management Contract Management Management Negotiation Leadership Start-ups Risk Management Strategy See 8+     See less Strategic Sourcing Supply Management Supply Chain Management Vendor Management Procurement Supply Chain Cross-functional Team... Process Improvement Global Sourcing Program Management Six Sigma Contract Negotiation Project Management Outsourcing Business Process... Materials Management Contract Management Management Negotiation Leadership Start-ups Risk Management Strategy See 8+     See less ", "Summary Seasoned Global IT Leasing professional with more than 30 years of experience in Reverse Logistics, Financial Structuring and Sales Management. Summary Seasoned Global IT Leasing professional with more than 30 years of experience in Reverse Logistics, Financial Structuring and Sales Management. Seasoned Global IT Leasing professional with more than 30 years of experience in Reverse Logistics, Financial Structuring and Sales Management. Seasoned Global IT Leasing professional with more than 30 years of experience in Reverse Logistics, Financial Structuring and Sales Management. Experience NA BUE - Sales Execution IBM Global Financing - GARS October 2009  – Present (5 years 11 months) Armonk, NY, USA Oversight of the entire GARS North American(US and Canada) Sales Organization. I've had responsibility for growing white space sales via the IGF Agent program, creating and maintaining DIO/GIO metrics with our IBM Business Partners, Inventory analysis and recommendations, Internal Sales Operations, Business Controls/Delegations/Audits, Executive GSR prep and review as well as lead on Special Projects. NA Business Unit Executive - System Z & Storage Sales IBM Global Financing - GARS April 2005  –  September 2009  (4 years 6 months) Armonk, NY, USA As BUE, I successfully led the Z/Storage North American(US and Canada) Sales team with P&L responsibility. In charge of inventory valuation & management, residual value recovery through channel disposition and campaign creation though internal, retail, business partner and broker channels. Americas Pricing Manager IBM Global Financing - CuF December 2001  –  March 2005  (3 years 4 months) Armonk, NY, USA Mid-level(second line) IGF Pricing manager responsible for lease structuring and pricing in the US, Canada, Central and South America. I was part of the IGF Americas Leadership team, sat in on daily winrooms, participated in deal clinics, headed the Americas deal review process, formulated pricing delegations and was responsible for the pricing integrity regarding Americas lease transactions. IGF Pricing Manager - System Z/Storage IBM Global Financing - CuF July 1999  –  November 2001  (2 years 5 months) Armonk, NY, USA Managed IGF Deal Structurers and GARS Traders. I had responsibility for System Z & Storage lease pricing/structuring as well as System Z & Storage used equipment placement. Senior Deal Structurer IBM Global Financing - Cuf August 1991  –  June 1999  (7 years 11 months) White Plains, NY, USA Priced/Structured all products for IGF lease transactions in Central and East US regions. Tasked with driving new lease origination profit as well as mid-lease extension residual value recovery while maintaining a balanced client approach. During this period, I was the US Capacity Alliance Coordinator teaming with IBM on their largest accounts Accountant IBM - M&S October 1989  –  August 1991  (1 year 11 months) Tarrytown, NY, USA Expense Accountant for IBM's Marketing & Sales division. Global Inventory Planner IBM - APG January 1988  –  September 1989  (1 year 9 months) Tarrytown, NY, USA World Trade Parts Inventory Planner for multiple international Distribution Centers. Product Scheduler IBM - APG July 1984  –  December 1987  (3 years 6 months) World Trade Product Scheduling. Worked with Manufacturing and Sales aligning shipment of mid-system products throughout the world. General Clerk IBM - AFE May 1983  –  June 1984  (1 year 2 months) Tarrytown, NY, USA Site Operations NA BUE - Sales Execution IBM Global Financing - GARS October 2009  – Present (5 years 11 months) Armonk, NY, USA Oversight of the entire GARS North American(US and Canada) Sales Organization. I've had responsibility for growing white space sales via the IGF Agent program, creating and maintaining DIO/GIO metrics with our IBM Business Partners, Inventory analysis and recommendations, Internal Sales Operations, Business Controls/Delegations/Audits, Executive GSR prep and review as well as lead on Special Projects. NA BUE - Sales Execution IBM Global Financing - GARS October 2009  – Present (5 years 11 months) Armonk, NY, USA Oversight of the entire GARS North American(US and Canada) Sales Organization. I've had responsibility for growing white space sales via the IGF Agent program, creating and maintaining DIO/GIO metrics with our IBM Business Partners, Inventory analysis and recommendations, Internal Sales Operations, Business Controls/Delegations/Audits, Executive GSR prep and review as well as lead on Special Projects. NA Business Unit Executive - System Z & Storage Sales IBM Global Financing - GARS April 2005  –  September 2009  (4 years 6 months) Armonk, NY, USA As BUE, I successfully led the Z/Storage North American(US and Canada) Sales team with P&L responsibility. In charge of inventory valuation & management, residual value recovery through channel disposition and campaign creation though internal, retail, business partner and broker channels. NA Business Unit Executive - System Z & Storage Sales IBM Global Financing - GARS April 2005  –  September 2009  (4 years 6 months) Armonk, NY, USA As BUE, I successfully led the Z/Storage North American(US and Canada) Sales team with P&L responsibility. In charge of inventory valuation & management, residual value recovery through channel disposition and campaign creation though internal, retail, business partner and broker channels. Americas Pricing Manager IBM Global Financing - CuF December 2001  –  March 2005  (3 years 4 months) Armonk, NY, USA Mid-level(second line) IGF Pricing manager responsible for lease structuring and pricing in the US, Canada, Central and South America. I was part of the IGF Americas Leadership team, sat in on daily winrooms, participated in deal clinics, headed the Americas deal review process, formulated pricing delegations and was responsible for the pricing integrity regarding Americas lease transactions. Americas Pricing Manager IBM Global Financing - CuF December 2001  –  March 2005  (3 years 4 months) Armonk, NY, USA Mid-level(second line) IGF Pricing manager responsible for lease structuring and pricing in the US, Canada, Central and South America. I was part of the IGF Americas Leadership team, sat in on daily winrooms, participated in deal clinics, headed the Americas deal review process, formulated pricing delegations and was responsible for the pricing integrity regarding Americas lease transactions. IGF Pricing Manager - System Z/Storage IBM Global Financing - CuF July 1999  –  November 2001  (2 years 5 months) Armonk, NY, USA Managed IGF Deal Structurers and GARS Traders. I had responsibility for System Z & Storage lease pricing/structuring as well as System Z & Storage used equipment placement. IGF Pricing Manager - System Z/Storage IBM Global Financing - CuF July 1999  –  November 2001  (2 years 5 months) Armonk, NY, USA Managed IGF Deal Structurers and GARS Traders. I had responsibility for System Z & Storage lease pricing/structuring as well as System Z & Storage used equipment placement. Senior Deal Structurer IBM Global Financing - Cuf August 1991  –  June 1999  (7 years 11 months) White Plains, NY, USA Priced/Structured all products for IGF lease transactions in Central and East US regions. Tasked with driving new lease origination profit as well as mid-lease extension residual value recovery while maintaining a balanced client approach. During this period, I was the US Capacity Alliance Coordinator teaming with IBM on their largest accounts Senior Deal Structurer IBM Global Financing - Cuf August 1991  –  June 1999  (7 years 11 months) White Plains, NY, USA Priced/Structured all products for IGF lease transactions in Central and East US regions. Tasked with driving new lease origination profit as well as mid-lease extension residual value recovery while maintaining a balanced client approach. During this period, I was the US Capacity Alliance Coordinator teaming with IBM on their largest accounts Accountant IBM - M&S October 1989  –  August 1991  (1 year 11 months) Tarrytown, NY, USA Expense Accountant for IBM's Marketing & Sales division. Accountant IBM - M&S October 1989  –  August 1991  (1 year 11 months) Tarrytown, NY, USA Expense Accountant for IBM's Marketing & Sales division. Global Inventory Planner IBM - APG January 1988  –  September 1989  (1 year 9 months) Tarrytown, NY, USA World Trade Parts Inventory Planner for multiple international Distribution Centers. Global Inventory Planner IBM - APG January 1988  –  September 1989  (1 year 9 months) Tarrytown, NY, USA World Trade Parts Inventory Planner for multiple international Distribution Centers. Product Scheduler IBM - APG July 1984  –  December 1987  (3 years 6 months) World Trade Product Scheduling. Worked with Manufacturing and Sales aligning shipment of mid-system products throughout the world. Product Scheduler IBM - APG July 1984  –  December 1987  (3 years 6 months) World Trade Product Scheduling. Worked with Manufacturing and Sales aligning shipment of mid-system products throughout the world. General Clerk IBM - AFE May 1983  –  June 1984  (1 year 2 months) Tarrytown, NY, USA Site Operations General Clerk IBM - AFE May 1983  –  June 1984  (1 year 2 months) Tarrytown, NY, USA Site Operations Skills IT Leasing, Finance,... Microsoft Word Microsoft Office Microsoft Excel Accounting Strategic Planning Leadership Sales Sales Operations Pricing Management Sales Management Forecasting Business Analysis P&L Management Process Improvement Account Management Financial Analysis Business Development Business Strategy Finance See 6+     See less Skills  IT Leasing, Finance,... Microsoft Word Microsoft Office Microsoft Excel Accounting Strategic Planning Leadership Sales Sales Operations Pricing Management Sales Management Forecasting Business Analysis P&L Management Process Improvement Account Management Financial Analysis Business Development Business Strategy Finance See 6+     See less IT Leasing, Finance,... Microsoft Word Microsoft Office Microsoft Excel Accounting Strategic Planning Leadership Sales Sales Operations Pricing Management Sales Management Forecasting Business Analysis P&L Management Process Improvement Account Management Financial Analysis Business Development Business Strategy Finance See 6+     See less IT Leasing, Finance,... Microsoft Word Microsoft Office Microsoft Excel Accounting Strategic Planning Leadership Sales Sales Operations Pricing Management Sales Management Forecasting Business Analysis P&L Management Process Improvement Account Management Financial Analysis Business Development Business Strategy Finance See 6+     See less Education Fordham University Bachelor's degree,  Industrial and Organizational Psychology 1979  – 1983 Iona College - Hagan School of Business Master of Business Administration (MBA),  Finance , General 1987  – 1991 Pace University - Lubin School of Business Financial Planning and Services 1992  – 1994 Fordham University Bachelor's degree,  Industrial and Organizational Psychology 1979  – 1983 Fordham University Bachelor's degree,  Industrial and Organizational Psychology 1979  – 1983 Fordham University Bachelor's degree,  Industrial and Organizational Psychology 1979  – 1983 Iona College - Hagan School of Business Master of Business Administration (MBA),  Finance , General 1987  – 1991 Iona College - Hagan School of Business Master of Business Administration (MBA),  Finance , General 1987  – 1991 Iona College - Hagan School of Business Master of Business Administration (MBA),  Finance , General 1987  – 1991 Pace University - Lubin School of Business Financial Planning and Services 1992  – 1994 Pace University - Lubin School of Business Financial Planning and Services 1992  – 1994 Pace University - Lubin School of Business Financial Planning and Services 1992  – 1994 Honors & Awards IBM 100% Club IBM 2012 IBM Sales Eminance Award IBM 2011 Quarter Century Club IBM 2008 Above and Beyond Award IBM 2004 IBM BestFest IBM 1999 Allstate Insurance AS/400 Project Award IBM 1998 IBM 100% Club IBM 2012 IBM 100% Club IBM 2012 IBM 100% Club IBM 2012 IBM Sales Eminance Award IBM 2011 IBM Sales Eminance Award IBM 2011 IBM Sales Eminance Award IBM 2011 Quarter Century Club IBM 2008 Quarter Century Club IBM 2008 Quarter Century Club IBM 2008 Above and Beyond Award IBM 2004 Above and Beyond Award IBM 2004 Above and Beyond Award IBM 2004 IBM BestFest IBM 1999 IBM BestFest IBM 1999 IBM BestFest IBM 1999 Allstate Insurance AS/400 Project Award IBM 1998 Allstate Insurance AS/400 Project Award IBM 1998 Allstate Insurance AS/400 Project Award IBM 1998 ", "Summary I’m one of the fortunate few who get to live and work in a field they are passionate about. I strive to help others reach their goals and dreams by networking, inspiring, mentoring, and guiding others.  \n \nMy aim is simple, to motivate and inspire individuals to achieve great results and find their own personal happiness.  \n \nCurrent Occupations: \n*Founder, President, CEO, Hawties For Hire, Talent Agency-- Launching February 2015! \n* Experienced Motivational Speaker, Nationwide \nFocus: Corporate Wellness Speaking Engagements \n* Story Director / Recruiter for The Platform Magazine \n* Engagement Director for LiveSTRONG, Local Rochester Chapter \n* YMCA Wellness Ambassador, Rochester, MN Summary I’m one of the fortunate few who get to live and work in a field they are passionate about. I strive to help others reach their goals and dreams by networking, inspiring, mentoring, and guiding others.  \n \nMy aim is simple, to motivate and inspire individuals to achieve great results and find their own personal happiness.  \n \nCurrent Occupations: \n*Founder, President, CEO, Hawties For Hire, Talent Agency-- Launching February 2015! \n* Experienced Motivational Speaker, Nationwide \nFocus: Corporate Wellness Speaking Engagements \n* Story Director / Recruiter for The Platform Magazine \n* Engagement Director for LiveSTRONG, Local Rochester Chapter \n* YMCA Wellness Ambassador, Rochester, MN I’m one of the fortunate few who get to live and work in a field they are passionate about. I strive to help others reach their goals and dreams by networking, inspiring, mentoring, and guiding others.  \n \nMy aim is simple, to motivate and inspire individuals to achieve great results and find their own personal happiness.  \n \nCurrent Occupations: \n*Founder, President, CEO, Hawties For Hire, Talent Agency-- Launching February 2015! \n* Experienced Motivational Speaker, Nationwide \nFocus: Corporate Wellness Speaking Engagements \n* Story Director / Recruiter for The Platform Magazine \n* Engagement Director for LiveSTRONG, Local Rochester Chapter \n* YMCA Wellness Ambassador, Rochester, MN I’m one of the fortunate few who get to live and work in a field they are passionate about. I strive to help others reach their goals and dreams by networking, inspiring, mentoring, and guiding others.  \n \nMy aim is simple, to motivate and inspire individuals to achieve great results and find their own personal happiness.  \n \nCurrent Occupations: \n*Founder, President, CEO, Hawties For Hire, Talent Agency-- Launching February 2015! \n* Experienced Motivational Speaker, Nationwide \nFocus: Corporate Wellness Speaking Engagements \n* Story Director / Recruiter for The Platform Magazine \n* Engagement Director for LiveSTRONG, Local Rochester Chapter \n* YMCA Wellness Ambassador, Rochester, MN Experience Founder, President, CEO Hawties For Hire \"H4H\" Modeling and Talent Ageny February 2015  – Present (7 months) Rochester, MN *Operate a full service model and talent agency, focused on male fitness models and talent. \n*Help models create a successful path to achieve dreams. \n*Guide, mentor, educate male models and actors to achieve their dreams. \n*Placement services and networking connections with state of art photographers. \n*Event Planner \n*FB Page ( https://www.facebook.com/HawtiesForHire ) Story Editor / Recruiter The Platform Magazine October 2013  – Present (1 year 11 months) * Recruit inspirational stories from across the world for The Platform Magazine. \n* Responsible for editing personal stories for publication.  \n* Brand promotion through social media and public events. \n* Attended Red Carpet promotional event in NYC, September 2014. Motivational Speaker Lori Juette Yokiel January 2013  – Present (2 years 8 months) Nationwide *Inspire others by sharing my story with a dynamic, humorous, and a sincere approach.  \n*Share my experience, strength, and hope of my personal transformation: losing over 70 lbs and 65 inches and found my own personal happiness.  \n* Personal fitness success: marathon runner, body builder, and local running events. \n* Contact me for a list of corporate references.  \nWebsite: www.LoriJYokiel.com LiveSTRONG Engagement Director Rochester Area Family Y July 2014  –  April 2015  (10 months) Rochester, Minnesota *Ensure that cancer survivors and their caregivers experience warmth and and welcome from YMCA Staff and from current members. \n*Responsible for leading all activities aimed at increasing staff awareness and understanding of LiveSTRONG at the YMCA and empathy for cancer survivors.  \n*Work with staff to integrate LiveSTRONG into member messaging at the YMCA.  \n*Introduce membership benefits at the YMCA for LiveSTRONG participants and help them feel at home in a fitness setting.  \n*Help inspire cancer survivors to achieve their healthy living goals. WW JEMT Coordinator ( Power/Pure/System X) IBM August 2008  –  March 2014  (5 years 8 months) Worldwide WW Power JEMT (Joint Engineering and Manufacturing Test) Coordinator \n* Conducted Executive reviews and Inventory reviews - outlooks vs the targets in a highly scrutinized environment. \n* Coordinated Program and Approval review (Fall Plan), reviews included planning/procurement information for proper fulfillment.  \n* Program Escalation to Executive Teams for continuous process review and improvements. \n* Provided and maintained tracking for JEMT systems, including 180 day tracking on inventory.  \n* Conducted education workshops at various sites to provide better communication, program knowledge and support. Inventory Planner IBM August 2006  –  August 2008  (2 years 1 month) Rochester, Minnesota Area * Planned / Forecasted targets for multiple complex brands of inventory.  \n*Assigned and maintained exact production codes. \n*Conducted detailed BRIO / Excel / Power Point advanced presentations.  \n* chaired and managed frequent internal meetings consisting of multiple departments. Production Staff IBM August 2003  –  August 2006  (3 years 1 month) Rochester, Minnesota Area *Coordinated BRIO / Excel / Power Point advanced presentations. \n* chaired and managed frequent internal meetings consisting of multiple departments. \n* Responsible for audit management. \n* Lead education initiatives for several departments. Production Tech Specialist IBM September 2000  –  August 2003  (3 years) Rochester, Minnesota Area * Excelled as a Variance Coordinator. \n* Responsible for investigation and eradication of physical and logistical inventory discrepancies. In Process Inventory Control ( IPIC ) IBM May 1999  –  November 2000  (1 year 7 months) Rochester, Minnesota Area * Responsible for physical and logistical inventory on the manufacturing floor. Production Technician IBM July 1997  –  April 1999  (1 year 10 months) Rochester, Minnesota Area * Responsible for transportation of Inventory within the IBM plant. Founder, President, CEO Hawties For Hire \"H4H\" Modeling and Talent Ageny February 2015  – Present (7 months) Rochester, MN *Operate a full service model and talent agency, focused on male fitness models and talent. \n*Help models create a successful path to achieve dreams. \n*Guide, mentor, educate male models and actors to achieve their dreams. \n*Placement services and networking connections with state of art photographers. \n*Event Planner \n*FB Page ( https://www.facebook.com/HawtiesForHire ) Founder, President, CEO Hawties For Hire \"H4H\" Modeling and Talent Ageny February 2015  – Present (7 months) Rochester, MN *Operate a full service model and talent agency, focused on male fitness models and talent. \n*Help models create a successful path to achieve dreams. \n*Guide, mentor, educate male models and actors to achieve their dreams. \n*Placement services and networking connections with state of art photographers. \n*Event Planner \n*FB Page ( https://www.facebook.com/HawtiesForHire ) Story Editor / Recruiter The Platform Magazine October 2013  – Present (1 year 11 months) * Recruit inspirational stories from across the world for The Platform Magazine. \n* Responsible for editing personal stories for publication.  \n* Brand promotion through social media and public events. \n* Attended Red Carpet promotional event in NYC, September 2014. Story Editor / Recruiter The Platform Magazine October 2013  – Present (1 year 11 months) * Recruit inspirational stories from across the world for The Platform Magazine. \n* Responsible for editing personal stories for publication.  \n* Brand promotion through social media and public events. \n* Attended Red Carpet promotional event in NYC, September 2014. Motivational Speaker Lori Juette Yokiel January 2013  – Present (2 years 8 months) Nationwide *Inspire others by sharing my story with a dynamic, humorous, and a sincere approach.  \n*Share my experience, strength, and hope of my personal transformation: losing over 70 lbs and 65 inches and found my own personal happiness.  \n* Personal fitness success: marathon runner, body builder, and local running events. \n* Contact me for a list of corporate references.  \nWebsite: www.LoriJYokiel.com Motivational Speaker Lori Juette Yokiel January 2013  – Present (2 years 8 months) Nationwide *Inspire others by sharing my story with a dynamic, humorous, and a sincere approach.  \n*Share my experience, strength, and hope of my personal transformation: losing over 70 lbs and 65 inches and found my own personal happiness.  \n* Personal fitness success: marathon runner, body builder, and local running events. \n* Contact me for a list of corporate references.  \nWebsite: www.LoriJYokiel.com LiveSTRONG Engagement Director Rochester Area Family Y July 2014  –  April 2015  (10 months) Rochester, Minnesota *Ensure that cancer survivors and their caregivers experience warmth and and welcome from YMCA Staff and from current members. \n*Responsible for leading all activities aimed at increasing staff awareness and understanding of LiveSTRONG at the YMCA and empathy for cancer survivors.  \n*Work with staff to integrate LiveSTRONG into member messaging at the YMCA.  \n*Introduce membership benefits at the YMCA for LiveSTRONG participants and help them feel at home in a fitness setting.  \n*Help inspire cancer survivors to achieve their healthy living goals. LiveSTRONG Engagement Director Rochester Area Family Y July 2014  –  April 2015  (10 months) Rochester, Minnesota *Ensure that cancer survivors and their caregivers experience warmth and and welcome from YMCA Staff and from current members. \n*Responsible for leading all activities aimed at increasing staff awareness and understanding of LiveSTRONG at the YMCA and empathy for cancer survivors.  \n*Work with staff to integrate LiveSTRONG into member messaging at the YMCA.  \n*Introduce membership benefits at the YMCA for LiveSTRONG participants and help them feel at home in a fitness setting.  \n*Help inspire cancer survivors to achieve their healthy living goals. WW JEMT Coordinator ( Power/Pure/System X) IBM August 2008  –  March 2014  (5 years 8 months) Worldwide WW Power JEMT (Joint Engineering and Manufacturing Test) Coordinator \n* Conducted Executive reviews and Inventory reviews - outlooks vs the targets in a highly scrutinized environment. \n* Coordinated Program and Approval review (Fall Plan), reviews included planning/procurement information for proper fulfillment.  \n* Program Escalation to Executive Teams for continuous process review and improvements. \n* Provided and maintained tracking for JEMT systems, including 180 day tracking on inventory.  \n* Conducted education workshops at various sites to provide better communication, program knowledge and support. WW JEMT Coordinator ( Power/Pure/System X) IBM August 2008  –  March 2014  (5 years 8 months) Worldwide WW Power JEMT (Joint Engineering and Manufacturing Test) Coordinator \n* Conducted Executive reviews and Inventory reviews - outlooks vs the targets in a highly scrutinized environment. \n* Coordinated Program and Approval review (Fall Plan), reviews included planning/procurement information for proper fulfillment.  \n* Program Escalation to Executive Teams for continuous process review and improvements. \n* Provided and maintained tracking for JEMT systems, including 180 day tracking on inventory.  \n* Conducted education workshops at various sites to provide better communication, program knowledge and support. Inventory Planner IBM August 2006  –  August 2008  (2 years 1 month) Rochester, Minnesota Area * Planned / Forecasted targets for multiple complex brands of inventory.  \n*Assigned and maintained exact production codes. \n*Conducted detailed BRIO / Excel / Power Point advanced presentations.  \n* chaired and managed frequent internal meetings consisting of multiple departments. Inventory Planner IBM August 2006  –  August 2008  (2 years 1 month) Rochester, Minnesota Area * Planned / Forecasted targets for multiple complex brands of inventory.  \n*Assigned and maintained exact production codes. \n*Conducted detailed BRIO / Excel / Power Point advanced presentations.  \n* chaired and managed frequent internal meetings consisting of multiple departments. Production Staff IBM August 2003  –  August 2006  (3 years 1 month) Rochester, Minnesota Area *Coordinated BRIO / Excel / Power Point advanced presentations. \n* chaired and managed frequent internal meetings consisting of multiple departments. \n* Responsible for audit management. \n* Lead education initiatives for several departments. Production Staff IBM August 2003  –  August 2006  (3 years 1 month) Rochester, Minnesota Area *Coordinated BRIO / Excel / Power Point advanced presentations. \n* chaired and managed frequent internal meetings consisting of multiple departments. \n* Responsible for audit management. \n* Lead education initiatives for several departments. Production Tech Specialist IBM September 2000  –  August 2003  (3 years) Rochester, Minnesota Area * Excelled as a Variance Coordinator. \n* Responsible for investigation and eradication of physical and logistical inventory discrepancies. Production Tech Specialist IBM September 2000  –  August 2003  (3 years) Rochester, Minnesota Area * Excelled as a Variance Coordinator. \n* Responsible for investigation and eradication of physical and logistical inventory discrepancies. In Process Inventory Control ( IPIC ) IBM May 1999  –  November 2000  (1 year 7 months) Rochester, Minnesota Area * Responsible for physical and logistical inventory on the manufacturing floor. In Process Inventory Control ( IPIC ) IBM May 1999  –  November 2000  (1 year 7 months) Rochester, Minnesota Area * Responsible for physical and logistical inventory on the manufacturing floor. Production Technician IBM July 1997  –  April 1999  (1 year 10 months) Rochester, Minnesota Area * Responsible for transportation of Inventory within the IBM plant. Production Technician IBM July 1997  –  April 1999  (1 year 10 months) Rochester, Minnesota Area * Responsible for transportation of Inventory within the IBM plant. Skills Motivational Speaking Process Improvement Program Management Leadership Team Leadership Business Process... Inventory Management Management Operations Management Vendor Management Project Planning Business Analysis Budgets Coaching Project Management Business Process Quality Assurance Team Building Six Sigma IT Service Management PMP Recruiting Marketing Project Portfolio... Change Management IT Strategy Business Intelligence Outsourcing Logistics Public Speaking Social Media Event Planning Social Networking Sales Event Management Marketing Strategy Public Relations Training Social Media Marketing Microsoft Excel Writing Strategic Planning New Business Development Entrepreneurship Talent Scouting Talent Mining See 31+     See less Skills  Motivational Speaking Process Improvement Program Management Leadership Team Leadership Business Process... Inventory Management Management Operations Management Vendor Management Project Planning Business Analysis Budgets Coaching Project Management Business Process Quality Assurance Team Building Six Sigma IT Service Management PMP Recruiting Marketing Project Portfolio... Change Management IT Strategy Business Intelligence Outsourcing Logistics Public Speaking Social Media Event Planning Social Networking Sales Event Management Marketing Strategy Public Relations Training Social Media Marketing Microsoft Excel Writing Strategic Planning New Business Development Entrepreneurship Talent Scouting Talent Mining See 31+     See less Motivational Speaking Process Improvement Program Management Leadership Team Leadership Business Process... Inventory Management Management Operations Management Vendor Management Project Planning Business Analysis Budgets Coaching Project Management Business Process Quality Assurance Team Building Six Sigma IT Service Management PMP Recruiting Marketing Project Portfolio... Change Management IT Strategy Business Intelligence Outsourcing Logistics Public Speaking Social Media Event Planning Social Networking Sales Event Management Marketing Strategy Public Relations Training Social Media Marketing Microsoft Excel Writing Strategic Planning New Business Development Entrepreneurship Talent Scouting Talent Mining See 31+     See less Motivational Speaking Process Improvement Program Management Leadership Team Leadership Business Process... Inventory Management Management Operations Management Vendor Management Project Planning Business Analysis Budgets Coaching Project Management Business Process Quality Assurance Team Building Six Sigma IT Service Management PMP Recruiting Marketing Project Portfolio... Change Management IT Strategy Business Intelligence Outsourcing Logistics Public Speaking Social Media Event Planning Social Networking Sales Event Management Marketing Strategy Public Relations Training Social Media Marketing Microsoft Excel Writing Strategic Planning New Business Development Entrepreneurship Talent Scouting Talent Mining See 31+     See less Education Winona State University Bachelor of Business Administration (B.B.A.),  Business Administration and Management ,  General / Marketing 2013  – 2016 Rochester Community and Technical College Associate of Arts and Sciences (AAS),  Business Administration and Management ,  General / Marketing 2012  – 2014 Winona State University Bachelor of Business Administration (B.B.A.),  Business Administration and Management ,  General / Marketing 2013  – 2016 Winona State University Bachelor of Business Administration (B.B.A.),  Business Administration and Management ,  General / Marketing 2013  – 2016 Winona State University Bachelor of Business Administration (B.B.A.),  Business Administration and Management ,  General / Marketing 2013  – 2016 Rochester Community and Technical College Associate of Arts and Sciences (AAS),  Business Administration and Management ,  General / Marketing 2012  – 2014 Rochester Community and Technical College Associate of Arts and Sciences (AAS),  Business Administration and Management ,  General / Marketing 2012  – 2014 Rochester Community and Technical College Associate of Arts and Sciences (AAS),  Business Administration and Management ,  General / Marketing 2012  – 2014 ", "Experience Inventory Planner IBM Inventory Planner IBM Inventory Planner IBM Education University College Dublin BE,  Engineering 1974  – 1980 University College Dublin BE,  Engineering 1974  – 1980 University College Dublin BE,  Engineering 1974  – 1980 University College Dublin BE,  Engineering 1974  – 1980 ", "Experience Business Controller Matas A/S September 2012  –  February 2015  (2 years 6 months) Allerød Business Controller for the Purchase department in Matas Operations. \n Disponent, Nonfood vareforsyning Coop December 2010  –  August 2012  (1 year 9 months) Albertslund Disponent (Buyer/inventory responsible) for Coop Nonfood, 'Gastronomi' and 'El-køkken'. Also worked as assistent. \nPosition was temporary Cheif Finance Officer, Nordic & Benelux InfoPrint Solutions April 2008  –  May 2009  (1 year 2 months) Financial responsible for Nordic & Benelux regions Finance Project Manager, Non-Transactional cost, GL Europe IBM Global Logistic November 2007  –  March 2008  (5 months) Financial responsible for Non-Transactional cost in EMEA Finance Project Manager - Non-Transactional cost, GL Europe & Financial Controller, GL Nordic IBM Global Logistic April 2006  –  October 2007  (1 year 7 months) Finance Project Manager - Non-Transactional cost, GL Europe & Financial Controller, GL Nordic \n \nNon Core Harmonization Project. Ensured good control of Nordic GL Finance. Transfer and education of financial responsibility of GL Nordic to Finance Execution Centre in Bratislava. Participating in process improvement projects Global Logistic Controller, Nordic Region IBM Global Logistic November 2003  –  March 2006  (2 years 5 months) Financial controller/responsible for the Nordic Region.  \n \nFinancial analyzes. Fall Plan input. Quarter End reports. Participating in process improvement projects Inventory Analyst IBM Software Delivery & Fulfillment September 2001  –  October 2003  (2 years 2 months) Extracting and analyzing data from our Inventory system. Responsible for department statistics and measurements. Responsible for creating department budget. Participant in consolidation- and process improvement projects. \n \nAsia/Pacific consolidation, Fall Plan budgets, Offline CD process (reduced backorders by more than 75%) Inventory Planner IBM, Software Delivery & Fulfillment September 2000  –  August 2001  (1 year) Planning and purchase of selected items. Management of inventory (stock level and scrap). Responsible for the softcopy process. Participating in process improvement projects Publication Planner/Technical Support IBM, Software Delivery & Fulfillment December 1996  –  August 2000  (3 years 9 months) Supporting development centres and translation centres in technical problems regarding publications. Participating in process improvement projects. Implemented & responsible for quality system Business Controller Matas A/S September 2012  –  February 2015  (2 years 6 months) Allerød Business Controller for the Purchase department in Matas Operations. \n Business Controller Matas A/S September 2012  –  February 2015  (2 years 6 months) Allerød Business Controller for the Purchase department in Matas Operations. \n Disponent, Nonfood vareforsyning Coop December 2010  –  August 2012  (1 year 9 months) Albertslund Disponent (Buyer/inventory responsible) for Coop Nonfood, 'Gastronomi' and 'El-køkken'. Also worked as assistent. \nPosition was temporary Disponent, Nonfood vareforsyning Coop December 2010  –  August 2012  (1 year 9 months) Albertslund Disponent (Buyer/inventory responsible) for Coop Nonfood, 'Gastronomi' and 'El-køkken'. Also worked as assistent. \nPosition was temporary Cheif Finance Officer, Nordic & Benelux InfoPrint Solutions April 2008  –  May 2009  (1 year 2 months) Financial responsible for Nordic & Benelux regions Cheif Finance Officer, Nordic & Benelux InfoPrint Solutions April 2008  –  May 2009  (1 year 2 months) Financial responsible for Nordic & Benelux regions Finance Project Manager, Non-Transactional cost, GL Europe IBM Global Logistic November 2007  –  March 2008  (5 months) Financial responsible for Non-Transactional cost in EMEA Finance Project Manager, Non-Transactional cost, GL Europe IBM Global Logistic November 2007  –  March 2008  (5 months) Financial responsible for Non-Transactional cost in EMEA Finance Project Manager - Non-Transactional cost, GL Europe & Financial Controller, GL Nordic IBM Global Logistic April 2006  –  October 2007  (1 year 7 months) Finance Project Manager - Non-Transactional cost, GL Europe & Financial Controller, GL Nordic \n \nNon Core Harmonization Project. Ensured good control of Nordic GL Finance. Transfer and education of financial responsibility of GL Nordic to Finance Execution Centre in Bratislava. Participating in process improvement projects Finance Project Manager - Non-Transactional cost, GL Europe & Financial Controller, GL Nordic IBM Global Logistic April 2006  –  October 2007  (1 year 7 months) Finance Project Manager - Non-Transactional cost, GL Europe & Financial Controller, GL Nordic \n \nNon Core Harmonization Project. Ensured good control of Nordic GL Finance. Transfer and education of financial responsibility of GL Nordic to Finance Execution Centre in Bratislava. Participating in process improvement projects Global Logistic Controller, Nordic Region IBM Global Logistic November 2003  –  March 2006  (2 years 5 months) Financial controller/responsible for the Nordic Region.  \n \nFinancial analyzes. Fall Plan input. Quarter End reports. Participating in process improvement projects Global Logistic Controller, Nordic Region IBM Global Logistic November 2003  –  March 2006  (2 years 5 months) Financial controller/responsible for the Nordic Region.  \n \nFinancial analyzes. Fall Plan input. Quarter End reports. Participating in process improvement projects Inventory Analyst IBM Software Delivery & Fulfillment September 2001  –  October 2003  (2 years 2 months) Extracting and analyzing data from our Inventory system. Responsible for department statistics and measurements. Responsible for creating department budget. Participant in consolidation- and process improvement projects. \n \nAsia/Pacific consolidation, Fall Plan budgets, Offline CD process (reduced backorders by more than 75%) Inventory Analyst IBM Software Delivery & Fulfillment September 2001  –  October 2003  (2 years 2 months) Extracting and analyzing data from our Inventory system. Responsible for department statistics and measurements. Responsible for creating department budget. Participant in consolidation- and process improvement projects. \n \nAsia/Pacific consolidation, Fall Plan budgets, Offline CD process (reduced backorders by more than 75%) Inventory Planner IBM, Software Delivery & Fulfillment September 2000  –  August 2001  (1 year) Planning and purchase of selected items. Management of inventory (stock level and scrap). Responsible for the softcopy process. Participating in process improvement projects Inventory Planner IBM, Software Delivery & Fulfillment September 2000  –  August 2001  (1 year) Planning and purchase of selected items. Management of inventory (stock level and scrap). Responsible for the softcopy process. Participating in process improvement projects Publication Planner/Technical Support IBM, Software Delivery & Fulfillment December 1996  –  August 2000  (3 years 9 months) Supporting development centres and translation centres in technical problems regarding publications. Participating in process improvement projects. Implemented & responsible for quality system Publication Planner/Technical Support IBM, Software Delivery & Fulfillment December 1996  –  August 2000  (3 years 9 months) Supporting development centres and translation centres in technical problems regarding publications. Participating in process improvement projects. Implemented & responsible for quality system Languages English Native or bilingual proficiency Scandinavian Limited working proficiency English Native or bilingual proficiency Scandinavian Limited working proficiency English Native or bilingual proficiency Scandinavian Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Management Analysis Change Management Project Management Forecasting Business Strategy Purchasing ERP Logistics Process Improvement Business Process Project Planning Cost Accounting Economics Supply Chain Management Planning See 1+     See less Skills  Management Analysis Change Management Project Management Forecasting Business Strategy Purchasing ERP Logistics Process Improvement Business Process Project Planning Cost Accounting Economics Supply Chain Management Planning See 1+     See less Management Analysis Change Management Project Management Forecasting Business Strategy Purchasing ERP Logistics Process Improvement Business Process Project Planning Cost Accounting Economics Supply Chain Management Planning See 1+     See less Management Analysis Change Management Project Management Forecasting Business Strategy Purchasing ERP Logistics Process Improvement Business Process Project Planning Cost Accounting Economics Supply Chain Management Planning See 1+     See less Education Engineering College of Copenhagen Bachelor - Teknikum/Diploma Engineer,  Production 1992  – 1996 Activities and Societies:  Logistic ,  Supply Chain Management ,  Production Technology ,  Quality Management ,  Management & Economics University of Southern Denmark Graduate Diploma in Business Administration - single subject courses,  Financial Management 2015 Activities and Societies:  Ongoing Engineering College of Copenhagen Technology Management - single subject courses,  Supply Chain Management 2005 Activities and Societies:  Supply Chain Management Danmarks Medie- og Journalisthøjskole Prepress Technology,  Printing Management 1999 ErfaKursuscenter Concorde XAL consultant,  Computer Technology , Consultant 1996 Engineering College of Copenhagen Bachelor - Teknikum/Diploma Engineer,  Production 1992  – 1996 Activities and Societies:  Logistic ,  Supply Chain Management ,  Production Technology ,  Quality Management ,  Management & Economics Engineering College of Copenhagen Bachelor - Teknikum/Diploma Engineer,  Production 1992  – 1996 Activities and Societies:  Logistic ,  Supply Chain Management ,  Production Technology ,  Quality Management ,  Management & Economics Engineering College of Copenhagen Bachelor - Teknikum/Diploma Engineer,  Production 1992  – 1996 Activities and Societies:  Logistic ,  Supply Chain Management ,  Production Technology ,  Quality Management ,  Management & Economics University of Southern Denmark Graduate Diploma in Business Administration - single subject courses,  Financial Management 2015 Activities and Societies:  Ongoing University of Southern Denmark Graduate Diploma in Business Administration - single subject courses,  Financial Management 2015 Activities and Societies:  Ongoing University of Southern Denmark Graduate Diploma in Business Administration - single subject courses,  Financial Management 2015 Activities and Societies:  Ongoing Engineering College of Copenhagen Technology Management - single subject courses,  Supply Chain Management 2005 Activities and Societies:  Supply Chain Management Engineering College of Copenhagen Technology Management - single subject courses,  Supply Chain Management 2005 Activities and Societies:  Supply Chain Management Engineering College of Copenhagen Technology Management - single subject courses,  Supply Chain Management 2005 Activities and Societies:  Supply Chain Management Danmarks Medie- og Journalisthøjskole Prepress Technology,  Printing Management 1999 Danmarks Medie- og Journalisthøjskole Prepress Technology,  Printing Management 1999 Danmarks Medie- og Journalisthøjskole Prepress Technology,  Printing Management 1999 ErfaKursuscenter Concorde XAL consultant,  Computer Technology , Consultant 1996 ErfaKursuscenter Concorde XAL consultant,  Computer Technology , Consultant 1996 ErfaKursuscenter Concorde XAL consultant,  Computer Technology , Consultant 1996 ", "Experience National Customer Service Manager IBM March 2014  – Present (1 year 6 months) Brisbane Area, Australia Delivery Project Executive Customer Service & Repair IBM March 2013  –  February 2014  (1 year) Brisbane Area, Australia Delivery Project Executive Remote Support Centre IBM October 2008  –  March 2013  (4 years 6 months) Brisbane Area, Australia Desktop operations Lenovo 2005  –  2007  (2 years) Inventory Planner IBM Global Services 1995  –  2007  (12 years) National Customer Service Manager IBM March 2014  – Present (1 year 6 months) Brisbane Area, Australia National Customer Service Manager IBM March 2014  – Present (1 year 6 months) Brisbane Area, Australia Delivery Project Executive Customer Service & Repair IBM March 2013  –  February 2014  (1 year) Brisbane Area, Australia Delivery Project Executive Customer Service & Repair IBM March 2013  –  February 2014  (1 year) Brisbane Area, Australia Delivery Project Executive Remote Support Centre IBM October 2008  –  March 2013  (4 years 6 months) Brisbane Area, Australia Delivery Project Executive Remote Support Centre IBM October 2008  –  March 2013  (4 years 6 months) Brisbane Area, Australia Desktop operations Lenovo 2005  –  2007  (2 years) Desktop operations Lenovo 2005  –  2007  (2 years) Inventory Planner IBM Global Services 1995  –  2007  (12 years) Inventory Planner IBM Global Services 1995  –  2007  (12 years) Skills Business Process... Cross-functional Team... Vendor Management Project Management IT Strategy Business Analysis Program Management MS Project Management Change Management Service Delivery ITIL CRM Account Management Supply Chain Management Skills  Business Process... Cross-functional Team... Vendor Management Project Management IT Strategy Business Analysis Program Management MS Project Management Change Management Service Delivery ITIL CRM Account Management Supply Chain Management Business Process... Cross-functional Team... Vendor Management Project Management IT Strategy Business Analysis Program Management MS Project Management Change Management Service Delivery ITIL CRM Account Management Supply Chain Management Business Process... Cross-functional Team... Vendor Management Project Management IT Strategy Business Analysis Program Management MS Project Management Change Management Service Delivery ITIL CRM Account Management Supply Chain Management Education RMIT University 1978  – 1981 RMIT University 1978  – 1981 RMIT University 1978  – 1981 RMIT University 1978  – 1981 ", "Summary I am goal oriented and driven by results. With my practical approach as a consultant I create new insights into the potential of improving customer value and productivity of organizations. In the role of project manager, I am a team player and keep others focused on their task and I am committed to achieving the right result. \n \nMy core values are: \n* Connect by sharing my knowledge, skills and network in openness \n* Servant to set up and make myself dispensable \n* To deliver quality by improve and develop myself continuously and stepping outside my comfort zone frequently. \n \nSpecialties: Lean, Logistics, Continuous Improvement, Supply Chain, Six Sigma, Operational Excellence. Summary I am goal oriented and driven by results. With my practical approach as a consultant I create new insights into the potential of improving customer value and productivity of organizations. In the role of project manager, I am a team player and keep others focused on their task and I am committed to achieving the right result. \n \nMy core values are: \n* Connect by sharing my knowledge, skills and network in openness \n* Servant to set up and make myself dispensable \n* To deliver quality by improve and develop myself continuously and stepping outside my comfort zone frequently. \n \nSpecialties: Lean, Logistics, Continuous Improvement, Supply Chain, Six Sigma, Operational Excellence. I am goal oriented and driven by results. With my practical approach as a consultant I create new insights into the potential of improving customer value and productivity of organizations. In the role of project manager, I am a team player and keep others focused on their task and I am committed to achieving the right result. \n \nMy core values are: \n* Connect by sharing my knowledge, skills and network in openness \n* Servant to set up and make myself dispensable \n* To deliver quality by improve and develop myself continuously and stepping outside my comfort zone frequently. \n \nSpecialties: Lean, Logistics, Continuous Improvement, Supply Chain, Six Sigma, Operational Excellence. I am goal oriented and driven by results. With my practical approach as a consultant I create new insights into the potential of improving customer value and productivity of organizations. In the role of project manager, I am a team player and keep others focused on their task and I am committed to achieving the right result. \n \nMy core values are: \n* Connect by sharing my knowledge, skills and network in openness \n* Servant to set up and make myself dispensable \n* To deliver quality by improve and develop myself continuously and stepping outside my comfort zone frequently. \n \nSpecialties: Lean, Logistics, Continuous Improvement, Supply Chain, Six Sigma, Operational Excellence. Experience Lean Consultant at hollander techniek BIMpuls® October 2014  – Present (11 months) Amersfoort BIMpuls® is geen traditioneel advies- of consultancybureau. Maar een bureau met een duidelijke focus op een nieuwe manier van samenwerken: integraal samenwerken. BIMpuls® geeft dé impuls aan uw organisatie om samen met uw medewerkers te overleven in het heden en te bouwen aan een duurzame toekomst. \nWij werken vanuit passie, betrokkenheid en vakmanschap. In onze nieuwe manier van samenwerken staan BIM, Lean, Innovaties, Branchekennis en Vakmanschap centraal. Met als missie: samen bouwen aan een innovatieve, toekomstgerichte en gezonde bouw- en installatiebranche. Dat is BIMpuls®! Logistics Consultant on demand proQure BV April 2014  – Present (1 year 5 months) Amsterdam Area, Netherlands proQure can take over a company’s purchasing function, has particular expertise in NPR (Non Product Related) categories and also purchases non-traded goods and services from organisations. Owner, Lean / Logistics Consultant & interim project manager Basiswaarde July 2013  – Present (2 years 2 months) Soest BASisWAARDE helps organizations to increase their customer value and productivity. \n \nAssignments: \n* Introduce the Lean philosophy within the production and planning department of HWI Techniek to increase the quality, customer value and productivity \n* Together with a team of 6 Lean experts coaching the ING Netherlands HR organisation in adapting Lean Operational Management. \n* As logistics business analist participating in several projects for a purchasing company to optimize the customers logistics processes. \n* Set up the logistics part of a new started distribution channel in B2B market. Associate / Lean (Six Sigma) consultant on demand Watson Performance Improvement September 2013  –  May 2015  (1 year 9 months) Moordrecht With a combination of thinking and decisiveness Watson works together with his customers to achieve improvements at the intersection of Information and the 'Business'. The heart of a company. Project Manager Implementation / Lean Six Sigma Black Belt UNC Plus Delta September 2011  –  May 2013  (1 year 9 months) Amstelveen Responsible for Implementation projects and Lean Six Sigma programs/training/workshops. \n \nInformation about assignments: \n* Program Manager Maintenance Hot Strip Mill of Tata Steel Europe \nOpEx implementation and managing current improvement projects with focus on maintenance costs and availability of the equipment. As member of the Shutdown Management team coördinating the planned maintenance downtime. \n* Facilitating Lean workshops for a management team of USG People  \n* Co-creating a hand-out on the Lean Six Sigma Control phase. Consultant Process Improvement / Lean Six Sigma Black Belt Conclusion April 2007  –  September 2011  (4 years 6 months) Utrecht Area, Netherlands As consultant responsible to advise and implement improvement initiatives at client and ensure employees are trained/involved. Initiatives are mainly focussed on process improvement techniques like Lean, Six Sigma and Supply Chain Management. \n \nInformation about the assignments: \n* Professionalize Material Management process at Andritz Feed & Biofuel \n* Life Cycle Cost reduction at ProRail Asset Management \n* Lean Game facilitator at ProRail Construction Management  \n* Roll out Lean Six Sigma program at Prorail Finance & Control Projects \n* Several Lean implementations at Thales Land & Joint Huizen Logistics Coordinator / Six Sigma Black Belt Merck Sharp & Dohme (MSD) July 2001  –  March 2007  (5 years 9 months) Hoofddorp Responsible for setting up framework with forwarders to ensure optimal operational shipments. Part of the job also included monthly management reporting and coordination of critical shipments. I managed one of the forwarders personally and initiated several improvement projects. \nTrained Six Sigma Black Belt and Lean Manufacturing. Customer Service & Demand Manager Merck Sharp & Dohme (MSD) September 1999  –  June 2001  (1 year 10 months) In this function the intermediate between the European supplying sites and the different global entities. Responsible for the demand management, realization of a optimal supply of pharmaceuticals and service towards the customers and the first contact for these customers. Process controlled by means of a MRP II system and triggered by forecast & purchase orders supplied by customer. Inventory Planner IBM (ILC) December 1996  –  August 1999  (2 years 9 months) As inventory planner responsible for a certain productrange including inventory control, purchasing and conttact with (IBM) suppliers. Logistics employee FrieslandCampina December 1995  –  December 1996  (1 year 1 month) Borculo Implementing an exportdocumentation application called Expodos. Lean Consultant at hollander techniek BIMpuls® October 2014  – Present (11 months) Amersfoort BIMpuls® is geen traditioneel advies- of consultancybureau. Maar een bureau met een duidelijke focus op een nieuwe manier van samenwerken: integraal samenwerken. BIMpuls® geeft dé impuls aan uw organisatie om samen met uw medewerkers te overleven in het heden en te bouwen aan een duurzame toekomst. \nWij werken vanuit passie, betrokkenheid en vakmanschap. In onze nieuwe manier van samenwerken staan BIM, Lean, Innovaties, Branchekennis en Vakmanschap centraal. Met als missie: samen bouwen aan een innovatieve, toekomstgerichte en gezonde bouw- en installatiebranche. Dat is BIMpuls®! Lean Consultant at hollander techniek BIMpuls® October 2014  – Present (11 months) Amersfoort BIMpuls® is geen traditioneel advies- of consultancybureau. Maar een bureau met een duidelijke focus op een nieuwe manier van samenwerken: integraal samenwerken. BIMpuls® geeft dé impuls aan uw organisatie om samen met uw medewerkers te overleven in het heden en te bouwen aan een duurzame toekomst. \nWij werken vanuit passie, betrokkenheid en vakmanschap. In onze nieuwe manier van samenwerken staan BIM, Lean, Innovaties, Branchekennis en Vakmanschap centraal. Met als missie: samen bouwen aan een innovatieve, toekomstgerichte en gezonde bouw- en installatiebranche. Dat is BIMpuls®! Logistics Consultant on demand proQure BV April 2014  – Present (1 year 5 months) Amsterdam Area, Netherlands proQure can take over a company’s purchasing function, has particular expertise in NPR (Non Product Related) categories and also purchases non-traded goods and services from organisations. Logistics Consultant on demand proQure BV April 2014  – Present (1 year 5 months) Amsterdam Area, Netherlands proQure can take over a company’s purchasing function, has particular expertise in NPR (Non Product Related) categories and also purchases non-traded goods and services from organisations. Owner, Lean / Logistics Consultant & interim project manager Basiswaarde July 2013  – Present (2 years 2 months) Soest BASisWAARDE helps organizations to increase their customer value and productivity. \n \nAssignments: \n* Introduce the Lean philosophy within the production and planning department of HWI Techniek to increase the quality, customer value and productivity \n* Together with a team of 6 Lean experts coaching the ING Netherlands HR organisation in adapting Lean Operational Management. \n* As logistics business analist participating in several projects for a purchasing company to optimize the customers logistics processes. \n* Set up the logistics part of a new started distribution channel in B2B market. Owner, Lean / Logistics Consultant & interim project manager Basiswaarde July 2013  – Present (2 years 2 months) Soest BASisWAARDE helps organizations to increase their customer value and productivity. \n \nAssignments: \n* Introduce the Lean philosophy within the production and planning department of HWI Techniek to increase the quality, customer value and productivity \n* Together with a team of 6 Lean experts coaching the ING Netherlands HR organisation in adapting Lean Operational Management. \n* As logistics business analist participating in several projects for a purchasing company to optimize the customers logistics processes. \n* Set up the logistics part of a new started distribution channel in B2B market. Associate / Lean (Six Sigma) consultant on demand Watson Performance Improvement September 2013  –  May 2015  (1 year 9 months) Moordrecht With a combination of thinking and decisiveness Watson works together with his customers to achieve improvements at the intersection of Information and the 'Business'. The heart of a company. Associate / Lean (Six Sigma) consultant on demand Watson Performance Improvement September 2013  –  May 2015  (1 year 9 months) Moordrecht With a combination of thinking and decisiveness Watson works together with his customers to achieve improvements at the intersection of Information and the 'Business'. The heart of a company. Project Manager Implementation / Lean Six Sigma Black Belt UNC Plus Delta September 2011  –  May 2013  (1 year 9 months) Amstelveen Responsible for Implementation projects and Lean Six Sigma programs/training/workshops. \n \nInformation about assignments: \n* Program Manager Maintenance Hot Strip Mill of Tata Steel Europe \nOpEx implementation and managing current improvement projects with focus on maintenance costs and availability of the equipment. As member of the Shutdown Management team coördinating the planned maintenance downtime. \n* Facilitating Lean workshops for a management team of USG People  \n* Co-creating a hand-out on the Lean Six Sigma Control phase. Project Manager Implementation / Lean Six Sigma Black Belt UNC Plus Delta September 2011  –  May 2013  (1 year 9 months) Amstelveen Responsible for Implementation projects and Lean Six Sigma programs/training/workshops. \n \nInformation about assignments: \n* Program Manager Maintenance Hot Strip Mill of Tata Steel Europe \nOpEx implementation and managing current improvement projects with focus on maintenance costs and availability of the equipment. As member of the Shutdown Management team coördinating the planned maintenance downtime. \n* Facilitating Lean workshops for a management team of USG People  \n* Co-creating a hand-out on the Lean Six Sigma Control phase. Consultant Process Improvement / Lean Six Sigma Black Belt Conclusion April 2007  –  September 2011  (4 years 6 months) Utrecht Area, Netherlands As consultant responsible to advise and implement improvement initiatives at client and ensure employees are trained/involved. Initiatives are mainly focussed on process improvement techniques like Lean, Six Sigma and Supply Chain Management. \n \nInformation about the assignments: \n* Professionalize Material Management process at Andritz Feed & Biofuel \n* Life Cycle Cost reduction at ProRail Asset Management \n* Lean Game facilitator at ProRail Construction Management  \n* Roll out Lean Six Sigma program at Prorail Finance & Control Projects \n* Several Lean implementations at Thales Land & Joint Huizen Consultant Process Improvement / Lean Six Sigma Black Belt Conclusion April 2007  –  September 2011  (4 years 6 months) Utrecht Area, Netherlands As consultant responsible to advise and implement improvement initiatives at client and ensure employees are trained/involved. Initiatives are mainly focussed on process improvement techniques like Lean, Six Sigma and Supply Chain Management. \n \nInformation about the assignments: \n* Professionalize Material Management process at Andritz Feed & Biofuel \n* Life Cycle Cost reduction at ProRail Asset Management \n* Lean Game facilitator at ProRail Construction Management  \n* Roll out Lean Six Sigma program at Prorail Finance & Control Projects \n* Several Lean implementations at Thales Land & Joint Huizen Logistics Coordinator / Six Sigma Black Belt Merck Sharp & Dohme (MSD) July 2001  –  March 2007  (5 years 9 months) Hoofddorp Responsible for setting up framework with forwarders to ensure optimal operational shipments. Part of the job also included monthly management reporting and coordination of critical shipments. I managed one of the forwarders personally and initiated several improvement projects. \nTrained Six Sigma Black Belt and Lean Manufacturing. Logistics Coordinator / Six Sigma Black Belt Merck Sharp & Dohme (MSD) July 2001  –  March 2007  (5 years 9 months) Hoofddorp Responsible for setting up framework with forwarders to ensure optimal operational shipments. Part of the job also included monthly management reporting and coordination of critical shipments. I managed one of the forwarders personally and initiated several improvement projects. \nTrained Six Sigma Black Belt and Lean Manufacturing. Customer Service & Demand Manager Merck Sharp & Dohme (MSD) September 1999  –  June 2001  (1 year 10 months) In this function the intermediate between the European supplying sites and the different global entities. Responsible for the demand management, realization of a optimal supply of pharmaceuticals and service towards the customers and the first contact for these customers. Process controlled by means of a MRP II system and triggered by forecast & purchase orders supplied by customer. Customer Service & Demand Manager Merck Sharp & Dohme (MSD) September 1999  –  June 2001  (1 year 10 months) In this function the intermediate between the European supplying sites and the different global entities. Responsible for the demand management, realization of a optimal supply of pharmaceuticals and service towards the customers and the first contact for these customers. Process controlled by means of a MRP II system and triggered by forecast & purchase orders supplied by customer. Inventory Planner IBM (ILC) December 1996  –  August 1999  (2 years 9 months) As inventory planner responsible for a certain productrange including inventory control, purchasing and conttact with (IBM) suppliers. Inventory Planner IBM (ILC) December 1996  –  August 1999  (2 years 9 months) As inventory planner responsible for a certain productrange including inventory control, purchasing and conttact with (IBM) suppliers. Logistics employee FrieslandCampina December 1995  –  December 1996  (1 year 1 month) Borculo Implementing an exportdocumentation application called Expodos. Logistics employee FrieslandCampina December 1995  –  December 1996  (1 year 1 month) Borculo Implementing an exportdocumentation application called Expodos. Languages English Professional working proficiency German Limited working proficiency English Professional working proficiency German Limited working proficiency English Professional working proficiency German Limited working proficiency Professional working proficiency Limited working proficiency Skills Logistics Lean Six Sigma Process Improvement Supply Chain Management Change Management Project Implementation Operational Excellence Process Engineering Continuous Improvement Business Process... Lean Manufacturing Project Management Kaizen Lean Management Six Sigma Analysis Supply Chain Management Management Consulting Purchasing Process Management Materials Management Coaching Training Interim Management Quality Management Program Management See 12+     See less Skills  Logistics Lean Six Sigma Process Improvement Supply Chain Management Change Management Project Implementation Operational Excellence Process Engineering Continuous Improvement Business Process... Lean Manufacturing Project Management Kaizen Lean Management Six Sigma Analysis Supply Chain Management Management Consulting Purchasing Process Management Materials Management Coaching Training Interim Management Quality Management Program Management See 12+     See less Logistics Lean Six Sigma Process Improvement Supply Chain Management Change Management Project Implementation Operational Excellence Process Engineering Continuous Improvement Business Process... Lean Manufacturing Project Management Kaizen Lean Management Six Sigma Analysis Supply Chain Management Management Consulting Purchasing Process Management Materials Management Coaching Training Interim Management Quality Management Program Management See 12+     See less Logistics Lean Six Sigma Process Improvement Supply Chain Management Change Management Project Implementation Operational Excellence Process Engineering Continuous Improvement Business Process... Lean Manufacturing Project Management Kaizen Lean Management Six Sigma Analysis Supply Chain Management Management Consulting Purchasing Process Management Materials Management Coaching Training Interim Management Quality Management Program Management See 12+     See less Education Vernieuwend Coachen Certified,  Personal Coaching 2013  – 2014 Het Eerste Huis Theory U , Workshop 2013  – 2013 Toen Otto Scharmer zijn boek Theory U lanceerde, legde hij de basis onder een aanpak waar al langer voor gepleit werd: niet het verleden, maar de toekomst bepaalt de agenda van ons handelen. Coachen met Theorie U werkt snel en direct vanuit wat zich nú aandient. De cliënt neemt waar wat zich voor hem ontvouwt en richt dáár zijn keuzes op. Wat is de innerlijke bron waar het handelen uit voortkomt? Dát zal voor het grootste deel het resultaat ervan bepalen The Bridge Consultative Selling , Certified 2012  – 2013 Lean Management Toyota Kata , Workshop 2011  – 2013 Tijdens de Toyota Kata Lean Management Training kunt u de routines ervaren die nodig zijn voor continu verbeteren: de verbeter kata en de coaching kata. Deze routines staan beschreven in het baanbrekende boek Toyota Kata van Mike Rother. Door het dagelijks beoefenen van deze routines creëert u een cultuur van blijvend verbeteren. Organisatie3.0 Masterclass,  Certification 2011  – 2011 Transparantie, vertrouwen, verantwoordelijkheid, vrijheid Activities and Societies:  Zelforganisatie Six Sigma Black Belt Certified,  Merck (Sharp & Dohme) 2006  – 2006 In-company: Merck / Merck, Sharp & Dohme Vereniging Logistiek Management European senior Logistician,  Integrale Logistiek, Resource Management, Transport Management & People Management 2003  – 2005 American Production and Inventory Control Society - APICS CPIM,  Logistics , Materials, and Supply Chain Management 1998  – 2000 Fontys Hogescholen HBO,  Logistiek Management 1989  – 1995 Ook bekend als Vervoersacademie, Hogeschool Venlo. Marianum HAVO,  Diploma 1983  – 1989 RK Scholengemeenschap Marianum te Groenlo Vernieuwend Coachen Certified,  Personal Coaching 2013  – 2014 Vernieuwend Coachen Certified,  Personal Coaching 2013  – 2014 Vernieuwend Coachen Certified,  Personal Coaching 2013  – 2014 Het Eerste Huis Theory U , Workshop 2013  – 2013 Toen Otto Scharmer zijn boek Theory U lanceerde, legde hij de basis onder een aanpak waar al langer voor gepleit werd: niet het verleden, maar de toekomst bepaalt de agenda van ons handelen. Coachen met Theorie U werkt snel en direct vanuit wat zich nú aandient. De cliënt neemt waar wat zich voor hem ontvouwt en richt dáár zijn keuzes op. Wat is de innerlijke bron waar het handelen uit voortkomt? Dát zal voor het grootste deel het resultaat ervan bepalen Het Eerste Huis Theory U , Workshop 2013  – 2013 Toen Otto Scharmer zijn boek Theory U lanceerde, legde hij de basis onder een aanpak waar al langer voor gepleit werd: niet het verleden, maar de toekomst bepaalt de agenda van ons handelen. Coachen met Theorie U werkt snel en direct vanuit wat zich nú aandient. De cliënt neemt waar wat zich voor hem ontvouwt en richt dáár zijn keuzes op. Wat is de innerlijke bron waar het handelen uit voortkomt? Dát zal voor het grootste deel het resultaat ervan bepalen Het Eerste Huis Theory U , Workshop 2013  – 2013 Toen Otto Scharmer zijn boek Theory U lanceerde, legde hij de basis onder een aanpak waar al langer voor gepleit werd: niet het verleden, maar de toekomst bepaalt de agenda van ons handelen. Coachen met Theorie U werkt snel en direct vanuit wat zich nú aandient. De cliënt neemt waar wat zich voor hem ontvouwt en richt dáár zijn keuzes op. Wat is de innerlijke bron waar het handelen uit voortkomt? Dát zal voor het grootste deel het resultaat ervan bepalen The Bridge Consultative Selling , Certified 2012  – 2013 The Bridge Consultative Selling , Certified 2012  – 2013 The Bridge Consultative Selling , Certified 2012  – 2013 Lean Management Toyota Kata , Workshop 2011  – 2013 Tijdens de Toyota Kata Lean Management Training kunt u de routines ervaren die nodig zijn voor continu verbeteren: de verbeter kata en de coaching kata. Deze routines staan beschreven in het baanbrekende boek Toyota Kata van Mike Rother. Door het dagelijks beoefenen van deze routines creëert u een cultuur van blijvend verbeteren. Lean Management Toyota Kata , Workshop 2011  – 2013 Tijdens de Toyota Kata Lean Management Training kunt u de routines ervaren die nodig zijn voor continu verbeteren: de verbeter kata en de coaching kata. Deze routines staan beschreven in het baanbrekende boek Toyota Kata van Mike Rother. Door het dagelijks beoefenen van deze routines creëert u een cultuur van blijvend verbeteren. Lean Management Toyota Kata , Workshop 2011  – 2013 Tijdens de Toyota Kata Lean Management Training kunt u de routines ervaren die nodig zijn voor continu verbeteren: de verbeter kata en de coaching kata. Deze routines staan beschreven in het baanbrekende boek Toyota Kata van Mike Rother. Door het dagelijks beoefenen van deze routines creëert u een cultuur van blijvend verbeteren. Organisatie3.0 Masterclass,  Certification 2011  – 2011 Transparantie, vertrouwen, verantwoordelijkheid, vrijheid Activities and Societies:  Zelforganisatie Organisatie3.0 Masterclass,  Certification 2011  – 2011 Transparantie, vertrouwen, verantwoordelijkheid, vrijheid Activities and Societies:  Zelforganisatie Organisatie3.0 Masterclass,  Certification 2011  – 2011 Transparantie, vertrouwen, verantwoordelijkheid, vrijheid Activities and Societies:  Zelforganisatie Six Sigma Black Belt Certified,  Merck (Sharp & Dohme) 2006  – 2006 In-company: Merck / Merck, Sharp & Dohme Six Sigma Black Belt Certified,  Merck (Sharp & Dohme) 2006  – 2006 In-company: Merck / Merck, Sharp & Dohme Six Sigma Black Belt Certified,  Merck (Sharp & Dohme) 2006  – 2006 In-company: Merck / Merck, Sharp & Dohme Vereniging Logistiek Management European senior Logistician,  Integrale Logistiek, Resource Management, Transport Management & People Management 2003  – 2005 Vereniging Logistiek Management European senior Logistician,  Integrale Logistiek, Resource Management, Transport Management & People Management 2003  – 2005 Vereniging Logistiek Management European senior Logistician,  Integrale Logistiek, Resource Management, Transport Management & People Management 2003  – 2005 American Production and Inventory Control Society - APICS CPIM,  Logistics , Materials, and Supply Chain Management 1998  – 2000 American Production and Inventory Control Society - APICS CPIM,  Logistics , Materials, and Supply Chain Management 1998  – 2000 American Production and Inventory Control Society - APICS CPIM,  Logistics , Materials, and Supply Chain Management 1998  – 2000 Fontys Hogescholen HBO,  Logistiek Management 1989  – 1995 Ook bekend als Vervoersacademie, Hogeschool Venlo. Fontys Hogescholen HBO,  Logistiek Management 1989  – 1995 Ook bekend als Vervoersacademie, Hogeschool Venlo. Fontys Hogescholen HBO,  Logistiek Management 1989  – 1995 Ook bekend als Vervoersacademie, Hogeschool Venlo. Marianum HAVO,  Diploma 1983  – 1989 RK Scholengemeenschap Marianum te Groenlo Marianum HAVO,  Diploma 1983  – 1989 RK Scholengemeenschap Marianum te Groenlo Marianum HAVO,  Diploma 1983  – 1989 RK Scholengemeenschap Marianum te Groenlo ", "Experience Inventory Planner IBM Global Process Services November 2012  – Present (2 years 10 months) SouthBank Category Demand Planner Kraft Foods August 2011  –  November 2012  (1 year 4 months) Demand Controller PZ Cussons June 2010  –  June 2011  (1 year 1 month) VRP PZ Cussons December 2008  –  June 2010  (1 year 7 months) Inventory Planner IBM Global Process Services November 2012  – Present (2 years 10 months) SouthBank Inventory Planner IBM Global Process Services November 2012  – Present (2 years 10 months) SouthBank Category Demand Planner Kraft Foods August 2011  –  November 2012  (1 year 4 months) Category Demand Planner Kraft Foods August 2011  –  November 2012  (1 year 4 months) Demand Controller PZ Cussons June 2010  –  June 2011  (1 year 1 month) Demand Controller PZ Cussons June 2010  –  June 2011  (1 year 1 month) VRP PZ Cussons December 2008  –  June 2010  (1 year 7 months) VRP PZ Cussons December 2008  –  June 2010  (1 year 7 months) Languages Greek Greek Greek Skills FMCG Process Improvement Merchandising Supply Chain Management Forecasting Supply Chain Business Strategy Business Planning Operations Management Logistics Management Retail Warehouse Management Demand Planning Warehousing Inventory Management Pricing Cross-functional Team... Supply Chain... See 4+     See less Skills  FMCG Process Improvement Merchandising Supply Chain Management Forecasting Supply Chain Business Strategy Business Planning Operations Management Logistics Management Retail Warehouse Management Demand Planning Warehousing Inventory Management Pricing Cross-functional Team... Supply Chain... See 4+     See less FMCG Process Improvement Merchandising Supply Chain Management Forecasting Supply Chain Business Strategy Business Planning Operations Management Logistics Management Retail Warehouse Management Demand Planning Warehousing Inventory Management Pricing Cross-functional Team... Supply Chain... See 4+     See less FMCG Process Improvement Merchandising Supply Chain Management Forecasting Supply Chain Business Strategy Business Planning Operations Management Logistics Management Retail Warehouse Management Demand Planning Warehousing Inventory Management Pricing Cross-functional Team... Supply Chain... See 4+     See less Education Alber Park/ Hobson Bay Secondary College 1984  – 1989 Albert Park High School YR 12 1984  – 1989 Alber Park/ Hobson Bay Secondary College 1984  – 1989 Alber Park/ Hobson Bay Secondary College 1984  – 1989 Alber Park/ Hobson Bay Secondary College 1984  – 1989 Albert Park High School YR 12 1984  – 1989 Albert Park High School YR 12 1984  – 1989 Albert Park High School YR 12 1984  – 1989 ", "Experience Engineering Change Materials Planner Applied Materials October 1999  – Present (15 years 11 months) Inventory Planner IBM January 1992  –  September 1997  (5 years 9 months) Financial Planner IBM June 1982  –  January 1992  (9 years 8 months) Engineering Change Materials Planner Applied Materials October 1999  – Present (15 years 11 months) Engineering Change Materials Planner Applied Materials October 1999  – Present (15 years 11 months) Inventory Planner IBM January 1992  –  September 1997  (5 years 9 months) Inventory Planner IBM January 1992  –  September 1997  (5 years 9 months) Financial Planner IBM June 1982  –  January 1992  (9 years 8 months) Financial Planner IBM June 1982  –  January 1992  (9 years 8 months) Skills Supply Chain Management Supply Management Materials Management Cross-functional Team... Lean Manufacturing MRP Supply Chain Process Improvement Inventory Management Continuous Improvement ERP Engineering Management Project Planning Forecasting Program Management Negotiation Semiconductors ISO Integration Electronics Strategy SAP ERP Six Sigma Process Engineering Team Leadership Leadership Demand Planning Warehousing Troubleshooting Quality Management Materials Team Building FMEA Manufacturing Production Planning Testing Product Development Contract Management Manufacturing... Strategic Planning Budgets Quality Assurance Business Process... Inventory Control Process Simulation See 30+     See less Skills  Supply Chain Management Supply Management Materials Management Cross-functional Team... Lean Manufacturing MRP Supply Chain Process Improvement Inventory Management Continuous Improvement ERP Engineering Management Project Planning Forecasting Program Management Negotiation Semiconductors ISO Integration Electronics Strategy SAP ERP Six Sigma Process Engineering Team Leadership Leadership Demand Planning Warehousing Troubleshooting Quality Management Materials Team Building FMEA Manufacturing Production Planning Testing Product Development Contract Management Manufacturing... Strategic Planning Budgets Quality Assurance Business Process... Inventory Control Process Simulation See 30+     See less Supply Chain Management Supply Management Materials Management Cross-functional Team... Lean Manufacturing MRP Supply Chain Process Improvement Inventory Management Continuous Improvement ERP Engineering Management Project Planning Forecasting Program Management Negotiation Semiconductors ISO Integration Electronics Strategy SAP ERP Six Sigma Process Engineering Team Leadership Leadership Demand Planning Warehousing Troubleshooting Quality Management Materials Team Building FMEA Manufacturing Production Planning Testing Product Development Contract Management Manufacturing... Strategic Planning Budgets Quality Assurance Business Process... Inventory Control Process Simulation See 30+     See less Supply Chain Management Supply Management Materials Management Cross-functional Team... Lean Manufacturing MRP Supply Chain Process Improvement Inventory Management Continuous Improvement ERP Engineering Management Project Planning Forecasting Program Management Negotiation Semiconductors ISO Integration Electronics Strategy SAP ERP Six Sigma Process Engineering Team Leadership Leadership Demand Planning Warehousing Troubleshooting Quality Management Materials Team Building FMEA Manufacturing Production Planning Testing Product Development Contract Management Manufacturing... Strategic Planning Budgets Quality Assurance Business Process... Inventory Control Process Simulation See 30+     See less Education Texas A&M University Bachelor of Business Administration,  Accounting 1979  – 1982 Kansas State University Accounting 1977  – 1979 school name Texas A&M University Bachelor of Business Administration,  Accounting 1979  – 1982 Texas A&M University Bachelor of Business Administration,  Accounting 1979  – 1982 Texas A&M University Bachelor of Business Administration,  Accounting 1979  – 1982 Kansas State University Accounting 1977  – 1979 Kansas State University Accounting 1977  – 1979 Kansas State University Accounting 1977  – 1979 school name school name school name ", "Summary An engineering professional and community volunteer with over 8 years experience in the health care and information technology industries. Graduated from Georgia Tech with highest honors with a Bachelor of Industrial Engineering. Consulted with key management and executive staff on issues involving operational efficiency, cost effectiveness, and service quality. Involved in supporting the community through a variety of volunteer activities. \n \nCurrently pursuing a Masters of Arts in Teaching from University of Southern California and a California Secondary Math Credential. I aspire to blend my engineering and education experience in my classroom practice. Specialties:Socio-cultural learning theory, Problem-solving strategies, 5e lesson planning, Social context of the learning environment, Language minority students, Authentic applications of math outside of the classroom, Effective use of student groups, Curriculum enrichment Summary An engineering professional and community volunteer with over 8 years experience in the health care and information technology industries. Graduated from Georgia Tech with highest honors with a Bachelor of Industrial Engineering. Consulted with key management and executive staff on issues involving operational efficiency, cost effectiveness, and service quality. Involved in supporting the community through a variety of volunteer activities. \n \nCurrently pursuing a Masters of Arts in Teaching from University of Southern California and a California Secondary Math Credential. I aspire to blend my engineering and education experience in my classroom practice. Specialties:Socio-cultural learning theory, Problem-solving strategies, 5e lesson planning, Social context of the learning environment, Language minority students, Authentic applications of math outside of the classroom, Effective use of student groups, Curriculum enrichment An engineering professional and community volunteer with over 8 years experience in the health care and information technology industries. Graduated from Georgia Tech with highest honors with a Bachelor of Industrial Engineering. Consulted with key management and executive staff on issues involving operational efficiency, cost effectiveness, and service quality. Involved in supporting the community through a variety of volunteer activities. \n \nCurrently pursuing a Masters of Arts in Teaching from University of Southern California and a California Secondary Math Credential. I aspire to blend my engineering and education experience in my classroom practice. Specialties:Socio-cultural learning theory, Problem-solving strategies, 5e lesson planning, Social context of the learning environment, Language minority students, Authentic applications of math outside of the classroom, Effective use of student groups, Curriculum enrichment An engineering professional and community volunteer with over 8 years experience in the health care and information technology industries. Graduated from Georgia Tech with highest honors with a Bachelor of Industrial Engineering. Consulted with key management and executive staff on issues involving operational efficiency, cost effectiveness, and service quality. Involved in supporting the community through a variety of volunteer activities. \n \nCurrently pursuing a Masters of Arts in Teaching from University of Southern California and a California Secondary Math Credential. I aspire to blend my engineering and education experience in my classroom practice. Specialties:Socio-cultural learning theory, Problem-solving strategies, 5e lesson planning, Social context of the learning environment, Language minority students, Authentic applications of math outside of the classroom, Effective use of student groups, Curriculum enrichment Experience Management Engineer Intermountain Healthcare May 1995  –  May 1998  (3 years 1 month) Management Engineer Intermountain Health Care January 1995  –  January 1998  (3 years 1 month) Provide management consulting to hospital administration, department managers, and team \nleaders striving to reduce costs and increase clinical and service quality. \nAssisted in development, implementation, and publicity of Redesign initiative. \nDeveloped and provided Redesign education to all county teams. \nFacilitated and participated in Redesign and Continuous Quality Improvement teams \nexamining Rehabilitation, Cardiology, Emergency, Administrative and Health Plan Services. Management Consultant The International Healthcare Consulting Group January 1994  –  January 1995  (1 year 1 month) Provide automated solutions for client hospitals in nursing and support services. Management Engineer University of North Carolina Hospitals January 1992  –  January 1994  (2 years 1 month) Provide management consulting to hospital and medical school administration in the pursuit of \nincreased efficiency and higher quality of service. Cost Engineer and Inventory Planner IBM Corporation January 1989  –  January 1992  (3 years 1 month) Management Engineer Intermountain Healthcare May 1995  –  May 1998  (3 years 1 month) Management Engineer Intermountain Healthcare May 1995  –  May 1998  (3 years 1 month) Management Engineer Intermountain Health Care January 1995  –  January 1998  (3 years 1 month) Provide management consulting to hospital administration, department managers, and team \nleaders striving to reduce costs and increase clinical and service quality. \nAssisted in development, implementation, and publicity of Redesign initiative. \nDeveloped and provided Redesign education to all county teams. \nFacilitated and participated in Redesign and Continuous Quality Improvement teams \nexamining Rehabilitation, Cardiology, Emergency, Administrative and Health Plan Services. Management Engineer Intermountain Health Care January 1995  –  January 1998  (3 years 1 month) Provide management consulting to hospital administration, department managers, and team \nleaders striving to reduce costs and increase clinical and service quality. \nAssisted in development, implementation, and publicity of Redesign initiative. \nDeveloped and provided Redesign education to all county teams. \nFacilitated and participated in Redesign and Continuous Quality Improvement teams \nexamining Rehabilitation, Cardiology, Emergency, Administrative and Health Plan Services. Management Consultant The International Healthcare Consulting Group January 1994  –  January 1995  (1 year 1 month) Provide automated solutions for client hospitals in nursing and support services. Management Consultant The International Healthcare Consulting Group January 1994  –  January 1995  (1 year 1 month) Provide automated solutions for client hospitals in nursing and support services. Management Engineer University of North Carolina Hospitals January 1992  –  January 1994  (2 years 1 month) Provide management consulting to hospital and medical school administration in the pursuit of \nincreased efficiency and higher quality of service. Management Engineer University of North Carolina Hospitals January 1992  –  January 1994  (2 years 1 month) Provide management consulting to hospital and medical school administration in the pursuit of \nincreased efficiency and higher quality of service. Cost Engineer and Inventory Planner IBM Corporation January 1989  –  January 1992  (3 years 1 month) Cost Engineer and Inventory Planner IBM Corporation January 1989  –  January 1992  (3 years 1 month) Education Georgia Institute of Technology BSIE,  Industrial Engineering 1984  – 1989 Georgia Tech Bachelor,  Industrial Engineering Georgia Institute of Technology BSIE,  Industrial Engineering 1984  – 1989 Georgia Institute of Technology BSIE,  Industrial Engineering 1984  – 1989 Georgia Institute of Technology BSIE,  Industrial Engineering 1984  – 1989 Georgia Tech Bachelor,  Industrial Engineering Georgia Tech Bachelor,  Industrial Engineering Georgia Tech Bachelor,  Industrial Engineering ", "Experience Operations Director ChartWorld International November 2011  – Present (3 years 10 months) Singapore, Singapore - Setup new global operations \n- Implement & deploy CRM, ERP, Financial system into ChartWorld using force.com platform \n- Develop new business model and launch globally \n- Manage Supply Chain & Quality Customer Services Manager EMEA Navico Logistics Europe B.V. February 2008  –  May 2011  (3 years 4 months) Manage EMEA Customer Service  \nSupply Chain Management \nDevelop & implement Global Service initiatives Inventory Planner IBM September 2006  –  February 2008  (1 year 6 months) Inventory Planner for High-End P and Z mainframes Supply Chain Analyst IBM September 2005  –  September 2006  (1 year 1 month) Dublin, Ireland Supply Chain Analyst for P Series Marketing and Operations Manager Firepro September 2003  –  October 2004  (1 year 2 months) Auckland, New Zealand Responsible for Supply Chain APAC and marketing and sales initiatives Operations Director ChartWorld International November 2011  – Present (3 years 10 months) Singapore, Singapore - Setup new global operations \n- Implement & deploy CRM, ERP, Financial system into ChartWorld using force.com platform \n- Develop new business model and launch globally \n- Manage Supply Chain & Quality Operations Director ChartWorld International November 2011  – Present (3 years 10 months) Singapore, Singapore - Setup new global operations \n- Implement & deploy CRM, ERP, Financial system into ChartWorld using force.com platform \n- Develop new business model and launch globally \n- Manage Supply Chain & Quality Customer Services Manager EMEA Navico Logistics Europe B.V. February 2008  –  May 2011  (3 years 4 months) Manage EMEA Customer Service  \nSupply Chain Management \nDevelop & implement Global Service initiatives Customer Services Manager EMEA Navico Logistics Europe B.V. February 2008  –  May 2011  (3 years 4 months) Manage EMEA Customer Service  \nSupply Chain Management \nDevelop & implement Global Service initiatives Inventory Planner IBM September 2006  –  February 2008  (1 year 6 months) Inventory Planner for High-End P and Z mainframes Inventory Planner IBM September 2006  –  February 2008  (1 year 6 months) Inventory Planner for High-End P and Z mainframes Supply Chain Analyst IBM September 2005  –  September 2006  (1 year 1 month) Dublin, Ireland Supply Chain Analyst for P Series Supply Chain Analyst IBM September 2005  –  September 2006  (1 year 1 month) Dublin, Ireland Supply Chain Analyst for P Series Marketing and Operations Manager Firepro September 2003  –  October 2004  (1 year 2 months) Auckland, New Zealand Responsible for Supply Chain APAC and marketing and sales initiatives Marketing and Operations Manager Firepro September 2003  –  October 2004  (1 year 2 months) Auckland, New Zealand Responsible for Supply Chain APAC and marketing and sales initiatives Skills Supply Chain Management Procurement Inventory Management Business Process... Team Building Operations Management Customer Service Data Analysis New Business Development Negotiation Reporting & Analysis CRM ERP Management Logistics Salesforce.com Shipping Contract Negotiation Process Improvement Forecasting Strategy Transportation See 7+     See less Skills  Supply Chain Management Procurement Inventory Management Business Process... Team Building Operations Management Customer Service Data Analysis New Business Development Negotiation Reporting & Analysis CRM ERP Management Logistics Salesforce.com Shipping Contract Negotiation Process Improvement Forecasting Strategy Transportation See 7+     See less Supply Chain Management Procurement Inventory Management Business Process... Team Building Operations Management Customer Service Data Analysis New Business Development Negotiation Reporting & Analysis CRM ERP Management Logistics Salesforce.com Shipping Contract Negotiation Process Improvement Forecasting Strategy Transportation See 7+     See less Supply Chain Management Procurement Inventory Management Business Process... Team Building Operations Management Customer Service Data Analysis New Business Development Negotiation Reporting & Analysis CRM ERP Management Logistics Salesforce.com Shipping Contract Negotiation Process Improvement Forecasting Strategy Transportation See 7+     See less Education University of Canterbury Bachelor of Commerce,  Management Science 1998  – 2002 Nayland College 1993  – 1997 University of Canterbury Bachelor of Commerce,  Management Science 1998  – 2002 University of Canterbury Bachelor of Commerce,  Management Science 1998  – 2002 University of Canterbury Bachelor of Commerce,  Management Science 1998  – 2002 Nayland College 1993  – 1997 Nayland College 1993  – 1997 Nayland College 1993  – 1997 ", "Experience Owner Verkeersschool LIMA November 2008  – Present (6 years 10 months) Amsterdam Area, Netherlands Owner of Driving school LIMA Amsterdam. Instructor of driving lessons. Specialist in providing driving lessons in English. Customers mainly expats and international students. Also given theory lessons in English. admin werker Europool 2002  –  2003  (1 year) Supply and Inventory Planner IBM 1998  –  2000  (2 years) Logistics Sony 1997  –  1998  (1 year) Owner Verkeersschool LIMA November 2008  – Present (6 years 10 months) Amsterdam Area, Netherlands Owner of Driving school LIMA Amsterdam. Instructor of driving lessons. Specialist in providing driving lessons in English. Customers mainly expats and international students. Also given theory lessons in English. Owner Verkeersschool LIMA November 2008  – Present (6 years 10 months) Amsterdam Area, Netherlands Owner of Driving school LIMA Amsterdam. Instructor of driving lessons. Specialist in providing driving lessons in English. Customers mainly expats and international students. Also given theory lessons in English. admin werker Europool 2002  –  2003  (1 year) admin werker Europool 2002  –  2003  (1 year) Supply and Inventory Planner IBM 1998  –  2000  (2 years) Supply and Inventory Planner IBM 1998  –  2000  (2 years) Logistics Sony 1997  –  1998  (1 year) Logistics Sony 1997  –  1998  (1 year) Skills driving lessons New Business Development SQL PHP C# Coaching Project Management Driver Training English Skills  driving lessons New Business Development SQL PHP C# Coaching Project Management Driver Training English driving lessons New Business Development SQL PHP C# Coaching Project Management Driver Training English driving lessons New Business Development SQL PHP C# Coaching Project Management Driver Training English Education Hogeschool van Arnhem en Nijmegen BBA,  Economics and Logistics 2000  – 2004 Hogewegschool groundschool 1977  – 1982 Hogeschool van Arnhem en Nijmegen BBA,  Economics and Logistics 2000  – 2004 Hogeschool van Arnhem en Nijmegen BBA,  Economics and Logistics 2000  – 2004 Hogeschool van Arnhem en Nijmegen BBA,  Economics and Logistics 2000  – 2004 Hogewegschool groundschool 1977  – 1982 Hogewegschool groundschool 1977  – 1982 Hogewegschool groundschool 1977  – 1982 ", "Experience Inventory Planner IBM Global Process Services August 2008  – Present (7 years 1 month) Inventory Planner IBM Global Process Services August 2008  – Present (7 years 1 month) Inventory Planner IBM Global Process Services August 2008  – Present (7 years 1 month) Skills Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Budgets Strategic Planning Vendor Management Skills  Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Budgets Strategic Planning Vendor Management Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Budgets Strategic Planning Vendor Management Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Budgets Strategic Planning Vendor Management Education Curtin University of Technology Bachelor of Commerce (B.Com.),  Finance and Marketing Curtin University of Technology Bachelor of Commerce (B.Com.),  Finance and Marketing Curtin University of Technology Bachelor of Commerce (B.Com.),  Finance and Marketing Curtin University of Technology Bachelor of Commerce (B.Com.),  Finance and Marketing ", "Summary Brian is a self motivated individual who enjoys learning new business and solving complex business process/tool/resource problems. He comes from a business background starting out as an accountant and can quickly visualize root causes of the pain points that businesses experience. He is an individual with a keen eye on achieving what others view as impossible or overwhelming and focuses on project/program delivery. \n \nBrian has 17+ years working on SAP projects and has held many roles in SAP implementations. Those positions span from Deployment Lead, Configurator, Process Integration Lead, all the way up to Project/Program Management. He is an individual with a keen eye on achieving what others view as impossible or overwhelming and focuses on project/program delivery. \n \nBrian moved into consulting to learn how other companies operate and develop a better rounded experience across many industries. He has worked in computer manufacturing, semiconductor manufacturing, tools manufacturing, consumer products distribution, solar energy power plants, financial services, and retail. Working in these many industries has provided insights that offer a unique end to end perspective in the data transformation supply chain. Summary Brian is a self motivated individual who enjoys learning new business and solving complex business process/tool/resource problems. He comes from a business background starting out as an accountant and can quickly visualize root causes of the pain points that businesses experience. He is an individual with a keen eye on achieving what others view as impossible or overwhelming and focuses on project/program delivery. \n \nBrian has 17+ years working on SAP projects and has held many roles in SAP implementations. Those positions span from Deployment Lead, Configurator, Process Integration Lead, all the way up to Project/Program Management. He is an individual with a keen eye on achieving what others view as impossible or overwhelming and focuses on project/program delivery. \n \nBrian moved into consulting to learn how other companies operate and develop a better rounded experience across many industries. He has worked in computer manufacturing, semiconductor manufacturing, tools manufacturing, consumer products distribution, solar energy power plants, financial services, and retail. Working in these many industries has provided insights that offer a unique end to end perspective in the data transformation supply chain. Brian is a self motivated individual who enjoys learning new business and solving complex business process/tool/resource problems. He comes from a business background starting out as an accountant and can quickly visualize root causes of the pain points that businesses experience. He is an individual with a keen eye on achieving what others view as impossible or overwhelming and focuses on project/program delivery. \n \nBrian has 17+ years working on SAP projects and has held many roles in SAP implementations. Those positions span from Deployment Lead, Configurator, Process Integration Lead, all the way up to Project/Program Management. He is an individual with a keen eye on achieving what others view as impossible or overwhelming and focuses on project/program delivery. \n \nBrian moved into consulting to learn how other companies operate and develop a better rounded experience across many industries. He has worked in computer manufacturing, semiconductor manufacturing, tools manufacturing, consumer products distribution, solar energy power plants, financial services, and retail. Working in these many industries has provided insights that offer a unique end to end perspective in the data transformation supply chain. Brian is a self motivated individual who enjoys learning new business and solving complex business process/tool/resource problems. He comes from a business background starting out as an accountant and can quickly visualize root causes of the pain points that businesses experience. He is an individual with a keen eye on achieving what others view as impossible or overwhelming and focuses on project/program delivery. \n \nBrian has 17+ years working on SAP projects and has held many roles in SAP implementations. Those positions span from Deployment Lead, Configurator, Process Integration Lead, all the way up to Project/Program Management. He is an individual with a keen eye on achieving what others view as impossible or overwhelming and focuses on project/program delivery. \n \nBrian moved into consulting to learn how other companies operate and develop a better rounded experience across many industries. He has worked in computer manufacturing, semiconductor manufacturing, tools manufacturing, consumer products distribution, solar energy power plants, financial services, and retail. Working in these many industries has provided insights that offer a unique end to end perspective in the data transformation supply chain. Experience Senior Managing Consultant IBM July 2006  – Present (9 years 2 months) Mobile - Lead external consulting engagements for the delivery of SAP Projects \n- Various Project Roles including: \nFI/CO Lead  \nProject/Program Manager \nBPC Practice Lead End to End Supply Chain Technical Solution Leader IBM 2004  –  2006  (2 years) Research Triangle Park, NC Lead end to end supply chain processes and architect SAP changes to support new business changes \n \nLead Integration of Record to Report, Procure to Pay, Order to Cash, Make to Stock, Configure to Order SAP FI Functional Team Member IBM 2000  –  2004  (4 years) Research Triangle Park, NC Performed FI Configuration and designed FI Processes/Changes \nWork on various SAP projects- new implementations, client merges, technical upgrades, conversions Finance Inventory Control Department Coordinator IBM 1999  –  2000  (1 year) Research Triangle Park, NC Lead inventory audits and department reconciliation reviews \nSite focal point with internal/external audit and corporate for US PC Company inventory accounting \nSAP Security and Authorization Administrator for the Finance Function SAP FI Deployment Lead for New ECC Implementation (PC Co Manufacturing) IBM May 1997  –  1999  (2 years) Research Triangle Park, NC FI Configuration \nData conversions for GR/IR, ledger balances, and open A/P \nFI Process design and integration for GR/IR, 3rd Party Direct Ship, Evaluated Receipt Settlement, Subcontracting, customer returns, vendor returns, inventory adjustments, inventory audits, Factory Parts Sales Invoicing, defective parts return, and inter-company sales US PC Co Inventory Planner IBM January 1997  –  May 1997  (5 months) Research Triangle Park, NC Forecast PC Co US Inventory \nPlan to Actual Sizing Analysis for all US Inventory Sites \nForecast Non-Logistics Inventory \nRun/Change SAS jobs to take the Sales Plan and break down to components \nForecast currency impacts on the inventory plan SAP Cost Accountant/ Retail Outlet Store Accountant IBM 1996  –  1996  (less than a year) Research Triangle Park Cost Materials \nWork Bill of Material (BOM) problems and costing errors \nLead the Financial Close in SAP \nReconcile GR/IR \nAccountant for the IBM Retail Outlet Store- Record sales/cogs/inventory/cash reconciliations Inventory Accountant IBM July 1994  –  1995  (1 year) Research Triangle Park, NC World Trade Inter-company invoicing \nFactory Parts Sales and Cash Reconciliation \nDistribute RTP plant billings for internal/external sales, internal usage of PC nventory, etc... \nGR/IR Adjustments \nInventory sizing and reconciliations Senior Managing Consultant IBM July 2006  – Present (9 years 2 months) Mobile - Lead external consulting engagements for the delivery of SAP Projects \n- Various Project Roles including: \nFI/CO Lead  \nProject/Program Manager \nBPC Practice Lead Senior Managing Consultant IBM July 2006  – Present (9 years 2 months) Mobile - Lead external consulting engagements for the delivery of SAP Projects \n- Various Project Roles including: \nFI/CO Lead  \nProject/Program Manager \nBPC Practice Lead End to End Supply Chain Technical Solution Leader IBM 2004  –  2006  (2 years) Research Triangle Park, NC Lead end to end supply chain processes and architect SAP changes to support new business changes \n \nLead Integration of Record to Report, Procure to Pay, Order to Cash, Make to Stock, Configure to Order End to End Supply Chain Technical Solution Leader IBM 2004  –  2006  (2 years) Research Triangle Park, NC Lead end to end supply chain processes and architect SAP changes to support new business changes \n \nLead Integration of Record to Report, Procure to Pay, Order to Cash, Make to Stock, Configure to Order SAP FI Functional Team Member IBM 2000  –  2004  (4 years) Research Triangle Park, NC Performed FI Configuration and designed FI Processes/Changes \nWork on various SAP projects- new implementations, client merges, technical upgrades, conversions SAP FI Functional Team Member IBM 2000  –  2004  (4 years) Research Triangle Park, NC Performed FI Configuration and designed FI Processes/Changes \nWork on various SAP projects- new implementations, client merges, technical upgrades, conversions Finance Inventory Control Department Coordinator IBM 1999  –  2000  (1 year) Research Triangle Park, NC Lead inventory audits and department reconciliation reviews \nSite focal point with internal/external audit and corporate for US PC Company inventory accounting \nSAP Security and Authorization Administrator for the Finance Function Finance Inventory Control Department Coordinator IBM 1999  –  2000  (1 year) Research Triangle Park, NC Lead inventory audits and department reconciliation reviews \nSite focal point with internal/external audit and corporate for US PC Company inventory accounting \nSAP Security and Authorization Administrator for the Finance Function SAP FI Deployment Lead for New ECC Implementation (PC Co Manufacturing) IBM May 1997  –  1999  (2 years) Research Triangle Park, NC FI Configuration \nData conversions for GR/IR, ledger balances, and open A/P \nFI Process design and integration for GR/IR, 3rd Party Direct Ship, Evaluated Receipt Settlement, Subcontracting, customer returns, vendor returns, inventory adjustments, inventory audits, Factory Parts Sales Invoicing, defective parts return, and inter-company sales SAP FI Deployment Lead for New ECC Implementation (PC Co Manufacturing) IBM May 1997  –  1999  (2 years) Research Triangle Park, NC FI Configuration \nData conversions for GR/IR, ledger balances, and open A/P \nFI Process design and integration for GR/IR, 3rd Party Direct Ship, Evaluated Receipt Settlement, Subcontracting, customer returns, vendor returns, inventory adjustments, inventory audits, Factory Parts Sales Invoicing, defective parts return, and inter-company sales US PC Co Inventory Planner IBM January 1997  –  May 1997  (5 months) Research Triangle Park, NC Forecast PC Co US Inventory \nPlan to Actual Sizing Analysis for all US Inventory Sites \nForecast Non-Logistics Inventory \nRun/Change SAS jobs to take the Sales Plan and break down to components \nForecast currency impacts on the inventory plan US PC Co Inventory Planner IBM January 1997  –  May 1997  (5 months) Research Triangle Park, NC Forecast PC Co US Inventory \nPlan to Actual Sizing Analysis for all US Inventory Sites \nForecast Non-Logistics Inventory \nRun/Change SAS jobs to take the Sales Plan and break down to components \nForecast currency impacts on the inventory plan SAP Cost Accountant/ Retail Outlet Store Accountant IBM 1996  –  1996  (less than a year) Research Triangle Park Cost Materials \nWork Bill of Material (BOM) problems and costing errors \nLead the Financial Close in SAP \nReconcile GR/IR \nAccountant for the IBM Retail Outlet Store- Record sales/cogs/inventory/cash reconciliations SAP Cost Accountant/ Retail Outlet Store Accountant IBM 1996  –  1996  (less than a year) Research Triangle Park Cost Materials \nWork Bill of Material (BOM) problems and costing errors \nLead the Financial Close in SAP \nReconcile GR/IR \nAccountant for the IBM Retail Outlet Store- Record sales/cogs/inventory/cash reconciliations Inventory Accountant IBM July 1994  –  1995  (1 year) Research Triangle Park, NC World Trade Inter-company invoicing \nFactory Parts Sales and Cash Reconciliation \nDistribute RTP plant billings for internal/external sales, internal usage of PC nventory, etc... \nGR/IR Adjustments \nInventory sizing and reconciliations Inventory Accountant IBM July 1994  –  1995  (1 year) Research Triangle Park, NC World Trade Inter-company invoicing \nFactory Parts Sales and Cash Reconciliation \nDistribute RTP plant billings for internal/external sales, internal usage of PC nventory, etc... \nGR/IR Adjustments \nInventory sizing and reconciliations Skills Business Process SAP R/3 SAP ERP ERP Business Intelligence IT Strategy SAP Implementation Requirements Analysis SAP Business Transformation Business Analysis Integration Business Process Design SD Master Data Management Data Migration Solution Architecture ABAP Supply Chain Business Process... ECC See 6+     See less Skills  Business Process SAP R/3 SAP ERP ERP Business Intelligence IT Strategy SAP Implementation Requirements Analysis SAP Business Transformation Business Analysis Integration Business Process Design SD Master Data Management Data Migration Solution Architecture ABAP Supply Chain Business Process... ECC See 6+     See less Business Process SAP R/3 SAP ERP ERP Business Intelligence IT Strategy SAP Implementation Requirements Analysis SAP Business Transformation Business Analysis Integration Business Process Design SD Master Data Management Data Migration Solution Architecture ABAP Supply Chain Business Process... ECC See 6+     See less Business Process SAP R/3 SAP ERP ERP Business Intelligence IT Strategy SAP Implementation Requirements Analysis SAP Business Transformation Business Analysis Integration Business Process Design SD Master Data Management Data Migration Solution Architecture ABAP Supply Chain Business Process... ECC See 6+     See less Education Virginia Polytechnic Institute and State University - Pamplin College of Business BA,  Accounting (Information Systems) 1990  – 1994 Virginia Polytechnic Institute and State University - Pamplin College of Business BA,  Accounting (Information Systems) 1990  – 1994 Virginia Polytechnic Institute and State University - Pamplin College of Business BA,  Accounting (Information Systems) 1990  – 1994 Virginia Polytechnic Institute and State University - Pamplin College of Business BA,  Accounting (Information Systems) 1990  – 1994 ", "Experience Senior Buyer General Motors November 2013  – Present (1 year 10 months) Warren, MI Program Buyer Johnson Controls, Inc. July 2011  –  October 2013  (2 years 4 months) Plymouth, MI Purchasing Professional Dow Corning August 2009  –  July 2011  (2 years) Logistics Buyer General Motors November 2006  –  April 2009  (2 years 6 months) Evaluated, negotiated, proposed, and awarded inbound material transportation business. Program Buyer Faurecia Automotive Seating 2002  –  2006  (4 years) Developed sources, obtained quotations, negotiated contracts, and ensured the cost and quality objectives were met throughout the development and launch phase of a product. Worldwide Material Planner IBM May 2001  –  April 2002  (1 year) Managed a commodity of components to ensure adequate supply was available in the highest profit margin territory. Inventory Planner IBM January 1999  –  April 2001  (2 years 4 months) Provided guidance to the financial organization on potential inventory risks and the action plans to mitigate those risks. Purchasing/Materials Intern Johnson Controls Automotive 1998  –  1998  (less than a year) Senior Buyer General Motors November 2013  – Present (1 year 10 months) Warren, MI Senior Buyer General Motors November 2013  – Present (1 year 10 months) Warren, MI Program Buyer Johnson Controls, Inc. July 2011  –  October 2013  (2 years 4 months) Plymouth, MI Program Buyer Johnson Controls, Inc. July 2011  –  October 2013  (2 years 4 months) Plymouth, MI Purchasing Professional Dow Corning August 2009  –  July 2011  (2 years) Purchasing Professional Dow Corning August 2009  –  July 2011  (2 years) Logistics Buyer General Motors November 2006  –  April 2009  (2 years 6 months) Evaluated, negotiated, proposed, and awarded inbound material transportation business. Logistics Buyer General Motors November 2006  –  April 2009  (2 years 6 months) Evaluated, negotiated, proposed, and awarded inbound material transportation business. Program Buyer Faurecia Automotive Seating 2002  –  2006  (4 years) Developed sources, obtained quotations, negotiated contracts, and ensured the cost and quality objectives were met throughout the development and launch phase of a product. Program Buyer Faurecia Automotive Seating 2002  –  2006  (4 years) Developed sources, obtained quotations, negotiated contracts, and ensured the cost and quality objectives were met throughout the development and launch phase of a product. Worldwide Material Planner IBM May 2001  –  April 2002  (1 year) Managed a commodity of components to ensure adequate supply was available in the highest profit margin territory. Worldwide Material Planner IBM May 2001  –  April 2002  (1 year) Managed a commodity of components to ensure adequate supply was available in the highest profit margin territory. Inventory Planner IBM January 1999  –  April 2001  (2 years 4 months) Provided guidance to the financial organization on potential inventory risks and the action plans to mitigate those risks. Inventory Planner IBM January 1999  –  April 2001  (2 years 4 months) Provided guidance to the financial organization on potential inventory risks and the action plans to mitigate those risks. Purchasing/Materials Intern Johnson Controls Automotive 1998  –  1998  (less than a year) Purchasing/Materials Intern Johnson Controls Automotive 1998  –  1998  (less than a year) Skills Supplier Quality Supply Chain Manufacturing Procurement Logistics Automotive Cross-functional Team... Continuous Improvement Product Development Transportation Negotiation Supplier Evaluation Supply Management Materials Management Kaizen Process Improvement Purchasing Lean Manufacturing APQP See 4+     See less Skills  Supplier Quality Supply Chain Manufacturing Procurement Logistics Automotive Cross-functional Team... Continuous Improvement Product Development Transportation Negotiation Supplier Evaluation Supply Management Materials Management Kaizen Process Improvement Purchasing Lean Manufacturing APQP See 4+     See less Supplier Quality Supply Chain Manufacturing Procurement Logistics Automotive Cross-functional Team... Continuous Improvement Product Development Transportation Negotiation Supplier Evaluation Supply Management Materials Management Kaizen Process Improvement Purchasing Lean Manufacturing APQP See 4+     See less Supplier Quality Supply Chain Manufacturing Procurement Logistics Automotive Cross-functional Team... Continuous Improvement Product Development Transportation Negotiation Supplier Evaluation Supply Management Materials Management Kaizen Process Improvement Purchasing Lean Manufacturing APQP See 4+     See less Education Oakland University MBA,  International Business 2004  – 2006 Michigan State University Bachelor of Arts,  Supply Chain Management 1996  – 1998 Institute for Supply Management Certified Professional in Supply Management Oakland University MBA,  International Business 2004  – 2006 Oakland University MBA,  International Business 2004  – 2006 Oakland University MBA,  International Business 2004  – 2006 Michigan State University Bachelor of Arts,  Supply Chain Management 1996  – 1998 Michigan State University Bachelor of Arts,  Supply Chain Management 1996  – 1998 Michigan State University Bachelor of Arts,  Supply Chain Management 1996  – 1998 Institute for Supply Management Certified Professional in Supply Management Institute for Supply Management Certified Professional in Supply Management Institute for Supply Management Certified Professional in Supply Management ", "Summary I have 20 years of experience supporting the IT needs of manufacturing and distribution companies. My specialties include business process analysis, re-engineering, and design, project leadership, application design and development, packaged solution implementation, user training and change management. \n \nSpecialties: SAP SD, SAP BRIM (CC, CI) Convergent Mediation \nJDE World & Oneworld Summary I have 20 years of experience supporting the IT needs of manufacturing and distribution companies. My specialties include business process analysis, re-engineering, and design, project leadership, application design and development, packaged solution implementation, user training and change management. \n \nSpecialties: SAP SD, SAP BRIM (CC, CI) Convergent Mediation \nJDE World & Oneworld I have 20 years of experience supporting the IT needs of manufacturing and distribution companies. My specialties include business process analysis, re-engineering, and design, project leadership, application design and development, packaged solution implementation, user training and change management. \n \nSpecialties: SAP SD, SAP BRIM (CC, CI) Convergent Mediation \nJDE World & Oneworld I have 20 years of experience supporting the IT needs of manufacturing and distribution companies. My specialties include business process analysis, re-engineering, and design, project leadership, application design and development, packaged solution implementation, user training and change management. \n \nSpecialties: SAP SD, SAP BRIM (CC, CI) Convergent Mediation \nJDE World & Oneworld Experience Business Analyst Lexmark International January 2005  – Present (10 years 8 months) OTC Lead for implementation of SAP ECC 6.0. SD process design and configuration, integration via IDOC and WebMethods with exisitng Siebel CRM system, integrated testing, user training, and cutover support. \n \nLead analyst for integration of Siebel CRM system to Legacy JDE World A7.3 ERP system. Designed new processes for service delivery and service billing. Coordinated and reviewed detailed designs of JDE, Siebel, and WebMethods developers (local and offshore) to ensure process consistency and data integrity. Developed test scripts and conducted end-to-end testing. Advised other project teams on JDE architecture as needed. Ensured system modifications adhered to corporate change management procedures. Senior Consultant IBM November 1998  –  January 2005  (6 years 3 months) Advised clients on implementation and customization of JDE Distribution and Service Management modules. Conducted system overview and business process design workshops with client team leaders. Developed and implemented JDE system configuration for Order-to-Cash and Service business processes. Conducted integrated system testing, trained end users, provided cutover and post go-live support. Developed IBM’s Supply Chain Advantage rapid implementation methodology. \n \nJDEdwards OneWorld Xe Certified Developer. Assisted with conversion of legacy system data. Designed and developed custom enhancements and interfaces to support industry-specific business needs. Trained client I/T staff on JDE OneWorld Development Toolset. Developed Functional Designs and Detailed Technical Specifications and coordinated development by offshore programming teams \n \nMet or exceeded billable utilization target of 80% every year. Exceeded customer expectations in 17 implementation projects. IT Programmer/Analyst Lexmark, International March 1990  –  November 1998  (8 years 9 months) Inventory Planner IBM July 1988  –  March 1990  (1 year 9 months) Business Analyst Lexmark International January 2005  – Present (10 years 8 months) OTC Lead for implementation of SAP ECC 6.0. SD process design and configuration, integration via IDOC and WebMethods with exisitng Siebel CRM system, integrated testing, user training, and cutover support. \n \nLead analyst for integration of Siebel CRM system to Legacy JDE World A7.3 ERP system. Designed new processes for service delivery and service billing. Coordinated and reviewed detailed designs of JDE, Siebel, and WebMethods developers (local and offshore) to ensure process consistency and data integrity. Developed test scripts and conducted end-to-end testing. Advised other project teams on JDE architecture as needed. Ensured system modifications adhered to corporate change management procedures. Business Analyst Lexmark International January 2005  – Present (10 years 8 months) OTC Lead for implementation of SAP ECC 6.0. SD process design and configuration, integration via IDOC and WebMethods with exisitng Siebel CRM system, integrated testing, user training, and cutover support. \n \nLead analyst for integration of Siebel CRM system to Legacy JDE World A7.3 ERP system. Designed new processes for service delivery and service billing. Coordinated and reviewed detailed designs of JDE, Siebel, and WebMethods developers (local and offshore) to ensure process consistency and data integrity. Developed test scripts and conducted end-to-end testing. Advised other project teams on JDE architecture as needed. Ensured system modifications adhered to corporate change management procedures. Senior Consultant IBM November 1998  –  January 2005  (6 years 3 months) Advised clients on implementation and customization of JDE Distribution and Service Management modules. Conducted system overview and business process design workshops with client team leaders. Developed and implemented JDE system configuration for Order-to-Cash and Service business processes. Conducted integrated system testing, trained end users, provided cutover and post go-live support. Developed IBM’s Supply Chain Advantage rapid implementation methodology. \n \nJDEdwards OneWorld Xe Certified Developer. Assisted with conversion of legacy system data. Designed and developed custom enhancements and interfaces to support industry-specific business needs. Trained client I/T staff on JDE OneWorld Development Toolset. Developed Functional Designs and Detailed Technical Specifications and coordinated development by offshore programming teams \n \nMet or exceeded billable utilization target of 80% every year. Exceeded customer expectations in 17 implementation projects. Senior Consultant IBM November 1998  –  January 2005  (6 years 3 months) Advised clients on implementation and customization of JDE Distribution and Service Management modules. Conducted system overview and business process design workshops with client team leaders. Developed and implemented JDE system configuration for Order-to-Cash and Service business processes. Conducted integrated system testing, trained end users, provided cutover and post go-live support. Developed IBM’s Supply Chain Advantage rapid implementation methodology. \n \nJDEdwards OneWorld Xe Certified Developer. Assisted with conversion of legacy system data. Designed and developed custom enhancements and interfaces to support industry-specific business needs. Trained client I/T staff on JDE OneWorld Development Toolset. Developed Functional Designs and Detailed Technical Specifications and coordinated development by offshore programming teams \n \nMet or exceeded billable utilization target of 80% every year. Exceeded customer expectations in 17 implementation projects. IT Programmer/Analyst Lexmark, International March 1990  –  November 1998  (8 years 9 months) IT Programmer/Analyst Lexmark, International March 1990  –  November 1998  (8 years 9 months) Inventory Planner IBM July 1988  –  March 1990  (1 year 9 months) Inventory Planner IBM July 1988  –  March 1990  (1 year 9 months) Languages French Native or bilingual proficiency German Professional working proficiency Chinese Elementary proficiency Spanish Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency German Professional working proficiency Chinese Elementary proficiency Spanish Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency German Professional working proficiency Chinese Elementary proficiency Spanish Elementary proficiency English Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Elementary proficiency Native or bilingual proficiency Skills Business Process ERP Integration Business Analysis Business Process Design SAP ERP JD Edwards Change Management Supply Chain Business Process... SAP Project Management SAP Implementation EDI Visio Requirements Analysis IDOC SAP SD Software Project... Supply Chain Management SQL Business Transformation Testing MS Project Business Intelligence PMP Process Improvement SAP Convergent Charging Service Delivery IT Strategy Team Leadership IT Management Siebel SDLC SD Vendor Management Data Migration Enterprise Architecture Enterprise Software See 24+     See less Skills  Business Process ERP Integration Business Analysis Business Process Design SAP ERP JD Edwards Change Management Supply Chain Business Process... SAP Project Management SAP Implementation EDI Visio Requirements Analysis IDOC SAP SD Software Project... Supply Chain Management SQL Business Transformation Testing MS Project Business Intelligence PMP Process Improvement SAP Convergent Charging Service Delivery IT Strategy Team Leadership IT Management Siebel SDLC SD Vendor Management Data Migration Enterprise Architecture Enterprise Software See 24+     See less Business Process ERP Integration Business Analysis Business Process Design SAP ERP JD Edwards Change Management Supply Chain Business Process... SAP Project Management SAP Implementation EDI Visio Requirements Analysis IDOC SAP SD Software Project... Supply Chain Management SQL Business Transformation Testing MS Project Business Intelligence PMP Process Improvement SAP Convergent Charging Service Delivery IT Strategy Team Leadership IT Management Siebel SDLC SD Vendor Management Data Migration Enterprise Architecture Enterprise Software See 24+     See less Business Process ERP Integration Business Analysis Business Process Design SAP ERP JD Edwards Change Management Supply Chain Business Process... SAP Project Management SAP Implementation EDI Visio Requirements Analysis IDOC SAP SD Software Project... Supply Chain Management SQL Business Transformation Testing MS Project Business Intelligence PMP Process Improvement SAP Convergent Charging Service Delivery IT Strategy Team Leadership IT Management Siebel SDLC SD Vendor Management Data Migration Enterprise Architecture Enterprise Software See 24+     See less Education University of Kentucky M.S.,  Operations Research January 1989  – August 1994 Brown University Sc.B.,  Applied Mathematics 1984  – 1988 Activities and Societies:  Fencing Team ,  French House University of Kentucky M.S.,  Operations Research January 1989  – August 1994 University of Kentucky M.S.,  Operations Research January 1989  – August 1994 University of Kentucky M.S.,  Operations Research January 1989  – August 1994 Brown University Sc.B.,  Applied Mathematics 1984  – 1988 Activities and Societies:  Fencing Team ,  French House Brown University Sc.B.,  Applied Mathematics 1984  – 1988 Activities and Societies:  Fencing Team ,  French House Brown University Sc.B.,  Applied Mathematics 1984  – 1988 Activities and Societies:  Fencing Team ,  French House ", "Experience Owner La Foresta Italian Cafe September 1992  – Present (23 years) Wake Forest, NC Restaurant Owner La Foresta Italian Cafe September 1992  – Present (23 years) Wake Forest, NC A full service restaurant and catering business, serving lunch and dinner, for over 22 years.  \nOperational Business Manager. Employee relations. System analyst/Information Technology, Inventory control, Payroll Admin, Bookkeeping.  \n \nSpotlighted Achievements  \n- 1992 Opened 50 seat/1350 sq ft Restaurant start up with 8 employees.  \n- 1998 Business Plan/bank financing to construct a new, larger restaurant. Started construction.  \n- 2000 Opened 120 seat/3800 sq ft Restaurant. Employs 25 people.  \n- 2011 Voted Best Italian Restaurant- \"Best of the Best\" awards for N. Raleigh/Wake Forest area. \n- 2012 Voted Best Italian Restaurant- \"Best of the Best\" awards for N. Raleigh/Wake Forest area. \n- 2013 Voted Best Italian Restaurant- \"Best of the Best\" awards for N. Raleigh/Wake Forest area. Advisory Logistics Engineer IBM July 1989  –  June 1992  (3 years) Research Triangle Park, NC Networks Systems Division  \nSupply Chain Business Process Improvements. Make Market Pilot - Technical Leader/Coordinator of cross functional team. Utilized data and process analysis to implement innovative process improvements in the customer fulfillment cycle. Status presentations to Executive Management.  \n \nSpotlighted Achievements  \n- Documentation of Market Driven Quality Business Process for 3745 Manufacturing Line. Implemented process improvements to realize a Product Cycle Time Reduction of 4 days. EMLS Central User Manager IBM April 1987  –  June 1989  (2 years 3 months) Sterling Forest, NY Technology Products HQ - US Enterprise Materials Logistics System (EMLS) \nInterviewed & hired a start up team of 6 for an IBM internal Materials Requirement Planning System. Managed the development of a process for running EMLS in the US. User Team testing with 16 IBM locations in US and Japan. Plan Review participant, to determine site readiness at all internal IBM Locations, prior to system installation.  \n \nSpotlighted Achievements  \n- Successfully managed the development and production implementation in the US of the Central User Portion of EMLS, within the targeted 2 year timeframe. Staff Application Systems Analyst IBM April 1984  –  April 1987  (3 years 1 month) White Plains, NY Technology Products HQ - Scheduling Plans & Controls  \nMAPPS - Materials and Production Planning System.  \nTest Plan & Test Case development, Application Testing (unit, systems, integration, regression), User Manual development, User Education.  \n \nSpotlighted Achievements  \n- Project Coordinator for the successful implementation and Production Cutover of the the MAPPS Application, for all IBM domestic Manufacturing Sites. Manufacturing Scheduling Manager IBM June 1983  –  April 1984  (11 months) Poughkeepsie, NY Production Control  \n1st Line Manager of Production Schedulers (6 people) for all Poughkeepsie Manufacturing Lines.  \nSpotlighted Achievements  \n- Established an automated process improvement program for the Manufacturing Scheduling department that reduced the staff required to perform the same tasks, by 75%. Application Systems Analyst & Site Inventory Planner IBM June 1979  –  June 1983  (4 years 1 month) Poughkeepsie, NY Materials Management  \nSystems interface between Material Management users and Information Systems programmers. User Education, SQL Report Generation, Documentation of System Change Request Requirements, User Regression Testing.  \nSpotlighted Achievements  \n- Developed a thorough knowledge of warehouse, production control and manufacturing processes and systems.  \n- Established as an expert resource, interfacing with users to identify, document and test system enhancements. Owner La Foresta Italian Cafe September 1992  – Present (23 years) Wake Forest, NC Owner La Foresta Italian Cafe September 1992  – Present (23 years) Wake Forest, NC Restaurant Owner La Foresta Italian Cafe September 1992  – Present (23 years) Wake Forest, NC A full service restaurant and catering business, serving lunch and dinner, for over 22 years.  \nOperational Business Manager. Employee relations. System analyst/Information Technology, Inventory control, Payroll Admin, Bookkeeping.  \n \nSpotlighted Achievements  \n- 1992 Opened 50 seat/1350 sq ft Restaurant start up with 8 employees.  \n- 1998 Business Plan/bank financing to construct a new, larger restaurant. Started construction.  \n- 2000 Opened 120 seat/3800 sq ft Restaurant. Employs 25 people.  \n- 2011 Voted Best Italian Restaurant- \"Best of the Best\" awards for N. Raleigh/Wake Forest area. \n- 2012 Voted Best Italian Restaurant- \"Best of the Best\" awards for N. Raleigh/Wake Forest area. \n- 2013 Voted Best Italian Restaurant- \"Best of the Best\" awards for N. Raleigh/Wake Forest area. Restaurant Owner La Foresta Italian Cafe September 1992  – Present (23 years) Wake Forest, NC A full service restaurant and catering business, serving lunch and dinner, for over 22 years.  \nOperational Business Manager. Employee relations. System analyst/Information Technology, Inventory control, Payroll Admin, Bookkeeping.  \n \nSpotlighted Achievements  \n- 1992 Opened 50 seat/1350 sq ft Restaurant start up with 8 employees.  \n- 1998 Business Plan/bank financing to construct a new, larger restaurant. Started construction.  \n- 2000 Opened 120 seat/3800 sq ft Restaurant. Employs 25 people.  \n- 2011 Voted Best Italian Restaurant- \"Best of the Best\" awards for N. Raleigh/Wake Forest area. \n- 2012 Voted Best Italian Restaurant- \"Best of the Best\" awards for N. Raleigh/Wake Forest area. \n- 2013 Voted Best Italian Restaurant- \"Best of the Best\" awards for N. Raleigh/Wake Forest area. Advisory Logistics Engineer IBM July 1989  –  June 1992  (3 years) Research Triangle Park, NC Networks Systems Division  \nSupply Chain Business Process Improvements. Make Market Pilot - Technical Leader/Coordinator of cross functional team. Utilized data and process analysis to implement innovative process improvements in the customer fulfillment cycle. Status presentations to Executive Management.  \n \nSpotlighted Achievements  \n- Documentation of Market Driven Quality Business Process for 3745 Manufacturing Line. Implemented process improvements to realize a Product Cycle Time Reduction of 4 days. Advisory Logistics Engineer IBM July 1989  –  June 1992  (3 years) Research Triangle Park, NC Networks Systems Division  \nSupply Chain Business Process Improvements. Make Market Pilot - Technical Leader/Coordinator of cross functional team. Utilized data and process analysis to implement innovative process improvements in the customer fulfillment cycle. Status presentations to Executive Management.  \n \nSpotlighted Achievements  \n- Documentation of Market Driven Quality Business Process for 3745 Manufacturing Line. Implemented process improvements to realize a Product Cycle Time Reduction of 4 days. EMLS Central User Manager IBM April 1987  –  June 1989  (2 years 3 months) Sterling Forest, NY Technology Products HQ - US Enterprise Materials Logistics System (EMLS) \nInterviewed & hired a start up team of 6 for an IBM internal Materials Requirement Planning System. Managed the development of a process for running EMLS in the US. User Team testing with 16 IBM locations in US and Japan. Plan Review participant, to determine site readiness at all internal IBM Locations, prior to system installation.  \n \nSpotlighted Achievements  \n- Successfully managed the development and production implementation in the US of the Central User Portion of EMLS, within the targeted 2 year timeframe. EMLS Central User Manager IBM April 1987  –  June 1989  (2 years 3 months) Sterling Forest, NY Technology Products HQ - US Enterprise Materials Logistics System (EMLS) \nInterviewed & hired a start up team of 6 for an IBM internal Materials Requirement Planning System. Managed the development of a process for running EMLS in the US. User Team testing with 16 IBM locations in US and Japan. Plan Review participant, to determine site readiness at all internal IBM Locations, prior to system installation.  \n \nSpotlighted Achievements  \n- Successfully managed the development and production implementation in the US of the Central User Portion of EMLS, within the targeted 2 year timeframe. Staff Application Systems Analyst IBM April 1984  –  April 1987  (3 years 1 month) White Plains, NY Technology Products HQ - Scheduling Plans & Controls  \nMAPPS - Materials and Production Planning System.  \nTest Plan & Test Case development, Application Testing (unit, systems, integration, regression), User Manual development, User Education.  \n \nSpotlighted Achievements  \n- Project Coordinator for the successful implementation and Production Cutover of the the MAPPS Application, for all IBM domestic Manufacturing Sites. Staff Application Systems Analyst IBM April 1984  –  April 1987  (3 years 1 month) White Plains, NY Technology Products HQ - Scheduling Plans & Controls  \nMAPPS - Materials and Production Planning System.  \nTest Plan & Test Case development, Application Testing (unit, systems, integration, regression), User Manual development, User Education.  \n \nSpotlighted Achievements  \n- Project Coordinator for the successful implementation and Production Cutover of the the MAPPS Application, for all IBM domestic Manufacturing Sites. Manufacturing Scheduling Manager IBM June 1983  –  April 1984  (11 months) Poughkeepsie, NY Production Control  \n1st Line Manager of Production Schedulers (6 people) for all Poughkeepsie Manufacturing Lines.  \nSpotlighted Achievements  \n- Established an automated process improvement program for the Manufacturing Scheduling department that reduced the staff required to perform the same tasks, by 75%. Manufacturing Scheduling Manager IBM June 1983  –  April 1984  (11 months) Poughkeepsie, NY Production Control  \n1st Line Manager of Production Schedulers (6 people) for all Poughkeepsie Manufacturing Lines.  \nSpotlighted Achievements  \n- Established an automated process improvement program for the Manufacturing Scheduling department that reduced the staff required to perform the same tasks, by 75%. Application Systems Analyst & Site Inventory Planner IBM June 1979  –  June 1983  (4 years 1 month) Poughkeepsie, NY Materials Management  \nSystems interface between Material Management users and Information Systems programmers. User Education, SQL Report Generation, Documentation of System Change Request Requirements, User Regression Testing.  \nSpotlighted Achievements  \n- Developed a thorough knowledge of warehouse, production control and manufacturing processes and systems.  \n- Established as an expert resource, interfacing with users to identify, document and test system enhancements. Application Systems Analyst & Site Inventory Planner IBM June 1979  –  June 1983  (4 years 1 month) Poughkeepsie, NY Materials Management  \nSystems interface between Material Management users and Information Systems programmers. User Education, SQL Report Generation, Documentation of System Change Request Requirements, User Regression Testing.  \nSpotlighted Achievements  \n- Developed a thorough knowledge of warehouse, production control and manufacturing processes and systems.  \n- Established as an expert resource, interfacing with users to identify, document and test system enhancements. Skills Customer Service Event Planning Microsoft Office Event Management Microsoft Excel Management PowerPoint Microsoft Word Retail QuickBooks Payroll Bookkeeping Inventory Management Integration Leadership Development Public Speaking Process Improvement Software Documentation Leadership Customer Satisfaction Process Scheduler Cross-functional Team... Research Employee Relations Team Building Training Start-ups Logistics Business Process Business Process... Social Networking Coaching Team Leadership See 18+     See less Skills  Customer Service Event Planning Microsoft Office Event Management Microsoft Excel Management PowerPoint Microsoft Word Retail QuickBooks Payroll Bookkeeping Inventory Management Integration Leadership Development Public Speaking Process Improvement Software Documentation Leadership Customer Satisfaction Process Scheduler Cross-functional Team... Research Employee Relations Team Building Training Start-ups Logistics Business Process Business Process... Social Networking Coaching Team Leadership See 18+     See less Customer Service Event Planning Microsoft Office Event Management Microsoft Excel Management PowerPoint Microsoft Word Retail QuickBooks Payroll Bookkeeping Inventory Management Integration Leadership Development Public Speaking Process Improvement Software Documentation Leadership Customer Satisfaction Process Scheduler Cross-functional Team... Research Employee Relations Team Building Training Start-ups Logistics Business Process Business Process... Social Networking Coaching Team Leadership See 18+     See less Customer Service Event Planning Microsoft Office Event Management Microsoft Excel Management PowerPoint Microsoft Word Retail QuickBooks Payroll Bookkeeping Inventory Management Integration Leadership Development Public Speaking Process Improvement Software Documentation Leadership Customer Satisfaction Process Scheduler Cross-functional Team... Research Employee Relations Team Building Training Start-ups Logistics Business Process Business Process... Social Networking Coaching Team Leadership See 18+     See less Education Syracuse University Bachelor of Science (B.S.),  Industrial Engineering and Operations Research 1976  – 1979 Activities and Societies:  SU Marching Band ,  Alpha Gamma Delta Sorority KSI International Syracuse University Bachelor of Science (B.S.),  Industrial Engineering and Operations Research 1976  – 1979 Activities and Societies:  SU Marching Band ,  Alpha Gamma Delta Sorority Syracuse University Bachelor of Science (B.S.),  Industrial Engineering and Operations Research 1976  – 1979 Activities and Societies:  SU Marching Band ,  Alpha Gamma Delta Sorority Syracuse University Bachelor of Science (B.S.),  Industrial Engineering and Operations Research 1976  – 1979 Activities and Societies:  SU Marching Band ,  Alpha Gamma Delta Sorority KSI International KSI International KSI International ", "Experience Inventory Planner IBM October 2014  – Present (11 months) Category Analyst Kmart Australia Limited January 2014  –  September 2014  (9 months) mulgrave Inventory Co-ordinator Kmart Australia Limited July 2012  –  January 2014  (1 year 7 months) Buying Assistant Kmart Australia Limited January 2007  –  July 2012  (5 years 7 months) Freight Co-ordinator (Intl Supply Chain) Coles Myer June 2005  –  January 2007  (1 year 8 months) Inventory Planner IBM October 2014  – Present (11 months) Inventory Planner IBM October 2014  – Present (11 months) Category Analyst Kmart Australia Limited January 2014  –  September 2014  (9 months) mulgrave Category Analyst Kmart Australia Limited January 2014  –  September 2014  (9 months) mulgrave Inventory Co-ordinator Kmart Australia Limited July 2012  –  January 2014  (1 year 7 months) Inventory Co-ordinator Kmart Australia Limited July 2012  –  January 2014  (1 year 7 months) Buying Assistant Kmart Australia Limited January 2007  –  July 2012  (5 years 7 months) Buying Assistant Kmart Australia Limited January 2007  –  July 2012  (5 years 7 months) Freight Co-ordinator (Intl Supply Chain) Coles Myer June 2005  –  January 2007  (1 year 8 months) Freight Co-ordinator (Intl Supply Chain) Coles Myer June 2005  –  January 2007  (1 year 8 months) Skills Merchandising Apparel Merchandise Planning Stock Management Inventory Control Supply Chain Footwear Microsoft Excel Logistics Inventory Management Retail Retail Buying Trend Analysis Stock Control Fashion Buying Demand Forecasting Supply Chain Management Inventory Analysis JDA Planograms Trend New Store Development Sportswear Customer Service Teamwork See 10+     See less Skills  Merchandising Apparel Merchandise Planning Stock Management Inventory Control Supply Chain Footwear Microsoft Excel Logistics Inventory Management Retail Retail Buying Trend Analysis Stock Control Fashion Buying Demand Forecasting Supply Chain Management Inventory Analysis JDA Planograms Trend New Store Development Sportswear Customer Service Teamwork See 10+     See less Merchandising Apparel Merchandise Planning Stock Management Inventory Control Supply Chain Footwear Microsoft Excel Logistics Inventory Management Retail Retail Buying Trend Analysis Stock Control Fashion Buying Demand Forecasting Supply Chain Management Inventory Analysis JDA Planograms Trend New Store Development Sportswear Customer Service Teamwork See 10+     See less Merchandising Apparel Merchandise Planning Stock Management Inventory Control Supply Chain Footwear Microsoft Excel Logistics Inventory Management Retail Retail Buying Trend Analysis Stock Control Fashion Buying Demand Forecasting Supply Chain Management Inventory Analysis JDA Planograms Trend New Store Development Sportswear Customer Service Teamwork See 10+     See less Education University of Melbourne Master of Applied Commerce,  Specialised in Marketing 2001  – 2002 RMIT University Transport & Logistics Management,  International Supply Chain 1998  – 2000 University of Melbourne Master of Applied Commerce,  Specialised in Marketing 2001  – 2002 University of Melbourne Master of Applied Commerce,  Specialised in Marketing 2001  – 2002 University of Melbourne Master of Applied Commerce,  Specialised in Marketing 2001  – 2002 RMIT University Transport & Logistics Management,  International Supply Chain 1998  – 2000 RMIT University Transport & Logistics Management,  International Supply Chain 1998  – 2000 RMIT University Transport & Logistics Management,  International Supply Chain 1998  – 2000 ", "Summary Customer centric supply chain professional with a proven track record of managing logistics and order fulfillment processes for a product life cycle from pre-announcement until end of life, ensuring highest possible attainment of revenue and customer satisfaction. Results-oriented and energized by tackling hard problems, considering all options, anticipating challenges and providing implemental solutions. Regarded as a trusted advisor and partner, able to resolve the most complex challenges. Strengths and capabilities include: \n \n•\tRelationship Management \n•\tExcellent analytical and creative problem solving  \n•\tStrong Communication \n•\tTime Management  \n•\tProcess Improvement \n•\tLeadership Summary Customer centric supply chain professional with a proven track record of managing logistics and order fulfillment processes for a product life cycle from pre-announcement until end of life, ensuring highest possible attainment of revenue and customer satisfaction. Results-oriented and energized by tackling hard problems, considering all options, anticipating challenges and providing implemental solutions. Regarded as a trusted advisor and partner, able to resolve the most complex challenges. Strengths and capabilities include: \n \n•\tRelationship Management \n•\tExcellent analytical and creative problem solving  \n•\tStrong Communication \n•\tTime Management  \n•\tProcess Improvement \n•\tLeadership Customer centric supply chain professional with a proven track record of managing logistics and order fulfillment processes for a product life cycle from pre-announcement until end of life, ensuring highest possible attainment of revenue and customer satisfaction. Results-oriented and energized by tackling hard problems, considering all options, anticipating challenges and providing implemental solutions. Regarded as a trusted advisor and partner, able to resolve the most complex challenges. Strengths and capabilities include: \n \n•\tRelationship Management \n•\tExcellent analytical and creative problem solving  \n•\tStrong Communication \n•\tTime Management  \n•\tProcess Improvement \n•\tLeadership Customer centric supply chain professional with a proven track record of managing logistics and order fulfillment processes for a product life cycle from pre-announcement until end of life, ensuring highest possible attainment of revenue and customer satisfaction. Results-oriented and energized by tackling hard problems, considering all options, anticipating challenges and providing implemental solutions. Regarded as a trusted advisor and partner, able to resolve the most complex challenges. Strengths and capabilities include: \n \n•\tRelationship Management \n•\tExcellent analytical and creative problem solving  \n•\tStrong Communication \n•\tTime Management  \n•\tProcess Improvement \n•\tLeadership Experience Free Agent IBM 2013  – Present (2 years) . Supply Chain Management - Americas Order Fulfillment and Supply Planner IBM 2003  –  2013  (10 years) •\tManaged a portfolio of over 50 different products produced in multiple manufacturing sites around the world, with a wide variety of configurations and customer requirements resulting in an annual product revenue stream of $1.5B. \n•\tPrimary point of contact between sales, manufacturing and logistics, effectively managing incoming orders, matching them with available inventory and ensuring on time shipment. \n•\tMeticulously managed customers requiring unique and/or customized orders, inventory and/or fulfillment solutions including complex configurations resulting in customer satisfaction. \n•\tDeveloped and maintained a broad range of data tools for management, sales and manufacturing which improved turn-around time, customer satisfaction, process efficiency, workload balancing and team communications.  \n•\tManaged new products, anticipated and resolved potential issues, ensuring an error free rollout.  \n•\tLed global supply team that developed standardized processes and performance guidelines for product supply planners in Americas, Europe and Asia Pacific reducing duplications, improving ease of backups, and a common evolution process.  \n•\tConsidered worldwide subject matter expert in scheduling. Provided ongoing training, education and mentoring to sales teams and emerging market leaders (Latin America), helping improve internal efficiencies and meet corporate targets.  \n•\tFacilitated communications between manufacturing plants and sales teams, advising and guiding through complex supply challenges, unexpected delays, and offering customers alternative solutions, resulting in customer satisfaction, achievement of revenue objectives and utilization of available inventory. Supply Chain Management - North Americas Order Fulfillment and Supply Planner IBM 1997  –  2003  (6 years) . Supply Chain Management - Canada Order Fulfillment and Supply Planner IBM 1995  –  1997  (2 years) . Demand and Inventory Planner IBM 1995  –  1995  (less than a year) - Demand planner for IBM Canada's AS400 and RS6000 (Power) server division.  \n- Inventory planner for IBM Canada to IBM Corporation. Free Agent IBM 2013  – Present (2 years) . Free Agent IBM 2013  – Present (2 years) . Supply Chain Management - Americas Order Fulfillment and Supply Planner IBM 2003  –  2013  (10 years) •\tManaged a portfolio of over 50 different products produced in multiple manufacturing sites around the world, with a wide variety of configurations and customer requirements resulting in an annual product revenue stream of $1.5B. \n•\tPrimary point of contact between sales, manufacturing and logistics, effectively managing incoming orders, matching them with available inventory and ensuring on time shipment. \n•\tMeticulously managed customers requiring unique and/or customized orders, inventory and/or fulfillment solutions including complex configurations resulting in customer satisfaction. \n•\tDeveloped and maintained a broad range of data tools for management, sales and manufacturing which improved turn-around time, customer satisfaction, process efficiency, workload balancing and team communications.  \n•\tManaged new products, anticipated and resolved potential issues, ensuring an error free rollout.  \n•\tLed global supply team that developed standardized processes and performance guidelines for product supply planners in Americas, Europe and Asia Pacific reducing duplications, improving ease of backups, and a common evolution process.  \n•\tConsidered worldwide subject matter expert in scheduling. Provided ongoing training, education and mentoring to sales teams and emerging market leaders (Latin America), helping improve internal efficiencies and meet corporate targets.  \n•\tFacilitated communications between manufacturing plants and sales teams, advising and guiding through complex supply challenges, unexpected delays, and offering customers alternative solutions, resulting in customer satisfaction, achievement of revenue objectives and utilization of available inventory. Supply Chain Management - Americas Order Fulfillment and Supply Planner IBM 2003  –  2013  (10 years) •\tManaged a portfolio of over 50 different products produced in multiple manufacturing sites around the world, with a wide variety of configurations and customer requirements resulting in an annual product revenue stream of $1.5B. \n•\tPrimary point of contact between sales, manufacturing and logistics, effectively managing incoming orders, matching them with available inventory and ensuring on time shipment. \n•\tMeticulously managed customers requiring unique and/or customized orders, inventory and/or fulfillment solutions including complex configurations resulting in customer satisfaction. \n•\tDeveloped and maintained a broad range of data tools for management, sales and manufacturing which improved turn-around time, customer satisfaction, process efficiency, workload balancing and team communications.  \n•\tManaged new products, anticipated and resolved potential issues, ensuring an error free rollout.  \n•\tLed global supply team that developed standardized processes and performance guidelines for product supply planners in Americas, Europe and Asia Pacific reducing duplications, improving ease of backups, and a common evolution process.  \n•\tConsidered worldwide subject matter expert in scheduling. Provided ongoing training, education and mentoring to sales teams and emerging market leaders (Latin America), helping improve internal efficiencies and meet corporate targets.  \n•\tFacilitated communications between manufacturing plants and sales teams, advising and guiding through complex supply challenges, unexpected delays, and offering customers alternative solutions, resulting in customer satisfaction, achievement of revenue objectives and utilization of available inventory. Supply Chain Management - North Americas Order Fulfillment and Supply Planner IBM 1997  –  2003  (6 years) . Supply Chain Management - North Americas Order Fulfillment and Supply Planner IBM 1997  –  2003  (6 years) . Supply Chain Management - Canada Order Fulfillment and Supply Planner IBM 1995  –  1997  (2 years) . Supply Chain Management - Canada Order Fulfillment and Supply Planner IBM 1995  –  1997  (2 years) . Demand and Inventory Planner IBM 1995  –  1995  (less than a year) - Demand planner for IBM Canada's AS400 and RS6000 (Power) server division.  \n- Inventory planner for IBM Canada to IBM Corporation. Demand and Inventory Planner IBM 1995  –  1995  (less than a year) - Demand planner for IBM Canada's AS400 and RS6000 (Power) server division.  \n- Inventory planner for IBM Canada to IBM Corporation. Languages English English English Skills Supply Chain Operations Team Building Supply Chain... Sales Operations Leadership Program Management Business Analysis Change Management Outsourcing Management Creative Problem Solving Negotiation Vendor Relationships Communication Skills Logistics Fullfillment Demand Forecasting Project Management Strategic Planning Business Transformation Business Strategy Time Management Product Management Accountability Order Management Order Fulfillment Forecasting Supply Chain Management Inventory Management Global Operations Customer Oriented Customer Support Building Relationships Problem Solving Cloud Computing Process Improvement Enterprise Software Solution Selling See 23+     See less Skills  Supply Chain Operations Team Building Supply Chain... Sales Operations Leadership Program Management Business Analysis Change Management Outsourcing Management Creative Problem Solving Negotiation Vendor Relationships Communication Skills Logistics Fullfillment Demand Forecasting Project Management Strategic Planning Business Transformation Business Strategy Time Management Product Management Accountability Order Management Order Fulfillment Forecasting Supply Chain Management Inventory Management Global Operations Customer Oriented Customer Support Building Relationships Problem Solving Cloud Computing Process Improvement Enterprise Software Solution Selling See 23+     See less Supply Chain Operations Team Building Supply Chain... Sales Operations Leadership Program Management Business Analysis Change Management Outsourcing Management Creative Problem Solving Negotiation Vendor Relationships Communication Skills Logistics Fullfillment Demand Forecasting Project Management Strategic Planning Business Transformation Business Strategy Time Management Product Management Accountability Order Management Order Fulfillment Forecasting Supply Chain Management Inventory Management Global Operations Customer Oriented Customer Support Building Relationships Problem Solving Cloud Computing Process Improvement Enterprise Software Solution Selling See 23+     See less Supply Chain Operations Team Building Supply Chain... Sales Operations Leadership Program Management Business Analysis Change Management Outsourcing Management Creative Problem Solving Negotiation Vendor Relationships Communication Skills Logistics Fullfillment Demand Forecasting Project Management Strategic Planning Business Transformation Business Strategy Time Management Product Management Accountability Order Management Order Fulfillment Forecasting Supply Chain Management Inventory Management Global Operations Customer Oriented Customer Support Building Relationships Problem Solving Cloud Computing Process Improvement Enterprise Software Solution Selling See 23+     See less Education University of Toronto Activities and Societies:  . University of Toronto Activities and Societies:  . University of Toronto Activities and Societies:  . University of Toronto Activities and Societies:  . ", "Experience Docente Thamen September 2003  – Present (12 years) Mobiel / data Designer Telfort Bv 1999  –  2002  (3 years) Inventory Planner IBM Netherlands 1997  –  2000  (3 years) Docente Thamen September 2003  – Present (12 years) Docente Thamen September 2003  – Present (12 years) Mobiel / data Designer Telfort Bv 1999  –  2002  (3 years) Mobiel / data Designer Telfort Bv 1999  –  2002  (3 years) Inventory Planner IBM Netherlands 1997  –  2000  (3 years) Inventory Planner IBM Netherlands 1997  –  2000  (3 years) Skills Teaching Dutch Skills  Teaching Dutch Teaching Dutch Teaching Dutch Education Educatieve faculteit Amsterdam Tweedegraads Wiskunde 2004  – 2007 Hogeschool van Amsterdam Ing.,  Technische Bedrijfskunde en Logistiek 1992  – 1996 Educatieve faculteit Amsterdam Tweedegraads Wiskunde 2004  – 2007 Educatieve faculteit Amsterdam Tweedegraads Wiskunde 2004  – 2007 Educatieve faculteit Amsterdam Tweedegraads Wiskunde 2004  – 2007 Hogeschool van Amsterdam Ing.,  Technische Bedrijfskunde en Logistiek 1992  – 1996 Hogeschool van Amsterdam Ing.,  Technische Bedrijfskunde en Logistiek 1992  – 1996 Hogeschool van Amsterdam Ing.,  Technische Bedrijfskunde en Logistiek 1992  – 1996 "]}