{"position": "IT Solutions Architect", "company": "IBM", "profiles": ["Experience IT Solutions Architect IBM November 1999  – Present (15 years 10 months) Defining Architectures involves defining the structures of solutions and architectures to address client business problems. It requires understanding client needs, working in levels of abstraction, applying industry knowledge and leveraging appropriate business elements and information technology to address those needs. The process of defining architectures includes discovering and analyzing requirements, then identifying, assessing and presenting solution alternatives in the context of those requirements. It is a critical part of the client's expe-rience at the proposal, solution creation, design and implementation stages of the client experience chain. System Programmer Novant Health - Presbyterian Healthcare December 1989  –  November 1999  (10 years) Charlotte, North Carolina Area IBM z/OS System Programmer IT Solutions Architect IBM November 1999  – Present (15 years 10 months) Defining Architectures involves defining the structures of solutions and architectures to address client business problems. It requires understanding client needs, working in levels of abstraction, applying industry knowledge and leveraging appropriate business elements and information technology to address those needs. The process of defining architectures includes discovering and analyzing requirements, then identifying, assessing and presenting solution alternatives in the context of those requirements. It is a critical part of the client's expe-rience at the proposal, solution creation, design and implementation stages of the client experience chain. IT Solutions Architect IBM November 1999  – Present (15 years 10 months) Defining Architectures involves defining the structures of solutions and architectures to address client business problems. It requires understanding client needs, working in levels of abstraction, applying industry knowledge and leveraging appropriate business elements and information technology to address those needs. The process of defining architectures includes discovering and analyzing requirements, then identifying, assessing and presenting solution alternatives in the context of those requirements. It is a critical part of the client's expe-rience at the proposal, solution creation, design and implementation stages of the client experience chain. System Programmer Novant Health - Presbyterian Healthcare December 1989  –  November 1999  (10 years) Charlotte, North Carolina Area IBM z/OS System Programmer System Programmer Novant Health - Presbyterian Healthcare December 1989  –  November 1999  (10 years) Charlotte, North Carolina Area IBM z/OS System Programmer Skills WebSphere MQ WebSphere Message Broker WebSphere Integration... Solution Architecture Cloud Computing Skills  WebSphere MQ WebSphere Message Broker WebSphere Integration... Solution Architecture Cloud Computing WebSphere MQ WebSphere Message Broker WebSphere Integration... Solution Architecture Cloud Computing WebSphere MQ WebSphere Message Broker WebSphere Integration... Solution Architecture Cloud Computing Education Appalachian State University Bachelor of Science (B.S.),  Computer Science Appalachian State University Bachelor of Science (B.S.),  Computer Science Appalachian State University Bachelor of Science (B.S.),  Computer Science Appalachian State University Bachelor of Science (B.S.),  Computer Science ", "Skills Architects Agile Methodologies Developers .NET Software Development Integration Solaris C# Web Applications Agile Project Management Infrastructure Business Intelligence Information Technology Software Project... Requirements Gathering Skills  Architects Agile Methodologies Developers .NET Software Development Integration Solaris C# Web Applications Agile Project Management Infrastructure Business Intelligence Information Technology Software Project... Requirements Gathering Architects Agile Methodologies Developers .NET Software Development Integration Solaris C# Web Applications Agile Project Management Infrastructure Business Intelligence Information Technology Software Project... Requirements Gathering Architects Agile Methodologies Developers .NET Software Development Integration Solaris C# Web Applications Agile Project Management Infrastructure Business Intelligence Information Technology Software Project... Requirements Gathering ", "Experience Sr. Information Assurance - Application Security Engineer SPAWAR Systems Center Atlantic March 2011  – Present (4 years 6 months) SPAWAR Systems Center Atlantic Senior IT Solutions Architect IBM Global Business Process Services 2009  –  April 2011  (2 years) Colorado Senior IT Solutions Architect EDS Group March 2010  –  March 2011  (1 year 1 month) Colorado Sr. Information Assurance - Application Security Engineer SPAWAR Systems Center Atlantic March 2011  – Present (4 years 6 months) SPAWAR Systems Center Atlantic Sr. Information Assurance - Application Security Engineer SPAWAR Systems Center Atlantic March 2011  – Present (4 years 6 months) SPAWAR Systems Center Atlantic Senior IT Solutions Architect IBM Global Business Process Services 2009  –  April 2011  (2 years) Colorado Senior IT Solutions Architect IBM Global Business Process Services 2009  –  April 2011  (2 years) Colorado Senior IT Solutions Architect EDS Group March 2010  –  March 2011  (1 year 1 month) Colorado Senior IT Solutions Architect EDS Group March 2010  –  March 2011  (1 year 1 month) Colorado ", "Summary I am an allround specialist in java and JEE technology. Object orientation has been my bread and butter since the very start of my career in 1994. Although I did not follow every possible side project in open source, I managed to stay well within the mainstream of technology including SOA, ESB and BPM related topics. Specialties:WebSphere Application Server \nWebSphere Enterprise Service Bus \nWebSphere Process Server \nWebSphere Service Registry and Repository Summary I am an allround specialist in java and JEE technology. Object orientation has been my bread and butter since the very start of my career in 1994. Although I did not follow every possible side project in open source, I managed to stay well within the mainstream of technology including SOA, ESB and BPM related topics. Specialties:WebSphere Application Server \nWebSphere Enterprise Service Bus \nWebSphere Process Server \nWebSphere Service Registry and Repository I am an allround specialist in java and JEE technology. Object orientation has been my bread and butter since the very start of my career in 1994. Although I did not follow every possible side project in open source, I managed to stay well within the mainstream of technology including SOA, ESB and BPM related topics. Specialties:WebSphere Application Server \nWebSphere Enterprise Service Bus \nWebSphere Process Server \nWebSphere Service Registry and Repository I am an allround specialist in java and JEE technology. Object orientation has been my bread and butter since the very start of my career in 1994. Although I did not follow every possible side project in open source, I managed to stay well within the mainstream of technology including SOA, ESB and BPM related topics. Specialties:WebSphere Application Server \nWebSphere Enterprise Service Bus \nWebSphere Process Server \nWebSphere Service Registry and Repository Experience Software Client Architect IBM January 2014  – Present (1 year 8 months) Brussels Area, Belgium I support a large financial institution with guidance and supporting on architecturial, services and deployment projects. My main focus areas are integration, bigdata, analytics, marketing management, and security related projects. IT Solutions Architect IBM July 2013  –  April 2014  (10 months) Brussels Area, Belgium I support the belux customers with the Smarter Commerce initiatives. IT Architect Colruyt August 2012  –  June 2013  (11 months) As IT Architect I take care of the application architecture for projects with portal and commerce technology. Software Client Architect IBM January 2011  –  July 2012  (1 year 7 months) I supported KBC and ING as IT Architect on IBM software technologies, such as WebSphere connectivity and application services. WebSphere Client Technical Professional IBM January 2005  –  December 2010  (6 years) Since 3 years I am the teamlead for the WebSphere Technical sales community covering the BeLux region. SWG Services WebSphere Consultant IBM January 2002  –  December 2004  (3 years) During this period I combined two different functions, each for 50 percentage of my time. The WSBC framework is a business framework implemented with EJB technology. The mission consists of developing migration material (courses, \ndocumentation, and tools to automate migration). My role in this mission is focused on the course and documentation \ndevelopment. The tool used is the Integration Edition of WebSphere Studio Application Developer (WSIE). This work includes the development of an entire application based on the \nWSBC framework which is fully compliant with the J2EE standards. Business Partner Enablement consultant IBM December 1999  –  December 2001  (2 years 1 month) The San Francisco support and consultants team, became proficient in the application technology of WebSphere before the product actually became a big success on the market place. I was perfectly fitting the role of consultant in the new support team targeting to enable business partners with WebSphere. At first the focus lied on application server technology, but is very soon extended towards other products (for instance WebSphere Edge Server) and technologies (J2EE) as they emerged. In my role as consultant I traveled throughout EMEA with a focus on the emerging markets (Poland, Slovakia, Serbia, Croatia, Czech Republic, ....) I worked as architect, as analyst, as mentor and as instructor on several engagements. \nIn order to support the enablement mission the entire team developed a unique course for educational purposes. I developed several client architectures to illustrate the basic \nprinciples to our business partners. San Francisco Project Consultant IBM January 1998  –  December 1999  (2 years) Taking this job, I became full IBM employee. I worked as a level2 support person for the IBM San Francisco project. This was an EMEA level function for which frequent travel to the Rochester laboratories was required. The second year of this mission, I became team leader of the support team. I had to handle the work distribution, the reporting requirements, the external communications and audits. In this role I worked closely with the peer teams in the USA and in Asia. I became for instance experienced in organizing 24 hours-support cycles, in which urgent problems are dealt with around the clock by different teams in different time zones. Development Engineer SoftCycle - CGI Systems 1994  –  December 1997  (3 years) Haasrode - Zaventem My early days - I worked as smalltalk developer, and later on as Powerbuilder developer. Projects for the European Commission, French Assurance Company, IBM internal projects. Software Client Architect IBM January 2014  – Present (1 year 8 months) Brussels Area, Belgium I support a large financial institution with guidance and supporting on architecturial, services and deployment projects. My main focus areas are integration, bigdata, analytics, marketing management, and security related projects. Software Client Architect IBM January 2014  – Present (1 year 8 months) Brussels Area, Belgium I support a large financial institution with guidance and supporting on architecturial, services and deployment projects. My main focus areas are integration, bigdata, analytics, marketing management, and security related projects. IT Solutions Architect IBM July 2013  –  April 2014  (10 months) Brussels Area, Belgium I support the belux customers with the Smarter Commerce initiatives. IT Solutions Architect IBM July 2013  –  April 2014  (10 months) Brussels Area, Belgium I support the belux customers with the Smarter Commerce initiatives. IT Architect Colruyt August 2012  –  June 2013  (11 months) As IT Architect I take care of the application architecture for projects with portal and commerce technology. IT Architect Colruyt August 2012  –  June 2013  (11 months) As IT Architect I take care of the application architecture for projects with portal and commerce technology. Software Client Architect IBM January 2011  –  July 2012  (1 year 7 months) I supported KBC and ING as IT Architect on IBM software technologies, such as WebSphere connectivity and application services. Software Client Architect IBM January 2011  –  July 2012  (1 year 7 months) I supported KBC and ING as IT Architect on IBM software technologies, such as WebSphere connectivity and application services. WebSphere Client Technical Professional IBM January 2005  –  December 2010  (6 years) Since 3 years I am the teamlead for the WebSphere Technical sales community covering the BeLux region. WebSphere Client Technical Professional IBM January 2005  –  December 2010  (6 years) Since 3 years I am the teamlead for the WebSphere Technical sales community covering the BeLux region. SWG Services WebSphere Consultant IBM January 2002  –  December 2004  (3 years) During this period I combined two different functions, each for 50 percentage of my time. The WSBC framework is a business framework implemented with EJB technology. The mission consists of developing migration material (courses, \ndocumentation, and tools to automate migration). My role in this mission is focused on the course and documentation \ndevelopment. The tool used is the Integration Edition of WebSphere Studio Application Developer (WSIE). This work includes the development of an entire application based on the \nWSBC framework which is fully compliant with the J2EE standards. SWG Services WebSphere Consultant IBM January 2002  –  December 2004  (3 years) During this period I combined two different functions, each for 50 percentage of my time. The WSBC framework is a business framework implemented with EJB technology. The mission consists of developing migration material (courses, \ndocumentation, and tools to automate migration). My role in this mission is focused on the course and documentation \ndevelopment. The tool used is the Integration Edition of WebSphere Studio Application Developer (WSIE). This work includes the development of an entire application based on the \nWSBC framework which is fully compliant with the J2EE standards. Business Partner Enablement consultant IBM December 1999  –  December 2001  (2 years 1 month) The San Francisco support and consultants team, became proficient in the application technology of WebSphere before the product actually became a big success on the market place. I was perfectly fitting the role of consultant in the new support team targeting to enable business partners with WebSphere. At first the focus lied on application server technology, but is very soon extended towards other products (for instance WebSphere Edge Server) and technologies (J2EE) as they emerged. In my role as consultant I traveled throughout EMEA with a focus on the emerging markets (Poland, Slovakia, Serbia, Croatia, Czech Republic, ....) I worked as architect, as analyst, as mentor and as instructor on several engagements. \nIn order to support the enablement mission the entire team developed a unique course for educational purposes. I developed several client architectures to illustrate the basic \nprinciples to our business partners. Business Partner Enablement consultant IBM December 1999  –  December 2001  (2 years 1 month) The San Francisco support and consultants team, became proficient in the application technology of WebSphere before the product actually became a big success on the market place. I was perfectly fitting the role of consultant in the new support team targeting to enable business partners with WebSphere. At first the focus lied on application server technology, but is very soon extended towards other products (for instance WebSphere Edge Server) and technologies (J2EE) as they emerged. In my role as consultant I traveled throughout EMEA with a focus on the emerging markets (Poland, Slovakia, Serbia, Croatia, Czech Republic, ....) I worked as architect, as analyst, as mentor and as instructor on several engagements. \nIn order to support the enablement mission the entire team developed a unique course for educational purposes. I developed several client architectures to illustrate the basic \nprinciples to our business partners. San Francisco Project Consultant IBM January 1998  –  December 1999  (2 years) Taking this job, I became full IBM employee. I worked as a level2 support person for the IBM San Francisco project. This was an EMEA level function for which frequent travel to the Rochester laboratories was required. The second year of this mission, I became team leader of the support team. I had to handle the work distribution, the reporting requirements, the external communications and audits. In this role I worked closely with the peer teams in the USA and in Asia. I became for instance experienced in organizing 24 hours-support cycles, in which urgent problems are dealt with around the clock by different teams in different time zones. San Francisco Project Consultant IBM January 1998  –  December 1999  (2 years) Taking this job, I became full IBM employee. I worked as a level2 support person for the IBM San Francisco project. This was an EMEA level function for which frequent travel to the Rochester laboratories was required. The second year of this mission, I became team leader of the support team. I had to handle the work distribution, the reporting requirements, the external communications and audits. In this role I worked closely with the peer teams in the USA and in Asia. I became for instance experienced in organizing 24 hours-support cycles, in which urgent problems are dealt with around the clock by different teams in different time zones. Development Engineer SoftCycle - CGI Systems 1994  –  December 1997  (3 years) Haasrode - Zaventem My early days - I worked as smalltalk developer, and later on as Powerbuilder developer. Projects for the European Commission, French Assurance Company, IBM internal projects. Development Engineer SoftCycle - CGI Systems 1994  –  December 1997  (3 years) Haasrode - Zaventem My early days - I worked as smalltalk developer, and later on as Powerbuilder developer. Projects for the European Commission, French Assurance Company, IBM internal projects. Languages English Full professional proficiency French Full professional proficiency German Limited working proficiency Dutch Native or bilingual proficiency English Full professional proficiency French Full professional proficiency German Limited working proficiency Dutch Native or bilingual proficiency English Full professional proficiency French Full professional proficiency German Limited working proficiency Dutch Native or bilingual proficiency Full professional proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Skills WebSphere Process Server WebSphere Application... WebSphere ESB Websphere SOA WebSphere Portal ESB WebSphere Message Broker Enterprise Architecture EAI Middleware WebSphere Integration... Rational Software... Java Enterprise Edition Solution Architecture Architecture Integration See 2+     See less Skills  WebSphere Process Server WebSphere Application... WebSphere ESB Websphere SOA WebSphere Portal ESB WebSphere Message Broker Enterprise Architecture EAI Middleware WebSphere Integration... Rational Software... Java Enterprise Edition Solution Architecture Architecture Integration See 2+     See less WebSphere Process Server WebSphere Application... WebSphere ESB Websphere SOA WebSphere Portal ESB WebSphere Message Broker Enterprise Architecture EAI Middleware WebSphere Integration... Rational Software... Java Enterprise Edition Solution Architecture Architecture Integration See 2+     See less WebSphere Process Server WebSphere Application... WebSphere ESB Websphere SOA WebSphere Portal ESB WebSphere Message Broker Enterprise Architecture EAI Middleware WebSphere Integration... Rational Software... Java Enterprise Edition Solution Architecture Architecture Integration See 2+     See less Education Hogeschool-Universiteit Brussel Master,  Commercial Engineer 1989  – 1993 St Jan Berchmanscollege 1980  – 1987 Hogeschool-Universiteit Brussel Master,  Commercial Engineer 1989  – 1993 Hogeschool-Universiteit Brussel Master,  Commercial Engineer 1989  – 1993 Hogeschool-Universiteit Brussel Master,  Commercial Engineer 1989  – 1993 St Jan Berchmanscollege 1980  – 1987 St Jan Berchmanscollege 1980  – 1987 St Jan Berchmanscollege 1980  – 1987 ", "Summary If you have an interesting, difficult challenge, and know how to have fun facing it, you got my attention. If you also have a ping pong table, lets talk business. \n \nI'm a generalist, but what I've done most is customer facing technical roles, pre sale, ops, and lots of problem solving.  \n \nI also know a thing or two about Linux. And some coding. And a bit of HPC, Web and that DevOps stuff. Did I mention ping pong? Summary If you have an interesting, difficult challenge, and know how to have fun facing it, you got my attention. If you also have a ping pong table, lets talk business. \n \nI'm a generalist, but what I've done most is customer facing technical roles, pre sale, ops, and lots of problem solving.  \n \nI also know a thing or two about Linux. And some coding. And a bit of HPC, Web and that DevOps stuff. Did I mention ping pong? If you have an interesting, difficult challenge, and know how to have fun facing it, you got my attention. If you also have a ping pong table, lets talk business. \n \nI'm a generalist, but what I've done most is customer facing technical roles, pre sale, ops, and lots of problem solving.  \n \nI also know a thing or two about Linux. And some coding. And a bit of HPC, Web and that DevOps stuff. Did I mention ping pong? If you have an interesting, difficult challenge, and know how to have fun facing it, you got my attention. If you also have a ping pong table, lets talk business. \n \nI'm a generalist, but what I've done most is customer facing technical roles, pre sale, ops, and lots of problem solving.  \n \nI also know a thing or two about Linux. And some coding. And a bit of HPC, Web and that DevOps stuff. Did I mention ping pong? Experience DevOps Team Lead Outbrain November 2014  – Present (10 months) Leading the Ops Networking & Infrastructure team, we lay the foundations to scaling Outbrain to the next level. Build, deployment, provisioning, service discovery, config management and cross-DC connectivity (to name a few). We Keep the Business Running while paving the road to extreme automation. DevOps Engineer Outbrain November 2013  –  November 2014  (1 year 1 month) HPC & Cloud Solutions Architect IBM January 2012  –  November 2013  (1 year 11 months) Pre-sale Engineer IBM February 2008  –  January 2012  (4 years) IT Solutions Architect IBM July 2006  –  February 2008  (1 year 8 months) System Engineer Intel Corporation December 2003  –  July 2006  (2 years 8 months) System Administrator ACTCOM June 2001  –  August 2002  (1 year 3 months) Head of Technical Support ACTCOM July 2000  –  June 2001  (1 year) DevOps Team Lead Outbrain November 2014  – Present (10 months) Leading the Ops Networking & Infrastructure team, we lay the foundations to scaling Outbrain to the next level. Build, deployment, provisioning, service discovery, config management and cross-DC connectivity (to name a few). We Keep the Business Running while paving the road to extreme automation. DevOps Team Lead Outbrain November 2014  – Present (10 months) Leading the Ops Networking & Infrastructure team, we lay the foundations to scaling Outbrain to the next level. Build, deployment, provisioning, service discovery, config management and cross-DC connectivity (to name a few). We Keep the Business Running while paving the road to extreme automation. DevOps Engineer Outbrain November 2013  –  November 2014  (1 year 1 month) DevOps Engineer Outbrain November 2013  –  November 2014  (1 year 1 month) HPC & Cloud Solutions Architect IBM January 2012  –  November 2013  (1 year 11 months) HPC & Cloud Solutions Architect IBM January 2012  –  November 2013  (1 year 11 months) Pre-sale Engineer IBM February 2008  –  January 2012  (4 years) Pre-sale Engineer IBM February 2008  –  January 2012  (4 years) IT Solutions Architect IBM July 2006  –  February 2008  (1 year 8 months) IT Solutions Architect IBM July 2006  –  February 2008  (1 year 8 months) System Engineer Intel Corporation December 2003  –  July 2006  (2 years 8 months) System Engineer Intel Corporation December 2003  –  July 2006  (2 years 8 months) System Administrator ACTCOM June 2001  –  August 2002  (1 year 3 months) System Administrator ACTCOM June 2001  –  August 2002  (1 year 3 months) Head of Technical Support ACTCOM July 2000  –  June 2001  (1 year) Head of Technical Support ACTCOM July 2000  –  June 2001  (1 year) Languages   Skills Cloud Computing Linux Virtualization Pre-sales Enterprise Software High Availability System Architecture Integration Solution Architecture Cluster Open Source Shell Scripting Storage Bash Distributed Systems Operating Systems Data Center Enterprise Architecture TCP/IP High Performance... Hardware Storage Virtualization VMware Infrastructure Servers System Deployment Sales Presentations Grid Computing Scripting Performance Tuning Mustachifier Hadoop Chef Configuration Management Ruby Docker Service Discovery See 22+     See less Skills  Cloud Computing Linux Virtualization Pre-sales Enterprise Software High Availability System Architecture Integration Solution Architecture Cluster Open Source Shell Scripting Storage Bash Distributed Systems Operating Systems Data Center Enterprise Architecture TCP/IP High Performance... Hardware Storage Virtualization VMware Infrastructure Servers System Deployment Sales Presentations Grid Computing Scripting Performance Tuning Mustachifier Hadoop Chef Configuration Management Ruby Docker Service Discovery See 22+     See less Cloud Computing Linux Virtualization Pre-sales Enterprise Software High Availability System Architecture Integration Solution Architecture Cluster Open Source Shell Scripting Storage Bash Distributed Systems Operating Systems Data Center Enterprise Architecture TCP/IP High Performance... Hardware Storage Virtualization VMware Infrastructure Servers System Deployment Sales Presentations Grid Computing Scripting Performance Tuning Mustachifier Hadoop Chef Configuration Management Ruby Docker Service Discovery See 22+     See less Cloud Computing Linux Virtualization Pre-sales Enterprise Software High Availability System Architecture Integration Solution Architecture Cluster Open Source Shell Scripting Storage Bash Distributed Systems Operating Systems Data Center Enterprise Architecture TCP/IP High Performance... Hardware Storage Virtualization VMware Infrastructure Servers System Deployment Sales Presentations Grid Computing Scripting Performance Tuning Mustachifier Hadoop Chef Configuration Management Ruby Docker Service Discovery See 22+     See less ", "Summary Experienced IT Architect with proven ability to develop and manage solutions across multiple industries. Adept at quickly and successfully becoming proficient in industry fundamentals. Strong technical leadership skills focused on developing appropriate solutions with the ability to effectively communicate with both business and technical stakeholders. \n \nSpecialties: \nTechnical Leadership; Creation of Solutions, Application, Integration and Infrastructure Architectures; Application Design; Enterprise-wide System Integration; SOA; Project and Team Leadership Summary Experienced IT Architect with proven ability to develop and manage solutions across multiple industries. Adept at quickly and successfully becoming proficient in industry fundamentals. Strong technical leadership skills focused on developing appropriate solutions with the ability to effectively communicate with both business and technical stakeholders. \n \nSpecialties: \nTechnical Leadership; Creation of Solutions, Application, Integration and Infrastructure Architectures; Application Design; Enterprise-wide System Integration; SOA; Project and Team Leadership Experienced IT Architect with proven ability to develop and manage solutions across multiple industries. Adept at quickly and successfully becoming proficient in industry fundamentals. Strong technical leadership skills focused on developing appropriate solutions with the ability to effectively communicate with both business and technical stakeholders. \n \nSpecialties: \nTechnical Leadership; Creation of Solutions, Application, Integration and Infrastructure Architectures; Application Design; Enterprise-wide System Integration; SOA; Project and Team Leadership Experienced IT Architect with proven ability to develop and manage solutions across multiple industries. Adept at quickly and successfully becoming proficient in industry fundamentals. Strong technical leadership skills focused on developing appropriate solutions with the ability to effectively communicate with both business and technical stakeholders. \n \nSpecialties: \nTechnical Leadership; Creation of Solutions, Application, Integration and Infrastructure Architectures; Application Design; Enterprise-wide System Integration; SOA; Project and Team Leadership Skills Web Services SDLC Software Design Enterprise Architecture SOA OOAD J2EE Software Development Unix Application Architecture Agile XML EJB Spring Solution Architecture Java UML Java Enterprise Edition Agile Methodologies Design Patterns Integration Enterprise Software Requirements Analysis Websphere Weblogic EAI Architecture DB2 Hibernate Software Project... Oracle Tomcat Scrum Ant Requirements Gathering SOAP Web Applications Struts Spring Framework See 24+     See less Skills  Web Services SDLC Software Design Enterprise Architecture SOA OOAD J2EE Software Development Unix Application Architecture Agile XML EJB Spring Solution Architecture Java UML Java Enterprise Edition Agile Methodologies Design Patterns Integration Enterprise Software Requirements Analysis Websphere Weblogic EAI Architecture DB2 Hibernate Software Project... Oracle Tomcat Scrum Ant Requirements Gathering SOAP Web Applications Struts Spring Framework See 24+     See less Web Services SDLC Software Design Enterprise Architecture SOA OOAD J2EE Software Development Unix Application Architecture Agile XML EJB Spring Solution Architecture Java UML Java Enterprise Edition Agile Methodologies Design Patterns Integration Enterprise Software Requirements Analysis Websphere Weblogic EAI Architecture DB2 Hibernate Software Project... Oracle Tomcat Scrum Ant Requirements Gathering SOAP Web Applications Struts Spring Framework See 24+     See less Web Services SDLC Software Design Enterprise Architecture SOA OOAD J2EE Software Development Unix Application Architecture Agile XML EJB Spring Solution Architecture Java UML Java Enterprise Edition Agile Methodologies Design Patterns Integration Enterprise Software Requirements Analysis Websphere Weblogic EAI Architecture DB2 Hibernate Software Project... Oracle Tomcat Scrum Ant Requirements Gathering SOAP Web Applications Struts Spring Framework See 24+     See less ", "Languages English Spanish English Spanish English Spanish Skills Architecture ITIL Storage Security Servers Data Center Cisco Telecommunications Cloud Computing IT Outsourcing Enterprise Architecture Pre-sales Solution Architecture IT Service Management Virtualization VMware Service Delivery Enterprise Software Microsoft Technologies Unix Cisco Technologies Integration Infrastructure Architectures IT Strategy AIX Server Architecture IT Operations Business Intelligence SAN Firewalls Operating Systems Managed Services Outsourcing Windows Server PMP Incident Management High Availability Solution Selling Linux Solaris Hardware IT Management Storage Area Networks Disaster Recovery Network Security SaaS Cluster Service Management TCP/IP See 35+     See less Skills  Architecture ITIL Storage Security Servers Data Center Cisco Telecommunications Cloud Computing IT Outsourcing Enterprise Architecture Pre-sales Solution Architecture IT Service Management Virtualization VMware Service Delivery Enterprise Software Microsoft Technologies Unix Cisco Technologies Integration Infrastructure Architectures IT Strategy AIX Server Architecture IT Operations Business Intelligence SAN Firewalls Operating Systems Managed Services Outsourcing Windows Server PMP Incident Management High Availability Solution Selling Linux Solaris Hardware IT Management Storage Area Networks Disaster Recovery Network Security SaaS Cluster Service Management TCP/IP See 35+     See less Architecture ITIL Storage Security Servers Data Center Cisco Telecommunications Cloud Computing IT Outsourcing Enterprise Architecture Pre-sales Solution Architecture IT Service Management Virtualization VMware Service Delivery Enterprise Software Microsoft Technologies Unix Cisco Technologies Integration Infrastructure Architectures IT Strategy AIX Server Architecture IT Operations Business Intelligence SAN Firewalls Operating Systems Managed Services Outsourcing Windows Server PMP Incident Management High Availability Solution Selling Linux Solaris Hardware IT Management Storage Area Networks Disaster Recovery Network Security SaaS Cluster Service Management TCP/IP See 35+     See less Architecture ITIL Storage Security Servers Data Center Cisco Telecommunications Cloud Computing IT Outsourcing Enterprise Architecture Pre-sales Solution Architecture IT Service Management Virtualization VMware Service Delivery Enterprise Software Microsoft Technologies Unix Cisco Technologies Integration Infrastructure Architectures IT Strategy AIX Server Architecture IT Operations Business Intelligence SAN Firewalls Operating Systems Managed Services Outsourcing Windows Server PMP Incident Management High Availability Solution Selling Linux Solaris Hardware IT Management Storage Area Networks Disaster Recovery Network Security SaaS Cluster Service Management TCP/IP See 35+     See less ", "Languages German (mother tongue) Native or bilingual proficiency English Full professional proficiency French Professional working proficiency German (mother tongue) Native or bilingual proficiency English Full professional proficiency French Professional working proficiency German (mother tongue) Native or bilingual proficiency English Full professional proficiency French Professional working proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Skills Disaster Recovery Software Development SAP Business Objects IBM iSeries SDLC High Availability Replication OS/400 Integration IT Strategy DB2 IT Management AIX IT Service Management Solution Architecture Pre-sales Enterprise Software Enterprise Architecture Business Intelligence ITIL Data Center Business Continuity Storage Servers SAN Virtualization IT Operations Storage Virtualization Storage Area Networks Cloud Computing Storage Solutions Server Architecture IBM Servers Presales See 20+     See less Skills  Disaster Recovery Software Development SAP Business Objects IBM iSeries SDLC High Availability Replication OS/400 Integration IT Strategy DB2 IT Management AIX IT Service Management Solution Architecture Pre-sales Enterprise Software Enterprise Architecture Business Intelligence ITIL Data Center Business Continuity Storage Servers SAN Virtualization IT Operations Storage Virtualization Storage Area Networks Cloud Computing Storage Solutions Server Architecture IBM Servers Presales See 20+     See less Disaster Recovery Software Development SAP Business Objects IBM iSeries SDLC High Availability Replication OS/400 Integration IT Strategy DB2 IT Management AIX IT Service Management Solution Architecture Pre-sales Enterprise Software Enterprise Architecture Business Intelligence ITIL Data Center Business Continuity Storage Servers SAN Virtualization IT Operations Storage Virtualization Storage Area Networks Cloud Computing Storage Solutions Server Architecture IBM Servers Presales See 20+     See less Disaster Recovery Software Development SAP Business Objects IBM iSeries SDLC High Availability Replication OS/400 Integration IT Strategy DB2 IT Management AIX IT Service Management Solution Architecture Pre-sales Enterprise Software Enterprise Architecture Business Intelligence ITIL Data Center Business Continuity Storage Servers SAN Virtualization IT Operations Storage Virtualization Storage Area Networks Cloud Computing Storage Solutions Server Architecture IBM Servers Presales See 20+     See less ", "Summary A committed technology professional possessing the following skill set: \n• Fluent in English, Japanese and Chinese • 9+ years of technology consultant experience \n• Strong team leadership and project management • Strong skills to create customer relationships \n• Strong communication skills (verbal and written) • Strong analytical and problem solving skills \n• Excellent time management and multitask skills • Outstanding presentation skills \n• Quantitative and qualitative research skills \n \n＊9+ years experience as a technology consultant/business analyst/project lead working with multinational global corporations \n＊Effectively collaborate with customers, partners, sales representatives, technical consultants, and was the bridge between clients and software developers from diverse countries and cultures \n＊Fluent in Chinese, Japanese and English and have developed considerable skills in \ninterpretation, presentation and communication across several cultural backgrounds \n＊Excellent customer service and problem-solving skills and was recognized as the winner of \nHewlett-Packard Asia-Pacific/Japan's Pre-sales Most Valuable Player (MVP) Award \n＊Master of Management Science (MMSc) in Management of Technology and Innovation (thesis-based MBA) and received excellent grades in every courses, which included management, accounting, finance, operations, marketing, and leadership and have published a paper presented at an information technology conference. Summary A committed technology professional possessing the following skill set: \n• Fluent in English, Japanese and Chinese • 9+ years of technology consultant experience \n• Strong team leadership and project management • Strong skills to create customer relationships \n• Strong communication skills (verbal and written) • Strong analytical and problem solving skills \n• Excellent time management and multitask skills • Outstanding presentation skills \n• Quantitative and qualitative research skills \n \n＊9+ years experience as a technology consultant/business analyst/project lead working with multinational global corporations \n＊Effectively collaborate with customers, partners, sales representatives, technical consultants, and was the bridge between clients and software developers from diverse countries and cultures \n＊Fluent in Chinese, Japanese and English and have developed considerable skills in \ninterpretation, presentation and communication across several cultural backgrounds \n＊Excellent customer service and problem-solving skills and was recognized as the winner of \nHewlett-Packard Asia-Pacific/Japan's Pre-sales Most Valuable Player (MVP) Award \n＊Master of Management Science (MMSc) in Management of Technology and Innovation (thesis-based MBA) and received excellent grades in every courses, which included management, accounting, finance, operations, marketing, and leadership and have published a paper presented at an information technology conference. A committed technology professional possessing the following skill set: \n• Fluent in English, Japanese and Chinese • 9+ years of technology consultant experience \n• Strong team leadership and project management • Strong skills to create customer relationships \n• Strong communication skills (verbal and written) • Strong analytical and problem solving skills \n• Excellent time management and multitask skills • Outstanding presentation skills \n• Quantitative and qualitative research skills \n \n＊9+ years experience as a technology consultant/business analyst/project lead working with multinational global corporations \n＊Effectively collaborate with customers, partners, sales representatives, technical consultants, and was the bridge between clients and software developers from diverse countries and cultures \n＊Fluent in Chinese, Japanese and English and have developed considerable skills in \ninterpretation, presentation and communication across several cultural backgrounds \n＊Excellent customer service and problem-solving skills and was recognized as the winner of \nHewlett-Packard Asia-Pacific/Japan's Pre-sales Most Valuable Player (MVP) Award \n＊Master of Management Science (MMSc) in Management of Technology and Innovation (thesis-based MBA) and received excellent grades in every courses, which included management, accounting, finance, operations, marketing, and leadership and have published a paper presented at an information technology conference. A committed technology professional possessing the following skill set: \n• Fluent in English, Japanese and Chinese • 9+ years of technology consultant experience \n• Strong team leadership and project management • Strong skills to create customer relationships \n• Strong communication skills (verbal and written) • Strong analytical and problem solving skills \n• Excellent time management and multitask skills • Outstanding presentation skills \n• Quantitative and qualitative research skills \n \n＊9+ years experience as a technology consultant/business analyst/project lead working with multinational global corporations \n＊Effectively collaborate with customers, partners, sales representatives, technical consultants, and was the bridge between clients and software developers from diverse countries and cultures \n＊Fluent in Chinese, Japanese and English and have developed considerable skills in \ninterpretation, presentation and communication across several cultural backgrounds \n＊Excellent customer service and problem-solving skills and was recognized as the winner of \nHewlett-Packard Asia-Pacific/Japan's Pre-sales Most Valuable Player (MVP) Award \n＊Master of Management Science (MMSc) in Management of Technology and Innovation (thesis-based MBA) and received excellent grades in every courses, which included management, accounting, finance, operations, marketing, and leadership and have published a paper presented at an information technology conference. Experience IT Solutions Architect IBM January 2014  – Present (1 year 8 months) Toronto, Canada Area • Gather the technical business requirements from the customer (Banking, Government, Commercial, Manufacture, Healthcare and IT industries) and translate customer business needs into technical, integration and process driven solutions  \n• Assist in the development and sales of IBM technical service solutions to customers and supports the sales team in closing business through using a combination of IBM and non-IBM offerings, services, labour, assets, hardware (System x, System z, Tivoli, Power system, IBM PureFlex system), and software to meet client business requirements.  \n• Orchestrate the development of complex, multi-year, solutions and associated cost cases for Integrated Technology services such as Co-location, Cloud, Softlayer and Managed Services. \n• Anticipate, develop and define innovative services solutions which match the customer's and IBM's tactical and strategic requirements and deal with multiple vendors to optimize solutions \n• Proficient in SDM costing tool and IT Architecture - Server Management (processes, costs and technologies) with deep understanding of Team Solution Design methodology and SDCoE process  \n• Engage sales, technical engineers, delivery engineers into the process and arrange meetings to finalize the solutions for customers \n•Create the training plan and training documentation for the new team members \n•Present the solution to the customers Graduate Research and Teaching Assistant Ryerson University December 2012  –  September 2013  (10 months) Canada Master of Management Science in Management of Technology and Innovation (a thesis-based \nMBA) \nSpecialization: IT Planning and Evaluation, Business Strategy, Project Management, Change Management, Business Case, IT Decision-Making, Supply Chain Management \nThesis title: Principles for Creating and Evaluating Business Cases for Complex IT Investments \n• Graduate Teaching Assistant of Capstone Information Technology Management project \n• Research paper was accepted and presented at an affiliated Conference of the Association of  \nInformation System on Information Resource Management and a second research paper is being prepared for publication \n• Conducted field research by using mixed methods including qualitative (interview) and quantitative (Q-methodology) data collection, analysis and report; independently interviewed CEOs, CFOs, CIOs and senior IT project managers to gain insights in IT decision-making and the creation and evaluation of business cases; able to research and compile data from a variety of sources with solid knowledge in SPSS and NVivo data analysis software Technology consultant as Pre-sales Hewlett-Packard February 2008  –  August 2012  (4 years 7 months) China, U.S., Japan • Chosen as the ambassador in Asia-Pacific/Japan for HP server (e.g., Blade, ProLiant) and management software products and helped sales to achieve the selling goals and kept the deadlines \n• Specialized in core technology service of servers (e.g., ProLiant, Blade), connecting solutions for storage servers (e.g., tape, MSA, EVA) and networking switches (e.g., Cisco, Brocade, ProCurve), usage of various operation systems (Windows/Linux/VMware) and management software, sizing of ERP database (Oracle/SAP)  \n• Identified opportunities for integration of management software products and developed business re-engineering strategy, forecasted technology impacts on business process and analyzed customer centered design criteria; provided trilingual customer service for both domestic and overseas customers within stated service level agreements (SLA's) \n• Managed a cross-functional team by conducting weekly seminars and creating execution schedules to implement scalable business solutions; trained new employees, organized internal technical learning courses, and shared advanced technical knowledge; solved and supervised the accuracy and quality of technical proposals, and managed team workflow and progress; managed relevant knowledge base for sharing and searching technical knowledge \n• Participated in domestic and overseas technology exchange seminars; conducted market intelligence research, technology penetration and capability benchmarking analysis, resulting in continuous strategic reviews that ensured competitive advantage Business Analyst/Technical Consultant, Project Management Panasonic July 2003  –  December 2007  (4 years 6 months) China and Japan • Held the position of technology consultant in accordance with company’s needs and various main projects (over 5M) including Oracle ERP systems implementations, whole information system architecture design, and hardware and software integrations; identified and resolved critical and complex client industry-related issues across projects \n• Was the bridge between clients and software developers; gathered the requirements from clients and completed documents including Business Use Case, Business Requirements Document (BRD), System Requirements Specification (SRS) and user manuals; involved in project (including offshore outsourcing) planning, implementation, UAT and Go-live support; collaborated with all levels within the organization, from top executives to senior level managers to front-line employees \n• Collaborated with an Enterprise Systems Architecture team of engineers to design optimal systems by streamlining project change control processes for clients’ IT divisions; fostered strong client relationships of domestic and overseas customers by managing various aspects of ERP projects from pre-sales to development and completion stages, resulting in long-term client commitment \n• Strong knowledge of computer applications (e.g., Microsoft Excel, Word, Access, PowerPoint, Visio) sufficient to create graphs/charts/reports; planned and organized multiple annual technology conferences including over 50 subsidiary corporations; translated all the relevant document \n \nCompleted IT projects: \n♦ 2007/9 – 2007/12 CS structure database in Japan \n♦ 2007/07 – 2007/08 Inventory Management System and SCM System in Japan \n♦ 2007/05 – 2007/06 Network optimization/Server integration lead-in project \n♦ 2006/10 – 2007/04 Oracle ERP implementation in commercial company \n♦ 2005/06 – 2006/09 Oracle ERP implementation in manufacture factory \n♦ 2005/04 –2005/05 Internal office platform systems  \n♦ 2004/04–2005/03 E-mail and internal office OA systems \n♦ 2003/12 –2004/03 Inventory Management System IT Solutions Architect IBM January 2014  – Present (1 year 8 months) Toronto, Canada Area • Gather the technical business requirements from the customer (Banking, Government, Commercial, Manufacture, Healthcare and IT industries) and translate customer business needs into technical, integration and process driven solutions  \n• Assist in the development and sales of IBM technical service solutions to customers and supports the sales team in closing business through using a combination of IBM and non-IBM offerings, services, labour, assets, hardware (System x, System z, Tivoli, Power system, IBM PureFlex system), and software to meet client business requirements.  \n• Orchestrate the development of complex, multi-year, solutions and associated cost cases for Integrated Technology services such as Co-location, Cloud, Softlayer and Managed Services. \n• Anticipate, develop and define innovative services solutions which match the customer's and IBM's tactical and strategic requirements and deal with multiple vendors to optimize solutions \n• Proficient in SDM costing tool and IT Architecture - Server Management (processes, costs and technologies) with deep understanding of Team Solution Design methodology and SDCoE process  \n• Engage sales, technical engineers, delivery engineers into the process and arrange meetings to finalize the solutions for customers \n•Create the training plan and training documentation for the new team members \n•Present the solution to the customers IT Solutions Architect IBM January 2014  – Present (1 year 8 months) Toronto, Canada Area • Gather the technical business requirements from the customer (Banking, Government, Commercial, Manufacture, Healthcare and IT industries) and translate customer business needs into technical, integration and process driven solutions  \n• Assist in the development and sales of IBM technical service solutions to customers and supports the sales team in closing business through using a combination of IBM and non-IBM offerings, services, labour, assets, hardware (System x, System z, Tivoli, Power system, IBM PureFlex system), and software to meet client business requirements.  \n• Orchestrate the development of complex, multi-year, solutions and associated cost cases for Integrated Technology services such as Co-location, Cloud, Softlayer and Managed Services. \n• Anticipate, develop and define innovative services solutions which match the customer's and IBM's tactical and strategic requirements and deal with multiple vendors to optimize solutions \n• Proficient in SDM costing tool and IT Architecture - Server Management (processes, costs and technologies) with deep understanding of Team Solution Design methodology and SDCoE process  \n• Engage sales, technical engineers, delivery engineers into the process and arrange meetings to finalize the solutions for customers \n•Create the training plan and training documentation for the new team members \n•Present the solution to the customers Graduate Research and Teaching Assistant Ryerson University December 2012  –  September 2013  (10 months) Canada Master of Management Science in Management of Technology and Innovation (a thesis-based \nMBA) \nSpecialization: IT Planning and Evaluation, Business Strategy, Project Management, Change Management, Business Case, IT Decision-Making, Supply Chain Management \nThesis title: Principles for Creating and Evaluating Business Cases for Complex IT Investments \n• Graduate Teaching Assistant of Capstone Information Technology Management project \n• Research paper was accepted and presented at an affiliated Conference of the Association of  \nInformation System on Information Resource Management and a second research paper is being prepared for publication \n• Conducted field research by using mixed methods including qualitative (interview) and quantitative (Q-methodology) data collection, analysis and report; independently interviewed CEOs, CFOs, CIOs and senior IT project managers to gain insights in IT decision-making and the creation and evaluation of business cases; able to research and compile data from a variety of sources with solid knowledge in SPSS and NVivo data analysis software Graduate Research and Teaching Assistant Ryerson University December 2012  –  September 2013  (10 months) Canada Master of Management Science in Management of Technology and Innovation (a thesis-based \nMBA) \nSpecialization: IT Planning and Evaluation, Business Strategy, Project Management, Change Management, Business Case, IT Decision-Making, Supply Chain Management \nThesis title: Principles for Creating and Evaluating Business Cases for Complex IT Investments \n• Graduate Teaching Assistant of Capstone Information Technology Management project \n• Research paper was accepted and presented at an affiliated Conference of the Association of  \nInformation System on Information Resource Management and a second research paper is being prepared for publication \n• Conducted field research by using mixed methods including qualitative (interview) and quantitative (Q-methodology) data collection, analysis and report; independently interviewed CEOs, CFOs, CIOs and senior IT project managers to gain insights in IT decision-making and the creation and evaluation of business cases; able to research and compile data from a variety of sources with solid knowledge in SPSS and NVivo data analysis software Technology consultant as Pre-sales Hewlett-Packard February 2008  –  August 2012  (4 years 7 months) China, U.S., Japan • Chosen as the ambassador in Asia-Pacific/Japan for HP server (e.g., Blade, ProLiant) and management software products and helped sales to achieve the selling goals and kept the deadlines \n• Specialized in core technology service of servers (e.g., ProLiant, Blade), connecting solutions for storage servers (e.g., tape, MSA, EVA) and networking switches (e.g., Cisco, Brocade, ProCurve), usage of various operation systems (Windows/Linux/VMware) and management software, sizing of ERP database (Oracle/SAP)  \n• Identified opportunities for integration of management software products and developed business re-engineering strategy, forecasted technology impacts on business process and analyzed customer centered design criteria; provided trilingual customer service for both domestic and overseas customers within stated service level agreements (SLA's) \n• Managed a cross-functional team by conducting weekly seminars and creating execution schedules to implement scalable business solutions; trained new employees, organized internal technical learning courses, and shared advanced technical knowledge; solved and supervised the accuracy and quality of technical proposals, and managed team workflow and progress; managed relevant knowledge base for sharing and searching technical knowledge \n• Participated in domestic and overseas technology exchange seminars; conducted market intelligence research, technology penetration and capability benchmarking analysis, resulting in continuous strategic reviews that ensured competitive advantage Technology consultant as Pre-sales Hewlett-Packard February 2008  –  August 2012  (4 years 7 months) China, U.S., Japan • Chosen as the ambassador in Asia-Pacific/Japan for HP server (e.g., Blade, ProLiant) and management software products and helped sales to achieve the selling goals and kept the deadlines \n• Specialized in core technology service of servers (e.g., ProLiant, Blade), connecting solutions for storage servers (e.g., tape, MSA, EVA) and networking switches (e.g., Cisco, Brocade, ProCurve), usage of various operation systems (Windows/Linux/VMware) and management software, sizing of ERP database (Oracle/SAP)  \n• Identified opportunities for integration of management software products and developed business re-engineering strategy, forecasted technology impacts on business process and analyzed customer centered design criteria; provided trilingual customer service for both domestic and overseas customers within stated service level agreements (SLA's) \n• Managed a cross-functional team by conducting weekly seminars and creating execution schedules to implement scalable business solutions; trained new employees, organized internal technical learning courses, and shared advanced technical knowledge; solved and supervised the accuracy and quality of technical proposals, and managed team workflow and progress; managed relevant knowledge base for sharing and searching technical knowledge \n• Participated in domestic and overseas technology exchange seminars; conducted market intelligence research, technology penetration and capability benchmarking analysis, resulting in continuous strategic reviews that ensured competitive advantage Business Analyst/Technical Consultant, Project Management Panasonic July 2003  –  December 2007  (4 years 6 months) China and Japan • Held the position of technology consultant in accordance with company’s needs and various main projects (over 5M) including Oracle ERP systems implementations, whole information system architecture design, and hardware and software integrations; identified and resolved critical and complex client industry-related issues across projects \n• Was the bridge between clients and software developers; gathered the requirements from clients and completed documents including Business Use Case, Business Requirements Document (BRD), System Requirements Specification (SRS) and user manuals; involved in project (including offshore outsourcing) planning, implementation, UAT and Go-live support; collaborated with all levels within the organization, from top executives to senior level managers to front-line employees \n• Collaborated with an Enterprise Systems Architecture team of engineers to design optimal systems by streamlining project change control processes for clients’ IT divisions; fostered strong client relationships of domestic and overseas customers by managing various aspects of ERP projects from pre-sales to development and completion stages, resulting in long-term client commitment \n• Strong knowledge of computer applications (e.g., Microsoft Excel, Word, Access, PowerPoint, Visio) sufficient to create graphs/charts/reports; planned and organized multiple annual technology conferences including over 50 subsidiary corporations; translated all the relevant document \n \nCompleted IT projects: \n♦ 2007/9 – 2007/12 CS structure database in Japan \n♦ 2007/07 – 2007/08 Inventory Management System and SCM System in Japan \n♦ 2007/05 – 2007/06 Network optimization/Server integration lead-in project \n♦ 2006/10 – 2007/04 Oracle ERP implementation in commercial company \n♦ 2005/06 – 2006/09 Oracle ERP implementation in manufacture factory \n♦ 2005/04 –2005/05 Internal office platform systems  \n♦ 2004/04–2005/03 E-mail and internal office OA systems \n♦ 2003/12 –2004/03 Inventory Management System Business Analyst/Technical Consultant, Project Management Panasonic July 2003  –  December 2007  (4 years 6 months) China and Japan • Held the position of technology consultant in accordance with company’s needs and various main projects (over 5M) including Oracle ERP systems implementations, whole information system architecture design, and hardware and software integrations; identified and resolved critical and complex client industry-related issues across projects \n• Was the bridge between clients and software developers; gathered the requirements from clients and completed documents including Business Use Case, Business Requirements Document (BRD), System Requirements Specification (SRS) and user manuals; involved in project (including offshore outsourcing) planning, implementation, UAT and Go-live support; collaborated with all levels within the organization, from top executives to senior level managers to front-line employees \n• Collaborated with an Enterprise Systems Architecture team of engineers to design optimal systems by streamlining project change control processes for clients’ IT divisions; fostered strong client relationships of domestic and overseas customers by managing various aspects of ERP projects from pre-sales to development and completion stages, resulting in long-term client commitment \n• Strong knowledge of computer applications (e.g., Microsoft Excel, Word, Access, PowerPoint, Visio) sufficient to create graphs/charts/reports; planned and organized multiple annual technology conferences including over 50 subsidiary corporations; translated all the relevant document \n \nCompleted IT projects: \n♦ 2007/9 – 2007/12 CS structure database in Japan \n♦ 2007/07 – 2007/08 Inventory Management System and SCM System in Japan \n♦ 2007/05 – 2007/06 Network optimization/Server integration lead-in project \n♦ 2006/10 – 2007/04 Oracle ERP implementation in commercial company \n♦ 2005/06 – 2006/09 Oracle ERP implementation in manufacture factory \n♦ 2005/04 –2005/05 Internal office platform systems  \n♦ 2004/04–2005/03 E-mail and internal office OA systems \n♦ 2003/12 –2004/03 Inventory Management System Languages English Full professional proficiency Chinese Native or bilingual proficiency Cantonese Elementary proficiency Japanese Native or bilingual proficiency Korean Elementary proficiency French English Full professional proficiency Chinese Native or bilingual proficiency Cantonese Elementary proficiency Japanese Native or bilingual proficiency Korean Elementary proficiency French English Full professional proficiency Chinese Native or bilingual proficiency Cantonese Elementary proficiency Japanese Native or bilingual proficiency Korean Elementary proficiency French Full professional proficiency Native or bilingual proficiency Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Business Analysis VMware Certified... VMware VTSP 4 vmware VSP 4 GMAT IELTS Servers Microsoft Operating... Cantonese Korean SAP ERP Oracle ERP... IT Business Strategy Japanese HP Proliant HP Blade HP Insight Manager HP Storage Project Management Strategic Planning Team Leadership Leadership Management Business Strategy Business Process... HP Procurve Networking HP Server Hardware Microsoft Office Change Management Business Case Business Process... Data Analysis Project Coordination Time Management Databases Analysis Pre-sales Cross-functional Team... Enterprise Architecture ERP Project Planning IT Management Business Intelligence CRM Strategy vSphere Business Process Networking Cloud Computing Consulting See 35+     See less Skills  Business Analysis VMware Certified... VMware VTSP 4 vmware VSP 4 GMAT IELTS Servers Microsoft Operating... Cantonese Korean SAP ERP Oracle ERP... IT Business Strategy Japanese HP Proliant HP Blade HP Insight Manager HP Storage Project Management Strategic Planning Team Leadership Leadership Management Business Strategy Business Process... HP Procurve Networking HP Server Hardware Microsoft Office Change Management Business Case Business Process... Data Analysis Project Coordination Time Management Databases Analysis Pre-sales Cross-functional Team... Enterprise Architecture ERP Project Planning IT Management Business Intelligence CRM Strategy vSphere Business Process Networking Cloud Computing Consulting See 35+     See less Business Analysis VMware Certified... VMware VTSP 4 vmware VSP 4 GMAT IELTS Servers Microsoft Operating... Cantonese Korean SAP ERP Oracle ERP... IT Business Strategy Japanese HP Proliant HP Blade HP Insight Manager HP Storage Project Management Strategic Planning Team Leadership Leadership Management Business Strategy Business Process... HP Procurve Networking HP Server Hardware Microsoft Office Change Management Business Case Business Process... Data Analysis Project Coordination Time Management Databases Analysis Pre-sales Cross-functional Team... Enterprise Architecture ERP Project Planning IT Management Business Intelligence CRM Strategy vSphere Business Process Networking Cloud Computing Consulting See 35+     See less Business Analysis VMware Certified... VMware VTSP 4 vmware VSP 4 GMAT IELTS Servers Microsoft Operating... Cantonese Korean SAP ERP Oracle ERP... IT Business Strategy Japanese HP Proliant HP Blade HP Insight Manager HP Storage Project Management Strategic Planning Team Leadership Leadership Management Business Strategy Business Process... HP Procurve Networking HP Server Hardware Microsoft Office Change Management Business Case Business Process... Data Analysis Project Coordination Time Management Databases Analysis Pre-sales Cross-functional Team... Enterprise Architecture ERP Project Planning IT Management Business Intelligence CRM Strategy vSphere Business Process Networking Cloud Computing Consulting See 35+     See less Education Ryerson University Master of Management Science (thesis based MBA),  Management of Technology and Innovation , CGPA: 4.03 2012  – 2013 Research paper was accepted and presented in an affiliated Conference of the Association of \nInformation System on Information Resource Management and a second research paper is \nbeing prepared for publication Activities and Societies:  Specialization: IT planning and evaluation ,  Business strategy ,  Project management\nThesis title: Principles for Creating and Evaluating Business Cases for Complex IT Investments\n• Research Assistant in the topic of complex IT investments decision-making and the creation\nand evaluation of business cases\n• Graduate Teaching Assistant in Capstone Information Technology Management project China Foreign Affairs University Bachelor of Arts (B.A.),  Japanese Specialty , A 1999  – 2003 ♦ 1999-2001 Excellent All-round Students \n♦ 2001-2002 Excellent All-round Students and Li Xuehai Scholarship \n♦ 2003 Outstanding Graduation Thesis Activities and Societies:  ♦ 2001-2002 As a leader of school Broadcasting Association and Mental Health Association ,  I organized and leaded our associations to exchange ideas with peer associations in Tsinghua University.\n♦ Be a volunteer of Universiade;\n♦ Participated in Chinese and Japanese Culture Exchange Program\n♦ Participated in annual party of Foreign Language Department of China Foreign Affairs University Ryerson University Master of Management Science (thesis based MBA),  Management of Technology and Innovation , CGPA: 4.03 2012  – 2013 Research paper was accepted and presented in an affiliated Conference of the Association of \nInformation System on Information Resource Management and a second research paper is \nbeing prepared for publication Activities and Societies:  Specialization: IT planning and evaluation ,  Business strategy ,  Project management\nThesis title: Principles for Creating and Evaluating Business Cases for Complex IT Investments\n• Research Assistant in the topic of complex IT investments decision-making and the creation\nand evaluation of business cases\n• Graduate Teaching Assistant in Capstone Information Technology Management project Ryerson University Master of Management Science (thesis based MBA),  Management of Technology and Innovation , CGPA: 4.03 2012  – 2013 Research paper was accepted and presented in an affiliated Conference of the Association of \nInformation System on Information Resource Management and a second research paper is \nbeing prepared for publication Activities and Societies:  Specialization: IT planning and evaluation ,  Business strategy ,  Project management\nThesis title: Principles for Creating and Evaluating Business Cases for Complex IT Investments\n• Research Assistant in the topic of complex IT investments decision-making and the creation\nand evaluation of business cases\n• Graduate Teaching Assistant in Capstone Information Technology Management project Ryerson University Master of Management Science (thesis based MBA),  Management of Technology and Innovation , CGPA: 4.03 2012  – 2013 Research paper was accepted and presented in an affiliated Conference of the Association of \nInformation System on Information Resource Management and a second research paper is \nbeing prepared for publication Activities and Societies:  Specialization: IT planning and evaluation ,  Business strategy ,  Project management\nThesis title: Principles for Creating and Evaluating Business Cases for Complex IT Investments\n• Research Assistant in the topic of complex IT investments decision-making and the creation\nand evaluation of business cases\n• Graduate Teaching Assistant in Capstone Information Technology Management project China Foreign Affairs University Bachelor of Arts (B.A.),  Japanese Specialty , A 1999  – 2003 ♦ 1999-2001 Excellent All-round Students \n♦ 2001-2002 Excellent All-round Students and Li Xuehai Scholarship \n♦ 2003 Outstanding Graduation Thesis Activities and Societies:  ♦ 2001-2002 As a leader of school Broadcasting Association and Mental Health Association ,  I organized and leaded our associations to exchange ideas with peer associations in Tsinghua University.\n♦ Be a volunteer of Universiade;\n♦ Participated in Chinese and Japanese Culture Exchange Program\n♦ Participated in annual party of Foreign Language Department of China Foreign Affairs University China Foreign Affairs University Bachelor of Arts (B.A.),  Japanese Specialty , A 1999  – 2003 ♦ 1999-2001 Excellent All-round Students \n♦ 2001-2002 Excellent All-round Students and Li Xuehai Scholarship \n♦ 2003 Outstanding Graduation Thesis Activities and Societies:  ♦ 2001-2002 As a leader of school Broadcasting Association and Mental Health Association ,  I organized and leaded our associations to exchange ideas with peer associations in Tsinghua University.\n♦ Be a volunteer of Universiade;\n♦ Participated in Chinese and Japanese Culture Exchange Program\n♦ Participated in annual party of Foreign Language Department of China Foreign Affairs University China Foreign Affairs University Bachelor of Arts (B.A.),  Japanese Specialty , A 1999  – 2003 ♦ 1999-2001 Excellent All-round Students \n♦ 2001-2002 Excellent All-round Students and Li Xuehai Scholarship \n♦ 2003 Outstanding Graduation Thesis Activities and Societies:  ♦ 2001-2002 As a leader of school Broadcasting Association and Mental Health Association ,  I organized and leaded our associations to exchange ideas with peer associations in Tsinghua University.\n♦ Be a volunteer of Universiade;\n♦ Participated in Chinese and Japanese Culture Exchange Program\n♦ Participated in annual party of Foreign Language Department of China Foreign Affairs University Honors & Awards HP APJ Pre-sales MVP (Most Valuable Player) Award Hewlett-Packard March 2012 This award is to prize the most valuable and work hard member in the company. On top of my regular workload, I took the inititiave to host regular knowledge sharing sessions for my peers so they can leverage each other’s effort to improve knowledge to the next level. I never shy of offering support to my fellow colleagues when they have problems answering difficult product request. I even helped my peers in overcoming language barrier and achieving ExpertOne certifications. My un-selfishness and tremendous effort contributed to the team made me one of the most valuable player in my team.  Excellent All-round Student China Foreign Affairs University June 2003 ♦ 1999-2001 Excellent All-round Student \n♦ 2001-2002 Excellent All-round Student and Li Xuehai Scholarship \n♦ 2003 Outstanding Graduation Thesis Manager’s Choice Award - 2015 for the practice Put the Client First IBM June 2015 The management team recognized my on-going contribution to the team, our results and putting the client first. \n HP APJ Pre-sales MVP (Most Valuable Player) Award Hewlett-Packard March 2012 This award is to prize the most valuable and work hard member in the company. On top of my regular workload, I took the inititiave to host regular knowledge sharing sessions for my peers so they can leverage each other’s effort to improve knowledge to the next level. I never shy of offering support to my fellow colleagues when they have problems answering difficult product request. I even helped my peers in overcoming language barrier and achieving ExpertOne certifications. My un-selfishness and tremendous effort contributed to the team made me one of the most valuable player in my team.  HP APJ Pre-sales MVP (Most Valuable Player) Award Hewlett-Packard March 2012 This award is to prize the most valuable and work hard member in the company. On top of my regular workload, I took the inititiave to host regular knowledge sharing sessions for my peers so they can leverage each other’s effort to improve knowledge to the next level. I never shy of offering support to my fellow colleagues when they have problems answering difficult product request. I even helped my peers in overcoming language barrier and achieving ExpertOne certifications. My un-selfishness and tremendous effort contributed to the team made me one of the most valuable player in my team.  HP APJ Pre-sales MVP (Most Valuable Player) Award Hewlett-Packard March 2012 This award is to prize the most valuable and work hard member in the company. On top of my regular workload, I took the inititiave to host regular knowledge sharing sessions for my peers so they can leverage each other’s effort to improve knowledge to the next level. I never shy of offering support to my fellow colleagues when they have problems answering difficult product request. I even helped my peers in overcoming language barrier and achieving ExpertOne certifications. My un-selfishness and tremendous effort contributed to the team made me one of the most valuable player in my team.  Excellent All-round Student China Foreign Affairs University June 2003 ♦ 1999-2001 Excellent All-round Student \n♦ 2001-2002 Excellent All-round Student and Li Xuehai Scholarship \n♦ 2003 Outstanding Graduation Thesis Excellent All-round Student China Foreign Affairs University June 2003 ♦ 1999-2001 Excellent All-round Student \n♦ 2001-2002 Excellent All-round Student and Li Xuehai Scholarship \n♦ 2003 Outstanding Graduation Thesis Excellent All-round Student China Foreign Affairs University June 2003 ♦ 1999-2001 Excellent All-round Student \n♦ 2001-2002 Excellent All-round Student and Li Xuehai Scholarship \n♦ 2003 Outstanding Graduation Thesis Manager’s Choice Award - 2015 for the practice Put the Client First IBM June 2015 The management team recognized my on-going contribution to the team, our results and putting the client first. \n Manager’s Choice Award - 2015 for the practice Put the Client First IBM June 2015 The management team recognized my on-going contribution to the team, our results and putting the client first. \n Manager’s Choice Award - 2015 for the practice Put the Client First IBM June 2015 The management team recognized my on-going contribution to the team, our results and putting the client first. \n ", "Summary BSc in Biology-Psychology \nIT Solutions Architect (IBM)  \nManaging Director, Organic Lifestyle \n \n6 reasons why we should connect: \n \n1. I have 15 years+ experience acting as the bridge between technology and demanding clients \n-- Digital Product Manager, ecommerce Consultant, Digital Marketing \n \n2. Extensive eCommerce B2B/B2C & Retail experience with Big 5 consulting firm in United States, New Zealand and Canada \n \n3. I practice ROI, growth & inbound marketing, google analytics, SEO/SEM, keyword research & persuasive design \n \n4. Self-starter / Hardworking Entrepreneur - ran my own physical retail store & staff \n \n5. Strong negotiator for diffusing tense situations \n \n6. Technologist with ability to de-scope to meet impossible deadlines \n \nBased in London, UK and have work visa. Summary BSc in Biology-Psychology \nIT Solutions Architect (IBM)  \nManaging Director, Organic Lifestyle \n \n6 reasons why we should connect: \n \n1. I have 15 years+ experience acting as the bridge between technology and demanding clients \n-- Digital Product Manager, ecommerce Consultant, Digital Marketing \n \n2. Extensive eCommerce B2B/B2C & Retail experience with Big 5 consulting firm in United States, New Zealand and Canada \n \n3. I practice ROI, growth & inbound marketing, google analytics, SEO/SEM, keyword research & persuasive design \n \n4. Self-starter / Hardworking Entrepreneur - ran my own physical retail store & staff \n \n5. Strong negotiator for diffusing tense situations \n \n6. Technologist with ability to de-scope to meet impossible deadlines \n \nBased in London, UK and have work visa. BSc in Biology-Psychology \nIT Solutions Architect (IBM)  \nManaging Director, Organic Lifestyle \n \n6 reasons why we should connect: \n \n1. I have 15 years+ experience acting as the bridge between technology and demanding clients \n-- Digital Product Manager, ecommerce Consultant, Digital Marketing \n \n2. Extensive eCommerce B2B/B2C & Retail experience with Big 5 consulting firm in United States, New Zealand and Canada \n \n3. I practice ROI, growth & inbound marketing, google analytics, SEO/SEM, keyword research & persuasive design \n \n4. Self-starter / Hardworking Entrepreneur - ran my own physical retail store & staff \n \n5. Strong negotiator for diffusing tense situations \n \n6. Technologist with ability to de-scope to meet impossible deadlines \n \nBased in London, UK and have work visa. BSc in Biology-Psychology \nIT Solutions Architect (IBM)  \nManaging Director, Organic Lifestyle \n \n6 reasons why we should connect: \n \n1. I have 15 years+ experience acting as the bridge between technology and demanding clients \n-- Digital Product Manager, ecommerce Consultant, Digital Marketing \n \n2. Extensive eCommerce B2B/B2C & Retail experience with Big 5 consulting firm in United States, New Zealand and Canada \n \n3. I practice ROI, growth & inbound marketing, google analytics, SEO/SEM, keyword research & persuasive design \n \n4. Self-starter / Hardworking Entrepreneur - ran my own physical retail store & staff \n \n5. Strong negotiator for diffusing tense situations \n \n6. Technologist with ability to de-scope to meet impossible deadlines \n \nBased in London, UK and have work visa. Skills Cloud Computing E-commerce Leadership Enterprise Software SaaS Management Business Development Customer Service Cross-functional Team... Integration Social Entrepreneurship Pre-sales Retail Marketing Business Strategy Team Leadership Solution Architecture Technology Pre-Sales See 2+     See less Skills  Cloud Computing E-commerce Leadership Enterprise Software SaaS Management Business Development Customer Service Cross-functional Team... Integration Social Entrepreneurship Pre-sales Retail Marketing Business Strategy Team Leadership Solution Architecture Technology Pre-Sales See 2+     See less Cloud Computing E-commerce Leadership Enterprise Software SaaS Management Business Development Customer Service Cross-functional Team... Integration Social Entrepreneurship Pre-sales Retail Marketing Business Strategy Team Leadership Solution Architecture Technology Pre-Sales See 2+     See less Cloud Computing E-commerce Leadership Enterprise Software SaaS Management Business Development Customer Service Cross-functional Team... Integration Social Entrepreneurship Pre-sales Retail Marketing Business Strategy Team Leadership Solution Architecture Technology Pre-Sales See 2+     See less ", "Summary Technical Business Anaylst, Systems Analyst, EAI Software Development Manager, Data Governance, Web Services & XML Systems Analyst, Database Analyst, Solution Architecture \n \nSpecialties: RDBMS (DB2, Oracle, Sybase), Middleware, EAI, ETL, IBM Datastage, webMethods, Core Java, C, C++, XML, JSON, Spring Toolsuite, MVC Architecture, Gemfire, Web Services, SOA, SOAP Messages, Data Mapping and Transformation, RESTful services, ERP Systems, Siebel, JD Edwards, SAP, SAP PI, MQ Series, Visio, RSA, Powerpoint, Excel, TopTeam \n \nVerticals: Automotive, Telecommunications, Health Insurance, Retail Industry, Power Industry, Entertainment, Major League Sports, Non Profit Orgs, Government, Military, Financial, Hotel Industry ( Hilton, Marriott), Product Development, Law Enforcement, Public Records Summary Technical Business Anaylst, Systems Analyst, EAI Software Development Manager, Data Governance, Web Services & XML Systems Analyst, Database Analyst, Solution Architecture \n \nSpecialties: RDBMS (DB2, Oracle, Sybase), Middleware, EAI, ETL, IBM Datastage, webMethods, Core Java, C, C++, XML, JSON, Spring Toolsuite, MVC Architecture, Gemfire, Web Services, SOA, SOAP Messages, Data Mapping and Transformation, RESTful services, ERP Systems, Siebel, JD Edwards, SAP, SAP PI, MQ Series, Visio, RSA, Powerpoint, Excel, TopTeam \n \nVerticals: Automotive, Telecommunications, Health Insurance, Retail Industry, Power Industry, Entertainment, Major League Sports, Non Profit Orgs, Government, Military, Financial, Hotel Industry ( Hilton, Marriott), Product Development, Law Enforcement, Public Records Technical Business Anaylst, Systems Analyst, EAI Software Development Manager, Data Governance, Web Services & XML Systems Analyst, Database Analyst, Solution Architecture \n \nSpecialties: RDBMS (DB2, Oracle, Sybase), Middleware, EAI, ETL, IBM Datastage, webMethods, Core Java, C, C++, XML, JSON, Spring Toolsuite, MVC Architecture, Gemfire, Web Services, SOA, SOAP Messages, Data Mapping and Transformation, RESTful services, ERP Systems, Siebel, JD Edwards, SAP, SAP PI, MQ Series, Visio, RSA, Powerpoint, Excel, TopTeam \n \nVerticals: Automotive, Telecommunications, Health Insurance, Retail Industry, Power Industry, Entertainment, Major League Sports, Non Profit Orgs, Government, Military, Financial, Hotel Industry ( Hilton, Marriott), Product Development, Law Enforcement, Public Records Technical Business Anaylst, Systems Analyst, EAI Software Development Manager, Data Governance, Web Services & XML Systems Analyst, Database Analyst, Solution Architecture \n \nSpecialties: RDBMS (DB2, Oracle, Sybase), Middleware, EAI, ETL, IBM Datastage, webMethods, Core Java, C, C++, XML, JSON, Spring Toolsuite, MVC Architecture, Gemfire, Web Services, SOA, SOAP Messages, Data Mapping and Transformation, RESTful services, ERP Systems, Siebel, JD Edwards, SAP, SAP PI, MQ Series, Visio, RSA, Powerpoint, Excel, TopTeam \n \nVerticals: Automotive, Telecommunications, Health Insurance, Retail Industry, Power Industry, Entertainment, Major League Sports, Non Profit Orgs, Government, Military, Financial, Hotel Industry ( Hilton, Marriott), Product Development, Law Enforcement, Public Records Experience Systems Analyst - Mobile Applications Verizon Telematics, Inc. March 2013  –  June 2014  (1 year 4 months) Atlanta, GA Senior Systems Analyst - Technology Architecture Accenture August 2011  –  January 2013  (1 year 6 months) Greater Atlanta Area Business Data Analyst Thomson Reuters March 2010  –  August 2011  (1 year 6 months) Atlanta, GA, 30339 Technical Business Analyst Thompson Technologies May 2009  –  March 2010  (11 months) Kennesaw, GA, 30144 Business Analyst, Technical Lead, Chief Systems Engineer The Home Depot SSC March 2004  –  February 2009  (5 years) Greater Atlanta Area Business Systems Analyst/Project Manager Turner Broadcasting August 2003  –  February 2004  (7 months) Atlanta, GA, midtown EAI Systems Engineer The Home Depot December 2002  –  August 2003  (9 months) Atlanta, GA | contract via The Proven Method EAI Business Analyst GE Power Systems February 2002  –  December 2002  (11 months) via Mergetec Solutions | Atlanta, GA Senior Consultant Arthur Andersen LLP February 2001  –  January 2002  (1 year) Atlanta, GA. downtown Project Engineer Organic, Inc April 2000  –  January 2001  (10 months) Dunwoody, GA IT Solutions Architect IBM Business Consulting Services November 1995  –  May 2000  (4 years 7 months) Atlanta, GA 30339 Associate Analyst Kaman Sciences Corporation May 1993  –  November 1995  (2 years 7 months) Utica, NY, 13501 Systems Analyst - Mobile Applications Verizon Telematics, Inc. March 2013  –  June 2014  (1 year 4 months) Atlanta, GA Systems Analyst - Mobile Applications Verizon Telematics, Inc. March 2013  –  June 2014  (1 year 4 months) Atlanta, GA Senior Systems Analyst - Technology Architecture Accenture August 2011  –  January 2013  (1 year 6 months) Greater Atlanta Area Senior Systems Analyst - Technology Architecture Accenture August 2011  –  January 2013  (1 year 6 months) Greater Atlanta Area Business Data Analyst Thomson Reuters March 2010  –  August 2011  (1 year 6 months) Atlanta, GA, 30339 Business Data Analyst Thomson Reuters March 2010  –  August 2011  (1 year 6 months) Atlanta, GA, 30339 Technical Business Analyst Thompson Technologies May 2009  –  March 2010  (11 months) Kennesaw, GA, 30144 Technical Business Analyst Thompson Technologies May 2009  –  March 2010  (11 months) Kennesaw, GA, 30144 Business Analyst, Technical Lead, Chief Systems Engineer The Home Depot SSC March 2004  –  February 2009  (5 years) Greater Atlanta Area Business Analyst, Technical Lead, Chief Systems Engineer The Home Depot SSC March 2004  –  February 2009  (5 years) Greater Atlanta Area Business Systems Analyst/Project Manager Turner Broadcasting August 2003  –  February 2004  (7 months) Atlanta, GA, midtown Business Systems Analyst/Project Manager Turner Broadcasting August 2003  –  February 2004  (7 months) Atlanta, GA, midtown EAI Systems Engineer The Home Depot December 2002  –  August 2003  (9 months) Atlanta, GA | contract via The Proven Method EAI Systems Engineer The Home Depot December 2002  –  August 2003  (9 months) Atlanta, GA | contract via The Proven Method EAI Business Analyst GE Power Systems February 2002  –  December 2002  (11 months) via Mergetec Solutions | Atlanta, GA EAI Business Analyst GE Power Systems February 2002  –  December 2002  (11 months) via Mergetec Solutions | Atlanta, GA Senior Consultant Arthur Andersen LLP February 2001  –  January 2002  (1 year) Atlanta, GA. downtown Senior Consultant Arthur Andersen LLP February 2001  –  January 2002  (1 year) Atlanta, GA. downtown Project Engineer Organic, Inc April 2000  –  January 2001  (10 months) Dunwoody, GA Project Engineer Organic, Inc April 2000  –  January 2001  (10 months) Dunwoody, GA IT Solutions Architect IBM Business Consulting Services November 1995  –  May 2000  (4 years 7 months) Atlanta, GA 30339 IT Solutions Architect IBM Business Consulting Services November 1995  –  May 2000  (4 years 7 months) Atlanta, GA 30339 Associate Analyst Kaman Sciences Corporation May 1993  –  November 1995  (2 years 7 months) Utica, NY, 13501 Associate Analyst Kaman Sciences Corporation May 1993  –  November 1995  (2 years 7 months) Utica, NY, 13501 Languages English English English Skills Integration Business Intelligence SDLC Business Analysis Requirements Analysis SAP Message Oriented... SpringSource JSON XML Java Data Analysis Data Mining Databases Data Modeling Enterprise Architecture Solution Architecture MVC Architecture EAI Websphere Agile Methodologies Requirements Gathering Visio Solaris SQL UML Software Development See 12+     See less Skills  Integration Business Intelligence SDLC Business Analysis Requirements Analysis SAP Message Oriented... SpringSource JSON XML Java Data Analysis Data Mining Databases Data Modeling Enterprise Architecture Solution Architecture MVC Architecture EAI Websphere Agile Methodologies Requirements Gathering Visio Solaris SQL UML Software Development See 12+     See less Integration Business Intelligence SDLC Business Analysis Requirements Analysis SAP Message Oriented... SpringSource JSON XML Java Data Analysis Data Mining Databases Data Modeling Enterprise Architecture Solution Architecture MVC Architecture EAI Websphere Agile Methodologies Requirements Gathering Visio Solaris SQL UML Software Development See 12+     See less Integration Business Intelligence SDLC Business Analysis Requirements Analysis SAP Message Oriented... SpringSource JSON XML Java Data Analysis Data Mining Databases Data Modeling Enterprise Architecture Solution Architecture MVC Architecture EAI Websphere Agile Methodologies Requirements Gathering Visio Solaris SQL UML Software Development See 12+     See less ", "Skills Access Essbase Excel Business Objects Team Management Operating Systems Business Intelligence Analytics Cognos Microsoft Excel Databases Business Analysis Insurance Data Warehousing Analysis IT Strategy Management Business Process Business Analytics Enterprise Software Process Improvement Oracle SDLC See 8+     See less Skills  Access Essbase Excel Business Objects Team Management Operating Systems Business Intelligence Analytics Cognos Microsoft Excel Databases Business Analysis Insurance Data Warehousing Analysis IT Strategy Management Business Process Business Analytics Enterprise Software Process Improvement Oracle SDLC See 8+     See less Access Essbase Excel Business Objects Team Management Operating Systems Business Intelligence Analytics Cognos Microsoft Excel Databases Business Analysis Insurance Data Warehousing Analysis IT Strategy Management Business Process Business Analytics Enterprise Software Process Improvement Oracle SDLC See 8+     See less Access Essbase Excel Business Objects Team Management Operating Systems Business Intelligence Analytics Cognos Microsoft Excel Databases Business Analysis Insurance Data Warehousing Analysis IT Strategy Management Business Process Business Analytics Enterprise Software Process Improvement Oracle SDLC See 8+     See less Honors & Awards ", "Experience SoftLayer - AP Technical Sales Manager IBM June 2014  – Present (1 year 3 months) I help customers with their journey on SoftLayer by translating their business needs into architectures and deployments. SoftLayer - AP Technical Sales Manager IBM June 2014  – Present (1 year 3 months) I help customers with their journey on SoftLayer by translating their business needs into architectures and deployments. SoftLayer - AP Technical Sales Manager IBM June 2014  – Present (1 year 3 months) I help customers with their journey on SoftLayer by translating their business needs into architectures and deployments. Skills Technical Presales IT architectures IT Outsourcing Sales Presentations Developing Client... business development technical sales Sales Pre-sales Cloud Computing Solution Architecture Disaster Recovery Business Development Security Business Analysis Enterprise Software ITIL Computer Architecture Product Management See 4+     See less Skills  Technical Presales IT architectures IT Outsourcing Sales Presentations Developing Client... business development technical sales Sales Pre-sales Cloud Computing Solution Architecture Disaster Recovery Business Development Security Business Analysis Enterprise Software ITIL Computer Architecture Product Management See 4+     See less Technical Presales IT architectures IT Outsourcing Sales Presentations Developing Client... business development technical sales Sales Pre-sales Cloud Computing Solution Architecture Disaster Recovery Business Development Security Business Analysis Enterprise Software ITIL Computer Architecture Product Management See 4+     See less Technical Presales IT architectures IT Outsourcing Sales Presentations Developing Client... business development technical sales Sales Pre-sales Cloud Computing Solution Architecture Disaster Recovery Business Development Security Business Analysis Enterprise Software ITIL Computer Architecture Product Management See 4+     See less ", "Experience Sr. Business Analyst Staples February 2013  – Present (2 years 7 months) Business Analyst/ CSM BI Incorporated September 2011  –  September 2012  (1 year 1 month) Business Analyst/ CSM ACT Teleconferencing 2009  –  September 2011  (2 years) Tech. - Syst. Analyst Dex Media 2007  –  2009  (2 years) IT Solutions Architect IBM 2005  –  2007  (2 years) System Consulting/ Project Management Centerprises LLC / OnForce 2002  –  2005  (3 years) Software Engineer Sollen Technologies 1999  –  2002  (3 years) Senior Software Engineer WinShapes, Inc 1996  –  1999  (3 years) Sr. Business Analyst Staples February 2013  – Present (2 years 7 months) Sr. Business Analyst Staples February 2013  – Present (2 years 7 months) Business Analyst/ CSM BI Incorporated September 2011  –  September 2012  (1 year 1 month) Business Analyst/ CSM BI Incorporated September 2011  –  September 2012  (1 year 1 month) Business Analyst/ CSM ACT Teleconferencing 2009  –  September 2011  (2 years) Business Analyst/ CSM ACT Teleconferencing 2009  –  September 2011  (2 years) Tech. - Syst. Analyst Dex Media 2007  –  2009  (2 years) Tech. - Syst. Analyst Dex Media 2007  –  2009  (2 years) IT Solutions Architect IBM 2005  –  2007  (2 years) IT Solutions Architect IBM 2005  –  2007  (2 years) System Consulting/ Project Management Centerprises LLC / OnForce 2002  –  2005  (3 years) System Consulting/ Project Management Centerprises LLC / OnForce 2002  –  2005  (3 years) Software Engineer Sollen Technologies 1999  –  2002  (3 years) Software Engineer Sollen Technologies 1999  –  2002  (3 years) Senior Software Engineer WinShapes, Inc 1996  –  1999  (3 years) Senior Software Engineer WinShapes, Inc 1996  –  1999  (3 years) Languages Spanish Spanish Spanish Skills Agile Methodologies Visio Integration Software Development Databases Program Management Quality Assurance SQL Testing Project Management Management Vendor Management Business Analysis Troubleshooting Analysis Skills  Agile Methodologies Visio Integration Software Development Databases Program Management Quality Assurance SQL Testing Project Management Management Vendor Management Business Analysis Troubleshooting Analysis Agile Methodologies Visio Integration Software Development Databases Program Management Quality Assurance SQL Testing Project Management Management Vendor Management Business Analysis Troubleshooting Analysis Agile Methodologies Visio Integration Software Development Databases Program Management Quality Assurance SQL Testing Project Management Management Vendor Management Business Analysis Troubleshooting Analysis ", "Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency Portuguese Professional working proficiency Italian Professional working proficiency French Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Portuguese Professional working proficiency Italian Professional working proficiency French Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Portuguese Professional working proficiency Italian Professional working proficiency French Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Limited working proficiency Skills Shell Scripting VMware Operating Systems Solaris MySQL Weblogic Websphere Cluster DB2 AIX Linux ITIL Unix SQL Servers Disaster Recovery Data Center Management Apache Business Intelligence IT Service Management Service Delivery See 7+     See less Skills  Shell Scripting VMware Operating Systems Solaris MySQL Weblogic Websphere Cluster DB2 AIX Linux ITIL Unix SQL Servers Disaster Recovery Data Center Management Apache Business Intelligence IT Service Management Service Delivery See 7+     See less Shell Scripting VMware Operating Systems Solaris MySQL Weblogic Websphere Cluster DB2 AIX Linux ITIL Unix SQL Servers Disaster Recovery Data Center Management Apache Business Intelligence IT Service Management Service Delivery See 7+     See less Shell Scripting VMware Operating Systems Solaris MySQL Weblogic Websphere Cluster DB2 AIX Linux ITIL Unix SQL Servers Disaster Recovery Data Center Management Apache Business Intelligence IT Service Management Service Delivery See 7+     See less ", "Languages Vietnamese Vietnamese Vietnamese Skills Enterprise Architecture SOA Websphere Integration Virtualization AIX Solution Architecture SaaS Cloud Computing Enterprise Software EAI Middleware Mobile Applications Software Development Management Consulting WebSphere See 1+     See less Skills  Enterprise Architecture SOA Websphere Integration Virtualization AIX Solution Architecture SaaS Cloud Computing Enterprise Software EAI Middleware Mobile Applications Software Development Management Consulting WebSphere See 1+     See less Enterprise Architecture SOA Websphere Integration Virtualization AIX Solution Architecture SaaS Cloud Computing Enterprise Software EAI Middleware Mobile Applications Software Development Management Consulting WebSphere See 1+     See less Enterprise Architecture SOA Websphere Integration Virtualization AIX Solution Architecture SaaS Cloud Computing Enterprise Software EAI Middleware Mobile Applications Software Development Management Consulting WebSphere See 1+     See less Honors & Awards ", "Summary RESEARCH & DEVELOPMENT  \nElectronic Payment Technologies \nProfessional profile: \n•\tExperienced Technical Manager for software projects, systems, embedded software, cryptography and smartcards, as well as Solutions Architectures. \n•\tConsulting skills for new products development and upgrade of installed systems with support to marketing , sales and delivery of solutions to Engineering.  \n•\tTeam leadership of strategic projects, simultaneously local and global, working with technical and business proposals, planning and implementation. \n•\tBroad understanding of chip cards market with track records results on new technologies prospection, leverage of opportunities for new business and processes , as well as client follow up on after sales with recommendation for testing new solutions. \n•\tProficient on training, workshops and University lectures , also covering EMV technology. \n•\tGood written and verbal communication for technical sales , presentations , negotiations and management of project teams. \n•\tAnalytical skills to devise I/T architectures and implement or improve business processes.  \n•\tFluent in written/spoken English and Portuguese, able to read in French, able to read Spanish. \n•\tTechnical expertise on : smartcards, EMV, cryptography, electronic financial transactions, FDDI Networks, TCP/IP, SNMP agents, LANs, Relational Databases, IBM 370 architecture, Lotus Notes, Applications servers. Knowledge at architecture level of Windows and AIX (IBM Unix), basics of Linux. \n Summary RESEARCH & DEVELOPMENT  \nElectronic Payment Technologies \nProfessional profile: \n•\tExperienced Technical Manager for software projects, systems, embedded software, cryptography and smartcards, as well as Solutions Architectures. \n•\tConsulting skills for new products development and upgrade of installed systems with support to marketing , sales and delivery of solutions to Engineering.  \n•\tTeam leadership of strategic projects, simultaneously local and global, working with technical and business proposals, planning and implementation. \n•\tBroad understanding of chip cards market with track records results on new technologies prospection, leverage of opportunities for new business and processes , as well as client follow up on after sales with recommendation for testing new solutions. \n•\tProficient on training, workshops and University lectures , also covering EMV technology. \n•\tGood written and verbal communication for technical sales , presentations , negotiations and management of project teams. \n•\tAnalytical skills to devise I/T architectures and implement or improve business processes.  \n•\tFluent in written/spoken English and Portuguese, able to read in French, able to read Spanish. \n•\tTechnical expertise on : smartcards, EMV, cryptography, electronic financial transactions, FDDI Networks, TCP/IP, SNMP agents, LANs, Relational Databases, IBM 370 architecture, Lotus Notes, Applications servers. Knowledge at architecture level of Windows and AIX (IBM Unix), basics of Linux. \n RESEARCH & DEVELOPMENT  \nElectronic Payment Technologies \nProfessional profile: \n•\tExperienced Technical Manager for software projects, systems, embedded software, cryptography and smartcards, as well as Solutions Architectures. \n•\tConsulting skills for new products development and upgrade of installed systems with support to marketing , sales and delivery of solutions to Engineering.  \n•\tTeam leadership of strategic projects, simultaneously local and global, working with technical and business proposals, planning and implementation. \n•\tBroad understanding of chip cards market with track records results on new technologies prospection, leverage of opportunities for new business and processes , as well as client follow up on after sales with recommendation for testing new solutions. \n•\tProficient on training, workshops and University lectures , also covering EMV technology. \n•\tGood written and verbal communication for technical sales , presentations , negotiations and management of project teams. \n•\tAnalytical skills to devise I/T architectures and implement or improve business processes.  \n•\tFluent in written/spoken English and Portuguese, able to read in French, able to read Spanish. \n•\tTechnical expertise on : smartcards, EMV, cryptography, electronic financial transactions, FDDI Networks, TCP/IP, SNMP agents, LANs, Relational Databases, IBM 370 architecture, Lotus Notes, Applications servers. Knowledge at architecture level of Windows and AIX (IBM Unix), basics of Linux. \n RESEARCH & DEVELOPMENT  \nElectronic Payment Technologies \nProfessional profile: \n•\tExperienced Technical Manager for software projects, systems, embedded software, cryptography and smartcards, as well as Solutions Architectures. \n•\tConsulting skills for new products development and upgrade of installed systems with support to marketing , sales and delivery of solutions to Engineering.  \n•\tTeam leadership of strategic projects, simultaneously local and global, working with technical and business proposals, planning and implementation. \n•\tBroad understanding of chip cards market with track records results on new technologies prospection, leverage of opportunities for new business and processes , as well as client follow up on after sales with recommendation for testing new solutions. \n•\tProficient on training, workshops and University lectures , also covering EMV technology. \n•\tGood written and verbal communication for technical sales , presentations , negotiations and management of project teams. \n•\tAnalytical skills to devise I/T architectures and implement or improve business processes.  \n•\tFluent in written/spoken English and Portuguese, able to read in French, able to read Spanish. \n•\tTechnical expertise on : smartcards, EMV, cryptography, electronic financial transactions, FDDI Networks, TCP/IP, SNMP agents, LANs, Relational Databases, IBM 370 architecture, Lotus Notes, Applications servers. Knowledge at architecture level of Windows and AIX (IBM Unix), basics of Linux. \n Experience Executive Director Marson Consultoria SC Ltda February 2004  – Present (11 years 7 months) Consulting services on electronic payment systems. \nEMV : migration techniques, training, , card selection, overall studies and recommendations. New Technologies Manager VR Beneficios January 2010  –  March 2015  (5 years 3 months) Barueri, Brazil New Technologies Manager : Responsible for technical management in the introduction or adaptation of technological innovations, involving hardware, software, smartcards and embedded systems, consistent with the needs of the VR Group .•\tMain technical leader for EMV migration project , with participation in cards definition, Certification Authority, registration processes for initial approval of keys and cards \n \nIndependent Consultant (Marson Consultoria SC Ltda.)\t \nSmartNet (Grupo VR) - Consultancy internal / external projects relating to authorization of online and offline systems, 2010  \nWork undertaken with groups formed \"ad-hoc\" under my Technical Leadership. \nCertification and approval of new cryptographic processor for offline transactions, study and technical recommendation on payment gateways, introduction of JavaCard (smartcard) technology and leadership to design and produce prototypes of off-line system (transaction card-to-card). \n Consultant for Smartcard Projects CPqD foundation February 2005  –  September 2010  (5 years 8 months) Campinas Area, Brazil Division Manager (2000-2001) \n\tDevelopment Manager for Software and Hardware of applications on telecomm networks, involving 3 departments with 45 engineers and software analysts. \n\tImprovement of competitiveness of company in open Market, by implementation of controlled process for proposals and contracts, reducing time to generate a contract by 40% and exceeded revenue quota by 25%.  \n\tFinancial responsibility for revenue planning, expenses control and investments of Division. \n \nIndependent Consultant for Smartcards (2005-2009) \n\tHave built a development group on smartcards, including training, technical guidance, hiring e planning. \n\tArchitecture and conception of CPqD Smartcard system or automobile and fleet fuel consumption control, using offline transactions, smartcards Java and management via WEB, including hardware implementation of offline terminal, with patent filed by CPqD. \n\tViability of demand for fleet control on small/medium companies, combined in a business plan with planning for a spinoff company, where I was appointed as R&D Director. \n Manager for Software Development Esafetransfer February 2004  –  December 2004  (11 months) São Paulo Area, Brazil Have managed Software Development department on loyalty solutions using smartcards, Certification Authority Software and PKI solutions. \nPlanning and participation of E-Safetranfer stand at Cartes 2014 Exposition in Paris, using product demos with online authorization from servers at Sao Paulo and Fort Lauderdale. \n Research & Development Manager Hypercom (incorporated by Verifone) September 2002  –  September 2003  (1 year 1 month) Atibaia,SP, Brazil Research & Development Manager – 2002 - 2003 \n\tSoftware development for POS e Host Applications. \n\tManagement of human resources, schedules, cost and requirements, also performing as system architect. \n\tPerformed a re-structure of software development model with expressive cost reduction. \n\tEstablished the basis to transform an internal Software into a product used as workframe to develop authorization engines, stand-ins and protocols translators.Also developed a plan to extend computational base to Linux and Unixes. \n\tLeader for the initiative of porting development tool kit from Assembly to C, using Government incentives through research labs. \n\tEstablished the minimum requirements for controlling the internal and external development processes (reaching vendors through secure Internet access). \n \nIT Solutions Architect - 2000 \nSenior Architect for POS (Point-of Sale) solutions encompassing systems with transaction capture network, Back-Office and host applications. Architecture and implementation of projects using smartcard -contact and contactless. Architecture of back office software for processing and forwarding of payment transaction. \n IT Solutions Architect IBM Chicago - Americas Technical Sales Group March 2001  –  September 2002  (1 year 7 months) Chigaco, Ill. USA Americas Technical Sales Group \n\tIT Architect for two large System Integrators accounts. Provided sales technical support to Account Executives in order to transform business plans into technical plans, followed by implementation tracking. \n\tProvided technical plans and directions for Solution Centers enablement.  \n\tIntroduction of IBM content into Solution Centers, resulting on increase of IBM presence from almost zero to 75% overall. \n \nIT Architect and Project Manager – IBM Brazil, São Paulo – 1995-1999 \n\tManaged and designed solutions and applications using Internet technologies. \n\tDevelopment of pre sales presentations, proposals, cost and effort estimation for programming of several projects. \n\tManaged vendors, provided marketing support, and conducted development and implementation of projects in e-business area. \n\tDevelopment and implementation of Sales Automation system via Internet (VPN- Virtual Private Network) for dealers to place and follow part orders directly into Corporate ERP, causing an operational cost reduction of 80% in relation of previous system. \n \nSoftware Architect and Team Leader – IBM Brazil – Sumare Development Center – 1989-1995 \n\tTechnical Leader and Architect for development and implementation of management software for optical networks. \n\tDesign of management solution for FDDI Concentrator, being responsible for the development process in Brazil, under sub contract of IBM Raleigh Laboratory (USA). \n Product/Design Engineer IBM Brasil Ltda 1974  –  1999  (25 years) USA, Brazil \tDesigner of firmware (microcode) for IBM mainframes on USA laboratories. \n\tProduct Engineer for mainframes and tape units with design responsibilities to support centers in São Paulo, Buenos Aires, Sidney and Tokyo, also support to manufacturing and test on Sumare Plant. \n\tParticipation on planning, certification, components nationalization and technical consultancy to several areas besides Engineering. \n Executive Director Marson Consultoria SC Ltda February 2004  – Present (11 years 7 months) Consulting services on electronic payment systems. \nEMV : migration techniques, training, , card selection, overall studies and recommendations. Executive Director Marson Consultoria SC Ltda February 2004  – Present (11 years 7 months) Consulting services on electronic payment systems. \nEMV : migration techniques, training, , card selection, overall studies and recommendations. New Technologies Manager VR Beneficios January 2010  –  March 2015  (5 years 3 months) Barueri, Brazil New Technologies Manager : Responsible for technical management in the introduction or adaptation of technological innovations, involving hardware, software, smartcards and embedded systems, consistent with the needs of the VR Group .•\tMain technical leader for EMV migration project , with participation in cards definition, Certification Authority, registration processes for initial approval of keys and cards \n \nIndependent Consultant (Marson Consultoria SC Ltda.)\t \nSmartNet (Grupo VR) - Consultancy internal / external projects relating to authorization of online and offline systems, 2010  \nWork undertaken with groups formed \"ad-hoc\" under my Technical Leadership. \nCertification and approval of new cryptographic processor for offline transactions, study and technical recommendation on payment gateways, introduction of JavaCard (smartcard) technology and leadership to design and produce prototypes of off-line system (transaction card-to-card). \n New Technologies Manager VR Beneficios January 2010  –  March 2015  (5 years 3 months) Barueri, Brazil New Technologies Manager : Responsible for technical management in the introduction or adaptation of technological innovations, involving hardware, software, smartcards and embedded systems, consistent with the needs of the VR Group .•\tMain technical leader for EMV migration project , with participation in cards definition, Certification Authority, registration processes for initial approval of keys and cards \n \nIndependent Consultant (Marson Consultoria SC Ltda.)\t \nSmartNet (Grupo VR) - Consultancy internal / external projects relating to authorization of online and offline systems, 2010  \nWork undertaken with groups formed \"ad-hoc\" under my Technical Leadership. \nCertification and approval of new cryptographic processor for offline transactions, study and technical recommendation on payment gateways, introduction of JavaCard (smartcard) technology and leadership to design and produce prototypes of off-line system (transaction card-to-card). \n Consultant for Smartcard Projects CPqD foundation February 2005  –  September 2010  (5 years 8 months) Campinas Area, Brazil Division Manager (2000-2001) \n\tDevelopment Manager for Software and Hardware of applications on telecomm networks, involving 3 departments with 45 engineers and software analysts. \n\tImprovement of competitiveness of company in open Market, by implementation of controlled process for proposals and contracts, reducing time to generate a contract by 40% and exceeded revenue quota by 25%.  \n\tFinancial responsibility for revenue planning, expenses control and investments of Division. \n \nIndependent Consultant for Smartcards (2005-2009) \n\tHave built a development group on smartcards, including training, technical guidance, hiring e planning. \n\tArchitecture and conception of CPqD Smartcard system or automobile and fleet fuel consumption control, using offline transactions, smartcards Java and management via WEB, including hardware implementation of offline terminal, with patent filed by CPqD. \n\tViability of demand for fleet control on small/medium companies, combined in a business plan with planning for a spinoff company, where I was appointed as R&D Director. \n Consultant for Smartcard Projects CPqD foundation February 2005  –  September 2010  (5 years 8 months) Campinas Area, Brazil Division Manager (2000-2001) \n\tDevelopment Manager for Software and Hardware of applications on telecomm networks, involving 3 departments with 45 engineers and software analysts. \n\tImprovement of competitiveness of company in open Market, by implementation of controlled process for proposals and contracts, reducing time to generate a contract by 40% and exceeded revenue quota by 25%.  \n\tFinancial responsibility for revenue planning, expenses control and investments of Division. \n \nIndependent Consultant for Smartcards (2005-2009) \n\tHave built a development group on smartcards, including training, technical guidance, hiring e planning. \n\tArchitecture and conception of CPqD Smartcard system or automobile and fleet fuel consumption control, using offline transactions, smartcards Java and management via WEB, including hardware implementation of offline terminal, with patent filed by CPqD. \n\tViability of demand for fleet control on small/medium companies, combined in a business plan with planning for a spinoff company, where I was appointed as R&D Director. \n Manager for Software Development Esafetransfer February 2004  –  December 2004  (11 months) São Paulo Area, Brazil Have managed Software Development department on loyalty solutions using smartcards, Certification Authority Software and PKI solutions. \nPlanning and participation of E-Safetranfer stand at Cartes 2014 Exposition in Paris, using product demos with online authorization from servers at Sao Paulo and Fort Lauderdale. \n Manager for Software Development Esafetransfer February 2004  –  December 2004  (11 months) São Paulo Area, Brazil Have managed Software Development department on loyalty solutions using smartcards, Certification Authority Software and PKI solutions. \nPlanning and participation of E-Safetranfer stand at Cartes 2014 Exposition in Paris, using product demos with online authorization from servers at Sao Paulo and Fort Lauderdale. \n Research & Development Manager Hypercom (incorporated by Verifone) September 2002  –  September 2003  (1 year 1 month) Atibaia,SP, Brazil Research & Development Manager – 2002 - 2003 \n\tSoftware development for POS e Host Applications. \n\tManagement of human resources, schedules, cost and requirements, also performing as system architect. \n\tPerformed a re-structure of software development model with expressive cost reduction. \n\tEstablished the basis to transform an internal Software into a product used as workframe to develop authorization engines, stand-ins and protocols translators.Also developed a plan to extend computational base to Linux and Unixes. \n\tLeader for the initiative of porting development tool kit from Assembly to C, using Government incentives through research labs. \n\tEstablished the minimum requirements for controlling the internal and external development processes (reaching vendors through secure Internet access). \n \nIT Solutions Architect - 2000 \nSenior Architect for POS (Point-of Sale) solutions encompassing systems with transaction capture network, Back-Office and host applications. Architecture and implementation of projects using smartcard -contact and contactless. Architecture of back office software for processing and forwarding of payment transaction. \n Research & Development Manager Hypercom (incorporated by Verifone) September 2002  –  September 2003  (1 year 1 month) Atibaia,SP, Brazil Research & Development Manager – 2002 - 2003 \n\tSoftware development for POS e Host Applications. \n\tManagement of human resources, schedules, cost and requirements, also performing as system architect. \n\tPerformed a re-structure of software development model with expressive cost reduction. \n\tEstablished the basis to transform an internal Software into a product used as workframe to develop authorization engines, stand-ins and protocols translators.Also developed a plan to extend computational base to Linux and Unixes. \n\tLeader for the initiative of porting development tool kit from Assembly to C, using Government incentives through research labs. \n\tEstablished the minimum requirements for controlling the internal and external development processes (reaching vendors through secure Internet access). \n \nIT Solutions Architect - 2000 \nSenior Architect for POS (Point-of Sale) solutions encompassing systems with transaction capture network, Back-Office and host applications. Architecture and implementation of projects using smartcard -contact and contactless. Architecture of back office software for processing and forwarding of payment transaction. \n IT Solutions Architect IBM Chicago - Americas Technical Sales Group March 2001  –  September 2002  (1 year 7 months) Chigaco, Ill. USA Americas Technical Sales Group \n\tIT Architect for two large System Integrators accounts. Provided sales technical support to Account Executives in order to transform business plans into technical plans, followed by implementation tracking. \n\tProvided technical plans and directions for Solution Centers enablement.  \n\tIntroduction of IBM content into Solution Centers, resulting on increase of IBM presence from almost zero to 75% overall. \n \nIT Architect and Project Manager – IBM Brazil, São Paulo – 1995-1999 \n\tManaged and designed solutions and applications using Internet technologies. \n\tDevelopment of pre sales presentations, proposals, cost and effort estimation for programming of several projects. \n\tManaged vendors, provided marketing support, and conducted development and implementation of projects in e-business area. \n\tDevelopment and implementation of Sales Automation system via Internet (VPN- Virtual Private Network) for dealers to place and follow part orders directly into Corporate ERP, causing an operational cost reduction of 80% in relation of previous system. \n \nSoftware Architect and Team Leader – IBM Brazil – Sumare Development Center – 1989-1995 \n\tTechnical Leader and Architect for development and implementation of management software for optical networks. \n\tDesign of management solution for FDDI Concentrator, being responsible for the development process in Brazil, under sub contract of IBM Raleigh Laboratory (USA). \n IT Solutions Architect IBM Chicago - Americas Technical Sales Group March 2001  –  September 2002  (1 year 7 months) Chigaco, Ill. USA Americas Technical Sales Group \n\tIT Architect for two large System Integrators accounts. Provided sales technical support to Account Executives in order to transform business plans into technical plans, followed by implementation tracking. \n\tProvided technical plans and directions for Solution Centers enablement.  \n\tIntroduction of IBM content into Solution Centers, resulting on increase of IBM presence from almost zero to 75% overall. \n \nIT Architect and Project Manager – IBM Brazil, São Paulo – 1995-1999 \n\tManaged and designed solutions and applications using Internet technologies. \n\tDevelopment of pre sales presentations, proposals, cost and effort estimation for programming of several projects. \n\tManaged vendors, provided marketing support, and conducted development and implementation of projects in e-business area. \n\tDevelopment and implementation of Sales Automation system via Internet (VPN- Virtual Private Network) for dealers to place and follow part orders directly into Corporate ERP, causing an operational cost reduction of 80% in relation of previous system. \n \nSoftware Architect and Team Leader – IBM Brazil – Sumare Development Center – 1989-1995 \n\tTechnical Leader and Architect for development and implementation of management software for optical networks. \n\tDesign of management solution for FDDI Concentrator, being responsible for the development process in Brazil, under sub contract of IBM Raleigh Laboratory (USA). \n Product/Design Engineer IBM Brasil Ltda 1974  –  1999  (25 years) USA, Brazil \tDesigner of firmware (microcode) for IBM mainframes on USA laboratories. \n\tProduct Engineer for mainframes and tape units with design responsibilities to support centers in São Paulo, Buenos Aires, Sidney and Tokyo, also support to manufacturing and test on Sumare Plant. \n\tParticipation on planning, certification, components nationalization and technical consultancy to several areas besides Engineering. \n Product/Design Engineer IBM Brasil Ltda 1974  –  1999  (25 years) USA, Brazil \tDesigner of firmware (microcode) for IBM mainframes on USA laboratories. \n\tProduct Engineer for mainframes and tape units with design responsibilities to support centers in São Paulo, Buenos Aires, Sidney and Tokyo, also support to manufacturing and test on Sumare Plant. \n\tParticipation on planning, certification, components nationalization and technical consultancy to several areas besides Engineering. \n Languages English Full professional proficiency English Full professional proficiency English Full professional proficiency Full professional proficiency Skills Smart Cards Skills  Smart Cards Smart Cards Smart Cards Education Syracuse University Incomplete Master of Science,  Computer Science , none 1982  – 1983 Digital Computers; Introduction to Algorithms Analysis; Microprocessors and Microcomputers  State University of New York at Binghamton Incomplete Master of Science,  Computer Science , none 1978  – 1979 Mainframe and Operating Systems / State University of New York, Binghamton, NY, USA \n Universidade de São Paulo Engineer,  Electrical Engineering , 5 Year Degree 1969  – 1973 Activities and Societies:  Certified Translator by State of Sao Paulo ,  for English language Syracuse University Incomplete Master of Science,  Computer Science , none 1982  – 1983 Digital Computers; Introduction to Algorithms Analysis; Microprocessors and Microcomputers  Syracuse University Incomplete Master of Science,  Computer Science , none 1982  – 1983 Digital Computers; Introduction to Algorithms Analysis; Microprocessors and Microcomputers  Syracuse University Incomplete Master of Science,  Computer Science , none 1982  – 1983 Digital Computers; Introduction to Algorithms Analysis; Microprocessors and Microcomputers  State University of New York at Binghamton Incomplete Master of Science,  Computer Science , none 1978  – 1979 Mainframe and Operating Systems / State University of New York, Binghamton, NY, USA \n State University of New York at Binghamton Incomplete Master of Science,  Computer Science , none 1978  – 1979 Mainframe and Operating Systems / State University of New York, Binghamton, NY, USA \n State University of New York at Binghamton Incomplete Master of Science,  Computer Science , none 1978  – 1979 Mainframe and Operating Systems / State University of New York, Binghamton, NY, USA \n Universidade de São Paulo Engineer,  Electrical Engineering , 5 Year Degree 1969  – 1973 Activities and Societies:  Certified Translator by State of Sao Paulo ,  for English language Universidade de São Paulo Engineer,  Electrical Engineering , 5 Year Degree 1969  – 1973 Activities and Societies:  Certified Translator by State of Sao Paulo ,  for English language Universidade de São Paulo Engineer,  Electrical Engineering , 5 Year Degree 1969  – 1973 Activities and Societies:  Certified Translator by State of Sao Paulo ,  for English language Honors & Awards Additional Honors & Awards 2013 VR Benefícios – award for special effort on EMV Migration \n2008 CPqD – Inventiveness Award \n1998 IBM USA, Vice President Award for implementatio of 1st Extranet Business-to-Business Extranet in Latin America \n1993 IBM Brazil, Leadership Award for the solution FDDI to SNMP Proxy  \n1992 IBM Brasil, Director’s Award for participation on Design of FDDI Concentrator Additional Honors & Awards 2013 VR Benefícios – award for special effort on EMV Migration \n2008 CPqD – Inventiveness Award \n1998 IBM USA, Vice President Award for implementatio of 1st Extranet Business-to-Business Extranet in Latin America \n1993 IBM Brazil, Leadership Award for the solution FDDI to SNMP Proxy  \n1992 IBM Brasil, Director’s Award for participation on Design of FDDI Concentrator Additional Honors & Awards 2013 VR Benefícios – award for special effort on EMV Migration \n2008 CPqD – Inventiveness Award \n1998 IBM USA, Vice President Award for implementatio of 1st Extranet Business-to-Business Extranet in Latin America \n1993 IBM Brazil, Leadership Award for the solution FDDI to SNMP Proxy  \n1992 IBM Brasil, Director’s Award for participation on Design of FDDI Concentrator Additional Honors & Awards 2013 VR Benefícios – award for special effort on EMV Migration \n2008 CPqD – Inventiveness Award \n1998 IBM USA, Vice President Award for implementatio of 1st Extranet Business-to-Business Extranet in Latin America \n1993 IBM Brazil, Leadership Award for the solution FDDI to SNMP Proxy  \n1992 IBM Brasil, Director’s Award for participation on Design of FDDI Concentrator ", "Experience Senior Enterprise IT Solutions Architect IBM Client Architect BNP Paribas 2012  –  2013  (1 year) IT Solutions Architect - Portal/Process Server IBM January 2001  –  2006  (5 years) Senior Enterprise IT Solutions Architect IBM Senior Enterprise IT Solutions Architect IBM Client Architect BNP Paribas 2012  –  2013  (1 year) Client Architect BNP Paribas 2012  –  2013  (1 year) IT Solutions Architect - Portal/Process Server IBM January 2001  –  2006  (5 years) IT Solutions Architect - Portal/Process Server IBM January 2001  –  2006  (5 years) Skills Rational Software... WebSphere ESB WebSphere Process Server IBM SOA WebSphere Integration... WebSphere Business... SOMA SOA Governance Business Activity... WebSphere Adapters Enterprise Data Modeling Data Architects DataPower WESB Property & Casualty... IT Management Enterprise Operations IT Leadership Global Application... Applications... Applications Software... Open Source Platforms ITCAM WSRR WTX OS/400 iSeries development SQL400 CL Programming DFU Query400 ILERPG WDSC I5 RLU Information Architecture Heuristic Evaluation Contextual Design Cognitive Walkthrough AIX Administration IBM HTTP Server Tivoli Access Manager Tivoli Identity Manager RHEL JMS ERP Implementations Rational Rose... Agile Methodologies Extreme Programming ACARS See 35+     See less Skills  Rational Software... WebSphere ESB WebSphere Process Server IBM SOA WebSphere Integration... WebSphere Business... SOMA SOA Governance Business Activity... WebSphere Adapters Enterprise Data Modeling Data Architects DataPower WESB Property & Casualty... IT Management Enterprise Operations IT Leadership Global Application... Applications... Applications Software... Open Source Platforms ITCAM WSRR WTX OS/400 iSeries development SQL400 CL Programming DFU Query400 ILERPG WDSC I5 RLU Information Architecture Heuristic Evaluation Contextual Design Cognitive Walkthrough AIX Administration IBM HTTP Server Tivoli Access Manager Tivoli Identity Manager RHEL JMS ERP Implementations Rational Rose... Agile Methodologies Extreme Programming ACARS See 35+     See less Rational Software... WebSphere ESB WebSphere Process Server IBM SOA WebSphere Integration... WebSphere Business... SOMA SOA Governance Business Activity... WebSphere Adapters Enterprise Data Modeling Data Architects DataPower WESB Property & Casualty... IT Management Enterprise Operations IT Leadership Global Application... Applications... Applications Software... Open Source Platforms ITCAM WSRR WTX OS/400 iSeries development SQL400 CL Programming DFU Query400 ILERPG WDSC I5 RLU Information Architecture Heuristic Evaluation Contextual Design Cognitive Walkthrough AIX Administration IBM HTTP Server Tivoli Access Manager Tivoli Identity Manager RHEL JMS ERP Implementations Rational Rose... Agile Methodologies Extreme Programming ACARS See 35+     See less Rational Software... WebSphere ESB WebSphere Process Server IBM SOA WebSphere Integration... WebSphere Business... SOMA SOA Governance Business Activity... WebSphere Adapters Enterprise Data Modeling Data Architects DataPower WESB Property & Casualty... IT Management Enterprise Operations IT Leadership Global Application... Applications... Applications Software... Open Source Platforms ITCAM WSRR WTX OS/400 iSeries development SQL400 CL Programming DFU Query400 ILERPG WDSC I5 RLU Information Architecture Heuristic Evaluation Contextual Design Cognitive Walkthrough AIX Administration IBM HTTP Server Tivoli Access Manager Tivoli Identity Manager RHEL JMS ERP Implementations Rational Rose... Agile Methodologies Extreme Programming ACARS See 35+     See less ", "Experience IT Solutions Architect IBM October 2013  – Present (1 year 11 months) IT Specialist IBM March 2009  –  October 2013  (4 years 8 months) IT Consultant Apollo Consulting July 2003  –  March 2009  (5 years 9 months) IT Solutions Architect IBM October 2013  – Present (1 year 11 months) IT Solutions Architect IBM October 2013  – Present (1 year 11 months) IT Specialist IBM March 2009  –  October 2013  (4 years 8 months) IT Specialist IBM March 2009  –  October 2013  (4 years 8 months) IT Consultant Apollo Consulting July 2003  –  March 2009  (5 years 9 months) IT Consultant Apollo Consulting July 2003  –  March 2009  (5 years 9 months) Skills Solution Architecture Cloud Computing ITIL Enterprise Architecture Integration IT Strategy Unix SOA Requirements Analysis IT Management Software Project... Skills  Solution Architecture Cloud Computing ITIL Enterprise Architecture Integration IT Strategy Unix SOA Requirements Analysis IT Management Software Project... Solution Architecture Cloud Computing ITIL Enterprise Architecture Integration IT Strategy Unix SOA Requirements Analysis IT Management Software Project... Solution Architecture Cloud Computing ITIL Enterprise Architecture Integration IT Strategy Unix SOA Requirements Analysis IT Management Software Project... Education Universidad Nacional Experimental Politécnica 'Antonio José de Sucre' System Engineer,  Information Technology 1991  – 1998 Universidad Nacional Experimental Politécnica 'Antonio José de Sucre' Bachelor's degree,  Systems Engineering 1991  – 1998 Universidad Nacional Experimental Politécnica 'Antonio José de Sucre' System Engineer,  Information Technology 1991  – 1998 Universidad Nacional Experimental Politécnica 'Antonio José de Sucre' System Engineer,  Information Technology 1991  – 1998 Universidad Nacional Experimental Politécnica 'Antonio José de Sucre' System Engineer,  Information Technology 1991  – 1998 Universidad Nacional Experimental Politécnica 'Antonio José de Sucre' Bachelor's degree,  Systems Engineering 1991  – 1998 Universidad Nacional Experimental Politécnica 'Antonio José de Sucre' Bachelor's degree,  Systems Engineering 1991  – 1998 Universidad Nacional Experimental Politécnica 'Antonio José de Sucre' Bachelor's degree,  Systems Engineering 1991  – 1998 ", "Languages   Skills Skills     Honors & Awards ", "Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills VMware ESX Windows Server VMware Linux Microsoft Exchange Microsoft Certified... RedHat Firewalls Windows Operating Systems Virtualization ITIL Suse IT Service Management RHEL Software Installation Storage Area Networks IT Management IT Solutions PMI Dell PowerEdge Servers Cloud Computing Red Hat Linux Networking Integration Data Center Disaster Recovery Servers Microsoft SQL Server See 14+     See less Skills  VMware ESX Windows Server VMware Linux Microsoft Exchange Microsoft Certified... RedHat Firewalls Windows Operating Systems Virtualization ITIL Suse IT Service Management RHEL Software Installation Storage Area Networks IT Management IT Solutions PMI Dell PowerEdge Servers Cloud Computing Red Hat Linux Networking Integration Data Center Disaster Recovery Servers Microsoft SQL Server See 14+     See less VMware ESX Windows Server VMware Linux Microsoft Exchange Microsoft Certified... RedHat Firewalls Windows Operating Systems Virtualization ITIL Suse IT Service Management RHEL Software Installation Storage Area Networks IT Management IT Solutions PMI Dell PowerEdge Servers Cloud Computing Red Hat Linux Networking Integration Data Center Disaster Recovery Servers Microsoft SQL Server See 14+     See less VMware ESX Windows Server VMware Linux Microsoft Exchange Microsoft Certified... RedHat Firewalls Windows Operating Systems Virtualization ITIL Suse IT Service Management RHEL Software Installation Storage Area Networks IT Management IT Solutions PMI Dell PowerEdge Servers Cloud Computing Red Hat Linux Networking Integration Data Center Disaster Recovery Servers Microsoft SQL Server See 14+     See less Honors & Awards ", "Summary Praveen works in the IT field and brings passion, commitment, excellent communication, team building, client relationships and collaboration skills along with sound technical knowledge and business acumen. He has interacted with various levels of the client organization in relation to IT projects - from Chairman, CFO, CTO, VPs, Directors, BA, SE, Developers, System Testing, DBAs and Sysadmins and is comfortable in doing so.  \nCurrently Praveen is Delivery Manager at Wellpoint Inc. Account of IBM a health insurance company. \nPreviously Praveen worked at IBM/AT&T Account as a Deliver Manager/IT Architect, and has had various roles in the IT for the IBM/AT&T Account. He has had experience in IT Transformation exercise for Sales Domain as Sales Domain SME and IT Architect. He has managed projects as deliver manager especially where the scope of the Projects has been new or challenging. He has scoped numerous applications for retiring and successfully managed and lead projects from concept, solutioning, to Solution architecture, high level design, development and testing. Praveen has prepared numerous project proposals and presentations including Solution Architecture, IT Cost Estimates and Plan and helped assess projects/programs as high as (~ 24 Million) and long term programs as high as (~130+ Million). \nPrior to AT&T Account, Praveen has worked in PwC India as a Sr Consultant and been part of some interesting and challenging projects in Consumer Durables/Electronics, Telecom and Utilities industries and was on a fast track. \nPrior to PwC, Praveen worked as a business analyst at HCL Perot for Utility and Police sector and helped prepare project proposals. Work scope also involved setting up meetings with the CxOs and Charirmans of Utility companies for automated metering solutions and Commissioners of Police of various cities for Biometric solutions. Summary Praveen works in the IT field and brings passion, commitment, excellent communication, team building, client relationships and collaboration skills along with sound technical knowledge and business acumen. He has interacted with various levels of the client organization in relation to IT projects - from Chairman, CFO, CTO, VPs, Directors, BA, SE, Developers, System Testing, DBAs and Sysadmins and is comfortable in doing so.  \nCurrently Praveen is Delivery Manager at Wellpoint Inc. Account of IBM a health insurance company. \nPreviously Praveen worked at IBM/AT&T Account as a Deliver Manager/IT Architect, and has had various roles in the IT for the IBM/AT&T Account. He has had experience in IT Transformation exercise for Sales Domain as Sales Domain SME and IT Architect. He has managed projects as deliver manager especially where the scope of the Projects has been new or challenging. He has scoped numerous applications for retiring and successfully managed and lead projects from concept, solutioning, to Solution architecture, high level design, development and testing. Praveen has prepared numerous project proposals and presentations including Solution Architecture, IT Cost Estimates and Plan and helped assess projects/programs as high as (~ 24 Million) and long term programs as high as (~130+ Million). \nPrior to AT&T Account, Praveen has worked in PwC India as a Sr Consultant and been part of some interesting and challenging projects in Consumer Durables/Electronics, Telecom and Utilities industries and was on a fast track. \nPrior to PwC, Praveen worked as a business analyst at HCL Perot for Utility and Police sector and helped prepare project proposals. Work scope also involved setting up meetings with the CxOs and Charirmans of Utility companies for automated metering solutions and Commissioners of Police of various cities for Biometric solutions. Praveen works in the IT field and brings passion, commitment, excellent communication, team building, client relationships and collaboration skills along with sound technical knowledge and business acumen. He has interacted with various levels of the client organization in relation to IT projects - from Chairman, CFO, CTO, VPs, Directors, BA, SE, Developers, System Testing, DBAs and Sysadmins and is comfortable in doing so.  \nCurrently Praveen is Delivery Manager at Wellpoint Inc. Account of IBM a health insurance company. \nPreviously Praveen worked at IBM/AT&T Account as a Deliver Manager/IT Architect, and has had various roles in the IT for the IBM/AT&T Account. He has had experience in IT Transformation exercise for Sales Domain as Sales Domain SME and IT Architect. He has managed projects as deliver manager especially where the scope of the Projects has been new or challenging. He has scoped numerous applications for retiring and successfully managed and lead projects from concept, solutioning, to Solution architecture, high level design, development and testing. Praveen has prepared numerous project proposals and presentations including Solution Architecture, IT Cost Estimates and Plan and helped assess projects/programs as high as (~ 24 Million) and long term programs as high as (~130+ Million). \nPrior to AT&T Account, Praveen has worked in PwC India as a Sr Consultant and been part of some interesting and challenging projects in Consumer Durables/Electronics, Telecom and Utilities industries and was on a fast track. \nPrior to PwC, Praveen worked as a business analyst at HCL Perot for Utility and Police sector and helped prepare project proposals. Work scope also involved setting up meetings with the CxOs and Charirmans of Utility companies for automated metering solutions and Commissioners of Police of various cities for Biometric solutions. Praveen works in the IT field and brings passion, commitment, excellent communication, team building, client relationships and collaboration skills along with sound technical knowledge and business acumen. He has interacted with various levels of the client organization in relation to IT projects - from Chairman, CFO, CTO, VPs, Directors, BA, SE, Developers, System Testing, DBAs and Sysadmins and is comfortable in doing so.  \nCurrently Praveen is Delivery Manager at Wellpoint Inc. Account of IBM a health insurance company. \nPreviously Praveen worked at IBM/AT&T Account as a Deliver Manager/IT Architect, and has had various roles in the IT for the IBM/AT&T Account. He has had experience in IT Transformation exercise for Sales Domain as Sales Domain SME and IT Architect. He has managed projects as deliver manager especially where the scope of the Projects has been new or challenging. He has scoped numerous applications for retiring and successfully managed and lead projects from concept, solutioning, to Solution architecture, high level design, development and testing. Praveen has prepared numerous project proposals and presentations including Solution Architecture, IT Cost Estimates and Plan and helped assess projects/programs as high as (~ 24 Million) and long term programs as high as (~130+ Million). \nPrior to AT&T Account, Praveen has worked in PwC India as a Sr Consultant and been part of some interesting and challenging projects in Consumer Durables/Electronics, Telecom and Utilities industries and was on a fast track. \nPrior to PwC, Praveen worked as a business analyst at HCL Perot for Utility and Police sector and helped prepare project proposals. Work scope also involved setting up meetings with the CxOs and Charirmans of Utility companies for automated metering solutions and Commissioners of Police of various cities for Biometric solutions. Experience AT&T (Client) - Solution Architect IBM March 2015  – Present (6 months) NJ Lead innovative solutions using various means and methods including mobile, cognitive technologies like Watson Explorer, reports, analytics, and Social media. \n \nResponsible for conceptualizing and evangelizing the solutions within the Sales Domain teams.  Delivery Manager IBM/Well Point Inc May 2013  –  February 2015  (1 year 10 months) Wellpoint Inc. (WPI) is a leading provider of Health care insurance and services in the US. Praveen is involved in delivery of hypercritical RIMS work in the health insurance Claims Domain. Team spread across US, India and Philippines with a global delivery model. Delivery model is monthly based with over 80+ BAO practitioners involved at the peak. Implemented at least a release a month since June 2013. Participated in process discussions with client for the Claims RIMs team. Handled critical work for meeting tough deadlines for Affordable Care Act (ACA) alias Obama care. \nTeam Building from taking in new members to guiding on the complex on-boarding steps involved in the health care industry and the way to streamline the same for the team \nHandled directly the project management of some of the more challenging projects. Deliver Manager/IT Solutions Architect IBM/AT&T September 2012  –  April 2013  (8 months) NJ Involved in Solution Architecture and Guidance, Project Management and Delivery Management, Client negotiations on scope, features, Status Reporting for ROME team. Handled all team issues including work and scope concerns. Helped build team to perform together for one of the first of its type project in AT&T to deploy eCRM (ROME) application data onto iPAD based sales funnel solutions. \n•\tManaged and guided Performance Monitoring and Tuning exercise on Optier - a packaged software. \n•\tSolution involved fine tuning flows and changing them to enable web-services based interaction with iPAD device from ROME (CRM) via a Common Services Integration (CSI)/M (iPAD) applications. IT Transformation Architect/Sales Domain SME and Lead - AAR IBM/AT&T February 2012  –  January 2013  (1 year) NJ As an AT&T Sales Domain SME, I was responsible in coming up with and assessing few multi-year (3-5) plans in IT Transformation and application rationalization for AT&T's Sales Domain Applications. The scope of work covered Funnel, Contracting, and DPP (Design, Price, Propose) application consolidation assessment using IBM proprietory methodologies and was scoped for Sales part at more than $40 Million and over 30 long standing applications, slotting the work into different years and assessing functionality and effort estimate for application rationalization alone.  \nThe work also involved brainstorming transformational approaches with other IBM Experts and SME for the AT&T Account and assessing the implementation and the high level plan/approach for the Sales Domain. The Tranformational approaches that I was part of directly focused among other things on APIs, IT Flows rationalization, exploring Open UI and integration with Mobile apps/tablets and Server/Image Consolidation assessment. \nWe were part of a larger cross AT&T IBM team containing Service Delivery and Ordering and Billing Domains Deliver Manager/IT Solutions Architect – CPE Resale IBM/AT&T March 2010  –  February 2012  (2 years) NJ Praveen scoped the Customer Premise Equipement Project, Proposal and Presentation, IT Solution Architecture, Client negotiations on requirements and Scope. \nManaged the deliver and lead the project for highly critical initial application build release and including first couple of data migration releases for 4 Contracting applications. \nInvolved Contracts, Order Data Capture (MDS) and Triggers. Interface with Financial Systems and downstream Ordering Systems as well as Billing Gateways. Maintained and Created Account Hierachy Nodes and various flows. Spread over 4 main releases and numerous smaller releases. Over + 2 Million in all over the period Project Manager/Project Lead/IT Solutions Architect - ABSCON IBM/AT&T April 2009  –  February 2010  (11 months) NJ Praveen scoped the project, did Client Presentations and Initial Project Negotiations. \nLead and managed the initial few deliveries of the application. The initial release had a team of 40+ in over 1600+ requirements solutioning, design, and implementation and was over $2.5 Million. The program till 1st quarter of 2013 has involved over +$ 13 Million. \nPraveen also provided Critical Solution Architecture in mimicking an established COTS package (EMPTORIS) for contract generation and integration with MS WORD. Solution had Redlining, Stare and Compare and Custom Contract negotiations and changes. It was table driven, wizards and template generation with 100+ templates in the first release itself. In one release based on the architecture over 100+ Contract templates for ABN Express was deployed administratively without code change! There was Integration with ASPOSE to generate contracts. It was deployed in 1 big release along with Data Migration Feb ’10.  \nParticipated in Design and Implementation in first few releases actively.  \nI continued to guide/coach team on ways to tune data flows and processing, multiple sequencing logic to cut down time to meet the needs of the tablet/iPAD world as well as general project problems years after moving out of the application. Project Lead/IT Solutions Architect/SE - CDR IBM/AT&T April 2009  –  October 2009  (7 months) NJ •\tScoped project, High Level Design, Detailed Data Analysis and Architecture, Object Model \n•\tProject Involved migration around 2 million contract records from a legacy application (ECATS) into target eCRM (Contracts Data Repository) module that was built ground up to handle the migration and the features and needs of the client Project Lead/IT Solutions Architect/Lead SE – Numerous Projects IBM Global Services December 2005  –  March 2009  (3 years 4 months) NJ Lead Numerous Projects from IT Architecture/SE and Project Lead perspective from SR/WR (Workflows) a Global Sales Enablement (GSE) program which was 165 ftps (+$1.2 Million) in initial release that handled Sales Domain workflows and approvals. Also worked on other modules, functionality including, Opportunity, Credit Check, Account and Billing Hierarchy Creation, Future Method of Operations flow changes to Sales Funnel related projects. IT Release Manager AT&T 2004  –  2005  (1 year) Middletown Handled IT Release Management for the eCRM application for over 10 releases. The tasks involved Top Management Reporting, dealing with Production Support Organization (Bearing Point for AT&T), with AT&T IT Stakeholders and executives in certifying the code, getting quality gates assigned off from development and testing managers, preparing Install Day Timelines and Backout plans. Also included code audits and package audit prior to hand over to production support team. Release Daya User Confirmation Testing handling and dev team co-ordination. As part of this work, Unix patch fixes, Oracle DB upgrade from 9.2.0.2 to 9.2.05, Oracle Redo Log Files Upgrades, Hardware upgrade -additional v490 multithreading/multiprocessor servers, Post Production and User Testing Issue Resolution and Co-Ordination with development teams / Project Management/Program Management. One of the key achievement was establishing and ensuring smooth relationship with different stakeholders and releases Project Lead/IT Solutions Architect/Lead SE – Numerous Projects AT&T 2001  –  September 2004  (3 years) NJ Lead numerous large and small projects over this period including: - \n•\tFirst AT&T wide Sales Funnel Tool eCRM from over hundreds of desktop tools, excel sheet apps, Access Apps, BAAN AFO on to Oracle eCRM 11i platform. \n•\tData Mart using Oracle Discoverer – Designed the first Data Model and complied a list of about 180 reports by Domestic, Most of World, Alliance. Wrote a few reports \n•\tLed migration of Oracle eCRM to Siebel CRM Sr Consultant Solix Technologies 2000  –  2001  (1 year) San Francisco Bay Area Consulted with various companies in the bay area from JDS Uniphase, Advantest, HDS. Involved in various Oracle modules from eCRM, ERP, iStore. Functional Areas involved Finance, CRM, Web Store(iStore), and Manufacturing Sr Consultant PwC February 1998  –  June 2000  (2 years 5 months) India •\tPrototype build involving Inventory, PO, GL, Project Accounting, AP, OE and AR  \n•\tThe project commissioning, budgeting scenario \n•\tResponsible for smooth functioning of PO, INV, and relevant setups in OE and AP / AR. \n•\tHandled Demo and requirements fitting for PO, INV and OE. Relevant parts of AR and AP with multiple user groups (Over 25 demos and meetings) \n•\tScoping, Proposal and Presentations to the client \n \nDesign for a Large Telecom Implementation. \nImplementation for a leading Indian, consumer durables company – 50 locations. One of the most complex, implementations in South Asia. Distributed computing environment with data transfer through replication via custom tables on daily basis.  \n•\tDesigned & Set-Up INV. Participated in the roll-out in the branches. (5 SITES).  \n•\tIn the final site Praveen was responsible to setup all the modules as well as match the legacy system accounts and ORACLE APPS. Accounts. Post production support \n•\tPrepared a White Paper for the National IT Task Force on IT Education Business Analyst/Account Executive HCL Perot May 1996  –  January 1998  (1 year 9 months) New Delhi Area, India Prepared Technical and Financial proposals for Automatic Remote Metering projects in the Power Sector. Analysis of different customer segments and Indian needs in the Power Sector. Extensive interaction with clients at all levels from Chairmen, to CFOs and CTOs and department heads to market the ‘new to India’, idea. Proposals and Client meetings with Police Heads for Biometric Solutions, involved in meeting and proposing solutions to Commisioners of Police, and others. \nClient relationship manager for FM and IT consultancy projects AT&T (Client) - Solution Architect IBM March 2015  – Present (6 months) NJ Lead innovative solutions using various means and methods including mobile, cognitive technologies like Watson Explorer, reports, analytics, and Social media. \n \nResponsible for conceptualizing and evangelizing the solutions within the Sales Domain teams.  AT&T (Client) - Solution Architect IBM March 2015  – Present (6 months) NJ Lead innovative solutions using various means and methods including mobile, cognitive technologies like Watson Explorer, reports, analytics, and Social media. \n \nResponsible for conceptualizing and evangelizing the solutions within the Sales Domain teams.  Delivery Manager IBM/Well Point Inc May 2013  –  February 2015  (1 year 10 months) Wellpoint Inc. (WPI) is a leading provider of Health care insurance and services in the US. Praveen is involved in delivery of hypercritical RIMS work in the health insurance Claims Domain. Team spread across US, India and Philippines with a global delivery model. Delivery model is monthly based with over 80+ BAO practitioners involved at the peak. Implemented at least a release a month since June 2013. Participated in process discussions with client for the Claims RIMs team. Handled critical work for meeting tough deadlines for Affordable Care Act (ACA) alias Obama care. \nTeam Building from taking in new members to guiding on the complex on-boarding steps involved in the health care industry and the way to streamline the same for the team \nHandled directly the project management of some of the more challenging projects. Delivery Manager IBM/Well Point Inc May 2013  –  February 2015  (1 year 10 months) Wellpoint Inc. (WPI) is a leading provider of Health care insurance and services in the US. Praveen is involved in delivery of hypercritical RIMS work in the health insurance Claims Domain. Team spread across US, India and Philippines with a global delivery model. Delivery model is monthly based with over 80+ BAO practitioners involved at the peak. Implemented at least a release a month since June 2013. Participated in process discussions with client for the Claims RIMs team. Handled critical work for meeting tough deadlines for Affordable Care Act (ACA) alias Obama care. \nTeam Building from taking in new members to guiding on the complex on-boarding steps involved in the health care industry and the way to streamline the same for the team \nHandled directly the project management of some of the more challenging projects. Deliver Manager/IT Solutions Architect IBM/AT&T September 2012  –  April 2013  (8 months) NJ Involved in Solution Architecture and Guidance, Project Management and Delivery Management, Client negotiations on scope, features, Status Reporting for ROME team. Handled all team issues including work and scope concerns. Helped build team to perform together for one of the first of its type project in AT&T to deploy eCRM (ROME) application data onto iPAD based sales funnel solutions. \n•\tManaged and guided Performance Monitoring and Tuning exercise on Optier - a packaged software. \n•\tSolution involved fine tuning flows and changing them to enable web-services based interaction with iPAD device from ROME (CRM) via a Common Services Integration (CSI)/M (iPAD) applications. Deliver Manager/IT Solutions Architect IBM/AT&T September 2012  –  April 2013  (8 months) NJ Involved in Solution Architecture and Guidance, Project Management and Delivery Management, Client negotiations on scope, features, Status Reporting for ROME team. Handled all team issues including work and scope concerns. Helped build team to perform together for one of the first of its type project in AT&T to deploy eCRM (ROME) application data onto iPAD based sales funnel solutions. \n•\tManaged and guided Performance Monitoring and Tuning exercise on Optier - a packaged software. \n•\tSolution involved fine tuning flows and changing them to enable web-services based interaction with iPAD device from ROME (CRM) via a Common Services Integration (CSI)/M (iPAD) applications. IT Transformation Architect/Sales Domain SME and Lead - AAR IBM/AT&T February 2012  –  January 2013  (1 year) NJ As an AT&T Sales Domain SME, I was responsible in coming up with and assessing few multi-year (3-5) plans in IT Transformation and application rationalization for AT&T's Sales Domain Applications. The scope of work covered Funnel, Contracting, and DPP (Design, Price, Propose) application consolidation assessment using IBM proprietory methodologies and was scoped for Sales part at more than $40 Million and over 30 long standing applications, slotting the work into different years and assessing functionality and effort estimate for application rationalization alone.  \nThe work also involved brainstorming transformational approaches with other IBM Experts and SME for the AT&T Account and assessing the implementation and the high level plan/approach for the Sales Domain. The Tranformational approaches that I was part of directly focused among other things on APIs, IT Flows rationalization, exploring Open UI and integration with Mobile apps/tablets and Server/Image Consolidation assessment. \nWe were part of a larger cross AT&T IBM team containing Service Delivery and Ordering and Billing Domains IT Transformation Architect/Sales Domain SME and Lead - AAR IBM/AT&T February 2012  –  January 2013  (1 year) NJ As an AT&T Sales Domain SME, I was responsible in coming up with and assessing few multi-year (3-5) plans in IT Transformation and application rationalization for AT&T's Sales Domain Applications. The scope of work covered Funnel, Contracting, and DPP (Design, Price, Propose) application consolidation assessment using IBM proprietory methodologies and was scoped for Sales part at more than $40 Million and over 30 long standing applications, slotting the work into different years and assessing functionality and effort estimate for application rationalization alone.  \nThe work also involved brainstorming transformational approaches with other IBM Experts and SME for the AT&T Account and assessing the implementation and the high level plan/approach for the Sales Domain. The Tranformational approaches that I was part of directly focused among other things on APIs, IT Flows rationalization, exploring Open UI and integration with Mobile apps/tablets and Server/Image Consolidation assessment. \nWe were part of a larger cross AT&T IBM team containing Service Delivery and Ordering and Billing Domains Deliver Manager/IT Solutions Architect – CPE Resale IBM/AT&T March 2010  –  February 2012  (2 years) NJ Praveen scoped the Customer Premise Equipement Project, Proposal and Presentation, IT Solution Architecture, Client negotiations on requirements and Scope. \nManaged the deliver and lead the project for highly critical initial application build release and including first couple of data migration releases for 4 Contracting applications. \nInvolved Contracts, Order Data Capture (MDS) and Triggers. Interface with Financial Systems and downstream Ordering Systems as well as Billing Gateways. Maintained and Created Account Hierachy Nodes and various flows. Spread over 4 main releases and numerous smaller releases. Over + 2 Million in all over the period Deliver Manager/IT Solutions Architect – CPE Resale IBM/AT&T March 2010  –  February 2012  (2 years) NJ Praveen scoped the Customer Premise Equipement Project, Proposal and Presentation, IT Solution Architecture, Client negotiations on requirements and Scope. \nManaged the deliver and lead the project for highly critical initial application build release and including first couple of data migration releases for 4 Contracting applications. \nInvolved Contracts, Order Data Capture (MDS) and Triggers. Interface with Financial Systems and downstream Ordering Systems as well as Billing Gateways. Maintained and Created Account Hierachy Nodes and various flows. Spread over 4 main releases and numerous smaller releases. Over + 2 Million in all over the period Project Manager/Project Lead/IT Solutions Architect - ABSCON IBM/AT&T April 2009  –  February 2010  (11 months) NJ Praveen scoped the project, did Client Presentations and Initial Project Negotiations. \nLead and managed the initial few deliveries of the application. The initial release had a team of 40+ in over 1600+ requirements solutioning, design, and implementation and was over $2.5 Million. The program till 1st quarter of 2013 has involved over +$ 13 Million. \nPraveen also provided Critical Solution Architecture in mimicking an established COTS package (EMPTORIS) for contract generation and integration with MS WORD. Solution had Redlining, Stare and Compare and Custom Contract negotiations and changes. It was table driven, wizards and template generation with 100+ templates in the first release itself. In one release based on the architecture over 100+ Contract templates for ABN Express was deployed administratively without code change! There was Integration with ASPOSE to generate contracts. It was deployed in 1 big release along with Data Migration Feb ’10.  \nParticipated in Design and Implementation in first few releases actively.  \nI continued to guide/coach team on ways to tune data flows and processing, multiple sequencing logic to cut down time to meet the needs of the tablet/iPAD world as well as general project problems years after moving out of the application. Project Manager/Project Lead/IT Solutions Architect - ABSCON IBM/AT&T April 2009  –  February 2010  (11 months) NJ Praveen scoped the project, did Client Presentations and Initial Project Negotiations. \nLead and managed the initial few deliveries of the application. The initial release had a team of 40+ in over 1600+ requirements solutioning, design, and implementation and was over $2.5 Million. The program till 1st quarter of 2013 has involved over +$ 13 Million. \nPraveen also provided Critical Solution Architecture in mimicking an established COTS package (EMPTORIS) for contract generation and integration with MS WORD. Solution had Redlining, Stare and Compare and Custom Contract negotiations and changes. It was table driven, wizards and template generation with 100+ templates in the first release itself. In one release based on the architecture over 100+ Contract templates for ABN Express was deployed administratively without code change! There was Integration with ASPOSE to generate contracts. It was deployed in 1 big release along with Data Migration Feb ’10.  \nParticipated in Design and Implementation in first few releases actively.  \nI continued to guide/coach team on ways to tune data flows and processing, multiple sequencing logic to cut down time to meet the needs of the tablet/iPAD world as well as general project problems years after moving out of the application. Project Lead/IT Solutions Architect/SE - CDR IBM/AT&T April 2009  –  October 2009  (7 months) NJ •\tScoped project, High Level Design, Detailed Data Analysis and Architecture, Object Model \n•\tProject Involved migration around 2 million contract records from a legacy application (ECATS) into target eCRM (Contracts Data Repository) module that was built ground up to handle the migration and the features and needs of the client Project Lead/IT Solutions Architect/SE - CDR IBM/AT&T April 2009  –  October 2009  (7 months) NJ •\tScoped project, High Level Design, Detailed Data Analysis and Architecture, Object Model \n•\tProject Involved migration around 2 million contract records from a legacy application (ECATS) into target eCRM (Contracts Data Repository) module that was built ground up to handle the migration and the features and needs of the client Project Lead/IT Solutions Architect/Lead SE – Numerous Projects IBM Global Services December 2005  –  March 2009  (3 years 4 months) NJ Lead Numerous Projects from IT Architecture/SE and Project Lead perspective from SR/WR (Workflows) a Global Sales Enablement (GSE) program which was 165 ftps (+$1.2 Million) in initial release that handled Sales Domain workflows and approvals. Also worked on other modules, functionality including, Opportunity, Credit Check, Account and Billing Hierarchy Creation, Future Method of Operations flow changes to Sales Funnel related projects. Project Lead/IT Solutions Architect/Lead SE – Numerous Projects IBM Global Services December 2005  –  March 2009  (3 years 4 months) NJ Lead Numerous Projects from IT Architecture/SE and Project Lead perspective from SR/WR (Workflows) a Global Sales Enablement (GSE) program which was 165 ftps (+$1.2 Million) in initial release that handled Sales Domain workflows and approvals. Also worked on other modules, functionality including, Opportunity, Credit Check, Account and Billing Hierarchy Creation, Future Method of Operations flow changes to Sales Funnel related projects. IT Release Manager AT&T 2004  –  2005  (1 year) Middletown Handled IT Release Management for the eCRM application for over 10 releases. The tasks involved Top Management Reporting, dealing with Production Support Organization (Bearing Point for AT&T), with AT&T IT Stakeholders and executives in certifying the code, getting quality gates assigned off from development and testing managers, preparing Install Day Timelines and Backout plans. Also included code audits and package audit prior to hand over to production support team. Release Daya User Confirmation Testing handling and dev team co-ordination. As part of this work, Unix patch fixes, Oracle DB upgrade from 9.2.0.2 to 9.2.05, Oracle Redo Log Files Upgrades, Hardware upgrade -additional v490 multithreading/multiprocessor servers, Post Production and User Testing Issue Resolution and Co-Ordination with development teams / Project Management/Program Management. One of the key achievement was establishing and ensuring smooth relationship with different stakeholders and releases IT Release Manager AT&T 2004  –  2005  (1 year) Middletown Handled IT Release Management for the eCRM application for over 10 releases. The tasks involved Top Management Reporting, dealing with Production Support Organization (Bearing Point for AT&T), with AT&T IT Stakeholders and executives in certifying the code, getting quality gates assigned off from development and testing managers, preparing Install Day Timelines and Backout plans. Also included code audits and package audit prior to hand over to production support team. Release Daya User Confirmation Testing handling and dev team co-ordination. As part of this work, Unix patch fixes, Oracle DB upgrade from 9.2.0.2 to 9.2.05, Oracle Redo Log Files Upgrades, Hardware upgrade -additional v490 multithreading/multiprocessor servers, Post Production and User Testing Issue Resolution and Co-Ordination with development teams / Project Management/Program Management. One of the key achievement was establishing and ensuring smooth relationship with different stakeholders and releases Project Lead/IT Solutions Architect/Lead SE – Numerous Projects AT&T 2001  –  September 2004  (3 years) NJ Lead numerous large and small projects over this period including: - \n•\tFirst AT&T wide Sales Funnel Tool eCRM from over hundreds of desktop tools, excel sheet apps, Access Apps, BAAN AFO on to Oracle eCRM 11i platform. \n•\tData Mart using Oracle Discoverer – Designed the first Data Model and complied a list of about 180 reports by Domestic, Most of World, Alliance. Wrote a few reports \n•\tLed migration of Oracle eCRM to Siebel CRM Project Lead/IT Solutions Architect/Lead SE – Numerous Projects AT&T 2001  –  September 2004  (3 years) NJ Lead numerous large and small projects over this period including: - \n•\tFirst AT&T wide Sales Funnel Tool eCRM from over hundreds of desktop tools, excel sheet apps, Access Apps, BAAN AFO on to Oracle eCRM 11i platform. \n•\tData Mart using Oracle Discoverer – Designed the first Data Model and complied a list of about 180 reports by Domestic, Most of World, Alliance. Wrote a few reports \n•\tLed migration of Oracle eCRM to Siebel CRM Sr Consultant Solix Technologies 2000  –  2001  (1 year) San Francisco Bay Area Consulted with various companies in the bay area from JDS Uniphase, Advantest, HDS. Involved in various Oracle modules from eCRM, ERP, iStore. Functional Areas involved Finance, CRM, Web Store(iStore), and Manufacturing Sr Consultant Solix Technologies 2000  –  2001  (1 year) San Francisco Bay Area Consulted with various companies in the bay area from JDS Uniphase, Advantest, HDS. Involved in various Oracle modules from eCRM, ERP, iStore. Functional Areas involved Finance, CRM, Web Store(iStore), and Manufacturing Sr Consultant PwC February 1998  –  June 2000  (2 years 5 months) India •\tPrototype build involving Inventory, PO, GL, Project Accounting, AP, OE and AR  \n•\tThe project commissioning, budgeting scenario \n•\tResponsible for smooth functioning of PO, INV, and relevant setups in OE and AP / AR. \n•\tHandled Demo and requirements fitting for PO, INV and OE. Relevant parts of AR and AP with multiple user groups (Over 25 demos and meetings) \n•\tScoping, Proposal and Presentations to the client \n \nDesign for a Large Telecom Implementation. \nImplementation for a leading Indian, consumer durables company – 50 locations. One of the most complex, implementations in South Asia. Distributed computing environment with data transfer through replication via custom tables on daily basis.  \n•\tDesigned & Set-Up INV. Participated in the roll-out in the branches. (5 SITES).  \n•\tIn the final site Praveen was responsible to setup all the modules as well as match the legacy system accounts and ORACLE APPS. Accounts. Post production support \n•\tPrepared a White Paper for the National IT Task Force on IT Education Sr Consultant PwC February 1998  –  June 2000  (2 years 5 months) India •\tPrototype build involving Inventory, PO, GL, Project Accounting, AP, OE and AR  \n•\tThe project commissioning, budgeting scenario \n•\tResponsible for smooth functioning of PO, INV, and relevant setups in OE and AP / AR. \n•\tHandled Demo and requirements fitting for PO, INV and OE. Relevant parts of AR and AP with multiple user groups (Over 25 demos and meetings) \n•\tScoping, Proposal and Presentations to the client \n \nDesign for a Large Telecom Implementation. \nImplementation for a leading Indian, consumer durables company – 50 locations. One of the most complex, implementations in South Asia. Distributed computing environment with data transfer through replication via custom tables on daily basis.  \n•\tDesigned & Set-Up INV. Participated in the roll-out in the branches. (5 SITES).  \n•\tIn the final site Praveen was responsible to setup all the modules as well as match the legacy system accounts and ORACLE APPS. Accounts. Post production support \n•\tPrepared a White Paper for the National IT Task Force on IT Education Business Analyst/Account Executive HCL Perot May 1996  –  January 1998  (1 year 9 months) New Delhi Area, India Prepared Technical and Financial proposals for Automatic Remote Metering projects in the Power Sector. Analysis of different customer segments and Indian needs in the Power Sector. Extensive interaction with clients at all levels from Chairmen, to CFOs and CTOs and department heads to market the ‘new to India’, idea. Proposals and Client meetings with Police Heads for Biometric Solutions, involved in meeting and proposing solutions to Commisioners of Police, and others. \nClient relationship manager for FM and IT consultancy projects Business Analyst/Account Executive HCL Perot May 1996  –  January 1998  (1 year 9 months) New Delhi Area, India Prepared Technical and Financial proposals for Automatic Remote Metering projects in the Power Sector. Analysis of different customer segments and Indian needs in the Power Sector. Extensive interaction with clients at all levels from Chairmen, to CFOs and CTOs and department heads to market the ‘new to India’, idea. Proposals and Client meetings with Police Heads for Biometric Solutions, involved in meeting and proposing solutions to Commisioners of Police, and others. \nClient relationship manager for FM and IT consultancy projects Skills Solution Architecture Oracle CRM ERP Unix IT Transformation... Project Delivery SOA Project Management Agile & Waterfall... Telecom Sales Domain SME PRM Siebel Cloud Computing Integration Partner Management Mobile Devices Web Services Requirements Analysis IT Strategy Software Project... Management SDLC Business Analysis See 9+     See less Skills  Solution Architecture Oracle CRM ERP Unix IT Transformation... Project Delivery SOA Project Management Agile & Waterfall... Telecom Sales Domain SME PRM Siebel Cloud Computing Integration Partner Management Mobile Devices Web Services Requirements Analysis IT Strategy Software Project... Management SDLC Business Analysis See 9+     See less Solution Architecture Oracle CRM ERP Unix IT Transformation... Project Delivery SOA Project Management Agile & Waterfall... Telecom Sales Domain SME PRM Siebel Cloud Computing Integration Partner Management Mobile Devices Web Services Requirements Analysis IT Strategy Software Project... Management SDLC Business Analysis See 9+     See less Solution Architecture Oracle CRM ERP Unix IT Transformation... Project Delivery SOA Project Management Agile & Waterfall... Telecom Sales Domain SME PRM Siebel Cloud Computing Integration Partner Management Mobile Devices Web Services Requirements Analysis IT Strategy Software Project... Management SDLC Business Analysis See 9+     See less Education Indian Institute of Management, Calcutta Master of Business Administration (MBA),  Marketing/Finance 1994  – 1996 University of Mysore BE,  Electronics and Communications 1988  – 1992 Activities and Societies:  IEEE MES College, Bangalore PUC,  PCMB 1986  – 1988 Bishop Cottons Boys School - Bangalore 10th 1979  – 1986 Activities and Societies:  Philately Club Indian Institute of Management, Calcutta Master of Business Administration (MBA),  Marketing/Finance 1994  – 1996 Indian Institute of Management, Calcutta Master of Business Administration (MBA),  Marketing/Finance 1994  – 1996 Indian Institute of Management, Calcutta Master of Business Administration (MBA),  Marketing/Finance 1994  – 1996 University of Mysore BE,  Electronics and Communications 1988  – 1992 Activities and Societies:  IEEE University of Mysore BE,  Electronics and Communications 1988  – 1992 Activities and Societies:  IEEE University of Mysore BE,  Electronics and Communications 1988  – 1992 Activities and Societies:  IEEE MES College, Bangalore PUC,  PCMB 1986  – 1988 MES College, Bangalore PUC,  PCMB 1986  – 1988 MES College, Bangalore PUC,  PCMB 1986  – 1988 Bishop Cottons Boys School - Bangalore 10th 1979  – 1986 Activities and Societies:  Philately Club Bishop Cottons Boys School - Bangalore 10th 1979  – 1986 Activities and Societies:  Philately Club Bishop Cottons Boys School - Bangalore 10th 1979  – 1986 Activities and Societies:  Philately Club Honors & Awards Additional Honors & Awards Eminence and Excellence Award, IBM AT&T Account - 2011 Additional Honors & Awards Eminence and Excellence Award, IBM AT&T Account - 2011 Additional Honors & Awards Eminence and Excellence Award, IBM AT&T Account - 2011 Additional Honors & Awards Eminence and Excellence Award, IBM AT&T Account - 2011 "]}