{"position": "Lead Development Representative", "company": "IBM", "profiles": ["Languages   Skills Social Services Crisis Intervention Research Recruiting Leadership Program Management Training Adolescents Cloud Computing Time Management Business Development Lead Generation Account Management Skills  Social Services Crisis Intervention Research Recruiting Leadership Program Management Training Adolescents Cloud Computing Time Management Business Development Lead Generation Account Management Social Services Crisis Intervention Research Recruiting Leadership Program Management Training Adolescents Cloud Computing Time Management Business Development Lead Generation Account Management Social Services Crisis Intervention Research Recruiting Leadership Program Management Training Adolescents Cloud Computing Time Management Business Development Lead Generation Account Management Honors & Awards IBM Digital Sales All Star Award – Q1 2015 IBM Digital Sales Manager, Management Team May 2015 This award was presented for the overachievement across all metrics during the 1st Quarter of 2015.  Manager’s Choice Award - 2015 Debra Cross, BUE, Business Strategies & Communication April 2015 This award was given for my efforts to demonstrate the practices of: Listening for Customer/Business Needs and Envisioning the Future.  \n The Unite To Get It Done Award - 2015 The IBM Executive Level Management Team March 2015 This award was given for my efforts and performance during a major sales & delivery campaign project.  Manager's Choice Award Management November 2014 This award was given for dedication among the LDR team, the Business Analytics brand and the IBM organization as a whole.  \n Third Quarter Closer Award Management October 2013 This award was given for sales & delivery excellence/overachievement across all metrics, as well as a top tier finishing performance within the brand.  Additional Honors & Awards 2006 Atlantic 10 Conference All Academic Team IBM Digital Sales All Star Award – Q1 2015 IBM Digital Sales Manager, Management Team May 2015 This award was presented for the overachievement across all metrics during the 1st Quarter of 2015.  IBM Digital Sales All Star Award – Q1 2015 IBM Digital Sales Manager, Management Team May 2015 This award was presented for the overachievement across all metrics during the 1st Quarter of 2015.  IBM Digital Sales All Star Award – Q1 2015 IBM Digital Sales Manager, Management Team May 2015 This award was presented for the overachievement across all metrics during the 1st Quarter of 2015.  Manager’s Choice Award - 2015 Debra Cross, BUE, Business Strategies & Communication April 2015 This award was given for my efforts to demonstrate the practices of: Listening for Customer/Business Needs and Envisioning the Future.  \n Manager’s Choice Award - 2015 Debra Cross, BUE, Business Strategies & Communication April 2015 This award was given for my efforts to demonstrate the practices of: Listening for Customer/Business Needs and Envisioning the Future.  \n Manager’s Choice Award - 2015 Debra Cross, BUE, Business Strategies & Communication April 2015 This award was given for my efforts to demonstrate the practices of: Listening for Customer/Business Needs and Envisioning the Future.  \n The Unite To Get It Done Award - 2015 The IBM Executive Level Management Team March 2015 This award was given for my efforts and performance during a major sales & delivery campaign project.  The Unite To Get It Done Award - 2015 The IBM Executive Level Management Team March 2015 This award was given for my efforts and performance during a major sales & delivery campaign project.  The Unite To Get It Done Award - 2015 The IBM Executive Level Management Team March 2015 This award was given for my efforts and performance during a major sales & delivery campaign project.  Manager's Choice Award Management November 2014 This award was given for dedication among the LDR team, the Business Analytics brand and the IBM organization as a whole.  \n Manager's Choice Award Management November 2014 This award was given for dedication among the LDR team, the Business Analytics brand and the IBM organization as a whole.  \n Manager's Choice Award Management November 2014 This award was given for dedication among the LDR team, the Business Analytics brand and the IBM organization as a whole.  \n Third Quarter Closer Award Management October 2013 This award was given for sales & delivery excellence/overachievement across all metrics, as well as a top tier finishing performance within the brand.  Third Quarter Closer Award Management October 2013 This award was given for sales & delivery excellence/overachievement across all metrics, as well as a top tier finishing performance within the brand.  Third Quarter Closer Award Management October 2013 This award was given for sales & delivery excellence/overachievement across all metrics, as well as a top tier finishing performance within the brand.  Additional Honors & Awards 2006 Atlantic 10 Conference All Academic Team Additional Honors & Awards 2006 Atlantic 10 Conference All Academic Team Additional Honors & Awards 2006 Atlantic 10 Conference All Academic Team ", "Summary Emprendedor, apasionado con la vida, con el propósito de buscar la excelencia personal para contribuir con el bienestar de la comunidad. Valores: Dios, Familia y libertad personal. Summary Emprendedor, apasionado con la vida, con el propósito de buscar la excelencia personal para contribuir con el bienestar de la comunidad. Valores: Dios, Familia y libertad personal. Emprendedor, apasionado con la vida, con el propósito de buscar la excelencia personal para contribuir con el bienestar de la comunidad. Valores: Dios, Familia y libertad personal. Emprendedor, apasionado con la vida, con el propósito de buscar la excelencia personal para contribuir con el bienestar de la comunidad. Valores: Dios, Familia y libertad personal. Experience Lead Development Representative - IBM Systems Hardware, Spanish South America IBM April 2014  – Present (1 year 5 months) Colombia Lead Development Representative - IBM Systems Hardware, Spanish South America IBM April 2014  – Present (1 year 5 months) Colombia Lead Development Representative - IBM Systems Hardware, Spanish South America IBM April 2014  – Present (1 year 5 months) Colombia Languages   Skills Skills     Honors & Awards ", "Summary A self-motivated and professional seller with successful track record to achieve the quota. Recognized as one of the top performers of the team, have consistently received different sales awards (Rep of The Quarter, All Star Award, Closing Award, Sales Eminence Award)  \nA Sales Profession who dedicates to Client's Success. Understand customer needs, IBM capabilities and solutions, focus to provide client value \nAn Innovative Team player. Knowledgeable of IBM Sales Tools and Process. Always looking for the ways to improve productivity and efficiency \n \nIf you'd Like to learn more about IBM Product and Solutions, visit my Rep Page and chat with me today: http://www.ibm.com/myrep/sunnyxu Summary A self-motivated and professional seller with successful track record to achieve the quota. Recognized as one of the top performers of the team, have consistently received different sales awards (Rep of The Quarter, All Star Award, Closing Award, Sales Eminence Award)  \nA Sales Profession who dedicates to Client's Success. Understand customer needs, IBM capabilities and solutions, focus to provide client value \nAn Innovative Team player. Knowledgeable of IBM Sales Tools and Process. Always looking for the ways to improve productivity and efficiency \n \nIf you'd Like to learn more about IBM Product and Solutions, visit my Rep Page and chat with me today: http://www.ibm.com/myrep/sunnyxu A self-motivated and professional seller with successful track record to achieve the quota. Recognized as one of the top performers of the team, have consistently received different sales awards (Rep of The Quarter, All Star Award, Closing Award, Sales Eminence Award)  \nA Sales Profession who dedicates to Client's Success. Understand customer needs, IBM capabilities and solutions, focus to provide client value \nAn Innovative Team player. Knowledgeable of IBM Sales Tools and Process. Always looking for the ways to improve productivity and efficiency \n \nIf you'd Like to learn more about IBM Product and Solutions, visit my Rep Page and chat with me today: http://www.ibm.com/myrep/sunnyxu A self-motivated and professional seller with successful track record to achieve the quota. Recognized as one of the top performers of the team, have consistently received different sales awards (Rep of The Quarter, All Star Award, Closing Award, Sales Eminence Award)  \nA Sales Profession who dedicates to Client's Success. Understand customer needs, IBM capabilities and solutions, focus to provide client value \nAn Innovative Team player. Knowledgeable of IBM Sales Tools and Process. Always looking for the ways to improve productivity and efficiency \n \nIf you'd Like to learn more about IBM Product and Solutions, visit my Rep Page and chat with me today: http://www.ibm.com/myrep/sunnyxu Experience Lead Development Representative IBM Canda June 2006  – Present (9 years 3 months) Toronto, Ontario, Canada •\tI have played 3 different Sales Roles in Lead Development BU, including Lead Generation Rep for Hardware; Cross Brand LDR; and Software LDR( Lotus, WebSphere and Cloud)  \n•\tDemonstrated solid Sales track records. Consistently achieved Sales Metrics \n•\tAs the LDR Territory Leader for Great West (Texas, Kansas, Oklahoma, Missouri, Colorado etc), established great interlock with WebSphere Field Sales, Inside Sales, and local Marketing team in the territory. \n•\tAssigned as the Hardware Sales focal of the team. Responsible to get the Hardware training for the team, mentor and encourage the team to cross sell hardware. \n \n•\tKnow how to cultivate great customer relationship, gain the customers’ trust and prospect for new opportunities.  \n•\tExperience to work with IBM Business Partners and IBM internal sales teams to progress the opportunities and drive wins.  \n•\tAdditional leadership includes being the Subject Matter Expert on Sales Tools and Sales Process. Provide leadership and help the other team members to solve the operation and process issues.  \n•\tWas LDR BU STAR Focal for Education Pillar \n \nConnect with me on my Inside Sales Website at http://www.ibm.com/myrep/sunnyxu. Telecoverage Client Representative IBM China August 2000  –  June 2002  (1 year 11 months) Beijing City, China •\tCovered Finance Sector, managed 3 major Insurance and Banking accounts in provincials with up to 100 branches , achieved annual targets for two consecutive years. \n•\tSuccessfully resolved customer complaints and improved customer relations by winning a 150 PC order  \n•\tExpanded corporate relations between IBM and clients. Coordinated the processing of business partner authorization, application selection, approval and renewal of BP relationship. \n•\tCoordinated special events and customer seminars end to end. (Including invitation to business partners and customers, arrangement for guest speakers, logistics) \n•\tConducted Customer Satisfaction Survey, maintained and enhanced customers relationship  \n•\tPipeline management. Correct, monitor opportunities, progress through out, updated the status in MSM system, review the contracts situation with Channel, and provided sales reports to executives Lead Development Representative IBM Canda June 2006  – Present (9 years 3 months) Toronto, Ontario, Canada •\tI have played 3 different Sales Roles in Lead Development BU, including Lead Generation Rep for Hardware; Cross Brand LDR; and Software LDR( Lotus, WebSphere and Cloud)  \n•\tDemonstrated solid Sales track records. Consistently achieved Sales Metrics \n•\tAs the LDR Territory Leader for Great West (Texas, Kansas, Oklahoma, Missouri, Colorado etc), established great interlock with WebSphere Field Sales, Inside Sales, and local Marketing team in the territory. \n•\tAssigned as the Hardware Sales focal of the team. Responsible to get the Hardware training for the team, mentor and encourage the team to cross sell hardware. \n \n•\tKnow how to cultivate great customer relationship, gain the customers’ trust and prospect for new opportunities.  \n•\tExperience to work with IBM Business Partners and IBM internal sales teams to progress the opportunities and drive wins.  \n•\tAdditional leadership includes being the Subject Matter Expert on Sales Tools and Sales Process. Provide leadership and help the other team members to solve the operation and process issues.  \n•\tWas LDR BU STAR Focal for Education Pillar \n \nConnect with me on my Inside Sales Website at http://www.ibm.com/myrep/sunnyxu. Lead Development Representative IBM Canda June 2006  – Present (9 years 3 months) Toronto, Ontario, Canada •\tI have played 3 different Sales Roles in Lead Development BU, including Lead Generation Rep for Hardware; Cross Brand LDR; and Software LDR( Lotus, WebSphere and Cloud)  \n•\tDemonstrated solid Sales track records. Consistently achieved Sales Metrics \n•\tAs the LDR Territory Leader for Great West (Texas, Kansas, Oklahoma, Missouri, Colorado etc), established great interlock with WebSphere Field Sales, Inside Sales, and local Marketing team in the territory. \n•\tAssigned as the Hardware Sales focal of the team. Responsible to get the Hardware training for the team, mentor and encourage the team to cross sell hardware. \n \n•\tKnow how to cultivate great customer relationship, gain the customers’ trust and prospect for new opportunities.  \n•\tExperience to work with IBM Business Partners and IBM internal sales teams to progress the opportunities and drive wins.  \n•\tAdditional leadership includes being the Subject Matter Expert on Sales Tools and Sales Process. Provide leadership and help the other team members to solve the operation and process issues.  \n•\tWas LDR BU STAR Focal for Education Pillar \n \nConnect with me on my Inside Sales Website at http://www.ibm.com/myrep/sunnyxu. Telecoverage Client Representative IBM China August 2000  –  June 2002  (1 year 11 months) Beijing City, China •\tCovered Finance Sector, managed 3 major Insurance and Banking accounts in provincials with up to 100 branches , achieved annual targets for two consecutive years. \n•\tSuccessfully resolved customer complaints and improved customer relations by winning a 150 PC order  \n•\tExpanded corporate relations between IBM and clients. Coordinated the processing of business partner authorization, application selection, approval and renewal of BP relationship. \n•\tCoordinated special events and customer seminars end to end. (Including invitation to business partners and customers, arrangement for guest speakers, logistics) \n•\tConducted Customer Satisfaction Survey, maintained and enhanced customers relationship  \n•\tPipeline management. Correct, monitor opportunities, progress through out, updated the status in MSM system, review the contracts situation with Channel, and provided sales reports to executives Telecoverage Client Representative IBM China August 2000  –  June 2002  (1 year 11 months) Beijing City, China •\tCovered Finance Sector, managed 3 major Insurance and Banking accounts in provincials with up to 100 branches , achieved annual targets for two consecutive years. \n•\tSuccessfully resolved customer complaints and improved customer relations by winning a 150 PC order  \n•\tExpanded corporate relations between IBM and clients. Coordinated the processing of business partner authorization, application selection, approval and renewal of BP relationship. \n•\tCoordinated special events and customer seminars end to end. (Including invitation to business partners and customers, arrangement for guest speakers, logistics) \n•\tConducted Customer Satisfaction Survey, maintained and enhanced customers relationship  \n•\tPipeline management. Correct, monitor opportunities, progress through out, updated the status in MSM system, review the contracts situation with Channel, and provided sales reports to executives Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills ITIL Cloud Computing Data Center Virtualization Management SaaS CRM Sales Process Sales Operations Lead Generation Leadership Skills  ITIL Cloud Computing Data Center Virtualization Management SaaS CRM Sales Process Sales Operations Lead Generation Leadership ITIL Cloud Computing Data Center Virtualization Management SaaS CRM Sales Process Sales Operations Lead Generation Leadership ITIL Cloud Computing Data Center Virtualization Management SaaS CRM Sales Process Sales Operations Lead Generation Leadership Education University of Toronto 2003  – 2005 Beijing Technology and Business University Bachelor of Arts Degree,  In Accounting/ International Trade University of Toronto 2003  – 2005 University of Toronto 2003  – 2005 University of Toronto 2003  – 2005 Beijing Technology and Business University Bachelor of Arts Degree,  In Accounting/ International Trade Beijing Technology and Business University Bachelor of Arts Degree,  In Accounting/ International Trade Beijing Technology and Business University Bachelor of Arts Degree,  In Accounting/ International Trade ", "Experience Lead Development Representative IBM Lead Development Representative IBM Lead Development Representative IBM ", "Summary IBM's restructuring has been all about being relevant to our customers. I'm really excited about the direction we're taking and I know that I will be adding more value than ever to our customers day to day understanding of cloud technology. \nGet in touch with me today to begin a conversation about what cloud technology will benefit you the most and to get the most up to date resources for understanding the value of Cloud Computing Summary IBM's restructuring has been all about being relevant to our customers. I'm really excited about the direction we're taking and I know that I will be adding more value than ever to our customers day to day understanding of cloud technology. \nGet in touch with me today to begin a conversation about what cloud technology will benefit you the most and to get the most up to date resources for understanding the value of Cloud Computing IBM's restructuring has been all about being relevant to our customers. I'm really excited about the direction we're taking and I know that I will be adding more value than ever to our customers day to day understanding of cloud technology. \nGet in touch with me today to begin a conversation about what cloud technology will benefit you the most and to get the most up to date resources for understanding the value of Cloud Computing IBM's restructuring has been all about being relevant to our customers. I'm really excited about the direction we're taking and I know that I will be adding more value than ever to our customers day to day understanding of cloud technology. \nGet in touch with me today to begin a conversation about what cloud technology will benefit you the most and to get the most up to date resources for understanding the value of Cloud Computing Experience Lead Development Representative IBM Cloud Software March 2015  – Present (6 months) Boulder, CO IBM's restructuring has been all about being revelant to our customers. I'm really excited about the direction we're taking and I know that I will be adding more value than ever to our customers day to day understanding of cloud technology. Lead Development Representative IBM Rational October 2010  –  March 2015  (4 years 6 months) Boulder. CO I really enjoyed working with software and systems development teams to explore new ideas, techniques and options for automating processes in the development lifecycle. General Manager Hartmann Hockey June 2007  –  January 2011  (3 years 8 months) You name it, I was responsible for it! Training Director Trakkware LLC. April 2007  –  November 2010  (3 years 8 months) I work with clients to implement new systems and provide the training to maintain and update the systems. Webmaster Sustainable Cards, LLC June 2009  –  September 2010  (1 year 4 months) Responsibilities included Industry and environmental research to come up with marketing strategies and content for the web.  I was also responsible for managing third parties for CSS development and actual production production.  Finally, I had the opportunity to do perform some graphic design in order to minimize our reliance and investment with our graphics partners.  Lead Development Representative IBM Cloud Software March 2015  – Present (6 months) Boulder, CO IBM's restructuring has been all about being revelant to our customers. I'm really excited about the direction we're taking and I know that I will be adding more value than ever to our customers day to day understanding of cloud technology. Lead Development Representative IBM Cloud Software March 2015  – Present (6 months) Boulder, CO IBM's restructuring has been all about being revelant to our customers. I'm really excited about the direction we're taking and I know that I will be adding more value than ever to our customers day to day understanding of cloud technology. Lead Development Representative IBM Rational October 2010  –  March 2015  (4 years 6 months) Boulder. CO I really enjoyed working with software and systems development teams to explore new ideas, techniques and options for automating processes in the development lifecycle. Lead Development Representative IBM Rational October 2010  –  March 2015  (4 years 6 months) Boulder. CO I really enjoyed working with software and systems development teams to explore new ideas, techniques and options for automating processes in the development lifecycle. General Manager Hartmann Hockey June 2007  –  January 2011  (3 years 8 months) You name it, I was responsible for it! General Manager Hartmann Hockey June 2007  –  January 2011  (3 years 8 months) You name it, I was responsible for it! Training Director Trakkware LLC. April 2007  –  November 2010  (3 years 8 months) I work with clients to implement new systems and provide the training to maintain and update the systems. Training Director Trakkware LLC. April 2007  –  November 2010  (3 years 8 months) I work with clients to implement new systems and provide the training to maintain and update the systems. Webmaster Sustainable Cards, LLC June 2009  –  September 2010  (1 year 4 months) Responsibilities included Industry and environmental research to come up with marketing strategies and content for the web.  I was also responsible for managing third parties for CSS development and actual production production.  Finally, I had the opportunity to do perform some graphic design in order to minimize our reliance and investment with our graphics partners.  Webmaster Sustainable Cards, LLC June 2009  –  September 2010  (1 year 4 months) Responsibilities included Industry and environmental research to come up with marketing strategies and content for the web.  I was also responsible for managing third parties for CSS development and actual production production.  Finally, I had the opportunity to do perform some graphic design in order to minimize our reliance and investment with our graphics partners.  Skills CRM Solution Selling SaaS Management Cloud Computing Web Development Enterprise Software Training Contract Negotiation Salesforce.com Strategic Planning Account Management Project Management Business Development Program Management Software Development Microsoft Office Integration Business Strategy Leadership See 5+     See less Skills  CRM Solution Selling SaaS Management Cloud Computing Web Development Enterprise Software Training Contract Negotiation Salesforce.com Strategic Planning Account Management Project Management Business Development Program Management Software Development Microsoft Office Integration Business Strategy Leadership See 5+     See less CRM Solution Selling SaaS Management Cloud Computing Web Development Enterprise Software Training Contract Negotiation Salesforce.com Strategic Planning Account Management Project Management Business Development Program Management Software Development Microsoft Office Integration Business Strategy Leadership See 5+     See less CRM Solution Selling SaaS Management Cloud Computing Web Development Enterprise Software Training Contract Negotiation Salesforce.com Strategic Planning Account Management Project Management Business Development Program Management Software Development Microsoft Office Integration Business Strategy Leadership See 5+     See less Education University of Colorado at Boulder Integrated Physiology,  Physiology & Biology 2003  – 2009 Additional departments that I explored during my tenure at CU-Boulder included The Micro-cellular, Developmental Biology Department, The Women Studies Department, The Psychology Department, and The Philosophy Department. Activities and Societies:  Played intercollegiate full-contact inline hockey and worked full-time while fulfilling degree requirements. University of Colorado at Boulder Integrated Physiology,  Physiology & Biology 2003  – 2009 Additional departments that I explored during my tenure at CU-Boulder included The Micro-cellular, Developmental Biology Department, The Women Studies Department, The Psychology Department, and The Philosophy Department. Activities and Societies:  Played intercollegiate full-contact inline hockey and worked full-time while fulfilling degree requirements. University of Colorado at Boulder Integrated Physiology,  Physiology & Biology 2003  – 2009 Additional departments that I explored during my tenure at CU-Boulder included The Micro-cellular, Developmental Biology Department, The Women Studies Department, The Psychology Department, and The Philosophy Department. Activities and Societies:  Played intercollegiate full-contact inline hockey and worked full-time while fulfilling degree requirements. University of Colorado at Boulder Integrated Physiology,  Physiology & Biology 2003  – 2009 Additional departments that I explored during my tenure at CU-Boulder included The Micro-cellular, Developmental Biology Department, The Women Studies Department, The Psychology Department, and The Philosophy Department. Activities and Societies:  Played intercollegiate full-contact inline hockey and worked full-time while fulfilling degree requirements. ", "Summary As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n \nThrough the mediums of various social media platforms, customers and prospective clients can obtain solutions and help with their complex technical needs with ease. My goal is to provide the highest standard of engagement and customer care while offering a bespoke ,solution oriented approach to our prospective customers.  \n \nI moved to Africa in 2009 to establish a sailing program in Dar Es Salaam and became a founding member of the Tanzanian sailing team, preparing and developing the pioneering squad for the African Games in 2011. When I returned I achieved success in a high pressure call centre environment leading a successful team in increasing productivity for clients and the business alike  \n \nI have been working within the field of business development and lead generation. I am target driven and achieve success daily with targets and goals while maintaining close communications with the US and UK markets at director/executive level in order to achieve this. Summary As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n \nThrough the mediums of various social media platforms, customers and prospective clients can obtain solutions and help with their complex technical needs with ease. My goal is to provide the highest standard of engagement and customer care while offering a bespoke ,solution oriented approach to our prospective customers.  \n \nI moved to Africa in 2009 to establish a sailing program in Dar Es Salaam and became a founding member of the Tanzanian sailing team, preparing and developing the pioneering squad for the African Games in 2011. When I returned I achieved success in a high pressure call centre environment leading a successful team in increasing productivity for clients and the business alike  \n \nI have been working within the field of business development and lead generation. I am target driven and achieve success daily with targets and goals while maintaining close communications with the US and UK markets at director/executive level in order to achieve this. As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n \nThrough the mediums of various social media platforms, customers and prospective clients can obtain solutions and help with their complex technical needs with ease. My goal is to provide the highest standard of engagement and customer care while offering a bespoke ,solution oriented approach to our prospective customers.  \n \nI moved to Africa in 2009 to establish a sailing program in Dar Es Salaam and became a founding member of the Tanzanian sailing team, preparing and developing the pioneering squad for the African Games in 2011. When I returned I achieved success in a high pressure call centre environment leading a successful team in increasing productivity for clients and the business alike  \n \nI have been working within the field of business development and lead generation. I am target driven and achieve success daily with targets and goals while maintaining close communications with the US and UK markets at director/executive level in order to achieve this. As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n \nThrough the mediums of various social media platforms, customers and prospective clients can obtain solutions and help with their complex technical needs with ease. My goal is to provide the highest standard of engagement and customer care while offering a bespoke ,solution oriented approach to our prospective customers.  \n \nI moved to Africa in 2009 to establish a sailing program in Dar Es Salaam and became a founding member of the Tanzanian sailing team, preparing and developing the pioneering squad for the African Games in 2011. When I returned I achieved success in a high pressure call centre environment leading a successful team in increasing productivity for clients and the business alike  \n \nI have been working within the field of business development and lead generation. I am target driven and achieve success daily with targets and goals while maintaining close communications with the US and UK markets at director/executive level in order to achieve this. Experience Lead Development Representative IBM July 2015  – Present (2 months) Damastown, Dublin As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n Team Leader IDG Direct January 2015  –  July 2015  (7 months) Dublin As TL within IDG, my responsibility was primarily to manage a team of 25 SONAR agents. Performance management and operations management both fell in my remit. I was responsible for providing regular coaching and mentoring while also having involvement in recruitment.  Business Development Representative IDG Connect July 2014  –  January 2015  (7 months) Dublin As a business development rep at IDG, my role entailed prospecting key IT professionals in the US market of behalf of big enterprise players.  \nWithin IDG I was a member of a HQL (Sonar) Lead generation team. I distributed comprehensive reports to professionals in relevant industries aligned to the specific campaigns we worked on while building profiles of the companies regarding their business needs and projects planned.  Account Manager Paddy Power PLC February 2014  –  May 2014  (4 months) Part of a short term support team managing senior accounts throughout festival season. Inbound Team Leader Bt / conduit January 2013  –  February 2014  (1 year 2 months) Team Lead : Emergency Calls Ireland \nLead operator ;duties include taking responsibility for the country’s ECAS Service: Emergency service liaison , monitoring service levels + flow, centre management. Chief Sailing Instructor Dar Es Salaam Yacht Club October 2009  –  March 2012  (2 years 6 months) Planning and implementing Lessons and coaching plans \nBooking, Scheduling, Curriculum development \nGiving on board lessons, theory classes and workshops \nOverseeing safety standard maintenance and ensuring compliance \nBudgeting \nResponsible for first Tanzanian sailing team in their preparation for the African games 2011 in Mozambique Lead Development Representative IBM July 2015  – Present (2 months) Damastown, Dublin As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n Lead Development Representative IBM July 2015  – Present (2 months) Damastown, Dublin As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n Team Leader IDG Direct January 2015  –  July 2015  (7 months) Dublin As TL within IDG, my responsibility was primarily to manage a team of 25 SONAR agents. Performance management and operations management both fell in my remit. I was responsible for providing regular coaching and mentoring while also having involvement in recruitment.  Team Leader IDG Direct January 2015  –  July 2015  (7 months) Dublin As TL within IDG, my responsibility was primarily to manage a team of 25 SONAR agents. Performance management and operations management both fell in my remit. I was responsible for providing regular coaching and mentoring while also having involvement in recruitment.  Business Development Representative IDG Connect July 2014  –  January 2015  (7 months) Dublin As a business development rep at IDG, my role entailed prospecting key IT professionals in the US market of behalf of big enterprise players.  \nWithin IDG I was a member of a HQL (Sonar) Lead generation team. I distributed comprehensive reports to professionals in relevant industries aligned to the specific campaigns we worked on while building profiles of the companies regarding their business needs and projects planned.  Business Development Representative IDG Connect July 2014  –  January 2015  (7 months) Dublin As a business development rep at IDG, my role entailed prospecting key IT professionals in the US market of behalf of big enterprise players.  \nWithin IDG I was a member of a HQL (Sonar) Lead generation team. I distributed comprehensive reports to professionals in relevant industries aligned to the specific campaigns we worked on while building profiles of the companies regarding their business needs and projects planned.  Account Manager Paddy Power PLC February 2014  –  May 2014  (4 months) Part of a short term support team managing senior accounts throughout festival season. Account Manager Paddy Power PLC February 2014  –  May 2014  (4 months) Part of a short term support team managing senior accounts throughout festival season. Inbound Team Leader Bt / conduit January 2013  –  February 2014  (1 year 2 months) Team Lead : Emergency Calls Ireland \nLead operator ;duties include taking responsibility for the country’s ECAS Service: Emergency service liaison , monitoring service levels + flow, centre management. Inbound Team Leader Bt / conduit January 2013  –  February 2014  (1 year 2 months) Team Lead : Emergency Calls Ireland \nLead operator ;duties include taking responsibility for the country’s ECAS Service: Emergency service liaison , monitoring service levels + flow, centre management. Chief Sailing Instructor Dar Es Salaam Yacht Club October 2009  –  March 2012  (2 years 6 months) Planning and implementing Lessons and coaching plans \nBooking, Scheduling, Curriculum development \nGiving on board lessons, theory classes and workshops \nOverseeing safety standard maintenance and ensuring compliance \nBudgeting \nResponsible for first Tanzanian sailing team in their preparation for the African games 2011 in Mozambique Chief Sailing Instructor Dar Es Salaam Yacht Club October 2009  –  March 2012  (2 years 6 months) Planning and implementing Lessons and coaching plans \nBooking, Scheduling, Curriculum development \nGiving on board lessons, theory classes and workshops \nOverseeing safety standard maintenance and ensuring compliance \nBudgeting \nResponsible for first Tanzanian sailing team in their preparation for the African games 2011 in Mozambique Languages Irish Irish Irish Skills Project Management Telecommunications Management Customer Service Team Leadership Program Management Change Management Vendor Management Team Management Operations Management Project Planning Strategic Planning Product Management Team Building Leadership Business Development Social Media Event Management New Business Development See 4+     See less Skills  Project Management Telecommunications Management Customer Service Team Leadership Program Management Change Management Vendor Management Team Management Operations Management Project Planning Strategic Planning Product Management Team Building Leadership Business Development Social Media Event Management New Business Development See 4+     See less Project Management Telecommunications Management Customer Service Team Leadership Program Management Change Management Vendor Management Team Management Operations Management Project Planning Strategic Planning Product Management Team Building Leadership Business Development Social Media Event Management New Business Development See 4+     See less Project Management Telecommunications Management Customer Service Team Leadership Program Management Change Management Vendor Management Team Management Operations Management Project Planning Strategic Planning Product Management Team Building Leadership Business Development Social Media Event Management New Business Development See 4+     See less Education National University of Ireland, Galway 2004  – 2005 Blackrock College Leaving Certificate Pulse Recording College Diploma,  Sound Engineering and Audio Recording Field of Study: City & Guilds one year diploma in sound engineering and audio technology. \nDuring this year, I studied how to record and produce music and audio gaining knowledge of the music industry and industry law. Senior College EMT Certification,  Fire & Ambulance Course One year Fire & Ambulance course which includes the completion of an EMT (emergency medical technician) course. National University of Ireland, Galway 2004  – 2005 National University of Ireland, Galway 2004  – 2005 National University of Ireland, Galway 2004  – 2005 Blackrock College Leaving Certificate Blackrock College Leaving Certificate Blackrock College Leaving Certificate Pulse Recording College Diploma,  Sound Engineering and Audio Recording Field of Study: City & Guilds one year diploma in sound engineering and audio technology. \nDuring this year, I studied how to record and produce music and audio gaining knowledge of the music industry and industry law. Pulse Recording College Diploma,  Sound Engineering and Audio Recording Field of Study: City & Guilds one year diploma in sound engineering and audio technology. \nDuring this year, I studied how to record and produce music and audio gaining knowledge of the music industry and industry law. Pulse Recording College Diploma,  Sound Engineering and Audio Recording Field of Study: City & Guilds one year diploma in sound engineering and audio technology. \nDuring this year, I studied how to record and produce music and audio gaining knowledge of the music industry and industry law. Senior College EMT Certification,  Fire & Ambulance Course One year Fire & Ambulance course which includes the completion of an EMT (emergency medical technician) course. Senior College EMT Certification,  Fire & Ambulance Course One year Fire & Ambulance course which includes the completion of an EMT (emergency medical technician) course. Senior College EMT Certification,  Fire & Ambulance Course One year Fire & Ambulance course which includes the completion of an EMT (emergency medical technician) course. ", "Summary Inside sales professional with extensive experience in the technology industry; successful track record of generating new leads, expanding customer base and increasing sales. Summary Inside sales professional with extensive experience in the technology industry; successful track record of generating new leads, expanding customer base and increasing sales. Inside sales professional with extensive experience in the technology industry; successful track record of generating new leads, expanding customer base and increasing sales. Inside sales professional with extensive experience in the technology industry; successful track record of generating new leads, expanding customer base and increasing sales. Experience Lead Development Representative IBM Corporation May 2014  – Present (1 year 4 months) Marlboro, Massachusetts Business Development B2B Contact October 2006  –  May 2014  (7 years 8 months) Raynham Massachusetts Generate new prospects for clients in high tech verticals promoting networking equipment, software support and manufacturing execution solutions. \nSuccessfully generate sales leads for such prospects as Microsoft,Cisco,Hewlett Packard, Juniper, Polycom and Apriso. \nResponsible for providing clients weekly pipeline reports and status on sales leads.  \nSet up and coordinate sales appointments and conference calls for outside sales representatives \nParticipate in scheduled conference calls and/or meetings with B2B sales & sales management teams \nSuccessfully develop relationships at the executive and management level as well as meeting & exceeding lead quotas. National Accounts, Business and Client Development BT Conferencing October 2004  –  October 2006  (2 years 1 month) Braintree,MA Responsible for achieving and developing revenue growth within assigned accounts through sales calls, web presentations and active phone correspondence.  \nConducted end-user training and customer adoption programs.  \nMaintain knowledge and stay current with all BT Conferencing portfolios of products and services, including Microsoft Live Meeting,WebEx, Polycom audio and video conferencing and Wire One Services. \nBuild and maintain active pipeline of qualified new sales prospects, responsible for $90,000 in annual revenue. \nConduct outbound call campaigns to follow-up and support marketing campaigns and customer CRM campaigns.  \nResponsible for a geographic sales territory as well as prospecting and closing new business within this assigned region. \nActively sell into the region and generate net new revenue from selling audio, web and video conferencing. \nAcquire and achieve develop customer relationships to achieve and exceed sales targets and drive new revenue.  \nFollow up on marketing campaigns and record updates to CRM and sales pipelines. Account Executive Broadview Networks October 2004  –  October 2005  (1 year 1 month) Responsible for attaining monthly sales quotas provided by Vice President of Sales. \nProspecting customers via telemarketing, cold calling and referrals. \nPrepare thorough and easy to understand proposals of Broadview services and products.  \nProvide monthly forecasts and follow-activity with current prospects. Expert License Desk Representative Software Spectrum May 2002  –  September 2003  (1 year 5 months) Account Executive Network Plus June 2001  –  June 2002  (1 year 1 month) Inside Sales Represenative Corporate Software and Technology October 1999  –  June 2001  (1 year 9 months) Client Service Representative Corporate Software and Technology February 1997  –  November 1999  (2 years 10 months) Inside Sales Associate Corporate Software and Technology September 1995  –  February 1997  (1 year 6 months) Business Service Representative Keyport Life Insurance Company June 1990  –  September 1995  (5 years 4 months) Lead Development Representative IBM Corporation May 2014  – Present (1 year 4 months) Marlboro, Massachusetts Lead Development Representative IBM Corporation May 2014  – Present (1 year 4 months) Marlboro, Massachusetts Business Development B2B Contact October 2006  –  May 2014  (7 years 8 months) Raynham Massachusetts Generate new prospects for clients in high tech verticals promoting networking equipment, software support and manufacturing execution solutions. \nSuccessfully generate sales leads for such prospects as Microsoft,Cisco,Hewlett Packard, Juniper, Polycom and Apriso. \nResponsible for providing clients weekly pipeline reports and status on sales leads.  \nSet up and coordinate sales appointments and conference calls for outside sales representatives \nParticipate in scheduled conference calls and/or meetings with B2B sales & sales management teams \nSuccessfully develop relationships at the executive and management level as well as meeting & exceeding lead quotas. Business Development B2B Contact October 2006  –  May 2014  (7 years 8 months) Raynham Massachusetts Generate new prospects for clients in high tech verticals promoting networking equipment, software support and manufacturing execution solutions. \nSuccessfully generate sales leads for such prospects as Microsoft,Cisco,Hewlett Packard, Juniper, Polycom and Apriso. \nResponsible for providing clients weekly pipeline reports and status on sales leads.  \nSet up and coordinate sales appointments and conference calls for outside sales representatives \nParticipate in scheduled conference calls and/or meetings with B2B sales & sales management teams \nSuccessfully develop relationships at the executive and management level as well as meeting & exceeding lead quotas. National Accounts, Business and Client Development BT Conferencing October 2004  –  October 2006  (2 years 1 month) Braintree,MA Responsible for achieving and developing revenue growth within assigned accounts through sales calls, web presentations and active phone correspondence.  \nConducted end-user training and customer adoption programs.  \nMaintain knowledge and stay current with all BT Conferencing portfolios of products and services, including Microsoft Live Meeting,WebEx, Polycom audio and video conferencing and Wire One Services. \nBuild and maintain active pipeline of qualified new sales prospects, responsible for $90,000 in annual revenue. \nConduct outbound call campaigns to follow-up and support marketing campaigns and customer CRM campaigns.  \nResponsible for a geographic sales territory as well as prospecting and closing new business within this assigned region. \nActively sell into the region and generate net new revenue from selling audio, web and video conferencing. \nAcquire and achieve develop customer relationships to achieve and exceed sales targets and drive new revenue.  \nFollow up on marketing campaigns and record updates to CRM and sales pipelines. National Accounts, Business and Client Development BT Conferencing October 2004  –  October 2006  (2 years 1 month) Braintree,MA Responsible for achieving and developing revenue growth within assigned accounts through sales calls, web presentations and active phone correspondence.  \nConducted end-user training and customer adoption programs.  \nMaintain knowledge and stay current with all BT Conferencing portfolios of products and services, including Microsoft Live Meeting,WebEx, Polycom audio and video conferencing and Wire One Services. \nBuild and maintain active pipeline of qualified new sales prospects, responsible for $90,000 in annual revenue. \nConduct outbound call campaigns to follow-up and support marketing campaigns and customer CRM campaigns.  \nResponsible for a geographic sales territory as well as prospecting and closing new business within this assigned region. \nActively sell into the region and generate net new revenue from selling audio, web and video conferencing. \nAcquire and achieve develop customer relationships to achieve and exceed sales targets and drive new revenue.  \nFollow up on marketing campaigns and record updates to CRM and sales pipelines. Account Executive Broadview Networks October 2004  –  October 2005  (1 year 1 month) Responsible for attaining monthly sales quotas provided by Vice President of Sales. \nProspecting customers via telemarketing, cold calling and referrals. \nPrepare thorough and easy to understand proposals of Broadview services and products.  \nProvide monthly forecasts and follow-activity with current prospects. Account Executive Broadview Networks October 2004  –  October 2005  (1 year 1 month) Responsible for attaining monthly sales quotas provided by Vice President of Sales. \nProspecting customers via telemarketing, cold calling and referrals. \nPrepare thorough and easy to understand proposals of Broadview services and products.  \nProvide monthly forecasts and follow-activity with current prospects. Expert License Desk Representative Software Spectrum May 2002  –  September 2003  (1 year 5 months) Expert License Desk Representative Software Spectrum May 2002  –  September 2003  (1 year 5 months) Account Executive Network Plus June 2001  –  June 2002  (1 year 1 month) Account Executive Network Plus June 2001  –  June 2002  (1 year 1 month) Inside Sales Represenative Corporate Software and Technology October 1999  –  June 2001  (1 year 9 months) Inside Sales Represenative Corporate Software and Technology October 1999  –  June 2001  (1 year 9 months) Client Service Representative Corporate Software and Technology February 1997  –  November 1999  (2 years 10 months) Client Service Representative Corporate Software and Technology February 1997  –  November 1999  (2 years 10 months) Inside Sales Associate Corporate Software and Technology September 1995  –  February 1997  (1 year 6 months) Inside Sales Associate Corporate Software and Technology September 1995  –  February 1997  (1 year 6 months) Business Service Representative Keyport Life Insurance Company June 1990  –  September 1995  (5 years 4 months) Business Service Representative Keyport Life Insurance Company June 1990  –  September 1995  (5 years 4 months) Skills CRM Sales Account Management Solution Selling New Business Development Salesforce.com Management Business Development SaaS Cold Calling Skills  CRM Sales Account Management Solution Selling New Business Development Salesforce.com Management Business Development SaaS Cold Calling CRM Sales Account Management Solution Selling New Business Development Salesforce.com Management Business Development SaaS Cold Calling CRM Sales Account Management Solution Selling New Business Development Salesforce.com Management Business Development SaaS Cold Calling Education Keene State College Bachelor of Science Keene State College Bachelor of Science Keene State College Bachelor of Science Keene State College Bachelor of Science ", "Experience Digital Sales - Inside Lead Development Representative at IBM IBM - Analytics and IoT July 2015  – Present (2 months) 600 Anton Blvd. 4th Floor Costa Mesa, CA 92626 Office Manager Learning Ladder January 2008  –  July 2015  (7 years 7 months) Managed scheduling for approximately 35-50 students for 10-15 tutors daily, each with unique scheduling restrictions using Microsoft (MS) Excel. \n \nAdvised parents on school admission requirements and procedures. \nMet with tutors and parents regularly to gather feedback and streamline services provided. \n \nSupervision of staff and implementation and coordination of professional development opportunities in compliance to OSHA guidelines.  \n \nNegotiated contracts between Learning Ladder and various high schools allowing Learning Ladder programs (SAT/ACT/ ISEE/HSPT) on-campus at certain high schools. \n \nProvided fiscal oversight of vendor accounts payable / receivable and students’ tuition.  \n \nCross-sell and up-sell services to clients. (12 session packages, SAT/ACT workshops, and score booster packages) \n \nParticipated under the supervision of the director in email campaigns using CRM  \n \nObserved responses through Constant Contact campaigns and made suggestions and alterations to future campaigns.  \n \nImplemented score booster package for SAT students resulting in SAT clients averaging a 200-point improvement on actual SAT scores after completing SAT program. \n \nMaintained over a 90% success rate of 8th graders being accepted to their number 1 high school of choice. \n Digital Sales - Inside Lead Development Representative at IBM IBM - Analytics and IoT July 2015  – Present (2 months) 600 Anton Blvd. 4th Floor Costa Mesa, CA 92626 Digital Sales - Inside Lead Development Representative at IBM IBM - Analytics and IoT July 2015  – Present (2 months) 600 Anton Blvd. 4th Floor Costa Mesa, CA 92626 Office Manager Learning Ladder January 2008  –  July 2015  (7 years 7 months) Managed scheduling for approximately 35-50 students for 10-15 tutors daily, each with unique scheduling restrictions using Microsoft (MS) Excel. \n \nAdvised parents on school admission requirements and procedures. \nMet with tutors and parents regularly to gather feedback and streamline services provided. \n \nSupervision of staff and implementation and coordination of professional development opportunities in compliance to OSHA guidelines.  \n \nNegotiated contracts between Learning Ladder and various high schools allowing Learning Ladder programs (SAT/ACT/ ISEE/HSPT) on-campus at certain high schools. \n \nProvided fiscal oversight of vendor accounts payable / receivable and students’ tuition.  \n \nCross-sell and up-sell services to clients. (12 session packages, SAT/ACT workshops, and score booster packages) \n \nParticipated under the supervision of the director in email campaigns using CRM  \n \nObserved responses through Constant Contact campaigns and made suggestions and alterations to future campaigns.  \n \nImplemented score booster package for SAT students resulting in SAT clients averaging a 200-point improvement on actual SAT scores after completing SAT program. \n \nMaintained over a 90% success rate of 8th graders being accepted to their number 1 high school of choice. \n Office Manager Learning Ladder January 2008  –  July 2015  (7 years 7 months) Managed scheduling for approximately 35-50 students for 10-15 tutors daily, each with unique scheduling restrictions using Microsoft (MS) Excel. \n \nAdvised parents on school admission requirements and procedures. \nMet with tutors and parents regularly to gather feedback and streamline services provided. \n \nSupervision of staff and implementation and coordination of professional development opportunities in compliance to OSHA guidelines.  \n \nNegotiated contracts between Learning Ladder and various high schools allowing Learning Ladder programs (SAT/ACT/ ISEE/HSPT) on-campus at certain high schools. \n \nProvided fiscal oversight of vendor accounts payable / receivable and students’ tuition.  \n \nCross-sell and up-sell services to clients. (12 session packages, SAT/ACT workshops, and score booster packages) \n \nParticipated under the supervision of the director in email campaigns using CRM  \n \nObserved responses through Constant Contact campaigns and made suggestions and alterations to future campaigns.  \n \nImplemented score booster package for SAT students resulting in SAT clients averaging a 200-point improvement on actual SAT scores after completing SAT program. \n \nMaintained over a 90% success rate of 8th graders being accepted to their number 1 high school of choice. \n Languages English Native or bilingual proficiency Latin Limited working proficiency English Native or bilingual proficiency Latin Limited working proficiency English Native or bilingual proficiency Latin Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills SaaS Internet of Things Cloud Computing Solution Selling Business Development Marketing Project Management Social Media Strategic Planning Sales Team Leadership Management Leadership Research Customer Service Higher Education Human Resources See 2+     See less Skills  SaaS Internet of Things Cloud Computing Solution Selling Business Development Marketing Project Management Social Media Strategic Planning Sales Team Leadership Management Leadership Research Customer Service Higher Education Human Resources See 2+     See less SaaS Internet of Things Cloud Computing Solution Selling Business Development Marketing Project Management Social Media Strategic Planning Sales Team Leadership Management Leadership Research Customer Service Higher Education Human Resources See 2+     See less SaaS Internet of Things Cloud Computing Solution Selling Business Development Marketing Project Management Social Media Strategic Planning Sales Team Leadership Management Leadership Research Customer Service Higher Education Human Resources See 2+     See less Education University of Phoenix Bachelor's degree,  Business Management , 3.57 Cum Laude 2010  – 2014 Business Management  University of Phoenix Bachelor's degree,  Business Management , 3.57 Cum Laude 2010  – 2014 Business Management  University of Phoenix Bachelor's degree,  Business Management , 3.57 Cum Laude 2010  – 2014 Business Management  University of Phoenix Bachelor's degree,  Business Management , 3.57 Cum Laude 2010  – 2014 Business Management  ", "Summary With over 8 years of sales experience, I have held account management and lead development roles within IBM. My specialty revolves around storage and POWER solutions for mid-market clients.  \n \nI not only identify the opportunities from my clients but help see through each opportunity from start to finish, engaging with the client executives, channel managers and business partners. I help nurture relationships with each customer. \n \nI am always on the lookout to help businesses with their storage needs and POWER requirements. Summary With over 8 years of sales experience, I have held account management and lead development roles within IBM. My specialty revolves around storage and POWER solutions for mid-market clients.  \n \nI not only identify the opportunities from my clients but help see through each opportunity from start to finish, engaging with the client executives, channel managers and business partners. I help nurture relationships with each customer. \n \nI am always on the lookout to help businesses with their storage needs and POWER requirements. With over 8 years of sales experience, I have held account management and lead development roles within IBM. My specialty revolves around storage and POWER solutions for mid-market clients.  \n \nI not only identify the opportunities from my clients but help see through each opportunity from start to finish, engaging with the client executives, channel managers and business partners. I help nurture relationships with each customer. \n \nI am always on the lookout to help businesses with their storage needs and POWER requirements. With over 8 years of sales experience, I have held account management and lead development roles within IBM. My specialty revolves around storage and POWER solutions for mid-market clients.  \n \nI not only identify the opportunities from my clients but help see through each opportunity from start to finish, engaging with the client executives, channel managers and business partners. I help nurture relationships with each customer. \n \nI am always on the lookout to help businesses with their storage needs and POWER requirements. Experience Lead Development Representative IBM January 2012  – Present (3 years 8 months) Sydney Area, Australia • Identifying leads for IBM's hardware, POWER and cloud computing offers \n• Engagement with customers, client representatives, and business partners in order to close deals \n• Nurturing client relationships and building trust \n• Measured on opportunity identification and win revenue \n• Over-achieved targets for 2012 and 2013 Victoria Mid Market - Industrial Sector IBM July 2010  –  December 2011  (1 year 6 months) Sydney Area, Australia As a client representative I was more a territory manager for IBM's clients in this space. My role was to drive to a sales target within this territory by identifying sales opportunities (new and existing IBM clients) and working with our business partners and internal sales teams. Client Rep - Industrial Sector IBM July 2008  –  June 2010  (2 years) • Responsibilities included managing the relationships between IBM and industrial clients \n• Specialty with the Automotive Sector Lead Development Rep IBM April 2005  –  June 2008  (3 years 3 months) • IBM Marketing Response Centre \n• Main responsibility: take inbound client sales inquiries through a variety of mediums \n• Perform initial qualifications of clients as sales prospects  \n• Engage appropriate IBM Client Representatives to assist the clients Lead Development Representative IBM January 2012  – Present (3 years 8 months) Sydney Area, Australia • Identifying leads for IBM's hardware, POWER and cloud computing offers \n• Engagement with customers, client representatives, and business partners in order to close deals \n• Nurturing client relationships and building trust \n• Measured on opportunity identification and win revenue \n• Over-achieved targets for 2012 and 2013 Lead Development Representative IBM January 2012  – Present (3 years 8 months) Sydney Area, Australia • Identifying leads for IBM's hardware, POWER and cloud computing offers \n• Engagement with customers, client representatives, and business partners in order to close deals \n• Nurturing client relationships and building trust \n• Measured on opportunity identification and win revenue \n• Over-achieved targets for 2012 and 2013 Victoria Mid Market - Industrial Sector IBM July 2010  –  December 2011  (1 year 6 months) Sydney Area, Australia As a client representative I was more a territory manager for IBM's clients in this space. My role was to drive to a sales target within this territory by identifying sales opportunities (new and existing IBM clients) and working with our business partners and internal sales teams. Victoria Mid Market - Industrial Sector IBM July 2010  –  December 2011  (1 year 6 months) Sydney Area, Australia As a client representative I was more a territory manager for IBM's clients in this space. My role was to drive to a sales target within this territory by identifying sales opportunities (new and existing IBM clients) and working with our business partners and internal sales teams. Client Rep - Industrial Sector IBM July 2008  –  June 2010  (2 years) • Responsibilities included managing the relationships between IBM and industrial clients \n• Specialty with the Automotive Sector Client Rep - Industrial Sector IBM July 2008  –  June 2010  (2 years) • Responsibilities included managing the relationships between IBM and industrial clients \n• Specialty with the Automotive Sector Lead Development Rep IBM April 2005  –  June 2008  (3 years 3 months) • IBM Marketing Response Centre \n• Main responsibility: take inbound client sales inquiries through a variety of mediums \n• Perform initial qualifications of clients as sales prospects  \n• Engage appropriate IBM Client Representatives to assist the clients Lead Development Rep IBM April 2005  –  June 2008  (3 years 3 months) • IBM Marketing Response Centre \n• Main responsibility: take inbound client sales inquiries through a variety of mediums \n• Perform initial qualifications of clients as sales prospects  \n• Engage appropriate IBM Client Representatives to assist the clients Languages English Native or bilingual proficiency Hindi Elementary proficiency English Native or bilingual proficiency Hindi Elementary proficiency English Native or bilingual proficiency Hindi Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Account Management Sales System X Retail Solution Selling Enterprise Software Marketing Customer Service IT Service Management Channel Partners IT Strategy SaaS Cloud Computing Automotive Sales Enablement Service Delivery Time Management Storage See 3+     See less Skills  Account Management Sales System X Retail Solution Selling Enterprise Software Marketing Customer Service IT Service Management Channel Partners IT Strategy SaaS Cloud Computing Automotive Sales Enablement Service Delivery Time Management Storage See 3+     See less Account Management Sales System X Retail Solution Selling Enterprise Software Marketing Customer Service IT Service Management Channel Partners IT Strategy SaaS Cloud Computing Automotive Sales Enablement Service Delivery Time Management Storage See 3+     See less Account Management Sales System X Retail Solution Selling Enterprise Software Marketing Customer Service IT Service Management Channel Partners IT Strategy SaaS Cloud Computing Automotive Sales Enablement Service Delivery Time Management Storage See 3+     See less Education Sathya Sai Organisation Sai Baba 1994  – 2022 Activities and Societies:  Sathya Sai Eduction Student. Youth Group member ,  Youth Leadership ,  Group Singing ,  Drama Stage Acting ,  Organising local events. Sathya Sai Education & Education in Human Values Teacher. Annual overseas youth & individual trips to Sathya Sai Baba. I was part of the youth leadership team for one of the overseas youth trips & many community service activities. Griffith University Bachelor of IT (Industry) 2004  – 2006 Sathya Sai Organisation Sai Baba 1994  – 2022 Activities and Societies:  Sathya Sai Eduction Student. Youth Group member ,  Youth Leadership ,  Group Singing ,  Drama Stage Acting ,  Organising local events. Sathya Sai Education & Education in Human Values Teacher. Annual overseas youth & individual trips to Sathya Sai Baba. I was part of the youth leadership team for one of the overseas youth trips & many community service activities. Sathya Sai Organisation Sai Baba 1994  – 2022 Activities and Societies:  Sathya Sai Eduction Student. Youth Group member ,  Youth Leadership ,  Group Singing ,  Drama Stage Acting ,  Organising local events. Sathya Sai Education & Education in Human Values Teacher. Annual overseas youth & individual trips to Sathya Sai Baba. I was part of the youth leadership team for one of the overseas youth trips & many community service activities. Sathya Sai Organisation Sai Baba 1994  – 2022 Activities and Societies:  Sathya Sai Eduction Student. Youth Group member ,  Youth Leadership ,  Group Singing ,  Drama Stage Acting ,  Organising local events. Sathya Sai Education & Education in Human Values Teacher. Annual overseas youth & individual trips to Sathya Sai Baba. I was part of the youth leadership team for one of the overseas youth trips & many community service activities. Griffith University Bachelor of IT (Industry) 2004  – 2006 Griffith University Bachelor of IT (Industry) 2004  – 2006 Griffith University Bachelor of IT (Industry) 2004  – 2006 ", "Experience Lead Development Representative IBM June 2014  – Present (1 year 3 months) Lead Development Representative IBM June 2014  – Present (1 year 3 months) Lead Development Representative IBM June 2014  – Present (1 year 3 months) ", "Experience Lead Development Representative IBM July 2015  – Present (2 months) Education Specialist Dallas Children's Advocacy Center November 2013  –  November 2014  (1 year 1 month) dallas, texas Web Developer/Designer 2M Companies, Inc. August 2011  –  November 2013  (2 years 4 months) dallas, tx Physics Teacher Rowlett High School (Garland ISD) August 2009  –  August 2011  (2 years 1 month) Administrative Assistant Southern Methodist University June 2007  –  July 2009  (2 years 2 months) Loan Counseling Specialist Homecomings Financial April 2007  –  June 2007  (3 months) Loan Servicing Specialist Homecomings Financial November 2006  –  April 2007  (6 months) Lead Development Representative IBM July 2015  – Present (2 months) Lead Development Representative IBM July 2015  – Present (2 months) Education Specialist Dallas Children's Advocacy Center November 2013  –  November 2014  (1 year 1 month) dallas, texas Education Specialist Dallas Children's Advocacy Center November 2013  –  November 2014  (1 year 1 month) dallas, texas Web Developer/Designer 2M Companies, Inc. August 2011  –  November 2013  (2 years 4 months) dallas, tx Web Developer/Designer 2M Companies, Inc. August 2011  –  November 2013  (2 years 4 months) dallas, tx Physics Teacher Rowlett High School (Garland ISD) August 2009  –  August 2011  (2 years 1 month) Physics Teacher Rowlett High School (Garland ISD) August 2009  –  August 2011  (2 years 1 month) Administrative Assistant Southern Methodist University June 2007  –  July 2009  (2 years 2 months) Administrative Assistant Southern Methodist University June 2007  –  July 2009  (2 years 2 months) Loan Counseling Specialist Homecomings Financial April 2007  –  June 2007  (3 months) Loan Counseling Specialist Homecomings Financial April 2007  –  June 2007  (3 months) Loan Servicing Specialist Homecomings Financial November 2006  –  April 2007  (6 months) Loan Servicing Specialist Homecomings Financial November 2006  –  April 2007  (6 months) Skills Marketing Advertising Photoshop Web Design Editing WordPress Brand Development Microsoft Office Mac OS Public Speaking Graphic Design New Business Development Start-ups Microsoft Excel PowerPoint Public Relations CSS Creative Direction Drupal Social Media Marketing Social Networking See 6+     See less Skills  Marketing Advertising Photoshop Web Design Editing WordPress Brand Development Microsoft Office Mac OS Public Speaking Graphic Design New Business Development Start-ups Microsoft Excel PowerPoint Public Relations CSS Creative Direction Drupal Social Media Marketing Social Networking See 6+     See less Marketing Advertising Photoshop Web Design Editing WordPress Brand Development Microsoft Office Mac OS Public Speaking Graphic Design New Business Development Start-ups Microsoft Excel PowerPoint Public Relations CSS Creative Direction Drupal Social Media Marketing Social Networking See 6+     See less Marketing Advertising Photoshop Web Design Editing WordPress Brand Development Microsoft Office Mac OS Public Speaking Graphic Design New Business Development Start-ups Microsoft Excel PowerPoint Public Relations CSS Creative Direction Drupal Social Media Marketing Social Networking See 6+     See less Education University of Oklahoma Bachelor of Arts,  Journalism & Mass Communications- Advertising 2001  – 2005 University of Oklahoma Bachelor of Arts,  Journalism & Mass Communications- Advertising 2001  – 2005 University of Oklahoma Bachelor of Arts,  Journalism & Mass Communications- Advertising 2001  – 2005 University of Oklahoma Bachelor of Arts,  Journalism & Mass Communications- Advertising 2001  – 2005 Honors & Awards ", "Summary Lead Development Representative for IBM's Smarter Workforce. Works out of Littleton, MA. Summary Lead Development Representative for IBM's Smarter Workforce. Works out of Littleton, MA. Lead Development Representative for IBM's Smarter Workforce. Works out of Littleton, MA. Lead Development Representative for IBM's Smarter Workforce. Works out of Littleton, MA. Experience Smarter Workforce Lead Development Representative IBM May 2015  – Present (4 months) Littleton, Massachusetts Assistant to the Vice President of Operations Jessica's Brick Oven May 2013  –  May 2015  (2 years 1 month) North Andover, MA Campus Manager Category 5 Boat Shoes August 2012  –  May 2013  (10 months) Marketing Intern Jackson Hewitt Tax Service, Inc. February 2013  –  April 2013  (3 months) Campus Manager Campus Vacations January 2013  –  March 2013  (3 months) Intern GXT Green June 2012  –  August 2012  (3 months) Life Cycle Assessment, Internal Research, Oppositional Research, Site Walkthroughs. Sales Representative Jessica's Brick Oven May 2011  –  August 2011  (4 months) Sales representative for medium to small companies. Smarter Workforce Lead Development Representative IBM May 2015  – Present (4 months) Littleton, Massachusetts Smarter Workforce Lead Development Representative IBM May 2015  – Present (4 months) Littleton, Massachusetts Assistant to the Vice President of Operations Jessica's Brick Oven May 2013  –  May 2015  (2 years 1 month) North Andover, MA Assistant to the Vice President of Operations Jessica's Brick Oven May 2013  –  May 2015  (2 years 1 month) North Andover, MA Campus Manager Category 5 Boat Shoes August 2012  –  May 2013  (10 months) Campus Manager Category 5 Boat Shoes August 2012  –  May 2013  (10 months) Marketing Intern Jackson Hewitt Tax Service, Inc. February 2013  –  April 2013  (3 months) Marketing Intern Jackson Hewitt Tax Service, Inc. February 2013  –  April 2013  (3 months) Campus Manager Campus Vacations January 2013  –  March 2013  (3 months) Campus Manager Campus Vacations January 2013  –  March 2013  (3 months) Intern GXT Green June 2012  –  August 2012  (3 months) Life Cycle Assessment, Internal Research, Oppositional Research, Site Walkthroughs. Intern GXT Green June 2012  –  August 2012  (3 months) Life Cycle Assessment, Internal Research, Oppositional Research, Site Walkthroughs. Sales Representative Jessica's Brick Oven May 2011  –  August 2011  (4 months) Sales representative for medium to small companies. Sales Representative Jessica's Brick Oven May 2011  –  August 2011  (4 months) Sales representative for medium to small companies. Languages English English English Skills Environmental Economics Environmental Impact... Photoshop Photography Social Media Marketing Group Work Team Leadership Strategic Planning Environmental Policy Environmental Consulting Environmental Issues Economics Research Marketing Research Environmental Research InDesign PowerPoint Social Networking Microsoft Office Microsoft Excel Microsoft Word Public Speaking Leadership Event Planning See 10+     See less Skills  Environmental Economics Environmental Impact... Photoshop Photography Social Media Marketing Group Work Team Leadership Strategic Planning Environmental Policy Environmental Consulting Environmental Issues Economics Research Marketing Research Environmental Research InDesign PowerPoint Social Networking Microsoft Office Microsoft Excel Microsoft Word Public Speaking Leadership Event Planning See 10+     See less Environmental Economics Environmental Impact... Photoshop Photography Social Media Marketing Group Work Team Leadership Strategic Planning Environmental Policy Environmental Consulting Environmental Issues Economics Research Marketing Research Environmental Research InDesign PowerPoint Social Networking Microsoft Office Microsoft Excel Microsoft Word Public Speaking Leadership Event Planning See 10+     See less Environmental Economics Environmental Impact... Photoshop Photography Social Media Marketing Group Work Team Leadership Strategic Planning Environmental Policy Environmental Consulting Environmental Issues Economics Research Marketing Research Environmental Research InDesign PowerPoint Social Networking Microsoft Office Microsoft Excel Microsoft Word Public Speaking Leadership Event Planning See 10+     See less Education The University of Connecticut Bachelor of Science (B.S.),  Environmental Resource Economics 2009  – 2013 The University of Connecticut (UConn) is one of America’s top 20 public universities, according to U.S. News & World Report. It is home to more than 30,000 students, 1,300 faculty, 230,000 proud alumni, and a handsome husky named Jonathan. \n \nThe University has fourteen schools and colleges: Agriculture and Natural Resources, Business, Dental Medicine, Education, Engineering, Fine Arts, Law, Liberal Arts and Sciences, Medicine, Nursing, Pharmacy, and Social Work. Students can choose from eight undergraduate bachelor's degrees with 102 possible majors, as well as seventeen graduate/doctoral degrees and five professional degree programs (MD, JD, etc.). \n \nUConn's main campus in Storrs is admitting the highest-achieving freshmen in University history. Student diversity continues to increase, as does the number of honors students, valedictorians and salutatorians who consistently make UConn their top choice. It's a great time to be a Husky! Belmont Hill School 2002  – 2009 Belmont Hill School educates boys in mind, body, and spirit to develop men of good character. Our community encourages and challenges students to discover and pursue passions, seek excellence, and face adversity with resilience. We cultivate critical thinking and creativity, teamwork and competition, hard work and reflection, tradition and innovation. Valuing our differences and working together, we embrace camaraderie, compassion, and service to others. Our school strives to instill in each boy ethical judgment, a sense of common humanity, and a lifelong love of learning. The University of Connecticut Bachelor of Science (B.S.),  Environmental Resource Economics 2009  – 2013 The University of Connecticut (UConn) is one of America’s top 20 public universities, according to U.S. News & World Report. It is home to more than 30,000 students, 1,300 faculty, 230,000 proud alumni, and a handsome husky named Jonathan. \n \nThe University has fourteen schools and colleges: Agriculture and Natural Resources, Business, Dental Medicine, Education, Engineering, Fine Arts, Law, Liberal Arts and Sciences, Medicine, Nursing, Pharmacy, and Social Work. Students can choose from eight undergraduate bachelor's degrees with 102 possible majors, as well as seventeen graduate/doctoral degrees and five professional degree programs (MD, JD, etc.). \n \nUConn's main campus in Storrs is admitting the highest-achieving freshmen in University history. Student diversity continues to increase, as does the number of honors students, valedictorians and salutatorians who consistently make UConn their top choice. It's a great time to be a Husky! The University of Connecticut Bachelor of Science (B.S.),  Environmental Resource Economics 2009  – 2013 The University of Connecticut (UConn) is one of America’s top 20 public universities, according to U.S. News & World Report. It is home to more than 30,000 students, 1,300 faculty, 230,000 proud alumni, and a handsome husky named Jonathan. \n \nThe University has fourteen schools and colleges: Agriculture and Natural Resources, Business, Dental Medicine, Education, Engineering, Fine Arts, Law, Liberal Arts and Sciences, Medicine, Nursing, Pharmacy, and Social Work. Students can choose from eight undergraduate bachelor's degrees with 102 possible majors, as well as seventeen graduate/doctoral degrees and five professional degree programs (MD, JD, etc.). \n \nUConn's main campus in Storrs is admitting the highest-achieving freshmen in University history. Student diversity continues to increase, as does the number of honors students, valedictorians and salutatorians who consistently make UConn their top choice. It's a great time to be a Husky! The University of Connecticut Bachelor of Science (B.S.),  Environmental Resource Economics 2009  – 2013 The University of Connecticut (UConn) is one of America’s top 20 public universities, according to U.S. News & World Report. It is home to more than 30,000 students, 1,300 faculty, 230,000 proud alumni, and a handsome husky named Jonathan. \n \nThe University has fourteen schools and colleges: Agriculture and Natural Resources, Business, Dental Medicine, Education, Engineering, Fine Arts, Law, Liberal Arts and Sciences, Medicine, Nursing, Pharmacy, and Social Work. Students can choose from eight undergraduate bachelor's degrees with 102 possible majors, as well as seventeen graduate/doctoral degrees and five professional degree programs (MD, JD, etc.). \n \nUConn's main campus in Storrs is admitting the highest-achieving freshmen in University history. Student diversity continues to increase, as does the number of honors students, valedictorians and salutatorians who consistently make UConn their top choice. It's a great time to be a Husky! Belmont Hill School 2002  – 2009 Belmont Hill School educates boys in mind, body, and spirit to develop men of good character. Our community encourages and challenges students to discover and pursue passions, seek excellence, and face adversity with resilience. We cultivate critical thinking and creativity, teamwork and competition, hard work and reflection, tradition and innovation. Valuing our differences and working together, we embrace camaraderie, compassion, and service to others. Our school strives to instill in each boy ethical judgment, a sense of common humanity, and a lifelong love of learning. Belmont Hill School 2002  – 2009 Belmont Hill School educates boys in mind, body, and spirit to develop men of good character. Our community encourages and challenges students to discover and pursue passions, seek excellence, and face adversity with resilience. We cultivate critical thinking and creativity, teamwork and competition, hard work and reflection, tradition and innovation. Valuing our differences and working together, we embrace camaraderie, compassion, and service to others. Our school strives to instill in each boy ethical judgment, a sense of common humanity, and a lifelong love of learning. Belmont Hill School 2002  – 2009 Belmont Hill School educates boys in mind, body, and spirit to develop men of good character. Our community encourages and challenges students to discover and pursue passions, seek excellence, and face adversity with resilience. We cultivate critical thinking and creativity, teamwork and competition, hard work and reflection, tradition and innovation. Valuing our differences and working together, we embrace camaraderie, compassion, and service to others. Our school strives to instill in each boy ethical judgment, a sense of common humanity, and a lifelong love of learning. ", "Experience Lead Development Representative IBM July 2015  – Present (2 months) Coppell, TX Sales Representative Bisco Industries February 2013  –  July 2015  (2 years 6 months) Irving, Texas •\tIncreased market share in a new territory by targeting accounts and recognizing new sales opportunities within the environment \n•\tCultivated relationships with established and prospective customers by learning to identify their specific requirements to meet and exceed their expectations  \n•\tSupported sales team and management by responding quickly to customers’ requests and finding an effective way to solve any problems that occur \n•\tSourced suppliers to find products that would meet the needs of the customer in order to provide exceptional customer service and to build the brand image of the company \n•\tTrained in various departments to learn how the company operates as a whole to become an effective team leader Marketing Intern Central PA Subway Development Corporation February 2012  –  September 2012  (8 months) State College, Pennsylvania Area •\tTargeted businesses to cross promote products through events and coupons \n•\tFielded requests for donations from community organizations, then presented and recommended to management which events to pursue \n•\tCoordinated donation deliveries and ad placement with the requesting organizations and the Subway stores \n•\tDesigned and distributed promotional coupons, banners, and flyers,  \n•\tAttended and helped to coordinate community events with third party administrations Sales Intern Legacy Logistics October 2011  –  February 2012  (5 months) State College, PA •\tAdministered prospect survey calls to collect market research for companies that attend trade shows \n•\tCreated marketing plan for a local non-profit organization to promote awareness and participation \n•\tParticipated in education and enrichment activities to promote team work, creativity and work ethic \n•\tInput data client relation management entries Hostess Victory Brewing Company May 2010  –  August 2011  (1 year 4 months) Downingtown, Pa •\tGreeted customers with a helpful warm attitude to ensure a positive first impression of the brewery and restaurant \n•\tAssisted customers with any problems and handled their concerns in a timely manner to ensure they were comfortable and satisfied with their experience \n•\tLearned the entire menu, brewery products, and merchandise to inform customers and promote sales \n•\tHelped to train new employees and teach them the requirements of the job Greenhouse Operations Waterloo Gardens April 2008  –  June 2009  (1 year 3 months) Exton, PA •\tWorked in the greenhouse, taking care of, organizing, and restocking plants and flowers \n•\tEarned additional responsibilities to use my creative talents in creating displays designed to entice buyers \n•\tStudied and learned the plants needs and products capabilities in order to advise and direct customer’s purchases Lead Development Representative IBM July 2015  – Present (2 months) Coppell, TX Lead Development Representative IBM July 2015  – Present (2 months) Coppell, TX Sales Representative Bisco Industries February 2013  –  July 2015  (2 years 6 months) Irving, Texas •\tIncreased market share in a new territory by targeting accounts and recognizing new sales opportunities within the environment \n•\tCultivated relationships with established and prospective customers by learning to identify their specific requirements to meet and exceed their expectations  \n•\tSupported sales team and management by responding quickly to customers’ requests and finding an effective way to solve any problems that occur \n•\tSourced suppliers to find products that would meet the needs of the customer in order to provide exceptional customer service and to build the brand image of the company \n•\tTrained in various departments to learn how the company operates as a whole to become an effective team leader Sales Representative Bisco Industries February 2013  –  July 2015  (2 years 6 months) Irving, Texas •\tIncreased market share in a new territory by targeting accounts and recognizing new sales opportunities within the environment \n•\tCultivated relationships with established and prospective customers by learning to identify their specific requirements to meet and exceed their expectations  \n•\tSupported sales team and management by responding quickly to customers’ requests and finding an effective way to solve any problems that occur \n•\tSourced suppliers to find products that would meet the needs of the customer in order to provide exceptional customer service and to build the brand image of the company \n•\tTrained in various departments to learn how the company operates as a whole to become an effective team leader Marketing Intern Central PA Subway Development Corporation February 2012  –  September 2012  (8 months) State College, Pennsylvania Area •\tTargeted businesses to cross promote products through events and coupons \n•\tFielded requests for donations from community organizations, then presented and recommended to management which events to pursue \n•\tCoordinated donation deliveries and ad placement with the requesting organizations and the Subway stores \n•\tDesigned and distributed promotional coupons, banners, and flyers,  \n•\tAttended and helped to coordinate community events with third party administrations Marketing Intern Central PA Subway Development Corporation February 2012  –  September 2012  (8 months) State College, Pennsylvania Area •\tTargeted businesses to cross promote products through events and coupons \n•\tFielded requests for donations from community organizations, then presented and recommended to management which events to pursue \n•\tCoordinated donation deliveries and ad placement with the requesting organizations and the Subway stores \n•\tDesigned and distributed promotional coupons, banners, and flyers,  \n•\tAttended and helped to coordinate community events with third party administrations Sales Intern Legacy Logistics October 2011  –  February 2012  (5 months) State College, PA •\tAdministered prospect survey calls to collect market research for companies that attend trade shows \n•\tCreated marketing plan for a local non-profit organization to promote awareness and participation \n•\tParticipated in education and enrichment activities to promote team work, creativity and work ethic \n•\tInput data client relation management entries Sales Intern Legacy Logistics October 2011  –  February 2012  (5 months) State College, PA •\tAdministered prospect survey calls to collect market research for companies that attend trade shows \n•\tCreated marketing plan for a local non-profit organization to promote awareness and participation \n•\tParticipated in education and enrichment activities to promote team work, creativity and work ethic \n•\tInput data client relation management entries Hostess Victory Brewing Company May 2010  –  August 2011  (1 year 4 months) Downingtown, Pa •\tGreeted customers with a helpful warm attitude to ensure a positive first impression of the brewery and restaurant \n•\tAssisted customers with any problems and handled their concerns in a timely manner to ensure they were comfortable and satisfied with their experience \n•\tLearned the entire menu, brewery products, and merchandise to inform customers and promote sales \n•\tHelped to train new employees and teach them the requirements of the job Hostess Victory Brewing Company May 2010  –  August 2011  (1 year 4 months) Downingtown, Pa •\tGreeted customers with a helpful warm attitude to ensure a positive first impression of the brewery and restaurant \n•\tAssisted customers with any problems and handled their concerns in a timely manner to ensure they were comfortable and satisfied with their experience \n•\tLearned the entire menu, brewery products, and merchandise to inform customers and promote sales \n•\tHelped to train new employees and teach them the requirements of the job Greenhouse Operations Waterloo Gardens April 2008  –  June 2009  (1 year 3 months) Exton, PA •\tWorked in the greenhouse, taking care of, organizing, and restocking plants and flowers \n•\tEarned additional responsibilities to use my creative talents in creating displays designed to entice buyers \n•\tStudied and learned the plants needs and products capabilities in order to advise and direct customer’s purchases Greenhouse Operations Waterloo Gardens April 2008  –  June 2009  (1 year 3 months) Exton, PA •\tWorked in the greenhouse, taking care of, organizing, and restocking plants and flowers \n•\tEarned additional responsibilities to use my creative talents in creating displays designed to entice buyers \n•\tStudied and learned the plants needs and products capabilities in order to advise and direct customer’s purchases Skills Experience in painting,... Proficient in French Microsoft Office Vtiger Maximizer SPSS Distributors Sales Telemarketing Email Marketing Supplier Sourcing Customer Service Event Planning Microsoft Excel Microsoft Word PowerPoint Teamwork Social Media Advertising Facebook See 5+     See less Skills  Experience in painting,... Proficient in French Microsoft Office Vtiger Maximizer SPSS Distributors Sales Telemarketing Email Marketing Supplier Sourcing Customer Service Event Planning Microsoft Excel Microsoft Word PowerPoint Teamwork Social Media Advertising Facebook See 5+     See less Experience in painting,... Proficient in French Microsoft Office Vtiger Maximizer SPSS Distributors Sales Telemarketing Email Marketing Supplier Sourcing Customer Service Event Planning Microsoft Excel Microsoft Word PowerPoint Teamwork Social Media Advertising Facebook See 5+     See less Experience in painting,... Proficient in French Microsoft Office Vtiger Maximizer SPSS Distributors Sales Telemarketing Email Marketing Supplier Sourcing Customer Service Event Planning Microsoft Excel Microsoft Word PowerPoint Teamwork Social Media Advertising Facebook See 5+     See less Education The Pennsylvania State University Bachelor of Science in Marketing,  Sociology Minor 2009  – 2012 Relevant Courses: Principles of Marketing, Consumer Behavior, Marketing Research, Global Marketing, Marketing Strategy, Non-Profit and Public Marketing, Advertising and Sales Promotion Management Activities and Societies:  Penn State Marketing Association ,  Penn State Women In Business The Pennsylvania State University Bachelor of Science in Marketing,  Sociology Minor 2009  – 2012 Relevant Courses: Principles of Marketing, Consumer Behavior, Marketing Research, Global Marketing, Marketing Strategy, Non-Profit and Public Marketing, Advertising and Sales Promotion Management Activities and Societies:  Penn State Marketing Association ,  Penn State Women In Business The Pennsylvania State University Bachelor of Science in Marketing,  Sociology Minor 2009  – 2012 Relevant Courses: Principles of Marketing, Consumer Behavior, Marketing Research, Global Marketing, Marketing Strategy, Non-Profit and Public Marketing, Advertising and Sales Promotion Management Activities and Societies:  Penn State Marketing Association ,  Penn State Women In Business The Pennsylvania State University Bachelor of Science in Marketing,  Sociology Minor 2009  – 2012 Relevant Courses: Principles of Marketing, Consumer Behavior, Marketing Research, Global Marketing, Marketing Strategy, Non-Profit and Public Marketing, Advertising and Sales Promotion Management Activities and Societies:  Penn State Marketing Association ,  Penn State Women In Business ", "Summary As a lead Development Representative, my goal is to assist you with understanding the benefits of our hardware, software and services solutions. I can help determine which solutions will meet all your business requirements, staying within your budget and exceeding your expectations. \n \nTo learn more about our offerings, please contact me via my rep page at www.ibm.com/myrep/blundy Summary As a lead Development Representative, my goal is to assist you with understanding the benefits of our hardware, software and services solutions. I can help determine which solutions will meet all your business requirements, staying within your budget and exceeding your expectations. \n \nTo learn more about our offerings, please contact me via my rep page at www.ibm.com/myrep/blundy As a lead Development Representative, my goal is to assist you with understanding the benefits of our hardware, software and services solutions. I can help determine which solutions will meet all your business requirements, staying within your budget and exceeding your expectations. \n \nTo learn more about our offerings, please contact me via my rep page at www.ibm.com/myrep/blundy As a lead Development Representative, my goal is to assist you with understanding the benefits of our hardware, software and services solutions. I can help determine which solutions will meet all your business requirements, staying within your budget and exceeding your expectations. \n \nTo learn more about our offerings, please contact me via my rep page at www.ibm.com/myrep/blundy Experience Lead Development Representative - IBM Inside Sales IBM March 2011  – Present (4 years 6 months) Markham, ON •100% FY 2014 overall attainment with strong sales improvements quarter over quarter- 100% club winner \n•Promote wide variety of IBM offerings including, Hardware, software and services, targeting Mid market clients in the US and Canada \n•Quantify and qualify sales opportunities \n•Manage active sales pipeline and ensure that client records are accurate and complete \n•Achieved 2012 Q1 Closing award, achieving 140% of Q1 Target. \n•Achieved 2014 Q3 sales eminence award winner. \n•Completed Global Sales School - April 2012 Operations Analyst IBM Canada Ltd. November 2007  –  July 2011  (3 years 9 months) Markham, ON •Conduct weekly and monthly reports and present findings to management \n•Use of Workforce Management- IEX to schedule agent shifts \n•Assist with general customer inquiries/pre-sales assistance \n•Provide high level of customer satisfaction while ensuring IBM standards are met, handling team customer escalations or customer dissat situation \n•Train and provide support of new hires as well as existing employees \n•Ensure that team customer service targets are met, and encourage the team to strive for higher levels. \n•Conduct day-to-day operations of the team Safety and Security Toronto Zoo March 2004  –  September 2006  (2 years 7 months) •Controlled entrance and exit gates, patrolled zoo site, general security of the Zoo grounds \n•Worked in a team-oriented atmosphere \n•Responded to minor emergencies; lost persons, lockouts, parking lot mishaps \n•Sufficiently performed scheduled patrol duties; licensed to drive company vehicles \n•Maintained safety and security of visitors and staff on site; perform vehicle escorts for service personnel \n•Maintained and updated daily log books Lead Development Representative - IBM Inside Sales IBM March 2011  – Present (4 years 6 months) Markham, ON •100% FY 2014 overall attainment with strong sales improvements quarter over quarter- 100% club winner \n•Promote wide variety of IBM offerings including, Hardware, software and services, targeting Mid market clients in the US and Canada \n•Quantify and qualify sales opportunities \n•Manage active sales pipeline and ensure that client records are accurate and complete \n•Achieved 2012 Q1 Closing award, achieving 140% of Q1 Target. \n•Achieved 2014 Q3 sales eminence award winner. \n•Completed Global Sales School - April 2012 Lead Development Representative - IBM Inside Sales IBM March 2011  – Present (4 years 6 months) Markham, ON •100% FY 2014 overall attainment with strong sales improvements quarter over quarter- 100% club winner \n•Promote wide variety of IBM offerings including, Hardware, software and services, targeting Mid market clients in the US and Canada \n•Quantify and qualify sales opportunities \n•Manage active sales pipeline and ensure that client records are accurate and complete \n•Achieved 2012 Q1 Closing award, achieving 140% of Q1 Target. \n•Achieved 2014 Q3 sales eminence award winner. \n•Completed Global Sales School - April 2012 Operations Analyst IBM Canada Ltd. November 2007  –  July 2011  (3 years 9 months) Markham, ON •Conduct weekly and monthly reports and present findings to management \n•Use of Workforce Management- IEX to schedule agent shifts \n•Assist with general customer inquiries/pre-sales assistance \n•Provide high level of customer satisfaction while ensuring IBM standards are met, handling team customer escalations or customer dissat situation \n•Train and provide support of new hires as well as existing employees \n•Ensure that team customer service targets are met, and encourage the team to strive for higher levels. \n•Conduct day-to-day operations of the team Operations Analyst IBM Canada Ltd. November 2007  –  July 2011  (3 years 9 months) Markham, ON •Conduct weekly and monthly reports and present findings to management \n•Use of Workforce Management- IEX to schedule agent shifts \n•Assist with general customer inquiries/pre-sales assistance \n•Provide high level of customer satisfaction while ensuring IBM standards are met, handling team customer escalations or customer dissat situation \n•Train and provide support of new hires as well as existing employees \n•Ensure that team customer service targets are met, and encourage the team to strive for higher levels. \n•Conduct day-to-day operations of the team Safety and Security Toronto Zoo March 2004  –  September 2006  (2 years 7 months) •Controlled entrance and exit gates, patrolled zoo site, general security of the Zoo grounds \n•Worked in a team-oriented atmosphere \n•Responded to minor emergencies; lost persons, lockouts, parking lot mishaps \n•Sufficiently performed scheduled patrol duties; licensed to drive company vehicles \n•Maintained safety and security of visitors and staff on site; perform vehicle escorts for service personnel \n•Maintained and updated daily log books Safety and Security Toronto Zoo March 2004  –  September 2006  (2 years 7 months) •Controlled entrance and exit gates, patrolled zoo site, general security of the Zoo grounds \n•Worked in a team-oriented atmosphere \n•Responded to minor emergencies; lost persons, lockouts, parking lot mishaps \n•Sufficiently performed scheduled patrol duties; licensed to drive company vehicles \n•Maintained safety and security of visitors and staff on site; perform vehicle escorts for service personnel \n•Maintained and updated daily log books Skills Solution Selling Siebel Direct Sales Lead Generation Lotus Notes New Business Development Customer Satisfaction Teamwork Time Management Customer Service Account Management Leadership Sales Skills  Solution Selling Siebel Direct Sales Lead Generation Lotus Notes New Business Development Customer Satisfaction Teamwork Time Management Customer Service Account Management Leadership Sales Solution Selling Siebel Direct Sales Lead Generation Lotus Notes New Business Development Customer Satisfaction Teamwork Time Management Customer Service Account Management Leadership Sales Solution Selling Siebel Direct Sales Lead Generation Lotus Notes New Business Development Customer Satisfaction Teamwork Time Management Customer Service Account Management Leadership Sales Education University of Guelph Humber BaSc in Justice Studies & Diploma in Law and Security Administration 2003  – 2007 ajax High school ajax High school University of Guelph Humber BaSc in Justice Studies & Diploma in Law and Security Administration 2003  – 2007 University of Guelph Humber BaSc in Justice Studies & Diploma in Law and Security Administration 2003  – 2007 University of Guelph Humber BaSc in Justice Studies & Diploma in Law and Security Administration 2003  – 2007 ajax High school ajax High school ajax High school ajax High school ajax High school ajax High school ", "Summary GHX Market Intelligence is marking their 20 year anniversary of supplying accurate data to our suppliers. GHX Market Intelligence supplies healthcare manufacturers, consulting firms and CPG companies with the following: \n \n-Awareness of your organization's market potential \n-Understanding of competitive landscape through our reporting deliverables \n-Insights into market size, market share, and average sales price \n \nI am a seasoned sales account manager with a depth of experience in the software, hardware and healthcare industries. Positions held in lead and business development, treatment coordinator, lab technician, dental and medical intern, sales account management, sports coach and leader, activity planning, and digital marketing  \n \nOther critical experiences include building and leading account relationships and development; strategic account planning and execution; coaching; client partnership negotiation  \n \nInterested in opportunities that leverage my team leadership skills and sales experience simultaneously. \n \nSpecialties: Leading and participating in successful team relationships for optimal performance, efficiency and effectiveness; Sourcing, negotiating and establishing long-lasting, mutually beneficial client partnerships; Establishing digital marketing tactics to gain new business. \n \n \nFor more information on the GHX Market Intelligence reporting, please visit our website: http://ghx.com/solutions/supplier-products/market-intelligence/ or email nmrosak@ghx.com Summary GHX Market Intelligence is marking their 20 year anniversary of supplying accurate data to our suppliers. GHX Market Intelligence supplies healthcare manufacturers, consulting firms and CPG companies with the following: \n \n-Awareness of your organization's market potential \n-Understanding of competitive landscape through our reporting deliverables \n-Insights into market size, market share, and average sales price \n \nI am a seasoned sales account manager with a depth of experience in the software, hardware and healthcare industries. Positions held in lead and business development, treatment coordinator, lab technician, dental and medical intern, sales account management, sports coach and leader, activity planning, and digital marketing  \n \nOther critical experiences include building and leading account relationships and development; strategic account planning and execution; coaching; client partnership negotiation  \n \nInterested in opportunities that leverage my team leadership skills and sales experience simultaneously. \n \nSpecialties: Leading and participating in successful team relationships for optimal performance, efficiency and effectiveness; Sourcing, negotiating and establishing long-lasting, mutually beneficial client partnerships; Establishing digital marketing tactics to gain new business. \n \n \nFor more information on the GHX Market Intelligence reporting, please visit our website: http://ghx.com/solutions/supplier-products/market-intelligence/ or email nmrosak@ghx.com GHX Market Intelligence is marking their 20 year anniversary of supplying accurate data to our suppliers. GHX Market Intelligence supplies healthcare manufacturers, consulting firms and CPG companies with the following: \n \n-Awareness of your organization's market potential \n-Understanding of competitive landscape through our reporting deliverables \n-Insights into market size, market share, and average sales price \n \nI am a seasoned sales account manager with a depth of experience in the software, hardware and healthcare industries. Positions held in lead and business development, treatment coordinator, lab technician, dental and medical intern, sales account management, sports coach and leader, activity planning, and digital marketing  \n \nOther critical experiences include building and leading account relationships and development; strategic account planning and execution; coaching; client partnership negotiation  \n \nInterested in opportunities that leverage my team leadership skills and sales experience simultaneously. \n \nSpecialties: Leading and participating in successful team relationships for optimal performance, efficiency and effectiveness; Sourcing, negotiating and establishing long-lasting, mutually beneficial client partnerships; Establishing digital marketing tactics to gain new business. \n \n \nFor more information on the GHX Market Intelligence reporting, please visit our website: http://ghx.com/solutions/supplier-products/market-intelligence/ or email nmrosak@ghx.com GHX Market Intelligence is marking their 20 year anniversary of supplying accurate data to our suppliers. GHX Market Intelligence supplies healthcare manufacturers, consulting firms and CPG companies with the following: \n \n-Awareness of your organization's market potential \n-Understanding of competitive landscape through our reporting deliverables \n-Insights into market size, market share, and average sales price \n \nI am a seasoned sales account manager with a depth of experience in the software, hardware and healthcare industries. Positions held in lead and business development, treatment coordinator, lab technician, dental and medical intern, sales account management, sports coach and leader, activity planning, and digital marketing  \n \nOther critical experiences include building and leading account relationships and development; strategic account planning and execution; coaching; client partnership negotiation  \n \nInterested in opportunities that leverage my team leadership skills and sales experience simultaneously. \n \nSpecialties: Leading and participating in successful team relationships for optimal performance, efficiency and effectiveness; Sourcing, negotiating and establishing long-lasting, mutually beneficial client partnerships; Establishing digital marketing tactics to gain new business. \n \n \nFor more information on the GHX Market Intelligence reporting, please visit our website: http://ghx.com/solutions/supplier-products/market-intelligence/ or email nmrosak@ghx.com Experience Sales Representative GHX December 2014  – Present (9 months) Louisville, Colorado Sales Representative for Global Healthcare Exchange Market Intelligence - US Southeast, Northeast & International \n \n \n \n \n \n \nFind me on twitter: @MrosakGHX Lead Development Representative IBM August 2012  –  November 2014  (2 years 4 months) Boulder, Colorado Lead Development Representative for IBM Rational Software - US West \n \n- Manage and organize two sales territories: Canada and the US West \n- Q3 2014 Software Group Rep of the Quarter Award for North America \n- Identify opportunities by phone establishing relationships with potential new clients  \n- Qualify potential sales opportunities through live social media  \n- Collaborate with technical and sales teams to progress opportunities \n- Update CRM with compelling reason to act, decision makers, budget and timeline \n- Planning sessions with management to identify gaps to achieve quota \n \nFind me on Twitter: @NatashaAMrosak \nPlease feel free to visit my rep page: http://www.ibm.com/connect/ibm/ca/en/resources/namrosak/ Sales Representative ServiceSource January 2012  –  August 2012  (8 months) Denver, Colorado IBM Cisco Renewals Sales - Contractor \n \n- Engaged with clients in the telecommunication, and virtual computing hardware, software industries \n- Forecasted, updated and reported nation-wide territory service contract pipeline to senior management \n- Reviewed and forecasted territory quotas \n- Worked with IBM Executives to increase service renewal revenue on $M+ contracts \n- Collaborated with inside sales team and enablement/data team to progress multiple high dollar sales projects Treatment Coordinator and Records and Lab Technician Dr. Jennifer J Garza Orthodontics September 2010  –  December 2011  (1 year 4 months) Castle Rock, Colorado Treatment Coordinator/Lab Technician/Records Technician \n \n- Performed new patient exams \n- Recommended and sold new treatments \n- Followed up with patients to help strengthen their relationship with the business  \n- Discussed next steps in treatment with patients and parents/guardians \n- Promoted our practice for schools to arrange field trips \n- Performed record, final, and progressive treatment appointments \n- Performed dental lab work for each appointment requiring mouth appliances Basketball Instructor/Coach Janet Karvonen Basketball Camp June 2010  –  August 2010  (3 months) - Functioned as camp instructor for female youths ages 8-17  \n- Assumed full basketball instructing responsibilities including parent/instructor relationship management for assigned campers \n- Isolated and implemented unique engagement approaches in order to most effectively teach campers the sports \n- Responsible for conducting age-appropriate team-building challenges and competitions for campers \n- Actively participated in camp activities with the campers. Supervisor St. Olaf College Intramural Sports September 2009  –  May 2010  (9 months) - Served as the basketball supervisor for both the men's and women's programs \n- Coordinated and set up equipment for all intramural basketball events \n- Organized and managed game schedules, tracked team member attendance, accurately documented game results. Dental Intern/Volunteer Apopka Family Health Center January 2010  –  February 2010  (2 months) Internship focused on building skills and knowledge pertaining to the business-side of dental practice management \n \nInternship activities and key learning included, but were not limited to: \n- Learn about community health clinic operations \n- Review periapical x-rays used to detect any abnormalities of root structure and surrounding bone structure \n- Review panoramic x-rays used to reveal deep cavities, gum disease, and location of the wisdom teeth \n- Assess patient's condition through review of periapical and panoramic x-rays, dialogue with clinical staff on initial assessment, through open communication and feedback channels learn more effective practices for review and diagnoses \n- Enhance the patient experience through engagement in general patient interactions (non-clinical) and participate in patient-clinician discussions as requested \n- Assist the doctors, hygienists and dental assistants with instrument tray requests, UV illumination and suction/debris removal needs during patient procedures  \n- Learn about and participate in evaluation of the clinic via the safety regulations test issued by Expand cultural exposure and understanding through direct, day-to-day contact with the primary patient base served by the clinic (predominantly Latin American cultures) \n- Provide support in any required capacity to all doctors, dental assistants, hygienists, and administrative staff \n- Conduct administrative work for clinic staff Camp Instructor Sports Unlimited June 2009  –  August 2009  (3 months) - Functioned as camp instructor for children ages 4-9  \n- Assumed full lacrosse and basketball instructing responsibilities including parent/instructor relationship management for assigned campers \n- Isolated and implemented unique engagement approaches in order to most effectively teach campers the sports \n- Created age-appropriate team-building challenges and competitions for campers \n- Actively participated in camp activities with the campers Dental Intern Southdale Periodontics June 2009  –  August 2009  (3 months) Dental Intern for a private practice periodontal clinic under the supervision of Dr. James R. Jensen, D.D.S. \n \nInternship activities and key learning included, but were not limited to: \n- Internship focused on the clinical, procedural and anatomical aspects of dental practice \n- Internship activities and key learning included, but were not limited to:  \n- Observe surgeries being performed on patients who consented to intern observation \n- Gain a deeper understanding of patient disease states and conditions, treatments, and surgical options \n- Observe Dr. Jensen's approach to analyzing , assessing and treating patient conditions  \n- Conduct in-depth research to gain a more comprehensive understanding of a new product the clinic intended to adopt for bone graft tissue regeneration (product developed, manufactured and released by Medtronic) \n- Provide support in any required capacity to all doctors, dental assistants, hygienists, and administrative staff Dental Intern and Volunteer Children's Dental Services Headquarters June 2009  –  July 2009  (2 months) Internship focused on the patient experience and patient-staff interactions \n \nInternship activities and key learning included, but were not limited to: \n-Initiate new patient charts according to clinic protocol \n- Assist the doctors, hygienists and dental assistants with instrument tray requests, UV illumination and suction/debris removal needs during patient procedures  \n- Function as a basic interpreter in order to facilitate communication between Spanish-speaking patients and non-Spanish-speaking staff \n- Conduct administrative work for staff \n- Provide support in any required capacity to all doctors, dental assistants, hygienists, and administrative volunteers Waitress/Server J Grundy's Reub n' Stein May 2008  –  August 2008  (4 months) Northfield, Minnesota Functioned as a server in this fast-paced bar and restaurant \n \nDaily duties included:  \n- Seat guests \n- Acquire, retain and relay customer food and beverage orders to the appropriate personnel \n- Process financial transactions in a timely and accurate manner \n- Ensure a positive, memorable guest experience in order to encourage repeat patronage Physical Therapy/Orthopedic Intern Center for Sports Medicine and Rehabilitation Lakeville May 2008  –  August 2008  (4 months) Internship designed to shadow and observe Dr. Robert Shepley in his day-to-day activities within his orthopedic surgery practice \n \nInternship activities and learning included, but were not limited to:  \n- Observe cortisone and lubricant shots given to appropriate patients \n- Gain an understanding of Dr. Shepley's approach to analyzing and assessing patient conditions from bone and joint x-rays \n- Actively engage in discussions with clinical staff to better understand the different diagnoses given to patients, especially those presenting with new symptoms (post-treatment/therapy/surgery) and/or those presenting with multiple, seemingly unrelated symptoms \n- In-room observation of rotator cuff bone spur removal, knee replacement, ACL, thumb placement, carpal tunnel release, resetting of a broken elbow, and other orthopedic surgical and physical therapy procedures performed on patients who consented to intern observation Sales Representative GHX December 2014  – Present (9 months) Louisville, Colorado Sales Representative for Global Healthcare Exchange Market Intelligence - US Southeast, Northeast & International \n \n \n \n \n \n \nFind me on twitter: @MrosakGHX Sales Representative GHX December 2014  – Present (9 months) Louisville, Colorado Sales Representative for Global Healthcare Exchange Market Intelligence - US Southeast, Northeast & International \n \n \n \n \n \n \nFind me on twitter: @MrosakGHX Lead Development Representative IBM August 2012  –  November 2014  (2 years 4 months) Boulder, Colorado Lead Development Representative for IBM Rational Software - US West \n \n- Manage and organize two sales territories: Canada and the US West \n- Q3 2014 Software Group Rep of the Quarter Award for North America \n- Identify opportunities by phone establishing relationships with potential new clients  \n- Qualify potential sales opportunities through live social media  \n- Collaborate with technical and sales teams to progress opportunities \n- Update CRM with compelling reason to act, decision makers, budget and timeline \n- Planning sessions with management to identify gaps to achieve quota \n \nFind me on Twitter: @NatashaAMrosak \nPlease feel free to visit my rep page: http://www.ibm.com/connect/ibm/ca/en/resources/namrosak/ Lead Development Representative IBM August 2012  –  November 2014  (2 years 4 months) Boulder, Colorado Lead Development Representative for IBM Rational Software - US West \n \n- Manage and organize two sales territories: Canada and the US West \n- Q3 2014 Software Group Rep of the Quarter Award for North America \n- Identify opportunities by phone establishing relationships with potential new clients  \n- Qualify potential sales opportunities through live social media  \n- Collaborate with technical and sales teams to progress opportunities \n- Update CRM with compelling reason to act, decision makers, budget and timeline \n- Planning sessions with management to identify gaps to achieve quota \n \nFind me on Twitter: @NatashaAMrosak \nPlease feel free to visit my rep page: http://www.ibm.com/connect/ibm/ca/en/resources/namrosak/ Sales Representative ServiceSource January 2012  –  August 2012  (8 months) Denver, Colorado IBM Cisco Renewals Sales - Contractor \n \n- Engaged with clients in the telecommunication, and virtual computing hardware, software industries \n- Forecasted, updated and reported nation-wide territory service contract pipeline to senior management \n- Reviewed and forecasted territory quotas \n- Worked with IBM Executives to increase service renewal revenue on $M+ contracts \n- Collaborated with inside sales team and enablement/data team to progress multiple high dollar sales projects Sales Representative ServiceSource January 2012  –  August 2012  (8 months) Denver, Colorado IBM Cisco Renewals Sales - Contractor \n \n- Engaged with clients in the telecommunication, and virtual computing hardware, software industries \n- Forecasted, updated and reported nation-wide territory service contract pipeline to senior management \n- Reviewed and forecasted territory quotas \n- Worked with IBM Executives to increase service renewal revenue on $M+ contracts \n- Collaborated with inside sales team and enablement/data team to progress multiple high dollar sales projects Treatment Coordinator and Records and Lab Technician Dr. Jennifer J Garza Orthodontics September 2010  –  December 2011  (1 year 4 months) Castle Rock, Colorado Treatment Coordinator/Lab Technician/Records Technician \n \n- Performed new patient exams \n- Recommended and sold new treatments \n- Followed up with patients to help strengthen their relationship with the business  \n- Discussed next steps in treatment with patients and parents/guardians \n- Promoted our practice for schools to arrange field trips \n- Performed record, final, and progressive treatment appointments \n- Performed dental lab work for each appointment requiring mouth appliances Treatment Coordinator and Records and Lab Technician Dr. Jennifer J Garza Orthodontics September 2010  –  December 2011  (1 year 4 months) Castle Rock, Colorado Treatment Coordinator/Lab Technician/Records Technician \n \n- Performed new patient exams \n- Recommended and sold new treatments \n- Followed up with patients to help strengthen their relationship with the business  \n- Discussed next steps in treatment with patients and parents/guardians \n- Promoted our practice for schools to arrange field trips \n- Performed record, final, and progressive treatment appointments \n- Performed dental lab work for each appointment requiring mouth appliances Basketball Instructor/Coach Janet Karvonen Basketball Camp June 2010  –  August 2010  (3 months) - Functioned as camp instructor for female youths ages 8-17  \n- Assumed full basketball instructing responsibilities including parent/instructor relationship management for assigned campers \n- Isolated and implemented unique engagement approaches in order to most effectively teach campers the sports \n- Responsible for conducting age-appropriate team-building challenges and competitions for campers \n- Actively participated in camp activities with the campers. Basketball Instructor/Coach Janet Karvonen Basketball Camp June 2010  –  August 2010  (3 months) - Functioned as camp instructor for female youths ages 8-17  \n- Assumed full basketball instructing responsibilities including parent/instructor relationship management for assigned campers \n- Isolated and implemented unique engagement approaches in order to most effectively teach campers the sports \n- Responsible for conducting age-appropriate team-building challenges and competitions for campers \n- Actively participated in camp activities with the campers. Supervisor St. Olaf College Intramural Sports September 2009  –  May 2010  (9 months) - Served as the basketball supervisor for both the men's and women's programs \n- Coordinated and set up equipment for all intramural basketball events \n- Organized and managed game schedules, tracked team member attendance, accurately documented game results. Supervisor St. Olaf College Intramural Sports September 2009  –  May 2010  (9 months) - Served as the basketball supervisor for both the men's and women's programs \n- Coordinated and set up equipment for all intramural basketball events \n- Organized and managed game schedules, tracked team member attendance, accurately documented game results. Dental Intern/Volunteer Apopka Family Health Center January 2010  –  February 2010  (2 months) Internship focused on building skills and knowledge pertaining to the business-side of dental practice management \n \nInternship activities and key learning included, but were not limited to: \n- Learn about community health clinic operations \n- Review periapical x-rays used to detect any abnormalities of root structure and surrounding bone structure \n- Review panoramic x-rays used to reveal deep cavities, gum disease, and location of the wisdom teeth \n- Assess patient's condition through review of periapical and panoramic x-rays, dialogue with clinical staff on initial assessment, through open communication and feedback channels learn more effective practices for review and diagnoses \n- Enhance the patient experience through engagement in general patient interactions (non-clinical) and participate in patient-clinician discussions as requested \n- Assist the doctors, hygienists and dental assistants with instrument tray requests, UV illumination and suction/debris removal needs during patient procedures  \n- Learn about and participate in evaluation of the clinic via the safety regulations test issued by Expand cultural exposure and understanding through direct, day-to-day contact with the primary patient base served by the clinic (predominantly Latin American cultures) \n- Provide support in any required capacity to all doctors, dental assistants, hygienists, and administrative staff \n- Conduct administrative work for clinic staff Dental Intern/Volunteer Apopka Family Health Center January 2010  –  February 2010  (2 months) Internship focused on building skills and knowledge pertaining to the business-side of dental practice management \n \nInternship activities and key learning included, but were not limited to: \n- Learn about community health clinic operations \n- Review periapical x-rays used to detect any abnormalities of root structure and surrounding bone structure \n- Review panoramic x-rays used to reveal deep cavities, gum disease, and location of the wisdom teeth \n- Assess patient's condition through review of periapical and panoramic x-rays, dialogue with clinical staff on initial assessment, through open communication and feedback channels learn more effective practices for review and diagnoses \n- Enhance the patient experience through engagement in general patient interactions (non-clinical) and participate in patient-clinician discussions as requested \n- Assist the doctors, hygienists and dental assistants with instrument tray requests, UV illumination and suction/debris removal needs during patient procedures  \n- Learn about and participate in evaluation of the clinic via the safety regulations test issued by Expand cultural exposure and understanding through direct, day-to-day contact with the primary patient base served by the clinic (predominantly Latin American cultures) \n- Provide support in any required capacity to all doctors, dental assistants, hygienists, and administrative staff \n- Conduct administrative work for clinic staff Camp Instructor Sports Unlimited June 2009  –  August 2009  (3 months) - Functioned as camp instructor for children ages 4-9  \n- Assumed full lacrosse and basketball instructing responsibilities including parent/instructor relationship management for assigned campers \n- Isolated and implemented unique engagement approaches in order to most effectively teach campers the sports \n- Created age-appropriate team-building challenges and competitions for campers \n- Actively participated in camp activities with the campers Camp Instructor Sports Unlimited June 2009  –  August 2009  (3 months) - Functioned as camp instructor for children ages 4-9  \n- Assumed full lacrosse and basketball instructing responsibilities including parent/instructor relationship management for assigned campers \n- Isolated and implemented unique engagement approaches in order to most effectively teach campers the sports \n- Created age-appropriate team-building challenges and competitions for campers \n- Actively participated in camp activities with the campers Dental Intern Southdale Periodontics June 2009  –  August 2009  (3 months) Dental Intern for a private practice periodontal clinic under the supervision of Dr. James R. Jensen, D.D.S. \n \nInternship activities and key learning included, but were not limited to: \n- Internship focused on the clinical, procedural and anatomical aspects of dental practice \n- Internship activities and key learning included, but were not limited to:  \n- Observe surgeries being performed on patients who consented to intern observation \n- Gain a deeper understanding of patient disease states and conditions, treatments, and surgical options \n- Observe Dr. Jensen's approach to analyzing , assessing and treating patient conditions  \n- Conduct in-depth research to gain a more comprehensive understanding of a new product the clinic intended to adopt for bone graft tissue regeneration (product developed, manufactured and released by Medtronic) \n- Provide support in any required capacity to all doctors, dental assistants, hygienists, and administrative staff Dental Intern Southdale Periodontics June 2009  –  August 2009  (3 months) Dental Intern for a private practice periodontal clinic under the supervision of Dr. James R. Jensen, D.D.S. \n \nInternship activities and key learning included, but were not limited to: \n- Internship focused on the clinical, procedural and anatomical aspects of dental practice \n- Internship activities and key learning included, but were not limited to:  \n- Observe surgeries being performed on patients who consented to intern observation \n- Gain a deeper understanding of patient disease states and conditions, treatments, and surgical options \n- Observe Dr. Jensen's approach to analyzing , assessing and treating patient conditions  \n- Conduct in-depth research to gain a more comprehensive understanding of a new product the clinic intended to adopt for bone graft tissue regeneration (product developed, manufactured and released by Medtronic) \n- Provide support in any required capacity to all doctors, dental assistants, hygienists, and administrative staff Dental Intern and Volunteer Children's Dental Services Headquarters June 2009  –  July 2009  (2 months) Internship focused on the patient experience and patient-staff interactions \n \nInternship activities and key learning included, but were not limited to: \n-Initiate new patient charts according to clinic protocol \n- Assist the doctors, hygienists and dental assistants with instrument tray requests, UV illumination and suction/debris removal needs during patient procedures  \n- Function as a basic interpreter in order to facilitate communication between Spanish-speaking patients and non-Spanish-speaking staff \n- Conduct administrative work for staff \n- Provide support in any required capacity to all doctors, dental assistants, hygienists, and administrative volunteers Dental Intern and Volunteer Children's Dental Services Headquarters June 2009  –  July 2009  (2 months) Internship focused on the patient experience and patient-staff interactions \n \nInternship activities and key learning included, but were not limited to: \n-Initiate new patient charts according to clinic protocol \n- Assist the doctors, hygienists and dental assistants with instrument tray requests, UV illumination and suction/debris removal needs during patient procedures  \n- Function as a basic interpreter in order to facilitate communication between Spanish-speaking patients and non-Spanish-speaking staff \n- Conduct administrative work for staff \n- Provide support in any required capacity to all doctors, dental assistants, hygienists, and administrative volunteers Waitress/Server J Grundy's Reub n' Stein May 2008  –  August 2008  (4 months) Northfield, Minnesota Functioned as a server in this fast-paced bar and restaurant \n \nDaily duties included:  \n- Seat guests \n- Acquire, retain and relay customer food and beverage orders to the appropriate personnel \n- Process financial transactions in a timely and accurate manner \n- Ensure a positive, memorable guest experience in order to encourage repeat patronage Waitress/Server J Grundy's Reub n' Stein May 2008  –  August 2008  (4 months) Northfield, Minnesota Functioned as a server in this fast-paced bar and restaurant \n \nDaily duties included:  \n- Seat guests \n- Acquire, retain and relay customer food and beverage orders to the appropriate personnel \n- Process financial transactions in a timely and accurate manner \n- Ensure a positive, memorable guest experience in order to encourage repeat patronage Physical Therapy/Orthopedic Intern Center for Sports Medicine and Rehabilitation Lakeville May 2008  –  August 2008  (4 months) Internship designed to shadow and observe Dr. Robert Shepley in his day-to-day activities within his orthopedic surgery practice \n \nInternship activities and learning included, but were not limited to:  \n- Observe cortisone and lubricant shots given to appropriate patients \n- Gain an understanding of Dr. Shepley's approach to analyzing and assessing patient conditions from bone and joint x-rays \n- Actively engage in discussions with clinical staff to better understand the different diagnoses given to patients, especially those presenting with new symptoms (post-treatment/therapy/surgery) and/or those presenting with multiple, seemingly unrelated symptoms \n- In-room observation of rotator cuff bone spur removal, knee replacement, ACL, thumb placement, carpal tunnel release, resetting of a broken elbow, and other orthopedic surgical and physical therapy procedures performed on patients who consented to intern observation Physical Therapy/Orthopedic Intern Center for Sports Medicine and Rehabilitation Lakeville May 2008  –  August 2008  (4 months) Internship designed to shadow and observe Dr. Robert Shepley in his day-to-day activities within his orthopedic surgery practice \n \nInternship activities and learning included, but were not limited to:  \n- Observe cortisone and lubricant shots given to appropriate patients \n- Gain an understanding of Dr. Shepley's approach to analyzing and assessing patient conditions from bone and joint x-rays \n- Actively engage in discussions with clinical staff to better understand the different diagnoses given to patients, especially those presenting with new symptoms (post-treatment/therapy/surgery) and/or those presenting with multiple, seemingly unrelated symptoms \n- In-room observation of rotator cuff bone spur removal, knee replacement, ACL, thumb placement, carpal tunnel release, resetting of a broken elbow, and other orthopedic surgical and physical therapy procedures performed on patients who consented to intern observation Languages Norwegian Norwegian Norwegian Skills Customer Relations Clinical Supervisory Skills Microsoft Office Sales Support Inside Sales Direct Sales Program Management Account Management Customer Service Sales Operations Salesforce.com Analysis Sales Product Development Team Building CRM Cloud Computing Cross-functional Team... Leadership Management Marketing Microsoft Excel SaaS Sales Process Solution Selling See 11+     See less Skills  Customer Relations Clinical Supervisory Skills Microsoft Office Sales Support Inside Sales Direct Sales Program Management Account Management Customer Service Sales Operations Salesforce.com Analysis Sales Product Development Team Building CRM Cloud Computing Cross-functional Team... Leadership Management Marketing Microsoft Excel SaaS Sales Process Solution Selling See 11+     See less Customer Relations Clinical Supervisory Skills Microsoft Office Sales Support Inside Sales Direct Sales Program Management Account Management Customer Service Sales Operations Salesforce.com Analysis Sales Product Development Team Building CRM Cloud Computing Cross-functional Team... Leadership Management Marketing Microsoft Excel SaaS Sales Process Solution Selling See 11+     See less Customer Relations Clinical Supervisory Skills Microsoft Office Sales Support Inside Sales Direct Sales Program Management Account Management Customer Service Sales Operations Salesforce.com Analysis Sales Product Development Team Building CRM Cloud Computing Cross-functional Team... Leadership Management Marketing Microsoft Excel SaaS Sales Process Solution Selling See 11+     See less Education St. Olaf College Bachelor of Arts,  Chemistry and Math 2006  – 2010 Activities and Societies:  *4-year varsity women's basketball participant\n*Captain of the varsity women's basketball team\n*2 year Hustle Award Junior High St. Olaf College Bachelor of Arts,  Chemistry and Math 2006  – 2010 Activities and Societies:  *4-year varsity women's basketball participant\n*Captain of the varsity women's basketball team\n*2 year Hustle Award St. Olaf College Bachelor of Arts,  Chemistry and Math 2006  – 2010 Activities and Societies:  *4-year varsity women's basketball participant\n*Captain of the varsity women's basketball team\n*2 year Hustle Award St. Olaf College Bachelor of Arts,  Chemistry and Math 2006  – 2010 Activities and Societies:  *4-year varsity women's basketball participant\n*Captain of the varsity women's basketball team\n*2 year Hustle Award Junior High Junior High Junior High ", "Experience lead Development Representative IBM India Pvt Ltd lead Development Representative IBM India Pvt Ltd lead Development Representative IBM India Pvt Ltd ", "Summary What I do  \n \nOver the past 5 years I have had the privilege of working with some very talented people in some of the most innovative organisations in the world. My goal is to offer my customers and partners the best solutions available in order to increase productivity, streamline their business and help maximize profits. At IBM we are at the forefront of developing new/and our existing IT Solutions to suit your needs.  \n \nHow I do it differently  \n \nI aim to be an industry leader and bringing my customers accurate information on changes in market trends and technologies in order to give you a competitive advantage. I also aim to use my consultative and collaborative skills in order to put you in touch with the right person.  \n \nEmail - akerans@ie.ibm.com  \nTwitter - @adam_kerans Summary What I do  \n \nOver the past 5 years I have had the privilege of working with some very talented people in some of the most innovative organisations in the world. My goal is to offer my customers and partners the best solutions available in order to increase productivity, streamline their business and help maximize profits. At IBM we are at the forefront of developing new/and our existing IT Solutions to suit your needs.  \n \nHow I do it differently  \n \nI aim to be an industry leader and bringing my customers accurate information on changes in market trends and technologies in order to give you a competitive advantage. I also aim to use my consultative and collaborative skills in order to put you in touch with the right person.  \n \nEmail - akerans@ie.ibm.com  \nTwitter - @adam_kerans What I do  \n \nOver the past 5 years I have had the privilege of working with some very talented people in some of the most innovative organisations in the world. My goal is to offer my customers and partners the best solutions available in order to increase productivity, streamline their business and help maximize profits. At IBM we are at the forefront of developing new/and our existing IT Solutions to suit your needs.  \n \nHow I do it differently  \n \nI aim to be an industry leader and bringing my customers accurate information on changes in market trends and technologies in order to give you a competitive advantage. I also aim to use my consultative and collaborative skills in order to put you in touch with the right person.  \n \nEmail - akerans@ie.ibm.com  \nTwitter - @adam_kerans What I do  \n \nOver the past 5 years I have had the privilege of working with some very talented people in some of the most innovative organisations in the world. My goal is to offer my customers and partners the best solutions available in order to increase productivity, streamline their business and help maximize profits. At IBM we are at the forefront of developing new/and our existing IT Solutions to suit your needs.  \n \nHow I do it differently  \n \nI aim to be an industry leader and bringing my customers accurate information on changes in market trends and technologies in order to give you a competitive advantage. I also aim to use my consultative and collaborative skills in order to put you in touch with the right person.  \n \nEmail - akerans@ie.ibm.com  \nTwitter - @adam_kerans Experience Lead Development Representative IBM August 2015  – Present (1 month) IBM Dublin As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n \nThrough the mediums of various social media platforms, customers and prospective clients can obtain solutions and help with their complex technical needs with ease. My goal is to provide the highest standard of engagement and customer care while offering a bespoke ,solution oriented approach to our prospective customers.  Educational Development Manager (Contract) Google November 2014  –  August 2015  (10 months) Dublin Contracted by Morgan McKinley onsite at Google HQ Dublin \n \nAs an Educational Development Manager I was charged with reaching out to Schools, Academies and Universities across the UK to identify any challenges that they were facing with delivering the curriculum via IT.  \n \nI spoke with Head Teachers, Heads of IT and other key stakeholders in order to raise awareness around the Google Apps and Chromebooks Education Suite.  \n Channel Account Manager Sage January 2012  –  October 2014  (2 years 10 months) Ireland Sage offer Global Leading software and services. My role was focused on the management of Sage Business Partners and their customers, with a focus on generating new business and delivering an excellent customer experience. To develop new/existing relationships, to streamline Channel Processes and Engagements with other departments.  SMB Business Development Executive Fónua Ltd. June 2010  –  December 2011  (1 year 7 months) Sandyford, Dublin 18 Property Administrator/Manager Daphne L Kaye and Associates October 2009  –  June 2010  (9 months) Foxrock, Dublin 18 Negotiator Sherry FitzGerald June 2007  –  July 2008  (1 year 2 months) Stillorgan, Co Dublin & IFSC Dublin 1 Store Manager Xtra-vision Ltd September 2005  –  July 2006  (11 months) Monkstown, Co. Dublin Customer Service Representative (Part time College Position) Permanent TSB January 2005  –  June 2005  (6 months) Blackrock, Co Dublin Customer Service Representative (CSR) (Part-time College Position) Vodafone Ireland July 2004  –  December 2004  (6 months) Vodafone HQ, Sandyford, Dublin 18 Lead Development Representative IBM August 2015  – Present (1 month) IBM Dublin As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n \nThrough the mediums of various social media platforms, customers and prospective clients can obtain solutions and help with their complex technical needs with ease. My goal is to provide the highest standard of engagement and customer care while offering a bespoke ,solution oriented approach to our prospective customers.  Lead Development Representative IBM August 2015  – Present (1 month) IBM Dublin As a lead development representative at IBM, I offer viable and appropriate solutions to prospective IBM customers within the UK and Irish markets. \n \nThrough the mediums of various social media platforms, customers and prospective clients can obtain solutions and help with their complex technical needs with ease. My goal is to provide the highest standard of engagement and customer care while offering a bespoke ,solution oriented approach to our prospective customers.  Educational Development Manager (Contract) Google November 2014  –  August 2015  (10 months) Dublin Contracted by Morgan McKinley onsite at Google HQ Dublin \n \nAs an Educational Development Manager I was charged with reaching out to Schools, Academies and Universities across the UK to identify any challenges that they were facing with delivering the curriculum via IT.  \n \nI spoke with Head Teachers, Heads of IT and other key stakeholders in order to raise awareness around the Google Apps and Chromebooks Education Suite.  \n Educational Development Manager (Contract) Google November 2014  –  August 2015  (10 months) Dublin Contracted by Morgan McKinley onsite at Google HQ Dublin \n \nAs an Educational Development Manager I was charged with reaching out to Schools, Academies and Universities across the UK to identify any challenges that they were facing with delivering the curriculum via IT.  \n \nI spoke with Head Teachers, Heads of IT and other key stakeholders in order to raise awareness around the Google Apps and Chromebooks Education Suite.  \n Channel Account Manager Sage January 2012  –  October 2014  (2 years 10 months) Ireland Sage offer Global Leading software and services. My role was focused on the management of Sage Business Partners and their customers, with a focus on generating new business and delivering an excellent customer experience. To develop new/existing relationships, to streamline Channel Processes and Engagements with other departments.  Channel Account Manager Sage January 2012  –  October 2014  (2 years 10 months) Ireland Sage offer Global Leading software and services. My role was focused on the management of Sage Business Partners and their customers, with a focus on generating new business and delivering an excellent customer experience. To develop new/existing relationships, to streamline Channel Processes and Engagements with other departments.  SMB Business Development Executive Fónua Ltd. June 2010  –  December 2011  (1 year 7 months) Sandyford, Dublin 18 SMB Business Development Executive Fónua Ltd. June 2010  –  December 2011  (1 year 7 months) Sandyford, Dublin 18 Property Administrator/Manager Daphne L Kaye and Associates October 2009  –  June 2010  (9 months) Foxrock, Dublin 18 Property Administrator/Manager Daphne L Kaye and Associates October 2009  –  June 2010  (9 months) Foxrock, Dublin 18 Negotiator Sherry FitzGerald June 2007  –  July 2008  (1 year 2 months) Stillorgan, Co Dublin & IFSC Dublin 1 Negotiator Sherry FitzGerald June 2007  –  July 2008  (1 year 2 months) Stillorgan, Co Dublin & IFSC Dublin 1 Store Manager Xtra-vision Ltd September 2005  –  July 2006  (11 months) Monkstown, Co. Dublin Store Manager Xtra-vision Ltd September 2005  –  July 2006  (11 months) Monkstown, Co. Dublin Customer Service Representative (Part time College Position) Permanent TSB January 2005  –  June 2005  (6 months) Blackrock, Co Dublin Customer Service Representative (Part time College Position) Permanent TSB January 2005  –  June 2005  (6 months) Blackrock, Co Dublin Customer Service Representative (CSR) (Part-time College Position) Vodafone Ireland July 2004  –  December 2004  (6 months) Vodafone HQ, Sandyford, Dublin 18 Customer Service Representative (CSR) (Part-time College Position) Vodafone Ireland July 2004  –  December 2004  (6 months) Vodafone HQ, Sandyford, Dublin 18 Languages Spanish Elementary proficiency Spanish Elementary proficiency Spanish Elementary proficiency Elementary proficiency Skills Management Account Management Business Development Solution Selling Sales Operations New Business Development Leadership Channel Partners Customer Service Salesforce.com Pipeline Development Relationship Management Sales Lead Qualification Selling B2B Building Relationships Microsoft Office SaaS Customer Acquisition Business Relationship... Strategic Planning KPI Reports Enterprise Software CRM Strategy Training Cloud Computing See 13+     See less Skills  Management Account Management Business Development Solution Selling Sales Operations New Business Development Leadership Channel Partners Customer Service Salesforce.com Pipeline Development Relationship Management Sales Lead Qualification Selling B2B Building Relationships Microsoft Office SaaS Customer Acquisition Business Relationship... Strategic Planning KPI Reports Enterprise Software CRM Strategy Training Cloud Computing See 13+     See less Management Account Management Business Development Solution Selling Sales Operations New Business Development Leadership Channel Partners Customer Service Salesforce.com Pipeline Development Relationship Management Sales Lead Qualification Selling B2B Building Relationships Microsoft Office SaaS Customer Acquisition Business Relationship... Strategic Planning KPI Reports Enterprise Software CRM Strategy Training Cloud Computing See 13+     See less Management Account Management Business Development Solution Selling Sales Operations New Business Development Leadership Channel Partners Customer Service Salesforce.com Pipeline Development Relationship Management Sales Lead Qualification Selling B2B Building Relationships Microsoft Office SaaS Customer Acquisition Business Relationship... Strategic Planning KPI Reports Enterprise Software CRM Strategy Training Cloud Computing See 13+     See less Education Dublin Business School Bachelor of Arts (B.A.),  Diploma in Management Studies , Currently 2.1 2013  – 2014 Diploma Awarded by ICM -  \n \nCommunications  \nHRM \nSales & Marketing Management  \nFinancial Reporting Activities and Societies:  None Dublin Business School BA Honours,  Business Studies 2006  – 2007 Thesis: Modern forms of motivating staff in the service and retail industries.  \n \nKey Modules: Consumer Behaviour, European Business, Company Law, Economics, Business Management, Financial Management and Statistical Analysis. Activities and Societies:  None Senior College Dun Laogharie Graduate Diploma,  Business Studies 2003  – 2005 Graduate Diploma in Business Studies - awarded by ICM Activities and Societies:  None St. Andrew's College Junior & Leaving Certificate,  Leaving Certificate , Results available on request 1992  – 2000 The Leaving Certificate Activities and Societies:  Rugby ,  Swimming and Supervised Study. Dublin Business School Bachelor of Arts (B.A.),  Diploma in Management Studies , Currently 2.1 2013  – 2014 Diploma Awarded by ICM -  \n \nCommunications  \nHRM \nSales & Marketing Management  \nFinancial Reporting Activities and Societies:  None Dublin Business School Bachelor of Arts (B.A.),  Diploma in Management Studies , Currently 2.1 2013  – 2014 Diploma Awarded by ICM -  \n \nCommunications  \nHRM \nSales & Marketing Management  \nFinancial Reporting Activities and Societies:  None Dublin Business School Bachelor of Arts (B.A.),  Diploma in Management Studies , Currently 2.1 2013  – 2014 Diploma Awarded by ICM -  \n \nCommunications  \nHRM \nSales & Marketing Management  \nFinancial Reporting Activities and Societies:  None Dublin Business School BA Honours,  Business Studies 2006  – 2007 Thesis: Modern forms of motivating staff in the service and retail industries.  \n \nKey Modules: Consumer Behaviour, European Business, Company Law, Economics, Business Management, Financial Management and Statistical Analysis. Activities and Societies:  None Dublin Business School BA Honours,  Business Studies 2006  – 2007 Thesis: Modern forms of motivating staff in the service and retail industries.  \n \nKey Modules: Consumer Behaviour, European Business, Company Law, Economics, Business Management, Financial Management and Statistical Analysis. Activities and Societies:  None Dublin Business School BA Honours,  Business Studies 2006  – 2007 Thesis: Modern forms of motivating staff in the service and retail industries.  \n \nKey Modules: Consumer Behaviour, European Business, Company Law, Economics, Business Management, Financial Management and Statistical Analysis. Activities and Societies:  None Senior College Dun Laogharie Graduate Diploma,  Business Studies 2003  – 2005 Graduate Diploma in Business Studies - awarded by ICM Activities and Societies:  None Senior College Dun Laogharie Graduate Diploma,  Business Studies 2003  – 2005 Graduate Diploma in Business Studies - awarded by ICM Activities and Societies:  None Senior College Dun Laogharie Graduate Diploma,  Business Studies 2003  – 2005 Graduate Diploma in Business Studies - awarded by ICM Activities and Societies:  None St. Andrew's College Junior & Leaving Certificate,  Leaving Certificate , Results available on request 1992  – 2000 The Leaving Certificate Activities and Societies:  Rugby ,  Swimming and Supervised Study. St. Andrew's College Junior & Leaving Certificate,  Leaving Certificate , Results available on request 1992  – 2000 The Leaving Certificate Activities and Societies:  Rugby ,  Swimming and Supervised Study. St. Andrew's College Junior & Leaving Certificate,  Leaving Certificate , Results available on request 1992  – 2000 The Leaving Certificate Activities and Societies:  Rugby ,  Swimming and Supervised Study. ", "Experience Enterprise Lead Development Representative IBM April 2013  – Present (2 years 5 months) Lincoln, Nebraska Area ISR Compensation Kenexa an IBM Company September 2012  – Present (3 years) Lincoln, Nebraska Area Customer Service Associate Experian October 2011  –  June 2012  (9 months) Allen, TX Business Development Manager Conney Safety Products August 2008  –  June 2011  (2 years 11 months) Dept Assistant Manager American TV 2005  –  2008  (3 years) Enterprise Lead Development Representative IBM April 2013  – Present (2 years 5 months) Lincoln, Nebraska Area Enterprise Lead Development Representative IBM April 2013  – Present (2 years 5 months) Lincoln, Nebraska Area ISR Compensation Kenexa an IBM Company September 2012  – Present (3 years) Lincoln, Nebraska Area ISR Compensation Kenexa an IBM Company September 2012  – Present (3 years) Lincoln, Nebraska Area Customer Service Associate Experian October 2011  –  June 2012  (9 months) Allen, TX Customer Service Associate Experian October 2011  –  June 2012  (9 months) Allen, TX Business Development Manager Conney Safety Products August 2008  –  June 2011  (2 years 11 months) Business Development Manager Conney Safety Products August 2008  –  June 2011  (2 years 11 months) Dept Assistant Manager American TV 2005  –  2008  (3 years) Dept Assistant Manager American TV 2005  –  2008  (3 years) Skills Salesforce.com Microsoft Word Microsoft Excel Microsoft Office Business Development Sales Management Team Leadership Account Management B2B Customer Service CompAnalyst Outlook New Business Development Recruiting Sales Process Cold Calling Lead Generation Sales Selling Human Resources Performance Management Training Employee Relations CRM Leadership See 10+     See less Skills  Salesforce.com Microsoft Word Microsoft Excel Microsoft Office Business Development Sales Management Team Leadership Account Management B2B Customer Service CompAnalyst Outlook New Business Development Recruiting Sales Process Cold Calling Lead Generation Sales Selling Human Resources Performance Management Training Employee Relations CRM Leadership See 10+     See less Salesforce.com Microsoft Word Microsoft Excel Microsoft Office Business Development Sales Management Team Leadership Account Management B2B Customer Service CompAnalyst Outlook New Business Development Recruiting Sales Process Cold Calling Lead Generation Sales Selling Human Resources Performance Management Training Employee Relations CRM Leadership See 10+     See less Salesforce.com Microsoft Word Microsoft Excel Microsoft Office Business Development Sales Management Team Leadership Account Management B2B Customer Service CompAnalyst Outlook New Business Development Recruiting Sales Process Cold Calling Lead Generation Sales Selling Human Resources Performance Management Training Employee Relations CRM Leadership See 10+     See less Education University of Nebraska at Kearney Bachelor of Applied Science (B.A.Sc.),  General Studies 1996  – 2002 University of Nebraska at Kearney Bachelor of Applied Science (B.A.Sc.),  General Studies 1996  – 2002 University of Nebraska at Kearney Bachelor of Applied Science (B.A.Sc.),  General Studies 1996  – 2002 University of Nebraska at Kearney Bachelor of Applied Science (B.A.Sc.),  General Studies 1996  – 2002 ", "Experience Inside Sales Lead Development Representative IBM Smarter Workforce June 2015  – Present (3 months) Greater Boston Area Accounts Specialist - Sales Department Jones & Bartlett Learning March 2014  –  May 2015  (1 year 3 months) Burlington, MA Senior Event Manager - Tsongas Center at UMass Lowell Global Spectrum July 2010  –  March 2014  (3 years 9 months) Lowell, MA •\tPrimary contact in the advancement and execution of all event requirements with event promoter, organizer, or university representative \n•\tOversee internal budget of $85,000 and event budget of $800,000 (played key role in budget creation for FY 2010-2011 and FY 2011-2012) \n•\tFinancial planning for all event estimates and settlements \n•\tEstablish and maintain effective working relationships with lessees, internal departments, vendors, union stagehands, and municipalities \n•\tFront and back of house management  \n•\tAssist and direct changeover crew with setup and breakdown of events \n•\tRecommend, evaluate and create work schedules for events, IATSE and security staff, delegate assignments and review performance and results \n•\tCoordinate communication between building staff and show staff during load in and load out \n•\tCoordinate with Finance/Payroll as needed to ensure event staff and other applicable parties are compensated in a timely manner \n•\tUpdate Tsongas Center evacuation, hiring, and training manuals and standards \n•\tOversee day-to-day customer service operations of the Box Office \n•\tAssist with booking arena events and functions \n•\tOther project management as assigned by the General Manager or other departments \n•\tOther duties include: overall facility operations, guest services, operations management and personnel management Senior Event Manager - Mullins Center at University of Massachusetts Global Spectrum July 2006  –  July 2010  (4 years 1 month) Amherst, MA Promoted to Senior Event Manager (2009 – July 2010) \n•\tResponsible for event estimates and settlements \n•\tPrimary building liaison with Department of Athletics \n•\tBooking Coordinator for all function room events \n \nPromoted to Event Manager (2007 – 2009) \n•\tEvent Manager of arena operations (front of house and back of house) \n•\tAdvance all event requirements with event promoter, event organizer, or university representative \n•\tStaffing and supervision of event staff, IATSE, operations, audio/visual, and outside vendor employees for all events \n•\tLiaison with University of Massachusetts Police Department, Environmental Health and Safety Department, and other local health and safety municipalities \n \nEvent Services Manager (2006-2007) \n•\tManagement of event staff department  \n•\tEvent advancement of staff, security and municipalities \n•\tUpdate Mullins Center evacuation, hiring, and training manuals and standards Athletic Facilities and Operations Assistant Bradley University June 2005  –  June 2006  (1 year 1 month) Peoria, IL •\tAssist as an event manager for all athletic events \n•\tStaffing and supervision of event staff employees for events \n•\tAssistant Tournament Director for 2005 Missouri Valley Conference Championship Soccer Tournament \n•\tAssistant Director of staff personnel for NCAA First Round Soccer Championship \n•\tAssistant Tournament Director for soccer and volleyball tournaments \n•\tDirect Men’s Basketball 50/50 raffle program  \n•\tCoordinate game staging meetings \n•\tAssist with projects from the Athletic Director, Senior Woman Administrator, and Associate Athletic Directors for External Affairs and Financial Affairs \n•\tCreated event and facilities manual covering all sport responsibilities  \n•\tOther duties include: overall facility operations/liaison with Bradley University maintenance department, guest services, personnel management and concessions Intern Stephen C. O'Connell Center - University of Florida June 2003  –  December 2003  (7 months) Gainesville, FL •\tAssisted as a manager for events (basketball, concerts, graduation, gymnastics, special events, and volleyball). \n•\tAssisted with the staffing and supervising of event staff employees for events. \n•\tActed as supervisor to all summer camp activities (basketball, gymnastics, swimming, and volleyball). \n•\tAssisted in booking and scheduling of events. \n•\tAssisted with the supervision of the set-up and clean up of Gator Growl (UF Homecoming – largest student run pep rally). \n•\tImplemented marketing and sponsorship strategies for the “Survivor Program” - (worker incentive program). \n•\tOther duties included: event management, game management, facility operations, guest services, booking, personnel management, client/promoter relations, crowd management, concessions, concert operations, marketing, and sponsorship. Inside Sales Lead Development Representative IBM Smarter Workforce June 2015  – Present (3 months) Greater Boston Area Inside Sales Lead Development Representative IBM Smarter Workforce June 2015  – Present (3 months) Greater Boston Area Accounts Specialist - Sales Department Jones & Bartlett Learning March 2014  –  May 2015  (1 year 3 months) Burlington, MA Accounts Specialist - Sales Department Jones & Bartlett Learning March 2014  –  May 2015  (1 year 3 months) Burlington, MA Senior Event Manager - Tsongas Center at UMass Lowell Global Spectrum July 2010  –  March 2014  (3 years 9 months) Lowell, MA •\tPrimary contact in the advancement and execution of all event requirements with event promoter, organizer, or university representative \n•\tOversee internal budget of $85,000 and event budget of $800,000 (played key role in budget creation for FY 2010-2011 and FY 2011-2012) \n•\tFinancial planning for all event estimates and settlements \n•\tEstablish and maintain effective working relationships with lessees, internal departments, vendors, union stagehands, and municipalities \n•\tFront and back of house management  \n•\tAssist and direct changeover crew with setup and breakdown of events \n•\tRecommend, evaluate and create work schedules for events, IATSE and security staff, delegate assignments and review performance and results \n•\tCoordinate communication between building staff and show staff during load in and load out \n•\tCoordinate with Finance/Payroll as needed to ensure event staff and other applicable parties are compensated in a timely manner \n•\tUpdate Tsongas Center evacuation, hiring, and training manuals and standards \n•\tOversee day-to-day customer service operations of the Box Office \n•\tAssist with booking arena events and functions \n•\tOther project management as assigned by the General Manager or other departments \n•\tOther duties include: overall facility operations, guest services, operations management and personnel management Senior Event Manager - Tsongas Center at UMass Lowell Global Spectrum July 2010  –  March 2014  (3 years 9 months) Lowell, MA •\tPrimary contact in the advancement and execution of all event requirements with event promoter, organizer, or university representative \n•\tOversee internal budget of $85,000 and event budget of $800,000 (played key role in budget creation for FY 2010-2011 and FY 2011-2012) \n•\tFinancial planning for all event estimates and settlements \n•\tEstablish and maintain effective working relationships with lessees, internal departments, vendors, union stagehands, and municipalities \n•\tFront and back of house management  \n•\tAssist and direct changeover crew with setup and breakdown of events \n•\tRecommend, evaluate and create work schedules for events, IATSE and security staff, delegate assignments and review performance and results \n•\tCoordinate communication between building staff and show staff during load in and load out \n•\tCoordinate with Finance/Payroll as needed to ensure event staff and other applicable parties are compensated in a timely manner \n•\tUpdate Tsongas Center evacuation, hiring, and training manuals and standards \n•\tOversee day-to-day customer service operations of the Box Office \n•\tAssist with booking arena events and functions \n•\tOther project management as assigned by the General Manager or other departments \n•\tOther duties include: overall facility operations, guest services, operations management and personnel management Senior Event Manager - Mullins Center at University of Massachusetts Global Spectrum July 2006  –  July 2010  (4 years 1 month) Amherst, MA Promoted to Senior Event Manager (2009 – July 2010) \n•\tResponsible for event estimates and settlements \n•\tPrimary building liaison with Department of Athletics \n•\tBooking Coordinator for all function room events \n \nPromoted to Event Manager (2007 – 2009) \n•\tEvent Manager of arena operations (front of house and back of house) \n•\tAdvance all event requirements with event promoter, event organizer, or university representative \n•\tStaffing and supervision of event staff, IATSE, operations, audio/visual, and outside vendor employees for all events \n•\tLiaison with University of Massachusetts Police Department, Environmental Health and Safety Department, and other local health and safety municipalities \n \nEvent Services Manager (2006-2007) \n•\tManagement of event staff department  \n•\tEvent advancement of staff, security and municipalities \n•\tUpdate Mullins Center evacuation, hiring, and training manuals and standards Senior Event Manager - Mullins Center at University of Massachusetts Global Spectrum July 2006  –  July 2010  (4 years 1 month) Amherst, MA Promoted to Senior Event Manager (2009 – July 2010) \n•\tResponsible for event estimates and settlements \n•\tPrimary building liaison with Department of Athletics \n•\tBooking Coordinator for all function room events \n \nPromoted to Event Manager (2007 – 2009) \n•\tEvent Manager of arena operations (front of house and back of house) \n•\tAdvance all event requirements with event promoter, event organizer, or university representative \n•\tStaffing and supervision of event staff, IATSE, operations, audio/visual, and outside vendor employees for all events \n•\tLiaison with University of Massachusetts Police Department, Environmental Health and Safety Department, and other local health and safety municipalities \n \nEvent Services Manager (2006-2007) \n•\tManagement of event staff department  \n•\tEvent advancement of staff, security and municipalities \n•\tUpdate Mullins Center evacuation, hiring, and training manuals and standards Athletic Facilities and Operations Assistant Bradley University June 2005  –  June 2006  (1 year 1 month) Peoria, IL •\tAssist as an event manager for all athletic events \n•\tStaffing and supervision of event staff employees for events \n•\tAssistant Tournament Director for 2005 Missouri Valley Conference Championship Soccer Tournament \n•\tAssistant Director of staff personnel for NCAA First Round Soccer Championship \n•\tAssistant Tournament Director for soccer and volleyball tournaments \n•\tDirect Men’s Basketball 50/50 raffle program  \n•\tCoordinate game staging meetings \n•\tAssist with projects from the Athletic Director, Senior Woman Administrator, and Associate Athletic Directors for External Affairs and Financial Affairs \n•\tCreated event and facilities manual covering all sport responsibilities  \n•\tOther duties include: overall facility operations/liaison with Bradley University maintenance department, guest services, personnel management and concessions Athletic Facilities and Operations Assistant Bradley University June 2005  –  June 2006  (1 year 1 month) Peoria, IL •\tAssist as an event manager for all athletic events \n•\tStaffing and supervision of event staff employees for events \n•\tAssistant Tournament Director for 2005 Missouri Valley Conference Championship Soccer Tournament \n•\tAssistant Director of staff personnel for NCAA First Round Soccer Championship \n•\tAssistant Tournament Director for soccer and volleyball tournaments \n•\tDirect Men’s Basketball 50/50 raffle program  \n•\tCoordinate game staging meetings \n•\tAssist with projects from the Athletic Director, Senior Woman Administrator, and Associate Athletic Directors for External Affairs and Financial Affairs \n•\tCreated event and facilities manual covering all sport responsibilities  \n•\tOther duties include: overall facility operations/liaison with Bradley University maintenance department, guest services, personnel management and concessions Intern Stephen C. O'Connell Center - University of Florida June 2003  –  December 2003  (7 months) Gainesville, FL •\tAssisted as a manager for events (basketball, concerts, graduation, gymnastics, special events, and volleyball). \n•\tAssisted with the staffing and supervising of event staff employees for events. \n•\tActed as supervisor to all summer camp activities (basketball, gymnastics, swimming, and volleyball). \n•\tAssisted in booking and scheduling of events. \n•\tAssisted with the supervision of the set-up and clean up of Gator Growl (UF Homecoming – largest student run pep rally). \n•\tImplemented marketing and sponsorship strategies for the “Survivor Program” - (worker incentive program). \n•\tOther duties included: event management, game management, facility operations, guest services, booking, personnel management, client/promoter relations, crowd management, concessions, concert operations, marketing, and sponsorship. Intern Stephen C. O'Connell Center - University of Florida June 2003  –  December 2003  (7 months) Gainesville, FL •\tAssisted as a manager for events (basketball, concerts, graduation, gymnastics, special events, and volleyball). \n•\tAssisted with the staffing and supervising of event staff employees for events. \n•\tActed as supervisor to all summer camp activities (basketball, gymnastics, swimming, and volleyball). \n•\tAssisted in booking and scheduling of events. \n•\tAssisted with the supervision of the set-up and clean up of Gator Growl (UF Homecoming – largest student run pep rally). \n•\tImplemented marketing and sponsorship strategies for the “Survivor Program” - (worker incentive program). \n•\tOther duties included: event management, game management, facility operations, guest services, booking, personnel management, client/promoter relations, crowd management, concessions, concert operations, marketing, and sponsorship. Skills Sports Management Venue Management Event Management Events Event Planning Live Events Sports Special Events Live Production Concerts Concert Production Trade Shows Private Events Corporate Events Logistics Budget Management Facility Operations Booking Employee Management Employee Relations Budgets Facilities Operations Sponsorship Sales Sports Marketing Sponsorship Customer Service Social Media See 12+     See less Skills  Sports Management Venue Management Event Management Events Event Planning Live Events Sports Special Events Live Production Concerts Concert Production Trade Shows Private Events Corporate Events Logistics Budget Management Facility Operations Booking Employee Management Employee Relations Budgets Facilities Operations Sponsorship Sales Sports Marketing Sponsorship Customer Service Social Media See 12+     See less Sports Management Venue Management Event Management Events Event Planning Live Events Sports Special Events Live Production Concerts Concert Production Trade Shows Private Events Corporate Events Logistics Budget Management Facility Operations Booking Employee Management Employee Relations Budgets Facilities Operations Sponsorship Sales Sports Marketing Sponsorship Customer Service Social Media See 12+     See less Sports Management Venue Management Event Management Events Event Planning Live Events Sports Special Events Live Production Concerts Concert Production Trade Shows Private Events Corporate Events Logistics Budget Management Facility Operations Booking Employee Management Employee Relations Budgets Facilities Operations Sponsorship Sales Sports Marketing Sponsorship Customer Service Social Media See 12+     See less Education East Stroudsburg University of Pennsylvania MS,  Sport Management 2004  – 2005 Slippery Rock University of Pennsylvania BS,  Sports Management 1999  – 2003 Warrior Run High School 1995  – 1999 East Stroudsburg University of Pennsylvania MS,  Sport Management 2004  – 2005 East Stroudsburg University of Pennsylvania MS,  Sport Management 2004  – 2005 East Stroudsburg University of Pennsylvania MS,  Sport Management 2004  – 2005 Slippery Rock University of Pennsylvania BS,  Sports Management 1999  – 2003 Slippery Rock University of Pennsylvania BS,  Sports Management 1999  – 2003 Slippery Rock University of Pennsylvania BS,  Sports Management 1999  – 2003 Warrior Run High School 1995  – 1999 Warrior Run High School 1995  – 1999 Warrior Run High School 1995  – 1999 "]}