{"position": "Lead Financial Engineer", "company": "IBM", "profiles": ["Experience Lead Financial Engineer IBM Risk Analytics July 2013  – Present (2 years 2 months) Senior Financial Engineer Algorithmics, an IBM Company July 2012  –  July 2013  (1 year 1 month) London, United Kingdom Financial Engineer Algorithmics, an IBM Company January 2012  –  June 2012  (6 months) London, United Kingdom Balance Sheet Risk Management Department Associate Financial Engineer Algorithmics September 2010  –  December 2011  (1 year 4 months) Lead Financial Engineer IBM Risk Analytics July 2013  – Present (2 years 2 months) Lead Financial Engineer IBM Risk Analytics July 2013  – Present (2 years 2 months) Senior Financial Engineer Algorithmics, an IBM Company July 2012  –  July 2013  (1 year 1 month) London, United Kingdom Senior Financial Engineer Algorithmics, an IBM Company July 2012  –  July 2013  (1 year 1 month) London, United Kingdom Financial Engineer Algorithmics, an IBM Company January 2012  –  June 2012  (6 months) London, United Kingdom Balance Sheet Risk Management Department Financial Engineer Algorithmics, an IBM Company January 2012  –  June 2012  (6 months) London, United Kingdom Balance Sheet Risk Management Department Associate Financial Engineer Algorithmics September 2010  –  December 2011  (1 year 4 months) Associate Financial Engineer Algorithmics September 2010  –  December 2011  (1 year 4 months) Skills Financial Engineering Risk Compliance Liquidity Management Fixed Income Market Risk Derivatives Quantitative Finance Basel II Credit Derivatives Interest Rate... Monte Carlo Simulation Stress Testing Risk Management FX Options Skills  Financial Engineering Risk Compliance Liquidity Management Fixed Income Market Risk Derivatives Quantitative Finance Basel II Credit Derivatives Interest Rate... Monte Carlo Simulation Stress Testing Risk Management FX Options Financial Engineering Risk Compliance Liquidity Management Fixed Income Market Risk Derivatives Quantitative Finance Basel II Credit Derivatives Interest Rate... Monte Carlo Simulation Stress Testing Risk Management FX Options Financial Engineering Risk Compliance Liquidity Management Fixed Income Market Risk Derivatives Quantitative Finance Basel II Credit Derivatives Interest Rate... Monte Carlo Simulation Stress Testing Risk Management FX Options Education Cass Business School MSc,  Financial Mathematics 2009  – 2010 Queen Mary, U. of London BSc Mathematics and Statistics,  Mathematics and Statistics 2006  – 2009 Cass Business School MSc,  Financial Mathematics 2009  – 2010 Cass Business School MSc,  Financial Mathematics 2009  – 2010 Cass Business School MSc,  Financial Mathematics 2009  – 2010 Queen Mary, U. of London BSc Mathematics and Statistics,  Mathematics and Statistics 2006  – 2009 Queen Mary, U. of London BSc Mathematics and Statistics,  Mathematics and Statistics 2006  – 2009 Queen Mary, U. of London BSc Mathematics and Statistics,  Mathematics and Statistics 2006  – 2009 ", "Skills Solvency II Enterprise Risk... Financial Risk Risk Management Reinsurance Insurance Actuarial Science ALM Finance Financial Analysis General Insurance Market Risk Property  Financial Modeling Skills  Solvency II Enterprise Risk... Financial Risk Risk Management Reinsurance Insurance Actuarial Science ALM Finance Financial Analysis General Insurance Market Risk Property  Financial Modeling Solvency II Enterprise Risk... Financial Risk Risk Management Reinsurance Insurance Actuarial Science ALM Finance Financial Analysis General Insurance Market Risk Property  Financial Modeling Solvency II Enterprise Risk... Financial Risk Risk Management Reinsurance Insurance Actuarial Science ALM Finance Financial Analysis General Insurance Market Risk Property  Financial Modeling ", "Experience Lead Business Analyst, Counterparty Credit Risk (IMM) Stress Testing Standard Chartered Bank October 2014  – Present (11 months) London, United Kingdom Lead Financial Engineer, IBM Algo Credit Economic Capital, ALM & Liquidity Risk Algorithmics, an IBM Company August 2013  –  October 2014  (1 year 3 months) London, United Kingdom Lead Financial Engineer, Solvency II Internal Model / ALM Legal & General October 2011  –  August 2013  (1 year 11 months) London, United Kingdom Presales / QuIC Product Manager, Markit Risk Analytics Markit November 2010  –  October 2011  (1 year) London, United Kingdom Presales Consultant, Counterparty Credit Risk SunGard Adaptiv February 2010  –  November 2010  (10 months) London, United Kingdom Financial Engineering Team Lead, Algo Risk Managed Services Algorithmics UK July 2005  –  February 2010  (4 years 8 months) London, United Kingdom Lead Business Analyst, Counterparty Credit Risk (IMM) Stress Testing Standard Chartered Bank October 2014  – Present (11 months) London, United Kingdom Lead Business Analyst, Counterparty Credit Risk (IMM) Stress Testing Standard Chartered Bank October 2014  – Present (11 months) London, United Kingdom Lead Financial Engineer, IBM Algo Credit Economic Capital, ALM & Liquidity Risk Algorithmics, an IBM Company August 2013  –  October 2014  (1 year 3 months) London, United Kingdom Lead Financial Engineer, IBM Algo Credit Economic Capital, ALM & Liquidity Risk Algorithmics, an IBM Company August 2013  –  October 2014  (1 year 3 months) London, United Kingdom Lead Financial Engineer, Solvency II Internal Model / ALM Legal & General October 2011  –  August 2013  (1 year 11 months) London, United Kingdom Lead Financial Engineer, Solvency II Internal Model / ALM Legal & General October 2011  –  August 2013  (1 year 11 months) London, United Kingdom Presales / QuIC Product Manager, Markit Risk Analytics Markit November 2010  –  October 2011  (1 year) London, United Kingdom Presales / QuIC Product Manager, Markit Risk Analytics Markit November 2010  –  October 2011  (1 year) London, United Kingdom Presales Consultant, Counterparty Credit Risk SunGard Adaptiv February 2010  –  November 2010  (10 months) London, United Kingdom Presales Consultant, Counterparty Credit Risk SunGard Adaptiv February 2010  –  November 2010  (10 months) London, United Kingdom Financial Engineering Team Lead, Algo Risk Managed Services Algorithmics UK July 2005  –  February 2010  (4 years 8 months) London, United Kingdom Financial Engineering Team Lead, Algo Risk Managed Services Algorithmics UK July 2005  –  February 2010  (4 years 8 months) London, United Kingdom Skills Financial Engineering Analytics Finance Financial Risk ALM Solvency II Economic Capital Credit Risk Market Risk Quantitative Analytics Liquidity Risk Banking Regulatory Capital Portfolio Management Counterparty Risk Business Analysis Risk Management Hedge Funds Financial Markets Options Stock options See 6+     See less Skills  Financial Engineering Analytics Finance Financial Risk ALM Solvency II Economic Capital Credit Risk Market Risk Quantitative Analytics Liquidity Risk Banking Regulatory Capital Portfolio Management Counterparty Risk Business Analysis Risk Management Hedge Funds Financial Markets Options Stock options See 6+     See less Financial Engineering Analytics Finance Financial Risk ALM Solvency II Economic Capital Credit Risk Market Risk Quantitative Analytics Liquidity Risk Banking Regulatory Capital Portfolio Management Counterparty Risk Business Analysis Risk Management Hedge Funds Financial Markets Options Stock options See 6+     See less Financial Engineering Analytics Finance Financial Risk ALM Solvency II Economic Capital Credit Risk Market Risk Quantitative Analytics Liquidity Risk Banking Regulatory Capital Portfolio Management Counterparty Risk Business Analysis Risk Management Hedge Funds Financial Markets Options Stock options See 6+     See less Education Cass Business School Master of Science (MS),  Quantitative Finance 2004  – 2005 Cass Business School Master of Science (MS),  Quantitative Finance 2004  – 2005 Cass Business School Master of Science (MS),  Quantitative Finance 2004  – 2005 Cass Business School Master of Science (MS),  Quantitative Finance 2004  – 2005 ", "Experience Lead financial engineer IBM, Algorithmics January 2009  –  May 2015  (6 years 5 months) Estar acargo de la implemntacion financiera , en los distintos proyectos de riesgos financieros que tiene Algorithmics. \nPor ejemplo :  \n-Implementar el IRC-incremental Risk Charge (Riesgo de Credito) para BBVA en Madrid España. \n-Portafolio Replication para Banco Intesa en Milan Italia. \n-Riesgo de Mercado para distintos clientes en Mexico como lo son Afore XXI, La comicion Nacional Bancaria y de Valores entre otros. Lider de Proyectos CONSAR October 2005  –  December 2008  (3 years 3 months) Estar acargo de la implementacion y analisis de los distintos riesgos a los que estan sujetas las SIEFORES. \nLiderando y Apoyando en la toma de decisiones. Especialista de Riesgos Grupo BMV January 2003  –  October 2005  (2 years 10 months) Desarrollar procesos automatizados para la generacion de distintos productos de riesgos como lo son los benchmarks de mercado, el cubo de riesgos para estimar el riesgos de portafolios a distintos horizontes de riesgo, matrces de diferencias para requerimientos regulatorios. Lead financial engineer IBM, Algorithmics January 2009  –  May 2015  (6 years 5 months) Estar acargo de la implemntacion financiera , en los distintos proyectos de riesgos financieros que tiene Algorithmics. \nPor ejemplo :  \n-Implementar el IRC-incremental Risk Charge (Riesgo de Credito) para BBVA en Madrid España. \n-Portafolio Replication para Banco Intesa en Milan Italia. \n-Riesgo de Mercado para distintos clientes en Mexico como lo son Afore XXI, La comicion Nacional Bancaria y de Valores entre otros. Lead financial engineer IBM, Algorithmics January 2009  –  May 2015  (6 years 5 months) Estar acargo de la implemntacion financiera , en los distintos proyectos de riesgos financieros que tiene Algorithmics. \nPor ejemplo :  \n-Implementar el IRC-incremental Risk Charge (Riesgo de Credito) para BBVA en Madrid España. \n-Portafolio Replication para Banco Intesa en Milan Italia. \n-Riesgo de Mercado para distintos clientes en Mexico como lo son Afore XXI, La comicion Nacional Bancaria y de Valores entre otros. Lider de Proyectos CONSAR October 2005  –  December 2008  (3 years 3 months) Estar acargo de la implementacion y analisis de los distintos riesgos a los que estan sujetas las SIEFORES. \nLiderando y Apoyando en la toma de decisiones. Lider de Proyectos CONSAR October 2005  –  December 2008  (3 years 3 months) Estar acargo de la implementacion y analisis de los distintos riesgos a los que estan sujetas las SIEFORES. \nLiderando y Apoyando en la toma de decisiones. Especialista de Riesgos Grupo BMV January 2003  –  October 2005  (2 years 10 months) Desarrollar procesos automatizados para la generacion de distintos productos de riesgos como lo son los benchmarks de mercado, el cubo de riesgos para estimar el riesgos de portafolios a distintos horizontes de riesgo, matrces de diferencias para requerimientos regulatorios. Especialista de Riesgos Grupo BMV January 2003  –  October 2005  (2 years 10 months) Desarrollar procesos automatizados para la generacion de distintos productos de riesgos como lo son los benchmarks de mercado, el cubo de riesgos para estimar el riesgos de portafolios a distintos horizontes de riesgo, matrces de diferencias para requerimientos regulatorios. Skills Risk Management SQL Business Analysis Derivatives Java Unix Software Development Requirements Analysis Fixed Income Financial Risk Market Risk Software Project... Linux C++ Credit Risk Integration Business Intelligence Liquidity Risk Project Management Probabilistic Models Statistical Modeling Valuation Pricing Analysis Mathematical Analysis Gestión de riesgos See 10+     See less Skills  Risk Management SQL Business Analysis Derivatives Java Unix Software Development Requirements Analysis Fixed Income Financial Risk Market Risk Software Project... Linux C++ Credit Risk Integration Business Intelligence Liquidity Risk Project Management Probabilistic Models Statistical Modeling Valuation Pricing Analysis Mathematical Analysis Gestión de riesgos See 10+     See less Risk Management SQL Business Analysis Derivatives Java Unix Software Development Requirements Analysis Fixed Income Financial Risk Market Risk Software Project... Linux C++ Credit Risk Integration Business Intelligence Liquidity Risk Project Management Probabilistic Models Statistical Modeling Valuation Pricing Analysis Mathematical Analysis Gestión de riesgos See 10+     See less Risk Management SQL Business Analysis Derivatives Java Unix Software Development Requirements Analysis Fixed Income Financial Risk Market Risk Software Project... Linux C++ Credit Risk Integration Business Intelligence Liquidity Risk Project Management Probabilistic Models Statistical Modeling Valuation Pricing Analysis Mathematical Analysis Gestión de riesgos See 10+     See less Education UNAM Licenciatura en Actuaria,  Finanzas, general 2000  – 2004 Activities and Societies:  Becario de alto rendimiento Academico UNAM Licenciatura en Actuaria,  Finanzas, general 2000  – 2004 Activities and Societies:  Becario de alto rendimiento Academico UNAM Licenciatura en Actuaria,  Finanzas, general 2000  – 2004 Activities and Societies:  Becario de alto rendimiento Academico UNAM Licenciatura en Actuaria,  Finanzas, general 2000  – 2004 Activities and Societies:  Becario de alto rendimiento Academico ", "Summary My experience with my Doctorate in Theoretical Physics has given me a very deep and wide range set of tools to obtain analytic closed-form solutions, or at least sensible approximations to integrals, PDEs, non-linear equations, and integro and integro-differential equations. \n \nFurthermore, my extensive knowledge of numerical analysis enables me to get highly accurate numerical solutions efficiently, when analytic tools are not possible. Specialties:Residential Mortgage Backed Securities and associated products (e.g. \"TBA's\"): valuations, estimation default, prepayment, loss, and delinquency vectors. Summary My experience with my Doctorate in Theoretical Physics has given me a very deep and wide range set of tools to obtain analytic closed-form solutions, or at least sensible approximations to integrals, PDEs, non-linear equations, and integro and integro-differential equations. \n \nFurthermore, my extensive knowledge of numerical analysis enables me to get highly accurate numerical solutions efficiently, when analytic tools are not possible. Specialties:Residential Mortgage Backed Securities and associated products (e.g. \"TBA's\"): valuations, estimation default, prepayment, loss, and delinquency vectors. My experience with my Doctorate in Theoretical Physics has given me a very deep and wide range set of tools to obtain analytic closed-form solutions, or at least sensible approximations to integrals, PDEs, non-linear equations, and integro and integro-differential equations. \n \nFurthermore, my extensive knowledge of numerical analysis enables me to get highly accurate numerical solutions efficiently, when analytic tools are not possible. Specialties:Residential Mortgage Backed Securities and associated products (e.g. \"TBA's\"): valuations, estimation default, prepayment, loss, and delinquency vectors. My experience with my Doctorate in Theoretical Physics has given me a very deep and wide range set of tools to obtain analytic closed-form solutions, or at least sensible approximations to integrals, PDEs, non-linear equations, and integro and integro-differential equations. \n \nFurthermore, my extensive knowledge of numerical analysis enables me to get highly accurate numerical solutions efficiently, when analytic tools are not possible. Specialties:Residential Mortgage Backed Securities and associated products (e.g. \"TBA's\"): valuations, estimation default, prepayment, loss, and delinquency vectors. Experience Lead Financial Engineer IBM November 2011  – Present (3 years 10 months) Greater New York City Area Lead consultant on many large-scale implementations of risk software for investment banks and insurance companies, including ETL design of source system extraction, instrument prototyping, valuations, and market/credit risk analytics. \n \nHighlights: \n• Modeling and valuation of thousands of millions of dollars of cashflows from a wide variety of interest rate derivatives and structured bonds. \n• Credit and market risk modeling and analytics for various banks and asset management groups. \n• Team specialist for structured finance and mathematical methods of finance. \n• Managed a team of international programmers for a long term project to interface 3rd party risk system pricing engines with IBM RiskWatch by writing low-level C++ DLLs. Manager of Credit Advisory and Valuations Algorithmics June 2009  –  November 2011  (2 years 6 months) Greater New York City Area Developed, maintained, and used home-grown MBS bond valuation software along with our team’s proprietary MBS credit model to price bonds on a quarterly basis for a multitude of US banks. \n \n• Leveraged my programming skills to write an MBS bond pricing engine which generated structured cashflows using Intex/C++ and Intex/VBA based on collateral detail. \n• Maintained the team’s proprietary MBS credit model and kept it market calibrated. \n• Our team delivered quarterly bond valuations to many banks which included credit enhancements, like overcollateralization, mezzanine structures, LPMI and BPMI, etc. Used loan-level information provided by data providers to get the most accurate pricings. Senior Quantitative Developer Fitch Ratings December 2005  –  June 2009  (3 years 7 months) Greater New York City Area Key member of the rating agency’s elite team of quantitative developers, a small subgroup within its programming IT staff. The purpose of this team is to implement quantitative models using the most accurate and efficient implementations possible using the best technology for the job, includes algorithm/implementation choice, speed/accuracy trade-offs, etc. \n \n• Worked closely with quants to manage development of the ratings agency’s key MBS credit engine, licensed to clients and used by the agency, to determine MBS bond ratings. The engine was about 2 million lines of code of Java and scripting. \n• Developed a C++ Monte Carlo engine DLL interfaced with Excel to price CDOs for CDO credit ratings. \n• Implemented a mortgage insurance model in Excel/VBA used in MBS bond credit rating determination. Associate Professor of Physics and Mathematics Mercer County Community College September 2003  –  December 2005  (2 years 4 months) East Windsor, New Jersey Tenure track position. Duties included teaching college calculus, ordinary differential equations, vector calculus, and the physics with calculus series. \n \n• In addition to teaching duties, managed the Office of Academic Institutional Research: Generated statistical data, analysis and reports for federal, municipal, accreditation, public/private requests for institutional data. \n• Overhauled the physics with calculus curriculum, both the class and laboratory sections. Lead Financial Engineer IBM November 2011  – Present (3 years 10 months) Greater New York City Area Lead consultant on many large-scale implementations of risk software for investment banks and insurance companies, including ETL design of source system extraction, instrument prototyping, valuations, and market/credit risk analytics. \n \nHighlights: \n• Modeling and valuation of thousands of millions of dollars of cashflows from a wide variety of interest rate derivatives and structured bonds. \n• Credit and market risk modeling and analytics for various banks and asset management groups. \n• Team specialist for structured finance and mathematical methods of finance. \n• Managed a team of international programmers for a long term project to interface 3rd party risk system pricing engines with IBM RiskWatch by writing low-level C++ DLLs. Lead Financial Engineer IBM November 2011  – Present (3 years 10 months) Greater New York City Area Lead consultant on many large-scale implementations of risk software for investment banks and insurance companies, including ETL design of source system extraction, instrument prototyping, valuations, and market/credit risk analytics. \n \nHighlights: \n• Modeling and valuation of thousands of millions of dollars of cashflows from a wide variety of interest rate derivatives and structured bonds. \n• Credit and market risk modeling and analytics for various banks and asset management groups. \n• Team specialist for structured finance and mathematical methods of finance. \n• Managed a team of international programmers for a long term project to interface 3rd party risk system pricing engines with IBM RiskWatch by writing low-level C++ DLLs. Manager of Credit Advisory and Valuations Algorithmics June 2009  –  November 2011  (2 years 6 months) Greater New York City Area Developed, maintained, and used home-grown MBS bond valuation software along with our team’s proprietary MBS credit model to price bonds on a quarterly basis for a multitude of US banks. \n \n• Leveraged my programming skills to write an MBS bond pricing engine which generated structured cashflows using Intex/C++ and Intex/VBA based on collateral detail. \n• Maintained the team’s proprietary MBS credit model and kept it market calibrated. \n• Our team delivered quarterly bond valuations to many banks which included credit enhancements, like overcollateralization, mezzanine structures, LPMI and BPMI, etc. Used loan-level information provided by data providers to get the most accurate pricings. Manager of Credit Advisory and Valuations Algorithmics June 2009  –  November 2011  (2 years 6 months) Greater New York City Area Developed, maintained, and used home-grown MBS bond valuation software along with our team’s proprietary MBS credit model to price bonds on a quarterly basis for a multitude of US banks. \n \n• Leveraged my programming skills to write an MBS bond pricing engine which generated structured cashflows using Intex/C++ and Intex/VBA based on collateral detail. \n• Maintained the team’s proprietary MBS credit model and kept it market calibrated. \n• Our team delivered quarterly bond valuations to many banks which included credit enhancements, like overcollateralization, mezzanine structures, LPMI and BPMI, etc. Used loan-level information provided by data providers to get the most accurate pricings. Senior Quantitative Developer Fitch Ratings December 2005  –  June 2009  (3 years 7 months) Greater New York City Area Key member of the rating agency’s elite team of quantitative developers, a small subgroup within its programming IT staff. The purpose of this team is to implement quantitative models using the most accurate and efficient implementations possible using the best technology for the job, includes algorithm/implementation choice, speed/accuracy trade-offs, etc. \n \n• Worked closely with quants to manage development of the ratings agency’s key MBS credit engine, licensed to clients and used by the agency, to determine MBS bond ratings. The engine was about 2 million lines of code of Java and scripting. \n• Developed a C++ Monte Carlo engine DLL interfaced with Excel to price CDOs for CDO credit ratings. \n• Implemented a mortgage insurance model in Excel/VBA used in MBS bond credit rating determination. Senior Quantitative Developer Fitch Ratings December 2005  –  June 2009  (3 years 7 months) Greater New York City Area Key member of the rating agency’s elite team of quantitative developers, a small subgroup within its programming IT staff. The purpose of this team is to implement quantitative models using the most accurate and efficient implementations possible using the best technology for the job, includes algorithm/implementation choice, speed/accuracy trade-offs, etc. \n \n• Worked closely with quants to manage development of the ratings agency’s key MBS credit engine, licensed to clients and used by the agency, to determine MBS bond ratings. The engine was about 2 million lines of code of Java and scripting. \n• Developed a C++ Monte Carlo engine DLL interfaced with Excel to price CDOs for CDO credit ratings. \n• Implemented a mortgage insurance model in Excel/VBA used in MBS bond credit rating determination. Associate Professor of Physics and Mathematics Mercer County Community College September 2003  –  December 2005  (2 years 4 months) East Windsor, New Jersey Tenure track position. Duties included teaching college calculus, ordinary differential equations, vector calculus, and the physics with calculus series. \n \n• In addition to teaching duties, managed the Office of Academic Institutional Research: Generated statistical data, analysis and reports for federal, municipal, accreditation, public/private requests for institutional data. \n• Overhauled the physics with calculus curriculum, both the class and laboratory sections. Associate Professor of Physics and Mathematics Mercer County Community College September 2003  –  December 2005  (2 years 4 months) East Windsor, New Jersey Tenure track position. Duties included teaching college calculus, ordinary differential equations, vector calculus, and the physics with calculus series. \n \n• In addition to teaching duties, managed the Office of Academic Institutional Research: Generated statistical data, analysis and reports for federal, municipal, accreditation, public/private requests for institutional data. \n• Overhauled the physics with calculus curriculum, both the class and laboratory sections. Skills Structured Finance Software Development Interest Rate... Credit Bonds Java Valuation SQL Numerical Analysis Quantitative Analytics Monte Carlo Simulation Linux Quantitative Finance Derivatives Analytics Market Risk C See 2+     See less Skills  Structured Finance Software Development Interest Rate... Credit Bonds Java Valuation SQL Numerical Analysis Quantitative Analytics Monte Carlo Simulation Linux Quantitative Finance Derivatives Analytics Market Risk C See 2+     See less Structured Finance Software Development Interest Rate... Credit Bonds Java Valuation SQL Numerical Analysis Quantitative Analytics Monte Carlo Simulation Linux Quantitative Finance Derivatives Analytics Market Risk C See 2+     See less Structured Finance Software Development Interest Rate... Credit Bonds Java Valuation SQL Numerical Analysis Quantitative Analytics Monte Carlo Simulation Linux Quantitative Finance Derivatives Analytics Market Risk C See 2+     See less Education City University of New York-Baruch College Master of Science,  Financial Engineering 2007  – 2009 Graduated with honors: Magna Cum Laude San Francisco State University Bachelor of Science,  Physics 1991  – 1996 Minor in Pure Mathematics. \nGraduated with honors: Magna Cum Laude Courant Institute of Mathematical Sciences University of California, Davis Master of Science,  Theoretical Physics Graduated with honors: Magna Cum Laude University of California, Davis Doctor of Philosophy,  Theoretical Physics Graduated with honors: Magna Cum Laude City University of New York-Baruch College Master of Science,  Financial Engineering 2007  – 2009 Graduated with honors: Magna Cum Laude City University of New York-Baruch College Master of Science,  Financial Engineering 2007  – 2009 Graduated with honors: Magna Cum Laude City University of New York-Baruch College Master of Science,  Financial Engineering 2007  – 2009 Graduated with honors: Magna Cum Laude San Francisco State University Bachelor of Science,  Physics 1991  – 1996 Minor in Pure Mathematics. \nGraduated with honors: Magna Cum Laude San Francisco State University Bachelor of Science,  Physics 1991  – 1996 Minor in Pure Mathematics. \nGraduated with honors: Magna Cum Laude San Francisco State University Bachelor of Science,  Physics 1991  – 1996 Minor in Pure Mathematics. \nGraduated with honors: Magna Cum Laude Courant Institute of Mathematical Sciences Courant Institute of Mathematical Sciences Courant Institute of Mathematical Sciences University of California, Davis Master of Science,  Theoretical Physics Graduated with honors: Magna Cum Laude University of California, Davis Master of Science,  Theoretical Physics Graduated with honors: Magna Cum Laude University of California, Davis Master of Science,  Theoretical Physics Graduated with honors: Magna Cum Laude University of California, Davis Doctor of Philosophy,  Theoretical Physics Graduated with honors: Magna Cum Laude University of California, Davis Doctor of Philosophy,  Theoretical Physics Graduated with honors: Magna Cum Laude University of California, Davis Doctor of Philosophy,  Theoretical Physics Graduated with honors: Magna Cum Laude Honors & Awards Additional Honors & Awards Salih Neftci Memorial Scholarship, Baruch College (2010) \nDepartment of Energy Research Grant (2004, 2003) \nOutstanding Graduate Student Teaching Award (2003) \nOutstanding Graduate Student Incentive Award (1996) \nSan Francisco State University Award for Academic Excellence (1995) Additional Honors & Awards Salih Neftci Memorial Scholarship, Baruch College (2010) \nDepartment of Energy Research Grant (2004, 2003) \nOutstanding Graduate Student Teaching Award (2003) \nOutstanding Graduate Student Incentive Award (1996) \nSan Francisco State University Award for Academic Excellence (1995) Additional Honors & Awards Salih Neftci Memorial Scholarship, Baruch College (2010) \nDepartment of Energy Research Grant (2004, 2003) \nOutstanding Graduate Student Teaching Award (2003) \nOutstanding Graduate Student Incentive Award (1996) \nSan Francisco State University Award for Academic Excellence (1995) Additional Honors & Awards Salih Neftci Memorial Scholarship, Baruch College (2010) \nDepartment of Energy Research Grant (2004, 2003) \nOutstanding Graduate Student Teaching Award (2003) \nOutstanding Graduate Student Incentive Award (1996) \nSan Francisco State University Award for Academic Excellence (1995) ", "Summary Quantitative professional specializing in the financial risk management arena. Experience with bringing a financial risk management SaaS solution to market from the design stage to final implementation. Extensive knowledge of database-driven reporting, methods in financial modeling and stress testing/simulation techniques of fixed income, equity, derivatives, credit, FX and structured products. Entrepreneurial and motivated, a versatile programmer with client-facing experience. Summary Quantitative professional specializing in the financial risk management arena. Experience with bringing a financial risk management SaaS solution to market from the design stage to final implementation. Extensive knowledge of database-driven reporting, methods in financial modeling and stress testing/simulation techniques of fixed income, equity, derivatives, credit, FX and structured products. Entrepreneurial and motivated, a versatile programmer with client-facing experience. Quantitative professional specializing in the financial risk management arena. Experience with bringing a financial risk management SaaS solution to market from the design stage to final implementation. Extensive knowledge of database-driven reporting, methods in financial modeling and stress testing/simulation techniques of fixed income, equity, derivatives, credit, FX and structured products. Entrepreneurial and motivated, a versatile programmer with client-facing experience. Quantitative professional specializing in the financial risk management arena. Experience with bringing a financial risk management SaaS solution to market from the design stage to final implementation. Extensive knowledge of database-driven reporting, methods in financial modeling and stress testing/simulation techniques of fixed income, equity, derivatives, credit, FX and structured products. Entrepreneurial and motivated, a versatile programmer with client-facing experience. Experience Quantitative Strategist Quantifi, Inc. October 2013  –  September 2014  (1 year) Greater New York City Area Within the Client Services team, I was responsible for several client accounts including hedge funds, global banks and corporates. I oversaw client implementations including planning and scheduling, project scoping, and subsequent integration with Quantifi’s software. As one of the quantitative experts within the team, I often worked with clients to understand their unique needs and assisted development in enhancing our software to support new functionality. I regularly engaged in presales, client demos, and constructed proof-of-concepts demonstrating Quantifi’s award-winning capabilities when entering into new client relationships. \n \n- Performed full client risk implementations including Market Risk, Counterparty Risk and CVA. \n- Improved integration with market data providers including Markit, Bloomberg, Reuters, and Intex. \n- Extensive experience with CLO modelling. \n- Assisted in implementation of cutting-edge financial models. Financial Engineer IBM January 2012  –  September 2013  (1 year 9 months) Waltham, MA As a member of the product management team within IBM Risk Analytics, I was responsible for the architecture, construction, and implementation of cutting-edge risk management solutions. I was the lead Financial Engineer of IBM Algo Risk Reports on Cloud, an automated risk management reporting SaaS application used by hedge funds to comply with international regulatory standards and gain insights into their risk exposures. I regularly contributed to multiple projects and client needs simultaneously across production and development environments. Other projects included a workflow management tool used by European insurance companies, a Solvency II asset-management service, and an automated replicating portfolio solution.  \n \n-Modeled financial instruments spanning multiple asset classes including: Equity Multi-Factor Models, Willow-Tree lattice-based fixed income models, Monte Carlo asset-backed prepayment models, Credit and Credit Derivative models, and exotic derivative models;  \n-Responsible for construction of topical and regulatory scenario sets on market risk factors; \n-Implemented and maintained database models using database software, including Oracle; \n-Programmed scripts to integrate components into an automated process; \n-Built compliance reports for UCITS IV and Dodd-Frank Form PF using Business Objects and IBM Cognos BI software infrastructure; \n-Designed and implemented a tool to extract market data from third-party providers to use as input parameters to financial models; \n-Frequently contributed proposals and specifications to add new features and functionality to new and existing software; \n-Applied an in-house optimization framework for creation of replicating portfolios of assets that map to insurance liabilities. \n \nIBM Software Expertise: Algo Batch Editor, Algo Reporting Application, Algo Scenario Engine, Capital Workflow Manager, Cognos, Datamart, Input Data Manager, RiskWatch, RiskConnect, Unified Data Service, Associate Financial Engineer Algorithmics, an IBM Company January 2011  –  January 2012  (1 year 1 month) Algorithmics was acquired by IBM. Quantitative Intern Greenberg Capital May 2010  –  November 2010  (7 months) -Designed quantitative investment models and conducted extensive research and back-testing to determine profitability of trading techniques. \n-Constructed an algorithmic trading system in VBA using quantitative models and methods in statistical arbitrage. \n-Automated daily processes. Intern Arrow Electronics May 2006  –  August 2006  (4 months) First college freshman to be selected for Arrow's internship program. Responsibilities within the Corporate Communications department included: \n-Conducting extensive research on the reporting practices of Fortune 500 companies to assist CFO and Investor Relations with preparation of company's Annual Report and 10-K. \n-Developing methodology and proposals for allocation of philanthropic donations \n-Designing an interactive timeline of the company's history, profiled on the main page of the company's website using Adobe Flash. \n-Assisting in running a Town Hall, \"Year in Review\" broadcast seen by all Arrow employees nationwide. \n-Responsible for maintaining and updating the company's global Intranet Quantitative Strategist Quantifi, Inc. October 2013  –  September 2014  (1 year) Greater New York City Area Within the Client Services team, I was responsible for several client accounts including hedge funds, global banks and corporates. I oversaw client implementations including planning and scheduling, project scoping, and subsequent integration with Quantifi’s software. As one of the quantitative experts within the team, I often worked with clients to understand their unique needs and assisted development in enhancing our software to support new functionality. I regularly engaged in presales, client demos, and constructed proof-of-concepts demonstrating Quantifi’s award-winning capabilities when entering into new client relationships. \n \n- Performed full client risk implementations including Market Risk, Counterparty Risk and CVA. \n- Improved integration with market data providers including Markit, Bloomberg, Reuters, and Intex. \n- Extensive experience with CLO modelling. \n- Assisted in implementation of cutting-edge financial models. Quantitative Strategist Quantifi, Inc. October 2013  –  September 2014  (1 year) Greater New York City Area Within the Client Services team, I was responsible for several client accounts including hedge funds, global banks and corporates. I oversaw client implementations including planning and scheduling, project scoping, and subsequent integration with Quantifi’s software. As one of the quantitative experts within the team, I often worked with clients to understand their unique needs and assisted development in enhancing our software to support new functionality. I regularly engaged in presales, client demos, and constructed proof-of-concepts demonstrating Quantifi’s award-winning capabilities when entering into new client relationships. \n \n- Performed full client risk implementations including Market Risk, Counterparty Risk and CVA. \n- Improved integration with market data providers including Markit, Bloomberg, Reuters, and Intex. \n- Extensive experience with CLO modelling. \n- Assisted in implementation of cutting-edge financial models. Financial Engineer IBM January 2012  –  September 2013  (1 year 9 months) Waltham, MA As a member of the product management team within IBM Risk Analytics, I was responsible for the architecture, construction, and implementation of cutting-edge risk management solutions. I was the lead Financial Engineer of IBM Algo Risk Reports on Cloud, an automated risk management reporting SaaS application used by hedge funds to comply with international regulatory standards and gain insights into their risk exposures. I regularly contributed to multiple projects and client needs simultaneously across production and development environments. Other projects included a workflow management tool used by European insurance companies, a Solvency II asset-management service, and an automated replicating portfolio solution.  \n \n-Modeled financial instruments spanning multiple asset classes including: Equity Multi-Factor Models, Willow-Tree lattice-based fixed income models, Monte Carlo asset-backed prepayment models, Credit and Credit Derivative models, and exotic derivative models;  \n-Responsible for construction of topical and regulatory scenario sets on market risk factors; \n-Implemented and maintained database models using database software, including Oracle; \n-Programmed scripts to integrate components into an automated process; \n-Built compliance reports for UCITS IV and Dodd-Frank Form PF using Business Objects and IBM Cognos BI software infrastructure; \n-Designed and implemented a tool to extract market data from third-party providers to use as input parameters to financial models; \n-Frequently contributed proposals and specifications to add new features and functionality to new and existing software; \n-Applied an in-house optimization framework for creation of replicating portfolios of assets that map to insurance liabilities. \n \nIBM Software Expertise: Algo Batch Editor, Algo Reporting Application, Algo Scenario Engine, Capital Workflow Manager, Cognos, Datamart, Input Data Manager, RiskWatch, RiskConnect, Unified Data Service, Financial Engineer IBM January 2012  –  September 2013  (1 year 9 months) Waltham, MA As a member of the product management team within IBM Risk Analytics, I was responsible for the architecture, construction, and implementation of cutting-edge risk management solutions. I was the lead Financial Engineer of IBM Algo Risk Reports on Cloud, an automated risk management reporting SaaS application used by hedge funds to comply with international regulatory standards and gain insights into their risk exposures. I regularly contributed to multiple projects and client needs simultaneously across production and development environments. Other projects included a workflow management tool used by European insurance companies, a Solvency II asset-management service, and an automated replicating portfolio solution.  \n \n-Modeled financial instruments spanning multiple asset classes including: Equity Multi-Factor Models, Willow-Tree lattice-based fixed income models, Monte Carlo asset-backed prepayment models, Credit and Credit Derivative models, and exotic derivative models;  \n-Responsible for construction of topical and regulatory scenario sets on market risk factors; \n-Implemented and maintained database models using database software, including Oracle; \n-Programmed scripts to integrate components into an automated process; \n-Built compliance reports for UCITS IV and Dodd-Frank Form PF using Business Objects and IBM Cognos BI software infrastructure; \n-Designed and implemented a tool to extract market data from third-party providers to use as input parameters to financial models; \n-Frequently contributed proposals and specifications to add new features and functionality to new and existing software; \n-Applied an in-house optimization framework for creation of replicating portfolios of assets that map to insurance liabilities. \n \nIBM Software Expertise: Algo Batch Editor, Algo Reporting Application, Algo Scenario Engine, Capital Workflow Manager, Cognos, Datamart, Input Data Manager, RiskWatch, RiskConnect, Unified Data Service, Associate Financial Engineer Algorithmics, an IBM Company January 2011  –  January 2012  (1 year 1 month) Algorithmics was acquired by IBM. Associate Financial Engineer Algorithmics, an IBM Company January 2011  –  January 2012  (1 year 1 month) Algorithmics was acquired by IBM. Quantitative Intern Greenberg Capital May 2010  –  November 2010  (7 months) -Designed quantitative investment models and conducted extensive research and back-testing to determine profitability of trading techniques. \n-Constructed an algorithmic trading system in VBA using quantitative models and methods in statistical arbitrage. \n-Automated daily processes. Quantitative Intern Greenberg Capital May 2010  –  November 2010  (7 months) -Designed quantitative investment models and conducted extensive research and back-testing to determine profitability of trading techniques. \n-Constructed an algorithmic trading system in VBA using quantitative models and methods in statistical arbitrage. \n-Automated daily processes. Intern Arrow Electronics May 2006  –  August 2006  (4 months) First college freshman to be selected for Arrow's internship program. Responsibilities within the Corporate Communications department included: \n-Conducting extensive research on the reporting practices of Fortune 500 companies to assist CFO and Investor Relations with preparation of company's Annual Report and 10-K. \n-Developing methodology and proposals for allocation of philanthropic donations \n-Designing an interactive timeline of the company's history, profiled on the main page of the company's website using Adobe Flash. \n-Assisting in running a Town Hall, \"Year in Review\" broadcast seen by all Arrow employees nationwide. \n-Responsible for maintaining and updating the company's global Intranet Intern Arrow Electronics May 2006  –  August 2006  (4 months) First college freshman to be selected for Arrow's internship program. Responsibilities within the Corporate Communications department included: \n-Conducting extensive research on the reporting practices of Fortune 500 companies to assist CFO and Investor Relations with preparation of company's Annual Report and 10-K. \n-Developing methodology and proposals for allocation of philanthropic donations \n-Designing an interactive timeline of the company's history, profiled on the main page of the company's website using Adobe Flash. \n-Assisting in running a Town Hall, \"Year in Review\" broadcast seen by all Arrow employees nationwide. \n-Responsible for maintaining and updating the company's global Intranet Skills VBA Financial Modeling C++ Bloomberg Portfolio Management Quantitative Finance Fixed Income Equities Risk Management Statistics Financial Engineering Stress Testing VAR Monte Carlo Simulation Cognos Oracle SQL Dodd-Frank UCITS IV Solvency II Portfolio Replication Software Design Financial Reporting Enterprise Software Exotic Derivatives Statistical Modeling Statistical Arbitrage Time Series Analysis Enterprise Risk... Unix Business Objects CPLEX Optimization Microsoft Office Matlab HTML R Quantitative Analysis Trading Systems Market Risk Derivatives Credit Risk Options FX Stochastic Calculus Equity Derivatives Risk Analysis ALM Financial Risk Hedge Funds FX Options See 35+     See less Skills  VBA Financial Modeling C++ Bloomberg Portfolio Management Quantitative Finance Fixed Income Equities Risk Management Statistics Financial Engineering Stress Testing VAR Monte Carlo Simulation Cognos Oracle SQL Dodd-Frank UCITS IV Solvency II Portfolio Replication Software Design Financial Reporting Enterprise Software Exotic Derivatives Statistical Modeling Statistical Arbitrage Time Series Analysis Enterprise Risk... Unix Business Objects CPLEX Optimization Microsoft Office Matlab HTML R Quantitative Analysis Trading Systems Market Risk Derivatives Credit Risk Options FX Stochastic Calculus Equity Derivatives Risk Analysis ALM Financial Risk Hedge Funds FX Options See 35+     See less VBA Financial Modeling C++ Bloomberg Portfolio Management Quantitative Finance Fixed Income Equities Risk Management Statistics Financial Engineering Stress Testing VAR Monte Carlo Simulation Cognos Oracle SQL Dodd-Frank UCITS IV Solvency II Portfolio Replication Software Design Financial Reporting Enterprise Software Exotic Derivatives Statistical Modeling Statistical Arbitrage Time Series Analysis Enterprise Risk... Unix Business Objects CPLEX Optimization Microsoft Office Matlab HTML R Quantitative Analysis Trading Systems Market Risk Derivatives Credit Risk Options FX Stochastic Calculus Equity Derivatives Risk Analysis ALM Financial Risk Hedge Funds FX Options See 35+     See less VBA Financial Modeling C++ Bloomberg Portfolio Management Quantitative Finance Fixed Income Equities Risk Management Statistics Financial Engineering Stress Testing VAR Monte Carlo Simulation Cognos Oracle SQL Dodd-Frank UCITS IV Solvency II Portfolio Replication Software Design Financial Reporting Enterprise Software Exotic Derivatives Statistical Modeling Statistical Arbitrage Time Series Analysis Enterprise Risk... Unix Business Objects CPLEX Optimization Microsoft Office Matlab HTML R Quantitative Analysis Trading Systems Market Risk Derivatives Credit Risk Options FX Stochastic Calculus Equity Derivatives Risk Analysis ALM Financial Risk Hedge Funds FX Options See 35+     See less Education Cornell University BA,  Mathematics ,  Economics 2005  – 2009 Activities and Societies:  Delta Kappa Epsilon Hofstra University, Frank G. Zarb School of Business M.S,  Quantitative Finance 2009  – 2010 Activities and Societies:  HQT - Hofstra Quants & Traders Cornell University BA,  Mathematics ,  Economics 2005  – 2009 Activities and Societies:  Delta Kappa Epsilon Cornell University BA,  Mathematics ,  Economics 2005  – 2009 Activities and Societies:  Delta Kappa Epsilon Cornell University BA,  Mathematics ,  Economics 2005  – 2009 Activities and Societies:  Delta Kappa Epsilon Hofstra University, Frank G. Zarb School of Business M.S,  Quantitative Finance 2009  – 2010 Activities and Societies:  HQT - Hofstra Quants & Traders Hofstra University, Frank G. Zarb School of Business M.S,  Quantitative Finance 2009  – 2010 Activities and Societies:  HQT - Hofstra Quants & Traders Hofstra University, Frank G. Zarb School of Business M.S,  Quantitative Finance 2009  – 2010 Activities and Societies:  HQT - Hofstra Quants & Traders "]}