{"position": "Legal Assistant", "company": "Google", "profiles": ["Experience Legal Assistant Akorbi at Google October 2014  – Present (10 months) Mountain View, CA Corporate Legal Assistant Minami Tamaki May 2014  –  October 2014  (6 months) San Francisco, CA Case Status Paralegal Berry & Berry, Law Offices February 2014  –  May 2014  (4 months) Oakland, CA Office Administrator IntroMedic America, Inc. September 2013  –  February 2014  (6 months) Pleasanton, CA Legal Assistant Law Office of Brian H. Song March 2013  –  August 2013  (6 months) Santa Clara, CA Receptionist/Paralegal Assitant/Interpreter Kim & Kang, Law Offices 2011  –  2012  (1 year) Legal Assistant Akorbi at Google October 2014  – Present (10 months) Mountain View, CA Legal Assistant Akorbi at Google October 2014  – Present (10 months) Mountain View, CA Corporate Legal Assistant Minami Tamaki May 2014  –  October 2014  (6 months) San Francisco, CA Corporate Legal Assistant Minami Tamaki May 2014  –  October 2014  (6 months) San Francisco, CA Case Status Paralegal Berry & Berry, Law Offices February 2014  –  May 2014  (4 months) Oakland, CA Case Status Paralegal Berry & Berry, Law Offices February 2014  –  May 2014  (4 months) Oakland, CA Office Administrator IntroMedic America, Inc. September 2013  –  February 2014  (6 months) Pleasanton, CA Office Administrator IntroMedic America, Inc. September 2013  –  February 2014  (6 months) Pleasanton, CA Legal Assistant Law Office of Brian H. Song March 2013  –  August 2013  (6 months) Santa Clara, CA Legal Assistant Law Office of Brian H. Song March 2013  –  August 2013  (6 months) Santa Clara, CA Receptionist/Paralegal Assitant/Interpreter Kim & Kang, Law Offices 2011  –  2012  (1 year) Receptionist/Paralegal Assitant/Interpreter Kim & Kang, Law Offices 2011  –  2012  (1 year) Languages Korean Korean Korean Skills Top Skills 5 PowerPoint 3 Research 3 Microsoft Office 3 Data Entry 2 Microsoft Word 1 Microsoft Excel 1 Event Planning 0 Legal Research 0 Client Billing 0 Westlaw Eunnah also knows about... 0 Legal Documents 0 Legal Translation 0 Customer Service 0 Social Media 0 Public Speaking 0 Editing 0 Data Analysis Skills  Top Skills 5 PowerPoint 3 Research 3 Microsoft Office 3 Data Entry 2 Microsoft Word 1 Microsoft Excel 1 Event Planning 0 Legal Research 0 Client Billing 0 Westlaw Eunnah also knows about... 0 Legal Documents 0 Legal Translation 0 Customer Service 0 Social Media 0 Public Speaking 0 Editing 0 Data Analysis Top Skills 5 PowerPoint 3 Research 3 Microsoft Office 3 Data Entry 2 Microsoft Word 1 Microsoft Excel 1 Event Planning 0 Legal Research 0 Client Billing 0 Westlaw Eunnah also knows about... 0 Legal Documents 0 Legal Translation 0 Customer Service 0 Social Media 0 Public Speaking 0 Editing 0 Data Analysis Top Skills 5 PowerPoint 3 Research 3 Microsoft Office 3 Data Entry 2 Microsoft Word 1 Microsoft Excel 1 Event Planning 0 Legal Research 0 Client Billing 0 Westlaw Eunnah also knows about... 0 Legal Documents 0 Legal Translation 0 Customer Service 0 Social Media 0 Public Speaking 0 Editing 0 Data Analysis                     0 Legal Documents 0 Legal Translation 0 Customer Service 0 Social Media 0 Public Speaking 0 Editing 0 Data Analysis Education University of California, Santa Cruz Paralegal Certificate,  Legal Studies 2013  – 2013 University of California, San Diego Bachelor of Arts (B.A.),  Human Development 2008  – 2012 University of California, Santa Cruz Paralegal Certificate,  Legal Studies 2013  – 2013 University of California, Santa Cruz Paralegal Certificate,  Legal Studies 2013  – 2013 University of California, Santa Cruz Paralegal Certificate,  Legal Studies 2013  – 2013 University of California, San Diego Bachelor of Arts (B.A.),  Human Development 2008  – 2012 University of California, San Diego Bachelor of Arts (B.A.),  Human Development 2008  – 2012 University of California, San Diego Bachelor of Arts (B.A.),  Human Development 2008  – 2012 ", "Summary After returning from studying abroad in Tokyo, Japan under the UC Education Abroad Program, I graduated UC Irvine in 2011 with a double major in Political Science and International Studies with an Education minor. \nAlthough I enjoy working with children, I am currently building experience and working towards a career in which I can maintain my fluency in both English and Japanese. Through my experiences in the educational field, I understand the importance of procuring results and creating reliable relationships with clients which is applicable to business as well. \nI place an emphasis on promoting interpersonal relations in both professional and private settings, and constantly aspire to maintain a proactive environment that encourages positive growth. Specialties:Fluent in Japanese Summary After returning from studying abroad in Tokyo, Japan under the UC Education Abroad Program, I graduated UC Irvine in 2011 with a double major in Political Science and International Studies with an Education minor. \nAlthough I enjoy working with children, I am currently building experience and working towards a career in which I can maintain my fluency in both English and Japanese. Through my experiences in the educational field, I understand the importance of procuring results and creating reliable relationships with clients which is applicable to business as well. \nI place an emphasis on promoting interpersonal relations in both professional and private settings, and constantly aspire to maintain a proactive environment that encourages positive growth. Specialties:Fluent in Japanese After returning from studying abroad in Tokyo, Japan under the UC Education Abroad Program, I graduated UC Irvine in 2011 with a double major in Political Science and International Studies with an Education minor. \nAlthough I enjoy working with children, I am currently building experience and working towards a career in which I can maintain my fluency in both English and Japanese. Through my experiences in the educational field, I understand the importance of procuring results and creating reliable relationships with clients which is applicable to business as well. \nI place an emphasis on promoting interpersonal relations in both professional and private settings, and constantly aspire to maintain a proactive environment that encourages positive growth. Specialties:Fluent in Japanese After returning from studying abroad in Tokyo, Japan under the UC Education Abroad Program, I graduated UC Irvine in 2011 with a double major in Political Science and International Studies with an Education minor. \nAlthough I enjoy working with children, I am currently building experience and working towards a career in which I can maintain my fluency in both English and Japanese. Through my experiences in the educational field, I understand the importance of procuring results and creating reliable relationships with clients which is applicable to business as well. \nI place an emphasis on promoting interpersonal relations in both professional and private settings, and constantly aspire to maintain a proactive environment that encourages positive growth. Specialties:Fluent in Japanese Experience Legal Assistant Google June 2015  – Present (2 months) Mountain View Content Review Coordinator Google via Vaco March 2015  –  June 2015  (4 months) Mountain View Legal Assistant Google via Vaco January 2015  –  March 2015  (3 months) Mountain View Operations Specialist Helpouts by Google via Vaco May 2014  –  January 2015  (9 months) Mountain View Operations Specialist Google Trusted Stores via Vaco October 2013  –  May 2014  (8 months) Mountain View Relationship Banker Union Bank August 2011  –  October 2013  (2 years 3 months) San Jose PR & Marketing Intern SwimSpot April 2011  –  June 2011  (3 months) Administrative Assistant Hitotsubashi University Faculty of Law November 2010  –  March 2011  (5 months) Intern Hachioji City Council July 2010  –  March 2011  (9 months) Teaching Assistant Kumon Learning Center for Math and Reading December 2009  –  July 2010  (8 months) YMCA Day Camp Leader Northwest YMCA June 2009  –  August 2009  (3 months) Teaching Assistant Turtle Rock Elementary School March 2009  –  June 2009  (4 months) Legal Assistant Google June 2015  – Present (2 months) Mountain View Legal Assistant Google June 2015  – Present (2 months) Mountain View Content Review Coordinator Google via Vaco March 2015  –  June 2015  (4 months) Mountain View Content Review Coordinator Google via Vaco March 2015  –  June 2015  (4 months) Mountain View Legal Assistant Google via Vaco January 2015  –  March 2015  (3 months) Mountain View Legal Assistant Google via Vaco January 2015  –  March 2015  (3 months) Mountain View Operations Specialist Helpouts by Google via Vaco May 2014  –  January 2015  (9 months) Mountain View Operations Specialist Helpouts by Google via Vaco May 2014  –  January 2015  (9 months) Mountain View Operations Specialist Google Trusted Stores via Vaco October 2013  –  May 2014  (8 months) Mountain View Operations Specialist Google Trusted Stores via Vaco October 2013  –  May 2014  (8 months) Mountain View Relationship Banker Union Bank August 2011  –  October 2013  (2 years 3 months) San Jose Relationship Banker Union Bank August 2011  –  October 2013  (2 years 3 months) San Jose PR & Marketing Intern SwimSpot April 2011  –  June 2011  (3 months) PR & Marketing Intern SwimSpot April 2011  –  June 2011  (3 months) Administrative Assistant Hitotsubashi University Faculty of Law November 2010  –  March 2011  (5 months) Administrative Assistant Hitotsubashi University Faculty of Law November 2010  –  March 2011  (5 months) Intern Hachioji City Council July 2010  –  March 2011  (9 months) Intern Hachioji City Council July 2010  –  March 2011  (9 months) Teaching Assistant Kumon Learning Center for Math and Reading December 2009  –  July 2010  (8 months) Teaching Assistant Kumon Learning Center for Math and Reading December 2009  –  July 2010  (8 months) YMCA Day Camp Leader Northwest YMCA June 2009  –  August 2009  (3 months) YMCA Day Camp Leader Northwest YMCA June 2009  –  August 2009  (3 months) Teaching Assistant Turtle Rock Elementary School March 2009  –  June 2009  (4 months) Teaching Assistant Turtle Rock Elementary School March 2009  –  June 2009  (4 months) Languages English Native or bilingual proficiency Japanese Native or bilingual proficiency English Native or bilingual proficiency Japanese Native or bilingual proficiency English Native or bilingual proficiency Japanese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 16 Leadership 14 Marketing 13 Training 11 Public Relations 10 Teamwork 10 Microsoft Word 8 PowerPoint 7 Nonprofits 7 Program Management 6 Blogging Takako also knows about... 5 Project Management 4 Teaching 4 Retail 3 Proofreading 3 English 3 Financial Analysis 3 Financial Modeling 3 Accounting 2 Policy 2 Financial Reporting 2 Strategic Financial... 2 Non-profits Skills  Top Skills 16 Leadership 14 Marketing 13 Training 11 Public Relations 10 Teamwork 10 Microsoft Word 8 PowerPoint 7 Nonprofits 7 Program Management 6 Blogging Takako also knows about... 5 Project Management 4 Teaching 4 Retail 3 Proofreading 3 English 3 Financial Analysis 3 Financial Modeling 3 Accounting 2 Policy 2 Financial Reporting 2 Strategic Financial... 2 Non-profits Top Skills 16 Leadership 14 Marketing 13 Training 11 Public Relations 10 Teamwork 10 Microsoft Word 8 PowerPoint 7 Nonprofits 7 Program Management 6 Blogging Takako also knows about... 5 Project Management 4 Teaching 4 Retail 3 Proofreading 3 English 3 Financial Analysis 3 Financial Modeling 3 Accounting 2 Policy 2 Financial Reporting 2 Strategic Financial... 2 Non-profits Top Skills 16 Leadership 14 Marketing 13 Training 11 Public Relations 10 Teamwork 10 Microsoft Word 8 PowerPoint 7 Nonprofits 7 Program Management 6 Blogging Takako also knows about... 5 Project Management 4 Teaching 4 Retail 3 Proofreading 3 English 3 Financial Analysis 3 Financial Modeling 3 Accounting 2 Policy 2 Financial Reporting 2 Strategic Financial... 2 Non-profits                     5 Project Management 4 Teaching 4 Retail 3 Proofreading 3 English 3 Financial Analysis 3 Financial Modeling 3 Accounting 2 Policy 2 Financial Reporting 2 Strategic Financial... 2 Non-profits Education Hitotsubashi University University of California ,  Education Abroad Program 2010  – 2011 Activities and Societies:  Belly Dance Circle University of California, Irvine Bachelor of Arts,  Political Science; Bachelor of Arts ,  International Studies 2007  – 2011 Minor in Educational Studies Activities and Societies:  Gamma Phi Beta Sorority Hitotsubashi University University of California ,  Education Abroad Program 2010  – 2011 Activities and Societies:  Belly Dance Circle Hitotsubashi University University of California ,  Education Abroad Program 2010  – 2011 Activities and Societies:  Belly Dance Circle Hitotsubashi University University of California ,  Education Abroad Program 2010  – 2011 Activities and Societies:  Belly Dance Circle University of California, Irvine Bachelor of Arts,  Political Science; Bachelor of Arts ,  International Studies 2007  – 2011 Minor in Educational Studies Activities and Societies:  Gamma Phi Beta Sorority University of California, Irvine Bachelor of Arts,  Political Science; Bachelor of Arts ,  International Studies 2007  – 2011 Minor in Educational Studies Activities and Societies:  Gamma Phi Beta Sorority University of California, Irvine Bachelor of Arts,  Political Science; Bachelor of Arts ,  International Studies 2007  – 2011 Minor in Educational Studies Activities and Societies:  Gamma Phi Beta Sorority ", "Experience Litigation Legal Assistant Google August 2014  – Present (1 year) Mountain View, CA Legal Operations Assistant Google Asia Pacific Pte Ltd September 2011  –  July 2014  (2 years 11 months) Singapore Legal Assistant Google September 2010  –  September 2011  (1 year 1 month) Mountain View, CA Policy Intern Assembly of European Regions (AER) June 2009  –  August 2009  (3 months) Strasbourg, France Worked with the secretariat section focusing on projects covering regional & cohesion policy, rural development & agriculture economy, research & innovation, energy & climate change, spatial planning & transports. Blogger Vignoble Klur June 2008  –  August 2008  (3 months) Katzenthal, France Wrote articles in French and English on the sustainable tourism initiatives in Alsace-Lorraine.  Environmental Policy Intern LIEBHERR France June 2007  –  August 2007  (3 months) Colmar Area, France Focused on compliance with the EU directive on Registration, Evaluation, Authorisation and Restriction of Chemicals (REACh). Research Assistant AECL June 2006  –  August 2006  (3 months) Deep River, Ontario Led a research project seeking to establish baseline values of heavy metals in fresh water bodies. Litigation Legal Assistant Google August 2014  – Present (1 year) Mountain View, CA Litigation Legal Assistant Google August 2014  – Present (1 year) Mountain View, CA Legal Operations Assistant Google Asia Pacific Pte Ltd September 2011  –  July 2014  (2 years 11 months) Singapore Legal Operations Assistant Google Asia Pacific Pte Ltd September 2011  –  July 2014  (2 years 11 months) Singapore Legal Assistant Google September 2010  –  September 2011  (1 year 1 month) Mountain View, CA Legal Assistant Google September 2010  –  September 2011  (1 year 1 month) Mountain View, CA Policy Intern Assembly of European Regions (AER) June 2009  –  August 2009  (3 months) Strasbourg, France Worked with the secretariat section focusing on projects covering regional & cohesion policy, rural development & agriculture economy, research & innovation, energy & climate change, spatial planning & transports. Policy Intern Assembly of European Regions (AER) June 2009  –  August 2009  (3 months) Strasbourg, France Worked with the secretariat section focusing on projects covering regional & cohesion policy, rural development & agriculture economy, research & innovation, energy & climate change, spatial planning & transports. Blogger Vignoble Klur June 2008  –  August 2008  (3 months) Katzenthal, France Wrote articles in French and English on the sustainable tourism initiatives in Alsace-Lorraine.  Blogger Vignoble Klur June 2008  –  August 2008  (3 months) Katzenthal, France Wrote articles in French and English on the sustainable tourism initiatives in Alsace-Lorraine.  Environmental Policy Intern LIEBHERR France June 2007  –  August 2007  (3 months) Colmar Area, France Focused on compliance with the EU directive on Registration, Evaluation, Authorisation and Restriction of Chemicals (REACh). Environmental Policy Intern LIEBHERR France June 2007  –  August 2007  (3 months) Colmar Area, France Focused on compliance with the EU directive on Registration, Evaluation, Authorisation and Restriction of Chemicals (REACh). Research Assistant AECL June 2006  –  August 2006  (3 months) Deep River, Ontario Led a research project seeking to establish baseline values of heavy metals in fresh water bodies. Research Assistant AECL June 2006  –  August 2006  (3 months) Deep River, Ontario Led a research project seeking to establish baseline values of heavy metals in fresh water bodies. Languages English Native or bilingual proficiency French Native or bilingual proficiency Russian Limited working proficiency Italian Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency Russian Limited working proficiency Italian Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency Russian Limited working proficiency Italian Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Top Skills 8 International Relations 7 Political Science 6 Russian 6 French 5 Policy Analysis 4 Foreign Policy 4 Politics 3 Legal Writing 3 Policy 2 Editing Jessica also knows about... 2 Public Speaking 1 Qualitative Research 1 Strategy 1 International... 1 Legal Research Skills  Top Skills 8 International Relations 7 Political Science 6 Russian 6 French 5 Policy Analysis 4 Foreign Policy 4 Politics 3 Legal Writing 3 Policy 2 Editing Jessica also knows about... 2 Public Speaking 1 Qualitative Research 1 Strategy 1 International... 1 Legal Research Top Skills 8 International Relations 7 Political Science 6 Russian 6 French 5 Policy Analysis 4 Foreign Policy 4 Politics 3 Legal Writing 3 Policy 2 Editing Jessica also knows about... 2 Public Speaking 1 Qualitative Research 1 Strategy 1 International... 1 Legal Research Top Skills 8 International Relations 7 Political Science 6 Russian 6 French 5 Policy Analysis 4 Foreign Policy 4 Politics 3 Legal Writing 3 Policy 2 Editing Jessica also knows about... 2 Public Speaking 1 Qualitative Research 1 Strategy 1 International... 1 Legal Research                     2 Public Speaking 1 Qualitative Research 1 Strategy 1 International... 1 Legal Research Education Santa Clara University School of Law Doctor of Law (JD) , Dean's list for 2014-2015 2014  – 2018 Activities and Societies:  Associate - Santa Clara Journal of International Law;\nGalloway Moot Court quarter finalist (Spring 2015) Institut d'Etudes politiques de Strasbourg Certificate in European and Policy Studies,  Politics , Mention Bien 2009  – 2010 Claremont McKenna College BA,  Environmental Policy , Graduated Magna Cum Laude; Dean's List 2005  – 2009 Activities and Societies:  Claremont Colleges Ballroom Dance Company - president;\nStudent Movement for Real Change Santa Clara University School of Law Doctor of Law (JD) , Dean's list for 2014-2015 2014  – 2018 Activities and Societies:  Associate - Santa Clara Journal of International Law;\nGalloway Moot Court quarter finalist (Spring 2015) Santa Clara University School of Law Doctor of Law (JD) , Dean's list for 2014-2015 2014  – 2018 Activities and Societies:  Associate - Santa Clara Journal of International Law;\nGalloway Moot Court quarter finalist (Spring 2015) Santa Clara University School of Law Doctor of Law (JD) , Dean's list for 2014-2015 2014  – 2018 Activities and Societies:  Associate - Santa Clara Journal of International Law;\nGalloway Moot Court quarter finalist (Spring 2015) Institut d'Etudes politiques de Strasbourg Certificate in European and Policy Studies,  Politics , Mention Bien 2009  – 2010 Institut d'Etudes politiques de Strasbourg Certificate in European and Policy Studies,  Politics , Mention Bien 2009  – 2010 Institut d'Etudes politiques de Strasbourg Certificate in European and Policy Studies,  Politics , Mention Bien 2009  – 2010 Claremont McKenna College BA,  Environmental Policy , Graduated Magna Cum Laude; Dean's List 2005  – 2009 Activities and Societies:  Claremont Colleges Ballroom Dance Company - president;\nStudent Movement for Real Change Claremont McKenna College BA,  Environmental Policy , Graduated Magna Cum Laude; Dean's List 2005  – 2009 Activities and Societies:  Claremont Colleges Ballroom Dance Company - president;\nStudent Movement for Real Change Claremont McKenna College BA,  Environmental Policy , Graduated Magna Cum Laude; Dean's List 2005  – 2009 Activities and Societies:  Claremont Colleges Ballroom Dance Company - president;\nStudent Movement for Real Change ", "Summary Fearless New Yorker Yogi with a passion for building people, roles, teams, and companies in New York or around the world. I thrive in the areas of startup culture, project management, product launch management, internationally distributed teams, communication, teaching, and balancing work with life. Summary Fearless New Yorker Yogi with a passion for building people, roles, teams, and companies in New York or around the world. I thrive in the areas of startup culture, project management, product launch management, internationally distributed teams, communication, teaching, and balancing work with life. Fearless New Yorker Yogi with a passion for building people, roles, teams, and companies in New York or around the world. I thrive in the areas of startup culture, project management, product launch management, internationally distributed teams, communication, teaching, and balancing work with life. Fearless New Yorker Yogi with a passion for building people, roles, teams, and companies in New York or around the world. I thrive in the areas of startup culture, project management, product launch management, internationally distributed teams, communication, teaching, and balancing work with life. Experience Pre Sales Solutions Consultant, DoubleClick Google July 2013  – Present (2 years 1 month) New York, NY Entrepreneur in Training MPG Inc. March 2009  – Present (6 years 5 months) Greater New York City Area •\tExploring development of startup idea. Immersing in startup community as member of NYC Tech Meetups, Startup Pitch Night, Women in Tech, and Mobile Developers. Enrolled in General Assembly classes and entrepreneur conferences such as FailCon and YC Startup School to strengthen technical skills and connect with key influencers and mentors. Currently in idea validation / user feedback stage. \n•\tFounded small business to deliver Bikram yoga lessons and custom French pastries for weddings and birthdays. 1000s of local New Yorkers served. Revenue currently at pace with expenses. Platform Specialist MediaMath December 2012  –  July 2013  (8 months) Asia/Latin America Manager, AdWords Product Specialists Google June 2007  –  March 2009  (1 year 10 months) Greater New York City Area o\tBuilt multilingual team of 16 product specialists and sales engineers across Asia and Latin America. Secured 6 promotions and numerous individual awards. Team spearheaded 200 local product projects and provided support to 200+ sales members. Group supported over US $100 million in advertising revenue.  \no\tDefined the hiring, compensation and career path of team in collaboration with HR business partners. Obtained budget/headcount approvals from executive management and regional heads. \no\tProgram managed cross-functional collaboration with Product, Engineering, and Sales leadership to improve local AdWords releases, rank product priorities and build a customer support infrastructure for key launches. Asia/Latin America AdWords Product Specialist Google April 2005  –  June 2007  (2 years 3 months) Greater New York City Area o\tCreated training program for AdWords sales teams and top Fortune 500 advertising clients for Google’s first expansion into Asia and Latin America. \no\tIncorporated interactive learning and development techniques to track metrics and improve audience retention. \no\tTroubleshooted and escalated product issues from direct clients and sales to lead Engineering teams. Global AdWords Product Specialist Google August 2003  –  April 2005  (1 year 9 months) Greater New York City Area o\tTrained 100s of AdWords sales representatives in the U.S. and Europe on key product updates.  \no\tMet with top agencies and advertisers to sell new launches, troubleshoot issues and prioritize future needs. \no\tAwards: 2005 Google Luminary Award (top 5% global performers), several peer recognition awards Project Manager Bigfoot Interactive February 2000  –  July 2003  (3 years 6 months) Greater New York City Area Collaborated with clients, sales, and engineering to create integrated email marketing solutions. Associate Creative Director The Romann Group October 1999  –  February 2000  (5 months) Greater New York City Area Defined marketing plans for traditional/internet clients in a medium sized advertising agency. Legal Assistant/Equity Analyst Soros Fund Management June 1996  –  November 1998  (2 years 6 months) Greater New York City Area Monitored and reported on Quantum Fund performance for international investment advisory firm. Pre Sales Solutions Consultant, DoubleClick Google July 2013  – Present (2 years 1 month) New York, NY Pre Sales Solutions Consultant, DoubleClick Google July 2013  – Present (2 years 1 month) New York, NY Entrepreneur in Training MPG Inc. March 2009  – Present (6 years 5 months) Greater New York City Area •\tExploring development of startup idea. Immersing in startup community as member of NYC Tech Meetups, Startup Pitch Night, Women in Tech, and Mobile Developers. Enrolled in General Assembly classes and entrepreneur conferences such as FailCon and YC Startup School to strengthen technical skills and connect with key influencers and mentors. Currently in idea validation / user feedback stage. \n•\tFounded small business to deliver Bikram yoga lessons and custom French pastries for weddings and birthdays. 1000s of local New Yorkers served. Revenue currently at pace with expenses. Entrepreneur in Training MPG Inc. March 2009  – Present (6 years 5 months) Greater New York City Area •\tExploring development of startup idea. Immersing in startup community as member of NYC Tech Meetups, Startup Pitch Night, Women in Tech, and Mobile Developers. Enrolled in General Assembly classes and entrepreneur conferences such as FailCon and YC Startup School to strengthen technical skills and connect with key influencers and mentors. Currently in idea validation / user feedback stage. \n•\tFounded small business to deliver Bikram yoga lessons and custom French pastries for weddings and birthdays. 1000s of local New Yorkers served. Revenue currently at pace with expenses. Platform Specialist MediaMath December 2012  –  July 2013  (8 months) Platform Specialist MediaMath December 2012  –  July 2013  (8 months) Asia/Latin America Manager, AdWords Product Specialists Google June 2007  –  March 2009  (1 year 10 months) Greater New York City Area o\tBuilt multilingual team of 16 product specialists and sales engineers across Asia and Latin America. Secured 6 promotions and numerous individual awards. Team spearheaded 200 local product projects and provided support to 200+ sales members. Group supported over US $100 million in advertising revenue.  \no\tDefined the hiring, compensation and career path of team in collaboration with HR business partners. Obtained budget/headcount approvals from executive management and regional heads. \no\tProgram managed cross-functional collaboration with Product, Engineering, and Sales leadership to improve local AdWords releases, rank product priorities and build a customer support infrastructure for key launches. Asia/Latin America Manager, AdWords Product Specialists Google June 2007  –  March 2009  (1 year 10 months) Greater New York City Area o\tBuilt multilingual team of 16 product specialists and sales engineers across Asia and Latin America. Secured 6 promotions and numerous individual awards. Team spearheaded 200 local product projects and provided support to 200+ sales members. Group supported over US $100 million in advertising revenue.  \no\tDefined the hiring, compensation and career path of team in collaboration with HR business partners. Obtained budget/headcount approvals from executive management and regional heads. \no\tProgram managed cross-functional collaboration with Product, Engineering, and Sales leadership to improve local AdWords releases, rank product priorities and build a customer support infrastructure for key launches. Asia/Latin America AdWords Product Specialist Google April 2005  –  June 2007  (2 years 3 months) Greater New York City Area o\tCreated training program for AdWords sales teams and top Fortune 500 advertising clients for Google’s first expansion into Asia and Latin America. \no\tIncorporated interactive learning and development techniques to track metrics and improve audience retention. \no\tTroubleshooted and escalated product issues from direct clients and sales to lead Engineering teams. Asia/Latin America AdWords Product Specialist Google April 2005  –  June 2007  (2 years 3 months) Greater New York City Area o\tCreated training program for AdWords sales teams and top Fortune 500 advertising clients for Google’s first expansion into Asia and Latin America. \no\tIncorporated interactive learning and development techniques to track metrics and improve audience retention. \no\tTroubleshooted and escalated product issues from direct clients and sales to lead Engineering teams. Global AdWords Product Specialist Google August 2003  –  April 2005  (1 year 9 months) Greater New York City Area o\tTrained 100s of AdWords sales representatives in the U.S. and Europe on key product updates.  \no\tMet with top agencies and advertisers to sell new launches, troubleshoot issues and prioritize future needs. \no\tAwards: 2005 Google Luminary Award (top 5% global performers), several peer recognition awards Global AdWords Product Specialist Google August 2003  –  April 2005  (1 year 9 months) Greater New York City Area o\tTrained 100s of AdWords sales representatives in the U.S. and Europe on key product updates.  \no\tMet with top agencies and advertisers to sell new launches, troubleshoot issues and prioritize future needs. \no\tAwards: 2005 Google Luminary Award (top 5% global performers), several peer recognition awards Project Manager Bigfoot Interactive February 2000  –  July 2003  (3 years 6 months) Greater New York City Area Collaborated with clients, sales, and engineering to create integrated email marketing solutions. Project Manager Bigfoot Interactive February 2000  –  July 2003  (3 years 6 months) Greater New York City Area Collaborated with clients, sales, and engineering to create integrated email marketing solutions. Associate Creative Director The Romann Group October 1999  –  February 2000  (5 months) Greater New York City Area Defined marketing plans for traditional/internet clients in a medium sized advertising agency. Associate Creative Director The Romann Group October 1999  –  February 2000  (5 months) Greater New York City Area Defined marketing plans for traditional/internet clients in a medium sized advertising agency. Legal Assistant/Equity Analyst Soros Fund Management June 1996  –  November 1998  (2 years 6 months) Greater New York City Area Monitored and reported on Quantum Fund performance for international investment advisory firm. Legal Assistant/Equity Analyst Soros Fund Management June 1996  –  November 1998  (2 years 6 months) Greater New York City Area Monitored and reported on Quantum Fund performance for international investment advisory firm. Languages Spanish Cantonese Spanish Cantonese Spanish Cantonese Skills Top Skills 7 Analytics 6 Product Management 5 Project Management 5 SEM 5 Online Advertising 4 Advertising 3 Product Launch 2 Product Marketing 2 Google Adwords 1 Marketing Communications Masa also knows about... 0 Public Speaking 0 Sales Operations 0 Internet Troubleshooting 0 Communication Training 0 Training Delivery 0 Hands-on Training 0 Customer Support 0 International Sales 0 Spanish-speaking 0 Pastry Chef Skills  Top Skills 7 Analytics 6 Product Management 5 Project Management 5 SEM 5 Online Advertising 4 Advertising 3 Product Launch 2 Product Marketing 2 Google Adwords 1 Marketing Communications Masa also knows about... 0 Public Speaking 0 Sales Operations 0 Internet Troubleshooting 0 Communication Training 0 Training Delivery 0 Hands-on Training 0 Customer Support 0 International Sales 0 Spanish-speaking 0 Pastry Chef Top Skills 7 Analytics 6 Product Management 5 Project Management 5 SEM 5 Online Advertising 4 Advertising 3 Product Launch 2 Product Marketing 2 Google Adwords 1 Marketing Communications Masa also knows about... 0 Public Speaking 0 Sales Operations 0 Internet Troubleshooting 0 Communication Training 0 Training Delivery 0 Hands-on Training 0 Customer Support 0 International Sales 0 Spanish-speaking 0 Pastry Chef Top Skills 7 Analytics 6 Product Management 5 Project Management 5 SEM 5 Online Advertising 4 Advertising 3 Product Launch 2 Product Marketing 2 Google Adwords 1 Marketing Communications Masa also knows about... 0 Public Speaking 0 Sales Operations 0 Internet Troubleshooting 0 Communication Training 0 Training Delivery 0 Hands-on Training 0 Customer Support 0 International Sales 0 Spanish-speaking 0 Pastry Chef                     0 Public Speaking 0 Sales Operations 0 Internet Troubleshooting 0 Communication Training 0 Training Delivery 0 Hands-on Training 0 Customer Support 0 International Sales 0 Spanish-speaking 0 Pastry Chef Education French Culinary Institute Grand Diploma in Pastry Arts with Honors 2008  – 2009 American Management Association Performance management ,  executive communication ,  influence/persuasion/sales skills 2007  – 2009 Yale University Bachelor of Arts (BA),  History ,  Spanish 1992  – 1996 NYU In Spain 1995  – 1995 Stuyvesant High School 1989  – 1992 French Culinary Institute Grand Diploma in Pastry Arts with Honors 2008  – 2009 French Culinary Institute Grand Diploma in Pastry Arts with Honors 2008  – 2009 French Culinary Institute Grand Diploma in Pastry Arts with Honors 2008  – 2009 American Management Association Performance management ,  executive communication ,  influence/persuasion/sales skills 2007  – 2009 American Management Association Performance management ,  executive communication ,  influence/persuasion/sales skills 2007  – 2009 American Management Association Performance management ,  executive communication ,  influence/persuasion/sales skills 2007  – 2009 Yale University Bachelor of Arts (BA),  History ,  Spanish 1992  – 1996 Yale University Bachelor of Arts (BA),  History ,  Spanish 1992  – 1996 Yale University Bachelor of Arts (BA),  History ,  Spanish 1992  – 1996 NYU In Spain 1995  – 1995 NYU In Spain 1995  – 1995 NYU In Spain 1995  – 1995 Stuyvesant High School 1989  – 1992 Stuyvesant High School 1989  – 1992 Stuyvesant High School 1989  – 1992 ", "Experience Legal Assistant, Legal Investigations Google December 2014  – Present (8 months) Mountain View, CA Legal Assistant, Legal Removals Google (via Vaco) November 2014  –  December 2014  (2 months) Mountain View, CA Legal Assistant, Legal Removals Google (via Adecco) May 2014  –  November 2014  (7 months) Mountain View, CA Teaching Staff Christ Central of Southern California September 2013  –  April 2014  (8 months) Greater Los Angeles Area Intern Alpha International October 2012  –  December 2012  (3 months) London, United Kingdom As an intern of Alpha International (AI) at their UK Headquarters, I was involved in AI's preparation for the HTB 2013 Global Leadership Conference. I worked closely with the Relationship Management team in their efforts to communicate with the leaders of Marriage Preparation, Married Couples, Parenting Teens and Parenting Children courses across the UK. With the Latin America & Caribbean team, I was actively involved in everything from maintaining social media pages to translating presentations for Alpha Course Administrators to execute successful Alpha Courses in Caribbean churches. \n \nAlpha International (AI) is a charity organization dedicated to caring for ex-offenders and carrying on philanthropic work for Holy Trinity Brompton (HTB), an Anglican Church that has been faithfully ministering to the poor and the sick and bringing people to faith in Jesus for over a century. Undergraduate Program Office Assistant Boston University October 2009  –  August 2012  (2 years 11 months) SMG Undergraduate Program Office Organize documents and schedule appointments for six SMG academic advisors. \n \nAdvise two-thousand undergraduate students on questions regarding the undergraduate curriculum and participate in monthly meetings. \n \nMaintain customer service, telephone and reception area to promote a solid environment for students to receive academic advising. Legal Intern Freehills October 2011  –  November 2011  (2 months) Sydney Area, Australia As a Legal Intern at Freehills, I conduct legal and policy research, attend seminars and internal meetings held by lawyers, and work on projects involving both domestic and international Intellectual Property Law. Subject areas include, among others, patents, trademarks, copyrights and related rights.  \n \nFreehills is a leading corporate international law firm delivering commercial legal services and committed to increasing access to justice by providing expert advice for business globally. Figure Skating Instructor Boston University September 2010  –  May 2011  (9 months) Figure Skating Instructor for Boston University. Taught private and group lessons as a family recreation figure skating instructor. Exposing beginner-advanced skaters to skills and techniques required for competition and skating tests. Community Dispute Settlement Center Intern Community Dispute Settlement Center, Inc. October 2010  –  December 2010  (3 months) CDSC Intern. Assisted with mediation coordination and scheduling legal services. Primarily responsible for creating analysis of financials for potential clients. Maintained and updated files for ongoing cases and referrals to monitor progress for mediators, lawyers, and officials. \n \nThe Community Dispute Settlement Center (CDSC) provides affordable mediation services to help resolve disputes between family members, friends, separating couples, landlords and tenants, local merchants and consumers, employers and employees, coworkers, and more. The center also produces many training programs including mediation for adults, peer mediation training for students, and fruitful workshops for handling conflict. Legal Assistant, Legal Investigations Google December 2014  – Present (8 months) Mountain View, CA Legal Assistant, Legal Investigations Google December 2014  – Present (8 months) Mountain View, CA Legal Assistant, Legal Removals Google (via Vaco) November 2014  –  December 2014  (2 months) Mountain View, CA Legal Assistant, Legal Removals Google (via Vaco) November 2014  –  December 2014  (2 months) Mountain View, CA Legal Assistant, Legal Removals Google (via Adecco) May 2014  –  November 2014  (7 months) Mountain View, CA Legal Assistant, Legal Removals Google (via Adecco) May 2014  –  November 2014  (7 months) Mountain View, CA Teaching Staff Christ Central of Southern California September 2013  –  April 2014  (8 months) Greater Los Angeles Area Teaching Staff Christ Central of Southern California September 2013  –  April 2014  (8 months) Greater Los Angeles Area Intern Alpha International October 2012  –  December 2012  (3 months) London, United Kingdom As an intern of Alpha International (AI) at their UK Headquarters, I was involved in AI's preparation for the HTB 2013 Global Leadership Conference. I worked closely with the Relationship Management team in their efforts to communicate with the leaders of Marriage Preparation, Married Couples, Parenting Teens and Parenting Children courses across the UK. With the Latin America & Caribbean team, I was actively involved in everything from maintaining social media pages to translating presentations for Alpha Course Administrators to execute successful Alpha Courses in Caribbean churches. \n \nAlpha International (AI) is a charity organization dedicated to caring for ex-offenders and carrying on philanthropic work for Holy Trinity Brompton (HTB), an Anglican Church that has been faithfully ministering to the poor and the sick and bringing people to faith in Jesus for over a century. Intern Alpha International October 2012  –  December 2012  (3 months) London, United Kingdom As an intern of Alpha International (AI) at their UK Headquarters, I was involved in AI's preparation for the HTB 2013 Global Leadership Conference. I worked closely with the Relationship Management team in their efforts to communicate with the leaders of Marriage Preparation, Married Couples, Parenting Teens and Parenting Children courses across the UK. With the Latin America & Caribbean team, I was actively involved in everything from maintaining social media pages to translating presentations for Alpha Course Administrators to execute successful Alpha Courses in Caribbean churches. \n \nAlpha International (AI) is a charity organization dedicated to caring for ex-offenders and carrying on philanthropic work for Holy Trinity Brompton (HTB), an Anglican Church that has been faithfully ministering to the poor and the sick and bringing people to faith in Jesus for over a century. Undergraduate Program Office Assistant Boston University October 2009  –  August 2012  (2 years 11 months) SMG Undergraduate Program Office Organize documents and schedule appointments for six SMG academic advisors. \n \nAdvise two-thousand undergraduate students on questions regarding the undergraduate curriculum and participate in monthly meetings. \n \nMaintain customer service, telephone and reception area to promote a solid environment for students to receive academic advising. Undergraduate Program Office Assistant Boston University October 2009  –  August 2012  (2 years 11 months) SMG Undergraduate Program Office Organize documents and schedule appointments for six SMG academic advisors. \n \nAdvise two-thousand undergraduate students on questions regarding the undergraduate curriculum and participate in monthly meetings. \n \nMaintain customer service, telephone and reception area to promote a solid environment for students to receive academic advising. Legal Intern Freehills October 2011  –  November 2011  (2 months) Sydney Area, Australia As a Legal Intern at Freehills, I conduct legal and policy research, attend seminars and internal meetings held by lawyers, and work on projects involving both domestic and international Intellectual Property Law. Subject areas include, among others, patents, trademarks, copyrights and related rights.  \n \nFreehills is a leading corporate international law firm delivering commercial legal services and committed to increasing access to justice by providing expert advice for business globally. Legal Intern Freehills October 2011  –  November 2011  (2 months) Sydney Area, Australia As a Legal Intern at Freehills, I conduct legal and policy research, attend seminars and internal meetings held by lawyers, and work on projects involving both domestic and international Intellectual Property Law. Subject areas include, among others, patents, trademarks, copyrights and related rights.  \n \nFreehills is a leading corporate international law firm delivering commercial legal services and committed to increasing access to justice by providing expert advice for business globally. Figure Skating Instructor Boston University September 2010  –  May 2011  (9 months) Figure Skating Instructor for Boston University. Taught private and group lessons as a family recreation figure skating instructor. Exposing beginner-advanced skaters to skills and techniques required for competition and skating tests. Figure Skating Instructor Boston University September 2010  –  May 2011  (9 months) Figure Skating Instructor for Boston University. Taught private and group lessons as a family recreation figure skating instructor. Exposing beginner-advanced skaters to skills and techniques required for competition and skating tests. Community Dispute Settlement Center Intern Community Dispute Settlement Center, Inc. October 2010  –  December 2010  (3 months) CDSC Intern. Assisted with mediation coordination and scheduling legal services. Primarily responsible for creating analysis of financials for potential clients. Maintained and updated files for ongoing cases and referrals to monitor progress for mediators, lawyers, and officials. \n \nThe Community Dispute Settlement Center (CDSC) provides affordable mediation services to help resolve disputes between family members, friends, separating couples, landlords and tenants, local merchants and consumers, employers and employees, coworkers, and more. The center also produces many training programs including mediation for adults, peer mediation training for students, and fruitful workshops for handling conflict. Community Dispute Settlement Center Intern Community Dispute Settlement Center, Inc. October 2010  –  December 2010  (3 months) CDSC Intern. Assisted with mediation coordination and scheduling legal services. Primarily responsible for creating analysis of financials for potential clients. Maintained and updated files for ongoing cases and referrals to monitor progress for mediators, lawyers, and officials. \n \nThe Community Dispute Settlement Center (CDSC) provides affordable mediation services to help resolve disputes between family members, friends, separating couples, landlords and tenants, local merchants and consumers, employers and employees, coworkers, and more. The center also produces many training programs including mediation for adults, peer mediation training for students, and fruitful workshops for handling conflict. Skills 9 PowerPoint 7 Teaching 6 Training 5 Analysis 2 Legal Research 2 International Law 1 Legal Compliance 1 Legal Skills  9 PowerPoint 7 Teaching 6 Training 5 Analysis 2 Legal Research 2 International Law 1 Legal Compliance 1 Legal 9 PowerPoint 7 Teaching 6 Training 5 Analysis 2 Legal Research 2 International Law 1 Legal Compliance 1 Legal 9 PowerPoint 7 Teaching 6 Training 5 Analysis 2 Legal Research 2 International Law 1 Legal Compliance 1 Legal                 Education Boston University International Relations ,  Pre-Law 2009  – 2013 Activities and Societies:  Boston University Figure Skating (BUFSC); Diversity in Law Association (DLA) ; National Political Science Honor Society; Pi Sigma Alpha (PSA) Boston University London Internship Programme Study Abroad Program in International Relations and Politics 2012  – 2012 Boston University Sydney Internship Program Politics and Pre-Law; The Pacific Rim: Economic and Political Orders; Australian Culture & Society 2011  – 2011 Yonsei University Summer Student, Overseas Studies Program \nRelevant Coursework: Psychology, Korean Culture \n-networked with international professors, coordinators and students \n-cultivated language and business skills through Korean cultural events and travels Activities and Societies:  Summer Student ,  Yonsei International Study Abroad Program\nRelevant Coursework: Psychology ,  Korean Culture\nOpportunity to network with international students and cultivated language and business skills through Korean cultural travels and unique experiences Boston University International Relations ,  Pre-Law 2009  – 2013 Activities and Societies:  Boston University Figure Skating (BUFSC); Diversity in Law Association (DLA) ; National Political Science Honor Society; Pi Sigma Alpha (PSA) Boston University International Relations ,  Pre-Law 2009  – 2013 Activities and Societies:  Boston University Figure Skating (BUFSC); Diversity in Law Association (DLA) ; National Political Science Honor Society; Pi Sigma Alpha (PSA) Boston University International Relations ,  Pre-Law 2009  – 2013 Activities and Societies:  Boston University Figure Skating (BUFSC); Diversity in Law Association (DLA) ; National Political Science Honor Society; Pi Sigma Alpha (PSA) Boston University London Internship Programme Study Abroad Program in International Relations and Politics 2012  – 2012 Boston University London Internship Programme Study Abroad Program in International Relations and Politics 2012  – 2012 Boston University London Internship Programme Study Abroad Program in International Relations and Politics 2012  – 2012 Boston University Sydney Internship Program Politics and Pre-Law; The Pacific Rim: Economic and Political Orders; Australian Culture & Society 2011  – 2011 Boston University Sydney Internship Program Politics and Pre-Law; The Pacific Rim: Economic and Political Orders; Australian Culture & Society 2011  – 2011 Boston University Sydney Internship Program Politics and Pre-Law; The Pacific Rim: Economic and Political Orders; Australian Culture & Society 2011  – 2011 Yonsei University Summer Student, Overseas Studies Program \nRelevant Coursework: Psychology, Korean Culture \n-networked with international professors, coordinators and students \n-cultivated language and business skills through Korean cultural events and travels Activities and Societies:  Summer Student ,  Yonsei International Study Abroad Program\nRelevant Coursework: Psychology ,  Korean Culture\nOpportunity to network with international students and cultivated language and business skills through Korean cultural travels and unique experiences Yonsei University Summer Student, Overseas Studies Program \nRelevant Coursework: Psychology, Korean Culture \n-networked with international professors, coordinators and students \n-cultivated language and business skills through Korean cultural events and travels Activities and Societies:  Summer Student ,  Yonsei International Study Abroad Program\nRelevant Coursework: Psychology ,  Korean Culture\nOpportunity to network with international students and cultivated language and business skills through Korean cultural travels and unique experiences Yonsei University Summer Student, Overseas Studies Program \nRelevant Coursework: Psychology, Korean Culture \n-networked with international professors, coordinators and students \n-cultivated language and business skills through Korean cultural events and travels Activities and Societies:  Summer Student ,  Yonsei International Study Abroad Program\nRelevant Coursework: Psychology ,  Korean Culture\nOpportunity to network with international students and cultivated language and business skills through Korean cultural travels and unique experiences ", "Experience Account Executive Google December 2014  – Present (8 months) San Francisco Bay Area (Open) 2 recommendations Christina Ganjei Senior Account Manager at Foghorn Labs Doug is in a league of his own. He overdelivers and surpasses expectations on an daily basis and is the constant recipient... View Manoj Agarwal Vice President @ iYogi LLC Once in a while you come across a person who has grip on all the facets of management, knows every cross functional team... View Americas Role Council Member: Account Managers Google January 2014  –  December 2014  (1 year) San Francisco Bay Area Billing Guru Lead Google January 2013  –  December 2014  (2 years) San Francisco Bay Area Sales Representative II Google January 2012  –  November 2014  (2 years 11 months) San Francisco Bay Area Senior Account Manager Google June 2012  –  June 2014  (2 years 1 month) Senior Account Manager Google Ireland Limited October 2012  –  October 2012  (1 month) Dublin, Ireland. Account Manager Google March 2011  –  May 2012  (1 year 3 months) Associate Account Manager Google August 2009  –  March 2011  (1 year 8 months) (Open) 1 recommendation Sadie Flick Project Manager, Data Geek, Jazz Musician Doug is a talented and highly motivated person professionally and personally. He inspires those around him to help in achieving his goals, while encouraging and aiding others to meet both personal and collective goals. His positive attitude and... View Account Coordinator Google August 2007  –  July 2009  (2 years) Dance Captain Insignificant Others LLC March 2008  –  December 2008  (10 months) Legal Assistant Google August 2005  –  July 2007  (2 years) Mentor: High School Freshmen BUILD September 2006  –  June 2007  (10 months) Account Executive Google December 2014  – Present (8 months) San Francisco Bay Area (Open) 2 recommendations Christina Ganjei Senior Account Manager at Foghorn Labs Doug is in a league of his own. He overdelivers and surpasses expectations on an daily basis and is the constant recipient... View Manoj Agarwal Vice President @ iYogi LLC Once in a while you come across a person who has grip on all the facets of management, knows every cross functional team... View Account Executive Google December 2014  – Present (8 months) San Francisco Bay Area (Open) 2 recommendations Christina Ganjei Senior Account Manager at Foghorn Labs Doug is in a league of his own. He overdelivers and surpasses expectations on an daily basis and is the constant recipient... View Manoj Agarwal Vice President @ iYogi LLC Once in a while you come across a person who has grip on all the facets of management, knows every cross functional team... View Americas Role Council Member: Account Managers Google January 2014  –  December 2014  (1 year) San Francisco Bay Area Americas Role Council Member: Account Managers Google January 2014  –  December 2014  (1 year) San Francisco Bay Area Billing Guru Lead Google January 2013  –  December 2014  (2 years) San Francisco Bay Area Billing Guru Lead Google January 2013  –  December 2014  (2 years) San Francisco Bay Area Sales Representative II Google January 2012  –  November 2014  (2 years 11 months) San Francisco Bay Area Sales Representative II Google January 2012  –  November 2014  (2 years 11 months) San Francisco Bay Area Senior Account Manager Google June 2012  –  June 2014  (2 years 1 month) Senior Account Manager Google June 2012  –  June 2014  (2 years 1 month) Senior Account Manager Google Ireland Limited October 2012  –  October 2012  (1 month) Dublin, Ireland. Senior Account Manager Google Ireland Limited October 2012  –  October 2012  (1 month) Dublin, Ireland. Account Manager Google March 2011  –  May 2012  (1 year 3 months) Account Manager Google March 2011  –  May 2012  (1 year 3 months) Associate Account Manager Google August 2009  –  March 2011  (1 year 8 months) (Open) 1 recommendation Sadie Flick Project Manager, Data Geek, Jazz Musician Doug is a talented and highly motivated person professionally and personally. He inspires those around him to help in achieving his goals, while encouraging and aiding others to meet both personal and collective goals. His positive attitude and... View Associate Account Manager Google August 2009  –  March 2011  (1 year 8 months) (Open) 1 recommendation Sadie Flick Project Manager, Data Geek, Jazz Musician Doug is a talented and highly motivated person professionally and personally. He inspires those around him to help in achieving his goals, while encouraging and aiding others to meet both personal and collective goals. His positive attitude and... View Account Coordinator Google August 2007  –  July 2009  (2 years) Account Coordinator Google August 2007  –  July 2009  (2 years) Dance Captain Insignificant Others LLC March 2008  –  December 2008  (10 months) Dance Captain Insignificant Others LLC March 2008  –  December 2008  (10 months) Legal Assistant Google August 2005  –  July 2007  (2 years) Legal Assistant Google August 2005  –  July 2007  (2 years) Mentor: High School Freshmen BUILD September 2006  –  June 2007  (10 months) Mentor: High School Freshmen BUILD September 2006  –  June 2007  (10 months) Skills Top Skills 52 Google Adwords 26 SEM 23 PPC 22 Online Advertising 15 Digital Marketing 14 Web Analytics 11 Mobile Advertising 10 Digital Strategy 10 Search Advertising 7 Online Marketing Douglas also knows about... 7 Mobile Marketing 6 Lead Generation 5 Marketing 5 Google Analytics 4 Display Advertising 2 Facebook Skills  Top Skills 52 Google Adwords 26 SEM 23 PPC 22 Online Advertising 15 Digital Marketing 14 Web Analytics 11 Mobile Advertising 10 Digital Strategy 10 Search Advertising 7 Online Marketing Douglas also knows about... 7 Mobile Marketing 6 Lead Generation 5 Marketing 5 Google Analytics 4 Display Advertising 2 Facebook Top Skills 52 Google Adwords 26 SEM 23 PPC 22 Online Advertising 15 Digital Marketing 14 Web Analytics 11 Mobile Advertising 10 Digital Strategy 10 Search Advertising 7 Online Marketing Douglas also knows about... 7 Mobile Marketing 6 Lead Generation 5 Marketing 5 Google Analytics 4 Display Advertising 2 Facebook Top Skills 52 Google Adwords 26 SEM 23 PPC 22 Online Advertising 15 Digital Marketing 14 Web Analytics 11 Mobile Advertising 10 Digital Strategy 10 Search Advertising 7 Online Marketing Douglas also knows about... 7 Mobile Marketing 6 Lead Generation 5 Marketing 5 Google Analytics 4 Display Advertising 2 Facebook                     7 Mobile Marketing 6 Lead Generation 5 Marketing 5 Google Analytics 4 Display Advertising 2 Facebook Education University of Pennsylvania - The Wharton School Wharton Google Marketing Academy 2014  – 2014 Santa Clara University BSC,  Finance ,  Dance 2001  – 2005 Lincoln High School University of Pennsylvania - The Wharton School Wharton Google Marketing Academy 2014  – 2014 University of Pennsylvania - The Wharton School Wharton Google Marketing Academy 2014  – 2014 University of Pennsylvania - The Wharton School Wharton Google Marketing Academy 2014  – 2014 Santa Clara University BSC,  Finance ,  Dance 2001  – 2005 Santa Clara University BSC,  Finance ,  Dance 2001  – 2005 Santa Clara University BSC,  Finance ,  Dance 2001  – 2005 Lincoln High School Lincoln High School Lincoln High School ", "Summary A global business leader passionate about the intersection between digital technology and foreign policy. \n \nStrong digital product knowledge, with 8+ years of cross-functional experience in Product, Sales, Partnerships, and Public Policy at Google. Highly experienced in leading large-scale digital marketing initiatives across multiple markets. \n \nProven track record of building trusted advisory relationships with senior-level stakeholders in the private and public sector, from Fortune 500 companies to Big 6 advertising agencies and national governments. \n \nStrategic thinker with excellent project management, communication and analytical skills. Focused on delivering results quickly. Summary A global business leader passionate about the intersection between digital technology and foreign policy. \n \nStrong digital product knowledge, with 8+ years of cross-functional experience in Product, Sales, Partnerships, and Public Policy at Google. Highly experienced in leading large-scale digital marketing initiatives across multiple markets. \n \nProven track record of building trusted advisory relationships with senior-level stakeholders in the private and public sector, from Fortune 500 companies to Big 6 advertising agencies and national governments. \n \nStrategic thinker with excellent project management, communication and analytical skills. Focused on delivering results quickly. A global business leader passionate about the intersection between digital technology and foreign policy. \n \nStrong digital product knowledge, with 8+ years of cross-functional experience in Product, Sales, Partnerships, and Public Policy at Google. Highly experienced in leading large-scale digital marketing initiatives across multiple markets. \n \nProven track record of building trusted advisory relationships with senior-level stakeholders in the private and public sector, from Fortune 500 companies to Big 6 advertising agencies and national governments. \n \nStrategic thinker with excellent project management, communication and analytical skills. Focused on delivering results quickly. A global business leader passionate about the intersection between digital technology and foreign policy. \n \nStrong digital product knowledge, with 8+ years of cross-functional experience in Product, Sales, Partnerships, and Public Policy at Google. Highly experienced in leading large-scale digital marketing initiatives across multiple markets. \n \nProven track record of building trusted advisory relationships with senior-level stakeholders in the private and public sector, from Fortune 500 companies to Big 6 advertising agencies and national governments. \n \nStrategic thinker with excellent project management, communication and analytical skills. Focused on delivering results quickly. Experience Policy Strategist, Public Policy & Government Relations, Southeast Asia (Rotation) Google April 2015  – Present (4 months) Singapore Driving Google's policy efforts in Southeast Asia to counter extremism online. Focused on strengthening the capacity of local creators to create and distribute positive content on YouTube. Regional Agency Business Manager, Asia-Pacific Google August 2011  – Present (4 years) Singapore Responsible for developing strong partnerships with global advertising agencies across the Asia-Pacific region and formulating strategies to accelerate growth of Google's agency business in emerging markets. Analytical Lead - Global Business Organization (GBO), Financial Services Vertical Google December 2008  –  August 2011  (2 years 9 months) New York, New York Developed and presented data-driven digital strategies and performance recommendations for major financial services advertisers, including HSBC, Vanguard, T. Rowe Price, Capital One, and E*Trade, to optimize their media investment and drive business growth. Account Manager / Sales Operations Associate, Google Print Ads Google May 2007  –  December 2008  (1 year 8 months) New York, New York Sales and sales operations for a startup team inside Google which sought to transform the way newspaper ads were bought and sold by creating an online platform for offline ads. Over 800 US newspapers were part of the Print Ads publisher network. Corporate Legal Assistant, Project Finance Practice Group Dewey & LeBoeuf LLP June 2005  –  May 2007  (2 years) New York, New York Supported 14 associates and 10 partners as sole legal assistant in the Project Finance practice group. The practice represented public and private companies, investment banks, investors, and governments in the development, financing, construction, and operation of capital-intensive infrastructure projects around the world.  Policy Strategist, Public Policy & Government Relations, Southeast Asia (Rotation) Google April 2015  – Present (4 months) Singapore Driving Google's policy efforts in Southeast Asia to counter extremism online. Focused on strengthening the capacity of local creators to create and distribute positive content on YouTube. Policy Strategist, Public Policy & Government Relations, Southeast Asia (Rotation) Google April 2015  – Present (4 months) Singapore Driving Google's policy efforts in Southeast Asia to counter extremism online. Focused on strengthening the capacity of local creators to create and distribute positive content on YouTube. Regional Agency Business Manager, Asia-Pacific Google August 2011  – Present (4 years) Singapore Responsible for developing strong partnerships with global advertising agencies across the Asia-Pacific region and formulating strategies to accelerate growth of Google's agency business in emerging markets. Regional Agency Business Manager, Asia-Pacific Google August 2011  – Present (4 years) Singapore Responsible for developing strong partnerships with global advertising agencies across the Asia-Pacific region and formulating strategies to accelerate growth of Google's agency business in emerging markets. Analytical Lead - Global Business Organization (GBO), Financial Services Vertical Google December 2008  –  August 2011  (2 years 9 months) New York, New York Developed and presented data-driven digital strategies and performance recommendations for major financial services advertisers, including HSBC, Vanguard, T. Rowe Price, Capital One, and E*Trade, to optimize their media investment and drive business growth. Analytical Lead - Global Business Organization (GBO), Financial Services Vertical Google December 2008  –  August 2011  (2 years 9 months) New York, New York Developed and presented data-driven digital strategies and performance recommendations for major financial services advertisers, including HSBC, Vanguard, T. Rowe Price, Capital One, and E*Trade, to optimize their media investment and drive business growth. Account Manager / Sales Operations Associate, Google Print Ads Google May 2007  –  December 2008  (1 year 8 months) New York, New York Sales and sales operations for a startup team inside Google which sought to transform the way newspaper ads were bought and sold by creating an online platform for offline ads. Over 800 US newspapers were part of the Print Ads publisher network. Account Manager / Sales Operations Associate, Google Print Ads Google May 2007  –  December 2008  (1 year 8 months) New York, New York Sales and sales operations for a startup team inside Google which sought to transform the way newspaper ads were bought and sold by creating an online platform for offline ads. Over 800 US newspapers were part of the Print Ads publisher network. Corporate Legal Assistant, Project Finance Practice Group Dewey & LeBoeuf LLP June 2005  –  May 2007  (2 years) New York, New York Supported 14 associates and 10 partners as sole legal assistant in the Project Finance practice group. The practice represented public and private companies, investment banks, investors, and governments in the development, financing, construction, and operation of capital-intensive infrastructure projects around the world.  Corporate Legal Assistant, Project Finance Practice Group Dewey & LeBoeuf LLP June 2005  –  May 2007  (2 years) New York, New York Supported 14 associates and 10 partners as sole legal assistant in the Project Finance practice group. The practice represented public and private companies, investment banks, investors, and governments in the development, financing, construction, and operation of capital-intensive infrastructure projects around the world.  Languages   Skills Top Skills 29 Digital Marketing 19 Digital Strategy 20 Online Advertising 14 Digital Media 12 Advertising 8 Strategic Partnerships 5 Emerging Markets 5 SEM 4 Marketing Strategy 4 Online Marketing Adam also knows about... 4 Strategy 3 Search Advertising 3 Business Development 2 Leadership 1 Public Policy 3 Integrated Marketing 3 Marketing 3 Social Networking 2 Content Strategy 3 Entrepreneurship 2 Competitive Analysis 2 New Media 2 Interactive Marketing 3 Market Research 2 Start-ups 1 Marketing Communications 1 Lead Generation 1 Media Planning 0 Mobile Communications 0 Mobile Advertising 0 Global Sales See 6+     See less Skills  Top Skills 29 Digital Marketing 19 Digital Strategy 20 Online Advertising 14 Digital Media 12 Advertising 8 Strategic Partnerships 5 Emerging Markets 5 SEM 4 Marketing Strategy 4 Online Marketing Adam also knows about... 4 Strategy 3 Search Advertising 3 Business Development 2 Leadership 1 Public Policy 3 Integrated Marketing 3 Marketing 3 Social Networking 2 Content Strategy 3 Entrepreneurship 2 Competitive Analysis 2 New Media 2 Interactive Marketing 3 Market Research 2 Start-ups 1 Marketing Communications 1 Lead Generation 1 Media Planning 0 Mobile Communications 0 Mobile Advertising 0 Global Sales See 6+     See less Top Skills 29 Digital Marketing 19 Digital Strategy 20 Online Advertising 14 Digital Media 12 Advertising 8 Strategic Partnerships 5 Emerging Markets 5 SEM 4 Marketing Strategy 4 Online Marketing Adam also knows about... 4 Strategy 3 Search Advertising 3 Business Development 2 Leadership 1 Public Policy 3 Integrated Marketing 3 Marketing 3 Social Networking 2 Content Strategy 3 Entrepreneurship 2 Competitive Analysis 2 New Media 2 Interactive Marketing 3 Market Research 2 Start-ups 1 Marketing Communications 1 Lead Generation 1 Media Planning 0 Mobile Communications 0 Mobile Advertising 0 Global Sales See 6+     See less Top Skills 29 Digital Marketing 19 Digital Strategy 20 Online Advertising 14 Digital Media 12 Advertising 8 Strategic Partnerships 5 Emerging Markets 5 SEM 4 Marketing Strategy 4 Online Marketing Adam also knows about... 4 Strategy 3 Search Advertising 3 Business Development 2 Leadership 1 Public Policy 3 Integrated Marketing 3 Marketing 3 Social Networking 2 Content Strategy 3 Entrepreneurship 2 Competitive Analysis 2 New Media 2 Interactive Marketing 3 Market Research 2 Start-ups 1 Marketing Communications 1 Lead Generation 1 Media Planning 0 Mobile Communications 0 Mobile Advertising 0 Global Sales See 6+     See less                     4 Strategy 3 Search Advertising 3 Business Development 2 Leadership 1 Public Policy 3 Integrated Marketing 3 Marketing 3 Social Networking 2 Content Strategy 3 Entrepreneurship 2 Competitive Analysis 2 New Media 2 Interactive Marketing 3 Market Research 2 Start-ups 1 Marketing Communications 1 Lead Generation 1 Media Planning 0 Mobile Communications 0 Mobile Advertising 0 Global Sales Education Harvard University, John F. Kennedy School of Government Senior Executives in National and International Security Program 2015  – 2015 Certificate expected August 2015 Yale University BA,  with distinction in Political Science and International Studies (double major) 2001  – 2005 Activities and Societies:  Yale Daily News (City Editor) ,  Yale-China Association ,  Yale International Relations Association (YIRA) ,  Yale School of Music The Chinese University of Hong Kong 2004  – 2004 Yale University-New Asia College Undergraduate Exchange Program (YUNA) Harvard University, John F. Kennedy School of Government Senior Executives in National and International Security Program 2015  – 2015 Certificate expected August 2015 Harvard University, John F. Kennedy School of Government Senior Executives in National and International Security Program 2015  – 2015 Certificate expected August 2015 Harvard University, John F. Kennedy School of Government Senior Executives in National and International Security Program 2015  – 2015 Certificate expected August 2015 Yale University BA,  with distinction in Political Science and International Studies (double major) 2001  – 2005 Activities and Societies:  Yale Daily News (City Editor) ,  Yale-China Association ,  Yale International Relations Association (YIRA) ,  Yale School of Music Yale University BA,  with distinction in Political Science and International Studies (double major) 2001  – 2005 Activities and Societies:  Yale Daily News (City Editor) ,  Yale-China Association ,  Yale International Relations Association (YIRA) ,  Yale School of Music Yale University BA,  with distinction in Political Science and International Studies (double major) 2001  – 2005 Activities and Societies:  Yale Daily News (City Editor) ,  Yale-China Association ,  Yale International Relations Association (YIRA) ,  Yale School of Music The Chinese University of Hong Kong 2004  – 2004 Yale University-New Asia College Undergraduate Exchange Program (YUNA) The Chinese University of Hong Kong 2004  – 2004 Yale University-New Asia College Undergraduate Exchange Program (YUNA) The Chinese University of Hong Kong 2004  – 2004 Yale University-New Asia College Undergraduate Exchange Program (YUNA) Honors & Awards ", "Experience Legal Assistant Google November 2014  – Present (9 months) Legal Assistant Google January 2012  –  October 2014  (2 years 10 months) Enterprise Sales Associate Google February 2011  –  January 2012  (1 year) (Open) 1 recommendation Pablo Kohls Cloud Professional at Authentic8 - Enabling people and companies to securely access their cloud apps and data. Chris is a team player, working with him I got to see that constantly whether in for form of taking ownership of projects and seeing them through or bringing a positive outlook when things were a little rough. Always committed to the customer's... View Temporary Intake Advisor UC San Diego January 2011  –  February 2011  (2 months) Paralegal Intern The La Cues Law Group October 2010  –  December 2010  (3 months) Freshmen Orientation Advisor UC San Diego August 2009  –  September 2010  (1 year 2 months) Undergraduate Teaching Assistant Economics Department, University of California, San Diego January 2010  –  June 2010  (6 months) Research Team Memeber Economics Department, University of California, San Diego January 2010  –  April 2010  (4 months) Legal Assistant Google November 2014  – Present (9 months) Legal Assistant Google November 2014  – Present (9 months) Legal Assistant Google January 2012  –  October 2014  (2 years 10 months) Legal Assistant Google January 2012  –  October 2014  (2 years 10 months) Enterprise Sales Associate Google February 2011  –  January 2012  (1 year) (Open) 1 recommendation Pablo Kohls Cloud Professional at Authentic8 - Enabling people and companies to securely access their cloud apps and data. Chris is a team player, working with him I got to see that constantly whether in for form of taking ownership of projects and seeing them through or bringing a positive outlook when things were a little rough. Always committed to the customer's... View Enterprise Sales Associate Google February 2011  –  January 2012  (1 year) (Open) 1 recommendation Pablo Kohls Cloud Professional at Authentic8 - Enabling people and companies to securely access their cloud apps and data. Chris is a team player, working with him I got to see that constantly whether in for form of taking ownership of projects and seeing them through or bringing a positive outlook when things were a little rough. Always committed to the customer's... View Temporary Intake Advisor UC San Diego January 2011  –  February 2011  (2 months) Temporary Intake Advisor UC San Diego January 2011  –  February 2011  (2 months) Paralegal Intern The La Cues Law Group October 2010  –  December 2010  (3 months) Paralegal Intern The La Cues Law Group October 2010  –  December 2010  (3 months) Freshmen Orientation Advisor UC San Diego August 2009  –  September 2010  (1 year 2 months) Freshmen Orientation Advisor UC San Diego August 2009  –  September 2010  (1 year 2 months) Undergraduate Teaching Assistant Economics Department, University of California, San Diego January 2010  –  June 2010  (6 months) Undergraduate Teaching Assistant Economics Department, University of California, San Diego January 2010  –  June 2010  (6 months) Research Team Memeber Economics Department, University of California, San Diego January 2010  –  April 2010  (4 months) Research Team Memeber Economics Department, University of California, San Diego January 2010  –  April 2010  (4 months) Skills 2 Legal Research 1 Data Analysis 0 Salesforce.com 0 LexisNexis 0 Administrative Support 0 Group Presentations 0 Problem Analysis 0 Photoshop 0 Photography Skills  2 Legal Research 1 Data Analysis 0 Salesforce.com 0 LexisNexis 0 Administrative Support 0 Group Presentations 0 Problem Analysis 0 Photoshop 0 Photography 2 Legal Research 1 Data Analysis 0 Salesforce.com 0 LexisNexis 0 Administrative Support 0 Group Presentations 0 Problem Analysis 0 Photoshop 0 Photography 2 Legal Research 1 Data Analysis 0 Salesforce.com 0 LexisNexis 0 Administrative Support 0 Group Presentations 0 Problem Analysis 0 Photoshop 0 Photography                   Honors & Awards Additional Honors & Awards John Muir College Leadership Award, 2010 \nEagle Scout, 2005 Additional Honors & Awards John Muir College Leadership Award, 2010 \nEagle Scout, 2005 Additional Honors & Awards John Muir College Leadership Award, 2010 \nEagle Scout, 2005 Additional Honors & Awards John Muir College Leadership Award, 2010 \nEagle Scout, 2005 ", "Summary Laura Hernandez joined Google in 2010 after graduating from the University of North Carolina at Chapel Hill with a B.A, majoring in both International Studies and Spanish, and minoring in Social and Economic Justice.  \n \nAs a Legal Assistant for Google, Laura has skilled experience in data analysis, customer service, project management, and analytical thinking.  \n \nLaura is looking for opportunities to build and expand her data analysis skill set.  \n \nPrior to joining Google, Laura interned with the State Department at the U.S. Embassy in Madrid and founded a chapter of the non-profit Invisible Children at UNC.  \n \nLaura is pursuing a black belt in the Korean martial art \"Kuk Sool Won\" in her personal time. Summary Laura Hernandez joined Google in 2010 after graduating from the University of North Carolina at Chapel Hill with a B.A, majoring in both International Studies and Spanish, and minoring in Social and Economic Justice.  \n \nAs a Legal Assistant for Google, Laura has skilled experience in data analysis, customer service, project management, and analytical thinking.  \n \nLaura is looking for opportunities to build and expand her data analysis skill set.  \n \nPrior to joining Google, Laura interned with the State Department at the U.S. Embassy in Madrid and founded a chapter of the non-profit Invisible Children at UNC.  \n \nLaura is pursuing a black belt in the Korean martial art \"Kuk Sool Won\" in her personal time. Laura Hernandez joined Google in 2010 after graduating from the University of North Carolina at Chapel Hill with a B.A, majoring in both International Studies and Spanish, and minoring in Social and Economic Justice.  \n \nAs a Legal Assistant for Google, Laura has skilled experience in data analysis, customer service, project management, and analytical thinking.  \n \nLaura is looking for opportunities to build and expand her data analysis skill set.  \n \nPrior to joining Google, Laura interned with the State Department at the U.S. Embassy in Madrid and founded a chapter of the non-profit Invisible Children at UNC.  \n \nLaura is pursuing a black belt in the Korean martial art \"Kuk Sool Won\" in her personal time. Laura Hernandez joined Google in 2010 after graduating from the University of North Carolina at Chapel Hill with a B.A, majoring in both International Studies and Spanish, and minoring in Social and Economic Justice.  \n \nAs a Legal Assistant for Google, Laura has skilled experience in data analysis, customer service, project management, and analytical thinking.  \n \nLaura is looking for opportunities to build and expand her data analysis skill set.  \n \nPrior to joining Google, Laura interned with the State Department at the U.S. Embassy in Madrid and founded a chapter of the non-profit Invisible Children at UNC.  \n \nLaura is pursuing a black belt in the Korean martial art \"Kuk Sool Won\" in her personal time. Experience Legal Assistant II Google July 2012  – Present (3 years 1 month) Mountain View, CA - Write SQL queries and create dashboards to track various team metrics such as incoming volume, cases closed, productivity and more.  \n- Propose tracking a new data point for team case work, analyze initial data set, report findings to Director and receive approval to launch proposed data point. \n- Gather post-launch 6 month data set, create pivot tables, make charts with data insights, propose changes to established categories based on insights and receive sign off to implement suggested changes \n- Analyze team data metrics on Spain in Excel, create pivot tables, and make final report for Director to prepare for his outreach trip to Spain.  \n- Resolve policy discrepancies with internal and external stakeholders regarding legal process from Italy, Spain and Portugal \n- Configure, migrate, file bugs and resolve workflow problems for new team support tool \n- Analyze, process, and reply to over 300 subpoenas per month with strong attention to detail and strict confidentiality.  \n- Serve in 24-hour on-call rotation evaluating sensitive data disclosures.  Legal Assistant I Google Inc. June 2010  –  July 2012  (2 years 2 months) Mountain View, CA - Process and reply to 300+ monthly international legal demands with strong attention to detail \n- Lead workflow, update documentation, and serve as law enforcement support contact for requests from Spain and Latin America \n- Review time sensitive and high-pressure emergency disclosure requests \n- Create, edit, and combine team’s support responses to increase clarity and efficiency President and Founder Invisible Children at Chapel Hill August 2007  –  May 2010  (2 years 10 months) Chapel Hill, NC Founded a chapter of Invisible Children at UNC and served as President. Raised money for Lacor Secondary School in Uganda. Raised campus awareness of conflict in northern Uganda. Consular Intern U.S. Department of State September 2009  –  December 2009  (4 months) Madrid Area, Spain - Analyze data and report on thefts of Americans in Madrid \n- Manage emergency passport unit \n- Process applications for visas \n- Visit American prisoners in Spanish jails \n- Accompany U.S. Marshals to extradition mission of American prisoner \n- Hold a secret clearance Front Desk Attendant Peninsula Community Center July 2009  –  September 2009  (3 months) Redwood City, CA - Greet and check in guests \n- Process payments, stock lobby supplies, answer incoming phone calls Office Assistant Norwest Venture Partners June 2008  –  August 2008  (3 months) Palo Alto, CA - Answer phone lines, greet visiting clients, manage 7th floor reception \n- Research and create spreadsheet on 30 restaurants for partner business entertainment Legal Assistant II Google July 2012  – Present (3 years 1 month) Mountain View, CA - Write SQL queries and create dashboards to track various team metrics such as incoming volume, cases closed, productivity and more.  \n- Propose tracking a new data point for team case work, analyze initial data set, report findings to Director and receive approval to launch proposed data point. \n- Gather post-launch 6 month data set, create pivot tables, make charts with data insights, propose changes to established categories based on insights and receive sign off to implement suggested changes \n- Analyze team data metrics on Spain in Excel, create pivot tables, and make final report for Director to prepare for his outreach trip to Spain.  \n- Resolve policy discrepancies with internal and external stakeholders regarding legal process from Italy, Spain and Portugal \n- Configure, migrate, file bugs and resolve workflow problems for new team support tool \n- Analyze, process, and reply to over 300 subpoenas per month with strong attention to detail and strict confidentiality.  \n- Serve in 24-hour on-call rotation evaluating sensitive data disclosures.  Legal Assistant II Google July 2012  – Present (3 years 1 month) Mountain View, CA - Write SQL queries and create dashboards to track various team metrics such as incoming volume, cases closed, productivity and more.  \n- Propose tracking a new data point for team case work, analyze initial data set, report findings to Director and receive approval to launch proposed data point. \n- Gather post-launch 6 month data set, create pivot tables, make charts with data insights, propose changes to established categories based on insights and receive sign off to implement suggested changes \n- Analyze team data metrics on Spain in Excel, create pivot tables, and make final report for Director to prepare for his outreach trip to Spain.  \n- Resolve policy discrepancies with internal and external stakeholders regarding legal process from Italy, Spain and Portugal \n- Configure, migrate, file bugs and resolve workflow problems for new team support tool \n- Analyze, process, and reply to over 300 subpoenas per month with strong attention to detail and strict confidentiality.  \n- Serve in 24-hour on-call rotation evaluating sensitive data disclosures.  Legal Assistant I Google Inc. June 2010  –  July 2012  (2 years 2 months) Mountain View, CA - Process and reply to 300+ monthly international legal demands with strong attention to detail \n- Lead workflow, update documentation, and serve as law enforcement support contact for requests from Spain and Latin America \n- Review time sensitive and high-pressure emergency disclosure requests \n- Create, edit, and combine team’s support responses to increase clarity and efficiency Legal Assistant I Google Inc. June 2010  –  July 2012  (2 years 2 months) Mountain View, CA - Process and reply to 300+ monthly international legal demands with strong attention to detail \n- Lead workflow, update documentation, and serve as law enforcement support contact for requests from Spain and Latin America \n- Review time sensitive and high-pressure emergency disclosure requests \n- Create, edit, and combine team’s support responses to increase clarity and efficiency President and Founder Invisible Children at Chapel Hill August 2007  –  May 2010  (2 years 10 months) Chapel Hill, NC Founded a chapter of Invisible Children at UNC and served as President. Raised money for Lacor Secondary School in Uganda. Raised campus awareness of conflict in northern Uganda. President and Founder Invisible Children at Chapel Hill August 2007  –  May 2010  (2 years 10 months) Chapel Hill, NC Founded a chapter of Invisible Children at UNC and served as President. Raised money for Lacor Secondary School in Uganda. Raised campus awareness of conflict in northern Uganda. Consular Intern U.S. Department of State September 2009  –  December 2009  (4 months) Madrid Area, Spain - Analyze data and report on thefts of Americans in Madrid \n- Manage emergency passport unit \n- Process applications for visas \n- Visit American prisoners in Spanish jails \n- Accompany U.S. Marshals to extradition mission of American prisoner \n- Hold a secret clearance Consular Intern U.S. Department of State September 2009  –  December 2009  (4 months) Madrid Area, Spain - Analyze data and report on thefts of Americans in Madrid \n- Manage emergency passport unit \n- Process applications for visas \n- Visit American prisoners in Spanish jails \n- Accompany U.S. Marshals to extradition mission of American prisoner \n- Hold a secret clearance Front Desk Attendant Peninsula Community Center July 2009  –  September 2009  (3 months) Redwood City, CA - Greet and check in guests \n- Process payments, stock lobby supplies, answer incoming phone calls Front Desk Attendant Peninsula Community Center July 2009  –  September 2009  (3 months) Redwood City, CA - Greet and check in guests \n- Process payments, stock lobby supplies, answer incoming phone calls Office Assistant Norwest Venture Partners June 2008  –  August 2008  (3 months) Palo Alto, CA - Answer phone lines, greet visiting clients, manage 7th floor reception \n- Research and create spreadsheet on 30 restaurants for partner business entertainment Office Assistant Norwest Venture Partners June 2008  –  August 2008  (3 months) Palo Alto, CA - Answer phone lines, greet visiting clients, manage 7th floor reception \n- Research and create spreadsheet on 30 restaurants for partner business entertainment Languages Spanish Full professional proficiency Portuguese Elementary proficiency Spanish Full professional proficiency Portuguese Elementary proficiency Spanish Full professional proficiency Portuguese Elementary proficiency Full professional proficiency Elementary proficiency Skills Top Skills 8 Spanish 8 Legal Assistance 3 Legal Compliance 3 Google Docs 3 Analysis 2 Microsoft Excel 2 Data Analysis 2 PowerPoint 2 Customer Service 2 Legal Research Laura also knows about... 2 Management 1 Program Management 0 Business Analysis 0 Presentations 0 Gmail 0 HTML 0 CSS 0 excel 0 Pivot Tables 0 SQL Skills  Top Skills 8 Spanish 8 Legal Assistance 3 Legal Compliance 3 Google Docs 3 Analysis 2 Microsoft Excel 2 Data Analysis 2 PowerPoint 2 Customer Service 2 Legal Research Laura also knows about... 2 Management 1 Program Management 0 Business Analysis 0 Presentations 0 Gmail 0 HTML 0 CSS 0 excel 0 Pivot Tables 0 SQL Top Skills 8 Spanish 8 Legal Assistance 3 Legal Compliance 3 Google Docs 3 Analysis 2 Microsoft Excel 2 Data Analysis 2 PowerPoint 2 Customer Service 2 Legal Research Laura also knows about... 2 Management 1 Program Management 0 Business Analysis 0 Presentations 0 Gmail 0 HTML 0 CSS 0 excel 0 Pivot Tables 0 SQL Top Skills 8 Spanish 8 Legal Assistance 3 Legal Compliance 3 Google Docs 3 Analysis 2 Microsoft Excel 2 Data Analysis 2 PowerPoint 2 Customer Service 2 Legal Research Laura also knows about... 2 Management 1 Program Management 0 Business Analysis 0 Presentations 0 Gmail 0 HTML 0 CSS 0 excel 0 Pivot Tables 0 SQL                     2 Management 1 Program Management 0 Business Analysis 0 Presentations 0 Gmail 0 HTML 0 CSS 0 excel 0 Pivot Tables 0 SQL Education Cañada College 2015  – 2015 Course in Elementary Probability and Statistics General Assembly 2015  – 2015 SQL Bootcamp University of North Carolina at Chapel Hill Bachelor of Arts (B.A.),  International/Global Studies 2006  – 2010 Carlmont High School 2004  – 2006 Cañada College 2015  – 2015 Course in Elementary Probability and Statistics Cañada College 2015  – 2015 Course in Elementary Probability and Statistics Cañada College 2015  – 2015 Course in Elementary Probability and Statistics General Assembly 2015  – 2015 SQL Bootcamp General Assembly 2015  – 2015 SQL Bootcamp General Assembly 2015  – 2015 SQL Bootcamp University of North Carolina at Chapel Hill Bachelor of Arts (B.A.),  International/Global Studies 2006  – 2010 University of North Carolina at Chapel Hill Bachelor of Arts (B.A.),  International/Global Studies 2006  – 2010 University of North Carolina at Chapel Hill Bachelor of Arts (B.A.),  International/Global Studies 2006  – 2010 Carlmont High School 2004  – 2006 Carlmont High School 2004  – 2006 Carlmont High School 2004  – 2006 ", "Experience Product Marketing Manager, AdWords Google February 2014  – Present (1 year 6 months) Mountain View, CA Marketing Manager for AdWords performance products. Account Manager Google 2011  –  February 2014  (3 years) San Francisco, CA Manage over $40M (annual) Google search & display media. Manage e-commerce & branding media across online search, mobile & display marketing platforms. Account Coordinator Google February 2009  –  May 2011  (2 years 4 months) Greater Seattle Area Account management support for 11 retailers, and $90M+ annual revenue. Manage e-commerce & branding media across online, mobile & display marketing platforms. Recruiting Coordinator Google November 2007  –  February 2009  (1 year 4 months) Recruiting Coordinator for Business Operations and Legal Legal Assistant Berry, Appleman & Leiden LLP September 2006  –  November 2007  (1 year 3 months) Legal Assistant at immigration law firm Product Marketing Manager, AdWords Google February 2014  – Present (1 year 6 months) Mountain View, CA Marketing Manager for AdWords performance products. Product Marketing Manager, AdWords Google February 2014  – Present (1 year 6 months) Mountain View, CA Marketing Manager for AdWords performance products. Account Manager Google 2011  –  February 2014  (3 years) San Francisco, CA Manage over $40M (annual) Google search & display media. Manage e-commerce & branding media across online search, mobile & display marketing platforms. Account Manager Google 2011  –  February 2014  (3 years) San Francisco, CA Manage over $40M (annual) Google search & display media. Manage e-commerce & branding media across online search, mobile & display marketing platforms. Account Coordinator Google February 2009  –  May 2011  (2 years 4 months) Greater Seattle Area Account management support for 11 retailers, and $90M+ annual revenue. Manage e-commerce & branding media across online, mobile & display marketing platforms. Account Coordinator Google February 2009  –  May 2011  (2 years 4 months) Greater Seattle Area Account management support for 11 retailers, and $90M+ annual revenue. Manage e-commerce & branding media across online, mobile & display marketing platforms. Recruiting Coordinator Google November 2007  –  February 2009  (1 year 4 months) Recruiting Coordinator for Business Operations and Legal Recruiting Coordinator Google November 2007  –  February 2009  (1 year 4 months) Recruiting Coordinator for Business Operations and Legal Legal Assistant Berry, Appleman & Leiden LLP September 2006  –  November 2007  (1 year 3 months) Legal Assistant at immigration law firm Legal Assistant Berry, Appleman & Leiden LLP September 2006  –  November 2007  (1 year 3 months) Legal Assistant at immigration law firm Languages Spanish Spanish Spanish Skills Top Skills 9 E-commerce 8 Google Adwords 6 Management 5 Account Management 5 Display Advertising 5 Mobile Devices 4 PPC 3 Online Advertising 2 Digital Marketing 2 Google Analytics Angela also knows about... 2 Social Media 2 Online Marketing 1 Digital Strategy 1 Marketing 0 Social Media Marketing 0 Marketing Communications Skills  Top Skills 9 E-commerce 8 Google Adwords 6 Management 5 Account Management 5 Display Advertising 5 Mobile Devices 4 PPC 3 Online Advertising 2 Digital Marketing 2 Google Analytics Angela also knows about... 2 Social Media 2 Online Marketing 1 Digital Strategy 1 Marketing 0 Social Media Marketing 0 Marketing Communications Top Skills 9 E-commerce 8 Google Adwords 6 Management 5 Account Management 5 Display Advertising 5 Mobile Devices 4 PPC 3 Online Advertising 2 Digital Marketing 2 Google Analytics Angela also knows about... 2 Social Media 2 Online Marketing 1 Digital Strategy 1 Marketing 0 Social Media Marketing 0 Marketing Communications Top Skills 9 E-commerce 8 Google Adwords 6 Management 5 Account Management 5 Display Advertising 5 Mobile Devices 4 PPC 3 Online Advertising 2 Digital Marketing 2 Google Analytics Angela also knows about... 2 Social Media 2 Online Marketing 1 Digital Strategy 1 Marketing 0 Social Media Marketing 0 Marketing Communications                     2 Social Media 2 Online Marketing 1 Digital Strategy 1 Marketing 0 Social Media Marketing 0 Marketing Communications Education Santa Clara University Bachelor of Arts (B.A.),  English Language and Literature ,  General 2002  – 2006 IESE Spanish Language and Literature 2004  – 2004 Santa Clara University Minor,  Spanish Language and Literature Santa Clara University Bachelor of Arts (B.A.),  English Language and Literature ,  General 2002  – 2006 Santa Clara University Bachelor of Arts (B.A.),  English Language and Literature ,  General 2002  – 2006 Santa Clara University Bachelor of Arts (B.A.),  English Language and Literature ,  General 2002  – 2006 IESE Spanish Language and Literature 2004  – 2004 IESE Spanish Language and Literature 2004  – 2004 IESE Spanish Language and Literature 2004  – 2004 Santa Clara University Minor,  Spanish Language and Literature Santa Clara University Minor,  Spanish Language and Literature Santa Clara University Minor,  Spanish Language and Literature ", "Summary Competition policy and EU institutions - European Commission Edit Summary Competition policy and EU institutions - European Commission Edit   Competition policy and EU institutions - European Commission Edit Competition policy and EU institutions - European Commission Edit Competition policy and EU institutions - European Commission Edit Competition policy and EU institutions - European Commission  Competition policy and EU institutions - European Commission  Experience Legal Assistant, Trademarks Google October 2012  – Present (2 years 10 months) Dublin, Ireland AdWords Trademark Policy Edit Legal Assistant, Trademarks Google October 2012  – Present (2 years 10 months) Dublin, Ireland AdWords Trademark Policy Edit Legal Assistant, Trademarks Google October 2012  – Present (2 years 10 months) Dublin, Ireland AdWords Trademark Policy Edit AdWords Trademark Policy Edit AdWords Trademark Policy Edit AdWords Trademark Policy  AdWords Trademark Policy  Languages Italian Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency Italian Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency Italian Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Top Skills 26 Competition Law 24 Legal Writing 22 French 22 European Union 14 European Law 10 Legal Research 8 Trademarks 7 Italian 6 Privacy Law 6 Policy Analysis Alessandro also knows about... 5 Legal Support 4 Spanish 4 Mergers & Acquisitions 4 Intellectual Property 3 Google Adwords 3 Corporate Law 3 Policy 3 Social Media 2 Policy/Procedure... 2 IT law 2 Cyberlaw 1 Policy Writing 1 English 1 Translation 1 Legal Translation 1 Document Review 1 Public Speaking 0 Project Management 1 International Relations 2 Legal Advice 0 European Affairs 0 Creative Writing 0 Social Media Marketing 0 Strategic Communications 0 Social Media Monitoring 0 Media Monitoring 0 European Studies 0 Television 0 Television Production 0 European Union Politics See 15+     See less Skills  Top Skills 26 Competition Law 24 Legal Writing 22 French 22 European Union 14 European Law 10 Legal Research 8 Trademarks 7 Italian 6 Privacy Law 6 Policy Analysis Alessandro also knows about... 5 Legal Support 4 Spanish 4 Mergers & Acquisitions 4 Intellectual Property 3 Google Adwords 3 Corporate Law 3 Policy 3 Social Media 2 Policy/Procedure... 2 IT law 2 Cyberlaw 1 Policy Writing 1 English 1 Translation 1 Legal Translation 1 Document Review 1 Public Speaking 0 Project Management 1 International Relations 2 Legal Advice 0 European Affairs 0 Creative Writing 0 Social Media Marketing 0 Strategic Communications 0 Social Media Monitoring 0 Media Monitoring 0 European Studies 0 Television 0 Television Production 0 European Union Politics See 15+     See less Top Skills 26 Competition Law 24 Legal Writing 22 French 22 European Union 14 European Law 10 Legal Research 8 Trademarks 7 Italian 6 Privacy Law 6 Policy Analysis Alessandro also knows about... 5 Legal Support 4 Spanish 4 Mergers & Acquisitions 4 Intellectual Property 3 Google Adwords 3 Corporate Law 3 Policy 3 Social Media 2 Policy/Procedure... 2 IT law 2 Cyberlaw 1 Policy Writing 1 English 1 Translation 1 Legal Translation 1 Document Review 1 Public Speaking 0 Project Management 1 International Relations 2 Legal Advice 0 European Affairs 0 Creative Writing 0 Social Media Marketing 0 Strategic Communications 0 Social Media Monitoring 0 Media Monitoring 0 European Studies 0 Television 0 Television Production 0 European Union Politics See 15+     See less Top Skills 26 Competition Law 24 Legal Writing 22 French 22 European Union 14 European Law 10 Legal Research 8 Trademarks 7 Italian 6 Privacy Law 6 Policy Analysis Alessandro also knows about... 5 Legal Support 4 Spanish 4 Mergers & Acquisitions 4 Intellectual Property 3 Google Adwords 3 Corporate Law 3 Policy 3 Social Media 2 Policy/Procedure... 2 IT law 2 Cyberlaw 1 Policy Writing 1 English 1 Translation 1 Legal Translation 1 Document Review 1 Public Speaking 0 Project Management 1 International Relations 2 Legal Advice 0 European Affairs 0 Creative Writing 0 Social Media Marketing 0 Strategic Communications 0 Social Media Monitoring 0 Media Monitoring 0 European Studies 0 Television 0 Television Production 0 European Union Politics See 15+     See less                     5 Legal Support 4 Spanish 4 Mergers & Acquisitions 4 Intellectual Property 3 Google Adwords 3 Corporate Law 3 Policy 3 Social Media 2 Policy/Procedure... 2 IT law 2 Cyberlaw 1 Policy Writing 1 English 1 Translation 1 Legal Translation 1 Document Review 1 Public Speaking 0 Project Management 1 International Relations 2 Legal Advice 0 European Affairs 0 Creative Writing 0 Social Media Marketing 0 Strategic Communications 0 Social Media Monitoring 0 Media Monitoring 0 European Studies 0 Television 0 Television Production 0 European Union Politics ", "Experience Head of Sales Operations and Analytics, Google Fiber Google January 2013  – Present (2 years 7 months) New York, NY Business Strategy Principal, Rich Media Google February 2012  –  January 2013  (1 year) Mountain View, CA Work to develop long-term strategy for Rich Media technical business. Apply online advertising industry expertise to actionable plans. Strategy & Operations Analyst, Partnership Solutions Organization Google March 2010  –  February 2012  (2 years) Mountain View, CA Responsible for resource planning, partner service models, development of AdSense partnership strategies, and long-term business goals for the technical group behind our major partnerships Financial Operations Analyst Google March 2008  –  March 2010  (2 years 1 month) Mountain View, CA Launched two payroll systems and implemented new stock process in the US and Canada Legal Assistant Google December 2006  –  March 2008  (1 year 4 months) Mountain View, CA Trademarks and compliance Legal Assistant Skadden, Arps, Slate, Meagher & Flom LLP & Affiliates June 2005  –  December 2006  (1 year 7 months) New York, NY Corporate M&A and Private Equity Investment Head of Sales Operations and Analytics, Google Fiber Google January 2013  – Present (2 years 7 months) New York, NY Head of Sales Operations and Analytics, Google Fiber Google January 2013  – Present (2 years 7 months) New York, NY Business Strategy Principal, Rich Media Google February 2012  –  January 2013  (1 year) Mountain View, CA Work to develop long-term strategy for Rich Media technical business. Apply online advertising industry expertise to actionable plans. Business Strategy Principal, Rich Media Google February 2012  –  January 2013  (1 year) Mountain View, CA Work to develop long-term strategy for Rich Media technical business. Apply online advertising industry expertise to actionable plans. Strategy & Operations Analyst, Partnership Solutions Organization Google March 2010  –  February 2012  (2 years) Mountain View, CA Responsible for resource planning, partner service models, development of AdSense partnership strategies, and long-term business goals for the technical group behind our major partnerships Strategy & Operations Analyst, Partnership Solutions Organization Google March 2010  –  February 2012  (2 years) Mountain View, CA Responsible for resource planning, partner service models, development of AdSense partnership strategies, and long-term business goals for the technical group behind our major partnerships Financial Operations Analyst Google March 2008  –  March 2010  (2 years 1 month) Mountain View, CA Launched two payroll systems and implemented new stock process in the US and Canada Financial Operations Analyst Google March 2008  –  March 2010  (2 years 1 month) Mountain View, CA Launched two payroll systems and implemented new stock process in the US and Canada Legal Assistant Google December 2006  –  March 2008  (1 year 4 months) Mountain View, CA Trademarks and compliance Legal Assistant Google December 2006  –  March 2008  (1 year 4 months) Mountain View, CA Trademarks and compliance Legal Assistant Skadden, Arps, Slate, Meagher & Flom LLP & Affiliates June 2005  –  December 2006  (1 year 7 months) New York, NY Corporate M&A and Private Equity Investment Legal Assistant Skadden, Arps, Slate, Meagher & Flom LLP & Affiliates June 2005  –  December 2006  (1 year 7 months) New York, NY Corporate M&A and Private Equity Investment Skills 2 Strategy 1 Business Strategy Skills  2 Strategy 1 Business Strategy 2 Strategy 1 Business Strategy 2 Strategy 1 Business Strategy     Education Georgetown University 2001  – 2005 Georgetown University 2001  – 2005 Georgetown University 2001  – 2005 Georgetown University 2001  – 2005 ", "Experience Chief of Staff Google March 2013  – Present (2 years 5 months) Mountain View, CA Work directly with executives and senior leaders to execute critical business projects, while partnering with staff across organizations and leading a cross functional team. Responsible for organizational and operational planning, including team growth and recruiting and budget planning.  \n \nEmploy project and program management skills in execution of key projects central to Google's mission and work with global team. Currently working on projects in Research and Machine Intelligence. (Open) 1 recommendation Danielle Rostick, MSPM Project/Program Manager and Business Analyst Irina was not just a valued team member and/or leader on multiple projects, she was an Includer, who is able to bring people from various backgrounds together. Her unique talent is identifying the strengths of the team and allowing for individual... View Program Manager, Engineering Google March 2013  – Present (2 years 5 months) Mountain View, CA Project manager for engineering team, working with stakeholders to define scope and coordinate effort for engineering product team. Develop project plans and estimates working with engineers and leads, utilizing project management tools and experience to collaborate and effectively communicate across the team, as well as across job functions. Chief of Staff Google March 2013  – Present (2 years 5 months) Mountain View, CA Work directly with executives and senior leaders to execute critical business projects, while partnering with staff across organizations and leading a cross functional team. Responsible for organizational and operational planning, including team growth and recruiting and budget planning.  \n \nEmploy project and program management skills in execution of key projects central to Google's mission and work with global team. Currently working on projects in Research and Machine Intelligence. (Open) 1 recommendation Danielle Rostick, MSPM Project/Program Manager and Business Analyst Irina was not just a valued team member and/or leader on multiple projects, she was an Includer, who is able to bring people from various backgrounds together. Her unique talent is identifying the strengths of the team and allowing for individual... View Chief of Staff Google March 2013  – Present (2 years 5 months) Mountain View, CA Work directly with executives and senior leaders to execute critical business projects, while partnering with staff across organizations and leading a cross functional team. Responsible for organizational and operational planning, including team growth and recruiting and budget planning.  \n \nEmploy project and program management skills in execution of key projects central to Google's mission and work with global team. Currently working on projects in Research and Machine Intelligence. (Open) 1 recommendation Danielle Rostick, MSPM Project/Program Manager and Business Analyst Irina was not just a valued team member and/or leader on multiple projects, she was an Includer, who is able to bring people from various backgrounds together. Her unique talent is identifying the strengths of the team and allowing for individual... View Program Manager, Engineering Google March 2013  – Present (2 years 5 months) Mountain View, CA Project manager for engineering team, working with stakeholders to define scope and coordinate effort for engineering product team. Develop project plans and estimates working with engineers and leads, utilizing project management tools and experience to collaborate and effectively communicate across the team, as well as across job functions. Program Manager, Engineering Google March 2013  – Present (2 years 5 months) Mountain View, CA Project manager for engineering team, working with stakeholders to define scope and coordinate effort for engineering product team. Develop project plans and estimates working with engineers and leads, utilizing project management tools and experience to collaborate and effectively communicate across the team, as well as across job functions. Languages Russian Russian Russian Skills Top Skills 11 Google Docs 11 Project Management 10 Google Apps 9 Event Planning 7 Microsoft Office 5 Google Analytics 5 Public Speaking 4 SEO 2 MySQL 2 Cross-functional Team... Irina also knows about... 2 Program Management 1 C++ 1 Social Media 1 Leadership 1 Management 1 Strategy 0 Executive Support 0 Department Budgeting 0 Software Development Skills  Top Skills 11 Google Docs 11 Project Management 10 Google Apps 9 Event Planning 7 Microsoft Office 5 Google Analytics 5 Public Speaking 4 SEO 2 MySQL 2 Cross-functional Team... Irina also knows about... 2 Program Management 1 C++ 1 Social Media 1 Leadership 1 Management 1 Strategy 0 Executive Support 0 Department Budgeting 0 Software Development Top Skills 11 Google Docs 11 Project Management 10 Google Apps 9 Event Planning 7 Microsoft Office 5 Google Analytics 5 Public Speaking 4 SEO 2 MySQL 2 Cross-functional Team... Irina also knows about... 2 Program Management 1 C++ 1 Social Media 1 Leadership 1 Management 1 Strategy 0 Executive Support 0 Department Budgeting 0 Software Development Top Skills 11 Google Docs 11 Project Management 10 Google Apps 9 Event Planning 7 Microsoft Office 5 Google Analytics 5 Public Speaking 4 SEO 2 MySQL 2 Cross-functional Team... Irina also knows about... 2 Program Management 1 C++ 1 Social Media 1 Leadership 1 Management 1 Strategy 0 Executive Support 0 Department Budgeting 0 Software Development                     2 Program Management 1 C++ 1 Social Media 1 Leadership 1 Management 1 Strategy 0 Executive Support 0 Department Budgeting 0 Software Development Education Stanford University Certification for Advanced Project Management (SCPM) Boston University Master of Science (M.S.),  Project Management 2012  – 2014 (Open) 1 honor or award Excellence in Graduate Studies View (Open) 12 courses, including: Financial Concepts Project Managment Project Communications Management Project Risk and Cost Management Program Management Enterprise Risk Management Ecommerce International Business, Economics, and Cultures Quantitative and Qualitative Decision-Making The Innovation Process: Developing New Products and Services See more 2 more courses (Open) 1 recommendation Donald Freese Director at National Cyber Investigative Joint Task Force Irina is a consummate professional, highly motivated, with a very high intellect; great partner in business or anything with deadline deliverable parameters that needs to be done in a team environment. Outstanding interpersonal skills, great... View University of California, Los Angeles Bachelor's Degree,  Psychology 2004  – 2007 Completed undergraduate degree in three years, while working 40 hours a week. Studies focused on psychology, neuroscience, and education, in addition to advanced course work in slavic languages. During those three years I maintained a high GPA, earning Dean's List honors quarterly and completing the Honors Program, as well as a honors thesis in Psychology. Activities and Societies:  Phi Beta Kappa ,  Psi Chi (International Honor Society in Psychology) ,  Golden Key Honor Society ,  Psychology Departmental Honors ,  The National Society of Collegiate Scholars ,  Alumni Scholar’s Club ,  Honors Program ,  Alpha Epsilon Phi (Open) 1 honor or award Psychology Departmental Honors View Bergen County Academies High School,  Academy of Business and Computer Technology 2000  – 2004 I was a student in the Business and Computer Technology Academy. As described on it's site the Bergen County Academies (BCA) is a public magnet high school in Hackensack, New Jersey. The school offers seven specialized programs in the areas of mathematics and science, engineering and design, medical science, business and finance, culinary arts and hospitality administration, visual and performing arts, and technology and computer science. The school draws top students from across the county, taking into account past performance, entrance/selection exams, and interviews in the selection and admission process. The school is consistently ranked as one of the top high schools in the nation... \n \nRanked #15 in the Nation on the 2014 list of Top High Schools by Daily Beast.  \nRanked #26 in the Nation in the 2013 Newsweek Top High Schools rankings. \nRanked #34 in the Nation in the 2013 U.S. News Top High Schools rankings. Activities and Societies:  National Honor Society ,  Future Business Leaders of America ,  4 Year Varsity Tennis ,  Debate Team ,  Academic Decathlon Team Bergen County Academies Edit Stanford University Certification for Advanced Project Management (SCPM) Stanford University Certification for Advanced Project Management (SCPM) Stanford University Certification for Advanced Project Management (SCPM) Boston University Master of Science (M.S.),  Project Management 2012  – 2014 (Open) 1 honor or award Excellence in Graduate Studies View (Open) 12 courses, including: Financial Concepts Project Managment Project Communications Management Project Risk and Cost Management Program Management Enterprise Risk Management Ecommerce International Business, Economics, and Cultures Quantitative and Qualitative Decision-Making The Innovation Process: Developing New Products and Services See more 2 more courses (Open) 1 recommendation Donald Freese Director at National Cyber Investigative Joint Task Force Irina is a consummate professional, highly motivated, with a very high intellect; great partner in business or anything with deadline deliverable parameters that needs to be done in a team environment. Outstanding interpersonal skills, great... View Boston University Master of Science (M.S.),  Project Management 2012  – 2014 (Open) 1 honor or award Excellence in Graduate Studies View (Open) 12 courses, including: Financial Concepts Project Managment Project Communications Management Project Risk and Cost Management Program Management Enterprise Risk Management Ecommerce International Business, Economics, and Cultures Quantitative and Qualitative Decision-Making The Innovation Process: Developing New Products and Services See more 2 more courses (Open) 1 recommendation Donald Freese Director at National Cyber Investigative Joint Task Force Irina is a consummate professional, highly motivated, with a very high intellect; great partner in business or anything with deadline deliverable parameters that needs to be done in a team environment. Outstanding interpersonal skills, great... View Boston University Master of Science (M.S.),  Project Management 2012  – 2014 (Open) 1 honor or award Excellence in Graduate Studies View (Open) 12 courses, including: Financial Concepts Project Managment Project Communications Management Project Risk and Cost Management Program Management Enterprise Risk Management Ecommerce International Business, Economics, and Cultures Quantitative and Qualitative Decision-Making The Innovation Process: Developing New Products and Services See more 2 more courses (Open) 1 recommendation Donald Freese Director at National Cyber Investigative Joint Task Force Irina is a consummate professional, highly motivated, with a very high intellect; great partner in business or anything with deadline deliverable parameters that needs to be done in a team environment. Outstanding interpersonal skills, great... View University of California, Los Angeles Bachelor's Degree,  Psychology 2004  – 2007 Completed undergraduate degree in three years, while working 40 hours a week. Studies focused on psychology, neuroscience, and education, in addition to advanced course work in slavic languages. During those three years I maintained a high GPA, earning Dean's List honors quarterly and completing the Honors Program, as well as a honors thesis in Psychology. Activities and Societies:  Phi Beta Kappa ,  Psi Chi (International Honor Society in Psychology) ,  Golden Key Honor Society ,  Psychology Departmental Honors ,  The National Society of Collegiate Scholars ,  Alumni Scholar’s Club ,  Honors Program ,  Alpha Epsilon Phi (Open) 1 honor or award Psychology Departmental Honors View University of California, Los Angeles Bachelor's Degree,  Psychology 2004  – 2007 Completed undergraduate degree in three years, while working 40 hours a week. Studies focused on psychology, neuroscience, and education, in addition to advanced course work in slavic languages. During those three years I maintained a high GPA, earning Dean's List honors quarterly and completing the Honors Program, as well as a honors thesis in Psychology. Activities and Societies:  Phi Beta Kappa ,  Psi Chi (International Honor Society in Psychology) ,  Golden Key Honor Society ,  Psychology Departmental Honors ,  The National Society of Collegiate Scholars ,  Alumni Scholar’s Club ,  Honors Program ,  Alpha Epsilon Phi (Open) 1 honor or award Psychology Departmental Honors View University of California, Los Angeles Bachelor's Degree,  Psychology 2004  – 2007 Completed undergraduate degree in three years, while working 40 hours a week. Studies focused on psychology, neuroscience, and education, in addition to advanced course work in slavic languages. During those three years I maintained a high GPA, earning Dean's List honors quarterly and completing the Honors Program, as well as a honors thesis in Psychology. Activities and Societies:  Phi Beta Kappa ,  Psi Chi (International Honor Society in Psychology) ,  Golden Key Honor Society ,  Psychology Departmental Honors ,  The National Society of Collegiate Scholars ,  Alumni Scholar’s Club ,  Honors Program ,  Alpha Epsilon Phi (Open) 1 honor or award Psychology Departmental Honors View Bergen County Academies High School,  Academy of Business and Computer Technology 2000  – 2004 I was a student in the Business and Computer Technology Academy. As described on it's site the Bergen County Academies (BCA) is a public magnet high school in Hackensack, New Jersey. The school offers seven specialized programs in the areas of mathematics and science, engineering and design, medical science, business and finance, culinary arts and hospitality administration, visual and performing arts, and technology and computer science. The school draws top students from across the county, taking into account past performance, entrance/selection exams, and interviews in the selection and admission process. The school is consistently ranked as one of the top high schools in the nation... \n \nRanked #15 in the Nation on the 2014 list of Top High Schools by Daily Beast.  \nRanked #26 in the Nation in the 2013 Newsweek Top High Schools rankings. \nRanked #34 in the Nation in the 2013 U.S. News Top High Schools rankings. Activities and Societies:  National Honor Society ,  Future Business Leaders of America ,  4 Year Varsity Tennis ,  Debate Team ,  Academic Decathlon Team Bergen County Academies Edit Bergen County Academies High School,  Academy of Business and Computer Technology 2000  – 2004 I was a student in the Business and Computer Technology Academy. As described on it's site the Bergen County Academies (BCA) is a public magnet high school in Hackensack, New Jersey. The school offers seven specialized programs in the areas of mathematics and science, engineering and design, medical science, business and finance, culinary arts and hospitality administration, visual and performing arts, and technology and computer science. The school draws top students from across the county, taking into account past performance, entrance/selection exams, and interviews in the selection and admission process. The school is consistently ranked as one of the top high schools in the nation... \n \nRanked #15 in the Nation on the 2014 list of Top High Schools by Daily Beast.  \nRanked #26 in the Nation in the 2013 Newsweek Top High Schools rankings. \nRanked #34 in the Nation in the 2013 U.S. News Top High Schools rankings. Activities and Societies:  National Honor Society ,  Future Business Leaders of America ,  4 Year Varsity Tennis ,  Debate Team ,  Academic Decathlon Team Bergen County Academies High School,  Academy of Business and Computer Technology 2000  – 2004 I was a student in the Business and Computer Technology Academy. As described on it's site the Bergen County Academies (BCA) is a public magnet high school in Hackensack, New Jersey. The school offers seven specialized programs in the areas of mathematics and science, engineering and design, medical science, business and finance, culinary arts and hospitality administration, visual and performing arts, and technology and computer science. The school draws top students from across the county, taking into account past performance, entrance/selection exams, and interviews in the selection and admission process. The school is consistently ranked as one of the top high schools in the nation... \n \nRanked #15 in the Nation on the 2014 list of Top High Schools by Daily Beast.  \nRanked #26 in the Nation in the 2013 Newsweek Top High Schools rankings. \nRanked #34 in the Nation in the 2013 U.S. News Top High Schools rankings. Activities and Societies:  National Honor Society ,  Future Business Leaders of America ,  4 Year Varsity Tennis ,  Debate Team ,  Academic Decathlon Team Bergen County Academies Edit Bergen County Academies Edit Bergen County Academies Edit Bergen County Academies  Bergen County Academies  Honors & Awards Excellence in Graduate Studies Boston University May 2014 OC (Operating Committee) Award Google 2010 Psychology Departmental Honors UCLA June 2007 Excellence in Graduate Studies Boston University May 2014 Excellence in Graduate Studies Boston University May 2014 Excellence in Graduate Studies Boston University May 2014 OC (Operating Committee) Award Google 2010 OC (Operating Committee) Award Google 2010 OC (Operating Committee) Award Google 2010 Psychology Departmental Honors UCLA June 2007 Psychology Departmental Honors UCLA June 2007 Psychology Departmental Honors UCLA June 2007 ", "Summary Techie fascinated in how the Internet impacts society and how society manifests itself in the Internet. Experience working both on cutting-edge legal agreements (especially advertising contracts, partnerships deals and M&A commercial diligence) as well as engaging with emerging tech policy issues. Comfortable negotiating contracts, improving legal processes as well as conducting hands-on research, ranging from detailed qualitative as well as quantitative (especially regression-based) analysis. A firm believer in keeping the Web a free, open and innovative platform for all to enjoy. Summary Techie fascinated in how the Internet impacts society and how society manifests itself in the Internet. Experience working both on cutting-edge legal agreements (especially advertising contracts, partnerships deals and M&A commercial diligence) as well as engaging with emerging tech policy issues. Comfortable negotiating contracts, improving legal processes as well as conducting hands-on research, ranging from detailed qualitative as well as quantitative (especially regression-based) analysis. A firm believer in keeping the Web a free, open and innovative platform for all to enjoy. Techie fascinated in how the Internet impacts society and how society manifests itself in the Internet. Experience working both on cutting-edge legal agreements (especially advertising contracts, partnerships deals and M&A commercial diligence) as well as engaging with emerging tech policy issues. Comfortable negotiating contracts, improving legal processes as well as conducting hands-on research, ranging from detailed qualitative as well as quantitative (especially regression-based) analysis. A firm believer in keeping the Web a free, open and innovative platform for all to enjoy. Techie fascinated in how the Internet impacts society and how society manifests itself in the Internet. Experience working both on cutting-edge legal agreements (especially advertising contracts, partnerships deals and M&A commercial diligence) as well as engaging with emerging tech policy issues. Comfortable negotiating contracts, improving legal processes as well as conducting hands-on research, ranging from detailed qualitative as well as quantitative (especially regression-based) analysis. A firm believer in keeping the Web a free, open and innovative platform for all to enjoy. Experience BOLD Intern for Ethics & Compliance Google June 2013  –  August 2013  (3 months) Mountain View, California BOLD Intern for Public Policy Google May 2012  –  August 2012  (4 months) Washington D.C. Metro Area Research Clerk Indiano & Williams PSC May 2011  –  August 2011  (4 months) Puerto Rico BOLD Intern for Ethics & Compliance Google June 2013  –  August 2013  (3 months) Mountain View, California BOLD Intern for Ethics & Compliance Google June 2013  –  August 2013  (3 months) Mountain View, California BOLD Intern for Public Policy Google May 2012  –  August 2012  (4 months) Washington D.C. Metro Area BOLD Intern for Public Policy Google May 2012  –  August 2012  (4 months) Washington D.C. Metro Area Research Clerk Indiano & Williams PSC May 2011  –  August 2011  (4 months) Puerto Rico Research Clerk Indiano & Williams PSC May 2011  –  August 2011  (4 months) Puerto Rico Languages Spanish Spanish Spanish Skills Top Skills 13 Public Policy 7 Politics 6 Research 5 Legal Research 3 Strategic Communications 2 Qualitative Research 2 Policy Analysis 1 Data Analysis 0 Risk Assessment 0 Due Diligence Jeffrey also knows about... 0 Regression Analysis Skills  Top Skills 13 Public Policy 7 Politics 6 Research 5 Legal Research 3 Strategic Communications 2 Qualitative Research 2 Policy Analysis 1 Data Analysis 0 Risk Assessment 0 Due Diligence Jeffrey also knows about... 0 Regression Analysis Top Skills 13 Public Policy 7 Politics 6 Research 5 Legal Research 3 Strategic Communications 2 Qualitative Research 2 Policy Analysis 1 Data Analysis 0 Risk Assessment 0 Due Diligence Jeffrey also knows about... 0 Regression Analysis Top Skills 13 Public Policy 7 Politics 6 Research 5 Legal Research 3 Strategic Communications 2 Qualitative Research 2 Policy Analysis 1 Data Analysis 0 Risk Assessment 0 Due Diligence Jeffrey also knows about... 0 Regression Analysis                     0 Regression Analysis Education The George Washington University BA,  Political Communication 2010  – 2014 The George Washington University BA,  Political Communication 2010  – 2014 The George Washington University BA,  Political Communication 2010  – 2014 The George Washington University BA,  Political Communication 2010  – 2014 Honors & Awards ", "Experience Technical Solutions Consultant Google March 2015  – Present (5 months) Chicago, IL Senior Research Analyst Twitter October 2014  –  March 2015  (6 months) Chicago, IL Program Manager / Senior Strategist, Cloud Platform Abuse Team Google March 2014  –  October 2014  (8 months) Mountain View, CA -Manage cross functional team from Engineering, Operations, and Product \n-Maintain task trackers, deliverables, timelines \n-Perform stakeholder requirements gathering \n-Feature/scope prioritization for cross functional team \n-Assist leadership with strategy, communication, and process improvements \n-Maintain balance between long term strategic planning and day to day tactical program management Cloud Platform Security Analyst Google March 2013  –  March 2014  (1 year 1 month) Mountain View, CA -Abuse prevention on Google Cloud Platform \n-Big data analysis using SQL \n-Basic scripting and development using Python and Closure templating \n-Interfacing with external security vendors and services \n-Creation of external developer communication \n-Internal policy development \n-Technical project management of internal tool development Product Quality Strategist Google October 2012  –  March 2013  (6 months) Mountain View, CA -Define strategy and vision for account infrastructure abuse prevention \n-Project management for internal tool development with cross-functional stakeholders \n-Data analysis of common account abuse/usage trends \n-Responsible for maintaining high quality user experiences for account level data Local Search Quality Analyst Google June 2011  –  October 2012  (1 year 5 months) -Performed data analysis of geo-local data to make recommendations on improving accuracy and relevancy of local search queries \n-Collaborated with sales and other consumer facing teams to ensure product met user requirements \n-Launched new anti-abuse initiatives across multiple Geo related products \n-Managed 10 person vendor team responsible for Google Maps data quality Network Services Intern State of Wisconsin Investment Board January 2011  –  May 2011  (5 months) Perform network and end-user support for internal users and external contractors of organization technology resources. Create, maintain, and deploy system images. Assist with issues regarding technologies like BlackBerry (Enterprise Server and devices), Citrix, and the Microsoft Office Suite. Perform Help Desk problem resolution. Create and manage technical process documentation. Manage Active Directory additions and changes. Computer-Aided Engineering Help Desk Consultant University of Wisconsin-Madison September 2009  –  May 2011  (1 year 9 months) Assist end-users with troubleshooting issues that arise regarding the Computer-Aided Engineering (CAE) Department's network and available software. Function as the main resource for questions regarding Windows 7. Perform basic essential physical maintenance for hardware in CAE labs. Respond to user-submitted inquiries via a ticket-based system and manage ticket queue appropriately. Test deployed virtualized software to ensure proper functionality. Server Analyst Intern Integrys May 2009  –  August 2010  (1 year 4 months) Summer Intern 2009/2010/2011 \n \nDesigned, implemented, and supported server operating systems, hardware, and related architecture. Supported devices both physical and virtual through the use of VMWare virtualization software. Collected and analyzed metrics of utilization of these technologies. Supported enterprise-level software including Microsoft Active Directory, Exchange, Sharepoint, Office Communicator, Windows Server, What’s Up Gold, and Novell iChain. Collaborated with a geographically dispersed workgroup using the latest communication tools to maintain proper function and cross-company integration of these technologies following a major merger which formed a Fortune 500 corporation. Legal Assistant Froelich Law Offices May 2008  –  August 2008  (4 months) Green Bay, Wisconsin Area Electronics Specialist OfficeMax June 2006  –  August 2007  (1 year 3 months) Green Bay, Wisconsin Area Technical Solutions Consultant Google March 2015  – Present (5 months) Chicago, IL Technical Solutions Consultant Google March 2015  – Present (5 months) Chicago, IL Senior Research Analyst Twitter October 2014  –  March 2015  (6 months) Chicago, IL Senior Research Analyst Twitter October 2014  –  March 2015  (6 months) Chicago, IL Program Manager / Senior Strategist, Cloud Platform Abuse Team Google March 2014  –  October 2014  (8 months) Mountain View, CA -Manage cross functional team from Engineering, Operations, and Product \n-Maintain task trackers, deliverables, timelines \n-Perform stakeholder requirements gathering \n-Feature/scope prioritization for cross functional team \n-Assist leadership with strategy, communication, and process improvements \n-Maintain balance between long term strategic planning and day to day tactical program management Program Manager / Senior Strategist, Cloud Platform Abuse Team Google March 2014  –  October 2014  (8 months) Mountain View, CA -Manage cross functional team from Engineering, Operations, and Product \n-Maintain task trackers, deliverables, timelines \n-Perform stakeholder requirements gathering \n-Feature/scope prioritization for cross functional team \n-Assist leadership with strategy, communication, and process improvements \n-Maintain balance between long term strategic planning and day to day tactical program management Cloud Platform Security Analyst Google March 2013  –  March 2014  (1 year 1 month) Mountain View, CA -Abuse prevention on Google Cloud Platform \n-Big data analysis using SQL \n-Basic scripting and development using Python and Closure templating \n-Interfacing with external security vendors and services \n-Creation of external developer communication \n-Internal policy development \n-Technical project management of internal tool development Cloud Platform Security Analyst Google March 2013  –  March 2014  (1 year 1 month) Mountain View, CA -Abuse prevention on Google Cloud Platform \n-Big data analysis using SQL \n-Basic scripting and development using Python and Closure templating \n-Interfacing with external security vendors and services \n-Creation of external developer communication \n-Internal policy development \n-Technical project management of internal tool development Product Quality Strategist Google October 2012  –  March 2013  (6 months) Mountain View, CA -Define strategy and vision for account infrastructure abuse prevention \n-Project management for internal tool development with cross-functional stakeholders \n-Data analysis of common account abuse/usage trends \n-Responsible for maintaining high quality user experiences for account level data Product Quality Strategist Google October 2012  –  March 2013  (6 months) Mountain View, CA -Define strategy and vision for account infrastructure abuse prevention \n-Project management for internal tool development with cross-functional stakeholders \n-Data analysis of common account abuse/usage trends \n-Responsible for maintaining high quality user experiences for account level data Local Search Quality Analyst Google June 2011  –  October 2012  (1 year 5 months) -Performed data analysis of geo-local data to make recommendations on improving accuracy and relevancy of local search queries \n-Collaborated with sales and other consumer facing teams to ensure product met user requirements \n-Launched new anti-abuse initiatives across multiple Geo related products \n-Managed 10 person vendor team responsible for Google Maps data quality Local Search Quality Analyst Google June 2011  –  October 2012  (1 year 5 months) -Performed data analysis of geo-local data to make recommendations on improving accuracy and relevancy of local search queries \n-Collaborated with sales and other consumer facing teams to ensure product met user requirements \n-Launched new anti-abuse initiatives across multiple Geo related products \n-Managed 10 person vendor team responsible for Google Maps data quality Network Services Intern State of Wisconsin Investment Board January 2011  –  May 2011  (5 months) Perform network and end-user support for internal users and external contractors of organization technology resources. Create, maintain, and deploy system images. Assist with issues regarding technologies like BlackBerry (Enterprise Server and devices), Citrix, and the Microsoft Office Suite. Perform Help Desk problem resolution. Create and manage technical process documentation. Manage Active Directory additions and changes. Network Services Intern State of Wisconsin Investment Board January 2011  –  May 2011  (5 months) Perform network and end-user support for internal users and external contractors of organization technology resources. Create, maintain, and deploy system images. Assist with issues regarding technologies like BlackBerry (Enterprise Server and devices), Citrix, and the Microsoft Office Suite. Perform Help Desk problem resolution. Create and manage technical process documentation. Manage Active Directory additions and changes. Computer-Aided Engineering Help Desk Consultant University of Wisconsin-Madison September 2009  –  May 2011  (1 year 9 months) Assist end-users with troubleshooting issues that arise regarding the Computer-Aided Engineering (CAE) Department's network and available software. Function as the main resource for questions regarding Windows 7. Perform basic essential physical maintenance for hardware in CAE labs. Respond to user-submitted inquiries via a ticket-based system and manage ticket queue appropriately. Test deployed virtualized software to ensure proper functionality. Computer-Aided Engineering Help Desk Consultant University of Wisconsin-Madison September 2009  –  May 2011  (1 year 9 months) Assist end-users with troubleshooting issues that arise regarding the Computer-Aided Engineering (CAE) Department's network and available software. Function as the main resource for questions regarding Windows 7. Perform basic essential physical maintenance for hardware in CAE labs. Respond to user-submitted inquiries via a ticket-based system and manage ticket queue appropriately. Test deployed virtualized software to ensure proper functionality. Server Analyst Intern Integrys May 2009  –  August 2010  (1 year 4 months) Summer Intern 2009/2010/2011 \n \nDesigned, implemented, and supported server operating systems, hardware, and related architecture. Supported devices both physical and virtual through the use of VMWare virtualization software. Collected and analyzed metrics of utilization of these technologies. Supported enterprise-level software including Microsoft Active Directory, Exchange, Sharepoint, Office Communicator, Windows Server, What’s Up Gold, and Novell iChain. Collaborated with a geographically dispersed workgroup using the latest communication tools to maintain proper function and cross-company integration of these technologies following a major merger which formed a Fortune 500 corporation. Server Analyst Intern Integrys May 2009  –  August 2010  (1 year 4 months) Summer Intern 2009/2010/2011 \n \nDesigned, implemented, and supported server operating systems, hardware, and related architecture. Supported devices both physical and virtual through the use of VMWare virtualization software. Collected and analyzed metrics of utilization of these technologies. Supported enterprise-level software including Microsoft Active Directory, Exchange, Sharepoint, Office Communicator, Windows Server, What’s Up Gold, and Novell iChain. Collaborated with a geographically dispersed workgroup using the latest communication tools to maintain proper function and cross-company integration of these technologies following a major merger which formed a Fortune 500 corporation. Legal Assistant Froelich Law Offices May 2008  –  August 2008  (4 months) Green Bay, Wisconsin Area Legal Assistant Froelich Law Offices May 2008  –  August 2008  (4 months) Green Bay, Wisconsin Area Electronics Specialist OfficeMax June 2006  –  August 2007  (1 year 3 months) Green Bay, Wisconsin Area Electronics Specialist OfficeMax June 2006  –  August 2007  (1 year 3 months) Green Bay, Wisconsin Area Skills Top Skills 9 Data Analysis 7 Project Management 6 Troubleshooting 6 Running 4 Microsoft Office 3 Social Media 1 Research 1 Local Search 0 Customer Service 0 SQL Benjamin also knows about... 0 Python Skills  Top Skills 9 Data Analysis 7 Project Management 6 Troubleshooting 6 Running 4 Microsoft Office 3 Social Media 1 Research 1 Local Search 0 Customer Service 0 SQL Benjamin also knows about... 0 Python Top Skills 9 Data Analysis 7 Project Management 6 Troubleshooting 6 Running 4 Microsoft Office 3 Social Media 1 Research 1 Local Search 0 Customer Service 0 SQL Benjamin also knows about... 0 Python Top Skills 9 Data Analysis 7 Project Management 6 Troubleshooting 6 Running 4 Microsoft Office 3 Social Media 1 Research 1 Local Search 0 Customer Service 0 SQL Benjamin also knows about... 0 Python                     0 Python Education The University of Chicago Master of Science (M.S.),  Computer Science 2015  – 2017 University of Wisconsin-Madison - School of Business BBA,  Management Information Systems 2008  – 2011 Activities and Societies:  Association of Information Systems Professionals - President ,  Wisconsin Track Club - Member/Webmaster ,  Associated Students of Madison Student Judiciary - Legal Outreach Consultant Purdue University Computer and Information Technology 2007  – 2008 Activities and Societies:  Association of Information Technology Professionals - Member The University of Chicago Master of Science (M.S.),  Computer Science 2015  – 2017 The University of Chicago Master of Science (M.S.),  Computer Science 2015  – 2017 The University of Chicago Master of Science (M.S.),  Computer Science 2015  – 2017 University of Wisconsin-Madison - School of Business BBA,  Management Information Systems 2008  – 2011 Activities and Societies:  Association of Information Systems Professionals - President ,  Wisconsin Track Club - Member/Webmaster ,  Associated Students of Madison Student Judiciary - Legal Outreach Consultant University of Wisconsin-Madison - School of Business BBA,  Management Information Systems 2008  – 2011 Activities and Societies:  Association of Information Systems Professionals - President ,  Wisconsin Track Club - Member/Webmaster ,  Associated Students of Madison Student Judiciary - Legal Outreach Consultant University of Wisconsin-Madison - School of Business BBA,  Management Information Systems 2008  – 2011 Activities and Societies:  Association of Information Systems Professionals - President ,  Wisconsin Track Club - Member/Webmaster ,  Associated Students of Madison Student Judiciary - Legal Outreach Consultant Purdue University Computer and Information Technology 2007  – 2008 Activities and Societies:  Association of Information Technology Professionals - Member Purdue University Computer and Information Technology 2007  – 2008 Activities and Societies:  Association of Information Technology Professionals - Member Purdue University Computer and Information Technology 2007  – 2008 Activities and Societies:  Association of Information Technology Professionals - Member Honors & Awards Additional Honors & Awards Alpha Lambda Delta Honor Society 2007-2011, Phi Eta Sigma Honor Society 2007-2011 Additional Honors & Awards Alpha Lambda Delta Honor Society 2007-2011, Phi Eta Sigma Honor Society 2007-2011 Additional Honors & Awards Alpha Lambda Delta Honor Society 2007-2011, Phi Eta Sigma Honor Society 2007-2011 Additional Honors & Awards Alpha Lambda Delta Honor Society 2007-2011, Phi Eta Sigma Honor Society 2007-2011 ", "Summary Public policy and government affairs professional specialising in internet policy and political outreach. Over 6 years experience executing policy campaigns and effectively managing high profile complex business issues.  \n \nWorking for Google, I tackle some of the toughest challenges of the information age at the often fraught intersection of politics, policy, and new technology. My role is to develop and lead campaigns to achieve Google’s public policy and regulatory goals; utilising legislative, public affairs, and media strategies. \n \nExperience \n*Campaigns - political outreach, public affairs, grassroots, and third-party relations \n*Messaging on complex issues that resonates and sways people \n*Designing and implementing public policy outreach strategies \n*Engagement at the highest levels of political office \n \nSkills \n*Economics of the web, innovation and productivity \n*Policy for technology and an open web (from competition to privacy to copyright) \n*All things Google \n \nQualified lawyer in Australia with a strong academic background in economics, mathematics and investment management. Summary Public policy and government affairs professional specialising in internet policy and political outreach. Over 6 years experience executing policy campaigns and effectively managing high profile complex business issues.  \n \nWorking for Google, I tackle some of the toughest challenges of the information age at the often fraught intersection of politics, policy, and new technology. My role is to develop and lead campaigns to achieve Google’s public policy and regulatory goals; utilising legislative, public affairs, and media strategies. \n \nExperience \n*Campaigns - political outreach, public affairs, grassroots, and third-party relations \n*Messaging on complex issues that resonates and sways people \n*Designing and implementing public policy outreach strategies \n*Engagement at the highest levels of political office \n \nSkills \n*Economics of the web, innovation and productivity \n*Policy for technology and an open web (from competition to privacy to copyright) \n*All things Google \n \nQualified lawyer in Australia with a strong academic background in economics, mathematics and investment management. Public policy and government affairs professional specialising in internet policy and political outreach. Over 6 years experience executing policy campaigns and effectively managing high profile complex business issues.  \n \nWorking for Google, I tackle some of the toughest challenges of the information age at the often fraught intersection of politics, policy, and new technology. My role is to develop and lead campaigns to achieve Google’s public policy and regulatory goals; utilising legislative, public affairs, and media strategies. \n \nExperience \n*Campaigns - political outreach, public affairs, grassroots, and third-party relations \n*Messaging on complex issues that resonates and sways people \n*Designing and implementing public policy outreach strategies \n*Engagement at the highest levels of political office \n \nSkills \n*Economics of the web, innovation and productivity \n*Policy for technology and an open web (from competition to privacy to copyright) \n*All things Google \n \nQualified lawyer in Australia with a strong academic background in economics, mathematics and investment management. Public policy and government affairs professional specialising in internet policy and political outreach. Over 6 years experience executing policy campaigns and effectively managing high profile complex business issues.  \n \nWorking for Google, I tackle some of the toughest challenges of the information age at the often fraught intersection of politics, policy, and new technology. My role is to develop and lead campaigns to achieve Google’s public policy and regulatory goals; utilising legislative, public affairs, and media strategies. \n \nExperience \n*Campaigns - political outreach, public affairs, grassroots, and third-party relations \n*Messaging on complex issues that resonates and sways people \n*Designing and implementing public policy outreach strategies \n*Engagement at the highest levels of political office \n \nSkills \n*Economics of the web, innovation and productivity \n*Policy for technology and an open web (from competition to privacy to copyright) \n*All things Google \n \nQualified lawyer in Australia with a strong academic background in economics, mathematics and investment management. Experience Counsel, Public Policy & Government Affairs Google January 2015  – Present (7 months) Washington D.C. US Federal lead of Google's relationships with trade associations and industry groups; helping them to develop policy, campaign, and liaise with US Congress and the Administration. \n \nWork to ensure Google - and the open internet - have a strong voice in the US policy debate with broad support for our positions. Help Congress and policymakers understand Google’s business and the work we do to keep the internet open, to build great products, and to fuel economic growth around the world. Counsel, Public Policy & Government Affairs Google June 2014  – Present (1 year 2 months) Sydney, Australia Australian lead on tech policy to create a thriving economy and to demonstrate the economic benefits of the internet. Responsible for representing Google externally to Ministers, MPs, government officials, policymakers, civil society advocates and thought-leaders.  \n \nFocused on strategic business issues and engaging with the Federal Government to convey Google’s policy positions and to garner support for policies to promote an open internet.  \n \nSuccessfully positioned the internet as an important economic enabler and shaped the policy debate in Australia through thought leadership and political engagement. One research project, The Startup Economy by PwC in 2013, was launched by Comms Minister Malcolm Turnbull and reported in the Economist, Wall Street Journal and New York Times. Senior Analyst, Public Policy & Government Affairs Google December 2012  –  May 2014  (1 year 6 months) Sydney, Australia Australian lead on tech policy to create a thriving economy and to demonstrate the economic benefits of the internet. Responsible for representing Google externally to Ministers, MPs, government officials, policymakers, civil society advocates and thought-leaders.  Analyst, Public Policy & Government Affairs Google May 2011  –  November 2012  (1 year 7 months) Sydney, Australia Australian lead on tech policy to create a thriving economy and to demonstrate the economic benefits of the internet. Responsible for representing Google externally to Ministers, MPs, government officials, policymakers, civil society advocates and thought-leaders.  Executive Officer, Law & Policy Adviser Australian Digital Alliance October 2009  –  May 2011  (1 year 8 months) Managed Australia’s peak body representing copyright users and innovators in the digital world. Responsible for lobbying, advocacy, strategy, policy development, and day-to-day operations. \n \nGrew the organisation into a key influencer in the national copyright debate by increasing its media profile via earned media including op-eds, cultivating grassroots support, recruiting new members to drive revenue, and enlisting high profile patrons. \n \nCampaigned to ‘right the copyright imbalance’ by giving users adequate flexibility to innovate with copyright material; for the benefit of technology, culture, and education. Ultimately contributed to government policy on reform, helping to pave the way for a comprehensive law review by the Australian Law Reform Commission across 2012-14. \n \nhttp://digital.org.au/ Graduate, Mergers and Acquisitions Australian Competition and Consumer Commission February 2009  –  October 2009  (9 months) Reviewed complex mergers in gas and electricity markets to determine the impact on competition; helping to shape the strategic direction of several long running and stagnated projects. Legal Assistant Australian Department of Veterans' Affairs November 2007  –  February 2009  (1 year 4 months) Advised on general legal matters; part time while studying. Counsel, Public Policy & Government Affairs Google January 2015  – Present (7 months) Washington D.C. US Federal lead of Google's relationships with trade associations and industry groups; helping them to develop policy, campaign, and liaise with US Congress and the Administration. \n \nWork to ensure Google - and the open internet - have a strong voice in the US policy debate with broad support for our positions. Help Congress and policymakers understand Google’s business and the work we do to keep the internet open, to build great products, and to fuel economic growth around the world. Counsel, Public Policy & Government Affairs Google January 2015  – Present (7 months) Washington D.C. US Federal lead of Google's relationships with trade associations and industry groups; helping them to develop policy, campaign, and liaise with US Congress and the Administration. \n \nWork to ensure Google - and the open internet - have a strong voice in the US policy debate with broad support for our positions. Help Congress and policymakers understand Google’s business and the work we do to keep the internet open, to build great products, and to fuel economic growth around the world. Counsel, Public Policy & Government Affairs Google June 2014  – Present (1 year 2 months) Sydney, Australia Australian lead on tech policy to create a thriving economy and to demonstrate the economic benefits of the internet. Responsible for representing Google externally to Ministers, MPs, government officials, policymakers, civil society advocates and thought-leaders.  \n \nFocused on strategic business issues and engaging with the Federal Government to convey Google’s policy positions and to garner support for policies to promote an open internet.  \n \nSuccessfully positioned the internet as an important economic enabler and shaped the policy debate in Australia through thought leadership and political engagement. One research project, The Startup Economy by PwC in 2013, was launched by Comms Minister Malcolm Turnbull and reported in the Economist, Wall Street Journal and New York Times. Counsel, Public Policy & Government Affairs Google June 2014  – Present (1 year 2 months) Sydney, Australia Australian lead on tech policy to create a thriving economy and to demonstrate the economic benefits of the internet. Responsible for representing Google externally to Ministers, MPs, government officials, policymakers, civil society advocates and thought-leaders.  \n \nFocused on strategic business issues and engaging with the Federal Government to convey Google’s policy positions and to garner support for policies to promote an open internet.  \n \nSuccessfully positioned the internet as an important economic enabler and shaped the policy debate in Australia through thought leadership and political engagement. One research project, The Startup Economy by PwC in 2013, was launched by Comms Minister Malcolm Turnbull and reported in the Economist, Wall Street Journal and New York Times. Senior Analyst, Public Policy & Government Affairs Google December 2012  –  May 2014  (1 year 6 months) Sydney, Australia Australian lead on tech policy to create a thriving economy and to demonstrate the economic benefits of the internet. Responsible for representing Google externally to Ministers, MPs, government officials, policymakers, civil society advocates and thought-leaders.  Senior Analyst, Public Policy & Government Affairs Google December 2012  –  May 2014  (1 year 6 months) Sydney, Australia Australian lead on tech policy to create a thriving economy and to demonstrate the economic benefits of the internet. Responsible for representing Google externally to Ministers, MPs, government officials, policymakers, civil society advocates and thought-leaders.  Analyst, Public Policy & Government Affairs Google May 2011  –  November 2012  (1 year 7 months) Sydney, Australia Australian lead on tech policy to create a thriving economy and to demonstrate the economic benefits of the internet. Responsible for representing Google externally to Ministers, MPs, government officials, policymakers, civil society advocates and thought-leaders.  Analyst, Public Policy & Government Affairs Google May 2011  –  November 2012  (1 year 7 months) Sydney, Australia Australian lead on tech policy to create a thriving economy and to demonstrate the economic benefits of the internet. Responsible for representing Google externally to Ministers, MPs, government officials, policymakers, civil society advocates and thought-leaders.  Executive Officer, Law & Policy Adviser Australian Digital Alliance October 2009  –  May 2011  (1 year 8 months) Managed Australia’s peak body representing copyright users and innovators in the digital world. Responsible for lobbying, advocacy, strategy, policy development, and day-to-day operations. \n \nGrew the organisation into a key influencer in the national copyright debate by increasing its media profile via earned media including op-eds, cultivating grassroots support, recruiting new members to drive revenue, and enlisting high profile patrons. \n \nCampaigned to ‘right the copyright imbalance’ by giving users adequate flexibility to innovate with copyright material; for the benefit of technology, culture, and education. Ultimately contributed to government policy on reform, helping to pave the way for a comprehensive law review by the Australian Law Reform Commission across 2012-14. \n \nhttp://digital.org.au/ Executive Officer, Law & Policy Adviser Australian Digital Alliance October 2009  –  May 2011  (1 year 8 months) Managed Australia’s peak body representing copyright users and innovators in the digital world. Responsible for lobbying, advocacy, strategy, policy development, and day-to-day operations. \n \nGrew the organisation into a key influencer in the national copyright debate by increasing its media profile via earned media including op-eds, cultivating grassroots support, recruiting new members to drive revenue, and enlisting high profile patrons. \n \nCampaigned to ‘right the copyright imbalance’ by giving users adequate flexibility to innovate with copyright material; for the benefit of technology, culture, and education. Ultimately contributed to government policy on reform, helping to pave the way for a comprehensive law review by the Australian Law Reform Commission across 2012-14. \n \nhttp://digital.org.au/ Graduate, Mergers and Acquisitions Australian Competition and Consumer Commission February 2009  –  October 2009  (9 months) Reviewed complex mergers in gas and electricity markets to determine the impact on competition; helping to shape the strategic direction of several long running and stagnated projects. Graduate, Mergers and Acquisitions Australian Competition and Consumer Commission February 2009  –  October 2009  (9 months) Reviewed complex mergers in gas and electricity markets to determine the impact on competition; helping to shape the strategic direction of several long running and stagnated projects. Legal Assistant Australian Department of Veterans' Affairs November 2007  –  February 2009  (1 year 4 months) Advised on general legal matters; part time while studying. Legal Assistant Australian Department of Veterans' Affairs November 2007  –  February 2009  (1 year 4 months) Advised on general legal matters; part time while studying. Skills Skills     Education The Australian National University Bachelor of Laws with Honors 2004  – 2008 The Australian National University Bachelor of Finance,  major in Corporate Finance and Investment Management 2004  – 2008 The Australian National University Graduate Diploma in Legal Practice 2009  – 2009 The Australian National University Bachelor of Laws with Honors 2004  – 2008 The Australian National University Bachelor of Laws with Honors 2004  – 2008 The Australian National University Bachelor of Laws with Honors 2004  – 2008 The Australian National University Bachelor of Finance,  major in Corporate Finance and Investment Management 2004  – 2008 The Australian National University Bachelor of Finance,  major in Corporate Finance and Investment Management 2004  – 2008 The Australian National University Bachelor of Finance,  major in Corporate Finance and Investment Management 2004  – 2008 The Australian National University Graduate Diploma in Legal Practice 2009  – 2009 The Australian National University Graduate Diploma in Legal Practice 2009  – 2009 The Australian National University Graduate Diploma in Legal Practice 2009  – 2009 ", "Experience Legal Assistant Google February 2014  – Present (1 year 6 months) Legal Assistant Warner Bros. Entertainment Group of Companies March 2013  –  February 2014  (1 year) Legal Assistant Google April 2012  –  March 2013  (1 year) London, United Kingdom Legal Assistant Ministry of Sound October 2011  –  April 2012  (7 months) Internship PRS for Music September 2011  –  September 2011  (1 month) Legal Internship Ministry of Sound June 2011  –  September 2011  (4 months) Legal Internship New Media Law March 2011  –  March 2011  (1 month) London, United Kingdom Legal Assistant Google February 2014  – Present (1 year 6 months) Legal Assistant Google February 2014  – Present (1 year 6 months) Legal Assistant Warner Bros. Entertainment Group of Companies March 2013  –  February 2014  (1 year) Legal Assistant Warner Bros. Entertainment Group of Companies March 2013  –  February 2014  (1 year) Legal Assistant Google April 2012  –  March 2013  (1 year) London, United Kingdom Legal Assistant Google April 2012  –  March 2013  (1 year) London, United Kingdom Legal Assistant Ministry of Sound October 2011  –  April 2012  (7 months) Legal Assistant Ministry of Sound October 2011  –  April 2012  (7 months) Internship PRS for Music September 2011  –  September 2011  (1 month) Internship PRS for Music September 2011  –  September 2011  (1 month) Legal Internship Ministry of Sound June 2011  –  September 2011  (4 months) Legal Internship Ministry of Sound June 2011  –  September 2011  (4 months) Legal Internship New Media Law March 2011  –  March 2011  (1 month) London, United Kingdom Legal Internship New Media Law March 2011  –  March 2011  (1 month) London, United Kingdom Skills Skills     Education BPP Law School Legal Practice Course,  Law 2010  – 2011 Kings College London Master of Laws (LL.M.),  Intellectual Property Law 2009  – 2010 The University of Manchester Bachelor of Laws (LLB),  Law 2006  – 2009 BPP Law School Legal Practice Course,  Law 2010  – 2011 BPP Law School Legal Practice Course,  Law 2010  – 2011 BPP Law School Legal Practice Course,  Law 2010  – 2011 Kings College London Master of Laws (LL.M.),  Intellectual Property Law 2009  – 2010 Kings College London Master of Laws (LL.M.),  Intellectual Property Law 2009  – 2010 Kings College London Master of Laws (LL.M.),  Intellectual Property Law 2009  – 2010 The University of Manchester Bachelor of Laws (LLB),  Law 2006  – 2009 The University of Manchester Bachelor of Laws (LLB),  Law 2006  – 2009 The University of Manchester Bachelor of Laws (LLB),  Law 2006  – 2009 ", "Experience Account Executive Google March 2014  – Present (1 year 5 months) San Francisco Bay Area Senior Account Manager Google June 2013  –  March 2014  (10 months) San Francisco Bay Area Industry Manager - Nordic Branding Google August 2013  –  October 2013  (3 months) Oslo Area, Norway Account Manager Google June 2011  –  May 2013  (2 years) San Francisco Bay Area Account Coordinator Google February 2010  –  June 2011  (1 year 5 months) Legal Assistant Google 2008  –  March 2010  (2 years) Account Executive Google March 2014  – Present (1 year 5 months) San Francisco Bay Area Account Executive Google March 2014  – Present (1 year 5 months) San Francisco Bay Area Senior Account Manager Google June 2013  –  March 2014  (10 months) San Francisco Bay Area Senior Account Manager Google June 2013  –  March 2014  (10 months) San Francisco Bay Area Industry Manager - Nordic Branding Google August 2013  –  October 2013  (3 months) Oslo Area, Norway Industry Manager - Nordic Branding Google August 2013  –  October 2013  (3 months) Oslo Area, Norway Account Manager Google June 2011  –  May 2013  (2 years) San Francisco Bay Area Account Manager Google June 2011  –  May 2013  (2 years) San Francisco Bay Area Account Coordinator Google February 2010  –  June 2011  (1 year 5 months) Account Coordinator Google February 2010  –  June 2011  (1 year 5 months) Legal Assistant Google 2008  –  March 2010  (2 years) Legal Assistant Google 2008  –  March 2010  (2 years) Skills Top Skills 14 Online Advertising 11 SEM 10 Online Marketing 9 Digital Strategy 8 Account Management 7 Social Media 6 Digital Marketing 6 Google Adwords 5 Mobile Marketing 4 PPC Adrian also knows about... 3 Advertising Sales 3 Social Media Marketing 2 Sales 2 Marketing 1 Mobile 1 Digital Video 1 Direct Sales 1 Strategic Sales 1 Marketing Strategy 1 Mobile Devices 1 Mobile Advertising 1 Digital Media 1 Search Advertising 0 US Hispanic Market 0 Hispanic Market 0 Hispanic 0 Music Production See 2+     See less Skills  Top Skills 14 Online Advertising 11 SEM 10 Online Marketing 9 Digital Strategy 8 Account Management 7 Social Media 6 Digital Marketing 6 Google Adwords 5 Mobile Marketing 4 PPC Adrian also knows about... 3 Advertising Sales 3 Social Media Marketing 2 Sales 2 Marketing 1 Mobile 1 Digital Video 1 Direct Sales 1 Strategic Sales 1 Marketing Strategy 1 Mobile Devices 1 Mobile Advertising 1 Digital Media 1 Search Advertising 0 US Hispanic Market 0 Hispanic Market 0 Hispanic 0 Music Production See 2+     See less Top Skills 14 Online Advertising 11 SEM 10 Online Marketing 9 Digital Strategy 8 Account Management 7 Social Media 6 Digital Marketing 6 Google Adwords 5 Mobile Marketing 4 PPC Adrian also knows about... 3 Advertising Sales 3 Social Media Marketing 2 Sales 2 Marketing 1 Mobile 1 Digital Video 1 Direct Sales 1 Strategic Sales 1 Marketing Strategy 1 Mobile Devices 1 Mobile Advertising 1 Digital Media 1 Search Advertising 0 US Hispanic Market 0 Hispanic Market 0 Hispanic 0 Music Production See 2+     See less Top Skills 14 Online Advertising 11 SEM 10 Online Marketing 9 Digital Strategy 8 Account Management 7 Social Media 6 Digital Marketing 6 Google Adwords 5 Mobile Marketing 4 PPC Adrian also knows about... 3 Advertising Sales 3 Social Media Marketing 2 Sales 2 Marketing 1 Mobile 1 Digital Video 1 Direct Sales 1 Strategic Sales 1 Marketing Strategy 1 Mobile Devices 1 Mobile Advertising 1 Digital Media 1 Search Advertising 0 US Hispanic Market 0 Hispanic Market 0 Hispanic 0 Music Production See 2+     See less                     3 Advertising Sales 3 Social Media Marketing 2 Sales 2 Marketing 1 Mobile 1 Digital Video 1 Direct Sales 1 Strategic Sales 1 Marketing Strategy 1 Mobile Devices 1 Mobile Advertising 1 Digital Media 1 Search Advertising 0 US Hispanic Market 0 Hispanic Market 0 Hispanic 0 Music Production Education University of California, Davis B.A.,  International Relations ,  Spanish 2004  – 2008 University of Barcelona Bachelor of Arts (B.A.),  Spanish Language and Literature 2006  – 2007 University of California, Davis B.A.,  International Relations ,  Spanish 2004  – 2008 University of California, Davis B.A.,  International Relations ,  Spanish 2004  – 2008 University of California, Davis B.A.,  International Relations ,  Spanish 2004  – 2008 University of Barcelona Bachelor of Arts (B.A.),  Spanish Language and Literature 2006  – 2007 University of Barcelona Bachelor of Arts (B.A.),  Spanish Language and Literature 2006  – 2007 University of Barcelona Bachelor of Arts (B.A.),  Spanish Language and Literature 2006  – 2007 ", "Summary I work on an operations team in the legal department at Google. Here are some things that I'm involved in: \n \nhttp://www.google.com/transparencyreport/removals/copyright/ \n \nhttp://support.google.com/legal Summary I work on an operations team in the legal department at Google. Here are some things that I'm involved in: \n \nhttp://www.google.com/transparencyreport/removals/copyright/ \n \nhttp://support.google.com/legal I work on an operations team in the legal department at Google. Here are some things that I'm involved in: \n \nhttp://www.google.com/transparencyreport/removals/copyright/ \n \nhttp://support.google.com/legal I work on an operations team in the legal department at Google. Here are some things that I'm involved in: \n \nhttp://www.google.com/transparencyreport/removals/copyright/ \n \nhttp://support.google.com/legal Experience Team Lead, Legal Specialist - Legal Removals Google Inc. November 2013  – Present (1 year 9 months) Mountain View, CA - Manage and coach a team of 8 in content removal operations \n- Scale content removal operations, dealing with increasing volume and flat headcount \n- Set team- and org-wide strategic goals \n- Project-manage high-impact automation initiatives, working with product teams and Legal Legal Analyst - Legal Removals Google Inc. May 2012  –  November 2013  (1 year 7 months) Mountain View, CA - Helped launch high-level projects such as Google's Copyright Transparency Report \n- Trained new employees on policies and processes \n- Launched content review operations in India \n- Continued areas outlined under Legal Assistant Legal Assistant - Legal Removals Google Inc. June 2010  –  May 2012  (2 years) Mountain View, CA - Provided legal support for incoming content removal requests (copyright, defamation, court orders, and child safety) on a large portfolio of Google products (e.g., Search, Blogger, Google+). \n- Drove high-impact organizational goals such as designing and building tools to increase automation and efficiency (e.g., project-managed the creation of content removal tools for high-volume users to submit DMCA notices, resulting in improved operational efficiency, better user experience, and reducing turnaround time from weeks to hours). \n- Led as primary contact for several external partners, providing front-line support for our tools.  \n- Served as primary legal support lead for Google Web Search: communicated legal removals policies to various stakeholders, implemented best practices across the team, drove workflow improvements, and handled sensitive legal escalations. \n- Consulted with litigation, product, and regional counsel on content removal escalations. \n- Trained and mentored new hires across multiple regions on legal support tools and processes. \n- Collaborated across multiple areas including legal, engineering, product, policy, and consumer operations to build legal support infrastructure for the launch of several new Google products. Team Lead, Legal Specialist - Legal Removals Google Inc. November 2013  – Present (1 year 9 months) Mountain View, CA - Manage and coach a team of 8 in content removal operations \n- Scale content removal operations, dealing with increasing volume and flat headcount \n- Set team- and org-wide strategic goals \n- Project-manage high-impact automation initiatives, working with product teams and Legal Team Lead, Legal Specialist - Legal Removals Google Inc. November 2013  – Present (1 year 9 months) Mountain View, CA - Manage and coach a team of 8 in content removal operations \n- Scale content removal operations, dealing with increasing volume and flat headcount \n- Set team- and org-wide strategic goals \n- Project-manage high-impact automation initiatives, working with product teams and Legal Legal Analyst - Legal Removals Google Inc. May 2012  –  November 2013  (1 year 7 months) Mountain View, CA - Helped launch high-level projects such as Google's Copyright Transparency Report \n- Trained new employees on policies and processes \n- Launched content review operations in India \n- Continued areas outlined under Legal Assistant Legal Analyst - Legal Removals Google Inc. May 2012  –  November 2013  (1 year 7 months) Mountain View, CA - Helped launch high-level projects such as Google's Copyright Transparency Report \n- Trained new employees on policies and processes \n- Launched content review operations in India \n- Continued areas outlined under Legal Assistant Legal Assistant - Legal Removals Google Inc. June 2010  –  May 2012  (2 years) Mountain View, CA - Provided legal support for incoming content removal requests (copyright, defamation, court orders, and child safety) on a large portfolio of Google products (e.g., Search, Blogger, Google+). \n- Drove high-impact organizational goals such as designing and building tools to increase automation and efficiency (e.g., project-managed the creation of content removal tools for high-volume users to submit DMCA notices, resulting in improved operational efficiency, better user experience, and reducing turnaround time from weeks to hours). \n- Led as primary contact for several external partners, providing front-line support for our tools.  \n- Served as primary legal support lead for Google Web Search: communicated legal removals policies to various stakeholders, implemented best practices across the team, drove workflow improvements, and handled sensitive legal escalations. \n- Consulted with litigation, product, and regional counsel on content removal escalations. \n- Trained and mentored new hires across multiple regions on legal support tools and processes. \n- Collaborated across multiple areas including legal, engineering, product, policy, and consumer operations to build legal support infrastructure for the launch of several new Google products. Legal Assistant - Legal Removals Google Inc. June 2010  –  May 2012  (2 years) Mountain View, CA - Provided legal support for incoming content removal requests (copyright, defamation, court orders, and child safety) on a large portfolio of Google products (e.g., Search, Blogger, Google+). \n- Drove high-impact organizational goals such as designing and building tools to increase automation and efficiency (e.g., project-managed the creation of content removal tools for high-volume users to submit DMCA notices, resulting in improved operational efficiency, better user experience, and reducing turnaround time from weeks to hours). \n- Led as primary contact for several external partners, providing front-line support for our tools.  \n- Served as primary legal support lead for Google Web Search: communicated legal removals policies to various stakeholders, implemented best practices across the team, drove workflow improvements, and handled sensitive legal escalations. \n- Consulted with litigation, product, and regional counsel on content removal escalations. \n- Trained and mentored new hires across multiple regions on legal support tools and processes. \n- Collaborated across multiple areas including legal, engineering, product, policy, and consumer operations to build legal support infrastructure for the launch of several new Google products. Skills Top Skills 16 Copyright Law 11 Legal Assistance 9 Policy 8 Project Management 7 Intellectual Property 6 Leadership 5 Legal Research 4 Training 4 Privacy Law 3 Teaching Steven also knows about... 3 Team Leadership 3 Policy Analysis 2 Copyright Skills  Top Skills 16 Copyright Law 11 Legal Assistance 9 Policy 8 Project Management 7 Intellectual Property 6 Leadership 5 Legal Research 4 Training 4 Privacy Law 3 Teaching Steven also knows about... 3 Team Leadership 3 Policy Analysis 2 Copyright Top Skills 16 Copyright Law 11 Legal Assistance 9 Policy 8 Project Management 7 Intellectual Property 6 Leadership 5 Legal Research 4 Training 4 Privacy Law 3 Teaching Steven also knows about... 3 Team Leadership 3 Policy Analysis 2 Copyright Top Skills 16 Copyright Law 11 Legal Assistance 9 Policy 8 Project Management 7 Intellectual Property 6 Leadership 5 Legal Research 4 Training 4 Privacy Law 3 Teaching Steven also knows about... 3 Team Leadership 3 Policy Analysis 2 Copyright                     3 Team Leadership 3 Policy Analysis 2 Copyright Education University of California, Berkeley B.A.,  History of Art 2008  – 2010 Activities and Societies:  History of Art Undergraduate Society ,  Research Assistant University of California, Berkeley B.A.,  History of Art 2008  – 2010 Activities and Societies:  History of Art Undergraduate Society ,  Research Assistant University of California, Berkeley B.A.,  History of Art 2008  – 2010 Activities and Societies:  History of Art Undergraduate Society ,  Research Assistant University of California, Berkeley B.A.,  History of Art 2008  – 2010 Activities and Societies:  History of Art Undergraduate Society ,  Research Assistant ", "Experience Team Lead Google July 2014  – Present (1 year 1 month) Mountain View Manage a team of legal assistants in Mountain View, Dublin, Sao Paulo and Singapore. Team Lead - Online Product Legal Support Google November 2012  –  July 2014  (1 year 9 months) Dublin, Ireland - Build and manage a growing team of legal assistants in Dublin. Personally interviewed, hired and trained every member in the team.  \n- Provide legal support for incoming content removal requests for a large portfolio of Google products. \n- Drive consistency in product support across regions. \n- Work closely with litigation in relation to escalations and on-going cases. \n- Lead support for Image Search: driveworkflows improvements, tool improvement and automation.  \n- Fight for freedom of speech. Legal Assistant Google June 2011  –  November 2012  (1 year 6 months) Dublin, Ireland Legal Assistant Google July 2010  –  June 2011  (1 year) Mountain View, California - Create and implement a training program for new hires. \n- Lead support for Latin America (with the exception of Brazil), Spain and Italy. \n- Lead support for Google WiFi, Google Video and Image Search. Assistant Lecturer of Spanish University of Southern California August 2008  –  May 2010  (1 year 10 months) Plan, organize and teach different levels of Spanish, applying the Communicative Approach. \nDevelop testing material. Spanish & English instructor A&A International Language Center Srl February 2008  –  August 2008  (7 months) Rome Area, Italy - Lead individual and group conversation classes in Spanish and English. \n- Prepare high school students and adults for language proficiency exams (IELTS, TOEFL, DELE). Team Lead Google July 2014  – Present (1 year 1 month) Mountain View Manage a team of legal assistants in Mountain View, Dublin, Sao Paulo and Singapore. Team Lead Google July 2014  – Present (1 year 1 month) Mountain View Manage a team of legal assistants in Mountain View, Dublin, Sao Paulo and Singapore. Team Lead - Online Product Legal Support Google November 2012  –  July 2014  (1 year 9 months) Dublin, Ireland - Build and manage a growing team of legal assistants in Dublin. Personally interviewed, hired and trained every member in the team.  \n- Provide legal support for incoming content removal requests for a large portfolio of Google products. \n- Drive consistency in product support across regions. \n- Work closely with litigation in relation to escalations and on-going cases. \n- Lead support for Image Search: driveworkflows improvements, tool improvement and automation.  \n- Fight for freedom of speech. Team Lead - Online Product Legal Support Google November 2012  –  July 2014  (1 year 9 months) Dublin, Ireland - Build and manage a growing team of legal assistants in Dublin. Personally interviewed, hired and trained every member in the team.  \n- Provide legal support for incoming content removal requests for a large portfolio of Google products. \n- Drive consistency in product support across regions. \n- Work closely with litigation in relation to escalations and on-going cases. \n- Lead support for Image Search: driveworkflows improvements, tool improvement and automation.  \n- Fight for freedom of speech. Legal Assistant Google June 2011  –  November 2012  (1 year 6 months) Dublin, Ireland Legal Assistant Google June 2011  –  November 2012  (1 year 6 months) Dublin, Ireland Legal Assistant Google July 2010  –  June 2011  (1 year) Mountain View, California - Create and implement a training program for new hires. \n- Lead support for Latin America (with the exception of Brazil), Spain and Italy. \n- Lead support for Google WiFi, Google Video and Image Search. Legal Assistant Google July 2010  –  June 2011  (1 year) Mountain View, California - Create and implement a training program for new hires. \n- Lead support for Latin America (with the exception of Brazil), Spain and Italy. \n- Lead support for Google WiFi, Google Video and Image Search. Assistant Lecturer of Spanish University of Southern California August 2008  –  May 2010  (1 year 10 months) Plan, organize and teach different levels of Spanish, applying the Communicative Approach. \nDevelop testing material. Assistant Lecturer of Spanish University of Southern California August 2008  –  May 2010  (1 year 10 months) Plan, organize and teach different levels of Spanish, applying the Communicative Approach. \nDevelop testing material. Spanish & English instructor A&A International Language Center Srl February 2008  –  August 2008  (7 months) Rome Area, Italy - Lead individual and group conversation classes in Spanish and English. \n- Prepare high school students and adults for language proficiency exams (IELTS, TOEFL, DELE). Spanish & English instructor A&A International Language Center Srl February 2008  –  August 2008  (7 months) Rome Area, Italy - Lead individual and group conversation classes in Spanish and English. \n- Prepare high school students and adults for language proficiency exams (IELTS, TOEFL, DELE). Languages Spanish Native or bilingual proficiency Italian Professional working proficiency Spanish Native or bilingual proficiency Italian Professional working proficiency Spanish Native or bilingual proficiency Italian Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Skills     Education University of Southern California MA,  Linguistics 2008  – 2010 Florida Atlantic University BA,  Linguistics 2003  – 2007 Florida Atlantic University BA,  Italian Language and Linguistics 2003  – 2007 University of Southern California MA,  Linguistics 2008  – 2010 University of Southern California MA,  Linguistics 2008  – 2010 University of Southern California MA,  Linguistics 2008  – 2010 Florida Atlantic University BA,  Linguistics 2003  – 2007 Florida Atlantic University BA,  Linguistics 2003  – 2007 Florida Atlantic University BA,  Linguistics 2003  – 2007 Florida Atlantic University BA,  Italian Language and Linguistics 2003  – 2007 Florida Atlantic University BA,  Italian Language and Linguistics 2003  – 2007 Florida Atlantic University BA,  Italian Language and Linguistics 2003  – 2007 Honors & Awards ", "Experience Legal Assistant II, Patent Strategy Google June 2013  – Present (2 years 2 months) Mountain View, CA Patent Team Operations and Analytics: company and team-wide communications; patent incentives & recognition; product area support (Nest & Advanced projects); CBM & IPR patent review; tools & resources (Google Apps, Adobe EchoSign, Microsoft Suite, Lecorpio, DocketNavigator, RPX, etc). Legal Assistant, Patent Strategy Google July 2011  – Present (4 years 1 month) Mountain View, CA Legal Assistant Adecco & Workforce Logic (onsite at Google, Inc.) June 2010  –  July 2011  (1 year 2 months) Graduate Assistant University of Nevada, Las Vegas August 2008  –  May 2010  (1 year 10 months) Assisted History Department faculty with teaching and evaluating undergraduate lecture courses (80-250 students per semester) in early modern and modern U.S. and European history. (Open) 1 recommendation Colin FitzGerald Ph.D. Student at Lehigh University Chris is a very personable and diligent individual. His detailed feedback on papers and exams permits the undergraduate students to respond accordingly. UNLV is grateful to have him as a Graduate Assistant. View Day Camp Counselor Hidden Villa, Los Altos Hills June 2008  –  August 2008  (3 months) MIS Manager Green Earth Foods June 2007  –  August 2008  (1 year 3 months) Managed retail pricing, systems, and file maintenance. Oversaw the installation of retail technologies including phone systems, price registers/scanners, digital scales, and computers. Supervised up to 40 employees in five departments. Organized and updated retail pricing information. Journeyman Clerk & Point-of-Sales Assistant Cosentinos Market October 2001  –  May 2007  (5 years 8 months) Legal Assistant II, Patent Strategy Google June 2013  – Present (2 years 2 months) Mountain View, CA Patent Team Operations and Analytics: company and team-wide communications; patent incentives & recognition; product area support (Nest & Advanced projects); CBM & IPR patent review; tools & resources (Google Apps, Adobe EchoSign, Microsoft Suite, Lecorpio, DocketNavigator, RPX, etc). Legal Assistant II, Patent Strategy Google June 2013  – Present (2 years 2 months) Mountain View, CA Patent Team Operations and Analytics: company and team-wide communications; patent incentives & recognition; product area support (Nest & Advanced projects); CBM & IPR patent review; tools & resources (Google Apps, Adobe EchoSign, Microsoft Suite, Lecorpio, DocketNavigator, RPX, etc). Legal Assistant, Patent Strategy Google July 2011  – Present (4 years 1 month) Mountain View, CA Legal Assistant, Patent Strategy Google July 2011  – Present (4 years 1 month) Mountain View, CA Legal Assistant Adecco & Workforce Logic (onsite at Google, Inc.) June 2010  –  July 2011  (1 year 2 months) Legal Assistant Adecco & Workforce Logic (onsite at Google, Inc.) June 2010  –  July 2011  (1 year 2 months) Graduate Assistant University of Nevada, Las Vegas August 2008  –  May 2010  (1 year 10 months) Assisted History Department faculty with teaching and evaluating undergraduate lecture courses (80-250 students per semester) in early modern and modern U.S. and European history. (Open) 1 recommendation Colin FitzGerald Ph.D. Student at Lehigh University Chris is a very personable and diligent individual. His detailed feedback on papers and exams permits the undergraduate students to respond accordingly. UNLV is grateful to have him as a Graduate Assistant. View Graduate Assistant University of Nevada, Las Vegas August 2008  –  May 2010  (1 year 10 months) Assisted History Department faculty with teaching and evaluating undergraduate lecture courses (80-250 students per semester) in early modern and modern U.S. and European history. (Open) 1 recommendation Colin FitzGerald Ph.D. Student at Lehigh University Chris is a very personable and diligent individual. His detailed feedback on papers and exams permits the undergraduate students to respond accordingly. UNLV is grateful to have him as a Graduate Assistant. View Day Camp Counselor Hidden Villa, Los Altos Hills June 2008  –  August 2008  (3 months) Day Camp Counselor Hidden Villa, Los Altos Hills June 2008  –  August 2008  (3 months) MIS Manager Green Earth Foods June 2007  –  August 2008  (1 year 3 months) Managed retail pricing, systems, and file maintenance. Oversaw the installation of retail technologies including phone systems, price registers/scanners, digital scales, and computers. Supervised up to 40 employees in five departments. Organized and updated retail pricing information. MIS Manager Green Earth Foods June 2007  –  August 2008  (1 year 3 months) Managed retail pricing, systems, and file maintenance. Oversaw the installation of retail technologies including phone systems, price registers/scanners, digital scales, and computers. Supervised up to 40 employees in five departments. Organized and updated retail pricing information. Journeyman Clerk & Point-of-Sales Assistant Cosentinos Market October 2001  –  May 2007  (5 years 8 months) Journeyman Clerk & Point-of-Sales Assistant Cosentinos Market October 2001  –  May 2007  (5 years 8 months) Skills Top Skills 8 Research 6 Social Media 6 Public Speaking 5 Microsoft Office 5 Teaching 4 Customer Service 2 Event Planning 2 Editing 2 Data Analysis 1 HTML Christopher also knows about... 1 PowerPoint 1 Blogging 1 Facebook 1 Social Networking 1 Community Outreach Skills  Top Skills 8 Research 6 Social Media 6 Public Speaking 5 Microsoft Office 5 Teaching 4 Customer Service 2 Event Planning 2 Editing 2 Data Analysis 1 HTML Christopher also knows about... 1 PowerPoint 1 Blogging 1 Facebook 1 Social Networking 1 Community Outreach Top Skills 8 Research 6 Social Media 6 Public Speaking 5 Microsoft Office 5 Teaching 4 Customer Service 2 Event Planning 2 Editing 2 Data Analysis 1 HTML Christopher also knows about... 1 PowerPoint 1 Blogging 1 Facebook 1 Social Networking 1 Community Outreach Top Skills 8 Research 6 Social Media 6 Public Speaking 5 Microsoft Office 5 Teaching 4 Customer Service 2 Event Planning 2 Editing 2 Data Analysis 1 HTML Christopher also knows about... 1 PowerPoint 1 Blogging 1 Facebook 1 Social Networking 1 Community Outreach                     1 PowerPoint 1 Blogging 1 Facebook 1 Social Networking 1 Community Outreach Education University of Nevada-Las Vegas M.A.,  History 2008  – 2010 Activities and Societies:  History Graduate Assistant University of California, Berkeley B.A. (w/Honors),  History 2004  – 2006 De Anza College IGETC Certification,  General Education 2001  – 2004 University of Nevada-Las Vegas M.A.,  History 2008  – 2010 Activities and Societies:  History Graduate Assistant University of Nevada-Las Vegas M.A.,  History 2008  – 2010 Activities and Societies:  History Graduate Assistant University of Nevada-Las Vegas M.A.,  History 2008  – 2010 Activities and Societies:  History Graduate Assistant University of California, Berkeley B.A. (w/Honors),  History 2004  – 2006 University of California, Berkeley B.A. (w/Honors),  History 2004  – 2006 University of California, Berkeley B.A. (w/Honors),  History 2004  – 2006 De Anza College IGETC Certification,  General Education 2001  – 2004 De Anza College IGETC Certification,  General Education 2001  – 2004 De Anza College IGETC Certification,  General Education 2001  – 2004 Honors & Awards Additional Honors & Awards Honors in History - University of California, Berkeley. Additional Honors & Awards Honors in History - University of California, Berkeley. Additional Honors & Awards Honors in History - University of California, Berkeley. Additional Honors & Awards Honors in History - University of California, Berkeley. ", "Experience Legal Assistant, Team Lead Vaco at Google December 2014  – Present (8 months) Mountain View, California Legal Assistant Adecco at Google May 2014  –  December 2014  (8 months) Analyst Gold and Hammes, Attorneys at Law May 2013  –  May 2014  (1 year 1 month) san jose, ca Compiling data and composing reports regarding various aspects of client interactions, including the geographic and monetary distributions of mortgages that have been modified using the Federal HAMP Loan Modification system and other proprietary loan modification mechanisms. Web Editor Journal of Political Inquiry, New York University February 2013  –  May 2013  (4 months) Updated and maintained the official journal website using WordPress. Associate Editor Journal of Political Inquiry, New York University October 2012  –  May 2013  (8 months) Evaluated journal submissions for publication and made recommendations to publish or reject. Edited submissions for content and mechanics in collaboration with submitters. IT Specialist Gold and Hammes, Attorneys at Law January 2008  –  August 2010  (2 years 8 months) Set up and maintained a network, wired and wireless, of more than twenty Windows workstations and mobile devices using both Android and Apple iOS. Established an automated remote periodic backup system. \n \nWrote scripts in a proprietary language for the purpose of generating documents using data pulled from an in-house database of clients. Some of these documents were filed in Federal Bankruptcy Court while others were purely for internal use. Legal Assistant, Team Lead Vaco at Google December 2014  – Present (8 months) Mountain View, California Legal Assistant, Team Lead Vaco at Google December 2014  – Present (8 months) Mountain View, California Legal Assistant Adecco at Google May 2014  –  December 2014  (8 months) Legal Assistant Adecco at Google May 2014  –  December 2014  (8 months) Analyst Gold and Hammes, Attorneys at Law May 2013  –  May 2014  (1 year 1 month) san jose, ca Compiling data and composing reports regarding various aspects of client interactions, including the geographic and monetary distributions of mortgages that have been modified using the Federal HAMP Loan Modification system and other proprietary loan modification mechanisms. Analyst Gold and Hammes, Attorneys at Law May 2013  –  May 2014  (1 year 1 month) san jose, ca Compiling data and composing reports regarding various aspects of client interactions, including the geographic and monetary distributions of mortgages that have been modified using the Federal HAMP Loan Modification system and other proprietary loan modification mechanisms. Web Editor Journal of Political Inquiry, New York University February 2013  –  May 2013  (4 months) Updated and maintained the official journal website using WordPress. Web Editor Journal of Political Inquiry, New York University February 2013  –  May 2013  (4 months) Updated and maintained the official journal website using WordPress. Associate Editor Journal of Political Inquiry, New York University October 2012  –  May 2013  (8 months) Evaluated journal submissions for publication and made recommendations to publish or reject. Edited submissions for content and mechanics in collaboration with submitters. Associate Editor Journal of Political Inquiry, New York University October 2012  –  May 2013  (8 months) Evaluated journal submissions for publication and made recommendations to publish or reject. Edited submissions for content and mechanics in collaboration with submitters. IT Specialist Gold and Hammes, Attorneys at Law January 2008  –  August 2010  (2 years 8 months) Set up and maintained a network, wired and wireless, of more than twenty Windows workstations and mobile devices using both Android and Apple iOS. Established an automated remote periodic backup system. \n \nWrote scripts in a proprietary language for the purpose of generating documents using data pulled from an in-house database of clients. Some of these documents were filed in Federal Bankruptcy Court while others were purely for internal use. IT Specialist Gold and Hammes, Attorneys at Law January 2008  –  August 2010  (2 years 8 months) Set up and maintained a network, wired and wireless, of more than twenty Windows workstations and mobile devices using both Android and Apple iOS. Established an automated remote periodic backup system. \n \nWrote scripts in a proprietary language for the purpose of generating documents using data pulled from an in-house database of clients. Some of these documents were filed in Federal Bankruptcy Court while others were purely for internal use. Skills Top Skills 29 Research 24 Politics 23 Policy Analysis 15 Data Analysis 15 International Relations 14 Political Theory 10 Teaching 10 Social Media 10 Qualitative Research 9 Public Speaking James also knows about... 8 Political Science 6 Microsoft Office 6 Public Policy 5 Political Philosophy 5 WordPress 4 Windows 4 Ethics 4 Ethical Analysis 3 Nonprofits 1 Editing Skills  Top Skills 29 Research 24 Politics 23 Policy Analysis 15 Data Analysis 15 International Relations 14 Political Theory 10 Teaching 10 Social Media 10 Qualitative Research 9 Public Speaking James also knows about... 8 Political Science 6 Microsoft Office 6 Public Policy 5 Political Philosophy 5 WordPress 4 Windows 4 Ethics 4 Ethical Analysis 3 Nonprofits 1 Editing Top Skills 29 Research 24 Politics 23 Policy Analysis 15 Data Analysis 15 International Relations 14 Political Theory 10 Teaching 10 Social Media 10 Qualitative Research 9 Public Speaking James also knows about... 8 Political Science 6 Microsoft Office 6 Public Policy 5 Political Philosophy 5 WordPress 4 Windows 4 Ethics 4 Ethical Analysis 3 Nonprofits 1 Editing Top Skills 29 Research 24 Politics 23 Policy Analysis 15 Data Analysis 15 International Relations 14 Political Theory 10 Teaching 10 Social Media 10 Qualitative Research 9 Public Speaking James also knows about... 8 Political Science 6 Microsoft Office 6 Public Policy 5 Political Philosophy 5 WordPress 4 Windows 4 Ethics 4 Ethical Analysis 3 Nonprofits 1 Editing                     8 Political Science 6 Microsoft Office 6 Public Policy 5 Political Philosophy 5 WordPress 4 Windows 4 Ethics 4 Ethical Analysis 3 Nonprofits 1 Editing Education New York University Master of Arts (MA),  Political Science and Government 2011  – 2013 Activities and Societies:  International Relations Association San Jose State University BA,  Political Science 2003  – 2010 Activities and Societies:  Pi Sigma Alpha: Epsilon Iota Honor Society ,  Ethics Bowl Team New York University Master of Arts (MA),  Political Science and Government 2011  – 2013 Activities and Societies:  International Relations Association New York University Master of Arts (MA),  Political Science and Government 2011  – 2013 Activities and Societies:  International Relations Association New York University Master of Arts (MA),  Political Science and Government 2011  – 2013 Activities and Societies:  International Relations Association San Jose State University BA,  Political Science 2003  – 2010 Activities and Societies:  Pi Sigma Alpha: Epsilon Iota Honor Society ,  Ethics Bowl Team San Jose State University BA,  Political Science 2003  – 2010 Activities and Societies:  Pi Sigma Alpha: Epsilon Iota Honor Society ,  Ethics Bowl Team San Jose State University BA,  Political Science 2003  – 2010 Activities and Societies:  Pi Sigma Alpha: Epsilon Iota Honor Society ,  Ethics Bowl Team "]}