{"position": "M&A Integration", "company": "IBM", "profiles": ["Summary Current role: Leading the Technical Support and Customer Care end-to-end integration efforts for IBM's recent Silverpop, Explorys and Phytel acquisitions. \n \nSpecialties: Corporate M&A // Support and Service Strategy, Offerings and Management // Corporate IT Management // Project Management // Technical Writing Summary Current role: Leading the Technical Support and Customer Care end-to-end integration efforts for IBM's recent Silverpop, Explorys and Phytel acquisitions. \n \nSpecialties: Corporate M&A // Support and Service Strategy, Offerings and Management // Corporate IT Management // Project Management // Technical Writing Current role: Leading the Technical Support and Customer Care end-to-end integration efforts for IBM's recent Silverpop, Explorys and Phytel acquisitions. \n \nSpecialties: Corporate M&A // Support and Service Strategy, Offerings and Management // Corporate IT Management // Project Management // Technical Writing Current role: Leading the Technical Support and Customer Care end-to-end integration efforts for IBM's recent Silverpop, Explorys and Phytel acquisitions. \n \nSpecialties: Corporate M&A // Support and Service Strategy, Offerings and Management // Corporate IT Management // Project Management // Technical Writing Skills Integration Mergers & Acquisitions IT Strategy Cloud Computing Project Planning Program Management Service Management Call Center Architecture Change Management Software Documentation PMP Leadership Offerings Strategic Planning Management Analysis Knowledge Management SaaS ITIL Service Strategy Enterprise Software Project Management See 6+     See less Skills  Integration Mergers & Acquisitions IT Strategy Cloud Computing Project Planning Program Management Service Management Call Center Architecture Change Management Software Documentation PMP Leadership Offerings Strategic Planning Management Analysis Knowledge Management SaaS ITIL Service Strategy Enterprise Software Project Management See 6+     See less Integration Mergers & Acquisitions IT Strategy Cloud Computing Project Planning Program Management Service Management Call Center Architecture Change Management Software Documentation PMP Leadership Offerings Strategic Planning Management Analysis Knowledge Management SaaS ITIL Service Strategy Enterprise Software Project Management See 6+     See less Integration Mergers & Acquisitions IT Strategy Cloud Computing Project Planning Program Management Service Management Call Center Architecture Change Management Software Documentation PMP Leadership Offerings Strategic Planning Management Analysis Knowledge Management SaaS ITIL Service Strategy Enterprise Software Project Management See 6+     See less Education Georgia Institute of Technology MS - Management of Technology 2006 Kennesaw State University BS 1991 Georgia Institute of Technology MS - Management of Technology 2006 Georgia Institute of Technology MS - Management of Technology 2006 Georgia Institute of Technology MS - Management of Technology 2006 Kennesaw State University BS 1991 Kennesaw State University BS 1991 Kennesaw State University BS 1991 ", "Experience Vice President, Corporate Development Carbonite January 2015  – Present (8 months) Greater Boston Area Vice President, Corporate Development Carbonite January 2015  – Present (8 months) Greater Boston Area Vice President, Corporate Development Carbonite January 2015  – Present (8 months) Greater Boston Area Skills Skills     ", "Experience M&A Senior Project Manager IBM June 2015  – Present (3 months) Provide leadership for IBM Global Services M&A Integrations to ensure successful integration into IBM. Add value to assigned deals through strong integration planning as well as M&A lifecycle and operational knowledge. Utilize communication, negotiation, problem solving, and project management skills to effectively integrate into IBM. Project Manager - Mobile - IBM Interactive Experience IBM 2015  – Present (less than a year) Responsible for managing mobile solution delivery through all its phases, that includes Solution, Plan, Build and Test, Deploy and transition to Maintenance - leveraging IBM Design Thinking and Apple best practices. Leading project teams that are global and organizationally dispersed, and addressing all IBM internal Delivery Excellence aspects on projects.  \n \nIn addition to the above lead the efforts of standardizing IBM Interactive Studio & Mobile delivery framework and assets, which leverages Apple best practices and IBM Design Thinking. M&A Senior Project Manager IBM June 2015  – Present (3 months) Provide leadership for IBM Global Services M&A Integrations to ensure successful integration into IBM. Add value to assigned deals through strong integration planning as well as M&A lifecycle and operational knowledge. Utilize communication, negotiation, problem solving, and project management skills to effectively integrate into IBM. M&A Senior Project Manager IBM June 2015  – Present (3 months) Provide leadership for IBM Global Services M&A Integrations to ensure successful integration into IBM. Add value to assigned deals through strong integration planning as well as M&A lifecycle and operational knowledge. Utilize communication, negotiation, problem solving, and project management skills to effectively integrate into IBM. Project Manager - Mobile - IBM Interactive Experience IBM 2015  – Present (less than a year) Responsible for managing mobile solution delivery through all its phases, that includes Solution, Plan, Build and Test, Deploy and transition to Maintenance - leveraging IBM Design Thinking and Apple best practices. Leading project teams that are global and organizationally dispersed, and addressing all IBM internal Delivery Excellence aspects on projects.  \n \nIn addition to the above lead the efforts of standardizing IBM Interactive Studio & Mobile delivery framework and assets, which leverages Apple best practices and IBM Design Thinking. Project Manager - Mobile - IBM Interactive Experience IBM 2015  – Present (less than a year) Responsible for managing mobile solution delivery through all its phases, that includes Solution, Plan, Build and Test, Deploy and transition to Maintenance - leveraging IBM Design Thinking and Apple best practices. Leading project teams that are global and organizationally dispersed, and addressing all IBM internal Delivery Excellence aspects on projects.  \n \nIn addition to the above lead the efforts of standardizing IBM Interactive Studio & Mobile delivery framework and assets, which leverages Apple best practices and IBM Design Thinking. Languages Persian Native or bilingual proficiency English Native or bilingual proficiency Persian Native or bilingual proficiency English Native or bilingual proficiency Persian Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills CRM Project Management SQL Java Relationship Management Microsoft Office Customer Service Business Operations Enterprise Software Photoshop Communication Training XML SQL*Plus XSL Oracle Web Design Business Development Leadership Management Business Analysis Business Intelligence IT Strategy Business Process Requirements Analysis See 9+     See less Skills  CRM Project Management SQL Java Relationship Management Microsoft Office Customer Service Business Operations Enterprise Software Photoshop Communication Training XML SQL*Plus XSL Oracle Web Design Business Development Leadership Management Business Analysis Business Intelligence IT Strategy Business Process Requirements Analysis See 9+     See less CRM Project Management SQL Java Relationship Management Microsoft Office Customer Service Business Operations Enterprise Software Photoshop Communication Training XML SQL*Plus XSL Oracle Web Design Business Development Leadership Management Business Analysis Business Intelligence IT Strategy Business Process Requirements Analysis See 9+     See less CRM Project Management SQL Java Relationship Management Microsoft Office Customer Service Business Operations Enterprise Software Photoshop Communication Training XML SQL*Plus XSL Oracle Web Design Business Development Leadership Management Business Analysis Business Intelligence IT Strategy Business Process Requirements Analysis See 9+     See less Education Cranfield University - Cranfield School of Management MSc,  Management 2004  – 2005 Brunel University London BSc,  Computer Science 1998  – 2001 Cranfield University - Cranfield School of Management MSc,  Management 2004  – 2005 Cranfield University - Cranfield School of Management MSc,  Management 2004  – 2005 Cranfield University - Cranfield School of Management MSc,  Management 2004  – 2005 Brunel University London BSc,  Computer Science 1998  – 2001 Brunel University London BSc,  Computer Science 1998  – 2001 Brunel University London BSc,  Computer Science 1998  – 2001 Honors & Awards IBM Maximo Outstanding Performance Award IBM June 2011 IBM Business Service Excellence Award IBM June 2013 Additional Honors & Awards IBM Business Service Excellence Award - 2006 IBM Maximo Outstanding Performance Award IBM June 2011 IBM Maximo Outstanding Performance Award IBM June 2011 IBM Maximo Outstanding Performance Award IBM June 2011 IBM Business Service Excellence Award IBM June 2013 IBM Business Service Excellence Award IBM June 2013 IBM Business Service Excellence Award IBM June 2013 Additional Honors & Awards IBM Business Service Excellence Award - 2006 Additional Honors & Awards IBM Business Service Excellence Award - 2006 Additional Honors & Awards IBM Business Service Excellence Award - 2006 ", "Experience Acquisition Integration - People Manager IBM January 2012  – Present (3 years 8 months) Orange County, California Area Manage a team of Individual Contributor / Project Managers across the M&A Integration - Sales Operations space for SWG Business Development / M&A Integration IBM December 1995  –  December 2011  (16 years 1 month) Dublin Ireland, Cambrdige, MA and Costa Mesa, CA Various Roles including \n \n1995 - 1998 - Strategic Account Manager , Dublin Ireland \n1998 - 2001 - eCommerce Project Manager \n2001 - 2005 - M&A Integration Manager - Fulfillment / Order to Cash \n2005 - 2007 - Business Development - Entity Analytics  \n2007 - 2011 - M&A Integration - Sales Operations Lieutenant, FF/EMT Littleton Fire Department 2000  –  2008  (8 years) Littleton, MA Firefighter / Emergency Medical Technician in a combination (part Full Time part Call) Fire Department. \n \nCompany Officer / On Call Duty Officer Account Manager Sanmina 1994  –  1995  (1 year) Cork, Ireland Strategic Account Manager at SCI-Sanmina managing all aspects of the relationship from current business throughput and profitability to future potential business. Responsible for all aspects of the relationship from customer satisfaction to profitability to account growth. New Product Introduction Manager Digital Equipment Corp 1988  –  1994  (6 years) Ayr, Scotland & Valbonne, France Working with Strategic Supplier to bring new PC's to the European market to establish the DEC brand in this emerging space. Anticipating market movement and technology advancements to ensure maximum potential revenue and market share while minimizing shelf inventory and costly obsolescence. Master Scheduler Apollo Computers 1987  –  1988  (1 year) Livingston, Scotland Drive the master schedule to meet ongoing customer demand, production line capacity, materials availability and expected company growth trajectory. Work across the internal stake holders to ensure continual throughput while minimizing downtime due to material outages, finished goods inventory or costly overtime requirements. Operations Manager Sanmina 1984  –  1986  (2 years) Irvine, Scotland Operations Management of Component Test Laboratory including machine and resource utilization, reporting, audit-ability, receiving, secure control and shipping of high value componentry Private 11th Supply & Transport Company September 1979  –  March 1984  (4 years 7 months) Collins Barracks, Dublin, Ireland Driver - 4x2, 4x4, Jeeps, Field Artillery \n \nTrained on FN Rifle, Bren Light Machine Guns, Gustav Sub-Machine Guns, Lee Enfield Rifles, Browning 9mm Pistols \n \nPrimary Duties - Troop Carrying, Artillery Movement, Security Details Production Planner StorageTek 1982  –  1984  (2 years) Dublin, Ireland Planning the production of Tape Drive units to meet a monthly requirements plan and near term customer demand. Working with the production manager and the materials department to ensure high resource utilization and minimal downtime or overtime. Acquisition Integration - People Manager IBM January 2012  – Present (3 years 8 months) Orange County, California Area Manage a team of Individual Contributor / Project Managers across the M&A Integration - Sales Operations space for SWG Acquisition Integration - People Manager IBM January 2012  – Present (3 years 8 months) Orange County, California Area Manage a team of Individual Contributor / Project Managers across the M&A Integration - Sales Operations space for SWG Business Development / M&A Integration IBM December 1995  –  December 2011  (16 years 1 month) Dublin Ireland, Cambrdige, MA and Costa Mesa, CA Various Roles including \n \n1995 - 1998 - Strategic Account Manager , Dublin Ireland \n1998 - 2001 - eCommerce Project Manager \n2001 - 2005 - M&A Integration Manager - Fulfillment / Order to Cash \n2005 - 2007 - Business Development - Entity Analytics  \n2007 - 2011 - M&A Integration - Sales Operations Business Development / M&A Integration IBM December 1995  –  December 2011  (16 years 1 month) Dublin Ireland, Cambrdige, MA and Costa Mesa, CA Various Roles including \n \n1995 - 1998 - Strategic Account Manager , Dublin Ireland \n1998 - 2001 - eCommerce Project Manager \n2001 - 2005 - M&A Integration Manager - Fulfillment / Order to Cash \n2005 - 2007 - Business Development - Entity Analytics  \n2007 - 2011 - M&A Integration - Sales Operations Lieutenant, FF/EMT Littleton Fire Department 2000  –  2008  (8 years) Littleton, MA Firefighter / Emergency Medical Technician in a combination (part Full Time part Call) Fire Department. \n \nCompany Officer / On Call Duty Officer Lieutenant, FF/EMT Littleton Fire Department 2000  –  2008  (8 years) Littleton, MA Firefighter / Emergency Medical Technician in a combination (part Full Time part Call) Fire Department. \n \nCompany Officer / On Call Duty Officer Account Manager Sanmina 1994  –  1995  (1 year) Cork, Ireland Strategic Account Manager at SCI-Sanmina managing all aspects of the relationship from current business throughput and profitability to future potential business. Responsible for all aspects of the relationship from customer satisfaction to profitability to account growth. Account Manager Sanmina 1994  –  1995  (1 year) Cork, Ireland Strategic Account Manager at SCI-Sanmina managing all aspects of the relationship from current business throughput and profitability to future potential business. Responsible for all aspects of the relationship from customer satisfaction to profitability to account growth. New Product Introduction Manager Digital Equipment Corp 1988  –  1994  (6 years) Ayr, Scotland & Valbonne, France Working with Strategic Supplier to bring new PC's to the European market to establish the DEC brand in this emerging space. Anticipating market movement and technology advancements to ensure maximum potential revenue and market share while minimizing shelf inventory and costly obsolescence. New Product Introduction Manager Digital Equipment Corp 1988  –  1994  (6 years) Ayr, Scotland & Valbonne, France Working with Strategic Supplier to bring new PC's to the European market to establish the DEC brand in this emerging space. Anticipating market movement and technology advancements to ensure maximum potential revenue and market share while minimizing shelf inventory and costly obsolescence. Master Scheduler Apollo Computers 1987  –  1988  (1 year) Livingston, Scotland Drive the master schedule to meet ongoing customer demand, production line capacity, materials availability and expected company growth trajectory. Work across the internal stake holders to ensure continual throughput while minimizing downtime due to material outages, finished goods inventory or costly overtime requirements. Master Scheduler Apollo Computers 1987  –  1988  (1 year) Livingston, Scotland Drive the master schedule to meet ongoing customer demand, production line capacity, materials availability and expected company growth trajectory. Work across the internal stake holders to ensure continual throughput while minimizing downtime due to material outages, finished goods inventory or costly overtime requirements. Operations Manager Sanmina 1984  –  1986  (2 years) Irvine, Scotland Operations Management of Component Test Laboratory including machine and resource utilization, reporting, audit-ability, receiving, secure control and shipping of high value componentry Operations Manager Sanmina 1984  –  1986  (2 years) Irvine, Scotland Operations Management of Component Test Laboratory including machine and resource utilization, reporting, audit-ability, receiving, secure control and shipping of high value componentry Private 11th Supply & Transport Company September 1979  –  March 1984  (4 years 7 months) Collins Barracks, Dublin, Ireland Driver - 4x2, 4x4, Jeeps, Field Artillery \n \nTrained on FN Rifle, Bren Light Machine Guns, Gustav Sub-Machine Guns, Lee Enfield Rifles, Browning 9mm Pistols \n \nPrimary Duties - Troop Carrying, Artillery Movement, Security Details Private 11th Supply & Transport Company September 1979  –  March 1984  (4 years 7 months) Collins Barracks, Dublin, Ireland Driver - 4x2, 4x4, Jeeps, Field Artillery \n \nTrained on FN Rifle, Bren Light Machine Guns, Gustav Sub-Machine Guns, Lee Enfield Rifles, Browning 9mm Pistols \n \nPrimary Duties - Troop Carrying, Artillery Movement, Security Details Production Planner StorageTek 1982  –  1984  (2 years) Dublin, Ireland Planning the production of Tape Drive units to meet a monthly requirements plan and near term customer demand. Working with the production manager and the materials department to ensure high resource utilization and minimal downtime or overtime. Production Planner StorageTek 1982  –  1984  (2 years) Dublin, Ireland Planning the production of Tape Drive units to meet a monthly requirements plan and near term customer demand. Working with the production manager and the materials department to ensure high resource utilization and minimal downtime or overtime. Skills Acquisition Integration Enterprise Software SaaS Cloud Computing Business Alliances Channel Outsourcing Integration Go-to-market Strategy Business Transformation Business Case Cross-functional Team... Business Intelligence Program Management Mergers Mergers & Acquisitions Analytics Management CRM Sales Operations Business Development Operations Management See 7+     See less Skills  Acquisition Integration Enterprise Software SaaS Cloud Computing Business Alliances Channel Outsourcing Integration Go-to-market Strategy Business Transformation Business Case Cross-functional Team... Business Intelligence Program Management Mergers Mergers & Acquisitions Analytics Management CRM Sales Operations Business Development Operations Management See 7+     See less Acquisition Integration Enterprise Software SaaS Cloud Computing Business Alliances Channel Outsourcing Integration Go-to-market Strategy Business Transformation Business Case Cross-functional Team... Business Intelligence Program Management Mergers Mergers & Acquisitions Analytics Management CRM Sales Operations Business Development Operations Management See 7+     See less Acquisition Integration Enterprise Software SaaS Cloud Computing Business Alliances Channel Outsourcing Integration Go-to-market Strategy Business Transformation Business Case Cross-functional Team... Business Intelligence Program Management Mergers Mergers & Acquisitions Analytics Management CRM Sales Operations Business Development Operations Management See 7+     See less Education Project Management Institute Project Management Professional,  Project Management 2001  – 2003 The George Washington University Masters Certificate,  Project Management 2001  – 2003 Emerson Hospital, Concord MA Emergency Medical Technican,  Emergency Medical Technology/Technician (EMT) 2000  – 2001 American Production and Inventory Control Society Certified in Production & Inventory Management,  Production and Inventory Management 1987  – 1989 St Kevins Project Management Institute Project Management Professional,  Project Management 2001  – 2003 Project Management Institute Project Management Professional,  Project Management 2001  – 2003 Project Management Institute Project Management Professional,  Project Management 2001  – 2003 The George Washington University Masters Certificate,  Project Management 2001  – 2003 The George Washington University Masters Certificate,  Project Management 2001  – 2003 The George Washington University Masters Certificate,  Project Management 2001  – 2003 Emerson Hospital, Concord MA Emergency Medical Technican,  Emergency Medical Technology/Technician (EMT) 2000  – 2001 Emerson Hospital, Concord MA Emergency Medical Technican,  Emergency Medical Technology/Technician (EMT) 2000  – 2001 Emerson Hospital, Concord MA Emergency Medical Technican,  Emergency Medical Technology/Technician (EMT) 2000  – 2001 American Production and Inventory Control Society Certified in Production & Inventory Management,  Production and Inventory Management 1987  – 1989 American Production and Inventory Control Society Certified in Production & Inventory Management,  Production and Inventory Management 1987  – 1989 American Production and Inventory Control Society Certified in Production & Inventory Management,  Production and Inventory Management 1987  – 1989 St Kevins St Kevins St Kevins ", "Summary MBA and Engineer shaped by multi-national high-tech business experience with worldwide authority and progressive responsibilities. \n \nKey skills: \n► Business Case Development  \n► Pricing Strategy \n► Product Strategy \n► Sales Operation \n► Bid response \n► People Management and Mentoring \n► M&A integration \n \nDiverse background and good communication skills supports effectively working with partners and customers as well as internally. Strong people management and mentoring skills with emphasis on growing human talent. Summary MBA and Engineer shaped by multi-national high-tech business experience with worldwide authority and progressive responsibilities. \n \nKey skills: \n► Business Case Development  \n► Pricing Strategy \n► Product Strategy \n► Sales Operation \n► Bid response \n► People Management and Mentoring \n► M&A integration \n \nDiverse background and good communication skills supports effectively working with partners and customers as well as internally. Strong people management and mentoring skills with emphasis on growing human talent. MBA and Engineer shaped by multi-national high-tech business experience with worldwide authority and progressive responsibilities. \n \nKey skills: \n► Business Case Development  \n► Pricing Strategy \n► Product Strategy \n► Sales Operation \n► Bid response \n► People Management and Mentoring \n► M&A integration \n \nDiverse background and good communication skills supports effectively working with partners and customers as well as internally. Strong people management and mentoring skills with emphasis on growing human talent. MBA and Engineer shaped by multi-national high-tech business experience with worldwide authority and progressive responsibilities. \n \nKey skills: \n► Business Case Development  \n► Pricing Strategy \n► Product Strategy \n► Sales Operation \n► Bid response \n► People Management and Mentoring \n► M&A integration \n \nDiverse background and good communication skills supports effectively working with partners and customers as well as internally. Strong people management and mentoring skills with emphasis on growing human talent. Experience Founder Kitsuma Works September 2014  – Present (1 year) Raleigh-Durham, North Carolina Area Manager, Pricing and Contracts Administration Bandwidth.com January 2013  –  August 2014  (1 year 8 months) Raleigh-Durham, North Carolina Area Program Manager, M&A integration IBM April 2008  –  January 2013  (4 years 10 months) RTP, NC Americas Inventory and Life cycle Management IBM April 2006  –  February 2008  (1 year 11 months) RTP, NC Lead Financial Analyst – Americas Sales IBM September 2004  –  April 2006  (1 year 8 months) RTP, NC Lead Financial Analyst - WW Warranty Finance IBM April 2003  –  September 2004  (1 year 6 months) RTP, NC Lead Financial Analyst - IBM Options Pricing Lead IBM May 2002  –  April 2003  (1 year) RTP, NC Financial Analyst – ThinkPad Pricing IBM November 2000  –  May 2002  (1 year 7 months) RTP, NC Founder Kitsuma Works September 2014  – Present (1 year) Raleigh-Durham, North Carolina Area Founder Kitsuma Works September 2014  – Present (1 year) Raleigh-Durham, North Carolina Area Manager, Pricing and Contracts Administration Bandwidth.com January 2013  –  August 2014  (1 year 8 months) Raleigh-Durham, North Carolina Area Manager, Pricing and Contracts Administration Bandwidth.com January 2013  –  August 2014  (1 year 8 months) Raleigh-Durham, North Carolina Area Program Manager, M&A integration IBM April 2008  –  January 2013  (4 years 10 months) RTP, NC Program Manager, M&A integration IBM April 2008  –  January 2013  (4 years 10 months) RTP, NC Americas Inventory and Life cycle Management IBM April 2006  –  February 2008  (1 year 11 months) RTP, NC Americas Inventory and Life cycle Management IBM April 2006  –  February 2008  (1 year 11 months) RTP, NC Lead Financial Analyst – Americas Sales IBM September 2004  –  April 2006  (1 year 8 months) RTP, NC Lead Financial Analyst – Americas Sales IBM September 2004  –  April 2006  (1 year 8 months) RTP, NC Lead Financial Analyst - WW Warranty Finance IBM April 2003  –  September 2004  (1 year 6 months) RTP, NC Lead Financial Analyst - WW Warranty Finance IBM April 2003  –  September 2004  (1 year 6 months) RTP, NC Lead Financial Analyst - IBM Options Pricing Lead IBM May 2002  –  April 2003  (1 year) RTP, NC Lead Financial Analyst - IBM Options Pricing Lead IBM May 2002  –  April 2003  (1 year) RTP, NC Financial Analyst – ThinkPad Pricing IBM November 2000  –  May 2002  (1 year 7 months) RTP, NC Financial Analyst – ThinkPad Pricing IBM November 2000  –  May 2002  (1 year 7 months) RTP, NC Languages Danish Native or bilingual proficiency English Native or bilingual proficiency Danish Native or bilingual proficiency English Native or bilingual proficiency Danish Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Financial Analysis Forecasting Mergers & Acquisitions Project Planning Integration Pricing Telecommunications Business Modeling Finance Strategy Product Management Business Analysis Program Management Business Process... Sales Operations Salesforce Training Contract Management Contract Negotiation Pricing Strategy Pricing Analysis Bid Pricing Bid Preparation Bid Strategy Price Setting Price Optimization Management See 11+     See less Skills  Financial Analysis Forecasting Mergers & Acquisitions Project Planning Integration Pricing Telecommunications Business Modeling Finance Strategy Product Management Business Analysis Program Management Business Process... Sales Operations Salesforce Training Contract Management Contract Negotiation Pricing Strategy Pricing Analysis Bid Pricing Bid Preparation Bid Strategy Price Setting Price Optimization Management See 11+     See less Financial Analysis Forecasting Mergers & Acquisitions Project Planning Integration Pricing Telecommunications Business Modeling Finance Strategy Product Management Business Analysis Program Management Business Process... Sales Operations Salesforce Training Contract Management Contract Negotiation Pricing Strategy Pricing Analysis Bid Pricing Bid Preparation Bid Strategy Price Setting Price Optimization Management See 11+     See less Financial Analysis Forecasting Mergers & Acquisitions Project Planning Integration Pricing Telecommunications Business Modeling Finance Strategy Product Management Business Analysis Program Management Business Process... Sales Operations Salesforce Training Contract Management Contract Negotiation Pricing Strategy Pricing Analysis Bid Pricing Bid Preparation Bid Strategy Price Setting Price Optimization Management See 11+     See less Education University of North Carolina at Chapel Hill - Kenan-Flagler Business School Master of Business Administration,  MBA 2006  – 2008 Activities and Societies:  Beta Gamma Sigma Honor Society. Technical University of Denmark Master,  Telecommunication and Applied Physics 1995  – 1999 Specialized in telecommunication and data networks. \nMasters Thesis, a feasibility study of xDSL technology. University of Copenhagen Bachelor,  Economics 1992  – 1995 University of North Carolina at Chapel Hill - Kenan-Flagler Business School Master of Business Administration,  MBA 2006  – 2008 Activities and Societies:  Beta Gamma Sigma Honor Society. University of North Carolina at Chapel Hill - Kenan-Flagler Business School Master of Business Administration,  MBA 2006  – 2008 Activities and Societies:  Beta Gamma Sigma Honor Society. University of North Carolina at Chapel Hill - Kenan-Flagler Business School Master of Business Administration,  MBA 2006  – 2008 Activities and Societies:  Beta Gamma Sigma Honor Society. Technical University of Denmark Master,  Telecommunication and Applied Physics 1995  – 1999 Specialized in telecommunication and data networks. \nMasters Thesis, a feasibility study of xDSL technology. Technical University of Denmark Master,  Telecommunication and Applied Physics 1995  – 1999 Specialized in telecommunication and data networks. \nMasters Thesis, a feasibility study of xDSL technology. Technical University of Denmark Master,  Telecommunication and Applied Physics 1995  – 1999 Specialized in telecommunication and data networks. \nMasters Thesis, a feasibility study of xDSL technology. University of Copenhagen Bachelor,  Economics 1992  – 1995 University of Copenhagen Bachelor,  Economics 1992  – 1995 University of Copenhagen Bachelor,  Economics 1992  – 1995 ", "Summary Skilled strategy, business development, partnership, acquisition and post merger integration executive with 20 years end-to-end deal life-cycle expertise (over $2 Bn+ cumulative transaction experience) resulting in 90%+ attainment of shareholder objectives. \n \nLeverage collaborative partnering and investment paradigms along the full spectrum from venture stage to full ownership for value creation. Direct experience in the Americas, Europe (Germany/CEE), Africa, Middle East, India, Taiwan. \n \nFocus areas: technology as an enabler to improve outcomes in healthcare, renewable energy, education; International comparative models. Active empowerment of diversity and women as alternative models/examples of leadership for future generations.  \n \nPassion for promotion of quality early childhood virtues/arts/nature based education as a global imperative for the progress of humanity. Summary Skilled strategy, business development, partnership, acquisition and post merger integration executive with 20 years end-to-end deal life-cycle expertise (over $2 Bn+ cumulative transaction experience) resulting in 90%+ attainment of shareholder objectives. \n \nLeverage collaborative partnering and investment paradigms along the full spectrum from venture stage to full ownership for value creation. Direct experience in the Americas, Europe (Germany/CEE), Africa, Middle East, India, Taiwan. \n \nFocus areas: technology as an enabler to improve outcomes in healthcare, renewable energy, education; International comparative models. Active empowerment of diversity and women as alternative models/examples of leadership for future generations.  \n \nPassion for promotion of quality early childhood virtues/arts/nature based education as a global imperative for the progress of humanity. Skilled strategy, business development, partnership, acquisition and post merger integration executive with 20 years end-to-end deal life-cycle expertise (over $2 Bn+ cumulative transaction experience) resulting in 90%+ attainment of shareholder objectives. \n \nLeverage collaborative partnering and investment paradigms along the full spectrum from venture stage to full ownership for value creation. Direct experience in the Americas, Europe (Germany/CEE), Africa, Middle East, India, Taiwan. \n \nFocus areas: technology as an enabler to improve outcomes in healthcare, renewable energy, education; International comparative models. Active empowerment of diversity and women as alternative models/examples of leadership for future generations.  \n \nPassion for promotion of quality early childhood virtues/arts/nature based education as a global imperative for the progress of humanity. Skilled strategy, business development, partnership, acquisition and post merger integration executive with 20 years end-to-end deal life-cycle expertise (over $2 Bn+ cumulative transaction experience) resulting in 90%+ attainment of shareholder objectives. \n \nLeverage collaborative partnering and investment paradigms along the full spectrum from venture stage to full ownership for value creation. Direct experience in the Americas, Europe (Germany/CEE), Africa, Middle East, India, Taiwan. \n \nFocus areas: technology as an enabler to improve outcomes in healthcare, renewable energy, education; International comparative models. Active empowerment of diversity and women as alternative models/examples of leadership for future generations.  \n \nPassion for promotion of quality early childhood virtues/arts/nature based education as a global imperative for the progress of humanity. Experience Director, Strategic Transactions (M&A) and Partnerships for Insight Analytics IBM March 2014  – Present (1 year 6 months) Munich Area, Germany Director of Corporate Development (Mergers and Acquisitions) IBM April 2012  – Present (3 years 5 months) Armonk, New York Executive Director, Business Development for CEEMEA (Central Eastern Europe, Middle East, Africa) IBM November 2010  –  April 2012  (1 year 6 months) Prague, The Capital, Czech Republic Executive, M&A Integration IBM January 2006  –  November 2009  (3 years 11 months) Armonk, NY and New Delhi, India Consultant, Corporate Development M&A IBM 2000  –  2004  (4 years) Armonk, NY and Paris, France Strategic Management Consultant Monitor Company January 1994  –  January 1998  (4 years 1 month) Director, Strategic Transactions (M&A) and Partnerships for Insight Analytics IBM March 2014  – Present (1 year 6 months) Munich Area, Germany Director, Strategic Transactions (M&A) and Partnerships for Insight Analytics IBM March 2014  – Present (1 year 6 months) Munich Area, Germany Director of Corporate Development (Mergers and Acquisitions) IBM April 2012  – Present (3 years 5 months) Armonk, New York Director of Corporate Development (Mergers and Acquisitions) IBM April 2012  – Present (3 years 5 months) Armonk, New York Executive Director, Business Development for CEEMEA (Central Eastern Europe, Middle East, Africa) IBM November 2010  –  April 2012  (1 year 6 months) Prague, The Capital, Czech Republic Executive Director, Business Development for CEEMEA (Central Eastern Europe, Middle East, Africa) IBM November 2010  –  April 2012  (1 year 6 months) Prague, The Capital, Czech Republic Executive, M&A Integration IBM January 2006  –  November 2009  (3 years 11 months) Armonk, NY and New Delhi, India Executive, M&A Integration IBM January 2006  –  November 2009  (3 years 11 months) Armonk, NY and New Delhi, India Consultant, Corporate Development M&A IBM 2000  –  2004  (4 years) Armonk, NY and Paris, France Consultant, Corporate Development M&A IBM 2000  –  2004  (4 years) Armonk, NY and Paris, France Strategic Management Consultant Monitor Company January 1994  –  January 1998  (4 years 1 month) Strategic Management Consultant Monitor Company January 1994  –  January 1998  (4 years 1 month) Languages Spanish Professional working proficiency German Limited working proficiency Spanish Professional working proficiency German Limited working proficiency Spanish Professional working proficiency German Limited working proficiency Professional working proficiency Limited working proficiency Skills Skills     Education THE WHARTON SCHOOL, University of Pennsylvania Master of Business Administration (MBA) 1999  – 2000 INSEAD Master of Business Administration (M.B.A.) 1999  – 1999 Smith College BA 1990  – 1994 The London School of Economics and Political Science (LSE) B.A. 1991  – 1992 THE WHARTON SCHOOL, University of Pennsylvania Master of Business Administration (MBA) 1999  – 2000 THE WHARTON SCHOOL, University of Pennsylvania Master of Business Administration (MBA) 1999  – 2000 THE WHARTON SCHOOL, University of Pennsylvania Master of Business Administration (MBA) 1999  – 2000 INSEAD Master of Business Administration (M.B.A.) 1999  – 1999 INSEAD Master of Business Administration (M.B.A.) 1999  – 1999 INSEAD Master of Business Administration (M.B.A.) 1999  – 1999 Smith College BA 1990  – 1994 Smith College BA 1990  – 1994 Smith College BA 1990  – 1994 The London School of Economics and Political Science (LSE) B.A. 1991  – 1992 The London School of Economics and Political Science (LSE) B.A. 1991  – 1992 The London School of Economics and Political Science (LSE) B.A. 1991  – 1992 Honors & Awards \"Most Admired Corporate Dealmaker- IT\" (2013) The Deal, industry publication for M&A and Private Equity November 2013 In repeat performance, IBM has been recognized as the Most Admired Corporate Dealmaker in the IT sector by The Deal. The aware recognized the top 10 strategic acquirers for best in class work in Mergers and Acquisitions. Additional Honors & Awards http://businesstoday.intoday.in/story/ibms-indian-silver-bullet/1/5653.html \"Most Admired Corporate Dealmaker- IT\" (2013) The Deal, industry publication for M&A and Private Equity November 2013 In repeat performance, IBM has been recognized as the Most Admired Corporate Dealmaker in the IT sector by The Deal. The aware recognized the top 10 strategic acquirers for best in class work in Mergers and Acquisitions. \"Most Admired Corporate Dealmaker- IT\" (2013) The Deal, industry publication for M&A and Private Equity November 2013 In repeat performance, IBM has been recognized as the Most Admired Corporate Dealmaker in the IT sector by The Deal. The aware recognized the top 10 strategic acquirers for best in class work in Mergers and Acquisitions. \"Most Admired Corporate Dealmaker- IT\" (2013) The Deal, industry publication for M&A and Private Equity November 2013 In repeat performance, IBM has been recognized as the Most Admired Corporate Dealmaker in the IT sector by The Deal. The aware recognized the top 10 strategic acquirers for best in class work in Mergers and Acquisitions. Additional Honors & Awards http://businesstoday.intoday.in/story/ibms-indian-silver-bullet/1/5653.html Additional Honors & Awards http://businesstoday.intoday.in/story/ibms-indian-silver-bullet/1/5653.html Additional Honors & Awards http://businesstoday.intoday.in/story/ibms-indian-silver-bullet/1/5653.html ", "Summary Lara Cumberland is currently Head of M&A Integration at Facebook where she leads the integration team responsible for supporting the company's global M&A efforts. Prior to joining Facebook, Lara also led the Corporate Development Integration teams for eBay/PayPal (including leading the Braintree acquisition integration) and IBM. Lara has provided hands-on acquisition integration support and led several significant integration process improvements impacting the success of dozens of acquisitions. Previously, Lara was a management consultant for six years with PwC Consulting and then with IBM Global Business Services, leading client projects in M&A integration and organizational change management for all types of major business transformation initiatives across multiple industries. \n \nSpecialties: Mergers and Acquisitions (M&A) Integration  \nOrganizational Change Management \nManagement Consulting Summary Lara Cumberland is currently Head of M&A Integration at Facebook where she leads the integration team responsible for supporting the company's global M&A efforts. Prior to joining Facebook, Lara also led the Corporate Development Integration teams for eBay/PayPal (including leading the Braintree acquisition integration) and IBM. Lara has provided hands-on acquisition integration support and led several significant integration process improvements impacting the success of dozens of acquisitions. Previously, Lara was a management consultant for six years with PwC Consulting and then with IBM Global Business Services, leading client projects in M&A integration and organizational change management for all types of major business transformation initiatives across multiple industries. \n \nSpecialties: Mergers and Acquisitions (M&A) Integration  \nOrganizational Change Management \nManagement Consulting Lara Cumberland is currently Head of M&A Integration at Facebook where she leads the integration team responsible for supporting the company's global M&A efforts. Prior to joining Facebook, Lara also led the Corporate Development Integration teams for eBay/PayPal (including leading the Braintree acquisition integration) and IBM. Lara has provided hands-on acquisition integration support and led several significant integration process improvements impacting the success of dozens of acquisitions. Previously, Lara was a management consultant for six years with PwC Consulting and then with IBM Global Business Services, leading client projects in M&A integration and organizational change management for all types of major business transformation initiatives across multiple industries. \n \nSpecialties: Mergers and Acquisitions (M&A) Integration  \nOrganizational Change Management \nManagement Consulting Lara Cumberland is currently Head of M&A Integration at Facebook where she leads the integration team responsible for supporting the company's global M&A efforts. Prior to joining Facebook, Lara also led the Corporate Development Integration teams for eBay/PayPal (including leading the Braintree acquisition integration) and IBM. Lara has provided hands-on acquisition integration support and led several significant integration process improvements impacting the success of dozens of acquisitions. Previously, Lara was a management consultant for six years with PwC Consulting and then with IBM Global Business Services, leading client projects in M&A integration and organizational change management for all types of major business transformation initiatives across multiple industries. \n \nSpecialties: Mergers and Acquisitions (M&A) Integration  \nOrganizational Change Management \nManagement Consulting Experience Head of M&A Integration Facebook February 2015  – Present (7 months) Braintree Integration Executive PayPal September 2013  –  December 2014  (1 year 4 months) Senior Director M&A Integration eBay April 2012  –  September 2014  (2 years 6 months) Director M&A Integration, IBM Corporate Development IBM September 2009  –  March 2012  (2 years 7 months) M&A Executive Integration Consultant IBM March 2004  –  September 2009  (5 years 7 months) Strategy & Change Consultant IBM Business Consulting Services October 2002  –  March 2004  (1 year 6 months) Strategy & Change Consultant PwC Consulting 1998  –  2002  (4 years) Head of M&A Integration Facebook February 2015  – Present (7 months) Head of M&A Integration Facebook February 2015  – Present (7 months) Braintree Integration Executive PayPal September 2013  –  December 2014  (1 year 4 months) Braintree Integration Executive PayPal September 2013  –  December 2014  (1 year 4 months) Senior Director M&A Integration eBay April 2012  –  September 2014  (2 years 6 months) Senior Director M&A Integration eBay April 2012  –  September 2014  (2 years 6 months) Director M&A Integration, IBM Corporate Development IBM September 2009  –  March 2012  (2 years 7 months) Director M&A Integration, IBM Corporate Development IBM September 2009  –  March 2012  (2 years 7 months) M&A Executive Integration Consultant IBM March 2004  –  September 2009  (5 years 7 months) M&A Executive Integration Consultant IBM March 2004  –  September 2009  (5 years 7 months) Strategy & Change Consultant IBM Business Consulting Services October 2002  –  March 2004  (1 year 6 months) Strategy & Change Consultant IBM Business Consulting Services October 2002  –  March 2004  (1 year 6 months) Strategy & Change Consultant PwC Consulting 1998  –  2002  (4 years) Strategy & Change Consultant PwC Consulting 1998  –  2002  (4 years) Skills Acquisition Integration Mergers Management Consulting Business Transformation Corporate Development Acquisitions M&A experience Strategy Due Diligence Process Improvement Change Management Business Process... Cloud Computing IT Strategy Outsourcing Mergers & Acquisitions Program Management Integration Entrepreneurship Strategic Planning Strategic Partnerships Management Start-ups Business Development Business Analysis Leadership Business Intelligence Analytics Business Process Cross-functional Team... Consulting Product Management Business Alliances See 18+     See less Skills  Acquisition Integration Mergers Management Consulting Business Transformation Corporate Development Acquisitions M&A experience Strategy Due Diligence Process Improvement Change Management Business Process... Cloud Computing IT Strategy Outsourcing Mergers & Acquisitions Program Management Integration Entrepreneurship Strategic Planning Strategic Partnerships Management Start-ups Business Development Business Analysis Leadership Business Intelligence Analytics Business Process Cross-functional Team... Consulting Product Management Business Alliances See 18+     See less Acquisition Integration Mergers Management Consulting Business Transformation Corporate Development Acquisitions M&A experience Strategy Due Diligence Process Improvement Change Management Business Process... Cloud Computing IT Strategy Outsourcing Mergers & Acquisitions Program Management Integration Entrepreneurship Strategic Planning Strategic Partnerships Management Start-ups Business Development Business Analysis Leadership Business Intelligence Analytics Business Process Cross-functional Team... Consulting Product Management Business Alliances See 18+     See less Acquisition Integration Mergers Management Consulting Business Transformation Corporate Development Acquisitions M&A experience Strategy Due Diligence Process Improvement Change Management Business Process... Cloud Computing IT Strategy Outsourcing Mergers & Acquisitions Program Management Integration Entrepreneurship Strategic Planning Strategic Partnerships Management Start-ups Business Development Business Analysis Leadership Business Intelligence Analytics Business Process Cross-functional Team... Consulting Product Management Business Alliances See 18+     See less ", "Experience Senior Finance Associate Bridgewater Associates April 2013  – Present (2 years 5 months) Senior Finance Associate Bridgewater Associates April 2013  – Present (2 years 5 months) Senior Finance Associate Bridgewater Associates April 2013  – Present (2 years 5 months) Languages English Spanish English Spanish English Spanish Skills Visio Management Consulting Word Visual Basic SPSS Excel PowerPoint MS Project Minitab MapInfo Access Financial Modeling Sales Management Business Strategy Financial Analysis Analysis Strategic Planning Business Analysis Business Intelligence Program Management Mergers Strategy Development Analytics Data Analysis Valuation Due Diligence Process Improvement Business Process... Acquisition Integration Corporate Finance Business Planning Strategy Mergers & Acquisitions Business Transformation See 19+     See less Skills  Visio Management Consulting Word Visual Basic SPSS Excel PowerPoint MS Project Minitab MapInfo Access Financial Modeling Sales Management Business Strategy Financial Analysis Analysis Strategic Planning Business Analysis Business Intelligence Program Management Mergers Strategy Development Analytics Data Analysis Valuation Due Diligence Process Improvement Business Process... Acquisition Integration Corporate Finance Business Planning Strategy Mergers & Acquisitions Business Transformation See 19+     See less Visio Management Consulting Word Visual Basic SPSS Excel PowerPoint MS Project Minitab MapInfo Access Financial Modeling Sales Management Business Strategy Financial Analysis Analysis Strategic Planning Business Analysis Business Intelligence Program Management Mergers Strategy Development Analytics Data Analysis Valuation Due Diligence Process Improvement Business Process... Acquisition Integration Corporate Finance Business Planning Strategy Mergers & Acquisitions Business Transformation See 19+     See less Visio Management Consulting Word Visual Basic SPSS Excel PowerPoint MS Project Minitab MapInfo Access Financial Modeling Sales Management Business Strategy Financial Analysis Analysis Strategic Planning Business Analysis Business Intelligence Program Management Mergers Strategy Development Analytics Data Analysis Valuation Due Diligence Process Improvement Business Process... Acquisition Integration Corporate Finance Business Planning Strategy Mergers & Acquisitions Business Transformation See 19+     See less Education New York University - Leonard N. Stern School of Business MBA,  Corporate Finance ,  Entrepreneurship 2008  – 2011 Activities and Societies:  Inducted into Beta Gamma Sigma honor society Cornell University Master of Professional Studies,  Applied Statistics 2001  – 2002 Cornell University Bachelor of Science,  Industrial and Labor Relations 1997  – 2001 New York University - Leonard N. Stern School of Business MBA,  Corporate Finance ,  Entrepreneurship 2008  – 2011 Activities and Societies:  Inducted into Beta Gamma Sigma honor society New York University - Leonard N. Stern School of Business MBA,  Corporate Finance ,  Entrepreneurship 2008  – 2011 Activities and Societies:  Inducted into Beta Gamma Sigma honor society New York University - Leonard N. Stern School of Business MBA,  Corporate Finance ,  Entrepreneurship 2008  – 2011 Activities and Societies:  Inducted into Beta Gamma Sigma honor society Cornell University Master of Professional Studies,  Applied Statistics 2001  – 2002 Cornell University Master of Professional Studies,  Applied Statistics 2001  – 2002 Cornell University Master of Professional Studies,  Applied Statistics 2001  – 2002 Cornell University Bachelor of Science,  Industrial and Labor Relations 1997  – 2001 Cornell University Bachelor of Science,  Industrial and Labor Relations 1997  – 2001 Cornell University Bachelor of Science,  Industrial and Labor Relations 1997  – 2001 ", "Summary Record of leading & influencing globalized, highly matrixed organizations to manage, develop, and deliver SaaS, cloud, and on premises software offerings. History of consultatively solutioning customer and channel opportunities, becoming clients \"trusted advisors,\" while concurrently transforming sales, go-to-market, and delivery processes to scale and exceed worldwide revenue plans.  \n \nSelect accomplishments: \n \n• Transformed IBMs eCommerce portfolio to for the realities of cloud and SaaS, resulting in delivery of a highly differentiated cloud commerce offering, multi-$M of MRR and ACV, with strong GPM. \n \n• Led engineering integration of the largest acquisition in the history of the IBM Software Group, Sterling Commerce. 1,500 person engineering team, 92 products, $500M+ revenue. Drove transformation of IBM’s fulfillment and go-to-market approaches in support of Sterling’s SaaS integration.  \n \n• Consultative solutioning with clients and business partners, leading to multiple opportunity closures, cultivation of new partnerships, while transforming IBM’s sales & go-to-market approaches. Directly contributed to $50M+ in software & SaaS revenue.  \n \n• Turned around multiple troubled development and delivery efforts, subsequently leading and streamlining highly matrixed execution of diverse software and SaaS solutions.  \n \n• Fanatical focus on customer success: successfully delivered customer support across multiple solutions, while delivering process improvement and quality initiatives to increase customer loyalty, revenue, profitability, and competitive advantage. \n \nCore competencies: \n \n• eCommerce \n• Software development \n• SaaS & cloud strategy, DevOps, continuous delivery, continuous availability, implementation, support \n• M&A, acquisition integration \n• Consultative sales, channel cultivation, transformation \n• Project management \n• Organizational management Summary Record of leading & influencing globalized, highly matrixed organizations to manage, develop, and deliver SaaS, cloud, and on premises software offerings. History of consultatively solutioning customer and channel opportunities, becoming clients \"trusted advisors,\" while concurrently transforming sales, go-to-market, and delivery processes to scale and exceed worldwide revenue plans.  \n \nSelect accomplishments: \n \n• Transformed IBMs eCommerce portfolio to for the realities of cloud and SaaS, resulting in delivery of a highly differentiated cloud commerce offering, multi-$M of MRR and ACV, with strong GPM. \n \n• Led engineering integration of the largest acquisition in the history of the IBM Software Group, Sterling Commerce. 1,500 person engineering team, 92 products, $500M+ revenue. Drove transformation of IBM’s fulfillment and go-to-market approaches in support of Sterling’s SaaS integration.  \n \n• Consultative solutioning with clients and business partners, leading to multiple opportunity closures, cultivation of new partnerships, while transforming IBM’s sales & go-to-market approaches. Directly contributed to $50M+ in software & SaaS revenue.  \n \n• Turned around multiple troubled development and delivery efforts, subsequently leading and streamlining highly matrixed execution of diverse software and SaaS solutions.  \n \n• Fanatical focus on customer success: successfully delivered customer support across multiple solutions, while delivering process improvement and quality initiatives to increase customer loyalty, revenue, profitability, and competitive advantage. \n \nCore competencies: \n \n• eCommerce \n• Software development \n• SaaS & cloud strategy, DevOps, continuous delivery, continuous availability, implementation, support \n• M&A, acquisition integration \n• Consultative sales, channel cultivation, transformation \n• Project management \n• Organizational management Record of leading & influencing globalized, highly matrixed organizations to manage, develop, and deliver SaaS, cloud, and on premises software offerings. History of consultatively solutioning customer and channel opportunities, becoming clients \"trusted advisors,\" while concurrently transforming sales, go-to-market, and delivery processes to scale and exceed worldwide revenue plans.  \n \nSelect accomplishments: \n \n• Transformed IBMs eCommerce portfolio to for the realities of cloud and SaaS, resulting in delivery of a highly differentiated cloud commerce offering, multi-$M of MRR and ACV, with strong GPM. \n \n• Led engineering integration of the largest acquisition in the history of the IBM Software Group, Sterling Commerce. 1,500 person engineering team, 92 products, $500M+ revenue. Drove transformation of IBM’s fulfillment and go-to-market approaches in support of Sterling’s SaaS integration.  \n \n• Consultative solutioning with clients and business partners, leading to multiple opportunity closures, cultivation of new partnerships, while transforming IBM’s sales & go-to-market approaches. Directly contributed to $50M+ in software & SaaS revenue.  \n \n• Turned around multiple troubled development and delivery efforts, subsequently leading and streamlining highly matrixed execution of diverse software and SaaS solutions.  \n \n• Fanatical focus on customer success: successfully delivered customer support across multiple solutions, while delivering process improvement and quality initiatives to increase customer loyalty, revenue, profitability, and competitive advantage. \n \nCore competencies: \n \n• eCommerce \n• Software development \n• SaaS & cloud strategy, DevOps, continuous delivery, continuous availability, implementation, support \n• M&A, acquisition integration \n• Consultative sales, channel cultivation, transformation \n• Project management \n• Organizational management Record of leading & influencing globalized, highly matrixed organizations to manage, develop, and deliver SaaS, cloud, and on premises software offerings. History of consultatively solutioning customer and channel opportunities, becoming clients \"trusted advisors,\" while concurrently transforming sales, go-to-market, and delivery processes to scale and exceed worldwide revenue plans.  \n \nSelect accomplishments: \n \n• Transformed IBMs eCommerce portfolio to for the realities of cloud and SaaS, resulting in delivery of a highly differentiated cloud commerce offering, multi-$M of MRR and ACV, with strong GPM. \n \n• Led engineering integration of the largest acquisition in the history of the IBM Software Group, Sterling Commerce. 1,500 person engineering team, 92 products, $500M+ revenue. Drove transformation of IBM’s fulfillment and go-to-market approaches in support of Sterling’s SaaS integration.  \n \n• Consultative solutioning with clients and business partners, leading to multiple opportunity closures, cultivation of new partnerships, while transforming IBM’s sales & go-to-market approaches. Directly contributed to $50M+ in software & SaaS revenue.  \n \n• Turned around multiple troubled development and delivery efforts, subsequently leading and streamlining highly matrixed execution of diverse software and SaaS solutions.  \n \n• Fanatical focus on customer success: successfully delivered customer support across multiple solutions, while delivering process improvement and quality initiatives to increase customer loyalty, revenue, profitability, and competitive advantage. \n \nCore competencies: \n \n• eCommerce \n• Software development \n• SaaS & cloud strategy, DevOps, continuous delivery, continuous availability, implementation, support \n• M&A, acquisition integration \n• Consultative sales, channel cultivation, transformation \n• Project management \n• Organizational management Experience Director, eCommerce Offerings & Strategy IBM March 2015  – Present (6 months) Raleigh-Durham, North Carolina Area Director of eCommerce Offerings & Strategy, IBM Commerce \n• Leading cross-discipline, cross-unit team responsible for IBM WebSphere Commerce, all deployment models including IBM Commerce on Cloud. \n• Customer experience through discovery, purchase, and use. Portfolio and business strategy, product & offering management, business plan ownership, shepherding offerings through development, marketing, sales processes to deliver differentiated offerings to the market to achieve customer success. Program Director, IBM Commerce Cloud Strategy and Offering Management at IBM IBM July 2013  –  March 2015  (1 year 9 months) Raleigh-Durham, North Carolina Area My team and I drove two core initiatives: \n \n• Commerce cloud delivery transformation: start with leading on premises IBM Smarter Commerce products (WebSphere Commerce, Sterling Order Management, Sterling Configure Price Quote). Take outside-in perspective on client and market needs. Institutionalize \"customer first\" attitude. Drive DevOps concepts and cost (COGS) reductions. Transform sales, GTM, services, client success methodologies. Balance with operational, cost, and profitability realities. Results: multi-$M bookings while maintaining limited churn and high CLTV, while cultivating deep relationships with clients & partners. Significant cost reductions, improved GPM, improved ability to bid in previously 'unbiddable' opportunities.  \n \n• B2B & Commerce brand business transformation for Cloud & SaaS: replicate Commerce cloud delivery transformation through $1.5B brand. Cloud First cultural shift, DevOps standardization, enabling of optimized solution experience aligned with achievement of economic and technological metrics. Results: transformation deliverables being widely leveraged across portfolio, 5 offerings (and growing) have specifically adopted models, improved ability to target opportunities previously unable to address, additional new logos, improved customer experience, revenue and GPM. Program Director, Commerce on Cloud Development IBM March 2012  –  December 2013  (1 year 10 months) Raleigh-Durham, North Carolina Area Direct $7.3M development expense budget and 51 employees (including five managers) with matrix management responsibilities for over 100.  \n•\tLead geographically dispersed team in developing & deploying multiple releases of IBM's Commerce on Cloud, an integrated platform for selling, transacting and fulfilling cross-channel commerce orders via SaaS delivery model. Offering extended WebSphere Commerce & Sterling’s Order Management, increasing time to value and reduced IT costs by adding new SaaS deployment, DevOps & continuous delivery processes, UIs, and integrations focused at enabling a leading SaaS experience. \n•\tConsultative solutioning with 25+ clients and business partners, leading to multiple deal closures and cultivation of new partnerships leveraging IBM's new SaaS business partner hosted and solution provider GTM models. \n• Lead DevOps core team for new offerings in Commerce segment. Team lead deployment architecture, environmental strategy, cost assessment/definition, end-to-end deployment and on-boarding pipelines. Drove revolutionary concepts to evolve release management strategy for SaaS by forcing early clarity on costs of goods sold, DevOps centric processes, and clear project roles/responsibilities.  \n•\tLead cross-Software Group effort to drive consistent SaaS architecture, solution design, and continuous delivery, driving to achieve IBM’s 2015 roadmap for SaaS. Program Director, Sterling Commerce M&A Integration IBM August 2010  –  June 2012  (1 year 11 months) Raleigh-Durham, North Carolina Area Directed ~1,300 Engineering employees through 16 direct reports with budget responsibility of up to $16M. \n•\tIntegrated Sterling Commerce’s business into IBM Software Group (SWG) including Selling & Fulfillment, B2B & MFT segments, and all as-a-service offerings.  \n•\tLead cross-Software Group team in enhancing IBM's Sales, Fulfillment, Design, Delivery, Implementation, and Support systems in support of SaaS, resulting in achievement of 'cutover to fulfillment' and achievement of acquisition business targets. Approach became base of IBM's strategic SaaS execution model. Recognized via Outstanding Technical Achievement Award.  \n•\tInnovated by creating 5 strategic synergies with IBM's portfolio, a subset of which became differentiating portions of solutions (SaaS & on premises) driving IBM annuity revenue.  \n•\tInnovated and adapted software development process to drive release availability, promote and create strategic synergies with IBM's portfolio, generating increased brand and SWG revenue. \n•\tMet all integration milestones; drove cross-function business controls compliance effort and facilitated creation of SaaS Center of Competence to drive additional focus/consistency in delivering SaaS bookings. Offering Team Lead, WebSphere Open Source & Emerging Technologies IBM February 2008  –  August 2010  (2 years 7 months) Raleigh-Durham, North Carolina Area Led four cross-functional WW >50 person execution teams to conceptualize, design, develop, sell, and support seven strategic offerings in the WebSphere Application Infrastructure portfolio (WebSphere eXtreme Scale, WebSphere DataPower XC10 Appliance, and multiple WebSphere Application Server offerings). \n•\tContributed to $50M+ in annual revenue while protecting against revenue erosion from competitors. \n•\tLed WebSphere brand participation in SmartCloud Enterprise initiative, addressing growing market opportunity for applications & IBM middleware running as cloud services; generated $30M+ revenue. \n•\tProvided oversight & management of 2009-2010 yearly financial planning (Fall Plan) activities for 1000+ HC WebSphere Server Development organization. \n•\tServed as Operations Manager for WebSphere Open Source strategy organization, ensuring all offerings were released on budget and on schedule. Chief of Staff, SWG WebSphere Services & Support IBM February 2007  –  February 2008  (1 year 1 month) Raleigh-Durham, North Carolina Area Evangelized adoption of new business and client strategies in WebSphere Services & Support. \n•\tIncreased profitability while accelerating organizational collaboration. \n•\tManaged resource reallocation, beating target goals by $2M. Manager, Solutions Customer Support IBM August 2005  –  February 2007  (1 year 7 months) Raleigh-Durham, North Carolina Area Led team in providing outstanding customer satisfaction while addressing approximately 2,000 customer issues annually on 17 SWG Solutions. Achieved net satisfaction index ~95%. \n•\tMentored team, communicating IBM’s vision to increase motivation, trust, strategic risk taking, opportunity, innovation, and productivity. \n•\tFostered high performance culture with focus on speed, execution, and winning in the global marketplace, while growing current and future executive & technical talent and increasing diversity.  \n•\tImproved quality and serviceability by implementing Orthongal PMR (trouble ticket) Causal Analysis & diligent reviews of Quality Assessments. Process was recognized as one of the most mature and innovative in IBM's Application & Integration Middleware (AIM) division. Various: Development Lead, Test Lead, Software Engineer, Test Engineer IBM May 2001  –  August 2005  (4 years 4 months) Greater New York City Area Led development for WebSphere Voice Application Access (WVAA) 5.0/5.0.x deliverables in 2004; achieving multiple eGAs ahead of schedule. \n•\tTransitioned WVAA Product Development to the UK in 3Q-4Q 2004. \n•\tTransformed multiple troubled technology bake-offs to an innovative effort which resulted in ~ €3M EUR in additional revenue in 2005. \n•\tTechnical Lead for WebSphere Voice Server (WVS) 4.2 / WebSphere Voice Response (3.1.x) deliverables in 2003 & 2004; eGAs for the Corporate Technical Milestone releases achieved ahead of schedule. \n•\tPresented, owned, and delivered multiple technical sales enablement events, GSIs, ISVs. System Administrator Thaumaturgix, Inc. January 2000  –  September 2000  (9 months) Greater New York City Area Network Administrator Westchester County June 1999  –  August 1999  (3 months) Greater New York City Area Network Administration INVISION Inc. 1997  –  1998  (1 year) Greater New York City Area Director, eCommerce Offerings & Strategy IBM March 2015  – Present (6 months) Raleigh-Durham, North Carolina Area Director of eCommerce Offerings & Strategy, IBM Commerce \n• Leading cross-discipline, cross-unit team responsible for IBM WebSphere Commerce, all deployment models including IBM Commerce on Cloud. \n• Customer experience through discovery, purchase, and use. Portfolio and business strategy, product & offering management, business plan ownership, shepherding offerings through development, marketing, sales processes to deliver differentiated offerings to the market to achieve customer success. Director, eCommerce Offerings & Strategy IBM March 2015  – Present (6 months) Raleigh-Durham, North Carolina Area Director of eCommerce Offerings & Strategy, IBM Commerce \n• Leading cross-discipline, cross-unit team responsible for IBM WebSphere Commerce, all deployment models including IBM Commerce on Cloud. \n• Customer experience through discovery, purchase, and use. Portfolio and business strategy, product & offering management, business plan ownership, shepherding offerings through development, marketing, sales processes to deliver differentiated offerings to the market to achieve customer success. Program Director, IBM Commerce Cloud Strategy and Offering Management at IBM IBM July 2013  –  March 2015  (1 year 9 months) Raleigh-Durham, North Carolina Area My team and I drove two core initiatives: \n \n• Commerce cloud delivery transformation: start with leading on premises IBM Smarter Commerce products (WebSphere Commerce, Sterling Order Management, Sterling Configure Price Quote). Take outside-in perspective on client and market needs. Institutionalize \"customer first\" attitude. Drive DevOps concepts and cost (COGS) reductions. Transform sales, GTM, services, client success methodologies. Balance with operational, cost, and profitability realities. Results: multi-$M bookings while maintaining limited churn and high CLTV, while cultivating deep relationships with clients & partners. Significant cost reductions, improved GPM, improved ability to bid in previously 'unbiddable' opportunities.  \n \n• B2B & Commerce brand business transformation for Cloud & SaaS: replicate Commerce cloud delivery transformation through $1.5B brand. Cloud First cultural shift, DevOps standardization, enabling of optimized solution experience aligned with achievement of economic and technological metrics. Results: transformation deliverables being widely leveraged across portfolio, 5 offerings (and growing) have specifically adopted models, improved ability to target opportunities previously unable to address, additional new logos, improved customer experience, revenue and GPM. Program Director, IBM Commerce Cloud Strategy and Offering Management at IBM IBM July 2013  –  March 2015  (1 year 9 months) Raleigh-Durham, North Carolina Area My team and I drove two core initiatives: \n \n• Commerce cloud delivery transformation: start with leading on premises IBM Smarter Commerce products (WebSphere Commerce, Sterling Order Management, Sterling Configure Price Quote). Take outside-in perspective on client and market needs. Institutionalize \"customer first\" attitude. Drive DevOps concepts and cost (COGS) reductions. Transform sales, GTM, services, client success methodologies. Balance with operational, cost, and profitability realities. Results: multi-$M bookings while maintaining limited churn and high CLTV, while cultivating deep relationships with clients & partners. Significant cost reductions, improved GPM, improved ability to bid in previously 'unbiddable' opportunities.  \n \n• B2B & Commerce brand business transformation for Cloud & SaaS: replicate Commerce cloud delivery transformation through $1.5B brand. Cloud First cultural shift, DevOps standardization, enabling of optimized solution experience aligned with achievement of economic and technological metrics. Results: transformation deliverables being widely leveraged across portfolio, 5 offerings (and growing) have specifically adopted models, improved ability to target opportunities previously unable to address, additional new logos, improved customer experience, revenue and GPM. Program Director, Commerce on Cloud Development IBM March 2012  –  December 2013  (1 year 10 months) Raleigh-Durham, North Carolina Area Direct $7.3M development expense budget and 51 employees (including five managers) with matrix management responsibilities for over 100.  \n•\tLead geographically dispersed team in developing & deploying multiple releases of IBM's Commerce on Cloud, an integrated platform for selling, transacting and fulfilling cross-channel commerce orders via SaaS delivery model. Offering extended WebSphere Commerce & Sterling’s Order Management, increasing time to value and reduced IT costs by adding new SaaS deployment, DevOps & continuous delivery processes, UIs, and integrations focused at enabling a leading SaaS experience. \n•\tConsultative solutioning with 25+ clients and business partners, leading to multiple deal closures and cultivation of new partnerships leveraging IBM's new SaaS business partner hosted and solution provider GTM models. \n• Lead DevOps core team for new offerings in Commerce segment. Team lead deployment architecture, environmental strategy, cost assessment/definition, end-to-end deployment and on-boarding pipelines. Drove revolutionary concepts to evolve release management strategy for SaaS by forcing early clarity on costs of goods sold, DevOps centric processes, and clear project roles/responsibilities.  \n•\tLead cross-Software Group effort to drive consistent SaaS architecture, solution design, and continuous delivery, driving to achieve IBM’s 2015 roadmap for SaaS. Program Director, Commerce on Cloud Development IBM March 2012  –  December 2013  (1 year 10 months) Raleigh-Durham, North Carolina Area Direct $7.3M development expense budget and 51 employees (including five managers) with matrix management responsibilities for over 100.  \n•\tLead geographically dispersed team in developing & deploying multiple releases of IBM's Commerce on Cloud, an integrated platform for selling, transacting and fulfilling cross-channel commerce orders via SaaS delivery model. Offering extended WebSphere Commerce & Sterling’s Order Management, increasing time to value and reduced IT costs by adding new SaaS deployment, DevOps & continuous delivery processes, UIs, and integrations focused at enabling a leading SaaS experience. \n•\tConsultative solutioning with 25+ clients and business partners, leading to multiple deal closures and cultivation of new partnerships leveraging IBM's new SaaS business partner hosted and solution provider GTM models. \n• Lead DevOps core team for new offerings in Commerce segment. Team lead deployment architecture, environmental strategy, cost assessment/definition, end-to-end deployment and on-boarding pipelines. Drove revolutionary concepts to evolve release management strategy for SaaS by forcing early clarity on costs of goods sold, DevOps centric processes, and clear project roles/responsibilities.  \n•\tLead cross-Software Group effort to drive consistent SaaS architecture, solution design, and continuous delivery, driving to achieve IBM’s 2015 roadmap for SaaS. Program Director, Sterling Commerce M&A Integration IBM August 2010  –  June 2012  (1 year 11 months) Raleigh-Durham, North Carolina Area Directed ~1,300 Engineering employees through 16 direct reports with budget responsibility of up to $16M. \n•\tIntegrated Sterling Commerce’s business into IBM Software Group (SWG) including Selling & Fulfillment, B2B & MFT segments, and all as-a-service offerings.  \n•\tLead cross-Software Group team in enhancing IBM's Sales, Fulfillment, Design, Delivery, Implementation, and Support systems in support of SaaS, resulting in achievement of 'cutover to fulfillment' and achievement of acquisition business targets. Approach became base of IBM's strategic SaaS execution model. Recognized via Outstanding Technical Achievement Award.  \n•\tInnovated by creating 5 strategic synergies with IBM's portfolio, a subset of which became differentiating portions of solutions (SaaS & on premises) driving IBM annuity revenue.  \n•\tInnovated and adapted software development process to drive release availability, promote and create strategic synergies with IBM's portfolio, generating increased brand and SWG revenue. \n•\tMet all integration milestones; drove cross-function business controls compliance effort and facilitated creation of SaaS Center of Competence to drive additional focus/consistency in delivering SaaS bookings. Program Director, Sterling Commerce M&A Integration IBM August 2010  –  June 2012  (1 year 11 months) Raleigh-Durham, North Carolina Area Directed ~1,300 Engineering employees through 16 direct reports with budget responsibility of up to $16M. \n•\tIntegrated Sterling Commerce’s business into IBM Software Group (SWG) including Selling & Fulfillment, B2B & MFT segments, and all as-a-service offerings.  \n•\tLead cross-Software Group team in enhancing IBM's Sales, Fulfillment, Design, Delivery, Implementation, and Support systems in support of SaaS, resulting in achievement of 'cutover to fulfillment' and achievement of acquisition business targets. Approach became base of IBM's strategic SaaS execution model. Recognized via Outstanding Technical Achievement Award.  \n•\tInnovated by creating 5 strategic synergies with IBM's portfolio, a subset of which became differentiating portions of solutions (SaaS & on premises) driving IBM annuity revenue.  \n•\tInnovated and adapted software development process to drive release availability, promote and create strategic synergies with IBM's portfolio, generating increased brand and SWG revenue. \n•\tMet all integration milestones; drove cross-function business controls compliance effort and facilitated creation of SaaS Center of Competence to drive additional focus/consistency in delivering SaaS bookings. Offering Team Lead, WebSphere Open Source & Emerging Technologies IBM February 2008  –  August 2010  (2 years 7 months) Raleigh-Durham, North Carolina Area Led four cross-functional WW >50 person execution teams to conceptualize, design, develop, sell, and support seven strategic offerings in the WebSphere Application Infrastructure portfolio (WebSphere eXtreme Scale, WebSphere DataPower XC10 Appliance, and multiple WebSphere Application Server offerings). \n•\tContributed to $50M+ in annual revenue while protecting against revenue erosion from competitors. \n•\tLed WebSphere brand participation in SmartCloud Enterprise initiative, addressing growing market opportunity for applications & IBM middleware running as cloud services; generated $30M+ revenue. \n•\tProvided oversight & management of 2009-2010 yearly financial planning (Fall Plan) activities for 1000+ HC WebSphere Server Development organization. \n•\tServed as Operations Manager for WebSphere Open Source strategy organization, ensuring all offerings were released on budget and on schedule. Offering Team Lead, WebSphere Open Source & Emerging Technologies IBM February 2008  –  August 2010  (2 years 7 months) Raleigh-Durham, North Carolina Area Led four cross-functional WW >50 person execution teams to conceptualize, design, develop, sell, and support seven strategic offerings in the WebSphere Application Infrastructure portfolio (WebSphere eXtreme Scale, WebSphere DataPower XC10 Appliance, and multiple WebSphere Application Server offerings). \n•\tContributed to $50M+ in annual revenue while protecting against revenue erosion from competitors. \n•\tLed WebSphere brand participation in SmartCloud Enterprise initiative, addressing growing market opportunity for applications & IBM middleware running as cloud services; generated $30M+ revenue. \n•\tProvided oversight & management of 2009-2010 yearly financial planning (Fall Plan) activities for 1000+ HC WebSphere Server Development organization. \n•\tServed as Operations Manager for WebSphere Open Source strategy organization, ensuring all offerings were released on budget and on schedule. Chief of Staff, SWG WebSphere Services & Support IBM February 2007  –  February 2008  (1 year 1 month) Raleigh-Durham, North Carolina Area Evangelized adoption of new business and client strategies in WebSphere Services & Support. \n•\tIncreased profitability while accelerating organizational collaboration. \n•\tManaged resource reallocation, beating target goals by $2M. Chief of Staff, SWG WebSphere Services & Support IBM February 2007  –  February 2008  (1 year 1 month) Raleigh-Durham, North Carolina Area Evangelized adoption of new business and client strategies in WebSphere Services & Support. \n•\tIncreased profitability while accelerating organizational collaboration. \n•\tManaged resource reallocation, beating target goals by $2M. Manager, Solutions Customer Support IBM August 2005  –  February 2007  (1 year 7 months) Raleigh-Durham, North Carolina Area Led team in providing outstanding customer satisfaction while addressing approximately 2,000 customer issues annually on 17 SWG Solutions. Achieved net satisfaction index ~95%. \n•\tMentored team, communicating IBM’s vision to increase motivation, trust, strategic risk taking, opportunity, innovation, and productivity. \n•\tFostered high performance culture with focus on speed, execution, and winning in the global marketplace, while growing current and future executive & technical talent and increasing diversity.  \n•\tImproved quality and serviceability by implementing Orthongal PMR (trouble ticket) Causal Analysis & diligent reviews of Quality Assessments. Process was recognized as one of the most mature and innovative in IBM's Application & Integration Middleware (AIM) division. Manager, Solutions Customer Support IBM August 2005  –  February 2007  (1 year 7 months) Raleigh-Durham, North Carolina Area Led team in providing outstanding customer satisfaction while addressing approximately 2,000 customer issues annually on 17 SWG Solutions. Achieved net satisfaction index ~95%. \n•\tMentored team, communicating IBM’s vision to increase motivation, trust, strategic risk taking, opportunity, innovation, and productivity. \n•\tFostered high performance culture with focus on speed, execution, and winning in the global marketplace, while growing current and future executive & technical talent and increasing diversity.  \n•\tImproved quality and serviceability by implementing Orthongal PMR (trouble ticket) Causal Analysis & diligent reviews of Quality Assessments. Process was recognized as one of the most mature and innovative in IBM's Application & Integration Middleware (AIM) division. Various: Development Lead, Test Lead, Software Engineer, Test Engineer IBM May 2001  –  August 2005  (4 years 4 months) Greater New York City Area Led development for WebSphere Voice Application Access (WVAA) 5.0/5.0.x deliverables in 2004; achieving multiple eGAs ahead of schedule. \n•\tTransitioned WVAA Product Development to the UK in 3Q-4Q 2004. \n•\tTransformed multiple troubled technology bake-offs to an innovative effort which resulted in ~ €3M EUR in additional revenue in 2005. \n•\tTechnical Lead for WebSphere Voice Server (WVS) 4.2 / WebSphere Voice Response (3.1.x) deliverables in 2003 & 2004; eGAs for the Corporate Technical Milestone releases achieved ahead of schedule. \n•\tPresented, owned, and delivered multiple technical sales enablement events, GSIs, ISVs. Various: Development Lead, Test Lead, Software Engineer, Test Engineer IBM May 2001  –  August 2005  (4 years 4 months) Greater New York City Area Led development for WebSphere Voice Application Access (WVAA) 5.0/5.0.x deliverables in 2004; achieving multiple eGAs ahead of schedule. \n•\tTransitioned WVAA Product Development to the UK in 3Q-4Q 2004. \n•\tTransformed multiple troubled technology bake-offs to an innovative effort which resulted in ~ €3M EUR in additional revenue in 2005. \n•\tTechnical Lead for WebSphere Voice Server (WVS) 4.2 / WebSphere Voice Response (3.1.x) deliverables in 2003 & 2004; eGAs for the Corporate Technical Milestone releases achieved ahead of schedule. \n•\tPresented, owned, and delivered multiple technical sales enablement events, GSIs, ISVs. System Administrator Thaumaturgix, Inc. January 2000  –  September 2000  (9 months) Greater New York City Area System Administrator Thaumaturgix, Inc. January 2000  –  September 2000  (9 months) Greater New York City Area Network Administrator Westchester County June 1999  –  August 1999  (3 months) Greater New York City Area Network Administrator Westchester County June 1999  –  August 1999  (3 months) Greater New York City Area Network Administration INVISION Inc. 1997  –  1998  (1 year) Greater New York City Area Network Administration INVISION Inc. 1997  –  1998  (1 year) Greater New York City Area Skills Software Development... AIX WebSphere Application... Websphere Java Enterprise Edition Cloud Computing DB2 Enterprise Software SaaS Acquisition Integration Technical Leadership Technical Project... Product Development Customer Experience Helping Clients Succeed Project Management Managed Services Technical Support Customer Oriented Organizational... Customer Satisfaction Pre-Sales Technical... Agile Methodologies Sales Enablement Testing Engineering Change... Application Servers Virtualization PHP IBM Websphere Commerce Waterfall Mobile Devices Mobile Internet Management Linux Datacenter... Demandware Volusion osCommerce Retaining Customers Channel Partners E-commerce Customer Support Software Installation Speech Recognition Software Engineering Enterprise Architecture Scalability Solution Architecture Integration See 35+     See less Skills  Software Development... AIX WebSphere Application... Websphere Java Enterprise Edition Cloud Computing DB2 Enterprise Software SaaS Acquisition Integration Technical Leadership Technical Project... Product Development Customer Experience Helping Clients Succeed Project Management Managed Services Technical Support Customer Oriented Organizational... Customer Satisfaction Pre-Sales Technical... Agile Methodologies Sales Enablement Testing Engineering Change... Application Servers Virtualization PHP IBM Websphere Commerce Waterfall Mobile Devices Mobile Internet Management Linux Datacenter... Demandware Volusion osCommerce Retaining Customers Channel Partners E-commerce Customer Support Software Installation Speech Recognition Software Engineering Enterprise Architecture Scalability Solution Architecture Integration See 35+     See less Software Development... AIX WebSphere Application... Websphere Java Enterprise Edition Cloud Computing DB2 Enterprise Software SaaS Acquisition Integration Technical Leadership Technical Project... Product Development Customer Experience Helping Clients Succeed Project Management Managed Services Technical Support Customer Oriented Organizational... Customer Satisfaction Pre-Sales Technical... Agile Methodologies Sales Enablement Testing Engineering Change... Application Servers Virtualization PHP IBM Websphere Commerce Waterfall Mobile Devices Mobile Internet Management Linux Datacenter... Demandware Volusion osCommerce Retaining Customers Channel Partners E-commerce Customer Support Software Installation Speech Recognition Software Engineering Enterprise Architecture Scalability Solution Architecture Integration See 35+     See less Software Development... AIX WebSphere Application... Websphere Java Enterprise Edition Cloud Computing DB2 Enterprise Software SaaS Acquisition Integration Technical Leadership Technical Project... Product Development Customer Experience Helping Clients Succeed Project Management Managed Services Technical Support Customer Oriented Organizational... Customer Satisfaction Pre-Sales Technical... Agile Methodologies Sales Enablement Testing Engineering Change... Application Servers Virtualization PHP IBM Websphere Commerce Waterfall Mobile Devices Mobile Internet Management Linux Datacenter... Demandware Volusion osCommerce Retaining Customers Channel Partners E-commerce Customer Support Software Installation Speech Recognition Software Engineering Enterprise Architecture Scalability Solution Architecture Integration See 35+     See less Education State University of New York at Albany Bachelors,  Computer Science 1997  – 2000 Dual minors: Finance, Psychology Activities and Societies:  Member ,  Golden Key National Honor Society State University of New York at Albany Bachelors,  Computer Science 1997  – 2000 Dual minors: Finance, Psychology Activities and Societies:  Member ,  Golden Key National Honor Society State University of New York at Albany Bachelors,  Computer Science 1997  – 2000 Dual minors: Finance, Psychology Activities and Societies:  Member ,  Golden Key National Honor Society State University of New York at Albany Bachelors,  Computer Science 1997  – 2000 Dual minors: Finance, Psychology Activities and Societies:  Member ,  Golden Key National Honor Society Honors & Awards Outstanding Technical Achievement Award IBM June 2012 Recognized for delivering FOAK, scalable fulfillment infrastructure for SaaS & cloud-computing based offerings in IBM.  Eminence & Excellence Award IBM December 2011 Recognized for efforts in integrating software development/engineering organization for one of the most complex acquisitions in SWG history into IBM.  Ovation IBM December 2004 For efforts in resolving multiple customer critsits and delivering incremental revenue to IBM.  Eminence & Excellence Award IBM December 2013 Recognized as an influential Lab Advocate by IBM corporate, e.g., nominated by Sales for building outstanding client relationships, improving client satisfaction and being instrumental in impacting past and future revenue for IBM.  Eminence & Excellence Award IBM March 2014 For tenacity and perseverance in reinvigorating execution for a troubled SaaS offering in IBM, leading to multiple opportunity closures. Outstanding Technical Achievement Award IBM June 2012 Recognized for delivering FOAK, scalable fulfillment infrastructure for SaaS & cloud-computing based offerings in IBM.  Outstanding Technical Achievement Award IBM June 2012 Recognized for delivering FOAK, scalable fulfillment infrastructure for SaaS & cloud-computing based offerings in IBM.  Outstanding Technical Achievement Award IBM June 2012 Recognized for delivering FOAK, scalable fulfillment infrastructure for SaaS & cloud-computing based offerings in IBM.  Eminence & Excellence Award IBM December 2011 Recognized for efforts in integrating software development/engineering organization for one of the most complex acquisitions in SWG history into IBM.  Eminence & Excellence Award IBM December 2011 Recognized for efforts in integrating software development/engineering organization for one of the most complex acquisitions in SWG history into IBM.  Eminence & Excellence Award IBM December 2011 Recognized for efforts in integrating software development/engineering organization for one of the most complex acquisitions in SWG history into IBM.  Ovation IBM December 2004 For efforts in resolving multiple customer critsits and delivering incremental revenue to IBM.  Ovation IBM December 2004 For efforts in resolving multiple customer critsits and delivering incremental revenue to IBM.  Ovation IBM December 2004 For efforts in resolving multiple customer critsits and delivering incremental revenue to IBM.  Eminence & Excellence Award IBM December 2013 Recognized as an influential Lab Advocate by IBM corporate, e.g., nominated by Sales for building outstanding client relationships, improving client satisfaction and being instrumental in impacting past and future revenue for IBM.  Eminence & Excellence Award IBM December 2013 Recognized as an influential Lab Advocate by IBM corporate, e.g., nominated by Sales for building outstanding client relationships, improving client satisfaction and being instrumental in impacting past and future revenue for IBM.  Eminence & Excellence Award IBM December 2013 Recognized as an influential Lab Advocate by IBM corporate, e.g., nominated by Sales for building outstanding client relationships, improving client satisfaction and being instrumental in impacting past and future revenue for IBM.  Eminence & Excellence Award IBM March 2014 For tenacity and perseverance in reinvigorating execution for a troubled SaaS offering in IBM, leading to multiple opportunity closures. Eminence & Excellence Award IBM March 2014 For tenacity and perseverance in reinvigorating execution for a troubled SaaS offering in IBM, leading to multiple opportunity closures. Eminence & Excellence Award IBM March 2014 For tenacity and perseverance in reinvigorating execution for a troubled SaaS offering in IBM, leading to multiple opportunity closures. ", "Summary Specialties:Mergers and Acquistion Integration Transition Leadership, Specialist in European M&A and International Deals, Leading Complex Transformation and Change Management Projects Summary Specialties:Mergers and Acquistion Integration Transition Leadership, Specialist in European M&A and International Deals, Leading Complex Transformation and Change Management Projects Specialties:Mergers and Acquistion Integration Transition Leadership, Specialist in European M&A and International Deals, Leading Complex Transformation and Change Management Projects Specialties:Mergers and Acquistion Integration Transition Leadership, Specialist in European M&A and International Deals, Leading Complex Transformation and Change Management Projects Experience Vice President Sales and Transformation IBM Systems & Technology, Europe IBM April 2014  – Present (1 year 5 months) Madrid Spain Driving sales in our growth initiatives (Cloud, Business Analytics, Mobile, Social, Security), Enterprise Sales and leading transformation for Systems and Technology Sales in Europe. Director Operations and Transformation IBM Systems Storage IBM December 2010  –  March 2014  (3 years 4 months) Somers, NY Brand transformation and Sales Operations for IBM Systems Storage Director Operations and M&A Integration IBM Security Solutions August 2008  –  November 2010  (2 years 4 months) Director M&A Integration Europe, Middle East and Africa IBM Internet Security Systems December 2006  –  July 2008  (1 year 8 months) Director M&A Integration Global Services IBM 2005  –  2006  (1 year) Vice President Sales and Transformation IBM Systems & Technology, Europe IBM April 2014  – Present (1 year 5 months) Madrid Spain Driving sales in our growth initiatives (Cloud, Business Analytics, Mobile, Social, Security), Enterprise Sales and leading transformation for Systems and Technology Sales in Europe. Vice President Sales and Transformation IBM Systems & Technology, Europe IBM April 2014  – Present (1 year 5 months) Madrid Spain Driving sales in our growth initiatives (Cloud, Business Analytics, Mobile, Social, Security), Enterprise Sales and leading transformation for Systems and Technology Sales in Europe. Director Operations and Transformation IBM Systems Storage IBM December 2010  –  March 2014  (3 years 4 months) Somers, NY Brand transformation and Sales Operations for IBM Systems Storage Director Operations and Transformation IBM Systems Storage IBM December 2010  –  March 2014  (3 years 4 months) Somers, NY Brand transformation and Sales Operations for IBM Systems Storage Director Operations and M&A Integration IBM Security Solutions August 2008  –  November 2010  (2 years 4 months) Director Operations and M&A Integration IBM Security Solutions August 2008  –  November 2010  (2 years 4 months) Director M&A Integration Europe, Middle East and Africa IBM Internet Security Systems December 2006  –  July 2008  (1 year 8 months) Director M&A Integration Europe, Middle East and Africa IBM Internet Security Systems December 2006  –  July 2008  (1 year 8 months) Director M&A Integration Global Services IBM 2005  –  2006  (1 year) Director M&A Integration Global Services IBM 2005  –  2006  (1 year) Skills Change Management Integration Leadership Mergers Mergers  Sales Operations Skills  Change Management Integration Leadership Mergers Mergers  Sales Operations Change Management Integration Leadership Mergers Mergers  Sales Operations Change Management Integration Leadership Mergers Mergers  Sales Operations Education Rochester Institute of Technology BBUA,  Accounting ,  International Relations 1980  – 1984 Activities and Societies:  President Student Government ,  Finance Director Student Government ,  Alpha Sigma Lambda (Activities ,  Schlorship ,  Leadership) Honor Society. Rochester Institute of Technology BBUA,  Accounting ,  International Relations 1980  – 1984 Activities and Societies:  President Student Government ,  Finance Director Student Government ,  Alpha Sigma Lambda (Activities ,  Schlorship ,  Leadership) Honor Society. Rochester Institute of Technology BBUA,  Accounting ,  International Relations 1980  – 1984 Activities and Societies:  President Student Government ,  Finance Director Student Government ,  Alpha Sigma Lambda (Activities ,  Schlorship ,  Leadership) Honor Society. Rochester Institute of Technology BBUA,  Accounting ,  International Relations 1980  – 1984 Activities and Societies:  President Student Government ,  Finance Director Student Government ,  Alpha Sigma Lambda (Activities ,  Schlorship ,  Leadership) Honor Society. ", "Experience Executive Project Manager, M&A Integration (retired since May, 2011) IBM 2006  –  2011  (5 years) Executive Project Manager, M&A Integration IBM 2006  –  2011  (5 years) Greater New York City Area Executive Project Manager, M&A Integration (retired since May, 2011) IBM 2006  –  2011  (5 years) Executive Project Manager, M&A Integration (retired since May, 2011) IBM 2006  –  2011  (5 years) Executive Project Manager, M&A Integration IBM 2006  –  2011  (5 years) Greater New York City Area Executive Project Manager, M&A Integration IBM 2006  –  2011  (5 years) Greater New York City Area Education Rensselaer Polytechnic Institute MS,  Computer Science 1978  – 1980 National Taiwan University BS 1970  – 1974 Rensselaer Polytechnic Institute MS,  Computer Science 1978  – 1980 Rensselaer Polytechnic Institute MS,  Computer Science 1978  – 1980 Rensselaer Polytechnic Institute MS,  Computer Science 1978  – 1980 National Taiwan University BS 1970  – 1974 National Taiwan University BS 1970  – 1974 National Taiwan University BS 1970  – 1974 ", "Experience Program Manager - Business Analytics IBM June 2012  – Present (3 years 3 months) Dallas/Fort Worth Area Responsible for delivering over $35M in business benefits through advanced analytics, predictive modeling and business intelligence. Manage a team of highly skilled business analysts, SPSS modelers and developers to provide actionable insights to global sales leaders and first line sales managers to improve business performance. Initiative Leader - Sales Management Dashboard IBM April 2008  –  May 2012  (4 years 2 months) Dallas/Fort Worth Area As part of the CIO Business Transformation team, responsible for overall implementation of Business Intelligence and Decision Support dashboards to support Sales Management and Sales Execution functions. Responsible for delivering over $30M in business benefits each year. Managed an international team of developers and analysts and leveraged Cognos, TM1, WebSphere and advanced DB2 technologies to implement robust and scalable solutions. IT Manager - M&A Integration IBM March 2006  –  March 2007  (1 year 1 month) dall Managed the team responsible integration of systems and data from acquired company. Responsible for creating and implementing sunset plans for legacy systems with minimal impact to the business performance. Director - Enterprise IT Applications Micromuse April 2004  –  February 2006  (1 year 11 months) Dallas/Fort Worth Area Managed IT team responsible for selection, customization, implementation and support of all enterprise applications for the corporation. Systems managed include CRM, Business Intelligence, Legal, Marketing, Accounting, Purchasing, Document Management, Knowledge Management, Tech support and others. Development Manager - CRM and Business Intelligence Micromuse January 2001  –  March 2004  (3 years 3 months) Dallas/Fort Worth Area Responsible for development and support of in-house Customer Relationship Management System and enterprise Business Intelligence reporting solution. Program Manager - Business Analytics IBM June 2012  – Present (3 years 3 months) Dallas/Fort Worth Area Responsible for delivering over $35M in business benefits through advanced analytics, predictive modeling and business intelligence. Manage a team of highly skilled business analysts, SPSS modelers and developers to provide actionable insights to global sales leaders and first line sales managers to improve business performance. Program Manager - Business Analytics IBM June 2012  – Present (3 years 3 months) Dallas/Fort Worth Area Responsible for delivering over $35M in business benefits through advanced analytics, predictive modeling and business intelligence. Manage a team of highly skilled business analysts, SPSS modelers and developers to provide actionable insights to global sales leaders and first line sales managers to improve business performance. Initiative Leader - Sales Management Dashboard IBM April 2008  –  May 2012  (4 years 2 months) Dallas/Fort Worth Area As part of the CIO Business Transformation team, responsible for overall implementation of Business Intelligence and Decision Support dashboards to support Sales Management and Sales Execution functions. Responsible for delivering over $30M in business benefits each year. Managed an international team of developers and analysts and leveraged Cognos, TM1, WebSphere and advanced DB2 technologies to implement robust and scalable solutions. Initiative Leader - Sales Management Dashboard IBM April 2008  –  May 2012  (4 years 2 months) Dallas/Fort Worth Area As part of the CIO Business Transformation team, responsible for overall implementation of Business Intelligence and Decision Support dashboards to support Sales Management and Sales Execution functions. Responsible for delivering over $30M in business benefits each year. Managed an international team of developers and analysts and leveraged Cognos, TM1, WebSphere and advanced DB2 technologies to implement robust and scalable solutions. IT Manager - M&A Integration IBM March 2006  –  March 2007  (1 year 1 month) dall Managed the team responsible integration of systems and data from acquired company. Responsible for creating and implementing sunset plans for legacy systems with minimal impact to the business performance. IT Manager - M&A Integration IBM March 2006  –  March 2007  (1 year 1 month) dall Managed the team responsible integration of systems and data from acquired company. Responsible for creating and implementing sunset plans for legacy systems with minimal impact to the business performance. Director - Enterprise IT Applications Micromuse April 2004  –  February 2006  (1 year 11 months) Dallas/Fort Worth Area Managed IT team responsible for selection, customization, implementation and support of all enterprise applications for the corporation. Systems managed include CRM, Business Intelligence, Legal, Marketing, Accounting, Purchasing, Document Management, Knowledge Management, Tech support and others. Director - Enterprise IT Applications Micromuse April 2004  –  February 2006  (1 year 11 months) Dallas/Fort Worth Area Managed IT team responsible for selection, customization, implementation and support of all enterprise applications for the corporation. Systems managed include CRM, Business Intelligence, Legal, Marketing, Accounting, Purchasing, Document Management, Knowledge Management, Tech support and others. Development Manager - CRM and Business Intelligence Micromuse January 2001  –  March 2004  (3 years 3 months) Dallas/Fort Worth Area Responsible for development and support of in-house Customer Relationship Management System and enterprise Business Intelligence reporting solution. Development Manager - CRM and Business Intelligence Micromuse January 2001  –  March 2004  (3 years 3 months) Dallas/Fort Worth Area Responsible for development and support of in-house Customer Relationship Management System and enterprise Business Intelligence reporting solution. Skills Strategy and Business... Operations Management Financial Management... Organizational Design... Project Management and... IT Management International... IT Outsourcing Business Intelligence Cloud Computing Business Analysis Change Management Project Management Leadership Integration SaaS Enterprise Software IT Strategy Strategic Planning Strategy Management Team Management CRM Analytics Mergers & Acquisitions Sales ERP Business Process Consulting Cross-functional Team... Process Improvement SDLC Business Development Business Strategy Sales Management Management Consulting Outsourcing Product Management Business Process... Team Leadership Vendor Management Program Management See 27+     See less Skills  Strategy and Business... Operations Management Financial Management... Organizational Design... Project Management and... IT Management International... IT Outsourcing Business Intelligence Cloud Computing Business Analysis Change Management Project Management Leadership Integration SaaS Enterprise Software IT Strategy Strategic Planning Strategy Management Team Management CRM Analytics Mergers & Acquisitions Sales ERP Business Process Consulting Cross-functional Team... Process Improvement SDLC Business Development Business Strategy Sales Management Management Consulting Outsourcing Product Management Business Process... Team Leadership Vendor Management Program Management See 27+     See less Strategy and Business... Operations Management Financial Management... Organizational Design... Project Management and... IT Management International... IT Outsourcing Business Intelligence Cloud Computing Business Analysis Change Management Project Management Leadership Integration SaaS Enterprise Software IT Strategy Strategic Planning Strategy Management Team Management CRM Analytics Mergers & Acquisitions Sales ERP Business Process Consulting Cross-functional Team... Process Improvement SDLC Business Development Business Strategy Sales Management Management Consulting Outsourcing Product Management Business Process... Team Leadership Vendor Management Program Management See 27+     See less Strategy and Business... Operations Management Financial Management... Organizational Design... Project Management and... IT Management International... IT Outsourcing Business Intelligence Cloud Computing Business Analysis Change Management Project Management Leadership Integration SaaS Enterprise Software IT Strategy Strategic Planning Strategy Management Team Management CRM Analytics Mergers & Acquisitions Sales ERP Business Process Consulting Cross-functional Team... Process Improvement SDLC Business Development Business Strategy Sales Management Management Consulting Outsourcing Product Management Business Process... Team Leadership Vendor Management Program Management See 27+     See less Education The University of Texas at Dallas - School of Management Executive MBA,  Master of Business Adminstration 2008  – 2010 The University of Texas at Dallas - School of Management Executive MBA,  Master of Business Adminstration 2008  – 2010 The University of Texas at Dallas - School of Management Executive MBA,  Master of Business Adminstration 2008  – 2010 The University of Texas at Dallas - School of Management Executive MBA,  Master of Business Adminstration 2008  – 2010 ", "Summary Specialties: Project Management, Acquisition Integration, Open Source Software and Intellectual Property, Software Development Summary Specialties: Project Management, Acquisition Integration, Open Source Software and Intellectual Property, Software Development Specialties: Project Management, Acquisition Integration, Open Source Software and Intellectual Property, Software Development Specialties: Project Management, Acquisition Integration, Open Source Software and Intellectual Property, Software Development Experience IBM Analytics Project Delivery Manager IBM December 2014  – Present (9 months) United Kingdom As a Project Delivery Manager within the IBM Analytics (Lab Services) practice, I am \ncurrently responsible for: \n \n• Successfully delivering both IBM Analytics and multiple brand IBM solutions to clients, \nleading both sales and delivery teams on high profile and large engagements across multiple \nbusiness sectors. \n• Supporting sales and technical pre-sales teams to accurately scope and define client \nservices requirements, providing priced proposals with project plans and estimates of effort and \nskills required. \n• Developing and maintaining commercial and delivery relationships with other IBM \ndivisions (e.g. Global Business Services) and also IBM business partners, providing management of both IBM and subcontractor resources during project delivery. \n• Identifying and securing appropriate consultancy resources using a wide network of \ninternal IBM and external relationships across all parts of the business. \n• Coordinating and resolving technical and support issues with IBM software using extensive understanding and knowledge of the IBM support organisation. \n• Project Managing delivery using IBM Analytics solution implementation methodologies \n• Successful completion of implementations including entire business intelligence \nstrategies and technical upgrades to projects containing many of the IBM Analytics \ntechnologies - such as Cognos BI, TM1, ICM (Varicent), CDM and IBM Watson Product Release Manager (Europe), M&A Integration / IBM Risk Analytics IBM January 2012  –  December 2014  (3 years) United Kingdom As part of Algorithmics acquisition (now IBM Risk Analytics). I was responsible for the integration and release of EMEA based products within the portfolio. Risk Analytics has around 15 different products, some legacy, some in the early stages of their lifecycle. I was responsible for aligning these products with IBM’s PMOM project management model and adherence to the SWG Development Deliverables. I was the Product Team Lead for four major product areas bringing together the various executive roles (Marketing, Service, Finance, Pricing, etc.) to build the Offering Business plans and manage delivery of the products. \n \nAs one of the few heritage IBMers, I was also a key part of the acquisition integration from a social/personal aspect. With over 200 new IBMers coming in with the acquisition there were a number of challenges to this part of the integration. Risk Analytics is predominately Canadian based, and I played a key role as the EMEA based ambassador helping various IBM teams across Europe interact with the new teams, and vice-versa. \n \nPrior to joining the the acquisition I worked with over thirty different acquisitions or potential acquisitions. Some of these acquisitions went through the entire life-cycle from original concept approval through, and past, transfer-of-business, others did not progress beyond initial reviews. The role has included pre-close analysis; open source analysis and remediation; confirmation of third-party code through IBM's legal and release processes; intellectual property management in coordination with IBM legal. Project Manager, M&A Integration IBM February 2008  –  January 2012  (4 years) United Kingdom Part of IBM's Platform Technology Centre. \n \nIntegration of acquired Software and Technology companies into IBM from a technical perspective.  \n \nI joined the PTC to help setup a new M&A competency group. The mission of the PTC was to help internal-IBM projects to resolve their short-term development peaks (predominately to align with IBM software development requirements) in areas such as Globalization, Test-Infrastructure setup and hardening, platform porting and third-party product replacement.  \n \nI was responsible for the Strategy and Business Development for the PTC group and helped design and build additional offerings for the PTC to help IBM’s M&A Integration teams across the world. I helped position the PTC as the world-wide centre of competence for M&A integration within IBM from a third-party software perspective, growing the team from 5 to 40 people. I worked with IBM M&A Directors, technical DEs and Vice Presidents around the world to win acquisition integration business for the group and help both SWG and STG size and risk assess the integration of acquired products. \n \nAs part of the role, I was attached to the integration teams from across SWG and STG. This work often involved on-site analysis of a potential acquisition target (company or product), mainly done one-on-one with the company’s CTO/CEO under strict non-disclosure rules. I worked across Europe, North American and the Middle East on a variety of products and offerings. I attended acquisition due diligence meetings with IBM legal, IBM senior execs, target-company execs and external Legal counsel. System Verification (SV) Test team leader for the WebSphere Enterprise Service Bus (WESB) product IBM June 2005  –  February 2008  (2 years 9 months) Initially the role involved working with the product architects and business representatives to pull together true-to-life business scenarios that helped to define the product content. This was a challenging role as there were many forces pushing the product in different directions, and I was instrumental in bringing the responsible parties to the table to define the requirements. \n \nI moved to the SV Test team and took over the team lead role. At this time, the test team was in need of transformation. I was instrumental in defining new test practices and moved the team into a scenario-based testing environment with excellent backend processes, test methodologies and ideas. I helped define the role of the team in the wider community and fought hard for the quality of the product. \n \nI bought together UCD, ID and some marketing elements to help audit what should be tested and was critical in bridging the gap between the design and test-understanding of the product which was impeded by the fast paced schedule of the first iteration of the product. I also helped bring together other teams to improve test practices for the product. I liaised with other internal teams to expand the usage of WESB in their testing and adopt some of the traditional reliability and endurance tests to improve production quality of the product. I also played a major role in the project planning for the SV phase, working with local and remote management. \n \nI had day-to-day responsibility for task definition, assignment and management for the testers, and provided technical leadership for all aspects of the SV workload.I was also the WESB representative on the Test Architects board (a fusion of test leads from WPS, WPS on z/Series, BPC and WID). I implemented ideas to aid the identification of coverage gaps between the different product testing teams and was instrumental in defining the role of this board, I worked hard to standardise RAS, Load and other best practice testing across the other teams. Software Engineer - WebSphere Products IBM January 2003  –  June 2005  (2 years 6 months) The majority of my time was spent on the C and C++ version of JMS (IBM Message Service Clients for C and C++ ). My responsibility was for the customer API, a role that required extensive work with the product architect to identify, define and code the different APIs on offer.  \n \nI also worked with the WMQ Broker team to re-write the NEON transformation nodes the removal of these dependent nodes and replacement with customer-generic NEON-based nodes was a significant cost and time saver for the product, improving its customer image. \n \nWebSphere Messaging Clients C/C++ \nWebSphere Enterprise Service Bus \nWebsphere Message Broker Development Lead - IBM Learning Village IBM September 1999  –  December 2002  (3 years 4 months) Raleigh-Durham, North Carolina Area Responsibilities: \n \n– Product design and architecture enhancements \n– Provided day-to-day leadership for development team of 10-12 staff, coding guidance and standards. \n– Project direction: working with the Education-ISU in EMEA and North America on requirements and direction of product content. \n– Localised Project Management: working with US based PM doing project planning and tracking. \n \nI identified architecture changes taking it from a single server, 100 user system to a multi-server, 1 million user system. I also worked with performance teams in the UK and USA to radically overhaul the product. I also set-up the test strategy, including handover to dedicated test leader, and worked in coaching roles for support staff in the US, field engineers and Education-ISU staff. I also helped develop and present a customer education event at Armonk and attended a number of architecture conferences at Yorktown including an executive presentation in Manhattan. IBM Consultant Riverdeep September 2001  –  October 2002  (1 year 2 months) Greater Seattle Area As part of my wider IBM Learning Village role (see below), I was sent on assignment to IBM Raleigh as a technical consultant helping transition the Learning Village product to a business partner, Riverdeep. My primary role was as technical consultant: making sure product content from the existing system made it into the new product. I was also involved with designing and implementing the data migration for existing users around the world.  \n \nAlthough based in Raleigh, all other members of the team were based at Riverdeep’s development centre in Redmond, WA. I shared my time between Raleigh and Redmond, with trips to other customer engagements as an ambassador for the product suite. I was the main IBM contact at the customer site, and provided the bridge between IBM management and the local business partner management teams. IT Specialist IBM Global Services January 1996  –  September 1999  (3 years 9 months) I joined IBM in January 1996 as a mature hire. My first four years were spent in the Insurance ISU working on various projects including mainframe to distributed application porting, Lotus Notes application design & development and e-business consultancy. I held several leadership roles during his time in the ISU and worked with customers to help them transition to the new e-business technology. IT Specialist Pearl Assurance October 1990  –  January 1996  (5 years 4 months) I held various positions within the IT department, the majority of these were in a development team lead role delivering customer management software and other insurance solutions. IBM Analytics Project Delivery Manager IBM December 2014  – Present (9 months) United Kingdom As a Project Delivery Manager within the IBM Analytics (Lab Services) practice, I am \ncurrently responsible for: \n \n• Successfully delivering both IBM Analytics and multiple brand IBM solutions to clients, \nleading both sales and delivery teams on high profile and large engagements across multiple \nbusiness sectors. \n• Supporting sales and technical pre-sales teams to accurately scope and define client \nservices requirements, providing priced proposals with project plans and estimates of effort and \nskills required. \n• Developing and maintaining commercial and delivery relationships with other IBM \ndivisions (e.g. Global Business Services) and also IBM business partners, providing management of both IBM and subcontractor resources during project delivery. \n• Identifying and securing appropriate consultancy resources using a wide network of \ninternal IBM and external relationships across all parts of the business. \n• Coordinating and resolving technical and support issues with IBM software using extensive understanding and knowledge of the IBM support organisation. \n• Project Managing delivery using IBM Analytics solution implementation methodologies \n• Successful completion of implementations including entire business intelligence \nstrategies and technical upgrades to projects containing many of the IBM Analytics \ntechnologies - such as Cognos BI, TM1, ICM (Varicent), CDM and IBM Watson IBM Analytics Project Delivery Manager IBM December 2014  – Present (9 months) United Kingdom As a Project Delivery Manager within the IBM Analytics (Lab Services) practice, I am \ncurrently responsible for: \n \n• Successfully delivering both IBM Analytics and multiple brand IBM solutions to clients, \nleading both sales and delivery teams on high profile and large engagements across multiple \nbusiness sectors. \n• Supporting sales and technical pre-sales teams to accurately scope and define client \nservices requirements, providing priced proposals with project plans and estimates of effort and \nskills required. \n• Developing and maintaining commercial and delivery relationships with other IBM \ndivisions (e.g. Global Business Services) and also IBM business partners, providing management of both IBM and subcontractor resources during project delivery. \n• Identifying and securing appropriate consultancy resources using a wide network of \ninternal IBM and external relationships across all parts of the business. \n• Coordinating and resolving technical and support issues with IBM software using extensive understanding and knowledge of the IBM support organisation. \n• Project Managing delivery using IBM Analytics solution implementation methodologies \n• Successful completion of implementations including entire business intelligence \nstrategies and technical upgrades to projects containing many of the IBM Analytics \ntechnologies - such as Cognos BI, TM1, ICM (Varicent), CDM and IBM Watson Product Release Manager (Europe), M&A Integration / IBM Risk Analytics IBM January 2012  –  December 2014  (3 years) United Kingdom As part of Algorithmics acquisition (now IBM Risk Analytics). I was responsible for the integration and release of EMEA based products within the portfolio. Risk Analytics has around 15 different products, some legacy, some in the early stages of their lifecycle. I was responsible for aligning these products with IBM’s PMOM project management model and adherence to the SWG Development Deliverables. I was the Product Team Lead for four major product areas bringing together the various executive roles (Marketing, Service, Finance, Pricing, etc.) to build the Offering Business plans and manage delivery of the products. \n \nAs one of the few heritage IBMers, I was also a key part of the acquisition integration from a social/personal aspect. With over 200 new IBMers coming in with the acquisition there were a number of challenges to this part of the integration. Risk Analytics is predominately Canadian based, and I played a key role as the EMEA based ambassador helping various IBM teams across Europe interact with the new teams, and vice-versa. \n \nPrior to joining the the acquisition I worked with over thirty different acquisitions or potential acquisitions. Some of these acquisitions went through the entire life-cycle from original concept approval through, and past, transfer-of-business, others did not progress beyond initial reviews. The role has included pre-close analysis; open source analysis and remediation; confirmation of third-party code through IBM's legal and release processes; intellectual property management in coordination with IBM legal. Product Release Manager (Europe), M&A Integration / IBM Risk Analytics IBM January 2012  –  December 2014  (3 years) United Kingdom As part of Algorithmics acquisition (now IBM Risk Analytics). I was responsible for the integration and release of EMEA based products within the portfolio. Risk Analytics has around 15 different products, some legacy, some in the early stages of their lifecycle. I was responsible for aligning these products with IBM’s PMOM project management model and adherence to the SWG Development Deliverables. I was the Product Team Lead for four major product areas bringing together the various executive roles (Marketing, Service, Finance, Pricing, etc.) to build the Offering Business plans and manage delivery of the products. \n \nAs one of the few heritage IBMers, I was also a key part of the acquisition integration from a social/personal aspect. With over 200 new IBMers coming in with the acquisition there were a number of challenges to this part of the integration. Risk Analytics is predominately Canadian based, and I played a key role as the EMEA based ambassador helping various IBM teams across Europe interact with the new teams, and vice-versa. \n \nPrior to joining the the acquisition I worked with over thirty different acquisitions or potential acquisitions. Some of these acquisitions went through the entire life-cycle from original concept approval through, and past, transfer-of-business, others did not progress beyond initial reviews. The role has included pre-close analysis; open source analysis and remediation; confirmation of third-party code through IBM's legal and release processes; intellectual property management in coordination with IBM legal. Project Manager, M&A Integration IBM February 2008  –  January 2012  (4 years) United Kingdom Part of IBM's Platform Technology Centre. \n \nIntegration of acquired Software and Technology companies into IBM from a technical perspective.  \n \nI joined the PTC to help setup a new M&A competency group. The mission of the PTC was to help internal-IBM projects to resolve their short-term development peaks (predominately to align with IBM software development requirements) in areas such as Globalization, Test-Infrastructure setup and hardening, platform porting and third-party product replacement.  \n \nI was responsible for the Strategy and Business Development for the PTC group and helped design and build additional offerings for the PTC to help IBM’s M&A Integration teams across the world. I helped position the PTC as the world-wide centre of competence for M&A integration within IBM from a third-party software perspective, growing the team from 5 to 40 people. I worked with IBM M&A Directors, technical DEs and Vice Presidents around the world to win acquisition integration business for the group and help both SWG and STG size and risk assess the integration of acquired products. \n \nAs part of the role, I was attached to the integration teams from across SWG and STG. This work often involved on-site analysis of a potential acquisition target (company or product), mainly done one-on-one with the company’s CTO/CEO under strict non-disclosure rules. I worked across Europe, North American and the Middle East on a variety of products and offerings. I attended acquisition due diligence meetings with IBM legal, IBM senior execs, target-company execs and external Legal counsel. Project Manager, M&A Integration IBM February 2008  –  January 2012  (4 years) United Kingdom Part of IBM's Platform Technology Centre. \n \nIntegration of acquired Software and Technology companies into IBM from a technical perspective.  \n \nI joined the PTC to help setup a new M&A competency group. The mission of the PTC was to help internal-IBM projects to resolve their short-term development peaks (predominately to align with IBM software development requirements) in areas such as Globalization, Test-Infrastructure setup and hardening, platform porting and third-party product replacement.  \n \nI was responsible for the Strategy and Business Development for the PTC group and helped design and build additional offerings for the PTC to help IBM’s M&A Integration teams across the world. I helped position the PTC as the world-wide centre of competence for M&A integration within IBM from a third-party software perspective, growing the team from 5 to 40 people. I worked with IBM M&A Directors, technical DEs and Vice Presidents around the world to win acquisition integration business for the group and help both SWG and STG size and risk assess the integration of acquired products. \n \nAs part of the role, I was attached to the integration teams from across SWG and STG. This work often involved on-site analysis of a potential acquisition target (company or product), mainly done one-on-one with the company’s CTO/CEO under strict non-disclosure rules. I worked across Europe, North American and the Middle East on a variety of products and offerings. I attended acquisition due diligence meetings with IBM legal, IBM senior execs, target-company execs and external Legal counsel. System Verification (SV) Test team leader for the WebSphere Enterprise Service Bus (WESB) product IBM June 2005  –  February 2008  (2 years 9 months) Initially the role involved working with the product architects and business representatives to pull together true-to-life business scenarios that helped to define the product content. This was a challenging role as there were many forces pushing the product in different directions, and I was instrumental in bringing the responsible parties to the table to define the requirements. \n \nI moved to the SV Test team and took over the team lead role. At this time, the test team was in need of transformation. I was instrumental in defining new test practices and moved the team into a scenario-based testing environment with excellent backend processes, test methodologies and ideas. I helped define the role of the team in the wider community and fought hard for the quality of the product. \n \nI bought together UCD, ID and some marketing elements to help audit what should be tested and was critical in bridging the gap between the design and test-understanding of the product which was impeded by the fast paced schedule of the first iteration of the product. I also helped bring together other teams to improve test practices for the product. I liaised with other internal teams to expand the usage of WESB in their testing and adopt some of the traditional reliability and endurance tests to improve production quality of the product. I also played a major role in the project planning for the SV phase, working with local and remote management. \n \nI had day-to-day responsibility for task definition, assignment and management for the testers, and provided technical leadership for all aspects of the SV workload.I was also the WESB representative on the Test Architects board (a fusion of test leads from WPS, WPS on z/Series, BPC and WID). I implemented ideas to aid the identification of coverage gaps between the different product testing teams and was instrumental in defining the role of this board, I worked hard to standardise RAS, Load and other best practice testing across the other teams. System Verification (SV) Test team leader for the WebSphere Enterprise Service Bus (WESB) product IBM June 2005  –  February 2008  (2 years 9 months) Initially the role involved working with the product architects and business representatives to pull together true-to-life business scenarios that helped to define the product content. This was a challenging role as there were many forces pushing the product in different directions, and I was instrumental in bringing the responsible parties to the table to define the requirements. \n \nI moved to the SV Test team and took over the team lead role. At this time, the test team was in need of transformation. I was instrumental in defining new test practices and moved the team into a scenario-based testing environment with excellent backend processes, test methodologies and ideas. I helped define the role of the team in the wider community and fought hard for the quality of the product. \n \nI bought together UCD, ID and some marketing elements to help audit what should be tested and was critical in bridging the gap between the design and test-understanding of the product which was impeded by the fast paced schedule of the first iteration of the product. I also helped bring together other teams to improve test practices for the product. I liaised with other internal teams to expand the usage of WESB in their testing and adopt some of the traditional reliability and endurance tests to improve production quality of the product. I also played a major role in the project planning for the SV phase, working with local and remote management. \n \nI had day-to-day responsibility for task definition, assignment and management for the testers, and provided technical leadership for all aspects of the SV workload.I was also the WESB representative on the Test Architects board (a fusion of test leads from WPS, WPS on z/Series, BPC and WID). I implemented ideas to aid the identification of coverage gaps between the different product testing teams and was instrumental in defining the role of this board, I worked hard to standardise RAS, Load and other best practice testing across the other teams. Software Engineer - WebSphere Products IBM January 2003  –  June 2005  (2 years 6 months) The majority of my time was spent on the C and C++ version of JMS (IBM Message Service Clients for C and C++ ). My responsibility was for the customer API, a role that required extensive work with the product architect to identify, define and code the different APIs on offer.  \n \nI also worked with the WMQ Broker team to re-write the NEON transformation nodes the removal of these dependent nodes and replacement with customer-generic NEON-based nodes was a significant cost and time saver for the product, improving its customer image. \n \nWebSphere Messaging Clients C/C++ \nWebSphere Enterprise Service Bus \nWebsphere Message Broker Software Engineer - WebSphere Products IBM January 2003  –  June 2005  (2 years 6 months) The majority of my time was spent on the C and C++ version of JMS (IBM Message Service Clients for C and C++ ). My responsibility was for the customer API, a role that required extensive work with the product architect to identify, define and code the different APIs on offer.  \n \nI also worked with the WMQ Broker team to re-write the NEON transformation nodes the removal of these dependent nodes and replacement with customer-generic NEON-based nodes was a significant cost and time saver for the product, improving its customer image. \n \nWebSphere Messaging Clients C/C++ \nWebSphere Enterprise Service Bus \nWebsphere Message Broker Development Lead - IBM Learning Village IBM September 1999  –  December 2002  (3 years 4 months) Raleigh-Durham, North Carolina Area Responsibilities: \n \n– Product design and architecture enhancements \n– Provided day-to-day leadership for development team of 10-12 staff, coding guidance and standards. \n– Project direction: working with the Education-ISU in EMEA and North America on requirements and direction of product content. \n– Localised Project Management: working with US based PM doing project planning and tracking. \n \nI identified architecture changes taking it from a single server, 100 user system to a multi-server, 1 million user system. I also worked with performance teams in the UK and USA to radically overhaul the product. I also set-up the test strategy, including handover to dedicated test leader, and worked in coaching roles for support staff in the US, field engineers and Education-ISU staff. I also helped develop and present a customer education event at Armonk and attended a number of architecture conferences at Yorktown including an executive presentation in Manhattan. Development Lead - IBM Learning Village IBM September 1999  –  December 2002  (3 years 4 months) Raleigh-Durham, North Carolina Area Responsibilities: \n \n– Product design and architecture enhancements \n– Provided day-to-day leadership for development team of 10-12 staff, coding guidance and standards. \n– Project direction: working with the Education-ISU in EMEA and North America on requirements and direction of product content. \n– Localised Project Management: working with US based PM doing project planning and tracking. \n \nI identified architecture changes taking it from a single server, 100 user system to a multi-server, 1 million user system. I also worked with performance teams in the UK and USA to radically overhaul the product. I also set-up the test strategy, including handover to dedicated test leader, and worked in coaching roles for support staff in the US, field engineers and Education-ISU staff. I also helped develop and present a customer education event at Armonk and attended a number of architecture conferences at Yorktown including an executive presentation in Manhattan. IBM Consultant Riverdeep September 2001  –  October 2002  (1 year 2 months) Greater Seattle Area As part of my wider IBM Learning Village role (see below), I was sent on assignment to IBM Raleigh as a technical consultant helping transition the Learning Village product to a business partner, Riverdeep. My primary role was as technical consultant: making sure product content from the existing system made it into the new product. I was also involved with designing and implementing the data migration for existing users around the world.  \n \nAlthough based in Raleigh, all other members of the team were based at Riverdeep’s development centre in Redmond, WA. I shared my time between Raleigh and Redmond, with trips to other customer engagements as an ambassador for the product suite. I was the main IBM contact at the customer site, and provided the bridge between IBM management and the local business partner management teams. IBM Consultant Riverdeep September 2001  –  October 2002  (1 year 2 months) Greater Seattle Area As part of my wider IBM Learning Village role (see below), I was sent on assignment to IBM Raleigh as a technical consultant helping transition the Learning Village product to a business partner, Riverdeep. My primary role was as technical consultant: making sure product content from the existing system made it into the new product. I was also involved with designing and implementing the data migration for existing users around the world.  \n \nAlthough based in Raleigh, all other members of the team were based at Riverdeep’s development centre in Redmond, WA. I shared my time between Raleigh and Redmond, with trips to other customer engagements as an ambassador for the product suite. I was the main IBM contact at the customer site, and provided the bridge between IBM management and the local business partner management teams. IT Specialist IBM Global Services January 1996  –  September 1999  (3 years 9 months) I joined IBM in January 1996 as a mature hire. My first four years were spent in the Insurance ISU working on various projects including mainframe to distributed application porting, Lotus Notes application design & development and e-business consultancy. I held several leadership roles during his time in the ISU and worked with customers to help them transition to the new e-business technology. IT Specialist IBM Global Services January 1996  –  September 1999  (3 years 9 months) I joined IBM in January 1996 as a mature hire. My first four years were spent in the Insurance ISU working on various projects including mainframe to distributed application porting, Lotus Notes application design & development and e-business consultancy. I held several leadership roles during his time in the ISU and worked with customers to help them transition to the new e-business technology. IT Specialist Pearl Assurance October 1990  –  January 1996  (5 years 4 months) I held various positions within the IT department, the majority of these were in a development team lead role delivering customer management software and other insurance solutions. IT Specialist Pearl Assurance October 1990  –  January 1996  (5 years 4 months) I held various positions within the IT department, the majority of these were in a development team lead role delivering customer management software and other insurance solutions. Languages   Skills Business Strategy Marketing Strategy Mergers Acquisition Integration Open Source Software Intellectual Property Software Engineering Integration Strategy Enterprise Software Software Development Websphere Mergers & Acquisitions Management Software Project... Enterprise Architecture Business Process Project Management Business Intelligence SDLC Software Quality... Architecture SOA Agile Methodologies See 9+     See less Skills  Business Strategy Marketing Strategy Mergers Acquisition Integration Open Source Software Intellectual Property Software Engineering Integration Strategy Enterprise Software Software Development Websphere Mergers & Acquisitions Management Software Project... Enterprise Architecture Business Process Project Management Business Intelligence SDLC Software Quality... Architecture SOA Agile Methodologies See 9+     See less Business Strategy Marketing Strategy Mergers Acquisition Integration Open Source Software Intellectual Property Software Engineering Integration Strategy Enterprise Software Software Development Websphere Mergers & Acquisitions Management Software Project... Enterprise Architecture Business Process Project Management Business Intelligence SDLC Software Quality... Architecture SOA Agile Methodologies See 9+     See less Business Strategy Marketing Strategy Mergers Acquisition Integration Open Source Software Intellectual Property Software Engineering Integration Strategy Enterprise Software Software Development Websphere Mergers & Acquisitions Management Software Project... Enterprise Architecture Business Process Project Management Business Intelligence SDLC Software Quality... Architecture SOA Agile Methodologies See 9+     See less Education University of Warwick - Warwick Business School MBA,  Business Administration 2007  – 2010 Spalding Grammar School General 1982  – 1989 University of Warwick - Warwick Business School MBA,  Business Administration 2007  – 2010 University of Warwick - Warwick Business School MBA,  Business Administration 2007  – 2010 University of Warwick - Warwick Business School MBA,  Business Administration 2007  – 2010 Spalding Grammar School General 1982  – 1989 Spalding Grammar School General 1982  – 1989 Spalding Grammar School General 1982  – 1989 Honors & Awards Outstanding Technical Achievement Award IBM Additional Honors & Awards MBCS CITP (Chartered IT Professional - Member, British Computer Society) \nMIET (Member, Institute of Engineering and Technology) \n2 IBM Bravo Awards, 2 IBM Recognition Awards. \nIBM Accredited Senior IT Specialist Outstanding Technical Achievement Award IBM Outstanding Technical Achievement Award IBM Outstanding Technical Achievement Award IBM Additional Honors & Awards MBCS CITP (Chartered IT Professional - Member, British Computer Society) \nMIET (Member, Institute of Engineering and Technology) \n2 IBM Bravo Awards, 2 IBM Recognition Awards. \nIBM Accredited Senior IT Specialist Additional Honors & Awards MBCS CITP (Chartered IT Professional - Member, British Computer Society) \nMIET (Member, Institute of Engineering and Technology) \n2 IBM Bravo Awards, 2 IBM Recognition Awards. \nIBM Accredited Senior IT Specialist Additional Honors & Awards MBCS CITP (Chartered IT Professional - Member, British Computer Society) \nMIET (Member, Institute of Engineering and Technology) \n2 IBM Bravo Awards, 2 IBM Recognition Awards. \nIBM Accredited Senior IT Specialist ", "Skills Business Strategy Product Management M&A experience Acquisition Integration Banking Strategy Development Management Consulting Strategic Planning Executive Management Process Improvement Strategy IT Strategy Outsourcing Management Business Transformation Mergers & Acquisitions Finance Program Management Enterprise Software Leadership Strategic Partnerships Start-ups Cloud Computing Consulting Integration Cross-functional Team... Business Process... Financial Services See 13+     See less Skills  Business Strategy Product Management M&A experience Acquisition Integration Banking Strategy Development Management Consulting Strategic Planning Executive Management Process Improvement Strategy IT Strategy Outsourcing Management Business Transformation Mergers & Acquisitions Finance Program Management Enterprise Software Leadership Strategic Partnerships Start-ups Cloud Computing Consulting Integration Cross-functional Team... Business Process... Financial Services See 13+     See less Business Strategy Product Management M&A experience Acquisition Integration Banking Strategy Development Management Consulting Strategic Planning Executive Management Process Improvement Strategy IT Strategy Outsourcing Management Business Transformation Mergers & Acquisitions Finance Program Management Enterprise Software Leadership Strategic Partnerships Start-ups Cloud Computing Consulting Integration Cross-functional Team... Business Process... Financial Services See 13+     See less Business Strategy Product Management M&A experience Acquisition Integration Banking Strategy Development Management Consulting Strategic Planning Executive Management Process Improvement Strategy IT Strategy Outsourcing Management Business Transformation Mergers & Acquisitions Finance Program Management Enterprise Software Leadership Strategic Partnerships Start-ups Cloud Computing Consulting Integration Cross-functional Team... Business Process... Financial Services See 13+     See less ", "Summary A versatile and self starting global leader with a reputation for delivering on challenging and multi-faceted projects in an organized and self-directed manner. \n \nSpecialties: Six Sigma Green Belt Certified Summary A versatile and self starting global leader with a reputation for delivering on challenging and multi-faceted projects in an organized and self-directed manner. \n \nSpecialties: Six Sigma Green Belt Certified A versatile and self starting global leader with a reputation for delivering on challenging and multi-faceted projects in an organized and self-directed manner. \n \nSpecialties: Six Sigma Green Belt Certified A versatile and self starting global leader with a reputation for delivering on challenging and multi-faceted projects in an organized and self-directed manner. \n \nSpecialties: Six Sigma Green Belt Certified Experience Agile Program Manager Carbonite July 2015  – Present (2 months) Greater Boston Area Director, Operations Avaya September 2014  –  July 2015  (11 months) Billerica, Ma Manage global team of 75+ union, non-union, and contractor employees across multiple locations including Billerica (MA), Denver, Oklahoma City, Hungary (Budapest), and India (Pune). \n \nFunctional ownership includes the Global Product Registration process (including technical on boarding), Global Customer Master Data Management, Global Customer Records Management (install base), customer connectivity, and customer Technical Onboarding. My teams have also had a keen focus on overall Avaya ease of doing business, specifically in the quote to cash process. \n \nResponsibilities include daily interaction with Avaya Business Partners, queue/labor/workload management, process optimization, escalation resolution, measurement system creation and execution as well as tool requirements/roadmap development, user acceptance testing, and release sign off. \n \nKey accomplishments: \n• Drove 12 week collaboration between operations and development teams to automate and simplify components of customer on-boarding process; resulted in 80% reduction in ticket backlog and 60% reduction in processing time just 2 months after release \n• Improved customer registration tool usage by ~500% in 2 years through process simplification and tool enhancements; enabled self service by building a simple and easy to use knowledge base that received ~50k hits in 1 year with avg. article rating of 4/5 \n• Optimized customer connectivity resolution process to reduce ticket backlog by 94% and turnaround time by 90% in 1.5 years \n• Helped drive ~$1M of incremental annual services revenue in just 6 months through mining and correction of customer records \n• Consolidated customer master data processes from 5 procedures across 4 teams and regions to 1 global process under 1 team \n Senior Manager, Operations Avaya January 2013  –  September 2014  (1 year 9 months) Billerica, Ma Manage global team of 50+ union and non-union represented employees across multiple locations including Denver, Oklahoma City, Hungary (Budapest), and India (Pune). \n \nFunctional ownership includes the Global Product Registration process (including technical on boarding), Customer Master Data Management (including services equipment and entitlement records), polling/connectivity issue resolution, and Letter of Agency administration. \n \nResponsibilities include daily interaction with Avaya Business Partners, escalation resolution, measurement system creation and execution as well as automation tool requirements development, testing, and sign off. Senior Manager, Strategic Operations Avaya August 2011  –  January 2013  (1 year 6 months) Waltham, Ma • Provided direct operational support to the President of Avaya Client Services to ensure preparedness for all company and staff level meetings including board of directors, monthly/quarterly business reviews, revenue forecasting calls, and all hands calls \n \n• Maintained services performance measurement system including a dashboard with 50+ financial and operational metrics, “analyst” reports distributed to senior leadership, and regular corporate strategy alignment \n \n• Co-managed a project that helped push client remote connectivity adoption levels from 30% to nearly 60% in 15 months \n \n• Created or compiled 100+ executive level presentations over 16 month period; many exposed to CEO & Board of Directors  Business Analyst, M&A Integration IBM August 2008  –  August 2011  (3 years 1 month) Spent 3 years as an analyst supporting the integration of more than 7 acquisitions. \n \nIndependently developed, maintained, and provided training for over a dozen unique business tools using excel and visual basic including channel pricing tools for more than 5 acquisitions.  \n \nCollaborated with IBM’s Systems and Technology Group as a project manager to successfully implement a global resource management tool comprised of over 400 Business Analytics Services users in just 3 months.  \n \nCreated a Lotus Notes based application from the ground up to replace a key legacy system for the Guardium acquisition; managed tremendous amount of team pressure to successfully deliver in less than 4 months. Performed original research on requirements, documented work, collaborated directly with a professional Lotus Notes developer, and obtained rigorous internal business controls certification. Market Researcher Xtralis Inc June 2007  –  August 2007  (3 months) Marketing/Telemarketing Vision BioSystems May 2006  –  May 2007  (1 year 1 month) Agile Program Manager Carbonite July 2015  – Present (2 months) Greater Boston Area Agile Program Manager Carbonite July 2015  – Present (2 months) Greater Boston Area Director, Operations Avaya September 2014  –  July 2015  (11 months) Billerica, Ma Manage global team of 75+ union, non-union, and contractor employees across multiple locations including Billerica (MA), Denver, Oklahoma City, Hungary (Budapest), and India (Pune). \n \nFunctional ownership includes the Global Product Registration process (including technical on boarding), Global Customer Master Data Management, Global Customer Records Management (install base), customer connectivity, and customer Technical Onboarding. My teams have also had a keen focus on overall Avaya ease of doing business, specifically in the quote to cash process. \n \nResponsibilities include daily interaction with Avaya Business Partners, queue/labor/workload management, process optimization, escalation resolution, measurement system creation and execution as well as tool requirements/roadmap development, user acceptance testing, and release sign off. \n \nKey accomplishments: \n• Drove 12 week collaboration between operations and development teams to automate and simplify components of customer on-boarding process; resulted in 80% reduction in ticket backlog and 60% reduction in processing time just 2 months after release \n• Improved customer registration tool usage by ~500% in 2 years through process simplification and tool enhancements; enabled self service by building a simple and easy to use knowledge base that received ~50k hits in 1 year with avg. article rating of 4/5 \n• Optimized customer connectivity resolution process to reduce ticket backlog by 94% and turnaround time by 90% in 1.5 years \n• Helped drive ~$1M of incremental annual services revenue in just 6 months through mining and correction of customer records \n• Consolidated customer master data processes from 5 procedures across 4 teams and regions to 1 global process under 1 team \n Director, Operations Avaya September 2014  –  July 2015  (11 months) Billerica, Ma Manage global team of 75+ union, non-union, and contractor employees across multiple locations including Billerica (MA), Denver, Oklahoma City, Hungary (Budapest), and India (Pune). \n \nFunctional ownership includes the Global Product Registration process (including technical on boarding), Global Customer Master Data Management, Global Customer Records Management (install base), customer connectivity, and customer Technical Onboarding. My teams have also had a keen focus on overall Avaya ease of doing business, specifically in the quote to cash process. \n \nResponsibilities include daily interaction with Avaya Business Partners, queue/labor/workload management, process optimization, escalation resolution, measurement system creation and execution as well as tool requirements/roadmap development, user acceptance testing, and release sign off. \n \nKey accomplishments: \n• Drove 12 week collaboration between operations and development teams to automate and simplify components of customer on-boarding process; resulted in 80% reduction in ticket backlog and 60% reduction in processing time just 2 months after release \n• Improved customer registration tool usage by ~500% in 2 years through process simplification and tool enhancements; enabled self service by building a simple and easy to use knowledge base that received ~50k hits in 1 year with avg. article rating of 4/5 \n• Optimized customer connectivity resolution process to reduce ticket backlog by 94% and turnaround time by 90% in 1.5 years \n• Helped drive ~$1M of incremental annual services revenue in just 6 months through mining and correction of customer records \n• Consolidated customer master data processes from 5 procedures across 4 teams and regions to 1 global process under 1 team \n Senior Manager, Operations Avaya January 2013  –  September 2014  (1 year 9 months) Billerica, Ma Manage global team of 50+ union and non-union represented employees across multiple locations including Denver, Oklahoma City, Hungary (Budapest), and India (Pune). \n \nFunctional ownership includes the Global Product Registration process (including technical on boarding), Customer Master Data Management (including services equipment and entitlement records), polling/connectivity issue resolution, and Letter of Agency administration. \n \nResponsibilities include daily interaction with Avaya Business Partners, escalation resolution, measurement system creation and execution as well as automation tool requirements development, testing, and sign off. Senior Manager, Operations Avaya January 2013  –  September 2014  (1 year 9 months) Billerica, Ma Manage global team of 50+ union and non-union represented employees across multiple locations including Denver, Oklahoma City, Hungary (Budapest), and India (Pune). \n \nFunctional ownership includes the Global Product Registration process (including technical on boarding), Customer Master Data Management (including services equipment and entitlement records), polling/connectivity issue resolution, and Letter of Agency administration. \n \nResponsibilities include daily interaction with Avaya Business Partners, escalation resolution, measurement system creation and execution as well as automation tool requirements development, testing, and sign off. Senior Manager, Strategic Operations Avaya August 2011  –  January 2013  (1 year 6 months) Waltham, Ma • Provided direct operational support to the President of Avaya Client Services to ensure preparedness for all company and staff level meetings including board of directors, monthly/quarterly business reviews, revenue forecasting calls, and all hands calls \n \n• Maintained services performance measurement system including a dashboard with 50+ financial and operational metrics, “analyst” reports distributed to senior leadership, and regular corporate strategy alignment \n \n• Co-managed a project that helped push client remote connectivity adoption levels from 30% to nearly 60% in 15 months \n \n• Created or compiled 100+ executive level presentations over 16 month period; many exposed to CEO & Board of Directors  Senior Manager, Strategic Operations Avaya August 2011  –  January 2013  (1 year 6 months) Waltham, Ma • Provided direct operational support to the President of Avaya Client Services to ensure preparedness for all company and staff level meetings including board of directors, monthly/quarterly business reviews, revenue forecasting calls, and all hands calls \n \n• Maintained services performance measurement system including a dashboard with 50+ financial and operational metrics, “analyst” reports distributed to senior leadership, and regular corporate strategy alignment \n \n• Co-managed a project that helped push client remote connectivity adoption levels from 30% to nearly 60% in 15 months \n \n• Created or compiled 100+ executive level presentations over 16 month period; many exposed to CEO & Board of Directors  Business Analyst, M&A Integration IBM August 2008  –  August 2011  (3 years 1 month) Spent 3 years as an analyst supporting the integration of more than 7 acquisitions. \n \nIndependently developed, maintained, and provided training for over a dozen unique business tools using excel and visual basic including channel pricing tools for more than 5 acquisitions.  \n \nCollaborated with IBM’s Systems and Technology Group as a project manager to successfully implement a global resource management tool comprised of over 400 Business Analytics Services users in just 3 months.  \n \nCreated a Lotus Notes based application from the ground up to replace a key legacy system for the Guardium acquisition; managed tremendous amount of team pressure to successfully deliver in less than 4 months. Performed original research on requirements, documented work, collaborated directly with a professional Lotus Notes developer, and obtained rigorous internal business controls certification. Business Analyst, M&A Integration IBM August 2008  –  August 2011  (3 years 1 month) Spent 3 years as an analyst supporting the integration of more than 7 acquisitions. \n \nIndependently developed, maintained, and provided training for over a dozen unique business tools using excel and visual basic including channel pricing tools for more than 5 acquisitions.  \n \nCollaborated with IBM’s Systems and Technology Group as a project manager to successfully implement a global resource management tool comprised of over 400 Business Analytics Services users in just 3 months.  \n \nCreated a Lotus Notes based application from the ground up to replace a key legacy system for the Guardium acquisition; managed tremendous amount of team pressure to successfully deliver in less than 4 months. Performed original research on requirements, documented work, collaborated directly with a professional Lotus Notes developer, and obtained rigorous internal business controls certification. Market Researcher Xtralis Inc June 2007  –  August 2007  (3 months) Market Researcher Xtralis Inc June 2007  –  August 2007  (3 months) Marketing/Telemarketing Vision BioSystems May 2006  –  May 2007  (1 year 1 month) Marketing/Telemarketing Vision BioSystems May 2006  –  May 2007  (1 year 1 month) Skills Project Management Data Analysis Microsoft Office Project Planning Market Research Process Improvement Microsoft Excel Account Management Cross-functional Team... Mergers & Acquisitions Integration Business Analysis Program Management Business Development Leadership Analysis Management Vendor Management Strategic Planning Executive Management See 5+     See less Skills  Project Management Data Analysis Microsoft Office Project Planning Market Research Process Improvement Microsoft Excel Account Management Cross-functional Team... Mergers & Acquisitions Integration Business Analysis Program Management Business Development Leadership Analysis Management Vendor Management Strategic Planning Executive Management See 5+     See less Project Management Data Analysis Microsoft Office Project Planning Market Research Process Improvement Microsoft Excel Account Management Cross-functional Team... Mergers & Acquisitions Integration Business Analysis Program Management Business Development Leadership Analysis Management Vendor Management Strategic Planning Executive Management See 5+     See less Project Management Data Analysis Microsoft Office Project Planning Market Research Process Improvement Microsoft Excel Account Management Cross-functional Team... Mergers & Acquisitions Integration Business Analysis Program Management Business Development Leadership Analysis Management Vendor Management Strategic Planning Executive Management See 5+     See less Education Boston University Questrom School of Business BSBA,  Operations and Technology Mgt. 2004  – 2008 Summa Cum Laude \nTop Operations and Technology Mgt. Concentrator Activities and Societies:  Beta Gamma Sigma ,  Student Government ,  Operations Management Club Cardinal Spellman High School 2000  – 2004 Boston University Questrom School of Business BSBA,  Operations and Technology Mgt. 2004  – 2008 Summa Cum Laude \nTop Operations and Technology Mgt. Concentrator Activities and Societies:  Beta Gamma Sigma ,  Student Government ,  Operations Management Club Boston University Questrom School of Business BSBA,  Operations and Technology Mgt. 2004  – 2008 Summa Cum Laude \nTop Operations and Technology Mgt. Concentrator Activities and Societies:  Beta Gamma Sigma ,  Student Government ,  Operations Management Club Boston University Questrom School of Business BSBA,  Operations and Technology Mgt. 2004  – 2008 Summa Cum Laude \nTop Operations and Technology Mgt. Concentrator Activities and Societies:  Beta Gamma Sigma ,  Student Government ,  Operations Management Club Cardinal Spellman High School 2000  – 2004 Cardinal Spellman High School 2000  – 2004 Cardinal Spellman High School 2000  – 2004 ", "Summary A technology executive with a strong technical and business background, experience in leading large global teams, and solving complex challenges. Proven capability of developing strategies, and leading product management, marketing, software development, industry solutions, and M&A integration. Recognized for negotiating partnerships, and driving successful turnarounds and product launches.  \nExperienced in working with vertical industries including Finance, HPC, Telecommunications, Healthcare. Technically astute in cloud computing, virtualization, high performance computing, and multicore embedded solutions. Specialties:Cloud Computing and Virtualization, ISV Enablement & Business Development, Product Management, IT Service Management, M&A Integration, IP Licensing, Academic Programs, Strategy, Strategic Alliance & Channel Management, Building and Managing Global Teams Summary A technology executive with a strong technical and business background, experience in leading large global teams, and solving complex challenges. Proven capability of developing strategies, and leading product management, marketing, software development, industry solutions, and M&A integration. Recognized for negotiating partnerships, and driving successful turnarounds and product launches.  \nExperienced in working with vertical industries including Finance, HPC, Telecommunications, Healthcare. Technically astute in cloud computing, virtualization, high performance computing, and multicore embedded solutions. Specialties:Cloud Computing and Virtualization, ISV Enablement & Business Development, Product Management, IT Service Management, M&A Integration, IP Licensing, Academic Programs, Strategy, Strategic Alliance & Channel Management, Building and Managing Global Teams A technology executive with a strong technical and business background, experience in leading large global teams, and solving complex challenges. Proven capability of developing strategies, and leading product management, marketing, software development, industry solutions, and M&A integration. Recognized for negotiating partnerships, and driving successful turnarounds and product launches.  \nExperienced in working with vertical industries including Finance, HPC, Telecommunications, Healthcare. Technically astute in cloud computing, virtualization, high performance computing, and multicore embedded solutions. Specialties:Cloud Computing and Virtualization, ISV Enablement & Business Development, Product Management, IT Service Management, M&A Integration, IP Licensing, Academic Programs, Strategy, Strategic Alliance & Channel Management, Building and Managing Global Teams A technology executive with a strong technical and business background, experience in leading large global teams, and solving complex challenges. Proven capability of developing strategies, and leading product management, marketing, software development, industry solutions, and M&A integration. Recognized for negotiating partnerships, and driving successful turnarounds and product launches.  \nExperienced in working with vertical industries including Finance, HPC, Telecommunications, Healthcare. Technically astute in cloud computing, virtualization, high performance computing, and multicore embedded solutions. Specialties:Cloud Computing and Virtualization, ISV Enablement & Business Development, Product Management, IT Service Management, M&A Integration, IP Licensing, Academic Programs, Strategy, Strategic Alliance & Channel Management, Building and Managing Global Teams Experience Business Development Executive, Healthcare Alliances IBM April 2011  – Present (4 years 5 months) Director, Cloud Computing Product Management IBM Tivoli Software January 2009  –  March 2010  (1 year 3 months) Own overall strategy and product management across IBM's Service Management Portfolio to build and deliver cloud management solutions for private, public and hybrid clouds for enterprises, and MSPs. Director, M&A Integration IBM October 2008  –  January 2010  (1 year 4 months) In charge of integrating an aquisition - Transitive, into IBM. Transitive was a company providing cross virtualization software through dynamic binary translation. Director, Emerging Technology Market Development IBM August 2004  –  2008  (4 years) Executive Staff to Senior VP IBM July 2003  –  July 2004  (1 year 1 month) Growth Assignment providing an opportunity to work with senior executives within IBM. Managed all internal, external communications including keynotes, press and analysts briefings. Led conception and funding on industry solutions initiative within division. Program Director, ISV Enablement and Marketing IBM January 2000  –  June 2003  (3 years 6 months) 2’nd Line Manager, ISV Enablement, for IBM's Server Lines Senior Software Development Manager IBM 1994  –  1997  (3 years) Business Development Executive, Healthcare Alliances IBM April 2011  – Present (4 years 5 months) Business Development Executive, Healthcare Alliances IBM April 2011  – Present (4 years 5 months) Director, Cloud Computing Product Management IBM Tivoli Software January 2009  –  March 2010  (1 year 3 months) Own overall strategy and product management across IBM's Service Management Portfolio to build and deliver cloud management solutions for private, public and hybrid clouds for enterprises, and MSPs. Director, Cloud Computing Product Management IBM Tivoli Software January 2009  –  March 2010  (1 year 3 months) Own overall strategy and product management across IBM's Service Management Portfolio to build and deliver cloud management solutions for private, public and hybrid clouds for enterprises, and MSPs. Director, M&A Integration IBM October 2008  –  January 2010  (1 year 4 months) In charge of integrating an aquisition - Transitive, into IBM. Transitive was a company providing cross virtualization software through dynamic binary translation. Director, M&A Integration IBM October 2008  –  January 2010  (1 year 4 months) In charge of integrating an aquisition - Transitive, into IBM. Transitive was a company providing cross virtualization software through dynamic binary translation. Director, Emerging Technology Market Development IBM August 2004  –  2008  (4 years) Director, Emerging Technology Market Development IBM August 2004  –  2008  (4 years) Executive Staff to Senior VP IBM July 2003  –  July 2004  (1 year 1 month) Growth Assignment providing an opportunity to work with senior executives within IBM. Managed all internal, external communications including keynotes, press and analysts briefings. Led conception and funding on industry solutions initiative within division. Executive Staff to Senior VP IBM July 2003  –  July 2004  (1 year 1 month) Growth Assignment providing an opportunity to work with senior executives within IBM. Managed all internal, external communications including keynotes, press and analysts briefings. Led conception and funding on industry solutions initiative within division. Program Director, ISV Enablement and Marketing IBM January 2000  –  June 2003  (3 years 6 months) 2’nd Line Manager, ISV Enablement, for IBM's Server Lines Program Director, ISV Enablement and Marketing IBM January 2000  –  June 2003  (3 years 6 months) 2’nd Line Manager, ISV Enablement, for IBM's Server Lines Senior Software Development Manager IBM 1994  –  1997  (3 years) Senior Software Development Manager IBM 1994  –  1997  (3 years) Languages English Native or bilingual proficiency Hindi Professional working proficiency Gujarati Full professional proficiency English Native or bilingual proficiency Hindi Professional working proficiency Gujarati Full professional proficiency English Native or bilingual proficiency Hindi Professional working proficiency Gujarati Full professional proficiency Native or bilingual proficiency Professional working proficiency Full professional proficiency Skills Product Management IT Service Management Strategy Mergers Intellectual Property Cloud Computing SaaS Business Alliances Sales Enablement Enterprise Software Go-to-market Strategy Virtualization Business Development IT Strategy Mergers & Acquisitions Managed Services Program Management Executive Management Mobile Devices Cross-functional Team... Integration Distributed Systems Requirements Analysis Product Marketing Strategic Alliances Software Development Solution Selling Management Partner Management Thought Leadership Business Intelligence Storage Demand Generation Channel Partners Enterprise Architecture Telecommunications Leadership Solution Architecture Outsourcing Pre-sales Professional Services Strategic Partnerships Software Industry Wireless CRM Data Center Big Data Vendor Management IT Outsourcing Start-ups See 35+     See less Skills  Product Management IT Service Management Strategy Mergers Intellectual Property Cloud Computing SaaS Business Alliances Sales Enablement Enterprise Software Go-to-market Strategy Virtualization Business Development IT Strategy Mergers & Acquisitions Managed Services Program Management Executive Management Mobile Devices Cross-functional Team... Integration Distributed Systems Requirements Analysis Product Marketing Strategic Alliances Software Development Solution Selling Management Partner Management Thought Leadership Business Intelligence Storage Demand Generation Channel Partners Enterprise Architecture Telecommunications Leadership Solution Architecture Outsourcing Pre-sales Professional Services Strategic Partnerships Software Industry Wireless CRM Data Center Big Data Vendor Management IT Outsourcing Start-ups See 35+     See less Product Management IT Service Management Strategy Mergers Intellectual Property Cloud Computing SaaS Business Alliances Sales Enablement Enterprise Software Go-to-market Strategy Virtualization Business Development IT Strategy Mergers & Acquisitions Managed Services Program Management Executive Management Mobile Devices Cross-functional Team... Integration Distributed Systems Requirements Analysis Product Marketing Strategic Alliances Software Development Solution Selling Management Partner Management Thought Leadership Business Intelligence Storage Demand Generation Channel Partners Enterprise Architecture Telecommunications Leadership Solution Architecture Outsourcing Pre-sales Professional Services Strategic Partnerships Software Industry Wireless CRM Data Center Big Data Vendor Management IT Outsourcing Start-ups See 35+     See less Product Management IT Service Management Strategy Mergers Intellectual Property Cloud Computing SaaS Business Alliances Sales Enablement Enterprise Software Go-to-market Strategy Virtualization Business Development IT Strategy Mergers & Acquisitions Managed Services Program Management Executive Management Mobile Devices Cross-functional Team... Integration Distributed Systems Requirements Analysis Product Marketing Strategic Alliances Software Development Solution Selling Management Partner Management Thought Leadership Business Intelligence Storage Demand Generation Channel Partners Enterprise Architecture Telecommunications Leadership Solution Architecture Outsourcing Pre-sales Professional Services Strategic Partnerships Software Industry Wireless CRM Data Center Big Data Vendor Management IT Outsourcing Start-ups See 35+     See less Education The University of Texas at Austin Institute for Managerial Leadership 1994  – 1995 University of Kentucky MS,  Computer Science 1982  – 1987 The University of Texas at Austin Institute for Managerial Leadership 1994  – 1995 The University of Texas at Austin Institute for Managerial Leadership 1994  – 1995 The University of Texas at Austin Institute for Managerial Leadership 1994  – 1995 University of Kentucky MS,  Computer Science 1982  – 1987 University of Kentucky MS,  Computer Science 1982  – 1987 University of Kentucky MS,  Computer Science 1982  – 1987 ", "Skills Organizational... Talent Management Organizational Change Change Management Performance Management Strategy Organizational Design Talent Acquisition Organizational... Leadership Management Personnel Management Acquisition Integration Consulting Critical Thinking Start-ups CRM Human Resources Governance Interviews Mergers  Training Mergers & Acquisitions See 8+     See less Skills  Organizational... Talent Management Organizational Change Change Management Performance Management Strategy Organizational Design Talent Acquisition Organizational... Leadership Management Personnel Management Acquisition Integration Consulting Critical Thinking Start-ups CRM Human Resources Governance Interviews Mergers  Training Mergers & Acquisitions See 8+     See less Organizational... Talent Management Organizational Change Change Management Performance Management Strategy Organizational Design Talent Acquisition Organizational... Leadership Management Personnel Management Acquisition Integration Consulting Critical Thinking Start-ups CRM Human Resources Governance Interviews Mergers  Training Mergers & Acquisitions See 8+     See less Organizational... Talent Management Organizational Change Change Management Performance Management Strategy Organizational Design Talent Acquisition Organizational... Leadership Management Personnel Management Acquisition Integration Consulting Critical Thinking Start-ups CRM Human Resources Governance Interviews Mergers  Training Mergers & Acquisitions See 8+     See less ", "Summary Broad experience managing multiple tasks/projects with proven ability to focus in a fast paced environment and meet deadlines. Organized, fast learner with expertise in corporate treasury operations and institutional sales/trading. Specialties:Treasury operations -cash management, commercial paper issuance and investments. Summary Broad experience managing multiple tasks/projects with proven ability to focus in a fast paced environment and meet deadlines. Organized, fast learner with expertise in corporate treasury operations and institutional sales/trading. Specialties:Treasury operations -cash management, commercial paper issuance and investments. Broad experience managing multiple tasks/projects with proven ability to focus in a fast paced environment and meet deadlines. Organized, fast learner with expertise in corporate treasury operations and institutional sales/trading. Specialties:Treasury operations -cash management, commercial paper issuance and investments. Broad experience managing multiple tasks/projects with proven ability to focus in a fast paced environment and meet deadlines. Organized, fast learner with expertise in corporate treasury operations and institutional sales/trading. Specialties:Treasury operations -cash management, commercial paper issuance and investments. Experience Corporate Treasury - US Cash Management IBM May 2009  – Present (6 years 4 months) Armonk, NY Lead IBM’s global treasury transformation project for US Cash Management and provide ongoing support to Treasury Operations worldwide. Corporate Treasury/Global Business Services - Treasury Consultant to IBM China Customer IBM November 2008  –  April 2009  (6 months) Shenzhen, China Worked for IBM Global Business Services on treasury transformation project at Customer's headquarters in Shenzhen, China. Corporate Treasury – M&A Integration IBM January 2008  –  October 2008  (10 months) Armonk, NY Co-Lead Corporate Treasury’s integration effort of acquired company’s treasury functions. Corporate Treasury - US Cash Management IBM 2006  –  2008  (2 years) Armonk, NY Program manager overseeing US cash management operations. Corporate Treasury - Banking Relations IBM 2003  –  2006  (3 years) Armonk, NY Program manager responsible for establishing and maintaining banking relationships for IBM Treasury. Corporate Treasury - Senior Dealer, Money Market Desk IBM 1997  –  2003  (6 years) Armonk, NY Responsible for the management of IBM’s U.S. Short Term Funding and Investment Portfolio. Money Market Trader Nordbanken 1988  –  1995  (7 years) Money Market Trader Banco de Bilbao 1985  –  1988  (3 years) Corporate Treasury - US Cash Management IBM May 2009  – Present (6 years 4 months) Armonk, NY Lead IBM’s global treasury transformation project for US Cash Management and provide ongoing support to Treasury Operations worldwide. Corporate Treasury - US Cash Management IBM May 2009  – Present (6 years 4 months) Armonk, NY Lead IBM’s global treasury transformation project for US Cash Management and provide ongoing support to Treasury Operations worldwide. Corporate Treasury/Global Business Services - Treasury Consultant to IBM China Customer IBM November 2008  –  April 2009  (6 months) Shenzhen, China Worked for IBM Global Business Services on treasury transformation project at Customer's headquarters in Shenzhen, China. Corporate Treasury/Global Business Services - Treasury Consultant to IBM China Customer IBM November 2008  –  April 2009  (6 months) Shenzhen, China Worked for IBM Global Business Services on treasury transformation project at Customer's headquarters in Shenzhen, China. Corporate Treasury – M&A Integration IBM January 2008  –  October 2008  (10 months) Armonk, NY Co-Lead Corporate Treasury’s integration effort of acquired company’s treasury functions. Corporate Treasury – M&A Integration IBM January 2008  –  October 2008  (10 months) Armonk, NY Co-Lead Corporate Treasury’s integration effort of acquired company’s treasury functions. Corporate Treasury - US Cash Management IBM 2006  –  2008  (2 years) Armonk, NY Program manager overseeing US cash management operations. Corporate Treasury - US Cash Management IBM 2006  –  2008  (2 years) Armonk, NY Program manager overseeing US cash management operations. Corporate Treasury - Banking Relations IBM 2003  –  2006  (3 years) Armonk, NY Program manager responsible for establishing and maintaining banking relationships for IBM Treasury. Corporate Treasury - Banking Relations IBM 2003  –  2006  (3 years) Armonk, NY Program manager responsible for establishing and maintaining banking relationships for IBM Treasury. Corporate Treasury - Senior Dealer, Money Market Desk IBM 1997  –  2003  (6 years) Armonk, NY Responsible for the management of IBM’s U.S. Short Term Funding and Investment Portfolio. Corporate Treasury - Senior Dealer, Money Market Desk IBM 1997  –  2003  (6 years) Armonk, NY Responsible for the management of IBM’s U.S. Short Term Funding and Investment Portfolio. Money Market Trader Nordbanken 1988  –  1995  (7 years) Money Market Trader Nordbanken 1988  –  1995  (7 years) Money Market Trader Banco de Bilbao 1985  –  1988  (3 years) Money Market Trader Banco de Bilbao 1985  –  1988  (3 years) Skills Treasury Management Skills  Treasury Management Treasury Management Treasury Management Education Syracuse University BS,  Finance 1981  – 1985 Syracuse University BS,  Finance 1981  – 1985 Syracuse University BS,  Finance 1981  – 1985 Syracuse University BS,  Finance 1981  – 1985 ", "Skills Organizational Change Organizational... Acquisition Integration Change Management Organizational... Organizational Design Organizational... CRM Talent Management Strategy Leadership HR Transformation Personnel Management Management Mergers & Acquisitions Consulting Human Resources See 2+     See less Skills  Organizational Change Organizational... Acquisition Integration Change Management Organizational... Organizational Design Organizational... CRM Talent Management Strategy Leadership HR Transformation Personnel Management Management Mergers & Acquisitions Consulting Human Resources See 2+     See less Organizational Change Organizational... Acquisition Integration Change Management Organizational... Organizational Design Organizational... CRM Talent Management Strategy Leadership HR Transformation Personnel Management Management Mergers & Acquisitions Consulting Human Resources See 2+     See less Organizational Change Organizational... Acquisition Integration Change Management Organizational... Organizational Design Organizational... CRM Talent Management Strategy Leadership HR Transformation Personnel Management Management Mergers & Acquisitions Consulting Human Resources See 2+     See less "]}