{"position": "Major Gift Officer", "company": "Stanford University", "profiles": ["Summary Non-profit leader and consultant with 20 years experience driving excellent results in the areas of major gifts, capital campaigns, donor cultivation and stewardship, prospect research, solicitation, and individual and institutional giving. Ability to foster productive collaborative fundraising with board members and major donors for both complex, metric-based institutions and community-based or start-up organizations. Summary Non-profit leader and consultant with 20 years experience driving excellent results in the areas of major gifts, capital campaigns, donor cultivation and stewardship, prospect research, solicitation, and individual and institutional giving. Ability to foster productive collaborative fundraising with board members and major donors for both complex, metric-based institutions and community-based or start-up organizations. Non-profit leader and consultant with 20 years experience driving excellent results in the areas of major gifts, capital campaigns, donor cultivation and stewardship, prospect research, solicitation, and individual and institutional giving. Ability to foster productive collaborative fundraising with board members and major donors for both complex, metric-based institutions and community-based or start-up organizations. Non-profit leader and consultant with 20 years experience driving excellent results in the areas of major gifts, capital campaigns, donor cultivation and stewardship, prospect research, solicitation, and individual and institutional giving. Ability to foster productive collaborative fundraising with board members and major donors for both complex, metric-based institutions and community-based or start-up organizations. Experience Fundraising Consultant Z Consults April 2015  – Present (5 months) San Francisco Bay Area In 20+ years in the non-profit sector I have learned from the best how to build and sustain strong organizations and results-driven fundraising teams for both complex, metric-based institutions and small community-based organizations and start-ups. \n \nI bring direct, hands-on experience from my work in higher education, climate change, community social services, health education, environment, public policy, and with public gardens and parks. Chief of External Affairs Peer Health Exchange July 2013  –  May 2015  (1 year 11 months) San Francisco Bay Area Led fundraising and communication for a $7 million, complex, social change non-profit; managed staff of five and mentored and coached six Executive Directors to revenue goals; implemented best practices; streamlined internal processes and structures to maximize leads and revenue; led revenue strategy development; personally cultivated and solicited high net worth individuals; managed the development committee of the board and presented at board meetings on revenue results, strategy and forecasts. Director of Philanthropy ClimateWorks Foundation February 2009  –  June 2013  (4 years 5 months) San Francisco Bay Area Led global revenue team of 15 professionals in the EU, India, and the US to develop new marketing strategies for climate philanthropy; designed revenue strategies for $1 million+ gifts and secured and stewarded investments from high net worth individuals; managed the CEO and Trustees to fundraising goals; developed marketing materials and proposals for C-level executives; presented at annual meeting of global climate experts and Fortune 500 CEOs; managed $600,000 budget reported quarterly to the Board of Directors. Principal Gift Officer Stanford University September 2006  –  February 2008  (1 year 6 months) Relationship manager for 80 of Stanford’s largest investors; developed funding opportunities and prospect strategies; partnered with the board and University president to fund new programmatic initiatives in international affairs, environmental science, the arts and humanities, and the biosciences. Major Gift Officer Stanford University January 2002  –  August 2006  (4 years 8 months) Relationship manager for 400+ investors in the Northeast United States comprised of private equity, finance, media, and arts and entertainment CEOs and principles; performed over 125 development calls and raised $5 million annually by direct solicitation; key player in back-to-back $1 billion fundraising campaigns. Reunion class giving officer Stanford University April 1999  –  December 2001  (2 years 9 months) Planned and executed fundraising program for Stanford reunion classes; set Stanford dollar records in 1999, 2000 and 2001; raised $3 million to $6 million annually and secured over 15 six-figure gifts each year. Direct marketing manager and Super Sunday director Jewish Community Federation of San Francisco February 1996  –  May 1998  (2 years 4 months) Ran telemarketing and direct mail operations to raise $3 million annually from 12,000 donors and attract 1,000 new gifts per year; led marketing, recruitment and training of 1,000 volunteers for Super Sunday. Counselor Edgewood Children's Center 1994  –  1995  (1 year) Counselor to at-risk and emotionally disturbed children. Paralegal Gold, Bennet, Cera and Sidener 1991  –  1993  (2 years) Fundraising Consultant Z Consults April 2015  – Present (5 months) San Francisco Bay Area In 20+ years in the non-profit sector I have learned from the best how to build and sustain strong organizations and results-driven fundraising teams for both complex, metric-based institutions and small community-based organizations and start-ups. \n \nI bring direct, hands-on experience from my work in higher education, climate change, community social services, health education, environment, public policy, and with public gardens and parks. Fundraising Consultant Z Consults April 2015  – Present (5 months) San Francisco Bay Area In 20+ years in the non-profit sector I have learned from the best how to build and sustain strong organizations and results-driven fundraising teams for both complex, metric-based institutions and small community-based organizations and start-ups. \n \nI bring direct, hands-on experience from my work in higher education, climate change, community social services, health education, environment, public policy, and with public gardens and parks. Chief of External Affairs Peer Health Exchange July 2013  –  May 2015  (1 year 11 months) San Francisco Bay Area Led fundraising and communication for a $7 million, complex, social change non-profit; managed staff of five and mentored and coached six Executive Directors to revenue goals; implemented best practices; streamlined internal processes and structures to maximize leads and revenue; led revenue strategy development; personally cultivated and solicited high net worth individuals; managed the development committee of the board and presented at board meetings on revenue results, strategy and forecasts. Chief of External Affairs Peer Health Exchange July 2013  –  May 2015  (1 year 11 months) San Francisco Bay Area Led fundraising and communication for a $7 million, complex, social change non-profit; managed staff of five and mentored and coached six Executive Directors to revenue goals; implemented best practices; streamlined internal processes and structures to maximize leads and revenue; led revenue strategy development; personally cultivated and solicited high net worth individuals; managed the development committee of the board and presented at board meetings on revenue results, strategy and forecasts. Director of Philanthropy ClimateWorks Foundation February 2009  –  June 2013  (4 years 5 months) San Francisco Bay Area Led global revenue team of 15 professionals in the EU, India, and the US to develop new marketing strategies for climate philanthropy; designed revenue strategies for $1 million+ gifts and secured and stewarded investments from high net worth individuals; managed the CEO and Trustees to fundraising goals; developed marketing materials and proposals for C-level executives; presented at annual meeting of global climate experts and Fortune 500 CEOs; managed $600,000 budget reported quarterly to the Board of Directors. Director of Philanthropy ClimateWorks Foundation February 2009  –  June 2013  (4 years 5 months) San Francisco Bay Area Led global revenue team of 15 professionals in the EU, India, and the US to develop new marketing strategies for climate philanthropy; designed revenue strategies for $1 million+ gifts and secured and stewarded investments from high net worth individuals; managed the CEO and Trustees to fundraising goals; developed marketing materials and proposals for C-level executives; presented at annual meeting of global climate experts and Fortune 500 CEOs; managed $600,000 budget reported quarterly to the Board of Directors. Principal Gift Officer Stanford University September 2006  –  February 2008  (1 year 6 months) Relationship manager for 80 of Stanford’s largest investors; developed funding opportunities and prospect strategies; partnered with the board and University president to fund new programmatic initiatives in international affairs, environmental science, the arts and humanities, and the biosciences. Principal Gift Officer Stanford University September 2006  –  February 2008  (1 year 6 months) Relationship manager for 80 of Stanford’s largest investors; developed funding opportunities and prospect strategies; partnered with the board and University president to fund new programmatic initiatives in international affairs, environmental science, the arts and humanities, and the biosciences. Major Gift Officer Stanford University January 2002  –  August 2006  (4 years 8 months) Relationship manager for 400+ investors in the Northeast United States comprised of private equity, finance, media, and arts and entertainment CEOs and principles; performed over 125 development calls and raised $5 million annually by direct solicitation; key player in back-to-back $1 billion fundraising campaigns. Major Gift Officer Stanford University January 2002  –  August 2006  (4 years 8 months) Relationship manager for 400+ investors in the Northeast United States comprised of private equity, finance, media, and arts and entertainment CEOs and principles; performed over 125 development calls and raised $5 million annually by direct solicitation; key player in back-to-back $1 billion fundraising campaigns. Reunion class giving officer Stanford University April 1999  –  December 2001  (2 years 9 months) Planned and executed fundraising program for Stanford reunion classes; set Stanford dollar records in 1999, 2000 and 2001; raised $3 million to $6 million annually and secured over 15 six-figure gifts each year. Reunion class giving officer Stanford University April 1999  –  December 2001  (2 years 9 months) Planned and executed fundraising program for Stanford reunion classes; set Stanford dollar records in 1999, 2000 and 2001; raised $3 million to $6 million annually and secured over 15 six-figure gifts each year. Direct marketing manager and Super Sunday director Jewish Community Federation of San Francisco February 1996  –  May 1998  (2 years 4 months) Ran telemarketing and direct mail operations to raise $3 million annually from 12,000 donors and attract 1,000 new gifts per year; led marketing, recruitment and training of 1,000 volunteers for Super Sunday. Direct marketing manager and Super Sunday director Jewish Community Federation of San Francisco February 1996  –  May 1998  (2 years 4 months) Ran telemarketing and direct mail operations to raise $3 million annually from 12,000 donors and attract 1,000 new gifts per year; led marketing, recruitment and training of 1,000 volunteers for Super Sunday. Counselor Edgewood Children's Center 1994  –  1995  (1 year) Counselor to at-risk and emotionally disturbed children. Counselor Edgewood Children's Center 1994  –  1995  (1 year) Counselor to at-risk and emotionally disturbed children. Paralegal Gold, Bennet, Cera and Sidener 1991  –  1993  (2 years) Paralegal Gold, Bennet, Cera and Sidener 1991  –  1993  (2 years) Skills Fundraising Strategy Political Campaigns Philanthropy Board Development Nonprofits Sustainability Grant Writing Corporate Social... Microsoft Office Program Management Strategic Planning Volunteer Management Annual Giving Leadership Proposal Writing Community Outreach Fundraisers Program Development Public Policy Program Evaluation Planned Giving Alumni Relations Stewardship Prospect Research Non-profit... Major Gift Development Public Speaking See 13+     See less Skills  Fundraising Strategy Political Campaigns Philanthropy Board Development Nonprofits Sustainability Grant Writing Corporate Social... Microsoft Office Program Management Strategic Planning Volunteer Management Annual Giving Leadership Proposal Writing Community Outreach Fundraisers Program Development Public Policy Program Evaluation Planned Giving Alumni Relations Stewardship Prospect Research Non-profit... Major Gift Development Public Speaking See 13+     See less Fundraising Strategy Political Campaigns Philanthropy Board Development Nonprofits Sustainability Grant Writing Corporate Social... Microsoft Office Program Management Strategic Planning Volunteer Management Annual Giving Leadership Proposal Writing Community Outreach Fundraisers Program Development Public Policy Program Evaluation Planned Giving Alumni Relations Stewardship Prospect Research Non-profit... Major Gift Development Public Speaking See 13+     See less Fundraising Strategy Political Campaigns Philanthropy Board Development Nonprofits Sustainability Grant Writing Corporate Social... Microsoft Office Program Management Strategic Planning Volunteer Management Annual Giving Leadership Proposal Writing Community Outreach Fundraisers Program Development Public Policy Program Evaluation Planned Giving Alumni Relations Stewardship Prospect Research Non-profit... Major Gift Development Public Speaking See 13+     See less Education Wesleyan University B.A.,  History 1987  – 1991 Stuyvesant High School High School 1983  – 1987 Wesleyan University B.A.,  History 1987  – 1991 Wesleyan University B.A.,  History 1987  – 1991 Wesleyan University B.A.,  History 1987  – 1991 Stuyvesant High School High School 1983  – 1987 Stuyvesant High School High School 1983  – 1987 Stuyvesant High School High School 1983  – 1987 ", "Experience Associate Director of Development Stanford University April 2006  – Present (9 years 5 months) major gift officer Stanford University 2006  – Present (9 years) Associate Director of Development Stanford University 2006  –  2008  (2 years) sales quaker oats 1990  –  1995  (5 years) Associate Director of Development Stanford University April 2006  – Present (9 years 5 months) Associate Director of Development Stanford University April 2006  – Present (9 years 5 months) major gift officer Stanford University 2006  – Present (9 years) major gift officer Stanford University 2006  – Present (9 years) Associate Director of Development Stanford University 2006  –  2008  (2 years) Associate Director of Development Stanford University 2006  –  2008  (2 years) sales quaker oats 1990  –  1995  (5 years) sales quaker oats 1990  –  1995  (5 years) Skills Alumni Relations Annual Giving Fundraising Planned Giving Stewardship Philanthropy Volunteer Management Skills  Alumni Relations Annual Giving Fundraising Planned Giving Stewardship Philanthropy Volunteer Management Alumni Relations Annual Giving Fundraising Planned Giving Stewardship Philanthropy Volunteer Management Alumni Relations Annual Giving Fundraising Planned Giving Stewardship Philanthropy Volunteer Management Education University of Arizona 1983  – 1989 University of Arizona 1983  – 1989 University of Arizona 1983  – 1989 University of Arizona 1983  – 1989 ", "Skills Social Media Public Relations Marketing Communications Consulting Skills  Social Media Public Relations Marketing Communications Consulting Social Media Public Relations Marketing Communications Consulting Social Media Public Relations Marketing Communications Consulting ", "Summary Career dedicated to improving the lives of many, using numerous platforms, including higher education, social services, youth development, medical research and clinical care, advocacy for the under-served and needy, and community building. Knowledgeable about the nonprofit setting and processes, including all elements of fundraising from corporate, foundation, and individual sectors. \n \nCurrent focus of work is sustainable philanthropy and new models of generating ongoing income for causes. Bringing together disparate groups for common goal(s), as well as helping strengthen organizations and people for the future (here and globally) are of particular interest. \n \nSpecialties: Entrepreneurial enterprises that blend for-profit and non-profit best practices; individual and institutional renewal and transformation; alliances and collaborative partnerships for impact of significance; volunteer, board, and organizational development; gift (and other) negotiations for common good or purpose; helping create change to make a positive difference in our community and our world. Summary Career dedicated to improving the lives of many, using numerous platforms, including higher education, social services, youth development, medical research and clinical care, advocacy for the under-served and needy, and community building. Knowledgeable about the nonprofit setting and processes, including all elements of fundraising from corporate, foundation, and individual sectors. \n \nCurrent focus of work is sustainable philanthropy and new models of generating ongoing income for causes. Bringing together disparate groups for common goal(s), as well as helping strengthen organizations and people for the future (here and globally) are of particular interest. \n \nSpecialties: Entrepreneurial enterprises that blend for-profit and non-profit best practices; individual and institutional renewal and transformation; alliances and collaborative partnerships for impact of significance; volunteer, board, and organizational development; gift (and other) negotiations for common good or purpose; helping create change to make a positive difference in our community and our world. Career dedicated to improving the lives of many, using numerous platforms, including higher education, social services, youth development, medical research and clinical care, advocacy for the under-served and needy, and community building. Knowledgeable about the nonprofit setting and processes, including all elements of fundraising from corporate, foundation, and individual sectors. \n \nCurrent focus of work is sustainable philanthropy and new models of generating ongoing income for causes. Bringing together disparate groups for common goal(s), as well as helping strengthen organizations and people for the future (here and globally) are of particular interest. \n \nSpecialties: Entrepreneurial enterprises that blend for-profit and non-profit best practices; individual and institutional renewal and transformation; alliances and collaborative partnerships for impact of significance; volunteer, board, and organizational development; gift (and other) negotiations for common good or purpose; helping create change to make a positive difference in our community and our world. Career dedicated to improving the lives of many, using numerous platforms, including higher education, social services, youth development, medical research and clinical care, advocacy for the under-served and needy, and community building. Knowledgeable about the nonprofit setting and processes, including all elements of fundraising from corporate, foundation, and individual sectors. \n \nCurrent focus of work is sustainable philanthropy and new models of generating ongoing income for causes. Bringing together disparate groups for common goal(s), as well as helping strengthen organizations and people for the future (here and globally) are of particular interest. \n \nSpecialties: Entrepreneurial enterprises that blend for-profit and non-profit best practices; individual and institutional renewal and transformation; alliances and collaborative partnerships for impact of significance; volunteer, board, and organizational development; gift (and other) negotiations for common good or purpose; helping create change to make a positive difference in our community and our world. Experience Founder & Curator Ba' Boom January 2014  – Present (1 year 8 months) Boston, MA Ba' Boom gathers baby boomers in small settings to engage in topics that pique curiosity about ourselves, our communities, and our world. Ba' Boom provides a platform, a venue, of coming together to consider possibilities - ways in which we can grow and transform as we age: as individuals, family members, and broader community and global citizens.  \n \nLaunched in January 17, 2014 with its first gathering of 100 boomer women and 12+ thought leaders/activators, Ba' Boom is currently piloting a new series of programs to help initiate change and new paths of thinking, working, collaborating, and aging during this time of radical shifts in our world! The power of community is key in the gatherings of Ba' Boom and its vision to help boomers continue to do good - for ourselves and our communities, especially for the sake of the next generations. Consultant & Advocate Dimmi April 2012  –  June 2014  (2 years 3 months) Lynchburg, VA Helped establish the base for a new lifestyle brand, Dimmi, with the purpose of giving away 100% of wholesale profits to medical research. An exceptional and unusual model of combining business with sustainable philanthropy - within the for-profit construct. President/Advisor Two Ten Footwear Foundation 2001  –  2012  (11 years) Waltham, MA Managed and rebuilt a one-of-a-kind foundation serving and representing the footwear industry. With the mission of Shoepeople Helping Shoepeople, programs in social services, scholarships, and community building were renovated and strengthened, resulting in a foundation that is more responsive and relevant to its industry, and works more efficiently and cost-effectively for the good of those it serves. CEO Dublin City University Trust 1999  –  2001  (2 years) Dublin, Ireland Guided emerging philanthropic organization affiliated with Ireland's youngest university with annual revenue of $15 million from private sources including American, Irish, and European funders and multinational corporations. Senior Vice President, Resource Development Boys and Girls Clubs of America 1997  –  1999  (2 years) Atlanta, GA Managed full spectrum of fundraising for nation's largest and fastest growing youth development organization, raising private gifts that made up 60% of the annual budget -- with operations in five regions of the country. Vice President New England Medical Center 1994  –  1996  (2 years) Boston, MA Established fundraising arm for a major academic medical center from group up, hiring and training a full team and building necessary infrastructure -- and just as quickly dismantled operations as the medical center faced its most difficult financial period. Director of Development, Health Sciences UC San Diego 1988  –  1994  (6 years) La Jolla, CA Directed the first formal fundraising program for UCSD Health Sciences with fundraising oversight of all volunteer groups and boards of research centers (cancer, aging, etc.), two hospitals, and School of Medicine. Major Gift Officer Stanford University 1984  –  1988  (4 years) Palo Alto, CA Raised major gifts during Stanford's campaign and the country's first fundraising effort of $1 B+; helped raise major gifts for the hospital modernization project and the nucleus fund of the Packard Children's Hospital. Fundraiser Dartmouth College 1980  –  1984  (4 years) Hanover, NH Worked on all aspects of fundraising -- corporate to individual; donor recognition and solicitations; operations, grant writing and events -- for the Dartmouth Medical School during Dartmouth's Campaign years. Founder & Curator Ba' Boom January 2014  – Present (1 year 8 months) Boston, MA Ba' Boom gathers baby boomers in small settings to engage in topics that pique curiosity about ourselves, our communities, and our world. Ba' Boom provides a platform, a venue, of coming together to consider possibilities - ways in which we can grow and transform as we age: as individuals, family members, and broader community and global citizens.  \n \nLaunched in January 17, 2014 with its first gathering of 100 boomer women and 12+ thought leaders/activators, Ba' Boom is currently piloting a new series of programs to help initiate change and new paths of thinking, working, collaborating, and aging during this time of radical shifts in our world! The power of community is key in the gatherings of Ba' Boom and its vision to help boomers continue to do good - for ourselves and our communities, especially for the sake of the next generations. Founder & Curator Ba' Boom January 2014  – Present (1 year 8 months) Boston, MA Ba' Boom gathers baby boomers in small settings to engage in topics that pique curiosity about ourselves, our communities, and our world. Ba' Boom provides a platform, a venue, of coming together to consider possibilities - ways in which we can grow and transform as we age: as individuals, family members, and broader community and global citizens.  \n \nLaunched in January 17, 2014 with its first gathering of 100 boomer women and 12+ thought leaders/activators, Ba' Boom is currently piloting a new series of programs to help initiate change and new paths of thinking, working, collaborating, and aging during this time of radical shifts in our world! The power of community is key in the gatherings of Ba' Boom and its vision to help boomers continue to do good - for ourselves and our communities, especially for the sake of the next generations. Consultant & Advocate Dimmi April 2012  –  June 2014  (2 years 3 months) Lynchburg, VA Helped establish the base for a new lifestyle brand, Dimmi, with the purpose of giving away 100% of wholesale profits to medical research. An exceptional and unusual model of combining business with sustainable philanthropy - within the for-profit construct. Consultant & Advocate Dimmi April 2012  –  June 2014  (2 years 3 months) Lynchburg, VA Helped establish the base for a new lifestyle brand, Dimmi, with the purpose of giving away 100% of wholesale profits to medical research. An exceptional and unusual model of combining business with sustainable philanthropy - within the for-profit construct. President/Advisor Two Ten Footwear Foundation 2001  –  2012  (11 years) Waltham, MA Managed and rebuilt a one-of-a-kind foundation serving and representing the footwear industry. With the mission of Shoepeople Helping Shoepeople, programs in social services, scholarships, and community building were renovated and strengthened, resulting in a foundation that is more responsive and relevant to its industry, and works more efficiently and cost-effectively for the good of those it serves. President/Advisor Two Ten Footwear Foundation 2001  –  2012  (11 years) Waltham, MA Managed and rebuilt a one-of-a-kind foundation serving and representing the footwear industry. With the mission of Shoepeople Helping Shoepeople, programs in social services, scholarships, and community building were renovated and strengthened, resulting in a foundation that is more responsive and relevant to its industry, and works more efficiently and cost-effectively for the good of those it serves. CEO Dublin City University Trust 1999  –  2001  (2 years) Dublin, Ireland Guided emerging philanthropic organization affiliated with Ireland's youngest university with annual revenue of $15 million from private sources including American, Irish, and European funders and multinational corporations. CEO Dublin City University Trust 1999  –  2001  (2 years) Dublin, Ireland Guided emerging philanthropic organization affiliated with Ireland's youngest university with annual revenue of $15 million from private sources including American, Irish, and European funders and multinational corporations. Senior Vice President, Resource Development Boys and Girls Clubs of America 1997  –  1999  (2 years) Atlanta, GA Managed full spectrum of fundraising for nation's largest and fastest growing youth development organization, raising private gifts that made up 60% of the annual budget -- with operations in five regions of the country. Senior Vice President, Resource Development Boys and Girls Clubs of America 1997  –  1999  (2 years) Atlanta, GA Managed full spectrum of fundraising for nation's largest and fastest growing youth development organization, raising private gifts that made up 60% of the annual budget -- with operations in five regions of the country. Vice President New England Medical Center 1994  –  1996  (2 years) Boston, MA Established fundraising arm for a major academic medical center from group up, hiring and training a full team and building necessary infrastructure -- and just as quickly dismantled operations as the medical center faced its most difficult financial period. Vice President New England Medical Center 1994  –  1996  (2 years) Boston, MA Established fundraising arm for a major academic medical center from group up, hiring and training a full team and building necessary infrastructure -- and just as quickly dismantled operations as the medical center faced its most difficult financial period. Director of Development, Health Sciences UC San Diego 1988  –  1994  (6 years) La Jolla, CA Directed the first formal fundraising program for UCSD Health Sciences with fundraising oversight of all volunteer groups and boards of research centers (cancer, aging, etc.), two hospitals, and School of Medicine. Director of Development, Health Sciences UC San Diego 1988  –  1994  (6 years) La Jolla, CA Directed the first formal fundraising program for UCSD Health Sciences with fundraising oversight of all volunteer groups and boards of research centers (cancer, aging, etc.), two hospitals, and School of Medicine. Major Gift Officer Stanford University 1984  –  1988  (4 years) Palo Alto, CA Raised major gifts during Stanford's campaign and the country's first fundraising effort of $1 B+; helped raise major gifts for the hospital modernization project and the nucleus fund of the Packard Children's Hospital. Major Gift Officer Stanford University 1984  –  1988  (4 years) Palo Alto, CA Raised major gifts during Stanford's campaign and the country's first fundraising effort of $1 B+; helped raise major gifts for the hospital modernization project and the nucleus fund of the Packard Children's Hospital. Fundraiser Dartmouth College 1980  –  1984  (4 years) Hanover, NH Worked on all aspects of fundraising -- corporate to individual; donor recognition and solicitations; operations, grant writing and events -- for the Dartmouth Medical School during Dartmouth's Campaign years. Fundraiser Dartmouth College 1980  –  1984  (4 years) Hanover, NH Worked on all aspects of fundraising -- corporate to individual; donor recognition and solicitations; operations, grant writing and events -- for the Dartmouth Medical School during Dartmouth's Campaign years. Skills Event Planning Fundraising Social Media Footwear Coaching Non-profits Fashion Nonprofits Wholesale Retail Entrepreneurship Public Speaking Strategic Planning Leadership Product Development Training Marketing Philanthropy Grant Writing Annual Giving Research Program Management Organizational... Public Relations Budgets Marketing Communications Volunteer Management Marketing Strategy Community Outreach Social Networking Event Management Advertising Blogging Media Relations Social Media Marketing Newsletters Editing Corporate Social... Management Merchandising Higher Education Brand Development Trade Shows Brand Management See 29+     See less Skills  Event Planning Fundraising Social Media Footwear Coaching Non-profits Fashion Nonprofits Wholesale Retail Entrepreneurship Public Speaking Strategic Planning Leadership Product Development Training Marketing Philanthropy Grant Writing Annual Giving Research Program Management Organizational... Public Relations Budgets Marketing Communications Volunteer Management Marketing Strategy Community Outreach Social Networking Event Management Advertising Blogging Media Relations Social Media Marketing Newsletters Editing Corporate Social... Management Merchandising Higher Education Brand Development Trade Shows Brand Management See 29+     See less Event Planning Fundraising Social Media Footwear Coaching Non-profits Fashion Nonprofits Wholesale Retail Entrepreneurship Public Speaking Strategic Planning Leadership Product Development Training Marketing Philanthropy Grant Writing Annual Giving Research Program Management Organizational... Public Relations Budgets Marketing Communications Volunteer Management Marketing Strategy Community Outreach Social Networking Event Management Advertising Blogging Media Relations Social Media Marketing Newsletters Editing Corporate Social... Management Merchandising Higher Education Brand Development Trade Shows Brand Management See 29+     See less Event Planning Fundraising Social Media Footwear Coaching Non-profits Fashion Nonprofits Wholesale Retail Entrepreneurship Public Speaking Strategic Planning Leadership Product Development Training Marketing Philanthropy Grant Writing Annual Giving Research Program Management Organizational... Public Relations Budgets Marketing Communications Volunteer Management Marketing Strategy Community Outreach Social Networking Event Management Advertising Blogging Media Relations Social Media Marketing Newsletters Editing Corporate Social... Management Merchandising Higher Education Brand Development Trade Shows Brand Management See 29+     See less Education Brown University MA,  Asian History 1972  – 1974 Vassar College BA,  Political Science 1968  – 1972 Brown University MA,  Asian History 1972  – 1974 Brown University MA,  Asian History 1972  – 1974 Brown University MA,  Asian History 1972  – 1974 Vassar College BA,  Political Science 1968  – 1972 Vassar College BA,  Political Science 1968  – 1972 Vassar College BA,  Political Science 1968  – 1972 Honors & Awards Additional Honors & Awards T. Kenyon Holly Award for Humanitarianism, 2011 Additional Honors & Awards T. Kenyon Holly Award for Humanitarianism, 2011 Additional Honors & Awards T. Kenyon Holly Award for Humanitarianism, 2011 Additional Honors & Awards T. Kenyon Holly Award for Humanitarianism, 2011 "]}