{"position": "Managing Consultant (Manager)", "company": "IBM", "profiles": ["Experience Managing Consultant Manager IBM India Pvt Ltd. June 2010  – Present (5 years 3 months) Bangalore Project Management, Program Management, Delivery Management, People Management, Practice Management Manager Program Management Sapient Corp. 2008  –  2010  (2 years) Project Management, Program Management Project Manager Infosys 2000  –  2008  (8 years) Project Management, Test Managment Managing Consultant Manager IBM India Pvt Ltd. June 2010  – Present (5 years 3 months) Bangalore Project Management, Program Management, Delivery Management, People Management, Practice Management Managing Consultant Manager IBM India Pvt Ltd. June 2010  – Present (5 years 3 months) Bangalore Project Management, Program Management, Delivery Management, People Management, Practice Management Manager Program Management Sapient Corp. 2008  –  2010  (2 years) Project Management, Program Management Manager Program Management Sapient Corp. 2008  –  2010  (2 years) Project Management, Program Management Project Manager Infosys 2000  –  2008  (8 years) Project Management, Test Managment Project Manager Infosys 2000  –  2008  (8 years) Project Management, Test Managment Skills Software Project... Requirements Analysis Global Delivery Requirements Gathering SDLC Business Analysis Program Management Project Delivery PMO Pre-sales PMP Agile Methodologies Skills  Software Project... Requirements Analysis Global Delivery Requirements Gathering SDLC Business Analysis Program Management Project Delivery PMO Pre-sales PMP Agile Methodologies Software Project... Requirements Analysis Global Delivery Requirements Gathering SDLC Business Analysis Program Management Project Delivery PMO Pre-sales PMP Agile Methodologies Software Project... Requirements Analysis Global Delivery Requirements Gathering SDLC Business Analysis Program Management Project Delivery PMO Pre-sales PMP Agile Methodologies Education KNIT Sultanpur B. Tech.,  Electronics 1995  – 1999 KNIT Sultanpur B. Tech.,  Electronics 1995  – 1999 KNIT Sultanpur B. Tech.,  Electronics 1995  – 1999 KNIT Sultanpur B. Tech.,  Electronics 1995  – 1999 ", "Skills SAP ERP SAP Implementation SAP R/3 Data Migration SAP Business Process Data Integration Solution Architecture ERP SD Reverse Logistics SAP CRM Requirements Analysis Business Process Design SAP SD Master Data Management SAP Netweaver See 2+     See less Skills  SAP ERP SAP Implementation SAP R/3 Data Migration SAP Business Process Data Integration Solution Architecture ERP SD Reverse Logistics SAP CRM Requirements Analysis Business Process Design SAP SD Master Data Management SAP Netweaver See 2+     See less SAP ERP SAP Implementation SAP R/3 Data Migration SAP Business Process Data Integration Solution Architecture ERP SD Reverse Logistics SAP CRM Requirements Analysis Business Process Design SAP SD Master Data Management SAP Netweaver See 2+     See less SAP ERP SAP Implementation SAP R/3 Data Migration SAP Business Process Data Integration Solution Architecture ERP SD Reverse Logistics SAP CRM Requirements Analysis Business Process Design SAP SD Master Data Management SAP Netweaver See 2+     See less ", "Summary Specialties:Defining CRM Solutions - Banking and Other Industries; \nLeading Delivery - for both new development as well as support work; \nAssisting clients to for Architectural decisions,  \nDelivering IT solutions to support business \nDeveloping new competencies - defining process, methods and tools \nUnderstanding IT Trends and supporting business Summary Specialties:Defining CRM Solutions - Banking and Other Industries; \nLeading Delivery - for both new development as well as support work; \nAssisting clients to for Architectural decisions,  \nDelivering IT solutions to support business \nDeveloping new competencies - defining process, methods and tools \nUnderstanding IT Trends and supporting business Specialties:Defining CRM Solutions - Banking and Other Industries; \nLeading Delivery - for both new development as well as support work; \nAssisting clients to for Architectural decisions,  \nDelivering IT solutions to support business \nDeveloping new competencies - defining process, methods and tools \nUnderstanding IT Trends and supporting business Specialties:Defining CRM Solutions - Banking and Other Industries; \nLeading Delivery - for both new development as well as support work; \nAssisting clients to for Architectural decisions,  \nDelivering IT solutions to support business \nDeveloping new competencies - defining process, methods and tools \nUnderstanding IT Trends and supporting business Experience Senior Managing Consultant - Manager IBM Global Business Services June 2008  – Present (7 years 3 months) Building Competency and Capability around Digital Channel Transformation, Supporting clients in solving business challenges leveraging Digital and Social channel transformation initiatives. Managing Consultant - Manager IBM Global Business Services November 2004  –  May 2008  (3 years 7 months) Senior Consultant IBM Global Business Services October 2002  –  October 2004  (2 years 1 month) Consultant PwC Pvt Ltd November 1999  –  September 2002  (2 years 11 months) Consultant PwC 1999  –  2002  (3 years) Software Developer DataCore January 1999  –  October 1999  (10 months) Software Engineer Globsyn Technologies 1997  –  1998  (1 year) Senior Managing Consultant - Manager IBM Global Business Services June 2008  – Present (7 years 3 months) Building Competency and Capability around Digital Channel Transformation, Supporting clients in solving business challenges leveraging Digital and Social channel transformation initiatives. Senior Managing Consultant - Manager IBM Global Business Services June 2008  – Present (7 years 3 months) Building Competency and Capability around Digital Channel Transformation, Supporting clients in solving business challenges leveraging Digital and Social channel transformation initiatives. Managing Consultant - Manager IBM Global Business Services November 2004  –  May 2008  (3 years 7 months) Managing Consultant - Manager IBM Global Business Services November 2004  –  May 2008  (3 years 7 months) Senior Consultant IBM Global Business Services October 2002  –  October 2004  (2 years 1 month) Senior Consultant IBM Global Business Services October 2002  –  October 2004  (2 years 1 month) Consultant PwC Pvt Ltd November 1999  –  September 2002  (2 years 11 months) Consultant PwC Pvt Ltd November 1999  –  September 2002  (2 years 11 months) Consultant PwC 1999  –  2002  (3 years) Consultant PwC 1999  –  2002  (3 years) Software Developer DataCore January 1999  –  October 1999  (10 months) Software Developer DataCore January 1999  –  October 1999  (10 months) Software Engineer Globsyn Technologies 1997  –  1998  (1 year) Software Engineer Globsyn Technologies 1997  –  1998  (1 year) Skills CRM Social CRM Contact Center... Multi-channel Marketing Enterprise Risk... Global Delivery Leadership Project Portfolio... Channel Transformation Technical Architecture Pre-sales Integration PMP Management IT Strategy Business Process Project Management Solution Architecture Enterprise Architecture Business Transformation Requirements Analysis See 6+     See less Skills  CRM Social CRM Contact Center... Multi-channel Marketing Enterprise Risk... Global Delivery Leadership Project Portfolio... Channel Transformation Technical Architecture Pre-sales Integration PMP Management IT Strategy Business Process Project Management Solution Architecture Enterprise Architecture Business Transformation Requirements Analysis See 6+     See less CRM Social CRM Contact Center... Multi-channel Marketing Enterprise Risk... Global Delivery Leadership Project Portfolio... Channel Transformation Technical Architecture Pre-sales Integration PMP Management IT Strategy Business Process Project Management Solution Architecture Enterprise Architecture Business Transformation Requirements Analysis See 6+     See less CRM Social CRM Contact Center... Multi-channel Marketing Enterprise Risk... Global Delivery Leadership Project Portfolio... Channel Transformation Technical Architecture Pre-sales Integration PMP Management IT Strategy Business Process Project Management Solution Architecture Enterprise Architecture Business Transformation Requirements Analysis See 6+     See less Education Bengal Engineering and Science University, Shibpur Bachelor of Engineering (B.E.),  Civil Engineering 1991  – 1995 Bidhan Nagar Govt High School Bengal Engineering and Science University, Shibpur Bachelor of Engineering (B.E.),  Civil Engineering 1991  – 1995 Bengal Engineering and Science University, Shibpur Bachelor of Engineering (B.E.),  Civil Engineering 1991  – 1995 Bengal Engineering and Science University, Shibpur Bachelor of Engineering (B.E.),  Civil Engineering 1991  – 1995 Bidhan Nagar Govt High School Bidhan Nagar Govt High School Bidhan Nagar Govt High School ", "Summary Key Skills\t \n• Project Management Methodologies \n• Software Selection Methodologies \n• System Evaluations \n• Financial Accountant Management \n• Business Process Transformation \n• SAP R/3 3.0D, 4.0B, 4.6C, 4.7C, ECC6.0 Summary Key Skills\t \n• Project Management Methodologies \n• Software Selection Methodologies \n• System Evaluations \n• Financial Accountant Management \n• Business Process Transformation \n• SAP R/3 3.0D, 4.0B, 4.6C, 4.7C, ECC6.0 Key Skills\t \n• Project Management Methodologies \n• Software Selection Methodologies \n• System Evaluations \n• Financial Accountant Management \n• Business Process Transformation \n• SAP R/3 3.0D, 4.0B, 4.6C, 4.7C, ECC6.0 Key Skills\t \n• Project Management Methodologies \n• Software Selection Methodologies \n• System Evaluations \n• Financial Accountant Management \n• Business Process Transformation \n• SAP R/3 3.0D, 4.0B, 4.6C, 4.7C, ECC6.0 Experience Associate Partner IBM 2012  – Present (3 years) Siripong has a broad spectrum of experiences pertaining to the management of accounting and information systems. He is currently an Associate Partner and Enterprise Application Country Leader of IBM Business Consulting Services, Thailand. He has over twenty year global experiences as a financial management consultant of IBM Australia and IBM Thailand’s practice. \nHis pattern of advancement, increased responsibilities and demonstrated company loyalty with regards to software and hardware robust designs, has been proven over a number of years. \n Associate Partner/ Country SAP Delivery Leader IBM Business Consulting Services Pty., Ltd. Thailand August 2006  – Present (9 years 1 month) Bangkok Metropolitan Area, Thailand Senior Managing Consultant Manager IBM Business Consulting Services Pty., Ltd. Australia October 1998  –  July 2006  (7 years 10 months) Sydney Area, Australia Managing Consultant Manager IBM Business Consulting Services Pty., Ltd. (Pricewaterhouse Coopers, Pty. Ltd) Thailand September 1994  –  September 1998  (4 years 1 month) Bangkok Metropolitan Area, Thailand Senior Consultant (Consulting Delivery Engagement (SAP, BPT, FMS) Sinobrit Consulting Company Limited October 1992  –  August 1994  (1 year 11 months) Bangkok Metropolitan Area, Thailand Accounting and Financial Manager Samart Telecom Corporation Limited May 1992  –  September 1992  (5 months) Bangkok Metropolitan Area, Thailand Financial & Management Accountant Esso Standard Thailand Limited July 1987  –  April 1992  (4 years 10 months) Bangkok Metropolitan Area, Thailand GL Accountant C.P. Public Company Limited April 1987  –  June 1987  (3 months) Bangkok Metropolitan Area, Thailand Associate Partner IBM 2012  – Present (3 years) Siripong has a broad spectrum of experiences pertaining to the management of accounting and information systems. He is currently an Associate Partner and Enterprise Application Country Leader of IBM Business Consulting Services, Thailand. He has over twenty year global experiences as a financial management consultant of IBM Australia and IBM Thailand’s practice. \nHis pattern of advancement, increased responsibilities and demonstrated company loyalty with regards to software and hardware robust designs, has been proven over a number of years. \n Associate Partner IBM 2012  – Present (3 years) Siripong has a broad spectrum of experiences pertaining to the management of accounting and information systems. He is currently an Associate Partner and Enterprise Application Country Leader of IBM Business Consulting Services, Thailand. He has over twenty year global experiences as a financial management consultant of IBM Australia and IBM Thailand’s practice. \nHis pattern of advancement, increased responsibilities and demonstrated company loyalty with regards to software and hardware robust designs, has been proven over a number of years. \n Associate Partner/ Country SAP Delivery Leader IBM Business Consulting Services Pty., Ltd. Thailand August 2006  – Present (9 years 1 month) Bangkok Metropolitan Area, Thailand Associate Partner/ Country SAP Delivery Leader IBM Business Consulting Services Pty., Ltd. Thailand August 2006  – Present (9 years 1 month) Bangkok Metropolitan Area, Thailand Senior Managing Consultant Manager IBM Business Consulting Services Pty., Ltd. Australia October 1998  –  July 2006  (7 years 10 months) Sydney Area, Australia Senior Managing Consultant Manager IBM Business Consulting Services Pty., Ltd. Australia October 1998  –  July 2006  (7 years 10 months) Sydney Area, Australia Managing Consultant Manager IBM Business Consulting Services Pty., Ltd. (Pricewaterhouse Coopers, Pty. Ltd) Thailand September 1994  –  September 1998  (4 years 1 month) Bangkok Metropolitan Area, Thailand Managing Consultant Manager IBM Business Consulting Services Pty., Ltd. (Pricewaterhouse Coopers, Pty. Ltd) Thailand September 1994  –  September 1998  (4 years 1 month) Bangkok Metropolitan Area, Thailand Senior Consultant (Consulting Delivery Engagement (SAP, BPT, FMS) Sinobrit Consulting Company Limited October 1992  –  August 1994  (1 year 11 months) Bangkok Metropolitan Area, Thailand Senior Consultant (Consulting Delivery Engagement (SAP, BPT, FMS) Sinobrit Consulting Company Limited October 1992  –  August 1994  (1 year 11 months) Bangkok Metropolitan Area, Thailand Accounting and Financial Manager Samart Telecom Corporation Limited May 1992  –  September 1992  (5 months) Bangkok Metropolitan Area, Thailand Accounting and Financial Manager Samart Telecom Corporation Limited May 1992  –  September 1992  (5 months) Bangkok Metropolitan Area, Thailand Financial & Management Accountant Esso Standard Thailand Limited July 1987  –  April 1992  (4 years 10 months) Bangkok Metropolitan Area, Thailand Financial & Management Accountant Esso Standard Thailand Limited July 1987  –  April 1992  (4 years 10 months) Bangkok Metropolitan Area, Thailand GL Accountant C.P. Public Company Limited April 1987  –  June 1987  (3 months) Bangkok Metropolitan Area, Thailand GL Accountant C.P. Public Company Limited April 1987  –  June 1987  (3 months) Bangkok Metropolitan Area, Thailand Education Assumption University Master's Degree,  Master of Science in CIS 1992  – 1994 Assumption University, Thailand Bachelor's Degree,  Accounting and Finance 1984  – 1987 Assumption University Master's Degree,  Master of Science in CIS 1992  – 1994 Assumption University Master's Degree,  Master of Science in CIS 1992  – 1994 Assumption University Master's Degree,  Master of Science in CIS 1992  – 1994 Assumption University, Thailand Bachelor's Degree,  Accounting and Finance 1984  – 1987 Assumption University, Thailand Bachelor's Degree,  Accounting and Finance 1984  – 1987 Assumption University, Thailand Bachelor's Degree,  Accounting and Finance 1984  – 1987 ", "Summary Multilingual business executive of IT and software industries with over 18 years of experience in strategic planning, business development, sales, marketing, product management, services and operation. Extensive expertise and practice in China with significant achievements.  \n \nAs a Certified International Trade Professional, Raymond brings vital opportunities to occidental entrepreneurs in such a global economic turmoil by introducing their enterprises into China and penetrating this largest emerging market. Raymond held several International Business Consulting positions in government and private organizations after he migrated to Canada in 2006.  \n \nBefore that, Raymond was Senior Manager of International Business in HP Global Delivery China Centre, the second largest delivery force of HP with over 2000 engineers. He developed US market and won the first US end user contract from the world’s largest automaker.  \n \nWhen he was Senior Manager, Services Division of Dell Asia Pacific, he was responsible for Services P&L in Great China. He led the team to innovate and launch a high-margin product in China successfully; he improved customer satisfaction and purchase rate significantly through process redesigning, sales training, incentive and Integrated Marketing Communication programs. These efforts ensured Dell was awarded \"China IT Services Award 2003\" from Computer World Magazine.  \n \nEarlier in his career, Raymond grew from a sales pioneer of IBM Software to a regional sales and marketing manager in China. Raymond recruited the first IBM national software distributor in China. He also introduced Tivoli brand into China and built its China business from scratch.  \n \nRaymond intensified his leadership, sales, services, and people management skills theoretically and practically when he was a consultant of Wilson learning, a leading global Human Performance Improvement consulting firm. Specialties:• Strong research, analysis, planning, budgeting, consulting and people management skills.  \n• Comprehensive Sales and Integrated Marketing Communication practice.  \n• Life cycle product and brand management in Asian countries.  \n• Leader with entrepreneurial spirits, creative thinker and problem solver.  \n• Fluent in English and Chinese (Mandarin, Shanghai Dialect) Summary Multilingual business executive of IT and software industries with over 18 years of experience in strategic planning, business development, sales, marketing, product management, services and operation. Extensive expertise and practice in China with significant achievements.  \n \nAs a Certified International Trade Professional, Raymond brings vital opportunities to occidental entrepreneurs in such a global economic turmoil by introducing their enterprises into China and penetrating this largest emerging market. Raymond held several International Business Consulting positions in government and private organizations after he migrated to Canada in 2006.  \n \nBefore that, Raymond was Senior Manager of International Business in HP Global Delivery China Centre, the second largest delivery force of HP with over 2000 engineers. He developed US market and won the first US end user contract from the world’s largest automaker.  \n \nWhen he was Senior Manager, Services Division of Dell Asia Pacific, he was responsible for Services P&L in Great China. He led the team to innovate and launch a high-margin product in China successfully; he improved customer satisfaction and purchase rate significantly through process redesigning, sales training, incentive and Integrated Marketing Communication programs. These efforts ensured Dell was awarded \"China IT Services Award 2003\" from Computer World Magazine.  \n \nEarlier in his career, Raymond grew from a sales pioneer of IBM Software to a regional sales and marketing manager in China. Raymond recruited the first IBM national software distributor in China. He also introduced Tivoli brand into China and built its China business from scratch.  \n \nRaymond intensified his leadership, sales, services, and people management skills theoretically and practically when he was a consultant of Wilson learning, a leading global Human Performance Improvement consulting firm. Specialties:• Strong research, analysis, planning, budgeting, consulting and people management skills.  \n• Comprehensive Sales and Integrated Marketing Communication practice.  \n• Life cycle product and brand management in Asian countries.  \n• Leader with entrepreneurial spirits, creative thinker and problem solver.  \n• Fluent in English and Chinese (Mandarin, Shanghai Dialect) Multilingual business executive of IT and software industries with over 18 years of experience in strategic planning, business development, sales, marketing, product management, services and operation. Extensive expertise and practice in China with significant achievements.  \n \nAs a Certified International Trade Professional, Raymond brings vital opportunities to occidental entrepreneurs in such a global economic turmoil by introducing their enterprises into China and penetrating this largest emerging market. Raymond held several International Business Consulting positions in government and private organizations after he migrated to Canada in 2006.  \n \nBefore that, Raymond was Senior Manager of International Business in HP Global Delivery China Centre, the second largest delivery force of HP with over 2000 engineers. He developed US market and won the first US end user contract from the world’s largest automaker.  \n \nWhen he was Senior Manager, Services Division of Dell Asia Pacific, he was responsible for Services P&L in Great China. He led the team to innovate and launch a high-margin product in China successfully; he improved customer satisfaction and purchase rate significantly through process redesigning, sales training, incentive and Integrated Marketing Communication programs. These efforts ensured Dell was awarded \"China IT Services Award 2003\" from Computer World Magazine.  \n \nEarlier in his career, Raymond grew from a sales pioneer of IBM Software to a regional sales and marketing manager in China. Raymond recruited the first IBM national software distributor in China. He also introduced Tivoli brand into China and built its China business from scratch.  \n \nRaymond intensified his leadership, sales, services, and people management skills theoretically and practically when he was a consultant of Wilson learning, a leading global Human Performance Improvement consulting firm. Specialties:• Strong research, analysis, planning, budgeting, consulting and people management skills.  \n• Comprehensive Sales and Integrated Marketing Communication practice.  \n• Life cycle product and brand management in Asian countries.  \n• Leader with entrepreneurial spirits, creative thinker and problem solver.  \n• Fluent in English and Chinese (Mandarin, Shanghai Dialect) Multilingual business executive of IT and software industries with over 18 years of experience in strategic planning, business development, sales, marketing, product management, services and operation. Extensive expertise and practice in China with significant achievements.  \n \nAs a Certified International Trade Professional, Raymond brings vital opportunities to occidental entrepreneurs in such a global economic turmoil by introducing their enterprises into China and penetrating this largest emerging market. Raymond held several International Business Consulting positions in government and private organizations after he migrated to Canada in 2006.  \n \nBefore that, Raymond was Senior Manager of International Business in HP Global Delivery China Centre, the second largest delivery force of HP with over 2000 engineers. He developed US market and won the first US end user contract from the world’s largest automaker.  \n \nWhen he was Senior Manager, Services Division of Dell Asia Pacific, he was responsible for Services P&L in Great China. He led the team to innovate and launch a high-margin product in China successfully; he improved customer satisfaction and purchase rate significantly through process redesigning, sales training, incentive and Integrated Marketing Communication programs. These efforts ensured Dell was awarded \"China IT Services Award 2003\" from Computer World Magazine.  \n \nEarlier in his career, Raymond grew from a sales pioneer of IBM Software to a regional sales and marketing manager in China. Raymond recruited the first IBM national software distributor in China. He also introduced Tivoli brand into China and built its China business from scratch.  \n \nRaymond intensified his leadership, sales, services, and people management skills theoretically and practically when he was a consultant of Wilson learning, a leading global Human Performance Improvement consulting firm. Specialties:• Strong research, analysis, planning, budgeting, consulting and people management skills.  \n• Comprehensive Sales and Integrated Marketing Communication practice.  \n• Life cycle product and brand management in Asian countries.  \n• Leader with entrepreneurial spirits, creative thinker and problem solver.  \n• Fluent in English and Chinese (Mandarin, Shanghai Dialect) Experience Business Development Leader, Senior Managing Consultant －Manager IBM Global Business Services August 2014  – Present (1 year 1 month) WebSphere Leader, East & Central China IBM March 2012  – Present (3 years 6 months) Shanghai, China Business Development Executive, Global Delivery Center IBM January 2010  –  February 2012  (2 years 2 months) Director, International Business GEONG Canada 2008  –  2009  (1 year) Senior Manager, International Business HP 2004  –  2006  (2 years) Senior Marketing Manager DELL Computer 2001  –  2003  (2 years) Engagement Manager Wilson Learing Consulting 2000  –  2001  (1 year) Co-Founder, Entrepreneur Chun Rui Technology 2000  –  2001  (1 year) Marketing Manager IBM 1995  –  2000  (5 years) Sales Engineer Microtek International Inc 1993  –  1994  (1 year) Business Development Leader, Senior Managing Consultant －Manager IBM Global Business Services August 2014  – Present (1 year 1 month) Business Development Leader, Senior Managing Consultant －Manager IBM Global Business Services August 2014  – Present (1 year 1 month) WebSphere Leader, East & Central China IBM March 2012  – Present (3 years 6 months) Shanghai, China WebSphere Leader, East & Central China IBM March 2012  – Present (3 years 6 months) Shanghai, China Business Development Executive, Global Delivery Center IBM January 2010  –  February 2012  (2 years 2 months) Business Development Executive, Global Delivery Center IBM January 2010  –  February 2012  (2 years 2 months) Director, International Business GEONG Canada 2008  –  2009  (1 year) Director, International Business GEONG Canada 2008  –  2009  (1 year) Senior Manager, International Business HP 2004  –  2006  (2 years) Senior Manager, International Business HP 2004  –  2006  (2 years) Senior Marketing Manager DELL Computer 2001  –  2003  (2 years) Senior Marketing Manager DELL Computer 2001  –  2003  (2 years) Engagement Manager Wilson Learing Consulting 2000  –  2001  (1 year) Engagement Manager Wilson Learing Consulting 2000  –  2001  (1 year) Co-Founder, Entrepreneur Chun Rui Technology 2000  –  2001  (1 year) Co-Founder, Entrepreneur Chun Rui Technology 2000  –  2001  (1 year) Marketing Manager IBM 1995  –  2000  (5 years) Marketing Manager IBM 1995  –  2000  (5 years) Sales Engineer Microtek International Inc 1993  –  1994  (1 year) Sales Engineer Microtek International Inc 1993  –  1994  (1 year) Languages Chinese English Shanghai Dialect Chinese English Shanghai Dialect Chinese English Shanghai Dialect Skills Project Planning Analysis Budgets Research Product Management Business Development Go-to-market Strategy Business Strategy Competitive Analysis Program Management Strategic Partnerships Business Analysis CRM Product Marketing Management Consulting Marketing Strategy Leadership Marketing See 3+     See less Skills  Project Planning Analysis Budgets Research Product Management Business Development Go-to-market Strategy Business Strategy Competitive Analysis Program Management Strategic Partnerships Business Analysis CRM Product Marketing Management Consulting Marketing Strategy Leadership Marketing See 3+     See less Project Planning Analysis Budgets Research Product Management Business Development Go-to-market Strategy Business Strategy Competitive Analysis Program Management Strategic Partnerships Business Analysis CRM Product Marketing Management Consulting Marketing Strategy Leadership Marketing See 3+     See less Project Planning Analysis Budgets Research Product Management Business Development Go-to-market Strategy Business Strategy Competitive Analysis Program Management Strategic Partnerships Business Analysis CRM Product Marketing Management Consulting Marketing Strategy Leadership Marketing See 3+     See less Education Certified International Trade Professional Diploma 2006  – 2007 Chartered Marketing Institute of HongKong Diploma 1996  – 1997 Fudan University Graduated Courses 1991  – 1993 Certified International Trade Professional Diploma 2006  – 2007 Certified International Trade Professional Diploma 2006  – 2007 Certified International Trade Professional Diploma 2006  – 2007 Chartered Marketing Institute of HongKong Diploma 1996  – 1997 Chartered Marketing Institute of HongKong Diploma 1996  – 1997 Chartered Marketing Institute of HongKong Diploma 1996  – 1997 Fudan University Graduated Courses 1991  – 1993 Fudan University Graduated Courses 1991  – 1993 Fudan University Graduated Courses 1991  – 1993 ", "Summary SAP FICO Managing Consultant Summary SAP FICO Managing Consultant SAP FICO Managing Consultant SAP FICO Managing Consultant Experience MANAGING CONSULTANT--MANAGER IBM January 2005  – Present (10 years 8 months) Shanghai City, China Managing consultant IBM 2005  – Present (10 years) MANAGING CONSULTANT--MANAGER IBM January 2005  – Present (10 years 8 months) Shanghai City, China MANAGING CONSULTANT--MANAGER IBM January 2005  – Present (10 years 8 months) Shanghai City, China Managing consultant IBM 2005  – Present (10 years) Managing consultant IBM 2005  – Present (10 years) Languages English English English Skills SAP ERP SAP R/3 ERP SAP SAP FICO SAP BPC SAP Implementation Business Process Project Manager Team leader SAP FIN Service area... Skills  SAP ERP SAP R/3 ERP SAP SAP FICO SAP BPC SAP Implementation Business Process Project Manager Team leader SAP FIN Service area... SAP ERP SAP R/3 ERP SAP SAP FICO SAP BPC SAP Implementation Business Process Project Manager Team leader SAP FIN Service area... SAP ERP SAP R/3 ERP SAP SAP FICO SAP BPC SAP Implementation Business Process Project Manager Team leader SAP FIN Service area... Education Shanghai University of Finance and Ecnomics Master's degree,  Accounting Shanghai University of Finance and Ecnomics Master's degree,  Accounting Shanghai University of Finance and Ecnomics Master's degree,  Accounting Shanghai University of Finance and Ecnomics Master's degree,  Accounting ", "Summary Erick Ma is the director in Accenture Digital and the Digital (Mobility, IoT, Connected Products) Transformation Lead in Greater China, who focusing on business and technology innovation; industrial Internet strategy planning and transformation; platform design, deployment and operation vs new revenue generation, cost reduction and operation efficiency; insightful offering building and program management. \n-- He has over 13 years of consulting and professional services experience in the Resource, technology, communications and manufacture industries.  \n-- His area of expertise includes new digital strategy, innovation and transformation, connected products, IT strategy, Enterprise Architecture, and Enterprise Application (SAP ERP, SCM etc.).  \n-- He has engaged deeply in the China Largest Resource Enterprise (Utility, Nature Resource) on their Customer Service, Sales and Enterprise Operation transformation initiatives by leveraging digital service to refine and innovate their strategies and business direction.  \n-- He has hands-on experience in the development and deployment of digital ecosystem by involve Accenture Partners, Client Partners and Accenture Internal Stakeholders. \n-- He has extensive experience on Demand Generation , Campaign planning and execution to drive multi-Million Sales (10+) Target. \n \n \n•\tIndustrial Internet strategy planning and operation \n•\tDigital (Mobility, IoT and Big Data) Transformation and Consulting \n•\tEnterprise Architecture Planning and Design \n•\tLarge Scale Project Management \n•\tSAP ERP and SCM \n•\tSolution Design and Implementation \n•\tTeam Leading and Management Summary Erick Ma is the director in Accenture Digital and the Digital (Mobility, IoT, Connected Products) Transformation Lead in Greater China, who focusing on business and technology innovation; industrial Internet strategy planning and transformation; platform design, deployment and operation vs new revenue generation, cost reduction and operation efficiency; insightful offering building and program management. \n-- He has over 13 years of consulting and professional services experience in the Resource, technology, communications and manufacture industries.  \n-- His area of expertise includes new digital strategy, innovation and transformation, connected products, IT strategy, Enterprise Architecture, and Enterprise Application (SAP ERP, SCM etc.).  \n-- He has engaged deeply in the China Largest Resource Enterprise (Utility, Nature Resource) on their Customer Service, Sales and Enterprise Operation transformation initiatives by leveraging digital service to refine and innovate their strategies and business direction.  \n-- He has hands-on experience in the development and deployment of digital ecosystem by involve Accenture Partners, Client Partners and Accenture Internal Stakeholders. \n-- He has extensive experience on Demand Generation , Campaign planning and execution to drive multi-Million Sales (10+) Target. \n \n \n•\tIndustrial Internet strategy planning and operation \n•\tDigital (Mobility, IoT and Big Data) Transformation and Consulting \n•\tEnterprise Architecture Planning and Design \n•\tLarge Scale Project Management \n•\tSAP ERP and SCM \n•\tSolution Design and Implementation \n•\tTeam Leading and Management Erick Ma is the director in Accenture Digital and the Digital (Mobility, IoT, Connected Products) Transformation Lead in Greater China, who focusing on business and technology innovation; industrial Internet strategy planning and transformation; platform design, deployment and operation vs new revenue generation, cost reduction and operation efficiency; insightful offering building and program management. \n-- He has over 13 years of consulting and professional services experience in the Resource, technology, communications and manufacture industries.  \n-- His area of expertise includes new digital strategy, innovation and transformation, connected products, IT strategy, Enterprise Architecture, and Enterprise Application (SAP ERP, SCM etc.).  \n-- He has engaged deeply in the China Largest Resource Enterprise (Utility, Nature Resource) on their Customer Service, Sales and Enterprise Operation transformation initiatives by leveraging digital service to refine and innovate their strategies and business direction.  \n-- He has hands-on experience in the development and deployment of digital ecosystem by involve Accenture Partners, Client Partners and Accenture Internal Stakeholders. \n-- He has extensive experience on Demand Generation , Campaign planning and execution to drive multi-Million Sales (10+) Target. \n \n \n•\tIndustrial Internet strategy planning and operation \n•\tDigital (Mobility, IoT and Big Data) Transformation and Consulting \n•\tEnterprise Architecture Planning and Design \n•\tLarge Scale Project Management \n•\tSAP ERP and SCM \n•\tSolution Design and Implementation \n•\tTeam Leading and Management Erick Ma is the director in Accenture Digital and the Digital (Mobility, IoT, Connected Products) Transformation Lead in Greater China, who focusing on business and technology innovation; industrial Internet strategy planning and transformation; platform design, deployment and operation vs new revenue generation, cost reduction and operation efficiency; insightful offering building and program management. \n-- He has over 13 years of consulting and professional services experience in the Resource, technology, communications and manufacture industries.  \n-- His area of expertise includes new digital strategy, innovation and transformation, connected products, IT strategy, Enterprise Architecture, and Enterprise Application (SAP ERP, SCM etc.).  \n-- He has engaged deeply in the China Largest Resource Enterprise (Utility, Nature Resource) on their Customer Service, Sales and Enterprise Operation transformation initiatives by leveraging digital service to refine and innovate their strategies and business direction.  \n-- He has hands-on experience in the development and deployment of digital ecosystem by involve Accenture Partners, Client Partners and Accenture Internal Stakeholders. \n-- He has extensive experience on Demand Generation , Campaign planning and execution to drive multi-Million Sales (10+) Target. \n \n \n•\tIndustrial Internet strategy planning and operation \n•\tDigital (Mobility, IoT and Big Data) Transformation and Consulting \n•\tEnterprise Architecture Planning and Design \n•\tLarge Scale Project Management \n•\tSAP ERP and SCM \n•\tSolution Design and Implementation \n•\tTeam Leading and Management Experience Director of Industrial Internet Accenture September 2014  – Present (1 year) Beijing City, China 1) Digital Platform design and deploy regarding the intelligent robot and UAV flight plan, data collection, integration and analytics. \n2) Intelligent plant solution development \n3) Campaign plan and execution Director Of Sales And Consulting Accenture August 2012  –  August 2014  (2 years 1 month) beijing city, china Consulting Lead of Digital Operation and Transformation. Senior Managing Consultant-Manager IBM August 2011  –  August 2012  (1 year 1 month) Beijing * Take the leading architect Role \n* Take the project manager Role \n* Take the people development Role \n* Take the business development Role Managing Consultant-Manager IBM August 2008  –  August 2011  (3 years 1 month) Technical Consulting Lead Managing Consultant IBM August 2006  –  July 2008  (2 years) Tech Lead Consultant SAP 2004  –  2005  (1 year) ERP Consultant Director of Industrial Internet Accenture September 2014  – Present (1 year) Beijing City, China 1) Digital Platform design and deploy regarding the intelligent robot and UAV flight plan, data collection, integration and analytics. \n2) Intelligent plant solution development \n3) Campaign plan and execution Director of Industrial Internet Accenture September 2014  – Present (1 year) Beijing City, China 1) Digital Platform design and deploy regarding the intelligent robot and UAV flight plan, data collection, integration and analytics. \n2) Intelligent plant solution development \n3) Campaign plan and execution Director Of Sales And Consulting Accenture August 2012  –  August 2014  (2 years 1 month) beijing city, china Consulting Lead of Digital Operation and Transformation. Director Of Sales And Consulting Accenture August 2012  –  August 2014  (2 years 1 month) beijing city, china Consulting Lead of Digital Operation and Transformation. Senior Managing Consultant-Manager IBM August 2011  –  August 2012  (1 year 1 month) Beijing * Take the leading architect Role \n* Take the project manager Role \n* Take the people development Role \n* Take the business development Role Senior Managing Consultant-Manager IBM August 2011  –  August 2012  (1 year 1 month) Beijing * Take the leading architect Role \n* Take the project manager Role \n* Take the people development Role \n* Take the business development Role Managing Consultant-Manager IBM August 2008  –  August 2011  (3 years 1 month) Technical Consulting Lead Managing Consultant-Manager IBM August 2008  –  August 2011  (3 years 1 month) Technical Consulting Lead Managing Consultant IBM August 2006  –  July 2008  (2 years) Tech Lead Managing Consultant IBM August 2006  –  July 2008  (2 years) Tech Lead Consultant SAP 2004  –  2005  (1 year) ERP Consultant Consultant SAP 2004  –  2005  (1 year) ERP Consultant Languages   Skills Skills     ", "Experience Managing Consultant / Manager IBM Global Business Services December 2004  – Present (10 years 9 months) Managing Consultant / Manager IBM Global Business Services December 2004  – Present (10 years 9 months) Managing Consultant / Manager IBM Global Business Services December 2004  – Present (10 years 9 months) Skills Solution Architecture SOA EAI Middleware Enterprise Architecture Integration Websphere Architecture Business Process Design ESB Cloud Computing Skills  Solution Architecture SOA EAI Middleware Enterprise Architecture Integration Websphere Architecture Business Process Design ESB Cloud Computing Solution Architecture SOA EAI Middleware Enterprise Architecture Integration Websphere Architecture Business Process Design ESB Cloud Computing Solution Architecture SOA EAI Middleware Enterprise Architecture Integration Websphere Architecture Business Process Design ESB Cloud Computing Education University of Groningen MSc,  Technical Computing Science (drs.) University of Groningen MSc,  Technical Computing Science (drs.) University of Groningen MSc,  Technical Computing Science (drs.) University of Groningen MSc,  Technical Computing Science (drs.) ", "Languages English Full professional proficiency Italian Native or bilingual proficiency German Full professional proficiency English Full professional proficiency Italian Native or bilingual proficiency German Full professional proficiency English Full professional proficiency Italian Native or bilingual proficiency German Full professional proficiency Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills IT Strategy Business Transformation Solution Architecture Enterprise Architecture Management Change Management IT Outsourcing Business Development Business Intelligence Integration Data Warehousing Business Analysis Management Consulting Software Project... CRM Strategy Business Process Pre-sales Leadership Enterprise Software Business Process... See 6+     See less Skills  IT Strategy Business Transformation Solution Architecture Enterprise Architecture Management Change Management IT Outsourcing Business Development Business Intelligence Integration Data Warehousing Business Analysis Management Consulting Software Project... CRM Strategy Business Process Pre-sales Leadership Enterprise Software Business Process... See 6+     See less IT Strategy Business Transformation Solution Architecture Enterprise Architecture Management Change Management IT Outsourcing Business Development Business Intelligence Integration Data Warehousing Business Analysis Management Consulting Software Project... CRM Strategy Business Process Pre-sales Leadership Enterprise Software Business Process... See 6+     See less IT Strategy Business Transformation Solution Architecture Enterprise Architecture Management Change Management IT Outsourcing Business Development Business Intelligence Integration Data Warehousing Business Analysis Management Consulting Software Project... CRM Strategy Business Process Pre-sales Leadership Enterprise Software Business Process... See 6+     See less ", "Skills ITIL IT Service Management IT Strategy Solution Architecture Enterprise Architecture Requirements Analysis SOA Business Intelligence Business Transformation Outsourcing Project Planning Management Strategy Skills  ITIL IT Service Management IT Strategy Solution Architecture Enterprise Architecture Requirements Analysis SOA Business Intelligence Business Transformation Outsourcing Project Planning Management Strategy ITIL IT Service Management IT Strategy Solution Architecture Enterprise Architecture Requirements Analysis SOA Business Intelligence Business Transformation Outsourcing Project Planning Management Strategy ITIL IT Service Management IT Strategy Solution Architecture Enterprise Architecture Requirements Analysis SOA Business Intelligence Business Transformation Outsourcing Project Planning Management Strategy ", "Languages English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Business Analysis Enterprise Architecture Consulting Solution Architecture Software Project... IT Strategy Team Leadership Technical Project... Professional Services Business Intelligence Business Process Design Manage Complex Projects Strategic Thinking Contract Negotiation Leadership 管理咨询 IT 战略 领导力 策略 管理人员 项目管理 咨询 电信 See 8+     See less Skills  Business Analysis Enterprise Architecture Consulting Solution Architecture Software Project... IT Strategy Team Leadership Technical Project... Professional Services Business Intelligence Business Process Design Manage Complex Projects Strategic Thinking Contract Negotiation Leadership 管理咨询 IT 战略 领导力 策略 管理人员 项目管理 咨询 电信 See 8+     See less Business Analysis Enterprise Architecture Consulting Solution Architecture Software Project... IT Strategy Team Leadership Technical Project... Professional Services Business Intelligence Business Process Design Manage Complex Projects Strategic Thinking Contract Negotiation Leadership 管理咨询 IT 战略 领导力 策略 管理人员 项目管理 咨询 电信 See 8+     See less Business Analysis Enterprise Architecture Consulting Solution Architecture Software Project... IT Strategy Team Leadership Technical Project... Professional Services Business Intelligence Business Process Design Manage Complex Projects Strategic Thinking Contract Negotiation Leadership 管理咨询 IT 战略 领导力 策略 管理人员 项目管理 咨询 电信 See 8+     See less ", "Experience Sr. Managing Consultant - Manager IBM Sr. Managing Consultant - Manager IBM Sr. Managing Consultant - Manager IBM ", "Experience Associate Director Capgemini September 2011  – Present (4 years) China Looking for new Challenges Managing Consultant-Manager IBM April 2006  –  September 2011  (5 years 6 months) \tSGM Global Pricing project \n\tChery S&C project \n\tiLog Solution Leader \n\tDongFeng Honda S&C Project \n\tERP/SCM Integration Team Leader \n\tShangHai GM DFS Phase II project. \n\tSouth-East Motor MPS Project Senior Consultant JDA Software February 2004  –  April 2006  (2 years 3 months) SCM IT Architect GIT April 2002  –  February 2004  (1 year 11 months) GIT Inc., A leading software and services provider of bank business in china. \n\tJiLing Construct Bank’s Internet Bank Project. \n\tBeijing Construct Bank’s Foreign Currency Exchange System Project. \n\tWuhu Commercial Bank’s Credit System Project. Associate Director Capgemini September 2011  – Present (4 years) China Looking for new Challenges Associate Director Capgemini September 2011  – Present (4 years) China Looking for new Challenges Managing Consultant-Manager IBM April 2006  –  September 2011  (5 years 6 months) \tSGM Global Pricing project \n\tChery S&C project \n\tiLog Solution Leader \n\tDongFeng Honda S&C Project \n\tERP/SCM Integration Team Leader \n\tShangHai GM DFS Phase II project. \n\tSouth-East Motor MPS Project Managing Consultant-Manager IBM April 2006  –  September 2011  (5 years 6 months) \tSGM Global Pricing project \n\tChery S&C project \n\tiLog Solution Leader \n\tDongFeng Honda S&C Project \n\tERP/SCM Integration Team Leader \n\tShangHai GM DFS Phase II project. \n\tSouth-East Motor MPS Project Senior Consultant JDA Software February 2004  –  April 2006  (2 years 3 months) SCM Senior Consultant JDA Software February 2004  –  April 2006  (2 years 3 months) SCM IT Architect GIT April 2002  –  February 2004  (1 year 11 months) GIT Inc., A leading software and services provider of bank business in china. \n\tJiLing Construct Bank’s Internet Bank Project. \n\tBeijing Construct Bank’s Foreign Currency Exchange System Project. \n\tWuhu Commercial Bank’s Credit System Project. IT Architect GIT April 2002  –  February 2004  (1 year 11 months) GIT Inc., A leading software and services provider of bank business in china. \n\tJiLing Construct Bank’s Internet Bank Project. \n\tBeijing Construct Bank’s Foreign Currency Exchange System Project. \n\tWuhu Commercial Bank’s Credit System Project. Skills SCM IT Strategy IT architectures Software Configuration... Requirements Analysis Computer Architecture Databases Integration Pre-sales Software Project... Consulting Management ERP Skills  SCM IT Strategy IT architectures Software Configuration... Requirements Analysis Computer Architecture Databases Integration Pre-sales Software Project... Consulting Management ERP SCM IT Strategy IT architectures Software Configuration... Requirements Analysis Computer Architecture Databases Integration Pre-sales Software Project... Consulting Management ERP SCM IT Strategy IT architectures Software Configuration... Requirements Analysis Computer Architecture Databases Integration Pre-sales Software Project... Consulting Management ERP ", "Summary •\t14 years of full time industry experience in the field of IT. \n•\tCertified PMP by PMI \n•\t7 years of Project and Delivery Management experience managing global projects across various geographies ( customers in Americas, UK, Europe,Japan and China), including responsibility of managing people for over 7 years.  \n•\tHave varied project execution experience – ground-up, Application Maintenance, Production Support and Product Implementation & Customization; having exposure to the entire SDLC life-cycle. \n•\tResponsible for the successful delivery of a number of complex Application deployments .Managed IBM Sterling OMS,MCS,SI integration projects. \n•\t3 years of Practice management – Growing practice by hiring , on boarding and enabling new members, vendor management and contractor on boarding, Staffing OMS Practice team, managed peak team size of 40 team members, Career Management of team members  \n•\tVaried domain experience includes: Retail, Insurance, Aerospace, Finance verticals \n•\tExtensive client interaction for delivery management. \n•\tHands on experience in Java, Servlets, Beans and MVC architecture. \n•\tHands on experience using Informatica tool for datawarehousing Summary •\t14 years of full time industry experience in the field of IT. \n•\tCertified PMP by PMI \n•\t7 years of Project and Delivery Management experience managing global projects across various geographies ( customers in Americas, UK, Europe,Japan and China), including responsibility of managing people for over 7 years.  \n•\tHave varied project execution experience – ground-up, Application Maintenance, Production Support and Product Implementation & Customization; having exposure to the entire SDLC life-cycle. \n•\tResponsible for the successful delivery of a number of complex Application deployments .Managed IBM Sterling OMS,MCS,SI integration projects. \n•\t3 years of Practice management – Growing practice by hiring , on boarding and enabling new members, vendor management and contractor on boarding, Staffing OMS Practice team, managed peak team size of 40 team members, Career Management of team members  \n•\tVaried domain experience includes: Retail, Insurance, Aerospace, Finance verticals \n•\tExtensive client interaction for delivery management. \n•\tHands on experience in Java, Servlets, Beans and MVC architecture. \n•\tHands on experience using Informatica tool for datawarehousing •\t14 years of full time industry experience in the field of IT. \n•\tCertified PMP by PMI \n•\t7 years of Project and Delivery Management experience managing global projects across various geographies ( customers in Americas, UK, Europe,Japan and China), including responsibility of managing people for over 7 years.  \n•\tHave varied project execution experience – ground-up, Application Maintenance, Production Support and Product Implementation & Customization; having exposure to the entire SDLC life-cycle. \n•\tResponsible for the successful delivery of a number of complex Application deployments .Managed IBM Sterling OMS,MCS,SI integration projects. \n•\t3 years of Practice management – Growing practice by hiring , on boarding and enabling new members, vendor management and contractor on boarding, Staffing OMS Practice team, managed peak team size of 40 team members, Career Management of team members  \n•\tVaried domain experience includes: Retail, Insurance, Aerospace, Finance verticals \n•\tExtensive client interaction for delivery management. \n•\tHands on experience in Java, Servlets, Beans and MVC architecture. \n•\tHands on experience using Informatica tool for datawarehousing •\t14 years of full time industry experience in the field of IT. \n•\tCertified PMP by PMI \n•\t7 years of Project and Delivery Management experience managing global projects across various geographies ( customers in Americas, UK, Europe,Japan and China), including responsibility of managing people for over 7 years.  \n•\tHave varied project execution experience – ground-up, Application Maintenance, Production Support and Product Implementation & Customization; having exposure to the entire SDLC life-cycle. \n•\tResponsible for the successful delivery of a number of complex Application deployments .Managed IBM Sterling OMS,MCS,SI integration projects. \n•\t3 years of Practice management – Growing practice by hiring , on boarding and enabling new members, vendor management and contractor on boarding, Staffing OMS Practice team, managed peak team size of 40 team members, Career Management of team members  \n•\tVaried domain experience includes: Retail, Insurance, Aerospace, Finance verticals \n•\tExtensive client interaction for delivery management. \n•\tHands on experience in Java, Servlets, Beans and MVC architecture. \n•\tHands on experience using Informatica tool for datawarehousing Experience Managing Consultant (Manager) IBM January 2011  – Present (4 years 8 months) Project Manager Sterling Commerce October 2007  –  December 2010  (3 years 3 months) Project Manager iGATE Global Solutions August 1999  –  October 2007  (8 years 3 months) Project Management project Manager Igate 1999  –  2007  (8 years) Managing Consultant (Manager) IBM January 2011  – Present (4 years 8 months) Managing Consultant (Manager) IBM January 2011  – Present (4 years 8 months) Project Manager Sterling Commerce October 2007  –  December 2010  (3 years 3 months) Project Manager Sterling Commerce October 2007  –  December 2010  (3 years 3 months) Project Manager iGATE Global Solutions August 1999  –  October 2007  (8 years 3 months) Project Management Project Manager iGATE Global Solutions August 1999  –  October 2007  (8 years 3 months) Project Management project Manager Igate 1999  –  2007  (8 years) project Manager Igate 1999  –  2007  (8 years) Languages English English English Skills Software Project... SDLC Order Management Global Delivery Program Management Project Governance Websphere Business Analysis Oracle Agile Methodologies Java Enterprise Edition Resource Management Agile Project Management DB2 Weblogic Requirements Analysis See 1+     See less Skills  Software Project... SDLC Order Management Global Delivery Program Management Project Governance Websphere Business Analysis Oracle Agile Methodologies Java Enterprise Edition Resource Management Agile Project Management DB2 Weblogic Requirements Analysis See 1+     See less Software Project... SDLC Order Management Global Delivery Program Management Project Governance Websphere Business Analysis Oracle Agile Methodologies Java Enterprise Edition Resource Management Agile Project Management DB2 Weblogic Requirements Analysis See 1+     See less Software Project... SDLC Order Management Global Delivery Program Management Project Governance Websphere Business Analysis Oracle Agile Methodologies Java Enterprise Edition Resource Management Agile Project Management DB2 Weblogic Requirements Analysis See 1+     See less Education IIT Madras Master of Science (M.Sc.),  Mathematics 1997  – 1999 IIT Madras Master of Science (M.Sc.),  Mathematics 1997  – 1999 IIT Madras Master of Science (M.Sc.),  Mathematics 1997  – 1999 IIT Madras Master of Science (M.Sc.),  Mathematics 1997  – 1999 ", "Experience Senior Managing Consultant Manager IBM May 2010  – Present (5 years 4 months) Manager Services Sterling Commerce June 2005  –  May 2010  (5 years) Manager Services Nistevo 1998  –  2002  (4 years) Work guy LaserMaster 1991  –  1997  (6 years) Senior Managing Consultant Manager IBM May 2010  – Present (5 years 4 months) Senior Managing Consultant Manager IBM May 2010  – Present (5 years 4 months) Manager Services Sterling Commerce June 2005  –  May 2010  (5 years) Manager Services Sterling Commerce June 2005  –  May 2010  (5 years) Manager Services Nistevo 1998  –  2002  (4 years) Manager Services Nistevo 1998  –  2002  (4 years) Work guy LaserMaster 1991  –  1997  (6 years) Work guy LaserMaster 1991  –  1997  (6 years) Skills Business Analysis Enterprise Software Cloud Computing Business Process SaaS ERP Solution Architecture Professional Services IT Strategy Cross-functional Team... Process Improvement Business Intelligence Skills  Business Analysis Enterprise Software Cloud Computing Business Process SaaS ERP Solution Architecture Professional Services IT Strategy Cross-functional Team... Process Improvement Business Intelligence Business Analysis Enterprise Software Cloud Computing Business Process SaaS ERP Solution Architecture Professional Services IT Strategy Cross-functional Team... Process Improvement Business Intelligence Business Analysis Enterprise Software Cloud Computing Business Process SaaS ERP Solution Architecture Professional Services IT Strategy Cross-functional Team... Process Improvement Business Intelligence ", "Summary More than 21 years of working experience including over 15 years of SAP and 2 years of Symix ERP solution delivery experience with all project stages including project proposal, planning, requirements determination, gap analysis, business process reengineering, issue resolution, configuration, testing, data conversion, custom code specifications, training and go-live assistance etc. Experienced as a program/project manager to lead the delivery of consulting service in a broad range of organizations, people, process, technology matrix environments. Industries covered: manufacturing& supply chain, iron, high-tech, semiconductor, gas and oil, trade, food/beverage etc. \nWorked as not only a SAP consulting service provider but also an expert on business processes design, especially on purchasing, marketing and sales activities, integration costing, import/export business, various legal and statutory reports of laws and tax, revenue recognition etc., prototype design of projects such as business and system integration planning, business gap analysis etc. \n \nSpecialties: Expertise in overall business consulting and operation management with leadership and industry insight.  \nSupply Chain Analyst, Procurement, Marketing and sales processes, even account and tax advisor. \nProject management, experience in consulting services, change management, pre-sales, training, technical support.  \nSAP primary knowledge is on MM & SD functionalities; and also extensive SAP experience with FI/CO, QM, CS and EBP functionalities. Summary More than 21 years of working experience including over 15 years of SAP and 2 years of Symix ERP solution delivery experience with all project stages including project proposal, planning, requirements determination, gap analysis, business process reengineering, issue resolution, configuration, testing, data conversion, custom code specifications, training and go-live assistance etc. Experienced as a program/project manager to lead the delivery of consulting service in a broad range of organizations, people, process, technology matrix environments. Industries covered: manufacturing& supply chain, iron, high-tech, semiconductor, gas and oil, trade, food/beverage etc. \nWorked as not only a SAP consulting service provider but also an expert on business processes design, especially on purchasing, marketing and sales activities, integration costing, import/export business, various legal and statutory reports of laws and tax, revenue recognition etc., prototype design of projects such as business and system integration planning, business gap analysis etc. \n \nSpecialties: Expertise in overall business consulting and operation management with leadership and industry insight.  \nSupply Chain Analyst, Procurement, Marketing and sales processes, even account and tax advisor. \nProject management, experience in consulting services, change management, pre-sales, training, technical support.  \nSAP primary knowledge is on MM & SD functionalities; and also extensive SAP experience with FI/CO, QM, CS and EBP functionalities. More than 21 years of working experience including over 15 years of SAP and 2 years of Symix ERP solution delivery experience with all project stages including project proposal, planning, requirements determination, gap analysis, business process reengineering, issue resolution, configuration, testing, data conversion, custom code specifications, training and go-live assistance etc. Experienced as a program/project manager to lead the delivery of consulting service in a broad range of organizations, people, process, technology matrix environments. Industries covered: manufacturing& supply chain, iron, high-tech, semiconductor, gas and oil, trade, food/beverage etc. \nWorked as not only a SAP consulting service provider but also an expert on business processes design, especially on purchasing, marketing and sales activities, integration costing, import/export business, various legal and statutory reports of laws and tax, revenue recognition etc., prototype design of projects such as business and system integration planning, business gap analysis etc. \n \nSpecialties: Expertise in overall business consulting and operation management with leadership and industry insight.  \nSupply Chain Analyst, Procurement, Marketing and sales processes, even account and tax advisor. \nProject management, experience in consulting services, change management, pre-sales, training, technical support.  \nSAP primary knowledge is on MM & SD functionalities; and also extensive SAP experience with FI/CO, QM, CS and EBP functionalities. More than 21 years of working experience including over 15 years of SAP and 2 years of Symix ERP solution delivery experience with all project stages including project proposal, planning, requirements determination, gap analysis, business process reengineering, issue resolution, configuration, testing, data conversion, custom code specifications, training and go-live assistance etc. Experienced as a program/project manager to lead the delivery of consulting service in a broad range of organizations, people, process, technology matrix environments. Industries covered: manufacturing& supply chain, iron, high-tech, semiconductor, gas and oil, trade, food/beverage etc. \nWorked as not only a SAP consulting service provider but also an expert on business processes design, especially on purchasing, marketing and sales activities, integration costing, import/export business, various legal and statutory reports of laws and tax, revenue recognition etc., prototype design of projects such as business and system integration planning, business gap analysis etc. \n \nSpecialties: Expertise in overall business consulting and operation management with leadership and industry insight.  \nSupply Chain Analyst, Procurement, Marketing and sales processes, even account and tax advisor. \nProject management, experience in consulting services, change management, pre-sales, training, technical support.  \nSAP primary knowledge is on MM & SD functionalities; and also extensive SAP experience with FI/CO, QM, CS and EBP functionalities. Experience Senior Managing Consultant Manager IBM June 2011  – Present (4 years 3 months) Shanghai Consulting Manager Deloitte Consulting April 2007  –  June 2011  (4 years 3 months) Responsibilities span across project management, developing project proposals, projects planning, customer/partner relationship management, contract procurement, budgeting & forecasting, project resources management, pre-sales technical product presentation cum demonstration. SAP consultant/Project manager Infosys China April 2006  –  April 2007  (1 year 1 month) Projects led and involved:  \nAreva SAP implementation project \nproposal and support for Johnson control System assessment SAP senior consultant Capgemini China September 2005  –  March 2006  (7 months) ABB Transformer Shanghai Company SAP implementation project SAP senior consultant Satyam Computer services Limited February 2004  –  May 2005  (1 year 4 months) SAP system consulting services,  \nProjects led and involved: \nNestle globe SAP project in India globe centre  \nCSMC Technologies Corporation (WuXi) SAP R/3 Implementation \nBP China (Shanghai) Ltd. SAP R/3 Implementation & Technical support \nMitsubishi Corporation (Shanghai) Ltd. SAP R/3 template Implementation & Technical support Senior Managing Consultant Manager IBM June 2011  – Present (4 years 3 months) Shanghai Senior Managing Consultant Manager IBM June 2011  – Present (4 years 3 months) Shanghai Consulting Manager Deloitte Consulting April 2007  –  June 2011  (4 years 3 months) Responsibilities span across project management, developing project proposals, projects planning, customer/partner relationship management, contract procurement, budgeting & forecasting, project resources management, pre-sales technical product presentation cum demonstration. Consulting Manager Deloitte Consulting April 2007  –  June 2011  (4 years 3 months) Responsibilities span across project management, developing project proposals, projects planning, customer/partner relationship management, contract procurement, budgeting & forecasting, project resources management, pre-sales technical product presentation cum demonstration. SAP consultant/Project manager Infosys China April 2006  –  April 2007  (1 year 1 month) Projects led and involved:  \nAreva SAP implementation project \nproposal and support for Johnson control System assessment SAP consultant/Project manager Infosys China April 2006  –  April 2007  (1 year 1 month) Projects led and involved:  \nAreva SAP implementation project \nproposal and support for Johnson control System assessment SAP senior consultant Capgemini China September 2005  –  March 2006  (7 months) ABB Transformer Shanghai Company SAP implementation project SAP senior consultant Capgemini China September 2005  –  March 2006  (7 months) ABB Transformer Shanghai Company SAP implementation project SAP senior consultant Satyam Computer services Limited February 2004  –  May 2005  (1 year 4 months) SAP system consulting services,  \nProjects led and involved: \nNestle globe SAP project in India globe centre  \nCSMC Technologies Corporation (WuXi) SAP R/3 Implementation \nBP China (Shanghai) Ltd. SAP R/3 Implementation & Technical support \nMitsubishi Corporation (Shanghai) Ltd. SAP R/3 template Implementation & Technical support SAP senior consultant Satyam Computer services Limited February 2004  –  May 2005  (1 year 4 months) SAP system consulting services,  \nProjects led and involved: \nNestle globe SAP project in India globe centre  \nCSMC Technologies Corporation (WuXi) SAP R/3 Implementation \nBP China (Shanghai) Ltd. SAP R/3 Implementation & Technical support \nMitsubishi Corporation (Shanghai) Ltd. SAP R/3 template Implementation & Technical support Education Jilin University B.S,  Electronic Engineering 1988  – 1992 Jilin University B.S,  Electronic Engineering 1988  – 1992 Jilin University B.S,  Electronic Engineering 1988  – 1992 Jilin University B.S,  Electronic Engineering 1988  – 1992 ", "Skills SAP R/3 Business Process Design Integration SAP Business Analysis SAP ERP Management ERP Business Process... SD SAP Implementation Solution Architecture IT Strategy Business Process Data Migration SAP Financial Program Management IT Management SAP FICO Business Transformation SAP Netweaver Business Intelligence ABAP See 8+     See less Skills  SAP R/3 Business Process Design Integration SAP Business Analysis SAP ERP Management ERP Business Process... SD SAP Implementation Solution Architecture IT Strategy Business Process Data Migration SAP Financial Program Management IT Management SAP FICO Business Transformation SAP Netweaver Business Intelligence ABAP See 8+     See less SAP R/3 Business Process Design Integration SAP Business Analysis SAP ERP Management ERP Business Process... SD SAP Implementation Solution Architecture IT Strategy Business Process Data Migration SAP Financial Program Management IT Management SAP FICO Business Transformation SAP Netweaver Business Intelligence ABAP See 8+     See less SAP R/3 Business Process Design Integration SAP Business Analysis SAP ERP Management ERP Business Process... SD SAP Implementation Solution Architecture IT Strategy Business Process Data Migration SAP Financial Program Management IT Management SAP FICO Business Transformation SAP Netweaver Business Intelligence ABAP See 8+     See less ", "Summary Over 12 years experiences in consulting industry all focus in SAP HR and HCM business consulting experience since 1999. One of the earliest SAP HR consultant in China. \nSpecialized in SAP HR implementation, project management and related business process reengineering, has been the project manager/team lead for more than 15 SAP HR projects, gained high customer satisfaction. my client includes foreign companies, JVs, China private companies and large SOEs \nWith rich complex project management skill, great insight and leadship to make team & project succeed. Summary Over 12 years experiences in consulting industry all focus in SAP HR and HCM business consulting experience since 1999. One of the earliest SAP HR consultant in China. \nSpecialized in SAP HR implementation, project management and related business process reengineering, has been the project manager/team lead for more than 15 SAP HR projects, gained high customer satisfaction. my client includes foreign companies, JVs, China private companies and large SOEs \nWith rich complex project management skill, great insight and leadship to make team & project succeed. Over 12 years experiences in consulting industry all focus in SAP HR and HCM business consulting experience since 1999. One of the earliest SAP HR consultant in China. \nSpecialized in SAP HR implementation, project management and related business process reengineering, has been the project manager/team lead for more than 15 SAP HR projects, gained high customer satisfaction. my client includes foreign companies, JVs, China private companies and large SOEs \nWith rich complex project management skill, great insight and leadship to make team & project succeed. Over 12 years experiences in consulting industry all focus in SAP HR and HCM business consulting experience since 1999. One of the earliest SAP HR consultant in China. \nSpecialized in SAP HR implementation, project management and related business process reengineering, has been the project manager/team lead for more than 15 SAP HR projects, gained high customer satisfaction. my client includes foreign companies, JVs, China private companies and large SOEs \nWith rich complex project management skill, great insight and leadship to make team & project succeed. Experience Managing Consultant Manager IBM January 2007  – Present (8 years 8 months) Managing Consultant Manager IBM January 2007  – Present (8 years 8 months) Managing Consultant Manager IBM January 2007  – Present (8 years 8 months) Skills ERP Management Consulting SAP HR SAP SAP Implementation Project Management Business Process Business Transformation Solution Architecture Pre-sales IT Strategy Business Analysis Cloud Computing SAP R/3 Integration Business Process... Business Process... Change Management See 3+     See less Skills  ERP Management Consulting SAP HR SAP SAP Implementation Project Management Business Process Business Transformation Solution Architecture Pre-sales IT Strategy Business Analysis Cloud Computing SAP R/3 Integration Business Process... Business Process... Change Management See 3+     See less ERP Management Consulting SAP HR SAP SAP Implementation Project Management Business Process Business Transformation Solution Architecture Pre-sales IT Strategy Business Analysis Cloud Computing SAP R/3 Integration Business Process... Business Process... Change Management See 3+     See less ERP Management Consulting SAP HR SAP SAP Implementation Project Management Business Process Business Transformation Solution Architecture Pre-sales IT Strategy Business Analysis Cloud Computing SAP R/3 Integration Business Process... Business Process... Change Management See 3+     See less Education University of Science and Technology of China BA 1994  – 1999 University of Science and Technology of China BA 1994  – 1999 University of Science and Technology of China BA 1994  – 1999 University of Science and Technology of China BA 1994  – 1999 ", "Summary I have over 15 years of design, development, and consulting experience on highly visible complex projects with clients across all industries. I help clients understand their business objectives and customers' needs, and then use that knowledge to design exceptional multi-channel user experiences that have a positive impact on brand awareness, customer loyalty, engagement, and revenue. \n \nMy expertise includes user experience design, information architecture, visual design, usability and accessibility, social media strategy, content strategy, technical and creative writing, and multimedia production. I am a sought after speaker, have an MS in Human Computer Interaction, and hold numerous patents for user interface design innovations. \n \nKey Skills:  \nUser Research: Contextual inquiry, card sorts, in-field and remote user interviews \nPersonas, Scenarios, and Journeys \nWireframes & Design Documentation: low fidelity and high fidelity wireframes, site maps, process flows, and content inventories \nPrototypes: low fidelity and high fidelity prototypes for usability testing and iterative development \nApplications: Axure, Omnigraffle, Visio, Adobe Creative Suite, Microsoft Office & Project, Prezi Summary I have over 15 years of design, development, and consulting experience on highly visible complex projects with clients across all industries. I help clients understand their business objectives and customers' needs, and then use that knowledge to design exceptional multi-channel user experiences that have a positive impact on brand awareness, customer loyalty, engagement, and revenue. \n \nMy expertise includes user experience design, information architecture, visual design, usability and accessibility, social media strategy, content strategy, technical and creative writing, and multimedia production. I am a sought after speaker, have an MS in Human Computer Interaction, and hold numerous patents for user interface design innovations. \n \nKey Skills:  \nUser Research: Contextual inquiry, card sorts, in-field and remote user interviews \nPersonas, Scenarios, and Journeys \nWireframes & Design Documentation: low fidelity and high fidelity wireframes, site maps, process flows, and content inventories \nPrototypes: low fidelity and high fidelity prototypes for usability testing and iterative development \nApplications: Axure, Omnigraffle, Visio, Adobe Creative Suite, Microsoft Office & Project, Prezi I have over 15 years of design, development, and consulting experience on highly visible complex projects with clients across all industries. I help clients understand their business objectives and customers' needs, and then use that knowledge to design exceptional multi-channel user experiences that have a positive impact on brand awareness, customer loyalty, engagement, and revenue. \n \nMy expertise includes user experience design, information architecture, visual design, usability and accessibility, social media strategy, content strategy, technical and creative writing, and multimedia production. I am a sought after speaker, have an MS in Human Computer Interaction, and hold numerous patents for user interface design innovations. \n \nKey Skills:  \nUser Research: Contextual inquiry, card sorts, in-field and remote user interviews \nPersonas, Scenarios, and Journeys \nWireframes & Design Documentation: low fidelity and high fidelity wireframes, site maps, process flows, and content inventories \nPrototypes: low fidelity and high fidelity prototypes for usability testing and iterative development \nApplications: Axure, Omnigraffle, Visio, Adobe Creative Suite, Microsoft Office & Project, Prezi I have over 15 years of design, development, and consulting experience on highly visible complex projects with clients across all industries. I help clients understand their business objectives and customers' needs, and then use that knowledge to design exceptional multi-channel user experiences that have a positive impact on brand awareness, customer loyalty, engagement, and revenue. \n \nMy expertise includes user experience design, information architecture, visual design, usability and accessibility, social media strategy, content strategy, technical and creative writing, and multimedia production. I am a sought after speaker, have an MS in Human Computer Interaction, and hold numerous patents for user interface design innovations. \n \nKey Skills:  \nUser Research: Contextual inquiry, card sorts, in-field and remote user interviews \nPersonas, Scenarios, and Journeys \nWireframes & Design Documentation: low fidelity and high fidelity wireframes, site maps, process flows, and content inventories \nPrototypes: low fidelity and high fidelity prototypes for usability testing and iterative development \nApplications: Axure, Omnigraffle, Visio, Adobe Creative Suite, Microsoft Office & Project, Prezi Experience User Experience Director IBM Interactive Experience May 2015  – Present (4 months) Melbourne Area, Australia Global User Experience Lead - Mobile Center of Competence IBM May 2013  –  April 2015  (2 years) Melbourne Area, Australia The Mobile Center of Competence is responsible for designing, delivering and marketing B2C, B2E, B2B, and M2M mobility solutions. I am responsible for designing compelling and intuitive mobile websites, and native and hybrid mobile apps for IBM and IBM’s clients. I also oversee user experience resources worldwide, teach mobile ux design courses, and support sales and recruiting efforts. User Experience Director / Senior Managing Consultant (Manager) IBM Interactive May 2006  –  May 2013  (7 years 1 month) Greater Chicago Area IBM Interactive is a leading interactive agency with expertise in business innovation, customer experience enablement, and technology deployment. \n \nI was responsible for designing and providing oversight for the creative strategy, usability, and design of websites, kiosks, mobile and social applications, and virtual worlds for Fortune 500 companies and non-profit organizations.  \n \nI also managed a team of IBM Interactive employees. I was responsible for setting clear performance standards, establishing development plans, providing constructive feedback, coaching, recognizing outstanding contributors and actively managing low contributors, salary planning, performance reviews, and day to day people management activities. Information Architect / Managing Consultant IBM Interactive October 2000  –  May 2006  (5 years 8 months) Greater Chicago Area I employed user centered design principles to create user profiles and scenarios, site maps, wireframes, navigational workflows, and prototypes for websites, kiosks, handheld devices, and virtual worlds. I also performed heuristic evaluations, conducted usability tests, wrote user assistance and interface content, and managed translators and editors. Information Development Lead IBM January 1999  –  October 2000  (1 year 10 months) Raleigh-Durham, North Carolina Area I evaluated and redesigned user interfaces, and authored user assistance and user interface content. I also managed Translation Verification Testing, which encompassed all aspects of product globalization including developing the test plan and test cases, and supervising translation testers. Technical Writer and Project Manager Nortel November 1997  –  January 1999  (1 year 3 months) Raleigh-Durham, North Carolina Area I developed technical documentation for end user training and server maintenance, back up, recovery, and testing. I also implemented a migration plan to move 4,000 users to a new messaging environment. Technical Writer and Project Manager IBM November 1996  –  November 1997  (1 year 1 month) Raleigh-Durham, North Carolina Area I designed an intranet site for web-based training, managed equipment rollouts, migrations, upgrades, and removals and interfaced with CIO-level management to assess needs and provide solutions. End User Support Lord Corporation September 1995  –  November 1996  (1 year 3 months) Raleigh-Durham, North Carolina Area I provided software and hardware support for a staff of 300 at four sites. Technical Writer ERM September 1994  –  September 1995  (1 year 1 month) Greater Boston Area I developed technical reports, proposals, and presentations for industrial clients and government agencies. User Experience Director IBM Interactive Experience May 2015  – Present (4 months) Melbourne Area, Australia User Experience Director IBM Interactive Experience May 2015  – Present (4 months) Melbourne Area, Australia Global User Experience Lead - Mobile Center of Competence IBM May 2013  –  April 2015  (2 years) Melbourne Area, Australia The Mobile Center of Competence is responsible for designing, delivering and marketing B2C, B2E, B2B, and M2M mobility solutions. I am responsible for designing compelling and intuitive mobile websites, and native and hybrid mobile apps for IBM and IBM’s clients. I also oversee user experience resources worldwide, teach mobile ux design courses, and support sales and recruiting efforts. Global User Experience Lead - Mobile Center of Competence IBM May 2013  –  April 2015  (2 years) Melbourne Area, Australia The Mobile Center of Competence is responsible for designing, delivering and marketing B2C, B2E, B2B, and M2M mobility solutions. I am responsible for designing compelling and intuitive mobile websites, and native and hybrid mobile apps for IBM and IBM’s clients. I also oversee user experience resources worldwide, teach mobile ux design courses, and support sales and recruiting efforts. User Experience Director / Senior Managing Consultant (Manager) IBM Interactive May 2006  –  May 2013  (7 years 1 month) Greater Chicago Area IBM Interactive is a leading interactive agency with expertise in business innovation, customer experience enablement, and technology deployment. \n \nI was responsible for designing and providing oversight for the creative strategy, usability, and design of websites, kiosks, mobile and social applications, and virtual worlds for Fortune 500 companies and non-profit organizations.  \n \nI also managed a team of IBM Interactive employees. I was responsible for setting clear performance standards, establishing development plans, providing constructive feedback, coaching, recognizing outstanding contributors and actively managing low contributors, salary planning, performance reviews, and day to day people management activities. User Experience Director / Senior Managing Consultant (Manager) IBM Interactive May 2006  –  May 2013  (7 years 1 month) Greater Chicago Area IBM Interactive is a leading interactive agency with expertise in business innovation, customer experience enablement, and technology deployment. \n \nI was responsible for designing and providing oversight for the creative strategy, usability, and design of websites, kiosks, mobile and social applications, and virtual worlds for Fortune 500 companies and non-profit organizations.  \n \nI also managed a team of IBM Interactive employees. I was responsible for setting clear performance standards, establishing development plans, providing constructive feedback, coaching, recognizing outstanding contributors and actively managing low contributors, salary planning, performance reviews, and day to day people management activities. Information Architect / Managing Consultant IBM Interactive October 2000  –  May 2006  (5 years 8 months) Greater Chicago Area I employed user centered design principles to create user profiles and scenarios, site maps, wireframes, navigational workflows, and prototypes for websites, kiosks, handheld devices, and virtual worlds. I also performed heuristic evaluations, conducted usability tests, wrote user assistance and interface content, and managed translators and editors. Information Architect / Managing Consultant IBM Interactive October 2000  –  May 2006  (5 years 8 months) Greater Chicago Area I employed user centered design principles to create user profiles and scenarios, site maps, wireframes, navigational workflows, and prototypes for websites, kiosks, handheld devices, and virtual worlds. I also performed heuristic evaluations, conducted usability tests, wrote user assistance and interface content, and managed translators and editors. Information Development Lead IBM January 1999  –  October 2000  (1 year 10 months) Raleigh-Durham, North Carolina Area I evaluated and redesigned user interfaces, and authored user assistance and user interface content. I also managed Translation Verification Testing, which encompassed all aspects of product globalization including developing the test plan and test cases, and supervising translation testers. Information Development Lead IBM January 1999  –  October 2000  (1 year 10 months) Raleigh-Durham, North Carolina Area I evaluated and redesigned user interfaces, and authored user assistance and user interface content. I also managed Translation Verification Testing, which encompassed all aspects of product globalization including developing the test plan and test cases, and supervising translation testers. Technical Writer and Project Manager Nortel November 1997  –  January 1999  (1 year 3 months) Raleigh-Durham, North Carolina Area I developed technical documentation for end user training and server maintenance, back up, recovery, and testing. I also implemented a migration plan to move 4,000 users to a new messaging environment. Technical Writer and Project Manager Nortel November 1997  –  January 1999  (1 year 3 months) Raleigh-Durham, North Carolina Area I developed technical documentation for end user training and server maintenance, back up, recovery, and testing. I also implemented a migration plan to move 4,000 users to a new messaging environment. Technical Writer and Project Manager IBM November 1996  –  November 1997  (1 year 1 month) Raleigh-Durham, North Carolina Area I designed an intranet site for web-based training, managed equipment rollouts, migrations, upgrades, and removals and interfaced with CIO-level management to assess needs and provide solutions. Technical Writer and Project Manager IBM November 1996  –  November 1997  (1 year 1 month) Raleigh-Durham, North Carolina Area I designed an intranet site for web-based training, managed equipment rollouts, migrations, upgrades, and removals and interfaced with CIO-level management to assess needs and provide solutions. End User Support Lord Corporation September 1995  –  November 1996  (1 year 3 months) Raleigh-Durham, North Carolina Area I provided software and hardware support for a staff of 300 at four sites. End User Support Lord Corporation September 1995  –  November 1996  (1 year 3 months) Raleigh-Durham, North Carolina Area I provided software and hardware support for a staff of 300 at four sites. Technical Writer ERM September 1994  –  September 1995  (1 year 1 month) Greater Boston Area I developed technical reports, proposals, and presentations for industrial clients and government agencies. Technical Writer ERM September 1994  –  September 1995  (1 year 1 month) Greater Boston Area I developed technical reports, proposals, and presentations for industrial clients and government agencies. Languages   Skills User Experience Information Architecture User Interface Design Usability Testing Usability Content Strategy Social Media Mobile Applications Social Media Marketing Digital Strategy Heuristic Evaluation Interaction Design Mobile Devices Content Management Wireframes Mobile Internet Digital Marketing Email Marketing Mobile Accessibility Interactive Marketing Social Networking Web Strategy SEO Web Design Experience Design Facebook LinkedIn Adobe Creative Suite Photography Rapid Prototyping Customer Journey Mapping Personas Digital Photography Globalization People Management Webinars Machinima Virtual Worlds Online Communities Analytics Creative Strategy Human-computer... Prototyping Digital Media Creative Direction Content Marketing Twitter Social Bookmarking Social Business See 35+     See less Skills  User Experience Information Architecture User Interface Design Usability Testing Usability Content Strategy Social Media Mobile Applications Social Media Marketing Digital Strategy Heuristic Evaluation Interaction Design Mobile Devices Content Management Wireframes Mobile Internet Digital Marketing Email Marketing Mobile Accessibility Interactive Marketing Social Networking Web Strategy SEO Web Design Experience Design Facebook LinkedIn Adobe Creative Suite Photography Rapid Prototyping Customer Journey Mapping Personas Digital Photography Globalization People Management Webinars Machinima Virtual Worlds Online Communities Analytics Creative Strategy Human-computer... Prototyping Digital Media Creative Direction Content Marketing Twitter Social Bookmarking Social Business See 35+     See less User Experience Information Architecture User Interface Design Usability Testing Usability Content Strategy Social Media Mobile Applications Social Media Marketing Digital Strategy Heuristic Evaluation Interaction Design Mobile Devices Content Management Wireframes Mobile Internet Digital Marketing Email Marketing Mobile Accessibility Interactive Marketing Social Networking Web Strategy SEO Web Design Experience Design Facebook LinkedIn Adobe Creative Suite Photography Rapid Prototyping Customer Journey Mapping Personas Digital Photography Globalization People Management Webinars Machinima Virtual Worlds Online Communities Analytics Creative Strategy Human-computer... Prototyping Digital Media Creative Direction Content Marketing Twitter Social Bookmarking Social Business See 35+     See less User Experience Information Architecture User Interface Design Usability Testing Usability Content Strategy Social Media Mobile Applications Social Media Marketing Digital Strategy Heuristic Evaluation Interaction Design Mobile Devices Content Management Wireframes Mobile Internet Digital Marketing Email Marketing Mobile Accessibility Interactive Marketing Social Networking Web Strategy SEO Web Design Experience Design Facebook LinkedIn Adobe Creative Suite Photography Rapid Prototyping Customer Journey Mapping Personas Digital Photography Globalization People Management Webinars Machinima Virtual Worlds Online Communities Analytics Creative Strategy Human-computer... Prototyping Digital Media Creative Direction Content Marketing Twitter Social Bookmarking Social Business See 35+     See less Education Rensselaer Polytechnic Institute MS,  Technical Communication (HCI) 2002  – 2003 4.0 Grade Point Average Boston University BA,  Political Science 1992  – 1994 University of Southern California Cinema Television 1990  – 1991 Rensselaer Polytechnic Institute MS,  Technical Communication (HCI) 2002  – 2003 4.0 Grade Point Average Rensselaer Polytechnic Institute MS,  Technical Communication (HCI) 2002  – 2003 4.0 Grade Point Average Rensselaer Polytechnic Institute MS,  Technical Communication (HCI) 2002  – 2003 4.0 Grade Point Average Boston University BA,  Political Science 1992  – 1994 Boston University BA,  Political Science 1992  – 1994 Boston University BA,  Political Science 1992  – 1994 University of Southern California Cinema Television 1990  – 1991 University of Southern California Cinema Television 1990  – 1991 University of Southern California Cinema Television 1990  – 1991 Honors & Awards ", "Summary CAREER PROFILE \n \nIT/OT \nProven professional with 20 years of experience covering end to end IT/OT scope; \n• Plan; Enterprise Architecture, IT Strategy, Demand management, Portfolio Management \n• Build; Program and project management, Solution Architecture \n• Run; Service Delivery,  \n• Manage; Budget & Finance, Supplier & Contracts, Organization & Governance, Compliance & Continuity, People \n \nIndustry \n• Ability to manage diversified and complex requirements, problems and solutions across business Systems (ERP, PLM, CRM, DMS, BI, HRM), industrial and infrastructure technology fields \n• Wide industry knowledge; Mining & metal: 10 / years, Manufacturing / 6y, Retail / 2y, Aerospace /2y, Electronics /2y) supporting business functions \n> Core processes; Design, Sell, Produce, Serve & support \n> Support processes; Hire to retire, Procure to Pay, Finance, Health & Safety \n \nManagement \n• Projects and program; management experience (/Planning, Organizing, leading, controlling).  \n• People; multi-disciplinary project teams up to 35 people and direct report up to 7 people. \n• Budget; Responsibility up to 2m€  \n• Stakeholder; Working experience with customers from top management to operational levels, suppliers & partners through various operating model \n \nCommunication & Analytical \n• Analytical skills oriented toward complex problem solving. Strategic thinking. Strong ability for analyzing, summarizing, planning and organizing.  \n• Ability to engage, understand and manage efficiently customers and stakeholders requirements. \n• 7 years of working experience with customers, teams and suppliers within international multicultural context. \n \nCAREER SUMMARY:\t \n2007 to date\tEnterprise and Solution Architect at Rio Tinto & Alcan  \n2001-2007\tSAP Managing Consultant & Manager at IBM Global Services \n1997-2001\tSAP Consultant and Project Manager at IBM Global Services \n1995-1997\tSoftware Developer at UNILOG \n \n Summary CAREER PROFILE \n \nIT/OT \nProven professional with 20 years of experience covering end to end IT/OT scope; \n• Plan; Enterprise Architecture, IT Strategy, Demand management, Portfolio Management \n• Build; Program and project management, Solution Architecture \n• Run; Service Delivery,  \n• Manage; Budget & Finance, Supplier & Contracts, Organization & Governance, Compliance & Continuity, People \n \nIndustry \n• Ability to manage diversified and complex requirements, problems and solutions across business Systems (ERP, PLM, CRM, DMS, BI, HRM), industrial and infrastructure technology fields \n• Wide industry knowledge; Mining & metal: 10 / years, Manufacturing / 6y, Retail / 2y, Aerospace /2y, Electronics /2y) supporting business functions \n> Core processes; Design, Sell, Produce, Serve & support \n> Support processes; Hire to retire, Procure to Pay, Finance, Health & Safety \n \nManagement \n• Projects and program; management experience (/Planning, Organizing, leading, controlling).  \n• People; multi-disciplinary project teams up to 35 people and direct report up to 7 people. \n• Budget; Responsibility up to 2m€  \n• Stakeholder; Working experience with customers from top management to operational levels, suppliers & partners through various operating model \n \nCommunication & Analytical \n• Analytical skills oriented toward complex problem solving. Strategic thinking. Strong ability for analyzing, summarizing, planning and organizing.  \n• Ability to engage, understand and manage efficiently customers and stakeholders requirements. \n• 7 years of working experience with customers, teams and suppliers within international multicultural context. \n \nCAREER SUMMARY:\t \n2007 to date\tEnterprise and Solution Architect at Rio Tinto & Alcan  \n2001-2007\tSAP Managing Consultant & Manager at IBM Global Services \n1997-2001\tSAP Consultant and Project Manager at IBM Global Services \n1995-1997\tSoftware Developer at UNILOG \n \n CAREER PROFILE \n \nIT/OT \nProven professional with 20 years of experience covering end to end IT/OT scope; \n• Plan; Enterprise Architecture, IT Strategy, Demand management, Portfolio Management \n• Build; Program and project management, Solution Architecture \n• Run; Service Delivery,  \n• Manage; Budget & Finance, Supplier & Contracts, Organization & Governance, Compliance & Continuity, People \n \nIndustry \n• Ability to manage diversified and complex requirements, problems and solutions across business Systems (ERP, PLM, CRM, DMS, BI, HRM), industrial and infrastructure technology fields \n• Wide industry knowledge; Mining & metal: 10 / years, Manufacturing / 6y, Retail / 2y, Aerospace /2y, Electronics /2y) supporting business functions \n> Core processes; Design, Sell, Produce, Serve & support \n> Support processes; Hire to retire, Procure to Pay, Finance, Health & Safety \n \nManagement \n• Projects and program; management experience (/Planning, Organizing, leading, controlling).  \n• People; multi-disciplinary project teams up to 35 people and direct report up to 7 people. \n• Budget; Responsibility up to 2m€  \n• Stakeholder; Working experience with customers from top management to operational levels, suppliers & partners through various operating model \n \nCommunication & Analytical \n• Analytical skills oriented toward complex problem solving. Strategic thinking. Strong ability for analyzing, summarizing, planning and organizing.  \n• Ability to engage, understand and manage efficiently customers and stakeholders requirements. \n• 7 years of working experience with customers, teams and suppliers within international multicultural context. \n \nCAREER SUMMARY:\t \n2007 to date\tEnterprise and Solution Architect at Rio Tinto & Alcan  \n2001-2007\tSAP Managing Consultant & Manager at IBM Global Services \n1997-2001\tSAP Consultant and Project Manager at IBM Global Services \n1995-1997\tSoftware Developer at UNILOG \n \n CAREER PROFILE \n \nIT/OT \nProven professional with 20 years of experience covering end to end IT/OT scope; \n• Plan; Enterprise Architecture, IT Strategy, Demand management, Portfolio Management \n• Build; Program and project management, Solution Architecture \n• Run; Service Delivery,  \n• Manage; Budget & Finance, Supplier & Contracts, Organization & Governance, Compliance & Continuity, People \n \nIndustry \n• Ability to manage diversified and complex requirements, problems and solutions across business Systems (ERP, PLM, CRM, DMS, BI, HRM), industrial and infrastructure technology fields \n• Wide industry knowledge; Mining & metal: 10 / years, Manufacturing / 6y, Retail / 2y, Aerospace /2y, Electronics /2y) supporting business functions \n> Core processes; Design, Sell, Produce, Serve & support \n> Support processes; Hire to retire, Procure to Pay, Finance, Health & Safety \n \nManagement \n• Projects and program; management experience (/Planning, Organizing, leading, controlling).  \n• People; multi-disciplinary project teams up to 35 people and direct report up to 7 people. \n• Budget; Responsibility up to 2m€  \n• Stakeholder; Working experience with customers from top management to operational levels, suppliers & partners through various operating model \n \nCommunication & Analytical \n• Analytical skills oriented toward complex problem solving. Strategic thinking. Strong ability for analyzing, summarizing, planning and organizing.  \n• Ability to engage, understand and manage efficiently customers and stakeholders requirements. \n• 7 years of working experience with customers, teams and suppliers within international multicultural context. \n \nCAREER SUMMARY:\t \n2007 to date\tEnterprise and Solution Architect at Rio Tinto & Alcan  \n2001-2007\tSAP Managing Consultant & Manager at IBM Global Services \n1997-2001\tSAP Consultant and Project Manager at IBM Global Services \n1995-1997\tSoftware Developer at UNILOG \n \n Experience RTA IST EMEA Principal Advisor IT Strategy & Demand Rio Tinto Alcan April 2011  – Present (4 years 5 months) Paris Area, France Business partner & Enterprise architect role \n \nIT/OTStrategy: \n• Development of five year IT/OT strategy plan & roadmap covering business systems, industrial systems and technology infrastructures for 5 Rio Tinto Alcan European companies starting from their business objectives and existing capacities. \n• Design and implementation of a complete IT/OT Strategy planning framework.  \n \nDemand and portfolio Management: \n• Management of the business demand process (Order Of Magnitude, Pre-feasibility, feasibility stages, Procurement process, business cases) for up to 15 sites in 6 countries within IT/OT field (Business systems, Industrial systems and underlying technology infrastructures). \n• Key contribution for enabling large IT/OT projects (PPM within R&D function, ERP-PLM implementation within engineering To Order businesses, MES, etc.) \n• Definition of an internal IT/OT investment management process based on stage gate.  \n \nIT Management \n• Design and implementation of the regional IT operating & governance model starting from COBIT framework.  \n• Supervision and animation of several process; Budget & Cost, Supplier and contracts, Compliance & Continuity. Contribution to Communication and reporting.  \n \nBusiness Engagement & Governance \n• Establishment of a strong and efficient relationship with Key stakeholder (Site Business Management team) through an ad-hoc governance model (Yearly Site IT/OT Strategy & Service Performance review with site GM, Quarterly Service Performance review with BU CFO, Monthly Follow-up meeting with site IT representative/CFO) to support effective decision making.  \n \nBusiness Improvement \n• Successful management and implementation of BI projects; Service catalog definition, Operating model definition, IT investment management improvement, Site IT cost reporting & benchmarking.  \n EMEA Solution and Enterprise Architect Rio Tinto September 2007  –  March 2011  (3 years 7 months) Paris Area, France Solution and Enterprise architect; Support Business within demand management process; Preliminary studies, High level solution architecture, Request for proposal, Business case, product selection, etc.). Define and maintain the regional application strategy, portfolio and roadmap. Contribute to setting-up the architecture standards & framework within architecture community. \n \nMain achievements: Support transformation of Alcan IT following RioTinto acquisition (divestment projects, platforms rationalizations & decommissioning, IT management processes definition), Definition of the regional Solution architecture framework starting from COBIT, Contribute to >100k$ of yearly IT savings through lean projects as Business Improvement champion. \n SAP Practice Manager IBM Global Services December 2005  –  August 2007  (1 year 9 months) Paris Area, France People manager of a team of 7 SAP application architects and developers (recruitment, coaching, performance management, personal development…) \n \nProject manager: Budget (>3m€), Planning, Operations, Customer, etc. \nTechnical and functional integration leader; general and detailed design of the solution, Definition of the delivery standard and organization, management of technical and functional integration & issues, management of the technical team. \n \nMain achievements: Implementation project of an HR Shared Service Center solution for Alcan’s European operations (time, payroll, employee administration, self-service, call center, document management relying mostly onto SAP and IBM Websphere products). \n SAP Managing Consultant IBM Global Services September 2001  –  December 2005  (4 years 4 months) Paris Area, France Project management (up to 15 people / developers, architects and experts) \n \nTechnical leader for SAP based solutions implementation & upgrade projects (CRM, ERP, Industry solution). Customers and internal team’s trainer. \n \nProject proposals and pre-sales activities. \n \nMain achievements : Implementation of SAP aerospace solution for Dassault (Aerospace); implementation of a CRM (sales, marketing, ecommerce, contact center ) for SAGEM (electronics); SAP upgrade at Galleries Lafayette’s (retail) Air France (airline) \n SAP Senior consultant IBM Global Services September 1999  –  August 2001  (2 years) Paris Area, France Project manager (teams up to 35 people and >5000 man/days) and technical lead; LVMH’s cosmetics SAP core system (/logistics, finance, production, quality), Saint-Gobain hedging module. Consulting; purchasing information system at Saint-Gobain. \n \nMain Achievements; Lead design and implementation of a custom SAP hedging module for sales and purchasing processes deployed to more than 20 different SAP systems within the whole Saint-Gobain group (industrial material).  \n SAP Consultant Cimad September 1997  –  August 1999  (2 years) Paris Area, France Development team leader for a SAP R3 implementation project (logistic, finance & production) for Saint-Gobain Packaging (~2000 man/days up to 7 people to manage,) SAP Software engineer Unilog September 1995  –  August 1997  (2 years) France SAP Software engineer in Oil, Publishing and Food industry projects RTA IST EMEA Principal Advisor IT Strategy & Demand Rio Tinto Alcan April 2011  – Present (4 years 5 months) Paris Area, France Business partner & Enterprise architect role \n \nIT/OTStrategy: \n• Development of five year IT/OT strategy plan & roadmap covering business systems, industrial systems and technology infrastructures for 5 Rio Tinto Alcan European companies starting from their business objectives and existing capacities. \n• Design and implementation of a complete IT/OT Strategy planning framework.  \n \nDemand and portfolio Management: \n• Management of the business demand process (Order Of Magnitude, Pre-feasibility, feasibility stages, Procurement process, business cases) for up to 15 sites in 6 countries within IT/OT field (Business systems, Industrial systems and underlying technology infrastructures). \n• Key contribution for enabling large IT/OT projects (PPM within R&D function, ERP-PLM implementation within engineering To Order businesses, MES, etc.) \n• Definition of an internal IT/OT investment management process based on stage gate.  \n \nIT Management \n• Design and implementation of the regional IT operating & governance model starting from COBIT framework.  \n• Supervision and animation of several process; Budget & Cost, Supplier and contracts, Compliance & Continuity. Contribution to Communication and reporting.  \n \nBusiness Engagement & Governance \n• Establishment of a strong and efficient relationship with Key stakeholder (Site Business Management team) through an ad-hoc governance model (Yearly Site IT/OT Strategy & Service Performance review with site GM, Quarterly Service Performance review with BU CFO, Monthly Follow-up meeting with site IT representative/CFO) to support effective decision making.  \n \nBusiness Improvement \n• Successful management and implementation of BI projects; Service catalog definition, Operating model definition, IT investment management improvement, Site IT cost reporting & benchmarking.  \n RTA IST EMEA Principal Advisor IT Strategy & Demand Rio Tinto Alcan April 2011  – Present (4 years 5 months) Paris Area, France Business partner & Enterprise architect role \n \nIT/OTStrategy: \n• Development of five year IT/OT strategy plan & roadmap covering business systems, industrial systems and technology infrastructures for 5 Rio Tinto Alcan European companies starting from their business objectives and existing capacities. \n• Design and implementation of a complete IT/OT Strategy planning framework.  \n \nDemand and portfolio Management: \n• Management of the business demand process (Order Of Magnitude, Pre-feasibility, feasibility stages, Procurement process, business cases) for up to 15 sites in 6 countries within IT/OT field (Business systems, Industrial systems and underlying technology infrastructures). \n• Key contribution for enabling large IT/OT projects (PPM within R&D function, ERP-PLM implementation within engineering To Order businesses, MES, etc.) \n• Definition of an internal IT/OT investment management process based on stage gate.  \n \nIT Management \n• Design and implementation of the regional IT operating & governance model starting from COBIT framework.  \n• Supervision and animation of several process; Budget & Cost, Supplier and contracts, Compliance & Continuity. Contribution to Communication and reporting.  \n \nBusiness Engagement & Governance \n• Establishment of a strong and efficient relationship with Key stakeholder (Site Business Management team) through an ad-hoc governance model (Yearly Site IT/OT Strategy & Service Performance review with site GM, Quarterly Service Performance review with BU CFO, Monthly Follow-up meeting with site IT representative/CFO) to support effective decision making.  \n \nBusiness Improvement \n• Successful management and implementation of BI projects; Service catalog definition, Operating model definition, IT investment management improvement, Site IT cost reporting & benchmarking.  \n EMEA Solution and Enterprise Architect Rio Tinto September 2007  –  March 2011  (3 years 7 months) Paris Area, France Solution and Enterprise architect; Support Business within demand management process; Preliminary studies, High level solution architecture, Request for proposal, Business case, product selection, etc.). Define and maintain the regional application strategy, portfolio and roadmap. Contribute to setting-up the architecture standards & framework within architecture community. \n \nMain achievements: Support transformation of Alcan IT following RioTinto acquisition (divestment projects, platforms rationalizations & decommissioning, IT management processes definition), Definition of the regional Solution architecture framework starting from COBIT, Contribute to >100k$ of yearly IT savings through lean projects as Business Improvement champion. \n EMEA Solution and Enterprise Architect Rio Tinto September 2007  –  March 2011  (3 years 7 months) Paris Area, France Solution and Enterprise architect; Support Business within demand management process; Preliminary studies, High level solution architecture, Request for proposal, Business case, product selection, etc.). Define and maintain the regional application strategy, portfolio and roadmap. Contribute to setting-up the architecture standards & framework within architecture community. \n \nMain achievements: Support transformation of Alcan IT following RioTinto acquisition (divestment projects, platforms rationalizations & decommissioning, IT management processes definition), Definition of the regional Solution architecture framework starting from COBIT, Contribute to >100k$ of yearly IT savings through lean projects as Business Improvement champion. \n SAP Practice Manager IBM Global Services December 2005  –  August 2007  (1 year 9 months) Paris Area, France People manager of a team of 7 SAP application architects and developers (recruitment, coaching, performance management, personal development…) \n \nProject manager: Budget (>3m€), Planning, Operations, Customer, etc. \nTechnical and functional integration leader; general and detailed design of the solution, Definition of the delivery standard and organization, management of technical and functional integration & issues, management of the technical team. \n \nMain achievements: Implementation project of an HR Shared Service Center solution for Alcan’s European operations (time, payroll, employee administration, self-service, call center, document management relying mostly onto SAP and IBM Websphere products). \n SAP Practice Manager IBM Global Services December 2005  –  August 2007  (1 year 9 months) Paris Area, France People manager of a team of 7 SAP application architects and developers (recruitment, coaching, performance management, personal development…) \n \nProject manager: Budget (>3m€), Planning, Operations, Customer, etc. \nTechnical and functional integration leader; general and detailed design of the solution, Definition of the delivery standard and organization, management of technical and functional integration & issues, management of the technical team. \n \nMain achievements: Implementation project of an HR Shared Service Center solution for Alcan’s European operations (time, payroll, employee administration, self-service, call center, document management relying mostly onto SAP and IBM Websphere products). \n SAP Managing Consultant IBM Global Services September 2001  –  December 2005  (4 years 4 months) Paris Area, France Project management (up to 15 people / developers, architects and experts) \n \nTechnical leader for SAP based solutions implementation & upgrade projects (CRM, ERP, Industry solution). Customers and internal team’s trainer. \n \nProject proposals and pre-sales activities. \n \nMain achievements : Implementation of SAP aerospace solution for Dassault (Aerospace); implementation of a CRM (sales, marketing, ecommerce, contact center ) for SAGEM (electronics); SAP upgrade at Galleries Lafayette’s (retail) Air France (airline) \n SAP Managing Consultant IBM Global Services September 2001  –  December 2005  (4 years 4 months) Paris Area, France Project management (up to 15 people / developers, architects and experts) \n \nTechnical leader for SAP based solutions implementation & upgrade projects (CRM, ERP, Industry solution). Customers and internal team’s trainer. \n \nProject proposals and pre-sales activities. \n \nMain achievements : Implementation of SAP aerospace solution for Dassault (Aerospace); implementation of a CRM (sales, marketing, ecommerce, contact center ) for SAGEM (electronics); SAP upgrade at Galleries Lafayette’s (retail) Air France (airline) \n SAP Senior consultant IBM Global Services September 1999  –  August 2001  (2 years) Paris Area, France Project manager (teams up to 35 people and >5000 man/days) and technical lead; LVMH’s cosmetics SAP core system (/logistics, finance, production, quality), Saint-Gobain hedging module. Consulting; purchasing information system at Saint-Gobain. \n \nMain Achievements; Lead design and implementation of a custom SAP hedging module for sales and purchasing processes deployed to more than 20 different SAP systems within the whole Saint-Gobain group (industrial material).  \n SAP Senior consultant IBM Global Services September 1999  –  August 2001  (2 years) Paris Area, France Project manager (teams up to 35 people and >5000 man/days) and technical lead; LVMH’s cosmetics SAP core system (/logistics, finance, production, quality), Saint-Gobain hedging module. Consulting; purchasing information system at Saint-Gobain. \n \nMain Achievements; Lead design and implementation of a custom SAP hedging module for sales and purchasing processes deployed to more than 20 different SAP systems within the whole Saint-Gobain group (industrial material).  \n SAP Consultant Cimad September 1997  –  August 1999  (2 years) Paris Area, France Development team leader for a SAP R3 implementation project (logistic, finance & production) for Saint-Gobain Packaging (~2000 man/days up to 7 people to manage,) SAP Consultant Cimad September 1997  –  August 1999  (2 years) Paris Area, France Development team leader for a SAP R3 implementation project (logistic, finance & production) for Saint-Gobain Packaging (~2000 man/days up to 7 people to manage,) SAP Software engineer Unilog September 1995  –  August 1997  (2 years) France SAP Software engineer in Oil, Publishing and Food industry projects SAP Software engineer Unilog September 1995  –  August 1997  (2 years) France SAP Software engineer in Oil, Publishing and Food industry projects Languages English Professional working proficiency French Native or bilingual proficiency English Professional working proficiency French Native or bilingual proficiency English Professional working proficiency French Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills IT Strategy Solution Architecture Enterprise Architecture Integration IT Management Management SAP TOGAF Business Transformation Business Process ERP IT Service Management Business Intelligence Technical Architecture Project Portfolio... Business Process... Organization &... Technology Watch IT Service Procurement... Compliance & Continuity... Finance management PPM CRM MES PLM Project Managment Program Management Lean Six Sigma Consulting Change Management Strategy Enterprise Software Governance Infrastructure See 19+     See less Skills  IT Strategy Solution Architecture Enterprise Architecture Integration IT Management Management SAP TOGAF Business Transformation Business Process ERP IT Service Management Business Intelligence Technical Architecture Project Portfolio... Business Process... Organization &... Technology Watch IT Service Procurement... Compliance & Continuity... Finance management PPM CRM MES PLM Project Managment Program Management Lean Six Sigma Consulting Change Management Strategy Enterprise Software Governance Infrastructure See 19+     See less IT Strategy Solution Architecture Enterprise Architecture Integration IT Management Management SAP TOGAF Business Transformation Business Process ERP IT Service Management Business Intelligence Technical Architecture Project Portfolio... Business Process... Organization &... Technology Watch IT Service Procurement... Compliance & Continuity... Finance management PPM CRM MES PLM Project Managment Program Management Lean Six Sigma Consulting Change Management Strategy Enterprise Software Governance Infrastructure See 19+     See less IT Strategy Solution Architecture Enterprise Architecture Integration IT Management Management SAP TOGAF Business Transformation Business Process ERP IT Service Management Business Intelligence Technical Architecture Project Portfolio... Business Process... Organization &... Technology Watch IT Service Procurement... Compliance & Continuity... Finance management PPM CRM MES PLM Project Managment Program Management Lean Six Sigma Consulting Change Management Strategy Enterprise Software Governance Infrastructure See 19+     See less Education The University of Sheffield Master of Computer sciences 1993  – 1994 As part of ERASMUS program, the last year of my master degree in Engineering have been made within the University of Sheffield. Institut national des Sciences appliquées de Lyon Master’s Degree in Engineering,  Computer sciences engineering. 1991  – 1994 The University of Sheffield Master of Computer sciences 1993  – 1994 As part of ERASMUS program, the last year of my master degree in Engineering have been made within the University of Sheffield. The University of Sheffield Master of Computer sciences 1993  – 1994 As part of ERASMUS program, the last year of my master degree in Engineering have been made within the University of Sheffield. The University of Sheffield Master of Computer sciences 1993  – 1994 As part of ERASMUS program, the last year of my master degree in Engineering have been made within the University of Sheffield. Institut national des Sciences appliquées de Lyon Master’s Degree in Engineering,  Computer sciences engineering. 1991  – 1994 Institut national des Sciences appliquées de Lyon Master’s Degree in Engineering,  Computer sciences engineering. 1991  – 1994 Institut national des Sciences appliquées de Lyon Master’s Degree in Engineering,  Computer sciences engineering. 1991  – 1994 "]}