{"position": "Manufacturing Equipment Technician", "company": "Intel Corporation", "profiles": ["Experience SPTD Dry Manufacturing/Equipment Technician CH1/CH8 Intel Corporation December 2013  – Present (1 year 9 months) Chandler, Arizona Implant Manufacturing/Equipment Technician Intel Corporation April 2011  –  December 2013  (2 years 9 months) Rio Rancho, New Mexico Senior Implant Engineering Technician Shift Lead Samsung Semiconductor April 2007  –  April 2011  (4 years 1 month) Austin, Texas Area EES Technician / TPM Technician / EWS MFG Technician STMicroelectronics May 2002  –  April 2007  (5 years) Phoenix, Arizona SPTD Dry Manufacturing/Equipment Technician CH1/CH8 Intel Corporation December 2013  – Present (1 year 9 months) Chandler, Arizona SPTD Dry Manufacturing/Equipment Technician CH1/CH8 Intel Corporation December 2013  – Present (1 year 9 months) Chandler, Arizona Implant Manufacturing/Equipment Technician Intel Corporation April 2011  –  December 2013  (2 years 9 months) Rio Rancho, New Mexico Implant Manufacturing/Equipment Technician Intel Corporation April 2011  –  December 2013  (2 years 9 months) Rio Rancho, New Mexico Senior Implant Engineering Technician Shift Lead Samsung Semiconductor April 2007  –  April 2011  (4 years 1 month) Austin, Texas Area Senior Implant Engineering Technician Shift Lead Samsung Semiconductor April 2007  –  April 2011  (4 years 1 month) Austin, Texas Area EES Technician / TPM Technician / EWS MFG Technician STMicroelectronics May 2002  –  April 2007  (5 years) Phoenix, Arizona EES Technician / TPM Technician / EWS MFG Technician STMicroelectronics May 2002  –  April 2007  (5 years) Phoenix, Arizona Languages Spanish Spanish Spanish Skills Semiconductors SPC Semiconductor Industry CVD CMOS IC Silicon Metrology Failure Analysis Manufacturing Engineering Thin Films PVD JMP Design of Experiments Skills  Semiconductors SPC Semiconductor Industry CVD CMOS IC Silicon Metrology Failure Analysis Manufacturing Engineering Thin Films PVD JMP Design of Experiments Semiconductors SPC Semiconductor Industry CVD CMOS IC Silicon Metrology Failure Analysis Manufacturing Engineering Thin Films PVD JMP Design of Experiments Semiconductors SPC Semiconductor Industry CVD CMOS IC Silicon Metrology Failure Analysis Manufacturing Engineering Thin Films PVD JMP Design of Experiments Education High-Tech Institute-Phoenix AZ Associate's degree,  Computer Electronics 1999  – 2001 High-Tech Institute-Phoenix AZ Associate's degree,  Computer Electronics 1999  – 2001 High-Tech Institute-Phoenix AZ Associate's degree,  Computer Electronics 1999  – 2001 High-Tech Institute-Phoenix AZ Associate's degree,  Computer Electronics 1999  – 2001 ", "Summary Highly skilled process engineer with more than 17 years of experience improving quality and processes within high-volume manufacturing in the semi-conductor industry. Demonstrated ability on Install and Tool qualification for technology and product transfer. Problem solving and develop solutions. Strong understanding of fluid dispensing and pick and place manufacturing processes such as Polymer/Flux dispensing, die attach, assembly and packaging. Plus 6 years of experience on hardware and software computer field, including networks. Summary Highly skilled process engineer with more than 17 years of experience improving quality and processes within high-volume manufacturing in the semi-conductor industry. Demonstrated ability on Install and Tool qualification for technology and product transfer. Problem solving and develop solutions. Strong understanding of fluid dispensing and pick and place manufacturing processes such as Polymer/Flux dispensing, die attach, assembly and packaging. Plus 6 years of experience on hardware and software computer field, including networks. Highly skilled process engineer with more than 17 years of experience improving quality and processes within high-volume manufacturing in the semi-conductor industry. Demonstrated ability on Install and Tool qualification for technology and product transfer. Problem solving and develop solutions. Strong understanding of fluid dispensing and pick and place manufacturing processes such as Polymer/Flux dispensing, die attach, assembly and packaging. Plus 6 years of experience on hardware and software computer field, including networks. Highly skilled process engineer with more than 17 years of experience improving quality and processes within high-volume manufacturing in the semi-conductor industry. Demonstrated ability on Install and Tool qualification for technology and product transfer. Problem solving and develop solutions. Strong understanding of fluid dispensing and pick and place manufacturing processes such as Polymer/Flux dispensing, die attach, assembly and packaging. Plus 6 years of experience on hardware and software computer field, including networks. Experience Process Equipment Engineer Intel Corporation October 2014  – Present (11 months) Penang, Malaysia New platform equipment engineer for Site Ramp Up Process Equipment Engineer Intel Corporation November 2011  – Present (3 years 10 months) New Platform technology transfer Engineer (Arizona, US) \nIntegrated Heat Spreader module Process Engineer Process Engineer Intel Corporation August 2008  –  November 2011  (3 years 4 months) Asymtek fluid dispenser tool Owner, Virtual Factory Expert and Eng. Forum Chair. (JET) \nOn shift Engineer supporting manufacturing. (2011) \nNew Product Introduction owner for New Phase (Arizona, US) \nNG Integrated Heat Spreader module Process Engineer Sr Manufacturing Equipment Technician Intel Corporation December 2004  –  November 2008  (4 years) Next Generation Integrated Heat Spreader module equipment technician 57 \nGrohmann tool Field Service Engineer Equivalence Tech and instructor (Germany) \nIntegrated Heat Spreader (IHS) Technology Transfer team,; 56 for IHS module (Arizona, US ) \nInstall and qualification activities supporting engineering department Manufacturing Equipment Technician Intel Corporation July 1998  –  December 2004  (6 years 6 months) C4 Factory Transfer team,; 55 for DiePlate and APL modules (Arizona, US) \nInstall and tool qualification activities supporting engineering group Computer and Network Technician DataDEC - Digital Equipment Corporation distributor September 1992  –  July 1998  (5 years 11 months) Costa Rica Laptop, personal computers and mainframes of Digital Equipment Corporation equipmets, maintenance and repair, cooper and fiber optics network installer. Process Equipment Engineer Intel Corporation October 2014  – Present (11 months) Penang, Malaysia New platform equipment engineer for Site Ramp Up Process Equipment Engineer Intel Corporation October 2014  – Present (11 months) Penang, Malaysia New platform equipment engineer for Site Ramp Up Process Equipment Engineer Intel Corporation November 2011  – Present (3 years 10 months) New Platform technology transfer Engineer (Arizona, US) \nIntegrated Heat Spreader module Process Engineer Process Equipment Engineer Intel Corporation November 2011  – Present (3 years 10 months) New Platform technology transfer Engineer (Arizona, US) \nIntegrated Heat Spreader module Process Engineer Process Engineer Intel Corporation August 2008  –  November 2011  (3 years 4 months) Asymtek fluid dispenser tool Owner, Virtual Factory Expert and Eng. Forum Chair. (JET) \nOn shift Engineer supporting manufacturing. (2011) \nNew Product Introduction owner for New Phase (Arizona, US) \nNG Integrated Heat Spreader module Process Engineer Process Engineer Intel Corporation August 2008  –  November 2011  (3 years 4 months) Asymtek fluid dispenser tool Owner, Virtual Factory Expert and Eng. Forum Chair. (JET) \nOn shift Engineer supporting manufacturing. (2011) \nNew Product Introduction owner for New Phase (Arizona, US) \nNG Integrated Heat Spreader module Process Engineer Sr Manufacturing Equipment Technician Intel Corporation December 2004  –  November 2008  (4 years) Next Generation Integrated Heat Spreader module equipment technician 57 \nGrohmann tool Field Service Engineer Equivalence Tech and instructor (Germany) \nIntegrated Heat Spreader (IHS) Technology Transfer team,; 56 for IHS module (Arizona, US ) \nInstall and qualification activities supporting engineering department Sr Manufacturing Equipment Technician Intel Corporation December 2004  –  November 2008  (4 years) Next Generation Integrated Heat Spreader module equipment technician 57 \nGrohmann tool Field Service Engineer Equivalence Tech and instructor (Germany) \nIntegrated Heat Spreader (IHS) Technology Transfer team,; 56 for IHS module (Arizona, US ) \nInstall and qualification activities supporting engineering department Manufacturing Equipment Technician Intel Corporation July 1998  –  December 2004  (6 years 6 months) C4 Factory Transfer team,; 55 for DiePlate and APL modules (Arizona, US) \nInstall and tool qualification activities supporting engineering group Manufacturing Equipment Technician Intel Corporation July 1998  –  December 2004  (6 years 6 months) C4 Factory Transfer team,; 55 for DiePlate and APL modules (Arizona, US) \nInstall and tool qualification activities supporting engineering group Computer and Network Technician DataDEC - Digital Equipment Corporation distributor September 1992  –  July 1998  (5 years 11 months) Costa Rica Laptop, personal computers and mainframes of Digital Equipment Corporation equipmets, maintenance and repair, cooper and fiber optics network installer. Computer and Network Technician DataDEC - Digital Equipment Corporation distributor September 1992  –  July 1998  (5 years 11 months) Costa Rica Laptop, personal computers and mainframes of Digital Equipment Corporation equipmets, maintenance and repair, cooper and fiber optics network installer. Languages English English English Skills Semiconductor... Install/Quall and Ramp... Model Based Problem... Technical... Technology Transfer Data collection and... Knowledge Transfer... Lean Manufacturing Highly skilled... Validation Product Development Semiconductors Manufacturing SPC Process Simulation Engineering Design of Experiments Process Engineering Root Cause Analysis FMEA Electronics Failure Analysis Lean manufacturing Continuous Improvement See 9+     See less Skills  Semiconductor... Install/Quall and Ramp... Model Based Problem... Technical... Technology Transfer Data collection and... Knowledge Transfer... Lean Manufacturing Highly skilled... Validation Product Development Semiconductors Manufacturing SPC Process Simulation Engineering Design of Experiments Process Engineering Root Cause Analysis FMEA Electronics Failure Analysis Lean manufacturing Continuous Improvement See 9+     See less Semiconductor... Install/Quall and Ramp... Model Based Problem... Technical... Technology Transfer Data collection and... Knowledge Transfer... Lean Manufacturing Highly skilled... Validation Product Development Semiconductors Manufacturing SPC Process Simulation Engineering Design of Experiments Process Engineering Root Cause Analysis FMEA Electronics Failure Analysis Lean manufacturing Continuous Improvement See 9+     See less Semiconductor... Install/Quall and Ramp... Model Based Problem... Technical... Technology Transfer Data collection and... Knowledge Transfer... Lean Manufacturing Highly skilled... Validation Product Development Semiconductors Manufacturing SPC Process Simulation Engineering Design of Experiments Process Engineering Root Cause Analysis FMEA Electronics Failure Analysis Lean manufacturing Continuous Improvement See 9+     See less Education Universidad hispanoamericana Industrial Engineering BS 2008  – 2016 Colegio Tecnico Profesional de Alajuela Vocational,  Electrician 1990  – 1992 Activities and Societies:  High School Student Directive Board President 1992 Universidad hispanoamericana Industrial Engineering BS 2008  – 2016 Universidad hispanoamericana Industrial Engineering BS 2008  – 2016 Universidad hispanoamericana Industrial Engineering BS 2008  – 2016 Colegio Tecnico Profesional de Alajuela Vocational,  Electrician 1990  – 1992 Activities and Societies:  High School Student Directive Board President 1992 Colegio Tecnico Profesional de Alajuela Vocational,  Electrician 1990  – 1992 Activities and Societies:  High School Student Directive Board President 1992 Colegio Tecnico Profesional de Alajuela Vocational,  Electrician 1990  – 1992 Activities and Societies:  High School Student Directive Board President 1992 ", "Experience Manufacturing Equipment Technician Intel Corporation February 2001  – Present (14 years 7 months) Sergeant US Army December 1986  –  July 1997  (10 years 8 months) Manufacturing Equipment Technician Intel Corporation February 2001  – Present (14 years 7 months) Manufacturing Equipment Technician Intel Corporation February 2001  – Present (14 years 7 months) Sergeant US Army December 1986  –  July 1997  (10 years 8 months) Sergeant US Army December 1986  –  July 1997  (10 years 8 months) Education Heald College-Honolulu Associate's degree,  Electronics 1999  – 2001 Alliance High School High School Diploma 1978  – 1982 Heald College-Honolulu Associate's degree,  Electronics 1999  – 2001 Heald College-Honolulu Associate's degree,  Electronics 1999  – 2001 Heald College-Honolulu Associate's degree,  Electronics 1999  – 2001 Alliance High School High School Diploma 1978  – 1982 Alliance High School High School Diploma 1978  – 1982 Alliance High School High School Diploma 1978  – 1982 ", "Experience Manufacturing Equipment Technician Intel Corporation November 2011  – Present (3 years 10 months) Manufacturing Technician Medtronic May 2011  –  November 2011  (7 months) Tempe, AZ Mechanical Assembler Stara Technologies, Inc. May 2011  –  June 2011  (2 months) Gilbert, AZ ATM Technician Loomis March 2008  –  December 2010  (2 years 10 months) Honolulu, HI Arcade Technician Microworlds July 2006  –  March 2008  (1 year 9 months) Honolulu, HI Manufacturing Equipment Technician Intel Corporation November 2011  – Present (3 years 10 months) Manufacturing Equipment Technician Intel Corporation November 2011  – Present (3 years 10 months) Manufacturing Technician Medtronic May 2011  –  November 2011  (7 months) Tempe, AZ Manufacturing Technician Medtronic May 2011  –  November 2011  (7 months) Tempe, AZ Mechanical Assembler Stara Technologies, Inc. May 2011  –  June 2011  (2 months) Gilbert, AZ Mechanical Assembler Stara Technologies, Inc. May 2011  –  June 2011  (2 months) Gilbert, AZ ATM Technician Loomis March 2008  –  December 2010  (2 years 10 months) Honolulu, HI ATM Technician Loomis March 2008  –  December 2010  (2 years 10 months) Honolulu, HI Arcade Technician Microworlds July 2006  –  March 2008  (1 year 9 months) Honolulu, HI Arcade Technician Microworlds July 2006  –  March 2008  (1 year 9 months) Honolulu, HI Education Heald College-Honolulu Associate's degree,  Applied Science in Electronic Technology 2004  – 2006 Waipahu High School Diploma 2000  – 2004 Heald College-Honolulu Associate's degree,  Applied Science in Electronic Technology 2004  – 2006 Heald College-Honolulu Associate's degree,  Applied Science in Electronic Technology 2004  – 2006 Heald College-Honolulu Associate's degree,  Applied Science in Electronic Technology 2004  – 2006 Waipahu High School Diploma 2000  – 2004 Waipahu High School Diploma 2000  – 2004 Waipahu High School Diploma 2000  – 2004 ", "Experience Manufacturing/Equipment Technician Intel Corporation June 2012  – Present (3 years 3 months) Manufacturing/Equipment Technician Intel Corporation June 2012  – Present (3 years 3 months) Manufacturing/Equipment Technician Intel Corporation June 2012  – Present (3 years 3 months) ", "Experience Manufacturing Equipment Technician Intel Corporation Manufacturing Equipment Technician Intel Corporation Manufacturing Equipment Technician Intel Corporation ", "Summary Experienced Manufacturing/Equipment Technician with 18 years in the semiconductor industry. Committed to consistently and safely meeting specifications, quality standards and customer deliverables Summary Experienced Manufacturing/Equipment Technician with 18 years in the semiconductor industry. Committed to consistently and safely meeting specifications, quality standards and customer deliverables Experienced Manufacturing/Equipment Technician with 18 years in the semiconductor industry. Committed to consistently and safely meeting specifications, quality standards and customer deliverables Experienced Manufacturing/Equipment Technician with 18 years in the semiconductor industry. Committed to consistently and safely meeting specifications, quality standards and customer deliverables Experience Manufacturing/Equipment Technician Intel Corporation March 1996  –  March 2014  (18 years 1 month) Rio Rancho, NM Experienced on multiple tool sets in the Planar functional area including AMAT Reflexion and Ebarra FREX 300mm polishers. Manufacturing/Equipment Technician Intel Corporation March 1996  –  March 2014  (18 years 1 month) Rio Rancho, NM Experienced on multiple tool sets in the Planar functional area including AMAT Reflexion and Ebarra FREX 300mm polishers. Manufacturing/Equipment Technician Intel Corporation March 1996  –  March 2014  (18 years 1 month) Rio Rancho, NM Experienced on multiple tool sets in the Planar functional area including AMAT Reflexion and Ebarra FREX 300mm polishers. Skills Semiconductor... Semiconductor Process Robotics Statistical Data... Equipment Maintenance Equipment Repair Equipment Installation Thin Films Semiconductor Industry Failure Analysis Metrology Semiconductors Skills  Semiconductor... Semiconductor Process Robotics Statistical Data... Equipment Maintenance Equipment Repair Equipment Installation Thin Films Semiconductor Industry Failure Analysis Metrology Semiconductors Semiconductor... Semiconductor Process Robotics Statistical Data... Equipment Maintenance Equipment Repair Equipment Installation Thin Films Semiconductor Industry Failure Analysis Metrology Semiconductors Semiconductor... Semiconductor Process Robotics Statistical Data... Equipment Maintenance Equipment Repair Equipment Installation Thin Films Semiconductor Industry Failure Analysis Metrology Semiconductors Education University of Florida Associate of Arts (AA),  Materials Science 1984  – 1988 Slidell High School, Slidell, LA High School Diploma 1981  – 1983 University of Florida Associate of Arts (AA),  Materials Science 1984  – 1988 University of Florida Associate of Arts (AA),  Materials Science 1984  – 1988 University of Florida Associate of Arts (AA),  Materials Science 1984  – 1988 Slidell High School, Slidell, LA High School Diploma 1981  – 1983 Slidell High School, Slidell, LA High School Diploma 1981  – 1983 Slidell High School, Slidell, LA High School Diploma 1981  – 1983 ", "Experience Manufacturing Equipment Technician Intel Corporation May 2000  – Present (15 years 4 months) Manufacturing Equipment Technician Intel Corporation May 2000  – Present (15 years 4 months) Manufacturing Equipment Technician Intel Corporation May 2000  – Present (15 years 4 months) ", "Summary Experienced engineer with a very diverse set of skills to develop and improve all aspects of process, metrology and equipment in a highly dynamic environment Summary Experienced engineer with a very diverse set of skills to develop and improve all aspects of process, metrology and equipment in a highly dynamic environment Experienced engineer with a very diverse set of skills to develop and improve all aspects of process, metrology and equipment in a highly dynamic environment Experienced engineer with a very diverse set of skills to develop and improve all aspects of process, metrology and equipment in a highly dynamic environment Experience Process Engineer Intel Corporation 2010  – Present (5 years) Chandler, AZ Setup equipment, automation systems and SPC parameters for new products within the laser marking process step. Manage all day to day operations between engineering and manufacturing groups. Implement equipment, system and process improvements using lean 6 sigma methodologies. Transfer processes to our international factory sites utilizing fast ramping Intel copy exact techniques \n•Utilized lean principles to make changes in the way product design information from cross functional departments is gathered and utilized for the laser marking process step correlating in a 20% reduction of time necessary to receive and process new products. \n•Brought in a robust, low-cost, inspection metrology at half the capital investment of comparable metrologies to validate daily key process parameters that requires virtually no ongoing maintenance or spares inventory. Equipment Development Engineer Intel Corporation 2006  –  2010  (4 years) Chandler, AZ Drive all software and hardware development, automation activities, and sustaining duties across multiple equipment sets and metrologies for Intel’s next generation packaging technologies including: recipe creation, maintenance issues, and response to excursion related activities. Manage implementation of all equipment changes and/or improvements across many international manufacturing sites. Design and execute experiments for process development. Author technical documentation and white paper changes, defining specifications and procedures for operation, as well as process control monitoring systems.  \n•Developed a novel inspection technique for acoustic microscopy metrologies that enabled the accurate inspection of bond integrity for materials of differing densities Manufacturing Equipment Technician Intel Corporation October 2000  –  2006  (6 years) Chandler, AZ Performed preventative maintenance and repairs on semiconductor, material handling, placement, dispensing, and metrology equipment in Class 1, 10K and 100K clean room environments. Trained and coached other employees about the operation and maintenance of various equipment. \n•Lead various teams that focused on safety and job hazard prevention Equipment Technician VDO Control Systems 1999  –  2000  (1 year) Auburn, IN Maintained and repaired equipment in a complete start to finish surface mount PCB environment focusing on automotive component manufacturing.  \n•Worked closely with engineering and manufacturing with the transportation and integration of several major manufacturing lines between the states of Virginia and Indiana. Additional responsibilities included equipment installation, qualification, and the training of maintenance and manufacturing personnel.  \n•Acquired certifications for Universal, Siemens, Philips, DEK and various other equipment Process Engineer Intel Corporation 2010  – Present (5 years) Chandler, AZ Setup equipment, automation systems and SPC parameters for new products within the laser marking process step. Manage all day to day operations between engineering and manufacturing groups. Implement equipment, system and process improvements using lean 6 sigma methodologies. Transfer processes to our international factory sites utilizing fast ramping Intel copy exact techniques \n•Utilized lean principles to make changes in the way product design information from cross functional departments is gathered and utilized for the laser marking process step correlating in a 20% reduction of time necessary to receive and process new products. \n•Brought in a robust, low-cost, inspection metrology at half the capital investment of comparable metrologies to validate daily key process parameters that requires virtually no ongoing maintenance or spares inventory. Process Engineer Intel Corporation 2010  – Present (5 years) Chandler, AZ Setup equipment, automation systems and SPC parameters for new products within the laser marking process step. Manage all day to day operations between engineering and manufacturing groups. Implement equipment, system and process improvements using lean 6 sigma methodologies. Transfer processes to our international factory sites utilizing fast ramping Intel copy exact techniques \n•Utilized lean principles to make changes in the way product design information from cross functional departments is gathered and utilized for the laser marking process step correlating in a 20% reduction of time necessary to receive and process new products. \n•Brought in a robust, low-cost, inspection metrology at half the capital investment of comparable metrologies to validate daily key process parameters that requires virtually no ongoing maintenance or spares inventory. Equipment Development Engineer Intel Corporation 2006  –  2010  (4 years) Chandler, AZ Drive all software and hardware development, automation activities, and sustaining duties across multiple equipment sets and metrologies for Intel’s next generation packaging technologies including: recipe creation, maintenance issues, and response to excursion related activities. Manage implementation of all equipment changes and/or improvements across many international manufacturing sites. Design and execute experiments for process development. Author technical documentation and white paper changes, defining specifications and procedures for operation, as well as process control monitoring systems.  \n•Developed a novel inspection technique for acoustic microscopy metrologies that enabled the accurate inspection of bond integrity for materials of differing densities Equipment Development Engineer Intel Corporation 2006  –  2010  (4 years) Chandler, AZ Drive all software and hardware development, automation activities, and sustaining duties across multiple equipment sets and metrologies for Intel’s next generation packaging technologies including: recipe creation, maintenance issues, and response to excursion related activities. Manage implementation of all equipment changes and/or improvements across many international manufacturing sites. Design and execute experiments for process development. Author technical documentation and white paper changes, defining specifications and procedures for operation, as well as process control monitoring systems.  \n•Developed a novel inspection technique for acoustic microscopy metrologies that enabled the accurate inspection of bond integrity for materials of differing densities Manufacturing Equipment Technician Intel Corporation October 2000  –  2006  (6 years) Chandler, AZ Performed preventative maintenance and repairs on semiconductor, material handling, placement, dispensing, and metrology equipment in Class 1, 10K and 100K clean room environments. Trained and coached other employees about the operation and maintenance of various equipment. \n•Lead various teams that focused on safety and job hazard prevention Manufacturing Equipment Technician Intel Corporation October 2000  –  2006  (6 years) Chandler, AZ Performed preventative maintenance and repairs on semiconductor, material handling, placement, dispensing, and metrology equipment in Class 1, 10K and 100K clean room environments. Trained and coached other employees about the operation and maintenance of various equipment. \n•Lead various teams that focused on safety and job hazard prevention Equipment Technician VDO Control Systems 1999  –  2000  (1 year) Auburn, IN Maintained and repaired equipment in a complete start to finish surface mount PCB environment focusing on automotive component manufacturing.  \n•Worked closely with engineering and manufacturing with the transportation and integration of several major manufacturing lines between the states of Virginia and Indiana. Additional responsibilities included equipment installation, qualification, and the training of maintenance and manufacturing personnel.  \n•Acquired certifications for Universal, Siemens, Philips, DEK and various other equipment Equipment Technician VDO Control Systems 1999  –  2000  (1 year) Auburn, IN Maintained and repaired equipment in a complete start to finish surface mount PCB environment focusing on automotive component manufacturing.  \n•Worked closely with engineering and manufacturing with the transportation and integration of several major manufacturing lines between the states of Virginia and Indiana. Additional responsibilities included equipment installation, qualification, and the training of maintenance and manufacturing personnel.  \n•Acquired certifications for Universal, Siemens, Philips, DEK and various other equipment Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Failure Analysis Semiconductors Manufacturing Design of Experiments SPC FMEA JMP Design for Manufacturing Lean Manufacturing Product Engineering Process Engineering Metrology Engineering Process Simulation Root Cause Analysis Six Sigma Continuous Improvement Characterization Cross-functional Team... Semiconductor Industry Troubleshooting Testing See 7+     See less Skills  Failure Analysis Semiconductors Manufacturing Design of Experiments SPC FMEA JMP Design for Manufacturing Lean Manufacturing Product Engineering Process Engineering Metrology Engineering Process Simulation Root Cause Analysis Six Sigma Continuous Improvement Characterization Cross-functional Team... Semiconductor Industry Troubleshooting Testing See 7+     See less Failure Analysis Semiconductors Manufacturing Design of Experiments SPC FMEA JMP Design for Manufacturing Lean Manufacturing Product Engineering Process Engineering Metrology Engineering Process Simulation Root Cause Analysis Six Sigma Continuous Improvement Characterization Cross-functional Team... Semiconductor Industry Troubleshooting Testing See 7+     See less Failure Analysis Semiconductors Manufacturing Design of Experiments SPC FMEA JMP Design for Manufacturing Lean Manufacturing Product Engineering Process Engineering Metrology Engineering Process Simulation Root Cause Analysis Six Sigma Continuous Improvement Characterization Cross-functional Team... Semiconductor Industry Troubleshooting Testing See 7+     See less Education ITT Technical Institute AS EET,  Electrical Engineering 1998  – 2000 Activities and Societies:  President of Student Council while attending ITT Technical Institute AS EET,  Electrical Engineering 1998  – 2000 Activities and Societies:  President of Student Council while attending ITT Technical Institute AS EET,  Electrical Engineering 1998  – 2000 Activities and Societies:  President of Student Council while attending ITT Technical Institute AS EET,  Electrical Engineering 1998  – 2000 Activities and Societies:  President of Student Council while attending ", "Summary Objective to grow as a manager and stay learning at all times, Always to keep an edge on the industries changes including stay equipment & technology savy to grasp leading edge of industry changes & direction. Summary Objective to grow as a manager and stay learning at all times, Always to keep an edge on the industries changes including stay equipment & technology savy to grasp leading edge of industry changes & direction. Objective to grow as a manager and stay learning at all times, Always to keep an edge on the industries changes including stay equipment & technology savy to grasp leading edge of industry changes & direction. Objective to grow as a manager and stay learning at all times, Always to keep an edge on the industries changes including stay equipment & technology savy to grasp leading edge of industry changes & direction. Experience SPTD Manufacturing Equipment Technician Intel Corporation January 2014  – Present (1 year 8 months) Chandler AZ Owner Mister Softee of NM, LLC April 2004  – Present (11 years 5 months) SPTD Manufacturing Equipment Technician Intel Corporation January 2014  – Present (1 year 8 months) Chandler AZ SPTD Manufacturing Equipment Technician Intel Corporation January 2014  – Present (1 year 8 months) Chandler AZ Owner Mister Softee of NM, LLC April 2004  – Present (11 years 5 months) Owner Mister Softee of NM, LLC April 2004  – Present (11 years 5 months) Skills Test Equipment Electronics Preventive Maintenance Robotics Manufacturing Cross-functional Team... Metrology Automation Leadership Semiconductor Industry Failure Analysis Design of Experiments Semiconductors SPC Troubleshooting Management Lean Manufacturing Training Process Improvement Program Management Continuous Improvement Six Sigma Engineering Engineering Management See 9+     See less Skills  Test Equipment Electronics Preventive Maintenance Robotics Manufacturing Cross-functional Team... Metrology Automation Leadership Semiconductor Industry Failure Analysis Design of Experiments Semiconductors SPC Troubleshooting Management Lean Manufacturing Training Process Improvement Program Management Continuous Improvement Six Sigma Engineering Engineering Management See 9+     See less Test Equipment Electronics Preventive Maintenance Robotics Manufacturing Cross-functional Team... Metrology Automation Leadership Semiconductor Industry Failure Analysis Design of Experiments Semiconductors SPC Troubleshooting Management Lean Manufacturing Training Process Improvement Program Management Continuous Improvement Six Sigma Engineering Engineering Management See 9+     See less Test Equipment Electronics Preventive Maintenance Robotics Manufacturing Cross-functional Team... Metrology Automation Leadership Semiconductor Industry Failure Analysis Design of Experiments Semiconductors SPC Troubleshooting Management Lean Manufacturing Training Process Improvement Program Management Continuous Improvement Six Sigma Engineering Engineering Management See 9+     See less ", "Experience Manufacturing Equipment Technician Intel Corporation Manufacturing Equipment Technician Intel Corporation Manufacturing Equipment Technician Intel Corporation ", "Summary I troubleshoot, repair, and maintain semiconductor testing equipment at Intel's technology development site in Chandler, Arizona. I work with engineers and technicians to validate new products, test programs, and processes for production. \nI really enjoy this job and it's hands-on work with continuously changing processes that present new challenges. I also enjoy working with a lot of interesting people, and I enjoy working for a great company like Intel. Currently I support several areas, work with multiple pieces of equipment, and support or own multiple projects at any given time. Summary I troubleshoot, repair, and maintain semiconductor testing equipment at Intel's technology development site in Chandler, Arizona. I work with engineers and technicians to validate new products, test programs, and processes for production. \nI really enjoy this job and it's hands-on work with continuously changing processes that present new challenges. I also enjoy working with a lot of interesting people, and I enjoy working for a great company like Intel. Currently I support several areas, work with multiple pieces of equipment, and support or own multiple projects at any given time. I troubleshoot, repair, and maintain semiconductor testing equipment at Intel's technology development site in Chandler, Arizona. I work with engineers and technicians to validate new products, test programs, and processes for production. \nI really enjoy this job and it's hands-on work with continuously changing processes that present new challenges. I also enjoy working with a lot of interesting people, and I enjoy working for a great company like Intel. Currently I support several areas, work with multiple pieces of equipment, and support or own multiple projects at any given time. I troubleshoot, repair, and maintain semiconductor testing equipment at Intel's technology development site in Chandler, Arizona. I work with engineers and technicians to validate new products, test programs, and processes for production. \nI really enjoy this job and it's hands-on work with continuously changing processes that present new challenges. I also enjoy working with a lot of interesting people, and I enjoy working for a great company like Intel. Currently I support several areas, work with multiple pieces of equipment, and support or own multiple projects at any given time. Experience Manufacturing Equipment Technician Intel Corporation August 2007  – Present (8 years 1 month) Chandler, Arizona Arizona Test and Technology Development Manufacturing Technician Intel February 2001  –  August 2007  (6 years 7 months) Colorado Springs, Colorado Worked on equipment and process here in Lithography. Became level IV on the Act 8 and 12 TEL tracks. Led a maintenance team of 3-4 techs on my shift. Worked here until the plant closed in 2007. Manufacturing Technician Intel February 1998  –  February 2001  (3 years 1 month) Hillsboro, Oregon Worked in Lithography at Intel D1B site. Became a level II tech on Act8 TEL tracks here, and did preventive maintenance on Nikon and Micrascan steppers/scanners. Used a variety of supporting metrology equipment such as the CD Sem, KLA, and registration tools. Manufacturing Equipment Technician Intel Corporation August 2007  – Present (8 years 1 month) Chandler, Arizona Arizona Test and Technology Development Manufacturing Equipment Technician Intel Corporation August 2007  – Present (8 years 1 month) Chandler, Arizona Arizona Test and Technology Development Manufacturing Technician Intel February 2001  –  August 2007  (6 years 7 months) Colorado Springs, Colorado Worked on equipment and process here in Lithography. Became level IV on the Act 8 and 12 TEL tracks. Led a maintenance team of 3-4 techs on my shift. Worked here until the plant closed in 2007. Manufacturing Technician Intel February 2001  –  August 2007  (6 years 7 months) Colorado Springs, Colorado Worked on equipment and process here in Lithography. Became level IV on the Act 8 and 12 TEL tracks. Led a maintenance team of 3-4 techs on my shift. Worked here until the plant closed in 2007. Manufacturing Technician Intel February 1998  –  February 2001  (3 years 1 month) Hillsboro, Oregon Worked in Lithography at Intel D1B site. Became a level II tech on Act8 TEL tracks here, and did preventive maintenance on Nikon and Micrascan steppers/scanners. Used a variety of supporting metrology equipment such as the CD Sem, KLA, and registration tools. Manufacturing Technician Intel February 1998  –  February 2001  (3 years 1 month) Hillsboro, Oregon Worked in Lithography at Intel D1B site. Became a level II tech on Act8 TEL tracks here, and did preventive maintenance on Nikon and Micrascan steppers/scanners. Used a variety of supporting metrology equipment such as the CD Sem, KLA, and registration tools. Skills Cross-functional Team... Semiconductors Semiconductor Industry SPC IC Manufacturing Electronics Skills  Cross-functional Team... Semiconductors Semiconductor Industry SPC IC Manufacturing Electronics Cross-functional Team... Semiconductors Semiconductor Industry SPC IC Manufacturing Electronics Cross-functional Team... Semiconductors Semiconductor Industry SPC IC Manufacturing Electronics Education DeVry University Bachelor's degree,  Technical Managment , focus on Systems Analysis & Integration , 4.0 2009  – 2011 Activities and Societies:  Graduated summa cum laude University of Alaska Anchorage Associate of Arts (AA),  Electronics Technology 1995  – 1997 Colorado Technical University Computer Science Portland Community College Calculus & Physics DeVry University Bachelor's degree,  Technical Managment , focus on Systems Analysis & Integration , 4.0 2009  – 2011 Activities and Societies:  Graduated summa cum laude DeVry University Bachelor's degree,  Technical Managment , focus on Systems Analysis & Integration , 4.0 2009  – 2011 Activities and Societies:  Graduated summa cum laude DeVry University Bachelor's degree,  Technical Managment , focus on Systems Analysis & Integration , 4.0 2009  – 2011 Activities and Societies:  Graduated summa cum laude University of Alaska Anchorage Associate of Arts (AA),  Electronics Technology 1995  – 1997 University of Alaska Anchorage Associate of Arts (AA),  Electronics Technology 1995  – 1997 University of Alaska Anchorage Associate of Arts (AA),  Electronics Technology 1995  – 1997 Colorado Technical University Computer Science Colorado Technical University Computer Science Colorado Technical University Computer Science Portland Community College Calculus & Physics Portland Community College Calculus & Physics Portland Community College Calculus & Physics ", "Experience Manufacturing Equipment Technician Intel Corporation Manufacturing Equipment Technician Intel Corporation Manufacturing Equipment Technician Intel Corporation ", "Summary •\tComputer based and hands on training on NextGen, Cerner Millennium, eClinicalWorks and Vista EHR applications \n•\tCompleted HIT program Richland College \n•\tDeveloped customer service skills from working in a mail order pharmacy, automotive parts store and semiconductor industry \n•\tMilitary background advanced troubleshooting skills, ability to adjust to change of plans at a moments notice \n•\tLeadership capabilities organized meetings, delegated tasks for the day, go over individual training plans, prepared training plans for squad and platoon level \n•\tAdministrative duties log data for inventory and update status on equipment and individuals Summary •\tComputer based and hands on training on NextGen, Cerner Millennium, eClinicalWorks and Vista EHR applications \n•\tCompleted HIT program Richland College \n•\tDeveloped customer service skills from working in a mail order pharmacy, automotive parts store and semiconductor industry \n•\tMilitary background advanced troubleshooting skills, ability to adjust to change of plans at a moments notice \n•\tLeadership capabilities organized meetings, delegated tasks for the day, go over individual training plans, prepared training plans for squad and platoon level \n•\tAdministrative duties log data for inventory and update status on equipment and individuals •\tComputer based and hands on training on NextGen, Cerner Millennium, eClinicalWorks and Vista EHR applications \n•\tCompleted HIT program Richland College \n•\tDeveloped customer service skills from working in a mail order pharmacy, automotive parts store and semiconductor industry \n•\tMilitary background advanced troubleshooting skills, ability to adjust to change of plans at a moments notice \n•\tLeadership capabilities organized meetings, delegated tasks for the day, go over individual training plans, prepared training plans for squad and platoon level \n•\tAdministrative duties log data for inventory and update status on equipment and individuals •\tComputer based and hands on training on NextGen, Cerner Millennium, eClinicalWorks and Vista EHR applications \n•\tCompleted HIT program Richland College \n•\tDeveloped customer service skills from working in a mail order pharmacy, automotive parts store and semiconductor industry \n•\tMilitary background advanced troubleshooting skills, ability to adjust to change of plans at a moments notice \n•\tLeadership capabilities organized meetings, delegated tasks for the day, go over individual training plans, prepared training plans for squad and platoon level \n•\tAdministrative duties log data for inventory and update status on equipment and individuals Experience EHR Specialist Health Information Technology Outlook Migration Concierge CompuCom September 2014  –  October 2014  (2 months) Dallas, Tx Assist Clients to migrate their office Outlook accounts to the Organization's server. Worked with other teams to change the DNS MX records and activate the email addresses to the new server. EHR/IT Specialist Los Barrios Unidos Community Clinic June 2013  –  August 2014  (1 year 3 months) Dallas, Texas Perform Desktop support for 180 workstations 3 locations Clinic. Support EHR application issues. Upgrade computer software Windows XP to 7. Startup EHR application in OB unit. MACs and decommission PCs. Assist with Server backup and recovery. Perform Network troubleshooting and repair. Assist in VIOP issues. Support Call center issues. Support Clinical Staff, MAs, RNs and Providers. Assist Business Office staff. Support Printer groups and issues. Setup/close users Accounts in the Active Directory. Setup/close MS outlook Exchange accounts. IT/Procurment Coordinator University Behavioral Health of Denton September 2012  –  December 2012  (4 months) Denton, Texas IT and Procurement support. Information Services Intern Ascension Health April 2012  –  June 2012  (3 months) Austin, Texas Worked on eClinicalWorks and Cerner EHR applications. Participated in Go-Lives. Made rounds on clinical floors to resolve issues with clinicians. Motherboard inspection/ tester VSSI staffing agency January 2011  –  March 2012  (1 year 3 months) Inspected laptop motherboards for corrosion, cracks, or damaged components  \nTested laptop motherboards to verify boot up and basic function checks Development Team Operator /Technician Heliovolt Corporation July 2008  –  March 2010  (1 year 9 months) Performed designed experiments from instructions from the Engineers  \nReported experiment findings to the Engineers \nLogged data for future reference information \nTransferred experiment results to Jump and Excel files developing new Thin Film Technology for solar panels  \nPrepared chemical solutions 8mL to 100L batches depending on the requirement \nWorked with various chemicals and metals: Ammonium Hydroxide, Sulfuric acid, Hydrochloric acid, Copper, Aluminum, Selenium, Cadmium, and Zinc \nMaintain chemical inventory for the development lab  \nPerformed operations/equipment repairs on deposition, sputter and coater tools Senior Manufacturing Equipment Technician Intel Corporation March 1997  –  January 2007  (9 years 11 months) Maintained equipment status reports and informed the Supervisors and Team leads of any tool issues during the shift  \nAttended Operations beginning shift meeting to coordinate a tentative schedule for PMs, and maintenance for the week  \nPerformed equipment meetings to assign equipment technicians PMs and repairs \nPerformed end of shift pass downs to inform on tool issues and request to idle tools for PMs the next day  \nServed as a mentor to less experienced peers by motivating, guiding them performing tasks  \nAssisted IT department for setting up and trouble shooting workstations and printers for the local network.  \nCommunicated risk areas and develop detailed project plans and proposing solutions \nto roadblocks to the Lithography Supervisors \nRegularly demonstrated ownership of tasks like training, engineer experiments, or investigation of causes of defective wafers \nResolved issues between technicians without having to escalate to the Supervisors  \nPrepared, monitor and review technician’s learning plans Customer Service Representative National Rx August 1995  –  December 1996  (1 year 5 months) Irving, Tx Worked in a call center to process patient prescription orders and look up benefits. Sorted out past orders by researching the patients history through the use of Crystal light software a pharmacy application. Multiple Launch Rocket Systems crewmember Sergeant E-5, United States Army Reserve May 1983  –  July 1995  (12 years 3 months) 4th Battalion, 27th Field Artillery Driver on a 28 ton Rocket Launcher track vehicle \nParticipated in Desert Storm assigned to 7th Corp, awarded 3 bronze campaign stars \nOperated/ performed maintenance on vehicles, weapons and electronic equipment \nAssisted the supply section in updating unit inventory, ordering and returning \nTrained and served as unit Armorer higher level maintenance on individual and crew served weapons, night vision goggles and scopes; Maintenance Section leader in a UH-1H helicopter Unit  \nPrepared training plans and assigned work orders for up to 20 soldiers  \nCoordinated with advance party to set up operation sites in the field  \nShowed ability to move with change of plans and took on tasks not trained for\t \nParticipated in Task Force \"Fuetes Cominos\" supported the Army Corp of Engineers to build roads in Honduras EHR Specialist Health Information Technology EHR Specialist Health Information Technology Outlook Migration Concierge CompuCom September 2014  –  October 2014  (2 months) Dallas, Tx Assist Clients to migrate their office Outlook accounts to the Organization's server. Worked with other teams to change the DNS MX records and activate the email addresses to the new server. Outlook Migration Concierge CompuCom September 2014  –  October 2014  (2 months) Dallas, Tx Assist Clients to migrate their office Outlook accounts to the Organization's server. Worked with other teams to change the DNS MX records and activate the email addresses to the new server. EHR/IT Specialist Los Barrios Unidos Community Clinic June 2013  –  August 2014  (1 year 3 months) Dallas, Texas Perform Desktop support for 180 workstations 3 locations Clinic. Support EHR application issues. Upgrade computer software Windows XP to 7. Startup EHR application in OB unit. MACs and decommission PCs. Assist with Server backup and recovery. Perform Network troubleshooting and repair. Assist in VIOP issues. Support Call center issues. Support Clinical Staff, MAs, RNs and Providers. Assist Business Office staff. Support Printer groups and issues. Setup/close users Accounts in the Active Directory. Setup/close MS outlook Exchange accounts. EHR/IT Specialist Los Barrios Unidos Community Clinic June 2013  –  August 2014  (1 year 3 months) Dallas, Texas Perform Desktop support for 180 workstations 3 locations Clinic. Support EHR application issues. Upgrade computer software Windows XP to 7. Startup EHR application in OB unit. MACs and decommission PCs. Assist with Server backup and recovery. Perform Network troubleshooting and repair. Assist in VIOP issues. Support Call center issues. Support Clinical Staff, MAs, RNs and Providers. Assist Business Office staff. Support Printer groups and issues. Setup/close users Accounts in the Active Directory. Setup/close MS outlook Exchange accounts. IT/Procurment Coordinator University Behavioral Health of Denton September 2012  –  December 2012  (4 months) Denton, Texas IT and Procurement support. IT/Procurment Coordinator University Behavioral Health of Denton September 2012  –  December 2012  (4 months) Denton, Texas IT and Procurement support. Information Services Intern Ascension Health April 2012  –  June 2012  (3 months) Austin, Texas Worked on eClinicalWorks and Cerner EHR applications. Participated in Go-Lives. Made rounds on clinical floors to resolve issues with clinicians. Information Services Intern Ascension Health April 2012  –  June 2012  (3 months) Austin, Texas Worked on eClinicalWorks and Cerner EHR applications. Participated in Go-Lives. Made rounds on clinical floors to resolve issues with clinicians. Motherboard inspection/ tester VSSI staffing agency January 2011  –  March 2012  (1 year 3 months) Inspected laptop motherboards for corrosion, cracks, or damaged components  \nTested laptop motherboards to verify boot up and basic function checks Motherboard inspection/ tester VSSI staffing agency January 2011  –  March 2012  (1 year 3 months) Inspected laptop motherboards for corrosion, cracks, or damaged components  \nTested laptop motherboards to verify boot up and basic function checks Development Team Operator /Technician Heliovolt Corporation July 2008  –  March 2010  (1 year 9 months) Performed designed experiments from instructions from the Engineers  \nReported experiment findings to the Engineers \nLogged data for future reference information \nTransferred experiment results to Jump and Excel files developing new Thin Film Technology for solar panels  \nPrepared chemical solutions 8mL to 100L batches depending on the requirement \nWorked with various chemicals and metals: Ammonium Hydroxide, Sulfuric acid, Hydrochloric acid, Copper, Aluminum, Selenium, Cadmium, and Zinc \nMaintain chemical inventory for the development lab  \nPerformed operations/equipment repairs on deposition, sputter and coater tools Development Team Operator /Technician Heliovolt Corporation July 2008  –  March 2010  (1 year 9 months) Performed designed experiments from instructions from the Engineers  \nReported experiment findings to the Engineers \nLogged data for future reference information \nTransferred experiment results to Jump and Excel files developing new Thin Film Technology for solar panels  \nPrepared chemical solutions 8mL to 100L batches depending on the requirement \nWorked with various chemicals and metals: Ammonium Hydroxide, Sulfuric acid, Hydrochloric acid, Copper, Aluminum, Selenium, Cadmium, and Zinc \nMaintain chemical inventory for the development lab  \nPerformed operations/equipment repairs on deposition, sputter and coater tools Senior Manufacturing Equipment Technician Intel Corporation March 1997  –  January 2007  (9 years 11 months) Maintained equipment status reports and informed the Supervisors and Team leads of any tool issues during the shift  \nAttended Operations beginning shift meeting to coordinate a tentative schedule for PMs, and maintenance for the week  \nPerformed equipment meetings to assign equipment technicians PMs and repairs \nPerformed end of shift pass downs to inform on tool issues and request to idle tools for PMs the next day  \nServed as a mentor to less experienced peers by motivating, guiding them performing tasks  \nAssisted IT department for setting up and trouble shooting workstations and printers for the local network.  \nCommunicated risk areas and develop detailed project plans and proposing solutions \nto roadblocks to the Lithography Supervisors \nRegularly demonstrated ownership of tasks like training, engineer experiments, or investigation of causes of defective wafers \nResolved issues between technicians without having to escalate to the Supervisors  \nPrepared, monitor and review technician’s learning plans Senior Manufacturing Equipment Technician Intel Corporation March 1997  –  January 2007  (9 years 11 months) Maintained equipment status reports and informed the Supervisors and Team leads of any tool issues during the shift  \nAttended Operations beginning shift meeting to coordinate a tentative schedule for PMs, and maintenance for the week  \nPerformed equipment meetings to assign equipment technicians PMs and repairs \nPerformed end of shift pass downs to inform on tool issues and request to idle tools for PMs the next day  \nServed as a mentor to less experienced peers by motivating, guiding them performing tasks  \nAssisted IT department for setting up and trouble shooting workstations and printers for the local network.  \nCommunicated risk areas and develop detailed project plans and proposing solutions \nto roadblocks to the Lithography Supervisors \nRegularly demonstrated ownership of tasks like training, engineer experiments, or investigation of causes of defective wafers \nResolved issues between technicians without having to escalate to the Supervisors  \nPrepared, monitor and review technician’s learning plans Customer Service Representative National Rx August 1995  –  December 1996  (1 year 5 months) Irving, Tx Worked in a call center to process patient prescription orders and look up benefits. Sorted out past orders by researching the patients history through the use of Crystal light software a pharmacy application. Customer Service Representative National Rx August 1995  –  December 1996  (1 year 5 months) Irving, Tx Worked in a call center to process patient prescription orders and look up benefits. Sorted out past orders by researching the patients history through the use of Crystal light software a pharmacy application. Multiple Launch Rocket Systems crewmember Sergeant E-5, United States Army Reserve May 1983  –  July 1995  (12 years 3 months) 4th Battalion, 27th Field Artillery Driver on a 28 ton Rocket Launcher track vehicle \nParticipated in Desert Storm assigned to 7th Corp, awarded 3 bronze campaign stars \nOperated/ performed maintenance on vehicles, weapons and electronic equipment \nAssisted the supply section in updating unit inventory, ordering and returning \nTrained and served as unit Armorer higher level maintenance on individual and crew served weapons, night vision goggles and scopes; Maintenance Section leader in a UH-1H helicopter Unit  \nPrepared training plans and assigned work orders for up to 20 soldiers  \nCoordinated with advance party to set up operation sites in the field  \nShowed ability to move with change of plans and took on tasks not trained for\t \nParticipated in Task Force \"Fuetes Cominos\" supported the Army Corp of Engineers to build roads in Honduras Multiple Launch Rocket Systems crewmember Sergeant E-5, United States Army Reserve May 1983  –  July 1995  (12 years 3 months) 4th Battalion, 27th Field Artillery Driver on a 28 ton Rocket Launcher track vehicle \nParticipated in Desert Storm assigned to 7th Corp, awarded 3 bronze campaign stars \nOperated/ performed maintenance on vehicles, weapons and electronic equipment \nAssisted the supply section in updating unit inventory, ordering and returning \nTrained and served as unit Armorer higher level maintenance on individual and crew served weapons, night vision goggles and scopes; Maintenance Section leader in a UH-1H helicopter Unit  \nPrepared training plans and assigned work orders for up to 20 soldiers  \nCoordinated with advance party to set up operation sites in the field  \nShowed ability to move with change of plans and took on tasks not trained for\t \nParticipated in Task Force \"Fuetes Cominos\" supported the Army Corp of Engineers to build roads in Honduras Languages Spanish Spanish Spanish Skills Cerner, eClinicalWorks,... Microsoft Office SPC++ Statistical... R&D Project Management Microsoft Excel Customer Service Employee Relations Microsoft Word Troubleshooting Technical Recruiting Design of Experiments Semiconductors Process Improvement Six Sigma Program Management PowerPoint Performance Management Cross-functional Team... Lean Manufacturing Team Building Manufacturing Call Centers Management Vendor Management Operations Management Data Analysis Recruiting Team Leadership Leadership Training See 16+     See less Skills  Cerner, eClinicalWorks,... Microsoft Office SPC++ Statistical... R&D Project Management Microsoft Excel Customer Service Employee Relations Microsoft Word Troubleshooting Technical Recruiting Design of Experiments Semiconductors Process Improvement Six Sigma Program Management PowerPoint Performance Management Cross-functional Team... Lean Manufacturing Team Building Manufacturing Call Centers Management Vendor Management Operations Management Data Analysis Recruiting Team Leadership Leadership Training See 16+     See less Cerner, eClinicalWorks,... Microsoft Office SPC++ Statistical... R&D Project Management Microsoft Excel Customer Service Employee Relations Microsoft Word Troubleshooting Technical Recruiting Design of Experiments Semiconductors Process Improvement Six Sigma Program Management PowerPoint Performance Management Cross-functional Team... Lean Manufacturing Team Building Manufacturing Call Centers Management Vendor Management Operations Management Data Analysis Recruiting Team Leadership Leadership Training See 16+     See less Cerner, eClinicalWorks,... Microsoft Office SPC++ Statistical... R&D Project Management Microsoft Excel Customer Service Employee Relations Microsoft Word Troubleshooting Technical Recruiting Design of Experiments Semiconductors Process Improvement Six Sigma Program Management PowerPoint Performance Management Cross-functional Team... Lean Manufacturing Team Building Manufacturing Call Centers Management Vendor Management Operations Management Data Analysis Recruiting Team Leadership Leadership Training See 16+     See less Education Richland College 2011  – 2012 DeVry University Irving, Texas Associate of Applied Science,  Electronics and Computer Technology , 3.55 1995  – 1997 Activities and Societies:  Dean's List: Fall 1995 ,  Spring 1996 ,  Summer 1996 United States Army Aviation School Certificate,  Helicopter maintenance 1983  – 1983 Argyle Richland College 2011  – 2012 Richland College 2011  – 2012 Richland College 2011  – 2012 DeVry University Irving, Texas Associate of Applied Science,  Electronics and Computer Technology , 3.55 1995  – 1997 Activities and Societies:  Dean's List: Fall 1995 ,  Spring 1996 ,  Summer 1996 DeVry University Irving, Texas Associate of Applied Science,  Electronics and Computer Technology , 3.55 1995  – 1997 Activities and Societies:  Dean's List: Fall 1995 ,  Spring 1996 ,  Summer 1996 DeVry University Irving, Texas Associate of Applied Science,  Electronics and Computer Technology , 3.55 1995  – 1997 Activities and Societies:  Dean's List: Fall 1995 ,  Spring 1996 ,  Summer 1996 United States Army Aviation School Certificate,  Helicopter maintenance 1983  – 1983 United States Army Aviation School Certificate,  Helicopter maintenance 1983  – 1983 United States Army Aviation School Certificate,  Helicopter maintenance 1983  – 1983 Argyle Argyle Argyle ", "Experience Manufacturing Equipment Technician at Intel Corporation Intel Corporation August 1990  – Present (25 years 1 month) Manufacturing Equipment Technician at Intel Corporation Intel Corporation August 1990  – Present (25 years 1 month) Manufacturing Equipment Technician at Intel Corporation Intel Corporation August 1990  – Present (25 years 1 month) Skills Semiconductor Industry SPC charts Preventive Maintenance Robotics Automation Test Equipment Manufacturing Team Leadership Design of Experiments Electronics Equipment Maintenance Employee Training Diffusion Dry Etch Planarization C4 Wet Chemical Etching Semiconductors Product Development SPC Engineering Continuous Improvement Engineering Management Lean Manufacturing IC Failure Analysis Testing Troubleshooting See 13+     See less Skills  Semiconductor Industry SPC charts Preventive Maintenance Robotics Automation Test Equipment Manufacturing Team Leadership Design of Experiments Electronics Equipment Maintenance Employee Training Diffusion Dry Etch Planarization C4 Wet Chemical Etching Semiconductors Product Development SPC Engineering Continuous Improvement Engineering Management Lean Manufacturing IC Failure Analysis Testing Troubleshooting See 13+     See less Semiconductor Industry SPC charts Preventive Maintenance Robotics Automation Test Equipment Manufacturing Team Leadership Design of Experiments Electronics Equipment Maintenance Employee Training Diffusion Dry Etch Planarization C4 Wet Chemical Etching Semiconductors Product Development SPC Engineering Continuous Improvement Engineering Management Lean Manufacturing IC Failure Analysis Testing Troubleshooting See 13+     See less Semiconductor Industry SPC charts Preventive Maintenance Robotics Automation Test Equipment Manufacturing Team Leadership Design of Experiments Electronics Equipment Maintenance Employee Training Diffusion Dry Etch Planarization C4 Wet Chemical Etching Semiconductors Product Development SPC Engineering Continuous Improvement Engineering Management Lean Manufacturing IC Failure Analysis Testing Troubleshooting See 13+     See less Education The University of New Mexico The University of New Mexico The University of New Mexico The University of New Mexico ", "Summary Skilled professional with extensive experience in Management, Operational Performance, Team Development, Safety, Quality Assurance, Communications and Problem Solving. Detail-oriented, with outstanding work prioritization skills and aptitudes. Team player with a positive work attitude Summary Skilled professional with extensive experience in Management, Operational Performance, Team Development, Safety, Quality Assurance, Communications and Problem Solving. Detail-oriented, with outstanding work prioritization skills and aptitudes. Team player with a positive work attitude Skilled professional with extensive experience in Management, Operational Performance, Team Development, Safety, Quality Assurance, Communications and Problem Solving. Detail-oriented, with outstanding work prioritization skills and aptitudes. Team player with a positive work attitude Skilled professional with extensive experience in Management, Operational Performance, Team Development, Safety, Quality Assurance, Communications and Problem Solving. Detail-oriented, with outstanding work prioritization skills and aptitudes. Team player with a positive work attitude Experience Manufacturing Equipment Technician Intel Corporation May 1995  – Present (20 years 4 months) Responsible for overall equipment management. Key deliverables initiated and streamlined corrective maintenance and preventative maintenance, implement change orders to support Research and Development specifications, trained junior personal in best known methods to include equipment certifications, Equipment cost reduction and maintaining an incident injury free (IIF) performance. \nInstall Equipment Owner/ Construction Coordination at Intel and Intel Micron Flash technology, Traveled to Israel, Ireland and Singapore for special projects at Intel. Interpret schematics and drawings, develop improvement processes and documentation of tool matching procedures, managing various union-trades during construction schedules through Primavera Systems, Responsible for the successful Tool Installation, Copy Smartly documentation, Hardware and Software Modification, protocol compliance, training, implementing area improvements, Supervised the installation, conversions, upgrades, maintenance, qualification and repair of AMAT Reflexion LK CMP, Amat Reflexions,and Ebara 300s, Lam Ontrak Scrubber, IPEC 372m, Avantguard 676, Amat Mirramesa and MIrratraks Field service technician Cox Communication February 1993  –  May 1995  (2 years 4 months) Field maintenance Technician \t \nPerformed detailed troubleshooting to restore cable system (outages). \nPerform preventive and corrective maintenance on cables  \nEducate customer on how to use their equipment more efficiently and on all available consumer services. \nProvide accurate, efficient, individualizes repair service for customers 1st Class Electronics Technician US Navy January 1983  –  December 1992  (10 years) \tNavigational and Communication Specialist \n\tTechnical Instructor in electronic and strategic weapons systems  \n\tExtensive background in electronics \n\tElectronic engineering technology associates equivalent \n\tTest equipment calibration and repair technician \n\tAwarded Navy Achievement medal  \n\tHeld top secret security clearance Manufacturing Equipment Technician Intel Corporation May 1995  – Present (20 years 4 months) Responsible for overall equipment management. Key deliverables initiated and streamlined corrective maintenance and preventative maintenance, implement change orders to support Research and Development specifications, trained junior personal in best known methods to include equipment certifications, Equipment cost reduction and maintaining an incident injury free (IIF) performance. \nInstall Equipment Owner/ Construction Coordination at Intel and Intel Micron Flash technology, Traveled to Israel, Ireland and Singapore for special projects at Intel. Interpret schematics and drawings, develop improvement processes and documentation of tool matching procedures, managing various union-trades during construction schedules through Primavera Systems, Responsible for the successful Tool Installation, Copy Smartly documentation, Hardware and Software Modification, protocol compliance, training, implementing area improvements, Supervised the installation, conversions, upgrades, maintenance, qualification and repair of AMAT Reflexion LK CMP, Amat Reflexions,and Ebara 300s, Lam Ontrak Scrubber, IPEC 372m, Avantguard 676, Amat Mirramesa and MIrratraks Manufacturing Equipment Technician Intel Corporation May 1995  – Present (20 years 4 months) Responsible for overall equipment management. Key deliverables initiated and streamlined corrective maintenance and preventative maintenance, implement change orders to support Research and Development specifications, trained junior personal in best known methods to include equipment certifications, Equipment cost reduction and maintaining an incident injury free (IIF) performance. \nInstall Equipment Owner/ Construction Coordination at Intel and Intel Micron Flash technology, Traveled to Israel, Ireland and Singapore for special projects at Intel. Interpret schematics and drawings, develop improvement processes and documentation of tool matching procedures, managing various union-trades during construction schedules through Primavera Systems, Responsible for the successful Tool Installation, Copy Smartly documentation, Hardware and Software Modification, protocol compliance, training, implementing area improvements, Supervised the installation, conversions, upgrades, maintenance, qualification and repair of AMAT Reflexion LK CMP, Amat Reflexions,and Ebara 300s, Lam Ontrak Scrubber, IPEC 372m, Avantguard 676, Amat Mirramesa and MIrratraks Field service technician Cox Communication February 1993  –  May 1995  (2 years 4 months) Field maintenance Technician \t \nPerformed detailed troubleshooting to restore cable system (outages). \nPerform preventive and corrective maintenance on cables  \nEducate customer on how to use their equipment more efficiently and on all available consumer services. \nProvide accurate, efficient, individualizes repair service for customers Field service technician Cox Communication February 1993  –  May 1995  (2 years 4 months) Field maintenance Technician \t \nPerformed detailed troubleshooting to restore cable system (outages). \nPerform preventive and corrective maintenance on cables  \nEducate customer on how to use their equipment more efficiently and on all available consumer services. \nProvide accurate, efficient, individualizes repair service for customers 1st Class Electronics Technician US Navy January 1983  –  December 1992  (10 years) \tNavigational and Communication Specialist \n\tTechnical Instructor in electronic and strategic weapons systems  \n\tExtensive background in electronics \n\tElectronic engineering technology associates equivalent \n\tTest equipment calibration and repair technician \n\tAwarded Navy Achievement medal  \n\tHeld top secret security clearance 1st Class Electronics Technician US Navy January 1983  –  December 1992  (10 years) \tNavigational and Communication Specialist \n\tTechnical Instructor in electronic and strategic weapons systems  \n\tExtensive background in electronics \n\tElectronic engineering technology associates equivalent \n\tTest equipment calibration and repair technician \n\tAwarded Navy Achievement medal  \n\tHeld top secret security clearance Skills Electronics Semiconductors Manufacturing Troubleshooting Semiconductor Industry SPC Cross-functional Team... Lean Manufacturing Preventive Maintenance IC Hardware Quality Assurance Test Equipment Design of Experiments Embedded Systems Program Management Product Management Intel Silicon Debugging Software Documentation SoC ASIC People Management People Development Instructor-led Training Curriculum Development See 12+     See less Skills  Electronics Semiconductors Manufacturing Troubleshooting Semiconductor Industry SPC Cross-functional Team... Lean Manufacturing Preventive Maintenance IC Hardware Quality Assurance Test Equipment Design of Experiments Embedded Systems Program Management Product Management Intel Silicon Debugging Software Documentation SoC ASIC People Management People Development Instructor-led Training Curriculum Development See 12+     See less Electronics Semiconductors Manufacturing Troubleshooting Semiconductor Industry SPC Cross-functional Team... Lean Manufacturing Preventive Maintenance IC Hardware Quality Assurance Test Equipment Design of Experiments Embedded Systems Program Management Product Management Intel Silicon Debugging Software Documentation SoC ASIC People Management People Development Instructor-led Training Curriculum Development See 12+     See less Electronics Semiconductors Manufacturing Troubleshooting Semiconductor Industry SPC Cross-functional Team... Lean Manufacturing Preventive Maintenance IC Hardware Quality Assurance Test Equipment Design of Experiments Embedded Systems Program Management Product Management Intel Silicon Debugging Software Documentation SoC ASIC People Management People Development Instructor-led Training Curriculum Development See 12+     See less Education Central New Mexico Community College 2012  – 2020 Central New Mexico Community College 2012  – 2020 Central New Mexico Community College 2012  – 2020 Central New Mexico Community College 2012  – 2020 ", "Experience Manufacturing Equipment Technician Intel Corporation March 1997  – Present (18 years 6 months) Run them, clean them, fix them. Manufacturing Equipment Technician Intel Corporation March 1997  – Present (18 years 6 months) Run them, clean them, fix them. Manufacturing Equipment Technician Intel Corporation March 1997  – Present (18 years 6 months) Run them, clean them, fix them. Skills Semiconductors Cross-functional Team... Semiconductor Industry SPC IC Manufacturing SoC Electronics Embedded Systems Lean Manufacturing Skills  Semiconductors Cross-functional Team... Semiconductor Industry SPC IC Manufacturing SoC Electronics Embedded Systems Lean Manufacturing Semiconductors Cross-functional Team... Semiconductor Industry SPC IC Manufacturing SoC Electronics Embedded Systems Lean Manufacturing Semiconductors Cross-functional Team... Semiconductor Industry SPC IC Manufacturing SoC Electronics Embedded Systems Lean Manufacturing Education DeVry Institute of Technology - Chicago Associate of Science (A.S.),  Electronics Technology 1995  – 1997 DeVry Institute of Technology - Chicago Associate of Science (A.S.),  Electronics Technology 1995  – 1997 DeVry Institute of Technology - Chicago Associate of Science (A.S.),  Electronics Technology 1995  – 1997 DeVry Institute of Technology - Chicago Associate of Science (A.S.),  Electronics Technology 1995  – 1997 ", "Experience Associate Test Engineer Xradia is now ZEISS April 2014  – Present (1 year 5 months) Pleasanton, ca Complete Final Test on 3D X-Ray Systems including incoming inspection and installation of x-ray sub-assembly components such as x-ray source and objectives.  \n \nPerform Integration procedures consisting of software, electrical and mechanical systems. Service Manager/IT Technician Passmore Ranch-Sustainable Aqua Farming May 2012  –  April 2014  (2 years) Manage and optimize software systems, maintain multiple networks containing PC and Mac computers. \nService customer accounts, manage delivery routing, product logistics and maintain vehicle maintenance schedules. MOCVD Technician Bridgelux, Inc. October 2010  –  September 2011  (1 year) Livermore, CA Developed and drove approval modifying my position as a hybrid for both equipment and operation technician. Approval reduced maintenance need by 1 head count.  \n \nContinuously stay past scheduled hours to ensure maximum production resulting in 30% to 100% increase. Increased production allowed Bridgelux to limit expansion which saved in the cost of 2 FTE. \n \nPerform equipment preventative maintenance and repairs. Leak check High Vacuum process chambers, transport modules and Nitrogen and Hydrogen supply lines using Helium leak checker. Lead Manufacturing Technician Calisolar-Solar cell March 2010  –  October 2010  (8 months) Promoted to Lead technician within first week of hire due to initiative and high productivity which enabled the company to start 24/7 production. \n \nCollaborated with engineers testing print screens, print height and speed, multiple different Silver and Aluminum paste. Data resulted with improved average efficiency from 15.6% to 16.4%. Manufacturing Equipment Technician Intel Corporation-Semiconductor October 2000  –  September 2009  (9 years) Rated as outstanding (the highest rating) for the 2007 review period based on performance --Received promotion as reward for all accomplishments achieved. \n \nServed as the acting Copper Planar Cluster Lead, chartered with ensuring safe and efficient tactical operations and facilitate results through collaboration and problem solving. \n \nVersatile member of the Copper Planarization team: certified as equipment and process technician, responsible for preventative maintenance and repair on pneumatic, robotic and motorized systems.  \n \nCollaborated with engineering on experiments that saved operating cost on slurry qualifications and consumables extension projects. For example, consumables at our module were extended 5X. \n \nTrained multiple Technicians on equipment, process and operational tasks within the forecasted schedule in order to maximize productivity. Lead Specialist Apple Computers Incorporated January 1999  –  January 2000  (1 year 1 month) Debugged computers as per specifications due to improper software installation and faulty CPU, motherboards, video cards, memory, hard drives, optical drive units and corrected root cause issues. \n \nInstalled and configured self test software. Collected and logged burn-in data and report to engineering as an isolated issue or to flag a trending issue with hardware and software malfunctions. Associate Test Engineer Xradia is now ZEISS April 2014  – Present (1 year 5 months) Pleasanton, ca Complete Final Test on 3D X-Ray Systems including incoming inspection and installation of x-ray sub-assembly components such as x-ray source and objectives.  \n \nPerform Integration procedures consisting of software, electrical and mechanical systems. Associate Test Engineer Xradia is now ZEISS April 2014  – Present (1 year 5 months) Pleasanton, ca Complete Final Test on 3D X-Ray Systems including incoming inspection and installation of x-ray sub-assembly components such as x-ray source and objectives.  \n \nPerform Integration procedures consisting of software, electrical and mechanical systems. Service Manager/IT Technician Passmore Ranch-Sustainable Aqua Farming May 2012  –  April 2014  (2 years) Manage and optimize software systems, maintain multiple networks containing PC and Mac computers. \nService customer accounts, manage delivery routing, product logistics and maintain vehicle maintenance schedules. Service Manager/IT Technician Passmore Ranch-Sustainable Aqua Farming May 2012  –  April 2014  (2 years) Manage and optimize software systems, maintain multiple networks containing PC and Mac computers. \nService customer accounts, manage delivery routing, product logistics and maintain vehicle maintenance schedules. MOCVD Technician Bridgelux, Inc. October 2010  –  September 2011  (1 year) Livermore, CA Developed and drove approval modifying my position as a hybrid for both equipment and operation technician. Approval reduced maintenance need by 1 head count.  \n \nContinuously stay past scheduled hours to ensure maximum production resulting in 30% to 100% increase. Increased production allowed Bridgelux to limit expansion which saved in the cost of 2 FTE. \n \nPerform equipment preventative maintenance and repairs. Leak check High Vacuum process chambers, transport modules and Nitrogen and Hydrogen supply lines using Helium leak checker. MOCVD Technician Bridgelux, Inc. October 2010  –  September 2011  (1 year) Livermore, CA Developed and drove approval modifying my position as a hybrid for both equipment and operation technician. Approval reduced maintenance need by 1 head count.  \n \nContinuously stay past scheduled hours to ensure maximum production resulting in 30% to 100% increase. Increased production allowed Bridgelux to limit expansion which saved in the cost of 2 FTE. \n \nPerform equipment preventative maintenance and repairs. Leak check High Vacuum process chambers, transport modules and Nitrogen and Hydrogen supply lines using Helium leak checker. Lead Manufacturing Technician Calisolar-Solar cell March 2010  –  October 2010  (8 months) Promoted to Lead technician within first week of hire due to initiative and high productivity which enabled the company to start 24/7 production. \n \nCollaborated with engineers testing print screens, print height and speed, multiple different Silver and Aluminum paste. Data resulted with improved average efficiency from 15.6% to 16.4%. Lead Manufacturing Technician Calisolar-Solar cell March 2010  –  October 2010  (8 months) Promoted to Lead technician within first week of hire due to initiative and high productivity which enabled the company to start 24/7 production. \n \nCollaborated with engineers testing print screens, print height and speed, multiple different Silver and Aluminum paste. Data resulted with improved average efficiency from 15.6% to 16.4%. Manufacturing Equipment Technician Intel Corporation-Semiconductor October 2000  –  September 2009  (9 years) Rated as outstanding (the highest rating) for the 2007 review period based on performance --Received promotion as reward for all accomplishments achieved. \n \nServed as the acting Copper Planar Cluster Lead, chartered with ensuring safe and efficient tactical operations and facilitate results through collaboration and problem solving. \n \nVersatile member of the Copper Planarization team: certified as equipment and process technician, responsible for preventative maintenance and repair on pneumatic, robotic and motorized systems.  \n \nCollaborated with engineering on experiments that saved operating cost on slurry qualifications and consumables extension projects. For example, consumables at our module were extended 5X. \n \nTrained multiple Technicians on equipment, process and operational tasks within the forecasted schedule in order to maximize productivity. Manufacturing Equipment Technician Intel Corporation-Semiconductor October 2000  –  September 2009  (9 years) Rated as outstanding (the highest rating) for the 2007 review period based on performance --Received promotion as reward for all accomplishments achieved. \n \nServed as the acting Copper Planar Cluster Lead, chartered with ensuring safe and efficient tactical operations and facilitate results through collaboration and problem solving. \n \nVersatile member of the Copper Planarization team: certified as equipment and process technician, responsible for preventative maintenance and repair on pneumatic, robotic and motorized systems.  \n \nCollaborated with engineering on experiments that saved operating cost on slurry qualifications and consumables extension projects. For example, consumables at our module were extended 5X. \n \nTrained multiple Technicians on equipment, process and operational tasks within the forecasted schedule in order to maximize productivity. Lead Specialist Apple Computers Incorporated January 1999  –  January 2000  (1 year 1 month) Debugged computers as per specifications due to improper software installation and faulty CPU, motherboards, video cards, memory, hard drives, optical drive units and corrected root cause issues. \n \nInstalled and configured self test software. Collected and logged burn-in data and report to engineering as an isolated issue or to flag a trending issue with hardware and software malfunctions. Lead Specialist Apple Computers Incorporated January 1999  –  January 2000  (1 year 1 month) Debugged computers as per specifications due to improper software installation and faulty CPU, motherboards, video cards, memory, hard drives, optical drive units and corrected root cause issues. \n \nInstalled and configured self test software. Collected and logged burn-in data and report to engineering as an isolated issue or to flag a trending issue with hardware and software malfunctions. Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Semiconductor... Semiconductors SPC Preventive Maintenance Manufacturing MOCVD High Vacuum Failure Analysis Testing Skills  Semiconductor... Semiconductors SPC Preventive Maintenance Manufacturing MOCVD High Vacuum Failure Analysis Testing Semiconductor... Semiconductors SPC Preventive Maintenance Manufacturing MOCVD High Vacuum Failure Analysis Testing Semiconductor... Semiconductors SPC Preventive Maintenance Manufacturing MOCVD High Vacuum Failure Analysis Testing Education ITT Technical Institute BS,  Electronic Engineering Technology 1997  – 2000 ITT Technical Institute BS,  Electronic Engineering Technology 1997  – 2000 ITT Technical Institute BS,  Electronic Engineering Technology 1997  – 2000 ITT Technical Institute BS,  Electronic Engineering Technology 1997  – 2000 ", "Experience Manufacturing Equipment Technician Intel Corporation November 1995  – Present (19 years 10 months) Avionics Technician US Navy October 1985  –  September 1995  (10 years) NAS Oceana, NAS Miramar VF-11 (1987 - 1991) \nVF-124 (1992 - 1994) \nVF-213 (1994-1995) Manufacturing Equipment Technician Intel Corporation November 1995  – Present (19 years 10 months) Manufacturing Equipment Technician Intel Corporation November 1995  – Present (19 years 10 months) Avionics Technician US Navy October 1985  –  September 1995  (10 years) NAS Oceana, NAS Miramar VF-11 (1987 - 1991) \nVF-124 (1992 - 1994) \nVF-213 (1994-1995) Avionics Technician US Navy October 1985  –  September 1995  (10 years) NAS Oceana, NAS Miramar VF-11 (1987 - 1991) \nVF-124 (1992 - 1994) \nVF-213 (1994-1995) Skills Semiconductors Semiconductor Industry IC SoC Silicon ASIC Intel Process Integration CMOS JMP Yield Processors VLSI Mixed Signal Radar Weapons Navigation Systems Radio Communication Avionics Root Cause Analysis Process Automation Laser Engraving Engineering Management Test Equipment See 9+     See less Skills  Semiconductors Semiconductor Industry IC SoC Silicon ASIC Intel Process Integration CMOS JMP Yield Processors VLSI Mixed Signal Radar Weapons Navigation Systems Radio Communication Avionics Root Cause Analysis Process Automation Laser Engraving Engineering Management Test Equipment See 9+     See less Semiconductors Semiconductor Industry IC SoC Silicon ASIC Intel Process Integration CMOS JMP Yield Processors VLSI Mixed Signal Radar Weapons Navigation Systems Radio Communication Avionics Root Cause Analysis Process Automation Laser Engraving Engineering Management Test Equipment See 9+     See less Semiconductors Semiconductor Industry IC SoC Silicon ASIC Intel Process Integration CMOS JMP Yield Processors VLSI Mixed Signal Radar Weapons Navigation Systems Radio Communication Avionics Root Cause Analysis Process Automation Laser Engraving Engineering Management Test Equipment See 9+     See less Education NATTC, TN (US Navy Technical Training) Advanced Avionics 1991  – 1992 U.S. Navy \"C\" School Training NATTC, TN (US Navy Technical Training) Avionics Maintenance Technology/Technician 1986  – 1988 U.S. Navy \"A\" School Training, plus \nU.S. Navy \"Advanced First Term Avionics\" Training NATTC, TN (US Navy Technical Training) Advanced Avionics 1991  – 1992 U.S. Navy \"C\" School Training NATTC, TN (US Navy Technical Training) Advanced Avionics 1991  – 1992 U.S. Navy \"C\" School Training NATTC, TN (US Navy Technical Training) Advanced Avionics 1991  – 1992 U.S. Navy \"C\" School Training NATTC, TN (US Navy Technical Training) Avionics Maintenance Technology/Technician 1986  – 1988 U.S. Navy \"A\" School Training, plus \nU.S. Navy \"Advanced First Term Avionics\" Training NATTC, TN (US Navy Technical Training) Avionics Maintenance Technology/Technician 1986  – 1988 U.S. Navy \"A\" School Training, plus \nU.S. Navy \"Advanced First Term Avionics\" Training NATTC, TN (US Navy Technical Training) Avionics Maintenance Technology/Technician 1986  – 1988 U.S. Navy \"A\" School Training, plus \nU.S. Navy \"Advanced First Term Avionics\" Training ", "Summary Extensive experience in high–volume manufacturing environments including Retronix Semiconductor, Intel Corp. and Harman International Industries. Skilled in areas to include Preventive and Corrective Maintenance, Equipment Installation/Setup and tool performance issues. Solution’s focused, self-motivated, creative troubleshooter, with proven success in achieving the highest standards of excellence while ensuring a safe and injury-free workplace. Summary Extensive experience in high–volume manufacturing environments including Retronix Semiconductor, Intel Corp. and Harman International Industries. Skilled in areas to include Preventive and Corrective Maintenance, Equipment Installation/Setup and tool performance issues. Solution’s focused, self-motivated, creative troubleshooter, with proven success in achieving the highest standards of excellence while ensuring a safe and injury-free workplace. Extensive experience in high–volume manufacturing environments including Retronix Semiconductor, Intel Corp. and Harman International Industries. Skilled in areas to include Preventive and Corrective Maintenance, Equipment Installation/Setup and tool performance issues. Solution’s focused, self-motivated, creative troubleshooter, with proven success in achieving the highest standards of excellence while ensuring a safe and injury-free workplace. Extensive experience in high–volume manufacturing environments including Retronix Semiconductor, Intel Corp. and Harman International Industries. Skilled in areas to include Preventive and Corrective Maintenance, Equipment Installation/Setup and tool performance issues. Solution’s focused, self-motivated, creative troubleshooter, with proven success in achieving the highest standards of excellence while ensuring a safe and injury-free workplace. Experience Field Service Engineer Retronix Semiconductor January 2015  – Present (8 months) Austin, Texas / Grenoble, France Field service engineer supporting state-of-the-art cleanroom tools and refurbishing semiconductor manufacturing equipment.  \nDuties Include: \n•\tEffectively read blue prints or schematics or operational procedures/manuals \n•\tInventory all components, subassemblies and equipment.  \n•\tIntegration of all sub components including electrical wiring harnesses, chambers, plumbing, liquid & gas piping, HVAC and control valves. \n•\tInstallation of subassemblies on mainframe equipment. \n•\tFacilitation of completed tool Tier 0, 1 \n• Sustaining Equipment, troubleshooting electro-mechanical components. \n•\tStrictly follow safety standards at all times. Manufacturing Equipment Technician Intel Corporation November 2009  –  January 2014  (4 years 3 months) Intel Corporation, Rio Rancho, NM Thin Films CVD-Novellus/LAM Vector 300mm L1 ops, L2/3 equipment, PM Team Leader, SMBWA Auditor. \n \nLean performance of Scheduled/Unscheduled PM’s, repairs, equipment upgrades, setup, calibration and manufacturing operation activities for BEOL/FEOL CVD EHM, Nitride, Oxide, and Carbide CEID tools implementing controlled and tracked HPM activities on 61 tools. Tasks included Wet cleans, upgrades, component trouble shooting and replacement, annual PM’s, IR scans and calibrations. \n \n•\tCollaborated with process engineering in the development of written micro-schedules to facilitate the execution of complex game plans green to green for upcoming PMs. Worked in a team environment participating as POC (Point Of Contact) for the PM (Preventive Maintenance) Team to improve communication across shifts, supervisor and engineering formal pass downs and maintain structured maintenance activities. \n•\tLed weekly PM performance meetings to follow up on AR’s (Actions Required), implement BKM’s (Best Known Methods), and allow communication across the 168hr team to impose a lean business process that emphasized clear goals, identified Safety and Quality trends and highlighted opportunities to improve PM performance.  \n•\tAs SMBWA (Safety Meeting By Walking Around) auditor, performed daily Safety/ Quality walkthroughs at assigned bays/chases with assigned Managers, to identify and report potential safety/quality issues such as incorrect LOTO, barricades, signage, clutter, and correct issues on the field or submit AR’s (Actions Required) for follow up. Manufacturing Technician Install Intel Corporation May 2007  –  November 2009  (2 years 7 months) Intel Corporation, Rio Rancho, NM Thin Films Endura 5500 Platform and CVD Novellus Vector Installation \nAll aspects of installation such as scoping meetings, field walks, first and second design review meetings, red lining Design packages, Issue For Construction meetings, tool install and calibration, white board meetings with contractor leads and Safety Level Certification.  \n \n•\tAs part of the1266 IQ seed Metals team in Arizona Fab 32, effectively contributed in identifying/capturing changes on MDP caused by Ballroom to Fab/Chase configuration and successfully transition technology to New Mexico, Fab 11X, minimizing the need for RFI’s and reducing overall cost of future installs. \n•\tFab 11X, New Mexico, primarily focused on the design of mockup templates that encompassed measurements of wire way routing locations for precise tool placement. These mockups were universal in that they were capable of being utilized in multiple toolsets (CSB, XDK, CTI) and facilitated contractors in expediting install activities to meet their scheduled dates.  \n•\tPerformed safety and quality audits as a certified ESO (Equipment Sign-Off) auditor/certifier for multiple TF Metals tools including XDK, TAD, SPU and CSB. Attended safety meetings with contractors, and performed daily audits in the fab and sub-fab to promote safety and quality awareness.  \n•\tTransitioned into the P1266/68 Thin Films Dielectrics CVD Install team to help meet aggressive deadlines, and subsequently became (POC) Point of Contact for Demo/Relocation/Conversion/Install activities for CVD Novellus Vector Platform in F11X. Collaborated in scoping meetings and design reviews to red line potential issues and modify packages prior to (IFC) Issue For Construction dates. Created and maintained Install and Demo books for each tool, performed daily field walks to address potential issues with contractors and minimize delays, verified all documentation from trades and performed final Safety Level I and II tool walkthrough Certifications. Manufacturing Equipment Technician Intel Corporation August 2000  –  May 2007  (6 years 10 months) Intel Corporation, Rio Rancho, NM Thin Films CVD- L1 ops, L2 Equipment, L3/3A Equipment, Peer trainer 200mm AMAT5000 platform \n \nThin Films Dielectrics CVD manufacturing operations for multiple CEID’s like STI, AMP, APE, PARC, AMS toolsets. Analyzed SPC Data, adjusted recipe parameters and utilized metrology equipment to qualify tools to production state. Performed Preventive and Corrective Maintenance on CVD tools and facilities equipment, troubleshooting, wafer recovery, component replacement and calibrations. Actively participated in tool hard downs, peer training and engineering projects such as recipe testing, finger prints, tool audits, and facilities upgrades.  \n \n•\tAs Spares Coordinator for the 168hr team, managed (NRR) Non- Return Reports by tracking outstanding returns for follow up through WIINGS and coached peers on utilizing harvest and repairable items when possible, reducing waste and overall cost of PMs.  \n•\tAs Posum owner, routinely inventoried and ordered consumable inventory based on minimum quantity levels to prevent overstock and ensure parts were readily available. \n•\tAs a certified peer trainer, successfully cross trained operators in both CVD and HDP teams to improve their operations and maintenance skills and increase area adaptability.  \n•\tAs equipment coordinator, effectively communicated tool downtime, coordinated upcoming PM’s and FIT work, assigned personnel to perform tool priorities and recoveries while addressing unscheduled repairs and special engineering requests. Manufacturing Technician Harman International Industries Ltd May 1995  –  September 1998  (3 years 5 months) 1995-1998 SMT Operator, Equipment Technician, Harman International Industries Ltd.  \nFabrication of audio equipment such as Harman/ Kardon, Infinity, JBL and AKG. \n \nOperation and preventive maintenance of Surface Mount Technology TDK machinery used for installation of surface mount resistors, diodes, capacitors, transistors and integrated circuits on printed circuit boards. \n \n•\tPerformed full axis lubrications, dual head calibrations and nozzle replacements as part of preventive and corrective maintenance. Executed reel and recipe changes as well as speed adjustments and X/Y coordinate calibrations based on new product Rev’s and QA feedback to enhance product quality and maximize productivity. Field Service Engineer Retronix Semiconductor January 2015  – Present (8 months) Austin, Texas / Grenoble, France Field service engineer supporting state-of-the-art cleanroom tools and refurbishing semiconductor manufacturing equipment.  \nDuties Include: \n•\tEffectively read blue prints or schematics or operational procedures/manuals \n•\tInventory all components, subassemblies and equipment.  \n•\tIntegration of all sub components including electrical wiring harnesses, chambers, plumbing, liquid & gas piping, HVAC and control valves. \n•\tInstallation of subassemblies on mainframe equipment. \n•\tFacilitation of completed tool Tier 0, 1 \n• Sustaining Equipment, troubleshooting electro-mechanical components. \n•\tStrictly follow safety standards at all times. Field Service Engineer Retronix Semiconductor January 2015  – Present (8 months) Austin, Texas / Grenoble, France Field service engineer supporting state-of-the-art cleanroom tools and refurbishing semiconductor manufacturing equipment.  \nDuties Include: \n•\tEffectively read blue prints or schematics or operational procedures/manuals \n•\tInventory all components, subassemblies and equipment.  \n•\tIntegration of all sub components including electrical wiring harnesses, chambers, plumbing, liquid & gas piping, HVAC and control valves. \n•\tInstallation of subassemblies on mainframe equipment. \n•\tFacilitation of completed tool Tier 0, 1 \n• Sustaining Equipment, troubleshooting electro-mechanical components. \n•\tStrictly follow safety standards at all times. Manufacturing Equipment Technician Intel Corporation November 2009  –  January 2014  (4 years 3 months) Intel Corporation, Rio Rancho, NM Thin Films CVD-Novellus/LAM Vector 300mm L1 ops, L2/3 equipment, PM Team Leader, SMBWA Auditor. \n \nLean performance of Scheduled/Unscheduled PM’s, repairs, equipment upgrades, setup, calibration and manufacturing operation activities for BEOL/FEOL CVD EHM, Nitride, Oxide, and Carbide CEID tools implementing controlled and tracked HPM activities on 61 tools. Tasks included Wet cleans, upgrades, component trouble shooting and replacement, annual PM’s, IR scans and calibrations. \n \n•\tCollaborated with process engineering in the development of written micro-schedules to facilitate the execution of complex game plans green to green for upcoming PMs. Worked in a team environment participating as POC (Point Of Contact) for the PM (Preventive Maintenance) Team to improve communication across shifts, supervisor and engineering formal pass downs and maintain structured maintenance activities. \n•\tLed weekly PM performance meetings to follow up on AR’s (Actions Required), implement BKM’s (Best Known Methods), and allow communication across the 168hr team to impose a lean business process that emphasized clear goals, identified Safety and Quality trends and highlighted opportunities to improve PM performance.  \n•\tAs SMBWA (Safety Meeting By Walking Around) auditor, performed daily Safety/ Quality walkthroughs at assigned bays/chases with assigned Managers, to identify and report potential safety/quality issues such as incorrect LOTO, barricades, signage, clutter, and correct issues on the field or submit AR’s (Actions Required) for follow up. Manufacturing Equipment Technician Intel Corporation November 2009  –  January 2014  (4 years 3 months) Intel Corporation, Rio Rancho, NM Thin Films CVD-Novellus/LAM Vector 300mm L1 ops, L2/3 equipment, PM Team Leader, SMBWA Auditor. \n \nLean performance of Scheduled/Unscheduled PM’s, repairs, equipment upgrades, setup, calibration and manufacturing operation activities for BEOL/FEOL CVD EHM, Nitride, Oxide, and Carbide CEID tools implementing controlled and tracked HPM activities on 61 tools. Tasks included Wet cleans, upgrades, component trouble shooting and replacement, annual PM’s, IR scans and calibrations. \n \n•\tCollaborated with process engineering in the development of written micro-schedules to facilitate the execution of complex game plans green to green for upcoming PMs. Worked in a team environment participating as POC (Point Of Contact) for the PM (Preventive Maintenance) Team to improve communication across shifts, supervisor and engineering formal pass downs and maintain structured maintenance activities. \n•\tLed weekly PM performance meetings to follow up on AR’s (Actions Required), implement BKM’s (Best Known Methods), and allow communication across the 168hr team to impose a lean business process that emphasized clear goals, identified Safety and Quality trends and highlighted opportunities to improve PM performance.  \n•\tAs SMBWA (Safety Meeting By Walking Around) auditor, performed daily Safety/ Quality walkthroughs at assigned bays/chases with assigned Managers, to identify and report potential safety/quality issues such as incorrect LOTO, barricades, signage, clutter, and correct issues on the field or submit AR’s (Actions Required) for follow up. Manufacturing Technician Install Intel Corporation May 2007  –  November 2009  (2 years 7 months) Intel Corporation, Rio Rancho, NM Thin Films Endura 5500 Platform and CVD Novellus Vector Installation \nAll aspects of installation such as scoping meetings, field walks, first and second design review meetings, red lining Design packages, Issue For Construction meetings, tool install and calibration, white board meetings with contractor leads and Safety Level Certification.  \n \n•\tAs part of the1266 IQ seed Metals team in Arizona Fab 32, effectively contributed in identifying/capturing changes on MDP caused by Ballroom to Fab/Chase configuration and successfully transition technology to New Mexico, Fab 11X, minimizing the need for RFI’s and reducing overall cost of future installs. \n•\tFab 11X, New Mexico, primarily focused on the design of mockup templates that encompassed measurements of wire way routing locations for precise tool placement. These mockups were universal in that they were capable of being utilized in multiple toolsets (CSB, XDK, CTI) and facilitated contractors in expediting install activities to meet their scheduled dates.  \n•\tPerformed safety and quality audits as a certified ESO (Equipment Sign-Off) auditor/certifier for multiple TF Metals tools including XDK, TAD, SPU and CSB. Attended safety meetings with contractors, and performed daily audits in the fab and sub-fab to promote safety and quality awareness.  \n•\tTransitioned into the P1266/68 Thin Films Dielectrics CVD Install team to help meet aggressive deadlines, and subsequently became (POC) Point of Contact for Demo/Relocation/Conversion/Install activities for CVD Novellus Vector Platform in F11X. Collaborated in scoping meetings and design reviews to red line potential issues and modify packages prior to (IFC) Issue For Construction dates. Created and maintained Install and Demo books for each tool, performed daily field walks to address potential issues with contractors and minimize delays, verified all documentation from trades and performed final Safety Level I and II tool walkthrough Certifications. Manufacturing Technician Install Intel Corporation May 2007  –  November 2009  (2 years 7 months) Intel Corporation, Rio Rancho, NM Thin Films Endura 5500 Platform and CVD Novellus Vector Installation \nAll aspects of installation such as scoping meetings, field walks, first and second design review meetings, red lining Design packages, Issue For Construction meetings, tool install and calibration, white board meetings with contractor leads and Safety Level Certification.  \n \n•\tAs part of the1266 IQ seed Metals team in Arizona Fab 32, effectively contributed in identifying/capturing changes on MDP caused by Ballroom to Fab/Chase configuration and successfully transition technology to New Mexico, Fab 11X, minimizing the need for RFI’s and reducing overall cost of future installs. \n•\tFab 11X, New Mexico, primarily focused on the design of mockup templates that encompassed measurements of wire way routing locations for precise tool placement. These mockups were universal in that they were capable of being utilized in multiple toolsets (CSB, XDK, CTI) and facilitated contractors in expediting install activities to meet their scheduled dates.  \n•\tPerformed safety and quality audits as a certified ESO (Equipment Sign-Off) auditor/certifier for multiple TF Metals tools including XDK, TAD, SPU and CSB. Attended safety meetings with contractors, and performed daily audits in the fab and sub-fab to promote safety and quality awareness.  \n•\tTransitioned into the P1266/68 Thin Films Dielectrics CVD Install team to help meet aggressive deadlines, and subsequently became (POC) Point of Contact for Demo/Relocation/Conversion/Install activities for CVD Novellus Vector Platform in F11X. Collaborated in scoping meetings and design reviews to red line potential issues and modify packages prior to (IFC) Issue For Construction dates. Created and maintained Install and Demo books for each tool, performed daily field walks to address potential issues with contractors and minimize delays, verified all documentation from trades and performed final Safety Level I and II tool walkthrough Certifications. Manufacturing Equipment Technician Intel Corporation August 2000  –  May 2007  (6 years 10 months) Intel Corporation, Rio Rancho, NM Thin Films CVD- L1 ops, L2 Equipment, L3/3A Equipment, Peer trainer 200mm AMAT5000 platform \n \nThin Films Dielectrics CVD manufacturing operations for multiple CEID’s like STI, AMP, APE, PARC, AMS toolsets. Analyzed SPC Data, adjusted recipe parameters and utilized metrology equipment to qualify tools to production state. Performed Preventive and Corrective Maintenance on CVD tools and facilities equipment, troubleshooting, wafer recovery, component replacement and calibrations. Actively participated in tool hard downs, peer training and engineering projects such as recipe testing, finger prints, tool audits, and facilities upgrades.  \n \n•\tAs Spares Coordinator for the 168hr team, managed (NRR) Non- Return Reports by tracking outstanding returns for follow up through WIINGS and coached peers on utilizing harvest and repairable items when possible, reducing waste and overall cost of PMs.  \n•\tAs Posum owner, routinely inventoried and ordered consumable inventory based on minimum quantity levels to prevent overstock and ensure parts were readily available. \n•\tAs a certified peer trainer, successfully cross trained operators in both CVD and HDP teams to improve their operations and maintenance skills and increase area adaptability.  \n•\tAs equipment coordinator, effectively communicated tool downtime, coordinated upcoming PM’s and FIT work, assigned personnel to perform tool priorities and recoveries while addressing unscheduled repairs and special engineering requests. Manufacturing Equipment Technician Intel Corporation August 2000  –  May 2007  (6 years 10 months) Intel Corporation, Rio Rancho, NM Thin Films CVD- L1 ops, L2 Equipment, L3/3A Equipment, Peer trainer 200mm AMAT5000 platform \n \nThin Films Dielectrics CVD manufacturing operations for multiple CEID’s like STI, AMP, APE, PARC, AMS toolsets. Analyzed SPC Data, adjusted recipe parameters and utilized metrology equipment to qualify tools to production state. Performed Preventive and Corrective Maintenance on CVD tools and facilities equipment, troubleshooting, wafer recovery, component replacement and calibrations. Actively participated in tool hard downs, peer training and engineering projects such as recipe testing, finger prints, tool audits, and facilities upgrades.  \n \n•\tAs Spares Coordinator for the 168hr team, managed (NRR) Non- Return Reports by tracking outstanding returns for follow up through WIINGS and coached peers on utilizing harvest and repairable items when possible, reducing waste and overall cost of PMs.  \n•\tAs Posum owner, routinely inventoried and ordered consumable inventory based on minimum quantity levels to prevent overstock and ensure parts were readily available. \n•\tAs a certified peer trainer, successfully cross trained operators in both CVD and HDP teams to improve their operations and maintenance skills and increase area adaptability.  \n•\tAs equipment coordinator, effectively communicated tool downtime, coordinated upcoming PM’s and FIT work, assigned personnel to perform tool priorities and recoveries while addressing unscheduled repairs and special engineering requests. Manufacturing Technician Harman International Industries Ltd May 1995  –  September 1998  (3 years 5 months) 1995-1998 SMT Operator, Equipment Technician, Harman International Industries Ltd.  \nFabrication of audio equipment such as Harman/ Kardon, Infinity, JBL and AKG. \n \nOperation and preventive maintenance of Surface Mount Technology TDK machinery used for installation of surface mount resistors, diodes, capacitors, transistors and integrated circuits on printed circuit boards. \n \n•\tPerformed full axis lubrications, dual head calibrations and nozzle replacements as part of preventive and corrective maintenance. Executed reel and recipe changes as well as speed adjustments and X/Y coordinate calibrations based on new product Rev’s and QA feedback to enhance product quality and maximize productivity. Manufacturing Technician Harman International Industries Ltd May 1995  –  September 1998  (3 years 5 months) 1995-1998 SMT Operator, Equipment Technician, Harman International Industries Ltd.  \nFabrication of audio equipment such as Harman/ Kardon, Infinity, JBL and AKG. \n \nOperation and preventive maintenance of Surface Mount Technology TDK machinery used for installation of surface mount resistors, diodes, capacitors, transistors and integrated circuits on printed circuit boards. \n \n•\tPerformed full axis lubrications, dual head calibrations and nozzle replacements as part of preventive and corrective maintenance. Executed reel and recipe changes as well as speed adjustments and X/Y coordinate calibrations based on new product Rev’s and QA feedback to enhance product quality and maximize productivity. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills CVD SPC Preventive Maintenance Semiconductor Industry Lean Manufacturing Troubleshooting Thin Films IC Equipment Maintenance Manufacturing Equipment Installation Equipment Setup Metrology Failure Analysis Semiconductors Calibration Testing See 2+     See less Skills  CVD SPC Preventive Maintenance Semiconductor Industry Lean Manufacturing Troubleshooting Thin Films IC Equipment Maintenance Manufacturing Equipment Installation Equipment Setup Metrology Failure Analysis Semiconductors Calibration Testing See 2+     See less CVD SPC Preventive Maintenance Semiconductor Industry Lean Manufacturing Troubleshooting Thin Films IC Equipment Maintenance Manufacturing Equipment Installation Equipment Setup Metrology Failure Analysis Semiconductors Calibration Testing See 2+     See less CVD SPC Preventive Maintenance Semiconductor Industry Lean Manufacturing Troubleshooting Thin Films IC Equipment Maintenance Manufacturing Equipment Installation Equipment Setup Metrology Failure Analysis Semiconductors Calibration Testing See 2+     See less Education Western Technical College Associate of Ocupational Studies Degree,  Micro Computer Technology 1998  – 2000 Western Technical College Associate of Ocupational Studies Degree,  Micro Computer Technology 1998  – 2000 Western Technical College Associate of Ocupational Studies Degree,  Micro Computer Technology 1998  – 2000 Western Technical College Associate of Ocupational Studies Degree,  Micro Computer Technology 1998  – 2000 Honors & Awards ", "Experience Manufacturing Equipment Technician Intel Corporation April 1997  – Present (18 years 5 months) Avionics Technician Lockheed Martin February 1995  –  April 1997  (2 years 3 months) •\tTraces schematic, logic, and wiring diagrams, and uses appropriate built-in-tests; applicable electronic measuring equipment such as oscilloscopes, digital and analog voltmeters, signal generators, and power meters; recording and reproducing equipment; applicable support equipment, including automated programmed/manual testers; and general purpose and special hand tools. Determines scope of repair or adjustment required to correct faulty operation. Monitors equipment performance to detect recurring malfunctions. Avionics Technician DynCorp International February 1992  –  February 1995  (3 years 1 month) •\tTraces schematic, logic, and wiring diagrams, and uses appropriate built-in-tests; applicable electronic measuring equipment such as oscilloscopes, digital and analog voltmeters, signal generators, and power meters; recording and reproducing equipment; applicable support equipment, including automated programmed/manual testers; and general purpose and special hand tools. Determines scope of repair or adjustment required to correct faulty operation. Monitors equipment performance to detect recurring malfunctions. Weapon Control Systems Technician United States Air Force May 1987  –  May 1991  (4 years 1 month) George Air Force Base, California Weapon Control Systems Technician: Inspects, installs, maintains, troubleshoots, overhauls, repairs, and modifies weapon control systems and associated equipment; and supervises weapon control systems activities on the F4-E aircraft. Manufacturing Equipment Technician Intel Corporation April 1997  – Present (18 years 5 months) Manufacturing Equipment Technician Intel Corporation April 1997  – Present (18 years 5 months) Avionics Technician Lockheed Martin February 1995  –  April 1997  (2 years 3 months) •\tTraces schematic, logic, and wiring diagrams, and uses appropriate built-in-tests; applicable electronic measuring equipment such as oscilloscopes, digital and analog voltmeters, signal generators, and power meters; recording and reproducing equipment; applicable support equipment, including automated programmed/manual testers; and general purpose and special hand tools. Determines scope of repair or adjustment required to correct faulty operation. Monitors equipment performance to detect recurring malfunctions. Avionics Technician Lockheed Martin February 1995  –  April 1997  (2 years 3 months) •\tTraces schematic, logic, and wiring diagrams, and uses appropriate built-in-tests; applicable electronic measuring equipment such as oscilloscopes, digital and analog voltmeters, signal generators, and power meters; recording and reproducing equipment; applicable support equipment, including automated programmed/manual testers; and general purpose and special hand tools. Determines scope of repair or adjustment required to correct faulty operation. Monitors equipment performance to detect recurring malfunctions. Avionics Technician DynCorp International February 1992  –  February 1995  (3 years 1 month) •\tTraces schematic, logic, and wiring diagrams, and uses appropriate built-in-tests; applicable electronic measuring equipment such as oscilloscopes, digital and analog voltmeters, signal generators, and power meters; recording and reproducing equipment; applicable support equipment, including automated programmed/manual testers; and general purpose and special hand tools. Determines scope of repair or adjustment required to correct faulty operation. Monitors equipment performance to detect recurring malfunctions. Avionics Technician DynCorp International February 1992  –  February 1995  (3 years 1 month) •\tTraces schematic, logic, and wiring diagrams, and uses appropriate built-in-tests; applicable electronic measuring equipment such as oscilloscopes, digital and analog voltmeters, signal generators, and power meters; recording and reproducing equipment; applicable support equipment, including automated programmed/manual testers; and general purpose and special hand tools. Determines scope of repair or adjustment required to correct faulty operation. Monitors equipment performance to detect recurring malfunctions. Weapon Control Systems Technician United States Air Force May 1987  –  May 1991  (4 years 1 month) George Air Force Base, California Weapon Control Systems Technician: Inspects, installs, maintains, troubleshoots, overhauls, repairs, and modifies weapon control systems and associated equipment; and supervises weapon control systems activities on the F4-E aircraft. Weapon Control Systems Technician United States Air Force May 1987  –  May 1991  (4 years 1 month) George Air Force Base, California Weapon Control Systems Technician: Inspects, installs, maintains, troubleshoots, overhauls, repairs, and modifies weapon control systems and associated equipment; and supervises weapon control systems activities on the F4-E aircraft. Skills Microsoft Office Microsoft Excel Microsoft Word PowerPoint English Outlook Electronics Hydraulics Pneumatics Robotics Diffusion Wet Chemical Etching Electrical Engineering Manufacturing Skills  Microsoft Office Microsoft Excel Microsoft Word PowerPoint English Outlook Electronics Hydraulics Pneumatics Robotics Diffusion Wet Chemical Etching Electrical Engineering Manufacturing Microsoft Office Microsoft Excel Microsoft Word PowerPoint English Outlook Electronics Hydraulics Pneumatics Robotics Diffusion Wet Chemical Etching Electrical Engineering Manufacturing Microsoft Office Microsoft Excel Microsoft Word PowerPoint English Outlook Electronics Hydraulics Pneumatics Robotics Diffusion Wet Chemical Etching Electrical Engineering Manufacturing Education USAF Technical school; Lowry AFB, CO None,  Electrical and Electronics Engineering 1987  – 1988 Studied and gained knowledge of theory and application of electronic, microelectronic, and mechanical principles, theory and application of gyros, synchros, and ratio transformers, theory of ballistics; working principles of electro-optical devices and sensors; functional values of multiple dimensional cam; factors involved in radar and infrared search and target detection and identification; digital computer logic; use, care, and interpretation of testing and measuring devices. New Mexico State University-Alamogordo none,  Geography USAF Technical school; Lowry AFB, CO None,  Electrical and Electronics Engineering 1987  – 1988 Studied and gained knowledge of theory and application of electronic, microelectronic, and mechanical principles, theory and application of gyros, synchros, and ratio transformers, theory of ballistics; working principles of electro-optical devices and sensors; functional values of multiple dimensional cam; factors involved in radar and infrared search and target detection and identification; digital computer logic; use, care, and interpretation of testing and measuring devices. USAF Technical school; Lowry AFB, CO None,  Electrical and Electronics Engineering 1987  – 1988 Studied and gained knowledge of theory and application of electronic, microelectronic, and mechanical principles, theory and application of gyros, synchros, and ratio transformers, theory of ballistics; working principles of electro-optical devices and sensors; functional values of multiple dimensional cam; factors involved in radar and infrared search and target detection and identification; digital computer logic; use, care, and interpretation of testing and measuring devices. USAF Technical school; Lowry AFB, CO None,  Electrical and Electronics Engineering 1987  – 1988 Studied and gained knowledge of theory and application of electronic, microelectronic, and mechanical principles, theory and application of gyros, synchros, and ratio transformers, theory of ballistics; working principles of electro-optical devices and sensors; functional values of multiple dimensional cam; factors involved in radar and infrared search and target detection and identification; digital computer logic; use, care, and interpretation of testing and measuring devices. New Mexico State University-Alamogordo none,  Geography New Mexico State University-Alamogordo none,  Geography New Mexico State University-Alamogordo none,  Geography ", "Summary Professionally a manufacturing and semiconductor equipment technician with combined technical, business, and management related education and experience. Predominantly focused on developing emerging computing technologies from development phase of SPC matching through high volume sustainable manufacturing. \n \nPersonally a family man with a vibrant family and a wide variety of personal interests such as football, the outdoors, golf and home improvement. \n \nSpecialties: HVM, HPM maintenance, equipment troubleshooting and repair, lean manufacturing, cost management, team development Summary Professionally a manufacturing and semiconductor equipment technician with combined technical, business, and management related education and experience. Predominantly focused on developing emerging computing technologies from development phase of SPC matching through high volume sustainable manufacturing. \n \nPersonally a family man with a vibrant family and a wide variety of personal interests such as football, the outdoors, golf and home improvement. \n \nSpecialties: HVM, HPM maintenance, equipment troubleshooting and repair, lean manufacturing, cost management, team development Professionally a manufacturing and semiconductor equipment technician with combined technical, business, and management related education and experience. Predominantly focused on developing emerging computing technologies from development phase of SPC matching through high volume sustainable manufacturing. \n \nPersonally a family man with a vibrant family and a wide variety of personal interests such as football, the outdoors, golf and home improvement. \n \nSpecialties: HVM, HPM maintenance, equipment troubleshooting and repair, lean manufacturing, cost management, team development Professionally a manufacturing and semiconductor equipment technician with combined technical, business, and management related education and experience. Predominantly focused on developing emerging computing technologies from development phase of SPC matching through high volume sustainable manufacturing. \n \nPersonally a family man with a vibrant family and a wide variety of personal interests such as football, the outdoors, golf and home improvement. \n \nSpecialties: HVM, HPM maintenance, equipment troubleshooting and repair, lean manufacturing, cost management, team development Experience Manufacturing/Equipment Technician Intel Corporation March 1997  – Present (18 years 6 months) Intel is a global leader in technological innovation, primarily in the area of semiconductor manufacturing. I work for the FSM group in Arizona. My current role focuses on High Precision Maintenance, troubleshooting, and repair of ASM equipment. Manufacturing operations involve multiple process types and require sustaining and improvement. Past roles have included training personnel on various equipment including management and engineering staff. Electronic Technician/Product coordinator Custom Electronics co. May 1996  –  December 1996  (8 months) A small independent manufacturer of power supplies to various customers in the Southwest. My role was to test, qualify, and repair our products prior to shipping to the customer. In addition, I coordinated material needs with our buyer and personnel issues with the owner. Manufacturing/Equipment Technician Intel Corporation March 1997  – Present (18 years 6 months) Intel is a global leader in technological innovation, primarily in the area of semiconductor manufacturing. I work for the FSM group in Arizona. My current role focuses on High Precision Maintenance, troubleshooting, and repair of ASM equipment. Manufacturing operations involve multiple process types and require sustaining and improvement. Past roles have included training personnel on various equipment including management and engineering staff. Manufacturing/Equipment Technician Intel Corporation March 1997  – Present (18 years 6 months) Intel is a global leader in technological innovation, primarily in the area of semiconductor manufacturing. I work for the FSM group in Arizona. My current role focuses on High Precision Maintenance, troubleshooting, and repair of ASM equipment. Manufacturing operations involve multiple process types and require sustaining and improvement. Past roles have included training personnel on various equipment including management and engineering staff. Electronic Technician/Product coordinator Custom Electronics co. May 1996  –  December 1996  (8 months) A small independent manufacturer of power supplies to various customers in the Southwest. My role was to test, qualify, and repair our products prior to shipping to the customer. In addition, I coordinated material needs with our buyer and personnel issues with the owner. Electronic Technician/Product coordinator Custom Electronics co. May 1996  –  December 1996  (8 months) A small independent manufacturer of power supplies to various customers in the Southwest. My role was to test, qualify, and repair our products prior to shipping to the customer. In addition, I coordinated material needs with our buyer and personnel issues with the owner. Skills Lean Manufacturing SPC Electronics Manufacturing Troubleshooting Intel Testing Process Control Semiconductors Pneumatics Continuous Improvement Semiconductor... Semiconductor Industry Kaizen Preventive Maintenance Process Improvement Equipment Maintenance Problem Solving Process Development Automation RF Metrology Design of Experiments PVD Bad Debt Personal Finance Saxophone Automotive Repair Cross-functional Team... JMP Test Equipment Root Cause Analysis Equipment Installation Process Simulation See 19+     See less Skills  Lean Manufacturing SPC Electronics Manufacturing Troubleshooting Intel Testing Process Control Semiconductors Pneumatics Continuous Improvement Semiconductor... Semiconductor Industry Kaizen Preventive Maintenance Process Improvement Equipment Maintenance Problem Solving Process Development Automation RF Metrology Design of Experiments PVD Bad Debt Personal Finance Saxophone Automotive Repair Cross-functional Team... JMP Test Equipment Root Cause Analysis Equipment Installation Process Simulation See 19+     See less Lean Manufacturing SPC Electronics Manufacturing Troubleshooting Intel Testing Process Control Semiconductors Pneumatics Continuous Improvement Semiconductor... Semiconductor Industry Kaizen Preventive Maintenance Process Improvement Equipment Maintenance Problem Solving Process Development Automation RF Metrology Design of Experiments PVD Bad Debt Personal Finance Saxophone Automotive Repair Cross-functional Team... JMP Test Equipment Root Cause Analysis Equipment Installation Process Simulation See 19+     See less Lean Manufacturing SPC Electronics Manufacturing Troubleshooting Intel Testing Process Control Semiconductors Pneumatics Continuous Improvement Semiconductor... Semiconductor Industry Kaizen Preventive Maintenance Process Improvement Equipment Maintenance Problem Solving Process Development Automation RF Metrology Design of Experiments PVD Bad Debt Personal Finance Saxophone Automotive Repair Cross-functional Team... JMP Test Equipment Root Cause Analysis Equipment Installation Process Simulation See 19+     See less Education University of Phoenix Bachelor of Science,  Business and Information Systems , 3.8GPA 2002  – 2006 Business and Information systems which included several management courses, business systems development, database management, supply chain management, high level C+ programming, project planning and development and e-business. Mesa Community College Associate of Science,  Electronic Technology 1998  – 2002 Studied the elements of electronic technology including semiconductors, basic processor programming, manufacturing processes from several industries. Also brushed up on humanities courses as required. DeVry Institute of Technology Electronic Engineering Technology,  Electronic theory , mathematics,  english 1994  – 1995 AC/DC circuitry, digital electronics, transistors, college algebra, trigonometry, calculus as well as various lab courses to complement my electronic studies. University of Phoenix Bachelor of Science,  Business and Information Systems , 3.8GPA 2002  – 2006 Business and Information systems which included several management courses, business systems development, database management, supply chain management, high level C+ programming, project planning and development and e-business. University of Phoenix Bachelor of Science,  Business and Information Systems , 3.8GPA 2002  – 2006 Business and Information systems which included several management courses, business systems development, database management, supply chain management, high level C+ programming, project planning and development and e-business. University of Phoenix Bachelor of Science,  Business and Information Systems , 3.8GPA 2002  – 2006 Business and Information systems which included several management courses, business systems development, database management, supply chain management, high level C+ programming, project planning and development and e-business. Mesa Community College Associate of Science,  Electronic Technology 1998  – 2002 Studied the elements of electronic technology including semiconductors, basic processor programming, manufacturing processes from several industries. Also brushed up on humanities courses as required. Mesa Community College Associate of Science,  Electronic Technology 1998  – 2002 Studied the elements of electronic technology including semiconductors, basic processor programming, manufacturing processes from several industries. Also brushed up on humanities courses as required. Mesa Community College Associate of Science,  Electronic Technology 1998  – 2002 Studied the elements of electronic technology including semiconductors, basic processor programming, manufacturing processes from several industries. Also brushed up on humanities courses as required. DeVry Institute of Technology Electronic Engineering Technology,  Electronic theory , mathematics,  english 1994  – 1995 AC/DC circuitry, digital electronics, transistors, college algebra, trigonometry, calculus as well as various lab courses to complement my electronic studies. DeVry Institute of Technology Electronic Engineering Technology,  Electronic theory , mathematics,  english 1994  – 1995 AC/DC circuitry, digital electronics, transistors, college algebra, trigonometry, calculus as well as various lab courses to complement my electronic studies. DeVry Institute of Technology Electronic Engineering Technology,  Electronic theory , mathematics,  english 1994  – 1995 AC/DC circuitry, digital electronics, transistors, college algebra, trigonometry, calculus as well as various lab courses to complement my electronic studies. ", "Summary I am passionate about making things better and more efficient, while documenting tasks and procedures thoroughly and providing detailed training along the way. I have an aptitude for troubleshooting and repairing equipment, finding and implementing improvements and providing effective cost savings solutions and improvements. Summary I am passionate about making things better and more efficient, while documenting tasks and procedures thoroughly and providing detailed training along the way. I have an aptitude for troubleshooting and repairing equipment, finding and implementing improvements and providing effective cost savings solutions and improvements. I am passionate about making things better and more efficient, while documenting tasks and procedures thoroughly and providing detailed training along the way. I have an aptitude for troubleshooting and repairing equipment, finding and implementing improvements and providing effective cost savings solutions and improvements. I am passionate about making things better and more efficient, while documenting tasks and procedures thoroughly and providing detailed training along the way. I have an aptitude for troubleshooting and repairing equipment, finding and implementing improvements and providing effective cost savings solutions and improvements. Experience Manufacturing Equipment Technician Intel Corporation March 2013  – Present (2 years 6 months) Chandler, Arizona Lithography Metrology Senior Equipment Technician, 300mm Wafer Fabrication-P1270/71/72, 22/14nm March, 2013 - Present \n•\tSenior Equipment Technician responsible for performing operations and preventative maintenance procedures, day to day sustaining activities and production/equipment monitoring on 5 different toolsets while accurately adhering to all specifications within a high volume production “class 10” cleanroom environment. \n•\tResponsible for training and certifying peers on procedures against sets of training packages. 13 years of experience training and certifying technicians, tool owners, engineers, x-pats, and managers. \n•\tActively creates and updates specifications, PM checklists, troubleshooting RFCs (response flow checklists), BKMs (Best Known Methods), and other related documentation. \n•\tResponse to tool or lot processing issues that include recovery and repair, creating/update recipes, and special processing requests. \n•\tRoutinely submits improvement ideas using Lean Manufacturing principles. \n•\tCollects accurate data for whitepapers and tool certification qualification, documents issues with obtaining proper data, i.e. tool, wafer or recipe problems. Engineering Technician Intel Corporation April 2006  –  March 2013  (7 years) Chandler, Arizona •\tResponsible for the health of all Lithography Metrology toolsets and owner of day to day sustaining activities in the area.  \n•\tActed as equipment tool owner/engineer and liaison between engineering and manufacturing bridging day and night shifts. Provided extensive tool owner coverage for 4 different tool sets across 2 different shifts to ensure tools stayed up at full capacity 24/7. \n•\tResponsible for process flow and tool issues, training/certifying technicians, recipe management, tool maintenance (preventative and corrective), and tool troubleshooting.  \n•\tOwned scheduling and completion of all tool PMs. Coordinated with cross-shift module team members to plan PMs to meet green to green time while also training technicians how to perform PMs, including vendor PMs. \n•\tFrequently collaborated with many different groups including vendors, buyers, cross-shift engineering & technicians, management, automation, and virtual factory (worldwide) to assess and address tool and process issues. \n•\tFamiliarity with all high volume manufacturing related tasks (process and equipment) as well as tool ownership & FSE level knowledge of L-Metro tools. \n•\tOwned and actively created and updated operations, preventative and corrective maintenance specification procedures, Response Flow Checklists (RFCs), and PM checklists that were used worldwide.  \n•\tProvided excursion response and whitepaper implementation.  \n•\tJob Hazard Analysis leader responsible for assessing and correcting any safety hazards while performing work on equipment. Exemplary results were reported to factory manager and JHA process was modified based on this project. \n•\tOwned and implemented extensive cost savings projects and tasks for all Lithography Metrology Toolsets Manufacturing Technician - Process (MTP) Intel Corporation February 2001  –  April 2006  (5 years 3 months) Chandler, Arizona •\tLead MT, area coordinator, spec content expert, primary peer trainer for 2 different modules within R & D Technical Development facility. \n•\tSetup tools and processed production material, monitored the operation, and maintained the process and analytical equipment while maintaining accuracy and adherence to specifications.  \n•\tCompetent in all the requirements of available factory technician grade levels.  \n•\tPrioritized WIP/equipment according to WIP management for multiple tool sets. Identified problems to subassembly level. Assisted with equipment improvements and upgrades. Manufacturing Equipment Technician Intel Corporation March 2013  – Present (2 years 6 months) Chandler, Arizona Lithography Metrology Senior Equipment Technician, 300mm Wafer Fabrication-P1270/71/72, 22/14nm March, 2013 - Present \n•\tSenior Equipment Technician responsible for performing operations and preventative maintenance procedures, day to day sustaining activities and production/equipment monitoring on 5 different toolsets while accurately adhering to all specifications within a high volume production “class 10” cleanroom environment. \n•\tResponsible for training and certifying peers on procedures against sets of training packages. 13 years of experience training and certifying technicians, tool owners, engineers, x-pats, and managers. \n•\tActively creates and updates specifications, PM checklists, troubleshooting RFCs (response flow checklists), BKMs (Best Known Methods), and other related documentation. \n•\tResponse to tool or lot processing issues that include recovery and repair, creating/update recipes, and special processing requests. \n•\tRoutinely submits improvement ideas using Lean Manufacturing principles. \n•\tCollects accurate data for whitepapers and tool certification qualification, documents issues with obtaining proper data, i.e. tool, wafer or recipe problems. Manufacturing Equipment Technician Intel Corporation March 2013  – Present (2 years 6 months) Chandler, Arizona Lithography Metrology Senior Equipment Technician, 300mm Wafer Fabrication-P1270/71/72, 22/14nm March, 2013 - Present \n•\tSenior Equipment Technician responsible for performing operations and preventative maintenance procedures, day to day sustaining activities and production/equipment monitoring on 5 different toolsets while accurately adhering to all specifications within a high volume production “class 10” cleanroom environment. \n•\tResponsible for training and certifying peers on procedures against sets of training packages. 13 years of experience training and certifying technicians, tool owners, engineers, x-pats, and managers. \n•\tActively creates and updates specifications, PM checklists, troubleshooting RFCs (response flow checklists), BKMs (Best Known Methods), and other related documentation. \n•\tResponse to tool or lot processing issues that include recovery and repair, creating/update recipes, and special processing requests. \n•\tRoutinely submits improvement ideas using Lean Manufacturing principles. \n•\tCollects accurate data for whitepapers and tool certification qualification, documents issues with obtaining proper data, i.e. tool, wafer or recipe problems. Engineering Technician Intel Corporation April 2006  –  March 2013  (7 years) Chandler, Arizona •\tResponsible for the health of all Lithography Metrology toolsets and owner of day to day sustaining activities in the area.  \n•\tActed as equipment tool owner/engineer and liaison between engineering and manufacturing bridging day and night shifts. Provided extensive tool owner coverage for 4 different tool sets across 2 different shifts to ensure tools stayed up at full capacity 24/7. \n•\tResponsible for process flow and tool issues, training/certifying technicians, recipe management, tool maintenance (preventative and corrective), and tool troubleshooting.  \n•\tOwned scheduling and completion of all tool PMs. Coordinated with cross-shift module team members to plan PMs to meet green to green time while also training technicians how to perform PMs, including vendor PMs. \n•\tFrequently collaborated with many different groups including vendors, buyers, cross-shift engineering & technicians, management, automation, and virtual factory (worldwide) to assess and address tool and process issues. \n•\tFamiliarity with all high volume manufacturing related tasks (process and equipment) as well as tool ownership & FSE level knowledge of L-Metro tools. \n•\tOwned and actively created and updated operations, preventative and corrective maintenance specification procedures, Response Flow Checklists (RFCs), and PM checklists that were used worldwide.  \n•\tProvided excursion response and whitepaper implementation.  \n•\tJob Hazard Analysis leader responsible for assessing and correcting any safety hazards while performing work on equipment. Exemplary results were reported to factory manager and JHA process was modified based on this project. \n•\tOwned and implemented extensive cost savings projects and tasks for all Lithography Metrology Toolsets Engineering Technician Intel Corporation April 2006  –  March 2013  (7 years) Chandler, Arizona •\tResponsible for the health of all Lithography Metrology toolsets and owner of day to day sustaining activities in the area.  \n•\tActed as equipment tool owner/engineer and liaison between engineering and manufacturing bridging day and night shifts. Provided extensive tool owner coverage for 4 different tool sets across 2 different shifts to ensure tools stayed up at full capacity 24/7. \n•\tResponsible for process flow and tool issues, training/certifying technicians, recipe management, tool maintenance (preventative and corrective), and tool troubleshooting.  \n•\tOwned scheduling and completion of all tool PMs. Coordinated with cross-shift module team members to plan PMs to meet green to green time while also training technicians how to perform PMs, including vendor PMs. \n•\tFrequently collaborated with many different groups including vendors, buyers, cross-shift engineering & technicians, management, automation, and virtual factory (worldwide) to assess and address tool and process issues. \n•\tFamiliarity with all high volume manufacturing related tasks (process and equipment) as well as tool ownership & FSE level knowledge of L-Metro tools. \n•\tOwned and actively created and updated operations, preventative and corrective maintenance specification procedures, Response Flow Checklists (RFCs), and PM checklists that were used worldwide.  \n•\tProvided excursion response and whitepaper implementation.  \n•\tJob Hazard Analysis leader responsible for assessing and correcting any safety hazards while performing work on equipment. Exemplary results were reported to factory manager and JHA process was modified based on this project. \n•\tOwned and implemented extensive cost savings projects and tasks for all Lithography Metrology Toolsets Manufacturing Technician - Process (MTP) Intel Corporation February 2001  –  April 2006  (5 years 3 months) Chandler, Arizona •\tLead MT, area coordinator, spec content expert, primary peer trainer for 2 different modules within R & D Technical Development facility. \n•\tSetup tools and processed production material, monitored the operation, and maintained the process and analytical equipment while maintaining accuracy and adherence to specifications.  \n•\tCompetent in all the requirements of available factory technician grade levels.  \n•\tPrioritized WIP/equipment according to WIP management for multiple tool sets. Identified problems to subassembly level. Assisted with equipment improvements and upgrades. Manufacturing Technician - Process (MTP) Intel Corporation February 2001  –  April 2006  (5 years 3 months) Chandler, Arizona •\tLead MT, area coordinator, spec content expert, primary peer trainer for 2 different modules within R & D Technical Development facility. \n•\tSetup tools and processed production material, monitored the operation, and maintained the process and analytical equipment while maintaining accuracy and adherence to specifications.  \n•\tCompetent in all the requirements of available factory technician grade levels.  \n•\tPrioritized WIP/equipment according to WIP management for multiple tool sets. Identified problems to subassembly level. Assisted with equipment improvements and upgrades. Skills Safety Quality Tool ownership Tool Engineering Preventive Maintenance Corrective Maintenance Planned Preventative... Troubleshooting Maintenance & Repair Electronics Repair Equipment Repair Training Technical Training Technical Writing Technical Documentation Close Attention to... Ingenuity Lean Manufacturing Teamwork Workplace Organization Microsoft Office SPC charts Manufacturing... Manufacturing Operations Specifications Response Flow Checklists Clean Rooms Semiconductor... Wafer Fab Whitepapers 300mm Recipe Creation Equipment Maintenance Cost Saving Projects Cost Savings Strategies Continuous Improvement Dedication to... See 22+     See less Skills  Safety Quality Tool ownership Tool Engineering Preventive Maintenance Corrective Maintenance Planned Preventative... Troubleshooting Maintenance & Repair Electronics Repair Equipment Repair Training Technical Training Technical Writing Technical Documentation Close Attention to... Ingenuity Lean Manufacturing Teamwork Workplace Organization Microsoft Office SPC charts Manufacturing... Manufacturing Operations Specifications Response Flow Checklists Clean Rooms Semiconductor... Wafer Fab Whitepapers 300mm Recipe Creation Equipment Maintenance Cost Saving Projects Cost Savings Strategies Continuous Improvement Dedication to... See 22+     See less Safety Quality Tool ownership Tool Engineering Preventive Maintenance Corrective Maintenance Planned Preventative... Troubleshooting Maintenance & Repair Electronics Repair Equipment Repair Training Technical Training Technical Writing Technical Documentation Close Attention to... Ingenuity Lean Manufacturing Teamwork Workplace Organization Microsoft Office SPC charts Manufacturing... Manufacturing Operations Specifications Response Flow Checklists Clean Rooms Semiconductor... Wafer Fab Whitepapers 300mm Recipe Creation Equipment Maintenance Cost Saving Projects Cost Savings Strategies Continuous Improvement Dedication to... See 22+     See less Safety Quality Tool ownership Tool Engineering Preventive Maintenance Corrective Maintenance Planned Preventative... Troubleshooting Maintenance & Repair Electronics Repair Equipment Repair Training Technical Training Technical Writing Technical Documentation Close Attention to... Ingenuity Lean Manufacturing Teamwork Workplace Organization Microsoft Office SPC charts Manufacturing... Manufacturing Operations Specifications Response Flow Checklists Clean Rooms Semiconductor... Wafer Fab Whitepapers 300mm Recipe Creation Equipment Maintenance Cost Saving Projects Cost Savings Strategies Continuous Improvement Dedication to... See 22+     See less Education Arizona State University West Bachelor of Science (B.S.),  Operations Management Technology 2009  – 2012 Conservatory of Recording Arts and Sciences Master Recording Program II,  Audio Engineering 2000  – 2001 Music recording and production SUNY Canton Associate of Arts and Sciences (A.A.S.),  Electrical Engineering Technology 1998  – 2000 Arizona State University West Bachelor of Science (B.S.),  Operations Management Technology 2009  – 2012 Arizona State University West Bachelor of Science (B.S.),  Operations Management Technology 2009  – 2012 Arizona State University West Bachelor of Science (B.S.),  Operations Management Technology 2009  – 2012 Conservatory of Recording Arts and Sciences Master Recording Program II,  Audio Engineering 2000  – 2001 Music recording and production Conservatory of Recording Arts and Sciences Master Recording Program II,  Audio Engineering 2000  – 2001 Music recording and production Conservatory of Recording Arts and Sciences Master Recording Program II,  Audio Engineering 2000  – 2001 Music recording and production SUNY Canton Associate of Arts and Sciences (A.A.S.),  Electrical Engineering Technology 1998  – 2000 SUNY Canton Associate of Arts and Sciences (A.A.S.),  Electrical Engineering Technology 1998  – 2000 SUNY Canton Associate of Arts and Sciences (A.A.S.),  Electrical Engineering Technology 1998  – 2000 ", "Experience Manufacturing/Equipment Technician Intel Corporation July 2001  – Present (14 years 2 months) Phoenix, Arizona Area Manufacturing/Equipment Technician Intel Corporation July 2001  – Present (14 years 2 months) Phoenix, Arizona Area Manufacturing/Equipment Technician Intel Corporation July 2001  – Present (14 years 2 months) Phoenix, Arizona Area Languages Spanish Spanish Spanish Skills Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Research Outlook Teaching Photoshop Public Speaking HTML Strategic Planning Budgets Skills  Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Research Outlook Teaching Photoshop Public Speaking HTML Strategic Planning Budgets Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Research Outlook Teaching Photoshop Public Speaking HTML Strategic Planning Budgets Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Research Outlook Teaching Photoshop Public Speaking HTML Strategic Planning Budgets Education Arizona State University Bachelor's degree,  Manufacturing Engineering , 3.6GPA 2012  – 2014 ITT Technical Institute-West Covina Associate's degree 1999  – 2001 Arizona State University Bachelor's degree,  Manufacturing Engineering , 3.6GPA 2012  – 2014 Arizona State University Bachelor's degree,  Manufacturing Engineering , 3.6GPA 2012  – 2014 Arizona State University Bachelor's degree,  Manufacturing Engineering , 3.6GPA 2012  – 2014 ITT Technical Institute-West Covina Associate's degree 1999  – 2001 ITT Technical Institute-West Covina Associate's degree 1999  – 2001 ITT Technical Institute-West Covina Associate's degree 1999  – 2001 "]}