{"position": "Manufacturing Process Engineer", "company": "Intel Corporation", "profiles": ["Experience R&D Test Engineer Hewlett-Packard April 2014  – Present (1 year 5 months) Costa Rica Manufacturing Process Engineer Intel Corporation April 2013  –  April 2014  (1 year 1 month) Costa Rica Network Engineer Hewlett-Packard November 2010  –  April 2013  (2 years 6 months) Costa Rica R&D Test Engineer Hewlett-Packard April 2014  – Present (1 year 5 months) Costa Rica R&D Test Engineer Hewlett-Packard April 2014  – Present (1 year 5 months) Costa Rica Manufacturing Process Engineer Intel Corporation April 2013  –  April 2014  (1 year 1 month) Costa Rica Manufacturing Process Engineer Intel Corporation April 2013  –  April 2014  (1 year 1 month) Costa Rica Network Engineer Hewlett-Packard November 2010  –  April 2013  (2 years 6 months) Costa Rica Network Engineer Hewlett-Packard November 2010  –  April 2013  (2 years 6 months) Costa Rica Skills Process Improvement Manufactura Testing Project Management Team Leadership Manufacturing Integration Management Software Development Cross-functional Team... C++ Microsoft Office Networking Program Management Skills  Process Improvement Manufactura Testing Project Management Team Leadership Manufacturing Integration Management Software Development Cross-functional Team... C++ Microsoft Office Networking Program Management Process Improvement Manufactura Testing Project Management Team Leadership Manufacturing Integration Management Software Development Cross-functional Team... C++ Microsoft Office Networking Program Management Process Improvement Manufactura Testing Project Management Team Leadership Manufacturing Integration Management Software Development Cross-functional Team... C++ Microsoft Office Networking Program Management Education Instituto Tecnológico de Costa Rica Bachelor's Degree,  Electronic Engineer Instituto Tecnológico de Costa Rica Master of Business Administration (M.B.A.),  Business Administration and Management , General Instituto Tecnológico de Costa Rica Bachelor's Degree,  Electronic Engineer Instituto Tecnológico de Costa Rica Bachelor's Degree,  Electronic Engineer Instituto Tecnológico de Costa Rica Bachelor's Degree,  Electronic Engineer Instituto Tecnológico de Costa Rica Master of Business Administration (M.B.A.),  Business Administration and Management , General Instituto Tecnológico de Costa Rica Master of Business Administration (M.B.A.),  Business Administration and Management , General Instituto Tecnológico de Costa Rica Master of Business Administration (M.B.A.),  Business Administration and Management , General ", "Summary With more than 10 years of experience on clean room Manufacturing environment, Project Management. Improve MFG processes, troubleshooting and equipment maintenance, New Products introduction, qualification and sustaining, technical Coaching and mentoring for Engs Summary With more than 10 years of experience on clean room Manufacturing environment, Project Management. Improve MFG processes, troubleshooting and equipment maintenance, New Products introduction, qualification and sustaining, technical Coaching and mentoring for Engs With more than 10 years of experience on clean room Manufacturing environment, Project Management. Improve MFG processes, troubleshooting and equipment maintenance, New Products introduction, qualification and sustaining, technical Coaching and mentoring for Engs With more than 10 years of experience on clean room Manufacturing environment, Project Management. Improve MFG processes, troubleshooting and equipment maintenance, New Products introduction, qualification and sustaining, technical Coaching and mentoring for Engs Experience Manufacturing/Process Engineer Intel Corporation September 2004  – Present (11 years) With more than 10 years of experience on clean room Manufacturing environment, Project Management. Improve MFG processes, troubleshooting and equipment maintenance, New Products introduction, qualification and sustaining, technical Coaching and mentoring for Engs Manufacturing/Process Engineer Intel Corporation September 2004  – Present (11 years) With more than 10 years of experience on clean room Manufacturing environment, Project Management. Improve MFG processes, troubleshooting and equipment maintenance, New Products introduction, qualification and sustaining, technical Coaching and mentoring for Engs Manufacturing/Process Engineer Intel Corporation September 2004  – Present (11 years) With more than 10 years of experience on clean room Manufacturing environment, Project Management. Improve MFG processes, troubleshooting and equipment maintenance, New Products introduction, qualification and sustaining, technical Coaching and mentoring for Engs Languages English English English Skills Continuous Improvement Tool Maintenance Product Transfer Problem Solving Lean Manufacturing New Product Validation New techology transfer Process Control Project Management Teamwork Clean Rooms Self-starter Risk Assessment Skills  Continuous Improvement Tool Maintenance Product Transfer Problem Solving Lean Manufacturing New Product Validation New techology transfer Process Control Project Management Teamwork Clean Rooms Self-starter Risk Assessment Continuous Improvement Tool Maintenance Product Transfer Problem Solving Lean Manufacturing New Product Validation New techology transfer Process Control Project Management Teamwork Clean Rooms Self-starter Risk Assessment Continuous Improvement Tool Maintenance Product Transfer Problem Solving Lean Manufacturing New Product Validation New techology transfer Process Control Project Management Teamwork Clean Rooms Self-starter Risk Assessment Education Universidad Latina de Costa Rica Master's Degree,  Project Management , PM 2010  – 2012 Universidad Latina de Costa Rica Engineer's Degree,  Electrical and Electronics Engineering , BSc 1998  – 2002 Universidad Latina de Costa Rica Master's Degree,  Project Management , PM 2010  – 2012 Universidad Latina de Costa Rica Master's Degree,  Project Management , PM 2010  – 2012 Universidad Latina de Costa Rica Master's Degree,  Project Management , PM 2010  – 2012 Universidad Latina de Costa Rica Engineer's Degree,  Electrical and Electronics Engineering , BSc 1998  – 2002 Universidad Latina de Costa Rica Engineer's Degree,  Electrical and Electronics Engineering , BSc 1998  – 2002 Universidad Latina de Costa Rica Engineer's Degree,  Electrical and Electronics Engineering , BSc 1998  – 2002 ", "Experience Process Engineer Oxford Instruments April 2009  –  February 2015  (5 years 11 months) Carteret, NJ Instrumental in uncovering the root cause for wire breakages requiring extensive use of SEM and Compound microscopes. Combined & conditioned large amounts of historical data from multiple sources using SQL. Designed custom charts to facilitate multivariate dataset analysis, leading to an improved build process. \n \nDeveloped an Excel based QA spool approval database & dashboard that captured over 80% more quality defects. \n \nLed a restructuring effort that repaired an underdeveloped legacy database (SQL) resulting in improved consistency and reliability while infusing team confidence in the engineering and product data. \n \nDesigned a novel decoder wheel that reduced the etching process time by over 50%. \n \nPersuaded management to replace the existing textual based work instructions with visual work instructions; then designed and implemented the software and hardware infrastructure to automate the conversion process. \n \nSuccessfully converted numerous manufacturing work instructions & product routers into a visual format while integrating current “Tribal Knowledge”; ensuring consistent work, and bolstering confidence among operators. \n \nPerformed daily incoming inspections on machined parts, ensuring compliance with the specifications while successfully coordinating with management to resolve non-conformities with the supplier. Freelance Consultant Wallflower Designs October 2007  –  2009  (2 years) Clifton NJ Managed the acquisition and retention marketing efforts through Google AdWords, SEO, & e-mail promotions. \nRedesigned the e-commerce web site (www.faigie.com), dramatically improving its visual impact & usability. Consulting Engineer Nanologix January 2004  –  October 2007  (3 years 10 months) Hubbard, OH Produced detailed models & schematics for solar array structures using Solid Works.  \nDeveloped methods for low-cost hydrogen production. Built-up a research laboratory (<$10K), established key business relationships, and exceeded expectations by generating hydrogen in under 4 months. Product Engineer JEM America Corp. October 2002  –  July 2004  (1 year 10 months) Fremont, CA Recruited to provide expert advice and support to lead the company in becoming Intel's preferred vertical probe card supplier for their next generation logic and memory devices. Targeted areas of improvement included: \n \n* Transition to data-driven decision-making \n* Establishment of product support services\t \n* Data modeling and presentation \n* \"Effective meetings\" training\t \n* Technology road map development \n* Design rule development\t \n \nA true multidisciplinary endeavor: Acted as both an Applications & Field Service Engineer, successfully leading clients through product definition, design, and first article phases. Effectively delivered development summaries and numerous on-site technical sales presentations, while guiding the customer through the selection process. \n \nKEY PROJECTS AND ACHIEVEMENTS: \nDesigned low cost vertical probing solutions for Chip Scale Packaged devices, reducing production costs by over 50% and greatly simplifying the repair process. Defined and developed all manufacturing requirements and processes, including design rules, automation tools, assembly and repair process specifications, and training material. \nBrought together critical 3rd party vendors to facilitate the best and most appropriate usage of the company's products within the customers' unique test environment.  \nCoordinated multiple DOE's among our vendors, customers, and the company's international design centers. \nHelped our customers refine their DOE models to give meaningful results while contributing to the statistical analysis. \nDeveloped Excel-based automated data analysis tools to better understand probe contact performance and aid in the manufacturing processes. \nCreated a probe card design tracking database allowing the company to more efficiently track design changes & facilitate allocation of design work within the team.  \nLed multiple ISO9001:2000 audits, helping the company to achieve its 1st and continued certification. Mathematics Teacher Baltimore County Public Schools January 2001  –  January 2002  (1 year 1 month) Baltimore, MD Returned to the United States, taking a short-term position to re-establish professional contacts. Manufacturing Process Engineer Intel Corporation August 1998  –  July 2000  (2 years) Israel Served as Project Manager during Intel's Fab18 ramp-up. Successfully managed the complete installation and operational capability of all probe card repair modules including: metrology tools, optical inspection stations, cleaning and storage stations, operating and PM specifications, process / RFC / knowledge databases, and the quality assurance infrastructure (compliant with Intel's \"Copy Exactly\" methodology). \n \nLed and trained a multi-shift four-person team of technicians within 'Probe Card Repair' to support the startup of Intel's most technically advanced wafer fabrication facility. \nAssumed ownership of the probe card forecasting and ordering process, ensuring Just-In-Time availability. Even with frequent product changes, maintained lowest inventory overhead across all factory sites, resulting in savings of $60K+. \nProvided engineering insight and repair process training to technicians covering hardware, software, and theory of operation on all probe card repair tools.  \nDefined the Virtual Factory 'Best known method' for performing probe tip measurements giving better operational flexibility to team engineers and technicians. \nAssumed carousel (probe card storage) project leadership resulting in a successful installation and savings of $30K through negotiations and optimizations. \nChallenged the status quo by re-designing vertical storage unit fixtures using local materials and labor to reduce the total cost by over $2K. \nCreatively negotiated with vendors to obtain the most appropriate and value-driven technical support for all probe card repair tools. \nRepresented Intel-Israel in three separate international Joint Engineering Teams. Process Quality Engineer Intel Corporation February 1997  –  August 1998  (1 year 7 months) Israel Developed, and implemented a proprietary EXCEL / VB / ACCESS based comprehensive tracking system monitoring probe card quality and performance statistics (Prober correlation, MTBF, MTTR, EOL, and more), resulting in superior efficiency in data analysis. \nDesigned and performed scrub over-travel characterization experiments that led to increased probe card life and expenditure savings of over$100K/year. \nSuccessfully conducted tooling and process quality audits, both within the company and at international vendor sites, in preparation of the company's technology roadmap (Compliant to ISO9001 standards). \nCollaborated with a multi-national team of Engineers developing a new chipset process by implementing an improved probe card cleaning method and redesigning them to match on-site tooling configurations. \nSuccessfully installed new metrology tools ($100K+) and upgraded existing tools to meet next generation process demands while increasing probe card repair throughput. \nTook ownership of all probe card repair specifications, frequently updating them to maintain relevance. Mechanical Engineer RPS AUTOMATION, LLC January 1994  –  January 1995  (1 year 1 month) Spokane, Washington Area Developed Bill of Materials Database in MS Access. \nAssembled and troubleshoot lead tinning systems. \nWon high praise from customer for meticulous wiring work. Process Engineer Oxford Instruments April 2009  –  February 2015  (5 years 11 months) Carteret, NJ Instrumental in uncovering the root cause for wire breakages requiring extensive use of SEM and Compound microscopes. Combined & conditioned large amounts of historical data from multiple sources using SQL. Designed custom charts to facilitate multivariate dataset analysis, leading to an improved build process. \n \nDeveloped an Excel based QA spool approval database & dashboard that captured over 80% more quality defects. \n \nLed a restructuring effort that repaired an underdeveloped legacy database (SQL) resulting in improved consistency and reliability while infusing team confidence in the engineering and product data. \n \nDesigned a novel decoder wheel that reduced the etching process time by over 50%. \n \nPersuaded management to replace the existing textual based work instructions with visual work instructions; then designed and implemented the software and hardware infrastructure to automate the conversion process. \n \nSuccessfully converted numerous manufacturing work instructions & product routers into a visual format while integrating current “Tribal Knowledge”; ensuring consistent work, and bolstering confidence among operators. \n \nPerformed daily incoming inspections on machined parts, ensuring compliance with the specifications while successfully coordinating with management to resolve non-conformities with the supplier. Process Engineer Oxford Instruments April 2009  –  February 2015  (5 years 11 months) Carteret, NJ Instrumental in uncovering the root cause for wire breakages requiring extensive use of SEM and Compound microscopes. Combined & conditioned large amounts of historical data from multiple sources using SQL. Designed custom charts to facilitate multivariate dataset analysis, leading to an improved build process. \n \nDeveloped an Excel based QA spool approval database & dashboard that captured over 80% more quality defects. \n \nLed a restructuring effort that repaired an underdeveloped legacy database (SQL) resulting in improved consistency and reliability while infusing team confidence in the engineering and product data. \n \nDesigned a novel decoder wheel that reduced the etching process time by over 50%. \n \nPersuaded management to replace the existing textual based work instructions with visual work instructions; then designed and implemented the software and hardware infrastructure to automate the conversion process. \n \nSuccessfully converted numerous manufacturing work instructions & product routers into a visual format while integrating current “Tribal Knowledge”; ensuring consistent work, and bolstering confidence among operators. \n \nPerformed daily incoming inspections on machined parts, ensuring compliance with the specifications while successfully coordinating with management to resolve non-conformities with the supplier. Freelance Consultant Wallflower Designs October 2007  –  2009  (2 years) Clifton NJ Managed the acquisition and retention marketing efforts through Google AdWords, SEO, & e-mail promotions. \nRedesigned the e-commerce web site (www.faigie.com), dramatically improving its visual impact & usability. Freelance Consultant Wallflower Designs October 2007  –  2009  (2 years) Clifton NJ Managed the acquisition and retention marketing efforts through Google AdWords, SEO, & e-mail promotions. \nRedesigned the e-commerce web site (www.faigie.com), dramatically improving its visual impact & usability. Consulting Engineer Nanologix January 2004  –  October 2007  (3 years 10 months) Hubbard, OH Produced detailed models & schematics for solar array structures using Solid Works.  \nDeveloped methods for low-cost hydrogen production. Built-up a research laboratory (<$10K), established key business relationships, and exceeded expectations by generating hydrogen in under 4 months. Consulting Engineer Nanologix January 2004  –  October 2007  (3 years 10 months) Hubbard, OH Produced detailed models & schematics for solar array structures using Solid Works.  \nDeveloped methods for low-cost hydrogen production. Built-up a research laboratory (<$10K), established key business relationships, and exceeded expectations by generating hydrogen in under 4 months. Product Engineer JEM America Corp. October 2002  –  July 2004  (1 year 10 months) Fremont, CA Recruited to provide expert advice and support to lead the company in becoming Intel's preferred vertical probe card supplier for their next generation logic and memory devices. Targeted areas of improvement included: \n \n* Transition to data-driven decision-making \n* Establishment of product support services\t \n* Data modeling and presentation \n* \"Effective meetings\" training\t \n* Technology road map development \n* Design rule development\t \n \nA true multidisciplinary endeavor: Acted as both an Applications & Field Service Engineer, successfully leading clients through product definition, design, and first article phases. Effectively delivered development summaries and numerous on-site technical sales presentations, while guiding the customer through the selection process. \n \nKEY PROJECTS AND ACHIEVEMENTS: \nDesigned low cost vertical probing solutions for Chip Scale Packaged devices, reducing production costs by over 50% and greatly simplifying the repair process. Defined and developed all manufacturing requirements and processes, including design rules, automation tools, assembly and repair process specifications, and training material. \nBrought together critical 3rd party vendors to facilitate the best and most appropriate usage of the company's products within the customers' unique test environment.  \nCoordinated multiple DOE's among our vendors, customers, and the company's international design centers. \nHelped our customers refine their DOE models to give meaningful results while contributing to the statistical analysis. \nDeveloped Excel-based automated data analysis tools to better understand probe contact performance and aid in the manufacturing processes. \nCreated a probe card design tracking database allowing the company to more efficiently track design changes & facilitate allocation of design work within the team.  \nLed multiple ISO9001:2000 audits, helping the company to achieve its 1st and continued certification. Product Engineer JEM America Corp. October 2002  –  July 2004  (1 year 10 months) Fremont, CA Recruited to provide expert advice and support to lead the company in becoming Intel's preferred vertical probe card supplier for their next generation logic and memory devices. Targeted areas of improvement included: \n \n* Transition to data-driven decision-making \n* Establishment of product support services\t \n* Data modeling and presentation \n* \"Effective meetings\" training\t \n* Technology road map development \n* Design rule development\t \n \nA true multidisciplinary endeavor: Acted as both an Applications & Field Service Engineer, successfully leading clients through product definition, design, and first article phases. Effectively delivered development summaries and numerous on-site technical sales presentations, while guiding the customer through the selection process. \n \nKEY PROJECTS AND ACHIEVEMENTS: \nDesigned low cost vertical probing solutions for Chip Scale Packaged devices, reducing production costs by over 50% and greatly simplifying the repair process. Defined and developed all manufacturing requirements and processes, including design rules, automation tools, assembly and repair process specifications, and training material. \nBrought together critical 3rd party vendors to facilitate the best and most appropriate usage of the company's products within the customers' unique test environment.  \nCoordinated multiple DOE's among our vendors, customers, and the company's international design centers. \nHelped our customers refine their DOE models to give meaningful results while contributing to the statistical analysis. \nDeveloped Excel-based automated data analysis tools to better understand probe contact performance and aid in the manufacturing processes. \nCreated a probe card design tracking database allowing the company to more efficiently track design changes & facilitate allocation of design work within the team.  \nLed multiple ISO9001:2000 audits, helping the company to achieve its 1st and continued certification. Mathematics Teacher Baltimore County Public Schools January 2001  –  January 2002  (1 year 1 month) Baltimore, MD Returned to the United States, taking a short-term position to re-establish professional contacts. Mathematics Teacher Baltimore County Public Schools January 2001  –  January 2002  (1 year 1 month) Baltimore, MD Returned to the United States, taking a short-term position to re-establish professional contacts. Manufacturing Process Engineer Intel Corporation August 1998  –  July 2000  (2 years) Israel Served as Project Manager during Intel's Fab18 ramp-up. Successfully managed the complete installation and operational capability of all probe card repair modules including: metrology tools, optical inspection stations, cleaning and storage stations, operating and PM specifications, process / RFC / knowledge databases, and the quality assurance infrastructure (compliant with Intel's \"Copy Exactly\" methodology). \n \nLed and trained a multi-shift four-person team of technicians within 'Probe Card Repair' to support the startup of Intel's most technically advanced wafer fabrication facility. \nAssumed ownership of the probe card forecasting and ordering process, ensuring Just-In-Time availability. Even with frequent product changes, maintained lowest inventory overhead across all factory sites, resulting in savings of $60K+. \nProvided engineering insight and repair process training to technicians covering hardware, software, and theory of operation on all probe card repair tools.  \nDefined the Virtual Factory 'Best known method' for performing probe tip measurements giving better operational flexibility to team engineers and technicians. \nAssumed carousel (probe card storage) project leadership resulting in a successful installation and savings of $30K through negotiations and optimizations. \nChallenged the status quo by re-designing vertical storage unit fixtures using local materials and labor to reduce the total cost by over $2K. \nCreatively negotiated with vendors to obtain the most appropriate and value-driven technical support for all probe card repair tools. \nRepresented Intel-Israel in three separate international Joint Engineering Teams. Manufacturing Process Engineer Intel Corporation August 1998  –  July 2000  (2 years) Israel Served as Project Manager during Intel's Fab18 ramp-up. Successfully managed the complete installation and operational capability of all probe card repair modules including: metrology tools, optical inspection stations, cleaning and storage stations, operating and PM specifications, process / RFC / knowledge databases, and the quality assurance infrastructure (compliant with Intel's \"Copy Exactly\" methodology). \n \nLed and trained a multi-shift four-person team of technicians within 'Probe Card Repair' to support the startup of Intel's most technically advanced wafer fabrication facility. \nAssumed ownership of the probe card forecasting and ordering process, ensuring Just-In-Time availability. Even with frequent product changes, maintained lowest inventory overhead across all factory sites, resulting in savings of $60K+. \nProvided engineering insight and repair process training to technicians covering hardware, software, and theory of operation on all probe card repair tools.  \nDefined the Virtual Factory 'Best known method' for performing probe tip measurements giving better operational flexibility to team engineers and technicians. \nAssumed carousel (probe card storage) project leadership resulting in a successful installation and savings of $30K through negotiations and optimizations. \nChallenged the status quo by re-designing vertical storage unit fixtures using local materials and labor to reduce the total cost by over $2K. \nCreatively negotiated with vendors to obtain the most appropriate and value-driven technical support for all probe card repair tools. \nRepresented Intel-Israel in three separate international Joint Engineering Teams. Process Quality Engineer Intel Corporation February 1997  –  August 1998  (1 year 7 months) Israel Developed, and implemented a proprietary EXCEL / VB / ACCESS based comprehensive tracking system monitoring probe card quality and performance statistics (Prober correlation, MTBF, MTTR, EOL, and more), resulting in superior efficiency in data analysis. \nDesigned and performed scrub over-travel characterization experiments that led to increased probe card life and expenditure savings of over$100K/year. \nSuccessfully conducted tooling and process quality audits, both within the company and at international vendor sites, in preparation of the company's technology roadmap (Compliant to ISO9001 standards). \nCollaborated with a multi-national team of Engineers developing a new chipset process by implementing an improved probe card cleaning method and redesigning them to match on-site tooling configurations. \nSuccessfully installed new metrology tools ($100K+) and upgraded existing tools to meet next generation process demands while increasing probe card repair throughput. \nTook ownership of all probe card repair specifications, frequently updating them to maintain relevance. Process Quality Engineer Intel Corporation February 1997  –  August 1998  (1 year 7 months) Israel Developed, and implemented a proprietary EXCEL / VB / ACCESS based comprehensive tracking system monitoring probe card quality and performance statistics (Prober correlation, MTBF, MTTR, EOL, and more), resulting in superior efficiency in data analysis. \nDesigned and performed scrub over-travel characterization experiments that led to increased probe card life and expenditure savings of over$100K/year. \nSuccessfully conducted tooling and process quality audits, both within the company and at international vendor sites, in preparation of the company's technology roadmap (Compliant to ISO9001 standards). \nCollaborated with a multi-national team of Engineers developing a new chipset process by implementing an improved probe card cleaning method and redesigning them to match on-site tooling configurations. \nSuccessfully installed new metrology tools ($100K+) and upgraded existing tools to meet next generation process demands while increasing probe card repair throughput. \nTook ownership of all probe card repair specifications, frequently updating them to maintain relevance. Mechanical Engineer RPS AUTOMATION, LLC January 1994  –  January 1995  (1 year 1 month) Spokane, Washington Area Developed Bill of Materials Database in MS Access. \nAssembled and troubleshoot lead tinning systems. \nWon high praise from customer for meticulous wiring work. Mechanical Engineer RPS AUTOMATION, LLC January 1994  –  January 1995  (1 year 1 month) Spokane, Washington Area Developed Bill of Materials Database in MS Access. \nAssembled and troubleshoot lead tinning systems. \nWon high praise from customer for meticulous wiring work. Languages English Native or bilingual proficiency Hebrew Limited working proficiency English Native or bilingual proficiency Hebrew Limited working proficiency English Native or bilingual proficiency Hebrew Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Engineering Design of Experiments Testing Quality Assurance R&D Start-ups Product Development Microsoft Office Manufacturing Training Characterization SolidWorks Process Improvement Databases Data Analysis Metrology Microsoft Excel SPC See 3+     See less Skills  Engineering Design of Experiments Testing Quality Assurance R&D Start-ups Product Development Microsoft Office Manufacturing Training Characterization SolidWorks Process Improvement Databases Data Analysis Metrology Microsoft Excel SPC See 3+     See less Engineering Design of Experiments Testing Quality Assurance R&D Start-ups Product Development Microsoft Office Manufacturing Training Characterization SolidWorks Process Improvement Databases Data Analysis Metrology Microsoft Excel SPC See 3+     See less Engineering Design of Experiments Testing Quality Assurance R&D Start-ups Product Development Microsoft Office Manufacturing Training Characterization SolidWorks Process Improvement Databases Data Analysis Metrology Microsoft Excel SPC See 3+     See less Education Washington State University Bachelor's Degree,  Mechanical Engineering 1989  – 1994 Course emphasis in Dynamic & Control Systems, and Finite Element Analysis (FEA). \nRecipient of two first place awards during engineering design competitions sponsored by Hewlett Packard. \n Activities and Societies:  ASME Student Council De Anza College Relavent Coursework in SOLIDWORKS and ProENGINEER,  Mechanical Drafting and Mechanical Drafting CAD/CADD 2004  – 2004 Washington State University Bachelor's Degree,  Mechanical Engineering 1989  – 1994 Course emphasis in Dynamic & Control Systems, and Finite Element Analysis (FEA). \nRecipient of two first place awards during engineering design competitions sponsored by Hewlett Packard. \n Activities and Societies:  ASME Student Council Washington State University Bachelor's Degree,  Mechanical Engineering 1989  – 1994 Course emphasis in Dynamic & Control Systems, and Finite Element Analysis (FEA). \nRecipient of two first place awards during engineering design competitions sponsored by Hewlett Packard. \n Activities and Societies:  ASME Student Council Washington State University Bachelor's Degree,  Mechanical Engineering 1989  – 1994 Course emphasis in Dynamic & Control Systems, and Finite Element Analysis (FEA). \nRecipient of two first place awards during engineering design competitions sponsored by Hewlett Packard. \n Activities and Societies:  ASME Student Council De Anza College Relavent Coursework in SOLIDWORKS and ProENGINEER,  Mechanical Drafting and Mechanical Drafting CAD/CADD 2004  – 2004 De Anza College Relavent Coursework in SOLIDWORKS and ProENGINEER,  Mechanical Drafting and Mechanical Drafting CAD/CADD 2004  – 2004 De Anza College Relavent Coursework in SOLIDWORKS and ProENGINEER,  Mechanical Drafting and Mechanical Drafting CAD/CADD 2004  – 2004 Honors & Awards ", "Summary I have extensive experience as a Manufacturing Process Engineer building 10GB optical and Tunable transponders. I am also experienced in developing and maintaining Hot Bar and Splicing Processes. I have worked in the product development teams working with cross functional teams to successfuly develop and launch a successful product into overseas manufacuturing. I have have worked with CMs in providing training and mainting products in High and Low Volume production.  \nI am an excellent team player with great communication, writing and analytical skills with ability to work with cross functional team to deliver successful results. I am a fast learner and a valuable assest of our production team. Summary I have extensive experience as a Manufacturing Process Engineer building 10GB optical and Tunable transponders. I am also experienced in developing and maintaining Hot Bar and Splicing Processes. I have worked in the product development teams working with cross functional teams to successfuly develop and launch a successful product into overseas manufacuturing. I have have worked with CMs in providing training and mainting products in High and Low Volume production.  \nI am an excellent team player with great communication, writing and analytical skills with ability to work with cross functional team to deliver successful results. I am a fast learner and a valuable assest of our production team. I have extensive experience as a Manufacturing Process Engineer building 10GB optical and Tunable transponders. I am also experienced in developing and maintaining Hot Bar and Splicing Processes. I have worked in the product development teams working with cross functional teams to successfuly develop and launch a successful product into overseas manufacuturing. I have have worked with CMs in providing training and mainting products in High and Low Volume production.  \nI am an excellent team player with great communication, writing and analytical skills with ability to work with cross functional team to deliver successful results. I am a fast learner and a valuable assest of our production team. I have extensive experience as a Manufacturing Process Engineer building 10GB optical and Tunable transponders. I am also experienced in developing and maintaining Hot Bar and Splicing Processes. I have worked in the product development teams working with cross functional teams to successfuly develop and launch a successful product into overseas manufacuturing. I have have worked with CMs in providing training and mainting products in High and Low Volume production.  \nI am an excellent team player with great communication, writing and analytical skills with ability to work with cross functional team to deliver successful results. I am a fast learner and a valuable assest of our production team. Experience Owner Self Employed May 2007  – Present (8 years 4 months) Benicia Process Engineer Emcore Corporation June 2008  –  November 2008  (6 months) As a Manufacturing Process Engineer in Emcore, i am responsible for supporting Tunable transponder manufacturing. I am also responsible for developing and maining HotBar and Splicing Processes. My experience includes developing assembly processes, documenting, transferring products to overseas CM and providing training. Writing FMEAs, improving yields and working with a team to lauch a successful product into manufacutring with high yields. NPI Manufacturing Process Engineer Intel Corporation December 2003  –  June 2008  (4 years 7 months) I worked as a NPI Manufacturing Engineer in Intel Corporation building 10Gb Optical Transceivers. I have an extensive experience working in a Product Development Team from the beginning of the project life cycle to High Volume Production.  \nI have process development experience in Hot Bar and Splicing operations. I have completed DFx training, SPC, DOE trainings. I am also certified in electronic board assemblies IPC-A-610 standards. NPI Process Engineer Intel 2003  –  2008  (5 years) engineer Intel 2003  –  2008  (5 years) Owner Self Employed May 2007  – Present (8 years 4 months) Benicia Owner Self Employed May 2007  – Present (8 years 4 months) Benicia Process Engineer Emcore Corporation June 2008  –  November 2008  (6 months) As a Manufacturing Process Engineer in Emcore, i am responsible for supporting Tunable transponder manufacturing. I am also responsible for developing and maining HotBar and Splicing Processes. My experience includes developing assembly processes, documenting, transferring products to overseas CM and providing training. Writing FMEAs, improving yields and working with a team to lauch a successful product into manufacutring with high yields. Process Engineer Emcore Corporation June 2008  –  November 2008  (6 months) As a Manufacturing Process Engineer in Emcore, i am responsible for supporting Tunable transponder manufacturing. I am also responsible for developing and maining HotBar and Splicing Processes. My experience includes developing assembly processes, documenting, transferring products to overseas CM and providing training. Writing FMEAs, improving yields and working with a team to lauch a successful product into manufacutring with high yields. NPI Manufacturing Process Engineer Intel Corporation December 2003  –  June 2008  (4 years 7 months) I worked as a NPI Manufacturing Engineer in Intel Corporation building 10Gb Optical Transceivers. I have an extensive experience working in a Product Development Team from the beginning of the project life cycle to High Volume Production.  \nI have process development experience in Hot Bar and Splicing operations. I have completed DFx training, SPC, DOE trainings. I am also certified in electronic board assemblies IPC-A-610 standards. NPI Manufacturing Process Engineer Intel Corporation December 2003  –  June 2008  (4 years 7 months) I worked as a NPI Manufacturing Engineer in Intel Corporation building 10Gb Optical Transceivers. I have an extensive experience working in a Product Development Team from the beginning of the project life cycle to High Volume Production.  \nI have process development experience in Hot Bar and Splicing operations. I have completed DFx training, SPC, DOE trainings. I am also certified in electronic board assemblies IPC-A-610 standards. NPI Process Engineer Intel 2003  –  2008  (5 years) NPI Process Engineer Intel 2003  –  2008  (5 years) engineer Intel 2003  –  2008  (5 years) engineer Intel 2003  –  2008  (5 years) Skills Manufacturing Cross-functional Team... SPC Skills  Manufacturing Cross-functional Team... SPC Manufacturing Cross-functional Team... SPC Manufacturing Cross-functional Team... SPC Education University of Phoenix Master of Business Administration (M.B.A.),  Health/Health Care Administration/Management 2013  – 2015 DeVry University Bachelor's Degree,  Electronics Engineering 2000  – 2003 University of Phoenix Master of Business Administration (M.B.A.),  Health/Health Care Administration/Management 2013  – 2015 University of Phoenix Master of Business Administration (M.B.A.),  Health/Health Care Administration/Management 2013  – 2015 University of Phoenix Master of Business Administration (M.B.A.),  Health/Health Care Administration/Management 2013  – 2015 DeVry University Bachelor's Degree,  Electronics Engineering 2000  – 2003 DeVry University Bachelor's Degree,  Electronics Engineering 2000  – 2003 DeVry University Bachelor's Degree,  Electronics Engineering 2000  – 2003 ", "Summary Innovative professional with more than 12 years of experience on Telecommunications, Electronic and Medical Industries. Excellent analytical, interpersonal, and leadership skills. Able to work with minimum supervision and closely with production and quality departments having manufacturing responsibility for processes to provide analytical support and to mentor operation technical experts and operators to pursue continuous improvements projects on tools and processes. Responsible of improvements projects in safety, yield, manufacturability and cost and for solving complex technology and process problems by applying structured problem solving techniques. Summary Innovative professional with more than 12 years of experience on Telecommunications, Electronic and Medical Industries. Excellent analytical, interpersonal, and leadership skills. Able to work with minimum supervision and closely with production and quality departments having manufacturing responsibility for processes to provide analytical support and to mentor operation technical experts and operators to pursue continuous improvements projects on tools and processes. Responsible of improvements projects in safety, yield, manufacturability and cost and for solving complex technology and process problems by applying structured problem solving techniques. Innovative professional with more than 12 years of experience on Telecommunications, Electronic and Medical Industries. Excellent analytical, interpersonal, and leadership skills. Able to work with minimum supervision and closely with production and quality departments having manufacturing responsibility for processes to provide analytical support and to mentor operation technical experts and operators to pursue continuous improvements projects on tools and processes. Responsible of improvements projects in safety, yield, manufacturability and cost and for solving complex technology and process problems by applying structured problem solving techniques. Innovative professional with more than 12 years of experience on Telecommunications, Electronic and Medical Industries. Excellent analytical, interpersonal, and leadership skills. Able to work with minimum supervision and closely with production and quality departments having manufacturing responsibility for processes to provide analytical support and to mentor operation technical experts and operators to pursue continuous improvements projects on tools and processes. Responsible of improvements projects in safety, yield, manufacturability and cost and for solving complex technology and process problems by applying structured problem solving techniques. Experience Process Development Engineering- Consultant Boston Scientific January 2015  – Present (8 months) Chandler, Arizona Providing consulting services:  \n1. Process development and validation activities (project management, design of experiments, data analysis and documentation like pFMEA, Master Validation Plans, validation protocols and reports) for new product launches in Endoscopy to meet project's deliverables and to implement improvements on the new processes designed. \n2. Assessing process capabilities, prioritizing process improvement opportunities on new product platforms or derivative projects (applying technical knowledge and providing design for manufacturability inputs). \n3. Use of problem solving tools and statistical analysis to effectively solve failures during Development, Characterization and Validation activities for new manufacturing processes. Process Development Sr. Engineer Boston Scientific June 2012  –  December 2014  (2 years 7 months) El Coyol,Costa Rica - Lead of process development and validation activities for new product launches in Urology, Endoscopy and Women's Health divisions being responsible of groups (engineers, technicians, interns or contractors) to meet project deliverables and to implement improvements on the new processes designed. \n- Assess process capabilities, prioritize process improvement opportunities to innovate or implement process improvements on new product platforms or derivative projects (applying technical knowledge and providing design for manufacturability inputs to design and develop processes, procedures, tooling and/or automation). \n- Coordinate and execute as project core team member (working with different corporate divisions) functional deliverables associated with a Project Development Plan, project management and quality systems (cost, yield and schedule). Senior Manufacturing Engineer Boston Scientific October 2009  –  May 2012  (2 years 8 months) El Coyol,Costa Rica - Responsible of process and product transfer/ validation from USA to Costa Rica (pick and drop and duplicated lines) interfacing with project engineers, tooling engineers, suppliers, and designers to improve manufacturing processes through experimentation, DOEs or statistical analysis and leading troubleshooting or problem solving investigations, supporting decisions through engineering analysis and data. In charge of execution, design and development tasks to support R&D projects or product redesign.  \n- Responsible for the maintenance or development of product manufacturing procedures, bills of materials, flow charts, failure mode analysis (FMEA), master validation protocols and plans, device history records and non-conformance events records (CAPA).  \n- Leader of investigation applying problem solving techniques when any complaints, scrap, low productivity trends arise and by optimizing and maintaining the performance of the manufacturing process to achieve yield targets. \n- Responsible to supervise and provide coaching to Manufacturing Engineering Technicians for the transfer process and to coordinate and meet with external vendors to source equipment and fixtures. \n- Value Improvement Projects (VIP) Stewart for production area. Leader of improvement projects related to reduce cost, variance of material, scrap and to increase time standard and efficiency between manufacturing operations. Assembly and Test Development Engineer/ Process Engineer Intel Corporation January 2008  –  October 2009  (1 year 10 months) Chandler, Arizona/ Belen, Costa Rica - Responsible of metrology’s design and new products introduction and transfer from USA to Costa Rica, as well as tool installation and qualification, defining and testing operational specification ranges to be used in a high volume of manufacturing environment to meet product specification.  \n- In charge to interface with project engineers, tooling engineers, suppliers, and designers to identify materials to create manufacturing processes for the new products, working on the tool/process technical agenda to keep improving technologies by teaming up with engineers of different manufacturing facilities worldwide.  \n- Responsible of working with key development and sustaining organizations to ensure smooth transfer and operation of the equipment and process assigned to assembly area and to lead and coach junior engineers on different tasks related with this position. Manufacturing Process Engineer Intel Corporation August 2004  –  December 2007  (3 years 5 months) Belen, Costa Rica - Responsible to provide support and continuous improvement of three production operations with a total of 18 production links related to sustaining operations and analytical support for equipment and process, mentoring manufacturing technicians and interns for continuous improvements in different tools (equipment‘s maintenance, yield improvements and control excursion).  \n- Leader of lean/six sigma projects and FMEA methodology for improvements in safety, yield, manufacturability and cost. Experienced in problem solving techniques and methodology for manufacturing process with strong statistical knowledge mainly on tool matching and design of experiments. Metrology/ Design Engineer ICE -Instituto Costarricense de Electricidad July 2001  –  August 2003  (2 years 2 months) San Jose, Costa Rica - Project engineer responsible to use microcontrollers and graphic tools to design and improve metrologies for measurements systems, leadering and mentoring department’s technicians to continuously improve procedures and specifications related to tools handling, repairing and equipment preventive and corrective maintenance. \n- In charge to analyze and monitor performance of metrology equipment against specifications. Experienced with the use of NIST for metrology calibration. Process Development Engineering- Consultant Boston Scientific January 2015  – Present (8 months) Chandler, Arizona Providing consulting services:  \n1. Process development and validation activities (project management, design of experiments, data analysis and documentation like pFMEA, Master Validation Plans, validation protocols and reports) for new product launches in Endoscopy to meet project's deliverables and to implement improvements on the new processes designed. \n2. Assessing process capabilities, prioritizing process improvement opportunities on new product platforms or derivative projects (applying technical knowledge and providing design for manufacturability inputs). \n3. Use of problem solving tools and statistical analysis to effectively solve failures during Development, Characterization and Validation activities for new manufacturing processes. Process Development Engineering- Consultant Boston Scientific January 2015  – Present (8 months) Chandler, Arizona Providing consulting services:  \n1. Process development and validation activities (project management, design of experiments, data analysis and documentation like pFMEA, Master Validation Plans, validation protocols and reports) for new product launches in Endoscopy to meet project's deliverables and to implement improvements on the new processes designed. \n2. Assessing process capabilities, prioritizing process improvement opportunities on new product platforms or derivative projects (applying technical knowledge and providing design for manufacturability inputs). \n3. Use of problem solving tools and statistical analysis to effectively solve failures during Development, Characterization and Validation activities for new manufacturing processes. Process Development Sr. Engineer Boston Scientific June 2012  –  December 2014  (2 years 7 months) El Coyol,Costa Rica - Lead of process development and validation activities for new product launches in Urology, Endoscopy and Women's Health divisions being responsible of groups (engineers, technicians, interns or contractors) to meet project deliverables and to implement improvements on the new processes designed. \n- Assess process capabilities, prioritize process improvement opportunities to innovate or implement process improvements on new product platforms or derivative projects (applying technical knowledge and providing design for manufacturability inputs to design and develop processes, procedures, tooling and/or automation). \n- Coordinate and execute as project core team member (working with different corporate divisions) functional deliverables associated with a Project Development Plan, project management and quality systems (cost, yield and schedule). Process Development Sr. Engineer Boston Scientific June 2012  –  December 2014  (2 years 7 months) El Coyol,Costa Rica - Lead of process development and validation activities for new product launches in Urology, Endoscopy and Women's Health divisions being responsible of groups (engineers, technicians, interns or contractors) to meet project deliverables and to implement improvements on the new processes designed. \n- Assess process capabilities, prioritize process improvement opportunities to innovate or implement process improvements on new product platforms or derivative projects (applying technical knowledge and providing design for manufacturability inputs to design and develop processes, procedures, tooling and/or automation). \n- Coordinate and execute as project core team member (working with different corporate divisions) functional deliverables associated with a Project Development Plan, project management and quality systems (cost, yield and schedule). Senior Manufacturing Engineer Boston Scientific October 2009  –  May 2012  (2 years 8 months) El Coyol,Costa Rica - Responsible of process and product transfer/ validation from USA to Costa Rica (pick and drop and duplicated lines) interfacing with project engineers, tooling engineers, suppliers, and designers to improve manufacturing processes through experimentation, DOEs or statistical analysis and leading troubleshooting or problem solving investigations, supporting decisions through engineering analysis and data. In charge of execution, design and development tasks to support R&D projects or product redesign.  \n- Responsible for the maintenance or development of product manufacturing procedures, bills of materials, flow charts, failure mode analysis (FMEA), master validation protocols and plans, device history records and non-conformance events records (CAPA).  \n- Leader of investigation applying problem solving techniques when any complaints, scrap, low productivity trends arise and by optimizing and maintaining the performance of the manufacturing process to achieve yield targets. \n- Responsible to supervise and provide coaching to Manufacturing Engineering Technicians for the transfer process and to coordinate and meet with external vendors to source equipment and fixtures. \n- Value Improvement Projects (VIP) Stewart for production area. Leader of improvement projects related to reduce cost, variance of material, scrap and to increase time standard and efficiency between manufacturing operations. Senior Manufacturing Engineer Boston Scientific October 2009  –  May 2012  (2 years 8 months) El Coyol,Costa Rica - Responsible of process and product transfer/ validation from USA to Costa Rica (pick and drop and duplicated lines) interfacing with project engineers, tooling engineers, suppliers, and designers to improve manufacturing processes through experimentation, DOEs or statistical analysis and leading troubleshooting or problem solving investigations, supporting decisions through engineering analysis and data. In charge of execution, design and development tasks to support R&D projects or product redesign.  \n- Responsible for the maintenance or development of product manufacturing procedures, bills of materials, flow charts, failure mode analysis (FMEA), master validation protocols and plans, device history records and non-conformance events records (CAPA).  \n- Leader of investigation applying problem solving techniques when any complaints, scrap, low productivity trends arise and by optimizing and maintaining the performance of the manufacturing process to achieve yield targets. \n- Responsible to supervise and provide coaching to Manufacturing Engineering Technicians for the transfer process and to coordinate and meet with external vendors to source equipment and fixtures. \n- Value Improvement Projects (VIP) Stewart for production area. Leader of improvement projects related to reduce cost, variance of material, scrap and to increase time standard and efficiency between manufacturing operations. Assembly and Test Development Engineer/ Process Engineer Intel Corporation January 2008  –  October 2009  (1 year 10 months) Chandler, Arizona/ Belen, Costa Rica - Responsible of metrology’s design and new products introduction and transfer from USA to Costa Rica, as well as tool installation and qualification, defining and testing operational specification ranges to be used in a high volume of manufacturing environment to meet product specification.  \n- In charge to interface with project engineers, tooling engineers, suppliers, and designers to identify materials to create manufacturing processes for the new products, working on the tool/process technical agenda to keep improving technologies by teaming up with engineers of different manufacturing facilities worldwide.  \n- Responsible of working with key development and sustaining organizations to ensure smooth transfer and operation of the equipment and process assigned to assembly area and to lead and coach junior engineers on different tasks related with this position. Assembly and Test Development Engineer/ Process Engineer Intel Corporation January 2008  –  October 2009  (1 year 10 months) Chandler, Arizona/ Belen, Costa Rica - Responsible of metrology’s design and new products introduction and transfer from USA to Costa Rica, as well as tool installation and qualification, defining and testing operational specification ranges to be used in a high volume of manufacturing environment to meet product specification.  \n- In charge to interface with project engineers, tooling engineers, suppliers, and designers to identify materials to create manufacturing processes for the new products, working on the tool/process technical agenda to keep improving technologies by teaming up with engineers of different manufacturing facilities worldwide.  \n- Responsible of working with key development and sustaining organizations to ensure smooth transfer and operation of the equipment and process assigned to assembly area and to lead and coach junior engineers on different tasks related with this position. Manufacturing Process Engineer Intel Corporation August 2004  –  December 2007  (3 years 5 months) Belen, Costa Rica - Responsible to provide support and continuous improvement of three production operations with a total of 18 production links related to sustaining operations and analytical support for equipment and process, mentoring manufacturing technicians and interns for continuous improvements in different tools (equipment‘s maintenance, yield improvements and control excursion).  \n- Leader of lean/six sigma projects and FMEA methodology for improvements in safety, yield, manufacturability and cost. Experienced in problem solving techniques and methodology for manufacturing process with strong statistical knowledge mainly on tool matching and design of experiments. Manufacturing Process Engineer Intel Corporation August 2004  –  December 2007  (3 years 5 months) Belen, Costa Rica - Responsible to provide support and continuous improvement of three production operations with a total of 18 production links related to sustaining operations and analytical support for equipment and process, mentoring manufacturing technicians and interns for continuous improvements in different tools (equipment‘s maintenance, yield improvements and control excursion).  \n- Leader of lean/six sigma projects and FMEA methodology for improvements in safety, yield, manufacturability and cost. Experienced in problem solving techniques and methodology for manufacturing process with strong statistical knowledge mainly on tool matching and design of experiments. Metrology/ Design Engineer ICE -Instituto Costarricense de Electricidad July 2001  –  August 2003  (2 years 2 months) San Jose, Costa Rica - Project engineer responsible to use microcontrollers and graphic tools to design and improve metrologies for measurements systems, leadering and mentoring department’s technicians to continuously improve procedures and specifications related to tools handling, repairing and equipment preventive and corrective maintenance. \n- In charge to analyze and monitor performance of metrology equipment against specifications. Experienced with the use of NIST for metrology calibration. Metrology/ Design Engineer ICE -Instituto Costarricense de Electricidad July 2001  –  August 2003  (2 years 2 months) San Jose, Costa Rica - Project engineer responsible to use microcontrollers and graphic tools to design and improve metrologies for measurements systems, leadering and mentoring department’s technicians to continuously improve procedures and specifications related to tools handling, repairing and equipment preventive and corrective maintenance. \n- In charge to analyze and monitor performance of metrology equipment against specifications. Experienced with the use of NIST for metrology calibration. Languages Spanish Native or bilingual proficiency English Full professional proficiency French Elementary proficiency Spanish Native or bilingual proficiency English Full professional proficiency French Elementary proficiency Spanish Native or bilingual proficiency English Full professional proficiency French Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills Design for Manufacturing Problem Solving Process Capability Process Control FMEA Design of Experiments CAPA Processes Development Minitab Process Improvement Lean Manufacturing Root Cause Analysis Continuous Improvement Manufacturing Quality System Six Sigma Validation Testing DMAIC Troubleshooting Gage R Manufacturing Operations Operational Excellence Process Engineering See 9+     See less Skills  Design for Manufacturing Problem Solving Process Capability Process Control FMEA Design of Experiments CAPA Processes Development Minitab Process Improvement Lean Manufacturing Root Cause Analysis Continuous Improvement Manufacturing Quality System Six Sigma Validation Testing DMAIC Troubleshooting Gage R Manufacturing Operations Operational Excellence Process Engineering See 9+     See less Design for Manufacturing Problem Solving Process Capability Process Control FMEA Design of Experiments CAPA Processes Development Minitab Process Improvement Lean Manufacturing Root Cause Analysis Continuous Improvement Manufacturing Quality System Six Sigma Validation Testing DMAIC Troubleshooting Gage R Manufacturing Operations Operational Excellence Process Engineering See 9+     See less Design for Manufacturing Problem Solving Process Capability Process Control FMEA Design of Experiments CAPA Processes Development Minitab Process Improvement Lean Manufacturing Root Cause Analysis Continuous Improvement Manufacturing Quality System Six Sigma Validation Testing DMAIC Troubleshooting Gage R Manufacturing Operations Operational Excellence Process Engineering See 9+     See less Education Instituto Tecnológico de Costa Rica Master,  Industrial Engineering- Modern Systems of Manufacturing 2008  – 2014 Instituto Tecnológico de Costa Rica Licenciature,  Electronic Engineering 1997  – 2002 Universidad de Costa Rica Bachelor,  Bussiness Administration/English 2000 Colegio Maria Inmaculada Instituto Tecnológico de Costa Rica Master,  Industrial Engineering- Modern Systems of Manufacturing 2008  – 2014 Instituto Tecnológico de Costa Rica Master,  Industrial Engineering- Modern Systems of Manufacturing 2008  – 2014 Instituto Tecnológico de Costa Rica Master,  Industrial Engineering- Modern Systems of Manufacturing 2008  – 2014 Instituto Tecnológico de Costa Rica Licenciature,  Electronic Engineering 1997  – 2002 Instituto Tecnológico de Costa Rica Licenciature,  Electronic Engineering 1997  – 2002 Instituto Tecnológico de Costa Rica Licenciature,  Electronic Engineering 1997  – 2002 Universidad de Costa Rica Bachelor,  Bussiness Administration/English 2000 Universidad de Costa Rica Bachelor,  Bussiness Administration/English 2000 Universidad de Costa Rica Bachelor,  Bussiness Administration/English 2000 Colegio Maria Inmaculada Colegio Maria Inmaculada Colegio Maria Inmaculada Honors & Awards Product Life Cycle Process Accomplishment Award- Automated Riveter Design and Implementation Boston Scientific Corporation April 2013 Process automatization for riveting operation. Platinum Value Improvement Process for Costa Rica's Coyol plant Boston Scientific Corporation October 2012 Knowledge Driven Product Development (KDPD) Leadership Award Urology Division Boston Scientific Corporation February 2013 Additional Honors & Awards • AAMI Quality System Regulation Certification (August 2011) \n• Internal Auditor of Quality Systems (October 2011) Product Life Cycle Process Accomplishment Award- Automated Riveter Design and Implementation Boston Scientific Corporation April 2013 Process automatization for riveting operation. Product Life Cycle Process Accomplishment Award- Automated Riveter Design and Implementation Boston Scientific Corporation April 2013 Process automatization for riveting operation. Product Life Cycle Process Accomplishment Award- Automated Riveter Design and Implementation Boston Scientific Corporation April 2013 Process automatization for riveting operation. Platinum Value Improvement Process for Costa Rica's Coyol plant Boston Scientific Corporation October 2012 Platinum Value Improvement Process for Costa Rica's Coyol plant Boston Scientific Corporation October 2012 Platinum Value Improvement Process for Costa Rica's Coyol plant Boston Scientific Corporation October 2012 Knowledge Driven Product Development (KDPD) Leadership Award Urology Division Boston Scientific Corporation February 2013 Knowledge Driven Product Development (KDPD) Leadership Award Urology Division Boston Scientific Corporation February 2013 Knowledge Driven Product Development (KDPD) Leadership Award Urology Division Boston Scientific Corporation February 2013 Additional Honors & Awards • AAMI Quality System Regulation Certification (August 2011) \n• Internal Auditor of Quality Systems (October 2011) Additional Honors & Awards • AAMI Quality System Regulation Certification (August 2011) \n• Internal Auditor of Quality Systems (October 2011) Additional Honors & Awards • AAMI Quality System Regulation Certification (August 2011) \n• Internal Auditor of Quality Systems (October 2011) ", "Summary Manufacturing Engineer who has also worked in a dynamic, high-volume manufacturing environment for a world-class manufacturer who is used to working under high-pressure, high-stakes situations. Strong background in applying statistical analysis (DOEs) for process improvements, as well as Lean Six Sigma principles and applications for process improvement. Summary Manufacturing Engineer who has also worked in a dynamic, high-volume manufacturing environment for a world-class manufacturer who is used to working under high-pressure, high-stakes situations. Strong background in applying statistical analysis (DOEs) for process improvements, as well as Lean Six Sigma principles and applications for process improvement. Manufacturing Engineer who has also worked in a dynamic, high-volume manufacturing environment for a world-class manufacturer who is used to working under high-pressure, high-stakes situations. Strong background in applying statistical analysis (DOEs) for process improvements, as well as Lean Six Sigma principles and applications for process improvement. Manufacturing Engineer who has also worked in a dynamic, high-volume manufacturing environment for a world-class manufacturer who is used to working under high-pressure, high-stakes situations. Strong background in applying statistical analysis (DOEs) for process improvements, as well as Lean Six Sigma principles and applications for process improvement. Experience Manufacturing Process Engineer Intel Corporation September 2007  –  March 2015  (7 years 7 months) Chandler, AZ Was in charge of preparing for and executing New Product Introductions (NPI's), as well as assisting manufacturing with process control systems issues and equipment programming-related issues in order to maintain smooth operation of the manufacturing lines with maximum tool availability and minimum set up and quality issues, thus gaining much experience in multi-tasking, equipment trouble shooting, and being a solid, pragmatic decision maker constantly vigilant of process improvement opportunities.  \n \n•\tOperated, repaired and programmed different types of pick and place equipment for NPIs setting up NPIs for high volume manufacturing under high stress situations.  \n•\tCo-owned and organized the NPI Working Group, assigning NPI's to other manufacturing engineers, tracking their progress and preventing NPI hold ups due to missing collaterals or incoherent programming \n•\tWas in charge of ordering high-risk collaterals for pathfinding products, and creating Control Chart settings, as well as scrubbing BOMs.  \n•\tEquipment owner for the Programming Management System (PMS) for middle of line factory module.  \n•\tWorked with and led Automation and Software Engineer managers, as well as other Process and Product engineers in revamping this system for a new process equipment line earning Factory honors. \n•\tPerformed careful time studies as lead of Black Belt project to demonstrate savings due to automation improvements that reduced set up times, thus increasing link availability by 2% with savings of $850,000/yr over 4 years.  \n•\tTrained Manufacturing Technicians in being proficient at operating an entirely new manufacturing process and assembly line, developing a strong rapport with manufacturing personnel.  \n•\tWorked with manufacturing supervisors to make prompt risk decisions in keeping the lines up as needed, getting involved in cannibalization and bypassing.  \n•\tIncreased shift’s output and yield results from 4th best to 2nd best over 2014, and 1st best over Q4’15.  \n \n Process Engineering Intel Corporation June 2004  –  September 2007  (3 years 4 months) Chandler, AZ Project manager in charge of certifying product platforms through revision levels achieving stability and capability of key process parameters making use of, and updating FMEA tables until ramping up in the Intel factories occurred, also applying 6sigma DMAIC principles to stream lines processes, and in charge of meeting yield targets.  \n•\tSuccessfully certified the server product medium form factor platforms (medium server applications, Xeon 4/8) from technology inception to factory product launch and customer shipments.  \n•\tAlso owned large form factor platform (large server applications, Itanium2) through factory product pre-launch, leading quality, material, and manufacturing engineers to complete mitigation of all risks for high-volume-manufacturing.  \n•\tWas in charge of managing the installation of a dual lane link, supervising equipment, and facility engineers in carrying out safety, and data collection installation procedures.  \n•\tLed a Thermal Degradation Task Force which disposed $75 million worth of product. Issue ultimately pinned to a material defect from an external supplier which established a new set of PCS charts from suppliers. \n•\tLed a revamping effort of fusing and creating all new set of SPC charts (about 100 charts in total) for the module, being in charge of all large-form factor platforms, thus minimizing variability.  \n•\tImproved Cpk of thermal degradation output parameter by 500%, and reject levels were reduced by 75% to 5% above target, thus meeting revision level requirements through product launch in the high-volume factories.  \n•\tCo-owner of a new lid supplier qualification Preliminary and Final White Paper for small form factor dual die (DD). Owned follow up WPs to establish new lid dimension specifications in order to improve thermal degradation.  \n•\tThe qualification of these WP's also permitted maintaining a thinner metal thermal interface thus saving $1M in material costs over the life of the product.  \n Technical Sales Engineer R. M. Myers, Corp May 2001  –  August 2002  (1 year 4 months) Jacksonville, Florida Area Manufacturing Process Engineer Intel Corporation September 2007  –  March 2015  (7 years 7 months) Chandler, AZ Was in charge of preparing for and executing New Product Introductions (NPI's), as well as assisting manufacturing with process control systems issues and equipment programming-related issues in order to maintain smooth operation of the manufacturing lines with maximum tool availability and minimum set up and quality issues, thus gaining much experience in multi-tasking, equipment trouble shooting, and being a solid, pragmatic decision maker constantly vigilant of process improvement opportunities.  \n \n•\tOperated, repaired and programmed different types of pick and place equipment for NPIs setting up NPIs for high volume manufacturing under high stress situations.  \n•\tCo-owned and organized the NPI Working Group, assigning NPI's to other manufacturing engineers, tracking their progress and preventing NPI hold ups due to missing collaterals or incoherent programming \n•\tWas in charge of ordering high-risk collaterals for pathfinding products, and creating Control Chart settings, as well as scrubbing BOMs.  \n•\tEquipment owner for the Programming Management System (PMS) for middle of line factory module.  \n•\tWorked with and led Automation and Software Engineer managers, as well as other Process and Product engineers in revamping this system for a new process equipment line earning Factory honors. \n•\tPerformed careful time studies as lead of Black Belt project to demonstrate savings due to automation improvements that reduced set up times, thus increasing link availability by 2% with savings of $850,000/yr over 4 years.  \n•\tTrained Manufacturing Technicians in being proficient at operating an entirely new manufacturing process and assembly line, developing a strong rapport with manufacturing personnel.  \n•\tWorked with manufacturing supervisors to make prompt risk decisions in keeping the lines up as needed, getting involved in cannibalization and bypassing.  \n•\tIncreased shift’s output and yield results from 4th best to 2nd best over 2014, and 1st best over Q4’15.  \n \n Manufacturing Process Engineer Intel Corporation September 2007  –  March 2015  (7 years 7 months) Chandler, AZ Was in charge of preparing for and executing New Product Introductions (NPI's), as well as assisting manufacturing with process control systems issues and equipment programming-related issues in order to maintain smooth operation of the manufacturing lines with maximum tool availability and minimum set up and quality issues, thus gaining much experience in multi-tasking, equipment trouble shooting, and being a solid, pragmatic decision maker constantly vigilant of process improvement opportunities.  \n \n•\tOperated, repaired and programmed different types of pick and place equipment for NPIs setting up NPIs for high volume manufacturing under high stress situations.  \n•\tCo-owned and organized the NPI Working Group, assigning NPI's to other manufacturing engineers, tracking their progress and preventing NPI hold ups due to missing collaterals or incoherent programming \n•\tWas in charge of ordering high-risk collaterals for pathfinding products, and creating Control Chart settings, as well as scrubbing BOMs.  \n•\tEquipment owner for the Programming Management System (PMS) for middle of line factory module.  \n•\tWorked with and led Automation and Software Engineer managers, as well as other Process and Product engineers in revamping this system for a new process equipment line earning Factory honors. \n•\tPerformed careful time studies as lead of Black Belt project to demonstrate savings due to automation improvements that reduced set up times, thus increasing link availability by 2% with savings of $850,000/yr over 4 years.  \n•\tTrained Manufacturing Technicians in being proficient at operating an entirely new manufacturing process and assembly line, developing a strong rapport with manufacturing personnel.  \n•\tWorked with manufacturing supervisors to make prompt risk decisions in keeping the lines up as needed, getting involved in cannibalization and bypassing.  \n•\tIncreased shift’s output and yield results from 4th best to 2nd best over 2014, and 1st best over Q4’15.  \n \n Process Engineering Intel Corporation June 2004  –  September 2007  (3 years 4 months) Chandler, AZ Project manager in charge of certifying product platforms through revision levels achieving stability and capability of key process parameters making use of, and updating FMEA tables until ramping up in the Intel factories occurred, also applying 6sigma DMAIC principles to stream lines processes, and in charge of meeting yield targets.  \n•\tSuccessfully certified the server product medium form factor platforms (medium server applications, Xeon 4/8) from technology inception to factory product launch and customer shipments.  \n•\tAlso owned large form factor platform (large server applications, Itanium2) through factory product pre-launch, leading quality, material, and manufacturing engineers to complete mitigation of all risks for high-volume-manufacturing.  \n•\tWas in charge of managing the installation of a dual lane link, supervising equipment, and facility engineers in carrying out safety, and data collection installation procedures.  \n•\tLed a Thermal Degradation Task Force which disposed $75 million worth of product. Issue ultimately pinned to a material defect from an external supplier which established a new set of PCS charts from suppliers. \n•\tLed a revamping effort of fusing and creating all new set of SPC charts (about 100 charts in total) for the module, being in charge of all large-form factor platforms, thus minimizing variability.  \n•\tImproved Cpk of thermal degradation output parameter by 500%, and reject levels were reduced by 75% to 5% above target, thus meeting revision level requirements through product launch in the high-volume factories.  \n•\tCo-owner of a new lid supplier qualification Preliminary and Final White Paper for small form factor dual die (DD). Owned follow up WPs to establish new lid dimension specifications in order to improve thermal degradation.  \n•\tThe qualification of these WP's also permitted maintaining a thinner metal thermal interface thus saving $1M in material costs over the life of the product.  \n Process Engineering Intel Corporation June 2004  –  September 2007  (3 years 4 months) Chandler, AZ Project manager in charge of certifying product platforms through revision levels achieving stability and capability of key process parameters making use of, and updating FMEA tables until ramping up in the Intel factories occurred, also applying 6sigma DMAIC principles to stream lines processes, and in charge of meeting yield targets.  \n•\tSuccessfully certified the server product medium form factor platforms (medium server applications, Xeon 4/8) from technology inception to factory product launch and customer shipments.  \n•\tAlso owned large form factor platform (large server applications, Itanium2) through factory product pre-launch, leading quality, material, and manufacturing engineers to complete mitigation of all risks for high-volume-manufacturing.  \n•\tWas in charge of managing the installation of a dual lane link, supervising equipment, and facility engineers in carrying out safety, and data collection installation procedures.  \n•\tLed a Thermal Degradation Task Force which disposed $75 million worth of product. Issue ultimately pinned to a material defect from an external supplier which established a new set of PCS charts from suppliers. \n•\tLed a revamping effort of fusing and creating all new set of SPC charts (about 100 charts in total) for the module, being in charge of all large-form factor platforms, thus minimizing variability.  \n•\tImproved Cpk of thermal degradation output parameter by 500%, and reject levels were reduced by 75% to 5% above target, thus meeting revision level requirements through product launch in the high-volume factories.  \n•\tCo-owner of a new lid supplier qualification Preliminary and Final White Paper for small form factor dual die (DD). Owned follow up WPs to establish new lid dimension specifications in order to improve thermal degradation.  \n•\tThe qualification of these WP's also permitted maintaining a thinner metal thermal interface thus saving $1M in material costs over the life of the product.  \n Technical Sales Engineer R. M. Myers, Corp May 2001  –  August 2002  (1 year 4 months) Jacksonville, Florida Area Technical Sales Engineer R. M. Myers, Corp May 2001  –  August 2002  (1 year 4 months) Jacksonville, Florida Area Languages English Full professional proficiency Spanish Full professional proficiency French Limited working proficiency Italian Elementary proficiency English Full professional proficiency Spanish Full professional proficiency French Limited working proficiency Italian Elementary proficiency English Full professional proficiency Spanish Full professional proficiency French Limited working proficiency Italian Elementary proficiency Full professional proficiency Full professional proficiency Limited working proficiency Elementary proficiency Skills Lean Six Sigma Advanced Process Control New Product... Process Engineering Cross-functional Team... Skills  Lean Six Sigma Advanced Process Control New Product... Process Engineering Cross-functional Team... Lean Six Sigma Advanced Process Control New Product... Process Engineering Cross-functional Team... Lean Six Sigma Advanced Process Control New Product... Process Engineering Cross-functional Team... Education University of Florida Master's degree,  Mechanical Engineering 2000  – 2003 Activities and Societies:  Hispanic Graduate Association University of Florida Bachelor of Science (B.S.),  Mechanical Engineering 1996  – 1999 University of Florida Master's degree,  Mechanical Engineering 2000  – 2003 Activities and Societies:  Hispanic Graduate Association University of Florida Master's degree,  Mechanical Engineering 2000  – 2003 Activities and Societies:  Hispanic Graduate Association University of Florida Master's degree,  Mechanical Engineering 2000  – 2003 Activities and Societies:  Hispanic Graduate Association University of Florida Bachelor of Science (B.S.),  Mechanical Engineering 1996  – 1999 University of Florida Bachelor of Science (B.S.),  Mechanical Engineering 1996  – 1999 University of Florida Bachelor of Science (B.S.),  Mechanical Engineering 1996  – 1999 ", "Experience Manufacturing Process Engineer Intel Corporation March 2010  – Present (5 years 6 months) NM Experienced with process flow from the Front end to the Back end of the line with the leading Intel Corporation technology. Also, mentoring and upskilling other engineering peers, work across various modules on factory goals. Skilled in data analysis packages and MEMS microfabrication methods. Resume and references available upon request. Electronic Engineer U.S. Army Research Laboratory January 2008  –  January 2009  (1 year 1 month) Adelphi, MD Graduate Internship on developing small-scale, microcmachine power engines, MEMS, process flow, microfabrication, electronics. Manufacturing Process Engineer Intel Corporation March 2010  – Present (5 years 6 months) NM Experienced with process flow from the Front end to the Back end of the line with the leading Intel Corporation technology. Also, mentoring and upskilling other engineering peers, work across various modules on factory goals. Skilled in data analysis packages and MEMS microfabrication methods. Resume and references available upon request. Manufacturing Process Engineer Intel Corporation March 2010  – Present (5 years 6 months) NM Experienced with process flow from the Front end to the Back end of the line with the leading Intel Corporation technology. Also, mentoring and upskilling other engineering peers, work across various modules on factory goals. Skilled in data analysis packages and MEMS microfabrication methods. Resume and references available upon request. Electronic Engineer U.S. Army Research Laboratory January 2008  –  January 2009  (1 year 1 month) Adelphi, MD Graduate Internship on developing small-scale, microcmachine power engines, MEMS, process flow, microfabrication, electronics. Electronic Engineer U.S. Army Research Laboratory January 2008  –  January 2009  (1 year 1 month) Adelphi, MD Graduate Internship on developing small-scale, microcmachine power engines, MEMS, process flow, microfabrication, electronics. Languages English Spanish English Spanish English Spanish Skills Manufacturing MEMS Semiconductors Electrical Engineering Matlab Engineering Electronics Engineering Management Testing Skills  Manufacturing MEMS Semiconductors Electrical Engineering Matlab Engineering Electronics Engineering Management Testing Manufacturing MEMS Semiconductors Electrical Engineering Matlab Engineering Electronics Engineering Management Testing Manufacturing MEMS Semiconductors Electrical Engineering Matlab Engineering Electronics Engineering Management Testing Education University of Florida Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering 2006  – 2010 Published in multiple journals, and presented several papers in conferences Activities and Societies:  MEMS ,  micromachining fabrication\nIEEE University of Florida Master's Degree,  Electrical and Electronics Engineering 2003  – 2006 Activities and Societies:  MEMS ,  electronics\nIEEE University of Florida Bachelor's Degree,  Electrical and Electronics Engineering 1999  – 2003 Activities and Societies:  Electrical and Computer engineering\nIEEE\nHonors University of Florida Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering 2006  – 2010 Published in multiple journals, and presented several papers in conferences Activities and Societies:  MEMS ,  micromachining fabrication\nIEEE University of Florida Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering 2006  – 2010 Published in multiple journals, and presented several papers in conferences Activities and Societies:  MEMS ,  micromachining fabrication\nIEEE University of Florida Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering 2006  – 2010 Published in multiple journals, and presented several papers in conferences Activities and Societies:  MEMS ,  micromachining fabrication\nIEEE University of Florida Master's Degree,  Electrical and Electronics Engineering 2003  – 2006 Activities and Societies:  MEMS ,  electronics\nIEEE University of Florida Master's Degree,  Electrical and Electronics Engineering 2003  – 2006 Activities and Societies:  MEMS ,  electronics\nIEEE University of Florida Master's Degree,  Electrical and Electronics Engineering 2003  – 2006 Activities and Societies:  MEMS ,  electronics\nIEEE University of Florida Bachelor's Degree,  Electrical and Electronics Engineering 1999  – 2003 Activities and Societies:  Electrical and Computer engineering\nIEEE\nHonors University of Florida Bachelor's Degree,  Electrical and Electronics Engineering 1999  – 2003 Activities and Societies:  Electrical and Computer engineering\nIEEE\nHonors University of Florida Bachelor's Degree,  Electrical and Electronics Engineering 1999  – 2003 Activities and Societies:  Electrical and Computer engineering\nIEEE\nHonors ", "Summary Technical knowledge:\t \n- Plant Engineering (HVAC, Air-conditioning, Ducting, UPW treatment systems) \n- Mechanical services/BMS/Facilities management/plant systems layout \n- Strategic maintenance (RCM, TPM, LEAN, VDMP, BCM, HPM) \n- Maintenance performance measurement (MTBF, MTTF, OEE, MTTR, KPI’s, FMEA) \n- Usage of logic/decision trees \n- Thermodynamics and fluid system analysis \n- Maintenance management standards (PASS 55 - ISO 55000, BSEN 15341:2007) \n- Knowledge of (CMMS, MAXIMO) \n- Safety & risk management, Safety management, H&S legislation  \n- Failure analysis and statistics (FMEA) \n\tProficient with Microsoft Office (Excel, Word, Project, Power Point), SPSS, JUMP, CAD, CAM, Inventor, Revit/Solid works (basic)  \n \nCore areas: \nEngineering Technology, Engineering Science and Maths, Electronic/Electric Technology, Maths, Plant Engineering (HVAC, Air-condition, Ducting), Process Systems Analysis, Materials & Mechanics of Materials, Mechanical services, BMS, Facilities Management, Systems Layout. Summary Technical knowledge:\t \n- Plant Engineering (HVAC, Air-conditioning, Ducting, UPW treatment systems) \n- Mechanical services/BMS/Facilities management/plant systems layout \n- Strategic maintenance (RCM, TPM, LEAN, VDMP, BCM, HPM) \n- Maintenance performance measurement (MTBF, MTTF, OEE, MTTR, KPI’s, FMEA) \n- Usage of logic/decision trees \n- Thermodynamics and fluid system analysis \n- Maintenance management standards (PASS 55 - ISO 55000, BSEN 15341:2007) \n- Knowledge of (CMMS, MAXIMO) \n- Safety & risk management, Safety management, H&S legislation  \n- Failure analysis and statistics (FMEA) \n\tProficient with Microsoft Office (Excel, Word, Project, Power Point), SPSS, JUMP, CAD, CAM, Inventor, Revit/Solid works (basic)  \n \nCore areas: \nEngineering Technology, Engineering Science and Maths, Electronic/Electric Technology, Maths, Plant Engineering (HVAC, Air-condition, Ducting), Process Systems Analysis, Materials & Mechanics of Materials, Mechanical services, BMS, Facilities Management, Systems Layout. Technical knowledge:\t \n- Plant Engineering (HVAC, Air-conditioning, Ducting, UPW treatment systems) \n- Mechanical services/BMS/Facilities management/plant systems layout \n- Strategic maintenance (RCM, TPM, LEAN, VDMP, BCM, HPM) \n- Maintenance performance measurement (MTBF, MTTF, OEE, MTTR, KPI’s, FMEA) \n- Usage of logic/decision trees \n- Thermodynamics and fluid system analysis \n- Maintenance management standards (PASS 55 - ISO 55000, BSEN 15341:2007) \n- Knowledge of (CMMS, MAXIMO) \n- Safety & risk management, Safety management, H&S legislation  \n- Failure analysis and statistics (FMEA) \n\tProficient with Microsoft Office (Excel, Word, Project, Power Point), SPSS, JUMP, CAD, CAM, Inventor, Revit/Solid works (basic)  \n \nCore areas: \nEngineering Technology, Engineering Science and Maths, Electronic/Electric Technology, Maths, Plant Engineering (HVAC, Air-condition, Ducting), Process Systems Analysis, Materials & Mechanics of Materials, Mechanical services, BMS, Facilities Management, Systems Layout. Technical knowledge:\t \n- Plant Engineering (HVAC, Air-conditioning, Ducting, UPW treatment systems) \n- Mechanical services/BMS/Facilities management/plant systems layout \n- Strategic maintenance (RCM, TPM, LEAN, VDMP, BCM, HPM) \n- Maintenance performance measurement (MTBF, MTTF, OEE, MTTR, KPI’s, FMEA) \n- Usage of logic/decision trees \n- Thermodynamics and fluid system analysis \n- Maintenance management standards (PASS 55 - ISO 55000, BSEN 15341:2007) \n- Knowledge of (CMMS, MAXIMO) \n- Safety & risk management, Safety management, H&S legislation  \n- Failure analysis and statistics (FMEA) \n\tProficient with Microsoft Office (Excel, Word, Project, Power Point), SPSS, JUMP, CAD, CAM, Inventor, Revit/Solid works (basic)  \n \nCore areas: \nEngineering Technology, Engineering Science and Maths, Electronic/Electric Technology, Maths, Plant Engineering (HVAC, Air-condition, Ducting), Process Systems Analysis, Materials & Mechanics of Materials, Mechanical services, BMS, Facilities Management, Systems Layout. Experience Facilities Manager KCMG Composites June 2015  – Present (3 months) Manufacturing Process Engineer Intel Corporation May 2012  –  June 2015  (3 years 2 months) Postgraduate Researcher/Teaching Assistant Limerick Institute of Technology June 2010  –  September 2012  (2 years 4 months) \" A Statistical Analysis of Irish Maintenance Management Practices\" \n \n•Researched the maintenance/asset management practices of 100+ manufacturing organisations in Ireland (Including site visits) \n•Key areas of study included production optimisation, modern manufacturing technologies, increasing manufacturing throughputs, strategic maintenance management \n•Core skills developed include project planning/management, self-motivation, effective written communication skills, analytical skills, technical writing, the ability to self-direct work \n \nTeaching assistant for Maths/Engineering Science Facilities Manager KCMG Composites June 2015  – Present (3 months) Facilities Manager KCMG Composites June 2015  – Present (3 months) Manufacturing Process Engineer Intel Corporation May 2012  –  June 2015  (3 years 2 months) Manufacturing Process Engineer Intel Corporation May 2012  –  June 2015  (3 years 2 months) Postgraduate Researcher/Teaching Assistant Limerick Institute of Technology June 2010  –  September 2012  (2 years 4 months) \" A Statistical Analysis of Irish Maintenance Management Practices\" \n \n•Researched the maintenance/asset management practices of 100+ manufacturing organisations in Ireland (Including site visits) \n•Key areas of study included production optimisation, modern manufacturing technologies, increasing manufacturing throughputs, strategic maintenance management \n•Core skills developed include project planning/management, self-motivation, effective written communication skills, analytical skills, technical writing, the ability to self-direct work \n \nTeaching assistant for Maths/Engineering Science Postgraduate Researcher/Teaching Assistant Limerick Institute of Technology June 2010  –  September 2012  (2 years 4 months) \" A Statistical Analysis of Irish Maintenance Management Practices\" \n \n•Researched the maintenance/asset management practices of 100+ manufacturing organisations in Ireland (Including site visits) \n•Key areas of study included production optimisation, modern manufacturing technologies, increasing manufacturing throughputs, strategic maintenance management \n•Core skills developed include project planning/management, self-motivation, effective written communication skills, analytical skills, technical writing, the ability to self-direct work \n \nTeaching assistant for Maths/Engineering Science Skills Research Data Analysis Statistics AutoCAD Microsoft Office PowerPoint Strategic Planning Manufacturing Teaching Writing Maintenance Management Facilities Operations FMEA Facilities Management Problem Solving Engineering Continuous Improvement Lean Manufacturing Project Management Six Sigma Process Engineering Project Planning Materials Process Improvement Leadership Technical Writing Teamwork Training Analysis CAD See 15+     See less Skills  Research Data Analysis Statistics AutoCAD Microsoft Office PowerPoint Strategic Planning Manufacturing Teaching Writing Maintenance Management Facilities Operations FMEA Facilities Management Problem Solving Engineering Continuous Improvement Lean Manufacturing Project Management Six Sigma Process Engineering Project Planning Materials Process Improvement Leadership Technical Writing Teamwork Training Analysis CAD See 15+     See less Research Data Analysis Statistics AutoCAD Microsoft Office PowerPoint Strategic Planning Manufacturing Teaching Writing Maintenance Management Facilities Operations FMEA Facilities Management Problem Solving Engineering Continuous Improvement Lean Manufacturing Project Management Six Sigma Process Engineering Project Planning Materials Process Improvement Leadership Technical Writing Teamwork Training Analysis CAD See 15+     See less Research Data Analysis Statistics AutoCAD Microsoft Office PowerPoint Strategic Planning Manufacturing Teaching Writing Maintenance Management Facilities Operations FMEA Facilities Management Problem Solving Engineering Continuous Improvement Lean Manufacturing Project Management Six Sigma Process Engineering Project Planning Materials Process Improvement Leadership Technical Writing Teamwork Training Analysis CAD See 15+     See less Education Limerick Institute of Technology M.Eng,  Manufacturing/Maintenance Engineering 2010  – 2012 Project title \"A statistical analysis of Irish maintenance management practices\" \nResearched the maintenance/asset management practices of 100+ manufacturing organisations in Ireland \nKey areas of study included production optimisation, modern manufacturing technologies, increasing manufacturing throughputs, strategic maintenance management \nCore skills developed include project planning/management, self-motivation, effective written communication skills, analytical skills, technical writing, the ability to self-direct work; : Limerick Institute of Technology B.Eng (Hons),  Mechanical/Facilities Engineering 2006-2010 2006  – 2010 First Class Honours Degree (1.1) \nResearch projects included \" An investigation into industrial thermal energy recovery\" - Conducted a case study involving Aughinish Alumina \nGroup projects include fixture design and BMS design Crescent College Comprehensive 2001  – 2006 St. Pauls National School Limerick Institute of Technology M.Eng,  Manufacturing/Maintenance Engineering 2010  – 2012 Project title \"A statistical analysis of Irish maintenance management practices\" \nResearched the maintenance/asset management practices of 100+ manufacturing organisations in Ireland \nKey areas of study included production optimisation, modern manufacturing technologies, increasing manufacturing throughputs, strategic maintenance management \nCore skills developed include project planning/management, self-motivation, effective written communication skills, analytical skills, technical writing, the ability to self-direct work; : Limerick Institute of Technology M.Eng,  Manufacturing/Maintenance Engineering 2010  – 2012 Project title \"A statistical analysis of Irish maintenance management practices\" \nResearched the maintenance/asset management practices of 100+ manufacturing organisations in Ireland \nKey areas of study included production optimisation, modern manufacturing technologies, increasing manufacturing throughputs, strategic maintenance management \nCore skills developed include project planning/management, self-motivation, effective written communication skills, analytical skills, technical writing, the ability to self-direct work; : Limerick Institute of Technology M.Eng,  Manufacturing/Maintenance Engineering 2010  – 2012 Project title \"A statistical analysis of Irish maintenance management practices\" \nResearched the maintenance/asset management practices of 100+ manufacturing organisations in Ireland \nKey areas of study included production optimisation, modern manufacturing technologies, increasing manufacturing throughputs, strategic maintenance management \nCore skills developed include project planning/management, self-motivation, effective written communication skills, analytical skills, technical writing, the ability to self-direct work; : Limerick Institute of Technology B.Eng (Hons),  Mechanical/Facilities Engineering 2006-2010 2006  – 2010 First Class Honours Degree (1.1) \nResearch projects included \" An investigation into industrial thermal energy recovery\" - Conducted a case study involving Aughinish Alumina \nGroup projects include fixture design and BMS design Limerick Institute of Technology B.Eng (Hons),  Mechanical/Facilities Engineering 2006-2010 2006  – 2010 First Class Honours Degree (1.1) \nResearch projects included \" An investigation into industrial thermal energy recovery\" - Conducted a case study involving Aughinish Alumina \nGroup projects include fixture design and BMS design Limerick Institute of Technology B.Eng (Hons),  Mechanical/Facilities Engineering 2006-2010 2006  – 2010 First Class Honours Degree (1.1) \nResearch projects included \" An investigation into industrial thermal energy recovery\" - Conducted a case study involving Aughinish Alumina \nGroup projects include fixture design and BMS design Crescent College Comprehensive 2001  – 2006 Crescent College Comprehensive 2001  – 2006 Crescent College Comprehensive 2001  – 2006 St. Pauls National School St. Pauls National School St. Pauls National School ", "Summary I love to work with people, and especially to find and eliminate frustrations in business operations. I believe that technical work is challenging enough to not have to add complexities in how it gets done to the mix! I've been in industry for 15+ years, and thrive on new experiences and meeting new people. \n \nAs the founder and principal of Andrea Jones Consulting, I help businesses eliminate waste in their operations and processes. Wastes of time, unnecessary rework, standardizing work (same each time), clarifying Roles and Responsibilities. My clients are the experts in the product or service they provide, but I help them get it done as efficiently as possible. In other words, clients provide the \"what,\" but I help with the \"how.\" \n \nOur focus at AJC is to enable organizations to effectively implement work given the unique culture in which companies operate, and with the *actual* employees in the organization. My personal expertise is Process Improvement, but at AJC we can do all the following: \n \n•Project Management \n•Process Design, Evaluation, Improvement for multiple segments including manufacturing, operations, general business, and services. \n•Operational Efficiency \n•Technical Training \n•Quality Review \n \nSpecialties: Manufacturing & Operations, Six Sigma, Lean Green Belt, Project Management, Lean Enterprise Self Assessment, product mix analysis, significant data analysis, software requirements documentation, white paper author, ISO9000, Process Mapping, Value Stream Mapping, Performance Metrics, Performance Scorecards, Roadmapping, Requirements Gathering, White Papers, Team Facilitation Summary I love to work with people, and especially to find and eliminate frustrations in business operations. I believe that technical work is challenging enough to not have to add complexities in how it gets done to the mix! I've been in industry for 15+ years, and thrive on new experiences and meeting new people. \n \nAs the founder and principal of Andrea Jones Consulting, I help businesses eliminate waste in their operations and processes. Wastes of time, unnecessary rework, standardizing work (same each time), clarifying Roles and Responsibilities. My clients are the experts in the product or service they provide, but I help them get it done as efficiently as possible. In other words, clients provide the \"what,\" but I help with the \"how.\" \n \nOur focus at AJC is to enable organizations to effectively implement work given the unique culture in which companies operate, and with the *actual* employees in the organization. My personal expertise is Process Improvement, but at AJC we can do all the following: \n \n•Project Management \n•Process Design, Evaluation, Improvement for multiple segments including manufacturing, operations, general business, and services. \n•Operational Efficiency \n•Technical Training \n•Quality Review \n \nSpecialties: Manufacturing & Operations, Six Sigma, Lean Green Belt, Project Management, Lean Enterprise Self Assessment, product mix analysis, significant data analysis, software requirements documentation, white paper author, ISO9000, Process Mapping, Value Stream Mapping, Performance Metrics, Performance Scorecards, Roadmapping, Requirements Gathering, White Papers, Team Facilitation I love to work with people, and especially to find and eliminate frustrations in business operations. I believe that technical work is challenging enough to not have to add complexities in how it gets done to the mix! I've been in industry for 15+ years, and thrive on new experiences and meeting new people. \n \nAs the founder and principal of Andrea Jones Consulting, I help businesses eliminate waste in their operations and processes. Wastes of time, unnecessary rework, standardizing work (same each time), clarifying Roles and Responsibilities. My clients are the experts in the product or service they provide, but I help them get it done as efficiently as possible. In other words, clients provide the \"what,\" but I help with the \"how.\" \n \nOur focus at AJC is to enable organizations to effectively implement work given the unique culture in which companies operate, and with the *actual* employees in the organization. My personal expertise is Process Improvement, but at AJC we can do all the following: \n \n•Project Management \n•Process Design, Evaluation, Improvement for multiple segments including manufacturing, operations, general business, and services. \n•Operational Efficiency \n•Technical Training \n•Quality Review \n \nSpecialties: Manufacturing & Operations, Six Sigma, Lean Green Belt, Project Management, Lean Enterprise Self Assessment, product mix analysis, significant data analysis, software requirements documentation, white paper author, ISO9000, Process Mapping, Value Stream Mapping, Performance Metrics, Performance Scorecards, Roadmapping, Requirements Gathering, White Papers, Team Facilitation I love to work with people, and especially to find and eliminate frustrations in business operations. I believe that technical work is challenging enough to not have to add complexities in how it gets done to the mix! I've been in industry for 15+ years, and thrive on new experiences and meeting new people. \n \nAs the founder and principal of Andrea Jones Consulting, I help businesses eliminate waste in their operations and processes. Wastes of time, unnecessary rework, standardizing work (same each time), clarifying Roles and Responsibilities. My clients are the experts in the product or service they provide, but I help them get it done as efficiently as possible. In other words, clients provide the \"what,\" but I help with the \"how.\" \n \nOur focus at AJC is to enable organizations to effectively implement work given the unique culture in which companies operate, and with the *actual* employees in the organization. My personal expertise is Process Improvement, but at AJC we can do all the following: \n \n•Project Management \n•Process Design, Evaluation, Improvement for multiple segments including manufacturing, operations, general business, and services. \n•Operational Efficiency \n•Technical Training \n•Quality Review \n \nSpecialties: Manufacturing & Operations, Six Sigma, Lean Green Belt, Project Management, Lean Enterprise Self Assessment, product mix analysis, significant data analysis, software requirements documentation, white paper author, ISO9000, Process Mapping, Value Stream Mapping, Performance Metrics, Performance Scorecards, Roadmapping, Requirements Gathering, White Papers, Team Facilitation Experience Principal Andrea Jones Consulting October 2006  – Present (8 years 11 months) Portland, OR Andrea loves to find and eliminate waste in operational business processes. She is high energy, enjoys working with people, and thrives in dynamic and complex environments. Consultant - Business Processes, Quality Review, Technical Training & Workshops Genentech March 2012  –  September 2014  (2 years 7 months) Hillsboro, OR Several projects completed during this timeframe: DMAIC on an operational process, quality review liaison for an internal debottlenecking project, creating a technical training for another business process, and organizing a global workshop on the same technical process. Details available upon request. Business Process Consultant McKinstry August 2011  –  November 2011  (4 months) Hillsboro, OR Reviewing, creating, and improving business processes for a new satellite office in Hillsboro supporting Majors Construction. Consultant - Project Manager Genentech 2008  –  2011  (3 years) Hillsboro, OR Andrea acted as an Owner’s Representative Project Manager for the Central Utility Plant of Genentech’s Hillsboro Technical Operations facility. In this project, Andrea successfully managed installation to client turnover of several large mechanical and electrical systems; a scope of over $100MM in capital equipment and service contractors. In this project, Andrea worked with technical team members, clients, contractors, and other project managers to ensure that all details were completed to the customer’s satisfaction, including one-year warranty remediation for all systems in her scope. President LEX Group, LLC September 2006  –  December 2009  (3 years 4 months) Stylex is the latest in consumer fitness technology. It is the link between your exercise equipment and the ubiquitous personal mulitimedia devices (laptops, PDA's, mp3 players, dvd viewers, etc.) Stylex provides a way to securely mount your device to the exercise machine to allow ergonomic access to the personal device. At last, you can stay connected while exercising! Market Intelligence Analyst for Digital Health Intel Corporation May 2006  –  October 2006  (6 months) Market Intelligence Analyst, Corporate Market Research supporting Digital Health Group\t2006 \n•\tSynthesized proprietary and secondary research for quantitative and qualitative decision making support for product development, Go-To-Market strategies, and competitive planning \n•\tDrove Cost/Benefit Analysis for new product initiatives and ensured data-driven arguments for and against increasing scope of Digital Health group \n•\tPrepared presentation materials for Executive Level Marketing and Product Line meetings Project Manager (MBA/MS Internship) Honeywell Corporation June 2005  –  January 2006  (8 months) Project Manager in Production Engine Assembly & Test, MBA/MS in Engineering Intern 2005 – 2006 \n•\tDeveloped, designed, and introduced Web Test Aid product that reduced test time by 10%, improved test method standardization, and minimized human error \n•\tLead team of 7 mechanics to design, analyze, and implement Lean engine assembly line layout \n•\tAchieved Honeywell Lean/Six Sigma Green Belt certification Process Engineer, Software Program Management Intel Corporation January 2003  –  June 2004  (1 year 6 months) High Volume Manufacturing Process Engineer Intel Corporation September 2000  –  December 2003  (3 years 4 months) Principal Andrea Jones Consulting October 2006  – Present (8 years 11 months) Portland, OR Andrea loves to find and eliminate waste in operational business processes. She is high energy, enjoys working with people, and thrives in dynamic and complex environments. Principal Andrea Jones Consulting October 2006  – Present (8 years 11 months) Portland, OR Andrea loves to find and eliminate waste in operational business processes. She is high energy, enjoys working with people, and thrives in dynamic and complex environments. Consultant - Business Processes, Quality Review, Technical Training & Workshops Genentech March 2012  –  September 2014  (2 years 7 months) Hillsboro, OR Several projects completed during this timeframe: DMAIC on an operational process, quality review liaison for an internal debottlenecking project, creating a technical training for another business process, and organizing a global workshop on the same technical process. Details available upon request. Consultant - Business Processes, Quality Review, Technical Training & Workshops Genentech March 2012  –  September 2014  (2 years 7 months) Hillsboro, OR Several projects completed during this timeframe: DMAIC on an operational process, quality review liaison for an internal debottlenecking project, creating a technical training for another business process, and organizing a global workshop on the same technical process. Details available upon request. Business Process Consultant McKinstry August 2011  –  November 2011  (4 months) Hillsboro, OR Reviewing, creating, and improving business processes for a new satellite office in Hillsboro supporting Majors Construction. Business Process Consultant McKinstry August 2011  –  November 2011  (4 months) Hillsboro, OR Reviewing, creating, and improving business processes for a new satellite office in Hillsboro supporting Majors Construction. Consultant - Project Manager Genentech 2008  –  2011  (3 years) Hillsboro, OR Andrea acted as an Owner’s Representative Project Manager for the Central Utility Plant of Genentech’s Hillsboro Technical Operations facility. In this project, Andrea successfully managed installation to client turnover of several large mechanical and electrical systems; a scope of over $100MM in capital equipment and service contractors. In this project, Andrea worked with technical team members, clients, contractors, and other project managers to ensure that all details were completed to the customer’s satisfaction, including one-year warranty remediation for all systems in her scope. Consultant - Project Manager Genentech 2008  –  2011  (3 years) Hillsboro, OR Andrea acted as an Owner’s Representative Project Manager for the Central Utility Plant of Genentech’s Hillsboro Technical Operations facility. In this project, Andrea successfully managed installation to client turnover of several large mechanical and electrical systems; a scope of over $100MM in capital equipment and service contractors. In this project, Andrea worked with technical team members, clients, contractors, and other project managers to ensure that all details were completed to the customer’s satisfaction, including one-year warranty remediation for all systems in her scope. President LEX Group, LLC September 2006  –  December 2009  (3 years 4 months) Stylex is the latest in consumer fitness technology. It is the link between your exercise equipment and the ubiquitous personal mulitimedia devices (laptops, PDA's, mp3 players, dvd viewers, etc.) Stylex provides a way to securely mount your device to the exercise machine to allow ergonomic access to the personal device. At last, you can stay connected while exercising! President LEX Group, LLC September 2006  –  December 2009  (3 years 4 months) Stylex is the latest in consumer fitness technology. It is the link between your exercise equipment and the ubiquitous personal mulitimedia devices (laptops, PDA's, mp3 players, dvd viewers, etc.) Stylex provides a way to securely mount your device to the exercise machine to allow ergonomic access to the personal device. At last, you can stay connected while exercising! Market Intelligence Analyst for Digital Health Intel Corporation May 2006  –  October 2006  (6 months) Market Intelligence Analyst, Corporate Market Research supporting Digital Health Group\t2006 \n•\tSynthesized proprietary and secondary research for quantitative and qualitative decision making support for product development, Go-To-Market strategies, and competitive planning \n•\tDrove Cost/Benefit Analysis for new product initiatives and ensured data-driven arguments for and against increasing scope of Digital Health group \n•\tPrepared presentation materials for Executive Level Marketing and Product Line meetings Market Intelligence Analyst for Digital Health Intel Corporation May 2006  –  October 2006  (6 months) Market Intelligence Analyst, Corporate Market Research supporting Digital Health Group\t2006 \n•\tSynthesized proprietary and secondary research for quantitative and qualitative decision making support for product development, Go-To-Market strategies, and competitive planning \n•\tDrove Cost/Benefit Analysis for new product initiatives and ensured data-driven arguments for and against increasing scope of Digital Health group \n•\tPrepared presentation materials for Executive Level Marketing and Product Line meetings Project Manager (MBA/MS Internship) Honeywell Corporation June 2005  –  January 2006  (8 months) Project Manager in Production Engine Assembly & Test, MBA/MS in Engineering Intern 2005 – 2006 \n•\tDeveloped, designed, and introduced Web Test Aid product that reduced test time by 10%, improved test method standardization, and minimized human error \n•\tLead team of 7 mechanics to design, analyze, and implement Lean engine assembly line layout \n•\tAchieved Honeywell Lean/Six Sigma Green Belt certification Project Manager (MBA/MS Internship) Honeywell Corporation June 2005  –  January 2006  (8 months) Project Manager in Production Engine Assembly & Test, MBA/MS in Engineering Intern 2005 – 2006 \n•\tDeveloped, designed, and introduced Web Test Aid product that reduced test time by 10%, improved test method standardization, and minimized human error \n•\tLead team of 7 mechanics to design, analyze, and implement Lean engine assembly line layout \n•\tAchieved Honeywell Lean/Six Sigma Green Belt certification Process Engineer, Software Program Management Intel Corporation January 2003  –  June 2004  (1 year 6 months) Process Engineer, Software Program Management Intel Corporation January 2003  –  June 2004  (1 year 6 months) High Volume Manufacturing Process Engineer Intel Corporation September 2000  –  December 2003  (3 years 4 months) High Volume Manufacturing Process Engineer Intel Corporation September 2000  –  December 2003  (3 years 4 months) Languages Japanese Limited working proficiency Chinese (Mandarin) Elementary proficiency Japanese Limited working proficiency Chinese (Mandarin) Elementary proficiency Japanese Limited working proficiency Chinese (Mandarin) Elementary proficiency Limited working proficiency Elementary proficiency Skills Project Management... Business Process Design Business Process... Project Management Business Process Mapping Value Stream Mapping Process Improvement Strategy Manufacturing PMP User-centered Design Six Sigma Iso 9000 Program Management Project Planning MS Project Business Process Requirements Gathering Product Management User Experience Lean Manufacturing Supply Chain Management Performance Metrics Management Consulting Management See 10+     See less Skills  Project Management... Business Process Design Business Process... Project Management Business Process Mapping Value Stream Mapping Process Improvement Strategy Manufacturing PMP User-centered Design Six Sigma Iso 9000 Program Management Project Planning MS Project Business Process Requirements Gathering Product Management User Experience Lean Manufacturing Supply Chain Management Performance Metrics Management Consulting Management See 10+     See less Project Management... Business Process Design Business Process... Project Management Business Process Mapping Value Stream Mapping Process Improvement Strategy Manufacturing PMP User-centered Design Six Sigma Iso 9000 Program Management Project Planning MS Project Business Process Requirements Gathering Product Management User Experience Lean Manufacturing Supply Chain Management Performance Metrics Management Consulting Management See 10+     See less Project Management... Business Process Design Business Process... Project Management Business Process Mapping Value Stream Mapping Process Improvement Strategy Manufacturing PMP User-centered Design Six Sigma Iso 9000 Program Management Project Planning MS Project Business Process Requirements Gathering Product Management User Experience Lean Manufacturing Supply Chain Management Performance Metrics Management Consulting Management See 10+     See less Education Massachusetts Institute of Technology SM,  Engineering Systems Division 2004  – 2006 Focus in Lean Enterprise, Supply Chain & Operations, Product Development, Marketing Activities and Societies:  Global Labs ,  Hockey ,  Plant Tour Committee Massachusetts Institute of Technology - Sloan School of Management MBA,  Business 2004  – 2006 Focus in Lean Enterprise, Supply Chain & Operations, Product Development, Marketing Activities and Societies:  Strategy & Vision Committee: Student Chair of Partner Company Recruiting and Retention Subcommittee\nSloan Women in Management\nPlant Tour Committee University of Oregon MS,  Chemistry 2000  – 2001 Masters in Chemistry focusing on Semiconductor Processing. Activities and Societies:  Mortar Board ,  Key Club University of Oregon Bachelors,  Chemistry and Japanese 1996  – 2000 Lived in Tokyo, Japan with a host family for a year as an exchange student at Waseda University (Japanese speaker) \nPresidential Award for Honors College Thesis (passed with distinction) \nsumma cum laude Activities and Societies:  Phi Beta Kappa\nMortar Board Society\nKey Club Massachusetts Institute of Technology SM,  Engineering Systems Division 2004  – 2006 Focus in Lean Enterprise, Supply Chain & Operations, Product Development, Marketing Activities and Societies:  Global Labs ,  Hockey ,  Plant Tour Committee Massachusetts Institute of Technology SM,  Engineering Systems Division 2004  – 2006 Focus in Lean Enterprise, Supply Chain & Operations, Product Development, Marketing Activities and Societies:  Global Labs ,  Hockey ,  Plant Tour Committee Massachusetts Institute of Technology SM,  Engineering Systems Division 2004  – 2006 Focus in Lean Enterprise, Supply Chain & Operations, Product Development, Marketing Activities and Societies:  Global Labs ,  Hockey ,  Plant Tour Committee Massachusetts Institute of Technology - Sloan School of Management MBA,  Business 2004  – 2006 Focus in Lean Enterprise, Supply Chain & Operations, Product Development, Marketing Activities and Societies:  Strategy & Vision Committee: Student Chair of Partner Company Recruiting and Retention Subcommittee\nSloan Women in Management\nPlant Tour Committee Massachusetts Institute of Technology - Sloan School of Management MBA,  Business 2004  – 2006 Focus in Lean Enterprise, Supply Chain & Operations, Product Development, Marketing Activities and Societies:  Strategy & Vision Committee: Student Chair of Partner Company Recruiting and Retention Subcommittee\nSloan Women in Management\nPlant Tour Committee Massachusetts Institute of Technology - Sloan School of Management MBA,  Business 2004  – 2006 Focus in Lean Enterprise, Supply Chain & Operations, Product Development, Marketing Activities and Societies:  Strategy & Vision Committee: Student Chair of Partner Company Recruiting and Retention Subcommittee\nSloan Women in Management\nPlant Tour Committee University of Oregon MS,  Chemistry 2000  – 2001 Masters in Chemistry focusing on Semiconductor Processing. Activities and Societies:  Mortar Board ,  Key Club University of Oregon MS,  Chemistry 2000  – 2001 Masters in Chemistry focusing on Semiconductor Processing. Activities and Societies:  Mortar Board ,  Key Club University of Oregon MS,  Chemistry 2000  – 2001 Masters in Chemistry focusing on Semiconductor Processing. Activities and Societies:  Mortar Board ,  Key Club University of Oregon Bachelors,  Chemistry and Japanese 1996  – 2000 Lived in Tokyo, Japan with a host family for a year as an exchange student at Waseda University (Japanese speaker) \nPresidential Award for Honors College Thesis (passed with distinction) \nsumma cum laude Activities and Societies:  Phi Beta Kappa\nMortar Board Society\nKey Club University of Oregon Bachelors,  Chemistry and Japanese 1996  – 2000 Lived in Tokyo, Japan with a host family for a year as an exchange student at Waseda University (Japanese speaker) \nPresidential Award for Honors College Thesis (passed with distinction) \nsumma cum laude Activities and Societies:  Phi Beta Kappa\nMortar Board Society\nKey Club University of Oregon Bachelors,  Chemistry and Japanese 1996  – 2000 Lived in Tokyo, Japan with a host family for a year as an exchange student at Waseda University (Japanese speaker) \nPresidential Award for Honors College Thesis (passed with distinction) \nsumma cum laude Activities and Societies:  Phi Beta Kappa\nMortar Board Society\nKey Club Honors & Awards Additional Honors & Awards University of Oregon Materials Science Institute Outstanding Alumnus - October, 2006 \nLean/Six Sigma Green Belt, Honeywell 12/2005 \nPhi Beta Kappa, 2000 Additional Honors & Awards University of Oregon Materials Science Institute Outstanding Alumnus - October, 2006 \nLean/Six Sigma Green Belt, Honeywell 12/2005 \nPhi Beta Kappa, 2000 Additional Honors & Awards University of Oregon Materials Science Institute Outstanding Alumnus - October, 2006 \nLean/Six Sigma Green Belt, Honeywell 12/2005 \nPhi Beta Kappa, 2000 Additional Honors & Awards University of Oregon Materials Science Institute Outstanding Alumnus - October, 2006 \nLean/Six Sigma Green Belt, Honeywell 12/2005 \nPhi Beta Kappa, 2000 ", "Experience Manufacturing engineer Intel Corporation October 2010  – Present (4 years 11 months) •\tWorked as ME on Romley generation commercial and Greenlow SRP/CRB products.  \n•\tDFM review on brd file using Valor and Cadence tool before tape out, provide feedbacks to design team and drive DFM violation closure and mitigation plan approval.  \n•\tWork with factory manufacturing and engineering team on the product and process FMEA, work out mitigation plan for those waived DFM violation items.  \n•\tReview and approve factory PMP \n•\tRelease design manufacturing spec (DMS) to factory for each NPI build. Define packaging label content and specific assembly process in the DMS.  \n•\tCreate baseboard top assembly (TA) BOM in the SPEED for factory download \n•\tDefine system level sku matrix with internal team for each system NPI build and release the matrix to factory to prepare the BOM and material. \n•\tOn site in factory to do first article inspection or remote review electrical FAI for each NPI build before shipment \n•\tReview yield data and failure information for each build, drive quality issues closure related to product and manufacturing process. \n•\tSite cert for new technology, new site start up involvement. Worked with quality team and factory team to define the cert plan and approval per yield and reliability data. Customer program manager (Department job rotation and additional job coverage) Intel Asia-Pacific Research & Development Ltd December 2011  –  July 2012  (8 months) •\tWorked as CPM on Romley EN commercial products.  \n•\tSet up master material (MM#) in system based on product sku information from marketing for BOM set up and sales purpose.  \n•\tAs rep for operation team in product development team (PDT) meeting to coordinate all operation related tasks and understand the project milestones \n•\tCollect team units information from PDT members, work out NPI build schedule with factory based on PDT validation test timeline and material readiness, and follow up team units shipment status after build \n•\tCoordinate operation team inputs on build schedule, material, cost, manufacturing and test on beta, silver and gold build for management review.  \n•\tWork with material team to ship consigned materials to system assembly factory. Review material status report from factory for overall material status for each BIK/KDK build. \n•\tResponsible for all factory issues closure during NPI builds and make sure finish goods shipment meet schedule \n•\tDrive factory capacity to support NPI builds per schedule and make priority for different build if any conflict. Supplier Quality Engineer/Manufacturing Process Engineer Intel Corporation May 2003  –  September 2010  (7 years 5 months) Shanghai •\tFactory manufacturing process management. Process management plan, CTF parameters SPC control and process change review and approval. \n•\tProblem solving. Customer complaint issues, material quality issues and manufacturing process issues management, as coordinator to work with internal/ODM team  \n•\tSupplier operation data review. Weekly review supplier capacity, delivery, quality and scrap cost data with internal and external team.  \n•\tConduct supplier quality system and process audit, support ad-hoc customer on site audit. \n•\tLead and drive suppliers on the continuous improvement projects to achieve higher quality and lower operation cost goal. \n•\tCommunicate Intel desktop/notebook motherboards technical requirements to suppliers. Deliver on site trainings to suppliers.  \n•\tNPI (new product introduction) engagement. New product site cert assembly/reliability data collection and review. FMEA review and final pilot data review. \n•\tLead internal cross site meeting to review internal project status, excursion detail and BKM sharing, and technical requirements discuss and define. Manufacturing engineer Intel Corporation October 2010  – Present (4 years 11 months) •\tWorked as ME on Romley generation commercial and Greenlow SRP/CRB products.  \n•\tDFM review on brd file using Valor and Cadence tool before tape out, provide feedbacks to design team and drive DFM violation closure and mitigation plan approval.  \n•\tWork with factory manufacturing and engineering team on the product and process FMEA, work out mitigation plan for those waived DFM violation items.  \n•\tReview and approve factory PMP \n•\tRelease design manufacturing spec (DMS) to factory for each NPI build. Define packaging label content and specific assembly process in the DMS.  \n•\tCreate baseboard top assembly (TA) BOM in the SPEED for factory download \n•\tDefine system level sku matrix with internal team for each system NPI build and release the matrix to factory to prepare the BOM and material. \n•\tOn site in factory to do first article inspection or remote review electrical FAI for each NPI build before shipment \n•\tReview yield data and failure information for each build, drive quality issues closure related to product and manufacturing process. \n•\tSite cert for new technology, new site start up involvement. Worked with quality team and factory team to define the cert plan and approval per yield and reliability data. Manufacturing engineer Intel Corporation October 2010  – Present (4 years 11 months) •\tWorked as ME on Romley generation commercial and Greenlow SRP/CRB products.  \n•\tDFM review on brd file using Valor and Cadence tool before tape out, provide feedbacks to design team and drive DFM violation closure and mitigation plan approval.  \n•\tWork with factory manufacturing and engineering team on the product and process FMEA, work out mitigation plan for those waived DFM violation items.  \n•\tReview and approve factory PMP \n•\tRelease design manufacturing spec (DMS) to factory for each NPI build. Define packaging label content and specific assembly process in the DMS.  \n•\tCreate baseboard top assembly (TA) BOM in the SPEED for factory download \n•\tDefine system level sku matrix with internal team for each system NPI build and release the matrix to factory to prepare the BOM and material. \n•\tOn site in factory to do first article inspection or remote review electrical FAI for each NPI build before shipment \n•\tReview yield data and failure information for each build, drive quality issues closure related to product and manufacturing process. \n•\tSite cert for new technology, new site start up involvement. Worked with quality team and factory team to define the cert plan and approval per yield and reliability data. Customer program manager (Department job rotation and additional job coverage) Intel Asia-Pacific Research & Development Ltd December 2011  –  July 2012  (8 months) •\tWorked as CPM on Romley EN commercial products.  \n•\tSet up master material (MM#) in system based on product sku information from marketing for BOM set up and sales purpose.  \n•\tAs rep for operation team in product development team (PDT) meeting to coordinate all operation related tasks and understand the project milestones \n•\tCollect team units information from PDT members, work out NPI build schedule with factory based on PDT validation test timeline and material readiness, and follow up team units shipment status after build \n•\tCoordinate operation team inputs on build schedule, material, cost, manufacturing and test on beta, silver and gold build for management review.  \n•\tWork with material team to ship consigned materials to system assembly factory. Review material status report from factory for overall material status for each BIK/KDK build. \n•\tResponsible for all factory issues closure during NPI builds and make sure finish goods shipment meet schedule \n•\tDrive factory capacity to support NPI builds per schedule and make priority for different build if any conflict. Customer program manager (Department job rotation and additional job coverage) Intel Asia-Pacific Research & Development Ltd December 2011  –  July 2012  (8 months) •\tWorked as CPM on Romley EN commercial products.  \n•\tSet up master material (MM#) in system based on product sku information from marketing for BOM set up and sales purpose.  \n•\tAs rep for operation team in product development team (PDT) meeting to coordinate all operation related tasks and understand the project milestones \n•\tCollect team units information from PDT members, work out NPI build schedule with factory based on PDT validation test timeline and material readiness, and follow up team units shipment status after build \n•\tCoordinate operation team inputs on build schedule, material, cost, manufacturing and test on beta, silver and gold build for management review.  \n•\tWork with material team to ship consigned materials to system assembly factory. Review material status report from factory for overall material status for each BIK/KDK build. \n•\tResponsible for all factory issues closure during NPI builds and make sure finish goods shipment meet schedule \n•\tDrive factory capacity to support NPI builds per schedule and make priority for different build if any conflict. Supplier Quality Engineer/Manufacturing Process Engineer Intel Corporation May 2003  –  September 2010  (7 years 5 months) Shanghai •\tFactory manufacturing process management. Process management plan, CTF parameters SPC control and process change review and approval. \n•\tProblem solving. Customer complaint issues, material quality issues and manufacturing process issues management, as coordinator to work with internal/ODM team  \n•\tSupplier operation data review. Weekly review supplier capacity, delivery, quality and scrap cost data with internal and external team.  \n•\tConduct supplier quality system and process audit, support ad-hoc customer on site audit. \n•\tLead and drive suppliers on the continuous improvement projects to achieve higher quality and lower operation cost goal. \n•\tCommunicate Intel desktop/notebook motherboards technical requirements to suppliers. Deliver on site trainings to suppliers.  \n•\tNPI (new product introduction) engagement. New product site cert assembly/reliability data collection and review. FMEA review and final pilot data review. \n•\tLead internal cross site meeting to review internal project status, excursion detail and BKM sharing, and technical requirements discuss and define. Supplier Quality Engineer/Manufacturing Process Engineer Intel Corporation May 2003  –  September 2010  (7 years 5 months) Shanghai •\tFactory manufacturing process management. Process management plan, CTF parameters SPC control and process change review and approval. \n•\tProblem solving. Customer complaint issues, material quality issues and manufacturing process issues management, as coordinator to work with internal/ODM team  \n•\tSupplier operation data review. Weekly review supplier capacity, delivery, quality and scrap cost data with internal and external team.  \n•\tConduct supplier quality system and process audit, support ad-hoc customer on site audit. \n•\tLead and drive suppliers on the continuous improvement projects to achieve higher quality and lower operation cost goal. \n•\tCommunicate Intel desktop/notebook motherboards technical requirements to suppliers. Deliver on site trainings to suppliers.  \n•\tNPI (new product introduction) engagement. New product site cert assembly/reliability data collection and review. FMEA review and final pilot data review. \n•\tLead internal cross site meeting to review internal project status, excursion detail and BKM sharing, and technical requirements discuss and define. Skills Product Management Engineering Management Management Manufacturing Training SPC Semiconductors FMEA Continuous Improvement Program Management Failure Analysis Process Improvement Materials Science Characterization Design of Experiments Quality Management Engineering Product Development Cross-functional Team... Lean Manufacturing Project Management JMP See 7+     See less Skills  Product Management Engineering Management Management Manufacturing Training SPC Semiconductors FMEA Continuous Improvement Program Management Failure Analysis Process Improvement Materials Science Characterization Design of Experiments Quality Management Engineering Product Development Cross-functional Team... Lean Manufacturing Project Management JMP See 7+     See less Product Management Engineering Management Management Manufacturing Training SPC Semiconductors FMEA Continuous Improvement Program Management Failure Analysis Process Improvement Materials Science Characterization Design of Experiments Quality Management Engineering Product Development Cross-functional Team... Lean Manufacturing Project Management JMP See 7+     See less Product Management Engineering Management Management Manufacturing Training SPC Semiconductors FMEA Continuous Improvement Program Management Failure Analysis Process Improvement Materials Science Characterization Design of Experiments Quality Management Engineering Product Development Cross-functional Team... Lean Manufacturing Project Management JMP See 7+     See less Education Zhejiang University Master,  Polymer Chemistry and Physics 2000  – 2003 Zhejiang University Bachelor,  Polymer material science 1996  – 2000 Jiangsu changshu high school 1993  – 1996 Zhejiang University Master,  Polymer Chemistry and Physics 2000  – 2003 Zhejiang University Master,  Polymer Chemistry and Physics 2000  – 2003 Zhejiang University Master,  Polymer Chemistry and Physics 2000  – 2003 Zhejiang University Bachelor,  Polymer material science 1996  – 2000 Zhejiang University Bachelor,  Polymer material science 1996  – 2000 Zhejiang University Bachelor,  Polymer material science 1996  – 2000 Jiangsu changshu high school 1993  – 1996 Jiangsu changshu high school 1993  – 1996 Jiangsu changshu high school 1993  – 1996 ", "Summary Accomplished record as a high-level strategic thinker, business development and sales manager. Unique combination of technical engineering background, progressive leadership experience, and strong business acumen. Summary Accomplished record as a high-level strategic thinker, business development and sales manager. Unique combination of technical engineering background, progressive leadership experience, and strong business acumen. Accomplished record as a high-level strategic thinker, business development and sales manager. Unique combination of technical engineering background, progressive leadership experience, and strong business acumen. Accomplished record as a high-level strategic thinker, business development and sales manager. Unique combination of technical engineering background, progressive leadership experience, and strong business acumen. Experience Regional Project Manager / Project Engineer Hilti August 2006  –  December 2012  (6 years 5 months) Phoenix, AZ. / Las Vegas, NV. Statistcal Process Controller / Assembly Technology Development Manufacturing Process Engineer Intel Corporation June 2004  –  August 2006  (2 years 3 months) Research, Development and Design Engineer Spectranetics January 2003  –  June 2004  (1 year 6 months) Regional Project Manager / Project Engineer Hilti August 2006  –  December 2012  (6 years 5 months) Phoenix, AZ. / Las Vegas, NV. Regional Project Manager / Project Engineer Hilti August 2006  –  December 2012  (6 years 5 months) Phoenix, AZ. / Las Vegas, NV. Statistcal Process Controller / Assembly Technology Development Manufacturing Process Engineer Intel Corporation June 2004  –  August 2006  (2 years 3 months) Statistcal Process Controller / Assembly Technology Development Manufacturing Process Engineer Intel Corporation June 2004  –  August 2006  (2 years 3 months) Research, Development and Design Engineer Spectranetics January 2003  –  June 2004  (1 year 6 months) Research, Development and Design Engineer Spectranetics January 2003  –  June 2004  (1 year 6 months) Skills Negotiation Cross-functional Team... Forecasting Team Leadership Business Strategy Budgets Management Marketing Strategy Sales Operations Selling Sales Management Business Development Skills  Negotiation Cross-functional Team... Forecasting Team Leadership Business Strategy Budgets Management Marketing Strategy Sales Operations Selling Sales Management Business Development Negotiation Cross-functional Team... Forecasting Team Leadership Business Strategy Budgets Management Marketing Strategy Sales Operations Selling Sales Management Business Development Negotiation Cross-functional Team... Forecasting Team Leadership Business Strategy Budgets Management Marketing Strategy Sales Operations Selling Sales Management Business Development Education University of Phoenix Doctorate Business Management,  Strategic Decision Making Under Sustained Uncertainly 2012 University of Phoenix 2006\tMaster's,  Business Administration University of Colorado Bachelor's of Science,  Mechanical Engineering / Applied Mathematics 2004 University of Phoenix Doctorate Business Management,  Strategic Decision Making Under Sustained Uncertainly 2012 University of Phoenix Doctorate Business Management,  Strategic Decision Making Under Sustained Uncertainly 2012 University of Phoenix Doctorate Business Management,  Strategic Decision Making Under Sustained Uncertainly 2012 University of Phoenix 2006\tMaster's,  Business Administration University of Phoenix 2006\tMaster's,  Business Administration University of Phoenix 2006\tMaster's,  Business Administration University of Colorado Bachelor's of Science,  Mechanical Engineering / Applied Mathematics 2004 University of Colorado Bachelor's of Science,  Mechanical Engineering / Applied Mathematics 2004 University of Colorado Bachelor's of Science,  Mechanical Engineering / Applied Mathematics 2004 ", "Summary Manufacturing process engineer with expertise in statistical process control, cost reduction, and quality improvement DOEs. Summary Manufacturing process engineer with expertise in statistical process control, cost reduction, and quality improvement DOEs. Manufacturing process engineer with expertise in statistical process control, cost reduction, and quality improvement DOEs. Manufacturing process engineer with expertise in statistical process control, cost reduction, and quality improvement DOEs. Experience Manufacturing Engineering Manager ASML June 2014  – Present (1 year 3 months) Greater San Diego Area EUV Lithography Source Manufacturing Development Sr Manufacturing Enigneer Cymer April 2011  –  June 2014  (3 years 3 months) EUV Lithography Source Manufacturing Development Manufacturing Process Engineer Intel Corporation January 2006  –  April 2011  (5 years 4 months) Process and Equipment owner of CMP Polish toolset for Test Wafer Regen \nResponsible for design of experiments surrounding quality improvement and cost reduction Process Sustaining Engineer Infineon Technologies August 2005  –  January 2006  (6 months) Metrology Department as Sustaining Engineer Manufacturing Engineering Manager ASML June 2014  – Present (1 year 3 months) Greater San Diego Area EUV Lithography Source Manufacturing Development Manufacturing Engineering Manager ASML June 2014  – Present (1 year 3 months) Greater San Diego Area EUV Lithography Source Manufacturing Development Sr Manufacturing Enigneer Cymer April 2011  –  June 2014  (3 years 3 months) EUV Lithography Source Manufacturing Development Sr Manufacturing Enigneer Cymer April 2011  –  June 2014  (3 years 3 months) EUV Lithography Source Manufacturing Development Manufacturing Process Engineer Intel Corporation January 2006  –  April 2011  (5 years 4 months) Process and Equipment owner of CMP Polish toolset for Test Wafer Regen \nResponsible for design of experiments surrounding quality improvement and cost reduction Manufacturing Process Engineer Intel Corporation January 2006  –  April 2011  (5 years 4 months) Process and Equipment owner of CMP Polish toolset for Test Wafer Regen \nResponsible for design of experiments surrounding quality improvement and cost reduction Process Sustaining Engineer Infineon Technologies August 2005  –  January 2006  (6 months) Metrology Department as Sustaining Engineer Process Sustaining Engineer Infineon Technologies August 2005  –  January 2006  (6 months) Metrology Department as Sustaining Engineer Skills SPC Design of Experiments Manufacturing Semiconductors Matlab Lean Manufacturing CMP Metrology Six Sigma Semiconductor Industry Engineering Management JMP Lithography Photolithography Root Cause Analysis Thin Films Electronics Characterization Failure Analysis Process Integration See 5+     See less Skills  SPC Design of Experiments Manufacturing Semiconductors Matlab Lean Manufacturing CMP Metrology Six Sigma Semiconductor Industry Engineering Management JMP Lithography Photolithography Root Cause Analysis Thin Films Electronics Characterization Failure Analysis Process Integration See 5+     See less SPC Design of Experiments Manufacturing Semiconductors Matlab Lean Manufacturing CMP Metrology Six Sigma Semiconductor Industry Engineering Management JMP Lithography Photolithography Root Cause Analysis Thin Films Electronics Characterization Failure Analysis Process Integration See 5+     See less SPC Design of Experiments Manufacturing Semiconductors Matlab Lean Manufacturing CMP Metrology Six Sigma Semiconductor Industry Engineering Management JMP Lithography Photolithography Root Cause Analysis Thin Films Electronics Characterization Failure Analysis Process Integration See 5+     See less Education University of Virginia MS,  Electrical and Computer Engineering 2003  – 2005 University of Virginia BS,  Electrical and Computer Engineering 1999  – 2003 Activities and Societies:  Rodman Scholar Nansemond Suffolk Academy University of Virginia MS,  Electrical and Computer Engineering 2003  – 2005 University of Virginia MS,  Electrical and Computer Engineering 2003  – 2005 University of Virginia MS,  Electrical and Computer Engineering 2003  – 2005 University of Virginia BS,  Electrical and Computer Engineering 1999  – 2003 Activities and Societies:  Rodman Scholar University of Virginia BS,  Electrical and Computer Engineering 1999  – 2003 Activities and Societies:  Rodman Scholar University of Virginia BS,  Electrical and Computer Engineering 1999  – 2003 Activities and Societies:  Rodman Scholar Nansemond Suffolk Academy Nansemond Suffolk Academy Nansemond Suffolk Academy ", "Experience Quality Engineer Golden Aluminum October 2014  – Present (11 months) Denver, CO Quality Manager and Metallurgist Alcoa April 2012  –  May 2014  (2 years 2 months) Executive Director Lifeline Puppy Rescue September 2007  –  January 2011  (3 years 5 months) Manufacturing Process Engineer Intel Corporation June 2004  –  September 2007  (3 years 4 months) Colorado Springs, Colorado Area Undergraduate Researcher University of Washington June 2002  –  August 2002  (3 months) Seattle, WA Metallurgical Engineer - Intern Alcoa July 2001  –  December 2001  (6 months) Davenport, Iowa Area Quality Engineer Golden Aluminum October 2014  – Present (11 months) Denver, CO Quality Engineer Golden Aluminum October 2014  – Present (11 months) Denver, CO Quality Manager and Metallurgist Alcoa April 2012  –  May 2014  (2 years 2 months) Quality Manager and Metallurgist Alcoa April 2012  –  May 2014  (2 years 2 months) Executive Director Lifeline Puppy Rescue September 2007  –  January 2011  (3 years 5 months) Executive Director Lifeline Puppy Rescue September 2007  –  January 2011  (3 years 5 months) Manufacturing Process Engineer Intel Corporation June 2004  –  September 2007  (3 years 4 months) Colorado Springs, Colorado Area Manufacturing Process Engineer Intel Corporation June 2004  –  September 2007  (3 years 4 months) Colorado Springs, Colorado Area Undergraduate Researcher University of Washington June 2002  –  August 2002  (3 months) Seattle, WA Undergraduate Researcher University of Washington June 2002  –  August 2002  (3 months) Seattle, WA Metallurgical Engineer - Intern Alcoa July 2001  –  December 2001  (6 months) Davenport, Iowa Area Metallurgical Engineer - Intern Alcoa July 2001  –  December 2001  (6 months) Davenport, Iowa Area Languages English Spanish English Spanish English Spanish Skills Microsoft Office Management Microsoft Excel Microsoft Word Research PowerPoint Sales Leadership Training Photoshop Technical Writing Public Speaking Presenting Proposals Project Management Conflict Resolution Continuous Improvement Lean Manufacturing Manufacturing Six Sigma Process Engineering Engineering Root Cause Analysis Materials Process Improvement 5S ISO Project Engineering SPC Cross-functional Team... Engineering Management Factory See 16+     See less Skills  Microsoft Office Management Microsoft Excel Microsoft Word Research PowerPoint Sales Leadership Training Photoshop Technical Writing Public Speaking Presenting Proposals Project Management Conflict Resolution Continuous Improvement Lean Manufacturing Manufacturing Six Sigma Process Engineering Engineering Root Cause Analysis Materials Process Improvement 5S ISO Project Engineering SPC Cross-functional Team... Engineering Management Factory See 16+     See less Microsoft Office Management Microsoft Excel Microsoft Word Research PowerPoint Sales Leadership Training Photoshop Technical Writing Public Speaking Presenting Proposals Project Management Conflict Resolution Continuous Improvement Lean Manufacturing Manufacturing Six Sigma Process Engineering Engineering Root Cause Analysis Materials Process Improvement 5S ISO Project Engineering SPC Cross-functional Team... Engineering Management Factory See 16+     See less Microsoft Office Management Microsoft Excel Microsoft Word Research PowerPoint Sales Leadership Training Photoshop Technical Writing Public Speaking Presenting Proposals Project Management Conflict Resolution Continuous Improvement Lean Manufacturing Manufacturing Six Sigma Process Engineering Engineering Root Cause Analysis Materials Process Improvement 5S ISO Project Engineering SPC Cross-functional Team... Engineering Management Factory See 16+     See less Education Colorado School of Mines Metallurgy and Materials Engineering,  Materials Science 1999  – 2004 Activities and Societies:  AISES ,  NSBE ,  SHPE Colorado School of Mines Metallurgy and Materials Engineering,  Materials Science 1999  – 2004 Activities and Societies:  AISES ,  NSBE ,  SHPE Colorado School of Mines Metallurgy and Materials Engineering,  Materials Science 1999  – 2004 Activities and Societies:  AISES ,  NSBE ,  SHPE Colorado School of Mines Metallurgy and Materials Engineering,  Materials Science 1999  – 2004 Activities and Societies:  AISES ,  NSBE ,  SHPE ", "Experience Group Supply Chain Manager - Americas and Asia Microsoft May 2013  – Present (2 years 4 months) Ft Lauderdale, Florida LATAM OEM Supply Chain Lead Microsoft July 2011  –  May 2013  (1 year 11 months) Miami/Fort Lauderdale Area Engineering and Facilities Group Manager Microsoft Puerto Rico July 2009  –  June 2011  (2 years) Data Center Manager Microsoft November 2007  –  September 2009  (1 year 11 months) Manufacturing Process Engineer Intel Corporation December 1997  –  December 1999  (2 years 1 month) Group Supply Chain Manager - Americas and Asia Microsoft May 2013  – Present (2 years 4 months) Ft Lauderdale, Florida Group Supply Chain Manager - Americas and Asia Microsoft May 2013  – Present (2 years 4 months) Ft Lauderdale, Florida LATAM OEM Supply Chain Lead Microsoft July 2011  –  May 2013  (1 year 11 months) Miami/Fort Lauderdale Area LATAM OEM Supply Chain Lead Microsoft July 2011  –  May 2013  (1 year 11 months) Miami/Fort Lauderdale Area Engineering and Facilities Group Manager Microsoft Puerto Rico July 2009  –  June 2011  (2 years) Engineering and Facilities Group Manager Microsoft Puerto Rico July 2009  –  June 2011  (2 years) Data Center Manager Microsoft November 2007  –  September 2009  (1 year 11 months) Data Center Manager Microsoft November 2007  –  September 2009  (1 year 11 months) Manufacturing Process Engineer Intel Corporation December 1997  –  December 1999  (2 years 1 month) Manufacturing Process Engineer Intel Corporation December 1997  –  December 1999  (2 years 1 month) Languages Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Operations Management Cloud Computing Program Management Supply Chain Management People Management Manufacturing Management Business Process... Data Center Deployment Project Portfolio... Facilities Management Security Management Process Management Process Engineering Vendor Management Process Improvement Cross-functional Team... Project Management Business Analysis System Deployment Six Sigma Management Project Planning Outsourcing Team Leadership Change Management Integration Supply Chain IT Service Management New Business Development Quality Assurance Service Delivery SharePoint Operating Budgets Capital Budgeting Manufacturing IT Strategy Continuous Improvement MS Project Manufacturing... Business Intelligence IT Operations IT Management See 28+     See less Skills  Operations Management Cloud Computing Program Management Supply Chain Management People Management Manufacturing Management Business Process... Data Center Deployment Project Portfolio... Facilities Management Security Management Process Management Process Engineering Vendor Management Process Improvement Cross-functional Team... Project Management Business Analysis System Deployment Six Sigma Management Project Planning Outsourcing Team Leadership Change Management Integration Supply Chain IT Service Management New Business Development Quality Assurance Service Delivery SharePoint Operating Budgets Capital Budgeting Manufacturing IT Strategy Continuous Improvement MS Project Manufacturing... Business Intelligence IT Operations IT Management See 28+     See less Operations Management Cloud Computing Program Management Supply Chain Management People Management Manufacturing Management Business Process... Data Center Deployment Project Portfolio... Facilities Management Security Management Process Management Process Engineering Vendor Management Process Improvement Cross-functional Team... Project Management Business Analysis System Deployment Six Sigma Management Project Planning Outsourcing Team Leadership Change Management Integration Supply Chain IT Service Management New Business Development Quality Assurance Service Delivery SharePoint Operating Budgets Capital Budgeting Manufacturing IT Strategy Continuous Improvement MS Project Manufacturing... Business Intelligence IT Operations IT Management See 28+     See less Operations Management Cloud Computing Program Management Supply Chain Management People Management Manufacturing Management Business Process... Data Center Deployment Project Portfolio... Facilities Management Security Management Process Management Process Engineering Vendor Management Process Improvement Cross-functional Team... Project Management Business Analysis System Deployment Six Sigma Management Project Planning Outsourcing Team Leadership Change Management Integration Supply Chain IT Service Management New Business Development Quality Assurance Service Delivery SharePoint Operating Budgets Capital Budgeting Manufacturing IT Strategy Continuous Improvement MS Project Manufacturing... Business Intelligence IT Operations IT Management See 28+     See less Education University of Puerto Rico-Mayaguez Bachelor's Degree,  Bachellor Science of Mechanical Engineering 1991  – 1996 University of Puerto Rico-Mayaguez Bachelor's Degree,  Bachellor Science of Mechanical Engineering 1991  – 1996 University of Puerto Rico-Mayaguez Bachelor's Degree,  Bachellor Science of Mechanical Engineering 1991  – 1996 University of Puerto Rico-Mayaguez Bachelor's Degree,  Bachellor Science of Mechanical Engineering 1991  – 1996 ", "Summary Industrial Engineer professional. Experienced in multinational industry of high-tech manufacturing, with great ability to work with multidisciplinary and inter-generational teams, obtaining excellent results. Creative and innovative that easily generates new instinctive ideas. Outstanding ability and willingness to learn quickly, work under pressure and adaptability to change. Methodical and analytic, committed to quality and accuracy in processes and procedures. Summary Industrial Engineer professional. Experienced in multinational industry of high-tech manufacturing, with great ability to work with multidisciplinary and inter-generational teams, obtaining excellent results. Creative and innovative that easily generates new instinctive ideas. Outstanding ability and willingness to learn quickly, work under pressure and adaptability to change. Methodical and analytic, committed to quality and accuracy in processes and procedures. Industrial Engineer professional. Experienced in multinational industry of high-tech manufacturing, with great ability to work with multidisciplinary and inter-generational teams, obtaining excellent results. Creative and innovative that easily generates new instinctive ideas. Outstanding ability and willingness to learn quickly, work under pressure and adaptability to change. Methodical and analytic, committed to quality and accuracy in processes and procedures. Industrial Engineer professional. Experienced in multinational industry of high-tech manufacturing, with great ability to work with multidisciplinary and inter-generational teams, obtaining excellent results. Creative and innovative that easily generates new instinctive ideas. Outstanding ability and willingness to learn quickly, work under pressure and adaptability to change. Methodical and analytic, committed to quality and accuracy in processes and procedures. Experience Manufacturing Development Organization Industrial Engineer Intel Corporation November 2014  – Present (10 months) Assembly and Test Manufacturing Process Engineer Intel Corporation December 2013  –  November 2014  (1 year) Assembly and Test Manufacturing Industrial Engineer Intel December 2010  –  December 2013  (3 years 1 month) Manufacturing Development Organization Industrial Engineer Intel Corporation November 2014  – Present (10 months) Manufacturing Development Organization Industrial Engineer Intel Corporation November 2014  – Present (10 months) Assembly and Test Manufacturing Process Engineer Intel Corporation December 2013  –  November 2014  (1 year) Assembly and Test Manufacturing Process Engineer Intel Corporation December 2013  –  November 2014  (1 year) Assembly and Test Manufacturing Industrial Engineer Intel December 2010  –  December 2013  (3 years 1 month) Assembly and Test Manufacturing Industrial Engineer Intel December 2010  –  December 2013  (3 years 1 month) Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Lean Manufacturing Design of Experiments Industrial Engineering SPC Six Sigma Data Analysis Process Engineering Semiconductors Project Management Manufacturing Process Improvement Continuous Improvement Problem Solving FMEA Engineering Management Root Cause Analysis Supply Chain Management Cross-functional Team... Engineering Project Planning Data Management Data Modeling Collaborative Problem... Statistical Data... Statistics Stakeholder Management Statistical Tools Statistical Reporting Inventory Management Data Mining Time Study Cycle Time Reduction Cross-cultural Teams Cross-cultural... Cross-functional... Process Control Process Design Process Definition Statistics Analysis See 24+     See less Skills  Lean Manufacturing Design of Experiments Industrial Engineering SPC Six Sigma Data Analysis Process Engineering Semiconductors Project Management Manufacturing Process Improvement Continuous Improvement Problem Solving FMEA Engineering Management Root Cause Analysis Supply Chain Management Cross-functional Team... Engineering Project Planning Data Management Data Modeling Collaborative Problem... Statistical Data... Statistics Stakeholder Management Statistical Tools Statistical Reporting Inventory Management Data Mining Time Study Cycle Time Reduction Cross-cultural Teams Cross-cultural... Cross-functional... Process Control Process Design Process Definition Statistics Analysis See 24+     See less Lean Manufacturing Design of Experiments Industrial Engineering SPC Six Sigma Data Analysis Process Engineering Semiconductors Project Management Manufacturing Process Improvement Continuous Improvement Problem Solving FMEA Engineering Management Root Cause Analysis Supply Chain Management Cross-functional Team... Engineering Project Planning Data Management Data Modeling Collaborative Problem... Statistical Data... Statistics Stakeholder Management Statistical Tools Statistical Reporting Inventory Management Data Mining Time Study Cycle Time Reduction Cross-cultural Teams Cross-cultural... Cross-functional... Process Control Process Design Process Definition Statistics Analysis See 24+     See less Lean Manufacturing Design of Experiments Industrial Engineering SPC Six Sigma Data Analysis Process Engineering Semiconductors Project Management Manufacturing Process Improvement Continuous Improvement Problem Solving FMEA Engineering Management Root Cause Analysis Supply Chain Management Cross-functional Team... Engineering Project Planning Data Management Data Modeling Collaborative Problem... Statistical Data... Statistics Stakeholder Management Statistical Tools Statistical Reporting Inventory Management Data Mining Time Study Cycle Time Reduction Cross-cultural Teams Cross-cultural... Cross-functional... Process Control Process Design Process Definition Statistics Analysis See 24+     See less Education Universidad de Costa Rica Lic.Industrial Engineering,  Industrial Engineering 2006  – 2013 Universidad de Costa Rica Lic.Industrial Engineering,  Industrial Engineering 2006  – 2013 Universidad de Costa Rica Lic.Industrial Engineering,  Industrial Engineering 2006  – 2013 Universidad de Costa Rica Lic.Industrial Engineering,  Industrial Engineering 2006  – 2013 Honors & Awards Graduation Project with Honors Universidad de Costa RIca February 2013 Optimization of the transportation network at the company Hologic Surgical Products. Gold Award Intel Corporation 2013 Energy conservation: Process improvements in one of the factory areas that consume the higher amount of energy, achieving significant savings, lowering the energy impact and making them sustainable through time.  Technical rock-star award Intel Corporation October 2013 Role model as technical leader. The award recognize sustaining excellence in manufacturing, management and technical excellence. Bronze Award Intel Corporation November 2013 Team accomplishment: Achievement of productivity improvements through problem solving and human performance improvement methodologies, increasing factory module outs in +30% on all its products.  Graduation Project with Honors Universidad de Costa RIca February 2013 Optimization of the transportation network at the company Hologic Surgical Products. Graduation Project with Honors Universidad de Costa RIca February 2013 Optimization of the transportation network at the company Hologic Surgical Products. Graduation Project with Honors Universidad de Costa RIca February 2013 Optimization of the transportation network at the company Hologic Surgical Products. Gold Award Intel Corporation 2013 Energy conservation: Process improvements in one of the factory areas that consume the higher amount of energy, achieving significant savings, lowering the energy impact and making them sustainable through time.  Gold Award Intel Corporation 2013 Energy conservation: Process improvements in one of the factory areas that consume the higher amount of energy, achieving significant savings, lowering the energy impact and making them sustainable through time.  Gold Award Intel Corporation 2013 Energy conservation: Process improvements in one of the factory areas that consume the higher amount of energy, achieving significant savings, lowering the energy impact and making them sustainable through time.  Technical rock-star award Intel Corporation October 2013 Role model as technical leader. The award recognize sustaining excellence in manufacturing, management and technical excellence. Technical rock-star award Intel Corporation October 2013 Role model as technical leader. The award recognize sustaining excellence in manufacturing, management and technical excellence. Technical rock-star award Intel Corporation October 2013 Role model as technical leader. The award recognize sustaining excellence in manufacturing, management and technical excellence. Bronze Award Intel Corporation November 2013 Team accomplishment: Achievement of productivity improvements through problem solving and human performance improvement methodologies, increasing factory module outs in +30% on all its products.  Bronze Award Intel Corporation November 2013 Team accomplishment: Achievement of productivity improvements through problem solving and human performance improvement methodologies, increasing factory module outs in +30% on all its products.  Bronze Award Intel Corporation November 2013 Team accomplishment: Achievement of productivity improvements through problem solving and human performance improvement methodologies, increasing factory module outs in +30% on all its products.  ", "Experience Manufacturing Process Engineer Intel Corporation September 2008  –  January 2015  (6 years 5 months) Costa Rica Equipment Maintenance Engineer Nueces Industriales S.A. September 2006  –  September 2008  (2 years 1 month) Costa Rica BSC. Student Worker Intel Corporation September 2005  –  August 2006  (1 year) Costa Rica Manufacturing Process Engineer Intel Corporation September 2008  –  January 2015  (6 years 5 months) Costa Rica Manufacturing Process Engineer Intel Corporation September 2008  –  January 2015  (6 years 5 months) Costa Rica Equipment Maintenance Engineer Nueces Industriales S.A. September 2006  –  September 2008  (2 years 1 month) Costa Rica Equipment Maintenance Engineer Nueces Industriales S.A. September 2006  –  September 2008  (2 years 1 month) Costa Rica BSC. Student Worker Intel Corporation September 2005  –  August 2006  (1 year) Costa Rica BSC. Student Worker Intel Corporation September 2005  –  August 2006  (1 year) Costa Rica Languages English Professional working proficiency English Professional working proficiency English Professional working proficiency Professional working proficiency Education Instituto Tecnológico de Costa Rica Master of Engineering (M.Eng.),  Electromechanical Engineering Management , Energy Efficiency 2014  – 2016 Instituto Tecnológico de Costa Rica Licenciatura,  Industrial Equipment Maintenance, emphasis on energy efficiency 2000  – 2006 Instituto Tecnológico de Costa Rica Master of Engineering (M.Eng.),  Electromechanical Engineering Management , Energy Efficiency 2014  – 2016 Instituto Tecnológico de Costa Rica Master of Engineering (M.Eng.),  Electromechanical Engineering Management , Energy Efficiency 2014  – 2016 Instituto Tecnológico de Costa Rica Master of Engineering (M.Eng.),  Electromechanical Engineering Management , Energy Efficiency 2014  – 2016 Instituto Tecnológico de Costa Rica Licenciatura,  Industrial Equipment Maintenance, emphasis on energy efficiency 2000  – 2006 Instituto Tecnológico de Costa Rica Licenciatura,  Industrial Equipment Maintenance, emphasis on energy efficiency 2000  – 2006 Instituto Tecnológico de Costa Rica Licenciatura,  Industrial Equipment Maintenance, emphasis on energy efficiency 2000  – 2006 ", "Summary Ambitious engineer recognized for exceptional ability to eliminate problems and execute projects that significantly impact business needs. Able to provide the leadership and mentorship skills necessary to develop and drive innovative solutions. Extensive knowledge of production equipment, process technology and automation systems associated with world class manufacturing environments.  \nQualifications:  \n \n \n•\tHighly skilled with statistical analysis. \n•\tQuality control manager. \n•\tEffective Project management. \n•\tEquipment and Process development. \n•\tRoot cause identification and resolution. \n•\tHigh volume manufacturing knowledge. \n \n•\tTechnical documentation preparation. \n•\tSuccessful ramp of multiple factory startups. \n•\tDevice parametric failure analysis. \n•\t24x7 team and customer dedication. \n•\tProduct failure analysis. \n•\tSix Sigma Black Belt. \n•\tCertified ISO 9001:2004 lead auditor. \n \nSpecialties: •\tEngineering tools: DOE (Design of Experiments), Gauge Repeatability and Reproducibility, Device Physics, Statistical Process Control Systems (JUMP, Minitab, Statistica, SAS, RS1); MS Office suite (Excel, Word, Outlook, PowerPoint, Access), 5S, Six Sigma Black Belt, SAP data acquisition Summary Ambitious engineer recognized for exceptional ability to eliminate problems and execute projects that significantly impact business needs. Able to provide the leadership and mentorship skills necessary to develop and drive innovative solutions. Extensive knowledge of production equipment, process technology and automation systems associated with world class manufacturing environments.  \nQualifications:  \n \n \n•\tHighly skilled with statistical analysis. \n•\tQuality control manager. \n•\tEffective Project management. \n•\tEquipment and Process development. \n•\tRoot cause identification and resolution. \n•\tHigh volume manufacturing knowledge. \n \n•\tTechnical documentation preparation. \n•\tSuccessful ramp of multiple factory startups. \n•\tDevice parametric failure analysis. \n•\t24x7 team and customer dedication. \n•\tProduct failure analysis. \n•\tSix Sigma Black Belt. \n•\tCertified ISO 9001:2004 lead auditor. \n \nSpecialties: •\tEngineering tools: DOE (Design of Experiments), Gauge Repeatability and Reproducibility, Device Physics, Statistical Process Control Systems (JUMP, Minitab, Statistica, SAS, RS1); MS Office suite (Excel, Word, Outlook, PowerPoint, Access), 5S, Six Sigma Black Belt, SAP data acquisition Ambitious engineer recognized for exceptional ability to eliminate problems and execute projects that significantly impact business needs. Able to provide the leadership and mentorship skills necessary to develop and drive innovative solutions. Extensive knowledge of production equipment, process technology and automation systems associated with world class manufacturing environments.  \nQualifications:  \n \n \n•\tHighly skilled with statistical analysis. \n•\tQuality control manager. \n•\tEffective Project management. \n•\tEquipment and Process development. \n•\tRoot cause identification and resolution. \n•\tHigh volume manufacturing knowledge. \n \n•\tTechnical documentation preparation. \n•\tSuccessful ramp of multiple factory startups. \n•\tDevice parametric failure analysis. \n•\t24x7 team and customer dedication. \n•\tProduct failure analysis. \n•\tSix Sigma Black Belt. \n•\tCertified ISO 9001:2004 lead auditor. \n \nSpecialties: •\tEngineering tools: DOE (Design of Experiments), Gauge Repeatability and Reproducibility, Device Physics, Statistical Process Control Systems (JUMP, Minitab, Statistica, SAS, RS1); MS Office suite (Excel, Word, Outlook, PowerPoint, Access), 5S, Six Sigma Black Belt, SAP data acquisition Ambitious engineer recognized for exceptional ability to eliminate problems and execute projects that significantly impact business needs. Able to provide the leadership and mentorship skills necessary to develop and drive innovative solutions. Extensive knowledge of production equipment, process technology and automation systems associated with world class manufacturing environments.  \nQualifications:  \n \n \n•\tHighly skilled with statistical analysis. \n•\tQuality control manager. \n•\tEffective Project management. \n•\tEquipment and Process development. \n•\tRoot cause identification and resolution. \n•\tHigh volume manufacturing knowledge. \n \n•\tTechnical documentation preparation. \n•\tSuccessful ramp of multiple factory startups. \n•\tDevice parametric failure analysis. \n•\t24x7 team and customer dedication. \n•\tProduct failure analysis. \n•\tSix Sigma Black Belt. \n•\tCertified ISO 9001:2004 lead auditor. \n \nSpecialties: •\tEngineering tools: DOE (Design of Experiments), Gauge Repeatability and Reproducibility, Device Physics, Statistical Process Control Systems (JUMP, Minitab, Statistica, SAS, RS1); MS Office suite (Excel, Word, Outlook, PowerPoint, Access), 5S, Six Sigma Black Belt, SAP data acquisition Experience Supplier Quality Management Engineer Daimler Trucks North America June 2013  – Present (2 years 3 months) Portland, Oregon Area •\tQuality owner for all electrical truck components and all associated suppliers throughout the world.  \n•\tResolved multiple supplier quality issues at multiple DTNA factories both in the US and Mexico. \n•\tGuided multiple suppliers to resolve manufacturing and reliability product quality issues. \n•\tDefined requirements for and approved supplier production part approval process requests. \n•\tConducted detailed investigations to select suppliers for new components. \n•\tConducted preventative quality activities to assure new products would not experience issues after product launch. Statisitician and Process Control Engineer. Genentech May 2011  –  December 2012  (1 year 8 months) Portland, Oregon Area Automate and acquire production data for the purpose of establishing product action limits, identify cause and effect factors, establish actions and timelines to resolve causes of variability. Created software to transfer coded data from the manufacturing inspection equipment into a database. This enable detailed and frequent analysis of production data to ensure all aspects of the inspection tool were operating properly. \nDocument Monthly, Quarterly and Annual product production quality performance reports for management and cross site review. Identified 3 manufacturing concerns which resulted in changes that had a positive impact on production quality and output. Senior Quality Manager SolarWorld 2007  –  2009  (2 years) Summarize and present quality status updates to local and global management. \nCustomer quality interface. \nVendor quality management - resolved supplier quality issues associated with production quality issues. Established control monitors with all vendors to avoid future quality issues. \nRecover funds from defective cutting wire – identified via incoming test, production feedback and statistics. \nRecover funds from of wafers which were previously identified as quality issues by customers.  \nSelected, developed and qualified geometrical and electrical testing metrology for silicon ingot and wafers. Performed gauge repeatability and reproducibility analysis to assure long-term capability of the equipment. \nDefined the format, wrote and controlled all process and product specifications for the ingot and wafer modules. \nEstablished quality control feedback systems throughout the process. Senior Manufacturing Integration and Yield Development Engineer Intel Corporation 2002  –  2007  (5 years) Oversaw process change control for the back half of a process technology. \nDrove team of engineers to identify individual process improvements in order to meet targets for defectivity and yield. \nManaged failure analysis projects which utilized unique techniques to identify root cause for yield failures. \nManaged all new product introductions into the factory. Senior Manufacturing Process and Equipment Development Engineer Intel 1997  –  2002  (5 years) Portland, Oregon Area Periodically develop new manufacturing processes to enable new production technologies.  \nDesign eperiments for equipment to identify optimum process coniditions based on incoming process conditions, tool performance and vendor supply capabilies. \nContain production excursions, perform root cause analysis and implement solutions. Senior Manufacturing Process Engineer Intel Corporation 1993  –  1997  (4 years) Daily montitoring of process conditions. \nContain excursions, document dicrepant material and implement solutions to prevent future issues. \nWork with vendors to control material quality.  \nDesign and Execute and document experiments to implement cost saving or critical process improvement changes. Supplier Quality Management Engineer Daimler Trucks North America June 2013  – Present (2 years 3 months) Portland, Oregon Area •\tQuality owner for all electrical truck components and all associated suppliers throughout the world.  \n•\tResolved multiple supplier quality issues at multiple DTNA factories both in the US and Mexico. \n•\tGuided multiple suppliers to resolve manufacturing and reliability product quality issues. \n•\tDefined requirements for and approved supplier production part approval process requests. \n•\tConducted detailed investigations to select suppliers for new components. \n•\tConducted preventative quality activities to assure new products would not experience issues after product launch. Supplier Quality Management Engineer Daimler Trucks North America June 2013  – Present (2 years 3 months) Portland, Oregon Area •\tQuality owner for all electrical truck components and all associated suppliers throughout the world.  \n•\tResolved multiple supplier quality issues at multiple DTNA factories both in the US and Mexico. \n•\tGuided multiple suppliers to resolve manufacturing and reliability product quality issues. \n•\tDefined requirements for and approved supplier production part approval process requests. \n•\tConducted detailed investigations to select suppliers for new components. \n•\tConducted preventative quality activities to assure new products would not experience issues after product launch. Statisitician and Process Control Engineer. Genentech May 2011  –  December 2012  (1 year 8 months) Portland, Oregon Area Automate and acquire production data for the purpose of establishing product action limits, identify cause and effect factors, establish actions and timelines to resolve causes of variability. Created software to transfer coded data from the manufacturing inspection equipment into a database. This enable detailed and frequent analysis of production data to ensure all aspects of the inspection tool were operating properly. \nDocument Monthly, Quarterly and Annual product production quality performance reports for management and cross site review. Identified 3 manufacturing concerns which resulted in changes that had a positive impact on production quality and output. Statisitician and Process Control Engineer. Genentech May 2011  –  December 2012  (1 year 8 months) Portland, Oregon Area Automate and acquire production data for the purpose of establishing product action limits, identify cause and effect factors, establish actions and timelines to resolve causes of variability. Created software to transfer coded data from the manufacturing inspection equipment into a database. This enable detailed and frequent analysis of production data to ensure all aspects of the inspection tool were operating properly. \nDocument Monthly, Quarterly and Annual product production quality performance reports for management and cross site review. Identified 3 manufacturing concerns which resulted in changes that had a positive impact on production quality and output. Senior Quality Manager SolarWorld 2007  –  2009  (2 years) Summarize and present quality status updates to local and global management. \nCustomer quality interface. \nVendor quality management - resolved supplier quality issues associated with production quality issues. Established control monitors with all vendors to avoid future quality issues. \nRecover funds from defective cutting wire – identified via incoming test, production feedback and statistics. \nRecover funds from of wafers which were previously identified as quality issues by customers.  \nSelected, developed and qualified geometrical and electrical testing metrology for silicon ingot and wafers. Performed gauge repeatability and reproducibility analysis to assure long-term capability of the equipment. \nDefined the format, wrote and controlled all process and product specifications for the ingot and wafer modules. \nEstablished quality control feedback systems throughout the process. Senior Quality Manager SolarWorld 2007  –  2009  (2 years) Summarize and present quality status updates to local and global management. \nCustomer quality interface. \nVendor quality management - resolved supplier quality issues associated with production quality issues. Established control monitors with all vendors to avoid future quality issues. \nRecover funds from defective cutting wire – identified via incoming test, production feedback and statistics. \nRecover funds from of wafers which were previously identified as quality issues by customers.  \nSelected, developed and qualified geometrical and electrical testing metrology for silicon ingot and wafers. Performed gauge repeatability and reproducibility analysis to assure long-term capability of the equipment. \nDefined the format, wrote and controlled all process and product specifications for the ingot and wafer modules. \nEstablished quality control feedback systems throughout the process. Senior Manufacturing Integration and Yield Development Engineer Intel Corporation 2002  –  2007  (5 years) Oversaw process change control for the back half of a process technology. \nDrove team of engineers to identify individual process improvements in order to meet targets for defectivity and yield. \nManaged failure analysis projects which utilized unique techniques to identify root cause for yield failures. \nManaged all new product introductions into the factory. Senior Manufacturing Integration and Yield Development Engineer Intel Corporation 2002  –  2007  (5 years) Oversaw process change control for the back half of a process technology. \nDrove team of engineers to identify individual process improvements in order to meet targets for defectivity and yield. \nManaged failure analysis projects which utilized unique techniques to identify root cause for yield failures. \nManaged all new product introductions into the factory. Senior Manufacturing Process and Equipment Development Engineer Intel 1997  –  2002  (5 years) Portland, Oregon Area Periodically develop new manufacturing processes to enable new production technologies.  \nDesign eperiments for equipment to identify optimum process coniditions based on incoming process conditions, tool performance and vendor supply capabilies. \nContain production excursions, perform root cause analysis and implement solutions. Senior Manufacturing Process and Equipment Development Engineer Intel 1997  –  2002  (5 years) Portland, Oregon Area Periodically develop new manufacturing processes to enable new production technologies.  \nDesign eperiments for equipment to identify optimum process coniditions based on incoming process conditions, tool performance and vendor supply capabilies. \nContain production excursions, perform root cause analysis and implement solutions. Senior Manufacturing Process Engineer Intel Corporation 1993  –  1997  (4 years) Daily montitoring of process conditions. \nContain excursions, document dicrepant material and implement solutions to prevent future issues. \nWork with vendors to control material quality.  \nDesign and Execute and document experiments to implement cost saving or critical process improvement changes. Senior Manufacturing Process Engineer Intel Corporation 1993  –  1997  (4 years) Daily montitoring of process conditions. \nContain excursions, document dicrepant material and implement solutions to prevent future issues. \nWork with vendors to control material quality.  \nDesign and Execute and document experiments to implement cost saving or critical process improvement changes. Languages Spanish Spanish Spanish Skills Engineering Minitab Microsoft Excel PowerPoint Microsoft Word Outlook Physics Design of Experiments SPC Semiconductors Six Sigma 5S Jump SAP Statistics Process Engineering Process Improvement Quality Assurance Quality Management Data Analysis MES ISO 9001:2004 lead... Six Sigma Black Belt Visual Basic Programing SharePoint Microsoft Project Metrology See 12+     See less Skills  Engineering Minitab Microsoft Excel PowerPoint Microsoft Word Outlook Physics Design of Experiments SPC Semiconductors Six Sigma 5S Jump SAP Statistics Process Engineering Process Improvement Quality Assurance Quality Management Data Analysis MES ISO 9001:2004 lead... Six Sigma Black Belt Visual Basic Programing SharePoint Microsoft Project Metrology See 12+     See less Engineering Minitab Microsoft Excel PowerPoint Microsoft Word Outlook Physics Design of Experiments SPC Semiconductors Six Sigma 5S Jump SAP Statistics Process Engineering Process Improvement Quality Assurance Quality Management Data Analysis MES ISO 9001:2004 lead... Six Sigma Black Belt Visual Basic Programing SharePoint Microsoft Project Metrology See 12+     See less Engineering Minitab Microsoft Excel PowerPoint Microsoft Word Outlook Physics Design of Experiments SPC Semiconductors Six Sigma 5S Jump SAP Statistics Process Engineering Process Improvement Quality Assurance Quality Management Data Analysis MES ISO 9001:2004 lead... Six Sigma Black Belt Visual Basic Programing SharePoint Microsoft Project Metrology See 12+     See less Education Purdue University MSMSE,  Metallurgical Engineering 1991  – 1993 Intermural Soccer. Activities and Societies:  Alpha Sigma Mu National Honors Society ,  ASM International Purdue University BSMSE,  Materials Science Engineering 1988  – 1991 Intermural Soccer all 4 years. Activities and Societies:  Alpha Sigma Mu National honor society ,  ASM International Columbus East 1984  – 1988 Activities and Societies:  Indiana Acedemic Honors Society Purdue University MSMSE,  Metallurgical Engineering 1991  – 1993 Intermural Soccer. Activities and Societies:  Alpha Sigma Mu National Honors Society ,  ASM International Purdue University MSMSE,  Metallurgical Engineering 1991  – 1993 Intermural Soccer. Activities and Societies:  Alpha Sigma Mu National Honors Society ,  ASM International Purdue University MSMSE,  Metallurgical Engineering 1991  – 1993 Intermural Soccer. Activities and Societies:  Alpha Sigma Mu National Honors Society ,  ASM International Purdue University BSMSE,  Materials Science Engineering 1988  – 1991 Intermural Soccer all 4 years. Activities and Societies:  Alpha Sigma Mu National honor society ,  ASM International Purdue University BSMSE,  Materials Science Engineering 1988  – 1991 Intermural Soccer all 4 years. Activities and Societies:  Alpha Sigma Mu National honor society ,  ASM International Purdue University BSMSE,  Materials Science Engineering 1988  – 1991 Intermural Soccer all 4 years. Activities and Societies:  Alpha Sigma Mu National honor society ,  ASM International Columbus East 1984  – 1988 Activities and Societies:  Indiana Acedemic Honors Society Columbus East 1984  – 1988 Activities and Societies:  Indiana Acedemic Honors Society Columbus East 1984  – 1988 Activities and Societies:  Indiana Acedemic Honors Society Honors & Awards Additional Honors & Awards Intel Achievement Award 2x Additional Honors & Awards Intel Achievement Award 2x Additional Honors & Awards Intel Achievement Award 2x Additional Honors & Awards Intel Achievement Award 2x "]}