{"position": "Marketing Communications Manager", "company": "Intel Corporation", "profiles": ["Skills Integrated Marketing Marketing Product Marketing Multi-channel Marketing Marketing Communications Demand Generation Program Management Digital Marketing Market Research Creative Direction Digital Strategy Advertising Marketing Strategy Brand Development B2B Marketing Lead Generation Corporate Branding Direct Marketing Online Marketing Mobile Marketing SEM Marketing Management Email Marketing Competitive Analysis Strategic Partnerships Strategy Online Advertising Brand Management Web Analytics Analytics Social Media Marketing Market Planning Product Management Digital Media Segmentation Marketing Research Content Strategy Product Launch Brand Awareness Web Marketing Go-to-market Strategy Positioning Global Marketing Customer Insight B2B Corporate Communications PPC Market Analysis Marketing Automation International Marketing See 35+     See less Skills  Integrated Marketing Marketing Product Marketing Multi-channel Marketing Marketing Communications Demand Generation Program Management Digital Marketing Market Research Creative Direction Digital Strategy Advertising Marketing Strategy Brand Development B2B Marketing Lead Generation Corporate Branding Direct Marketing Online Marketing Mobile Marketing SEM Marketing Management Email Marketing Competitive Analysis Strategic Partnerships Strategy Online Advertising Brand Management Web Analytics Analytics Social Media Marketing Market Planning Product Management Digital Media Segmentation Marketing Research Content Strategy Product Launch Brand Awareness Web Marketing Go-to-market Strategy Positioning Global Marketing Customer Insight B2B Corporate Communications PPC Market Analysis Marketing Automation International Marketing See 35+     See less Integrated Marketing Marketing Product Marketing Multi-channel Marketing Marketing Communications Demand Generation Program Management Digital Marketing Market Research Creative Direction Digital Strategy Advertising Marketing Strategy Brand Development B2B Marketing Lead Generation Corporate Branding Direct Marketing Online Marketing Mobile Marketing SEM Marketing Management Email Marketing Competitive Analysis Strategic Partnerships Strategy Online Advertising Brand Management Web Analytics Analytics Social Media Marketing Market Planning Product Management Digital Media Segmentation Marketing Research Content Strategy Product Launch Brand Awareness Web Marketing Go-to-market Strategy Positioning Global Marketing Customer Insight B2B Corporate Communications PPC Market Analysis Marketing Automation International Marketing See 35+     See less Integrated Marketing Marketing Product Marketing Multi-channel Marketing Marketing Communications Demand Generation Program Management Digital Marketing Market Research Creative Direction Digital Strategy Advertising Marketing Strategy Brand Development B2B Marketing Lead Generation Corporate Branding Direct Marketing Online Marketing Mobile Marketing SEM Marketing Management Email Marketing Competitive Analysis Strategic Partnerships Strategy Online Advertising Brand Management Web Analytics Analytics Social Media Marketing Market Planning Product Management Digital Media Segmentation Marketing Research Content Strategy Product Launch Brand Awareness Web Marketing Go-to-market Strategy Positioning Global Marketing Customer Insight B2B Corporate Communications PPC Market Analysis Marketing Automation International Marketing See 35+     See less ", "Summary Over eighteen years of experience in technology and corporate marketing and communications. Over six years of management experience at progressively larger design agencies. Recognized as a team player with experience in managing large projects, cross-functional teams, and high-impact / multi-dimensional global programs including integrated marketing communications, customer reference programs, brand identity, new product launches, diversity outreach, employee communications and corporate events. Positive team player who leverages brand and communications strategy with common sense to balance cost efficiency and communication effectiveness. \n \nOpen to opportunities with an organization that offers great products and services to its customers. Looking for an organization which values the contributions of Marketing and Communications professionals as helping the company be successful with customers, partners and employees. \n \nSpecialties: Customer reference programs, global programs, international agency management and training, branding and identity, employee communications, multicultural marketing and corporate diversity outreach, corporate social responsibility, corporate events, collateral and web development, video shoots, press checks. Summary Over eighteen years of experience in technology and corporate marketing and communications. Over six years of management experience at progressively larger design agencies. Recognized as a team player with experience in managing large projects, cross-functional teams, and high-impact / multi-dimensional global programs including integrated marketing communications, customer reference programs, brand identity, new product launches, diversity outreach, employee communications and corporate events. Positive team player who leverages brand and communications strategy with common sense to balance cost efficiency and communication effectiveness. \n \nOpen to opportunities with an organization that offers great products and services to its customers. Looking for an organization which values the contributions of Marketing and Communications professionals as helping the company be successful with customers, partners and employees. \n \nSpecialties: Customer reference programs, global programs, international agency management and training, branding and identity, employee communications, multicultural marketing and corporate diversity outreach, corporate social responsibility, corporate events, collateral and web development, video shoots, press checks. Over eighteen years of experience in technology and corporate marketing and communications. Over six years of management experience at progressively larger design agencies. Recognized as a team player with experience in managing large projects, cross-functional teams, and high-impact / multi-dimensional global programs including integrated marketing communications, customer reference programs, brand identity, new product launches, diversity outreach, employee communications and corporate events. Positive team player who leverages brand and communications strategy with common sense to balance cost efficiency and communication effectiveness. \n \nOpen to opportunities with an organization that offers great products and services to its customers. Looking for an organization which values the contributions of Marketing and Communications professionals as helping the company be successful with customers, partners and employees. \n \nSpecialties: Customer reference programs, global programs, international agency management and training, branding and identity, employee communications, multicultural marketing and corporate diversity outreach, corporate social responsibility, corporate events, collateral and web development, video shoots, press checks. Over eighteen years of experience in technology and corporate marketing and communications. Over six years of management experience at progressively larger design agencies. Recognized as a team player with experience in managing large projects, cross-functional teams, and high-impact / multi-dimensional global programs including integrated marketing communications, customer reference programs, brand identity, new product launches, diversity outreach, employee communications and corporate events. Positive team player who leverages brand and communications strategy with common sense to balance cost efficiency and communication effectiveness. \n \nOpen to opportunities with an organization that offers great products and services to its customers. Looking for an organization which values the contributions of Marketing and Communications professionals as helping the company be successful with customers, partners and employees. \n \nSpecialties: Customer reference programs, global programs, international agency management and training, branding and identity, employee communications, multicultural marketing and corporate diversity outreach, corporate social responsibility, corporate events, collateral and web development, video shoots, press checks. Experience Senior Client Services Manager TDA Group April 2007  – Present (8 years 5 months) Responsible for managing customer reference programs and other marketing and communications efforts for Intel, Dell, Compellent and other high tech companies. Deliverables include end customer outreach, web and collateral projects, budget tracking and general client services. Senior Marketing Communications Manager Intel Corporation November 1996  –  October 2006  (10 years) Provided strategic planning and hands on management of marketing and communications for a variety of businesses and corporate program offices. Positions held included those in the Intel Customer Reference Program, Corporate Diversity, Worldwide Employee Communications, Corporate Brand Identity, Corporate Marketing Group (initial launches of Intel Online Services, Intel InBusiness and Intel PC Camera businesses). Production Manager Hanlon Brown Design, Inc. October 1994  –  November 1996  (2 years 2 months) Provided leadership to full service design agency as the senior staff manager reporting directly to the principals. Managed staff of nine plus up to twelve additional contractors. Responsible for all Quality Assurance issues and scheduling of all design jobs and external vendor production. Art Director and Media Production Manager Computer Tools, Inc. May 1991  –  October 1994  (3 years 6 months) Provided leadership to graphic design and pre-press company as the Art Director and senior staff manager reporting directly to the principals. Managed staff of seven. Responsible for scheduling of all design and pre-press work. Purchased supplies for pre-press operation. Senior Client Services Manager TDA Group April 2007  – Present (8 years 5 months) Responsible for managing customer reference programs and other marketing and communications efforts for Intel, Dell, Compellent and other high tech companies. Deliverables include end customer outreach, web and collateral projects, budget tracking and general client services. Senior Client Services Manager TDA Group April 2007  – Present (8 years 5 months) Responsible for managing customer reference programs and other marketing and communications efforts for Intel, Dell, Compellent and other high tech companies. Deliverables include end customer outreach, web and collateral projects, budget tracking and general client services. Senior Marketing Communications Manager Intel Corporation November 1996  –  October 2006  (10 years) Provided strategic planning and hands on management of marketing and communications for a variety of businesses and corporate program offices. Positions held included those in the Intel Customer Reference Program, Corporate Diversity, Worldwide Employee Communications, Corporate Brand Identity, Corporate Marketing Group (initial launches of Intel Online Services, Intel InBusiness and Intel PC Camera businesses). Senior Marketing Communications Manager Intel Corporation November 1996  –  October 2006  (10 years) Provided strategic planning and hands on management of marketing and communications for a variety of businesses and corporate program offices. Positions held included those in the Intel Customer Reference Program, Corporate Diversity, Worldwide Employee Communications, Corporate Brand Identity, Corporate Marketing Group (initial launches of Intel Online Services, Intel InBusiness and Intel PC Camera businesses). Production Manager Hanlon Brown Design, Inc. October 1994  –  November 1996  (2 years 2 months) Provided leadership to full service design agency as the senior staff manager reporting directly to the principals. Managed staff of nine plus up to twelve additional contractors. Responsible for all Quality Assurance issues and scheduling of all design jobs and external vendor production. Production Manager Hanlon Brown Design, Inc. October 1994  –  November 1996  (2 years 2 months) Provided leadership to full service design agency as the senior staff manager reporting directly to the principals. Managed staff of nine plus up to twelve additional contractors. Responsible for all Quality Assurance issues and scheduling of all design jobs and external vendor production. Art Director and Media Production Manager Computer Tools, Inc. May 1991  –  October 1994  (3 years 6 months) Provided leadership to graphic design and pre-press company as the Art Director and senior staff manager reporting directly to the principals. Managed staff of seven. Responsible for scheduling of all design and pre-press work. Purchased supplies for pre-press operation. Art Director and Media Production Manager Computer Tools, Inc. May 1991  –  October 1994  (3 years 6 months) Provided leadership to graphic design and pre-press company as the Art Director and senior staff manager reporting directly to the principals. Managed staff of seven. Responsible for scheduling of all design and pre-press work. Purchased supplies for pre-press operation. Skills Marketing Strategy Corporate Social... Integrated Marketing Product Management Branding & Identity Internal Communications Marketing Communications Creative Direction Strategic Communications Marketing Management Graphic Design Project Management Cross-functional Team... Digital Marketing Skills  Marketing Strategy Corporate Social... Integrated Marketing Product Management Branding & Identity Internal Communications Marketing Communications Creative Direction Strategic Communications Marketing Management Graphic Design Project Management Cross-functional Team... Digital Marketing Marketing Strategy Corporate Social... Integrated Marketing Product Management Branding & Identity Internal Communications Marketing Communications Creative Direction Strategic Communications Marketing Management Graphic Design Project Management Cross-functional Team... Digital Marketing Marketing Strategy Corporate Social... Integrated Marketing Product Management Branding & Identity Internal Communications Marketing Communications Creative Direction Strategic Communications Marketing Management Graphic Design Project Management Cross-functional Team... Digital Marketing Education Iowa State University BFA,  Graphic Design 1986  – 1990 Iowa State University BFA,  Graphic Design 1986  – 1990 Iowa State University BFA,  Graphic Design 1986  – 1990 Iowa State University BFA,  Graphic Design 1986  – 1990 Honors & Awards Additional Honors & Awards Seven Division Recognition Awards at Intel. \nIntel University instructor for three courses. Additional Honors & Awards Seven Division Recognition Awards at Intel. \nIntel University instructor for three courses. Additional Honors & Awards Seven Division Recognition Awards at Intel. \nIntel University instructor for three courses. Additional Honors & Awards Seven Division Recognition Awards at Intel. \nIntel University instructor for three courses. ", "Experience Marketing Consultant Express Scripts (formerly Medco) November 2005  – Present (9 years 10 months) Franklin Lakes, NJ Independent Marketing Consultant Sonnenberg, Haviland & Partners 2003  –  2006  (3 years) Marketing Consultant Cendant Corporation 2003  –  2004  (1 year) Marketing Communications Manager Intel Corporation January 1999  –  January 2002  (3 years 1 month) Marketing Program Communications Manager Dialogic Corporation January 1997  –  January 1999  (2 years 1 month) Marketing Consultant Dialogic Corporation January 1996  –  January 1997  (1 year 1 month) Graphics Consultant BASF Corporation, Integro, Inc January 1995  –  January 1996  (1 year 1 month) Production Supervisor/Senior Computer Artist Graphics One Fifty Corporation January 1992  –  January 1995  (3 years 1 month) Freelance Graphic Artist Grey Advertising January 1989  –  January 1992  (3 years 1 month) Marketing Consultant Express Scripts (formerly Medco) November 2005  – Present (9 years 10 months) Franklin Lakes, NJ Marketing Consultant Express Scripts (formerly Medco) November 2005  – Present (9 years 10 months) Franklin Lakes, NJ Independent Marketing Consultant Sonnenberg, Haviland & Partners 2003  –  2006  (3 years) Independent Marketing Consultant Sonnenberg, Haviland & Partners 2003  –  2006  (3 years) Marketing Consultant Cendant Corporation 2003  –  2004  (1 year) Marketing Consultant Cendant Corporation 2003  –  2004  (1 year) Marketing Communications Manager Intel Corporation January 1999  –  January 2002  (3 years 1 month) Marketing Communications Manager Intel Corporation January 1999  –  January 2002  (3 years 1 month) Marketing Program Communications Manager Dialogic Corporation January 1997  –  January 1999  (2 years 1 month) Marketing Program Communications Manager Dialogic Corporation January 1997  –  January 1999  (2 years 1 month) Marketing Consultant Dialogic Corporation January 1996  –  January 1997  (1 year 1 month) Marketing Consultant Dialogic Corporation January 1996  –  January 1997  (1 year 1 month) Graphics Consultant BASF Corporation, Integro, Inc January 1995  –  January 1996  (1 year 1 month) Graphics Consultant BASF Corporation, Integro, Inc January 1995  –  January 1996  (1 year 1 month) Production Supervisor/Senior Computer Artist Graphics One Fifty Corporation January 1992  –  January 1995  (3 years 1 month) Production Supervisor/Senior Computer Artist Graphics One Fifty Corporation January 1992  –  January 1995  (3 years 1 month) Freelance Graphic Artist Grey Advertising January 1989  –  January 1992  (3 years 1 month) Freelance Graphic Artist Grey Advertising January 1989  –  January 1992  (3 years 1 month) Skills Marketing Communications Digital Marketing Marketing Strategy Integrated Marketing Product Marketing Online Advertising Marketing Strategy Skills  Marketing Communications Digital Marketing Marketing Strategy Integrated Marketing Product Marketing Online Advertising Marketing Strategy Marketing Communications Digital Marketing Marketing Strategy Integrated Marketing Product Marketing Online Advertising Marketing Strategy Marketing Communications Digital Marketing Marketing Strategy Integrated Marketing Product Marketing Online Advertising Marketing Strategy ", "Languages Tagalog Japanese Tagalog Japanese Tagalog Japanese Skills Product Marketing Integrated Marketing Marketing Communications Product Launch Online Advertising Marketing Social Media Advertising Brand Architecture Relationship Marketing Campaigns Customer Experience Web Marketing Affiliate Marketing Competitive Analysis Marketing Strategy Product Management Go-to-market Strategy SEM Online Marketing Marketing Management Social Media Marketing Strategy Positioning Strategic Partnerships Segmentation Market Research Analytics E-commerce Marketing Research Management Public Relations Market Planning Multi-channel Marketing Lead Generation B2B Marketing Demand Generation Messaging Thought Leadership Mobile Marketing Digital Marketing Brand Management Global Marketing Web Analytics See 29+     See less Skills  Product Marketing Integrated Marketing Marketing Communications Product Launch Online Advertising Marketing Social Media Advertising Brand Architecture Relationship Marketing Campaigns Customer Experience Web Marketing Affiliate Marketing Competitive Analysis Marketing Strategy Product Management Go-to-market Strategy SEM Online Marketing Marketing Management Social Media Marketing Strategy Positioning Strategic Partnerships Segmentation Market Research Analytics E-commerce Marketing Research Management Public Relations Market Planning Multi-channel Marketing Lead Generation B2B Marketing Demand Generation Messaging Thought Leadership Mobile Marketing Digital Marketing Brand Management Global Marketing Web Analytics See 29+     See less Product Marketing Integrated Marketing Marketing Communications Product Launch Online Advertising Marketing Social Media Advertising Brand Architecture Relationship Marketing Campaigns Customer Experience Web Marketing Affiliate Marketing Competitive Analysis Marketing Strategy Product Management Go-to-market Strategy SEM Online Marketing Marketing Management Social Media Marketing Strategy Positioning Strategic Partnerships Segmentation Market Research Analytics E-commerce Marketing Research Management Public Relations Market Planning Multi-channel Marketing Lead Generation B2B Marketing Demand Generation Messaging Thought Leadership Mobile Marketing Digital Marketing Brand Management Global Marketing Web Analytics See 29+     See less Product Marketing Integrated Marketing Marketing Communications Product Launch Online Advertising Marketing Social Media Advertising Brand Architecture Relationship Marketing Campaigns Customer Experience Web Marketing Affiliate Marketing Competitive Analysis Marketing Strategy Product Management Go-to-market Strategy SEM Online Marketing Marketing Management Social Media Marketing Strategy Positioning Strategic Partnerships Segmentation Market Research Analytics E-commerce Marketing Research Management Public Relations Market Planning Multi-channel Marketing Lead Generation B2B Marketing Demand Generation Messaging Thought Leadership Mobile Marketing Digital Marketing Brand Management Global Marketing Web Analytics See 29+     See less Honors & Awards 2014 Cannes Lions, Bronze: Branded Content for Project Daniel Cannes Lions June 2014 2014 Cannes Lions, Bronze: Cyber for Look Inside: Mick Ebeling Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Mick Ebeling Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Erik Weihenmayer Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Jack Andraka Cannes Lions June 2014 CEO Award Autodesk November 2010 Received the CEO Award for delivering 4 major launches during the 2010 Back-to-School season. Far exceeded success metrics for all previous launches: increased Autodesk Education Community YOY traffic by 150%, memberships by 73% and downloads by 80%.  2014 Cannes Lions, Bronze: Branded Content for Project Daniel Cannes Lions June 2014 2014 Cannes Lions, Bronze: Branded Content for Project Daniel Cannes Lions June 2014 2014 Cannes Lions, Bronze: Branded Content for Project Daniel Cannes Lions June 2014 2014 Cannes Lions, Bronze: Cyber for Look Inside: Mick Ebeling Cannes Lions June 2014 2014 Cannes Lions, Bronze: Cyber for Look Inside: Mick Ebeling Cannes Lions June 2014 2014 Cannes Lions, Bronze: Cyber for Look Inside: Mick Ebeling Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Mick Ebeling Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Mick Ebeling Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Mick Ebeling Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Erik Weihenmayer Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Erik Weihenmayer Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Erik Weihenmayer Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Jack Andraka Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Jack Andraka Cannes Lions June 2014 2014 Cannes Lions, Bronze: Film for Look Inside: Jack Andraka Cannes Lions June 2014 CEO Award Autodesk November 2010 Received the CEO Award for delivering 4 major launches during the 2010 Back-to-School season. Far exceeded success metrics for all previous launches: increased Autodesk Education Community YOY traffic by 150%, memberships by 73% and downloads by 80%.  CEO Award Autodesk November 2010 Received the CEO Award for delivering 4 major launches during the 2010 Back-to-School season. Far exceeded success metrics for all previous launches: increased Autodesk Education Community YOY traffic by 150%, memberships by 73% and downloads by 80%.  CEO Award Autodesk November 2010 Received the CEO Award for delivering 4 major launches during the 2010 Back-to-School season. Far exceeded success metrics for all previous launches: increased Autodesk Education Community YOY traffic by 150%, memberships by 73% and downloads by 80%.  ", "Experience Integrated Marketing & Communications Manager Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, Oregon Responsible for content strategy and development for desktop products. Still new, still learning my role. But very excited to be back! Writing and editing, communications consulting and marketing The Holt Company 1999  –  July 2014  (15 years) Writing/editing services include: Journal articles/ghost writing. Web content. Technical papers. Solution studies. Newsletters. Direct mail/email. Testimony. Presentations. Videos. Interactive demos. Speeches. Advertising. Strategic and integrated marketing and communications programs include: Marketing and campaign planning. Event design and management. Press relations. Product launch support. Communications program development. Marketing Communications Manager Intel 1995  –  1998  (3 years) Marketing programs support, messaging, collateral planning and development, agency management, web strategy and maintenance, product launches, PR collaboration, event planning and coordination for Intel's network branded marketing group (network management software, networking hardware). Marketing Director LaSalle Partners 1991  –  1994  (3 years) Marketing director at Cloverleaf Mall - a regional shopping center in Richmond, VA, owned and operated by LaSalle Partners. Responsibilities included all event planning and management, marketing programs, collateral and advertising, public relations. Supervised a concierge and marketing team of 7. Account Executive Goldberg Marchesano Kohlman 1987  –  1991  (4 years) Integrated Marketing & Communications Manager Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, Oregon Responsible for content strategy and development for desktop products. Still new, still learning my role. But very excited to be back! Integrated Marketing & Communications Manager Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, Oregon Responsible for content strategy and development for desktop products. Still new, still learning my role. But very excited to be back! Writing and editing, communications consulting and marketing The Holt Company 1999  –  July 2014  (15 years) Writing/editing services include: Journal articles/ghost writing. Web content. Technical papers. Solution studies. Newsletters. Direct mail/email. Testimony. Presentations. Videos. Interactive demos. Speeches. Advertising. Strategic and integrated marketing and communications programs include: Marketing and campaign planning. Event design and management. Press relations. Product launch support. Communications program development. Writing and editing, communications consulting and marketing The Holt Company 1999  –  July 2014  (15 years) Writing/editing services include: Journal articles/ghost writing. Web content. Technical papers. Solution studies. Newsletters. Direct mail/email. Testimony. Presentations. Videos. Interactive demos. Speeches. Advertising. Strategic and integrated marketing and communications programs include: Marketing and campaign planning. Event design and management. Press relations. Product launch support. Communications program development. Marketing Communications Manager Intel 1995  –  1998  (3 years) Marketing programs support, messaging, collateral planning and development, agency management, web strategy and maintenance, product launches, PR collaboration, event planning and coordination for Intel's network branded marketing group (network management software, networking hardware). Marketing Communications Manager Intel 1995  –  1998  (3 years) Marketing programs support, messaging, collateral planning and development, agency management, web strategy and maintenance, product launches, PR collaboration, event planning and coordination for Intel's network branded marketing group (network management software, networking hardware). Marketing Director LaSalle Partners 1991  –  1994  (3 years) Marketing director at Cloverleaf Mall - a regional shopping center in Richmond, VA, owned and operated by LaSalle Partners. Responsibilities included all event planning and management, marketing programs, collateral and advertising, public relations. Supervised a concierge and marketing team of 7. Marketing Director LaSalle Partners 1991  –  1994  (3 years) Marketing director at Cloverleaf Mall - a regional shopping center in Richmond, VA, owned and operated by LaSalle Partners. Responsibilities included all event planning and management, marketing programs, collateral and advertising, public relations. Supervised a concierge and marketing team of 7. Account Executive Goldberg Marchesano Kohlman 1987  –  1991  (4 years) Account Executive Goldberg Marchesano Kohlman 1987  –  1991  (4 years) Skills Product Launches Integrated Marketing Writing Advertising Newsletters Messaging Editing Internal Communications Strategic Planning Program Management Social Media Technical Writing Technology marketing Marketing Marketing Strategy Project Planning Strategy Product Marketing Marketing Communications Marketing Management Event Planning Product Launch See 7+     See less Skills  Product Launches Integrated Marketing Writing Advertising Newsletters Messaging Editing Internal Communications Strategic Planning Program Management Social Media Technical Writing Technology marketing Marketing Marketing Strategy Project Planning Strategy Product Marketing Marketing Communications Marketing Management Event Planning Product Launch See 7+     See less Product Launches Integrated Marketing Writing Advertising Newsletters Messaging Editing Internal Communications Strategic Planning Program Management Social Media Technical Writing Technology marketing Marketing Marketing Strategy Project Planning Strategy Product Marketing Marketing Communications Marketing Management Event Planning Product Launch See 7+     See less Product Launches Integrated Marketing Writing Advertising Newsletters Messaging Editing Internal Communications Strategic Planning Program Management Social Media Technical Writing Technology marketing Marketing Marketing Strategy Project Planning Strategy Product Marketing Marketing Communications Marketing Management Event Planning Product Launch See 7+     See less Education Portland State University BS,  Political Science 1981  – 1983 University of Oregon Journalism ,  Political Science 1979  – 1981 Activities and Societies:  Kappa Alpha Theta Portland State University BS,  Political Science 1981  – 1983 Portland State University BS,  Political Science 1981  – 1983 Portland State University BS,  Political Science 1981  – 1983 University of Oregon Journalism ,  Political Science 1979  – 1981 Activities and Societies:  Kappa Alpha Theta University of Oregon Journalism ,  Political Science 1979  – 1981 Activities and Societies:  Kappa Alpha Theta University of Oregon Journalism ,  Political Science 1979  – 1981 Activities and Societies:  Kappa Alpha Theta ", "Languages English Native or bilingual proficiency Mandarin Full professional proficiency Cantonese Native or bilingual proficiency English Native or bilingual proficiency Mandarin Full professional proficiency Cantonese Native or bilingual proficiency English Native or bilingual proficiency Mandarin Full professional proficiency Cantonese Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Public Relations Product Marketing Marketing Communications Event Management Social Media Marketing Channel Marketing Corporate Branding Corporate Communications Product Launch CRM Brand Management Skills  Public Relations Product Marketing Marketing Communications Event Management Social Media Marketing Channel Marketing Corporate Branding Corporate Communications Product Launch CRM Brand Management Public Relations Product Marketing Marketing Communications Event Management Social Media Marketing Channel Marketing Corporate Branding Corporate Communications Product Launch CRM Brand Management Public Relations Product Marketing Marketing Communications Event Management Social Media Marketing Channel Marketing Corporate Branding Corporate Communications Product Launch CRM Brand Management ", "Summary Innovative, dynamic and results-oriented executive with proven success growing companies, markets and products. +20 years of B2B and B2C expertise with broad repertoire of experience across business functions including marketing, product management and operations. Experienced executive team member responsible for developing and implementing profitable and scalable strategic business and operational plans to deliver top-line revenue and bottom-line earnings. \nSkilled at understanding the \"big picture\" and bringing new perspective to core business issues. Exceptional ability to juggle strategic and tactical demands while energizing cross-functional teams to achieve results. Collaborative style to build strong relationships with other executives, customers, partners, vendors and colleagues. \nPassion for motivating personnel, assembling and managing high-performing teams, and actively facilitating the professional growth of employees. \nWide range of experience leading teams in start-up and Fortune 500 corporate settings across a variety of industries including software, hardware, information technology and manufacturing.  \n \nCulturally adept with the experience to manage teams and drive results across multiple geographies. Effective identifying and exploring new markets, creating compelling business cases, launching products and building brands. Budget management from $500K to $265 MM. \n \nSpecialties: Corporate Development & Planning • Market & Competitive Analysis • Operations • Product Strategy • Distribution & Channels Strategy • Analyst & Media Relations • Full P&L Responsibility Summary Innovative, dynamic and results-oriented executive with proven success growing companies, markets and products. +20 years of B2B and B2C expertise with broad repertoire of experience across business functions including marketing, product management and operations. Experienced executive team member responsible for developing and implementing profitable and scalable strategic business and operational plans to deliver top-line revenue and bottom-line earnings. \nSkilled at understanding the \"big picture\" and bringing new perspective to core business issues. Exceptional ability to juggle strategic and tactical demands while energizing cross-functional teams to achieve results. Collaborative style to build strong relationships with other executives, customers, partners, vendors and colleagues. \nPassion for motivating personnel, assembling and managing high-performing teams, and actively facilitating the professional growth of employees. \nWide range of experience leading teams in start-up and Fortune 500 corporate settings across a variety of industries including software, hardware, information technology and manufacturing.  \n \nCulturally adept with the experience to manage teams and drive results across multiple geographies. Effective identifying and exploring new markets, creating compelling business cases, launching products and building brands. Budget management from $500K to $265 MM. \n \nSpecialties: Corporate Development & Planning • Market & Competitive Analysis • Operations • Product Strategy • Distribution & Channels Strategy • Analyst & Media Relations • Full P&L Responsibility Innovative, dynamic and results-oriented executive with proven success growing companies, markets and products. +20 years of B2B and B2C expertise with broad repertoire of experience across business functions including marketing, product management and operations. Experienced executive team member responsible for developing and implementing profitable and scalable strategic business and operational plans to deliver top-line revenue and bottom-line earnings. \nSkilled at understanding the \"big picture\" and bringing new perspective to core business issues. Exceptional ability to juggle strategic and tactical demands while energizing cross-functional teams to achieve results. Collaborative style to build strong relationships with other executives, customers, partners, vendors and colleagues. \nPassion for motivating personnel, assembling and managing high-performing teams, and actively facilitating the professional growth of employees. \nWide range of experience leading teams in start-up and Fortune 500 corporate settings across a variety of industries including software, hardware, information technology and manufacturing.  \n \nCulturally adept with the experience to manage teams and drive results across multiple geographies. Effective identifying and exploring new markets, creating compelling business cases, launching products and building brands. Budget management from $500K to $265 MM. \n \nSpecialties: Corporate Development & Planning • Market & Competitive Analysis • Operations • Product Strategy • Distribution & Channels Strategy • Analyst & Media Relations • Full P&L Responsibility Innovative, dynamic and results-oriented executive with proven success growing companies, markets and products. +20 years of B2B and B2C expertise with broad repertoire of experience across business functions including marketing, product management and operations. Experienced executive team member responsible for developing and implementing profitable and scalable strategic business and operational plans to deliver top-line revenue and bottom-line earnings. \nSkilled at understanding the \"big picture\" and bringing new perspective to core business issues. Exceptional ability to juggle strategic and tactical demands while energizing cross-functional teams to achieve results. Collaborative style to build strong relationships with other executives, customers, partners, vendors and colleagues. \nPassion for motivating personnel, assembling and managing high-performing teams, and actively facilitating the professional growth of employees. \nWide range of experience leading teams in start-up and Fortune 500 corporate settings across a variety of industries including software, hardware, information technology and manufacturing.  \n \nCulturally adept with the experience to manage teams and drive results across multiple geographies. Effective identifying and exploring new markets, creating compelling business cases, launching products and building brands. Budget management from $500K to $265 MM. \n \nSpecialties: Corporate Development & Planning • Market & Competitive Analysis • Operations • Product Strategy • Distribution & Channels Strategy • Analyst & Media Relations • Full P&L Responsibility Experience Vice President, Marketing Northwest Analytics July 2010  – Present (5 years 2 months) Portland, Oregon Northwest Analytics enables more than 3,000 global manufacturing companies to unlock the full potential of existing process data by giving them actionable information through analytics. \n \nKey member of the executive management team directly responsible for the company’s fiscal performance. Also lead and drive all aspects of marketing including: market analysis & segmentation; competitive analysis &, positioning; strategic & OEM partnership development/acquisitions; product strategy & definition; product marketing & pricing; analyst relations; distribution channels development; media relations; lead generation/nurturing programs; SEO/SEM; and marketing operations. P&L responsibility. \n \nDevelop and drive go-to-market strategies for new product offerings, content marketing programs, event marketing, sales enablement, and using marketing automation solutions. \n \nBuild and expand the Northwest Analytics brand globally via thought leadership, executive presentations, industry speakerships, primary research, analyst engagement and media campaigns. Led repositioning and rebranding efforts based on market shifts to effectively gain market support and acceptance. \n \nFeatured speaker at numerous global industry events including BIT World Congress (China); ICOSSE (Hungary); Industrial Automation (China); ARC China; SMTA China; CNCiC Customer Forum (China). Member, Board of Advisors West Coast Sailing February 2010  – Present (5 years 7 months) Portland, Orregon Provide external perspective and inputs regarding operational organization, performance & optimization, market stratiegies, and fiscal performance. Sabbatical Sabbatical April 2009  –  June 2010  (1 year 3 months) Executive Vice President, Marketing Coaxis, Inc. April 2006  –  March 2009  (3 years) Portland, Oregon Area Retail Marketing Manager Intel Corporation July 2004  –  April 2006  (1 year 10 months) Portland, o Worldwide Campaign Strategy Manager Intel Corporation June 2002  –  July 2004  (2 years 2 months) Portland, ore Marketing Communications Manager Intel Corporation July 2000  –  June 2002  (2 years) Hillsboro, Oregon Marketing/Channel Marketing Xerox/Tektronix May 1997  –  June 2000  (3 years 2 months) Wilsonville, Oregon Vice President, Marketing Northwest Analytics July 2010  – Present (5 years 2 months) Portland, Oregon Northwest Analytics enables more than 3,000 global manufacturing companies to unlock the full potential of existing process data by giving them actionable information through analytics. \n \nKey member of the executive management team directly responsible for the company’s fiscal performance. Also lead and drive all aspects of marketing including: market analysis & segmentation; competitive analysis &, positioning; strategic & OEM partnership development/acquisitions; product strategy & definition; product marketing & pricing; analyst relations; distribution channels development; media relations; lead generation/nurturing programs; SEO/SEM; and marketing operations. P&L responsibility. \n \nDevelop and drive go-to-market strategies for new product offerings, content marketing programs, event marketing, sales enablement, and using marketing automation solutions. \n \nBuild and expand the Northwest Analytics brand globally via thought leadership, executive presentations, industry speakerships, primary research, analyst engagement and media campaigns. Led repositioning and rebranding efforts based on market shifts to effectively gain market support and acceptance. \n \nFeatured speaker at numerous global industry events including BIT World Congress (China); ICOSSE (Hungary); Industrial Automation (China); ARC China; SMTA China; CNCiC Customer Forum (China). Vice President, Marketing Northwest Analytics July 2010  – Present (5 years 2 months) Portland, Oregon Northwest Analytics enables more than 3,000 global manufacturing companies to unlock the full potential of existing process data by giving them actionable information through analytics. \n \nKey member of the executive management team directly responsible for the company’s fiscal performance. Also lead and drive all aspects of marketing including: market analysis & segmentation; competitive analysis &, positioning; strategic & OEM partnership development/acquisitions; product strategy & definition; product marketing & pricing; analyst relations; distribution channels development; media relations; lead generation/nurturing programs; SEO/SEM; and marketing operations. P&L responsibility. \n \nDevelop and drive go-to-market strategies for new product offerings, content marketing programs, event marketing, sales enablement, and using marketing automation solutions. \n \nBuild and expand the Northwest Analytics brand globally via thought leadership, executive presentations, industry speakerships, primary research, analyst engagement and media campaigns. Led repositioning and rebranding efforts based on market shifts to effectively gain market support and acceptance. \n \nFeatured speaker at numerous global industry events including BIT World Congress (China); ICOSSE (Hungary); Industrial Automation (China); ARC China; SMTA China; CNCiC Customer Forum (China). Member, Board of Advisors West Coast Sailing February 2010  – Present (5 years 7 months) Portland, Orregon Provide external perspective and inputs regarding operational organization, performance & optimization, market stratiegies, and fiscal performance. Member, Board of Advisors West Coast Sailing February 2010  – Present (5 years 7 months) Portland, Orregon Provide external perspective and inputs regarding operational organization, performance & optimization, market stratiegies, and fiscal performance. Sabbatical Sabbatical April 2009  –  June 2010  (1 year 3 months) Sabbatical Sabbatical April 2009  –  June 2010  (1 year 3 months) Executive Vice President, Marketing Coaxis, Inc. April 2006  –  March 2009  (3 years) Portland, Oregon Area Executive Vice President, Marketing Coaxis, Inc. April 2006  –  March 2009  (3 years) Portland, Oregon Area Retail Marketing Manager Intel Corporation July 2004  –  April 2006  (1 year 10 months) Portland, o Retail Marketing Manager Intel Corporation July 2004  –  April 2006  (1 year 10 months) Portland, o Worldwide Campaign Strategy Manager Intel Corporation June 2002  –  July 2004  (2 years 2 months) Portland, ore Worldwide Campaign Strategy Manager Intel Corporation June 2002  –  July 2004  (2 years 2 months) Portland, ore Marketing Communications Manager Intel Corporation July 2000  –  June 2002  (2 years) Hillsboro, Oregon Marketing Communications Manager Intel Corporation July 2000  –  June 2002  (2 years) Hillsboro, Oregon Marketing/Channel Marketing Xerox/Tektronix May 1997  –  June 2000  (3 years 2 months) Wilsonville, Oregon Marketing/Channel Marketing Xerox/Tektronix May 1997  –  June 2000  (3 years 2 months) Wilsonville, Oregon Skills Strategic Partnerships Strategic Planning Operations Management Executive Management Marketing Strategy Corporate Positioning Public Speaking Strategy High Performance Teams Product Marketing New Business Development Marketing Pricing Strategy Multi-channel Marketing Enterprise Software Lead Generation Messaging Positioning Integrated Marketing Product Development Industry Analyst... New Channel Development Analyst Relations Marketing Communications Competitive Analysis Management See 11+     See less Skills  Strategic Partnerships Strategic Planning Operations Management Executive Management Marketing Strategy Corporate Positioning Public Speaking Strategy High Performance Teams Product Marketing New Business Development Marketing Pricing Strategy Multi-channel Marketing Enterprise Software Lead Generation Messaging Positioning Integrated Marketing Product Development Industry Analyst... New Channel Development Analyst Relations Marketing Communications Competitive Analysis Management See 11+     See less Strategic Partnerships Strategic Planning Operations Management Executive Management Marketing Strategy Corporate Positioning Public Speaking Strategy High Performance Teams Product Marketing New Business Development Marketing Pricing Strategy Multi-channel Marketing Enterprise Software Lead Generation Messaging Positioning Integrated Marketing Product Development Industry Analyst... New Channel Development Analyst Relations Marketing Communications Competitive Analysis Management See 11+     See less Strategic Partnerships Strategic Planning Operations Management Executive Management Marketing Strategy Corporate Positioning Public Speaking Strategy High Performance Teams Product Marketing New Business Development Marketing Pricing Strategy Multi-channel Marketing Enterprise Software Lead Generation Messaging Positioning Integrated Marketing Product Development Industry Analyst... New Channel Development Analyst Relations Marketing Communications Competitive Analysis Management See 11+     See less Honors & Awards ", "Summary I'm a big picture guy who loves to really dig in and work the details. I derive great satisfaction from solving problems, either leading a team, or working solo. Often, the biggest challenge is framing the right problem to be solved. \u2028\u2028I am not concerned about having a certain title - I just want to make a key contribution. \n \nWhen I first joined Xircom, I took a very hands-on approach. I focused on a key product and took it apart, literally and figuratively. I examined the bill of materials and spoke with our worldwide marketing and sales teams to understand the need for specific software and capabilities in different markets for this product. I determined that much of the software was no longer needed, and that 90% of the unit sales were to corporate customers (who had technicians install the product and never even saw the fancy packaging). In the end, I was able to save the company over $5 million annually by reducing software license fees and simplifying packaging.   \n \nIn the process, I built strong relationships with many new (to me) groups within the company, and earned the respect of the product manager team and senior management by giving them all a different perspective on profitability and problem-solving. \n \nLater at Xircom and then at Intel, I took this same big picture first, then detail-oriented, ground-up approach to understand all facets of the real problems we needed to solve. \n \nAs a result, I became focused on putting together more complicated products that involved hardware and software as well as partnerships and services. I negotiated most of these deals, and found this to be exceptionally rewarding work. I seek great opportunity for me to use these skills to help drive cross functional teams in the development and delivery of more complex product offerings in any business environment. \n \nMarketing / Communications \nProduct Management \nBusiness Development \nChange Management \nProject Management \nProcess Improvement \nEnvironmental Affairs Summary I'm a big picture guy who loves to really dig in and work the details. I derive great satisfaction from solving problems, either leading a team, or working solo. Often, the biggest challenge is framing the right problem to be solved. \u2028\u2028I am not concerned about having a certain title - I just want to make a key contribution. \n \nWhen I first joined Xircom, I took a very hands-on approach. I focused on a key product and took it apart, literally and figuratively. I examined the bill of materials and spoke with our worldwide marketing and sales teams to understand the need for specific software and capabilities in different markets for this product. I determined that much of the software was no longer needed, and that 90% of the unit sales were to corporate customers (who had technicians install the product and never even saw the fancy packaging). In the end, I was able to save the company over $5 million annually by reducing software license fees and simplifying packaging.   \n \nIn the process, I built strong relationships with many new (to me) groups within the company, and earned the respect of the product manager team and senior management by giving them all a different perspective on profitability and problem-solving. \n \nLater at Xircom and then at Intel, I took this same big picture first, then detail-oriented, ground-up approach to understand all facets of the real problems we needed to solve. \n \nAs a result, I became focused on putting together more complicated products that involved hardware and software as well as partnerships and services. I negotiated most of these deals, and found this to be exceptionally rewarding work. I seek great opportunity for me to use these skills to help drive cross functional teams in the development and delivery of more complex product offerings in any business environment. \n \nMarketing / Communications \nProduct Management \nBusiness Development \nChange Management \nProject Management \nProcess Improvement \nEnvironmental Affairs I'm a big picture guy who loves to really dig in and work the details. I derive great satisfaction from solving problems, either leading a team, or working solo. Often, the biggest challenge is framing the right problem to be solved. \u2028\u2028I am not concerned about having a certain title - I just want to make a key contribution. \n \nWhen I first joined Xircom, I took a very hands-on approach. I focused on a key product and took it apart, literally and figuratively. I examined the bill of materials and spoke with our worldwide marketing and sales teams to understand the need for specific software and capabilities in different markets for this product. I determined that much of the software was no longer needed, and that 90% of the unit sales were to corporate customers (who had technicians install the product and never even saw the fancy packaging). In the end, I was able to save the company over $5 million annually by reducing software license fees and simplifying packaging.   \n \nIn the process, I built strong relationships with many new (to me) groups within the company, and earned the respect of the product manager team and senior management by giving them all a different perspective on profitability and problem-solving. \n \nLater at Xircom and then at Intel, I took this same big picture first, then detail-oriented, ground-up approach to understand all facets of the real problems we needed to solve. \n \nAs a result, I became focused on putting together more complicated products that involved hardware and software as well as partnerships and services. I negotiated most of these deals, and found this to be exceptionally rewarding work. I seek great opportunity for me to use these skills to help drive cross functional teams in the development and delivery of more complex product offerings in any business environment. \n \nMarketing / Communications \nProduct Management \nBusiness Development \nChange Management \nProject Management \nProcess Improvement \nEnvironmental Affairs I'm a big picture guy who loves to really dig in and work the details. I derive great satisfaction from solving problems, either leading a team, or working solo. Often, the biggest challenge is framing the right problem to be solved. \u2028\u2028I am not concerned about having a certain title - I just want to make a key contribution. \n \nWhen I first joined Xircom, I took a very hands-on approach. I focused on a key product and took it apart, literally and figuratively. I examined the bill of materials and spoke with our worldwide marketing and sales teams to understand the need for specific software and capabilities in different markets for this product. I determined that much of the software was no longer needed, and that 90% of the unit sales were to corporate customers (who had technicians install the product and never even saw the fancy packaging). In the end, I was able to save the company over $5 million annually by reducing software license fees and simplifying packaging.   \n \nIn the process, I built strong relationships with many new (to me) groups within the company, and earned the respect of the product manager team and senior management by giving them all a different perspective on profitability and problem-solving. \n \nLater at Xircom and then at Intel, I took this same big picture first, then detail-oriented, ground-up approach to understand all facets of the real problems we needed to solve. \n \nAs a result, I became focused on putting together more complicated products that involved hardware and software as well as partnerships and services. I negotiated most of these deals, and found this to be exceptionally rewarding work. I seek great opportunity for me to use these skills to help drive cross functional teams in the development and delivery of more complex product offerings in any business environment. \n \nMarketing / Communications \nProduct Management \nBusiness Development \nChange Management \nProject Management \nProcess Improvement \nEnvironmental Affairs Experience Principal Zephyr Capital Ventures 2012  – Present (3 years) Portland, Oregon Area I provide marketing, communications, product management, change management, project management, and process improvement expertise to businesses in order to help them achieve greater efficiency / sales / profitability.  \n Sr. IT Communications/ Change Manager - Contract Con-way, Inc. 2013  –  2014  (1 year) Portland, Oregon Area CON-WAY, Portland, OR\t \n \nSenior IT / Communications Manager\t \n \nProject and change management for strategic initiatives. Developed and managed overall communications strategy planning for major IT infrastructure program - Network and Telephony, a $300 million + program to upgrade data and telephony networks at 400 company sites worldwide. Created strategy and content for email, surveys, video, digital signage, web sites, newsletters and other channels. \n \n•\tDeveloped customer response analysis and metrics that actually drove significant improvements in project team performance with demonstrated gains in overall customer satisfaction. \n \n•\tCreated concepts for internal ad campaign to publicize infrastructure initiatives and enhance perception of IT initiatives. Managed design team efforts via print, online and video media. Senior Marketing / Communications Manager Intel Corporation 2008  –  2012  (4 years) Portland, Oregon Area Communications / PR advisor and consultant to business unit VPs and General Managers. Created and executed overall communications, change, and brand management strategy for Intel Product Development and Manufacturing organizations. Wrote, produced and edited content for video productions, events, social media, digital signage, photography, web sites, newsletters, and training. \n \n•\tI wrote key communications directly for multiple VP's and General Managers. My goal was to speak in their voice and create \"stories\" that resonated with our audiences. My favorite response from a VP regarding my work: \"I love it. It made me proud and touched my heart.\" \n \n•\tDeveloped complete communications plan for major program designed to drive employee submissions for new product concept development ideas – resulted in 4x increase in year to year submissions. \n \n•\tReceived Intel Division Recognition Award for comprehensive communications campaign that targeted Intel’s entire 100,000 employee population, highlighting critical programs that benefited all employees. Senior Business Marketing Manager Intel Corporation 2006  –  2008  (2 years) Portland, Oregon Area Senior Business and Marketing advisor to multiple product concept development teams. Developed market research, key product concepts, usage scenarios, business models, business plans, marketing collateral, and other elements for new product/concept efforts within the User Centered Design team.  \n \n•\tAccelerated product concept prototyping process (estimated savings ~ 40% less time) - providing business direction that eliminated “dead end” development pathways and maintained emphasis on critical business objectives. \n \n•\tGuided team of bright and talented top employees to deliver tightly focused, real world oriented future vision of computing and Intel’s role in that future - accessible and inspiring to the team, compelling and prescriptive to senior management. Senior Marketing Development Manager Intel Corporation 2001  –  2006  (5 years) Portland, Oregon Area Managed business development team responsible for closing all revenue / strategic deals. Reported directly to GM – drove major projects, deals, and alliances. Evaluated, negotiated, and closed key ingredient deals for new “innovative platform PCs”. Owned relationships with Microsoft, Logitech, FIC, Tatung, Hewlett Packard, and Gateway, as well as ecosystem deals with many smaller hardware and software vendors. \n \n•\tDeveloped new processes to simplify and speed up deal approval with senior management, resulting in 30-40% faster deal approvals and shortened product cycles. \n \n•\tEstablished clearer and more precise strategies for engaging with software and hardware vendors as well as OEMs, resulting in less overlap and faster completion of key deals. Senior Director, Business Development Xircom 1999  –  2001  (2 years) Thousand Oaks, CA Owned and managed critical relationships with key strategic partners including Microsoft, Ericsson, Nortel, and Cisco, and technology start-ups such as AirPrime and Atheros. Created and executed expansive wireless marketing strategy while working directly for CEO.  \n \n•\tMember of executive management team \n \n•\tNegotiated and managed all business aspects of $50 Million acquisition – Omnipoint Technologies (GSM/GPRS) from VoiceStream. \n \n•\tNegotiated key business alliances with Cisco and Ericsson - result - over 50% increase in market opportunity for Xircom wireless products. Director, Worldwide Product Management Xircom 1997  –  1999  (2 years) Thousand Oaks, CA Complete cradle to grave product management responsibility for all Xircom products, worldwide. Managed a team of 15 product managers, marketing managers, and documentation specialists. \n \n•\tTripled corporate revenue from $170 to $500 M + in less than 3 years. \n \n•\tGrew market share from 20% to over 40% in less than 3 years. \n \n•\tIntroduced 19 new products to market in one year. \n \n•\tSaved over $5 M in product costs by re-designing s/w bundle and packaging. Product Line Manager AST Computer 1991  –  1997  (6 years) Irvine, CA Complete cradle to grave product management/ life cycle responsibility for all Bravo family desktop computers, worldwide. Managed a team of 7 product/ marketing managers. \n•\tGrew Bravo sales volume from $250M to $1B in four years.  \n•\tDoubled market share in less than 3 years. Principal Zephyr Capital Ventures 2012  – Present (3 years) Portland, Oregon Area I provide marketing, communications, product management, change management, project management, and process improvement expertise to businesses in order to help them achieve greater efficiency / sales / profitability.  \n Principal Zephyr Capital Ventures 2012  – Present (3 years) Portland, Oregon Area I provide marketing, communications, product management, change management, project management, and process improvement expertise to businesses in order to help them achieve greater efficiency / sales / profitability.  \n Sr. IT Communications/ Change Manager - Contract Con-way, Inc. 2013  –  2014  (1 year) Portland, Oregon Area CON-WAY, Portland, OR\t \n \nSenior IT / Communications Manager\t \n \nProject and change management for strategic initiatives. Developed and managed overall communications strategy planning for major IT infrastructure program - Network and Telephony, a $300 million + program to upgrade data and telephony networks at 400 company sites worldwide. Created strategy and content for email, surveys, video, digital signage, web sites, newsletters and other channels. \n \n•\tDeveloped customer response analysis and metrics that actually drove significant improvements in project team performance with demonstrated gains in overall customer satisfaction. \n \n•\tCreated concepts for internal ad campaign to publicize infrastructure initiatives and enhance perception of IT initiatives. Managed design team efforts via print, online and video media. Sr. IT Communications/ Change Manager - Contract Con-way, Inc. 2013  –  2014  (1 year) Portland, Oregon Area CON-WAY, Portland, OR\t \n \nSenior IT / Communications Manager\t \n \nProject and change management for strategic initiatives. Developed and managed overall communications strategy planning for major IT infrastructure program - Network and Telephony, a $300 million + program to upgrade data and telephony networks at 400 company sites worldwide. Created strategy and content for email, surveys, video, digital signage, web sites, newsletters and other channels. \n \n•\tDeveloped customer response analysis and metrics that actually drove significant improvements in project team performance with demonstrated gains in overall customer satisfaction. \n \n•\tCreated concepts for internal ad campaign to publicize infrastructure initiatives and enhance perception of IT initiatives. Managed design team efforts via print, online and video media. Senior Marketing / Communications Manager Intel Corporation 2008  –  2012  (4 years) Portland, Oregon Area Communications / PR advisor and consultant to business unit VPs and General Managers. Created and executed overall communications, change, and brand management strategy for Intel Product Development and Manufacturing organizations. Wrote, produced and edited content for video productions, events, social media, digital signage, photography, web sites, newsletters, and training. \n \n•\tI wrote key communications directly for multiple VP's and General Managers. My goal was to speak in their voice and create \"stories\" that resonated with our audiences. My favorite response from a VP regarding my work: \"I love it. It made me proud and touched my heart.\" \n \n•\tDeveloped complete communications plan for major program designed to drive employee submissions for new product concept development ideas – resulted in 4x increase in year to year submissions. \n \n•\tReceived Intel Division Recognition Award for comprehensive communications campaign that targeted Intel’s entire 100,000 employee population, highlighting critical programs that benefited all employees. Senior Marketing / Communications Manager Intel Corporation 2008  –  2012  (4 years) Portland, Oregon Area Communications / PR advisor and consultant to business unit VPs and General Managers. Created and executed overall communications, change, and brand management strategy for Intel Product Development and Manufacturing organizations. Wrote, produced and edited content for video productions, events, social media, digital signage, photography, web sites, newsletters, and training. \n \n•\tI wrote key communications directly for multiple VP's and General Managers. My goal was to speak in their voice and create \"stories\" that resonated with our audiences. My favorite response from a VP regarding my work: \"I love it. It made me proud and touched my heart.\" \n \n•\tDeveloped complete communications plan for major program designed to drive employee submissions for new product concept development ideas – resulted in 4x increase in year to year submissions. \n \n•\tReceived Intel Division Recognition Award for comprehensive communications campaign that targeted Intel’s entire 100,000 employee population, highlighting critical programs that benefited all employees. Senior Business Marketing Manager Intel Corporation 2006  –  2008  (2 years) Portland, Oregon Area Senior Business and Marketing advisor to multiple product concept development teams. Developed market research, key product concepts, usage scenarios, business models, business plans, marketing collateral, and other elements for new product/concept efforts within the User Centered Design team.  \n \n•\tAccelerated product concept prototyping process (estimated savings ~ 40% less time) - providing business direction that eliminated “dead end” development pathways and maintained emphasis on critical business objectives. \n \n•\tGuided team of bright and talented top employees to deliver tightly focused, real world oriented future vision of computing and Intel’s role in that future - accessible and inspiring to the team, compelling and prescriptive to senior management. Senior Business Marketing Manager Intel Corporation 2006  –  2008  (2 years) Portland, Oregon Area Senior Business and Marketing advisor to multiple product concept development teams. Developed market research, key product concepts, usage scenarios, business models, business plans, marketing collateral, and other elements for new product/concept efforts within the User Centered Design team.  \n \n•\tAccelerated product concept prototyping process (estimated savings ~ 40% less time) - providing business direction that eliminated “dead end” development pathways and maintained emphasis on critical business objectives. \n \n•\tGuided team of bright and talented top employees to deliver tightly focused, real world oriented future vision of computing and Intel’s role in that future - accessible and inspiring to the team, compelling and prescriptive to senior management. Senior Marketing Development Manager Intel Corporation 2001  –  2006  (5 years) Portland, Oregon Area Managed business development team responsible for closing all revenue / strategic deals. Reported directly to GM – drove major projects, deals, and alliances. Evaluated, negotiated, and closed key ingredient deals for new “innovative platform PCs”. Owned relationships with Microsoft, Logitech, FIC, Tatung, Hewlett Packard, and Gateway, as well as ecosystem deals with many smaller hardware and software vendors. \n \n•\tDeveloped new processes to simplify and speed up deal approval with senior management, resulting in 30-40% faster deal approvals and shortened product cycles. \n \n•\tEstablished clearer and more precise strategies for engaging with software and hardware vendors as well as OEMs, resulting in less overlap and faster completion of key deals. Senior Marketing Development Manager Intel Corporation 2001  –  2006  (5 years) Portland, Oregon Area Managed business development team responsible for closing all revenue / strategic deals. Reported directly to GM – drove major projects, deals, and alliances. Evaluated, negotiated, and closed key ingredient deals for new “innovative platform PCs”. Owned relationships with Microsoft, Logitech, FIC, Tatung, Hewlett Packard, and Gateway, as well as ecosystem deals with many smaller hardware and software vendors. \n \n•\tDeveloped new processes to simplify and speed up deal approval with senior management, resulting in 30-40% faster deal approvals and shortened product cycles. \n \n•\tEstablished clearer and more precise strategies for engaging with software and hardware vendors as well as OEMs, resulting in less overlap and faster completion of key deals. Senior Director, Business Development Xircom 1999  –  2001  (2 years) Thousand Oaks, CA Owned and managed critical relationships with key strategic partners including Microsoft, Ericsson, Nortel, and Cisco, and technology start-ups such as AirPrime and Atheros. Created and executed expansive wireless marketing strategy while working directly for CEO.  \n \n•\tMember of executive management team \n \n•\tNegotiated and managed all business aspects of $50 Million acquisition – Omnipoint Technologies (GSM/GPRS) from VoiceStream. \n \n•\tNegotiated key business alliances with Cisco and Ericsson - result - over 50% increase in market opportunity for Xircom wireless products. Senior Director, Business Development Xircom 1999  –  2001  (2 years) Thousand Oaks, CA Owned and managed critical relationships with key strategic partners including Microsoft, Ericsson, Nortel, and Cisco, and technology start-ups such as AirPrime and Atheros. Created and executed expansive wireless marketing strategy while working directly for CEO.  \n \n•\tMember of executive management team \n \n•\tNegotiated and managed all business aspects of $50 Million acquisition – Omnipoint Technologies (GSM/GPRS) from VoiceStream. \n \n•\tNegotiated key business alliances with Cisco and Ericsson - result - over 50% increase in market opportunity for Xircom wireless products. Director, Worldwide Product Management Xircom 1997  –  1999  (2 years) Thousand Oaks, CA Complete cradle to grave product management responsibility for all Xircom products, worldwide. Managed a team of 15 product managers, marketing managers, and documentation specialists. \n \n•\tTripled corporate revenue from $170 to $500 M + in less than 3 years. \n \n•\tGrew market share from 20% to over 40% in less than 3 years. \n \n•\tIntroduced 19 new products to market in one year. \n \n•\tSaved over $5 M in product costs by re-designing s/w bundle and packaging. Director, Worldwide Product Management Xircom 1997  –  1999  (2 years) Thousand Oaks, CA Complete cradle to grave product management responsibility for all Xircom products, worldwide. Managed a team of 15 product managers, marketing managers, and documentation specialists. \n \n•\tTripled corporate revenue from $170 to $500 M + in less than 3 years. \n \n•\tGrew market share from 20% to over 40% in less than 3 years. \n \n•\tIntroduced 19 new products to market in one year. \n \n•\tSaved over $5 M in product costs by re-designing s/w bundle and packaging. Product Line Manager AST Computer 1991  –  1997  (6 years) Irvine, CA Complete cradle to grave product management/ life cycle responsibility for all Bravo family desktop computers, worldwide. Managed a team of 7 product/ marketing managers. \n•\tGrew Bravo sales volume from $250M to $1B in four years.  \n•\tDoubled market share in less than 3 years. Product Line Manager AST Computer 1991  –  1997  (6 years) Irvine, CA Complete cradle to grave product management/ life cycle responsibility for all Bravo family desktop computers, worldwide. Managed a team of 7 product/ marketing managers. \n•\tGrew Bravo sales volume from $250M to $1B in four years.  \n•\tDoubled market share in less than 3 years. Languages English Native or bilingual proficiency Spanish English Native or bilingual proficiency Spanish English Native or bilingual proficiency Spanish Native or bilingual proficiency Skills Go-to-market Strategy Strategic Partnerships Product Marketing Program Management Product Management Multi-channel Marketing Business Development Competitive Analysis Strategy Marketing Start-ups Corporate Communications Corporate Affairs Environmental Leadership Corporate Social... Cross-functional Team... Product Launch Marketing Strategy E-commerce Business Alliances Wireless SaaS Product Development Mobile Devices Enterprise Software Market Research Strategic Communications Leadership Executive Management Strategic Planning Business Planning Demand Generation Mergers & Acquisitions Project Planning Process Improvement Messaging Integrated Marketing Analyst Relations Social Media Positioning Lead Generation Marketing Communications CRM Sales Enablement See 29+     See less Skills  Go-to-market Strategy Strategic Partnerships Product Marketing Program Management Product Management Multi-channel Marketing Business Development Competitive Analysis Strategy Marketing Start-ups Corporate Communications Corporate Affairs Environmental Leadership Corporate Social... Cross-functional Team... Product Launch Marketing Strategy E-commerce Business Alliances Wireless SaaS Product Development Mobile Devices Enterprise Software Market Research Strategic Communications Leadership Executive Management Strategic Planning Business Planning Demand Generation Mergers & Acquisitions Project Planning Process Improvement Messaging Integrated Marketing Analyst Relations Social Media Positioning Lead Generation Marketing Communications CRM Sales Enablement See 29+     See less Go-to-market Strategy Strategic Partnerships Product Marketing Program Management Product Management Multi-channel Marketing Business Development Competitive Analysis Strategy Marketing Start-ups Corporate Communications Corporate Affairs Environmental Leadership Corporate Social... Cross-functional Team... Product Launch Marketing Strategy E-commerce Business Alliances Wireless SaaS Product Development Mobile Devices Enterprise Software Market Research Strategic Communications Leadership Executive Management Strategic Planning Business Planning Demand Generation Mergers & Acquisitions Project Planning Process Improvement Messaging Integrated Marketing Analyst Relations Social Media Positioning Lead Generation Marketing Communications CRM Sales Enablement See 29+     See less Go-to-market Strategy Strategic Partnerships Product Marketing Program Management Product Management Multi-channel Marketing Business Development Competitive Analysis Strategy Marketing Start-ups Corporate Communications Corporate Affairs Environmental Leadership Corporate Social... Cross-functional Team... Product Launch Marketing Strategy E-commerce Business Alliances Wireless SaaS Product Development Mobile Devices Enterprise Software Market Research Strategic Communications Leadership Executive Management Strategic Planning Business Planning Demand Generation Mergers & Acquisitions Project Planning Process Improvement Messaging Integrated Marketing Analyst Relations Social Media Positioning Lead Generation Marketing Communications CRM Sales Enablement See 29+     See less ", "Skills Cisco Technologies Business Development Marketing Communications Channel Solution Selling EMEA Marketing Direct Marketing SaaS Integrated Marketing Go-to-market Strategy Telecommunications Business Alliances Unified Communications Product Management Strategy Pre-sales Cloud Computing Networking Sales Enablement See 5+     See less Skills  Cisco Technologies Business Development Marketing Communications Channel Solution Selling EMEA Marketing Direct Marketing SaaS Integrated Marketing Go-to-market Strategy Telecommunications Business Alliances Unified Communications Product Management Strategy Pre-sales Cloud Computing Networking Sales Enablement See 5+     See less Cisco Technologies Business Development Marketing Communications Channel Solution Selling EMEA Marketing Direct Marketing SaaS Integrated Marketing Go-to-market Strategy Telecommunications Business Alliances Unified Communications Product Management Strategy Pre-sales Cloud Computing Networking Sales Enablement See 5+     See less Cisco Technologies Business Development Marketing Communications Channel Solution Selling EMEA Marketing Direct Marketing SaaS Integrated Marketing Go-to-market Strategy Telecommunications Business Alliances Unified Communications Product Management Strategy Pre-sales Cloud Computing Networking Sales Enablement See 5+     See less ", "Languages English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Project Management Online Advertising Program Management Strategy Budgets Team Management Marketing Communications Leadership Internal Communications Product Marketing Vendor Management B2B Marketing Competitive Analysis Product Management Cross-functional Team... Strategic Partnerships Multi-channel Marketing Go-to-market Strategy See 3+     See less Skills  Project Management Online Advertising Program Management Strategy Budgets Team Management Marketing Communications Leadership Internal Communications Product Marketing Vendor Management B2B Marketing Competitive Analysis Product Management Cross-functional Team... Strategic Partnerships Multi-channel Marketing Go-to-market Strategy See 3+     See less Project Management Online Advertising Program Management Strategy Budgets Team Management Marketing Communications Leadership Internal Communications Product Marketing Vendor Management B2B Marketing Competitive Analysis Product Management Cross-functional Team... Strategic Partnerships Multi-channel Marketing Go-to-market Strategy See 3+     See less Project Management Online Advertising Program Management Strategy Budgets Team Management Marketing Communications Leadership Internal Communications Product Marketing Vendor Management B2B Marketing Competitive Analysis Product Management Cross-functional Team... Strategic Partnerships Multi-channel Marketing Go-to-market Strategy See 3+     See less ", "Skills Copywriting Budgets Messaging Email Marketing Marketing Communications Strategy Content Development Marketing Enterprise Software Management Public Relations Internal Communications Collateral Social Media Content Strategy Government Agencies See 1+     See less Skills  Copywriting Budgets Messaging Email Marketing Marketing Communications Strategy Content Development Marketing Enterprise Software Management Public Relations Internal Communications Collateral Social Media Content Strategy Government Agencies See 1+     See less Copywriting Budgets Messaging Email Marketing Marketing Communications Strategy Content Development Marketing Enterprise Software Management Public Relations Internal Communications Collateral Social Media Content Strategy Government Agencies See 1+     See less Copywriting Budgets Messaging Email Marketing Marketing Communications Strategy Content Development Marketing Enterprise Software Management Public Relations Internal Communications Collateral Social Media Content Strategy Government Agencies See 1+     See less ", "Summary Dynamic, passionate and ambitious marketing communications manager with a consistent track-record for delivering results in strategic planning, brand development and marketing operations accelerating worldwide sales, increasing brand equity and driving cross-functional marketing results. \n \nProven Skills  \n•\tDevelop and Execute Marketing Strategies & Campaigns  \n•\tExecutive Keynote Strategy & Content Development \n•\tStrong Strategic Messaging Implementation \n•\tEnhance Product Positioning & Branding \n•\tDevelop & Execution of Merger & Acquisition Strategies Summary Dynamic, passionate and ambitious marketing communications manager with a consistent track-record for delivering results in strategic planning, brand development and marketing operations accelerating worldwide sales, increasing brand equity and driving cross-functional marketing results. \n \nProven Skills  \n•\tDevelop and Execute Marketing Strategies & Campaigns  \n•\tExecutive Keynote Strategy & Content Development \n•\tStrong Strategic Messaging Implementation \n•\tEnhance Product Positioning & Branding \n•\tDevelop & Execution of Merger & Acquisition Strategies Dynamic, passionate and ambitious marketing communications manager with a consistent track-record for delivering results in strategic planning, brand development and marketing operations accelerating worldwide sales, increasing brand equity and driving cross-functional marketing results. \n \nProven Skills  \n•\tDevelop and Execute Marketing Strategies & Campaigns  \n•\tExecutive Keynote Strategy & Content Development \n•\tStrong Strategic Messaging Implementation \n•\tEnhance Product Positioning & Branding \n•\tDevelop & Execution of Merger & Acquisition Strategies Dynamic, passionate and ambitious marketing communications manager with a consistent track-record for delivering results in strategic planning, brand development and marketing operations accelerating worldwide sales, increasing brand equity and driving cross-functional marketing results. \n \nProven Skills  \n•\tDevelop and Execute Marketing Strategies & Campaigns  \n•\tExecutive Keynote Strategy & Content Development \n•\tStrong Strategic Messaging Implementation \n•\tEnhance Product Positioning & Branding \n•\tDevelop & Execution of Merger & Acquisition Strategies Experience Marketing Communications Manager Intel Corporation November 2014  – Present (10 months) Santa Clara, CA Marketing Manager LSI, an Avago Technologies Company August 2012  –  November 2014  (2 years 4 months) Leading and managing the development, execution, implementation, and evaluation of marketing communications strategies and tactics including corporate communications, advertising, exhibits, public relations, digital, direct mail, collateral and merger & acquisitions with appropriate internal stakeholders and vendor partners to achieve corporate and marketing goals. Excellent collaboration and alignment skillset while driving on time and on budget execution of all programs. Outstanding strategy & development skills for internal and external executive speaking engagements.  \n \n•\tLSI website rebranding in 2013 increased web activity by 46% in 8 weeks; drove 18% new visitors \n•\tExecutive keynotes for internal and external speaking opportunities drove 5% increase in audience recognition year over year \n•\tDevelopment of new virtualized demos and high impact graphics resulted elevated brand experience and lowered CoO at Mobile World Congress Sr. Global MarCom Project Manager Coherent Inc April 2004  –  August 2012  (8 years 5 months) Santa Clara, CA Manage marketing and communications projects ranging from products, corporate, applications to service marketing. Effectively driving direct marketing, PR, product launches, advertising, web, tradeshows, articles, white papers, corporate messaging and sales collateral to increase lead generation, brand equity and sales revenue. \n \n• Creation of new web site (collaborative with MarCom team members), implemented in only 6 months, increased web traffic by 22% \n• Spearheaded annual report creation, driving cross functional teams (executives, legal, finance) to meet SEC filing timelines  \n• Creation of strong application focused direct marketing campaigns with segment marketing team, content development and direct marketing strategy resulted in response rates of over 30%. \n• Creation and execution of global trade show strategy which increased brand equity and sales opportunities \n• Manage and execute all global trade shows, including all show messaging, product layouts, graphics, collateral, press tours, press releases and equipment (86 annually). Reduced tradeshow expenses by 20% in the first year and continue to drive increase in leads year to year. \n• Vital member of acquisition integration teams to develop transition strategies pertaining to global tradeshows. \n• Strong management skills in cross-functional teams, global internal customers and external vendors, driving faster response rate, increasing efficiency and reducing overall MarCom expenses. Global Marketing Specialist Lambda Physik USA Inc January 2000  –  April 2004  (4 years 4 months) Ft. Lauderdale, FL Marketing Specialist Lambda Physik AG August 1998  –  January 2000  (1 year 6 months) Goettingen, Germany Marketing Communications Manager Intel Corporation November 2014  – Present (10 months) Santa Clara, CA Marketing Communications Manager Intel Corporation November 2014  – Present (10 months) Santa Clara, CA Marketing Manager LSI, an Avago Technologies Company August 2012  –  November 2014  (2 years 4 months) Leading and managing the development, execution, implementation, and evaluation of marketing communications strategies and tactics including corporate communications, advertising, exhibits, public relations, digital, direct mail, collateral and merger & acquisitions with appropriate internal stakeholders and vendor partners to achieve corporate and marketing goals. Excellent collaboration and alignment skillset while driving on time and on budget execution of all programs. Outstanding strategy & development skills for internal and external executive speaking engagements.  \n \n•\tLSI website rebranding in 2013 increased web activity by 46% in 8 weeks; drove 18% new visitors \n•\tExecutive keynotes for internal and external speaking opportunities drove 5% increase in audience recognition year over year \n•\tDevelopment of new virtualized demos and high impact graphics resulted elevated brand experience and lowered CoO at Mobile World Congress Marketing Manager LSI, an Avago Technologies Company August 2012  –  November 2014  (2 years 4 months) Leading and managing the development, execution, implementation, and evaluation of marketing communications strategies and tactics including corporate communications, advertising, exhibits, public relations, digital, direct mail, collateral and merger & acquisitions with appropriate internal stakeholders and vendor partners to achieve corporate and marketing goals. Excellent collaboration and alignment skillset while driving on time and on budget execution of all programs. Outstanding strategy & development skills for internal and external executive speaking engagements.  \n \n•\tLSI website rebranding in 2013 increased web activity by 46% in 8 weeks; drove 18% new visitors \n•\tExecutive keynotes for internal and external speaking opportunities drove 5% increase in audience recognition year over year \n•\tDevelopment of new virtualized demos and high impact graphics resulted elevated brand experience and lowered CoO at Mobile World Congress Sr. Global MarCom Project Manager Coherent Inc April 2004  –  August 2012  (8 years 5 months) Santa Clara, CA Manage marketing and communications projects ranging from products, corporate, applications to service marketing. Effectively driving direct marketing, PR, product launches, advertising, web, tradeshows, articles, white papers, corporate messaging and sales collateral to increase lead generation, brand equity and sales revenue. \n \n• Creation of new web site (collaborative with MarCom team members), implemented in only 6 months, increased web traffic by 22% \n• Spearheaded annual report creation, driving cross functional teams (executives, legal, finance) to meet SEC filing timelines  \n• Creation of strong application focused direct marketing campaigns with segment marketing team, content development and direct marketing strategy resulted in response rates of over 30%. \n• Creation and execution of global trade show strategy which increased brand equity and sales opportunities \n• Manage and execute all global trade shows, including all show messaging, product layouts, graphics, collateral, press tours, press releases and equipment (86 annually). Reduced tradeshow expenses by 20% in the first year and continue to drive increase in leads year to year. \n• Vital member of acquisition integration teams to develop transition strategies pertaining to global tradeshows. \n• Strong management skills in cross-functional teams, global internal customers and external vendors, driving faster response rate, increasing efficiency and reducing overall MarCom expenses. Sr. Global MarCom Project Manager Coherent Inc April 2004  –  August 2012  (8 years 5 months) Santa Clara, CA Manage marketing and communications projects ranging from products, corporate, applications to service marketing. Effectively driving direct marketing, PR, product launches, advertising, web, tradeshows, articles, white papers, corporate messaging and sales collateral to increase lead generation, brand equity and sales revenue. \n \n• Creation of new web site (collaborative with MarCom team members), implemented in only 6 months, increased web traffic by 22% \n• Spearheaded annual report creation, driving cross functional teams (executives, legal, finance) to meet SEC filing timelines  \n• Creation of strong application focused direct marketing campaigns with segment marketing team, content development and direct marketing strategy resulted in response rates of over 30%. \n• Creation and execution of global trade show strategy which increased brand equity and sales opportunities \n• Manage and execute all global trade shows, including all show messaging, product layouts, graphics, collateral, press tours, press releases and equipment (86 annually). Reduced tradeshow expenses by 20% in the first year and continue to drive increase in leads year to year. \n• Vital member of acquisition integration teams to develop transition strategies pertaining to global tradeshows. \n• Strong management skills in cross-functional teams, global internal customers and external vendors, driving faster response rate, increasing efficiency and reducing overall MarCom expenses. Global Marketing Specialist Lambda Physik USA Inc January 2000  –  April 2004  (4 years 4 months) Ft. Lauderdale, FL Global Marketing Specialist Lambda Physik USA Inc January 2000  –  April 2004  (4 years 4 months) Ft. Lauderdale, FL Marketing Specialist Lambda Physik AG August 1998  –  January 2000  (1 year 6 months) Goettingen, Germany Marketing Specialist Lambda Physik AG August 1998  –  January 2000  (1 year 6 months) Goettingen, Germany Languages English Native or bilingual proficiency German Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency German Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency German Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Multi-lingual: English... Adobe Photoshop,... Proficient in Mac/PC... Hyper Text Mark Up... SEO in Google... Web Analytics - Adobe... CRM Salesforce.com Direct Marketing... Salesforce.com Web Analytics Dreamweaver Omniture Direct Marketing SEO Marketing Communications Advertising Lead Generation Brand Development Corporate Communications Product Launch Product Development Marketing Strategy Web Marketing Web Content Email Marketing Social Media Marketing Process Improvement Process Management Process Optimization Multimedia Marketing... Marketing... Program Management Cross-functional Team... Press Releases Marketing Trade Shows Public Relations CRM High Stakes Media... Competitive Analysis Management Marketing Management See 27+     See less Skills  Multi-lingual: English... Adobe Photoshop,... Proficient in Mac/PC... Hyper Text Mark Up... SEO in Google... Web Analytics - Adobe... CRM Salesforce.com Direct Marketing... Salesforce.com Web Analytics Dreamweaver Omniture Direct Marketing SEO Marketing Communications Advertising Lead Generation Brand Development Corporate Communications Product Launch Product Development Marketing Strategy Web Marketing Web Content Email Marketing Social Media Marketing Process Improvement Process Management Process Optimization Multimedia Marketing... Marketing... Program Management Cross-functional Team... Press Releases Marketing Trade Shows Public Relations CRM High Stakes Media... Competitive Analysis Management Marketing Management See 27+     See less Multi-lingual: English... Adobe Photoshop,... Proficient in Mac/PC... Hyper Text Mark Up... SEO in Google... Web Analytics - Adobe... CRM Salesforce.com Direct Marketing... Salesforce.com Web Analytics Dreamweaver Omniture Direct Marketing SEO Marketing Communications Advertising Lead Generation Brand Development Corporate Communications Product Launch Product Development Marketing Strategy Web Marketing Web Content Email Marketing Social Media Marketing Process Improvement Process Management Process Optimization Multimedia Marketing... Marketing... Program Management Cross-functional Team... Press Releases Marketing Trade Shows Public Relations CRM High Stakes Media... Competitive Analysis Management Marketing Management See 27+     See less Multi-lingual: English... Adobe Photoshop,... Proficient in Mac/PC... Hyper Text Mark Up... SEO in Google... Web Analytics - Adobe... CRM Salesforce.com Direct Marketing... Salesforce.com Web Analytics Dreamweaver Omniture Direct Marketing SEO Marketing Communications Advertising Lead Generation Brand Development Corporate Communications Product Launch Product Development Marketing Strategy Web Marketing Web Content Email Marketing Social Media Marketing Process Improvement Process Management Process Optimization Multimedia Marketing... Marketing... Program Management Cross-functional Team... Press Releases Marketing Trade Shows Public Relations CRM High Stakes Media... Competitive Analysis Management Marketing Management See 27+     See less Education BBS I BA,  Marketing 1998  – 2000 Felix-Klein-Gymnasium, Goettingen, Germany 1991  – 1998 BBS I BA,  Marketing 1998  – 2000 BBS I BA,  Marketing 1998  – 2000 BBS I BA,  Marketing 1998  – 2000 Felix-Klein-Gymnasium, Goettingen, Germany 1991  – 1998 Felix-Klein-Gymnasium, Goettingen, Germany 1991  – 1998 Felix-Klein-Gymnasium, Goettingen, Germany 1991  – 1998 ", "Summary Innovative marketing communications professional with 10+ years domestic/international experience in education, business, technology and retail products and services. Interests in sustainable innovations, development, and practices. Summary Innovative marketing communications professional with 10+ years domestic/international experience in education, business, technology and retail products and services. Interests in sustainable innovations, development, and practices. Innovative marketing communications professional with 10+ years domestic/international experience in education, business, technology and retail products and services. Interests in sustainable innovations, development, and practices. Innovative marketing communications professional with 10+ years domestic/international experience in education, business, technology and retail products and services. Interests in sustainable innovations, development, and practices. Experience Assistant Teacher/Librarian, (part-time) International School of Amsterdam (www.isa.nl) February 2012  –  November 2014  (2 years 10 months) Amstelveen, The Netherlands Monitored classroom and helped direct student learning. Digitally documented learning. \nPrepped games and activities throughout the day. Lunch/recess monitor duties, ensuring safe \noutdoor play. Assisted students checking books in/out in the school library, catalogued and covered books. Reclassified books into new sections both on and offline. Chose and read age appropriate and unit focused stories to lower school classrooms during their library time. Homemaker/Mother of 2 Home 2004  –  July 2011  (7 years) Taichung, Boston, Amsterdam As an expatriate in Taiwan in 2004, had a child, completed M.B.A and studied Mandarin. Transitioned to Boston in 2007, welcomed our second child during spring of 2008. Arrived to Amsterdam in June 2011, studied Dutch. Marketing Communications Manager Intel Corporation 2000  –  2004  (4 years) Hillsboro, OR Marketing Communications Manager, 2003-2004 \nCreated effective high profile campaigns and supporting collateral to educate and drive adoption of communications initiatives for two of the company’s strategic NPO initiatives (Intel Museum and Teach to the Future). \n• Resource for worldwide micro educational organizations. Ensured messaging and branding adherence.  \n• Developed a 5-year strategy for global exhibit outreach for the Intel Museum resulting in a significant budget increase.  \n• Co-developed an exhibit with a children’s museum in Costa Rica  \n• Supported sponsorship commitments to multiple exhibit destinations worldwide.  \n \nSenior Communications Specialist, 2000-2003 \nProduced communication plans and budgets for multiple product lines. Plans led to access to better, more focused information, resulting in increased product adoption. \n• Owned vendor relationships. Managed projects for on time delivery, successful return on investment (ROI), and budget tracking.  \n• Received division recognition awards for successfully driving a marketing program campaign and beneficial trade show presence. Producer/Associate Marketing Manager Embark Corp. 1999  –  2000  (1 year) San Francisco, California Designed site navigation and online branding for multiple new partner programs (online university entrance applications) and opened new markets (online standardized test preparation) for a start up application service provider (ASP) company. Communications/Promotions Specialist Mattel 1997  –  1999  (2 years) Fremont, CA • Launched and managed an online store that became a primary marketing tool for lead generation, conversion and cross-selling. \n• Designed and managed promotional strategy for 5 different brand lines.  \n• Drove adoption of an online marketing communication asset library for $2 Billion software division. Assistant Teacher/Librarian, (part-time) International School of Amsterdam (www.isa.nl) February 2012  –  November 2014  (2 years 10 months) Amstelveen, The Netherlands Monitored classroom and helped direct student learning. Digitally documented learning. \nPrepped games and activities throughout the day. Lunch/recess monitor duties, ensuring safe \noutdoor play. Assisted students checking books in/out in the school library, catalogued and covered books. Reclassified books into new sections both on and offline. Chose and read age appropriate and unit focused stories to lower school classrooms during their library time. Assistant Teacher/Librarian, (part-time) International School of Amsterdam (www.isa.nl) February 2012  –  November 2014  (2 years 10 months) Amstelveen, The Netherlands Monitored classroom and helped direct student learning. Digitally documented learning. \nPrepped games and activities throughout the day. Lunch/recess monitor duties, ensuring safe \noutdoor play. Assisted students checking books in/out in the school library, catalogued and covered books. Reclassified books into new sections both on and offline. Chose and read age appropriate and unit focused stories to lower school classrooms during their library time. Homemaker/Mother of 2 Home 2004  –  July 2011  (7 years) Taichung, Boston, Amsterdam As an expatriate in Taiwan in 2004, had a child, completed M.B.A and studied Mandarin. Transitioned to Boston in 2007, welcomed our second child during spring of 2008. Arrived to Amsterdam in June 2011, studied Dutch. Homemaker/Mother of 2 Home 2004  –  July 2011  (7 years) Taichung, Boston, Amsterdam As an expatriate in Taiwan in 2004, had a child, completed M.B.A and studied Mandarin. Transitioned to Boston in 2007, welcomed our second child during spring of 2008. Arrived to Amsterdam in June 2011, studied Dutch. Marketing Communications Manager Intel Corporation 2000  –  2004  (4 years) Hillsboro, OR Marketing Communications Manager, 2003-2004 \nCreated effective high profile campaigns and supporting collateral to educate and drive adoption of communications initiatives for two of the company’s strategic NPO initiatives (Intel Museum and Teach to the Future). \n• Resource for worldwide micro educational organizations. Ensured messaging and branding adherence.  \n• Developed a 5-year strategy for global exhibit outreach for the Intel Museum resulting in a significant budget increase.  \n• Co-developed an exhibit with a children’s museum in Costa Rica  \n• Supported sponsorship commitments to multiple exhibit destinations worldwide.  \n \nSenior Communications Specialist, 2000-2003 \nProduced communication plans and budgets for multiple product lines. Plans led to access to better, more focused information, resulting in increased product adoption. \n• Owned vendor relationships. Managed projects for on time delivery, successful return on investment (ROI), and budget tracking.  \n• Received division recognition awards for successfully driving a marketing program campaign and beneficial trade show presence. Marketing Communications Manager Intel Corporation 2000  –  2004  (4 years) Hillsboro, OR Marketing Communications Manager, 2003-2004 \nCreated effective high profile campaigns and supporting collateral to educate and drive adoption of communications initiatives for two of the company’s strategic NPO initiatives (Intel Museum and Teach to the Future). \n• Resource for worldwide micro educational organizations. Ensured messaging and branding adherence.  \n• Developed a 5-year strategy for global exhibit outreach for the Intel Museum resulting in a significant budget increase.  \n• Co-developed an exhibit with a children’s museum in Costa Rica  \n• Supported sponsorship commitments to multiple exhibit destinations worldwide.  \n \nSenior Communications Specialist, 2000-2003 \nProduced communication plans and budgets for multiple product lines. Plans led to access to better, more focused information, resulting in increased product adoption. \n• Owned vendor relationships. Managed projects for on time delivery, successful return on investment (ROI), and budget tracking.  \n• Received division recognition awards for successfully driving a marketing program campaign and beneficial trade show presence. Producer/Associate Marketing Manager Embark Corp. 1999  –  2000  (1 year) San Francisco, California Designed site navigation and online branding for multiple new partner programs (online university entrance applications) and opened new markets (online standardized test preparation) for a start up application service provider (ASP) company. Producer/Associate Marketing Manager Embark Corp. 1999  –  2000  (1 year) San Francisco, California Designed site navigation and online branding for multiple new partner programs (online university entrance applications) and opened new markets (online standardized test preparation) for a start up application service provider (ASP) company. Communications/Promotions Specialist Mattel 1997  –  1999  (2 years) Fremont, CA • Launched and managed an online store that became a primary marketing tool for lead generation, conversion and cross-selling. \n• Designed and managed promotional strategy for 5 different brand lines.  \n• Drove adoption of an online marketing communication asset library for $2 Billion software division. Communications/Promotions Specialist Mattel 1997  –  1999  (2 years) Fremont, CA • Launched and managed an online store that became a primary marketing tool for lead generation, conversion and cross-selling. \n• Designed and managed promotional strategy for 5 different brand lines.  \n• Drove adoption of an online marketing communication asset library for $2 Billion software division. Languages English Native or bilingual proficiency Hebrew Professional working proficiency Dutch Limited working proficiency French Limited working proficiency English Native or bilingual proficiency Hebrew Professional working proficiency Dutch Limited working proficiency French Limited working proficiency English Native or bilingual proficiency Hebrew Professional working proficiency Dutch Limited working proficiency French Limited working proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Limited working proficiency Skills Product Marketing Cross-functional Team... Program Management Communicaitons Highly resourceful Change Catalyst Sustainability Creativity Strategy Management Marketing Strategy Marketing Communications Skills  Product Marketing Cross-functional Team... Program Management Communicaitons Highly resourceful Change Catalyst Sustainability Creativity Strategy Management Marketing Strategy Marketing Communications Product Marketing Cross-functional Team... Program Management Communicaitons Highly resourceful Change Catalyst Sustainability Creativity Strategy Management Marketing Strategy Marketing Communications Product Marketing Cross-functional Team... Program Management Communicaitons Highly resourceful Change Catalyst Sustainability Creativity Strategy Management Marketing Strategy Marketing Communications Education Arizona State University, W. P. Carey School of Business MBA,  Business/Commerce , General 2002  – 2004 University of California, Berkeley Integrated Marketing and Communications Certificate 1998  – 1999 Queen's University Bachelor of Arts (BA),  Film Studies 1987  – 1990 Arizona State University, W. P. Carey School of Business MBA,  Business/Commerce , General 2002  – 2004 Arizona State University, W. P. Carey School of Business MBA,  Business/Commerce , General 2002  – 2004 Arizona State University, W. P. Carey School of Business MBA,  Business/Commerce , General 2002  – 2004 University of California, Berkeley Integrated Marketing and Communications Certificate 1998  – 1999 University of California, Berkeley Integrated Marketing and Communications Certificate 1998  – 1999 University of California, Berkeley Integrated Marketing and Communications Certificate 1998  – 1999 Queen's University Bachelor of Arts (BA),  Film Studies 1987  – 1990 Queen's University Bachelor of Arts (BA),  Film Studies 1987  – 1990 Queen's University Bachelor of Arts (BA),  Film Studies 1987  – 1990 ", "Summary •\tProven ability to write on deadline and juggle multiple articles and projects. \n \n•\tCalifornia Newspaper Publisher’s Association Award – 2004. \n \n•\tFast learner with high aptitude to quickly assimilate new information and topics. \n \n•\tDemonstrated ability to develop relationships with sources and co-workers. \n \n•\tKnowledgeable and enthusiastic about writing and delivering clean copy. \n \n•\tAbility to proactively handle and prioritize multiple tasks in a fast-paced environment. \n \n•\tAbility to quickly learn new procedures and processes. \n \n•\tStrong organizational and follow-through skills. \n \n•\tExcellent communication and interpersonal skills. \n \n•\tHigh level of ownership, accountability and initiative. \n \n•\tExtensive experience working for high tech firms. Summary •\tProven ability to write on deadline and juggle multiple articles and projects. \n \n•\tCalifornia Newspaper Publisher’s Association Award – 2004. \n \n•\tFast learner with high aptitude to quickly assimilate new information and topics. \n \n•\tDemonstrated ability to develop relationships with sources and co-workers. \n \n•\tKnowledgeable and enthusiastic about writing and delivering clean copy. \n \n•\tAbility to proactively handle and prioritize multiple tasks in a fast-paced environment. \n \n•\tAbility to quickly learn new procedures and processes. \n \n•\tStrong organizational and follow-through skills. \n \n•\tExcellent communication and interpersonal skills. \n \n•\tHigh level of ownership, accountability and initiative. \n \n•\tExtensive experience working for high tech firms. •\tProven ability to write on deadline and juggle multiple articles and projects. \n \n•\tCalifornia Newspaper Publisher’s Association Award – 2004. \n \n•\tFast learner with high aptitude to quickly assimilate new information and topics. \n \n•\tDemonstrated ability to develop relationships with sources and co-workers. \n \n•\tKnowledgeable and enthusiastic about writing and delivering clean copy. \n \n•\tAbility to proactively handle and prioritize multiple tasks in a fast-paced environment. \n \n•\tAbility to quickly learn new procedures and processes. \n \n•\tStrong organizational and follow-through skills. \n \n•\tExcellent communication and interpersonal skills. \n \n•\tHigh level of ownership, accountability and initiative. \n \n•\tExtensive experience working for high tech firms. •\tProven ability to write on deadline and juggle multiple articles and projects. \n \n•\tCalifornia Newspaper Publisher’s Association Award – 2004. \n \n•\tFast learner with high aptitude to quickly assimilate new information and topics. \n \n•\tDemonstrated ability to develop relationships with sources and co-workers. \n \n•\tKnowledgeable and enthusiastic about writing and delivering clean copy. \n \n•\tAbility to proactively handle and prioritize multiple tasks in a fast-paced environment. \n \n•\tAbility to quickly learn new procedures and processes. \n \n•\tStrong organizational and follow-through skills. \n \n•\tExcellent communication and interpersonal skills. \n \n•\tHigh level of ownership, accountability and initiative. \n \n•\tExtensive experience working for high tech firms. Skills Brand Development Online Advertising Strategy Copywriting Business Development Entrepreneurship Skills  Brand Development Online Advertising Strategy Copywriting Business Development Entrepreneurship Brand Development Online Advertising Strategy Copywriting Business Development Entrepreneurship Brand Development Online Advertising Strategy Copywriting Business Development Entrepreneurship Education Stanford University Greek and Roman Classics, US Civil Rights Movement 2010  – 2010 Research and writing at the Martin Luther King, Jr. Education & Research Institute. \nStanford Continuing Studies, Greek and Roman literature The University of Texas at Austin B.S.,  Radio-TV-Film Stanford University Greek and Roman Classics, US Civil Rights Movement 2010  – 2010 Research and writing at the Martin Luther King, Jr. Education & Research Institute. \nStanford Continuing Studies, Greek and Roman literature Stanford University Greek and Roman Classics, US Civil Rights Movement 2010  – 2010 Research and writing at the Martin Luther King, Jr. Education & Research Institute. \nStanford Continuing Studies, Greek and Roman literature Stanford University Greek and Roman Classics, US Civil Rights Movement 2010  – 2010 Research and writing at the Martin Luther King, Jr. Education & Research Institute. \nStanford Continuing Studies, Greek and Roman literature The University of Texas at Austin B.S.,  Radio-TV-Film The University of Texas at Austin B.S.,  Radio-TV-Film The University of Texas at Austin B.S.,  Radio-TV-Film Honors & Awards ", "Summary I’m a versatile marketing communications and public relations manager with over 15 years of experience in high-tech industry.  \n \nI’ve led on many major communications projects in my career—press conferences, website redesign and localization, product launches, tradeshows and events, promotional video productions, marketing collateral creation, webinars and seminars, community building, etc. As a result, I have a unique strength to transform stakeholder’s insight into an integrated communications plan, and to manage various communications programs efficiently. \n \nI’m truly passionate about my work, and love collaborating with the corporate and department leaders who understand the business objectives. Together we strategically position the company and products that differentiate the unique value proposition from the competitors. \n \nSpecialties:  \nCorporate communications \nMarketing communications \nPublic relations / Analyst relations \nGo-to-market strategy \nDigital marketing \nContent Marketing  \nSales enablement tools \nWorldwide product launches \nEvent management \nCreative design \nLead generation \nMarketing automation \nInternational branding \nChannel and partner marketing \nSocial media \nSEO & SEM Summary I’m a versatile marketing communications and public relations manager with over 15 years of experience in high-tech industry.  \n \nI’ve led on many major communications projects in my career—press conferences, website redesign and localization, product launches, tradeshows and events, promotional video productions, marketing collateral creation, webinars and seminars, community building, etc. As a result, I have a unique strength to transform stakeholder’s insight into an integrated communications plan, and to manage various communications programs efficiently. \n \nI’m truly passionate about my work, and love collaborating with the corporate and department leaders who understand the business objectives. Together we strategically position the company and products that differentiate the unique value proposition from the competitors. \n \nSpecialties:  \nCorporate communications \nMarketing communications \nPublic relations / Analyst relations \nGo-to-market strategy \nDigital marketing \nContent Marketing  \nSales enablement tools \nWorldwide product launches \nEvent management \nCreative design \nLead generation \nMarketing automation \nInternational branding \nChannel and partner marketing \nSocial media \nSEO & SEM I’m a versatile marketing communications and public relations manager with over 15 years of experience in high-tech industry.  \n \nI’ve led on many major communications projects in my career—press conferences, website redesign and localization, product launches, tradeshows and events, promotional video productions, marketing collateral creation, webinars and seminars, community building, etc. As a result, I have a unique strength to transform stakeholder’s insight into an integrated communications plan, and to manage various communications programs efficiently. \n \nI’m truly passionate about my work, and love collaborating with the corporate and department leaders who understand the business objectives. Together we strategically position the company and products that differentiate the unique value proposition from the competitors. \n \nSpecialties:  \nCorporate communications \nMarketing communications \nPublic relations / Analyst relations \nGo-to-market strategy \nDigital marketing \nContent Marketing  \nSales enablement tools \nWorldwide product launches \nEvent management \nCreative design \nLead generation \nMarketing automation \nInternational branding \nChannel and partner marketing \nSocial media \nSEO & SEM I’m a versatile marketing communications and public relations manager with over 15 years of experience in high-tech industry.  \n \nI’ve led on many major communications projects in my career—press conferences, website redesign and localization, product launches, tradeshows and events, promotional video productions, marketing collateral creation, webinars and seminars, community building, etc. As a result, I have a unique strength to transform stakeholder’s insight into an integrated communications plan, and to manage various communications programs efficiently. \n \nI’m truly passionate about my work, and love collaborating with the corporate and department leaders who understand the business objectives. Together we strategically position the company and products that differentiate the unique value proposition from the competitors. \n \nSpecialties:  \nCorporate communications \nMarketing communications \nPublic relations / Analyst relations \nGo-to-market strategy \nDigital marketing \nContent Marketing  \nSales enablement tools \nWorldwide product launches \nEvent management \nCreative design \nLead generation \nMarketing automation \nInternational branding \nChannel and partner marketing \nSocial media \nSEO & SEM Experience ICF Marketing Communications Manager Intel Corporation August 2015  – Present (1 month) Santa Clara Sr. Manager of Communications, Americas Infineon Technologies North America Corp. October 2013  –  May 2015  (1 year 8 months) San Francisco Bay Area Head of Communications, Americas \nDefined and implemented communications strategy for automotive, chip card and security, industrial power control, and power management and multi-market divisions. Analyzed, prepared and executed a regional integrated marketing communications, media relations and channel marketing plan. \n \n• Increased efficiencies and effectiveness of communication plans by clearly communicating objectives, expectations, deadlines, roles and responsibilities to all team members and project stakeholders; kept all relevant parties informed of progress, challenges and opportunities. \n \n• Elevated satisfaction of internal stakeholders by implementing effective and thorough project management and by delivering programs within budget and on schedule.. \n \n• Reduced outsourced costs 50%, improved processes, and enhanced department capabilities by analyzing cost / benefit and prioritizing projects.  \n \n• Increased company’s coverage and reputation significantly among business, trade, industry and technology publications by developing and pitching compelling thought leadership stories. \n \n• Enhanced marketing and sales team’s ability to introduce products more effectively by translating division’s product positioning plan into promotional materials. \n \n• Directly supervised 20+ regional events, including major industry tradeshows, customer events, and channel co-op events with flawless execution.  \n \n• Effectively reached and delivered relevant messages to target audience by aligning promotion content based on semiconductor buyer's journey and product life cycle.  Manager, Marcom and PR - APAC TriQuint Semiconductor, Inc. (Now Qorvo, Inc.) May 2008  –  October 2013  (5 years 6 months) Hillsboro, OR Overhauled brand strategy for TriQuint’s mobile devices and network business units in APAC. Maximized effectiveness of APAC communications programs. Managed overseas tradeshows and events within budget and on schedule. \n \n• Created and implemented strategic, innovative communications programs and campaigns across APAC, which: \no\tRaised company's brand awareness among China’s target audience from 8% to over 85% \no\tIncreased traffic on company's Chinese website an average of 35% each quarter \no\tGrew company-sponsored RF engineer community in China to over 30k members in 3 years \no\tImproved RF community website traffic in China by 172% unique visits in 1 year \no\tEstablished RF community as a go-to resource for all things RF  \n \n• Tripled media coverage each year by building close rapport with APAC media and employing tailored PR plans. \n \n• Increased channel sales revenue and engaged effectively with channel partners by introducing channel partners co-marketing initiatives in Asia market. \n \n• Achieved 5-fold increase in followers through integrated China social media strategy. \n \n• Generated brand recognition from PR effort by receiving 9 industry awards in the categories of best product, FAE support and best semiconductor company. \n \n• Increased brand awareness in APAC region by leading internal team and directing external resources during grand opening ceremony and press event of international headquarters in Singapore. Marcom and PR Manager WJ Communications, Inc. (Acquired by TriQuint Semiconductor, Inc.) November 2006  –  May 2008  (1 year 7 months) San Jose, CA Directed marketing communications and development of marketing materials. Managed brand positioning across all communications channels. Evaluated, executed and tracked lead generation campaigns, primarily through online marketing including pay-per-click (PPC) campaigns, banner ads, e-newsletters and subscriptions. Represented company in key external public events such as overseas product launches and public relations activities.  \n \n• Achieved 50%+ increase in website traffic in 1st month of launch update through redesign of company’s website user interface for ease of use in English, Chinese, and Korean languages. \n \n• Reached page 1 in Google search rankings and increased organic search traffic through search engine optimization (SEO) and by improving website content during redesign. \n \n• Achieved company’s RFID product revenue goal early through design and launch of online store. \n Marketing Communications Promise Technology, Inc January 2006  –  November 2006  (11 months) Milpitas, CA Marketing Genesys Logic, Inc December 2003  –  December 2005  (2 years 1 month) San Jose, CA Market Research Acute Communications January 2000  –  May 2001  (1 year 5 months) San Jose, CA ICF Marketing Communications Manager Intel Corporation August 2015  – Present (1 month) Santa Clara ICF Marketing Communications Manager Intel Corporation August 2015  – Present (1 month) Santa Clara Sr. Manager of Communications, Americas Infineon Technologies North America Corp. October 2013  –  May 2015  (1 year 8 months) San Francisco Bay Area Head of Communications, Americas \nDefined and implemented communications strategy for automotive, chip card and security, industrial power control, and power management and multi-market divisions. Analyzed, prepared and executed a regional integrated marketing communications, media relations and channel marketing plan. \n \n• Increased efficiencies and effectiveness of communication plans by clearly communicating objectives, expectations, deadlines, roles and responsibilities to all team members and project stakeholders; kept all relevant parties informed of progress, challenges and opportunities. \n \n• Elevated satisfaction of internal stakeholders by implementing effective and thorough project management and by delivering programs within budget and on schedule.. \n \n• Reduced outsourced costs 50%, improved processes, and enhanced department capabilities by analyzing cost / benefit and prioritizing projects.  \n \n• Increased company’s coverage and reputation significantly among business, trade, industry and technology publications by developing and pitching compelling thought leadership stories. \n \n• Enhanced marketing and sales team’s ability to introduce products more effectively by translating division’s product positioning plan into promotional materials. \n \n• Directly supervised 20+ regional events, including major industry tradeshows, customer events, and channel co-op events with flawless execution.  \n \n• Effectively reached and delivered relevant messages to target audience by aligning promotion content based on semiconductor buyer's journey and product life cycle.  Sr. Manager of Communications, Americas Infineon Technologies North America Corp. October 2013  –  May 2015  (1 year 8 months) San Francisco Bay Area Head of Communications, Americas \nDefined and implemented communications strategy for automotive, chip card and security, industrial power control, and power management and multi-market divisions. Analyzed, prepared and executed a regional integrated marketing communications, media relations and channel marketing plan. \n \n• Increased efficiencies and effectiveness of communication plans by clearly communicating objectives, expectations, deadlines, roles and responsibilities to all team members and project stakeholders; kept all relevant parties informed of progress, challenges and opportunities. \n \n• Elevated satisfaction of internal stakeholders by implementing effective and thorough project management and by delivering programs within budget and on schedule.. \n \n• Reduced outsourced costs 50%, improved processes, and enhanced department capabilities by analyzing cost / benefit and prioritizing projects.  \n \n• Increased company’s coverage and reputation significantly among business, trade, industry and technology publications by developing and pitching compelling thought leadership stories. \n \n• Enhanced marketing and sales team’s ability to introduce products more effectively by translating division’s product positioning plan into promotional materials. \n \n• Directly supervised 20+ regional events, including major industry tradeshows, customer events, and channel co-op events with flawless execution.  \n \n• Effectively reached and delivered relevant messages to target audience by aligning promotion content based on semiconductor buyer's journey and product life cycle.  Manager, Marcom and PR - APAC TriQuint Semiconductor, Inc. (Now Qorvo, Inc.) May 2008  –  October 2013  (5 years 6 months) Hillsboro, OR Overhauled brand strategy for TriQuint’s mobile devices and network business units in APAC. Maximized effectiveness of APAC communications programs. Managed overseas tradeshows and events within budget and on schedule. \n \n• Created and implemented strategic, innovative communications programs and campaigns across APAC, which: \no\tRaised company's brand awareness among China’s target audience from 8% to over 85% \no\tIncreased traffic on company's Chinese website an average of 35% each quarter \no\tGrew company-sponsored RF engineer community in China to over 30k members in 3 years \no\tImproved RF community website traffic in China by 172% unique visits in 1 year \no\tEstablished RF community as a go-to resource for all things RF  \n \n• Tripled media coverage each year by building close rapport with APAC media and employing tailored PR plans. \n \n• Increased channel sales revenue and engaged effectively with channel partners by introducing channel partners co-marketing initiatives in Asia market. \n \n• Achieved 5-fold increase in followers through integrated China social media strategy. \n \n• Generated brand recognition from PR effort by receiving 9 industry awards in the categories of best product, FAE support and best semiconductor company. \n \n• Increased brand awareness in APAC region by leading internal team and directing external resources during grand opening ceremony and press event of international headquarters in Singapore. Manager, Marcom and PR - APAC TriQuint Semiconductor, Inc. (Now Qorvo, Inc.) May 2008  –  October 2013  (5 years 6 months) Hillsboro, OR Overhauled brand strategy for TriQuint’s mobile devices and network business units in APAC. Maximized effectiveness of APAC communications programs. Managed overseas tradeshows and events within budget and on schedule. \n \n• Created and implemented strategic, innovative communications programs and campaigns across APAC, which: \no\tRaised company's brand awareness among China’s target audience from 8% to over 85% \no\tIncreased traffic on company's Chinese website an average of 35% each quarter \no\tGrew company-sponsored RF engineer community in China to over 30k members in 3 years \no\tImproved RF community website traffic in China by 172% unique visits in 1 year \no\tEstablished RF community as a go-to resource for all things RF  \n \n• Tripled media coverage each year by building close rapport with APAC media and employing tailored PR plans. \n \n• Increased channel sales revenue and engaged effectively with channel partners by introducing channel partners co-marketing initiatives in Asia market. \n \n• Achieved 5-fold increase in followers through integrated China social media strategy. \n \n• Generated brand recognition from PR effort by receiving 9 industry awards in the categories of best product, FAE support and best semiconductor company. \n \n• Increased brand awareness in APAC region by leading internal team and directing external resources during grand opening ceremony and press event of international headquarters in Singapore. Marcom and PR Manager WJ Communications, Inc. (Acquired by TriQuint Semiconductor, Inc.) November 2006  –  May 2008  (1 year 7 months) San Jose, CA Directed marketing communications and development of marketing materials. Managed brand positioning across all communications channels. Evaluated, executed and tracked lead generation campaigns, primarily through online marketing including pay-per-click (PPC) campaigns, banner ads, e-newsletters and subscriptions. Represented company in key external public events such as overseas product launches and public relations activities.  \n \n• Achieved 50%+ increase in website traffic in 1st month of launch update through redesign of company’s website user interface for ease of use in English, Chinese, and Korean languages. \n \n• Reached page 1 in Google search rankings and increased organic search traffic through search engine optimization (SEO) and by improving website content during redesign. \n \n• Achieved company’s RFID product revenue goal early through design and launch of online store. \n Marcom and PR Manager WJ Communications, Inc. (Acquired by TriQuint Semiconductor, Inc.) November 2006  –  May 2008  (1 year 7 months) San Jose, CA Directed marketing communications and development of marketing materials. Managed brand positioning across all communications channels. Evaluated, executed and tracked lead generation campaigns, primarily through online marketing including pay-per-click (PPC) campaigns, banner ads, e-newsletters and subscriptions. Represented company in key external public events such as overseas product launches and public relations activities.  \n \n• Achieved 50%+ increase in website traffic in 1st month of launch update through redesign of company’s website user interface for ease of use in English, Chinese, and Korean languages. \n \n• Reached page 1 in Google search rankings and increased organic search traffic through search engine optimization (SEO) and by improving website content during redesign. \n \n• Achieved company’s RFID product revenue goal early through design and launch of online store. \n Marketing Communications Promise Technology, Inc January 2006  –  November 2006  (11 months) Milpitas, CA Marketing Communications Promise Technology, Inc January 2006  –  November 2006  (11 months) Milpitas, CA Marketing Genesys Logic, Inc December 2003  –  December 2005  (2 years 1 month) San Jose, CA Marketing Genesys Logic, Inc December 2003  –  December 2005  (2 years 1 month) San Jose, CA Market Research Acute Communications January 2000  –  May 2001  (1 year 5 months) San Jose, CA Market Research Acute Communications January 2000  –  May 2001  (1 year 5 months) San Jose, CA Languages Mandarin Native or bilingual proficiency Mandarin Native or bilingual proficiency Mandarin Native or bilingual proficiency Native or bilingual proficiency Skills Corporate Communications Marketing Communications Marketing Strategy Public Relations Media Relations Brand Awareness Social Media Marketing Advertising Online Marketing Web Analytics Web 2.0 Website Localization Graphic Design Visual Communication Sales Tools Development Lead Generation Channel Marketing Adobe Creative Suite International Project... International Marketing Trade Show Management Multilingual Online Advertising Trade Shows Product Marketing Affiliate Marketing Multi-channel Marketing Product Management Product Launch Event Management Marketing Product Development Salesforce.com Management Market Research Website Development Web Design Project Management Competitive Analysis Strategic Partnerships Leadership SEM SEO Google Analytics B2B Marketing Brand Development Cross-functional Team... Semiconductors Email Marketing Digital Marketing See 35+     See less Skills  Corporate Communications Marketing Communications Marketing Strategy Public Relations Media Relations Brand Awareness Social Media Marketing Advertising Online Marketing Web Analytics Web 2.0 Website Localization Graphic Design Visual Communication Sales Tools Development Lead Generation Channel Marketing Adobe Creative Suite International Project... International Marketing Trade Show Management Multilingual Online Advertising Trade Shows Product Marketing Affiliate Marketing Multi-channel Marketing Product Management Product Launch Event Management Marketing Product Development Salesforce.com Management Market Research Website Development Web Design Project Management Competitive Analysis Strategic Partnerships Leadership SEM SEO Google Analytics B2B Marketing Brand Development Cross-functional Team... Semiconductors Email Marketing Digital Marketing See 35+     See less Corporate Communications Marketing Communications Marketing Strategy Public Relations Media Relations Brand Awareness Social Media Marketing Advertising Online Marketing Web Analytics Web 2.0 Website Localization Graphic Design Visual Communication Sales Tools Development Lead Generation Channel Marketing Adobe Creative Suite International Project... International Marketing Trade Show Management Multilingual Online Advertising Trade Shows Product Marketing Affiliate Marketing Multi-channel Marketing Product Management Product Launch Event Management Marketing Product Development Salesforce.com Management Market Research Website Development Web Design Project Management Competitive Analysis Strategic Partnerships Leadership SEM SEO Google Analytics B2B Marketing Brand Development Cross-functional Team... Semiconductors Email Marketing Digital Marketing See 35+     See less Corporate Communications Marketing Communications Marketing Strategy Public Relations Media Relations Brand Awareness Social Media Marketing Advertising Online Marketing Web Analytics Web 2.0 Website Localization Graphic Design Visual Communication Sales Tools Development Lead Generation Channel Marketing Adobe Creative Suite International Project... International Marketing Trade Show Management Multilingual Online Advertising Trade Shows Product Marketing Affiliate Marketing Multi-channel Marketing Product Management Product Launch Event Management Marketing Product Development Salesforce.com Management Market Research Website Development Web Design Project Management Competitive Analysis Strategic Partnerships Leadership SEM SEO Google Analytics B2B Marketing Brand Development Cross-functional Team... Semiconductors Email Marketing Digital Marketing See 35+     See less Education San Francisco State University Master,  Business Administration 1997  – 2000 National Taiwan University BA,  Foreign Languages and Literature San Francisco State University Master,  Business Administration 1997  – 2000 San Francisco State University Master,  Business Administration 1997  – 2000 San Francisco State University Master,  Business Administration 1997  – 2000 National Taiwan University BA,  Foreign Languages and Literature National Taiwan University BA,  Foreign Languages and Literature National Taiwan University BA,  Foreign Languages and Literature Honors & Awards ", "Skills Cross-functional Team... Semiconductors Program Management Product Marketing Intel Semiconductor Industry Product Management Project Management Go-to-market Strategy Strategic Planning Strategic Partnerships Software Project... Process Improvement Start-ups Skills  Cross-functional Team... Semiconductors Program Management Product Marketing Intel Semiconductor Industry Product Management Project Management Go-to-market Strategy Strategic Planning Strategic Partnerships Software Project... Process Improvement Start-ups Cross-functional Team... Semiconductors Program Management Product Marketing Intel Semiconductor Industry Product Management Project Management Go-to-market Strategy Strategic Planning Strategic Partnerships Software Project... Process Improvement Start-ups Cross-functional Team... Semiconductors Program Management Product Marketing Intel Semiconductor Industry Product Management Project Management Go-to-market Strategy Strategic Planning Strategic Partnerships Software Project... Process Improvement Start-ups ", "Experience Marketing Manager Care Innovations, an Intel GE joint venture January 2011  –  September 2012  (1 year 9 months) Roseville, CA •\tDeveloped and managed the integrated brand awareness and marketing strategy including campaign concept, positioning and focus group testing. Drove the program through all channels including electronic and print advertising, customer-facing website, lead generation programs, social media, SEM, emails, e-newsletters and tradeshows. Established goals, tracked performance and measured the success of the program.  \n•\tManaged multi-day, multi-location photo shoots to develop our product and usage model photo assets. \n•\tI managed Care Innovations’ relationships with our marketing agencies and design firms. \n•\tDeveloped the corporate brand style guide and collateral templates to assure that the Care Innovations brand was used consistently in all external marketing. Converted existing Intel and GE collateral to the CI look and feel. \n•\tResearched and established a collateral and tradeshow asset inventory and print-on-demand ordering system with external vendor for marketing and sales. Marketing Programs Manager Intel Corporation - Digital Health Group December 2005  –  December 2010  (5 years 1 month) Folsom, CA •\tSuccessfully launched the Intel® Reader into the marketplace and created an integrated marketing campaign program with changing deadlines and budget constraints without sacrificing quality and/or results.  \n•\tReceived the 2009 Intel Achievement Award--Intel’s highest honor for outstanding accomplishments--for this product introduction. \n•\tDeveloped the strategic messaging platform for the group as well for the Intel Reader product. Applied the messaging across all communications channels ensuring consistent and accurate communication to all audiences. \n•\tCreated the branding style guide to assure that the Intel Health brand was used consistently and in alignment with Intel’s master brand. \n•\tWorked with cross functional teams, geo teams and managed external agencies to develop and implement integrated product marketing strategies and programs targeted at business and consumers audiences. Interior Designer Western Contract 2003  –  2005  (2 years) Sacramento, CA •\tUsed my strategic and project management skills as well as my space planning, interior design and creative abilities to deliver excellent customer service to my clients.  \n•\tProvided marketing consulting and training for the management team.  \n•\tAchieved Sales Person of the Month in my fourth month of employment. Marketing Manager Intel Corporation - Corporate Sale & Marketing Group November 2001  –  February 2003  (1 year 4 months) Folsom, CA •\tDeveloped and implemented integrated marketing strategies, demand creation and promotion programs for the Mobile Processor Group targeted to the consumer and business audiences.  \n•\tDeveloped the messaging for the Intel Centrino® product launch, and helped to ensure that the launch was carried out consistently in all channels, worldwide.  \n•\tCreated campaign strategies and worked with a cross-functional team of product marketing, corporate research, brand management, marketing communications, public relations, internet marketing, and advertising as our Geos to ensure that their launch plans lined up with and supported the corporate strategy. Sr. Marketing Communications Manager Intel Corporation - Corporate Sales & Marketing Group August 2000  –  November 2001  (1 year 4 months) Sacramento, CA •\tManaged the planning, implementation and delivery of marketing communications programs for the Optical Products Group.  \n•\tSupported product launches, developed and implemented print and online advertising campaigns, tradeshows, created product websites and print collateral. \n•\tWorked closely with the product line to ensure that product positioning and messages were delivered consistently. Sr. Marketing Communications Manager Intel Corporation - Information Technology February 1998  –  August 2000  (2 years 7 months) Folsom, CA •\tManaged a staff of communications mangers and specialists that supported more than 40 product managers in Information Technology. \n•\tWorked with the product line managers and the General Manager to set strategic direction, position the products and establish the optimum product mix. \n•\tHelped to ensure that the deployment of IT’s products and services resulted in a positive customer experience by bringing Training, Customer Support, and Marketing together to ensure that all customer-facing organizations were in synch. Marketing Communications Manager Intel Corporation - Corporate Sales & Marketing Group May 1994  –  February 1998  (3 years 10 months) Folsom, CA •\tDeveloped strategic plans and budgets for fully integrated, worldwide communications programs in support of Memory Components Division business goals. \n•\tWorked with product marketing engineers to clearly position the product lines and effectively communicate key messages to the target audiences. \n•\tManaged the execution of programs through advertising, online programs, direct marketing, sales promotions, market research, tradeshows and a speakership program. Marketing Manager Care Innovations, an Intel GE joint venture January 2011  –  September 2012  (1 year 9 months) Roseville, CA •\tDeveloped and managed the integrated brand awareness and marketing strategy including campaign concept, positioning and focus group testing. Drove the program through all channels including electronic and print advertising, customer-facing website, lead generation programs, social media, SEM, emails, e-newsletters and tradeshows. Established goals, tracked performance and measured the success of the program.  \n•\tManaged multi-day, multi-location photo shoots to develop our product and usage model photo assets. \n•\tI managed Care Innovations’ relationships with our marketing agencies and design firms. \n•\tDeveloped the corporate brand style guide and collateral templates to assure that the Care Innovations brand was used consistently in all external marketing. Converted existing Intel and GE collateral to the CI look and feel. \n•\tResearched and established a collateral and tradeshow asset inventory and print-on-demand ordering system with external vendor for marketing and sales. Marketing Manager Care Innovations, an Intel GE joint venture January 2011  –  September 2012  (1 year 9 months) Roseville, CA •\tDeveloped and managed the integrated brand awareness and marketing strategy including campaign concept, positioning and focus group testing. Drove the program through all channels including electronic and print advertising, customer-facing website, lead generation programs, social media, SEM, emails, e-newsletters and tradeshows. Established goals, tracked performance and measured the success of the program.  \n•\tManaged multi-day, multi-location photo shoots to develop our product and usage model photo assets. \n•\tI managed Care Innovations’ relationships with our marketing agencies and design firms. \n•\tDeveloped the corporate brand style guide and collateral templates to assure that the Care Innovations brand was used consistently in all external marketing. Converted existing Intel and GE collateral to the CI look and feel. \n•\tResearched and established a collateral and tradeshow asset inventory and print-on-demand ordering system with external vendor for marketing and sales. Marketing Programs Manager Intel Corporation - Digital Health Group December 2005  –  December 2010  (5 years 1 month) Folsom, CA •\tSuccessfully launched the Intel® Reader into the marketplace and created an integrated marketing campaign program with changing deadlines and budget constraints without sacrificing quality and/or results.  \n•\tReceived the 2009 Intel Achievement Award--Intel’s highest honor for outstanding accomplishments--for this product introduction. \n•\tDeveloped the strategic messaging platform for the group as well for the Intel Reader product. Applied the messaging across all communications channels ensuring consistent and accurate communication to all audiences. \n•\tCreated the branding style guide to assure that the Intel Health brand was used consistently and in alignment with Intel’s master brand. \n•\tWorked with cross functional teams, geo teams and managed external agencies to develop and implement integrated product marketing strategies and programs targeted at business and consumers audiences. Marketing Programs Manager Intel Corporation - Digital Health Group December 2005  –  December 2010  (5 years 1 month) Folsom, CA •\tSuccessfully launched the Intel® Reader into the marketplace and created an integrated marketing campaign program with changing deadlines and budget constraints without sacrificing quality and/or results.  \n•\tReceived the 2009 Intel Achievement Award--Intel’s highest honor for outstanding accomplishments--for this product introduction. \n•\tDeveloped the strategic messaging platform for the group as well for the Intel Reader product. Applied the messaging across all communications channels ensuring consistent and accurate communication to all audiences. \n•\tCreated the branding style guide to assure that the Intel Health brand was used consistently and in alignment with Intel’s master brand. \n•\tWorked with cross functional teams, geo teams and managed external agencies to develop and implement integrated product marketing strategies and programs targeted at business and consumers audiences. Interior Designer Western Contract 2003  –  2005  (2 years) Sacramento, CA •\tUsed my strategic and project management skills as well as my space planning, interior design and creative abilities to deliver excellent customer service to my clients.  \n•\tProvided marketing consulting and training for the management team.  \n•\tAchieved Sales Person of the Month in my fourth month of employment. Interior Designer Western Contract 2003  –  2005  (2 years) Sacramento, CA •\tUsed my strategic and project management skills as well as my space planning, interior design and creative abilities to deliver excellent customer service to my clients.  \n•\tProvided marketing consulting and training for the management team.  \n•\tAchieved Sales Person of the Month in my fourth month of employment. Marketing Manager Intel Corporation - Corporate Sale & Marketing Group November 2001  –  February 2003  (1 year 4 months) Folsom, CA •\tDeveloped and implemented integrated marketing strategies, demand creation and promotion programs for the Mobile Processor Group targeted to the consumer and business audiences.  \n•\tDeveloped the messaging for the Intel Centrino® product launch, and helped to ensure that the launch was carried out consistently in all channels, worldwide.  \n•\tCreated campaign strategies and worked with a cross-functional team of product marketing, corporate research, brand management, marketing communications, public relations, internet marketing, and advertising as our Geos to ensure that their launch plans lined up with and supported the corporate strategy. Marketing Manager Intel Corporation - Corporate Sale & Marketing Group November 2001  –  February 2003  (1 year 4 months) Folsom, CA •\tDeveloped and implemented integrated marketing strategies, demand creation and promotion programs for the Mobile Processor Group targeted to the consumer and business audiences.  \n•\tDeveloped the messaging for the Intel Centrino® product launch, and helped to ensure that the launch was carried out consistently in all channels, worldwide.  \n•\tCreated campaign strategies and worked with a cross-functional team of product marketing, corporate research, brand management, marketing communications, public relations, internet marketing, and advertising as our Geos to ensure that their launch plans lined up with and supported the corporate strategy. Sr. Marketing Communications Manager Intel Corporation - Corporate Sales & Marketing Group August 2000  –  November 2001  (1 year 4 months) Sacramento, CA •\tManaged the planning, implementation and delivery of marketing communications programs for the Optical Products Group.  \n•\tSupported product launches, developed and implemented print and online advertising campaigns, tradeshows, created product websites and print collateral. \n•\tWorked closely with the product line to ensure that product positioning and messages were delivered consistently. Sr. Marketing Communications Manager Intel Corporation - Corporate Sales & Marketing Group August 2000  –  November 2001  (1 year 4 months) Sacramento, CA •\tManaged the planning, implementation and delivery of marketing communications programs for the Optical Products Group.  \n•\tSupported product launches, developed and implemented print and online advertising campaigns, tradeshows, created product websites and print collateral. \n•\tWorked closely with the product line to ensure that product positioning and messages were delivered consistently. Sr. Marketing Communications Manager Intel Corporation - Information Technology February 1998  –  August 2000  (2 years 7 months) Folsom, CA •\tManaged a staff of communications mangers and specialists that supported more than 40 product managers in Information Technology. \n•\tWorked with the product line managers and the General Manager to set strategic direction, position the products and establish the optimum product mix. \n•\tHelped to ensure that the deployment of IT’s products and services resulted in a positive customer experience by bringing Training, Customer Support, and Marketing together to ensure that all customer-facing organizations were in synch. Sr. Marketing Communications Manager Intel Corporation - Information Technology February 1998  –  August 2000  (2 years 7 months) Folsom, CA •\tManaged a staff of communications mangers and specialists that supported more than 40 product managers in Information Technology. \n•\tWorked with the product line managers and the General Manager to set strategic direction, position the products and establish the optimum product mix. \n•\tHelped to ensure that the deployment of IT’s products and services resulted in a positive customer experience by bringing Training, Customer Support, and Marketing together to ensure that all customer-facing organizations were in synch. Marketing Communications Manager Intel Corporation - Corporate Sales & Marketing Group May 1994  –  February 1998  (3 years 10 months) Folsom, CA •\tDeveloped strategic plans and budgets for fully integrated, worldwide communications programs in support of Memory Components Division business goals. \n•\tWorked with product marketing engineers to clearly position the product lines and effectively communicate key messages to the target audiences. \n•\tManaged the execution of programs through advertising, online programs, direct marketing, sales promotions, market research, tradeshows and a speakership program. Marketing Communications Manager Intel Corporation - Corporate Sales & Marketing Group May 1994  –  February 1998  (3 years 10 months) Folsom, CA •\tDeveloped strategic plans and budgets for fully integrated, worldwide communications programs in support of Memory Components Division business goals. \n•\tWorked with product marketing engineers to clearly position the product lines and effectively communicate key messages to the target audiences. \n•\tManaged the execution of programs through advertising, online programs, direct marketing, sales promotions, market research, tradeshows and a speakership program. Skills Marketing Strategy Marketing Communications Marketing Strategic Planning Marketing Management Strategic Partnerships Go-to-market Strategy Account Management B2B Marketing Project Management Program Management Integrated Marketing Strategy Lead Generation Direct Marketing Skills  Marketing Strategy Marketing Communications Marketing Strategic Planning Marketing Management Strategic Partnerships Go-to-market Strategy Account Management B2B Marketing Project Management Program Management Integrated Marketing Strategy Lead Generation Direct Marketing Marketing Strategy Marketing Communications Marketing Strategic Planning Marketing Management Strategic Partnerships Go-to-market Strategy Account Management B2B Marketing Project Management Program Management Integrated Marketing Strategy Lead Generation Direct Marketing Marketing Strategy Marketing Communications Marketing Strategic Planning Marketing Management Strategic Partnerships Go-to-market Strategy Account Management B2B Marketing Project Management Program Management Integrated Marketing Strategy Lead Generation Direct Marketing Honors & Awards ", "Summary I have over 15 years of field, alliance and solutions marketing experience driving multi-million dollar revenue generating businesses in the enterprise datacenter segment. My strengths include identifying technology and go to market strategic partnerships with large and small OEMs, ISVs, IHVs and Cloud Service Providers. I maintain a solid reputation for achieving business results by collaborating with Engineering, Sales, Marketing and Operations to identify and implement solutions that drive end customer success and positive ROI for all parties involved. I am passionate about the enterprise datacenter including storage and networking segments and understand end user pain points and challenges. I speak conversational Spanish.\t \n \nEnterprise Datacenter: Storage – SAN – NAS – FLASH – Converged Systems – Networking – Big Data – Cloud– HPC – Miision Critical Computng- Semiconductors \nMarketing: Campaigns – Online and Print Media – GTM Strategy and Execution – Alliance and Solutions Marketing – Channel Marketing \nAlliances: HP, RedHat, VMWare, Cloudera, Cirba, Amdocs, Intel Security, OpenStack \nTools and Systems: Microsoft Excel – Powerpoint – Sharepoint – Word and CRM – Salesforce.com Summary I have over 15 years of field, alliance and solutions marketing experience driving multi-million dollar revenue generating businesses in the enterprise datacenter segment. My strengths include identifying technology and go to market strategic partnerships with large and small OEMs, ISVs, IHVs and Cloud Service Providers. I maintain a solid reputation for achieving business results by collaborating with Engineering, Sales, Marketing and Operations to identify and implement solutions that drive end customer success and positive ROI for all parties involved. I am passionate about the enterprise datacenter including storage and networking segments and understand end user pain points and challenges. I speak conversational Spanish.\t \n \nEnterprise Datacenter: Storage – SAN – NAS – FLASH – Converged Systems – Networking – Big Data – Cloud– HPC – Miision Critical Computng- Semiconductors \nMarketing: Campaigns – Online and Print Media – GTM Strategy and Execution – Alliance and Solutions Marketing – Channel Marketing \nAlliances: HP, RedHat, VMWare, Cloudera, Cirba, Amdocs, Intel Security, OpenStack \nTools and Systems: Microsoft Excel – Powerpoint – Sharepoint – Word and CRM – Salesforce.com I have over 15 years of field, alliance and solutions marketing experience driving multi-million dollar revenue generating businesses in the enterprise datacenter segment. My strengths include identifying technology and go to market strategic partnerships with large and small OEMs, ISVs, IHVs and Cloud Service Providers. I maintain a solid reputation for achieving business results by collaborating with Engineering, Sales, Marketing and Operations to identify and implement solutions that drive end customer success and positive ROI for all parties involved. I am passionate about the enterprise datacenter including storage and networking segments and understand end user pain points and challenges. I speak conversational Spanish.\t \n \nEnterprise Datacenter: Storage – SAN – NAS – FLASH – Converged Systems – Networking – Big Data – Cloud– HPC – Miision Critical Computng- Semiconductors \nMarketing: Campaigns – Online and Print Media – GTM Strategy and Execution – Alliance and Solutions Marketing – Channel Marketing \nAlliances: HP, RedHat, VMWare, Cloudera, Cirba, Amdocs, Intel Security, OpenStack \nTools and Systems: Microsoft Excel – Powerpoint – Sharepoint – Word and CRM – Salesforce.com I have over 15 years of field, alliance and solutions marketing experience driving multi-million dollar revenue generating businesses in the enterprise datacenter segment. My strengths include identifying technology and go to market strategic partnerships with large and small OEMs, ISVs, IHVs and Cloud Service Providers. I maintain a solid reputation for achieving business results by collaborating with Engineering, Sales, Marketing and Operations to identify and implement solutions that drive end customer success and positive ROI for all parties involved. I am passionate about the enterprise datacenter including storage and networking segments and understand end user pain points and challenges. I speak conversational Spanish.\t \n \nEnterprise Datacenter: Storage – SAN – NAS – FLASH – Converged Systems – Networking – Big Data – Cloud– HPC – Miision Critical Computng- Semiconductors \nMarketing: Campaigns – Online and Print Media – GTM Strategy and Execution – Alliance and Solutions Marketing – Channel Marketing \nAlliances: HP, RedHat, VMWare, Cloudera, Cirba, Amdocs, Intel Security, OpenStack \nTools and Systems: Microsoft Excel – Powerpoint – Sharepoint – Word and CRM – Salesforce.com Experience Director of Strategic Alliances Brocade May 2015  – Present (4 months) San Francisco Bay Area Responsible for go to market strategies with strategic partners for Brocade to drive growth in the company's IP networking and software products. The partnerships will be used to scale thought leadership and drive revenue as the networking industry undergoes a transformation to open, flexible and agile networking solutions that address the demands of today's data center and end customers. Senior Manager, Alliances, covering HP Account Intel Corporation June 2012  –  May 2015  (3 years) Santa Clara, CA Owned the relationship with HP's Storage, Converged Systems and Worldwide Initiatives teams. This involves setting long-term co-marketing and sales strategies with group vice presidents and working with individual contributors to execute the jointly agreed upon strategy. \n \nThe business units I collaborate with drive over $100M in revenue for Intel annually and I not only drive go to market, I also roll up my sleeves and actively collaborate with my customers and stakeholders, sometimes even authoring solution based content; brainstorming campaign elements; and training field and channel partners. I am passionate about datacenter and storage technology and am consistently building my technical acumen.  \n \nSemiconductors ▸ Storage & Memory ▸ Peripherals ▸ Hardware \nFlash Storage - Enterprise Storage - Server Virtualization - Desktop Virtualization - Data Protection - Backup & Disaster Recovery - HP- Citrix - Red Hat- VMWare - Oracle - Microsoft SQL Server - Exchange - Sharepoint - Linux - Big Data - Cloud - VDI - I/O - SAS - SSD - SATA - HDD Senior Enterprise Marketing Manager Intel Corporation January 2008  –  June 2012  (4 years 6 months) Santa Clara, CA In this role, I acted as a liaison between the Intel influence sales teams and the business unit and built my credibility as a trusted advisor to these stakeholders and their customers.  \n \nI managed our teams $4M annual budget and put processes in place so no money would be left unspent \n \nI prioritized and drove marketing programs that told the Intel and partner joint value proposition accross vertical and horizontal industries, thus giving me an amazing breadth of knowledge on what enterprise end customers desire in their datacenter. I shared this knowledge via respected industry content engines such as BrightTalk and through my personal blog. (http://www.brighttalk.com/channel/5365) and  \n \nSemiconductors ▸ Storage & Memory ▸ Peripherals ▸ Hardware ▸ Software \nAlliances: HP- Citrix - Red Hat- VMWare - Oracle - Microsoft - Cirba  \nSegments: Big Data - Cloud - VDI - Mission Critical Computing - HPC \nHealthcare- Amdocs- EPIC- McKesson- Cerner \nFinancial Services- Sungard - Thompson Reuters  \nAnalytics- SAS - SAP - International Institute of Analytics (IIA) \nManufacturing- Siemens PLM - Dassault- Autodesk Field Sales Engineer Intel Corporation 2007  –  2008  (1 year) •\tActively managed ~15 channel customer accounts influencing $25M in revenue over the year \no\tInfluenced several design wins and technology adoptions \no\tParticipated in joint sales calls with end customers \no\tTrained channel sales representatives on Intel roadmap and new product offerings  \no\tImplemented joint marketing programs such as Google Adwords and Intel® Inside Program Field Marketing and Communications Manager Intel Corporation January 2003  –  December 2006  (4 years) As a field marketing, launch and communcations manager, I honed many of the skills that have proved to be very useful in my future positions.  \n \nI sent regular communications to the OEM field team to keep them up to speed on all of Intel's product launches and the opportunities for their accounts to participate in launch activities. I also developed a process in which I gathered field team and business unit input to make a recommendation based on data to the corporate launch team on when Intel should announce a product.  \n \nI aslo completely revamped internal sales content tools and processes including reducing the number of content sites from 40+ to 2 and the number of push mechanisms to 1.  \n \nIn addtion to product launches, i worked with a core team to created demos, press release and speaking opportunities for fellow travelers in launches and events such as Xeon® and Core™ Launch as well as Siggraph; VMWorld; Oracle Open World; Gartner Data Center Group \n \nI helped build out Intel's \"Where to Buy\" website on Intel.com and PC.com \n \nSemiconductors  \nAlliances: Cisco - Dell- HP - IBM - Lenovo - Asus - Sony - Acer - Penguin - Supermicro Senior Business Planner, Technology and Manufacturing Group, Intel Corporation Intel Corporation February 1997  –  December 2002  (5 years 11 months) Managed all aspects the Pentium III Mobile processor production strategy by setting and communicating the build plan for the factories and geographies worldwide \n \nTotal shipments included over 13.5 million units over two years. \n \nBrought days of inventory down by up to 50% for certain line items by implementing a new process for the marketing team to make pricing and ramp decisions. \n \nSemiconductors ▸ Memory Components \nSuppliers - Samsung - NEC - Motorola  \nSkills - ERP - Negotiations - Build Plan - Inventory Management - Pricing Intern Ecanal 1995  –  1996  (1 year) Mexico City Area, Mexico As an intern at Ecanal, I worked under one of Mexico's most respected economists. I supported his research activities by providing data and analysis on macroeconomic factors. I also coordinated round table meetings he held with Fortune 100 multi-national companies he consulted. Director of Strategic Alliances Brocade May 2015  – Present (4 months) San Francisco Bay Area Responsible for go to market strategies with strategic partners for Brocade to drive growth in the company's IP networking and software products. The partnerships will be used to scale thought leadership and drive revenue as the networking industry undergoes a transformation to open, flexible and agile networking solutions that address the demands of today's data center and end customers. Director of Strategic Alliances Brocade May 2015  – Present (4 months) San Francisco Bay Area Responsible for go to market strategies with strategic partners for Brocade to drive growth in the company's IP networking and software products. The partnerships will be used to scale thought leadership and drive revenue as the networking industry undergoes a transformation to open, flexible and agile networking solutions that address the demands of today's data center and end customers. Senior Manager, Alliances, covering HP Account Intel Corporation June 2012  –  May 2015  (3 years) Santa Clara, CA Owned the relationship with HP's Storage, Converged Systems and Worldwide Initiatives teams. This involves setting long-term co-marketing and sales strategies with group vice presidents and working with individual contributors to execute the jointly agreed upon strategy. \n \nThe business units I collaborate with drive over $100M in revenue for Intel annually and I not only drive go to market, I also roll up my sleeves and actively collaborate with my customers and stakeholders, sometimes even authoring solution based content; brainstorming campaign elements; and training field and channel partners. I am passionate about datacenter and storage technology and am consistently building my technical acumen.  \n \nSemiconductors ▸ Storage & Memory ▸ Peripherals ▸ Hardware \nFlash Storage - Enterprise Storage - Server Virtualization - Desktop Virtualization - Data Protection - Backup & Disaster Recovery - HP- Citrix - Red Hat- VMWare - Oracle - Microsoft SQL Server - Exchange - Sharepoint - Linux - Big Data - Cloud - VDI - I/O - SAS - SSD - SATA - HDD Senior Manager, Alliances, covering HP Account Intel Corporation June 2012  –  May 2015  (3 years) Santa Clara, CA Owned the relationship with HP's Storage, Converged Systems and Worldwide Initiatives teams. This involves setting long-term co-marketing and sales strategies with group vice presidents and working with individual contributors to execute the jointly agreed upon strategy. \n \nThe business units I collaborate with drive over $100M in revenue for Intel annually and I not only drive go to market, I also roll up my sleeves and actively collaborate with my customers and stakeholders, sometimes even authoring solution based content; brainstorming campaign elements; and training field and channel partners. I am passionate about datacenter and storage technology and am consistently building my technical acumen.  \n \nSemiconductors ▸ Storage & Memory ▸ Peripherals ▸ Hardware \nFlash Storage - Enterprise Storage - Server Virtualization - Desktop Virtualization - Data Protection - Backup & Disaster Recovery - HP- Citrix - Red Hat- VMWare - Oracle - Microsoft SQL Server - Exchange - Sharepoint - Linux - Big Data - Cloud - VDI - I/O - SAS - SSD - SATA - HDD Senior Enterprise Marketing Manager Intel Corporation January 2008  –  June 2012  (4 years 6 months) Santa Clara, CA In this role, I acted as a liaison between the Intel influence sales teams and the business unit and built my credibility as a trusted advisor to these stakeholders and their customers.  \n \nI managed our teams $4M annual budget and put processes in place so no money would be left unspent \n \nI prioritized and drove marketing programs that told the Intel and partner joint value proposition accross vertical and horizontal industries, thus giving me an amazing breadth of knowledge on what enterprise end customers desire in their datacenter. I shared this knowledge via respected industry content engines such as BrightTalk and through my personal blog. (http://www.brighttalk.com/channel/5365) and  \n \nSemiconductors ▸ Storage & Memory ▸ Peripherals ▸ Hardware ▸ Software \nAlliances: HP- Citrix - Red Hat- VMWare - Oracle - Microsoft - Cirba  \nSegments: Big Data - Cloud - VDI - Mission Critical Computing - HPC \nHealthcare- Amdocs- EPIC- McKesson- Cerner \nFinancial Services- Sungard - Thompson Reuters  \nAnalytics- SAS - SAP - International Institute of Analytics (IIA) \nManufacturing- Siemens PLM - Dassault- Autodesk Senior Enterprise Marketing Manager Intel Corporation January 2008  –  June 2012  (4 years 6 months) Santa Clara, CA In this role, I acted as a liaison between the Intel influence sales teams and the business unit and built my credibility as a trusted advisor to these stakeholders and their customers.  \n \nI managed our teams $4M annual budget and put processes in place so no money would be left unspent \n \nI prioritized and drove marketing programs that told the Intel and partner joint value proposition accross vertical and horizontal industries, thus giving me an amazing breadth of knowledge on what enterprise end customers desire in their datacenter. I shared this knowledge via respected industry content engines such as BrightTalk and through my personal blog. (http://www.brighttalk.com/channel/5365) and  \n \nSemiconductors ▸ Storage & Memory ▸ Peripherals ▸ Hardware ▸ Software \nAlliances: HP- Citrix - Red Hat- VMWare - Oracle - Microsoft - Cirba  \nSegments: Big Data - Cloud - VDI - Mission Critical Computing - HPC \nHealthcare- Amdocs- EPIC- McKesson- Cerner \nFinancial Services- Sungard - Thompson Reuters  \nAnalytics- SAS - SAP - International Institute of Analytics (IIA) \nManufacturing- Siemens PLM - Dassault- Autodesk Field Sales Engineer Intel Corporation 2007  –  2008  (1 year) •\tActively managed ~15 channel customer accounts influencing $25M in revenue over the year \no\tInfluenced several design wins and technology adoptions \no\tParticipated in joint sales calls with end customers \no\tTrained channel sales representatives on Intel roadmap and new product offerings  \no\tImplemented joint marketing programs such as Google Adwords and Intel® Inside Program Field Sales Engineer Intel Corporation 2007  –  2008  (1 year) •\tActively managed ~15 channel customer accounts influencing $25M in revenue over the year \no\tInfluenced several design wins and technology adoptions \no\tParticipated in joint sales calls with end customers \no\tTrained channel sales representatives on Intel roadmap and new product offerings  \no\tImplemented joint marketing programs such as Google Adwords and Intel® Inside Program Field Marketing and Communications Manager Intel Corporation January 2003  –  December 2006  (4 years) As a field marketing, launch and communcations manager, I honed many of the skills that have proved to be very useful in my future positions.  \n \nI sent regular communications to the OEM field team to keep them up to speed on all of Intel's product launches and the opportunities for their accounts to participate in launch activities. I also developed a process in which I gathered field team and business unit input to make a recommendation based on data to the corporate launch team on when Intel should announce a product.  \n \nI aslo completely revamped internal sales content tools and processes including reducing the number of content sites from 40+ to 2 and the number of push mechanisms to 1.  \n \nIn addtion to product launches, i worked with a core team to created demos, press release and speaking opportunities for fellow travelers in launches and events such as Xeon® and Core™ Launch as well as Siggraph; VMWorld; Oracle Open World; Gartner Data Center Group \n \nI helped build out Intel's \"Where to Buy\" website on Intel.com and PC.com \n \nSemiconductors  \nAlliances: Cisco - Dell- HP - IBM - Lenovo - Asus - Sony - Acer - Penguin - Supermicro Field Marketing and Communications Manager Intel Corporation January 2003  –  December 2006  (4 years) As a field marketing, launch and communcations manager, I honed many of the skills that have proved to be very useful in my future positions.  \n \nI sent regular communications to the OEM field team to keep them up to speed on all of Intel's product launches and the opportunities for their accounts to participate in launch activities. I also developed a process in which I gathered field team and business unit input to make a recommendation based on data to the corporate launch team on when Intel should announce a product.  \n \nI aslo completely revamped internal sales content tools and processes including reducing the number of content sites from 40+ to 2 and the number of push mechanisms to 1.  \n \nIn addtion to product launches, i worked with a core team to created demos, press release and speaking opportunities for fellow travelers in launches and events such as Xeon® and Core™ Launch as well as Siggraph; VMWorld; Oracle Open World; Gartner Data Center Group \n \nI helped build out Intel's \"Where to Buy\" website on Intel.com and PC.com \n \nSemiconductors  \nAlliances: Cisco - Dell- HP - IBM - Lenovo - Asus - Sony - Acer - Penguin - Supermicro Senior Business Planner, Technology and Manufacturing Group, Intel Corporation Intel Corporation February 1997  –  December 2002  (5 years 11 months) Managed all aspects the Pentium III Mobile processor production strategy by setting and communicating the build plan for the factories and geographies worldwide \n \nTotal shipments included over 13.5 million units over two years. \n \nBrought days of inventory down by up to 50% for certain line items by implementing a new process for the marketing team to make pricing and ramp decisions. \n \nSemiconductors ▸ Memory Components \nSuppliers - Samsung - NEC - Motorola  \nSkills - ERP - Negotiations - Build Plan - Inventory Management - Pricing Senior Business Planner, Technology and Manufacturing Group, Intel Corporation Intel Corporation February 1997  –  December 2002  (5 years 11 months) Managed all aspects the Pentium III Mobile processor production strategy by setting and communicating the build plan for the factories and geographies worldwide \n \nTotal shipments included over 13.5 million units over two years. \n \nBrought days of inventory down by up to 50% for certain line items by implementing a new process for the marketing team to make pricing and ramp decisions. \n \nSemiconductors ▸ Memory Components \nSuppliers - Samsung - NEC - Motorola  \nSkills - ERP - Negotiations - Build Plan - Inventory Management - Pricing Intern Ecanal 1995  –  1996  (1 year) Mexico City Area, Mexico As an intern at Ecanal, I worked under one of Mexico's most respected economists. I supported his research activities by providing data and analysis on macroeconomic factors. I also coordinated round table meetings he held with Fortune 100 multi-national companies he consulted. Intern Ecanal 1995  –  1996  (1 year) Mexico City Area, Mexico As an intern at Ecanal, I worked under one of Mexico's most respected economists. I supported his research activities by providing data and analysis on macroeconomic factors. I also coordinated round table meetings he held with Fortune 100 multi-national companies he consulted. Languages English Native or bilingual proficiency Spanish Professional working proficiency Gujarati Limited working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Gujarati Limited working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Gujarati Limited working proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills Enterprise Software Cross-functional Team... Business Alliances Cloud Computing Channel Virtualization Online Marketing Semiconductors Go-to-market Strategy Data Center Demand Generation Strategic Partnerships Solution Selling Lead Generation Intel Product Marketing Product Management SaaS Strategy Channel Partners Multi-channel Marketing See 6+     See less Skills  Enterprise Software Cross-functional Team... Business Alliances Cloud Computing Channel Virtualization Online Marketing Semiconductors Go-to-market Strategy Data Center Demand Generation Strategic Partnerships Solution Selling Lead Generation Intel Product Marketing Product Management SaaS Strategy Channel Partners Multi-channel Marketing See 6+     See less Enterprise Software Cross-functional Team... Business Alliances Cloud Computing Channel Virtualization Online Marketing Semiconductors Go-to-market Strategy Data Center Demand Generation Strategic Partnerships Solution Selling Lead Generation Intel Product Marketing Product Management SaaS Strategy Channel Partners Multi-channel Marketing See 6+     See less Enterprise Software Cross-functional Team... Business Alliances Cloud Computing Channel Virtualization Online Marketing Semiconductors Go-to-market Strategy Data Center Demand Generation Strategic Partnerships Solution Selling Lead Generation Intel Product Marketing Product Management SaaS Strategy Channel Partners Multi-channel Marketing See 6+     See less Education Babson College MBA,  Entrepreneurship/Entrepreneurial Studies 2003  – 2005 Masters in Business Administration with a specialization in Entreprenuership University of California, San Diego Bachelor's Degree,  Political Science and Government and Economics , 3.4 GPA 1989  – 1993 I majored in Political Science and also studied Economics and History. \nI was part of the residential leadership team and president of a student organization. Activities and Societies:  Residential Advisor 1991-93\nSangam ,  Indian Cultural Organization Leadership 1990-93\nCommuter Support Staff 1990-91 Babson College MBA,  Entrepreneurship/Entrepreneurial Studies 2003  – 2005 Masters in Business Administration with a specialization in Entreprenuership Babson College MBA,  Entrepreneurship/Entrepreneurial Studies 2003  – 2005 Masters in Business Administration with a specialization in Entreprenuership Babson College MBA,  Entrepreneurship/Entrepreneurial Studies 2003  – 2005 Masters in Business Administration with a specialization in Entreprenuership University of California, San Diego Bachelor's Degree,  Political Science and Government and Economics , 3.4 GPA 1989  – 1993 I majored in Political Science and also studied Economics and History. \nI was part of the residential leadership team and president of a student organization. Activities and Societies:  Residential Advisor 1991-93\nSangam ,  Indian Cultural Organization Leadership 1990-93\nCommuter Support Staff 1990-91 University of California, San Diego Bachelor's Degree,  Political Science and Government and Economics , 3.4 GPA 1989  – 1993 I majored in Political Science and also studied Economics and History. \nI was part of the residential leadership team and president of a student organization. Activities and Societies:  Residential Advisor 1991-93\nSangam ,  Indian Cultural Organization Leadership 1990-93\nCommuter Support Staff 1990-91 University of California, San Diego Bachelor's Degree,  Political Science and Government and Economics , 3.4 GPA 1989  – 1993 I majored in Political Science and also studied Economics and History. \nI was part of the residential leadership team and president of a student organization. Activities and Societies:  Residential Advisor 1991-93\nSangam ,  Indian Cultural Organization Leadership 1990-93\nCommuter Support Staff 1990-91 ", "Skills Brochures Web Content Problem Solving Magazine Articles Internal Communications Newsletters Corporate Communications Promotions Messaging Executive Communications Editing Communications Planning Communications Strategy Writing Strategic Communications Marketing Communications Copy Editing Content Management Web Content Management Editorial Content Strategy Leadership Training Communication Training Marketing See 10+     See less Skills  Brochures Web Content Problem Solving Magazine Articles Internal Communications Newsletters Corporate Communications Promotions Messaging Executive Communications Editing Communications Planning Communications Strategy Writing Strategic Communications Marketing Communications Copy Editing Content Management Web Content Management Editorial Content Strategy Leadership Training Communication Training Marketing See 10+     See less Brochures Web Content Problem Solving Magazine Articles Internal Communications Newsletters Corporate Communications Promotions Messaging Executive Communications Editing Communications Planning Communications Strategy Writing Strategic Communications Marketing Communications Copy Editing Content Management Web Content Management Editorial Content Strategy Leadership Training Communication Training Marketing See 10+     See less Brochures Web Content Problem Solving Magazine Articles Internal Communications Newsletters Corporate Communications Promotions Messaging Executive Communications Editing Communications Planning Communications Strategy Writing Strategic Communications Marketing Communications Copy Editing Content Management Web Content Management Editorial Content Strategy Leadership Training Communication Training Marketing See 10+     See less "]}