{"position": "Marketing Communications", "company": "IBM", "profiles": ["Experience Demand Programs Professional, Marketing & Communications IBM November 2012  – Present (2 years 10 months) Marketing Specialist, Demand Programs, Marketing & Communications IBM June 2012  –  October 2012  (5 months) Marketing Administrator, General Business IBM December 2007  –  February 2012  (4 years 3 months) Student Service Officer Wall Street Institute August 2002  –  July 2007  (5 years) Demand Programs Professional, Marketing & Communications IBM November 2012  – Present (2 years 10 months) Demand Programs Professional, Marketing & Communications IBM November 2012  – Present (2 years 10 months) Marketing Specialist, Demand Programs, Marketing & Communications IBM June 2012  –  October 2012  (5 months) Marketing Specialist, Demand Programs, Marketing & Communications IBM June 2012  –  October 2012  (5 months) Marketing Administrator, General Business IBM December 2007  –  February 2012  (4 years 3 months) Marketing Administrator, General Business IBM December 2007  –  February 2012  (4 years 3 months) Student Service Officer Wall Street Institute August 2002  –  July 2007  (5 years) Student Service Officer Wall Street Institute August 2002  –  July 2007  (5 years) Languages English Cantonese Mandarin English Cantonese Mandarin English Cantonese Mandarin Skills Marketing Strategy Digital Marketing Program Management Account Management Marketing Skills  Marketing Strategy Digital Marketing Program Management Account Management Marketing Marketing Strategy Digital Marketing Program Management Account Management Marketing Marketing Strategy Digital Marketing Program Management Account Management Marketing Education Curtin University of Technology Bachelor of Commerce (BCom),  Logistics & Marketing 2004  – 2006 Curtin University of Technology Bachelor of Commerce (BCom),  Logistics & Marketing 2004  – 2006 Curtin University of Technology Bachelor of Commerce (BCom),  Logistics & Marketing 2004  – 2006 Curtin University of Technology Bachelor of Commerce (BCom),  Logistics & Marketing 2004  – 2006 ", "Experience Director, Marketing & Communications IBM Canada Ltd. May 2014  – Present (1 year 4 months) As the Director of Marketing & Communications at IBM Canada, I am responsible for the strategy and delivery of IBM's brand and reputation, and its sales pipeline development, leading a team with expertise across all aspects of go-to-market strategy and execution; including market segment management, marketing programs and public relations. Director, Smarter Solutions IBM Canada Ltd. April 2013  –  May 2014  (1 year 2 months) As the Director of Smarter Solutions for Canada, I worked with a team of industry subject matter experts who proposed IBM solutions that help Line-of-Business and Functional executives achieve their desired business outcomes. These Smarter Planet Industry Solutions included IBM software, services, and hardware, and incorporated IBM’s Smarter Analytics (including Big Data), Smarter Commerce, Smarter Cities, Mobility, Cloud, and Social Business capabilities. Director, Smarter Analytics IBM Canada Ltd. February 2012  –  April 2013  (1 year 3 months) As the Director of Smarter Analytics for IBM Canada, I was responsible for defining the strategy and leading this cross-brand initiative, working closely with many clients, Business Partners and their IBM teams to help them find ways to leverage information to grow revenue, lower costs and manage risk. Director, Sales Management Support IBM Canada Ltd. November 2008  –  February 2012  (3 years 4 months) As Director of Sales Operations for IBM Canada, I was responsible for building the organizational capability required to support and enable our sales divisions across IBM Canada. Branch Director, Ontario Enterprise IBM Canada Ltd. January 2008  –  November 2008  (11 months) As Branch Director for the Ontario Enterprise accounts in IBM's General Business organization, I was responsible for working with customers and Business Partners to drive customer value and growth in IBM's share of their business. Director, Marketing & Communications IBM Canada Ltd. May 2014  – Present (1 year 4 months) As the Director of Marketing & Communications at IBM Canada, I am responsible for the strategy and delivery of IBM's brand and reputation, and its sales pipeline development, leading a team with expertise across all aspects of go-to-market strategy and execution; including market segment management, marketing programs and public relations. Director, Marketing & Communications IBM Canada Ltd. May 2014  – Present (1 year 4 months) As the Director of Marketing & Communications at IBM Canada, I am responsible for the strategy and delivery of IBM's brand and reputation, and its sales pipeline development, leading a team with expertise across all aspects of go-to-market strategy and execution; including market segment management, marketing programs and public relations. Director, Smarter Solutions IBM Canada Ltd. April 2013  –  May 2014  (1 year 2 months) As the Director of Smarter Solutions for Canada, I worked with a team of industry subject matter experts who proposed IBM solutions that help Line-of-Business and Functional executives achieve their desired business outcomes. These Smarter Planet Industry Solutions included IBM software, services, and hardware, and incorporated IBM’s Smarter Analytics (including Big Data), Smarter Commerce, Smarter Cities, Mobility, Cloud, and Social Business capabilities. Director, Smarter Solutions IBM Canada Ltd. April 2013  –  May 2014  (1 year 2 months) As the Director of Smarter Solutions for Canada, I worked with a team of industry subject matter experts who proposed IBM solutions that help Line-of-Business and Functional executives achieve their desired business outcomes. These Smarter Planet Industry Solutions included IBM software, services, and hardware, and incorporated IBM’s Smarter Analytics (including Big Data), Smarter Commerce, Smarter Cities, Mobility, Cloud, and Social Business capabilities. Director, Smarter Analytics IBM Canada Ltd. February 2012  –  April 2013  (1 year 3 months) As the Director of Smarter Analytics for IBM Canada, I was responsible for defining the strategy and leading this cross-brand initiative, working closely with many clients, Business Partners and their IBM teams to help them find ways to leverage information to grow revenue, lower costs and manage risk. Director, Smarter Analytics IBM Canada Ltd. February 2012  –  April 2013  (1 year 3 months) As the Director of Smarter Analytics for IBM Canada, I was responsible for defining the strategy and leading this cross-brand initiative, working closely with many clients, Business Partners and their IBM teams to help them find ways to leverage information to grow revenue, lower costs and manage risk. Director, Sales Management Support IBM Canada Ltd. November 2008  –  February 2012  (3 years 4 months) As Director of Sales Operations for IBM Canada, I was responsible for building the organizational capability required to support and enable our sales divisions across IBM Canada. Director, Sales Management Support IBM Canada Ltd. November 2008  –  February 2012  (3 years 4 months) As Director of Sales Operations for IBM Canada, I was responsible for building the organizational capability required to support and enable our sales divisions across IBM Canada. Branch Director, Ontario Enterprise IBM Canada Ltd. January 2008  –  November 2008  (11 months) As Branch Director for the Ontario Enterprise accounts in IBM's General Business organization, I was responsible for working with customers and Business Partners to drive customer value and growth in IBM's share of their business. Branch Director, Ontario Enterprise IBM Canada Ltd. January 2008  –  November 2008  (11 months) As Branch Director for the Ontario Enterprise accounts in IBM's General Business organization, I was responsible for working with customers and Business Partners to drive customer value and growth in IBM's share of their business. Skills Enterprise Software Sales Management Sales Operations Strategy Team Leadership Account Management Analytics Channel Business Intelligence Direct Sales Professional Services CRM Sales Business Alliances IT Strategy New Business Development Business Transformation Program Management Selling Management Leadership Channel Partners Pre-sales Sales Enablement Solution Selling Marketing Communications Market Planning Integrated Marketing Market Development Social Media Marketing Corporate Communications See 16+     See less Skills  Enterprise Software Sales Management Sales Operations Strategy Team Leadership Account Management Analytics Channel Business Intelligence Direct Sales Professional Services CRM Sales Business Alliances IT Strategy New Business Development Business Transformation Program Management Selling Management Leadership Channel Partners Pre-sales Sales Enablement Solution Selling Marketing Communications Market Planning Integrated Marketing Market Development Social Media Marketing Corporate Communications See 16+     See less Enterprise Software Sales Management Sales Operations Strategy Team Leadership Account Management Analytics Channel Business Intelligence Direct Sales Professional Services CRM Sales Business Alliances IT Strategy New Business Development Business Transformation Program Management Selling Management Leadership Channel Partners Pre-sales Sales Enablement Solution Selling Marketing Communications Market Planning Integrated Marketing Market Development Social Media Marketing Corporate Communications See 16+     See less Enterprise Software Sales Management Sales Operations Strategy Team Leadership Account Management Analytics Channel Business Intelligence Direct Sales Professional Services CRM Sales Business Alliances IT Strategy New Business Development Business Transformation Program Management Selling Management Leadership Channel Partners Pre-sales Sales Enablement Solution Selling Marketing Communications Market Planning Integrated Marketing Market Development Social Media Marketing Corporate Communications See 16+     See less Education University of Saskatchewan Commerce,  International Marketing and General Business 1983  – 1988 University of Saskatchewan Commerce,  International Marketing and General Business 1983  – 1988 University of Saskatchewan Commerce,  International Marketing and General Business 1983  – 1988 University of Saskatchewan Commerce,  International Marketing and General Business 1983  – 1988 ", "Skills Demand Generation Sales Enablement Thought Leadership Integrated Marketing Strategic Communications Direct Marketing Strategy Marketing Communications Corporate Communications Digital Marketing Digital Strategy Internal Communications Leadership Brand Management Media Relations Marketing B2B Marketing Program Management Social Media Advertising Social Networking Strategic Planning Management See 8+     See less Skills  Demand Generation Sales Enablement Thought Leadership Integrated Marketing Strategic Communications Direct Marketing Strategy Marketing Communications Corporate Communications Digital Marketing Digital Strategy Internal Communications Leadership Brand Management Media Relations Marketing B2B Marketing Program Management Social Media Advertising Social Networking Strategic Planning Management See 8+     See less Demand Generation Sales Enablement Thought Leadership Integrated Marketing Strategic Communications Direct Marketing Strategy Marketing Communications Corporate Communications Digital Marketing Digital Strategy Internal Communications Leadership Brand Management Media Relations Marketing B2B Marketing Program Management Social Media Advertising Social Networking Strategic Planning Management See 8+     See less Demand Generation Sales Enablement Thought Leadership Integrated Marketing Strategic Communications Direct Marketing Strategy Marketing Communications Corporate Communications Digital Marketing Digital Strategy Internal Communications Leadership Brand Management Media Relations Marketing B2B Marketing Program Management Social Media Advertising Social Networking Strategic Planning Management See 8+     See less ", "Summary Maria is the Head of Talent, Culture & Advocacy for Marketing and Communications at IBM. She joins the Marketing & Communications leadership team to accelerate and scale the redesign of the function by creating programs and rituals that promote and reinforce a unique culture. \n \nPreviously, as the Head of Global Recruiting & External Relations for IBM Design, Maria was responsible for building high-performing product design teams. Maria joined IBM Design at its inception and took on the mission of closing a massive talent gap of designers within our Cloud, Analytics, Social, Security, & Watson business units. She led the talent team for 2.5 years which successfully sourced, evaluated, hired, and on-boarded 450+ designers into IBM Studios worldwide in a whole new way. By sharing IBM's story at events, developing partnerships with top design universities & communities, implementing a high-touch recruiting program, and overhauling the entire experience to be engaging & highly responsive within a competitive market – her team attracted thousands of candidates and achieved an 83% offer acceptance rate. She was also involved with the deployment strategy of designers and helped create programs dedicated to educating + activating IBMers in IBM Design Thinking, in addition to limiting attrition & building out IBM's global product design studios.  \n \nBefore IBM Design, Maria led various product launch activities, set best practices to help drive millions of dollars in software + services sales and maintained relationships with many Fortune 500 clients as a Product Marketing Manager for IBM's Smarter Process portfolio. She joined IBM with the 2010 acquisition of Lombardi Software where she was integral to the integration process of Lombardi as well as go-to-market strategy of industry-leading BPM technology. Maria holds a bachelor's of science degree in Industrial & Operations Engineering from the University of Michigan. She is from New York and currently calls Austin, Texas home. Summary Maria is the Head of Talent, Culture & Advocacy for Marketing and Communications at IBM. She joins the Marketing & Communications leadership team to accelerate and scale the redesign of the function by creating programs and rituals that promote and reinforce a unique culture. \n \nPreviously, as the Head of Global Recruiting & External Relations for IBM Design, Maria was responsible for building high-performing product design teams. Maria joined IBM Design at its inception and took on the mission of closing a massive talent gap of designers within our Cloud, Analytics, Social, Security, & Watson business units. She led the talent team for 2.5 years which successfully sourced, evaluated, hired, and on-boarded 450+ designers into IBM Studios worldwide in a whole new way. By sharing IBM's story at events, developing partnerships with top design universities & communities, implementing a high-touch recruiting program, and overhauling the entire experience to be engaging & highly responsive within a competitive market – her team attracted thousands of candidates and achieved an 83% offer acceptance rate. She was also involved with the deployment strategy of designers and helped create programs dedicated to educating + activating IBMers in IBM Design Thinking, in addition to limiting attrition & building out IBM's global product design studios.  \n \nBefore IBM Design, Maria led various product launch activities, set best practices to help drive millions of dollars in software + services sales and maintained relationships with many Fortune 500 clients as a Product Marketing Manager for IBM's Smarter Process portfolio. She joined IBM with the 2010 acquisition of Lombardi Software where she was integral to the integration process of Lombardi as well as go-to-market strategy of industry-leading BPM technology. Maria holds a bachelor's of science degree in Industrial & Operations Engineering from the University of Michigan. She is from New York and currently calls Austin, Texas home. Maria is the Head of Talent, Culture & Advocacy for Marketing and Communications at IBM. She joins the Marketing & Communications leadership team to accelerate and scale the redesign of the function by creating programs and rituals that promote and reinforce a unique culture. \n \nPreviously, as the Head of Global Recruiting & External Relations for IBM Design, Maria was responsible for building high-performing product design teams. Maria joined IBM Design at its inception and took on the mission of closing a massive talent gap of designers within our Cloud, Analytics, Social, Security, & Watson business units. She led the talent team for 2.5 years which successfully sourced, evaluated, hired, and on-boarded 450+ designers into IBM Studios worldwide in a whole new way. By sharing IBM's story at events, developing partnerships with top design universities & communities, implementing a high-touch recruiting program, and overhauling the entire experience to be engaging & highly responsive within a competitive market – her team attracted thousands of candidates and achieved an 83% offer acceptance rate. She was also involved with the deployment strategy of designers and helped create programs dedicated to educating + activating IBMers in IBM Design Thinking, in addition to limiting attrition & building out IBM's global product design studios.  \n \nBefore IBM Design, Maria led various product launch activities, set best practices to help drive millions of dollars in software + services sales and maintained relationships with many Fortune 500 clients as a Product Marketing Manager for IBM's Smarter Process portfolio. She joined IBM with the 2010 acquisition of Lombardi Software where she was integral to the integration process of Lombardi as well as go-to-market strategy of industry-leading BPM technology. Maria holds a bachelor's of science degree in Industrial & Operations Engineering from the University of Michigan. She is from New York and currently calls Austin, Texas home. Maria is the Head of Talent, Culture & Advocacy for Marketing and Communications at IBM. She joins the Marketing & Communications leadership team to accelerate and scale the redesign of the function by creating programs and rituals that promote and reinforce a unique culture. \n \nPreviously, as the Head of Global Recruiting & External Relations for IBM Design, Maria was responsible for building high-performing product design teams. Maria joined IBM Design at its inception and took on the mission of closing a massive talent gap of designers within our Cloud, Analytics, Social, Security, & Watson business units. She led the talent team for 2.5 years which successfully sourced, evaluated, hired, and on-boarded 450+ designers into IBM Studios worldwide in a whole new way. By sharing IBM's story at events, developing partnerships with top design universities & communities, implementing a high-touch recruiting program, and overhauling the entire experience to be engaging & highly responsive within a competitive market – her team attracted thousands of candidates and achieved an 83% offer acceptance rate. She was also involved with the deployment strategy of designers and helped create programs dedicated to educating + activating IBMers in IBM Design Thinking, in addition to limiting attrition & building out IBM's global product design studios.  \n \nBefore IBM Design, Maria led various product launch activities, set best practices to help drive millions of dollars in software + services sales and maintained relationships with many Fortune 500 clients as a Product Marketing Manager for IBM's Smarter Process portfolio. She joined IBM with the 2010 acquisition of Lombardi Software where she was integral to the integration process of Lombardi as well as go-to-market strategy of industry-leading BPM technology. Maria holds a bachelor's of science degree in Industrial & Operations Engineering from the University of Michigan. She is from New York and currently calls Austin, Texas home. Experience Head of Talent, Culture & Advocacy | IBM Marketing and Communications IBM May 2015  – Present (4 months) Worldwide IBM Marketing & Communications recently kicked off a major initiative to transform the entire 5000+ person organization. I will be working on accelerating and scaling the redesign of the function and will focus on overhauling M&C's recruitment, on-boarding, enrichment, and education programs. Head of External Relations & Global Recruiting, IBM Design IBM October 2012  –  May 2015  (2 years 8 months) Austin, Texas Area Designing for a purpose, for a person, the world, and the future. \n \nIBM Design engages and inspires forward-thinking individuals everywhere to impact humanity in ways that matter and endure. We’re looking for designers who will conceive, articulate and lead the future of IBM’s entire product portfolio. \n \nIf you are passionate about solving critical and complex problems, interacting directly with end users, working with powerful technology, and ultimately delivering exceptional experiences through great design — we look forward to hearing from you. \n \nIndustry professionals and upcoming or recent college graduates are welcome to apply. Full-time and internship positions are available to start immediately. \n \nWelcome to a new era of design-led innovation. We’re hiring. Come explore the opportunities. ibm.com/design BPM Product Marketing Manager IBM February 2010  –  January 2013  (3 years) Austin, Texas Worldwide Product Marketing Manager for the WebSphere BPM Portfolio. Solutions Marketing Lombardi Software July 2009  –  February 2010  (8 months) Focused on BPM solutions using Lombardi Teamworks and Lombardi Blueprint IT Intern University of Michigan May 2008  –  May 2009  (1 year 1 month) IT Intern at the Gerald R. Ford School of Public Policy and the Life Sciences Institute at UofM. Head of Talent, Culture & Advocacy | IBM Marketing and Communications IBM May 2015  – Present (4 months) Worldwide IBM Marketing & Communications recently kicked off a major initiative to transform the entire 5000+ person organization. I will be working on accelerating and scaling the redesign of the function and will focus on overhauling M&C's recruitment, on-boarding, enrichment, and education programs. Head of Talent, Culture & Advocacy | IBM Marketing and Communications IBM May 2015  – Present (4 months) Worldwide IBM Marketing & Communications recently kicked off a major initiative to transform the entire 5000+ person organization. I will be working on accelerating and scaling the redesign of the function and will focus on overhauling M&C's recruitment, on-boarding, enrichment, and education programs. Head of External Relations & Global Recruiting, IBM Design IBM October 2012  –  May 2015  (2 years 8 months) Austin, Texas Area Designing for a purpose, for a person, the world, and the future. \n \nIBM Design engages and inspires forward-thinking individuals everywhere to impact humanity in ways that matter and endure. We’re looking for designers who will conceive, articulate and lead the future of IBM’s entire product portfolio. \n \nIf you are passionate about solving critical and complex problems, interacting directly with end users, working with powerful technology, and ultimately delivering exceptional experiences through great design — we look forward to hearing from you. \n \nIndustry professionals and upcoming or recent college graduates are welcome to apply. Full-time and internship positions are available to start immediately. \n \nWelcome to a new era of design-led innovation. We’re hiring. Come explore the opportunities. ibm.com/design Head of External Relations & Global Recruiting, IBM Design IBM October 2012  –  May 2015  (2 years 8 months) Austin, Texas Area Designing for a purpose, for a person, the world, and the future. \n \nIBM Design engages and inspires forward-thinking individuals everywhere to impact humanity in ways that matter and endure. We’re looking for designers who will conceive, articulate and lead the future of IBM’s entire product portfolio. \n \nIf you are passionate about solving critical and complex problems, interacting directly with end users, working with powerful technology, and ultimately delivering exceptional experiences through great design — we look forward to hearing from you. \n \nIndustry professionals and upcoming or recent college graduates are welcome to apply. Full-time and internship positions are available to start immediately. \n \nWelcome to a new era of design-led innovation. We’re hiring. Come explore the opportunities. ibm.com/design BPM Product Marketing Manager IBM February 2010  –  January 2013  (3 years) Austin, Texas Worldwide Product Marketing Manager for the WebSphere BPM Portfolio. BPM Product Marketing Manager IBM February 2010  –  January 2013  (3 years) Austin, Texas Worldwide Product Marketing Manager for the WebSphere BPM Portfolio. Solutions Marketing Lombardi Software July 2009  –  February 2010  (8 months) Focused on BPM solutions using Lombardi Teamworks and Lombardi Blueprint Solutions Marketing Lombardi Software July 2009  –  February 2010  (8 months) Focused on BPM solutions using Lombardi Teamworks and Lombardi Blueprint IT Intern University of Michigan May 2008  –  May 2009  (1 year 1 month) IT Intern at the Gerald R. Ford School of Public Policy and the Life Sciences Institute at UofM. IT Intern University of Michigan May 2008  –  May 2009  (1 year 1 month) IT Intern at the Gerald R. Ford School of Public Policy and the Life Sciences Institute at UofM. Languages Malayalam Native or bilingual proficiency English Native or bilingual proficiency Malayalam Native or bilingual proficiency English Native or bilingual proficiency Malayalam Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills SQL Visual Basic Process Improvement Matlab Mathematica Business Process Design Talent Management Program Management Six Sigma Business Process Business Process... Cloud Computing Cross-functional Team... Business Process... Enterprise Architecture Agile Methodologies See 1+     See less Skills  SQL Visual Basic Process Improvement Matlab Mathematica Business Process Design Talent Management Program Management Six Sigma Business Process Business Process... Cloud Computing Cross-functional Team... Business Process... Enterprise Architecture Agile Methodologies See 1+     See less SQL Visual Basic Process Improvement Matlab Mathematica Business Process Design Talent Management Program Management Six Sigma Business Process Business Process... Cloud Computing Cross-functional Team... Business Process... Enterprise Architecture Agile Methodologies See 1+     See less SQL Visual Basic Process Improvement Matlab Mathematica Business Process Design Talent Management Program Management Six Sigma Business Process Business Process... Cloud Computing Cross-functional Team... Business Process... Enterprise Architecture Agile Methodologies See 1+     See less Education University of Michigan BS,  Industrial & Operations Engineering 2005  – 2009 Activities and Societies:  St. Mary's Student Parish ,  Society of Automotive Engineers ,  Institute of Industrial Engineers ,  University of Michigan Solar Car Business Team Fox Lane High School University of Michigan BS,  Industrial & Operations Engineering 2005  – 2009 Activities and Societies:  St. Mary's Student Parish ,  Society of Automotive Engineers ,  Institute of Industrial Engineers ,  University of Michigan Solar Car Business Team University of Michigan BS,  Industrial & Operations Engineering 2005  – 2009 Activities and Societies:  St. Mary's Student Parish ,  Society of Automotive Engineers ,  Institute of Industrial Engineers ,  University of Michigan Solar Car Business Team University of Michigan BS,  Industrial & Operations Engineering 2005  – 2009 Activities and Societies:  St. Mary's Student Parish ,  Society of Automotive Engineers ,  Institute of Industrial Engineers ,  University of Michigan Solar Car Business Team Fox Lane High School Fox Lane High School Fox Lane High School ", "Summary Senior Marketing Manager with broad experience in Marketing Communications and Product Marketing. Specialties:Marketing ROI, Enterprise Marketing, Field Marketing, Budget Management, Demand Generation, Lead Management, Advertising, Marketing Programs, Resource Management Summary Senior Marketing Manager with broad experience in Marketing Communications and Product Marketing. Specialties:Marketing ROI, Enterprise Marketing, Field Marketing, Budget Management, Demand Generation, Lead Management, Advertising, Marketing Programs, Resource Management Senior Marketing Manager with broad experience in Marketing Communications and Product Marketing. Specialties:Marketing ROI, Enterprise Marketing, Field Marketing, Budget Management, Demand Generation, Lead Management, Advertising, Marketing Programs, Resource Management Senior Marketing Manager with broad experience in Marketing Communications and Product Marketing. Specialties:Marketing ROI, Enterprise Marketing, Field Marketing, Budget Management, Demand Generation, Lead Management, Advertising, Marketing Programs, Resource Management Experience Marketing Director Oracle June 2013  – Present (2 years 3 months) Senior Marketing Manager Oracle August 2003  –  June 2013  (9 years 11 months) Product Marketing Manager for Tech products including Database, Fusion Middleware (SOA, Integration, Security, BI, Collaboration). Manager Integrated Marketing Communications IBM 2001  –  2003  (2 years) Supervise communication plan for all IBM units \nMarketing budget allocation \nMedia and advertising plan \nLaunch major IBM e-business Campaign \nManage and supervise 12 direct reports Specialist Integrating Marketing Communications IBM 1998  –  2000  (2 years) Strategist Direct Marketing IBM 1996  –  1998  (2 years) Varias Posiciones IBM 1991  –  1996  (5 years) Marketing Director Oracle June 2013  – Present (2 years 3 months) Marketing Director Oracle June 2013  – Present (2 years 3 months) Senior Marketing Manager Oracle August 2003  –  June 2013  (9 years 11 months) Product Marketing Manager for Tech products including Database, Fusion Middleware (SOA, Integration, Security, BI, Collaboration). Senior Marketing Manager Oracle August 2003  –  June 2013  (9 years 11 months) Product Marketing Manager for Tech products including Database, Fusion Middleware (SOA, Integration, Security, BI, Collaboration). Manager Integrated Marketing Communications IBM 2001  –  2003  (2 years) Supervise communication plan for all IBM units \nMarketing budget allocation \nMedia and advertising plan \nLaunch major IBM e-business Campaign \nManage and supervise 12 direct reports Manager Integrated Marketing Communications IBM 2001  –  2003  (2 years) Supervise communication plan for all IBM units \nMarketing budget allocation \nMedia and advertising plan \nLaunch major IBM e-business Campaign \nManage and supervise 12 direct reports Specialist Integrating Marketing Communications IBM 1998  –  2000  (2 years) Specialist Integrating Marketing Communications IBM 1998  –  2000  (2 years) Strategist Direct Marketing IBM 1996  –  1998  (2 years) Strategist Direct Marketing IBM 1996  –  1998  (2 years) Varias Posiciones IBM 1991  –  1996  (5 years) Varias Posiciones IBM 1991  –  1996  (5 years) Languages Spanish English Spanish English Spanish English Skills Demand Generation Marketing Lead Management Product Marketing Product Management Marketing Communications Integrated Marketing Advertising Management Program Management Sales Enablement Business Alliances Oracle Go-to-market Strategy Channel Enterprise Software Multi-channel Marketing Cloud Computing Channel Partners Solution Selling Product Launch Direct Marketing Leadership CRM Lead Generation See 10+     See less Skills  Demand Generation Marketing Lead Management Product Marketing Product Management Marketing Communications Integrated Marketing Advertising Management Program Management Sales Enablement Business Alliances Oracle Go-to-market Strategy Channel Enterprise Software Multi-channel Marketing Cloud Computing Channel Partners Solution Selling Product Launch Direct Marketing Leadership CRM Lead Generation See 10+     See less Demand Generation Marketing Lead Management Product Marketing Product Management Marketing Communications Integrated Marketing Advertising Management Program Management Sales Enablement Business Alliances Oracle Go-to-market Strategy Channel Enterprise Software Multi-channel Marketing Cloud Computing Channel Partners Solution Selling Product Launch Direct Marketing Leadership CRM Lead Generation See 10+     See less Demand Generation Marketing Lead Management Product Marketing Product Management Marketing Communications Integrated Marketing Advertising Management Program Management Sales Enablement Business Alliances Oracle Go-to-market Strategy Channel Enterprise Software Multi-channel Marketing Cloud Computing Channel Partners Solution Selling Product Launch Direct Marketing Leadership CRM Lead Generation See 10+     See less Education IPADE EXCELLENCE PROGRAM , Diploma 2012  – 2012 Tecnológico de Monterrey Diploma,  Marketing 1999  – 1999 Instituto Politécnico Nacional Bachelors,  Informatica 1986  – 1990 IPADE EXCELLENCE PROGRAM , Diploma 2012  – 2012 IPADE EXCELLENCE PROGRAM , Diploma 2012  – 2012 IPADE EXCELLENCE PROGRAM , Diploma 2012  – 2012 Tecnológico de Monterrey Diploma,  Marketing 1999  – 1999 Tecnológico de Monterrey Diploma,  Marketing 1999  – 1999 Tecnológico de Monterrey Diploma,  Marketing 1999  – 1999 Instituto Politécnico Nacional Bachelors,  Informatica 1986  – 1990 Instituto Politécnico Nacional Bachelors,  Informatica 1986  – 1990 Instituto Politécnico Nacional Bachelors,  Informatica 1986  – 1990 ", "Skills Enterprise Software Solution Selling Sales Enablement SaaS Cloud Computing Strategy Professional Services Complex Sales Procurement Negotiation Business Development Go-to-market Strategy Software Industry Business Alliances Leadership Selling Sourcing Strategic Partnerships CRM Partner Management Demand Generation Business Intelligence Channel Partners Cross-functional Team... Pre-sales Salesforce.com Analytics Outsourcing See 13+     See less Skills  Enterprise Software Solution Selling Sales Enablement SaaS Cloud Computing Strategy Professional Services Complex Sales Procurement Negotiation Business Development Go-to-market Strategy Software Industry Business Alliances Leadership Selling Sourcing Strategic Partnerships CRM Partner Management Demand Generation Business Intelligence Channel Partners Cross-functional Team... Pre-sales Salesforce.com Analytics Outsourcing See 13+     See less Enterprise Software Solution Selling Sales Enablement SaaS Cloud Computing Strategy Professional Services Complex Sales Procurement Negotiation Business Development Go-to-market Strategy Software Industry Business Alliances Leadership Selling Sourcing Strategic Partnerships CRM Partner Management Demand Generation Business Intelligence Channel Partners Cross-functional Team... Pre-sales Salesforce.com Analytics Outsourcing See 13+     See less Enterprise Software Solution Selling Sales Enablement SaaS Cloud Computing Strategy Professional Services Complex Sales Procurement Negotiation Business Development Go-to-market Strategy Software Industry Business Alliances Leadership Selling Sourcing Strategic Partnerships CRM Partner Management Demand Generation Business Intelligence Channel Partners Cross-functional Team... Pre-sales Salesforce.com Analytics Outsourcing See 13+     See less Honors & Awards Patent US Patent December 2010 Myself and 6 other brilliant colleagues were awarded a process patent for Method and System for Displaying Prioritizaton of Metric Values or as we called it Strategic Profiling. Patent US Patent December 2010 Myself and 6 other brilliant colleagues were awarded a process patent for Method and System for Displaying Prioritizaton of Metric Values or as we called it Strategic Profiling. Patent US Patent December 2010 Myself and 6 other brilliant colleagues were awarded a process patent for Method and System for Displaying Prioritizaton of Metric Values or as we called it Strategic Profiling. Patent US Patent December 2010 Myself and 6 other brilliant colleagues were awarded a process patent for Method and System for Displaying Prioritizaton of Metric Values or as we called it Strategic Profiling. ", "Languages English Native or bilingual proficiency Chinese Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Channel Business Strategy Marketing Management Partner Management Business Development Strategy Marketing Communications Demand Generation Integrated Marketing Product Marketing Go-to-market Strategy Business Alliances Marketing Channel Partners CRM E-commerce Sales Enablement Strategic Partnerships Leadership See 4+     See less Skills  Channel Business Strategy Marketing Management Partner Management Business Development Strategy Marketing Communications Demand Generation Integrated Marketing Product Marketing Go-to-market Strategy Business Alliances Marketing Channel Partners CRM E-commerce Sales Enablement Strategic Partnerships Leadership See 4+     See less Channel Business Strategy Marketing Management Partner Management Business Development Strategy Marketing Communications Demand Generation Integrated Marketing Product Marketing Go-to-market Strategy Business Alliances Marketing Channel Partners CRM E-commerce Sales Enablement Strategic Partnerships Leadership See 4+     See less Channel Business Strategy Marketing Management Partner Management Business Development Strategy Marketing Communications Demand Generation Integrated Marketing Product Marketing Go-to-market Strategy Business Alliances Marketing Channel Partners CRM E-commerce Sales Enablement Strategic Partnerships Leadership See 4+     See less ", "Languages Portuguese Native or bilingual proficiency English Native or bilingual proficiency Spanish Professional working proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency Spanish Professional working proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Skills     Honors & Awards ", "Languages French French French Skills Multi-channel Marketing Messaging Marketing Management Go-to-market Strategy Channel Product Launch Product Development Advertising Social Networking Strategy Business Alliances Start-ups SaaS Web Marketing Lead Generation Demand Generation Sales Enablement Marketing Leadership Direct Sales Marketing Strategy B2B Enterprise Software Cloud Computing Product Marketing Channel Partners Solution Selling Market Analysis Integrated Marketing E-commerce Salesforce.com New Business Development Strategic Partnerships Public Relations Cross-functional Team... Market Planning B2B Marketing Partner Management Business Intelligence CRM Competitive Analysis International Sales Business Development Product Management Analytics Program Management Mobile Devices Software Industry Professional Services Sales Process See 35+     See less Skills  Multi-channel Marketing Messaging Marketing Management Go-to-market Strategy Channel Product Launch Product Development Advertising Social Networking Strategy Business Alliances Start-ups SaaS Web Marketing Lead Generation Demand Generation Sales Enablement Marketing Leadership Direct Sales Marketing Strategy B2B Enterprise Software Cloud Computing Product Marketing Channel Partners Solution Selling Market Analysis Integrated Marketing E-commerce Salesforce.com New Business Development Strategic Partnerships Public Relations Cross-functional Team... Market Planning B2B Marketing Partner Management Business Intelligence CRM Competitive Analysis International Sales Business Development Product Management Analytics Program Management Mobile Devices Software Industry Professional Services Sales Process See 35+     See less Multi-channel Marketing Messaging Marketing Management Go-to-market Strategy Channel Product Launch Product Development Advertising Social Networking Strategy Business Alliances Start-ups SaaS Web Marketing Lead Generation Demand Generation Sales Enablement Marketing Leadership Direct Sales Marketing Strategy B2B Enterprise Software Cloud Computing Product Marketing Channel Partners Solution Selling Market Analysis Integrated Marketing E-commerce Salesforce.com New Business Development Strategic Partnerships Public Relations Cross-functional Team... Market Planning B2B Marketing Partner Management Business Intelligence CRM Competitive Analysis International Sales Business Development Product Management Analytics Program Management Mobile Devices Software Industry Professional Services Sales Process See 35+     See less Multi-channel Marketing Messaging Marketing Management Go-to-market Strategy Channel Product Launch Product Development Advertising Social Networking Strategy Business Alliances Start-ups SaaS Web Marketing Lead Generation Demand Generation Sales Enablement Marketing Leadership Direct Sales Marketing Strategy B2B Enterprise Software Cloud Computing Product Marketing Channel Partners Solution Selling Market Analysis Integrated Marketing E-commerce Salesforce.com New Business Development Strategic Partnerships Public Relations Cross-functional Team... Market Planning B2B Marketing Partner Management Business Intelligence CRM Competitive Analysis International Sales Business Development Product Management Analytics Program Management Mobile Devices Software Industry Professional Services Sales Process See 35+     See less ", "Summary Shurjil is an American with diverse Marketing and Communications management experience in the FMCG, Engineering and IT industries - all in leading multinational organizations. He is based in the Middle East market where he has worked for over 11 years.  \n \nIn his current role he is the Head of Marketing & Communications for the IBM-Mobily Alliance and Marketing Leader for IBM Global Technology Services and IBM Security in Saudi Arabia.  \n \nShurjil holds an undergraduate degree in Computer Science from the University of California, Los Angeles (UCLA) and attended Boston University for a full-time MBA program in Marketing and Strategy. \n \nSpecialties: Marketing Management, Marketing Communications, Corporate Communications, Integrated Marketing Communications, Marketing Strategy, Marketing Intelligence, Corporate Strategy, Customer Experience, Brand Management, Event Management, Public Relations, Media Relations, Channel Management, Advertising Summary Shurjil is an American with diverse Marketing and Communications management experience in the FMCG, Engineering and IT industries - all in leading multinational organizations. He is based in the Middle East market where he has worked for over 11 years.  \n \nIn his current role he is the Head of Marketing & Communications for the IBM-Mobily Alliance and Marketing Leader for IBM Global Technology Services and IBM Security in Saudi Arabia.  \n \nShurjil holds an undergraduate degree in Computer Science from the University of California, Los Angeles (UCLA) and attended Boston University for a full-time MBA program in Marketing and Strategy. \n \nSpecialties: Marketing Management, Marketing Communications, Corporate Communications, Integrated Marketing Communications, Marketing Strategy, Marketing Intelligence, Corporate Strategy, Customer Experience, Brand Management, Event Management, Public Relations, Media Relations, Channel Management, Advertising Shurjil is an American with diverse Marketing and Communications management experience in the FMCG, Engineering and IT industries - all in leading multinational organizations. He is based in the Middle East market where he has worked for over 11 years.  \n \nIn his current role he is the Head of Marketing & Communications for the IBM-Mobily Alliance and Marketing Leader for IBM Global Technology Services and IBM Security in Saudi Arabia.  \n \nShurjil holds an undergraduate degree in Computer Science from the University of California, Los Angeles (UCLA) and attended Boston University for a full-time MBA program in Marketing and Strategy. \n \nSpecialties: Marketing Management, Marketing Communications, Corporate Communications, Integrated Marketing Communications, Marketing Strategy, Marketing Intelligence, Corporate Strategy, Customer Experience, Brand Management, Event Management, Public Relations, Media Relations, Channel Management, Advertising Shurjil is an American with diverse Marketing and Communications management experience in the FMCG, Engineering and IT industries - all in leading multinational organizations. He is based in the Middle East market where he has worked for over 11 years.  \n \nIn his current role he is the Head of Marketing & Communications for the IBM-Mobily Alliance and Marketing Leader for IBM Global Technology Services and IBM Security in Saudi Arabia.  \n \nShurjil holds an undergraduate degree in Computer Science from the University of California, Los Angeles (UCLA) and attended Boston University for a full-time MBA program in Marketing and Strategy. \n \nSpecialties: Marketing Management, Marketing Communications, Corporate Communications, Integrated Marketing Communications, Marketing Strategy, Marketing Intelligence, Corporate Strategy, Customer Experience, Brand Management, Event Management, Public Relations, Media Relations, Channel Management, Advertising Experience Head of Marketing & Communications, IBM-Mobily Alliance | Marketing Leader, IBM GTS & Security, KSA IBM May 2013  – Present (2 years 4 months) Riyadh, Saudi Arabia Head of Marketing and Communications for the IBM-Mobily Alliance for IBM Global Technology Services. \n \nLead Marketing for IBM Global Technology Services (GTS) and IBM Security in Saudi Arabia since April 2015. \n \nThe IBM-Mobily Alliance is a strategic agreement worth US $280 million (SAR 1 billion) whereby IBM provides Mobily with robust IT infrastructure and near term innovation to provide the Saudi Arabian market with the best and latest in technology. \n \nThe Alliance brings globally proven IBM intellectual capital, solutions, and delivery capabilities to the Kingdom of Saudi Arabia. It provides cloud-based solutions designed to address the needs of clients across all industries. To cover the needs of larger enterprises, the Alliance delivers tailor-made solutions based on specific client demands. \n \nMobily (Etihad Etisalat) is the fastest growing mobile service provider in the Kingdom established by Etisalat, the UAE based telecommunications company. Country Marketing & Communications Manager Siemens August 2009  –  May 2013  (3 years 10 months) Riyadh, Saudi Arabia Marketing Communications and Corporate Communications management for Corporate and Sectors Energy, Industry, Infrastructure & Cities, and Healthcare for Siemens in Saudi Arabia. Marketing & Communications Executive IBM GMSR July 2005  –  August 2008  (3 years 2 months) Brand Manager Unilever June 2004  –  July 2005  (1 year 2 months) Senior Systems Analyst Unilever January 2004  –  June 2004  (6 months) Head of Marketing & Communications, IBM-Mobily Alliance | Marketing Leader, IBM GTS & Security, KSA IBM May 2013  – Present (2 years 4 months) Riyadh, Saudi Arabia Head of Marketing and Communications for the IBM-Mobily Alliance for IBM Global Technology Services. \n \nLead Marketing for IBM Global Technology Services (GTS) and IBM Security in Saudi Arabia since April 2015. \n \nThe IBM-Mobily Alliance is a strategic agreement worth US $280 million (SAR 1 billion) whereby IBM provides Mobily with robust IT infrastructure and near term innovation to provide the Saudi Arabian market with the best and latest in technology. \n \nThe Alliance brings globally proven IBM intellectual capital, solutions, and delivery capabilities to the Kingdom of Saudi Arabia. It provides cloud-based solutions designed to address the needs of clients across all industries. To cover the needs of larger enterprises, the Alliance delivers tailor-made solutions based on specific client demands. \n \nMobily (Etihad Etisalat) is the fastest growing mobile service provider in the Kingdom established by Etisalat, the UAE based telecommunications company. Head of Marketing & Communications, IBM-Mobily Alliance | Marketing Leader, IBM GTS & Security, KSA IBM May 2013  – Present (2 years 4 months) Riyadh, Saudi Arabia Head of Marketing and Communications for the IBM-Mobily Alliance for IBM Global Technology Services. \n \nLead Marketing for IBM Global Technology Services (GTS) and IBM Security in Saudi Arabia since April 2015. \n \nThe IBM-Mobily Alliance is a strategic agreement worth US $280 million (SAR 1 billion) whereby IBM provides Mobily with robust IT infrastructure and near term innovation to provide the Saudi Arabian market with the best and latest in technology. \n \nThe Alliance brings globally proven IBM intellectual capital, solutions, and delivery capabilities to the Kingdom of Saudi Arabia. It provides cloud-based solutions designed to address the needs of clients across all industries. To cover the needs of larger enterprises, the Alliance delivers tailor-made solutions based on specific client demands. \n \nMobily (Etihad Etisalat) is the fastest growing mobile service provider in the Kingdom established by Etisalat, the UAE based telecommunications company. Country Marketing & Communications Manager Siemens August 2009  –  May 2013  (3 years 10 months) Riyadh, Saudi Arabia Marketing Communications and Corporate Communications management for Corporate and Sectors Energy, Industry, Infrastructure & Cities, and Healthcare for Siemens in Saudi Arabia. Country Marketing & Communications Manager Siemens August 2009  –  May 2013  (3 years 10 months) Riyadh, Saudi Arabia Marketing Communications and Corporate Communications management for Corporate and Sectors Energy, Industry, Infrastructure & Cities, and Healthcare for Siemens in Saudi Arabia. Marketing & Communications Executive IBM GMSR July 2005  –  August 2008  (3 years 2 months) Marketing & Communications Executive IBM GMSR July 2005  –  August 2008  (3 years 2 months) Brand Manager Unilever June 2004  –  July 2005  (1 year 2 months) Brand Manager Unilever June 2004  –  July 2005  (1 year 2 months) Senior Systems Analyst Unilever January 2004  –  June 2004  (6 months) Senior Systems Analyst Unilever January 2004  –  June 2004  (6 months) Skills Skills     Education University of California, Los Angeles Bachelor of Science (B.S.),  Computer Science Minor in Business Management Boston University - School of Management MBA,  Marketing & Strategy University of California, Los Angeles Bachelor of Science (B.S.),  Computer Science Minor in Business Management University of California, Los Angeles Bachelor of Science (B.S.),  Computer Science Minor in Business Management University of California, Los Angeles Bachelor of Science (B.S.),  Computer Science Minor in Business Management Boston University - School of Management MBA,  Marketing & Strategy Boston University - School of Management MBA,  Marketing & Strategy Boston University - School of Management MBA,  Marketing & Strategy Honors & Awards ", "Languages English French English French English French Skills Sales Marketing Internal Communications Executive... Field Enablement Cloud Computing Change Management Project Management Demand Generation Sales Enablement Strategy Management Consulting Competitive Analysis Social Media Marketing Marketing Strategy Business Planning Solution Architecture Management Channel Partners Consulting See 5+     See less Skills  Sales Marketing Internal Communications Executive... Field Enablement Cloud Computing Change Management Project Management Demand Generation Sales Enablement Strategy Management Consulting Competitive Analysis Social Media Marketing Marketing Strategy Business Planning Solution Architecture Management Channel Partners Consulting See 5+     See less Sales Marketing Internal Communications Executive... Field Enablement Cloud Computing Change Management Project Management Demand Generation Sales Enablement Strategy Management Consulting Competitive Analysis Social Media Marketing Marketing Strategy Business Planning Solution Architecture Management Channel Partners Consulting See 5+     See less Sales Marketing Internal Communications Executive... Field Enablement Cloud Computing Change Management Project Management Demand Generation Sales Enablement Strategy Management Consulting Competitive Analysis Social Media Marketing Marketing Strategy Business Planning Solution Architecture Management Channel Partners Consulting See 5+     See less ", "Skills Go-to-market Strategy Cloud Computing CRM Integrated Marketing Enterprise Software Demand Generation Skills  Go-to-market Strategy Cloud Computing CRM Integrated Marketing Enterprise Software Demand Generation Go-to-market Strategy Cloud Computing CRM Integrated Marketing Enterprise Software Demand Generation Go-to-market Strategy Cloud Computing CRM Integrated Marketing Enterprise Software Demand Generation ", "Skills Problem Solving Strategic Communications Analytical Approach Change Management Project Planning Project Implementation Stakeholder Management Project Management Process Improvement Analytical Skills Strategy Data Transformation Management Consulting Business Process... Analytics Business Intelligence IT Strategy Data Analysis Financial Modeling Business Analysis Program Management Business Strategy Analysis Business Transformation Business Development Organizational Design Business Process Cross-functional Team... Outsourcing Governance Business Analytics CRM Project Portfolio... Business Process Design Integration Software Project... ERP Consulting See 23+     See less Skills  Problem Solving Strategic Communications Analytical Approach Change Management Project Planning Project Implementation Stakeholder Management Project Management Process Improvement Analytical Skills Strategy Data Transformation Management Consulting Business Process... Analytics Business Intelligence IT Strategy Data Analysis Financial Modeling Business Analysis Program Management Business Strategy Analysis Business Transformation Business Development Organizational Design Business Process Cross-functional Team... Outsourcing Governance Business Analytics CRM Project Portfolio... Business Process Design Integration Software Project... ERP Consulting See 23+     See less Problem Solving Strategic Communications Analytical Approach Change Management Project Planning Project Implementation Stakeholder Management Project Management Process Improvement Analytical Skills Strategy Data Transformation Management Consulting Business Process... Analytics Business Intelligence IT Strategy Data Analysis Financial Modeling Business Analysis Program Management Business Strategy Analysis Business Transformation Business Development Organizational Design Business Process Cross-functional Team... Outsourcing Governance Business Analytics CRM Project Portfolio... Business Process Design Integration Software Project... ERP Consulting See 23+     See less Problem Solving Strategic Communications Analytical Approach Change Management Project Planning Project Implementation Stakeholder Management Project Management Process Improvement Analytical Skills Strategy Data Transformation Management Consulting Business Process... Analytics Business Intelligence IT Strategy Data Analysis Financial Modeling Business Analysis Program Management Business Strategy Analysis Business Transformation Business Development Organizational Design Business Process Cross-functional Team... Outsourcing Governance Business Analytics CRM Project Portfolio... Business Process Design Integration Software Project... ERP Consulting See 23+     See less ", "Summary Tim is a recognized marketing and strategy leader and focuses on deriving business growth through proficiency building and collaborative relationships. His leadership has been instrumental in growing revenue through strategic digital demand generation and in the creation of shared value with Sales & Channel Partners.  \n \nHaving held a variety of technical and marketing leadership roles throughout his IBM career Tim eagerly joined IBM Marketing and Communications Transformation, Talent, and Learning group as the Leadership Development Program Director to drive organizational performance, marketing leadership development, and talent management. Tim holds an MBA from Duke University and is an award winning marketer and public speaker. Summary Tim is a recognized marketing and strategy leader and focuses on deriving business growth through proficiency building and collaborative relationships. His leadership has been instrumental in growing revenue through strategic digital demand generation and in the creation of shared value with Sales & Channel Partners.  \n \nHaving held a variety of technical and marketing leadership roles throughout his IBM career Tim eagerly joined IBM Marketing and Communications Transformation, Talent, and Learning group as the Leadership Development Program Director to drive organizational performance, marketing leadership development, and talent management. Tim holds an MBA from Duke University and is an award winning marketer and public speaker. Tim is a recognized marketing and strategy leader and focuses on deriving business growth through proficiency building and collaborative relationships. His leadership has been instrumental in growing revenue through strategic digital demand generation and in the creation of shared value with Sales & Channel Partners.  \n \nHaving held a variety of technical and marketing leadership roles throughout his IBM career Tim eagerly joined IBM Marketing and Communications Transformation, Talent, and Learning group as the Leadership Development Program Director to drive organizational performance, marketing leadership development, and talent management. Tim holds an MBA from Duke University and is an award winning marketer and public speaker. Tim is a recognized marketing and strategy leader and focuses on deriving business growth through proficiency building and collaborative relationships. His leadership has been instrumental in growing revenue through strategic digital demand generation and in the creation of shared value with Sales & Channel Partners.  \n \nHaving held a variety of technical and marketing leadership roles throughout his IBM career Tim eagerly joined IBM Marketing and Communications Transformation, Talent, and Learning group as the Leadership Development Program Director to drive organizational performance, marketing leadership development, and talent management. Tim holds an MBA from Duke University and is an award winning marketer and public speaker. Experience Leadership Development Program Director, Global Marketing and Communications IBM June 2014  – Present (1 year 3 months) • Directing program to accelerate the leadership capabilities of mid-career, high potential M&C professionals globally \n• Designer of leadership proficiency paths for all marketing functions \n• Leading talent management strategy and buyer-centric marketing transformation \n• Leading consultancy for strategic program marketing projects including Cloud, Digital, Social, Analytics, Millennials, and Workforce Management \n• Leading leadership program alumni organization Worldwide Demand Programs Marketing Manager IBM November 2012  –  June 2014  (1 year 8 months) • Lead complex Software Channel Marketing and Midmarket demand marketing group responsible for contributing to the delivery of approximately $4B in annual software cross brand revenue.  \n• Skillfully lead global demand generation guidance, digital and social messages and marketing offers for worldwide marketers and channel partners.  \n• Personal sphere of influence included subject matter expertise for market growth areas including Cloud, Analytics, Mobile, and Social.  \n• Created and lead the Worldwide Midmarket Marketing and Sales Community; an innovative initiative to leverage social engagement to increase marketing proficiency and creation of actionable market performance management.  \n• Served as a board contributor on the creation of marketing guidance for the cloud partner Managed Service Provider (MSP) and Cloud Service Provider (CSP) ecosystem to increase Cloud revenues and market share. General Business Midmarket Portfolio Segment Manager IBM January 2009  –  November 2012  (3 years 11 months) Strategy owner of IBM’s software lead-with offerings portfolio for the worldwide small and midsize business segment. The software lead-with portfolio is the key revenue driver and competitive differentiator for IBM's advancement in this segment. Worldwide Marketing Manager, General Business IBM Rational Software September 2006  –  October 2009  (3 years 2 months) Principle responsibility for defining and driving go-to-market planning for Large and Midmarket SMB execution. Includes planning broad innovative communication strategies for demand awareness and lead revenue generation. www.ibm.com/rational/smb Senior Product Marketing Manager IBM Rational Software March 2001  –  September 2006  (5 years 7 months) Responsible for the productization of solutions aimed at the Application Software Quality (ASQ) market. Included in this are the following key areas: \n \nPrimary customer liaison for ASQ test management and planning solutions. \nDriver of product development and positioning. \nFacilitator of competitive and market analysis. Executive eCommerce Consultant Sun Microsystems 1999  –  2001  (2 years) Business Analyst Xilinx, Inc. 1996  –  1999  (3 years) Leadership Development Program Director, Global Marketing and Communications IBM June 2014  – Present (1 year 3 months) • Directing program to accelerate the leadership capabilities of mid-career, high potential M&C professionals globally \n• Designer of leadership proficiency paths for all marketing functions \n• Leading talent management strategy and buyer-centric marketing transformation \n• Leading consultancy for strategic program marketing projects including Cloud, Digital, Social, Analytics, Millennials, and Workforce Management \n• Leading leadership program alumni organization Leadership Development Program Director, Global Marketing and Communications IBM June 2014  – Present (1 year 3 months) • Directing program to accelerate the leadership capabilities of mid-career, high potential M&C professionals globally \n• Designer of leadership proficiency paths for all marketing functions \n• Leading talent management strategy and buyer-centric marketing transformation \n• Leading consultancy for strategic program marketing projects including Cloud, Digital, Social, Analytics, Millennials, and Workforce Management \n• Leading leadership program alumni organization Worldwide Demand Programs Marketing Manager IBM November 2012  –  June 2014  (1 year 8 months) • Lead complex Software Channel Marketing and Midmarket demand marketing group responsible for contributing to the delivery of approximately $4B in annual software cross brand revenue.  \n• Skillfully lead global demand generation guidance, digital and social messages and marketing offers for worldwide marketers and channel partners.  \n• Personal sphere of influence included subject matter expertise for market growth areas including Cloud, Analytics, Mobile, and Social.  \n• Created and lead the Worldwide Midmarket Marketing and Sales Community; an innovative initiative to leverage social engagement to increase marketing proficiency and creation of actionable market performance management.  \n• Served as a board contributor on the creation of marketing guidance for the cloud partner Managed Service Provider (MSP) and Cloud Service Provider (CSP) ecosystem to increase Cloud revenues and market share. Worldwide Demand Programs Marketing Manager IBM November 2012  –  June 2014  (1 year 8 months) • Lead complex Software Channel Marketing and Midmarket demand marketing group responsible for contributing to the delivery of approximately $4B in annual software cross brand revenue.  \n• Skillfully lead global demand generation guidance, digital and social messages and marketing offers for worldwide marketers and channel partners.  \n• Personal sphere of influence included subject matter expertise for market growth areas including Cloud, Analytics, Mobile, and Social.  \n• Created and lead the Worldwide Midmarket Marketing and Sales Community; an innovative initiative to leverage social engagement to increase marketing proficiency and creation of actionable market performance management.  \n• Served as a board contributor on the creation of marketing guidance for the cloud partner Managed Service Provider (MSP) and Cloud Service Provider (CSP) ecosystem to increase Cloud revenues and market share. General Business Midmarket Portfolio Segment Manager IBM January 2009  –  November 2012  (3 years 11 months) Strategy owner of IBM’s software lead-with offerings portfolio for the worldwide small and midsize business segment. The software lead-with portfolio is the key revenue driver and competitive differentiator for IBM's advancement in this segment. General Business Midmarket Portfolio Segment Manager IBM January 2009  –  November 2012  (3 years 11 months) Strategy owner of IBM’s software lead-with offerings portfolio for the worldwide small and midsize business segment. The software lead-with portfolio is the key revenue driver and competitive differentiator for IBM's advancement in this segment. Worldwide Marketing Manager, General Business IBM Rational Software September 2006  –  October 2009  (3 years 2 months) Principle responsibility for defining and driving go-to-market planning for Large and Midmarket SMB execution. Includes planning broad innovative communication strategies for demand awareness and lead revenue generation. www.ibm.com/rational/smb Worldwide Marketing Manager, General Business IBM Rational Software September 2006  –  October 2009  (3 years 2 months) Principle responsibility for defining and driving go-to-market planning for Large and Midmarket SMB execution. Includes planning broad innovative communication strategies for demand awareness and lead revenue generation. www.ibm.com/rational/smb Senior Product Marketing Manager IBM Rational Software March 2001  –  September 2006  (5 years 7 months) Responsible for the productization of solutions aimed at the Application Software Quality (ASQ) market. Included in this are the following key areas: \n \nPrimary customer liaison for ASQ test management and planning solutions. \nDriver of product development and positioning. \nFacilitator of competitive and market analysis. Senior Product Marketing Manager IBM Rational Software March 2001  –  September 2006  (5 years 7 months) Responsible for the productization of solutions aimed at the Application Software Quality (ASQ) market. Included in this are the following key areas: \n \nPrimary customer liaison for ASQ test management and planning solutions. \nDriver of product development and positioning. \nFacilitator of competitive and market analysis. Executive eCommerce Consultant Sun Microsystems 1999  –  2001  (2 years) Executive eCommerce Consultant Sun Microsystems 1999  –  2001  (2 years) Business Analyst Xilinx, Inc. 1996  –  1999  (3 years) Business Analyst Xilinx, Inc. 1996  –  1999  (3 years) Skills Product Management Sales Enablement Go-to-market Strategy Product Marketing Enterprise Software Strategy Demand Generation SaaS Business Alliances Agile Methodologies Cross-functional Team... Pricing Analytics Channel Social Business Virtualization Solution Selling Competitive Analysis Market Analysis Marketing Salesforce.com Cloud Computing Start-ups Channel Partners Sales Pre-sales Partner Management Segmentation Business Intelligence Strategic Planning Lead Generation Software Industry Strategic Partnerships Leadership Product Development Multi-channel Marketing Professional Services CRM Talent Management Leadership Development Coaching & Mentoring Consulting See 27+     See less Skills  Product Management Sales Enablement Go-to-market Strategy Product Marketing Enterprise Software Strategy Demand Generation SaaS Business Alliances Agile Methodologies Cross-functional Team... Pricing Analytics Channel Social Business Virtualization Solution Selling Competitive Analysis Market Analysis Marketing Salesforce.com Cloud Computing Start-ups Channel Partners Sales Pre-sales Partner Management Segmentation Business Intelligence Strategic Planning Lead Generation Software Industry Strategic Partnerships Leadership Product Development Multi-channel Marketing Professional Services CRM Talent Management Leadership Development Coaching & Mentoring Consulting See 27+     See less Product Management Sales Enablement Go-to-market Strategy Product Marketing Enterprise Software Strategy Demand Generation SaaS Business Alliances Agile Methodologies Cross-functional Team... Pricing Analytics Channel Social Business Virtualization Solution Selling Competitive Analysis Market Analysis Marketing Salesforce.com Cloud Computing Start-ups Channel Partners Sales Pre-sales Partner Management Segmentation Business Intelligence Strategic Planning Lead Generation Software Industry Strategic Partnerships Leadership Product Development Multi-channel Marketing Professional Services CRM Talent Management Leadership Development Coaching & Mentoring Consulting See 27+     See less Product Management Sales Enablement Go-to-market Strategy Product Marketing Enterprise Software Strategy Demand Generation SaaS Business Alliances Agile Methodologies Cross-functional Team... Pricing Analytics Channel Social Business Virtualization Solution Selling Competitive Analysis Market Analysis Marketing Salesforce.com Cloud Computing Start-ups Channel Partners Sales Pre-sales Partner Management Segmentation Business Intelligence Strategic Planning Lead Generation Software Industry Strategic Partnerships Leadership Product Development Multi-channel Marketing Professional Services CRM Talent Management Leadership Development Coaching & Mentoring Consulting See 27+     See less Education Duke University - The Fuqua School of Business MBA,  Business 2007  – 2009 Activities and Societies:  Class Representative ,  Class Gift Committee ,  Blue WEMBA Investment Group Board Member Duke University - The Fuqua School of Business MBA,  Business 2007  – 2009 Activities and Societies:  Class Representative ,  Class Gift Committee ,  Blue WEMBA Investment Group Board Member Duke University - The Fuqua School of Business MBA,  Business 2007  – 2009 Activities and Societies:  Class Representative ,  Class Gift Committee ,  Blue WEMBA Investment Group Board Member Duke University - The Fuqua School of Business MBA,  Business 2007  – 2009 Activities and Societies:  Class Representative ,  Class Gift Committee ,  Blue WEMBA Investment Group Board Member ", "Languages Spanish Spanish Spanish Skills Integrated Marketing Strategic Partnerships Media Relations Analytics Email Marketing Business Strategy Product Management Strategy Corporate Communications Content Strategy Database Marketing CRM Return on Investment Cross-functional Team... Marketing Communications Marketing Marketing Strategy Leadership Brand Development Sports E-commerce Entrepreneurship Market Analysis Project Management Segmentation Multi-channel Marketing Start-ups Sports Management Management B2B Marketing Sponsorship Sales SEO Online Marketing Brand Awareness Partnership Marketing Product Development Thought Leadership Event Planning Sponsorship Activation Lead Generation Social Networking Media Planning Web Analytics See 28+     See less Skills  Integrated Marketing Strategic Partnerships Media Relations Analytics Email Marketing Business Strategy Product Management Strategy Corporate Communications Content Strategy Database Marketing CRM Return on Investment Cross-functional Team... Marketing Communications Marketing Marketing Strategy Leadership Brand Development Sports E-commerce Entrepreneurship Market Analysis Project Management Segmentation Multi-channel Marketing Start-ups Sports Management Management B2B Marketing Sponsorship Sales SEO Online Marketing Brand Awareness Partnership Marketing Product Development Thought Leadership Event Planning Sponsorship Activation Lead Generation Social Networking Media Planning Web Analytics See 28+     See less Integrated Marketing Strategic Partnerships Media Relations Analytics Email Marketing Business Strategy Product Management Strategy Corporate Communications Content Strategy Database Marketing CRM Return on Investment Cross-functional Team... Marketing Communications Marketing Marketing Strategy Leadership Brand Development Sports E-commerce Entrepreneurship Market Analysis Project Management Segmentation Multi-channel Marketing Start-ups Sports Management Management B2B Marketing Sponsorship Sales SEO Online Marketing Brand Awareness Partnership Marketing Product Development Thought Leadership Event Planning Sponsorship Activation Lead Generation Social Networking Media Planning Web Analytics See 28+     See less Integrated Marketing Strategic Partnerships Media Relations Analytics Email Marketing Business Strategy Product Management Strategy Corporate Communications Content Strategy Database Marketing CRM Return on Investment Cross-functional Team... Marketing Communications Marketing Marketing Strategy Leadership Brand Development Sports E-commerce Entrepreneurship Market Analysis Project Management Segmentation Multi-channel Marketing Start-ups Sports Management Management B2B Marketing Sponsorship Sales SEO Online Marketing Brand Awareness Partnership Marketing Product Development Thought Leadership Event Planning Sponsorship Activation Lead Generation Social Networking Media Planning Web Analytics See 28+     See less Honors & Awards WISE Woman of the Year WISE June 2011 Recognition as one of the leading women in the sports and events industry 2012 Sports Business Journal League of the Year Sports Business Journal May 2013 Selected as the recipient of outstanding revenue and marketing success by industry  Game Changer ProMax BDA October 2012 Honored by Industry as a Game Changer in Sports Comunications  Game Changer 2012 Advertising Women of New York April 2012 One of Four women honored at the 2012 AWNY Awards as Game Changers in their respective industries WISE Woman of the Year WISE June 2011 Recognition as one of the leading women in the sports and events industry WISE Woman of the Year WISE June 2011 Recognition as one of the leading women in the sports and events industry WISE Woman of the Year WISE June 2011 Recognition as one of the leading women in the sports and events industry 2012 Sports Business Journal League of the Year Sports Business Journal May 2013 Selected as the recipient of outstanding revenue and marketing success by industry  2012 Sports Business Journal League of the Year Sports Business Journal May 2013 Selected as the recipient of outstanding revenue and marketing success by industry  2012 Sports Business Journal League of the Year Sports Business Journal May 2013 Selected as the recipient of outstanding revenue and marketing success by industry  Game Changer ProMax BDA October 2012 Honored by Industry as a Game Changer in Sports Comunications  Game Changer ProMax BDA October 2012 Honored by Industry as a Game Changer in Sports Comunications  Game Changer ProMax BDA October 2012 Honored by Industry as a Game Changer in Sports Comunications  Game Changer 2012 Advertising Women of New York April 2012 One of Four women honored at the 2012 AWNY Awards as Game Changers in their respective industries Game Changer 2012 Advertising Women of New York April 2012 One of Four women honored at the 2012 AWNY Awards as Game Changers in their respective industries Game Changer 2012 Advertising Women of New York April 2012 One of Four women honored at the 2012 AWNY Awards as Game Changers in their respective industries ", "Languages English English English Skills Sales Management Contract Negotiation Solution Selling Account Management Outsourcing Strategy Marketing Strategy Business Strategy Enterprise Software IT Outsourcing Pre-sales Cloud Computing Program Management Team Leadership Marketing Management Management IT Service Management CRM See 3+     See less Skills  Sales Management Contract Negotiation Solution Selling Account Management Outsourcing Strategy Marketing Strategy Business Strategy Enterprise Software IT Outsourcing Pre-sales Cloud Computing Program Management Team Leadership Marketing Management Management IT Service Management CRM See 3+     See less Sales Management Contract Negotiation Solution Selling Account Management Outsourcing Strategy Marketing Strategy Business Strategy Enterprise Software IT Outsourcing Pre-sales Cloud Computing Program Management Team Leadership Marketing Management Management IT Service Management CRM See 3+     See less Sales Management Contract Negotiation Solution Selling Account Management Outsourcing Strategy Marketing Strategy Business Strategy Enterprise Software IT Outsourcing Pre-sales Cloud Computing Program Management Team Leadership Marketing Management Management IT Service Management CRM See 3+     See less ", "Summary Results-driven marketing and communications executive with more than 20 years of experience developing and executing strategic marketing and communications plans that exceed targets. Proven leader who gains support of cross-functional teams, develops partnerships, and builds quality relationships with a shared sense of purpose.  \n \nStrengths:  \n• Marketing Strategy  \n•\tB2B  \n•\tDigital/Social Media \n•\tValue Propositions/Messaging \n•\tBranding \n•\tAccount-Based Marketing \n•\tIntegrated Marketing Campaigns \n•\tMetrics-Based Performance \n•\tPipeline Analysis and Action Plans  \n•\tIndustry and Role-Based Marketing \n•\tInternal and Corporate Communications \n•\tMedia and Analyst Relations \n•\tSales Enablement \n•\tThought Leadership Deployment \n•\tBusiness Partner Marketing  \n•\tAgency Management Summary Results-driven marketing and communications executive with more than 20 years of experience developing and executing strategic marketing and communications plans that exceed targets. Proven leader who gains support of cross-functional teams, develops partnerships, and builds quality relationships with a shared sense of purpose.  \n \nStrengths:  \n• Marketing Strategy  \n•\tB2B  \n•\tDigital/Social Media \n•\tValue Propositions/Messaging \n•\tBranding \n•\tAccount-Based Marketing \n•\tIntegrated Marketing Campaigns \n•\tMetrics-Based Performance \n•\tPipeline Analysis and Action Plans  \n•\tIndustry and Role-Based Marketing \n•\tInternal and Corporate Communications \n•\tMedia and Analyst Relations \n•\tSales Enablement \n•\tThought Leadership Deployment \n•\tBusiness Partner Marketing  \n•\tAgency Management Results-driven marketing and communications executive with more than 20 years of experience developing and executing strategic marketing and communications plans that exceed targets. Proven leader who gains support of cross-functional teams, develops partnerships, and builds quality relationships with a shared sense of purpose.  \n \nStrengths:  \n• Marketing Strategy  \n•\tB2B  \n•\tDigital/Social Media \n•\tValue Propositions/Messaging \n•\tBranding \n•\tAccount-Based Marketing \n•\tIntegrated Marketing Campaigns \n•\tMetrics-Based Performance \n•\tPipeline Analysis and Action Plans  \n•\tIndustry and Role-Based Marketing \n•\tInternal and Corporate Communications \n•\tMedia and Analyst Relations \n•\tSales Enablement \n•\tThought Leadership Deployment \n•\tBusiness Partner Marketing  \n•\tAgency Management Results-driven marketing and communications executive with more than 20 years of experience developing and executing strategic marketing and communications plans that exceed targets. Proven leader who gains support of cross-functional teams, develops partnerships, and builds quality relationships with a shared sense of purpose.  \n \nStrengths:  \n• Marketing Strategy  \n•\tB2B  \n•\tDigital/Social Media \n•\tValue Propositions/Messaging \n•\tBranding \n•\tAccount-Based Marketing \n•\tIntegrated Marketing Campaigns \n•\tMetrics-Based Performance \n•\tPipeline Analysis and Action Plans  \n•\tIndustry and Role-Based Marketing \n•\tInternal and Corporate Communications \n•\tMedia and Analyst Relations \n•\tSales Enablement \n•\tThought Leadership Deployment \n•\tBusiness Partner Marketing  \n•\tAgency Management Experience Executive Director, North America Marketing NGA Human Resources May 2014  – Present (1 year 4 months) Tulsa, Oklahoma Area Director, Global Distribution Sector Marketing and Communications IBM August 2013  –  May 2014  (10 months) Tulsa, Oklahoma Area Director, Global Alliances Marketing and Communications IBM January 2013  –  August 2013  (8 months) Director, Business Partner and Midmarket Marketing IBM January 2013  –  July 2013  (7 months) Industry Demand Programs Leader, NA IBM April 2009  –  August 2011  (2 years 5 months) Industry Marketing Leader IBM Global Business Services February 2005  –  April 2009  (4 years 3 months) Global/Americas Marketing Manager Financial Management/Business Intelligence Practices IBM Business Consulting Services (Previously PwC Consulting) October 2000  –  February 2005  (4 years 5 months) Associate Director, Global Marketing PricewaterhouseCoopers Global Data Warehousing and iAnalytics Practices July 1999  –  October 2000  (1 year 4 months) Public Relations and Marketing Manager PricewaterhouseCoopers Solutions Thru Technology Practice July 1997  –  July 1999  (2 years 1 month) Public Relations Program Manager US Robotics/3Com July 1996  –  July 1997  (1 year 1 month) Marketing & Public Relations Manager Coriolis Group Books/PC Techniques Magazine September 1993  –  June 1996  (2 years 10 months) Executive Director, North America Marketing NGA Human Resources May 2014  – Present (1 year 4 months) Tulsa, Oklahoma Area Executive Director, North America Marketing NGA Human Resources May 2014  – Present (1 year 4 months) Tulsa, Oklahoma Area Director, Global Distribution Sector Marketing and Communications IBM August 2013  –  May 2014  (10 months) Tulsa, Oklahoma Area Director, Global Distribution Sector Marketing and Communications IBM August 2013  –  May 2014  (10 months) Tulsa, Oklahoma Area Director, Global Alliances Marketing and Communications IBM January 2013  –  August 2013  (8 months) Director, Global Alliances Marketing and Communications IBM January 2013  –  August 2013  (8 months) Director, Business Partner and Midmarket Marketing IBM January 2013  –  July 2013  (7 months) Director, Business Partner and Midmarket Marketing IBM January 2013  –  July 2013  (7 months) Industry Demand Programs Leader, NA IBM April 2009  –  August 2011  (2 years 5 months) Industry Demand Programs Leader, NA IBM April 2009  –  August 2011  (2 years 5 months) Industry Marketing Leader IBM Global Business Services February 2005  –  April 2009  (4 years 3 months) Industry Marketing Leader IBM Global Business Services February 2005  –  April 2009  (4 years 3 months) Global/Americas Marketing Manager Financial Management/Business Intelligence Practices IBM Business Consulting Services (Previously PwC Consulting) October 2000  –  February 2005  (4 years 5 months) Global/Americas Marketing Manager Financial Management/Business Intelligence Practices IBM Business Consulting Services (Previously PwC Consulting) October 2000  –  February 2005  (4 years 5 months) Associate Director, Global Marketing PricewaterhouseCoopers Global Data Warehousing and iAnalytics Practices July 1999  –  October 2000  (1 year 4 months) Associate Director, Global Marketing PricewaterhouseCoopers Global Data Warehousing and iAnalytics Practices July 1999  –  October 2000  (1 year 4 months) Public Relations and Marketing Manager PricewaterhouseCoopers Solutions Thru Technology Practice July 1997  –  July 1999  (2 years 1 month) Public Relations and Marketing Manager PricewaterhouseCoopers Solutions Thru Technology Practice July 1997  –  July 1999  (2 years 1 month) Public Relations Program Manager US Robotics/3Com July 1996  –  July 1997  (1 year 1 month) Public Relations Program Manager US Robotics/3Com July 1996  –  July 1997  (1 year 1 month) Marketing & Public Relations Manager Coriolis Group Books/PC Techniques Magazine September 1993  –  June 1996  (2 years 10 months) Marketing & Public Relations Manager Coriolis Group Books/PC Techniques Magazine September 1993  –  June 1996  (2 years 10 months) Skills Marketing Strategy B2B Marketing Account-based Marketing Digital Marketing Social Media Marketing Corporate Branding Value Propositions Integrated Marketing... Metrics-based... Industry Marketing Role-based Marketing Strategic Communications Media and Analyst... Sales Enablement Thought Leadership... Business Partner... Agency Management Team Leadership Strategy Marketing Management Cross-functional Team... Corporate Communications B2B Marketing See 9+     See less Skills  Marketing Strategy B2B Marketing Account-based Marketing Digital Marketing Social Media Marketing Corporate Branding Value Propositions Integrated Marketing... Metrics-based... Industry Marketing Role-based Marketing Strategic Communications Media and Analyst... Sales Enablement Thought Leadership... Business Partner... Agency Management Team Leadership Strategy Marketing Management Cross-functional Team... Corporate Communications B2B Marketing See 9+     See less Marketing Strategy B2B Marketing Account-based Marketing Digital Marketing Social Media Marketing Corporate Branding Value Propositions Integrated Marketing... Metrics-based... Industry Marketing Role-based Marketing Strategic Communications Media and Analyst... Sales Enablement Thought Leadership... Business Partner... Agency Management Team Leadership Strategy Marketing Management Cross-functional Team... Corporate Communications B2B Marketing See 9+     See less Marketing Strategy B2B Marketing Account-based Marketing Digital Marketing Social Media Marketing Corporate Branding Value Propositions Integrated Marketing... Metrics-based... Industry Marketing Role-based Marketing Strategic Communications Media and Analyst... Sales Enablement Thought Leadership... Business Partner... Agency Management Team Leadership Strategy Marketing Management Cross-functional Team... Corporate Communications B2B Marketing See 9+     See less Education Northern Arizona University BS,  Journalism ,  Advertising 1990  – 1993 Longview High School Longview High School Longview High School Northern Arizona University BS,  Journalism ,  Advertising 1990  – 1993 Northern Arizona University BS,  Journalism ,  Advertising 1990  – 1993 Northern Arizona University BS,  Journalism ,  Advertising 1990  – 1993 Longview High School Longview High School Longview High School Longview High School Longview High School Longview High School Longview High School Longview High School Longview High School ", "Summary Results-driven marketing and communications executive with more than 20 years of experience developing and executing strategic marketing and communications plans that exceed targets. Proven leader who gains support of cross-functional teams, develops partnerships, and builds quality relationships with a shared sense of purpose.  \n \nStrengths:  \n• Marketing Strategy  \n•\tB2B  \n•\tDigital/Social Media \n•\tValue Propositions/Messaging \n•\tBranding \n•\tAccount-Based Marketing \n•\tIntegrated Marketing Campaigns \n•\tMetrics-Based Performance \n•\tPipeline Analysis and Action Plans  \n•\tIndustry and Role-Based Marketing \n•\tInternal and Corporate Communications \n•\tMedia and Analyst Relations \n•\tSales Enablement \n•\tThought Leadership Deployment \n•\tBusiness Partner Marketing  \n•\tAgency Management Summary Results-driven marketing and communications executive with more than 20 years of experience developing and executing strategic marketing and communications plans that exceed targets. Proven leader who gains support of cross-functional teams, develops partnerships, and builds quality relationships with a shared sense of purpose.  \n \nStrengths:  \n• Marketing Strategy  \n•\tB2B  \n•\tDigital/Social Media \n•\tValue Propositions/Messaging \n•\tBranding \n•\tAccount-Based Marketing \n•\tIntegrated Marketing Campaigns \n•\tMetrics-Based Performance \n•\tPipeline Analysis and Action Plans  \n•\tIndustry and Role-Based Marketing \n•\tInternal and Corporate Communications \n•\tMedia and Analyst Relations \n•\tSales Enablement \n•\tThought Leadership Deployment \n•\tBusiness Partner Marketing  \n•\tAgency Management Results-driven marketing and communications executive with more than 20 years of experience developing and executing strategic marketing and communications plans that exceed targets. Proven leader who gains support of cross-functional teams, develops partnerships, and builds quality relationships with a shared sense of purpose.  \n \nStrengths:  \n• Marketing Strategy  \n•\tB2B  \n•\tDigital/Social Media \n•\tValue Propositions/Messaging \n•\tBranding \n•\tAccount-Based Marketing \n•\tIntegrated Marketing Campaigns \n•\tMetrics-Based Performance \n•\tPipeline Analysis and Action Plans  \n•\tIndustry and Role-Based Marketing \n•\tInternal and Corporate Communications \n•\tMedia and Analyst Relations \n•\tSales Enablement \n•\tThought Leadership Deployment \n•\tBusiness Partner Marketing  \n•\tAgency Management Results-driven marketing and communications executive with more than 20 years of experience developing and executing strategic marketing and communications plans that exceed targets. Proven leader who gains support of cross-functional teams, develops partnerships, and builds quality relationships with a shared sense of purpose.  \n \nStrengths:  \n• Marketing Strategy  \n•\tB2B  \n•\tDigital/Social Media \n•\tValue Propositions/Messaging \n•\tBranding \n•\tAccount-Based Marketing \n•\tIntegrated Marketing Campaigns \n•\tMetrics-Based Performance \n•\tPipeline Analysis and Action Plans  \n•\tIndustry and Role-Based Marketing \n•\tInternal and Corporate Communications \n•\tMedia and Analyst Relations \n•\tSales Enablement \n•\tThought Leadership Deployment \n•\tBusiness Partner Marketing  \n•\tAgency Management Experience Executive Director, North America Marketing NGA Human Resources May 2014  – Present (1 year 4 months) Tulsa, Oklahoma Area Director, Global Distribution Sector Marketing and Communications IBM August 2013  –  May 2014  (10 months) Tulsa, Oklahoma Area Director, Global Alliances Marketing and Communications IBM January 2013  –  August 2013  (8 months) Director, Business Partner and Midmarket Marketing IBM January 2013  –  July 2013  (7 months) Industry Demand Programs Leader, NA IBM April 2009  –  August 2011  (2 years 5 months) Industry Marketing Leader IBM Global Business Services February 2005  –  April 2009  (4 years 3 months) Global/Americas Marketing Manager Financial Management/Business Intelligence Practices IBM Business Consulting Services (Previously PwC Consulting) October 2000  –  February 2005  (4 years 5 months) Associate Director, Global Marketing PricewaterhouseCoopers Global Data Warehousing and iAnalytics Practices July 1999  –  October 2000  (1 year 4 months) Public Relations and Marketing Manager PricewaterhouseCoopers Solutions Thru Technology Practice July 1997  –  July 1999  (2 years 1 month) Public Relations Program Manager US Robotics/3Com July 1996  –  July 1997  (1 year 1 month) Marketing & Public Relations Manager Coriolis Group Books/PC Techniques Magazine September 1993  –  June 1996  (2 years 10 months) Executive Director, North America Marketing NGA Human Resources May 2014  – Present (1 year 4 months) Tulsa, Oklahoma Area Executive Director, North America Marketing NGA Human Resources May 2014  – Present (1 year 4 months) Tulsa, Oklahoma Area Director, Global Distribution Sector Marketing and Communications IBM August 2013  –  May 2014  (10 months) Tulsa, Oklahoma Area Director, Global Distribution Sector Marketing and Communications IBM August 2013  –  May 2014  (10 months) Tulsa, Oklahoma Area Director, Global Alliances Marketing and Communications IBM January 2013  –  August 2013  (8 months) Director, Global Alliances Marketing and Communications IBM January 2013  –  August 2013  (8 months) Director, Business Partner and Midmarket Marketing IBM January 2013  –  July 2013  (7 months) Director, Business Partner and Midmarket Marketing IBM January 2013  –  July 2013  (7 months) Industry Demand Programs Leader, NA IBM April 2009  –  August 2011  (2 years 5 months) Industry Demand Programs Leader, NA IBM April 2009  –  August 2011  (2 years 5 months) Industry Marketing Leader IBM Global Business Services February 2005  –  April 2009  (4 years 3 months) Industry Marketing Leader IBM Global Business Services February 2005  –  April 2009  (4 years 3 months) Global/Americas Marketing Manager Financial Management/Business Intelligence Practices IBM Business Consulting Services (Previously PwC Consulting) October 2000  –  February 2005  (4 years 5 months) Global/Americas Marketing Manager Financial Management/Business Intelligence Practices IBM Business Consulting Services (Previously PwC Consulting) October 2000  –  February 2005  (4 years 5 months) Associate Director, Global Marketing PricewaterhouseCoopers Global Data Warehousing and iAnalytics Practices July 1999  –  October 2000  (1 year 4 months) Associate Director, Global Marketing PricewaterhouseCoopers Global Data Warehousing and iAnalytics Practices July 1999  –  October 2000  (1 year 4 months) Public Relations and Marketing Manager PricewaterhouseCoopers Solutions Thru Technology Practice July 1997  –  July 1999  (2 years 1 month) Public Relations and Marketing Manager PricewaterhouseCoopers Solutions Thru Technology Practice July 1997  –  July 1999  (2 years 1 month) Public Relations Program Manager US Robotics/3Com July 1996  –  July 1997  (1 year 1 month) Public Relations Program Manager US Robotics/3Com July 1996  –  July 1997  (1 year 1 month) Marketing & Public Relations Manager Coriolis Group Books/PC Techniques Magazine September 1993  –  June 1996  (2 years 10 months) Marketing & Public Relations Manager Coriolis Group Books/PC Techniques Magazine September 1993  –  June 1996  (2 years 10 months) Skills Marketing Strategy B2B Marketing Account-based Marketing Digital Marketing Social Media Marketing Corporate Branding Value Propositions Integrated Marketing... Metrics-based... Industry Marketing Role-based Marketing Strategic Communications Media and Analyst... Sales Enablement Thought Leadership... Business Partner... Agency Management Team Leadership Strategy Marketing Management Cross-functional Team... Corporate Communications B2B Marketing See 9+     See less Skills  Marketing Strategy B2B Marketing Account-based Marketing Digital Marketing Social Media Marketing Corporate Branding Value Propositions Integrated Marketing... Metrics-based... Industry Marketing Role-based Marketing Strategic Communications Media and Analyst... Sales Enablement Thought Leadership... Business Partner... Agency Management Team Leadership Strategy Marketing Management Cross-functional Team... Corporate Communications B2B Marketing See 9+     See less Marketing Strategy B2B Marketing Account-based Marketing Digital Marketing Social Media Marketing Corporate Branding Value Propositions Integrated Marketing... Metrics-based... Industry Marketing Role-based Marketing Strategic Communications Media and Analyst... Sales Enablement Thought Leadership... Business Partner... Agency Management Team Leadership Strategy Marketing Management Cross-functional Team... Corporate Communications B2B Marketing See 9+     See less Marketing Strategy B2B Marketing Account-based Marketing Digital Marketing Social Media Marketing Corporate Branding Value Propositions Integrated Marketing... Metrics-based... Industry Marketing Role-based Marketing Strategic Communications Media and Analyst... Sales Enablement Thought Leadership... Business Partner... Agency Management Team Leadership Strategy Marketing Management Cross-functional Team... Corporate Communications B2B Marketing See 9+     See less Education Northern Arizona University BS,  Journalism ,  Advertising 1990  – 1993 Longview High School Longview High School Longview High School Northern Arizona University BS,  Journalism ,  Advertising 1990  – 1993 Northern Arizona University BS,  Journalism ,  Advertising 1990  – 1993 Northern Arizona University BS,  Journalism ,  Advertising 1990  – 1993 Longview High School Longview High School Longview High School Longview High School Longview High School Longview High School Longview High School Longview High School Longview High School ", "Summary Malcolm Gladwell would say that I invested my most recent 10,000 hours for expertise in “IBM.” While this doesn’t always translate to the outside world, it essentially means that I’ve been asked to take on such a wide variety of challenges in my eight years here that I know just enough about most things to be dangerous. But whether it was cities, semiconductors, or CFOs, I’ve always looked at each new challenge through the lens of an entrepreneur. I put my business development and management consulting skills to work, adding the creativity and imagination to envision the possible, and then the leadership to get everyone together to make something from nothing. The result is first-of-a-kind programs, new businesses, licensing revenue, effective strategies, new insights from analytics, cultural change, publications, and even a patent. \n \nWho is Justin Cook? Some call me a “want-to-be academic,” a claim largely supported by the evidence. I enjoy things like analytics competitions and I liked business school so much I essentially went twice. The first time was for a B.S. at Wharton and then I went back again many years later for an MBA at MIT Sloan. I’ve given talks at conferences and to graduate students in auditoriums at USC, Carnegie Mellon, and The Tokyo Institute of Technology. However I didn’t “want-to-be” an academic enough as I turned down PhD program acceptances at Yale and Columbia in favor of working in the exciting world known as the technology industry. Summary Malcolm Gladwell would say that I invested my most recent 10,000 hours for expertise in “IBM.” While this doesn’t always translate to the outside world, it essentially means that I’ve been asked to take on such a wide variety of challenges in my eight years here that I know just enough about most things to be dangerous. But whether it was cities, semiconductors, or CFOs, I’ve always looked at each new challenge through the lens of an entrepreneur. I put my business development and management consulting skills to work, adding the creativity and imagination to envision the possible, and then the leadership to get everyone together to make something from nothing. The result is first-of-a-kind programs, new businesses, licensing revenue, effective strategies, new insights from analytics, cultural change, publications, and even a patent. \n \nWho is Justin Cook? Some call me a “want-to-be academic,” a claim largely supported by the evidence. I enjoy things like analytics competitions and I liked business school so much I essentially went twice. The first time was for a B.S. at Wharton and then I went back again many years later for an MBA at MIT Sloan. I’ve given talks at conferences and to graduate students in auditoriums at USC, Carnegie Mellon, and The Tokyo Institute of Technology. However I didn’t “want-to-be” an academic enough as I turned down PhD program acceptances at Yale and Columbia in favor of working in the exciting world known as the technology industry. Malcolm Gladwell would say that I invested my most recent 10,000 hours for expertise in “IBM.” While this doesn’t always translate to the outside world, it essentially means that I’ve been asked to take on such a wide variety of challenges in my eight years here that I know just enough about most things to be dangerous. But whether it was cities, semiconductors, or CFOs, I’ve always looked at each new challenge through the lens of an entrepreneur. I put my business development and management consulting skills to work, adding the creativity and imagination to envision the possible, and then the leadership to get everyone together to make something from nothing. The result is first-of-a-kind programs, new businesses, licensing revenue, effective strategies, new insights from analytics, cultural change, publications, and even a patent. \n \nWho is Justin Cook? Some call me a “want-to-be academic,” a claim largely supported by the evidence. I enjoy things like analytics competitions and I liked business school so much I essentially went twice. The first time was for a B.S. at Wharton and then I went back again many years later for an MBA at MIT Sloan. I’ve given talks at conferences and to graduate students in auditoriums at USC, Carnegie Mellon, and The Tokyo Institute of Technology. However I didn’t “want-to-be” an academic enough as I turned down PhD program acceptances at Yale and Columbia in favor of working in the exciting world known as the technology industry. Malcolm Gladwell would say that I invested my most recent 10,000 hours for expertise in “IBM.” While this doesn’t always translate to the outside world, it essentially means that I’ve been asked to take on such a wide variety of challenges in my eight years here that I know just enough about most things to be dangerous. But whether it was cities, semiconductors, or CFOs, I’ve always looked at each new challenge through the lens of an entrepreneur. I put my business development and management consulting skills to work, adding the creativity and imagination to envision the possible, and then the leadership to get everyone together to make something from nothing. The result is first-of-a-kind programs, new businesses, licensing revenue, effective strategies, new insights from analytics, cultural change, publications, and even a patent. \n \nWho is Justin Cook? Some call me a “want-to-be academic,” a claim largely supported by the evidence. I enjoy things like analytics competitions and I liked business school so much I essentially went twice. The first time was for a B.S. at Wharton and then I went back again many years later for an MBA at MIT Sloan. I’ve given talks at conferences and to graduate students in auditoriums at USC, Carnegie Mellon, and The Tokyo Institute of Technology. However I didn’t “want-to-be” an academic enough as I turned down PhD program acceptances at Yale and Columbia in favor of working in the exciting world known as the technology industry. Experience Director, Corporate Marketing and Communications IBM May 2015  – Present (4 months) Director, Corporate Marketing and Communications IBM May 2015  – Present (4 months) Director, Corporate Marketing and Communications IBM May 2015  – Present (4 months) Languages   Skills Skills     Education Massachusetts Institute of Technology - Sloan School of Management MBA,  Marketing , New Product and Venture Development , GPA 5.0/5.0 2003  – 2005 Co-President, MIT Innovation Club; Director, MarketLab; Vice-President, Sloan Marketing Club; Board of Governors, Muddy Charles Graduate Student Pub University of Pennsylvania - The Wharton School B.S.,  Entrepreneurial Management 1992  – 1996 Worked at the Sol C. Snider Entrepreneurship Center all four years of college; Contributed mini-cases and analysis to MacMillan and McGrath Harvard Business Review articles “Discovery Driven Planning” and “Discover Your Product’s Hidden Potential” Massachusetts Institute of Technology - Sloan School of Management MBA,  Marketing , New Product and Venture Development , GPA 5.0/5.0 2003  – 2005 Co-President, MIT Innovation Club; Director, MarketLab; Vice-President, Sloan Marketing Club; Board of Governors, Muddy Charles Graduate Student Pub Massachusetts Institute of Technology - Sloan School of Management MBA,  Marketing , New Product and Venture Development , GPA 5.0/5.0 2003  – 2005 Co-President, MIT Innovation Club; Director, MarketLab; Vice-President, Sloan Marketing Club; Board of Governors, Muddy Charles Graduate Student Pub Massachusetts Institute of Technology - Sloan School of Management MBA,  Marketing , New Product and Venture Development , GPA 5.0/5.0 2003  – 2005 Co-President, MIT Innovation Club; Director, MarketLab; Vice-President, Sloan Marketing Club; Board of Governors, Muddy Charles Graduate Student Pub University of Pennsylvania - The Wharton School B.S.,  Entrepreneurial Management 1992  – 1996 Worked at the Sol C. Snider Entrepreneurship Center all four years of college; Contributed mini-cases and analysis to MacMillan and McGrath Harvard Business Review articles “Discovery Driven Planning” and “Discover Your Product’s Hidden Potential” University of Pennsylvania - The Wharton School B.S.,  Entrepreneurial Management 1992  – 1996 Worked at the Sol C. Snider Entrepreneurship Center all four years of college; Contributed mini-cases and analysis to MacMillan and McGrath Harvard Business Review articles “Discovery Driven Planning” and “Discover Your Product’s Hidden Potential” University of Pennsylvania - The Wharton School B.S.,  Entrepreneurial Management 1992  – 1996 Worked at the Sol C. Snider Entrepreneurship Center all four years of college; Contributed mini-cases and analysis to MacMillan and McGrath Harvard Business Review articles “Discovery Driven Planning” and “Discover Your Product’s Hidden Potential” Honors & Awards ", "Languages Spanish Spanish Spanish Skills Tivoli Websphere Channel Marketing Marketing Communications Channel Software Sales Sales Enablement Enterprise Software Cloud Computing Multi-channel Marketing Management Lead Generation Software Industry Business Alliances Demand Generation Sales Operations Marketing Business Development Strategy Go-to-market Strategy Project Management Channel Partners See 7+     See less Skills  Tivoli Websphere Channel Marketing Marketing Communications Channel Software Sales Sales Enablement Enterprise Software Cloud Computing Multi-channel Marketing Management Lead Generation Software Industry Business Alliances Demand Generation Sales Operations Marketing Business Development Strategy Go-to-market Strategy Project Management Channel Partners See 7+     See less Tivoli Websphere Channel Marketing Marketing Communications Channel Software Sales Sales Enablement Enterprise Software Cloud Computing Multi-channel Marketing Management Lead Generation Software Industry Business Alliances Demand Generation Sales Operations Marketing Business Development Strategy Go-to-market Strategy Project Management Channel Partners See 7+     See less Tivoli Websphere Channel Marketing Marketing Communications Channel Software Sales Sales Enablement Enterprise Software Cloud Computing Multi-channel Marketing Management Lead Generation Software Industry Business Alliances Demand Generation Sales Operations Marketing Business Development Strategy Go-to-market Strategy Project Management Channel Partners See 7+     See less "]}