{"position": "Marketing Program Manager", "company": "IBM", "profiles": ["Experience Marketing Program Manager IBM Marketing Program Manager IBM Marketing Program Manager IBM ", "Experience Marketing Program Manager IBM Sales Support Sequent Computer Systems 1989  –  2000  (11 years) Marketing Program Manager IBM Marketing Program Manager IBM Sales Support Sequent Computer Systems 1989  –  2000  (11 years) Sales Support Sequent Computer Systems 1989  –  2000  (11 years) Skills Demand Generation Lead Generation Multi-channel Marketing Sales Enablement Enterprise Software Cloud Computing Go-to-market Strategy Business Alliances Marketing Communications Product Marketing Strategic Partnerships Partner Management B2B Marketing Marketing Management Solution Selling Skills  Demand Generation Lead Generation Multi-channel Marketing Sales Enablement Enterprise Software Cloud Computing Go-to-market Strategy Business Alliances Marketing Communications Product Marketing Strategic Partnerships Partner Management B2B Marketing Marketing Management Solution Selling Demand Generation Lead Generation Multi-channel Marketing Sales Enablement Enterprise Software Cloud Computing Go-to-market Strategy Business Alliances Marketing Communications Product Marketing Strategic Partnerships Partner Management B2B Marketing Marketing Management Solution Selling Demand Generation Lead Generation Multi-channel Marketing Sales Enablement Enterprise Software Cloud Computing Go-to-market Strategy Business Alliances Marketing Communications Product Marketing Strategic Partnerships Partner Management B2B Marketing Marketing Management Solution Selling Education Oregon State University Bachelor's Degree,  Child Development 1972  – 1976 Activities and Societies:  Alpha Chi Omega Oregon State University Bachelor's Degree,  Child Development 1972  – 1976 Activities and Societies:  Alpha Chi Omega Oregon State University Bachelor's Degree,  Child Development 1972  – 1976 Activities and Societies:  Alpha Chi Omega Oregon State University Bachelor's Degree,  Child Development 1972  – 1976 Activities and Societies:  Alpha Chi Omega ", "Summary Motivated and proactive Technology Professional with incisive analytical abilities and strong collaborative skills. Highly regarded as a leader in articulating and comparing alternative approaches to resolving complex issues. Strong communicator with proven record of accomplishment leading and motivating cross-functional teams. Consistently determined to make significant contributions in the global management space by utilizing computer systems engineering background coupled with an MBA to provide strategic and creative solutions Summary Motivated and proactive Technology Professional with incisive analytical abilities and strong collaborative skills. Highly regarded as a leader in articulating and comparing alternative approaches to resolving complex issues. Strong communicator with proven record of accomplishment leading and motivating cross-functional teams. Consistently determined to make significant contributions in the global management space by utilizing computer systems engineering background coupled with an MBA to provide strategic and creative solutions Motivated and proactive Technology Professional with incisive analytical abilities and strong collaborative skills. Highly regarded as a leader in articulating and comparing alternative approaches to resolving complex issues. Strong communicator with proven record of accomplishment leading and motivating cross-functional teams. Consistently determined to make significant contributions in the global management space by utilizing computer systems engineering background coupled with an MBA to provide strategic and creative solutions Motivated and proactive Technology Professional with incisive analytical abilities and strong collaborative skills. Highly regarded as a leader in articulating and comparing alternative approaches to resolving complex issues. Strong communicator with proven record of accomplishment leading and motivating cross-functional teams. Consistently determined to make significant contributions in the global management space by utilizing computer systems engineering background coupled with an MBA to provide strategic and creative solutions Experience World Wide Marketing Program Manager IBM October 2011  –  2013  (2 years) Greater Boston Area Direct cross-functional teams to develop content for company's vision and strategy. Support IBM Marketing Territories with content development and execution of key third party events for both demand generation and thought leadership. Manage multiple projects launches from start to finish. Sr. Software Solutions Engineer IBM July 2008  –  September 2011  (3 years 3 months) Engaged with sales team in managing and implementing deployment strategy of IBM Software for enterprise customers. Developed on-boarding material for new team members and training sessions tailored for different capability / skill building requirements. Mentored newly hired software engineers as part of on-boarding development strategy. IBM Corporate Service Corps IBM October 2010  –  November 2010  (2 months) Set the groundwork for Trade and Investment Limpopo to implement and carry out a Business Retention and Expansion Pilot program. The objectives of the project were as follows: \n \nDevelop a set of Business Retention and Expansion marketing presentations to help promote  \nthe strategy and secure buy-in from key stakeholders and partners \n \nDevelop a Business Retention and Expansion implementation plan based on a predefined  \nBusiness Retention and Expansion strategy  \n \nInvestigate potential Information Communications Technology (ICT) solutions to facilitate the  \nBusiness Retention and Expansion implementation based on business requirements Software Solutions Engineer IBM July 2004  –  July 2008  (4 years 1 month) Independently generated solutions for completion of individual and team objectives while improving time to resolution. Successfully understood and communicated technical and product knowledge through presentations and writing published documentation. World Wide Marketing Program Manager IBM October 2011  –  2013  (2 years) Greater Boston Area Direct cross-functional teams to develop content for company's vision and strategy. Support IBM Marketing Territories with content development and execution of key third party events for both demand generation and thought leadership. Manage multiple projects launches from start to finish. World Wide Marketing Program Manager IBM October 2011  –  2013  (2 years) Greater Boston Area Direct cross-functional teams to develop content for company's vision and strategy. Support IBM Marketing Territories with content development and execution of key third party events for both demand generation and thought leadership. Manage multiple projects launches from start to finish. Sr. Software Solutions Engineer IBM July 2008  –  September 2011  (3 years 3 months) Engaged with sales team in managing and implementing deployment strategy of IBM Software for enterprise customers. Developed on-boarding material for new team members and training sessions tailored for different capability / skill building requirements. Mentored newly hired software engineers as part of on-boarding development strategy. Sr. Software Solutions Engineer IBM July 2008  –  September 2011  (3 years 3 months) Engaged with sales team in managing and implementing deployment strategy of IBM Software for enterprise customers. Developed on-boarding material for new team members and training sessions tailored for different capability / skill building requirements. Mentored newly hired software engineers as part of on-boarding development strategy. IBM Corporate Service Corps IBM October 2010  –  November 2010  (2 months) Set the groundwork for Trade and Investment Limpopo to implement and carry out a Business Retention and Expansion Pilot program. The objectives of the project were as follows: \n \nDevelop a set of Business Retention and Expansion marketing presentations to help promote  \nthe strategy and secure buy-in from key stakeholders and partners \n \nDevelop a Business Retention and Expansion implementation plan based on a predefined  \nBusiness Retention and Expansion strategy  \n \nInvestigate potential Information Communications Technology (ICT) solutions to facilitate the  \nBusiness Retention and Expansion implementation based on business requirements IBM Corporate Service Corps IBM October 2010  –  November 2010  (2 months) Set the groundwork for Trade and Investment Limpopo to implement and carry out a Business Retention and Expansion Pilot program. The objectives of the project were as follows: \n \nDevelop a set of Business Retention and Expansion marketing presentations to help promote  \nthe strategy and secure buy-in from key stakeholders and partners \n \nDevelop a Business Retention and Expansion implementation plan based on a predefined  \nBusiness Retention and Expansion strategy  \n \nInvestigate potential Information Communications Technology (ICT) solutions to facilitate the  \nBusiness Retention and Expansion implementation based on business requirements Software Solutions Engineer IBM July 2004  –  July 2008  (4 years 1 month) Independently generated solutions for completion of individual and team objectives while improving time to resolution. Successfully understood and communicated technical and product knowledge through presentations and writing published documentation. Software Solutions Engineer IBM July 2004  –  July 2008  (4 years 1 month) Independently generated solutions for completion of individual and team objectives while improving time to resolution. Successfully understood and communicated technical and product knowledge through presentations and writing published documentation. Languages Portuguese Native or bilingual proficiency Spanish Professional working proficiency Cape Verdean Creole Native or bilingual proficiency French Elementary proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency Cape Verdean Creole Native or bilingual proficiency French Elementary proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency Cape Verdean Creole Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Elementary proficiency Skills Cloud Computing Lotus Connections Lotus Notes Enterprise Architecture Enterprise Software Lotus Domino Networking SMTP IT Service Management Virtualization Strategy Data Center SOA Websphere Strategic Partnerships VMware Solution Architecture Cross-functional Team... WebSphere Application... DB2 Lotus Messaging Sametime SaaS Architecture High Availability AIX Storage Project Management Leadership See 15+     See less Skills  Cloud Computing Lotus Connections Lotus Notes Enterprise Architecture Enterprise Software Lotus Domino Networking SMTP IT Service Management Virtualization Strategy Data Center SOA Websphere Strategic Partnerships VMware Solution Architecture Cross-functional Team... WebSphere Application... DB2 Lotus Messaging Sametime SaaS Architecture High Availability AIX Storage Project Management Leadership See 15+     See less Cloud Computing Lotus Connections Lotus Notes Enterprise Architecture Enterprise Software Lotus Domino Networking SMTP IT Service Management Virtualization Strategy Data Center SOA Websphere Strategic Partnerships VMware Solution Architecture Cross-functional Team... WebSphere Application... DB2 Lotus Messaging Sametime SaaS Architecture High Availability AIX Storage Project Management Leadership See 15+     See less Cloud Computing Lotus Connections Lotus Notes Enterprise Architecture Enterprise Software Lotus Domino Networking SMTP IT Service Management Virtualization Strategy Data Center SOA Websphere Strategic Partnerships VMware Solution Architecture Cross-functional Team... WebSphere Application... DB2 Lotus Messaging Sametime SaaS Architecture High Availability AIX Storage Project Management Leadership See 15+     See less Education Boston University - School of Management MBA,  Marketing and International Management 2007  – 2010 Timberland EarthKeepers Kids Project \nDeveloped a marketing proposal for a product and promotional concept introduction for Timberland's EarthKeepers Kids in UK. After choosing the country and age group that best fit the company’s goal, a strategy was constructed to market the EarthKeepers Kids product and the EarthKeepers grassroots effort in this market. \n \nBradesco Foundation – Brazil  \nDeveloped specific recommendations for selecting strategic partners for the foundation. The recommended partners aimed at facilitating and improving the foundation’s distance learning program. \n \nModern Taekwondo Center  \nDeveloped an e-Marketing plan for the company to best leverage social media and the Modern Taekwondo Center’s website to drive search engine results – both organic and paid searches. Measurements through Google analytics and social media followers showed great initial success. University of Massachusetts, Amherst BS,  Computer Systems Engineering 1999  – 2004 Boston University - School of Management MBA,  Marketing and International Management 2007  – 2010 Timberland EarthKeepers Kids Project \nDeveloped a marketing proposal for a product and promotional concept introduction for Timberland's EarthKeepers Kids in UK. After choosing the country and age group that best fit the company’s goal, a strategy was constructed to market the EarthKeepers Kids product and the EarthKeepers grassroots effort in this market. \n \nBradesco Foundation – Brazil  \nDeveloped specific recommendations for selecting strategic partners for the foundation. The recommended partners aimed at facilitating and improving the foundation’s distance learning program. \n \nModern Taekwondo Center  \nDeveloped an e-Marketing plan for the company to best leverage social media and the Modern Taekwondo Center’s website to drive search engine results – both organic and paid searches. Measurements through Google analytics and social media followers showed great initial success. Boston University - School of Management MBA,  Marketing and International Management 2007  – 2010 Timberland EarthKeepers Kids Project \nDeveloped a marketing proposal for a product and promotional concept introduction for Timberland's EarthKeepers Kids in UK. After choosing the country and age group that best fit the company’s goal, a strategy was constructed to market the EarthKeepers Kids product and the EarthKeepers grassroots effort in this market. \n \nBradesco Foundation – Brazil  \nDeveloped specific recommendations for selecting strategic partners for the foundation. The recommended partners aimed at facilitating and improving the foundation’s distance learning program. \n \nModern Taekwondo Center  \nDeveloped an e-Marketing plan for the company to best leverage social media and the Modern Taekwondo Center’s website to drive search engine results – both organic and paid searches. Measurements through Google analytics and social media followers showed great initial success. Boston University - School of Management MBA,  Marketing and International Management 2007  – 2010 Timberland EarthKeepers Kids Project \nDeveloped a marketing proposal for a product and promotional concept introduction for Timberland's EarthKeepers Kids in UK. After choosing the country and age group that best fit the company’s goal, a strategy was constructed to market the EarthKeepers Kids product and the EarthKeepers grassroots effort in this market. \n \nBradesco Foundation – Brazil  \nDeveloped specific recommendations for selecting strategic partners for the foundation. The recommended partners aimed at facilitating and improving the foundation’s distance learning program. \n \nModern Taekwondo Center  \nDeveloped an e-Marketing plan for the company to best leverage social media and the Modern Taekwondo Center’s website to drive search engine results – both organic and paid searches. Measurements through Google analytics and social media followers showed great initial success. University of Massachusetts, Amherst BS,  Computer Systems Engineering 1999  – 2004 University of Massachusetts, Amherst BS,  Computer Systems Engineering 1999  – 2004 University of Massachusetts, Amherst BS,  Computer Systems Engineering 1999  – 2004 ", "Summary Key Strenghts: proactive approach, can-do attitude, result orientation. \nSociability – developed as a result of the interaction I had with various actors (institutions, NGOs, foreign universities), in organizing various events –conferences,workshops, meetings, reunions). \nTeam work – an ability which is necessary in order to successfully fulfill any objective regarding task accomplishment. \nOrganizing skills – gained as I participated in multiple events, conferences, presentations. \nPresentation and spokesperson skills – developed during the conferences organized during the doctoral program and summer schools. \nHighly analytical – as a result of extensive experience in research ( quantitative and qualitative research). Summary Key Strenghts: proactive approach, can-do attitude, result orientation. \nSociability – developed as a result of the interaction I had with various actors (institutions, NGOs, foreign universities), in organizing various events –conferences,workshops, meetings, reunions). \nTeam work – an ability which is necessary in order to successfully fulfill any objective regarding task accomplishment. \nOrganizing skills – gained as I participated in multiple events, conferences, presentations. \nPresentation and spokesperson skills – developed during the conferences organized during the doctoral program and summer schools. \nHighly analytical – as a result of extensive experience in research ( quantitative and qualitative research). Key Strenghts: proactive approach, can-do attitude, result orientation. \nSociability – developed as a result of the interaction I had with various actors (institutions, NGOs, foreign universities), in organizing various events –conferences,workshops, meetings, reunions). \nTeam work – an ability which is necessary in order to successfully fulfill any objective regarding task accomplishment. \nOrganizing skills – gained as I participated in multiple events, conferences, presentations. \nPresentation and spokesperson skills – developed during the conferences organized during the doctoral program and summer schools. \nHighly analytical – as a result of extensive experience in research ( quantitative and qualitative research). Key Strenghts: proactive approach, can-do attitude, result orientation. \nSociability – developed as a result of the interaction I had with various actors (institutions, NGOs, foreign universities), in organizing various events –conferences,workshops, meetings, reunions). \nTeam work – an ability which is necessary in order to successfully fulfill any objective regarding task accomplishment. \nOrganizing skills – gained as I participated in multiple events, conferences, presentations. \nPresentation and spokesperson skills – developed during the conferences organized during the doctoral program and summer schools. \nHighly analytical – as a result of extensive experience in research ( quantitative and qualitative research). Experience Market Segment Management - SW Co-Marketing Program Manager IBM October 2012  – Present (2 years 11 months) Bucharest, Romania Managing co-marketing process for Belgium, Luxembourg and the Netherlands with a focus on IBM's software solutions and products.  \nWorking with Business Partners and Value Add Distributors on allocating the given co-marketing budget and uploading of marketing activities and leads correctly in the systems.  \nProvide day-to-day operational support related to Business Partners and Value Added Distributors activity pre/during and post Tactic.  \nAnalysis of Business Partner performance. Review and manage key metrics/status of Co Marketing Budget Allocation, current status of Business Partner Opportunity Identification and Co-Marketing results for the assigned territory.  \nOrganizing one to one enablement sessions for the BeNeLux BPs, guiding and advising them on the co-marketing process and specific contractual provisions. \n \n \n Associate Lecturer Universitatea OVIDIUS din Constanta October 2012  –  July 2015  (2 years 10 months) Constanta, Romania Courses and seminars in the area of Political Science with a focus on the history of totalitarian regimes, European Union studies and social science methodology.  \nAssess the work and progress of students by reference to defined criteria and provide constructive feedback to students.  \nChallenge thinking, foster debate and develop the ability of students to engage in critical discourse and rational thinking. Enterprise Support Specialist Hewlett-Packard November 2011  –  October 2012  (1 year) Bucharest, Romania Responsible to provide high quality sales support to Sales Reps in order to reduce front line sales administration burden (to allow maximum customer facing time and sales time).  \n \nMain responsibilities: to provide support services to the France sales and partners with regards to the following areas, in order to allow them more direct customer engagement opportunities: Pricing Coordination, Siebel management activities, Data quality & Sales Compensation Support. Market Research Operator – Italian Language CallCenterNet Romania July 2008  –  March 2009  (9 months) Bucharest, Romania Analyzing consumer opinions and collecting data for various companies from Italy, making contact with Italian people in order to find out their opinion and preferences regarding some current issues (politics, health care, media etc.). Referent Jo Grup SRL October 2006  –  June 2008  (1 year 9 months) Bucharest, Romania Promoting the commercial offer, special offers and marketing policy, answering clients requests, purchasing orders, taking calls, handling emails, translating technical manuals. Market Segment Management - SW Co-Marketing Program Manager IBM October 2012  – Present (2 years 11 months) Bucharest, Romania Managing co-marketing process for Belgium, Luxembourg and the Netherlands with a focus on IBM's software solutions and products.  \nWorking with Business Partners and Value Add Distributors on allocating the given co-marketing budget and uploading of marketing activities and leads correctly in the systems.  \nProvide day-to-day operational support related to Business Partners and Value Added Distributors activity pre/during and post Tactic.  \nAnalysis of Business Partner performance. Review and manage key metrics/status of Co Marketing Budget Allocation, current status of Business Partner Opportunity Identification and Co-Marketing results for the assigned territory.  \nOrganizing one to one enablement sessions for the BeNeLux BPs, guiding and advising them on the co-marketing process and specific contractual provisions. \n \n \n Market Segment Management - SW Co-Marketing Program Manager IBM October 2012  – Present (2 years 11 months) Bucharest, Romania Managing co-marketing process for Belgium, Luxembourg and the Netherlands with a focus on IBM's software solutions and products.  \nWorking with Business Partners and Value Add Distributors on allocating the given co-marketing budget and uploading of marketing activities and leads correctly in the systems.  \nProvide day-to-day operational support related to Business Partners and Value Added Distributors activity pre/during and post Tactic.  \nAnalysis of Business Partner performance. Review and manage key metrics/status of Co Marketing Budget Allocation, current status of Business Partner Opportunity Identification and Co-Marketing results for the assigned territory.  \nOrganizing one to one enablement sessions for the BeNeLux BPs, guiding and advising them on the co-marketing process and specific contractual provisions. \n \n \n Associate Lecturer Universitatea OVIDIUS din Constanta October 2012  –  July 2015  (2 years 10 months) Constanta, Romania Courses and seminars in the area of Political Science with a focus on the history of totalitarian regimes, European Union studies and social science methodology.  \nAssess the work and progress of students by reference to defined criteria and provide constructive feedback to students.  \nChallenge thinking, foster debate and develop the ability of students to engage in critical discourse and rational thinking. Associate Lecturer Universitatea OVIDIUS din Constanta October 2012  –  July 2015  (2 years 10 months) Constanta, Romania Courses and seminars in the area of Political Science with a focus on the history of totalitarian regimes, European Union studies and social science methodology.  \nAssess the work and progress of students by reference to defined criteria and provide constructive feedback to students.  \nChallenge thinking, foster debate and develop the ability of students to engage in critical discourse and rational thinking. Enterprise Support Specialist Hewlett-Packard November 2011  –  October 2012  (1 year) Bucharest, Romania Responsible to provide high quality sales support to Sales Reps in order to reduce front line sales administration burden (to allow maximum customer facing time and sales time).  \n \nMain responsibilities: to provide support services to the France sales and partners with regards to the following areas, in order to allow them more direct customer engagement opportunities: Pricing Coordination, Siebel management activities, Data quality & Sales Compensation Support. Enterprise Support Specialist Hewlett-Packard November 2011  –  October 2012  (1 year) Bucharest, Romania Responsible to provide high quality sales support to Sales Reps in order to reduce front line sales administration burden (to allow maximum customer facing time and sales time).  \n \nMain responsibilities: to provide support services to the France sales and partners with regards to the following areas, in order to allow them more direct customer engagement opportunities: Pricing Coordination, Siebel management activities, Data quality & Sales Compensation Support. Market Research Operator – Italian Language CallCenterNet Romania July 2008  –  March 2009  (9 months) Bucharest, Romania Analyzing consumer opinions and collecting data for various companies from Italy, making contact with Italian people in order to find out their opinion and preferences regarding some current issues (politics, health care, media etc.). Market Research Operator – Italian Language CallCenterNet Romania July 2008  –  March 2009  (9 months) Bucharest, Romania Analyzing consumer opinions and collecting data for various companies from Italy, making contact with Italian people in order to find out their opinion and preferences regarding some current issues (politics, health care, media etc.). Referent Jo Grup SRL October 2006  –  June 2008  (1 year 9 months) Bucharest, Romania Promoting the commercial offer, special offers and marketing policy, answering clients requests, purchasing orders, taking calls, handling emails, translating technical manuals. Referent Jo Grup SRL October 2006  –  June 2008  (1 year 9 months) Bucharest, Romania Promoting the commercial offer, special offers and marketing policy, answering clients requests, purchasing orders, taking calls, handling emails, translating technical manuals. Languages English French Professional working proficiency Italian English French Professional working proficiency Italian English French Professional working proficiency Italian Professional working proficiency Skills Writing Public Relations Teamwork Microsoft Excel Event Management PowerPoint Coaching Team Leadership Customer Service Microsoft Word Customer Satisfaction Microsoft Office Customer Experience Analysis International Relations Analytical Skills Fast-paced Social Media Result Oriented Marketing See 5+     See less Skills  Writing Public Relations Teamwork Microsoft Excel Event Management PowerPoint Coaching Team Leadership Customer Service Microsoft Word Customer Satisfaction Microsoft Office Customer Experience Analysis International Relations Analytical Skills Fast-paced Social Media Result Oriented Marketing See 5+     See less Writing Public Relations Teamwork Microsoft Excel Event Management PowerPoint Coaching Team Leadership Customer Service Microsoft Word Customer Satisfaction Microsoft Office Customer Experience Analysis International Relations Analytical Skills Fast-paced Social Media Result Oriented Marketing See 5+     See less Writing Public Relations Teamwork Microsoft Excel Event Management PowerPoint Coaching Team Leadership Customer Service Microsoft Word Customer Satisfaction Microsoft Office Customer Experience Analysis International Relations Analytical Skills Fast-paced Social Media Result Oriented Marketing See 5+     See less Education University of Bucharest PhD,  Political Science 2008  – 2011 April - July, 2011- Research stage at Universite Libre de Bruxelles, Belgium. \n University of Bucharest Master,  Political Science 2006  – 2008 October, 2007 - February, 2008 -\tErasmus mobility at University of Padua, Italy. University of Bucharest Bachelor's degree,  Political Science 2002  – 2006 University of Bucharest PhD,  Political Science 2008  – 2011 April - July, 2011- Research stage at Universite Libre de Bruxelles, Belgium. \n University of Bucharest PhD,  Political Science 2008  – 2011 April - July, 2011- Research stage at Universite Libre de Bruxelles, Belgium. \n University of Bucharest PhD,  Political Science 2008  – 2011 April - July, 2011- Research stage at Universite Libre de Bruxelles, Belgium. \n University of Bucharest Master,  Political Science 2006  – 2008 October, 2007 - February, 2008 -\tErasmus mobility at University of Padua, Italy. University of Bucharest Master,  Political Science 2006  – 2008 October, 2007 - February, 2008 -\tErasmus mobility at University of Padua, Italy. University of Bucharest Master,  Political Science 2006  – 2008 October, 2007 - February, 2008 -\tErasmus mobility at University of Padua, Italy. University of Bucharest Bachelor's degree,  Political Science 2002  – 2006 University of Bucharest Bachelor's degree,  Political Science 2002  – 2006 University of Bucharest Bachelor's degree,  Political Science 2002  – 2006 ", "Experience Global Database Marketing Program Manager IBM January 2002  – Present (13 years 8 months) Columbus, Ohio Area I direct a team of over 25 Data Analysts and Strategists located in seven countries who assist sales teams by providing highly targeted prospecting profiles. We integrate information from multiple internal and external sources to provide sales professionals a clear picture of companies where they should focus their sales activities in over 170 countries. The information sources we use to define market opportunities includes our internal sales systems, installed products databases, services history, territory assignment databases, opportunity management system, customer relationship management system, marketing activity database, web interactions, externally procured competitive install data from multiple worldwide sources and externally procured firmographics data in an effort to connect our sales teams to companies experiencing business challenges that could benefit from our extensive suite of products, services and solutions along with our vast experience of solving complex IT business problems. Prospecting profiles are created in an environment which demands the highest regard and strict adherence to country laws and internal guidelines developed to ensure the protection of Personally identifiable information (PII), Global Database Marketing Program Manager IBM January 2002  – Present (13 years 8 months) Columbus, Ohio Area I direct a team of over 25 Data Analysts and Strategists located in seven countries who assist sales teams by providing highly targeted prospecting profiles. We integrate information from multiple internal and external sources to provide sales professionals a clear picture of companies where they should focus their sales activities in over 170 countries. The information sources we use to define market opportunities includes our internal sales systems, installed products databases, services history, territory assignment databases, opportunity management system, customer relationship management system, marketing activity database, web interactions, externally procured competitive install data from multiple worldwide sources and externally procured firmographics data in an effort to connect our sales teams to companies experiencing business challenges that could benefit from our extensive suite of products, services and solutions along with our vast experience of solving complex IT business problems. Prospecting profiles are created in an environment which demands the highest regard and strict adherence to country laws and internal guidelines developed to ensure the protection of Personally identifiable information (PII), Global Database Marketing Program Manager IBM January 2002  – Present (13 years 8 months) Columbus, Ohio Area I direct a team of over 25 Data Analysts and Strategists located in seven countries who assist sales teams by providing highly targeted prospecting profiles. We integrate information from multiple internal and external sources to provide sales professionals a clear picture of companies where they should focus their sales activities in over 170 countries. The information sources we use to define market opportunities includes our internal sales systems, installed products databases, services history, territory assignment databases, opportunity management system, customer relationship management system, marketing activity database, web interactions, externally procured competitive install data from multiple worldwide sources and externally procured firmographics data in an effort to connect our sales teams to companies experiencing business challenges that could benefit from our extensive suite of products, services and solutions along with our vast experience of solving complex IT business problems. Prospecting profiles are created in an environment which demands the highest regard and strict adherence to country laws and internal guidelines developed to ensure the protection of Personally identifiable information (PII), Skills Database Marke Strategic Selling Marketing IBM Business Skills  Database Marke Strategic Selling Marketing IBM Business Database Marke Strategic Selling Marketing IBM Business Database Marke Strategic Selling Marketing IBM Business Education Antioch University McGregor Bachelor of Arts (B.A.),  Business Administration and Management , General Antioch University McGregor Bachelor of Arts (B.A.),  Business Administration and Management , General Antioch University McGregor Bachelor of Arts (B.A.),  Business Administration and Management , General Antioch University McGregor Bachelor of Arts (B.A.),  Business Administration and Management , General ", "Summary Helen Boyle Bristow, MPH is a multi-disciplined professional dedicated to improving population health and quality of life with a strong interest in outcomes research and health economics. Helen brings both a depth and breadth of knowledge from her experience in the healthcare, life sciences and information technology industries. Summary Helen Boyle Bristow, MPH is a multi-disciplined professional dedicated to improving population health and quality of life with a strong interest in outcomes research and health economics. Helen brings both a depth and breadth of knowledge from her experience in the healthcare, life sciences and information technology industries. Helen Boyle Bristow, MPH is a multi-disciplined professional dedicated to improving population health and quality of life with a strong interest in outcomes research and health economics. Helen brings both a depth and breadth of knowledge from her experience in the healthcare, life sciences and information technology industries. Helen Boyle Bristow, MPH is a multi-disciplined professional dedicated to improving population health and quality of life with a strong interest in outcomes research and health economics. Helen brings both a depth and breadth of knowledge from her experience in the healthcare, life sciences and information technology industries. Experience Project Leader - Outcomes Research Duke Clinical Research Institute January 2015  – Present (8 months) Durham, NC Dedicated to improving population health through the analysis of the quality of care, quality of life and healthcare delivery and the dissemination of that research. Associate Scientist, Global Health Research FHI360 November 2013  –  December 2014  (1 year 2 months) Durham, NC Research Analyst FHI 360 November 2011  –  October 2013  (2 years) Durham, NC Internship - Developing Pilot Program, Patient Reported Outcomes for Oncology Patients UNC Lineberger Cancer Center January 2011  –  May 2011  (5 months) Healthcare and Life Sciences Program Marketing Manager IBM 2006  –  2010  (4 years) Research Triangle Park, NC Marketing Program Manager IBM September 2004  –  July 2006  (1 year 11 months) Research Triangle Park, NC Marketing Director Organization for Tropical Studies, Duke University January 2000  –  August 2004  (4 years 8 months) Durham, NC Marketing Program Manager IBM 1996  –  2000  (4 years) Research Triangle Park, NC Project Leader - Outcomes Research Duke Clinical Research Institute January 2015  – Present (8 months) Durham, NC Dedicated to improving population health through the analysis of the quality of care, quality of life and healthcare delivery and the dissemination of that research. Project Leader - Outcomes Research Duke Clinical Research Institute January 2015  – Present (8 months) Durham, NC Dedicated to improving population health through the analysis of the quality of care, quality of life and healthcare delivery and the dissemination of that research. Associate Scientist, Global Health Research FHI360 November 2013  –  December 2014  (1 year 2 months) Durham, NC Associate Scientist, Global Health Research FHI360 November 2013  –  December 2014  (1 year 2 months) Durham, NC Research Analyst FHI 360 November 2011  –  October 2013  (2 years) Durham, NC Research Analyst FHI 360 November 2011  –  October 2013  (2 years) Durham, NC Internship - Developing Pilot Program, Patient Reported Outcomes for Oncology Patients UNC Lineberger Cancer Center January 2011  –  May 2011  (5 months) Internship - Developing Pilot Program, Patient Reported Outcomes for Oncology Patients UNC Lineberger Cancer Center January 2011  –  May 2011  (5 months) Healthcare and Life Sciences Program Marketing Manager IBM 2006  –  2010  (4 years) Research Triangle Park, NC Healthcare and Life Sciences Program Marketing Manager IBM 2006  –  2010  (4 years) Research Triangle Park, NC Marketing Program Manager IBM September 2004  –  July 2006  (1 year 11 months) Research Triangle Park, NC Marketing Program Manager IBM September 2004  –  July 2006  (1 year 11 months) Research Triangle Park, NC Marketing Director Organization for Tropical Studies, Duke University January 2000  –  August 2004  (4 years 8 months) Durham, NC Marketing Director Organization for Tropical Studies, Duke University January 2000  –  August 2004  (4 years 8 months) Durham, NC Marketing Program Manager IBM 1996  –  2000  (4 years) Research Triangle Park, NC Marketing Program Manager IBM 1996  –  2000  (4 years) Research Triangle Park, NC Skills Health care Public Health Research Analysis Program Development Data Analysis Strategic Planning Qualitative Research Social Marketing Marketing Strategy Community Preparedness... Psychosocial Support Patient Reported... Quantitative Research Healthcare Strategy Marketing Nonprofits Program Management Fundraising Epidemiology Program Evaluation SPSS Policy SAS Global Health See 11+     See less Skills  Health care Public Health Research Analysis Program Development Data Analysis Strategic Planning Qualitative Research Social Marketing Marketing Strategy Community Preparedness... Psychosocial Support Patient Reported... Quantitative Research Healthcare Strategy Marketing Nonprofits Program Management Fundraising Epidemiology Program Evaluation SPSS Policy SAS Global Health See 11+     See less Health care Public Health Research Analysis Program Development Data Analysis Strategic Planning Qualitative Research Social Marketing Marketing Strategy Community Preparedness... Psychosocial Support Patient Reported... Quantitative Research Healthcare Strategy Marketing Nonprofits Program Management Fundraising Epidemiology Program Evaluation SPSS Policy SAS Global Health See 11+     See less Health care Public Health Research Analysis Program Development Data Analysis Strategic Planning Qualitative Research Social Marketing Marketing Strategy Community Preparedness... Psychosocial Support Patient Reported... Quantitative Research Healthcare Strategy Marketing Nonprofits Program Management Fundraising Epidemiology Program Evaluation SPSS Policy SAS Global Health See 11+     See less Education Ridgefield High School Ridgefield High School University of North Carolina at Chapel Hill Masters of Public Health (MPH), Public Health Leadership,  Gillings School of Global Public Health 2008  – 2011 Activities and Societies:  University Cancer Research Fund Scholar ,  2010 and 2011 UW Professional and Continuing Education Certificate,  Health Economics and Outcomes Research 2013  – 2014 Use economic assessments for improving health care decisions that affect patients, providers, industry sectors and government agencies. \n \nPrinciples of Health Economics HECON 500 \nEconomic Evaluation in Health and Medicine HECON 520 \nPractice of Health Technology Assessment in a Global Environment HECON540 Duke University Certificate,  Non-Profit Management 2001  – 2002 Ridgefield High School Ridgefield High School Ridgefield High School Ridgefield High School Ridgefield High School Ridgefield High School University of North Carolina at Chapel Hill Masters of Public Health (MPH), Public Health Leadership,  Gillings School of Global Public Health 2008  – 2011 Activities and Societies:  University Cancer Research Fund Scholar ,  2010 and 2011 University of North Carolina at Chapel Hill Masters of Public Health (MPH), Public Health Leadership,  Gillings School of Global Public Health 2008  – 2011 Activities and Societies:  University Cancer Research Fund Scholar ,  2010 and 2011 University of North Carolina at Chapel Hill Masters of Public Health (MPH), Public Health Leadership,  Gillings School of Global Public Health 2008  – 2011 Activities and Societies:  University Cancer Research Fund Scholar ,  2010 and 2011 UW Professional and Continuing Education Certificate,  Health Economics and Outcomes Research 2013  – 2014 Use economic assessments for improving health care decisions that affect patients, providers, industry sectors and government agencies. \n \nPrinciples of Health Economics HECON 500 \nEconomic Evaluation in Health and Medicine HECON 520 \nPractice of Health Technology Assessment in a Global Environment HECON540 UW Professional and Continuing Education Certificate,  Health Economics and Outcomes Research 2013  – 2014 Use economic assessments for improving health care decisions that affect patients, providers, industry sectors and government agencies. \n \nPrinciples of Health Economics HECON 500 \nEconomic Evaluation in Health and Medicine HECON 520 \nPractice of Health Technology Assessment in a Global Environment HECON540 UW Professional and Continuing Education Certificate,  Health Economics and Outcomes Research 2013  – 2014 Use economic assessments for improving health care decisions that affect patients, providers, industry sectors and government agencies. \n \nPrinciples of Health Economics HECON 500 \nEconomic Evaluation in Health and Medicine HECON 520 \nPractice of Health Technology Assessment in a Global Environment HECON540 Duke University Certificate,  Non-Profit Management 2001  – 2002 Duke University Certificate,  Non-Profit Management 2001  – 2002 Duke University Certificate,  Non-Profit Management 2001  – 2002 ", "Summary Puru Nayak is a Global Marketing Advisor at IBM in the IBM Analytics Worldwide team with responsibilities of assisting Senior Director and Directors in planning, developing and managing quarterly guidance program framework, managing interlocks with geo leaders, managing business with Ogilvy (including retainer management, global media buy, spend analysis), and developing new management processes (WW-IOT interlock, Paid Search). \n \nPuru has around 9 years of experience in working with world’s leading technology companies (Hewlett Packard, Oracle, Microsoft, IBM) in various roles including account management, global marketing management, and product development. He has completed his MBA from York University, Toronto and B Engg. in Information Technology from India. \n \n \nSpecialties:  \n• Account Management \n• Global Marketing Leadership \n• Market Planning & Analysis \n• Budget Management \n• Integrated Marketing Campaign Management \n• Digital Marketing strategy \n• Vendor Management \n• Marketing Reports Summary Puru Nayak is a Global Marketing Advisor at IBM in the IBM Analytics Worldwide team with responsibilities of assisting Senior Director and Directors in planning, developing and managing quarterly guidance program framework, managing interlocks with geo leaders, managing business with Ogilvy (including retainer management, global media buy, spend analysis), and developing new management processes (WW-IOT interlock, Paid Search). \n \nPuru has around 9 years of experience in working with world’s leading technology companies (Hewlett Packard, Oracle, Microsoft, IBM) in various roles including account management, global marketing management, and product development. He has completed his MBA from York University, Toronto and B Engg. in Information Technology from India. \n \n \nSpecialties:  \n• Account Management \n• Global Marketing Leadership \n• Market Planning & Analysis \n• Budget Management \n• Integrated Marketing Campaign Management \n• Digital Marketing strategy \n• Vendor Management \n• Marketing Reports Puru Nayak is a Global Marketing Advisor at IBM in the IBM Analytics Worldwide team with responsibilities of assisting Senior Director and Directors in planning, developing and managing quarterly guidance program framework, managing interlocks with geo leaders, managing business with Ogilvy (including retainer management, global media buy, spend analysis), and developing new management processes (WW-IOT interlock, Paid Search). \n \nPuru has around 9 years of experience in working with world’s leading technology companies (Hewlett Packard, Oracle, Microsoft, IBM) in various roles including account management, global marketing management, and product development. He has completed his MBA from York University, Toronto and B Engg. in Information Technology from India. \n \n \nSpecialties:  \n• Account Management \n• Global Marketing Leadership \n• Market Planning & Analysis \n• Budget Management \n• Integrated Marketing Campaign Management \n• Digital Marketing strategy \n• Vendor Management \n• Marketing Reports Puru Nayak is a Global Marketing Advisor at IBM in the IBM Analytics Worldwide team with responsibilities of assisting Senior Director and Directors in planning, developing and managing quarterly guidance program framework, managing interlocks with geo leaders, managing business with Ogilvy (including retainer management, global media buy, spend analysis), and developing new management processes (WW-IOT interlock, Paid Search). \n \nPuru has around 9 years of experience in working with world’s leading technology companies (Hewlett Packard, Oracle, Microsoft, IBM) in various roles including account management, global marketing management, and product development. He has completed his MBA from York University, Toronto and B Engg. in Information Technology from India. \n \n \nSpecialties:  \n• Account Management \n• Global Marketing Leadership \n• Market Planning & Analysis \n• Budget Management \n• Integrated Marketing Campaign Management \n• Digital Marketing strategy \n• Vendor Management \n• Marketing Reports Experience Global Marketing Advisor IBM Canada June 2015  – Present (3 months) B2B Marketing / Planning, Analysis and Account Management  \n \n[ WW Marketing Advisor for IBM Analytics ] Global Marketing Program Manager IBM Canada March 2015  –  June 2015  (4 months) B2B Marketing / Planning, Analysis and Account Management  \n \n[ WW Marketing Advisor for IBM Analytics ] Global Marketing Program Manager IBM Canada Ltd. January 2014  –  March 2015  (1 year 3 months) B2B Marketing / Global Campaign Management & Marketing Leadership \n \n[ Responsible for developing scalable global demand generation strategy and executing integrated campaigns with a 7-digit annual budget for enterprise software solutions targeted to reach buyers in Sales line of business ] \n \nPrograms (World Wide): \n- IBM Sales Performance Management (SPM) - Earlier known as Varicent Software Marketing Demand Programs Manager IBM Canada Ltd. July 2013  –  January 2014  (7 months) B2B Marketing / Campaign Management \n \n[ Responsible for market planning, execution (end-to-end campaign management) and business results for three programs in Canada and Caribbean Islands, IBM Software Group ] \n \nPrograms (Canada & Caribbean): \n- IBM Rational \n- IBM ECM \n- IBM PureSystems Marketing Demand Program Professional IBM Canada Ltd. September 2012  –  July 2013  (11 months) B2B Marketing/ Campaign Management \n \n[ Accountable for business results and marketing ROI for the software group of IBM Canada with program budget responsibilities. Demand Programs Professional assisting several programs in Canada and Caribbean Islands ] \n \nPrograms (Canada & Caribbean) : \n- IBM Smarter Commerce \n- IBM Smarter Cities (including major roadshow in Caribbean Islands (5 events in 5 different country) to build awareness for Smarter Cities solutions in 1H 2013, influencing over $4M pipeline \n \nEnd-to-end responsibility of campaign management including developing marketing program strategy and quarterly plans to support revenue targets and pipeline, planning and executing GTM tactics (proprietary events, conferences, online events, telemarketing, email marketing, social media, search marketing), collaborating with cross-program teams to ensure co-ordination and timeliness of messaging, managing program budget, tracking results, campaign briefing, and managing vendor/agency relationships Marketing Manager N5R May 2011  –  April 2012  (1 year) B2B Marketing \n \n[ Responsible for developing business and leading a cross-functional team to provide marketing strategies to clients ] \n \n \nSkills: Marketing strategy, business plans, business development (proposals), project management, budget management, event management, digital marketing, SEM (Google AdWords), content creation, search engine optimization (SEO), social media marketing, email marketing, e-nurturing, digital ad campaigns, landing pages, CTA, lead management, post-campaign analysis, reporting Windows Campus Leader - Microsoft (p/t) Redwood Strategic Inc. November 2011  –  February 2012  (4 months) Selected for Microsoft Canada’s first country-wide campus program on the basis of social presence to promote Microsoft Windows features to students at York University, Toronto. CRM Consultant Oracle April 2007  –  May 2010  (3 years 2 months) Product Development \n \n[ Responsible for analyzing, designing, developing, configuring, troubleshooting, packaging, launching and supporting Oracle CRM On Demand (SaaS) application (Siebel CRM/ Cloud CRM) ] \n \n \nSkills: Business Analysis, Product Management, Agile Product Development, Siebel CRM, Siebel Tools, Siebel Essentials 7.7, CRM On Demand Application Configuration, SaaS, Enterprise application integration (EAI), Service-oriented architecture (SOA), database, data warehouse, dashboard Associate (Systems Consultant) Tata Consultancy Services October 2004  –  March 2007  (2 years 6 months) Technical Consulting \n \n[ Responsible for managing critical technical consulting assignments working in an Onsite-Offshore global delivery model for client Hewlett Packard (HP) ] \n \n \nSkills: Project management, business analysis, product management, performance tuning, benchmarking, requirement gathering, database, reporting, use cases Global Marketing Advisor IBM Canada June 2015  – Present (3 months) B2B Marketing / Planning, Analysis and Account Management  \n \n[ WW Marketing Advisor for IBM Analytics ] Global Marketing Advisor IBM Canada June 2015  – Present (3 months) B2B Marketing / Planning, Analysis and Account Management  \n \n[ WW Marketing Advisor for IBM Analytics ] Global Marketing Program Manager IBM Canada March 2015  –  June 2015  (4 months) B2B Marketing / Planning, Analysis and Account Management  \n \n[ WW Marketing Advisor for IBM Analytics ] Global Marketing Program Manager IBM Canada March 2015  –  June 2015  (4 months) B2B Marketing / Planning, Analysis and Account Management  \n \n[ WW Marketing Advisor for IBM Analytics ] Global Marketing Program Manager IBM Canada Ltd. January 2014  –  March 2015  (1 year 3 months) B2B Marketing / Global Campaign Management & Marketing Leadership \n \n[ Responsible for developing scalable global demand generation strategy and executing integrated campaigns with a 7-digit annual budget for enterprise software solutions targeted to reach buyers in Sales line of business ] \n \nPrograms (World Wide): \n- IBM Sales Performance Management (SPM) - Earlier known as Varicent Software Global Marketing Program Manager IBM Canada Ltd. January 2014  –  March 2015  (1 year 3 months) B2B Marketing / Global Campaign Management & Marketing Leadership \n \n[ Responsible for developing scalable global demand generation strategy and executing integrated campaigns with a 7-digit annual budget for enterprise software solutions targeted to reach buyers in Sales line of business ] \n \nPrograms (World Wide): \n- IBM Sales Performance Management (SPM) - Earlier known as Varicent Software Marketing Demand Programs Manager IBM Canada Ltd. July 2013  –  January 2014  (7 months) B2B Marketing / Campaign Management \n \n[ Responsible for market planning, execution (end-to-end campaign management) and business results for three programs in Canada and Caribbean Islands, IBM Software Group ] \n \nPrograms (Canada & Caribbean): \n- IBM Rational \n- IBM ECM \n- IBM PureSystems Marketing Demand Programs Manager IBM Canada Ltd. July 2013  –  January 2014  (7 months) B2B Marketing / Campaign Management \n \n[ Responsible for market planning, execution (end-to-end campaign management) and business results for three programs in Canada and Caribbean Islands, IBM Software Group ] \n \nPrograms (Canada & Caribbean): \n- IBM Rational \n- IBM ECM \n- IBM PureSystems Marketing Demand Program Professional IBM Canada Ltd. September 2012  –  July 2013  (11 months) B2B Marketing/ Campaign Management \n \n[ Accountable for business results and marketing ROI for the software group of IBM Canada with program budget responsibilities. Demand Programs Professional assisting several programs in Canada and Caribbean Islands ] \n \nPrograms (Canada & Caribbean) : \n- IBM Smarter Commerce \n- IBM Smarter Cities (including major roadshow in Caribbean Islands (5 events in 5 different country) to build awareness for Smarter Cities solutions in 1H 2013, influencing over $4M pipeline \n \nEnd-to-end responsibility of campaign management including developing marketing program strategy and quarterly plans to support revenue targets and pipeline, planning and executing GTM tactics (proprietary events, conferences, online events, telemarketing, email marketing, social media, search marketing), collaborating with cross-program teams to ensure co-ordination and timeliness of messaging, managing program budget, tracking results, campaign briefing, and managing vendor/agency relationships Marketing Demand Program Professional IBM Canada Ltd. September 2012  –  July 2013  (11 months) B2B Marketing/ Campaign Management \n \n[ Accountable for business results and marketing ROI for the software group of IBM Canada with program budget responsibilities. Demand Programs Professional assisting several programs in Canada and Caribbean Islands ] \n \nPrograms (Canada & Caribbean) : \n- IBM Smarter Commerce \n- IBM Smarter Cities (including major roadshow in Caribbean Islands (5 events in 5 different country) to build awareness for Smarter Cities solutions in 1H 2013, influencing over $4M pipeline \n \nEnd-to-end responsibility of campaign management including developing marketing program strategy and quarterly plans to support revenue targets and pipeline, planning and executing GTM tactics (proprietary events, conferences, online events, telemarketing, email marketing, social media, search marketing), collaborating with cross-program teams to ensure co-ordination and timeliness of messaging, managing program budget, tracking results, campaign briefing, and managing vendor/agency relationships Marketing Manager N5R May 2011  –  April 2012  (1 year) B2B Marketing \n \n[ Responsible for developing business and leading a cross-functional team to provide marketing strategies to clients ] \n \n \nSkills: Marketing strategy, business plans, business development (proposals), project management, budget management, event management, digital marketing, SEM (Google AdWords), content creation, search engine optimization (SEO), social media marketing, email marketing, e-nurturing, digital ad campaigns, landing pages, CTA, lead management, post-campaign analysis, reporting Marketing Manager N5R May 2011  –  April 2012  (1 year) B2B Marketing \n \n[ Responsible for developing business and leading a cross-functional team to provide marketing strategies to clients ] \n \n \nSkills: Marketing strategy, business plans, business development (proposals), project management, budget management, event management, digital marketing, SEM (Google AdWords), content creation, search engine optimization (SEO), social media marketing, email marketing, e-nurturing, digital ad campaigns, landing pages, CTA, lead management, post-campaign analysis, reporting Windows Campus Leader - Microsoft (p/t) Redwood Strategic Inc. November 2011  –  February 2012  (4 months) Selected for Microsoft Canada’s first country-wide campus program on the basis of social presence to promote Microsoft Windows features to students at York University, Toronto. Windows Campus Leader - Microsoft (p/t) Redwood Strategic Inc. November 2011  –  February 2012  (4 months) Selected for Microsoft Canada’s first country-wide campus program on the basis of social presence to promote Microsoft Windows features to students at York University, Toronto. CRM Consultant Oracle April 2007  –  May 2010  (3 years 2 months) Product Development \n \n[ Responsible for analyzing, designing, developing, configuring, troubleshooting, packaging, launching and supporting Oracle CRM On Demand (SaaS) application (Siebel CRM/ Cloud CRM) ] \n \n \nSkills: Business Analysis, Product Management, Agile Product Development, Siebel CRM, Siebel Tools, Siebel Essentials 7.7, CRM On Demand Application Configuration, SaaS, Enterprise application integration (EAI), Service-oriented architecture (SOA), database, data warehouse, dashboard CRM Consultant Oracle April 2007  –  May 2010  (3 years 2 months) Product Development \n \n[ Responsible for analyzing, designing, developing, configuring, troubleshooting, packaging, launching and supporting Oracle CRM On Demand (SaaS) application (Siebel CRM/ Cloud CRM) ] \n \n \nSkills: Business Analysis, Product Management, Agile Product Development, Siebel CRM, Siebel Tools, Siebel Essentials 7.7, CRM On Demand Application Configuration, SaaS, Enterprise application integration (EAI), Service-oriented architecture (SOA), database, data warehouse, dashboard Associate (Systems Consultant) Tata Consultancy Services October 2004  –  March 2007  (2 years 6 months) Technical Consulting \n \n[ Responsible for managing critical technical consulting assignments working in an Onsite-Offshore global delivery model for client Hewlett Packard (HP) ] \n \n \nSkills: Project management, business analysis, product management, performance tuning, benchmarking, requirement gathering, database, reporting, use cases Associate (Systems Consultant) Tata Consultancy Services October 2004  –  March 2007  (2 years 6 months) Technical Consulting \n \n[ Responsible for managing critical technical consulting assignments working in an Onsite-Offshore global delivery model for client Hewlett Packard (HP) ] \n \n \nSkills: Project management, business analysis, product management, performance tuning, benchmarking, requirement gathering, database, reporting, use cases Skills Marketing Strategy Business Strategy Team Leadership Consulting Digital Marketing Social Media Marketing Marketing Analytics Demand Generation Integrated Marketing Brand Management Lead Generation Strategy Product Management Google Adwords Project Management Analytics SEO Web Analytics Marketing Email Marketing Online Marketing SEM Market Planning Campaign Management Program Management Vendor Management Lead Management Marketing Budget... Marketing Communications Event Management Marketing Management Online Advertising Business Development See 18+     See less Skills  Marketing Strategy Business Strategy Team Leadership Consulting Digital Marketing Social Media Marketing Marketing Analytics Demand Generation Integrated Marketing Brand Management Lead Generation Strategy Product Management Google Adwords Project Management Analytics SEO Web Analytics Marketing Email Marketing Online Marketing SEM Market Planning Campaign Management Program Management Vendor Management Lead Management Marketing Budget... Marketing Communications Event Management Marketing Management Online Advertising Business Development See 18+     See less Marketing Strategy Business Strategy Team Leadership Consulting Digital Marketing Social Media Marketing Marketing Analytics Demand Generation Integrated Marketing Brand Management Lead Generation Strategy Product Management Google Adwords Project Management Analytics SEO Web Analytics Marketing Email Marketing Online Marketing SEM Market Planning Campaign Management Program Management Vendor Management Lead Management Marketing Budget... Marketing Communications Event Management Marketing Management Online Advertising Business Development See 18+     See less Marketing Strategy Business Strategy Team Leadership Consulting Digital Marketing Social Media Marketing Marketing Analytics Demand Generation Integrated Marketing Brand Management Lead Generation Strategy Product Management Google Adwords Project Management Analytics SEO Web Analytics Marketing Email Marketing Online Marketing SEM Market Planning Campaign Management Program Management Vendor Management Lead Management Marketing Budget... Marketing Communications Event Management Marketing Management Online Advertising Business Development See 18+     See less Education York University - Schulich School of Business MBA,  Marketing & Strategy 2010  – 2012 Achievements: \n \n✔ A+ (top 5%) in the 8-month strategic field study (Flagship program of Schulich MBA). Provided strategic recommendations to a master distributor of disposable food packaging products in Canada. \n✔ Brand Implementation Manager - American Marketing Association (AMA), Toronto Chapter (2011-12): Worked with Director, Strategy, Interbrand to provide brand strategy for the non-profit association. \n✔ Director - Case Competitions, Graduate Business Council (2011 - 2012): Conducted several internal and external case competitions Activities and Societies:  ✔ Executive ,  Business Technology Management Association (2011)\n✔ Member ,  Schulich Marketing Association\n✔ Canadian Marketing Association (CMA) Inbound Marketing University, HubSpot Inbound Marketing Certified Professional 2011  – 2011 Biju Patnaik University of Technology - NIST B Engg,  Information Technology 2000  – 2004 York University - Schulich School of Business MBA,  Marketing & Strategy 2010  – 2012 Achievements: \n \n✔ A+ (top 5%) in the 8-month strategic field study (Flagship program of Schulich MBA). Provided strategic recommendations to a master distributor of disposable food packaging products in Canada. \n✔ Brand Implementation Manager - American Marketing Association (AMA), Toronto Chapter (2011-12): Worked with Director, Strategy, Interbrand to provide brand strategy for the non-profit association. \n✔ Director - Case Competitions, Graduate Business Council (2011 - 2012): Conducted several internal and external case competitions Activities and Societies:  ✔ Executive ,  Business Technology Management Association (2011)\n✔ Member ,  Schulich Marketing Association\n✔ Canadian Marketing Association (CMA) York University - Schulich School of Business MBA,  Marketing & Strategy 2010  – 2012 Achievements: \n \n✔ A+ (top 5%) in the 8-month strategic field study (Flagship program of Schulich MBA). Provided strategic recommendations to a master distributor of disposable food packaging products in Canada. \n✔ Brand Implementation Manager - American Marketing Association (AMA), Toronto Chapter (2011-12): Worked with Director, Strategy, Interbrand to provide brand strategy for the non-profit association. \n✔ Director - Case Competitions, Graduate Business Council (2011 - 2012): Conducted several internal and external case competitions Activities and Societies:  ✔ Executive ,  Business Technology Management Association (2011)\n✔ Member ,  Schulich Marketing Association\n✔ Canadian Marketing Association (CMA) York University - Schulich School of Business MBA,  Marketing & Strategy 2010  – 2012 Achievements: \n \n✔ A+ (top 5%) in the 8-month strategic field study (Flagship program of Schulich MBA). Provided strategic recommendations to a master distributor of disposable food packaging products in Canada. \n✔ Brand Implementation Manager - American Marketing Association (AMA), Toronto Chapter (2011-12): Worked with Director, Strategy, Interbrand to provide brand strategy for the non-profit association. \n✔ Director - Case Competitions, Graduate Business Council (2011 - 2012): Conducted several internal and external case competitions Activities and Societies:  ✔ Executive ,  Business Technology Management Association (2011)\n✔ Member ,  Schulich Marketing Association\n✔ Canadian Marketing Association (CMA) Inbound Marketing University, HubSpot Inbound Marketing Certified Professional 2011  – 2011 Inbound Marketing University, HubSpot Inbound Marketing Certified Professional 2011  – 2011 Inbound Marketing University, HubSpot Inbound Marketing Certified Professional 2011  – 2011 Biju Patnaik University of Technology - NIST B Engg,  Information Technology 2000  – 2004 Biju Patnaik University of Technology - NIST B Engg,  Information Technology 2000  – 2004 Biju Patnaik University of Technology - NIST B Engg,  Information Technology 2000  – 2004 Honors & Awards IBM Manager's Choice Award 2014 - Manager’s Choice Award for the IBM practice Unite to Get it Done Now. IBM Manager's Choice Award 2015 - Manager’s Choice Award for the IBM practice Unite to Get it Done Now.  \n \nFor managing the delivery of the 2015 Q2/Q3 IBM Analytics Program Guidance to the IMTs in a timely fashion Additional Honors & Awards ACADEMIC ACHIEVEMENTS :-  \n \n- A+ (top 5%) in the 8-month strategic field study (Flagship program of Schulich MBA) \n- Distinction w/ Honors in B.Engg \n- National Scholarship Awardee for academic performance in High-School. IBM Manager's Choice Award 2014 - Manager’s Choice Award for the IBM practice Unite to Get it Done Now. IBM Manager's Choice Award 2014 - Manager’s Choice Award for the IBM practice Unite to Get it Done Now. IBM Manager's Choice Award 2014 - Manager’s Choice Award for the IBM practice Unite to Get it Done Now. IBM Manager's Choice Award 2015 - Manager’s Choice Award for the IBM practice Unite to Get it Done Now.  \n \nFor managing the delivery of the 2015 Q2/Q3 IBM Analytics Program Guidance to the IMTs in a timely fashion IBM Manager's Choice Award 2015 - Manager’s Choice Award for the IBM practice Unite to Get it Done Now.  \n \nFor managing the delivery of the 2015 Q2/Q3 IBM Analytics Program Guidance to the IMTs in a timely fashion IBM Manager's Choice Award 2015 - Manager’s Choice Award for the IBM practice Unite to Get it Done Now.  \n \nFor managing the delivery of the 2015 Q2/Q3 IBM Analytics Program Guidance to the IMTs in a timely fashion Additional Honors & Awards ACADEMIC ACHIEVEMENTS :-  \n \n- A+ (top 5%) in the 8-month strategic field study (Flagship program of Schulich MBA) \n- Distinction w/ Honors in B.Engg \n- National Scholarship Awardee for academic performance in High-School. Additional Honors & Awards ACADEMIC ACHIEVEMENTS :-  \n \n- A+ (top 5%) in the 8-month strategic field study (Flagship program of Schulich MBA) \n- Distinction w/ Honors in B.Engg \n- National Scholarship Awardee for academic performance in High-School. Additional Honors & Awards ACADEMIC ACHIEVEMENTS :-  \n \n- A+ (top 5%) in the 8-month strategic field study (Flagship program of Schulich MBA) \n- Distinction w/ Honors in B.Engg \n- National Scholarship Awardee for academic performance in High-School. ", "Summary Results-driven marketing professional with 15 years' experience managing demand/lead generation marketing programs within the enterprise computer software and networking industries. Well versed in developing, managing, and executing integrated marketing programs that drive revenue. Expertise in building strong alignment with sales teams. Highly detail-oriented with strong end-to-end program management skills. \n \nSpecialties:  \n- Building Alignment With Sales Teams \n- Demand/Lead Generation \n- Regional/Field Marketing \n- Marketing Program Planning and Management \n- Measuring and Reporting Results/Performance Using ROI Metrics \n- Pipeline Development \n- Event Marketing and Management \n- Alliance Marketing \n- Marketing Communications Summary Results-driven marketing professional with 15 years' experience managing demand/lead generation marketing programs within the enterprise computer software and networking industries. Well versed in developing, managing, and executing integrated marketing programs that drive revenue. Expertise in building strong alignment with sales teams. Highly detail-oriented with strong end-to-end program management skills. \n \nSpecialties:  \n- Building Alignment With Sales Teams \n- Demand/Lead Generation \n- Regional/Field Marketing \n- Marketing Program Planning and Management \n- Measuring and Reporting Results/Performance Using ROI Metrics \n- Pipeline Development \n- Event Marketing and Management \n- Alliance Marketing \n- Marketing Communications Results-driven marketing professional with 15 years' experience managing demand/lead generation marketing programs within the enterprise computer software and networking industries. Well versed in developing, managing, and executing integrated marketing programs that drive revenue. Expertise in building strong alignment with sales teams. Highly detail-oriented with strong end-to-end program management skills. \n \nSpecialties:  \n- Building Alignment With Sales Teams \n- Demand/Lead Generation \n- Regional/Field Marketing \n- Marketing Program Planning and Management \n- Measuring and Reporting Results/Performance Using ROI Metrics \n- Pipeline Development \n- Event Marketing and Management \n- Alliance Marketing \n- Marketing Communications Results-driven marketing professional with 15 years' experience managing demand/lead generation marketing programs within the enterprise computer software and networking industries. Well versed in developing, managing, and executing integrated marketing programs that drive revenue. Expertise in building strong alignment with sales teams. Highly detail-oriented with strong end-to-end program management skills. \n \nSpecialties:  \n- Building Alignment With Sales Teams \n- Demand/Lead Generation \n- Regional/Field Marketing \n- Marketing Program Planning and Management \n- Measuring and Reporting Results/Performance Using ROI Metrics \n- Pipeline Development \n- Event Marketing and Management \n- Alliance Marketing \n- Marketing Communications Experience Field Marketing Manager-East, HP Software, Enterprise Security Hewlett-Packard December 2013  – Present (1 year 9 months) Field Marketing Manager - Northeast Region Brocade April 2011  –  November 2013  (2 years 8 months) Franklin, MA (Company HQ: San Jose, CA) Primary liaison between Northeast regional sales team and corporate marketing team, ensuring strong alignment between the two organizations. Identify, develop, and implement cohesive marketing programs that drive pipeline for sales team. Collaborate cross-functionally (Channel, Investor/Analyst Relations, Product Management, Marketing Communications). Engage with external agencies/vendors and leverage internal social media to augment plans as needed.  \n- Create, manage, and execute closed loop demand/lead generation regional programs  \n- Monitor marketing program performance as well as sales pipeline; report program ROI metrics via pulls from CRM tool (Salesforce), adjusting tactics to support health of the pipeline as needed \n- Present marketing updates to sales teams via regular calls and and in person presentations \n- Manage quarterly budget, sourcing cost effective solutions to maximize investment for all programs; consistently deliver programs under budget Marketing Program Manager-IBM and Art Technology Group Art Technology Group 2008  –  2010  (2 years) Natick, MA and Cambridge, MA IBM, Marketing Manager, Natick, MA 2010 \nManaged the development and execution of customer focused programs at the global conference. Supported Industry Marketing team throughout process. \n- Executive Roundtable Program: Developed and managed registration reporting and logistics associated with customer executive program, including content creation and delivery \n- Presentation Review: Implemented process to ensure 110 session presentations were reviewed by key stakeholders, ensure each one met branding standards and delivered on time \n- Expo Floor Demo: Managed logistics and timetable to design and execute a \"day in the life\" tour via demo pods in a 1,000 square foot area \n \nArt Technology Group (ATG), Marketing Manager, Cambridge, MA 2008 \nManaged logistics for lead generation and in person customer facing events including trade shows, webcasts, and annual users' conference. Conducted vendor evaluations. Facilitated collateral production. Marketing Program Manager IBM September 2005  –  April 2007  (1 year 8 months) Westboro, MA Managed/executed go-to-market programs for software division within Information Management brand, from inception to completion. Primary liaison between West regional sales team and marketing team. Built and executed integrated marketing plans ensuring proper mix of demand generation, channel enablement, awareness, and thought leadership while aligning with business requirements. Monitored program performance and drove corrective action to address gaps as needed. \n- Exceeded 2006 lead generation response goals for executive-level roundtable events, seminars, webcasts, and direct marketing campaigns \n- Managed/reconciled quarterly budget \n- Collaborated with cross functional teams including sales, analyst relations, product management, and channel marketing to create messaging, develop presentation content, and strategize on effective promotion tactics \n- Engaged with executive level customer contacts to develop presentation content Field Marketing Manager - Central Region Mercury Interactive (acquired by HP) September 2002  –  July 2005  (2 years 11 months) Chicago, IL & Burlington, MA Developed and executed marketing programs supporting Central region sales team. Liaison between sales and corporate marketing teams; trusted advisor to sales management for implementing plans that aligned with sales revenue objectives.  \n- Directly influenced $17M of revenue over three years (18% of total regional revenue) via executive-level programs, direct marketing campaigns, seminars, trade shows, and local user group meetings \n- Measured and reported program results via correlation to sales bookings data  \n- Implemented field sales certification program for 42 field sales reps \n- Managed/reconciled annual field marketing budget Field Marketing Specialist Art Technology Group (acquired by Oracle) August 2000  –  August 2002  (2 years 1 month) Chicago, IL Implemented lead generation programs throughout Central region, collaborating with sales management to support their revenue objectives. Identified opportunities to improve internal communication toward/training for sales teams. \n- Managed logistics for seminars, direct marketing programs, trade shows, and user group meetings \n- Established company precedent: instituted and maintained first company sales portal \n- Launched and managed company's first internal e-newsletter for sales team Marketing Communications Coordinator Art Technology Group (acquired by Oracle) September 1999  –  July 2000  (11 months) Cambridge, MA Oversaw creation/execution of print and radio advertising campaigns. Executed logistics for annual users' conference and company-wide sales meetings. Managed collateral production. \n- Conducted selection process of ATG's first advertising agency of record \n- Managed creation, production, and delivery of three radio spots Marketing Associate Allen & Gerritsen 1998  –  1999  (1 year) Field Marketing Manager-East, HP Software, Enterprise Security Hewlett-Packard December 2013  – Present (1 year 9 months) Field Marketing Manager-East, HP Software, Enterprise Security Hewlett-Packard December 2013  – Present (1 year 9 months) Field Marketing Manager - Northeast Region Brocade April 2011  –  November 2013  (2 years 8 months) Franklin, MA (Company HQ: San Jose, CA) Primary liaison between Northeast regional sales team and corporate marketing team, ensuring strong alignment between the two organizations. Identify, develop, and implement cohesive marketing programs that drive pipeline for sales team. Collaborate cross-functionally (Channel, Investor/Analyst Relations, Product Management, Marketing Communications). Engage with external agencies/vendors and leverage internal social media to augment plans as needed.  \n- Create, manage, and execute closed loop demand/lead generation regional programs  \n- Monitor marketing program performance as well as sales pipeline; report program ROI metrics via pulls from CRM tool (Salesforce), adjusting tactics to support health of the pipeline as needed \n- Present marketing updates to sales teams via regular calls and and in person presentations \n- Manage quarterly budget, sourcing cost effective solutions to maximize investment for all programs; consistently deliver programs under budget Field Marketing Manager - Northeast Region Brocade April 2011  –  November 2013  (2 years 8 months) Franklin, MA (Company HQ: San Jose, CA) Primary liaison between Northeast regional sales team and corporate marketing team, ensuring strong alignment between the two organizations. Identify, develop, and implement cohesive marketing programs that drive pipeline for sales team. Collaborate cross-functionally (Channel, Investor/Analyst Relations, Product Management, Marketing Communications). Engage with external agencies/vendors and leverage internal social media to augment plans as needed.  \n- Create, manage, and execute closed loop demand/lead generation regional programs  \n- Monitor marketing program performance as well as sales pipeline; report program ROI metrics via pulls from CRM tool (Salesforce), adjusting tactics to support health of the pipeline as needed \n- Present marketing updates to sales teams via regular calls and and in person presentations \n- Manage quarterly budget, sourcing cost effective solutions to maximize investment for all programs; consistently deliver programs under budget Marketing Program Manager-IBM and Art Technology Group Art Technology Group 2008  –  2010  (2 years) Natick, MA and Cambridge, MA IBM, Marketing Manager, Natick, MA 2010 \nManaged the development and execution of customer focused programs at the global conference. Supported Industry Marketing team throughout process. \n- Executive Roundtable Program: Developed and managed registration reporting and logistics associated with customer executive program, including content creation and delivery \n- Presentation Review: Implemented process to ensure 110 session presentations were reviewed by key stakeholders, ensure each one met branding standards and delivered on time \n- Expo Floor Demo: Managed logistics and timetable to design and execute a \"day in the life\" tour via demo pods in a 1,000 square foot area \n \nArt Technology Group (ATG), Marketing Manager, Cambridge, MA 2008 \nManaged logistics for lead generation and in person customer facing events including trade shows, webcasts, and annual users' conference. Conducted vendor evaluations. Facilitated collateral production. Marketing Program Manager-IBM and Art Technology Group Art Technology Group 2008  –  2010  (2 years) Natick, MA and Cambridge, MA IBM, Marketing Manager, Natick, MA 2010 \nManaged the development and execution of customer focused programs at the global conference. Supported Industry Marketing team throughout process. \n- Executive Roundtable Program: Developed and managed registration reporting and logistics associated with customer executive program, including content creation and delivery \n- Presentation Review: Implemented process to ensure 110 session presentations were reviewed by key stakeholders, ensure each one met branding standards and delivered on time \n- Expo Floor Demo: Managed logistics and timetable to design and execute a \"day in the life\" tour via demo pods in a 1,000 square foot area \n \nArt Technology Group (ATG), Marketing Manager, Cambridge, MA 2008 \nManaged logistics for lead generation and in person customer facing events including trade shows, webcasts, and annual users' conference. Conducted vendor evaluations. Facilitated collateral production. Marketing Program Manager IBM September 2005  –  April 2007  (1 year 8 months) Westboro, MA Managed/executed go-to-market programs for software division within Information Management brand, from inception to completion. Primary liaison between West regional sales team and marketing team. Built and executed integrated marketing plans ensuring proper mix of demand generation, channel enablement, awareness, and thought leadership while aligning with business requirements. Monitored program performance and drove corrective action to address gaps as needed. \n- Exceeded 2006 lead generation response goals for executive-level roundtable events, seminars, webcasts, and direct marketing campaigns \n- Managed/reconciled quarterly budget \n- Collaborated with cross functional teams including sales, analyst relations, product management, and channel marketing to create messaging, develop presentation content, and strategize on effective promotion tactics \n- Engaged with executive level customer contacts to develop presentation content Marketing Program Manager IBM September 2005  –  April 2007  (1 year 8 months) Westboro, MA Managed/executed go-to-market programs for software division within Information Management brand, from inception to completion. Primary liaison between West regional sales team and marketing team. Built and executed integrated marketing plans ensuring proper mix of demand generation, channel enablement, awareness, and thought leadership while aligning with business requirements. Monitored program performance and drove corrective action to address gaps as needed. \n- Exceeded 2006 lead generation response goals for executive-level roundtable events, seminars, webcasts, and direct marketing campaigns \n- Managed/reconciled quarterly budget \n- Collaborated with cross functional teams including sales, analyst relations, product management, and channel marketing to create messaging, develop presentation content, and strategize on effective promotion tactics \n- Engaged with executive level customer contacts to develop presentation content Field Marketing Manager - Central Region Mercury Interactive (acquired by HP) September 2002  –  July 2005  (2 years 11 months) Chicago, IL & Burlington, MA Developed and executed marketing programs supporting Central region sales team. Liaison between sales and corporate marketing teams; trusted advisor to sales management for implementing plans that aligned with sales revenue objectives.  \n- Directly influenced $17M of revenue over three years (18% of total regional revenue) via executive-level programs, direct marketing campaigns, seminars, trade shows, and local user group meetings \n- Measured and reported program results via correlation to sales bookings data  \n- Implemented field sales certification program for 42 field sales reps \n- Managed/reconciled annual field marketing budget Field Marketing Manager - Central Region Mercury Interactive (acquired by HP) September 2002  –  July 2005  (2 years 11 months) Chicago, IL & Burlington, MA Developed and executed marketing programs supporting Central region sales team. Liaison between sales and corporate marketing teams; trusted advisor to sales management for implementing plans that aligned with sales revenue objectives.  \n- Directly influenced $17M of revenue over three years (18% of total regional revenue) via executive-level programs, direct marketing campaigns, seminars, trade shows, and local user group meetings \n- Measured and reported program results via correlation to sales bookings data  \n- Implemented field sales certification program for 42 field sales reps \n- Managed/reconciled annual field marketing budget Field Marketing Specialist Art Technology Group (acquired by Oracle) August 2000  –  August 2002  (2 years 1 month) Chicago, IL Implemented lead generation programs throughout Central region, collaborating with sales management to support their revenue objectives. Identified opportunities to improve internal communication toward/training for sales teams. \n- Managed logistics for seminars, direct marketing programs, trade shows, and user group meetings \n- Established company precedent: instituted and maintained first company sales portal \n- Launched and managed company's first internal e-newsletter for sales team Field Marketing Specialist Art Technology Group (acquired by Oracle) August 2000  –  August 2002  (2 years 1 month) Chicago, IL Implemented lead generation programs throughout Central region, collaborating with sales management to support their revenue objectives. Identified opportunities to improve internal communication toward/training for sales teams. \n- Managed logistics for seminars, direct marketing programs, trade shows, and user group meetings \n- Established company precedent: instituted and maintained first company sales portal \n- Launched and managed company's first internal e-newsletter for sales team Marketing Communications Coordinator Art Technology Group (acquired by Oracle) September 1999  –  July 2000  (11 months) Cambridge, MA Oversaw creation/execution of print and radio advertising campaigns. Executed logistics for annual users' conference and company-wide sales meetings. Managed collateral production. \n- Conducted selection process of ATG's first advertising agency of record \n- Managed creation, production, and delivery of three radio spots Marketing Communications Coordinator Art Technology Group (acquired by Oracle) September 1999  –  July 2000  (11 months) Cambridge, MA Oversaw creation/execution of print and radio advertising campaigns. Executed logistics for annual users' conference and company-wide sales meetings. Managed collateral production. \n- Conducted selection process of ATG's first advertising agency of record \n- Managed creation, production, and delivery of three radio spots Marketing Associate Allen & Gerritsen 1998  –  1999  (1 year) Marketing Associate Allen & Gerritsen 1998  –  1999  (1 year) Skills Skills     Education University of Massachusetts, Amherst Bachelor of Arts,  Communication 1992  – 1996 Coursework focus: advertising, marketing, media, public relations, and media Activities and Societies:  Alpha Epsilon Phi Louisiana State University National College Student Exchange program,  Communication 1995  – 1996 The National College Student Exchange Student program, offered through the University of Massachusetts, provided me the opportunity to experience learning in a different part of the country for two semesters during my Senior year. University of Massachusetts, Amherst Bachelor of Arts,  Communication 1992  – 1996 Coursework focus: advertising, marketing, media, public relations, and media Activities and Societies:  Alpha Epsilon Phi University of Massachusetts, Amherst Bachelor of Arts,  Communication 1992  – 1996 Coursework focus: advertising, marketing, media, public relations, and media Activities and Societies:  Alpha Epsilon Phi University of Massachusetts, Amherst Bachelor of Arts,  Communication 1992  – 1996 Coursework focus: advertising, marketing, media, public relations, and media Activities and Societies:  Alpha Epsilon Phi Louisiana State University National College Student Exchange program,  Communication 1995  – 1996 The National College Student Exchange Student program, offered through the University of Massachusetts, provided me the opportunity to experience learning in a different part of the country for two semesters during my Senior year. Louisiana State University National College Student Exchange program,  Communication 1995  – 1996 The National College Student Exchange Student program, offered through the University of Massachusetts, provided me the opportunity to experience learning in a different part of the country for two semesters during my Senior year. Louisiana State University National College Student Exchange program,  Communication 1995  – 1996 The National College Student Exchange Student program, offered through the University of Massachusetts, provided me the opportunity to experience learning in a different part of the country for two semesters during my Senior year. ", "Skills Marketing Research Competitive Intelligence Analytics Data Analysis Market Analysis Competitive Analysis Market Research Cross-functional Team... Business Analysis Segmentation Skills  Marketing Research Competitive Intelligence Analytics Data Analysis Market Analysis Competitive Analysis Market Research Cross-functional Team... Business Analysis Segmentation Marketing Research Competitive Intelligence Analytics Data Analysis Market Analysis Competitive Analysis Market Research Cross-functional Team... Business Analysis Segmentation Marketing Research Competitive Intelligence Analytics Data Analysis Market Analysis Competitive Analysis Market Research Cross-functional Team... Business Analysis Segmentation ", "Summary Senior-level marketing professional with extensive experience in demand generation campaign management, product marketing, marketing communications and sales enablement in technology and manufacturing organizations. Possess strong leadership, project management and customer/partner relationship building skills. Summary Senior-level marketing professional with extensive experience in demand generation campaign management, product marketing, marketing communications and sales enablement in technology and manufacturing organizations. Possess strong leadership, project management and customer/partner relationship building skills. Senior-level marketing professional with extensive experience in demand generation campaign management, product marketing, marketing communications and sales enablement in technology and manufacturing organizations. Possess strong leadership, project management and customer/partner relationship building skills. Senior-level marketing professional with extensive experience in demand generation campaign management, product marketing, marketing communications and sales enablement in technology and manufacturing organizations. Possess strong leadership, project management and customer/partner relationship building skills. Experience Marketing Program Manager IBM August 2010  – Present (5 years 1 month) Manager, Marketing Programs Sterling Commerce an AT&T company 2005  –  2010  (5 years) Marketing Program Manager IBM August 2010  – Present (5 years 1 month) Marketing Program Manager IBM August 2010  – Present (5 years 1 month) Manager, Marketing Programs Sterling Commerce an AT&T company 2005  –  2010  (5 years) Manager, Marketing Programs Sterling Commerce an AT&T company 2005  –  2010  (5 years) Skills Demand Generation Go-to-market Strategy Multi-channel Marketing Lead Generation Business Alliances Enterprise Software SaaS Product Marketing Partner Management Marketing Automation Channel Partners B2B Marketing Cloud Computing Solution Selling Salesforce.com CRM B2B Strategic Partnerships Product Management Marketing Communications Marketing Analytics Software Industry Competitive Analysis Marketing Management See 10+     See less Skills  Demand Generation Go-to-market Strategy Multi-channel Marketing Lead Generation Business Alliances Enterprise Software SaaS Product Marketing Partner Management Marketing Automation Channel Partners B2B Marketing Cloud Computing Solution Selling Salesforce.com CRM B2B Strategic Partnerships Product Management Marketing Communications Marketing Analytics Software Industry Competitive Analysis Marketing Management See 10+     See less Demand Generation Go-to-market Strategy Multi-channel Marketing Lead Generation Business Alliances Enterprise Software SaaS Product Marketing Partner Management Marketing Automation Channel Partners B2B Marketing Cloud Computing Solution Selling Salesforce.com CRM B2B Strategic Partnerships Product Management Marketing Communications Marketing Analytics Software Industry Competitive Analysis Marketing Management See 10+     See less Demand Generation Go-to-market Strategy Multi-channel Marketing Lead Generation Business Alliances Enterprise Software SaaS Product Marketing Partner Management Marketing Automation Channel Partners B2B Marketing Cloud Computing Solution Selling Salesforce.com CRM B2B Strategic Partnerships Product Management Marketing Communications Marketing Analytics Software Industry Competitive Analysis Marketing Management See 10+     See less Education University of Michigan Master of Business Administration (MBA),  Marketing 1985  – 1987 Michigan Technological University Bachelor of Science (B.S.),  Business Administration and Management , General 1981  – 1985 University of Michigan Master of Business Administration (MBA),  Marketing 1985  – 1987 University of Michigan Master of Business Administration (MBA),  Marketing 1985  – 1987 University of Michigan Master of Business Administration (MBA),  Marketing 1985  – 1987 Michigan Technological University Bachelor of Science (B.S.),  Business Administration and Management , General 1981  – 1985 Michigan Technological University Bachelor of Science (B.S.),  Business Administration and Management , General 1981  – 1985 Michigan Technological University Bachelor of Science (B.S.),  Business Administration and Management , General 1981  – 1985 ", "Experience channel marketing program manager ibm channel marketing program manager ibm channel marketing program manager ibm Education BSEE BSEE BSEE BSEE ", "Experience Territory Account Manager Avaya January 2012  –  April 2013  (1 year 4 months) Makati, Philippines Territory Business Manager Cisco August 2010  –  October 2011  (1 year 3 months) Small Business Market Manager Cisco October 2008  –  August 2010  (1 year 11 months) Territory Market Manager - SMB Cisco Systems May 2007  –  October 2008  (1 year 6 months) Marketing & Communications Manager Cormant Technologies July 2002  –  April 2007  (4 years 10 months) ASEAN/SA Marketing Program Manager for IBM Software - Integrated Marketing Communications IBM Philippines and IBM Singapore May 2000  –  October 2001  (1 year 6 months) Philippines and Singapore Marketing Program Manager IBM Philippines Inc. November 1996  –  April 2000  (3 years 6 months) Makati, Philippines Product Manager -Events Globe Telecom August 1995  –  October 1996  (1 year 3 months) Territory Account Manager Avaya January 2012  –  April 2013  (1 year 4 months) Makati, Philippines Territory Account Manager Avaya January 2012  –  April 2013  (1 year 4 months) Makati, Philippines Territory Business Manager Cisco August 2010  –  October 2011  (1 year 3 months) Territory Business Manager Cisco August 2010  –  October 2011  (1 year 3 months) Small Business Market Manager Cisco October 2008  –  August 2010  (1 year 11 months) Small Business Market Manager Cisco October 2008  –  August 2010  (1 year 11 months) Territory Market Manager - SMB Cisco Systems May 2007  –  October 2008  (1 year 6 months) Territory Market Manager - SMB Cisco Systems May 2007  –  October 2008  (1 year 6 months) Marketing & Communications Manager Cormant Technologies July 2002  –  April 2007  (4 years 10 months) Marketing & Communications Manager Cormant Technologies July 2002  –  April 2007  (4 years 10 months) ASEAN/SA Marketing Program Manager for IBM Software - Integrated Marketing Communications IBM Philippines and IBM Singapore May 2000  –  October 2001  (1 year 6 months) Philippines and Singapore ASEAN/SA Marketing Program Manager for IBM Software - Integrated Marketing Communications IBM Philippines and IBM Singapore May 2000  –  October 2001  (1 year 6 months) Philippines and Singapore Marketing Program Manager IBM Philippines Inc. November 1996  –  April 2000  (3 years 6 months) Makati, Philippines Marketing Program Manager IBM Philippines Inc. November 1996  –  April 2000  (3 years 6 months) Makati, Philippines Product Manager -Events Globe Telecom August 1995  –  October 1996  (1 year 3 months) Product Manager -Events Globe Telecom August 1995  –  October 1996  (1 year 3 months) Skills Skills     ", "Experience Marketing program manager IBM Marketing program manager IBM Marketing program manager IBM ", "Summary Senior Marketing Manager – Data & ROI Driven, Strategic, Analytical with Creative Flair \n“Monika is one of those few marketers who have the ability to translate marketing initiatives into driving sales.” Former Manager \n• 15 years market management experience gained in complex multinational organisations across ICT (hardware, services (outsourcing), consulting and software), IT distribution and agencies in the B2B space.  \n• Proven ability to build demand generation strategies using digital and traditional marketing channels so as to drive sales for medium to large portfolios . \n• Leadership in building a team of direct reports, leading virtual teams across departments through clarity of vision, organisation and concise and clear communication.  \n• Specific expertise in building portfolios go-to-market strategies from the ground up, to fixing portfolios that were under performing and rapidly return them to achieving target.  \n• Well-honed stakeholder management skills working locally, regionally and world-wide with VP’s, Directors, Partners and senior management and to collaborate across organisational siloes in order to achieve goals. \nCore competencies and strengths include: \n- strategic marketing plans \n- demand generation \n- leadership/staff management of direct and virtual teams \n- segmentation \n- marketing automation \n- agency management \n- P/L & A/P budget management \n- trade/channel market management \n- product management Summary Senior Marketing Manager – Data & ROI Driven, Strategic, Analytical with Creative Flair \n“Monika is one of those few marketers who have the ability to translate marketing initiatives into driving sales.” Former Manager \n• 15 years market management experience gained in complex multinational organisations across ICT (hardware, services (outsourcing), consulting and software), IT distribution and agencies in the B2B space.  \n• Proven ability to build demand generation strategies using digital and traditional marketing channels so as to drive sales for medium to large portfolios . \n• Leadership in building a team of direct reports, leading virtual teams across departments through clarity of vision, organisation and concise and clear communication.  \n• Specific expertise in building portfolios go-to-market strategies from the ground up, to fixing portfolios that were under performing and rapidly return them to achieving target.  \n• Well-honed stakeholder management skills working locally, regionally and world-wide with VP’s, Directors, Partners and senior management and to collaborate across organisational siloes in order to achieve goals. \nCore competencies and strengths include: \n- strategic marketing plans \n- demand generation \n- leadership/staff management of direct and virtual teams \n- segmentation \n- marketing automation \n- agency management \n- P/L & A/P budget management \n- trade/channel market management \n- product management Senior Marketing Manager – Data & ROI Driven, Strategic, Analytical with Creative Flair \n“Monika is one of those few marketers who have the ability to translate marketing initiatives into driving sales.” Former Manager \n• 15 years market management experience gained in complex multinational organisations across ICT (hardware, services (outsourcing), consulting and software), IT distribution and agencies in the B2B space.  \n• Proven ability to build demand generation strategies using digital and traditional marketing channels so as to drive sales for medium to large portfolios . \n• Leadership in building a team of direct reports, leading virtual teams across departments through clarity of vision, organisation and concise and clear communication.  \n• Specific expertise in building portfolios go-to-market strategies from the ground up, to fixing portfolios that were under performing and rapidly return them to achieving target.  \n• Well-honed stakeholder management skills working locally, regionally and world-wide with VP’s, Directors, Partners and senior management and to collaborate across organisational siloes in order to achieve goals. \nCore competencies and strengths include: \n- strategic marketing plans \n- demand generation \n- leadership/staff management of direct and virtual teams \n- segmentation \n- marketing automation \n- agency management \n- P/L & A/P budget management \n- trade/channel market management \n- product management Senior Marketing Manager – Data & ROI Driven, Strategic, Analytical with Creative Flair \n“Monika is one of those few marketers who have the ability to translate marketing initiatives into driving sales.” Former Manager \n• 15 years market management experience gained in complex multinational organisations across ICT (hardware, services (outsourcing), consulting and software), IT distribution and agencies in the B2B space.  \n• Proven ability to build demand generation strategies using digital and traditional marketing channels so as to drive sales for medium to large portfolios . \n• Leadership in building a team of direct reports, leading virtual teams across departments through clarity of vision, organisation and concise and clear communication.  \n• Specific expertise in building portfolios go-to-market strategies from the ground up, to fixing portfolios that were under performing and rapidly return them to achieving target.  \n• Well-honed stakeholder management skills working locally, regionally and world-wide with VP’s, Directors, Partners and senior management and to collaborate across organisational siloes in order to achieve goals. \nCore competencies and strengths include: \n- strategic marketing plans \n- demand generation \n- leadership/staff management of direct and virtual teams \n- segmentation \n- marketing automation \n- agency management \n- P/L & A/P budget management \n- trade/channel market management \n- product management Experience A/NZ Strategy & Marketing Manager - Cyber Security & Secure Communications Thales Group Australia February 2015  – Present (7 months) Sydney Area, Australia A/NZ Industry Marketing Manager IBM November 2013  –  February 2015  (1 year 4 months) Melbourne Area, Australia •\tNewly created role as Marketing Manager \n•\tResponsible for driving sales while leading and developing the strategic marketing direction for Government, Retail, Travel & Transport, Health, Energy & Utilities industries as well as IBM’s Smarter Cities initiative across Australia & New Zealand. \n•\tResponsible for taking IBM's Cloud, Analytics, Mobile, Social, Security and Commerce point of views to specific industry sectors across Australia and New Zealand. Marketing Program Manager - IBM Outsourcing IBM January 2012  –  October 2013  (1 year 10 months) Melbourne Area, Australia •\tBuilding the newly introduced area from the ground up to drive demand across 5 key IBM outsourcing areas. Achieved 170% pipeline growth in the first year and 112% in the second year. \n•\tBuild 360 degree campaign plans to support marketing teams objectives. \n•\tAct as a central point of contact and coordination point across IBM's program framework and market management team for IBM's outsourcing offerings. \n•\tDrive leads and management of those leads for IBM's outsourcing offerings. \n•\tManage budget to an expected ROI and to achieve and exceed objectives. \n• I took the initiative to lead the team in the first year 2012 by establishing a management system and environment where I have mentored the team. The team they have flourished and have stepped up taking a leadership role in driving their campaigns. This was all done remotely with team members based in India and Sydney while I was based in Melbourne. \n•\tActed as 2IC to my manager for many regional and worldwide meetings I often led and ran these calls while I am also responsible for building the content and presenting. \n•\tProactively initiated and developed a project that is being piloted in Australia and New Zealand with a view to be implemented in other regions. \n•\tRecognised as a future leader within IBM and was placed on an Emerging Leadership Course in 2012. Marketing Program Manager - IBM Hardware IBM May 2011  –  December 2011  (8 months) • Build a program plan to support the business strategy and objectives, and integrate the right mix of marketing elements to drive Demand Generation for the offerings/solutions featured in the program \n• The program plan is created by gathering and synthesising input from Market Management in the customer sets and/or brands supporting the program, and collaborate with marketing discipline peers to ensure program messages are consistent with the IBM Brand System and are well coordinated and timed in the marketplace. They are the ultimate co-ordination point across marketing and demand program for their industry to ensure they meet the business requirements. \n• Conduct regular interlocks across the Marketing Management and Demand Program community to ensure industry needs, requirements and targets are met \n• Responsible for Lead Management following activities with Lead Development Reps, e-nurture, sales follow up and ensure program targets are met \n• Manage the program budget to an expected ROI and achieve/exceed the program objectives, \n• Continual assessment & adjustment of Demand Generation Plans due to changing marketing and business unit needs \n• Support execution team with messaging and briefs for activities Program Execution Lead - IBM Hardware IBM June 2010  –  May 2011  (1 year) • Plan, develop and implement a 360-degree competitive marketing campaign execution strategy and deliver agreed campaign results and brand engagement against the business plan. \n• Integrate the right competitive marketing mix to support the business strategy.  \n• Plan and collaborate across marketing disciplines to ensure that marketing messages and campaigns are well coordinated and timed in the marketplace.  \n• Manage and track the campaign results and budget to achieve/exceed marketing objectives.  \n• Work with external agencies and vendors to develop key marketing messages and impactful campaign activity in support of the integrated plan \n• Provide input into campaign planning requirements.  \n• Manage the budget against individual activities to support an expected ROI and achieve/exceed the campaign objectives.  \n• Manage agency and vendor activity in terms of creative production in support of the integrated campaign plan. Campaign Manager Green Hat April 2009  –  June 2010  (1 year 3 months) • Implementation of co-marketing campaigns for our ICT clients. \n• Implementation of B2B lead generation campaigns using both traditional and digital BTL tactics. \n• Development of BTL campaigns, using direct marketing tactics \n• Day to day client management. \n• Liaison with internal team members to co-ordinate resources, in order to roll out campaigns. \n• Project management of campaigns ensuring that they run on time and within budget. \n• Stakeholder management with multiple groups both internal and external. A/NZ Marketing Manager - Floor Care & Small Appliances Electrolux Home Products November 2008  –  January 2009  (3 months) Responsible for Floor Care marketing in Australia and New Zealand. Including: brand development, ATL and BTL activities, trade marketing, consumer promotion campaigns. Developed the marketing plan for 2009 for both Australian and NZ markets before the position was made redundant. \n \nThe position was unfortunately made redundant and relocated to Singapore, hence the short tenure. A/NZ Marketing Manager Yamaha Music Australia June 2005  –  October 2008  (3 years 5 months) Marketing manager for Yamaha's pianos, digital pianos, portable keyboards, brass, wind, percussion and strings. \nIn this role I was responsible for developing and implementing the marketing plan for the category. Managed a team of product managers, a marketing coordinator and a business development manager. In the role the following was achieved: \n- re-building a team that had been disillusioned as they had had no manager for 6mths and had been provided with no direction and little support. \n- Developed and implemented various programs to drive Yamaha pianos both at student level as well as the premium end \n- Increased attendance at grass roots and student music festivals \n- Developed and implemented a green initiative to promote Yamaha' green credentials \n- developed and implemented tools to support the channel \n- Re-positioned Yamaha's brass and wind portfolio through new price model Marketing Manager - Supplies/Consumables Hewlett-Packard Australia December 2003  –  March 2005  (1 year 4 months) Sydney Area, Australia Marketing and Product Manager for HP Australia's supplies business or ink, toner and paper business. \nDevelopment of strategic marketing initiatives across all customer segments and in alignment with the over-arching company corporate strategy. This included key partnerships with Planet Ark, programs and promotions, advertising (ATL and BTL), market research and online campaigns. \nEstablish and manage pricing strategies. Championed HPs environmental policy. Identified new markets for HP and implement suitable demand generation programs. \nConducted detailed market analysis through trends analysis, connect rates, competitor analysis. \nOperational management ie: supply chain forecasts, channel inventory management and marketing funds management. Marketing Assistant Hewlett-Packard Canada April 2003  –  November 2003  (8 months) Goals were to close the marketing loop on end-user promotions and to keep the Program and Category Business Managers informed of competitive movements and market trends for Consumer Imaging and Printing Group (IPG). \n• Compiled an in-depth competitive intelligence documents for HPs printer, scanner and digital camera business. \n• Re-designed and streamlined reporting of the Consumer IPGs marketing programs to HP internal teams as well as channel partners.  \n• Developed and implemented reviews on end-user promotional campaigns and to present these key learning’s to the Consumer IPG Marketing team. HP Commerical Printing Product Manager Ingram Micro Australia May 2001  –  December 2002  (1 year 8 months) Melbourne Area, Australia Managed HP's commercial printing business for the largest IT wholesaler in Australia. \n• Managing the HP Hardcopy account and the stakeholders within HP and IMA. \n• Inventory management including: forecasting, forward ordering to within agreed guidelines to minimise company exposure. \n• Achieving sales and GP targets as set by IMA and HP. \n• Communicating and training the IMA sales team on new products and their positioning. \n• Analysis of the competitive environment at a channel and product level to ensure that IMA and HP are well positioned Website Producer - White Pages Online Sensis January 2000  –  May 2001  (1 year 5 months) Melbourne Area, Australia Managed the WPO website. \n• Management of the strategic operations of WPO, including site management, maintenance & data integrity; performance, capacity & redundancy planning; forecasting and the resolution of site issues. \n• Management of the integration of new products, site enhancements and site builds into the WPO environment. \n• Part of all new product developments that ‘touched’ the White Pages OnLine environment, both within Sensis, Telstra and external parties. \n• Management of site stakeholders and external stakeholder relationships ie: Telstra. \n• Measuring, evaluating, monitoring and reporting on the performance of WPO. Marketing Assistant Hewlett-Packard Australia January 1997  –  September 1999  (2 years 9 months) Held various marketing and supply chain roles in both HP's printer and PC business. \n• Successfully managed sales forecasting process. \n• Bridged the gap between the marketing, inventory, manufacturing and sales teams both in Australia and Singapore.  \n• Developed an in depth knowledge and understanding of Australian printer, scanner and PC business. \n• Acted as an advisor to the Corporate Desktop Market Development Manager for pricing and key product SKU’s to focus in the PC space. A/NZ Strategy & Marketing Manager - Cyber Security & Secure Communications Thales Group Australia February 2015  – Present (7 months) Sydney Area, Australia A/NZ Strategy & Marketing Manager - Cyber Security & Secure Communications Thales Group Australia February 2015  – Present (7 months) Sydney Area, Australia A/NZ Industry Marketing Manager IBM November 2013  –  February 2015  (1 year 4 months) Melbourne Area, Australia •\tNewly created role as Marketing Manager \n•\tResponsible for driving sales while leading and developing the strategic marketing direction for Government, Retail, Travel & Transport, Health, Energy & Utilities industries as well as IBM’s Smarter Cities initiative across Australia & New Zealand. \n•\tResponsible for taking IBM's Cloud, Analytics, Mobile, Social, Security and Commerce point of views to specific industry sectors across Australia and New Zealand. A/NZ Industry Marketing Manager IBM November 2013  –  February 2015  (1 year 4 months) Melbourne Area, Australia •\tNewly created role as Marketing Manager \n•\tResponsible for driving sales while leading and developing the strategic marketing direction for Government, Retail, Travel & Transport, Health, Energy & Utilities industries as well as IBM’s Smarter Cities initiative across Australia & New Zealand. \n•\tResponsible for taking IBM's Cloud, Analytics, Mobile, Social, Security and Commerce point of views to specific industry sectors across Australia and New Zealand. Marketing Program Manager - IBM Outsourcing IBM January 2012  –  October 2013  (1 year 10 months) Melbourne Area, Australia •\tBuilding the newly introduced area from the ground up to drive demand across 5 key IBM outsourcing areas. Achieved 170% pipeline growth in the first year and 112% in the second year. \n•\tBuild 360 degree campaign plans to support marketing teams objectives. \n•\tAct as a central point of contact and coordination point across IBM's program framework and market management team for IBM's outsourcing offerings. \n•\tDrive leads and management of those leads for IBM's outsourcing offerings. \n•\tManage budget to an expected ROI and to achieve and exceed objectives. \n• I took the initiative to lead the team in the first year 2012 by establishing a management system and environment where I have mentored the team. The team they have flourished and have stepped up taking a leadership role in driving their campaigns. This was all done remotely with team members based in India and Sydney while I was based in Melbourne. \n•\tActed as 2IC to my manager for many regional and worldwide meetings I often led and ran these calls while I am also responsible for building the content and presenting. \n•\tProactively initiated and developed a project that is being piloted in Australia and New Zealand with a view to be implemented in other regions. \n•\tRecognised as a future leader within IBM and was placed on an Emerging Leadership Course in 2012. Marketing Program Manager - IBM Outsourcing IBM January 2012  –  October 2013  (1 year 10 months) Melbourne Area, Australia •\tBuilding the newly introduced area from the ground up to drive demand across 5 key IBM outsourcing areas. Achieved 170% pipeline growth in the first year and 112% in the second year. \n•\tBuild 360 degree campaign plans to support marketing teams objectives. \n•\tAct as a central point of contact and coordination point across IBM's program framework and market management team for IBM's outsourcing offerings. \n•\tDrive leads and management of those leads for IBM's outsourcing offerings. \n•\tManage budget to an expected ROI and to achieve and exceed objectives. \n• I took the initiative to lead the team in the first year 2012 by establishing a management system and environment where I have mentored the team. The team they have flourished and have stepped up taking a leadership role in driving their campaigns. This was all done remotely with team members based in India and Sydney while I was based in Melbourne. \n•\tActed as 2IC to my manager for many regional and worldwide meetings I often led and ran these calls while I am also responsible for building the content and presenting. \n•\tProactively initiated and developed a project that is being piloted in Australia and New Zealand with a view to be implemented in other regions. \n•\tRecognised as a future leader within IBM and was placed on an Emerging Leadership Course in 2012. Marketing Program Manager - IBM Hardware IBM May 2011  –  December 2011  (8 months) • Build a program plan to support the business strategy and objectives, and integrate the right mix of marketing elements to drive Demand Generation for the offerings/solutions featured in the program \n• The program plan is created by gathering and synthesising input from Market Management in the customer sets and/or brands supporting the program, and collaborate with marketing discipline peers to ensure program messages are consistent with the IBM Brand System and are well coordinated and timed in the marketplace. They are the ultimate co-ordination point across marketing and demand program for their industry to ensure they meet the business requirements. \n• Conduct regular interlocks across the Marketing Management and Demand Program community to ensure industry needs, requirements and targets are met \n• Responsible for Lead Management following activities with Lead Development Reps, e-nurture, sales follow up and ensure program targets are met \n• Manage the program budget to an expected ROI and achieve/exceed the program objectives, \n• Continual assessment & adjustment of Demand Generation Plans due to changing marketing and business unit needs \n• Support execution team with messaging and briefs for activities Marketing Program Manager - IBM Hardware IBM May 2011  –  December 2011  (8 months) • Build a program plan to support the business strategy and objectives, and integrate the right mix of marketing elements to drive Demand Generation for the offerings/solutions featured in the program \n• The program plan is created by gathering and synthesising input from Market Management in the customer sets and/or brands supporting the program, and collaborate with marketing discipline peers to ensure program messages are consistent with the IBM Brand System and are well coordinated and timed in the marketplace. They are the ultimate co-ordination point across marketing and demand program for their industry to ensure they meet the business requirements. \n• Conduct regular interlocks across the Marketing Management and Demand Program community to ensure industry needs, requirements and targets are met \n• Responsible for Lead Management following activities with Lead Development Reps, e-nurture, sales follow up and ensure program targets are met \n• Manage the program budget to an expected ROI and achieve/exceed the program objectives, \n• Continual assessment & adjustment of Demand Generation Plans due to changing marketing and business unit needs \n• Support execution team with messaging and briefs for activities Program Execution Lead - IBM Hardware IBM June 2010  –  May 2011  (1 year) • Plan, develop and implement a 360-degree competitive marketing campaign execution strategy and deliver agreed campaign results and brand engagement against the business plan. \n• Integrate the right competitive marketing mix to support the business strategy.  \n• Plan and collaborate across marketing disciplines to ensure that marketing messages and campaigns are well coordinated and timed in the marketplace.  \n• Manage and track the campaign results and budget to achieve/exceed marketing objectives.  \n• Work with external agencies and vendors to develop key marketing messages and impactful campaign activity in support of the integrated plan \n• Provide input into campaign planning requirements.  \n• Manage the budget against individual activities to support an expected ROI and achieve/exceed the campaign objectives.  \n• Manage agency and vendor activity in terms of creative production in support of the integrated campaign plan. Program Execution Lead - IBM Hardware IBM June 2010  –  May 2011  (1 year) • Plan, develop and implement a 360-degree competitive marketing campaign execution strategy and deliver agreed campaign results and brand engagement against the business plan. \n• Integrate the right competitive marketing mix to support the business strategy.  \n• Plan and collaborate across marketing disciplines to ensure that marketing messages and campaigns are well coordinated and timed in the marketplace.  \n• Manage and track the campaign results and budget to achieve/exceed marketing objectives.  \n• Work with external agencies and vendors to develop key marketing messages and impactful campaign activity in support of the integrated plan \n• Provide input into campaign planning requirements.  \n• Manage the budget against individual activities to support an expected ROI and achieve/exceed the campaign objectives.  \n• Manage agency and vendor activity in terms of creative production in support of the integrated campaign plan. Campaign Manager Green Hat April 2009  –  June 2010  (1 year 3 months) • Implementation of co-marketing campaigns for our ICT clients. \n• Implementation of B2B lead generation campaigns using both traditional and digital BTL tactics. \n• Development of BTL campaigns, using direct marketing tactics \n• Day to day client management. \n• Liaison with internal team members to co-ordinate resources, in order to roll out campaigns. \n• Project management of campaigns ensuring that they run on time and within budget. \n• Stakeholder management with multiple groups both internal and external. Campaign Manager Green Hat April 2009  –  June 2010  (1 year 3 months) • Implementation of co-marketing campaigns for our ICT clients. \n• Implementation of B2B lead generation campaigns using both traditional and digital BTL tactics. \n• Development of BTL campaigns, using direct marketing tactics \n• Day to day client management. \n• Liaison with internal team members to co-ordinate resources, in order to roll out campaigns. \n• Project management of campaigns ensuring that they run on time and within budget. \n• Stakeholder management with multiple groups both internal and external. A/NZ Marketing Manager - Floor Care & Small Appliances Electrolux Home Products November 2008  –  January 2009  (3 months) Responsible for Floor Care marketing in Australia and New Zealand. Including: brand development, ATL and BTL activities, trade marketing, consumer promotion campaigns. Developed the marketing plan for 2009 for both Australian and NZ markets before the position was made redundant. \n \nThe position was unfortunately made redundant and relocated to Singapore, hence the short tenure. A/NZ Marketing Manager - Floor Care & Small Appliances Electrolux Home Products November 2008  –  January 2009  (3 months) Responsible for Floor Care marketing in Australia and New Zealand. Including: brand development, ATL and BTL activities, trade marketing, consumer promotion campaigns. Developed the marketing plan for 2009 for both Australian and NZ markets before the position was made redundant. \n \nThe position was unfortunately made redundant and relocated to Singapore, hence the short tenure. A/NZ Marketing Manager Yamaha Music Australia June 2005  –  October 2008  (3 years 5 months) Marketing manager for Yamaha's pianos, digital pianos, portable keyboards, brass, wind, percussion and strings. \nIn this role I was responsible for developing and implementing the marketing plan for the category. Managed a team of product managers, a marketing coordinator and a business development manager. In the role the following was achieved: \n- re-building a team that had been disillusioned as they had had no manager for 6mths and had been provided with no direction and little support. \n- Developed and implemented various programs to drive Yamaha pianos both at student level as well as the premium end \n- Increased attendance at grass roots and student music festivals \n- Developed and implemented a green initiative to promote Yamaha' green credentials \n- developed and implemented tools to support the channel \n- Re-positioned Yamaha's brass and wind portfolio through new price model A/NZ Marketing Manager Yamaha Music Australia June 2005  –  October 2008  (3 years 5 months) Marketing manager for Yamaha's pianos, digital pianos, portable keyboards, brass, wind, percussion and strings. \nIn this role I was responsible for developing and implementing the marketing plan for the category. Managed a team of product managers, a marketing coordinator and a business development manager. In the role the following was achieved: \n- re-building a team that had been disillusioned as they had had no manager for 6mths and had been provided with no direction and little support. \n- Developed and implemented various programs to drive Yamaha pianos both at student level as well as the premium end \n- Increased attendance at grass roots and student music festivals \n- Developed and implemented a green initiative to promote Yamaha' green credentials \n- developed and implemented tools to support the channel \n- Re-positioned Yamaha's brass and wind portfolio through new price model Marketing Manager - Supplies/Consumables Hewlett-Packard Australia December 2003  –  March 2005  (1 year 4 months) Sydney Area, Australia Marketing and Product Manager for HP Australia's supplies business or ink, toner and paper business. \nDevelopment of strategic marketing initiatives across all customer segments and in alignment with the over-arching company corporate strategy. This included key partnerships with Planet Ark, programs and promotions, advertising (ATL and BTL), market research and online campaigns. \nEstablish and manage pricing strategies. Championed HPs environmental policy. Identified new markets for HP and implement suitable demand generation programs. \nConducted detailed market analysis through trends analysis, connect rates, competitor analysis. \nOperational management ie: supply chain forecasts, channel inventory management and marketing funds management. Marketing Manager - Supplies/Consumables Hewlett-Packard Australia December 2003  –  March 2005  (1 year 4 months) Sydney Area, Australia Marketing and Product Manager for HP Australia's supplies business or ink, toner and paper business. \nDevelopment of strategic marketing initiatives across all customer segments and in alignment with the over-arching company corporate strategy. This included key partnerships with Planet Ark, programs and promotions, advertising (ATL and BTL), market research and online campaigns. \nEstablish and manage pricing strategies. Championed HPs environmental policy. Identified new markets for HP and implement suitable demand generation programs. \nConducted detailed market analysis through trends analysis, connect rates, competitor analysis. \nOperational management ie: supply chain forecasts, channel inventory management and marketing funds management. Marketing Assistant Hewlett-Packard Canada April 2003  –  November 2003  (8 months) Goals were to close the marketing loop on end-user promotions and to keep the Program and Category Business Managers informed of competitive movements and market trends for Consumer Imaging and Printing Group (IPG). \n• Compiled an in-depth competitive intelligence documents for HPs printer, scanner and digital camera business. \n• Re-designed and streamlined reporting of the Consumer IPGs marketing programs to HP internal teams as well as channel partners.  \n• Developed and implemented reviews on end-user promotional campaigns and to present these key learning’s to the Consumer IPG Marketing team. Marketing Assistant Hewlett-Packard Canada April 2003  –  November 2003  (8 months) Goals were to close the marketing loop on end-user promotions and to keep the Program and Category Business Managers informed of competitive movements and market trends for Consumer Imaging and Printing Group (IPG). \n• Compiled an in-depth competitive intelligence documents for HPs printer, scanner and digital camera business. \n• Re-designed and streamlined reporting of the Consumer IPGs marketing programs to HP internal teams as well as channel partners.  \n• Developed and implemented reviews on end-user promotional campaigns and to present these key learning’s to the Consumer IPG Marketing team. HP Commerical Printing Product Manager Ingram Micro Australia May 2001  –  December 2002  (1 year 8 months) Melbourne Area, Australia Managed HP's commercial printing business for the largest IT wholesaler in Australia. \n• Managing the HP Hardcopy account and the stakeholders within HP and IMA. \n• Inventory management including: forecasting, forward ordering to within agreed guidelines to minimise company exposure. \n• Achieving sales and GP targets as set by IMA and HP. \n• Communicating and training the IMA sales team on new products and their positioning. \n• Analysis of the competitive environment at a channel and product level to ensure that IMA and HP are well positioned HP Commerical Printing Product Manager Ingram Micro Australia May 2001  –  December 2002  (1 year 8 months) Melbourne Area, Australia Managed HP's commercial printing business for the largest IT wholesaler in Australia. \n• Managing the HP Hardcopy account and the stakeholders within HP and IMA. \n• Inventory management including: forecasting, forward ordering to within agreed guidelines to minimise company exposure. \n• Achieving sales and GP targets as set by IMA and HP. \n• Communicating and training the IMA sales team on new products and their positioning. \n• Analysis of the competitive environment at a channel and product level to ensure that IMA and HP are well positioned Website Producer - White Pages Online Sensis January 2000  –  May 2001  (1 year 5 months) Melbourne Area, Australia Managed the WPO website. \n• Management of the strategic operations of WPO, including site management, maintenance & data integrity; performance, capacity & redundancy planning; forecasting and the resolution of site issues. \n• Management of the integration of new products, site enhancements and site builds into the WPO environment. \n• Part of all new product developments that ‘touched’ the White Pages OnLine environment, both within Sensis, Telstra and external parties. \n• Management of site stakeholders and external stakeholder relationships ie: Telstra. \n• Measuring, evaluating, monitoring and reporting on the performance of WPO. Website Producer - White Pages Online Sensis January 2000  –  May 2001  (1 year 5 months) Melbourne Area, Australia Managed the WPO website. \n• Management of the strategic operations of WPO, including site management, maintenance & data integrity; performance, capacity & redundancy planning; forecasting and the resolution of site issues. \n• Management of the integration of new products, site enhancements and site builds into the WPO environment. \n• Part of all new product developments that ‘touched’ the White Pages OnLine environment, both within Sensis, Telstra and external parties. \n• Management of site stakeholders and external stakeholder relationships ie: Telstra. \n• Measuring, evaluating, monitoring and reporting on the performance of WPO. Marketing Assistant Hewlett-Packard Australia January 1997  –  September 1999  (2 years 9 months) Held various marketing and supply chain roles in both HP's printer and PC business. \n• Successfully managed sales forecasting process. \n• Bridged the gap between the marketing, inventory, manufacturing and sales teams both in Australia and Singapore.  \n• Developed an in depth knowledge and understanding of Australian printer, scanner and PC business. \n• Acted as an advisor to the Corporate Desktop Market Development Manager for pricing and key product SKU’s to focus in the PC space. Marketing Assistant Hewlett-Packard Australia January 1997  –  September 1999  (2 years 9 months) Held various marketing and supply chain roles in both HP's printer and PC business. \n• Successfully managed sales forecasting process. \n• Bridged the gap between the marketing, inventory, manufacturing and sales teams both in Australia and Singapore.  \n• Developed an in depth knowledge and understanding of Australian printer, scanner and PC business. \n• Acted as an advisor to the Corporate Desktop Market Development Manager for pricing and key product SKU’s to focus in the PC space. Languages   Skills Lead Generation Marketing Management Integrated Marketing Marketing Digital Marketing Marketing Strategy Demand Generation CRM Competitive Analysis B2B B2B Marketing Direct Marketing Strategy Multi-channel Marketing Management Product Management Business Planning Market Research Sales Data Analytics Marketing Automation Sales Enablement Channel Partners Forecasting Product Development Business Strategy Online Advertising Market Analysis Brand Development Advertising Program Management Segmentation E-commerce Business Alliances Strategic Partnerships Leadership Analytical Skills Marketing Manager Channel Marketing Project Management Messaging Partner Management Go-to-market Strategy Market Planning Email Marketing Campaign Management Marketing Communications Team Leadership Analytics Social Media Marketing See 35+     See less Skills  Lead Generation Marketing Management Integrated Marketing Marketing Digital Marketing Marketing Strategy Demand Generation CRM Competitive Analysis B2B B2B Marketing Direct Marketing Strategy Multi-channel Marketing Management Product Management Business Planning Market Research Sales Data Analytics Marketing Automation Sales Enablement Channel Partners Forecasting Product Development Business Strategy Online Advertising Market Analysis Brand Development Advertising Program Management Segmentation E-commerce Business Alliances Strategic Partnerships Leadership Analytical Skills Marketing Manager Channel Marketing Project Management Messaging Partner Management Go-to-market Strategy Market Planning Email Marketing Campaign Management Marketing Communications Team Leadership Analytics Social Media Marketing See 35+     See less Lead Generation Marketing Management Integrated Marketing Marketing Digital Marketing Marketing Strategy Demand Generation CRM Competitive Analysis B2B B2B Marketing Direct Marketing Strategy Multi-channel Marketing Management Product Management Business Planning Market Research Sales Data Analytics Marketing Automation Sales Enablement Channel Partners Forecasting Product Development Business Strategy Online Advertising Market Analysis Brand Development Advertising Program Management Segmentation E-commerce Business Alliances Strategic Partnerships Leadership Analytical Skills Marketing Manager Channel Marketing Project Management Messaging Partner Management Go-to-market Strategy Market Planning Email Marketing Campaign Management Marketing Communications Team Leadership Analytics Social Media Marketing See 35+     See less Lead Generation Marketing Management Integrated Marketing Marketing Digital Marketing Marketing Strategy Demand Generation CRM Competitive Analysis B2B B2B Marketing Direct Marketing Strategy Multi-channel Marketing Management Product Management Business Planning Market Research Sales Data Analytics Marketing Automation Sales Enablement Channel Partners Forecasting Product Development Business Strategy Online Advertising Market Analysis Brand Development Advertising Program Management Segmentation E-commerce Business Alliances Strategic Partnerships Leadership Analytical Skills Marketing Manager Channel Marketing Project Management Messaging Partner Management Go-to-market Strategy Market Planning Email Marketing Campaign Management Marketing Communications Team Leadership Analytics Social Media Marketing See 35+     See less Education RMIT University Bachelor of Business,  Marketing 1995  – 1999 Bachelor of Business - Marketing RMIT University Bachelor of Business,  Marketing 1995  – 1999 Bachelor of Business - Marketing RMIT University Bachelor of Business,  Marketing 1995  – 1999 Bachelor of Business - Marketing RMIT University Bachelor of Business,  Marketing 1995  – 1999 Bachelor of Business - Marketing Honors & Awards APAC Gold Sabre Award in 2013 Gold Sabre Award - Asia Pacific October 2013 Award Category : Superior Achievement in Branding, Reputation & Engagement. APAC Gold Sabre Award in 2013 Gold Sabre Award - Asia Pacific October 2013 Award Category : Superior Achievement in Branding, Reputation & Engagement. APAC Gold Sabre Award in 2013 Gold Sabre Award - Asia Pacific October 2013 Award Category : Superior Achievement in Branding, Reputation & Engagement. APAC Gold Sabre Award in 2013 Gold Sabre Award - Asia Pacific October 2013 Award Category : Superior Achievement in Branding, Reputation & Engagement. ", "Experience Channel Marketing Program Manager IBM December 2003  – Present (11 years 9 months) Business Partner marketing and communications support for IBM Global Technology Services Co-Marketing Program Team Leader IBM April 2000  –  November 2003  (3 years 8 months) Syracuse, NY Business Partner Channel Program Manager IBM February 1996  –  March 2000  (4 years 2 months) Waltham, MA & Syracuse, NY Managed several Business Partners programs, including: PartnerServe marketing development funds, Premier/Advanced tiered recognition program and initial design of the PartnerWorld program. Direct Marketing Inside Sales Team Leader IBM July 1993  –  January 1996  (2 years 7 months) Mt. Laurel, NJ Created and implemented Inside Sales programs for specific market segments, including education, sales and marketing activities. Managed goal attainment of Inside Sales Reps on my team. General Business Sales Rep IBM June 1986  –  June 1993  (7 years 1 month) Mt Laurel, NJ Channel Marketing Program Manager IBM December 2003  – Present (11 years 9 months) Business Partner marketing and communications support for IBM Global Technology Services Channel Marketing Program Manager IBM December 2003  – Present (11 years 9 months) Business Partner marketing and communications support for IBM Global Technology Services Co-Marketing Program Team Leader IBM April 2000  –  November 2003  (3 years 8 months) Syracuse, NY Co-Marketing Program Team Leader IBM April 2000  –  November 2003  (3 years 8 months) Syracuse, NY Business Partner Channel Program Manager IBM February 1996  –  March 2000  (4 years 2 months) Waltham, MA & Syracuse, NY Managed several Business Partners programs, including: PartnerServe marketing development funds, Premier/Advanced tiered recognition program and initial design of the PartnerWorld program. Business Partner Channel Program Manager IBM February 1996  –  March 2000  (4 years 2 months) Waltham, MA & Syracuse, NY Managed several Business Partners programs, including: PartnerServe marketing development funds, Premier/Advanced tiered recognition program and initial design of the PartnerWorld program. Direct Marketing Inside Sales Team Leader IBM July 1993  –  January 1996  (2 years 7 months) Mt. Laurel, NJ Created and implemented Inside Sales programs for specific market segments, including education, sales and marketing activities. Managed goal attainment of Inside Sales Reps on my team. Direct Marketing Inside Sales Team Leader IBM July 1993  –  January 1996  (2 years 7 months) Mt. Laurel, NJ Created and implemented Inside Sales programs for specific market segments, including education, sales and marketing activities. Managed goal attainment of Inside Sales Reps on my team. General Business Sales Rep IBM June 1986  –  June 1993  (7 years 1 month) Mt Laurel, NJ General Business Sales Rep IBM June 1986  –  June 1993  (7 years 1 month) Mt Laurel, NJ Skills Marketing Communications Project Management Channel Program... Channel Partners Co-marketing Marketing Marketing... Business Partner Support Program Management Program Development Team Building Cross-functional... Writing Skills  Marketing Communications Project Management Channel Program... Channel Partners Co-marketing Marketing Marketing... Business Partner Support Program Management Program Development Team Building Cross-functional... Writing Marketing Communications Project Management Channel Program... Channel Partners Co-marketing Marketing Marketing... Business Partner Support Program Management Program Development Team Building Cross-functional... Writing Marketing Communications Project Management Channel Program... Channel Partners Co-marketing Marketing Marketing... Business Partner Support Program Management Program Development Team Building Cross-functional... Writing Education Harvard University Bachelor of Arts (B.A.),  Economics 1982  – 1986 West Genesee High School High School Diploma 1978  – 1982 Activities and Societies:  Valedictorian ,  NY State Swimming Champion Harvard University Bachelor of Arts (B.A.),  Economics 1982  – 1986 Harvard University Bachelor of Arts (B.A.),  Economics 1982  – 1986 Harvard University Bachelor of Arts (B.A.),  Economics 1982  – 1986 West Genesee High School High School Diploma 1978  – 1982 Activities and Societies:  Valedictorian ,  NY State Swimming Champion West Genesee High School High School Diploma 1978  – 1982 Activities and Societies:  Valedictorian ,  NY State Swimming Champion West Genesee High School High School Diploma 1978  – 1982 Activities and Societies:  Valedictorian ,  NY State Swimming Champion ", "Experience Marketing Program Manager IBM November 2004  – Present (10 years 10 months) Marketing Manager Candle 1997  –  2004  (7 years) Marketing Manager Candle 1997  –  2004  (7 years) Marketing 3Com 1995  –  1997  (2 years) Marketing Specialist Chipcom Italia 1994  –  1996  (2 years) Marketing Program Manager IBM November 2004  – Present (10 years 10 months) Marketing Program Manager IBM November 2004  – Present (10 years 10 months) Marketing Manager Candle 1997  –  2004  (7 years) Marketing Manager Candle 1997  –  2004  (7 years) Marketing Manager Candle 1997  –  2004  (7 years) Marketing Manager Candle 1997  –  2004  (7 years) Marketing 3Com 1995  –  1997  (2 years) Marketing 3Com 1995  –  1997  (2 years) Marketing Specialist Chipcom Italia 1994  –  1996  (2 years) Marketing Specialist Chipcom Italia 1994  –  1996  (2 years) Languages English - Cambridge University Proficiency Full professional proficiency Spanish Professional working proficiency English - Cambridge University Proficiency Full professional proficiency Spanish Professional working proficiency English - Cambridge University Proficiency Full professional proficiency Spanish Professional working proficiency Full professional proficiency Professional working proficiency Skills Demand Generation Digital Marketing Channel Project Management Enterprise Software Product Marketing Cloud Computing Sales Enablement Lead Generation Multi-channel Marketing SaaS Business Alliances Skills  Demand Generation Digital Marketing Channel Project Management Enterprise Software Product Marketing Cloud Computing Sales Enablement Lead Generation Multi-channel Marketing SaaS Business Alliances Demand Generation Digital Marketing Channel Project Management Enterprise Software Product Marketing Cloud Computing Sales Enablement Lead Generation Multi-channel Marketing SaaS Business Alliances Demand Generation Digital Marketing Channel Project Management Enterprise Software Product Marketing Cloud Computing Sales Enablement Lead Generation Multi-channel Marketing SaaS Business Alliances Education Università degli Studi di Milano Degree,  Literature 1983  – 1987 Liceo Beccaria Milano Maturità classica 1975  – 1979 Università degli Studi di Milano Degree,  Literature 1983  – 1987 Università degli Studi di Milano Degree,  Literature 1983  – 1987 Università degli Studi di Milano Degree,  Literature 1983  – 1987 Liceo Beccaria Milano Maturità classica 1975  – 1979 Liceo Beccaria Milano Maturità classica 1975  – 1979 Liceo Beccaria Milano Maturità classica 1975  – 1979 ", "Summary Innovative technology, business and entrepreneurial professional with extensive program management, product marketing and management, process development, sales support, team leadership, and partner/vendor relationship management experience; working with international corporations, entrepreneurial start-ups, and not-for-profit organizations. Proven skills in developing and implementing product, program and marketing strategies, critical business processes, strategic partner and vendor relationships, and conducting product and program training. Experienced cross-geography, cross-cultural, cross-functional, and cross-organizational team leader, working with IT, Fulfillment, Product Development, Product Marketing, Customer Support, and External Partner organizations. Specialties:Product Marketing and Management, Program and Project Management, Strategic Planning, Process Development, Product & Program Training, Partner & Vendor Relationship Management, Team Leadership, Sales Support, and Innovative Thinking - domestically and internationally. Summary Innovative technology, business and entrepreneurial professional with extensive program management, product marketing and management, process development, sales support, team leadership, and partner/vendor relationship management experience; working with international corporations, entrepreneurial start-ups, and not-for-profit organizations. Proven skills in developing and implementing product, program and marketing strategies, critical business processes, strategic partner and vendor relationships, and conducting product and program training. Experienced cross-geography, cross-cultural, cross-functional, and cross-organizational team leader, working with IT, Fulfillment, Product Development, Product Marketing, Customer Support, and External Partner organizations. Specialties:Product Marketing and Management, Program and Project Management, Strategic Planning, Process Development, Product & Program Training, Partner & Vendor Relationship Management, Team Leadership, Sales Support, and Innovative Thinking - domestically and internationally. Innovative technology, business and entrepreneurial professional with extensive program management, product marketing and management, process development, sales support, team leadership, and partner/vendor relationship management experience; working with international corporations, entrepreneurial start-ups, and not-for-profit organizations. Proven skills in developing and implementing product, program and marketing strategies, critical business processes, strategic partner and vendor relationships, and conducting product and program training. Experienced cross-geography, cross-cultural, cross-functional, and cross-organizational team leader, working with IT, Fulfillment, Product Development, Product Marketing, Customer Support, and External Partner organizations. Specialties:Product Marketing and Management, Program and Project Management, Strategic Planning, Process Development, Product & Program Training, Partner & Vendor Relationship Management, Team Leadership, Sales Support, and Innovative Thinking - domestically and internationally. Innovative technology, business and entrepreneurial professional with extensive program management, product marketing and management, process development, sales support, team leadership, and partner/vendor relationship management experience; working with international corporations, entrepreneurial start-ups, and not-for-profit organizations. Proven skills in developing and implementing product, program and marketing strategies, critical business processes, strategic partner and vendor relationships, and conducting product and program training. Experienced cross-geography, cross-cultural, cross-functional, and cross-organizational team leader, working with IT, Fulfillment, Product Development, Product Marketing, Customer Support, and External Partner organizations. Specialties:Product Marketing and Management, Program and Project Management, Strategic Planning, Process Development, Product & Program Training, Partner & Vendor Relationship Management, Team Leadership, Sales Support, and Innovative Thinking - domestically and internationally. Experience Project Manager IBM March 2012  – Present (3 years 6 months) Columbia, Missouri Area Product & Sales Operations Lowe's September 2010  –  March 2012  (1 year 7 months) *\tDemonstrate and explain products and programs.  \n*\tStage and merchandise products and services in order to take advantage of seasonal buying opportunities, effectively maximize available retail floor space, and add incremental sales.  \n*\tExecute departmental product resets in order to maximize retail space and enhance product positioning and awareness with customers.  \n*\tRespond appropriately to inquiries, as the opportunity or need arises.  \n*\tInventory management and auditing Director of Product Operations Pave Guard Technologies/Solar Link Technologies July 2009  –  July 2010  (1 year 1 month) Lee's Summit, Missouri Renewable energy/sustainability start-up company that has international patents pending for its solar-powered snow melt system. The system is installed in paved surfaces, prohibiting the formation of snow and ice in inclement weather. \n \n•\tManaged the program planning, product operations, component vendor engagements, and business partner coordination for the planning and installation of the first two solar-powered ice-melt bridges in the United States, for the Missouri Department of Transportation \n•\tDeveloped and mapped the cross-functional business and operational processes for Pave Guard/Solar Link, including pre-sale and post-sale activities, installation activities, customer service, and vendor/business partner relationship management \n•\tLed cross-functional and cross-company teams to identify and document the critical communications, business, and operational processes necessary to collaborate, plan, design, install, and service solar array and hydronics systems for Pave Guard customers \n•\tDeveloped, executed, and managed contractual agreements with our customers, vendors, and business partners – managing the terms and conditions, and working with the relevant individuals and departments to ensure that these terms and conditions were completed and satisfied \n•\tDeveloped and implemented important business tools and forms, such as: installation contracts, non-disclosure agreements, extended warranty agreements, system configuration tool, pricing tool, and field change order forms  \n•\tResearched, identified and established strong business relationships with strategic partners and vendors – securing necessary expertise, components, and services  \n•\tEvaluated, sized, priced, and secured the appropriate solar array and hydronics components necessary to deliver the best system for satisfying customer requirements. Director - Business Administration Lee's Summit Community Church July 2006  –  July 2009  (3 years 1 month) Directed the business and administrative areas of the church, including: facilities, finance, legal, IT, communications, security, and administrative support – providing oversight and leadership to the managers of these functional areas. \n \nResponsibilities: \n•\tEstablished business and financial processes, controls, and procedures, including a new Purchase Order system, in order to support and manage the day-to-day business, administrative, and financial functions and activities of the church \n•\tDeveloped a financial tracking tool, using Microsoft Excel, which produced an “at a glance” status of the weekly offerings, expenses, fund balances, and cash-on-hand \n•\tDirected the internal and external communications strategies and activities of the church, giving direction to the church’s communications manager \n•\tDeveloped and managed annual financial budgets designed to meet the ministerial and business needs of the church \n•\tEstablished and managed lease agreements, purchase agreements, and services agreements on behalf of the church with key business partners \n•\tEstablished security and accountability processes and measures in regard to receiving, securing, counting, transporting, and depositing the Sunday offerings Director - Product & Support Operations Navstar Technologies, Inc. 2003  –  2005  (2 years) Overland Park, Kansas A wireless telecom start-up company that developed a GPS-based, voice-based, vehicle navigation system which connects to the Navstar mapping and navigation servers using the driver’s mobile phone. The unit receives verbal instructions from the driver, uses the mobile phone to transmit the driver’s verbal instructions to the servers, and responds to the driver with audio directions, from the servers, to the desired destination. \n \n•\tResearched, identified, established, and managed the legal and business relationships with our call center/customer care and fulfillment operations business partners in order to direct, collaborate with, and coordinate their resources and activities to support Navstar \n•\tLed cross-company teams to identify, develop, and document the business and operational processes for training the call center/customer care reps, customizing the call center software, identifying data elements for the Customer Master Record, and establishing product distribution, fulfillment, and returns procedures with our partners \n•\tPerformed the patent, trademark, and copyright research required to solidify the viability of the Navstar voice-navigation technology, communications copyrights, and company trademark. Worked with the company’s law firm to maneuver through the patent evaluation process in order to solidify our technology position in the marketplace  \n•\tConducted regular market research in order to identify the most appropriate mobile phone models in the marketplace to support with the Navstar navigation system. Worked with the appropriate mobile carriers (Sprint, Verizon, AT&T, etc.) and handset manufacturers (Samsung, Motorola, Palm, etc.) to effectively integrate these handsets into our navigation system \n•\tConducted system testing by using the various mobile phone models to request and receive driving directions, as I drove throughout various cities in the US – validating that the system components worked correctly and the driving directions were accurate Program Manager IBM - Personal Computing Division 1993  –  2002  (9 years) Located in Research Triangle Park, NC \n \n•\tSegment Marketing Program Manager - IBM PC Direct \nDeveloped and managed segment-specific products, programs and messaging for selling IBM PC products and services to consumers and small/medium businesses on ibm.com. Contributed significantly to our $1B in online sales. \n•\tCommunications Manager – PCD Chief Technology Officer \nProvided worldwide communications management, consulting, and support for the division’s Chief Technology Officer: developed technology presentations; wrote technology articles for internal and external publications; developed technology press releases; developed, managed and produced informational videos promoting the division’s emerging technology and product development capabilities; assisted CTO with various partner, channel, media, press, and technology events, worldwide. \n• Marketing Program Manager – IBM Consumer Division \nMarketing program manager and liaison between the Consumer Division W/W team and the Consumer Division’s Europe/Middle East/Africa (EMEA) geography team in London. Charged with communicating, coordinating, managing and resolving the EMEA product, marketing, and channel processes, requirements, strategies, programs and issues with the W/W product team, in order to effectively compete with Dell & other major PC vendors in Europe.  \n•\tProduct Line Manager – IBM Direct \nManaged the non-IBM branded PC products, software, and accessories we sold through IBM Direct, the PC Division’s direct sales & fulfillment organization. Managed the internal-IBM program team, vendor relationships, and the various relationship functions and activities with Merisel - our national product distributor and non-IBM product ordering and fulfillment partner. Sales Support & Account Development Toshiba America Information Systems 1986  –  1992  (6 years) • Sales Support Representative \nManaged the sales support activities and the distributor/retailer relationships in a 4-state territory for Toshiba America’s laptop and portable computing division. Received the Rookie of the Year award. \n• Sales Support Manager \nManaged the sales support activities of 6 Sales Support Representatives in a 12-state region. Managed 6 Sales Support Representatives. We received the annual Regional Excellence Award. \n• Account Development Executive  \nEstablished and managed relationships with large corporate accounts for the purpose of selling and supporting Toshiba printing and laptop/portable computing products and solutions within these companies. Project Manager IBM March 2012  – Present (3 years 6 months) Columbia, Missouri Area Project Manager IBM March 2012  – Present (3 years 6 months) Columbia, Missouri Area Product & Sales Operations Lowe's September 2010  –  March 2012  (1 year 7 months) *\tDemonstrate and explain products and programs.  \n*\tStage and merchandise products and services in order to take advantage of seasonal buying opportunities, effectively maximize available retail floor space, and add incremental sales.  \n*\tExecute departmental product resets in order to maximize retail space and enhance product positioning and awareness with customers.  \n*\tRespond appropriately to inquiries, as the opportunity or need arises.  \n*\tInventory management and auditing Product & Sales Operations Lowe's September 2010  –  March 2012  (1 year 7 months) *\tDemonstrate and explain products and programs.  \n*\tStage and merchandise products and services in order to take advantage of seasonal buying opportunities, effectively maximize available retail floor space, and add incremental sales.  \n*\tExecute departmental product resets in order to maximize retail space and enhance product positioning and awareness with customers.  \n*\tRespond appropriately to inquiries, as the opportunity or need arises.  \n*\tInventory management and auditing Director of Product Operations Pave Guard Technologies/Solar Link Technologies July 2009  –  July 2010  (1 year 1 month) Lee's Summit, Missouri Renewable energy/sustainability start-up company that has international patents pending for its solar-powered snow melt system. The system is installed in paved surfaces, prohibiting the formation of snow and ice in inclement weather. \n \n•\tManaged the program planning, product operations, component vendor engagements, and business partner coordination for the planning and installation of the first two solar-powered ice-melt bridges in the United States, for the Missouri Department of Transportation \n•\tDeveloped and mapped the cross-functional business and operational processes for Pave Guard/Solar Link, including pre-sale and post-sale activities, installation activities, customer service, and vendor/business partner relationship management \n•\tLed cross-functional and cross-company teams to identify and document the critical communications, business, and operational processes necessary to collaborate, plan, design, install, and service solar array and hydronics systems for Pave Guard customers \n•\tDeveloped, executed, and managed contractual agreements with our customers, vendors, and business partners – managing the terms and conditions, and working with the relevant individuals and departments to ensure that these terms and conditions were completed and satisfied \n•\tDeveloped and implemented important business tools and forms, such as: installation contracts, non-disclosure agreements, extended warranty agreements, system configuration tool, pricing tool, and field change order forms  \n•\tResearched, identified and established strong business relationships with strategic partners and vendors – securing necessary expertise, components, and services  \n•\tEvaluated, sized, priced, and secured the appropriate solar array and hydronics components necessary to deliver the best system for satisfying customer requirements. Director of Product Operations Pave Guard Technologies/Solar Link Technologies July 2009  –  July 2010  (1 year 1 month) Lee's Summit, Missouri Renewable energy/sustainability start-up company that has international patents pending for its solar-powered snow melt system. The system is installed in paved surfaces, prohibiting the formation of snow and ice in inclement weather. \n \n•\tManaged the program planning, product operations, component vendor engagements, and business partner coordination for the planning and installation of the first two solar-powered ice-melt bridges in the United States, for the Missouri Department of Transportation \n•\tDeveloped and mapped the cross-functional business and operational processes for Pave Guard/Solar Link, including pre-sale and post-sale activities, installation activities, customer service, and vendor/business partner relationship management \n•\tLed cross-functional and cross-company teams to identify and document the critical communications, business, and operational processes necessary to collaborate, plan, design, install, and service solar array and hydronics systems for Pave Guard customers \n•\tDeveloped, executed, and managed contractual agreements with our customers, vendors, and business partners – managing the terms and conditions, and working with the relevant individuals and departments to ensure that these terms and conditions were completed and satisfied \n•\tDeveloped and implemented important business tools and forms, such as: installation contracts, non-disclosure agreements, extended warranty agreements, system configuration tool, pricing tool, and field change order forms  \n•\tResearched, identified and established strong business relationships with strategic partners and vendors – securing necessary expertise, components, and services  \n•\tEvaluated, sized, priced, and secured the appropriate solar array and hydronics components necessary to deliver the best system for satisfying customer requirements. Director - Business Administration Lee's Summit Community Church July 2006  –  July 2009  (3 years 1 month) Directed the business and administrative areas of the church, including: facilities, finance, legal, IT, communications, security, and administrative support – providing oversight and leadership to the managers of these functional areas. \n \nResponsibilities: \n•\tEstablished business and financial processes, controls, and procedures, including a new Purchase Order system, in order to support and manage the day-to-day business, administrative, and financial functions and activities of the church \n•\tDeveloped a financial tracking tool, using Microsoft Excel, which produced an “at a glance” status of the weekly offerings, expenses, fund balances, and cash-on-hand \n•\tDirected the internal and external communications strategies and activities of the church, giving direction to the church’s communications manager \n•\tDeveloped and managed annual financial budgets designed to meet the ministerial and business needs of the church \n•\tEstablished and managed lease agreements, purchase agreements, and services agreements on behalf of the church with key business partners \n•\tEstablished security and accountability processes and measures in regard to receiving, securing, counting, transporting, and depositing the Sunday offerings Director - Business Administration Lee's Summit Community Church July 2006  –  July 2009  (3 years 1 month) Directed the business and administrative areas of the church, including: facilities, finance, legal, IT, communications, security, and administrative support – providing oversight and leadership to the managers of these functional areas. \n \nResponsibilities: \n•\tEstablished business and financial processes, controls, and procedures, including a new Purchase Order system, in order to support and manage the day-to-day business, administrative, and financial functions and activities of the church \n•\tDeveloped a financial tracking tool, using Microsoft Excel, which produced an “at a glance” status of the weekly offerings, expenses, fund balances, and cash-on-hand \n•\tDirected the internal and external communications strategies and activities of the church, giving direction to the church’s communications manager \n•\tDeveloped and managed annual financial budgets designed to meet the ministerial and business needs of the church \n•\tEstablished and managed lease agreements, purchase agreements, and services agreements on behalf of the church with key business partners \n•\tEstablished security and accountability processes and measures in regard to receiving, securing, counting, transporting, and depositing the Sunday offerings Director - Product & Support Operations Navstar Technologies, Inc. 2003  –  2005  (2 years) Overland Park, Kansas A wireless telecom start-up company that developed a GPS-based, voice-based, vehicle navigation system which connects to the Navstar mapping and navigation servers using the driver’s mobile phone. The unit receives verbal instructions from the driver, uses the mobile phone to transmit the driver’s verbal instructions to the servers, and responds to the driver with audio directions, from the servers, to the desired destination. \n \n•\tResearched, identified, established, and managed the legal and business relationships with our call center/customer care and fulfillment operations business partners in order to direct, collaborate with, and coordinate their resources and activities to support Navstar \n•\tLed cross-company teams to identify, develop, and document the business and operational processes for training the call center/customer care reps, customizing the call center software, identifying data elements for the Customer Master Record, and establishing product distribution, fulfillment, and returns procedures with our partners \n•\tPerformed the patent, trademark, and copyright research required to solidify the viability of the Navstar voice-navigation technology, communications copyrights, and company trademark. Worked with the company’s law firm to maneuver through the patent evaluation process in order to solidify our technology position in the marketplace  \n•\tConducted regular market research in order to identify the most appropriate mobile phone models in the marketplace to support with the Navstar navigation system. Worked with the appropriate mobile carriers (Sprint, Verizon, AT&T, etc.) and handset manufacturers (Samsung, Motorola, Palm, etc.) to effectively integrate these handsets into our navigation system \n•\tConducted system testing by using the various mobile phone models to request and receive driving directions, as I drove throughout various cities in the US – validating that the system components worked correctly and the driving directions were accurate Director - Product & Support Operations Navstar Technologies, Inc. 2003  –  2005  (2 years) Overland Park, Kansas A wireless telecom start-up company that developed a GPS-based, voice-based, vehicle navigation system which connects to the Navstar mapping and navigation servers using the driver’s mobile phone. The unit receives verbal instructions from the driver, uses the mobile phone to transmit the driver’s verbal instructions to the servers, and responds to the driver with audio directions, from the servers, to the desired destination. \n \n•\tResearched, identified, established, and managed the legal and business relationships with our call center/customer care and fulfillment operations business partners in order to direct, collaborate with, and coordinate their resources and activities to support Navstar \n•\tLed cross-company teams to identify, develop, and document the business and operational processes for training the call center/customer care reps, customizing the call center software, identifying data elements for the Customer Master Record, and establishing product distribution, fulfillment, and returns procedures with our partners \n•\tPerformed the patent, trademark, and copyright research required to solidify the viability of the Navstar voice-navigation technology, communications copyrights, and company trademark. Worked with the company’s law firm to maneuver through the patent evaluation process in order to solidify our technology position in the marketplace  \n•\tConducted regular market research in order to identify the most appropriate mobile phone models in the marketplace to support with the Navstar navigation system. Worked with the appropriate mobile carriers (Sprint, Verizon, AT&T, etc.) and handset manufacturers (Samsung, Motorola, Palm, etc.) to effectively integrate these handsets into our navigation system \n•\tConducted system testing by using the various mobile phone models to request and receive driving directions, as I drove throughout various cities in the US – validating that the system components worked correctly and the driving directions were accurate Program Manager IBM - Personal Computing Division 1993  –  2002  (9 years) Located in Research Triangle Park, NC \n \n•\tSegment Marketing Program Manager - IBM PC Direct \nDeveloped and managed segment-specific products, programs and messaging for selling IBM PC products and services to consumers and small/medium businesses on ibm.com. Contributed significantly to our $1B in online sales. \n•\tCommunications Manager – PCD Chief Technology Officer \nProvided worldwide communications management, consulting, and support for the division’s Chief Technology Officer: developed technology presentations; wrote technology articles for internal and external publications; developed technology press releases; developed, managed and produced informational videos promoting the division’s emerging technology and product development capabilities; assisted CTO with various partner, channel, media, press, and technology events, worldwide. \n• Marketing Program Manager – IBM Consumer Division \nMarketing program manager and liaison between the Consumer Division W/W team and the Consumer Division’s Europe/Middle East/Africa (EMEA) geography team in London. Charged with communicating, coordinating, managing and resolving the EMEA product, marketing, and channel processes, requirements, strategies, programs and issues with the W/W product team, in order to effectively compete with Dell & other major PC vendors in Europe.  \n•\tProduct Line Manager – IBM Direct \nManaged the non-IBM branded PC products, software, and accessories we sold through IBM Direct, the PC Division’s direct sales & fulfillment organization. Managed the internal-IBM program team, vendor relationships, and the various relationship functions and activities with Merisel - our national product distributor and non-IBM product ordering and fulfillment partner. Program Manager IBM - Personal Computing Division 1993  –  2002  (9 years) Located in Research Triangle Park, NC \n \n•\tSegment Marketing Program Manager - IBM PC Direct \nDeveloped and managed segment-specific products, programs and messaging for selling IBM PC products and services to consumers and small/medium businesses on ibm.com. Contributed significantly to our $1B in online sales. \n•\tCommunications Manager – PCD Chief Technology Officer \nProvided worldwide communications management, consulting, and support for the division’s Chief Technology Officer: developed technology presentations; wrote technology articles for internal and external publications; developed technology press releases; developed, managed and produced informational videos promoting the division’s emerging technology and product development capabilities; assisted CTO with various partner, channel, media, press, and technology events, worldwide. \n• Marketing Program Manager – IBM Consumer Division \nMarketing program manager and liaison between the Consumer Division W/W team and the Consumer Division’s Europe/Middle East/Africa (EMEA) geography team in London. Charged with communicating, coordinating, managing and resolving the EMEA product, marketing, and channel processes, requirements, strategies, programs and issues with the W/W product team, in order to effectively compete with Dell & other major PC vendors in Europe.  \n•\tProduct Line Manager – IBM Direct \nManaged the non-IBM branded PC products, software, and accessories we sold through IBM Direct, the PC Division’s direct sales & fulfillment organization. Managed the internal-IBM program team, vendor relationships, and the various relationship functions and activities with Merisel - our national product distributor and non-IBM product ordering and fulfillment partner. Sales Support & Account Development Toshiba America Information Systems 1986  –  1992  (6 years) • Sales Support Representative \nManaged the sales support activities and the distributor/retailer relationships in a 4-state territory for Toshiba America’s laptop and portable computing division. Received the Rookie of the Year award. \n• Sales Support Manager \nManaged the sales support activities of 6 Sales Support Representatives in a 12-state region. Managed 6 Sales Support Representatives. We received the annual Regional Excellence Award. \n• Account Development Executive  \nEstablished and managed relationships with large corporate accounts for the purpose of selling and supporting Toshiba printing and laptop/portable computing products and solutions within these companies. Sales Support & Account Development Toshiba America Information Systems 1986  –  1992  (6 years) • Sales Support Representative \nManaged the sales support activities and the distributor/retailer relationships in a 4-state territory for Toshiba America’s laptop and portable computing division. Received the Rookie of the Year award. \n• Sales Support Manager \nManaged the sales support activities of 6 Sales Support Representatives in a 12-state region. Managed 6 Sales Support Representatives. We received the annual Regional Excellence Award. \n• Account Development Executive  \nEstablished and managed relationships with large corporate accounts for the purpose of selling and supporting Toshiba printing and laptop/portable computing products and solutions within these companies. Skills Program Management Sales Operations Strategic Planning Team Leadership Process Simulation Business Strategy Start-ups Management Product Management Product Development Market Research Strategic Partnerships Entrepreneurship Business Development Product Marketing Business Analysis Project Planning Integration Project Management Marketing Strategy Analytics Strategy Cross-functional Team... Direct Sales Process Improvement Team Building Leadership Vendor Management Business Process... Business Planning Business Process Training Sales Budgets Marketing Mobile Devices CRM Selling Pre-sales Security Consulting SaaS Cloud Computing Enterprise Software Competitive Analysis Business Intelligence Salesforce.com See 32+     See less Skills  Program Management Sales Operations Strategic Planning Team Leadership Process Simulation Business Strategy Start-ups Management Product Management Product Development Market Research Strategic Partnerships Entrepreneurship Business Development Product Marketing Business Analysis Project Planning Integration Project Management Marketing Strategy Analytics Strategy Cross-functional Team... Direct Sales Process Improvement Team Building Leadership Vendor Management Business Process... Business Planning Business Process Training Sales Budgets Marketing Mobile Devices CRM Selling Pre-sales Security Consulting SaaS Cloud Computing Enterprise Software Competitive Analysis Business Intelligence Salesforce.com See 32+     See less Program Management Sales Operations Strategic Planning Team Leadership Process Simulation Business Strategy Start-ups Management Product Management Product Development Market Research Strategic Partnerships Entrepreneurship Business Development Product Marketing Business Analysis Project Planning Integration Project Management Marketing Strategy Analytics Strategy Cross-functional Team... Direct Sales Process Improvement Team Building Leadership Vendor Management Business Process... Business Planning Business Process Training Sales Budgets Marketing Mobile Devices CRM Selling Pre-sales Security Consulting SaaS Cloud Computing Enterprise Software Competitive Analysis Business Intelligence Salesforce.com See 32+     See less Program Management Sales Operations Strategic Planning Team Leadership Process Simulation Business Strategy Start-ups Management Product Management Product Development Market Research Strategic Partnerships Entrepreneurship Business Development Product Marketing Business Analysis Project Planning Integration Project Management Marketing Strategy Analytics Strategy Cross-functional Team... Direct Sales Process Improvement Team Building Leadership Vendor Management Business Process... Business Planning Business Process Training Sales Budgets Marketing Mobile Devices CRM Selling Pre-sales Security Consulting SaaS Cloud Computing Enterprise Software Competitive Analysis Business Intelligence Salesforce.com See 32+     See less Education Regent University MA,  Practical Theology 1998  – 2001 University of Missouri-Saint Louis BS,  Business Adminsitration 1983  – 1985 Center High School Regent University MA,  Practical Theology 1998  – 2001 Regent University MA,  Practical Theology 1998  – 2001 Regent University MA,  Practical Theology 1998  – 2001 University of Missouri-Saint Louis BS,  Business Adminsitration 1983  – 1985 University of Missouri-Saint Louis BS,  Business Adminsitration 1983  – 1985 University of Missouri-Saint Louis BS,  Business Adminsitration 1983  – 1985 Center High School Center High School Center High School Honors & Awards ", "Experience WW System x High Volume Marketing Program Manager IBM February 2013  – Present (2 years 7 months) WW System x High Volume Pricing IBM August 2010  –  January 2013  (2 years 6 months) WW System x Options Pricing IBM June 2008  –  July 2010  (2 years 2 months) WW System x High Volume Marketing Program Manager IBM February 2013  – Present (2 years 7 months) WW System x High Volume Marketing Program Manager IBM February 2013  – Present (2 years 7 months) WW System x High Volume Pricing IBM August 2010  –  January 2013  (2 years 6 months) WW System x High Volume Pricing IBM August 2010  –  January 2013  (2 years 6 months) WW System x Options Pricing IBM June 2008  –  July 2010  (2 years 2 months) WW System x Options Pricing IBM June 2008  –  July 2010  (2 years 2 months) Skills Business Analysis Financial Analysis Financial Modeling Forecasting Analysis Business Intelligence Finance System X Competitive Analysis Analytics Cross-functional Team... Skills  Business Analysis Financial Analysis Financial Modeling Forecasting Analysis Business Intelligence Finance System X Competitive Analysis Analytics Cross-functional Team... Business Analysis Financial Analysis Financial Modeling Forecasting Analysis Business Intelligence Finance System X Competitive Analysis Analytics Cross-functional Team... Business Analysis Financial Analysis Financial Modeling Forecasting Analysis Business Intelligence Finance System X Competitive Analysis Analytics Cross-functional Team... Education SUNY at Buffalo Master's degree,  Business Administration and Management , General 2006  – 2008 St. Bonaventure University Bachelor of Arts (B.A.),  Political Science and Government 2002  – 2006 SUNY at Buffalo Master's degree,  Business Administration and Management , General 2006  – 2008 SUNY at Buffalo Master's degree,  Business Administration and Management , General 2006  – 2008 SUNY at Buffalo Master's degree,  Business Administration and Management , General 2006  – 2008 St. Bonaventure University Bachelor of Arts (B.A.),  Political Science and Government 2002  – 2006 St. Bonaventure University Bachelor of Arts (B.A.),  Political Science and Government 2002  – 2006 St. Bonaventure University Bachelor of Arts (B.A.),  Political Science and Government 2002  – 2006 ", "Experience Senior Program Manager, In support of IBM North America Events George P Johnson Experience Marketing October 2014  – Present (11 months) Event Process Manager George P Johnson July 2003  –  September 2014  (11 years 3 months) Financial Management: Manage overall finances for IBMs SWG Event Programs and drive quarterly and year end closing process. Including: \n-Mapping quarterly spends and invoicing schedules for every event; Reconciling overall event budgets by program; Summarizing PO requests and monitoring PO process, receipt, close out; Ensuring audit compliance \n–Target: All final billings and/or progress bills completed by quarter end for assigned programs, ensuring clients have funds to use in appropriate quarters \nEducation: Proactively identify education gaps and develop training modules to educate both internal GPJ teams and IBM team on Event Process Sr. Event Project Manager George P Johnson 2005  –  2006  (1 year) Worked in conjunction with the extended events team, responsibilities include the day-to-day management of the Logistics, Exhibits and Execution Teams, overall project management of IBMs participation at tradeshows, roadshows and conferences, ensuring that all of the client’s needs are met while maintaining the professional standards that GPJ/IBM has set as well as communicating with customers, management, internal departments, and vendors to coordinate overall marketing efforts in accordance with corporate goals. Prepare and manage up to $1-million event marketing budgets. \n \nDetermined scope of project and align team accordingly \nPrimary client contact for event execution operations \nManage all the event messaging, design, graphic and logistic elements of the event from development through complete execution. Ensure marketing campaigns are incorporated in all event activities \nTimeline development and management \nIdentify end to end lead management process \nCost savings and avoidance practices \nCollaborate with Event Management on maintaining company policies procedures and developing/documenting new procedures where necessary \nNegotiate all event contracts with show producers \nIdentify event registration requirements and initiate as appropriate \nOnsite event management, conduct onsite audits of IBM and its competitors \nCreate and communicate post event analysis Event Marketing Program Manager IBM 2000  –  2003  (3 years) Managed Storage Business Unit Event plan for the year and executed each project from development to completion  \nExecuted activities specifically developed to assist NA Sales & Distribution in attaining overall Marketing Communications revenue targets.  \nManaged relationship with show producers and related event vendors \nTeamed closely with Communications and PR to secure speaking engagements and to link with Corporate speaking plan for the year \nDeveloped appropriate messaging and deliverables with Geography Marketing team on an event to event basis \nDeveloped and managed customer reference database to effectively provide high quality sales material to internal sales force and business partners \nManaged content for the Storage Business Unit Internet and Intranet sites \nGenerated marketing campaigns to link with product offerings and promotions. Associate Marketing Program Manager IBM 1996  –  2000  (4 years) San Jose, CA Senior Program Manager, In support of IBM North America Events George P Johnson Experience Marketing October 2014  – Present (11 months) Senior Program Manager, In support of IBM North America Events George P Johnson Experience Marketing October 2014  – Present (11 months) Event Process Manager George P Johnson July 2003  –  September 2014  (11 years 3 months) Financial Management: Manage overall finances for IBMs SWG Event Programs and drive quarterly and year end closing process. Including: \n-Mapping quarterly spends and invoicing schedules for every event; Reconciling overall event budgets by program; Summarizing PO requests and monitoring PO process, receipt, close out; Ensuring audit compliance \n–Target: All final billings and/or progress bills completed by quarter end for assigned programs, ensuring clients have funds to use in appropriate quarters \nEducation: Proactively identify education gaps and develop training modules to educate both internal GPJ teams and IBM team on Event Process Event Process Manager George P Johnson July 2003  –  September 2014  (11 years 3 months) Financial Management: Manage overall finances for IBMs SWG Event Programs and drive quarterly and year end closing process. Including: \n-Mapping quarterly spends and invoicing schedules for every event; Reconciling overall event budgets by program; Summarizing PO requests and monitoring PO process, receipt, close out; Ensuring audit compliance \n–Target: All final billings and/or progress bills completed by quarter end for assigned programs, ensuring clients have funds to use in appropriate quarters \nEducation: Proactively identify education gaps and develop training modules to educate both internal GPJ teams and IBM team on Event Process Sr. Event Project Manager George P Johnson 2005  –  2006  (1 year) Worked in conjunction with the extended events team, responsibilities include the day-to-day management of the Logistics, Exhibits and Execution Teams, overall project management of IBMs participation at tradeshows, roadshows and conferences, ensuring that all of the client’s needs are met while maintaining the professional standards that GPJ/IBM has set as well as communicating with customers, management, internal departments, and vendors to coordinate overall marketing efforts in accordance with corporate goals. Prepare and manage up to $1-million event marketing budgets. \n \nDetermined scope of project and align team accordingly \nPrimary client contact for event execution operations \nManage all the event messaging, design, graphic and logistic elements of the event from development through complete execution. Ensure marketing campaigns are incorporated in all event activities \nTimeline development and management \nIdentify end to end lead management process \nCost savings and avoidance practices \nCollaborate with Event Management on maintaining company policies procedures and developing/documenting new procedures where necessary \nNegotiate all event contracts with show producers \nIdentify event registration requirements and initiate as appropriate \nOnsite event management, conduct onsite audits of IBM and its competitors \nCreate and communicate post event analysis Sr. Event Project Manager George P Johnson 2005  –  2006  (1 year) Worked in conjunction with the extended events team, responsibilities include the day-to-day management of the Logistics, Exhibits and Execution Teams, overall project management of IBMs participation at tradeshows, roadshows and conferences, ensuring that all of the client’s needs are met while maintaining the professional standards that GPJ/IBM has set as well as communicating with customers, management, internal departments, and vendors to coordinate overall marketing efforts in accordance with corporate goals. Prepare and manage up to $1-million event marketing budgets. \n \nDetermined scope of project and align team accordingly \nPrimary client contact for event execution operations \nManage all the event messaging, design, graphic and logistic elements of the event from development through complete execution. Ensure marketing campaigns are incorporated in all event activities \nTimeline development and management \nIdentify end to end lead management process \nCost savings and avoidance practices \nCollaborate with Event Management on maintaining company policies procedures and developing/documenting new procedures where necessary \nNegotiate all event contracts with show producers \nIdentify event registration requirements and initiate as appropriate \nOnsite event management, conduct onsite audits of IBM and its competitors \nCreate and communicate post event analysis Event Marketing Program Manager IBM 2000  –  2003  (3 years) Managed Storage Business Unit Event plan for the year and executed each project from development to completion  \nExecuted activities specifically developed to assist NA Sales & Distribution in attaining overall Marketing Communications revenue targets.  \nManaged relationship with show producers and related event vendors \nTeamed closely with Communications and PR to secure speaking engagements and to link with Corporate speaking plan for the year \nDeveloped appropriate messaging and deliverables with Geography Marketing team on an event to event basis \nDeveloped and managed customer reference database to effectively provide high quality sales material to internal sales force and business partners \nManaged content for the Storage Business Unit Internet and Intranet sites \nGenerated marketing campaigns to link with product offerings and promotions. Event Marketing Program Manager IBM 2000  –  2003  (3 years) Managed Storage Business Unit Event plan for the year and executed each project from development to completion  \nExecuted activities specifically developed to assist NA Sales & Distribution in attaining overall Marketing Communications revenue targets.  \nManaged relationship with show producers and related event vendors \nTeamed closely with Communications and PR to secure speaking engagements and to link with Corporate speaking plan for the year \nDeveloped appropriate messaging and deliverables with Geography Marketing team on an event to event basis \nDeveloped and managed customer reference database to effectively provide high quality sales material to internal sales force and business partners \nManaged content for the Storage Business Unit Internet and Intranet sites \nGenerated marketing campaigns to link with product offerings and promotions. Associate Marketing Program Manager IBM 1996  –  2000  (4 years) San Jose, CA Associate Marketing Program Manager IBM 1996  –  2000  (4 years) San Jose, CA Languages Spanish Spanish Spanish Skills Relationship Marketing Event Management Marketing Communications Trade Shows Marketing Integrated Marketing Event Planning Corporate Events Program Management Digital Marketing Live Events Management Project Management Budgets Marketing Strategy Social Media Marketing Sales Sponsorship Graphic Design Training Lead Generation Public Relations Direct Marketing Meeting Planning Email Marketing Competitive Analysis Demand Generation See 12+     See less Skills  Relationship Marketing Event Management Marketing Communications Trade Shows Marketing Integrated Marketing Event Planning Corporate Events Program Management Digital Marketing Live Events Management Project Management Budgets Marketing Strategy Social Media Marketing Sales Sponsorship Graphic Design Training Lead Generation Public Relations Direct Marketing Meeting Planning Email Marketing Competitive Analysis Demand Generation See 12+     See less Relationship Marketing Event Management Marketing Communications Trade Shows Marketing Integrated Marketing Event Planning Corporate Events Program Management Digital Marketing Live Events Management Project Management Budgets Marketing Strategy Social Media Marketing Sales Sponsorship Graphic Design Training Lead Generation Public Relations Direct Marketing Meeting Planning Email Marketing Competitive Analysis Demand Generation See 12+     See less Relationship Marketing Event Management Marketing Communications Trade Shows Marketing Integrated Marketing Event Planning Corporate Events Program Management Digital Marketing Live Events Management Project Management Budgets Marketing Strategy Social Media Marketing Sales Sponsorship Graphic Design Training Lead Generation Public Relations Direct Marketing Meeting Planning Email Marketing Competitive Analysis Demand Generation See 12+     See less Education San Jose State University BS,  Business Communications ,  Marketing 2000 De Anza College Associate Degree,  Liberal Arts San Jose State University BS,  Business Communications ,  Marketing 2000 San Jose State University BS,  Business Communications ,  Marketing 2000 San Jose State University BS,  Business Communications ,  Marketing 2000 De Anza College Associate Degree,  Liberal Arts De Anza College Associate Degree,  Liberal Arts De Anza College Associate Degree,  Liberal Arts "]}