{"position": "Marketing Writer", "company": "IBM", "profiles": ["Skills Freelance Writing Marketing Communications Public Speaking Corporate Communications Internal Communications Content Development Social Media Marketing Content Management Web Content Management Copywriting Marketing Strategy Strategic Communications Copy Editing Creative Problem Solving Email Marketing Online Marketing Advertising Integrated Marketing Direct Marketing Strategic Planning Creative Writing Interviewing Public Relations Marketing Editing Creative Direction Leadership B2B Entrepreneurship Creative Strategy Content Strategy Management Web Content Digital Marketing Newsletters Press Releases Corporate Branding Media Relations Social Media Social Networking SEO New Media Editorial See 28+     See less Skills  Freelance Writing Marketing Communications Public Speaking Corporate Communications Internal Communications Content Development Social Media Marketing Content Management Web Content Management Copywriting Marketing Strategy Strategic Communications Copy Editing Creative Problem Solving Email Marketing Online Marketing Advertising Integrated Marketing Direct Marketing Strategic Planning Creative Writing Interviewing Public Relations Marketing Editing Creative Direction Leadership B2B Entrepreneurship Creative Strategy Content Strategy Management Web Content Digital Marketing Newsletters Press Releases Corporate Branding Media Relations Social Media Social Networking SEO New Media Editorial See 28+     See less Freelance Writing Marketing Communications Public Speaking Corporate Communications Internal Communications Content Development Social Media Marketing Content Management Web Content Management Copywriting Marketing Strategy Strategic Communications Copy Editing Creative Problem Solving Email Marketing Online Marketing Advertising Integrated Marketing Direct Marketing Strategic Planning Creative Writing Interviewing Public Relations Marketing Editing Creative Direction Leadership B2B Entrepreneurship Creative Strategy Content Strategy Management Web Content Digital Marketing Newsletters Press Releases Corporate Branding Media Relations Social Media Social Networking SEO New Media Editorial See 28+     See less Freelance Writing Marketing Communications Public Speaking Corporate Communications Internal Communications Content Development Social Media Marketing Content Management Web Content Management Copywriting Marketing Strategy Strategic Communications Copy Editing Creative Problem Solving Email Marketing Online Marketing Advertising Integrated Marketing Direct Marketing Strategic Planning Creative Writing Interviewing Public Relations Marketing Editing Creative Direction Leadership B2B Entrepreneurship Creative Strategy Content Strategy Management Web Content Digital Marketing Newsletters Press Releases Corporate Branding Media Relations Social Media Social Networking SEO New Media Editorial See 28+     See less Honors & Awards ", "Summary Strategic writer of powerful, targeted content for a wide range of industries and channels. Quality obsessed, but not if it holds up a project. Nice balance of humor and seriousness. Very team oriented. Love to mentor, brainstorm, collaborate, but work fast and efficiently either way. \n \nTake a minute to view a small sampling of my work at: SWingwriter.journoportfolio.com.  Summary Strategic writer of powerful, targeted content for a wide range of industries and channels. Quality obsessed, but not if it holds up a project. Nice balance of humor and seriousness. Very team oriented. Love to mentor, brainstorm, collaborate, but work fast and efficiently either way. \n \nTake a minute to view a small sampling of my work at: SWingwriter.journoportfolio.com.  Strategic writer of powerful, targeted content for a wide range of industries and channels. Quality obsessed, but not if it holds up a project. Nice balance of humor and seriousness. Very team oriented. Love to mentor, brainstorm, collaborate, but work fast and efficiently either way. \n \nTake a minute to view a small sampling of my work at: SWingwriter.journoportfolio.com.  Strategic writer of powerful, targeted content for a wide range of industries and channels. Quality obsessed, but not if it holds up a project. Nice balance of humor and seriousness. Very team oriented. Love to mentor, brainstorm, collaborate, but work fast and efficiently either way. \n \nTake a minute to view a small sampling of my work at: SWingwriter.journoportfolio.com.  Languages French French French Skills Email Marketing Marketing Communications Copywriting Product Marketing Public Relations Market Research Marketing Start-ups Strategic Communications Content Development Social Media Marketing Strategy Articles Public Speaking Web Marketing Leadership Editing Press Releases CRM Online Marketing Social Media Blogging Digital Marketing E-commerce Online Advertising SEO Lead Generation Content Management Digital Strategy B2B Google Analytics Corporate Communications Web Analytics Web Content B2B Marketing Event Management Advertising Content Marketing Media Relations PPC SEM Direct Marketing Digital Media Brand Development Integrated Marketing See 30+     See less Skills  Email Marketing Marketing Communications Copywriting Product Marketing Public Relations Market Research Marketing Start-ups Strategic Communications Content Development Social Media Marketing Strategy Articles Public Speaking Web Marketing Leadership Editing Press Releases CRM Online Marketing Social Media Blogging Digital Marketing E-commerce Online Advertising SEO Lead Generation Content Management Digital Strategy B2B Google Analytics Corporate Communications Web Analytics Web Content B2B Marketing Event Management Advertising Content Marketing Media Relations PPC SEM Direct Marketing Digital Media Brand Development Integrated Marketing See 30+     See less Email Marketing Marketing Communications Copywriting Product Marketing Public Relations Market Research Marketing Start-ups Strategic Communications Content Development Social Media Marketing Strategy Articles Public Speaking Web Marketing Leadership Editing Press Releases CRM Online Marketing Social Media Blogging Digital Marketing E-commerce Online Advertising SEO Lead Generation Content Management Digital Strategy B2B Google Analytics Corporate Communications Web Analytics Web Content B2B Marketing Event Management Advertising Content Marketing Media Relations PPC SEM Direct Marketing Digital Media Brand Development Integrated Marketing See 30+     See less Email Marketing Marketing Communications Copywriting Product Marketing Public Relations Market Research Marketing Start-ups Strategic Communications Content Development Social Media Marketing Strategy Articles Public Speaking Web Marketing Leadership Editing Press Releases CRM Online Marketing Social Media Blogging Digital Marketing E-commerce Online Advertising SEO Lead Generation Content Management Digital Strategy B2B Google Analytics Corporate Communications Web Analytics Web Content B2B Marketing Event Management Advertising Content Marketing Media Relations PPC SEM Direct Marketing Digital Media Brand Development Integrated Marketing See 30+     See less ", "Summary I write therefore I am. Communications professional and storyteller. Core interests: \n \nMarketing collateral development and design \nPublic relations \nMedia outreach \nBranding \nEvents \nInternal communications \nEssay writing \nBlogging Summary I write therefore I am. Communications professional and storyteller. Core interests: \n \nMarketing collateral development and design \nPublic relations \nMedia outreach \nBranding \nEvents \nInternal communications \nEssay writing \nBlogging I write therefore I am. Communications professional and storyteller. Core interests: \n \nMarketing collateral development and design \nPublic relations \nMedia outreach \nBranding \nEvents \nInternal communications \nEssay writing \nBlogging I write therefore I am. Communications professional and storyteller. Core interests: \n \nMarketing collateral development and design \nPublic relations \nMedia outreach \nBranding \nEvents \nInternal communications \nEssay writing \nBlogging Experience Manager - Communications Nihilent Technologies July 2013  – Present (2 years 2 months) Pune Summary: Leading all communications activities. PR, Media, Advertising, Events, Collateral development, Marcom strategy, internal communications. Contributing Writer MarketExpress February 2013  – Present (2 years 7 months) Write-ups on communications and technology Manager - Communications Nihilent Technologies July 2013  – Present (2 years 2 months) Pune Summary: Leading all communications activities. PR, Media, Advertising, Events, Collateral development, Marcom strategy, internal communications. Manager - Communications Nihilent Technologies July 2013  – Present (2 years 2 months) Pune Summary: Leading all communications activities. PR, Media, Advertising, Events, Collateral development, Marcom strategy, internal communications. Contributing Writer MarketExpress February 2013  – Present (2 years 7 months) Write-ups on communications and technology Contributing Writer MarketExpress February 2013  – Present (2 years 7 months) Write-ups on communications and technology Languages English Full professional proficiency Kannada Native or bilingual proficiency Tamil Limited working proficiency Telugu Limited working proficiency Hindi Limited working proficiency Marathi Elementary proficiency English Full professional proficiency Kannada Native or bilingual proficiency Tamil Limited working proficiency Telugu Limited working proficiency Hindi Limited working proficiency Marathi Elementary proficiency English Full professional proficiency Kannada Native or bilingual proficiency Tamil Limited working proficiency Telugu Limited working proficiency Hindi Limited working proficiency Marathi Elementary proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Limited working proficiency Elementary proficiency Skills Marketing Communications Creative Writing Market Research Marketing Research Web Content Internal Communications Social Media Marketing Business Analysis Advertising Strategy Data Analysis Microsoft Excel Content Development Training Analysis Public Relations Blogging Excel PowerPoint Web Analytics Teaching Video Script Writing Ghostwriting Press Releases Copy Editing Media Relations Strategic Communications See 12+     See less Skills  Marketing Communications Creative Writing Market Research Marketing Research Web Content Internal Communications Social Media Marketing Business Analysis Advertising Strategy Data Analysis Microsoft Excel Content Development Training Analysis Public Relations Blogging Excel PowerPoint Web Analytics Teaching Video Script Writing Ghostwriting Press Releases Copy Editing Media Relations Strategic Communications See 12+     See less Marketing Communications Creative Writing Market Research Marketing Research Web Content Internal Communications Social Media Marketing Business Analysis Advertising Strategy Data Analysis Microsoft Excel Content Development Training Analysis Public Relations Blogging Excel PowerPoint Web Analytics Teaching Video Script Writing Ghostwriting Press Releases Copy Editing Media Relations Strategic Communications See 12+     See less Marketing Communications Creative Writing Market Research Marketing Research Web Content Internal Communications Social Media Marketing Business Analysis Advertising Strategy Data Analysis Microsoft Excel Content Development Training Analysis Public Relations Blogging Excel PowerPoint Web Analytics Teaching Video Script Writing Ghostwriting Press Releases Copy Editing Media Relations Strategic Communications See 12+     See less ", "Experience Marketing writer IBM January 2002  – Present (13 years 8 months) Marketing writer IBM January 2002  – Present (13 years 8 months) Marketing writer IBM January 2002  – Present (13 years 8 months) Skills Web Content Copywriting Copy Editing Technical Writing Content Management Content Development Blogging Newsletters Editing Corporate Communications Internal Communications Web Content Management Press Releases Content Strategy Technical Communication Proofreading See 1+     See less Skills  Web Content Copywriting Copy Editing Technical Writing Content Management Content Development Blogging Newsletters Editing Corporate Communications Internal Communications Web Content Management Press Releases Content Strategy Technical Communication Proofreading See 1+     See less Web Content Copywriting Copy Editing Technical Writing Content Management Content Development Blogging Newsletters Editing Corporate Communications Internal Communications Web Content Management Press Releases Content Strategy Technical Communication Proofreading See 1+     See less Web Content Copywriting Copy Editing Technical Writing Content Management Content Development Blogging Newsletters Editing Corporate Communications Internal Communications Web Content Management Press Releases Content Strategy Technical Communication Proofreading See 1+     See less Education Campbell University A.A.,  General Studies North Carolina State University B.A. Speech Communication,  Journalism Campbell University A.A.,  General Studies Campbell University A.A.,  General Studies Campbell University A.A.,  General Studies North Carolina State University B.A. Speech Communication,  Journalism North Carolina State University B.A. Speech Communication,  Journalism North Carolina State University B.A. Speech Communication,  Journalism ", "Skills Email Marketing Newsletters Press Releases Direct Marketing Web Content Editing Content Strategy B2B Marketing Proofreading Copywriting Content Development Marketing Blogging Copy Editing Corporate Communications Content Management Internal Communications See 2+     See less Skills  Email Marketing Newsletters Press Releases Direct Marketing Web Content Editing Content Strategy B2B Marketing Proofreading Copywriting Content Development Marketing Blogging Copy Editing Corporate Communications Content Management Internal Communications See 2+     See less Email Marketing Newsletters Press Releases Direct Marketing Web Content Editing Content Strategy B2B Marketing Proofreading Copywriting Content Development Marketing Blogging Copy Editing Corporate Communications Content Management Internal Communications See 2+     See less Email Marketing Newsletters Press Releases Direct Marketing Web Content Editing Content Strategy B2B Marketing Proofreading Copywriting Content Development Marketing Blogging Copy Editing Corporate Communications Content Management Internal Communications See 2+     See less ", "", "Summary - Content development \n- Technical writer \n- Style guides \n- Wiki \n- User manuals \n- Cloud analytics subject matter expert \n- Content marketing \n- Digital marketing Summary - Content development \n- Technical writer \n- Style guides \n- Wiki \n- User manuals \n- Cloud analytics subject matter expert \n- Content marketing \n- Digital marketing - Content development \n- Technical writer \n- Style guides \n- Wiki \n- User manuals \n- Cloud analytics subject matter expert \n- Content marketing \n- Digital marketing - Content development \n- Technical writer \n- Style guides \n- Wiki \n- User manuals \n- Cloud analytics subject matter expert \n- Content marketing \n- Digital marketing Experience Information developer and content lead, ITSO & Watson Analytics, IBM IBM October 2012  – Present (2 years 11 months) Create, manage and apply content strategies to promote Web pages, white papers, internal newsletters, data sheets, solution briefs, brochures, flyers, points of view, presentations, demand-gen e-mails, product demos and videos. Marketing Writer IBM 2006  –  2012  (6 years) Wrote and edited web pages, landing pages, white papers, data sheets, solution briefs, demand-gen emails, flyers, brochures and blogs for a wide range of IBM divisions. In addition, wrote and promoted marketing content for IBM Business Analytics software with a concentration in Business Intelligence. Marketing Project Manager NC Cuthbert, LLC 2002  –  2008  (6 years) Managed systems integration projects, marketed systems integration company, produced promotional materials and online help for a Web-based application that is still used to track trucks and containers through the Napoleon Avenue Container Terminal in New Orleans, LA. Redbooks Editor IBM September 2004  –  January 2006  (1 year 5 months) Research Triangle Park< NC Edited and produced Redbooks publications. Technical Writer Arcadis 2002  –  2003  (1 year) Wrote, edited, designed and produced marketing and business development proposals. Edited environmental impact reports and other documentation related to transportation, civil, waste water treatment and environmental engineering. Senior Writer Tompkins Associates 1999  –  2002  (3 years) Wrote and edited articles, blogs, books and proposals for Tompkins Press and Jim Tompkins. Project Team Leader Kudos Information, Inc 2000  –  2001  (1 year) Managed project and team for Nortel documentation projects. Publishing Team Leader for Nortel e-Publishing 2000  –  2001  (1 year) Managed team and tasks for Nortel documentation projects. Book Editor Institute of Industrial Engineers May 1995  –  August 1997  (2 years 4 months) Edited and marketed books for the Engineering and Management Press, a division of the Institute of Industrial Engineers. Information developer and content lead, ITSO & Watson Analytics, IBM IBM October 2012  – Present (2 years 11 months) Create, manage and apply content strategies to promote Web pages, white papers, internal newsletters, data sheets, solution briefs, brochures, flyers, points of view, presentations, demand-gen e-mails, product demos and videos. Information developer and content lead, ITSO & Watson Analytics, IBM IBM October 2012  – Present (2 years 11 months) Create, manage and apply content strategies to promote Web pages, white papers, internal newsletters, data sheets, solution briefs, brochures, flyers, points of view, presentations, demand-gen e-mails, product demos and videos. Marketing Writer IBM 2006  –  2012  (6 years) Wrote and edited web pages, landing pages, white papers, data sheets, solution briefs, demand-gen emails, flyers, brochures and blogs for a wide range of IBM divisions. In addition, wrote and promoted marketing content for IBM Business Analytics software with a concentration in Business Intelligence. Marketing Writer IBM 2006  –  2012  (6 years) Wrote and edited web pages, landing pages, white papers, data sheets, solution briefs, demand-gen emails, flyers, brochures and blogs for a wide range of IBM divisions. In addition, wrote and promoted marketing content for IBM Business Analytics software with a concentration in Business Intelligence. Marketing Project Manager NC Cuthbert, LLC 2002  –  2008  (6 years) Managed systems integration projects, marketed systems integration company, produced promotional materials and online help for a Web-based application that is still used to track trucks and containers through the Napoleon Avenue Container Terminal in New Orleans, LA. Marketing Project Manager NC Cuthbert, LLC 2002  –  2008  (6 years) Managed systems integration projects, marketed systems integration company, produced promotional materials and online help for a Web-based application that is still used to track trucks and containers through the Napoleon Avenue Container Terminal in New Orleans, LA. Redbooks Editor IBM September 2004  –  January 2006  (1 year 5 months) Research Triangle Park< NC Edited and produced Redbooks publications. Redbooks Editor IBM September 2004  –  January 2006  (1 year 5 months) Research Triangle Park< NC Edited and produced Redbooks publications. Technical Writer Arcadis 2002  –  2003  (1 year) Wrote, edited, designed and produced marketing and business development proposals. Edited environmental impact reports and other documentation related to transportation, civil, waste water treatment and environmental engineering. Technical Writer Arcadis 2002  –  2003  (1 year) Wrote, edited, designed and produced marketing and business development proposals. Edited environmental impact reports and other documentation related to transportation, civil, waste water treatment and environmental engineering. Senior Writer Tompkins Associates 1999  –  2002  (3 years) Wrote and edited articles, blogs, books and proposals for Tompkins Press and Jim Tompkins. Senior Writer Tompkins Associates 1999  –  2002  (3 years) Wrote and edited articles, blogs, books and proposals for Tompkins Press and Jim Tompkins. Project Team Leader Kudos Information, Inc 2000  –  2001  (1 year) Managed project and team for Nortel documentation projects. Project Team Leader Kudos Information, Inc 2000  –  2001  (1 year) Managed project and team for Nortel documentation projects. Publishing Team Leader for Nortel e-Publishing 2000  –  2001  (1 year) Managed team and tasks for Nortel documentation projects. Publishing Team Leader for Nortel e-Publishing 2000  –  2001  (1 year) Managed team and tasks for Nortel documentation projects. Book Editor Institute of Industrial Engineers May 1995  –  August 1997  (2 years 4 months) Edited and marketed books for the Engineering and Management Press, a division of the Institute of Industrial Engineers. Book Editor Institute of Industrial Engineers May 1995  –  August 1997  (2 years 4 months) Edited and marketed books for the Engineering and Management Press, a division of the Institute of Industrial Engineers. Languages Spanish Spanish Spanish Skills Leadership Marketing Publishing Content Management Technical Writing Technical Documentation Information Architecture Messaging Visio Project Management Web Content Marketing Communications Analytics Enterprise Software Software Documentation XML Web Project Management Copywriting Email Marketing Strategic Planning RoboHelp Microsoft Office Team Leadership Direct Marketing Editing Social Networking Instructional Design Marketing Strategy Public Relations Web 2.0 Microsoft Excel Online Advertising B2B Marketing Software Development Media Relations Internal Communications Social Media Marketing HTML Project Planning Proposal Writing Content Development Content Strategy Management Program Management See 29+     See less Skills  Leadership Marketing Publishing Content Management Technical Writing Technical Documentation Information Architecture Messaging Visio Project Management Web Content Marketing Communications Analytics Enterprise Software Software Documentation XML Web Project Management Copywriting Email Marketing Strategic Planning RoboHelp Microsoft Office Team Leadership Direct Marketing Editing Social Networking Instructional Design Marketing Strategy Public Relations Web 2.0 Microsoft Excel Online Advertising B2B Marketing Software Development Media Relations Internal Communications Social Media Marketing HTML Project Planning Proposal Writing Content Development Content Strategy Management Program Management See 29+     See less Leadership Marketing Publishing Content Management Technical Writing Technical Documentation Information Architecture Messaging Visio Project Management Web Content Marketing Communications Analytics Enterprise Software Software Documentation XML Web Project Management Copywriting Email Marketing Strategic Planning RoboHelp Microsoft Office Team Leadership Direct Marketing Editing Social Networking Instructional Design Marketing Strategy Public Relations Web 2.0 Microsoft Excel Online Advertising B2B Marketing Software Development Media Relations Internal Communications Social Media Marketing HTML Project Planning Proposal Writing Content Development Content Strategy Management Program Management See 29+     See less Leadership Marketing Publishing Content Management Technical Writing Technical Documentation Information Architecture Messaging Visio Project Management Web Content Marketing Communications Analytics Enterprise Software Software Documentation XML Web Project Management Copywriting Email Marketing Strategic Planning RoboHelp Microsoft Office Team Leadership Direct Marketing Editing Social Networking Instructional Design Marketing Strategy Public Relations Web 2.0 Microsoft Excel Online Advertising B2B Marketing Software Development Media Relations Internal Communications Social Media Marketing HTML Project Planning Proposal Writing Content Development Content Strategy Management Program Management See 29+     See less Education University of North Carolina at Chapel Hill Bachelor of Arts,  Radio , Television, Motion Pictures 1978  – 1982 Bishop McGuinness University of North Carolina at Chapel Hill Bachelor of Arts,  Radio , Television, Motion Pictures 1978  – 1982 University of North Carolina at Chapel Hill Bachelor of Arts,  Radio , Television, Motion Pictures 1978  – 1982 University of North Carolina at Chapel Hill Bachelor of Arts,  Radio , Television, Motion Pictures 1978  – 1982 Bishop McGuinness Bishop McGuinness Bishop McGuinness ", "Summary Extensive experience in marketing communications: writing, editing, content and project management and planning for a variety of Web, print, email and social media formats.  \n \nSpecialties: Web & Marketing Content, Communications, Project Management, Social Media, Blogging, Digital Media, Writing, Editing, Public Relations, Advertising, Journalism Summary Extensive experience in marketing communications: writing, editing, content and project management and planning for a variety of Web, print, email and social media formats.  \n \nSpecialties: Web & Marketing Content, Communications, Project Management, Social Media, Blogging, Digital Media, Writing, Editing, Public Relations, Advertising, Journalism Extensive experience in marketing communications: writing, editing, content and project management and planning for a variety of Web, print, email and social media formats.  \n \nSpecialties: Web & Marketing Content, Communications, Project Management, Social Media, Blogging, Digital Media, Writing, Editing, Public Relations, Advertising, Journalism Extensive experience in marketing communications: writing, editing, content and project management and planning for a variety of Web, print, email and social media formats.  \n \nSpecialties: Web & Marketing Content, Communications, Project Management, Social Media, Blogging, Digital Media, Writing, Editing, Public Relations, Advertising, Journalism Experience Digital Marketing Writer for IBM Global Digital Marketing IBM July 2013  – Present (2 years 2 months) Create lean web content for IBM product pages, including new acquisitions: Kenexa, Xtify, Daeja, Aspera, Silverpop, CrossIdeas, Fiberlink and Trusteer. Marketing Project Manager for Industry Solutions, IBM Software IBM June 2012  –  July 2013  (1 year 2 months) Create and project manage internal executive marketing communications and initiatives for Smarter Commerce, Smarter Cities, SmartCloud Solutions, ECM and Industry Solutions, including but not limited to sales win articles with embedded videos and blogs. PartnerWorld SMB IBM November 2002  –  April 2012  (9 years 6 months) Oversee global content and social media for PartnerWorld SMB, the IBM Web site for Business Partners selling in the midmarket. Marketing Communications IBM Corporation 1997  –  2002  (5 years) Wrote marketing and Web content for ThinkPad, Desktop, software group, and Small Business. Senior Technical Editor/Analyst MRIGlobal 1992  –  1996  (4 years) Researched and edited environmental regulatory documents prior to submission to the U.S. Environmental Protection Agency. Worked with scientists and researchers to ensure accuracy. Writer/Editor for Center for Waste Minimization Project North Carolina State University August 1989  –  July 1991  (2 years) Developed all communications and PR materials and oversaw distribution. Digital Marketing Writer for IBM Global Digital Marketing IBM July 2013  – Present (2 years 2 months) Create lean web content for IBM product pages, including new acquisitions: Kenexa, Xtify, Daeja, Aspera, Silverpop, CrossIdeas, Fiberlink and Trusteer. Digital Marketing Writer for IBM Global Digital Marketing IBM July 2013  – Present (2 years 2 months) Create lean web content for IBM product pages, including new acquisitions: Kenexa, Xtify, Daeja, Aspera, Silverpop, CrossIdeas, Fiberlink and Trusteer. Marketing Project Manager for Industry Solutions, IBM Software IBM June 2012  –  July 2013  (1 year 2 months) Create and project manage internal executive marketing communications and initiatives for Smarter Commerce, Smarter Cities, SmartCloud Solutions, ECM and Industry Solutions, including but not limited to sales win articles with embedded videos and blogs. Marketing Project Manager for Industry Solutions, IBM Software IBM June 2012  –  July 2013  (1 year 2 months) Create and project manage internal executive marketing communications and initiatives for Smarter Commerce, Smarter Cities, SmartCloud Solutions, ECM and Industry Solutions, including but not limited to sales win articles with embedded videos and blogs. PartnerWorld SMB IBM November 2002  –  April 2012  (9 years 6 months) Oversee global content and social media for PartnerWorld SMB, the IBM Web site for Business Partners selling in the midmarket. PartnerWorld SMB IBM November 2002  –  April 2012  (9 years 6 months) Oversee global content and social media for PartnerWorld SMB, the IBM Web site for Business Partners selling in the midmarket. Marketing Communications IBM Corporation 1997  –  2002  (5 years) Wrote marketing and Web content for ThinkPad, Desktop, software group, and Small Business. Marketing Communications IBM Corporation 1997  –  2002  (5 years) Wrote marketing and Web content for ThinkPad, Desktop, software group, and Small Business. Senior Technical Editor/Analyst MRIGlobal 1992  –  1996  (4 years) Researched and edited environmental regulatory documents prior to submission to the U.S. Environmental Protection Agency. Worked with scientists and researchers to ensure accuracy. Senior Technical Editor/Analyst MRIGlobal 1992  –  1996  (4 years) Researched and edited environmental regulatory documents prior to submission to the U.S. Environmental Protection Agency. Worked with scientists and researchers to ensure accuracy. Writer/Editor for Center for Waste Minimization Project North Carolina State University August 1989  –  July 1991  (2 years) Developed all communications and PR materials and oversaw distribution. Writer/Editor for Center for Waste Minimization Project North Carolina State University August 1989  –  July 1991  (2 years) Developed all communications and PR materials and oversaw distribution. Skills Marketing Communications Social Media Advertising Writing Editing Web Content Management Public Relations Digital Media Digital Marketing Content Development Marketing Copy Blogging Copywriting Email Marketing Management Corporate Communications Project Management Demand Generation Content Management Facebook Marketing Web Content Internal Communications Lead Generation Leadership Strategy Project Planning Sales Online Marketing Content Strategy Product Marketing B2B Marketing CRM Publishing Thought Leadership SEO Integrated Marketing Business Alliances SaaS Web Analytics Go-to-market Strategy Information Architecture Marketing Management Web 2.0 Enterprise Software Web Project Management E-commerce Messaging Product Management Sales Enablement See 35+     See less Skills  Marketing Communications Social Media Advertising Writing Editing Web Content Management Public Relations Digital Media Digital Marketing Content Development Marketing Copy Blogging Copywriting Email Marketing Management Corporate Communications Project Management Demand Generation Content Management Facebook Marketing Web Content Internal Communications Lead Generation Leadership Strategy Project Planning Sales Online Marketing Content Strategy Product Marketing B2B Marketing CRM Publishing Thought Leadership SEO Integrated Marketing Business Alliances SaaS Web Analytics Go-to-market Strategy Information Architecture Marketing Management Web 2.0 Enterprise Software Web Project Management E-commerce Messaging Product Management Sales Enablement See 35+     See less Marketing Communications Social Media Advertising Writing Editing Web Content Management Public Relations Digital Media Digital Marketing Content Development Marketing Copy Blogging Copywriting Email Marketing Management Corporate Communications Project Management Demand Generation Content Management Facebook Marketing Web Content Internal Communications Lead Generation Leadership Strategy Project Planning Sales Online Marketing Content Strategy Product Marketing B2B Marketing CRM Publishing Thought Leadership SEO Integrated Marketing Business Alliances SaaS Web Analytics Go-to-market Strategy Information Architecture Marketing Management Web 2.0 Enterprise Software Web Project Management E-commerce Messaging Product Management Sales Enablement See 35+     See less Marketing Communications Social Media Advertising Writing Editing Web Content Management Public Relations Digital Media Digital Marketing Content Development Marketing Copy Blogging Copywriting Email Marketing Management Corporate Communications Project Management Demand Generation Content Management Facebook Marketing Web Content Internal Communications Lead Generation Leadership Strategy Project Planning Sales Online Marketing Content Strategy Product Marketing B2B Marketing CRM Publishing Thought Leadership SEO Integrated Marketing Business Alliances SaaS Web Analytics Go-to-market Strategy Information Architecture Marketing Management Web 2.0 Enterprise Software Web Project Management E-commerce Messaging Product Management Sales Enablement See 35+     See less Education East Carolina University B.A.,  English Major/Journalism Minor East Carolina University B.A.,  English Major/Journalism Minor East Carolina University B.A.,  English Major/Journalism Minor East Carolina University B.A.,  English Major/Journalism Minor ", "Summary Results driven and savvy Web designer/developer, writer and marketing professional with over 20 years reflecting successful Web site design, development and implementation, marketing communications and project management.  \n \n•\tThe Web is my passion. I've had extensive experience with all aspects of the Web from concept, design, planning, navigation, strategy and usability to back-end tools and functions, CMS, metrics, SEO, etc.; proven ability in developing compelling, effective Web sites. Project managed CRO site clinicaltrials.com for healthcare industry.  \n•\tSuccessful record of multitasking and managing projects on schedule and within budget.  \n•\tExcellent verbal and written communications skills; writing, content development; editor of monthly newsletters; author of user guide for course instruction (internally published) \n•\tSelf-motivated, detail-oriented, able to work independently as well as collaboratively. \n•\tInnovative professional who can lead and mentor others; teaching experience \n•\tExperienced researching and managing vendors and support personnel, managing project budget, patient recruitment, study participant needs and managing video production. \n \nSpecialties:  \n•\tProject management, Web design, strategy, navigation, usability \n•\tCMS, SEO, metrics, social networking, HTML, CSS, WYSIWYG layout tools \n•\tMarketing and communications, writing, content development, branding, vendor management, patient recruitment. Summary Results driven and savvy Web designer/developer, writer and marketing professional with over 20 years reflecting successful Web site design, development and implementation, marketing communications and project management.  \n \n•\tThe Web is my passion. I've had extensive experience with all aspects of the Web from concept, design, planning, navigation, strategy and usability to back-end tools and functions, CMS, metrics, SEO, etc.; proven ability in developing compelling, effective Web sites. Project managed CRO site clinicaltrials.com for healthcare industry.  \n•\tSuccessful record of multitasking and managing projects on schedule and within budget.  \n•\tExcellent verbal and written communications skills; writing, content development; editor of monthly newsletters; author of user guide for course instruction (internally published) \n•\tSelf-motivated, detail-oriented, able to work independently as well as collaboratively. \n•\tInnovative professional who can lead and mentor others; teaching experience \n•\tExperienced researching and managing vendors and support personnel, managing project budget, patient recruitment, study participant needs and managing video production. \n \nSpecialties:  \n•\tProject management, Web design, strategy, navigation, usability \n•\tCMS, SEO, metrics, social networking, HTML, CSS, WYSIWYG layout tools \n•\tMarketing and communications, writing, content development, branding, vendor management, patient recruitment. Results driven and savvy Web designer/developer, writer and marketing professional with over 20 years reflecting successful Web site design, development and implementation, marketing communications and project management.  \n \n•\tThe Web is my passion. I've had extensive experience with all aspects of the Web from concept, design, planning, navigation, strategy and usability to back-end tools and functions, CMS, metrics, SEO, etc.; proven ability in developing compelling, effective Web sites. Project managed CRO site clinicaltrials.com for healthcare industry.  \n•\tSuccessful record of multitasking and managing projects on schedule and within budget.  \n•\tExcellent verbal and written communications skills; writing, content development; editor of monthly newsletters; author of user guide for course instruction (internally published) \n•\tSelf-motivated, detail-oriented, able to work independently as well as collaboratively. \n•\tInnovative professional who can lead and mentor others; teaching experience \n•\tExperienced researching and managing vendors and support personnel, managing project budget, patient recruitment, study participant needs and managing video production. \n \nSpecialties:  \n•\tProject management, Web design, strategy, navigation, usability \n•\tCMS, SEO, metrics, social networking, HTML, CSS, WYSIWYG layout tools \n•\tMarketing and communications, writing, content development, branding, vendor management, patient recruitment. Results driven and savvy Web designer/developer, writer and marketing professional with over 20 years reflecting successful Web site design, development and implementation, marketing communications and project management.  \n \n•\tThe Web is my passion. I've had extensive experience with all aspects of the Web from concept, design, planning, navigation, strategy and usability to back-end tools and functions, CMS, metrics, SEO, etc.; proven ability in developing compelling, effective Web sites. Project managed CRO site clinicaltrials.com for healthcare industry.  \n•\tSuccessful record of multitasking and managing projects on schedule and within budget.  \n•\tExcellent verbal and written communications skills; writing, content development; editor of monthly newsletters; author of user guide for course instruction (internally published) \n•\tSelf-motivated, detail-oriented, able to work independently as well as collaboratively. \n•\tInnovative professional who can lead and mentor others; teaching experience \n•\tExperienced researching and managing vendors and support personnel, managing project budget, patient recruitment, study participant needs and managing video production. \n \nSpecialties:  \n•\tProject management, Web design, strategy, navigation, usability \n•\tCMS, SEO, metrics, social networking, HTML, CSS, WYSIWYG layout tools \n•\tMarketing and communications, writing, content development, branding, vendor management, patient recruitment. Experience Office Manager Barone Financial Group May 2014  – Present (1 year 4 months) Cary, NC Web Design / Development jubico, inc. July 2005  – Present (10 years 2 months) Freelance Freelance Web design and development, consultation. Please visit examples at: \nwww.bravadance.com \ntriawc.wix.com/home \nwww.wakeinternalmedicine.com \nwww.rxuc.com \nwww.dilleyorthodontics.com \nwww.joshuascure.org Associate Manager, Global e-Communications PPD October 2008  –  October 2009  (1 year 1 month) Web and Marketing Writer IBM Corporation January 2008  –  July 2008  (7 months) Web Production Lead IBM Corporation December 2006  –  December 2007  (1 year 1 month) Web Project Manager GlaxoSmithKline May 2006  –  July 2006  (3 months) Web Project Manager IBM Corporation 1998  –  2005  (7 years) IMC lead IBM Corporation 1995  –  1998  (3 years) ISO9000 Coordinator IBM Corp 1994  –  1995  (1 year) Technical Writer Proj. Mgr. IBM Corp 1991  –  1994  (3 years) Systems Programmer IBM Corp 1990  –  1991  (1 year) Instructor IBM Corp 1987  –  1989  (2 years) Office Manager Barone Financial Group May 2014  – Present (1 year 4 months) Cary, NC Office Manager Barone Financial Group May 2014  – Present (1 year 4 months) Cary, NC Web Design / Development jubico, inc. July 2005  – Present (10 years 2 months) Freelance Freelance Web design and development, consultation. Please visit examples at: \nwww.bravadance.com \ntriawc.wix.com/home \nwww.wakeinternalmedicine.com \nwww.rxuc.com \nwww.dilleyorthodontics.com \nwww.joshuascure.org Web Design / Development jubico, inc. July 2005  – Present (10 years 2 months) Freelance Freelance Web design and development, consultation. Please visit examples at: \nwww.bravadance.com \ntriawc.wix.com/home \nwww.wakeinternalmedicine.com \nwww.rxuc.com \nwww.dilleyorthodontics.com \nwww.joshuascure.org Associate Manager, Global e-Communications PPD October 2008  –  October 2009  (1 year 1 month) Associate Manager, Global e-Communications PPD October 2008  –  October 2009  (1 year 1 month) Web and Marketing Writer IBM Corporation January 2008  –  July 2008  (7 months) Web and Marketing Writer IBM Corporation January 2008  –  July 2008  (7 months) Web Production Lead IBM Corporation December 2006  –  December 2007  (1 year 1 month) Web Production Lead IBM Corporation December 2006  –  December 2007  (1 year 1 month) Web Project Manager GlaxoSmithKline May 2006  –  July 2006  (3 months) Web Project Manager GlaxoSmithKline May 2006  –  July 2006  (3 months) Web Project Manager IBM Corporation 1998  –  2005  (7 years) Web Project Manager IBM Corporation 1998  –  2005  (7 years) IMC lead IBM Corporation 1995  –  1998  (3 years) IMC lead IBM Corporation 1995  –  1998  (3 years) ISO9000 Coordinator IBM Corp 1994  –  1995  (1 year) ISO9000 Coordinator IBM Corp 1994  –  1995  (1 year) Technical Writer Proj. Mgr. IBM Corp 1991  –  1994  (3 years) Technical Writer Proj. Mgr. IBM Corp 1991  –  1994  (3 years) Systems Programmer IBM Corp 1990  –  1991  (1 year) Systems Programmer IBM Corp 1990  –  1991  (1 year) Instructor IBM Corp 1987  –  1989  (2 years) Instructor IBM Corp 1987  –  1989  (2 years) Skills SEO Marketing Communications Cross-functional Team... CMS Social Networking Integrated Marketing Management Strategy Content Development Competitive Analysis Creative Direction Recruiting Product Development CSS Web Design Skills  SEO Marketing Communications Cross-functional Team... CMS Social Networking Integrated Marketing Management Strategy Content Development Competitive Analysis Creative Direction Recruiting Product Development CSS Web Design SEO Marketing Communications Cross-functional Team... CMS Social Networking Integrated Marketing Management Strategy Content Development Competitive Analysis Creative Direction Recruiting Product Development CSS Web Design SEO Marketing Communications Cross-functional Team... CMS Social Networking Integrated Marketing Management Strategy Content Development Competitive Analysis Creative Direction Recruiting Product Development CSS Web Design ", "Summary Writer and copy editor with experience producing micro targeted articles for distribution through intelligent use of social media. Diverse portfolio of content topics includes business solutions, entrepreneurship, telemarketing and career incentives. \n \n \nSpecialties: writing, editing, proofreading, account management, budgeting, financial, general ledger. Summary Writer and copy editor with experience producing micro targeted articles for distribution through intelligent use of social media. Diverse portfolio of content topics includes business solutions, entrepreneurship, telemarketing and career incentives. \n \n \nSpecialties: writing, editing, proofreading, account management, budgeting, financial, general ledger. Writer and copy editor with experience producing micro targeted articles for distribution through intelligent use of social media. Diverse portfolio of content topics includes business solutions, entrepreneurship, telemarketing and career incentives. \n \n \nSpecialties: writing, editing, proofreading, account management, budgeting, financial, general ledger. Writer and copy editor with experience producing micro targeted articles for distribution through intelligent use of social media. Diverse portfolio of content topics includes business solutions, entrepreneurship, telemarketing and career incentives. \n \n \nSpecialties: writing, editing, proofreading, account management, budgeting, financial, general ledger. Experience Marketing Writer IBM Analytics June 2014  – Present (1 year 3 months) Copy Editor and Proofreader Freelancer 2006  – Present (9 years) Freelance Writer and Ghostwriter WriterAccess and Demand Media Studios – Chron.com, AZCentral.com 2012  –  June 2014  (2 years) Freelance Copy Editor American Association of Community Colleges and OBVIOUS Magazine Online 2011  –  May 2014  (3 years) Business Planning Analyst/Change Management Leader Motorola December 1997  –  October 1998  (11 months) Cost Analyst Motorola July 1997  –  November 1997  (5 months) Financial Analyst Motorola January 1995  –  June 1997  (2 years 6 months) Capital Analyst Motorola May 1992  –  December 1994  (2 years 8 months) Auditor II and Staff Auditor II Texas General Land Office June 1989  –  May 1992  (3 years) Marketing Writer IBM Analytics June 2014  – Present (1 year 3 months) Marketing Writer IBM Analytics June 2014  – Present (1 year 3 months) Copy Editor and Proofreader Freelancer 2006  – Present (9 years) Copy Editor and Proofreader Freelancer 2006  – Present (9 years) Freelance Writer and Ghostwriter WriterAccess and Demand Media Studios – Chron.com, AZCentral.com 2012  –  June 2014  (2 years) Freelance Writer and Ghostwriter WriterAccess and Demand Media Studios – Chron.com, AZCentral.com 2012  –  June 2014  (2 years) Freelance Copy Editor American Association of Community Colleges and OBVIOUS Magazine Online 2011  –  May 2014  (3 years) Freelance Copy Editor American Association of Community Colleges and OBVIOUS Magazine Online 2011  –  May 2014  (3 years) Business Planning Analyst/Change Management Leader Motorola December 1997  –  October 1998  (11 months) Business Planning Analyst/Change Management Leader Motorola December 1997  –  October 1998  (11 months) Cost Analyst Motorola July 1997  –  November 1997  (5 months) Cost Analyst Motorola July 1997  –  November 1997  (5 months) Financial Analyst Motorola January 1995  –  June 1997  (2 years 6 months) Financial Analyst Motorola January 1995  –  June 1997  (2 years 6 months) Capital Analyst Motorola May 1992  –  December 1994  (2 years 8 months) Capital Analyst Motorola May 1992  –  December 1994  (2 years 8 months) Auditor II and Staff Auditor II Texas General Land Office June 1989  –  May 1992  (3 years) Auditor II and Staff Auditor II Texas General Land Office June 1989  –  May 1992  (3 years) Skills Editing Proofreading Copy Editing Editorial Blogging Newsletters Leadership Social Media Published Author Web Content Management Content Strategy Content Development Skills  Editing Proofreading Copy Editing Editorial Blogging Newsletters Leadership Social Media Published Author Web Content Management Content Strategy Content Development Editing Proofreading Copy Editing Editorial Blogging Newsletters Leadership Social Media Published Author Web Content Management Content Strategy Content Development Editing Proofreading Copy Editing Editorial Blogging Newsletters Leadership Social Media Published Author Web Content Management Content Strategy Content Development Education Southern University and Agricultural and Mechanical College at Baton Rouge Bachelor of Science 1985  – 1988 Southern University and Agricultural and Mechanical College at Baton Rouge Bachelor of Science 1985  – 1988 Southern University and Agricultural and Mechanical College at Baton Rouge Bachelor of Science 1985  – 1988 Southern University and Agricultural and Mechanical College at Baton Rouge Bachelor of Science 1985  – 1988 ", "Summary Q: Current Job Profile? \nA: Product and Services Marketing \n \nQ: At? \nA: Schneider Electric (Acquired: Invensys OM)  \n \nQ: Since? \nA: January 2014 - Present \n \nQ: Total working experience (in years)? \nA: May 2007 - Present (8 Years) \n \nQ: Work with? \nA: Product Directors, Product Marketing Managers, Product SMEs \n \nQ: Working Style? \nA: Creative, Disruptive, Collaborative \n \nQ: Interests? \nA: Writing, Photography, Illustration, Travel, Graphic Design, Adventure, Cycling \n \nAll information stated above is accurate to the best of my knowledge. \n \nLast updated | 19th January 2015 \n \nSpecialties: \n1. Writing & Editing - Web Copy Writing, Marketing Writing, Editing & Proofreading \n2. Photography - Portraits, Street, Travel, People, Places, Culture \n3. Illustration - Mixed Media Summary Q: Current Job Profile? \nA: Product and Services Marketing \n \nQ: At? \nA: Schneider Electric (Acquired: Invensys OM)  \n \nQ: Since? \nA: January 2014 - Present \n \nQ: Total working experience (in years)? \nA: May 2007 - Present (8 Years) \n \nQ: Work with? \nA: Product Directors, Product Marketing Managers, Product SMEs \n \nQ: Working Style? \nA: Creative, Disruptive, Collaborative \n \nQ: Interests? \nA: Writing, Photography, Illustration, Travel, Graphic Design, Adventure, Cycling \n \nAll information stated above is accurate to the best of my knowledge. \n \nLast updated | 19th January 2015 \n \nSpecialties: \n1. Writing & Editing - Web Copy Writing, Marketing Writing, Editing & Proofreading \n2. Photography - Portraits, Street, Travel, People, Places, Culture \n3. Illustration - Mixed Media Q: Current Job Profile? \nA: Product and Services Marketing \n \nQ: At? \nA: Schneider Electric (Acquired: Invensys OM)  \n \nQ: Since? \nA: January 2014 - Present \n \nQ: Total working experience (in years)? \nA: May 2007 - Present (8 Years) \n \nQ: Work with? \nA: Product Directors, Product Marketing Managers, Product SMEs \n \nQ: Working Style? \nA: Creative, Disruptive, Collaborative \n \nQ: Interests? \nA: Writing, Photography, Illustration, Travel, Graphic Design, Adventure, Cycling \n \nAll information stated above is accurate to the best of my knowledge. \n \nLast updated | 19th January 2015 \n \nSpecialties: \n1. Writing & Editing - Web Copy Writing, Marketing Writing, Editing & Proofreading \n2. Photography - Portraits, Street, Travel, People, Places, Culture \n3. Illustration - Mixed Media Q: Current Job Profile? \nA: Product and Services Marketing \n \nQ: At? \nA: Schneider Electric (Acquired: Invensys OM)  \n \nQ: Since? \nA: January 2014 - Present \n \nQ: Total working experience (in years)? \nA: May 2007 - Present (8 Years) \n \nQ: Work with? \nA: Product Directors, Product Marketing Managers, Product SMEs \n \nQ: Working Style? \nA: Creative, Disruptive, Collaborative \n \nQ: Interests? \nA: Writing, Photography, Illustration, Travel, Graphic Design, Adventure, Cycling \n \nAll information stated above is accurate to the best of my knowledge. \n \nLast updated | 19th January 2015 \n \nSpecialties: \n1. Writing & Editing - Web Copy Writing, Marketing Writing, Editing & Proofreading \n2. Photography - Portraits, Street, Travel, People, Places, Culture \n3. Illustration - Mixed Media Experience Product Marketing Professional Schneider Electric January 2014  – Present (1 year 8 months) Bengaluru Area, India My role is to provide support for Product & Services Marketing activities within Schneider Electric. I primarily work on product launches, collateral generation, sales enablement, sales training, competitive intelligence, marketing research, website audits, content strategy, collateral management, digital asset management, digital asset creation workflows and social media execution frameworks. \n \nI work along with product directors, product managers and subject matter experts for creating external and internal facing documents that include program guides, sales training decks, customer notification emails, sales readiness collateral, market study reports, launch documents, client presentations, customer personas, online surveys and customer voice insights.  \n \nFor internal projects of the adhoc variety, I provide support for for web audit reports, digital asset inventories for internal sites, webcopy edits, copywriting, and project management that require DLC methodologies and principles. \n \nAreas of Expertise: \nProduct Marketing, Product Launch Management, Market Research, Competitive Intelligence, Digital Asset Management, Content Strategy, Project Management, Marketing Communications, Collateral Development, Copywriting, Copyediting, CMS. Word riffer, Doodle maker, Pixel mover, Light chaser Independent Freelance Professional May 2009  – Present (6 years 4 months) All over the place I came, I saw, I doodled. I shoot too. And am currently learning how to move pixels into a coherent whole to communicate whatever happens between the ears. I am a hi-definition regurgitator and I consume ideas in the form of books, music, film, design, art and photography. I am aspiring to be a maker of things and a mover of ideas. You can visit my blog and folio at - lawandesalil.wordpress.com/portfolio and Behance - be.net/lawandesalil Product Marketing Professional Invensys November 2012  –  January 2014  (1 year 3 months) Bangalore Marketing Writer IBM March 2011  –  November 2012  (1 year 9 months) Commerce @ Mantri, Bangalore Team Lead | Project Manager Independent Freelance Professional January 2010  –  March 2011  (1 year 3 months) Writer & Editor Independent Freelance Professional September 2009  –  March 2011  (1 year 7 months) Business Development Consultant Delta Force Team Oracle Corporation November 2008  –  April 2009  (6 months) Business Development Consultant Oracle Corporation May 2007  –  April 2009  (2 years) Summer Internship Go Airlines India Pvt Ltd March 2006  –  May 2006  (3 months) Product Marketing Professional Schneider Electric January 2014  – Present (1 year 8 months) Bengaluru Area, India My role is to provide support for Product & Services Marketing activities within Schneider Electric. I primarily work on product launches, collateral generation, sales enablement, sales training, competitive intelligence, marketing research, website audits, content strategy, collateral management, digital asset management, digital asset creation workflows and social media execution frameworks. \n \nI work along with product directors, product managers and subject matter experts for creating external and internal facing documents that include program guides, sales training decks, customer notification emails, sales readiness collateral, market study reports, launch documents, client presentations, customer personas, online surveys and customer voice insights.  \n \nFor internal projects of the adhoc variety, I provide support for for web audit reports, digital asset inventories for internal sites, webcopy edits, copywriting, and project management that require DLC methodologies and principles. \n \nAreas of Expertise: \nProduct Marketing, Product Launch Management, Market Research, Competitive Intelligence, Digital Asset Management, Content Strategy, Project Management, Marketing Communications, Collateral Development, Copywriting, Copyediting, CMS. Product Marketing Professional Schneider Electric January 2014  – Present (1 year 8 months) Bengaluru Area, India My role is to provide support for Product & Services Marketing activities within Schneider Electric. I primarily work on product launches, collateral generation, sales enablement, sales training, competitive intelligence, marketing research, website audits, content strategy, collateral management, digital asset management, digital asset creation workflows and social media execution frameworks. \n \nI work along with product directors, product managers and subject matter experts for creating external and internal facing documents that include program guides, sales training decks, customer notification emails, sales readiness collateral, market study reports, launch documents, client presentations, customer personas, online surveys and customer voice insights.  \n \nFor internal projects of the adhoc variety, I provide support for for web audit reports, digital asset inventories for internal sites, webcopy edits, copywriting, and project management that require DLC methodologies and principles. \n \nAreas of Expertise: \nProduct Marketing, Product Launch Management, Market Research, Competitive Intelligence, Digital Asset Management, Content Strategy, Project Management, Marketing Communications, Collateral Development, Copywriting, Copyediting, CMS. Word riffer, Doodle maker, Pixel mover, Light chaser Independent Freelance Professional May 2009  – Present (6 years 4 months) All over the place I came, I saw, I doodled. I shoot too. And am currently learning how to move pixels into a coherent whole to communicate whatever happens between the ears. I am a hi-definition regurgitator and I consume ideas in the form of books, music, film, design, art and photography. I am aspiring to be a maker of things and a mover of ideas. You can visit my blog and folio at - lawandesalil.wordpress.com/portfolio and Behance - be.net/lawandesalil Word riffer, Doodle maker, Pixel mover, Light chaser Independent Freelance Professional May 2009  – Present (6 years 4 months) All over the place I came, I saw, I doodled. I shoot too. And am currently learning how to move pixels into a coherent whole to communicate whatever happens between the ears. I am a hi-definition regurgitator and I consume ideas in the form of books, music, film, design, art and photography. I am aspiring to be a maker of things and a mover of ideas. You can visit my blog and folio at - lawandesalil.wordpress.com/portfolio and Behance - be.net/lawandesalil Product Marketing Professional Invensys November 2012  –  January 2014  (1 year 3 months) Bangalore Product Marketing Professional Invensys November 2012  –  January 2014  (1 year 3 months) Bangalore Marketing Writer IBM March 2011  –  November 2012  (1 year 9 months) Commerce @ Mantri, Bangalore Marketing Writer IBM March 2011  –  November 2012  (1 year 9 months) Commerce @ Mantri, Bangalore Team Lead | Project Manager Independent Freelance Professional January 2010  –  March 2011  (1 year 3 months) Team Lead | Project Manager Independent Freelance Professional January 2010  –  March 2011  (1 year 3 months) Writer & Editor Independent Freelance Professional September 2009  –  March 2011  (1 year 7 months) Writer & Editor Independent Freelance Professional September 2009  –  March 2011  (1 year 7 months) Business Development Consultant Delta Force Team Oracle Corporation November 2008  –  April 2009  (6 months) Business Development Consultant Delta Force Team Oracle Corporation November 2008  –  April 2009  (6 months) Business Development Consultant Oracle Corporation May 2007  –  April 2009  (2 years) Business Development Consultant Oracle Corporation May 2007  –  April 2009  (2 years) Summer Internship Go Airlines India Pvt Ltd March 2006  –  May 2006  (3 months) Summer Internship Go Airlines India Pvt Ltd March 2006  –  May 2006  (3 months) Languages English Full professional proficiency French Elementary proficiency Konkani Native or bilingual proficiency Hindi Professional working proficiency Marathi Native or bilingual proficiency Kannada Elementary proficiency English Full professional proficiency French Elementary proficiency Konkani Native or bilingual proficiency Hindi Professional working proficiency Marathi Native or bilingual proficiency Kannada Elementary proficiency English Full professional proficiency French Elementary proficiency Konkani Native or bilingual proficiency Hindi Professional working proficiency Marathi Native or bilingual proficiency Kannada Elementary proficiency Full professional proficiency Elementary proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Elementary proficiency Skills Marketing Collateral... Marketing Writing Copywriting Editing Proofreading Social Media Technology Writing Proposal Writing Business Communications Blogging Storyboarding Marketing Communications Web Content White Papers Data Sheets Marketing Content Writing Technical Writing Digital Photography Collateral Product Marketing Market Research Content Strategy Digital Marketing Demand Generation WordPress Content Auditing B2B Marketing Management Strategy Business Development Project Management Marketing Management Enterprise Software Social Media Marketing Copy Editing See 21+     See less Skills  Marketing Collateral... Marketing Writing Copywriting Editing Proofreading Social Media Technology Writing Proposal Writing Business Communications Blogging Storyboarding Marketing Communications Web Content White Papers Data Sheets Marketing Content Writing Technical Writing Digital Photography Collateral Product Marketing Market Research Content Strategy Digital Marketing Demand Generation WordPress Content Auditing B2B Marketing Management Strategy Business Development Project Management Marketing Management Enterprise Software Social Media Marketing Copy Editing See 21+     See less Marketing Collateral... Marketing Writing Copywriting Editing Proofreading Social Media Technology Writing Proposal Writing Business Communications Blogging Storyboarding Marketing Communications Web Content White Papers Data Sheets Marketing Content Writing Technical Writing Digital Photography Collateral Product Marketing Market Research Content Strategy Digital Marketing Demand Generation WordPress Content Auditing B2B Marketing Management Strategy Business Development Project Management Marketing Management Enterprise Software Social Media Marketing Copy Editing See 21+     See less Marketing Collateral... Marketing Writing Copywriting Editing Proofreading Social Media Technology Writing Proposal Writing Business Communications Blogging Storyboarding Marketing Communications Web Content White Papers Data Sheets Marketing Content Writing Technical Writing Digital Photography Collateral Product Marketing Market Research Content Strategy Digital Marketing Demand Generation WordPress Content Auditing B2B Marketing Management Strategy Business Development Project Management Marketing Management Enterprise Software Social Media Marketing Copy Editing See 21+     See less Education Kirloskar Institute of Advanced Management Studies Post Graduate Diploma in Management,  Marketing & Operations 2005  – 2007 University of Mumbai B.E,  Automobile Engineering 2001  – 2004 Activities and Societies:  Cultural Committee Kirloskar Institute of Advanced Management Studies Post Graduate Diploma in Management,  Marketing & Operations 2005  – 2007 Kirloskar Institute of Advanced Management Studies Post Graduate Diploma in Management,  Marketing & Operations 2005  – 2007 Kirloskar Institute of Advanced Management Studies Post Graduate Diploma in Management,  Marketing & Operations 2005  – 2007 University of Mumbai B.E,  Automobile Engineering 2001  – 2004 Activities and Societies:  Cultural Committee University of Mumbai B.E,  Automobile Engineering 2001  – 2004 Activities and Societies:  Cultural Committee University of Mumbai B.E,  Automobile Engineering 2001  – 2004 Activities and Societies:  Cultural Committee Honors & Awards Excellence at Work | Above and Beyond Award Schneider Electric (Acquired: Invensys Operations Management) January 2014 In recognition for outstanding contribution towards a high performance culture. Outstanding Team Award for Q2 2011 IBM India Pvt. Ltd July 2011 Excellence at Work Award for Q2 2011 IBM India Pvt. Ltd July 2011 Excellence at Work | Above and Beyond Award Schneider Electric (Acquired: Invensys Operations Management) January 2014 In recognition for outstanding contribution towards a high performance culture. Excellence at Work | Above and Beyond Award Schneider Electric (Acquired: Invensys Operations Management) January 2014 In recognition for outstanding contribution towards a high performance culture. Excellence at Work | Above and Beyond Award Schneider Electric (Acquired: Invensys Operations Management) January 2014 In recognition for outstanding contribution towards a high performance culture. Outstanding Team Award for Q2 2011 IBM India Pvt. Ltd July 2011 Outstanding Team Award for Q2 2011 IBM India Pvt. Ltd July 2011 Outstanding Team Award for Q2 2011 IBM India Pvt. Ltd July 2011 Excellence at Work Award for Q2 2011 IBM India Pvt. Ltd July 2011 Excellence at Work Award for Q2 2011 IBM India Pvt. Ltd July 2011 Excellence at Work Award for Q2 2011 IBM India Pvt. Ltd July 2011 ", "Summary I am a writer, editorial manager and digital content strategist with more than twenty years of experience in technology marketing and corporate communications.  \n \nMy specialties include: \n \n•\tDigital marketing – Write website copy, banner ads, social media, e-newsletters, customer stories, email messages, and SEO language to increase customer engagement and deliver sales leads. \n \n•\tEditorial content – Manage editorial calendars and writing resources for customer story programs, online publications, blogs, and home page features to deliver a steady stream of fresh content. \n \n•\tMarketing collateral – Write white papers, solution briefs, data sheets and interactive demo scripts to use as web offers for B2B and B2C audiences. Summary I am a writer, editorial manager and digital content strategist with more than twenty years of experience in technology marketing and corporate communications.  \n \nMy specialties include: \n \n•\tDigital marketing – Write website copy, banner ads, social media, e-newsletters, customer stories, email messages, and SEO language to increase customer engagement and deliver sales leads. \n \n•\tEditorial content – Manage editorial calendars and writing resources for customer story programs, online publications, blogs, and home page features to deliver a steady stream of fresh content. \n \n•\tMarketing collateral – Write white papers, solution briefs, data sheets and interactive demo scripts to use as web offers for B2B and B2C audiences. I am a writer, editorial manager and digital content strategist with more than twenty years of experience in technology marketing and corporate communications.  \n \nMy specialties include: \n \n•\tDigital marketing – Write website copy, banner ads, social media, e-newsletters, customer stories, email messages, and SEO language to increase customer engagement and deliver sales leads. \n \n•\tEditorial content – Manage editorial calendars and writing resources for customer story programs, online publications, blogs, and home page features to deliver a steady stream of fresh content. \n \n•\tMarketing collateral – Write white papers, solution briefs, data sheets and interactive demo scripts to use as web offers for B2B and B2C audiences. I am a writer, editorial manager and digital content strategist with more than twenty years of experience in technology marketing and corporate communications.  \n \nMy specialties include: \n \n•\tDigital marketing – Write website copy, banner ads, social media, e-newsletters, customer stories, email messages, and SEO language to increase customer engagement and deliver sales leads. \n \n•\tEditorial content – Manage editorial calendars and writing resources for customer story programs, online publications, blogs, and home page features to deliver a steady stream of fresh content. \n \n•\tMarketing collateral – Write white papers, solution briefs, data sheets and interactive demo scripts to use as web offers for B2B and B2C audiences. Experience Senior Digital Marketing Writer and Content Strategist IBM January 2012  – Present (3 years 8 months) Work with a team of senior writers and editors to write hundreds of product web pages for ibm.com. Create banners, SEO language, and web offers to increase customer engagement and generate sales leads. Write features and benefits in simple language using best practices for clear, concise, compelling web marketing. Evaluate web analytics to continually improve web page effectiveness. Write content that meets IBM editorial standards and is easy to translate into multiple languages. Use content management systems and offer management systems to produce page content and place offers on demand. Support the full range of IBM products with special emphasis on IBM Commerce offerings. (Contract position) Owner Roark Publications 1988  – Present (27 years) Roark Publications provides writing, editorial and project management services for digital marketing and corporate communications.  \n \n•\tProvide a full range of communications services from strategy and design to creative development and delivery on multiple platforms.  \n \n•\tManage entire communications operations, coordinating the work of marketing and PR teams, technical experts, freelance writers, legal staff, graphic designers, and web and social media teams.  \n \n•\tWrite individual customer stories, blogs, white papers, case studies, and email or web copy to meet targeted company needs on deadline. \n Managing Editor Shadow and Light, a literary anthology July 2010  –  July 2012  (2 years 1 month) Web Content Project Manager and Marketing Writer IBM April 2009  –  February 2011  (1 year 11 months) Web Content Manager, Customer Story Program and Publications Avid Technology January 1996  –  December 2010  (15 years) Senior Communications Specialist NSS Corp July 1986  –  December 1987  (1 year 6 months) Senior Course Developer GE Software International June 1985  –  July 1986  (1 year 2 months) Product Manager Evergreen Software February 1984  –  June 1985  (1 year 5 months) Member of the Technical Staff The MITRE Corporation September 1982  –  February 1984  (1 year 6 months) Senior Digital Marketing Writer and Content Strategist IBM January 2012  – Present (3 years 8 months) Work with a team of senior writers and editors to write hundreds of product web pages for ibm.com. Create banners, SEO language, and web offers to increase customer engagement and generate sales leads. Write features and benefits in simple language using best practices for clear, concise, compelling web marketing. Evaluate web analytics to continually improve web page effectiveness. Write content that meets IBM editorial standards and is easy to translate into multiple languages. Use content management systems and offer management systems to produce page content and place offers on demand. Support the full range of IBM products with special emphasis on IBM Commerce offerings. (Contract position) Senior Digital Marketing Writer and Content Strategist IBM January 2012  – Present (3 years 8 months) Work with a team of senior writers and editors to write hundreds of product web pages for ibm.com. Create banners, SEO language, and web offers to increase customer engagement and generate sales leads. Write features and benefits in simple language using best practices for clear, concise, compelling web marketing. Evaluate web analytics to continually improve web page effectiveness. Write content that meets IBM editorial standards and is easy to translate into multiple languages. Use content management systems and offer management systems to produce page content and place offers on demand. Support the full range of IBM products with special emphasis on IBM Commerce offerings. (Contract position) Owner Roark Publications 1988  – Present (27 years) Roark Publications provides writing, editorial and project management services for digital marketing and corporate communications.  \n \n•\tProvide a full range of communications services from strategy and design to creative development and delivery on multiple platforms.  \n \n•\tManage entire communications operations, coordinating the work of marketing and PR teams, technical experts, freelance writers, legal staff, graphic designers, and web and social media teams.  \n \n•\tWrite individual customer stories, blogs, white papers, case studies, and email or web copy to meet targeted company needs on deadline. \n Owner Roark Publications 1988  – Present (27 years) Roark Publications provides writing, editorial and project management services for digital marketing and corporate communications.  \n \n•\tProvide a full range of communications services from strategy and design to creative development and delivery on multiple platforms.  \n \n•\tManage entire communications operations, coordinating the work of marketing and PR teams, technical experts, freelance writers, legal staff, graphic designers, and web and social media teams.  \n \n•\tWrite individual customer stories, blogs, white papers, case studies, and email or web copy to meet targeted company needs on deadline. \n Managing Editor Shadow and Light, a literary anthology July 2010  –  July 2012  (2 years 1 month) Managing Editor Shadow and Light, a literary anthology July 2010  –  July 2012  (2 years 1 month) Web Content Project Manager and Marketing Writer IBM April 2009  –  February 2011  (1 year 11 months) Web Content Project Manager and Marketing Writer IBM April 2009  –  February 2011  (1 year 11 months) Web Content Manager, Customer Story Program and Publications Avid Technology January 1996  –  December 2010  (15 years) Web Content Manager, Customer Story Program and Publications Avid Technology January 1996  –  December 2010  (15 years) Senior Communications Specialist NSS Corp July 1986  –  December 1987  (1 year 6 months) Senior Communications Specialist NSS Corp July 1986  –  December 1987  (1 year 6 months) Senior Course Developer GE Software International June 1985  –  July 1986  (1 year 2 months) Senior Course Developer GE Software International June 1985  –  July 1986  (1 year 2 months) Product Manager Evergreen Software February 1984  –  June 1985  (1 year 5 months) Product Manager Evergreen Software February 1984  –  June 1985  (1 year 5 months) Member of the Technical Staff The MITRE Corporation September 1982  –  February 1984  (1 year 6 months) Member of the Technical Staff The MITRE Corporation September 1982  –  February 1984  (1 year 6 months) Skills Blogging Management Consulting Editing Email Marketing Content Strategy Web Content Content Development Newsletters Social Media Marketing Communications Editorial Publishing Creative Writing Books Copywriting Public Speaking Public Relations Multimedia Marketing Publications See 5+     See less Skills  Blogging Management Consulting Editing Email Marketing Content Strategy Web Content Content Development Newsletters Social Media Marketing Communications Editorial Publishing Creative Writing Books Copywriting Public Speaking Public Relations Multimedia Marketing Publications See 5+     See less Blogging Management Consulting Editing Email Marketing Content Strategy Web Content Content Development Newsletters Social Media Marketing Communications Editorial Publishing Creative Writing Books Copywriting Public Speaking Public Relations Multimedia Marketing Publications See 5+     See less Blogging Management Consulting Editing Email Marketing Content Strategy Web Content Content Development Newsletters Social Media Marketing Communications Editorial Publishing Creative Writing Books Copywriting Public Speaking Public Relations Multimedia Marketing Publications See 5+     See less Education State University of New York College at Cortland B.S.,  mathematics major ,  computer science concentration ,  economics minor , summa cum laude Activities and Societies:  Beta Gamma Sigma ,  Cortland College Singers ,  College Court Justice Syracuse University - Martin J. Whitman School of Management M.B.A.,  marketing and information systems , attended on a Syracuse University fellowship and graduated with highest honors. Activities and Societies:  Hendricks Chapel Choir State University of New York College at Cortland B.S.,  mathematics major ,  computer science concentration ,  economics minor , summa cum laude Activities and Societies:  Beta Gamma Sigma ,  Cortland College Singers ,  College Court Justice State University of New York College at Cortland B.S.,  mathematics major ,  computer science concentration ,  economics minor , summa cum laude Activities and Societies:  Beta Gamma Sigma ,  Cortland College Singers ,  College Court Justice State University of New York College at Cortland B.S.,  mathematics major ,  computer science concentration ,  economics minor , summa cum laude Activities and Societies:  Beta Gamma Sigma ,  Cortland College Singers ,  College Court Justice Syracuse University - Martin J. Whitman School of Management M.B.A.,  marketing and information systems , attended on a Syracuse University fellowship and graduated with highest honors. Activities and Societies:  Hendricks Chapel Choir Syracuse University - Martin J. Whitman School of Management M.B.A.,  marketing and information systems , attended on a Syracuse University fellowship and graduated with highest honors. Activities and Societies:  Hendricks Chapel Choir Syracuse University - Martin J. Whitman School of Management M.B.A.,  marketing and information systems , attended on a Syracuse University fellowship and graduated with highest honors. Activities and Societies:  Hendricks Chapel Choir Honors & Awards ", "Experience Marketing Consultant Marketing Consultant April 2014  – Present (1 year 5 months) My passion is marketing, and it is something I enjoy doing whether in a traditional office settings or from the comfort of my living room. I combine industry best practices with my talents and experience to provide marketing services to corporations, entrepreneurs, and non-profits who would like to determine their product/service niche in order to optimize reach and profitability.  \n \nServices have included, but are not limited to: \n- Defining target markets / attracting clients \n- Developing value propositions \n- Constructing integrated marketing strategies \n- Creating marketing collateral \n- Implementing cross cultural marketing understanding and techniques \n- Creating social media campaigns \n- Defining and researching direct and indirect competitors \n- Planning, managing, and executing projects and events  \n \nIndustries & Clients:  \nMarketer for UCB Biopharma, Immunology division \nMarketing Writer for IBM's Samsung account \nMarketing Strategist/Project Planner for Private Practice Physician offices, Photographers, Personal Trainers, Churches, & Non-Profit Organizations Marketing Manager Ecolab June 2012  –  May 2014  (2 years) Alpharetta, GA As Marketing Manager for Ecolab’s Surgical Healthcare division, I had the unique opportunity to launch and support an industry innovation that brought sustainable, green technology to the surgical space. Clinicians described these products as items that should become the industry standard for all surgical drapes. \n \nWhile managing the Surgical Equipment Drapes portfolio comprising of >500 products worth $38M+ in sales, I ensured integrated marketing and branding across all marketing mediums. Duties included having the ability to switch between strategy generation and tactical implementation that resulted in $2.9M increase in sales. \n \nCreating brands, working cross-functionally, and training the sales team while perfecting my project management skills provided career fulfillment. However, I gained the greatest satisfaction knowing that the products I introduced and supported played key roles in keeping patients safe and infection-free during surgery, one of the most vulnerable times in a person’s life. Marketing Manager I Akzo Nobel Car Refinishes June 2009  –  April 2012  (2 years 11 months) Norcross, GA I was involved in various forms of Qualitative and Quantitative Customer Insights research, including Individual Interviews, Ethnography studies, Dyads, and Conjoint Analysis. I learned the art of thriving in the midst of ambiguity and change. \n \nCollaborated with the Executive Director of Marketing, Global Channel Manager, and Sales Manager to gain stakeholder funding and support for product commercialization. \n \nTraditional marketing activities included conducting a detailed SWOT analysis, defining the target market, and working with agency vendors/partners for branding support. Product Manager I, North America Akzo Nobel Car Refinishes July 2007  –  May 2009  (1 year 11 months) Though the Marketing Department that I worked for at AkzoNobel was based in the United States, we had dotted-line reporting to Management in Sassenheim, Netherlands. During my visits to Europe and Canada, I gained global experience that educated me about the importance of cross-cultural understanding. This greatly increased the business effectiveness of my communication independent of the virtual communication method being used with my colleagues. \n \nDaily responsibilities in managing the Sikkens and Lesonal liquid paint products involved collaboration with various departments (Legal, Regulatory, Manufacturing, Purchasing, R&D Scientists, & Product Managers) to ensure successful sales training and product introductions. \n \nDuring this time, I was selected by Senior Management to participate in the professional development Mentoring Program where I partnered with a senior staff member and was tasked to solve a business dilemma in the organization by increasing efficiency and reducing redundancy. Corporate Marketing Associate, Atlanta, GA (MBA INTERNSHIP) Georgia-Pacific, LLC October 2005  –  July 2007  (1 year 10 months) This internship gave me a high level perspective about the importance of linking individual product brands to the company’s corporate identity, brand, and strategy. I gained experience creating marketing materials to include approving corporate print ads with a reach/circulation of 1MM+ readers.  \n \nAdditionally, I supported the Sports Marketing Manager in various sports-related sponsorship events for the corporate Georgia-Pacific brand. This included digital/print marketing collateral for The Georgia Aquarium’s Coldwater Quest exhibit, Philips Arena’s Hawks and Thrashers games, and Nascar’s Jeff Gordon #24 race car. I participated in celebrity photoshoots with Jeff Gordon and 15-second commercial creation for HGTV. \n \nDuring my time as an intern, Koch Industries acquired Georgia- Pacific, which allowed me to witness the triumphs and challenges of integrating through a corporate acquisition. Account Management Co-op (MBA SUMMER INTERNSHIP) Fitzgerald+CO, Atlanta, GA 2005  –  2005  (less than a year) Internship during full-time MBA program. \n \nI learned Advertising from the agency perspective while supporting clients in achieving their advertising, promotions and marketing communications goals. Specialty Professional Sales Representative Johnson & Johnson, Janssen Pharmacuetica division October 1999  –  April 2004  (4 years 7 months) What’s the secret to being effective in sales?  \n \nWhile at Janssen Pharmaceutica, I won the 2002 President’s Trophy award by increasing my territory’s sales position from 244/338 to 9/338 in one year. I also won the Individual Field Sales Director Award by demonstrating a high level of performance in selling skills, product knowledge, and leadership amongst peers. So, while there was no “secret” that I implemented, I worked with integrity and focused on building relationships while establishing trust with my customers. \n \nDuring this time, I enhanced my presentation skills and learned to concisely communicate key information. \n \nI was also selected as a member of the “Management Trainee” program which allowed me to rotate through several marketing departments in the corporate office over a 12-month period, including Sales Support & Promotional Tools, Managed Care contracts, and Meetings& Conventions planning. Marketing Consultant Marketing Consultant April 2014  – Present (1 year 5 months) My passion is marketing, and it is something I enjoy doing whether in a traditional office settings or from the comfort of my living room. I combine industry best practices with my talents and experience to provide marketing services to corporations, entrepreneurs, and non-profits who would like to determine their product/service niche in order to optimize reach and profitability.  \n \nServices have included, but are not limited to: \n- Defining target markets / attracting clients \n- Developing value propositions \n- Constructing integrated marketing strategies \n- Creating marketing collateral \n- Implementing cross cultural marketing understanding and techniques \n- Creating social media campaigns \n- Defining and researching direct and indirect competitors \n- Planning, managing, and executing projects and events  \n \nIndustries & Clients:  \nMarketer for UCB Biopharma, Immunology division \nMarketing Writer for IBM's Samsung account \nMarketing Strategist/Project Planner for Private Practice Physician offices, Photographers, Personal Trainers, Churches, & Non-Profit Organizations Marketing Consultant Marketing Consultant April 2014  – Present (1 year 5 months) My passion is marketing, and it is something I enjoy doing whether in a traditional office settings or from the comfort of my living room. I combine industry best practices with my talents and experience to provide marketing services to corporations, entrepreneurs, and non-profits who would like to determine their product/service niche in order to optimize reach and profitability.  \n \nServices have included, but are not limited to: \n- Defining target markets / attracting clients \n- Developing value propositions \n- Constructing integrated marketing strategies \n- Creating marketing collateral \n- Implementing cross cultural marketing understanding and techniques \n- Creating social media campaigns \n- Defining and researching direct and indirect competitors \n- Planning, managing, and executing projects and events  \n \nIndustries & Clients:  \nMarketer for UCB Biopharma, Immunology division \nMarketing Writer for IBM's Samsung account \nMarketing Strategist/Project Planner for Private Practice Physician offices, Photographers, Personal Trainers, Churches, & Non-Profit Organizations Marketing Manager Ecolab June 2012  –  May 2014  (2 years) Alpharetta, GA As Marketing Manager for Ecolab’s Surgical Healthcare division, I had the unique opportunity to launch and support an industry innovation that brought sustainable, green technology to the surgical space. Clinicians described these products as items that should become the industry standard for all surgical drapes. \n \nWhile managing the Surgical Equipment Drapes portfolio comprising of >500 products worth $38M+ in sales, I ensured integrated marketing and branding across all marketing mediums. Duties included having the ability to switch between strategy generation and tactical implementation that resulted in $2.9M increase in sales. \n \nCreating brands, working cross-functionally, and training the sales team while perfecting my project management skills provided career fulfillment. However, I gained the greatest satisfaction knowing that the products I introduced and supported played key roles in keeping patients safe and infection-free during surgery, one of the most vulnerable times in a person’s life. Marketing Manager Ecolab June 2012  –  May 2014  (2 years) Alpharetta, GA As Marketing Manager for Ecolab’s Surgical Healthcare division, I had the unique opportunity to launch and support an industry innovation that brought sustainable, green technology to the surgical space. Clinicians described these products as items that should become the industry standard for all surgical drapes. \n \nWhile managing the Surgical Equipment Drapes portfolio comprising of >500 products worth $38M+ in sales, I ensured integrated marketing and branding across all marketing mediums. Duties included having the ability to switch between strategy generation and tactical implementation that resulted in $2.9M increase in sales. \n \nCreating brands, working cross-functionally, and training the sales team while perfecting my project management skills provided career fulfillment. However, I gained the greatest satisfaction knowing that the products I introduced and supported played key roles in keeping patients safe and infection-free during surgery, one of the most vulnerable times in a person’s life. Marketing Manager I Akzo Nobel Car Refinishes June 2009  –  April 2012  (2 years 11 months) Norcross, GA I was involved in various forms of Qualitative and Quantitative Customer Insights research, including Individual Interviews, Ethnography studies, Dyads, and Conjoint Analysis. I learned the art of thriving in the midst of ambiguity and change. \n \nCollaborated with the Executive Director of Marketing, Global Channel Manager, and Sales Manager to gain stakeholder funding and support for product commercialization. \n \nTraditional marketing activities included conducting a detailed SWOT analysis, defining the target market, and working with agency vendors/partners for branding support. Marketing Manager I Akzo Nobel Car Refinishes June 2009  –  April 2012  (2 years 11 months) Norcross, GA I was involved in various forms of Qualitative and Quantitative Customer Insights research, including Individual Interviews, Ethnography studies, Dyads, and Conjoint Analysis. I learned the art of thriving in the midst of ambiguity and change. \n \nCollaborated with the Executive Director of Marketing, Global Channel Manager, and Sales Manager to gain stakeholder funding and support for product commercialization. \n \nTraditional marketing activities included conducting a detailed SWOT analysis, defining the target market, and working with agency vendors/partners for branding support. Product Manager I, North America Akzo Nobel Car Refinishes July 2007  –  May 2009  (1 year 11 months) Though the Marketing Department that I worked for at AkzoNobel was based in the United States, we had dotted-line reporting to Management in Sassenheim, Netherlands. During my visits to Europe and Canada, I gained global experience that educated me about the importance of cross-cultural understanding. This greatly increased the business effectiveness of my communication independent of the virtual communication method being used with my colleagues. \n \nDaily responsibilities in managing the Sikkens and Lesonal liquid paint products involved collaboration with various departments (Legal, Regulatory, Manufacturing, Purchasing, R&D Scientists, & Product Managers) to ensure successful sales training and product introductions. \n \nDuring this time, I was selected by Senior Management to participate in the professional development Mentoring Program where I partnered with a senior staff member and was tasked to solve a business dilemma in the organization by increasing efficiency and reducing redundancy. Product Manager I, North America Akzo Nobel Car Refinishes July 2007  –  May 2009  (1 year 11 months) Though the Marketing Department that I worked for at AkzoNobel was based in the United States, we had dotted-line reporting to Management in Sassenheim, Netherlands. During my visits to Europe and Canada, I gained global experience that educated me about the importance of cross-cultural understanding. This greatly increased the business effectiveness of my communication independent of the virtual communication method being used with my colleagues. \n \nDaily responsibilities in managing the Sikkens and Lesonal liquid paint products involved collaboration with various departments (Legal, Regulatory, Manufacturing, Purchasing, R&D Scientists, & Product Managers) to ensure successful sales training and product introductions. \n \nDuring this time, I was selected by Senior Management to participate in the professional development Mentoring Program where I partnered with a senior staff member and was tasked to solve a business dilemma in the organization by increasing efficiency and reducing redundancy. Corporate Marketing Associate, Atlanta, GA (MBA INTERNSHIP) Georgia-Pacific, LLC October 2005  –  July 2007  (1 year 10 months) This internship gave me a high level perspective about the importance of linking individual product brands to the company’s corporate identity, brand, and strategy. I gained experience creating marketing materials to include approving corporate print ads with a reach/circulation of 1MM+ readers.  \n \nAdditionally, I supported the Sports Marketing Manager in various sports-related sponsorship events for the corporate Georgia-Pacific brand. This included digital/print marketing collateral for The Georgia Aquarium’s Coldwater Quest exhibit, Philips Arena’s Hawks and Thrashers games, and Nascar’s Jeff Gordon #24 race car. I participated in celebrity photoshoots with Jeff Gordon and 15-second commercial creation for HGTV. \n \nDuring my time as an intern, Koch Industries acquired Georgia- Pacific, which allowed me to witness the triumphs and challenges of integrating through a corporate acquisition. Corporate Marketing Associate, Atlanta, GA (MBA INTERNSHIP) Georgia-Pacific, LLC October 2005  –  July 2007  (1 year 10 months) This internship gave me a high level perspective about the importance of linking individual product brands to the company’s corporate identity, brand, and strategy. I gained experience creating marketing materials to include approving corporate print ads with a reach/circulation of 1MM+ readers.  \n \nAdditionally, I supported the Sports Marketing Manager in various sports-related sponsorship events for the corporate Georgia-Pacific brand. This included digital/print marketing collateral for The Georgia Aquarium’s Coldwater Quest exhibit, Philips Arena’s Hawks and Thrashers games, and Nascar’s Jeff Gordon #24 race car. I participated in celebrity photoshoots with Jeff Gordon and 15-second commercial creation for HGTV. \n \nDuring my time as an intern, Koch Industries acquired Georgia- Pacific, which allowed me to witness the triumphs and challenges of integrating through a corporate acquisition. Account Management Co-op (MBA SUMMER INTERNSHIP) Fitzgerald+CO, Atlanta, GA 2005  –  2005  (less than a year) Internship during full-time MBA program. \n \nI learned Advertising from the agency perspective while supporting clients in achieving their advertising, promotions and marketing communications goals. Account Management Co-op (MBA SUMMER INTERNSHIP) Fitzgerald+CO, Atlanta, GA 2005  –  2005  (less than a year) Internship during full-time MBA program. \n \nI learned Advertising from the agency perspective while supporting clients in achieving their advertising, promotions and marketing communications goals. Specialty Professional Sales Representative Johnson & Johnson, Janssen Pharmacuetica division October 1999  –  April 2004  (4 years 7 months) What’s the secret to being effective in sales?  \n \nWhile at Janssen Pharmaceutica, I won the 2002 President’s Trophy award by increasing my territory’s sales position from 244/338 to 9/338 in one year. I also won the Individual Field Sales Director Award by demonstrating a high level of performance in selling skills, product knowledge, and leadership amongst peers. So, while there was no “secret” that I implemented, I worked with integrity and focused on building relationships while establishing trust with my customers. \n \nDuring this time, I enhanced my presentation skills and learned to concisely communicate key information. \n \nI was also selected as a member of the “Management Trainee” program which allowed me to rotate through several marketing departments in the corporate office over a 12-month period, including Sales Support & Promotional Tools, Managed Care contracts, and Meetings& Conventions planning. Specialty Professional Sales Representative Johnson & Johnson, Janssen Pharmacuetica division October 1999  –  April 2004  (4 years 7 months) What’s the secret to being effective in sales?  \n \nWhile at Janssen Pharmaceutica, I won the 2002 President’s Trophy award by increasing my territory’s sales position from 244/338 to 9/338 in one year. I also won the Individual Field Sales Director Award by demonstrating a high level of performance in selling skills, product knowledge, and leadership amongst peers. So, while there was no “secret” that I implemented, I worked with integrity and focused on building relationships while establishing trust with my customers. \n \nDuring this time, I enhanced my presentation skills and learned to concisely communicate key information. \n \nI was also selected as a member of the “Management Trainee” program which allowed me to rotate through several marketing departments in the corporate office over a 12-month period, including Sales Support & Promotional Tools, Managed Care contracts, and Meetings& Conventions planning. Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Competitive Analysis Product Development Market Planning Brand Management Segmentation Sales Management Product Pricing Forecasting Marketing Management Pricing Brand Development Sales Management Market Development Email Marketing CRM Sales Process Strategy Sales Operations Marketing Marketing Communications Integrated Marketing Account Management Leadership Customer Insight Project Management Business Strategy See 12+     See less Skills  Competitive Analysis Product Development Market Planning Brand Management Segmentation Sales Management Product Pricing Forecasting Marketing Management Pricing Brand Development Sales Management Market Development Email Marketing CRM Sales Process Strategy Sales Operations Marketing Marketing Communications Integrated Marketing Account Management Leadership Customer Insight Project Management Business Strategy See 12+     See less Competitive Analysis Product Development Market Planning Brand Management Segmentation Sales Management Product Pricing Forecasting Marketing Management Pricing Brand Development Sales Management Market Development Email Marketing CRM Sales Process Strategy Sales Operations Marketing Marketing Communications Integrated Marketing Account Management Leadership Customer Insight Project Management Business Strategy See 12+     See less Competitive Analysis Product Development Market Planning Brand Management Segmentation Sales Management Product Pricing Forecasting Marketing Management Pricing Brand Development Sales Management Market Development Email Marketing CRM Sales Process Strategy Sales Operations Marketing Marketing Communications Integrated Marketing Account Management Leadership Customer Insight Project Management Business Strategy See 12+     See less Education Georgia State University - J. Mack Robinson College of Business MBA,  MBA ,  Marketing concentration Activities and Societies:  NBMBAA; NSHMBA Hampton University BS,  Marketing Activities and Societies:  National Honor Society Xenia High School Activities and Societies:  National Thespian Society;\nHonor Roll Georgia State University - J. Mack Robinson College of Business MBA,  MBA ,  Marketing concentration Activities and Societies:  NBMBAA; NSHMBA Georgia State University - J. Mack Robinson College of Business MBA,  MBA ,  Marketing concentration Activities and Societies:  NBMBAA; NSHMBA Georgia State University - J. Mack Robinson College of Business MBA,  MBA ,  Marketing concentration Activities and Societies:  NBMBAA; NSHMBA Hampton University BS,  Marketing Activities and Societies:  National Honor Society Hampton University BS,  Marketing Activities and Societies:  National Honor Society Hampton University BS,  Marketing Activities and Societies:  National Honor Society Xenia High School Activities and Societies:  National Thespian Society;\nHonor Roll Xenia High School Activities and Societies:  National Thespian Society;\nHonor Roll Xenia High School Activities and Societies:  National Thespian Society;\nHonor Roll ", "Experience Social Media Lead, Business Analytics IBM July 2013  – Present (2 years 2 months) Chicago, IL Managing social media channels to highlight the value IBM analytics brings in improving performance for business, government and educational organizations. \n \nRead the Business Analytics blog at https://www-304.ibm.com/connections/blogs/predictiveanalytics/?lang=en_us Senior Marketing Writer IBM 2009  – Present (6 years) Communications planning and execution for IBM Business Analytics software brand, comprising Cognos, SPSS, Clarity and OpenPages software products. Responsible for: \n* External-facing web content and materials to support marketing campaigns, including brochures, white papers, event promotions, social media \n* Internal-facing newsletters and executive communications Senior Marketing Writer SPSS November 2000  –  October 2009  (9 years) Team lead for writing team: \n* Supervised the work of 5 full-time writers who created all of the data sheets, brochures, white papers, website content, direct mail and other demand generation materials to support SPSS Marketing, including the promotion of webcasts and conferences. \n* Established and maintained SPSS brand standards and then post-acquisition, transitioned to ensure all materials met IBM style and brand standards. \n* Interfaced with public relations and analyst relations and provided support as needed. \n* Managed employee performance and conducted performance reviews. Social Media Lead, Business Analytics IBM July 2013  – Present (2 years 2 months) Chicago, IL Managing social media channels to highlight the value IBM analytics brings in improving performance for business, government and educational organizations. \n \nRead the Business Analytics blog at https://www-304.ibm.com/connections/blogs/predictiveanalytics/?lang=en_us Social Media Lead, Business Analytics IBM July 2013  – Present (2 years 2 months) Chicago, IL Managing social media channels to highlight the value IBM analytics brings in improving performance for business, government and educational organizations. \n \nRead the Business Analytics blog at https://www-304.ibm.com/connections/blogs/predictiveanalytics/?lang=en_us Senior Marketing Writer IBM 2009  – Present (6 years) Communications planning and execution for IBM Business Analytics software brand, comprising Cognos, SPSS, Clarity and OpenPages software products. Responsible for: \n* External-facing web content and materials to support marketing campaigns, including brochures, white papers, event promotions, social media \n* Internal-facing newsletters and executive communications Senior Marketing Writer IBM 2009  – Present (6 years) Communications planning and execution for IBM Business Analytics software brand, comprising Cognos, SPSS, Clarity and OpenPages software products. Responsible for: \n* External-facing web content and materials to support marketing campaigns, including brochures, white papers, event promotions, social media \n* Internal-facing newsletters and executive communications Senior Marketing Writer SPSS November 2000  –  October 2009  (9 years) Team lead for writing team: \n* Supervised the work of 5 full-time writers who created all of the data sheets, brochures, white papers, website content, direct mail and other demand generation materials to support SPSS Marketing, including the promotion of webcasts and conferences. \n* Established and maintained SPSS brand standards and then post-acquisition, transitioned to ensure all materials met IBM style and brand standards. \n* Interfaced with public relations and analyst relations and provided support as needed. \n* Managed employee performance and conducted performance reviews. Senior Marketing Writer SPSS November 2000  –  October 2009  (9 years) Team lead for writing team: \n* Supervised the work of 5 full-time writers who created all of the data sheets, brochures, white papers, website content, direct mail and other demand generation materials to support SPSS Marketing, including the promotion of webcasts and conferences. \n* Established and maintained SPSS brand standards and then post-acquisition, transitioned to ensure all materials met IBM style and brand standards. \n* Interfaced with public relations and analyst relations and provided support as needed. \n* Managed employee performance and conducted performance reviews. Skills Newsletters Social Media Demand Generation Direct Marketing Marketing Leadership Public Relations Lead Generation Email Marketing Web Analytics Creative Direction Strategy Digital Strategy Internal Communications Management Web Content Integrated Marketing Content Management Messaging Corporate Communications B2B Marketing B2B Content Development Blogging Analytics Online Marketing See 11+     See less Skills  Newsletters Social Media Demand Generation Direct Marketing Marketing Leadership Public Relations Lead Generation Email Marketing Web Analytics Creative Direction Strategy Digital Strategy Internal Communications Management Web Content Integrated Marketing Content Management Messaging Corporate Communications B2B Marketing B2B Content Development Blogging Analytics Online Marketing See 11+     See less Newsletters Social Media Demand Generation Direct Marketing Marketing Leadership Public Relations Lead Generation Email Marketing Web Analytics Creative Direction Strategy Digital Strategy Internal Communications Management Web Content Integrated Marketing Content Management Messaging Corporate Communications B2B Marketing B2B Content Development Blogging Analytics Online Marketing See 11+     See less Newsletters Social Media Demand Generation Direct Marketing Marketing Leadership Public Relations Lead Generation Email Marketing Web Analytics Creative Direction Strategy Digital Strategy Internal Communications Management Web Content Integrated Marketing Content Management Messaging Corporate Communications B2B Marketing B2B Content Development Blogging Analytics Online Marketing See 11+     See less Education Northwestern University MSJ,  Journalism Northwestern University MSJ,  Journalism Northwestern University MSJ,  Journalism Northwestern University MSJ,  Journalism ", "Experience Marketing Writer IBM August 2005  – Present (10 years 1 month) Business-to-business and business-to-consumer marketing copy for web, print, video and audio. Teaching Assistant University of Southern California August 2001  –  May 2003  (1 year 10 months) Marketing Writer IBM August 2005  – Present (10 years 1 month) Business-to-business and business-to-consumer marketing copy for web, print, video and audio. Marketing Writer IBM August 2005  – Present (10 years 1 month) Business-to-business and business-to-consumer marketing copy for web, print, video and audio. Teaching Assistant University of Southern California August 2001  –  May 2003  (1 year 10 months) Teaching Assistant University of Southern California August 2001  –  May 2003  (1 year 10 months) Skills Video B2B Content Management Technical Writing Content Development Copywriting Web Content Editing Content Strategy Blogging Web Content Management Social Media Marketing Communications Corporate Communications Internal Communications FrameMaker Scripting Online Help Messaging Copy Editing See 5+     See less Skills  Video B2B Content Management Technical Writing Content Development Copywriting Web Content Editing Content Strategy Blogging Web Content Management Social Media Marketing Communications Corporate Communications Internal Communications FrameMaker Scripting Online Help Messaging Copy Editing See 5+     See less Video B2B Content Management Technical Writing Content Development Copywriting Web Content Editing Content Strategy Blogging Web Content Management Social Media Marketing Communications Corporate Communications Internal Communications FrameMaker Scripting Online Help Messaging Copy Editing See 5+     See less Video B2B Content Management Technical Writing Content Development Copywriting Web Content Editing Content Strategy Blogging Web Content Management Social Media Marketing Communications Corporate Communications Internal Communications FrameMaker Scripting Online Help Messaging Copy Editing See 5+     See less Education University of Southern California MFA,  Dramatic Writing 2001  – 2003 Eastern Oregon University B.S.,  Philosophy ,  Politics ,  & Economics 1996  – 2000 Eastern Oregon University B.S.,  Theatre Arts 1996  – 2000 University of Southern California MFA,  Dramatic Writing 2001  – 2003 University of Southern California MFA,  Dramatic Writing 2001  – 2003 University of Southern California MFA,  Dramatic Writing 2001  – 2003 Eastern Oregon University B.S.,  Philosophy ,  Politics ,  & Economics 1996  – 2000 Eastern Oregon University B.S.,  Philosophy ,  Politics ,  & Economics 1996  – 2000 Eastern Oregon University B.S.,  Philosophy ,  Politics ,  & Economics 1996  – 2000 Eastern Oregon University B.S.,  Theatre Arts 1996  – 2000 Eastern Oregon University B.S.,  Theatre Arts 1996  – 2000 Eastern Oregon University B.S.,  Theatre Arts 1996  – 2000 ", "Skills Social Media Information Architecture Social Media Marketing Marketing Communications Online Advertising Online Marketing Adobe Creative Suite Digital Media Digital Marketing Copy Editing E-commerce Marketing Strategy Digital Strategy Digital Content Content Management Web Content Management Management Content Development Marketing See 4+     See less Skills  Social Media Information Architecture Social Media Marketing Marketing Communications Online Advertising Online Marketing Adobe Creative Suite Digital Media Digital Marketing Copy Editing E-commerce Marketing Strategy Digital Strategy Digital Content Content Management Web Content Management Management Content Development Marketing See 4+     See less Social Media Information Architecture Social Media Marketing Marketing Communications Online Advertising Online Marketing Adobe Creative Suite Digital Media Digital Marketing Copy Editing E-commerce Marketing Strategy Digital Strategy Digital Content Content Management Web Content Management Management Content Development Marketing See 4+     See less Social Media Information Architecture Social Media Marketing Marketing Communications Online Advertising Online Marketing Adobe Creative Suite Digital Media Digital Marketing Copy Editing E-commerce Marketing Strategy Digital Strategy Digital Content Content Management Web Content Management Management Content Development Marketing See 4+     See less ", "Summary Goal: To utilize my knowledge, interpersonal skills, leadership and creative abilities as an individual and a team player by ensuring a strong commitment towards my employer  \n \nProfessional Experience: \nI have overall 6.5 years of work experience. I have worked as a Marketing writer at IBM. I have a passion for writing, training, marketing and business consulting. \n \nSpecialties: Web content writing, Marketing Communication, Digital Marketing, Social media content writing Summary Goal: To utilize my knowledge, interpersonal skills, leadership and creative abilities as an individual and a team player by ensuring a strong commitment towards my employer  \n \nProfessional Experience: \nI have overall 6.5 years of work experience. I have worked as a Marketing writer at IBM. I have a passion for writing, training, marketing and business consulting. \n \nSpecialties: Web content writing, Marketing Communication, Digital Marketing, Social media content writing Goal: To utilize my knowledge, interpersonal skills, leadership and creative abilities as an individual and a team player by ensuring a strong commitment towards my employer  \n \nProfessional Experience: \nI have overall 6.5 years of work experience. I have worked as a Marketing writer at IBM. I have a passion for writing, training, marketing and business consulting. \n \nSpecialties: Web content writing, Marketing Communication, Digital Marketing, Social media content writing Goal: To utilize my knowledge, interpersonal skills, leadership and creative abilities as an individual and a team player by ensuring a strong commitment towards my employer  \n \nProfessional Experience: \nI have overall 6.5 years of work experience. I have worked as a Marketing writer at IBM. I have a passion for writing, training, marketing and business consulting. \n \nSpecialties: Web content writing, Marketing Communication, Digital Marketing, Social media content writing Experience Freelance Writer Freelancer July 2014  – Present (1 year 2 months) Bengaluru Area, India I have worked for IBM as a marketing content writer. I have enjoyed creating social media content, website content, presentations, case studies, whitepaper and solution briefs for IBM. Content writing is my passion and I would like to pursue it as a part-time opportunity.  Marketing Communications Writer IBM December 2010  – Present (4 years 9 months) Bangalore Writing about IBM software products and services for IBM.com website, solution brief, PowerPoint presentations, social media content, data sheet, whitepapers and case studies. Freelance -SMO- Social Media Optimization Specialist Zenopsys July 2009  –  October 2009  (4 months) Business Development Consultant BrickworkIndia Pvt Ltd December 2004  –  January 2007  (2 years 2 months) Freelance Writer Freelancer July 2014  – Present (1 year 2 months) Bengaluru Area, India I have worked for IBM as a marketing content writer. I have enjoyed creating social media content, website content, presentations, case studies, whitepaper and solution briefs for IBM. Content writing is my passion and I would like to pursue it as a part-time opportunity.  Freelance Writer Freelancer July 2014  – Present (1 year 2 months) Bengaluru Area, India I have worked for IBM as a marketing content writer. I have enjoyed creating social media content, website content, presentations, case studies, whitepaper and solution briefs for IBM. Content writing is my passion and I would like to pursue it as a part-time opportunity.  Marketing Communications Writer IBM December 2010  – Present (4 years 9 months) Bangalore Writing about IBM software products and services for IBM.com website, solution brief, PowerPoint presentations, social media content, data sheet, whitepapers and case studies. Marketing Communications Writer IBM December 2010  – Present (4 years 9 months) Bangalore Writing about IBM software products and services for IBM.com website, solution brief, PowerPoint presentations, social media content, data sheet, whitepapers and case studies. Freelance -SMO- Social Media Optimization Specialist Zenopsys July 2009  –  October 2009  (4 months) Freelance -SMO- Social Media Optimization Specialist Zenopsys July 2009  –  October 2009  (4 months) Business Development Consultant BrickworkIndia Pvt Ltd December 2004  –  January 2007  (2 years 2 months) Business Development Consultant BrickworkIndia Pvt Ltd December 2004  –  January 2007  (2 years 2 months) Skills CRM Marketing Communications Management Consulting Writing Presentations Solution Brief Digital Marketing Print ads Captions Skills  CRM Marketing Communications Management Consulting Writing Presentations Solution Brief Digital Marketing Print ads Captions CRM Marketing Communications Management Consulting Writing Presentations Solution Brief Digital Marketing Print ads Captions CRM Marketing Communications Management Consulting Writing Presentations Solution Brief Digital Marketing Print ads Captions "]}