{"position": "Materials Engineer", "company": "Intel Corporation", "profiles": ["Experience Sr. Materials Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, Oregon Photolithography TD Process Engineer Intel May 2004  –  June 2013  (9 years 2 months) Process Engineer Hynix Semiconductor February 2002  –  April 2004  (2 years 3 months) Photolithography process engineer Sr. Materials Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, Oregon Sr. Materials Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, Oregon Photolithography TD Process Engineer Intel May 2004  –  June 2013  (9 years 2 months) Photolithography TD Process Engineer Intel May 2004  –  June 2013  (9 years 2 months) Process Engineer Hynix Semiconductor February 2002  –  April 2004  (2 years 3 months) Photolithography process engineer Process Engineer Hynix Semiconductor February 2002  –  April 2004  (2 years 3 months) Photolithography process engineer Skills Photolithography Semiconductor... SPC JMP Semiconductor Equipment Metrology Device Physics Lithography Semiconductor Industry Technology Development Semiconductors Failure Analysis Materials Science Silicon Design of Experiments Thin Films Physics CVD Characterization See 4+     See less Skills  Photolithography Semiconductor... SPC JMP Semiconductor Equipment Metrology Device Physics Lithography Semiconductor Industry Technology Development Semiconductors Failure Analysis Materials Science Silicon Design of Experiments Thin Films Physics CVD Characterization See 4+     See less Photolithography Semiconductor... SPC JMP Semiconductor Equipment Metrology Device Physics Lithography Semiconductor Industry Technology Development Semiconductors Failure Analysis Materials Science Silicon Design of Experiments Thin Films Physics CVD Characterization See 4+     See less Photolithography Semiconductor... SPC JMP Semiconductor Equipment Metrology Device Physics Lithography Semiconductor Industry Technology Development Semiconductors Failure Analysis Materials Science Silicon Design of Experiments Thin Films Physics CVD Characterization See 4+     See less Education University of Oregon Masters of Science,  Chemistry 2001  – 2002 University of Portland BS,  Chemistry 1999  – 2001 University of Oregon Masters of Science,  Chemistry 2001  – 2002 University of Oregon Masters of Science,  Chemistry 2001  – 2002 University of Oregon Masters of Science,  Chemistry 2001  – 2002 University of Portland BS,  Chemistry 1999  – 2001 University of Portland BS,  Chemistry 1999  – 2001 University of Portland BS,  Chemistry 1999  – 2001 ", "Experience Materials Engineer Intel Corporation February 2009  – Present (6 years 7 months) Materials Engineer Intel Corporation February 2009  – Present (6 years 7 months) Materials Engineer Intel Corporation February 2009  – Present (6 years 7 months) Languages Spanish Spanish Spanish Skills Semiconductors Engineering Solidworks JMP Labview Manufacturing R&D Manufacturing... Mechanical Engineering AutoCAD Product Development SolidWorks Skills  Semiconductors Engineering Solidworks JMP Labview Manufacturing R&D Manufacturing... Mechanical Engineering AutoCAD Product Development SolidWorks Semiconductors Engineering Solidworks JMP Labview Manufacturing R&D Manufacturing... Mechanical Engineering AutoCAD Product Development SolidWorks Semiconductors Engineering Solidworks JMP Labview Manufacturing R&D Manufacturing... Mechanical Engineering AutoCAD Product Development SolidWorks Education University of California, Berkeley Bachelor of Science (B.S.),  Mechanical Engineering 2005  – 2009 University of California, Berkeley Bachelor of Science (B.S.),  Mechanical Engineering 2005  – 2009 University of California, Berkeley Bachelor of Science (B.S.),  Mechanical Engineering 2005  – 2009 University of California, Berkeley Bachelor of Science (B.S.),  Mechanical Engineering 2005  – 2009 ", "Experience Materials Engineer Intel Corporation July 2004  – Present (11 years 2 months) Materials Engineer Intel Corporation July 2004  – Present (11 years 2 months) Materials Engineer Intel Corporation July 2004  – Present (11 years 2 months) ", "Experience materials engineer Intel Corporation materials engineer Intel Corporation materials engineer Intel Corporation ", "Experience Materials Engineer Intel Corporation January 2006  – Present (9 years 8 months) Engineer Merix Corporation 1997  –  2006  (9 years) Materials Engineer Intel Corporation January 2006  – Present (9 years 8 months) Materials Engineer Intel Corporation January 2006  – Present (9 years 8 months) Engineer Merix Corporation 1997  –  2006  (9 years) Engineer Merix Corporation 1997  –  2006  (9 years) Skills SPC Cross-functional Team... Electronics Product Engineering Lean Manufacturing Product Development Failure Analysis 5S Design of Experiments Engineering Manufacturing Semiconductor Industry Six Sigma Design for Manufacturing JMP FMEA DMAIC Materials Science Engineering Management ISO MEMS Supply Chain Management Process Engineering Semiconductors R&D Materials Manufacturing... Supply Management Continuous Improvement Quality System Kaizen Root Cause Analysis PCB design Metrology Manufacturing... Process Simulation Supplier Quality Quality Assurance Characterization Process Improvement Thin Films Program Management See 27+     See less Skills  SPC Cross-functional Team... Electronics Product Engineering Lean Manufacturing Product Development Failure Analysis 5S Design of Experiments Engineering Manufacturing Semiconductor Industry Six Sigma Design for Manufacturing JMP FMEA DMAIC Materials Science Engineering Management ISO MEMS Supply Chain Management Process Engineering Semiconductors R&D Materials Manufacturing... Supply Management Continuous Improvement Quality System Kaizen Root Cause Analysis PCB design Metrology Manufacturing... Process Simulation Supplier Quality Quality Assurance Characterization Process Improvement Thin Films Program Management See 27+     See less SPC Cross-functional Team... Electronics Product Engineering Lean Manufacturing Product Development Failure Analysis 5S Design of Experiments Engineering Manufacturing Semiconductor Industry Six Sigma Design for Manufacturing JMP FMEA DMAIC Materials Science Engineering Management ISO MEMS Supply Chain Management Process Engineering Semiconductors R&D Materials Manufacturing... Supply Management Continuous Improvement Quality System Kaizen Root Cause Analysis PCB design Metrology Manufacturing... Process Simulation Supplier Quality Quality Assurance Characterization Process Improvement Thin Films Program Management See 27+     See less SPC Cross-functional Team... Electronics Product Engineering Lean Manufacturing Product Development Failure Analysis 5S Design of Experiments Engineering Manufacturing Semiconductor Industry Six Sigma Design for Manufacturing JMP FMEA DMAIC Materials Science Engineering Management ISO MEMS Supply Chain Management Process Engineering Semiconductors R&D Materials Manufacturing... Supply Management Continuous Improvement Quality System Kaizen Root Cause Analysis PCB design Metrology Manufacturing... Process Simulation Supplier Quality Quality Assurance Characterization Process Improvement Thin Films Program Management See 27+     See less ", "Skills Business Strategy Corporate Development Product Marketing Product Development Product Strategy Business Management Entrepreneurship Financial Modeling New Venture Creation New Venture Development Venture Financing New Business Development Technology... Entrepreneurial... Small Business... International Business Process Engineering Disaster Preparedness Disaster Recovery Quality Management Technology Development Technology Transfer Real Estate Development Real Estate Investment International Real... Management Consulting Venture Capital Business Development Commercialization Program Management Management Investment Properties Product Management See 18+     See less Skills  Business Strategy Corporate Development Product Marketing Product Development Product Strategy Business Management Entrepreneurship Financial Modeling New Venture Creation New Venture Development Venture Financing New Business Development Technology... Entrepreneurial... Small Business... International Business Process Engineering Disaster Preparedness Disaster Recovery Quality Management Technology Development Technology Transfer Real Estate Development Real Estate Investment International Real... Management Consulting Venture Capital Business Development Commercialization Program Management Management Investment Properties Product Management See 18+     See less Business Strategy Corporate Development Product Marketing Product Development Product Strategy Business Management Entrepreneurship Financial Modeling New Venture Creation New Venture Development Venture Financing New Business Development Technology... Entrepreneurial... Small Business... International Business Process Engineering Disaster Preparedness Disaster Recovery Quality Management Technology Development Technology Transfer Real Estate Development Real Estate Investment International Real... Management Consulting Venture Capital Business Development Commercialization Program Management Management Investment Properties Product Management See 18+     See less Business Strategy Corporate Development Product Marketing Product Development Product Strategy Business Management Entrepreneurship Financial Modeling New Venture Creation New Venture Development Venture Financing New Business Development Technology... Entrepreneurial... Small Business... International Business Process Engineering Disaster Preparedness Disaster Recovery Quality Management Technology Development Technology Transfer Real Estate Development Real Estate Investment International Real... Management Consulting Venture Capital Business Development Commercialization Program Management Management Investment Properties Product Management See 18+     See less ", "Summary Specialties:* 193nm immersion lithography. Experience with ASML and Nikon scanners.  \n* Expertise in TEL litho tracks  \n* Experience with anhydrous HF etches for MEMS releases processes \n* SEM, TEM, AFM, XPS, GC-MS, XRD and Spectroscopic Ellipsometry analysis. Summary Specialties:* 193nm immersion lithography. Experience with ASML and Nikon scanners.  \n* Expertise in TEL litho tracks  \n* Experience with anhydrous HF etches for MEMS releases processes \n* SEM, TEM, AFM, XPS, GC-MS, XRD and Spectroscopic Ellipsometry analysis. Specialties:* 193nm immersion lithography. Experience with ASML and Nikon scanners.  \n* Expertise in TEL litho tracks  \n* Experience with anhydrous HF etches for MEMS releases processes \n* SEM, TEM, AFM, XPS, GC-MS, XRD and Spectroscopic Ellipsometry analysis. Specialties:* 193nm immersion lithography. Experience with ASML and Nikon scanners.  \n* Expertise in TEL litho tracks  \n* Experience with anhydrous HF etches for MEMS releases processes \n* SEM, TEM, AFM, XPS, GC-MS, XRD and Spectroscopic Ellipsometry analysis. Experience Sr. Materials Engineer Intel Corporation January 2014  – Present (1 year 8 months) Intel Fab Materials Operations - Silicon Wafer Development Sr. Materials Engineer Intel Corporation January 2014  – Present (1 year 8 months) Intel Fab Materials Operations - Silicon Wafer Development Sr. Materials Engineer Intel Corporation January 2014  – Present (1 year 8 months) Intel Fab Materials Operations - Silicon Wafer Development Skills Lithography Thin Films XPS Powder X-ray Diffraction Silicon Semiconductors TEM Process Simulation MEMS Materials Skills  Lithography Thin Films XPS Powder X-ray Diffraction Silicon Semiconductors TEM Process Simulation MEMS Materials Lithography Thin Films XPS Powder X-ray Diffraction Silicon Semiconductors TEM Process Simulation MEMS Materials Lithography Thin Films XPS Powder X-ray Diffraction Silicon Semiconductors TEM Process Simulation MEMS Materials Education Penn State University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2003  – 2008 Penn State University Master of Science (M.S.),  Electrical Engineering 2001  – 2003 Activities and Societies:  IEEE and ECS Bharathiar University B.E.,  Electrical Engineering 1996  – 2000 Carmel Garden MHSS HSC,  Science 1982  – 1996 Penn State University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2003  – 2008 Penn State University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2003  – 2008 Penn State University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2003  – 2008 Penn State University Master of Science (M.S.),  Electrical Engineering 2001  – 2003 Activities and Societies:  IEEE and ECS Penn State University Master of Science (M.S.),  Electrical Engineering 2001  – 2003 Activities and Societies:  IEEE and ECS Penn State University Master of Science (M.S.),  Electrical Engineering 2001  – 2003 Activities and Societies:  IEEE and ECS Bharathiar University B.E.,  Electrical Engineering 1996  – 2000 Bharathiar University B.E.,  Electrical Engineering 1996  – 2000 Bharathiar University B.E.,  Electrical Engineering 1996  – 2000 Carmel Garden MHSS HSC,  Science 1982  – 1996 Carmel Garden MHSS HSC,  Science 1982  – 1996 Carmel Garden MHSS HSC,  Science 1982  – 1996 ", "Experience Materials Engineer Intel Corporation July 2010  – Present (5 years 2 months) Student University of Massachusetts Amherst 2004  –  April 2011  (7 years) scientist Center for Liquid Crystal Research and Foundation, India 2003  –  2004  (1 year) Materials Engineer Intel Corporation July 2010  – Present (5 years 2 months) Materials Engineer Intel Corporation July 2010  – Present (5 years 2 months) Student University of Massachusetts Amherst 2004  –  April 2011  (7 years) Student University of Massachusetts Amherst 2004  –  April 2011  (7 years) scientist Center for Liquid Crystal Research and Foundation, India 2003  –  2004  (1 year) scientist Center for Liquid Crystal Research and Foundation, India 2003  –  2004  (1 year) Skills Characterization Scanning Electron... Spectroscopy Science Materials Science Thin Films AFM Skills  Characterization Scanning Electron... Spectroscopy Science Materials Science Thin Films AFM Characterization Scanning Electron... Spectroscopy Science Materials Science Thin Films AFM Characterization Scanning Electron... Spectroscopy Science Materials Science Thin Films AFM Education University of Massachusetts, Amherst PhD 2004  – 2009 University of Massachusetts, Amherst PhD 2004  – 2009 University of Massachusetts, Amherst PhD 2004  – 2009 University of Massachusetts, Amherst PhD 2004  – 2009 ", "Experience Materials Engineer Intel Corporation May 2012  – Present (3 years 4 months) Materials Engineer Naval Surface Warfare Center January 2012  –  April 2012  (4 months) Indian Head, MD Failure Analyst Stanley Associates, Inc June 2009  –  December 2011  (2 years 7 months) Huintsville, AL Root cause failure analysis on aerospace components. Materials Engineer Intel Corporation May 2012  – Present (3 years 4 months) Materials Engineer Intel Corporation May 2012  – Present (3 years 4 months) Materials Engineer Naval Surface Warfare Center January 2012  –  April 2012  (4 months) Indian Head, MD Materials Engineer Naval Surface Warfare Center January 2012  –  April 2012  (4 months) Indian Head, MD Failure Analyst Stanley Associates, Inc June 2009  –  December 2011  (2 years 7 months) Huintsville, AL Root cause failure analysis on aerospace components. Failure Analyst Stanley Associates, Inc June 2009  –  December 2011  (2 years 7 months) Huintsville, AL Root cause failure analysis on aerospace components. Education University of Alabama PhD,  Metallurgical Engineering 2004  – 2008 University of Alabama MS,  Metallurgical Engineering 2002  – 2004 University of Alabama BS,  Metallurgical Engineering 1997  – 2001 Activities and Societies:  Theta Tau ,  TMS ,  ASM ,  FEF University of Alabama PhD,  Metallurgical Engineering 2004  – 2008 University of Alabama PhD,  Metallurgical Engineering 2004  – 2008 University of Alabama PhD,  Metallurgical Engineering 2004  – 2008 University of Alabama MS,  Metallurgical Engineering 2002  – 2004 University of Alabama MS,  Metallurgical Engineering 2002  – 2004 University of Alabama MS,  Metallurgical Engineering 2002  – 2004 University of Alabama BS,  Metallurgical Engineering 1997  – 2001 Activities and Societies:  Theta Tau ,  TMS ,  ASM ,  FEF University of Alabama BS,  Metallurgical Engineering 1997  – 2001 Activities and Societies:  Theta Tau ,  TMS ,  ASM ,  FEF University of Alabama BS,  Metallurgical Engineering 1997  – 2001 Activities and Societies:  Theta Tau ,  TMS ,  ASM ,  FEF ", "Experience Materials Engineer Intel Corporation July 2012  – Present (3 years 2 months) Shenzhen, Guangdong, China Mechanical Engineer Oticon China August 2008  –  July 2012  (4 years) - Responsible for sourcing development and project management of projects running in China.  \n- Source best supplier for different categories considering cost, capability and quality.  \n- Audit new supplier on site and provide report with cost comparison. Discuss with overseas team to make decision.  \n- RFQ, price and payment term negotiation  \n- Manage project by following up on schedule and coordinating global team/internal source and suppliers.  \n- Review Tooling design and FOT sample before submitting to Denmark team.  \n- Working with supplier on pre-production stage, verify the working instruction and inspection instruction of supplier.  \n- Weekly video meeting with global sites  \n- Optimize the system and procedure of the office regarding supplier audit, supplier performance management and working procedure with global sites. Sourcing Buyer Laird Technologies December 2007  –  June 2008  (7 months) Shenzhen - Working for Thermal unit (Melcor, Thermagon and Supercool) for material localization. \n- Support to project team to move manufacturing of product from USA to Shenzhen plant. \n- Main commodity is heat sink, fan, cable/wire and sheet metal part. Sourcing Engineer Emerson August 2005  –  December 2007  (2 years 5 months) Identify opportunities for material localization, considering product's technical requirements and find the right supplier with best total cost \n- Initiate cost reduction project with engineering team and supplier to do contribution on material cost saving, e.g. revise the specification with material replacement or figure change  \n- Provide sourcing support to new product development, propose material or provide specification information to project team and evaluate part cost \n- Conduct reverse auction bidding on web based system, get cost saving and terms benefit. Negotiate agreement terms with suppliers.  \n- Work with global commodity team to implement commodity strategy on global managed commodities \n- Draft and implement strategy on site managed commodities \n \n- Perform supplier audit and make sourcing decision considering cost, capability, quality assurance and so on \n- Do project management on sourcing projects, work with internal departments and suppliers to make sure project implemented within schedule \n- Manage supplier rating, monitor supplier cost, quality and OTD performance \n- Create and maintain the capacity data base of major commodities. \n- Take RoHS management on the responsible commodities Product Engineer Foxconn July 2004  –  August 2005  (1 year 2 months) Responsible for the new product introduction of mobile phone product \n- Design review on customer drawing, communicate with customer and internal tooling designer on part or tooling design issues  \n- Follow the plastic/stamping tooling fabrication, tooling trial and 1st article sample review  \n- Follow the pilot run of secondary process, e.g. painting and plating, work with assembly workshop to set up assembly line and solve issues before mass production. \n- Do test on mechanical part and final cell phone, e.g. drop test \n- Submit sample and FAI report to customer, analyze the feedback of customer and call project meeting to make improvement when necessary \n- resolve the quality issue at the beginning of mass production \n- Do coordination with cross function departments; assist project manager with other task assigned \n \nTraining \n2005/12 RoHS/WEEE Training conducted by SGS \n2003/01 Microsoft MCSE certificate training \n2010/8 Internal Auditor of SA8000, by Bureau Veritas Materials Engineer Intel Corporation July 2012  – Present (3 years 2 months) Shenzhen, Guangdong, China Materials Engineer Intel Corporation July 2012  – Present (3 years 2 months) Shenzhen, Guangdong, China Mechanical Engineer Oticon China August 2008  –  July 2012  (4 years) - Responsible for sourcing development and project management of projects running in China.  \n- Source best supplier for different categories considering cost, capability and quality.  \n- Audit new supplier on site and provide report with cost comparison. Discuss with overseas team to make decision.  \n- RFQ, price and payment term negotiation  \n- Manage project by following up on schedule and coordinating global team/internal source and suppliers.  \n- Review Tooling design and FOT sample before submitting to Denmark team.  \n- Working with supplier on pre-production stage, verify the working instruction and inspection instruction of supplier.  \n- Weekly video meeting with global sites  \n- Optimize the system and procedure of the office regarding supplier audit, supplier performance management and working procedure with global sites. Mechanical Engineer Oticon China August 2008  –  July 2012  (4 years) - Responsible for sourcing development and project management of projects running in China.  \n- Source best supplier for different categories considering cost, capability and quality.  \n- Audit new supplier on site and provide report with cost comparison. Discuss with overseas team to make decision.  \n- RFQ, price and payment term negotiation  \n- Manage project by following up on schedule and coordinating global team/internal source and suppliers.  \n- Review Tooling design and FOT sample before submitting to Denmark team.  \n- Working with supplier on pre-production stage, verify the working instruction and inspection instruction of supplier.  \n- Weekly video meeting with global sites  \n- Optimize the system and procedure of the office regarding supplier audit, supplier performance management and working procedure with global sites. Sourcing Buyer Laird Technologies December 2007  –  June 2008  (7 months) Shenzhen - Working for Thermal unit (Melcor, Thermagon and Supercool) for material localization. \n- Support to project team to move manufacturing of product from USA to Shenzhen plant. \n- Main commodity is heat sink, fan, cable/wire and sheet metal part. Sourcing Buyer Laird Technologies December 2007  –  June 2008  (7 months) Shenzhen - Working for Thermal unit (Melcor, Thermagon and Supercool) for material localization. \n- Support to project team to move manufacturing of product from USA to Shenzhen plant. \n- Main commodity is heat sink, fan, cable/wire and sheet metal part. Sourcing Engineer Emerson August 2005  –  December 2007  (2 years 5 months) Identify opportunities for material localization, considering product's technical requirements and find the right supplier with best total cost \n- Initiate cost reduction project with engineering team and supplier to do contribution on material cost saving, e.g. revise the specification with material replacement or figure change  \n- Provide sourcing support to new product development, propose material or provide specification information to project team and evaluate part cost \n- Conduct reverse auction bidding on web based system, get cost saving and terms benefit. Negotiate agreement terms with suppliers.  \n- Work with global commodity team to implement commodity strategy on global managed commodities \n- Draft and implement strategy on site managed commodities \n \n- Perform supplier audit and make sourcing decision considering cost, capability, quality assurance and so on \n- Do project management on sourcing projects, work with internal departments and suppliers to make sure project implemented within schedule \n- Manage supplier rating, monitor supplier cost, quality and OTD performance \n- Create and maintain the capacity data base of major commodities. \n- Take RoHS management on the responsible commodities Sourcing Engineer Emerson August 2005  –  December 2007  (2 years 5 months) Identify opportunities for material localization, considering product's technical requirements and find the right supplier with best total cost \n- Initiate cost reduction project with engineering team and supplier to do contribution on material cost saving, e.g. revise the specification with material replacement or figure change  \n- Provide sourcing support to new product development, propose material or provide specification information to project team and evaluate part cost \n- Conduct reverse auction bidding on web based system, get cost saving and terms benefit. Negotiate agreement terms with suppliers.  \n- Work with global commodity team to implement commodity strategy on global managed commodities \n- Draft and implement strategy on site managed commodities \n \n- Perform supplier audit and make sourcing decision considering cost, capability, quality assurance and so on \n- Do project management on sourcing projects, work with internal departments and suppliers to make sure project implemented within schedule \n- Manage supplier rating, monitor supplier cost, quality and OTD performance \n- Create and maintain the capacity data base of major commodities. \n- Take RoHS management on the responsible commodities Product Engineer Foxconn July 2004  –  August 2005  (1 year 2 months) Responsible for the new product introduction of mobile phone product \n- Design review on customer drawing, communicate with customer and internal tooling designer on part or tooling design issues  \n- Follow the plastic/stamping tooling fabrication, tooling trial and 1st article sample review  \n- Follow the pilot run of secondary process, e.g. painting and plating, work with assembly workshop to set up assembly line and solve issues before mass production. \n- Do test on mechanical part and final cell phone, e.g. drop test \n- Submit sample and FAI report to customer, analyze the feedback of customer and call project meeting to make improvement when necessary \n- resolve the quality issue at the beginning of mass production \n- Do coordination with cross function departments; assist project manager with other task assigned \n \nTraining \n2005/12 RoHS/WEEE Training conducted by SGS \n2003/01 Microsoft MCSE certificate training \n2010/8 Internal Auditor of SA8000, by Bureau Veritas Product Engineer Foxconn July 2004  –  August 2005  (1 year 2 months) Responsible for the new product introduction of mobile phone product \n- Design review on customer drawing, communicate with customer and internal tooling designer on part or tooling design issues  \n- Follow the plastic/stamping tooling fabrication, tooling trial and 1st article sample review  \n- Follow the pilot run of secondary process, e.g. painting and plating, work with assembly workshop to set up assembly line and solve issues before mass production. \n- Do test on mechanical part and final cell phone, e.g. drop test \n- Submit sample and FAI report to customer, analyze the feedback of customer and call project meeting to make improvement when necessary \n- resolve the quality issue at the beginning of mass production \n- Do coordination with cross function departments; assist project manager with other task assigned \n \nTraining \n2005/12 RoHS/WEEE Training conducted by SGS \n2003/01 Microsoft MCSE certificate training \n2010/8 Internal Auditor of SA8000, by Bureau Veritas Education Chang'an University Bachelor,  Mechanica Engineering 2000  – 2004 Chang'an University Bachelor,  Mechanica Engineering 2000  – 2004 Chang'an University Bachelor,  Mechanica Engineering 2000  – 2004 Chang'an University Bachelor,  Mechanica Engineering 2000  – 2004 ", "Experience Materials Engineer Intel Corporation September 1994  – Present (21 years) Intern USG January 1986  –  December 1988  (3 years) Materials Engineer Intel Corporation September 1994  – Present (21 years) Materials Engineer Intel Corporation September 1994  – Present (21 years) Intern USG January 1986  –  December 1988  (3 years) Intern USG January 1986  –  December 1988  (3 years) Education University of Washington PhD,  Chemical Engineering 1989  – 1994 University of Wisconsin-Madison BS,  Chemical Engineering 1984  – 1989 University of Washington PhD,  Chemical Engineering 1989  – 1994 University of Washington PhD,  Chemical Engineering 1989  – 1994 University of Washington PhD,  Chemical Engineering 1989  – 1994 University of Wisconsin-Madison BS,  Chemical Engineering 1984  – 1989 University of Wisconsin-Madison BS,  Chemical Engineering 1984  – 1989 University of Wisconsin-Madison BS,  Chemical Engineering 1984  – 1989 ", "Experience Senior Materials Engineer Intel Corporation July 2013  – Present (2 years 2 months) Fab Materials Operation Senior Process Engineer Intel Corporation September 2005  –  July 2013  (7 years 11 months) Portland, Oregon Area Technology Development \n- Micro-contamination Engineer. \n- Vertical Diffusion Furnace Engineer. Research Assistant, Environmental Engineering Department University of Connecticut June 2004  –  August 2005  (1 year 3 months) Storrs, CT Project: Comparison of Ultrafine Particle Emissions from Hybrid-Electric and Particle-Trap Diesel Connecticut Transit Buses. Senior Materials Engineer Intel Corporation July 2013  – Present (2 years 2 months) Fab Materials Operation Senior Materials Engineer Intel Corporation July 2013  – Present (2 years 2 months) Fab Materials Operation Senior Process Engineer Intel Corporation September 2005  –  July 2013  (7 years 11 months) Portland, Oregon Area Technology Development \n- Micro-contamination Engineer. \n- Vertical Diffusion Furnace Engineer. Senior Process Engineer Intel Corporation September 2005  –  July 2013  (7 years 11 months) Portland, Oregon Area Technology Development \n- Micro-contamination Engineer. \n- Vertical Diffusion Furnace Engineer. Research Assistant, Environmental Engineering Department University of Connecticut June 2004  –  August 2005  (1 year 3 months) Storrs, CT Project: Comparison of Ultrafine Particle Emissions from Hybrid-Electric and Particle-Trap Diesel Connecticut Transit Buses. Research Assistant, Environmental Engineering Department University of Connecticut June 2004  –  August 2005  (1 year 3 months) Storrs, CT Project: Comparison of Ultrafine Particle Emissions from Hybrid-Electric and Particle-Trap Diesel Connecticut Transit Buses. Languages Spanish Spanish Spanish Skills Design of Experiments Semiconductors JMP CVD Matlab Air Pollution C Scanning Electron... Fortran APC FMEA SQL Materials Supply Chain Management Supply Chain Operations Industrial Gases Semiconductor Process Atomic Layer Deposition See 3+     See less Skills  Design of Experiments Semiconductors JMP CVD Matlab Air Pollution C Scanning Electron... Fortran APC FMEA SQL Materials Supply Chain Management Supply Chain Operations Industrial Gases Semiconductor Process Atomic Layer Deposition See 3+     See less Design of Experiments Semiconductors JMP CVD Matlab Air Pollution C Scanning Electron... Fortran APC FMEA SQL Materials Supply Chain Management Supply Chain Operations Industrial Gases Semiconductor Process Atomic Layer Deposition See 3+     See less Design of Experiments Semiconductors JMP CVD Matlab Air Pollution C Scanning Electron... Fortran APC FMEA SQL Materials Supply Chain Management Supply Chain Operations Industrial Gases Semiconductor Process Atomic Layer Deposition See 3+     See less Education The University of Connecticut Doctor of Philosophy (Ph.D.),  Chemical Engineering 2005 Universidad Industrial de Santander Bachelor's degree,  Chemical Engineering The University of Connecticut Doctor of Philosophy (Ph.D.),  Chemical Engineering 2005 The University of Connecticut Doctor of Philosophy (Ph.D.),  Chemical Engineering 2005 The University of Connecticut Doctor of Philosophy (Ph.D.),  Chemical Engineering 2005 Universidad Industrial de Santander Bachelor's degree,  Chemical Engineering Universidad Industrial de Santander Bachelor's degree,  Chemical Engineering Universidad Industrial de Santander Bachelor's degree,  Chemical Engineering ", "Experience Supplier Quality (quality Release) Manager Boston Scientific March 2015  – Present (6 months) coyol Responsable of leading Supplier Quality an Incoming Inspection Team. Doc Center/Quality Release Supervisor Boston Scientific October 2013  –  March 2015  (1 year 6 months) Coyol, Costa Rica Responsible for the supervision and management of Document Services at Coyol. This includes been the SME at the site in regards to Doc Control and Records and assure process is compliant to QSR, EN-ISO 13485 and MDD.  \nAlso responsible to the Quality Release process that includes the final revision of material before is shipped to the respective distribution site. Sr. Supplier Quality Engineer Boston Scientific Costa Rica December 2009  –  September 2013  (3 years 10 months) Responsible for the management and execution of the supplier Quality Program in Costa Rica site and acts as the quality system input person. \nWork closely with Materials and R&D Department to efficiently select, qualify and manage all levels of supplier to consistently meet product quality requirements. \nTechnical owner for process improvement project such as altenartive measurements, value improvement projects, qualification of suppliers or testing methodologies on supplier's data. Commodity Engineer Intel Corporation Costa Rica November 2007  –  November 2009  (2 years 1 month) Key contact window between factory materials engineer (FMEs) and suppliers; manage and improve supplier quality systems, support materials excursion management and execute value engineering projects. Also supoort development & ramp by understanding the technical details of polymer/flux and solder chemistry, manufacture process, material property affect on yield and reliability and Assembly Test manufacturing process. \nIntel Supplier Champion, this rol serve as single point of contact not only on a technical degree but envelops commercial, quality, development and high volume across differente commodities. Resposible of providing feedback, training and key messages from the corporation. \nResponsible to audit polymer/flux and solder chemistry suppliers used across all Intel facilities world wide. Lead auditor and participant on multiple supplier audits. Factory Materials Engineer Intel Corporation Costa Rica January 2003  –  October 2007  (4 years 10 months) As a Factory Material Engineer, supported high volume manufacturing (HVM) in the area of Materials Engineering following excursion management process and communication with supplier, as well as managemente of material changes through qualifications. \nPart of Early Envolvenment Team of an upcoming new technology. This activity included been the main driver of presenting overall status materials deliverables to integration in the new status of the project and data review. Was the owner to assure readiness of all materials at HVM sites such as EHS requirements, module readiness and material readiness. \nPart of an interdisciplinary team responsible to audit CR Raw material suppliers, mainly as a participant. Materials Engineer Intel Corporation Costa Rica July 2003  –  December 2003  (6 months) Ownership of a gross reality check on some materials that present some realibility problems \nDead Inventory Project Ownership, this project desires to optimize the space utilization in the different WH locations by reducing the amount of dead inventory or inventory with no rotation. Mathematics Project Investigation\"Assistant Universidad de Costa Rica January 2001  –  January 2002  (1 year 1 month) Help in the editing of the text book of Linear Algebra. Calculus Teacher Colegio Bilingüe San Pablo March 2001  –  July 2001  (5 months) Gave the first trimester of calculus as a substitute teacher. Supplier Quality (quality Release) Manager Boston Scientific March 2015  – Present (6 months) coyol Responsable of leading Supplier Quality an Incoming Inspection Team. Supplier Quality (quality Release) Manager Boston Scientific March 2015  – Present (6 months) coyol Responsable of leading Supplier Quality an Incoming Inspection Team. Doc Center/Quality Release Supervisor Boston Scientific October 2013  –  March 2015  (1 year 6 months) Coyol, Costa Rica Responsible for the supervision and management of Document Services at Coyol. This includes been the SME at the site in regards to Doc Control and Records and assure process is compliant to QSR, EN-ISO 13485 and MDD.  \nAlso responsible to the Quality Release process that includes the final revision of material before is shipped to the respective distribution site. Doc Center/Quality Release Supervisor Boston Scientific October 2013  –  March 2015  (1 year 6 months) Coyol, Costa Rica Responsible for the supervision and management of Document Services at Coyol. This includes been the SME at the site in regards to Doc Control and Records and assure process is compliant to QSR, EN-ISO 13485 and MDD.  \nAlso responsible to the Quality Release process that includes the final revision of material before is shipped to the respective distribution site. Sr. Supplier Quality Engineer Boston Scientific Costa Rica December 2009  –  September 2013  (3 years 10 months) Responsible for the management and execution of the supplier Quality Program in Costa Rica site and acts as the quality system input person. \nWork closely with Materials and R&D Department to efficiently select, qualify and manage all levels of supplier to consistently meet product quality requirements. \nTechnical owner for process improvement project such as altenartive measurements, value improvement projects, qualification of suppliers or testing methodologies on supplier's data. Sr. Supplier Quality Engineer Boston Scientific Costa Rica December 2009  –  September 2013  (3 years 10 months) Responsible for the management and execution of the supplier Quality Program in Costa Rica site and acts as the quality system input person. \nWork closely with Materials and R&D Department to efficiently select, qualify and manage all levels of supplier to consistently meet product quality requirements. \nTechnical owner for process improvement project such as altenartive measurements, value improvement projects, qualification of suppliers or testing methodologies on supplier's data. Commodity Engineer Intel Corporation Costa Rica November 2007  –  November 2009  (2 years 1 month) Key contact window between factory materials engineer (FMEs) and suppliers; manage and improve supplier quality systems, support materials excursion management and execute value engineering projects. Also supoort development & ramp by understanding the technical details of polymer/flux and solder chemistry, manufacture process, material property affect on yield and reliability and Assembly Test manufacturing process. \nIntel Supplier Champion, this rol serve as single point of contact not only on a technical degree but envelops commercial, quality, development and high volume across differente commodities. Resposible of providing feedback, training and key messages from the corporation. \nResponsible to audit polymer/flux and solder chemistry suppliers used across all Intel facilities world wide. Lead auditor and participant on multiple supplier audits. Commodity Engineer Intel Corporation Costa Rica November 2007  –  November 2009  (2 years 1 month) Key contact window between factory materials engineer (FMEs) and suppliers; manage and improve supplier quality systems, support materials excursion management and execute value engineering projects. Also supoort development & ramp by understanding the technical details of polymer/flux and solder chemistry, manufacture process, material property affect on yield and reliability and Assembly Test manufacturing process. \nIntel Supplier Champion, this rol serve as single point of contact not only on a technical degree but envelops commercial, quality, development and high volume across differente commodities. Resposible of providing feedback, training and key messages from the corporation. \nResponsible to audit polymer/flux and solder chemistry suppliers used across all Intel facilities world wide. Lead auditor and participant on multiple supplier audits. Factory Materials Engineer Intel Corporation Costa Rica January 2003  –  October 2007  (4 years 10 months) As a Factory Material Engineer, supported high volume manufacturing (HVM) in the area of Materials Engineering following excursion management process and communication with supplier, as well as managemente of material changes through qualifications. \nPart of Early Envolvenment Team of an upcoming new technology. This activity included been the main driver of presenting overall status materials deliverables to integration in the new status of the project and data review. Was the owner to assure readiness of all materials at HVM sites such as EHS requirements, module readiness and material readiness. \nPart of an interdisciplinary team responsible to audit CR Raw material suppliers, mainly as a participant. Factory Materials Engineer Intel Corporation Costa Rica January 2003  –  October 2007  (4 years 10 months) As a Factory Material Engineer, supported high volume manufacturing (HVM) in the area of Materials Engineering following excursion management process and communication with supplier, as well as managemente of material changes through qualifications. \nPart of Early Envolvenment Team of an upcoming new technology. This activity included been the main driver of presenting overall status materials deliverables to integration in the new status of the project and data review. Was the owner to assure readiness of all materials at HVM sites such as EHS requirements, module readiness and material readiness. \nPart of an interdisciplinary team responsible to audit CR Raw material suppliers, mainly as a participant. Materials Engineer Intel Corporation Costa Rica July 2003  –  December 2003  (6 months) Ownership of a gross reality check on some materials that present some realibility problems \nDead Inventory Project Ownership, this project desires to optimize the space utilization in the different WH locations by reducing the amount of dead inventory or inventory with no rotation. Materials Engineer Intel Corporation Costa Rica July 2003  –  December 2003  (6 months) Ownership of a gross reality check on some materials that present some realibility problems \nDead Inventory Project Ownership, this project desires to optimize the space utilization in the different WH locations by reducing the amount of dead inventory or inventory with no rotation. Mathematics Project Investigation\"Assistant Universidad de Costa Rica January 2001  –  January 2002  (1 year 1 month) Help in the editing of the text book of Linear Algebra. Mathematics Project Investigation\"Assistant Universidad de Costa Rica January 2001  –  January 2002  (1 year 1 month) Help in the editing of the text book of Linear Algebra. Calculus Teacher Colegio Bilingüe San Pablo March 2001  –  July 2001  (5 months) Gave the first trimester of calculus as a substitute teacher. Calculus Teacher Colegio Bilingüe San Pablo March 2001  –  July 2001  (5 months) Gave the first trimester of calculus as a substitute teacher. Skills Continuous Improvement Process Improvement Six Sigma Certified Lead Auditor Manufacturing Quality Assurance Project Management Quality System Testing FMEA Validation Management Root Cause Analysis Supply Chain SPC Leadership Supplier Quality See 2+     See less Skills  Continuous Improvement Process Improvement Six Sigma Certified Lead Auditor Manufacturing Quality Assurance Project Management Quality System Testing FMEA Validation Management Root Cause Analysis Supply Chain SPC Leadership Supplier Quality See 2+     See less Continuous Improvement Process Improvement Six Sigma Certified Lead Auditor Manufacturing Quality Assurance Project Management Quality System Testing FMEA Validation Management Root Cause Analysis Supply Chain SPC Leadership Supplier Quality See 2+     See less Continuous Improvement Process Improvement Six Sigma Certified Lead Auditor Manufacturing Quality Assurance Project Management Quality System Testing FMEA Validation Management Root Cause Analysis Supply Chain SPC Leadership Supplier Quality See 2+     See less Education 2010 Universidad de Cooperación Internacional Barrio Escalante Master,  Project Management 2010  – 2011 2010 Universidad de Costa Rica San Pedro Bachelor of Science (BSc),  Licenciatura Chemical Engineering; Chemical Engineering 1997  – 2003 Universidad de Costa Rica Licentiate degree,  Chemical Engineering 1997  – 2003 AAMI Applus Auditor Lider de Calidad Azociacione Culturale Dante Alighieri San Pedro Italiano,  Lengua y literatura italiana Completed courses on italian language and its culture. Colegio Saint Paul Friedrich Ebert Foundation Pavas Participated in a 1 year leadership training for youth. 2010 Universidad de Cooperación Internacional Barrio Escalante Master,  Project Management 2010  – 2011 2010 Universidad de Cooperación Internacional Barrio Escalante Master,  Project Management 2010  – 2011 2010 Universidad de Cooperación Internacional Barrio Escalante Master,  Project Management 2010  – 2011 2010 Universidad de Costa Rica San Pedro Bachelor of Science (BSc),  Licenciatura Chemical Engineering; Chemical Engineering 1997  – 2003 2010 Universidad de Costa Rica San Pedro Bachelor of Science (BSc),  Licenciatura Chemical Engineering; Chemical Engineering 1997  – 2003 2010 Universidad de Costa Rica San Pedro Bachelor of Science (BSc),  Licenciatura Chemical Engineering; Chemical Engineering 1997  – 2003 Universidad de Costa Rica Licentiate degree,  Chemical Engineering 1997  – 2003 Universidad de Costa Rica Licentiate degree,  Chemical Engineering 1997  – 2003 Universidad de Costa Rica Licentiate degree,  Chemical Engineering 1997  – 2003 AAMI AAMI AAMI Applus Auditor Lider de Calidad Applus Auditor Lider de Calidad Applus Auditor Lider de Calidad Azociacione Culturale Dante Alighieri San Pedro Italiano,  Lengua y literatura italiana Completed courses on italian language and its culture. Azociacione Culturale Dante Alighieri San Pedro Italiano,  Lengua y literatura italiana Completed courses on italian language and its culture. Azociacione Culturale Dante Alighieri San Pedro Italiano,  Lengua y literatura italiana Completed courses on italian language and its culture. Colegio Saint Paul Colegio Saint Paul Colegio Saint Paul Friedrich Ebert Foundation Pavas Participated in a 1 year leadership training for youth. Friedrich Ebert Foundation Pavas Participated in a 1 year leadership training for youth. Friedrich Ebert Foundation Pavas Participated in a 1 year leadership training for youth. ", "Experience Materials Engineer Intel Corporation November 2014  – Present (10 months) Portland, Oregon Area Engineering Manager Intel Corporation October 2012  –  October 2014  (2 years 1 month) Portland, Oregon Area Staff Engineer Intel Corporation July 2012  –  October 2012  (4 months) Portland, Oregon Area Engineering Manager at Intel China Intel Corporation January 2008  –  June 2012  (4 years 6 months) Dalian, Liaoning, China Sr Process Engineer Intel June 2002  –  December 2007  (5 years 7 months) Portland, Oregon Area Materials Engineer Intel Corporation November 2014  – Present (10 months) Portland, Oregon Area Materials Engineer Intel Corporation November 2014  – Present (10 months) Portland, Oregon Area Engineering Manager Intel Corporation October 2012  –  October 2014  (2 years 1 month) Portland, Oregon Area Engineering Manager Intel Corporation October 2012  –  October 2014  (2 years 1 month) Portland, Oregon Area Staff Engineer Intel Corporation July 2012  –  October 2012  (4 months) Portland, Oregon Area Staff Engineer Intel Corporation July 2012  –  October 2012  (4 months) Portland, Oregon Area Engineering Manager at Intel China Intel Corporation January 2008  –  June 2012  (4 years 6 months) Dalian, Liaoning, China Engineering Manager at Intel China Intel Corporation January 2008  –  June 2012  (4 years 6 months) Dalian, Liaoning, China Sr Process Engineer Intel June 2002  –  December 2007  (5 years 7 months) Portland, Oregon Area Sr Process Engineer Intel June 2002  –  December 2007  (5 years 7 months) Portland, Oregon Area Languages Chinese Chinese Chinese Skills Photolithography Materials Silicon Semiconductors Semiconductor Industry Manufacturing JMP Design of Experiments Engineering Management FIB CMOS Physics Lithography IC Thin Films CVD Metrology Failure Analysis PVD Lean Manufacturing SEM UHV See 7+     See less Skills  Photolithography Materials Silicon Semiconductors Semiconductor Industry Manufacturing JMP Design of Experiments Engineering Management FIB CMOS Physics Lithography IC Thin Films CVD Metrology Failure Analysis PVD Lean Manufacturing SEM UHV See 7+     See less Photolithography Materials Silicon Semiconductors Semiconductor Industry Manufacturing JMP Design of Experiments Engineering Management FIB CMOS Physics Lithography IC Thin Films CVD Metrology Failure Analysis PVD Lean Manufacturing SEM UHV See 7+     See less Photolithography Materials Silicon Semiconductors Semiconductor Industry Manufacturing JMP Design of Experiments Engineering Management FIB CMOS Physics Lithography IC Thin Films CVD Metrology Failure Analysis PVD Lean Manufacturing SEM UHV See 7+     See less Education University of Cincinnati Ph.D.,  Electrical Engineering 1996  – 2002 Tsinghua University MS,  Materials Science 1994  – 1996 Tsinghua University BE,  Materials Science and Engineering 1989  – 1994 University of Cincinnati Ph.D.,  Electrical Engineering 1996  – 2002 University of Cincinnati Ph.D.,  Electrical Engineering 1996  – 2002 University of Cincinnati Ph.D.,  Electrical Engineering 1996  – 2002 Tsinghua University MS,  Materials Science 1994  – 1996 Tsinghua University MS,  Materials Science 1994  – 1996 Tsinghua University MS,  Materials Science 1994  – 1996 Tsinghua University BE,  Materials Science and Engineering 1989  – 1994 Tsinghua University BE,  Materials Science and Engineering 1989  – 1994 Tsinghua University BE,  Materials Science and Engineering 1989  – 1994 ", "Experience Senior Materials Engineer Intel Corporation Senior Materials Engineer Intel Corporation Senior Materials Engineer Intel Corporation ", "Experience Senior Materials Engineer Intel Corporation August 2013  – Present (2 years 1 month) Chandler, Arioza Graduate Research Assistant Georgia Institute of Technology August 2007  –  August 2013  (6 years 1 month) Application of microfluidics to research on C. elegans nematodes with focus on culturing and tracking of animals on microfluidic chip for purposes of studying genetics and synapse development and eventually for performing drug screens. Part Time Consultant and Translator Kraj. Co. LLC August 2005  –  April 2010  (4 years 9 months) Student Supervisor University of Florida Software Licensing Services January 2004  –  May 2007  (3 years 5 months) Senior Materials Engineer Intel Corporation August 2013  – Present (2 years 1 month) Chandler, Arioza Senior Materials Engineer Intel Corporation August 2013  – Present (2 years 1 month) Chandler, Arioza Graduate Research Assistant Georgia Institute of Technology August 2007  –  August 2013  (6 years 1 month) Application of microfluidics to research on C. elegans nematodes with focus on culturing and tracking of animals on microfluidic chip for purposes of studying genetics and synapse development and eventually for performing drug screens. Graduate Research Assistant Georgia Institute of Technology August 2007  –  August 2013  (6 years 1 month) Application of microfluidics to research on C. elegans nematodes with focus on culturing and tracking of animals on microfluidic chip for purposes of studying genetics and synapse development and eventually for performing drug screens. Part Time Consultant and Translator Kraj. Co. LLC August 2005  –  April 2010  (4 years 9 months) Part Time Consultant and Translator Kraj. Co. LLC August 2005  –  April 2010  (4 years 9 months) Student Supervisor University of Florida Software Licensing Services January 2004  –  May 2007  (3 years 5 months) Student Supervisor University of Florida Software Licensing Services January 2004  –  May 2007  (3 years 5 months) Skills Cell Culture Microfabrication Bioengineering Microfluidics Research Skills  Cell Culture Microfabrication Bioengineering Microfluidics Research Cell Culture Microfabrication Bioengineering Microfluidics Research Cell Culture Microfabrication Bioengineering Microfluidics Research Education Georgia Institute of Technology 2007  – 2012 University of Florida BS,  Chemical Engineering 2003  – 2007 Georgia Institute of Technology 2007  – 2012 Georgia Institute of Technology 2007  – 2012 Georgia Institute of Technology 2007  – 2012 University of Florida BS,  Chemical Engineering 2003  – 2007 University of Florida BS,  Chemical Engineering 2003  – 2007 University of Florida BS,  Chemical Engineering 2003  – 2007 ", "Experience Senior Materials Engineer Intel Corporation 2003  –  June 2010  (7 years) Responsible for supplier and material technical and production quality for surface mount materials Rotation Engineer Intel Corporation 2002  –  2003  (1 year) Rotated through positions in different departments during one year Intel program for Recent College Graduates Senior Materials Engineer Intel Corporation 2003  –  June 2010  (7 years) Responsible for supplier and material technical and production quality for surface mount materials Senior Materials Engineer Intel Corporation 2003  –  June 2010  (7 years) Responsible for supplier and material technical and production quality for surface mount materials Rotation Engineer Intel Corporation 2002  –  2003  (1 year) Rotated through positions in different departments during one year Intel program for Recent College Graduates Rotation Engineer Intel Corporation 2002  –  2003  (1 year) Rotated through positions in different departments during one year Intel program for Recent College Graduates Skills Failure Analysis Design of Experiments JMP Semiconductors Characterization Materials Science SPC Powder X-ray Diffraction Scanning Electron... Skills  Failure Analysis Design of Experiments JMP Semiconductors Characterization Materials Science SPC Powder X-ray Diffraction Scanning Electron... Failure Analysis Design of Experiments JMP Semiconductors Characterization Materials Science SPC Powder X-ray Diffraction Scanning Electron... Failure Analysis Design of Experiments JMP Semiconductors Characterization Materials Science SPC Powder X-ray Diffraction Scanning Electron... Education Iowa State University MS,  Materials Science and Engineering 2002 Iowa State University BS,  Materials Engineering 2001 Iowa State University MS,  Materials Science and Engineering 2002 Iowa State University MS,  Materials Science and Engineering 2002 Iowa State University MS,  Materials Science and Engineering 2002 Iowa State University BS,  Materials Engineering 2001 Iowa State University BS,  Materials Engineering 2001 Iowa State University BS,  Materials Engineering 2001 ", "Experience Materials Engineer Intel Corporation November 2000  – Present (14 years 10 months) Materials Test Engineer Honeywell June 1998  –  November 2000  (2 years 6 months) Materials Engineer Intel Corporation November 2000  – Present (14 years 10 months) Materials Engineer Intel Corporation November 2000  – Present (14 years 10 months) Materials Test Engineer Honeywell June 1998  –  November 2000  (2 years 6 months) Materials Test Engineer Honeywell June 1998  –  November 2000  (2 years 6 months) Skills Failure Analysis Design of Experiments Thin Films JMP Semiconductors Characterization Silicon Skills  Failure Analysis Design of Experiments Thin Films JMP Semiconductors Characterization Silicon Failure Analysis Design of Experiments Thin Films JMP Semiconductors Characterization Silicon Failure Analysis Design of Experiments Thin Films JMP Semiconductors Characterization Silicon Education Arizona State University Arizona State University Arizona State University Arizona State University ", "Experience Materials Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro Oregon Sr Field Applications Engineer Multek October 2005  –  July 2013  (7 years 10 months) Sr. Field Applications Engineer Merix Corporation June 1994  –  October 2005  (11 years 5 months) Mechanical Process Engineer Tektronix May 1992  –  May 1994  (2 years 1 month) Materials Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro Oregon Materials Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro Oregon Sr Field Applications Engineer Multek October 2005  –  July 2013  (7 years 10 months) Sr Field Applications Engineer Multek October 2005  –  July 2013  (7 years 10 months) Sr. Field Applications Engineer Merix Corporation June 1994  –  October 2005  (11 years 5 months) Sr. Field Applications Engineer Merix Corporation June 1994  –  October 2005  (11 years 5 months) Mechanical Process Engineer Tektronix May 1992  –  May 1994  (2 years 1 month) Mechanical Process Engineer Tektronix May 1992  –  May 1994  (2 years 1 month) Skills PCB design Manufacturing Design for Manufacturing Electronics SPC Engineering Management Failure Analysis Design of Experiments Continuous Improvement Quality System R&D Manufacturing... FMEA Process Engineering Cross-functional Team... Management Lean Manufacturing Product Development Engineering Six Sigma IPC PCB Design for... PCB Impedance modeling Product Design RoHS Kaizen Component Engineering APSIM RLGC See 13+     See less Skills  PCB design Manufacturing Design for Manufacturing Electronics SPC Engineering Management Failure Analysis Design of Experiments Continuous Improvement Quality System R&D Manufacturing... FMEA Process Engineering Cross-functional Team... Management Lean Manufacturing Product Development Engineering Six Sigma IPC PCB Design for... PCB Impedance modeling Product Design RoHS Kaizen Component Engineering APSIM RLGC See 13+     See less PCB design Manufacturing Design for Manufacturing Electronics SPC Engineering Management Failure Analysis Design of Experiments Continuous Improvement Quality System R&D Manufacturing... FMEA Process Engineering Cross-functional Team... Management Lean Manufacturing Product Development Engineering Six Sigma IPC PCB Design for... PCB Impedance modeling Product Design RoHS Kaizen Component Engineering APSIM RLGC See 13+     See less PCB design Manufacturing Design for Manufacturing Electronics SPC Engineering Management Failure Analysis Design of Experiments Continuous Improvement Quality System R&D Manufacturing... FMEA Process Engineering Cross-functional Team... Management Lean Manufacturing Product Development Engineering Six Sigma IPC PCB Design for... PCB Impedance modeling Product Design RoHS Kaizen Component Engineering APSIM RLGC See 13+     See less Education Montana State University-Bozeman BSME,  Mechanical Engineering 1984  – 1992 Activities and Societies:  Tau Beta Pi (National Engineering Honor Society) Montana State University-Bozeman BSME,  Mechanical Engineering 1984  – 1992 Activities and Societies:  Tau Beta Pi (National Engineering Honor Society) Montana State University-Bozeman BSME,  Mechanical Engineering 1984  – 1992 Activities and Societies:  Tau Beta Pi (National Engineering Honor Society) Montana State University-Bozeman BSME,  Mechanical Engineering 1984  – 1992 Activities and Societies:  Tau Beta Pi (National Engineering Honor Society) "]}