{"position": "Mechanical TD Engineer", "company": "Intel Corporation", "profiles": ["Summary Material science engineer with background in mechanical and materials testing, experience in electronics manufacturing, and skills in finite-element analysis. Summary Material science engineer with background in mechanical and materials testing, experience in electronics manufacturing, and skills in finite-element analysis. Material science engineer with background in mechanical and materials testing, experience in electronics manufacturing, and skills in finite-element analysis. Material science engineer with background in mechanical and materials testing, experience in electronics manufacturing, and skills in finite-element analysis. Experience Mechanical TD Engineer Intel Corporation April 2002  – Present (13 years 5 months) Hillsboro, OR Responsible for developing core competencies in mechanical metrology and methodology, encompassing both experimental and analytical, to facilitate adoption of new chip packaging and to drive higher interconnect density. \n \n● Assume leadership role in development of FEA and metrology techniques to improve core competency in mechanical capabilities. \n● Leverage capabilities in metrology and analysis to realize cost reduction, to optimize designs, to influence industry through JEDEC/IPC, and to enable new product launch at OEM/ODM partners. \n● Partner with internal development groups to develop new technologies in PCB and PCB assembly, CPU sockets, and sort/test probes. \n● Develop new Monte Carlo analysis tools using Python and Matlab to assess manufacturing robustness of new technologies. \n● Promoted and won numerous awards for consistently innovating new solutions and extracting value from applied R&D. Process Engineer Intel Corporation 1997  –  2002  (5 years) Hillsboro, OR Responsible for developing PCB and electronics assembly processes and delivering manufacturing solutions that meet objectives for throughput, design, total cost, reliability, and assembly ergonomics. \n \n● Use FMEA to prioritize risk, fractional factorial DOE’s to screen for effects, and passive data collection (PDC) to qualify large footprint flip chip package for SMT. \n● Responsible for continuous improvement of wave soldering process. \n● Implemented process monitor and response flow to improve process Cpk and to avoid unnecessary capital expenditure. \n● Create DFM rules to improve assembly yields, quality, and assembly ergonomics. \n● Lead cross-functional teams to drive part cost reductions and launch new assembly processes at HVM sites. \n● Promoted for consistent performance in delivering high quality manufacturing solutions and for recovering schedule of supporting products needed to enable new CPU introduction. Research Assistant Pacific Northwest National Laboratory 1995  –  1997  (2 years) Richland, WA Study the fundamental science of high temperature solid-oxide fuel cells (SOFC). Responsible for creating tools and applying EIS to study of SOFC cathode materials. \n \n● Designed and assembled equipment to accurately measure the electrical conductivity of oxygen conducting solid electrolytes. Integrated data acquisition with temperature control to allow for an automated process \n● Applied electrochemical impedance spectroscopy (EIS) to characterize solid oxide cathode performance on zirconia. Identified a previously unrecognized source of experimental error and developed a mitigating solution. Mechanical TD Engineer Intel Corporation April 2002  – Present (13 years 5 months) Hillsboro, OR Responsible for developing core competencies in mechanical metrology and methodology, encompassing both experimental and analytical, to facilitate adoption of new chip packaging and to drive higher interconnect density. \n \n● Assume leadership role in development of FEA and metrology techniques to improve core competency in mechanical capabilities. \n● Leverage capabilities in metrology and analysis to realize cost reduction, to optimize designs, to influence industry through JEDEC/IPC, and to enable new product launch at OEM/ODM partners. \n● Partner with internal development groups to develop new technologies in PCB and PCB assembly, CPU sockets, and sort/test probes. \n● Develop new Monte Carlo analysis tools using Python and Matlab to assess manufacturing robustness of new technologies. \n● Promoted and won numerous awards for consistently innovating new solutions and extracting value from applied R&D. Mechanical TD Engineer Intel Corporation April 2002  – Present (13 years 5 months) Hillsboro, OR Responsible for developing core competencies in mechanical metrology and methodology, encompassing both experimental and analytical, to facilitate adoption of new chip packaging and to drive higher interconnect density. \n \n● Assume leadership role in development of FEA and metrology techniques to improve core competency in mechanical capabilities. \n● Leverage capabilities in metrology and analysis to realize cost reduction, to optimize designs, to influence industry through JEDEC/IPC, and to enable new product launch at OEM/ODM partners. \n● Partner with internal development groups to develop new technologies in PCB and PCB assembly, CPU sockets, and sort/test probes. \n● Develop new Monte Carlo analysis tools using Python and Matlab to assess manufacturing robustness of new technologies. \n● Promoted and won numerous awards for consistently innovating new solutions and extracting value from applied R&D. Process Engineer Intel Corporation 1997  –  2002  (5 years) Hillsboro, OR Responsible for developing PCB and electronics assembly processes and delivering manufacturing solutions that meet objectives for throughput, design, total cost, reliability, and assembly ergonomics. \n \n● Use FMEA to prioritize risk, fractional factorial DOE’s to screen for effects, and passive data collection (PDC) to qualify large footprint flip chip package for SMT. \n● Responsible for continuous improvement of wave soldering process. \n● Implemented process monitor and response flow to improve process Cpk and to avoid unnecessary capital expenditure. \n● Create DFM rules to improve assembly yields, quality, and assembly ergonomics. \n● Lead cross-functional teams to drive part cost reductions and launch new assembly processes at HVM sites. \n● Promoted for consistent performance in delivering high quality manufacturing solutions and for recovering schedule of supporting products needed to enable new CPU introduction. Process Engineer Intel Corporation 1997  –  2002  (5 years) Hillsboro, OR Responsible for developing PCB and electronics assembly processes and delivering manufacturing solutions that meet objectives for throughput, design, total cost, reliability, and assembly ergonomics. \n \n● Use FMEA to prioritize risk, fractional factorial DOE’s to screen for effects, and passive data collection (PDC) to qualify large footprint flip chip package for SMT. \n● Responsible for continuous improvement of wave soldering process. \n● Implemented process monitor and response flow to improve process Cpk and to avoid unnecessary capital expenditure. \n● Create DFM rules to improve assembly yields, quality, and assembly ergonomics. \n● Lead cross-functional teams to drive part cost reductions and launch new assembly processes at HVM sites. \n● Promoted for consistent performance in delivering high quality manufacturing solutions and for recovering schedule of supporting products needed to enable new CPU introduction. Research Assistant Pacific Northwest National Laboratory 1995  –  1997  (2 years) Richland, WA Study the fundamental science of high temperature solid-oxide fuel cells (SOFC). Responsible for creating tools and applying EIS to study of SOFC cathode materials. \n \n● Designed and assembled equipment to accurately measure the electrical conductivity of oxygen conducting solid electrolytes. Integrated data acquisition with temperature control to allow for an automated process \n● Applied electrochemical impedance spectroscopy (EIS) to characterize solid oxide cathode performance on zirconia. Identified a previously unrecognized source of experimental error and developed a mitigating solution. Research Assistant Pacific Northwest National Laboratory 1995  –  1997  (2 years) Richland, WA Study the fundamental science of high temperature solid-oxide fuel cells (SOFC). Responsible for creating tools and applying EIS to study of SOFC cathode materials. \n \n● Designed and assembled equipment to accurately measure the electrical conductivity of oxygen conducting solid electrolytes. Integrated data acquisition with temperature control to allow for an automated process \n● Applied electrochemical impedance spectroscopy (EIS) to characterize solid oxide cathode performance on zirconia. Identified a previously unrecognized source of experimental error and developed a mitigating solution. Skills Abaqus Abaqus CAE Finite Element Analysis Thermal Electrical... Mechanical Modeling Python Scientific Computing Design of Experiments Response Surface... Numerical Modeling Data Analysis JMP Microsoft Office Microsoft Excel Mechanical Testing Materials Testing Material Analysis Electronics... PCB assembly SMT Wave Solder Project Management Sort Probe Electrochemical... Matlab See 10+     See less Skills  Abaqus Abaqus CAE Finite Element Analysis Thermal Electrical... Mechanical Modeling Python Scientific Computing Design of Experiments Response Surface... Numerical Modeling Data Analysis JMP Microsoft Office Microsoft Excel Mechanical Testing Materials Testing Material Analysis Electronics... PCB assembly SMT Wave Solder Project Management Sort Probe Electrochemical... Matlab See 10+     See less Abaqus Abaqus CAE Finite Element Analysis Thermal Electrical... Mechanical Modeling Python Scientific Computing Design of Experiments Response Surface... Numerical Modeling Data Analysis JMP Microsoft Office Microsoft Excel Mechanical Testing Materials Testing Material Analysis Electronics... PCB assembly SMT Wave Solder Project Management Sort Probe Electrochemical... Matlab See 10+     See less Abaqus Abaqus CAE Finite Element Analysis Thermal Electrical... Mechanical Modeling Python Scientific Computing Design of Experiments Response Surface... Numerical Modeling Data Analysis JMP Microsoft Office Microsoft Excel Mechanical Testing Materials Testing Material Analysis Electronics... PCB assembly SMT Wave Solder Project Management Sort Probe Electrochemical... Matlab See 10+     See less Education Northwestern University - McCormick School of Engineering and Applied Sciences Doctor of Philosophy (Ph.D.),  Materials Science 1993  – 1997 University of Pennsylvania - School of Engineering and Applied Science Bachelor of Science and Engineering (B.S.E.),  Materials Science 1989  – 1993 Northwestern University - McCormick School of Engineering and Applied Sciences Doctor of Philosophy (Ph.D.),  Materials Science 1993  – 1997 Northwestern University - McCormick School of Engineering and Applied Sciences Doctor of Philosophy (Ph.D.),  Materials Science 1993  – 1997 Northwestern University - McCormick School of Engineering and Applied Sciences Doctor of Philosophy (Ph.D.),  Materials Science 1993  – 1997 University of Pennsylvania - School of Engineering and Applied Science Bachelor of Science and Engineering (B.S.E.),  Materials Science 1989  – 1993 University of Pennsylvania - School of Engineering and Applied Science Bachelor of Science and Engineering (B.S.E.),  Materials Science 1989  – 1993 University of Pennsylvania - School of Engineering and Applied Science Bachelor of Science and Engineering (B.S.E.),  Materials Science 1989  – 1993 Honors & Awards National Science Foundation Graduate Research Fellowship National Defense Science and Engineering Graduate Fellowship National Science Foundation Graduate Research Fellowship National Science Foundation Graduate Research Fellowship National Science Foundation Graduate Research Fellowship National Defense Science and Engineering Graduate Fellowship National Defense Science and Engineering Graduate Fellowship National Defense Science and Engineering Graduate Fellowship ", "Experience Mechanical TD Engineer Intel Corporation September 2014  – Present (1 year) Senior Reliability Engineer Intel Corporation August 2004  –  September 2014  (10 years 2 months) Reliability predictions, risk assessment and resolution of technology issues introduced at the board level \nSocket/Connector design and field reliability risk predictions Mechanical TD Engineer Intel Corporation September 2014  – Present (1 year) Mechanical TD Engineer Intel Corporation September 2014  – Present (1 year) Senior Reliability Engineer Intel Corporation August 2004  –  September 2014  (10 years 2 months) Reliability predictions, risk assessment and resolution of technology issues introduced at the board level \nSocket/Connector design and field reliability risk predictions Senior Reliability Engineer Intel Corporation August 2004  –  September 2014  (10 years 2 months) Reliability predictions, risk assessment and resolution of technology issues introduced at the board level \nSocket/Connector design and field reliability risk predictions Skills Semiconductors Simulations Semiconductor Industry Reliability Skills  Semiconductors Simulations Semiconductor Industry Reliability Semiconductors Simulations Semiconductor Industry Reliability Semiconductors Simulations Semiconductor Industry Reliability Education University of Maryland College Park PhD,  Mechanical Engineering 2000  – 2004 University of Maryland College Park PhD,  Mechanical Engineering 2000  – 2004 University of Maryland College Park PhD,  Mechanical Engineering 2000  – 2004 University of Maryland College Park PhD,  Mechanical Engineering 2000  – 2004 ", "Experience Camera hardware Apple March 2015  – Present (6 months) 12 Maskit st., Herzeliya Pituah, Israel Mechanical TD Engineer Intel Corporation September 2011  –  February 2015  (3 years 6 months) Portland, Oregon Area Technology Development MEMS Modeling Engineer Cavendish Kinetics December 2010  –  August 2011  (9 months) San Jose, CA Assistant Project Scientist UC San Diego August 2008  –  July 2010  (2 years) Greater San Diego Area MEMS - Micro Electro Mechanical Systems: RF MEMS. Modeling, design and fabrication of novel electrostatic switches and switched capacitors with low sensitivity to temperature and residual stresses. \n \n• Developed new designs of electrostatic RF MEMS switches and tunable capacitors with very low sensitivity to temperature and residual stresses. \n• Succeeded in building a MEMS tunable capacitor with analog tunability which is very challenging to the inherent mechanical instability of the device under electrostatic actuation. \n• Developed new MEMS capacitive switches with very low temperature-sensitivity. For these devices, the change in the up-state capacitance was < 4% at 25-125C and the change in the pull-in voltage was <100 mV/C. Other designs also exhibit a change in the pull-in voltage of <60 mV/C. These are considered to be one of the most temperature stable RF MEMS devices ever developed. \n• Developed capacitive miniature switch with pull-down and pull-up electrodes for high power applications. Postdoctoral Researcher University of Pennsylvania September 2006  –  July 2008  (1 year 11 months) Philadelphia, PA MEMS - Micro Electro Mechanical Systems: MEMS piezoelectric resonators and switches, Finite element analysis, Analytical dynamics, Microsystem design and fabrication. \n \n• Developed the first piezoelectric Aluminum Nitride (AlN) RF switch which is monolithically integrated with piezoelectric resonators and filters. The switch mechanism is designed in such a way that the device performance is insensitive to residual stresses and ambient temperature. Furthermore, the monolithic integration of the switch and the recently introduced contour-mode resonator technology can significantly affect the design of new RF front-ends by impacting their size, power efficiency and also drastically reducing parasitics and off-state leakage. Such integration will enable new RF architectures based on large arrays of switched multi-frequency AlN contour-mode resonators.  \n• Worked on developing a nano-electromechanical piezoelectric switch for logic gate applications. The results was shown that a nano cantilever beam, L =5-18 um, w =2-4 um, t=0.35 um, with an ultra thin piezoelectric layer ~100 nm can be fabricated and actuated with excellent performances. This make the AlN a very promising piezoelectric material for nano-electro-mechanical switches for low power logic applications. Teaching Assistant Technion - Israel Institute of Technology October 2000  –  July 2006  (5 years 10 months) Haifa Teaching Assistant of : \n“Dynamics” 2000 – 2006 \n“Introduction to Control and Automation” 2000 – 2006 \n“Laboratory of Manufacturing System”\t2003 \n“Experimental Methods” 2001 Camera hardware Apple March 2015  – Present (6 months) 12 Maskit st., Herzeliya Pituah, Israel Camera hardware Apple March 2015  – Present (6 months) 12 Maskit st., Herzeliya Pituah, Israel Mechanical TD Engineer Intel Corporation September 2011  –  February 2015  (3 years 6 months) Portland, Oregon Area Technology Development Mechanical TD Engineer Intel Corporation September 2011  –  February 2015  (3 years 6 months) Portland, Oregon Area Technology Development MEMS Modeling Engineer Cavendish Kinetics December 2010  –  August 2011  (9 months) San Jose, CA MEMS Modeling Engineer Cavendish Kinetics December 2010  –  August 2011  (9 months) San Jose, CA Assistant Project Scientist UC San Diego August 2008  –  July 2010  (2 years) Greater San Diego Area MEMS - Micro Electro Mechanical Systems: RF MEMS. Modeling, design and fabrication of novel electrostatic switches and switched capacitors with low sensitivity to temperature and residual stresses. \n \n• Developed new designs of electrostatic RF MEMS switches and tunable capacitors with very low sensitivity to temperature and residual stresses. \n• Succeeded in building a MEMS tunable capacitor with analog tunability which is very challenging to the inherent mechanical instability of the device under electrostatic actuation. \n• Developed new MEMS capacitive switches with very low temperature-sensitivity. For these devices, the change in the up-state capacitance was < 4% at 25-125C and the change in the pull-in voltage was <100 mV/C. Other designs also exhibit a change in the pull-in voltage of <60 mV/C. These are considered to be one of the most temperature stable RF MEMS devices ever developed. \n• Developed capacitive miniature switch with pull-down and pull-up electrodes for high power applications. Assistant Project Scientist UC San Diego August 2008  –  July 2010  (2 years) Greater San Diego Area MEMS - Micro Electro Mechanical Systems: RF MEMS. Modeling, design and fabrication of novel electrostatic switches and switched capacitors with low sensitivity to temperature and residual stresses. \n \n• Developed new designs of electrostatic RF MEMS switches and tunable capacitors with very low sensitivity to temperature and residual stresses. \n• Succeeded in building a MEMS tunable capacitor with analog tunability which is very challenging to the inherent mechanical instability of the device under electrostatic actuation. \n• Developed new MEMS capacitive switches with very low temperature-sensitivity. For these devices, the change in the up-state capacitance was < 4% at 25-125C and the change in the pull-in voltage was <100 mV/C. Other designs also exhibit a change in the pull-in voltage of <60 mV/C. These are considered to be one of the most temperature stable RF MEMS devices ever developed. \n• Developed capacitive miniature switch with pull-down and pull-up electrodes for high power applications. Postdoctoral Researcher University of Pennsylvania September 2006  –  July 2008  (1 year 11 months) Philadelphia, PA MEMS - Micro Electro Mechanical Systems: MEMS piezoelectric resonators and switches, Finite element analysis, Analytical dynamics, Microsystem design and fabrication. \n \n• Developed the first piezoelectric Aluminum Nitride (AlN) RF switch which is monolithically integrated with piezoelectric resonators and filters. The switch mechanism is designed in such a way that the device performance is insensitive to residual stresses and ambient temperature. Furthermore, the monolithic integration of the switch and the recently introduced contour-mode resonator technology can significantly affect the design of new RF front-ends by impacting their size, power efficiency and also drastically reducing parasitics and off-state leakage. Such integration will enable new RF architectures based on large arrays of switched multi-frequency AlN contour-mode resonators.  \n• Worked on developing a nano-electromechanical piezoelectric switch for logic gate applications. The results was shown that a nano cantilever beam, L =5-18 um, w =2-4 um, t=0.35 um, with an ultra thin piezoelectric layer ~100 nm can be fabricated and actuated with excellent performances. This make the AlN a very promising piezoelectric material for nano-electro-mechanical switches for low power logic applications. Postdoctoral Researcher University of Pennsylvania September 2006  –  July 2008  (1 year 11 months) Philadelphia, PA MEMS - Micro Electro Mechanical Systems: MEMS piezoelectric resonators and switches, Finite element analysis, Analytical dynamics, Microsystem design and fabrication. \n \n• Developed the first piezoelectric Aluminum Nitride (AlN) RF switch which is monolithically integrated with piezoelectric resonators and filters. The switch mechanism is designed in such a way that the device performance is insensitive to residual stresses and ambient temperature. Furthermore, the monolithic integration of the switch and the recently introduced contour-mode resonator technology can significantly affect the design of new RF front-ends by impacting their size, power efficiency and also drastically reducing parasitics and off-state leakage. Such integration will enable new RF architectures based on large arrays of switched multi-frequency AlN contour-mode resonators.  \n• Worked on developing a nano-electromechanical piezoelectric switch for logic gate applications. The results was shown that a nano cantilever beam, L =5-18 um, w =2-4 um, t=0.35 um, with an ultra thin piezoelectric layer ~100 nm can be fabricated and actuated with excellent performances. This make the AlN a very promising piezoelectric material for nano-electro-mechanical switches for low power logic applications. Teaching Assistant Technion - Israel Institute of Technology October 2000  –  July 2006  (5 years 10 months) Haifa Teaching Assistant of : \n“Dynamics” 2000 – 2006 \n“Introduction to Control and Automation” 2000 – 2006 \n“Laboratory of Manufacturing System”\t2003 \n“Experimental Methods” 2001 Teaching Assistant Technion - Israel Institute of Technology October 2000  –  July 2006  (5 years 10 months) Haifa Teaching Assistant of : \n“Dynamics” 2000 – 2006 \n“Introduction to Control and Automation” 2000 – 2006 \n“Laboratory of Manufacturing System”\t2003 \n“Experimental Methods” 2001 Languages English Full professional proficiency Arabic Native or bilingual proficiency Hebrew Full professional proficiency English Full professional proficiency Arabic Native or bilingual proficiency Hebrew Full professional proficiency English Full professional proficiency Arabic Native or bilingual proficiency Hebrew Full professional proficiency Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills MEMS Semiconductors Simulations Microfabrication Thin Films Sensors Physics Characterization Process Integration Silicon Finite Element Analysis Product Engineering Design of Experiments Materials Science Agilent ADS RF MEMS Piezoelectric Actuators Matlab RF R Manufacturing Modeling See 8+     See less Skills  MEMS Semiconductors Simulations Microfabrication Thin Films Sensors Physics Characterization Process Integration Silicon Finite Element Analysis Product Engineering Design of Experiments Materials Science Agilent ADS RF MEMS Piezoelectric Actuators Matlab RF R Manufacturing Modeling See 8+     See less MEMS Semiconductors Simulations Microfabrication Thin Films Sensors Physics Characterization Process Integration Silicon Finite Element Analysis Product Engineering Design of Experiments Materials Science Agilent ADS RF MEMS Piezoelectric Actuators Matlab RF R Manufacturing Modeling See 8+     See less MEMS Semiconductors Simulations Microfabrication Thin Films Sensors Physics Characterization Process Integration Silicon Finite Element Analysis Product Engineering Design of Experiments Materials Science Agilent ADS RF MEMS Piezoelectric Actuators Matlab RF R Manufacturing Modeling See 8+     See less Education Technion - Israel Institute of Technology Doctor of Philosophy (PhD),  MEMS, Micro-Electro-Mechanical-Systems 2003  – 2006 Thesis title: “Thermal effects in micro-system (MEMS), and their application in novel micro-devices” \n \n• Concentrated on examining the thermal effects in micro-systems related to actuation, thermoelastic damping, Joule heating, and the use of thermal expansion for measuring the mechanical properties of micro-structures. \n• Investigated a two-dimensional model of the thermoelastic dynamic response of temperature-gradient actuators.  \n• To demonstrate the feasibility of the temperature-gradient thermoelastic actuator, I designed and fabricated a tilting micro-mirror device which achieved a periodic angular deflection of ±8.5° at 9.5 kHz, while driven by a 1.5 Volt source. \n• I analyzed the thermoelastic damping and found that native-oxide layer induces thermoelastic damping in Single Crystalline Silicon SCS axial micro-resonators. Technion - Israel Institute of Technology Master of Science (MSc),  Micro Thermoelastic Actuators , Cum Laude 2000  – 2003 Technion - Israel Institute of Technology Bachelor of Science (BSc),  Mechanical Engineering , Cum Laude 1996  – 2000 Technion - Israel Institute of Technology Doctor of Philosophy (PhD),  MEMS, Micro-Electro-Mechanical-Systems 2003  – 2006 Thesis title: “Thermal effects in micro-system (MEMS), and their application in novel micro-devices” \n \n• Concentrated on examining the thermal effects in micro-systems related to actuation, thermoelastic damping, Joule heating, and the use of thermal expansion for measuring the mechanical properties of micro-structures. \n• Investigated a two-dimensional model of the thermoelastic dynamic response of temperature-gradient actuators.  \n• To demonstrate the feasibility of the temperature-gradient thermoelastic actuator, I designed and fabricated a tilting micro-mirror device which achieved a periodic angular deflection of ±8.5° at 9.5 kHz, while driven by a 1.5 Volt source. \n• I analyzed the thermoelastic damping and found that native-oxide layer induces thermoelastic damping in Single Crystalline Silicon SCS axial micro-resonators. Technion - Israel Institute of Technology Doctor of Philosophy (PhD),  MEMS, Micro-Electro-Mechanical-Systems 2003  – 2006 Thesis title: “Thermal effects in micro-system (MEMS), and their application in novel micro-devices” \n \n• Concentrated on examining the thermal effects in micro-systems related to actuation, thermoelastic damping, Joule heating, and the use of thermal expansion for measuring the mechanical properties of micro-structures. \n• Investigated a two-dimensional model of the thermoelastic dynamic response of temperature-gradient actuators.  \n• To demonstrate the feasibility of the temperature-gradient thermoelastic actuator, I designed and fabricated a tilting micro-mirror device which achieved a periodic angular deflection of ±8.5° at 9.5 kHz, while driven by a 1.5 Volt source. \n• I analyzed the thermoelastic damping and found that native-oxide layer induces thermoelastic damping in Single Crystalline Silicon SCS axial micro-resonators. Technion - Israel Institute of Technology Doctor of Philosophy (PhD),  MEMS, Micro-Electro-Mechanical-Systems 2003  – 2006 Thesis title: “Thermal effects in micro-system (MEMS), and their application in novel micro-devices” \n \n• Concentrated on examining the thermal effects in micro-systems related to actuation, thermoelastic damping, Joule heating, and the use of thermal expansion for measuring the mechanical properties of micro-structures. \n• Investigated a two-dimensional model of the thermoelastic dynamic response of temperature-gradient actuators.  \n• To demonstrate the feasibility of the temperature-gradient thermoelastic actuator, I designed and fabricated a tilting micro-mirror device which achieved a periodic angular deflection of ±8.5° at 9.5 kHz, while driven by a 1.5 Volt source. \n• I analyzed the thermoelastic damping and found that native-oxide layer induces thermoelastic damping in Single Crystalline Silicon SCS axial micro-resonators. Technion - Israel Institute of Technology Master of Science (MSc),  Micro Thermoelastic Actuators , Cum Laude 2000  – 2003 Technion - Israel Institute of Technology Master of Science (MSc),  Micro Thermoelastic Actuators , Cum Laude 2000  – 2003 Technion - Israel Institute of Technology Master of Science (MSc),  Micro Thermoelastic Actuators , Cum Laude 2000  – 2003 Technion - Israel Institute of Technology Bachelor of Science (BSc),  Mechanical Engineering , Cum Laude 1996  – 2000 Technion - Israel Institute of Technology Bachelor of Science (BSc),  Mechanical Engineering , Cum Laude 1996  – 2000 Technion - Israel Institute of Technology Bachelor of Science (BSc),  Mechanical Engineering , Cum Laude 1996  – 2000 ", "Experience Project/Program Manager Technical Intel Corporation August 2015  – Present (1 month) Sr. Mechanical TD Engineer Intel Corporation October 2011  – Present (3 years 11 months) Bangalore, India Senior Design Engineer GE Healthcare December 2007  –  October 2011  (3 years 11 months) Bangalore, India My key responsibilities : \n \nDesign & development of High Voltage X-ray Generator components, Project Management, \nMechanical packaging & thermal management for electrical /electronic systems  \nRapid Prototyping, Conduct Experimentation, Verification, HAST & documentation \nGE DFSS Green Belt Certified Engineer R&D LG Electronics India Limited July 2006  –  December 2007  (1 year 6 months) My key responsibilities : \n \nThermal & Mechanical Design & development of refrigerator components Project/Program Manager Technical Intel Corporation August 2015  – Present (1 month) Project/Program Manager Technical Intel Corporation August 2015  – Present (1 month) Sr. Mechanical TD Engineer Intel Corporation October 2011  – Present (3 years 11 months) Bangalore, India Sr. Mechanical TD Engineer Intel Corporation October 2011  – Present (3 years 11 months) Bangalore, India Senior Design Engineer GE Healthcare December 2007  –  October 2011  (3 years 11 months) Bangalore, India My key responsibilities : \n \nDesign & development of High Voltage X-ray Generator components, Project Management, \nMechanical packaging & thermal management for electrical /electronic systems  \nRapid Prototyping, Conduct Experimentation, Verification, HAST & documentation \nGE DFSS Green Belt Certified Senior Design Engineer GE Healthcare December 2007  –  October 2011  (3 years 11 months) Bangalore, India My key responsibilities : \n \nDesign & development of High Voltage X-ray Generator components, Project Management, \nMechanical packaging & thermal management for electrical /electronic systems  \nRapid Prototyping, Conduct Experimentation, Verification, HAST & documentation \nGE DFSS Green Belt Certified Engineer R&D LG Electronics India Limited July 2006  –  December 2007  (1 year 6 months) My key responsibilities : \n \nThermal & Mechanical Design & development of refrigerator components Engineer R&D LG Electronics India Limited July 2006  –  December 2007  (1 year 6 months) My key responsibilities : \n \nThermal & Mechanical Design & development of refrigerator components Skills Six Sigma FMEA DMAIC Pro Engineer Minitab Lean Manufacturing GD&T Manufacturing Kaizen Simulations Product Development Finite Element Analysis Engineering Testing Product Design Reliability Engineering Unigraphics SPC ANSYS Process Engineering Design for Manufacturing Mechanical Engineering R&D See 8+     See less Skills  Six Sigma FMEA DMAIC Pro Engineer Minitab Lean Manufacturing GD&T Manufacturing Kaizen Simulations Product Development Finite Element Analysis Engineering Testing Product Design Reliability Engineering Unigraphics SPC ANSYS Process Engineering Design for Manufacturing Mechanical Engineering R&D See 8+     See less Six Sigma FMEA DMAIC Pro Engineer Minitab Lean Manufacturing GD&T Manufacturing Kaizen Simulations Product Development Finite Element Analysis Engineering Testing Product Design Reliability Engineering Unigraphics SPC ANSYS Process Engineering Design for Manufacturing Mechanical Engineering R&D See 8+     See less Six Sigma FMEA DMAIC Pro Engineer Minitab Lean Manufacturing GD&T Manufacturing Kaizen Simulations Product Development Finite Element Analysis Engineering Testing Product Design Reliability Engineering Unigraphics SPC ANSYS Process Engineering Design for Manufacturing Mechanical Engineering R&D See 8+     See less Education VIT, Pune University Master of Technology (MTech),  Mechanical Engineering 2004  – 2006 DYPCET, Shivaji University, Kolhapur B.E,  Mechanical Engineering 1996  – 2000 VIT, Pune University Master of Technology (MTech),  Mechanical Engineering 2004  – 2006 VIT, Pune University Master of Technology (MTech),  Mechanical Engineering 2004  – 2006 VIT, Pune University Master of Technology (MTech),  Mechanical Engineering 2004  – 2006 DYPCET, Shivaji University, Kolhapur B.E,  Mechanical Engineering 1996  – 2000 DYPCET, Shivaji University, Kolhapur B.E,  Mechanical Engineering 1996  – 2000 DYPCET, Shivaji University, Kolhapur B.E,  Mechanical Engineering 1996  – 2000 ", "Experience Mechanical TD Engineer Intel Corporation September 2014  – Present (1 year) Zapopan Area, Mexico Designs and analyzes mechanical systems, equipment and packaging. Conducts feasibility studies and testing on new and modified designs. Directs support personnel in the preparation of detailed design, design testing and prototype fabrication. Provides design information to drafting for packaging documentation. Mechanical Design Engineer Soluciones Tecnológicas May 2013  – Present (2 years 4 months) Zapopan Area, Mexico * 3D model design (NX Unigraphics 6.0), structural analysis and creation of 2D engineering drawings based on ASME Y14.5M specifications for tooling (assembly/disassembly, lifting and transportation of engines aircraft). Costumer: Pratt & Whitney. \n* Creation of 2D engineering drawings of tooling, using ASME Y14.5M specifications. Costumer: Parametric Solutions Inc. & Mitsubishi – Hitachi Power Systems. \n* Work Stations design for assembly and final testing on line production (Catia V5 R20) using mechanical, neumatic & electronic components. Costumer: Kostal Mexicana. \n* Design of Drill Jigs, Mylars, Special Fixtures & Assembly Jigs for Learjet 85 fuselage (Catia V5 R21 & Solid Works 2013) as well as engineering change requests (ECR). Costumer: Bombardier Aerospace Mexico (Working on site for 3 months). \n*Design of molds in CATIA V5 R21 for hydroforming process of aero structures. Costumers: Honda & Boeing. Becario Interlatin August 2011  –  September 2011  (2 months) Tlaquepaque Area, Mexico Creation and validation of 2D engineering drawings of tooling, using ASME Y14.5M specifications. Costumer: Pratt & Whitney. Mechanical TD Engineer Intel Corporation September 2014  – Present (1 year) Zapopan Area, Mexico Designs and analyzes mechanical systems, equipment and packaging. Conducts feasibility studies and testing on new and modified designs. Directs support personnel in the preparation of detailed design, design testing and prototype fabrication. Provides design information to drafting for packaging documentation. Mechanical TD Engineer Intel Corporation September 2014  – Present (1 year) Zapopan Area, Mexico Designs and analyzes mechanical systems, equipment and packaging. Conducts feasibility studies and testing on new and modified designs. Directs support personnel in the preparation of detailed design, design testing and prototype fabrication. Provides design information to drafting for packaging documentation. Mechanical Design Engineer Soluciones Tecnológicas May 2013  – Present (2 years 4 months) Zapopan Area, Mexico * 3D model design (NX Unigraphics 6.0), structural analysis and creation of 2D engineering drawings based on ASME Y14.5M specifications for tooling (assembly/disassembly, lifting and transportation of engines aircraft). Costumer: Pratt & Whitney. \n* Creation of 2D engineering drawings of tooling, using ASME Y14.5M specifications. Costumer: Parametric Solutions Inc. & Mitsubishi – Hitachi Power Systems. \n* Work Stations design for assembly and final testing on line production (Catia V5 R20) using mechanical, neumatic & electronic components. Costumer: Kostal Mexicana. \n* Design of Drill Jigs, Mylars, Special Fixtures & Assembly Jigs for Learjet 85 fuselage (Catia V5 R21 & Solid Works 2013) as well as engineering change requests (ECR). Costumer: Bombardier Aerospace Mexico (Working on site for 3 months). \n*Design of molds in CATIA V5 R21 for hydroforming process of aero structures. Costumers: Honda & Boeing. Mechanical Design Engineer Soluciones Tecnológicas May 2013  – Present (2 years 4 months) Zapopan Area, Mexico * 3D model design (NX Unigraphics 6.0), structural analysis and creation of 2D engineering drawings based on ASME Y14.5M specifications for tooling (assembly/disassembly, lifting and transportation of engines aircraft). Costumer: Pratt & Whitney. \n* Creation of 2D engineering drawings of tooling, using ASME Y14.5M specifications. Costumer: Parametric Solutions Inc. & Mitsubishi – Hitachi Power Systems. \n* Work Stations design for assembly and final testing on line production (Catia V5 R20) using mechanical, neumatic & electronic components. Costumer: Kostal Mexicana. \n* Design of Drill Jigs, Mylars, Special Fixtures & Assembly Jigs for Learjet 85 fuselage (Catia V5 R21 & Solid Works 2013) as well as engineering change requests (ECR). Costumer: Bombardier Aerospace Mexico (Working on site for 3 months). \n*Design of molds in CATIA V5 R21 for hydroforming process of aero structures. Costumers: Honda & Boeing. Becario Interlatin August 2011  –  September 2011  (2 months) Tlaquepaque Area, Mexico Creation and validation of 2D engineering drawings of tooling, using ASME Y14.5M specifications. Costumer: Pratt & Whitney. Becario Interlatin August 2011  –  September 2011  (2 months) Tlaquepaque Area, Mexico Creation and validation of 2D engineering drawings of tooling, using ASME Y14.5M specifications. Costumer: Pratt & Whitney. Languages Español Native or bilingual proficiency Ingles Professional working proficiency Español Native or bilingual proficiency Ingles Professional working proficiency Español Native or bilingual proficiency Ingles Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills CATIA Skills  CATIA CATIA CATIA Education Universidad Tecnológica de la Mixteca Mechatronics Engineering 2007  – 2012 * BSc thesis “Diseño, instrumentación e implementación de un sistema rotor-chumaceras basado en el modelo Jeffcot para el análisis de vibraciones”. \n* Design, assembly & programing of a robotic arm prototype based on KUKA robot. \n* Design, fabrication & programing of a ZUMO-bot. Universidad Tecnológica de la Mixteca Mechatronics Engineering 2007  – 2012 * BSc thesis “Diseño, instrumentación e implementación de un sistema rotor-chumaceras basado en el modelo Jeffcot para el análisis de vibraciones”. \n* Design, assembly & programing of a robotic arm prototype based on KUKA robot. \n* Design, fabrication & programing of a ZUMO-bot. Universidad Tecnológica de la Mixteca Mechatronics Engineering 2007  – 2012 * BSc thesis “Diseño, instrumentación e implementación de un sistema rotor-chumaceras basado en el modelo Jeffcot para el análisis de vibraciones”. \n* Design, assembly & programing of a robotic arm prototype based on KUKA robot. \n* Design, fabrication & programing of a ZUMO-bot. Universidad Tecnológica de la Mixteca Mechatronics Engineering 2007  – 2012 * BSc thesis “Diseño, instrumentación e implementación de un sistema rotor-chumaceras basado en el modelo Jeffcot para el análisis de vibraciones”. \n* Design, assembly & programing of a robotic arm prototype based on KUKA robot. \n* Design, fabrication & programing of a ZUMO-bot. Honors & Awards "]}