{"position": "Member Technical Staff", "company": "Intel Corporation", "profiles": ["Skills SystemVerilog Microprocessors VLSI Verilog Debugging Semiconductors UVM Project Management Skills  SystemVerilog Microprocessors VLSI Verilog Debugging Semiconductors UVM Project Management SystemVerilog Microprocessors VLSI Verilog Debugging Semiconductors UVM Project Management SystemVerilog Microprocessors VLSI Verilog Debugging Semiconductors UVM Project Management ", "Experience Member Technical Staff Intel Corporation September 2011  – Present (4 years) Bangalore Team Leader Toshiba Embeeded Software India Pvt Ltd. April 2010  –  August 2011  (1 year 5 months) Bangalore Sr Software Engineer Toshiba Embeeded Software India Pvt Ltd November 2003  –  March 2010  (6 years 5 months) Bangalore Member Technical Staff Intel Corporation September 2011  – Present (4 years) Bangalore Member Technical Staff Intel Corporation September 2011  – Present (4 years) Bangalore Team Leader Toshiba Embeeded Software India Pvt Ltd. April 2010  –  August 2011  (1 year 5 months) Bangalore Team Leader Toshiba Embeeded Software India Pvt Ltd. April 2010  –  August 2011  (1 year 5 months) Bangalore Sr Software Engineer Toshiba Embeeded Software India Pvt Ltd November 2003  –  March 2010  (6 years 5 months) Bangalore Sr Software Engineer Toshiba Embeeded Software India Pvt Ltd November 2003  –  March 2010  (6 years 5 months) Bangalore Education Indian Institute of Technology, Delhi M. Tech.,  Electrical 2001  – 2003 Bhilai Institute of Technology B.E.,  Electrical 1997  – 2001 Indian Institute of Technology, Delhi M. Tech.,  Electrical 2001  – 2003 Indian Institute of Technology, Delhi M. Tech.,  Electrical 2001  – 2003 Indian Institute of Technology, Delhi M. Tech.,  Electrical 2001  – 2003 Bhilai Institute of Technology B.E.,  Electrical 1997  – 2001 Bhilai Institute of Technology B.E.,  Electrical 1997  – 2001 Bhilai Institute of Technology B.E.,  Electrical 1997  – 2001 ", "Summary I have over twenty five years of experience in microprocessor logic design and validation/verification. \n \nMy career has allowed me to work across the entire spectrum of logic design and validation...First level engineer manager, Architect, RTL design, Functional Validation. \n \nThe majority of my experience is in validation with my most recent work being the pre-silicon validation/verification of 'Power Management' functionality on four separate Intel Xeon/Atom designs. Summary I have over twenty five years of experience in microprocessor logic design and validation/verification. \n \nMy career has allowed me to work across the entire spectrum of logic design and validation...First level engineer manager, Architect, RTL design, Functional Validation. \n \nThe majority of my experience is in validation with my most recent work being the pre-silicon validation/verification of 'Power Management' functionality on four separate Intel Xeon/Atom designs. I have over twenty five years of experience in microprocessor logic design and validation/verification. \n \nMy career has allowed me to work across the entire spectrum of logic design and validation...First level engineer manager, Architect, RTL design, Functional Validation. \n \nThe majority of my experience is in validation with my most recent work being the pre-silicon validation/verification of 'Power Management' functionality on four separate Intel Xeon/Atom designs. I have over twenty five years of experience in microprocessor logic design and validation/verification. \n \nMy career has allowed me to work across the entire spectrum of logic design and validation...First level engineer manager, Architect, RTL design, Functional Validation. \n \nThe majority of my experience is in validation with my most recent work being the pre-silicon validation/verification of 'Power Management' functionality on four separate Intel Xeon/Atom designs. Experience Member of Technical Staff Intel Corporation January 2005  – Present (10 years 8 months) Fort Collins, Colorado Area After serving as a first line engineering manager for four years, I transitioned back into an engineering role where I have worked as a power management validation lead across several IA Xeon designs. Validation Engineer Hewlett-Packard July 1997  –  January 2005  (7 years 7 months) Fort Collins, Colorado Area I worked as an RTL design and functional validation (verification) engineer on HP's 'PA' microprocessors with the latter part of my HP service in a first level management/design role. Microprocessor Design Engineer IBM July 1987  –  July 1997  (10 years 1 month) Endicott NY & Rochester MN I/O subsystem architect, and system validation of mid-range IBM 370 systems (e.g.4381, 9370). (1987-1991) \n \nFunctional validation, POWER architecture, and ASIC RTL design of IBM-AS400 systems. (1991-1997) Specialist 4 United States Army Reserve October 1983  –  October 1989  (6 years 1 month) Fort Bliss, El Paso TX & Fort Sill, Lawton OK I worked in communications. Primarily repairing and operating all manner of communications systems in use by the U.S. Army. (MOS: 31V) Member of Technical Staff Intel Corporation January 2005  – Present (10 years 8 months) Fort Collins, Colorado Area After serving as a first line engineering manager for four years, I transitioned back into an engineering role where I have worked as a power management validation lead across several IA Xeon designs. Member of Technical Staff Intel Corporation January 2005  – Present (10 years 8 months) Fort Collins, Colorado Area After serving as a first line engineering manager for four years, I transitioned back into an engineering role where I have worked as a power management validation lead across several IA Xeon designs. Validation Engineer Hewlett-Packard July 1997  –  January 2005  (7 years 7 months) Fort Collins, Colorado Area I worked as an RTL design and functional validation (verification) engineer on HP's 'PA' microprocessors with the latter part of my HP service in a first level management/design role. Validation Engineer Hewlett-Packard July 1997  –  January 2005  (7 years 7 months) Fort Collins, Colorado Area I worked as an RTL design and functional validation (verification) engineer on HP's 'PA' microprocessors with the latter part of my HP service in a first level management/design role. Microprocessor Design Engineer IBM July 1987  –  July 1997  (10 years 1 month) Endicott NY & Rochester MN I/O subsystem architect, and system validation of mid-range IBM 370 systems (e.g.4381, 9370). (1987-1991) \n \nFunctional validation, POWER architecture, and ASIC RTL design of IBM-AS400 systems. (1991-1997) Microprocessor Design Engineer IBM July 1987  –  July 1997  (10 years 1 month) Endicott NY & Rochester MN I/O subsystem architect, and system validation of mid-range IBM 370 systems (e.g.4381, 9370). (1987-1991) \n \nFunctional validation, POWER architecture, and ASIC RTL design of IBM-AS400 systems. (1991-1997) Specialist 4 United States Army Reserve October 1983  –  October 1989  (6 years 1 month) Fort Bliss, El Paso TX & Fort Sill, Lawton OK I worked in communications. Primarily repairing and operating all manner of communications systems in use by the U.S. Army. (MOS: 31V) Specialist 4 United States Army Reserve October 1983  –  October 1989  (6 years 1 month) Fort Bliss, El Paso TX & Fort Sill, Lawton OK I worked in communications. Primarily repairing and operating all manner of communications systems in use by the U.S. Army. (MOS: 31V) Skills Computer Architecture Microprocessors Functional Verification Validation Intel Power Management Simulations Debugging Perl Unix Specman C C++ Linux Emulation NFS Cache Coherency AFS IBM Mainframe HP Server Hardware IBM AS/400 AIX SystemVerilog Semiconductors ASIC See 10+     See less Skills  Computer Architecture Microprocessors Functional Verification Validation Intel Power Management Simulations Debugging Perl Unix Specman C C++ Linux Emulation NFS Cache Coherency AFS IBM Mainframe HP Server Hardware IBM AS/400 AIX SystemVerilog Semiconductors ASIC See 10+     See less Computer Architecture Microprocessors Functional Verification Validation Intel Power Management Simulations Debugging Perl Unix Specman C C++ Linux Emulation NFS Cache Coherency AFS IBM Mainframe HP Server Hardware IBM AS/400 AIX SystemVerilog Semiconductors ASIC See 10+     See less Computer Architecture Microprocessors Functional Verification Validation Intel Power Management Simulations Debugging Perl Unix Specman C C++ Linux Emulation NFS Cache Coherency AFS IBM Mainframe HP Server Hardware IBM AS/400 AIX SystemVerilog Semiconductors ASIC See 10+     See less Education National Technological University Master of Science (M.S.),  Computer Engineering 1993  – 1995 Syracuse University Computer Engineering 1990  – 1991 University of Nebraska-Lincoln Bachelor of Science (BS),  Computer Science 1981  – 1987 National Technological University Master of Science (M.S.),  Computer Engineering 1993  – 1995 National Technological University Master of Science (M.S.),  Computer Engineering 1993  – 1995 National Technological University Master of Science (M.S.),  Computer Engineering 1993  – 1995 Syracuse University Computer Engineering 1990  – 1991 Syracuse University Computer Engineering 1990  – 1991 Syracuse University Computer Engineering 1990  – 1991 University of Nebraska-Lincoln Bachelor of Science (BS),  Computer Science 1981  – 1987 University of Nebraska-Lincoln Bachelor of Science (BS),  Computer Science 1981  – 1987 University of Nebraska-Lincoln Bachelor of Science (BS),  Computer Science 1981  – 1987 ", "Languages English Native or bilingual proficiency Python Native or bilingual proficiency C Native or bilingual proficiency x86 ASM Elementary proficiency PHP Native or bilingual proficiency English Native or bilingual proficiency Python Native or bilingual proficiency C Native or bilingual proficiency x86 ASM Elementary proficiency PHP Native or bilingual proficiency English Native or bilingual proficiency Python Native or bilingual proficiency C Native or bilingual proficiency x86 ASM Elementary proficiency PHP Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Native or bilingual proficiency Skills Business Creation Semiconductors Mobile Entrepreneur Corporate Development Product Development Start-ups Product Management Business Strategy Product Marketing Wireless Entrepreneurship Strategy Development Product Strategy Cross-functional Team... Strategic Planning Venture Capital Mergers Marketing Strategy New Business Development Software Development Strategic Partnerships Financial Modeling Team Building Intellectual Property Analytics Consumer Electronics SaaS Optimization Strategy Mobile Devices Executive Management Go-to-market Strategy Telecommunications Mergers & Acquisitions E-commerce CRM Business Competitive Analysis Cloud Computing Mobile Applications Enterprise Software Business Development Product Launch Leadership Cleantech See 31+     See less Skills  Business Creation Semiconductors Mobile Entrepreneur Corporate Development Product Development Start-ups Product Management Business Strategy Product Marketing Wireless Entrepreneurship Strategy Development Product Strategy Cross-functional Team... Strategic Planning Venture Capital Mergers Marketing Strategy New Business Development Software Development Strategic Partnerships Financial Modeling Team Building Intellectual Property Analytics Consumer Electronics SaaS Optimization Strategy Mobile Devices Executive Management Go-to-market Strategy Telecommunications Mergers & Acquisitions E-commerce CRM Business Competitive Analysis Cloud Computing Mobile Applications Enterprise Software Business Development Product Launch Leadership Cleantech See 31+     See less Business Creation Semiconductors Mobile Entrepreneur Corporate Development Product Development Start-ups Product Management Business Strategy Product Marketing Wireless Entrepreneurship Strategy Development Product Strategy Cross-functional Team... Strategic Planning Venture Capital Mergers Marketing Strategy New Business Development Software Development Strategic Partnerships Financial Modeling Team Building Intellectual Property Analytics Consumer Electronics SaaS Optimization Strategy Mobile Devices Executive Management Go-to-market Strategy Telecommunications Mergers & Acquisitions E-commerce CRM Business Competitive Analysis Cloud Computing Mobile Applications Enterprise Software Business Development Product Launch Leadership Cleantech See 31+     See less Business Creation Semiconductors Mobile Entrepreneur Corporate Development Product Development Start-ups Product Management Business Strategy Product Marketing Wireless Entrepreneurship Strategy Development Product Strategy Cross-functional Team... Strategic Planning Venture Capital Mergers Marketing Strategy New Business Development Software Development Strategic Partnerships Financial Modeling Team Building Intellectual Property Analytics Consumer Electronics SaaS Optimization Strategy Mobile Devices Executive Management Go-to-market Strategy Telecommunications Mergers & Acquisitions E-commerce CRM Business Competitive Analysis Cloud Computing Mobile Applications Enterprise Software Business Development Product Launch Leadership Cleantech See 31+     See less Education Columbia University - Columbia Business School MBA University of California, Berkeley, Haas School of Business MBA University of California, Berkeley BA Texas Academy of Math and Science Columbia University - Columbia Business School MBA Columbia University - Columbia Business School MBA Columbia University - Columbia Business School MBA University of California, Berkeley, Haas School of Business MBA University of California, Berkeley, Haas School of Business MBA University of California, Berkeley, Haas School of Business MBA University of California, Berkeley BA University of California, Berkeley BA University of California, Berkeley BA Texas Academy of Math and Science Texas Academy of Math and Science Texas Academy of Math and Science Honors & Awards ", "Summary Specialties:Linux kernel, and device drivers. Infiniband, Ethernet. Summary Specialties:Linux kernel, and device drivers. Infiniband, Ethernet. Specialties:Linux kernel, and device drivers. Infiniband, Ethernet. Specialties:Linux kernel, and device drivers. Infiniband, Ethernet. Experience Member of Technical Staff Intel Corporation January 2014  – Present (1 year 8 months) Member of Technical Staff Riverbed Technology January 2012  –  January 2014  (2 years 1 month) San Francisco Bay Area Technical Lead - Networking Software SGI October 2001  –  January 2012  (10 years 4 months) Most recently I've been developing Linux device drivers, and user-level programs for performance monitoring on large NUMA systems running Linux.  \n \nI've also: \n- developed, and maintained Linux kernel, and device driver patches (mostly for InfiniBand), and pushed those patches into Linux \n- measured, documented, and improved (Ethernet and Infiniband) networking performance of NUMA systems running Linux \n- a bunch of related stuff... Member of Technical Staff Acuson Corporation December 1995  –  October 2001  (5 years 11 months) Did physical measurements of the acoustic output of ultrasound transducers. Developed software for laboratory data acquisition, and data processing. \n \nDeveloped algorithms for real-time calculations of acoustic output in ultrasound systems. Member of Technical Staff Intel Corporation January 2014  – Present (1 year 8 months) Member of Technical Staff Intel Corporation January 2014  – Present (1 year 8 months) Member of Technical Staff Riverbed Technology January 2012  –  January 2014  (2 years 1 month) San Francisco Bay Area Member of Technical Staff Riverbed Technology January 2012  –  January 2014  (2 years 1 month) San Francisco Bay Area Technical Lead - Networking Software SGI October 2001  –  January 2012  (10 years 4 months) Most recently I've been developing Linux device drivers, and user-level programs for performance monitoring on large NUMA systems running Linux.  \n \nI've also: \n- developed, and maintained Linux kernel, and device driver patches (mostly for InfiniBand), and pushed those patches into Linux \n- measured, documented, and improved (Ethernet and Infiniband) networking performance of NUMA systems running Linux \n- a bunch of related stuff... Technical Lead - Networking Software SGI October 2001  –  January 2012  (10 years 4 months) Most recently I've been developing Linux device drivers, and user-level programs for performance monitoring on large NUMA systems running Linux.  \n \nI've also: \n- developed, and maintained Linux kernel, and device driver patches (mostly for InfiniBand), and pushed those patches into Linux \n- measured, documented, and improved (Ethernet and Infiniband) networking performance of NUMA systems running Linux \n- a bunch of related stuff... Member of Technical Staff Acuson Corporation December 1995  –  October 2001  (5 years 11 months) Did physical measurements of the acoustic output of ultrasound transducers. Developed software for laboratory data acquisition, and data processing. \n \nDeveloped algorithms for real-time calculations of acoustic output in ultrasound systems. Member of Technical Staff Acuson Corporation December 1995  –  October 2001  (5 years 11 months) Did physical measurements of the acoustic output of ultrasound transducers. Developed software for laboratory data acquisition, and data processing. \n \nDeveloped algorithms for real-time calculations of acoustic output in ultrasound systems. Skills Ethernet Kernel Linux Kernel Debugging Device Drivers Linux Infiniband Perl High Performance... System Architecture Algorithms Shell Scripting Distributed Systems Multithreading Unix Skills  Ethernet Kernel Linux Kernel Debugging Device Drivers Linux Infiniband Perl High Performance... System Architecture Algorithms Shell Scripting Distributed Systems Multithreading Unix Ethernet Kernel Linux Kernel Debugging Device Drivers Linux Infiniband Perl High Performance... System Architecture Algorithms Shell Scripting Distributed Systems Multithreading Unix Ethernet Kernel Linux Kernel Debugging Device Drivers Linux Infiniband Perl High Performance... System Architecture Algorithms Shell Scripting Distributed Systems Multithreading Unix Education Stanford University M.S.,  Computer Science University of Colorado Denver B.A.,  Mathematics ,  Physics Dual degree. Graduated with honors. Stanford University M.S.,  Computer Science Stanford University M.S.,  Computer Science Stanford University M.S.,  Computer Science University of Colorado Denver B.A.,  Mathematics ,  Physics Dual degree. Graduated with honors. University of Colorado Denver B.A.,  Mathematics ,  Physics Dual degree. Graduated with honors. University of Colorado Denver B.A.,  Mathematics ,  Physics Dual degree. Graduated with honors. ", "Summary Always looking for ways to improve products (and myself) and to help others. Summary Always looking for ways to improve products (and myself) and to help others. Always looking for ways to improve products (and myself) and to help others. Always looking for ways to improve products (and myself) and to help others. Experience Senior Member Technical Staff Intel Corporation August 2001  – Present (14 years 1 month) Customer education and support for Fortran products, involvement in Fortran standards efforts, \"public face\" of Intel Fortran in newsgroups and forums, blogger on Fortran topics. Consulting Software Engineer Digital Equipment Corporation 1978  –  2001  (23 years) Developer on VAX/VMS run-time library (Fortran, Pascal, general purpose), Project Lead for VAXELN Ada, developer and then Project Lead for VAX Fortran, developer on DEC Fortran and Digital/Compaq Visual Fortran. Established user forums for Fortran users and helped grow forum user base. Senior Member Technical Staff Intel Corporation August 2001  – Present (14 years 1 month) Customer education and support for Fortran products, involvement in Fortran standards efforts, \"public face\" of Intel Fortran in newsgroups and forums, blogger on Fortran topics. Senior Member Technical Staff Intel Corporation August 2001  – Present (14 years 1 month) Customer education and support for Fortran products, involvement in Fortran standards efforts, \"public face\" of Intel Fortran in newsgroups and forums, blogger on Fortran topics. Consulting Software Engineer Digital Equipment Corporation 1978  –  2001  (23 years) Developer on VAX/VMS run-time library (Fortran, Pascal, general purpose), Project Lead for VAXELN Ada, developer and then Project Lead for VAX Fortran, developer on DEC Fortran and Digital/Compaq Visual Fortran. Established user forums for Fortran users and helped grow forum user base. Consulting Software Engineer Digital Equipment Corporation 1978  –  2001  (23 years) Developer on VAX/VMS run-time library (Fortran, Pascal, general purpose), Project Lead for VAXELN Ada, developer and then Project Lead for VAX Fortran, developer on DEC Fortran and Digital/Compaq Visual Fortran. Established user forums for Fortran users and helped grow forum user base. Skills High Performance... Software Development Visual Studio Fortran Compilers Parallel Computing Debugging VMS Algorithms Computer Architecture Pascal C Distributed Systems Multithreading X86 Software Engineering Software Design See 2+     See less Skills  High Performance... Software Development Visual Studio Fortran Compilers Parallel Computing Debugging VMS Algorithms Computer Architecture Pascal C Distributed Systems Multithreading X86 Software Engineering Software Design See 2+     See less High Performance... Software Development Visual Studio Fortran Compilers Parallel Computing Debugging VMS Algorithms Computer Architecture Pascal C Distributed Systems Multithreading X86 Software Engineering Software Design See 2+     See less High Performance... Software Development Visual Studio Fortran Compilers Parallel Computing Debugging VMS Algorithms Computer Architecture Pascal C Distributed Systems Multithreading X86 Software Engineering Software Design See 2+     See less Education Cornell University 1972  – 1976 Activities and Societies:  Engineer for WVBR radio station ,  computer lab support ,  programming class teaching assistant Cornell University 1972  – 1976 Activities and Societies:  Engineer for WVBR radio station ,  computer lab support ,  programming class teaching assistant Cornell University 1972  – 1976 Activities and Societies:  Engineer for WVBR radio station ,  computer lab support ,  programming class teaching assistant Cornell University 1972  – 1976 Activities and Societies:  Engineer for WVBR radio station ,  computer lab support ,  programming class teaching assistant ", "Skills RF Wireless Microwave Semiconductors Electrical Engineering 4G System Design Engineering Management Cellular Communications GSM Analog FPGA Electronics Systems Engineering RF Engineering PCB design Firmware R&D See 3+     See less Skills  RF Wireless Microwave Semiconductors Electrical Engineering 4G System Design Engineering Management Cellular Communications GSM Analog FPGA Electronics Systems Engineering RF Engineering PCB design Firmware R&D See 3+     See less RF Wireless Microwave Semiconductors Electrical Engineering 4G System Design Engineering Management Cellular Communications GSM Analog FPGA Electronics Systems Engineering RF Engineering PCB design Firmware R&D See 3+     See less RF Wireless Microwave Semiconductors Electrical Engineering 4G System Design Engineering Management Cellular Communications GSM Analog FPGA Electronics Systems Engineering RF Engineering PCB design Firmware R&D See 3+     See less ", "Skills Embedded Systems Embedded Software C Device Drivers Firmware Debugging Testing Semiconductors SoC FPGA Perl SCSI Mobile Devices Hardware Architecture ASIC Skills  Embedded Systems Embedded Software C Device Drivers Firmware Debugging Testing Semiconductors SoC FPGA Perl SCSI Mobile Devices Hardware Architecture ASIC Embedded Systems Embedded Software C Device Drivers Firmware Debugging Testing Semiconductors SoC FPGA Perl SCSI Mobile Devices Hardware Architecture ASIC Embedded Systems Embedded Software C Device Drivers Firmware Debugging Testing Semiconductors SoC FPGA Perl SCSI Mobile Devices Hardware Architecture ASIC ", "Skills Test Automation LTE Requirements Analysis Testing Pre-sales Telecommunications ClearCase Release Management Software Project... C SDLC Team Management Project Management Solution Architecture Debugging Global Delivery Wireless Embedded Systems Unix Software Development See 5+     See less Skills  Test Automation LTE Requirements Analysis Testing Pre-sales Telecommunications ClearCase Release Management Software Project... C SDLC Team Management Project Management Solution Architecture Debugging Global Delivery Wireless Embedded Systems Unix Software Development See 5+     See less Test Automation LTE Requirements Analysis Testing Pre-sales Telecommunications ClearCase Release Management Software Project... C SDLC Team Management Project Management Solution Architecture Debugging Global Delivery Wireless Embedded Systems Unix Software Development See 5+     See less Test Automation LTE Requirements Analysis Testing Pre-sales Telecommunications ClearCase Release Management Software Project... C SDLC Team Management Project Management Solution Architecture Debugging Global Delivery Wireless Embedded Systems Unix Software Development See 5+     See less ", "Summary Founder of software technology startups in Silicon Valley and Bangalore, India with experience in building for high growth and mature markets. Summary Founder of software technology startups in Silicon Valley and Bangalore, India with experience in building for high growth and mature markets. Founder of software technology startups in Silicon Valley and Bangalore, India with experience in building for high growth and mature markets. Founder of software technology startups in Silicon Valley and Bangalore, India with experience in building for high growth and mature markets. ", "Summary Worked in CAD tool development and ASIC, Microprocessor design for about 25 years. \nLead several RTL 2 GDS ASIC projects. \n \nSpecialties: Expertise in CAD software development, developing and providing leadership in ASIC and Microprocessor backend (Physical design and FrontEnd). \n \nDeveloping advanced flows for physical design and tapeout chips. \n \nProvide expertise in CAD tools - power user of industry standard CAD tools Summary Worked in CAD tool development and ASIC, Microprocessor design for about 25 years. \nLead several RTL 2 GDS ASIC projects. \n \nSpecialties: Expertise in CAD software development, developing and providing leadership in ASIC and Microprocessor backend (Physical design and FrontEnd). \n \nDeveloping advanced flows for physical design and tapeout chips. \n \nProvide expertise in CAD tools - power user of industry standard CAD tools Worked in CAD tool development and ASIC, Microprocessor design for about 25 years. \nLead several RTL 2 GDS ASIC projects. \n \nSpecialties: Expertise in CAD software development, developing and providing leadership in ASIC and Microprocessor backend (Physical design and FrontEnd). \n \nDeveloping advanced flows for physical design and tapeout chips. \n \nProvide expertise in CAD tools - power user of industry standard CAD tools Worked in CAD tool development and ASIC, Microprocessor design for about 25 years. \nLead several RTL 2 GDS ASIC projects. \n \nSpecialties: Expertise in CAD software development, developing and providing leadership in ASIC and Microprocessor backend (Physical design and FrontEnd). \n \nDeveloping advanced flows for physical design and tapeout chips. \n \nProvide expertise in CAD tools - power user of industry standard CAD tools Languages English Full professional proficiency Tamil Native or bilingual proficiency Hindi Native or bilingual proficiency Malayalam Elementary proficiency Kannada Elementary proficiency Bengali Sanskrit English Full professional proficiency Tamil Native or bilingual proficiency Hindi Native or bilingual proficiency Malayalam Elementary proficiency Kannada Elementary proficiency Bengali Sanskrit English Full professional proficiency Tamil Native or bilingual proficiency Hindi Native or bilingual proficiency Malayalam Elementary proficiency Kannada Elementary proficiency Bengali Sanskrit Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Physical Design ASIC EDA SoC Static Timing Analysis VLSI Semiconductors IC TCL Microprocessors Processors Integrated Circuit... Low-power Design Timing Closure Primetime Flow Development Floorplanning Place & Route First Encounter RC Extraction Cadence Virtuoso Layout... Silicon Simulations LVS Perl SPICE See 11+     See less Skills  Physical Design ASIC EDA SoC Static Timing Analysis VLSI Semiconductors IC TCL Microprocessors Processors Integrated Circuit... Low-power Design Timing Closure Primetime Flow Development Floorplanning Place & Route First Encounter RC Extraction Cadence Virtuoso Layout... Silicon Simulations LVS Perl SPICE See 11+     See less Physical Design ASIC EDA SoC Static Timing Analysis VLSI Semiconductors IC TCL Microprocessors Processors Integrated Circuit... Low-power Design Timing Closure Primetime Flow Development Floorplanning Place & Route First Encounter RC Extraction Cadence Virtuoso Layout... Silicon Simulations LVS Perl SPICE See 11+     See less Physical Design ASIC EDA SoC Static Timing Analysis VLSI Semiconductors IC TCL Microprocessors Processors Integrated Circuit... Low-power Design Timing Closure Primetime Flow Development Floorplanning Place & Route First Encounter RC Extraction Cadence Virtuoso Layout... Silicon Simulations LVS Perl SPICE See 11+     See less Education University of Louisiana at Lafayette MS,  Computer Science 1988  – 1990 Indian Institute of Science BS,  ECE 1984  – 1987 Bangalore University Bachelors in Science,  Mathematics 1981  – 1984 University of Louisiana at Lafayette MS,  Computer Science 1988  – 1990 University of Louisiana at Lafayette MS,  Computer Science 1988  – 1990 University of Louisiana at Lafayette MS,  Computer Science 1988  – 1990 Indian Institute of Science BS,  ECE 1984  – 1987 Indian Institute of Science BS,  ECE 1984  – 1987 Indian Institute of Science BS,  ECE 1984  – 1987 Bangalore University Bachelors in Science,  Mathematics 1981  – 1984 Bangalore University Bachelors in Science,  Mathematics 1981  – 1984 Bangalore University Bachelors in Science,  Mathematics 1981  – 1984 ", "Skills RF Wireless LTE Semiconductors Analog IC RF Engineering WCDMA Cellular Communications Hardware Development System Architecture WiFi 3GPP Antennas Mobile Communications CDMA Spectrum Analyzer RF design Systems Engineering Hardware Architecture UMTS Edge Analog Circuit Design Mobile Devices GSM Telecommunications Electronics See 12+     See less Skills  RF Wireless LTE Semiconductors Analog IC RF Engineering WCDMA Cellular Communications Hardware Development System Architecture WiFi 3GPP Antennas Mobile Communications CDMA Spectrum Analyzer RF design Systems Engineering Hardware Architecture UMTS Edge Analog Circuit Design Mobile Devices GSM Telecommunications Electronics See 12+     See less RF Wireless LTE Semiconductors Analog IC RF Engineering WCDMA Cellular Communications Hardware Development System Architecture WiFi 3GPP Antennas Mobile Communications CDMA Spectrum Analyzer RF design Systems Engineering Hardware Architecture UMTS Edge Analog Circuit Design Mobile Devices GSM Telecommunications Electronics See 12+     See less RF Wireless LTE Semiconductors Analog IC RF Engineering WCDMA Cellular Communications Hardware Development System Architecture WiFi 3GPP Antennas Mobile Communications CDMA Spectrum Analyzer RF design Systems Engineering Hardware Architecture UMTS Edge Analog Circuit Design Mobile Devices GSM Telecommunications Electronics See 12+     See less ", "Experience RF Architect - Senior Member of Technical Staff Intel Corporation August 2015  – Present (1 month) Phoenix, Arizona Area RF Systems Engineer - Senior Member of Technical Staff Intel Corporation April 2011  –  August 2015  (4 years 5 months) Greater Chicago Area Intel Mobile Communications RF Systems Engineer Motorola Mobile Devices May 2000  –  April 2011  (11 years) Greater Chicago Area RF Engineer RF Engineering December 1997  –  May 2000  (2 years 6 months) Greater Seattle Area Engineering consulting firm Design Engineer Lowrance Electronics June 1996  –  December 1997  (1 year 7 months) Tulsa, Oklahoma Area RF Architect - Senior Member of Technical Staff Intel Corporation August 2015  – Present (1 month) Phoenix, Arizona Area RF Architect - Senior Member of Technical Staff Intel Corporation August 2015  – Present (1 month) Phoenix, Arizona Area RF Systems Engineer - Senior Member of Technical Staff Intel Corporation April 2011  –  August 2015  (4 years 5 months) Greater Chicago Area Intel Mobile Communications RF Systems Engineer - Senior Member of Technical Staff Intel Corporation April 2011  –  August 2015  (4 years 5 months) Greater Chicago Area Intel Mobile Communications RF Systems Engineer Motorola Mobile Devices May 2000  –  April 2011  (11 years) Greater Chicago Area RF Systems Engineer Motorola Mobile Devices May 2000  –  April 2011  (11 years) Greater Chicago Area RF Engineer RF Engineering December 1997  –  May 2000  (2 years 6 months) Greater Seattle Area Engineering consulting firm RF Engineer RF Engineering December 1997  –  May 2000  (2 years 6 months) Greater Seattle Area Engineering consulting firm Design Engineer Lowrance Electronics June 1996  –  December 1997  (1 year 7 months) Tulsa, Oklahoma Area Design Engineer Lowrance Electronics June 1996  –  December 1997  (1 year 7 months) Tulsa, Oklahoma Area Skills RF Semiconductors Embedded Systems Wireless Debugging Embedded Software Analog Mixed Signal SoC Digital Signal... ASIC Hardware Architecture Bluetooth IC PCB design Skills  RF Semiconductors Embedded Systems Wireless Debugging Embedded Software Analog Mixed Signal SoC Digital Signal... ASIC Hardware Architecture Bluetooth IC PCB design RF Semiconductors Embedded Systems Wireless Debugging Embedded Software Analog Mixed Signal SoC Digital Signal... ASIC Hardware Architecture Bluetooth IC PCB design RF Semiconductors Embedded Systems Wireless Debugging Embedded Software Analog Mixed Signal SoC Digital Signal... ASIC Hardware Architecture Bluetooth IC PCB design Education University of Massachusetts, Amherst MS,  Electrical Engineering 2000  – 2003 Cedarville University BS,  Electrical Engineering 1992  – 1996 University of Massachusetts, Amherst MS,  Electrical Engineering 2000  – 2003 University of Massachusetts, Amherst MS,  Electrical Engineering 2000  – 2003 University of Massachusetts, Amherst MS,  Electrical Engineering 2000  – 2003 Cedarville University BS,  Electrical Engineering 1992  – 1996 Cedarville University BS,  Electrical Engineering 1992  – 1996 Cedarville University BS,  Electrical Engineering 1992  – 1996 ", "Skills Semiconductors SoC IC ASIC Verilog Mixed Signal CMOS VLSI Debugging Analog Embedded Systems TCL Functional Verification Integrated Circuit... Skills  Semiconductors SoC IC ASIC Verilog Mixed Signal CMOS VLSI Debugging Analog Embedded Systems TCL Functional Verification Integrated Circuit... Semiconductors SoC IC ASIC Verilog Mixed Signal CMOS VLSI Debugging Analog Embedded Systems TCL Functional Verification Integrated Circuit... Semiconductors SoC IC ASIC Verilog Mixed Signal CMOS VLSI Debugging Analog Embedded Systems TCL Functional Verification Integrated Circuit... ", "Summary PROFILE A technical leader with extensive experience in the successful design and development of some of the most advanced chips in the semiconductor industry. Consistent first time success, the result of innovation, leadership, organization, and attention to detail. Chip designs range from high volume products, to advanced R&D technology developments including: mm-wave 10-44GHz+ fiber optic, data conversion, and radio components; Cellular handset RF frontends and synthesizers, and high MIPs/watt programmable DSPs; along with the most advanced highest performance microprocessors. Aggressive projects on aggressive schedules with prodigious IP production. Summary PROFILE A technical leader with extensive experience in the successful design and development of some of the most advanced chips in the semiconductor industry. Consistent first time success, the result of innovation, leadership, organization, and attention to detail. Chip designs range from high volume products, to advanced R&D technology developments including: mm-wave 10-44GHz+ fiber optic, data conversion, and radio components; Cellular handset RF frontends and synthesizers, and high MIPs/watt programmable DSPs; along with the most advanced highest performance microprocessors. Aggressive projects on aggressive schedules with prodigious IP production. PROFILE A technical leader with extensive experience in the successful design and development of some of the most advanced chips in the semiconductor industry. Consistent first time success, the result of innovation, leadership, organization, and attention to detail. Chip designs range from high volume products, to advanced R&D technology developments including: mm-wave 10-44GHz+ fiber optic, data conversion, and radio components; Cellular handset RF frontends and synthesizers, and high MIPs/watt programmable DSPs; along with the most advanced highest performance microprocessors. Aggressive projects on aggressive schedules with prodigious IP production. PROFILE A technical leader with extensive experience in the successful design and development of some of the most advanced chips in the semiconductor industry. Consistent first time success, the result of innovation, leadership, organization, and attention to detail. Chip designs range from high volume products, to advanced R&D technology developments including: mm-wave 10-44GHz+ fiber optic, data conversion, and radio components; Cellular handset RF frontends and synthesizers, and high MIPs/watt programmable DSPs; along with the most advanced highest performance microprocessors. Aggressive projects on aggressive schedules with prodigious IP production. Experience Principal Engineer / Director Sierra Monolithics 2008  – Present (7 years) Redondo Beach, CA Architecture and mm-wave circuit design of data converters, frequency synthesizers, advanced RF communication and fiber optic communication I.C.s.; utilizing IBM 65nm CMOS-10RFE, 45nm CMOS-12SOI, 32nm CMOS-32SOI, and 130nm BiCMOS/SiGe 8HP. \n \n100GB and 40GB fiber optics - Coherent Receiver. \n1. Design of 66Gsps 6 b flash A/D converter in 8HP, using many new architecture and  \nmm-wave circuit innovations. \n2. Highly interleaved 8 bit A/D integrated with DSP, in 32nm CMOS-SOI, for one-chip  \nfiber optic Coherent Receiver. \n3. Highly interleaved 6 bit A/D integrated with DSP, in 45nm CMOS-SOI, for one-chip  \nfiber optic Coherent Receiver. \n4. Developed 66Gsps 6 b pipelined A/D, requiring innovative new mm-wave circuits  \nand pipeline architecture. \n5. 4x22GB, 2x42GB and 44GB fiber optic SERDESs. Systems and circuit support. \n6. Four patents issued for new technologies at these frequencies \n. \nBand-pass delta-sigma A/D converter – 44Gsps, 200MHz bandwidth, 11 1/2 bits. \n1. Development of architecture using MATLAB. Two patents issued on this architecture. \n2. Design of a 44 GHz 4 bit flash A/D quantizer, 44 GHz resonators, 44GHz DAC \n. \nMassively Parallel Array Delta-Sigma A/D converter. \n1. Design of asynchronous delta-sigma modulator and all linear circuits in 0.65nm RF  \nCMOS 10LPE. \n2. Micro-architecture, logic and top level chip planning.  \n \nPoint to Point Radio – High data rate network backhaul – 256 QAM at 12/24GHz. Principal Engineer / Director Sierra Monolithics 2008  – Present (7 years) Redondo Beach, CA Principal Engineer / Senior Manager / Senior Staff Engineer Intel Corporation 1995  –  2007  (12 years) Radio Frequency Operation Radio systems architecture for CMOS, BiCMOS/SiGe UMTS multimode cellular phone chipset. Developed link budget system spreadsheet; receiver line-up, including, gain, bandwidth, noise figure, and IIP3, for each circuit block, and A/D dynamic range, to meet WCDMA and EDGE 3GPP requirements. Reviewed transmitter architecture options to merge WCDMA with EDGE. Specified and designed key CMOS, BiCMOS/SiGe circuit blocks.  \n \nDeveloped a break through architecture for low voltage MEMs RF switches. Fast track patent awarded for this design. \n \nDeveloped Fractional N Frequency Synthesizer architectures to implement agile and software defined radio, and direct modulation for highly variable PA characteristics and power level control. IDFs submitted and 1 patent filed.  \n \nFractional N Frequency Synthesizer - Design and Development of advanced Frequency Synthesizer employing delta-sigma modulation for improved close in carrier phase noise, and polar transmit modulation to eliminate transmitter modulator and up conversion mixer. Design supports Edge, GPRS, and GSM. 1 patent issued. Activity included the following: \n1. Synthesizer Architecture – Developed Verilog and Matlab Analog Behavioral Models. Specified DSP algorithms. \n2. Designed critical PLL circuits including, VCO, multimode prescaler, delta-sigma modulator/divider/phase accumulator, PFD/Charge Pump/Loop Filter employing newly derived biquad, voltage regulator employing newly developed self-biased folded cascode opamp, and loop calibration.  \n3. Coordination of synthesizer floor-planning and layout. Development of mixed signal/ logic design methodologies. \n4. Demonstrated first silicon functionality of synthesizer design. Passed FTA qualification. \n \nMember of WCCG strategic capabilities group, and DTTC technical reviewer. Panelist for 2003 GaAs IC symposium Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  2003  (8 years) Optical Networking Group LXT43001 – Most advanced, highest performance 42G bit OC-768 Limiting Amplifier available when entered production. Designed in InP HBT technology the amplifier exhibits > 40dB gain, > 43GHz bandwidth, 5ps group delay, and < 5ps p-p jitter. The development of this amplifier solved the following key problems: Amplifier architecture that achieved maximum bandwidth with minimum jitter; Bias circuit that gm tracks over PVT; A millimeter-wave minimum parasitic layout with high S12; Input offset cancellation circuit with large dynamic range; Linear and temperature stable input slice adjust circuit; Input and output circuits using Coplanar Waveguides and matching networks for S11 and S22 of –15dB to 40GHz including package and interconnect; Loss of signal peak detect circuit operates at 80GHz down to 10mV. \n \nPresented a paper on this chip with measured lab results at ICCD 10/2003 – “Fully Differential Receiver Chipset for 40 Gb/s Applications using InP/InGaAs Single Heterojunction Bipolar Transistors (invited)”. 3 patents issued. \n \nContributed to design of 40Gbit InP HBT distributed amplifier laser modulator driver. 1 patent issued on this circuit. \n \n40G bit Limiting Amplifiers in 0.13u CMOS. Two new amplifier architectures were developed that exhibited in lab results \nof 40dB gain, 40Ghz bandwidth, 6ps p-p jitter, 6ps rise/fall times, with good eye diagrams. \n \n40G bit Limiting Amplifiers in 80nm CMOS technology. Taped out 3 amplifier designs – one incorporating an innovative offset cancellation circuit outside the RF path. Showed 42dB gain, 55GHz bandwidth and jitter of 2ps p-p. IDF submitted.  \n \nKey member of team specifying Intel’s 90nm SiGe BiCMOS process. Developed 40G test vehicles and structures. Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  2001  (6 years) Photonics Technology Operation 10Gbit Ethernet, 5Km and 40Km, MSA module design. Developed Optical Link Budgets for IEEE 802.3ae. Designed transponder electronics: TIA, limiting amp, SerDes / PLL bandwidth, laser driver and XAUI I/O. Module electrical design - power supply distribution/bypassing, signal interconnect/integrity, coupling/impedance matching, and performance tunable features. Developed 3 sub-module optical assembly, using a new fiber alignment (IDF filed) to improve manufacturability, isolation and reliability. Designed Fabry-Parot and DFB laser sub-modules including microwave interconnect, biasing, and optical isolator. Developed 1310nm/1550nm receiver, investigating PIN-diode/TIA integration.  \n \nEvaluated technologies, established foundry relationships, coordinated with other Intel groups in Europe and USA. Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  2000  (5 years) Microprocessor Products Group Micro-Architecture, advanced technology,and circuit development for the third generation iA64 microprocessor (YOSEMITE). Identified and solved major issues to implement a highly parallel multi-gigahertz microprocessor in 90nm CMOS technology.  \n \nCluster Manager for REN, RSE, ISD, BRU units on MERCED (1 million transistors) (30 engineers). Coordinated, planned, and technically supported final logic, circuit design and layout. Major contributor to project level ops teams. 1st silicon functionality. \n \nMERCED (1st generation iA64/Itanium processor) STK Unit Manager (400K transistors) (10 engineers). Coordinated, planned and technically contributed to the uarchitecture development, HDL/logic design, circuit design and layout of one of the most timing critical and logically complex units on MERCED. 5 IDFs were filed for circuits, logic, and uarchitecture associated with this unit. Organized and ran circuit and layout reviews for the SE cluster (70% of chip, core execution and floating point), providing design solutions to improve speed and robustness. Key member of Circuit Management Review Committee, Physical MRC, and timing task force. Made major contributions to defining and implementing MERCEDs circuit design methodology. Developed critical circuits for SRAMs (current sensing), Register Files, CAMs, Data Path (Domino, DCVSL, pass gate) and full chip global interconnect (signal requirements, repeaters, clock and power supply distribution). Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  1996  (1 year) SPG Technical Capabilities and Competencies Group Spread Spectrum Radio Project – Developed digital radio system architecture, along with low power circuits for radio sub-systems as follows: low noise amplifier, PLL and DDS frequency synthesizer, high speed flash A/D (3 patents issued). \n \nPLL Division Expert – Designed spread spectrum PLL used in all HP ink jet printers; 1st silicon went to production. Reviewed all PLL and memory designs division wide. Worked with i960 group to develop a new low power i960 uarchitecture (p200). \n \nDigital Imaging – Designed 4 new CMOS active pixel arrays, using new cells that had logarithmic light responses to eliminate shutters for digital camera applications. Designed readout circuitry including column & multiplexed A/D converters. First silicon success.\t. Principal Engineer Rockwell DCD 1992  –  1995  (3 years) RSP; a low power, High MIPs/Watt super scalar DSP for wireless, cellular, and smart phone applications (6M transistors). \n \nDeveloped chip level techniques resulting in exceptionally low power. Architected low power instruction and data caches, performance optimized for DSP and graphics (patent filed). Cache circuits designed: 4M SRAM using current sensing (patented), set tag compare & MUX, FILO victim CAM; 1st silicon success. Analyzed algorithms and developed uarchitecture for the vector unit. Design of arithmetic data paths, including a carry sense ALU (IDF filed), and 6 port register file. \n \nDesign of low power analog/RF circuits: e.g. a low jitter, fast locking, clock multiplying DLL (patented); 1st silicon success. \n \nCellular (IS-54) communications systems analysis and chip uarchitecture. Identification of technology critical block specs. \n \nDeveloped in cooperation with Berkeley Design Consulting the industry standard for DSP benchmarks. Senior Member Technical Staff / Project Manager Mosel Vitelic 1990  –  1992  (2 years) MS441 concurrent write back 64k byte second level cache for Intel lapx486. Designed the following: An advanced DLL for phase aligned low jitter clock generation (patent issued); slew rate controlled I/O buffers (patent issued); Address range detect unit, using an ultra fast Ling subtracter (patent issued); Ultra fast cache tag compare circuit and cache tag RAM. \n \nMS451 concurrent write back 128k byte second level cache for Intel lapx486. Project management and scheduling. Design of cache tag and LRU RAM, including sense amp, decoders, and equalize circuitry. Verilog logic, circuit design & synthesis. \n \nMS461 concurrent write back 512k byte second level cache for Intel Pentium. Developed architecture, and identified and designed the technology critical circuits. Managed, planned and scheduled the design activity. \n. \nDeveloped uarchitecture spec for an advanced, low power, high integration, x86 CPU with power management controller for notebook PCs. Analyzed and made proposals for contract design of a pipelined VLIW GUI processor, and R4000VRX cache chip set. Initial design of a multimedia audio delta-sigma A/D and D/A converter chip. Senior Staff Engineer Nexgen Microsystems 1988  –  1990  (2 years) F586 - an iapx486 ISA microprocessor with Pentium performance, years in advance. Predecessor of the AMD K6 microprocessor. \n \nMicro-architected data and control path of memory management unit. \n \nDesigned MMU address generation logic and adders. This included a four operand 32 bit integer adder, computing a 32 bit sum in four gate delays. It utilized Wallace Tree, Ling Adder, and DCVSL techniques. \n \nDesigned paging subsystem Including Table Look aside Buffer, compare, replacement, and protection logic. \n \nDesigned sections of floating point unit including instruction and operand queues, 5 port register file, format conversion unit and add/subtract/shift unit. Principal Engineer / Director Sierra Monolithics 2008  – Present (7 years) Redondo Beach, CA Architecture and mm-wave circuit design of data converters, frequency synthesizers, advanced RF communication and fiber optic communication I.C.s.; utilizing IBM 65nm CMOS-10RFE, 45nm CMOS-12SOI, 32nm CMOS-32SOI, and 130nm BiCMOS/SiGe 8HP. \n \n100GB and 40GB fiber optics - Coherent Receiver. \n1. Design of 66Gsps 6 b flash A/D converter in 8HP, using many new architecture and  \nmm-wave circuit innovations. \n2. Highly interleaved 8 bit A/D integrated with DSP, in 32nm CMOS-SOI, for one-chip  \nfiber optic Coherent Receiver. \n3. Highly interleaved 6 bit A/D integrated with DSP, in 45nm CMOS-SOI, for one-chip  \nfiber optic Coherent Receiver. \n4. Developed 66Gsps 6 b pipelined A/D, requiring innovative new mm-wave circuits  \nand pipeline architecture. \n5. 4x22GB, 2x42GB and 44GB fiber optic SERDESs. Systems and circuit support. \n6. Four patents issued for new technologies at these frequencies \n. \nBand-pass delta-sigma A/D converter – 44Gsps, 200MHz bandwidth, 11 1/2 bits. \n1. Development of architecture using MATLAB. Two patents issued on this architecture. \n2. Design of a 44 GHz 4 bit flash A/D quantizer, 44 GHz resonators, 44GHz DAC \n. \nMassively Parallel Array Delta-Sigma A/D converter. \n1. Design of asynchronous delta-sigma modulator and all linear circuits in 0.65nm RF  \nCMOS 10LPE. \n2. Micro-architecture, logic and top level chip planning.  \n \nPoint to Point Radio – High data rate network backhaul – 256 QAM at 12/24GHz. Principal Engineer / Director Sierra Monolithics 2008  – Present (7 years) Redondo Beach, CA Architecture and mm-wave circuit design of data converters, frequency synthesizers, advanced RF communication and fiber optic communication I.C.s.; utilizing IBM 65nm CMOS-10RFE, 45nm CMOS-12SOI, 32nm CMOS-32SOI, and 130nm BiCMOS/SiGe 8HP. \n \n100GB and 40GB fiber optics - Coherent Receiver. \n1. Design of 66Gsps 6 b flash A/D converter in 8HP, using many new architecture and  \nmm-wave circuit innovations. \n2. Highly interleaved 8 bit A/D integrated with DSP, in 32nm CMOS-SOI, for one-chip  \nfiber optic Coherent Receiver. \n3. Highly interleaved 6 bit A/D integrated with DSP, in 45nm CMOS-SOI, for one-chip  \nfiber optic Coherent Receiver. \n4. Developed 66Gsps 6 b pipelined A/D, requiring innovative new mm-wave circuits  \nand pipeline architecture. \n5. 4x22GB, 2x42GB and 44GB fiber optic SERDESs. Systems and circuit support. \n6. Four patents issued for new technologies at these frequencies \n. \nBand-pass delta-sigma A/D converter – 44Gsps, 200MHz bandwidth, 11 1/2 bits. \n1. Development of architecture using MATLAB. Two patents issued on this architecture. \n2. Design of a 44 GHz 4 bit flash A/D quantizer, 44 GHz resonators, 44GHz DAC \n. \nMassively Parallel Array Delta-Sigma A/D converter. \n1. Design of asynchronous delta-sigma modulator and all linear circuits in 0.65nm RF  \nCMOS 10LPE. \n2. Micro-architecture, logic and top level chip planning.  \n \nPoint to Point Radio – High data rate network backhaul – 256 QAM at 12/24GHz. Principal Engineer / Director Sierra Monolithics 2008  – Present (7 years) Redondo Beach, CA Principal Engineer / Director Sierra Monolithics 2008  – Present (7 years) Redondo Beach, CA Principal Engineer / Senior Manager / Senior Staff Engineer Intel Corporation 1995  –  2007  (12 years) Radio Frequency Operation Radio systems architecture for CMOS, BiCMOS/SiGe UMTS multimode cellular phone chipset. Developed link budget system spreadsheet; receiver line-up, including, gain, bandwidth, noise figure, and IIP3, for each circuit block, and A/D dynamic range, to meet WCDMA and EDGE 3GPP requirements. Reviewed transmitter architecture options to merge WCDMA with EDGE. Specified and designed key CMOS, BiCMOS/SiGe circuit blocks.  \n \nDeveloped a break through architecture for low voltage MEMs RF switches. Fast track patent awarded for this design. \n \nDeveloped Fractional N Frequency Synthesizer architectures to implement agile and software defined radio, and direct modulation for highly variable PA characteristics and power level control. IDFs submitted and 1 patent filed.  \n \nFractional N Frequency Synthesizer - Design and Development of advanced Frequency Synthesizer employing delta-sigma modulation for improved close in carrier phase noise, and polar transmit modulation to eliminate transmitter modulator and up conversion mixer. Design supports Edge, GPRS, and GSM. 1 patent issued. Activity included the following: \n1. Synthesizer Architecture – Developed Verilog and Matlab Analog Behavioral Models. Specified DSP algorithms. \n2. Designed critical PLL circuits including, VCO, multimode prescaler, delta-sigma modulator/divider/phase accumulator, PFD/Charge Pump/Loop Filter employing newly derived biquad, voltage regulator employing newly developed self-biased folded cascode opamp, and loop calibration.  \n3. Coordination of synthesizer floor-planning and layout. Development of mixed signal/ logic design methodologies. \n4. Demonstrated first silicon functionality of synthesizer design. Passed FTA qualification. \n \nMember of WCCG strategic capabilities group, and DTTC technical reviewer. Panelist for 2003 GaAs IC symposium Principal Engineer / Senior Manager / Senior Staff Engineer Intel Corporation 1995  –  2007  (12 years) Radio Frequency Operation Radio systems architecture for CMOS, BiCMOS/SiGe UMTS multimode cellular phone chipset. Developed link budget system spreadsheet; receiver line-up, including, gain, bandwidth, noise figure, and IIP3, for each circuit block, and A/D dynamic range, to meet WCDMA and EDGE 3GPP requirements. Reviewed transmitter architecture options to merge WCDMA with EDGE. Specified and designed key CMOS, BiCMOS/SiGe circuit blocks.  \n \nDeveloped a break through architecture for low voltage MEMs RF switches. Fast track patent awarded for this design. \n \nDeveloped Fractional N Frequency Synthesizer architectures to implement agile and software defined radio, and direct modulation for highly variable PA characteristics and power level control. IDFs submitted and 1 patent filed.  \n \nFractional N Frequency Synthesizer - Design and Development of advanced Frequency Synthesizer employing delta-sigma modulation for improved close in carrier phase noise, and polar transmit modulation to eliminate transmitter modulator and up conversion mixer. Design supports Edge, GPRS, and GSM. 1 patent issued. Activity included the following: \n1. Synthesizer Architecture – Developed Verilog and Matlab Analog Behavioral Models. Specified DSP algorithms. \n2. Designed critical PLL circuits including, VCO, multimode prescaler, delta-sigma modulator/divider/phase accumulator, PFD/Charge Pump/Loop Filter employing newly derived biquad, voltage regulator employing newly developed self-biased folded cascode opamp, and loop calibration.  \n3. Coordination of synthesizer floor-planning and layout. Development of mixed signal/ logic design methodologies. \n4. Demonstrated first silicon functionality of synthesizer design. Passed FTA qualification. \n \nMember of WCCG strategic capabilities group, and DTTC technical reviewer. Panelist for 2003 GaAs IC symposium Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  2003  (8 years) Optical Networking Group LXT43001 – Most advanced, highest performance 42G bit OC-768 Limiting Amplifier available when entered production. Designed in InP HBT technology the amplifier exhibits > 40dB gain, > 43GHz bandwidth, 5ps group delay, and < 5ps p-p jitter. The development of this amplifier solved the following key problems: Amplifier architecture that achieved maximum bandwidth with minimum jitter; Bias circuit that gm tracks over PVT; A millimeter-wave minimum parasitic layout with high S12; Input offset cancellation circuit with large dynamic range; Linear and temperature stable input slice adjust circuit; Input and output circuits using Coplanar Waveguides and matching networks for S11 and S22 of –15dB to 40GHz including package and interconnect; Loss of signal peak detect circuit operates at 80GHz down to 10mV. \n \nPresented a paper on this chip with measured lab results at ICCD 10/2003 – “Fully Differential Receiver Chipset for 40 Gb/s Applications using InP/InGaAs Single Heterojunction Bipolar Transistors (invited)”. 3 patents issued. \n \nContributed to design of 40Gbit InP HBT distributed amplifier laser modulator driver. 1 patent issued on this circuit. \n \n40G bit Limiting Amplifiers in 0.13u CMOS. Two new amplifier architectures were developed that exhibited in lab results \nof 40dB gain, 40Ghz bandwidth, 6ps p-p jitter, 6ps rise/fall times, with good eye diagrams. \n \n40G bit Limiting Amplifiers in 80nm CMOS technology. Taped out 3 amplifier designs – one incorporating an innovative offset cancellation circuit outside the RF path. Showed 42dB gain, 55GHz bandwidth and jitter of 2ps p-p. IDF submitted.  \n \nKey member of team specifying Intel’s 90nm SiGe BiCMOS process. Developed 40G test vehicles and structures. Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  2003  (8 years) Optical Networking Group LXT43001 – Most advanced, highest performance 42G bit OC-768 Limiting Amplifier available when entered production. Designed in InP HBT technology the amplifier exhibits > 40dB gain, > 43GHz bandwidth, 5ps group delay, and < 5ps p-p jitter. The development of this amplifier solved the following key problems: Amplifier architecture that achieved maximum bandwidth with minimum jitter; Bias circuit that gm tracks over PVT; A millimeter-wave minimum parasitic layout with high S12; Input offset cancellation circuit with large dynamic range; Linear and temperature stable input slice adjust circuit; Input and output circuits using Coplanar Waveguides and matching networks for S11 and S22 of –15dB to 40GHz including package and interconnect; Loss of signal peak detect circuit operates at 80GHz down to 10mV. \n \nPresented a paper on this chip with measured lab results at ICCD 10/2003 – “Fully Differential Receiver Chipset for 40 Gb/s Applications using InP/InGaAs Single Heterojunction Bipolar Transistors (invited)”. 3 patents issued. \n \nContributed to design of 40Gbit InP HBT distributed amplifier laser modulator driver. 1 patent issued on this circuit. \n \n40G bit Limiting Amplifiers in 0.13u CMOS. Two new amplifier architectures were developed that exhibited in lab results \nof 40dB gain, 40Ghz bandwidth, 6ps p-p jitter, 6ps rise/fall times, with good eye diagrams. \n \n40G bit Limiting Amplifiers in 80nm CMOS technology. Taped out 3 amplifier designs – one incorporating an innovative offset cancellation circuit outside the RF path. Showed 42dB gain, 55GHz bandwidth and jitter of 2ps p-p. IDF submitted.  \n \nKey member of team specifying Intel’s 90nm SiGe BiCMOS process. Developed 40G test vehicles and structures. Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  2001  (6 years) Photonics Technology Operation 10Gbit Ethernet, 5Km and 40Km, MSA module design. Developed Optical Link Budgets for IEEE 802.3ae. Designed transponder electronics: TIA, limiting amp, SerDes / PLL bandwidth, laser driver and XAUI I/O. Module electrical design - power supply distribution/bypassing, signal interconnect/integrity, coupling/impedance matching, and performance tunable features. Developed 3 sub-module optical assembly, using a new fiber alignment (IDF filed) to improve manufacturability, isolation and reliability. Designed Fabry-Parot and DFB laser sub-modules including microwave interconnect, biasing, and optical isolator. Developed 1310nm/1550nm receiver, investigating PIN-diode/TIA integration.  \n \nEvaluated technologies, established foundry relationships, coordinated with other Intel groups in Europe and USA. Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  2001  (6 years) Photonics Technology Operation 10Gbit Ethernet, 5Km and 40Km, MSA module design. Developed Optical Link Budgets for IEEE 802.3ae. Designed transponder electronics: TIA, limiting amp, SerDes / PLL bandwidth, laser driver and XAUI I/O. Module electrical design - power supply distribution/bypassing, signal interconnect/integrity, coupling/impedance matching, and performance tunable features. Developed 3 sub-module optical assembly, using a new fiber alignment (IDF filed) to improve manufacturability, isolation and reliability. Designed Fabry-Parot and DFB laser sub-modules including microwave interconnect, biasing, and optical isolator. Developed 1310nm/1550nm receiver, investigating PIN-diode/TIA integration.  \n \nEvaluated technologies, established foundry relationships, coordinated with other Intel groups in Europe and USA. Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  2000  (5 years) Microprocessor Products Group Micro-Architecture, advanced technology,and circuit development for the third generation iA64 microprocessor (YOSEMITE). Identified and solved major issues to implement a highly parallel multi-gigahertz microprocessor in 90nm CMOS technology.  \n \nCluster Manager for REN, RSE, ISD, BRU units on MERCED (1 million transistors) (30 engineers). Coordinated, planned, and technically supported final logic, circuit design and layout. Major contributor to project level ops teams. 1st silicon functionality. \n \nMERCED (1st generation iA64/Itanium processor) STK Unit Manager (400K transistors) (10 engineers). Coordinated, planned and technically contributed to the uarchitecture development, HDL/logic design, circuit design and layout of one of the most timing critical and logically complex units on MERCED. 5 IDFs were filed for circuits, logic, and uarchitecture associated with this unit. Organized and ran circuit and layout reviews for the SE cluster (70% of chip, core execution and floating point), providing design solutions to improve speed and robustness. Key member of Circuit Management Review Committee, Physical MRC, and timing task force. Made major contributions to defining and implementing MERCEDs circuit design methodology. Developed critical circuits for SRAMs (current sensing), Register Files, CAMs, Data Path (Domino, DCVSL, pass gate) and full chip global interconnect (signal requirements, repeaters, clock and power supply distribution). Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  2000  (5 years) Microprocessor Products Group Micro-Architecture, advanced technology,and circuit development for the third generation iA64 microprocessor (YOSEMITE). Identified and solved major issues to implement a highly parallel multi-gigahertz microprocessor in 90nm CMOS technology.  \n \nCluster Manager for REN, RSE, ISD, BRU units on MERCED (1 million transistors) (30 engineers). Coordinated, planned, and technically supported final logic, circuit design and layout. Major contributor to project level ops teams. 1st silicon functionality. \n \nMERCED (1st generation iA64/Itanium processor) STK Unit Manager (400K transistors) (10 engineers). Coordinated, planned and technically contributed to the uarchitecture development, HDL/logic design, circuit design and layout of one of the most timing critical and logically complex units on MERCED. 5 IDFs were filed for circuits, logic, and uarchitecture associated with this unit. Organized and ran circuit and layout reviews for the SE cluster (70% of chip, core execution and floating point), providing design solutions to improve speed and robustness. Key member of Circuit Management Review Committee, Physical MRC, and timing task force. Made major contributions to defining and implementing MERCEDs circuit design methodology. Developed critical circuits for SRAMs (current sensing), Register Files, CAMs, Data Path (Domino, DCVSL, pass gate) and full chip global interconnect (signal requirements, repeaters, clock and power supply distribution). Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  1996  (1 year) SPG Technical Capabilities and Competencies Group Spread Spectrum Radio Project – Developed digital radio system architecture, along with low power circuits for radio sub-systems as follows: low noise amplifier, PLL and DDS frequency synthesizer, high speed flash A/D (3 patents issued). \n \nPLL Division Expert – Designed spread spectrum PLL used in all HP ink jet printers; 1st silicon went to production. Reviewed all PLL and memory designs division wide. Worked with i960 group to develop a new low power i960 uarchitecture (p200). \n \nDigital Imaging – Designed 4 new CMOS active pixel arrays, using new cells that had logarithmic light responses to eliminate shutters for digital camera applications. Designed readout circuitry including column & multiplexed A/D converters. First silicon success.\t. Principal Engineer, Senior Design Manager, Senior Member of Technical Staff Intel Corporation 1995  –  1996  (1 year) SPG Technical Capabilities and Competencies Group Spread Spectrum Radio Project – Developed digital radio system architecture, along with low power circuits for radio sub-systems as follows: low noise amplifier, PLL and DDS frequency synthesizer, high speed flash A/D (3 patents issued). \n \nPLL Division Expert – Designed spread spectrum PLL used in all HP ink jet printers; 1st silicon went to production. Reviewed all PLL and memory designs division wide. Worked with i960 group to develop a new low power i960 uarchitecture (p200). \n \nDigital Imaging – Designed 4 new CMOS active pixel arrays, using new cells that had logarithmic light responses to eliminate shutters for digital camera applications. Designed readout circuitry including column & multiplexed A/D converters. First silicon success.\t. Principal Engineer Rockwell DCD 1992  –  1995  (3 years) RSP; a low power, High MIPs/Watt super scalar DSP for wireless, cellular, and smart phone applications (6M transistors). \n \nDeveloped chip level techniques resulting in exceptionally low power. Architected low power instruction and data caches, performance optimized for DSP and graphics (patent filed). Cache circuits designed: 4M SRAM using current sensing (patented), set tag compare & MUX, FILO victim CAM; 1st silicon success. Analyzed algorithms and developed uarchitecture for the vector unit. Design of arithmetic data paths, including a carry sense ALU (IDF filed), and 6 port register file. \n \nDesign of low power analog/RF circuits: e.g. a low jitter, fast locking, clock multiplying DLL (patented); 1st silicon success. \n \nCellular (IS-54) communications systems analysis and chip uarchitecture. Identification of technology critical block specs. \n \nDeveloped in cooperation with Berkeley Design Consulting the industry standard for DSP benchmarks. Principal Engineer Rockwell DCD 1992  –  1995  (3 years) RSP; a low power, High MIPs/Watt super scalar DSP for wireless, cellular, and smart phone applications (6M transistors). \n \nDeveloped chip level techniques resulting in exceptionally low power. Architected low power instruction and data caches, performance optimized for DSP and graphics (patent filed). Cache circuits designed: 4M SRAM using current sensing (patented), set tag compare & MUX, FILO victim CAM; 1st silicon success. Analyzed algorithms and developed uarchitecture for the vector unit. Design of arithmetic data paths, including a carry sense ALU (IDF filed), and 6 port register file. \n \nDesign of low power analog/RF circuits: e.g. a low jitter, fast locking, clock multiplying DLL (patented); 1st silicon success. \n \nCellular (IS-54) communications systems analysis and chip uarchitecture. Identification of technology critical block specs. \n \nDeveloped in cooperation with Berkeley Design Consulting the industry standard for DSP benchmarks. Senior Member Technical Staff / Project Manager Mosel Vitelic 1990  –  1992  (2 years) MS441 concurrent write back 64k byte second level cache for Intel lapx486. Designed the following: An advanced DLL for phase aligned low jitter clock generation (patent issued); slew rate controlled I/O buffers (patent issued); Address range detect unit, using an ultra fast Ling subtracter (patent issued); Ultra fast cache tag compare circuit and cache tag RAM. \n \nMS451 concurrent write back 128k byte second level cache for Intel lapx486. Project management and scheduling. Design of cache tag and LRU RAM, including sense amp, decoders, and equalize circuitry. Verilog logic, circuit design & synthesis. \n \nMS461 concurrent write back 512k byte second level cache for Intel Pentium. Developed architecture, and identified and designed the technology critical circuits. Managed, planned and scheduled the design activity. \n. \nDeveloped uarchitecture spec for an advanced, low power, high integration, x86 CPU with power management controller for notebook PCs. Analyzed and made proposals for contract design of a pipelined VLIW GUI processor, and R4000VRX cache chip set. Initial design of a multimedia audio delta-sigma A/D and D/A converter chip. Senior Member Technical Staff / Project Manager Mosel Vitelic 1990  –  1992  (2 years) MS441 concurrent write back 64k byte second level cache for Intel lapx486. Designed the following: An advanced DLL for phase aligned low jitter clock generation (patent issued); slew rate controlled I/O buffers (patent issued); Address range detect unit, using an ultra fast Ling subtracter (patent issued); Ultra fast cache tag compare circuit and cache tag RAM. \n \nMS451 concurrent write back 128k byte second level cache for Intel lapx486. Project management and scheduling. Design of cache tag and LRU RAM, including sense amp, decoders, and equalize circuitry. Verilog logic, circuit design & synthesis. \n \nMS461 concurrent write back 512k byte second level cache for Intel Pentium. Developed architecture, and identified and designed the technology critical circuits. Managed, planned and scheduled the design activity. \n. \nDeveloped uarchitecture spec for an advanced, low power, high integration, x86 CPU with power management controller for notebook PCs. Analyzed and made proposals for contract design of a pipelined VLIW GUI processor, and R4000VRX cache chip set. Initial design of a multimedia audio delta-sigma A/D and D/A converter chip. Senior Staff Engineer Nexgen Microsystems 1988  –  1990  (2 years) F586 - an iapx486 ISA microprocessor with Pentium performance, years in advance. Predecessor of the AMD K6 microprocessor. \n \nMicro-architected data and control path of memory management unit. \n \nDesigned MMU address generation logic and adders. This included a four operand 32 bit integer adder, computing a 32 bit sum in four gate delays. It utilized Wallace Tree, Ling Adder, and DCVSL techniques. \n \nDesigned paging subsystem Including Table Look aside Buffer, compare, replacement, and protection logic. \n \nDesigned sections of floating point unit including instruction and operand queues, 5 port register file, format conversion unit and add/subtract/shift unit. Senior Staff Engineer Nexgen Microsystems 1988  –  1990  (2 years) F586 - an iapx486 ISA microprocessor with Pentium performance, years in advance. Predecessor of the AMD K6 microprocessor. \n \nMicro-architected data and control path of memory management unit. \n \nDesigned MMU address generation logic and adders. This included a four operand 32 bit integer adder, computing a 32 bit sum in four gate delays. It utilized Wallace Tree, Ling Adder, and DCVSL techniques. \n \nDesigned paging subsystem Including Table Look aside Buffer, compare, replacement, and protection logic. \n \nDesigned sections of floating point unit including instruction and operand queues, 5 port register file, format conversion unit and add/subtract/shift unit. Skills Semiconductors Integrated Circuit... Mixed Signal SoC Analog CMOS RF Wireless Communications... DAC PLL Synthesizers Computer Architecture Computer Arithmetic Verilog Cadence Spectre Microprocessors IC Fiber Optics Matlab Digital Signal... Wireless Engineering Management Coherent Receiver Active Pixel Array Business Planning Agilent ADS Circuit Design LNA Low-power Design ADCs Power Management ASIC Processors SERDES Signal Integrity BiCMOS Logic Synthesis Semiconductor Industry Layout MEMS DSP VCO RF Engineering SRAM Cadence MMIC RFIC Microwave See 33+     See less Skills  Semiconductors Integrated Circuit... Mixed Signal SoC Analog CMOS RF Wireless Communications... DAC PLL Synthesizers Computer Architecture Computer Arithmetic Verilog Cadence Spectre Microprocessors IC Fiber Optics Matlab Digital Signal... Wireless Engineering Management Coherent Receiver Active Pixel Array Business Planning Agilent ADS Circuit Design LNA Low-power Design ADCs Power Management ASIC Processors SERDES Signal Integrity BiCMOS Logic Synthesis Semiconductor Industry Layout MEMS DSP VCO RF Engineering SRAM Cadence MMIC RFIC Microwave See 33+     See less Semiconductors Integrated Circuit... Mixed Signal SoC Analog CMOS RF Wireless Communications... DAC PLL Synthesizers Computer Architecture Computer Arithmetic Verilog Cadence Spectre Microprocessors IC Fiber Optics Matlab Digital Signal... Wireless Engineering Management Coherent Receiver Active Pixel Array Business Planning Agilent ADS Circuit Design LNA Low-power Design ADCs Power Management ASIC Processors SERDES Signal Integrity BiCMOS Logic Synthesis Semiconductor Industry Layout MEMS DSP VCO RF Engineering SRAM Cadence MMIC RFIC Microwave See 33+     See less Semiconductors Integrated Circuit... Mixed Signal SoC Analog CMOS RF Wireless Communications... DAC PLL Synthesizers Computer Architecture Computer Arithmetic Verilog Cadence Spectre Microprocessors IC Fiber Optics Matlab Digital Signal... Wireless Engineering Management Coherent Receiver Active Pixel Array Business Planning Agilent ADS Circuit Design LNA Low-power Design ADCs Power Management ASIC Processors SERDES Signal Integrity BiCMOS Logic Synthesis Semiconductor Industry Layout MEMS DSP VCO RF Engineering SRAM Cadence MMIC RFIC Microwave See 33+     See less Education Arizona State University MSEE,  Electical Engineering 1990 Arizona State University PhD,  Electrical Engineering (currently in progress) University of Wisconsin-Milwaukee BSEE,  Electical Engineering Arizona State University MSEE,  Electical Engineering 1990 Arizona State University MSEE,  Electical Engineering 1990 Arizona State University MSEE,  Electical Engineering 1990 Arizona State University PhD,  Electrical Engineering (currently in progress) Arizona State University PhD,  Electrical Engineering (currently in progress) Arizona State University PhD,  Electrical Engineering (currently in progress) University of Wisconsin-Milwaukee BSEE,  Electical Engineering University of Wisconsin-Milwaukee BSEE,  Electical Engineering University of Wisconsin-Milwaukee BSEE,  Electical Engineering ", "Experience Member of Technical Staff Intel Corporation Member of Technical Staff Intel Corporation Member of Technical Staff Intel Corporation ", "Summary Experienced and capable Research and Development Engineer with strong background on Modeling of Communications Systems and C/C++ Software Development. Experience on the complete development cycle: Analysis, Design, Implementation and Testing of Protocols and Applications for wired and wireless networks. \n \nSpecialties: C/C++ development of real-time embedded systems.  \nObject-oriented analysis and design. \nExperience on the implementation of Wireless protocols.  \n4G LTE, 3G Technologies, CDMA2000 EV-DO & 1xRTT, IEEE 802.11, TCP/IP. \nWireless AdHoc and Sensor Networks. \nPhysical layer and RF performance testing. \nNetwork performance testing. \nMathematical Modeling using Game, Graph and Queuing Theory.  \nImplementation and enhancement of Algorithms to solve complex problems.  \nOPNET, MATLAB, CPLEX, PERL, TCL Summary Experienced and capable Research and Development Engineer with strong background on Modeling of Communications Systems and C/C++ Software Development. Experience on the complete development cycle: Analysis, Design, Implementation and Testing of Protocols and Applications for wired and wireless networks. \n \nSpecialties: C/C++ development of real-time embedded systems.  \nObject-oriented analysis and design. \nExperience on the implementation of Wireless protocols.  \n4G LTE, 3G Technologies, CDMA2000 EV-DO & 1xRTT, IEEE 802.11, TCP/IP. \nWireless AdHoc and Sensor Networks. \nPhysical layer and RF performance testing. \nNetwork performance testing. \nMathematical Modeling using Game, Graph and Queuing Theory.  \nImplementation and enhancement of Algorithms to solve complex problems.  \nOPNET, MATLAB, CPLEX, PERL, TCL Experienced and capable Research and Development Engineer with strong background on Modeling of Communications Systems and C/C++ Software Development. Experience on the complete development cycle: Analysis, Design, Implementation and Testing of Protocols and Applications for wired and wireless networks. \n \nSpecialties: C/C++ development of real-time embedded systems.  \nObject-oriented analysis and design. \nExperience on the implementation of Wireless protocols.  \n4G LTE, 3G Technologies, CDMA2000 EV-DO & 1xRTT, IEEE 802.11, TCP/IP. \nWireless AdHoc and Sensor Networks. \nPhysical layer and RF performance testing. \nNetwork performance testing. \nMathematical Modeling using Game, Graph and Queuing Theory.  \nImplementation and enhancement of Algorithms to solve complex problems.  \nOPNET, MATLAB, CPLEX, PERL, TCL Experienced and capable Research and Development Engineer with strong background on Modeling of Communications Systems and C/C++ Software Development. Experience on the complete development cycle: Analysis, Design, Implementation and Testing of Protocols and Applications for wired and wireless networks. \n \nSpecialties: C/C++ development of real-time embedded systems.  \nObject-oriented analysis and design. \nExperience on the implementation of Wireless protocols.  \n4G LTE, 3G Technologies, CDMA2000 EV-DO & 1xRTT, IEEE 802.11, TCP/IP. \nWireless AdHoc and Sensor Networks. \nPhysical layer and RF performance testing. \nNetwork performance testing. \nMathematical Modeling using Game, Graph and Queuing Theory.  \nImplementation and enhancement of Algorithms to solve complex problems.  \nOPNET, MATLAB, CPLEX, PERL, TCL Experience LTE Protocol Stack Developer Intel Corporation January 2013  – Present (2 years 8 months) Greater San Diego Area LTE Protocol Stack Developer Intel Corporation January 2013  – Present (2 years 8 months) Greater San Diego Area LTE Protocol Stack Developer Intel Corporation January 2013  – Present (2 years 8 months) Greater San Diego Area Skills EVDO C++ C LTE OPNET Wireless TCP/IP System Performance Debugging Software Development Perl Matlab IEEE 802.11 CPLEX TCL Embedded Systems OOAD Testing Mobile Communications Algorithms Linux RTOS Embedded Software RF CDMA VxWorks 3G Software Design Integration Digital Signal... 3GPP Device Drivers ClearCase System Architecture Simulations CDMA2000 WiFi See 22+     See less Skills  EVDO C++ C LTE OPNET Wireless TCP/IP System Performance Debugging Software Development Perl Matlab IEEE 802.11 CPLEX TCL Embedded Systems OOAD Testing Mobile Communications Algorithms Linux RTOS Embedded Software RF CDMA VxWorks 3G Software Design Integration Digital Signal... 3GPP Device Drivers ClearCase System Architecture Simulations CDMA2000 WiFi See 22+     See less EVDO C++ C LTE OPNET Wireless TCP/IP System Performance Debugging Software Development Perl Matlab IEEE 802.11 CPLEX TCL Embedded Systems OOAD Testing Mobile Communications Algorithms Linux RTOS Embedded Software RF CDMA VxWorks 3G Software Design Integration Digital Signal... 3GPP Device Drivers ClearCase System Architecture Simulations CDMA2000 WiFi See 22+     See less EVDO C++ C LTE OPNET Wireless TCP/IP System Performance Debugging Software Development Perl Matlab IEEE 802.11 CPLEX TCL Embedded Systems OOAD Testing Mobile Communications Algorithms Linux RTOS Embedded Software RF CDMA VxWorks 3G Software Design Integration Digital Signal... 3GPP Device Drivers ClearCase System Architecture Simulations CDMA2000 WiFi See 22+     See less Honors & Awards ", "Experience Member technical staff Intel Corporation December 2003  – Present (11 years 9 months) bangalore Member technical staff Intel Corporation December 2003  – Present (11 years 9 months) bangalore Member technical staff Intel Corporation December 2003  – Present (11 years 9 months) bangalore "]}