{"position": "Model Engineer", "company": "IBM", "profiles": ["Summary Highly analytical, dynamic, and results-focused professional, offering progressive experience in overseeing program conceptualization and development for the improvement of customer satisfaction and loyalty, expansion of market share, and increased profitability. Known for solid leadership acumen in setting up strategic vision and overseeing multi-dimensional tasks within established deadlines; consequently optimizing productivity and bottom-line results. \n Recognized for outstanding critical thinking skills necessary in data analyses to address practical issues of moderate scope and impact along with sound judgment in the assessment of program effectiveness. \n Equipped with excellent track record of dependability and unswerving focus on achieving bottom-line results, complemented with remarkable skills in formulating and executing advanced business solutions to meet diverse needs. \n Capable of developing and implementing strategies, policies, and procedures that optimize program operations to support operational and organizational needs. \n Adept at handling multiple tasks while ensuring high level of satisfaction in fast-paced, high-pressured, and deadline-driven environments. \n Currently holds active Secret Clearance \n Extensive professional and personal international travel. \nAreas of Expertise: \nLean Engineering, Client Relationship Management, Operations Management, Risk and Change Management, Problem-Solving and Decision-Making, Development Management, Leadership and Team Building, Organizational Development Summary Highly analytical, dynamic, and results-focused professional, offering progressive experience in overseeing program conceptualization and development for the improvement of customer satisfaction and loyalty, expansion of market share, and increased profitability. Known for solid leadership acumen in setting up strategic vision and overseeing multi-dimensional tasks within established deadlines; consequently optimizing productivity and bottom-line results. \n Recognized for outstanding critical thinking skills necessary in data analyses to address practical issues of moderate scope and impact along with sound judgment in the assessment of program effectiveness. \n Equipped with excellent track record of dependability and unswerving focus on achieving bottom-line results, complemented with remarkable skills in formulating and executing advanced business solutions to meet diverse needs. \n Capable of developing and implementing strategies, policies, and procedures that optimize program operations to support operational and organizational needs. \n Adept at handling multiple tasks while ensuring high level of satisfaction in fast-paced, high-pressured, and deadline-driven environments. \n Currently holds active Secret Clearance \n Extensive professional and personal international travel. \nAreas of Expertise: \nLean Engineering, Client Relationship Management, Operations Management, Risk and Change Management, Problem-Solving and Decision-Making, Development Management, Leadership and Team Building, Organizational Development Highly analytical, dynamic, and results-focused professional, offering progressive experience in overseeing program conceptualization and development for the improvement of customer satisfaction and loyalty, expansion of market share, and increased profitability. Known for solid leadership acumen in setting up strategic vision and overseeing multi-dimensional tasks within established deadlines; consequently optimizing productivity and bottom-line results. \n Recognized for outstanding critical thinking skills necessary in data analyses to address practical issues of moderate scope and impact along with sound judgment in the assessment of program effectiveness. \n Equipped with excellent track record of dependability and unswerving focus on achieving bottom-line results, complemented with remarkable skills in formulating and executing advanced business solutions to meet diverse needs. \n Capable of developing and implementing strategies, policies, and procedures that optimize program operations to support operational and organizational needs. \n Adept at handling multiple tasks while ensuring high level of satisfaction in fast-paced, high-pressured, and deadline-driven environments. \n Currently holds active Secret Clearance \n Extensive professional and personal international travel. \nAreas of Expertise: \nLean Engineering, Client Relationship Management, Operations Management, Risk and Change Management, Problem-Solving and Decision-Making, Development Management, Leadership and Team Building, Organizational Development Highly analytical, dynamic, and results-focused professional, offering progressive experience in overseeing program conceptualization and development for the improvement of customer satisfaction and loyalty, expansion of market share, and increased profitability. Known for solid leadership acumen in setting up strategic vision and overseeing multi-dimensional tasks within established deadlines; consequently optimizing productivity and bottom-line results. \n Recognized for outstanding critical thinking skills necessary in data analyses to address practical issues of moderate scope and impact along with sound judgment in the assessment of program effectiveness. \n Equipped with excellent track record of dependability and unswerving focus on achieving bottom-line results, complemented with remarkable skills in formulating and executing advanced business solutions to meet diverse needs. \n Capable of developing and implementing strategies, policies, and procedures that optimize program operations to support operational and organizational needs. \n Adept at handling multiple tasks while ensuring high level of satisfaction in fast-paced, high-pressured, and deadline-driven environments. \n Currently holds active Secret Clearance \n Extensive professional and personal international travel. \nAreas of Expertise: \nLean Engineering, Client Relationship Management, Operations Management, Risk and Change Management, Problem-Solving and Decision-Making, Development Management, Leadership and Team Building, Organizational Development Experience Program Planner Raytheon June 2010  – Present (5 years 3 months) Andover, MA Strategic Planning and Implementation \n• Assume full responsibility in establishing and maintaining Integrated Master Schedules (IMS) for multiyear DoD (Department of Defense) programs up to 3 billion in lifetime revenue in accordance with Earned Value Management Systems, which met DCMA (Defense Contract Management Agency) guidelines for government contracts. \n• Systematically develop actionable plans utilizing reverse planning, risk, and opportunity. \n• Formulate a master phasing schedule view to show both baseline and current outlook dates and distribute to the Integrated Product Teams (IPTs) and Cross Product Teams (CPTs) for their use.  \n• Drive positive results in forecasting and monitoring performance of programs by overseeing earned value submissions. \n \nProject Management (Logistics) \n• Hold accountability in developing an executable plan and overseeing changing contractual commitments by summarizing any risks or opportunities to the program team. \n• Directly supervise program execution at the Material Consolidation Point (MCP) while serving as a primary contact person for the MCP activities. \n• Provide expert oversight in measuring progress and identifying any problems to the appropriate program team members to ensure that workable solutions would not affect a schedule.  \n•\tHandle and coordinate the movement of equipment from US facilities to international countries working with product leads, freight forwarder, as well as government regulation for more than $50M in product sales. \n \nTool Deployment: \n• Provide direct assistance to all automation and development of existing tool suite as well as with all testing of enterprise tool suite while collaborating with the Enterprise Team and business tool subject matter experts. \n• Handle comprehensive change request support which included developing detailed mock-ups for finalized requirements. \n• Serve as a subject matter expert in conducting and completing tool suite training and deployment. Program Management IBM January 2007  –  June 2010  (3 years 6 months) Essex Junction, VT • Rendered expert oversight to trusted foundry semiconductor aerospace and defense customers totaling 75 million in development per year which included 7 million in hardware sales. \n• Executed various tasks which included coordinating schedule, team deliverables, resource assignments, risk management, change management, project status reports, meeting minutes, agendas, action items, problem resolution, and key milestones delivery for technology transfers and development.  \n• Prepared customer requested quotes for semiconductor IP (Intellectual Property), ASIC (Application Specific Integrated Circuits), and technology offerings.  \n• Displayed strong leadership skills in spearheading event planning and hosting annual 3-day workshop for more than 100 external customers associated to IBM Trusted Foundry Services. \n• Applied best strategic approaches in ensuring appropriate levels of quality, on time and within budget delivery, and project alignment with the program plan and program governance arrangements; guaranteed that there is efficient allocation of common resources and skills within the project portfolio. \n• Directly supervised third party contributions to the program; communications to all stakeholders; both dependencies and interfaces between projects, and risks to the program’s successful outcome. \n• Displayed strong leadership in initiating extra activities and other management interventions wherever gaps in the program were identified or issues arose. \n• Presented progress of the program at regular intervals to the program director. \n• Managed key hardware program integrating the contracting agent and three other third party entities.  \n• Executed a production launch which enabled IBM Microelectronics’ first EAL5+ secure flow qualification \n• Spearheaded a key project that was largely a ‘services’ led engagement rather than hardware, which presented elements of contention associated with effective and executable solutions for the client. Device Model Engineer IBM January 2004  –  December 2006  (3 years) Essex Junction, VT • Regarded as an effective team leader for managing laboratory characterization techniques as well as for modeling enablement. \n• Provided keen attention to detail in establishing DC/AC electrical parametric models, mismatch models, and noise models semiconductor technologies failure analysis; solving problem and deep dive projects on product yield improvements. \n• Rendered exceptional support to all request/issues in 65nm technology enablement, including various tasks such as:  \no On-demand enablement provided for key customer product problem which was delaying the start of product ramp.  \no On the STI-mismatch/stress/simulation setup problem in Circuit/Device simulation support  \no Failure analysis; override support; and problem solving. \n• Thoroughly reviewed the temperature slope issues for semiconductor devices.  \n• Played a leadership role in directing needed model fixes, such as edge cap fix in sram devices; floating body, body contacted gate current fix; and wrapper model mismatch fix. \n• Prepared team documentation (Wiki), which allowed new hires and peer engineers to learn, view, and comment on work flow without using meetings and/or repetitive person to person explanations. \n• Carried out responsibilities in maintaining all DC testing standards updated on Wiki lab web page. \n• Spearheaded modeling interaction for Lean manufacturing project while supporting the development of standard threshold voltage mismatch testing script that could be assisted by the laboratory and accepted by all modeling groups. \n• Demonstrated excellent skills in presenting device modeling package to external customer for technology transfer. \n• Instigated DC testing standards across all the modeling groups. \n• Successfully established compact models for MOSFETs for various semiconductor technologies from 180-nm to 32-nm to support internal and external customer products. Visiting Research Assistant IMEP/University of Grenoble February 2003  –  December 2003  (11 months) Grenoble, France Research and device development of new innovative semiconductor device (G4-FET). Assisted in development of key lab measurements sponsored by NASA/JPL. Research Assistant University of Tennessee January 2003  –  December 2003  (1 year) Knoxville, TN Design, simulation, layout, and testing of analog circuits and devices. Feb. 2003 to Apr. 2003 and from Sept. 2003 to Dec. 2003. Visiting research assistant with Vanderbilt University, Nashville, TN, June 2003. Consultant Concorde Microsystems, INC. August 2002  –  August 2003  (1 year 1 month) Knoxville, TN Created layout and schematics for wireless integrated circuits. Organized design database for custom products. Maintained CAD flow for custom product design. Research Assistant Mississippi State University January 2000  –  June 2002  (2 years 6 months) Starkville, MS Design, simulation, layout, and test of analog/mixed signal circuits and devices for space applications used by JPL/NASA. Implemented and organized software controlled measurement equipment. Developed manuals for future students. Purchased parts and equipment for laboratory. Designed programmable circuits in semiconductors: EEPROM (floating poly gate), programmable JFET, and reference circuits. Program Planner Raytheon June 2010  – Present (5 years 3 months) Andover, MA Strategic Planning and Implementation \n• Assume full responsibility in establishing and maintaining Integrated Master Schedules (IMS) for multiyear DoD (Department of Defense) programs up to 3 billion in lifetime revenue in accordance with Earned Value Management Systems, which met DCMA (Defense Contract Management Agency) guidelines for government contracts. \n• Systematically develop actionable plans utilizing reverse planning, risk, and opportunity. \n• Formulate a master phasing schedule view to show both baseline and current outlook dates and distribute to the Integrated Product Teams (IPTs) and Cross Product Teams (CPTs) for their use.  \n• Drive positive results in forecasting and monitoring performance of programs by overseeing earned value submissions. \n \nProject Management (Logistics) \n• Hold accountability in developing an executable plan and overseeing changing contractual commitments by summarizing any risks or opportunities to the program team. \n• Directly supervise program execution at the Material Consolidation Point (MCP) while serving as a primary contact person for the MCP activities. \n• Provide expert oversight in measuring progress and identifying any problems to the appropriate program team members to ensure that workable solutions would not affect a schedule.  \n•\tHandle and coordinate the movement of equipment from US facilities to international countries working with product leads, freight forwarder, as well as government regulation for more than $50M in product sales. \n \nTool Deployment: \n• Provide direct assistance to all automation and development of existing tool suite as well as with all testing of enterprise tool suite while collaborating with the Enterprise Team and business tool subject matter experts. \n• Handle comprehensive change request support which included developing detailed mock-ups for finalized requirements. \n• Serve as a subject matter expert in conducting and completing tool suite training and deployment. Program Planner Raytheon June 2010  – Present (5 years 3 months) Andover, MA Strategic Planning and Implementation \n• Assume full responsibility in establishing and maintaining Integrated Master Schedules (IMS) for multiyear DoD (Department of Defense) programs up to 3 billion in lifetime revenue in accordance with Earned Value Management Systems, which met DCMA (Defense Contract Management Agency) guidelines for government contracts. \n• Systematically develop actionable plans utilizing reverse planning, risk, and opportunity. \n• Formulate a master phasing schedule view to show both baseline and current outlook dates and distribute to the Integrated Product Teams (IPTs) and Cross Product Teams (CPTs) for their use.  \n• Drive positive results in forecasting and monitoring performance of programs by overseeing earned value submissions. \n \nProject Management (Logistics) \n• Hold accountability in developing an executable plan and overseeing changing contractual commitments by summarizing any risks or opportunities to the program team. \n• Directly supervise program execution at the Material Consolidation Point (MCP) while serving as a primary contact person for the MCP activities. \n• Provide expert oversight in measuring progress and identifying any problems to the appropriate program team members to ensure that workable solutions would not affect a schedule.  \n•\tHandle and coordinate the movement of equipment from US facilities to international countries working with product leads, freight forwarder, as well as government regulation for more than $50M in product sales. \n \nTool Deployment: \n• Provide direct assistance to all automation and development of existing tool suite as well as with all testing of enterprise tool suite while collaborating with the Enterprise Team and business tool subject matter experts. \n• Handle comprehensive change request support which included developing detailed mock-ups for finalized requirements. \n• Serve as a subject matter expert in conducting and completing tool suite training and deployment. Program Management IBM January 2007  –  June 2010  (3 years 6 months) Essex Junction, VT • Rendered expert oversight to trusted foundry semiconductor aerospace and defense customers totaling 75 million in development per year which included 7 million in hardware sales. \n• Executed various tasks which included coordinating schedule, team deliverables, resource assignments, risk management, change management, project status reports, meeting minutes, agendas, action items, problem resolution, and key milestones delivery for technology transfers and development.  \n• Prepared customer requested quotes for semiconductor IP (Intellectual Property), ASIC (Application Specific Integrated Circuits), and technology offerings.  \n• Displayed strong leadership skills in spearheading event planning and hosting annual 3-day workshop for more than 100 external customers associated to IBM Trusted Foundry Services. \n• Applied best strategic approaches in ensuring appropriate levels of quality, on time and within budget delivery, and project alignment with the program plan and program governance arrangements; guaranteed that there is efficient allocation of common resources and skills within the project portfolio. \n• Directly supervised third party contributions to the program; communications to all stakeholders; both dependencies and interfaces between projects, and risks to the program’s successful outcome. \n• Displayed strong leadership in initiating extra activities and other management interventions wherever gaps in the program were identified or issues arose. \n• Presented progress of the program at regular intervals to the program director. \n• Managed key hardware program integrating the contracting agent and three other third party entities.  \n• Executed a production launch which enabled IBM Microelectronics’ first EAL5+ secure flow qualification \n• Spearheaded a key project that was largely a ‘services’ led engagement rather than hardware, which presented elements of contention associated with effective and executable solutions for the client. Program Management IBM January 2007  –  June 2010  (3 years 6 months) Essex Junction, VT • Rendered expert oversight to trusted foundry semiconductor aerospace and defense customers totaling 75 million in development per year which included 7 million in hardware sales. \n• Executed various tasks which included coordinating schedule, team deliverables, resource assignments, risk management, change management, project status reports, meeting minutes, agendas, action items, problem resolution, and key milestones delivery for technology transfers and development.  \n• Prepared customer requested quotes for semiconductor IP (Intellectual Property), ASIC (Application Specific Integrated Circuits), and technology offerings.  \n• Displayed strong leadership skills in spearheading event planning and hosting annual 3-day workshop for more than 100 external customers associated to IBM Trusted Foundry Services. \n• Applied best strategic approaches in ensuring appropriate levels of quality, on time and within budget delivery, and project alignment with the program plan and program governance arrangements; guaranteed that there is efficient allocation of common resources and skills within the project portfolio. \n• Directly supervised third party contributions to the program; communications to all stakeholders; both dependencies and interfaces between projects, and risks to the program’s successful outcome. \n• Displayed strong leadership in initiating extra activities and other management interventions wherever gaps in the program were identified or issues arose. \n• Presented progress of the program at regular intervals to the program director. \n• Managed key hardware program integrating the contracting agent and three other third party entities.  \n• Executed a production launch which enabled IBM Microelectronics’ first EAL5+ secure flow qualification \n• Spearheaded a key project that was largely a ‘services’ led engagement rather than hardware, which presented elements of contention associated with effective and executable solutions for the client. Device Model Engineer IBM January 2004  –  December 2006  (3 years) Essex Junction, VT • Regarded as an effective team leader for managing laboratory characterization techniques as well as for modeling enablement. \n• Provided keen attention to detail in establishing DC/AC electrical parametric models, mismatch models, and noise models semiconductor technologies failure analysis; solving problem and deep dive projects on product yield improvements. \n• Rendered exceptional support to all request/issues in 65nm technology enablement, including various tasks such as:  \no On-demand enablement provided for key customer product problem which was delaying the start of product ramp.  \no On the STI-mismatch/stress/simulation setup problem in Circuit/Device simulation support  \no Failure analysis; override support; and problem solving. \n• Thoroughly reviewed the temperature slope issues for semiconductor devices.  \n• Played a leadership role in directing needed model fixes, such as edge cap fix in sram devices; floating body, body contacted gate current fix; and wrapper model mismatch fix. \n• Prepared team documentation (Wiki), which allowed new hires and peer engineers to learn, view, and comment on work flow without using meetings and/or repetitive person to person explanations. \n• Carried out responsibilities in maintaining all DC testing standards updated on Wiki lab web page. \n• Spearheaded modeling interaction for Lean manufacturing project while supporting the development of standard threshold voltage mismatch testing script that could be assisted by the laboratory and accepted by all modeling groups. \n• Demonstrated excellent skills in presenting device modeling package to external customer for technology transfer. \n• Instigated DC testing standards across all the modeling groups. \n• Successfully established compact models for MOSFETs for various semiconductor technologies from 180-nm to 32-nm to support internal and external customer products. Device Model Engineer IBM January 2004  –  December 2006  (3 years) Essex Junction, VT • Regarded as an effective team leader for managing laboratory characterization techniques as well as for modeling enablement. \n• Provided keen attention to detail in establishing DC/AC electrical parametric models, mismatch models, and noise models semiconductor technologies failure analysis; solving problem and deep dive projects on product yield improvements. \n• Rendered exceptional support to all request/issues in 65nm technology enablement, including various tasks such as:  \no On-demand enablement provided for key customer product problem which was delaying the start of product ramp.  \no On the STI-mismatch/stress/simulation setup problem in Circuit/Device simulation support  \no Failure analysis; override support; and problem solving. \n• Thoroughly reviewed the temperature slope issues for semiconductor devices.  \n• Played a leadership role in directing needed model fixes, such as edge cap fix in sram devices; floating body, body contacted gate current fix; and wrapper model mismatch fix. \n• Prepared team documentation (Wiki), which allowed new hires and peer engineers to learn, view, and comment on work flow without using meetings and/or repetitive person to person explanations. \n• Carried out responsibilities in maintaining all DC testing standards updated on Wiki lab web page. \n• Spearheaded modeling interaction for Lean manufacturing project while supporting the development of standard threshold voltage mismatch testing script that could be assisted by the laboratory and accepted by all modeling groups. \n• Demonstrated excellent skills in presenting device modeling package to external customer for technology transfer. \n• Instigated DC testing standards across all the modeling groups. \n• Successfully established compact models for MOSFETs for various semiconductor technologies from 180-nm to 32-nm to support internal and external customer products. Visiting Research Assistant IMEP/University of Grenoble February 2003  –  December 2003  (11 months) Grenoble, France Research and device development of new innovative semiconductor device (G4-FET). Assisted in development of key lab measurements sponsored by NASA/JPL. Visiting Research Assistant IMEP/University of Grenoble February 2003  –  December 2003  (11 months) Grenoble, France Research and device development of new innovative semiconductor device (G4-FET). Assisted in development of key lab measurements sponsored by NASA/JPL. Research Assistant University of Tennessee January 2003  –  December 2003  (1 year) Knoxville, TN Design, simulation, layout, and testing of analog circuits and devices. Feb. 2003 to Apr. 2003 and from Sept. 2003 to Dec. 2003. Visiting research assistant with Vanderbilt University, Nashville, TN, June 2003. Research Assistant University of Tennessee January 2003  –  December 2003  (1 year) Knoxville, TN Design, simulation, layout, and testing of analog circuits and devices. Feb. 2003 to Apr. 2003 and from Sept. 2003 to Dec. 2003. Visiting research assistant with Vanderbilt University, Nashville, TN, June 2003. Consultant Concorde Microsystems, INC. August 2002  –  August 2003  (1 year 1 month) Knoxville, TN Created layout and schematics for wireless integrated circuits. Organized design database for custom products. Maintained CAD flow for custom product design. Consultant Concorde Microsystems, INC. August 2002  –  August 2003  (1 year 1 month) Knoxville, TN Created layout and schematics for wireless integrated circuits. Organized design database for custom products. Maintained CAD flow for custom product design. Research Assistant Mississippi State University January 2000  –  June 2002  (2 years 6 months) Starkville, MS Design, simulation, layout, and test of analog/mixed signal circuits and devices for space applications used by JPL/NASA. Implemented and organized software controlled measurement equipment. Developed manuals for future students. Purchased parts and equipment for laboratory. Designed programmable circuits in semiconductors: EEPROM (floating poly gate), programmable JFET, and reference circuits. Research Assistant Mississippi State University January 2000  –  June 2002  (2 years 6 months) Starkville, MS Design, simulation, layout, and test of analog/mixed signal circuits and devices for space applications used by JPL/NASA. Implemented and organized software controlled measurement equipment. Developed manuals for future students. Purchased parts and equipment for laboratory. Designed programmable circuits in semiconductors: EEPROM (floating poly gate), programmable JFET, and reference circuits. Languages French Elementary proficiency French Elementary proficiency French Elementary proficiency Elementary proficiency Skills Lean Principles SAP Cadence MS Project Six Sigma Earned Value Management MRP PDM Semiconductor Device Project Risk Project Management Program Management Milestones Professional Semiconductors Simulations Circuit Design Project Planning IC Strategy Engineering Management ASIC Integration Testing See 8+     See less Skills  Lean Principles SAP Cadence MS Project Six Sigma Earned Value Management MRP PDM Semiconductor Device Project Risk Project Management Program Management Milestones Professional Semiconductors Simulations Circuit Design Project Planning IC Strategy Engineering Management ASIC Integration Testing See 8+     See less Lean Principles SAP Cadence MS Project Six Sigma Earned Value Management MRP PDM Semiconductor Device Project Risk Project Management Program Management Milestones Professional Semiconductors Simulations Circuit Design Project Planning IC Strategy Engineering Management ASIC Integration Testing See 8+     See less Lean Principles SAP Cadence MS Project Six Sigma Earned Value Management MRP PDM Semiconductor Device Project Risk Project Management Program Management Milestones Professional Semiconductors Simulations Circuit Design Project Planning IC Strategy Engineering Management ASIC Integration Testing See 8+     See less Education Mississippi State University M.S.,  Degree in Electrical Engineering 2001  – 2002 Mississippi State University B.S.,  Degree in Electrical Engineering 1997  – 2000 Mississippi State University M.S.,  Degree in Electrical Engineering 2001  – 2002 Mississippi State University M.S.,  Degree in Electrical Engineering 2001  – 2002 Mississippi State University M.S.,  Degree in Electrical Engineering 2001  – 2002 Mississippi State University B.S.,  Degree in Electrical Engineering 1997  – 2000 Mississippi State University B.S.,  Degree in Electrical Engineering 1997  – 2000 Mississippi State University B.S.,  Degree in Electrical Engineering 1997  – 2000 ", "Skills Matlab Simulations C Semiconductors Algorithms Software Engineering Embedded Systems R&D C++ Nanotechnology Testing Skills  Matlab Simulations C Semiconductors Algorithms Software Engineering Embedded Systems R&D C++ Nanotechnology Testing Matlab Simulations C Semiconductors Algorithms Software Engineering Embedded Systems R&D C++ Nanotechnology Testing Matlab Simulations C Semiconductors Algorithms Software Engineering Embedded Systems R&D C++ Nanotechnology Testing ", "Experience Staff Device Engineer Actel Corporation Compact Model Engineer IBM July 2005  –  August 2007  (2 years 2 months) Staff Device Engineer Actel Corporation Staff Device Engineer Actel Corporation Compact Model Engineer IBM July 2005  –  August 2007  (2 years 2 months) Compact Model Engineer IBM July 2005  –  August 2007  (2 years 2 months) Education Lehigh University PhD,  Electrical Engineering Tsinghua University M.Eng.,  Electronics Engineering Tsinghua University B.Eng.,  Electronics Engineering Lehigh University PhD,  Electrical Engineering Lehigh University PhD,  Electrical Engineering Lehigh University PhD,  Electrical Engineering Tsinghua University M.Eng.,  Electronics Engineering Tsinghua University M.Eng.,  Electronics Engineering Tsinghua University M.Eng.,  Electronics Engineering Tsinghua University B.Eng.,  Electronics Engineering Tsinghua University B.Eng.,  Electronics Engineering Tsinghua University B.Eng.,  Electronics Engineering ", "Summary Education: Building academic skills in Finance & Strategy \n \nWork Experience:  \n-- Product Process Interaction and Leakage models for FinFET/planar Nano Technologies. \n \n-- Expert in Compact Modeling & Process Design Kit (PDK) Models. \n \n-- Compact mathematical and statistical device models development, test and release 90nm, 65nm, \n45nm, 32nm, 22/20nm, 14nm & 10nm Low-Power, high performance Bulk/SOI technologies \n \n \nFocus: \nDevice Modeling & Simulation \nCircuit-Technology Optimization \nData Analytics & Insight generation \nMobile Products & Applications \nSoftware Architecture & Development \nGlobal Team Development \n \nVolunteer:  \nStrengthen STEM careers \nCommunity development \nCulture and career mentor \nEvent organizer Summary Education: Building academic skills in Finance & Strategy \n \nWork Experience:  \n-- Product Process Interaction and Leakage models for FinFET/planar Nano Technologies. \n \n-- Expert in Compact Modeling & Process Design Kit (PDK) Models. \n \n-- Compact mathematical and statistical device models development, test and release 90nm, 65nm, \n45nm, 32nm, 22/20nm, 14nm & 10nm Low-Power, high performance Bulk/SOI technologies \n \n \nFocus: \nDevice Modeling & Simulation \nCircuit-Technology Optimization \nData Analytics & Insight generation \nMobile Products & Applications \nSoftware Architecture & Development \nGlobal Team Development \n \nVolunteer:  \nStrengthen STEM careers \nCommunity development \nCulture and career mentor \nEvent organizer Education: Building academic skills in Finance & Strategy \n \nWork Experience:  \n-- Product Process Interaction and Leakage models for FinFET/planar Nano Technologies. \n \n-- Expert in Compact Modeling & Process Design Kit (PDK) Models. \n \n-- Compact mathematical and statistical device models development, test and release 90nm, 65nm, \n45nm, 32nm, 22/20nm, 14nm & 10nm Low-Power, high performance Bulk/SOI technologies \n \n \nFocus: \nDevice Modeling & Simulation \nCircuit-Technology Optimization \nData Analytics & Insight generation \nMobile Products & Applications \nSoftware Architecture & Development \nGlobal Team Development \n \nVolunteer:  \nStrengthen STEM careers \nCommunity development \nCulture and career mentor \nEvent organizer Education: Building academic skills in Finance & Strategy \n \nWork Experience:  \n-- Product Process Interaction and Leakage models for FinFET/planar Nano Technologies. \n \n-- Expert in Compact Modeling & Process Design Kit (PDK) Models. \n \n-- Compact mathematical and statistical device models development, test and release 90nm, 65nm, \n45nm, 32nm, 22/20nm, 14nm & 10nm Low-Power, high performance Bulk/SOI technologies \n \n \nFocus: \nDevice Modeling & Simulation \nCircuit-Technology Optimization \nData Analytics & Insight generation \nMobile Products & Applications \nSoftware Architecture & Development \nGlobal Team Development \n \nVolunteer:  \nStrengthen STEM careers \nCommunity development \nCulture and career mentor \nEvent organizer Experience Engineer GLOBALFOUNDRIES July 2015  – Present (2 months) Chicago, IL Product Process Interaction Engineer IBM June 2012  –  June 2014  (2 years 1 month) Fishkill, NY Lead Compact Model Engineer IBM August 2007  –  June 2012  (4 years 11 months) Essex Junction, VT Compact Model Engineer IBM April 2004  –  August 2007  (3 years 5 months) Essex Junction, VT Engineer GLOBALFOUNDRIES July 2015  – Present (2 months) Chicago, IL Engineer GLOBALFOUNDRIES July 2015  – Present (2 months) Chicago, IL Product Process Interaction Engineer IBM June 2012  –  June 2014  (2 years 1 month) Fishkill, NY Product Process Interaction Engineer IBM June 2012  –  June 2014  (2 years 1 month) Fishkill, NY Lead Compact Model Engineer IBM August 2007  –  June 2012  (4 years 11 months) Essex Junction, VT Lead Compact Model Engineer IBM August 2007  –  June 2012  (4 years 11 months) Essex Junction, VT Compact Model Engineer IBM April 2004  –  August 2007  (3 years 5 months) Essex Junction, VT Compact Model Engineer IBM April 2004  –  August 2007  (3 years 5 months) Essex Junction, VT Languages English Telugu Hindi English Telugu Hindi English Telugu Hindi Skills Matlab C++ Excel VBA Data Modeling Algorithms Statistical Data... Process Optimization Cross-functional Team... Simulations VLSI CMOS JMP SAS Programming EDA Perl Semiconductors ASIC Verilog Unix SPICE Cadence Virtuoso Circuit Layout Computer Architecture Analog Integrated Circuit... Mathematical Modeling Strategic Leadership Java Data Structures VHDL Physical Design Circuit Design FPGA Shell Scripting TCL Microprocessors Static Timing Analysis Processors Embedded Systems RTL design Circuit Simulators SoC Mixed Signal SystemVerilog ModelSim Cadence Hardware Architecture Analog Circuit Design Debugging See 34+     See less Skills  Matlab C++ Excel VBA Data Modeling Algorithms Statistical Data... Process Optimization Cross-functional Team... Simulations VLSI CMOS JMP SAS Programming EDA Perl Semiconductors ASIC Verilog Unix SPICE Cadence Virtuoso Circuit Layout Computer Architecture Analog Integrated Circuit... Mathematical Modeling Strategic Leadership Java Data Structures VHDL Physical Design Circuit Design FPGA Shell Scripting TCL Microprocessors Static Timing Analysis Processors Embedded Systems RTL design Circuit Simulators SoC Mixed Signal SystemVerilog ModelSim Cadence Hardware Architecture Analog Circuit Design Debugging See 34+     See less Matlab C++ Excel VBA Data Modeling Algorithms Statistical Data... Process Optimization Cross-functional Team... Simulations VLSI CMOS JMP SAS Programming EDA Perl Semiconductors ASIC Verilog Unix SPICE Cadence Virtuoso Circuit Layout Computer Architecture Analog Integrated Circuit... Mathematical Modeling Strategic Leadership Java Data Structures VHDL Physical Design Circuit Design FPGA Shell Scripting TCL Microprocessors Static Timing Analysis Processors Embedded Systems RTL design Circuit Simulators SoC Mixed Signal SystemVerilog ModelSim Cadence Hardware Architecture Analog Circuit Design Debugging See 34+     See less Matlab C++ Excel VBA Data Modeling Algorithms Statistical Data... Process Optimization Cross-functional Team... Simulations VLSI CMOS JMP SAS Programming EDA Perl Semiconductors ASIC Verilog Unix SPICE Cadence Virtuoso Circuit Layout Computer Architecture Analog Integrated Circuit... Mathematical Modeling Strategic Leadership Java Data Structures VHDL Physical Design Circuit Design FPGA Shell Scripting TCL Microprocessors Static Timing Analysis Processors Embedded Systems RTL design Circuit Simulators SoC Mixed Signal SystemVerilog ModelSim Cadence Hardware Architecture Analog Circuit Design Debugging See 34+     See less Honors & Awards "]}