{"position": "Nurse", "company": "Stanford University", "profiles": ["Experience Registered Nurse Stanford University Medical Center March 2008  – Present (7 years 6 months) Registered Nurse Stanford University Medical Center March 2008  – Present (7 years 6 months) Registered Nurse Stanford University Medical Center March 2008  – Present (7 years 6 months) Education Loma Linda University Loma Linda University Loma Linda University Loma Linda University ", "Experience Research Nurse Stanford University July 2012  – Present (3 years 2 months) Palo Alto, CA Registered Nurse LifeConnections Health Center-Cisco Systems October 2010  –  July 2012  (1 year 10 months) San Jose Provided primary and urgent care services including triage, point-of-care testing, blood draws, wound care, treadmill stress testing, and education for internal medicine patients. Registered Nurse RockMed September 2010  –  September 2011  (1 year 1 month) Bay Area, CA Triage with rapid assessment and treatment (wounds, drug OD, ETOH, hypoglycemia, general complaints). Study Coordinator Stanford University 2000  –  2008  (8 years) Stanford, CA Coordinated a study on treating depression during pregnancy. Performed psychological interviews. Contributing author on research papers. Consultant SRI Consulting July 1998  –  December 1999  (1 year 6 months) Conducted market research on the pharmaceutical industry. Research Nurse Stanford University July 2012  – Present (3 years 2 months) Palo Alto, CA Research Nurse Stanford University July 2012  – Present (3 years 2 months) Palo Alto, CA Registered Nurse LifeConnections Health Center-Cisco Systems October 2010  –  July 2012  (1 year 10 months) San Jose Provided primary and urgent care services including triage, point-of-care testing, blood draws, wound care, treadmill stress testing, and education for internal medicine patients. Registered Nurse LifeConnections Health Center-Cisco Systems October 2010  –  July 2012  (1 year 10 months) San Jose Provided primary and urgent care services including triage, point-of-care testing, blood draws, wound care, treadmill stress testing, and education for internal medicine patients. Registered Nurse RockMed September 2010  –  September 2011  (1 year 1 month) Bay Area, CA Triage with rapid assessment and treatment (wounds, drug OD, ETOH, hypoglycemia, general complaints). Registered Nurse RockMed September 2010  –  September 2011  (1 year 1 month) Bay Area, CA Triage with rapid assessment and treatment (wounds, drug OD, ETOH, hypoglycemia, general complaints). Study Coordinator Stanford University 2000  –  2008  (8 years) Stanford, CA Coordinated a study on treating depression during pregnancy. Performed psychological interviews. Contributing author on research papers. Study Coordinator Stanford University 2000  –  2008  (8 years) Stanford, CA Coordinated a study on treating depression during pregnancy. Performed psychological interviews. Contributing author on research papers. Consultant SRI Consulting July 1998  –  December 1999  (1 year 6 months) Conducted market research on the pharmaceutical industry. Consultant SRI Consulting July 1998  –  December 1999  (1 year 6 months) Conducted market research on the pharmaceutical industry. Skills Pediatrics Clinical Research Public Health Inpatient Hospitals Healthcare Medicine Treatment Nursing Psychology Pharmaceutical Industry Clinical Trials Wound Care Patient Safety Internal Medicine Critical Care See 1+     See less Skills  Pediatrics Clinical Research Public Health Inpatient Hospitals Healthcare Medicine Treatment Nursing Psychology Pharmaceutical Industry Clinical Trials Wound Care Patient Safety Internal Medicine Critical Care See 1+     See less Pediatrics Clinical Research Public Health Inpatient Hospitals Healthcare Medicine Treatment Nursing Psychology Pharmaceutical Industry Clinical Trials Wound Care Patient Safety Internal Medicine Critical Care See 1+     See less Pediatrics Clinical Research Public Health Inpatient Hospitals Healthcare Medicine Treatment Nursing Psychology Pharmaceutical Industry Clinical Trials Wound Care Patient Safety Internal Medicine Critical Care See 1+     See less Education Samuel Merritt University BSN,  Nursing 2009  – 2010 University of California, Davis Bachelor of Science (BS),  Physiology 1983  – 1986 Samuel Merritt University BSN,  Nursing 2009  – 2010 Samuel Merritt University BSN,  Nursing 2009  – 2010 Samuel Merritt University BSN,  Nursing 2009  – 2010 University of California, Davis Bachelor of Science (BS),  Physiology 1983  – 1986 University of California, Davis Bachelor of Science (BS),  Physiology 1983  – 1986 University of California, Davis Bachelor of Science (BS),  Physiology 1983  – 1986 ", "Experience Clinical Nurse Stanford University Medical Center February 2010  – Present (5 years 7 months) Emergency Dept Nurse Recruiter Stanford University Medical Center November 2006  –  February 2010  (3 years 4 months) Assistant Patient Care Manager Stanford University Medical Center August 2005  –  November 2006  (1 year 4 months) G2/H2/G2S Staff Nurse Stanford Hospital and Clinics September 1995  –  August 2005  (10 years) Clinical Nurse Stanford University Medical Center February 2010  – Present (5 years 7 months) Emergency Dept Clinical Nurse Stanford University Medical Center February 2010  – Present (5 years 7 months) Emergency Dept Nurse Recruiter Stanford University Medical Center November 2006  –  February 2010  (3 years 4 months) Nurse Recruiter Stanford University Medical Center November 2006  –  February 2010  (3 years 4 months) Assistant Patient Care Manager Stanford University Medical Center August 2005  –  November 2006  (1 year 4 months) G2/H2/G2S Assistant Patient Care Manager Stanford University Medical Center August 2005  –  November 2006  (1 year 4 months) G2/H2/G2S Staff Nurse Stanford Hospital and Clinics September 1995  –  August 2005  (10 years) Staff Nurse Stanford Hospital and Clinics September 1995  –  August 2005  (10 years) Skills Nursing Inpatient Healthcare Healthcare Management Critical Care Clinical Research HIPAA ACLS ICU Hospitals BLS Medical/Surgical Epic Systems Acute Care PALS Skills  Nursing Inpatient Healthcare Healthcare Management Critical Care Clinical Research HIPAA ACLS ICU Hospitals BLS Medical/Surgical Epic Systems Acute Care PALS Nursing Inpatient Healthcare Healthcare Management Critical Care Clinical Research HIPAA ACLS ICU Hospitals BLS Medical/Surgical Epic Systems Acute Care PALS Nursing Inpatient Healthcare Healthcare Management Critical Care Clinical Research HIPAA ACLS ICU Hospitals BLS Medical/Surgical Epic Systems Acute Care PALS Education Notre Dame de Namur University MBA 1995  – 1999 Notre Dame de Namur University MBA 1995  – 1999 Notre Dame de Namur University MBA 1995  – 1999 Notre Dame de Namur University MBA 1995  – 1999 ", "Experience Psychiatric Nurse Practitioner Adventist Clearlake Health Center August 2009  – Present (6 years 1 month) Provide medication management and supportive therapy for a diverse client population in a rural health clinic. Provide treatment for clients with mild to severe mental illnesses. Psychiatric Nurse Practitioner Consultant Self March 2011  –  August 2012  (1 year 6 months) Provided medication management and therapy for a diverse client population in a private office. Provided treatment for clients with a wide range of mental illnesses. Registered Nurse Stanford Hospital and Clinics September 2000  –  May 2009  (8 years 9 months) Provided triage, phone advice, direct patient care and after-hours urgent care at Vaden Health Center, Stanford’s student health center. Conducted a pediatric immunization clinic from 2000 until it’s closure in 2005. Nurse Practitioner O.M.I. Family Center September 2007  –  April 2008  (8 months) Provided medication management and supportive therapy for a diverse client population at a county mental health clinic. This fellowship was coordinated through U.C.S.F. Registered Nurse Consultant Self March 1997  –  June 1999  (2 years 4 months) Provided nursing services, care planning, assessments, inservice training, and patient advocacy for developmentally disabled adolescents. (Crestview Group Home, Belmont, California) \n Registered Nurse Stanford Student Health Services/Palo Alto Medical Foundation September 1988  –  September 1996  (8 years 1 month) Cowell Student Health Center, Stanford Provided urgent care in outpatient clinic. Provided telephone advice. Functioned as triage nurse. Worked independently in nurse-run clinic after hours.  Registered Nurse Stanford University Hospital R.N February 1982  –  June 1988  (6 years 5 months) Provided nursing care in acute medical/neurology (2/82—6/84) and a behavioral medicine (6/84—6/88). Research Nurse Stanford University June 1985  –  March 1988  (2 years 10 months) Managed research projects, coordinated outpatient studies, wrote study outlines, dispensed research medication and assessed drug effectiveness, followed research protocols, screened and recruited patients, conducted structured diagnostic interviews, \nobtained informed consent, scheduled testing and procedures, maintained patient records and performed and assisted with procedures for the purpose of investigating the biological causes of mental illnesses. Psychiatric Nurse Practitioner Adventist Clearlake Health Center August 2009  – Present (6 years 1 month) Provide medication management and supportive therapy for a diverse client population in a rural health clinic. Provide treatment for clients with mild to severe mental illnesses. Psychiatric Nurse Practitioner Adventist Clearlake Health Center August 2009  – Present (6 years 1 month) Provide medication management and supportive therapy for a diverse client population in a rural health clinic. Provide treatment for clients with mild to severe mental illnesses. Psychiatric Nurse Practitioner Consultant Self March 2011  –  August 2012  (1 year 6 months) Provided medication management and therapy for a diverse client population in a private office. Provided treatment for clients with a wide range of mental illnesses. Psychiatric Nurse Practitioner Consultant Self March 2011  –  August 2012  (1 year 6 months) Provided medication management and therapy for a diverse client population in a private office. Provided treatment for clients with a wide range of mental illnesses. Registered Nurse Stanford Hospital and Clinics September 2000  –  May 2009  (8 years 9 months) Provided triage, phone advice, direct patient care and after-hours urgent care at Vaden Health Center, Stanford’s student health center. Conducted a pediatric immunization clinic from 2000 until it’s closure in 2005. Registered Nurse Stanford Hospital and Clinics September 2000  –  May 2009  (8 years 9 months) Provided triage, phone advice, direct patient care and after-hours urgent care at Vaden Health Center, Stanford’s student health center. Conducted a pediatric immunization clinic from 2000 until it’s closure in 2005. Nurse Practitioner O.M.I. Family Center September 2007  –  April 2008  (8 months) Provided medication management and supportive therapy for a diverse client population at a county mental health clinic. This fellowship was coordinated through U.C.S.F. Nurse Practitioner O.M.I. Family Center September 2007  –  April 2008  (8 months) Provided medication management and supportive therapy for a diverse client population at a county mental health clinic. This fellowship was coordinated through U.C.S.F. Registered Nurse Consultant Self March 1997  –  June 1999  (2 years 4 months) Provided nursing services, care planning, assessments, inservice training, and patient advocacy for developmentally disabled adolescents. (Crestview Group Home, Belmont, California) \n Registered Nurse Consultant Self March 1997  –  June 1999  (2 years 4 months) Provided nursing services, care planning, assessments, inservice training, and patient advocacy for developmentally disabled adolescents. (Crestview Group Home, Belmont, California) \n Registered Nurse Stanford Student Health Services/Palo Alto Medical Foundation September 1988  –  September 1996  (8 years 1 month) Cowell Student Health Center, Stanford Provided urgent care in outpatient clinic. Provided telephone advice. Functioned as triage nurse. Worked independently in nurse-run clinic after hours.  Registered Nurse Stanford Student Health Services/Palo Alto Medical Foundation September 1988  –  September 1996  (8 years 1 month) Cowell Student Health Center, Stanford Provided urgent care in outpatient clinic. Provided telephone advice. Functioned as triage nurse. Worked independently in nurse-run clinic after hours.  Registered Nurse Stanford University Hospital R.N February 1982  –  June 1988  (6 years 5 months) Provided nursing care in acute medical/neurology (2/82—6/84) and a behavioral medicine (6/84—6/88). Registered Nurse Stanford University Hospital R.N February 1982  –  June 1988  (6 years 5 months) Provided nursing care in acute medical/neurology (2/82—6/84) and a behavioral medicine (6/84—6/88). Research Nurse Stanford University June 1985  –  March 1988  (2 years 10 months) Managed research projects, coordinated outpatient studies, wrote study outlines, dispensed research medication and assessed drug effectiveness, followed research protocols, screened and recruited patients, conducted structured diagnostic interviews, \nobtained informed consent, scheduled testing and procedures, maintained patient records and performed and assisted with procedures for the purpose of investigating the biological causes of mental illnesses. Research Nurse Stanford University June 1985  –  March 1988  (2 years 10 months) Managed research projects, coordinated outpatient studies, wrote study outlines, dispensed research medication and assessed drug effectiveness, followed research protocols, screened and recruited patients, conducted structured diagnostic interviews, \nobtained informed consent, scheduled testing and procedures, maintained patient records and performed and assisted with procedures for the purpose of investigating the biological causes of mental illnesses. Skills Psychiatric Nurse... Mental Health Nurse... ANCC Adult Psychiatric... Certified Clinical... California Furnishing... NPI DEA (former) ANCC Adult... Skills  Psychiatric Nurse... Mental Health Nurse... ANCC Adult Psychiatric... Certified Clinical... California Furnishing... NPI DEA (former) ANCC Adult... Psychiatric Nurse... Mental Health Nurse... ANCC Adult Psychiatric... Certified Clinical... California Furnishing... NPI DEA (former) ANCC Adult... Psychiatric Nurse... Mental Health Nurse... ANCC Adult Psychiatric... Certified Clinical... California Furnishing... NPI DEA (former) ANCC Adult... Education University of California, San Francisco Fellowship,  Psychiatric/Mental Health Nursing 2007  – 2008 Post Graduate Fellowship UCSF School of Nursing Master of Science,  Nursing 2005  – 2007 Adult Nurse Practitioner \nPsychiatric/Mental Health Nurse Practitioner Activities and Societies:  Transformational Scholarship ,  Stanford University Medical Center Samuel Merritt College Bachelor of Science,  Nursing 1999  – 2000 Marian College, Indianapolis, Indiana Associate Degree,  Nursing 1980  – 1981 University of California, San Francisco Fellowship,  Psychiatric/Mental Health Nursing 2007  – 2008 Post Graduate Fellowship University of California, San Francisco Fellowship,  Psychiatric/Mental Health Nursing 2007  – 2008 Post Graduate Fellowship University of California, San Francisco Fellowship,  Psychiatric/Mental Health Nursing 2007  – 2008 Post Graduate Fellowship UCSF School of Nursing Master of Science,  Nursing 2005  – 2007 Adult Nurse Practitioner \nPsychiatric/Mental Health Nurse Practitioner Activities and Societies:  Transformational Scholarship ,  Stanford University Medical Center UCSF School of Nursing Master of Science,  Nursing 2005  – 2007 Adult Nurse Practitioner \nPsychiatric/Mental Health Nurse Practitioner Activities and Societies:  Transformational Scholarship ,  Stanford University Medical Center UCSF School of Nursing Master of Science,  Nursing 2005  – 2007 Adult Nurse Practitioner \nPsychiatric/Mental Health Nurse Practitioner Activities and Societies:  Transformational Scholarship ,  Stanford University Medical Center Samuel Merritt College Bachelor of Science,  Nursing 1999  – 2000 Samuel Merritt College Bachelor of Science,  Nursing 1999  – 2000 Samuel Merritt College Bachelor of Science,  Nursing 1999  – 2000 Marian College, Indianapolis, Indiana Associate Degree,  Nursing 1980  – 1981 Marian College, Indianapolis, Indiana Associate Degree,  Nursing 1980  – 1981 Marian College, Indianapolis, Indiana Associate Degree,  Nursing 1980  – 1981 ", "Experience Research Nurse Stanford University January 2006  – Present (9 years 8 months) Research Nurse Stanford University 2006  –  2013  (7 years) Research Nurse Stanford University January 2006  – Present (9 years 8 months) Research Nurse Stanford University January 2006  – Present (9 years 8 months) Research Nurse Stanford University 2006  –  2013  (7 years) Research Nurse Stanford University 2006  –  2013  (7 years) ", "Experience registered nurse Stanford University Medical Center registered nurse Stanford University Medical Center registered nurse Stanford University Medical Center ", "Experience Clinical Research Nurse Stanford University Clinical Research Nurse Stanford University Clinical Research Nurse Stanford University ", "Experience staff nurse Stanford University Medical Center staff nurse Stanford University Medical Center staff nurse Stanford University Medical Center ", "Experience Registered Nurse Stanford University Medical Center December 2004  – Present (10 years 9 months) Registered Nurse Stanford University Medical Center December 2004  – Present (10 years 9 months) Registered Nurse Stanford University Medical Center December 2004  – Present (10 years 9 months) Skills Healthcare Hospitals Nursing BLS Emergency Nursing Trauma Nursing TNCC TNCC Instruction ACLS Skills  Healthcare Hospitals Nursing BLS Emergency Nursing Trauma Nursing TNCC TNCC Instruction ACLS Healthcare Hospitals Nursing BLS Emergency Nursing Trauma Nursing TNCC TNCC Instruction ACLS Healthcare Hospitals Nursing BLS Emergency Nursing Trauma Nursing TNCC TNCC Instruction ACLS Education San Jose State University Bachelor's degree,  Registered Nursing/Registered Nurse San Jose State University Bachelor's degree,  Registered Nursing/Registered Nurse San Jose State University Bachelor's degree,  Registered Nursing/Registered Nurse San Jose State University Bachelor's degree,  Registered Nursing/Registered Nurse ", "Experience Staff nurse Stanford University Medical Center April 2007  – Present (8 years 5 months) Staff nurse Rhode Island Hospital March 2006  –  March 2007  (1 year 1 month) staff nurse washington adventist hospital January 2003  –  January 2006  (3 years 1 month) Staff nurse Stanford University Medical Center April 2007  – Present (8 years 5 months) Staff nurse Stanford University Medical Center April 2007  – Present (8 years 5 months) Staff nurse Rhode Island Hospital March 2006  –  March 2007  (1 year 1 month) Staff nurse Rhode Island Hospital March 2006  –  March 2007  (1 year 1 month) staff nurse washington adventist hospital January 2003  –  January 2006  (3 years 1 month) staff nurse washington adventist hospital January 2003  –  January 2006  (3 years 1 month) ", "Experience Registered nurse Stanford University Hospital January 2006  – Present (9 years 8 months) staff nurse orthopedic/ trauma floor RN Case Manager Stanford University Hospital December 2003  –  January 2006  (2 years 2 months) Case manager- assisted with discharge planning Registered nurse Stanford University Hospital January 2006  – Present (9 years 8 months) staff nurse orthopedic/ trauma floor Registered nurse Stanford University Hospital January 2006  – Present (9 years 8 months) staff nurse orthopedic/ trauma floor RN Case Manager Stanford University Hospital December 2003  –  January 2006  (2 years 2 months) Case manager- assisted with discharge planning RN Case Manager Stanford University Hospital December 2003  –  January 2006  (2 years 2 months) Case manager- assisted with discharge planning Education University of San Francisco University of San Francisco University of San Francisco University of San Francisco ", "Experience Clinical Nurse Stanford University Medical Center September 2011  – Present (4 years) Neurosurgery Ensure patient safety and satisfaction for the neurosurgical population and their family members \nDetail-oriented nursing assessments, including complete neurological assessments frequently \nPatient population consisting primarily of spinal surgeries, such as cervical fusions, lumbar/thoracic surgeries, and tumor resection; cranial surgeries, such as transsphenoidal hypophysectomy, craniotomy for tumors, TIA/ischemic/hemmorrhagic stroke interventions, and VP shunt placement; lumbar drains; externalized ventricular drains (EVD); head trauma, including skull fractures, cerebral contusions, subdural and epidural hematomas; Deep Brain Stimulator placement for Parkinson's Disease treatment; spinal cord stimulator placement for chronic pain management; and intrathecal catheters for pain management (trials and implants). Transition RN, TCNU Valley Medical Center June 2011  –  September 2011  (4 months) Worked as a Registered Nurse through the CINHC funded South Bay Transition RN Program, a 16 week program formed to assist new graduate RNs to keep skills up to date and enhance employability of the new graduate participants. Completed 200 hours under the guidance of an experienced Registered Nurse. Cafe Supervisor, Temporary/Bookseller Borders Books May 2011  –  September 2011  (5 months) Use of therapeutic communications daily to provide exemplary customer service \nManage cafe and cafe workers on a daily basis Caregiver Private Households September 2009  –  September 2011  (2 years 1 month) Assist with daily ADLs \nMaintain safe and orderly environment for elderly man \nMaintain therapeutic relationship with client and supervisor \nSuggest changes within the home for client to make in order to improve quality of life \nAct as patient advocate with healthcare appointments Student Nurse Good Samaritan Hospital August 2010  –  November 2010  (4 months) 120 hours completed in senior preceptorship in the Medical-Surgical ICU \nBy end of preceptorship, was providing care for two critical care patients with little intervention by preceptorship \nCollaborate with interdisciplinary team to provide the safest and highest quality patient care Student Nurse Sierra-Nevada Memorial Hospital June 2010  –  July 2010  (2 months) Completed 144 hours through an intense Rural California Nursing Preceptorship through CSU chico on the Medical-Oncology floor \nSuccessfully provided safe and complete patient care to a 5 patient load by the end of required hours with little assistance from preceptor Bookseller/Customer Service Representative Borders August 2006  –  February 2009  (2 years 7 months) Acquired time management skills and interpersonal relationship skills through this position \nAssist clients to find desired merchandise \nMaintain a safe, organized, and clean working environment at all times \nCreate and maintain therapeutic relationships with regular store customers \nFollow strict company policy and protocol for merchandise placement and organization Clinical Nurse Stanford University Medical Center September 2011  – Present (4 years) Neurosurgery Ensure patient safety and satisfaction for the neurosurgical population and their family members \nDetail-oriented nursing assessments, including complete neurological assessments frequently \nPatient population consisting primarily of spinal surgeries, such as cervical fusions, lumbar/thoracic surgeries, and tumor resection; cranial surgeries, such as transsphenoidal hypophysectomy, craniotomy for tumors, TIA/ischemic/hemmorrhagic stroke interventions, and VP shunt placement; lumbar drains; externalized ventricular drains (EVD); head trauma, including skull fractures, cerebral contusions, subdural and epidural hematomas; Deep Brain Stimulator placement for Parkinson's Disease treatment; spinal cord stimulator placement for chronic pain management; and intrathecal catheters for pain management (trials and implants). Clinical Nurse Stanford University Medical Center September 2011  – Present (4 years) Neurosurgery Ensure patient safety and satisfaction for the neurosurgical population and their family members \nDetail-oriented nursing assessments, including complete neurological assessments frequently \nPatient population consisting primarily of spinal surgeries, such as cervical fusions, lumbar/thoracic surgeries, and tumor resection; cranial surgeries, such as transsphenoidal hypophysectomy, craniotomy for tumors, TIA/ischemic/hemmorrhagic stroke interventions, and VP shunt placement; lumbar drains; externalized ventricular drains (EVD); head trauma, including skull fractures, cerebral contusions, subdural and epidural hematomas; Deep Brain Stimulator placement for Parkinson's Disease treatment; spinal cord stimulator placement for chronic pain management; and intrathecal catheters for pain management (trials and implants). Transition RN, TCNU Valley Medical Center June 2011  –  September 2011  (4 months) Worked as a Registered Nurse through the CINHC funded South Bay Transition RN Program, a 16 week program formed to assist new graduate RNs to keep skills up to date and enhance employability of the new graduate participants. Completed 200 hours under the guidance of an experienced Registered Nurse. Transition RN, TCNU Valley Medical Center June 2011  –  September 2011  (4 months) Worked as a Registered Nurse through the CINHC funded South Bay Transition RN Program, a 16 week program formed to assist new graduate RNs to keep skills up to date and enhance employability of the new graduate participants. Completed 200 hours under the guidance of an experienced Registered Nurse. Cafe Supervisor, Temporary/Bookseller Borders Books May 2011  –  September 2011  (5 months) Use of therapeutic communications daily to provide exemplary customer service \nManage cafe and cafe workers on a daily basis Cafe Supervisor, Temporary/Bookseller Borders Books May 2011  –  September 2011  (5 months) Use of therapeutic communications daily to provide exemplary customer service \nManage cafe and cafe workers on a daily basis Caregiver Private Households September 2009  –  September 2011  (2 years 1 month) Assist with daily ADLs \nMaintain safe and orderly environment for elderly man \nMaintain therapeutic relationship with client and supervisor \nSuggest changes within the home for client to make in order to improve quality of life \nAct as patient advocate with healthcare appointments Caregiver Private Households September 2009  –  September 2011  (2 years 1 month) Assist with daily ADLs \nMaintain safe and orderly environment for elderly man \nMaintain therapeutic relationship with client and supervisor \nSuggest changes within the home for client to make in order to improve quality of life \nAct as patient advocate with healthcare appointments Student Nurse Good Samaritan Hospital August 2010  –  November 2010  (4 months) 120 hours completed in senior preceptorship in the Medical-Surgical ICU \nBy end of preceptorship, was providing care for two critical care patients with little intervention by preceptorship \nCollaborate with interdisciplinary team to provide the safest and highest quality patient care Student Nurse Good Samaritan Hospital August 2010  –  November 2010  (4 months) 120 hours completed in senior preceptorship in the Medical-Surgical ICU \nBy end of preceptorship, was providing care for two critical care patients with little intervention by preceptorship \nCollaborate with interdisciplinary team to provide the safest and highest quality patient care Student Nurse Sierra-Nevada Memorial Hospital June 2010  –  July 2010  (2 months) Completed 144 hours through an intense Rural California Nursing Preceptorship through CSU chico on the Medical-Oncology floor \nSuccessfully provided safe and complete patient care to a 5 patient load by the end of required hours with little assistance from preceptor Student Nurse Sierra-Nevada Memorial Hospital June 2010  –  July 2010  (2 months) Completed 144 hours through an intense Rural California Nursing Preceptorship through CSU chico on the Medical-Oncology floor \nSuccessfully provided safe and complete patient care to a 5 patient load by the end of required hours with little assistance from preceptor Bookseller/Customer Service Representative Borders August 2006  –  February 2009  (2 years 7 months) Acquired time management skills and interpersonal relationship skills through this position \nAssist clients to find desired merchandise \nMaintain a safe, organized, and clean working environment at all times \nCreate and maintain therapeutic relationships with regular store customers \nFollow strict company policy and protocol for merchandise placement and organization Bookseller/Customer Service Representative Borders August 2006  –  February 2009  (2 years 7 months) Acquired time management skills and interpersonal relationship skills through this position \nAssist clients to find desired merchandise \nMaintain a safe, organized, and clean working environment at all times \nCreate and maintain therapeutic relationships with regular store customers \nFollow strict company policy and protocol for merchandise placement and organization Skills Nursing Healthcare Critical Care Epic Systems Customer Service ICU Time Management BLS Cpr Certified Hospitals ACLS Patient Safety Patient Education Healthcare Management Medical Terminology Medical/Surgical Treatment Patient Advocacy Inpatient Acute Care Registered Nurses Critical Thinking HIPAA Nursing Care Health Promotion Medical-Surgical See 11+     See less Skills  Nursing Healthcare Critical Care Epic Systems Customer Service ICU Time Management BLS Cpr Certified Hospitals ACLS Patient Safety Patient Education Healthcare Management Medical Terminology Medical/Surgical Treatment Patient Advocacy Inpatient Acute Care Registered Nurses Critical Thinking HIPAA Nursing Care Health Promotion Medical-Surgical See 11+     See less Nursing Healthcare Critical Care Epic Systems Customer Service ICU Time Management BLS Cpr Certified Hospitals ACLS Patient Safety Patient Education Healthcare Management Medical Terminology Medical/Surgical Treatment Patient Advocacy Inpatient Acute Care Registered Nurses Critical Thinking HIPAA Nursing Care Health Promotion Medical-Surgical See 11+     See less Nursing Healthcare Critical Care Epic Systems Customer Service ICU Time Management BLS Cpr Certified Hospitals ACLS Patient Safety Patient Education Healthcare Management Medical Terminology Medical/Surgical Treatment Patient Advocacy Inpatient Acute Care Registered Nurses Critical Thinking HIPAA Nursing Care Health Promotion Medical-Surgical See 11+     See less Education San Jose State University BSN,  Nursing 2005  – 2010 Maintained a GPA of 3.93 and a GPA of 3.61 in Major courses Activities and Societies:  Founding team member of SJSU Public Health Nursing Club\nMember ,  Alpha Gamma Chapter of Sigma Theta Tau International Honors Nursing Society\nMember ,  California Nursing Student Association\nFundraiser Coordinator and Treasurer ,  SJSU Graduating Class of Fall 2010 Graduation Commitee San Jose State University BSN,  Nursing 2005  – 2010 Maintained a GPA of 3.93 and a GPA of 3.61 in Major courses Activities and Societies:  Founding team member of SJSU Public Health Nursing Club\nMember ,  Alpha Gamma Chapter of Sigma Theta Tau International Honors Nursing Society\nMember ,  California Nursing Student Association\nFundraiser Coordinator and Treasurer ,  SJSU Graduating Class of Fall 2010 Graduation Commitee San Jose State University BSN,  Nursing 2005  – 2010 Maintained a GPA of 3.93 and a GPA of 3.61 in Major courses Activities and Societies:  Founding team member of SJSU Public Health Nursing Club\nMember ,  Alpha Gamma Chapter of Sigma Theta Tau International Honors Nursing Society\nMember ,  California Nursing Student Association\nFundraiser Coordinator and Treasurer ,  SJSU Graduating Class of Fall 2010 Graduation Commitee San Jose State University BSN,  Nursing 2005  – 2010 Maintained a GPA of 3.93 and a GPA of 3.61 in Major courses Activities and Societies:  Founding team member of SJSU Public Health Nursing Club\nMember ,  Alpha Gamma Chapter of Sigma Theta Tau International Honors Nursing Society\nMember ,  California Nursing Student Association\nFundraiser Coordinator and Treasurer ,  SJSU Graduating Class of Fall 2010 Graduation Commitee Honors & Awards Additional Honors & Awards 2010 San Jose State University School of Nursing Outstanding Student Service Award \nSpring 2006: San Jose State University President's Scholar (maintained GPA of 4.0 for two contiguous semesters) \n2007-2010: San Jose State University Dean's Scholar (maintain GPA of 3.65 for 2 contiguous semesters) \n2010: Member Sigma Theta Tau International Honors Nursing Society Additional Honors & Awards 2010 San Jose State University School of Nursing Outstanding Student Service Award \nSpring 2006: San Jose State University President's Scholar (maintained GPA of 4.0 for two contiguous semesters) \n2007-2010: San Jose State University Dean's Scholar (maintain GPA of 3.65 for 2 contiguous semesters) \n2010: Member Sigma Theta Tau International Honors Nursing Society Additional Honors & Awards 2010 San Jose State University School of Nursing Outstanding Student Service Award \nSpring 2006: San Jose State University President's Scholar (maintained GPA of 4.0 for two contiguous semesters) \n2007-2010: San Jose State University Dean's Scholar (maintain GPA of 3.65 for 2 contiguous semesters) \n2010: Member Sigma Theta Tau International Honors Nursing Society Additional Honors & Awards 2010 San Jose State University School of Nursing Outstanding Student Service Award \nSpring 2006: San Jose State University President's Scholar (maintained GPA of 4.0 for two contiguous semesters) \n2007-2010: San Jose State University Dean's Scholar (maintain GPA of 3.65 for 2 contiguous semesters) \n2010: Member Sigma Theta Tau International Honors Nursing Society ", "Experience Professional Registered Nurse Stanford University Medical Center August 2009  – Present (6 years 1 month) Palo Alto, Ca Professional Registered Nurse Stanford University Medical Center August 2009  – Present (6 years 1 month) Palo Alto, Ca Professional Registered Nurse Stanford University Medical Center August 2009  – Present (6 years 1 month) Palo Alto, Ca ", "Experience Registered Nurse Stanford University Medical Center June 2006  – Present (9 years 3 months) RN US Air Force Reserve September 1997  – Present (18 years) Travis Air Force Base, CA Registered Nurse Stanford University Medical Center June 2006  – Present (9 years 3 months) Registered Nurse Stanford University Medical Center June 2006  – Present (9 years 3 months) RN US Air Force Reserve September 1997  – Present (18 years) Travis Air Force Base, CA RN US Air Force Reserve September 1997  – Present (18 years) Travis Air Force Base, CA Education University of California, San Francisco Master of Science,  Adult Nurse Pracitioner , Pyschiatric Mental Health Nurse Practitioner 2009  – 2011 San Jose State University 2002  – 2006 University of California, San Francisco Master of Science,  Adult Nurse Pracitioner , Pyschiatric Mental Health Nurse Practitioner 2009  – 2011 University of California, San Francisco Master of Science,  Adult Nurse Pracitioner , Pyschiatric Mental Health Nurse Practitioner 2009  – 2011 University of California, San Francisco Master of Science,  Adult Nurse Pracitioner , Pyschiatric Mental Health Nurse Practitioner 2009  – 2011 San Jose State University 2002  – 2006 San Jose State University 2002  – 2006 San Jose State University 2002  – 2006 ", "Experience registered nurse Stanford University Medical Center registered nurse Stanford University Medical Center registered nurse Stanford University Medical Center ", "Experience Registered Nurse Stanford University Medical Center July 2004  – Present (11 years 2 months) Menlo Park, California Nursing Assistant Good Samaritan Hospital October 2001  –  June 2004  (2 years 9 months) San Jose, California Emergency room technician/ aid Registered Nurse Stanford University Medical Center July 2004  – Present (11 years 2 months) Menlo Park, California Registered Nurse Stanford University Medical Center July 2004  – Present (11 years 2 months) Menlo Park, California Nursing Assistant Good Samaritan Hospital October 2001  –  June 2004  (2 years 9 months) San Jose, California Emergency room technician/ aid Nursing Assistant Good Samaritan Hospital October 2001  –  June 2004  (2 years 9 months) San Jose, California Emergency room technician/ aid Skills BLS ACLS Nursing Critical Care Hospitals Inpatient Healthcare ICU Epic Systems Patient Education Nursing Education IV EKG Vital Signs Registered Nurses Skills  BLS ACLS Nursing Critical Care Hospitals Inpatient Healthcare ICU Epic Systems Patient Education Nursing Education IV EKG Vital Signs Registered Nurses BLS ACLS Nursing Critical Care Hospitals Inpatient Healthcare ICU Epic Systems Patient Education Nursing Education IV EKG Vital Signs Registered Nurses BLS ACLS Nursing Critical Care Hospitals Inpatient Healthcare ICU Epic Systems Patient Education Nursing Education IV EKG Vital Signs Registered Nurses Education Cabrillo College Associate's degree,  Registered Nursing/Registered Nurse 2002  – 2004 University of Oregon Bachelor's degree,  Kinesiology and Exercise Science 1998  – 2001 Cabrillo College Associate's degree,  Registered Nursing/Registered Nurse 2002  – 2004 Cabrillo College Associate's degree,  Registered Nursing/Registered Nurse 2002  – 2004 Cabrillo College Associate's degree,  Registered Nursing/Registered Nurse 2002  – 2004 University of Oregon Bachelor's degree,  Kinesiology and Exercise Science 1998  – 2001 University of Oregon Bachelor's degree,  Kinesiology and Exercise Science 1998  – 2001 University of Oregon Bachelor's degree,  Kinesiology and Exercise Science 1998  – 2001 ", "Summary Clinical experience as a registered nurse \n \nExtensive knowledge of health care data and analytics \n \nIn-depth understanding of health insurance, managed care, health economics and quality improvement and cost controls \n \nExperience in health benefits consulting with Fortune 500 clients \n \nExcellent analytic, writing, project management and presentation skills \n \nCertified as a private patient advocate Specialties:Health care analytics \nHealth care quality \nHealth insurance \nEmployee health benefits \nPatient advocacy Summary Clinical experience as a registered nurse \n \nExtensive knowledge of health care data and analytics \n \nIn-depth understanding of health insurance, managed care, health economics and quality improvement and cost controls \n \nExperience in health benefits consulting with Fortune 500 clients \n \nExcellent analytic, writing, project management and presentation skills \n \nCertified as a private patient advocate Specialties:Health care analytics \nHealth care quality \nHealth insurance \nEmployee health benefits \nPatient advocacy Clinical experience as a registered nurse \n \nExtensive knowledge of health care data and analytics \n \nIn-depth understanding of health insurance, managed care, health economics and quality improvement and cost controls \n \nExperience in health benefits consulting with Fortune 500 clients \n \nExcellent analytic, writing, project management and presentation skills \n \nCertified as a private patient advocate Specialties:Health care analytics \nHealth care quality \nHealth insurance \nEmployee health benefits \nPatient advocacy Clinical experience as a registered nurse \n \nExtensive knowledge of health care data and analytics \n \nIn-depth understanding of health insurance, managed care, health economics and quality improvement and cost controls \n \nExperience in health benefits consulting with Fortune 500 clients \n \nExcellent analytic, writing, project management and presentation skills \n \nCertified as a private patient advocate Specialties:Health care analytics \nHealth care quality \nHealth insurance \nEmployee health benefits \nPatient advocacy Experience Vice President, Clinical Consulting Precept/Proview March 2013  – Present (2 years 6 months) Irvine, CA As part of the Health Management Services Department, I work with mid-size companies to help them understand the health issues of their employee population and provide services - such as corporate wellness and health improvement programs - aimed at keeping employees as healthy as possible. Independent Consultant Health Advocates of Orange County, Inc. June 2009  –  February 2013  (3 years 9 months) Irvine, CA Provide heatlh advocacy and navigation services directly to patients and families, including decision support, coordination of care, senior care and resolution of insurance issues. Director, Healthcare Performance UltraLink (now Secova) March 2000  –  June 2005  (5 years 4 months) Costa Mesa, CA Led the Healthcare Performance department of a benefits consulting firm. Oversaw development of an annual health plan rating index, annual CAHPS surveys of clients' employees for satisfaction with health plans, and an advocacy service for clients' employees. Consulted with Fortune 500 clients regarding value-based purchasing of health benefits. Manager University of Michigan Health System January 1996  –  January 1999  (3 years 1 month) Ann Arbor, MI Developed and managed an analytic unit within a managed care organization responsible for utilization and financial reporting. Oversaw HEDIS and regulatory reporting; collaborated on the development, testing and use of a data warehouse and reporting tools; led corporate initiative to purchase and implement physician profiling software. Co-Director University of Michigan Health System November 1993  –  June 1996  (2 years 8 months) Ann Arbor, MI Collaborated on the development and implementation of disease management and wellness programs for a managed care population Research Associate University of California January 1990  –  January 1992  (2 years 1 month) Analyzed Medicare billing data to support to research projects examining the relationship between the volume of surgical procedures and the quality of outcomes at the hospital level Project Manager/Research Associate University of Pennsylvania January 1988  –  January 1989  (1 year 1 month) Manager of Research American College of Physicians January 1986  –  January 1988  (2 years 1 month) Staff Associate Georgetown University January 1985  –  January 1986  (1 year 1 month) Oncology Research Nurse Stanford University Medical Center January 1981  –  January 1984  (3 years 1 month) Coordinated a clinical trial involving patients at three institutions, including administration of experimental agent, data collection and management and liaison with research sponsor Registerd Nurse Stanford University Medical Center 1978  –  1984  (6 years) Staff Nurse Creighton Memorial St. Joseph Hospital January 1976  –  January 1978  (2 years 1 month) Vice President, Clinical Consulting Precept/Proview March 2013  – Present (2 years 6 months) Irvine, CA As part of the Health Management Services Department, I work with mid-size companies to help them understand the health issues of their employee population and provide services - such as corporate wellness and health improvement programs - aimed at keeping employees as healthy as possible. Vice President, Clinical Consulting Precept/Proview March 2013  – Present (2 years 6 months) Irvine, CA As part of the Health Management Services Department, I work with mid-size companies to help them understand the health issues of their employee population and provide services - such as corporate wellness and health improvement programs - aimed at keeping employees as healthy as possible. Independent Consultant Health Advocates of Orange County, Inc. June 2009  –  February 2013  (3 years 9 months) Irvine, CA Provide heatlh advocacy and navigation services directly to patients and families, including decision support, coordination of care, senior care and resolution of insurance issues. Independent Consultant Health Advocates of Orange County, Inc. June 2009  –  February 2013  (3 years 9 months) Irvine, CA Provide heatlh advocacy and navigation services directly to patients and families, including decision support, coordination of care, senior care and resolution of insurance issues. Director, Healthcare Performance UltraLink (now Secova) March 2000  –  June 2005  (5 years 4 months) Costa Mesa, CA Led the Healthcare Performance department of a benefits consulting firm. Oversaw development of an annual health plan rating index, annual CAHPS surveys of clients' employees for satisfaction with health plans, and an advocacy service for clients' employees. Consulted with Fortune 500 clients regarding value-based purchasing of health benefits. Director, Healthcare Performance UltraLink (now Secova) March 2000  –  June 2005  (5 years 4 months) Costa Mesa, CA Led the Healthcare Performance department of a benefits consulting firm. Oversaw development of an annual health plan rating index, annual CAHPS surveys of clients' employees for satisfaction with health plans, and an advocacy service for clients' employees. Consulted with Fortune 500 clients regarding value-based purchasing of health benefits. Manager University of Michigan Health System January 1996  –  January 1999  (3 years 1 month) Ann Arbor, MI Developed and managed an analytic unit within a managed care organization responsible for utilization and financial reporting. Oversaw HEDIS and regulatory reporting; collaborated on the development, testing and use of a data warehouse and reporting tools; led corporate initiative to purchase and implement physician profiling software. Manager University of Michigan Health System January 1996  –  January 1999  (3 years 1 month) Ann Arbor, MI Developed and managed an analytic unit within a managed care organization responsible for utilization and financial reporting. Oversaw HEDIS and regulatory reporting; collaborated on the development, testing and use of a data warehouse and reporting tools; led corporate initiative to purchase and implement physician profiling software. Co-Director University of Michigan Health System November 1993  –  June 1996  (2 years 8 months) Ann Arbor, MI Collaborated on the development and implementation of disease management and wellness programs for a managed care population Co-Director University of Michigan Health System November 1993  –  June 1996  (2 years 8 months) Ann Arbor, MI Collaborated on the development and implementation of disease management and wellness programs for a managed care population Research Associate University of California January 1990  –  January 1992  (2 years 1 month) Analyzed Medicare billing data to support to research projects examining the relationship between the volume of surgical procedures and the quality of outcomes at the hospital level Research Associate University of California January 1990  –  January 1992  (2 years 1 month) Analyzed Medicare billing data to support to research projects examining the relationship between the volume of surgical procedures and the quality of outcomes at the hospital level Project Manager/Research Associate University of Pennsylvania January 1988  –  January 1989  (1 year 1 month) Project Manager/Research Associate University of Pennsylvania January 1988  –  January 1989  (1 year 1 month) Manager of Research American College of Physicians January 1986  –  January 1988  (2 years 1 month) Manager of Research American College of Physicians January 1986  –  January 1988  (2 years 1 month) Staff Associate Georgetown University January 1985  –  January 1986  (1 year 1 month) Staff Associate Georgetown University January 1985  –  January 1986  (1 year 1 month) Oncology Research Nurse Stanford University Medical Center January 1981  –  January 1984  (3 years 1 month) Coordinated a clinical trial involving patients at three institutions, including administration of experimental agent, data collection and management and liaison with research sponsor Oncology Research Nurse Stanford University Medical Center January 1981  –  January 1984  (3 years 1 month) Coordinated a clinical trial involving patients at three institutions, including administration of experimental agent, data collection and management and liaison with research sponsor Registerd Nurse Stanford University Medical Center 1978  –  1984  (6 years) Registerd Nurse Stanford University Medical Center 1978  –  1984  (6 years) Staff Nurse Creighton Memorial St. Joseph Hospital January 1976  –  January 1978  (2 years 1 month) Staff Nurse Creighton Memorial St. Joseph Hospital January 1976  –  January 1978  (2 years 1 month) Skills health insurance and... health data and... population health... health economics private patient advocacy Patient Advocacy Healthcare Population Health Health Insurance Health Economics Managed Care Medicare Quality Improvement Employee Benefits Healthcare Management Disease Management Hospitals Clinical Research Health Policy Medicine Pain Management Prevention Healthcare Consulting Patient Safety See 9+     See less Skills  health insurance and... health data and... population health... health economics private patient advocacy Patient Advocacy Healthcare Population Health Health Insurance Health Economics Managed Care Medicare Quality Improvement Employee Benefits Healthcare Management Disease Management Hospitals Clinical Research Health Policy Medicine Pain Management Prevention Healthcare Consulting Patient Safety See 9+     See less health insurance and... health data and... population health... health economics private patient advocacy Patient Advocacy Healthcare Population Health Health Insurance Health Economics Managed Care Medicare Quality Improvement Employee Benefits Healthcare Management Disease Management Hospitals Clinical Research Health Policy Medicine Pain Management Prevention Healthcare Consulting Patient Safety See 9+     See less health insurance and... health data and... population health... health economics private patient advocacy Patient Advocacy Healthcare Population Health Health Insurance Health Economics Managed Care Medicare Quality Improvement Employee Benefits Healthcare Management Disease Management Hospitals Clinical Research Health Policy Medicine Pain Management Prevention Healthcare Consulting Patient Safety See 9+     See less Education Georgetown University Masters in Public Policy,  Public Policy 1984  – 1986 Notre Dame de Namur University BS,  Business Administration 1982  – 1984 Nebraska Methodist College Diploma,  Nursing 1973  – 1976 Georgetown University Masters in Public Policy,  Public Policy 1984  – 1986 Georgetown University Masters in Public Policy,  Public Policy 1984  – 1986 Georgetown University Masters in Public Policy,  Public Policy 1984  – 1986 Notre Dame de Namur University BS,  Business Administration 1982  – 1984 Notre Dame de Namur University BS,  Business Administration 1982  – 1984 Notre Dame de Namur University BS,  Business Administration 1982  – 1984 Nebraska Methodist College Diploma,  Nursing 1973  – 1976 Nebraska Methodist College Diploma,  Nursing 1973  – 1976 Nebraska Methodist College Diploma,  Nursing 1973  – 1976 Honors & Awards Additional Honors & Awards Certified as a Health Care Advocate through Healthcare Liaison, Inc. Additional Honors & Awards Certified as a Health Care Advocate through Healthcare Liaison, Inc. Additional Honors & Awards Certified as a Health Care Advocate through Healthcare Liaison, Inc. Additional Honors & Awards Certified as a Health Care Advocate through Healthcare Liaison, Inc. ", "Experience Registered Nurse Stanford University Medical Center Registered Nurse Stanford University Medical Center Registered Nurse Stanford University Medical Center ", "Experience Oncology Research Nurse Stanford University School of Medicine June 2006  – Present (9 years 3 months) Oncology Research Nurse Stanford University School of Medicine June 2006  – Present (9 years 3 months) Oncology Research Nurse Stanford University School of Medicine June 2006  – Present (9 years 3 months) ", "Experience Registered Nurse Stanford University Medical Center 2010  – Present (5 years) Stanford, Ca Oncology RN Part time coach Santa Clara Aquamaids synchronized swimming club 1994  – Present (21 years) Registered Nurse Stanford University Medical Center 2010  – Present (5 years) Stanford, Ca Oncology RN Registered Nurse Stanford University Medical Center 2010  – Present (5 years) Stanford, Ca Oncology RN Part time coach Santa Clara Aquamaids synchronized swimming club 1994  – Present (21 years) Part time coach Santa Clara Aquamaids synchronized swimming club 1994  – Present (21 years) Skills Healthcare Skills  Healthcare Healthcare Healthcare Education San Jose State University BSN,  Nursing ,  minor: Psychology 2005  – 2010 San Jose State University BSN,  Nursing ,  minor: Psychology 2005  – 2010 San Jose State University BSN,  Nursing ,  minor: Psychology 2005  – 2010 San Jose State University BSN,  Nursing ,  minor: Psychology 2005  – 2010 ", "Experience Registered Nurse Stanford University Medical Center Registered Nurse Stanford University Medical Center Registered Nurse Stanford University Medical Center "]}