{"position": "Patent Attorney", "company": "Intel Corporation", "profiles": ["Experience Patent Attorney Intel Corporation September 2004  – Present (11 years) San Francisco Bay Area Strategic patent analysis and related counseling in support of patent strategy development, pre-litigation assertion responses, litigation, IP licensing, and patent purchase. Patent Attorney Intel Corporation September 2004  – Present (11 years) San Francisco Bay Area Strategic patent analysis and related counseling in support of patent strategy development, pre-litigation assertion responses, litigation, IP licensing, and patent purchase. Patent Attorney Intel Corporation September 2004  – Present (11 years) San Francisco Bay Area Strategic patent analysis and related counseling in support of patent strategy development, pre-litigation assertion responses, litigation, IP licensing, and patent purchase. Skills Registered Patent... Patentability Patents Intellectual Property Prosecution Patent Litigation Patent Prosecution Trade Secrets Litigation Licensing Trademarks Semiconductors Intellectual Property... Invention Due Diligence Strategy Copyright Law Software Patents Patent Portfolio... Patent Applications Technology Transfer Intellectual Asset... See 7+     See less Skills  Registered Patent... Patentability Patents Intellectual Property Prosecution Patent Litigation Patent Prosecution Trade Secrets Litigation Licensing Trademarks Semiconductors Intellectual Property... Invention Due Diligence Strategy Copyright Law Software Patents Patent Portfolio... Patent Applications Technology Transfer Intellectual Asset... See 7+     See less Registered Patent... Patentability Patents Intellectual Property Prosecution Patent Litigation Patent Prosecution Trade Secrets Litigation Licensing Trademarks Semiconductors Intellectual Property... Invention Due Diligence Strategy Copyright Law Software Patents Patent Portfolio... Patent Applications Technology Transfer Intellectual Asset... See 7+     See less Registered Patent... Patentability Patents Intellectual Property Prosecution Patent Litigation Patent Prosecution Trade Secrets Litigation Licensing Trademarks Semiconductors Intellectual Property... Invention Due Diligence Strategy Copyright Law Software Patents Patent Portfolio... Patent Applications Technology Transfer Intellectual Asset... See 7+     See less ", "Skills Patents Patent Prosecution Patent Litigation Intellectual Property Licensing Patentability Copyright Law Software Licensing Microprocessors Prosecution Trademarks Patent Applications Due Diligence Litigation Registered Patent... Intellectual Property... Client Counseling Invention Software Patents Patent Portfolio... Litigation Support Semiconductors Privacy Law See 8+     See less Skills  Patents Patent Prosecution Patent Litigation Intellectual Property Licensing Patentability Copyright Law Software Licensing Microprocessors Prosecution Trademarks Patent Applications Due Diligence Litigation Registered Patent... Intellectual Property... Client Counseling Invention Software Patents Patent Portfolio... Litigation Support Semiconductors Privacy Law See 8+     See less Patents Patent Prosecution Patent Litigation Intellectual Property Licensing Patentability Copyright Law Software Licensing Microprocessors Prosecution Trademarks Patent Applications Due Diligence Litigation Registered Patent... Intellectual Property... Client Counseling Invention Software Patents Patent Portfolio... Litigation Support Semiconductors Privacy Law See 8+     See less Patents Patent Prosecution Patent Litigation Intellectual Property Licensing Patentability Copyright Law Software Licensing Microprocessors Prosecution Trademarks Patent Applications Due Diligence Litigation Registered Patent... Intellectual Property... Client Counseling Invention Software Patents Patent Portfolio... Litigation Support Semiconductors Privacy Law See 8+     See less ", "Experience Patent Attorney Intel Corporation March 2012  – Present (3 years 6 months) Hillsboro Patent Attorney Hinchliffe IP Law LLC December 2010  –  March 2012  (1 year 4 months) Patent analysis, preparation and prosecution services Patent Attorney Omikron IP Law Group 2007  –  2010  (3 years) Patent Attorney Intel Corporation 2005  –  2006  (1 year) Patent Engineer Intel Corporation 2003  –  2005  (2 years) Licensing Intern Intel Corporation 2002  –  2003  (1 year) Technical Advisor Smith-Hill and Bedell 2000  –  2002  (2 years) Senior Scientist, Device Physics Technical Visions 1995  –  2000  (5 years) Patent Attorney Intel Corporation March 2012  – Present (3 years 6 months) Hillsboro Patent Attorney Intel Corporation March 2012  – Present (3 years 6 months) Hillsboro Patent Attorney Hinchliffe IP Law LLC December 2010  –  March 2012  (1 year 4 months) Patent analysis, preparation and prosecution services Patent Attorney Hinchliffe IP Law LLC December 2010  –  March 2012  (1 year 4 months) Patent analysis, preparation and prosecution services Patent Attorney Omikron IP Law Group 2007  –  2010  (3 years) Patent Attorney Omikron IP Law Group 2007  –  2010  (3 years) Patent Attorney Intel Corporation 2005  –  2006  (1 year) Patent Attorney Intel Corporation 2005  –  2006  (1 year) Patent Engineer Intel Corporation 2003  –  2005  (2 years) Patent Engineer Intel Corporation 2003  –  2005  (2 years) Licensing Intern Intel Corporation 2002  –  2003  (1 year) Licensing Intern Intel Corporation 2002  –  2003  (1 year) Technical Advisor Smith-Hill and Bedell 2000  –  2002  (2 years) Technical Advisor Smith-Hill and Bedell 2000  –  2002  (2 years) Senior Scientist, Device Physics Technical Visions 1995  –  2000  (5 years) Senior Scientist, Device Physics Technical Visions 1995  –  2000  (5 years) Education Lewis & Clark Law School 2001  – 2005 University of Oregon Ph.D.,  Chemical Physics 1988  – 1994 Lewis & Clark Law School 2001  – 2005 Lewis & Clark Law School 2001  – 2005 Lewis & Clark Law School 2001  – 2005 University of Oregon Ph.D.,  Chemical Physics 1988  – 1994 University of Oregon Ph.D.,  Chemical Physics 1988  – 1994 University of Oregon Ph.D.,  Chemical Physics 1988  – 1994 ", "Languages English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Patents Intellectual Property Patent Litigation Trademarks Licensing Prosecution Copyright Law Patent Prosecution Patentability Trade Secrets Electronics Software Patents Invention Software Development Trademark Infringement Software Licensing Patent Applications Patent Portfolio... Registered Patent... Client Counseling Cyberlaw Privacy Law Legal Opinions Technology Transfer Data Privacy Corporate Law Joint Ventures Due Diligence Legal Writing Anti-counterfeiting Commercial Litigation Patent Portfolio... See 17+     See less Skills  Patents Intellectual Property Patent Litigation Trademarks Licensing Prosecution Copyright Law Patent Prosecution Patentability Trade Secrets Electronics Software Patents Invention Software Development Trademark Infringement Software Licensing Patent Applications Patent Portfolio... Registered Patent... Client Counseling Cyberlaw Privacy Law Legal Opinions Technology Transfer Data Privacy Corporate Law Joint Ventures Due Diligence Legal Writing Anti-counterfeiting Commercial Litigation Patent Portfolio... See 17+     See less Patents Intellectual Property Patent Litigation Trademarks Licensing Prosecution Copyright Law Patent Prosecution Patentability Trade Secrets Electronics Software Patents Invention Software Development Trademark Infringement Software Licensing Patent Applications Patent Portfolio... Registered Patent... Client Counseling Cyberlaw Privacy Law Legal Opinions Technology Transfer Data Privacy Corporate Law Joint Ventures Due Diligence Legal Writing Anti-counterfeiting Commercial Litigation Patent Portfolio... See 17+     See less Patents Intellectual Property Patent Litigation Trademarks Licensing Prosecution Copyright Law Patent Prosecution Patentability Trade Secrets Electronics Software Patents Invention Software Development Trademark Infringement Software Licensing Patent Applications Patent Portfolio... Registered Patent... Client Counseling Cyberlaw Privacy Law Legal Opinions Technology Transfer Data Privacy Corporate Law Joint Ventures Due Diligence Legal Writing Anti-counterfeiting Commercial Litigation Patent Portfolio... See 17+     See less Honors & Awards ", "Summary Specialties:Patent Analysis, Patent Prep. and Prosecution Summary Specialties:Patent Analysis, Patent Prep. and Prosecution Specialties:Patent Analysis, Patent Prep. and Prosecution Specialties:Patent Analysis, Patent Prep. and Prosecution Experience Senior Associate Kacvinsky Daisak Bluni PLLC October 2011  – Present (3 years 11 months) Mayor City of Dundee, Oregon January 2011  –  December 2014  (4 years) Unpaid, elected position for a city of around 3,000 Patent Attorney Omikron IP Law Group March 2007  –  October 2011  (4 years 8 months) Patent Attorney Intel Corporation May 2003  –  March 2007  (3 years 11 months) Licensing Intern Intel Corporation May 2001  –  May 2003  (2 years 1 month) Quality Control Monitoring Inspector Battelle January 1994  –  August 1999  (5 years 8 months) Quality control inspector for workplace and environmental monitoring systems at a U.S. Department of Defense, chemical weapons waste incinerator. The incinerator was located near Tooele, Utah. Senior Associate Kacvinsky Daisak Bluni PLLC October 2011  – Present (3 years 11 months) Senior Associate Kacvinsky Daisak Bluni PLLC October 2011  – Present (3 years 11 months) Mayor City of Dundee, Oregon January 2011  –  December 2014  (4 years) Unpaid, elected position for a city of around 3,000 Mayor City of Dundee, Oregon January 2011  –  December 2014  (4 years) Unpaid, elected position for a city of around 3,000 Patent Attorney Omikron IP Law Group March 2007  –  October 2011  (4 years 8 months) Patent Attorney Omikron IP Law Group March 2007  –  October 2011  (4 years 8 months) Patent Attorney Intel Corporation May 2003  –  March 2007  (3 years 11 months) Patent Attorney Intel Corporation May 2003  –  March 2007  (3 years 11 months) Licensing Intern Intel Corporation May 2001  –  May 2003  (2 years 1 month) Licensing Intern Intel Corporation May 2001  –  May 2003  (2 years 1 month) Quality Control Monitoring Inspector Battelle January 1994  –  August 1999  (5 years 8 months) Quality control inspector for workplace and environmental monitoring systems at a U.S. Department of Defense, chemical weapons waste incinerator. The incinerator was located near Tooele, Utah. Quality Control Monitoring Inspector Battelle January 1994  –  August 1999  (5 years 8 months) Quality control inspector for workplace and environmental monitoring systems at a U.S. Department of Defense, chemical weapons waste incinerator. The incinerator was located near Tooele, Utah. Skills Patents Patent Prosecution Prosecution Skills  Patents Patent Prosecution Prosecution Patents Patent Prosecution Prosecution Patents Patent Prosecution Prosecution Education Willamette University College of Law J.D.,  Business 2000  – 2003 Willamette University MBA M.B.A.,  Business 1999  – 2003 University of Utah School of Medicine M.S.P.H.,  Industrial Hygiene 1994  – 1997 Weber State University B.S.,  Applied Physics 1987  – 1991 Activities and Societies:  Army R.O.T.C. Willamette University College of Law J.D.,  Business 2000  – 2003 Willamette University College of Law J.D.,  Business 2000  – 2003 Willamette University College of Law J.D.,  Business 2000  – 2003 Willamette University MBA M.B.A.,  Business 1999  – 2003 Willamette University MBA M.B.A.,  Business 1999  – 2003 Willamette University MBA M.B.A.,  Business 1999  – 2003 University of Utah School of Medicine M.S.P.H.,  Industrial Hygiene 1994  – 1997 University of Utah School of Medicine M.S.P.H.,  Industrial Hygiene 1994  – 1997 University of Utah School of Medicine M.S.P.H.,  Industrial Hygiene 1994  – 1997 Weber State University B.S.,  Applied Physics 1987  – 1991 Activities and Societies:  Army R.O.T.C. Weber State University B.S.,  Applied Physics 1987  – 1991 Activities and Societies:  Army R.O.T.C. Weber State University B.S.,  Applied Physics 1987  – 1991 Activities and Societies:  Army R.O.T.C. ", "Experience Patent Portfolio Strategist Intel Corporation September 2012  – Present (3 years) Develop patent portfolio strategies and portfolio management practices for four of Intel’s patent portfolios. Lead strategic projects and provide expertise on patent matters. Manage a group of six patent attorneys. Patent Portfolio Manager Intel Corporation June 2006  –  September 2012  (6 years 4 months) Portfolio manager for two patent portfolios. Developed and implemented processes related to SIGs/SDOs. Supported licensing, litigation, and acquisition efforts. Managed joint development agreements. Patent Attorney Intel Corporation May 2005  –  June 2006  (1 year 2 months) Prepared and prosecuted patent applications for chipset related technologies. Provided patent training and other legal advice to business units. Performed offensive and defensive patent analysis. Associate Blakely Sokoloff Taylor & Zafman 2001  –  2005  (4 years) Prepared and prosecuted patent applications for a broad range of technologies including processor architecture, memory technology, semiconductor processing, and enterprise software. Performed defensive analysis of patents during licensing negotiations. Summer Associate and Law Clerk Limbach & Limbach LLP May 2000  –  October 2000  (6 months) Responded to patent application and trademark application Office actions. Prepared legal memoranda to support litigation and licensing negotiations. Performed infringement analysis. Patent Portfolio Strategist Intel Corporation September 2012  – Present (3 years) Develop patent portfolio strategies and portfolio management practices for four of Intel’s patent portfolios. Lead strategic projects and provide expertise on patent matters. Manage a group of six patent attorneys. Patent Portfolio Strategist Intel Corporation September 2012  – Present (3 years) Develop patent portfolio strategies and portfolio management practices for four of Intel’s patent portfolios. Lead strategic projects and provide expertise on patent matters. Manage a group of six patent attorneys. Patent Portfolio Manager Intel Corporation June 2006  –  September 2012  (6 years 4 months) Portfolio manager for two patent portfolios. Developed and implemented processes related to SIGs/SDOs. Supported licensing, litigation, and acquisition efforts. Managed joint development agreements. Patent Portfolio Manager Intel Corporation June 2006  –  September 2012  (6 years 4 months) Portfolio manager for two patent portfolios. Developed and implemented processes related to SIGs/SDOs. Supported licensing, litigation, and acquisition efforts. Managed joint development agreements. Patent Attorney Intel Corporation May 2005  –  June 2006  (1 year 2 months) Prepared and prosecuted patent applications for chipset related technologies. Provided patent training and other legal advice to business units. Performed offensive and defensive patent analysis. Patent Attorney Intel Corporation May 2005  –  June 2006  (1 year 2 months) Prepared and prosecuted patent applications for chipset related technologies. Provided patent training and other legal advice to business units. Performed offensive and defensive patent analysis. Associate Blakely Sokoloff Taylor & Zafman 2001  –  2005  (4 years) Prepared and prosecuted patent applications for a broad range of technologies including processor architecture, memory technology, semiconductor processing, and enterprise software. Performed defensive analysis of patents during licensing negotiations. Associate Blakely Sokoloff Taylor & Zafman 2001  –  2005  (4 years) Prepared and prosecuted patent applications for a broad range of technologies including processor architecture, memory technology, semiconductor processing, and enterprise software. Performed defensive analysis of patents during licensing negotiations. Summer Associate and Law Clerk Limbach & Limbach LLP May 2000  –  October 2000  (6 months) Responded to patent application and trademark application Office actions. Prepared legal memoranda to support litigation and licensing negotiations. Performed infringement analysis. Summer Associate and Law Clerk Limbach & Limbach LLP May 2000  –  October 2000  (6 months) Responded to patent application and trademark application Office actions. Prepared legal memoranda to support litigation and licensing negotiations. Performed infringement analysis. Skills Patent Portfolio... Patent Analysis Patent Strategy Patent Drafting Patents Intellectual Property Prosecution Patent Prosecution Patentability Licensing Due Diligence Mergers & Acquisitions Copyright Law Intellectual Property... Legal Advice Patent Applications Invention Wireless Joint Ventures See 4+     See less Skills  Patent Portfolio... Patent Analysis Patent Strategy Patent Drafting Patents Intellectual Property Prosecution Patent Prosecution Patentability Licensing Due Diligence Mergers & Acquisitions Copyright Law Intellectual Property... Legal Advice Patent Applications Invention Wireless Joint Ventures See 4+     See less Patent Portfolio... Patent Analysis Patent Strategy Patent Drafting Patents Intellectual Property Prosecution Patent Prosecution Patentability Licensing Due Diligence Mergers & Acquisitions Copyright Law Intellectual Property... Legal Advice Patent Applications Invention Wireless Joint Ventures See 4+     See less Patent Portfolio... Patent Analysis Patent Strategy Patent Drafting Patents Intellectual Property Prosecution Patent Prosecution Patentability Licensing Due Diligence Mergers & Acquisitions Copyright Law Intellectual Property... Legal Advice Patent Applications Invention Wireless Joint Ventures See 4+     See less Education University of California, Hastings College of the Law Doctor of Law (J.D.) 1998  – 2001 San Jose State University BSEE 1994  – 1998 Activities and Societies:  Humanities Honors Program ,  Tau Beta Pi University of California, Hastings College of the Law Doctor of Law (J.D.) 1998  – 2001 University of California, Hastings College of the Law Doctor of Law (J.D.) 1998  – 2001 University of California, Hastings College of the Law Doctor of Law (J.D.) 1998  – 2001 San Jose State University BSEE 1994  – 1998 Activities and Societies:  Humanities Honors Program ,  Tau Beta Pi San Jose State University BSEE 1994  – 1998 Activities and Societies:  Humanities Honors Program ,  Tau Beta Pi San Jose State University BSEE 1994  – 1998 Activities and Societies:  Humanities Honors Program ,  Tau Beta Pi ", "Experience Senior Patent Attorney Intel Corporation August 2003  – Present (12 years 1 month) Chandler, AZ Managed Intel’s wireless communication portfolio (current, including 802.11n, 802.16, 3GPP LTE, OFDMA, closed-loop MIMO, beamforming, codebooks) and video portfolio (previous, including MPEG-4, H.264, VC-1). Cleared patents from defensive standpoint and prepared offensive pageants (evidence of use, detailed claim charts, etc.) for engagements with other companies. Evaluated wireless and video patents for both license and purchase. Found evidence of patent use and targeted existing applications in wireless, video, graphics, multiple-processor architecture, and mobile device technologies. Managed and critiqued work product from outside counsel. Evaluated wireless and video patents for both license and purchase. Associate Harrity & Snyder February 2001  –  August 2003  (2 years 7 months) Associate Birch, Stewart, Kolasch & Birch June 1999  –  February 2001  (1 year 9 months) Falls Church, VA Student Associate Finnegan, Henderson, Farabow, Garrett & Dunner, LLP June 1997  –  June 1999  (2 years 1 month) Washington D.C. Metro Area Patent Examiner U.S. Patent and Trademark Office June 1996  –  June 1997  (1 year 1 month) Alexandria, VA Examined Applications in Class 250 -- Radiant Energy (photodetectors). Electro-Optics Engineer Space Applications Corporation July 1994  –  June 1996  (2 years) Provided system engineering & technical assistance (SETA), and program management for the Defense Advanced Research Projects Agency's (DARPA's) Hyperspectral Mine Detection (HMD) program that involved imaging infrared spectroscopy and target detection algorithms. Forged relationships with fellow travelers; prepared technical reports/papers/foils; and attended meetings/events in the DARPA PM's stead. Research Scientist Analytical Services and Materials, Inc March 1993  –  July 1994  (1 year 5 months) Developed a hybrid analog/digital instrument for use in wind tunnel flow measurement under a NASA Phase II SBIR project. Brought the instrument from inception to completion through invention, prototyping, schematic design, construction, and testing stages. Senior Patent Attorney Intel Corporation August 2003  – Present (12 years 1 month) Chandler, AZ Managed Intel’s wireless communication portfolio (current, including 802.11n, 802.16, 3GPP LTE, OFDMA, closed-loop MIMO, beamforming, codebooks) and video portfolio (previous, including MPEG-4, H.264, VC-1). Cleared patents from defensive standpoint and prepared offensive pageants (evidence of use, detailed claim charts, etc.) for engagements with other companies. Evaluated wireless and video patents for both license and purchase. Found evidence of patent use and targeted existing applications in wireless, video, graphics, multiple-processor architecture, and mobile device technologies. Managed and critiqued work product from outside counsel. Evaluated wireless and video patents for both license and purchase. Senior Patent Attorney Intel Corporation August 2003  – Present (12 years 1 month) Chandler, AZ Managed Intel’s wireless communication portfolio (current, including 802.11n, 802.16, 3GPP LTE, OFDMA, closed-loop MIMO, beamforming, codebooks) and video portfolio (previous, including MPEG-4, H.264, VC-1). Cleared patents from defensive standpoint and prepared offensive pageants (evidence of use, detailed claim charts, etc.) for engagements with other companies. Evaluated wireless and video patents for both license and purchase. Found evidence of patent use and targeted existing applications in wireless, video, graphics, multiple-processor architecture, and mobile device technologies. Managed and critiqued work product from outside counsel. Evaluated wireless and video patents for both license and purchase. Associate Harrity & Snyder February 2001  –  August 2003  (2 years 7 months) Associate Harrity & Snyder February 2001  –  August 2003  (2 years 7 months) Associate Birch, Stewart, Kolasch & Birch June 1999  –  February 2001  (1 year 9 months) Falls Church, VA Associate Birch, Stewart, Kolasch & Birch June 1999  –  February 2001  (1 year 9 months) Falls Church, VA Student Associate Finnegan, Henderson, Farabow, Garrett & Dunner, LLP June 1997  –  June 1999  (2 years 1 month) Washington D.C. Metro Area Student Associate Finnegan, Henderson, Farabow, Garrett & Dunner, LLP June 1997  –  June 1999  (2 years 1 month) Washington D.C. Metro Area Patent Examiner U.S. Patent and Trademark Office June 1996  –  June 1997  (1 year 1 month) Alexandria, VA Examined Applications in Class 250 -- Radiant Energy (photodetectors). Patent Examiner U.S. Patent and Trademark Office June 1996  –  June 1997  (1 year 1 month) Alexandria, VA Examined Applications in Class 250 -- Radiant Energy (photodetectors). Electro-Optics Engineer Space Applications Corporation July 1994  –  June 1996  (2 years) Provided system engineering & technical assistance (SETA), and program management for the Defense Advanced Research Projects Agency's (DARPA's) Hyperspectral Mine Detection (HMD) program that involved imaging infrared spectroscopy and target detection algorithms. Forged relationships with fellow travelers; prepared technical reports/papers/foils; and attended meetings/events in the DARPA PM's stead. Electro-Optics Engineer Space Applications Corporation July 1994  –  June 1996  (2 years) Provided system engineering & technical assistance (SETA), and program management for the Defense Advanced Research Projects Agency's (DARPA's) Hyperspectral Mine Detection (HMD) program that involved imaging infrared spectroscopy and target detection algorithms. Forged relationships with fellow travelers; prepared technical reports/papers/foils; and attended meetings/events in the DARPA PM's stead. Research Scientist Analytical Services and Materials, Inc March 1993  –  July 1994  (1 year 5 months) Developed a hybrid analog/digital instrument for use in wind tunnel flow measurement under a NASA Phase II SBIR project. Brought the instrument from inception to completion through invention, prototyping, schematic design, construction, and testing stages. Research Scientist Analytical Services and Materials, Inc March 1993  –  July 1994  (1 year 5 months) Developed a hybrid analog/digital instrument for use in wind tunnel flow measurement under a NASA Phase II SBIR project. Brought the instrument from inception to completion through invention, prototyping, schematic design, construction, and testing stages. Education George Mason University School of Law J.D,  Intellectual Property 1996  – 2000 Completed Intellectual Property Law Track, including courses in patent licensing, patent infringement and damages, patent litigation, interference practice, trade secret law, and trademark law. Participated in Giles Sutherland Rich Moot Court Competition. Purdue University M.S,  Electrical Engineering; Automatic Control 1991  – 1992 University of Virginia B.S,  Electrical Engineering 1987  – 1991 George Mason University School of Law J.D,  Intellectual Property 1996  – 2000 Completed Intellectual Property Law Track, including courses in patent licensing, patent infringement and damages, patent litigation, interference practice, trade secret law, and trademark law. Participated in Giles Sutherland Rich Moot Court Competition. George Mason University School of Law J.D,  Intellectual Property 1996  – 2000 Completed Intellectual Property Law Track, including courses in patent licensing, patent infringement and damages, patent litigation, interference practice, trade secret law, and trademark law. Participated in Giles Sutherland Rich Moot Court Competition. George Mason University School of Law J.D,  Intellectual Property 1996  – 2000 Completed Intellectual Property Law Track, including courses in patent licensing, patent infringement and damages, patent litigation, interference practice, trade secret law, and trademark law. Participated in Giles Sutherland Rich Moot Court Competition. Purdue University M.S,  Electrical Engineering; Automatic Control 1991  – 1992 Purdue University M.S,  Electrical Engineering; Automatic Control 1991  – 1992 Purdue University M.S,  Electrical Engineering; Automatic Control 1991  – 1992 University of Virginia B.S,  Electrical Engineering 1987  – 1991 University of Virginia B.S,  Electrical Engineering 1987  – 1991 University of Virginia B.S,  Electrical Engineering 1987  – 1991 ", "Experience Patent Attorney Intel Corporation Patent Attorney Intel Corporation Patent Attorney Intel Corporation Education University of Oregon 1996  – 1999 University of Oregon 1996  – 1999 University of Oregon 1996  – 1999 University of Oregon 1996  – 1999 ", "Experience Senior Patent Attorney Intel Corporation October 2002  – Present (12 years 11 months) Student Associate/Associate Sterne, Kessler, Goldstein & Fox, PLLC 1995  –  2002  (7 years) Senior Engineer The Johns Hopkins University Applied Physics Laboratory 1978  –  1995  (17 years) Laurel, MD Senior Patent Attorney Intel Corporation October 2002  – Present (12 years 11 months) Senior Patent Attorney Intel Corporation October 2002  – Present (12 years 11 months) Student Associate/Associate Sterne, Kessler, Goldstein & Fox, PLLC 1995  –  2002  (7 years) Student Associate/Associate Sterne, Kessler, Goldstein & Fox, PLLC 1995  –  2002  (7 years) Senior Engineer The Johns Hopkins University Applied Physics Laboratory 1978  –  1995  (17 years) Laurel, MD Senior Engineer The Johns Hopkins University Applied Physics Laboratory 1978  –  1995  (17 years) Laurel, MD Education American University Washington College of Law Juris Doctor (J.D.),  Law 1993  – 1997 The Johns Hopkins University Master’s Degree,  Computer Science 1983  – 1984 The Johns Hopkins University Master’s Degree,  Electrical Engineering 1979  – 1983 Boston University Bachelor’s Degree,  Systems Engineering 1973  – 1978 American University Washington College of Law Juris Doctor (J.D.),  Law 1993  – 1997 American University Washington College of Law Juris Doctor (J.D.),  Law 1993  – 1997 American University Washington College of Law Juris Doctor (J.D.),  Law 1993  – 1997 The Johns Hopkins University Master’s Degree,  Computer Science 1983  – 1984 The Johns Hopkins University Master’s Degree,  Computer Science 1983  – 1984 The Johns Hopkins University Master’s Degree,  Computer Science 1983  – 1984 The Johns Hopkins University Master’s Degree,  Electrical Engineering 1979  – 1983 The Johns Hopkins University Master’s Degree,  Electrical Engineering 1979  – 1983 The Johns Hopkins University Master’s Degree,  Electrical Engineering 1979  – 1983 Boston University Bachelor’s Degree,  Systems Engineering 1973  – 1978 Boston University Bachelor’s Degree,  Systems Engineering 1973  – 1978 Boston University Bachelor’s Degree,  Systems Engineering 1973  – 1978 ", "Summary Degrees in Electrical Engineering and Biotechnology Specialties:Patents Summary Degrees in Electrical Engineering and Biotechnology Specialties:Patents Degrees in Electrical Engineering and Biotechnology Specialties:Patents Degrees in Electrical Engineering and Biotechnology Specialties:Patents Experience Patent Attorney/Owner Cool Patent, P.C. 2005  – Present (10 years) www.coolpatent.net; www.coolpatent.com Patent Attorney Intel Corporation 2002  –  2005  (3 years) Member - Wireless IP Committee \nCommittee Chair - Optical/MEMS/BioMEMs IP Committee \nWorked with David Simon, Ken Seddon, Mike Proksch, Tony Martinez, Lanny Parker, Cindy Faatz, Jeff Draeger, Rob Winkle, Brad Greenwald, Greg Kisor, Stu Whittington, Alan Pedersen-Giles, Julia Hodge, Ed Brake. Patent Attorney Gateway, Inc. 2000  –  2002  (2 years) Patent Attorney and Member of the Patent Review Board at Gateway North Sioux City, South Dakota. \nWorked with Mark Walker, Gayle Bekish, Nan Moser, Robin Clow, Bruce Young, Frank Liebenow, Mike Flannery. Patent Attorney Suiter & Associates, PC 1994  –  2000  (6 years) Patent attorney at Omaha, Nebraska law firm. \nWorked with Sean Suiter, Scott Rand, Chad Swantz, Kevin West, Jamie Breen. Patent Attorney Suiter and Associates 1994  –  2000  (6 years) Patent Attorney/Owner Cool Patent, P.C. 2005  – Present (10 years) www.coolpatent.net; www.coolpatent.com Patent Attorney/Owner Cool Patent, P.C. 2005  – Present (10 years) www.coolpatent.net; www.coolpatent.com Patent Attorney Intel Corporation 2002  –  2005  (3 years) Member - Wireless IP Committee \nCommittee Chair - Optical/MEMS/BioMEMs IP Committee \nWorked with David Simon, Ken Seddon, Mike Proksch, Tony Martinez, Lanny Parker, Cindy Faatz, Jeff Draeger, Rob Winkle, Brad Greenwald, Greg Kisor, Stu Whittington, Alan Pedersen-Giles, Julia Hodge, Ed Brake. Patent Attorney Intel Corporation 2002  –  2005  (3 years) Member - Wireless IP Committee \nCommittee Chair - Optical/MEMS/BioMEMs IP Committee \nWorked with David Simon, Ken Seddon, Mike Proksch, Tony Martinez, Lanny Parker, Cindy Faatz, Jeff Draeger, Rob Winkle, Brad Greenwald, Greg Kisor, Stu Whittington, Alan Pedersen-Giles, Julia Hodge, Ed Brake. Patent Attorney Gateway, Inc. 2000  –  2002  (2 years) Patent Attorney and Member of the Patent Review Board at Gateway North Sioux City, South Dakota. \nWorked with Mark Walker, Gayle Bekish, Nan Moser, Robin Clow, Bruce Young, Frank Liebenow, Mike Flannery. Patent Attorney Gateway, Inc. 2000  –  2002  (2 years) Patent Attorney and Member of the Patent Review Board at Gateway North Sioux City, South Dakota. \nWorked with Mark Walker, Gayle Bekish, Nan Moser, Robin Clow, Bruce Young, Frank Liebenow, Mike Flannery. Patent Attorney Suiter & Associates, PC 1994  –  2000  (6 years) Patent attorney at Omaha, Nebraska law firm. \nWorked with Sean Suiter, Scott Rand, Chad Swantz, Kevin West, Jamie Breen. Patent Attorney Suiter & Associates, PC 1994  –  2000  (6 years) Patent attorney at Omaha, Nebraska law firm. \nWorked with Sean Suiter, Scott Rand, Chad Swantz, Kevin West, Jamie Breen. Patent Attorney Suiter and Associates 1994  –  2000  (6 years) Patent Attorney Suiter and Associates 1994  –  2000  (6 years) Skills Biochemistry Biotechnology Corporate Law Due Diligence Electrical Engineering IP Intellectual Property Invention Legal Writing Licensing Litigation Mergers  Patent Litigation Patent Portfolio... Patent Prosecution Patentability Patents Privacy Law Prosecution Registered Patent... Software Licensing Software Patents Start-ups Strategy Technology Transfer Venture Capital Wireless See 12+     See less Skills  Biochemistry Biotechnology Corporate Law Due Diligence Electrical Engineering IP Intellectual Property Invention Legal Writing Licensing Litigation Mergers  Patent Litigation Patent Portfolio... Patent Prosecution Patentability Patents Privacy Law Prosecution Registered Patent... Software Licensing Software Patents Start-ups Strategy Technology Transfer Venture Capital Wireless See 12+     See less Biochemistry Biotechnology Corporate Law Due Diligence Electrical Engineering IP Intellectual Property Invention Legal Writing Licensing Litigation Mergers  Patent Litigation Patent Portfolio... Patent Prosecution Patentability Patents Privacy Law Prosecution Registered Patent... Software Licensing Software Patents Start-ups Strategy Technology Transfer Venture Capital Wireless See 12+     See less Biochemistry Biotechnology Corporate Law Due Diligence Electrical Engineering IP Intellectual Property Invention Legal Writing Licensing Litigation Mergers  Patent Litigation Patent Portfolio... Patent Prosecution Patentability Patents Privacy Law Prosecution Registered Patent... Software Licensing Software Patents Start-ups Strategy Technology Transfer Venture Capital Wireless See 12+     See less Education University of Nebraska at Omaha BS,  Biotechnology ,  Biochemistry 1994  – 2000 Major in Biotechnology, Minor in Biochemistry Creighton University School of Law JD,  Law 1991  – 1994 Iowa State University BSEE,  Electrical Engineering 1987  – 1991 University of Nebraska at Omaha BS,  Biotechnology ,  Biochemistry 1994  – 2000 Major in Biotechnology, Minor in Biochemistry University of Nebraska at Omaha BS,  Biotechnology ,  Biochemistry 1994  – 2000 Major in Biotechnology, Minor in Biochemistry University of Nebraska at Omaha BS,  Biotechnology ,  Biochemistry 1994  – 2000 Major in Biotechnology, Minor in Biochemistry Creighton University School of Law JD,  Law 1991  – 1994 Creighton University School of Law JD,  Law 1991  – 1994 Creighton University School of Law JD,  Law 1991  – 1994 Iowa State University BSEE,  Electrical Engineering 1987  – 1991 Iowa State University BSEE,  Electrical Engineering 1987  – 1991 Iowa State University BSEE,  Electrical Engineering 1987  – 1991 ", "Experience Sr. Patent Attorney Intel Corporation September 2012  – Present (3 years) Hillsboro, OR Patent portfolio manager Attorney Klarquist Sparkman, LLP November 2007  –  August 2012  (4 years 10 months) Patent prosecution and analysis, due diligence, opinion work and litigation support. Summer intern EPA 2006  –  2006  (less than a year) Staff Component Designer Intel 1998  –  2004  (6 years) Designed memory circuit compilers for workstation products. Design Engineer Motorola Semiconductor 1995  –  1998  (3 years) Designed memory circuits. Exported internal memory designs to overseas silicon foundries. Designed silicon-on-insulator test vehicle. Intern IBM 1993  –  1993  (less than a year) Sr. Patent Attorney Intel Corporation September 2012  – Present (3 years) Hillsboro, OR Patent portfolio manager Sr. Patent Attorney Intel Corporation September 2012  – Present (3 years) Hillsboro, OR Patent portfolio manager Attorney Klarquist Sparkman, LLP November 2007  –  August 2012  (4 years 10 months) Patent prosecution and analysis, due diligence, opinion work and litigation support. Attorney Klarquist Sparkman, LLP November 2007  –  August 2012  (4 years 10 months) Patent prosecution and analysis, due diligence, opinion work and litigation support. Summer intern EPA 2006  –  2006  (less than a year) Summer intern EPA 2006  –  2006  (less than a year) Staff Component Designer Intel 1998  –  2004  (6 years) Designed memory circuit compilers for workstation products. Staff Component Designer Intel 1998  –  2004  (6 years) Designed memory circuit compilers for workstation products. Design Engineer Motorola Semiconductor 1995  –  1998  (3 years) Designed memory circuits. Exported internal memory designs to overseas silicon foundries. Designed silicon-on-insulator test vehicle. Design Engineer Motorola Semiconductor 1995  –  1998  (3 years) Designed memory circuits. Exported internal memory designs to overseas silicon foundries. Designed silicon-on-insulator test vehicle. Intern IBM 1993  –  1993  (less than a year) Intern IBM 1993  –  1993  (less than a year) Skills Patent Prosecution Patents Intellectual Property Trademarks Patentability Due Diligence Prosecution Patent Litigation Semiconductors Legal Writing Skills  Patent Prosecution Patents Intellectual Property Trademarks Patentability Due Diligence Prosecution Patent Litigation Semiconductors Legal Writing Patent Prosecution Patents Intellectual Property Trademarks Patentability Due Diligence Prosecution Patent Litigation Semiconductors Legal Writing Patent Prosecution Patents Intellectual Property Trademarks Patentability Due Diligence Prosecution Patent Litigation Semiconductors Legal Writing Education University of Wisconsin Law School JD 2004  – 2007 University of Wisconsin-Madison MSEE,  Electrical Engineer 1993  – 1995 University of Wisconsin-Madison BSEE,  Electrical Engineering 1987  – 1992 Muskego High School 1983  – 1987 University of Wisconsin Law School JD 2004  – 2007 University of Wisconsin Law School JD 2004  – 2007 University of Wisconsin Law School JD 2004  – 2007 University of Wisconsin-Madison MSEE,  Electrical Engineer 1993  – 1995 University of Wisconsin-Madison MSEE,  Electrical Engineer 1993  – 1995 University of Wisconsin-Madison MSEE,  Electrical Engineer 1993  – 1995 University of Wisconsin-Madison BSEE,  Electrical Engineering 1987  – 1992 University of Wisconsin-Madison BSEE,  Electrical Engineering 1987  – 1992 University of Wisconsin-Madison BSEE,  Electrical Engineering 1987  – 1992 Muskego High School 1983  – 1987 Muskego High School 1983  – 1987 Muskego High School 1983  – 1987 ", "Summary Patent attorney with extensive experience with drafting and prosecuting patent applications for computer hardware, computer software and electrical inventions. Specialties:DMA controllers, interrupt controllers, memory controllers, I/O interfaces (e.g. PCI, USB, LPC, SCSI), networking protocols, platform virtualization (e.g. Intel LaGrande Technology(LT) & Virtualization Technology (VT), software tools (e.g. compilers, Java virtual machines), cryptography/digital rights management (e.g. LT, SHA, RSA, DES), audio/video encoding (e.g. MPEG, MP3), multi-processor hardware support, power management support (e.g. ACPI), operating systems and device drivers. Summary Patent attorney with extensive experience with drafting and prosecuting patent applications for computer hardware, computer software and electrical inventions. Specialties:DMA controllers, interrupt controllers, memory controllers, I/O interfaces (e.g. PCI, USB, LPC, SCSI), networking protocols, platform virtualization (e.g. Intel LaGrande Technology(LT) & Virtualization Technology (VT), software tools (e.g. compilers, Java virtual machines), cryptography/digital rights management (e.g. LT, SHA, RSA, DES), audio/video encoding (e.g. MPEG, MP3), multi-processor hardware support, power management support (e.g. ACPI), operating systems and device drivers. Patent attorney with extensive experience with drafting and prosecuting patent applications for computer hardware, computer software and electrical inventions. Specialties:DMA controllers, interrupt controllers, memory controllers, I/O interfaces (e.g. PCI, USB, LPC, SCSI), networking protocols, platform virtualization (e.g. Intel LaGrande Technology(LT) & Virtualization Technology (VT), software tools (e.g. compilers, Java virtual machines), cryptography/digital rights management (e.g. LT, SHA, RSA, DES), audio/video encoding (e.g. MPEG, MP3), multi-processor hardware support, power management support (e.g. ACPI), operating systems and device drivers. Patent attorney with extensive experience with drafting and prosecuting patent applications for computer hardware, computer software and electrical inventions. Specialties:DMA controllers, interrupt controllers, memory controllers, I/O interfaces (e.g. PCI, USB, LPC, SCSI), networking protocols, platform virtualization (e.g. Intel LaGrande Technology(LT) & Virtualization Technology (VT), software tools (e.g. compilers, Java virtual machines), cryptography/digital rights management (e.g. LT, SHA, RSA, DES), audio/video encoding (e.g. MPEG, MP3), multi-processor hardware support, power management support (e.g. ACPI), operating systems and device drivers. Experience Partner McAndrews, Held & Malloy, Ltd. April 2009  – Present (6 years 5 months) Of Counsel Barnes & Thornburg, LLP August 2006  –  April 2009  (2 years 9 months) Senior Patent Attorney Intel Corporation 2001  –  2006  (5 years) Associate Bose McKinney & Evans LLP 1999  –  2001  (2 years) Associate/Law Clerk Maginot, Addison & Moore 1996  –  1999  (3 years) Partner McAndrews, Held & Malloy, Ltd. April 2009  – Present (6 years 5 months) Partner McAndrews, Held & Malloy, Ltd. April 2009  – Present (6 years 5 months) Of Counsel Barnes & Thornburg, LLP August 2006  –  April 2009  (2 years 9 months) Of Counsel Barnes & Thornburg, LLP August 2006  –  April 2009  (2 years 9 months) Senior Patent Attorney Intel Corporation 2001  –  2006  (5 years) Senior Patent Attorney Intel Corporation 2001  –  2006  (5 years) Associate Bose McKinney & Evans LLP 1999  –  2001  (2 years) Associate Bose McKinney & Evans LLP 1999  –  2001  (2 years) Associate/Law Clerk Maginot, Addison & Moore 1996  –  1999  (3 years) Associate/Law Clerk Maginot, Addison & Moore 1996  –  1999  (3 years) Skills SCSI DES MP3 Memory Controllers USB SHA Patent Prosecution Patents Intellectual Property Patentability Trademarks Licensing Prosecution Copyright Law Trade Secrets Registered Patent... Patent Applications Due Diligence Patent Portfolio... Intellectual Property... Trademark Infringement Client Counseling Invention Technology Transfer Legal Opinions Litigation Support Litigation Software Patents Software Licensing Drafting patent... Legal Writing Intellectual Asset... Prior Art Search See 18+     See less Skills  SCSI DES MP3 Memory Controllers USB SHA Patent Prosecution Patents Intellectual Property Patentability Trademarks Licensing Prosecution Copyright Law Trade Secrets Registered Patent... Patent Applications Due Diligence Patent Portfolio... Intellectual Property... Trademark Infringement Client Counseling Invention Technology Transfer Legal Opinions Litigation Support Litigation Software Patents Software Licensing Drafting patent... Legal Writing Intellectual Asset... Prior Art Search See 18+     See less SCSI DES MP3 Memory Controllers USB SHA Patent Prosecution Patents Intellectual Property Patentability Trademarks Licensing Prosecution Copyright Law Trade Secrets Registered Patent... Patent Applications Due Diligence Patent Portfolio... Intellectual Property... Trademark Infringement Client Counseling Invention Technology Transfer Legal Opinions Litigation Support Litigation Software Patents Software Licensing Drafting patent... Legal Writing Intellectual Asset... Prior Art Search See 18+     See less SCSI DES MP3 Memory Controllers USB SHA Patent Prosecution Patents Intellectual Property Patentability Trademarks Licensing Prosecution Copyright Law Trade Secrets Registered Patent... Patent Applications Due Diligence Patent Portfolio... Intellectual Property... Trademark Infringement Client Counseling Invention Technology Transfer Legal Opinions Litigation Support Litigation Software Patents Software Licensing Drafting patent... Legal Writing Intellectual Asset... Prior Art Search See 18+     See less Education UNH School of Law JD & MIP,  Intellectual Property Law 1994  – 1997 Purdue University BSCEE,  Computer and Electrical Engineering 1990  – 1994 Activities and Societies:  Theta Xi Fraternity UNH School of Law JD & MIP,  Intellectual Property Law 1994  – 1997 UNH School of Law JD & MIP,  Intellectual Property Law 1994  – 1997 UNH School of Law JD & MIP,  Intellectual Property Law 1994  – 1997 Purdue University BSCEE,  Computer and Electrical Engineering 1990  – 1994 Activities and Societies:  Theta Xi Fraternity Purdue University BSCEE,  Computer and Electrical Engineering 1990  – 1994 Activities and Societies:  Theta Xi Fraternity Purdue University BSCEE,  Computer and Electrical Engineering 1990  – 1994 Activities and Societies:  Theta Xi Fraternity ", "Experience Sr. Patent Attorney Intel Corporation Sr. Patent Attorney Intel Corporation Sr. Patent Attorney Intel Corporation ", "Experience Senior Patent Attorney Intel Corporation January 2007  – Present (8 years 8 months) Patent Engineer Intel Corporation August 2002  –  December 2006  (4 years 5 months) Hardware and Software Engineer Intel Corporation August 1997  –  July 2002  (5 years) Senior Patent Attorney Intel Corporation January 2007  – Present (8 years 8 months) Senior Patent Attorney Intel Corporation January 2007  – Present (8 years 8 months) Patent Engineer Intel Corporation August 2002  –  December 2006  (4 years 5 months) Patent Engineer Intel Corporation August 2002  –  December 2006  (4 years 5 months) Hardware and Software Engineer Intel Corporation August 1997  –  July 2002  (5 years) Hardware and Software Engineer Intel Corporation August 1997  –  July 2002  (5 years) Skills Patent Prosecution Patent Portfolio... Registered Patent... Patent Portfolio... Intellectual Property Invention Trade Secrets Skills  Patent Prosecution Patent Portfolio... Registered Patent... Patent Portfolio... Intellectual Property Invention Trade Secrets Patent Prosecution Patent Portfolio... Registered Patent... Patent Portfolio... Intellectual Property Invention Trade Secrets Patent Prosecution Patent Portfolio... Registered Patent... Patent Portfolio... Intellectual Property Invention Trade Secrets Education Santa Clara University Juris Doctor (J.D.),  Intellectual Property Law 2002  – 2005 California State University-Sacramento Master of Business Administration (M.B.A.),  Business , Management, Marketing, and Related Support Services 1998  – 2000 California State University-Sacramento Bachelor of Science (B.S.),  Computer Science 1994  – 1997 Santa Clara University Juris Doctor (J.D.),  Intellectual Property Law 2002  – 2005 Santa Clara University Juris Doctor (J.D.),  Intellectual Property Law 2002  – 2005 Santa Clara University Juris Doctor (J.D.),  Intellectual Property Law 2002  – 2005 California State University-Sacramento Master of Business Administration (M.B.A.),  Business , Management, Marketing, and Related Support Services 1998  – 2000 California State University-Sacramento Master of Business Administration (M.B.A.),  Business , Management, Marketing, and Related Support Services 1998  – 2000 California State University-Sacramento Master of Business Administration (M.B.A.),  Business , Management, Marketing, and Related Support Services 1998  – 2000 California State University-Sacramento Bachelor of Science (B.S.),  Computer Science 1994  – 1997 California State University-Sacramento Bachelor of Science (B.S.),  Computer Science 1994  – 1997 California State University-Sacramento Bachelor of Science (B.S.),  Computer Science 1994  – 1997 ", "Experience IP Counsel GE Power & Water November 2014  – Present (10 months) Industrial Internet IP Counsel GE Power & Water November 2014  – Present (10 months) Industrial Internet IP Counsel GE Power & Water November 2014  – Present (10 months) Industrial Internet Skills Patent Prosecution Intellectual Property... Patent Portfolio... Patent Portfolio... Invention Intellectual Property Patent Strategy Semiconductor IP Semiconductors Flash Memory Integrated Circuit... Wireless Networking Security Social Media Collaboration Solutions VoIP Licensing Technology Transfer Patents IP Due Diligence Wireless Trade Secrets See 8+     See less Skills  Patent Prosecution Intellectual Property... Patent Portfolio... Patent Portfolio... Invention Intellectual Property Patent Strategy Semiconductor IP Semiconductors Flash Memory Integrated Circuit... Wireless Networking Security Social Media Collaboration Solutions VoIP Licensing Technology Transfer Patents IP Due Diligence Wireless Trade Secrets See 8+     See less Patent Prosecution Intellectual Property... Patent Portfolio... Patent Portfolio... Invention Intellectual Property Patent Strategy Semiconductor IP Semiconductors Flash Memory Integrated Circuit... Wireless Networking Security Social Media Collaboration Solutions VoIP Licensing Technology Transfer Patents IP Due Diligence Wireless Trade Secrets See 8+     See less Patent Prosecution Intellectual Property... Patent Portfolio... Patent Portfolio... Invention Intellectual Property Patent Strategy Semiconductor IP Semiconductors Flash Memory Integrated Circuit... Wireless Networking Security Social Media Collaboration Solutions VoIP Licensing Technology Transfer Patents IP Due Diligence Wireless Trade Secrets See 8+     See less Education Santa Clara University School of Law JD University of California, Davis BS,  Electrical Engineering Santa Clara University School of Law JD Santa Clara University School of Law JD Santa Clara University School of Law JD University of California, Davis BS,  Electrical Engineering University of California, Davis BS,  Electrical Engineering University of California, Davis BS,  Electrical Engineering ", "Experience Vice President, Corporate Counsel for Intellectual Property Amkor Technology March 2010  – Present (5 years 6 months) Director of Intellectual Property Dish Network April 2008  –  March 2010  (2 years) Director of Intellectual Property HVVi Semiconductors, Inc. April 2005  –  March 2008  (3 years) Senior Patent Attorney Intel Corporation August 2001  –  March 2005  (3 years 8 months) Patent Agent Motorola Semiconductor July 1997  –  April 2001  (3 years 10 months) Hardware/Software Engineer Motorola January 1993  –  May 1997  (4 years 5 months) Vice President, Corporate Counsel for Intellectual Property Amkor Technology March 2010  – Present (5 years 6 months) Vice President, Corporate Counsel for Intellectual Property Amkor Technology March 2010  – Present (5 years 6 months) Director of Intellectual Property Dish Network April 2008  –  March 2010  (2 years) Director of Intellectual Property Dish Network April 2008  –  March 2010  (2 years) Director of Intellectual Property HVVi Semiconductors, Inc. April 2005  –  March 2008  (3 years) Director of Intellectual Property HVVi Semiconductors, Inc. April 2005  –  March 2008  (3 years) Senior Patent Attorney Intel Corporation August 2001  –  March 2005  (3 years 8 months) Senior Patent Attorney Intel Corporation August 2001  –  March 2005  (3 years 8 months) Patent Agent Motorola Semiconductor July 1997  –  April 2001  (3 years 10 months) Patent Agent Motorola Semiconductor July 1997  –  April 2001  (3 years 10 months) Hardware/Software Engineer Motorola January 1993  –  May 1997  (4 years 5 months) Hardware/Software Engineer Motorola January 1993  –  May 1997  (4 years 5 months) Education Arizona State University College of Law J.D. 1998  – 2001 Iowa State University B.S. Electrical Engineering 1987  – 1992 Arizona State University College of Law J.D. 1998  – 2001 Arizona State University College of Law J.D. 1998  – 2001 Arizona State University College of Law J.D. 1998  – 2001 Iowa State University B.S. Electrical Engineering 1987  – 1992 Iowa State University B.S. Electrical Engineering 1987  – 1992 Iowa State University B.S. Electrical Engineering 1987  – 1992 ", "Experience Senior Patent Attorney Intel Corporation 2003  – Present (12 years) Patent Attorney Schwabe, Williamson & Wyatt 2002  –  2003  (1 year) Patent Attorney Columbia IP Law Group 2000  –  2002  (2 years) Patent Attorney Blakely, Sokoloff, Taylor & Zafman 1997  –  2000  (3 years) Co-op Student The Aerospace Corporation 1990  –  1993  (3 years) Senior Patent Attorney Intel Corporation 2003  – Present (12 years) Senior Patent Attorney Intel Corporation 2003  – Present (12 years) Patent Attorney Schwabe, Williamson & Wyatt 2002  –  2003  (1 year) Patent Attorney Schwabe, Williamson & Wyatt 2002  –  2003  (1 year) Patent Attorney Columbia IP Law Group 2000  –  2002  (2 years) Patent Attorney Columbia IP Law Group 2000  –  2002  (2 years) Patent Attorney Blakely, Sokoloff, Taylor & Zafman 1997  –  2000  (3 years) Patent Attorney Blakely, Sokoloff, Taylor & Zafman 1997  –  2000  (3 years) Co-op Student The Aerospace Corporation 1990  –  1993  (3 years) Co-op Student The Aerospace Corporation 1990  –  1993  (3 years) Skills Patents Technology Transfer Trade Secrets Prosecution Patentability Patent Prosecution Patent Litigation Intellectual Property Semiconductors Copyright Law Licensing Trademarks Software Licensing Joint Ventures Wireless Intellectual Property... Invention Patent Applications Contract Negotiation Due Diligence Software Patents Registered Patent... Patent Portfolio... See 8+     See less Skills  Patents Technology Transfer Trade Secrets Prosecution Patentability Patent Prosecution Patent Litigation Intellectual Property Semiconductors Copyright Law Licensing Trademarks Software Licensing Joint Ventures Wireless Intellectual Property... Invention Patent Applications Contract Negotiation Due Diligence Software Patents Registered Patent... Patent Portfolio... See 8+     See less Patents Technology Transfer Trade Secrets Prosecution Patentability Patent Prosecution Patent Litigation Intellectual Property Semiconductors Copyright Law Licensing Trademarks Software Licensing Joint Ventures Wireless Intellectual Property... Invention Patent Applications Contract Negotiation Due Diligence Software Patents Registered Patent... Patent Portfolio... See 8+     See less Patents Technology Transfer Trade Secrets Prosecution Patentability Patent Prosecution Patent Litigation Intellectual Property Semiconductors Copyright Law Licensing Trademarks Software Licensing Joint Ventures Wireless Intellectual Property... Invention Patent Applications Contract Negotiation Due Diligence Software Patents Registered Patent... Patent Portfolio... See 8+     See less Education Willamette University College of Law Doctor of Law (JD) 1994  – 1997 Purdue University BSEE,  Engineering 1989  – 1994 Willamette University College of Law Doctor of Law (JD) 1994  – 1997 Willamette University College of Law Doctor of Law (JD) 1994  – 1997 Willamette University College of Law Doctor of Law (JD) 1994  – 1997 Purdue University BSEE,  Engineering 1989  – 1994 Purdue University BSEE,  Engineering 1989  – 1994 Purdue University BSEE,  Engineering 1989  – 1994 ", "Summary Global intellectual property (IP) portfolio and budget management; development of corporate IP culture, strategies, policies, guidelines, procedures, and budget; risk assessment and counseling on IP-related commercial transactions; pre-litigation resolution of IP disputes; patent preparation, prosecution, and counseling (patentability, freedom-to-operate, infringement, and validity); global brand protection and enforcement; trademark clearance, prosecution, counseling, and licensing; patent litigation and trademark opposition support; negotiation and preparation of coexistence, consent-to-use and/or register agreements; investigation and enforcement of IP rights related to social media, domain name, and Internet activities (new gTLDs); copyright prosecution and counseling; trade secret counseling and invention disclosure harvesting; technology transactions; corporate training and education related to IP; and training and mentoring attorneys, law clerks, and interns with respect to IP practice. \n \nSpecialties: yard work (i.e., product testing of golf equipment); fantasy football league and team management; and investment in new consumer electronics. Summary Global intellectual property (IP) portfolio and budget management; development of corporate IP culture, strategies, policies, guidelines, procedures, and budget; risk assessment and counseling on IP-related commercial transactions; pre-litigation resolution of IP disputes; patent preparation, prosecution, and counseling (patentability, freedom-to-operate, infringement, and validity); global brand protection and enforcement; trademark clearance, prosecution, counseling, and licensing; patent litigation and trademark opposition support; negotiation and preparation of coexistence, consent-to-use and/or register agreements; investigation and enforcement of IP rights related to social media, domain name, and Internet activities (new gTLDs); copyright prosecution and counseling; trade secret counseling and invention disclosure harvesting; technology transactions; corporate training and education related to IP; and training and mentoring attorneys, law clerks, and interns with respect to IP practice. \n \nSpecialties: yard work (i.e., product testing of golf equipment); fantasy football league and team management; and investment in new consumer electronics. Global intellectual property (IP) portfolio and budget management; development of corporate IP culture, strategies, policies, guidelines, procedures, and budget; risk assessment and counseling on IP-related commercial transactions; pre-litigation resolution of IP disputes; patent preparation, prosecution, and counseling (patentability, freedom-to-operate, infringement, and validity); global brand protection and enforcement; trademark clearance, prosecution, counseling, and licensing; patent litigation and trademark opposition support; negotiation and preparation of coexistence, consent-to-use and/or register agreements; investigation and enforcement of IP rights related to social media, domain name, and Internet activities (new gTLDs); copyright prosecution and counseling; trade secret counseling and invention disclosure harvesting; technology transactions; corporate training and education related to IP; and training and mentoring attorneys, law clerks, and interns with respect to IP practice. \n \nSpecialties: yard work (i.e., product testing of golf equipment); fantasy football league and team management; and investment in new consumer electronics. Global intellectual property (IP) portfolio and budget management; development of corporate IP culture, strategies, policies, guidelines, procedures, and budget; risk assessment and counseling on IP-related commercial transactions; pre-litigation resolution of IP disputes; patent preparation, prosecution, and counseling (patentability, freedom-to-operate, infringement, and validity); global brand protection and enforcement; trademark clearance, prosecution, counseling, and licensing; patent litigation and trademark opposition support; negotiation and preparation of coexistence, consent-to-use and/or register agreements; investigation and enforcement of IP rights related to social media, domain name, and Internet activities (new gTLDs); copyright prosecution and counseling; trade secret counseling and invention disclosure harvesting; technology transactions; corporate training and education related to IP; and training and mentoring attorneys, law clerks, and interns with respect to IP practice. \n \nSpecialties: yard work (i.e., product testing of golf equipment); fantasy football league and team management; and investment in new consumer electronics. Experience Legal PXG (PARSONS XTREME GOLF) September 2014  – Present (1 year) Scottsdale, AZ Director YAM Capital November 2013  – Present (1 year 10 months) Scottsdale, AZ Director & Associate General Counsel, Intellectual Property PING (Karsten Mfg. Corp.) August 2006  –  November 2013  (7 years 4 months) Phoenix, AZ Senior Patent Attorney Intel Corporation August 2004  –  July 2006  (2 years) Chandler, AZ Member (Registered Patent Attorney) Grossman & Flight (now Hanley, Flight & Zimmerman) March 2003  –  July 2004  (1 year 5 months) Chicago, IL Associate (Registered Patent Attorney) Marshall, Gerstein, & Borun August 1999  –  March 2003  (3 years 8 months) Chicago, IL Tutor Arizona State University July 1997  –  May 1999  (1 year 11 months) Tempe, AZ Tutor University of Arizona February 1995  –  May 1996  (1 year 4 months) Tucson, AZ Legal PXG (PARSONS XTREME GOLF) September 2014  – Present (1 year) Scottsdale, AZ Legal PXG (PARSONS XTREME GOLF) September 2014  – Present (1 year) Scottsdale, AZ Director YAM Capital November 2013  – Present (1 year 10 months) Scottsdale, AZ Director YAM Capital November 2013  – Present (1 year 10 months) Scottsdale, AZ Director & Associate General Counsel, Intellectual Property PING (Karsten Mfg. Corp.) August 2006  –  November 2013  (7 years 4 months) Phoenix, AZ Director & Associate General Counsel, Intellectual Property PING (Karsten Mfg. Corp.) August 2006  –  November 2013  (7 years 4 months) Phoenix, AZ Senior Patent Attorney Intel Corporation August 2004  –  July 2006  (2 years) Chandler, AZ Senior Patent Attorney Intel Corporation August 2004  –  July 2006  (2 years) Chandler, AZ Member (Registered Patent Attorney) Grossman & Flight (now Hanley, Flight & Zimmerman) March 2003  –  July 2004  (1 year 5 months) Chicago, IL Member (Registered Patent Attorney) Grossman & Flight (now Hanley, Flight & Zimmerman) March 2003  –  July 2004  (1 year 5 months) Chicago, IL Associate (Registered Patent Attorney) Marshall, Gerstein, & Borun August 1999  –  March 2003  (3 years 8 months) Chicago, IL Associate (Registered Patent Attorney) Marshall, Gerstein, & Borun August 1999  –  March 2003  (3 years 8 months) Chicago, IL Tutor Arizona State University July 1997  –  May 1999  (1 year 11 months) Tempe, AZ Tutor Arizona State University July 1997  –  May 1999  (1 year 11 months) Tempe, AZ Tutor University of Arizona February 1995  –  May 1996  (1 year 4 months) Tucson, AZ Tutor University of Arizona February 1995  –  May 1996  (1 year 4 months) Tucson, AZ Languages Cantonese Native or bilingual proficiency Spanish Elementary proficiency Cantonese Native or bilingual proficiency Spanish Elementary proficiency Cantonese Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Trademarks Patents Intellectual Property Licensing Patent Litigation Patentability Trade Secrets Copyright Law Patent Prosecution Invention Trademark Infringement Registered Patent... Commercial Litigation Patent Applications Privacy Law Enforcement Litigation Patent preparation Intellectual Property... Due Diligence Patent Analysis Patent Drafting Patent Strategy Contract Negotiation Patent Portfolio... Strategic Planning Legal Writing Trademark Prosecution Domain Registration Patent Portfolio... Licensing Agreements Creative Problem Solving Timely Decision Making Mentoring Electrical Engineering Domain Names Fantasy Football Golf Start-ups Software Licensing Non-disclosure... Trade Dress Competition Analytics See 29+     See less Skills  Trademarks Patents Intellectual Property Licensing Patent Litigation Patentability Trade Secrets Copyright Law Patent Prosecution Invention Trademark Infringement Registered Patent... Commercial Litigation Patent Applications Privacy Law Enforcement Litigation Patent preparation Intellectual Property... Due Diligence Patent Analysis Patent Drafting Patent Strategy Contract Negotiation Patent Portfolio... Strategic Planning Legal Writing Trademark Prosecution Domain Registration Patent Portfolio... Licensing Agreements Creative Problem Solving Timely Decision Making Mentoring Electrical Engineering Domain Names Fantasy Football Golf Start-ups Software Licensing Non-disclosure... Trade Dress Competition Analytics See 29+     See less Trademarks Patents Intellectual Property Licensing Patent Litigation Patentability Trade Secrets Copyright Law Patent Prosecution Invention Trademark Infringement Registered Patent... Commercial Litigation Patent Applications Privacy Law Enforcement Litigation Patent preparation Intellectual Property... Due Diligence Patent Analysis Patent Drafting Patent Strategy Contract Negotiation Patent Portfolio... Strategic Planning Legal Writing Trademark Prosecution Domain Registration Patent Portfolio... Licensing Agreements Creative Problem Solving Timely Decision Making Mentoring Electrical Engineering Domain Names Fantasy Football Golf Start-ups Software Licensing Non-disclosure... Trade Dress Competition Analytics See 29+     See less Trademarks Patents Intellectual Property Licensing Patent Litigation Patentability Trade Secrets Copyright Law Patent Prosecution Invention Trademark Infringement Registered Patent... Commercial Litigation Patent Applications Privacy Law Enforcement Litigation Patent preparation Intellectual Property... Due Diligence Patent Analysis Patent Drafting Patent Strategy Contract Negotiation Patent Portfolio... Strategic Planning Legal Writing Trademark Prosecution Domain Registration Patent Portfolio... Licensing Agreements Creative Problem Solving Timely Decision Making Mentoring Electrical Engineering Domain Names Fantasy Football Golf Start-ups Software Licensing Non-disclosure... Trade Dress Competition Analytics See 29+     See less Education Arizona State University College of Law J.D. 1996  – 1999 University of Arizona B.S. 1992  – 1996 Arizona State University College of Law J.D. 1996  – 1999 Arizona State University College of Law J.D. 1996  – 1999 Arizona State University College of Law J.D. 1996  – 1999 University of Arizona B.S. 1992  – 1996 University of Arizona B.S. 1992  – 1996 University of Arizona B.S. 1992  – 1996 Honors & Awards ", "Summary Experience with criminal, civil pro bono matters. Intellectual property (IP) has been my focus for 20+ years. I am currently a member of Intel’s Black Leadership Council. \n \nParticular IP interests include worldwide patent portfolio development and asset management, patent acquisition, CNTS, US government contracting, EU funded research, Special Interest Groups (SIGs), patent analysis, and patent prosecution. I’ve also deep experience with Linux environments, Windows, and Apple operating systems. I've built many servers for fun. Summary Experience with criminal, civil pro bono matters. Intellectual property (IP) has been my focus for 20+ years. I am currently a member of Intel’s Black Leadership Council. \n \nParticular IP interests include worldwide patent portfolio development and asset management, patent acquisition, CNTS, US government contracting, EU funded research, Special Interest Groups (SIGs), patent analysis, and patent prosecution. I’ve also deep experience with Linux environments, Windows, and Apple operating systems. I've built many servers for fun. Experience with criminal, civil pro bono matters. Intellectual property (IP) has been my focus for 20+ years. I am currently a member of Intel’s Black Leadership Council. \n \nParticular IP interests include worldwide patent portfolio development and asset management, patent acquisition, CNTS, US government contracting, EU funded research, Special Interest Groups (SIGs), patent analysis, and patent prosecution. I’ve also deep experience with Linux environments, Windows, and Apple operating systems. I've built many servers for fun. Experience with criminal, civil pro bono matters. Intellectual property (IP) has been my focus for 20+ years. I am currently a member of Intel’s Black Leadership Council. \n \nParticular IP interests include worldwide patent portfolio development and asset management, patent acquisition, CNTS, US government contracting, EU funded research, Special Interest Groups (SIGs), patent analysis, and patent prosecution. I’ve also deep experience with Linux environments, Windows, and Apple operating systems. I've built many servers for fun. Experience Senior Attorney Intel Corporation August 2000  – Present (15 years 1 month) Patent Attorney Blakely Sokoloff Taylor & Zafman 1999  –  2000  (1 year) Senior IP Attorney / Patent Business Strategist / IP Acquisitions Patent Attorney Klarquist Sparkman 1997  –  1999  (2 years) Patent Attorney Bromberg & Sunstein 1995  –  1997  (2 years) Attorney Law 1993  –  1994  (1 year) General practice. Senior Attorney Intel Corporation August 2000  – Present (15 years 1 month) Senior Attorney Intel Corporation August 2000  – Present (15 years 1 month) Patent Attorney Blakely Sokoloff Taylor & Zafman 1999  –  2000  (1 year) Senior IP Attorney / Patent Business Strategist / IP Acquisitions Patent Attorney Blakely Sokoloff Taylor & Zafman 1999  –  2000  (1 year) Senior IP Attorney / Patent Business Strategist / IP Acquisitions Patent Attorney Klarquist Sparkman 1997  –  1999  (2 years) Patent Attorney Klarquist Sparkman 1997  –  1999  (2 years) Patent Attorney Bromberg & Sunstein 1995  –  1997  (2 years) Patent Attorney Bromberg & Sunstein 1995  –  1997  (2 years) Attorney Law 1993  –  1994  (1 year) General practice. Attorney Law 1993  –  1994  (1 year) General practice. Skills Patents Patent Prosecution Prosecution Patent Litigation Trade Secrets Intellectual Property Trademarks Copyright Law Licensing Litigation Corporate Law Joint Ventures Patentability Due Diligence Software Licensing Legal Research Corporate Governance Patent Applications Privacy Law Trademark Infringement Legal Writing Strategy Mergers & Acquisitions Technology Transfer IP Venture Capital Semiconductors Invention Software Patents Data Privacy Client Counseling Legal Compliance Cyberlaw Patent Portfolio... Registered Patent... Intellectual Asset... Litigation Support Open Source Licensing Cloud Computing Civil Litigation Contract Negotiation Patent Portfolio... Intellectual Property... Drafting patent... See 29+     See less Skills  Patents Patent Prosecution Prosecution Patent Litigation Trade Secrets Intellectual Property Trademarks Copyright Law Licensing Litigation Corporate Law Joint Ventures Patentability Due Diligence Software Licensing Legal Research Corporate Governance Patent Applications Privacy Law Trademark Infringement Legal Writing Strategy Mergers & Acquisitions Technology Transfer IP Venture Capital Semiconductors Invention Software Patents Data Privacy Client Counseling Legal Compliance Cyberlaw Patent Portfolio... Registered Patent... Intellectual Asset... Litigation Support Open Source Licensing Cloud Computing Civil Litigation Contract Negotiation Patent Portfolio... Intellectual Property... Drafting patent... See 29+     See less Patents Patent Prosecution Prosecution Patent Litigation Trade Secrets Intellectual Property Trademarks Copyright Law Licensing Litigation Corporate Law Joint Ventures Patentability Due Diligence Software Licensing Legal Research Corporate Governance Patent Applications Privacy Law Trademark Infringement Legal Writing Strategy Mergers & Acquisitions Technology Transfer IP Venture Capital Semiconductors Invention Software Patents Data Privacy Client Counseling Legal Compliance Cyberlaw Patent Portfolio... Registered Patent... Intellectual Asset... Litigation Support Open Source Licensing Cloud Computing Civil Litigation Contract Negotiation Patent Portfolio... Intellectual Property... Drafting patent... See 29+     See less Patents Patent Prosecution Prosecution Patent Litigation Trade Secrets Intellectual Property Trademarks Copyright Law Licensing Litigation Corporate Law Joint Ventures Patentability Due Diligence Software Licensing Legal Research Corporate Governance Patent Applications Privacy Law Trademark Infringement Legal Writing Strategy Mergers & Acquisitions Technology Transfer IP Venture Capital Semiconductors Invention Software Patents Data Privacy Client Counseling Legal Compliance Cyberlaw Patent Portfolio... Registered Patent... Intellectual Asset... Litigation Support Open Source Licensing Cloud Computing Civil Litigation Contract Negotiation Patent Portfolio... Intellectual Property... Drafting patent... See 29+     See less Education Harvard Law School Doctor of Law (J.D.),  Law 1990  – 1993 I took the Trial Advocacy classes and clinical pro-bono opportunity. I also thoroughly enjoyed rollerblading throughout Boston and Cambridge on both the streets and waterfronts. (I use the term rollerblading because I only skate on Rollerblade brand skates.) Activities and Societies:  Black Law Students Association Boston University MA,  Computer Science 1988  – 1990 GPA 3.9 Boston University BA,  Computer Science 1984  – 1988 CS GPA 3.9, overall GPA 3.62, Magna Cum Laude Harvard Law School Doctor of Law (J.D.),  Law 1990  – 1993 I took the Trial Advocacy classes and clinical pro-bono opportunity. I also thoroughly enjoyed rollerblading throughout Boston and Cambridge on both the streets and waterfronts. (I use the term rollerblading because I only skate on Rollerblade brand skates.) Activities and Societies:  Black Law Students Association Harvard Law School Doctor of Law (J.D.),  Law 1990  – 1993 I took the Trial Advocacy classes and clinical pro-bono opportunity. I also thoroughly enjoyed rollerblading throughout Boston and Cambridge on both the streets and waterfronts. (I use the term rollerblading because I only skate on Rollerblade brand skates.) Activities and Societies:  Black Law Students Association Harvard Law School Doctor of Law (J.D.),  Law 1990  – 1993 I took the Trial Advocacy classes and clinical pro-bono opportunity. I also thoroughly enjoyed rollerblading throughout Boston and Cambridge on both the streets and waterfronts. (I use the term rollerblading because I only skate on Rollerblade brand skates.) Activities and Societies:  Black Law Students Association Boston University MA,  Computer Science 1988  – 1990 GPA 3.9 Boston University MA,  Computer Science 1988  – 1990 GPA 3.9 Boston University MA,  Computer Science 1988  – 1990 GPA 3.9 Boston University BA,  Computer Science 1984  – 1988 CS GPA 3.9, overall GPA 3.62, Magna Cum Laude Boston University BA,  Computer Science 1984  – 1988 CS GPA 3.9, overall GPA 3.62, Magna Cum Laude Boston University BA,  Computer Science 1984  – 1988 CS GPA 3.9, overall GPA 3.62, Magna Cum Laude ", "Summary Corporate Attorney \n16 years of Software Engineering. \n16+ years of patent preparation and prosecution, patent portfolio management and general intellectual property practice. \n \nSpecialties: Software \nIntellectual Property \nPatent Prosecution \nPatent Portfolio Management \nPatent Prosecution Highway Summary Corporate Attorney \n16 years of Software Engineering. \n16+ years of patent preparation and prosecution, patent portfolio management and general intellectual property practice. \n \nSpecialties: Software \nIntellectual Property \nPatent Prosecution \nPatent Portfolio Management \nPatent Prosecution Highway Corporate Attorney \n16 years of Software Engineering. \n16+ years of patent preparation and prosecution, patent portfolio management and general intellectual property practice. \n \nSpecialties: Software \nIntellectual Property \nPatent Prosecution \nPatent Portfolio Management \nPatent Prosecution Highway Corporate Attorney \n16 years of Software Engineering. \n16+ years of patent preparation and prosecution, patent portfolio management and general intellectual property practice. \n \nSpecialties: Software \nIntellectual Property \nPatent Prosecution \nPatent Portfolio Management \nPatent Prosecution Highway Skills Patents Patent Prosecution Intellectual Property Patent Applications Invention Prosecution Trademarks Licensing Patentability Copyright Law Client Counseling Software Licensing Software Patents Software Development IP Intellectual Property... Software Engineering Corporate Law Semiconductors Computer Architecture Simulations Software See 7+     See less Skills  Patents Patent Prosecution Intellectual Property Patent Applications Invention Prosecution Trademarks Licensing Patentability Copyright Law Client Counseling Software Licensing Software Patents Software Development IP Intellectual Property... Software Engineering Corporate Law Semiconductors Computer Architecture Simulations Software See 7+     See less Patents Patent Prosecution Intellectual Property Patent Applications Invention Prosecution Trademarks Licensing Patentability Copyright Law Client Counseling Software Licensing Software Patents Software Development IP Intellectual Property... Software Engineering Corporate Law Semiconductors Computer Architecture Simulations Software See 7+     See less Patents Patent Prosecution Intellectual Property Patent Applications Invention Prosecution Trademarks Licensing Patentability Copyright Law Client Counseling Software Licensing Software Patents Software Development IP Intellectual Property... Software Engineering Corporate Law Semiconductors Computer Architecture Simulations Software See 7+     See less ", "Experience Chef Instructor The Art Institute of Portland July 2010  – Present (5 years 2 months) RATIONAL Certified Chef Rational Cooking Systems Inc 2010  – Present (5 years) Freelance Writer Self Employed February 2009  – Present (6 years 7 months) Extern/prep wd-50 August 2008  –  October 2008  (3 months) New York, NY Student Oregon Culinary Institute January 2008  –  October 2008  (10 months) Line Cook Quinn's Prime & Vine January 2008  –  July 2008  (7 months) Portland, Oregon Senior Patent Attorney Intel Corporation June 2004  –  January 2008  (3 years 8 months) Associate Solicitor USPTO 2000  –  2004  (4 years) Associate Kirkland & Ellis LLP 1997  –  2000  (3 years) Associate Pennie & Edmonds LLP 1996  –  1997  (1 year) Chef Instructor The Art Institute of Portland July 2010  – Present (5 years 2 months) Chef Instructor The Art Institute of Portland July 2010  – Present (5 years 2 months) RATIONAL Certified Chef Rational Cooking Systems Inc 2010  – Present (5 years) RATIONAL Certified Chef Rational Cooking Systems Inc 2010  – Present (5 years) Freelance Writer Self Employed February 2009  – Present (6 years 7 months) Freelance Writer Self Employed February 2009  – Present (6 years 7 months) Extern/prep wd-50 August 2008  –  October 2008  (3 months) New York, NY Extern/prep wd-50 August 2008  –  October 2008  (3 months) New York, NY Student Oregon Culinary Institute January 2008  –  October 2008  (10 months) Student Oregon Culinary Institute January 2008  –  October 2008  (10 months) Line Cook Quinn's Prime & Vine January 2008  –  July 2008  (7 months) Portland, Oregon Line Cook Quinn's Prime & Vine January 2008  –  July 2008  (7 months) Portland, Oregon Senior Patent Attorney Intel Corporation June 2004  –  January 2008  (3 years 8 months) Senior Patent Attorney Intel Corporation June 2004  –  January 2008  (3 years 8 months) Associate Solicitor USPTO 2000  –  2004  (4 years) Associate Solicitor USPTO 2000  –  2004  (4 years) Associate Kirkland & Ellis LLP 1997  –  2000  (3 years) Associate Kirkland & Ellis LLP 1997  –  2000  (3 years) Associate Pennie & Edmonds LLP 1996  –  1997  (1 year) Associate Pennie & Edmonds LLP 1996  –  1997  (1 year) Skills Culinary Skills Patents Food Cooking Copyright Law Licensing Wine Trademarks Patent Prosecution Intellectual Property Training Food Writing Event Planning Recipes Patent Litigation Menu Development Chef Recipe Testing See 3+     See less Skills  Culinary Skills Patents Food Cooking Copyright Law Licensing Wine Trademarks Patent Prosecution Intellectual Property Training Food Writing Event Planning Recipes Patent Litigation Menu Development Chef Recipe Testing See 3+     See less Culinary Skills Patents Food Cooking Copyright Law Licensing Wine Trademarks Patent Prosecution Intellectual Property Training Food Writing Event Planning Recipes Patent Litigation Menu Development Chef Recipe Testing See 3+     See less Culinary Skills Patents Food Cooking Copyright Law Licensing Wine Trademarks Patent Prosecution Intellectual Property Training Food Writing Event Planning Recipes Patent Litigation Menu Development Chef Recipe Testing See 3+     See less Education Oregon Culinary Institute Diploma 2008  – 2008 Tulane University Law School J.D. August 1993  – May 1996 Massachusetts Institute of Technology S.B. August 1989  – May 1993 Edison High School diploma Portland State University certificate Oregon Culinary Institute Diploma 2008  – 2008 Oregon Culinary Institute Diploma 2008  – 2008 Oregon Culinary Institute Diploma 2008  – 2008 Tulane University Law School J.D. August 1993  – May 1996 Tulane University Law School J.D. August 1993  – May 1996 Tulane University Law School J.D. August 1993  – May 1996 Massachusetts Institute of Technology S.B. August 1989  – May 1993 Massachusetts Institute of Technology S.B. August 1989  – May 1993 Massachusetts Institute of Technology S.B. August 1989  – May 1993 Edison High School diploma Edison High School diploma Edison High School diploma Portland State University certificate Portland State University certificate Portland State University certificate "]}