{"position": "Platform Applications Engineering", "company": "Intel Corporation", "profiles": ["Skills Semiconductors ASIC EDA SoC Debugging Intel Embedded Systems Hardware Architecture IC Microprocessors Product Management Semiconductor Industry Testing Firmware Product Lifecycle... System Architecture Processors FPGA Go-to-market Strategy Analog Engineering Management Wireless Embedded Software Simulations Electronics Perl Software Engineering Data Center PCB design Hardware Mixed Signal Consumer Electronics Electrical Engineering Algorithms Verilog Computer Architecture Technical Leadership Design of Experiments Device Drivers Cross-functional Team... Systems Engineering System Design High Performance... R&D C Product Marketing Ethernet RF Business Alliances Distributed Systems See 35+     See less Skills  Semiconductors ASIC EDA SoC Debugging Intel Embedded Systems Hardware Architecture IC Microprocessors Product Management Semiconductor Industry Testing Firmware Product Lifecycle... System Architecture Processors FPGA Go-to-market Strategy Analog Engineering Management Wireless Embedded Software Simulations Electronics Perl Software Engineering Data Center PCB design Hardware Mixed Signal Consumer Electronics Electrical Engineering Algorithms Verilog Computer Architecture Technical Leadership Design of Experiments Device Drivers Cross-functional Team... Systems Engineering System Design High Performance... R&D C Product Marketing Ethernet RF Business Alliances Distributed Systems See 35+     See less Semiconductors ASIC EDA SoC Debugging Intel Embedded Systems Hardware Architecture IC Microprocessors Product Management Semiconductor Industry Testing Firmware Product Lifecycle... System Architecture Processors FPGA Go-to-market Strategy Analog Engineering Management Wireless Embedded Software Simulations Electronics Perl Software Engineering Data Center PCB design Hardware Mixed Signal Consumer Electronics Electrical Engineering Algorithms Verilog Computer Architecture Technical Leadership Design of Experiments Device Drivers Cross-functional Team... Systems Engineering System Design High Performance... R&D C Product Marketing Ethernet RF Business Alliances Distributed Systems See 35+     See less Semiconductors ASIC EDA SoC Debugging Intel Embedded Systems Hardware Architecture IC Microprocessors Product Management Semiconductor Industry Testing Firmware Product Lifecycle... System Architecture Processors FPGA Go-to-market Strategy Analog Engineering Management Wireless Embedded Software Simulations Electronics Perl Software Engineering Data Center PCB design Hardware Mixed Signal Consumer Electronics Electrical Engineering Algorithms Verilog Computer Architecture Technical Leadership Design of Experiments Device Drivers Cross-functional Team... Systems Engineering System Design High Performance... R&D C Product Marketing Ethernet RF Business Alliances Distributed Systems See 35+     See less ", "Summary Resourceful professional with extensive experience in engineering management and coordination of design activities across large, worldwide development teams. Possess broad development experience from enterprise systems to personal mobile devices. Proven ability to meet or beat feature and schedule requirements in challenging, sometimes ambiguous environments. \nSkills include: \n• Management of technical teams \n• OEM/ODM customer management \n• Platform Applications Engineering \n• Competitive systems analysis \n• Systems design/integration/validation \n• Project Management Summary Resourceful professional with extensive experience in engineering management and coordination of design activities across large, worldwide development teams. Possess broad development experience from enterprise systems to personal mobile devices. Proven ability to meet or beat feature and schedule requirements in challenging, sometimes ambiguous environments. \nSkills include: \n• Management of technical teams \n• OEM/ODM customer management \n• Platform Applications Engineering \n• Competitive systems analysis \n• Systems design/integration/validation \n• Project Management Resourceful professional with extensive experience in engineering management and coordination of design activities across large, worldwide development teams. Possess broad development experience from enterprise systems to personal mobile devices. Proven ability to meet or beat feature and schedule requirements in challenging, sometimes ambiguous environments. \nSkills include: \n• Management of technical teams \n• OEM/ODM customer management \n• Platform Applications Engineering \n• Competitive systems analysis \n• Systems design/integration/validation \n• Project Management Resourceful professional with extensive experience in engineering management and coordination of design activities across large, worldwide development teams. Possess broad development experience from enterprise systems to personal mobile devices. Proven ability to meet or beat feature and schedule requirements in challenging, sometimes ambiguous environments. \nSkills include: \n• Management of technical teams \n• OEM/ODM customer management \n• Platform Applications Engineering \n• Competitive systems analysis \n• Systems design/integration/validation \n• Project Management Experience Systems Design Engineer Intel Corporation 2011  –  October 2013  (2 years) Dupont, Washington Personal Computer Client Group \nProvided technical leadership of a large, cross-organizational team for the development of PC and tablet computing platforms. \n•\tManaged platform definition and integration of critical ingredients, such as CPU, I/O, displays, power management, memory technologies and enclosures. \n•\tPerformed competitive platform analysis including design evaluation, cost analysis, and competitive assessments, while using this intelligence to prioritize and drive competitive product features. \n•\tConsulted with a leading external design consultant on their user experience design process leading to development of multiple unique system design concepts Manager, Data Center Platform Applications Engineering Intel Corporation October 2005  –  July 2011  (5 years 10 months) Dupont, Washington Managed diverse engineering teams providing worldwide OEM Server design, debug and validation support for Enterprise platforms. \n•\tManaged Xeon and Itanium platform Application Engineering teams providing direct OEM technical training, silicon integration and debug support leading to the successful launch of multiple enterprise processors/chipsets. \n•\tConceived of and staffed the Enterprise Platform Debug Team providing an unprecedented level of debug services for OEM customers. \n•\tDesigned and implemented the OEM customer feedback process providing better visibility to execution issues and increasing customer satisfaction. \n•\tSuccessfully managed issue prevention and management of enterprise cpus/chipsets through errata disposition and communication enabling on-time product delivery. Technical Marketing Engineer Intel Corporation October 2001  –  July 2005  (3 years 10 months) Provide detailed customer technical support for Intel Itanium and Xeon processors. Publish associated technical specifications. Develop and provide technical training and design support. Lead issue prevention and errata management. Senior Design Engineer Intel Corporation 1998  –  2001  (3 years) Dupont, Washington Led the Xeon enterprise processor Engineering Team through design, validation and production ramp of Intel’s highest margin product line. \n•\tLed the processor cartridge design teams resulting in the successful launches of the first two Xeon processors. \n•\tFormed and directed task forces to perform root cause analysis of issues enabling the team to maintain product launch schedules.  \n•\tManaged and mentored junior design team members enabling their successful integration into the project team. Systems Design Engineer Intel Corporation 2011  –  October 2013  (2 years) Dupont, Washington Personal Computer Client Group \nProvided technical leadership of a large, cross-organizational team for the development of PC and tablet computing platforms. \n•\tManaged platform definition and integration of critical ingredients, such as CPU, I/O, displays, power management, memory technologies and enclosures. \n•\tPerformed competitive platform analysis including design evaluation, cost analysis, and competitive assessments, while using this intelligence to prioritize and drive competitive product features. \n•\tConsulted with a leading external design consultant on their user experience design process leading to development of multiple unique system design concepts Systems Design Engineer Intel Corporation 2011  –  October 2013  (2 years) Dupont, Washington Personal Computer Client Group \nProvided technical leadership of a large, cross-organizational team for the development of PC and tablet computing platforms. \n•\tManaged platform definition and integration of critical ingredients, such as CPU, I/O, displays, power management, memory technologies and enclosures. \n•\tPerformed competitive platform analysis including design evaluation, cost analysis, and competitive assessments, while using this intelligence to prioritize and drive competitive product features. \n•\tConsulted with a leading external design consultant on their user experience design process leading to development of multiple unique system design concepts Manager, Data Center Platform Applications Engineering Intel Corporation October 2005  –  July 2011  (5 years 10 months) Dupont, Washington Managed diverse engineering teams providing worldwide OEM Server design, debug and validation support for Enterprise platforms. \n•\tManaged Xeon and Itanium platform Application Engineering teams providing direct OEM technical training, silicon integration and debug support leading to the successful launch of multiple enterprise processors/chipsets. \n•\tConceived of and staffed the Enterprise Platform Debug Team providing an unprecedented level of debug services for OEM customers. \n•\tDesigned and implemented the OEM customer feedback process providing better visibility to execution issues and increasing customer satisfaction. \n•\tSuccessfully managed issue prevention and management of enterprise cpus/chipsets through errata disposition and communication enabling on-time product delivery. Manager, Data Center Platform Applications Engineering Intel Corporation October 2005  –  July 2011  (5 years 10 months) Dupont, Washington Managed diverse engineering teams providing worldwide OEM Server design, debug and validation support for Enterprise platforms. \n•\tManaged Xeon and Itanium platform Application Engineering teams providing direct OEM technical training, silicon integration and debug support leading to the successful launch of multiple enterprise processors/chipsets. \n•\tConceived of and staffed the Enterprise Platform Debug Team providing an unprecedented level of debug services for OEM customers. \n•\tDesigned and implemented the OEM customer feedback process providing better visibility to execution issues and increasing customer satisfaction. \n•\tSuccessfully managed issue prevention and management of enterprise cpus/chipsets through errata disposition and communication enabling on-time product delivery. Technical Marketing Engineer Intel Corporation October 2001  –  July 2005  (3 years 10 months) Provide detailed customer technical support for Intel Itanium and Xeon processors. Publish associated technical specifications. Develop and provide technical training and design support. Lead issue prevention and errata management. Technical Marketing Engineer Intel Corporation October 2001  –  July 2005  (3 years 10 months) Provide detailed customer technical support for Intel Itanium and Xeon processors. Publish associated technical specifications. Develop and provide technical training and design support. Lead issue prevention and errata management. Senior Design Engineer Intel Corporation 1998  –  2001  (3 years) Dupont, Washington Led the Xeon enterprise processor Engineering Team through design, validation and production ramp of Intel’s highest margin product line. \n•\tLed the processor cartridge design teams resulting in the successful launches of the first two Xeon processors. \n•\tFormed and directed task forces to perform root cause analysis of issues enabling the team to maintain product launch schedules.  \n•\tManaged and mentored junior design team members enabling their successful integration into the project team. Senior Design Engineer Intel Corporation 1998  –  2001  (3 years) Dupont, Washington Led the Xeon enterprise processor Engineering Team through design, validation and production ramp of Intel’s highest margin product line. \n•\tLed the processor cartridge design teams resulting in the successful launches of the first two Xeon processors. \n•\tFormed and directed task forces to perform root cause analysis of issues enabling the team to maintain product launch schedules.  \n•\tManaged and mentored junior design team members enabling their successful integration into the project team. Languages   Skills Processors Debugging Semiconductors Intel SoC Competitive Analysis Computer Architecture ASIC Microprocessors Hardware Architecture Firmware VLSI IC PCIe Engineering Management Signal Integrity Verilog X86 Analog Circuit Design Embedded Systems Mobile Devices Analog TCL See 8+     See less Skills  Processors Debugging Semiconductors Intel SoC Competitive Analysis Computer Architecture ASIC Microprocessors Hardware Architecture Firmware VLSI IC PCIe Engineering Management Signal Integrity Verilog X86 Analog Circuit Design Embedded Systems Mobile Devices Analog TCL See 8+     See less Processors Debugging Semiconductors Intel SoC Competitive Analysis Computer Architecture ASIC Microprocessors Hardware Architecture Firmware VLSI IC PCIe Engineering Management Signal Integrity Verilog X86 Analog Circuit Design Embedded Systems Mobile Devices Analog TCL See 8+     See less Processors Debugging Semiconductors Intel SoC Competitive Analysis Computer Architecture ASIC Microprocessors Hardware Architecture Firmware VLSI IC PCIe Engineering Management Signal Integrity Verilog X86 Analog Circuit Design Embedded Systems Mobile Devices Analog TCL See 8+     See less Education Arizona State University Bachelor of Science (BS),  Electrical and Electronics Engineering 1992  – 1995 Portland State University Arizona State University Bachelor of Science (BS),  Electrical and Electronics Engineering 1992  – 1995 Arizona State University Bachelor of Science (BS),  Electrical and Electronics Engineering 1992  – 1995 Arizona State University Bachelor of Science (BS),  Electrical and Electronics Engineering 1992  – 1995 Portland State University Portland State University Portland State University Honors & Awards ", "Summary Director at Intel with >22 years of experience spanning microprocessor design, marketing and technical customer support. Currently managing worldwide server customer enabling and support for Intel Corporation. Summary Director at Intel with >22 years of experience spanning microprocessor design, marketing and technical customer support. Currently managing worldwide server customer enabling and support for Intel Corporation. Director at Intel with >22 years of experience spanning microprocessor design, marketing and technical customer support. Currently managing worldwide server customer enabling and support for Intel Corporation. Director at Intel with >22 years of experience spanning microprocessor design, marketing and technical customer support. Currently managing worldwide server customer enabling and support for Intel Corporation. Experience Senior Director, Data Center Platform Applications Engineering Intel Corporation December 2011  – Present (3 years 9 months) Portland, Oregon Area Senior Director, Data Center Platform Applications Engineering Intel Corporation December 2011  – Present (3 years 9 months) Portland, Oregon Area Senior Director, Data Center Platform Applications Engineering Intel Corporation December 2011  – Present (3 years 9 months) Portland, Oregon Area Skills Semiconductors Intel Microprocessors Program Management ASIC Firmware Processors Management Data Center Embedded Systems SoC System Architecture Semiconductor Industry Computer Architecture Skills  Semiconductors Intel Microprocessors Program Management ASIC Firmware Processors Management Data Center Embedded Systems SoC System Architecture Semiconductor Industry Computer Architecture Semiconductors Intel Microprocessors Program Management ASIC Firmware Processors Management Data Center Embedded Systems SoC System Architecture Semiconductor Industry Computer Architecture Semiconductors Intel Microprocessors Program Management ASIC Firmware Processors Management Data Center Embedded Systems SoC System Architecture Semiconductor Industry Computer Architecture Honors & Awards ", "Summary Computer executive with broad experience in server platform technologies, enterprise solutions, software engineering and validation of commercial hardware and software. Ten + years of global management experience including direct management of teams in Bangalore, Shanghai, Taipei and Poland. Currently responsible for providing engineering support to customers integrating Intel's server infrastructure technologies including manageability, security, RAS and power management. \n \nFormerly responsible for directing development and validation activities for Dell's enterprise and client product portfolio.  \n \nFormerly responsible for directing data warehousing software development for NCR/Teradata. \n \nSpecialties: Solutions integration, enterprise software, validation, technical marketing. Summary Computer executive with broad experience in server platform technologies, enterprise solutions, software engineering and validation of commercial hardware and software. Ten + years of global management experience including direct management of teams in Bangalore, Shanghai, Taipei and Poland. Currently responsible for providing engineering support to customers integrating Intel's server infrastructure technologies including manageability, security, RAS and power management. \n \nFormerly responsible for directing development and validation activities for Dell's enterprise and client product portfolio.  \n \nFormerly responsible for directing data warehousing software development for NCR/Teradata. \n \nSpecialties: Solutions integration, enterprise software, validation, technical marketing. Computer executive with broad experience in server platform technologies, enterprise solutions, software engineering and validation of commercial hardware and software. Ten + years of global management experience including direct management of teams in Bangalore, Shanghai, Taipei and Poland. Currently responsible for providing engineering support to customers integrating Intel's server infrastructure technologies including manageability, security, RAS and power management. \n \nFormerly responsible for directing development and validation activities for Dell's enterprise and client product portfolio.  \n \nFormerly responsible for directing data warehousing software development for NCR/Teradata. \n \nSpecialties: Solutions integration, enterprise software, validation, technical marketing. Computer executive with broad experience in server platform technologies, enterprise solutions, software engineering and validation of commercial hardware and software. Ten + years of global management experience including direct management of teams in Bangalore, Shanghai, Taipei and Poland. Currently responsible for providing engineering support to customers integrating Intel's server infrastructure technologies including manageability, security, RAS and power management. \n \nFormerly responsible for directing development and validation activities for Dell's enterprise and client product portfolio.  \n \nFormerly responsible for directing data warehousing software development for NCR/Teradata. \n \nSpecialties: Solutions integration, enterprise software, validation, technical marketing. Experience Director, Technology Integration Engineering Intel Corporation December 2012  – Present (2 years 9 months) Provide solutions integration support to enterprise, cloud and HPC customers. Develop reference solutions highlighting Intel's server infrastructure technologies including manageability, security, RAS and power management. Develop reference architectures and solutions which provide technology proof points. Utilize these proof points to support customer deploying vertically integrated server solutions. \n \nProvide engineering support to enterprise and cloud customers to integrate Intel server technologies into their new platforms. Enablement support includes authoring technical specifications, developing training and identifying tool requirements that ease customer adoption. Provide debug support customers during their integration and validation phases and continued support post platform launch. Technologies supported include manageability, power, thermal, and mechanicals.  \n \nManage validation efforts for commercial Intel based platforms. Focus on functional and integration validation of first generation server technologies expanding to interoperability of these technologies as a component of a vertical solution. \n \nManagement responsibilitiy across geographics including the U.S., Asia, and Europe. Manager, Datacenter Platform Applications Engineering Intel Corporation November 2011  –  December 2012  (1 year 2 months) Responsible for providing engineering support to enterprise and cloud customers integrating Intel server technologies into their new platforms. Enablement support includes authoring technical specifications, developing training and identifying tool requirements that ease customer adoption. Provide debug support customers during their integration and validation phases and continued support post platform launch.  \n \nTechnologies supported include manageability, chipset, power, thermal, and mechanicals. Management responsibilitiy across geographics including the U.S., Asia, and Europe. Technical Marketing Engineering Manager Intel Corporation August 2010  –  November 2011  (1 year 4 months) Portland, Oregon Responsible for enabling customers to adapt Intel technologies. Provide technical marketing support to the drive the adoption of Intel products and technologies. Provide direct customer support to enable these products and technologies in at OEM's, ODM's and Internet Portal Data Centers (IPDC's). Provide ongoing customer support post launch. Director, Regional Validation - Asia, Dell Inc. Dell Inc. March 1998  –  April 2010  (12 years 2 months) Responsible for managing the Dell validation teams for commercial platforms for both client and enterprise products. Validation responsibility includes compatibility, reliability, and shock and vibe testing. \n \nClient programs include desktop, notebook, and workstations platforms with teams in Shanghai, China and Taipei. Taiwan. Enterprise programs include responsibility for servers, software and storage with teams in Bangalore, India and Taipei, Taiwan. \n \nAdditionally responsible for the enablement of Taiwan ODM's to validate Dell platforms. Director, Technology Integration Engineering Intel Corporation December 2012  – Present (2 years 9 months) Provide solutions integration support to enterprise, cloud and HPC customers. Develop reference solutions highlighting Intel's server infrastructure technologies including manageability, security, RAS and power management. Develop reference architectures and solutions which provide technology proof points. Utilize these proof points to support customer deploying vertically integrated server solutions. \n \nProvide engineering support to enterprise and cloud customers to integrate Intel server technologies into their new platforms. Enablement support includes authoring technical specifications, developing training and identifying tool requirements that ease customer adoption. Provide debug support customers during their integration and validation phases and continued support post platform launch. Technologies supported include manageability, power, thermal, and mechanicals.  \n \nManage validation efforts for commercial Intel based platforms. Focus on functional and integration validation of first generation server technologies expanding to interoperability of these technologies as a component of a vertical solution. \n \nManagement responsibilitiy across geographics including the U.S., Asia, and Europe. Director, Technology Integration Engineering Intel Corporation December 2012  – Present (2 years 9 months) Provide solutions integration support to enterprise, cloud and HPC customers. Develop reference solutions highlighting Intel's server infrastructure technologies including manageability, security, RAS and power management. Develop reference architectures and solutions which provide technology proof points. Utilize these proof points to support customer deploying vertically integrated server solutions. \n \nProvide engineering support to enterprise and cloud customers to integrate Intel server technologies into their new platforms. Enablement support includes authoring technical specifications, developing training and identifying tool requirements that ease customer adoption. Provide debug support customers during their integration and validation phases and continued support post platform launch. Technologies supported include manageability, power, thermal, and mechanicals.  \n \nManage validation efforts for commercial Intel based platforms. Focus on functional and integration validation of first generation server technologies expanding to interoperability of these technologies as a component of a vertical solution. \n \nManagement responsibilitiy across geographics including the U.S., Asia, and Europe. Manager, Datacenter Platform Applications Engineering Intel Corporation November 2011  –  December 2012  (1 year 2 months) Responsible for providing engineering support to enterprise and cloud customers integrating Intel server technologies into their new platforms. Enablement support includes authoring technical specifications, developing training and identifying tool requirements that ease customer adoption. Provide debug support customers during their integration and validation phases and continued support post platform launch.  \n \nTechnologies supported include manageability, chipset, power, thermal, and mechanicals. Management responsibilitiy across geographics including the U.S., Asia, and Europe. Manager, Datacenter Platform Applications Engineering Intel Corporation November 2011  –  December 2012  (1 year 2 months) Responsible for providing engineering support to enterprise and cloud customers integrating Intel server technologies into their new platforms. Enablement support includes authoring technical specifications, developing training and identifying tool requirements that ease customer adoption. Provide debug support customers during their integration and validation phases and continued support post platform launch.  \n \nTechnologies supported include manageability, chipset, power, thermal, and mechanicals. Management responsibilitiy across geographics including the U.S., Asia, and Europe. Technical Marketing Engineering Manager Intel Corporation August 2010  –  November 2011  (1 year 4 months) Portland, Oregon Responsible for enabling customers to adapt Intel technologies. Provide technical marketing support to the drive the adoption of Intel products and technologies. Provide direct customer support to enable these products and technologies in at OEM's, ODM's and Internet Portal Data Centers (IPDC's). Provide ongoing customer support post launch. Technical Marketing Engineering Manager Intel Corporation August 2010  –  November 2011  (1 year 4 months) Portland, Oregon Responsible for enabling customers to adapt Intel technologies. Provide technical marketing support to the drive the adoption of Intel products and technologies. Provide direct customer support to enable these products and technologies in at OEM's, ODM's and Internet Portal Data Centers (IPDC's). Provide ongoing customer support post launch. Director, Regional Validation - Asia, Dell Inc. Dell Inc. March 1998  –  April 2010  (12 years 2 months) Responsible for managing the Dell validation teams for commercial platforms for both client and enterprise products. Validation responsibility includes compatibility, reliability, and shock and vibe testing. \n \nClient programs include desktop, notebook, and workstations platforms with teams in Shanghai, China and Taipei. Taiwan. Enterprise programs include responsibility for servers, software and storage with teams in Bangalore, India and Taipei, Taiwan. \n \nAdditionally responsible for the enablement of Taiwan ODM's to validate Dell platforms. Director, Regional Validation - Asia, Dell Inc. Dell Inc. March 1998  –  April 2010  (12 years 2 months) Responsible for managing the Dell validation teams for commercial platforms for both client and enterprise products. Validation responsibility includes compatibility, reliability, and shock and vibe testing. \n \nClient programs include desktop, notebook, and workstations platforms with teams in Shanghai, China and Taipei. Taiwan. Enterprise programs include responsibility for servers, software and storage with teams in Bangalore, India and Taipei, Taiwan. \n \nAdditionally responsible for the enablement of Taiwan ODM's to validate Dell platforms. Skills Enterprise Software Program Management Strategy Software Development Testing Data Center Management Leadership Software Engineering Team Management Business Strategy Hardware Servers Data Warehousing Cloud Computing Validation See 1+     See less Skills  Enterprise Software Program Management Strategy Software Development Testing Data Center Management Leadership Software Engineering Team Management Business Strategy Hardware Servers Data Warehousing Cloud Computing Validation See 1+     See less Enterprise Software Program Management Strategy Software Development Testing Data Center Management Leadership Software Engineering Team Management Business Strategy Hardware Servers Data Warehousing Cloud Computing Validation See 1+     See less Enterprise Software Program Management Strategy Software Development Testing Data Center Management Leadership Software Engineering Team Management Business Strategy Hardware Servers Data Warehousing Cloud Computing Validation See 1+     See less Education National Technological University MS,  Engineering Management 1991  – 1993 San Diego State University-California State University Bachelor of Applied Science (B.A.Sc.),  Computer Science 1980  – 1984 National Technological University MS,  Engineering Management 1991  – 1993 National Technological University MS,  Engineering Management 1991  – 1993 National Technological University MS,  Engineering Management 1991  – 1993 San Diego State University-California State University Bachelor of Applied Science (B.A.Sc.),  Computer Science 1980  – 1984 San Diego State University-California State University Bachelor of Applied Science (B.A.Sc.),  Computer Science 1980  – 1984 San Diego State University-California State University Bachelor of Applied Science (B.A.Sc.),  Computer Science 1980  – 1984 "]}