{"position": "Problem Manager", "company": "IBM", "profiles": ["Experience Global M&Q and GME Problem Manager IBM Global M&Q and GME Problem Manager IBM Global M&Q and GME Problem Manager IBM ", "Skills Avaya Telephony Telecommunications VoIP Unified Communications Call Center IP Managed Services Contact Centers IVR Voice Mail Service Delivery Call Centers Team Leadership TCP/IP Customer Satisfaction Solution Selling Management Professional Services Pre-sales Vendor Management MPLS Cisco Technologies Video Conferencing Ethernet Troubleshooting Selling Networking Customer Experience Switches Network Design See 16+     See less Skills  Avaya Telephony Telecommunications VoIP Unified Communications Call Center IP Managed Services Contact Centers IVR Voice Mail Service Delivery Call Centers Team Leadership TCP/IP Customer Satisfaction Solution Selling Management Professional Services Pre-sales Vendor Management MPLS Cisco Technologies Video Conferencing Ethernet Troubleshooting Selling Networking Customer Experience Switches Network Design See 16+     See less Avaya Telephony Telecommunications VoIP Unified Communications Call Center IP Managed Services Contact Centers IVR Voice Mail Service Delivery Call Centers Team Leadership TCP/IP Customer Satisfaction Solution Selling Management Professional Services Pre-sales Vendor Management MPLS Cisco Technologies Video Conferencing Ethernet Troubleshooting Selling Networking Customer Experience Switches Network Design See 16+     See less Avaya Telephony Telecommunications VoIP Unified Communications Call Center IP Managed Services Contact Centers IVR Voice Mail Service Delivery Call Centers Team Leadership TCP/IP Customer Satisfaction Solution Selling Management Professional Services Pre-sales Vendor Management MPLS Cisco Technologies Video Conferencing Ethernet Troubleshooting Selling Networking Customer Experience Switches Network Design See 16+     See less ", "Experience Service Desk & Problem Manager IBM Global Services Service Desk & Problem Manager IBM Global Services Service Desk & Problem Manager IBM Global Services Education Università di Pisa Engineering 1983  – 1993 Università di Pisa Engineering 1983  – 1993 Università di Pisa Engineering 1983  – 1993 Università di Pisa Engineering 1983  – 1993 ", "Summary I am a dynamic IT Specialist with proven success in Service Management, Server Compliance and Web Design. I have experience with ITIL methods, processes, strategic technology infrastructure planning, and developing cost effective solutions to meet customer business requirements. \n \nSpecialties: Specializing in: \nSystem Analysis - Data collection, evaluating, proposing solutions \nWeb Development - Programming, graphic design, and database management \nProject Management - Effective negotiations, project delivery, coordination \nIT Compliance - Systems audit, Security & Risk Management  \n \nTechnical Acumen: \nLanguages\t- HTML, JavaScript, VBA, .NET, LotusScript \nPlatform - Windows 2000/XP, UNIX, DOMINO Summary I am a dynamic IT Specialist with proven success in Service Management, Server Compliance and Web Design. I have experience with ITIL methods, processes, strategic technology infrastructure planning, and developing cost effective solutions to meet customer business requirements. \n \nSpecialties: Specializing in: \nSystem Analysis - Data collection, evaluating, proposing solutions \nWeb Development - Programming, graphic design, and database management \nProject Management - Effective negotiations, project delivery, coordination \nIT Compliance - Systems audit, Security & Risk Management  \n \nTechnical Acumen: \nLanguages\t- HTML, JavaScript, VBA, .NET, LotusScript \nPlatform - Windows 2000/XP, UNIX, DOMINO I am a dynamic IT Specialist with proven success in Service Management, Server Compliance and Web Design. I have experience with ITIL methods, processes, strategic technology infrastructure planning, and developing cost effective solutions to meet customer business requirements. \n \nSpecialties: Specializing in: \nSystem Analysis - Data collection, evaluating, proposing solutions \nWeb Development - Programming, graphic design, and database management \nProject Management - Effective negotiations, project delivery, coordination \nIT Compliance - Systems audit, Security & Risk Management  \n \nTechnical Acumen: \nLanguages\t- HTML, JavaScript, VBA, .NET, LotusScript \nPlatform - Windows 2000/XP, UNIX, DOMINO I am a dynamic IT Specialist with proven success in Service Management, Server Compliance and Web Design. I have experience with ITIL methods, processes, strategic technology infrastructure planning, and developing cost effective solutions to meet customer business requirements. \n \nSpecialties: Specializing in: \nSystem Analysis - Data collection, evaluating, proposing solutions \nWeb Development - Programming, graphic design, and database management \nProject Management - Effective negotiations, project delivery, coordination \nIT Compliance - Systems audit, Security & Risk Management  \n \nTechnical Acumen: \nLanguages\t- HTML, JavaScript, VBA, .NET, LotusScript \nPlatform - Windows 2000/XP, UNIX, DOMINO Experience Sr Technical Specialist - Security Compliance AT&T March 2014  – Present (1 year 6 months) District Brno-City, Czech Republic Customer Audits & Governance team: Sr Technical Specialist \nAs a member of the AT&T Global Customer Security Services team, I am responsible for providing Third Party Audit support, security services support and compliance guidance to AT&T functions and IBM. Sr Technical Network Associate AT&T May 2012  –  March 2014  (1 year 11 months) District Brno-City, Czech Republic Global Network Operations: Technical Network Associate \nAs a member of the AT&T Global Operations Data Quality console, I am responsible for managing overall network performance, reliability, risk and quality to support the company as an industry leader in performance. I review the network performance data collected from various sources to assign and/or conduct root-cause analysis, investigate potential service impacts, refer problems and log trending data. Problem Manager IBM December 2010  –  April 2012  (1 year 5 months) District Brno-City, Czech Republic Service Management: Problem Manager – IBM Nordic \nTo provide Incident Management through the management and resolution of large incidents when the Service Desk is unable to do so independently and Problem Management for the identification and resolution of incident trends throughout the information system lifecycle, including classification, prioritisation and initiation of action, documentation of root causes and implementation of remedies. SA&D Focal Point IBM June 2009  –  December 2010  (1 year 7 months) District Brno-City, Czech Republic IT Specialist: Focal Point – IBM France \nServer activation and deactivation is managed according to the IBM security processes (GSD331, ISEC, and ITCS104 for infrastructure servers). The activation and deactivation of servers is performed by the Security Delivery Team located in the IDC (Brno) of which I owned the process locally. The control of this activity is owned by customer security managers located in France, and as focal point I was responsible for the coordination of teams in both countries. Online Marketing Specialist The Source Network September 2007  –  April 2009  (1 year 8 months) Warsaw Area, Poland Source Network, Warsaw, Poland / Brno, Czech Republic, 2007 – 2009 \nOnline Marketing: Website Development HR Support & Payroll The Manchester College February 2004  –  September 2007  (3 years 8 months) Manchester, United Kingdom City College, Manchester, United Kingdom, 2004 – 2007 \nHR Support: Human Resources Coordinator Outbound Marketing Specialist Stream Intelligent Contact October 2001  –  February 2004  (2 years 5 months) Manchester, United Kingdom LBM Marketing, Manchester, United Kingdom, 2001 – 2004 \nMarketing: Outbound Business Telesales Sr Technical Specialist - Security Compliance AT&T March 2014  – Present (1 year 6 months) District Brno-City, Czech Republic Customer Audits & Governance team: Sr Technical Specialist \nAs a member of the AT&T Global Customer Security Services team, I am responsible for providing Third Party Audit support, security services support and compliance guidance to AT&T functions and IBM. Sr Technical Specialist - Security Compliance AT&T March 2014  – Present (1 year 6 months) District Brno-City, Czech Republic Customer Audits & Governance team: Sr Technical Specialist \nAs a member of the AT&T Global Customer Security Services team, I am responsible for providing Third Party Audit support, security services support and compliance guidance to AT&T functions and IBM. Sr Technical Network Associate AT&T May 2012  –  March 2014  (1 year 11 months) District Brno-City, Czech Republic Global Network Operations: Technical Network Associate \nAs a member of the AT&T Global Operations Data Quality console, I am responsible for managing overall network performance, reliability, risk and quality to support the company as an industry leader in performance. I review the network performance data collected from various sources to assign and/or conduct root-cause analysis, investigate potential service impacts, refer problems and log trending data. Sr Technical Network Associate AT&T May 2012  –  March 2014  (1 year 11 months) District Brno-City, Czech Republic Global Network Operations: Technical Network Associate \nAs a member of the AT&T Global Operations Data Quality console, I am responsible for managing overall network performance, reliability, risk and quality to support the company as an industry leader in performance. I review the network performance data collected from various sources to assign and/or conduct root-cause analysis, investigate potential service impacts, refer problems and log trending data. Problem Manager IBM December 2010  –  April 2012  (1 year 5 months) District Brno-City, Czech Republic Service Management: Problem Manager – IBM Nordic \nTo provide Incident Management through the management and resolution of large incidents when the Service Desk is unable to do so independently and Problem Management for the identification and resolution of incident trends throughout the information system lifecycle, including classification, prioritisation and initiation of action, documentation of root causes and implementation of remedies. Problem Manager IBM December 2010  –  April 2012  (1 year 5 months) District Brno-City, Czech Republic Service Management: Problem Manager – IBM Nordic \nTo provide Incident Management through the management and resolution of large incidents when the Service Desk is unable to do so independently and Problem Management for the identification and resolution of incident trends throughout the information system lifecycle, including classification, prioritisation and initiation of action, documentation of root causes and implementation of remedies. SA&D Focal Point IBM June 2009  –  December 2010  (1 year 7 months) District Brno-City, Czech Republic IT Specialist: Focal Point – IBM France \nServer activation and deactivation is managed according to the IBM security processes (GSD331, ISEC, and ITCS104 for infrastructure servers). The activation and deactivation of servers is performed by the Security Delivery Team located in the IDC (Brno) of which I owned the process locally. The control of this activity is owned by customer security managers located in France, and as focal point I was responsible for the coordination of teams in both countries. SA&D Focal Point IBM June 2009  –  December 2010  (1 year 7 months) District Brno-City, Czech Republic IT Specialist: Focal Point – IBM France \nServer activation and deactivation is managed according to the IBM security processes (GSD331, ISEC, and ITCS104 for infrastructure servers). The activation and deactivation of servers is performed by the Security Delivery Team located in the IDC (Brno) of which I owned the process locally. The control of this activity is owned by customer security managers located in France, and as focal point I was responsible for the coordination of teams in both countries. Online Marketing Specialist The Source Network September 2007  –  April 2009  (1 year 8 months) Warsaw Area, Poland Source Network, Warsaw, Poland / Brno, Czech Republic, 2007 – 2009 \nOnline Marketing: Website Development Online Marketing Specialist The Source Network September 2007  –  April 2009  (1 year 8 months) Warsaw Area, Poland Source Network, Warsaw, Poland / Brno, Czech Republic, 2007 – 2009 \nOnline Marketing: Website Development HR Support & Payroll The Manchester College February 2004  –  September 2007  (3 years 8 months) Manchester, United Kingdom City College, Manchester, United Kingdom, 2004 – 2007 \nHR Support: Human Resources Coordinator HR Support & Payroll The Manchester College February 2004  –  September 2007  (3 years 8 months) Manchester, United Kingdom City College, Manchester, United Kingdom, 2004 – 2007 \nHR Support: Human Resources Coordinator Outbound Marketing Specialist Stream Intelligent Contact October 2001  –  February 2004  (2 years 5 months) Manchester, United Kingdom LBM Marketing, Manchester, United Kingdom, 2001 – 2004 \nMarketing: Outbound Business Telesales Outbound Marketing Specialist Stream Intelligent Contact October 2001  –  February 2004  (2 years 5 months) Manchester, United Kingdom LBM Marketing, Manchester, United Kingdom, 2001 – 2004 \nMarketing: Outbound Business Telesales Skills Unix Project Management ITIL Security Management SQL Green Belt IT Service Management HTML CSS JavaScript VBA .NET LotusScript Business Objects Maximo Human Resources Training Servers Outsourcing Web Development PHP Account Management IP CompTIA Security+ Big Data Cyber-security Mobility Management Network Connectivity Network Infrastructure See 15+     See less Skills  Unix Project Management ITIL Security Management SQL Green Belt IT Service Management HTML CSS JavaScript VBA .NET LotusScript Business Objects Maximo Human Resources Training Servers Outsourcing Web Development PHP Account Management IP CompTIA Security+ Big Data Cyber-security Mobility Management Network Connectivity Network Infrastructure See 15+     See less Unix Project Management ITIL Security Management SQL Green Belt IT Service Management HTML CSS JavaScript VBA .NET LotusScript Business Objects Maximo Human Resources Training Servers Outsourcing Web Development PHP Account Management IP CompTIA Security+ Big Data Cyber-security Mobility Management Network Connectivity Network Infrastructure See 15+     See less Unix Project Management ITIL Security Management SQL Green Belt IT Service Management HTML CSS JavaScript VBA .NET LotusScript Business Objects Maximo Human Resources Training Servers Outsourcing Web Development PHP Account Management IP CompTIA Security+ Big Data Cyber-security Mobility Management Network Connectivity Network Infrastructure See 15+     See less Education xavarian college xavarian college xavarian college xavarian college ", "Summary An overall experience of 4.2 years with extensive expertise in IT Infrastructure - Service Management (ITSM), Problem Management, incident Management & ITIL V3 certified, Technical Services Summary An overall experience of 4.2 years with extensive expertise in IT Infrastructure - Service Management (ITSM), Problem Management, incident Management & ITIL V3 certified, Technical Services An overall experience of 4.2 years with extensive expertise in IT Infrastructure - Service Management (ITSM), Problem Management, incident Management & ITIL V3 certified, Technical Services An overall experience of 4.2 years with extensive expertise in IT Infrastructure - Service Management (ITSM), Problem Management, incident Management & ITIL V3 certified, Technical Services Experience Problem Manager IBM April 2012  – Present (3 years 5 months) Project Coordinator IBM November 2010  –  March 2012  (1 year 5 months) Problem Manager IBM April 2012  – Present (3 years 5 months) Problem Manager IBM April 2012  – Present (3 years 5 months) Project Coordinator IBM November 2010  –  March 2012  (1 year 5 months) Project Coordinator IBM November 2010  –  March 2012  (1 year 5 months) Languages English Hindi Telugu Kannada English Hindi Telugu Kannada English Hindi Telugu Kannada Skills Management Microsoft Office Project Management Strategic Planning Customer Service Leadership Microsoft Excel Business Strategy Skills  Management Microsoft Office Project Management Strategic Planning Customer Service Leadership Microsoft Excel Business Strategy Management Microsoft Office Project Management Strategic Planning Customer Service Leadership Microsoft Excel Business Strategy Management Microsoft Office Project Management Strategic Planning Customer Service Leadership Microsoft Excel Business Strategy Education HRD Degree College Bachelor's Degree,  Bachelor of Commerce 2004  – 2007 Bhegas high school SSC 1990  – 2000 HRD Degree College Bachelor's Degree,  Bachelor of Commerce 2004  – 2007 HRD Degree College Bachelor's Degree,  Bachelor of Commerce 2004  – 2007 HRD Degree College Bachelor's Degree,  Bachelor of Commerce 2004  – 2007 Bhegas high school SSC 1990  – 2000 Bhegas high school SSC 1990  – 2000 Bhegas high school SSC 1990  – 2000 ", "Summary I am an IT Management Personnel with more than 8 years of experience in IT (technical) and IT Management. I have worked on most aspects viz. Managing IT, Information Security, IT Operations & IT Infrastructure. \nResponsible for IT Operations, Infrastructure, Information Security and managing a team of 18 IT professionals.  \nInvolved with reputed client in Insurance industry, the fastest growing leading private insurance enterprise in India, since 2007 for countrywide IT setup & governance of technology platform to establish IT Systems & Infrastructure and a wide range of IT deployments.  \nI am an innovative, responsible, focused & energetic person and have the ability to lead teams with a focus to deliver and meet the desired goals.  \nProven ability to deliver under pressure and demanding deadlines. Consistent top performance ratings backed with fast tracked promotions in depth understanding IT Services. \n \nMore than 6 years of experience in IT Operations and Management. \n• Excellent ability to handle IT project and complete it within time and budget. \n• Implemented IT Infrastructure for offices. \n• Ensured end-points systems compliance. \n• Maintained and Improved SLA’s, and drive operational excellence. \n• Experienced in handling 8000+ Assets comprising of Laptops, Desktops, Printers and Scanners. \n• Excellent interpersonal communication, team building and management skills \n• Well organized, focused, result oriented with an ability to work under pressure to meet deadlines. \n• Service-oriented with Analytical and Problem Solving skills. \n• Motivated and guided a team of 20 people. \n• Ensure that team gets proper support from various groups \n• Guide the team in Issue resolution, Problem management and Root cause analysis \n• Deployment of various IT technology initiatives on all the systems across 1000 branches. Summary I am an IT Management Personnel with more than 8 years of experience in IT (technical) and IT Management. I have worked on most aspects viz. Managing IT, Information Security, IT Operations & IT Infrastructure. \nResponsible for IT Operations, Infrastructure, Information Security and managing a team of 18 IT professionals.  \nInvolved with reputed client in Insurance industry, the fastest growing leading private insurance enterprise in India, since 2007 for countrywide IT setup & governance of technology platform to establish IT Systems & Infrastructure and a wide range of IT deployments.  \nI am an innovative, responsible, focused & energetic person and have the ability to lead teams with a focus to deliver and meet the desired goals.  \nProven ability to deliver under pressure and demanding deadlines. Consistent top performance ratings backed with fast tracked promotions in depth understanding IT Services. \n \nMore than 6 years of experience in IT Operations and Management. \n• Excellent ability to handle IT project and complete it within time and budget. \n• Implemented IT Infrastructure for offices. \n• Ensured end-points systems compliance. \n• Maintained and Improved SLA’s, and drive operational excellence. \n• Experienced in handling 8000+ Assets comprising of Laptops, Desktops, Printers and Scanners. \n• Excellent interpersonal communication, team building and management skills \n• Well organized, focused, result oriented with an ability to work under pressure to meet deadlines. \n• Service-oriented with Analytical and Problem Solving skills. \n• Motivated and guided a team of 20 people. \n• Ensure that team gets proper support from various groups \n• Guide the team in Issue resolution, Problem management and Root cause analysis \n• Deployment of various IT technology initiatives on all the systems across 1000 branches. I am an IT Management Personnel with more than 8 years of experience in IT (technical) and IT Management. I have worked on most aspects viz. Managing IT, Information Security, IT Operations & IT Infrastructure. \nResponsible for IT Operations, Infrastructure, Information Security and managing a team of 18 IT professionals.  \nInvolved with reputed client in Insurance industry, the fastest growing leading private insurance enterprise in India, since 2007 for countrywide IT setup & governance of technology platform to establish IT Systems & Infrastructure and a wide range of IT deployments.  \nI am an innovative, responsible, focused & energetic person and have the ability to lead teams with a focus to deliver and meet the desired goals.  \nProven ability to deliver under pressure and demanding deadlines. Consistent top performance ratings backed with fast tracked promotions in depth understanding IT Services. \n \nMore than 6 years of experience in IT Operations and Management. \n• Excellent ability to handle IT project and complete it within time and budget. \n• Implemented IT Infrastructure for offices. \n• Ensured end-points systems compliance. \n• Maintained and Improved SLA’s, and drive operational excellence. \n• Experienced in handling 8000+ Assets comprising of Laptops, Desktops, Printers and Scanners. \n• Excellent interpersonal communication, team building and management skills \n• Well organized, focused, result oriented with an ability to work under pressure to meet deadlines. \n• Service-oriented with Analytical and Problem Solving skills. \n• Motivated and guided a team of 20 people. \n• Ensure that team gets proper support from various groups \n• Guide the team in Issue resolution, Problem management and Root cause analysis \n• Deployment of various IT technology initiatives on all the systems across 1000 branches. I am an IT Management Personnel with more than 8 years of experience in IT (technical) and IT Management. I have worked on most aspects viz. Managing IT, Information Security, IT Operations & IT Infrastructure. \nResponsible for IT Operations, Infrastructure, Information Security and managing a team of 18 IT professionals.  \nInvolved with reputed client in Insurance industry, the fastest growing leading private insurance enterprise in India, since 2007 for countrywide IT setup & governance of technology platform to establish IT Systems & Infrastructure and a wide range of IT deployments.  \nI am an innovative, responsible, focused & energetic person and have the ability to lead teams with a focus to deliver and meet the desired goals.  \nProven ability to deliver under pressure and demanding deadlines. Consistent top performance ratings backed with fast tracked promotions in depth understanding IT Services. \n \nMore than 6 years of experience in IT Operations and Management. \n• Excellent ability to handle IT project and complete it within time and budget. \n• Implemented IT Infrastructure for offices. \n• Ensured end-points systems compliance. \n• Maintained and Improved SLA’s, and drive operational excellence. \n• Experienced in handling 8000+ Assets comprising of Laptops, Desktops, Printers and Scanners. \n• Excellent interpersonal communication, team building and management skills \n• Well organized, focused, result oriented with an ability to work under pressure to meet deadlines. \n• Service-oriented with Analytical and Problem Solving skills. \n• Motivated and guided a team of 20 people. \n• Ensure that team gets proper support from various groups \n• Guide the team in Issue resolution, Problem management and Root cause analysis \n• Deployment of various IT technology initiatives on all the systems across 1000 branches. Experience Problem Manager IBM April 2014  – Present (1 year 5 months) Bengaluru Area / Bangalore, India •\tFunctional Lead for Service Management professionals (Problem Coordinators) \n•\tCollaborate with Account Managers and act as a single focal for all problem related issues \n•\tMentoring and guiding key resources for professional and personal development \n•\tHandle and address day-to-day functional & operational constraints \n•\tDrive effectiveness and efficiency of Problem Management process Liaise with customers, \nIT executive, IT platform managers. Participating in Problem Management meetings and reviews, \n•\tIdentifying Problem Investigation, assignment issues, acting as an initial escalation point  \nfor day-to-day Problem Management issues \n•\tAnalyzing Incidents (especially Critical Incidents) and closed Problems to identify and act  \nupon trends Tracking open Problems and identifying any Problem that requires increased  \nfocus to meet agreed target levels. \n•\tDocument and track all actions to resolution, so that either changes are implemented or  \nRisks Accepted and signed off. Closing any associated Problem Investigations and  \nensuring adequate documentation of the resolution \n•\tImplement a mechanism to record Known Error’s within the account and the  \nassociated workarounds \n•\tEnsuring that lessons learnt are recorded in the various knowledge bases held within the account teams, and shared with all stakeholders \n \nAchievements: \n•\tEnsured that the best possible levels of service quality and availability are  \nmaintained according to the Service Level Agreement. \n•\t35% of Incident reduction seen with usage of Reactive and Proactive methods. \n•\tDeveloped procedures & service standards for business excellence \n•\tDriven productivity and efficiency through identifying wastes and deploying levers RIT and End point security governance PCS Technology Ltd. September 2007  –  April 2014  (6 years 8 months) Goregoan- Mumbai PAN India IT Operations and End point security governance Subject Matter Expert Praxis interactive Technologies Pvt. Ltd. December 2006  –  June 2007  (7 months) \tCoordinating with project manager to prepare plans for the CompTIA A+ project. \n\tProviding technical assistance to writers & graphics designers. \n\tUse to coordinate with U.S. team members for figuring out the error in the completed project & also rectification of the same. Problem Manager IBM April 2014  – Present (1 year 5 months) Bengaluru Area / Bangalore, India •\tFunctional Lead for Service Management professionals (Problem Coordinators) \n•\tCollaborate with Account Managers and act as a single focal for all problem related issues \n•\tMentoring and guiding key resources for professional and personal development \n•\tHandle and address day-to-day functional & operational constraints \n•\tDrive effectiveness and efficiency of Problem Management process Liaise with customers, \nIT executive, IT platform managers. Participating in Problem Management meetings and reviews, \n•\tIdentifying Problem Investigation, assignment issues, acting as an initial escalation point  \nfor day-to-day Problem Management issues \n•\tAnalyzing Incidents (especially Critical Incidents) and closed Problems to identify and act  \nupon trends Tracking open Problems and identifying any Problem that requires increased  \nfocus to meet agreed target levels. \n•\tDocument and track all actions to resolution, so that either changes are implemented or  \nRisks Accepted and signed off. Closing any associated Problem Investigations and  \nensuring adequate documentation of the resolution \n•\tImplement a mechanism to record Known Error’s within the account and the  \nassociated workarounds \n•\tEnsuring that lessons learnt are recorded in the various knowledge bases held within the account teams, and shared with all stakeholders \n \nAchievements: \n•\tEnsured that the best possible levels of service quality and availability are  \nmaintained according to the Service Level Agreement. \n•\t35% of Incident reduction seen with usage of Reactive and Proactive methods. \n•\tDeveloped procedures & service standards for business excellence \n•\tDriven productivity and efficiency through identifying wastes and deploying levers Problem Manager IBM April 2014  – Present (1 year 5 months) Bengaluru Area / Bangalore, India •\tFunctional Lead for Service Management professionals (Problem Coordinators) \n•\tCollaborate with Account Managers and act as a single focal for all problem related issues \n•\tMentoring and guiding key resources for professional and personal development \n•\tHandle and address day-to-day functional & operational constraints \n•\tDrive effectiveness and efficiency of Problem Management process Liaise with customers, \nIT executive, IT platform managers. Participating in Problem Management meetings and reviews, \n•\tIdentifying Problem Investigation, assignment issues, acting as an initial escalation point  \nfor day-to-day Problem Management issues \n•\tAnalyzing Incidents (especially Critical Incidents) and closed Problems to identify and act  \nupon trends Tracking open Problems and identifying any Problem that requires increased  \nfocus to meet agreed target levels. \n•\tDocument and track all actions to resolution, so that either changes are implemented or  \nRisks Accepted and signed off. Closing any associated Problem Investigations and  \nensuring adequate documentation of the resolution \n•\tImplement a mechanism to record Known Error’s within the account and the  \nassociated workarounds \n•\tEnsuring that lessons learnt are recorded in the various knowledge bases held within the account teams, and shared with all stakeholders \n \nAchievements: \n•\tEnsured that the best possible levels of service quality and availability are  \nmaintained according to the Service Level Agreement. \n•\t35% of Incident reduction seen with usage of Reactive and Proactive methods. \n•\tDeveloped procedures & service standards for business excellence \n•\tDriven productivity and efficiency through identifying wastes and deploying levers RIT and End point security governance PCS Technology Ltd. September 2007  –  April 2014  (6 years 8 months) Goregoan- Mumbai PAN India IT Operations and End point security governance RIT and End point security governance PCS Technology Ltd. September 2007  –  April 2014  (6 years 8 months) Goregoan- Mumbai PAN India IT Operations and End point security governance Subject Matter Expert Praxis interactive Technologies Pvt. Ltd. December 2006  –  June 2007  (7 months) \tCoordinating with project manager to prepare plans for the CompTIA A+ project. \n\tProviding technical assistance to writers & graphics designers. \n\tUse to coordinate with U.S. team members for figuring out the error in the completed project & also rectification of the same. Subject Matter Expert Praxis interactive Technologies Pvt. Ltd. December 2006  –  June 2007  (7 months) \tCoordinating with project manager to prepare plans for the CompTIA A+ project. \n\tProviding technical assistance to writers & graphics designers. \n\tUse to coordinate with U.S. team members for figuring out the error in the completed project & also rectification of the same. Skills IT Service Management ITIL Project Management IT Infrastructure... IT Operations Management IT Operations Prince Practitioner Management Program Management Team Management Requirements Analysis Vendor Management Windows Server System Deployment Infrastructure IT Management Service Delivery Security Service Management See 4+     See less Skills  IT Service Management ITIL Project Management IT Infrastructure... IT Operations Management IT Operations Prince Practitioner Management Program Management Team Management Requirements Analysis Vendor Management Windows Server System Deployment Infrastructure IT Management Service Delivery Security Service Management See 4+     See less IT Service Management ITIL Project Management IT Infrastructure... IT Operations Management IT Operations Prince Practitioner Management Program Management Team Management Requirements Analysis Vendor Management Windows Server System Deployment Infrastructure IT Management Service Delivery Security Service Management See 4+     See less IT Service Management ITIL Project Management IT Infrastructure... IT Operations Management IT Operations Prince Practitioner Management Program Management Team Management Requirements Analysis Vendor Management Windows Server System Deployment Infrastructure IT Management Service Delivery Security Service Management See 4+     See less Education University of Mumbai B.E,  Electronics and Telecommunication 2002  – 2006 Engineering in Electronics and Telecommunications S.S.N High School Secondary School Certificate,  English. University of Mumbai B.E,  Electronics and Telecommunication 2002  – 2006 Engineering in Electronics and Telecommunications University of Mumbai B.E,  Electronics and Telecommunication 2002  – 2006 Engineering in Electronics and Telecommunications University of Mumbai B.E,  Electronics and Telecommunication 2002  – 2006 Engineering in Electronics and Telecommunications S.S.N High School Secondary School Certificate,  English. S.S.N High School Secondary School Certificate,  English. S.S.N High School Secondary School Certificate,  English. Honors & Awards Additional Honors & Awards Received best RIT award in 2010-11 from Reliance Life Insurance CTO. Additional Honors & Awards Received best RIT award in 2010-11 from Reliance Life Insurance CTO. Additional Honors & Awards Received best RIT award in 2010-11 from Reliance Life Insurance CTO. Additional Honors & Awards Received best RIT award in 2010-11 from Reliance Life Insurance CTO. ", "Experience Problem Manager IBM India Pvt. Ltd. March 2010  – Present (5 years 6 months) Working as Problem Manager and is responsible for end to end Problem Management(Reactive and Proactive) Problem Manager IBM Canada 2010  –  2014  (4 years) tranee software engg chevron IT solutions pvt. ltd. September 2009  –  January 2010  (5 months) Problem Manager IBM India Pvt. Ltd. March 2010  – Present (5 years 6 months) Working as Problem Manager and is responsible for end to end Problem Management(Reactive and Proactive) Problem Manager IBM India Pvt. Ltd. March 2010  – Present (5 years 6 months) Working as Problem Manager and is responsible for end to end Problem Management(Reactive and Proactive) Problem Manager IBM Canada 2010  –  2014  (4 years) Problem Manager IBM Canada 2010  –  2014  (4 years) tranee software engg chevron IT solutions pvt. ltd. September 2009  –  January 2010  (5 months) tranee software engg chevron IT solutions pvt. ltd. September 2009  –  January 2010  (5 months) Skills Service Operations ITIL v3 Foundations... Release Management Incident Handling Incident Management IT Operations ITIL Certified Service Delivery Problem Management IT Service Management Service Management Configuration Management Vendor Management Skills  Service Operations ITIL v3 Foundations... Release Management Incident Handling Incident Management IT Operations ITIL Certified Service Delivery Problem Management IT Service Management Service Management Configuration Management Vendor Management Service Operations ITIL v3 Foundations... Release Management Incident Handling Incident Management IT Operations ITIL Certified Service Delivery Problem Management IT Service Management Service Management Configuration Management Vendor Management Service Operations ITIL v3 Foundations... Release Management Incident Handling Incident Management IT Operations ITIL Certified Service Delivery Problem Management IT Service Management Service Management Configuration Management Vendor Management Education Bharatidasan University Master of Business Administration (M.B.A.),  IT Operations 2014  – 2016 Currently pursuing MBA in IT Operations. Kendriya Vidhyalaya,Paradip Port Vinayaka Mission's Research Foundation - University Bharatidasan University Master of Business Administration (M.B.A.),  IT Operations 2014  – 2016 Currently pursuing MBA in IT Operations. Bharatidasan University Master of Business Administration (M.B.A.),  IT Operations 2014  – 2016 Currently pursuing MBA in IT Operations. Bharatidasan University Master of Business Administration (M.B.A.),  IT Operations 2014  – 2016 Currently pursuing MBA in IT Operations. Kendriya Vidhyalaya,Paradip Port Kendriya Vidhyalaya,Paradip Port Kendriya Vidhyalaya,Paradip Port Vinayaka Mission's Research Foundation - University Vinayaka Mission's Research Foundation - University Vinayaka Mission's Research Foundation - University ", "Summary A technical engineering professional with my main areas of skill are in Identity and Access Management, and Pre-Post sales). \n \nMy background allows me to concentrate on different areas like access management, security, and system administration. I have been involved in all stages of requirement analysis, network design, capacity planning, and application transport going on to implementation and support thereafter. \n \nLast but not least, I have very good interpersonal skills and I am confident and capable of presenting business/technical solutions in front of customers and industry professionals. \n \n \nGtalk : abhi.m08@gmail.com Summary A technical engineering professional with my main areas of skill are in Identity and Access Management, and Pre-Post sales). \n \nMy background allows me to concentrate on different areas like access management, security, and system administration. I have been involved in all stages of requirement analysis, network design, capacity planning, and application transport going on to implementation and support thereafter. \n \nLast but not least, I have very good interpersonal skills and I am confident and capable of presenting business/technical solutions in front of customers and industry professionals. \n \n \nGtalk : abhi.m08@gmail.com A technical engineering professional with my main areas of skill are in Identity and Access Management, and Pre-Post sales). \n \nMy background allows me to concentrate on different areas like access management, security, and system administration. I have been involved in all stages of requirement analysis, network design, capacity planning, and application transport going on to implementation and support thereafter. \n \nLast but not least, I have very good interpersonal skills and I am confident and capable of presenting business/technical solutions in front of customers and industry professionals. \n \n \nGtalk : abhi.m08@gmail.com A technical engineering professional with my main areas of skill are in Identity and Access Management, and Pre-Post sales). \n \nMy background allows me to concentrate on different areas like access management, security, and system administration. I have been involved in all stages of requirement analysis, network design, capacity planning, and application transport going on to implementation and support thereafter. \n \nLast but not least, I have very good interpersonal skills and I am confident and capable of presenting business/technical solutions in front of customers and industry professionals. \n \n \nGtalk : abhi.m08@gmail.com Experience Problem Manager IBM March 2014  – Present (1 year 6 months) Bangalore • Key services offered include: Command Center Services (includes remote monitoring of servers located worldwide from India, Security operations and network operations), Server Systems Management, IT Secu-rity Services, IT Service Desk, Service Management & Project Management/ Transition Services \n \n• Drive effectiveness and efficiency of Problem Management process Liaise with customers, IT executive, IT platform managers. Participating in Problem Management meetings and reviews, \n \n• Identify Problem Investigation, assignment issues, Acting as an initial escalation point for day-to-day Prob-lem Management issues \n \n• Analyzing Incidents (especially Critical Incidents) and closed Problems to identify and act upon trends Tracking open Problems and identifying any Problem that requires increased focus to meet agreed target levels. \n \n• Providing and validating Problem resolution adhoc status reports as requested \n \n• Handling day-to-day Problem issues and escalating to Resolver Groups when required to ensure targets are met \n \n• Document and track all actions to resolution, so that either changes are implemented or Risks Accepted and signed off. Closing any associated Problem Investigations and ensuring adequate documentation of the reso-lution \n \n• Implement a mechanism to record Known Error’s within the account and the associated workarounds \n \n• Engage with support groups to arrange for and schedule resources / actions, co-ordinate the investigation and solutioning of Known Errors, so that proposals can be made with the options available \n \n• Agreeing closure of Problem Investigations. Project Manager - GPI PADC IBM December 2013  –  March 2014  (4 months) Bangalore Ontime tracking of process asset deployment progress across worldwide pools and accounts \nSetup and perform weekly pools interlocks to capture status / open issues / risks \nWork on logistics and nominations to train the audience and maintain training records \nCollect and maintain required data for the deployment into required online communities \nUpdate deployment status in applicable tools as required \nProvide day to day required support to stream Lead PM to rung the project successfully Workload Manager IBM India Pvt. Ltd October 2010  –  December 2013  (3 years 3 months) Bangalore Role & Responsibilities \n•\tDesign and deliver high quality security architecture and infrastructure setups and/or sub-systems to agreed deadlines.  \n•\tAssist customers in developing a secured Identity/Access management infrastructure and also to define security policies to protect their applications from unauthorized access.  \n•\tLead and own the security solution implementation.  \n•\tActively participate in decision making with solution architect and seek to understand the broader impact of current decisions.  \n•\tFacilitate use of technology-based tools or methodologies to review, design and/or implement products and services.  \n•\tContribute towards training and mentoring the team.  \n•\tDemonstrate knowledge of market trends, new technology and security services.  \n•\tBuild and nurture positive working relationships with clients with the intention to exceed client expectations.  \n•\tUnderstand clients' business environment and basic risk management approaches  \n•\tUser account Creation/Deletion/ Modify in Active Directory, Mainframe, Netware, AS400, Capsil \n•\tCoordinating with third party service providers.  \n•\tHandling Problem Tickets and User calls.  \n•\tWork load Manager - Analyze all incoming work and assign it to appropriate resources, ensuring SLAs are met and that processes as defined by GDF Dispatcher - primary shift. Direct work and projects from multiple clients to groups/individuals in the primary or project pools. Incumbent ensures that the pool works on tasks that ensure normal client operations, implementation of hardware, software, application or network systems, and improvements within a technical work area or process. \n \nKey Deliverables: \n\tActive directory, Group Mailbox, Drive Mapping  \n\tMainframe ( TSOI, TSOD, TSOC, TSOT, TSOE, TSOG) \n\tAS/400 (CC1, KW6,KW7,AW1, AW2, AW3) \n\tCapsil \n\tEcommerce Tools \n\tNetware Administrator \n\tCitrix tools \n\tRemedy 7.5 \n\tCisco VPN & Wireless  \n\tTroubleshoot User profile issue  \n\tKnowledge of Active Directory System Administrator-Flexus Solutions Pvt. Ltd Flexus Solutions September 2009  –  October 2010  (1 year 2 months) Key Deliverables: \n\tManaging System Administration \n\tAccountable for Networking and ISP Coordination \n\tProviding Remote Support and Backup \n\tInvolved in Team Management \n\tInvolved in Server Management \n\tAccountable for Requirement gathering and analysis \n\tAccountable for Designing and implementation of solution \n\tProviding Technical and Functional assistance to the team \n\tTaking initiatives and responsibilities of the team \n\tCoordinating with team and providing with the updates of activity reports  \n\tMaintaining Quality procedures related to the project ASSE Safenet Inc. September 2008  –  August 2009  (1 year) Responsible for Key Deliverables: \n\tManaging System Administration \n\tHandling Networking \n\tProviding Software Lab Support and Remote Support \n\tProviding VoIP Support \n\tProviding Anti virus Support and Hardware Support System Support Executive SafeNet Infotech Pvt. Ltd September 2008  –  August 2009  (1 year) Key Deliverables: \n\tManaging System Administration \n\tHandling Networking \n\tProviding Software Lab Support and Remote Support \n\tProviding VoIP Support \n\tProviding Anti virus Support and Hardware Support IT officer SNEHA Mumbai August 2007  –  March 2008  (8 months) Responsible for all Networking, server and hardware support Problem Manager IBM March 2014  – Present (1 year 6 months) Bangalore • Key services offered include: Command Center Services (includes remote monitoring of servers located worldwide from India, Security operations and network operations), Server Systems Management, IT Secu-rity Services, IT Service Desk, Service Management & Project Management/ Transition Services \n \n• Drive effectiveness and efficiency of Problem Management process Liaise with customers, IT executive, IT platform managers. Participating in Problem Management meetings and reviews, \n \n• Identify Problem Investigation, assignment issues, Acting as an initial escalation point for day-to-day Prob-lem Management issues \n \n• Analyzing Incidents (especially Critical Incidents) and closed Problems to identify and act upon trends Tracking open Problems and identifying any Problem that requires increased focus to meet agreed target levels. \n \n• Providing and validating Problem resolution adhoc status reports as requested \n \n• Handling day-to-day Problem issues and escalating to Resolver Groups when required to ensure targets are met \n \n• Document and track all actions to resolution, so that either changes are implemented or Risks Accepted and signed off. Closing any associated Problem Investigations and ensuring adequate documentation of the reso-lution \n \n• Implement a mechanism to record Known Error’s within the account and the associated workarounds \n \n• Engage with support groups to arrange for and schedule resources / actions, co-ordinate the investigation and solutioning of Known Errors, so that proposals can be made with the options available \n \n• Agreeing closure of Problem Investigations. Problem Manager IBM March 2014  – Present (1 year 6 months) Bangalore • Key services offered include: Command Center Services (includes remote monitoring of servers located worldwide from India, Security operations and network operations), Server Systems Management, IT Secu-rity Services, IT Service Desk, Service Management & Project Management/ Transition Services \n \n• Drive effectiveness and efficiency of Problem Management process Liaise with customers, IT executive, IT platform managers. Participating in Problem Management meetings and reviews, \n \n• Identify Problem Investigation, assignment issues, Acting as an initial escalation point for day-to-day Prob-lem Management issues \n \n• Analyzing Incidents (especially Critical Incidents) and closed Problems to identify and act upon trends Tracking open Problems and identifying any Problem that requires increased focus to meet agreed target levels. \n \n• Providing and validating Problem resolution adhoc status reports as requested \n \n• Handling day-to-day Problem issues and escalating to Resolver Groups when required to ensure targets are met \n \n• Document and track all actions to resolution, so that either changes are implemented or Risks Accepted and signed off. Closing any associated Problem Investigations and ensuring adequate documentation of the reso-lution \n \n• Implement a mechanism to record Known Error’s within the account and the associated workarounds \n \n• Engage with support groups to arrange for and schedule resources / actions, co-ordinate the investigation and solutioning of Known Errors, so that proposals can be made with the options available \n \n• Agreeing closure of Problem Investigations. Project Manager - GPI PADC IBM December 2013  –  March 2014  (4 months) Bangalore Ontime tracking of process asset deployment progress across worldwide pools and accounts \nSetup and perform weekly pools interlocks to capture status / open issues / risks \nWork on logistics and nominations to train the audience and maintain training records \nCollect and maintain required data for the deployment into required online communities \nUpdate deployment status in applicable tools as required \nProvide day to day required support to stream Lead PM to rung the project successfully Project Manager - GPI PADC IBM December 2013  –  March 2014  (4 months) Bangalore Ontime tracking of process asset deployment progress across worldwide pools and accounts \nSetup and perform weekly pools interlocks to capture status / open issues / risks \nWork on logistics and nominations to train the audience and maintain training records \nCollect and maintain required data for the deployment into required online communities \nUpdate deployment status in applicable tools as required \nProvide day to day required support to stream Lead PM to rung the project successfully Workload Manager IBM India Pvt. Ltd October 2010  –  December 2013  (3 years 3 months) Bangalore Role & Responsibilities \n•\tDesign and deliver high quality security architecture and infrastructure setups and/or sub-systems to agreed deadlines.  \n•\tAssist customers in developing a secured Identity/Access management infrastructure and also to define security policies to protect their applications from unauthorized access.  \n•\tLead and own the security solution implementation.  \n•\tActively participate in decision making with solution architect and seek to understand the broader impact of current decisions.  \n•\tFacilitate use of technology-based tools or methodologies to review, design and/or implement products and services.  \n•\tContribute towards training and mentoring the team.  \n•\tDemonstrate knowledge of market trends, new technology and security services.  \n•\tBuild and nurture positive working relationships with clients with the intention to exceed client expectations.  \n•\tUnderstand clients' business environment and basic risk management approaches  \n•\tUser account Creation/Deletion/ Modify in Active Directory, Mainframe, Netware, AS400, Capsil \n•\tCoordinating with third party service providers.  \n•\tHandling Problem Tickets and User calls.  \n•\tWork load Manager - Analyze all incoming work and assign it to appropriate resources, ensuring SLAs are met and that processes as defined by GDF Dispatcher - primary shift. Direct work and projects from multiple clients to groups/individuals in the primary or project pools. Incumbent ensures that the pool works on tasks that ensure normal client operations, implementation of hardware, software, application or network systems, and improvements within a technical work area or process. \n \nKey Deliverables: \n\tActive directory, Group Mailbox, Drive Mapping  \n\tMainframe ( TSOI, TSOD, TSOC, TSOT, TSOE, TSOG) \n\tAS/400 (CC1, KW6,KW7,AW1, AW2, AW3) \n\tCapsil \n\tEcommerce Tools \n\tNetware Administrator \n\tCitrix tools \n\tRemedy 7.5 \n\tCisco VPN & Wireless  \n\tTroubleshoot User profile issue  \n\tKnowledge of Active Directory Workload Manager IBM India Pvt. Ltd October 2010  –  December 2013  (3 years 3 months) Bangalore Role & Responsibilities \n•\tDesign and deliver high quality security architecture and infrastructure setups and/or sub-systems to agreed deadlines.  \n•\tAssist customers in developing a secured Identity/Access management infrastructure and also to define security policies to protect their applications from unauthorized access.  \n•\tLead and own the security solution implementation.  \n•\tActively participate in decision making with solution architect and seek to understand the broader impact of current decisions.  \n•\tFacilitate use of technology-based tools or methodologies to review, design and/or implement products and services.  \n•\tContribute towards training and mentoring the team.  \n•\tDemonstrate knowledge of market trends, new technology and security services.  \n•\tBuild and nurture positive working relationships with clients with the intention to exceed client expectations.  \n•\tUnderstand clients' business environment and basic risk management approaches  \n•\tUser account Creation/Deletion/ Modify in Active Directory, Mainframe, Netware, AS400, Capsil \n•\tCoordinating with third party service providers.  \n•\tHandling Problem Tickets and User calls.  \n•\tWork load Manager - Analyze all incoming work and assign it to appropriate resources, ensuring SLAs are met and that processes as defined by GDF Dispatcher - primary shift. Direct work and projects from multiple clients to groups/individuals in the primary or project pools. Incumbent ensures that the pool works on tasks that ensure normal client operations, implementation of hardware, software, application or network systems, and improvements within a technical work area or process. \n \nKey Deliverables: \n\tActive directory, Group Mailbox, Drive Mapping  \n\tMainframe ( TSOI, TSOD, TSOC, TSOT, TSOE, TSOG) \n\tAS/400 (CC1, KW6,KW7,AW1, AW2, AW3) \n\tCapsil \n\tEcommerce Tools \n\tNetware Administrator \n\tCitrix tools \n\tRemedy 7.5 \n\tCisco VPN & Wireless  \n\tTroubleshoot User profile issue  \n\tKnowledge of Active Directory System Administrator-Flexus Solutions Pvt. Ltd Flexus Solutions September 2009  –  October 2010  (1 year 2 months) Key Deliverables: \n\tManaging System Administration \n\tAccountable for Networking and ISP Coordination \n\tProviding Remote Support and Backup \n\tInvolved in Team Management \n\tInvolved in Server Management \n\tAccountable for Requirement gathering and analysis \n\tAccountable for Designing and implementation of solution \n\tProviding Technical and Functional assistance to the team \n\tTaking initiatives and responsibilities of the team \n\tCoordinating with team and providing with the updates of activity reports  \n\tMaintaining Quality procedures related to the project System Administrator-Flexus Solutions Pvt. Ltd Flexus Solutions September 2009  –  October 2010  (1 year 2 months) Key Deliverables: \n\tManaging System Administration \n\tAccountable for Networking and ISP Coordination \n\tProviding Remote Support and Backup \n\tInvolved in Team Management \n\tInvolved in Server Management \n\tAccountable for Requirement gathering and analysis \n\tAccountable for Designing and implementation of solution \n\tProviding Technical and Functional assistance to the team \n\tTaking initiatives and responsibilities of the team \n\tCoordinating with team and providing with the updates of activity reports  \n\tMaintaining Quality procedures related to the project ASSE Safenet Inc. September 2008  –  August 2009  (1 year) Responsible for Key Deliverables: \n\tManaging System Administration \n\tHandling Networking \n\tProviding Software Lab Support and Remote Support \n\tProviding VoIP Support \n\tProviding Anti virus Support and Hardware Support ASSE Safenet Inc. September 2008  –  August 2009  (1 year) Responsible for Key Deliverables: \n\tManaging System Administration \n\tHandling Networking \n\tProviding Software Lab Support and Remote Support \n\tProviding VoIP Support \n\tProviding Anti virus Support and Hardware Support System Support Executive SafeNet Infotech Pvt. Ltd September 2008  –  August 2009  (1 year) Key Deliverables: \n\tManaging System Administration \n\tHandling Networking \n\tProviding Software Lab Support and Remote Support \n\tProviding VoIP Support \n\tProviding Anti virus Support and Hardware Support System Support Executive SafeNet Infotech Pvt. Ltd September 2008  –  August 2009  (1 year) Key Deliverables: \n\tManaging System Administration \n\tHandling Networking \n\tProviding Software Lab Support and Remote Support \n\tProviding VoIP Support \n\tProviding Anti virus Support and Hardware Support IT officer SNEHA Mumbai August 2007  –  March 2008  (8 months) Responsible for all Networking, server and hardware support IT officer SNEHA Mumbai August 2007  –  March 2008  (8 months) Responsible for all Networking, server and hardware support Languages English Hindi English Hindi English Hindi Skills Security Active Directory System Administration Troubleshooting Cisco Cisco IOS Cisco Technologies Routing Operating Systems VPN Team Management Technical Support Network Design Citrix Networking Requirements Analysis CCNA Hardware Linux Management Red Hat Linux Solaris Help Desk Support Network Administration VoIP DNS Network Security VMware Servers TCP/IP Firewalls Process Improvement Windows Server Unix Microsoft Exchange Virtualization See 21+     See less Skills  Security Active Directory System Administration Troubleshooting Cisco Cisco IOS Cisco Technologies Routing Operating Systems VPN Team Management Technical Support Network Design Citrix Networking Requirements Analysis CCNA Hardware Linux Management Red Hat Linux Solaris Help Desk Support Network Administration VoIP DNS Network Security VMware Servers TCP/IP Firewalls Process Improvement Windows Server Unix Microsoft Exchange Virtualization See 21+     See less Security Active Directory System Administration Troubleshooting Cisco Cisco IOS Cisco Technologies Routing Operating Systems VPN Team Management Technical Support Network Design Citrix Networking Requirements Analysis CCNA Hardware Linux Management Red Hat Linux Solaris Help Desk Support Network Administration VoIP DNS Network Security VMware Servers TCP/IP Firewalls Process Improvement Windows Server Unix Microsoft Exchange Virtualization See 21+     See less Security Active Directory System Administration Troubleshooting Cisco Cisco IOS Cisco Technologies Routing Operating Systems VPN Team Management Technical Support Network Design Citrix Networking Requirements Analysis CCNA Hardware Linux Management Red Hat Linux Solaris Help Desk Support Network Administration VoIP DNS Network Security VMware Servers TCP/IP Firewalls Process Improvement Windows Server Unix Microsoft Exchange Virtualization See 21+     See less Education CDAC Noida in 2008 PGDSDA (Post Graduate Diploma,  System & Database Administration 2008  – 2008 University of Rajasthan B.E,  Computer Science & Engg 2003  – 2007 CDAC Noida in 2008 PGDSDA (Post Graduate Diploma,  System & Database Administration 2008  – 2008 CDAC Noida in 2008 PGDSDA (Post Graduate Diploma,  System & Database Administration 2008  – 2008 CDAC Noida in 2008 PGDSDA (Post Graduate Diploma,  System & Database Administration 2008  – 2008 University of Rajasthan B.E,  Computer Science & Engg 2003  – 2007 University of Rajasthan B.E,  Computer Science & Engg 2003  – 2007 University of Rajasthan B.E,  Computer Science & Engg 2003  – 2007 ", "Experience Technology Manager 2Do Club April 2010  – Present (5 years 5 months) The 2Do Club is a membership based organization creating quality entertainment events within the Antelope Valley.  \n \n\"Looking for something to do? Join the 2Do Club!\" President AVPPNG February 2007  –  April 2010  (3 years 3 months) AVPPNG is the Antelope Valley Professionals Plus Networking Group, a local chapter (Lancaster, CA) of Experience Unlimited which is sponsored by the Employment Development Department and the Department of Labor. Our organization is a no-cost staffing service helping unemployed and underemployed professionals improve their job situations. We are the most successful EU chapter in California, having placed over 400 professional into new jobs using a combination of training programs, networking activities, and marketing events. CEO and Co-Founder The JobTeam Network(SM) September 2009  –  December 2009  (4 months) Our organization is a ZERO-cost staffing service helping unemployed and underemployed professionals improve their job situations. The JobTeam Network's Mission is to help find appropriate employment situations, primarily through a comprehensive business networking structure. We are an organization which provides job seekers with supportive guidance, training, technology, marketing, information sharing, fellowship and community. Membership Relations Manager Palmdale Chamber of Commerce 2009  –  December 2009  (less than a year) Past President Toastmasters July 2007  –  June 2008  (1 year) Past President of Shop Talk Toastmasters, Lancaster California Problem Manager IBM January 2005  –  October 2006  (1 year 10 months) IT Service Management (ITSM/ITIL) role of \"Incident Management\" and executive communications focal point. Problem Manager IBM Global Services 2005  –  2006  (1 year) Information Distribution Center Supervisor PacifiCare January 2001  –  March 2001  (3 months) Supervised nightshift team of six computer operators focused on production and distribution of client data and documentation. Client Analysts International 2000  –  2001  (1 year) Recruited as an Operations Analyst, assigned to PacifiCare Insurance to fill an emergency C2H position. Past President Jaycees November 1989  –  April 1990  (6 months) President of North Hills Jaycees (Northridge, CA). Technology Manager 2Do Club April 2010  – Present (5 years 5 months) The 2Do Club is a membership based organization creating quality entertainment events within the Antelope Valley.  \n \n\"Looking for something to do? Join the 2Do Club!\" Technology Manager 2Do Club April 2010  – Present (5 years 5 months) The 2Do Club is a membership based organization creating quality entertainment events within the Antelope Valley.  \n \n\"Looking for something to do? Join the 2Do Club!\" President AVPPNG February 2007  –  April 2010  (3 years 3 months) AVPPNG is the Antelope Valley Professionals Plus Networking Group, a local chapter (Lancaster, CA) of Experience Unlimited which is sponsored by the Employment Development Department and the Department of Labor. Our organization is a no-cost staffing service helping unemployed and underemployed professionals improve their job situations. We are the most successful EU chapter in California, having placed over 400 professional into new jobs using a combination of training programs, networking activities, and marketing events. President AVPPNG February 2007  –  April 2010  (3 years 3 months) AVPPNG is the Antelope Valley Professionals Plus Networking Group, a local chapter (Lancaster, CA) of Experience Unlimited which is sponsored by the Employment Development Department and the Department of Labor. Our organization is a no-cost staffing service helping unemployed and underemployed professionals improve their job situations. We are the most successful EU chapter in California, having placed over 400 professional into new jobs using a combination of training programs, networking activities, and marketing events. CEO and Co-Founder The JobTeam Network(SM) September 2009  –  December 2009  (4 months) Our organization is a ZERO-cost staffing service helping unemployed and underemployed professionals improve their job situations. The JobTeam Network's Mission is to help find appropriate employment situations, primarily through a comprehensive business networking structure. We are an organization which provides job seekers with supportive guidance, training, technology, marketing, information sharing, fellowship and community. CEO and Co-Founder The JobTeam Network(SM) September 2009  –  December 2009  (4 months) Our organization is a ZERO-cost staffing service helping unemployed and underemployed professionals improve their job situations. The JobTeam Network's Mission is to help find appropriate employment situations, primarily through a comprehensive business networking structure. We are an organization which provides job seekers with supportive guidance, training, technology, marketing, information sharing, fellowship and community. Membership Relations Manager Palmdale Chamber of Commerce 2009  –  December 2009  (less than a year) Membership Relations Manager Palmdale Chamber of Commerce 2009  –  December 2009  (less than a year) Past President Toastmasters July 2007  –  June 2008  (1 year) Past President of Shop Talk Toastmasters, Lancaster California Past President Toastmasters July 2007  –  June 2008  (1 year) Past President of Shop Talk Toastmasters, Lancaster California Problem Manager IBM January 2005  –  October 2006  (1 year 10 months) IT Service Management (ITSM/ITIL) role of \"Incident Management\" and executive communications focal point. Problem Manager IBM January 2005  –  October 2006  (1 year 10 months) IT Service Management (ITSM/ITIL) role of \"Incident Management\" and executive communications focal point. Problem Manager IBM Global Services 2005  –  2006  (1 year) Problem Manager IBM Global Services 2005  –  2006  (1 year) Information Distribution Center Supervisor PacifiCare January 2001  –  March 2001  (3 months) Supervised nightshift team of six computer operators focused on production and distribution of client data and documentation. Information Distribution Center Supervisor PacifiCare January 2001  –  March 2001  (3 months) Supervised nightshift team of six computer operators focused on production and distribution of client data and documentation. Client Analysts International 2000  –  2001  (1 year) Recruited as an Operations Analyst, assigned to PacifiCare Insurance to fill an emergency C2H position. Client Analysts International 2000  –  2001  (1 year) Recruited as an Operations Analyst, assigned to PacifiCare Insurance to fill an emergency C2H position. Past President Jaycees November 1989  –  April 1990  (6 months) President of North Hills Jaycees (Northridge, CA). Past President Jaycees November 1989  –  April 1990  (6 months) President of North Hills Jaycees (Northridge, CA). Education Antelope Valley College Education 2007  – 2008 Horace Mann Antelope Valley College Education 2007  – 2008 Antelope Valley College Education 2007  – 2008 Antelope Valley College Education 2007  – 2008 Horace Mann Horace Mann Horace Mann ", "Experience EMEA Problem Manager IBM Global Services April 2007  – Present (8 years 5 months) Working on the account Electrolux. Facilitate and conduct root cause analysis of major incidents and thus reduce the level and impact of incidents across client sites. Analyze procatively the IT infrastructure and repeating minor incidents to ensure they don't develop to problems. Actively participate in the Service Management Council. EMEA Problem Manager IBM Global Services April 2007  – Present (8 years 5 months) Working on the account Electrolux. Facilitate and conduct root cause analysis of major incidents and thus reduce the level and impact of incidents across client sites. Analyze procatively the IT infrastructure and repeating minor incidents to ensure they don't develop to problems. Actively participate in the Service Management Council. EMEA Problem Manager IBM Global Services April 2007  – Present (8 years 5 months) Working on the account Electrolux. Facilitate and conduct root cause analysis of major incidents and thus reduce the level and impact of incidents across client sites. Analyze procatively the IT infrastructure and repeating minor incidents to ensure they don't develop to problems. Actively participate in the Service Management Council. Education The Philipp University of Marburg 1996  – 2001 The Philipp University of Marburg 1996  – 2001 The Philipp University of Marburg 1996  – 2001 The Philipp University of Marburg 1996  – 2001 ", "Experience Problem manager IBM Global Services April 2015  – Present (5 months) People Manager, Unix and Middleare Services IBM Global Services August 2013  –  March 2015  (1 year 8 months) Storage Services Nordic Team Leader IBM Global Services July 2011  –  July 2013  (2 years 1 month) HR Operations Team Leader & Management Development Specialist IBM Czech Republic August 2009  –  June 2011  (1 year 11 months) HR Talent Management & Management Development Specialist IBM Czech Republic July 2007  –  July 2009  (2 years 1 month) Team Leader SAP & Oracle IBM IDC Brno October 2006  –  June 2007  (9 months) Computer Operator, Documentation Focal Point IBM GSDC Brno July 2003  –  September 2006  (3 years 3 months) Designer Lesprojekt Brno, a.s. May 1999  –  May 2003  (4 years 1 month) Forest-management plan creation Office Manager, Librarian Technical University of Brno November 1995  –  January 1998  (2 years 3 months) Problem manager IBM Global Services April 2015  – Present (5 months) Problem manager IBM Global Services April 2015  – Present (5 months) People Manager, Unix and Middleare Services IBM Global Services August 2013  –  March 2015  (1 year 8 months) People Manager, Unix and Middleare Services IBM Global Services August 2013  –  March 2015  (1 year 8 months) Storage Services Nordic Team Leader IBM Global Services July 2011  –  July 2013  (2 years 1 month) Storage Services Nordic Team Leader IBM Global Services July 2011  –  July 2013  (2 years 1 month) HR Operations Team Leader & Management Development Specialist IBM Czech Republic August 2009  –  June 2011  (1 year 11 months) HR Operations Team Leader & Management Development Specialist IBM Czech Republic August 2009  –  June 2011  (1 year 11 months) HR Talent Management & Management Development Specialist IBM Czech Republic July 2007  –  July 2009  (2 years 1 month) HR Talent Management & Management Development Specialist IBM Czech Republic July 2007  –  July 2009  (2 years 1 month) Team Leader SAP & Oracle IBM IDC Brno October 2006  –  June 2007  (9 months) Team Leader SAP & Oracle IBM IDC Brno October 2006  –  June 2007  (9 months) Computer Operator, Documentation Focal Point IBM GSDC Brno July 2003  –  September 2006  (3 years 3 months) Computer Operator, Documentation Focal Point IBM GSDC Brno July 2003  –  September 2006  (3 years 3 months) Designer Lesprojekt Brno, a.s. May 1999  –  May 2003  (4 years 1 month) Forest-management plan creation Designer Lesprojekt Brno, a.s. May 1999  –  May 2003  (4 years 1 month) Forest-management plan creation Office Manager, Librarian Technical University of Brno November 1995  –  January 1998  (2 years 3 months) Office Manager, Librarian Technical University of Brno November 1995  –  January 1998  (2 years 3 months) Skills Human Resources IT Service Management Team Leadership Talent Management Performance Management Change Management Analysis IT Operations IT Management Business Strategy Leadership SAP ITIL Sla Service Delivery Program Management Recruiting Project Management Data Center Project Delivery Management Disaster Recovery AIX Management Consulting Strategy Team Management Outsourcing Personnel Management HR Consulting System Administration Virtualization IT Strategy Process Improvement Oracle Software Documentation Business Development Business Analysis Vendor Management Project Planning Coaching Incident Management Servers Cross-functional Team... Lotus Notes Integration Service Management Unix IT Outsourcing Training Organizational... See 35+     See less Skills  Human Resources IT Service Management Team Leadership Talent Management Performance Management Change Management Analysis IT Operations IT Management Business Strategy Leadership SAP ITIL Sla Service Delivery Program Management Recruiting Project Management Data Center Project Delivery Management Disaster Recovery AIX Management Consulting Strategy Team Management Outsourcing Personnel Management HR Consulting System Administration Virtualization IT Strategy Process Improvement Oracle Software Documentation Business Development Business Analysis Vendor Management Project Planning Coaching Incident Management Servers Cross-functional Team... Lotus Notes Integration Service Management Unix IT Outsourcing Training Organizational... See 35+     See less Human Resources IT Service Management Team Leadership Talent Management Performance Management Change Management Analysis IT Operations IT Management Business Strategy Leadership SAP ITIL Sla Service Delivery Program Management Recruiting Project Management Data Center Project Delivery Management Disaster Recovery AIX Management Consulting Strategy Team Management Outsourcing Personnel Management HR Consulting System Administration Virtualization IT Strategy Process Improvement Oracle Software Documentation Business Development Business Analysis Vendor Management Project Planning Coaching Incident Management Servers Cross-functional Team... Lotus Notes Integration Service Management Unix IT Outsourcing Training Organizational... See 35+     See less Human Resources IT Service Management Team Leadership Talent Management Performance Management Change Management Analysis IT Operations IT Management Business Strategy Leadership SAP ITIL Sla Service Delivery Program Management Recruiting Project Management Data Center Project Delivery Management Disaster Recovery AIX Management Consulting Strategy Team Management Outsourcing Personnel Management HR Consulting System Administration Virtualization IT Strategy Process Improvement Oracle Software Documentation Business Development Business Analysis Vendor Management Project Planning Coaching Incident Management Servers Cross-functional Team... Lotus Notes Integration Service Management Unix IT Outsourcing Training Organizational... See 35+     See less Education Foundry high school diploma,  Artistic working on metals and precious stones 1989  – 1995 Foundry high school diploma,  Artistic working on metals and precious stones 1989  – 1995 Foundry high school diploma,  Artistic working on metals and precious stones 1989  – 1995 Foundry high school diploma,  Artistic working on metals and precious stones 1989  – 1995 ", "Experience Problem Manager IBM January 2014  – Present (1 year 8 months) Auckland Problem Coordinator Auckland Council February 2012  –  January 2014  (2 years) CBD Desktop Analyst Auckland City Council February 2011  –  January 2012  (1 year) Consoloditated IT Support for NZ Global Gossip August 2008  –  November 2010  (2 years 4 months) Corporate Account Manager Orcon Internet October 2005  –  May 2007  (1 year 8 months) Retail Assistant Dick Smith 2002  –  2004  (2 years) Problem Manager IBM January 2014  – Present (1 year 8 months) Auckland Problem Manager IBM January 2014  – Present (1 year 8 months) Auckland Problem Coordinator Auckland Council February 2012  –  January 2014  (2 years) CBD Problem Coordinator Auckland Council February 2012  –  January 2014  (2 years) CBD Desktop Analyst Auckland City Council February 2011  –  January 2012  (1 year) Desktop Analyst Auckland City Council February 2011  –  January 2012  (1 year) Consoloditated IT Support for NZ Global Gossip August 2008  –  November 2010  (2 years 4 months) Consoloditated IT Support for NZ Global Gossip August 2008  –  November 2010  (2 years 4 months) Corporate Account Manager Orcon Internet October 2005  –  May 2007  (1 year 8 months) Corporate Account Manager Orcon Internet October 2005  –  May 2007  (1 year 8 months) Retail Assistant Dick Smith 2002  –  2004  (2 years) Retail Assistant Dick Smith 2002  –  2004  (2 years) Skills Telecommunications Customer Service ITIL Troubleshooting Process Improvement Project Management Problem Management Account Management Service Delivery Incident Management Public Speaking Business Analysis Technical Support Root Cause Analysis Cross-functional... IT Management IT Service Management Stakeholder Management Service Management See 4+     See less Skills  Telecommunications Customer Service ITIL Troubleshooting Process Improvement Project Management Problem Management Account Management Service Delivery Incident Management Public Speaking Business Analysis Technical Support Root Cause Analysis Cross-functional... IT Management IT Service Management Stakeholder Management Service Management See 4+     See less Telecommunications Customer Service ITIL Troubleshooting Process Improvement Project Management Problem Management Account Management Service Delivery Incident Management Public Speaking Business Analysis Technical Support Root Cause Analysis Cross-functional... IT Management IT Service Management Stakeholder Management Service Management See 4+     See less Telecommunications Customer Service ITIL Troubleshooting Process Improvement Project Management Problem Management Account Management Service Delivery Incident Management Public Speaking Business Analysis Technical Support Root Cause Analysis Cross-functional... IT Management IT Service Management Stakeholder Management Service Management See 4+     See less Education Massey University Bachelor of Business Studies,  Information Systems 2001  – 2003 Northcote College 1996  – 2000 Massey University Bachelor of Business Studies,  Information Systems 2001  – 2003 Massey University Bachelor of Business Studies,  Information Systems 2001  – 2003 Massey University Bachelor of Business Studies,  Information Systems 2001  – 2003 Northcote College 1996  – 2000 Northcote College 1996  – 2000 Northcote College 1996  – 2000 ", "Summary Structured Incident Manager with experience in engaging effectively at all levels of the organization and an effective bridge between operation and business. I have an operational view of processes, how process affects business, organization and customer. \n \nSpecialties: \n- Incident management \n- Task force leader \n- Bring organization and skills together Summary Structured Incident Manager with experience in engaging effectively at all levels of the organization and an effective bridge between operation and business. I have an operational view of processes, how process affects business, organization and customer. \n \nSpecialties: \n- Incident management \n- Task force leader \n- Bring organization and skills together Structured Incident Manager with experience in engaging effectively at all levels of the organization and an effective bridge between operation and business. I have an operational view of processes, how process affects business, organization and customer. \n \nSpecialties: \n- Incident management \n- Task force leader \n- Bring organization and skills together Structured Incident Manager with experience in engaging effectively at all levels of the organization and an effective bridge between operation and business. I have an operational view of processes, how process affects business, organization and customer. \n \nSpecialties: \n- Incident management \n- Task force leader \n- Bring organization and skills together Experience Lead Incident Manager Nordea October 2014  – Present (11 months) Copenhagen Area, Denmark To be added. Lead Incident Manager (Incident transition responsbile) Nordea April 2014  –  October 2014  (7 months) Copenhagen Area, Denmark To be added. Incident Process Manager Nordic Processor September 2012  –  April 2014  (1 year 8 months) Copenhagen Area, Denmark Nordic Incident Manager responsible for Incident Management (including critical incident management) process. \n \nJob profile: Process management, education, tool support, improve and streamline of process/tool/reports. Incident Owner for high priority incident including Task Force leader. \n \nNordic Processor is a jount venture company owned by IBM and Nordea Bank to handle and improve daily operations for Nordea Bank. Nordic Problem Manager Nordic Processor April 2008  –  September 2012  (4 years 6 months) Nordic Problem Manager responsible for Problem Management and Major Incident processes, Service Management. \n \nProcess management, education, application support. \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Nordic Problem & Change Controller Nordic Processor January 2007  –  April 2008  (1 year 4 months) - Leading or participating in task forces / focus groups \n- Follow-up and improve processes \n- Management reporting \n- Business contact \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Problem Manager IBM July 2007  –  August 2007  (2 months) IBM assigned to PBS (Payment Business Services). Problem Manager IBM March 2007  –  June 2007  (4 months) IBM assigned to A.P. Møller Mærsk (APMM). Problem Coordinator Nordic Processor June 2005  –  January 2007  (1 year 8 months) On a Nordic level my main focus areas are: \n \n- Leading or participating in task forces / focus groups \n- Follow-up on problem process \n- Follow-up on problems and deflected activities \n- Team leader \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Back Office Specialist Nordic Processor February 2004  –  June 2005  (1 year 5 months) - Lead or participate task forces \n- Follow-up on problem process \n- Primary contact person between IT and business areas \n- 2nd level support of Service Centers and Helpdesks \n- Follow-up on problems and deflected activities \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Front Office Representative Nordea August 2003  –  February 2004  (7 months) August - November 2003: Nordea \nNovember 2003 - February 2004: Nordic Processor \n \nFirst Nordea, later the joint venture 'Nordic Processor' was created. \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Hotline Agent Unibank May 2000  –  August 2003  (3 years 4 months) 1st and 2nd level support of a wide range vital home / business products. \nSupport of products like these requires good knowledge of: \n \n- Entire Windows platform \n- Troubleshoot of difference connection options (modem / LAN) \n- How to interact / communicate with customers in a (non)technical way \n- Can explain techinical issues \n \nBeside of normal hotline tasks I have: \n- Participated in projects involving above products \n- Held / done user tests \n- Held / done beta tests \n- Ensured issues are documented properly \n- Primary contact between helpdesk department and business areas \n- Team leader \n \nIt started with Unibank, Unibank was later transformed into Nordea. IT Consultant LSG Lufthansa August 2000  –  November 2001  (1 year 4 months) Performed 1st and 2nd level support of all user applications, network devices, printers. Shop Assistant Føtex Lyngby July 1999  –  July 2000  (1 year 1 month) Part-time work. Shop Assistant Føtex Lyngby September 1998  –  July 1999  (11 months) Shop Assistant. \nPart of managering group (responsible for team up to 25 persons) including hiring responsibility. Shop Assistant Føtex Ballerup July 1997  –  September 1998  (1 year 3 months) Shop Assistant.  \nPart of managering group (responsible for team up to 25 persons) including hiring responsibility. Shop Assistant Trainee Føtex Dytmærsken July 1995  –  July 1997  (2 years 1 month) Shop Assistant Trainee Lead Incident Manager Nordea October 2014  – Present (11 months) Copenhagen Area, Denmark To be added. Lead Incident Manager Nordea October 2014  – Present (11 months) Copenhagen Area, Denmark To be added. Lead Incident Manager (Incident transition responsbile) Nordea April 2014  –  October 2014  (7 months) Copenhagen Area, Denmark To be added. Lead Incident Manager (Incident transition responsbile) Nordea April 2014  –  October 2014  (7 months) Copenhagen Area, Denmark To be added. Incident Process Manager Nordic Processor September 2012  –  April 2014  (1 year 8 months) Copenhagen Area, Denmark Nordic Incident Manager responsible for Incident Management (including critical incident management) process. \n \nJob profile: Process management, education, tool support, improve and streamline of process/tool/reports. Incident Owner for high priority incident including Task Force leader. \n \nNordic Processor is a jount venture company owned by IBM and Nordea Bank to handle and improve daily operations for Nordea Bank. Incident Process Manager Nordic Processor September 2012  –  April 2014  (1 year 8 months) Copenhagen Area, Denmark Nordic Incident Manager responsible for Incident Management (including critical incident management) process. \n \nJob profile: Process management, education, tool support, improve and streamline of process/tool/reports. Incident Owner for high priority incident including Task Force leader. \n \nNordic Processor is a jount venture company owned by IBM and Nordea Bank to handle and improve daily operations for Nordea Bank. Nordic Problem Manager Nordic Processor April 2008  –  September 2012  (4 years 6 months) Nordic Problem Manager responsible for Problem Management and Major Incident processes, Service Management. \n \nProcess management, education, application support. \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Nordic Problem Manager Nordic Processor April 2008  –  September 2012  (4 years 6 months) Nordic Problem Manager responsible for Problem Management and Major Incident processes, Service Management. \n \nProcess management, education, application support. \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Nordic Problem & Change Controller Nordic Processor January 2007  –  April 2008  (1 year 4 months) - Leading or participating in task forces / focus groups \n- Follow-up and improve processes \n- Management reporting \n- Business contact \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Nordic Problem & Change Controller Nordic Processor January 2007  –  April 2008  (1 year 4 months) - Leading or participating in task forces / focus groups \n- Follow-up and improve processes \n- Management reporting \n- Business contact \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Problem Manager IBM July 2007  –  August 2007  (2 months) IBM assigned to PBS (Payment Business Services). Problem Manager IBM July 2007  –  August 2007  (2 months) IBM assigned to PBS (Payment Business Services). Problem Manager IBM March 2007  –  June 2007  (4 months) IBM assigned to A.P. Møller Mærsk (APMM). Problem Manager IBM March 2007  –  June 2007  (4 months) IBM assigned to A.P. Møller Mærsk (APMM). Problem Coordinator Nordic Processor June 2005  –  January 2007  (1 year 8 months) On a Nordic level my main focus areas are: \n \n- Leading or participating in task forces / focus groups \n- Follow-up on problem process \n- Follow-up on problems and deflected activities \n- Team leader \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Problem Coordinator Nordic Processor June 2005  –  January 2007  (1 year 8 months) On a Nordic level my main focus areas are: \n \n- Leading or participating in task forces / focus groups \n- Follow-up on problem process \n- Follow-up on problems and deflected activities \n- Team leader \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Back Office Specialist Nordic Processor February 2004  –  June 2005  (1 year 5 months) - Lead or participate task forces \n- Follow-up on problem process \n- Primary contact person between IT and business areas \n- 2nd level support of Service Centers and Helpdesks \n- Follow-up on problems and deflected activities \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Back Office Specialist Nordic Processor February 2004  –  June 2005  (1 year 5 months) - Lead or participate task forces \n- Follow-up on problem process \n- Primary contact person between IT and business areas \n- 2nd level support of Service Centers and Helpdesks \n- Follow-up on problems and deflected activities \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Front Office Representative Nordea August 2003  –  February 2004  (7 months) August - November 2003: Nordea \nNovember 2003 - February 2004: Nordic Processor \n \nFirst Nordea, later the joint venture 'Nordic Processor' was created. \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Front Office Representative Nordea August 2003  –  February 2004  (7 months) August - November 2003: Nordea \nNovember 2003 - February 2004: Nordic Processor \n \nFirst Nordea, later the joint venture 'Nordic Processor' was created. \n \nNordic Processor is a jount venture company owned by IBM (60%) and Nordea Bank (40%) to take care of daily operations for Nordea bank. Hotline Agent Unibank May 2000  –  August 2003  (3 years 4 months) 1st and 2nd level support of a wide range vital home / business products. \nSupport of products like these requires good knowledge of: \n \n- Entire Windows platform \n- Troubleshoot of difference connection options (modem / LAN) \n- How to interact / communicate with customers in a (non)technical way \n- Can explain techinical issues \n \nBeside of normal hotline tasks I have: \n- Participated in projects involving above products \n- Held / done user tests \n- Held / done beta tests \n- Ensured issues are documented properly \n- Primary contact between helpdesk department and business areas \n- Team leader \n \nIt started with Unibank, Unibank was later transformed into Nordea. Hotline Agent Unibank May 2000  –  August 2003  (3 years 4 months) 1st and 2nd level support of a wide range vital home / business products. \nSupport of products like these requires good knowledge of: \n \n- Entire Windows platform \n- Troubleshoot of difference connection options (modem / LAN) \n- How to interact / communicate with customers in a (non)technical way \n- Can explain techinical issues \n \nBeside of normal hotline tasks I have: \n- Participated in projects involving above products \n- Held / done user tests \n- Held / done beta tests \n- Ensured issues are documented properly \n- Primary contact between helpdesk department and business areas \n- Team leader \n \nIt started with Unibank, Unibank was later transformed into Nordea. IT Consultant LSG Lufthansa August 2000  –  November 2001  (1 year 4 months) Performed 1st and 2nd level support of all user applications, network devices, printers. IT Consultant LSG Lufthansa August 2000  –  November 2001  (1 year 4 months) Performed 1st and 2nd level support of all user applications, network devices, printers. Shop Assistant Føtex Lyngby July 1999  –  July 2000  (1 year 1 month) Part-time work. Shop Assistant Føtex Lyngby July 1999  –  July 2000  (1 year 1 month) Part-time work. Shop Assistant Føtex Lyngby September 1998  –  July 1999  (11 months) Shop Assistant. \nPart of managering group (responsible for team up to 25 persons) including hiring responsibility. Shop Assistant Føtex Lyngby September 1998  –  July 1999  (11 months) Shop Assistant. \nPart of managering group (responsible for team up to 25 persons) including hiring responsibility. Shop Assistant Føtex Ballerup July 1997  –  September 1998  (1 year 3 months) Shop Assistant.  \nPart of managering group (responsible for team up to 25 persons) including hiring responsibility. Shop Assistant Føtex Ballerup July 1997  –  September 1998  (1 year 3 months) Shop Assistant.  \nPart of managering group (responsible for team up to 25 persons) including hiring responsibility. Shop Assistant Trainee Føtex Dytmærsken July 1995  –  July 1997  (2 years 1 month) Shop Assistant Trainee Shop Assistant Trainee Føtex Dytmærsken July 1995  –  July 1997  (2 years 1 month) Shop Assistant Trainee Languages Swedish Limited working proficiency Danish Native or bilingual proficiency English Full professional proficiency Swedish Limited working proficiency Danish Native or bilingual proficiency English Full professional proficiency Swedish Limited working proficiency Danish Native or bilingual proficiency English Full professional proficiency Limited working proficiency Native or bilingual proficiency Full professional proficiency Skills Service Management IT Service Management IT Operations Management ITIL Incident Management IT Outsourcing Service Delivery Sla IT Strategy IT Management Outsourcing Service Desk Change Management Disaster Recovery Problem Management Service Improvement Process Management Project Portfolio... Leadership Troubleshooting Project Delivery Solution Architecture Business Process See 9+     See less Skills  Service Management IT Service Management IT Operations Management ITIL Incident Management IT Outsourcing Service Delivery Sla IT Strategy IT Management Outsourcing Service Desk Change Management Disaster Recovery Problem Management Service Improvement Process Management Project Portfolio... Leadership Troubleshooting Project Delivery Solution Architecture Business Process See 9+     See less Service Management IT Service Management IT Operations Management ITIL Incident Management IT Outsourcing Service Delivery Sla IT Strategy IT Management Outsourcing Service Desk Change Management Disaster Recovery Problem Management Service Improvement Process Management Project Portfolio... Leadership Troubleshooting Project Delivery Solution Architecture Business Process See 9+     See less Service Management IT Service Management IT Operations Management ITIL Incident Management IT Outsourcing Service Delivery Sla IT Strategy IT Management Outsourcing Service Desk Change Management Disaster Recovery Problem Management Service Improvement Process Management Project Portfolio... Leadership Troubleshooting Project Delivery Solution Architecture Business Process See 9+     See less Education Ballerup Business College Datamatiker (IT Specialist) 1999  – 2000 Activities and Societies:  Randers Business College (Ballerup Handelsskole)\nCompleted first and second (out of five) semesters. Randers Business College HHX,  Accounting and Business/Management 1992  – 1995 Activities and Societies:  Randers Business College (Handelsskolen i Randers). C. L. Cours Skole 1985  – 1992 Ballerup Business College Datamatiker (IT Specialist) 1999  – 2000 Activities and Societies:  Randers Business College (Ballerup Handelsskole)\nCompleted first and second (out of five) semesters. Ballerup Business College Datamatiker (IT Specialist) 1999  – 2000 Activities and Societies:  Randers Business College (Ballerup Handelsskole)\nCompleted first and second (out of five) semesters. Ballerup Business College Datamatiker (IT Specialist) 1999  – 2000 Activities and Societies:  Randers Business College (Ballerup Handelsskole)\nCompleted first and second (out of five) semesters. Randers Business College HHX,  Accounting and Business/Management 1992  – 1995 Activities and Societies:  Randers Business College (Handelsskolen i Randers). Randers Business College HHX,  Accounting and Business/Management 1992  – 1995 Activities and Societies:  Randers Business College (Handelsskolen i Randers). Randers Business College HHX,  Accounting and Business/Management 1992  – 1995 Activities and Societies:  Randers Business College (Handelsskolen i Randers). C. L. Cours Skole 1985  – 1992 C. L. Cours Skole 1985  – 1992 C. L. Cours Skole 1985  – 1992 ", "Experience Problem Manager IBM March 2010  – Present (5 years 6 months) senior executive Scope International January 2007  –  August 2010  (3 years 8 months) senior executive (Agent Support Group) Sutherland Global Services July 2005  –  January 2007  (1 year 7 months) Problem Manager IBM March 2010  – Present (5 years 6 months) Problem Manager IBM March 2010  – Present (5 years 6 months) senior executive Scope International January 2007  –  August 2010  (3 years 8 months) senior executive Scope International January 2007  –  August 2010  (3 years 8 months) senior executive (Agent Support Group) Sutherland Global Services July 2005  –  January 2007  (1 year 7 months) senior executive (Agent Support Group) Sutherland Global Services July 2005  –  January 2007  (1 year 7 months) Education Jaya Engineering Collage B.E,  Electronics & communication 2001  – 2005 Chinmaya Vidyalaya HSC 1998  – 2001 Jaya Engineering Collage B.E,  Electronics & communication 2001  – 2005 Jaya Engineering Collage B.E,  Electronics & communication 2001  – 2005 Jaya Engineering Collage B.E,  Electronics & communication 2001  – 2005 Chinmaya Vidyalaya HSC 1998  – 2001 Chinmaya Vidyalaya HSC 1998  – 2001 Chinmaya Vidyalaya HSC 1998  – 2001 ", "Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills ITIL Service Desk SQL Databases Change Management Service Delivery IT Service Management Lotus Notes Incident Management Sla Spanish Oracle Problem Management Testing Service Management IT Management IT Operations SLA See 3+     See less Skills  ITIL Service Desk SQL Databases Change Management Service Delivery IT Service Management Lotus Notes Incident Management Sla Spanish Oracle Problem Management Testing Service Management IT Management IT Operations SLA See 3+     See less ITIL Service Desk SQL Databases Change Management Service Delivery IT Service Management Lotus Notes Incident Management Sla Spanish Oracle Problem Management Testing Service Management IT Management IT Operations SLA See 3+     See less ITIL Service Desk SQL Databases Change Management Service Delivery IT Service Management Lotus Notes Incident Management Sla Spanish Oracle Problem Management Testing Service Management IT Management IT Operations SLA See 3+     See less ", "Summary 1.5 year experience in Quality assurance, Defect prevention, Service delivery and Continual service improvement.  \n \n3+ years experience in Service Operations, Service support , IPC Management.  Summary 1.5 year experience in Quality assurance, Defect prevention, Service delivery and Continual service improvement.  \n \n3+ years experience in Service Operations, Service support , IPC Management.  1.5 year experience in Quality assurance, Defect prevention, Service delivery and Continual service improvement.  \n \n3+ years experience in Service Operations, Service support , IPC Management.  1.5 year experience in Quality assurance, Defect prevention, Service delivery and Continual service improvement.  \n \n3+ years experience in Service Operations, Service support , IPC Management.  Experience Problem Manager IBM Czech Republic March 2015  – Present (6 months) District Brno-City, Czech Republic ▪ Performing reactive and proactive problem management. \n▪ Supporting Problem Management reporting (KPIs and customer SLAs). \n▪ Taking part in regular meetings and conference calls about status of problems. \n▪ Finding root cause for a incidents and preventing recurrence of incidents. \n▪ Responsible for the complete process adherence and handling of problems according to SLAs/OLAs \n▪ Responsible for coordinating problem resolution involving internal support groups, vendors, suppliers, customers and managing any roadblocks \n▪ Ensuring that necessary reports (e.g. RCA, Post Implementation Review, etc.) are delivered \n▪ Ensuring quality of Known Error record and the Knowledge Database \n▪ Coordinating with clients, contractors, 3rd parties, etc. to ensure timely problem resolution, contractual fulfillment and managing any roadblocks. Service Delivery & Quality Analyst IBM Czech Republic January 2014  –  February 2015  (1 year 2 months) District Brno-City, Czech Republic ▪ Creating defect prevention investigations. \n▪ Driving the Defect Prevention and RCA process within the pool. \n▪ Preparation of reports for projected impact (before and after) of DPP investigation. \n▪ Preparation of daily & weekly metrics and status of defect prevention process. \n▪ Ensuring that weekly scorecards / RCA / KPI are completed correctly and accurately. \n▪ Under direction of Competency / DAL, creating broadly applicable solutions that are used by pool \nmanagers for process improvements in handling reoccurring problems. \n▪ Tracking SLA metrics, Global GDF metrics, and Compliance metrics. \n▪ Preparing metric updates for core management team. \n▪ Engaging with the account teams and clients to enhance the effectiveness of solutions and to \nincrease the awareness of proactive quality improvements. \n▪ Supporting First Line Manager’s Efficiency targets by driving and prioritizing. \n Mainframe IT Specialist IBM Global Services July 2011  –  February 2014  (2 years 8 months) Brno, Czech Republic ▪ Providing monitoring for customers mainframe infrastructure. \n▪ Responsible for incident detection, isolation and potential resolution. \n▪ Providing general support and troubleshooting for system generated or console monitored alerts, \nactivities and job scheduling functions. \n▪ Under moderate supervision, performing moderately complex tasks associated with IT Operations. \nTasks include monitoring and operating a computer console and/or online terminals, provisioning \nand providing first and second tier technical support to end users on moderately complex issues \nregarding computer operations and networks, installations, setups, error messages, on-line \ntransactions, system status, and downtime procedures, etc. \n▪ Participating in problem/change management activities to minimize impact of service disruptions on \nend users. \n▪ Escalation and progress monitoring of critical issues to relevant teams. \n▪ Mentoring and education of new team members. Improvement and creation of new documents for \nthe internal knowledge base for team use. \n Research Assistant University of Eastern Finland October 2009  –  November 2010  (1 year 2 months) Problem Manager IBM Czech Republic March 2015  – Present (6 months) District Brno-City, Czech Republic ▪ Performing reactive and proactive problem management. \n▪ Supporting Problem Management reporting (KPIs and customer SLAs). \n▪ Taking part in regular meetings and conference calls about status of problems. \n▪ Finding root cause for a incidents and preventing recurrence of incidents. \n▪ Responsible for the complete process adherence and handling of problems according to SLAs/OLAs \n▪ Responsible for coordinating problem resolution involving internal support groups, vendors, suppliers, customers and managing any roadblocks \n▪ Ensuring that necessary reports (e.g. RCA, Post Implementation Review, etc.) are delivered \n▪ Ensuring quality of Known Error record and the Knowledge Database \n▪ Coordinating with clients, contractors, 3rd parties, etc. to ensure timely problem resolution, contractual fulfillment and managing any roadblocks. Problem Manager IBM Czech Republic March 2015  – Present (6 months) District Brno-City, Czech Republic ▪ Performing reactive and proactive problem management. \n▪ Supporting Problem Management reporting (KPIs and customer SLAs). \n▪ Taking part in regular meetings and conference calls about status of problems. \n▪ Finding root cause for a incidents and preventing recurrence of incidents. \n▪ Responsible for the complete process adherence and handling of problems according to SLAs/OLAs \n▪ Responsible for coordinating problem resolution involving internal support groups, vendors, suppliers, customers and managing any roadblocks \n▪ Ensuring that necessary reports (e.g. RCA, Post Implementation Review, etc.) are delivered \n▪ Ensuring quality of Known Error record and the Knowledge Database \n▪ Coordinating with clients, contractors, 3rd parties, etc. to ensure timely problem resolution, contractual fulfillment and managing any roadblocks. Service Delivery & Quality Analyst IBM Czech Republic January 2014  –  February 2015  (1 year 2 months) District Brno-City, Czech Republic ▪ Creating defect prevention investigations. \n▪ Driving the Defect Prevention and RCA process within the pool. \n▪ Preparation of reports for projected impact (before and after) of DPP investigation. \n▪ Preparation of daily & weekly metrics and status of defect prevention process. \n▪ Ensuring that weekly scorecards / RCA / KPI are completed correctly and accurately. \n▪ Under direction of Competency / DAL, creating broadly applicable solutions that are used by pool \nmanagers for process improvements in handling reoccurring problems. \n▪ Tracking SLA metrics, Global GDF metrics, and Compliance metrics. \n▪ Preparing metric updates for core management team. \n▪ Engaging with the account teams and clients to enhance the effectiveness of solutions and to \nincrease the awareness of proactive quality improvements. \n▪ Supporting First Line Manager’s Efficiency targets by driving and prioritizing. \n Service Delivery & Quality Analyst IBM Czech Republic January 2014  –  February 2015  (1 year 2 months) District Brno-City, Czech Republic ▪ Creating defect prevention investigations. \n▪ Driving the Defect Prevention and RCA process within the pool. \n▪ Preparation of reports for projected impact (before and after) of DPP investigation. \n▪ Preparation of daily & weekly metrics and status of defect prevention process. \n▪ Ensuring that weekly scorecards / RCA / KPI are completed correctly and accurately. \n▪ Under direction of Competency / DAL, creating broadly applicable solutions that are used by pool \nmanagers for process improvements in handling reoccurring problems. \n▪ Tracking SLA metrics, Global GDF metrics, and Compliance metrics. \n▪ Preparing metric updates for core management team. \n▪ Engaging with the account teams and clients to enhance the effectiveness of solutions and to \nincrease the awareness of proactive quality improvements. \n▪ Supporting First Line Manager’s Efficiency targets by driving and prioritizing. \n Mainframe IT Specialist IBM Global Services July 2011  –  February 2014  (2 years 8 months) Brno, Czech Republic ▪ Providing monitoring for customers mainframe infrastructure. \n▪ Responsible for incident detection, isolation and potential resolution. \n▪ Providing general support and troubleshooting for system generated or console monitored alerts, \nactivities and job scheduling functions. \n▪ Under moderate supervision, performing moderately complex tasks associated with IT Operations. \nTasks include monitoring and operating a computer console and/or online terminals, provisioning \nand providing first and second tier technical support to end users on moderately complex issues \nregarding computer operations and networks, installations, setups, error messages, on-line \ntransactions, system status, and downtime procedures, etc. \n▪ Participating in problem/change management activities to minimize impact of service disruptions on \nend users. \n▪ Escalation and progress monitoring of critical issues to relevant teams. \n▪ Mentoring and education of new team members. Improvement and creation of new documents for \nthe internal knowledge base for team use. \n Mainframe IT Specialist IBM Global Services July 2011  –  February 2014  (2 years 8 months) Brno, Czech Republic ▪ Providing monitoring for customers mainframe infrastructure. \n▪ Responsible for incident detection, isolation and potential resolution. \n▪ Providing general support and troubleshooting for system generated or console monitored alerts, \nactivities and job scheduling functions. \n▪ Under moderate supervision, performing moderately complex tasks associated with IT Operations. \nTasks include monitoring and operating a computer console and/or online terminals, provisioning \nand providing first and second tier technical support to end users on moderately complex issues \nregarding computer operations and networks, installations, setups, error messages, on-line \ntransactions, system status, and downtime procedures, etc. \n▪ Participating in problem/change management activities to minimize impact of service disruptions on \nend users. \n▪ Escalation and progress monitoring of critical issues to relevant teams. \n▪ Mentoring and education of new team members. Improvement and creation of new documents for \nthe internal knowledge base for team use. \n Research Assistant University of Eastern Finland October 2009  –  November 2010  (1 year 2 months) Research Assistant University of Eastern Finland October 2009  –  November 2010  (1 year 2 months) Languages English Native or bilingual proficiency Urdu Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency Czech Elementary proficiency English Native or bilingual proficiency Urdu Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency Czech Elementary proficiency English Native or bilingual proficiency Urdu Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency Czech Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Java XML HTML SQL Databases ITIL v3 Foundations... System Monitoring Change Management Incident Management JavaScript Linux Subversion Eclipse SOA MySQL Technical Support Troubleshooting Management Microsoft Office IT Operations Information Technology Service Delivery Business Analysis ITIL Quality Assurance Project Management Process Improvement IT Service Management See 13+     See less Skills  Java XML HTML SQL Databases ITIL v3 Foundations... System Monitoring Change Management Incident Management JavaScript Linux Subversion Eclipse SOA MySQL Technical Support Troubleshooting Management Microsoft Office IT Operations Information Technology Service Delivery Business Analysis ITIL Quality Assurance Project Management Process Improvement IT Service Management See 13+     See less Java XML HTML SQL Databases ITIL v3 Foundations... System Monitoring Change Management Incident Management JavaScript Linux Subversion Eclipse SOA MySQL Technical Support Troubleshooting Management Microsoft Office IT Operations Information Technology Service Delivery Business Analysis ITIL Quality Assurance Project Management Process Improvement IT Service Management See 13+     See less Java XML HTML SQL Databases ITIL v3 Foundations... System Monitoring Change Management Incident Management JavaScript Linux Subversion Eclipse SOA MySQL Technical Support Troubleshooting Management Microsoft Office IT Operations Information Technology Service Delivery Business Analysis ITIL Quality Assurance Project Management Process Improvement IT Service Management See 13+     See less Education Kuopion yliopisto Master,  Information Technology 2007  – 2010 Information Technology Activities and Societies:  Kuopio International Student Association Bahria University Bachelor in Software Engineering,  Computer Software Engineering 2003  – 2007 Army Public School & College Kharian Cantt 1992  – 2001 Kuopion yliopisto Master,  Information Technology 2007  – 2010 Information Technology Activities and Societies:  Kuopio International Student Association Kuopion yliopisto Master,  Information Technology 2007  – 2010 Information Technology Activities and Societies:  Kuopio International Student Association Kuopion yliopisto Master,  Information Technology 2007  – 2010 Information Technology Activities and Societies:  Kuopio International Student Association Bahria University Bachelor in Software Engineering,  Computer Software Engineering 2003  – 2007 Bahria University Bachelor in Software Engineering,  Computer Software Engineering 2003  – 2007 Bahria University Bachelor in Software Engineering,  Computer Software Engineering 2003  – 2007 Army Public School & College Kharian Cantt 1992  – 2001 Army Public School & College Kharian Cantt 1992  – 2001 Army Public School & College Kharian Cantt 1992  – 2001 ", "Summary •\tClose to 10 years of experience in IT Infrastructure Management and Service Delivery managing a cross functional services team of 15 members \n•\tManaged 3 projects across different domains of Incident, Change, Problem, Configuration, Asset, Capacity, Availability, Release & Deployment Management \n•\tTravelled onsite to transition them and acted as process and service delivery consultant to other projects having similar support functions \n•\tSix Sigma Yellow Belt Certified \n•\tITIL V3 Foundation and Intermediate Service Operations Certified Summary •\tClose to 10 years of experience in IT Infrastructure Management and Service Delivery managing a cross functional services team of 15 members \n•\tManaged 3 projects across different domains of Incident, Change, Problem, Configuration, Asset, Capacity, Availability, Release & Deployment Management \n•\tTravelled onsite to transition them and acted as process and service delivery consultant to other projects having similar support functions \n•\tSix Sigma Yellow Belt Certified \n•\tITIL V3 Foundation and Intermediate Service Operations Certified •\tClose to 10 years of experience in IT Infrastructure Management and Service Delivery managing a cross functional services team of 15 members \n•\tManaged 3 projects across different domains of Incident, Change, Problem, Configuration, Asset, Capacity, Availability, Release & Deployment Management \n•\tTravelled onsite to transition them and acted as process and service delivery consultant to other projects having similar support functions \n•\tSix Sigma Yellow Belt Certified \n•\tITIL V3 Foundation and Intermediate Service Operations Certified •\tClose to 10 years of experience in IT Infrastructure Management and Service Delivery managing a cross functional services team of 15 members \n•\tManaged 3 projects across different domains of Incident, Change, Problem, Configuration, Asset, Capacity, Availability, Release & Deployment Management \n•\tTravelled onsite to transition them and acted as process and service delivery consultant to other projects having similar support functions \n•\tSix Sigma Yellow Belt Certified \n•\tITIL V3 Foundation and Intermediate Service Operations Certified Experience Critical Incident and Problem Manager IBM August 2013  – Present (2 years 1 month) Manage E2E life cycle of Critical Incidents impacting the business and ensure determination of their Root Cause in a timely manner. Team Lead - Service Management Accenture July 2007  –  May 2013  (5 years 11 months) Gurgaon, India People Management \nDevelop procedures for business excellence, service improvement and innovation initiatives  \nLiaison to administration, attend weekly management meetings \nRun weekly team meetings \nOversee team operations \nProvide supervision/support to team staff \nEnsures that staff see members in the field for at least 50% of their time \nOversee team budget \nMake sure we are following principles, keeping vision and mission in operation \nOversee hiring of staff \nMake sure we are prioritizing our service to members in the best way \nDelegate jobs \nDiscuss issues at meetings \nPerformance management \nDaily administrative and operational responsibilities \nFacilitate Learning and Development for team members \nFacilitate audits Technical Support Executive TeleTech August 2006  –  December 2006  (5 months) Technical Support Executive in the IBM Internal Technical Helpdesk for corporate employees of IBM Australia and New Zealand. \n \nResponsibilities:  \n1. Troubleshooting Lotus Notes Installation, Upgrade, Performance Issues, Mail File Restoration, Backups, Database Access Rights Configuration, Domino Server Replication & Password Resets.  \n2. Troubleshooting IBM Proprietary Virtual Private Network Software for configuration and connectivity related issues with both dial-up and broadband connections. Technical Support Associate Wipro BPO February 2004  –  July 2006  (2 years 6 months) Technical Support Associate in Wipro BPO Solutions Ltd. for CompuServe, Wal-Mart Connect and Netscape Internet Service Providers (subsidiaries of America Online) troubleshooting dial-up and broadband connectivity issues. \n \nResponsibilities:  \n1. Decommissioning invalid dial-up access numbers and adding new ones.  \n2. Configuring the AOL proprietary browser software for broadband access as well as for use with Microsoft Internet Explorer and Mozilla Firefox. \n3. Anti-Virus, Anti-Spyware, Firewall Related Connectivity Issues with the browser and the PC in general. Critical Incident and Problem Manager IBM August 2013  – Present (2 years 1 month) Manage E2E life cycle of Critical Incidents impacting the business and ensure determination of their Root Cause in a timely manner. Critical Incident and Problem Manager IBM August 2013  – Present (2 years 1 month) Manage E2E life cycle of Critical Incidents impacting the business and ensure determination of their Root Cause in a timely manner. Team Lead - Service Management Accenture July 2007  –  May 2013  (5 years 11 months) Gurgaon, India People Management \nDevelop procedures for business excellence, service improvement and innovation initiatives  \nLiaison to administration, attend weekly management meetings \nRun weekly team meetings \nOversee team operations \nProvide supervision/support to team staff \nEnsures that staff see members in the field for at least 50% of their time \nOversee team budget \nMake sure we are following principles, keeping vision and mission in operation \nOversee hiring of staff \nMake sure we are prioritizing our service to members in the best way \nDelegate jobs \nDiscuss issues at meetings \nPerformance management \nDaily administrative and operational responsibilities \nFacilitate Learning and Development for team members \nFacilitate audits Team Lead - Service Management Accenture July 2007  –  May 2013  (5 years 11 months) Gurgaon, India People Management \nDevelop procedures for business excellence, service improvement and innovation initiatives  \nLiaison to administration, attend weekly management meetings \nRun weekly team meetings \nOversee team operations \nProvide supervision/support to team staff \nEnsures that staff see members in the field for at least 50% of their time \nOversee team budget \nMake sure we are following principles, keeping vision and mission in operation \nOversee hiring of staff \nMake sure we are prioritizing our service to members in the best way \nDelegate jobs \nDiscuss issues at meetings \nPerformance management \nDaily administrative and operational responsibilities \nFacilitate Learning and Development for team members \nFacilitate audits Technical Support Executive TeleTech August 2006  –  December 2006  (5 months) Technical Support Executive in the IBM Internal Technical Helpdesk for corporate employees of IBM Australia and New Zealand. \n \nResponsibilities:  \n1. Troubleshooting Lotus Notes Installation, Upgrade, Performance Issues, Mail File Restoration, Backups, Database Access Rights Configuration, Domino Server Replication & Password Resets.  \n2. Troubleshooting IBM Proprietary Virtual Private Network Software for configuration and connectivity related issues with both dial-up and broadband connections. Technical Support Executive TeleTech August 2006  –  December 2006  (5 months) Technical Support Executive in the IBM Internal Technical Helpdesk for corporate employees of IBM Australia and New Zealand. \n \nResponsibilities:  \n1. Troubleshooting Lotus Notes Installation, Upgrade, Performance Issues, Mail File Restoration, Backups, Database Access Rights Configuration, Domino Server Replication & Password Resets.  \n2. Troubleshooting IBM Proprietary Virtual Private Network Software for configuration and connectivity related issues with both dial-up and broadband connections. Technical Support Associate Wipro BPO February 2004  –  July 2006  (2 years 6 months) Technical Support Associate in Wipro BPO Solutions Ltd. for CompuServe, Wal-Mart Connect and Netscape Internet Service Providers (subsidiaries of America Online) troubleshooting dial-up and broadband connectivity issues. \n \nResponsibilities:  \n1. Decommissioning invalid dial-up access numbers and adding new ones.  \n2. Configuring the AOL proprietary browser software for broadband access as well as for use with Microsoft Internet Explorer and Mozilla Firefox. \n3. Anti-Virus, Anti-Spyware, Firewall Related Connectivity Issues with the browser and the PC in general. Technical Support Associate Wipro BPO February 2004  –  July 2006  (2 years 6 months) Technical Support Associate in Wipro BPO Solutions Ltd. for CompuServe, Wal-Mart Connect and Netscape Internet Service Providers (subsidiaries of America Online) troubleshooting dial-up and broadband connectivity issues. \n \nResponsibilities:  \n1. Decommissioning invalid dial-up access numbers and adding new ones.  \n2. Configuring the AOL proprietary browser software for broadband access as well as for use with Microsoft Internet Explorer and Mozilla Firefox. \n3. Anti-Virus, Anti-Spyware, Firewall Related Connectivity Issues with the browser and the PC in general. Languages English Full professional proficiency Tamil Native or bilingual proficiency Hindi Full professional proficiency English Full professional proficiency Tamil Native or bilingual proficiency Hindi Full professional proficiency English Full professional proficiency Tamil Native or bilingual proficiency Hindi Full professional proficiency Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Firewalls Solaris Data Center Technical Support Troubleshooting VPN Hardware Networking Computer Hardware Software Installation Databases Help Desk Support CRM Team Management Outsourcing Service Operations Service Management IT Service Management Service Delivery Customer Service ITIL v3 Foundations... ITIL Certified ITIL Service Strategy ITIL Implementation ITIL Process... ITIL Process Microsoft Office... Microsoft Exchange Microsoft Office Incident Management Change Management Problem Management Configuration Management Asset Management Service Availability Release Management Lean Deployment Six Sigma Capacity Management BMC Remedy Mercury ITG IT Recruitment IT Management IT Operations IT Infrastructure... IT Outsourcing IT Audit IT Strategy Internet Security Key Account Acquisition... See 35+     See less Skills  Firewalls Solaris Data Center Technical Support Troubleshooting VPN Hardware Networking Computer Hardware Software Installation Databases Help Desk Support CRM Team Management Outsourcing Service Operations Service Management IT Service Management Service Delivery Customer Service ITIL v3 Foundations... ITIL Certified ITIL Service Strategy ITIL Implementation ITIL Process... ITIL Process Microsoft Office... Microsoft Exchange Microsoft Office Incident Management Change Management Problem Management Configuration Management Asset Management Service Availability Release Management Lean Deployment Six Sigma Capacity Management BMC Remedy Mercury ITG IT Recruitment IT Management IT Operations IT Infrastructure... IT Outsourcing IT Audit IT Strategy Internet Security Key Account Acquisition... See 35+     See less Firewalls Solaris Data Center Technical Support Troubleshooting VPN Hardware Networking Computer Hardware Software Installation Databases Help Desk Support CRM Team Management Outsourcing Service Operations Service Management IT Service Management Service Delivery Customer Service ITIL v3 Foundations... ITIL Certified ITIL Service Strategy ITIL Implementation ITIL Process... ITIL Process Microsoft Office... Microsoft Exchange Microsoft Office Incident Management Change Management Problem Management Configuration Management Asset Management Service Availability Release Management Lean Deployment Six Sigma Capacity Management BMC Remedy Mercury ITG IT Recruitment IT Management IT Operations IT Infrastructure... IT Outsourcing IT Audit IT Strategy Internet Security Key Account Acquisition... See 35+     See less Firewalls Solaris Data Center Technical Support Troubleshooting VPN Hardware Networking Computer Hardware Software Installation Databases Help Desk Support CRM Team Management Outsourcing Service Operations Service Management IT Service Management Service Delivery Customer Service ITIL v3 Foundations... ITIL Certified ITIL Service Strategy ITIL Implementation ITIL Process... ITIL Process Microsoft Office... Microsoft Exchange Microsoft Office Incident Management Change Management Problem Management Configuration Management Asset Management Service Availability Release Management Lean Deployment Six Sigma Capacity Management BMC Remedy Mercury ITG IT Recruitment IT Management IT Operations IT Infrastructure... IT Outsourcing IT Audit IT Strategy Internet Security Key Account Acquisition... See 35+     See less Education Indira Gandhi National Open University Bachelor,  Computer Applications (BCA) 2004  – 2007 Studied Computer Applications Veermata Jijabai Technical Institute Bachelor of Engineering (B.E.),  Computer Engineering 2000  – 2004 Studied Computer Engineering DTEA Janak Puri 12th Standard,  Science 1998  – 2000 Studied Science Columbia Foundation Sr. Sec. School, Delhi 10th Standard,  Science 1997  – 1998 Studied Science Indira Gandhi National Open University Bachelor,  Computer Applications (BCA) 2004  – 2007 Studied Computer Applications Indira Gandhi National Open University Bachelor,  Computer Applications (BCA) 2004  – 2007 Studied Computer Applications Indira Gandhi National Open University Bachelor,  Computer Applications (BCA) 2004  – 2007 Studied Computer Applications Veermata Jijabai Technical Institute Bachelor of Engineering (B.E.),  Computer Engineering 2000  – 2004 Studied Computer Engineering Veermata Jijabai Technical Institute Bachelor of Engineering (B.E.),  Computer Engineering 2000  – 2004 Studied Computer Engineering Veermata Jijabai Technical Institute Bachelor of Engineering (B.E.),  Computer Engineering 2000  – 2004 Studied Computer Engineering DTEA Janak Puri 12th Standard,  Science 1998  – 2000 Studied Science DTEA Janak Puri 12th Standard,  Science 1998  – 2000 Studied Science DTEA Janak Puri 12th Standard,  Science 1998  – 2000 Studied Science Columbia Foundation Sr. Sec. School, Delhi 10th Standard,  Science 1997  – 1998 Studied Science Columbia Foundation Sr. Sec. School, Delhi 10th Standard,  Science 1997  – 1998 Studied Science Columbia Foundation Sr. Sec. School, Delhi 10th Standard,  Science 1997  – 1998 Studied Science ", "Experience Incident and Problem Manager IBM DRC January 2012  – Present (3 years 8 months) Team Leader of Management System Information (MIS) Airtel DRC December 2008  –  December 2011  (3 years 1 month) MIS TEAM LEADER zain drc 2008  –  2009  (1 year) Incident and Problem Manager IBM DRC January 2012  – Present (3 years 8 months) Incident and Problem Manager IBM DRC January 2012  – Present (3 years 8 months) Team Leader of Management System Information (MIS) Airtel DRC December 2008  –  December 2011  (3 years 1 month) Team Leader of Management System Information (MIS) Airtel DRC December 2008  –  December 2011  (3 years 1 month) MIS TEAM LEADER zain drc 2008  –  2009  (1 year) MIS TEAM LEADER zain drc 2008  –  2009  (1 year) Skills Project Management Telecommunications Network Design Mobile Devices Project Planning Wireless Management Integration Leadership GPRS Skills  Project Management Telecommunications Network Design Mobile Devices Project Planning Wireless Management Integration Leadership GPRS Project Management Telecommunications Network Design Mobile Devices Project Planning Wireless Management Integration Leadership GPRS Project Management Telecommunications Network Design Mobile Devices Project Planning Wireless Management Integration Leadership GPRS ", "Summary Since 2012 in Service Management, Problem Management in particular, bringing the extensive experience from my technical days to the job. \nAt IBM, Service Management plays a crucial role in bringing together several groups and people of different expertise together and shaping the success of the customer. \nIn many cases, I have been able to make a real difference. Summary Since 2012 in Service Management, Problem Management in particular, bringing the extensive experience from my technical days to the job. \nAt IBM, Service Management plays a crucial role in bringing together several groups and people of different expertise together and shaping the success of the customer. \nIn many cases, I have been able to make a real difference. Since 2012 in Service Management, Problem Management in particular, bringing the extensive experience from my technical days to the job. \nAt IBM, Service Management plays a crucial role in bringing together several groups and people of different expertise together and shaping the success of the customer. \nIn many cases, I have been able to make a real difference. Since 2012 in Service Management, Problem Management in particular, bringing the extensive experience from my technical days to the job. \nAt IBM, Service Management plays a crucial role in bringing together several groups and people of different expertise together and shaping the success of the customer. \nIn many cases, I have been able to make a real difference. Experience Problem Manager IBM October 2012  – Present (2 years 11 months) Amsterdam Senior IT Specialist IBM Global Business Services June 2011  – Present (4 years 3 months) Continuing work for ABN AMRO, now for IBM Senior System Administrator HP Enterprise Services October 2009  –  May 2011  (1 year 8 months) Hp bought EDS, and took me as well. I flatter myself that being a compliment. system administrator EDS March 2003  –  September 2009  (6 years 7 months) Design simple and complex OpenVMS clusters, manage them, design and implement web, middleware and networking solutions. System Administrator ABN AMRO 1994  –  2003  (9 years) Support a VMS cluster for a business critical application, support and develop interfacing to other systems, develop and support web applications System Administrator Gemeentewerken, Rotterdam January 1990  –  January 1992  (2 years 1 month) - set up Local Area Vax Cluster for the 'Leidingen' GIS system \n- DCL scripting for backup, system management and night batch System Administrator Philips Nijmegen January 1989  –  January 1990  (1 year 1 month) - - Trained and coached operators; Produced various support programs in DCL and C System Administrator Elsevier Science Publishers January 1988  –  January 1989  (1 year 1 month) - Trained and coached new operators; Provided technical support for daily procedures Director Dromedaris, Enkhuizen January 1984  –  January 1985  (1 year 1 month) Sampler Royal Sluis seeds January 1977  –  January 1979  (2 years 1 month) Problem Manager IBM October 2012  – Present (2 years 11 months) Amsterdam Problem Manager IBM October 2012  – Present (2 years 11 months) Amsterdam Senior IT Specialist IBM Global Business Services June 2011  – Present (4 years 3 months) Continuing work for ABN AMRO, now for IBM Senior IT Specialist IBM Global Business Services June 2011  – Present (4 years 3 months) Continuing work for ABN AMRO, now for IBM Senior System Administrator HP Enterprise Services October 2009  –  May 2011  (1 year 8 months) Hp bought EDS, and took me as well. I flatter myself that being a compliment. Senior System Administrator HP Enterprise Services October 2009  –  May 2011  (1 year 8 months) Hp bought EDS, and took me as well. I flatter myself that being a compliment. system administrator EDS March 2003  –  September 2009  (6 years 7 months) Design simple and complex OpenVMS clusters, manage them, design and implement web, middleware and networking solutions. system administrator EDS March 2003  –  September 2009  (6 years 7 months) Design simple and complex OpenVMS clusters, manage them, design and implement web, middleware and networking solutions. System Administrator ABN AMRO 1994  –  2003  (9 years) Support a VMS cluster for a business critical application, support and develop interfacing to other systems, develop and support web applications System Administrator ABN AMRO 1994  –  2003  (9 years) Support a VMS cluster for a business critical application, support and develop interfacing to other systems, develop and support web applications System Administrator Gemeentewerken, Rotterdam January 1990  –  January 1992  (2 years 1 month) - set up Local Area Vax Cluster for the 'Leidingen' GIS system \n- DCL scripting for backup, system management and night batch System Administrator Gemeentewerken, Rotterdam January 1990  –  January 1992  (2 years 1 month) - set up Local Area Vax Cluster for the 'Leidingen' GIS system \n- DCL scripting for backup, system management and night batch System Administrator Philips Nijmegen January 1989  –  January 1990  (1 year 1 month) - - Trained and coached operators; Produced various support programs in DCL and C System Administrator Philips Nijmegen January 1989  –  January 1990  (1 year 1 month) - - Trained and coached operators; Produced various support programs in DCL and C System Administrator Elsevier Science Publishers January 1988  –  January 1989  (1 year 1 month) - Trained and coached new operators; Provided technical support for daily procedures System Administrator Elsevier Science Publishers January 1988  –  January 1989  (1 year 1 month) - Trained and coached new operators; Provided technical support for daily procedures Director Dromedaris, Enkhuizen January 1984  –  January 1985  (1 year 1 month) Director Dromedaris, Enkhuizen January 1984  –  January 1985  (1 year 1 month) Sampler Royal Sluis seeds January 1977  –  January 1979  (2 years 1 month) Sampler Royal Sluis seeds January 1977  –  January 1979  (2 years 1 month) Skills DNS DCL C IP Networking Web Applications VMS Clustering HP Automation Middleware System Administration Apache Scripting Cluster Solaris IP TCP/IP HP-UX Shell Scripting Unix AIX Virtualization Problem Solving Enterprise Architecture ITIL High Availability IT Management Red Hat Linux Technical Support IT Service Management Disaster Recovery Incident Management Storage SAN Data Center Systems Management Service Management Operating Systems See 23+     See less Skills  DNS DCL C IP Networking Web Applications VMS Clustering HP Automation Middleware System Administration Apache Scripting Cluster Solaris IP TCP/IP HP-UX Shell Scripting Unix AIX Virtualization Problem Solving Enterprise Architecture ITIL High Availability IT Management Red Hat Linux Technical Support IT Service Management Disaster Recovery Incident Management Storage SAN Data Center Systems Management Service Management Operating Systems See 23+     See less DNS DCL C IP Networking Web Applications VMS Clustering HP Automation Middleware System Administration Apache Scripting Cluster Solaris IP TCP/IP HP-UX Shell Scripting Unix AIX Virtualization Problem Solving Enterprise Architecture ITIL High Availability IT Management Red Hat Linux Technical Support IT Service Management Disaster Recovery Incident Management Storage SAN Data Center Systems Management Service Management Operating Systems See 23+     See less DNS DCL C IP Networking Web Applications VMS Clustering HP Automation Middleware System Administration Apache Scripting Cluster Solaris IP TCP/IP HP-UX Shell Scripting Unix AIX Virtualization Problem Solving Enterprise Architecture ITIL High Availability IT Management Red Hat Linux Technical Support IT Service Management Disaster Recovery Incident Management Storage SAN Data Center Systems Management Service Management Operating Systems See 23+     See less Education University of Amsterdam -,  Arabic 1979  – 1983 Rijksscholengemeenschap West-Friesland, Hoorn University of Amsterdam -,  Arabic 1979  – 1983 University of Amsterdam -,  Arabic 1979  – 1983 University of Amsterdam -,  Arabic 1979  – 1983 Rijksscholengemeenschap West-Friesland, Hoorn Rijksscholengemeenschap West-Friesland, Hoorn Rijksscholengemeenschap West-Friesland, Hoorn ", "Summary A result oriented & customer focused consultant with 18+ years in IT Service Management. Using ITSM Best Practices such as ITIL, TQM, CMMI, & practical experience he has gained, has helped many Large Companies align their IT functions to their business objectives. Carl is a realist with the belief that process & organizational alignment is at the foundation to all IT functions & importance of quick wins and actual implementation. His strong desire to be part of a client's success in supporting their business needs is at the core of his commitment to achievement. In 1995 he was the appointed Problem Manager for IBM at JPMorgan Japan and while there designed a model that incorporated “Business Aligned Satellite Desks” to improve first line closure rates & implement clustered ITIL Process in a Distributed Manner, all done while balancing a chaotic trade floor. Carl has consulted and delivered Solutions for Morgan Stanley, Citibank, Sumitomo, Northrop Grumman, Kroger, Anthem Insurance, ADB & others while consulting for firms such as IBM & EDS. Positions he has implemented (owned) and passed on consist of Service Desk Manager, Change Manager, Problem Manager, Configuration Manager, Service Level Manager & other ITIL Positions for adoption such as trainer, Process Manager to name a few. All this accomplished during 3 large mergers, involvement in various IT continuity/BCP sites and supporting other Asia Pacific locations such as Singapore & Hong Kong.  \n \nAfter his return to the US (2001) he engaged ITIL projects in Several Fortune 50 companies & the roadmap for the Pentagon (LM Office). \n \nHe is a frequent speaker in the ITSM world & certified ITIL learners all over the globe, & has a passion for knowledge sharing.  \n \nCarl currently resides back in Asia & currently calls the Philippines and Japan his home. & still rolls up his sleeves to dig into projects and enjoys passing on lessons learnt whenever he has time. Specialties:ITIL EXIN Accredited Trainer \nSix Sigma Black Belt \nITAM Expert \nISO2000 Consultant \nCobit Accredited Trainer Summary A result oriented & customer focused consultant with 18+ years in IT Service Management. Using ITSM Best Practices such as ITIL, TQM, CMMI, & practical experience he has gained, has helped many Large Companies align their IT functions to their business objectives. Carl is a realist with the belief that process & organizational alignment is at the foundation to all IT functions & importance of quick wins and actual implementation. His strong desire to be part of a client's success in supporting their business needs is at the core of his commitment to achievement. In 1995 he was the appointed Problem Manager for IBM at JPMorgan Japan and while there designed a model that incorporated “Business Aligned Satellite Desks” to improve first line closure rates & implement clustered ITIL Process in a Distributed Manner, all done while balancing a chaotic trade floor. Carl has consulted and delivered Solutions for Morgan Stanley, Citibank, Sumitomo, Northrop Grumman, Kroger, Anthem Insurance, ADB & others while consulting for firms such as IBM & EDS. Positions he has implemented (owned) and passed on consist of Service Desk Manager, Change Manager, Problem Manager, Configuration Manager, Service Level Manager & other ITIL Positions for adoption such as trainer, Process Manager to name a few. All this accomplished during 3 large mergers, involvement in various IT continuity/BCP sites and supporting other Asia Pacific locations such as Singapore & Hong Kong.  \n \nAfter his return to the US (2001) he engaged ITIL projects in Several Fortune 50 companies & the roadmap for the Pentagon (LM Office). \n \nHe is a frequent speaker in the ITSM world & certified ITIL learners all over the globe, & has a passion for knowledge sharing.  \n \nCarl currently resides back in Asia & currently calls the Philippines and Japan his home. & still rolls up his sleeves to dig into projects and enjoys passing on lessons learnt whenever he has time. Specialties:ITIL EXIN Accredited Trainer \nSix Sigma Black Belt \nITAM Expert \nISO2000 Consultant \nCobit Accredited Trainer A result oriented & customer focused consultant with 18+ years in IT Service Management. Using ITSM Best Practices such as ITIL, TQM, CMMI, & practical experience he has gained, has helped many Large Companies align their IT functions to their business objectives. Carl is a realist with the belief that process & organizational alignment is at the foundation to all IT functions & importance of quick wins and actual implementation. His strong desire to be part of a client's success in supporting their business needs is at the core of his commitment to achievement. In 1995 he was the appointed Problem Manager for IBM at JPMorgan Japan and while there designed a model that incorporated “Business Aligned Satellite Desks” to improve first line closure rates & implement clustered ITIL Process in a Distributed Manner, all done while balancing a chaotic trade floor. Carl has consulted and delivered Solutions for Morgan Stanley, Citibank, Sumitomo, Northrop Grumman, Kroger, Anthem Insurance, ADB & others while consulting for firms such as IBM & EDS. Positions he has implemented (owned) and passed on consist of Service Desk Manager, Change Manager, Problem Manager, Configuration Manager, Service Level Manager & other ITIL Positions for adoption such as trainer, Process Manager to name a few. All this accomplished during 3 large mergers, involvement in various IT continuity/BCP sites and supporting other Asia Pacific locations such as Singapore & Hong Kong.  \n \nAfter his return to the US (2001) he engaged ITIL projects in Several Fortune 50 companies & the roadmap for the Pentagon (LM Office). \n \nHe is a frequent speaker in the ITSM world & certified ITIL learners all over the globe, & has a passion for knowledge sharing.  \n \nCarl currently resides back in Asia & currently calls the Philippines and Japan his home. & still rolls up his sleeves to dig into projects and enjoys passing on lessons learnt whenever he has time. Specialties:ITIL EXIN Accredited Trainer \nSix Sigma Black Belt \nITAM Expert \nISO2000 Consultant \nCobit Accredited Trainer A result oriented & customer focused consultant with 18+ years in IT Service Management. Using ITSM Best Practices such as ITIL, TQM, CMMI, & practical experience he has gained, has helped many Large Companies align their IT functions to their business objectives. Carl is a realist with the belief that process & organizational alignment is at the foundation to all IT functions & importance of quick wins and actual implementation. His strong desire to be part of a client's success in supporting their business needs is at the core of his commitment to achievement. In 1995 he was the appointed Problem Manager for IBM at JPMorgan Japan and while there designed a model that incorporated “Business Aligned Satellite Desks” to improve first line closure rates & implement clustered ITIL Process in a Distributed Manner, all done while balancing a chaotic trade floor. Carl has consulted and delivered Solutions for Morgan Stanley, Citibank, Sumitomo, Northrop Grumman, Kroger, Anthem Insurance, ADB & others while consulting for firms such as IBM & EDS. Positions he has implemented (owned) and passed on consist of Service Desk Manager, Change Manager, Problem Manager, Configuration Manager, Service Level Manager & other ITIL Positions for adoption such as trainer, Process Manager to name a few. All this accomplished during 3 large mergers, involvement in various IT continuity/BCP sites and supporting other Asia Pacific locations such as Singapore & Hong Kong.  \n \nAfter his return to the US (2001) he engaged ITIL projects in Several Fortune 50 companies & the roadmap for the Pentagon (LM Office). \n \nHe is a frequent speaker in the ITSM world & certified ITIL learners all over the globe, & has a passion for knowledge sharing.  \n \nCarl currently resides back in Asia & currently calls the Philippines and Japan his home. & still rolls up his sleeves to dig into projects and enjoys passing on lessons learnt whenever he has time. Specialties:ITIL EXIN Accredited Trainer \nSix Sigma Black Belt \nITAM Expert \nISO2000 Consultant \nCobit Accredited Trainer Languages Japanese Japanese Japanese Skills Six Sigma IT Asset Management ITIL IT Service Management Service Management IT Strategy IT Management Governance COBIT CMMI IT Operations Project Portfolio... Outsourcing Service Delivery Business Continuity Change Management Management Integration Information Technology Solution Architecture See 5+     See less Skills  Six Sigma IT Asset Management ITIL IT Service Management Service Management IT Strategy IT Management Governance COBIT CMMI IT Operations Project Portfolio... Outsourcing Service Delivery Business Continuity Change Management Management Integration Information Technology Solution Architecture See 5+     See less Six Sigma IT Asset Management ITIL IT Service Management Service Management IT Strategy IT Management Governance COBIT CMMI IT Operations Project Portfolio... Outsourcing Service Delivery Business Continuity Change Management Management Integration Information Technology Solution Architecture See 5+     See less Six Sigma IT Asset Management ITIL IT Service Management Service Management IT Strategy IT Management Governance COBIT CMMI IT Operations Project Portfolio... Outsourcing Service Delivery Business Continuity Change Management Management Integration Information Technology Solution Architecture See 5+     See less ", "Experience Problem Manager IBM Problem Manager IBM Problem Manager IBM Education DePaul University 2000  – 2003 DePaul University 2000  – 2003 DePaul University 2000  – 2003 DePaul University 2000  – 2003 "]}