{"position": "Process Engineering Manager", "company": "Intel Corporation", "profiles": ["Experience Sr. STEM Strategist Intel Corporation May 2014  – Present (1 year 4 months) Chandler, AZ Lead global strategies for Science, Technology, Engineering and Mathematics (STEM) outreach and engagement for K12 students, with particular emphasis on Girls in STEM. University Programs Manager Intel Corporation August 2010  – Present (5 years 1 month) As a team member of Intel Labs University Program Office, Gabriela is responsible for planning, implementing, and driving academic strategies and programs for Intel’s engagement at select universities in the United States, Europe and Latin America. She is also responsible for aligning with and leveraging Intel’s research groups, business units, Intel sites, college recruiting and diversity objectives. Gabriela represents Intel’s University Programs and policy within Intel and external academic partners. In this role, she also develops long term funding models for specific academic programs by partnering with the Intel Foundation, Sr. STEM Strategist Intel Corporation May 2014  – Present (1 year 4 months) Chandler, AZ Lead global strategies for Science, Technology, Engineering and Mathematics (STEM) outreach and engagement for K12 students, with particular emphasis on Girls in STEM. Sr. STEM Strategist Intel Corporation May 2014  – Present (1 year 4 months) Chandler, AZ Lead global strategies for Science, Technology, Engineering and Mathematics (STEM) outreach and engagement for K12 students, with particular emphasis on Girls in STEM. University Programs Manager Intel Corporation August 2010  – Present (5 years 1 month) As a team member of Intel Labs University Program Office, Gabriela is responsible for planning, implementing, and driving academic strategies and programs for Intel’s engagement at select universities in the United States, Europe and Latin America. She is also responsible for aligning with and leveraging Intel’s research groups, business units, Intel sites, college recruiting and diversity objectives. Gabriela represents Intel’s University Programs and policy within Intel and external academic partners. In this role, she also develops long term funding models for specific academic programs by partnering with the Intel Foundation, University Programs Manager Intel Corporation August 2010  – Present (5 years 1 month) As a team member of Intel Labs University Program Office, Gabriela is responsible for planning, implementing, and driving academic strategies and programs for Intel’s engagement at select universities in the United States, Europe and Latin America. She is also responsible for aligning with and leveraging Intel’s research groups, business units, Intel sites, college recruiting and diversity objectives. Gabriela represents Intel’s University Programs and policy within Intel and external academic partners. In this role, she also develops long term funding models for specific academic programs by partnering with the Intel Foundation, Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Program Management Process Improvement Start-ups Intel Semiconductors Management Semiconductor Industry Design of Experiments JMP SPC Failure Analysis Project Planning IC Engineering Management Metrology Lean Manufacturing Cross-functional Team... Six Sigma Manufacturing Process Engineering Thin Films See 6+     See less Skills  Program Management Process Improvement Start-ups Intel Semiconductors Management Semiconductor Industry Design of Experiments JMP SPC Failure Analysis Project Planning IC Engineering Management Metrology Lean Manufacturing Cross-functional Team... Six Sigma Manufacturing Process Engineering Thin Films See 6+     See less Program Management Process Improvement Start-ups Intel Semiconductors Management Semiconductor Industry Design of Experiments JMP SPC Failure Analysis Project Planning IC Engineering Management Metrology Lean Manufacturing Cross-functional Team... Six Sigma Manufacturing Process Engineering Thin Films See 6+     See less Program Management Process Improvement Start-ups Intel Semiconductors Management Semiconductor Industry Design of Experiments JMP SPC Failure Analysis Project Planning IC Engineering Management Metrology Lean Manufacturing Cross-functional Team... Six Sigma Manufacturing Process Engineering Thin Films See 6+     See less ", "Summary • 8+ yrs of experience of leadership in the military as a Commissioned Officer \n• Process Engineering Manager since 2004 \n• Experience as a Supervisor of technician teams since 1991 \n• Experience as a Process Engineering; including leadership & facilitator roles on engineering teams since 1991 \n \nSpecialties: Technical leadership of engineering teams in strategic and tactical improvement efforts for process engineering: equipment and defect troubleshooting/root cause analysis of issues and implementation of solutions to prevent re-occurrence; process improvement development and implementation. Summary • 8+ yrs of experience of leadership in the military as a Commissioned Officer \n• Process Engineering Manager since 2004 \n• Experience as a Supervisor of technician teams since 1991 \n• Experience as a Process Engineering; including leadership & facilitator roles on engineering teams since 1991 \n \nSpecialties: Technical leadership of engineering teams in strategic and tactical improvement efforts for process engineering: equipment and defect troubleshooting/root cause analysis of issues and implementation of solutions to prevent re-occurrence; process improvement development and implementation. • 8+ yrs of experience of leadership in the military as a Commissioned Officer \n• Process Engineering Manager since 2004 \n• Experience as a Supervisor of technician teams since 1991 \n• Experience as a Process Engineering; including leadership & facilitator roles on engineering teams since 1991 \n \nSpecialties: Technical leadership of engineering teams in strategic and tactical improvement efforts for process engineering: equipment and defect troubleshooting/root cause analysis of issues and implementation of solutions to prevent re-occurrence; process improvement development and implementation. • 8+ yrs of experience of leadership in the military as a Commissioned Officer \n• Process Engineering Manager since 2004 \n• Experience as a Supervisor of technician teams since 1991 \n• Experience as a Process Engineering; including leadership & facilitator roles on engineering teams since 1991 \n \nSpecialties: Technical leadership of engineering teams in strategic and tactical improvement efforts for process engineering: equipment and defect troubleshooting/root cause analysis of issues and implementation of solutions to prevent re-occurrence; process improvement development and implementation. Experience Fab & Facilities Process Engineering Manager Intel Corporation October 2010  – Present (4 years 11 months) Engineering Manager for Subfab Facility Systems that consists of Bulk Chemical Delivery (BCD), Gas Specialty Engineering (GSE), Vacuum System Engineering (VSE), Thermal Processing Unit (TPU) (i.e. abatement systems), Life Safety Systems (LSS) for chemical sensing, Emergency Response Team (ERT), and Medical Response Team (MRT). Also, responsible for Cross Module Support (CMS) module which deals with wafer support systems such as wafer container management, wafer lot splitting, wafer carrier cleaning, and wafer lot plan editing. Responsible for supporting uninterrupted manufacturing operations by driving robust root cause solutions to be implemented. Accountable for maintenance performance against the metrics of safety, reliability/quality, environmental, and cost. Drive on-going improvement effort to optimize system utility efficiency. Ensuring improvement and recovery projects meet design criteria and system reliability needs. Significant Accomplishment: Implementing engineering robustness methodology that resulted in an improvement of over 80% reduction in unscheduled maintenance. Club Owner/Chief Martial Arts Instructor Newberg Family Martial Arts June 1982  – Present (33 years 3 months) Newberg, OR Martial Arts practitioner since 1982. Certified martial arts instructor since 2008. 3rd Degree Black Belt in Tae Kwon Do from National Korean Martial Arts Assoc. Also a 1st Degree Black Belt (shodan) in American Shaolin Kempo Karate, 2nd Degree Black Belt (nidan) in American Karate-Jutsu and Purple Belt (shichi kyu) in American Ju-Jutsu from Kazato-Hen Jutsu (KHJ) Combat Systems under International Alliance of Jutsu Arts Organization, which is a practical self-defense style that it is kata focused and provides complete ground (ju jutsu), stand-up (karate jutsu), and take down/throw (aiki jutsu) Martial Art techniques. NFMA is a Dragon Martial Arts LLC company. School link: www.newbergfamilymartialarts.com Co-Owner/Cake Decorating Asst. Bon Bon's May 2008  – Present (7 years 4 months) Newberg, OR Specializing in wedding cakes and special event desserts. www.facebook.com/bon.bons.desserts Owner/Armed Security Professional Stalwart Security Services March 2014  – Present (1 year 6 months) Portland Oregon Providing armed and unarmed personal security services for the local Portland Area. Stalwart Security Services is a Dragon Martial Arts LLC company. Facilities Process Engineering Manager Intel Corporation February 2008  –  October 2010  (2 years 9 months) Operations Manager for D1C Waste Systems and manager for Oregon FSM/TD Hazmat operations; included management of collection and treatment systems and execution of bulk gas operations. Hazmat operations scope was both hazardous material and hazardous waste shipment execution in compliance with government regulations (RCRA, DOT, FFA). Managed Aloha Fab Mechanical and Process systems consisting of process chill water, critical process chill water, tool exhaust, ultra pure water (18 Mohms), and waste systems, and non-critical bulk gas systems (nitrogen, argon, hydrogen, helium). Managed both engineering and technician resources to support uninterrupted facility operations. Responsible for the ongoing physical facilities maintenance performance of facility systems against the metrics of safety, reliability/quality, environmental, and cost. Ensuring systems operate as intended without impact to microprocessor Fab. Ensure on-going improvement effort to optimize system utility efficiency. Ensuring improvement and recovery projects meet design criteria and system reliability needs. Significant Accomplishment: 1) Improved operational execution with implementation of Engineering Led and Lean Manufacturing philosophy into Waste Systems, 2) implemented an internal audit scheme for hazmat operations that improved compliance robustness that was recognized by Corporate Hazmat as a best known method, 3) implemented engineering led planning allowing for DMW capacity planning, improved statistical trend analysis of facility systems, and contingency planning for site nitrogen capacity, 4) provided leadership in two re-organization efforts resulting in minimal disruption to operations that delivered improved customer relations and implemented world class labor efficiency. Lithography Fab Process Engineering Manager Intel Corporation September 2004  –  April 2008  (3 years 8 months) Responsible for the execution of a microelectronic fabrication Lithography area; which constituted 20% of plant. Responsible for the management on the execution of Safety, Quality and Cost Effective Output for a group consisting of $40+ million of capital equipment, 17 Lithography process modules, 8 engineers, and 16 technicians. Provided technical leadership, program management, and organizational development. Led strategic initiatives to ensure business objectives consistently met. Ensured tactical responses were thorough and assisted in determining root cause analysis and solution implementation. Developed and maintained effective working relationships with related processes management and stakeholders. Provided daily updates to senior factory management on issues affecting output performance. Led team through the implementation of Lean Manufacturing philosophy. Significant Accomplishment: 1) Start-up of organization from construction to 10,000 wafer start per week capacity; 2) leader of 5 lithography technology transfers Sr. Chemical Process Lithography Engineer Intel Corporation May 1998  –  September 2004  (6 years 5 months) Responsible for tool module sustaining and continuous improvement involving: equipment troubleshooting, supervision of twenty technicians, recipe development, process improvement development and implementation, product material disposition, root cause analysis of issues and implementation of solutions to prevent reoccurrence, leadership of peers and technicians in strategic and tactical improvement teams. Obtained patent for innovative stepper jig (US Patent 6,630,988 (7Oct2003)). Responsible for Litho maintaining ISO compliance performance. Selected for international assignment to support technology transfer and new resist qualification. Focus area was Lithography steppers (4 yrs) and Lithography tracks (2 yrs). Significant Accomplishment: 1) 63% headcount reduction with the implementation of custom preventive maintenance routine; 2) achieved 21% defect reduction during leadership of fab wide defect reduction team; 3) lithography iline stepper leader of 4 technology transfers. Army Captain, Combat Arms U.S. Army June 1990  –  November 1998  (8 years 6 months) Commissioned officer in Army National Guard; trained in Armor component. Experienced at leading under adverse physical conditions and consistently obtaining objective results. Led teams ranging from 4 to 60+ members. Awarded three commendation awards for exemplary leadership performance. Maintained government clearance of 'Secret'. Significant Contribution: Leading 60 person support element when performing duties of Company Executive Officer. Sr Chemical Process Engineer Boeing June 1991  –  April 1998  (6 years 11 months) Responsible for manufacturing feasibility evaluation of numerous new paints, solvents, sealants, and tank-line processes (e.g. plating and anodizing). Project manager of $3 Million budget for environmental and safety chemical reduction effort which involved the coordination of the research of over 20 engineers and reporting out performance to impacted external organizations. Experienced in developing compliance strategy and implementation of new technologies and processes for safety and environmental regulations. Significant Accomplishment: 1) Qualified and implemented new brush anodizing process that improved repair appearance resulting in cost savings of over $100K; 2) successfully implemented water based paint at Everett site on schedule to achieve compliance to a new environmental regulation. Fab & Facilities Process Engineering Manager Intel Corporation October 2010  – Present (4 years 11 months) Engineering Manager for Subfab Facility Systems that consists of Bulk Chemical Delivery (BCD), Gas Specialty Engineering (GSE), Vacuum System Engineering (VSE), Thermal Processing Unit (TPU) (i.e. abatement systems), Life Safety Systems (LSS) for chemical sensing, Emergency Response Team (ERT), and Medical Response Team (MRT). Also, responsible for Cross Module Support (CMS) module which deals with wafer support systems such as wafer container management, wafer lot splitting, wafer carrier cleaning, and wafer lot plan editing. Responsible for supporting uninterrupted manufacturing operations by driving robust root cause solutions to be implemented. Accountable for maintenance performance against the metrics of safety, reliability/quality, environmental, and cost. Drive on-going improvement effort to optimize system utility efficiency. Ensuring improvement and recovery projects meet design criteria and system reliability needs. Significant Accomplishment: Implementing engineering robustness methodology that resulted in an improvement of over 80% reduction in unscheduled maintenance. Fab & Facilities Process Engineering Manager Intel Corporation October 2010  – Present (4 years 11 months) Engineering Manager for Subfab Facility Systems that consists of Bulk Chemical Delivery (BCD), Gas Specialty Engineering (GSE), Vacuum System Engineering (VSE), Thermal Processing Unit (TPU) (i.e. abatement systems), Life Safety Systems (LSS) for chemical sensing, Emergency Response Team (ERT), and Medical Response Team (MRT). Also, responsible for Cross Module Support (CMS) module which deals with wafer support systems such as wafer container management, wafer lot splitting, wafer carrier cleaning, and wafer lot plan editing. Responsible for supporting uninterrupted manufacturing operations by driving robust root cause solutions to be implemented. Accountable for maintenance performance against the metrics of safety, reliability/quality, environmental, and cost. Drive on-going improvement effort to optimize system utility efficiency. Ensuring improvement and recovery projects meet design criteria and system reliability needs. Significant Accomplishment: Implementing engineering robustness methodology that resulted in an improvement of over 80% reduction in unscheduled maintenance. Club Owner/Chief Martial Arts Instructor Newberg Family Martial Arts June 1982  – Present (33 years 3 months) Newberg, OR Martial Arts practitioner since 1982. Certified martial arts instructor since 2008. 3rd Degree Black Belt in Tae Kwon Do from National Korean Martial Arts Assoc. Also a 1st Degree Black Belt (shodan) in American Shaolin Kempo Karate, 2nd Degree Black Belt (nidan) in American Karate-Jutsu and Purple Belt (shichi kyu) in American Ju-Jutsu from Kazato-Hen Jutsu (KHJ) Combat Systems under International Alliance of Jutsu Arts Organization, which is a practical self-defense style that it is kata focused and provides complete ground (ju jutsu), stand-up (karate jutsu), and take down/throw (aiki jutsu) Martial Art techniques. NFMA is a Dragon Martial Arts LLC company. School link: www.newbergfamilymartialarts.com Club Owner/Chief Martial Arts Instructor Newberg Family Martial Arts June 1982  – Present (33 years 3 months) Newberg, OR Martial Arts practitioner since 1982. Certified martial arts instructor since 2008. 3rd Degree Black Belt in Tae Kwon Do from National Korean Martial Arts Assoc. Also a 1st Degree Black Belt (shodan) in American Shaolin Kempo Karate, 2nd Degree Black Belt (nidan) in American Karate-Jutsu and Purple Belt (shichi kyu) in American Ju-Jutsu from Kazato-Hen Jutsu (KHJ) Combat Systems under International Alliance of Jutsu Arts Organization, which is a practical self-defense style that it is kata focused and provides complete ground (ju jutsu), stand-up (karate jutsu), and take down/throw (aiki jutsu) Martial Art techniques. NFMA is a Dragon Martial Arts LLC company. School link: www.newbergfamilymartialarts.com Co-Owner/Cake Decorating Asst. Bon Bon's May 2008  – Present (7 years 4 months) Newberg, OR Specializing in wedding cakes and special event desserts. www.facebook.com/bon.bons.desserts Co-Owner/Cake Decorating Asst. Bon Bon's May 2008  – Present (7 years 4 months) Newberg, OR Specializing in wedding cakes and special event desserts. www.facebook.com/bon.bons.desserts Owner/Armed Security Professional Stalwart Security Services March 2014  – Present (1 year 6 months) Portland Oregon Providing armed and unarmed personal security services for the local Portland Area. Stalwart Security Services is a Dragon Martial Arts LLC company. Owner/Armed Security Professional Stalwart Security Services March 2014  – Present (1 year 6 months) Portland Oregon Providing armed and unarmed personal security services for the local Portland Area. Stalwart Security Services is a Dragon Martial Arts LLC company. Facilities Process Engineering Manager Intel Corporation February 2008  –  October 2010  (2 years 9 months) Operations Manager for D1C Waste Systems and manager for Oregon FSM/TD Hazmat operations; included management of collection and treatment systems and execution of bulk gas operations. Hazmat operations scope was both hazardous material and hazardous waste shipment execution in compliance with government regulations (RCRA, DOT, FFA). Managed Aloha Fab Mechanical and Process systems consisting of process chill water, critical process chill water, tool exhaust, ultra pure water (18 Mohms), and waste systems, and non-critical bulk gas systems (nitrogen, argon, hydrogen, helium). Managed both engineering and technician resources to support uninterrupted facility operations. Responsible for the ongoing physical facilities maintenance performance of facility systems against the metrics of safety, reliability/quality, environmental, and cost. Ensuring systems operate as intended without impact to microprocessor Fab. Ensure on-going improvement effort to optimize system utility efficiency. Ensuring improvement and recovery projects meet design criteria and system reliability needs. Significant Accomplishment: 1) Improved operational execution with implementation of Engineering Led and Lean Manufacturing philosophy into Waste Systems, 2) implemented an internal audit scheme for hazmat operations that improved compliance robustness that was recognized by Corporate Hazmat as a best known method, 3) implemented engineering led planning allowing for DMW capacity planning, improved statistical trend analysis of facility systems, and contingency planning for site nitrogen capacity, 4) provided leadership in two re-organization efforts resulting in minimal disruption to operations that delivered improved customer relations and implemented world class labor efficiency. Facilities Process Engineering Manager Intel Corporation February 2008  –  October 2010  (2 years 9 months) Operations Manager for D1C Waste Systems and manager for Oregon FSM/TD Hazmat operations; included management of collection and treatment systems and execution of bulk gas operations. Hazmat operations scope was both hazardous material and hazardous waste shipment execution in compliance with government regulations (RCRA, DOT, FFA). Managed Aloha Fab Mechanical and Process systems consisting of process chill water, critical process chill water, tool exhaust, ultra pure water (18 Mohms), and waste systems, and non-critical bulk gas systems (nitrogen, argon, hydrogen, helium). Managed both engineering and technician resources to support uninterrupted facility operations. Responsible for the ongoing physical facilities maintenance performance of facility systems against the metrics of safety, reliability/quality, environmental, and cost. Ensuring systems operate as intended without impact to microprocessor Fab. Ensure on-going improvement effort to optimize system utility efficiency. Ensuring improvement and recovery projects meet design criteria and system reliability needs. Significant Accomplishment: 1) Improved operational execution with implementation of Engineering Led and Lean Manufacturing philosophy into Waste Systems, 2) implemented an internal audit scheme for hazmat operations that improved compliance robustness that was recognized by Corporate Hazmat as a best known method, 3) implemented engineering led planning allowing for DMW capacity planning, improved statistical trend analysis of facility systems, and contingency planning for site nitrogen capacity, 4) provided leadership in two re-organization efforts resulting in minimal disruption to operations that delivered improved customer relations and implemented world class labor efficiency. Lithography Fab Process Engineering Manager Intel Corporation September 2004  –  April 2008  (3 years 8 months) Responsible for the execution of a microelectronic fabrication Lithography area; which constituted 20% of plant. Responsible for the management on the execution of Safety, Quality and Cost Effective Output for a group consisting of $40+ million of capital equipment, 17 Lithography process modules, 8 engineers, and 16 technicians. Provided technical leadership, program management, and organizational development. Led strategic initiatives to ensure business objectives consistently met. Ensured tactical responses were thorough and assisted in determining root cause analysis and solution implementation. Developed and maintained effective working relationships with related processes management and stakeholders. Provided daily updates to senior factory management on issues affecting output performance. Led team through the implementation of Lean Manufacturing philosophy. Significant Accomplishment: 1) Start-up of organization from construction to 10,000 wafer start per week capacity; 2) leader of 5 lithography technology transfers Lithography Fab Process Engineering Manager Intel Corporation September 2004  –  April 2008  (3 years 8 months) Responsible for the execution of a microelectronic fabrication Lithography area; which constituted 20% of plant. Responsible for the management on the execution of Safety, Quality and Cost Effective Output for a group consisting of $40+ million of capital equipment, 17 Lithography process modules, 8 engineers, and 16 technicians. Provided technical leadership, program management, and organizational development. Led strategic initiatives to ensure business objectives consistently met. Ensured tactical responses were thorough and assisted in determining root cause analysis and solution implementation. Developed and maintained effective working relationships with related processes management and stakeholders. Provided daily updates to senior factory management on issues affecting output performance. Led team through the implementation of Lean Manufacturing philosophy. Significant Accomplishment: 1) Start-up of organization from construction to 10,000 wafer start per week capacity; 2) leader of 5 lithography technology transfers Sr. Chemical Process Lithography Engineer Intel Corporation May 1998  –  September 2004  (6 years 5 months) Responsible for tool module sustaining and continuous improvement involving: equipment troubleshooting, supervision of twenty technicians, recipe development, process improvement development and implementation, product material disposition, root cause analysis of issues and implementation of solutions to prevent reoccurrence, leadership of peers and technicians in strategic and tactical improvement teams. Obtained patent for innovative stepper jig (US Patent 6,630,988 (7Oct2003)). Responsible for Litho maintaining ISO compliance performance. Selected for international assignment to support technology transfer and new resist qualification. Focus area was Lithography steppers (4 yrs) and Lithography tracks (2 yrs). Significant Accomplishment: 1) 63% headcount reduction with the implementation of custom preventive maintenance routine; 2) achieved 21% defect reduction during leadership of fab wide defect reduction team; 3) lithography iline stepper leader of 4 technology transfers. Sr. Chemical Process Lithography Engineer Intel Corporation May 1998  –  September 2004  (6 years 5 months) Responsible for tool module sustaining and continuous improvement involving: equipment troubleshooting, supervision of twenty technicians, recipe development, process improvement development and implementation, product material disposition, root cause analysis of issues and implementation of solutions to prevent reoccurrence, leadership of peers and technicians in strategic and tactical improvement teams. Obtained patent for innovative stepper jig (US Patent 6,630,988 (7Oct2003)). Responsible for Litho maintaining ISO compliance performance. Selected for international assignment to support technology transfer and new resist qualification. Focus area was Lithography steppers (4 yrs) and Lithography tracks (2 yrs). Significant Accomplishment: 1) 63% headcount reduction with the implementation of custom preventive maintenance routine; 2) achieved 21% defect reduction during leadership of fab wide defect reduction team; 3) lithography iline stepper leader of 4 technology transfers. Army Captain, Combat Arms U.S. Army June 1990  –  November 1998  (8 years 6 months) Commissioned officer in Army National Guard; trained in Armor component. Experienced at leading under adverse physical conditions and consistently obtaining objective results. Led teams ranging from 4 to 60+ members. Awarded three commendation awards for exemplary leadership performance. Maintained government clearance of 'Secret'. Significant Contribution: Leading 60 person support element when performing duties of Company Executive Officer. Army Captain, Combat Arms U.S. Army June 1990  –  November 1998  (8 years 6 months) Commissioned officer in Army National Guard; trained in Armor component. Experienced at leading under adverse physical conditions and consistently obtaining objective results. Led teams ranging from 4 to 60+ members. Awarded three commendation awards for exemplary leadership performance. Maintained government clearance of 'Secret'. Significant Contribution: Leading 60 person support element when performing duties of Company Executive Officer. Sr Chemical Process Engineer Boeing June 1991  –  April 1998  (6 years 11 months) Responsible for manufacturing feasibility evaluation of numerous new paints, solvents, sealants, and tank-line processes (e.g. plating and anodizing). Project manager of $3 Million budget for environmental and safety chemical reduction effort which involved the coordination of the research of over 20 engineers and reporting out performance to impacted external organizations. Experienced in developing compliance strategy and implementation of new technologies and processes for safety and environmental regulations. Significant Accomplishment: 1) Qualified and implemented new brush anodizing process that improved repair appearance resulting in cost savings of over $100K; 2) successfully implemented water based paint at Everett site on schedule to achieve compliance to a new environmental regulation. Sr Chemical Process Engineer Boeing June 1991  –  April 1998  (6 years 11 months) Responsible for manufacturing feasibility evaluation of numerous new paints, solvents, sealants, and tank-line processes (e.g. plating and anodizing). Project manager of $3 Million budget for environmental and safety chemical reduction effort which involved the coordination of the research of over 20 engineers and reporting out performance to impacted external organizations. Experienced in developing compliance strategy and implementation of new technologies and processes for safety and environmental regulations. Significant Accomplishment: 1) Qualified and implemented new brush anodizing process that improved repair appearance resulting in cost savings of over $100K; 2) successfully implemented water based paint at Everett site on schedule to achieve compliance to a new environmental regulation. Skills Semiconductors SPC Lean Manufacturing Engineering Process Engineering Semiconductor Industry Manufacturing Failure Analysis Cross-functional Team... Characterization Process Improvement Analysis Leadership Budgets Root Cause Analysis Troubleshooting Continuous Improvement Program Management Materials Project Planning Start-ups Strategy Engineering Management FMEA Management Project Management Aerospace Strategic Planning Customer Service Small Business Compliance Managerial Finance Interviews HR Policies Key Performance... Market Analysis Military Experience Military Training Army Aerospace Manufacturing Silicon Thin Films Metrology Photolithography See 29+     See less Skills  Semiconductors SPC Lean Manufacturing Engineering Process Engineering Semiconductor Industry Manufacturing Failure Analysis Cross-functional Team... Characterization Process Improvement Analysis Leadership Budgets Root Cause Analysis Troubleshooting Continuous Improvement Program Management Materials Project Planning Start-ups Strategy Engineering Management FMEA Management Project Management Aerospace Strategic Planning Customer Service Small Business Compliance Managerial Finance Interviews HR Policies Key Performance... Market Analysis Military Experience Military Training Army Aerospace Manufacturing Silicon Thin Films Metrology Photolithography See 29+     See less Semiconductors SPC Lean Manufacturing Engineering Process Engineering Semiconductor Industry Manufacturing Failure Analysis Cross-functional Team... Characterization Process Improvement Analysis Leadership Budgets Root Cause Analysis Troubleshooting Continuous Improvement Program Management Materials Project Planning Start-ups Strategy Engineering Management FMEA Management Project Management Aerospace Strategic Planning Customer Service Small Business Compliance Managerial Finance Interviews HR Policies Key Performance... Market Analysis Military Experience Military Training Army Aerospace Manufacturing Silicon Thin Films Metrology Photolithography See 29+     See less Semiconductors SPC Lean Manufacturing Engineering Process Engineering Semiconductor Industry Manufacturing Failure Analysis Cross-functional Team... Characterization Process Improvement Analysis Leadership Budgets Root Cause Analysis Troubleshooting Continuous Improvement Program Management Materials Project Planning Start-ups Strategy Engineering Management FMEA Management Project Management Aerospace Strategic Planning Customer Service Small Business Compliance Managerial Finance Interviews HR Policies Key Performance... Market Analysis Military Experience Military Training Army Aerospace Manufacturing Silicon Thin Films Metrology Photolithography See 29+     See less Education Portland State University - School of Business Master of Business Administration (MBA),  Business Administration and Management , General 2009  – 2013 attended program while working full time. University of Washington MS,  Chemical Engr 1995  – 1998 Focus in surface/interfacial science. Thesis was \"Influence of monofunctional acid/base on 180 degree peel mechanics\" and published in Journal of Adhesion Science and Technology, Vol.12, No.10, 1091-1103, 1998. \n \nWorked full time in industry while in school. Activities and Societies:  Army ROTC University of Washington BS,  Material Science & Engr (Ceramic emphasis) 1988  – 1991 Army ROTC Scholarship. Published Senior thesis; \"Human gallstones: Specimen preparation and light microscopy\" (Proceedings of the Annual Meeting- Electron Microscopy Society of America, no. 50, 2 (1992): 734). Activities and Societies:  Army ROTC ,  Sigma Nu Colorado School of Mines Engineering 1986  – 1988 Activities and Societies:  Sigma Nu ,  Army ROTC Portland State University - School of Business Master of Business Administration (MBA),  Business Administration and Management , General 2009  – 2013 attended program while working full time. Portland State University - School of Business Master of Business Administration (MBA),  Business Administration and Management , General 2009  – 2013 attended program while working full time. Portland State University - School of Business Master of Business Administration (MBA),  Business Administration and Management , General 2009  – 2013 attended program while working full time. University of Washington MS,  Chemical Engr 1995  – 1998 Focus in surface/interfacial science. Thesis was \"Influence of monofunctional acid/base on 180 degree peel mechanics\" and published in Journal of Adhesion Science and Technology, Vol.12, No.10, 1091-1103, 1998. \n \nWorked full time in industry while in school. Activities and Societies:  Army ROTC University of Washington MS,  Chemical Engr 1995  – 1998 Focus in surface/interfacial science. Thesis was \"Influence of monofunctional acid/base on 180 degree peel mechanics\" and published in Journal of Adhesion Science and Technology, Vol.12, No.10, 1091-1103, 1998. \n \nWorked full time in industry while in school. Activities and Societies:  Army ROTC University of Washington MS,  Chemical Engr 1995  – 1998 Focus in surface/interfacial science. Thesis was \"Influence of monofunctional acid/base on 180 degree peel mechanics\" and published in Journal of Adhesion Science and Technology, Vol.12, No.10, 1091-1103, 1998. \n \nWorked full time in industry while in school. Activities and Societies:  Army ROTC University of Washington BS,  Material Science & Engr (Ceramic emphasis) 1988  – 1991 Army ROTC Scholarship. Published Senior thesis; \"Human gallstones: Specimen preparation and light microscopy\" (Proceedings of the Annual Meeting- Electron Microscopy Society of America, no. 50, 2 (1992): 734). Activities and Societies:  Army ROTC ,  Sigma Nu University of Washington BS,  Material Science & Engr (Ceramic emphasis) 1988  – 1991 Army ROTC Scholarship. Published Senior thesis; \"Human gallstones: Specimen preparation and light microscopy\" (Proceedings of the Annual Meeting- Electron Microscopy Society of America, no. 50, 2 (1992): 734). Activities and Societies:  Army ROTC ,  Sigma Nu University of Washington BS,  Material Science & Engr (Ceramic emphasis) 1988  – 1991 Army ROTC Scholarship. Published Senior thesis; \"Human gallstones: Specimen preparation and light microscopy\" (Proceedings of the Annual Meeting- Electron Microscopy Society of America, no. 50, 2 (1992): 734). Activities and Societies:  Army ROTC ,  Sigma Nu Colorado School of Mines Engineering 1986  – 1988 Activities and Societies:  Sigma Nu ,  Army ROTC Colorado School of Mines Engineering 1986  – 1988 Activities and Societies:  Sigma Nu ,  Army ROTC Colorado School of Mines Engineering 1986  – 1988 Activities and Societies:  Sigma Nu ,  Army ROTC ", "Summary Dynamic and dependable leader with strong combination of qualifications in engineering and operations management, problem solving, project management, and customer satisfaction. Delivers results with strong leadership, problem solving, organizational, and communication skills. Recognized for professionalism, resourcefulness and competence in project completion while supporting organizational goals. Ability to adapt to changing work environments while reliably continuing to drive positive results. Over 20 years of experience in the semiconductor industry providing influence and sustaining excellence.  Summary Dynamic and dependable leader with strong combination of qualifications in engineering and operations management, problem solving, project management, and customer satisfaction. Delivers results with strong leadership, problem solving, organizational, and communication skills. Recognized for professionalism, resourcefulness and competence in project completion while supporting organizational goals. Ability to adapt to changing work environments while reliably continuing to drive positive results. Over 20 years of experience in the semiconductor industry providing influence and sustaining excellence.  Dynamic and dependable leader with strong combination of qualifications in engineering and operations management, problem solving, project management, and customer satisfaction. Delivers results with strong leadership, problem solving, organizational, and communication skills. Recognized for professionalism, resourcefulness and competence in project completion while supporting organizational goals. Ability to adapt to changing work environments while reliably continuing to drive positive results. Over 20 years of experience in the semiconductor industry providing influence and sustaining excellence.  Dynamic and dependable leader with strong combination of qualifications in engineering and operations management, problem solving, project management, and customer satisfaction. Delivers results with strong leadership, problem solving, organizational, and communication skills. Recognized for professionalism, resourcefulness and competence in project completion while supporting organizational goals. Ability to adapt to changing work environments while reliably continuing to drive positive results. Over 20 years of experience in the semiconductor industry providing influence and sustaining excellence.  Experience Process Engineering Manager Intel Corporation April 2008  – Present (7 years 5 months) Chandler, Arizona Primary responsibilities for leading a organization of chemical and materials engineers, operational managers, and equipment technician staff to ensure that the equipment and processes within the module are able to reliably sustain 14nm CMP process technology. Senior Process Engineer Intel Corporation January 2006  –  March 2008  (2 years 3 months) Chandler, AZ Primary responsibilities are to deliver seamless 300MM equipment and high volume manufacturing process capabilities to support factory output deliverables. Worked closely with the yield and manufacturing groups on continuous improvement programs to ensure best in class safety, quality, productivity, maintenance, and cost metrics are achieved.  Global Product Support Manager Novellus Systems acquired by Lam Research Corporation June 2003  –  November 2005  (2 years 6 months) Chandler, Arizona Primarily responsible for managing global product support operations for the CMP Business unit. Led a team of software, equipment, and process support engineers to provide world class support for Novellus CMP customers worldwide. Achieved reductions in system warranty expense by targeting key reliability improvement programs and working with the field service organization to develop and train field service engineers on maintenance and troubleshooting best practices. Senior Staff Product Support Engineer Novellus Systems acquired by Lam Research Corporation January 2000  –  June 2003  (3 years 6 months) Chandler, Arizona Provided technical expertise and guidance to field engineer personnel on 200mm & 300mm CMP platforms. Accountable for problem resolution plans and confirmation of root cause for equipment and process related failures. Operated as the primary interface for the customer account team on all major product related problems requiring factory engineering support. Worked extensively on international assignments.  Field Service Engineer Speedfam-IPEC June 1996  –  December 1999  (3 years 7 months) San Jose, California Established and supervised field service operation on site at Intel Corporation. Responsible for system installation, process start-up, equipment uptime, and maintenance performance metrics to meet customer contractual requirements. Developed and supervised field service staff to ensure world class support. . Field Service Engineer PRI Automation December 1995  –  May 1996  (6 months) Portland, Oregon Responsible for equipment related support on automated material handling systems at customer location. Responsibilities consisted of robotic repairs, teaching of tool points, machine setup, preventive maintenance, and implementation of equipment upgrades. Process Engineering Manager Intel Corporation April 2008  – Present (7 years 5 months) Chandler, Arizona Primary responsibilities for leading a organization of chemical and materials engineers, operational managers, and equipment technician staff to ensure that the equipment and processes within the module are able to reliably sustain 14nm CMP process technology. Process Engineering Manager Intel Corporation April 2008  – Present (7 years 5 months) Chandler, Arizona Primary responsibilities for leading a organization of chemical and materials engineers, operational managers, and equipment technician staff to ensure that the equipment and processes within the module are able to reliably sustain 14nm CMP process technology. Senior Process Engineer Intel Corporation January 2006  –  March 2008  (2 years 3 months) Chandler, AZ Primary responsibilities are to deliver seamless 300MM equipment and high volume manufacturing process capabilities to support factory output deliverables. Worked closely with the yield and manufacturing groups on continuous improvement programs to ensure best in class safety, quality, productivity, maintenance, and cost metrics are achieved.  Senior Process Engineer Intel Corporation January 2006  –  March 2008  (2 years 3 months) Chandler, AZ Primary responsibilities are to deliver seamless 300MM equipment and high volume manufacturing process capabilities to support factory output deliverables. Worked closely with the yield and manufacturing groups on continuous improvement programs to ensure best in class safety, quality, productivity, maintenance, and cost metrics are achieved.  Global Product Support Manager Novellus Systems acquired by Lam Research Corporation June 2003  –  November 2005  (2 years 6 months) Chandler, Arizona Primarily responsible for managing global product support operations for the CMP Business unit. Led a team of software, equipment, and process support engineers to provide world class support for Novellus CMP customers worldwide. Achieved reductions in system warranty expense by targeting key reliability improvement programs and working with the field service organization to develop and train field service engineers on maintenance and troubleshooting best practices. Global Product Support Manager Novellus Systems acquired by Lam Research Corporation June 2003  –  November 2005  (2 years 6 months) Chandler, Arizona Primarily responsible for managing global product support operations for the CMP Business unit. Led a team of software, equipment, and process support engineers to provide world class support for Novellus CMP customers worldwide. Achieved reductions in system warranty expense by targeting key reliability improvement programs and working with the field service organization to develop and train field service engineers on maintenance and troubleshooting best practices. Senior Staff Product Support Engineer Novellus Systems acquired by Lam Research Corporation January 2000  –  June 2003  (3 years 6 months) Chandler, Arizona Provided technical expertise and guidance to field engineer personnel on 200mm & 300mm CMP platforms. Accountable for problem resolution plans and confirmation of root cause for equipment and process related failures. Operated as the primary interface for the customer account team on all major product related problems requiring factory engineering support. Worked extensively on international assignments.  Senior Staff Product Support Engineer Novellus Systems acquired by Lam Research Corporation January 2000  –  June 2003  (3 years 6 months) Chandler, Arizona Provided technical expertise and guidance to field engineer personnel on 200mm & 300mm CMP platforms. Accountable for problem resolution plans and confirmation of root cause for equipment and process related failures. Operated as the primary interface for the customer account team on all major product related problems requiring factory engineering support. Worked extensively on international assignments.  Field Service Engineer Speedfam-IPEC June 1996  –  December 1999  (3 years 7 months) San Jose, California Established and supervised field service operation on site at Intel Corporation. Responsible for system installation, process start-up, equipment uptime, and maintenance performance metrics to meet customer contractual requirements. Developed and supervised field service staff to ensure world class support. . Field Service Engineer Speedfam-IPEC June 1996  –  December 1999  (3 years 7 months) San Jose, California Established and supervised field service operation on site at Intel Corporation. Responsible for system installation, process start-up, equipment uptime, and maintenance performance metrics to meet customer contractual requirements. Developed and supervised field service staff to ensure world class support. . Field Service Engineer PRI Automation December 1995  –  May 1996  (6 months) Portland, Oregon Responsible for equipment related support on automated material handling systems at customer location. Responsibilities consisted of robotic repairs, teaching of tool points, machine setup, preventive maintenance, and implementation of equipment upgrades. Field Service Engineer PRI Automation December 1995  –  May 1996  (6 months) Portland, Oregon Responsible for equipment related support on automated material handling systems at customer location. Responsibilities consisted of robotic repairs, teaching of tool points, machine setup, preventive maintenance, and implementation of equipment upgrades. Languages English English English Skills Skills     Education Arizona State University Bachelor's Degree,  Electrical Engineering-BSEE , Cum Laude Heald College-Rancho Cordova Associate's Degree,  Computer Electronics Technology , Honors ITT Technical Institute-Portland Bachelor's Degree,  Automated Manufacturing Technology-BAS , Honors Arizona State University Bachelor's Degree,  Electrical Engineering-BSEE , Cum Laude Arizona State University Bachelor's Degree,  Electrical Engineering-BSEE , Cum Laude Arizona State University Bachelor's Degree,  Electrical Engineering-BSEE , Cum Laude Heald College-Rancho Cordova Associate's Degree,  Computer Electronics Technology , Honors Heald College-Rancho Cordova Associate's Degree,  Computer Electronics Technology , Honors Heald College-Rancho Cordova Associate's Degree,  Computer Electronics Technology , Honors ITT Technical Institute-Portland Bachelor's Degree,  Automated Manufacturing Technology-BAS , Honors ITT Technical Institute-Portland Bachelor's Degree,  Automated Manufacturing Technology-BAS , Honors ITT Technical Institute-Portland Bachelor's Degree,  Automated Manufacturing Technology-BAS , Honors ", "Skills Strategic Partnerships Process Improvement Start-ups Enterprise Software Program Management Strategy Product Marketing Pareto Analysis Management Cross-functional Team... Project Management Mobile Devices Leadership Strategic Planning New Business Development SPC See 1+     See less Skills  Strategic Partnerships Process Improvement Start-ups Enterprise Software Program Management Strategy Product Marketing Pareto Analysis Management Cross-functional Team... Project Management Mobile Devices Leadership Strategic Planning New Business Development SPC See 1+     See less Strategic Partnerships Process Improvement Start-ups Enterprise Software Program Management Strategy Product Marketing Pareto Analysis Management Cross-functional Team... Project Management Mobile Devices Leadership Strategic Planning New Business Development SPC See 1+     See less Strategic Partnerships Process Improvement Start-ups Enterprise Software Program Management Strategy Product Marketing Pareto Analysis Management Cross-functional Team... Project Management Mobile Devices Leadership Strategic Planning New Business Development SPC See 1+     See less ", "Experience Process Engineering Manager Intel Corporation Process Engineering Manager Intel Corporation Process Engineering Manager Intel Corporation Skills Semiconductors Design of Experiments Skills  Semiconductors Design of Experiments Semiconductors Design of Experiments Semiconductors Design of Experiments Education University of Illinois at Chicago Master's Degree,  Chemical Engineering 2000  – 2002 University of Illinois at Chicago Master's Degree,  Chemical Engineering 2000  – 2002 University of Illinois at Chicago Master's Degree,  Chemical Engineering 2000  – 2002 University of Illinois at Chicago Master's Degree,  Chemical Engineering 2000  – 2002 ", "Summary Experienced professional engineering manager with 8+ years of management experience in the semiconductor manufacturing industry and over 14 years of overall process engineering expertise in product technology development and high volume manufacturing including process improvement implementation, product technology ramp, and manufacturing sustaining excellence. Possesses good technical leadership abilities including resource and team management, project deliverable coordination including new product introductions, model-based problem solving direction, LEAN principle application, statistic-based process improvement, product defect reduction and yield maximization, area cost reduction, and excellent communication and presentation skills.  Summary Experienced professional engineering manager with 8+ years of management experience in the semiconductor manufacturing industry and over 14 years of overall process engineering expertise in product technology development and high volume manufacturing including process improvement implementation, product technology ramp, and manufacturing sustaining excellence. Possesses good technical leadership abilities including resource and team management, project deliverable coordination including new product introductions, model-based problem solving direction, LEAN principle application, statistic-based process improvement, product defect reduction and yield maximization, area cost reduction, and excellent communication and presentation skills.  Experienced professional engineering manager with 8+ years of management experience in the semiconductor manufacturing industry and over 14 years of overall process engineering expertise in product technology development and high volume manufacturing including process improvement implementation, product technology ramp, and manufacturing sustaining excellence. Possesses good technical leadership abilities including resource and team management, project deliverable coordination including new product introductions, model-based problem solving direction, LEAN principle application, statistic-based process improvement, product defect reduction and yield maximization, area cost reduction, and excellent communication and presentation skills.  Experienced professional engineering manager with 8+ years of management experience in the semiconductor manufacturing industry and over 14 years of overall process engineering expertise in product technology development and high volume manufacturing including process improvement implementation, product technology ramp, and manufacturing sustaining excellence. Possesses good technical leadership abilities including resource and team management, project deliverable coordination including new product introductions, model-based problem solving direction, LEAN principle application, statistic-based process improvement, product defect reduction and yield maximization, area cost reduction, and excellent communication and presentation skills.  Experience Lithography Technology Development Technical Leader Intel Corporation October 2013  – Present (1 year 11 months) Portland, Oregon Area •\tTechnically managed engineers in the R&D lithography process organization to create the industry-first 5th and 6th generation Core i3, i5, i7 microprocessors and Atom tablet/smartphone system-on-chips. \n \n•\tRamped the lithography pilot development area across multiple process operations raising factory output by 30% capacity. \n \n•\tManaged defect performance /product quality from the area toolsets below design goal targets through implementation of pro-active tool preventative maintenance and leading model-based problem solving activities. \n \n•\tLead the microprocessor technology development of multiple lithography ion implantation manufacturing operations by implementing multiple process design changes including polymer parametric modification achieving the quarterly yield goals. \n \n•\tChaired an SPC matching team for layer overlay parametrics defining statistical process window capabilities for all 14nm technology factories reporting results out to the Intel technology development VP on a twice monthly basis. \n Immersion Lithography Process Engineering Manager Intel Corporation January 2010  –  September 2013  (3 years 9 months) Albuquerque, New Mexico Area •\tManaged 8 engineers to coordinate the technology transfer of the first and second generation i3, i5 logic microprocessor/chipset node within the Fab 11x high volume manufacturing site. Lead process qualifications by ramping 50 new product introductions for the factory. \n \n•\tChaired the model-based problem solving Immersion Lithography Output Task Force which resolved a major manufacturing bottleneck. Collaborated with factory IE capacity engineering and process technicians to reduce large surplus of wafers in the area by achieving tool availability, run rate optimization, defect mitigation, and 24 x 7 operational execution consistency across all manufacturing shifts. \n \n•\tChaired the BE factory output improvement segment team which consisted of managing wafer processing and output/cycle time goals of 20+ different toolset platforms across 600+ individual manufacturing operations. Controlled overall wafer inventory profiles of the factory and created specialized (L8) automation systems to effectively drive auto-prioritization queuing of wafer processing to match factory needs. \n \n•\tCoordinated implementation for multiple LEAN projects including establishment of the World Class Sustaining Scorecard effectively providing real-time monitoring of all area success metrics and chairing multiple Kaizen activities to define sustaining roles and responsibilities for all department resources including manufacturing technicians, engineers, and area managers to outline 24 x 7 communication and passdown connections. \n \n•\tManaged the gate layer (chip speed) and BE critical layer (metal interconnects) process engineering modules. Effectively drove sustaining excellence initiatives towards Process Control System charts to within a 10% goal delta for critical dimension consistency which incorporated a 4 die-per-wafer yield improvement. \n Shift Manufacturing Group Leader Intel Corporation January 2009  –  December 2009  (1 year) Albuquerque, New Mexico Area •\tManaged all 4 manufacturing technician shift organizations (Day 1/Day 2/Night 1/Night 2) including all headcount resourcing for sustaining activities incorporating equipment repairs, preventative maintenance, station monitor resourcing, and install / qualification of new polymer photoresist links. \n \n•\tServed as the area manufacturing operations coordinator for two separate lithography modules managing all area safety, quality, tool availability, effective utilization, cycle time metrics, photoresist rework goals, consumables resourcing, and driving shift consistency through communication passdown improvement. \n \n•\tTrained additional manufacturing supervisors on process technology basics, link operations and functionality, metrology protocol, and material dispositions expanding technical capabilities within the organization. \n Lithography Technology Transfer Engineering Manager Intel Corporation January 2007  –  December 2008  (2 years) Albuquerque, New Mexico Area •\tManaged the Core 2 process technology transfer from the Portland R&D site to the Fab 11x high volume manufacturing environment on 25 lithography processing operations effectively. Reported out success metrics on a monthly basis to the program technology transfer VP. \n \n•\tServed as the primary process layer design engineer for 5 BE contact metal interconnect manufacturing operations owning all inline start-up SPC parametrics and ultimately achieving end-of-line yield goals. \n \n•\tManaged the new manufacturing ramps of 20 different microprocessor / chipset products applying LEAN principles to refine operational waste which ultimately reduced product cycle time from 75 to 65 days. \n \n•\tDeveloped the module automation privilege security model to protect Intel technology intellectual property and delegate need-to-know process design specs to only ramp transfer managers, engineers, and technicians. \n Lithography Senior Process Engineer Intel Corporation March 2002  –  December 2006  (4 years 10 months) Albuquerque, New Mexico Area •\tRamped the high volume manufacturing Fab 11x BE lithography process module on the Pentium 4 product family to the maximum factory-goaled wafer starts per week production capacity while exceeding technology yield goals. \n \n•\tCompleted the tool installation / qualification of Nikon scanner toolsets to bring up additional equipment capacity for the module. \n \n•\tLead the transfer of manufacturing process execution from the factory floor to the remote operations command center utilizing LEAN principles which improved headcount resourcing efficiency by 50%. \n \n•\tChaired the process quality team which created Failure Mode and Effects Analysis (FMEA) to address the most critical module improvements including an overall reduction of partially processed wafers by 20% achieving best-in-class factory performance.  \n \n•\tTrained multiple module engineers on technology design process changes to reduce critical dimension sizes and improve overall microprocessor device performance.  \n \n Intel Rotational Engineering Accelerated Program Intel Corporation February 2001  –  February 2002  (1 year 1 month) Albuquerque, New Mexico Area •\tFab 11 lithography process engineer focusing on gate electrical critical dimension research comparing two scanner platforms improving overall microprocessor speed capabilities. \n \n•\tServed as the Intel Loaned Executive to the United Way of Central New Mexico which involved assistance in managing the 1.5 million dollar Intel annual fundraising event. Collaborated with other local businesses in Albuquerque, NM and Rio Rancho, NM to raise awareness to the United Way cause. \n \n•\tServed as a sales-and-marketing/ financial analyst engineer for the Intel Time-To-Market software services group which entailed recruitment of new clientele within the company and generating the overall budgetary forecasts for the department.  \n Process Engineer Co-Op Celanese AG January 2000  –  August 2000  (8 months) Corpus Christi, Texas Area •\tCreated a full plant schematic of all the chemical lines within one formaldehyde production unit within the Celanese division chemical plant. Performed energy balances to optimize the flow rates across all the pumps within those lines. \n \n•\tPerformed chemical sampling of aerobic / anaerobic wastewater treatment tanks to assist with the environmental testing and compliance. Also managed testing of effluent waste water for primarily sulfates and lesser residual chemicals.  \n Lithography Technology Development Technical Leader Intel Corporation October 2013  – Present (1 year 11 months) Portland, Oregon Area •\tTechnically managed engineers in the R&D lithography process organization to create the industry-first 5th and 6th generation Core i3, i5, i7 microprocessors and Atom tablet/smartphone system-on-chips. \n \n•\tRamped the lithography pilot development area across multiple process operations raising factory output by 30% capacity. \n \n•\tManaged defect performance /product quality from the area toolsets below design goal targets through implementation of pro-active tool preventative maintenance and leading model-based problem solving activities. \n \n•\tLead the microprocessor technology development of multiple lithography ion implantation manufacturing operations by implementing multiple process design changes including polymer parametric modification achieving the quarterly yield goals. \n \n•\tChaired an SPC matching team for layer overlay parametrics defining statistical process window capabilities for all 14nm technology factories reporting results out to the Intel technology development VP on a twice monthly basis. \n Lithography Technology Development Technical Leader Intel Corporation October 2013  – Present (1 year 11 months) Portland, Oregon Area •\tTechnically managed engineers in the R&D lithography process organization to create the industry-first 5th and 6th generation Core i3, i5, i7 microprocessors and Atom tablet/smartphone system-on-chips. \n \n•\tRamped the lithography pilot development area across multiple process operations raising factory output by 30% capacity. \n \n•\tManaged defect performance /product quality from the area toolsets below design goal targets through implementation of pro-active tool preventative maintenance and leading model-based problem solving activities. \n \n•\tLead the microprocessor technology development of multiple lithography ion implantation manufacturing operations by implementing multiple process design changes including polymer parametric modification achieving the quarterly yield goals. \n \n•\tChaired an SPC matching team for layer overlay parametrics defining statistical process window capabilities for all 14nm technology factories reporting results out to the Intel technology development VP on a twice monthly basis. \n Immersion Lithography Process Engineering Manager Intel Corporation January 2010  –  September 2013  (3 years 9 months) Albuquerque, New Mexico Area •\tManaged 8 engineers to coordinate the technology transfer of the first and second generation i3, i5 logic microprocessor/chipset node within the Fab 11x high volume manufacturing site. Lead process qualifications by ramping 50 new product introductions for the factory. \n \n•\tChaired the model-based problem solving Immersion Lithography Output Task Force which resolved a major manufacturing bottleneck. Collaborated with factory IE capacity engineering and process technicians to reduce large surplus of wafers in the area by achieving tool availability, run rate optimization, defect mitigation, and 24 x 7 operational execution consistency across all manufacturing shifts. \n \n•\tChaired the BE factory output improvement segment team which consisted of managing wafer processing and output/cycle time goals of 20+ different toolset platforms across 600+ individual manufacturing operations. Controlled overall wafer inventory profiles of the factory and created specialized (L8) automation systems to effectively drive auto-prioritization queuing of wafer processing to match factory needs. \n \n•\tCoordinated implementation for multiple LEAN projects including establishment of the World Class Sustaining Scorecard effectively providing real-time monitoring of all area success metrics and chairing multiple Kaizen activities to define sustaining roles and responsibilities for all department resources including manufacturing technicians, engineers, and area managers to outline 24 x 7 communication and passdown connections. \n \n•\tManaged the gate layer (chip speed) and BE critical layer (metal interconnects) process engineering modules. Effectively drove sustaining excellence initiatives towards Process Control System charts to within a 10% goal delta for critical dimension consistency which incorporated a 4 die-per-wafer yield improvement. \n Immersion Lithography Process Engineering Manager Intel Corporation January 2010  –  September 2013  (3 years 9 months) Albuquerque, New Mexico Area •\tManaged 8 engineers to coordinate the technology transfer of the first and second generation i3, i5 logic microprocessor/chipset node within the Fab 11x high volume manufacturing site. Lead process qualifications by ramping 50 new product introductions for the factory. \n \n•\tChaired the model-based problem solving Immersion Lithography Output Task Force which resolved a major manufacturing bottleneck. Collaborated with factory IE capacity engineering and process technicians to reduce large surplus of wafers in the area by achieving tool availability, run rate optimization, defect mitigation, and 24 x 7 operational execution consistency across all manufacturing shifts. \n \n•\tChaired the BE factory output improvement segment team which consisted of managing wafer processing and output/cycle time goals of 20+ different toolset platforms across 600+ individual manufacturing operations. Controlled overall wafer inventory profiles of the factory and created specialized (L8) automation systems to effectively drive auto-prioritization queuing of wafer processing to match factory needs. \n \n•\tCoordinated implementation for multiple LEAN projects including establishment of the World Class Sustaining Scorecard effectively providing real-time monitoring of all area success metrics and chairing multiple Kaizen activities to define sustaining roles and responsibilities for all department resources including manufacturing technicians, engineers, and area managers to outline 24 x 7 communication and passdown connections. \n \n•\tManaged the gate layer (chip speed) and BE critical layer (metal interconnects) process engineering modules. Effectively drove sustaining excellence initiatives towards Process Control System charts to within a 10% goal delta for critical dimension consistency which incorporated a 4 die-per-wafer yield improvement. \n Shift Manufacturing Group Leader Intel Corporation January 2009  –  December 2009  (1 year) Albuquerque, New Mexico Area •\tManaged all 4 manufacturing technician shift organizations (Day 1/Day 2/Night 1/Night 2) including all headcount resourcing for sustaining activities incorporating equipment repairs, preventative maintenance, station monitor resourcing, and install / qualification of new polymer photoresist links. \n \n•\tServed as the area manufacturing operations coordinator for two separate lithography modules managing all area safety, quality, tool availability, effective utilization, cycle time metrics, photoresist rework goals, consumables resourcing, and driving shift consistency through communication passdown improvement. \n \n•\tTrained additional manufacturing supervisors on process technology basics, link operations and functionality, metrology protocol, and material dispositions expanding technical capabilities within the organization. \n Shift Manufacturing Group Leader Intel Corporation January 2009  –  December 2009  (1 year) Albuquerque, New Mexico Area •\tManaged all 4 manufacturing technician shift organizations (Day 1/Day 2/Night 1/Night 2) including all headcount resourcing for sustaining activities incorporating equipment repairs, preventative maintenance, station monitor resourcing, and install / qualification of new polymer photoresist links. \n \n•\tServed as the area manufacturing operations coordinator for two separate lithography modules managing all area safety, quality, tool availability, effective utilization, cycle time metrics, photoresist rework goals, consumables resourcing, and driving shift consistency through communication passdown improvement. \n \n•\tTrained additional manufacturing supervisors on process technology basics, link operations and functionality, metrology protocol, and material dispositions expanding technical capabilities within the organization. \n Lithography Technology Transfer Engineering Manager Intel Corporation January 2007  –  December 2008  (2 years) Albuquerque, New Mexico Area •\tManaged the Core 2 process technology transfer from the Portland R&D site to the Fab 11x high volume manufacturing environment on 25 lithography processing operations effectively. Reported out success metrics on a monthly basis to the program technology transfer VP. \n \n•\tServed as the primary process layer design engineer for 5 BE contact metal interconnect manufacturing operations owning all inline start-up SPC parametrics and ultimately achieving end-of-line yield goals. \n \n•\tManaged the new manufacturing ramps of 20 different microprocessor / chipset products applying LEAN principles to refine operational waste which ultimately reduced product cycle time from 75 to 65 days. \n \n•\tDeveloped the module automation privilege security model to protect Intel technology intellectual property and delegate need-to-know process design specs to only ramp transfer managers, engineers, and technicians. \n Lithography Technology Transfer Engineering Manager Intel Corporation January 2007  –  December 2008  (2 years) Albuquerque, New Mexico Area •\tManaged the Core 2 process technology transfer from the Portland R&D site to the Fab 11x high volume manufacturing environment on 25 lithography processing operations effectively. Reported out success metrics on a monthly basis to the program technology transfer VP. \n \n•\tServed as the primary process layer design engineer for 5 BE contact metal interconnect manufacturing operations owning all inline start-up SPC parametrics and ultimately achieving end-of-line yield goals. \n \n•\tManaged the new manufacturing ramps of 20 different microprocessor / chipset products applying LEAN principles to refine operational waste which ultimately reduced product cycle time from 75 to 65 days. \n \n•\tDeveloped the module automation privilege security model to protect Intel technology intellectual property and delegate need-to-know process design specs to only ramp transfer managers, engineers, and technicians. \n Lithography Senior Process Engineer Intel Corporation March 2002  –  December 2006  (4 years 10 months) Albuquerque, New Mexico Area •\tRamped the high volume manufacturing Fab 11x BE lithography process module on the Pentium 4 product family to the maximum factory-goaled wafer starts per week production capacity while exceeding technology yield goals. \n \n•\tCompleted the tool installation / qualification of Nikon scanner toolsets to bring up additional equipment capacity for the module. \n \n•\tLead the transfer of manufacturing process execution from the factory floor to the remote operations command center utilizing LEAN principles which improved headcount resourcing efficiency by 50%. \n \n•\tChaired the process quality team which created Failure Mode and Effects Analysis (FMEA) to address the most critical module improvements including an overall reduction of partially processed wafers by 20% achieving best-in-class factory performance.  \n \n•\tTrained multiple module engineers on technology design process changes to reduce critical dimension sizes and improve overall microprocessor device performance.  \n \n Lithography Senior Process Engineer Intel Corporation March 2002  –  December 2006  (4 years 10 months) Albuquerque, New Mexico Area •\tRamped the high volume manufacturing Fab 11x BE lithography process module on the Pentium 4 product family to the maximum factory-goaled wafer starts per week production capacity while exceeding technology yield goals. \n \n•\tCompleted the tool installation / qualification of Nikon scanner toolsets to bring up additional equipment capacity for the module. \n \n•\tLead the transfer of manufacturing process execution from the factory floor to the remote operations command center utilizing LEAN principles which improved headcount resourcing efficiency by 50%. \n \n•\tChaired the process quality team which created Failure Mode and Effects Analysis (FMEA) to address the most critical module improvements including an overall reduction of partially processed wafers by 20% achieving best-in-class factory performance.  \n \n•\tTrained multiple module engineers on technology design process changes to reduce critical dimension sizes and improve overall microprocessor device performance.  \n \n Intel Rotational Engineering Accelerated Program Intel Corporation February 2001  –  February 2002  (1 year 1 month) Albuquerque, New Mexico Area •\tFab 11 lithography process engineer focusing on gate electrical critical dimension research comparing two scanner platforms improving overall microprocessor speed capabilities. \n \n•\tServed as the Intel Loaned Executive to the United Way of Central New Mexico which involved assistance in managing the 1.5 million dollar Intel annual fundraising event. Collaborated with other local businesses in Albuquerque, NM and Rio Rancho, NM to raise awareness to the United Way cause. \n \n•\tServed as a sales-and-marketing/ financial analyst engineer for the Intel Time-To-Market software services group which entailed recruitment of new clientele within the company and generating the overall budgetary forecasts for the department.  \n Intel Rotational Engineering Accelerated Program Intel Corporation February 2001  –  February 2002  (1 year 1 month) Albuquerque, New Mexico Area •\tFab 11 lithography process engineer focusing on gate electrical critical dimension research comparing two scanner platforms improving overall microprocessor speed capabilities. \n \n•\tServed as the Intel Loaned Executive to the United Way of Central New Mexico which involved assistance in managing the 1.5 million dollar Intel annual fundraising event. Collaborated with other local businesses in Albuquerque, NM and Rio Rancho, NM to raise awareness to the United Way cause. \n \n•\tServed as a sales-and-marketing/ financial analyst engineer for the Intel Time-To-Market software services group which entailed recruitment of new clientele within the company and generating the overall budgetary forecasts for the department.  \n Process Engineer Co-Op Celanese AG January 2000  –  August 2000  (8 months) Corpus Christi, Texas Area •\tCreated a full plant schematic of all the chemical lines within one formaldehyde production unit within the Celanese division chemical plant. Performed energy balances to optimize the flow rates across all the pumps within those lines. \n \n•\tPerformed chemical sampling of aerobic / anaerobic wastewater treatment tanks to assist with the environmental testing and compliance. Also managed testing of effluent waste water for primarily sulfates and lesser residual chemicals.  \n Process Engineer Co-Op Celanese AG January 2000  –  August 2000  (8 months) Corpus Christi, Texas Area •\tCreated a full plant schematic of all the chemical lines within one formaldehyde production unit within the Celanese division chemical plant. Performed energy balances to optimize the flow rates across all the pumps within those lines. \n \n•\tPerformed chemical sampling of aerobic / anaerobic wastewater treatment tanks to assist with the environmental testing and compliance. Also managed testing of effluent waste water for primarily sulfates and lesser residual chemicals.  \n Languages English Native or bilingual proficiency Chinese Full professional proficiency English Native or bilingual proficiency Chinese Full professional proficiency English Native or bilingual proficiency Chinese Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Semiconductors Design of Experiments Process Engineering SPC JMP Failure Analysis Engineering Semiconductor Industry Six Sigma Manufacturing Characterization Root Cause Analysis Process Integration Project Management R&D Engineering Management Cross-functional Team... Electrical Engineering Metrology Materials Science Automation Continuous Improvement Intel Process Control Process Improvement Lean Manufacturing Manufacturing... SQL CVD Thin Films Plasma Etch Chemical Engineering Technology Development FMEA See 19+     See less Skills  Semiconductors Design of Experiments Process Engineering SPC JMP Failure Analysis Engineering Semiconductor Industry Six Sigma Manufacturing Characterization Root Cause Analysis Process Integration Project Management R&D Engineering Management Cross-functional Team... Electrical Engineering Metrology Materials Science Automation Continuous Improvement Intel Process Control Process Improvement Lean Manufacturing Manufacturing... SQL CVD Thin Films Plasma Etch Chemical Engineering Technology Development FMEA See 19+     See less Semiconductors Design of Experiments Process Engineering SPC JMP Failure Analysis Engineering Semiconductor Industry Six Sigma Manufacturing Characterization Root Cause Analysis Process Integration Project Management R&D Engineering Management Cross-functional Team... Electrical Engineering Metrology Materials Science Automation Continuous Improvement Intel Process Control Process Improvement Lean Manufacturing Manufacturing... SQL CVD Thin Films Plasma Etch Chemical Engineering Technology Development FMEA See 19+     See less Semiconductors Design of Experiments Process Engineering SPC JMP Failure Analysis Engineering Semiconductor Industry Six Sigma Manufacturing Characterization Root Cause Analysis Process Integration Project Management R&D Engineering Management Cross-functional Team... Electrical Engineering Metrology Materials Science Automation Continuous Improvement Intel Process Control Process Improvement Lean Manufacturing Manufacturing... SQL CVD Thin Films Plasma Etch Chemical Engineering Technology Development FMEA See 19+     See less Education Texas A&M University BS,  Chemical Engineering 1995  – 2000 Activities and Societies:  AIChE Texas A&M University BS,  Chemical Engineering 1995  – 2000 Activities and Societies:  AIChE Texas A&M University BS,  Chemical Engineering 1995  – 2000 Activities and Societies:  AIChE Texas A&M University BS,  Chemical Engineering 1995  – 2000 Activities and Societies:  AIChE ", "Experience Process Engineering Manager Intel Corporation October 2000  – Present (14 years 11 months) Process Engineer Motorola 1995  –  2000  (5 years) Process Engineering Manager Intel Corporation October 2000  – Present (14 years 11 months) Process Engineering Manager Intel Corporation October 2000  – Present (14 years 11 months) Process Engineer Motorola 1995  –  2000  (5 years) Process Engineer Motorola 1995  –  2000  (5 years) Skills Semiconductor... Process Engineering Manufacturing Engineering JMP SPC Thin Films PVD Engineering Management Lean Manufacturing Cross-functional Team... Process Improvement New Product... Process Optimization Defect Elimination Process Efficiency Design of Experiments Semiconductors Semiconductor Industry See 4+     See less Skills  Semiconductor... Process Engineering Manufacturing Engineering JMP SPC Thin Films PVD Engineering Management Lean Manufacturing Cross-functional Team... Process Improvement New Product... Process Optimization Defect Elimination Process Efficiency Design of Experiments Semiconductors Semiconductor Industry See 4+     See less Semiconductor... Process Engineering Manufacturing Engineering JMP SPC Thin Films PVD Engineering Management Lean Manufacturing Cross-functional Team... Process Improvement New Product... Process Optimization Defect Elimination Process Efficiency Design of Experiments Semiconductors Semiconductor Industry See 4+     See less Semiconductor... Process Engineering Manufacturing Engineering JMP SPC Thin Films PVD Engineering Management Lean Manufacturing Cross-functional Team... Process Improvement New Product... Process Optimization Defect Elimination Process Efficiency Design of Experiments Semiconductors Semiconductor Industry See 4+     See less Education Arizona State University Bachelor of Science (BS),  Mechanical Engineering 1991  – 1993 Arizona State University Bachelor of Science (BS),  Mechanical Engineering 1991  – 1993 Arizona State University Bachelor of Science (BS),  Mechanical Engineering 1991  – 1993 Arizona State University Bachelor of Science (BS),  Mechanical Engineering 1991  – 1993 ", "Skills Failure Analysis Manufacturing Semiconductors Strategy Program Management R&D Management Silicon Business Development Start-ups Process Engineering Supply Chain Yield Semiconductor Industry IC Six Sigma CMOS Design of Experiments Process Integration JMP Thin Films Metrology Capital Equipment SPC See 9+     See less Skills  Failure Analysis Manufacturing Semiconductors Strategy Program Management R&D Management Silicon Business Development Start-ups Process Engineering Supply Chain Yield Semiconductor Industry IC Six Sigma CMOS Design of Experiments Process Integration JMP Thin Films Metrology Capital Equipment SPC See 9+     See less Failure Analysis Manufacturing Semiconductors Strategy Program Management R&D Management Silicon Business Development Start-ups Process Engineering Supply Chain Yield Semiconductor Industry IC Six Sigma CMOS Design of Experiments Process Integration JMP Thin Films Metrology Capital Equipment SPC See 9+     See less Failure Analysis Manufacturing Semiconductors Strategy Program Management R&D Management Silicon Business Development Start-ups Process Engineering Supply Chain Yield Semiconductor Industry IC Six Sigma CMOS Design of Experiments Process Integration JMP Thin Films Metrology Capital Equipment SPC See 9+     See less ", "Summary • > 15 years hands-on experience of silicon processing in semiconductor industry and SMT electronic manufacture. \n• Strong leadership, project management capability and technical expertise.  \n• Extensive training and people development skills. Summary • > 15 years hands-on experience of silicon processing in semiconductor industry and SMT electronic manufacture. \n• Strong leadership, project management capability and technical expertise.  \n• Extensive training and people development skills. • > 15 years hands-on experience of silicon processing in semiconductor industry and SMT electronic manufacture. \n• Strong leadership, project management capability and technical expertise.  \n• Extensive training and people development skills. • > 15 years hands-on experience of silicon processing in semiconductor industry and SMT electronic manufacture. \n• Strong leadership, project management capability and technical expertise.  \n• Extensive training and people development skills. Experience Process Engineering Manager Intel Corporation September 2012  – Present (3 years) Dalian, Liaoning, China Key Responsibilities: \n•\tBuilding a high performing team and promoting Intel value to form culture, especially on the IP protection \n•\tManaging individuals and developing employees to next level. \n•\tLeading team to deliver high quality output through sustaining excellence and excursion management \n•\tContinuously cost reduction by setting audacious goal and innovative approach \n•\tResponsible for several key programs in department level, help to build the foundation of world class LEAN manufacture.  \n \nAchievements and Projects:  \n•\tFormed a high performing team and delivered best in class performance in quality, cost and output among virtual factory of 65nm \n•\tManage department HPM program, keeping promoting LEAN culture throughout organization to cross sharing and standardization. \n•\tLead department cost team to drive cost reduction 30% through continuous improvement \n•\tLead factory level module safety team promotes safety culture, fatality program and job hazard analysis to reach zero recordable incident. Module Team leader Intel Corporation August 2008  –  August 2012  (4 years 1 month) Dalian, Liaoning, China Key Responsibilities: \n•\tDevelop local engineer’s capability in both equipment and process area to meet factory start up requirement. \n•\tModule equipment selection, installation planning and start up \n•\tProcess qualification, address technical risk to meet tight schedule \n•\tSupport factory ramping up \nAchievements and Projects:  \n•\tDeveloped couple senior engineer in the area and influenced entire team in technical development \n•\tSuccessful achieved startup, process qualification and ramping with at least one month schedule pull in which hugely saved cost Senior Process Engineer Intel Corporation October 2008  –  October 2009  (1 year 1 month) Phoenix, Arizona Area •\tAdvanced engineering skills training and be ready for a green factory startup, demonstrated great learning curve \n•\tOwn technology transfer deliverables which range from construction to understanding process marginality between downstream and upstream, to ensure a successful start up Customer Engineer Leader Applied Materials March 2006  –  July 2008  (2 years 5 months) Wuxi, Jiangsu, China •\tTechnical go to person, develop team’s expertise through mentoring and coaching \n•\tLead engineers startup successfully in quality and timely manner. Worldwide shortest startup time record achieved.  \n•\tSupport customer ramping up and sustaining to meet tool availability requirement and continuous improvement. \n•\tManage subcontractor to meet project schedule in safety, quality manner. \n•\tShare BKM and provide solution as expert team to other account. Customer Engineer Applied Materials March 2004  –  February 2006  (2 years) Shanghai City, China •\tPerform startup successfully in quality and timely manner.  \n•\tSupport customer ramping up and sustaining to meet tool availability requirement and continuous improvement. \n•\tManage subcontractor to meet project schedule in safety, quality manner. Customer Engineer Applied Materials July 2005  –  August 2005  (2 months) Nagasaki, Japan Success startup and support AMJ fab Endura tool startup with very tight schedule and high quality manner. Equipment and Process Engineer D-TEK March 2001  –  March 2004  (3 years 1 month) Shanghai Suburb, China •\tPerform SMT equipment startup in quality and timely manner.  \n•\tSupport customer ramping up and sustaining to meet tool availability requirement and continuous improvement. \n•\tDevelop customer technical capability. Mechanical Designer Delixi Group Import&Export co.,ltd.Shanghai Office September 2000  –  February 2001  (6 months) Shanghai Suburb, China •\tAssembly of mechanical components/equipment and identify sources of critical parts and subsystems to resolve technical issues \n•\tEffective use of engineering processes in the resolution of mechanical problems of limited scope Process Engineering Manager Intel Corporation September 2012  – Present (3 years) Dalian, Liaoning, China Key Responsibilities: \n•\tBuilding a high performing team and promoting Intel value to form culture, especially on the IP protection \n•\tManaging individuals and developing employees to next level. \n•\tLeading team to deliver high quality output through sustaining excellence and excursion management \n•\tContinuously cost reduction by setting audacious goal and innovative approach \n•\tResponsible for several key programs in department level, help to build the foundation of world class LEAN manufacture.  \n \nAchievements and Projects:  \n•\tFormed a high performing team and delivered best in class performance in quality, cost and output among virtual factory of 65nm \n•\tManage department HPM program, keeping promoting LEAN culture throughout organization to cross sharing and standardization. \n•\tLead department cost team to drive cost reduction 30% through continuous improvement \n•\tLead factory level module safety team promotes safety culture, fatality program and job hazard analysis to reach zero recordable incident. Process Engineering Manager Intel Corporation September 2012  – Present (3 years) Dalian, Liaoning, China Key Responsibilities: \n•\tBuilding a high performing team and promoting Intel value to form culture, especially on the IP protection \n•\tManaging individuals and developing employees to next level. \n•\tLeading team to deliver high quality output through sustaining excellence and excursion management \n•\tContinuously cost reduction by setting audacious goal and innovative approach \n•\tResponsible for several key programs in department level, help to build the foundation of world class LEAN manufacture.  \n \nAchievements and Projects:  \n•\tFormed a high performing team and delivered best in class performance in quality, cost and output among virtual factory of 65nm \n•\tManage department HPM program, keeping promoting LEAN culture throughout organization to cross sharing and standardization. \n•\tLead department cost team to drive cost reduction 30% through continuous improvement \n•\tLead factory level module safety team promotes safety culture, fatality program and job hazard analysis to reach zero recordable incident. Module Team leader Intel Corporation August 2008  –  August 2012  (4 years 1 month) Dalian, Liaoning, China Key Responsibilities: \n•\tDevelop local engineer’s capability in both equipment and process area to meet factory start up requirement. \n•\tModule equipment selection, installation planning and start up \n•\tProcess qualification, address technical risk to meet tight schedule \n•\tSupport factory ramping up \nAchievements and Projects:  \n•\tDeveloped couple senior engineer in the area and influenced entire team in technical development \n•\tSuccessful achieved startup, process qualification and ramping with at least one month schedule pull in which hugely saved cost Module Team leader Intel Corporation August 2008  –  August 2012  (4 years 1 month) Dalian, Liaoning, China Key Responsibilities: \n•\tDevelop local engineer’s capability in both equipment and process area to meet factory start up requirement. \n•\tModule equipment selection, installation planning and start up \n•\tProcess qualification, address technical risk to meet tight schedule \n•\tSupport factory ramping up \nAchievements and Projects:  \n•\tDeveloped couple senior engineer in the area and influenced entire team in technical development \n•\tSuccessful achieved startup, process qualification and ramping with at least one month schedule pull in which hugely saved cost Senior Process Engineer Intel Corporation October 2008  –  October 2009  (1 year 1 month) Phoenix, Arizona Area •\tAdvanced engineering skills training and be ready for a green factory startup, demonstrated great learning curve \n•\tOwn technology transfer deliverables which range from construction to understanding process marginality between downstream and upstream, to ensure a successful start up Senior Process Engineer Intel Corporation October 2008  –  October 2009  (1 year 1 month) Phoenix, Arizona Area •\tAdvanced engineering skills training and be ready for a green factory startup, demonstrated great learning curve \n•\tOwn technology transfer deliverables which range from construction to understanding process marginality between downstream and upstream, to ensure a successful start up Customer Engineer Leader Applied Materials March 2006  –  July 2008  (2 years 5 months) Wuxi, Jiangsu, China •\tTechnical go to person, develop team’s expertise through mentoring and coaching \n•\tLead engineers startup successfully in quality and timely manner. Worldwide shortest startup time record achieved.  \n•\tSupport customer ramping up and sustaining to meet tool availability requirement and continuous improvement. \n•\tManage subcontractor to meet project schedule in safety, quality manner. \n•\tShare BKM and provide solution as expert team to other account. Customer Engineer Leader Applied Materials March 2006  –  July 2008  (2 years 5 months) Wuxi, Jiangsu, China •\tTechnical go to person, develop team’s expertise through mentoring and coaching \n•\tLead engineers startup successfully in quality and timely manner. Worldwide shortest startup time record achieved.  \n•\tSupport customer ramping up and sustaining to meet tool availability requirement and continuous improvement. \n•\tManage subcontractor to meet project schedule in safety, quality manner. \n•\tShare BKM and provide solution as expert team to other account. Customer Engineer Applied Materials March 2004  –  February 2006  (2 years) Shanghai City, China •\tPerform startup successfully in quality and timely manner.  \n•\tSupport customer ramping up and sustaining to meet tool availability requirement and continuous improvement. \n•\tManage subcontractor to meet project schedule in safety, quality manner. Customer Engineer Applied Materials March 2004  –  February 2006  (2 years) Shanghai City, China •\tPerform startup successfully in quality and timely manner.  \n•\tSupport customer ramping up and sustaining to meet tool availability requirement and continuous improvement. \n•\tManage subcontractor to meet project schedule in safety, quality manner. Customer Engineer Applied Materials July 2005  –  August 2005  (2 months) Nagasaki, Japan Success startup and support AMJ fab Endura tool startup with very tight schedule and high quality manner. Customer Engineer Applied Materials July 2005  –  August 2005  (2 months) Nagasaki, Japan Success startup and support AMJ fab Endura tool startup with very tight schedule and high quality manner. Equipment and Process Engineer D-TEK March 2001  –  March 2004  (3 years 1 month) Shanghai Suburb, China •\tPerform SMT equipment startup in quality and timely manner.  \n•\tSupport customer ramping up and sustaining to meet tool availability requirement and continuous improvement. \n•\tDevelop customer technical capability. Equipment and Process Engineer D-TEK March 2001  –  March 2004  (3 years 1 month) Shanghai Suburb, China •\tPerform SMT equipment startup in quality and timely manner.  \n•\tSupport customer ramping up and sustaining to meet tool availability requirement and continuous improvement. \n•\tDevelop customer technical capability. Mechanical Designer Delixi Group Import&Export co.,ltd.Shanghai Office September 2000  –  February 2001  (6 months) Shanghai Suburb, China •\tAssembly of mechanical components/equipment and identify sources of critical parts and subsystems to resolve technical issues \n•\tEffective use of engineering processes in the resolution of mechanical problems of limited scope Mechanical Designer Delixi Group Import&Export co.,ltd.Shanghai Office September 2000  –  February 2001  (6 months) Shanghai Suburb, China •\tAssembly of mechanical components/equipment and identify sources of critical parts and subsystems to resolve technical issues \n•\tEffective use of engineering processes in the resolution of mechanical problems of limited scope Languages Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Semiconductors IC Semiconductor Industry VLSI Failure Analysis Silicon Debugging Design of Experiments Thin Films CVD Product Engineering JMP Intel SPC Engineering Manufacturing Process Engineering Electronics See 3+     See less Skills  Semiconductors IC Semiconductor Industry VLSI Failure Analysis Silicon Debugging Design of Experiments Thin Films CVD Product Engineering JMP Intel SPC Engineering Manufacturing Process Engineering Electronics See 3+     See less Semiconductors IC Semiconductor Industry VLSI Failure Analysis Silicon Debugging Design of Experiments Thin Films CVD Product Engineering JMP Intel SPC Engineering Manufacturing Process Engineering Electronics See 3+     See less Semiconductors IC Semiconductor Industry VLSI Failure Analysis Silicon Debugging Design of Experiments Thin Films CVD Product Engineering JMP Intel SPC Engineering Manufacturing Process Engineering Electronics See 3+     See less Education Dalian University of Technology Master of Business Administration (MBA) 2013  – 2015 HEILONGJIANG UNIVERSITY OF SCIENCE AND TECHNOLOGY Bachelor's degree 1996  – 2000 Dalian University of Technology Master of Business Administration (MBA) 2013  – 2015 Dalian University of Technology Master of Business Administration (MBA) 2013  – 2015 Dalian University of Technology Master of Business Administration (MBA) 2013  – 2015 HEILONGJIANG UNIVERSITY OF SCIENCE AND TECHNOLOGY Bachelor's degree 1996  – 2000 HEILONGJIANG UNIVERSITY OF SCIENCE AND TECHNOLOGY Bachelor's degree 1996  – 2000 HEILONGJIANG UNIVERSITY OF SCIENCE AND TECHNOLOGY Bachelor's degree 1996  – 2000 ", "Experience Process Engineering Manager Intel Corporation September 2001  – Present (14 years) Phoenix, Arizona Area Responsible for supporting many facets of manufacturing operations within the factory leading and managing a team of approximately 15-25 . Leverages technical skills and relationships with four primary groups to ensure successful Fab operations: (1) interacts regularly with the Fab Operations Managers to aid in strategy development and to supply information needed to effectively manage Fab operations; (2) works with Automation groups to deliver reports necessary to manage the factory, and also to maintain systems commonly used on the factory floor (CLUI, Observer etc.); (3) partners with Industrial Engineers to address issues of capacity and factory performance; (4) works with the Planning and Production Control group to manage systems supporting factory operations (e.g. wafer starts) and to accurately forecast wafer movement within the factory. Process Engineering Manager Intel Corporation September 2001  – Present (14 years) Phoenix, Arizona Area Responsible for supporting many facets of manufacturing operations within the factory leading and managing a team of approximately 15-25 . Leverages technical skills and relationships with four primary groups to ensure successful Fab operations: (1) interacts regularly with the Fab Operations Managers to aid in strategy development and to supply information needed to effectively manage Fab operations; (2) works with Automation groups to deliver reports necessary to manage the factory, and also to maintain systems commonly used on the factory floor (CLUI, Observer etc.); (3) partners with Industrial Engineers to address issues of capacity and factory performance; (4) works with the Planning and Production Control group to manage systems supporting factory operations (e.g. wafer starts) and to accurately forecast wafer movement within the factory. Process Engineering Manager Intel Corporation September 2001  – Present (14 years) Phoenix, Arizona Area Responsible for supporting many facets of manufacturing operations within the factory leading and managing a team of approximately 15-25 . Leverages technical skills and relationships with four primary groups to ensure successful Fab operations: (1) interacts regularly with the Fab Operations Managers to aid in strategy development and to supply information needed to effectively manage Fab operations; (2) works with Automation groups to deliver reports necessary to manage the factory, and also to maintain systems commonly used on the factory floor (CLUI, Observer etc.); (3) partners with Industrial Engineers to address issues of capacity and factory performance; (4) works with the Planning and Production Control group to manage systems supporting factory operations (e.g. wafer starts) and to accurately forecast wafer movement within the factory. Education University of Phoenix Master of Business Administration (MBA),  Information Technology Project Management 2002  – 2003 The University of Southern Mississippi Bachelor's degree,  Computer Engineering 1996  – 2001 Activities and Societies:  NSBE; IEEE; University of Phoenix Master of Business Administration (MBA),  Information Technology Project Management 2002  – 2003 University of Phoenix Master of Business Administration (MBA),  Information Technology Project Management 2002  – 2003 University of Phoenix Master of Business Administration (MBA),  Information Technology Project Management 2002  – 2003 The University of Southern Mississippi Bachelor's degree,  Computer Engineering 1996  – 2001 Activities and Societies:  NSBE; IEEE; The University of Southern Mississippi Bachelor's degree,  Computer Engineering 1996  – 2001 Activities and Societies:  NSBE; IEEE; The University of Southern Mississippi Bachelor's degree,  Computer Engineering 1996  – 2001 Activities and Societies:  NSBE; IEEE; ", "Skills Lithography Process Engineering Yield Failure Analysis Engineering Management Semiconductors SPC Manufacturing Lean Manufacturing Design of Experiments Cross-functional Team... FMEA IC Product Development Semiconductor Industry Six Sigma JMP Product Lifecycle... Thin Films See 4+     See less Skills  Lithography Process Engineering Yield Failure Analysis Engineering Management Semiconductors SPC Manufacturing Lean Manufacturing Design of Experiments Cross-functional Team... FMEA IC Product Development Semiconductor Industry Six Sigma JMP Product Lifecycle... Thin Films See 4+     See less Lithography Process Engineering Yield Failure Analysis Engineering Management Semiconductors SPC Manufacturing Lean Manufacturing Design of Experiments Cross-functional Team... FMEA IC Product Development Semiconductor Industry Six Sigma JMP Product Lifecycle... Thin Films See 4+     See less Lithography Process Engineering Yield Failure Analysis Engineering Management Semiconductors SPC Manufacturing Lean Manufacturing Design of Experiments Cross-functional Team... FMEA IC Product Development Semiconductor Industry Six Sigma JMP Product Lifecycle... Thin Films See 4+     See less ", "Experience Capital Manager Intel Worldwide Factory Network January 2012  – Present (3 years 8 months) Fab Manufacturing Director Intel Corporation June 1996  –  December 2011  (15 years 7 months) Fab Process Engineering Manager Intel Corporation January 2003  –  January 2006  (3 years 1 month) Capital Manager Intel Worldwide Factory Network January 2012  – Present (3 years 8 months) Capital Manager Intel Worldwide Factory Network January 2012  – Present (3 years 8 months) Fab Manufacturing Director Intel Corporation June 1996  –  December 2011  (15 years 7 months) Fab Manufacturing Director Intel Corporation June 1996  –  December 2011  (15 years 7 months) Fab Process Engineering Manager Intel Corporation January 2003  –  January 2006  (3 years 1 month) Fab Process Engineering Manager Intel Corporation January 2003  –  January 2006  (3 years 1 month) Skills Process Engineering Manufacturing Semiconductors SPC Design of Experiments Cross-functional Team... Lean Manufacturing Failure Analysis Engineering Management Six Sigma Semiconductor Industry IC Program Management Electronics Continuous Improvement Skills  Process Engineering Manufacturing Semiconductors SPC Design of Experiments Cross-functional Team... Lean Manufacturing Failure Analysis Engineering Management Six Sigma Semiconductor Industry IC Program Management Electronics Continuous Improvement Process Engineering Manufacturing Semiconductors SPC Design of Experiments Cross-functional Team... Lean Manufacturing Failure Analysis Engineering Management Six Sigma Semiconductor Industry IC Program Management Electronics Continuous Improvement Process Engineering Manufacturing Semiconductors SPC Design of Experiments Cross-functional Team... Lean Manufacturing Failure Analysis Engineering Management Six Sigma Semiconductor Industry IC Program Management Electronics Continuous Improvement Education Arizona State University Technology Management 1998  – 2000 University of Illinois at Urbana-Champaign BS,  Engineering 1992  – 1996 Arizona State University Technology Management 1998  – 2000 Arizona State University Technology Management 1998  – 2000 Arizona State University Technology Management 1998  – 2000 University of Illinois at Urbana-Champaign BS,  Engineering 1992  – 1996 University of Illinois at Urbana-Champaign BS,  Engineering 1992  – 1996 University of Illinois at Urbana-Champaign BS,  Engineering 1992  – 1996 ", "Summary General investments - world wide. \n1. Real-Estate in Israel. \n2. Specialist in Israel/US stock markets long/mid/short term investment & trading. Focusing on Financials, Technologies and Bio-Tech companies. Summary General investments - world wide. \n1. Real-Estate in Israel. \n2. Specialist in Israel/US stock markets long/mid/short term investment & trading. Focusing on Financials, Technologies and Bio-Tech companies. General investments - world wide. \n1. Real-Estate in Israel. \n2. Specialist in Israel/US stock markets long/mid/short term investment & trading. Focusing on Financials, Technologies and Bio-Tech companies. General investments - world wide. \n1. Real-Estate in Israel. \n2. Specialist in Israel/US stock markets long/mid/short term investment & trading. Focusing on Financials, Technologies and Bio-Tech companies. Experience Private investor Self Employed June 2014  – Present (1 year 3 months) Reut, Israel Self investments world wide.  \n- Real Estate activities in Israel.  \n- Specialist on Israel/US stock market for long/mid/short term investment/trading. Focus on High-Tech, Financials and Bio-Tech companies. High Speed Net-Work Communication Reliability Manager Intel Corporation May 2012  –  June 2014  (2 years 2 months) Haifa, Israel Supporting R&D aspects of Reliability and Quality on SIP/HIP/Silicon/Board levels from early design until HVM phases.  \nManaging 4 GEOs world wide, 25 engineers, 4 products lines, integration of internal and 3rd party design houses.  \nDealing with extreme high competition atmosphere. Mobile Wireless Reliability manager Intel Corporation October 2006  –  June 2012  (5 years 9 months) Tel-Aviv and Haifa, Israel Q&R manager (in several GEOs) on all RF-Wireless products in MWG division @ Intel. CEO of High-Class Real-Estate project Family project January 2008  –  September 2011  (3 years 9 months) Jerusalem, Israel Managing Director of Real Estate Development project in Jerusalem / Israel. \nDevelopment and construction of exclusive apartments building (6 floors, 9 apartments) in Bait-Vagan, Jerusalem. Project in the order of 10 milllion USD. Hedge Fund Director Yehavim Hedge Fund 2004  –  2006  (2 years) Israel/US Fab 18 Quality & Reliability manager Intel Corporation 2001  –  2006  (5 years) Ion Implant/Diffusion Equipment/Process Engineering manager Intel Corporation 1987  –  2000  (13 years) Private investor Self Employed June 2014  – Present (1 year 3 months) Reut, Israel Self investments world wide.  \n- Real Estate activities in Israel.  \n- Specialist on Israel/US stock market for long/mid/short term investment/trading. Focus on High-Tech, Financials and Bio-Tech companies. Private investor Self Employed June 2014  – Present (1 year 3 months) Reut, Israel Self investments world wide.  \n- Real Estate activities in Israel.  \n- Specialist on Israel/US stock market for long/mid/short term investment/trading. Focus on High-Tech, Financials and Bio-Tech companies. High Speed Net-Work Communication Reliability Manager Intel Corporation May 2012  –  June 2014  (2 years 2 months) Haifa, Israel Supporting R&D aspects of Reliability and Quality on SIP/HIP/Silicon/Board levels from early design until HVM phases.  \nManaging 4 GEOs world wide, 25 engineers, 4 products lines, integration of internal and 3rd party design houses.  \nDealing with extreme high competition atmosphere. High Speed Net-Work Communication Reliability Manager Intel Corporation May 2012  –  June 2014  (2 years 2 months) Haifa, Israel Supporting R&D aspects of Reliability and Quality on SIP/HIP/Silicon/Board levels from early design until HVM phases.  \nManaging 4 GEOs world wide, 25 engineers, 4 products lines, integration of internal and 3rd party design houses.  \nDealing with extreme high competition atmosphere. Mobile Wireless Reliability manager Intel Corporation October 2006  –  June 2012  (5 years 9 months) Tel-Aviv and Haifa, Israel Q&R manager (in several GEOs) on all RF-Wireless products in MWG division @ Intel. Mobile Wireless Reliability manager Intel Corporation October 2006  –  June 2012  (5 years 9 months) Tel-Aviv and Haifa, Israel Q&R manager (in several GEOs) on all RF-Wireless products in MWG division @ Intel. CEO of High-Class Real-Estate project Family project January 2008  –  September 2011  (3 years 9 months) Jerusalem, Israel Managing Director of Real Estate Development project in Jerusalem / Israel. \nDevelopment and construction of exclusive apartments building (6 floors, 9 apartments) in Bait-Vagan, Jerusalem. Project in the order of 10 milllion USD. CEO of High-Class Real-Estate project Family project January 2008  –  September 2011  (3 years 9 months) Jerusalem, Israel Managing Director of Real Estate Development project in Jerusalem / Israel. \nDevelopment and construction of exclusive apartments building (6 floors, 9 apartments) in Bait-Vagan, Jerusalem. Project in the order of 10 milllion USD. Hedge Fund Director Yehavim Hedge Fund 2004  –  2006  (2 years) Israel/US Hedge Fund Director Yehavim Hedge Fund 2004  –  2006  (2 years) Israel/US Fab 18 Quality & Reliability manager Intel Corporation 2001  –  2006  (5 years) Fab 18 Quality & Reliability manager Intel Corporation 2001  –  2006  (5 years) Ion Implant/Diffusion Equipment/Process Engineering manager Intel Corporation 1987  –  2000  (13 years) Ion Implant/Diffusion Equipment/Process Engineering manager Intel Corporation 1987  –  2000  (13 years) Skills Reliability Design of Experiments IC SPC Semiconductors Semiconductor Industry Thin Films Engineering Wireless Failure Analysis Engineering Management Manufacturing R&D Skills  Reliability Design of Experiments IC SPC Semiconductors Semiconductor Industry Thin Films Engineering Wireless Failure Analysis Engineering Management Manufacturing R&D Reliability Design of Experiments IC SPC Semiconductors Semiconductor Industry Thin Films Engineering Wireless Failure Analysis Engineering Management Manufacturing R&D Reliability Design of Experiments IC SPC Semiconductors Semiconductor Industry Thin Films Engineering Wireless Failure Analysis Engineering Management Manufacturing R&D Education Champlain University in MA, USA Bussiness Management Studies 1999  – 2001 BTJ, Jerusalem, Israel P.EE,  Practical Electrivcal Engineering. 1981  – 1983 Champlain University in MA, USA Bussiness Management Studies 1999  – 2001 Champlain University in MA, USA Bussiness Management Studies 1999  – 2001 Champlain University in MA, USA Bussiness Management Studies 1999  – 2001 BTJ, Jerusalem, Israel P.EE,  Practical Electrivcal Engineering. 1981  – 1983 BTJ, Jerusalem, Israel P.EE,  Practical Electrivcal Engineering. 1981  – 1983 BTJ, Jerusalem, Israel P.EE,  Practical Electrivcal Engineering. 1981  – 1983 ", "Summary •\tDynamic Leader with a proven track record of propelling entrepreneurial startups and leading multi-million dollar global operations to positive growth.  \n \n•\tCharacterized as a strong, decisive leader that is highly energetic, driven, focused, strategic, and continuous improvement minded with the utmost integrity and dedication. Summary •\tDynamic Leader with a proven track record of propelling entrepreneurial startups and leading multi-million dollar global operations to positive growth.  \n \n•\tCharacterized as a strong, decisive leader that is highly energetic, driven, focused, strategic, and continuous improvement minded with the utmost integrity and dedication. •\tDynamic Leader with a proven track record of propelling entrepreneurial startups and leading multi-million dollar global operations to positive growth.  \n \n•\tCharacterized as a strong, decisive leader that is highly energetic, driven, focused, strategic, and continuous improvement minded with the utmost integrity and dedication. •\tDynamic Leader with a proven track record of propelling entrepreneurial startups and leading multi-million dollar global operations to positive growth.  \n \n•\tCharacterized as a strong, decisive leader that is highly energetic, driven, focused, strategic, and continuous improvement minded with the utmost integrity and dedication. Experience CEO & President Hampton Roads Holdings November 2014  – Present (10 months) Leesburg, VA A holding company focused on the craft beverage industry. Owner The Vineyards & Winery at Lost Creek October 2012  – Present (2 years 11 months) Leesburg, VA The Vineyards & Winery at Lost Creek is a casually elegant winery located in the rolling hills of Northern Virginia just outside of Washington DC offering a relaxed atmosphere & high-quality wines. Vice President of Supply Chain CustomInk July 2012  –  October 2014  (2 years 4 months) Tysons Corner, VA Responsible for in-house production facilities and the contract manufacturing network that produces CustomInk's custom apparel. Additionally own all suppliers of incoming product and the logistics aspects of delivering finish product to the customer. Vice President Manufacturing TelCare July 2011  –  July 2012  (1 year 1 month) Bethesda, MD Telcare uses award-winning cellular machine-2-machine technology to bridge the last mile between patients and their caregivers in order to improve the care of diabetes. Responsible for the design, manufacturing, and distribution of the first cellular enabled glucose meter. Vice President of Operations - Dental Imaging Danaher February 2010  –  July 2011  (1 year 6 months) Philadelphia, PA Dental Imaging is leading provider of X-ray technologies comprised of Gendex, DEXIS and Imaging Sciences International products. Responsible for the Dental Imaging business operations in Chicago and Philadelphia with worldwide distribution from Germany, Finland, Brazil, Japan and China. Corporate Director of Operations Danaher January 2009  –  February 2010  (1 year 2 months) Washington DC Responsible for driving continuous improvement and lean transformation utilizing the Danaher Business System (DBS) for multiple plants in North America. Mentored and implemented DBS across several industries including medical devices, industrial motors and drives, hand tools, automotive and fuel management systems. Expert in Lean techniques including Standard Work, Kanban, Transactional Processes and Heijunka. General Manager/Director of Operations - Danaher Motion Danaher Motion April 2007  –  December 2008  (1 year 9 months) Radford, VA Plant Manager for one of the largest facilities in Danaher Motion. Top award-winning plant in 2008 in supply chain and delivery across Danaher Motion's more than 30 plants globally. Direct P&L responsibilities for the production of commercial motors and drives. Director of Integration Engineering Intel Corporation January 2006  –  March 2007  (1 year 3 months) Phoenix, AZ Responsible for the output commitments impacted by the transistor portion of the semiconductor process at Intel's premiere 300mm high volume manufacturing facility. Cross functional leadership covered all process engineering departments including etch, photolithography, planar, implant and CVD. Managed a team of ten PhD process specialists. Planar Process Engineering Manager Intel Corporation June 2004  –  December 2005  (1 year 7 months) Phoenix, AZ Responsible for planar process engineering department for high volume manufacturing facility in Arizona. Managed a team of 8 process engineering and 30 manufacturing technicians. Sponsored Student: MIT Leaders for Global Operations MIT Sloan School of Management June 2002  –  May 2004  (2 years) Boston, MA Sponsored by Intel Corporation to participate in the highly selective Leaders for Global Operations program at MIT. Dual degree program specializing in operations where I graduated with MBA and MSEE. Global Supply Chain MBA Intern Honeywell Incorporated May 2003  –  December 2003  (8 months) Minneapolis, MN Responsible for developing three to five year Global Supply Chain strategy for Honeywell Automation Control division. Specifically focused on creating the optimal manufacturing footprint to create economies of scale across multiple operating companies within the division. Technology Transfer Project Manager Intel Corporation May 2000  –  May 2002  (2 years 1 month) Portland, OR Responsible for transferring the latest microprocessor technology from R&D facility in Portland, OR to high volume manufacturing facility in Boston, MA. CEO & President Hampton Roads Holdings November 2014  – Present (10 months) Leesburg, VA A holding company focused on the craft beverage industry. CEO & President Hampton Roads Holdings November 2014  – Present (10 months) Leesburg, VA A holding company focused on the craft beverage industry. Owner The Vineyards & Winery at Lost Creek October 2012  – Present (2 years 11 months) Leesburg, VA The Vineyards & Winery at Lost Creek is a casually elegant winery located in the rolling hills of Northern Virginia just outside of Washington DC offering a relaxed atmosphere & high-quality wines. Owner The Vineyards & Winery at Lost Creek October 2012  – Present (2 years 11 months) Leesburg, VA The Vineyards & Winery at Lost Creek is a casually elegant winery located in the rolling hills of Northern Virginia just outside of Washington DC offering a relaxed atmosphere & high-quality wines. Vice President of Supply Chain CustomInk July 2012  –  October 2014  (2 years 4 months) Tysons Corner, VA Responsible for in-house production facilities and the contract manufacturing network that produces CustomInk's custom apparel. Additionally own all suppliers of incoming product and the logistics aspects of delivering finish product to the customer. Vice President of Supply Chain CustomInk July 2012  –  October 2014  (2 years 4 months) Tysons Corner, VA Responsible for in-house production facilities and the contract manufacturing network that produces CustomInk's custom apparel. Additionally own all suppliers of incoming product and the logistics aspects of delivering finish product to the customer. Vice President Manufacturing TelCare July 2011  –  July 2012  (1 year 1 month) Bethesda, MD Telcare uses award-winning cellular machine-2-machine technology to bridge the last mile between patients and their caregivers in order to improve the care of diabetes. Responsible for the design, manufacturing, and distribution of the first cellular enabled glucose meter. Vice President Manufacturing TelCare July 2011  –  July 2012  (1 year 1 month) Bethesda, MD Telcare uses award-winning cellular machine-2-machine technology to bridge the last mile between patients and their caregivers in order to improve the care of diabetes. Responsible for the design, manufacturing, and distribution of the first cellular enabled glucose meter. Vice President of Operations - Dental Imaging Danaher February 2010  –  July 2011  (1 year 6 months) Philadelphia, PA Dental Imaging is leading provider of X-ray technologies comprised of Gendex, DEXIS and Imaging Sciences International products. Responsible for the Dental Imaging business operations in Chicago and Philadelphia with worldwide distribution from Germany, Finland, Brazil, Japan and China. Vice President of Operations - Dental Imaging Danaher February 2010  –  July 2011  (1 year 6 months) Philadelphia, PA Dental Imaging is leading provider of X-ray technologies comprised of Gendex, DEXIS and Imaging Sciences International products. Responsible for the Dental Imaging business operations in Chicago and Philadelphia with worldwide distribution from Germany, Finland, Brazil, Japan and China. Corporate Director of Operations Danaher January 2009  –  February 2010  (1 year 2 months) Washington DC Responsible for driving continuous improvement and lean transformation utilizing the Danaher Business System (DBS) for multiple plants in North America. Mentored and implemented DBS across several industries including medical devices, industrial motors and drives, hand tools, automotive and fuel management systems. Expert in Lean techniques including Standard Work, Kanban, Transactional Processes and Heijunka. Corporate Director of Operations Danaher January 2009  –  February 2010  (1 year 2 months) Washington DC Responsible for driving continuous improvement and lean transformation utilizing the Danaher Business System (DBS) for multiple plants in North America. Mentored and implemented DBS across several industries including medical devices, industrial motors and drives, hand tools, automotive and fuel management systems. Expert in Lean techniques including Standard Work, Kanban, Transactional Processes and Heijunka. General Manager/Director of Operations - Danaher Motion Danaher Motion April 2007  –  December 2008  (1 year 9 months) Radford, VA Plant Manager for one of the largest facilities in Danaher Motion. Top award-winning plant in 2008 in supply chain and delivery across Danaher Motion's more than 30 plants globally. Direct P&L responsibilities for the production of commercial motors and drives. General Manager/Director of Operations - Danaher Motion Danaher Motion April 2007  –  December 2008  (1 year 9 months) Radford, VA Plant Manager for one of the largest facilities in Danaher Motion. Top award-winning plant in 2008 in supply chain and delivery across Danaher Motion's more than 30 plants globally. Direct P&L responsibilities for the production of commercial motors and drives. Director of Integration Engineering Intel Corporation January 2006  –  March 2007  (1 year 3 months) Phoenix, AZ Responsible for the output commitments impacted by the transistor portion of the semiconductor process at Intel's premiere 300mm high volume manufacturing facility. Cross functional leadership covered all process engineering departments including etch, photolithography, planar, implant and CVD. Managed a team of ten PhD process specialists. Director of Integration Engineering Intel Corporation January 2006  –  March 2007  (1 year 3 months) Phoenix, AZ Responsible for the output commitments impacted by the transistor portion of the semiconductor process at Intel's premiere 300mm high volume manufacturing facility. Cross functional leadership covered all process engineering departments including etch, photolithography, planar, implant and CVD. Managed a team of ten PhD process specialists. Planar Process Engineering Manager Intel Corporation June 2004  –  December 2005  (1 year 7 months) Phoenix, AZ Responsible for planar process engineering department for high volume manufacturing facility in Arizona. Managed a team of 8 process engineering and 30 manufacturing technicians. Planar Process Engineering Manager Intel Corporation June 2004  –  December 2005  (1 year 7 months) Phoenix, AZ Responsible for planar process engineering department for high volume manufacturing facility in Arizona. Managed a team of 8 process engineering and 30 manufacturing technicians. Sponsored Student: MIT Leaders for Global Operations MIT Sloan School of Management June 2002  –  May 2004  (2 years) Boston, MA Sponsored by Intel Corporation to participate in the highly selective Leaders for Global Operations program at MIT. Dual degree program specializing in operations where I graduated with MBA and MSEE. Sponsored Student: MIT Leaders for Global Operations MIT Sloan School of Management June 2002  –  May 2004  (2 years) Boston, MA Sponsored by Intel Corporation to participate in the highly selective Leaders for Global Operations program at MIT. Dual degree program specializing in operations where I graduated with MBA and MSEE. Global Supply Chain MBA Intern Honeywell Incorporated May 2003  –  December 2003  (8 months) Minneapolis, MN Responsible for developing three to five year Global Supply Chain strategy for Honeywell Automation Control division. Specifically focused on creating the optimal manufacturing footprint to create economies of scale across multiple operating companies within the division. Global Supply Chain MBA Intern Honeywell Incorporated May 2003  –  December 2003  (8 months) Minneapolis, MN Responsible for developing three to five year Global Supply Chain strategy for Honeywell Automation Control division. Specifically focused on creating the optimal manufacturing footprint to create economies of scale across multiple operating companies within the division. Technology Transfer Project Manager Intel Corporation May 2000  –  May 2002  (2 years 1 month) Portland, OR Responsible for transferring the latest microprocessor technology from R&D facility in Portland, OR to high volume manufacturing facility in Boston, MA. Technology Transfer Project Manager Intel Corporation May 2000  –  May 2002  (2 years 1 month) Portland, OR Responsible for transferring the latest microprocessor technology from R&D facility in Portland, OR to high volume manufacturing facility in Boston, MA. Skills Lean Manufacturing Kaizen Manufacturing Cross-functional Team... Process Engineering Supply Chain Management Wineries Vineyard Marketing Strategy Wine & Spirits Industry Wine Sales Entrepreneurship Skills  Lean Manufacturing Kaizen Manufacturing Cross-functional Team... Process Engineering Supply Chain Management Wineries Vineyard Marketing Strategy Wine & Spirits Industry Wine Sales Entrepreneurship Lean Manufacturing Kaizen Manufacturing Cross-functional Team... Process Engineering Supply Chain Management Wineries Vineyard Marketing Strategy Wine & Spirits Industry Wine Sales Entrepreneurship Lean Manufacturing Kaizen Manufacturing Cross-functional Team... Process Engineering Supply Chain Management Wineries Vineyard Marketing Strategy Wine & Spirits Industry Wine Sales Entrepreneurship Education Massachusetts Institute of Technology - Sloan School of Management MBA,  Leaders for Global Operations 2002  – 2004 Thesis titled \"Global Supply Chain Design and Optimization Methodology\" published 2004 Massachusetts Institute of Technology MSEE,  Electrical Engineering 2002  – 2004 The University of Texas at Austin BSEE,  Electrical Engineering 1993  – 1997 Massachusetts Institute of Technology - Sloan School of Management MBA,  Leaders for Global Operations 2002  – 2004 Thesis titled \"Global Supply Chain Design and Optimization Methodology\" published 2004 Massachusetts Institute of Technology - Sloan School of Management MBA,  Leaders for Global Operations 2002  – 2004 Thesis titled \"Global Supply Chain Design and Optimization Methodology\" published 2004 Massachusetts Institute of Technology - Sloan School of Management MBA,  Leaders for Global Operations 2002  – 2004 Thesis titled \"Global Supply Chain Design and Optimization Methodology\" published 2004 Massachusetts Institute of Technology MSEE,  Electrical Engineering 2002  – 2004 Massachusetts Institute of Technology MSEE,  Electrical Engineering 2002  – 2004 Massachusetts Institute of Technology MSEE,  Electrical Engineering 2002  – 2004 The University of Texas at Austin BSEE,  Electrical Engineering 1993  – 1997 The University of Texas at Austin BSEE,  Electrical Engineering 1993  – 1997 The University of Texas at Austin BSEE,  Electrical Engineering 1993  – 1997 ", "Experience Engineering Manager Honeywell Aerospace July 2011  – Present (4 years 2 months) Colorado Springs, Colorado Area Engineering and Operations manager responsible for delivering technical hardware and software solutions and enhancements to a global ground tracking station network. Industrial Engineering Manager Intel-Micron Flash Singapore September 2007  –  September 2009  (2 years 1 month) Industrial Engineering manager responsible for factory capacity planning and scenario analysis to optimize capital expenditures and factory output. Process Engineering Manager Intel Corporation April 2004  –  September 2007  (3 years 6 months) Responsible for process and equipment engineering and maintenance departments of 130 engineers and 250 maintenance techs. Process Engineering Section Head Intel Corporation November 2000  –  April 2004  (3 years 6 months) Managed Thin Films, Litho, Diffusion and Implant process engineering areas. Defect and Process Control Section Head Intel Corporation October 1994  –  November 2000  (6 years 2 months) Responsible for defect reduction and process control quality systems. Expatriate Yield Section Head Intel Corporation December 1992  –  September 1994  (1 year 10 months) Managed Intel expatriate team and Japanese subcontractor to establish and improve yield and output. Yield Engineer Intel Corporation July 1984  –  November 1992  (8 years 5 months) Held various yield and process integration positions focused on process transfer or startup. Engineering Manager Honeywell Aerospace July 2011  – Present (4 years 2 months) Colorado Springs, Colorado Area Engineering and Operations manager responsible for delivering technical hardware and software solutions and enhancements to a global ground tracking station network. Engineering Manager Honeywell Aerospace July 2011  – Present (4 years 2 months) Colorado Springs, Colorado Area Engineering and Operations manager responsible for delivering technical hardware and software solutions and enhancements to a global ground tracking station network. Industrial Engineering Manager Intel-Micron Flash Singapore September 2007  –  September 2009  (2 years 1 month) Industrial Engineering manager responsible for factory capacity planning and scenario analysis to optimize capital expenditures and factory output. Industrial Engineering Manager Intel-Micron Flash Singapore September 2007  –  September 2009  (2 years 1 month) Industrial Engineering manager responsible for factory capacity planning and scenario analysis to optimize capital expenditures and factory output. Process Engineering Manager Intel Corporation April 2004  –  September 2007  (3 years 6 months) Responsible for process and equipment engineering and maintenance departments of 130 engineers and 250 maintenance techs. Process Engineering Manager Intel Corporation April 2004  –  September 2007  (3 years 6 months) Responsible for process and equipment engineering and maintenance departments of 130 engineers and 250 maintenance techs. Process Engineering Section Head Intel Corporation November 2000  –  April 2004  (3 years 6 months) Managed Thin Films, Litho, Diffusion and Implant process engineering areas. Process Engineering Section Head Intel Corporation November 2000  –  April 2004  (3 years 6 months) Managed Thin Films, Litho, Diffusion and Implant process engineering areas. Defect and Process Control Section Head Intel Corporation October 1994  –  November 2000  (6 years 2 months) Responsible for defect reduction and process control quality systems. Defect and Process Control Section Head Intel Corporation October 1994  –  November 2000  (6 years 2 months) Responsible for defect reduction and process control quality systems. Expatriate Yield Section Head Intel Corporation December 1992  –  September 1994  (1 year 10 months) Managed Intel expatriate team and Japanese subcontractor to establish and improve yield and output. Expatriate Yield Section Head Intel Corporation December 1992  –  September 1994  (1 year 10 months) Managed Intel expatriate team and Japanese subcontractor to establish and improve yield and output. Yield Engineer Intel Corporation July 1984  –  November 1992  (8 years 5 months) Held various yield and process integration positions focused on process transfer or startup. Yield Engineer Intel Corporation July 1984  –  November 1992  (8 years 5 months) Held various yield and process integration positions focused on process transfer or startup. Skills Cross-functional Team... Skills  Cross-functional Team... Cross-functional Team... Cross-functional Team... Education University of Cincinnati Bachelor of Science,  Chemical Engineering 1979  – 1984 University of Cincinnati Bachelor of Science,  Chemical Engineering 1979  – 1984 University of Cincinnati Bachelor of Science,  Chemical Engineering 1979  – 1984 University of Cincinnati Bachelor of Science,  Chemical Engineering 1979  – 1984 ", "Experience Plant/General Manager - Arizona Fab/Sort Manufacturing Intel Corporation December 2011  – Present (3 years 9 months) Phoenix, Arizona, USA Fab 68 Factory Manager Intel Corporation 2007  –  2011  (4 years) Dalian, Liaoning, China Fab 11X Process Engineering Manager Intel Corporation August 2006  –  2007  (1 year) Albuquerque, New Mexico, USA General Manager, Intel Pudong (CPU) Intel Corporation 2004  –  2006  (2 years) Shanghai, China General Manager, Intel Philippines (CPU) Intel Corporation 2000  –  2004  (4 years) Cavite, Philippines Operations Director Intel Corporation 1988  –  1999  (11 years) Penang, Malaysia Plant/General Manager - Arizona Fab/Sort Manufacturing Intel Corporation December 2011  – Present (3 years 9 months) Phoenix, Arizona, USA Plant/General Manager - Arizona Fab/Sort Manufacturing Intel Corporation December 2011  – Present (3 years 9 months) Phoenix, Arizona, USA Fab 68 Factory Manager Intel Corporation 2007  –  2011  (4 years) Dalian, Liaoning, China Fab 68 Factory Manager Intel Corporation 2007  –  2011  (4 years) Dalian, Liaoning, China Fab 11X Process Engineering Manager Intel Corporation August 2006  –  2007  (1 year) Albuquerque, New Mexico, USA Fab 11X Process Engineering Manager Intel Corporation August 2006  –  2007  (1 year) Albuquerque, New Mexico, USA General Manager, Intel Pudong (CPU) Intel Corporation 2004  –  2006  (2 years) Shanghai, China General Manager, Intel Pudong (CPU) Intel Corporation 2004  –  2006  (2 years) Shanghai, China General Manager, Intel Philippines (CPU) Intel Corporation 2000  –  2004  (4 years) Cavite, Philippines General Manager, Intel Philippines (CPU) Intel Corporation 2000  –  2004  (4 years) Cavite, Philippines Operations Director Intel Corporation 1988  –  1999  (11 years) Penang, Malaysia Operations Director Intel Corporation 1988  –  1999  (11 years) Penang, Malaysia Skills Cross-functional Team... Continuous Improvement Lean Manufacturing SPC Manufacturing Semiconductors Supply Chain Management Root Cause Analysis Six Sigma FMEA Semiconductor Industry Design of Experiments Process Improvement IC Electronics Process Engineering Engineering Management Engineering Program Management Product Development Metrology Supply Chain Change Management Failure Analysis See 9+     See less Skills  Cross-functional Team... Continuous Improvement Lean Manufacturing SPC Manufacturing Semiconductors Supply Chain Management Root Cause Analysis Six Sigma FMEA Semiconductor Industry Design of Experiments Process Improvement IC Electronics Process Engineering Engineering Management Engineering Program Management Product Development Metrology Supply Chain Change Management Failure Analysis See 9+     See less Cross-functional Team... Continuous Improvement Lean Manufacturing SPC Manufacturing Semiconductors Supply Chain Management Root Cause Analysis Six Sigma FMEA Semiconductor Industry Design of Experiments Process Improvement IC Electronics Process Engineering Engineering Management Engineering Program Management Product Development Metrology Supply Chain Change Management Failure Analysis See 9+     See less Cross-functional Team... Continuous Improvement Lean Manufacturing SPC Manufacturing Semiconductors Supply Chain Management Root Cause Analysis Six Sigma FMEA Semiconductor Industry Design of Experiments Process Improvement IC Electronics Process Engineering Engineering Management Engineering Program Management Product Development Metrology Supply Chain Change Management Failure Analysis See 9+     See less Education University of Louisiana at Lafayette 1984  – 1988 University of Louisiana at Lafayette 1984  – 1988 University of Louisiana at Lafayette 1984  – 1988 University of Louisiana at Lafayette 1984  – 1988 ", "Experience North Work Center Manager Colorado Springs Utilities April 2014  – Present (1 year 5 months) Group is responsible for the construction and maintenance of electric and gas transmission and distribution systems within Colorado Springs. South Work Center Manager Colorado Springs Utilities June 2009  –  March 2014  (4 years 10 months) Group is responsible for the construction and maintenance of electric and gas transmission and distribution systems within Colorado Springs. Process Engineering Manager Intel Corporation June 2005  –  June 2009  (4 years 1 month) Phoenix, Arizona Area Operations Manger Intel Corporation June 2000  –  June 2005  (5 years 1 month) Colorado Springs, Colorado Area Facilities Project and System Engineer Intel Corporation November 1993  –  June 2000  (6 years 8 months) Phoenix, Arizona Area North Work Center Manager Colorado Springs Utilities April 2014  – Present (1 year 5 months) Group is responsible for the construction and maintenance of electric and gas transmission and distribution systems within Colorado Springs. North Work Center Manager Colorado Springs Utilities April 2014  – Present (1 year 5 months) Group is responsible for the construction and maintenance of electric and gas transmission and distribution systems within Colorado Springs. South Work Center Manager Colorado Springs Utilities June 2009  –  March 2014  (4 years 10 months) Group is responsible for the construction and maintenance of electric and gas transmission and distribution systems within Colorado Springs. South Work Center Manager Colorado Springs Utilities June 2009  –  March 2014  (4 years 10 months) Group is responsible for the construction and maintenance of electric and gas transmission and distribution systems within Colorado Springs. Process Engineering Manager Intel Corporation June 2005  –  June 2009  (4 years 1 month) Phoenix, Arizona Area Process Engineering Manager Intel Corporation June 2005  –  June 2009  (4 years 1 month) Phoenix, Arizona Area Operations Manger Intel Corporation June 2000  –  June 2005  (5 years 1 month) Colorado Springs, Colorado Area Operations Manger Intel Corporation June 2000  –  June 2005  (5 years 1 month) Colorado Springs, Colorado Area Facilities Project and System Engineer Intel Corporation November 1993  –  June 2000  (6 years 8 months) Phoenix, Arizona Area Facilities Project and System Engineer Intel Corporation November 1993  –  June 2000  (6 years 8 months) Phoenix, Arizona Area Skills Process Engineering Engineering Gas Facilities Management Cross-functional Team... Construction Energy Contract Management Operations Management Power Generation Project Planning Renewable Energy Program Management Project Management Procurement Skills  Process Engineering Engineering Gas Facilities Management Cross-functional Team... Construction Energy Contract Management Operations Management Power Generation Project Planning Renewable Energy Program Management Project Management Procurement Process Engineering Engineering Gas Facilities Management Cross-functional Team... Construction Energy Contract Management Operations Management Power Generation Project Planning Renewable Energy Program Management Project Management Procurement Process Engineering Engineering Gas Facilities Management Cross-functional Team... Construction Energy Contract Management Operations Management Power Generation Project Planning Renewable Energy Program Management Project Management Procurement Education University of Colorado Colorado Springs MBA,  Business Administration and Management , General 2001  – 2003 Portland State University BSME,  Mechanical Engineering 1989  – 1993 University of Colorado Colorado Springs MBA,  Business Administration and Management , General 2001  – 2003 University of Colorado Colorado Springs MBA,  Business Administration and Management , General 2001  – 2003 University of Colorado Colorado Springs MBA,  Business Administration and Management , General 2001  – 2003 Portland State University BSME,  Mechanical Engineering 1989  – 1993 Portland State University BSME,  Mechanical Engineering 1989  – 1993 Portland State University BSME,  Mechanical Engineering 1989  – 1993 ", "Summary Strategic executive relentlessly pursuing success through developing innovative technologies, building organizational trust, aligning towards a common vision, continually improving business processes, forming strategic partnerships, breaking into markets, and winning new customers. Summary Strategic executive relentlessly pursuing success through developing innovative technologies, building organizational trust, aligning towards a common vision, continually improving business processes, forming strategic partnerships, breaking into markets, and winning new customers. Strategic executive relentlessly pursuing success through developing innovative technologies, building organizational trust, aligning towards a common vision, continually improving business processes, forming strategic partnerships, breaking into markets, and winning new customers. Strategic executive relentlessly pursuing success through developing innovative technologies, building organizational trust, aligning towards a common vision, continually improving business processes, forming strategic partnerships, breaking into markets, and winning new customers. Experience Vice President, Technology RealD December 2013  – Present (1 year 9 months) Boulder, CO Vice President, Engineering RealD April 2013  –  November 2013  (8 months) Boulder, CO Director, Cinema Product Management RealD October 2012  –  March 2013  (6 months) Strengthened strategic supplier relationships and stabilized screen technology development, reducing material usage by 50% and launching RealD Precision White Screen Technology. Championed the implementation of product release train and product data review processes. Director of Product Development Research Electro-Optics January 2012  –  September 2012  (9 months) Assumed responsibility for starting up a new department to strengthen the company’s technology development roadmap and focus on rapid prototyping. Developed a strategy to improve engineering review and quick decision making in quote process, create an agile prototyping production line, and implement a phase-gate review process. Director of Engineering and Quality Systems Research Electro-Optics August 2009  –  December 2011  (2 years 5 months) Proven results in product development, gross margin improvement, lead time reduction, process standardization, and cost-structure management by quickly revamping processes, organizing teams to improve performance, and inspiring people to effect change. Director of mechanical, metrology, product, and process engineering groups as well as quality systems and quality control. Director of Quality Systems Research Electro-Optics October 2008  –  July 2009  (10 months) Developed quality management system and company culture of continual improvement. Built quality infrastructure, created core systems for corrective action, material review board, internal audits, change control, and management review. Product Line Manager Research Electro-Optics 2007  –  2008  (1 year) Responsible for all aspects of the Ring Laser Gyroscope product line including process development and control, P & L accountability, customer relationship, manufacturing ramp, delivery schedule, and capacity plan. Process Engineering Manager Intel Corporation June 2005  –  October 2007  (2 years 5 months) Engineering and operations leadership in Lithography deparment of Logic Technology Development division. Senior Process Engineer Intel Corporation June 2002  –  June 2005  (3 years 1 month) Subject matter expert (SME) for multiple lithography department technologies. Vice President, Technology RealD December 2013  – Present (1 year 9 months) Boulder, CO Vice President, Technology RealD December 2013  – Present (1 year 9 months) Boulder, CO Vice President, Engineering RealD April 2013  –  November 2013  (8 months) Boulder, CO Vice President, Engineering RealD April 2013  –  November 2013  (8 months) Boulder, CO Director, Cinema Product Management RealD October 2012  –  March 2013  (6 months) Strengthened strategic supplier relationships and stabilized screen technology development, reducing material usage by 50% and launching RealD Precision White Screen Technology. Championed the implementation of product release train and product data review processes. Director, Cinema Product Management RealD October 2012  –  March 2013  (6 months) Strengthened strategic supplier relationships and stabilized screen technology development, reducing material usage by 50% and launching RealD Precision White Screen Technology. Championed the implementation of product release train and product data review processes. Director of Product Development Research Electro-Optics January 2012  –  September 2012  (9 months) Assumed responsibility for starting up a new department to strengthen the company’s technology development roadmap and focus on rapid prototyping. Developed a strategy to improve engineering review and quick decision making in quote process, create an agile prototyping production line, and implement a phase-gate review process. Director of Product Development Research Electro-Optics January 2012  –  September 2012  (9 months) Assumed responsibility for starting up a new department to strengthen the company’s technology development roadmap and focus on rapid prototyping. Developed a strategy to improve engineering review and quick decision making in quote process, create an agile prototyping production line, and implement a phase-gate review process. Director of Engineering and Quality Systems Research Electro-Optics August 2009  –  December 2011  (2 years 5 months) Proven results in product development, gross margin improvement, lead time reduction, process standardization, and cost-structure management by quickly revamping processes, organizing teams to improve performance, and inspiring people to effect change. Director of mechanical, metrology, product, and process engineering groups as well as quality systems and quality control. Director of Engineering and Quality Systems Research Electro-Optics August 2009  –  December 2011  (2 years 5 months) Proven results in product development, gross margin improvement, lead time reduction, process standardization, and cost-structure management by quickly revamping processes, organizing teams to improve performance, and inspiring people to effect change. Director of mechanical, metrology, product, and process engineering groups as well as quality systems and quality control. Director of Quality Systems Research Electro-Optics October 2008  –  July 2009  (10 months) Developed quality management system and company culture of continual improvement. Built quality infrastructure, created core systems for corrective action, material review board, internal audits, change control, and management review. Director of Quality Systems Research Electro-Optics October 2008  –  July 2009  (10 months) Developed quality management system and company culture of continual improvement. Built quality infrastructure, created core systems for corrective action, material review board, internal audits, change control, and management review. Product Line Manager Research Electro-Optics 2007  –  2008  (1 year) Responsible for all aspects of the Ring Laser Gyroscope product line including process development and control, P & L accountability, customer relationship, manufacturing ramp, delivery schedule, and capacity plan. Product Line Manager Research Electro-Optics 2007  –  2008  (1 year) Responsible for all aspects of the Ring Laser Gyroscope product line including process development and control, P & L accountability, customer relationship, manufacturing ramp, delivery schedule, and capacity plan. Process Engineering Manager Intel Corporation June 2005  –  October 2007  (2 years 5 months) Engineering and operations leadership in Lithography deparment of Logic Technology Development division. Process Engineering Manager Intel Corporation June 2005  –  October 2007  (2 years 5 months) Engineering and operations leadership in Lithography deparment of Logic Technology Development division. Senior Process Engineer Intel Corporation June 2002  –  June 2005  (3 years 1 month) Subject matter expert (SME) for multiple lithography department technologies. Senior Process Engineer Intel Corporation June 2002  –  June 2005  (3 years 1 month) Subject matter expert (SME) for multiple lithography department technologies. Skills Strategic Planning Organizational... Customer Engagement Customer Service Operational Excellence Lean Manufacturing Key Performance... Program Execution New Business Development Product Development New Product... Product Management Product Engineering Product Life Cycle... Process Development Manufacturing... Process Control Six Sigma Business Process... Quality Systems ISO standards Internal Audit Quality Control Lean Initiatives Supply Chain Value Change Control Continual Improvement Value Stream Mapping Employee Engagement Technology Transfer Technology Roadmapping Optics Photonics Semiconductors Lithography Thin Films Chemical Mechanical... Mechanical Assemblies Research Mechanical Engineering Metrology Board of Directors... SPC Design of Experiments Optical Engineering FMEA Electro-optics Yield Process Engineering Manufacturing See 35+     See less Skills  Strategic Planning Organizational... Customer Engagement Customer Service Operational Excellence Lean Manufacturing Key Performance... Program Execution New Business Development Product Development New Product... Product Management Product Engineering Product Life Cycle... Process Development Manufacturing... Process Control Six Sigma Business Process... Quality Systems ISO standards Internal Audit Quality Control Lean Initiatives Supply Chain Value Change Control Continual Improvement Value Stream Mapping Employee Engagement Technology Transfer Technology Roadmapping Optics Photonics Semiconductors Lithography Thin Films Chemical Mechanical... Mechanical Assemblies Research Mechanical Engineering Metrology Board of Directors... SPC Design of Experiments Optical Engineering FMEA Electro-optics Yield Process Engineering Manufacturing See 35+     See less Strategic Planning Organizational... Customer Engagement Customer Service Operational Excellence Lean Manufacturing Key Performance... Program Execution New Business Development Product Development New Product... Product Management Product Engineering Product Life Cycle... Process Development Manufacturing... Process Control Six Sigma Business Process... Quality Systems ISO standards Internal Audit Quality Control Lean Initiatives Supply Chain Value Change Control Continual Improvement Value Stream Mapping Employee Engagement Technology Transfer Technology Roadmapping Optics Photonics Semiconductors Lithography Thin Films Chemical Mechanical... Mechanical Assemblies Research Mechanical Engineering Metrology Board of Directors... SPC Design of Experiments Optical Engineering FMEA Electro-optics Yield Process Engineering Manufacturing See 35+     See less Strategic Planning Organizational... Customer Engagement Customer Service Operational Excellence Lean Manufacturing Key Performance... Program Execution New Business Development Product Development New Product... Product Management Product Engineering Product Life Cycle... Process Development Manufacturing... Process Control Six Sigma Business Process... Quality Systems ISO standards Internal Audit Quality Control Lean Initiatives Supply Chain Value Change Control Continual Improvement Value Stream Mapping Employee Engagement Technology Transfer Technology Roadmapping Optics Photonics Semiconductors Lithography Thin Films Chemical Mechanical... Mechanical Assemblies Research Mechanical Engineering Metrology Board of Directors... SPC Design of Experiments Optical Engineering FMEA Electro-optics Yield Process Engineering Manufacturing See 35+     See less Education University of Colorado at Boulder Ph.D, M.S.,  Physics 1996  – 2001 University of Puget Sound BS,  Physics & Mathematics 1992  – 1996 Loyola University of Colorado at Boulder Ph.D, M.S.,  Physics 1996  – 2001 University of Colorado at Boulder Ph.D, M.S.,  Physics 1996  – 2001 University of Colorado at Boulder Ph.D, M.S.,  Physics 1996  – 2001 University of Puget Sound BS,  Physics & Mathematics 1992  – 1996 University of Puget Sound BS,  Physics & Mathematics 1992  – 1996 University of Puget Sound BS,  Physics & Mathematics 1992  – 1996 Loyola Loyola Loyola ", "Skills Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Skills  Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Honors & Awards ", "Experience Data Scientist & Technology Development Manager Intel Corporation June 2008  – Present (7 years 3 months) Chandler, Arizona Yield & Product Engineering Department Manager - Expat Intel Corporation June 2005  –  June 2008  (3 years 1 month) Chengdu, Sichuan, China Yield & Product Engineering Manager Intel Corporation February 2000  –  June 2008  (8 years 5 months) Chandler, Arizona Process Engineering Manager - Expat Intel Corporation June 1998  –  February 2000  (1 year 9 months) San Jose, Costa Rica Process Engineering Manager Intel Corporation November 1994  –  June 1998  (3 years 8 months) Chandler, Arizona Process Engineer Intel Corporation November 1992  –  November 1994  (2 years 1 month) Chandler, Arizona Responsible for high volume electroplating process and equipment \nDrove equipment, yield and process improvements \nDesigned experiments, analyzed process data \n Data Scientist & Technology Development Manager Intel Corporation June 2008  – Present (7 years 3 months) Chandler, Arizona Data Scientist & Technology Development Manager Intel Corporation June 2008  – Present (7 years 3 months) Chandler, Arizona Yield & Product Engineering Department Manager - Expat Intel Corporation June 2005  –  June 2008  (3 years 1 month) Chengdu, Sichuan, China Yield & Product Engineering Department Manager - Expat Intel Corporation June 2005  –  June 2008  (3 years 1 month) Chengdu, Sichuan, China Yield & Product Engineering Manager Intel Corporation February 2000  –  June 2008  (8 years 5 months) Chandler, Arizona Yield & Product Engineering Manager Intel Corporation February 2000  –  June 2008  (8 years 5 months) Chandler, Arizona Process Engineering Manager - Expat Intel Corporation June 1998  –  February 2000  (1 year 9 months) San Jose, Costa Rica Process Engineering Manager - Expat Intel Corporation June 1998  –  February 2000  (1 year 9 months) San Jose, Costa Rica Process Engineering Manager Intel Corporation November 1994  –  June 1998  (3 years 8 months) Chandler, Arizona Process Engineering Manager Intel Corporation November 1994  –  June 1998  (3 years 8 months) Chandler, Arizona Process Engineer Intel Corporation November 1992  –  November 1994  (2 years 1 month) Chandler, Arizona Responsible for high volume electroplating process and equipment \nDrove equipment, yield and process improvements \nDesigned experiments, analyzed process data \n Process Engineer Intel Corporation November 1992  –  November 1994  (2 years 1 month) Chandler, Arizona Responsible for high volume electroplating process and equipment \nDrove equipment, yield and process improvements \nDesigned experiments, analyzed process data \n Skills Data Science Statistics Data Visualization Machine Learning Engineering Physics Python R Programing Program Management Engineering Management Design of Experiments Process Engineering Yield Management Test Automation Data Modeling Product Engineering Process Control Manufacturing Process Improvement See 3+     See less Skills  Data Science Statistics Data Visualization Machine Learning Engineering Physics Python R Programing Program Management Engineering Management Design of Experiments Process Engineering Yield Management Test Automation Data Modeling Product Engineering Process Control Manufacturing Process Improvement See 3+     See less Data Science Statistics Data Visualization Machine Learning Engineering Physics Python R Programing Program Management Engineering Management Design of Experiments Process Engineering Yield Management Test Automation Data Modeling Product Engineering Process Control Manufacturing Process Improvement See 3+     See less Data Science Statistics Data Visualization Machine Learning Engineering Physics Python R Programing Program Management Engineering Management Design of Experiments Process Engineering Yield Management Test Automation Data Modeling Product Engineering Process Control Manufacturing Process Improvement See 3+     See less Education Cornell University Bachelor's Degree,  Applied and Engineering Physics 1988  – 1992 Activities and Societies:  Physics tutor Cornell University Bachelor's Degree,  Applied and Engineering Physics 1988  – 1992 Activities and Societies:  Physics tutor Cornell University Bachelor's Degree,  Applied and Engineering Physics 1988  – 1992 Activities and Societies:  Physics tutor Cornell University Bachelor's Degree,  Applied and Engineering Physics 1988  – 1992 Activities and Societies:  Physics tutor ", "Experience Process Engineering Manager Intel Corporation January 1998  – Present (17 years 8 months) Semiconductor manufacturing process engineer and group leader of engineering team; started up several manufacturing processes and ramped to high volume Process Engineering Manager Intel Corporation January 1998  – Present (17 years 8 months) Semiconductor manufacturing process engineer and group leader of engineering team; started up several manufacturing processes and ramped to high volume Process Engineering Manager Intel Corporation January 1998  – Present (17 years 8 months) Semiconductor manufacturing process engineer and group leader of engineering team; started up several manufacturing processes and ramped to high volume Skills Process Engineering Lean Manufacturing Semiconductor Process Process Control Technical Leadership Situational Leadership Data Analysis SPC Skills  Process Engineering Lean Manufacturing Semiconductor Process Process Control Technical Leadership Situational Leadership Data Analysis SPC Process Engineering Lean Manufacturing Semiconductor Process Process Control Technical Leadership Situational Leadership Data Analysis SPC Process Engineering Lean Manufacturing Semiconductor Process Process Control Technical Leadership Situational Leadership Data Analysis SPC Education Arizona State University Master of Business Administration (MBA),  Engineering Technology , General 2003  – 2005 University of Illinois at Chicago Bachelor of Science,  Mechanical Engineering 1992  – 1997 Arizona State University Master of Business Administration (MBA),  Engineering Technology , General 2003  – 2005 Arizona State University Master of Business Administration (MBA),  Engineering Technology , General 2003  – 2005 Arizona State University Master of Business Administration (MBA),  Engineering Technology , General 2003  – 2005 University of Illinois at Chicago Bachelor of Science,  Mechanical Engineering 1992  – 1997 University of Illinois at Chicago Bachelor of Science,  Mechanical Engineering 1992  – 1997 University of Illinois at Chicago Bachelor of Science,  Mechanical Engineering 1992  – 1997 ", "Experience Chemical Vapor Depsition Process Engineering Manager Intel Corporation June 2014  –  May 2015  (1 year) Dalian, Liaoning, China Lead a mature team and persue continuous improvement through LSS process. especially focus system building up and standardization. Metallization Process Engineering Manager Intel Corporation September 2011  –  May 2014  (2 years 9 months) Dalian, Liaoning, China Metal Engineering Manager in a LEAN factory in Intel Dalian site. Manages two module teams and millions of manufacture equipment & process. Responsibilities are: \n \n-Built a high performing team and promoted Intel values \n-Managed individuals and coached their career development, successfully developed two module team leaders with good influence cross function area. \n-Led team to deliver high quality output through operation excellence and excursion prevention \n-Continuously reduced cost by setting audacious goal and approached in an innovative way, achieved over one million dollars saving in recent 2 years. \n-Department quality owner, consistently drove baseline improvement through LEAN Six Sigma and FMEA, as a result over 60% excursion reduced \n-Department HPM coach, promoted LEAN culture throughout organization to pursue manufacture excellence. \n-Department project team coach to drive cost reduction and capacity extension. Senior Process Engineer Intel Corporation December 2009  –  August 2011  (1 year 9 months) Dalian, Liaoning, China Senior process engineer in Metal area after finishing one year technical transferring assignment in US, and responsible for multiple equipment start up and process qualification, with the great technical expertise and strong hands on background, successfully overcame technical barrier of reuse equipment and managed those projects completion before designed schedule. Process Engineer Intel Corporation October 2008  –  December 2009  (1 year 3 months) Octillo, Phoenix, Arizona Area New process engineer in Intel and took assignment of technology transfer in Phoenix, responsible for transfer deliverables which range from construction to understanding process marginality between downstream and upstream, build strong technical capability in both hardware, proces and system which enable a successful startup late on. Equipment Team leader SMIC January 2007  –  August 2008  (1 year 8 months) Beijing City, China PVD Equipment team leader, lead a junior team with 28 employees, improved teams motivation and productivity, and delivered business result in terms of quality, cost and output under pressure.  \n-Defined purchasing specifications of new equipment and adaptations based on process requirements \n-Assisted plant layouts planning and facility system designing per equipment requirements \n-Coordinated equipment installation and relocation, prioritized tasks to achieve tight deadline \n-Mapped team's long term plan based on operational requirement \n Equipment Engineer SMIC August 2003  –  December 2006  (3 years 5 months) Beijing City, China Joined SMIC as a equipment engineer after graduated, demonstrated great learning capability and technical skills \n-Extensive hands on preventive maintenance and repair service, well understood sub-components \n-Proven ability in establishing maintenance and repair standard for new equipment and process \n-Developed operation and maintenance procedures/instructions, and proliferated in MES  \n-Excellent trouble shooting skills, fluent in 8D problem solving \n-Demonstrated great knowledge of SPC \n-Extensively worked on material sourcing and qualification to achieve cost down Chemical Vapor Depsition Process Engineering Manager Intel Corporation June 2014  –  May 2015  (1 year) Dalian, Liaoning, China Lead a mature team and persue continuous improvement through LSS process. especially focus system building up and standardization. Chemical Vapor Depsition Process Engineering Manager Intel Corporation June 2014  –  May 2015  (1 year) Dalian, Liaoning, China Lead a mature team and persue continuous improvement through LSS process. especially focus system building up and standardization. Metallization Process Engineering Manager Intel Corporation September 2011  –  May 2014  (2 years 9 months) Dalian, Liaoning, China Metal Engineering Manager in a LEAN factory in Intel Dalian site. Manages two module teams and millions of manufacture equipment & process. Responsibilities are: \n \n-Built a high performing team and promoted Intel values \n-Managed individuals and coached their career development, successfully developed two module team leaders with good influence cross function area. \n-Led team to deliver high quality output through operation excellence and excursion prevention \n-Continuously reduced cost by setting audacious goal and approached in an innovative way, achieved over one million dollars saving in recent 2 years. \n-Department quality owner, consistently drove baseline improvement through LEAN Six Sigma and FMEA, as a result over 60% excursion reduced \n-Department HPM coach, promoted LEAN culture throughout organization to pursue manufacture excellence. \n-Department project team coach to drive cost reduction and capacity extension. Metallization Process Engineering Manager Intel Corporation September 2011  –  May 2014  (2 years 9 months) Dalian, Liaoning, China Metal Engineering Manager in a LEAN factory in Intel Dalian site. Manages two module teams and millions of manufacture equipment & process. Responsibilities are: \n \n-Built a high performing team and promoted Intel values \n-Managed individuals and coached their career development, successfully developed two module team leaders with good influence cross function area. \n-Led team to deliver high quality output through operation excellence and excursion prevention \n-Continuously reduced cost by setting audacious goal and approached in an innovative way, achieved over one million dollars saving in recent 2 years. \n-Department quality owner, consistently drove baseline improvement through LEAN Six Sigma and FMEA, as a result over 60% excursion reduced \n-Department HPM coach, promoted LEAN culture throughout organization to pursue manufacture excellence. \n-Department project team coach to drive cost reduction and capacity extension. Senior Process Engineer Intel Corporation December 2009  –  August 2011  (1 year 9 months) Dalian, Liaoning, China Senior process engineer in Metal area after finishing one year technical transferring assignment in US, and responsible for multiple equipment start up and process qualification, with the great technical expertise and strong hands on background, successfully overcame technical barrier of reuse equipment and managed those projects completion before designed schedule. Senior Process Engineer Intel Corporation December 2009  –  August 2011  (1 year 9 months) Dalian, Liaoning, China Senior process engineer in Metal area after finishing one year technical transferring assignment in US, and responsible for multiple equipment start up and process qualification, with the great technical expertise and strong hands on background, successfully overcame technical barrier of reuse equipment and managed those projects completion before designed schedule. Process Engineer Intel Corporation October 2008  –  December 2009  (1 year 3 months) Octillo, Phoenix, Arizona Area New process engineer in Intel and took assignment of technology transfer in Phoenix, responsible for transfer deliverables which range from construction to understanding process marginality between downstream and upstream, build strong technical capability in both hardware, proces and system which enable a successful startup late on. Process Engineer Intel Corporation October 2008  –  December 2009  (1 year 3 months) Octillo, Phoenix, Arizona Area New process engineer in Intel and took assignment of technology transfer in Phoenix, responsible for transfer deliverables which range from construction to understanding process marginality between downstream and upstream, build strong technical capability in both hardware, proces and system which enable a successful startup late on. Equipment Team leader SMIC January 2007  –  August 2008  (1 year 8 months) Beijing City, China PVD Equipment team leader, lead a junior team with 28 employees, improved teams motivation and productivity, and delivered business result in terms of quality, cost and output under pressure.  \n-Defined purchasing specifications of new equipment and adaptations based on process requirements \n-Assisted plant layouts planning and facility system designing per equipment requirements \n-Coordinated equipment installation and relocation, prioritized tasks to achieve tight deadline \n-Mapped team's long term plan based on operational requirement \n Equipment Team leader SMIC January 2007  –  August 2008  (1 year 8 months) Beijing City, China PVD Equipment team leader, lead a junior team with 28 employees, improved teams motivation and productivity, and delivered business result in terms of quality, cost and output under pressure.  \n-Defined purchasing specifications of new equipment and adaptations based on process requirements \n-Assisted plant layouts planning and facility system designing per equipment requirements \n-Coordinated equipment installation and relocation, prioritized tasks to achieve tight deadline \n-Mapped team's long term plan based on operational requirement \n Equipment Engineer SMIC August 2003  –  December 2006  (3 years 5 months) Beijing City, China Joined SMIC as a equipment engineer after graduated, demonstrated great learning capability and technical skills \n-Extensive hands on preventive maintenance and repair service, well understood sub-components \n-Proven ability in establishing maintenance and repair standard for new equipment and process \n-Developed operation and maintenance procedures/instructions, and proliferated in MES  \n-Excellent trouble shooting skills, fluent in 8D problem solving \n-Demonstrated great knowledge of SPC \n-Extensively worked on material sourcing and qualification to achieve cost down Equipment Engineer SMIC August 2003  –  December 2006  (3 years 5 months) Beijing City, China Joined SMIC as a equipment engineer after graduated, demonstrated great learning capability and technical skills \n-Extensive hands on preventive maintenance and repair service, well understood sub-components \n-Proven ability in establishing maintenance and repair standard for new equipment and process \n-Developed operation and maintenance procedures/instructions, and proliferated in MES  \n-Excellent trouble shooting skills, fluent in 8D problem solving \n-Demonstrated great knowledge of SPC \n-Extensively worked on material sourcing and qualification to achieve cost down Languages Mandarin Native or bilingual proficiency English Professional working proficiency Mandarin Native or bilingual proficiency English Professional working proficiency Mandarin Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Semiconductors PVD Intel IC SPC Thin Films Design of Experiments Process Integration Semiconductor Industry CMOS Silicon Start-ups Failure Analysis Process Engineering Manufacturing Hardware Lean Thinking HPM Lean Manufacturing Manufacturing... PMP Engineering Management Six Sigma Engineering JMP Management See 11+     See less Skills  Semiconductors PVD Intel IC SPC Thin Films Design of Experiments Process Integration Semiconductor Industry CMOS Silicon Start-ups Failure Analysis Process Engineering Manufacturing Hardware Lean Thinking HPM Lean Manufacturing Manufacturing... PMP Engineering Management Six Sigma Engineering JMP Management See 11+     See less Semiconductors PVD Intel IC SPC Thin Films Design of Experiments Process Integration Semiconductor Industry CMOS Silicon Start-ups Failure Analysis Process Engineering Manufacturing Hardware Lean Thinking HPM Lean Manufacturing Manufacturing... PMP Engineering Management Six Sigma Engineering JMP Management See 11+     See less Semiconductors PVD Intel IC SPC Thin Films Design of Experiments Process Integration Semiconductor Industry CMOS Silicon Start-ups Failure Analysis Process Engineering Manufacturing Hardware Lean Thinking HPM Lean Manufacturing Manufacturing... PMP Engineering Management Six Sigma Engineering JMP Management See 11+     See less ", "Experience Process Engineering Manager Intel Corporation January 1991  – Present (24 years 8 months) Research Engineer US Army Corps of Engineers September 1988  –  June 1990  (1 year 10 months) Champaign, Illinois Corrosion resistant enamel coatings Process Engineering Manager Intel Corporation January 1991  – Present (24 years 8 months) Process Engineering Manager Intel Corporation January 1991  – Present (24 years 8 months) Research Engineer US Army Corps of Engineers September 1988  –  June 1990  (1 year 10 months) Champaign, Illinois Corrosion resistant enamel coatings Research Engineer US Army Corps of Engineers September 1988  –  June 1990  (1 year 10 months) Champaign, Illinois Corrosion resistant enamel coatings Skills Process Engineering Coatings Corrosion Thin Films Semiconductors Design of Experiments SPC Photolithography Engineering Cross-functional Team... Skills  Process Engineering Coatings Corrosion Thin Films Semiconductors Design of Experiments SPC Photolithography Engineering Cross-functional Team... Process Engineering Coatings Corrosion Thin Films Semiconductors Design of Experiments SPC Photolithography Engineering Cross-functional Team... Process Engineering Coatings Corrosion Thin Films Semiconductors Design of Experiments SPC Photolithography Engineering Cross-functional Team... Education University of Illinois at Urbana-Champaign B.S. / M.S.,  Materials Science 1984  – 1990 University of Illinois at Urbana-Champaign B.S. / M.S.,  Materials Science 1984  – 1990 University of Illinois at Urbana-Champaign B.S. / M.S.,  Materials Science 1984  – 1990 University of Illinois at Urbana-Champaign B.S. / M.S.,  Materials Science 1984  – 1990 ", "Skills JMP Etching Semiconductors Process Engineering Silicon Design of Experiments Failure Analysis CMP Manufacturing Engineering Management Semiconductor Industry Cross-functional Team... SPC IC Skills  JMP Etching Semiconductors Process Engineering Silicon Design of Experiments Failure Analysis CMP Manufacturing Engineering Management Semiconductor Industry Cross-functional Team... SPC IC JMP Etching Semiconductors Process Engineering Silicon Design of Experiments Failure Analysis CMP Manufacturing Engineering Management Semiconductor Industry Cross-functional Team... SPC IC JMP Etching Semiconductors Process Engineering Silicon Design of Experiments Failure Analysis CMP Manufacturing Engineering Management Semiconductor Industry Cross-functional Team... SPC IC "]}