{"position": "Process Development Engineer", "company": "Intel Corporation", "profiles": ["Experience Staff Process Development Engineer Intel Corporation December 2001  – Present (13 years 9 months) Staff Process Development Engineer Intel Corporation December 2001  – Present (13 years 9 months) Staff Process Development Engineer Intel Corporation December 2001  – Present (13 years 9 months) Education University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering 1996  – 2001 University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering 1996  – 2001 University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering 1996  – 2001 University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering 1996  – 2001 ", "Experience Senior Process Development Engineer Intel Corporation May 2005  – Present (10 years 4 months) Senior Process Development Engineer Intel Corporation May 2005  – Present (10 years 4 months) Senior Process Development Engineer Intel Corporation May 2005  – Present (10 years 4 months) Skills Assembly Experimental Design Materials Science Nanomaterials Skills  Assembly Experimental Design Materials Science Nanomaterials Assembly Experimental Design Materials Science Nanomaterials Assembly Experimental Design Materials Science Nanomaterials Education Masters in Solid State Physics,  Solid State Physics 2007  – 2008 Bachelors in Engineering,  Materials and Mineral Resources Engineering 2002  – 2005 Worked on nano materials (ZnO nano crystals) for final year dissertation. Dean list recipient. Masters in Solid State Physics,  Solid State Physics 2007  – 2008 Masters in Solid State Physics,  Solid State Physics 2007  – 2008 Masters in Solid State Physics,  Solid State Physics 2007  – 2008 Bachelors in Engineering,  Materials and Mineral Resources Engineering 2002  – 2005 Worked on nano materials (ZnO nano crystals) for final year dissertation. Dean list recipient. Bachelors in Engineering,  Materials and Mineral Resources Engineering 2002  – 2005 Worked on nano materials (ZnO nano crystals) for final year dissertation. Dean list recipient. Bachelors in Engineering,  Materials and Mineral Resources Engineering 2002  – 2005 Worked on nano materials (ZnO nano crystals) for final year dissertation. Dean list recipient. ", "Summary Continuous Solutions develops ultra-efficiency electric motors and generators. We specialize in optimization of design and increasing efficiency through entire life cycle of machine, reducing material, increasing efficiency, and reducing energy consumption. Entrepreneurial explorer, providing leadership, innovation and insight to social change ventures. \n \n Summary Continuous Solutions develops ultra-efficiency electric motors and generators. We specialize in optimization of design and increasing efficiency through entire life cycle of machine, reducing material, increasing efficiency, and reducing energy consumption. Entrepreneurial explorer, providing leadership, innovation and insight to social change ventures. \n \n Continuous Solutions develops ultra-efficiency electric motors and generators. We specialize in optimization of design and increasing efficiency through entire life cycle of machine, reducing material, increasing efficiency, and reducing energy consumption. Entrepreneurial explorer, providing leadership, innovation and insight to social change ventures. \n \n Continuous Solutions develops ultra-efficiency electric motors and generators. We specialize in optimization of design and increasing efficiency through entire life cycle of machine, reducing material, increasing efficiency, and reducing energy consumption. Entrepreneurial explorer, providing leadership, innovation and insight to social change ventures. \n \n Experience Advisory Board Member Casa Verde Connects May 2015  – Present (4 months) Limon 1, Nicaragua Casa Verde was founded in 2010 with an aim to cultivate leadership and global citizenship, through experiential learning, in youth from all backgrounds. Our Service Learning Programs are grounded in year round community development initiatives in El Limon, Nicaragua. Cross-cultural education and sustainable living practices are at the heart of all of our youth programs. \n Co-Founder/CEO Continuous Solutions March 2014  – Present (1 year 6 months) Portland, OR Co-founded by Dr. Nir Vaks and Dr. Nyah Zarate, Continuous Solutions LLC (based in the beautiful city of Portland, OR) is a think tank with a concentration of high-level expertise in the R&D of disruptive energy efficient technologies. Currently, Continuous Solutions is involved in the design of dynamic power-electronic-based electromechanical systems such as those found in vehicles, aircraft, ships, terrestrial power, and spacecraft applications. The company is currently involved in the development of a number of projects including patented high-efficiency, low-cost, Permanent Magnet (PM) based generator to fulfill an initial order of $20 million to provide reliable, inexpensive electricity to villages in rural Asia. In addition, Continuous Solutions is developing a revolutionary direct-drive in-wheel hub motor for high-torque low-speed Electric Vehicles to improve fuel economy, improve vehicle handling, and reduce overall system complexity and cost. Continuous Solutions has extensive knowledge in the area of Smart Grid, Micro Grid technologies, as well as Renewable energy integration for ESS of rural areas. Process Development Engineer Intel Corporation June 2013  –  April 2014  (11 months) Hillsboro, OR Process Development Engineer at Intel Corporation in the Logic Technology Design Group. Her role at Intel entails project management of employees in many role levels, meeting production goals, coordination between departments and technical development. \n \nOther responsibilities in her role as a Process Development Engineer at Intel was to define and establishe flow, procedures, and equipment configuration for microprocessor fabrication and establish process control systems and sustain the process through volume ramp.  \n \nShe led teams to drive improvements on the quality, reliability, cost, yield, process stability/capability of devices. In this team environment she took a leadership role to develop solutions for process matching and work optimization. Research Assistant Purdue University August 2008  –  April 2013  (4 years 9 months) West Lafayette, IN Nyah Zarate, obtained her Ph.D. in the area Particulate Design and behavior characterization at the CHE department in Purdue University. As a research assistant, Nyah was responsible for multiple design, modeling, and simulation projects in the areas of Powder Technology, Particulate design, and manufacturing of Power material. In her Ph.D. dissertation titled “Multiscale Modeling of Particulate Systems by Incorporating Particle Roughness”, Powder behavior during solids handling, such as in the pharmaceutical, food, and personal care industries, is controlled to a large degree by the adhesion characteristics of the powder’s particulate ensemble characteristics. Key physical properties of a particulate system, such as size, geometry, composition, and surface roughness, generally control the particle adhesion. Regardless of the application, there is a general need to control and understand the interactions at the particle-substrate and particle-particle interfaces at micro- to nano-meter scales in order to predict powder behavior and increase efficiency during the industrial processes of solids. Nyah developed and experimentally validated a model to predict adhesion force calculation of particles-surfaces interactions. The model is able to represent particle-surface interactions accurately and with greater robustness by accounting for surface roughness developed Matlab based Discrete Element Method routines. \n PhD NSF fellow Engineering Research Center of Structured Organic Particulate Systems (ERC-SOPS) Purdue University December 2009  –  December 2012  (3 years 1 month) Purdue University C-SOPS focuses on understanding basic aspects of pharmaceutical and manufacturing science where lack of knowledge has been a fundamental barrier to the development of and manufacture of newer dosage forms. These programs range from the formation and characterization of particles and particulate dispersions to the science needed for the development of manufacturing systems operating under closed loop control.  \n \nNyah worked in a cross-disciplinary team of engineers and scientists as well as industry leaders to improve the way pharmaceuticals, foods and agriculture products are manufactured. C-SOPS will focus on advancing the scientific foundation for the optimal design of SOPS with advanced functionality while developing the methodologies for their active control and manufacturing. R&D Engineer Intern in Manufacturing Science and Technology Abbott Laboratories May 2012  –  July 2012  (3 months) North Chicago, IL Summer Internship with Manufacturing Science and Technology group in Global Pharmaceutical Operations at Abbott. Mentor Summer Undergraduate Research Fellowships May 2011  –  September 2011  (5 months) Purdue University Developed research project for an undergraduate researcher to complete and provided guidance for the student. The research project was closely related to my thesis work, \"Multiscale Modeling of Powder Systems-incorporating particle roughness\" which enabled to me to provided ample knowledge and literature to the student on powder technology. Also, outside of research provided student with advice on graduate school and research culture. Teaching Assistant Purdue University January 2011  –  May 2011  (5 months) Introduction to Chemical Engineering - Class of 70 students  \n \nHeld two recitation 40 students/class every week and 4 hours of office hours. Prepared lectures each week for the recitations, assisted in writing exams for the semester and taught three classroom evaluated lectures.The class focused on quantitative applications of steady-state mass and energy balances to solve problems involving multi-component systems and multi-unit chemical processes. Research Assistant Illinois Institute of Technology November 2006  –  May 2008  (1 year 7 months) Greater Chicago Area Center for the Molecular Study of Soft Condensed Matter \n \nAssisted in research that is focused on biomimetic membranes design and structure determination and investigation of fundamental properties of plasma cell membranes and peptide/protein/polymer interactions with cell membranes, specifically for mimetics of antimicrobial peptides - investigating the mechanism of action. \n \nResearch work which included:  \nCharacterizing monolayers with Fluorescence Microscopy \nPreparing solutions for multiple composition of monolayer \nStudy mechanisms of antimicrobial peptide on molecular level \nEmployed synchrotron Grazing incidence X-ray diffraction-Argonne \nNational laboratories. Advisory Board Member Casa Verde Connects May 2015  – Present (4 months) Limon 1, Nicaragua Casa Verde was founded in 2010 with an aim to cultivate leadership and global citizenship, through experiential learning, in youth from all backgrounds. Our Service Learning Programs are grounded in year round community development initiatives in El Limon, Nicaragua. Cross-cultural education and sustainable living practices are at the heart of all of our youth programs. \n Advisory Board Member Casa Verde Connects May 2015  – Present (4 months) Limon 1, Nicaragua Casa Verde was founded in 2010 with an aim to cultivate leadership and global citizenship, through experiential learning, in youth from all backgrounds. Our Service Learning Programs are grounded in year round community development initiatives in El Limon, Nicaragua. Cross-cultural education and sustainable living practices are at the heart of all of our youth programs. \n Co-Founder/CEO Continuous Solutions March 2014  – Present (1 year 6 months) Portland, OR Co-founded by Dr. Nir Vaks and Dr. Nyah Zarate, Continuous Solutions LLC (based in the beautiful city of Portland, OR) is a think tank with a concentration of high-level expertise in the R&D of disruptive energy efficient technologies. Currently, Continuous Solutions is involved in the design of dynamic power-electronic-based electromechanical systems such as those found in vehicles, aircraft, ships, terrestrial power, and spacecraft applications. The company is currently involved in the development of a number of projects including patented high-efficiency, low-cost, Permanent Magnet (PM) based generator to fulfill an initial order of $20 million to provide reliable, inexpensive electricity to villages in rural Asia. In addition, Continuous Solutions is developing a revolutionary direct-drive in-wheel hub motor for high-torque low-speed Electric Vehicles to improve fuel economy, improve vehicle handling, and reduce overall system complexity and cost. Continuous Solutions has extensive knowledge in the area of Smart Grid, Micro Grid technologies, as well as Renewable energy integration for ESS of rural areas. Co-Founder/CEO Continuous Solutions March 2014  – Present (1 year 6 months) Portland, OR Co-founded by Dr. Nir Vaks and Dr. Nyah Zarate, Continuous Solutions LLC (based in the beautiful city of Portland, OR) is a think tank with a concentration of high-level expertise in the R&D of disruptive energy efficient technologies. Currently, Continuous Solutions is involved in the design of dynamic power-electronic-based electromechanical systems such as those found in vehicles, aircraft, ships, terrestrial power, and spacecraft applications. The company is currently involved in the development of a number of projects including patented high-efficiency, low-cost, Permanent Magnet (PM) based generator to fulfill an initial order of $20 million to provide reliable, inexpensive electricity to villages in rural Asia. In addition, Continuous Solutions is developing a revolutionary direct-drive in-wheel hub motor for high-torque low-speed Electric Vehicles to improve fuel economy, improve vehicle handling, and reduce overall system complexity and cost. Continuous Solutions has extensive knowledge in the area of Smart Grid, Micro Grid technologies, as well as Renewable energy integration for ESS of rural areas. Process Development Engineer Intel Corporation June 2013  –  April 2014  (11 months) Hillsboro, OR Process Development Engineer at Intel Corporation in the Logic Technology Design Group. Her role at Intel entails project management of employees in many role levels, meeting production goals, coordination between departments and technical development. \n \nOther responsibilities in her role as a Process Development Engineer at Intel was to define and establishe flow, procedures, and equipment configuration for microprocessor fabrication and establish process control systems and sustain the process through volume ramp.  \n \nShe led teams to drive improvements on the quality, reliability, cost, yield, process stability/capability of devices. In this team environment she took a leadership role to develop solutions for process matching and work optimization. Process Development Engineer Intel Corporation June 2013  –  April 2014  (11 months) Hillsboro, OR Process Development Engineer at Intel Corporation in the Logic Technology Design Group. Her role at Intel entails project management of employees in many role levels, meeting production goals, coordination between departments and technical development. \n \nOther responsibilities in her role as a Process Development Engineer at Intel was to define and establishe flow, procedures, and equipment configuration for microprocessor fabrication and establish process control systems and sustain the process through volume ramp.  \n \nShe led teams to drive improvements on the quality, reliability, cost, yield, process stability/capability of devices. In this team environment she took a leadership role to develop solutions for process matching and work optimization. Research Assistant Purdue University August 2008  –  April 2013  (4 years 9 months) West Lafayette, IN Nyah Zarate, obtained her Ph.D. in the area Particulate Design and behavior characterization at the CHE department in Purdue University. As a research assistant, Nyah was responsible for multiple design, modeling, and simulation projects in the areas of Powder Technology, Particulate design, and manufacturing of Power material. In her Ph.D. dissertation titled “Multiscale Modeling of Particulate Systems by Incorporating Particle Roughness”, Powder behavior during solids handling, such as in the pharmaceutical, food, and personal care industries, is controlled to a large degree by the adhesion characteristics of the powder’s particulate ensemble characteristics. Key physical properties of a particulate system, such as size, geometry, composition, and surface roughness, generally control the particle adhesion. Regardless of the application, there is a general need to control and understand the interactions at the particle-substrate and particle-particle interfaces at micro- to nano-meter scales in order to predict powder behavior and increase efficiency during the industrial processes of solids. Nyah developed and experimentally validated a model to predict adhesion force calculation of particles-surfaces interactions. The model is able to represent particle-surface interactions accurately and with greater robustness by accounting for surface roughness developed Matlab based Discrete Element Method routines. \n Research Assistant Purdue University August 2008  –  April 2013  (4 years 9 months) West Lafayette, IN Nyah Zarate, obtained her Ph.D. in the area Particulate Design and behavior characterization at the CHE department in Purdue University. As a research assistant, Nyah was responsible for multiple design, modeling, and simulation projects in the areas of Powder Technology, Particulate design, and manufacturing of Power material. In her Ph.D. dissertation titled “Multiscale Modeling of Particulate Systems by Incorporating Particle Roughness”, Powder behavior during solids handling, such as in the pharmaceutical, food, and personal care industries, is controlled to a large degree by the adhesion characteristics of the powder’s particulate ensemble characteristics. Key physical properties of a particulate system, such as size, geometry, composition, and surface roughness, generally control the particle adhesion. Regardless of the application, there is a general need to control and understand the interactions at the particle-substrate and particle-particle interfaces at micro- to nano-meter scales in order to predict powder behavior and increase efficiency during the industrial processes of solids. Nyah developed and experimentally validated a model to predict adhesion force calculation of particles-surfaces interactions. The model is able to represent particle-surface interactions accurately and with greater robustness by accounting for surface roughness developed Matlab based Discrete Element Method routines. \n PhD NSF fellow Engineering Research Center of Structured Organic Particulate Systems (ERC-SOPS) Purdue University December 2009  –  December 2012  (3 years 1 month) Purdue University C-SOPS focuses on understanding basic aspects of pharmaceutical and manufacturing science where lack of knowledge has been a fundamental barrier to the development of and manufacture of newer dosage forms. These programs range from the formation and characterization of particles and particulate dispersions to the science needed for the development of manufacturing systems operating under closed loop control.  \n \nNyah worked in a cross-disciplinary team of engineers and scientists as well as industry leaders to improve the way pharmaceuticals, foods and agriculture products are manufactured. C-SOPS will focus on advancing the scientific foundation for the optimal design of SOPS with advanced functionality while developing the methodologies for their active control and manufacturing. PhD NSF fellow Engineering Research Center of Structured Organic Particulate Systems (ERC-SOPS) Purdue University December 2009  –  December 2012  (3 years 1 month) Purdue University C-SOPS focuses on understanding basic aspects of pharmaceutical and manufacturing science where lack of knowledge has been a fundamental barrier to the development of and manufacture of newer dosage forms. These programs range from the formation and characterization of particles and particulate dispersions to the science needed for the development of manufacturing systems operating under closed loop control.  \n \nNyah worked in a cross-disciplinary team of engineers and scientists as well as industry leaders to improve the way pharmaceuticals, foods and agriculture products are manufactured. C-SOPS will focus on advancing the scientific foundation for the optimal design of SOPS with advanced functionality while developing the methodologies for their active control and manufacturing. R&D Engineer Intern in Manufacturing Science and Technology Abbott Laboratories May 2012  –  July 2012  (3 months) North Chicago, IL Summer Internship with Manufacturing Science and Technology group in Global Pharmaceutical Operations at Abbott. R&D Engineer Intern in Manufacturing Science and Technology Abbott Laboratories May 2012  –  July 2012  (3 months) North Chicago, IL Summer Internship with Manufacturing Science and Technology group in Global Pharmaceutical Operations at Abbott. Mentor Summer Undergraduate Research Fellowships May 2011  –  September 2011  (5 months) Purdue University Developed research project for an undergraduate researcher to complete and provided guidance for the student. The research project was closely related to my thesis work, \"Multiscale Modeling of Powder Systems-incorporating particle roughness\" which enabled to me to provided ample knowledge and literature to the student on powder technology. Also, outside of research provided student with advice on graduate school and research culture. Mentor Summer Undergraduate Research Fellowships May 2011  –  September 2011  (5 months) Purdue University Developed research project for an undergraduate researcher to complete and provided guidance for the student. The research project was closely related to my thesis work, \"Multiscale Modeling of Powder Systems-incorporating particle roughness\" which enabled to me to provided ample knowledge and literature to the student on powder technology. Also, outside of research provided student with advice on graduate school and research culture. Teaching Assistant Purdue University January 2011  –  May 2011  (5 months) Introduction to Chemical Engineering - Class of 70 students  \n \nHeld two recitation 40 students/class every week and 4 hours of office hours. Prepared lectures each week for the recitations, assisted in writing exams for the semester and taught three classroom evaluated lectures.The class focused on quantitative applications of steady-state mass and energy balances to solve problems involving multi-component systems and multi-unit chemical processes. Teaching Assistant Purdue University January 2011  –  May 2011  (5 months) Introduction to Chemical Engineering - Class of 70 students  \n \nHeld two recitation 40 students/class every week and 4 hours of office hours. Prepared lectures each week for the recitations, assisted in writing exams for the semester and taught three classroom evaluated lectures.The class focused on quantitative applications of steady-state mass and energy balances to solve problems involving multi-component systems and multi-unit chemical processes. Research Assistant Illinois Institute of Technology November 2006  –  May 2008  (1 year 7 months) Greater Chicago Area Center for the Molecular Study of Soft Condensed Matter \n \nAssisted in research that is focused on biomimetic membranes design and structure determination and investigation of fundamental properties of plasma cell membranes and peptide/protein/polymer interactions with cell membranes, specifically for mimetics of antimicrobial peptides - investigating the mechanism of action. \n \nResearch work which included:  \nCharacterizing monolayers with Fluorescence Microscopy \nPreparing solutions for multiple composition of monolayer \nStudy mechanisms of antimicrobial peptide on molecular level \nEmployed synchrotron Grazing incidence X-ray diffraction-Argonne \nNational laboratories. Research Assistant Illinois Institute of Technology November 2006  –  May 2008  (1 year 7 months) Greater Chicago Area Center for the Molecular Study of Soft Condensed Matter \n \nAssisted in research that is focused on biomimetic membranes design and structure determination and investigation of fundamental properties of plasma cell membranes and peptide/protein/polymer interactions with cell membranes, specifically for mimetics of antimicrobial peptides - investigating the mechanism of action. \n \nResearch work which included:  \nCharacterizing monolayers with Fluorescence Microscopy \nPreparing solutions for multiple composition of monolayer \nStudy mechanisms of antimicrobial peptide on molecular level \nEmployed synchrotron Grazing incidence X-ray diffraction-Argonne \nNational laboratories. Languages spanish Limited working proficiency Hebrew Limited working proficiency English Native or bilingual proficiency spanish Limited working proficiency Hebrew Limited working proficiency English Native or bilingual proficiency spanish Limited working proficiency Hebrew Limited working proficiency English Native or bilingual proficiency Limited working proficiency Limited working proficiency Native or bilingual proficiency Skills Particle Physics Experimentation Scanning Electron... Microscopy Confocal Microscopy AFM Particle... Particle-Particle... statistical analysis mathematical modelling Electron Microscopy Science Mathematica Chemistry Biomaterials Matlab Particle Mathematical Modeling COMSOL Organic Chemistry Formulation FTIR Chemical Engineering Spectroscopy Characterization Fortran Materials Science Simulations Statistics UV/Vis Nanoparticles Powder X-ray Diffraction Fluorescence Microscopy Differential Scanning... Design of Experiments Nanomaterials Thin Films Aspen Plus TEM Electrochemistry Laboratory Surface Chemistry Heterogeneous Catalysis Nanotechnology R&D Thermodynamics Labview Optical Microscopy Process Simulation NMR See 35+     See less Skills  Particle Physics Experimentation Scanning Electron... Microscopy Confocal Microscopy AFM Particle... Particle-Particle... statistical analysis mathematical modelling Electron Microscopy Science Mathematica Chemistry Biomaterials Matlab Particle Mathematical Modeling COMSOL Organic Chemistry Formulation FTIR Chemical Engineering Spectroscopy Characterization Fortran Materials Science Simulations Statistics UV/Vis Nanoparticles Powder X-ray Diffraction Fluorescence Microscopy Differential Scanning... Design of Experiments Nanomaterials Thin Films Aspen Plus TEM Electrochemistry Laboratory Surface Chemistry Heterogeneous Catalysis Nanotechnology R&D Thermodynamics Labview Optical Microscopy Process Simulation NMR See 35+     See less Particle Physics Experimentation Scanning Electron... Microscopy Confocal Microscopy AFM Particle... Particle-Particle... statistical analysis mathematical modelling Electron Microscopy Science Mathematica Chemistry Biomaterials Matlab Particle Mathematical Modeling COMSOL Organic Chemistry Formulation FTIR Chemical Engineering Spectroscopy Characterization Fortran Materials Science Simulations Statistics UV/Vis Nanoparticles Powder X-ray Diffraction Fluorescence Microscopy Differential Scanning... Design of Experiments Nanomaterials Thin Films Aspen Plus TEM Electrochemistry Laboratory Surface Chemistry Heterogeneous Catalysis Nanotechnology R&D Thermodynamics Labview Optical Microscopy Process Simulation NMR See 35+     See less Particle Physics Experimentation Scanning Electron... Microscopy Confocal Microscopy AFM Particle... Particle-Particle... statistical analysis mathematical modelling Electron Microscopy Science Mathematica Chemistry Biomaterials Matlab Particle Mathematical Modeling COMSOL Organic Chemistry Formulation FTIR Chemical Engineering Spectroscopy Characterization Fortran Materials Science Simulations Statistics UV/Vis Nanoparticles Powder X-ray Diffraction Fluorescence Microscopy Differential Scanning... Design of Experiments Nanomaterials Thin Films Aspen Plus TEM Electrochemistry Laboratory Surface Chemistry Heterogeneous Catalysis Nanotechnology R&D Thermodynamics Labview Optical Microscopy Process Simulation NMR See 35+     See less Education Purdue University Doctor of Philosophy (PhD),  Chemical Engineering 2008  – 2013 This is the first study to relate statistical functions of surface roughness to an in-depth examination of particle adhesion force distributions for elastic micron-sized randomly rough particulate systems. The results have significant impact on multi-scale modeling approaches, emphasizing the effect of particle surface topography on adhesion force can impact the assembly of particles, and showing it is not sufficient to model particles as ideal spheres with single point adhesion forces. Using statistical functions to describe the effect of roughness on adhesion can open up the possibility of including such details in macroscopic particle assembly models. Activities and Societies:  AiCHE ,  Purdue Chemical Engineering Graduate Student Organization ,  Women's Initiative Program ,  Purdue Latino Association Purdue University M.S.,  Chemical Engineering 2008  – 2010 State of the art techniques were used and developed to study the effect of capillary condensation under humid conditions using atomic force microscopy (AFM) with α-lactose monohydrate (ALM), one of the most common pharmaceutical excipients used in formulation and silicon nitride as a model particles, against process surfaces.  \n \nPhase imaging was used to measure the change in surface moisture on stainless steel and Perpspex® as relative humidity was increased by 10% increments between 15 and 65%. For hydrophilic stainless steel, the low energy (high moisture) regions correlated closely with the topology of the surface roughness. Liquid accumulated in the valleys as RH levels increased and reversible adhesion force profile between silicon nitride and stainless steel increased from 3 nN to 30 nN due to capillary bridging. Activities and Societies:  Graduate Student Organization ,  Latino Student Association ,  Society of Hispanic Professionals ,  AiChE ,  Powder Technology Forum Illinois Institute of Technology B.S.,  Chemical Engineering 2004  – 2008 Chemical Engineering Activities and Societies:  Undergraduate Research Program ,  Dean’s List ,  AiChE-member ,  Venema Scholarship for Chemical Engineers ,  Academic Challenge Grant Purdue University Doctor of Philosophy (PhD),  Chemical Engineering 2008  – 2013 This is the first study to relate statistical functions of surface roughness to an in-depth examination of particle adhesion force distributions for elastic micron-sized randomly rough particulate systems. The results have significant impact on multi-scale modeling approaches, emphasizing the effect of particle surface topography on adhesion force can impact the assembly of particles, and showing it is not sufficient to model particles as ideal spheres with single point adhesion forces. Using statistical functions to describe the effect of roughness on adhesion can open up the possibility of including such details in macroscopic particle assembly models. Activities and Societies:  AiCHE ,  Purdue Chemical Engineering Graduate Student Organization ,  Women's Initiative Program ,  Purdue Latino Association Purdue University Doctor of Philosophy (PhD),  Chemical Engineering 2008  – 2013 This is the first study to relate statistical functions of surface roughness to an in-depth examination of particle adhesion force distributions for elastic micron-sized randomly rough particulate systems. The results have significant impact on multi-scale modeling approaches, emphasizing the effect of particle surface topography on adhesion force can impact the assembly of particles, and showing it is not sufficient to model particles as ideal spheres with single point adhesion forces. Using statistical functions to describe the effect of roughness on adhesion can open up the possibility of including such details in macroscopic particle assembly models. Activities and Societies:  AiCHE ,  Purdue Chemical Engineering Graduate Student Organization ,  Women's Initiative Program ,  Purdue Latino Association Purdue University Doctor of Philosophy (PhD),  Chemical Engineering 2008  – 2013 This is the first study to relate statistical functions of surface roughness to an in-depth examination of particle adhesion force distributions for elastic micron-sized randomly rough particulate systems. The results have significant impact on multi-scale modeling approaches, emphasizing the effect of particle surface topography on adhesion force can impact the assembly of particles, and showing it is not sufficient to model particles as ideal spheres with single point adhesion forces. Using statistical functions to describe the effect of roughness on adhesion can open up the possibility of including such details in macroscopic particle assembly models. Activities and Societies:  AiCHE ,  Purdue Chemical Engineering Graduate Student Organization ,  Women's Initiative Program ,  Purdue Latino Association Purdue University M.S.,  Chemical Engineering 2008  – 2010 State of the art techniques were used and developed to study the effect of capillary condensation under humid conditions using atomic force microscopy (AFM) with α-lactose monohydrate (ALM), one of the most common pharmaceutical excipients used in formulation and silicon nitride as a model particles, against process surfaces.  \n \nPhase imaging was used to measure the change in surface moisture on stainless steel and Perpspex® as relative humidity was increased by 10% increments between 15 and 65%. For hydrophilic stainless steel, the low energy (high moisture) regions correlated closely with the topology of the surface roughness. Liquid accumulated in the valleys as RH levels increased and reversible adhesion force profile between silicon nitride and stainless steel increased from 3 nN to 30 nN due to capillary bridging. Activities and Societies:  Graduate Student Organization ,  Latino Student Association ,  Society of Hispanic Professionals ,  AiChE ,  Powder Technology Forum Purdue University M.S.,  Chemical Engineering 2008  – 2010 State of the art techniques were used and developed to study the effect of capillary condensation under humid conditions using atomic force microscopy (AFM) with α-lactose monohydrate (ALM), one of the most common pharmaceutical excipients used in formulation and silicon nitride as a model particles, against process surfaces.  \n \nPhase imaging was used to measure the change in surface moisture on stainless steel and Perpspex® as relative humidity was increased by 10% increments between 15 and 65%. For hydrophilic stainless steel, the low energy (high moisture) regions correlated closely with the topology of the surface roughness. Liquid accumulated in the valleys as RH levels increased and reversible adhesion force profile between silicon nitride and stainless steel increased from 3 nN to 30 nN due to capillary bridging. Activities and Societies:  Graduate Student Organization ,  Latino Student Association ,  Society of Hispanic Professionals ,  AiChE ,  Powder Technology Forum Purdue University M.S.,  Chemical Engineering 2008  – 2010 State of the art techniques were used and developed to study the effect of capillary condensation under humid conditions using atomic force microscopy (AFM) with α-lactose monohydrate (ALM), one of the most common pharmaceutical excipients used in formulation and silicon nitride as a model particles, against process surfaces.  \n \nPhase imaging was used to measure the change in surface moisture on stainless steel and Perpspex® as relative humidity was increased by 10% increments between 15 and 65%. For hydrophilic stainless steel, the low energy (high moisture) regions correlated closely with the topology of the surface roughness. Liquid accumulated in the valleys as RH levels increased and reversible adhesion force profile between silicon nitride and stainless steel increased from 3 nN to 30 nN due to capillary bridging. Activities and Societies:  Graduate Student Organization ,  Latino Student Association ,  Society of Hispanic Professionals ,  AiChE ,  Powder Technology Forum Illinois Institute of Technology B.S.,  Chemical Engineering 2004  – 2008 Chemical Engineering Activities and Societies:  Undergraduate Research Program ,  Dean’s List ,  AiChE-member ,  Venema Scholarship for Chemical Engineers ,  Academic Challenge Grant Illinois Institute of Technology B.S.,  Chemical Engineering 2004  – 2008 Chemical Engineering Activities and Societies:  Undergraduate Research Program ,  Dean’s List ,  AiChE-member ,  Venema Scholarship for Chemical Engineers ,  Academic Challenge Grant Illinois Institute of Technology B.S.,  Chemical Engineering 2004  – 2008 Chemical Engineering Activities and Societies:  Undergraduate Research Program ,  Dean’s List ,  AiChE-member ,  Venema Scholarship for Chemical Engineers ,  Academic Challenge Grant Honors & Awards Additional Honors & Awards GAANN fellowship, Eastman Travel Grant, NSF supplemental fellowship, 1st prize outstanding poster award PTF AiCHE 2010, Additional Honors & Awards GAANN fellowship, Eastman Travel Grant, NSF supplemental fellowship, 1st prize outstanding poster award PTF AiCHE 2010, Additional Honors & Awards GAANN fellowship, Eastman Travel Grant, NSF supplemental fellowship, 1st prize outstanding poster award PTF AiCHE 2010, Additional Honors & Awards GAANN fellowship, Eastman Travel Grant, NSF supplemental fellowship, 1st prize outstanding poster award PTF AiCHE 2010, ", "Experience Principal Process Engineer Medtronic Microelectronics Center 2006  – Present (9 years) CPU Burn-in Group Leader Intel Corporation June 2004  –  September 2006  (2 years 4 months) Test & Burn-in Process Development Engineer Intel Corporation March 1997  –  June 2004  (7 years 4 months) Assembly Process Development Engineer Intel Corporation October 1994  –  March 1997  (2 years 6 months) Principal Process Engineer Medtronic Microelectronics Center 2006  – Present (9 years) Principal Process Engineer Medtronic Microelectronics Center 2006  – Present (9 years) CPU Burn-in Group Leader Intel Corporation June 2004  –  September 2006  (2 years 4 months) CPU Burn-in Group Leader Intel Corporation June 2004  –  September 2006  (2 years 4 months) Test & Burn-in Process Development Engineer Intel Corporation March 1997  –  June 2004  (7 years 4 months) Test & Burn-in Process Development Engineer Intel Corporation March 1997  –  June 2004  (7 years 4 months) Assembly Process Development Engineer Intel Corporation October 1994  –  March 1997  (2 years 6 months) Assembly Process Development Engineer Intel Corporation October 1994  –  March 1997  (2 years 6 months) Skills SPC Design of Experiments Failure Analysis Engineering Management Medical Devices Process Engineering Project Management Six Sigma Lean Manufacturing DMAIC Burn-in ESD control Test Automation Process Automation Process Capability Certified Green Belt Black Belt Lean & Six Sigma Green... Lean & Six Sigma Black... Quality System Cross-functional Team... ISO 13485 Manufacturing FDA Metrology Validation FMEA Design for Manufacturing Minitab Automation Design Control Product Development R&D Root Cause Analysis Manufacturing... Characterization See 21+     See less Skills  SPC Design of Experiments Failure Analysis Engineering Management Medical Devices Process Engineering Project Management Six Sigma Lean Manufacturing DMAIC Burn-in ESD control Test Automation Process Automation Process Capability Certified Green Belt Black Belt Lean & Six Sigma Green... Lean & Six Sigma Black... Quality System Cross-functional Team... ISO 13485 Manufacturing FDA Metrology Validation FMEA Design for Manufacturing Minitab Automation Design Control Product Development R&D Root Cause Analysis Manufacturing... Characterization See 21+     See less SPC Design of Experiments Failure Analysis Engineering Management Medical Devices Process Engineering Project Management Six Sigma Lean Manufacturing DMAIC Burn-in ESD control Test Automation Process Automation Process Capability Certified Green Belt Black Belt Lean & Six Sigma Green... Lean & Six Sigma Black... Quality System Cross-functional Team... ISO 13485 Manufacturing FDA Metrology Validation FMEA Design for Manufacturing Minitab Automation Design Control Product Development R&D Root Cause Analysis Manufacturing... Characterization See 21+     See less SPC Design of Experiments Failure Analysis Engineering Management Medical Devices Process Engineering Project Management Six Sigma Lean Manufacturing DMAIC Burn-in ESD control Test Automation Process Automation Process Capability Certified Green Belt Black Belt Lean & Six Sigma Green... Lean & Six Sigma Black... Quality System Cross-functional Team... ISO 13485 Manufacturing FDA Metrology Validation FMEA Design for Manufacturing Minitab Automation Design Control Product Development R&D Root Cause Analysis Manufacturing... Characterization See 21+     See less Education Arizona State University Bachelor of Science (B.S.),  Mechanical Engineering 1989  – 1993 University of Arizona Aerospace Engineering 1988  – 1989 Arizona State University Bachelor of Science (B.S.),  Mechanical Engineering 1989  – 1993 Arizona State University Bachelor of Science (B.S.),  Mechanical Engineering 1989  – 1993 Arizona State University Bachelor of Science (B.S.),  Mechanical Engineering 1989  – 1993 University of Arizona Aerospace Engineering 1988  – 1989 University of Arizona Aerospace Engineering 1988  – 1989 University of Arizona Aerospace Engineering 1988  – 1989 ", "Experience Test Process Development Engineer Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Area Developing Test fixtures/modules for product development and release Process Development Engineer HP Enterprise Security October 2010  –  October 2012  (2 years 1 month) Corvallis, Oregon Area -Responsibility includes manufacturing equipment design, Manufacturing Process design, Process Characterization, Line layout, Fixture design, CAD design, Black Box analysis(IRS, CVS, CPS), FMEA analysis, Parts design review, NPI, Prototyping, Lean Manufacturing Process, Material flow design. \n-Involve with processes such as Adhesive Dispensing, Wafer Dies, injection Molding, Cast molding, Printed circuit Boards assembly, Wire bonding, Ultrasonic Welding, Heat staking, Cleaning/Flushing, Clean room processes(Class 1000) . \n-New/Additional responsibilities includes – Developing process control specification plans, Design of experiments Scheduling, Product/Process change management, Engineering Product Allocation, Indirect material forecasting, Joint Team (R & D, Materials, Process engineering, Quality engineering, and Off- site manufacturing) coordination. Sr. Manufacturing Component Engineer Versalogic Inc June 2006  –  June 2008  (2 years 1 month) Eugene, Oregon Area -Primary responsibility Component Engineer is to establish RoHS qualification for all components. ---Source critical end of Life, critical components, establish second source, and qualify all components use for manufacturing. \n-Components qualification includes: - RoHS certified, MSD certified, Process temperature (Reflow) certified, Lead finishing certified, and material/package type. Coordinate all component selection with suppliers and R & D. \n-Trouble shoot component issues and disposition all inventory associated with defects. \n-Validate all new product documentation using OrCad to review schematics, drawing, and component layout. \n-Review all BOMs and assembly drawings. Produce work instructions/process documents, tooling/fixtures to enhance the manufacturing process. \n-Established all cables connectivity/Interface for PC104 computer embedded systems. \n-\tEmbedded systems consist of: Ethernet, BIOS, USB, HDMI, SPI, and compact flash. Operations Manager ISSPRO Inc February 1999  –  November 2001  (2 years 10 months) Portland, Oregon Area Managing Manufacturing Engineering, Manufacturing, Purchasing, Production Control & Logistics. Responsible for New Product Introduction, Manufacturing, Capital Equipment, Test Development, and Sustaining manufacturing engineering. \nResponsible for maintenance & facility - including machine shop. Working partnerships program with suppliers and CM's. Sr. Manufacturing Engineer ADC March 1997  –  November 1998  (1 year 9 months) Portland, Oregon Area Work with CMs to move the Fibermux product line to Oregon from CA. Responsible for NPI activities on IMA & CBR data traffic headend. Work with R & D to facilitate smooth transition of new products to manufacturing, Work with CM's on proto's and production Mgr Manufacturing Engineering C-COR January 1995  –  March 1997  (2 years 3 months) State College, Pennsylvania Area Managing Manufacturing Engineering and Facilities. Responsible for New Product Introduction, Manufacturing Process, Capital Equipment, Test Development, and Sustaining manufacturing engineering. Established 65,000 square feet plant from empty building to producing RF electronic transmitters and receivers. \nResponsible for maintenance & facility - including machine shop. Working partnerships program with suppliers and CM's. Test Process Development Engineer Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Area Developing Test fixtures/modules for product development and release Test Process Development Engineer Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Area Developing Test fixtures/modules for product development and release Process Development Engineer HP Enterprise Security October 2010  –  October 2012  (2 years 1 month) Corvallis, Oregon Area -Responsibility includes manufacturing equipment design, Manufacturing Process design, Process Characterization, Line layout, Fixture design, CAD design, Black Box analysis(IRS, CVS, CPS), FMEA analysis, Parts design review, NPI, Prototyping, Lean Manufacturing Process, Material flow design. \n-Involve with processes such as Adhesive Dispensing, Wafer Dies, injection Molding, Cast molding, Printed circuit Boards assembly, Wire bonding, Ultrasonic Welding, Heat staking, Cleaning/Flushing, Clean room processes(Class 1000) . \n-New/Additional responsibilities includes – Developing process control specification plans, Design of experiments Scheduling, Product/Process change management, Engineering Product Allocation, Indirect material forecasting, Joint Team (R & D, Materials, Process engineering, Quality engineering, and Off- site manufacturing) coordination. Process Development Engineer HP Enterprise Security October 2010  –  October 2012  (2 years 1 month) Corvallis, Oregon Area -Responsibility includes manufacturing equipment design, Manufacturing Process design, Process Characterization, Line layout, Fixture design, CAD design, Black Box analysis(IRS, CVS, CPS), FMEA analysis, Parts design review, NPI, Prototyping, Lean Manufacturing Process, Material flow design. \n-Involve with processes such as Adhesive Dispensing, Wafer Dies, injection Molding, Cast molding, Printed circuit Boards assembly, Wire bonding, Ultrasonic Welding, Heat staking, Cleaning/Flushing, Clean room processes(Class 1000) . \n-New/Additional responsibilities includes – Developing process control specification plans, Design of experiments Scheduling, Product/Process change management, Engineering Product Allocation, Indirect material forecasting, Joint Team (R & D, Materials, Process engineering, Quality engineering, and Off- site manufacturing) coordination. Sr. Manufacturing Component Engineer Versalogic Inc June 2006  –  June 2008  (2 years 1 month) Eugene, Oregon Area -Primary responsibility Component Engineer is to establish RoHS qualification for all components. ---Source critical end of Life, critical components, establish second source, and qualify all components use for manufacturing. \n-Components qualification includes: - RoHS certified, MSD certified, Process temperature (Reflow) certified, Lead finishing certified, and material/package type. Coordinate all component selection with suppliers and R & D. \n-Trouble shoot component issues and disposition all inventory associated with defects. \n-Validate all new product documentation using OrCad to review schematics, drawing, and component layout. \n-Review all BOMs and assembly drawings. Produce work instructions/process documents, tooling/fixtures to enhance the manufacturing process. \n-Established all cables connectivity/Interface for PC104 computer embedded systems. \n-\tEmbedded systems consist of: Ethernet, BIOS, USB, HDMI, SPI, and compact flash. Sr. Manufacturing Component Engineer Versalogic Inc June 2006  –  June 2008  (2 years 1 month) Eugene, Oregon Area -Primary responsibility Component Engineer is to establish RoHS qualification for all components. ---Source critical end of Life, critical components, establish second source, and qualify all components use for manufacturing. \n-Components qualification includes: - RoHS certified, MSD certified, Process temperature (Reflow) certified, Lead finishing certified, and material/package type. Coordinate all component selection with suppliers and R & D. \n-Trouble shoot component issues and disposition all inventory associated with defects. \n-Validate all new product documentation using OrCad to review schematics, drawing, and component layout. \n-Review all BOMs and assembly drawings. Produce work instructions/process documents, tooling/fixtures to enhance the manufacturing process. \n-Established all cables connectivity/Interface for PC104 computer embedded systems. \n-\tEmbedded systems consist of: Ethernet, BIOS, USB, HDMI, SPI, and compact flash. Operations Manager ISSPRO Inc February 1999  –  November 2001  (2 years 10 months) Portland, Oregon Area Managing Manufacturing Engineering, Manufacturing, Purchasing, Production Control & Logistics. Responsible for New Product Introduction, Manufacturing, Capital Equipment, Test Development, and Sustaining manufacturing engineering. \nResponsible for maintenance & facility - including machine shop. Working partnerships program with suppliers and CM's. Operations Manager ISSPRO Inc February 1999  –  November 2001  (2 years 10 months) Portland, Oregon Area Managing Manufacturing Engineering, Manufacturing, Purchasing, Production Control & Logistics. Responsible for New Product Introduction, Manufacturing, Capital Equipment, Test Development, and Sustaining manufacturing engineering. \nResponsible for maintenance & facility - including machine shop. Working partnerships program with suppliers and CM's. Sr. Manufacturing Engineer ADC March 1997  –  November 1998  (1 year 9 months) Portland, Oregon Area Work with CMs to move the Fibermux product line to Oregon from CA. Responsible for NPI activities on IMA & CBR data traffic headend. Work with R & D to facilitate smooth transition of new products to manufacturing, Work with CM's on proto's and production Sr. Manufacturing Engineer ADC March 1997  –  November 1998  (1 year 9 months) Portland, Oregon Area Work with CMs to move the Fibermux product line to Oregon from CA. Responsible for NPI activities on IMA & CBR data traffic headend. Work with R & D to facilitate smooth transition of new products to manufacturing, Work with CM's on proto's and production Mgr Manufacturing Engineering C-COR January 1995  –  March 1997  (2 years 3 months) State College, Pennsylvania Area Managing Manufacturing Engineering and Facilities. Responsible for New Product Introduction, Manufacturing Process, Capital Equipment, Test Development, and Sustaining manufacturing engineering. Established 65,000 square feet plant from empty building to producing RF electronic transmitters and receivers. \nResponsible for maintenance & facility - including machine shop. Working partnerships program with suppliers and CM's. Mgr Manufacturing Engineering C-COR January 1995  –  March 1997  (2 years 3 months) State College, Pennsylvania Area Managing Manufacturing Engineering and Facilities. Responsible for New Product Introduction, Manufacturing Process, Capital Equipment, Test Development, and Sustaining manufacturing engineering. Established 65,000 square feet plant from empty building to producing RF electronic transmitters and receivers. \nResponsible for maintenance & facility - including machine shop. Working partnerships program with suppliers and CM's. Education Dowling College Post Master in Total Quality Management,  Quality Management / Order fullfilment / Process\\Project management , 3.5 1992  – 1993 Activities and Societies:  Alliance society - Combined of all Engineering society - with conjunction of the NY State Economic Development Department Dowling College Master of Business Administration (MBA),  Business & Finance , 3.3 1990  – 1992 Activities and Societies:  Secretary for Institute of Industrial Engineers(IIE)\nSociety for Manufacturing Engineers(SME)\nSociety for Surface Mount Technology(SMTA) New York Institute of Technology BS Industrial Engineering,  Operations Research , Production Control & Planning, Material Science & Fluid Mechanics, & Budgeting , 3.25 1983  – 1987 Activities and Societies:  Society of Industrial Engineering Dowling College Post Master in Total Quality Management,  Quality Management / Order fullfilment / Process\\Project management , 3.5 1992  – 1993 Activities and Societies:  Alliance society - Combined of all Engineering society - with conjunction of the NY State Economic Development Department Dowling College Post Master in Total Quality Management,  Quality Management / Order fullfilment / Process\\Project management , 3.5 1992  – 1993 Activities and Societies:  Alliance society - Combined of all Engineering society - with conjunction of the NY State Economic Development Department Dowling College Post Master in Total Quality Management,  Quality Management / Order fullfilment / Process\\Project management , 3.5 1992  – 1993 Activities and Societies:  Alliance society - Combined of all Engineering society - with conjunction of the NY State Economic Development Department Dowling College Master of Business Administration (MBA),  Business & Finance , 3.3 1990  – 1992 Activities and Societies:  Secretary for Institute of Industrial Engineers(IIE)\nSociety for Manufacturing Engineers(SME)\nSociety for Surface Mount Technology(SMTA) Dowling College Master of Business Administration (MBA),  Business & Finance , 3.3 1990  – 1992 Activities and Societies:  Secretary for Institute of Industrial Engineers(IIE)\nSociety for Manufacturing Engineers(SME)\nSociety for Surface Mount Technology(SMTA) Dowling College Master of Business Administration (MBA),  Business & Finance , 3.3 1990  – 1992 Activities and Societies:  Secretary for Institute of Industrial Engineers(IIE)\nSociety for Manufacturing Engineers(SME)\nSociety for Surface Mount Technology(SMTA) New York Institute of Technology BS Industrial Engineering,  Operations Research , Production Control & Planning, Material Science & Fluid Mechanics, & Budgeting , 3.25 1983  – 1987 Activities and Societies:  Society of Industrial Engineering New York Institute of Technology BS Industrial Engineering,  Operations Research , Production Control & Planning, Material Science & Fluid Mechanics, & Budgeting , 3.25 1983  – 1987 Activities and Societies:  Society of Industrial Engineering New York Institute of Technology BS Industrial Engineering,  Operations Research , Production Control & Planning, Material Science & Fluid Mechanics, & Budgeting , 3.25 1983  – 1987 Activities and Societies:  Society of Industrial Engineering ", "Experience Process Development Engineer Intel corporation September 2000  – Present (15 years) Staff Engineer Motorola December 1995  –  July 1999  (3 years 8 months) Principal Engineer Rockwell Collins 1992  –  1995  (3 years) Senior IC/Hybrid Process Engineer Tektronix Inc November 1977  –  February 1992  (14 years 4 months) Process Development Engineer Intel corporation September 2000  – Present (15 years) Process Development Engineer Intel corporation September 2000  – Present (15 years) Staff Engineer Motorola December 1995  –  July 1999  (3 years 8 months) Staff Engineer Motorola December 1995  –  July 1999  (3 years 8 months) Principal Engineer Rockwell Collins 1992  –  1995  (3 years) Principal Engineer Rockwell Collins 1992  –  1995  (3 years) Senior IC/Hybrid Process Engineer Tektronix Inc November 1977  –  February 1992  (14 years 4 months) Senior IC/Hybrid Process Engineer Tektronix Inc November 1977  –  February 1992  (14 years 4 months) ", "Summary Extensive professional experience in product development in information technology and electronic materials industry. Strong knowledge of LCD color photoresist, semiconductor process, luminescent phosphors for solid state lighting and electrophoretic deposition; materials development, product improvement and fabrication. Successful experience to bring challenging new products from lab scale to mass production. Project management and lead experience. \n•\tSemiconductor process and equipment development enabling manufacture of innovative device of architectures. \n•\tMaterials synthesis and formulation experience for lab scale and commercialization. \n•\tProficient knowledge and extensive experience of pigment dispersed photoresist, coating, CVD thin film process, dry etch process, luminescent phosphors synthesis and electrophoretic deposition. \n•\tComprehensive knowledge in LCD, LED, Semiconductor industry. \n•\tGood working knowledge of materials characterizing technique. \n•\tEstablish and maintains effective working relationships with supervisors, team members, cross functional teams. \n•\tOutstanding ability to perform multi-tasking, and handle variety of tasks and shift priorities simultaneously. \n•\tExcellent communication, organizational, analytical and time management skills. \n•\tMultilingual: English, Korean, both verbal and written. Summary Extensive professional experience in product development in information technology and electronic materials industry. Strong knowledge of LCD color photoresist, semiconductor process, luminescent phosphors for solid state lighting and electrophoretic deposition; materials development, product improvement and fabrication. Successful experience to bring challenging new products from lab scale to mass production. Project management and lead experience. \n•\tSemiconductor process and equipment development enabling manufacture of innovative device of architectures. \n•\tMaterials synthesis and formulation experience for lab scale and commercialization. \n•\tProficient knowledge and extensive experience of pigment dispersed photoresist, coating, CVD thin film process, dry etch process, luminescent phosphors synthesis and electrophoretic deposition. \n•\tComprehensive knowledge in LCD, LED, Semiconductor industry. \n•\tGood working knowledge of materials characterizing technique. \n•\tEstablish and maintains effective working relationships with supervisors, team members, cross functional teams. \n•\tOutstanding ability to perform multi-tasking, and handle variety of tasks and shift priorities simultaneously. \n•\tExcellent communication, organizational, analytical and time management skills. \n•\tMultilingual: English, Korean, both verbal and written. Extensive professional experience in product development in information technology and electronic materials industry. Strong knowledge of LCD color photoresist, semiconductor process, luminescent phosphors for solid state lighting and electrophoretic deposition; materials development, product improvement and fabrication. Successful experience to bring challenging new products from lab scale to mass production. Project management and lead experience. \n•\tSemiconductor process and equipment development enabling manufacture of innovative device of architectures. \n•\tMaterials synthesis and formulation experience for lab scale and commercialization. \n•\tProficient knowledge and extensive experience of pigment dispersed photoresist, coating, CVD thin film process, dry etch process, luminescent phosphors synthesis and electrophoretic deposition. \n•\tComprehensive knowledge in LCD, LED, Semiconductor industry. \n•\tGood working knowledge of materials characterizing technique. \n•\tEstablish and maintains effective working relationships with supervisors, team members, cross functional teams. \n•\tOutstanding ability to perform multi-tasking, and handle variety of tasks and shift priorities simultaneously. \n•\tExcellent communication, organizational, analytical and time management skills. \n•\tMultilingual: English, Korean, both verbal and written. Extensive professional experience in product development in information technology and electronic materials industry. Strong knowledge of LCD color photoresist, semiconductor process, luminescent phosphors for solid state lighting and electrophoretic deposition; materials development, product improvement and fabrication. Successful experience to bring challenging new products from lab scale to mass production. Project management and lead experience. \n•\tSemiconductor process and equipment development enabling manufacture of innovative device of architectures. \n•\tMaterials synthesis and formulation experience for lab scale and commercialization. \n•\tProficient knowledge and extensive experience of pigment dispersed photoresist, coating, CVD thin film process, dry etch process, luminescent phosphors synthesis and electrophoretic deposition. \n•\tComprehensive knowledge in LCD, LED, Semiconductor industry. \n•\tGood working knowledge of materials characterizing technique. \n•\tEstablish and maintains effective working relationships with supervisors, team members, cross functional teams. \n•\tOutstanding ability to perform multi-tasking, and handle variety of tasks and shift priorities simultaneously. \n•\tExcellent communication, organizational, analytical and time management skills. \n•\tMultilingual: English, Korean, both verbal and written. Experience PTD Process Development Engineer Intel Corporation August 2014  – Present (1 year 1 month) Hillsboro, Oregon PTD Module and Integration Device Yield Engineer \n•\tLeading scientific research enabling manufacture of innovative device architectures \n•\tSemiconductor process and equipment development Researcher/Engineering manager LG Chem September 2003  –  July 2014  (10 years 11 months) Korea Information Technology & Electronic Materials R&D Division \n- Pigment Dispersed Photoresist for LCD TV and LCD monitor \n- Formulation and optimization of Photoresist for High Contrast Ratio Color Filter \n- High sensitive and High Contrast Photoresist Development for LCD Device Process Engineer Samsung Electronics January 2002  –  September 2003  (1 year 9 months) Korea Semiconductor R&D \n- Thin Film Process (CVD) \n- DRAM Memory, NAND and NOR Flash memory PTD Process Development Engineer Intel Corporation August 2014  – Present (1 year 1 month) Hillsboro, Oregon PTD Module and Integration Device Yield Engineer \n•\tLeading scientific research enabling manufacture of innovative device architectures \n•\tSemiconductor process and equipment development PTD Process Development Engineer Intel Corporation August 2014  – Present (1 year 1 month) Hillsboro, Oregon PTD Module and Integration Device Yield Engineer \n•\tLeading scientific research enabling manufacture of innovative device architectures \n•\tSemiconductor process and equipment development Researcher/Engineering manager LG Chem September 2003  –  July 2014  (10 years 11 months) Korea Information Technology & Electronic Materials R&D Division \n- Pigment Dispersed Photoresist for LCD TV and LCD monitor \n- Formulation and optimization of Photoresist for High Contrast Ratio Color Filter \n- High sensitive and High Contrast Photoresist Development for LCD Device Researcher/Engineering manager LG Chem September 2003  –  July 2014  (10 years 11 months) Korea Information Technology & Electronic Materials R&D Division \n- Pigment Dispersed Photoresist for LCD TV and LCD monitor \n- Formulation and optimization of Photoresist for High Contrast Ratio Color Filter \n- High sensitive and High Contrast Photoresist Development for LCD Device Process Engineer Samsung Electronics January 2002  –  September 2003  (1 year 9 months) Korea Semiconductor R&D \n- Thin Film Process (CVD) \n- DRAM Memory, NAND and NOR Flash memory Process Engineer Samsung Electronics January 2002  –  September 2003  (1 year 9 months) Korea Semiconductor R&D \n- Thin Film Process (CVD) \n- DRAM Memory, NAND and NOR Flash memory Skills Materials Science Semiconductor Process Electrophoretic... Luminescence Chemical Synthesis Formulation Coatings Scale-up Process Engineering Pigments Photoresisit LED lighting LCD color filter Material... phosphor Thin Films See 1+     See less Skills  Materials Science Semiconductor Process Electrophoretic... Luminescence Chemical Synthesis Formulation Coatings Scale-up Process Engineering Pigments Photoresisit LED lighting LCD color filter Material... phosphor Thin Films See 1+     See less Materials Science Semiconductor Process Electrophoretic... Luminescence Chemical Synthesis Formulation Coatings Scale-up Process Engineering Pigments Photoresisit LED lighting LCD color filter Material... phosphor Thin Films See 1+     See less Materials Science Semiconductor Process Electrophoretic... Luminescence Chemical Synthesis Formulation Coatings Scale-up Process Engineering Pigments Photoresisit LED lighting LCD color filter Material... phosphor Thin Films See 1+     See less Education University of California, San Diego Doctor of Philosophy (Ph.D.),  Materials Science 2011  – 2013 Thesis: Electrophoretic Deposition of Highly Efficient Phosphors for White Solid State Lighting using near UV-emitting LEDs Georgia Institute of Technology Master's degree,  Materials Science 2009  – 2010 Korea Advanced Institute of Science and Technology Master's degree,  Inorganic Chemistry 2000  – 2002 Organometallic chemistry (C60-metal cluster) University of California, San Diego Doctor of Philosophy (Ph.D.),  Materials Science 2011  – 2013 Thesis: Electrophoretic Deposition of Highly Efficient Phosphors for White Solid State Lighting using near UV-emitting LEDs University of California, San Diego Doctor of Philosophy (Ph.D.),  Materials Science 2011  – 2013 Thesis: Electrophoretic Deposition of Highly Efficient Phosphors for White Solid State Lighting using near UV-emitting LEDs University of California, San Diego Doctor of Philosophy (Ph.D.),  Materials Science 2011  – 2013 Thesis: Electrophoretic Deposition of Highly Efficient Phosphors for White Solid State Lighting using near UV-emitting LEDs Georgia Institute of Technology Master's degree,  Materials Science 2009  – 2010 Georgia Institute of Technology Master's degree,  Materials Science 2009  – 2010 Georgia Institute of Technology Master's degree,  Materials Science 2009  – 2010 Korea Advanced Institute of Science and Technology Master's degree,  Inorganic Chemistry 2000  – 2002 Organometallic chemistry (C60-metal cluster) Korea Advanced Institute of Science and Technology Master's degree,  Inorganic Chemistry 2000  – 2002 Organometallic chemistry (C60-metal cluster) Korea Advanced Institute of Science and Technology Master's degree,  Inorganic Chemistry 2000  – 2002 Organometallic chemistry (C60-metal cluster) ", "Experience Process Development Engineer Intel Corporation March 2012  – Present (3 years 6 months) Portland, Oregon Area Graduate Research Assistant Texas A&M University January 2008  –  December 2011  (4 years) Graduate Teaching Assistant New Mexico Institute of Mining and Technology August 2004  –  December 2007  (3 years 5 months) Graduate Research Assistant New Mexico Institute of Mining and Technology January 2004  –  December 2007  (4 years) Process Development Engineer Intel Corporation March 2012  – Present (3 years 6 months) Portland, Oregon Area Process Development Engineer Intel Corporation March 2012  – Present (3 years 6 months) Portland, Oregon Area Graduate Research Assistant Texas A&M University January 2008  –  December 2011  (4 years) Graduate Research Assistant Texas A&M University January 2008  –  December 2011  (4 years) Graduate Teaching Assistant New Mexico Institute of Mining and Technology August 2004  –  December 2007  (3 years 5 months) Graduate Teaching Assistant New Mexico Institute of Mining and Technology August 2004  –  December 2007  (3 years 5 months) Graduate Research Assistant New Mexico Institute of Mining and Technology January 2004  –  December 2007  (4 years) Graduate Research Assistant New Mexico Institute of Mining and Technology January 2004  –  December 2007  (4 years) Skills Materials Science Characterization Nanotechnology Skills  Materials Science Characterization Nanotechnology Materials Science Characterization Nanotechnology Materials Science Characterization Nanotechnology Education Texas A&M University Ph.D.,  Materials Science and Engineering 2008  – 2011 New Mexico Institute of Mining and Technology M.S.,  Materials Engineering 2004  – 2006 B.S.,  Materials Science and Engineering 1998  – 2003 Texas A&M University Ph.D.,  Materials Science and Engineering 2008  – 2011 Texas A&M University Ph.D.,  Materials Science and Engineering 2008  – 2011 Texas A&M University Ph.D.,  Materials Science and Engineering 2008  – 2011 New Mexico Institute of Mining and Technology M.S.,  Materials Engineering 2004  – 2006 New Mexico Institute of Mining and Technology M.S.,  Materials Engineering 2004  – 2006 New Mexico Institute of Mining and Technology M.S.,  Materials Engineering 2004  – 2006 B.S.,  Materials Science and Engineering 1998  – 2003 B.S.,  Materials Science and Engineering 1998  – 2003 B.S.,  Materials Science and Engineering 1998  – 2003 ", "Summary - Expertise in surface analysis of various materials by using X-ray photoelectron spectroscopy (XPS). \n- Maintained and designed ultra-high vacuum instruments.  \n- 4 years of hands-on experience related to semiconductor material characterization and research. Specialties:- Expertise in surface analysis techniques. \n- Expertise in semiconductor material characterization by using microanalytical techniques including high resolution XRD (HR-XRD), X-ray photoelectron spectroscopy (XPS)/Auger electron spectroscopy (AES), electron microscopy (SEM and TEM), Atomic force microscopy (AFM), thin film stress measurement, ect. \n- Familiar with semiconductor device fabrication process including PVD, CVD,lithography, dry etch and wet etch in the clean room. Summary - Expertise in surface analysis of various materials by using X-ray photoelectron spectroscopy (XPS). \n- Maintained and designed ultra-high vacuum instruments.  \n- 4 years of hands-on experience related to semiconductor material characterization and research. Specialties:- Expertise in surface analysis techniques. \n- Expertise in semiconductor material characterization by using microanalytical techniques including high resolution XRD (HR-XRD), X-ray photoelectron spectroscopy (XPS)/Auger electron spectroscopy (AES), electron microscopy (SEM and TEM), Atomic force microscopy (AFM), thin film stress measurement, ect. \n- Familiar with semiconductor device fabrication process including PVD, CVD,lithography, dry etch and wet etch in the clean room. - Expertise in surface analysis of various materials by using X-ray photoelectron spectroscopy (XPS). \n- Maintained and designed ultra-high vacuum instruments.  \n- 4 years of hands-on experience related to semiconductor material characterization and research. Specialties:- Expertise in surface analysis techniques. \n- Expertise in semiconductor material characterization by using microanalytical techniques including high resolution XRD (HR-XRD), X-ray photoelectron spectroscopy (XPS)/Auger electron spectroscopy (AES), electron microscopy (SEM and TEM), Atomic force microscopy (AFM), thin film stress measurement, ect. \n- Familiar with semiconductor device fabrication process including PVD, CVD,lithography, dry etch and wet etch in the clean room. - Expertise in surface analysis of various materials by using X-ray photoelectron spectroscopy (XPS). \n- Maintained and designed ultra-high vacuum instruments.  \n- 4 years of hands-on experience related to semiconductor material characterization and research. Specialties:- Expertise in surface analysis techniques. \n- Expertise in semiconductor material characterization by using microanalytical techniques including high resolution XRD (HR-XRD), X-ray photoelectron spectroscopy (XPS)/Auger electron spectroscopy (AES), electron microscopy (SEM and TEM), Atomic force microscopy (AFM), thin film stress measurement, ect. \n- Familiar with semiconductor device fabrication process including PVD, CVD,lithography, dry etch and wet etch in the clean room. Experience Process development engineer Intel Corporation December 2011  – Present (3 years 9 months) Graduate Student Researcher University of California, Irvine July 2007  –  November 2011  (4 years 5 months) - Analyzed the liquid/vapor interfaces of aqueous alkali halide solutions by using ambient pressure X-ray photoelectron spectroscopy (AP-XPS) at Berkeley National Labs.  \n- Extensively collaborated with other groups of diverse backgrounds and expertise in surface characterization of various materials (such as semiconductors , nanoparticles, organic and inorganic molecules) by using X-ray photoelectron spectroscopy (XPS). \n-Maintained and designed ultra-high vacuum instruments. \n- Published 4 journal articles with 5 journal articles in preparation. \n- Oral Presentation at 3 international meetings. MATERIALS ANALYSIS ENGINEER National Nano Device Lab, in Taiwan October 2003  –  July 2007  (3 years 10 months) *Analyzed residual stress and microstructure properties for metal interconnects of integrated circuit (IC).  \n*Investigated strained-relaxed Ge epitaxial layers for new IC materials.  \n*Investigated selective growth of nano scale Ge structures on patterned Si substrates.  \n*Awarded 2 US patents as a primary inventor.  \n*Published 3 journal articles. \n*Oral Presentation at 2 international meetings. \n*Involved in the establishment of ISO 9001 certification in the lab. Graduate Student Researcher National Tsing Hua University July 2001  –  July 2003  (2 years 1 month) - Synthesized highly ordered mesoporous silica by formulating the solutions containing different triblock copolymers ( Pluronic P123 or F127) and TEOS (Tetraethylorthosilicate). \n- Synthesized hybrid composite materials, which are metal nanoparticles incorporated in mesoporous silica, utilizing the functionalization of the internal surface of highly orderd mesoporous silica.  \n- Characterized polymer and hybrid composite materials for catalytic applications. \n- Published 2 journal articles. Process development engineer Intel Corporation December 2011  – Present (3 years 9 months) Process development engineer Intel Corporation December 2011  – Present (3 years 9 months) Graduate Student Researcher University of California, Irvine July 2007  –  November 2011  (4 years 5 months) - Analyzed the liquid/vapor interfaces of aqueous alkali halide solutions by using ambient pressure X-ray photoelectron spectroscopy (AP-XPS) at Berkeley National Labs.  \n- Extensively collaborated with other groups of diverse backgrounds and expertise in surface characterization of various materials (such as semiconductors , nanoparticles, organic and inorganic molecules) by using X-ray photoelectron spectroscopy (XPS). \n-Maintained and designed ultra-high vacuum instruments. \n- Published 4 journal articles with 5 journal articles in preparation. \n- Oral Presentation at 3 international meetings. Graduate Student Researcher University of California, Irvine July 2007  –  November 2011  (4 years 5 months) - Analyzed the liquid/vapor interfaces of aqueous alkali halide solutions by using ambient pressure X-ray photoelectron spectroscopy (AP-XPS) at Berkeley National Labs.  \n- Extensively collaborated with other groups of diverse backgrounds and expertise in surface characterization of various materials (such as semiconductors , nanoparticles, organic and inorganic molecules) by using X-ray photoelectron spectroscopy (XPS). \n-Maintained and designed ultra-high vacuum instruments. \n- Published 4 journal articles with 5 journal articles in preparation. \n- Oral Presentation at 3 international meetings. MATERIALS ANALYSIS ENGINEER National Nano Device Lab, in Taiwan October 2003  –  July 2007  (3 years 10 months) *Analyzed residual stress and microstructure properties for metal interconnects of integrated circuit (IC).  \n*Investigated strained-relaxed Ge epitaxial layers for new IC materials.  \n*Investigated selective growth of nano scale Ge structures on patterned Si substrates.  \n*Awarded 2 US patents as a primary inventor.  \n*Published 3 journal articles. \n*Oral Presentation at 2 international meetings. \n*Involved in the establishment of ISO 9001 certification in the lab. MATERIALS ANALYSIS ENGINEER National Nano Device Lab, in Taiwan October 2003  –  July 2007  (3 years 10 months) *Analyzed residual stress and microstructure properties for metal interconnects of integrated circuit (IC).  \n*Investigated strained-relaxed Ge epitaxial layers for new IC materials.  \n*Investigated selective growth of nano scale Ge structures on patterned Si substrates.  \n*Awarded 2 US patents as a primary inventor.  \n*Published 3 journal articles. \n*Oral Presentation at 2 international meetings. \n*Involved in the establishment of ISO 9001 certification in the lab. Graduate Student Researcher National Tsing Hua University July 2001  –  July 2003  (2 years 1 month) - Synthesized highly ordered mesoporous silica by formulating the solutions containing different triblock copolymers ( Pluronic P123 or F127) and TEOS (Tetraethylorthosilicate). \n- Synthesized hybrid composite materials, which are metal nanoparticles incorporated in mesoporous silica, utilizing the functionalization of the internal surface of highly orderd mesoporous silica.  \n- Characterized polymer and hybrid composite materials for catalytic applications. \n- Published 2 journal articles. Graduate Student Researcher National Tsing Hua University July 2001  –  July 2003  (2 years 1 month) - Synthesized highly ordered mesoporous silica by formulating the solutions containing different triblock copolymers ( Pluronic P123 or F127) and TEOS (Tetraethylorthosilicate). \n- Synthesized hybrid composite materials, which are metal nanoparticles incorporated in mesoporous silica, utilizing the functionalization of the internal surface of highly orderd mesoporous silica.  \n- Characterized polymer and hybrid composite materials for catalytic applications. \n- Published 2 journal articles. Education University of California, Irvine PhD,  Chemistry 2007  – 2011 National Tsing Hua University M.S,  Chemistry department 2001  – 2003 National Changhua Univeristy of Education, in Taiwan B.S,  Chemistry 1997  – 2001 University of California, Irvine PhD,  Chemistry 2007  – 2011 University of California, Irvine PhD,  Chemistry 2007  – 2011 University of California, Irvine PhD,  Chemistry 2007  – 2011 National Tsing Hua University M.S,  Chemistry department 2001  – 2003 National Tsing Hua University M.S,  Chemistry department 2001  – 2003 National Tsing Hua University M.S,  Chemistry department 2001  – 2003 National Changhua Univeristy of Education, in Taiwan B.S,  Chemistry 1997  – 2001 National Changhua Univeristy of Education, in Taiwan B.S,  Chemistry 1997  – 2001 National Changhua Univeristy of Education, in Taiwan B.S,  Chemistry 1997  – 2001 ", "Summary Engineering professional with experience leading teams, sustaining high volume manufacturing, and research and development. Solid knowledge of engineering and science fundamentals. Analytical approach with excellent problem solving skills effectively applied to multiple technical and manufacturing problems. Versatile and adaptable to change. positions included petrochemicals R&D, semiconductor operations engineering, technical manager, process development, and technology transfer. Enjoy working on cross-functional teams driving technical and operational improvements \n \n- Research & Development - MEMS - Modeling \n- Model-Based Problem Solving - Engineering Management - Data Analysis \n- Team Leadership - Cost Reduction - Computer Simulation \n- Lean Manufacturing - Lithography - Petrochemicals \n- Process Characterization - Chemical Reactors - Technical Documentation \n Summary Engineering professional with experience leading teams, sustaining high volume manufacturing, and research and development. Solid knowledge of engineering and science fundamentals. Analytical approach with excellent problem solving skills effectively applied to multiple technical and manufacturing problems. Versatile and adaptable to change. positions included petrochemicals R&D, semiconductor operations engineering, technical manager, process development, and technology transfer. Enjoy working on cross-functional teams driving technical and operational improvements \n \n- Research & Development - MEMS - Modeling \n- Model-Based Problem Solving - Engineering Management - Data Analysis \n- Team Leadership - Cost Reduction - Computer Simulation \n- Lean Manufacturing - Lithography - Petrochemicals \n- Process Characterization - Chemical Reactors - Technical Documentation \n Engineering professional with experience leading teams, sustaining high volume manufacturing, and research and development. Solid knowledge of engineering and science fundamentals. Analytical approach with excellent problem solving skills effectively applied to multiple technical and manufacturing problems. Versatile and adaptable to change. positions included petrochemicals R&D, semiconductor operations engineering, technical manager, process development, and technology transfer. Enjoy working on cross-functional teams driving technical and operational improvements \n \n- Research & Development - MEMS - Modeling \n- Model-Based Problem Solving - Engineering Management - Data Analysis \n- Team Leadership - Cost Reduction - Computer Simulation \n- Lean Manufacturing - Lithography - Petrochemicals \n- Process Characterization - Chemical Reactors - Technical Documentation \n Engineering professional with experience leading teams, sustaining high volume manufacturing, and research and development. Solid knowledge of engineering and science fundamentals. Analytical approach with excellent problem solving skills effectively applied to multiple technical and manufacturing problems. Versatile and adaptable to change. positions included petrochemicals R&D, semiconductor operations engineering, technical manager, process development, and technology transfer. Enjoy working on cross-functional teams driving technical and operational improvements \n \n- Research & Development - MEMS - Modeling \n- Model-Based Problem Solving - Engineering Management - Data Analysis \n- Team Leadership - Cost Reduction - Computer Simulation \n- Lean Manufacturing - Lithography - Petrochemicals \n- Process Characterization - Chemical Reactors - Technical Documentation \n Experience Senior Process Development Engineer Intel Corporation November 2011  – Present (3 years 10 months) Hudson, Massachusetts Developed processes for new technologies with focus on optimizing polymer patterning on power management chips. Engage team to successfully investigate and solve source of integrated defects. Modified equipment to enable HVM as well as reduce capital costs, including qualifying new chemicals. Created standards and led team effort to document all operations and their associated equipment aiming at successful transfer to other sites. Engineering Manager Intel February 2006  –  November 2011  (5 years 10 months) Managed lithography engineers responsible for all of the lithography track equipment. After headcount reductions and continued attrition, re-organized team and prioritized cross training, resulting in a much more efficient and smaller team. This team was able to effectively cover the requirements of the factory, increase the quality of operations, while at the same time creating a healthier teamwork environment. Coached and supported the team on model-based problem solving. Led multiple task forces to successfully investigate quality events and place preventative countermeasures. Eliminated output bottlenecks from two areas suffering from high variability in performance. Senior Process Engineer Intel Massachusetts January 2001  –  February 2006  (5 years 2 months) Sustained implant layer lithography operations and lithography track equipment. Lead a multi-site engineering team working on cost reduction and quality improvements. Trained and mentored junior engineers and technicians. Transferred new technologies from development sites to high volume manufacturing in Massachusetts.  \n Senior Research Engineer bp 1996  –  2001  (5 years) Naperville, Illinois BP Chemicals Research and Development, Olefins business group. \nDevelopment of new technologies for olefin production. Technical support for BP-Amoco olefin plants. Maintained, adapted, and improved computer modeling for chemical reactors. Investigated reactor performance issues and improved their availability.  Senior Process Development Engineer Intel Corporation November 2011  – Present (3 years 10 months) Hudson, Massachusetts Developed processes for new technologies with focus on optimizing polymer patterning on power management chips. Engage team to successfully investigate and solve source of integrated defects. Modified equipment to enable HVM as well as reduce capital costs, including qualifying new chemicals. Created standards and led team effort to document all operations and their associated equipment aiming at successful transfer to other sites. Senior Process Development Engineer Intel Corporation November 2011  – Present (3 years 10 months) Hudson, Massachusetts Developed processes for new technologies with focus on optimizing polymer patterning on power management chips. Engage team to successfully investigate and solve source of integrated defects. Modified equipment to enable HVM as well as reduce capital costs, including qualifying new chemicals. Created standards and led team effort to document all operations and their associated equipment aiming at successful transfer to other sites. Engineering Manager Intel February 2006  –  November 2011  (5 years 10 months) Managed lithography engineers responsible for all of the lithography track equipment. After headcount reductions and continued attrition, re-organized team and prioritized cross training, resulting in a much more efficient and smaller team. This team was able to effectively cover the requirements of the factory, increase the quality of operations, while at the same time creating a healthier teamwork environment. Coached and supported the team on model-based problem solving. Led multiple task forces to successfully investigate quality events and place preventative countermeasures. Eliminated output bottlenecks from two areas suffering from high variability in performance. Engineering Manager Intel February 2006  –  November 2011  (5 years 10 months) Managed lithography engineers responsible for all of the lithography track equipment. After headcount reductions and continued attrition, re-organized team and prioritized cross training, resulting in a much more efficient and smaller team. This team was able to effectively cover the requirements of the factory, increase the quality of operations, while at the same time creating a healthier teamwork environment. Coached and supported the team on model-based problem solving. Led multiple task forces to successfully investigate quality events and place preventative countermeasures. Eliminated output bottlenecks from two areas suffering from high variability in performance. Senior Process Engineer Intel Massachusetts January 2001  –  February 2006  (5 years 2 months) Sustained implant layer lithography operations and lithography track equipment. Lead a multi-site engineering team working on cost reduction and quality improvements. Trained and mentored junior engineers and technicians. Transferred new technologies from development sites to high volume manufacturing in Massachusetts.  \n Senior Process Engineer Intel Massachusetts January 2001  –  February 2006  (5 years 2 months) Sustained implant layer lithography operations and lithography track equipment. Lead a multi-site engineering team working on cost reduction and quality improvements. Trained and mentored junior engineers and technicians. Transferred new technologies from development sites to high volume manufacturing in Massachusetts.  \n Senior Research Engineer bp 1996  –  2001  (5 years) Naperville, Illinois BP Chemicals Research and Development, Olefins business group. \nDevelopment of new technologies for olefin production. Technical support for BP-Amoco olefin plants. Maintained, adapted, and improved computer modeling for chemical reactors. Investigated reactor performance issues and improved their availability.  Senior Research Engineer bp 1996  –  2001  (5 years) Naperville, Illinois BP Chemicals Research and Development, Olefins business group. \nDevelopment of new technologies for olefin production. Technical support for BP-Amoco olefin plants. Maintained, adapted, and improved computer modeling for chemical reactors. Investigated reactor performance issues and improved their availability.  Languages   Skills Design of Experiments Process Simulation Lithography Semiconductors Process Engineering Engineering Management Photolithography Engineering Lean Manufacturing JMP Chemical Engineering R&D Management MEMS Problem Solving SPC See 1+     See less Skills  Design of Experiments Process Simulation Lithography Semiconductors Process Engineering Engineering Management Photolithography Engineering Lean Manufacturing JMP Chemical Engineering R&D Management MEMS Problem Solving SPC See 1+     See less Design of Experiments Process Simulation Lithography Semiconductors Process Engineering Engineering Management Photolithography Engineering Lean Manufacturing JMP Chemical Engineering R&D Management MEMS Problem Solving SPC See 1+     See less Design of Experiments Process Simulation Lithography Semiconductors Process Engineering Engineering Management Photolithography Engineering Lean Manufacturing JMP Chemical Engineering R&D Management MEMS Problem Solving SPC See 1+     See less Education Cornell University Ph.D.,  Chemical Engineering 1991  – 1996 Crystal nucleation and growth. Molecular dynamics simulations of hydrates growth from water-gas mixtures. Universidad Simón Bolívar B.S.,  Chemical Engineering 1984  – 1990 Colegio Don Bosco Cornell University Ph.D.,  Chemical Engineering 1991  – 1996 Crystal nucleation and growth. Molecular dynamics simulations of hydrates growth from water-gas mixtures. Cornell University Ph.D.,  Chemical Engineering 1991  – 1996 Crystal nucleation and growth. Molecular dynamics simulations of hydrates growth from water-gas mixtures. Cornell University Ph.D.,  Chemical Engineering 1991  – 1996 Crystal nucleation and growth. Molecular dynamics simulations of hydrates growth from water-gas mixtures. Universidad Simón Bolívar B.S.,  Chemical Engineering 1984  – 1990 Universidad Simón Bolívar B.S.,  Chemical Engineering 1984  – 1990 Universidad Simón Bolívar B.S.,  Chemical Engineering 1984  – 1990 Colegio Don Bosco Colegio Don Bosco Colegio Don Bosco ", "Experience Senior Process Development Engineer Intel Corporation April 2004  – Present (11 years 5 months) Senior Process Development Engineer Agilent Technologies August 1998  –  April 2003  (4 years 9 months) Senior Process Development Engineer Hewlett Packard September 1996  –  November 1998  (2 years 3 months) Senior Process Development Engineer SDL, Inc. 1989  –  1996  (7 years) San Jose, CA Senior Process Development Engineer Intel Corporation April 2004  – Present (11 years 5 months) Senior Process Development Engineer Intel Corporation April 2004  – Present (11 years 5 months) Senior Process Development Engineer Agilent Technologies August 1998  –  April 2003  (4 years 9 months) Senior Process Development Engineer Agilent Technologies August 1998  –  April 2003  (4 years 9 months) Senior Process Development Engineer Hewlett Packard September 1996  –  November 1998  (2 years 3 months) Senior Process Development Engineer Hewlett Packard September 1996  –  November 1998  (2 years 3 months) Senior Process Development Engineer SDL, Inc. 1989  –  1996  (7 years) San Jose, CA Senior Process Development Engineer SDL, Inc. 1989  –  1996  (7 years) San Jose, CA Skills Semiconductors Design of Experiments Characterization Optoelectronics Thin Films Semiconductor Industry Failure Analysis Silicon Process Simulation Metrology JMP MEMS Process Integration SPC PVD Engineering Management Electronics Manufacturing See 3+     See less Skills  Semiconductors Design of Experiments Characterization Optoelectronics Thin Films Semiconductor Industry Failure Analysis Silicon Process Simulation Metrology JMP MEMS Process Integration SPC PVD Engineering Management Electronics Manufacturing See 3+     See less Semiconductors Design of Experiments Characterization Optoelectronics Thin Films Semiconductor Industry Failure Analysis Silicon Process Simulation Metrology JMP MEMS Process Integration SPC PVD Engineering Management Electronics Manufacturing See 3+     See less Semiconductors Design of Experiments Characterization Optoelectronics Thin Films Semiconductor Industry Failure Analysis Silicon Process Simulation Metrology JMP MEMS Process Integration SPC PVD Engineering Management Electronics Manufacturing See 3+     See less Education College of Charleston BS,  Chemistry University of North Carolina at Chapel Hill Ph.D.,  Chemistry College of Charleston BS,  Chemistry College of Charleston BS,  Chemistry College of Charleston BS,  Chemistry University of North Carolina at Chapel Hill Ph.D.,  Chemistry University of North Carolina at Chapel Hill Ph.D.,  Chemistry University of North Carolina at Chapel Hill Ph.D.,  Chemistry ", "Summary I am currently a Process Development Engineer at Intel Corporation's Portland Technology Development division in Hillsboro, OR. I work to improve and perfect semiconductor processes for the 14 nm and 10 nm technology nodes using advanced wafer inspection tools. In addition, I research and develop new wafer inspection tools for future technology nodes. I finished a PhD in Physics at the Georgia Institute of Technology studying epitaxial graphene on silicon carbide (SiC), focusing on the growth and electronic properties of nanostructured epitaxial graphene. \n \nSpecialties: Statistical Process Control (SPC), Desing of Experiments (DoE), Surface Science, Scanning Probe Microscopy (SPM), Scanning Electron Microscopy (SEM), Optics Summary I am currently a Process Development Engineer at Intel Corporation's Portland Technology Development division in Hillsboro, OR. I work to improve and perfect semiconductor processes for the 14 nm and 10 nm technology nodes using advanced wafer inspection tools. In addition, I research and develop new wafer inspection tools for future technology nodes. I finished a PhD in Physics at the Georgia Institute of Technology studying epitaxial graphene on silicon carbide (SiC), focusing on the growth and electronic properties of nanostructured epitaxial graphene. \n \nSpecialties: Statistical Process Control (SPC), Desing of Experiments (DoE), Surface Science, Scanning Probe Microscopy (SPM), Scanning Electron Microscopy (SEM), Optics I am currently a Process Development Engineer at Intel Corporation's Portland Technology Development division in Hillsboro, OR. I work to improve and perfect semiconductor processes for the 14 nm and 10 nm technology nodes using advanced wafer inspection tools. In addition, I research and develop new wafer inspection tools for future technology nodes. I finished a PhD in Physics at the Georgia Institute of Technology studying epitaxial graphene on silicon carbide (SiC), focusing on the growth and electronic properties of nanostructured epitaxial graphene. \n \nSpecialties: Statistical Process Control (SPC), Desing of Experiments (DoE), Surface Science, Scanning Probe Microscopy (SPM), Scanning Electron Microscopy (SEM), Optics I am currently a Process Development Engineer at Intel Corporation's Portland Technology Development division in Hillsboro, OR. I work to improve and perfect semiconductor processes for the 14 nm and 10 nm technology nodes using advanced wafer inspection tools. In addition, I research and develop new wafer inspection tools for future technology nodes. I finished a PhD in Physics at the Georgia Institute of Technology studying epitaxial graphene on silicon carbide (SiC), focusing on the growth and electronic properties of nanostructured epitaxial graphene. \n \nSpecialties: Statistical Process Control (SPC), Desing of Experiments (DoE), Surface Science, Scanning Probe Microscopy (SPM), Scanning Electron Microscopy (SEM), Optics Experience Process Development Engineer Intel Corporation May 2013  – Present (2 years 4 months) Hillsboro, OR Semiconductor process development for the 14 nm and 10 nm technology nodes, using advanced wafer inspections tools for defect metrology and wafer yield metrics. Primary responsibilities involve wafer inspection tool data collection and communication with process integration. Data collection volume is solidly in the 'Big data' regime, with all of the associated challenges (capture, analysis, curation, sharing, etc). Additional responsibilities include researching new applications for current wafer inspection tools, improving the capabilities of current-generation inspection tools, and development new inspection tools for future technology nodes. Graduate Research Scientist Georgia Institute of Technology September 2007  –  May 2013  (5 years 9 months) Atlanta, GA Research & Leadership Experience; Developed and managed undergraduate and graduate students in a laboratory setting. \n \nOrganized weekly graphene journal club meetings for undergraduate and graudate students in the greater Atlanta area, with funding from the National Science Foundation. \n \nStudied high temperature (up to 1700 C) decomposition of silicon carbide, which results in surface layers of graphene (a single layer or few layers of graphite). \n \nDesigned and constructed a novel ultra-high vacuum furnace for graphene growth. \n \nPerformed scanning tunneling microscopy to find and characterize `nanoribbons' of graphene. \n \nDeveloped a method for measuring the number of graphene layers on a surface. \n \nOptimized a hydrogen etching process for silicon carbide using a FirstNano CVD furnace. Undergraduate Research Scientist University of Central Florida September 2003  –  September 2007  (4 years 1 month) Orlando, Florida Area Worked as an independent research scientist alongside faculty and graduate students. \n \nDeveloped a novel method for nanofabrication using metal-coated peptide chains. \n \nResearched and implemented a method for functionalizing acrylic polymers for metal deposition. \n \nDesigned an electroless metal deposition technique for coating 3D photonic microstructures. \n \nDeveloped a technique for creating graded/stepped silicon dioxide films on silicon. \n \nResearched and performed single nanoparticle spectroscopy. Undergraduate Teaching Fellow University of Central Florida 2005  –  2006  (1 year) Orlando, Florida Area Developed hands-on and inquiry-based laboratory experiments for High School classrooms \n \nInstructed High School teachers on how to deploy inquiry-based experiments in the classroom. Process Development Engineer Intel Corporation May 2013  – Present (2 years 4 months) Hillsboro, OR Semiconductor process development for the 14 nm and 10 nm technology nodes, using advanced wafer inspections tools for defect metrology and wafer yield metrics. Primary responsibilities involve wafer inspection tool data collection and communication with process integration. Data collection volume is solidly in the 'Big data' regime, with all of the associated challenges (capture, analysis, curation, sharing, etc). Additional responsibilities include researching new applications for current wafer inspection tools, improving the capabilities of current-generation inspection tools, and development new inspection tools for future technology nodes. Process Development Engineer Intel Corporation May 2013  – Present (2 years 4 months) Hillsboro, OR Semiconductor process development for the 14 nm and 10 nm technology nodes, using advanced wafer inspections tools for defect metrology and wafer yield metrics. Primary responsibilities involve wafer inspection tool data collection and communication with process integration. Data collection volume is solidly in the 'Big data' regime, with all of the associated challenges (capture, analysis, curation, sharing, etc). Additional responsibilities include researching new applications for current wafer inspection tools, improving the capabilities of current-generation inspection tools, and development new inspection tools for future technology nodes. Graduate Research Scientist Georgia Institute of Technology September 2007  –  May 2013  (5 years 9 months) Atlanta, GA Research & Leadership Experience; Developed and managed undergraduate and graduate students in a laboratory setting. \n \nOrganized weekly graphene journal club meetings for undergraduate and graudate students in the greater Atlanta area, with funding from the National Science Foundation. \n \nStudied high temperature (up to 1700 C) decomposition of silicon carbide, which results in surface layers of graphene (a single layer or few layers of graphite). \n \nDesigned and constructed a novel ultra-high vacuum furnace for graphene growth. \n \nPerformed scanning tunneling microscopy to find and characterize `nanoribbons' of graphene. \n \nDeveloped a method for measuring the number of graphene layers on a surface. \n \nOptimized a hydrogen etching process for silicon carbide using a FirstNano CVD furnace. Graduate Research Scientist Georgia Institute of Technology September 2007  –  May 2013  (5 years 9 months) Atlanta, GA Research & Leadership Experience; Developed and managed undergraduate and graduate students in a laboratory setting. \n \nOrganized weekly graphene journal club meetings for undergraduate and graudate students in the greater Atlanta area, with funding from the National Science Foundation. \n \nStudied high temperature (up to 1700 C) decomposition of silicon carbide, which results in surface layers of graphene (a single layer or few layers of graphite). \n \nDesigned and constructed a novel ultra-high vacuum furnace for graphene growth. \n \nPerformed scanning tunneling microscopy to find and characterize `nanoribbons' of graphene. \n \nDeveloped a method for measuring the number of graphene layers on a surface. \n \nOptimized a hydrogen etching process for silicon carbide using a FirstNano CVD furnace. Undergraduate Research Scientist University of Central Florida September 2003  –  September 2007  (4 years 1 month) Orlando, Florida Area Worked as an independent research scientist alongside faculty and graduate students. \n \nDeveloped a novel method for nanofabrication using metal-coated peptide chains. \n \nResearched and implemented a method for functionalizing acrylic polymers for metal deposition. \n \nDesigned an electroless metal deposition technique for coating 3D photonic microstructures. \n \nDeveloped a technique for creating graded/stepped silicon dioxide films on silicon. \n \nResearched and performed single nanoparticle spectroscopy. Undergraduate Research Scientist University of Central Florida September 2003  –  September 2007  (4 years 1 month) Orlando, Florida Area Worked as an independent research scientist alongside faculty and graduate students. \n \nDeveloped a novel method for nanofabrication using metal-coated peptide chains. \n \nResearched and implemented a method for functionalizing acrylic polymers for metal deposition. \n \nDesigned an electroless metal deposition technique for coating 3D photonic microstructures. \n \nDeveloped a technique for creating graded/stepped silicon dioxide films on silicon. \n \nResearched and performed single nanoparticle spectroscopy. Undergraduate Teaching Fellow University of Central Florida 2005  –  2006  (1 year) Orlando, Florida Area Developed hands-on and inquiry-based laboratory experiments for High School classrooms \n \nInstructed High School teachers on how to deploy inquiry-based experiments in the classroom. Undergraduate Teaching Fellow University of Central Florida 2005  –  2006  (1 year) Orlando, Florida Area Developed hands-on and inquiry-based laboratory experiments for High School classrooms \n \nInstructed High School teachers on how to deploy inquiry-based experiments in the classroom. Languages English English English Skills Surface Chemistry Optics AFM Ellipsometry Spectroscopy Nanotechnology Thin Films Scanning Electron... Physics Characterization Matlab Experimentation Mathematical Modeling Mathematica Skills  Surface Chemistry Optics AFM Ellipsometry Spectroscopy Nanotechnology Thin Films Scanning Electron... Physics Characterization Matlab Experimentation Mathematical Modeling Mathematica Surface Chemistry Optics AFM Ellipsometry Spectroscopy Nanotechnology Thin Films Scanning Electron... Physics Characterization Matlab Experimentation Mathematical Modeling Mathematica Surface Chemistry Optics AFM Ellipsometry Spectroscopy Nanotechnology Thin Films Scanning Electron... Physics Characterization Matlab Experimentation Mathematical Modeling Mathematica Education Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Physics , 3.5 2007  – 2013 Condensed Matter Physics and Surface Science \nThesis Work on Epitaxial Graphene on Silicon Carbide, Growth and Electronic Properties. University of Central Florida B.S,  Physics 2003  – 2007 -Polymer chemistry functionalization for 3D two-photon microfabrication and electroless metal coating \n-silicon wafer processing (oxide growth and etch) in cleanroom facilities \n-Atomic Force Microscopy of self-assembled polystyrene microspheres \n-single metallic nanoparticle spectroscopy Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Physics , 3.5 2007  – 2013 Condensed Matter Physics and Surface Science \nThesis Work on Epitaxial Graphene on Silicon Carbide, Growth and Electronic Properties. Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Physics , 3.5 2007  – 2013 Condensed Matter Physics and Surface Science \nThesis Work on Epitaxial Graphene on Silicon Carbide, Growth and Electronic Properties. Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Physics , 3.5 2007  – 2013 Condensed Matter Physics and Surface Science \nThesis Work on Epitaxial Graphene on Silicon Carbide, Growth and Electronic Properties. University of Central Florida B.S,  Physics 2003  – 2007 -Polymer chemistry functionalization for 3D two-photon microfabrication and electroless metal coating \n-silicon wafer processing (oxide growth and etch) in cleanroom facilities \n-Atomic Force Microscopy of self-assembled polystyrene microspheres \n-single metallic nanoparticle spectroscopy University of Central Florida B.S,  Physics 2003  – 2007 -Polymer chemistry functionalization for 3D two-photon microfabrication and electroless metal coating \n-silicon wafer processing (oxide growth and etch) in cleanroom facilities \n-Atomic Force Microscopy of self-assembled polystyrene microspheres \n-single metallic nanoparticle spectroscopy University of Central Florida B.S,  Physics 2003  – 2007 -Polymer chemistry functionalization for 3D two-photon microfabrication and electroless metal coating \n-silicon wafer processing (oxide growth and etch) in cleanroom facilities \n-Atomic Force Microscopy of self-assembled polystyrene microspheres \n-single metallic nanoparticle spectroscopy ", "Summary 3+ years hands-on experience in product and research development from concept through proof-of-concept.  \n \n4+ years in microfabrication for biomedical research.  \n \nMy research background spans manipulation and application of polymeric nanostructures towards bioenergy harvesting and sensing technologies for implantable and minimally invasive solutions. The research incorporates efforts in advanced materials characterization, micro- and nanofabrication, MEMS, device assembly, packaging, characterization and testing. Summary 3+ years hands-on experience in product and research development from concept through proof-of-concept.  \n \n4+ years in microfabrication for biomedical research.  \n \nMy research background spans manipulation and application of polymeric nanostructures towards bioenergy harvesting and sensing technologies for implantable and minimally invasive solutions. The research incorporates efforts in advanced materials characterization, micro- and nanofabrication, MEMS, device assembly, packaging, characterization and testing. 3+ years hands-on experience in product and research development from concept through proof-of-concept.  \n \n4+ years in microfabrication for biomedical research.  \n \nMy research background spans manipulation and application of polymeric nanostructures towards bioenergy harvesting and sensing technologies for implantable and minimally invasive solutions. The research incorporates efforts in advanced materials characterization, micro- and nanofabrication, MEMS, device assembly, packaging, characterization and testing. 3+ years hands-on experience in product and research development from concept through proof-of-concept.  \n \n4+ years in microfabrication for biomedical research.  \n \nMy research background spans manipulation and application of polymeric nanostructures towards bioenergy harvesting and sensing technologies for implantable and minimally invasive solutions. The research incorporates efforts in advanced materials characterization, micro- and nanofabrication, MEMS, device assembly, packaging, characterization and testing. Experience Senior Process Development Engineer Intel Corporation November 2013  – Present (1 year 10 months) Development and sustenance of Wet Etch processes and tools for test silicon wafer regeneration. Experience on 1272 (14nm), 1274 (10nm) technologies Research Associate The University of Texas at Austin January 2013  –  October 2013  (10 months) •\tPre-clinical stage development of flexible, on-tip pressure sensing technology for catheters \n•\tWinning technology at Idea to Product (I2P) Texas competition; Invited for I2P Global, Brazil \n•\tPart of Austin Technology Incubator – Student Entrepreneur Acceleration and Launch (SEAL) Program Vice President Biomedical Engineering Graduate Student Organization October 2011  –  October 2013  (2 years 1 month) Graduate Research Assistant The University of Texas at Austin August 2010  –  December 2012  (2 years 5 months) Teaching Assistant University of Texas at Austin 2008  –  2010  (2 years) Austin, Texas Area Teaching Assistant for the following courses: \n1. Biomedical Measurements and Instrumentation Lab \n2. Network analysis in BME  \n3. Biomedical Imaging and Signal Processing Lab Short Term Visting Scholar Texas Tech University July 2007  –  August 2007  (2 months) Lubbock, Texas Area Genetic Engineering for Enzymatic Biofuel production from Cellulase using E.coli Representative Speaker for IIT Madras Pan IIT Global Alumni Conference July 2007  –  July 2007  (1 month) Presented the cutting edge research being carried out at IIT Madras. Was selected from various other Masters and PhD level projects. Senior Process Development Engineer Intel Corporation November 2013  – Present (1 year 10 months) Development and sustenance of Wet Etch processes and tools for test silicon wafer regeneration. Experience on 1272 (14nm), 1274 (10nm) technologies Senior Process Development Engineer Intel Corporation November 2013  – Present (1 year 10 months) Development and sustenance of Wet Etch processes and tools for test silicon wafer regeneration. Experience on 1272 (14nm), 1274 (10nm) technologies Research Associate The University of Texas at Austin January 2013  –  October 2013  (10 months) •\tPre-clinical stage development of flexible, on-tip pressure sensing technology for catheters \n•\tWinning technology at Idea to Product (I2P) Texas competition; Invited for I2P Global, Brazil \n•\tPart of Austin Technology Incubator – Student Entrepreneur Acceleration and Launch (SEAL) Program Research Associate The University of Texas at Austin January 2013  –  October 2013  (10 months) •\tPre-clinical stage development of flexible, on-tip pressure sensing technology for catheters \n•\tWinning technology at Idea to Product (I2P) Texas competition; Invited for I2P Global, Brazil \n•\tPart of Austin Technology Incubator – Student Entrepreneur Acceleration and Launch (SEAL) Program Vice President Biomedical Engineering Graduate Student Organization October 2011  –  October 2013  (2 years 1 month) Vice President Biomedical Engineering Graduate Student Organization October 2011  –  October 2013  (2 years 1 month) Graduate Research Assistant The University of Texas at Austin August 2010  –  December 2012  (2 years 5 months) Graduate Research Assistant The University of Texas at Austin August 2010  –  December 2012  (2 years 5 months) Teaching Assistant University of Texas at Austin 2008  –  2010  (2 years) Austin, Texas Area Teaching Assistant for the following courses: \n1. Biomedical Measurements and Instrumentation Lab \n2. Network analysis in BME  \n3. Biomedical Imaging and Signal Processing Lab Teaching Assistant University of Texas at Austin 2008  –  2010  (2 years) Austin, Texas Area Teaching Assistant for the following courses: \n1. Biomedical Measurements and Instrumentation Lab \n2. Network analysis in BME  \n3. Biomedical Imaging and Signal Processing Lab Short Term Visting Scholar Texas Tech University July 2007  –  August 2007  (2 months) Lubbock, Texas Area Genetic Engineering for Enzymatic Biofuel production from Cellulase using E.coli Short Term Visting Scholar Texas Tech University July 2007  –  August 2007  (2 months) Lubbock, Texas Area Genetic Engineering for Enzymatic Biofuel production from Cellulase using E.coli Representative Speaker for IIT Madras Pan IIT Global Alumni Conference July 2007  –  July 2007  (1 month) Presented the cutting edge research being carried out at IIT Madras. Was selected from various other Masters and PhD level projects. Representative Speaker for IIT Madras Pan IIT Global Alumni Conference July 2007  –  July 2007  (1 month) Presented the cutting edge research being carried out at IIT Madras. Was selected from various other Masters and PhD level projects. Languages   Skills Intellectual Property Semiconductor Equipment Microbiology MEMS Instrumentation Labview Molecular Biology Medical Devices Implants Vascular Biomedical Engineering Mask Photolithography Reactive Ion Etching Plasma Etching Wet Chemical Etching Sputter Deposition Thermal Evaporation Thermal Oxidation L-Edit Profilometer Mask Design Spin Coating I-V C-V UV-Vis-NIR Raman Microscopy OriginLab Thin Film... Dicing Wire Bonding Microfluidics Lab-on-a-chip BioMEMS Biosensors NEMS Scanning Electron... EDX LPCVD Solidworks Semiconductors Laboratory AFM Biomaterials Nanotechnology Matlab LabVIEW Characterization SolidWorks See 34+     See less Skills  Intellectual Property Semiconductor Equipment Microbiology MEMS Instrumentation Labview Molecular Biology Medical Devices Implants Vascular Biomedical Engineering Mask Photolithography Reactive Ion Etching Plasma Etching Wet Chemical Etching Sputter Deposition Thermal Evaporation Thermal Oxidation L-Edit Profilometer Mask Design Spin Coating I-V C-V UV-Vis-NIR Raman Microscopy OriginLab Thin Film... Dicing Wire Bonding Microfluidics Lab-on-a-chip BioMEMS Biosensors NEMS Scanning Electron... EDX LPCVD Solidworks Semiconductors Laboratory AFM Biomaterials Nanotechnology Matlab LabVIEW Characterization SolidWorks See 34+     See less Intellectual Property Semiconductor Equipment Microbiology MEMS Instrumentation Labview Molecular Biology Medical Devices Implants Vascular Biomedical Engineering Mask Photolithography Reactive Ion Etching Plasma Etching Wet Chemical Etching Sputter Deposition Thermal Evaporation Thermal Oxidation L-Edit Profilometer Mask Design Spin Coating I-V C-V UV-Vis-NIR Raman Microscopy OriginLab Thin Film... Dicing Wire Bonding Microfluidics Lab-on-a-chip BioMEMS Biosensors NEMS Scanning Electron... EDX LPCVD Solidworks Semiconductors Laboratory AFM Biomaterials Nanotechnology Matlab LabVIEW Characterization SolidWorks See 34+     See less Intellectual Property Semiconductor Equipment Microbiology MEMS Instrumentation Labview Molecular Biology Medical Devices Implants Vascular Biomedical Engineering Mask Photolithography Reactive Ion Etching Plasma Etching Wet Chemical Etching Sputter Deposition Thermal Evaporation Thermal Oxidation L-Edit Profilometer Mask Design Spin Coating I-V C-V UV-Vis-NIR Raman Microscopy OriginLab Thin Film... Dicing Wire Bonding Microfluidics Lab-on-a-chip BioMEMS Biosensors NEMS Scanning Electron... EDX LPCVD Solidworks Semiconductors Laboratory AFM Biomaterials Nanotechnology Matlab LabVIEW Characterization SolidWorks See 34+     See less Education The University of Texas at Austin Doctor of Philosophy (PhD),  Biomedical Engineering 2010  – 2012 Nanostructured PVDF-TrFE based piezoelectric pressure sensors on catheter for cardiovascular applications Activities and Societies:  IEEE ,  BMES ,  AID Austin ,  K-12 STEM The University of Texas at Austin Master of Science (M.S.),  Biomedical Engineering 2008  – 2010 Ultra-thin Nanoporous (mesoporous) Silica and Graphene based implantable biofuel cells as energy source for low-power implantable medical devices, Advisor: John X.J. Zhang (UT Austin) \n•\tReplace polymeric membranes with nanometer-thin inorganic silica based nanoporous membrane \n•\tLithographic fabrication of electrodes for cell assembly and electrochemical analysis \n•\tin-vivo and in-vitro testing of assembled implantable biofuel cells Activities and Societies:  Invited Reviewer - Biomedical Microdevices ,  Invited Lecture for 'Molecular Sensors and Nanodevices' course Indian Institute of Technology, Madras Bachelor of Technology (B.Tech.),  Biotechnology/Biochemical Engineering 2004  – 2008 High power density from nanomaterials based Microbial Fuel cell, Advisors: T.S. Chandra and S. Ramaprabhu (IIT Madras) \n•\tTo establish the advantage of using microbial fuel cell vis-à-vis the conventional energy technologies \n•\tTo boost cell performance using nanomaterials based electrodes and to develop new cheaper fused nanoporous electrode-membranes using electrospinning Activities and Societies:  Asia-Pacific Student Entrepreneurship Society - India Chapter ,  National Social Service The University of Texas at Austin Doctor of Philosophy (PhD),  Biomedical Engineering 2010  – 2012 Nanostructured PVDF-TrFE based piezoelectric pressure sensors on catheter for cardiovascular applications Activities and Societies:  IEEE ,  BMES ,  AID Austin ,  K-12 STEM The University of Texas at Austin Doctor of Philosophy (PhD),  Biomedical Engineering 2010  – 2012 Nanostructured PVDF-TrFE based piezoelectric pressure sensors on catheter for cardiovascular applications Activities and Societies:  IEEE ,  BMES ,  AID Austin ,  K-12 STEM The University of Texas at Austin Doctor of Philosophy (PhD),  Biomedical Engineering 2010  – 2012 Nanostructured PVDF-TrFE based piezoelectric pressure sensors on catheter for cardiovascular applications Activities and Societies:  IEEE ,  BMES ,  AID Austin ,  K-12 STEM The University of Texas at Austin Master of Science (M.S.),  Biomedical Engineering 2008  – 2010 Ultra-thin Nanoporous (mesoporous) Silica and Graphene based implantable biofuel cells as energy source for low-power implantable medical devices, Advisor: John X.J. Zhang (UT Austin) \n•\tReplace polymeric membranes with nanometer-thin inorganic silica based nanoporous membrane \n•\tLithographic fabrication of electrodes for cell assembly and electrochemical analysis \n•\tin-vivo and in-vitro testing of assembled implantable biofuel cells Activities and Societies:  Invited Reviewer - Biomedical Microdevices ,  Invited Lecture for 'Molecular Sensors and Nanodevices' course The University of Texas at Austin Master of Science (M.S.),  Biomedical Engineering 2008  – 2010 Ultra-thin Nanoporous (mesoporous) Silica and Graphene based implantable biofuel cells as energy source for low-power implantable medical devices, Advisor: John X.J. Zhang (UT Austin) \n•\tReplace polymeric membranes with nanometer-thin inorganic silica based nanoporous membrane \n•\tLithographic fabrication of electrodes for cell assembly and electrochemical analysis \n•\tin-vivo and in-vitro testing of assembled implantable biofuel cells Activities and Societies:  Invited Reviewer - Biomedical Microdevices ,  Invited Lecture for 'Molecular Sensors and Nanodevices' course The University of Texas at Austin Master of Science (M.S.),  Biomedical Engineering 2008  – 2010 Ultra-thin Nanoporous (mesoporous) Silica and Graphene based implantable biofuel cells as energy source for low-power implantable medical devices, Advisor: John X.J. Zhang (UT Austin) \n•\tReplace polymeric membranes with nanometer-thin inorganic silica based nanoporous membrane \n•\tLithographic fabrication of electrodes for cell assembly and electrochemical analysis \n•\tin-vivo and in-vitro testing of assembled implantable biofuel cells Activities and Societies:  Invited Reviewer - Biomedical Microdevices ,  Invited Lecture for 'Molecular Sensors and Nanodevices' course Indian Institute of Technology, Madras Bachelor of Technology (B.Tech.),  Biotechnology/Biochemical Engineering 2004  – 2008 High power density from nanomaterials based Microbial Fuel cell, Advisors: T.S. Chandra and S. Ramaprabhu (IIT Madras) \n•\tTo establish the advantage of using microbial fuel cell vis-à-vis the conventional energy technologies \n•\tTo boost cell performance using nanomaterials based electrodes and to develop new cheaper fused nanoporous electrode-membranes using electrospinning Activities and Societies:  Asia-Pacific Student Entrepreneurship Society - India Chapter ,  National Social Service Indian Institute of Technology, Madras Bachelor of Technology (B.Tech.),  Biotechnology/Biochemical Engineering 2004  – 2008 High power density from nanomaterials based Microbial Fuel cell, Advisors: T.S. Chandra and S. Ramaprabhu (IIT Madras) \n•\tTo establish the advantage of using microbial fuel cell vis-à-vis the conventional energy technologies \n•\tTo boost cell performance using nanomaterials based electrodes and to develop new cheaper fused nanoporous electrode-membranes using electrospinning Activities and Societies:  Asia-Pacific Student Entrepreneurship Society - India Chapter ,  National Social Service Indian Institute of Technology, Madras Bachelor of Technology (B.Tech.),  Biotechnology/Biochemical Engineering 2004  – 2008 High power density from nanomaterials based Microbial Fuel cell, Advisors: T.S. Chandra and S. Ramaprabhu (IIT Madras) \n•\tTo establish the advantage of using microbial fuel cell vis-à-vis the conventional energy technologies \n•\tTo boost cell performance using nanomaterials based electrodes and to develop new cheaper fused nanoporous electrode-membranes using electrospinning Activities and Societies:  Asia-Pacific Student Entrepreneurship Society - India Chapter ,  National Social Service Honors & Awards Additional Honors & Awards •\tLogic Technology Development (LTD) Divisional Award for increasing tool run rate and capacity. Intel, 2015 \n•\t1st Prize, Idea to Product (I2P) Texas round. Early technology commercialization. UT Austin, 2013 \n•\t3rd Prize, Idea to Product (I2P) International round. Early technology commercialization. Brazil, 2013 \n•\tPortfolio in Nanoscience and Nanotechnology. UT Austin, 2012 \n•\tInvited Reviewer for: Biomedical Microdevices and Sensors and Actuators A: Physical \n•\tNSF Student Travel Award 2010 \n•\tSpecial Research Grant. UT Austin, 2009 \n•\tBhagyalakshmi and Krishna Ayengar Award for the best research project amongst UGs and graduate students. IIT Madras, 2008 Additional Honors & Awards •\tLogic Technology Development (LTD) Divisional Award for increasing tool run rate and capacity. Intel, 2015 \n•\t1st Prize, Idea to Product (I2P) Texas round. Early technology commercialization. UT Austin, 2013 \n•\t3rd Prize, Idea to Product (I2P) International round. Early technology commercialization. Brazil, 2013 \n•\tPortfolio in Nanoscience and Nanotechnology. UT Austin, 2012 \n•\tInvited Reviewer for: Biomedical Microdevices and Sensors and Actuators A: Physical \n•\tNSF Student Travel Award 2010 \n•\tSpecial Research Grant. UT Austin, 2009 \n•\tBhagyalakshmi and Krishna Ayengar Award for the best research project amongst UGs and graduate students. IIT Madras, 2008 Additional Honors & Awards •\tLogic Technology Development (LTD) Divisional Award for increasing tool run rate and capacity. Intel, 2015 \n•\t1st Prize, Idea to Product (I2P) Texas round. Early technology commercialization. UT Austin, 2013 \n•\t3rd Prize, Idea to Product (I2P) International round. Early technology commercialization. Brazil, 2013 \n•\tPortfolio in Nanoscience and Nanotechnology. UT Austin, 2012 \n•\tInvited Reviewer for: Biomedical Microdevices and Sensors and Actuators A: Physical \n•\tNSF Student Travel Award 2010 \n•\tSpecial Research Grant. UT Austin, 2009 \n•\tBhagyalakshmi and Krishna Ayengar Award for the best research project amongst UGs and graduate students. IIT Madras, 2008 Additional Honors & Awards •\tLogic Technology Development (LTD) Divisional Award for increasing tool run rate and capacity. Intel, 2015 \n•\t1st Prize, Idea to Product (I2P) Texas round. Early technology commercialization. UT Austin, 2013 \n•\t3rd Prize, Idea to Product (I2P) International round. Early technology commercialization. Brazil, 2013 \n•\tPortfolio in Nanoscience and Nanotechnology. UT Austin, 2012 \n•\tInvited Reviewer for: Biomedical Microdevices and Sensors and Actuators A: Physical \n•\tNSF Student Travel Award 2010 \n•\tSpecial Research Grant. UT Austin, 2009 \n•\tBhagyalakshmi and Krishna Ayengar Award for the best research project amongst UGs and graduate students. IIT Madras, 2008 ", "Experience Senior Process Development Engineer Intel Corporation Staff Technologist Intel Corporation 2010  –  2013  (3 years) Senior Process Development Engineer Intel Corporation Senior Process Development Engineer Intel Corporation Staff Technologist Intel Corporation 2010  –  2013  (3 years) Staff Technologist Intel Corporation 2010  –  2013  (3 years) Education University of California, Los Angeles 1997  – 2005 University of California, Los Angeles 1997  – 2005 University of California, Los Angeles 1997  – 2005 University of California, Los Angeles 1997  – 2005 ", "Summary Highly focused and very self-motivated Engineering Professional; very experienced with a variety of semiconductor processing and manufacturing techniques; experienced with a variety of semiconductor metrology and FA methods; experienced with sustaining high-volume semiconductor manufacturing; practised in DOE; driven to succeed both individually and within a team framework, a creative professional with determination and exceptional perseverance; experienced with leading other engineers. Summary Highly focused and very self-motivated Engineering Professional; very experienced with a variety of semiconductor processing and manufacturing techniques; experienced with a variety of semiconductor metrology and FA methods; experienced with sustaining high-volume semiconductor manufacturing; practised in DOE; driven to succeed both individually and within a team framework, a creative professional with determination and exceptional perseverance; experienced with leading other engineers. Highly focused and very self-motivated Engineering Professional; very experienced with a variety of semiconductor processing and manufacturing techniques; experienced with a variety of semiconductor metrology and FA methods; experienced with sustaining high-volume semiconductor manufacturing; practised in DOE; driven to succeed both individually and within a team framework, a creative professional with determination and exceptional perseverance; experienced with leading other engineers. Highly focused and very self-motivated Engineering Professional; very experienced with a variety of semiconductor processing and manufacturing techniques; experienced with a variety of semiconductor metrology and FA methods; experienced with sustaining high-volume semiconductor manufacturing; practised in DOE; driven to succeed both individually and within a team framework, a creative professional with determination and exceptional perseverance; experienced with leading other engineers. Experience Senior Process Development Engineer Intel Corporation December 2010  –  May 2015  (4 years 6 months) Portland, Oregon Area Dielectric CVD Process Technical Development Engineering • Defect Reduction • Process Optimization • Cost Reduction • Lean Improvement Senior Process Engineer Lockheed Martin August 2008  –  February 2010  (1 year 7 months) Manassas, VA Development and Optimization of RIE, CMP and Thin Films Deposition Processes for Nanotube-on-CMOS Logic and Memory Chips • DOE • Materials Characterization and Metrology • SEM • Wafer Level Test. This was a continuation of the position I held at Nantero, after Nantero's Government Business Unit was purchased by Lockheed Martin. Senior Process Engineer Nantero March 2007  –  August 2008  (1 year 6 months) Manassas, VA Development and Optimization of RIE, CMP and Thin Films Deposition Processes for Nanotube-on-CMOS Logic and Memory Chips • DOE • Materials Characterization and Metrology • SEM • Wafer Level Test Graduate Research Assistant University at Albany January 2002  –  May 2006  (4 years 5 months) Research into the effects of Line Width and Liner Materials on the Resistivity and Grain Morphology of Cu Interconnects • Materials Characterization utilizing AFM, SEM, XRD, XPS and especially TEM Research Engineer Intern Novellus Systems acquired by Lam Research Corporation June 2005  –  November 2005  (6 months) Studied morphology and resistivity of Copper on liner materials, including ALD, PVD & CVD Ruthenium. \nConducted reliability testing (TDDB, EM failure) of nanoscale Copper interconnects. \nConducted statistical and failure analysis of nanoscale Copper interconnects. \nConducted metrology (4 point probe, ellipsometry, XRF, etc.). Fundraiser Hoosier Environmental Council December 2000  –  February 2001  (3 months) Indianapolis, Indiana Area Fundraising to support lobbying for environmental protections in Indiana. At this point in my life I knew that the normal engineering job wasn't technically challenging enough for me. I had decided to go to graduate school, but during the transition I wanted to do something to help the environment, until I could relocate to upstate New York. Project Manager Castrol December 1997  –  September 2000  (2 years 10 months) Louisville, Kentucky Area Directed the Lubrication Program for Ford Superduty truck (F250 through 550) assembly line machinery at KTP. Process Engineer Ford Motor Company August 1996  –  May 1997  (10 months) Developed and improved assembly line processes for the heavy truck assembly line at KTP. Senior Process Development Engineer Intel Corporation December 2010  –  May 2015  (4 years 6 months) Portland, Oregon Area Dielectric CVD Process Technical Development Engineering • Defect Reduction • Process Optimization • Cost Reduction • Lean Improvement Senior Process Development Engineer Intel Corporation December 2010  –  May 2015  (4 years 6 months) Portland, Oregon Area Dielectric CVD Process Technical Development Engineering • Defect Reduction • Process Optimization • Cost Reduction • Lean Improvement Senior Process Engineer Lockheed Martin August 2008  –  February 2010  (1 year 7 months) Manassas, VA Development and Optimization of RIE, CMP and Thin Films Deposition Processes for Nanotube-on-CMOS Logic and Memory Chips • DOE • Materials Characterization and Metrology • SEM • Wafer Level Test. This was a continuation of the position I held at Nantero, after Nantero's Government Business Unit was purchased by Lockheed Martin. Senior Process Engineer Lockheed Martin August 2008  –  February 2010  (1 year 7 months) Manassas, VA Development and Optimization of RIE, CMP and Thin Films Deposition Processes for Nanotube-on-CMOS Logic and Memory Chips • DOE • Materials Characterization and Metrology • SEM • Wafer Level Test. This was a continuation of the position I held at Nantero, after Nantero's Government Business Unit was purchased by Lockheed Martin. Senior Process Engineer Nantero March 2007  –  August 2008  (1 year 6 months) Manassas, VA Development and Optimization of RIE, CMP and Thin Films Deposition Processes for Nanotube-on-CMOS Logic and Memory Chips • DOE • Materials Characterization and Metrology • SEM • Wafer Level Test Senior Process Engineer Nantero March 2007  –  August 2008  (1 year 6 months) Manassas, VA Development and Optimization of RIE, CMP and Thin Films Deposition Processes for Nanotube-on-CMOS Logic and Memory Chips • DOE • Materials Characterization and Metrology • SEM • Wafer Level Test Graduate Research Assistant University at Albany January 2002  –  May 2006  (4 years 5 months) Research into the effects of Line Width and Liner Materials on the Resistivity and Grain Morphology of Cu Interconnects • Materials Characterization utilizing AFM, SEM, XRD, XPS and especially TEM Graduate Research Assistant University at Albany January 2002  –  May 2006  (4 years 5 months) Research into the effects of Line Width and Liner Materials on the Resistivity and Grain Morphology of Cu Interconnects • Materials Characterization utilizing AFM, SEM, XRD, XPS and especially TEM Research Engineer Intern Novellus Systems acquired by Lam Research Corporation June 2005  –  November 2005  (6 months) Studied morphology and resistivity of Copper on liner materials, including ALD, PVD & CVD Ruthenium. \nConducted reliability testing (TDDB, EM failure) of nanoscale Copper interconnects. \nConducted statistical and failure analysis of nanoscale Copper interconnects. \nConducted metrology (4 point probe, ellipsometry, XRF, etc.). Research Engineer Intern Novellus Systems acquired by Lam Research Corporation June 2005  –  November 2005  (6 months) Studied morphology and resistivity of Copper on liner materials, including ALD, PVD & CVD Ruthenium. \nConducted reliability testing (TDDB, EM failure) of nanoscale Copper interconnects. \nConducted statistical and failure analysis of nanoscale Copper interconnects. \nConducted metrology (4 point probe, ellipsometry, XRF, etc.). Fundraiser Hoosier Environmental Council December 2000  –  February 2001  (3 months) Indianapolis, Indiana Area Fundraising to support lobbying for environmental protections in Indiana. At this point in my life I knew that the normal engineering job wasn't technically challenging enough for me. I had decided to go to graduate school, but during the transition I wanted to do something to help the environment, until I could relocate to upstate New York. Fundraiser Hoosier Environmental Council December 2000  –  February 2001  (3 months) Indianapolis, Indiana Area Fundraising to support lobbying for environmental protections in Indiana. At this point in my life I knew that the normal engineering job wasn't technically challenging enough for me. I had decided to go to graduate school, but during the transition I wanted to do something to help the environment, until I could relocate to upstate New York. Project Manager Castrol December 1997  –  September 2000  (2 years 10 months) Louisville, Kentucky Area Directed the Lubrication Program for Ford Superduty truck (F250 through 550) assembly line machinery at KTP. Project Manager Castrol December 1997  –  September 2000  (2 years 10 months) Louisville, Kentucky Area Directed the Lubrication Program for Ford Superduty truck (F250 through 550) assembly line machinery at KTP. Process Engineer Ford Motor Company August 1996  –  May 1997  (10 months) Developed and improved assembly line processes for the heavy truck assembly line at KTP. Process Engineer Ford Motor Company August 1996  –  May 1997  (10 months) Developed and improved assembly line processes for the heavy truck assembly line at KTP. Skills Process Engineering Semiconductor Process Semiconductor Process... Semiconductor... Silicon Thin Films CVD Design of Experiments Characterization Failure Analysis PVD Solid State Physics Experimental Physics TEM SEM Semiconductor Device Semiconductors Production Process... Semiconductor Industry JMP Klarity Microsoft Office Microsoft Excel PowerPoint Project Management Lean Manufacturing AFM See 12+     See less Skills  Process Engineering Semiconductor Process Semiconductor Process... Semiconductor... Silicon Thin Films CVD Design of Experiments Characterization Failure Analysis PVD Solid State Physics Experimental Physics TEM SEM Semiconductor Device Semiconductors Production Process... Semiconductor Industry JMP Klarity Microsoft Office Microsoft Excel PowerPoint Project Management Lean Manufacturing AFM See 12+     See less Process Engineering Semiconductor Process Semiconductor Process... Semiconductor... Silicon Thin Films CVD Design of Experiments Characterization Failure Analysis PVD Solid State Physics Experimental Physics TEM SEM Semiconductor Device Semiconductors Production Process... Semiconductor Industry JMP Klarity Microsoft Office Microsoft Excel PowerPoint Project Management Lean Manufacturing AFM See 12+     See less Process Engineering Semiconductor Process Semiconductor Process... Semiconductor... Silicon Thin Films CVD Design of Experiments Characterization Failure Analysis PVD Solid State Physics Experimental Physics TEM SEM Semiconductor Device Semiconductors Production Process... Semiconductor Industry JMP Klarity Microsoft Office Microsoft Excel PowerPoint Project Management Lean Manufacturing AFM See 12+     See less Education State University of New York at Albany Doctor of Philosophy (Ph.D.),  Physics 2001  – 2006 Research into the effects of line width and liner material on the resistivity and grain morphology of Copper interconnects State University of New York at Albany Master's degree,  Physics 2001  – 2006 University of Louisville Bachelor of Science,  Mechanical Engineering 1992  – 1994 University of Kentucky Bachelor's degree,  Physics 1984  – 1988 Activities and Societies:  Sigma Pi Sigma (The Physics Honor Society) State University of New York at Albany Doctor of Philosophy (Ph.D.),  Physics 2001  – 2006 Research into the effects of line width and liner material on the resistivity and grain morphology of Copper interconnects State University of New York at Albany Doctor of Philosophy (Ph.D.),  Physics 2001  – 2006 Research into the effects of line width and liner material on the resistivity and grain morphology of Copper interconnects State University of New York at Albany Doctor of Philosophy (Ph.D.),  Physics 2001  – 2006 Research into the effects of line width and liner material on the resistivity and grain morphology of Copper interconnects State University of New York at Albany Master's degree,  Physics 2001  – 2006 State University of New York at Albany Master's degree,  Physics 2001  – 2006 State University of New York at Albany Master's degree,  Physics 2001  – 2006 University of Louisville Bachelor of Science,  Mechanical Engineering 1992  – 1994 University of Louisville Bachelor of Science,  Mechanical Engineering 1992  – 1994 University of Louisville Bachelor of Science,  Mechanical Engineering 1992  – 1994 University of Kentucky Bachelor's degree,  Physics 1984  – 1988 Activities and Societies:  Sigma Pi Sigma (The Physics Honor Society) University of Kentucky Bachelor's degree,  Physics 1984  – 1988 Activities and Societies:  Sigma Pi Sigma (The Physics Honor Society) University of Kentucky Bachelor's degree,  Physics 1984  – 1988 Activities and Societies:  Sigma Pi Sigma (The Physics Honor Society) Honors & Awards Additional Honors & Awards SRC Graduate Fellow, 2003 - 2006 \n \nLMP Team Performance Award, Castrol Industrial NA Performance Lubricants Division, 1999 \n \nNational Merit Scholar, 1984 - 1988 \n \nWendell DeMarcus Scholar, 1984 - 1988 Additional Honors & Awards SRC Graduate Fellow, 2003 - 2006 \n \nLMP Team Performance Award, Castrol Industrial NA Performance Lubricants Division, 1999 \n \nNational Merit Scholar, 1984 - 1988 \n \nWendell DeMarcus Scholar, 1984 - 1988 Additional Honors & Awards SRC Graduate Fellow, 2003 - 2006 \n \nLMP Team Performance Award, Castrol Industrial NA Performance Lubricants Division, 1999 \n \nNational Merit Scholar, 1984 - 1988 \n \nWendell DeMarcus Scholar, 1984 - 1988 Additional Honors & Awards SRC Graduate Fellow, 2003 - 2006 \n \nLMP Team Performance Award, Castrol Industrial NA Performance Lubricants Division, 1999 \n \nNational Merit Scholar, 1984 - 1988 \n \nWendell DeMarcus Scholar, 1984 - 1988 ", "Experience Process Development Engineer Intel Corporation Process Development Engineer Intel Corporation Process Development Engineer Intel Corporation Skills Software Development Skills  Software Development Software Development Software Development Education University of Massachusetts Lowell University of Massachusetts Lowell University of Massachusetts Lowell University of Massachusetts Lowell ", "Experience Sr. Process Development Engineer Intel Corporation August 2006  – Present (9 years 1 month) Portland Technology Development \nLogic Technology Development \nBEOL Thin Film Deposition Sr. Process Development Engineer Intel Corporation August 2006  – Present (9 years 1 month) Portland Technology Development \nLogic Technology Development \nBEOL Thin Film Deposition Sr. Process Development Engineer Intel Corporation August 2006  – Present (9 years 1 month) Portland Technology Development \nLogic Technology Development \nBEOL Thin Film Deposition Skills Semiconductors PVD Design of Experiments Etching Metrology Sputtering Interconnects Metallization Process Development Thin Films JMP Silicon Failure Analysis Process Integration Plasma Etch Characterization Semiconductor Device MBE CVD III-V Semiconductor Industry SPC Materials Science Manufacturing Process Engineering See 10+     See less Skills  Semiconductors PVD Design of Experiments Etching Metrology Sputtering Interconnects Metallization Process Development Thin Films JMP Silicon Failure Analysis Process Integration Plasma Etch Characterization Semiconductor Device MBE CVD III-V Semiconductor Industry SPC Materials Science Manufacturing Process Engineering See 10+     See less Semiconductors PVD Design of Experiments Etching Metrology Sputtering Interconnects Metallization Process Development Thin Films JMP Silicon Failure Analysis Process Integration Plasma Etch Characterization Semiconductor Device MBE CVD III-V Semiconductor Industry SPC Materials Science Manufacturing Process Engineering See 10+     See less Semiconductors PVD Design of Experiments Etching Metrology Sputtering Interconnects Metallization Process Development Thin Films JMP Silicon Failure Analysis Process Integration Plasma Etch Characterization Semiconductor Device MBE CVD III-V Semiconductor Industry SPC Materials Science Manufacturing Process Engineering See 10+     See less Education Arizona State University Ph.D.,  Materials Science and Engineering 2000  – 2006 Epitaxial growth and characterization of novel III-N based dilute magnetic semiconductors for application in magnetic tunnel junctions (MRAM) Washington University in St. Louis B.S.,  Biomedical Engineering 1996  – 2000 Division III Men's Tennis Team Arizona State University Ph.D.,  Materials Science and Engineering 2000  – 2006 Epitaxial growth and characterization of novel III-N based dilute magnetic semiconductors for application in magnetic tunnel junctions (MRAM) Arizona State University Ph.D.,  Materials Science and Engineering 2000  – 2006 Epitaxial growth and characterization of novel III-N based dilute magnetic semiconductors for application in magnetic tunnel junctions (MRAM) Arizona State University Ph.D.,  Materials Science and Engineering 2000  – 2006 Epitaxial growth and characterization of novel III-N based dilute magnetic semiconductors for application in magnetic tunnel junctions (MRAM) Washington University in St. Louis B.S.,  Biomedical Engineering 1996  – 2000 Division III Men's Tennis Team Washington University in St. Louis B.S.,  Biomedical Engineering 1996  – 2000 Division III Men's Tennis Team Washington University in St. Louis B.S.,  Biomedical Engineering 1996  – 2000 Division III Men's Tennis Team ", "Experience PTD Process Development Engineer Intel Corporation March 2012  – Present (3 years 6 months) Portland, Oregon Area D1C process engineer Intel Corporation July 2011  –  August 2012  (1 year 2 months) Hillsboro, oregon Research Assistant Iowa State University August 2007  –  July 2011  (4 years) PTD Process Development Engineer Intel Corporation March 2012  – Present (3 years 6 months) Portland, Oregon Area PTD Process Development Engineer Intel Corporation March 2012  – Present (3 years 6 months) Portland, Oregon Area D1C process engineer Intel Corporation July 2011  –  August 2012  (1 year 2 months) Hillsboro, oregon D1C process engineer Intel Corporation July 2011  –  August 2012  (1 year 2 months) Hillsboro, oregon Research Assistant Iowa State University August 2007  –  July 2011  (4 years) Research Assistant Iowa State University August 2007  –  July 2011  (4 years) Skills Matlab Semiconductor... Organic Semiconductors Organic Solar Cells Solar Energy Thin Films Simulations Solar Cells AFM Photolithography Verilog Nanotechnology Characterization Failure Analysis TEM CVD MEMS Nanofabrication Algorithms JMP Optics COMSOL Electron Beam... Sputtering Materials Science LaTeX Semiconductors Nanomaterials Scanning Electron... Labview Sensors Powder X-ray Diffraction XPS CMOS Spectroscopy Microfluidics Design of Experiments FIB See 23+     See less Skills  Matlab Semiconductor... Organic Semiconductors Organic Solar Cells Solar Energy Thin Films Simulations Solar Cells AFM Photolithography Verilog Nanotechnology Characterization Failure Analysis TEM CVD MEMS Nanofabrication Algorithms JMP Optics COMSOL Electron Beam... Sputtering Materials Science LaTeX Semiconductors Nanomaterials Scanning Electron... Labview Sensors Powder X-ray Diffraction XPS CMOS Spectroscopy Microfluidics Design of Experiments FIB See 23+     See less Matlab Semiconductor... Organic Semiconductors Organic Solar Cells Solar Energy Thin Films Simulations Solar Cells AFM Photolithography Verilog Nanotechnology Characterization Failure Analysis TEM CVD MEMS Nanofabrication Algorithms JMP Optics COMSOL Electron Beam... Sputtering Materials Science LaTeX Semiconductors Nanomaterials Scanning Electron... Labview Sensors Powder X-ray Diffraction XPS CMOS Spectroscopy Microfluidics Design of Experiments FIB See 23+     See less Matlab Semiconductor... Organic Semiconductors Organic Solar Cells Solar Energy Thin Films Simulations Solar Cells AFM Photolithography Verilog Nanotechnology Characterization Failure Analysis TEM CVD MEMS Nanofabrication Algorithms JMP Optics COMSOL Electron Beam... Sputtering Materials Science LaTeX Semiconductors Nanomaterials Scanning Electron... Labview Sensors Powder X-ray Diffraction XPS CMOS Spectroscopy Microfluidics Design of Experiments FIB See 23+     See less Education Iowa State University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering 2007  – 2011 Indian Institute of Technology, Kanpur B. Tech.,  Materials and Metallurgical Engineering 2003  – 2007 Iowa State University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering 2007  – 2011 Iowa State University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering 2007  – 2011 Iowa State University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering 2007  – 2011 Indian Institute of Technology, Kanpur B. Tech.,  Materials and Metallurgical Engineering 2003  – 2007 Indian Institute of Technology, Kanpur B. Tech.,  Materials and Metallurgical Engineering 2003  – 2007 Indian Institute of Technology, Kanpur B. Tech.,  Materials and Metallurgical Engineering 2003  – 2007 ", "Summary Self-motivated test engineer with hands-on experience in taking full ownership of new product introduction development from product definition to production release. Demonstrated ability to manage projects to meet aggressive schedules and drive them to completion. \n \nDemonstrated Accomplishments in: \nTechnical: \nTechnical documentation. Probe and final test hardware design. Customer support. Test program development. Hardware and software debug. Data analysis. \n \nOther: \nProject management. Time management. Project development planning. Strategic task prioritization. Risk mitigation planning to support aggressive schedules. Cross-functional team support. \n \nSpecialties: Technical Skills: \nLanguage: C, VB and basic knowledge of LabView \nSoftware: MS Office, Cadence Design Entry, PADs Logic, AutoCAD \nTest Platforms: Teradyne J750, Integra Flex, Micro-Flex, Catalyst and Advantest. Summary Self-motivated test engineer with hands-on experience in taking full ownership of new product introduction development from product definition to production release. Demonstrated ability to manage projects to meet aggressive schedules and drive them to completion. \n \nDemonstrated Accomplishments in: \nTechnical: \nTechnical documentation. Probe and final test hardware design. Customer support. Test program development. Hardware and software debug. Data analysis. \n \nOther: \nProject management. Time management. Project development planning. Strategic task prioritization. Risk mitigation planning to support aggressive schedules. Cross-functional team support. \n \nSpecialties: Technical Skills: \nLanguage: C, VB and basic knowledge of LabView \nSoftware: MS Office, Cadence Design Entry, PADs Logic, AutoCAD \nTest Platforms: Teradyne J750, Integra Flex, Micro-Flex, Catalyst and Advantest. Self-motivated test engineer with hands-on experience in taking full ownership of new product introduction development from product definition to production release. Demonstrated ability to manage projects to meet aggressive schedules and drive them to completion. \n \nDemonstrated Accomplishments in: \nTechnical: \nTechnical documentation. Probe and final test hardware design. Customer support. Test program development. Hardware and software debug. Data analysis. \n \nOther: \nProject management. Time management. Project development planning. Strategic task prioritization. Risk mitigation planning to support aggressive schedules. Cross-functional team support. \n \nSpecialties: Technical Skills: \nLanguage: C, VB and basic knowledge of LabView \nSoftware: MS Office, Cadence Design Entry, PADs Logic, AutoCAD \nTest Platforms: Teradyne J750, Integra Flex, Micro-Flex, Catalyst and Advantest. Self-motivated test engineer with hands-on experience in taking full ownership of new product introduction development from product definition to production release. Demonstrated ability to manage projects to meet aggressive schedules and drive them to completion. \n \nDemonstrated Accomplishments in: \nTechnical: \nTechnical documentation. Probe and final test hardware design. Customer support. Test program development. Hardware and software debug. Data analysis. \n \nOther: \nProject management. Time management. Project development planning. Strategic task prioritization. Risk mitigation planning to support aggressive schedules. Cross-functional team support. \n \nSpecialties: Technical Skills: \nLanguage: C, VB and basic knowledge of LabView \nSoftware: MS Office, Cadence Design Entry, PADs Logic, AutoCAD \nTest Platforms: Teradyne J750, Integra Flex, Micro-Flex, Catalyst and Advantest. Experience Module Process Development Engineer Intel Corporation February 2014  – Present (1 year 7 months) Product Development Engineer, SCAN PDE Intel Corporation October 2013  –  February 2014  (5 months) Product Development Engineer, TPI Lead Intel Corporation May 2011  –  October 2013  (2 years 6 months) Chandler, Arizona Develops hardware for probe (SIU) and final test loadboards (TIU's) to support sort and HVM for SOC products for Advantest testers. \nIntegrates test content from different content owners such as functional tests, SCAN, HSIO, Memory tests, Core tests, DDR, Analogue and DC tests. \nProvides debug support for some content blocks such functional tests and DC tests. \nSets up correlation and pilot lots to provide data requirements for engineering and production test programs releases. \nCoordinates with the planners different runs to support engineering samples, qual activities, characterization, production release and customer samples. \nAnalyzes data from correlation and pilot lot runs and reports data results to stake holders. \nCross-functional team work across different teams within the company. \nSupports HVM (high volume manufacturing) with yield issues, hardware issues and during releasing test programs. \nParticipates in TTR and yield improvement activities. \nSets up test program road maps for future releases. \nRuns VTPSIM simulations on fsdb files to create tester files for specific content blocks. \nCreated a test validation program that performs hardware defects for TIUs (loadboards, final test boards) such as relays, some components and connectors. The program makes hardware debug more efficient, since it is able to detect defects right away. The efficiency of the program has resulted in a 0% loadboard downtime. Due to the efficiency of the program, the program has been released to the factory to aid them during debug and reduce downtime. Production Test Lead Engineer Freescale Semiconductor July 2004  –  April 2011  (6 years 10 months) Tempe, Arizona Wrote test plans for sensor products. \nPlanned and defined required hardware such as test boards to support product development. \nDeveloped test program for wafer probe, characterization, qual and final test for sensor products such as accelerometers and proximity sensors. \nDesigned hardware for probe, characterization and final test using Cadence tools for the Teradyne J750, and Teradyne Integra Flex. \nSet up and debug functional tests, SCAN, DC tests, trim tests, Flash, NVM and ADC test. Converted VCD files to WGL format files then compile then to ATP tester files. \nPerformed gage studies and perform data correlation between engineering site and production site. Set up guardband limits from data results. \nReleased test programs to TSMC, external and internal foundries. Supported production engineering during test program and hardware release for probe and final test. \nCross-functional team work across different teams within the company. \nMonitored test yields. Test Engineer Motorola September 2000  –  July 2004  (3 years 11 months) Chandler, Arizona Developed test programs for sort, characterization, qual and final test for setop box multimedia processors and stereo encoders. \nConverted VCD files to WGL files using TSSI tools. Compiled WGL format files to ATP format for ATE testers. \nSet up and debug functional tests, SCAN, DC tests, and ADC test.  \nDesigned hardware for probe and final test for the Teradyne J750 and the Teradyne A585 testers. \nPerform TTR on legacy products. \nSupported customer returns, interact directly with the customer and performed tester to bench correlation units with the customer. \nCross-functional team work across different teams within the company. Module Process Development Engineer Intel Corporation February 2014  – Present (1 year 7 months) Module Process Development Engineer Intel Corporation February 2014  – Present (1 year 7 months) Product Development Engineer, SCAN PDE Intel Corporation October 2013  –  February 2014  (5 months) Product Development Engineer, SCAN PDE Intel Corporation October 2013  –  February 2014  (5 months) Product Development Engineer, TPI Lead Intel Corporation May 2011  –  October 2013  (2 years 6 months) Chandler, Arizona Develops hardware for probe (SIU) and final test loadboards (TIU's) to support sort and HVM for SOC products for Advantest testers. \nIntegrates test content from different content owners such as functional tests, SCAN, HSIO, Memory tests, Core tests, DDR, Analogue and DC tests. \nProvides debug support for some content blocks such functional tests and DC tests. \nSets up correlation and pilot lots to provide data requirements for engineering and production test programs releases. \nCoordinates with the planners different runs to support engineering samples, qual activities, characterization, production release and customer samples. \nAnalyzes data from correlation and pilot lot runs and reports data results to stake holders. \nCross-functional team work across different teams within the company. \nSupports HVM (high volume manufacturing) with yield issues, hardware issues and during releasing test programs. \nParticipates in TTR and yield improvement activities. \nSets up test program road maps for future releases. \nRuns VTPSIM simulations on fsdb files to create tester files for specific content blocks. \nCreated a test validation program that performs hardware defects for TIUs (loadboards, final test boards) such as relays, some components and connectors. The program makes hardware debug more efficient, since it is able to detect defects right away. The efficiency of the program has resulted in a 0% loadboard downtime. Due to the efficiency of the program, the program has been released to the factory to aid them during debug and reduce downtime. Product Development Engineer, TPI Lead Intel Corporation May 2011  –  October 2013  (2 years 6 months) Chandler, Arizona Develops hardware for probe (SIU) and final test loadboards (TIU's) to support sort and HVM for SOC products for Advantest testers. \nIntegrates test content from different content owners such as functional tests, SCAN, HSIO, Memory tests, Core tests, DDR, Analogue and DC tests. \nProvides debug support for some content blocks such functional tests and DC tests. \nSets up correlation and pilot lots to provide data requirements for engineering and production test programs releases. \nCoordinates with the planners different runs to support engineering samples, qual activities, characterization, production release and customer samples. \nAnalyzes data from correlation and pilot lot runs and reports data results to stake holders. \nCross-functional team work across different teams within the company. \nSupports HVM (high volume manufacturing) with yield issues, hardware issues and during releasing test programs. \nParticipates in TTR and yield improvement activities. \nSets up test program road maps for future releases. \nRuns VTPSIM simulations on fsdb files to create tester files for specific content blocks. \nCreated a test validation program that performs hardware defects for TIUs (loadboards, final test boards) such as relays, some components and connectors. The program makes hardware debug more efficient, since it is able to detect defects right away. The efficiency of the program has resulted in a 0% loadboard downtime. Due to the efficiency of the program, the program has been released to the factory to aid them during debug and reduce downtime. Production Test Lead Engineer Freescale Semiconductor July 2004  –  April 2011  (6 years 10 months) Tempe, Arizona Wrote test plans for sensor products. \nPlanned and defined required hardware such as test boards to support product development. \nDeveloped test program for wafer probe, characterization, qual and final test for sensor products such as accelerometers and proximity sensors. \nDesigned hardware for probe, characterization and final test using Cadence tools for the Teradyne J750, and Teradyne Integra Flex. \nSet up and debug functional tests, SCAN, DC tests, trim tests, Flash, NVM and ADC test. Converted VCD files to WGL format files then compile then to ATP tester files. \nPerformed gage studies and perform data correlation between engineering site and production site. Set up guardband limits from data results. \nReleased test programs to TSMC, external and internal foundries. Supported production engineering during test program and hardware release for probe and final test. \nCross-functional team work across different teams within the company. \nMonitored test yields. Production Test Lead Engineer Freescale Semiconductor July 2004  –  April 2011  (6 years 10 months) Tempe, Arizona Wrote test plans for sensor products. \nPlanned and defined required hardware such as test boards to support product development. \nDeveloped test program for wafer probe, characterization, qual and final test for sensor products such as accelerometers and proximity sensors. \nDesigned hardware for probe, characterization and final test using Cadence tools for the Teradyne J750, and Teradyne Integra Flex. \nSet up and debug functional tests, SCAN, DC tests, trim tests, Flash, NVM and ADC test. Converted VCD files to WGL format files then compile then to ATP tester files. \nPerformed gage studies and perform data correlation between engineering site and production site. Set up guardband limits from data results. \nReleased test programs to TSMC, external and internal foundries. Supported production engineering during test program and hardware release for probe and final test. \nCross-functional team work across different teams within the company. \nMonitored test yields. Test Engineer Motorola September 2000  –  July 2004  (3 years 11 months) Chandler, Arizona Developed test programs for sort, characterization, qual and final test for setop box multimedia processors and stereo encoders. \nConverted VCD files to WGL files using TSSI tools. Compiled WGL format files to ATP format for ATE testers. \nSet up and debug functional tests, SCAN, DC tests, and ADC test.  \nDesigned hardware for probe and final test for the Teradyne J750 and the Teradyne A585 testers. \nPerform TTR on legacy products. \nSupported customer returns, interact directly with the customer and performed tester to bench correlation units with the customer. \nCross-functional team work across different teams within the company. Test Engineer Motorola September 2000  –  July 2004  (3 years 11 months) Chandler, Arizona Developed test programs for sort, characterization, qual and final test for setop box multimedia processors and stereo encoders. \nConverted VCD files to WGL files using TSSI tools. Compiled WGL format files to ATP format for ATE testers. \nSet up and debug functional tests, SCAN, DC tests, and ADC test.  \nDesigned hardware for probe and final test for the Teradyne J750 and the Teradyne A585 testers. \nPerform TTR on legacy products. \nSupported customer returns, interact directly with the customer and performed tester to bench correlation units with the customer. \nCross-functional team work across different teams within the company. Languages English Full professional proficiency Spanish Full professional proficiency English Full professional proficiency Spanish Full professional proficiency English Full professional proficiency Spanish Full professional proficiency Full professional proficiency Full professional proficiency Skills Hardware Design Cross-functional Team... Testing Problem Solving Mixed Signal PCB design Digital Electronics MEMS Multicultural Teams Product Development Hardware Architecture CMOS DFT SoC Debugging Analog IC Sensors Yield Labview PCB Design LabVIEW See 7+     See less Skills  Hardware Design Cross-functional Team... Testing Problem Solving Mixed Signal PCB design Digital Electronics MEMS Multicultural Teams Product Development Hardware Architecture CMOS DFT SoC Debugging Analog IC Sensors Yield Labview PCB Design LabVIEW See 7+     See less Hardware Design Cross-functional Team... Testing Problem Solving Mixed Signal PCB design Digital Electronics MEMS Multicultural Teams Product Development Hardware Architecture CMOS DFT SoC Debugging Analog IC Sensors Yield Labview PCB Design LabVIEW See 7+     See less Hardware Design Cross-functional Team... Testing Problem Solving Mixed Signal PCB design Digital Electronics MEMS Multicultural Teams Product Development Hardware Architecture CMOS DFT SoC Debugging Analog IC Sensors Yield Labview PCB Design LabVIEW See 7+     See less Education California Polytechnic State University-San Luis Obispo BSEE,  Communications 1998  – 2000 Ventura College Associates Degree in Engineering,  Engineering 1993  – 1996 California Polytechnic State University-San Luis Obispo BSEE,  Communications 1998  – 2000 California Polytechnic State University-San Luis Obispo BSEE,  Communications 1998  – 2000 California Polytechnic State University-San Luis Obispo BSEE,  Communications 1998  – 2000 Ventura College Associates Degree in Engineering,  Engineering 1993  – 1996 Ventura College Associates Degree in Engineering,  Engineering 1993  – 1996 Ventura College Associates Degree in Engineering,  Engineering 1993  – 1996 ", "Summary Electronic engineer with 10 years of experience on manufacturing process. Expert on new product introduction including tool install and qualification, process characterization, window process definition, and training to operators, technician and engineers. Project management background installing tools and introducing new technologies. Experience working with engineers groups on different countries. Problem solving methodology expert on different manufacturing issues. Strong statistic skills, experiments design and data analysis. Experience on manufacturing execution. Knowledge on lean principles and continuous improvement projects. Summary Electronic engineer with 10 years of experience on manufacturing process. Expert on new product introduction including tool install and qualification, process characterization, window process definition, and training to operators, technician and engineers. Project management background installing tools and introducing new technologies. Experience working with engineers groups on different countries. Problem solving methodology expert on different manufacturing issues. Strong statistic skills, experiments design and data analysis. Experience on manufacturing execution. Knowledge on lean principles and continuous improvement projects. Electronic engineer with 10 years of experience on manufacturing process. Expert on new product introduction including tool install and qualification, process characterization, window process definition, and training to operators, technician and engineers. Project management background installing tools and introducing new technologies. Experience working with engineers groups on different countries. Problem solving methodology expert on different manufacturing issues. Strong statistic skills, experiments design and data analysis. Experience on manufacturing execution. Knowledge on lean principles and continuous improvement projects. Electronic engineer with 10 years of experience on manufacturing process. Expert on new product introduction including tool install and qualification, process characterization, window process definition, and training to operators, technician and engineers. Project management background installing tools and introducing new technologies. Experience working with engineers groups on different countries. Problem solving methodology expert on different manufacturing issues. Strong statistic skills, experiments design and data analysis. Experience on manufacturing execution. Knowledge on lean principles and continuous improvement projects. Experience Process Development Engineer Intel Corporation August 2014  – Present (1 year 1 month) Phoenix, Arizona Area Senior Process Engineer Intel Corporation November 2004  –  August 2014  (9 years 10 months) Heredia, Costa Rica •\tManaged new product and new technologies introduction on a high volume manufacturing environment.  \n•\tExperienced on process window definition and characterization. \n•\tDesigned experiments including downstream process and different manufacturing groups. \n•\tInstalled and qualified manufacturing lines with multiple equipments and configuration. \n•\tApplied model based problem solving methodology on different manufacturing issues. \n•\tWorked with multicultural teams from United States, China and Malaysia on different projects as product transfers, process improvements and tools installation. \n•\tDesigned and implemented process improvements related to quality, units per hours and productivity. \n•\tSpecialized on process control systems; defined variables, control limits and correlated to outputs \n•\tExperienced in white paper writing.  \n Project Manager Elvatron S.A. August 2003  –  October 2004  (1 year 3 months) San Jose, Costa Rica Process Development Engineer Intel Corporation August 2014  – Present (1 year 1 month) Phoenix, Arizona Area Process Development Engineer Intel Corporation August 2014  – Present (1 year 1 month) Phoenix, Arizona Area Senior Process Engineer Intel Corporation November 2004  –  August 2014  (9 years 10 months) Heredia, Costa Rica •\tManaged new product and new technologies introduction on a high volume manufacturing environment.  \n•\tExperienced on process window definition and characterization. \n•\tDesigned experiments including downstream process and different manufacturing groups. \n•\tInstalled and qualified manufacturing lines with multiple equipments and configuration. \n•\tApplied model based problem solving methodology on different manufacturing issues. \n•\tWorked with multicultural teams from United States, China and Malaysia on different projects as product transfers, process improvements and tools installation. \n•\tDesigned and implemented process improvements related to quality, units per hours and productivity. \n•\tSpecialized on process control systems; defined variables, control limits and correlated to outputs \n•\tExperienced in white paper writing.  \n Senior Process Engineer Intel Corporation November 2004  –  August 2014  (9 years 10 months) Heredia, Costa Rica •\tManaged new product and new technologies introduction on a high volume manufacturing environment.  \n•\tExperienced on process window definition and characterization. \n•\tDesigned experiments including downstream process and different manufacturing groups. \n•\tInstalled and qualified manufacturing lines with multiple equipments and configuration. \n•\tApplied model based problem solving methodology on different manufacturing issues. \n•\tWorked with multicultural teams from United States, China and Malaysia on different projects as product transfers, process improvements and tools installation. \n•\tDesigned and implemented process improvements related to quality, units per hours and productivity. \n•\tSpecialized on process control systems; defined variables, control limits and correlated to outputs \n•\tExperienced in white paper writing.  \n Project Manager Elvatron S.A. August 2003  –  October 2004  (1 year 3 months) San Jose, Costa Rica Project Manager Elvatron S.A. August 2003  –  October 2004  (1 year 3 months) San Jose, Costa Rica Skills Manufacturing Process Engineering Engineering Semiconductors Electronics Problem Solving Statistical Data... Data Mining Process Improvement Production Process... Skills  Manufacturing Process Engineering Engineering Semiconductors Electronics Problem Solving Statistical Data... Data Mining Process Improvement Production Process... Manufacturing Process Engineering Engineering Semiconductors Electronics Problem Solving Statistical Data... Data Mining Process Improvement Production Process... Manufacturing Process Engineering Engineering Semiconductors Electronics Problem Solving Statistical Data... Data Mining Process Improvement Production Process... Education Instituto Tecnologico de Costa rica Master's degree,  Manufacturing Engineering 2010  – 2016 Instituto Tecnologico de Costa Rica Licentiate degree,  Electrical and Electronics Engineering 1999  – 2004 Intituto Tecnico Don Bosco Electronic Technician 1993  – 1998 Instituto Tecnologico de Costa rica Master's degree,  Manufacturing Engineering 2010  – 2016 Instituto Tecnologico de Costa rica Master's degree,  Manufacturing Engineering 2010  – 2016 Instituto Tecnologico de Costa rica Master's degree,  Manufacturing Engineering 2010  – 2016 Instituto Tecnologico de Costa Rica Licentiate degree,  Electrical and Electronics Engineering 1999  – 2004 Instituto Tecnologico de Costa Rica Licentiate degree,  Electrical and Electronics Engineering 1999  – 2004 Instituto Tecnologico de Costa Rica Licentiate degree,  Electrical and Electronics Engineering 1999  – 2004 Intituto Tecnico Don Bosco Electronic Technician 1993  – 1998 Intituto Tecnico Don Bosco Electronic Technician 1993  – 1998 Intituto Tecnico Don Bosco Electronic Technician 1993  – 1998 ", "Experience Plasma/Dry Etch Process Development Engineer Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon D1D Research Assistant University of Florida October 2009  –  August 2013  (3 years 11 months) Gainesville, Florida Area Performed ab-initio quantum mechanical and molecular dynamics calculations based on density functional theory to investigate surface catalysis of late transition metal oxides. Project Assistant University of Florida September 2008  –  September 2009  (1 year 1 month) Gainesville, Florida Area Development, design and scale-up of processes for MOSAIC Co. Intern Kochi Refineries Limited August 2006  –  May 2007  (10 months) Cochin Area, India Trainee Hindustan Organic Chemicals Limited November 2005  –  January 2006  (3 months) Cochin Area, India Plasma/Dry Etch Process Development Engineer Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon D1D Plasma/Dry Etch Process Development Engineer Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon D1D Research Assistant University of Florida October 2009  –  August 2013  (3 years 11 months) Gainesville, Florida Area Performed ab-initio quantum mechanical and molecular dynamics calculations based on density functional theory to investigate surface catalysis of late transition metal oxides. Research Assistant University of Florida October 2009  –  August 2013  (3 years 11 months) Gainesville, Florida Area Performed ab-initio quantum mechanical and molecular dynamics calculations based on density functional theory to investigate surface catalysis of late transition metal oxides. Project Assistant University of Florida September 2008  –  September 2009  (1 year 1 month) Gainesville, Florida Area Development, design and scale-up of processes for MOSAIC Co. Project Assistant University of Florida September 2008  –  September 2009  (1 year 1 month) Gainesville, Florida Area Development, design and scale-up of processes for MOSAIC Co. Intern Kochi Refineries Limited August 2006  –  May 2007  (10 months) Cochin Area, India Intern Kochi Refineries Limited August 2006  –  May 2007  (10 months) Cochin Area, India Trainee Hindustan Organic Chemicals Limited November 2005  –  January 2006  (3 months) Cochin Area, India Trainee Hindustan Organic Chemicals Limited November 2005  –  January 2006  (3 months) Cochin Area, India Skills Computational Chemistry Density Functional... Gaussian 03 Catalysis Heterogeneous Catalysis Molecular Modeling Surface Modeling Surface Analysis Kinetic Modeling VASP Oral & Written... Monte Carlo Simulation Fortran Borland C++ Matlab Java Perl Bash Surface Chemistry Palladium Flotation Process Design Process Optimization Characterization Publications Chemical Engineering Powder X-ray Diffraction DFT Materials Science See 14+     See less Skills  Computational Chemistry Density Functional... Gaussian 03 Catalysis Heterogeneous Catalysis Molecular Modeling Surface Modeling Surface Analysis Kinetic Modeling VASP Oral & Written... Monte Carlo Simulation Fortran Borland C++ Matlab Java Perl Bash Surface Chemistry Palladium Flotation Process Design Process Optimization Characterization Publications Chemical Engineering Powder X-ray Diffraction DFT Materials Science See 14+     See less Computational Chemistry Density Functional... Gaussian 03 Catalysis Heterogeneous Catalysis Molecular Modeling Surface Modeling Surface Analysis Kinetic Modeling VASP Oral & Written... Monte Carlo Simulation Fortran Borland C++ Matlab Java Perl Bash Surface Chemistry Palladium Flotation Process Design Process Optimization Characterization Publications Chemical Engineering Powder X-ray Diffraction DFT Materials Science See 14+     See less Computational Chemistry Density Functional... Gaussian 03 Catalysis Heterogeneous Catalysis Molecular Modeling Surface Modeling Surface Analysis Kinetic Modeling VASP Oral & Written... Monte Carlo Simulation Fortran Borland C++ Matlab Java Perl Bash Surface Chemistry Palladium Flotation Process Design Process Optimization Characterization Publications Chemical Engineering Powder X-ray Diffraction DFT Materials Science See 14+     See less Education University of Florida PhD,  Chemical Engineering University of Florida Masters,  Chemical Engineering University of Kerala B.Tech,  Chemical Engineering University of Florida PhD,  Chemical Engineering University of Florida PhD,  Chemical Engineering University of Florida PhD,  Chemical Engineering University of Florida Masters,  Chemical Engineering University of Florida Masters,  Chemical Engineering University of Florida Masters,  Chemical Engineering University of Kerala B.Tech,  Chemical Engineering University of Kerala B.Tech,  Chemical Engineering University of Kerala B.Tech,  Chemical Engineering Honors & Awards Publication Award (2012) Department of Chemical Engineering, University of Florida July 2013 \"Pathways for C-H bond cleavage of propane sigma-complexes on PdO(101), Phys. Chem. Chem. Phys., 14, 12202-12212 (2012)\" Presenter Award (2012) Department of Chemical Engineering March 2012 Publication Award (2012) Department of Chemical Engineering, University of Florida July 2013 \"Pathways for C-H bond cleavage of propane sigma-complexes on PdO(101), Phys. Chem. Chem. Phys., 14, 12202-12212 (2012)\" Publication Award (2012) Department of Chemical Engineering, University of Florida July 2013 \"Pathways for C-H bond cleavage of propane sigma-complexes on PdO(101), Phys. Chem. Chem. Phys., 14, 12202-12212 (2012)\" Publication Award (2012) Department of Chemical Engineering, University of Florida July 2013 \"Pathways for C-H bond cleavage of propane sigma-complexes on PdO(101), Phys. Chem. Chem. Phys., 14, 12202-12212 (2012)\" Presenter Award (2012) Department of Chemical Engineering March 2012 Presenter Award (2012) Department of Chemical Engineering March 2012 Presenter Award (2012) Department of Chemical Engineering March 2012 ", "Summary Manuel is a Class Test (CT) Module Process Development Engineer with Intel Corporation that focuses on the development, optimization, qualification and deployment of robust microelectronic packages test equipment and processes. In 2011 Manuel’s work included new equipment, tooling, and process characterization work. In 2012, he will be working on transferring those processes to Intel factories all over the world. \nManuel is interested in developing his abilities in mechanical failure and design, microelectronics packages thermal analysis, manufacturing and processing activities, and material science activities. Specialties:Results-driven with practical experience in thermo-mechanical design and failure analysis. Expertise in solid mechanics and advanced materials characterization techniques; Significant work in finite element modeling for failure analysis, and structure reliability of microstructures, mechanical parts and full assemblies; Expirience with numerical simulation and computational mechanics; Excellent written and verbal comunication skills, authorship of published work; Team environment dynamic. Summary Manuel is a Class Test (CT) Module Process Development Engineer with Intel Corporation that focuses on the development, optimization, qualification and deployment of robust microelectronic packages test equipment and processes. In 2011 Manuel’s work included new equipment, tooling, and process characterization work. In 2012, he will be working on transferring those processes to Intel factories all over the world. \nManuel is interested in developing his abilities in mechanical failure and design, microelectronics packages thermal analysis, manufacturing and processing activities, and material science activities. Specialties:Results-driven with practical experience in thermo-mechanical design and failure analysis. Expertise in solid mechanics and advanced materials characterization techniques; Significant work in finite element modeling for failure analysis, and structure reliability of microstructures, mechanical parts and full assemblies; Expirience with numerical simulation and computational mechanics; Excellent written and verbal comunication skills, authorship of published work; Team environment dynamic. Manuel is a Class Test (CT) Module Process Development Engineer with Intel Corporation that focuses on the development, optimization, qualification and deployment of robust microelectronic packages test equipment and processes. In 2011 Manuel’s work included new equipment, tooling, and process characterization work. In 2012, he will be working on transferring those processes to Intel factories all over the world. \nManuel is interested in developing his abilities in mechanical failure and design, microelectronics packages thermal analysis, manufacturing and processing activities, and material science activities. Specialties:Results-driven with practical experience in thermo-mechanical design and failure analysis. Expertise in solid mechanics and advanced materials characterization techniques; Significant work in finite element modeling for failure analysis, and structure reliability of microstructures, mechanical parts and full assemblies; Expirience with numerical simulation and computational mechanics; Excellent written and verbal comunication skills, authorship of published work; Team environment dynamic. Manuel is a Class Test (CT) Module Process Development Engineer with Intel Corporation that focuses on the development, optimization, qualification and deployment of robust microelectronic packages test equipment and processes. In 2011 Manuel’s work included new equipment, tooling, and process characterization work. In 2012, he will be working on transferring those processes to Intel factories all over the world. \nManuel is interested in developing his abilities in mechanical failure and design, microelectronics packages thermal analysis, manufacturing and processing activities, and material science activities. Specialties:Results-driven with practical experience in thermo-mechanical design and failure analysis. Expertise in solid mechanics and advanced materials characterization techniques; Significant work in finite element modeling for failure analysis, and structure reliability of microstructures, mechanical parts and full assemblies; Expirience with numerical simulation and computational mechanics; Excellent written and verbal comunication skills, authorship of published work; Team environment dynamic. Experience Test RnD Engineer Intel Corporation May 2010  – Present (5 years 4 months) Phoenix, Arizona Area - Manuel is a Class Test (CT) Module Process Development Engineer at Intel Corporation in chandler Ariona that focuses on the development, optimization, qualification and deployment of robust microelectronic package device test equipment and processes (Thermal, Mechanical and Electrical tests and processes).  \n- Manuel developed and obtained a patento on a micro-channel de-applicator to clean the remaining liquid termal interface material on the surface of computer and mobile devices. \n- Manuel Worked on the installation and qualification of an in-line defect detection system in order to support the defect free initiative while testing computer and mobile devices at Intel's Class Test Module. \n- Manuel is currently working on transferring these Test processes to Intel factories all over the world. Graduate Research Assistant Arizona State University June 2005  –  May 2010  (5 years) Tempe, AZ - Simulated the thermo-mechanical behavior and structure-property relations of next generation nuclear fuels (specifically nitrides) by developping 2-D and 3-D Finite Element Models. Creep, Swelling, Thermal Expansion and Fracture we’re succesfully simulated along with degradation of mechanical and thermal properties of the fuel in question (PuN) with time and Temperature. \n- Structural Health Monitoring (SHM) and prognosis of aerospace systems on the Multidisciplinary University Research Initiative (MURI) by developing 2-D and 3-D Finite Element Models for fatigue simulations of lugjoint, dogbone and CT specimens, besides running experimental mechanical tests on these samples. Engineering Consultant Global Vantage November 2007  –  October 2008  (1 year) · Analyzed Airplane SPU and BCU Batteries using Finite Element Analysis to determine if they satisfied the vibration and structural required safety factors for their operation. \n· Developed a probabilistic analysis of re-engineered turbine engine blades in order to improve the quality of the measurements taken on different spots in the blade \n· Analyzed and re-designed tools for Pratt and Whitney by using hand calculations and Finite Element Models to analyze the structure reliability of the tools. Summer Research Intern Los Alamos National Laboratory June 2006  –  August 2006  (3 months) Materials Science and Technology Division MST-8. \n· Developed material characterization techniques aimed at next generation nuclear fuels for the Advanced Fuel Cycle Initiative, in order to better understand the relation between the ceramic structure of the fuel and it's mechanical properties. Engineering Student Consultant INFOSPA (wood working company) January 2003  –  May 2003  (5 months) · Applied knowledge obtained in \"Work Design\" course: Movements, Time and Space of work area study, along with process flow chart, operations chart, route chart, man-machine chart, plant layout, ergonomics and analysis of the work process. Student Competition Utah State University and ITESM Campus Chihuahua, Mexico January 2002  –  December 2002  (1 year) Designed and built the stearing mechanism for a Mini-Baja vehicle. Test RnD Engineer Intel Corporation May 2010  – Present (5 years 4 months) Phoenix, Arizona Area - Manuel is a Class Test (CT) Module Process Development Engineer at Intel Corporation in chandler Ariona that focuses on the development, optimization, qualification and deployment of robust microelectronic package device test equipment and processes (Thermal, Mechanical and Electrical tests and processes).  \n- Manuel developed and obtained a patento on a micro-channel de-applicator to clean the remaining liquid termal interface material on the surface of computer and mobile devices. \n- Manuel Worked on the installation and qualification of an in-line defect detection system in order to support the defect free initiative while testing computer and mobile devices at Intel's Class Test Module. \n- Manuel is currently working on transferring these Test processes to Intel factories all over the world. Test RnD Engineer Intel Corporation May 2010  – Present (5 years 4 months) Phoenix, Arizona Area - Manuel is a Class Test (CT) Module Process Development Engineer at Intel Corporation in chandler Ariona that focuses on the development, optimization, qualification and deployment of robust microelectronic package device test equipment and processes (Thermal, Mechanical and Electrical tests and processes).  \n- Manuel developed and obtained a patento on a micro-channel de-applicator to clean the remaining liquid termal interface material on the surface of computer and mobile devices. \n- Manuel Worked on the installation and qualification of an in-line defect detection system in order to support the defect free initiative while testing computer and mobile devices at Intel's Class Test Module. \n- Manuel is currently working on transferring these Test processes to Intel factories all over the world. Graduate Research Assistant Arizona State University June 2005  –  May 2010  (5 years) Tempe, AZ - Simulated the thermo-mechanical behavior and structure-property relations of next generation nuclear fuels (specifically nitrides) by developping 2-D and 3-D Finite Element Models. Creep, Swelling, Thermal Expansion and Fracture we’re succesfully simulated along with degradation of mechanical and thermal properties of the fuel in question (PuN) with time and Temperature. \n- Structural Health Monitoring (SHM) and prognosis of aerospace systems on the Multidisciplinary University Research Initiative (MURI) by developing 2-D and 3-D Finite Element Models for fatigue simulations of lugjoint, dogbone and CT specimens, besides running experimental mechanical tests on these samples. Graduate Research Assistant Arizona State University June 2005  –  May 2010  (5 years) Tempe, AZ - Simulated the thermo-mechanical behavior and structure-property relations of next generation nuclear fuels (specifically nitrides) by developping 2-D and 3-D Finite Element Models. Creep, Swelling, Thermal Expansion and Fracture we’re succesfully simulated along with degradation of mechanical and thermal properties of the fuel in question (PuN) with time and Temperature. \n- Structural Health Monitoring (SHM) and prognosis of aerospace systems on the Multidisciplinary University Research Initiative (MURI) by developing 2-D and 3-D Finite Element Models for fatigue simulations of lugjoint, dogbone and CT specimens, besides running experimental mechanical tests on these samples. Engineering Consultant Global Vantage November 2007  –  October 2008  (1 year) · Analyzed Airplane SPU and BCU Batteries using Finite Element Analysis to determine if they satisfied the vibration and structural required safety factors for their operation. \n· Developed a probabilistic analysis of re-engineered turbine engine blades in order to improve the quality of the measurements taken on different spots in the blade \n· Analyzed and re-designed tools for Pratt and Whitney by using hand calculations and Finite Element Models to analyze the structure reliability of the tools. Engineering Consultant Global Vantage November 2007  –  October 2008  (1 year) · Analyzed Airplane SPU and BCU Batteries using Finite Element Analysis to determine if they satisfied the vibration and structural required safety factors for their operation. \n· Developed a probabilistic analysis of re-engineered turbine engine blades in order to improve the quality of the measurements taken on different spots in the blade \n· Analyzed and re-designed tools for Pratt and Whitney by using hand calculations and Finite Element Models to analyze the structure reliability of the tools. Summer Research Intern Los Alamos National Laboratory June 2006  –  August 2006  (3 months) Materials Science and Technology Division MST-8. \n· Developed material characterization techniques aimed at next generation nuclear fuels for the Advanced Fuel Cycle Initiative, in order to better understand the relation between the ceramic structure of the fuel and it's mechanical properties. Summer Research Intern Los Alamos National Laboratory June 2006  –  August 2006  (3 months) Materials Science and Technology Division MST-8. \n· Developed material characterization techniques aimed at next generation nuclear fuels for the Advanced Fuel Cycle Initiative, in order to better understand the relation between the ceramic structure of the fuel and it's mechanical properties. Engineering Student Consultant INFOSPA (wood working company) January 2003  –  May 2003  (5 months) · Applied knowledge obtained in \"Work Design\" course: Movements, Time and Space of work area study, along with process flow chart, operations chart, route chart, man-machine chart, plant layout, ergonomics and analysis of the work process. Engineering Student Consultant INFOSPA (wood working company) January 2003  –  May 2003  (5 months) · Applied knowledge obtained in \"Work Design\" course: Movements, Time and Space of work area study, along with process flow chart, operations chart, route chart, man-machine chart, plant layout, ergonomics and analysis of the work process. Student Competition Utah State University and ITESM Campus Chihuahua, Mexico January 2002  –  December 2002  (1 year) Designed and built the stearing mechanism for a Mini-Baja vehicle. Student Competition Utah State University and ITESM Campus Chihuahua, Mexico January 2002  –  December 2002  (1 year) Designed and built the stearing mechanism for a Mini-Baja vehicle. Languages Spanish English Spanish English Spanish English Skills Automated Test Equipment Electro Thermal Analysis Electro Mechanical... Failure Mode and... Modeling Interfacial... Statistical Process... Windows and Linux OS Solid Mechanics Advanced Materials... Finite Element Analysis Thermal Analysis Failure Analysis and... Random Processes Vibration Analysis Mechanical Testing Machine Design Design of Experiments Heat Transfer Analysis Scanning Electron... Orientation Microscopy... Indentation and... Stress Analysis Ergonomics Operations Control Polishing Metallic and... Matlab Mathematica MathCAD Solidworks Abaqus ANSYS Characterization Engineering Heat Transfer Metals Failure Analysis Mechanical Engineering SPC See 23+     See less Skills  Automated Test Equipment Electro Thermal Analysis Electro Mechanical... Failure Mode and... Modeling Interfacial... Statistical Process... Windows and Linux OS Solid Mechanics Advanced Materials... Finite Element Analysis Thermal Analysis Failure Analysis and... Random Processes Vibration Analysis Mechanical Testing Machine Design Design of Experiments Heat Transfer Analysis Scanning Electron... Orientation Microscopy... Indentation and... Stress Analysis Ergonomics Operations Control Polishing Metallic and... Matlab Mathematica MathCAD Solidworks Abaqus ANSYS Characterization Engineering Heat Transfer Metals Failure Analysis Mechanical Engineering SPC See 23+     See less Automated Test Equipment Electro Thermal Analysis Electro Mechanical... Failure Mode and... Modeling Interfacial... Statistical Process... Windows and Linux OS Solid Mechanics Advanced Materials... Finite Element Analysis Thermal Analysis Failure Analysis and... Random Processes Vibration Analysis Mechanical Testing Machine Design Design of Experiments Heat Transfer Analysis Scanning Electron... Orientation Microscopy... Indentation and... Stress Analysis Ergonomics Operations Control Polishing Metallic and... Matlab Mathematica MathCAD Solidworks Abaqus ANSYS Characterization Engineering Heat Transfer Metals Failure Analysis Mechanical Engineering SPC See 23+     See less Automated Test Equipment Electro Thermal Analysis Electro Mechanical... Failure Mode and... Modeling Interfacial... Statistical Process... Windows and Linux OS Solid Mechanics Advanced Materials... Finite Element Analysis Thermal Analysis Failure Analysis and... Random Processes Vibration Analysis Mechanical Testing Machine Design Design of Experiments Heat Transfer Analysis Scanning Electron... Orientation Microscopy... Indentation and... Stress Analysis Ergonomics Operations Control Polishing Metallic and... Matlab Mathematica MathCAD Solidworks Abaqus ANSYS Characterization Engineering Heat Transfer Metals Failure Analysis Mechanical Engineering SPC See 23+     See less Education Arizona State University PhD in Mechanical Engineering,  Engineering , 3.86 2007  – 2010 PhD in Mechanical Engineering (Emphasis on structure-property relations of ceramic nuclear fuels and metallic materials) Activities and Societies:  ASME Arizona State University M.S.E.,  Mechanical Engineering 2005  – 2007 M.S.E. in Mechanical Engineering (Focus in Advanced Solid Mechanics and Mechanical Design) \n \nG.P.A. 3.86 Instituto Tecnológico y de Estudios Superiores de Monterrey (ITESM), Campus Chihuahua, Mexico Mechanical Engineering,  Engineering 2000  – 2004 B.S.E. in Mechanical Engineering with a minor in Industrial Engineering  \n \nG.P.A. 96% Arizona State University PhD in Mechanical Engineering,  Engineering , 3.86 2007  – 2010 PhD in Mechanical Engineering (Emphasis on structure-property relations of ceramic nuclear fuels and metallic materials) Activities and Societies:  ASME Arizona State University PhD in Mechanical Engineering,  Engineering , 3.86 2007  – 2010 PhD in Mechanical Engineering (Emphasis on structure-property relations of ceramic nuclear fuels and metallic materials) Activities and Societies:  ASME Arizona State University PhD in Mechanical Engineering,  Engineering , 3.86 2007  – 2010 PhD in Mechanical Engineering (Emphasis on structure-property relations of ceramic nuclear fuels and metallic materials) Activities and Societies:  ASME Arizona State University M.S.E.,  Mechanical Engineering 2005  – 2007 M.S.E. in Mechanical Engineering (Focus in Advanced Solid Mechanics and Mechanical Design) \n \nG.P.A. 3.86 Arizona State University M.S.E.,  Mechanical Engineering 2005  – 2007 M.S.E. in Mechanical Engineering (Focus in Advanced Solid Mechanics and Mechanical Design) \n \nG.P.A. 3.86 Arizona State University M.S.E.,  Mechanical Engineering 2005  – 2007 M.S.E. in Mechanical Engineering (Focus in Advanced Solid Mechanics and Mechanical Design) \n \nG.P.A. 3.86 Instituto Tecnológico y de Estudios Superiores de Monterrey (ITESM), Campus Chihuahua, Mexico Mechanical Engineering,  Engineering 2000  – 2004 B.S.E. in Mechanical Engineering with a minor in Industrial Engineering  \n \nG.P.A. 96% Instituto Tecnológico y de Estudios Superiores de Monterrey (ITESM), Campus Chihuahua, Mexico Mechanical Engineering,  Engineering 2000  – 2004 B.S.E. in Mechanical Engineering with a minor in Industrial Engineering  \n \nG.P.A. 96% Instituto Tecnológico y de Estudios Superiores de Monterrey (ITESM), Campus Chihuahua, Mexico Mechanical Engineering,  Engineering 2000  – 2004 B.S.E. in Mechanical Engineering with a minor in Industrial Engineering  \n \nG.P.A. 96% Honors & Awards Additional Honors & Awards Academic Excellence Scholarship” at ITESM Campus Chihuahua, Mexico, 2000-2004 \nDeans’s List, 2000, 2001,2003, while studying at ITESM Campus Chihuahua, Mexico \nDean’s List, 2004 while an exchange student at Arizona State University \nCENEVAL for Mechanical Engineering score 1152/1400 ; Obtained 6° place in the nation (Mexico), 2004 \nArizona State University Fulton Fellowship, 2006-2007 Additional Honors & Awards Academic Excellence Scholarship” at ITESM Campus Chihuahua, Mexico, 2000-2004 \nDeans’s List, 2000, 2001,2003, while studying at ITESM Campus Chihuahua, Mexico \nDean’s List, 2004 while an exchange student at Arizona State University \nCENEVAL for Mechanical Engineering score 1152/1400 ; Obtained 6° place in the nation (Mexico), 2004 \nArizona State University Fulton Fellowship, 2006-2007 Additional Honors & Awards Academic Excellence Scholarship” at ITESM Campus Chihuahua, Mexico, 2000-2004 \nDeans’s List, 2000, 2001,2003, while studying at ITESM Campus Chihuahua, Mexico \nDean’s List, 2004 while an exchange student at Arizona State University \nCENEVAL for Mechanical Engineering score 1152/1400 ; Obtained 6° place in the nation (Mexico), 2004 \nArizona State University Fulton Fellowship, 2006-2007 Additional Honors & Awards Academic Excellence Scholarship” at ITESM Campus Chihuahua, Mexico, 2000-2004 \nDeans’s List, 2000, 2001,2003, while studying at ITESM Campus Chihuahua, Mexico \nDean’s List, 2004 while an exchange student at Arizona State University \nCENEVAL for Mechanical Engineering score 1152/1400 ; Obtained 6° place in the nation (Mexico), 2004 \nArizona State University Fulton Fellowship, 2006-2007 ", "Experience Flip Chip Process Development Engineer Intel Corporation January 2004  – Present (11 years 8 months) Assembly Process Development Engineer IBM 1997  –  2003  (6 years) Endicott, NY Flip Chip Process Development Engineer Intel Corporation January 2004  – Present (11 years 8 months) Flip Chip Process Development Engineer Intel Corporation January 2004  – Present (11 years 8 months) Assembly Process Development Engineer IBM 1997  –  2003  (6 years) Endicott, NY Assembly Process Development Engineer IBM 1997  –  2003  (6 years) Endicott, NY Education State University of New York at Binghamton Master of Science (MS),  Materials Engineering 2003 Clarkson University Bachelor of Science (BS),  Mechanical Engineering 1993  – 1997 State University of New York at Binghamton Master of Science (MS),  Materials Engineering 2003 State University of New York at Binghamton Master of Science (MS),  Materials Engineering 2003 State University of New York at Binghamton Master of Science (MS),  Materials Engineering 2003 Clarkson University Bachelor of Science (BS),  Mechanical Engineering 1993  – 1997 Clarkson University Bachelor of Science (BS),  Mechanical Engineering 1993  – 1997 Clarkson University Bachelor of Science (BS),  Mechanical Engineering 1993  – 1997 ", "Summary Process development: Statistical Process Control (SPC); Design of Experiments (DOE), Defect-free manufacturing | Optical methods: Sub-nm diffraction-based semiconductor processing metrology; Optical signal modeling of thin-films & periodic structures on Silicon substrates; Laser trapping & micro-manipulation techniques; Nanosecond and picosecond UV/VIS lasers; Time-resolved spectroscopy of single molecules & bulk material | Programming: Microsoft Visual Studio, C#, VBA, Perl, SQL, LabView, Signal Express, JMP, JSL, MATLAB, Diatrack Summary Process development: Statistical Process Control (SPC); Design of Experiments (DOE), Defect-free manufacturing | Optical methods: Sub-nm diffraction-based semiconductor processing metrology; Optical signal modeling of thin-films & periodic structures on Silicon substrates; Laser trapping & micro-manipulation techniques; Nanosecond and picosecond UV/VIS lasers; Time-resolved spectroscopy of single molecules & bulk material | Programming: Microsoft Visual Studio, C#, VBA, Perl, SQL, LabView, Signal Express, JMP, JSL, MATLAB, Diatrack Process development: Statistical Process Control (SPC); Design of Experiments (DOE), Defect-free manufacturing | Optical methods: Sub-nm diffraction-based semiconductor processing metrology; Optical signal modeling of thin-films & periodic structures on Silicon substrates; Laser trapping & micro-manipulation techniques; Nanosecond and picosecond UV/VIS lasers; Time-resolved spectroscopy of single molecules & bulk material | Programming: Microsoft Visual Studio, C#, VBA, Perl, SQL, LabView, Signal Express, JMP, JSL, MATLAB, Diatrack Process development: Statistical Process Control (SPC); Design of Experiments (DOE), Defect-free manufacturing | Optical methods: Sub-nm diffraction-based semiconductor processing metrology; Optical signal modeling of thin-films & periodic structures on Silicon substrates; Laser trapping & micro-manipulation techniques; Nanosecond and picosecond UV/VIS lasers; Time-resolved spectroscopy of single molecules & bulk material | Programming: Microsoft Visual Studio, C#, VBA, Perl, SQL, LabView, Signal Express, JMP, JSL, MATLAB, Diatrack Experience Process Engineering Suss MICROTEC PHOTONIC SYSTEMS January 2015  – Present (8 months) Corona, CA Senior Lithography Process Development Engineer Intel Corporation January 2011  –  January 2015  (4 years 1 month) Hillsboro, OR Technical lead in lithographic metrology for Intel’s 22 nm and 14 nm process nodes \nExpertise: overlay, optical critical dimension measurement, reticle inspection for IvyBridge, Haswell, Broadwell and later Doctoral Candidate in Physical Chemistry University of Chicago June 2003  –  2010  (7 years) Developed a time-resolved single molecule FRET experiment to study protein dynamics, and an optical trapping system to study properties of driven colloids in confinement. Process Engineering Suss MICROTEC PHOTONIC SYSTEMS January 2015  – Present (8 months) Corona, CA Process Engineering Suss MICROTEC PHOTONIC SYSTEMS January 2015  – Present (8 months) Corona, CA Senior Lithography Process Development Engineer Intel Corporation January 2011  –  January 2015  (4 years 1 month) Hillsboro, OR Technical lead in lithographic metrology for Intel’s 22 nm and 14 nm process nodes \nExpertise: overlay, optical critical dimension measurement, reticle inspection for IvyBridge, Haswell, Broadwell and later Senior Lithography Process Development Engineer Intel Corporation January 2011  –  January 2015  (4 years 1 month) Hillsboro, OR Technical lead in lithographic metrology for Intel’s 22 nm and 14 nm process nodes \nExpertise: overlay, optical critical dimension measurement, reticle inspection for IvyBridge, Haswell, Broadwell and later Doctoral Candidate in Physical Chemistry University of Chicago June 2003  –  2010  (7 years) Developed a time-resolved single molecule FRET experiment to study protein dynamics, and an optical trapping system to study properties of driven colloids in confinement. Doctoral Candidate in Physical Chemistry University of Chicago June 2003  –  2010  (7 years) Developed a time-resolved single molecule FRET experiment to study protein dynamics, and an optical trapping system to study properties of driven colloids in confinement. Languages Serbian French Serbian French Serbian French Skills Experimentation Protein Chemistry Process Simulation Semiconductors Physical Chemistry Metrology Lithography Nanotechnology Spectroscopy Materials Science Thin Films Chemistry Physics Characterization Surface Chemistry Optics Design of Experiments Nanoparticles Labview UV/Vis Matlab JMP Fluorescence LabVIEW See 9+     See less Skills  Experimentation Protein Chemistry Process Simulation Semiconductors Physical Chemistry Metrology Lithography Nanotechnology Spectroscopy Materials Science Thin Films Chemistry Physics Characterization Surface Chemistry Optics Design of Experiments Nanoparticles Labview UV/Vis Matlab JMP Fluorescence LabVIEW See 9+     See less Experimentation Protein Chemistry Process Simulation Semiconductors Physical Chemistry Metrology Lithography Nanotechnology Spectroscopy Materials Science Thin Films Chemistry Physics Characterization Surface Chemistry Optics Design of Experiments Nanoparticles Labview UV/Vis Matlab JMP Fluorescence LabVIEW See 9+     See less Experimentation Protein Chemistry Process Simulation Semiconductors Physical Chemistry Metrology Lithography Nanotechnology Spectroscopy Materials Science Thin Films Chemistry Physics Characterization Surface Chemistry Optics Design of Experiments Nanoparticles Labview UV/Vis Matlab JMP Fluorescence LabVIEW See 9+     See less Education University of Chicago PhD,  Physical Chemistry 2003  – 2010 Thesis: Non-equilibrium Responses of Complex Fluids and Proteins to Nano-mechanical Perturbation \n \n- Designed & built laser optical trap to measure pico-Newton perturbation forces in confined colloids \n- Simulated Stokesian Dynamics of optically trapped colloids and photo-excited biomolecules \n- Constructed nanosecond total internal reflection (TIRF) microscope for fluorescence burst studies \n \nPUBLICATIONS \nStructural Responses of Quasi-2D Colloid Fluids to Excitations Elicited by Nonequilibrium Perturbations, Physical Review E, 86(031403) (2012)  \nA large collapse-state RNA can exhibit simple exponential single molecule dynamics Journal of Molecular Biology, 378 941-951 (2008)  \nPlasmon-enhanced Trapping of Individual Metal Nanorods, Proc. SPIE, 6644, 66441C (2007)  \nPlasmon resonance-based optical trapping of single and multiple Au nanoparticles Optics Express, 15, 12017-12029 (2007) Activities and Societies:  ‘Science with a bang’ ,  MRSEC Outreach Program\n‘Career Panel Series’ ,  Department of Chemistry University of Chicago MS,  Physical Chemistry 2003  – 2004 University of Belgrade BS,  Physical Chemistry 1998  – 2003 Topic: Ab-initio quantum mechanics calculations of Renner-Teller effect in the NCN radical N/A University of Chicago PhD,  Physical Chemistry 2003  – 2010 Thesis: Non-equilibrium Responses of Complex Fluids and Proteins to Nano-mechanical Perturbation \n \n- Designed & built laser optical trap to measure pico-Newton perturbation forces in confined colloids \n- Simulated Stokesian Dynamics of optically trapped colloids and photo-excited biomolecules \n- Constructed nanosecond total internal reflection (TIRF) microscope for fluorescence burst studies \n \nPUBLICATIONS \nStructural Responses of Quasi-2D Colloid Fluids to Excitations Elicited by Nonequilibrium Perturbations, Physical Review E, 86(031403) (2012)  \nA large collapse-state RNA can exhibit simple exponential single molecule dynamics Journal of Molecular Biology, 378 941-951 (2008)  \nPlasmon-enhanced Trapping of Individual Metal Nanorods, Proc. SPIE, 6644, 66441C (2007)  \nPlasmon resonance-based optical trapping of single and multiple Au nanoparticles Optics Express, 15, 12017-12029 (2007) Activities and Societies:  ‘Science with a bang’ ,  MRSEC Outreach Program\n‘Career Panel Series’ ,  Department of Chemistry University of Chicago PhD,  Physical Chemistry 2003  – 2010 Thesis: Non-equilibrium Responses of Complex Fluids and Proteins to Nano-mechanical Perturbation \n \n- Designed & built laser optical trap to measure pico-Newton perturbation forces in confined colloids \n- Simulated Stokesian Dynamics of optically trapped colloids and photo-excited biomolecules \n- Constructed nanosecond total internal reflection (TIRF) microscope for fluorescence burst studies \n \nPUBLICATIONS \nStructural Responses of Quasi-2D Colloid Fluids to Excitations Elicited by Nonequilibrium Perturbations, Physical Review E, 86(031403) (2012)  \nA large collapse-state RNA can exhibit simple exponential single molecule dynamics Journal of Molecular Biology, 378 941-951 (2008)  \nPlasmon-enhanced Trapping of Individual Metal Nanorods, Proc. SPIE, 6644, 66441C (2007)  \nPlasmon resonance-based optical trapping of single and multiple Au nanoparticles Optics Express, 15, 12017-12029 (2007) Activities and Societies:  ‘Science with a bang’ ,  MRSEC Outreach Program\n‘Career Panel Series’ ,  Department of Chemistry University of Chicago PhD,  Physical Chemistry 2003  – 2010 Thesis: Non-equilibrium Responses of Complex Fluids and Proteins to Nano-mechanical Perturbation \n \n- Designed & built laser optical trap to measure pico-Newton perturbation forces in confined colloids \n- Simulated Stokesian Dynamics of optically trapped colloids and photo-excited biomolecules \n- Constructed nanosecond total internal reflection (TIRF) microscope for fluorescence burst studies \n \nPUBLICATIONS \nStructural Responses of Quasi-2D Colloid Fluids to Excitations Elicited by Nonequilibrium Perturbations, Physical Review E, 86(031403) (2012)  \nA large collapse-state RNA can exhibit simple exponential single molecule dynamics Journal of Molecular Biology, 378 941-951 (2008)  \nPlasmon-enhanced Trapping of Individual Metal Nanorods, Proc. SPIE, 6644, 66441C (2007)  \nPlasmon resonance-based optical trapping of single and multiple Au nanoparticles Optics Express, 15, 12017-12029 (2007) Activities and Societies:  ‘Science with a bang’ ,  MRSEC Outreach Program\n‘Career Panel Series’ ,  Department of Chemistry University of Chicago MS,  Physical Chemistry 2003  – 2004 University of Chicago MS,  Physical Chemistry 2003  – 2004 University of Chicago MS,  Physical Chemistry 2003  – 2004 University of Belgrade BS,  Physical Chemistry 1998  – 2003 Topic: Ab-initio quantum mechanics calculations of Renner-Teller effect in the NCN radical University of Belgrade BS,  Physical Chemistry 1998  – 2003 Topic: Ab-initio quantum mechanics calculations of Renner-Teller effect in the NCN radical University of Belgrade BS,  Physical Chemistry 1998  – 2003 Topic: Ab-initio quantum mechanics calculations of Renner-Teller effect in the NCN radical N/A N/A N/A Honors & Awards Additional Honors & Awards 2004 – 2006: Burroughs Wellcome Fund Interfaces Fellow \n2003: McCormic Award, Department of Chemistry, University of Chicago, IL \n2002 – 2003: The Royal Norwegian Embassy Fellow for special academic achievements  \n1997 – 2003: Republic Department of Education of Serbia Undergraduate Studies Fellow Additional Honors & Awards 2004 – 2006: Burroughs Wellcome Fund Interfaces Fellow \n2003: McCormic Award, Department of Chemistry, University of Chicago, IL \n2002 – 2003: The Royal Norwegian Embassy Fellow for special academic achievements  \n1997 – 2003: Republic Department of Education of Serbia Undergraduate Studies Fellow Additional Honors & Awards 2004 – 2006: Burroughs Wellcome Fund Interfaces Fellow \n2003: McCormic Award, Department of Chemistry, University of Chicago, IL \n2002 – 2003: The Royal Norwegian Embassy Fellow for special academic achievements  \n1997 – 2003: Republic Department of Education of Serbia Undergraduate Studies Fellow Additional Honors & Awards 2004 – 2006: Burroughs Wellcome Fund Interfaces Fellow \n2003: McCormic Award, Department of Chemistry, University of Chicago, IL \n2002 – 2003: The Royal Norwegian Embassy Fellow for special academic achievements  \n1997 – 2003: Republic Department of Education of Serbia Undergraduate Studies Fellow "]}