{"position": "Product Manager", "company": "IBM", "profiles": ["Summary An innovative thinker, leader and strategist developing groundbreaking solutions at the intersection of social media, data and marketing. Currently the Product Manager for IBM Voices, a service that ranks Twitter and GNIP data according to relevance and influence. \n \nApplying experience as a highly effective community manager and social content producer to the design of internal social media tools. Leading a cross-disciplinary scrum team in the development of APIs and web services for IBM's worldwide efforts in marketing, communications, sales, events, sponsorships, products and client experience. \n \nSkilled at identifying opportunities and developing tactics for competitive insight, brand amplification, gap analysis and targeted listening using dynamic social media services. A savvy communicator capable of bridging the gap from marketing executives to software engineers and everyone in between. Summary An innovative thinker, leader and strategist developing groundbreaking solutions at the intersection of social media, data and marketing. Currently the Product Manager for IBM Voices, a service that ranks Twitter and GNIP data according to relevance and influence. \n \nApplying experience as a highly effective community manager and social content producer to the design of internal social media tools. Leading a cross-disciplinary scrum team in the development of APIs and web services for IBM's worldwide efforts in marketing, communications, sales, events, sponsorships, products and client experience. \n \nSkilled at identifying opportunities and developing tactics for competitive insight, brand amplification, gap analysis and targeted listening using dynamic social media services. A savvy communicator capable of bridging the gap from marketing executives to software engineers and everyone in between. An innovative thinker, leader and strategist developing groundbreaking solutions at the intersection of social media, data and marketing. Currently the Product Manager for IBM Voices, a service that ranks Twitter and GNIP data according to relevance and influence. \n \nApplying experience as a highly effective community manager and social content producer to the design of internal social media tools. Leading a cross-disciplinary scrum team in the development of APIs and web services for IBM's worldwide efforts in marketing, communications, sales, events, sponsorships, products and client experience. \n \nSkilled at identifying opportunities and developing tactics for competitive insight, brand amplification, gap analysis and targeted listening using dynamic social media services. A savvy communicator capable of bridging the gap from marketing executives to software engineers and everyone in between. An innovative thinker, leader and strategist developing groundbreaking solutions at the intersection of social media, data and marketing. Currently the Product Manager for IBM Voices, a service that ranks Twitter and GNIP data according to relevance and influence. \n \nApplying experience as a highly effective community manager and social content producer to the design of internal social media tools. Leading a cross-disciplinary scrum team in the development of APIs and web services for IBM's worldwide efforts in marketing, communications, sales, events, sponsorships, products and client experience. \n \nSkilled at identifying opportunities and developing tactics for competitive insight, brand amplification, gap analysis and targeted listening using dynamic social media services. A savvy communicator capable of bridging the gap from marketing executives to software engineers and everyone in between. Experience Product Manager IBM January 2014  – Present (1 year 8 months) New York, New York Product Manager for IBM Voices, a data-driven marketing service that collects, scores and ranks tweets from experts and influencers. \n* Lead a scrum team of engineers, developers, web analysts and designers in daily development tasks \n* Distill priorities from marketing and communications leads in order to create social media services that are useful across M&C, sales and events \n* Collaborate with IBM sales representatives to develop custom implementations for Fortune 500 clients \n* Responsible for maintaining quarterly budget of staff and resources \n* Manage external partner relationships with Twitter and GNIP as well as internal partner relationships \n* Provide consultation to users about optimal social media strategy and social listening tactics \n* Identify and enable subject matter experts across IBM globally who are good candidates for the Voices program \n \nSocial Content Strategist for corporate IBM social media channels \n* Advise a team of social content producers on effective tactics for IBM's Twitter, Facebook, LinkedIn, YouTube, Vine and Instagram channels Social Business Manager IBM April 2013  –  January 2014  (10 months) Greater New York City Area * Develop and execute strategy to increase the awareness and influence of IBM cloud computing across the social web and owned digital properties \n* Use social media and digital experience to elevate IBM cloud subject matter experts \n* Help develop corporate social practices and strategies to be implemented across IBM Community Manager for IBM Cloud IBM Global Content Services April 2011  –  March 2013  (2 years) * Developed and maintain the IBM cloud computing Facebook presence.  \n* Contribute to conversation about IBM and cloud computing on various social platforms.  \n* Manage community content and social engagement on the IBM cloud homepage. \n* Manage the design and development of a mobile app for IBM cloud. Reporter Johnson City Press March 2010  –  March 2011  (1 year 1 month) Wrote community features. Reported on police briefs, breaking news and local news. Wrote a monthly column for the community section. Shot and edited news video daily. Shot photos. Posted the online edition to the web daily. Product Manager IBM January 2014  – Present (1 year 8 months) New York, New York Product Manager for IBM Voices, a data-driven marketing service that collects, scores and ranks tweets from experts and influencers. \n* Lead a scrum team of engineers, developers, web analysts and designers in daily development tasks \n* Distill priorities from marketing and communications leads in order to create social media services that are useful across M&C, sales and events \n* Collaborate with IBM sales representatives to develop custom implementations for Fortune 500 clients \n* Responsible for maintaining quarterly budget of staff and resources \n* Manage external partner relationships with Twitter and GNIP as well as internal partner relationships \n* Provide consultation to users about optimal social media strategy and social listening tactics \n* Identify and enable subject matter experts across IBM globally who are good candidates for the Voices program \n \nSocial Content Strategist for corporate IBM social media channels \n* Advise a team of social content producers on effective tactics for IBM's Twitter, Facebook, LinkedIn, YouTube, Vine and Instagram channels Product Manager IBM January 2014  – Present (1 year 8 months) New York, New York Product Manager for IBM Voices, a data-driven marketing service that collects, scores and ranks tweets from experts and influencers. \n* Lead a scrum team of engineers, developers, web analysts and designers in daily development tasks \n* Distill priorities from marketing and communications leads in order to create social media services that are useful across M&C, sales and events \n* Collaborate with IBM sales representatives to develop custom implementations for Fortune 500 clients \n* Responsible for maintaining quarterly budget of staff and resources \n* Manage external partner relationships with Twitter and GNIP as well as internal partner relationships \n* Provide consultation to users about optimal social media strategy and social listening tactics \n* Identify and enable subject matter experts across IBM globally who are good candidates for the Voices program \n \nSocial Content Strategist for corporate IBM social media channels \n* Advise a team of social content producers on effective tactics for IBM's Twitter, Facebook, LinkedIn, YouTube, Vine and Instagram channels Social Business Manager IBM April 2013  –  January 2014  (10 months) Greater New York City Area * Develop and execute strategy to increase the awareness and influence of IBM cloud computing across the social web and owned digital properties \n* Use social media and digital experience to elevate IBM cloud subject matter experts \n* Help develop corporate social practices and strategies to be implemented across IBM Social Business Manager IBM April 2013  –  January 2014  (10 months) Greater New York City Area * Develop and execute strategy to increase the awareness and influence of IBM cloud computing across the social web and owned digital properties \n* Use social media and digital experience to elevate IBM cloud subject matter experts \n* Help develop corporate social practices and strategies to be implemented across IBM Community Manager for IBM Cloud IBM Global Content Services April 2011  –  March 2013  (2 years) * Developed and maintain the IBM cloud computing Facebook presence.  \n* Contribute to conversation about IBM and cloud computing on various social platforms.  \n* Manage community content and social engagement on the IBM cloud homepage. \n* Manage the design and development of a mobile app for IBM cloud. Community Manager for IBM Cloud IBM Global Content Services April 2011  –  March 2013  (2 years) * Developed and maintain the IBM cloud computing Facebook presence.  \n* Contribute to conversation about IBM and cloud computing on various social platforms.  \n* Manage community content and social engagement on the IBM cloud homepage. \n* Manage the design and development of a mobile app for IBM cloud. Reporter Johnson City Press March 2010  –  March 2011  (1 year 1 month) Wrote community features. Reported on police briefs, breaking news and local news. Wrote a monthly column for the community section. Shot and edited news video daily. Shot photos. Posted the online edition to the web daily. Reporter Johnson City Press March 2010  –  March 2011  (1 year 1 month) Wrote community features. Reported on police briefs, breaking news and local news. Wrote a monthly column for the community section. Shot and edited news video daily. Shot photos. Posted the online edition to the web daily. Skills Social Media Social Media Marketing Editing Facebook Blogging Journalism Content Strategy Content Development Technical Writing Web Content Copywriting Marketing Mobile Applications Public Speaking Cloud Computing Strategy Event Planning Web Design Product Management Agile Methodologies Scrum Digital Marketing APIs See 8+     See less Skills  Social Media Social Media Marketing Editing Facebook Blogging Journalism Content Strategy Content Development Technical Writing Web Content Copywriting Marketing Mobile Applications Public Speaking Cloud Computing Strategy Event Planning Web Design Product Management Agile Methodologies Scrum Digital Marketing APIs See 8+     See less Social Media Social Media Marketing Editing Facebook Blogging Journalism Content Strategy Content Development Technical Writing Web Content Copywriting Marketing Mobile Applications Public Speaking Cloud Computing Strategy Event Planning Web Design Product Management Agile Methodologies Scrum Digital Marketing APIs See 8+     See less Social Media Social Media Marketing Editing Facebook Blogging Journalism Content Strategy Content Development Technical Writing Web Content Copywriting Marketing Mobile Applications Public Speaking Cloud Computing Strategy Event Planning Web Design Product Management Agile Methodologies Scrum Digital Marketing APIs See 8+     See less Education General Assembly Product Management 10-week course 2015  – 2015 Milligan College B.A.,  Humanities ,  English 2006  – 2010 General Assembly Product Management 10-week course 2015  – 2015 General Assembly Product Management 10-week course 2015  – 2015 General Assembly Product Management 10-week course 2015  – 2015 Milligan College B.A.,  Humanities ,  English 2006  – 2010 Milligan College B.A.,  Humanities ,  English 2006  – 2010 Milligan College B.A.,  Humanities ,  English 2006  – 2010 ", "Skills Software Development C Unix AIX Enterprise Architecture Leadership DB2 Agile Methodologies Software Engineering Relational Databases Data Warehousing Management Databases Integration Enterprise Software Solution Architecture SOA Business Intelligence Shell Scripting Software Project... Database Design Cloud Computing High Availability Unix Shell Scripting Linux Software Design System Architecture Performance Tuning Solaris Data Modeling Architectures Distributed Systems Pre-sales Big Data See 19+     See less Skills  Software Development C Unix AIX Enterprise Architecture Leadership DB2 Agile Methodologies Software Engineering Relational Databases Data Warehousing Management Databases Integration Enterprise Software Solution Architecture SOA Business Intelligence Shell Scripting Software Project... Database Design Cloud Computing High Availability Unix Shell Scripting Linux Software Design System Architecture Performance Tuning Solaris Data Modeling Architectures Distributed Systems Pre-sales Big Data See 19+     See less Software Development C Unix AIX Enterprise Architecture Leadership DB2 Agile Methodologies Software Engineering Relational Databases Data Warehousing Management Databases Integration Enterprise Software Solution Architecture SOA Business Intelligence Shell Scripting Software Project... Database Design Cloud Computing High Availability Unix Shell Scripting Linux Software Design System Architecture Performance Tuning Solaris Data Modeling Architectures Distributed Systems Pre-sales Big Data See 19+     See less Software Development C Unix AIX Enterprise Architecture Leadership DB2 Agile Methodologies Software Engineering Relational Databases Data Warehousing Management Databases Integration Enterprise Software Solution Architecture SOA Business Intelligence Shell Scripting Software Project... Database Design Cloud Computing High Availability Unix Shell Scripting Linux Software Design System Architecture Performance Tuning Solaris Data Modeling Architectures Distributed Systems Pre-sales Big Data See 19+     See less ", "Skills ClearQuest Agile Methodologies Software Configuration... ClearCase Rational Team Concert Product Management Eclipse Software Engineering Unix Perl Test Automation Software Development Ant Integration Solaris Requirements Analysis System Architecture Software Project... Configuration Management Shell Scripting SOA Websphere Software Design CVS SDLC Scrum See 11+     See less Skills  ClearQuest Agile Methodologies Software Configuration... ClearCase Rational Team Concert Product Management Eclipse Software Engineering Unix Perl Test Automation Software Development Ant Integration Solaris Requirements Analysis System Architecture Software Project... Configuration Management Shell Scripting SOA Websphere Software Design CVS SDLC Scrum See 11+     See less ClearQuest Agile Methodologies Software Configuration... ClearCase Rational Team Concert Product Management Eclipse Software Engineering Unix Perl Test Automation Software Development Ant Integration Solaris Requirements Analysis System Architecture Software Project... Configuration Management Shell Scripting SOA Websphere Software Design CVS SDLC Scrum See 11+     See less ClearQuest Agile Methodologies Software Configuration... ClearCase Rational Team Concert Product Management Eclipse Software Engineering Unix Perl Test Automation Software Development Ant Integration Solaris Requirements Analysis System Architecture Software Project... Configuration Management Shell Scripting SOA Websphere Software Design CVS SDLC Scrum See 11+     See less ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills BladeCenter System X VMware Server Consolidation Storage Storage Virtualization IBM Servers SAN NAS Storage Area Networks Enterprise Storage Sales Enablement High Availability Storage Solutions Channel Partners Flex Systems PureFlex Getting The Job Done Working With Clients Data Analysis Pricing Analysis Teamwork Highly Reliable Going the Extra Mile Passion for Helping... See 10+     See less Skills  BladeCenter System X VMware Server Consolidation Storage Storage Virtualization IBM Servers SAN NAS Storage Area Networks Enterprise Storage Sales Enablement High Availability Storage Solutions Channel Partners Flex Systems PureFlex Getting The Job Done Working With Clients Data Analysis Pricing Analysis Teamwork Highly Reliable Going the Extra Mile Passion for Helping... See 10+     See less BladeCenter System X VMware Server Consolidation Storage Storage Virtualization IBM Servers SAN NAS Storage Area Networks Enterprise Storage Sales Enablement High Availability Storage Solutions Channel Partners Flex Systems PureFlex Getting The Job Done Working With Clients Data Analysis Pricing Analysis Teamwork Highly Reliable Going the Extra Mile Passion for Helping... See 10+     See less BladeCenter System X VMware Server Consolidation Storage Storage Virtualization IBM Servers SAN NAS Storage Area Networks Enterprise Storage Sales Enablement High Availability Storage Solutions Channel Partners Flex Systems PureFlex Getting The Job Done Working With Clients Data Analysis Pricing Analysis Teamwork Highly Reliable Going the Extra Mile Passion for Helping... See 10+     See less ", "Skills Product Management Enterprise Software Cloud Computing SaaS Business Process... Agile Methodologies Product Marketing Software Development ESB Internet of Things Integration Skills  Product Management Enterprise Software Cloud Computing SaaS Business Process... Agile Methodologies Product Marketing Software Development ESB Internet of Things Integration Product Management Enterprise Software Cloud Computing SaaS Business Process... Agile Methodologies Product Marketing Software Development ESB Internet of Things Integration Product Management Enterprise Software Cloud Computing SaaS Business Process... Agile Methodologies Product Marketing Software Development ESB Internet of Things Integration ", "Summary Delivering top-notch service through high productivity and collaboration is my specialty and I thrive in a diverse and fast-paced environment. I specialize in pragmatic marketing as well as agile development processes. Throughout my career I have accrued a multitude of skills including client/partner relations, product marketing, sales enablement, and management. I have demonstrated a tremendous ability to support and maintain numerous business objectives. I work diligently to provide excellence in all my professional endeavors and have earned a reputation for my integrity, initiative, and results-driven work ethic - and have been called a luminary in software markets. In my most recent role, I led Big Data and Cloud Product Strategy & Marketing for Progress DataDirect. Before that, I was responsible for Business Process Management solutions both at Progress and IBM. Prior to Progress, I spent many years at IBM where I held a number of technical and management positions and was instrumental in leading and product managing IBM’s WebSphere – from its inception to an expanding and very successful portfolio of products. I moved into leading-edge technologies in Web services, followed by architecture and open source. From there, I transitioned into the mobile & wireless world, which became a natural progression into mobile communications. With a passion for WebSphere, I moved back into a leadership role in BPM and SOA products performing end-to-end market management -- including enablement, working across functional teams, focusing on communications, product marketing, content creation and briefings for customers, partners, analysts, prospects, and Sales. Throughout my career, I have conducted hundreds of press briefings, trade publication interviews, and technical workshops. I have given hundreds of technical presentations & keynotes to customers, partners, executive teams, and analysts – participating in dozens of trade shows and conferences around the world. Specialties:Big Data, Cloud Computing, Connectivity, Business Process Management, Business Event Processing, WebSphere, Business Activity Monitoring, Web Application Servers, Java, SOA, Enterprise Java, Unified Communications and Collaboration, Enterprise Mobility Summary Delivering top-notch service through high productivity and collaboration is my specialty and I thrive in a diverse and fast-paced environment. I specialize in pragmatic marketing as well as agile development processes. Throughout my career I have accrued a multitude of skills including client/partner relations, product marketing, sales enablement, and management. I have demonstrated a tremendous ability to support and maintain numerous business objectives. I work diligently to provide excellence in all my professional endeavors and have earned a reputation for my integrity, initiative, and results-driven work ethic - and have been called a luminary in software markets. In my most recent role, I led Big Data and Cloud Product Strategy & Marketing for Progress DataDirect. Before that, I was responsible for Business Process Management solutions both at Progress and IBM. Prior to Progress, I spent many years at IBM where I held a number of technical and management positions and was instrumental in leading and product managing IBM’s WebSphere – from its inception to an expanding and very successful portfolio of products. I moved into leading-edge technologies in Web services, followed by architecture and open source. From there, I transitioned into the mobile & wireless world, which became a natural progression into mobile communications. With a passion for WebSphere, I moved back into a leadership role in BPM and SOA products performing end-to-end market management -- including enablement, working across functional teams, focusing on communications, product marketing, content creation and briefings for customers, partners, analysts, prospects, and Sales. Throughout my career, I have conducted hundreds of press briefings, trade publication interviews, and technical workshops. I have given hundreds of technical presentations & keynotes to customers, partners, executive teams, and analysts – participating in dozens of trade shows and conferences around the world. Specialties:Big Data, Cloud Computing, Connectivity, Business Process Management, Business Event Processing, WebSphere, Business Activity Monitoring, Web Application Servers, Java, SOA, Enterprise Java, Unified Communications and Collaboration, Enterprise Mobility Delivering top-notch service through high productivity and collaboration is my specialty and I thrive in a diverse and fast-paced environment. I specialize in pragmatic marketing as well as agile development processes. Throughout my career I have accrued a multitude of skills including client/partner relations, product marketing, sales enablement, and management. I have demonstrated a tremendous ability to support and maintain numerous business objectives. I work diligently to provide excellence in all my professional endeavors and have earned a reputation for my integrity, initiative, and results-driven work ethic - and have been called a luminary in software markets. In my most recent role, I led Big Data and Cloud Product Strategy & Marketing for Progress DataDirect. Before that, I was responsible for Business Process Management solutions both at Progress and IBM. Prior to Progress, I spent many years at IBM where I held a number of technical and management positions and was instrumental in leading and product managing IBM’s WebSphere – from its inception to an expanding and very successful portfolio of products. I moved into leading-edge technologies in Web services, followed by architecture and open source. From there, I transitioned into the mobile & wireless world, which became a natural progression into mobile communications. With a passion for WebSphere, I moved back into a leadership role in BPM and SOA products performing end-to-end market management -- including enablement, working across functional teams, focusing on communications, product marketing, content creation and briefings for customers, partners, analysts, prospects, and Sales. Throughout my career, I have conducted hundreds of press briefings, trade publication interviews, and technical workshops. I have given hundreds of technical presentations & keynotes to customers, partners, executive teams, and analysts – participating in dozens of trade shows and conferences around the world. Specialties:Big Data, Cloud Computing, Connectivity, Business Process Management, Business Event Processing, WebSphere, Business Activity Monitoring, Web Application Servers, Java, SOA, Enterprise Java, Unified Communications and Collaboration, Enterprise Mobility Delivering top-notch service through high productivity and collaboration is my specialty and I thrive in a diverse and fast-paced environment. I specialize in pragmatic marketing as well as agile development processes. Throughout my career I have accrued a multitude of skills including client/partner relations, product marketing, sales enablement, and management. I have demonstrated a tremendous ability to support and maintain numerous business objectives. I work diligently to provide excellence in all my professional endeavors and have earned a reputation for my integrity, initiative, and results-driven work ethic - and have been called a luminary in software markets. In my most recent role, I led Big Data and Cloud Product Strategy & Marketing for Progress DataDirect. Before that, I was responsible for Business Process Management solutions both at Progress and IBM. Prior to Progress, I spent many years at IBM where I held a number of technical and management positions and was instrumental in leading and product managing IBM’s WebSphere – from its inception to an expanding and very successful portfolio of products. I moved into leading-edge technologies in Web services, followed by architecture and open source. From there, I transitioned into the mobile & wireless world, which became a natural progression into mobile communications. With a passion for WebSphere, I moved back into a leadership role in BPM and SOA products performing end-to-end market management -- including enablement, working across functional teams, focusing on communications, product marketing, content creation and briefings for customers, partners, analysts, prospects, and Sales. Throughout my career, I have conducted hundreds of press briefings, trade publication interviews, and technical workshops. I have given hundreds of technical presentations & keynotes to customers, partners, executive teams, and analysts – participating in dozens of trade shows and conferences around the world. Specialties:Big Data, Cloud Computing, Connectivity, Business Process Management, Business Event Processing, WebSphere, Business Activity Monitoring, Web Application Servers, Java, SOA, Enterprise Java, Unified Communications and Collaboration, Enterprise Mobility Experience Product Marketing Manager, CounselLink LexisNexis August 2015  – Present (1 month) Raleigh, North Carolina All aspects of pragmatic and product marketing for LexisNexis CounselLink - Business of Law software. Data Connectivity & Integration Marketing Progress Software May 2012  – Present (3 years 4 months) Morrisville, NC Solutions marketing for Progress DataDirect Connect products related to Cloud and Big Data. Sr. Solutions Marketing Manager, Business Process Platforms Progress Software November 2011  –  April 2012  (6 months) Apex, NC Responsible for product/solutions marketing, strategy, business development, and enablement for Progress/Savvion Business Process Management-based solutions. Sr. Product Marketing Manager, IBM Business Process Management & SOA IBM July 2008  –  November 2011  (3 years 5 months) Raleigh-Durham, North Carolina Area Market management for the IBM WebSphere Business Process Management portfolio, including analyst relations and acquisitions. •\tEnd-to-end Sales and Marketing management for the IBM WebSphere BPM portfolio (BPM, BEP Monitor, Events) and SOA products (ESB, MQ, Message Broker, SOA Connectivity), including Sales training & enablement activities and deliverables. This position included working across divisions and functional teams, focusing on communications, technical marketing, and content creation and briefings for customers, business partners, analysts, prospects, business and technical teams, and internal Sales. Product and market management of IBM Business Process Manager for System z and distributed platforms, IBM Business Monitor, and related products building on knowledge of WebSphere Application Server, the BPM market space, and business and technical experiences. Sr Product Manager, IBM Unified Communications and Collaboration IBM March 2007  –  June 2008  (1 year 4 months) Product management for the Lotus product portfolio as an integral element of the IBM Unified Communications and Collaboration strategy. Unified Communications products included integrated social networking tools and mobile and wireless apps built on enterprise mobility platforms such as Java Micro Edition – working across key industries such as Insurance, Banking, Telecommunications, and Healthcare. Sr Product Management, Mobile & Wireless Software IBM January 2005  –  December 2006  (2 years) Product management for Lotus Mobile and Wireless products in support of smartphones and partnerships with Nokia, Sony-Ericsson, and Symbian. Product management for WebSphere Everyplace, with emphasis on client and device strategy. Sr. Product Manager, IBM WebSphere IBM 1995  –  2005  (10 years) Lead (and original) Product Manager for the IBM WebSphere Application Server product and overall technical consultant for Internet software, Web technologies, and enterprise Java. Also, the IBM spokesperson for the WebSphere product line and enterprise Java. Consultant & Program Manager, Software Componentization & Technical Strategy IBM January 2003  –  December 2004  (2 years) Managed internal IBM open source development, education programs, external technical communications all related to IBM's On Demand strategy with shared, common components Manager & Program Director, IBM Emerging Technologies & SOA Web Services IBM January 2002  –  December 2004  (3 years) This was a people management role, with 15 people (mainly market managers) in my department. Market management for emerging technologies across IBM Software Group including Web services, autonomic computing, grid computing, enterprise Java, and pervasive computing. This position included (besides people management) external technical communications for customers, prospects, and business partners related to cross-brand Web services, technologies, and implementations. Vice President Technology Events January 1995  –  December 2002  (8 years) Trade show planning and management. Product Management, IBM WebSphere IBM January 1998  –  December 2001  (4 years) Lead (and original) Product Manager for the IBM WebSphere Application Server product and overall technical consultant for Internet software, web technologies, and enterprise Java. Also, the IBM spokesperson for the WebSphere product line and enterprise Java. Product Architect, Internet Advanced Technologies IBM January 1996  –  December 1997  (2 years) Technical e-business product positioning, programming, and network computing architectural guidance and documentation. Chief architect for the e-business software portfolio and the Network Computing Framework programming model. Product Planner, Internet & TCP/IP Software IBM January 1988  –  December 1995  (8 years) Internet Connection and TCP/IP product demos, strategy, and product presentations, participation in customer conferences, user groups, and trade shows, technical and market planning for several TCP/IP and Internet products, Web page development, market support plans, technical competitive evaluations, product strategies. Software Engineer, IBM Systems Center & VM Development IBM June 1981  –  December 1987  (6 years 7 months) System programming, Systems Center internship, project lead and management for VM CP Development, VM device support design and programming, data compaction/compression design and programming, customer support. Software Engineer Locus, Inc. May 1980  –  August 1980  (4 months) Missile guidance applications programming through contract with the Naval Research Laboratory in Washington, DC Product Marketing Manager, CounselLink LexisNexis August 2015  – Present (1 month) Raleigh, North Carolina All aspects of pragmatic and product marketing for LexisNexis CounselLink - Business of Law software. Product Marketing Manager, CounselLink LexisNexis August 2015  – Present (1 month) Raleigh, North Carolina All aspects of pragmatic and product marketing for LexisNexis CounselLink - Business of Law software. Data Connectivity & Integration Marketing Progress Software May 2012  – Present (3 years 4 months) Morrisville, NC Solutions marketing for Progress DataDirect Connect products related to Cloud and Big Data. Data Connectivity & Integration Marketing Progress Software May 2012  – Present (3 years 4 months) Morrisville, NC Solutions marketing for Progress DataDirect Connect products related to Cloud and Big Data. Sr. Solutions Marketing Manager, Business Process Platforms Progress Software November 2011  –  April 2012  (6 months) Apex, NC Responsible for product/solutions marketing, strategy, business development, and enablement for Progress/Savvion Business Process Management-based solutions. Sr. Solutions Marketing Manager, Business Process Platforms Progress Software November 2011  –  April 2012  (6 months) Apex, NC Responsible for product/solutions marketing, strategy, business development, and enablement for Progress/Savvion Business Process Management-based solutions. Sr. Product Marketing Manager, IBM Business Process Management & SOA IBM July 2008  –  November 2011  (3 years 5 months) Raleigh-Durham, North Carolina Area Market management for the IBM WebSphere Business Process Management portfolio, including analyst relations and acquisitions. •\tEnd-to-end Sales and Marketing management for the IBM WebSphere BPM portfolio (BPM, BEP Monitor, Events) and SOA products (ESB, MQ, Message Broker, SOA Connectivity), including Sales training & enablement activities and deliverables. This position included working across divisions and functional teams, focusing on communications, technical marketing, and content creation and briefings for customers, business partners, analysts, prospects, business and technical teams, and internal Sales. Product and market management of IBM Business Process Manager for System z and distributed platforms, IBM Business Monitor, and related products building on knowledge of WebSphere Application Server, the BPM market space, and business and technical experiences. Sr. Product Marketing Manager, IBM Business Process Management & SOA IBM July 2008  –  November 2011  (3 years 5 months) Raleigh-Durham, North Carolina Area Market management for the IBM WebSphere Business Process Management portfolio, including analyst relations and acquisitions. •\tEnd-to-end Sales and Marketing management for the IBM WebSphere BPM portfolio (BPM, BEP Monitor, Events) and SOA products (ESB, MQ, Message Broker, SOA Connectivity), including Sales training & enablement activities and deliverables. This position included working across divisions and functional teams, focusing on communications, technical marketing, and content creation and briefings for customers, business partners, analysts, prospects, business and technical teams, and internal Sales. Product and market management of IBM Business Process Manager for System z and distributed platforms, IBM Business Monitor, and related products building on knowledge of WebSphere Application Server, the BPM market space, and business and technical experiences. Sr Product Manager, IBM Unified Communications and Collaboration IBM March 2007  –  June 2008  (1 year 4 months) Product management for the Lotus product portfolio as an integral element of the IBM Unified Communications and Collaboration strategy. Unified Communications products included integrated social networking tools and mobile and wireless apps built on enterprise mobility platforms such as Java Micro Edition – working across key industries such as Insurance, Banking, Telecommunications, and Healthcare. Sr Product Manager, IBM Unified Communications and Collaboration IBM March 2007  –  June 2008  (1 year 4 months) Product management for the Lotus product portfolio as an integral element of the IBM Unified Communications and Collaboration strategy. Unified Communications products included integrated social networking tools and mobile and wireless apps built on enterprise mobility platforms such as Java Micro Edition – working across key industries such as Insurance, Banking, Telecommunications, and Healthcare. Sr Product Management, Mobile & Wireless Software IBM January 2005  –  December 2006  (2 years) Product management for Lotus Mobile and Wireless products in support of smartphones and partnerships with Nokia, Sony-Ericsson, and Symbian. Product management for WebSphere Everyplace, with emphasis on client and device strategy. Sr Product Management, Mobile & Wireless Software IBM January 2005  –  December 2006  (2 years) Product management for Lotus Mobile and Wireless products in support of smartphones and partnerships with Nokia, Sony-Ericsson, and Symbian. Product management for WebSphere Everyplace, with emphasis on client and device strategy. Sr. Product Manager, IBM WebSphere IBM 1995  –  2005  (10 years) Lead (and original) Product Manager for the IBM WebSphere Application Server product and overall technical consultant for Internet software, Web technologies, and enterprise Java. Also, the IBM spokesperson for the WebSphere product line and enterprise Java. Sr. Product Manager, IBM WebSphere IBM 1995  –  2005  (10 years) Lead (and original) Product Manager for the IBM WebSphere Application Server product and overall technical consultant for Internet software, Web technologies, and enterprise Java. Also, the IBM spokesperson for the WebSphere product line and enterprise Java. Consultant & Program Manager, Software Componentization & Technical Strategy IBM January 2003  –  December 2004  (2 years) Managed internal IBM open source development, education programs, external technical communications all related to IBM's On Demand strategy with shared, common components Consultant & Program Manager, Software Componentization & Technical Strategy IBM January 2003  –  December 2004  (2 years) Managed internal IBM open source development, education programs, external technical communications all related to IBM's On Demand strategy with shared, common components Manager & Program Director, IBM Emerging Technologies & SOA Web Services IBM January 2002  –  December 2004  (3 years) This was a people management role, with 15 people (mainly market managers) in my department. Market management for emerging technologies across IBM Software Group including Web services, autonomic computing, grid computing, enterprise Java, and pervasive computing. This position included (besides people management) external technical communications for customers, prospects, and business partners related to cross-brand Web services, technologies, and implementations. Manager & Program Director, IBM Emerging Technologies & SOA Web Services IBM January 2002  –  December 2004  (3 years) This was a people management role, with 15 people (mainly market managers) in my department. Market management for emerging technologies across IBM Software Group including Web services, autonomic computing, grid computing, enterprise Java, and pervasive computing. This position included (besides people management) external technical communications for customers, prospects, and business partners related to cross-brand Web services, technologies, and implementations. Vice President Technology Events January 1995  –  December 2002  (8 years) Trade show planning and management. Vice President Technology Events January 1995  –  December 2002  (8 years) Trade show planning and management. Product Management, IBM WebSphere IBM January 1998  –  December 2001  (4 years) Lead (and original) Product Manager for the IBM WebSphere Application Server product and overall technical consultant for Internet software, web technologies, and enterprise Java. Also, the IBM spokesperson for the WebSphere product line and enterprise Java. Product Management, IBM WebSphere IBM January 1998  –  December 2001  (4 years) Lead (and original) Product Manager for the IBM WebSphere Application Server product and overall technical consultant for Internet software, web technologies, and enterprise Java. Also, the IBM spokesperson for the WebSphere product line and enterprise Java. Product Architect, Internet Advanced Technologies IBM January 1996  –  December 1997  (2 years) Technical e-business product positioning, programming, and network computing architectural guidance and documentation. Chief architect for the e-business software portfolio and the Network Computing Framework programming model. Product Architect, Internet Advanced Technologies IBM January 1996  –  December 1997  (2 years) Technical e-business product positioning, programming, and network computing architectural guidance and documentation. Chief architect for the e-business software portfolio and the Network Computing Framework programming model. Product Planner, Internet & TCP/IP Software IBM January 1988  –  December 1995  (8 years) Internet Connection and TCP/IP product demos, strategy, and product presentations, participation in customer conferences, user groups, and trade shows, technical and market planning for several TCP/IP and Internet products, Web page development, market support plans, technical competitive evaluations, product strategies. Product Planner, Internet & TCP/IP Software IBM January 1988  –  December 1995  (8 years) Internet Connection and TCP/IP product demos, strategy, and product presentations, participation in customer conferences, user groups, and trade shows, technical and market planning for several TCP/IP and Internet products, Web page development, market support plans, technical competitive evaluations, product strategies. Software Engineer, IBM Systems Center & VM Development IBM June 1981  –  December 1987  (6 years 7 months) System programming, Systems Center internship, project lead and management for VM CP Development, VM device support design and programming, data compaction/compression design and programming, customer support. Software Engineer, IBM Systems Center & VM Development IBM June 1981  –  December 1987  (6 years 7 months) System programming, Systems Center internship, project lead and management for VM CP Development, VM device support design and programming, data compaction/compression design and programming, customer support. Software Engineer Locus, Inc. May 1980  –  August 1980  (4 months) Missile guidance applications programming through contract with the Naval Research Laboratory in Washington, DC Software Engineer Locus, Inc. May 1980  –  August 1980  (4 months) Missile guidance applications programming through contract with the Naval Research Laboratory in Washington, DC Skills SOA Application Servers Websphere J2EE BAM Java Enterprise Mobility Sales Enablement ESB Product Marketing Product Management Mobile Cloud Computing Middleware Enterprise Software SaaS EAI Product Strategy Integration Pre-sales Enterprise Architecture Analytics Solution Selling Agile Requirements Analysis Web Services Salesforce.com Solution Architecture Team Leadership Program Management Business Analysis Alliances Channel Architecture Business Intelligence Business Process Software Project... Web Applications Application Architecture Technical Leadership IT Strategy Agile Project Management Go-to-market Strategy Mobile Applications Project Portfolio... Software Product... Business Process... Big Data Connectivity Java Enterprise Edition See 35+     See less Skills  SOA Application Servers Websphere J2EE BAM Java Enterprise Mobility Sales Enablement ESB Product Marketing Product Management Mobile Cloud Computing Middleware Enterprise Software SaaS EAI Product Strategy Integration Pre-sales Enterprise Architecture Analytics Solution Selling Agile Requirements Analysis Web Services Salesforce.com Solution Architecture Team Leadership Program Management Business Analysis Alliances Channel Architecture Business Intelligence Business Process Software Project... Web Applications Application Architecture Technical Leadership IT Strategy Agile Project Management Go-to-market Strategy Mobile Applications Project Portfolio... Software Product... Business Process... Big Data Connectivity Java Enterprise Edition See 35+     See less SOA Application Servers Websphere J2EE BAM Java Enterprise Mobility Sales Enablement ESB Product Marketing Product Management Mobile Cloud Computing Middleware Enterprise Software SaaS EAI Product Strategy Integration Pre-sales Enterprise Architecture Analytics Solution Selling Agile Requirements Analysis Web Services Salesforce.com Solution Architecture Team Leadership Program Management Business Analysis Alliances Channel Architecture Business Intelligence Business Process Software Project... Web Applications Application Architecture Technical Leadership IT Strategy Agile Project Management Go-to-market Strategy Mobile Applications Project Portfolio... Software Product... Business Process... Big Data Connectivity Java Enterprise Edition See 35+     See less SOA Application Servers Websphere J2EE BAM Java Enterprise Mobility Sales Enablement ESB Product Marketing Product Management Mobile Cloud Computing Middleware Enterprise Software SaaS EAI Product Strategy Integration Pre-sales Enterprise Architecture Analytics Solution Selling Agile Requirements Analysis Web Services Salesforce.com Solution Architecture Team Leadership Program Management Business Analysis Alliances Channel Architecture Business Intelligence Business Process Software Project... Web Applications Application Architecture Technical Leadership IT Strategy Agile Project Management Go-to-market Strategy Mobile Applications Project Portfolio... Software Product... Business Process... Big Data Connectivity Java Enterprise Edition See 35+     See less Education Pennsylvania State University B.S.,  Astronomy and Computer Science 1977  – 1981 - With a focus on astrophysics, I spent many nights either at the lab/observatory or at the computer lab (yes, back then we even had a computer lab on campus). \n- Played lots of handball, racquetball, and did some skiing. Activities and Societies:  Handball ,  Soccer ,  Outdoor Club Pennsylvania State University B.S.,  Astronomy and Computer Science 1977  – 1981 - With a focus on astrophysics, I spent many nights either at the lab/observatory or at the computer lab (yes, back then we even had a computer lab on campus). \n- Played lots of handball, racquetball, and did some skiing. Activities and Societies:  Handball ,  Soccer ,  Outdoor Club Pennsylvania State University B.S.,  Astronomy and Computer Science 1977  – 1981 - With a focus on astrophysics, I spent many nights either at the lab/observatory or at the computer lab (yes, back then we even had a computer lab on campus). \n- Played lots of handball, racquetball, and did some skiing. Activities and Societies:  Handball ,  Soccer ,  Outdoor Club Pennsylvania State University B.S.,  Astronomy and Computer Science 1977  – 1981 - With a focus on astrophysics, I spent many nights either at the lab/observatory or at the computer lab (yes, back then we even had a computer lab on campus). \n- Played lots of handball, racquetball, and did some skiing. Activities and Societies:  Handball ,  Soccer ,  Outdoor Club Honors & Awards ", "Languages German Limited working proficiency Hebrew Elementary proficiency German Limited working proficiency Hebrew Elementary proficiency German Limited working proficiency Hebrew Elementary proficiency Limited working proficiency Elementary proficiency Skills Business Alliances Program Management New Business Development IP Electrical Engineering Licensing Negotiations Contract Negotiation Software Project... SaaS IT Strategy Integration Business Analysis Leadership Product Development Strategy Cloud Computing Cross-functional Team... Enterprise Software Go-to-market Strategy See 4+     See less Skills  Business Alliances Program Management New Business Development IP Electrical Engineering Licensing Negotiations Contract Negotiation Software Project... SaaS IT Strategy Integration Business Analysis Leadership Product Development Strategy Cloud Computing Cross-functional Team... Enterprise Software Go-to-market Strategy See 4+     See less Business Alliances Program Management New Business Development IP Electrical Engineering Licensing Negotiations Contract Negotiation Software Project... SaaS IT Strategy Integration Business Analysis Leadership Product Development Strategy Cloud Computing Cross-functional Team... Enterprise Software Go-to-market Strategy See 4+     See less Business Alliances Program Management New Business Development IP Electrical Engineering Licensing Negotiations Contract Negotiation Software Project... SaaS IT Strategy Integration Business Analysis Leadership Product Development Strategy Cloud Computing Cross-functional Team... Enterprise Software Go-to-market Strategy See 4+     See less Honors & Awards IBM Corporate Awards IBM •\t4 100% Club Awards for exceeding sales targets \n•\t2 Outstanding Technical Achievement Awards \n•\t1 Management Excellence Award \n•\t4 Division Awards for exceeding Revenue, Expense, and Customer Sat goals \n•\t8 Informal Awards for various accomplishments \n•\tMultiple stock option awards \n IBM Corporate Awards IBM •\t4 100% Club Awards for exceeding sales targets \n•\t2 Outstanding Technical Achievement Awards \n•\t1 Management Excellence Award \n•\t4 Division Awards for exceeding Revenue, Expense, and Customer Sat goals \n•\t8 Informal Awards for various accomplishments \n•\tMultiple stock option awards \n IBM Corporate Awards IBM •\t4 100% Club Awards for exceeding sales targets \n•\t2 Outstanding Technical Achievement Awards \n•\t1 Management Excellence Award \n•\t4 Division Awards for exceeding Revenue, Expense, and Customer Sat goals \n•\t8 Informal Awards for various accomplishments \n•\tMultiple stock option awards \n IBM Corporate Awards IBM •\t4 100% Club Awards for exceeding sales targets \n•\t2 Outstanding Technical Achievement Awards \n•\t1 Management Excellence Award \n•\t4 Division Awards for exceeding Revenue, Expense, and Customer Sat goals \n•\t8 Informal Awards for various accomplishments \n•\tMultiple stock option awards \n ", "Languages English Full professional proficiency German Native or bilingual proficiency Russian Elementary proficiency English Full professional proficiency German Native or bilingual proficiency Russian Elementary proficiency English Full professional proficiency German Native or bilingual proficiency Russian Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Skills     ", "Skills Enterprise Architecture Java Enterprise Edition BRMS Business Rules Software Development Cloud Computing Product Management Enterprise Software Pre-sales Eclipse SaaS ILOG Management Websphere Solution Selling Skills  Enterprise Architecture Java Enterprise Edition BRMS Business Rules Software Development Cloud Computing Product Management Enterprise Software Pre-sales Eclipse SaaS ILOG Management Websphere Solution Selling Enterprise Architecture Java Enterprise Edition BRMS Business Rules Software Development Cloud Computing Product Management Enterprise Software Pre-sales Eclipse SaaS ILOG Management Websphere Solution Selling Enterprise Architecture Java Enterprise Edition BRMS Business Rules Software Development Cloud Computing Product Management Enterprise Software Pre-sales Eclipse SaaS ILOG Management Websphere Solution Selling ", "Skills Consolidation Cognos EPM Dashboard Data Warehousing Business Intelligence... ERP Business Analytics Hyperion Enterprise OLAP TM1 Business Intelligence Business Process Pre-sales Business Objects Analytics Business Process... Business Analysis Data Integration ETL Master Data Management Software Project... Professional Services Enterprise Software Enterprise Architecture Data Modeling IT Strategy Management See 13+     See less Skills  Consolidation Cognos EPM Dashboard Data Warehousing Business Intelligence... ERP Business Analytics Hyperion Enterprise OLAP TM1 Business Intelligence Business Process Pre-sales Business Objects Analytics Business Process... Business Analysis Data Integration ETL Master Data Management Software Project... Professional Services Enterprise Software Enterprise Architecture Data Modeling IT Strategy Management See 13+     See less Consolidation Cognos EPM Dashboard Data Warehousing Business Intelligence... ERP Business Analytics Hyperion Enterprise OLAP TM1 Business Intelligence Business Process Pre-sales Business Objects Analytics Business Process... Business Analysis Data Integration ETL Master Data Management Software Project... Professional Services Enterprise Software Enterprise Architecture Data Modeling IT Strategy Management See 13+     See less Consolidation Cognos EPM Dashboard Data Warehousing Business Intelligence... ERP Business Analytics Hyperion Enterprise OLAP TM1 Business Intelligence Business Process Pre-sales Business Objects Analytics Business Process... Business Analysis Data Integration ETL Master Data Management Software Project... Professional Services Enterprise Software Enterprise Architecture Data Modeling IT Strategy Management See 13+     See less ", "Experience Senior Product Manager IBM September 2012  – Present (3 years) Product Management Integration Lead for the integration of IBM Trusteer. For Trusteer, I am responsible for all aspects of both product integration and acquisition into IBM, of their SaaS Web Fraud and Advanced Malware solutions. Previously, I've also been responsible for IBM Docs and IBM Docs mobile web-based social productivity products, and IBM Lotus Protector collaboration security products. Product Manager IBM January 2010  –  September 2012  (2 years 9 months) Product Manager for IBM Lotus Protector security products including; Lotus Protector for Mail Security and Lotus Protector for Mail Encryption. \nProduct Manager for IBM Docs Technical Product Manager IBM Internet Security Systems August 2007  –  January 2010  (2 years 6 months) Technical Product Manager for Data and Content Security Business Line comprising; Proventia Network Mail Security System, Lotus Protector for Mail Security, Proventia Web Filter and Proventia Mail Filter. IT Specialist IBM Global Services February 2005  –  August 2007  (2 years 7 months) Managed all Financial, RESO and IT related aspects of acquisition of US office by IBM. e-Sourcing and e-Contracting - Transformation and Transition Manager. SAP ABAP Project Manager for ESS and MSS outsourcing. IT Manager KeyMRO January 2002  –  February 2005  (3 years 2 months) Day-to-day ownership of all IT projects and assignments for US office of multinational sourcing company. Oversaw Exchange hosted messaging infrastructure, VoIP voice and video systems and all network security aspects. Managed e-sourcing environment, data, voice and wireless services contracts and all software licensing. Senior Product Manager IBM September 2012  – Present (3 years) Product Management Integration Lead for the integration of IBM Trusteer. For Trusteer, I am responsible for all aspects of both product integration and acquisition into IBM, of their SaaS Web Fraud and Advanced Malware solutions. Previously, I've also been responsible for IBM Docs and IBM Docs mobile web-based social productivity products, and IBM Lotus Protector collaboration security products. Senior Product Manager IBM September 2012  – Present (3 years) Product Management Integration Lead for the integration of IBM Trusteer. For Trusteer, I am responsible for all aspects of both product integration and acquisition into IBM, of their SaaS Web Fraud and Advanced Malware solutions. Previously, I've also been responsible for IBM Docs and IBM Docs mobile web-based social productivity products, and IBM Lotus Protector collaboration security products. Product Manager IBM January 2010  –  September 2012  (2 years 9 months) Product Manager for IBM Lotus Protector security products including; Lotus Protector for Mail Security and Lotus Protector for Mail Encryption. \nProduct Manager for IBM Docs Product Manager IBM January 2010  –  September 2012  (2 years 9 months) Product Manager for IBM Lotus Protector security products including; Lotus Protector for Mail Security and Lotus Protector for Mail Encryption. \nProduct Manager for IBM Docs Technical Product Manager IBM Internet Security Systems August 2007  –  January 2010  (2 years 6 months) Technical Product Manager for Data and Content Security Business Line comprising; Proventia Network Mail Security System, Lotus Protector for Mail Security, Proventia Web Filter and Proventia Mail Filter. Technical Product Manager IBM Internet Security Systems August 2007  –  January 2010  (2 years 6 months) Technical Product Manager for Data and Content Security Business Line comprising; Proventia Network Mail Security System, Lotus Protector for Mail Security, Proventia Web Filter and Proventia Mail Filter. IT Specialist IBM Global Services February 2005  –  August 2007  (2 years 7 months) Managed all Financial, RESO and IT related aspects of acquisition of US office by IBM. e-Sourcing and e-Contracting - Transformation and Transition Manager. SAP ABAP Project Manager for ESS and MSS outsourcing. IT Specialist IBM Global Services February 2005  –  August 2007  (2 years 7 months) Managed all Financial, RESO and IT related aspects of acquisition of US office by IBM. e-Sourcing and e-Contracting - Transformation and Transition Manager. SAP ABAP Project Manager for ESS and MSS outsourcing. IT Manager KeyMRO January 2002  –  February 2005  (3 years 2 months) Day-to-day ownership of all IT projects and assignments for US office of multinational sourcing company. Oversaw Exchange hosted messaging infrastructure, VoIP voice and video systems and all network security aspects. Managed e-sourcing environment, data, voice and wireless services contracts and all software licensing. IT Manager KeyMRO January 2002  –  February 2005  (3 years 2 months) Day-to-day ownership of all IT projects and assignments for US office of multinational sourcing company. Oversaw Exchange hosted messaging infrastructure, VoIP voice and video systems and all network security aspects. Managed e-sourcing environment, data, voice and wireless services contracts and all software licensing. Skills Messaging Solution Selling Social Software Security Lotus Notes Lotus Domino Sales Enablement Product Management Cloud Computing Social Marketing Collaboration Lotus iPhone iPad Software Information Security Network Security IPS Outsourcing Collaboration Solutions Microsoft Exchange Enterprise Software Management IBM Docs Office Productivity Social Documents Public Speaking Social Media Marketing VoIP SaaS Data Security Networking Pre-sales Virtualization Go-to-market Strategy Professional Services Identity Management Integration Mobile Devices Software Industry See 25+     See less Skills  Messaging Solution Selling Social Software Security Lotus Notes Lotus Domino Sales Enablement Product Management Cloud Computing Social Marketing Collaboration Lotus iPhone iPad Software Information Security Network Security IPS Outsourcing Collaboration Solutions Microsoft Exchange Enterprise Software Management IBM Docs Office Productivity Social Documents Public Speaking Social Media Marketing VoIP SaaS Data Security Networking Pre-sales Virtualization Go-to-market Strategy Professional Services Identity Management Integration Mobile Devices Software Industry See 25+     See less Messaging Solution Selling Social Software Security Lotus Notes Lotus Domino Sales Enablement Product Management Cloud Computing Social Marketing Collaboration Lotus iPhone iPad Software Information Security Network Security IPS Outsourcing Collaboration Solutions Microsoft Exchange Enterprise Software Management IBM Docs Office Productivity Social Documents Public Speaking Social Media Marketing VoIP SaaS Data Security Networking Pre-sales Virtualization Go-to-market Strategy Professional Services Identity Management Integration Mobile Devices Software Industry See 25+     See less Messaging Solution Selling Social Software Security Lotus Notes Lotus Domino Sales Enablement Product Management Cloud Computing Social Marketing Collaboration Lotus iPhone iPad Software Information Security Network Security IPS Outsourcing Collaboration Solutions Microsoft Exchange Enterprise Software Management IBM Docs Office Productivity Social Documents Public Speaking Social Media Marketing VoIP SaaS Data Security Networking Pre-sales Virtualization Go-to-market Strategy Professional Services Identity Management Integration Mobile Devices Software Industry See 25+     See less Education Michigan State University BA,  Telecommunications 1997  – 2001 Activities and Societies:  James Madison College ,  Apple Club ,  Alpha Sigma Phi Michigan State University BA,  Telecommunications 1997  – 2001 Activities and Societies:  James Madison College ,  Apple Club ,  Alpha Sigma Phi Michigan State University BA,  Telecommunications 1997  – 2001 Activities and Societies:  James Madison College ,  Apple Club ,  Alpha Sigma Phi Michigan State University BA,  Telecommunications 1997  – 2001 Activities and Societies:  James Madison College ,  Apple Club ,  Alpha Sigma Phi ", "Summary I'm a Senior Product Manager for IBM in Austin for the Enterprise Mobile Platform. I lead a team of 20 developers, designers and architects to build world class products in the mobile ecosystem including mobile analytics, storage and mobile backend as a service. I also have a background in systems integration and middleware including enterprise service bus, business process management and application integration. In my 12 years at IBM, I progressed through several roles starting as a software engineer, moving up to IT consulting, pre sales, business partner representative and most recently, product management. \n \nSkills:  \n⇨Product Management \n⇨Product Strategy  \n⇨Design thinking \n⇨Managing cross-geo scrums teams \n⇨Cross functional team leadership Summary I'm a Senior Product Manager for IBM in Austin for the Enterprise Mobile Platform. I lead a team of 20 developers, designers and architects to build world class products in the mobile ecosystem including mobile analytics, storage and mobile backend as a service. I also have a background in systems integration and middleware including enterprise service bus, business process management and application integration. In my 12 years at IBM, I progressed through several roles starting as a software engineer, moving up to IT consulting, pre sales, business partner representative and most recently, product management. \n \nSkills:  \n⇨Product Management \n⇨Product Strategy  \n⇨Design thinking \n⇨Managing cross-geo scrums teams \n⇨Cross functional team leadership I'm a Senior Product Manager for IBM in Austin for the Enterprise Mobile Platform. I lead a team of 20 developers, designers and architects to build world class products in the mobile ecosystem including mobile analytics, storage and mobile backend as a service. I also have a background in systems integration and middleware including enterprise service bus, business process management and application integration. In my 12 years at IBM, I progressed through several roles starting as a software engineer, moving up to IT consulting, pre sales, business partner representative and most recently, product management. \n \nSkills:  \n⇨Product Management \n⇨Product Strategy  \n⇨Design thinking \n⇨Managing cross-geo scrums teams \n⇨Cross functional team leadership I'm a Senior Product Manager for IBM in Austin for the Enterprise Mobile Platform. I lead a team of 20 developers, designers and architects to build world class products in the mobile ecosystem including mobile analytics, storage and mobile backend as a service. I also have a background in systems integration and middleware including enterprise service bus, business process management and application integration. In my 12 years at IBM, I progressed through several roles starting as a software engineer, moving up to IT consulting, pre sales, business partner representative and most recently, product management. \n \nSkills:  \n⇨Product Management \n⇨Product Strategy  \n⇨Design thinking \n⇨Managing cross-geo scrums teams \n⇨Cross functional team leadership Experience MBA Candidate, Class of 2016 | Vice President of Texas Consulting Club McCombs School of Business, The University of Texas at Austin May 2015  – Present (4 months) Austin, Texas Area Senior Product Manager IBM March 2014  – Present (1 year 6 months) Austin, Texas Area ■ Execute the overall product strategy for IBM MobileFirst Analytics and set the vision and define requirements by capitalizing on long-range technology and market trends. \n \n■ Lead a team of 20 product developers, designers and UX experts to deliver web, native and hybrid solutions for MobileFirst Analytics \n \n■ Manage the entire product line lifecycle for IBM MobileFirst Analytics from strategic planning to implementation by working across development and product marketing teams. \n \n■ Create product roadmap for MobileFirst for iOS apps to drive goal of increasing enterprise adoption for iOS devices. \n \n■ Drive excellent mobile user experience across IBM MobileFirst platform using Design Thinking methodologies \n \n■ Perform marketplace analysis in order to prioritize investments in IBM MobileFirst platform. \n \n■ Write detailed market requirement definition documents to articulate business value and define software requirements. MBA+ Consultant Epic Music LA February 2015  –  May 2015  (4 months) Greater Los Angeles Area New business development strategy for a Los Angeles-based production music start-up 'Epic Music' MBA+ Consultant Wells Fargo March 2014  –  May 2014  (3 months) San Francisco Bay Area Executed MBA+ Consulting Project for Wells Fargo Digital Channels group and accomplished the following \n \n■ Identified 5 key digital technologies and trends that’ll disrupt the way customers do their banking (or Wells Fargo will interact with their customers) \n \n■ How these trends will be disruptive to Financial Services \n \n■ How other financial institutions are responding to these disruptions and how Wells Fargo must respond \n \n■ Prepared a detailed business plan for a key trend that will impact the Mortgage Banking Industry Managing Consultant IBM July 2008  –  March 2014  (5 years 9 months) Austin, Texas Area ■ Proven track record in improving process quality and efficiency, cost reduction, and enhancing business insight of numerous Fortune 500 client business processes in several industries such as Insurance, Banking and Healthcare. \n \n■ 5+ Go-Live customer deployments of Business Process Manager (BPM) software at several System Integrators and ISVs globally. Provided thought leadership for BPM project set up, development assistance, crisis management, performance tuning and capacity planning. \n \n■ Influenced hundreds of thousand of dollars in consulting services deal by successfully delivering a ‘Triple Play Order Handling’ solution for a large telecommunications client. \n￼ \n■ Influenced several million dollars in software license revenue and hundreds of thousands of dollars in services by successfully enabling the Go-Live of a Claims Management system for one of the largest insurance companies in US \n \n■ Successful delivery of BPM project for the largest credit scoring company resulting in hundreds of thousands of dollars of cost savings for the client by improving process efficiency and eliminating redundancies. \n \n■ Provided BPM consulting services for a very large US healthcare firm to integrate their patient care management systems. The BPM project reduced administrative costs and delivered care management solutions for members. \n \n■ Maintain very high utilization level, thereby contributing to IBM revenue growth by leading first-of-a-kind proof of concepts, enabling channel sales teams and responding to request for proposals \n \n■ Trusted technical advisor for several Fortune 500 clients and maintain strong business partner relationships demonstrated via outstanding business partner feedback. \n \n■ Increase IBM technology mindshare with business partners by conducting product roadshows, setting up centers of excellence, conducting certification programs and presenting at leading industry conferences (IBM Impact, TeleManagement World Forum) Software Engineer IBM July 2003  –  July 2008  (5 years 1 month) ■ Lead consultant for the merger between the two largest financial institutions in SE Asia to create \na firm to cater to commercial and non-commercial insurance needs of clients. Advised CTO on business process management (BPM) in order to reduce time to market of the combined products and services and improve transparency across the organization. This pre-sales consultancy work resulted in hundreds of thousands of services revenue win for IBM and provided entry to the SE Asian financial markets. \n \n■ Executed several services engagement for the largest Systems Integrators in India including a solution for Direct-to-Home television (DTH) service. Helped define and scope the entire project, developed a consolidated proposal that addressed the client’s requirements for both the infrastructure and integration components of the DTH project. MBA Candidate, Class of 2016 | Vice President of Texas Consulting Club McCombs School of Business, The University of Texas at Austin May 2015  – Present (4 months) Austin, Texas Area MBA Candidate, Class of 2016 | Vice President of Texas Consulting Club McCombs School of Business, The University of Texas at Austin May 2015  – Present (4 months) Austin, Texas Area Senior Product Manager IBM March 2014  – Present (1 year 6 months) Austin, Texas Area ■ Execute the overall product strategy for IBM MobileFirst Analytics and set the vision and define requirements by capitalizing on long-range technology and market trends. \n \n■ Lead a team of 20 product developers, designers and UX experts to deliver web, native and hybrid solutions for MobileFirst Analytics \n \n■ Manage the entire product line lifecycle for IBM MobileFirst Analytics from strategic planning to implementation by working across development and product marketing teams. \n \n■ Create product roadmap for MobileFirst for iOS apps to drive goal of increasing enterprise adoption for iOS devices. \n \n■ Drive excellent mobile user experience across IBM MobileFirst platform using Design Thinking methodologies \n \n■ Perform marketplace analysis in order to prioritize investments in IBM MobileFirst platform. \n \n■ Write detailed market requirement definition documents to articulate business value and define software requirements. Senior Product Manager IBM March 2014  – Present (1 year 6 months) Austin, Texas Area ■ Execute the overall product strategy for IBM MobileFirst Analytics and set the vision and define requirements by capitalizing on long-range technology and market trends. \n \n■ Lead a team of 20 product developers, designers and UX experts to deliver web, native and hybrid solutions for MobileFirst Analytics \n \n■ Manage the entire product line lifecycle for IBM MobileFirst Analytics from strategic planning to implementation by working across development and product marketing teams. \n \n■ Create product roadmap for MobileFirst for iOS apps to drive goal of increasing enterprise adoption for iOS devices. \n \n■ Drive excellent mobile user experience across IBM MobileFirst platform using Design Thinking methodologies \n \n■ Perform marketplace analysis in order to prioritize investments in IBM MobileFirst platform. \n \n■ Write detailed market requirement definition documents to articulate business value and define software requirements. MBA+ Consultant Epic Music LA February 2015  –  May 2015  (4 months) Greater Los Angeles Area New business development strategy for a Los Angeles-based production music start-up 'Epic Music' MBA+ Consultant Epic Music LA February 2015  –  May 2015  (4 months) Greater Los Angeles Area New business development strategy for a Los Angeles-based production music start-up 'Epic Music' MBA+ Consultant Wells Fargo March 2014  –  May 2014  (3 months) San Francisco Bay Area Executed MBA+ Consulting Project for Wells Fargo Digital Channels group and accomplished the following \n \n■ Identified 5 key digital technologies and trends that’ll disrupt the way customers do their banking (or Wells Fargo will interact with their customers) \n \n■ How these trends will be disruptive to Financial Services \n \n■ How other financial institutions are responding to these disruptions and how Wells Fargo must respond \n \n■ Prepared a detailed business plan for a key trend that will impact the Mortgage Banking Industry MBA+ Consultant Wells Fargo March 2014  –  May 2014  (3 months) San Francisco Bay Area Executed MBA+ Consulting Project for Wells Fargo Digital Channels group and accomplished the following \n \n■ Identified 5 key digital technologies and trends that’ll disrupt the way customers do their banking (or Wells Fargo will interact with their customers) \n \n■ How these trends will be disruptive to Financial Services \n \n■ How other financial institutions are responding to these disruptions and how Wells Fargo must respond \n \n■ Prepared a detailed business plan for a key trend that will impact the Mortgage Banking Industry Managing Consultant IBM July 2008  –  March 2014  (5 years 9 months) Austin, Texas Area ■ Proven track record in improving process quality and efficiency, cost reduction, and enhancing business insight of numerous Fortune 500 client business processes in several industries such as Insurance, Banking and Healthcare. \n \n■ 5+ Go-Live customer deployments of Business Process Manager (BPM) software at several System Integrators and ISVs globally. Provided thought leadership for BPM project set up, development assistance, crisis management, performance tuning and capacity planning. \n \n■ Influenced hundreds of thousand of dollars in consulting services deal by successfully delivering a ‘Triple Play Order Handling’ solution for a large telecommunications client. \n￼ \n■ Influenced several million dollars in software license revenue and hundreds of thousands of dollars in services by successfully enabling the Go-Live of a Claims Management system for one of the largest insurance companies in US \n \n■ Successful delivery of BPM project for the largest credit scoring company resulting in hundreds of thousands of dollars of cost savings for the client by improving process efficiency and eliminating redundancies. \n \n■ Provided BPM consulting services for a very large US healthcare firm to integrate their patient care management systems. The BPM project reduced administrative costs and delivered care management solutions for members. \n \n■ Maintain very high utilization level, thereby contributing to IBM revenue growth by leading first-of-a-kind proof of concepts, enabling channel sales teams and responding to request for proposals \n \n■ Trusted technical advisor for several Fortune 500 clients and maintain strong business partner relationships demonstrated via outstanding business partner feedback. \n \n■ Increase IBM technology mindshare with business partners by conducting product roadshows, setting up centers of excellence, conducting certification programs and presenting at leading industry conferences (IBM Impact, TeleManagement World Forum) Managing Consultant IBM July 2008  –  March 2014  (5 years 9 months) Austin, Texas Area ■ Proven track record in improving process quality and efficiency, cost reduction, and enhancing business insight of numerous Fortune 500 client business processes in several industries such as Insurance, Banking and Healthcare. \n \n■ 5+ Go-Live customer deployments of Business Process Manager (BPM) software at several System Integrators and ISVs globally. Provided thought leadership for BPM project set up, development assistance, crisis management, performance tuning and capacity planning. \n \n■ Influenced hundreds of thousand of dollars in consulting services deal by successfully delivering a ‘Triple Play Order Handling’ solution for a large telecommunications client. \n￼ \n■ Influenced several million dollars in software license revenue and hundreds of thousands of dollars in services by successfully enabling the Go-Live of a Claims Management system for one of the largest insurance companies in US \n \n■ Successful delivery of BPM project for the largest credit scoring company resulting in hundreds of thousands of dollars of cost savings for the client by improving process efficiency and eliminating redundancies. \n \n■ Provided BPM consulting services for a very large US healthcare firm to integrate their patient care management systems. The BPM project reduced administrative costs and delivered care management solutions for members. \n \n■ Maintain very high utilization level, thereby contributing to IBM revenue growth by leading first-of-a-kind proof of concepts, enabling channel sales teams and responding to request for proposals \n \n■ Trusted technical advisor for several Fortune 500 clients and maintain strong business partner relationships demonstrated via outstanding business partner feedback. \n \n■ Increase IBM technology mindshare with business partners by conducting product roadshows, setting up centers of excellence, conducting certification programs and presenting at leading industry conferences (IBM Impact, TeleManagement World Forum) Software Engineer IBM July 2003  –  July 2008  (5 years 1 month) ■ Lead consultant for the merger between the two largest financial institutions in SE Asia to create \na firm to cater to commercial and non-commercial insurance needs of clients. Advised CTO on business process management (BPM) in order to reduce time to market of the combined products and services and improve transparency across the organization. This pre-sales consultancy work resulted in hundreds of thousands of services revenue win for IBM and provided entry to the SE Asian financial markets. \n \n■ Executed several services engagement for the largest Systems Integrators in India including a solution for Direct-to-Home television (DTH) service. Helped define and scope the entire project, developed a consolidated proposal that addressed the client’s requirements for both the infrastructure and integration components of the DTH project. Software Engineer IBM July 2003  –  July 2008  (5 years 1 month) ■ Lead consultant for the merger between the two largest financial institutions in SE Asia to create \na firm to cater to commercial and non-commercial insurance needs of clients. Advised CTO on business process management (BPM) in order to reduce time to market of the combined products and services and improve transparency across the organization. This pre-sales consultancy work resulted in hundreds of thousands of services revenue win for IBM and provided entry to the SE Asian financial markets. \n \n■ Executed several services engagement for the largest Systems Integrators in India including a solution for Direct-to-Home television (DTH) service. Helped define and scope the entire project, developed a consolidated proposal that addressed the client’s requirements for both the infrastructure and integration components of the DTH project. Languages English Native or bilingual proficiency Tamil Native or bilingual proficiency Hindi Professional working proficiency English Native or bilingual proficiency Tamil Native or bilingual proficiency Hindi Professional working proficiency English Native or bilingual proficiency Tamil Native or bilingual proficiency Hindi Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Enterprise Architecture WebSphere Process Server WebSphere Application... WebSphere Integration... Business Process Design Business Process... Integration WebSphere MQ Software Development WebSphere ESB Integration Architecture Customer Engagement Software Design WebSphere Business... Software Solution... Conflict Resolution Business Process... Business Process... Business Process... Software Engineering Product Management Product Design Project Management Leading Development... Software Architectural... Product Marketing Leadership Java Enterprise Edition See 13+     See less Skills  Enterprise Architecture WebSphere Process Server WebSphere Application... WebSphere Integration... Business Process Design Business Process... Integration WebSphere MQ Software Development WebSphere ESB Integration Architecture Customer Engagement Software Design WebSphere Business... Software Solution... Conflict Resolution Business Process... Business Process... Business Process... Software Engineering Product Management Product Design Project Management Leading Development... Software Architectural... Product Marketing Leadership Java Enterprise Edition See 13+     See less Enterprise Architecture WebSphere Process Server WebSphere Application... WebSphere Integration... Business Process Design Business Process... Integration WebSphere MQ Software Development WebSphere ESB Integration Architecture Customer Engagement Software Design WebSphere Business... Software Solution... Conflict Resolution Business Process... Business Process... Business Process... Software Engineering Product Management Product Design Project Management Leading Development... Software Architectural... Product Marketing Leadership Java Enterprise Edition See 13+     See less Enterprise Architecture WebSphere Process Server WebSphere Application... WebSphere Integration... Business Process Design Business Process... Integration WebSphere MQ Software Development WebSphere ESB Integration Architecture Customer Engagement Software Design WebSphere Business... Software Solution... Conflict Resolution Business Process... Business Process... Business Process... Software Engineering Product Management Product Design Project Management Leading Development... Software Architectural... Product Marketing Leadership Java Enterprise Edition See 13+     See less Education The University of Texas at Austin Master of Business Administration (MBA),  Business Administration and Management , General , GPA 3.90 2013  – 2016 ■ Runner-up at the ‘Tech/Ops’ case challenge organized by McCombs \n \n■ Finalist at the IBM Watson Case Competition organized by IBM and McCombs \n \n■ Finalist at the Dell Internet of Things case challenge \n \n■ MBA+ project at Wells Fargo: - Prepared a detailed business plan for a key trend that will impact the Mortgage Banking Industry \n \n■ MBA+ project at Epic Music LA: New business development strategy for a Los Angeles-based production music start-up 'Epic Music' Activities and Societies:  Intramural sports (Soccer) University of Madras Bachelor of Engineering (B.E.),  Computer Engineering 1999  – 2003 ■ First Prize for Paper presentation on Mathematical Modeling and Simulation at SRM Ramanujam Maths Club \n \n■ First Prize for Paper presentation on Virtual Private Networks at Sairam Engineering College Activities and Societies:  Treasurer - Computer Science and Engineering Department The University of Texas at Austin Master of Business Administration (MBA),  Business Administration and Management , General , GPA 3.90 2013  – 2016 ■ Runner-up at the ‘Tech/Ops’ case challenge organized by McCombs \n \n■ Finalist at the IBM Watson Case Competition organized by IBM and McCombs \n \n■ Finalist at the Dell Internet of Things case challenge \n \n■ MBA+ project at Wells Fargo: - Prepared a detailed business plan for a key trend that will impact the Mortgage Banking Industry \n \n■ MBA+ project at Epic Music LA: New business development strategy for a Los Angeles-based production music start-up 'Epic Music' Activities and Societies:  Intramural sports (Soccer) The University of Texas at Austin Master of Business Administration (MBA),  Business Administration and Management , General , GPA 3.90 2013  – 2016 ■ Runner-up at the ‘Tech/Ops’ case challenge organized by McCombs \n \n■ Finalist at the IBM Watson Case Competition organized by IBM and McCombs \n \n■ Finalist at the Dell Internet of Things case challenge \n \n■ MBA+ project at Wells Fargo: - Prepared a detailed business plan for a key trend that will impact the Mortgage Banking Industry \n \n■ MBA+ project at Epic Music LA: New business development strategy for a Los Angeles-based production music start-up 'Epic Music' Activities and Societies:  Intramural sports (Soccer) The University of Texas at Austin Master of Business Administration (MBA),  Business Administration and Management , General , GPA 3.90 2013  – 2016 ■ Runner-up at the ‘Tech/Ops’ case challenge organized by McCombs \n \n■ Finalist at the IBM Watson Case Competition organized by IBM and McCombs \n \n■ Finalist at the Dell Internet of Things case challenge \n \n■ MBA+ project at Wells Fargo: - Prepared a detailed business plan for a key trend that will impact the Mortgage Banking Industry \n \n■ MBA+ project at Epic Music LA: New business development strategy for a Los Angeles-based production music start-up 'Epic Music' Activities and Societies:  Intramural sports (Soccer) University of Madras Bachelor of Engineering (B.E.),  Computer Engineering 1999  – 2003 ■ First Prize for Paper presentation on Mathematical Modeling and Simulation at SRM Ramanujam Maths Club \n \n■ First Prize for Paper presentation on Virtual Private Networks at Sairam Engineering College Activities and Societies:  Treasurer - Computer Science and Engineering Department University of Madras Bachelor of Engineering (B.E.),  Computer Engineering 1999  – 2003 ■ First Prize for Paper presentation on Mathematical Modeling and Simulation at SRM Ramanujam Maths Club \n \n■ First Prize for Paper presentation on Virtual Private Networks at Sairam Engineering College Activities and Societies:  Treasurer - Computer Science and Engineering Department University of Madras Bachelor of Engineering (B.E.),  Computer Engineering 1999  – 2003 ■ First Prize for Paper presentation on Mathematical Modeling and Simulation at SRM Ramanujam Maths Club \n \n■ First Prize for Paper presentation on Virtual Private Networks at Sairam Engineering College Activities and Societies:  Treasurer - Computer Science and Engineering Department Honors & Awards Additional Honors & Awards ■ Recipient of 4 IBM Bravo awards for outstanding contribution, technical creativity and business partner success.  \n \n■ Hold 10 IBM certifications on SOA related technologies and ‘On Demand Business’. \n \n■ Presenter at industry conferences including IBM Impact, Tele Management World Forum, Austin Technical Vitality Council and WebSphere Services Technical Exchange \n \n■ Received awards for two projects selected into IBM wide technical symposium called ‘Tech Connect’ Additional Honors & Awards ■ Recipient of 4 IBM Bravo awards for outstanding contribution, technical creativity and business partner success.  \n \n■ Hold 10 IBM certifications on SOA related technologies and ‘On Demand Business’. \n \n■ Presenter at industry conferences including IBM Impact, Tele Management World Forum, Austin Technical Vitality Council and WebSphere Services Technical Exchange \n \n■ Received awards for two projects selected into IBM wide technical symposium called ‘Tech Connect’ Additional Honors & Awards ■ Recipient of 4 IBM Bravo awards for outstanding contribution, technical creativity and business partner success.  \n \n■ Hold 10 IBM certifications on SOA related technologies and ‘On Demand Business’. \n \n■ Presenter at industry conferences including IBM Impact, Tele Management World Forum, Austin Technical Vitality Council and WebSphere Services Technical Exchange \n \n■ Received awards for two projects selected into IBM wide technical symposium called ‘Tech Connect’ Additional Honors & Awards ■ Recipient of 4 IBM Bravo awards for outstanding contribution, technical creativity and business partner success.  \n \n■ Hold 10 IBM certifications on SOA related technologies and ‘On Demand Business’. \n \n■ Presenter at industry conferences including IBM Impact, Tele Management World Forum, Austin Technical Vitality Council and WebSphere Services Technical Exchange \n \n■ Received awards for two projects selected into IBM wide technical symposium called ‘Tech Connect’ ", "Summary Senior consultant with broad experience in all aspects of trading and settlement of securities as well as payment processing. Strong presentation and language skills (German, English, French, Russian). \nAlways interested in complex integration projects. Specialties:Strong customer focus, excellent presentation skills, extensive knowhow in trading, securities and payment processing. Summary Senior consultant with broad experience in all aspects of trading and settlement of securities as well as payment processing. Strong presentation and language skills (German, English, French, Russian). \nAlways interested in complex integration projects. Specialties:Strong customer focus, excellent presentation skills, extensive knowhow in trading, securities and payment processing. Senior consultant with broad experience in all aspects of trading and settlement of securities as well as payment processing. Strong presentation and language skills (German, English, French, Russian). \nAlways interested in complex integration projects. Specialties:Strong customer focus, excellent presentation skills, extensive knowhow in trading, securities and payment processing. Senior consultant with broad experience in all aspects of trading and settlement of securities as well as payment processing. Strong presentation and language skills (German, English, French, Russian). \nAlways interested in complex integration projects. Specialties:Strong customer focus, excellent presentation skills, extensive knowhow in trading, securities and payment processing. Experience Senior Consultant IBM September 2014  – Present (1 year) Zürich Area, Switzerland Senior PreSales Bottomline Technologies EMEA January 2013  –  August 2014  (1 year 8 months) Zürich Area, Switzerland PreSales Consultant Arkelis, a SWIFT Company October 2010  –  December 2012  (2 years 3 months) PreSales Consultant SunGard April 2010  –  October 2010  (7 months) Industry Solution Consultant Sterling Commerce February 2007  –  April 2010  (3 years 3 months) Senior Consultant SunGard January 2006  –  January 2007  (1 year 1 month) Senior Consultant e3 AG June 2005  –  January 2006  (8 months) Senior Consultant SunGard October 1998  –  May 2005  (6 years 8 months) Project Manager UBS May 1996  –  May 1998  (2 years 1 month) Assistant Product Manager IBM Switzerland August 1992  –  February 1996  (3 years 7 months) Programmer Russian Academy of Science July 1994  –  August 1994  (2 months) Assisant Product Manager IBM Kiev (Ukraine) February 1994  –  May 1994  (4 months) Senior Consultant IBM September 2014  – Present (1 year) Zürich Area, Switzerland Senior Consultant IBM September 2014  – Present (1 year) Zürich Area, Switzerland Senior PreSales Bottomline Technologies EMEA January 2013  –  August 2014  (1 year 8 months) Zürich Area, Switzerland Senior PreSales Bottomline Technologies EMEA January 2013  –  August 2014  (1 year 8 months) Zürich Area, Switzerland PreSales Consultant Arkelis, a SWIFT Company October 2010  –  December 2012  (2 years 3 months) PreSales Consultant Arkelis, a SWIFT Company October 2010  –  December 2012  (2 years 3 months) PreSales Consultant SunGard April 2010  –  October 2010  (7 months) PreSales Consultant SunGard April 2010  –  October 2010  (7 months) Industry Solution Consultant Sterling Commerce February 2007  –  April 2010  (3 years 3 months) Industry Solution Consultant Sterling Commerce February 2007  –  April 2010  (3 years 3 months) Senior Consultant SunGard January 2006  –  January 2007  (1 year 1 month) Senior Consultant SunGard January 2006  –  January 2007  (1 year 1 month) Senior Consultant e3 AG June 2005  –  January 2006  (8 months) Senior Consultant e3 AG June 2005  –  January 2006  (8 months) Senior Consultant SunGard October 1998  –  May 2005  (6 years 8 months) Senior Consultant SunGard October 1998  –  May 2005  (6 years 8 months) Project Manager UBS May 1996  –  May 1998  (2 years 1 month) Project Manager UBS May 1996  –  May 1998  (2 years 1 month) Assistant Product Manager IBM Switzerland August 1992  –  February 1996  (3 years 7 months) Assistant Product Manager IBM Switzerland August 1992  –  February 1996  (3 years 7 months) Programmer Russian Academy of Science July 1994  –  August 1994  (2 months) Programmer Russian Academy of Science July 1994  –  August 1994  (2 months) Assisant Product Manager IBM Kiev (Ukraine) February 1994  –  May 1994  (4 months) Assisant Product Manager IBM Kiev (Ukraine) February 1994  –  May 1994  (4 months) Languages German English Russian French German English Russian French German English Russian French Skills SWIFT payments Sales Presentations Integration EAI Pre-sales Data Transformation Business Analysis Financial Services Payments SaaS Asset Managment Securities Solution Architecture Account Management Cloud Computing Software Project... Enterprise Software Software Development Requirements Analysis Unix Enterprise Architecture Middleware Professional Services SOA Business Intelligence Consulting Product Management IT Strategy See 13+     See less Skills  SWIFT payments Sales Presentations Integration EAI Pre-sales Data Transformation Business Analysis Financial Services Payments SaaS Asset Managment Securities Solution Architecture Account Management Cloud Computing Software Project... Enterprise Software Software Development Requirements Analysis Unix Enterprise Architecture Middleware Professional Services SOA Business Intelligence Consulting Product Management IT Strategy See 13+     See less SWIFT payments Sales Presentations Integration EAI Pre-sales Data Transformation Business Analysis Financial Services Payments SaaS Asset Managment Securities Solution Architecture Account Management Cloud Computing Software Project... Enterprise Software Software Development Requirements Analysis Unix Enterprise Architecture Middleware Professional Services SOA Business Intelligence Consulting Product Management IT Strategy See 13+     See less SWIFT payments Sales Presentations Integration EAI Pre-sales Data Transformation Business Analysis Financial Services Payments SaaS Asset Managment Securities Solution Architecture Account Management Cloud Computing Software Project... Enterprise Software Software Development Requirements Analysis Unix Enterprise Architecture Middleware Professional Services SOA Business Intelligence Consulting Product Management IT Strategy See 13+     See less Education University of Zurich Master November 1993  – May 1997 University of Zurich Master November 1993  – May 1997 University of Zurich Master November 1993  – May 1997 University of Zurich Master November 1993  – May 1997 ", "Summary SENIOR PRODUCT MANAGER / CLIENT SUCCESS MANAGER \nMartha is a dynamic and results-focused professional with 18+ year career record of increasing revenues, profits and market share through expert orchestration of product management, development, and marketing strategies. She has quantifiable success in partnering with stakeholders, management, vendors, and teams to create, clarify and prioritize cloud computing and SaaS business requirements and specifications, define strategies and go-to-market plans, resolve issues, and ensure the timely delivery of quality-driven technology and process improvement solutions. Martha is a highly effective evangelist and emerging technology product champion; adept at presenting value propositions while managing strategic business partnerships and alliances. Martha has an extensive management and technical background spanning full range of SaaS, end-to-end software development, and product lifecycle management supported by MBA in Information Technology, and Finance and continuing eduction in user research and product management.  \n \nSpecialties: -Product Lifecycle Management \n-Product Testing/Measurement \n-Management of Agile Software Development \n-SaaS Offerings \n-Product Roadmap/Vision \n-C-Level Presentations \n-Process Improvement/Reengineering \n-Cloud Computing Summary SENIOR PRODUCT MANAGER / CLIENT SUCCESS MANAGER \nMartha is a dynamic and results-focused professional with 18+ year career record of increasing revenues, profits and market share through expert orchestration of product management, development, and marketing strategies. She has quantifiable success in partnering with stakeholders, management, vendors, and teams to create, clarify and prioritize cloud computing and SaaS business requirements and specifications, define strategies and go-to-market plans, resolve issues, and ensure the timely delivery of quality-driven technology and process improvement solutions. Martha is a highly effective evangelist and emerging technology product champion; adept at presenting value propositions while managing strategic business partnerships and alliances. Martha has an extensive management and technical background spanning full range of SaaS, end-to-end software development, and product lifecycle management supported by MBA in Information Technology, and Finance and continuing eduction in user research and product management.  \n \nSpecialties: -Product Lifecycle Management \n-Product Testing/Measurement \n-Management of Agile Software Development \n-SaaS Offerings \n-Product Roadmap/Vision \n-C-Level Presentations \n-Process Improvement/Reengineering \n-Cloud Computing SENIOR PRODUCT MANAGER / CLIENT SUCCESS MANAGER \nMartha is a dynamic and results-focused professional with 18+ year career record of increasing revenues, profits and market share through expert orchestration of product management, development, and marketing strategies. She has quantifiable success in partnering with stakeholders, management, vendors, and teams to create, clarify and prioritize cloud computing and SaaS business requirements and specifications, define strategies and go-to-market plans, resolve issues, and ensure the timely delivery of quality-driven technology and process improvement solutions. Martha is a highly effective evangelist and emerging technology product champion; adept at presenting value propositions while managing strategic business partnerships and alliances. Martha has an extensive management and technical background spanning full range of SaaS, end-to-end software development, and product lifecycle management supported by MBA in Information Technology, and Finance and continuing eduction in user research and product management.  \n \nSpecialties: -Product Lifecycle Management \n-Product Testing/Measurement \n-Management of Agile Software Development \n-SaaS Offerings \n-Product Roadmap/Vision \n-C-Level Presentations \n-Process Improvement/Reengineering \n-Cloud Computing SENIOR PRODUCT MANAGER / CLIENT SUCCESS MANAGER \nMartha is a dynamic and results-focused professional with 18+ year career record of increasing revenues, profits and market share through expert orchestration of product management, development, and marketing strategies. She has quantifiable success in partnering with stakeholders, management, vendors, and teams to create, clarify and prioritize cloud computing and SaaS business requirements and specifications, define strategies and go-to-market plans, resolve issues, and ensure the timely delivery of quality-driven technology and process improvement solutions. Martha is a highly effective evangelist and emerging technology product champion; adept at presenting value propositions while managing strategic business partnerships and alliances. Martha has an extensive management and technical background spanning full range of SaaS, end-to-end software development, and product lifecycle management supported by MBA in Information Technology, and Finance and continuing eduction in user research and product management.  \n \nSpecialties: -Product Lifecycle Management \n-Product Testing/Measurement \n-Management of Agile Software Development \n-SaaS Offerings \n-Product Roadmap/Vision \n-C-Level Presentations \n-Process Improvement/Reengineering \n-Cloud Computing Experience Client Success Manager IBM April 2014  – Present (1 year 5 months) Waltham, Ma Responsible and accountable for increasing software footprint, adoption and overall client satisfaction in strategic IBM retail, finance and technology web analytics and omni-channel marketing clients. Strengthened client relationships through in-depth business use case research and application to IBM’s portfolio strategy.  \n-Achieved 100% retention rate; Established client-to-client references on-demand \n-Built rapport quickly with clients through listening and acting to become the go-to resource  \n-Envisioned and presented technical integration ideas and solutions to clients  \n-Brought together cross-product and cross-functional team on both IBM and client sides to discover and explore root causes and potential solutions \n Senior Product Manager - IBM PureSystems IBM January 2012  –  April 2014  (2 years 4 months) Littleton, MA Responsible for product plans, competitive market positioning and cross functional delivery of major integrated hardware and software product. Establish value propositions to delight customers and set priorities with development. Senior Product Manager - IBM LotusLive ISV Partners IBM March 2010  –  April 2012  (2 years 2 months) Established program for Independent Software Vendors (ISVs) to extend the LotusLive public cloud platform with secure access to services and data. Created pre-release online environment through work with SaaS operations, development and other cross-functional teams for partners to develop, test and deploy their integrations prior to deployment to the live production environment. Gathered, and prioritized requirements from ISVs that help drive revenue for both their offering and LotusLive.  \n \n*Key Achievements* \n-Deployed 10 new cloud-based partners in finance, salesforce automation (SugarCRM, Salesforce.com), compliance, construction industries since program commencement. \n-Evolved program to have open access for any of IBM's 40,000 global business partners. \n-Added features to LotusLive that enable any company to extend LotusLive for their own company purposes enabling self-service access to cloud resources.  \n-Created and enhanced program for Independent Software Vendors (ISVs) to extend the LotusLive public cloud platform with secure access to services and data leading to shorter time-to-market for integration. Reduced time cycle time from acceptance into program to acceptance onto release from six months to six weeks.  \n-Successfully negotiated additional partners integration deployments to meet strategic marketing announcements hitting critical release milestones even with third party dependencies. Senior Product Manager -IBM LotusLive IBM December 2007  –  February 2010  (2 years 3 months) Selected as 1st product manager on-board for company's 1st software-as-a-service (SaaS) offerings focused on solving business collaboration issues. Plannend and directed all phases of product development lifecycle, from initial concept through development, testing, and launch. Analyzed and prioritized customer requirements, coordinating development according to market targets and customer feedback. Negotiated requirements with engineering and build strategic use cases for product roadmap. Expedited daily operations including process engineering, strategic planning, staff development, and quality control.  \n \n*Key Achievements* \n-Developed competitive use cases for strategic planning and and key customer accounts including materials key to 1st major LotusLive sales win of $5 million+ with a global electronics manufacturer.  \n-Increasing number of enterprise customer and partner references to 6 while expanding LotusLive Design Partner program to 15 active testing participants leading to a higher quality product. \n-Added 2,000 new users to LotusLive through integration with popular user conference. \n-Led project which earned LotusLive the “Best Cloud Application of 2009” status from CRN, collaborating directly with product reviewer to effectively position LotusLive offering. \n-Designed, implemented, and deployed IBM's first on-going SaaS-based open beta testing program with 5k participants. \nCoordinated twice annual customer and partner event, increasing corporate and product visibility with major companies such as Nationwide and Colgate Palmolive. Senior Development Manager IBM December 2004  –  November 2007  (3 years) Provided decisive leadership and direction for 18-member engineering team focused on delivery of industry-leading \napplication development tools within highly competitive market. Directed activities of global development teams in the U.S., Ireland, India and Japan through entire release \ncycles, from early design, specification development, development, release and customer support. Created ad-hoc task forces to deliver late breaking customer-centric features. Devised major application development track content for IBM customer conference. \n \n*Key Achievements* \n-Provided decisive leadership and direction for 18-member engineering team focused on delivery of industry-leading application development tools within highly competitive market.  \n-Directed activities of global development teams in the U.S., Ireland, India and Japan through entire release cycles, from early design, specification development, development, release and customer support. \n-Led and coordinated new UI feature development including Web 2.0 (Ajax and web services) and web development features from design through implementation. \n-Deployed Agile development methodologies and Eclipse technologies to achieve and maintain high levels of efficiency, productivity, and quality. \n-Delivered early tech preview of application development tool in less than 6 months, expediting product development and marketing initiatives. Senior Product Manager / Product Manager IBM September 1999  –  November 2004  (5 years 3 months) Served as primary leadership force for all product management operations encompassing product architecture/release, project design, and comprehensive roadmap of IBM Lotus collaboration and application development products including MQSeries and CICS Connections to Lotus Domino. Interfaced with customers to analyze and define business requirements and ensure consistent delivery of top quality customer support. Authored \nmarketing materials including press releases, printed product literature and brochures. \n \n*Key Achievements* \n-Served as primary leadership force for all product management operations encompassing product architecture/release, project design, and comprehensive roadmap of IBM Lotus collaboration and application development products including MQSeries and CICS Connections to Lotus Domino. \n-Coordinated major aspects of releases including design partner programs, beta focus groups, targeted marketing to IBM customers and education of IBM sales force on new feature sets. Senior Product Manager / Product Manager Lotus Application Development Products January 1999  –  January 2004  (5 years 1 month) Delivered early tech preview of application development tool in less than 6 months, expediting product development and marketing initiatives.; Served as primary leadership force for all product management operations encompassing product architecture/release, project design, and comprehensive roadmap of IBM Lotus collaboration and application development products including MQSeries and CICS Connections to Lotus Domino. Interfaced with Consultant Lotus, Inc January 1996  –  January 1999  (3 years 1 month) Helped Lotus clients solve business problems with collaboration solutions. Designed and developed Lotus Notes applications for Fortune 500 companies. NASDAQ Institutional Sales Trading Assistant Goldman Sachs August 1992  –  September 1994  (2 years 2 months) Sales Assistant on NASDAQ Trading Desk. Portfolio Assistant Daido International August 1989  –  July 1992  (3 years) created reports about portfolio holdings for stakeholders in Japan and the United States. Client Success Manager IBM April 2014  – Present (1 year 5 months) Waltham, Ma Responsible and accountable for increasing software footprint, adoption and overall client satisfaction in strategic IBM retail, finance and technology web analytics and omni-channel marketing clients. Strengthened client relationships through in-depth business use case research and application to IBM’s portfolio strategy.  \n-Achieved 100% retention rate; Established client-to-client references on-demand \n-Built rapport quickly with clients through listening and acting to become the go-to resource  \n-Envisioned and presented technical integration ideas and solutions to clients  \n-Brought together cross-product and cross-functional team on both IBM and client sides to discover and explore root causes and potential solutions \n Client Success Manager IBM April 2014  – Present (1 year 5 months) Waltham, Ma Responsible and accountable for increasing software footprint, adoption and overall client satisfaction in strategic IBM retail, finance and technology web analytics and omni-channel marketing clients. Strengthened client relationships through in-depth business use case research and application to IBM’s portfolio strategy.  \n-Achieved 100% retention rate; Established client-to-client references on-demand \n-Built rapport quickly with clients through listening and acting to become the go-to resource  \n-Envisioned and presented technical integration ideas and solutions to clients  \n-Brought together cross-product and cross-functional team on both IBM and client sides to discover and explore root causes and potential solutions \n Senior Product Manager - IBM PureSystems IBM January 2012  –  April 2014  (2 years 4 months) Littleton, MA Responsible for product plans, competitive market positioning and cross functional delivery of major integrated hardware and software product. Establish value propositions to delight customers and set priorities with development. Senior Product Manager - IBM PureSystems IBM January 2012  –  April 2014  (2 years 4 months) Littleton, MA Responsible for product plans, competitive market positioning and cross functional delivery of major integrated hardware and software product. Establish value propositions to delight customers and set priorities with development. Senior Product Manager - IBM LotusLive ISV Partners IBM March 2010  –  April 2012  (2 years 2 months) Established program for Independent Software Vendors (ISVs) to extend the LotusLive public cloud platform with secure access to services and data. Created pre-release online environment through work with SaaS operations, development and other cross-functional teams for partners to develop, test and deploy their integrations prior to deployment to the live production environment. Gathered, and prioritized requirements from ISVs that help drive revenue for both their offering and LotusLive.  \n \n*Key Achievements* \n-Deployed 10 new cloud-based partners in finance, salesforce automation (SugarCRM, Salesforce.com), compliance, construction industries since program commencement. \n-Evolved program to have open access for any of IBM's 40,000 global business partners. \n-Added features to LotusLive that enable any company to extend LotusLive for their own company purposes enabling self-service access to cloud resources.  \n-Created and enhanced program for Independent Software Vendors (ISVs) to extend the LotusLive public cloud platform with secure access to services and data leading to shorter time-to-market for integration. Reduced time cycle time from acceptance into program to acceptance onto release from six months to six weeks.  \n-Successfully negotiated additional partners integration deployments to meet strategic marketing announcements hitting critical release milestones even with third party dependencies. Senior Product Manager - IBM LotusLive ISV Partners IBM March 2010  –  April 2012  (2 years 2 months) Established program for Independent Software Vendors (ISVs) to extend the LotusLive public cloud platform with secure access to services and data. Created pre-release online environment through work with SaaS operations, development and other cross-functional teams for partners to develop, test and deploy their integrations prior to deployment to the live production environment. Gathered, and prioritized requirements from ISVs that help drive revenue for both their offering and LotusLive.  \n \n*Key Achievements* \n-Deployed 10 new cloud-based partners in finance, salesforce automation (SugarCRM, Salesforce.com), compliance, construction industries since program commencement. \n-Evolved program to have open access for any of IBM's 40,000 global business partners. \n-Added features to LotusLive that enable any company to extend LotusLive for their own company purposes enabling self-service access to cloud resources.  \n-Created and enhanced program for Independent Software Vendors (ISVs) to extend the LotusLive public cloud platform with secure access to services and data leading to shorter time-to-market for integration. Reduced time cycle time from acceptance into program to acceptance onto release from six months to six weeks.  \n-Successfully negotiated additional partners integration deployments to meet strategic marketing announcements hitting critical release milestones even with third party dependencies. Senior Product Manager -IBM LotusLive IBM December 2007  –  February 2010  (2 years 3 months) Selected as 1st product manager on-board for company's 1st software-as-a-service (SaaS) offerings focused on solving business collaboration issues. Plannend and directed all phases of product development lifecycle, from initial concept through development, testing, and launch. Analyzed and prioritized customer requirements, coordinating development according to market targets and customer feedback. Negotiated requirements with engineering and build strategic use cases for product roadmap. Expedited daily operations including process engineering, strategic planning, staff development, and quality control.  \n \n*Key Achievements* \n-Developed competitive use cases for strategic planning and and key customer accounts including materials key to 1st major LotusLive sales win of $5 million+ with a global electronics manufacturer.  \n-Increasing number of enterprise customer and partner references to 6 while expanding LotusLive Design Partner program to 15 active testing participants leading to a higher quality product. \n-Added 2,000 new users to LotusLive through integration with popular user conference. \n-Led project which earned LotusLive the “Best Cloud Application of 2009” status from CRN, collaborating directly with product reviewer to effectively position LotusLive offering. \n-Designed, implemented, and deployed IBM's first on-going SaaS-based open beta testing program with 5k participants. \nCoordinated twice annual customer and partner event, increasing corporate and product visibility with major companies such as Nationwide and Colgate Palmolive. Senior Product Manager -IBM LotusLive IBM December 2007  –  February 2010  (2 years 3 months) Selected as 1st product manager on-board for company's 1st software-as-a-service (SaaS) offerings focused on solving business collaboration issues. Plannend and directed all phases of product development lifecycle, from initial concept through development, testing, and launch. Analyzed and prioritized customer requirements, coordinating development according to market targets and customer feedback. Negotiated requirements with engineering and build strategic use cases for product roadmap. Expedited daily operations including process engineering, strategic planning, staff development, and quality control.  \n \n*Key Achievements* \n-Developed competitive use cases for strategic planning and and key customer accounts including materials key to 1st major LotusLive sales win of $5 million+ with a global electronics manufacturer.  \n-Increasing number of enterprise customer and partner references to 6 while expanding LotusLive Design Partner program to 15 active testing participants leading to a higher quality product. \n-Added 2,000 new users to LotusLive through integration with popular user conference. \n-Led project which earned LotusLive the “Best Cloud Application of 2009” status from CRN, collaborating directly with product reviewer to effectively position LotusLive offering. \n-Designed, implemented, and deployed IBM's first on-going SaaS-based open beta testing program with 5k participants. \nCoordinated twice annual customer and partner event, increasing corporate and product visibility with major companies such as Nationwide and Colgate Palmolive. Senior Development Manager IBM December 2004  –  November 2007  (3 years) Provided decisive leadership and direction for 18-member engineering team focused on delivery of industry-leading \napplication development tools within highly competitive market. Directed activities of global development teams in the U.S., Ireland, India and Japan through entire release \ncycles, from early design, specification development, development, release and customer support. Created ad-hoc task forces to deliver late breaking customer-centric features. Devised major application development track content for IBM customer conference. \n \n*Key Achievements* \n-Provided decisive leadership and direction for 18-member engineering team focused on delivery of industry-leading application development tools within highly competitive market.  \n-Directed activities of global development teams in the U.S., Ireland, India and Japan through entire release cycles, from early design, specification development, development, release and customer support. \n-Led and coordinated new UI feature development including Web 2.0 (Ajax and web services) and web development features from design through implementation. \n-Deployed Agile development methodologies and Eclipse technologies to achieve and maintain high levels of efficiency, productivity, and quality. \n-Delivered early tech preview of application development tool in less than 6 months, expediting product development and marketing initiatives. Senior Development Manager IBM December 2004  –  November 2007  (3 years) Provided decisive leadership and direction for 18-member engineering team focused on delivery of industry-leading \napplication development tools within highly competitive market. Directed activities of global development teams in the U.S., Ireland, India and Japan through entire release \ncycles, from early design, specification development, development, release and customer support. Created ad-hoc task forces to deliver late breaking customer-centric features. Devised major application development track content for IBM customer conference. \n \n*Key Achievements* \n-Provided decisive leadership and direction for 18-member engineering team focused on delivery of industry-leading application development tools within highly competitive market.  \n-Directed activities of global development teams in the U.S., Ireland, India and Japan through entire release cycles, from early design, specification development, development, release and customer support. \n-Led and coordinated new UI feature development including Web 2.0 (Ajax and web services) and web development features from design through implementation. \n-Deployed Agile development methodologies and Eclipse technologies to achieve and maintain high levels of efficiency, productivity, and quality. \n-Delivered early tech preview of application development tool in less than 6 months, expediting product development and marketing initiatives. Senior Product Manager / Product Manager IBM September 1999  –  November 2004  (5 years 3 months) Served as primary leadership force for all product management operations encompassing product architecture/release, project design, and comprehensive roadmap of IBM Lotus collaboration and application development products including MQSeries and CICS Connections to Lotus Domino. Interfaced with customers to analyze and define business requirements and ensure consistent delivery of top quality customer support. Authored \nmarketing materials including press releases, printed product literature and brochures. \n \n*Key Achievements* \n-Served as primary leadership force for all product management operations encompassing product architecture/release, project design, and comprehensive roadmap of IBM Lotus collaboration and application development products including MQSeries and CICS Connections to Lotus Domino. \n-Coordinated major aspects of releases including design partner programs, beta focus groups, targeted marketing to IBM customers and education of IBM sales force on new feature sets. Senior Product Manager / Product Manager IBM September 1999  –  November 2004  (5 years 3 months) Served as primary leadership force for all product management operations encompassing product architecture/release, project design, and comprehensive roadmap of IBM Lotus collaboration and application development products including MQSeries and CICS Connections to Lotus Domino. Interfaced with customers to analyze and define business requirements and ensure consistent delivery of top quality customer support. Authored \nmarketing materials including press releases, printed product literature and brochures. \n \n*Key Achievements* \n-Served as primary leadership force for all product management operations encompassing product architecture/release, project design, and comprehensive roadmap of IBM Lotus collaboration and application development products including MQSeries and CICS Connections to Lotus Domino. \n-Coordinated major aspects of releases including design partner programs, beta focus groups, targeted marketing to IBM customers and education of IBM sales force on new feature sets. Senior Product Manager / Product Manager Lotus Application Development Products January 1999  –  January 2004  (5 years 1 month) Delivered early tech preview of application development tool in less than 6 months, expediting product development and marketing initiatives.; Served as primary leadership force for all product management operations encompassing product architecture/release, project design, and comprehensive roadmap of IBM Lotus collaboration and application development products including MQSeries and CICS Connections to Lotus Domino. Interfaced with Senior Product Manager / Product Manager Lotus Application Development Products January 1999  –  January 2004  (5 years 1 month) Delivered early tech preview of application development tool in less than 6 months, expediting product development and marketing initiatives.; Served as primary leadership force for all product management operations encompassing product architecture/release, project design, and comprehensive roadmap of IBM Lotus collaboration and application development products including MQSeries and CICS Connections to Lotus Domino. Interfaced with Consultant Lotus, Inc January 1996  –  January 1999  (3 years 1 month) Helped Lotus clients solve business problems with collaboration solutions. Designed and developed Lotus Notes applications for Fortune 500 companies. Consultant Lotus, Inc January 1996  –  January 1999  (3 years 1 month) Helped Lotus clients solve business problems with collaboration solutions. Designed and developed Lotus Notes applications for Fortune 500 companies. NASDAQ Institutional Sales Trading Assistant Goldman Sachs August 1992  –  September 1994  (2 years 2 months) Sales Assistant on NASDAQ Trading Desk. NASDAQ Institutional Sales Trading Assistant Goldman Sachs August 1992  –  September 1994  (2 years 2 months) Sales Assistant on NASDAQ Trading Desk. Portfolio Assistant Daido International August 1989  –  July 1992  (3 years) created reports about portfolio holdings for stakeholders in Japan and the United States. Portfolio Assistant Daido International August 1989  –  July 1992  (3 years) created reports about portfolio holdings for stakeholders in Japan and the United States. Languages English English English Skills Cloud Computing Product Launch SaaS Agile Product Management Software Development Business Strategy Agile Methodologies Pre-sales Enterprise Software Product Lifecycle... Integration Enterprise Architecture Program Management Agile Project Management Strategic Partnerships Mobile Devices Cross-functional Team... Sales Enablement Solution Architecture Requirements Analysis Go-to-market Strategy Partner Management Leadership Scrum Salesforce.com Business Alliances Management Strategy Web Services Collaboration Solutions Product Development IT Strategy Demand Generation Business Intelligence Professional Services Software Project... Solution Selling Software Industry See 24+     See less Skills  Cloud Computing Product Launch SaaS Agile Product Management Software Development Business Strategy Agile Methodologies Pre-sales Enterprise Software Product Lifecycle... Integration Enterprise Architecture Program Management Agile Project Management Strategic Partnerships Mobile Devices Cross-functional Team... Sales Enablement Solution Architecture Requirements Analysis Go-to-market Strategy Partner Management Leadership Scrum Salesforce.com Business Alliances Management Strategy Web Services Collaboration Solutions Product Development IT Strategy Demand Generation Business Intelligence Professional Services Software Project... Solution Selling Software Industry See 24+     See less Cloud Computing Product Launch SaaS Agile Product Management Software Development Business Strategy Agile Methodologies Pre-sales Enterprise Software Product Lifecycle... Integration Enterprise Architecture Program Management Agile Project Management Strategic Partnerships Mobile Devices Cross-functional Team... Sales Enablement Solution Architecture Requirements Analysis Go-to-market Strategy Partner Management Leadership Scrum Salesforce.com Business Alliances Management Strategy Web Services Collaboration Solutions Product Development IT Strategy Demand Generation Business Intelligence Professional Services Software Project... Solution Selling Software Industry See 24+     See less Cloud Computing Product Launch SaaS Agile Product Management Software Development Business Strategy Agile Methodologies Pre-sales Enterprise Software Product Lifecycle... Integration Enterprise Architecture Program Management Agile Project Management Strategic Partnerships Mobile Devices Cross-functional Team... Sales Enablement Solution Architecture Requirements Analysis Go-to-market Strategy Partner Management Leadership Scrum Salesforce.com Business Alliances Management Strategy Web Services Collaboration Solutions Product Development IT Strategy Demand Generation Business Intelligence Professional Services Software Project... Solution Selling Software Industry See 24+     See less Education New York University - Leonard N. Stern School of Business MBA,  Information Systems 1992  – 1996 Colgate University Bachelor of Arts,  International Relations 1984  – 1988 Moravian Academy High School Diploma 1980  – 1984 New York University - Leonard N. Stern School of Business MBA,  Information Systems 1992  – 1996 New York University - Leonard N. Stern School of Business MBA,  Information Systems 1992  – 1996 New York University - Leonard N. Stern School of Business MBA,  Information Systems 1992  – 1996 Colgate University Bachelor of Arts,  International Relations 1984  – 1988 Colgate University Bachelor of Arts,  International Relations 1984  – 1988 Colgate University Bachelor of Arts,  International Relations 1984  – 1988 Moravian Academy High School Diploma 1980  – 1984 Moravian Academy High School Diploma 1980  – 1984 Moravian Academy High School Diploma 1980  – 1984 ", "Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Telecommunications Product Management Agile Methodologies Project Management Pre-sales Software Development Integration SQL Quality Assurance Vendor Management Requirements Analysis Wireless Testing Scrum Software Project... Cloud Computing Program Management Solution Architecture SaaS Business Intelligence Agile Project Management Project Planning Mobile Devices Mobile Applications Oracle 3G PMP Linux Java GSM LTE Open Source Software Mobile Technology Mobile Communications Software Engineering Unix IP UMTS See 23+     See less Skills  Telecommunications Product Management Agile Methodologies Project Management Pre-sales Software Development Integration SQL Quality Assurance Vendor Management Requirements Analysis Wireless Testing Scrum Software Project... Cloud Computing Program Management Solution Architecture SaaS Business Intelligence Agile Project Management Project Planning Mobile Devices Mobile Applications Oracle 3G PMP Linux Java GSM LTE Open Source Software Mobile Technology Mobile Communications Software Engineering Unix IP UMTS See 23+     See less Telecommunications Product Management Agile Methodologies Project Management Pre-sales Software Development Integration SQL Quality Assurance Vendor Management Requirements Analysis Wireless Testing Scrum Software Project... Cloud Computing Program Management Solution Architecture SaaS Business Intelligence Agile Project Management Project Planning Mobile Devices Mobile Applications Oracle 3G PMP Linux Java GSM LTE Open Source Software Mobile Technology Mobile Communications Software Engineering Unix IP UMTS See 23+     See less Telecommunications Product Management Agile Methodologies Project Management Pre-sales Software Development Integration SQL Quality Assurance Vendor Management Requirements Analysis Wireless Testing Scrum Software Project... Cloud Computing Program Management Solution Architecture SaaS Business Intelligence Agile Project Management Project Planning Mobile Devices Mobile Applications Oracle 3G PMP Linux Java GSM LTE Open Source Software Mobile Technology Mobile Communications Software Engineering Unix IP UMTS See 23+     See less ", "Summary • Over twenty years of IBM storage product management experience at both a product and portfolio level. \n• Wide knowledge base across all operational areas of the storage business, including development, manufacturing, service and support, sales, and finance. \n• Highly accustomed to managing and driving cross-functional teams and working in a matrixed environment. Summary • Over twenty years of IBM storage product management experience at both a product and portfolio level. \n• Wide knowledge base across all operational areas of the storage business, including development, manufacturing, service and support, sales, and finance. \n• Highly accustomed to managing and driving cross-functional teams and working in a matrixed environment. • Over twenty years of IBM storage product management experience at both a product and portfolio level. \n• Wide knowledge base across all operational areas of the storage business, including development, manufacturing, service and support, sales, and finance. \n• Highly accustomed to managing and driving cross-functional teams and working in a matrixed environment. • Over twenty years of IBM storage product management experience at both a product and portfolio level. \n• Wide knowledge base across all operational areas of the storage business, including development, manufacturing, service and support, sales, and finance. \n• Highly accustomed to managing and driving cross-functional teams and working in a matrixed environment. Skills Program Management Strategy Team Leadership Integration Project Management Leadership Business Development Management Product Management Cross-functional Team... Technical Support Storage Skills  Program Management Strategy Team Leadership Integration Project Management Leadership Business Development Management Product Management Cross-functional Team... Technical Support Storage Program Management Strategy Team Leadership Integration Project Management Leadership Business Development Management Product Management Cross-functional Team... Technical Support Storage Program Management Strategy Team Leadership Integration Project Management Leadership Business Development Management Product Management Cross-functional Team... Technical Support Storage ", "Summary Solutions and detail oriented manager possessing 14+ years of SAP experience, 12 years of product management/marketing, product strategy and product development experience, and more than 18 years of professional work experience. Possess broad base of knowledge in a variety of SAP products related to Mobile, ERP, CRM, and BI. Experienced in managing development groups and development projects, product management, multicultural, and virtual teams.  \n \nStrong presentation skills, presented and performed training at numerous industry conferences including: SAP Tech Ed, SAPPHIRE, ASUG, and Gartner Mobile. Specialties:Enterprise Data Management for SAP, Optim Data Privacy / Masking for SAP, Optim Test Data Management for SAP, SAP Mobile applications expertise, SAP, Product Management, Project Management, Analytics and BI Summary Solutions and detail oriented manager possessing 14+ years of SAP experience, 12 years of product management/marketing, product strategy and product development experience, and more than 18 years of professional work experience. Possess broad base of knowledge in a variety of SAP products related to Mobile, ERP, CRM, and BI. Experienced in managing development groups and development projects, product management, multicultural, and virtual teams.  \n \nStrong presentation skills, presented and performed training at numerous industry conferences including: SAP Tech Ed, SAPPHIRE, ASUG, and Gartner Mobile. Specialties:Enterprise Data Management for SAP, Optim Data Privacy / Masking for SAP, Optim Test Data Management for SAP, SAP Mobile applications expertise, SAP, Product Management, Project Management, Analytics and BI Solutions and detail oriented manager possessing 14+ years of SAP experience, 12 years of product management/marketing, product strategy and product development experience, and more than 18 years of professional work experience. Possess broad base of knowledge in a variety of SAP products related to Mobile, ERP, CRM, and BI. Experienced in managing development groups and development projects, product management, multicultural, and virtual teams.  \n \nStrong presentation skills, presented and performed training at numerous industry conferences including: SAP Tech Ed, SAPPHIRE, ASUG, and Gartner Mobile. Specialties:Enterprise Data Management for SAP, Optim Data Privacy / Masking for SAP, Optim Test Data Management for SAP, SAP Mobile applications expertise, SAP, Product Management, Project Management, Analytics and BI Solutions and detail oriented manager possessing 14+ years of SAP experience, 12 years of product management/marketing, product strategy and product development experience, and more than 18 years of professional work experience. Possess broad base of knowledge in a variety of SAP products related to Mobile, ERP, CRM, and BI. Experienced in managing development groups and development projects, product management, multicultural, and virtual teams.  \n \nStrong presentation skills, presented and performed training at numerous industry conferences including: SAP Tech Ed, SAPPHIRE, ASUG, and Gartner Mobile. Specialties:Enterprise Data Management for SAP, Optim Data Privacy / Masking for SAP, Optim Test Data Management for SAP, SAP Mobile applications expertise, SAP, Product Management, Project Management, Analytics and BI Experience Founder Tribal Networks August 2007  –  December 2012  (5 years 5 months) Founded The SAP Alumni Network, is a private network for both active SAP employees or those who have moved into the SAP eco-system or beyond.  \n \nThe SAP Alumni Network is not affiliated with SAP. World Wide Technical Product Manager IBM May 2008  –  December 2011  (3 years 8 months) Product Management, Strategic Projects, Product Innovation \nWorking on IBM Optim Data Privacy, Test Data Management, System Analyzer and Business Process Analyzer for SAP as the WW Technical Product Manager and lead development product manager. Responsible for vision, strategy and product direction. Deeply involved in the details of the requirements, capabilities, and applicability to the different SAP modules to align to local laws and regulations and eliminate corporate risk, financial penalties and brand degradation in case of loss of personal or sensitive data. Support the WW sales, services, CoE and local teams in presenting, demonstrating, and executing POCs, selling, educating, raising awareness and market positioning. Responsibilities include consolidation of customer requirements by industries, managing entire product lifecycle from planning to commercialization, creating MRDs and PRDs, product collaterals, training material, product positioning and messaging. Understand and address customer pain points and achieve competitive differentiation. Analyze the competitive landscape; identify gaps and innovations for the market. Support sales team in engagement cycles to position the product and close deals. Responsible for planning and coordinating training topics for the different roles involved in the complete supply chain of the application rollout process. Communicate with Sales, Pre-Sales, Consultants, Customer Support (level 1, 2, 3), Product Marketing, and others to determine the course material required for their staff to take related to SAP Basis, SAP ABAP, SAP ERP (FI/CO, SD, MM, PP, CRM, BW, etc). Coordinate with partners and vendors to plan training and logistics worldwide. Successfully execute several training events on an annual basis in Germany, China, US, UK, South Africa, and France targeting several hundred internal personnel and implementation partners. Manager - Global Product Manager for Mobile Business SAP Labs January 2005  –  July 2007  (2 years 7 months) Successfully lead a team of global product managers responsible for mobile solutions at SAP. Managed the product definition planning, captured, analyzed, consolidated and compared market requirements against SAP standard processes, and rolled-out various successful products. Successfully completed ramp-up phases of several mobile product releases and readied solutions for mass-shipment. Initiated a new composite based mobile application on emerging technology. Worked closely with customers on their overall mobile strategy, and advised and guided them through the product roadmap during pre-sales cycles. Provided customers with continuous support during the implementation phases. Successfully collaborated with internal groups such as: \n \n•Development Architects, Development, Quality Management, Ramp-up Organization, Production Unit, Software Logistics, Standard & Compliance, Sales Organizations, Solution/Global Marketing, Business Development, Partner Management, Analyst and Public Relations, Demo Support/Training, Consulting, Knowledge Management, Info Development; to perform necessary planning and execution (MRDs, PRDs, Software Requirement Specification and Design) on all necessary activities (pricing, positioning, messaging, release brochures, release plans, test plans, demos, product/solution roadmaps, localization plans, etc.) to ensure successful roll-out and acceptability of new products in the market. Successfully planned and coordinated all related training events for the development team as well as the training to roll out the product for sales, services, RIG and partners. Collaborated with ramp up organization and recruited consultants to work together on the training materials for the appropriate product release. Successfully executed multiple training events yearly for every new product release for more than 7 years educating and certifying more than 700 attendees. \nRecipient of “2006 Top Talent Award” employee recognition program. Global Product Manager / Project Manager for SAP Mobile Business SAP Labs January 2001  –  December 2005  (5 years) Worked on a virtual global product management team of 9 people within the SAP Solutions for Mobile Business. Lead several development projects for new solution releases. Coordinated development efforts across 5 countries (US, Japan, India, Germany and Canada) while virtually managing a development team of 15 successfully. Responsibilities included roll-in of market requirements, built business case, MRD, PRD, roll-out of final product, ensured project was done on time and on budget, created product specifications based on customers’ expectations, created standards compliance documentation and training materials, performed internal and external training sessions in the US and EMEA in person and at events, conducted webinars, coordinated, communicated and collaborated with various product managers across all SAP solutions and industries, provided regular reporting to a global Steering committee. Assumed multiple roles in the project management life cycle; project leader, coordinator, and risk manager. Also participated in international events, conducted and lead many workshops, focus groups, presentations and roll-out sessions. Lead influence council sessions (3 per year) to collect, review and validate market requirements with customers during the general, verticals as well as solution ASUG(s) (America’s SAP User Group). Senior Consultant - Business Information Warehouse /FI/CO/SD SAP America February 1998  –  December 2000  (2 years 11 months) Acted as consultant, lead consultant, and customer implementations project lead on several projects. Successfully implemented projects related to FI/CO, and SAP BW. BW projects spanned different areas such as SIS/SD, FI, CO, MM, & QM at enterprises in multiple industries. Managed end to end projects implementation lifecycle, which included business blueprinting, modeling, implementation, testing and rollout. Successfully supported many internal projects for major customer events such as ASUG, SAPPHIRE and TechEd; and performed many presentations and demos. Engaged in many pre-sales activities and successfully supported SAP sales team in closing various deals with Fortune 1000 companies. Founder Tribal Networks August 2007  –  December 2012  (5 years 5 months) Founded The SAP Alumni Network, is a private network for both active SAP employees or those who have moved into the SAP eco-system or beyond.  \n \nThe SAP Alumni Network is not affiliated with SAP. Founder Tribal Networks August 2007  –  December 2012  (5 years 5 months) Founded The SAP Alumni Network, is a private network for both active SAP employees or those who have moved into the SAP eco-system or beyond.  \n \nThe SAP Alumni Network is not affiliated with SAP. World Wide Technical Product Manager IBM May 2008  –  December 2011  (3 years 8 months) Product Management, Strategic Projects, Product Innovation \nWorking on IBM Optim Data Privacy, Test Data Management, System Analyzer and Business Process Analyzer for SAP as the WW Technical Product Manager and lead development product manager. Responsible for vision, strategy and product direction. Deeply involved in the details of the requirements, capabilities, and applicability to the different SAP modules to align to local laws and regulations and eliminate corporate risk, financial penalties and brand degradation in case of loss of personal or sensitive data. Support the WW sales, services, CoE and local teams in presenting, demonstrating, and executing POCs, selling, educating, raising awareness and market positioning. Responsibilities include consolidation of customer requirements by industries, managing entire product lifecycle from planning to commercialization, creating MRDs and PRDs, product collaterals, training material, product positioning and messaging. Understand and address customer pain points and achieve competitive differentiation. Analyze the competitive landscape; identify gaps and innovations for the market. Support sales team in engagement cycles to position the product and close deals. Responsible for planning and coordinating training topics for the different roles involved in the complete supply chain of the application rollout process. Communicate with Sales, Pre-Sales, Consultants, Customer Support (level 1, 2, 3), Product Marketing, and others to determine the course material required for their staff to take related to SAP Basis, SAP ABAP, SAP ERP (FI/CO, SD, MM, PP, CRM, BW, etc). Coordinate with partners and vendors to plan training and logistics worldwide. Successfully execute several training events on an annual basis in Germany, China, US, UK, South Africa, and France targeting several hundred internal personnel and implementation partners. World Wide Technical Product Manager IBM May 2008  –  December 2011  (3 years 8 months) Product Management, Strategic Projects, Product Innovation \nWorking on IBM Optim Data Privacy, Test Data Management, System Analyzer and Business Process Analyzer for SAP as the WW Technical Product Manager and lead development product manager. Responsible for vision, strategy and product direction. Deeply involved in the details of the requirements, capabilities, and applicability to the different SAP modules to align to local laws and regulations and eliminate corporate risk, financial penalties and brand degradation in case of loss of personal or sensitive data. Support the WW sales, services, CoE and local teams in presenting, demonstrating, and executing POCs, selling, educating, raising awareness and market positioning. Responsibilities include consolidation of customer requirements by industries, managing entire product lifecycle from planning to commercialization, creating MRDs and PRDs, product collaterals, training material, product positioning and messaging. Understand and address customer pain points and achieve competitive differentiation. Analyze the competitive landscape; identify gaps and innovations for the market. Support sales team in engagement cycles to position the product and close deals. Responsible for planning and coordinating training topics for the different roles involved in the complete supply chain of the application rollout process. Communicate with Sales, Pre-Sales, Consultants, Customer Support (level 1, 2, 3), Product Marketing, and others to determine the course material required for their staff to take related to SAP Basis, SAP ABAP, SAP ERP (FI/CO, SD, MM, PP, CRM, BW, etc). Coordinate with partners and vendors to plan training and logistics worldwide. Successfully execute several training events on an annual basis in Germany, China, US, UK, South Africa, and France targeting several hundred internal personnel and implementation partners. Manager - Global Product Manager for Mobile Business SAP Labs January 2005  –  July 2007  (2 years 7 months) Successfully lead a team of global product managers responsible for mobile solutions at SAP. Managed the product definition planning, captured, analyzed, consolidated and compared market requirements against SAP standard processes, and rolled-out various successful products. Successfully completed ramp-up phases of several mobile product releases and readied solutions for mass-shipment. Initiated a new composite based mobile application on emerging technology. Worked closely with customers on their overall mobile strategy, and advised and guided them through the product roadmap during pre-sales cycles. Provided customers with continuous support during the implementation phases. Successfully collaborated with internal groups such as: \n \n•Development Architects, Development, Quality Management, Ramp-up Organization, Production Unit, Software Logistics, Standard & Compliance, Sales Organizations, Solution/Global Marketing, Business Development, Partner Management, Analyst and Public Relations, Demo Support/Training, Consulting, Knowledge Management, Info Development; to perform necessary planning and execution (MRDs, PRDs, Software Requirement Specification and Design) on all necessary activities (pricing, positioning, messaging, release brochures, release plans, test plans, demos, product/solution roadmaps, localization plans, etc.) to ensure successful roll-out and acceptability of new products in the market. Successfully planned and coordinated all related training events for the development team as well as the training to roll out the product for sales, services, RIG and partners. Collaborated with ramp up organization and recruited consultants to work together on the training materials for the appropriate product release. Successfully executed multiple training events yearly for every new product release for more than 7 years educating and certifying more than 700 attendees. \nRecipient of “2006 Top Talent Award” employee recognition program. Manager - Global Product Manager for Mobile Business SAP Labs January 2005  –  July 2007  (2 years 7 months) Successfully lead a team of global product managers responsible for mobile solutions at SAP. Managed the product definition planning, captured, analyzed, consolidated and compared market requirements against SAP standard processes, and rolled-out various successful products. Successfully completed ramp-up phases of several mobile product releases and readied solutions for mass-shipment. Initiated a new composite based mobile application on emerging technology. Worked closely with customers on their overall mobile strategy, and advised and guided them through the product roadmap during pre-sales cycles. Provided customers with continuous support during the implementation phases. Successfully collaborated with internal groups such as: \n \n•Development Architects, Development, Quality Management, Ramp-up Organization, Production Unit, Software Logistics, Standard & Compliance, Sales Organizations, Solution/Global Marketing, Business Development, Partner Management, Analyst and Public Relations, Demo Support/Training, Consulting, Knowledge Management, Info Development; to perform necessary planning and execution (MRDs, PRDs, Software Requirement Specification and Design) on all necessary activities (pricing, positioning, messaging, release brochures, release plans, test plans, demos, product/solution roadmaps, localization plans, etc.) to ensure successful roll-out and acceptability of new products in the market. Successfully planned and coordinated all related training events for the development team as well as the training to roll out the product for sales, services, RIG and partners. Collaborated with ramp up organization and recruited consultants to work together on the training materials for the appropriate product release. Successfully executed multiple training events yearly for every new product release for more than 7 years educating and certifying more than 700 attendees. \nRecipient of “2006 Top Talent Award” employee recognition program. Global Product Manager / Project Manager for SAP Mobile Business SAP Labs January 2001  –  December 2005  (5 years) Worked on a virtual global product management team of 9 people within the SAP Solutions for Mobile Business. Lead several development projects for new solution releases. Coordinated development efforts across 5 countries (US, Japan, India, Germany and Canada) while virtually managing a development team of 15 successfully. Responsibilities included roll-in of market requirements, built business case, MRD, PRD, roll-out of final product, ensured project was done on time and on budget, created product specifications based on customers’ expectations, created standards compliance documentation and training materials, performed internal and external training sessions in the US and EMEA in person and at events, conducted webinars, coordinated, communicated and collaborated with various product managers across all SAP solutions and industries, provided regular reporting to a global Steering committee. Assumed multiple roles in the project management life cycle; project leader, coordinator, and risk manager. Also participated in international events, conducted and lead many workshops, focus groups, presentations and roll-out sessions. Lead influence council sessions (3 per year) to collect, review and validate market requirements with customers during the general, verticals as well as solution ASUG(s) (America’s SAP User Group). Global Product Manager / Project Manager for SAP Mobile Business SAP Labs January 2001  –  December 2005  (5 years) Worked on a virtual global product management team of 9 people within the SAP Solutions for Mobile Business. Lead several development projects for new solution releases. Coordinated development efforts across 5 countries (US, Japan, India, Germany and Canada) while virtually managing a development team of 15 successfully. Responsibilities included roll-in of market requirements, built business case, MRD, PRD, roll-out of final product, ensured project was done on time and on budget, created product specifications based on customers’ expectations, created standards compliance documentation and training materials, performed internal and external training sessions in the US and EMEA in person and at events, conducted webinars, coordinated, communicated and collaborated with various product managers across all SAP solutions and industries, provided regular reporting to a global Steering committee. Assumed multiple roles in the project management life cycle; project leader, coordinator, and risk manager. Also participated in international events, conducted and lead many workshops, focus groups, presentations and roll-out sessions. Lead influence council sessions (3 per year) to collect, review and validate market requirements with customers during the general, verticals as well as solution ASUG(s) (America’s SAP User Group). Senior Consultant - Business Information Warehouse /FI/CO/SD SAP America February 1998  –  December 2000  (2 years 11 months) Acted as consultant, lead consultant, and customer implementations project lead on several projects. Successfully implemented projects related to FI/CO, and SAP BW. BW projects spanned different areas such as SIS/SD, FI, CO, MM, & QM at enterprises in multiple industries. Managed end to end projects implementation lifecycle, which included business blueprinting, modeling, implementation, testing and rollout. Successfully supported many internal projects for major customer events such as ASUG, SAPPHIRE and TechEd; and performed many presentations and demos. Engaged in many pre-sales activities and successfully supported SAP sales team in closing various deals with Fortune 1000 companies. Senior Consultant - Business Information Warehouse /FI/CO/SD SAP America February 1998  –  December 2000  (2 years 11 months) Acted as consultant, lead consultant, and customer implementations project lead on several projects. Successfully implemented projects related to FI/CO, and SAP BW. BW projects spanned different areas such as SIS/SD, FI, CO, MM, & QM at enterprises in multiple industries. Managed end to end projects implementation lifecycle, which included business blueprinting, modeling, implementation, testing and rollout. Successfully supported many internal projects for major customer events such as ASUG, SAPPHIRE and TechEd; and performed many presentations and demos. Engaged in many pre-sales activities and successfully supported SAP sales team in closing various deals with Fortune 1000 companies. Languages French Limited working proficiency Arabic Native or bilingual proficiency French Limited working proficiency Arabic Native or bilingual proficiency French Limited working proficiency Arabic Native or bilingual proficiency Limited working proficiency Native or bilingual proficiency Skills SAP Product Management Project Management ERP Business Intelligence CRM Product Development Analytics Business Process Enterprise Software Software Project... Business Objects IT Strategy Pre-sales Integration Requirements Analysis SAP R/3 Business Process Design Master Data Management Business Analysis Enterprise Architecture Team Leadership Cloud Computing Mobile Applications Strategy Product Marketing Mobile Devices SAP ERP SaaS Consulting Testing Solution Architecture Management Partner Management ABAP Leadership Professional Services Product Lifecycle... Solution Selling Go-to-market Strategy Business Alliances SOA Sales Enablement Big Data See 29+     See less Skills  SAP Product Management Project Management ERP Business Intelligence CRM Product Development Analytics Business Process Enterprise Software Software Project... Business Objects IT Strategy Pre-sales Integration Requirements Analysis SAP R/3 Business Process Design Master Data Management Business Analysis Enterprise Architecture Team Leadership Cloud Computing Mobile Applications Strategy Product Marketing Mobile Devices SAP ERP SaaS Consulting Testing Solution Architecture Management Partner Management ABAP Leadership Professional Services Product Lifecycle... Solution Selling Go-to-market Strategy Business Alliances SOA Sales Enablement Big Data See 29+     See less SAP Product Management Project Management ERP Business Intelligence CRM Product Development Analytics Business Process Enterprise Software Software Project... Business Objects IT Strategy Pre-sales Integration Requirements Analysis SAP R/3 Business Process Design Master Data Management Business Analysis Enterprise Architecture Team Leadership Cloud Computing Mobile Applications Strategy Product Marketing Mobile Devices SAP ERP SaaS Consulting Testing Solution Architecture Management Partner Management ABAP Leadership Professional Services Product Lifecycle... Solution Selling Go-to-market Strategy Business Alliances SOA Sales Enablement Big Data See 29+     See less SAP Product Management Project Management ERP Business Intelligence CRM Product Development Analytics Business Process Enterprise Software Software Project... Business Objects IT Strategy Pre-sales Integration Requirements Analysis SAP R/3 Business Process Design Master Data Management Business Analysis Enterprise Architecture Team Leadership Cloud Computing Mobile Applications Strategy Product Marketing Mobile Devices SAP ERP SaaS Consulting Testing Solution Architecture Management Partner Management ABAP Leadership Professional Services Product Lifecycle... Solution Selling Go-to-market Strategy Business Alliances SOA Sales Enablement Big Data See 29+     See less Education Boston University Questrom School of Business MBA, MS-MIS,  Business Administration ,  and Management Information System 1995  – 1997 Boston University Bachelor of Business Administration (B.B.A.),  Finance , General 1986  – 1990 Boston University Questrom School of Business MBA, MS-MIS,  Business Administration ,  and Management Information System 1995  – 1997 Boston University Questrom School of Business MBA, MS-MIS,  Business Administration ,  and Management Information System 1995  – 1997 Boston University Questrom School of Business MBA, MS-MIS,  Business Administration ,  and Management Information System 1995  – 1997 Boston University Bachelor of Business Administration (B.B.A.),  Finance , General 1986  – 1990 Boston University Bachelor of Business Administration (B.B.A.),  Finance , General 1986  – 1990 Boston University Bachelor of Business Administration (B.B.A.),  Finance , General 1986  – 1990 ", "Summary Insightful, results-driven product manager, who knows how to increase market share and grow revenue in new enterprise software markets. Recognized as a creative leader capable of taking a product from concept to launch to industry leadership by executing marketing fundamentals across international markets.  \n \nSpecialties: Product management, acquisition targeting and diligence, portfolio management, marketing, enterprise social software, SAAS/Cloud, CRM and HCM solutions Summary Insightful, results-driven product manager, who knows how to increase market share and grow revenue in new enterprise software markets. Recognized as a creative leader capable of taking a product from concept to launch to industry leadership by executing marketing fundamentals across international markets.  \n \nSpecialties: Product management, acquisition targeting and diligence, portfolio management, marketing, enterprise social software, SAAS/Cloud, CRM and HCM solutions Insightful, results-driven product manager, who knows how to increase market share and grow revenue in new enterprise software markets. Recognized as a creative leader capable of taking a product from concept to launch to industry leadership by executing marketing fundamentals across international markets.  \n \nSpecialties: Product management, acquisition targeting and diligence, portfolio management, marketing, enterprise social software, SAAS/Cloud, CRM and HCM solutions Insightful, results-driven product manager, who knows how to increase market share and grow revenue in new enterprise software markets. Recognized as a creative leader capable of taking a product from concept to launch to industry leadership by executing marketing fundamentals across international markets.  \n \nSpecialties: Product management, acquisition targeting and diligence, portfolio management, marketing, enterprise social software, SAAS/Cloud, CRM and HCM solutions Experience Program Director, Smarter Workforce Software IBM January 2014  – Present (1 year 8 months) Launched IBM Kenexa Talent Suite in 2014, which was quickly ranked as a top talent management solution by Gartner and IDC \n \nManage team of product managers responsible for IBM Kenexa portfolio of cloud-based talent management offerings including recruiting, onboarding, learning, performance, survey and analytics Program Director, IBM Social CRM Software IBM August 2011  –  January 2014  (2 years 6 months) Led the development and execution of IBM’s offering, partnering and go-to-market strategy for applying social and analytics technology to sales, customer support and marketing solutions  \n \nPerformed due diligence including opportunity sizing, vendor comparisons, strategic positioning and business case models on five acquisition targets and one reseller deal Senior Product Manager, IBM Social Software IBM September 2006  –  August 2011  (5 years) Led the marketing, development, legal, finance, channels, support and sales teams responsible for IBM Connections, the market leader in the enterprise social software market for the last four years \n \nAnalyzed market research, competitors and customer feedback to develop product roadmap  \n \nDerived core marketing message architecture which became the basis for sales enablement, customer presentations and IBM’s Social Business campaign  \n \nEvangelized IBM’s vision of enterprise social software through press and analyst briefings and industry conference presentations \n \nDefined the pricing, packaging, license, naming, messaging and competitive positioning for five successful releases of IBM Connections in five years \n \nPerformed partner relationship due diligence including opportunity sizing, vendor comparisons, strategic positioning and business case models Senior Product Manager, IBM WebSphere Portal IBM May 2001  –  September 2006  (5 years 5 months) Product management of WebSphere Portal family of products, which launched in 2000, achieved market share leadership in 2002 and maintains that position today  \n \nLed the development of the WebSphere Portal business plan which documented the market trends, competitive landscape, business strategy, revenue plan and required execution from marketing, sales, and development \n \nDefined market messages, planned tactics and measured results for 2002 world-wide Portal campaign which had a $1.5M budget \n \nPerformed business development to close reseller relationship with BackWeb Technologies for their ProactivePortal Server in 2001 and assisted with OEM relationships with ISVs such as SSA Global, PeopleSoft, Lawson and Siebel Product Manager, IBM WebSphere Edge Server IBM February 2000  –  May 2001  (1 year 4 months) Product Manager for IBM Network Dispatcher, a load balancing software package that improves the scalability and availability of large Internet/Intranet sites  \n \nDeveloped new strategy to bundle Network Dispatcher with IBM WebSphere Edge Server after performing market analysis, competitive comparisons and channel assessment \n \nCreated collateral and messaging for the launch of WebSphere Edge Server V1.0.  \n \nCoordinated and negotiated with product development, finance and IBM Research teams to identify and prioritize breakthrough technology for the next release of Edge Server \n \nPerformed due diligence to evaluate potential OEM relationships for inclusion EdgeServer Strategy and Market Management, IBM Software IBM January 1999  –  February 2000  (1 year 2 months) Perform strategic analysis and business development for the IBM SecureWay portfolio of products with yearly revenue of $267 million \n \nDesigned methodology and executed portfolio analysis as a tool for making product investment decisions \n \nEvaluated 65 new product concepts as manager of a staged-gate, product development program. Eight of those concepts were later pursued by product marketing teams \n \nResearched, developed and presented SecureWay’s Open-source and Linux strategy to the division general manager IT Consultant Manager IBM Global Services February 1998  –  January 1999  (1 year) Managed a department of 17 Lotus Notes consultants responsible for deploying and supporting the groupware infrastructure for 50,000 IBM users. The department achieved a 99.5% availability service level agreement for 180 AIX and Intel Notes servers. \n \nReduced cost of labor for internal accounts by 20% through automation, reprioritizing tasks and winning new commercial accounts Manager, Network Engineering Department Lockheed Martin January 1993  –  June 1996  (3 years 6 months) Managed six network engineers performing LAN product evaluation for the US Environmental Protection Agency. Also worked as individual contributor on the following projects: \n \nDesign team for EPA's Distributed Network Management project \n \nDesigned X.400 messaging backbone used to integrate DEC All-in-1, Novell GroupWise, SMTP Mail, Lotus Notes, and Lotus cc:Mail for 20,000 users \n \nProject Manager for upgrading 400 EPA file servers to NetWare 4.1 Network Engineer Evernet 1989  –  1991  (2 years) Program Director, Smarter Workforce Software IBM January 2014  – Present (1 year 8 months) Launched IBM Kenexa Talent Suite in 2014, which was quickly ranked as a top talent management solution by Gartner and IDC \n \nManage team of product managers responsible for IBM Kenexa portfolio of cloud-based talent management offerings including recruiting, onboarding, learning, performance, survey and analytics Program Director, Smarter Workforce Software IBM January 2014  – Present (1 year 8 months) Launched IBM Kenexa Talent Suite in 2014, which was quickly ranked as a top talent management solution by Gartner and IDC \n \nManage team of product managers responsible for IBM Kenexa portfolio of cloud-based talent management offerings including recruiting, onboarding, learning, performance, survey and analytics Program Director, IBM Social CRM Software IBM August 2011  –  January 2014  (2 years 6 months) Led the development and execution of IBM’s offering, partnering and go-to-market strategy for applying social and analytics technology to sales, customer support and marketing solutions  \n \nPerformed due diligence including opportunity sizing, vendor comparisons, strategic positioning and business case models on five acquisition targets and one reseller deal Program Director, IBM Social CRM Software IBM August 2011  –  January 2014  (2 years 6 months) Led the development and execution of IBM’s offering, partnering and go-to-market strategy for applying social and analytics technology to sales, customer support and marketing solutions  \n \nPerformed due diligence including opportunity sizing, vendor comparisons, strategic positioning and business case models on five acquisition targets and one reseller deal Senior Product Manager, IBM Social Software IBM September 2006  –  August 2011  (5 years) Led the marketing, development, legal, finance, channels, support and sales teams responsible for IBM Connections, the market leader in the enterprise social software market for the last four years \n \nAnalyzed market research, competitors and customer feedback to develop product roadmap  \n \nDerived core marketing message architecture which became the basis for sales enablement, customer presentations and IBM’s Social Business campaign  \n \nEvangelized IBM’s vision of enterprise social software through press and analyst briefings and industry conference presentations \n \nDefined the pricing, packaging, license, naming, messaging and competitive positioning for five successful releases of IBM Connections in five years \n \nPerformed partner relationship due diligence including opportunity sizing, vendor comparisons, strategic positioning and business case models Senior Product Manager, IBM Social Software IBM September 2006  –  August 2011  (5 years) Led the marketing, development, legal, finance, channels, support and sales teams responsible for IBM Connections, the market leader in the enterprise social software market for the last four years \n \nAnalyzed market research, competitors and customer feedback to develop product roadmap  \n \nDerived core marketing message architecture which became the basis for sales enablement, customer presentations and IBM’s Social Business campaign  \n \nEvangelized IBM’s vision of enterprise social software through press and analyst briefings and industry conference presentations \n \nDefined the pricing, packaging, license, naming, messaging and competitive positioning for five successful releases of IBM Connections in five years \n \nPerformed partner relationship due diligence including opportunity sizing, vendor comparisons, strategic positioning and business case models Senior Product Manager, IBM WebSphere Portal IBM May 2001  –  September 2006  (5 years 5 months) Product management of WebSphere Portal family of products, which launched in 2000, achieved market share leadership in 2002 and maintains that position today  \n \nLed the development of the WebSphere Portal business plan which documented the market trends, competitive landscape, business strategy, revenue plan and required execution from marketing, sales, and development \n \nDefined market messages, planned tactics and measured results for 2002 world-wide Portal campaign which had a $1.5M budget \n \nPerformed business development to close reseller relationship with BackWeb Technologies for their ProactivePortal Server in 2001 and assisted with OEM relationships with ISVs such as SSA Global, PeopleSoft, Lawson and Siebel Senior Product Manager, IBM WebSphere Portal IBM May 2001  –  September 2006  (5 years 5 months) Product management of WebSphere Portal family of products, which launched in 2000, achieved market share leadership in 2002 and maintains that position today  \n \nLed the development of the WebSphere Portal business plan which documented the market trends, competitive landscape, business strategy, revenue plan and required execution from marketing, sales, and development \n \nDefined market messages, planned tactics and measured results for 2002 world-wide Portal campaign which had a $1.5M budget \n \nPerformed business development to close reseller relationship with BackWeb Technologies for their ProactivePortal Server in 2001 and assisted with OEM relationships with ISVs such as SSA Global, PeopleSoft, Lawson and Siebel Product Manager, IBM WebSphere Edge Server IBM February 2000  –  May 2001  (1 year 4 months) Product Manager for IBM Network Dispatcher, a load balancing software package that improves the scalability and availability of large Internet/Intranet sites  \n \nDeveloped new strategy to bundle Network Dispatcher with IBM WebSphere Edge Server after performing market analysis, competitive comparisons and channel assessment \n \nCreated collateral and messaging for the launch of WebSphere Edge Server V1.0.  \n \nCoordinated and negotiated with product development, finance and IBM Research teams to identify and prioritize breakthrough technology for the next release of Edge Server \n \nPerformed due diligence to evaluate potential OEM relationships for inclusion EdgeServer Product Manager, IBM WebSphere Edge Server IBM February 2000  –  May 2001  (1 year 4 months) Product Manager for IBM Network Dispatcher, a load balancing software package that improves the scalability and availability of large Internet/Intranet sites  \n \nDeveloped new strategy to bundle Network Dispatcher with IBM WebSphere Edge Server after performing market analysis, competitive comparisons and channel assessment \n \nCreated collateral and messaging for the launch of WebSphere Edge Server V1.0.  \n \nCoordinated and negotiated with product development, finance and IBM Research teams to identify and prioritize breakthrough technology for the next release of Edge Server \n \nPerformed due diligence to evaluate potential OEM relationships for inclusion EdgeServer Strategy and Market Management, IBM Software IBM January 1999  –  February 2000  (1 year 2 months) Perform strategic analysis and business development for the IBM SecureWay portfolio of products with yearly revenue of $267 million \n \nDesigned methodology and executed portfolio analysis as a tool for making product investment decisions \n \nEvaluated 65 new product concepts as manager of a staged-gate, product development program. Eight of those concepts were later pursued by product marketing teams \n \nResearched, developed and presented SecureWay’s Open-source and Linux strategy to the division general manager Strategy and Market Management, IBM Software IBM January 1999  –  February 2000  (1 year 2 months) Perform strategic analysis and business development for the IBM SecureWay portfolio of products with yearly revenue of $267 million \n \nDesigned methodology and executed portfolio analysis as a tool for making product investment decisions \n \nEvaluated 65 new product concepts as manager of a staged-gate, product development program. Eight of those concepts were later pursued by product marketing teams \n \nResearched, developed and presented SecureWay’s Open-source and Linux strategy to the division general manager IT Consultant Manager IBM Global Services February 1998  –  January 1999  (1 year) Managed a department of 17 Lotus Notes consultants responsible for deploying and supporting the groupware infrastructure for 50,000 IBM users. The department achieved a 99.5% availability service level agreement for 180 AIX and Intel Notes servers. \n \nReduced cost of labor for internal accounts by 20% through automation, reprioritizing tasks and winning new commercial accounts IT Consultant Manager IBM Global Services February 1998  –  January 1999  (1 year) Managed a department of 17 Lotus Notes consultants responsible for deploying and supporting the groupware infrastructure for 50,000 IBM users. The department achieved a 99.5% availability service level agreement for 180 AIX and Intel Notes servers. \n \nReduced cost of labor for internal accounts by 20% through automation, reprioritizing tasks and winning new commercial accounts Manager, Network Engineering Department Lockheed Martin January 1993  –  June 1996  (3 years 6 months) Managed six network engineers performing LAN product evaluation for the US Environmental Protection Agency. Also worked as individual contributor on the following projects: \n \nDesign team for EPA's Distributed Network Management project \n \nDesigned X.400 messaging backbone used to integrate DEC All-in-1, Novell GroupWise, SMTP Mail, Lotus Notes, and Lotus cc:Mail for 20,000 users \n \nProject Manager for upgrading 400 EPA file servers to NetWare 4.1 Manager, Network Engineering Department Lockheed Martin January 1993  –  June 1996  (3 years 6 months) Managed six network engineers performing LAN product evaluation for the US Environmental Protection Agency. Also worked as individual contributor on the following projects: \n \nDesign team for EPA's Distributed Network Management project \n \nDesigned X.400 messaging backbone used to integrate DEC All-in-1, Novell GroupWise, SMTP Mail, Lotus Notes, and Lotus cc:Mail for 20,000 users \n \nProject Manager for upgrading 400 EPA file servers to NetWare 4.1 Network Engineer Evernet 1989  –  1991  (2 years) Network Engineer Evernet 1989  –  1991  (2 years) Skills Enterprise Software Product Management Go-to-market Strategy Product Marketing Sales Enablement CRM Strategy Cross-functional Team... Competitive Analysis Cloud Applications Marketing Strategy Human Capital Management Social Networking Marketing Management SaaS Software Industry Social Media Cloud Computing Solution Selling Analytics Strategic Partnerships Lead Generation Channel Partners Portals Messaging Collaboration Solutions Pre-sales Solution Architecture Partner Management Business Alliances Business Development Leadership Business Acquisition Web 2.0 Mobile Devices Professional Services Enterprise Content... Business Strategy Demand Generation Product Strategy CRM software See 26+     See less Skills  Enterprise Software Product Management Go-to-market Strategy Product Marketing Sales Enablement CRM Strategy Cross-functional Team... Competitive Analysis Cloud Applications Marketing Strategy Human Capital Management Social Networking Marketing Management SaaS Software Industry Social Media Cloud Computing Solution Selling Analytics Strategic Partnerships Lead Generation Channel Partners Portals Messaging Collaboration Solutions Pre-sales Solution Architecture Partner Management Business Alliances Business Development Leadership Business Acquisition Web 2.0 Mobile Devices Professional Services Enterprise Content... Business Strategy Demand Generation Product Strategy CRM software See 26+     See less Enterprise Software Product Management Go-to-market Strategy Product Marketing Sales Enablement CRM Strategy Cross-functional Team... Competitive Analysis Cloud Applications Marketing Strategy Human Capital Management Social Networking Marketing Management SaaS Software Industry Social Media Cloud Computing Solution Selling Analytics Strategic Partnerships Lead Generation Channel Partners Portals Messaging Collaboration Solutions Pre-sales Solution Architecture Partner Management Business Alliances Business Development Leadership Business Acquisition Web 2.0 Mobile Devices Professional Services Enterprise Content... Business Strategy Demand Generation Product Strategy CRM software See 26+     See less Enterprise Software Product Management Go-to-market Strategy Product Marketing Sales Enablement CRM Strategy Cross-functional Team... Competitive Analysis Cloud Applications Marketing Strategy Human Capital Management Social Networking Marketing Management SaaS Software Industry Social Media Cloud Computing Solution Selling Analytics Strategic Partnerships Lead Generation Channel Partners Portals Messaging Collaboration Solutions Pre-sales Solution Architecture Partner Management Business Alliances Business Development Leadership Business Acquisition Web 2.0 Mobile Devices Professional Services Enterprise Content... Business Strategy Demand Generation Product Strategy CRM software See 26+     See less Education Duke University - The Fuqua School of Business MBA,  Business Administration and Management , General 1996  – 1997 Duke University BSE,  Electrical Engineering 1982  – 1986 Activities and Societies:  Duke Men's Crew (Club President) Franklin high school 1978  – 1982 Duke University - The Fuqua School of Business MBA,  Business Administration and Management , General 1996  – 1997 Duke University - The Fuqua School of Business MBA,  Business Administration and Management , General 1996  – 1997 Duke University - The Fuqua School of Business MBA,  Business Administration and Management , General 1996  – 1997 Duke University BSE,  Electrical Engineering 1982  – 1986 Activities and Societies:  Duke Men's Crew (Club President) Duke University BSE,  Electrical Engineering 1982  – 1986 Activities and Societies:  Duke Men's Crew (Club President) Duke University BSE,  Electrical Engineering 1982  – 1986 Activities and Societies:  Duke Men's Crew (Club President) Franklin high school 1978  – 1982 Franklin high school 1978  – 1982 Franklin high school 1978  – 1982 ", "Summary I have held a variety of roles within software development, including development, design, user research, and product management. I am currently the senior product manager for IBM Connections, a social software suite for businesses and organizations. In the role of senior product manager, I work to define the overall product strategy, develop and drive the product requirements with engineering and design, work with customers and partners to shape the product, and publicize the product at numerous industry events. \n \nPreviously, I worked with IBM Research Collaborative User Experience group as a user researcher on the Unified Activity Management project and a developer and usability specialist on the Reinventing Email project. Before joining IBM, I was a web application developer and ran a website development practice.  \n \nI hold an MBA with a concentration in Human Factors in Information Design, and I have a strong interest in collaboration technologies and personal and business productivity tools. Specialties:Business Strategy, Collaboration, Knowledge & Information Management, Product Development, Product Design, user experience, user research, usability, user studies, user interface design, web application development, Corporate Performance Management Summary I have held a variety of roles within software development, including development, design, user research, and product management. I am currently the senior product manager for IBM Connections, a social software suite for businesses and organizations. In the role of senior product manager, I work to define the overall product strategy, develop and drive the product requirements with engineering and design, work with customers and partners to shape the product, and publicize the product at numerous industry events. \n \nPreviously, I worked with IBM Research Collaborative User Experience group as a user researcher on the Unified Activity Management project and a developer and usability specialist on the Reinventing Email project. Before joining IBM, I was a web application developer and ran a website development practice.  \n \nI hold an MBA with a concentration in Human Factors in Information Design, and I have a strong interest in collaboration technologies and personal and business productivity tools. Specialties:Business Strategy, Collaboration, Knowledge & Information Management, Product Development, Product Design, user experience, user research, usability, user studies, user interface design, web application development, Corporate Performance Management I have held a variety of roles within software development, including development, design, user research, and product management. I am currently the senior product manager for IBM Connections, a social software suite for businesses and organizations. In the role of senior product manager, I work to define the overall product strategy, develop and drive the product requirements with engineering and design, work with customers and partners to shape the product, and publicize the product at numerous industry events. \n \nPreviously, I worked with IBM Research Collaborative User Experience group as a user researcher on the Unified Activity Management project and a developer and usability specialist on the Reinventing Email project. Before joining IBM, I was a web application developer and ran a website development practice.  \n \nI hold an MBA with a concentration in Human Factors in Information Design, and I have a strong interest in collaboration technologies and personal and business productivity tools. Specialties:Business Strategy, Collaboration, Knowledge & Information Management, Product Development, Product Design, user experience, user research, usability, user studies, user interface design, web application development, Corporate Performance Management I have held a variety of roles within software development, including development, design, user research, and product management. I am currently the senior product manager for IBM Connections, a social software suite for businesses and organizations. In the role of senior product manager, I work to define the overall product strategy, develop and drive the product requirements with engineering and design, work with customers and partners to shape the product, and publicize the product at numerous industry events. \n \nPreviously, I worked with IBM Research Collaborative User Experience group as a user researcher on the Unified Activity Management project and a developer and usability specialist on the Reinventing Email project. Before joining IBM, I was a web application developer and ran a website development practice.  \n \nI hold an MBA with a concentration in Human Factors in Information Design, and I have a strong interest in collaboration technologies and personal and business productivity tools. Specialties:Business Strategy, Collaboration, Knowledge & Information Management, Product Development, Product Design, user experience, user research, usability, user studies, user interface design, web application development, Corporate Performance Management Experience Teaching Fellow; Product Managment 101 & 102 Harvard Business School September 2014  – Present (1 year) Greater Boston Area I worked with Professor Thomas Eisenmann and course founder Prem Ramaswami to design and deliver HBS’s product management course, which employs a field-based, learning-by-doing approach. During the fall semester, in PM101, student teams assess market need for a new software product, wireframe designs, and then specify product features. During the spring semester, in PM102, teams recruit and work with developers to build the product, and then manage its launch. As a Teaching Fellow, I coached teams, evaluated and provided feedback on deliverables and presentations, led class discussions, and performed design critiques. For a full course syllabus, see https://sites.google.com/site/hbspm101/home/2014-15-sessions. Senior Product Manager, IBM Social Software IBM March 2007  – Present (8 years 6 months) As a senior product manager at IBM, I define the product requirements and strategy for IBM's market- leading social networking technology, IBM Connections. Over the past 7 years at IBM, I have been responsible for the design, research, development and market adoption of enterprise social software. I have always had a strong interest in collaboration technologies and business productivity tools, and I work with companies worldwide on social software adoption and technology integration. In addition, I speak at numerous industry events and have several publications on social software for businesses. Business Performance Management; Domain Engineer IBM Software Group December 2004  –  February 2007  (2 years 3 months) As the Domain Engineer for IBM Workplace for Business Strategy Execution (WBSE), I worked to define the overall product design and development strategy. I also collaborated with customers to evaluate how WBSE should be designed for their business needs from a functional and interface perspective. Collaborative User Experience IBM Research May 2003  –  October 2004  (1 year 6 months) * Reinventing Email: user interface development, user research, design (http://www.research.ibm.com/remail/) \n* Activity Management: participatory design, design analysis \n* Lesson Learned from the Remail Prototypes, CSCW 2004 Web Application Design and Development Aetna Group Insurance May 2000  –  August 2002  (2 years 4 months) * Interface design for internal and external web applications \n* Web developer for customer web sites \n* Application development for internal software tools and data repositories Teaching Fellow; Product Managment 101 & 102 Harvard Business School September 2014  – Present (1 year) Greater Boston Area I worked with Professor Thomas Eisenmann and course founder Prem Ramaswami to design and deliver HBS’s product management course, which employs a field-based, learning-by-doing approach. During the fall semester, in PM101, student teams assess market need for a new software product, wireframe designs, and then specify product features. During the spring semester, in PM102, teams recruit and work with developers to build the product, and then manage its launch. As a Teaching Fellow, I coached teams, evaluated and provided feedback on deliverables and presentations, led class discussions, and performed design critiques. For a full course syllabus, see https://sites.google.com/site/hbspm101/home/2014-15-sessions. Teaching Fellow; Product Managment 101 & 102 Harvard Business School September 2014  – Present (1 year) Greater Boston Area I worked with Professor Thomas Eisenmann and course founder Prem Ramaswami to design and deliver HBS’s product management course, which employs a field-based, learning-by-doing approach. During the fall semester, in PM101, student teams assess market need for a new software product, wireframe designs, and then specify product features. During the spring semester, in PM102, teams recruit and work with developers to build the product, and then manage its launch. As a Teaching Fellow, I coached teams, evaluated and provided feedback on deliverables and presentations, led class discussions, and performed design critiques. For a full course syllabus, see https://sites.google.com/site/hbspm101/home/2014-15-sessions. Senior Product Manager, IBM Social Software IBM March 2007  – Present (8 years 6 months) As a senior product manager at IBM, I define the product requirements and strategy for IBM's market- leading social networking technology, IBM Connections. Over the past 7 years at IBM, I have been responsible for the design, research, development and market adoption of enterprise social software. I have always had a strong interest in collaboration technologies and business productivity tools, and I work with companies worldwide on social software adoption and technology integration. In addition, I speak at numerous industry events and have several publications on social software for businesses. Senior Product Manager, IBM Social Software IBM March 2007  – Present (8 years 6 months) As a senior product manager at IBM, I define the product requirements and strategy for IBM's market- leading social networking technology, IBM Connections. Over the past 7 years at IBM, I have been responsible for the design, research, development and market adoption of enterprise social software. I have always had a strong interest in collaboration technologies and business productivity tools, and I work with companies worldwide on social software adoption and technology integration. In addition, I speak at numerous industry events and have several publications on social software for businesses. Business Performance Management; Domain Engineer IBM Software Group December 2004  –  February 2007  (2 years 3 months) As the Domain Engineer for IBM Workplace for Business Strategy Execution (WBSE), I worked to define the overall product design and development strategy. I also collaborated with customers to evaluate how WBSE should be designed for their business needs from a functional and interface perspective. Business Performance Management; Domain Engineer IBM Software Group December 2004  –  February 2007  (2 years 3 months) As the Domain Engineer for IBM Workplace for Business Strategy Execution (WBSE), I worked to define the overall product design and development strategy. I also collaborated with customers to evaluate how WBSE should be designed for their business needs from a functional and interface perspective. Collaborative User Experience IBM Research May 2003  –  October 2004  (1 year 6 months) * Reinventing Email: user interface development, user research, design (http://www.research.ibm.com/remail/) \n* Activity Management: participatory design, design analysis \n* Lesson Learned from the Remail Prototypes, CSCW 2004 Collaborative User Experience IBM Research May 2003  –  October 2004  (1 year 6 months) * Reinventing Email: user interface development, user research, design (http://www.research.ibm.com/remail/) \n* Activity Management: participatory design, design analysis \n* Lesson Learned from the Remail Prototypes, CSCW 2004 Web Application Design and Development Aetna Group Insurance May 2000  –  August 2002  (2 years 4 months) * Interface design for internal and external web applications \n* Web developer for customer web sites \n* Application development for internal software tools and data repositories Web Application Design and Development Aetna Group Insurance May 2000  –  August 2002  (2 years 4 months) * Interface design for internal and external web applications \n* Web developer for customer web sites \n* Application development for internal software tools and data repositories Skills User Experience Usability Testing User Interface Design Usability User Research Product Development Business Strategy Web Application Design Product Design Performance Management Cloud Computing SaaS Enterprise Software Enterprise Architecture Software Project... Messaging Solution Architecture Software Development Portals Information Architecture Human Factors Social Networking Social Software Social Collaboration User Experience Design Collaboration Public Speaking Social Media Product Management Product Leadership Product Adoption Customer Advocacy See 17+     See less Skills  User Experience Usability Testing User Interface Design Usability User Research Product Development Business Strategy Web Application Design Product Design Performance Management Cloud Computing SaaS Enterprise Software Enterprise Architecture Software Project... Messaging Solution Architecture Software Development Portals Information Architecture Human Factors Social Networking Social Software Social Collaboration User Experience Design Collaboration Public Speaking Social Media Product Management Product Leadership Product Adoption Customer Advocacy See 17+     See less User Experience Usability Testing User Interface Design Usability User Research Product Development Business Strategy Web Application Design Product Design Performance Management Cloud Computing SaaS Enterprise Software Enterprise Architecture Software Project... Messaging Solution Architecture Software Development Portals Information Architecture Human Factors Social Networking Social Software Social Collaboration User Experience Design Collaboration Public Speaking Social Media Product Management Product Leadership Product Adoption Customer Advocacy See 17+     See less User Experience Usability Testing User Interface Design Usability User Research Product Development Business Strategy Web Application Design Product Design Performance Management Cloud Computing SaaS Enterprise Software Enterprise Architecture Software Project... Messaging Solution Architecture Software Development Portals Information Architecture Human Factors Social Networking Social Software Social Collaboration User Experience Design Collaboration Public Speaking Social Media Product Management Product Leadership Product Adoption Customer Advocacy See 17+     See less Education Massachusetts Institute of Technology S.M. System Design and Management,  Engineering/Industrial Management 2013  – 2015 Jointly offered by MIT's School of Engineering and the MIT Sloan School of Management, the System Design and Management (SDM) master's program in engineering and management educates mid-career professionals to lead effectively and creatively by using systems thinking to solve large-scale, complex challenges in product design, development, and innovation. \n \nSDM provides a global mindset; a systems thinking perspective that integrates management, technology, and social sciences; and ways to lead across organizational and cultural boundaries to address rapidly accelerating complexity and change in today's global markets. \n \nThe curriculum of MIT's System Design and Management Program encompasses leadership development and critical, creative, and integrative thinking as well as an appreciation of diversity and an understanding of how to foster positive change within organizations, society at large, and — most importantly — within oneself. Bentley University MBA,  Human Factors in Information Design 2002  – 2004 Activities and Societies:  Awarded Distinction ,  VP Operations Graduate Student Association ,  Graduate Women's Leadership Organization University of Connecticut BS,  MIS September 1997  – May 2001 Activities and Societies:  President of Delta Gamma ,  UConn Ambassador ,  Director of Solicitations for the CT Children's Medical Center (Dance Marathon) ,  Greek Leadership Council Massachusetts Institute of Technology S.M. System Design and Management,  Engineering/Industrial Management 2013  – 2015 Jointly offered by MIT's School of Engineering and the MIT Sloan School of Management, the System Design and Management (SDM) master's program in engineering and management educates mid-career professionals to lead effectively and creatively by using systems thinking to solve large-scale, complex challenges in product design, development, and innovation. \n \nSDM provides a global mindset; a systems thinking perspective that integrates management, technology, and social sciences; and ways to lead across organizational and cultural boundaries to address rapidly accelerating complexity and change in today's global markets. \n \nThe curriculum of MIT's System Design and Management Program encompasses leadership development and critical, creative, and integrative thinking as well as an appreciation of diversity and an understanding of how to foster positive change within organizations, society at large, and — most importantly — within oneself. Massachusetts Institute of Technology S.M. System Design and Management,  Engineering/Industrial Management 2013  – 2015 Jointly offered by MIT's School of Engineering and the MIT Sloan School of Management, the System Design and Management (SDM) master's program in engineering and management educates mid-career professionals to lead effectively and creatively by using systems thinking to solve large-scale, complex challenges in product design, development, and innovation. \n \nSDM provides a global mindset; a systems thinking perspective that integrates management, technology, and social sciences; and ways to lead across organizational and cultural boundaries to address rapidly accelerating complexity and change in today's global markets. \n \nThe curriculum of MIT's System Design and Management Program encompasses leadership development and critical, creative, and integrative thinking as well as an appreciation of diversity and an understanding of how to foster positive change within organizations, society at large, and — most importantly — within oneself. Massachusetts Institute of Technology S.M. System Design and Management,  Engineering/Industrial Management 2013  – 2015 Jointly offered by MIT's School of Engineering and the MIT Sloan School of Management, the System Design and Management (SDM) master's program in engineering and management educates mid-career professionals to lead effectively and creatively by using systems thinking to solve large-scale, complex challenges in product design, development, and innovation. \n \nSDM provides a global mindset; a systems thinking perspective that integrates management, technology, and social sciences; and ways to lead across organizational and cultural boundaries to address rapidly accelerating complexity and change in today's global markets. \n \nThe curriculum of MIT's System Design and Management Program encompasses leadership development and critical, creative, and integrative thinking as well as an appreciation of diversity and an understanding of how to foster positive change within organizations, society at large, and — most importantly — within oneself. Bentley University MBA,  Human Factors in Information Design 2002  – 2004 Activities and Societies:  Awarded Distinction ,  VP Operations Graduate Student Association ,  Graduate Women's Leadership Organization Bentley University MBA,  Human Factors in Information Design 2002  – 2004 Activities and Societies:  Awarded Distinction ,  VP Operations Graduate Student Association ,  Graduate Women's Leadership Organization Bentley University MBA,  Human Factors in Information Design 2002  – 2004 Activities and Societies:  Awarded Distinction ,  VP Operations Graduate Student Association ,  Graduate Women's Leadership Organization University of Connecticut BS,  MIS September 1997  – May 2001 Activities and Societies:  President of Delta Gamma ,  UConn Ambassador ,  Director of Solicitations for the CT Children's Medical Center (Dance Marathon) ,  Greek Leadership Council University of Connecticut BS,  MIS September 1997  – May 2001 Activities and Societies:  President of Delta Gamma ,  UConn Ambassador ,  Director of Solicitations for the CT Children's Medical Center (Dance Marathon) ,  Greek Leadership Council University of Connecticut BS,  MIS September 1997  – May 2001 Activities and Societies:  President of Delta Gamma ,  UConn Ambassador ,  Director of Solicitations for the CT Children's Medical Center (Dance Marathon) ,  Greek Leadership Council Honors & Awards MIT SDM Student Leadership Nominee Mass High Tech Woman to Watch MIT SDM Student Leadership Nominee MIT SDM Student Leadership Nominee MIT SDM Student Leadership Nominee Mass High Tech Woman to Watch Mass High Tech Woman to Watch Mass High Tech Woman to Watch ", "Languages English English English Skills Business Process Solution Architecture Solution Selling System X Pre-sales Cloud Computing Business Intelligence IT Strategy Enterprise Software Data Center IT Outsourcing SaaS IT Management ERP Marketing Outsourcing ITIL Channel Strategy IT Service Management Channel Partners Partner Management Sales Enablement Virtualization Operating Systems Product Management Storage AIX Management Business Alliances Go-to-market Strategy Business Analysis SOA Team Leadership See 19+     See less Skills  Business Process Solution Architecture Solution Selling System X Pre-sales Cloud Computing Business Intelligence IT Strategy Enterprise Software Data Center IT Outsourcing SaaS IT Management ERP Marketing Outsourcing ITIL Channel Strategy IT Service Management Channel Partners Partner Management Sales Enablement Virtualization Operating Systems Product Management Storage AIX Management Business Alliances Go-to-market Strategy Business Analysis SOA Team Leadership See 19+     See less Business Process Solution Architecture Solution Selling System X Pre-sales Cloud Computing Business Intelligence IT Strategy Enterprise Software Data Center IT Outsourcing SaaS IT Management ERP Marketing Outsourcing ITIL Channel Strategy IT Service Management Channel Partners Partner Management Sales Enablement Virtualization Operating Systems Product Management Storage AIX Management Business Alliances Go-to-market Strategy Business Analysis SOA Team Leadership See 19+     See less Business Process Solution Architecture Solution Selling System X Pre-sales Cloud Computing Business Intelligence IT Strategy Enterprise Software Data Center IT Outsourcing SaaS IT Management ERP Marketing Outsourcing ITIL Channel Strategy IT Service Management Channel Partners Partner Management Sales Enablement Virtualization Operating Systems Product Management Storage AIX Management Business Alliances Go-to-market Strategy Business Analysis SOA Team Leadership See 19+     See less ", "Summary I am the worldwide Product Manager for IBM Business MediaShare and based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nIBM Business MediaShare, the IBM Digital Asset Management enterprise solution for managing the end-to-end lifecycle of digital assets that helps customers in all industries implement projects for all functional departments across the organization. \n \nI have considerable experience of the publishing sector, particularly in the areas of Digital Asset Management and their integration with Editorial Systems. \n \nSpecialties: I have been involved in large and complex implementations around the world, covering the full project lifecycle from pre-sale, technical marketing activities, requirements study, business analysis, design and build through to implementation. \n \nI have experience in data modelling and requirements analysis. \n \nThe postings on this site are my own and don't necessarily represent IBM's positions, strategies or opinions. Summary I am the worldwide Product Manager for IBM Business MediaShare and based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nIBM Business MediaShare, the IBM Digital Asset Management enterprise solution for managing the end-to-end lifecycle of digital assets that helps customers in all industries implement projects for all functional departments across the organization. \n \nI have considerable experience of the publishing sector, particularly in the areas of Digital Asset Management and their integration with Editorial Systems. \n \nSpecialties: I have been involved in large and complex implementations around the world, covering the full project lifecycle from pre-sale, technical marketing activities, requirements study, business analysis, design and build through to implementation. \n \nI have experience in data modelling and requirements analysis. \n \nThe postings on this site are my own and don't necessarily represent IBM's positions, strategies or opinions. I am the worldwide Product Manager for IBM Business MediaShare and based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nIBM Business MediaShare, the IBM Digital Asset Management enterprise solution for managing the end-to-end lifecycle of digital assets that helps customers in all industries implement projects for all functional departments across the organization. \n \nI have considerable experience of the publishing sector, particularly in the areas of Digital Asset Management and their integration with Editorial Systems. \n \nSpecialties: I have been involved in large and complex implementations around the world, covering the full project lifecycle from pre-sale, technical marketing activities, requirements study, business analysis, design and build through to implementation. \n \nI have experience in data modelling and requirements analysis. \n \nThe postings on this site are my own and don't necessarily represent IBM's positions, strategies or opinions. I am the worldwide Product Manager for IBM Business MediaShare and based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nIBM Business MediaShare, the IBM Digital Asset Management enterprise solution for managing the end-to-end lifecycle of digital assets that helps customers in all industries implement projects for all functional departments across the organization. \n \nI have considerable experience of the publishing sector, particularly in the areas of Digital Asset Management and their integration with Editorial Systems. \n \nSpecialties: I have been involved in large and complex implementations around the world, covering the full project lifecycle from pre-sale, technical marketing activities, requirements study, business analysis, design and build through to implementation. \n \nI have experience in data modelling and requirements analysis. \n \nThe postings on this site are my own and don't necessarily represent IBM's positions, strategies or opinions. Experience IBM Business MediaShare Product Manager IBM March 2013  – Present (2 years 6 months) Rome Area, Italy I am the worldwide Product Manager for IBM Business MediaShare and based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nIBM Business Media Share, the IBM Digital Asset Management enterprise solution for managing the end-to-end lifecycle of digital assets that helps customers in all industries implement projects for all functional departments across the organization. IBM NICA Product Manager IBM June 2011  – Present (4 years 3 months) I am the worldwide Product Manager for IBM Networked Integrated Content Access, Digital Asset Management solution based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nNICA is a client/server application developed in Italy and installed at some of Europe, Asia, South and North America’s largest newspapers and magazines. NICA Business Development Program Manager IBM May 2007  –  June 2011  (4 years 2 months) I acted as worldwide Business Development Program Manager for IBM NICA, with responsibilities for the marketing and sales of the solution. IT Consultant ibm April 2003  –  April 2007  (4 years 1 month) I have considerable experience of the publishing sector, particularly in the areas of Digital Asset Management and their integration with Editorial Systems. \n \nI have been involved in large and complex implementations around the world, covering the full project lifecycle from pre-sale, technical marketing activities, requirements study, business analysis, design and build through to implementation. IT Consultant Olivetti January 1994  –  January 1996  (2 years 1 month) Consultant for ENEL (Italy’s largest power company, and Europe’s third-largest listed utility for market capitalization) IBM Business MediaShare Product Manager IBM March 2013  – Present (2 years 6 months) Rome Area, Italy I am the worldwide Product Manager for IBM Business MediaShare and based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nIBM Business Media Share, the IBM Digital Asset Management enterprise solution for managing the end-to-end lifecycle of digital assets that helps customers in all industries implement projects for all functional departments across the organization. IBM Business MediaShare Product Manager IBM March 2013  – Present (2 years 6 months) Rome Area, Italy I am the worldwide Product Manager for IBM Business MediaShare and based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nIBM Business Media Share, the IBM Digital Asset Management enterprise solution for managing the end-to-end lifecycle of digital assets that helps customers in all industries implement projects for all functional departments across the organization. IBM NICA Product Manager IBM June 2011  – Present (4 years 3 months) I am the worldwide Product Manager for IBM Networked Integrated Content Access, Digital Asset Management solution based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nNICA is a client/server application developed in Italy and installed at some of Europe, Asia, South and North America’s largest newspapers and magazines. IBM NICA Product Manager IBM June 2011  – Present (4 years 3 months) I am the worldwide Product Manager for IBM Networked Integrated Content Access, Digital Asset Management solution based in Rome smart Solutions Lab, with responsibilities for the marketing, development and support of the solution. \n \nNICA is a client/server application developed in Italy and installed at some of Europe, Asia, South and North America’s largest newspapers and magazines. NICA Business Development Program Manager IBM May 2007  –  June 2011  (4 years 2 months) I acted as worldwide Business Development Program Manager for IBM NICA, with responsibilities for the marketing and sales of the solution. NICA Business Development Program Manager IBM May 2007  –  June 2011  (4 years 2 months) I acted as worldwide Business Development Program Manager for IBM NICA, with responsibilities for the marketing and sales of the solution. IT Consultant ibm April 2003  –  April 2007  (4 years 1 month) I have considerable experience of the publishing sector, particularly in the areas of Digital Asset Management and their integration with Editorial Systems. \n \nI have been involved in large and complex implementations around the world, covering the full project lifecycle from pre-sale, technical marketing activities, requirements study, business analysis, design and build through to implementation. IT Consultant ibm April 2003  –  April 2007  (4 years 1 month) I have considerable experience of the publishing sector, particularly in the areas of Digital Asset Management and their integration with Editorial Systems. \n \nI have been involved in large and complex implementations around the world, covering the full project lifecycle from pre-sale, technical marketing activities, requirements study, business analysis, design and build through to implementation. IT Consultant Olivetti January 1994  –  January 1996  (2 years 1 month) Consultant for ENEL (Italy’s largest power company, and Europe’s third-largest listed utility for market capitalization) IT Consultant Olivetti January 1994  –  January 1996  (2 years 1 month) Consultant for ENEL (Italy’s largest power company, and Europe’s third-largest listed utility for market capitalization) Languages English English English Skills Pre-sales Publishing Integration Content Management Business Analysis Program Management Digital Asset Management SDLC Requirements Analysis Business Development Solution Architecture IT Strategy Management Cloud Computing Product Management Software Development Enterprise Software Enterprise Architecture See 3+     See less Skills  Pre-sales Publishing Integration Content Management Business Analysis Program Management Digital Asset Management SDLC Requirements Analysis Business Development Solution Architecture IT Strategy Management Cloud Computing Product Management Software Development Enterprise Software Enterprise Architecture See 3+     See less Pre-sales Publishing Integration Content Management Business Analysis Program Management Digital Asset Management SDLC Requirements Analysis Business Development Solution Architecture IT Strategy Management Cloud Computing Product Management Software Development Enterprise Software Enterprise Architecture See 3+     See less Pre-sales Publishing Integration Content Management Business Analysis Program Management Digital Asset Management SDLC Requirements Analysis Business Development Solution Architecture IT Strategy Management Cloud Computing Product Management Software Development Enterprise Software Enterprise Architecture See 3+     See less Education Università degli Studi di Napoli 'Federico II' Electronic Engineering,  Computer Science 1984  – 1991 Università degli Studi di Napoli 'Federico II' Electronic Engineering,  Computer Science 1984  – 1991 Università degli Studi di Napoli 'Federico II' Electronic Engineering,  Computer Science 1984  – 1991 Università degli Studi di Napoli 'Federico II' Electronic Engineering,  Computer Science 1984  – 1991 ", "Languages English Native or bilingual proficiency Japanese Elementary proficiency French Elementary proficiency English Native or bilingual proficiency Japanese Elementary proficiency French Elementary proficiency English Native or bilingual proficiency Japanese Elementary proficiency French Elementary proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Pre-sales Product Management Mergers SaaS Cloud Computing Agile Methodologies Product Marketing Business Development Cross-functional Team... Go-to-market Strategy Enterprise Architecture Business Analysis Software Project... Enterprise Software Business Continuity... Product Lifecycle... Competitive Analysis Strategy Solution Architecture Software Development Statistics IT Strategy Channel Taking New Products to... Mobile Devices CRM SOA Integration Management Solution Selling Mobile Applications Sales Enablement Product Development Professional Services Business Intelligence Mergers & Acquisitions Wireless Team Management Strategic Partnerships Analytics Partner Management Demand Generation Program Management Vendor Management Messaging See 30+     See less Skills  Pre-sales Product Management Mergers SaaS Cloud Computing Agile Methodologies Product Marketing Business Development Cross-functional Team... Go-to-market Strategy Enterprise Architecture Business Analysis Software Project... Enterprise Software Business Continuity... Product Lifecycle... Competitive Analysis Strategy Solution Architecture Software Development Statistics IT Strategy Channel Taking New Products to... Mobile Devices CRM SOA Integration Management Solution Selling Mobile Applications Sales Enablement Product Development Professional Services Business Intelligence Mergers & Acquisitions Wireless Team Management Strategic Partnerships Analytics Partner Management Demand Generation Program Management Vendor Management Messaging See 30+     See less Pre-sales Product Management Mergers SaaS Cloud Computing Agile Methodologies Product Marketing Business Development Cross-functional Team... Go-to-market Strategy Enterprise Architecture Business Analysis Software Project... Enterprise Software Business Continuity... Product Lifecycle... Competitive Analysis Strategy Solution Architecture Software Development Statistics IT Strategy Channel Taking New Products to... Mobile Devices CRM SOA Integration Management Solution Selling Mobile Applications Sales Enablement Product Development Professional Services Business Intelligence Mergers & Acquisitions Wireless Team Management Strategic Partnerships Analytics Partner Management Demand Generation Program Management Vendor Management Messaging See 30+     See less Pre-sales Product Management Mergers SaaS Cloud Computing Agile Methodologies Product Marketing Business Development Cross-functional Team... Go-to-market Strategy Enterprise Architecture Business Analysis Software Project... Enterprise Software Business Continuity... Product Lifecycle... Competitive Analysis Strategy Solution Architecture Software Development Statistics IT Strategy Channel Taking New Products to... Mobile Devices CRM SOA Integration Management Solution Selling Mobile Applications Sales Enablement Product Development Professional Services Business Intelligence Mergers & Acquisitions Wireless Team Management Strategic Partnerships Analytics Partner Management Demand Generation Program Management Vendor Management Messaging See 30+     See less "]}