{"position": "Product Planner", "company": "Intel Corporation", "profiles": ["Summary A Human Resources professional specializing in Mergers and Acquisitions. Expertise developed through 16 years working HR aspects of Intel’s wide variety of acquisitions. Other Intel experience bringing project management, Finance, product development, and leadership in the high-tech industry. I bring strategic thinking, process orientation, leadership and effective communication. Summary A Human Resources professional specializing in Mergers and Acquisitions. Expertise developed through 16 years working HR aspects of Intel’s wide variety of acquisitions. Other Intel experience bringing project management, Finance, product development, and leadership in the high-tech industry. I bring strategic thinking, process orientation, leadership and effective communication. A Human Resources professional specializing in Mergers and Acquisitions. Expertise developed through 16 years working HR aspects of Intel’s wide variety of acquisitions. Other Intel experience bringing project management, Finance, product development, and leadership in the high-tech industry. I bring strategic thinking, process orientation, leadership and effective communication. A Human Resources professional specializing in Mergers and Acquisitions. Expertise developed through 16 years working HR aspects of Intel’s wide variety of acquisitions. Other Intel experience bringing project management, Finance, product development, and leadership in the high-tech industry. I bring strategic thinking, process orientation, leadership and effective communication. Experience Global HR Mergers & Acquisitions Integration Project Manager Intel Corporation 1998  – Present (17 years) Program Manager, Outsourced Product Development Intel 1997  –  1998  (1 year) Project Manager, Capital Productivity (SEMATECH in Austin) Intel Corporation 1995  –  1997  (2 years) New Product Planner Intel Corporation 1991  –  1995  (4 years) Financial Analyst Intel 1988  –  1990  (2 years) Global HR Mergers & Acquisitions Integration Project Manager Intel Corporation 1998  – Present (17 years) Global HR Mergers & Acquisitions Integration Project Manager Intel Corporation 1998  – Present (17 years) Program Manager, Outsourced Product Development Intel 1997  –  1998  (1 year) Program Manager, Outsourced Product Development Intel 1997  –  1998  (1 year) Project Manager, Capital Productivity (SEMATECH in Austin) Intel Corporation 1995  –  1997  (2 years) Project Manager, Capital Productivity (SEMATECH in Austin) Intel Corporation 1995  –  1997  (2 years) New Product Planner Intel Corporation 1991  –  1995  (4 years) New Product Planner Intel Corporation 1991  –  1995  (4 years) Financial Analyst Intel 1988  –  1990  (2 years) Financial Analyst Intel 1988  –  1990  (2 years) Skills Business Analysis Mergers Strategy Mergers & Acquisitions Process Improvement Start-ups Intel Financial Analysis Cross-functional Team... Competitive Analysis Project Management Program Management Skills  Business Analysis Mergers Strategy Mergers & Acquisitions Process Improvement Start-ups Intel Financial Analysis Cross-functional Team... Competitive Analysis Project Management Program Management Business Analysis Mergers Strategy Mergers & Acquisitions Process Improvement Start-ups Intel Financial Analysis Cross-functional Team... Competitive Analysis Project Management Program Management Business Analysis Mergers Strategy Mergers & Acquisitions Process Improvement Start-ups Intel Financial Analysis Cross-functional Team... Competitive Analysis Project Management Program Management Education Golden Gate University Master of Business Administration (M.B.A.) 1990  – 1992 Brigham Young University BS 1982  – 1988 Golden Gate University Master of Business Administration (M.B.A.) 1990  – 1992 Golden Gate University Master of Business Administration (M.B.A.) 1990  – 1992 Golden Gate University Master of Business Administration (M.B.A.) 1990  – 1992 Brigham Young University BS 1982  – 1988 Brigham Young University BS 1982  – 1988 Brigham Young University BS 1982  – 1988 ", "Skills Intel Semiconductors Product Marketing Product Management Processors Product Planning Go-to-market Strategy Product Development Cross-functional Team... Product Lifecycle... Product Launch Competitive Analysis Semiconductor Industry Silicon Embedded Systems Skills  Intel Semiconductors Product Marketing Product Management Processors Product Planning Go-to-market Strategy Product Development Cross-functional Team... Product Lifecycle... Product Launch Competitive Analysis Semiconductor Industry Silicon Embedded Systems Intel Semiconductors Product Marketing Product Management Processors Product Planning Go-to-market Strategy Product Development Cross-functional Team... Product Lifecycle... Product Launch Competitive Analysis Semiconductor Industry Silicon Embedded Systems Intel Semiconductors Product Marketing Product Management Processors Product Planning Go-to-market Strategy Product Development Cross-functional Team... Product Lifecycle... Product Launch Competitive Analysis Semiconductor Industry Silicon Embedded Systems ", "Experience Product Planner Intel Corporation January 2015  – Present (8 months) UK Product Planner for Intel's Affordable Phones and Tablet platforms Senior FAE Intel Corporation May 2014  –  December 2014  (8 months) UK Senior FAE for key customer for mobile communications portfolio FAE Manager Intel Corporation April 2012  –  May 2014  (2 years 2 months) UK FAE Manager for Mobile Wireless Sales for EMEA region Account System Engineer Intel Mobile Communications February 2011  –  April 2012  (1 year 3 months) Account System Engineer Infineon Technologies May 1995  –  March 2011  (15 years 11 months) Development Engineer gec plessey semiconductors 1991  –  1995  (4 years) Product Planner Intel Corporation January 2015  – Present (8 months) UK Product Planner for Intel's Affordable Phones and Tablet platforms Product Planner Intel Corporation January 2015  – Present (8 months) UK Product Planner for Intel's Affordable Phones and Tablet platforms Senior FAE Intel Corporation May 2014  –  December 2014  (8 months) UK Senior FAE for key customer for mobile communications portfolio Senior FAE Intel Corporation May 2014  –  December 2014  (8 months) UK Senior FAE for key customer for mobile communications portfolio FAE Manager Intel Corporation April 2012  –  May 2014  (2 years 2 months) UK FAE Manager for Mobile Wireless Sales for EMEA region FAE Manager Intel Corporation April 2012  –  May 2014  (2 years 2 months) UK FAE Manager for Mobile Wireless Sales for EMEA region Account System Engineer Intel Mobile Communications February 2011  –  April 2012  (1 year 3 months) Account System Engineer Intel Mobile Communications February 2011  –  April 2012  (1 year 3 months) Account System Engineer Infineon Technologies May 1995  –  March 2011  (15 years 11 months) Account System Engineer Infineon Technologies May 1995  –  March 2011  (15 years 11 months) Development Engineer gec plessey semiconductors 1991  –  1995  (4 years) Development Engineer gec plessey semiconductors 1991  –  1995  (4 years) Skills Semiconductors Embedded Systems Semiconductor Industry Mobile Communications IC SoC Mixed Signal RF ASIC Hardware Architecture CMOS Analog Bluetooth Testing Skills  Semiconductors Embedded Systems Semiconductor Industry Mobile Communications IC SoC Mixed Signal RF ASIC Hardware Architecture CMOS Analog Bluetooth Testing Semiconductors Embedded Systems Semiconductor Industry Mobile Communications IC SoC Mixed Signal RF ASIC Hardware Architecture CMOS Analog Bluetooth Testing Semiconductors Embedded Systems Semiconductor Industry Mobile Communications IC SoC Mixed Signal RF ASIC Hardware Architecture CMOS Analog Bluetooth Testing Education Loughborough University 1988  – 1990 Loughborough University 1988  – 1990 Loughborough University 1988  – 1990 Loughborough University 1988  – 1990 ", "Experience Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Skills Ethernet Product Marketing VLSI Product Development Problem Solving Competitive Analysis Verilog Product Planning Product Strategy Strategic Planning Embedded Systems Product Management Semiconductors Intel Telecommunications Strategy SoC See 2+     See less Skills  Ethernet Product Marketing VLSI Product Development Problem Solving Competitive Analysis Verilog Product Planning Product Strategy Strategic Planning Embedded Systems Product Management Semiconductors Intel Telecommunications Strategy SoC See 2+     See less Ethernet Product Marketing VLSI Product Development Problem Solving Competitive Analysis Verilog Product Planning Product Strategy Strategic Planning Embedded Systems Product Management Semiconductors Intel Telecommunications Strategy SoC See 2+     See less Ethernet Product Marketing VLSI Product Development Problem Solving Competitive Analysis Verilog Product Planning Product Strategy Strategic Planning Embedded Systems Product Management Semiconductors Intel Telecommunications Strategy SoC See 2+     See less ", "Experience Server and Workstation Product Planner Intel Corporation October 2006  – Present (8 years 11 months) Server and Workstation Product Planner Intel Corporation October 2006  – Present (8 years 11 months) Server and Workstation Product Planner Intel Corporation October 2006  – Present (8 years 11 months) ", "Experience New Product Planner Intel Corporation New Product Planner Intel Corporation New Product Planner Intel Corporation Education University of Phoenix 2003  – 2006 University of Phoenix 2003  – 2006 University of Phoenix 2003  – 2006 University of Phoenix 2003  – 2006 ", "Summary Product planning & marketing professional with broad experience in both consumer electronics and personal computers. At my best in small, smart, and fast teams. Summary Product planning & marketing professional with broad experience in both consumer electronics and personal computers. At my best in small, smart, and fast teams. Product planning & marketing professional with broad experience in both consumer electronics and personal computers. At my best in small, smart, and fast teams. Product planning & marketing professional with broad experience in both consumer electronics and personal computers. At my best in small, smart, and fast teams. Experience Senior Staff Strategic Planner Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon Staff Product Planner Intel Corporation June 2004  –  March 2015  (10 years 10 months) Hillsboro, Oregon Senior Product Marketing Engineer Intel Corporation August 1999  –  July 2004  (5 years) Hillsboro, Oregon Product Marketing Associate Panasonic July 1994  –  July 1997  (3 years 1 month) Osaka, Japan Corporate Planning Analyst Panasonic September 1992  –  July 1994  (1 year 11 months) Osaka, Japan Senior Staff Strategic Planner Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon Senior Staff Strategic Planner Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon Staff Product Planner Intel Corporation June 2004  –  March 2015  (10 years 10 months) Hillsboro, Oregon Staff Product Planner Intel Corporation June 2004  –  March 2015  (10 years 10 months) Hillsboro, Oregon Senior Product Marketing Engineer Intel Corporation August 1999  –  July 2004  (5 years) Hillsboro, Oregon Senior Product Marketing Engineer Intel Corporation August 1999  –  July 2004  (5 years) Hillsboro, Oregon Product Marketing Associate Panasonic July 1994  –  July 1997  (3 years 1 month) Osaka, Japan Product Marketing Associate Panasonic July 1994  –  July 1997  (3 years 1 month) Osaka, Japan Corporate Planning Analyst Panasonic September 1992  –  July 1994  (1 year 11 months) Osaka, Japan Corporate Planning Analyst Panasonic September 1992  –  July 1994  (1 year 11 months) Osaka, Japan Languages Japanese (4 years in college+ 5 years ex-pat, but now very rusty) Japanese (4 years in college+ 5 years ex-pat, but now very rusty) Japanese (4 years in college+ 5 years ex-pat, but now very rusty) Skills Program Management Competitive Analysis Product Marketing Product Development Product Management Consumer Electronics Strategic Planning Marketing Management Cross-functional Team... Strategic Partnerships Product Planning Mobile Devices Business Strategy Go-to-market Strategy Skills  Program Management Competitive Analysis Product Marketing Product Development Product Management Consumer Electronics Strategic Planning Marketing Management Cross-functional Team... Strategic Partnerships Product Planning Mobile Devices Business Strategy Go-to-market Strategy Program Management Competitive Analysis Product Marketing Product Development Product Management Consumer Electronics Strategic Planning Marketing Management Cross-functional Team... Strategic Partnerships Product Planning Mobile Devices Business Strategy Go-to-market Strategy Program Management Competitive Analysis Product Marketing Product Development Product Management Consumer Electronics Strategic Planning Marketing Management Cross-functional Team... Strategic Partnerships Product Planning Mobile Devices Business Strategy Go-to-market Strategy Education University of California, Berkeley, Haas School of Business MBA 1997  – 1999 University of California, Berkeley BA 1988  – 1992 International Christian University 1990  – 1991 Iolani School High School degree 1980  – 1988 University of California, Berkeley, Haas School of Business MBA 1997  – 1999 University of California, Berkeley, Haas School of Business MBA 1997  – 1999 University of California, Berkeley, Haas School of Business MBA 1997  – 1999 University of California, Berkeley BA 1988  – 1992 University of California, Berkeley BA 1988  – 1992 University of California, Berkeley BA 1988  – 1992 International Christian University 1990  – 1991 International Christian University 1990  – 1991 International Christian University 1990  – 1991 Iolani School High School degree 1980  – 1988 Iolani School High School degree 1980  – 1988 Iolani School High School degree 1980  – 1988 ", "Experience Supply Chain Analyst Intel Corporation Product Planner Intel Corporation 2013  –  2015  (2 years) Product Planner Intel Corporation 2013  –  2015  (2 years) Supply Chain Analyst Intel Corporation Supply Chain Analyst Intel Corporation Product Planner Intel Corporation 2013  –  2015  (2 years) Product Planner Intel Corporation 2013  –  2015  (2 years) Product Planner Intel Corporation 2013  –  2015  (2 years) Product Planner Intel Corporation 2013  –  2015  (2 years) Skills Microsoft Office PowerPoint Microsoft Excel Microsoft Word Research English Teamwork Economics Social Media Customer Service Public Speaking International Relations Presentations Negotiation Leadership Online Research See 1+     See less Skills  Microsoft Office PowerPoint Microsoft Excel Microsoft Word Research English Teamwork Economics Social Media Customer Service Public Speaking International Relations Presentations Negotiation Leadership Online Research See 1+     See less Microsoft Office PowerPoint Microsoft Excel Microsoft Word Research English Teamwork Economics Social Media Customer Service Public Speaking International Relations Presentations Negotiation Leadership Online Research See 1+     See less Microsoft Office PowerPoint Microsoft Excel Microsoft Word Research English Teamwork Economics Social Media Customer Service Public Speaking International Relations Presentations Negotiation Leadership Online Research See 1+     See less Education Macquarie University Master Of Commerce,  Business Management and Organizations , 3.25 2011  – 2012 Course work includes Managing people at work; Strategic Operations management; Behavior in Organizations; Managing Cultural Diversity in Business and Investment RMIT University Bachelor of Commerce (B.Com.),  Entrepreneurship/Entrepreneurial Studies , 3.44 2009  – 2011 Macquarie University Master Of Commerce,  Business Management and Organizations , 3.25 2011  – 2012 Course work includes Managing people at work; Strategic Operations management; Behavior in Organizations; Managing Cultural Diversity in Business and Investment Macquarie University Master Of Commerce,  Business Management and Organizations , 3.25 2011  – 2012 Course work includes Managing people at work; Strategic Operations management; Behavior in Organizations; Managing Cultural Diversity in Business and Investment Macquarie University Master Of Commerce,  Business Management and Organizations , 3.25 2011  – 2012 Course work includes Managing people at work; Strategic Operations management; Behavior in Organizations; Managing Cultural Diversity in Business and Investment RMIT University Bachelor of Commerce (B.Com.),  Entrepreneurship/Entrepreneurial Studies , 3.44 2009  – 2011 RMIT University Bachelor of Commerce (B.Com.),  Entrepreneurship/Entrepreneurial Studies , 3.44 2009  – 2011 RMIT University Bachelor of Commerce (B.Com.),  Entrepreneurship/Entrepreneurial Studies , 3.44 2009  – 2011 Honors & Awards Additional Honors & Awards - Won the first prize of ‘Accounting Quiz Competition’ conducted by the coordination between RMIT and Ernst & Young in 2009. \n- Bronze Certificate as SLAM Mentor (RMIT Student Learning Advisor Mentor for Price & Markets course). Additional Honors & Awards - Won the first prize of ‘Accounting Quiz Competition’ conducted by the coordination between RMIT and Ernst & Young in 2009. \n- Bronze Certificate as SLAM Mentor (RMIT Student Learning Advisor Mentor for Price & Markets course). Additional Honors & Awards - Won the first prize of ‘Accounting Quiz Competition’ conducted by the coordination between RMIT and Ernst & Young in 2009. \n- Bronze Certificate as SLAM Mentor (RMIT Student Learning Advisor Mentor for Price & Markets course). Additional Honors & Awards - Won the first prize of ‘Accounting Quiz Competition’ conducted by the coordination between RMIT and Ernst & Young in 2009. \n- Bronze Certificate as SLAM Mentor (RMIT Student Learning Advisor Mentor for Price & Markets course). ", "Skills Manufacturing Product Development Supply Chain Management Skills  Manufacturing Product Development Supply Chain Management Manufacturing Product Development Supply Chain Management Manufacturing Product Development Supply Chain Management ", "Skills Cross-functional Team... Mobile Devices Product Development Product Management Product Marketing Semiconductors Start-ups Strategic Planning Strategy Skills  Cross-functional Team... Mobile Devices Product Development Product Management Product Marketing Semiconductors Start-ups Strategic Planning Strategy Cross-functional Team... Mobile Devices Product Development Product Management Product Marketing Semiconductors Start-ups Strategic Planning Strategy Cross-functional Team... Mobile Devices Product Development Product Management Product Marketing Semiconductors Start-ups Strategic Planning Strategy ", "Experience New Product Planner Intel Corporation New Product Planner Intel Corporation New Product Planner Intel Corporation ", "Experience Mobile Product Planner Intel Corporation Mobile Product Planner Intel Corporation Mobile Product Planner Intel Corporation ", "Experience New Product Planner Intel Corporation New Product Planner Intel Corporation New Product Planner Intel Corporation ", "Experience New Product Planner Intel Corporation June 2011  – Present (4 years 3 months) Portland, Oregon Area New Product Planner Intel Corporation June 2011  – Present (4 years 3 months) Portland, Oregon Area New Product Planner Intel Corporation June 2011  – Present (4 years 3 months) Portland, Oregon Area Skills Supply Management Continuous Improvement Manufacturing Lean Manufacturing Cross-functional Team... MRP Supply Chain Supply Chain Management Skills  Supply Management Continuous Improvement Manufacturing Lean Manufacturing Cross-functional Team... MRP Supply Chain Supply Chain Management Supply Management Continuous Improvement Manufacturing Lean Manufacturing Cross-functional Team... MRP Supply Chain Supply Chain Management Supply Management Continuous Improvement Manufacturing Lean Manufacturing Cross-functional Team... MRP Supply Chain Supply Chain Management Education Oregon Institute of Technology B.S.,  Operations Management 2007  – 2011 Universidad Mayor de San Simón B.S.,  Industrial Engineering 2001  – 2006 Oregon Institute of Technology B.S.,  Operations Management 2007  – 2011 Oregon Institute of Technology B.S.,  Operations Management 2007  – 2011 Oregon Institute of Technology B.S.,  Operations Management 2007  – 2011 Universidad Mayor de San Simón B.S.,  Industrial Engineering 2001  – 2006 Universidad Mayor de San Simón B.S.,  Industrial Engineering 2001  – 2006 Universidad Mayor de San Simón B.S.,  Industrial Engineering 2001  – 2006 ", "Experience New Product Planner Intel Corporation November 2008  – Present (6 years 10 months) Intel architecture CPU New Product Planning supports all of Intel CPU microprocessors including desktop, server, mobile and Low Power applications. NPPs play a key role in the product development teams (PDT) for these products from early design to product launch. In this position, I am will be responsible for the supply chain coordination and startup activities for an Intel CPU product line from initial prototype production through introduction to high volume manufacturing. Supply Chain Specialist The Boeing Company July 2007  –  November 2008  (1 year 5 months) In this position I work at the organizational level to administer such product support processes as, integrated support plans, post-production support plans, and fielding plans. Investigate and develop solutions to such problems as support planning and analysis; estimating; scheduling; and tracking repair, overhaul, lease, and exchange activities. Participate in the analysis, definition, and implementation of new and revised support systems, processes, and policies. Manufacturing Technicial Intel Corporation July 2005  –  July 2007  (2 years 1 month) I work at the Assembly and Test Development facility and am responsible for processing material according to complex, but documented procedures, collecting and entering data, monitoring the operations, and maintaining process and metrology equipment.  \n-Identified an issue with epoxy material being wasted on each shift. Conducted an investigation that revealed over $400K of material being thrown away per year. Developed a presentation with a proposal for waste reduction implementation, which incorporated alternative cost structures with identified risks and gaps. Based on these efforts, manufacturing is now partnering with finance to intercept the 1268 platform in an effort to implement the proposed cost reductions that will save an estimated $1.8M over 5 years. \n-Epoxy 5S team. Works with his peers to drive the fundamentals of 5S, and role model the activities and mindset in the area. Work to insure the area is in a consistent state of order and compliant with all 5S expectations Warehouse Supervisor BAX Global SCM February 2002  –  July 2005  (3 years 6 months) As Warehouse Supervisor I was responsible for 23 direct reports across all shifts in a 24x7 operation. I managed the Inventory Control and Stockroom operations and was responsible for the accuracy of the inventory and adherence to my company’s Service Level Agreements with Intel. New Product Planner Intel Corporation November 2008  – Present (6 years 10 months) Intel architecture CPU New Product Planning supports all of Intel CPU microprocessors including desktop, server, mobile and Low Power applications. NPPs play a key role in the product development teams (PDT) for these products from early design to product launch. In this position, I am will be responsible for the supply chain coordination and startup activities for an Intel CPU product line from initial prototype production through introduction to high volume manufacturing. New Product Planner Intel Corporation November 2008  – Present (6 years 10 months) Intel architecture CPU New Product Planning supports all of Intel CPU microprocessors including desktop, server, mobile and Low Power applications. NPPs play a key role in the product development teams (PDT) for these products from early design to product launch. In this position, I am will be responsible for the supply chain coordination and startup activities for an Intel CPU product line from initial prototype production through introduction to high volume manufacturing. Supply Chain Specialist The Boeing Company July 2007  –  November 2008  (1 year 5 months) In this position I work at the organizational level to administer such product support processes as, integrated support plans, post-production support plans, and fielding plans. Investigate and develop solutions to such problems as support planning and analysis; estimating; scheduling; and tracking repair, overhaul, lease, and exchange activities. Participate in the analysis, definition, and implementation of new and revised support systems, processes, and policies. Supply Chain Specialist The Boeing Company July 2007  –  November 2008  (1 year 5 months) In this position I work at the organizational level to administer such product support processes as, integrated support plans, post-production support plans, and fielding plans. Investigate and develop solutions to such problems as support planning and analysis; estimating; scheduling; and tracking repair, overhaul, lease, and exchange activities. Participate in the analysis, definition, and implementation of new and revised support systems, processes, and policies. Manufacturing Technicial Intel Corporation July 2005  –  July 2007  (2 years 1 month) I work at the Assembly and Test Development facility and am responsible for processing material according to complex, but documented procedures, collecting and entering data, monitoring the operations, and maintaining process and metrology equipment.  \n-Identified an issue with epoxy material being wasted on each shift. Conducted an investigation that revealed over $400K of material being thrown away per year. Developed a presentation with a proposal for waste reduction implementation, which incorporated alternative cost structures with identified risks and gaps. Based on these efforts, manufacturing is now partnering with finance to intercept the 1268 platform in an effort to implement the proposed cost reductions that will save an estimated $1.8M over 5 years. \n-Epoxy 5S team. Works with his peers to drive the fundamentals of 5S, and role model the activities and mindset in the area. Work to insure the area is in a consistent state of order and compliant with all 5S expectations Manufacturing Technicial Intel Corporation July 2005  –  July 2007  (2 years 1 month) I work at the Assembly and Test Development facility and am responsible for processing material according to complex, but documented procedures, collecting and entering data, monitoring the operations, and maintaining process and metrology equipment.  \n-Identified an issue with epoxy material being wasted on each shift. Conducted an investigation that revealed over $400K of material being thrown away per year. Developed a presentation with a proposal for waste reduction implementation, which incorporated alternative cost structures with identified risks and gaps. Based on these efforts, manufacturing is now partnering with finance to intercept the 1268 platform in an effort to implement the proposed cost reductions that will save an estimated $1.8M over 5 years. \n-Epoxy 5S team. Works with his peers to drive the fundamentals of 5S, and role model the activities and mindset in the area. Work to insure the area is in a consistent state of order and compliant with all 5S expectations Warehouse Supervisor BAX Global SCM February 2002  –  July 2005  (3 years 6 months) As Warehouse Supervisor I was responsible for 23 direct reports across all shifts in a 24x7 operation. I managed the Inventory Control and Stockroom operations and was responsible for the accuracy of the inventory and adherence to my company’s Service Level Agreements with Intel. Warehouse Supervisor BAX Global SCM February 2002  –  July 2005  (3 years 6 months) As Warehouse Supervisor I was responsible for 23 direct reports across all shifts in a 24x7 operation. I managed the Inventory Control and Stockroom operations and was responsible for the accuracy of the inventory and adherence to my company’s Service Level Agreements with Intel. Education Penn State University Graduate Certificate,  Supply Chain & Information Systems 2008  – 2008 Arizona State University Bachelor of Interdisciplinary Studies,  Economcis & Psychology 2001  – 2007 Penn State University Graduate Certificate,  Supply Chain & Information Systems 2008  – 2008 Penn State University Graduate Certificate,  Supply Chain & Information Systems 2008  – 2008 Penn State University Graduate Certificate,  Supply Chain & Information Systems 2008  – 2008 Arizona State University Bachelor of Interdisciplinary Studies,  Economcis & Psychology 2001  – 2007 Arizona State University Bachelor of Interdisciplinary Studies,  Economcis & Psychology 2001  – 2007 Arizona State University Bachelor of Interdisciplinary Studies,  Economcis & Psychology 2001  – 2007 ", "Experience Product Planner Intel Corporation July 1994  – Present (21 years 2 months) Product Planner Intel Corporation July 1994  – Present (21 years 2 months) Product Planner Intel Corporation July 1994  – Present (21 years 2 months) Skills Product Management Project Planning Semiconductors Cross-functional Team... Manufacturing Process Improvement Program Management Skills  Product Management Project Planning Semiconductors Cross-functional Team... Manufacturing Process Improvement Program Management Product Management Project Planning Semiconductors Cross-functional Team... Manufacturing Process Improvement Program Management Product Management Project Planning Semiconductors Cross-functional Team... Manufacturing Process Improvement Program Management ", "Languages English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Go-to-market Strategy Product Development Product Management Broadband Product Planning IPTV Set Top Box Strategic Partnerships Video IP Middleware Program Management DSL SoC Business Development Embedded Systems Strategic Planning Consumer Electronics Telecommunications Mobile Devices Management Streaming Media Integration Product Marketing Digital TV See 10+     See less Skills  Go-to-market Strategy Product Development Product Management Broadband Product Planning IPTV Set Top Box Strategic Partnerships Video IP Middleware Program Management DSL SoC Business Development Embedded Systems Strategic Planning Consumer Electronics Telecommunications Mobile Devices Management Streaming Media Integration Product Marketing Digital TV See 10+     See less Go-to-market Strategy Product Development Product Management Broadband Product Planning IPTV Set Top Box Strategic Partnerships Video IP Middleware Program Management DSL SoC Business Development Embedded Systems Strategic Planning Consumer Electronics Telecommunications Mobile Devices Management Streaming Media Integration Product Marketing Digital TV See 10+     See less Go-to-market Strategy Product Development Product Management Broadband Product Planning IPTV Set Top Box Strategic Partnerships Video IP Middleware Program Management DSL SoC Business Development Embedded Systems Strategic Planning Consumer Electronics Telecommunications Mobile Devices Management Streaming Media Integration Product Marketing Digital TV See 10+     See less ", "Summary An experienced supply chain professional with many years in supply chain management with companies that range from high tech to forestry/agriculture to consumer products. I have managed both retail and commercial systems. My experience includes all engineering and technical aspects of products, low cost country sourcing, centralized and global supply chain development. \nSpecialties: Supply chain management, sourcing, negotiations, out/in sourcing, supplier quality, purchasing, contracts, international business, logistics, compliance. Summary An experienced supply chain professional with many years in supply chain management with companies that range from high tech to forestry/agriculture to consumer products. I have managed both retail and commercial systems. My experience includes all engineering and technical aspects of products, low cost country sourcing, centralized and global supply chain development. \nSpecialties: Supply chain management, sourcing, negotiations, out/in sourcing, supplier quality, purchasing, contracts, international business, logistics, compliance. An experienced supply chain professional with many years in supply chain management with companies that range from high tech to forestry/agriculture to consumer products. I have managed both retail and commercial systems. My experience includes all engineering and technical aspects of products, low cost country sourcing, centralized and global supply chain development. \nSpecialties: Supply chain management, sourcing, negotiations, out/in sourcing, supplier quality, purchasing, contracts, international business, logistics, compliance. An experienced supply chain professional with many years in supply chain management with companies that range from high tech to forestry/agriculture to consumer products. I have managed both retail and commercial systems. My experience includes all engineering and technical aspects of products, low cost country sourcing, centralized and global supply chain development. \nSpecialties: Supply chain management, sourcing, negotiations, out/in sourcing, supplier quality, purchasing, contracts, international business, logistics, compliance. Experience Logistics Supplier Manager ASML 2014  – Present (1 year) San Diego, California Work alongside suppliers to meet demand in a timely and cost effective way while insuring product quality. Drive suppliers towards competitive Supply Chain performance. Focus on the reliability, flexibility, and cycle time reduction of the supply while understanding and controlling the risks within the supply chain. Principal Consultant Linc Supply Chain Consulting October 2008  – Present (6 years 11 months) Greater San Diego Area Supply Chain consultant working with global manufacturers to improve their ability to onboard products to meet quality, timeliness, and cost targets. Director of Supply Chain Licensed apparel, toys, and accessories May 2013  –  December 2013  (8 months) Poway, CA Increased production output by 160% and help grow annual revenue to $50M. Improved inventory turns from 3 to 9 with dynamic inventory modeling. Reduced total cost of purchased items while refining the import and compliance process. Introduced S&OP plans. Increased 2013 profit by 20% by initiating product redesign. Improved Cash Conversion cycle by 72 days. Decreased product backlog by 50% by working with internal stake holders to meet customer demands. Sr. Supply Chain Buyer Cascade Microtech May 2012  –  May 2013  (1 year 1 month) Beaverton, Oregon Manage supply chain by creating supplier performance modeling, Inventory turn optimization, and reducing total cost of ownership. Negotiated pass through pricing. Established Best Known Methodology process to help achieve lowest total cost, inventory turns, and improved supplier quality and performance. Supplier Development Engineer Blount October 2008  –  May 2012  (3 years 8 months) Portland, Oregon Area Manage supply chain by leading low cost country sourcing while improving supply chain performance in support of manufacturing and retail channel. I have extensive use of SAP to achieve lowest total cost of ownership through reducing cost of poor quality and supply chain configuration. Established quality control, planning, and manufacturing systems at supply base to reach quality and cost targets with strong understanding of cost elements and drivers to lower total cost of ownership. Quality Engineering Manager Merix July 2006  –  October 2008  (2 years 4 months) Forest Grove, Oregon Own customer yields at Oregon Factories. Created Quality Engineering team to develop production plans to optimize customer design requirements. Managed global UL compliance requirements and centralized our UL management to a single file to improve time to market and reduce compliance cost. Managed global supply chain of raw material quality through use of SPC, FMEA, DOE and other tools and concepts. Help meet and maintain ISO requirements. Develop relationships with supply base to meet continuous improvement targets and maximize our ROI. Ensure supply chain can meet worldwide requirements. Manage capacity utilization; resolve scheduling conflicts, and balance supplier/customer demand/delivery expectations for product life cycle. \n \nSupplier Quality Engineer July 2006 – November 2007 (1 year 5 months) \n \nSource raw materials and improve incoming quality of raw materials. Manage global UL product files, testing, and product marking Supplier Quality Engineer Intel July 2004  –  July 2006  (2 years 1 month) Manage Intel retail supply chain to improve quality, cost, and time to market. Extensive use of CIP’s (Continual Improvement Plans) and CAP’s (Corrective Action Plans) to align supplier performance with Intel goals. Help launched overseas operations in China and the Netherlands with local and global supplied sources. New Product Planner Intel Corporation March 2001  –  July 2004  (3 years 5 months) Hillsboro, Oregon Project manager for New Product Introduction (NPI) in server and workstation products. Ownership of manufacturing IC's internally or externally to meet time to market targets. Established one of the first foundry chips to utilize excess internal capacity while also moving production outside of internal fab to meet technological requirements. Opened Philippine planning facility to meet fab and assembly support while lowering cost and improving response time. Ultra Pure Water Reverse Osmosis & Acid Waste Intel Corporation September 1997  –  July 2000  (2 years 11 months) Built and ran the RODI/AWN plant to support semiconductor fab while exceeding 18 megohm resistivity. RODI &AWN Plant lead US Filter October 1995  –  September 1997  (2 years) Built and ran the RODI/AWN plant to support semiconductor fab while exceeding 18 megohm resistivity. Logistics Supplier Manager ASML 2014  – Present (1 year) San Diego, California Work alongside suppliers to meet demand in a timely and cost effective way while insuring product quality. Drive suppliers towards competitive Supply Chain performance. Focus on the reliability, flexibility, and cycle time reduction of the supply while understanding and controlling the risks within the supply chain. Logistics Supplier Manager ASML 2014  – Present (1 year) San Diego, California Work alongside suppliers to meet demand in a timely and cost effective way while insuring product quality. Drive suppliers towards competitive Supply Chain performance. Focus on the reliability, flexibility, and cycle time reduction of the supply while understanding and controlling the risks within the supply chain. Principal Consultant Linc Supply Chain Consulting October 2008  – Present (6 years 11 months) Greater San Diego Area Supply Chain consultant working with global manufacturers to improve their ability to onboard products to meet quality, timeliness, and cost targets. Principal Consultant Linc Supply Chain Consulting October 2008  – Present (6 years 11 months) Greater San Diego Area Supply Chain consultant working with global manufacturers to improve their ability to onboard products to meet quality, timeliness, and cost targets. Director of Supply Chain Licensed apparel, toys, and accessories May 2013  –  December 2013  (8 months) Poway, CA Increased production output by 160% and help grow annual revenue to $50M. Improved inventory turns from 3 to 9 with dynamic inventory modeling. Reduced total cost of purchased items while refining the import and compliance process. Introduced S&OP plans. Increased 2013 profit by 20% by initiating product redesign. Improved Cash Conversion cycle by 72 days. Decreased product backlog by 50% by working with internal stake holders to meet customer demands. Director of Supply Chain Licensed apparel, toys, and accessories May 2013  –  December 2013  (8 months) Poway, CA Increased production output by 160% and help grow annual revenue to $50M. Improved inventory turns from 3 to 9 with dynamic inventory modeling. Reduced total cost of purchased items while refining the import and compliance process. Introduced S&OP plans. Increased 2013 profit by 20% by initiating product redesign. Improved Cash Conversion cycle by 72 days. Decreased product backlog by 50% by working with internal stake holders to meet customer demands. Sr. Supply Chain Buyer Cascade Microtech May 2012  –  May 2013  (1 year 1 month) Beaverton, Oregon Manage supply chain by creating supplier performance modeling, Inventory turn optimization, and reducing total cost of ownership. Negotiated pass through pricing. Established Best Known Methodology process to help achieve lowest total cost, inventory turns, and improved supplier quality and performance. Sr. Supply Chain Buyer Cascade Microtech May 2012  –  May 2013  (1 year 1 month) Beaverton, Oregon Manage supply chain by creating supplier performance modeling, Inventory turn optimization, and reducing total cost of ownership. Negotiated pass through pricing. Established Best Known Methodology process to help achieve lowest total cost, inventory turns, and improved supplier quality and performance. Supplier Development Engineer Blount October 2008  –  May 2012  (3 years 8 months) Portland, Oregon Area Manage supply chain by leading low cost country sourcing while improving supply chain performance in support of manufacturing and retail channel. I have extensive use of SAP to achieve lowest total cost of ownership through reducing cost of poor quality and supply chain configuration. Established quality control, planning, and manufacturing systems at supply base to reach quality and cost targets with strong understanding of cost elements and drivers to lower total cost of ownership. Supplier Development Engineer Blount October 2008  –  May 2012  (3 years 8 months) Portland, Oregon Area Manage supply chain by leading low cost country sourcing while improving supply chain performance in support of manufacturing and retail channel. I have extensive use of SAP to achieve lowest total cost of ownership through reducing cost of poor quality and supply chain configuration. Established quality control, planning, and manufacturing systems at supply base to reach quality and cost targets with strong understanding of cost elements and drivers to lower total cost of ownership. Quality Engineering Manager Merix July 2006  –  October 2008  (2 years 4 months) Forest Grove, Oregon Own customer yields at Oregon Factories. Created Quality Engineering team to develop production plans to optimize customer design requirements. Managed global UL compliance requirements and centralized our UL management to a single file to improve time to market and reduce compliance cost. Managed global supply chain of raw material quality through use of SPC, FMEA, DOE and other tools and concepts. Help meet and maintain ISO requirements. Develop relationships with supply base to meet continuous improvement targets and maximize our ROI. Ensure supply chain can meet worldwide requirements. Manage capacity utilization; resolve scheduling conflicts, and balance supplier/customer demand/delivery expectations for product life cycle. \n \nSupplier Quality Engineer July 2006 – November 2007 (1 year 5 months) \n \nSource raw materials and improve incoming quality of raw materials. Manage global UL product files, testing, and product marking Quality Engineering Manager Merix July 2006  –  October 2008  (2 years 4 months) Forest Grove, Oregon Own customer yields at Oregon Factories. Created Quality Engineering team to develop production plans to optimize customer design requirements. Managed global UL compliance requirements and centralized our UL management to a single file to improve time to market and reduce compliance cost. Managed global supply chain of raw material quality through use of SPC, FMEA, DOE and other tools and concepts. Help meet and maintain ISO requirements. Develop relationships with supply base to meet continuous improvement targets and maximize our ROI. Ensure supply chain can meet worldwide requirements. Manage capacity utilization; resolve scheduling conflicts, and balance supplier/customer demand/delivery expectations for product life cycle. \n \nSupplier Quality Engineer July 2006 – November 2007 (1 year 5 months) \n \nSource raw materials and improve incoming quality of raw materials. Manage global UL product files, testing, and product marking Supplier Quality Engineer Intel July 2004  –  July 2006  (2 years 1 month) Manage Intel retail supply chain to improve quality, cost, and time to market. Extensive use of CIP’s (Continual Improvement Plans) and CAP’s (Corrective Action Plans) to align supplier performance with Intel goals. Help launched overseas operations in China and the Netherlands with local and global supplied sources. Supplier Quality Engineer Intel July 2004  –  July 2006  (2 years 1 month) Manage Intel retail supply chain to improve quality, cost, and time to market. Extensive use of CIP’s (Continual Improvement Plans) and CAP’s (Corrective Action Plans) to align supplier performance with Intel goals. Help launched overseas operations in China and the Netherlands with local and global supplied sources. New Product Planner Intel Corporation March 2001  –  July 2004  (3 years 5 months) Hillsboro, Oregon Project manager for New Product Introduction (NPI) in server and workstation products. Ownership of manufacturing IC's internally or externally to meet time to market targets. Established one of the first foundry chips to utilize excess internal capacity while also moving production outside of internal fab to meet technological requirements. Opened Philippine planning facility to meet fab and assembly support while lowering cost and improving response time. New Product Planner Intel Corporation March 2001  –  July 2004  (3 years 5 months) Hillsboro, Oregon Project manager for New Product Introduction (NPI) in server and workstation products. Ownership of manufacturing IC's internally or externally to meet time to market targets. Established one of the first foundry chips to utilize excess internal capacity while also moving production outside of internal fab to meet technological requirements. Opened Philippine planning facility to meet fab and assembly support while lowering cost and improving response time. Ultra Pure Water Reverse Osmosis & Acid Waste Intel Corporation September 1997  –  July 2000  (2 years 11 months) Built and ran the RODI/AWN plant to support semiconductor fab while exceeding 18 megohm resistivity. Ultra Pure Water Reverse Osmosis & Acid Waste Intel Corporation September 1997  –  July 2000  (2 years 11 months) Built and ran the RODI/AWN plant to support semiconductor fab while exceeding 18 megohm resistivity. RODI &AWN Plant lead US Filter October 1995  –  September 1997  (2 years) Built and ran the RODI/AWN plant to support semiconductor fab while exceeding 18 megohm resistivity. RODI &AWN Plant lead US Filter October 1995  –  September 1997  (2 years) Built and ran the RODI/AWN plant to support semiconductor fab while exceeding 18 megohm resistivity. Skills SAP Supply Chain Management ERP Supply Chain Purchasing Logistics International Business Procurement Supplier Quality Strategic Planning Cross-functional Team... Product Development Manufacturing Lean Manufacturing Continuous Improvement Process Improvement MRP SPC ISO Sourcing FMEA Engineering Management See 8+     See less Skills  SAP Supply Chain Management ERP Supply Chain Purchasing Logistics International Business Procurement Supplier Quality Strategic Planning Cross-functional Team... Product Development Manufacturing Lean Manufacturing Continuous Improvement Process Improvement MRP SPC ISO Sourcing FMEA Engineering Management See 8+     See less SAP Supply Chain Management ERP Supply Chain Purchasing Logistics International Business Procurement Supplier Quality Strategic Planning Cross-functional Team... Product Development Manufacturing Lean Manufacturing Continuous Improvement Process Improvement MRP SPC ISO Sourcing FMEA Engineering Management See 8+     See less SAP Supply Chain Management ERP Supply Chain Purchasing Logistics International Business Procurement Supplier Quality Strategic Planning Cross-functional Team... Product Development Manufacturing Lean Manufacturing Continuous Improvement Process Improvement MRP SPC ISO Sourcing FMEA Engineering Management See 8+     See less Education Concordia University-Portland Bachelor's Degree,  Business Managment and Communications 1998 Concordia University-Portland Bachelor's Degree,  Business Managment and Communications 1998 Concordia University-Portland Bachelor's Degree,  Business Managment and Communications 1998 Concordia University-Portland Bachelor's Degree,  Business Managment and Communications 1998 ", "Skills Program Management Semiconductors Process Improvement Strategy Training Testing Product Marketing Staffing Plans Management Project Planning Analysis Skills  Program Management Semiconductors Process Improvement Strategy Training Testing Product Marketing Staffing Plans Management Project Planning Analysis Program Management Semiconductors Process Improvement Strategy Training Testing Product Marketing Staffing Plans Management Project Planning Analysis Program Management Semiconductors Process Improvement Strategy Training Testing Product Marketing Staffing Plans Management Project Planning Analysis ", "Experience President/CEO/Founder CPG Data, L.L.C. January 2013  – Present (2 years 8 months) El Dorado Hills, CA Advisor to the CEO Silk Road Soda July 2013  –  January 2015  (1 year 7 months) Sacramento, California Area Advisor to the CEO Bon Affair, Inc. March 2013  –  October 2014  (1 year 8 months) Greater San Diego Area Director of Business Development and Marketing GTECH Corporation February 2012  –  July 2013  (1 year 6 months) Sacramento, California Area Owner / Co-Founder Box Craft Beer September 2011  –  December 2012  (1 year 4 months) Folsom, CA General Manager MillerCoors 2008  –  September 2011  (3 years) San Francisco Bay Area General Manager Coors Brewing Company October 2006  –  July 2008  (1 year 10 months) District Business Manager Coors Brewing Company July 2002  –  September 2006  (4 years 3 months) National Sales Manager Legal Age Security Software February 2002  –  July 2002  (6 months) El Dorado Hills, California Product Development Manager Hewlett-Packard May 2000  –  September 2001  (1 year 5 months) Roseville, CA Founder and Owner Wed-Site.com August 1998  –  June 2000  (1 year 11 months) Davis, California Senior Hardware Distribution Specialist Intel Corporation February 1998  –  September 1999  (1 year 8 months) Folsom, CA New Product Planner Intel Corporation June 1997  –  February 1998  (9 months) Distributor Business Manager Coors Brewing Company December 1995  –  July 1997  (1 year 8 months) Seattle, Washington Specialty Brands Manager Coors Brewing Company December 1994  –  December 1995  (1 year 1 month) Northern CA and Northern Nevada President/CEO/Founder CPG Data, L.L.C. January 2013  – Present (2 years 8 months) El Dorado Hills, CA President/CEO/Founder CPG Data, L.L.C. January 2013  – Present (2 years 8 months) El Dorado Hills, CA Advisor to the CEO Silk Road Soda July 2013  –  January 2015  (1 year 7 months) Sacramento, California Area Advisor to the CEO Silk Road Soda July 2013  –  January 2015  (1 year 7 months) Sacramento, California Area Advisor to the CEO Bon Affair, Inc. March 2013  –  October 2014  (1 year 8 months) Greater San Diego Area Advisor to the CEO Bon Affair, Inc. March 2013  –  October 2014  (1 year 8 months) Greater San Diego Area Director of Business Development and Marketing GTECH Corporation February 2012  –  July 2013  (1 year 6 months) Sacramento, California Area Director of Business Development and Marketing GTECH Corporation February 2012  –  July 2013  (1 year 6 months) Sacramento, California Area Owner / Co-Founder Box Craft Beer September 2011  –  December 2012  (1 year 4 months) Folsom, CA Owner / Co-Founder Box Craft Beer September 2011  –  December 2012  (1 year 4 months) Folsom, CA General Manager MillerCoors 2008  –  September 2011  (3 years) San Francisco Bay Area General Manager MillerCoors 2008  –  September 2011  (3 years) San Francisco Bay Area General Manager Coors Brewing Company October 2006  –  July 2008  (1 year 10 months) General Manager Coors Brewing Company October 2006  –  July 2008  (1 year 10 months) District Business Manager Coors Brewing Company July 2002  –  September 2006  (4 years 3 months) District Business Manager Coors Brewing Company July 2002  –  September 2006  (4 years 3 months) National Sales Manager Legal Age Security Software February 2002  –  July 2002  (6 months) El Dorado Hills, California National Sales Manager Legal Age Security Software February 2002  –  July 2002  (6 months) El Dorado Hills, California Product Development Manager Hewlett-Packard May 2000  –  September 2001  (1 year 5 months) Roseville, CA Product Development Manager Hewlett-Packard May 2000  –  September 2001  (1 year 5 months) Roseville, CA Founder and Owner Wed-Site.com August 1998  –  June 2000  (1 year 11 months) Davis, California Founder and Owner Wed-Site.com August 1998  –  June 2000  (1 year 11 months) Davis, California Senior Hardware Distribution Specialist Intel Corporation February 1998  –  September 1999  (1 year 8 months) Folsom, CA Senior Hardware Distribution Specialist Intel Corporation February 1998  –  September 1999  (1 year 8 months) Folsom, CA New Product Planner Intel Corporation June 1997  –  February 1998  (9 months) New Product Planner Intel Corporation June 1997  –  February 1998  (9 months) Distributor Business Manager Coors Brewing Company December 1995  –  July 1997  (1 year 8 months) Seattle, Washington Distributor Business Manager Coors Brewing Company December 1995  –  July 1997  (1 year 8 months) Seattle, Washington Specialty Brands Manager Coors Brewing Company December 1994  –  December 1995  (1 year 1 month) Northern CA and Northern Nevada Specialty Brands Manager Coors Brewing Company December 1994  –  December 1995  (1 year 1 month) Northern CA and Northern Nevada Skills Retail Execution Business Planning Consumer Package Goods Developer of People Full P&L Responsibility Coaching Entrepreneurship Visionary Thinking Team Leadership Training Marketing Strategy Sales Management Leadership Sales Cross-functional Team... Strategy Strategic Planning Advertising Marketing B2B FMCG Forecasting Key Account Development Strategic Partnerships Integrated Marketing New Business Development Consumer Products Competitive Analysis Market Planning Marketing Research Brand Management Marketing Management Management Change Management Negotiation Product Development Income Statement Customer Insight Pricing P&L Digital Media CPG Industry P&L Management CPG Sales Consumer Packaged Goods... Mobile Applications Sales & Marketing... Strategic Selling Business Development Account Management See 35+     See less Skills  Retail Execution Business Planning Consumer Package Goods Developer of People Full P&L Responsibility Coaching Entrepreneurship Visionary Thinking Team Leadership Training Marketing Strategy Sales Management Leadership Sales Cross-functional Team... Strategy Strategic Planning Advertising Marketing B2B FMCG Forecasting Key Account Development Strategic Partnerships Integrated Marketing New Business Development Consumer Products Competitive Analysis Market Planning Marketing Research Brand Management Marketing Management Management Change Management Negotiation Product Development Income Statement Customer Insight Pricing P&L Digital Media CPG Industry P&L Management CPG Sales Consumer Packaged Goods... Mobile Applications Sales & Marketing... Strategic Selling Business Development Account Management See 35+     See less Retail Execution Business Planning Consumer Package Goods Developer of People Full P&L Responsibility Coaching Entrepreneurship Visionary Thinking Team Leadership Training Marketing Strategy Sales Management Leadership Sales Cross-functional Team... Strategy Strategic Planning Advertising Marketing B2B FMCG Forecasting Key Account Development Strategic Partnerships Integrated Marketing New Business Development Consumer Products Competitive Analysis Market Planning Marketing Research Brand Management Marketing Management Management Change Management Negotiation Product Development Income Statement Customer Insight Pricing P&L Digital Media CPG Industry P&L Management CPG Sales Consumer Packaged Goods... Mobile Applications Sales & Marketing... Strategic Selling Business Development Account Management See 35+     See less Retail Execution Business Planning Consumer Package Goods Developer of People Full P&L Responsibility Coaching Entrepreneurship Visionary Thinking Team Leadership Training Marketing Strategy Sales Management Leadership Sales Cross-functional Team... Strategy Strategic Planning Advertising Marketing B2B FMCG Forecasting Key Account Development Strategic Partnerships Integrated Marketing New Business Development Consumer Products Competitive Analysis Market Planning Marketing Research Brand Management Marketing Management Management Change Management Negotiation Product Development Income Statement Customer Insight Pricing P&L Digital Media CPG Industry P&L Management CPG Sales Consumer Packaged Goods... Mobile Applications Sales & Marketing... Strategic Selling Business Development Account Management See 35+     See less Education University of California, Davis - Graduate School of Management MBA 1999  – 2001 Australian Graduate School of Management MBA 2000  – 2000 California State University-Chico BS 1990  – 1994 University of California, Davis - Graduate School of Management MBA 1999  – 2001 University of California, Davis - Graduate School of Management MBA 1999  – 2001 University of California, Davis - Graduate School of Management MBA 1999  – 2001 Australian Graduate School of Management MBA 2000  – 2000 Australian Graduate School of Management MBA 2000  – 2000 Australian Graduate School of Management MBA 2000  – 2000 California State University-Chico BS 1990  – 1994 California State University-Chico BS 1990  – 1994 California State University-Chico BS 1990  – 1994 Honors & Awards Distinguished Achievement Award UC Davis Graduate School of Management Alumni Association May 2014 Participant and Finisher California International Marathon December 2014 Participant and Finisher California International Marathon December 2012 Participant and Finisher California International Marathon December 2010 Additional Honors & Awards 1996 Coors Brewing Company Field Business Area of the Year \n1998 Intel Corporation's 1st Billion Dollars in e-Commerce Team \n2003 Coors Brewing Company Field Business Area of the Year \n2004 Coors Brewing Company Field Business Area of the Year \n2004 Coors Brewing Company Field Business Area Special Recognition Award \n2007 Guest Lecturer, UC Davis MBA \n2010 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2010 World Champion SF Giant's Sponsoring Partner \n2010 World Champion SF Giants Parade Participant \n2011 Guest Lecturer, UC Berkeley Haas MBA \n2010 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2013 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2013 Guest Speaker, National Homebrewer's Conference Distinguished Achievement Award UC Davis Graduate School of Management Alumni Association May 2014 Distinguished Achievement Award UC Davis Graduate School of Management Alumni Association May 2014 Distinguished Achievement Award UC Davis Graduate School of Management Alumni Association May 2014 Participant and Finisher California International Marathon December 2014 Participant and Finisher California International Marathon December 2014 Participant and Finisher California International Marathon December 2014 Participant and Finisher California International Marathon December 2012 Participant and Finisher California International Marathon December 2012 Participant and Finisher California International Marathon December 2012 Participant and Finisher California International Marathon December 2010 Participant and Finisher California International Marathon December 2010 Participant and Finisher California International Marathon December 2010 Additional Honors & Awards 1996 Coors Brewing Company Field Business Area of the Year \n1998 Intel Corporation's 1st Billion Dollars in e-Commerce Team \n2003 Coors Brewing Company Field Business Area of the Year \n2004 Coors Brewing Company Field Business Area of the Year \n2004 Coors Brewing Company Field Business Area Special Recognition Award \n2007 Guest Lecturer, UC Davis MBA \n2010 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2010 World Champion SF Giant's Sponsoring Partner \n2010 World Champion SF Giants Parade Participant \n2011 Guest Lecturer, UC Berkeley Haas MBA \n2010 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2013 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2013 Guest Speaker, National Homebrewer's Conference Additional Honors & Awards 1996 Coors Brewing Company Field Business Area of the Year \n1998 Intel Corporation's 1st Billion Dollars in e-Commerce Team \n2003 Coors Brewing Company Field Business Area of the Year \n2004 Coors Brewing Company Field Business Area of the Year \n2004 Coors Brewing Company Field Business Area Special Recognition Award \n2007 Guest Lecturer, UC Davis MBA \n2010 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2010 World Champion SF Giant's Sponsoring Partner \n2010 World Champion SF Giants Parade Participant \n2011 Guest Lecturer, UC Berkeley Haas MBA \n2010 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2013 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2013 Guest Speaker, National Homebrewer's Conference Additional Honors & Awards 1996 Coors Brewing Company Field Business Area of the Year \n1998 Intel Corporation's 1st Billion Dollars in e-Commerce Team \n2003 Coors Brewing Company Field Business Area of the Year \n2004 Coors Brewing Company Field Business Area of the Year \n2004 Coors Brewing Company Field Business Area Special Recognition Award \n2007 Guest Lecturer, UC Davis MBA \n2010 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2010 World Champion SF Giant's Sponsoring Partner \n2010 World Champion SF Giants Parade Participant \n2011 Guest Lecturer, UC Berkeley Haas MBA \n2010 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2013 Guest Lecturer, UC Davis Extension Master Brewer's Program \n2013 Guest Speaker, National Homebrewer's Conference ", "Languages French Tunisian Arabic German English French Tunisian Arabic German English French Tunisian Arabic German English Skills Embedded Linux Mobile Devices Embedded Software IPTV Software Engineering Embedded Systems Linux Set Top Box C Pre-sales Digital TV Device Drivers C++ Open Source Software Development Object Oriented Design Software Design Debugging RTOS See 4+     See less Skills  Embedded Linux Mobile Devices Embedded Software IPTV Software Engineering Embedded Systems Linux Set Top Box C Pre-sales Digital TV Device Drivers C++ Open Source Software Development Object Oriented Design Software Design Debugging RTOS See 4+     See less Embedded Linux Mobile Devices Embedded Software IPTV Software Engineering Embedded Systems Linux Set Top Box C Pre-sales Digital TV Device Drivers C++ Open Source Software Development Object Oriented Design Software Design Debugging RTOS See 4+     See less Embedded Linux Mobile Devices Embedded Software IPTV Software Engineering Embedded Systems Linux Set Top Box C Pre-sales Digital TV Device Drivers C++ Open Source Software Development Object Oriented Design Software Design Debugging RTOS See 4+     See less Honors & Awards ", "Languages Spanish Spanish Spanish Skills Spanish-speaking Management Community Outreach Critical Thinking Leadership Strategic Planning Leadership Development Team Building Cross-functional Team... Team Leadership Data Analysis Organizational... Public Speaking Project Management Analysis Change Management See 1+     See less Skills  Spanish-speaking Management Community Outreach Critical Thinking Leadership Strategic Planning Leadership Development Team Building Cross-functional Team... Team Leadership Data Analysis Organizational... Public Speaking Project Management Analysis Change Management See 1+     See less Spanish-speaking Management Community Outreach Critical Thinking Leadership Strategic Planning Leadership Development Team Building Cross-functional Team... Team Leadership Data Analysis Organizational... Public Speaking Project Management Analysis Change Management See 1+     See less Spanish-speaking Management Community Outreach Critical Thinking Leadership Strategic Planning Leadership Development Team Building Cross-functional Team... Team Leadership Data Analysis Organizational... Public Speaking Project Management Analysis Change Management See 1+     See less ", "Experience New Product Planner Intel Corporation 2006  – Present (9 years) Israel New Product Planner Intel Corporation 2006  – Present (9 years) Israel New Product Planner Intel Corporation 2006  – Present (9 years) Israel Education Bar Ilan university Bachelor's degree,  Economics & logistics Bar Ilan university Bachelor's degree,  Economics & logistics Bar Ilan university Bachelor's degree,  Economics & logistics Bar Ilan university Bachelor's degree,  Economics & logistics ", "Languages Punjabi Hindi Punjabi Hindi Punjabi Hindi Skills Product Development Storage Enterprise Software OEM Partner Management Product Marketing Product Planning Product Strategy Product Management Channel Product Life Cycle... Cross-functional Team... Software Product... Product Launch Skills  Product Development Storage Enterprise Software OEM Partner Management Product Marketing Product Planning Product Strategy Product Management Channel Product Life Cycle... Cross-functional Team... Software Product... Product Launch Product Development Storage Enterprise Software OEM Partner Management Product Marketing Product Planning Product Strategy Product Management Channel Product Life Cycle... Cross-functional Team... Software Product... Product Launch Product Development Storage Enterprise Software OEM Partner Management Product Marketing Product Planning Product Strategy Product Management Channel Product Life Cycle... Cross-functional Team... Software Product... Product Launch ", "Skills Program Management Recruiting Event Planning Cross-functional Team... Human Resources Performance Management Talent Management College Recruiting Onboarding Process Improvement Applicant Tracking... Product Development Talent Acquisition Workforce Planning Technical Recruiting Leadership Strategic Sourcing Internet Recruiting Sourcing Executive Search Hiring Organizational... Strategic Planning Employee Relations Project Management Employee Engagement See 11+     See less Skills  Program Management Recruiting Event Planning Cross-functional Team... Human Resources Performance Management Talent Management College Recruiting Onboarding Process Improvement Applicant Tracking... Product Development Talent Acquisition Workforce Planning Technical Recruiting Leadership Strategic Sourcing Internet Recruiting Sourcing Executive Search Hiring Organizational... Strategic Planning Employee Relations Project Management Employee Engagement See 11+     See less Program Management Recruiting Event Planning Cross-functional Team... Human Resources Performance Management Talent Management College Recruiting Onboarding Process Improvement Applicant Tracking... Product Development Talent Acquisition Workforce Planning Technical Recruiting Leadership Strategic Sourcing Internet Recruiting Sourcing Executive Search Hiring Organizational... Strategic Planning Employee Relations Project Management Employee Engagement See 11+     See less Program Management Recruiting Event Planning Cross-functional Team... Human Resources Performance Management Talent Management College Recruiting Onboarding Process Improvement Applicant Tracking... Product Development Talent Acquisition Workforce Planning Technical Recruiting Leadership Strategic Sourcing Internet Recruiting Sourcing Executive Search Hiring Organizational... Strategic Planning Employee Relations Project Management Employee Engagement See 11+     See less "]}