{"position": "Product Marketing Manager", "company": "IBM", "profiles": ["Languages English Native or bilingual proficiency Danish Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Danish Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Danish Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Marketing Strategy Sales Enablement Corporate Communications Event Management Internal Communications Writing Editing Marketing Communications Social Media Budgeting Promotions Messaging Program Management Coordination Channel Strategic Planning Conferences Events Demand Generation Strategy Entrepreneurship Sales Brand Management Integration Marketing Management Project Planning CRM Cloud Computing Management Budgets See 15+     See less Skills  Marketing Strategy Sales Enablement Corporate Communications Event Management Internal Communications Writing Editing Marketing Communications Social Media Budgeting Promotions Messaging Program Management Coordination Channel Strategic Planning Conferences Events Demand Generation Strategy Entrepreneurship Sales Brand Management Integration Marketing Management Project Planning CRM Cloud Computing Management Budgets See 15+     See less Marketing Strategy Sales Enablement Corporate Communications Event Management Internal Communications Writing Editing Marketing Communications Social Media Budgeting Promotions Messaging Program Management Coordination Channel Strategic Planning Conferences Events Demand Generation Strategy Entrepreneurship Sales Brand Management Integration Marketing Management Project Planning CRM Cloud Computing Management Budgets See 15+     See less Marketing Strategy Sales Enablement Corporate Communications Event Management Internal Communications Writing Editing Marketing Communications Social Media Budgeting Promotions Messaging Program Management Coordination Channel Strategic Planning Conferences Events Demand Generation Strategy Entrepreneurship Sales Brand Management Integration Marketing Management Project Planning CRM Cloud Computing Management Budgets See 15+     See less ", "Summary Innovative, accomplished marketing management professional recognized for consistent success developing systems, processes, and procedures used to streamline business operations, generate sales, and enhance marketing staff performance. \n \nEffective project manager skilled in building collaborative working relationships with cross-functional teams involved in launching of multiple products, marketing communications, and marketing production. \n \nDemonstrated ability to engage and execute product marketing skills, producing value-driven results that are aligned with corporate goals and budgetary requirements. \nSpecialties: \nProduct Marketing \nProject Management \nStrategic Planning \nIntegrated Marketing \nTeam Leadership \nImplementation to Launch \nCross-functional Communication Summary Innovative, accomplished marketing management professional recognized for consistent success developing systems, processes, and procedures used to streamline business operations, generate sales, and enhance marketing staff performance. \n \nEffective project manager skilled in building collaborative working relationships with cross-functional teams involved in launching of multiple products, marketing communications, and marketing production. \n \nDemonstrated ability to engage and execute product marketing skills, producing value-driven results that are aligned with corporate goals and budgetary requirements. \nSpecialties: \nProduct Marketing \nProject Management \nStrategic Planning \nIntegrated Marketing \nTeam Leadership \nImplementation to Launch \nCross-functional Communication Innovative, accomplished marketing management professional recognized for consistent success developing systems, processes, and procedures used to streamline business operations, generate sales, and enhance marketing staff performance. \n \nEffective project manager skilled in building collaborative working relationships with cross-functional teams involved in launching of multiple products, marketing communications, and marketing production. \n \nDemonstrated ability to engage and execute product marketing skills, producing value-driven results that are aligned with corporate goals and budgetary requirements. \nSpecialties: \nProduct Marketing \nProject Management \nStrategic Planning \nIntegrated Marketing \nTeam Leadership \nImplementation to Launch \nCross-functional Communication Innovative, accomplished marketing management professional recognized for consistent success developing systems, processes, and procedures used to streamline business operations, generate sales, and enhance marketing staff performance. \n \nEffective project manager skilled in building collaborative working relationships with cross-functional teams involved in launching of multiple products, marketing communications, and marketing production. \n \nDemonstrated ability to engage and execute product marketing skills, producing value-driven results that are aligned with corporate goals and budgetary requirements. \nSpecialties: \nProduct Marketing \nProject Management \nStrategic Planning \nIntegrated Marketing \nTeam Leadership \nImplementation to Launch \nCross-functional Communication Experience Sr. Product Marketing Manager IBM October 2008  – Present (6 years 11 months) Chicago, IL Sr. Mgr., Marketing Operations Macrovision, Inc. September 2006  –  June 2008  (1 year 10 months) Schaumburg, IL Sr. Product Manager Infogix, Inc. 2005  –  2006  (1 year) Naperville, IL Product Manager iPass, Inc. 2004  –  2005  (1 year) Redwood City, IL Sr. Product Marketing Manager Adobe Systems 2002  –  2003  (1 year) San Jose, CA Senior Product Manager Equinix 2001  –  2002  (1 year) Redwood Shores, CA Sr. Product Manager / Sr. Product Marketing Manager IBM 1993  –  2001  (8 years) Mountain View, CA Sr. Product Marketing Manager IBM October 2008  – Present (6 years 11 months) Chicago, IL Sr. Product Marketing Manager IBM October 2008  – Present (6 years 11 months) Chicago, IL Sr. Mgr., Marketing Operations Macrovision, Inc. September 2006  –  June 2008  (1 year 10 months) Schaumburg, IL Sr. Mgr., Marketing Operations Macrovision, Inc. September 2006  –  June 2008  (1 year 10 months) Schaumburg, IL Sr. Product Manager Infogix, Inc. 2005  –  2006  (1 year) Naperville, IL Sr. Product Manager Infogix, Inc. 2005  –  2006  (1 year) Naperville, IL Product Manager iPass, Inc. 2004  –  2005  (1 year) Redwood City, IL Product Manager iPass, Inc. 2004  –  2005  (1 year) Redwood City, IL Sr. Product Marketing Manager Adobe Systems 2002  –  2003  (1 year) San Jose, CA Sr. Product Marketing Manager Adobe Systems 2002  –  2003  (1 year) San Jose, CA Senior Product Manager Equinix 2001  –  2002  (1 year) Redwood Shores, CA Senior Product Manager Equinix 2001  –  2002  (1 year) Redwood Shores, CA Sr. Product Manager / Sr. Product Marketing Manager IBM 1993  –  2001  (8 years) Mountain View, CA Sr. Product Manager / Sr. Product Marketing Manager IBM 1993  –  2001  (8 years) Mountain View, CA Skills Product Management Business Development Product Development Performance Management Strategic Planning Product Marketing Cross-functional Team... Marketing Marketing Management SaaS Account Management Marketing Communications Leadership Market Research Enterprise Software Competitive Analysis Strategy Strategic Partnerships Product Launch Management Analytics Start-ups Program Management Multi-channel Marketing Marketing Strategy Go-to-market Strategy Integration Sales Enablement Cloud Computing Solution Selling Business Alliances Demand Generation See 17+     See less Skills  Product Management Business Development Product Development Performance Management Strategic Planning Product Marketing Cross-functional Team... Marketing Marketing Management SaaS Account Management Marketing Communications Leadership Market Research Enterprise Software Competitive Analysis Strategy Strategic Partnerships Product Launch Management Analytics Start-ups Program Management Multi-channel Marketing Marketing Strategy Go-to-market Strategy Integration Sales Enablement Cloud Computing Solution Selling Business Alliances Demand Generation See 17+     See less Product Management Business Development Product Development Performance Management Strategic Planning Product Marketing Cross-functional Team... Marketing Marketing Management SaaS Account Management Marketing Communications Leadership Market Research Enterprise Software Competitive Analysis Strategy Strategic Partnerships Product Launch Management Analytics Start-ups Program Management Multi-channel Marketing Marketing Strategy Go-to-market Strategy Integration Sales Enablement Cloud Computing Solution Selling Business Alliances Demand Generation See 17+     See less Product Management Business Development Product Development Performance Management Strategic Planning Product Marketing Cross-functional Team... Marketing Marketing Management SaaS Account Management Marketing Communications Leadership Market Research Enterprise Software Competitive Analysis Strategy Strategic Partnerships Product Launch Management Analytics Start-ups Program Management Multi-channel Marketing Marketing Strategy Go-to-market Strategy Integration Sales Enablement Cloud Computing Solution Selling Business Alliances Demand Generation See 17+     See less ", "Skills Information Architecture Market Analysis Product Marketing Advertising Partner Management Online Advertising Master Data Management Data Quality Enterprise Software Data Integration SaaS Product Management Demand Generation Data Governance Sales Enablement Business Intelligence Pre-sales Analytics Go-to-market Strategy Data Warehousing Integrated Marketing Start-ups Big Data Online Marketing Professional Services Strategic Partnerships Salesforce.com Lead Generation Product Development Solution Selling Management See 16+     See less Skills  Information Architecture Market Analysis Product Marketing Advertising Partner Management Online Advertising Master Data Management Data Quality Enterprise Software Data Integration SaaS Product Management Demand Generation Data Governance Sales Enablement Business Intelligence Pre-sales Analytics Go-to-market Strategy Data Warehousing Integrated Marketing Start-ups Big Data Online Marketing Professional Services Strategic Partnerships Salesforce.com Lead Generation Product Development Solution Selling Management See 16+     See less Information Architecture Market Analysis Product Marketing Advertising Partner Management Online Advertising Master Data Management Data Quality Enterprise Software Data Integration SaaS Product Management Demand Generation Data Governance Sales Enablement Business Intelligence Pre-sales Analytics Go-to-market Strategy Data Warehousing Integrated Marketing Start-ups Big Data Online Marketing Professional Services Strategic Partnerships Salesforce.com Lead Generation Product Development Solution Selling Management See 16+     See less Information Architecture Market Analysis Product Marketing Advertising Partner Management Online Advertising Master Data Management Data Quality Enterprise Software Data Integration SaaS Product Management Demand Generation Data Governance Sales Enablement Business Intelligence Pre-sales Analytics Go-to-market Strategy Data Warehousing Integrated Marketing Start-ups Big Data Online Marketing Professional Services Strategic Partnerships Salesforce.com Lead Generation Product Development Solution Selling Management See 16+     See less ", "Summary Highly motivated, results focused professional with experience in program management, software implementation, process redesign, change management and strategic partnership development. \n \nSuccess founded on an ability to understand both technical and business strategy in order to identify future business direction and opportunities. Specialties:Six Sigma Green Belt Certification, MS in Computer Science, GE IMLP graduate Summary Highly motivated, results focused professional with experience in program management, software implementation, process redesign, change management and strategic partnership development. \n \nSuccess founded on an ability to understand both technical and business strategy in order to identify future business direction and opportunities. Specialties:Six Sigma Green Belt Certification, MS in Computer Science, GE IMLP graduate Highly motivated, results focused professional with experience in program management, software implementation, process redesign, change management and strategic partnership development. \n \nSuccess founded on an ability to understand both technical and business strategy in order to identify future business direction and opportunities. Specialties:Six Sigma Green Belt Certification, MS in Computer Science, GE IMLP graduate Highly motivated, results focused professional with experience in program management, software implementation, process redesign, change management and strategic partnership development. \n \nSuccess founded on an ability to understand both technical and business strategy in order to identify future business direction and opportunities. Specialties:Six Sigma Green Belt Certification, MS in Computer Science, GE IMLP graduate Skills SaaS Enterprise Software Cloud Computing Marketing Automation Six Sigma Unica Strategy Program Management Enterprise Marketing Digital Marketing Email Marketing Multi-channel Marketing Analytics Product Marketing Strategic Partnerships Mobile Marketing Pre-sales Demand Generation See 3+     See less Skills  SaaS Enterprise Software Cloud Computing Marketing Automation Six Sigma Unica Strategy Program Management Enterprise Marketing Digital Marketing Email Marketing Multi-channel Marketing Analytics Product Marketing Strategic Partnerships Mobile Marketing Pre-sales Demand Generation See 3+     See less SaaS Enterprise Software Cloud Computing Marketing Automation Six Sigma Unica Strategy Program Management Enterprise Marketing Digital Marketing Email Marketing Multi-channel Marketing Analytics Product Marketing Strategic Partnerships Mobile Marketing Pre-sales Demand Generation See 3+     See less SaaS Enterprise Software Cloud Computing Marketing Automation Six Sigma Unica Strategy Program Management Enterprise Marketing Digital Marketing Email Marketing Multi-channel Marketing Analytics Product Marketing Strategic Partnerships Mobile Marketing Pre-sales Demand Generation See 3+     See less ", "Languages English English English Skills Product Management Strategy Development Competitive Analysis Product Launch Market Intelligence Cross-functional Team... Lead Generation Cloud Computing Product Marketing Virtualization Data Center Business Alliances Skills  Product Management Strategy Development Competitive Analysis Product Launch Market Intelligence Cross-functional Team... Lead Generation Cloud Computing Product Marketing Virtualization Data Center Business Alliances Product Management Strategy Development Competitive Analysis Product Launch Market Intelligence Cross-functional Team... Lead Generation Cloud Computing Product Marketing Virtualization Data Center Business Alliances Product Management Strategy Development Competitive Analysis Product Launch Market Intelligence Cross-functional Team... Lead Generation Cloud Computing Product Marketing Virtualization Data Center Business Alliances ", "Summary I'm a passionate product marketer & storyteller. Inspired by Big Data technology and its infinite capacity to shape the world. I'm one of the IBM’s Big Data product marketing & content strategists, creating helpful ebooks, customer success stories, whitepapers and other useful resources. I've over 9 years of experience with technology marketing. \n \n \nFollow me on Twitter @avi_patwardhan. \n \nSpecialties:  \n \nProduct Marketing ♦ Product Messaging & Positioning ♦ Product & Solutions Launches ♦ Strategic Planning ♦ International Marketing ♦ Multi-channel Marketing ♦ Demand Generation ♦ Digital Marketing ♦ Pipeline Development ♦ Lead Generation ♦ Public Relations ♦ Advertising ♦ Social Media ♦ Content Marketing ♦ Analyst Relations ♦ Channel Marketing ♦ Partner Marketing ♦ Customer Advocacy ♦ Go-To-Market (GTM) Summary I'm a passionate product marketer & storyteller. Inspired by Big Data technology and its infinite capacity to shape the world. I'm one of the IBM’s Big Data product marketing & content strategists, creating helpful ebooks, customer success stories, whitepapers and other useful resources. I've over 9 years of experience with technology marketing. \n \n \nFollow me on Twitter @avi_patwardhan. \n \nSpecialties:  \n \nProduct Marketing ♦ Product Messaging & Positioning ♦ Product & Solutions Launches ♦ Strategic Planning ♦ International Marketing ♦ Multi-channel Marketing ♦ Demand Generation ♦ Digital Marketing ♦ Pipeline Development ♦ Lead Generation ♦ Public Relations ♦ Advertising ♦ Social Media ♦ Content Marketing ♦ Analyst Relations ♦ Channel Marketing ♦ Partner Marketing ♦ Customer Advocacy ♦ Go-To-Market (GTM) I'm a passionate product marketer & storyteller. Inspired by Big Data technology and its infinite capacity to shape the world. I'm one of the IBM’s Big Data product marketing & content strategists, creating helpful ebooks, customer success stories, whitepapers and other useful resources. I've over 9 years of experience with technology marketing. \n \n \nFollow me on Twitter @avi_patwardhan. \n \nSpecialties:  \n \nProduct Marketing ♦ Product Messaging & Positioning ♦ Product & Solutions Launches ♦ Strategic Planning ♦ International Marketing ♦ Multi-channel Marketing ♦ Demand Generation ♦ Digital Marketing ♦ Pipeline Development ♦ Lead Generation ♦ Public Relations ♦ Advertising ♦ Social Media ♦ Content Marketing ♦ Analyst Relations ♦ Channel Marketing ♦ Partner Marketing ♦ Customer Advocacy ♦ Go-To-Market (GTM) I'm a passionate product marketer & storyteller. Inspired by Big Data technology and its infinite capacity to shape the world. I'm one of the IBM’s Big Data product marketing & content strategists, creating helpful ebooks, customer success stories, whitepapers and other useful resources. I've over 9 years of experience with technology marketing. \n \n \nFollow me on Twitter @avi_patwardhan. \n \nSpecialties:  \n \nProduct Marketing ♦ Product Messaging & Positioning ♦ Product & Solutions Launches ♦ Strategic Planning ♦ International Marketing ♦ Multi-channel Marketing ♦ Demand Generation ♦ Digital Marketing ♦ Pipeline Development ♦ Lead Generation ♦ Public Relations ♦ Advertising ♦ Social Media ♦ Content Marketing ♦ Analyst Relations ♦ Channel Marketing ♦ Partner Marketing ♦ Customer Advocacy ♦ Go-To-Market (GTM) Experience Big Data and Analytics Product Marketing Manager IBM February 2013  – Present (2 years 7 months) Bangalore Product marketing manager for IBM’s Big Data and Analytics platform(Stream Computing & BigInsights for Hadoop) Big Data and Analytics Product Marketing Manager IBM February 2013  – Present (2 years 7 months) Bangalore Product marketing manager for IBM’s Big Data and Analytics platform(Stream Computing & BigInsights for Hadoop) Big Data and Analytics Product Marketing Manager IBM February 2013  – Present (2 years 7 months) Bangalore Product marketing manager for IBM’s Big Data and Analytics platform(Stream Computing & BigInsights for Hadoop) Skills Customer Engagement Product Marketing Customer Advocacy Lead Generation CRM Social Media Marketing Big Data Enablement Product Launch Development &... Business Development Program Management Enterprise Software Leadership Pre-sales Demand Generation Cross-functional Team... Sales Process Sales Enablement Multi-channel Marketing Management Direct Marketing Online Marketing Go-to-market Strategy Marketing Strategy Integration Marketing See 12+     See less Skills  Customer Engagement Product Marketing Customer Advocacy Lead Generation CRM Social Media Marketing Big Data Enablement Product Launch Development &... Business Development Program Management Enterprise Software Leadership Pre-sales Demand Generation Cross-functional Team... Sales Process Sales Enablement Multi-channel Marketing Management Direct Marketing Online Marketing Go-to-market Strategy Marketing Strategy Integration Marketing See 12+     See less Customer Engagement Product Marketing Customer Advocacy Lead Generation CRM Social Media Marketing Big Data Enablement Product Launch Development &... Business Development Program Management Enterprise Software Leadership Pre-sales Demand Generation Cross-functional Team... Sales Process Sales Enablement Multi-channel Marketing Management Direct Marketing Online Marketing Go-to-market Strategy Marketing Strategy Integration Marketing See 12+     See less Customer Engagement Product Marketing Customer Advocacy Lead Generation CRM Social Media Marketing Big Data Enablement Product Launch Development &... Business Development Program Management Enterprise Software Leadership Pre-sales Demand Generation Cross-functional Team... Sales Process Sales Enablement Multi-channel Marketing Management Direct Marketing Online Marketing Go-to-market Strategy Marketing Strategy Integration Marketing See 12+     See less Education Shivaji University Master of Business Administration (MBA),  Marketing & Information Technology Karnatak University B.Sc. (G.S.Sc. College- Belgaum),  - Physics ,  Maths and Electronics SVYASA Yoga University (Swami Vivekananda Yoga Anusandhana Samsthana) Certified Yoga Instructor Asanas, Kriyas, Pranayama, Meditations, Karma yoga. \n \nThe holistic way to prevent diseases, promote positive health and bring harmony and peace in the society. Activities and Societies:  Cultural team Shivaji University Master of Business Administration (MBA),  Marketing & Information Technology Shivaji University Master of Business Administration (MBA),  Marketing & Information Technology Shivaji University Master of Business Administration (MBA),  Marketing & Information Technology Karnatak University B.Sc. (G.S.Sc. College- Belgaum),  - Physics ,  Maths and Electronics Karnatak University B.Sc. (G.S.Sc. College- Belgaum),  - Physics ,  Maths and Electronics Karnatak University B.Sc. (G.S.Sc. College- Belgaum),  - Physics ,  Maths and Electronics SVYASA Yoga University (Swami Vivekananda Yoga Anusandhana Samsthana) Certified Yoga Instructor Asanas, Kriyas, Pranayama, Meditations, Karma yoga. \n \nThe holistic way to prevent diseases, promote positive health and bring harmony and peace in the society. Activities and Societies:  Cultural team SVYASA Yoga University (Swami Vivekananda Yoga Anusandhana Samsthana) Certified Yoga Instructor Asanas, Kriyas, Pranayama, Meditations, Karma yoga. \n \nThe holistic way to prevent diseases, promote positive health and bring harmony and peace in the society. Activities and Societies:  Cultural team SVYASA Yoga University (Swami Vivekananda Yoga Anusandhana Samsthana) Certified Yoga Instructor Asanas, Kriyas, Pranayama, Meditations, Karma yoga. \n \nThe holistic way to prevent diseases, promote positive health and bring harmony and peace in the society. Activities and Societies:  Cultural team Honors & Awards Additional Honors & Awards Informatica Employee Of the Quater Q3-2007(India). Additional Honors & Awards Informatica Employee Of the Quater Q3-2007(India). Additional Honors & Awards Informatica Employee Of the Quater Q3-2007(India). Additional Honors & Awards Informatica Employee Of the Quater Q3-2007(India). ", "Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Sales Enablement Go-to-market Strategy Product Marketing Competitive Analysis Network Security Market Analysis Application Security Demand Generation SaaS Enterprise Software Product Management Cloud Computing Channel Messaging Information Security Enterprise Security Security Channel Partners Program Management Management Cross-functional Team... See 6+     See less Skills  Sales Enablement Go-to-market Strategy Product Marketing Competitive Analysis Network Security Market Analysis Application Security Demand Generation SaaS Enterprise Software Product Management Cloud Computing Channel Messaging Information Security Enterprise Security Security Channel Partners Program Management Management Cross-functional Team... See 6+     See less Sales Enablement Go-to-market Strategy Product Marketing Competitive Analysis Network Security Market Analysis Application Security Demand Generation SaaS Enterprise Software Product Management Cloud Computing Channel Messaging Information Security Enterprise Security Security Channel Partners Program Management Management Cross-functional Team... See 6+     See less Sales Enablement Go-to-market Strategy Product Marketing Competitive Analysis Network Security Market Analysis Application Security Demand Generation SaaS Enterprise Software Product Management Cloud Computing Channel Messaging Information Security Enterprise Security Security Channel Partners Program Management Management Cross-functional Team... See 6+     See less ", "Skills Enterprise Software Integration Competitive Analysis Sales Enablement Lead Generation Demand Generation New Business Development Product Development Marketing Semiconductors Go-to-market Strategy Partner Management Cloud Computing E-commerce Solution Selling Business Alliances Business Development Business Strategy Cross-functional Team... Product Marketing SaaS Strategy See 7+     See less Skills  Enterprise Software Integration Competitive Analysis Sales Enablement Lead Generation Demand Generation New Business Development Product Development Marketing Semiconductors Go-to-market Strategy Partner Management Cloud Computing E-commerce Solution Selling Business Alliances Business Development Business Strategy Cross-functional Team... Product Marketing SaaS Strategy See 7+     See less Enterprise Software Integration Competitive Analysis Sales Enablement Lead Generation Demand Generation New Business Development Product Development Marketing Semiconductors Go-to-market Strategy Partner Management Cloud Computing E-commerce Solution Selling Business Alliances Business Development Business Strategy Cross-functional Team... Product Marketing SaaS Strategy See 7+     See less Enterprise Software Integration Competitive Analysis Sales Enablement Lead Generation Demand Generation New Business Development Product Development Marketing Semiconductors Go-to-market Strategy Partner Management Cloud Computing E-commerce Solution Selling Business Alliances Business Development Business Strategy Cross-functional Team... Product Marketing SaaS Strategy See 7+     See less ", "Summary I am a hands on professional with Product Marketing and Product Management focus. I play an integral role in IBM Tealeaf's product marketing team, enjoy working closely with Product Management, Marketing Communications, Field Marketing and Sales teams across IBM to formulate marketing and positioning strategies. Summary I am a hands on professional with Product Marketing and Product Management focus. I play an integral role in IBM Tealeaf's product marketing team, enjoy working closely with Product Management, Marketing Communications, Field Marketing and Sales teams across IBM to formulate marketing and positioning strategies. I am a hands on professional with Product Marketing and Product Management focus. I play an integral role in IBM Tealeaf's product marketing team, enjoy working closely with Product Management, Marketing Communications, Field Marketing and Sales teams across IBM to formulate marketing and positioning strategies. I am a hands on professional with Product Marketing and Product Management focus. I play an integral role in IBM Tealeaf's product marketing team, enjoy working closely with Product Management, Marketing Communications, Field Marketing and Sales teams across IBM to formulate marketing and positioning strategies. Experience Product Marketing Manager IBM Tealeaf April 2014  – Present (1 year 5 months) San Francisco Bay Area IBM Tealeaf is an integral offer capability in IBM's Customer Engagement Solutions and MobileFirst Solutions. \n \n•\tDrive core Tealeaf solution, mobile and usability solution launches by planning and executing go-to-market plans \n•\tPlay a strategic role in driving Mobile & Usability initiatives with IBM solutions and technology partners \n•\tSpearhead go-to-market plan to expand international customer base in Latin America \n•\tDevelop and manage collaterals including sales presentations, product demonstrations, datasheets, case studies, whitepapers, success stories and win/loss analyses to enable sales team and business partners \n•\tDrive all IBM Tealeaf competitive analysis and ongoing market research and analysis on industry-specific eBusiness challenges to better understand market trends, develop marketing, sales and product strategy \n•\tDevelop ROI analysis and present ROI results to engage prospects that sped up the sales cycle \n•\tCreate and manage training and sales enablement materials to educate global IBM Sales Teams on product benefits and features in quarterly new hire training events and weekly brown bags to drive new and install base revenue \n•\tExecute from start to finish IBM’s presence at 10,000+ attendees conferences and IBM sponsored events \n•\tCo-lead in the field sales process and company events by giving presentations and demonstrations \n•\tSupport Product Management, Marketing Communications, Field Marketing and Sales Teams in developing content for various marketing programs, campaigns and events \n. Associate Product Marketing Manager IBM Tealeaf August 2012  –  April 2014  (1 year 9 months) San Francisco, CA •\tDrive various Tealeaf product and solution launches by formulating and executing market requirements documents, and go-to-market plans \n•\tDevelop and manage collaterals including sales presentations, product demonstrations, datasheets, case studies, whitepapers, success stories and win/loss analyses to enable sales team and partners \n•\tConduct competitive analysis and ongoing market research and analysis on industry-specific ebusiness challenges to better understand market trends to develop marketing and sales strategy \n•\tDevelop ROI analysis and present ROI results to engage prospects during the sales cycle \n•\tCreate training and sales enablement materials to educate global Tealeaf and IBM sales team on product benefits and features in quarterly new hire training events and weekly brown bags \n•\tSupport Product Management, Marketing Communications, Field Marketing and Sales Teams in developing content for various marketing programs, campaigns and events \n•\tParticipate in the field sales process and events by giving product presentations and demonstrations  \n•\tLead RFPs and RFIs to support global Tealeaf sales team Product Marketing Intern Tealeaf Technology February 2012  –  August 2012  (7 months) •\tCreated and managed product marketing collaterals such as sales presentations, case studies, success stories, datasheets, product demonstrations to assist in sales enablement \n•\tConducted market research and analysis on multiple software spaces such as Customer Experience Management, Application Performance Management, Web Analytics and Usability to determine messaging and go-to-market strategies across verticals \n•\tSupported in competitive analyses to understand the market landscape, strengthen products’ messaging and deposition competitors \n•\tLed RFPs and RFIs to support Tealeaf sales team in North America and EMEA \n•\tSupported cross-functional teams such as product management, corporate marketing, marketing programs and sales teams Administrative Assistant Haas School of Business February 2008  –  June 2011  (3 years 5 months) •\tCreated and analyzed various reports and presented findings to improve Haas MBA Career Services offerings such as core MBA programs, workshops, job fairs and advisor programs \n•\tResearched top MBA schools and their program offerings to better understand how Haas MBA Career Services can better support the student body and alumni in leadership events, professional workshops, and recruitment beyond the academic curriculum \n•\tCreated training materials to support professors, presenters and advisors for events and made available for students and alumni Product Marketing Manager IBM Tealeaf April 2014  – Present (1 year 5 months) San Francisco Bay Area IBM Tealeaf is an integral offer capability in IBM's Customer Engagement Solutions and MobileFirst Solutions. \n \n•\tDrive core Tealeaf solution, mobile and usability solution launches by planning and executing go-to-market plans \n•\tPlay a strategic role in driving Mobile & Usability initiatives with IBM solutions and technology partners \n•\tSpearhead go-to-market plan to expand international customer base in Latin America \n•\tDevelop and manage collaterals including sales presentations, product demonstrations, datasheets, case studies, whitepapers, success stories and win/loss analyses to enable sales team and business partners \n•\tDrive all IBM Tealeaf competitive analysis and ongoing market research and analysis on industry-specific eBusiness challenges to better understand market trends, develop marketing, sales and product strategy \n•\tDevelop ROI analysis and present ROI results to engage prospects that sped up the sales cycle \n•\tCreate and manage training and sales enablement materials to educate global IBM Sales Teams on product benefits and features in quarterly new hire training events and weekly brown bags to drive new and install base revenue \n•\tExecute from start to finish IBM’s presence at 10,000+ attendees conferences and IBM sponsored events \n•\tCo-lead in the field sales process and company events by giving presentations and demonstrations \n•\tSupport Product Management, Marketing Communications, Field Marketing and Sales Teams in developing content for various marketing programs, campaigns and events \n. Product Marketing Manager IBM Tealeaf April 2014  – Present (1 year 5 months) San Francisco Bay Area IBM Tealeaf is an integral offer capability in IBM's Customer Engagement Solutions and MobileFirst Solutions. \n \n•\tDrive core Tealeaf solution, mobile and usability solution launches by planning and executing go-to-market plans \n•\tPlay a strategic role in driving Mobile & Usability initiatives with IBM solutions and technology partners \n•\tSpearhead go-to-market plan to expand international customer base in Latin America \n•\tDevelop and manage collaterals including sales presentations, product demonstrations, datasheets, case studies, whitepapers, success stories and win/loss analyses to enable sales team and business partners \n•\tDrive all IBM Tealeaf competitive analysis and ongoing market research and analysis on industry-specific eBusiness challenges to better understand market trends, develop marketing, sales and product strategy \n•\tDevelop ROI analysis and present ROI results to engage prospects that sped up the sales cycle \n•\tCreate and manage training and sales enablement materials to educate global IBM Sales Teams on product benefits and features in quarterly new hire training events and weekly brown bags to drive new and install base revenue \n•\tExecute from start to finish IBM’s presence at 10,000+ attendees conferences and IBM sponsored events \n•\tCo-lead in the field sales process and company events by giving presentations and demonstrations \n•\tSupport Product Management, Marketing Communications, Field Marketing and Sales Teams in developing content for various marketing programs, campaigns and events \n. Associate Product Marketing Manager IBM Tealeaf August 2012  –  April 2014  (1 year 9 months) San Francisco, CA •\tDrive various Tealeaf product and solution launches by formulating and executing market requirements documents, and go-to-market plans \n•\tDevelop and manage collaterals including sales presentations, product demonstrations, datasheets, case studies, whitepapers, success stories and win/loss analyses to enable sales team and partners \n•\tConduct competitive analysis and ongoing market research and analysis on industry-specific ebusiness challenges to better understand market trends to develop marketing and sales strategy \n•\tDevelop ROI analysis and present ROI results to engage prospects during the sales cycle \n•\tCreate training and sales enablement materials to educate global Tealeaf and IBM sales team on product benefits and features in quarterly new hire training events and weekly brown bags \n•\tSupport Product Management, Marketing Communications, Field Marketing and Sales Teams in developing content for various marketing programs, campaigns and events \n•\tParticipate in the field sales process and events by giving product presentations and demonstrations  \n•\tLead RFPs and RFIs to support global Tealeaf sales team Associate Product Marketing Manager IBM Tealeaf August 2012  –  April 2014  (1 year 9 months) San Francisco, CA •\tDrive various Tealeaf product and solution launches by formulating and executing market requirements documents, and go-to-market plans \n•\tDevelop and manage collaterals including sales presentations, product demonstrations, datasheets, case studies, whitepapers, success stories and win/loss analyses to enable sales team and partners \n•\tConduct competitive analysis and ongoing market research and analysis on industry-specific ebusiness challenges to better understand market trends to develop marketing and sales strategy \n•\tDevelop ROI analysis and present ROI results to engage prospects during the sales cycle \n•\tCreate training and sales enablement materials to educate global Tealeaf and IBM sales team on product benefits and features in quarterly new hire training events and weekly brown bags \n•\tSupport Product Management, Marketing Communications, Field Marketing and Sales Teams in developing content for various marketing programs, campaigns and events \n•\tParticipate in the field sales process and events by giving product presentations and demonstrations  \n•\tLead RFPs and RFIs to support global Tealeaf sales team Product Marketing Intern Tealeaf Technology February 2012  –  August 2012  (7 months) •\tCreated and managed product marketing collaterals such as sales presentations, case studies, success stories, datasheets, product demonstrations to assist in sales enablement \n•\tConducted market research and analysis on multiple software spaces such as Customer Experience Management, Application Performance Management, Web Analytics and Usability to determine messaging and go-to-market strategies across verticals \n•\tSupported in competitive analyses to understand the market landscape, strengthen products’ messaging and deposition competitors \n•\tLed RFPs and RFIs to support Tealeaf sales team in North America and EMEA \n•\tSupported cross-functional teams such as product management, corporate marketing, marketing programs and sales teams Product Marketing Intern Tealeaf Technology February 2012  –  August 2012  (7 months) •\tCreated and managed product marketing collaterals such as sales presentations, case studies, success stories, datasheets, product demonstrations to assist in sales enablement \n•\tConducted market research and analysis on multiple software spaces such as Customer Experience Management, Application Performance Management, Web Analytics and Usability to determine messaging and go-to-market strategies across verticals \n•\tSupported in competitive analyses to understand the market landscape, strengthen products’ messaging and deposition competitors \n•\tLed RFPs and RFIs to support Tealeaf sales team in North America and EMEA \n•\tSupported cross-functional teams such as product management, corporate marketing, marketing programs and sales teams Administrative Assistant Haas School of Business February 2008  –  June 2011  (3 years 5 months) •\tCreated and analyzed various reports and presented findings to improve Haas MBA Career Services offerings such as core MBA programs, workshops, job fairs and advisor programs \n•\tResearched top MBA schools and their program offerings to better understand how Haas MBA Career Services can better support the student body and alumni in leadership events, professional workshops, and recruitment beyond the academic curriculum \n•\tCreated training materials to support professors, presenters and advisors for events and made available for students and alumni Administrative Assistant Haas School of Business February 2008  –  June 2011  (3 years 5 months) •\tCreated and analyzed various reports and presented findings to improve Haas MBA Career Services offerings such as core MBA programs, workshops, job fairs and advisor programs \n•\tResearched top MBA schools and their program offerings to better understand how Haas MBA Career Services can better support the student body and alumni in leadership events, professional workshops, and recruitment beyond the academic curriculum \n•\tCreated training materials to support professors, presenters and advisors for events and made available for students and alumni Languages Spanish Chinese Spanish Chinese Spanish Chinese Skills Product Marketing Market Research Marketing Communications Microsoft Excel Microsoft Office Competitive Analysis Management Analysis Social Media Social Networking Data Analysis Salesforce.com Recruiting Entrepreneurship Sales Sales Enablement PowerPoint HTML Photoshop Competitive Intelligence Social Media Marketing Microsoft Word Outlook Customer Service InDesign Negotiation International Trade Event Planning Business Analysis See 14+     See less Skills  Product Marketing Market Research Marketing Communications Microsoft Excel Microsoft Office Competitive Analysis Management Analysis Social Media Social Networking Data Analysis Salesforce.com Recruiting Entrepreneurship Sales Sales Enablement PowerPoint HTML Photoshop Competitive Intelligence Social Media Marketing Microsoft Word Outlook Customer Service InDesign Negotiation International Trade Event Planning Business Analysis See 14+     See less Product Marketing Market Research Marketing Communications Microsoft Excel Microsoft Office Competitive Analysis Management Analysis Social Media Social Networking Data Analysis Salesforce.com Recruiting Entrepreneurship Sales Sales Enablement PowerPoint HTML Photoshop Competitive Intelligence Social Media Marketing Microsoft Word Outlook Customer Service InDesign Negotiation International Trade Event Planning Business Analysis See 14+     See less Product Marketing Market Research Marketing Communications Microsoft Excel Microsoft Office Competitive Analysis Management Analysis Social Media Social Networking Data Analysis Salesforce.com Recruiting Entrepreneurship Sales Sales Enablement PowerPoint HTML Photoshop Competitive Intelligence Social Media Marketing Microsoft Word Outlook Customer Service InDesign Negotiation International Trade Event Planning Business Analysis See 14+     See less Education University of Michigan - Stephen M. Ross School of Business 2015  – 2017 University of Maryland - A. James Clark School of Engineering Master’s Degree, Business Entrepreneurship and Technology Innovation University of California, Berkeley Bachelor of Science (B.S.) University of California, Berkeley Introduction to High-Tech Product Management & Product Marketing Group 280 Optimal Product Management & Product Marketing Courses University of Michigan - Stephen M. Ross School of Business 2015  – 2017 University of Michigan - Stephen M. Ross School of Business 2015  – 2017 University of Michigan - Stephen M. Ross School of Business 2015  – 2017 University of Maryland - A. James Clark School of Engineering Master’s Degree, Business Entrepreneurship and Technology Innovation University of Maryland - A. James Clark School of Engineering Master’s Degree, Business Entrepreneurship and Technology Innovation University of Maryland - A. James Clark School of Engineering Master’s Degree, Business Entrepreneurship and Technology Innovation University of California, Berkeley Bachelor of Science (B.S.) University of California, Berkeley Bachelor of Science (B.S.) University of California, Berkeley Bachelor of Science (B.S.) University of California, Berkeley Introduction to High-Tech Product Management & Product Marketing University of California, Berkeley Introduction to High-Tech Product Management & Product Marketing University of California, Berkeley Introduction to High-Tech Product Management & Product Marketing Group 280 Optimal Product Management & Product Marketing Courses Group 280 Optimal Product Management & Product Marketing Courses Group 280 Optimal Product Management & Product Marketing Courses Honors & Awards IBM Eminence & Excellence Recognition Award April 2013 Award designed to recognize individual contributions and results above and beyond normal job role performance and expectations. \n \nContributed to: \n \nStrong sales effort by expanding customer use cases and creating new demos and collaterals for a broader sales team. These sales tools play an important part of our global sales strategy.  \n IBM Manager's Choice Award - focus on Unite and Get It Done June 2014 Award designed to recognize individual for the practice of Unite and Get It Done Now by collaborating rigorously with direct and extended teams to carry out 1H 2014 target goals. \n \n IBM Manager's Choice Award - focus on Share Expertise November 2014 Award designed to recognize individual for the practice of Share Expertise by collaborating IBM teams and customers across functions and geographies to expand competitive knowledge and share more meaningful materials for enablement use by sales and field teams.  IBM Manager's Choice Award - focus on Listen for Need, Envision the Future May 2015 Award designed to recognize individual for the practice of Listen for Need, Envision the Future by collaborating with many stakeholders across the IBM business to carry out the Customer Experience Analytics keynote demo that succinctly delivers the Customer Experience message and vision. IBM Manager's Choice Award - focus on Think. Prepare. Rehearse. June 2015 Award designed to recognize individual for the practice of Listen for Think. Prepare. Rehearse. by strategically working with different teams within the business to create thought leadership assets to educate and expand IBM value in the market. IBM Eminence & Excellence Recognition Award April 2013 Award designed to recognize individual contributions and results above and beyond normal job role performance and expectations. \n \nContributed to: \n \nStrong sales effort by expanding customer use cases and creating new demos and collaterals for a broader sales team. These sales tools play an important part of our global sales strategy.  \n IBM Eminence & Excellence Recognition Award April 2013 Award designed to recognize individual contributions and results above and beyond normal job role performance and expectations. \n \nContributed to: \n \nStrong sales effort by expanding customer use cases and creating new demos and collaterals for a broader sales team. These sales tools play an important part of our global sales strategy.  \n IBM Eminence & Excellence Recognition Award April 2013 Award designed to recognize individual contributions and results above and beyond normal job role performance and expectations. \n \nContributed to: \n \nStrong sales effort by expanding customer use cases and creating new demos and collaterals for a broader sales team. These sales tools play an important part of our global sales strategy.  \n IBM Manager's Choice Award - focus on Unite and Get It Done June 2014 Award designed to recognize individual for the practice of Unite and Get It Done Now by collaborating rigorously with direct and extended teams to carry out 1H 2014 target goals. \n \n IBM Manager's Choice Award - focus on Unite and Get It Done June 2014 Award designed to recognize individual for the practice of Unite and Get It Done Now by collaborating rigorously with direct and extended teams to carry out 1H 2014 target goals. \n \n IBM Manager's Choice Award - focus on Unite and Get It Done June 2014 Award designed to recognize individual for the practice of Unite and Get It Done Now by collaborating rigorously with direct and extended teams to carry out 1H 2014 target goals. \n \n IBM Manager's Choice Award - focus on Share Expertise November 2014 Award designed to recognize individual for the practice of Share Expertise by collaborating IBM teams and customers across functions and geographies to expand competitive knowledge and share more meaningful materials for enablement use by sales and field teams.  IBM Manager's Choice Award - focus on Share Expertise November 2014 Award designed to recognize individual for the practice of Share Expertise by collaborating IBM teams and customers across functions and geographies to expand competitive knowledge and share more meaningful materials for enablement use by sales and field teams.  IBM Manager's Choice Award - focus on Share Expertise November 2014 Award designed to recognize individual for the practice of Share Expertise by collaborating IBM teams and customers across functions and geographies to expand competitive knowledge and share more meaningful materials for enablement use by sales and field teams.  IBM Manager's Choice Award - focus on Listen for Need, Envision the Future May 2015 Award designed to recognize individual for the practice of Listen for Need, Envision the Future by collaborating with many stakeholders across the IBM business to carry out the Customer Experience Analytics keynote demo that succinctly delivers the Customer Experience message and vision. IBM Manager's Choice Award - focus on Listen for Need, Envision the Future May 2015 Award designed to recognize individual for the practice of Listen for Need, Envision the Future by collaborating with many stakeholders across the IBM business to carry out the Customer Experience Analytics keynote demo that succinctly delivers the Customer Experience message and vision. IBM Manager's Choice Award - focus on Listen for Need, Envision the Future May 2015 Award designed to recognize individual for the practice of Listen for Need, Envision the Future by collaborating with many stakeholders across the IBM business to carry out the Customer Experience Analytics keynote demo that succinctly delivers the Customer Experience message and vision. IBM Manager's Choice Award - focus on Think. Prepare. Rehearse. June 2015 Award designed to recognize individual for the practice of Listen for Think. Prepare. Rehearse. by strategically working with different teams within the business to create thought leadership assets to educate and expand IBM value in the market. IBM Manager's Choice Award - focus on Think. Prepare. Rehearse. June 2015 Award designed to recognize individual for the practice of Listen for Think. Prepare. Rehearse. by strategically working with different teams within the business to create thought leadership assets to educate and expand IBM value in the market. IBM Manager's Choice Award - focus on Think. Prepare. Rehearse. June 2015 Award designed to recognize individual for the practice of Listen for Think. Prepare. Rehearse. by strategically working with different teams within the business to create thought leadership assets to educate and expand IBM value in the market. ", "Skills Product Marketing Enterprise Software Go-to-market Strategy Demand Generation Sales Enablement Market Analysis Channel Product Management Business Alliances Cloud Computing SaaS Storage Solution Selling Multi-channel Marketing Product Launch Cross-functional Team... Competitive Analysis Channel Partners Marketing Management Strategic Partnerships Strategy Salesforce.com B2B Marketing CRM Lead Generation See 10+     See less Skills  Product Marketing Enterprise Software Go-to-market Strategy Demand Generation Sales Enablement Market Analysis Channel Product Management Business Alliances Cloud Computing SaaS Storage Solution Selling Multi-channel Marketing Product Launch Cross-functional Team... Competitive Analysis Channel Partners Marketing Management Strategic Partnerships Strategy Salesforce.com B2B Marketing CRM Lead Generation See 10+     See less Product Marketing Enterprise Software Go-to-market Strategy Demand Generation Sales Enablement Market Analysis Channel Product Management Business Alliances Cloud Computing SaaS Storage Solution Selling Multi-channel Marketing Product Launch Cross-functional Team... Competitive Analysis Channel Partners Marketing Management Strategic Partnerships Strategy Salesforce.com B2B Marketing CRM Lead Generation See 10+     See less Product Marketing Enterprise Software Go-to-market Strategy Demand Generation Sales Enablement Market Analysis Channel Product Management Business Alliances Cloud Computing SaaS Storage Solution Selling Multi-channel Marketing Product Launch Cross-functional Team... Competitive Analysis Channel Partners Marketing Management Strategic Partnerships Strategy Salesforce.com B2B Marketing CRM Lead Generation See 10+     See less ", "Summary Positionning BRMS in SOA and BPM markets \nEtablishing technical alliances \nPromoting ILOG Technology Specialties:BRMS: Business Rule Management Systems \nSales enablement \nSOA Industries Summary Positionning BRMS in SOA and BPM markets \nEtablishing technical alliances \nPromoting ILOG Technology Specialties:BRMS: Business Rule Management Systems \nSales enablement \nSOA Industries Positionning BRMS in SOA and BPM markets \nEtablishing technical alliances \nPromoting ILOG Technology Specialties:BRMS: Business Rule Management Systems \nSales enablement \nSOA Industries Positionning BRMS in SOA and BPM markets \nEtablishing technical alliances \nPromoting ILOG Technology Specialties:BRMS: Business Rule Management Systems \nSales enablement \nSOA Industries Experience Product Manager, IBM Operational Decision Manager IBM January 2014  – Present (1 year 8 months) IBM Sophia Antipolis Outbound product management, communication and enablement Sr Product Marketing Manager, IBM Operational Decision Management IBM August 2008  –  December 2013  (5 years 5 months) Product Marketing WebSphere BRMS IBM January 2010  –  October 2011  (1 year 10 months) Sr. Product Marketing Manager, IBM WebSphere Business Rules ILOG and IBM Company September 2006  –  January 2010  (3 years 5 months) Technical Marketing Strategique Alliances ILOG SA June 2004  –  September 2006  (2 years 4 months) Technical Account Manager ILOG November 1997  –  August 1999  (1 year 10 months) Product Manager, IBM Operational Decision Manager IBM January 2014  – Present (1 year 8 months) IBM Sophia Antipolis Outbound product management, communication and enablement Product Manager, IBM Operational Decision Manager IBM January 2014  – Present (1 year 8 months) IBM Sophia Antipolis Outbound product management, communication and enablement Sr Product Marketing Manager, IBM Operational Decision Management IBM August 2008  –  December 2013  (5 years 5 months) Sr Product Marketing Manager, IBM Operational Decision Management IBM August 2008  –  December 2013  (5 years 5 months) Product Marketing WebSphere BRMS IBM January 2010  –  October 2011  (1 year 10 months) Product Marketing WebSphere BRMS IBM January 2010  –  October 2011  (1 year 10 months) Sr. Product Marketing Manager, IBM WebSphere Business Rules ILOG and IBM Company September 2006  –  January 2010  (3 years 5 months) Sr. Product Marketing Manager, IBM WebSphere Business Rules ILOG and IBM Company September 2006  –  January 2010  (3 years 5 months) Technical Marketing Strategique Alliances ILOG SA June 2004  –  September 2006  (2 years 4 months) Technical Marketing Strategique Alliances ILOG SA June 2004  –  September 2006  (2 years 4 months) Technical Account Manager ILOG November 1997  –  August 1999  (1 year 10 months) Technical Account Manager ILOG November 1997  –  August 1999  (1 year 10 months) Skills Sales Enablement BRMS Product Marketing Pre-sales Business Process Design SaaS SOA Agile Methodologies Business Alliances Business Intelligence Business Rules Cloud Computing Enterprise Software Go-to-market Strategy ILOG Product Management Program Management Solution Selling Websphere Architecture WebSphere See 6+     See less Skills  Sales Enablement BRMS Product Marketing Pre-sales Business Process Design SaaS SOA Agile Methodologies Business Alliances Business Intelligence Business Rules Cloud Computing Enterprise Software Go-to-market Strategy ILOG Product Management Program Management Solution Selling Websphere Architecture WebSphere See 6+     See less Sales Enablement BRMS Product Marketing Pre-sales Business Process Design SaaS SOA Agile Methodologies Business Alliances Business Intelligence Business Rules Cloud Computing Enterprise Software Go-to-market Strategy ILOG Product Management Program Management Solution Selling Websphere Architecture WebSphere See 6+     See less Sales Enablement BRMS Product Marketing Pre-sales Business Process Design SaaS SOA Agile Methodologies Business Alliances Business Intelligence Business Rules Cloud Computing Enterprise Software Go-to-market Strategy ILOG Product Management Program Management Solution Selling Websphere Architecture WebSphere See 6+     See less ", "Summary Enterprise software professional with a passion for transforming useful technologies into successful businesses -- with expertise in product management, product marketing, business development, and sales engineering.  \n \nExtensive experience bringing offerings to market and leading product, portfolio, and marketing strategy. Successful track record leading strategic growth activities ranging from the launch of new products, to mergers and acquisitions, to managing offerings in excess of $100M in revenue.  \n \nDeep understanding across a range of enterprise IT delivery models, including cloud computing / SaaS, appliances, and software. Summary Enterprise software professional with a passion for transforming useful technologies into successful businesses -- with expertise in product management, product marketing, business development, and sales engineering.  \n \nExtensive experience bringing offerings to market and leading product, portfolio, and marketing strategy. Successful track record leading strategic growth activities ranging from the launch of new products, to mergers and acquisitions, to managing offerings in excess of $100M in revenue.  \n \nDeep understanding across a range of enterprise IT delivery models, including cloud computing / SaaS, appliances, and software. Enterprise software professional with a passion for transforming useful technologies into successful businesses -- with expertise in product management, product marketing, business development, and sales engineering.  \n \nExtensive experience bringing offerings to market and leading product, portfolio, and marketing strategy. Successful track record leading strategic growth activities ranging from the launch of new products, to mergers and acquisitions, to managing offerings in excess of $100M in revenue.  \n \nDeep understanding across a range of enterprise IT delivery models, including cloud computing / SaaS, appliances, and software. Enterprise software professional with a passion for transforming useful technologies into successful businesses -- with expertise in product management, product marketing, business development, and sales engineering.  \n \nExtensive experience bringing offerings to market and leading product, portfolio, and marketing strategy. Successful track record leading strategic growth activities ranging from the launch of new products, to mergers and acquisitions, to managing offerings in excess of $100M in revenue.  \n \nDeep understanding across a range of enterprise IT delivery models, including cloud computing / SaaS, appliances, and software. Experience Program Director, Product Management, IBM BPM IBM June 2014  – Present (1 year 3 months) San Francisco Bay Area Business leader for the market-leading BPM offering, IBM Business Process Manager, and the product management team.  Program Director, Product Management, IBM BPM IBM June 2014  – Present (1 year 3 months) San Francisco Bay Area Business leader for the market-leading BPM offering, IBM Business Process Manager, and the product management team.  Program Director, Product Management, IBM BPM IBM June 2014  – Present (1 year 3 months) San Francisco Bay Area Business leader for the market-leading BPM offering, IBM Business Process Manager, and the product management team.  Skills Enterprise Software Product Management Product Marketing Business Development Mergers & Acquisitions Sales Engineering Cloud Computing SaaS PaaS SOA Middleware EAI Integration Websphere Cross-functional Team... Technical Marketing Business Process Strategy Go-to-market Strategy Product Launch Management Sales Enablement Strategic Partnerships Pre-sales See 9+     See less Skills  Enterprise Software Product Management Product Marketing Business Development Mergers & Acquisitions Sales Engineering Cloud Computing SaaS PaaS SOA Middleware EAI Integration Websphere Cross-functional Team... Technical Marketing Business Process Strategy Go-to-market Strategy Product Launch Management Sales Enablement Strategic Partnerships Pre-sales See 9+     See less Enterprise Software Product Management Product Marketing Business Development Mergers & Acquisitions Sales Engineering Cloud Computing SaaS PaaS SOA Middleware EAI Integration Websphere Cross-functional Team... Technical Marketing Business Process Strategy Go-to-market Strategy Product Launch Management Sales Enablement Strategic Partnerships Pre-sales See 9+     See less Enterprise Software Product Management Product Marketing Business Development Mergers & Acquisitions Sales Engineering Cloud Computing SaaS PaaS SOA Middleware EAI Integration Websphere Cross-functional Team... Technical Marketing Business Process Strategy Go-to-market Strategy Product Launch Management Sales Enablement Strategic Partnerships Pre-sales See 9+     See less ", "Summary 20+ years of marketing supply chain and decision optimization technologies.  \n \nStrengths: Integrated Marketing - Business Process Improvement - Cross Functional Team Building Summary 20+ years of marketing supply chain and decision optimization technologies.  \n \nStrengths: Integrated Marketing - Business Process Improvement - Cross Functional Team Building 20+ years of marketing supply chain and decision optimization technologies.  \n \nStrengths: Integrated Marketing - Business Process Improvement - Cross Functional Team Building 20+ years of marketing supply chain and decision optimization technologies.  \n \nStrengths: Integrated Marketing - Business Process Improvement - Cross Functional Team Building Experience Portfolio Marketing Manager, Commerce Solutions IBM January 2015  – Present (8 months) Market Segment Manager, IBM Decision Optimization IBM Software 2009  – Present (6 years) greater chicago area Co-Founder Waukegan Arts District May 2013  – Present (2 years 4 months) Waukegan, Illinois Portfolio Marketing Manager IBM Commerce 2015  –  2015  (less than a year) Portfolio Marketing Manager IBM Commerce 2015  –  2015  (less than a year) Marketing Specialist Summer Saturdays Lakefront Concerts 2012  –  2012  (less than a year) Volunteer WMS Mardi Gras Promo Committee 2012  –  2012  (less than a year) Marketing Specialist #WeGotThis 2011  –  2012  (1 year) MarketingSpecialist ZombieWAUK 2011  –  2012  (1 year) Marketing Specialist ZombiWAUK, HolidayWAUK, ArtWAUK 2011  –  2012  (1 year) Sr. Marketing Manager, Supply Chain Applications ILOG, Inc. October 1999  –  January 2010  (10 years 4 months) Product Marketing Manager IBM 2009  –  2010  (1 year) Sr. Marketing Manager, Supply Chain Applications IBM (formerly ILOG) 2007  –  2009  (2 years) Director of Marketing LogicTools October 1999  –  February 2007  (7 years 5 months) Department Administrator Northwestern University February 1997  –  October 1999  (2 years 9 months) Portfolio Marketing Manager, Commerce Solutions IBM January 2015  – Present (8 months) Portfolio Marketing Manager, Commerce Solutions IBM January 2015  – Present (8 months) Market Segment Manager, IBM Decision Optimization IBM Software 2009  – Present (6 years) greater chicago area Market Segment Manager, IBM Decision Optimization IBM Software 2009  – Present (6 years) greater chicago area Co-Founder Waukegan Arts District May 2013  – Present (2 years 4 months) Waukegan, Illinois Co-Founder Waukegan Arts District May 2013  – Present (2 years 4 months) Waukegan, Illinois Portfolio Marketing Manager IBM Commerce 2015  –  2015  (less than a year) Portfolio Marketing Manager IBM Commerce 2015  –  2015  (less than a year) Portfolio Marketing Manager IBM Commerce 2015  –  2015  (less than a year) Portfolio Marketing Manager IBM Commerce 2015  –  2015  (less than a year) Marketing Specialist Summer Saturdays Lakefront Concerts 2012  –  2012  (less than a year) Marketing Specialist Summer Saturdays Lakefront Concerts 2012  –  2012  (less than a year) Volunteer WMS Mardi Gras Promo Committee 2012  –  2012  (less than a year) Volunteer WMS Mardi Gras Promo Committee 2012  –  2012  (less than a year) Marketing Specialist #WeGotThis 2011  –  2012  (1 year) Marketing Specialist #WeGotThis 2011  –  2012  (1 year) MarketingSpecialist ZombieWAUK 2011  –  2012  (1 year) MarketingSpecialist ZombieWAUK 2011  –  2012  (1 year) Marketing Specialist ZombiWAUK, HolidayWAUK, ArtWAUK 2011  –  2012  (1 year) Marketing Specialist ZombiWAUK, HolidayWAUK, ArtWAUK 2011  –  2012  (1 year) Sr. Marketing Manager, Supply Chain Applications ILOG, Inc. October 1999  –  January 2010  (10 years 4 months) Sr. Marketing Manager, Supply Chain Applications ILOG, Inc. October 1999  –  January 2010  (10 years 4 months) Product Marketing Manager IBM 2009  –  2010  (1 year) Product Marketing Manager IBM 2009  –  2010  (1 year) Sr. Marketing Manager, Supply Chain Applications IBM (formerly ILOG) 2007  –  2009  (2 years) Sr. Marketing Manager, Supply Chain Applications IBM (formerly ILOG) 2007  –  2009  (2 years) Director of Marketing LogicTools October 1999  –  February 2007  (7 years 5 months) Director of Marketing LogicTools October 1999  –  February 2007  (7 years 5 months) Department Administrator Northwestern University February 1997  –  October 1999  (2 years 9 months) Department Administrator Northwestern University February 1997  –  October 1999  (2 years 9 months) Languages French French French Skills Subject Matter Expert... Excels in... Grass roots marketing... Public Relations Social Media Marketing Cross Selling Up-selling Destination Branding Customer Experience B2B Marketing B2C Marketing Cross Promotions Collaborative Problem... Supply Chain Communications Audits Lead Generation Marketing Optimizations Marketing Management Management B2C marketing Optimization Social Media Sales Enablement Online Advertising Enterprise Software Program Management Sales Operations Sales CRM Demand Generation Product Marketing Strategy See 18+     See less Skills  Subject Matter Expert... Excels in... Grass roots marketing... Public Relations Social Media Marketing Cross Selling Up-selling Destination Branding Customer Experience B2B Marketing B2C Marketing Cross Promotions Collaborative Problem... Supply Chain Communications Audits Lead Generation Marketing Optimizations Marketing Management Management B2C marketing Optimization Social Media Sales Enablement Online Advertising Enterprise Software Program Management Sales Operations Sales CRM Demand Generation Product Marketing Strategy See 18+     See less Subject Matter Expert... Excels in... Grass roots marketing... Public Relations Social Media Marketing Cross Selling Up-selling Destination Branding Customer Experience B2B Marketing B2C Marketing Cross Promotions Collaborative Problem... Supply Chain Communications Audits Lead Generation Marketing Optimizations Marketing Management Management B2C marketing Optimization Social Media Sales Enablement Online Advertising Enterprise Software Program Management Sales Operations Sales CRM Demand Generation Product Marketing Strategy See 18+     See less Subject Matter Expert... Excels in... Grass roots marketing... Public Relations Social Media Marketing Cross Selling Up-selling Destination Branding Customer Experience B2B Marketing B2C Marketing Cross Promotions Collaborative Problem... Supply Chain Communications Audits Lead Generation Marketing Optimizations Marketing Management Management B2C marketing Optimization Social Media Sales Enablement Online Advertising Enterprise Software Program Management Sales Operations Sales CRM Demand Generation Product Marketing Strategy See 18+     See less Education Lake Forest Graduate School of Management MBA 2003  – 2006 Northwestern University B.S. 1994  – 1996 Waukegan East High School HS Diploma 1986  – 1989 Lake Forest Graduate School of Management MBA 2003  – 2006 Lake Forest Graduate School of Management MBA 2003  – 2006 Lake Forest Graduate School of Management MBA 2003  – 2006 Northwestern University B.S. 1994  – 1996 Northwestern University B.S. 1994  – 1996 Northwestern University B.S. 1994  – 1996 Waukegan East High School HS Diploma 1986  – 1989 Waukegan East High School HS Diploma 1986  – 1989 Waukegan East High School HS Diploma 1986  – 1989 Honors & Awards IBM Experience & Eminence Marketing Award Maria Winans May 2012 Recognition for outstanding achievment in content development for sales enablement.  Waukegan Spirit Month: Proclamation City of Waukegan September 2011 Whereas the City of Waukegan recognizes the month of September as Waukegan Spirit Month. WAUKtober: Proclamation City of Waukegn September 2011 Whereas the month of October will be referred to hereafter as \"WAUKtober\" to build Waukegan's brand as a tourist destination. Additional Honors & Awards IBM Experience & Eminence Marketing Award \nMay 2012  \n \nRecognition for outstanding achievment in content development for sales enablement. IBM Experience & Eminence Marketing Award Maria Winans May 2012 Recognition for outstanding achievment in content development for sales enablement.  IBM Experience & Eminence Marketing Award Maria Winans May 2012 Recognition for outstanding achievment in content development for sales enablement.  IBM Experience & Eminence Marketing Award Maria Winans May 2012 Recognition for outstanding achievment in content development for sales enablement.  Waukegan Spirit Month: Proclamation City of Waukegan September 2011 Whereas the City of Waukegan recognizes the month of September as Waukegan Spirit Month. Waukegan Spirit Month: Proclamation City of Waukegan September 2011 Whereas the City of Waukegan recognizes the month of September as Waukegan Spirit Month. Waukegan Spirit Month: Proclamation City of Waukegan September 2011 Whereas the City of Waukegan recognizes the month of September as Waukegan Spirit Month. WAUKtober: Proclamation City of Waukegn September 2011 Whereas the month of October will be referred to hereafter as \"WAUKtober\" to build Waukegan's brand as a tourist destination. WAUKtober: Proclamation City of Waukegn September 2011 Whereas the month of October will be referred to hereafter as \"WAUKtober\" to build Waukegan's brand as a tourist destination. WAUKtober: Proclamation City of Waukegn September 2011 Whereas the month of October will be referred to hereafter as \"WAUKtober\" to build Waukegan's brand as a tourist destination. Additional Honors & Awards IBM Experience & Eminence Marketing Award \nMay 2012  \n \nRecognition for outstanding achievment in content development for sales enablement. Additional Honors & Awards IBM Experience & Eminence Marketing Award \nMay 2012  \n \nRecognition for outstanding achievment in content development for sales enablement. Additional Honors & Awards IBM Experience & Eminence Marketing Award \nMay 2012  \n \nRecognition for outstanding achievment in content development for sales enablement. ", "Skills Marketing Demand Generation Solution Selling Sales Enablement Go-to-market Strategy SaaS Enterprise Software Virtualization Business Alliances Product Management Program Management Product Marketing Cloud Computing Strategy Management Skills  Marketing Demand Generation Solution Selling Sales Enablement Go-to-market Strategy SaaS Enterprise Software Virtualization Business Alliances Product Management Program Management Product Marketing Cloud Computing Strategy Management Marketing Demand Generation Solution Selling Sales Enablement Go-to-market Strategy SaaS Enterprise Software Virtualization Business Alliances Product Management Program Management Product Marketing Cloud Computing Strategy Management Marketing Demand Generation Solution Selling Sales Enablement Go-to-market Strategy SaaS Enterprise Software Virtualization Business Alliances Product Management Program Management Product Marketing Cloud Computing Strategy Management ", "Languages English Native or bilingual proficiency French Full professional proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Full professional proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Full professional proficiency Spanish Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Skills Product Management Product Marketing Project Management Virtualization Software Development... Servers Enterprise Software Cross-functional Team... Go-to-market Strategy Strategic Planning Business Strategy Competitive Analysis Business Alliances Skills  Product Management Product Marketing Project Management Virtualization Software Development... Servers Enterprise Software Cross-functional Team... Go-to-market Strategy Strategic Planning Business Strategy Competitive Analysis Business Alliances Product Management Product Marketing Project Management Virtualization Software Development... Servers Enterprise Software Cross-functional Team... Go-to-market Strategy Strategic Planning Business Strategy Competitive Analysis Business Alliances Product Management Product Marketing Project Management Virtualization Software Development... Servers Enterprise Software Cross-functional Team... Go-to-market Strategy Strategic Planning Business Strategy Competitive Analysis Business Alliances ", "Experience Program Director, Cloud and Linux Portfolio Marketing IBM August 2015  – Present (1 month) Marketing Team Lead, Smarter Process Solutions IBM July 2013  – Present (2 years 2 months) Senior Product Marketing Manager IBM Operational Decision Manager IBM December 2012  –  July 2013  (8 months) Senior Product Marketing Manager IBM SOA Marketing Lead / SOA Solutions IBM November 2011  –  December 2012  (1 year 2 months) Led cross-IBM SOA marketing from messaging to GTM, including pipeline, enablement, events, key analyst relationships, content creation, customer references interlock. \n \nExtended role as Latin America interlock, meeting with market segment manager (MSM) focal points for Brazil, Mexico and SSA (Spanish South America). Product Marketing Manager IBM SOA Solutions IBM July 2010  –  November 2011  (1 year 5 months) Product marketing manager for IBM WebSphere Enterprise Service Bus (WESB), WebSphere Enterprise Service Bus Registry Edition (WESB RE), and WebSphere Service Registry and Repository (WSRR). Product Marketing Manager IBM BPM, Business Event Processing Marketing Focal IBM January 2008  –  July 2010  (2 years 7 months) Product marketing lead for AptSoft acquisition; content lead for IBM WebSphere Business Events. \n \nDrove IBM business event processing (BEP) category level messaging and go-to-market strategy. \n \nOwned BPM adoption pattern, “Transforming Insight into Action” including marketing ownership of IBM WebSphere Business Process Monitor. Software Engineer II IBM Healthcare and Life Sciences IBM August 2005  –  January 2008  (2 years 6 months) Designed, developed, and supported SCORE (Solution for Compliance in a Regulated Environment) offering, including Electronic Common Technical Document (eCTD) support. \n \nManaged development infrastructure, including BladeCenters, Blades, and xSeries servers. \n \nLed customer demo work for clients including GlaxoSmithKline. Software Engineer IBM Content Manager Group IBM January 2002  –  July 2005  (3 years 7 months) Designed and coded Content Manger plugin for Microsoft Outlook.  \n \nLed Linux port of Content Manager System Administrator. \n \nDrove integration of Content Manger eClient (web-based data access utility) and OnDemand.  \n \neClient APAR (Customer defect) management and SVT support; ISV work including design and coding of PeopleSoft integration for eClient Software Engineer IBM Electronic Media Management System (EMMS) IBM May 2000  –  January 2002  (1 year 9 months) EMMS was an iTunes application long before iTunes. \n \nDesigned, coded, ported TestStore (web-based storefront) and EMMS Web Commerce Enabler (EWCE).  \n \nOwned skin maintenance and design for the EMMS end-user media player. \n \nWrote Mad Fusion/JavaScript forms for Clearing House and Content Host. \n \nDesigned, coded and led migration of CD/DDP Extractor Tools, Clip Generation and DB2 database support for Content Mastering function. Program Director, Cloud and Linux Portfolio Marketing IBM August 2015  – Present (1 month) Program Director, Cloud and Linux Portfolio Marketing IBM August 2015  – Present (1 month) Marketing Team Lead, Smarter Process Solutions IBM July 2013  – Present (2 years 2 months) Marketing Team Lead, Smarter Process Solutions IBM July 2013  – Present (2 years 2 months) Senior Product Marketing Manager IBM Operational Decision Manager IBM December 2012  –  July 2013  (8 months) Senior Product Marketing Manager IBM Operational Decision Manager IBM December 2012  –  July 2013  (8 months) Senior Product Marketing Manager IBM SOA Marketing Lead / SOA Solutions IBM November 2011  –  December 2012  (1 year 2 months) Led cross-IBM SOA marketing from messaging to GTM, including pipeline, enablement, events, key analyst relationships, content creation, customer references interlock. \n \nExtended role as Latin America interlock, meeting with market segment manager (MSM) focal points for Brazil, Mexico and SSA (Spanish South America). Senior Product Marketing Manager IBM SOA Marketing Lead / SOA Solutions IBM November 2011  –  December 2012  (1 year 2 months) Led cross-IBM SOA marketing from messaging to GTM, including pipeline, enablement, events, key analyst relationships, content creation, customer references interlock. \n \nExtended role as Latin America interlock, meeting with market segment manager (MSM) focal points for Brazil, Mexico and SSA (Spanish South America). Product Marketing Manager IBM SOA Solutions IBM July 2010  –  November 2011  (1 year 5 months) Product marketing manager for IBM WebSphere Enterprise Service Bus (WESB), WebSphere Enterprise Service Bus Registry Edition (WESB RE), and WebSphere Service Registry and Repository (WSRR). Product Marketing Manager IBM SOA Solutions IBM July 2010  –  November 2011  (1 year 5 months) Product marketing manager for IBM WebSphere Enterprise Service Bus (WESB), WebSphere Enterprise Service Bus Registry Edition (WESB RE), and WebSphere Service Registry and Repository (WSRR). Product Marketing Manager IBM BPM, Business Event Processing Marketing Focal IBM January 2008  –  July 2010  (2 years 7 months) Product marketing lead for AptSoft acquisition; content lead for IBM WebSphere Business Events. \n \nDrove IBM business event processing (BEP) category level messaging and go-to-market strategy. \n \nOwned BPM adoption pattern, “Transforming Insight into Action” including marketing ownership of IBM WebSphere Business Process Monitor. Product Marketing Manager IBM BPM, Business Event Processing Marketing Focal IBM January 2008  –  July 2010  (2 years 7 months) Product marketing lead for AptSoft acquisition; content lead for IBM WebSphere Business Events. \n \nDrove IBM business event processing (BEP) category level messaging and go-to-market strategy. \n \nOwned BPM adoption pattern, “Transforming Insight into Action” including marketing ownership of IBM WebSphere Business Process Monitor. Software Engineer II IBM Healthcare and Life Sciences IBM August 2005  –  January 2008  (2 years 6 months) Designed, developed, and supported SCORE (Solution for Compliance in a Regulated Environment) offering, including Electronic Common Technical Document (eCTD) support. \n \nManaged development infrastructure, including BladeCenters, Blades, and xSeries servers. \n \nLed customer demo work for clients including GlaxoSmithKline. Software Engineer II IBM Healthcare and Life Sciences IBM August 2005  –  January 2008  (2 years 6 months) Designed, developed, and supported SCORE (Solution for Compliance in a Regulated Environment) offering, including Electronic Common Technical Document (eCTD) support. \n \nManaged development infrastructure, including BladeCenters, Blades, and xSeries servers. \n \nLed customer demo work for clients including GlaxoSmithKline. Software Engineer IBM Content Manager Group IBM January 2002  –  July 2005  (3 years 7 months) Designed and coded Content Manger plugin for Microsoft Outlook.  \n \nLed Linux port of Content Manager System Administrator. \n \nDrove integration of Content Manger eClient (web-based data access utility) and OnDemand.  \n \neClient APAR (Customer defect) management and SVT support; ISV work including design and coding of PeopleSoft integration for eClient Software Engineer IBM Content Manager Group IBM January 2002  –  July 2005  (3 years 7 months) Designed and coded Content Manger plugin for Microsoft Outlook.  \n \nLed Linux port of Content Manager System Administrator. \n \nDrove integration of Content Manger eClient (web-based data access utility) and OnDemand.  \n \neClient APAR (Customer defect) management and SVT support; ISV work including design and coding of PeopleSoft integration for eClient Software Engineer IBM Electronic Media Management System (EMMS) IBM May 2000  –  January 2002  (1 year 9 months) EMMS was an iTunes application long before iTunes. \n \nDesigned, coded, ported TestStore (web-based storefront) and EMMS Web Commerce Enabler (EWCE).  \n \nOwned skin maintenance and design for the EMMS end-user media player. \n \nWrote Mad Fusion/JavaScript forms for Clearing House and Content Host. \n \nDesigned, coded and led migration of CD/DDP Extractor Tools, Clip Generation and DB2 database support for Content Mastering function. Software Engineer IBM Electronic Media Management System (EMMS) IBM May 2000  –  January 2002  (1 year 9 months) EMMS was an iTunes application long before iTunes. \n \nDesigned, coded, ported TestStore (web-based storefront) and EMMS Web Commerce Enabler (EWCE).  \n \nOwned skin maintenance and design for the EMMS end-user media player. \n \nWrote Mad Fusion/JavaScript forms for Clearing House and Content Host. \n \nDesigned, coded and led migration of CD/DDP Extractor Tools, Clip Generation and DB2 database support for Content Mastering function. Languages Spanish (working knowledge) Spanish (working knowledge) Spanish (working knowledge) Skills Marketing Java Marketing Strategy Marketing Support Marketing Operations Business Integration Service Oriented... C++ Linux MacBook Accounting SQL JavaScript HTML Strategy Business Analysis Event Processing Business Rules IBM BPM WebSphere ESB WebSphere Application... Messaging Positioning Storytelling Sales Enablement Salesforce Training PowerPoint PowerPoint development Graphic Presentations REXX Turbo Pascal XML Ant Perl VBScript Visual Basic Creative Strategy DB2 Oracle Microsoft Office Unix AIX Teaming Cross-cultural Acoustic Guitar Singer-songwriter Customer-facing Fashion Writing Communications See 35+     See less Skills  Marketing Java Marketing Strategy Marketing Support Marketing Operations Business Integration Service Oriented... C++ Linux MacBook Accounting SQL JavaScript HTML Strategy Business Analysis Event Processing Business Rules IBM BPM WebSphere ESB WebSphere Application... Messaging Positioning Storytelling Sales Enablement Salesforce Training PowerPoint PowerPoint development Graphic Presentations REXX Turbo Pascal XML Ant Perl VBScript Visual Basic Creative Strategy DB2 Oracle Microsoft Office Unix AIX Teaming Cross-cultural Acoustic Guitar Singer-songwriter Customer-facing Fashion Writing Communications See 35+     See less Marketing Java Marketing Strategy Marketing Support Marketing Operations Business Integration Service Oriented... C++ Linux MacBook Accounting SQL JavaScript HTML Strategy Business Analysis Event Processing Business Rules IBM BPM WebSphere ESB WebSphere Application... Messaging Positioning Storytelling Sales Enablement Salesforce Training PowerPoint PowerPoint development Graphic Presentations REXX Turbo Pascal XML Ant Perl VBScript Visual Basic Creative Strategy DB2 Oracle Microsoft Office Unix AIX Teaming Cross-cultural Acoustic Guitar Singer-songwriter Customer-facing Fashion Writing Communications See 35+     See less Marketing Java Marketing Strategy Marketing Support Marketing Operations Business Integration Service Oriented... C++ Linux MacBook Accounting SQL JavaScript HTML Strategy Business Analysis Event Processing Business Rules IBM BPM WebSphere ESB WebSphere Application... Messaging Positioning Storytelling Sales Enablement Salesforce Training PowerPoint PowerPoint development Graphic Presentations REXX Turbo Pascal XML Ant Perl VBScript Visual Basic Creative Strategy DB2 Oracle Microsoft Office Unix AIX Teaming Cross-cultural Acoustic Guitar Singer-songwriter Customer-facing Fashion Writing Communications See 35+     See less Education University of Florida Master of Business Administration (M.B.A.) 2005  – 2006 • Sponsored by IBM \n• Relevant courses: Operations Management, International Finance,  \nCorporate Finance, Professional Writing, Business Law, Entrepreneurship and Venture Finance, Business-to-Business Marketing, Brand Marketing, Business Strategy  \n• Cumulative Grade Point Average: 3.5/4.0 Case Western Reserve University Bachelor of Science (B.S.),  Management (Accounting Concentration) 1996  – 2001 Case Western Reserve University Bachelor of Arts (B.A.),  Computer Science 1996  – 2001 University of Florida Master of Business Administration (M.B.A.) 2005  – 2006 • Sponsored by IBM \n• Relevant courses: Operations Management, International Finance,  \nCorporate Finance, Professional Writing, Business Law, Entrepreneurship and Venture Finance, Business-to-Business Marketing, Brand Marketing, Business Strategy  \n• Cumulative Grade Point Average: 3.5/4.0 University of Florida Master of Business Administration (M.B.A.) 2005  – 2006 • Sponsored by IBM \n• Relevant courses: Operations Management, International Finance,  \nCorporate Finance, Professional Writing, Business Law, Entrepreneurship and Venture Finance, Business-to-Business Marketing, Brand Marketing, Business Strategy  \n• Cumulative Grade Point Average: 3.5/4.0 University of Florida Master of Business Administration (M.B.A.) 2005  – 2006 • Sponsored by IBM \n• Relevant courses: Operations Management, International Finance,  \nCorporate Finance, Professional Writing, Business Law, Entrepreneurship and Venture Finance, Business-to-Business Marketing, Brand Marketing, Business Strategy  \n• Cumulative Grade Point Average: 3.5/4.0 Case Western Reserve University Bachelor of Science (B.S.),  Management (Accounting Concentration) 1996  – 2001 Case Western Reserve University Bachelor of Science (B.S.),  Management (Accounting Concentration) 1996  – 2001 Case Western Reserve University Bachelor of Science (B.S.),  Management (Accounting Concentration) 1996  – 2001 Case Western Reserve University Bachelor of Arts (B.A.),  Computer Science 1996  – 2001 Case Western Reserve University Bachelor of Arts (B.A.),  Computer Science 1996  – 2001 Case Western Reserve University Bachelor of Arts (B.A.),  Computer Science 1996  – 2001 Honors & Awards Product Marketing Manager IBM 3x WebSphere Quarterly Marketing Team Winner Product Marketing Manager IBM 2x BPM \"Emmy\" Award for marketing excellence in BPM Product Marketing Manager IBM IBM Top Contributor Product Marketing Manager IBM Impact Conference (annual WebSphere software conference) award for SOA marketing Product Marketing Manager IBM 3x WebSphere Quarterly Marketing Team Winner Product Marketing Manager IBM 3x WebSphere Quarterly Marketing Team Winner Product Marketing Manager IBM 3x WebSphere Quarterly Marketing Team Winner Product Marketing Manager IBM 2x BPM \"Emmy\" Award for marketing excellence in BPM Product Marketing Manager IBM 2x BPM \"Emmy\" Award for marketing excellence in BPM Product Marketing Manager IBM 2x BPM \"Emmy\" Award for marketing excellence in BPM Product Marketing Manager IBM IBM Top Contributor Product Marketing Manager IBM IBM Top Contributor Product Marketing Manager IBM IBM Top Contributor Product Marketing Manager IBM Impact Conference (annual WebSphere software conference) award for SOA marketing Product Marketing Manager IBM Impact Conference (annual WebSphere software conference) award for SOA marketing Product Marketing Manager IBM Impact Conference (annual WebSphere software conference) award for SOA marketing ", "Summary Consistent achievement directing global initiatives focused on improving sales execution, productivity, and winning in an intensely competitive marketplace. Product marketing manager for an extensive portfolio of hardware and software offerings at IBM. Extensive experience in Customer Relationship Managment design and implementation. Specialties:Managing Global Projects and Programs \nProduct Marketing and Management \nSales enablement \nAlliance Management  \nCustomer Relationship Management \nSAP CRM \nSalesforce.com CRM \nBusiness Transformation \nPartner and Customer Development  \nSales Pipeline Management \nSales Methodology Summary Consistent achievement directing global initiatives focused on improving sales execution, productivity, and winning in an intensely competitive marketplace. Product marketing manager for an extensive portfolio of hardware and software offerings at IBM. Extensive experience in Customer Relationship Managment design and implementation. Specialties:Managing Global Projects and Programs \nProduct Marketing and Management \nSales enablement \nAlliance Management  \nCustomer Relationship Management \nSAP CRM \nSalesforce.com CRM \nBusiness Transformation \nPartner and Customer Development  \nSales Pipeline Management \nSales Methodology Consistent achievement directing global initiatives focused on improving sales execution, productivity, and winning in an intensely competitive marketplace. Product marketing manager for an extensive portfolio of hardware and software offerings at IBM. Extensive experience in Customer Relationship Managment design and implementation. Specialties:Managing Global Projects and Programs \nProduct Marketing and Management \nSales enablement \nAlliance Management  \nCustomer Relationship Management \nSAP CRM \nSalesforce.com CRM \nBusiness Transformation \nPartner and Customer Development  \nSales Pipeline Management \nSales Methodology Consistent achievement directing global initiatives focused on improving sales execution, productivity, and winning in an intensely competitive marketplace. Product marketing manager for an extensive portfolio of hardware and software offerings at IBM. Extensive experience in Customer Relationship Managment design and implementation. Specialties:Managing Global Projects and Programs \nProduct Marketing and Management \nSales enablement \nAlliance Management  \nCustomer Relationship Management \nSAP CRM \nSalesforce.com CRM \nBusiness Transformation \nPartner and Customer Development  \nSales Pipeline Management \nSales Methodology Experience Product Marketing Manager Lenovo October 2014  – Present (11 months) Raleigh-Durham, North Carolina Area Product Marketing Manager at Lenovo as the result of the acquisition by Lenovo of IBM's System x Server Division. Responsible for the Flex System advanced, integrated server product portfolio. Responsible for all aspects of product life cycle management, from concept through end of life, including: market requirements, product definitions, technology selection, product development, product pricing, volumes and transition planning, product launch, lifecycle management and end of life achieving revenue and profit goals. Product Marketing Manager, IBM Flex System IBM 2010  – Present (5 years) Research Triangle Park, NC, USA Product Marketing Manager for IBM Flex System advanced server platform. Responsible for all aspects of product life cycle management, from concept through end of life, including: market requirements, product definitions, technology selection, product development, product pricing, volumes and transition planning, product launch, lifecycle management and end of life achieving revenue and profit goals. Director, CRM Operations Lenovo 2005  –  2009  (4 years) Provided leadership for Sales Force Automation projects and programs through all levels of the organization, bridging geographies and cultures. Directed complex transformation initiatives in fast paced, high volume business and managed global project teams in solution design and deployment to fulfill business requirements in fully integrated ERP/CRM implementation. Business Development & Alliance Manager IBM 1999  –  2001  (2 years) Managed team responsible for overall relationship with Microsoft, ensuring compliance with license agreement terms and conditions and fostered opportunities for joint sales and marketing engagement. Senior Product Marketing Manager IBM 1995  –  2000  (5 years) Product marketing manager for a variety of global offerings through entire product lifecycle. Senior Sales Representative, IBM Large Enterprise IBM 1988  –  1995  (7 years) Exceeded sales goals as account manager/sales representative in a large account customer environment, consistently growing share of wallet. Product Marketing Manager Lenovo October 2014  – Present (11 months) Raleigh-Durham, North Carolina Area Product Marketing Manager at Lenovo as the result of the acquisition by Lenovo of IBM's System x Server Division. Responsible for the Flex System advanced, integrated server product portfolio. Responsible for all aspects of product life cycle management, from concept through end of life, including: market requirements, product definitions, technology selection, product development, product pricing, volumes and transition planning, product launch, lifecycle management and end of life achieving revenue and profit goals. Product Marketing Manager Lenovo October 2014  – Present (11 months) Raleigh-Durham, North Carolina Area Product Marketing Manager at Lenovo as the result of the acquisition by Lenovo of IBM's System x Server Division. Responsible for the Flex System advanced, integrated server product portfolio. Responsible for all aspects of product life cycle management, from concept through end of life, including: market requirements, product definitions, technology selection, product development, product pricing, volumes and transition planning, product launch, lifecycle management and end of life achieving revenue and profit goals. Product Marketing Manager, IBM Flex System IBM 2010  – Present (5 years) Research Triangle Park, NC, USA Product Marketing Manager for IBM Flex System advanced server platform. Responsible for all aspects of product life cycle management, from concept through end of life, including: market requirements, product definitions, technology selection, product development, product pricing, volumes and transition planning, product launch, lifecycle management and end of life achieving revenue and profit goals. Product Marketing Manager, IBM Flex System IBM 2010  – Present (5 years) Research Triangle Park, NC, USA Product Marketing Manager for IBM Flex System advanced server platform. Responsible for all aspects of product life cycle management, from concept through end of life, including: market requirements, product definitions, technology selection, product development, product pricing, volumes and transition planning, product launch, lifecycle management and end of life achieving revenue and profit goals. Director, CRM Operations Lenovo 2005  –  2009  (4 years) Provided leadership for Sales Force Automation projects and programs through all levels of the organization, bridging geographies and cultures. Directed complex transformation initiatives in fast paced, high volume business and managed global project teams in solution design and deployment to fulfill business requirements in fully integrated ERP/CRM implementation. Director, CRM Operations Lenovo 2005  –  2009  (4 years) Provided leadership for Sales Force Automation projects and programs through all levels of the organization, bridging geographies and cultures. Directed complex transformation initiatives in fast paced, high volume business and managed global project teams in solution design and deployment to fulfill business requirements in fully integrated ERP/CRM implementation. Business Development & Alliance Manager IBM 1999  –  2001  (2 years) Managed team responsible for overall relationship with Microsoft, ensuring compliance with license agreement terms and conditions and fostered opportunities for joint sales and marketing engagement. Business Development & Alliance Manager IBM 1999  –  2001  (2 years) Managed team responsible for overall relationship with Microsoft, ensuring compliance with license agreement terms and conditions and fostered opportunities for joint sales and marketing engagement. Senior Product Marketing Manager IBM 1995  –  2000  (5 years) Product marketing manager for a variety of global offerings through entire product lifecycle. Senior Product Marketing Manager IBM 1995  –  2000  (5 years) Product marketing manager for a variety of global offerings through entire product lifecycle. Senior Sales Representative, IBM Large Enterprise IBM 1988  –  1995  (7 years) Exceeded sales goals as account manager/sales representative in a large account customer environment, consistently growing share of wallet. Senior Sales Representative, IBM Large Enterprise IBM 1988  –  1995  (7 years) Exceeded sales goals as account manager/sales representative in a large account customer environment, consistently growing share of wallet. Skills Product Management Product Marketing Sales Enablement Sales Force Automation Customer Relationship... Global Strategy Production Planning Product Requirements CRM Project Management Business Alliances Sales Force Development Professional Services Analysis Program Management Cloud Computing Leadership Business Process Pre-sales Sales Operations Sales Management Product Launch Go-to-market Strategy See 8+     See less Skills  Product Management Product Marketing Sales Enablement Sales Force Automation Customer Relationship... Global Strategy Production Planning Product Requirements CRM Project Management Business Alliances Sales Force Development Professional Services Analysis Program Management Cloud Computing Leadership Business Process Pre-sales Sales Operations Sales Management Product Launch Go-to-market Strategy See 8+     See less Product Management Product Marketing Sales Enablement Sales Force Automation Customer Relationship... Global Strategy Production Planning Product Requirements CRM Project Management Business Alliances Sales Force Development Professional Services Analysis Program Management Cloud Computing Leadership Business Process Pre-sales Sales Operations Sales Management Product Launch Go-to-market Strategy See 8+     See less Product Management Product Marketing Sales Enablement Sales Force Automation Customer Relationship... Global Strategy Production Planning Product Requirements CRM Project Management Business Alliances Sales Force Development Professional Services Analysis Program Management Cloud Computing Leadership Business Process Pre-sales Sales Operations Sales Management Product Launch Go-to-market Strategy See 8+     See less Education Webster University BA,  Business Management Webster University BA,  Business Management Webster University BA,  Business Management Webster University BA,  Business Management ", "Summary My background may be summed up as an interdisciplinary set of skills & experiences of 35 years in Product Development, Project Management, Marketing Management, Sales and Operations. Best-practices include building of strategic business units focused on new product development and market introduction. Creative Web Actions fulfills a passion to explore new ways to improve the small business. My goal is to help improve small businesses and enhance the quality life of all stakeholders involved.  \n \n \nMy business is found on a few simple belief principles:  \n1. Respect for the individual \n2. Have fun everyday \n3. Help others  \n4. Improve by continually learning and applying it  \n5. Apply 35 years of experience & expertise to deliver value  \n6. Be profitable \n \nCreative Web Actions’ goal’s are as follows: \nProvide consistent high quality Marketing Management expertise and Web Technology Services and solutions to help improve the small business’ bottom line. \n \nBuild Creative Web Actions and its brand to providing Total Business Solutions that solve practical business problems that can be measured and monitored.  \n \nSeek 100% customer satisfaction and solicit customer feedback to improve the way we do business and enhance our solution offerings. Determine shortcoming in business execution and solution offerings and take actions to rectify deficiencies. \n \nDevelop long lasting relationships with customers and match value to their needs, so customers will want to continue to do business with Creative Web Actions to reap the business value that is profitable to both the customer and Creative Web Actions. \n \nExpand and morph Creative Web Actions into a micro-Enterprise to include experts,talented creatives, partnerships and virtual teams to provide exceptional value and support to the small business customers’ needs.  \n \nDevelop and launch intellectual assets that are reusable business solutions that can be sold via e-business website, with little or no human handling requirements. Specialties:--- Provide personalized and exceptional valued-add services  \n \n--- Use Internet & web services to solve business problems \n \n--- Problem discovery then devise & execute remedy initiatives \n \n--- Create & deliver innovation on a shoe-string budget \n \n--- Develop marketing solutions from a blank-sheet-of-paper using out-of-the-box-thinking with a focus on new & different \n \n--- Perform brand building & brand management as the underlying core service with everything we do Summary My background may be summed up as an interdisciplinary set of skills & experiences of 35 years in Product Development, Project Management, Marketing Management, Sales and Operations. Best-practices include building of strategic business units focused on new product development and market introduction. Creative Web Actions fulfills a passion to explore new ways to improve the small business. My goal is to help improve small businesses and enhance the quality life of all stakeholders involved.  \n \n \nMy business is found on a few simple belief principles:  \n1. Respect for the individual \n2. Have fun everyday \n3. Help others  \n4. Improve by continually learning and applying it  \n5. Apply 35 years of experience & expertise to deliver value  \n6. Be profitable \n \nCreative Web Actions’ goal’s are as follows: \nProvide consistent high quality Marketing Management expertise and Web Technology Services and solutions to help improve the small business’ bottom line. \n \nBuild Creative Web Actions and its brand to providing Total Business Solutions that solve practical business problems that can be measured and monitored.  \n \nSeek 100% customer satisfaction and solicit customer feedback to improve the way we do business and enhance our solution offerings. Determine shortcoming in business execution and solution offerings and take actions to rectify deficiencies. \n \nDevelop long lasting relationships with customers and match value to their needs, so customers will want to continue to do business with Creative Web Actions to reap the business value that is profitable to both the customer and Creative Web Actions. \n \nExpand and morph Creative Web Actions into a micro-Enterprise to include experts,talented creatives, partnerships and virtual teams to provide exceptional value and support to the small business customers’ needs.  \n \nDevelop and launch intellectual assets that are reusable business solutions that can be sold via e-business website, with little or no human handling requirements. Specialties:--- Provide personalized and exceptional valued-add services  \n \n--- Use Internet & web services to solve business problems \n \n--- Problem discovery then devise & execute remedy initiatives \n \n--- Create & deliver innovation on a shoe-string budget \n \n--- Develop marketing solutions from a blank-sheet-of-paper using out-of-the-box-thinking with a focus on new & different \n \n--- Perform brand building & brand management as the underlying core service with everything we do My background may be summed up as an interdisciplinary set of skills & experiences of 35 years in Product Development, Project Management, Marketing Management, Sales and Operations. Best-practices include building of strategic business units focused on new product development and market introduction. Creative Web Actions fulfills a passion to explore new ways to improve the small business. My goal is to help improve small businesses and enhance the quality life of all stakeholders involved.  \n \n \nMy business is found on a few simple belief principles:  \n1. Respect for the individual \n2. Have fun everyday \n3. Help others  \n4. Improve by continually learning and applying it  \n5. Apply 35 years of experience & expertise to deliver value  \n6. Be profitable \n \nCreative Web Actions’ goal’s are as follows: \nProvide consistent high quality Marketing Management expertise and Web Technology Services and solutions to help improve the small business’ bottom line. \n \nBuild Creative Web Actions and its brand to providing Total Business Solutions that solve practical business problems that can be measured and monitored.  \n \nSeek 100% customer satisfaction and solicit customer feedback to improve the way we do business and enhance our solution offerings. Determine shortcoming in business execution and solution offerings and take actions to rectify deficiencies. \n \nDevelop long lasting relationships with customers and match value to their needs, so customers will want to continue to do business with Creative Web Actions to reap the business value that is profitable to both the customer and Creative Web Actions. \n \nExpand and morph Creative Web Actions into a micro-Enterprise to include experts,talented creatives, partnerships and virtual teams to provide exceptional value and support to the small business customers’ needs.  \n \nDevelop and launch intellectual assets that are reusable business solutions that can be sold via e-business website, with little or no human handling requirements. Specialties:--- Provide personalized and exceptional valued-add services  \n \n--- Use Internet & web services to solve business problems \n \n--- Problem discovery then devise & execute remedy initiatives \n \n--- Create & deliver innovation on a shoe-string budget \n \n--- Develop marketing solutions from a blank-sheet-of-paper using out-of-the-box-thinking with a focus on new & different \n \n--- Perform brand building & brand management as the underlying core service with everything we do My background may be summed up as an interdisciplinary set of skills & experiences of 35 years in Product Development, Project Management, Marketing Management, Sales and Operations. Best-practices include building of strategic business units focused on new product development and market introduction. Creative Web Actions fulfills a passion to explore new ways to improve the small business. My goal is to help improve small businesses and enhance the quality life of all stakeholders involved.  \n \n \nMy business is found on a few simple belief principles:  \n1. Respect for the individual \n2. Have fun everyday \n3. Help others  \n4. Improve by continually learning and applying it  \n5. Apply 35 years of experience & expertise to deliver value  \n6. Be profitable \n \nCreative Web Actions’ goal’s are as follows: \nProvide consistent high quality Marketing Management expertise and Web Technology Services and solutions to help improve the small business’ bottom line. \n \nBuild Creative Web Actions and its brand to providing Total Business Solutions that solve practical business problems that can be measured and monitored.  \n \nSeek 100% customer satisfaction and solicit customer feedback to improve the way we do business and enhance our solution offerings. Determine shortcoming in business execution and solution offerings and take actions to rectify deficiencies. \n \nDevelop long lasting relationships with customers and match value to their needs, so customers will want to continue to do business with Creative Web Actions to reap the business value that is profitable to both the customer and Creative Web Actions. \n \nExpand and morph Creative Web Actions into a micro-Enterprise to include experts,talented creatives, partnerships and virtual teams to provide exceptional value and support to the small business customers’ needs.  \n \nDevelop and launch intellectual assets that are reusable business solutions that can be sold via e-business website, with little or no human handling requirements. Specialties:--- Provide personalized and exceptional valued-add services  \n \n--- Use Internet & web services to solve business problems \n \n--- Problem discovery then devise & execute remedy initiatives \n \n--- Create & deliver innovation on a shoe-string budget \n \n--- Develop marketing solutions from a blank-sheet-of-paper using out-of-the-box-thinking with a focus on new & different \n \n--- Perform brand building & brand management as the underlying core service with everything we do Experience Website Designer and Consultant Creative Web Actions LLC May 2010  – Present (5 years 4 months) Tampa/St. Petersburg, Florida Area My focus is to build and manage websites as business assets to function as marketing tools to perform Brand Building and Integrated Marketing efforts. I will help you exploit your website as the Internet hub to connect with social media and other web properties to increase your web presence and visitor traffic to ultimately create customers for you. My approach uses Project Management and Marketing Management techniques to deploy \"best-practices\" of Software Development, Marketing Communications and Sales Operation.  \n \nMy services include website design and deployment, graphic design, (HTML, CSS, JavaScript & PHP) programming, copywriting, social media, blogs, message boards, email marketing, messaging, search engine optimization (SEO), search engine marketing (SEM) - paid placement, hosting & domain registration, ebusiness & shopping carts, website evaluation & tuning, traditional offline marketing and more.  \n \nOur purpose is to improve the small and medium business sales situation by leveraging advance web technology and marketing management to enhance:  \nWeb visibility \nWebsite find-ability \nBrand equity \nValue delivery \nBrand or product promotion \nProcess efficiency \nLead generation  \n \nMy website offerings start from simple small business websites for $500 to full function Content Management Systems based on WordPress and StudioPress's Genesis or Iteme's Builder as the framework to isolate the child theme. I have a website for almost any budget. Web technology is key tool to help you achieve your business goals. Creative Manager SPOC-Network March 2011  – Present (4 years 6 months) Tampa Bay, Florida An entrepreneurial focused network as a new Internet service for the purpose finding business contacts and displaying connections and references to social media. Stay-tune more to follow. Senior Worldwide Sales Operation Manager IBM Software Group 2005  –  2006  (1 year) Somers, NY Headquarters’ position representing the WW Software Sales Office by provided counsel to key IBM sales and brand executives and managing the delivery of WW insightful intelligence and recommendations for rapid decision-making that impacts quarterly revenue. Efforts spent on initiatives, urgent problems and information requests by performing: ad-hoc teaming, leading projects, independent investigation, creating processes or leading cross-functional teams. Senior Worldwide PvC Sales Operations and Business Operation Manager IBM Speech & Pervasive Computing 2003  –  2005  (2 years) Somers, NY Marketing focus was on early adopter’s acceptance of IBM speech products by consistently working with WW cross-functional teams to develop more awareness, include in IBM solutions and services and expand external business partnerships in a separate business unit other than PvC Business unit. As part of this assignment, concurrently I performed a dual role and led WW PvC Sales Operations by managing process development, forecasting, pipeline reporting, geographical sales communications, action monitoring, revenue tracking, pipeline analysis and sales & operational reporting, weekly and face-to-face sales meetings, coached sales teams, participated in executive leadership team and managed quarterly sales reviews Senior Worldwide PvC Product Marketing Manager IBM Pervasive Computing 2001  –  2003  (2 years) Somers, NY As Senior Worldwide IBM Pervasive Computing (PvC) Product Marketing Manager, I led all marketing management activities from offering concepts, strategy, marketing analysis, marketing communications, strategic partnerships and PvC product line planning. Led, managed, edited and approved the business cases, marketing plan, solutions offerings and Integrated Product Development (IPD) checkpoints. PvC product line is focused on e-business and Internet Services for Enterprises, Service Providers and Broadband Solutions customers. Senior NetGen Product Marketing Manager IBM Tivoli NetGen Business Unit 1999  –  2001  (2 years) Austin, Texas Area Proactively led portfolio and product management and was the key player to create the NetGen business unit that focused on e-business and the Internet for the needs of Service Providers and Networking marketplace. NetGen products allow customers to deliver new fee based services to their subscribers. The NetGen Portfolio served 3 target segments: \n• Next Generation Com Services - IP Packet Infrastructure & Convergence Services \n• Managed Services – e-business Outsource Services  \n• Pervasive Services - Ubiquitous Services anywhere and anytime  \nManaged and mentored 10 NetGen product managers on entrepreneurial activities for new business product concepts, profit goals and product functions to satisfied e-business and Internet business needs. I was the business advocator and leader for IBM’s Integrated Product Development (IPD) process and the formal IBM Market Planning Process (MPP). Global Portfolio Marketing Manager & Worldwide TMN Product Marketing Manager IBM Telecommunication Business Unit 1995  –  1999  (4 years) Piscataway, NJ As IBM’s Global Portfolio Marketing Manager, He led and managed 30 IBM Telephony Network products and 12 Network Product Managers. Responsible for on-going approval/rejection of each product as a good investment performer, allocating funding of new product concepts, reviewing each detail product phase of the portfolio, managing all business partner contracts for OEM deals and reseller agreements for the portfolio and. negotiating of T’s & C’s with business partners, customers and internal IBM organizations.  \n \nThe IBM’s Telecommunication Management Network, (TMN) Product Family was the flagship of Network Product portfolio. He performed a dual role as also IBM’s Senior Worldwide TMN Product Marketing Manager, in which he performed all of the product management tasks for the TMN Product Family. Advisory System Engineer and Senior Sales Services Consultant IBM Branch Offices 1987  –  1995  (8 years) Princeton, Edison & Cranford, NJ Worked at several IBM Branch Offices as System Engineer and Technical Services Consultant and sold services, software and hardware products, satisfied customer’s needs, created personalized proposals, responded to RFP’s, closed deals, provided solution design, performed services or contracted the services, developed installation plans, managed the execution of post-sale activities and ensured customer’s satisfaction. Worldwide Telephony Product and Development Manager IBM Telephony Industry Business Unit 1978  –  1987  (9 years) Princeton, NJ Led, designed and project managed of 3 large complex IBM Telephony products that included the development of the system architecture, application design, as well as, numerous small field developed projects. Staffed and managed teams of 6 to 10 programmers to develop turn-key solutions for real-time telephony operations. Planned and managed all low level design, walkthroughs, coding, testing, installation, acceptance testing, project file, development team deliverables, change control process, customer interface and third level defect support. Led and managed the development of the requirements, product specifications, project planning and documentation, feasibility study, match & compare against live data, contracts, mentoring, technical advisor, sales collateral, product fulfillment, customer service, sales assistance and install-site supervision. Skill base includes structured programming, C, C++, RPS, script languages and assembler language. New Product Design and Developer (Electronic) IBM Research June 1975  –  September 1978  (3 years 4 months) Yorktown, NY As IBM Research Electrical Engineer he worked as part of team with IBM Research Scientists on new product development. I led, designed a prototype pipeline processor product features, designed/built/ debugged the S/370 adapters, I/O cycle steal cards, coded machine language diagnostics and micro-code for variety of prototype systems. Experience with x’86, 68000, bit slice micro-processors, high speed Schottky TTL, sequential digital machines and PLA coding and performed analysis. This resulted in pre-product investigation and feasibilities published in the IBM Research Journal. Electrical Engineer IBM Future Manufacturing System May 1974  –  June 1975  (1 year 2 months) East Fishskill Manufacturing Engineer in Future Manufacturing Systems, provided electrical project leadership and managed the package designers, technicians and vendors. Prototyped, designed, supervised the build, debugged and production of the Order Makeup Tool, Laser Delete Tool and Wafer Measurement Tool for chip processing in the Bond, Align and Mount (BAT) area. The results were the automated manufacturing of multi-chip modules for IBM mainframe computers. Website Designer and Consultant Creative Web Actions LLC May 2010  – Present (5 years 4 months) Tampa/St. Petersburg, Florida Area My focus is to build and manage websites as business assets to function as marketing tools to perform Brand Building and Integrated Marketing efforts. I will help you exploit your website as the Internet hub to connect with social media and other web properties to increase your web presence and visitor traffic to ultimately create customers for you. My approach uses Project Management and Marketing Management techniques to deploy \"best-practices\" of Software Development, Marketing Communications and Sales Operation.  \n \nMy services include website design and deployment, graphic design, (HTML, CSS, JavaScript & PHP) programming, copywriting, social media, blogs, message boards, email marketing, messaging, search engine optimization (SEO), search engine marketing (SEM) - paid placement, hosting & domain registration, ebusiness & shopping carts, website evaluation & tuning, traditional offline marketing and more.  \n \nOur purpose is to improve the small and medium business sales situation by leveraging advance web technology and marketing management to enhance:  \nWeb visibility \nWebsite find-ability \nBrand equity \nValue delivery \nBrand or product promotion \nProcess efficiency \nLead generation  \n \nMy website offerings start from simple small business websites for $500 to full function Content Management Systems based on WordPress and StudioPress's Genesis or Iteme's Builder as the framework to isolate the child theme. I have a website for almost any budget. Web technology is key tool to help you achieve your business goals. Website Designer and Consultant Creative Web Actions LLC May 2010  – Present (5 years 4 months) Tampa/St. Petersburg, Florida Area My focus is to build and manage websites as business assets to function as marketing tools to perform Brand Building and Integrated Marketing efforts. I will help you exploit your website as the Internet hub to connect with social media and other web properties to increase your web presence and visitor traffic to ultimately create customers for you. My approach uses Project Management and Marketing Management techniques to deploy \"best-practices\" of Software Development, Marketing Communications and Sales Operation.  \n \nMy services include website design and deployment, graphic design, (HTML, CSS, JavaScript & PHP) programming, copywriting, social media, blogs, message boards, email marketing, messaging, search engine optimization (SEO), search engine marketing (SEM) - paid placement, hosting & domain registration, ebusiness & shopping carts, website evaluation & tuning, traditional offline marketing and more.  \n \nOur purpose is to improve the small and medium business sales situation by leveraging advance web technology and marketing management to enhance:  \nWeb visibility \nWebsite find-ability \nBrand equity \nValue delivery \nBrand or product promotion \nProcess efficiency \nLead generation  \n \nMy website offerings start from simple small business websites for $500 to full function Content Management Systems based on WordPress and StudioPress's Genesis or Iteme's Builder as the framework to isolate the child theme. I have a website for almost any budget. Web technology is key tool to help you achieve your business goals. Creative Manager SPOC-Network March 2011  – Present (4 years 6 months) Tampa Bay, Florida An entrepreneurial focused network as a new Internet service for the purpose finding business contacts and displaying connections and references to social media. Stay-tune more to follow. Creative Manager SPOC-Network March 2011  – Present (4 years 6 months) Tampa Bay, Florida An entrepreneurial focused network as a new Internet service for the purpose finding business contacts and displaying connections and references to social media. Stay-tune more to follow. Senior Worldwide Sales Operation Manager IBM Software Group 2005  –  2006  (1 year) Somers, NY Headquarters’ position representing the WW Software Sales Office by provided counsel to key IBM sales and brand executives and managing the delivery of WW insightful intelligence and recommendations for rapid decision-making that impacts quarterly revenue. Efforts spent on initiatives, urgent problems and information requests by performing: ad-hoc teaming, leading projects, independent investigation, creating processes or leading cross-functional teams. Senior Worldwide Sales Operation Manager IBM Software Group 2005  –  2006  (1 year) Somers, NY Headquarters’ position representing the WW Software Sales Office by provided counsel to key IBM sales and brand executives and managing the delivery of WW insightful intelligence and recommendations for rapid decision-making that impacts quarterly revenue. Efforts spent on initiatives, urgent problems and information requests by performing: ad-hoc teaming, leading projects, independent investigation, creating processes or leading cross-functional teams. Senior Worldwide PvC Sales Operations and Business Operation Manager IBM Speech & Pervasive Computing 2003  –  2005  (2 years) Somers, NY Marketing focus was on early adopter’s acceptance of IBM speech products by consistently working with WW cross-functional teams to develop more awareness, include in IBM solutions and services and expand external business partnerships in a separate business unit other than PvC Business unit. As part of this assignment, concurrently I performed a dual role and led WW PvC Sales Operations by managing process development, forecasting, pipeline reporting, geographical sales communications, action monitoring, revenue tracking, pipeline analysis and sales & operational reporting, weekly and face-to-face sales meetings, coached sales teams, participated in executive leadership team and managed quarterly sales reviews Senior Worldwide PvC Sales Operations and Business Operation Manager IBM Speech & Pervasive Computing 2003  –  2005  (2 years) Somers, NY Marketing focus was on early adopter’s acceptance of IBM speech products by consistently working with WW cross-functional teams to develop more awareness, include in IBM solutions and services and expand external business partnerships in a separate business unit other than PvC Business unit. As part of this assignment, concurrently I performed a dual role and led WW PvC Sales Operations by managing process development, forecasting, pipeline reporting, geographical sales communications, action monitoring, revenue tracking, pipeline analysis and sales & operational reporting, weekly and face-to-face sales meetings, coached sales teams, participated in executive leadership team and managed quarterly sales reviews Senior Worldwide PvC Product Marketing Manager IBM Pervasive Computing 2001  –  2003  (2 years) Somers, NY As Senior Worldwide IBM Pervasive Computing (PvC) Product Marketing Manager, I led all marketing management activities from offering concepts, strategy, marketing analysis, marketing communications, strategic partnerships and PvC product line planning. Led, managed, edited and approved the business cases, marketing plan, solutions offerings and Integrated Product Development (IPD) checkpoints. PvC product line is focused on e-business and Internet Services for Enterprises, Service Providers and Broadband Solutions customers. Senior Worldwide PvC Product Marketing Manager IBM Pervasive Computing 2001  –  2003  (2 years) Somers, NY As Senior Worldwide IBM Pervasive Computing (PvC) Product Marketing Manager, I led all marketing management activities from offering concepts, strategy, marketing analysis, marketing communications, strategic partnerships and PvC product line planning. Led, managed, edited and approved the business cases, marketing plan, solutions offerings and Integrated Product Development (IPD) checkpoints. PvC product line is focused on e-business and Internet Services for Enterprises, Service Providers and Broadband Solutions customers. Senior NetGen Product Marketing Manager IBM Tivoli NetGen Business Unit 1999  –  2001  (2 years) Austin, Texas Area Proactively led portfolio and product management and was the key player to create the NetGen business unit that focused on e-business and the Internet for the needs of Service Providers and Networking marketplace. NetGen products allow customers to deliver new fee based services to their subscribers. The NetGen Portfolio served 3 target segments: \n• Next Generation Com Services - IP Packet Infrastructure & Convergence Services \n• Managed Services – e-business Outsource Services  \n• Pervasive Services - Ubiquitous Services anywhere and anytime  \nManaged and mentored 10 NetGen product managers on entrepreneurial activities for new business product concepts, profit goals and product functions to satisfied e-business and Internet business needs. I was the business advocator and leader for IBM’s Integrated Product Development (IPD) process and the formal IBM Market Planning Process (MPP). Senior NetGen Product Marketing Manager IBM Tivoli NetGen Business Unit 1999  –  2001  (2 years) Austin, Texas Area Proactively led portfolio and product management and was the key player to create the NetGen business unit that focused on e-business and the Internet for the needs of Service Providers and Networking marketplace. NetGen products allow customers to deliver new fee based services to their subscribers. The NetGen Portfolio served 3 target segments: \n• Next Generation Com Services - IP Packet Infrastructure & Convergence Services \n• Managed Services – e-business Outsource Services  \n• Pervasive Services - Ubiquitous Services anywhere and anytime  \nManaged and mentored 10 NetGen product managers on entrepreneurial activities for new business product concepts, profit goals and product functions to satisfied e-business and Internet business needs. I was the business advocator and leader for IBM’s Integrated Product Development (IPD) process and the formal IBM Market Planning Process (MPP). Global Portfolio Marketing Manager & Worldwide TMN Product Marketing Manager IBM Telecommunication Business Unit 1995  –  1999  (4 years) Piscataway, NJ As IBM’s Global Portfolio Marketing Manager, He led and managed 30 IBM Telephony Network products and 12 Network Product Managers. Responsible for on-going approval/rejection of each product as a good investment performer, allocating funding of new product concepts, reviewing each detail product phase of the portfolio, managing all business partner contracts for OEM deals and reseller agreements for the portfolio and. negotiating of T’s & C’s with business partners, customers and internal IBM organizations.  \n \nThe IBM’s Telecommunication Management Network, (TMN) Product Family was the flagship of Network Product portfolio. He performed a dual role as also IBM’s Senior Worldwide TMN Product Marketing Manager, in which he performed all of the product management tasks for the TMN Product Family. Global Portfolio Marketing Manager & Worldwide TMN Product Marketing Manager IBM Telecommunication Business Unit 1995  –  1999  (4 years) Piscataway, NJ As IBM’s Global Portfolio Marketing Manager, He led and managed 30 IBM Telephony Network products and 12 Network Product Managers. Responsible for on-going approval/rejection of each product as a good investment performer, allocating funding of new product concepts, reviewing each detail product phase of the portfolio, managing all business partner contracts for OEM deals and reseller agreements for the portfolio and. negotiating of T’s & C’s with business partners, customers and internal IBM organizations.  \n \nThe IBM’s Telecommunication Management Network, (TMN) Product Family was the flagship of Network Product portfolio. He performed a dual role as also IBM’s Senior Worldwide TMN Product Marketing Manager, in which he performed all of the product management tasks for the TMN Product Family. Advisory System Engineer and Senior Sales Services Consultant IBM Branch Offices 1987  –  1995  (8 years) Princeton, Edison & Cranford, NJ Worked at several IBM Branch Offices as System Engineer and Technical Services Consultant and sold services, software and hardware products, satisfied customer’s needs, created personalized proposals, responded to RFP’s, closed deals, provided solution design, performed services or contracted the services, developed installation plans, managed the execution of post-sale activities and ensured customer’s satisfaction. Advisory System Engineer and Senior Sales Services Consultant IBM Branch Offices 1987  –  1995  (8 years) Princeton, Edison & Cranford, NJ Worked at several IBM Branch Offices as System Engineer and Technical Services Consultant and sold services, software and hardware products, satisfied customer’s needs, created personalized proposals, responded to RFP’s, closed deals, provided solution design, performed services or contracted the services, developed installation plans, managed the execution of post-sale activities and ensured customer’s satisfaction. Worldwide Telephony Product and Development Manager IBM Telephony Industry Business Unit 1978  –  1987  (9 years) Princeton, NJ Led, designed and project managed of 3 large complex IBM Telephony products that included the development of the system architecture, application design, as well as, numerous small field developed projects. Staffed and managed teams of 6 to 10 programmers to develop turn-key solutions for real-time telephony operations. Planned and managed all low level design, walkthroughs, coding, testing, installation, acceptance testing, project file, development team deliverables, change control process, customer interface and third level defect support. Led and managed the development of the requirements, product specifications, project planning and documentation, feasibility study, match & compare against live data, contracts, mentoring, technical advisor, sales collateral, product fulfillment, customer service, sales assistance and install-site supervision. Skill base includes structured programming, C, C++, RPS, script languages and assembler language. Worldwide Telephony Product and Development Manager IBM Telephony Industry Business Unit 1978  –  1987  (9 years) Princeton, NJ Led, designed and project managed of 3 large complex IBM Telephony products that included the development of the system architecture, application design, as well as, numerous small field developed projects. Staffed and managed teams of 6 to 10 programmers to develop turn-key solutions for real-time telephony operations. Planned and managed all low level design, walkthroughs, coding, testing, installation, acceptance testing, project file, development team deliverables, change control process, customer interface and third level defect support. Led and managed the development of the requirements, product specifications, project planning and documentation, feasibility study, match & compare against live data, contracts, mentoring, technical advisor, sales collateral, product fulfillment, customer service, sales assistance and install-site supervision. Skill base includes structured programming, C, C++, RPS, script languages and assembler language. New Product Design and Developer (Electronic) IBM Research June 1975  –  September 1978  (3 years 4 months) Yorktown, NY As IBM Research Electrical Engineer he worked as part of team with IBM Research Scientists on new product development. I led, designed a prototype pipeline processor product features, designed/built/ debugged the S/370 adapters, I/O cycle steal cards, coded machine language diagnostics and micro-code for variety of prototype systems. Experience with x’86, 68000, bit slice micro-processors, high speed Schottky TTL, sequential digital machines and PLA coding and performed analysis. This resulted in pre-product investigation and feasibilities published in the IBM Research Journal. New Product Design and Developer (Electronic) IBM Research June 1975  –  September 1978  (3 years 4 months) Yorktown, NY As IBM Research Electrical Engineer he worked as part of team with IBM Research Scientists on new product development. I led, designed a prototype pipeline processor product features, designed/built/ debugged the S/370 adapters, I/O cycle steal cards, coded machine language diagnostics and micro-code for variety of prototype systems. Experience with x’86, 68000, bit slice micro-processors, high speed Schottky TTL, sequential digital machines and PLA coding and performed analysis. This resulted in pre-product investigation and feasibilities published in the IBM Research Journal. Electrical Engineer IBM Future Manufacturing System May 1974  –  June 1975  (1 year 2 months) East Fishskill Manufacturing Engineer in Future Manufacturing Systems, provided electrical project leadership and managed the package designers, technicians and vendors. Prototyped, designed, supervised the build, debugged and production of the Order Makeup Tool, Laser Delete Tool and Wafer Measurement Tool for chip processing in the Bond, Align and Mount (BAT) area. The results were the automated manufacturing of multi-chip modules for IBM mainframe computers. Electrical Engineer IBM Future Manufacturing System May 1974  –  June 1975  (1 year 2 months) East Fishskill Manufacturing Engineer in Future Manufacturing Systems, provided electrical project leadership and managed the package designers, technicians and vendors. Prototyped, designed, supervised the build, debugged and production of the Order Makeup Tool, Laser Delete Tool and Wafer Measurement Tool for chip processing in the Bond, Align and Mount (BAT) area. The results were the automated manufacturing of multi-chip modules for IBM mainframe computers. Skills Contract Negotiation Marketing Research Photoshop Marketing Strategy Personal Branding Product Marketing Web Marketing Strategy Product Management Cross-functional Team... Leadership Project Management Online Marketing Marketing Management Strategic Partnerships Management New Business Development Budgets Social Media Marketing Entrepreneurship Marketing Project Planning Analysis Social Media Negotiation Start-ups Lead Generation Business Development Marketing Communications Product Development SEO Web Design Email Marketing SEM Sales Integrated Marketing Business Intelligence Brand Management Sales Operations E-commerce Copywriting See 25+     See less Skills  Contract Negotiation Marketing Research Photoshop Marketing Strategy Personal Branding Product Marketing Web Marketing Strategy Product Management Cross-functional Team... Leadership Project Management Online Marketing Marketing Management Strategic Partnerships Management New Business Development Budgets Social Media Marketing Entrepreneurship Marketing Project Planning Analysis Social Media Negotiation Start-ups Lead Generation Business Development Marketing Communications Product Development SEO Web Design Email Marketing SEM Sales Integrated Marketing Business Intelligence Brand Management Sales Operations E-commerce Copywriting See 25+     See less Contract Negotiation Marketing Research Photoshop Marketing Strategy Personal Branding Product Marketing Web Marketing Strategy Product Management Cross-functional Team... Leadership Project Management Online Marketing Marketing Management Strategic Partnerships Management New Business Development Budgets Social Media Marketing Entrepreneurship Marketing Project Planning Analysis Social Media Negotiation Start-ups Lead Generation Business Development Marketing Communications Product Development SEO Web Design Email Marketing SEM Sales Integrated Marketing Business Intelligence Brand Management Sales Operations E-commerce Copywriting See 25+     See less Contract Negotiation Marketing Research Photoshop Marketing Strategy Personal Branding Product Marketing Web Marketing Strategy Product Management Cross-functional Team... Leadership Project Management Online Marketing Marketing Management Strategic Partnerships Management New Business Development Budgets Social Media Marketing Entrepreneurship Marketing Project Planning Analysis Social Media Negotiation Start-ups Lead Generation Business Development Marketing Communications Product Development SEO Web Design Email Marketing SEM Sales Integrated Marketing Business Intelligence Brand Management Sales Operations E-commerce Copywriting See 25+     See less Education Syracuse University Electric Engineering (BEE) 1974  – 1976 Manhattan College BEE,  Electric Engineering GPA 3.77, Electrical Gold medal Activities and Societies:  Eta Kappa Nu Syracuse University Electric Engineering (BEE) 1974  – 1976 Syracuse University Electric Engineering (BEE) 1974  – 1976 Syracuse University Electric Engineering (BEE) 1974  – 1976 Manhattan College BEE,  Electric Engineering GPA 3.77, Electrical Gold medal Activities and Societies:  Eta Kappa Nu Manhattan College BEE,  Electric Engineering GPA 3.77, Electrical Gold medal Activities and Societies:  Eta Kappa Nu Manhattan College BEE,  Electric Engineering GPA 3.77, Electrical Gold medal Activities and Societies:  Eta Kappa Nu Honors & Awards ", "Experience Director, Product Management, IBM Collaboration Solutions IBM May 2013  – Present (2 years 4 months) Research Triangle Park, NC Director of Marketing, Business Process and Decision Management Software IBM July 2010  –  May 2013  (2 years 11 months) RTP, NC Program Director, BPM Product Marketing, ILOG Marketing Integration Executive IBM December 2008  –  June 2010  (1 year 7 months) Manager, BPM Product Marketing IBM March 2007  –  November 2008  (1 year 9 months) Senior Product Marketing Manager, IBM Software Group IBM June 2005  –  February 2007  (1 year 9 months) Product Marketing Manager, IBM WebSphere IBM June 2002  –  June 2005  (3 years 1 month) VP of Sales and Marketing Computare, Inc June 1994  –  May 2000  (6 years) English Teacher / Tutor Jesus, Mari i Josep August 1992  –  May 1994  (1 year 10 months) Barcelona, Spain Director, Product Management, IBM Collaboration Solutions IBM May 2013  – Present (2 years 4 months) Research Triangle Park, NC Director, Product Management, IBM Collaboration Solutions IBM May 2013  – Present (2 years 4 months) Research Triangle Park, NC Director of Marketing, Business Process and Decision Management Software IBM July 2010  –  May 2013  (2 years 11 months) RTP, NC Director of Marketing, Business Process and Decision Management Software IBM July 2010  –  May 2013  (2 years 11 months) RTP, NC Program Director, BPM Product Marketing, ILOG Marketing Integration Executive IBM December 2008  –  June 2010  (1 year 7 months) Program Director, BPM Product Marketing, ILOG Marketing Integration Executive IBM December 2008  –  June 2010  (1 year 7 months) Manager, BPM Product Marketing IBM March 2007  –  November 2008  (1 year 9 months) Manager, BPM Product Marketing IBM March 2007  –  November 2008  (1 year 9 months) Senior Product Marketing Manager, IBM Software Group IBM June 2005  –  February 2007  (1 year 9 months) Senior Product Marketing Manager, IBM Software Group IBM June 2005  –  February 2007  (1 year 9 months) Product Marketing Manager, IBM WebSphere IBM June 2002  –  June 2005  (3 years 1 month) Product Marketing Manager, IBM WebSphere IBM June 2002  –  June 2005  (3 years 1 month) VP of Sales and Marketing Computare, Inc June 1994  –  May 2000  (6 years) VP of Sales and Marketing Computare, Inc June 1994  –  May 2000  (6 years) English Teacher / Tutor Jesus, Mari i Josep August 1992  –  May 1994  (1 year 10 months) Barcelona, Spain English Teacher / Tutor Jesus, Mari i Josep August 1992  –  May 1994  (1 year 10 months) Barcelona, Spain Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Business Process Design Websphere Product Marketing Sales Enablement Enterprise Software SaaS Cloud Computing Product Management Go-to-market Strategy Demand Generation Analytics Business Alliances Strategy Business Intelligence Project Management Business Process Marketing Management Messaging SOA Management Integration WebSphere See 7+     See less Skills  Business Process Design Websphere Product Marketing Sales Enablement Enterprise Software SaaS Cloud Computing Product Management Go-to-market Strategy Demand Generation Analytics Business Alliances Strategy Business Intelligence Project Management Business Process Marketing Management Messaging SOA Management Integration WebSphere See 7+     See less Business Process Design Websphere Product Marketing Sales Enablement Enterprise Software SaaS Cloud Computing Product Management Go-to-market Strategy Demand Generation Analytics Business Alliances Strategy Business Intelligence Project Management Business Process Marketing Management Messaging SOA Management Integration WebSphere See 7+     See less Business Process Design Websphere Product Marketing Sales Enablement Enterprise Software SaaS Cloud Computing Product Management Go-to-market Strategy Demand Generation Analytics Business Alliances Strategy Business Intelligence Project Management Business Process Marketing Management Messaging SOA Management Integration WebSphere See 7+     See less Education University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA 2000  – 2002 Virginia Military Institute BS 1985  – 1990 University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA 2000  – 2002 University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA 2000  – 2002 University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA 2000  – 2002 Virginia Military Institute BS 1985  – 1990 Virginia Military Institute BS 1985  – 1990 Virginia Military Institute BS 1985  – 1990 "]}