{"position": "Professor", "company": "Stanford University", "profiles": ["Experience Associate Professor Stanford University June 2004  – Present (11 years 3 months) Associate Professor Stanford University June 2004  – Present (11 years 3 months) Associate Professor Stanford University June 2004  – Present (11 years 3 months) Skills Numerical Analysis Matlab CFD Scientific Computing Fortran Aerodynamics Fluid Dynamics Simulations Mathematical Modeling Machine Learning Science Fluid Mechanics Higher Education Parallel Computing LaTeX Teaching Physics Statistics Applied Mathematics Algorithms Aeronautics Finite Element Analysis Optimization High Performance... See 9+     See less Skills  Numerical Analysis Matlab CFD Scientific Computing Fortran Aerodynamics Fluid Dynamics Simulations Mathematical Modeling Machine Learning Science Fluid Mechanics Higher Education Parallel Computing LaTeX Teaching Physics Statistics Applied Mathematics Algorithms Aeronautics Finite Element Analysis Optimization High Performance... See 9+     See less Numerical Analysis Matlab CFD Scientific Computing Fortran Aerodynamics Fluid Dynamics Simulations Mathematical Modeling Machine Learning Science Fluid Mechanics Higher Education Parallel Computing LaTeX Teaching Physics Statistics Applied Mathematics Algorithms Aeronautics Finite Element Analysis Optimization High Performance... See 9+     See less Numerical Analysis Matlab CFD Scientific Computing Fortran Aerodynamics Fluid Dynamics Simulations Mathematical Modeling Machine Learning Science Fluid Mechanics Higher Education Parallel Computing LaTeX Teaching Physics Statistics Applied Mathematics Algorithms Aeronautics Finite Element Analysis Optimization High Performance... See 9+     See less ", "Summary Ge is an Assistant Professor at Stanford University in the Center for Computer Research in Music and Acoustics (CCRMA). His research interests include interactive software systems (of all sizes) for computer music, programming languages, mobile music, sound synthesis and analysis, new performance ensembles (e.g., laptop orchestras and mobile phone ensembles), visualization, interfaces for human-computer interaction, and methodologies for education at the intersection of computer science and music. \n \nGe is the author of the ChucK audio programming language, and the founder and director of the Stanford Laptop Orchestra (SLOrk) and of the Stanford Mobile Phone Orchestra (MoPhO). Ge is also the Co-founder of Smule (reaching over 125 million users), and the designer of the iPhone's Ocarina and Magic Piano. \n \nhttp://www.gewang.com/ \n \nSpecialties: computer music, interaction design, audio visual software design, programming language design, laptop orchestras, mobile music, visualization, research and teaching at the intersection of music, engineering, and design. \n Summary Ge is an Assistant Professor at Stanford University in the Center for Computer Research in Music and Acoustics (CCRMA). His research interests include interactive software systems (of all sizes) for computer music, programming languages, mobile music, sound synthesis and analysis, new performance ensembles (e.g., laptop orchestras and mobile phone ensembles), visualization, interfaces for human-computer interaction, and methodologies for education at the intersection of computer science and music. \n \nGe is the author of the ChucK audio programming language, and the founder and director of the Stanford Laptop Orchestra (SLOrk) and of the Stanford Mobile Phone Orchestra (MoPhO). Ge is also the Co-founder of Smule (reaching over 125 million users), and the designer of the iPhone's Ocarina and Magic Piano. \n \nhttp://www.gewang.com/ \n \nSpecialties: computer music, interaction design, audio visual software design, programming language design, laptop orchestras, mobile music, visualization, research and teaching at the intersection of music, engineering, and design. \n Ge is an Assistant Professor at Stanford University in the Center for Computer Research in Music and Acoustics (CCRMA). His research interests include interactive software systems (of all sizes) for computer music, programming languages, mobile music, sound synthesis and analysis, new performance ensembles (e.g., laptop orchestras and mobile phone ensembles), visualization, interfaces for human-computer interaction, and methodologies for education at the intersection of computer science and music. \n \nGe is the author of the ChucK audio programming language, and the founder and director of the Stanford Laptop Orchestra (SLOrk) and of the Stanford Mobile Phone Orchestra (MoPhO). Ge is also the Co-founder of Smule (reaching over 125 million users), and the designer of the iPhone's Ocarina and Magic Piano. \n \nhttp://www.gewang.com/ \n \nSpecialties: computer music, interaction design, audio visual software design, programming language design, laptop orchestras, mobile music, visualization, research and teaching at the intersection of music, engineering, and design. \n Ge is an Assistant Professor at Stanford University in the Center for Computer Research in Music and Acoustics (CCRMA). His research interests include interactive software systems (of all sizes) for computer music, programming languages, mobile music, sound synthesis and analysis, new performance ensembles (e.g., laptop orchestras and mobile phone ensembles), visualization, interfaces for human-computer interaction, and methodologies for education at the intersection of computer science and music. \n \nGe is the author of the ChucK audio programming language, and the founder and director of the Stanford Laptop Orchestra (SLOrk) and of the Stanford Mobile Phone Orchestra (MoPhO). Ge is also the Co-founder of Smule (reaching over 125 million users), and the designer of the iPhone's Ocarina and Magic Piano. \n \nhttp://www.gewang.com/ \n \nSpecialties: computer music, interaction design, audio visual software design, programming language design, laptop orchestras, mobile music, visualization, research and teaching at the intersection of music, engineering, and design. \n Experience Assistant Professor Stanford University September 2007  – Present (8 years) Assistant Professor Stanford University September 2007  – Present (8 years) Assistant Professor Stanford University September 2007  – Present (8 years) Languages English Native or bilingual proficiency Chinese (Mandarin) Native or bilingual proficiency English Native or bilingual proficiency Chinese (Mandarin) Native or bilingual proficiency English Native or bilingual proficiency Chinese (Mandarin) Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Computer Music Mobile Music Human Computer... Research Teaching Programming C++ Composition 3D visualization Artificial Intelligence Python Software Engineering Software Development Java Matlab Music Objective-C Sound C Sound Design Food Science Piano Machine Learning Music Technology Computer Science Digital Signal... Acoustics OpenGL Software Design Algorithms Computer Vision Pattern Recognition Mobile Devices Digital Signal... Audio Processing Image Processing Orchestral Music Distributed Systems See 23+     See less Skills  Computer Music Mobile Music Human Computer... Research Teaching Programming C++ Composition 3D visualization Artificial Intelligence Python Software Engineering Software Development Java Matlab Music Objective-C Sound C Sound Design Food Science Piano Machine Learning Music Technology Computer Science Digital Signal... Acoustics OpenGL Software Design Algorithms Computer Vision Pattern Recognition Mobile Devices Digital Signal... Audio Processing Image Processing Orchestral Music Distributed Systems See 23+     See less Computer Music Mobile Music Human Computer... Research Teaching Programming C++ Composition 3D visualization Artificial Intelligence Python Software Engineering Software Development Java Matlab Music Objective-C Sound C Sound Design Food Science Piano Machine Learning Music Technology Computer Science Digital Signal... Acoustics OpenGL Software Design Algorithms Computer Vision Pattern Recognition Mobile Devices Digital Signal... Audio Processing Image Processing Orchestral Music Distributed Systems See 23+     See less Computer Music Mobile Music Human Computer... Research Teaching Programming C++ Composition 3D visualization Artificial Intelligence Python Software Engineering Software Development Java Matlab Music Objective-C Sound C Sound Design Food Science Piano Machine Learning Music Technology Computer Science Digital Signal... Acoustics OpenGL Software Design Algorithms Computer Vision Pattern Recognition Mobile Devices Digital Signal... Audio Processing Image Processing Orchestral Music Distributed Systems See 23+     See less Education Princeton University PhD,  Computer Science (Computer Music) 2001  – 2008 Duke University B.S.,  Computer Science (also Music) 1996  – 2000 Princeton University PhD,  Computer Science (Computer Music) 2001  – 2008 Princeton University PhD,  Computer Science (Computer Music) 2001  – 2008 Princeton University PhD,  Computer Science (Computer Music) 2001  – 2008 Duke University B.S.,  Computer Science (also Music) 1996  – 2000 Duke University B.S.,  Computer Science (also Music) 1996  – 2000 Duke University B.S.,  Computer Science (also Music) 1996  – 2000 ", "Languages Kannada Kannada Kannada Skills Digital Signal... VoIP Wireless SoC VLSI System Architecture Mobile Devices Signal Processing IC Semiconductors Algorithms RF FPGA Networking Embedded Systems ASIC See 1+     See less Skills  Digital Signal... VoIP Wireless SoC VLSI System Architecture Mobile Devices Signal Processing IC Semiconductors Algorithms RF FPGA Networking Embedded Systems ASIC See 1+     See less Digital Signal... VoIP Wireless SoC VLSI System Architecture Mobile Devices Signal Processing IC Semiconductors Algorithms RF FPGA Networking Embedded Systems ASIC See 1+     See less Digital Signal... VoIP Wireless SoC VLSI System Architecture Mobile Devices Signal Processing IC Semiconductors Algorithms RF FPGA Networking Embedded Systems ASIC See 1+     See less Honors & Awards ", "Summary Neurobiologist working on the relationship between the pathogenesis of Down syndrome and Alzheimer's disease. Has been involved in identifying neuronal networks that undergo significant degeneration in mouse models of Down syndrome and Alzheimer's disease. Currently, my group is working on the role of norepinephrine-ergic system in failed contextual learning in the Ts65Dn mouse model of Down syndrome. We are hoping that improving this system would restore cognitive function in children and reduce the severity of Alzheimer pathology in adults with Down syndrome. Summary Neurobiologist working on the relationship between the pathogenesis of Down syndrome and Alzheimer's disease. Has been involved in identifying neuronal networks that undergo significant degeneration in mouse models of Down syndrome and Alzheimer's disease. Currently, my group is working on the role of norepinephrine-ergic system in failed contextual learning in the Ts65Dn mouse model of Down syndrome. We are hoping that improving this system would restore cognitive function in children and reduce the severity of Alzheimer pathology in adults with Down syndrome. Neurobiologist working on the relationship between the pathogenesis of Down syndrome and Alzheimer's disease. Has been involved in identifying neuronal networks that undergo significant degeneration in mouse models of Down syndrome and Alzheimer's disease. Currently, my group is working on the role of norepinephrine-ergic system in failed contextual learning in the Ts65Dn mouse model of Down syndrome. We are hoping that improving this system would restore cognitive function in children and reduce the severity of Alzheimer pathology in adults with Down syndrome. Neurobiologist working on the relationship between the pathogenesis of Down syndrome and Alzheimer's disease. Has been involved in identifying neuronal networks that undergo significant degeneration in mouse models of Down syndrome and Alzheimer's disease. Currently, my group is working on the role of norepinephrine-ergic system in failed contextual learning in the Ts65Dn mouse model of Down syndrome. We are hoping that improving this system would restore cognitive function in children and reduce the severity of Alzheimer pathology in adults with Down syndrome. Experience Professor Stanford University School of Medicine January 2015  – Present (8 months) Stanford, CA Section Editor: Clinical Neuroscience Basic and Clinical Neuroscience: A Quarterly Publication December 2014  – Present (9 months) Section Editor BioConference Live Program Committee Member BioConference Live April 2014  – Present (1 year 5 months) Yorba Linda, CA 92886 Identifying topics and speakers for the Bioconference Live events throughout the year. \nhttp://www.bioconferencelive.com/index.php Editorial Board Member International Neuropsychiatric Disease Journal June 2013  – Present (2 years 3 months) Clinical Associate Professor Stanford University Medical Center November 2009  –  January 2015  (5 years 3 months) Study the neurobiological basis of relationship between Down syndrome and Alzheimer's disease Senior Researcher Stanford University School of Medicine August 1999  –  July 2010  (11 years) Identifying the role of individual triplicated genes in degeneration of specific brain regions in mouse models of Down syndrome Director Stanford/VA Brain Bank 2001  –  2009  (8 years) Stanford Performing brain dissections, processing the tissue samples, and storage . Professor Stanford University School of Medicine January 2015  – Present (8 months) Stanford, CA Professor Stanford University School of Medicine January 2015  – Present (8 months) Stanford, CA Section Editor: Clinical Neuroscience Basic and Clinical Neuroscience: A Quarterly Publication December 2014  – Present (9 months) Section Editor Section Editor: Clinical Neuroscience Basic and Clinical Neuroscience: A Quarterly Publication December 2014  – Present (9 months) Section Editor BioConference Live Program Committee Member BioConference Live April 2014  – Present (1 year 5 months) Yorba Linda, CA 92886 Identifying topics and speakers for the Bioconference Live events throughout the year. \nhttp://www.bioconferencelive.com/index.php BioConference Live Program Committee Member BioConference Live April 2014  – Present (1 year 5 months) Yorba Linda, CA 92886 Identifying topics and speakers for the Bioconference Live events throughout the year. \nhttp://www.bioconferencelive.com/index.php Editorial Board Member International Neuropsychiatric Disease Journal June 2013  – Present (2 years 3 months) Editorial Board Member International Neuropsychiatric Disease Journal June 2013  – Present (2 years 3 months) Clinical Associate Professor Stanford University Medical Center November 2009  –  January 2015  (5 years 3 months) Study the neurobiological basis of relationship between Down syndrome and Alzheimer's disease Clinical Associate Professor Stanford University Medical Center November 2009  –  January 2015  (5 years 3 months) Study the neurobiological basis of relationship between Down syndrome and Alzheimer's disease Senior Researcher Stanford University School of Medicine August 1999  –  July 2010  (11 years) Identifying the role of individual triplicated genes in degeneration of specific brain regions in mouse models of Down syndrome Senior Researcher Stanford University School of Medicine August 1999  –  July 2010  (11 years) Identifying the role of individual triplicated genes in degeneration of specific brain regions in mouse models of Down syndrome Director Stanford/VA Brain Bank 2001  –  2009  (8 years) Stanford Performing brain dissections, processing the tissue samples, and storage . Director Stanford/VA Brain Bank 2001  –  2009  (8 years) Stanford Performing brain dissections, processing the tissue samples, and storage . Languages Persian Persian Persian Skills Down Syndrome Alzheimer's disease Neuroscience Immunohistochemistry Cell Culture In Vivo Clinical Research Animal Models Cell Biology Translational Research Genetics Cell Science Molecular Biology Medicine PCR Microscopy Lifesciences Biochemistry Immunology Medical Research Tissue Culture Stem Cells Immunofluorescence Fluorescence Confocal Microscopy Flow Cytometry Fluorescence Microscopy Pharmacology DNA extraction Drug Discovery Genomics Scientific Writing Neuroanatomy DNA Immunocytochemistry Neurophysiology ELISA HPLC In Vitro Transfection Signal Transduction Neurobiology Western Blotting RNA isolation Electrophysiology Physiology Immunoprecipitation Cancer Molecular Cloning See 35+     See less Skills  Down Syndrome Alzheimer's disease Neuroscience Immunohistochemistry Cell Culture In Vivo Clinical Research Animal Models Cell Biology Translational Research Genetics Cell Science Molecular Biology Medicine PCR Microscopy Lifesciences Biochemistry Immunology Medical Research Tissue Culture Stem Cells Immunofluorescence Fluorescence Confocal Microscopy Flow Cytometry Fluorescence Microscopy Pharmacology DNA extraction Drug Discovery Genomics Scientific Writing Neuroanatomy DNA Immunocytochemistry Neurophysiology ELISA HPLC In Vitro Transfection Signal Transduction Neurobiology Western Blotting RNA isolation Electrophysiology Physiology Immunoprecipitation Cancer Molecular Cloning See 35+     See less Down Syndrome Alzheimer's disease Neuroscience Immunohistochemistry Cell Culture In Vivo Clinical Research Animal Models Cell Biology Translational Research Genetics Cell Science Molecular Biology Medicine PCR Microscopy Lifesciences Biochemistry Immunology Medical Research Tissue Culture Stem Cells Immunofluorescence Fluorescence Confocal Microscopy Flow Cytometry Fluorescence Microscopy Pharmacology DNA extraction Drug Discovery Genomics Scientific Writing Neuroanatomy DNA Immunocytochemistry Neurophysiology ELISA HPLC In Vitro Transfection Signal Transduction Neurobiology Western Blotting RNA isolation Electrophysiology Physiology Immunoprecipitation Cancer Molecular Cloning See 35+     See less Down Syndrome Alzheimer's disease Neuroscience Immunohistochemistry Cell Culture In Vivo Clinical Research Animal Models Cell Biology Translational Research Genetics Cell Science Molecular Biology Medicine PCR Microscopy Lifesciences Biochemistry Immunology Medical Research Tissue Culture Stem Cells Immunofluorescence Fluorescence Confocal Microscopy Flow Cytometry Fluorescence Microscopy Pharmacology DNA extraction Drug Discovery Genomics Scientific Writing Neuroanatomy DNA Immunocytochemistry Neurophysiology ELISA HPLC In Vitro Transfection Signal Transduction Neurobiology Western Blotting RNA isolation Electrophysiology Physiology Immunoprecipitation Cancer Molecular Cloning See 35+     See less Education University of Amsterdam Ph.D.,  Neurobiology 1992  – 1999 SBMU Doctor of Medicine (MD),  Medicine 1984  – 1992 University of Amsterdam Ph.D.,  Neurobiology 1992  – 1999 University of Amsterdam Ph.D.,  Neurobiology 1992  – 1999 University of Amsterdam Ph.D.,  Neurobiology 1992  – 1999 SBMU Doctor of Medicine (MD),  Medicine 1984  – 1992 SBMU Doctor of Medicine (MD),  Medicine 1984  – 1992 SBMU Doctor of Medicine (MD),  Medicine 1984  – 1992 Honors & Awards Best Junior Scientist in the field of Alzheimer's disease University of Leiden March 1997 1st place at the 2014 Art of Science Competition Stanford Materials Research Society May 2014 Ist place at the 2014 Art of Science Competition at Stanford University. \nhttp://www.stanford.edu/group/mrs/cgi-bin/wordpress/artofscience2014/ Additional Honors & Awards World Technology Award in the field of biotechnology, December 2010 \nhttp://wtn.net/summit2013/index.php Best Junior Scientist in the field of Alzheimer's disease University of Leiden March 1997 Best Junior Scientist in the field of Alzheimer's disease University of Leiden March 1997 Best Junior Scientist in the field of Alzheimer's disease University of Leiden March 1997 1st place at the 2014 Art of Science Competition Stanford Materials Research Society May 2014 Ist place at the 2014 Art of Science Competition at Stanford University. \nhttp://www.stanford.edu/group/mrs/cgi-bin/wordpress/artofscience2014/ 1st place at the 2014 Art of Science Competition Stanford Materials Research Society May 2014 Ist place at the 2014 Art of Science Competition at Stanford University. \nhttp://www.stanford.edu/group/mrs/cgi-bin/wordpress/artofscience2014/ 1st place at the 2014 Art of Science Competition Stanford Materials Research Society May 2014 Ist place at the 2014 Art of Science Competition at Stanford University. \nhttp://www.stanford.edu/group/mrs/cgi-bin/wordpress/artofscience2014/ Additional Honors & Awards World Technology Award in the field of biotechnology, December 2010 \nhttp://wtn.net/summit2013/index.php Additional Honors & Awards World Technology Award in the field of biotechnology, December 2010 \nhttp://wtn.net/summit2013/index.php Additional Honors & Awards World Technology Award in the field of biotechnology, December 2010 \nhttp://wtn.net/summit2013/index.php ", "Summary Specialties:Neuro Opthalmology, Thyroid Eye Disease, Orbital Diseases Strabismus, Facial Plastics Summary Specialties:Neuro Opthalmology, Thyroid Eye Disease, Orbital Diseases Strabismus, Facial Plastics Specialties:Neuro Opthalmology, Thyroid Eye Disease, Orbital Diseases Strabismus, Facial Plastics Specialties:Neuro Opthalmology, Thyroid Eye Disease, Orbital Diseases Strabismus, Facial Plastics Experience Founder Let's Face It Together 2010  – Present (5 years) Let''s Face It Together was a dream for many years. The goal is to provide a resource for patients with medical issues to better navigate the complex medical system that exists in the US today. We are in the process of applying for grants that will fund medical and surgical care for patients without insurance or underinsured. Councilor American Academy of Ophthalmology 2007  – Present (8 years) I am currently the president of the California Academy of Eye Physicians and Surgeons and am serving in my fourth year as councilor with the AAO. At the April council meeting I introduced a resolution for the AAO to establish a task force to examine how ophthalmology can utlilize telemedicine to improve patient care in California and the rest of the US. Physician Owner Kimberly Cockerham, MD November 2006  – Present (8 years 10 months) Cockerham Eye Consultants was started in 2006 with the primary location in Los Altos. The primary location is now in both silicon valley and the central valley. Maps and locations are available on CockerhamMD.com Adjunct Clinical Associate Professor Stanford University Medical Center 2006  – Present (9 years) Palo Alto I really enjoying mentoring residents and coordinating the Plastics and Orbit section of the annual Bay Area Course in Ophthalmology at Stanford. \n \nWhile my clinical activities at the Palo Alto VA are limited, the returning blast injured veterans are so in need of evaluation and surgical reconstruction. The residents and I are honored to provide for their needs. Plastics-Orbit-Neuro-ophthalmology Palo Alto Veterans Health Care System 2006  –  2011  (5 years) Adjunct Associate Clinical Professor Stanford University Medical Center 2006  –  2010  (4 years) Ophthalmologist with subspecialty training in neuro-orbit and plastic reconstruction Blind and Vision Rehab Services 1992  –  2010  (18 years) This year, I celebrate my 25th anniversary of being an MD. The reunion is in September and I look forward to seeing my med school colleagues and reconnecting.  \n \nI love what I do and am thrilled to be part of the Zeiter Eye Medical Group and helping to care for patients in the central valley of California. So many patients with serious needs - its very rewarding.  \n \nI look forward to continuing to help train Stanford residents and to care for patients returning from Afghanistan within the Palo Alto VA system. \n \nPlastics-Orbit and Neuro-ophthalmology are just the right combination of medicine heavy and medicine not so serious. \n \nI am currently seeing patients in Silicon Valley in Cupertino - Dr. Chase Lay is terrific. I am also pairing with Diane and Balisimo and have launched a medspa on State Street that is great fun. \n \nBut my heart and sole are dedicated to the patients of the central valley with my primary office now in Stockton with the Zeiter Eye Medical Group. \n \nLife is a great journey ! Fellowship preceptor Palo Alto VA 2007  –  2008  (1 year) Former, Director of Ophthalmic Plastics and Reconstruction University of California, San Francisco 2004  –  2006  (2 years) Consultant, Neuro-Ophthalmology Fitzsimons Army Medical Center, Aurora, CO 1993  –  1994  (1 year) Founder Let's Face It Together 2010  – Present (5 years) Let''s Face It Together was a dream for many years. The goal is to provide a resource for patients with medical issues to better navigate the complex medical system that exists in the US today. We are in the process of applying for grants that will fund medical and surgical care for patients without insurance or underinsured. Founder Let's Face It Together 2010  – Present (5 years) Let''s Face It Together was a dream for many years. The goal is to provide a resource for patients with medical issues to better navigate the complex medical system that exists in the US today. We are in the process of applying for grants that will fund medical and surgical care for patients without insurance or underinsured. Councilor American Academy of Ophthalmology 2007  – Present (8 years) I am currently the president of the California Academy of Eye Physicians and Surgeons and am serving in my fourth year as councilor with the AAO. At the April council meeting I introduced a resolution for the AAO to establish a task force to examine how ophthalmology can utlilize telemedicine to improve patient care in California and the rest of the US. Councilor American Academy of Ophthalmology 2007  – Present (8 years) I am currently the president of the California Academy of Eye Physicians and Surgeons and am serving in my fourth year as councilor with the AAO. At the April council meeting I introduced a resolution for the AAO to establish a task force to examine how ophthalmology can utlilize telemedicine to improve patient care in California and the rest of the US. Physician Owner Kimberly Cockerham, MD November 2006  – Present (8 years 10 months) Cockerham Eye Consultants was started in 2006 with the primary location in Los Altos. The primary location is now in both silicon valley and the central valley. Maps and locations are available on CockerhamMD.com Physician Owner Kimberly Cockerham, MD November 2006  – Present (8 years 10 months) Cockerham Eye Consultants was started in 2006 with the primary location in Los Altos. The primary location is now in both silicon valley and the central valley. Maps and locations are available on CockerhamMD.com Adjunct Clinical Associate Professor Stanford University Medical Center 2006  – Present (9 years) Palo Alto I really enjoying mentoring residents and coordinating the Plastics and Orbit section of the annual Bay Area Course in Ophthalmology at Stanford. \n \nWhile my clinical activities at the Palo Alto VA are limited, the returning blast injured veterans are so in need of evaluation and surgical reconstruction. The residents and I are honored to provide for their needs. Adjunct Clinical Associate Professor Stanford University Medical Center 2006  – Present (9 years) Palo Alto I really enjoying mentoring residents and coordinating the Plastics and Orbit section of the annual Bay Area Course in Ophthalmology at Stanford. \n \nWhile my clinical activities at the Palo Alto VA are limited, the returning blast injured veterans are so in need of evaluation and surgical reconstruction. The residents and I are honored to provide for their needs. Plastics-Orbit-Neuro-ophthalmology Palo Alto Veterans Health Care System 2006  –  2011  (5 years) Plastics-Orbit-Neuro-ophthalmology Palo Alto Veterans Health Care System 2006  –  2011  (5 years) Adjunct Associate Clinical Professor Stanford University Medical Center 2006  –  2010  (4 years) Adjunct Associate Clinical Professor Stanford University Medical Center 2006  –  2010  (4 years) Ophthalmologist with subspecialty training in neuro-orbit and plastic reconstruction Blind and Vision Rehab Services 1992  –  2010  (18 years) This year, I celebrate my 25th anniversary of being an MD. The reunion is in September and I look forward to seeing my med school colleagues and reconnecting.  \n \nI love what I do and am thrilled to be part of the Zeiter Eye Medical Group and helping to care for patients in the central valley of California. So many patients with serious needs - its very rewarding.  \n \nI look forward to continuing to help train Stanford residents and to care for patients returning from Afghanistan within the Palo Alto VA system. \n \nPlastics-Orbit and Neuro-ophthalmology are just the right combination of medicine heavy and medicine not so serious. \n \nI am currently seeing patients in Silicon Valley in Cupertino - Dr. Chase Lay is terrific. I am also pairing with Diane and Balisimo and have launched a medspa on State Street that is great fun. \n \nBut my heart and sole are dedicated to the patients of the central valley with my primary office now in Stockton with the Zeiter Eye Medical Group. \n \nLife is a great journey ! Ophthalmologist with subspecialty training in neuro-orbit and plastic reconstruction Blind and Vision Rehab Services 1992  –  2010  (18 years) This year, I celebrate my 25th anniversary of being an MD. The reunion is in September and I look forward to seeing my med school colleagues and reconnecting.  \n \nI love what I do and am thrilled to be part of the Zeiter Eye Medical Group and helping to care for patients in the central valley of California. So many patients with serious needs - its very rewarding.  \n \nI look forward to continuing to help train Stanford residents and to care for patients returning from Afghanistan within the Palo Alto VA system. \n \nPlastics-Orbit and Neuro-ophthalmology are just the right combination of medicine heavy and medicine not so serious. \n \nI am currently seeing patients in Silicon Valley in Cupertino - Dr. Chase Lay is terrific. I am also pairing with Diane and Balisimo and have launched a medspa on State Street that is great fun. \n \nBut my heart and sole are dedicated to the patients of the central valley with my primary office now in Stockton with the Zeiter Eye Medical Group. \n \nLife is a great journey ! Fellowship preceptor Palo Alto VA 2007  –  2008  (1 year) Fellowship preceptor Palo Alto VA 2007  –  2008  (1 year) Former, Director of Ophthalmic Plastics and Reconstruction University of California, San Francisco 2004  –  2006  (2 years) Former, Director of Ophthalmic Plastics and Reconstruction University of California, San Francisco 2004  –  2006  (2 years) Consultant, Neuro-Ophthalmology Fitzsimons Army Medical Center, Aurora, CO 1993  –  1994  (1 year) Consultant, Neuro-Ophthalmology Fitzsimons Army Medical Center, Aurora, CO 1993  –  1994  (1 year) Skills Disease Neurology Clinical Research Surgery Healthcare Clinical Trials Medicine Hospitals Medical Devices EMR Treatment Skills  Disease Neurology Clinical Research Surgery Healthcare Clinical Trials Medicine Hospitals Medical Devices EMR Treatment Disease Neurology Clinical Research Surgery Healthcare Clinical Trials Medicine Hospitals Medical Devices EMR Treatment Disease Neurology Clinical Research Surgery Healthcare Clinical Trials Medicine Hospitals Medical Devices EMR Treatment Education The George Washington University Doctor of Medicine (M.D.) 1983  – 1987 UCSD Bachelor of Arts (B.A.),  Biology , General 1978  – 1984 The George Washington University Doctor of Medicine (M.D.) 1983  – 1987 The George Washington University Doctor of Medicine (M.D.) 1983  – 1987 The George Washington University Doctor of Medicine (M.D.) 1983  – 1987 UCSD Bachelor of Arts (B.A.),  Biology , General 1978  – 1984 UCSD Bachelor of Arts (B.A.),  Biology , General 1978  – 1984 UCSD Bachelor of Arts (B.A.),  Biology , General 1978  – 1984 ", "Experience Freelance/Consultant Editor/Writer Universities, Heritage, & Arts firms 2009  – Present (6 years) Copyeditor for international scholarly book collaboration for archaeology professor Stanford University September 2009  –  August 2010  (1 year) Visitor interiviews for History Gallery of CA Museum SF Museum Evaluation Firm May 2010  –  June 2010  (2 months) Copyeditor for funding agency excavation report for archaeology professor Stanford University April 2010  –  June 2010  (3 months) Visitor feedback interviews for SF Art Museum SF Museum Evaluation Firm October 2009  –  February 2010  (5 months) Visitor observation and data collection for California science museum SF Museum Evaluation Firm 2009  –  2009  (less than a year) Freelance/Consultant Editor/Writer Universities, Heritage, & Arts firms 2009  – Present (6 years) Freelance/Consultant Editor/Writer Universities, Heritage, & Arts firms 2009  – Present (6 years) Copyeditor for international scholarly book collaboration for archaeology professor Stanford University September 2009  –  August 2010  (1 year) Copyeditor for international scholarly book collaboration for archaeology professor Stanford University September 2009  –  August 2010  (1 year) Visitor interiviews for History Gallery of CA Museum SF Museum Evaluation Firm May 2010  –  June 2010  (2 months) Visitor interiviews for History Gallery of CA Museum SF Museum Evaluation Firm May 2010  –  June 2010  (2 months) Copyeditor for funding agency excavation report for archaeology professor Stanford University April 2010  –  June 2010  (3 months) Copyeditor for funding agency excavation report for archaeology professor Stanford University April 2010  –  June 2010  (3 months) Visitor feedback interviews for SF Art Museum SF Museum Evaluation Firm October 2009  –  February 2010  (5 months) Visitor feedback interviews for SF Art Museum SF Museum Evaluation Firm October 2009  –  February 2010  (5 months) Visitor observation and data collection for California science museum SF Museum Evaluation Firm 2009  –  2009  (less than a year) Visitor observation and data collection for California science museum SF Museum Evaluation Firm 2009  –  2009  (less than a year) Skills Project/Administrative... Archaeology of Religion Museum Data Collection Research Publicity Editing/Writing Quantum... Skills  Project/Administrative... Archaeology of Religion Museum Data Collection Research Publicity Editing/Writing Quantum... Project/Administrative... Archaeology of Religion Museum Data Collection Research Publicity Editing/Writing Quantum... Project/Administrative... Archaeology of Religion Museum Data Collection Research Publicity Editing/Writing Quantum... ", "Skills Genetics Microscopy Science Cell Biology Molecular Biology Scientific Writing Biochemistry Cell Culture Research Life Sciences Developmental Biology PCR Molecular Cloning Fluorescence Microscopy Bioinformatics Genomics See 1+     See less Skills  Genetics Microscopy Science Cell Biology Molecular Biology Scientific Writing Biochemistry Cell Culture Research Life Sciences Developmental Biology PCR Molecular Cloning Fluorescence Microscopy Bioinformatics Genomics See 1+     See less Genetics Microscopy Science Cell Biology Molecular Biology Scientific Writing Biochemistry Cell Culture Research Life Sciences Developmental Biology PCR Molecular Cloning Fluorescence Microscopy Bioinformatics Genomics See 1+     See less Genetics Microscopy Science Cell Biology Molecular Biology Scientific Writing Biochemistry Cell Culture Research Life Sciences Developmental Biology PCR Molecular Cloning Fluorescence Microscopy Bioinformatics Genomics See 1+     See less ", "Summary Specialties:Research in sleep, neuropeptides, neuronal circuits, addiction, behavior Summary Specialties:Research in sleep, neuropeptides, neuronal circuits, addiction, behavior Specialties:Research in sleep, neuropeptides, neuronal circuits, addiction, behavior Specialties:Research in sleep, neuropeptides, neuronal circuits, addiction, behavior Experience Professor Stanford University School of Medicine December 2011  – Present (3 years 9 months) Stanford, CA Associate Professor Stanford University March 2006  –  November 2011  (5 years 9 months) Associate Professor The Scripps Research Institute 1996  –  2006  (10 years) Postdoctoral fellow The Scripps Research Institute 1992  –  1995  (3 years) Professor Stanford University School of Medicine December 2011  – Present (3 years 9 months) Stanford, CA Professor Stanford University School of Medicine December 2011  – Present (3 years 9 months) Stanford, CA Associate Professor Stanford University March 2006  –  November 2011  (5 years 9 months) Associate Professor Stanford University March 2006  –  November 2011  (5 years 9 months) Associate Professor The Scripps Research Institute 1996  –  2006  (10 years) Associate Professor The Scripps Research Institute 1996  –  2006  (10 years) Postdoctoral fellow The Scripps Research Institute 1992  –  1995  (3 years) Postdoctoral fellow The Scripps Research Institute 1992  –  1995  (3 years) Skills Molecular Biology Skills  Molecular Biology Molecular Biology Molecular Biology Education Universitat de Barcelona Ph.D.,  Biology 1987  – 1990 Universitat de Barcelona Ph.D.,  Biology 1987  – 1990 Universitat de Barcelona Ph.D.,  Biology 1987  – 1990 Universitat de Barcelona Ph.D.,  Biology 1987  – 1990 ", "Experience Professor Stanford University 2012  – Present (3 years) Associate Professor Stanford University 2004  –  2012  (8 years) Distinguished Member of Technical Staff Bell Laboratories 2001  –  2004  (3 years) Member of Technical Staff Bell Laboratories 1995  –  2001  (6 years) Professor Stanford University 2012  – Present (3 years) Professor Stanford University 2012  – Present (3 years) Associate Professor Stanford University 2004  –  2012  (8 years) Associate Professor Stanford University 2004  –  2012  (8 years) Distinguished Member of Technical Staff Bell Laboratories 2001  –  2004  (3 years) Distinguished Member of Technical Staff Bell Laboratories 2001  –  2004  (3 years) Member of Technical Staff Bell Laboratories 1995  –  2001  (6 years) Member of Technical Staff Bell Laboratories 1995  –  2001  (6 years) Skills Materials Science Thin Films Nanotechnology Chemistry Characterization Organic Synthesis TEM Organic Chemistry Inorganic Chemistry Nanomaterials FTIR Mass Spectrometry NMR spectroscopy IR Science Chemical Engineering Simulations Biochemistry Polymer Characterization R&D Optics Physics Surface Chemistry Nanofabrication Scanning Electron... Experimentation Design of Experiments IR spectroscopy Electrochemistry Fluorescence XPS Spectroscopy Fluorescence... Polymer Science AFM Polymers Nanoparticles Polymer Chemistry Biomaterials UV/Vis Powder X-ray Diffraction Analytical Chemistry NMR Physical Chemistry See 29+     See less Skills  Materials Science Thin Films Nanotechnology Chemistry Characterization Organic Synthesis TEM Organic Chemistry Inorganic Chemistry Nanomaterials FTIR Mass Spectrometry NMR spectroscopy IR Science Chemical Engineering Simulations Biochemistry Polymer Characterization R&D Optics Physics Surface Chemistry Nanofabrication Scanning Electron... Experimentation Design of Experiments IR spectroscopy Electrochemistry Fluorescence XPS Spectroscopy Fluorescence... Polymer Science AFM Polymers Nanoparticles Polymer Chemistry Biomaterials UV/Vis Powder X-ray Diffraction Analytical Chemistry NMR Physical Chemistry See 29+     See less Materials Science Thin Films Nanotechnology Chemistry Characterization Organic Synthesis TEM Organic Chemistry Inorganic Chemistry Nanomaterials FTIR Mass Spectrometry NMR spectroscopy IR Science Chemical Engineering Simulations Biochemistry Polymer Characterization R&D Optics Physics Surface Chemistry Nanofabrication Scanning Electron... Experimentation Design of Experiments IR spectroscopy Electrochemistry Fluorescence XPS Spectroscopy Fluorescence... Polymer Science AFM Polymers Nanoparticles Polymer Chemistry Biomaterials UV/Vis Powder X-ray Diffraction Analytical Chemistry NMR Physical Chemistry See 29+     See less Materials Science Thin Films Nanotechnology Chemistry Characterization Organic Synthesis TEM Organic Chemistry Inorganic Chemistry Nanomaterials FTIR Mass Spectrometry NMR spectroscopy IR Science Chemical Engineering Simulations Biochemistry Polymer Characterization R&D Optics Physics Surface Chemistry Nanofabrication Scanning Electron... Experimentation Design of Experiments IR spectroscopy Electrochemistry Fluorescence XPS Spectroscopy Fluorescence... Polymer Science AFM Polymers Nanoparticles Polymer Chemistry Biomaterials UV/Vis Powder X-ray Diffraction Analytical Chemistry NMR Physical Chemistry See 29+     See less Education University of Chicago Ph.D,  Chemistry 1991  – 1995 Nanjing University Chemistry 1987  – 1990 University of Chicago Ph.D,  Chemistry 1991  – 1995 University of Chicago Ph.D,  Chemistry 1991  – 1995 University of Chicago Ph.D,  Chemistry 1991  – 1995 Nanjing University Chemistry 1987  – 1990 Nanjing University Chemistry 1987  – 1990 Nanjing University Chemistry 1987  – 1990 Honors & Awards Additional Honors & Awards 1.\tArthur C. Cope Scholar Award, ACS, 2011. \n2.\tAmerican Chemical Society (ACS) Fellow, 2011. \n3.\tPolymeric Materials: Science and Engineering (PMSE) Fellow, 2011. \n4.\t\"2010 Most influential Chinese in the World\", Science and Technology Category. As selected by Phoenix TV, China (other recipients include Li Na for the sports category, who has recently won the Ladies 2011 French Open). April, 2011 \n5.\tThe Royal Society of Chemistry Beilby Medal and Prize, 2009 \n6. National Science Foundation (NSF) American Competitiveness and Innovation Fellow (ACIF) , 2009 \n7. Polymer International IUPAC Polymer Prize, 2008 \n8. Elected as SPIE Fellow, 2008. Additional Honors & Awards 1.\tArthur C. Cope Scholar Award, ACS, 2011. \n2.\tAmerican Chemical Society (ACS) Fellow, 2011. \n3.\tPolymeric Materials: Science and Engineering (PMSE) Fellow, 2011. \n4.\t\"2010 Most influential Chinese in the World\", Science and Technology Category. As selected by Phoenix TV, China (other recipients include Li Na for the sports category, who has recently won the Ladies 2011 French Open). April, 2011 \n5.\tThe Royal Society of Chemistry Beilby Medal and Prize, 2009 \n6. National Science Foundation (NSF) American Competitiveness and Innovation Fellow (ACIF) , 2009 \n7. Polymer International IUPAC Polymer Prize, 2008 \n8. Elected as SPIE Fellow, 2008. Additional Honors & Awards 1.\tArthur C. Cope Scholar Award, ACS, 2011. \n2.\tAmerican Chemical Society (ACS) Fellow, 2011. \n3.\tPolymeric Materials: Science and Engineering (PMSE) Fellow, 2011. \n4.\t\"2010 Most influential Chinese in the World\", Science and Technology Category. As selected by Phoenix TV, China (other recipients include Li Na for the sports category, who has recently won the Ladies 2011 French Open). April, 2011 \n5.\tThe Royal Society of Chemistry Beilby Medal and Prize, 2009 \n6. National Science Foundation (NSF) American Competitiveness and Innovation Fellow (ACIF) , 2009 \n7. Polymer International IUPAC Polymer Prize, 2008 \n8. Elected as SPIE Fellow, 2008. Additional Honors & Awards 1.\tArthur C. Cope Scholar Award, ACS, 2011. \n2.\tAmerican Chemical Society (ACS) Fellow, 2011. \n3.\tPolymeric Materials: Science and Engineering (PMSE) Fellow, 2011. \n4.\t\"2010 Most influential Chinese in the World\", Science and Technology Category. As selected by Phoenix TV, China (other recipients include Li Na for the sports category, who has recently won the Ladies 2011 French Open). April, 2011 \n5.\tThe Royal Society of Chemistry Beilby Medal and Prize, 2009 \n6. National Science Foundation (NSF) American Competitiveness and Innovation Fellow (ACIF) , 2009 \n7. Polymer International IUPAC Polymer Prize, 2008 \n8. Elected as SPIE Fellow, 2008. ", "Experience Associate Professor Stanford University October 2009  – Present (5 years 11 months) Assistant Professor Stanford University September 2001  –  September 2009  (8 years 1 month) postdoc Brandeis University 1995  –  2001  (6 years) graduate student UCSD 1989  –  1995  (6 years) graduate student UCSD 1989  –  1995  (6 years) Associate Professor Stanford University October 2009  – Present (5 years 11 months) Associate Professor Stanford University October 2009  – Present (5 years 11 months) Assistant Professor Stanford University September 2001  –  September 2009  (8 years 1 month) Assistant Professor Stanford University September 2001  –  September 2009  (8 years 1 month) postdoc Brandeis University 1995  –  2001  (6 years) postdoc Brandeis University 1995  –  2001  (6 years) graduate student UCSD 1989  –  1995  (6 years) graduate student UCSD 1989  –  1995  (6 years) graduate student UCSD 1989  –  1995  (6 years) graduate student UCSD 1989  –  1995  (6 years) Skills Teaching Research Science Life Sciences Higher Education Lifesciences Molecular Biology Biophysics Protein Chemistry Physiology Neuroscience Biochemistry Cell Biology Microscopy Fluorescence Microscopy Cell Culture See 1+     See less Skills  Teaching Research Science Life Sciences Higher Education Lifesciences Molecular Biology Biophysics Protein Chemistry Physiology Neuroscience Biochemistry Cell Biology Microscopy Fluorescence Microscopy Cell Culture See 1+     See less Teaching Research Science Life Sciences Higher Education Lifesciences Molecular Biology Biophysics Protein Chemistry Physiology Neuroscience Biochemistry Cell Biology Microscopy Fluorescence Microscopy Cell Culture See 1+     See less Teaching Research Science Life Sciences Higher Education Lifesciences Molecular Biology Biophysics Protein Chemistry Physiology Neuroscience Biochemistry Cell Biology Microscopy Fluorescence Microscopy Cell Culture See 1+     See less Education University of California, San Diego 1989  – 1995 University of California, San Diego 1989  – 1995 University of California, San Diego 1989  – 1995 University of California, San Diego 1989  – 1995 ", "Honors & Awards Excellence in Undergraduate Teaching Award Tau Beta Pi - Stanford University June 2013 Excellence in Undergraduate Teaching Award Tau Beta Pi - Stanford University June 2013 Excellence in Undergraduate Teaching Award Tau Beta Pi - Stanford University June 2013 Excellence in Undergraduate Teaching Award Tau Beta Pi - Stanford University June 2013 ", "Summary I am passionate about understanding how our senses work and how disease compromises touch and proprioception. I am equally passionate about increasing gender equality in STEM fields. Summary I am passionate about understanding how our senses work and how disease compromises touch and proprioception. I am equally passionate about increasing gender equality in STEM fields. I am passionate about understanding how our senses work and how disease compromises touch and proprioception. I am equally passionate about increasing gender equality in STEM fields. I am passionate about understanding how our senses work and how disease compromises touch and proprioception. I am equally passionate about increasing gender equality in STEM fields. Experience Associate Professor Stanford University February 2010  – Present (5 years 7 months) Tenured Professor; Research interests include touch and pain sensation which we study in the nematode Caenorhabditis elegans using a combination of electrophysiology and genetics. Assistant Professor Stanford University January 2002  –  January 2010  (8 years 1 month) Assistant Professor of Molecular and Cellular Physiology at the Stanford University School of Medicine. Research Interests: Molecular Basis of Neurosensory Mechanotransduction and Thermotransduction. NRSA Postdoctoral Fellow Columbia University 1995  –  2001  (6 years) Analysis of ion channel biophysics and touch sensation Postdoctoral Scholar University of Oregon 1995  –  1997  (2 years) PhD Student University of Chicago 1988  –  1995  (7 years) ion channels and their role in hearing Associate Professor Stanford University February 2010  – Present (5 years 7 months) Tenured Professor; Research interests include touch and pain sensation which we study in the nematode Caenorhabditis elegans using a combination of electrophysiology and genetics. Associate Professor Stanford University February 2010  – Present (5 years 7 months) Tenured Professor; Research interests include touch and pain sensation which we study in the nematode Caenorhabditis elegans using a combination of electrophysiology and genetics. Assistant Professor Stanford University January 2002  –  January 2010  (8 years 1 month) Assistant Professor of Molecular and Cellular Physiology at the Stanford University School of Medicine. Research Interests: Molecular Basis of Neurosensory Mechanotransduction and Thermotransduction. Assistant Professor Stanford University January 2002  –  January 2010  (8 years 1 month) Assistant Professor of Molecular and Cellular Physiology at the Stanford University School of Medicine. Research Interests: Molecular Basis of Neurosensory Mechanotransduction and Thermotransduction. NRSA Postdoctoral Fellow Columbia University 1995  –  2001  (6 years) Analysis of ion channel biophysics and touch sensation NRSA Postdoctoral Fellow Columbia University 1995  –  2001  (6 years) Analysis of ion channel biophysics and touch sensation Postdoctoral Scholar University of Oregon 1995  –  1997  (2 years) Postdoctoral Scholar University of Oregon 1995  –  1997  (2 years) PhD Student University of Chicago 1988  –  1995  (7 years) ion channels and their role in hearing PhD Student University of Chicago 1988  –  1995  (7 years) ion channels and their role in hearing Languages French French French Skills Neuroscience Genetics Biophysics Electrophysiology Molecular Biology Microscopy Cell Biology Confocal Microscopy Fluorescence Microscopy Biochemistry Lifesciences Cell Culture Immunohistochemistry Genomics Science Cell Physiology Biology Animal Models Molecular Cloning In Vivo Life Sciences See 7+     See less Skills  Neuroscience Genetics Biophysics Electrophysiology Molecular Biology Microscopy Cell Biology Confocal Microscopy Fluorescence Microscopy Biochemistry Lifesciences Cell Culture Immunohistochemistry Genomics Science Cell Physiology Biology Animal Models Molecular Cloning In Vivo Life Sciences See 7+     See less Neuroscience Genetics Biophysics Electrophysiology Molecular Biology Microscopy Cell Biology Confocal Microscopy Fluorescence Microscopy Biochemistry Lifesciences Cell Culture Immunohistochemistry Genomics Science Cell Physiology Biology Animal Models Molecular Cloning In Vivo Life Sciences See 7+     See less Neuroscience Genetics Biophysics Electrophysiology Molecular Biology Microscopy Cell Biology Confocal Microscopy Fluorescence Microscopy Biochemistry Lifesciences Cell Culture Immunohistochemistry Genomics Science Cell Physiology Biology Animal Models Molecular Cloning In Vivo Life Sciences See 7+     See less Education The University of Chicago PhD,  Neurobiology 1988  – 1995 University of Chicago - The Pritzker School of Medicine Ph.D.,  Neurobiology 1988  – 1995 Activities and Societies:  Research: Molecular and ionic basis of frequency selectivity in auditor hair cells Brown University ScB,  Biochemistry 1982  – 1986 Walt Whitman High School 1980  – 1982 The University of Chicago PhD,  Neurobiology 1988  – 1995 The University of Chicago PhD,  Neurobiology 1988  – 1995 The University of Chicago PhD,  Neurobiology 1988  – 1995 University of Chicago - The Pritzker School of Medicine Ph.D.,  Neurobiology 1988  – 1995 Activities and Societies:  Research: Molecular and ionic basis of frequency selectivity in auditor hair cells University of Chicago - The Pritzker School of Medicine Ph.D.,  Neurobiology 1988  – 1995 Activities and Societies:  Research: Molecular and ionic basis of frequency selectivity in auditor hair cells University of Chicago - The Pritzker School of Medicine Ph.D.,  Neurobiology 1988  – 1995 Activities and Societies:  Research: Molecular and ionic basis of frequency selectivity in auditor hair cells Brown University ScB,  Biochemistry 1982  – 1986 Brown University ScB,  Biochemistry 1982  – 1986 Brown University ScB,  Biochemistry 1982  – 1986 Walt Whitman High School 1980  – 1982 Walt Whitman High School 1980  – 1982 Walt Whitman High School 1980  – 1982 ", "Summary Associate Professor, Stanford University and author of Injury: Product Design and Liability Law in the United States (University of Princeton Press, 2006) and Malignant: How Cancer Becomes Us (University of California Press, 2013). Summary Associate Professor, Stanford University and author of Injury: Product Design and Liability Law in the United States (University of Princeton Press, 2006) and Malignant: How Cancer Becomes Us (University of California Press, 2013). Associate Professor, Stanford University and author of Injury: Product Design and Liability Law in the United States (University of Princeton Press, 2006) and Malignant: How Cancer Becomes Us (University of California Press, 2013). Associate Professor, Stanford University and author of Injury: Product Design and Liability Law in the United States (University of Princeton Press, 2006) and Malignant: How Cancer Becomes Us (University of California Press, 2013). Experience Professor Stanford University 1999  – Present (16 years) Professor Stanford University 1999  – Present (16 years) Professor Stanford University 1999  – Present (16 years) Skills Teaching Research Qualitative Research Higher Education Skills  Teaching Research Qualitative Research Higher Education Teaching Research Qualitative Research Higher Education Teaching Research Qualitative Research Higher Education Education University of California, Santa Cruz Doctor of Philosophy (PhD),  History of Consciousness University of California, Santa Cruz Doctor of Philosophy (PhD),  History of Consciousness University of California, Santa Cruz Doctor of Philosophy (PhD),  History of Consciousness University of California, Santa Cruz Doctor of Philosophy (PhD),  History of Consciousness ", "Experience Associate Professor Stanford University September 2011  – Present (4 years) Advisor Upwork (previously Elance-oDesk) February 2014  – Present (1 year 7 months) Advisor Optimizely January 2014  – Present (1 year 8 months) Advisor iMATCHATIVE INC. April 2013  – Present (2 years 5 months) Director, Data Products and Research oDesk April 2013  –  December 2013  (9 months) Consulting Scientist oDesk June 2012  –  March 2013  (10 months) Assistant Professor Stanford University July 2004  –  2011  (7 years) Research Assistant Whitehead Institute Center for Genome Research September 1997  –  August 1998  (1 year) Associate Professor Stanford University September 2011  – Present (4 years) Associate Professor Stanford University September 2011  – Present (4 years) Advisor Upwork (previously Elance-oDesk) February 2014  – Present (1 year 7 months) Advisor Upwork (previously Elance-oDesk) February 2014  – Present (1 year 7 months) Advisor Optimizely January 2014  – Present (1 year 8 months) Advisor Optimizely January 2014  – Present (1 year 8 months) Advisor iMATCHATIVE INC. April 2013  – Present (2 years 5 months) Advisor iMATCHATIVE INC. April 2013  – Present (2 years 5 months) Director, Data Products and Research oDesk April 2013  –  December 2013  (9 months) Director, Data Products and Research oDesk April 2013  –  December 2013  (9 months) Consulting Scientist oDesk June 2012  –  March 2013  (10 months) Consulting Scientist oDesk June 2012  –  March 2013  (10 months) Assistant Professor Stanford University July 2004  –  2011  (7 years) Assistant Professor Stanford University July 2004  –  2011  (7 years) Research Assistant Whitehead Institute Center for Genome Research September 1997  –  August 1998  (1 year) Research Assistant Whitehead Institute Center for Genome Research September 1997  –  August 1998  (1 year) Skills Game Theory Stochastic Modeling Stochastic Processes Mathematical Modeling Mathematical Programming Market Design Online Platforms Data Products Microeconomics Optimization Computer Science Skills  Game Theory Stochastic Modeling Stochastic Processes Mathematical Modeling Mathematical Programming Market Design Online Platforms Data Products Microeconomics Optimization Computer Science Game Theory Stochastic Modeling Stochastic Processes Mathematical Modeling Mathematical Programming Market Design Online Platforms Data Products Microeconomics Optimization Computer Science Game Theory Stochastic Modeling Stochastic Processes Mathematical Modeling Mathematical Programming Market Design Online Platforms Data Products Microeconomics Optimization Computer Science Education Massachusetts Institute of Technology Ph.D. 2000  – 2004 University of Cambridge CASM 1998  – 2000 Harvard University AB 1994  – 1998 Massachusetts Institute of Technology Ph.D. 2000  – 2004 Massachusetts Institute of Technology Ph.D. 2000  – 2004 Massachusetts Institute of Technology Ph.D. 2000  – 2004 University of Cambridge CASM 1998  – 2000 University of Cambridge CASM 1998  – 2000 University of Cambridge CASM 1998  – 2000 Harvard University AB 1994  – 1998 Harvard University AB 1994  – 1998 Harvard University AB 1994  – 1998 ", "Experience Professor Stanford University September 2013  – Present (2 years) Professor Stanford University September 2013  – Present (2 years) Professor Stanford University September 2013  – Present (2 years) Education The University of Texas at Austin PhD 1992  – 1997 Princeton University BSE 1986  – 1990 The University of Texas at Austin PhD 1992  – 1997 The University of Texas at Austin PhD 1992  – 1997 The University of Texas at Austin PhD 1992  – 1997 Princeton University BSE 1986  – 1990 Princeton University BSE 1986  – 1990 Princeton University BSE 1986  – 1990 ", "Skills Cross-functional Team... Design Thinking Ethnography InDesign Product Development Experience Design Interaction Design Human Computer... Product Design Entrepreneurship User-centered Design User Experience Research Design Design Strategy Engineering Industrial Design Product Innovation User Research Rapid Prototyping Concept Development Mechanical Engineering User Experience Design Usability Testing See 8+     See less Skills  Cross-functional Team... Design Thinking Ethnography InDesign Product Development Experience Design Interaction Design Human Computer... Product Design Entrepreneurship User-centered Design User Experience Research Design Design Strategy Engineering Industrial Design Product Innovation User Research Rapid Prototyping Concept Development Mechanical Engineering User Experience Design Usability Testing See 8+     See less Cross-functional Team... Design Thinking Ethnography InDesign Product Development Experience Design Interaction Design Human Computer... Product Design Entrepreneurship User-centered Design User Experience Research Design Design Strategy Engineering Industrial Design Product Innovation User Research Rapid Prototyping Concept Development Mechanical Engineering User Experience Design Usability Testing See 8+     See less Cross-functional Team... Design Thinking Ethnography InDesign Product Development Experience Design Interaction Design Human Computer... Product Design Entrepreneurship User-centered Design User Experience Research Design Design Strategy Engineering Industrial Design Product Innovation User Research Rapid Prototyping Concept Development Mechanical Engineering User Experience Design Usability Testing See 8+     See less ", "Experience Clinical Associate Professor Stanford University School of Medicine March 2013  – Present (2 years 6 months) Director, Clinical Child Psychology Postdoctoral Fellowship Program Stanford University School of Medicine January 1998  – Present (17 years 8 months) Associate Professor Stanford University School of Medicine January 2008  –  March 2013  (5 years 3 months) Director of Outpatient Services Stanford University School of Medicine January 1998  –  December 2012  (15 years) Child and Adolescent Psychiatry Assistant Professor Stanford University School of Medicine March 2000  –  December 2007  (7 years 10 months) Staff Psychologist Stanford University School of Medicine September 1997  –  February 2000  (2 years 6 months) Clinical Associate Professor Stanford University School of Medicine March 2013  – Present (2 years 6 months) Clinical Associate Professor Stanford University School of Medicine March 2013  – Present (2 years 6 months) Director, Clinical Child Psychology Postdoctoral Fellowship Program Stanford University School of Medicine January 1998  – Present (17 years 8 months) Director, Clinical Child Psychology Postdoctoral Fellowship Program Stanford University School of Medicine January 1998  – Present (17 years 8 months) Associate Professor Stanford University School of Medicine January 2008  –  March 2013  (5 years 3 months) Associate Professor Stanford University School of Medicine January 2008  –  March 2013  (5 years 3 months) Director of Outpatient Services Stanford University School of Medicine January 1998  –  December 2012  (15 years) Child and Adolescent Psychiatry Director of Outpatient Services Stanford University School of Medicine January 1998  –  December 2012  (15 years) Child and Adolescent Psychiatry Assistant Professor Stanford University School of Medicine March 2000  –  December 2007  (7 years 10 months) Assistant Professor Stanford University School of Medicine March 2000  –  December 2007  (7 years 10 months) Staff Psychologist Stanford University School of Medicine September 1997  –  February 2000  (2 years 6 months) Staff Psychologist Stanford University School of Medicine September 1997  –  February 2000  (2 years 6 months) Languages English English English Skills Mental Health Psychology Clinical Research Psychological Assessment Adolescents Clinical Supervision Teaching Neuropsychological... Skills  Mental Health Psychology Clinical Research Psychological Assessment Adolescents Clinical Supervision Teaching Neuropsychological... Mental Health Psychology Clinical Research Psychological Assessment Adolescents Clinical Supervision Teaching Neuropsychological... Mental Health Psychology Clinical Research Psychological Assessment Adolescents Clinical Supervision Teaching Neuropsychological... Education Stanford University School of Medicine Postdoctoral Fellowship,  Clinical Child Psychology 1995  – 1997 University of Cincinnati PhD,  Clinical Psychology 1988  – 1995 Pomona College BA,  Psychology 1984  – 1988 Stanford University School of Medicine Postdoctoral Fellowship,  Clinical Child Psychology 1995  – 1997 Stanford University School of Medicine Postdoctoral Fellowship,  Clinical Child Psychology 1995  – 1997 Stanford University School of Medicine Postdoctoral Fellowship,  Clinical Child Psychology 1995  – 1997 University of Cincinnati PhD,  Clinical Psychology 1988  – 1995 University of Cincinnati PhD,  Clinical Psychology 1988  – 1995 University of Cincinnati PhD,  Clinical Psychology 1988  – 1995 Pomona College BA,  Psychology 1984  – 1988 Pomona College BA,  Psychology 1984  – 1988 Pomona College BA,  Psychology 1984  – 1988 ", "Experience Associate Professor Stanford University February 2012  – Present (3 years 7 months) I am a tenured Associate Professor in the Department of Radiation Oncology at Stanford University. My work consists of research on the use of molecular and functional imaging methods to monitor tumor progression and response to treatment, focusing on characterization of tumor radiobiology. I lead a research laboratory utilizing techniques including x-ray computed tomography, positron emission tomography, magnetic resonance imaging, bioluminescence and fluorescence imaging, and conformal radiotherapy. Assistant Professor Stanford University August 2003  –  February 2012  (8 years 7 months) Postdoctoral Fellow Massachusetts General Hospital 2001  –  2003  (2 years) Postdoctoral Fellow Harvard Medical School 2001  –  2003  (2 years) Associate Professor Stanford University February 2012  – Present (3 years 7 months) I am a tenured Associate Professor in the Department of Radiation Oncology at Stanford University. My work consists of research on the use of molecular and functional imaging methods to monitor tumor progression and response to treatment, focusing on characterization of tumor radiobiology. I lead a research laboratory utilizing techniques including x-ray computed tomography, positron emission tomography, magnetic resonance imaging, bioluminescence and fluorescence imaging, and conformal radiotherapy. Associate Professor Stanford University February 2012  – Present (3 years 7 months) I am a tenured Associate Professor in the Department of Radiation Oncology at Stanford University. My work consists of research on the use of molecular and functional imaging methods to monitor tumor progression and response to treatment, focusing on characterization of tumor radiobiology. I lead a research laboratory utilizing techniques including x-ray computed tomography, positron emission tomography, magnetic resonance imaging, bioluminescence and fluorescence imaging, and conformal radiotherapy. Assistant Professor Stanford University August 2003  –  February 2012  (8 years 7 months) Assistant Professor Stanford University August 2003  –  February 2012  (8 years 7 months) Postdoctoral Fellow Massachusetts General Hospital 2001  –  2003  (2 years) Postdoctoral Fellow Massachusetts General Hospital 2001  –  2003  (2 years) Postdoctoral Fellow Harvard Medical School 2001  –  2003  (2 years) Postdoctoral Fellow Harvard Medical School 2001  –  2003  (2 years) Skills Molecular Imaging Animal Models Cancer Research Skills  Molecular Imaging Animal Models Cancer Research Molecular Imaging Animal Models Cancer Research Molecular Imaging Animal Models Cancer Research Education University of California, San Francisco Ph.D.,  Bioengineering 1996  – 2001 Joint program with UC Berkeley. \nThesis title: \"Applications of Magnetic Resonance Spectroscopy in Radiation Therapy of Malignant Glioma\" University of California, Berkeley B.S.,  Bioengineering 1992  – 1996 University of California, San Francisco Ph.D.,  Bioengineering 1996  – 2001 Joint program with UC Berkeley. \nThesis title: \"Applications of Magnetic Resonance Spectroscopy in Radiation Therapy of Malignant Glioma\" University of California, San Francisco Ph.D.,  Bioengineering 1996  – 2001 Joint program with UC Berkeley. \nThesis title: \"Applications of Magnetic Resonance Spectroscopy in Radiation Therapy of Malignant Glioma\" University of California, San Francisco Ph.D.,  Bioengineering 1996  – 2001 Joint program with UC Berkeley. \nThesis title: \"Applications of Magnetic Resonance Spectroscopy in Radiation Therapy of Malignant Glioma\" University of California, Berkeley B.S.,  Bioengineering 1992  – 1996 University of California, Berkeley B.S.,  Bioengineering 1992  – 1996 University of California, Berkeley B.S.,  Bioengineering 1992  – 1996 ", "Experience Assistant Professor Stanford University January 2004  –  September 2010  (6 years 9 months) Postdoctoral Researcher Cold Spring Harbor Laboratory January 1995  –  July 1998  (3 years 7 months) Assistant Professor Stanford University January 2004  –  September 2010  (6 years 9 months) Assistant Professor Stanford University January 2004  –  September 2010  (6 years 9 months) Postdoctoral Researcher Cold Spring Harbor Laboratory January 1995  –  July 1998  (3 years 7 months) Postdoctoral Researcher Cold Spring Harbor Laboratory January 1995  –  July 1998  (3 years 7 months) Skills Yeast Genetics Molecular Biology Genomics Experimental Evolution Molecular Genetics Computational Biology Bioinformatics Sequence Analysis Ontologies Biochemistry Skills  Yeast Genetics Molecular Biology Genomics Experimental Evolution Molecular Genetics Computational Biology Bioinformatics Sequence Analysis Ontologies Biochemistry Yeast Genetics Molecular Biology Genomics Experimental Evolution Molecular Genetics Computational Biology Bioinformatics Sequence Analysis Ontologies Biochemistry Yeast Genetics Molecular Biology Genomics Experimental Evolution Molecular Genetics Computational Biology Bioinformatics Sequence Analysis Ontologies Biochemistry Education The University of Manchester Ph.D.,  Molecular Biology 1991  – 1994 The University of Manchester B.Sc.,  Genetics , First 1988  – 1991 The University of Manchester Ph.D.,  Molecular Biology 1991  – 1994 The University of Manchester Ph.D.,  Molecular Biology 1991  – 1994 The University of Manchester Ph.D.,  Molecular Biology 1991  – 1994 The University of Manchester B.Sc.,  Genetics , First 1988  – 1991 The University of Manchester B.Sc.,  Genetics , First 1988  – 1991 The University of Manchester B.Sc.,  Genetics , First 1988  – 1991 ", "Skills Research Science Experimental Design Scientific Writing Grant Writing Laboratory Skills Animal Models Autism Spectrum... Depression Neuroendocrinology Behavioral Neuroscience Translational Research Biomarkers Social functioning Data Analysis Biotechnology Neuroscience Psychology Psychiatry Immunohistochemistry Cognitive Neuroscience See 6+     See less Skills  Research Science Experimental Design Scientific Writing Grant Writing Laboratory Skills Animal Models Autism Spectrum... Depression Neuroendocrinology Behavioral Neuroscience Translational Research Biomarkers Social functioning Data Analysis Biotechnology Neuroscience Psychology Psychiatry Immunohistochemistry Cognitive Neuroscience See 6+     See less Research Science Experimental Design Scientific Writing Grant Writing Laboratory Skills Animal Models Autism Spectrum... Depression Neuroendocrinology Behavioral Neuroscience Translational Research Biomarkers Social functioning Data Analysis Biotechnology Neuroscience Psychology Psychiatry Immunohistochemistry Cognitive Neuroscience See 6+     See less Research Science Experimental Design Scientific Writing Grant Writing Laboratory Skills Animal Models Autism Spectrum... Depression Neuroendocrinology Behavioral Neuroscience Translational Research Biomarkers Social functioning Data Analysis Biotechnology Neuroscience Psychology Psychiatry Immunohistochemistry Cognitive Neuroscience See 6+     See less Honors & Awards "]}