{"position": "Program Manager", "company": "Intel Corporation", "profiles": ["Summary Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Summary Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Experience Global Strategic Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Dupont, WA I own the global material strategy definition and execution in support of our Server business group. I lead a global team of experienced materials managers that drive the execution of the material strategy to ensure we meet our product cost targets and develop a stable and reliable supply chain. My team collaborates with product planning, engineering and the operations team to deliver server products that delight our customers. Supply Chain Management - Materials Program Manager Intel Corporation March 2014  –  August 2014  (6 months) Dupont, WA Drive component selection for new product introduction project. Engage with suppliers and product engineers to ensure we select components that are optimized for cost, delivery while minimizing risk to the overall supply chain. \n \nCurrently i am working on a project that is looking to significantly improve our supply chain efficiency and responsiveness. Program Manager - Reverse Logistics Intel Corporation January 2006  –  March 2014  (8 years 3 months) Dupont, WA Lead the strategy development, account management and worldwide product reverse logistics (returns supply chain) projects to support of our business unit partners’ strategic objectives. Lead cross functional/Geo teams to deliver complex projects on time, budget and scope. Well versed in Project Lifecycle management. Supply Chain Management - Materials Program Manager Intel Corporation May 2000  –  January 2006  (5 years 9 months) Dupont, WA Drove and implemented the sourcing strategy for Server products. Single point of contact for design engineers and the outsource design manufacturing (ODM) partners to ensure a smooth transition from new product introduction phase to high volume production. Project Controls Group Program Manager Intel Corporation 1998  –  2000  (2 years) Dupont, WA Supported design teams with effective project management practices and methodologies to ensure the success of their programs. Partnered with the design managers to develop project activities definitions, workflows and schedules to help them execute and control the project.  \n \nCollaborated with the teams on critical path and resource optimization analysis to identify opportunities for schedule improvement. Implemented a new project schedule infrastructure, including tools and indicator reporting. Commodity Specialist - Storage Intel Corporation 1996  –  1998  (2 years) Managed the hard disk drive commodity. Created and implemented strategic plans for supplier selection, contract negotiation and cost reduction programs. Customer and Materials Program Manager Intel Corporation February 1993  –  March 1996  (3 years 2 months) Managed the material sourcing strategy for HW programs. Worked with ODM and manufacturing partners on developing master schedule of the programs I supported. Global Strategic Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Dupont, WA I own the global material strategy definition and execution in support of our Server business group. I lead a global team of experienced materials managers that drive the execution of the material strategy to ensure we meet our product cost targets and develop a stable and reliable supply chain. My team collaborates with product planning, engineering and the operations team to deliver server products that delight our customers. Global Strategic Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Dupont, WA I own the global material strategy definition and execution in support of our Server business group. I lead a global team of experienced materials managers that drive the execution of the material strategy to ensure we meet our product cost targets and develop a stable and reliable supply chain. My team collaborates with product planning, engineering and the operations team to deliver server products that delight our customers. Supply Chain Management - Materials Program Manager Intel Corporation March 2014  –  August 2014  (6 months) Dupont, WA Drive component selection for new product introduction project. Engage with suppliers and product engineers to ensure we select components that are optimized for cost, delivery while minimizing risk to the overall supply chain. \n \nCurrently i am working on a project that is looking to significantly improve our supply chain efficiency and responsiveness. Supply Chain Management - Materials Program Manager Intel Corporation March 2014  –  August 2014  (6 months) Dupont, WA Drive component selection for new product introduction project. Engage with suppliers and product engineers to ensure we select components that are optimized for cost, delivery while minimizing risk to the overall supply chain. \n \nCurrently i am working on a project that is looking to significantly improve our supply chain efficiency and responsiveness. Program Manager - Reverse Logistics Intel Corporation January 2006  –  March 2014  (8 years 3 months) Dupont, WA Lead the strategy development, account management and worldwide product reverse logistics (returns supply chain) projects to support of our business unit partners’ strategic objectives. Lead cross functional/Geo teams to deliver complex projects on time, budget and scope. Well versed in Project Lifecycle management. Program Manager - Reverse Logistics Intel Corporation January 2006  –  March 2014  (8 years 3 months) Dupont, WA Lead the strategy development, account management and worldwide product reverse logistics (returns supply chain) projects to support of our business unit partners’ strategic objectives. Lead cross functional/Geo teams to deliver complex projects on time, budget and scope. Well versed in Project Lifecycle management. Supply Chain Management - Materials Program Manager Intel Corporation May 2000  –  January 2006  (5 years 9 months) Dupont, WA Drove and implemented the sourcing strategy for Server products. Single point of contact for design engineers and the outsource design manufacturing (ODM) partners to ensure a smooth transition from new product introduction phase to high volume production. Supply Chain Management - Materials Program Manager Intel Corporation May 2000  –  January 2006  (5 years 9 months) Dupont, WA Drove and implemented the sourcing strategy for Server products. Single point of contact for design engineers and the outsource design manufacturing (ODM) partners to ensure a smooth transition from new product introduction phase to high volume production. Project Controls Group Program Manager Intel Corporation 1998  –  2000  (2 years) Dupont, WA Supported design teams with effective project management practices and methodologies to ensure the success of their programs. Partnered with the design managers to develop project activities definitions, workflows and schedules to help them execute and control the project.  \n \nCollaborated with the teams on critical path and resource optimization analysis to identify opportunities for schedule improvement. Implemented a new project schedule infrastructure, including tools and indicator reporting. Project Controls Group Program Manager Intel Corporation 1998  –  2000  (2 years) Dupont, WA Supported design teams with effective project management practices and methodologies to ensure the success of their programs. Partnered with the design managers to develop project activities definitions, workflows and schedules to help them execute and control the project.  \n \nCollaborated with the teams on critical path and resource optimization analysis to identify opportunities for schedule improvement. Implemented a new project schedule infrastructure, including tools and indicator reporting. Commodity Specialist - Storage Intel Corporation 1996  –  1998  (2 years) Managed the hard disk drive commodity. Created and implemented strategic plans for supplier selection, contract negotiation and cost reduction programs. Commodity Specialist - Storage Intel Corporation 1996  –  1998  (2 years) Managed the hard disk drive commodity. Created and implemented strategic plans for supplier selection, contract negotiation and cost reduction programs. Customer and Materials Program Manager Intel Corporation February 1993  –  March 1996  (3 years 2 months) Managed the material sourcing strategy for HW programs. Worked with ODM and manufacturing partners on developing master schedule of the programs I supported. Customer and Materials Program Manager Intel Corporation February 1993  –  March 1996  (3 years 2 months) Managed the material sourcing strategy for HW programs. Worked with ODM and manufacturing partners on developing master schedule of the programs I supported. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Skills  Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Education Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. University of Puerto Rico BS,  Finance 1985  – 1988 Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. University of Puerto Rico BS,  Finance 1985  – 1988 University of Puerto Rico BS,  Finance 1985  – 1988 University of Puerto Rico BS,  Finance 1985  – 1988 ", "Skills Program Management Cross-functional Team... Agile Methodologies Agile Project Management Business Analysis Business Process... Change Management Integration Leadership MS Project Operations Management Organizational... PMO PMP Process Improvement Project Management SAP Semiconductors Visio Training Testing Supply Chain Management Software Project... Product Management Business Development Business Transformation Mentoring Strategic Planning Organizational Design Team Building Vendor Management IT Strategy SDLC Business Strategy Project Planning Business Intelligence Quality Assurance Lean Manufacturing Management Analysis Outsourcing Continuous Improvement Strategy Team Leadership Process Engineering Project Delivery Software Development Competitive Analysis Mobile Devices Management Consulting See 35+     See less Skills  Program Management Cross-functional Team... Agile Methodologies Agile Project Management Business Analysis Business Process... Change Management Integration Leadership MS Project Operations Management Organizational... PMO PMP Process Improvement Project Management SAP Semiconductors Visio Training Testing Supply Chain Management Software Project... Product Management Business Development Business Transformation Mentoring Strategic Planning Organizational Design Team Building Vendor Management IT Strategy SDLC Business Strategy Project Planning Business Intelligence Quality Assurance Lean Manufacturing Management Analysis Outsourcing Continuous Improvement Strategy Team Leadership Process Engineering Project Delivery Software Development Competitive Analysis Mobile Devices Management Consulting See 35+     See less Program Management Cross-functional Team... Agile Methodologies Agile Project Management Business Analysis Business Process... Change Management Integration Leadership MS Project Operations Management Organizational... PMO PMP Process Improvement Project Management SAP Semiconductors Visio Training Testing Supply Chain Management Software Project... Product Management Business Development Business Transformation Mentoring Strategic Planning Organizational Design Team Building Vendor Management IT Strategy SDLC Business Strategy Project Planning Business Intelligence Quality Assurance Lean Manufacturing Management Analysis Outsourcing Continuous Improvement Strategy Team Leadership Process Engineering Project Delivery Software Development Competitive Analysis Mobile Devices Management Consulting See 35+     See less Program Management Cross-functional Team... Agile Methodologies Agile Project Management Business Analysis Business Process... Change Management Integration Leadership MS Project Operations Management Organizational... PMO PMP Process Improvement Project Management SAP Semiconductors Visio Training Testing Supply Chain Management Software Project... Product Management Business Development Business Transformation Mentoring Strategic Planning Organizational Design Team Building Vendor Management IT Strategy SDLC Business Strategy Project Planning Business Intelligence Quality Assurance Lean Manufacturing Management Analysis Outsourcing Continuous Improvement Strategy Team Leadership Process Engineering Project Delivery Software Development Competitive Analysis Mobile Devices Management Consulting See 35+     See less ", "Skills Operational Excellence Program Management Cross-functional Team... Process Improvement Six Sigma Business Process... Project Management PMP Vendor Management Process Engineering Lean Manufacturing Operations Management Project Portfolio... Management Product Management SDLC Product Development Integration Leadership Change Management Manufacturing Testing Project Planning Business Process Business Strategy Strategy PMO Continuous Improvement Engineering Management MS Project Strategic Planning Quality Assurance Semiconductors Business Analysis Supply Chain Management Quality Management Team Leadership Supply Chain Analysis Software Project... Process Simulation Visio DMAIC Root Cause Analysis SPC Theory of Constraints Design of Experiments Value Stream Mapping Manufacturing Operations Electronics See 35+     See less Skills  Operational Excellence Program Management Cross-functional Team... Process Improvement Six Sigma Business Process... Project Management PMP Vendor Management Process Engineering Lean Manufacturing Operations Management Project Portfolio... Management Product Management SDLC Product Development Integration Leadership Change Management Manufacturing Testing Project Planning Business Process Business Strategy Strategy PMO Continuous Improvement Engineering Management MS Project Strategic Planning Quality Assurance Semiconductors Business Analysis Supply Chain Management Quality Management Team Leadership Supply Chain Analysis Software Project... Process Simulation Visio DMAIC Root Cause Analysis SPC Theory of Constraints Design of Experiments Value Stream Mapping Manufacturing Operations Electronics See 35+     See less Operational Excellence Program Management Cross-functional Team... Process Improvement Six Sigma Business Process... Project Management PMP Vendor Management Process Engineering Lean Manufacturing Operations Management Project Portfolio... Management Product Management SDLC Product Development Integration Leadership Change Management Manufacturing Testing Project Planning Business Process Business Strategy Strategy PMO Continuous Improvement Engineering Management MS Project Strategic Planning Quality Assurance Semiconductors Business Analysis Supply Chain Management Quality Management Team Leadership Supply Chain Analysis Software Project... Process Simulation Visio DMAIC Root Cause Analysis SPC Theory of Constraints Design of Experiments Value Stream Mapping Manufacturing Operations Electronics See 35+     See less Operational Excellence Program Management Cross-functional Team... Process Improvement Six Sigma Business Process... Project Management PMP Vendor Management Process Engineering Lean Manufacturing Operations Management Project Portfolio... Management Product Management SDLC Product Development Integration Leadership Change Management Manufacturing Testing Project Planning Business Process Business Strategy Strategy PMO Continuous Improvement Engineering Management MS Project Strategic Planning Quality Assurance Semiconductors Business Analysis Supply Chain Management Quality Management Team Leadership Supply Chain Analysis Software Project... Process Simulation Visio DMAIC Root Cause Analysis SPC Theory of Constraints Design of Experiments Value Stream Mapping Manufacturing Operations Electronics See 35+     See less ", "Skills Semiconductors Management Embedded Systems Project Planning Software Development Skills  Semiconductors Management Embedded Systems Project Planning Software Development Semiconductors Management Embedded Systems Project Planning Software Development Semiconductors Management Embedded Systems Project Planning Software Development ", "Languages Gujarati,  Gujarati,  Gujarati,  Skills Program Management Product Development Supplier Management Account Management Supply Chain Management Operations Management Business Process... Supply Management Negotiation Management Strategic Planning Project Planning Manufacturing Leadership Cross-functional Team... Skills  Program Management Product Development Supplier Management Account Management Supply Chain Management Operations Management Business Process... Supply Management Negotiation Management Strategic Planning Project Planning Manufacturing Leadership Cross-functional Team... Program Management Product Development Supplier Management Account Management Supply Chain Management Operations Management Business Process... Supply Management Negotiation Management Strategic Planning Project Planning Manufacturing Leadership Cross-functional Team... Program Management Product Development Supplier Management Account Management Supply Chain Management Operations Management Business Process... Supply Management Negotiation Management Strategic Planning Project Planning Manufacturing Leadership Cross-functional Team... ", "Experience Operations Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Technical Training Program Manager Intel Corporation July 2011  –  August 2014  (3 years 2 months) Folsom Responsible for developing & driving technical training strategy for graphics HW/SW engineers. New Hire Integration Program Manager Intel Corporation January 2011  –  July 2011  (7 months) Folsom, CA Responsible for creating and installing an integration program for ~1,000 new employees. Business Analyst Intel Corporation January 2006  –  December 2010  (5 years) Folsom Operations Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Operations Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Technical Training Program Manager Intel Corporation July 2011  –  August 2014  (3 years 2 months) Folsom Responsible for developing & driving technical training strategy for graphics HW/SW engineers. Technical Training Program Manager Intel Corporation July 2011  –  August 2014  (3 years 2 months) Folsom Responsible for developing & driving technical training strategy for graphics HW/SW engineers. New Hire Integration Program Manager Intel Corporation January 2011  –  July 2011  (7 months) Folsom, CA Responsible for creating and installing an integration program for ~1,000 new employees. New Hire Integration Program Manager Intel Corporation January 2011  –  July 2011  (7 months) Folsom, CA Responsible for creating and installing an integration program for ~1,000 new employees. Business Analyst Intel Corporation January 2006  –  December 2010  (5 years) Folsom Business Analyst Intel Corporation January 2006  –  December 2010  (5 years) Folsom Skills Program Management Process Improvement Analysis Data Analysis Business Analysis Problem Solving Excel Process Development Technical Training PowerPoint Word Metrics Customer Relations Skills  Program Management Process Improvement Analysis Data Analysis Business Analysis Problem Solving Excel Process Development Technical Training PowerPoint Word Metrics Customer Relations Program Management Process Improvement Analysis Data Analysis Business Analysis Problem Solving Excel Process Development Technical Training PowerPoint Word Metrics Customer Relations Program Management Process Improvement Analysis Data Analysis Business Analysis Problem Solving Excel Process Development Technical Training PowerPoint Word Metrics Customer Relations Education California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society ", "Skills Cross-functional Team... Strategic Planning New Business Development Project Management Business Relationship... Program Management Go-to-market Strategy Business Alliances Team Leadership Management SaaS Semiconductors Business Analysis Wireless Marketing Intel Start-ups Partner Management Product Marketing Strategic Partnerships Product Management Strategy Enterprise Software Competitive Analysis See 9+     See less Skills  Cross-functional Team... Strategic Planning New Business Development Project Management Business Relationship... Program Management Go-to-market Strategy Business Alliances Team Leadership Management SaaS Semiconductors Business Analysis Wireless Marketing Intel Start-ups Partner Management Product Marketing Strategic Partnerships Product Management Strategy Enterprise Software Competitive Analysis See 9+     See less Cross-functional Team... Strategic Planning New Business Development Project Management Business Relationship... Program Management Go-to-market Strategy Business Alliances Team Leadership Management SaaS Semiconductors Business Analysis Wireless Marketing Intel Start-ups Partner Management Product Marketing Strategic Partnerships Product Management Strategy Enterprise Software Competitive Analysis See 9+     See less Cross-functional Team... Strategic Planning New Business Development Project Management Business Relationship... Program Management Go-to-market Strategy Business Alliances Team Leadership Management SaaS Semiconductors Business Analysis Wireless Marketing Intel Start-ups Partner Management Product Marketing Strategic Partnerships Product Management Strategy Enterprise Software Competitive Analysis See 9+     See less ", "Skills Program Management Marketing Intel Advertising Management Product Management Event Planning Product Marketing Sales Market Research Marketing Communications Marketing Strategy Project Management Social Media Marketing Skills  Program Management Marketing Intel Advertising Management Product Management Event Planning Product Marketing Sales Market Research Marketing Communications Marketing Strategy Project Management Social Media Marketing Program Management Marketing Intel Advertising Management Product Management Event Planning Product Marketing Sales Market Research Marketing Communications Marketing Strategy Project Management Social Media Marketing Program Management Marketing Intel Advertising Management Product Management Event Planning Product Marketing Sales Market Research Marketing Communications Marketing Strategy Project Management Social Media Marketing ", "Skills Program Management Semiconductors Engineering Management Manufacturing Cross-functional Team... Operations Management Engineering Debugging Integration Leadership Testing Intel Management Electronics SoC Product Management IC See 2+     See less Skills  Program Management Semiconductors Engineering Management Manufacturing Cross-functional Team... Operations Management Engineering Debugging Integration Leadership Testing Intel Management Electronics SoC Product Management IC See 2+     See less Program Management Semiconductors Engineering Management Manufacturing Cross-functional Team... Operations Management Engineering Debugging Integration Leadership Testing Intel Management Electronics SoC Product Management IC See 2+     See less Program Management Semiconductors Engineering Management Manufacturing Cross-functional Team... Operations Management Engineering Debugging Integration Leadership Testing Intel Management Electronics SoC Product Management IC See 2+     See less ", "Summary - Recognized accomplished Leader backed by a proven track record in Program Execution over numerous geographical regions with 25+ years’ experience delivering on schedule within budget with World Class Safety performance. \n \n- Construction strategist skilled in collaboration with business partners in development of strategies to meet business objectives, setting and meeting aggressive cost targets, ability to select the right contractor partners, alignment of large teams to deliver results, and ensuring compliance with all internal & external legal and regulatory requirements.  \n \n- Proven mentor, coach, and leader of multiple projects overseeing programming management, design, factory construction, equipment installation, and facility startup. Ability to create an environment where both people internally and externally excel in \n \n• Leadership\t• Collaboration\t• Schedules/Budgets \n• Change Agent\t• People Development • Finance/Procurement \n• Project Management • Troubleshooting • Health/Safety Regulations \n \n“Leader in driving Radical Change throughout the organization resulting 30% Cost reduction ”  \n“Sets and Aligns Strategic direction across global organization” \n“Ensures Senior Management is aligned on Capital Strategies to meet corporate goals and objectives” Summary - Recognized accomplished Leader backed by a proven track record in Program Execution over numerous geographical regions with 25+ years’ experience delivering on schedule within budget with World Class Safety performance. \n \n- Construction strategist skilled in collaboration with business partners in development of strategies to meet business objectives, setting and meeting aggressive cost targets, ability to select the right contractor partners, alignment of large teams to deliver results, and ensuring compliance with all internal & external legal and regulatory requirements.  \n \n- Proven mentor, coach, and leader of multiple projects overseeing programming management, design, factory construction, equipment installation, and facility startup. Ability to create an environment where both people internally and externally excel in \n \n• Leadership\t• Collaboration\t• Schedules/Budgets \n• Change Agent\t• People Development • Finance/Procurement \n• Project Management • Troubleshooting • Health/Safety Regulations \n \n“Leader in driving Radical Change throughout the organization resulting 30% Cost reduction ”  \n“Sets and Aligns Strategic direction across global organization” \n“Ensures Senior Management is aligned on Capital Strategies to meet corporate goals and objectives” - Recognized accomplished Leader backed by a proven track record in Program Execution over numerous geographical regions with 25+ years’ experience delivering on schedule within budget with World Class Safety performance. \n \n- Construction strategist skilled in collaboration with business partners in development of strategies to meet business objectives, setting and meeting aggressive cost targets, ability to select the right contractor partners, alignment of large teams to deliver results, and ensuring compliance with all internal & external legal and regulatory requirements.  \n \n- Proven mentor, coach, and leader of multiple projects overseeing programming management, design, factory construction, equipment installation, and facility startup. Ability to create an environment where both people internally and externally excel in \n \n• Leadership\t• Collaboration\t• Schedules/Budgets \n• Change Agent\t• People Development • Finance/Procurement \n• Project Management • Troubleshooting • Health/Safety Regulations \n \n“Leader in driving Radical Change throughout the organization resulting 30% Cost reduction ”  \n“Sets and Aligns Strategic direction across global organization” \n“Ensures Senior Management is aligned on Capital Strategies to meet corporate goals and objectives” - Recognized accomplished Leader backed by a proven track record in Program Execution over numerous geographical regions with 25+ years’ experience delivering on schedule within budget with World Class Safety performance. \n \n- Construction strategist skilled in collaboration with business partners in development of strategies to meet business objectives, setting and meeting aggressive cost targets, ability to select the right contractor partners, alignment of large teams to deliver results, and ensuring compliance with all internal & external legal and regulatory requirements.  \n \n- Proven mentor, coach, and leader of multiple projects overseeing programming management, design, factory construction, equipment installation, and facility startup. Ability to create an environment where both people internally and externally excel in \n \n• Leadership\t• Collaboration\t• Schedules/Budgets \n• Change Agent\t• People Development • Finance/Procurement \n• Project Management • Troubleshooting • Health/Safety Regulations \n \n“Leader in driving Radical Change throughout the organization resulting 30% Cost reduction ”  \n“Sets and Aligns Strategic direction across global organization” \n“Ensures Senior Management is aligned on Capital Strategies to meet corporate goals and objectives” Experience Senior Director of Facilities Construction GLOBALFOUNDRIES February 2015  – Present (7 months) Malta, New York Accountable for implementation of strategies to ensure facilities are in place for efficient startup and ramp. Drive decisions to ensure program timelines and commitments are meet. Develop affordability targets and track budget expenditures to ensure overall corporate financial objects are met. Coach staff, prepare and complete action plans, and determine improvements and implement changes necessary to meet project objectives. Drive the strategic implementation of Lean Construction practices.  Corporate Construction Program Manager Intel Corporation January 2013  –  January 2015  (2 years 1 month) Chandler, AZ Accountable for implementation of global strategies to ensure facilities are in place for efficient startup and ramp. Plan and evaluate project execution strategies to meet overall program objectives. Drive decisions to ensure program timelines and commitments are meet. Develop affordability targets and track budget expenditures to ensure overall corporate financial objects are met. Coach staff, prepare and complete action plans, and determine improvements and implement changes necessary to meet project objectives. Drive the strategic implementation of Lean Construction practice across the globe.  \n \n• Strategies: Developed Supply Chain strategies ensuring Best in Class performance is in place globally and implementation strategies for conversion of existing facilities and construction of new High Volume Manufacturing Facilities. Benchmark industry peers to capture and implement industry Best Known Methods internally. \n \n• Leadership: Create shared vision across global organization with uncompromising integrity and empowering each individual project to act through clear, precise actions plans \n• Accomplishments:  \n• Alignment of Senior Management on overall Capital Strategies to meet corporate goals  \nand objectives \n \n• Implemented overall corporate capital affordability goals through alignment on  \nrequirements and options \n \n• Drove Lean Principles into the Construction process resulting in over 30% Cost  \nreduction, meeting 100% schedule commitments and overall quality improvement \n \n• Led the reorganization to position group to meet the Corporate Business requirements Fab 42 Program Manager Intel Corporation May 2011  –  December 2012  (1 year 8 months) Chandler, AZ Responsible for Intel’s 1st 14nm construction and startup. Overall responsibility for management of programming, design, factory construction, and wafer fabrication equipment installation and facilities startup. Accountable for over $2B budget. \n \n• Leadership: Established collaborative environment with factory management and contractor base to developed clear and detailed plans to drive $500M cost savings to meet overall corporate affordability goals. Drove implementation of 100% 3D design resulting in increased offsite fabrication and elimination of infield rework. \n• Accomplishments:  \n• Negotiated and finalized Master Development Agreement with local government and utilities.  \n• Implemented Strategic sourcing strategy to establish a competitive environment in constrained  \nmarket  \n• Reduced cost 20% while maintaining aggressive schedule and delivering world class safety  \nresults \n• Collaborative with Contracting Partners to establish Project Management Model resulting in <  \n12% Indirects \n• Drove overall Quality Program that set new benchmark for Corporation Oregon Site Manager of Construction Intel Corporation April 2009  –  April 2011  (2 years 1 month) Hillsboro, OR Managed Intel’s Technology Development construction and startup of Intel’s leading edge Wafer Fabrication Facilities. Met TD schedules and Facility Technology transfer to High Volume Manufacturing. Collaborated with Technology Development partners meeting their ever changing requirements while maintaining Schedule and Cost objectives. Corporate Services Construction Manager of Projects Intel Corporation October 2007  –  March 2009  (1 year 6 months) Leadership and direction of a 500+ organization. Primary responsibilities include design, capital procurement, construction and startup of major factory retrofits and process tool installations across Arizona, California, New Mexico, Oregon, Israel and Ireland. AZ Program Manager Intel Corporation January 2003  –  September 2007  (4 years 9 months) Chandler, AZ Oversaw programming management, design, factory construction, and wafer fabrication equipment installation and facilities startup. Actively managed daily construction and integration with Factory Management enabling a 2 month pull-in of factory output. Drove cost reduction efforts in both customer requirements and indirect structure resulting in Best in Class performance. Instilled an Injury Free Culture across entire program resulting in World Class Safety Performance. Corporate Construction Program Manager Intel Corporation October 1999  –  December 2002  (3 years 3 months) Chandler, AZ Leadership of Oversaw scope, scheduling, and budget for all construction activities in AZ, NM, TX and Costa Rico. Facility Construction Project Manager Intel Corporation October 1988  –  September 1999  (11 years) Chandler, AZ Progressive Leadership for both new construction and retrofit activities in AZ, CA, IR, OR and TX. Senior Director of Facilities Construction GLOBALFOUNDRIES February 2015  – Present (7 months) Malta, New York Accountable for implementation of strategies to ensure facilities are in place for efficient startup and ramp. Drive decisions to ensure program timelines and commitments are meet. Develop affordability targets and track budget expenditures to ensure overall corporate financial objects are met. Coach staff, prepare and complete action plans, and determine improvements and implement changes necessary to meet project objectives. Drive the strategic implementation of Lean Construction practices.  Senior Director of Facilities Construction GLOBALFOUNDRIES February 2015  – Present (7 months) Malta, New York Accountable for implementation of strategies to ensure facilities are in place for efficient startup and ramp. Drive decisions to ensure program timelines and commitments are meet. Develop affordability targets and track budget expenditures to ensure overall corporate financial objects are met. Coach staff, prepare and complete action plans, and determine improvements and implement changes necessary to meet project objectives. Drive the strategic implementation of Lean Construction practices.  Corporate Construction Program Manager Intel Corporation January 2013  –  January 2015  (2 years 1 month) Chandler, AZ Accountable for implementation of global strategies to ensure facilities are in place for efficient startup and ramp. Plan and evaluate project execution strategies to meet overall program objectives. Drive decisions to ensure program timelines and commitments are meet. Develop affordability targets and track budget expenditures to ensure overall corporate financial objects are met. Coach staff, prepare and complete action plans, and determine improvements and implement changes necessary to meet project objectives. Drive the strategic implementation of Lean Construction practice across the globe.  \n \n• Strategies: Developed Supply Chain strategies ensuring Best in Class performance is in place globally and implementation strategies for conversion of existing facilities and construction of new High Volume Manufacturing Facilities. Benchmark industry peers to capture and implement industry Best Known Methods internally. \n \n• Leadership: Create shared vision across global organization with uncompromising integrity and empowering each individual project to act through clear, precise actions plans \n• Accomplishments:  \n• Alignment of Senior Management on overall Capital Strategies to meet corporate goals  \nand objectives \n \n• Implemented overall corporate capital affordability goals through alignment on  \nrequirements and options \n \n• Drove Lean Principles into the Construction process resulting in over 30% Cost  \nreduction, meeting 100% schedule commitments and overall quality improvement \n \n• Led the reorganization to position group to meet the Corporate Business requirements Corporate Construction Program Manager Intel Corporation January 2013  –  January 2015  (2 years 1 month) Chandler, AZ Accountable for implementation of global strategies to ensure facilities are in place for efficient startup and ramp. Plan and evaluate project execution strategies to meet overall program objectives. Drive decisions to ensure program timelines and commitments are meet. Develop affordability targets and track budget expenditures to ensure overall corporate financial objects are met. Coach staff, prepare and complete action plans, and determine improvements and implement changes necessary to meet project objectives. Drive the strategic implementation of Lean Construction practice across the globe.  \n \n• Strategies: Developed Supply Chain strategies ensuring Best in Class performance is in place globally and implementation strategies for conversion of existing facilities and construction of new High Volume Manufacturing Facilities. Benchmark industry peers to capture and implement industry Best Known Methods internally. \n \n• Leadership: Create shared vision across global organization with uncompromising integrity and empowering each individual project to act through clear, precise actions plans \n• Accomplishments:  \n• Alignment of Senior Management on overall Capital Strategies to meet corporate goals  \nand objectives \n \n• Implemented overall corporate capital affordability goals through alignment on  \nrequirements and options \n \n• Drove Lean Principles into the Construction process resulting in over 30% Cost  \nreduction, meeting 100% schedule commitments and overall quality improvement \n \n• Led the reorganization to position group to meet the Corporate Business requirements Fab 42 Program Manager Intel Corporation May 2011  –  December 2012  (1 year 8 months) Chandler, AZ Responsible for Intel’s 1st 14nm construction and startup. Overall responsibility for management of programming, design, factory construction, and wafer fabrication equipment installation and facilities startup. Accountable for over $2B budget. \n \n• Leadership: Established collaborative environment with factory management and contractor base to developed clear and detailed plans to drive $500M cost savings to meet overall corporate affordability goals. Drove implementation of 100% 3D design resulting in increased offsite fabrication and elimination of infield rework. \n• Accomplishments:  \n• Negotiated and finalized Master Development Agreement with local government and utilities.  \n• Implemented Strategic sourcing strategy to establish a competitive environment in constrained  \nmarket  \n• Reduced cost 20% while maintaining aggressive schedule and delivering world class safety  \nresults \n• Collaborative with Contracting Partners to establish Project Management Model resulting in <  \n12% Indirects \n• Drove overall Quality Program that set new benchmark for Corporation Fab 42 Program Manager Intel Corporation May 2011  –  December 2012  (1 year 8 months) Chandler, AZ Responsible for Intel’s 1st 14nm construction and startup. Overall responsibility for management of programming, design, factory construction, and wafer fabrication equipment installation and facilities startup. Accountable for over $2B budget. \n \n• Leadership: Established collaborative environment with factory management and contractor base to developed clear and detailed plans to drive $500M cost savings to meet overall corporate affordability goals. Drove implementation of 100% 3D design resulting in increased offsite fabrication and elimination of infield rework. \n• Accomplishments:  \n• Negotiated and finalized Master Development Agreement with local government and utilities.  \n• Implemented Strategic sourcing strategy to establish a competitive environment in constrained  \nmarket  \n• Reduced cost 20% while maintaining aggressive schedule and delivering world class safety  \nresults \n• Collaborative with Contracting Partners to establish Project Management Model resulting in <  \n12% Indirects \n• Drove overall Quality Program that set new benchmark for Corporation Oregon Site Manager of Construction Intel Corporation April 2009  –  April 2011  (2 years 1 month) Hillsboro, OR Managed Intel’s Technology Development construction and startup of Intel’s leading edge Wafer Fabrication Facilities. Met TD schedules and Facility Technology transfer to High Volume Manufacturing. Collaborated with Technology Development partners meeting their ever changing requirements while maintaining Schedule and Cost objectives. Oregon Site Manager of Construction Intel Corporation April 2009  –  April 2011  (2 years 1 month) Hillsboro, OR Managed Intel’s Technology Development construction and startup of Intel’s leading edge Wafer Fabrication Facilities. Met TD schedules and Facility Technology transfer to High Volume Manufacturing. Collaborated with Technology Development partners meeting their ever changing requirements while maintaining Schedule and Cost objectives. Corporate Services Construction Manager of Projects Intel Corporation October 2007  –  March 2009  (1 year 6 months) Leadership and direction of a 500+ organization. Primary responsibilities include design, capital procurement, construction and startup of major factory retrofits and process tool installations across Arizona, California, New Mexico, Oregon, Israel and Ireland. Corporate Services Construction Manager of Projects Intel Corporation October 2007  –  March 2009  (1 year 6 months) Leadership and direction of a 500+ organization. Primary responsibilities include design, capital procurement, construction and startup of major factory retrofits and process tool installations across Arizona, California, New Mexico, Oregon, Israel and Ireland. AZ Program Manager Intel Corporation January 2003  –  September 2007  (4 years 9 months) Chandler, AZ Oversaw programming management, design, factory construction, and wafer fabrication equipment installation and facilities startup. Actively managed daily construction and integration with Factory Management enabling a 2 month pull-in of factory output. Drove cost reduction efforts in both customer requirements and indirect structure resulting in Best in Class performance. Instilled an Injury Free Culture across entire program resulting in World Class Safety Performance. AZ Program Manager Intel Corporation January 2003  –  September 2007  (4 years 9 months) Chandler, AZ Oversaw programming management, design, factory construction, and wafer fabrication equipment installation and facilities startup. Actively managed daily construction and integration with Factory Management enabling a 2 month pull-in of factory output. Drove cost reduction efforts in both customer requirements and indirect structure resulting in Best in Class performance. Instilled an Injury Free Culture across entire program resulting in World Class Safety Performance. Corporate Construction Program Manager Intel Corporation October 1999  –  December 2002  (3 years 3 months) Chandler, AZ Leadership of Oversaw scope, scheduling, and budget for all construction activities in AZ, NM, TX and Costa Rico. Corporate Construction Program Manager Intel Corporation October 1999  –  December 2002  (3 years 3 months) Chandler, AZ Leadership of Oversaw scope, scheduling, and budget for all construction activities in AZ, NM, TX and Costa Rico. Facility Construction Project Manager Intel Corporation October 1988  –  September 1999  (11 years) Chandler, AZ Progressive Leadership for both new construction and retrofit activities in AZ, CA, IR, OR and TX. Facility Construction Project Manager Intel Corporation October 1988  –  September 1999  (11 years) Chandler, AZ Progressive Leadership for both new construction and retrofit activities in AZ, CA, IR, OR and TX. Skills Manufacturing Construction Cross-functional Team... Program Management Procurement Management Leadership Construction Management Project Management Process Engineering Semiconductors Engineering Facilities Management Start-ups Budgets Contract Management MS Project Engineering Management Six Sigma Process Improvement Project Planning Contract Negotiation Strategic Planning Integration Team Building Change Management Team Leadership Semiconductor Industry Strategic Sourcing Supply Chain Mentoring See 16+     See less Skills  Manufacturing Construction Cross-functional Team... Program Management Procurement Management Leadership Construction Management Project Management Process Engineering Semiconductors Engineering Facilities Management Start-ups Budgets Contract Management MS Project Engineering Management Six Sigma Process Improvement Project Planning Contract Negotiation Strategic Planning Integration Team Building Change Management Team Leadership Semiconductor Industry Strategic Sourcing Supply Chain Mentoring See 16+     See less Manufacturing Construction Cross-functional Team... Program Management Procurement Management Leadership Construction Management Project Management Process Engineering Semiconductors Engineering Facilities Management Start-ups Budgets Contract Management MS Project Engineering Management Six Sigma Process Improvement Project Planning Contract Negotiation Strategic Planning Integration Team Building Change Management Team Leadership Semiconductor Industry Strategic Sourcing Supply Chain Mentoring See 16+     See less Manufacturing Construction Cross-functional Team... Program Management Procurement Management Leadership Construction Management Project Management Process Engineering Semiconductors Engineering Facilities Management Start-ups Budgets Contract Management MS Project Engineering Management Six Sigma Process Improvement Project Planning Contract Negotiation Strategic Planning Integration Team Building Change Management Team Leadership Semiconductor Industry Strategic Sourcing Supply Chain Mentoring See 16+     See less Education Iowa State University BSIE,  Industrial Engineering 1980  – 1983 Bachelor of Science: Industrial Engineering The University of Texas at Austin - The Red McCombs School of Business CII Executive Leadership Program Iowa State University BSIE,  Industrial Engineering 1980  – 1983 Bachelor of Science: Industrial Engineering Iowa State University BSIE,  Industrial Engineering 1980  – 1983 Bachelor of Science: Industrial Engineering Iowa State University BSIE,  Industrial Engineering 1980  – 1983 Bachelor of Science: Industrial Engineering The University of Texas at Austin - The Red McCombs School of Business CII Executive Leadership Program The University of Texas at Austin - The Red McCombs School of Business CII Executive Leadership Program The University of Texas at Austin - The Red McCombs School of Business CII Executive Leadership Program ", "Summary Executive Summary:  \n•\tProgram management of cross functional teams (HW, SW, Marketing, Manufacturing) \n•\tExperience with cross cultural teams including one year assignment in China \n•\tStrong customer communication and negotiation experience \n•\tDisciplined risk assessment process to enable informed business decisions.  \n \n \nSpecialties: Program Management Summary Executive Summary:  \n•\tProgram management of cross functional teams (HW, SW, Marketing, Manufacturing) \n•\tExperience with cross cultural teams including one year assignment in China \n•\tStrong customer communication and negotiation experience \n•\tDisciplined risk assessment process to enable informed business decisions.  \n \n \nSpecialties: Program Management Executive Summary:  \n•\tProgram management of cross functional teams (HW, SW, Marketing, Manufacturing) \n•\tExperience with cross cultural teams including one year assignment in China \n•\tStrong customer communication and negotiation experience \n•\tDisciplined risk assessment process to enable informed business decisions.  \n \n \nSpecialties: Program Management Executive Summary:  \n•\tProgram management of cross functional teams (HW, SW, Marketing, Manufacturing) \n•\tExperience with cross cultural teams including one year assignment in China \n•\tStrong customer communication and negotiation experience \n•\tDisciplined risk assessment process to enable informed business decisions.  \n \n \nSpecialties: Program Management Experience Real Estate Broker Keller Williams Realty Sunset Corridor January 2012  – Present (3 years 8 months) Beaverton Oregon Residential Real Estate Senior Program Manager Intel Corporation April 2007  – Present (8 years 5 months) 2007- 2012 – Senior Program Manager \nManufacturing Program Manager Responsibilities: Responsible for both Validation Program Management and Engineering Program Management for the highly visible Thurley TTM launch. This required an in depth knowledge of all product development areas, including both HW and SW development, tracking of development issues, and driving technical issues to closure. Helped in mentoring PMs in Asia as well as providing insight and training to US team members about the nuances and challenges of working in and with Asian cultures. Expat Manufacturing Program Manager Intel Corporation September 2006  –  September 2007  (1 year 1 month) Intel Shanghai Relocated to Shanghai, China, in order to work closer with the factory to develop better NPI capabilities for both EPSD and ODMs. Mentored both Material and Manufacturing Program Managers, helping them to develop PM skillsets along with supplier coordination and negotiations. Continued her Manufacturing Program Manager responsibilities for Server NPI products. Additionally, was responsible for translating and interpreting US/PRC activities for the OPS organization with her unique view of both cultures. Manufacturing Program Manager Intel Corporation July 2005  –  September 2006  (1 year 3 months) Hillsboro Oregon Responsible for developing and launching New Product Introduction (NPI) server programs into Far East factories. This included baseboard, peripheral, and chassis development, requiring factory planning, scheduling, and execution, including initial production ramp and supply line development. Also responsible for supplier management and coordination of site transfers/new supplier start-up activities. This required travel to China in order to develop a better understanding of the factories as well as build up working relationships with suppliers. Was the point of contact for management on manufacturing readiness, as well as Intel support teams worldwide as they interface with EPSD activities. Customer Program Manager/Manufacturing Program Manager Intel Corporation April 1997  –  June 2005  (8 years 3 months) Hillsboro, Oregon Responsible for soliciting and coordinating internal and external customer demand for new networking products and communicating schedules, delivery, and Product Change Notifications to customers. Managed allocation of constrained materials and products, focusing on customer needs and cost/time-to-market tradeoffs. Created build and delivery plans used for directing manufacturing activities, materials procurement, and product cost reduction, with full ownership of manufacturing readiness. Responsible for reporting on cost, schedule, and program risk to upper level management, driving key decision approvals through the Product Life Cycle process. Managed cross-functional teams across both business unit and manufacturing personnel, while influencing key customer decisions and building long term customer relationships. Managed multi-site manufacturing pilots and production builds across multiple countries and geographies. Software Program Manager Intel Corporation January 1996  –  April 1997  (1 year 4 months) Hillsboro Oregon Managed multiple software project manufacturing schedules, responsible for logistical issues surrounding \nthe creation of retail boxed software requiring the coordination of multiple vendors to create end user \nsoftware products. Key decision maker for product stock rotation issues involving software bugs and \nmanufacturing issues. Managed forecasts for new product introductions and managed multi-site \ncommunication across multiple manufacturers and distributors. Senior Administrative Assistant Intel Corporation December 1994  –  December 1995  (1 year 1 month) Supported multiple senior managers, performing administrative and project-related duties in support of the \nLAN Desk Manager Division. Responsible for coordinating calendars, managing multi-site meeting \n \n \n \nR.Hall Resume Page 1 \nlogistics across multiple time zones, organizing travel arrangements, and performing ad-hoc project support. \nManaged documents and was responsible for office supply maintenance. Customer Support representative Intel Corporation February 1992  –  December 1994  (2 years 11 months) First line customer support representative for the Personal Computer Enhancement Division, responsible for \nanalyzing and solving customer issues for Ethernet and Token Ring products. Duties included assisting and \ntroubleshooting over the phone, customer data collection, and issue routing to second line support. Administrative Assistant Intel Corporation April 1991  –  February 1992  (11 months) Supported multiple Product Marketing Engineers and the Senior Administrative Assistant for the Personal \nComputer Enhancement Division, coordinating travel arrangements, calendars, managed documents, office \nsupply maintenance, and ad-hoc project support. Additional duties included managing multi-site meeting \nlogistics across multiple time zones, and performing other administrative and project-related duties. Real Estate Broker Keller Williams Realty Sunset Corridor January 2012  – Present (3 years 8 months) Beaverton Oregon Residential Real Estate Real Estate Broker Keller Williams Realty Sunset Corridor January 2012  – Present (3 years 8 months) Beaverton Oregon Residential Real Estate Senior Program Manager Intel Corporation April 2007  – Present (8 years 5 months) 2007- 2012 – Senior Program Manager \nManufacturing Program Manager Responsibilities: Responsible for both Validation Program Management and Engineering Program Management for the highly visible Thurley TTM launch. This required an in depth knowledge of all product development areas, including both HW and SW development, tracking of development issues, and driving technical issues to closure. Helped in mentoring PMs in Asia as well as providing insight and training to US team members about the nuances and challenges of working in and with Asian cultures. Senior Program Manager Intel Corporation April 2007  – Present (8 years 5 months) 2007- 2012 – Senior Program Manager \nManufacturing Program Manager Responsibilities: Responsible for both Validation Program Management and Engineering Program Management for the highly visible Thurley TTM launch. This required an in depth knowledge of all product development areas, including both HW and SW development, tracking of development issues, and driving technical issues to closure. Helped in mentoring PMs in Asia as well as providing insight and training to US team members about the nuances and challenges of working in and with Asian cultures. Expat Manufacturing Program Manager Intel Corporation September 2006  –  September 2007  (1 year 1 month) Intel Shanghai Relocated to Shanghai, China, in order to work closer with the factory to develop better NPI capabilities for both EPSD and ODMs. Mentored both Material and Manufacturing Program Managers, helping them to develop PM skillsets along with supplier coordination and negotiations. Continued her Manufacturing Program Manager responsibilities for Server NPI products. Additionally, was responsible for translating and interpreting US/PRC activities for the OPS organization with her unique view of both cultures. Expat Manufacturing Program Manager Intel Corporation September 2006  –  September 2007  (1 year 1 month) Intel Shanghai Relocated to Shanghai, China, in order to work closer with the factory to develop better NPI capabilities for both EPSD and ODMs. Mentored both Material and Manufacturing Program Managers, helping them to develop PM skillsets along with supplier coordination and negotiations. Continued her Manufacturing Program Manager responsibilities for Server NPI products. Additionally, was responsible for translating and interpreting US/PRC activities for the OPS organization with her unique view of both cultures. Manufacturing Program Manager Intel Corporation July 2005  –  September 2006  (1 year 3 months) Hillsboro Oregon Responsible for developing and launching New Product Introduction (NPI) server programs into Far East factories. This included baseboard, peripheral, and chassis development, requiring factory planning, scheduling, and execution, including initial production ramp and supply line development. Also responsible for supplier management and coordination of site transfers/new supplier start-up activities. This required travel to China in order to develop a better understanding of the factories as well as build up working relationships with suppliers. Was the point of contact for management on manufacturing readiness, as well as Intel support teams worldwide as they interface with EPSD activities. Manufacturing Program Manager Intel Corporation July 2005  –  September 2006  (1 year 3 months) Hillsboro Oregon Responsible for developing and launching New Product Introduction (NPI) server programs into Far East factories. This included baseboard, peripheral, and chassis development, requiring factory planning, scheduling, and execution, including initial production ramp and supply line development. Also responsible for supplier management and coordination of site transfers/new supplier start-up activities. This required travel to China in order to develop a better understanding of the factories as well as build up working relationships with suppliers. Was the point of contact for management on manufacturing readiness, as well as Intel support teams worldwide as they interface with EPSD activities. Customer Program Manager/Manufacturing Program Manager Intel Corporation April 1997  –  June 2005  (8 years 3 months) Hillsboro, Oregon Responsible for soliciting and coordinating internal and external customer demand for new networking products and communicating schedules, delivery, and Product Change Notifications to customers. Managed allocation of constrained materials and products, focusing on customer needs and cost/time-to-market tradeoffs. Created build and delivery plans used for directing manufacturing activities, materials procurement, and product cost reduction, with full ownership of manufacturing readiness. Responsible for reporting on cost, schedule, and program risk to upper level management, driving key decision approvals through the Product Life Cycle process. Managed cross-functional teams across both business unit and manufacturing personnel, while influencing key customer decisions and building long term customer relationships. Managed multi-site manufacturing pilots and production builds across multiple countries and geographies. Customer Program Manager/Manufacturing Program Manager Intel Corporation April 1997  –  June 2005  (8 years 3 months) Hillsboro, Oregon Responsible for soliciting and coordinating internal and external customer demand for new networking products and communicating schedules, delivery, and Product Change Notifications to customers. Managed allocation of constrained materials and products, focusing on customer needs and cost/time-to-market tradeoffs. Created build and delivery plans used for directing manufacturing activities, materials procurement, and product cost reduction, with full ownership of manufacturing readiness. Responsible for reporting on cost, schedule, and program risk to upper level management, driving key decision approvals through the Product Life Cycle process. Managed cross-functional teams across both business unit and manufacturing personnel, while influencing key customer decisions and building long term customer relationships. Managed multi-site manufacturing pilots and production builds across multiple countries and geographies. Software Program Manager Intel Corporation January 1996  –  April 1997  (1 year 4 months) Hillsboro Oregon Managed multiple software project manufacturing schedules, responsible for logistical issues surrounding \nthe creation of retail boxed software requiring the coordination of multiple vendors to create end user \nsoftware products. Key decision maker for product stock rotation issues involving software bugs and \nmanufacturing issues. Managed forecasts for new product introductions and managed multi-site \ncommunication across multiple manufacturers and distributors. Software Program Manager Intel Corporation January 1996  –  April 1997  (1 year 4 months) Hillsboro Oregon Managed multiple software project manufacturing schedules, responsible for logistical issues surrounding \nthe creation of retail boxed software requiring the coordination of multiple vendors to create end user \nsoftware products. Key decision maker for product stock rotation issues involving software bugs and \nmanufacturing issues. Managed forecasts for new product introductions and managed multi-site \ncommunication across multiple manufacturers and distributors. Senior Administrative Assistant Intel Corporation December 1994  –  December 1995  (1 year 1 month) Supported multiple senior managers, performing administrative and project-related duties in support of the \nLAN Desk Manager Division. Responsible for coordinating calendars, managing multi-site meeting \n \n \n \nR.Hall Resume Page 1 \nlogistics across multiple time zones, organizing travel arrangements, and performing ad-hoc project support. \nManaged documents and was responsible for office supply maintenance. Senior Administrative Assistant Intel Corporation December 1994  –  December 1995  (1 year 1 month) Supported multiple senior managers, performing administrative and project-related duties in support of the \nLAN Desk Manager Division. Responsible for coordinating calendars, managing multi-site meeting \n \n \n \nR.Hall Resume Page 1 \nlogistics across multiple time zones, organizing travel arrangements, and performing ad-hoc project support. \nManaged documents and was responsible for office supply maintenance. Customer Support representative Intel Corporation February 1992  –  December 1994  (2 years 11 months) First line customer support representative for the Personal Computer Enhancement Division, responsible for \nanalyzing and solving customer issues for Ethernet and Token Ring products. Duties included assisting and \ntroubleshooting over the phone, customer data collection, and issue routing to second line support. Customer Support representative Intel Corporation February 1992  –  December 1994  (2 years 11 months) First line customer support representative for the Personal Computer Enhancement Division, responsible for \nanalyzing and solving customer issues for Ethernet and Token Ring products. Duties included assisting and \ntroubleshooting over the phone, customer data collection, and issue routing to second line support. Administrative Assistant Intel Corporation April 1991  –  February 1992  (11 months) Supported multiple Product Marketing Engineers and the Senior Administrative Assistant for the Personal \nComputer Enhancement Division, coordinating travel arrangements, calendars, managed documents, office \nsupply maintenance, and ad-hoc project support. Additional duties included managing multi-site meeting \nlogistics across multiple time zones, and performing other administrative and project-related duties. Administrative Assistant Intel Corporation April 1991  –  February 1992  (11 months) Supported multiple Product Marketing Engineers and the Senior Administrative Assistant for the Personal \nComputer Enhancement Division, coordinating travel arrangements, calendars, managed documents, office \nsupply maintenance, and ad-hoc project support. Additional duties included managing multi-site meeting \nlogistics across multiple time zones, and performing other administrative and project-related duties. Skills Program Management Team Building Cross-functional Team... Product Development Project Management Real Estate Manufacturing Supply Management Management Product Marketing Start-ups Analysis MS Project Leadership Team Leadership CRM Negotiation Forecasting Marketing Procurement Training See 6+     See less Skills  Program Management Team Building Cross-functional Team... Product Development Project Management Real Estate Manufacturing Supply Management Management Product Marketing Start-ups Analysis MS Project Leadership Team Leadership CRM Negotiation Forecasting Marketing Procurement Training See 6+     See less Program Management Team Building Cross-functional Team... Product Development Project Management Real Estate Manufacturing Supply Management Management Product Marketing Start-ups Analysis MS Project Leadership Team Leadership CRM Negotiation Forecasting Marketing Procurement Training See 6+     See less Program Management Team Building Cross-functional Team... Product Development Project Management Real Estate Manufacturing Supply Management Management Product Marketing Start-ups Analysis MS Project Leadership Team Leadership CRM Negotiation Forecasting Marketing Procurement Training See 6+     See less ", "Summary Looking for a role to solve business issues in a dynamic, fast paced environment, for managers/organizations that want to grow their people. Specialties:Hardware manufacturing, consulting, building renovation design/construction facilitation Summary Looking for a role to solve business issues in a dynamic, fast paced environment, for managers/organizations that want to grow their people. Specialties:Hardware manufacturing, consulting, building renovation design/construction facilitation Looking for a role to solve business issues in a dynamic, fast paced environment, for managers/organizations that want to grow their people. Specialties:Hardware manufacturing, consulting, building renovation design/construction facilitation Looking for a role to solve business issues in a dynamic, fast paced environment, for managers/organizations that want to grow their people. Specialties:Hardware manufacturing, consulting, building renovation design/construction facilitation Experience Corporate Services Construction Program Manager Intel Corporation August 2013  – Present (2 years 1 month) HIllsboro, Oregon Program Manage building renovation design, customer relations, and construction. Act as liason between Architecture/General Contractor and Intel. Drove design construction of several interior renovations. Enabled the operational startup of the first general purpose/manufacturing building in the US for several years. Corporate Services Small Project General Construction and Controls Manager Intel Corporation March 2012  –  August 2013  (1 year 6 months) Penang, Malaysia Expatriate assignment to Penang Malaysia. Reestablished a culture of good financial and operational controls over the small projects general construction team. Lead the team of project managers through this cultural shift and working with the new, interim general contractor. Drove the selection of the new general contractor, establishing a new model combining scope of services to include progressive build, resulting in the lowest cost solution. Corporate Services Project Manager Intel Corporation November 2008  –  March 2012  (3 years 5 months) Hillsboro, OR Learned the new language of construction to apply my well established program management skills. Drove renovation of 500ksqft of office buildings, as well as cafes, and fitness centers. Negotiated the selection of a local banker to provide on site services, driving construction and service startup. MWG Board Operations Program Manager Intel Corporation June 2007  –  November 2008  (1 year 6 months) Hillsboro, OR •\tDrove the supply chain adaptions for wifi NPI products; facilitated proto-type builds; transferred products into high volume manufacture at ODM(s) \n•\tSilicon Sales enablement for greenfield/non-Centrino derivative business \n•\tNew ODM engagement for Centrino and non-Centrino business \n•\tProcess-orient the Board Operations Program Manager team \n MWG Product Sustaining Team Manager Intel Corporation February 2006  –  June 2007  (1 year 5 months) Kulim, Malaysia Expatriate Assignment to Malaysia.  \n•\tTransfer product sustaining responsibilities from Oregon to Malaysia, by establishing the team and setting up communication conduits to Israel engineering team;  \n•\tReorient the team’s thinking from “factory” focus into “business units” focus \n•\tDrive resolution to product ad hoc quality, availability, and product change issues \n•\tInitiated several process improvements in regulatory and PDT Operations to achieve OpEx \n•\tEstablish sustaining hardware engineering model, to include three Intel sites and ODM support of three sustaining product families \n MWG Sustaining Product and Regulatory Program Manager Intel Corporation May 2005  –  February 2006  (10 months) Hillsboro, OR •\tDrove all sustaining cost, quality and delivery aspects of the MWG products across a multi-function, multi-site organization. \n•\tLearned the “language” of wifi and related worldwide regulatory engagement. \n LAD Product Marketing Engineer Intel Corporation October 2003  –  May 2005  (1 year 8 months) Hillsboro, OR •\tForecasting and pricing of desktop, wired mobile, and 10GbE adapters. \n•\tPartnered with geography sales to establish the right product mix, pricing, and overall forecast \n•\tSupported all product quality and delivery issues, as the customer representative. \n•\tProduct launch program manager & World-wide marketing programs support \nSupported trade shows and customer visits. \n LAD Manufacturing Operations Manager Intel Corporation November 1997  –  October 2003  (6 years) Hillsboro, OR •\tPNG Product Security Initiative Leader driving features development and implementation, industry summit, indicator development, coordination with Intel security and private investigators. \n•\tManufacturing Integrator to the Xircom acquisition integration \n•\tProgram Managed the Brazil ROI & factory start-up; China subcon factory decision and startup  \n•\tEstablished supply chain for Brazil and China \n•\tManufacturing operations lead in the organizations transformation into PLC usage \n•\tManufacturing program managed the introduction of several LAD adapter products •\tIntroduced the first LAD NPI into iPR and Solectron simultaneously to achieve 300ku+ in the first month of production \n•\tProvided OEM PM Manager coverage for extended sabbatical leave; this team supported all major desktop OEM’s to Intel (e.g. Dell, Fujitsu, Compaq, HP) \n•\tProvided Operations support to customer visits, to represent the supply chain imperatives of cost, quality, and delivery \n•\tFacilitated numerous product/process quality issue resolutions, involving customer returns, rework, and supply chain balancing between factories. \n•\tSupported the product line RMA process, eliminating the use of R-sku’s through ROI analysis \n Senior Consultant Deloitte & Touche May 1995  –  November 1997  (2 years 7 months) San Francisco, CA & Portland OR •\tLed information systems audits in support of annual financial audits  \n•\tPrepared and presented control systems recommendations  \n•\tParticipated in Disaster Recovery assessment/recommendation consulting projects \n Corporate Services Construction Program Manager Intel Corporation August 2013  – Present (2 years 1 month) HIllsboro, Oregon Program Manage building renovation design, customer relations, and construction. Act as liason between Architecture/General Contractor and Intel. Drove design construction of several interior renovations. Enabled the operational startup of the first general purpose/manufacturing building in the US for several years. Corporate Services Construction Program Manager Intel Corporation August 2013  – Present (2 years 1 month) HIllsboro, Oregon Program Manage building renovation design, customer relations, and construction. Act as liason between Architecture/General Contractor and Intel. Drove design construction of several interior renovations. Enabled the operational startup of the first general purpose/manufacturing building in the US for several years. Corporate Services Small Project General Construction and Controls Manager Intel Corporation March 2012  –  August 2013  (1 year 6 months) Penang, Malaysia Expatriate assignment to Penang Malaysia. Reestablished a culture of good financial and operational controls over the small projects general construction team. Lead the team of project managers through this cultural shift and working with the new, interim general contractor. Drove the selection of the new general contractor, establishing a new model combining scope of services to include progressive build, resulting in the lowest cost solution. Corporate Services Small Project General Construction and Controls Manager Intel Corporation March 2012  –  August 2013  (1 year 6 months) Penang, Malaysia Expatriate assignment to Penang Malaysia. Reestablished a culture of good financial and operational controls over the small projects general construction team. Lead the team of project managers through this cultural shift and working with the new, interim general contractor. Drove the selection of the new general contractor, establishing a new model combining scope of services to include progressive build, resulting in the lowest cost solution. Corporate Services Project Manager Intel Corporation November 2008  –  March 2012  (3 years 5 months) Hillsboro, OR Learned the new language of construction to apply my well established program management skills. Drove renovation of 500ksqft of office buildings, as well as cafes, and fitness centers. Negotiated the selection of a local banker to provide on site services, driving construction and service startup. Corporate Services Project Manager Intel Corporation November 2008  –  March 2012  (3 years 5 months) Hillsboro, OR Learned the new language of construction to apply my well established program management skills. Drove renovation of 500ksqft of office buildings, as well as cafes, and fitness centers. Negotiated the selection of a local banker to provide on site services, driving construction and service startup. MWG Board Operations Program Manager Intel Corporation June 2007  –  November 2008  (1 year 6 months) Hillsboro, OR •\tDrove the supply chain adaptions for wifi NPI products; facilitated proto-type builds; transferred products into high volume manufacture at ODM(s) \n•\tSilicon Sales enablement for greenfield/non-Centrino derivative business \n•\tNew ODM engagement for Centrino and non-Centrino business \n•\tProcess-orient the Board Operations Program Manager team \n MWG Board Operations Program Manager Intel Corporation June 2007  –  November 2008  (1 year 6 months) Hillsboro, OR •\tDrove the supply chain adaptions for wifi NPI products; facilitated proto-type builds; transferred products into high volume manufacture at ODM(s) \n•\tSilicon Sales enablement for greenfield/non-Centrino derivative business \n•\tNew ODM engagement for Centrino and non-Centrino business \n•\tProcess-orient the Board Operations Program Manager team \n MWG Product Sustaining Team Manager Intel Corporation February 2006  –  June 2007  (1 year 5 months) Kulim, Malaysia Expatriate Assignment to Malaysia.  \n•\tTransfer product sustaining responsibilities from Oregon to Malaysia, by establishing the team and setting up communication conduits to Israel engineering team;  \n•\tReorient the team’s thinking from “factory” focus into “business units” focus \n•\tDrive resolution to product ad hoc quality, availability, and product change issues \n•\tInitiated several process improvements in regulatory and PDT Operations to achieve OpEx \n•\tEstablish sustaining hardware engineering model, to include three Intel sites and ODM support of three sustaining product families \n MWG Product Sustaining Team Manager Intel Corporation February 2006  –  June 2007  (1 year 5 months) Kulim, Malaysia Expatriate Assignment to Malaysia.  \n•\tTransfer product sustaining responsibilities from Oregon to Malaysia, by establishing the team and setting up communication conduits to Israel engineering team;  \n•\tReorient the team’s thinking from “factory” focus into “business units” focus \n•\tDrive resolution to product ad hoc quality, availability, and product change issues \n•\tInitiated several process improvements in regulatory and PDT Operations to achieve OpEx \n•\tEstablish sustaining hardware engineering model, to include three Intel sites and ODM support of three sustaining product families \n MWG Sustaining Product and Regulatory Program Manager Intel Corporation May 2005  –  February 2006  (10 months) Hillsboro, OR •\tDrove all sustaining cost, quality and delivery aspects of the MWG products across a multi-function, multi-site organization. \n•\tLearned the “language” of wifi and related worldwide regulatory engagement. \n MWG Sustaining Product and Regulatory Program Manager Intel Corporation May 2005  –  February 2006  (10 months) Hillsboro, OR •\tDrove all sustaining cost, quality and delivery aspects of the MWG products across a multi-function, multi-site organization. \n•\tLearned the “language” of wifi and related worldwide regulatory engagement. \n LAD Product Marketing Engineer Intel Corporation October 2003  –  May 2005  (1 year 8 months) Hillsboro, OR •\tForecasting and pricing of desktop, wired mobile, and 10GbE adapters. \n•\tPartnered with geography sales to establish the right product mix, pricing, and overall forecast \n•\tSupported all product quality and delivery issues, as the customer representative. \n•\tProduct launch program manager & World-wide marketing programs support \nSupported trade shows and customer visits. \n LAD Product Marketing Engineer Intel Corporation October 2003  –  May 2005  (1 year 8 months) Hillsboro, OR •\tForecasting and pricing of desktop, wired mobile, and 10GbE adapters. \n•\tPartnered with geography sales to establish the right product mix, pricing, and overall forecast \n•\tSupported all product quality and delivery issues, as the customer representative. \n•\tProduct launch program manager & World-wide marketing programs support \nSupported trade shows and customer visits. \n LAD Manufacturing Operations Manager Intel Corporation November 1997  –  October 2003  (6 years) Hillsboro, OR •\tPNG Product Security Initiative Leader driving features development and implementation, industry summit, indicator development, coordination with Intel security and private investigators. \n•\tManufacturing Integrator to the Xircom acquisition integration \n•\tProgram Managed the Brazil ROI & factory start-up; China subcon factory decision and startup  \n•\tEstablished supply chain for Brazil and China \n•\tManufacturing operations lead in the organizations transformation into PLC usage \n•\tManufacturing program managed the introduction of several LAD adapter products •\tIntroduced the first LAD NPI into iPR and Solectron simultaneously to achieve 300ku+ in the first month of production \n•\tProvided OEM PM Manager coverage for extended sabbatical leave; this team supported all major desktop OEM’s to Intel (e.g. Dell, Fujitsu, Compaq, HP) \n•\tProvided Operations support to customer visits, to represent the supply chain imperatives of cost, quality, and delivery \n•\tFacilitated numerous product/process quality issue resolutions, involving customer returns, rework, and supply chain balancing between factories. \n•\tSupported the product line RMA process, eliminating the use of R-sku’s through ROI analysis \n LAD Manufacturing Operations Manager Intel Corporation November 1997  –  October 2003  (6 years) Hillsboro, OR •\tPNG Product Security Initiative Leader driving features development and implementation, industry summit, indicator development, coordination with Intel security and private investigators. \n•\tManufacturing Integrator to the Xircom acquisition integration \n•\tProgram Managed the Brazil ROI & factory start-up; China subcon factory decision and startup  \n•\tEstablished supply chain for Brazil and China \n•\tManufacturing operations lead in the organizations transformation into PLC usage \n•\tManufacturing program managed the introduction of several LAD adapter products •\tIntroduced the first LAD NPI into iPR and Solectron simultaneously to achieve 300ku+ in the first month of production \n•\tProvided OEM PM Manager coverage for extended sabbatical leave; this team supported all major desktop OEM’s to Intel (e.g. Dell, Fujitsu, Compaq, HP) \n•\tProvided Operations support to customer visits, to represent the supply chain imperatives of cost, quality, and delivery \n•\tFacilitated numerous product/process quality issue resolutions, involving customer returns, rework, and supply chain balancing between factories. \n•\tSupported the product line RMA process, eliminating the use of R-sku’s through ROI analysis \n Senior Consultant Deloitte & Touche May 1995  –  November 1997  (2 years 7 months) San Francisco, CA & Portland OR •\tLed information systems audits in support of annual financial audits  \n•\tPrepared and presented control systems recommendations  \n•\tParticipated in Disaster Recovery assessment/recommendation consulting projects \n Senior Consultant Deloitte & Touche May 1995  –  November 1997  (2 years 7 months) San Francisco, CA & Portland OR •\tLed information systems audits in support of annual financial audits  \n•\tPrepared and presented control systems recommendations  \n•\tParticipated in Disaster Recovery assessment/recommendation consulting projects \n Skills Leadership Management Budgets Strategic Planning Manufacturing Program Management Consulting Product Marketing Business Development Customer Service Product Management Project Management Business Strategy Team Leadership Strategic Partnerships Supply Chain Management Integration Business Process... Strategy Cross-functional Team... Process Improvement Competitive Analysis Vendor Management Enterprise Software Product Development Business Analysis Six Sigma See 12+     See less Skills  Leadership Management Budgets Strategic Planning Manufacturing Program Management Consulting Product Marketing Business Development Customer Service Product Management Project Management Business Strategy Team Leadership Strategic Partnerships Supply Chain Management Integration Business Process... Strategy Cross-functional Team... Process Improvement Competitive Analysis Vendor Management Enterprise Software Product Development Business Analysis Six Sigma See 12+     See less Leadership Management Budgets Strategic Planning Manufacturing Program Management Consulting Product Marketing Business Development Customer Service Product Management Project Management Business Strategy Team Leadership Strategic Partnerships Supply Chain Management Integration Business Process... Strategy Cross-functional Team... Process Improvement Competitive Analysis Vendor Management Enterprise Software Product Development Business Analysis Six Sigma See 12+     See less Leadership Management Budgets Strategic Planning Manufacturing Program Management Consulting Product Marketing Business Development Customer Service Product Management Project Management Business Strategy Team Leadership Strategic Partnerships Supply Chain Management Integration Business Process... Strategy Cross-functional Team... Process Improvement Competitive Analysis Vendor Management Enterprise Software Product Development Business Analysis Six Sigma See 12+     See less Education Willamette University - Atkinson Graduate School of Management MBA 1993  – 1995 Willamette University BA,  Internation Studies 1989  – 1993 Activities and Societies:  Cross Country ,  Track ,  Choir Willamette University - Atkinson Graduate School of Management MBA 1993  – 1995 Willamette University - Atkinson Graduate School of Management MBA 1993  – 1995 Willamette University - Atkinson Graduate School of Management MBA 1993  – 1995 Willamette University BA,  Internation Studies 1989  – 1993 Activities and Societies:  Cross Country ,  Track ,  Choir Willamette University BA,  Internation Studies 1989  – 1993 Activities and Societies:  Cross Country ,  Track ,  Choir Willamette University BA,  Internation Studies 1989  – 1993 Activities and Societies:  Cross Country ,  Track ,  Choir ", "Skills Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Skills  Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less ", "Experience Engineering Program Manager Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Software Validation Program Manager Intel Corporation May 2013  –  May 2014  (1 year 1 month) Hillsboro, Oregon Job rotation in SW led to full time position as Validation Program Manager. Responsible for 1G/10G ethernet device driver validation, test planning, resource manager, working with Validation leads to prioritize work. Responsible for preparing Cert plans to have all device drivers certified through MSFT WHQL. Coordinated with the NIC development teams to make sure SW had proper hardware to validate on and to stay abreast of changes. Represented Validation interests in platform teams during development of SoC ethernet ingredients and validation.  Engineering Program Manager Intel Corporation July 2003  –  May 2013  (9 years 11 months) Hillsboro, Oregon Job relocation to Oregon as Operations Program Manager, responsible to represent Operations in product development teams for consumer media center reference design platforms. Responsible for team of manufacturing, test, materials, quality to support local prototype builds and ensure high volume manufacturability.  \n \n2005 - 2006: Outsource Program Manager. Worked with Global Outsourcing group, responsible to work with Intel server platform groups to manage their NPI builds at California based contract manufacturers.  \n \n2006 - 2012: Engineering Program Manager in LAN Network Operation. Responsible to lead product development teams to development and productize network adapters (NICS). Responsible for team of Operations and Engineering.  \n \nTook interest in workings of Software and driver development and did a job rotation in Software group as Software Validation Program Manager.  NPI Manufacturing Engineer/Operations Program Manager Intel Corporation June 2000  –  July 2003  (3 years 2 months) Santa Clara, California Responsible to work with new product development team on cable modem products. I owned design for manufacturability, working with local prototype board assembly shops, Bill-of-Material (BOM) control and BOM scrubs. Wore many hats - in addition to ME, I worked as materials program manager and operations program manager. Was promoted to Operations Program Manager full time.  Sr. Manufacturing Engineer Autecs, Inc. (Robert Bosch Corp.) 2000  –  2003  (3 years) Led team of manufacturing engineers responsible for circuit board and unit assembly of engine control and transmission control modules for automotive customers. Led production capacity expansion project involving new equipment specifiation, procurement and bring-up. Sr. Manufacturing Engineer NCR/ATT&T GIS June 1987  –  December 1995  (8 years 7 months) SMT process engineer, soldering trainer, new equipment selection, computer system assembly/test, environmental coordinator, EHS representative. Engineering Program Manager Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Engineering Program Manager Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Software Validation Program Manager Intel Corporation May 2013  –  May 2014  (1 year 1 month) Hillsboro, Oregon Job rotation in SW led to full time position as Validation Program Manager. Responsible for 1G/10G ethernet device driver validation, test planning, resource manager, working with Validation leads to prioritize work. Responsible for preparing Cert plans to have all device drivers certified through MSFT WHQL. Coordinated with the NIC development teams to make sure SW had proper hardware to validate on and to stay abreast of changes. Represented Validation interests in platform teams during development of SoC ethernet ingredients and validation.  Software Validation Program Manager Intel Corporation May 2013  –  May 2014  (1 year 1 month) Hillsboro, Oregon Job rotation in SW led to full time position as Validation Program Manager. Responsible for 1G/10G ethernet device driver validation, test planning, resource manager, working with Validation leads to prioritize work. Responsible for preparing Cert plans to have all device drivers certified through MSFT WHQL. Coordinated with the NIC development teams to make sure SW had proper hardware to validate on and to stay abreast of changes. Represented Validation interests in platform teams during development of SoC ethernet ingredients and validation.  Engineering Program Manager Intel Corporation July 2003  –  May 2013  (9 years 11 months) Hillsboro, Oregon Job relocation to Oregon as Operations Program Manager, responsible to represent Operations in product development teams for consumer media center reference design platforms. Responsible for team of manufacturing, test, materials, quality to support local prototype builds and ensure high volume manufacturability.  \n \n2005 - 2006: Outsource Program Manager. Worked with Global Outsourcing group, responsible to work with Intel server platform groups to manage their NPI builds at California based contract manufacturers.  \n \n2006 - 2012: Engineering Program Manager in LAN Network Operation. Responsible to lead product development teams to development and productize network adapters (NICS). Responsible for team of Operations and Engineering.  \n \nTook interest in workings of Software and driver development and did a job rotation in Software group as Software Validation Program Manager.  Engineering Program Manager Intel Corporation July 2003  –  May 2013  (9 years 11 months) Hillsboro, Oregon Job relocation to Oregon as Operations Program Manager, responsible to represent Operations in product development teams for consumer media center reference design platforms. Responsible for team of manufacturing, test, materials, quality to support local prototype builds and ensure high volume manufacturability.  \n \n2005 - 2006: Outsource Program Manager. Worked with Global Outsourcing group, responsible to work with Intel server platform groups to manage their NPI builds at California based contract manufacturers.  \n \n2006 - 2012: Engineering Program Manager in LAN Network Operation. Responsible to lead product development teams to development and productize network adapters (NICS). Responsible for team of Operations and Engineering.  \n \nTook interest in workings of Software and driver development and did a job rotation in Software group as Software Validation Program Manager.  NPI Manufacturing Engineer/Operations Program Manager Intel Corporation June 2000  –  July 2003  (3 years 2 months) Santa Clara, California Responsible to work with new product development team on cable modem products. I owned design for manufacturability, working with local prototype board assembly shops, Bill-of-Material (BOM) control and BOM scrubs. Wore many hats - in addition to ME, I worked as materials program manager and operations program manager. Was promoted to Operations Program Manager full time.  NPI Manufacturing Engineer/Operations Program Manager Intel Corporation June 2000  –  July 2003  (3 years 2 months) Santa Clara, California Responsible to work with new product development team on cable modem products. I owned design for manufacturability, working with local prototype board assembly shops, Bill-of-Material (BOM) control and BOM scrubs. Wore many hats - in addition to ME, I worked as materials program manager and operations program manager. Was promoted to Operations Program Manager full time.  Sr. Manufacturing Engineer Autecs, Inc. (Robert Bosch Corp.) 2000  –  2003  (3 years) Led team of manufacturing engineers responsible for circuit board and unit assembly of engine control and transmission control modules for automotive customers. Led production capacity expansion project involving new equipment specifiation, procurement and bring-up. Sr. Manufacturing Engineer Autecs, Inc. (Robert Bosch Corp.) 2000  –  2003  (3 years) Led team of manufacturing engineers responsible for circuit board and unit assembly of engine control and transmission control modules for automotive customers. Led production capacity expansion project involving new equipment specifiation, procurement and bring-up. Sr. Manufacturing Engineer NCR/ATT&T GIS June 1987  –  December 1995  (8 years 7 months) SMT process engineer, soldering trainer, new equipment selection, computer system assembly/test, environmental coordinator, EHS representative. Sr. Manufacturing Engineer NCR/ATT&T GIS June 1987  –  December 1995  (8 years 7 months) SMT process engineer, soldering trainer, new equipment selection, computer system assembly/test, environmental coordinator, EHS representative. Skills Process Improvement Product Development Project Management Outsourcing Semiconductors Process Engineering Six Sigma Engineering Management Design of Experiments Manufacturing Lean Manufacturing Cross-functional Team... SPC Program Management Engineering Continuous Improvement Manufacturing... Root Cause Analysis Product Management Electronics Process Simulation Testing FMEA Intel Systems Engineering Automotive See 11+     See less Skills  Process Improvement Product Development Project Management Outsourcing Semiconductors Process Engineering Six Sigma Engineering Management Design of Experiments Manufacturing Lean Manufacturing Cross-functional Team... SPC Program Management Engineering Continuous Improvement Manufacturing... Root Cause Analysis Product Management Electronics Process Simulation Testing FMEA Intel Systems Engineering Automotive See 11+     See less Process Improvement Product Development Project Management Outsourcing Semiconductors Process Engineering Six Sigma Engineering Management Design of Experiments Manufacturing Lean Manufacturing Cross-functional Team... SPC Program Management Engineering Continuous Improvement Manufacturing... Root Cause Analysis Product Management Electronics Process Simulation Testing FMEA Intel Systems Engineering Automotive See 11+     See less Process Improvement Product Development Project Management Outsourcing Semiconductors Process Engineering Six Sigma Engineering Management Design of Experiments Manufacturing Lean Manufacturing Cross-functional Team... SPC Program Management Engineering Continuous Improvement Manufacturing... Root Cause Analysis Product Management Electronics Process Simulation Testing FMEA Intel Systems Engineering Automotive See 11+     See less Education Arizona State University, W. P. Carey School of Business MBA 2005  – 2007 Clemson University MS,  Environmental Systems Engineering 1994  – 1996 North Carolina State University BS,  Chemical Engineering 1979  – 1982 Arizona State University, W. P. Carey School of Business MBA 2005  – 2007 Arizona State University, W. P. Carey School of Business MBA 2005  – 2007 Arizona State University, W. P. Carey School of Business MBA 2005  – 2007 Clemson University MS,  Environmental Systems Engineering 1994  – 1996 Clemson University MS,  Environmental Systems Engineering 1994  – 1996 Clemson University MS,  Environmental Systems Engineering 1994  – 1996 North Carolina State University BS,  Chemical Engineering 1979  – 1982 North Carolina State University BS,  Chemical Engineering 1979  – 1982 North Carolina State University BS,  Chemical Engineering 1979  – 1982 ", "Skills Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less Skills  Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less ", "Skills Web Content Content Management Technical Writing Product Marketing Internal Communications Editing Marketing Communications Program Management Corporate Communications White Papers Project Management Social Media Process Improvement Training Product Management Management Strategy Software Documentation Analysis Start-ups Newsletters Strategic Planning Integration Technical Documentation Strategic Partnerships Cross-functional Team... Change Management Software Development See 13+     See less Skills  Web Content Content Management Technical Writing Product Marketing Internal Communications Editing Marketing Communications Program Management Corporate Communications White Papers Project Management Social Media Process Improvement Training Product Management Management Strategy Software Documentation Analysis Start-ups Newsletters Strategic Planning Integration Technical Documentation Strategic Partnerships Cross-functional Team... Change Management Software Development See 13+     See less Web Content Content Management Technical Writing Product Marketing Internal Communications Editing Marketing Communications Program Management Corporate Communications White Papers Project Management Social Media Process Improvement Training Product Management Management Strategy Software Documentation Analysis Start-ups Newsletters Strategic Planning Integration Technical Documentation Strategic Partnerships Cross-functional Team... Change Management Software Development See 13+     See less Web Content Content Management Technical Writing Product Marketing Internal Communications Editing Marketing Communications Program Management Corporate Communications White Papers Project Management Social Media Process Improvement Training Product Management Management Strategy Software Documentation Analysis Start-ups Newsletters Strategic Planning Integration Technical Documentation Strategic Partnerships Cross-functional Team... Change Management Software Development See 13+     See less Honors & Awards ", "Experience Material's Program Manager Intel Corporation 2013  – Present (2 years) Hillsboro, OR ECO/Samples Coordinator - Doc Control Intel Corporation May 2012  –  August 2013  (1 year 4 months) Hillsboro, OR Sr. Material Program Manager RadiSys Corporation November 2007  –  May 2012  (4 years 7 months) Hillsboro, Or Material Program Manager Intel Corporation January 2007  –  November 2007  (11 months) Buyer/Material Program Manager Intel Corporation January 2005  –  December 2006  (2 years) Factory Buyer/ NPI Engineering Buyer Intel Corporation December 1999  –  December 2004  (5 years 1 month) Material's Program Manager Intel Corporation 2013  – Present (2 years) Hillsboro, OR Material's Program Manager Intel Corporation 2013  – Present (2 years) Hillsboro, OR ECO/Samples Coordinator - Doc Control Intel Corporation May 2012  –  August 2013  (1 year 4 months) Hillsboro, OR ECO/Samples Coordinator - Doc Control Intel Corporation May 2012  –  August 2013  (1 year 4 months) Hillsboro, OR Sr. Material Program Manager RadiSys Corporation November 2007  –  May 2012  (4 years 7 months) Hillsboro, Or Sr. Material Program Manager RadiSys Corporation November 2007  –  May 2012  (4 years 7 months) Hillsboro, Or Material Program Manager Intel Corporation January 2007  –  November 2007  (11 months) Material Program Manager Intel Corporation January 2007  –  November 2007  (11 months) Buyer/Material Program Manager Intel Corporation January 2005  –  December 2006  (2 years) Buyer/Material Program Manager Intel Corporation January 2005  –  December 2006  (2 years) Factory Buyer/ NPI Engineering Buyer Intel Corporation December 1999  –  December 2004  (5 years 1 month) Factory Buyer/ NPI Engineering Buyer Intel Corporation December 1999  –  December 2004  (5 years 1 month) Education Portland Community College Portland Community College Portland Community College Portland Community College ", "Experience M&A Integration Program Manager Intel Corporation October 2010  – Present (4 years 11 months) MPG Platform Sampling Program Manager Intel January 2005  –  October 2010  (5 years 10 months) MPG Board Dev Program Manager Intel Corporation August 2003  –  January 2005  (1 year 6 months) Test Dev Eng Program Manager Intel Corporation November 2000  –  August 2003  (2 years 10 months) M&A Integration Program Manager Intel Corporation October 2010  – Present (4 years 11 months) M&A Integration Program Manager Intel Corporation October 2010  – Present (4 years 11 months) MPG Platform Sampling Program Manager Intel January 2005  –  October 2010  (5 years 10 months) MPG Platform Sampling Program Manager Intel January 2005  –  October 2010  (5 years 10 months) MPG Board Dev Program Manager Intel Corporation August 2003  –  January 2005  (1 year 6 months) MPG Board Dev Program Manager Intel Corporation August 2003  –  January 2005  (1 year 6 months) Test Dev Eng Program Manager Intel Corporation November 2000  –  August 2003  (2 years 10 months) Test Dev Eng Program Manager Intel Corporation November 2000  –  August 2003  (2 years 10 months) Skills Program Management Semiconductors Intel Cross-functional Team... Semiconductor Industry Situational Leadership Product Launch Manufacturing Wireless Consumer Electronics Business Development Product Planning Testing Electronics Mobile Devices Strategic Partnerships Microprocessors Training Product Lifecycle... Strategy See 5+     See less Skills  Program Management Semiconductors Intel Cross-functional Team... Semiconductor Industry Situational Leadership Product Launch Manufacturing Wireless Consumer Electronics Business Development Product Planning Testing Electronics Mobile Devices Strategic Partnerships Microprocessors Training Product Lifecycle... Strategy See 5+     See less Program Management Semiconductors Intel Cross-functional Team... Semiconductor Industry Situational Leadership Product Launch Manufacturing Wireless Consumer Electronics Business Development Product Planning Testing Electronics Mobile Devices Strategic Partnerships Microprocessors Training Product Lifecycle... Strategy See 5+     See less Program Management Semiconductors Intel Cross-functional Team... Semiconductor Industry Situational Leadership Product Launch Manufacturing Wireless Consumer Electronics Business Development Product Planning Testing Electronics Mobile Devices Strategic Partnerships Microprocessors Training Product Lifecycle... Strategy See 5+     See less Education University of Oregon - Charles H. Lundquist College of Business Bachelor of Science (B.S.),  Marketing/Decision Sciences University of Oregon - Charles H. Lundquist College of Business Bachelor of Science (B.S.),  Marketing/Decision Sciences University of Oregon - Charles H. Lundquist College of Business Bachelor of Science (B.S.),  Marketing/Decision Sciences University of Oregon - Charles H. Lundquist College of Business Bachelor of Science (B.S.),  Marketing/Decision Sciences ", "Languages French French French Skills Product Marketing Program Management Competitive Analysis Product Strategy Intel Cross-functional Team... Enterprise Software Go-to-market Strategy Global Business... Technical Marketing Integration Strategic Partnerships Vendor Management Product Management PMO Databases Project Management Leadership Management Training Security Project Planning PMP Process Improvement See 9+     See less Skills  Product Marketing Program Management Competitive Analysis Product Strategy Intel Cross-functional Team... Enterprise Software Go-to-market Strategy Global Business... Technical Marketing Integration Strategic Partnerships Vendor Management Product Management PMO Databases Project Management Leadership Management Training Security Project Planning PMP Process Improvement See 9+     See less Product Marketing Program Management Competitive Analysis Product Strategy Intel Cross-functional Team... Enterprise Software Go-to-market Strategy Global Business... Technical Marketing Integration Strategic Partnerships Vendor Management Product Management PMO Databases Project Management Leadership Management Training Security Project Planning PMP Process Improvement See 9+     See less Product Marketing Program Management Competitive Analysis Product Strategy Intel Cross-functional Team... Enterprise Software Go-to-market Strategy Global Business... Technical Marketing Integration Strategic Partnerships Vendor Management Product Management PMO Databases Project Management Leadership Management Training Security Project Planning PMP Process Improvement See 9+     See less ", "Summary An accomplished and highly skilled Engineering Project Manager with the ability to lead large multi-functional teams, managing complex projects between multiple organizations. This includes experience in supplier management and championing strategic equipment sourcing groups for high volume manufacturing & Technology Development lines, while also leading multi-factory Capital Equipment Reuse decision models. Have expertise in new factory start-ups and factory expansions with focus on Automation Software Systems, Material Handling Systems, and Process Tool Development. Proven Successful Track Record in quickly driving program strategy and agreement from all stakeholder organizations, communicating direction, and facilitating execution at all levels. Summary An accomplished and highly skilled Engineering Project Manager with the ability to lead large multi-functional teams, managing complex projects between multiple organizations. This includes experience in supplier management and championing strategic equipment sourcing groups for high volume manufacturing & Technology Development lines, while also leading multi-factory Capital Equipment Reuse decision models. Have expertise in new factory start-ups and factory expansions with focus on Automation Software Systems, Material Handling Systems, and Process Tool Development. Proven Successful Track Record in quickly driving program strategy and agreement from all stakeholder organizations, communicating direction, and facilitating execution at all levels. An accomplished and highly skilled Engineering Project Manager with the ability to lead large multi-functional teams, managing complex projects between multiple organizations. This includes experience in supplier management and championing strategic equipment sourcing groups for high volume manufacturing & Technology Development lines, while also leading multi-factory Capital Equipment Reuse decision models. Have expertise in new factory start-ups and factory expansions with focus on Automation Software Systems, Material Handling Systems, and Process Tool Development. Proven Successful Track Record in quickly driving program strategy and agreement from all stakeholder organizations, communicating direction, and facilitating execution at all levels. An accomplished and highly skilled Engineering Project Manager with the ability to lead large multi-functional teams, managing complex projects between multiple organizations. This includes experience in supplier management and championing strategic equipment sourcing groups for high volume manufacturing & Technology Development lines, while also leading multi-factory Capital Equipment Reuse decision models. Have expertise in new factory start-ups and factory expansions with focus on Automation Software Systems, Material Handling Systems, and Process Tool Development. Proven Successful Track Record in quickly driving program strategy and agreement from all stakeholder organizations, communicating direction, and facilitating execution at all levels. Experience Substrate Equipment Program Manager & Supply Chain Professional Intel Corporation October 2012  – Present (2 years 11 months) Substrate Equipment Program Manager Intel Corporation May 2010  –  October 2012  (2 years 6 months) Capital Reuse Program Manager Intel Corporation August 2007  –  May 2010  (2 years 10 months) Automation Start-up Program Manager Intel Corporation February 2005  –  August 2007  (2 years 7 months) Automation Tech Transfer Manager Intel January 2003  –  February 2005  (2 years 2 months) Factory AMHS start-up Program Manager Intel Corporation February 2000  –  December 2002  (2 years 11 months) Automation Factory Software Application Owner Intel Corporation May 1999  –  February 2000  (10 months) Automated Material Handling System Expansion Proj Manager Intel April 1998  –  May 1999  (1 year 2 months) Automated Material Handling Systems Simulation Design Engineer Intel June 1995  –  April 1998  (2 years 11 months) Substrate Equipment Program Manager & Supply Chain Professional Intel Corporation October 2012  – Present (2 years 11 months) Substrate Equipment Program Manager & Supply Chain Professional Intel Corporation October 2012  – Present (2 years 11 months) Substrate Equipment Program Manager Intel Corporation May 2010  –  October 2012  (2 years 6 months) Substrate Equipment Program Manager Intel Corporation May 2010  –  October 2012  (2 years 6 months) Capital Reuse Program Manager Intel Corporation August 2007  –  May 2010  (2 years 10 months) Capital Reuse Program Manager Intel Corporation August 2007  –  May 2010  (2 years 10 months) Automation Start-up Program Manager Intel Corporation February 2005  –  August 2007  (2 years 7 months) Automation Start-up Program Manager Intel Corporation February 2005  –  August 2007  (2 years 7 months) Automation Tech Transfer Manager Intel January 2003  –  February 2005  (2 years 2 months) Automation Tech Transfer Manager Intel January 2003  –  February 2005  (2 years 2 months) Factory AMHS start-up Program Manager Intel Corporation February 2000  –  December 2002  (2 years 11 months) Factory AMHS start-up Program Manager Intel Corporation February 2000  –  December 2002  (2 years 11 months) Automation Factory Software Application Owner Intel Corporation May 1999  –  February 2000  (10 months) Automation Factory Software Application Owner Intel Corporation May 1999  –  February 2000  (10 months) Automated Material Handling System Expansion Proj Manager Intel April 1998  –  May 1999  (1 year 2 months) Automated Material Handling System Expansion Proj Manager Intel April 1998  –  May 1999  (1 year 2 months) Automated Material Handling Systems Simulation Design Engineer Intel June 1995  –  April 1998  (2 years 11 months) Automated Material Handling Systems Simulation Design Engineer Intel June 1995  –  April 1998  (2 years 11 months) Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills ASIC Design of Experiments Semiconductors JMP SoC IC Semiconductor Industry SPC Skills  ASIC Design of Experiments Semiconductors JMP SoC IC Semiconductor Industry SPC ASIC Design of Experiments Semiconductors JMP SoC IC Semiconductor Industry SPC ASIC Design of Experiments Semiconductors JMP SoC IC Semiconductor Industry SPC Education Purdue University Master's Degree,  Master of Science in Industrial Engineering 1993  – 1995 Purdue University Bachelor's Degree,  Bachelor of Science in Engineering: Interdisciplinary Engineering / Engineering Management , Graduated with Highest Distinction 1989  – 1993 Purdue University Master's Degree,  Master of Science in Industrial Engineering 1993  – 1995 Purdue University Master's Degree,  Master of Science in Industrial Engineering 1993  – 1995 Purdue University Master's Degree,  Master of Science in Industrial Engineering 1993  – 1995 Purdue University Bachelor's Degree,  Bachelor of Science in Engineering: Interdisciplinary Engineering / Engineering Management , Graduated with Highest Distinction 1989  – 1993 Purdue University Bachelor's Degree,  Bachelor of Science in Engineering: Interdisciplinary Engineering / Engineering Management , Graduated with Highest Distinction 1989  – 1993 Purdue University Bachelor's Degree,  Bachelor of Science in Engineering: Interdisciplinary Engineering / Engineering Management , Graduated with Highest Distinction 1989  – 1993 ", "Skills Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Skills  Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Honors & Awards ", "Languages Tamil Kannada Tamil Kannada Tamil Kannada Skills Software Project... Agile Methodologies Program Management Agile Project Management SDLC Software Development Scrum PMP Requirements Analysis PMO Business Analysis Integration Vendor Management Cross-functional Team... Product Management Project Management Software Engineering Project Portfolio... SharePoint ITIL SFDC Salesforce.com Cloud Applications Intel SOA SQL Unix C++ Certified Scrum Master... Cloud Computing CRM IT Strategy SaaS Global Delivery IT Service Management IT Management Outsourcing Solution Architecture Development Of Employees Telecommunications Enterprise Software Business Intelligence Process Improvement Management Enterprise Architecture Requirements Gathering Partner Management Big Data Team Management PMI See 35+     See less Skills  Software Project... Agile Methodologies Program Management Agile Project Management SDLC Software Development Scrum PMP Requirements Analysis PMO Business Analysis Integration Vendor Management Cross-functional Team... Product Management Project Management Software Engineering Project Portfolio... SharePoint ITIL SFDC Salesforce.com Cloud Applications Intel SOA SQL Unix C++ Certified Scrum Master... Cloud Computing CRM IT Strategy SaaS Global Delivery IT Service Management IT Management Outsourcing Solution Architecture Development Of Employees Telecommunications Enterprise Software Business Intelligence Process Improvement Management Enterprise Architecture Requirements Gathering Partner Management Big Data Team Management PMI See 35+     See less Software Project... Agile Methodologies Program Management Agile Project Management SDLC Software Development Scrum PMP Requirements Analysis PMO Business Analysis Integration Vendor Management Cross-functional Team... Product Management Project Management Software Engineering Project Portfolio... SharePoint ITIL SFDC Salesforce.com Cloud Applications Intel SOA SQL Unix C++ Certified Scrum Master... Cloud Computing CRM IT Strategy SaaS Global Delivery IT Service Management IT Management Outsourcing Solution Architecture Development Of Employees Telecommunications Enterprise Software Business Intelligence Process Improvement Management Enterprise Architecture Requirements Gathering Partner Management Big Data Team Management PMI See 35+     See less Software Project... Agile Methodologies Program Management Agile Project Management SDLC Software Development Scrum PMP Requirements Analysis PMO Business Analysis Integration Vendor Management Cross-functional Team... Product Management Project Management Software Engineering Project Portfolio... SharePoint ITIL SFDC Salesforce.com Cloud Applications Intel SOA SQL Unix C++ Certified Scrum Master... Cloud Computing CRM IT Strategy SaaS Global Delivery IT Service Management IT Management Outsourcing Solution Architecture Development Of Employees Telecommunications Enterprise Software Business Intelligence Process Improvement Management Enterprise Architecture Requirements Gathering Partner Management Big Data Team Management PMI See 35+     See less ", "Summary Certified Scrum Master (CSM) and Project Management Professional (PMP) with over 15 years of Project and Program Management experience. Primary focus on software development to automate supply chain management processes with extensive SAP PM experience. \n \nSpecialties: SAP Program and Project Management, CMMI Project Management, Agile Project Management, Business Process Management, Supply Chain Management, Purchasing and Inventory Management, and People Management Summary Certified Scrum Master (CSM) and Project Management Professional (PMP) with over 15 years of Project and Program Management experience. Primary focus on software development to automate supply chain management processes with extensive SAP PM experience. \n \nSpecialties: SAP Program and Project Management, CMMI Project Management, Agile Project Management, Business Process Management, Supply Chain Management, Purchasing and Inventory Management, and People Management Certified Scrum Master (CSM) and Project Management Professional (PMP) with over 15 years of Project and Program Management experience. Primary focus on software development to automate supply chain management processes with extensive SAP PM experience. \n \nSpecialties: SAP Program and Project Management, CMMI Project Management, Agile Project Management, Business Process Management, Supply Chain Management, Purchasing and Inventory Management, and People Management Certified Scrum Master (CSM) and Project Management Professional (PMP) with over 15 years of Project and Program Management experience. Primary focus on software development to automate supply chain management processes with extensive SAP PM experience. \n \nSpecialties: SAP Program and Project Management, CMMI Project Management, Agile Project Management, Business Process Management, Supply Chain Management, Purchasing and Inventory Management, and People Management Experience Portfolio Program Manager Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, Oregon Managing a team of Program Managers to deliver software solutions to automate supply chain processes. Program Manager Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, OR Managing a mixture of waterfall and agile programs for SAP ERP. Project / Program Manager Intel Corporation September 2006  –  July 2011  (4 years 11 months) Managing an enterprise wide SAP Program Manager Intel Corporation June 2005  –  September 2006  (1 year 4 months) Managed Project Managers Project Manager Intel Corporation August 2000  –  August 2005  (5 years 1 month) Managed small and medium software development projects for automating factory supply chain processes. Buyer Intel Corporation June 1999  –  August 2000  (1 year 3 months) Planned and Purchased factory spares for the Intel Oregon Fabs. Salesman Miller Paint Company September 1997  –  June 1999  (1 year 10 months) Sold paint and sundries. Cryptologic Technician US Navy June 1988  –  June 1992  (4 years 1 month) Portfolio Program Manager Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, Oregon Managing a team of Program Managers to deliver software solutions to automate supply chain processes. Portfolio Program Manager Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, Oregon Managing a team of Program Managers to deliver software solutions to automate supply chain processes. Program Manager Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, OR Managing a mixture of waterfall and agile programs for SAP ERP. Program Manager Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, OR Managing a mixture of waterfall and agile programs for SAP ERP. Project / Program Manager Intel Corporation September 2006  –  July 2011  (4 years 11 months) Managing an enterprise wide SAP Program Project / Program Manager Intel Corporation September 2006  –  July 2011  (4 years 11 months) Managing an enterprise wide SAP Program Manager Intel Corporation June 2005  –  September 2006  (1 year 4 months) Managed Project Managers Manager Intel Corporation June 2005  –  September 2006  (1 year 4 months) Managed Project Managers Project Manager Intel Corporation August 2000  –  August 2005  (5 years 1 month) Managed small and medium software development projects for automating factory supply chain processes. Project Manager Intel Corporation August 2000  –  August 2005  (5 years 1 month) Managed small and medium software development projects for automating factory supply chain processes. Buyer Intel Corporation June 1999  –  August 2000  (1 year 3 months) Planned and Purchased factory spares for the Intel Oregon Fabs. Buyer Intel Corporation June 1999  –  August 2000  (1 year 3 months) Planned and Purchased factory spares for the Intel Oregon Fabs. Salesman Miller Paint Company September 1997  –  June 1999  (1 year 10 months) Sold paint and sundries. Salesman Miller Paint Company September 1997  –  June 1999  (1 year 10 months) Sold paint and sundries. Cryptologic Technician US Navy June 1988  –  June 1992  (4 years 1 month) Cryptologic Technician US Navy June 1988  –  June 1992  (4 years 1 month) Languages German German German Skills Program Management PMP Supply Chain Management Project Management Business Process Leadership Management SAP Software Project... Software Development Enterprise Software Agile Project Management Operations Management Process Improvement Cross-functional Team... Project Portfolio... Product Management ERP See 3+     See less Skills  Program Management PMP Supply Chain Management Project Management Business Process Leadership Management SAP Software Project... Software Development Enterprise Software Agile Project Management Operations Management Process Improvement Cross-functional Team... Project Portfolio... Product Management ERP See 3+     See less Program Management PMP Supply Chain Management Project Management Business Process Leadership Management SAP Software Project... Software Development Enterprise Software Agile Project Management Operations Management Process Improvement Cross-functional Team... Project Portfolio... Product Management ERP See 3+     See less Program Management PMP Supply Chain Management Project Management Business Process Leadership Management SAP Software Project... Software Development Enterprise Software Agile Project Management Operations Management Process Improvement Cross-functional Team... Project Portfolio... Product Management ERP See 3+     See less Education University of Washington, Michael G. Foster School of Business Bachelor of Arts,  Business Administration ,  Information Systems 1997  – 1999 Operations Management and Information Systems Concentration Activities and Societies:  Reformed University Fellowship ,  College Republicans Highline College Associates,  Business Administration 1996  – 1997 Accounting Concentration Activities and Societies:  Phi Theta Kappa University of Washington, Michael G. Foster School of Business Bachelor of Arts,  Business Administration ,  Information Systems 1997  – 1999 Operations Management and Information Systems Concentration Activities and Societies:  Reformed University Fellowship ,  College Republicans University of Washington, Michael G. Foster School of Business Bachelor of Arts,  Business Administration ,  Information Systems 1997  – 1999 Operations Management and Information Systems Concentration Activities and Societies:  Reformed University Fellowship ,  College Republicans University of Washington, Michael G. Foster School of Business Bachelor of Arts,  Business Administration ,  Information Systems 1997  – 1999 Operations Management and Information Systems Concentration Activities and Societies:  Reformed University Fellowship ,  College Republicans Highline College Associates,  Business Administration 1996  – 1997 Accounting Concentration Activities and Societies:  Phi Theta Kappa Highline College Associates,  Business Administration 1996  – 1997 Accounting Concentration Activities and Societies:  Phi Theta Kappa Highline College Associates,  Business Administration 1996  – 1997 Accounting Concentration Activities and Societies:  Phi Theta Kappa ", "Summary Supply Chain manager with extensive experience in Planning and Manufacturing Systems. Successful track record in Operations and project management, with focus on processes and efficiency.  \nLed culturally diversed teams across multiple geographies, from project conception to implementation and stabilization.  \nInternational work experience in Asia.  \nEnjoys solving problems and working with people. Specialties:program management, project management, supply chain, shop floor control, manufacturing, planning, cross cultural team Summary Supply Chain manager with extensive experience in Planning and Manufacturing Systems. Successful track record in Operations and project management, with focus on processes and efficiency.  \nLed culturally diversed teams across multiple geographies, from project conception to implementation and stabilization.  \nInternational work experience in Asia.  \nEnjoys solving problems and working with people. Specialties:program management, project management, supply chain, shop floor control, manufacturing, planning, cross cultural team Supply Chain manager with extensive experience in Planning and Manufacturing Systems. Successful track record in Operations and project management, with focus on processes and efficiency.  \nLed culturally diversed teams across multiple geographies, from project conception to implementation and stabilization.  \nInternational work experience in Asia.  \nEnjoys solving problems and working with people. Specialties:program management, project management, supply chain, shop floor control, manufacturing, planning, cross cultural team Supply Chain manager with extensive experience in Planning and Manufacturing Systems. Successful track record in Operations and project management, with focus on processes and efficiency.  \nLed culturally diversed teams across multiple geographies, from project conception to implementation and stabilization.  \nInternational work experience in Asia.  \nEnjoys solving problems and working with people. Specialties:program management, project management, supply chain, shop floor control, manufacturing, planning, cross cultural team Skills Program Management Project Management Cross-functional Team... Supply Chain... Supply Chain Management Supply Chain Planning Semiconductors Product Lifecycle... Continuous Improvement Lean Manufacturing Strategy Start-ups Product Development Vendor Management Leadership Electronics Management Manufacturing Strategic Sourcing Demand Planning Change Management Project Planning Demand Forecasting PMP MRP Product Management Business Intelligence Operations Management Process Improvement Semiconductor Industry Outsourcing Integration Supply Management Business Process... Business Strategy Supply Chain Operations Business Process Forecasting See 24+     See less Skills  Program Management Project Management Cross-functional Team... Supply Chain... Supply Chain Management Supply Chain Planning Semiconductors Product Lifecycle... Continuous Improvement Lean Manufacturing Strategy Start-ups Product Development Vendor Management Leadership Electronics Management Manufacturing Strategic Sourcing Demand Planning Change Management Project Planning Demand Forecasting PMP MRP Product Management Business Intelligence Operations Management Process Improvement Semiconductor Industry Outsourcing Integration Supply Management Business Process... Business Strategy Supply Chain Operations Business Process Forecasting See 24+     See less Program Management Project Management Cross-functional Team... Supply Chain... Supply Chain Management Supply Chain Planning Semiconductors Product Lifecycle... Continuous Improvement Lean Manufacturing Strategy Start-ups Product Development Vendor Management Leadership Electronics Management Manufacturing Strategic Sourcing Demand Planning Change Management Project Planning Demand Forecasting PMP MRP Product Management Business Intelligence Operations Management Process Improvement Semiconductor Industry Outsourcing Integration Supply Management Business Process... Business Strategy Supply Chain Operations Business Process Forecasting See 24+     See less Program Management Project Management Cross-functional Team... Supply Chain... Supply Chain Management Supply Chain Planning Semiconductors Product Lifecycle... Continuous Improvement Lean Manufacturing Strategy Start-ups Product Development Vendor Management Leadership Electronics Management Manufacturing Strategic Sourcing Demand Planning Change Management Project Planning Demand Forecasting PMP MRP Product Management Business Intelligence Operations Management Process Improvement Semiconductor Industry Outsourcing Integration Supply Management Business Process... Business Strategy Supply Chain Operations Business Process Forecasting See 24+     See less ", "Skills Product Management Manufacturing Program Management Logistics Project Planning Supply Chain Management Cross-functional Team... Software Development Process Improvement Lean Manufacturing Six Sigma MRP Inventory Management Continuous Improvement Engineering Management Purchasing Supply Chain Supply Management See 3+     See less Skills  Product Management Manufacturing Program Management Logistics Project Planning Supply Chain Management Cross-functional Team... Software Development Process Improvement Lean Manufacturing Six Sigma MRP Inventory Management Continuous Improvement Engineering Management Purchasing Supply Chain Supply Management See 3+     See less Product Management Manufacturing Program Management Logistics Project Planning Supply Chain Management Cross-functional Team... Software Development Process Improvement Lean Manufacturing Six Sigma MRP Inventory Management Continuous Improvement Engineering Management Purchasing Supply Chain Supply Management See 3+     See less Product Management Manufacturing Program Management Logistics Project Planning Supply Chain Management Cross-functional Team... Software Development Process Improvement Lean Manufacturing Six Sigma MRP Inventory Management Continuous Improvement Engineering Management Purchasing Supply Chain Supply Management See 3+     See less "]}