{"position": "Project Leader", "company": "IBM", "profiles": ["Experience Project Leader IBM Software Engg Syntel 2003  –  2004  (1 year) Project Leader IBM Project Leader IBM Software Engg Syntel 2003  –  2004  (1 year) Software Engg Syntel 2003  –  2004  (1 year) Education University of Pune University of Pune University of Pune University of Pune ", "Experience Project Leader IBM Project Leader IBM Project Leader IBM Education Oregon State University computer science 1982  – 1986 Oregon State University computer science 1982  – 1986 Oregon State University computer science 1982  – 1986 Oregon State University computer science 1982  – 1986 ", "Experience Project leader IBM project leader Satyam Computer services Limited 2007  –  2009  (2 years) team leader Capgemini 2007  –  2007  (less than a year) Project leader IBM Project leader IBM project leader Satyam Computer services Limited 2007  –  2009  (2 years) project leader Satyam Computer services Limited 2007  –  2009  (2 years) team leader Capgemini 2007  –  2007  (less than a year) team leader Capgemini 2007  –  2007  (less than a year) ", "Experience Project Leader IBM Project Leader IBM Project Leader IBM ", "Experience Project Leader IBM 2008  – Present (7 years) IBM Project Leader IBM 2008  – Present (7 years) IBM Project Leader IBM 2008  – Present (7 years) IBM Skills ITIL IT Service Management Virtualization Active Directory Windows Server Servers DNS IT Operations Service Delivery Vendor Management Project Management Skills  ITIL IT Service Management Virtualization Active Directory Windows Server Servers DNS IT Operations Service Delivery Vendor Management Project Management ITIL IT Service Management Virtualization Active Directory Windows Server Servers DNS IT Operations Service Delivery Vendor Management Project Management ITIL IT Service Management Virtualization Active Directory Windows Server Servers DNS IT Operations Service Delivery Vendor Management Project Management ", "Experience Project Leader IBM Project Leader IBM Project Leader IBM ", "Skills Big Data Data Warehousing Databases Enterprise Architecture Unix Cloud Computing Enterprise Software Analytics Data Mining Business Intelligence Software Project... Netezza Distributed Systems Data Warehouse... Business Analytics ETL SQL Software Development SOA See 4+     See less Skills  Big Data Data Warehousing Databases Enterprise Architecture Unix Cloud Computing Enterprise Software Analytics Data Mining Business Intelligence Software Project... Netezza Distributed Systems Data Warehouse... Business Analytics ETL SQL Software Development SOA See 4+     See less Big Data Data Warehousing Databases Enterprise Architecture Unix Cloud Computing Enterprise Software Analytics Data Mining Business Intelligence Software Project... Netezza Distributed Systems Data Warehouse... Business Analytics ETL SQL Software Development SOA See 4+     See less Big Data Data Warehousing Databases Enterprise Architecture Unix Cloud Computing Enterprise Software Analytics Data Mining Business Intelligence Software Project... Netezza Distributed Systems Data Warehouse... Business Analytics ETL SQL Software Development SOA See 4+     See less ", "Experience Project Leader IBM Project Leader IBM Project Leader IBM Skills Project Management Business Analysis Requirements Analysis Software Project... Management Integration Change Management Program Management IT Strategy ITIL Project Planning Skills  Project Management Business Analysis Requirements Analysis Software Project... Management Integration Change Management Program Management IT Strategy ITIL Project Planning Project Management Business Analysis Requirements Analysis Software Project... Management Integration Change Management Program Management IT Strategy ITIL Project Planning Project Management Business Analysis Requirements Analysis Software Project... Management Integration Change Management Program Management IT Strategy ITIL Project Planning ", "Experience Project Leader IBM October 2008  – Present (6 years 11 months) Pune Area, India Sr. Oracle Application Database Administrator IBM India Pvt Ltd August 2008  – Present (7 years 1 month) Pune Area, India Oracle Developer Tata Consultancy Services March 2007  –  April 2008  (1 year 2 months) Project Leader IBM October 2008  – Present (6 years 11 months) Pune Area, India Project Leader IBM October 2008  – Present (6 years 11 months) Pune Area, India Sr. Oracle Application Database Administrator IBM India Pvt Ltd August 2008  – Present (7 years 1 month) Pune Area, India Sr. Oracle Application Database Administrator IBM India Pvt Ltd August 2008  – Present (7 years 1 month) Pune Area, India Oracle Developer Tata Consultancy Services March 2007  –  April 2008  (1 year 2 months) Oracle Developer Tata Consultancy Services March 2007  –  April 2008  (1 year 2 months) Languages English English English Skills Oracle Applications Oracle E-Business Suite Oracle Oracle Fusion Middleware AIX PL/SQL OBIEE DBA Skills  Oracle Applications Oracle E-Business Suite Oracle Oracle Fusion Middleware AIX PL/SQL OBIEE DBA Oracle Applications Oracle E-Business Suite Oracle Oracle Fusion Middleware AIX PL/SQL OBIEE DBA Oracle Applications Oracle E-Business Suite Oracle Oracle Fusion Middleware AIX PL/SQL OBIEE DBA Education Patna Montessori School Master's degree,  Computer Science , A 1992  – 2000 Patna Montessori School Master's degree,  Computer Science , A 1992  – 2000 Patna Montessori School Master's degree,  Computer Science , A 1992  – 2000 Patna Montessori School Master's degree,  Computer Science , A 1992  – 2000 ", "Skills Team Leadership Social Business Middleware Social Media Websphere Blogging Solution Architecture Leadership Enterprise Architecture Cloud Computing Thought Leadership SOA Editing WebSphere Application... IT Strategy Enterprise Software Agile Methodologies EAI Integration Pre-sales SaaS WebSphere Software Project... Sales Enablement Java Enterprise Edition See 10+     See less Skills  Team Leadership Social Business Middleware Social Media Websphere Blogging Solution Architecture Leadership Enterprise Architecture Cloud Computing Thought Leadership SOA Editing WebSphere Application... IT Strategy Enterprise Software Agile Methodologies EAI Integration Pre-sales SaaS WebSphere Software Project... Sales Enablement Java Enterprise Edition See 10+     See less Team Leadership Social Business Middleware Social Media Websphere Blogging Solution Architecture Leadership Enterprise Architecture Cloud Computing Thought Leadership SOA Editing WebSphere Application... IT Strategy Enterprise Software Agile Methodologies EAI Integration Pre-sales SaaS WebSphere Software Project... Sales Enablement Java Enterprise Edition See 10+     See less Team Leadership Social Business Middleware Social Media Websphere Blogging Solution Architecture Leadership Enterprise Architecture Cloud Computing Thought Leadership SOA Editing WebSphere Application... IT Strategy Enterprise Software Agile Methodologies EAI Integration Pre-sales SaaS WebSphere Software Project... Sales Enablement Java Enterprise Edition See 10+     See less ", "Experience Project Leader IBM Programmer FrontlineSoft Limited 2000  –  2003  (3 years) Project Leader IBM Project Leader IBM Programmer FrontlineSoft Limited 2000  –  2003  (3 years) Programmer FrontlineSoft Limited 2000  –  2003  (3 years) Skills Web Services SOA Oracle Software Project... Requirements Analysis SDLC Microsoft SQL Server SQL XML Agile Methodologies Business Analysis PL/SQL JavaScript Software Development Skills  Web Services SOA Oracle Software Project... Requirements Analysis SDLC Microsoft SQL Server SQL XML Agile Methodologies Business Analysis PL/SQL JavaScript Software Development Web Services SOA Oracle Software Project... Requirements Analysis SDLC Microsoft SQL Server SQL XML Agile Methodologies Business Analysis PL/SQL JavaScript Software Development Web Services SOA Oracle Software Project... Requirements Analysis SDLC Microsoft SQL Server SQL XML Agile Methodologies Business Analysis PL/SQL JavaScript Software Development ", "Experience Project Leader IBM January 2004  – Present (11 years 8 months) Class administrator IBM 2005  –  2008  (3 years) Project Leader IBM January 2004  – Present (11 years 8 months) Project Leader IBM January 2004  – Present (11 years 8 months) Class administrator IBM 2005  –  2008  (3 years) Class administrator IBM 2005  –  2008  (3 years) ", "Experience IBM Project Leader IBM December 2013  – Present (1 year 9 months) United States Senior Systems Engineer IBM July 2009  – Present (6 years 2 months) Associate Test Lead Maveric Systems October 2003  –  June 2009  (5 years 9 months) IBM Project Leader IBM December 2013  – Present (1 year 9 months) United States IBM Project Leader IBM December 2013  – Present (1 year 9 months) United States Senior Systems Engineer IBM July 2009  – Present (6 years 2 months) Senior Systems Engineer IBM July 2009  – Present (6 years 2 months) Associate Test Lead Maveric Systems October 2003  –  June 2009  (5 years 9 months) Associate Test Lead Maveric Systems October 2003  –  June 2009  (5 years 9 months) Education Bharathidasan University MCA,  Computer Applications Bharathidasan University MCA,  Computer Applications Bharathidasan University MCA,  Computer Applications Bharathidasan University MCA,  Computer Applications ", "Experience Project Leader IBM September 2010  – Present (5 years) Client Management, CSAT, People Management, Project timelines PROGRAMME MANAGER CMS COMPUTERS February 2006  –  September 2010  (4 years 8 months) Client Management , CSAT, Account financial health Project Leader IBM September 2010  – Present (5 years) Client Management, CSAT, People Management, Project timelines Project Leader IBM September 2010  – Present (5 years) Client Management, CSAT, People Management, Project timelines PROGRAMME MANAGER CMS COMPUTERS February 2006  –  September 2010  (4 years 8 months) Client Management , CSAT, Account financial health PROGRAMME MANAGER CMS COMPUTERS February 2006  –  September 2010  (4 years 8 months) Client Management , CSAT, Account financial health Skills Project Management Service Delivery... Retail Incident Management Problem Management Data Analysis People Management Skills  Project Management Service Delivery... Retail Incident Management Problem Management Data Analysis People Management Project Management Service Delivery... Retail Incident Management Problem Management Data Analysis People Management Project Management Service Delivery... Retail Incident Management Problem Management Data Analysis People Management Education IES Bachelor's degree IES Bachelor's degree IES Bachelor's degree IES Bachelor's degree ", "Summary IT professional with Project Management Certification. Over 25 years experience in software engineering, project management, software / product test, open source management, information and software development for IBM storage products. Extensive background in IBM storage products, and backup/archive applications. Competencies include project / time management, leadership, written and verbal communication, listening, analytic s, and negotiation. \n \nSpecialties: Project Management - IBM Redbooks publications, Open source management methodologies, Tivoli Storage Productivity Center, IBM ProtecTIER TS7600, Knowledge of Agile Development Processes, Tape, SAN and Storage Subsystems.Test case development /execution, trouble shooting. Summary IT professional with Project Management Certification. Over 25 years experience in software engineering, project management, software / product test, open source management, information and software development for IBM storage products. Extensive background in IBM storage products, and backup/archive applications. Competencies include project / time management, leadership, written and verbal communication, listening, analytic s, and negotiation. \n \nSpecialties: Project Management - IBM Redbooks publications, Open source management methodologies, Tivoli Storage Productivity Center, IBM ProtecTIER TS7600, Knowledge of Agile Development Processes, Tape, SAN and Storage Subsystems.Test case development /execution, trouble shooting. IT professional with Project Management Certification. Over 25 years experience in software engineering, project management, software / product test, open source management, information and software development for IBM storage products. Extensive background in IBM storage products, and backup/archive applications. Competencies include project / time management, leadership, written and verbal communication, listening, analytic s, and negotiation. \n \nSpecialties: Project Management - IBM Redbooks publications, Open source management methodologies, Tivoli Storage Productivity Center, IBM ProtecTIER TS7600, Knowledge of Agile Development Processes, Tape, SAN and Storage Subsystems.Test case development /execution, trouble shooting. IT professional with Project Management Certification. Over 25 years experience in software engineering, project management, software / product test, open source management, information and software development for IBM storage products. Extensive background in IBM storage products, and backup/archive applications. Competencies include project / time management, leadership, written and verbal communication, listening, analytic s, and negotiation. \n \nSpecialties: Project Management - IBM Redbooks publications, Open source management methodologies, Tivoli Storage Productivity Center, IBM ProtecTIER TS7600, Knowledge of Agile Development Processes, Tape, SAN and Storage Subsystems.Test case development /execution, trouble shooting. Experience Project Leader Project Leader IBM ITSO Storage Systems Redbooks at Kforce Inc. March 2011  – Present (4 years 6 months) Tucson, Arizona Area Storage Project Leader IBM Corporation February 2011  – Present (4 years 7 months) IBM Tucson Arizona Project Leader at the IBM International Technical Support Organization(ITSO), Tucson Arizona Center planning, developing, and leading the effort of running the residencies to create IBM Redbooks and Redpapers publications.  \n \nThe ITSO Redbooks team develops and delivers skills, technical know-how, and materials to IBM technical professionals, Business Partners, clients, and the marketplace in general. ITSO's Redbooks objective is to extend the understanding of IBM products and to accelerate the deployment and exploitation of IBM solutions Software Engineer IBM Corporation April 2010  –  February 2011  (11 months) Software Engineer  \nPerform software test on IBM Tivoli Productivity Center Application to meet / overachieve release dates by developing and executing test cases, performing product installs, Windows and Linux System administration. \n \nIdentified, documented, and tested product defects for Tivoli Productivity Center Release 4.2 at a rate of 4.3% errors per test case which contributed to exceptional product quality.  \nApply AGILE software development methodologies utilizing IBM's Rational Software Suite; collaborating with international teams to identify product defects and issues early in the test cycle, while focusing on customer requirements and satisfaction. Software Engineer - Open Source Management IBM Corporation February 2006  –  February 2009  (3 years 1 month) Software Engineer : Open Source Management 2006 - 2009  \n \nAchieved exceptional product quality through effective management of open source processes and open source approval for over 40 IBM products. Conducted legal reviews of product Open Source Proposals to IBM Corporate to accurately identify pedigree of open source and gating issues that could stop release of new products. Open source objectives were accomplished through effective communications and negotiation of technical issues across work teams, which included Corporate Intelletual Property and General Legal Lawyers, Development, Program Managers, Product Test, Vendors, and the IBM Corporate Open Source Core team. \n \nPrepared Open Source Proposals and supporting documents for Legal / Open Source reviews to identify issues and to secure approval required to ship open source in IBM products.  \nAnalyzed/reviewed product licenses, third party licenses, product notice files and Certificate of Originality (COO) documentation. Provided improvements and revisions critical to shipping open source in IBM products.; Multitasked and adapted to changes in priority by seamlessly shifting between (6) or more concurrent projects on a moment's notice avoiding products missing their release dates. \nReduced required number of product open source due diligence checklist document approvals by 25%.  \nAwarded 'PUBLISH' by IBM Intellectual Properties (IP) Law for disclosure 'Method to Intelligently Handle Registered State Change'. \nReceived $2,000 'Bravo' award for excellent Open Source product support and 60% increase of approved open source proposals.  \nEarned (9) \"Thanks\" awards for dedication to product open source management quality and timely approvals and identification of open source related issues to ensure product release dates were met; often ahead of schedule. Mid-range tape Program Manager IBM Corporation February 2006  –  February 2008  (2 years 1 month) IBM Tucson Arizona Program Manager for IBM Mid-range Tape Subsystems Program Manager IBM Corporation February 2006  –  February 2008  (2 years 1 month) Program Manager  \nProgram Manager for a diverse group of IBM professionals for automated tape products. Led in-house and Vendor Development, Product Test, Reliability Accessibility Serviceability (RAS), Procurement, Marketing, Manufacturing, Education, Human factors, and Publications teams in all phases of the Product development Life Cycle from initial product concept through design, implementation deployment, with high focus on meeting business objectives.  \n \nDeveloped and drove project schedules and dependencies throughout the product life cycle to release IBM's 1st modular, scalable tape library.  \nManaged multiple interdependent projects focusing specifically on developing cost estimates, project risk, scope, resource and financial management and project interdependencies contributing to revenue. \nImproved reliability test for the new modular tape library over it's predecessor by (1) million Mean Swaps  \nBefore Failure (MSBF) as compared to 200K MSBF for the previous product. Software Engineer - Product Tester IBM Corporation January 1995  –  January 2003  (8 years 1 month) Worked in System Level Test as Lead Engineer to coordinate tests for Tape and Disk products to meet / overachieve release dates by planning resources, developing and executing test cases, performing product installs, participating in management meetings, and presenting status to Development, Program Management and Test Management.Debugged problems; assessed risks, and analyzed field problems, and test effectiveness.  \n \nImplemented Tivoli Storage Manager Application for first time in Product Test to test backup / retrieval of products in a customer-like environment. This effort assisted the Tivoli Test department in debug of Tivoli Storage Manager and in usage of disk / tape equipment. \nAwarded IBM 700 stock options for high performance in Product Test.  \nCollaborated with IBM Global Services to write a white paper on Tivoli Storage Manager \"Tape Sharing in a SAN Environment\" and with the IBM Almaden Redbook team to write a book on \"Storage Area Networks: Tape Future in Fabrics\". \nCo-authored a White Paper, which documented a disaster recovery solution. The solution emulated a 24 by-7customer production environment with test scenarios used to demonstrate the capability of IBM storage products to recover customer operations at a secondary site if the primary site failed, including resuming operations on the primary site after a failure. \nReceived $2,000 award for contributions as Tape Test lead and Field Build of suite of tape products. Associates Programmer IBM Corporation January 1985  –  January 1995  (10 years 1 month) Designed, implemented, and maintained the accounting, migrate/recall schemes, product build, and install  \nprograms for IBM backup / restore of customer data on tape and disk products. Maintained applications in  \nsupport of IBM manufacturing. Project Leader Project Leader IBM ITSO Storage Systems Redbooks at Kforce Inc. March 2011  – Present (4 years 6 months) Tucson, Arizona Area Project Leader Project Leader IBM ITSO Storage Systems Redbooks at Kforce Inc. March 2011  – Present (4 years 6 months) Tucson, Arizona Area Storage Project Leader IBM Corporation February 2011  – Present (4 years 7 months) IBM Tucson Arizona Project Leader at the IBM International Technical Support Organization(ITSO), Tucson Arizona Center planning, developing, and leading the effort of running the residencies to create IBM Redbooks and Redpapers publications.  \n \nThe ITSO Redbooks team develops and delivers skills, technical know-how, and materials to IBM technical professionals, Business Partners, clients, and the marketplace in general. ITSO's Redbooks objective is to extend the understanding of IBM products and to accelerate the deployment and exploitation of IBM solutions Storage Project Leader IBM Corporation February 2011  – Present (4 years 7 months) IBM Tucson Arizona Project Leader at the IBM International Technical Support Organization(ITSO), Tucson Arizona Center planning, developing, and leading the effort of running the residencies to create IBM Redbooks and Redpapers publications.  \n \nThe ITSO Redbooks team develops and delivers skills, technical know-how, and materials to IBM technical professionals, Business Partners, clients, and the marketplace in general. ITSO's Redbooks objective is to extend the understanding of IBM products and to accelerate the deployment and exploitation of IBM solutions Software Engineer IBM Corporation April 2010  –  February 2011  (11 months) Software Engineer  \nPerform software test on IBM Tivoli Productivity Center Application to meet / overachieve release dates by developing and executing test cases, performing product installs, Windows and Linux System administration. \n \nIdentified, documented, and tested product defects for Tivoli Productivity Center Release 4.2 at a rate of 4.3% errors per test case which contributed to exceptional product quality.  \nApply AGILE software development methodologies utilizing IBM's Rational Software Suite; collaborating with international teams to identify product defects and issues early in the test cycle, while focusing on customer requirements and satisfaction. Software Engineer IBM Corporation April 2010  –  February 2011  (11 months) Software Engineer  \nPerform software test on IBM Tivoli Productivity Center Application to meet / overachieve release dates by developing and executing test cases, performing product installs, Windows and Linux System administration. \n \nIdentified, documented, and tested product defects for Tivoli Productivity Center Release 4.2 at a rate of 4.3% errors per test case which contributed to exceptional product quality.  \nApply AGILE software development methodologies utilizing IBM's Rational Software Suite; collaborating with international teams to identify product defects and issues early in the test cycle, while focusing on customer requirements and satisfaction. Software Engineer - Open Source Management IBM Corporation February 2006  –  February 2009  (3 years 1 month) Software Engineer : Open Source Management 2006 - 2009  \n \nAchieved exceptional product quality through effective management of open source processes and open source approval for over 40 IBM products. Conducted legal reviews of product Open Source Proposals to IBM Corporate to accurately identify pedigree of open source and gating issues that could stop release of new products. Open source objectives were accomplished through effective communications and negotiation of technical issues across work teams, which included Corporate Intelletual Property and General Legal Lawyers, Development, Program Managers, Product Test, Vendors, and the IBM Corporate Open Source Core team. \n \nPrepared Open Source Proposals and supporting documents for Legal / Open Source reviews to identify issues and to secure approval required to ship open source in IBM products.  \nAnalyzed/reviewed product licenses, third party licenses, product notice files and Certificate of Originality (COO) documentation. Provided improvements and revisions critical to shipping open source in IBM products.; Multitasked and adapted to changes in priority by seamlessly shifting between (6) or more concurrent projects on a moment's notice avoiding products missing their release dates. \nReduced required number of product open source due diligence checklist document approvals by 25%.  \nAwarded 'PUBLISH' by IBM Intellectual Properties (IP) Law for disclosure 'Method to Intelligently Handle Registered State Change'. \nReceived $2,000 'Bravo' award for excellent Open Source product support and 60% increase of approved open source proposals.  \nEarned (9) \"Thanks\" awards for dedication to product open source management quality and timely approvals and identification of open source related issues to ensure product release dates were met; often ahead of schedule. Software Engineer - Open Source Management IBM Corporation February 2006  –  February 2009  (3 years 1 month) Software Engineer : Open Source Management 2006 - 2009  \n \nAchieved exceptional product quality through effective management of open source processes and open source approval for over 40 IBM products. Conducted legal reviews of product Open Source Proposals to IBM Corporate to accurately identify pedigree of open source and gating issues that could stop release of new products. Open source objectives were accomplished through effective communications and negotiation of technical issues across work teams, which included Corporate Intelletual Property and General Legal Lawyers, Development, Program Managers, Product Test, Vendors, and the IBM Corporate Open Source Core team. \n \nPrepared Open Source Proposals and supporting documents for Legal / Open Source reviews to identify issues and to secure approval required to ship open source in IBM products.  \nAnalyzed/reviewed product licenses, third party licenses, product notice files and Certificate of Originality (COO) documentation. Provided improvements and revisions critical to shipping open source in IBM products.; Multitasked and adapted to changes in priority by seamlessly shifting between (6) or more concurrent projects on a moment's notice avoiding products missing their release dates. \nReduced required number of product open source due diligence checklist document approvals by 25%.  \nAwarded 'PUBLISH' by IBM Intellectual Properties (IP) Law for disclosure 'Method to Intelligently Handle Registered State Change'. \nReceived $2,000 'Bravo' award for excellent Open Source product support and 60% increase of approved open source proposals.  \nEarned (9) \"Thanks\" awards for dedication to product open source management quality and timely approvals and identification of open source related issues to ensure product release dates were met; often ahead of schedule. Mid-range tape Program Manager IBM Corporation February 2006  –  February 2008  (2 years 1 month) IBM Tucson Arizona Program Manager for IBM Mid-range Tape Subsystems Mid-range tape Program Manager IBM Corporation February 2006  –  February 2008  (2 years 1 month) IBM Tucson Arizona Program Manager for IBM Mid-range Tape Subsystems Program Manager IBM Corporation February 2006  –  February 2008  (2 years 1 month) Program Manager  \nProgram Manager for a diverse group of IBM professionals for automated tape products. Led in-house and Vendor Development, Product Test, Reliability Accessibility Serviceability (RAS), Procurement, Marketing, Manufacturing, Education, Human factors, and Publications teams in all phases of the Product development Life Cycle from initial product concept through design, implementation deployment, with high focus on meeting business objectives.  \n \nDeveloped and drove project schedules and dependencies throughout the product life cycle to release IBM's 1st modular, scalable tape library.  \nManaged multiple interdependent projects focusing specifically on developing cost estimates, project risk, scope, resource and financial management and project interdependencies contributing to revenue. \nImproved reliability test for the new modular tape library over it's predecessor by (1) million Mean Swaps  \nBefore Failure (MSBF) as compared to 200K MSBF for the previous product. Program Manager IBM Corporation February 2006  –  February 2008  (2 years 1 month) Program Manager  \nProgram Manager for a diverse group of IBM professionals for automated tape products. Led in-house and Vendor Development, Product Test, Reliability Accessibility Serviceability (RAS), Procurement, Marketing, Manufacturing, Education, Human factors, and Publications teams in all phases of the Product development Life Cycle from initial product concept through design, implementation deployment, with high focus on meeting business objectives.  \n \nDeveloped and drove project schedules and dependencies throughout the product life cycle to release IBM's 1st modular, scalable tape library.  \nManaged multiple interdependent projects focusing specifically on developing cost estimates, project risk, scope, resource and financial management and project interdependencies contributing to revenue. \nImproved reliability test for the new modular tape library over it's predecessor by (1) million Mean Swaps  \nBefore Failure (MSBF) as compared to 200K MSBF for the previous product. Software Engineer - Product Tester IBM Corporation January 1995  –  January 2003  (8 years 1 month) Worked in System Level Test as Lead Engineer to coordinate tests for Tape and Disk products to meet / overachieve release dates by planning resources, developing and executing test cases, performing product installs, participating in management meetings, and presenting status to Development, Program Management and Test Management.Debugged problems; assessed risks, and analyzed field problems, and test effectiveness.  \n \nImplemented Tivoli Storage Manager Application for first time in Product Test to test backup / retrieval of products in a customer-like environment. This effort assisted the Tivoli Test department in debug of Tivoli Storage Manager and in usage of disk / tape equipment. \nAwarded IBM 700 stock options for high performance in Product Test.  \nCollaborated with IBM Global Services to write a white paper on Tivoli Storage Manager \"Tape Sharing in a SAN Environment\" and with the IBM Almaden Redbook team to write a book on \"Storage Area Networks: Tape Future in Fabrics\". \nCo-authored a White Paper, which documented a disaster recovery solution. The solution emulated a 24 by-7customer production environment with test scenarios used to demonstrate the capability of IBM storage products to recover customer operations at a secondary site if the primary site failed, including resuming operations on the primary site after a failure. \nReceived $2,000 award for contributions as Tape Test lead and Field Build of suite of tape products. Software Engineer - Product Tester IBM Corporation January 1995  –  January 2003  (8 years 1 month) Worked in System Level Test as Lead Engineer to coordinate tests for Tape and Disk products to meet / overachieve release dates by planning resources, developing and executing test cases, performing product installs, participating in management meetings, and presenting status to Development, Program Management and Test Management.Debugged problems; assessed risks, and analyzed field problems, and test effectiveness.  \n \nImplemented Tivoli Storage Manager Application for first time in Product Test to test backup / retrieval of products in a customer-like environment. This effort assisted the Tivoli Test department in debug of Tivoli Storage Manager and in usage of disk / tape equipment. \nAwarded IBM 700 stock options for high performance in Product Test.  \nCollaborated with IBM Global Services to write a white paper on Tivoli Storage Manager \"Tape Sharing in a SAN Environment\" and with the IBM Almaden Redbook team to write a book on \"Storage Area Networks: Tape Future in Fabrics\". \nCo-authored a White Paper, which documented a disaster recovery solution. The solution emulated a 24 by-7customer production environment with test scenarios used to demonstrate the capability of IBM storage products to recover customer operations at a secondary site if the primary site failed, including resuming operations on the primary site after a failure. \nReceived $2,000 award for contributions as Tape Test lead and Field Build of suite of tape products. Associates Programmer IBM Corporation January 1985  –  January 1995  (10 years 1 month) Designed, implemented, and maintained the accounting, migrate/recall schemes, product build, and install  \nprograms for IBM backup / restore of customer data on tape and disk products. Maintained applications in  \nsupport of IBM manufacturing. Associates Programmer IBM Corporation January 1985  –  January 1995  (10 years 1 month) Designed, implemented, and maintained the accounting, migrate/recall schemes, product build, and install  \nprograms for IBM backup / restore of customer data on tape and disk products. Maintained applications in  \nsupport of IBM manufacturing. Skills Agile Methodologies Software Development Program Management Project Management Testing Software Project... Unix Storage Area Networks Integration Storage Software Documentation Troubleshooting Disaster Recovery ITIL Process Improvement SAN Windows IT Service Management Enterprise Architecture Management Virtualization Requirements Analysis Cloud Computing PMP Solution Architecture IT Management IT Strategy See 12+     See less Skills  Agile Methodologies Software Development Program Management Project Management Testing Software Project... Unix Storage Area Networks Integration Storage Software Documentation Troubleshooting Disaster Recovery ITIL Process Improvement SAN Windows IT Service Management Enterprise Architecture Management Virtualization Requirements Analysis Cloud Computing PMP Solution Architecture IT Management IT Strategy See 12+     See less Agile Methodologies Software Development Program Management Project Management Testing Software Project... Unix Storage Area Networks Integration Storage Software Documentation Troubleshooting Disaster Recovery ITIL Process Improvement SAN Windows IT Service Management Enterprise Architecture Management Virtualization Requirements Analysis Cloud Computing PMP Solution Architecture IT Management IT Strategy See 12+     See less Agile Methodologies Software Development Program Management Project Management Testing Software Project... Unix Storage Area Networks Integration Storage Software Documentation Troubleshooting Disaster Recovery ITIL Process Improvement SAN Windows IT Service Management Enterprise Architecture Management Virtualization Requirements Analysis Cloud Computing PMP Solution Architecture IT Management IT Strategy See 12+     See less Education University of Phoenix BS,  Business Information Systems 1996  – 1998 Pima Community College AAS,  Programmer / Analyst 1982  – 1985 University of Phoenix BS,  Business Information Systems 1996  – 1998 University of Phoenix BS,  Business Information Systems 1996  – 1998 University of Phoenix BS,  Business Information Systems 1996  – 1998 Pima Community College AAS,  Programmer / Analyst 1982  – 1985 Pima Community College AAS,  Programmer / Analyst 1982  – 1985 Pima Community College AAS,  Programmer / Analyst 1982  – 1985 ", "Experience Project Leader IBM Project Leader IBM Project Leader IBM Education University of Kerala 1994  – 1998 University of Kerala 1994  – 1998 University of Kerala 1994  – 1998 University of Kerala 1994  – 1998 ", "Experience Global Project Leader IBM Redbooks February 2008  – Present (7 years 7 months) IBM GTS Global Project Leader IBM 1986  – Present (29 years) Global Project Leader IBM Redbooks February 2008  – Present (7 years 7 months) Global Project Leader IBM Redbooks February 2008  – Present (7 years 7 months) IBM GTS Global Project Leader IBM 1986  – Present (29 years) IBM GTS Global Project Leader IBM 1986  – Present (29 years) Skills Management Strategy Outsourcing Leadership Product Development Sales Change Management Business Process... Skills  Management Strategy Outsourcing Leadership Product Development Sales Change Management Business Process... Management Strategy Outsourcing Leadership Product Development Sales Change Management Business Process... Management Strategy Outsourcing Leadership Product Development Sales Change Management Business Process... Education Western Connecticut State University Bachelor of Arts (BA),  Finance , General 1983  – 1986 Activities and Societies:  Alpha Xi Delta ,  Marketing Association Western Connecticut State University Bachelor of Arts (BA),  Finance , General 1983  – 1986 Activities and Societies:  Alpha Xi Delta ,  Marketing Association Western Connecticut State University Bachelor of Arts (BA),  Finance , General 1983  – 1986 Activities and Societies:  Alpha Xi Delta ,  Marketing Association Western Connecticut State University Bachelor of Arts (BA),  Finance , General 1983  – 1986 Activities and Societies:  Alpha Xi Delta ,  Marketing Association ", "Experience project leader IBM project leader IBM project leader IBM ", "Experience Asean Leader, Project Management, Transition & Transformation, IBM Certified Senior Program Manager IBM January 2011  – Present (4 years 8 months) IBM Singapore Manage Complex Programs and multi-million dollar global projects across various industries, complex technical transitions, transformations, engagement services to help in acquiring new business, Business Transitions and Transformation across Asean and APAC region. Head the Project Services and Project Transitions team in ASEAN region. Project Director IBM Singapore, 2013  –  2013  (less than a year) Singapore Under Project Director's capacity, managed and successfully delivered approximately 35 projects under Innovation program for a client based in AU. Projects spread across APAC region with PMs spread over 4 countries from AU to India, Malaysia and US. Portfolio Manager, Project Management, Transitions and Transformation IBM May 2008  –  January 2011  (2 years 9 months) Transition manager, Asean IBM Singapore Pte Ltd June 2008  –  June 2009  (1 year 1 month) Director, Project Implementation and Support Abacus International Pte Ltd., 1994  –  2008  (14 years) Director, Implementation and Support Abacus International 1994  –  2008  (14 years) Asst. Manager Abacus Distribution Systems 1995  –  1998  (3 years) Snr. Systems Engineer Pertech Computers Pte Ltd., 1991  –  1994  (3 years) Senior Systems Engineer Pertech Computers Ltd. 1991  –  1994  (3 years) Asean Leader, Project Management, Transition & Transformation, IBM Certified Senior Program Manager IBM January 2011  – Present (4 years 8 months) IBM Singapore Manage Complex Programs and multi-million dollar global projects across various industries, complex technical transitions, transformations, engagement services to help in acquiring new business, Business Transitions and Transformation across Asean and APAC region. Head the Project Services and Project Transitions team in ASEAN region. Asean Leader, Project Management, Transition & Transformation, IBM Certified Senior Program Manager IBM January 2011  – Present (4 years 8 months) IBM Singapore Manage Complex Programs and multi-million dollar global projects across various industries, complex technical transitions, transformations, engagement services to help in acquiring new business, Business Transitions and Transformation across Asean and APAC region. Head the Project Services and Project Transitions team in ASEAN region. Project Director IBM Singapore, 2013  –  2013  (less than a year) Singapore Under Project Director's capacity, managed and successfully delivered approximately 35 projects under Innovation program for a client based in AU. Projects spread across APAC region with PMs spread over 4 countries from AU to India, Malaysia and US. Project Director IBM Singapore, 2013  –  2013  (less than a year) Singapore Under Project Director's capacity, managed and successfully delivered approximately 35 projects under Innovation program for a client based in AU. Projects spread across APAC region with PMs spread over 4 countries from AU to India, Malaysia and US. Portfolio Manager, Project Management, Transitions and Transformation IBM May 2008  –  January 2011  (2 years 9 months) Portfolio Manager, Project Management, Transitions and Transformation IBM May 2008  –  January 2011  (2 years 9 months) Transition manager, Asean IBM Singapore Pte Ltd June 2008  –  June 2009  (1 year 1 month) Transition manager, Asean IBM Singapore Pte Ltd June 2008  –  June 2009  (1 year 1 month) Director, Project Implementation and Support Abacus International Pte Ltd., 1994  –  2008  (14 years) Director, Project Implementation and Support Abacus International Pte Ltd., 1994  –  2008  (14 years) Director, Implementation and Support Abacus International 1994  –  2008  (14 years) Director, Implementation and Support Abacus International 1994  –  2008  (14 years) Asst. Manager Abacus Distribution Systems 1995  –  1998  (3 years) Asst. Manager Abacus Distribution Systems 1995  –  1998  (3 years) Snr. Systems Engineer Pertech Computers Pte Ltd., 1991  –  1994  (3 years) Snr. Systems Engineer Pertech Computers Pte Ltd., 1991  –  1994  (3 years) Senior Systems Engineer Pertech Computers Ltd. 1991  –  1994  (3 years) Senior Systems Engineer Pertech Computers Ltd. 1991  –  1994  (3 years) Skills Program Management IT Service Management Business Analysis Vendor Management Software Project... IT Management IT Strategy Service Delivery Leadership PMP Management Project Management ITIL Skills  Program Management IT Service Management Business Analysis Vendor Management Software Project... IT Management IT Strategy Service Delivery Leadership PMP Management Project Management ITIL Program Management IT Service Management Business Analysis Vendor Management Software Project... IT Management IT Strategy Service Delivery Leadership PMP Management Project Management ITIL Program Management IT Service Management Business Analysis Vendor Management Software Project... IT Management IT Strategy Service Delivery Leadership PMP Management Project Management ITIL Education Bachelor of Engineering Bachelor of Engineering (B.E.),  Computer Science and Engineering 1987  – 1991 Activities and Societies:  Presented Whitepaper on Digital Voice; Voice over X25 ,  XPAD; Member of India Computer Society R. V. College of Engineering, Bangalore Computer Science Engineering,  Computer Software and Hardware Engineering 1987  – 1991 Completed 4 years professional Engineering degree in Computer Science and Engineering Bachelor of Engineering Bachelor of Engineering (B.E.),  Computer Science and Engineering 1987  – 1991 Activities and Societies:  Presented Whitepaper on Digital Voice; Voice over X25 ,  XPAD; Member of India Computer Society Bachelor of Engineering Bachelor of Engineering (B.E.),  Computer Science and Engineering 1987  – 1991 Activities and Societies:  Presented Whitepaper on Digital Voice; Voice over X25 ,  XPAD; Member of India Computer Society Bachelor of Engineering Bachelor of Engineering (B.E.),  Computer Science and Engineering 1987  – 1991 Activities and Societies:  Presented Whitepaper on Digital Voice; Voice over X25 ,  XPAD; Member of India Computer Society R. V. College of Engineering, Bangalore Computer Science Engineering,  Computer Software and Hardware Engineering 1987  – 1991 Completed 4 years professional Engineering degree in Computer Science and Engineering R. V. College of Engineering, Bangalore Computer Science Engineering,  Computer Software and Hardware Engineering 1987  – 1991 Completed 4 years professional Engineering degree in Computer Science and Engineering R. V. College of Engineering, Bangalore Computer Science Engineering,  Computer Software and Hardware Engineering 1987  – 1991 Completed 4 years professional Engineering degree in Computer Science and Engineering ", "Experience Project Leader IBM System Analyst Allianz Insurance PLC March 2009  –  May 2010  (1 year 3 months) System Analyst Hexaware Technologies October 2004  –  February 2009  (4 years 5 months) Project Leader IBM Project Leader IBM System Analyst Allianz Insurance PLC March 2009  –  May 2010  (1 year 3 months) System Analyst Allianz Insurance PLC March 2009  –  May 2010  (1 year 3 months) System Analyst Hexaware Technologies October 2004  –  February 2009  (4 years 5 months) System Analyst Hexaware Technologies October 2004  –  February 2009  (4 years 5 months) Skills DB2 SQL PL/1 JCL VSAM Mainframe SDLC COBOL Requirements Analysis CICS Requirements Gathering Project Delivery CMMI Agile User Acceptance Testing Waterfall See 1+     See less Skills  DB2 SQL PL/1 JCL VSAM Mainframe SDLC COBOL Requirements Analysis CICS Requirements Gathering Project Delivery CMMI Agile User Acceptance Testing Waterfall See 1+     See less DB2 SQL PL/1 JCL VSAM Mainframe SDLC COBOL Requirements Analysis CICS Requirements Gathering Project Delivery CMMI Agile User Acceptance Testing Waterfall See 1+     See less DB2 SQL PL/1 JCL VSAM Mainframe SDLC COBOL Requirements Analysis CICS Requirements Gathering Project Delivery CMMI Agile User Acceptance Testing Waterfall See 1+     See less Education Mahatma Gandhi University B-Tech,  Electronics and Communication Enginnering 1999  – 2003 Mahatma Gandhi University B-Tech,  Electronics and Communication Enginnering 1999  – 2003 Mahatma Gandhi University B-Tech,  Electronics and Communication Enginnering 1999  – 2003 Mahatma Gandhi University B-Tech,  Electronics and Communication Enginnering 1999  – 2003 "]}