{"position": "Project Manager - Contractor", "company": "Intel Corporation", "profiles": ["Summary •\tExperienced in a wide range of industries, including: Consumer/Custom Electronics, Medical, Oil/Gas Industry, Telecommunications, and Chip Fabrication. \n•\tProficient in full life cycle of firmware development from requirements to initial board bring up and integration through development and testing/verification of the application to release and maintenance. Specialties:•\tExcellent understanding of development and testing process from contributing to product development in a variety of roles: Software Manager, Project Manager, Sr. Software Engineer, Product Engineer, Sr. Software Test Engineer, Scrum Master, and Configuration Manager. Summary •\tExperienced in a wide range of industries, including: Consumer/Custom Electronics, Medical, Oil/Gas Industry, Telecommunications, and Chip Fabrication. \n•\tProficient in full life cycle of firmware development from requirements to initial board bring up and integration through development and testing/verification of the application to release and maintenance. Specialties:•\tExcellent understanding of development and testing process from contributing to product development in a variety of roles: Software Manager, Project Manager, Sr. Software Engineer, Product Engineer, Sr. Software Test Engineer, Scrum Master, and Configuration Manager. •\tExperienced in a wide range of industries, including: Consumer/Custom Electronics, Medical, Oil/Gas Industry, Telecommunications, and Chip Fabrication. \n•\tProficient in full life cycle of firmware development from requirements to initial board bring up and integration through development and testing/verification of the application to release and maintenance. Specialties:•\tExcellent understanding of development and testing process from contributing to product development in a variety of roles: Software Manager, Project Manager, Sr. Software Engineer, Product Engineer, Sr. Software Test Engineer, Scrum Master, and Configuration Manager. •\tExperienced in a wide range of industries, including: Consumer/Custom Electronics, Medical, Oil/Gas Industry, Telecommunications, and Chip Fabrication. \n•\tProficient in full life cycle of firmware development from requirements to initial board bring up and integration through development and testing/verification of the application to release and maintenance. Specialties:•\tExcellent understanding of development and testing process from contributing to product development in a variety of roles: Software Manager, Project Manager, Sr. Software Engineer, Product Engineer, Sr. Software Test Engineer, Scrum Master, and Configuration Manager. Experience Staff Program Manager Seagate Technology October 2013  – Present (1 year 11 months) Longmont, CO Working with a variety of firmware teams to bring advanced disk drive and hybrid drive products to market using Agile practices. Owner Cay Sea Media October 2011  – Present (3 years 11 months) boulder, co Media company involved in the production and distributions of comic books, e-books, and children's books. Scrum Master (Agile Software Project Manager) (contractor) Intel Corporation June 2012  –  October 2013  (1 year 5 months) Longmont •\tScrum Master for over 20 developers and validation engineers (local and remote) in two functional teams developing the latest solid state hard drives for Intel.  \n•\tWorked closely with Program Managers on resource allocation, prioritization, and scheduling over 5 programs worked in parallel.  \n•\tDeveloped multi-Sprint release plans to track expected burn down of work to each milestone within the program. \n•\tWorked with Functional Managers, Scrum Technical Leads, and Team Technical Leads to map out team short term and long term objectives. \n•\tDeveloped automated reports and queries into the Jira system using the REST interface and Groovy and Python scripts. Sr. Firmware Engineer / Scrum Master Tendril November 2011  –  May 2012  (7 months) Working on the firmware side of Tendril's energy solution.  \n•\tDeveloped and integrated the new Smart Outlet into existing devices framework. \n•\tDeveloped calibration and customized calibration scripting for the Smart Outlet \n•\tWorked of various defects and sustaining issues as they arose. \n•\tRepresented firmware engineer during sustaining rotation. \n•\tProvided leadership and guidance in scrum framework as a scrum master \n•\tWorked closely with Product Owners and Product Management on firmware issues. \n•\tHelped lead and focus development planning and estimation meetings. Sr. System Integration Engineer Tendril June 2009  –  November 2011  (2 years 6 months) •\tDeveloped Test Plans, Test Cases, and executed test on a Zigbee Smart Energy devices. \n•\tWorked closely with Firmware and Software Engineering to integrate new features into system. \n•\tDeveloped automated tests using Selenium, Fitness, Slim, Groovy, and Java. \n•\tDesigned User Interface for PDA portion of a Zigbee Load Control Device and worked with third party developers defining the desired behaviors of that device. \n•\tWorked with Partner Management in the testing, integration, and debugging of a Smart Energy module developed by General Electric. \n•\tWorked with Product Management and Firmware Engineering in the definition of LED, Duty Cycle, and Minimum Off Time behavior on devices. Principal Software Test Engineer (Contract) Medtronic August 2008  –  June 2009  (11 months) •\tLead Software Test Engineer for RF Testing Section. \n•\tDeveloped Test Cases and Test Designs Documents for 802.15.4 based insulin delivery system. \n•\tDeveloped web interface to MySQL database for tracking development and status of test in Linux.  \n•\tWrote test scripts for automated testing of system. \n•\tUsed DOORS Requirement Management and Traceability Tool, TestTrack Bug Tracking system, Surround revision control, and MS Project. \n•\tContributed to development of Test Plan and System Validation Plan. Sr. Software Test Engineer (Contract) InnerWireless October 2007  –  April 2008  (7 months) Performed installation, upgrade and preliminary testing for 802.15.4 wireless asset location system. \nDeveloped system initialization/configuration tools for Distributed Antenna System Integrity Monitoring(DASIM) software.  \nWrote Test Plan and System Validation Plan for DASIM.  \nExecuted tests for system and worked with software engineers to eliminate failure conditions and verify system functionality. Lead Firmware Engineer (Contract) AMX April 2005  –  October 2007  (2 years 7 months) Developed Zigbee components and Zigbee to device interfaces for NetLinx® ZigBee Gateway, NetLinx® ZigBee Repeater, Mio Modero R-4 Zigbee remote touch panel products. Development included use of Motorola HC08 and Ember 250 processors communicating to connected devices using SPI bus and communicating over the air using Zigbee in a mesh network.  \nDeveloped method of over the air upgrade across multiple Zigbee nodes. \nPerformed Zigbee interference testing for 802.11B/G and Class 2 Bluetooth. \nCharacterized range, throughput, and multi-node transmission delays for Zigbee products. \nDeveloped Motion JPEG (MJPEG) configuration and video serving routines for a product running embedded Linux on an OMAP 2430 processor.  \nDeveloped server side embedded web server for the NetLinx® ZigBee Gateway, MET-ECOM-D, MAX-CSE, and MAX-CSD10 products. Project Manager / Sr. Software Engineer Atrana Solutions April 2004  –  December 2004  (9 months) Developed software applications for Verifone and Hypercom credit/debit/ID card terminals, which are based on the Motorola 68k and Zilog Z80 processors respectively.  \nWrote Functional and Text LCD User Interface (UI) Specifications. \nWorked with marketing, client, and external contractors on project involving modification for financial terminal device. \nWorked with software vendors involving licensing and bug tracking. Senior Software Engineer (contractor) D.E. Software Consulting November 2003  –  April 2004  (6 months) Developed remote backup software using .ZIP compression, 3DES and AES file encryption and transferred backup over SSL connection. \nClient side development using C# .NET, with server side using Apache on a Linux platform with PHP, and HTML. Software Engineer (Independent Contractor) Wavetrix July 2003  –  October 2003  (4 months) Developed software for WinCE PDA for PC based traffic monitoring system, using MS Embedded C++ \nDeveloped software for Linux-based home network appliance, using PHP, Perl, the LWP module for Perl. Configuration Manager / Acting Software Engineering Manager Uniden America Corp September 2001  –  June 2003  (1 year 10 months) Development of a PowerPC 860SAR based VoATM gateway whose' development began at Broadband Gateway and began development on new data home networking products.  \nDeveloped features including: user-defined static routes, Syslog, email logging, routing information protocol (RIP), system configuration, and various voice features. \nProject Management role specific to software group. Involved project scheduling, tasking of software group, research of new products and competitor's products, writing of specifications, and coordinating with Hardware and Test groups. \nManaged software revision control system (CVS), revision control server, defect tracking system (DevTrack), performed backups of databases, and software build process. \nManaged software engineering group from 8/2002 to 1/2003, worked with Hardware, Test, and Marketing groups. Software Engineer Broadband Gateways September 2000  –  June 2001  (10 months) Lead developer for 2.4Ghz handset LCD MMI and modified Call Processing software as part of the port from 900Mhz to 2.4Ghz for a PowerPC 860SAR based VoATM gateway system. \nDeveloped scripts, implemented new configuration management procedures and managed CVS software revision control system on Linux for over 20 developers across four development groups. Software/Firmware Engineer (Contractor) Software Remodeling August 1999  –  September 2000  (1 year 2 months) Worked for a variety of companies through this consulting group. \nFirmware Engineer, Polycom, Inc. \n•\tDeveloped configuration software, call manager simulation, and LCD UI features for Voice over IP (VoIP) conference call phone using C in VxWorks. \nTest Engineer, Marconi Communications \n•\tPrimarily worked on UDP over ATM on T1 copper system.  \n•\tDeveloped test routines using ADTECH AX/4000 broadband test system using TCL/TK. \nSoftware Engineer, Biomax Technologies Inc.Columbia, Canada \n•\tDeveloped and implemented format for tasks message passing and proxy formats and rules.  \n•\tDeveloped the user interface, fault detection, recovery, and logging parts of the system. \n•\tDeveloped UI and inter-process message passing routines for high reliability heart transplant diagnostics system.  \nFirmware Engineer, Baxter Health Care \n•\tDeveloped configuration software for multi-processor plasma separation unit. Development included automatic application update, program slave processors, and backup previous versions. Software/Product Engineer (Contractor) B.Braun August 1997  –  August 1999  (2 years 1 month) Developed firmware for medical infusion pumps, simulations for new products, as well as being the Product Engineer for all Home Infusion Pump products, and provided software expertise to aid the High Volume Infusion Pump and Solution Mixing Product Engineers. Lead Software Engineer (Contractor) Sysconix March 1997  –  August 1997  (6 months) Software and Integration lead for silicon wafer testing product. Software Engineer (Contractor) Schlumberger May 1995  –  February 1997  (1 year 10 months) Developed seismic oil exploration software for Schlumberger Geco-Prakla Software/Training Consultant Sears, Roebuck and Company February 1991  –  January 1997  (6 years) Trained end users and staff on general computer concepts and on the use of a variety of bundled applications. Software Engineer Digital Logging Products March 1994  –  May 1995  (1 year 3 months) Developed down hole oil well logging and control software. Staff Program Manager Seagate Technology October 2013  – Present (1 year 11 months) Longmont, CO Working with a variety of firmware teams to bring advanced disk drive and hybrid drive products to market using Agile practices. Staff Program Manager Seagate Technology October 2013  – Present (1 year 11 months) Longmont, CO Working with a variety of firmware teams to bring advanced disk drive and hybrid drive products to market using Agile practices. Owner Cay Sea Media October 2011  – Present (3 years 11 months) boulder, co Media company involved in the production and distributions of comic books, e-books, and children's books. Owner Cay Sea Media October 2011  – Present (3 years 11 months) boulder, co Media company involved in the production and distributions of comic books, e-books, and children's books. Scrum Master (Agile Software Project Manager) (contractor) Intel Corporation June 2012  –  October 2013  (1 year 5 months) Longmont •\tScrum Master for over 20 developers and validation engineers (local and remote) in two functional teams developing the latest solid state hard drives for Intel.  \n•\tWorked closely with Program Managers on resource allocation, prioritization, and scheduling over 5 programs worked in parallel.  \n•\tDeveloped multi-Sprint release plans to track expected burn down of work to each milestone within the program. \n•\tWorked with Functional Managers, Scrum Technical Leads, and Team Technical Leads to map out team short term and long term objectives. \n•\tDeveloped automated reports and queries into the Jira system using the REST interface and Groovy and Python scripts. Scrum Master (Agile Software Project Manager) (contractor) Intel Corporation June 2012  –  October 2013  (1 year 5 months) Longmont •\tScrum Master for over 20 developers and validation engineers (local and remote) in two functional teams developing the latest solid state hard drives for Intel.  \n•\tWorked closely with Program Managers on resource allocation, prioritization, and scheduling over 5 programs worked in parallel.  \n•\tDeveloped multi-Sprint release plans to track expected burn down of work to each milestone within the program. \n•\tWorked with Functional Managers, Scrum Technical Leads, and Team Technical Leads to map out team short term and long term objectives. \n•\tDeveloped automated reports and queries into the Jira system using the REST interface and Groovy and Python scripts. Sr. Firmware Engineer / Scrum Master Tendril November 2011  –  May 2012  (7 months) Working on the firmware side of Tendril's energy solution.  \n•\tDeveloped and integrated the new Smart Outlet into existing devices framework. \n•\tDeveloped calibration and customized calibration scripting for the Smart Outlet \n•\tWorked of various defects and sustaining issues as they arose. \n•\tRepresented firmware engineer during sustaining rotation. \n•\tProvided leadership and guidance in scrum framework as a scrum master \n•\tWorked closely with Product Owners and Product Management on firmware issues. \n•\tHelped lead and focus development planning and estimation meetings. Sr. Firmware Engineer / Scrum Master Tendril November 2011  –  May 2012  (7 months) Working on the firmware side of Tendril's energy solution.  \n•\tDeveloped and integrated the new Smart Outlet into existing devices framework. \n•\tDeveloped calibration and customized calibration scripting for the Smart Outlet \n•\tWorked of various defects and sustaining issues as they arose. \n•\tRepresented firmware engineer during sustaining rotation. \n•\tProvided leadership and guidance in scrum framework as a scrum master \n•\tWorked closely with Product Owners and Product Management on firmware issues. \n•\tHelped lead and focus development planning and estimation meetings. Sr. System Integration Engineer Tendril June 2009  –  November 2011  (2 years 6 months) •\tDeveloped Test Plans, Test Cases, and executed test on a Zigbee Smart Energy devices. \n•\tWorked closely with Firmware and Software Engineering to integrate new features into system. \n•\tDeveloped automated tests using Selenium, Fitness, Slim, Groovy, and Java. \n•\tDesigned User Interface for PDA portion of a Zigbee Load Control Device and worked with third party developers defining the desired behaviors of that device. \n•\tWorked with Partner Management in the testing, integration, and debugging of a Smart Energy module developed by General Electric. \n•\tWorked with Product Management and Firmware Engineering in the definition of LED, Duty Cycle, and Minimum Off Time behavior on devices. Sr. System Integration Engineer Tendril June 2009  –  November 2011  (2 years 6 months) •\tDeveloped Test Plans, Test Cases, and executed test on a Zigbee Smart Energy devices. \n•\tWorked closely with Firmware and Software Engineering to integrate new features into system. \n•\tDeveloped automated tests using Selenium, Fitness, Slim, Groovy, and Java. \n•\tDesigned User Interface for PDA portion of a Zigbee Load Control Device and worked with third party developers defining the desired behaviors of that device. \n•\tWorked with Partner Management in the testing, integration, and debugging of a Smart Energy module developed by General Electric. \n•\tWorked with Product Management and Firmware Engineering in the definition of LED, Duty Cycle, and Minimum Off Time behavior on devices. Principal Software Test Engineer (Contract) Medtronic August 2008  –  June 2009  (11 months) •\tLead Software Test Engineer for RF Testing Section. \n•\tDeveloped Test Cases and Test Designs Documents for 802.15.4 based insulin delivery system. \n•\tDeveloped web interface to MySQL database for tracking development and status of test in Linux.  \n•\tWrote test scripts for automated testing of system. \n•\tUsed DOORS Requirement Management and Traceability Tool, TestTrack Bug Tracking system, Surround revision control, and MS Project. \n•\tContributed to development of Test Plan and System Validation Plan. Principal Software Test Engineer (Contract) Medtronic August 2008  –  June 2009  (11 months) •\tLead Software Test Engineer for RF Testing Section. \n•\tDeveloped Test Cases and Test Designs Documents for 802.15.4 based insulin delivery system. \n•\tDeveloped web interface to MySQL database for tracking development and status of test in Linux.  \n•\tWrote test scripts for automated testing of system. \n•\tUsed DOORS Requirement Management and Traceability Tool, TestTrack Bug Tracking system, Surround revision control, and MS Project. \n•\tContributed to development of Test Plan and System Validation Plan. Sr. Software Test Engineer (Contract) InnerWireless October 2007  –  April 2008  (7 months) Performed installation, upgrade and preliminary testing for 802.15.4 wireless asset location system. \nDeveloped system initialization/configuration tools for Distributed Antenna System Integrity Monitoring(DASIM) software.  \nWrote Test Plan and System Validation Plan for DASIM.  \nExecuted tests for system and worked with software engineers to eliminate failure conditions and verify system functionality. Sr. Software Test Engineer (Contract) InnerWireless October 2007  –  April 2008  (7 months) Performed installation, upgrade and preliminary testing for 802.15.4 wireless asset location system. \nDeveloped system initialization/configuration tools for Distributed Antenna System Integrity Monitoring(DASIM) software.  \nWrote Test Plan and System Validation Plan for DASIM.  \nExecuted tests for system and worked with software engineers to eliminate failure conditions and verify system functionality. Lead Firmware Engineer (Contract) AMX April 2005  –  October 2007  (2 years 7 months) Developed Zigbee components and Zigbee to device interfaces for NetLinx® ZigBee Gateway, NetLinx® ZigBee Repeater, Mio Modero R-4 Zigbee remote touch panel products. Development included use of Motorola HC08 and Ember 250 processors communicating to connected devices using SPI bus and communicating over the air using Zigbee in a mesh network.  \nDeveloped method of over the air upgrade across multiple Zigbee nodes. \nPerformed Zigbee interference testing for 802.11B/G and Class 2 Bluetooth. \nCharacterized range, throughput, and multi-node transmission delays for Zigbee products. \nDeveloped Motion JPEG (MJPEG) configuration and video serving routines for a product running embedded Linux on an OMAP 2430 processor.  \nDeveloped server side embedded web server for the NetLinx® ZigBee Gateway, MET-ECOM-D, MAX-CSE, and MAX-CSD10 products. Lead Firmware Engineer (Contract) AMX April 2005  –  October 2007  (2 years 7 months) Developed Zigbee components and Zigbee to device interfaces for NetLinx® ZigBee Gateway, NetLinx® ZigBee Repeater, Mio Modero R-4 Zigbee remote touch panel products. Development included use of Motorola HC08 and Ember 250 processors communicating to connected devices using SPI bus and communicating over the air using Zigbee in a mesh network.  \nDeveloped method of over the air upgrade across multiple Zigbee nodes. \nPerformed Zigbee interference testing for 802.11B/G and Class 2 Bluetooth. \nCharacterized range, throughput, and multi-node transmission delays for Zigbee products. \nDeveloped Motion JPEG (MJPEG) configuration and video serving routines for a product running embedded Linux on an OMAP 2430 processor.  \nDeveloped server side embedded web server for the NetLinx® ZigBee Gateway, MET-ECOM-D, MAX-CSE, and MAX-CSD10 products. Project Manager / Sr. Software Engineer Atrana Solutions April 2004  –  December 2004  (9 months) Developed software applications for Verifone and Hypercom credit/debit/ID card terminals, which are based on the Motorola 68k and Zilog Z80 processors respectively.  \nWrote Functional and Text LCD User Interface (UI) Specifications. \nWorked with marketing, client, and external contractors on project involving modification for financial terminal device. \nWorked with software vendors involving licensing and bug tracking. Project Manager / Sr. Software Engineer Atrana Solutions April 2004  –  December 2004  (9 months) Developed software applications for Verifone and Hypercom credit/debit/ID card terminals, which are based on the Motorola 68k and Zilog Z80 processors respectively.  \nWrote Functional and Text LCD User Interface (UI) Specifications. \nWorked with marketing, client, and external contractors on project involving modification for financial terminal device. \nWorked with software vendors involving licensing and bug tracking. Senior Software Engineer (contractor) D.E. Software Consulting November 2003  –  April 2004  (6 months) Developed remote backup software using .ZIP compression, 3DES and AES file encryption and transferred backup over SSL connection. \nClient side development using C# .NET, with server side using Apache on a Linux platform with PHP, and HTML. Senior Software Engineer (contractor) D.E. Software Consulting November 2003  –  April 2004  (6 months) Developed remote backup software using .ZIP compression, 3DES and AES file encryption and transferred backup over SSL connection. \nClient side development using C# .NET, with server side using Apache on a Linux platform with PHP, and HTML. Software Engineer (Independent Contractor) Wavetrix July 2003  –  October 2003  (4 months) Developed software for WinCE PDA for PC based traffic monitoring system, using MS Embedded C++ \nDeveloped software for Linux-based home network appliance, using PHP, Perl, the LWP module for Perl. Software Engineer (Independent Contractor) Wavetrix July 2003  –  October 2003  (4 months) Developed software for WinCE PDA for PC based traffic monitoring system, using MS Embedded C++ \nDeveloped software for Linux-based home network appliance, using PHP, Perl, the LWP module for Perl. Configuration Manager / Acting Software Engineering Manager Uniden America Corp September 2001  –  June 2003  (1 year 10 months) Development of a PowerPC 860SAR based VoATM gateway whose' development began at Broadband Gateway and began development on new data home networking products.  \nDeveloped features including: user-defined static routes, Syslog, email logging, routing information protocol (RIP), system configuration, and various voice features. \nProject Management role specific to software group. Involved project scheduling, tasking of software group, research of new products and competitor's products, writing of specifications, and coordinating with Hardware and Test groups. \nManaged software revision control system (CVS), revision control server, defect tracking system (DevTrack), performed backups of databases, and software build process. \nManaged software engineering group from 8/2002 to 1/2003, worked with Hardware, Test, and Marketing groups. Configuration Manager / Acting Software Engineering Manager Uniden America Corp September 2001  –  June 2003  (1 year 10 months) Development of a PowerPC 860SAR based VoATM gateway whose' development began at Broadband Gateway and began development on new data home networking products.  \nDeveloped features including: user-defined static routes, Syslog, email logging, routing information protocol (RIP), system configuration, and various voice features. \nProject Management role specific to software group. Involved project scheduling, tasking of software group, research of new products and competitor's products, writing of specifications, and coordinating with Hardware and Test groups. \nManaged software revision control system (CVS), revision control server, defect tracking system (DevTrack), performed backups of databases, and software build process. \nManaged software engineering group from 8/2002 to 1/2003, worked with Hardware, Test, and Marketing groups. Software Engineer Broadband Gateways September 2000  –  June 2001  (10 months) Lead developer for 2.4Ghz handset LCD MMI and modified Call Processing software as part of the port from 900Mhz to 2.4Ghz for a PowerPC 860SAR based VoATM gateway system. \nDeveloped scripts, implemented new configuration management procedures and managed CVS software revision control system on Linux for over 20 developers across four development groups. Software Engineer Broadband Gateways September 2000  –  June 2001  (10 months) Lead developer for 2.4Ghz handset LCD MMI and modified Call Processing software as part of the port from 900Mhz to 2.4Ghz for a PowerPC 860SAR based VoATM gateway system. \nDeveloped scripts, implemented new configuration management procedures and managed CVS software revision control system on Linux for over 20 developers across four development groups. Software/Firmware Engineer (Contractor) Software Remodeling August 1999  –  September 2000  (1 year 2 months) Worked for a variety of companies through this consulting group. \nFirmware Engineer, Polycom, Inc. \n•\tDeveloped configuration software, call manager simulation, and LCD UI features for Voice over IP (VoIP) conference call phone using C in VxWorks. \nTest Engineer, Marconi Communications \n•\tPrimarily worked on UDP over ATM on T1 copper system.  \n•\tDeveloped test routines using ADTECH AX/4000 broadband test system using TCL/TK. \nSoftware Engineer, Biomax Technologies Inc.Columbia, Canada \n•\tDeveloped and implemented format for tasks message passing and proxy formats and rules.  \n•\tDeveloped the user interface, fault detection, recovery, and logging parts of the system. \n•\tDeveloped UI and inter-process message passing routines for high reliability heart transplant diagnostics system.  \nFirmware Engineer, Baxter Health Care \n•\tDeveloped configuration software for multi-processor plasma separation unit. Development included automatic application update, program slave processors, and backup previous versions. Software/Firmware Engineer (Contractor) Software Remodeling August 1999  –  September 2000  (1 year 2 months) Worked for a variety of companies through this consulting group. \nFirmware Engineer, Polycom, Inc. \n•\tDeveloped configuration software, call manager simulation, and LCD UI features for Voice over IP (VoIP) conference call phone using C in VxWorks. \nTest Engineer, Marconi Communications \n•\tPrimarily worked on UDP over ATM on T1 copper system.  \n•\tDeveloped test routines using ADTECH AX/4000 broadband test system using TCL/TK. \nSoftware Engineer, Biomax Technologies Inc.Columbia, Canada \n•\tDeveloped and implemented format for tasks message passing and proxy formats and rules.  \n•\tDeveloped the user interface, fault detection, recovery, and logging parts of the system. \n•\tDeveloped UI and inter-process message passing routines for high reliability heart transplant diagnostics system.  \nFirmware Engineer, Baxter Health Care \n•\tDeveloped configuration software for multi-processor plasma separation unit. Development included automatic application update, program slave processors, and backup previous versions. Software/Product Engineer (Contractor) B.Braun August 1997  –  August 1999  (2 years 1 month) Developed firmware for medical infusion pumps, simulations for new products, as well as being the Product Engineer for all Home Infusion Pump products, and provided software expertise to aid the High Volume Infusion Pump and Solution Mixing Product Engineers. Software/Product Engineer (Contractor) B.Braun August 1997  –  August 1999  (2 years 1 month) Developed firmware for medical infusion pumps, simulations for new products, as well as being the Product Engineer for all Home Infusion Pump products, and provided software expertise to aid the High Volume Infusion Pump and Solution Mixing Product Engineers. Lead Software Engineer (Contractor) Sysconix March 1997  –  August 1997  (6 months) Software and Integration lead for silicon wafer testing product. Lead Software Engineer (Contractor) Sysconix March 1997  –  August 1997  (6 months) Software and Integration lead for silicon wafer testing product. Software Engineer (Contractor) Schlumberger May 1995  –  February 1997  (1 year 10 months) Developed seismic oil exploration software for Schlumberger Geco-Prakla Software Engineer (Contractor) Schlumberger May 1995  –  February 1997  (1 year 10 months) Developed seismic oil exploration software for Schlumberger Geco-Prakla Software/Training Consultant Sears, Roebuck and Company February 1991  –  January 1997  (6 years) Trained end users and staff on general computer concepts and on the use of a variety of bundled applications. Software/Training Consultant Sears, Roebuck and Company February 1991  –  January 1997  (6 years) Trained end users and staff on general computer concepts and on the use of a variety of bundled applications. Software Engineer Digital Logging Products March 1994  –  May 1995  (1 year 3 months) Developed down hole oil well logging and control software. Software Engineer Digital Logging Products March 1994  –  May 1995  (1 year 3 months) Developed down hole oil well logging and control software. Skills Configuration Management Testing Telecommunications Device Drivers Firmware Scrum Software Development Agile Methodologies Software Engineering Skills  Configuration Management Testing Telecommunications Device Drivers Firmware Scrum Software Development Agile Methodologies Software Engineering Configuration Management Testing Telecommunications Device Drivers Firmware Scrum Software Development Agile Methodologies Software Engineering Configuration Management Testing Telecommunications Device Drivers Firmware Scrum Software Development Agile Methodologies Software Engineering Education Scrum Alliance Certified Scrum Professional,  Project Management , N/A 2015  – 2015 Scrum Alliance Certified Scrum Master,  Project Management 2012  – 2012 Project Management Institute (PMI) CAPM,  Project Management 2009  – 2009 B| Braun Medical Certificate of Completion,  Certificate of Completion of Medical Device Marketing Training 1998  – 1998 Rapid Certification,  Certificate of Completion of RapidTM Simulation Tool Training 1998  – 1998 Wind River Certificate of Completion,  Certificate of Completion of VxWorks Training 1997  – 1997 The University of Texas at Arlington BS,  Computer Science Engineering 1990  – 1994 Tarrant County College AA,  Interdisciplinary studies 1990  – 1992 Tarrant County College AS,  Automated System and Robotics 1988  – 1990 Scrum Alliance Certified Scrum Professional,  Project Management , N/A 2015  – 2015 Scrum Alliance Certified Scrum Professional,  Project Management , N/A 2015  – 2015 Scrum Alliance Certified Scrum Professional,  Project Management , N/A 2015  – 2015 Scrum Alliance Certified Scrum Master,  Project Management 2012  – 2012 Scrum Alliance Certified Scrum Master,  Project Management 2012  – 2012 Scrum Alliance Certified Scrum Master,  Project Management 2012  – 2012 Project Management Institute (PMI) CAPM,  Project Management 2009  – 2009 Project Management Institute (PMI) CAPM,  Project Management 2009  – 2009 Project Management Institute (PMI) CAPM,  Project Management 2009  – 2009 B| Braun Medical Certificate of Completion,  Certificate of Completion of Medical Device Marketing Training 1998  – 1998 B| Braun Medical Certificate of Completion,  Certificate of Completion of Medical Device Marketing Training 1998  – 1998 B| Braun Medical Certificate of Completion,  Certificate of Completion of Medical Device Marketing Training 1998  – 1998 Rapid Certification,  Certificate of Completion of RapidTM Simulation Tool Training 1998  – 1998 Rapid Certification,  Certificate of Completion of RapidTM Simulation Tool Training 1998  – 1998 Rapid Certification,  Certificate of Completion of RapidTM Simulation Tool Training 1998  – 1998 Wind River Certificate of Completion,  Certificate of Completion of VxWorks Training 1997  – 1997 Wind River Certificate of Completion,  Certificate of Completion of VxWorks Training 1997  – 1997 Wind River Certificate of Completion,  Certificate of Completion of VxWorks Training 1997  – 1997 The University of Texas at Arlington BS,  Computer Science Engineering 1990  – 1994 The University of Texas at Arlington BS,  Computer Science Engineering 1990  – 1994 The University of Texas at Arlington BS,  Computer Science Engineering 1990  – 1994 Tarrant County College AA,  Interdisciplinary studies 1990  – 1992 Tarrant County College AA,  Interdisciplinary studies 1990  – 1992 Tarrant County College AA,  Interdisciplinary studies 1990  – 1992 Tarrant County College AS,  Automated System and Robotics 1988  – 1990 Tarrant County College AS,  Automated System and Robotics 1988  – 1990 Tarrant County College AS,  Automated System and Robotics 1988  – 1990 ", "Summary Too amateur to be a geek, too geek to be an amateur. I'm a middleman between development and management, responsible for software quality and account management.  \n \nI strongly believe that there’s only one thing needed to change the world for better: EDUCATION.  \n \nProfessional background: I tried different roles through my career. At 14 I started from cleaning the factory floor around people programming PLC controllers. The next year I came back as a PLC programming assistant. I Studied in Poland and acquired BS degree in Computer Science. During studies I was a freelancer doing web design and development. I was a test Engineer for Symantec products and been to Iran as a telco backbone system analyst and developer as well as spent a while at a call center’s channel development team. While working for Intel as an Education Ecosystem Manager for CEE I realized the importance of bringing technology to schools and education technology became the most important field I'm interested in. At Intellisense, I'm devoted to bringing highest quality education software to thousands of schools in the world.  \n \nPersonal: In private life, I enjoy all kinds of woodworking, especially giving new life to pieces found on the street or garage sales. I'm a djembe (what the heck is that? Google is your friend) player and hope to create a band with my sons in the future. Summary Too amateur to be a geek, too geek to be an amateur. I'm a middleman between development and management, responsible for software quality and account management.  \n \nI strongly believe that there’s only one thing needed to change the world for better: EDUCATION.  \n \nProfessional background: I tried different roles through my career. At 14 I started from cleaning the factory floor around people programming PLC controllers. The next year I came back as a PLC programming assistant. I Studied in Poland and acquired BS degree in Computer Science. During studies I was a freelancer doing web design and development. I was a test Engineer for Symantec products and been to Iran as a telco backbone system analyst and developer as well as spent a while at a call center’s channel development team. While working for Intel as an Education Ecosystem Manager for CEE I realized the importance of bringing technology to schools and education technology became the most important field I'm interested in. At Intellisense, I'm devoted to bringing highest quality education software to thousands of schools in the world.  \n \nPersonal: In private life, I enjoy all kinds of woodworking, especially giving new life to pieces found on the street or garage sales. I'm a djembe (what the heck is that? Google is your friend) player and hope to create a band with my sons in the future. Too amateur to be a geek, too geek to be an amateur. I'm a middleman between development and management, responsible for software quality and account management.  \n \nI strongly believe that there’s only one thing needed to change the world for better: EDUCATION.  \n \nProfessional background: I tried different roles through my career. At 14 I started from cleaning the factory floor around people programming PLC controllers. The next year I came back as a PLC programming assistant. I Studied in Poland and acquired BS degree in Computer Science. During studies I was a freelancer doing web design and development. I was a test Engineer for Symantec products and been to Iran as a telco backbone system analyst and developer as well as spent a while at a call center’s channel development team. While working for Intel as an Education Ecosystem Manager for CEE I realized the importance of bringing technology to schools and education technology became the most important field I'm interested in. At Intellisense, I'm devoted to bringing highest quality education software to thousands of schools in the world.  \n \nPersonal: In private life, I enjoy all kinds of woodworking, especially giving new life to pieces found on the street or garage sales. I'm a djembe (what the heck is that? Google is your friend) player and hope to create a band with my sons in the future. Too amateur to be a geek, too geek to be an amateur. I'm a middleman between development and management, responsible for software quality and account management.  \n \nI strongly believe that there’s only one thing needed to change the world for better: EDUCATION.  \n \nProfessional background: I tried different roles through my career. At 14 I started from cleaning the factory floor around people programming PLC controllers. The next year I came back as a PLC programming assistant. I Studied in Poland and acquired BS degree in Computer Science. During studies I was a freelancer doing web design and development. I was a test Engineer for Symantec products and been to Iran as a telco backbone system analyst and developer as well as spent a while at a call center’s channel development team. While working for Intel as an Education Ecosystem Manager for CEE I realized the importance of bringing technology to schools and education technology became the most important field I'm interested in. At Intellisense, I'm devoted to bringing highest quality education software to thousands of schools in the world.  \n \nPersonal: In private life, I enjoy all kinds of woodworking, especially giving new life to pieces found on the street or garage sales. I'm a djembe (what the heck is that? Google is your friend) player and hope to create a band with my sons in the future. Experience Chief Product Officer Intellisense Co. (Intellisense Zrt) April 2015  – Present (5 months) Hungary Head of Quality & Support Intellisense Co. (Intellisense Zrt) February 2013  – Present (2 years 7 months) Budapest, Hungary International Marketing & Support Manager Intellisense Co. Ltd, (WebCam Laboratory) August 2012  –  February 2013  (7 months) Budapest Technical project manager Contractor at Intel Corporation March 2010  –  August 2012  (2 years 6 months) CEE Education Ecosystem Enabling Manager, CEE Contractor at Intel Corporation December 2007  –  February 2012  (4 years 3 months) Budapest, Hungary Intel Learning Series pilot & deployment supervising in CEE countries \nTechnical training & support for ecosystem players \nTechnical problem solving \nSolution development \nMarketing support, co-marketing activities \nVendor alliance development & matchmaking Test Engineer, System Analyst Edge Solutions, contractor to Nokia Siemens Networks November 2006  –  December 2007  (1 year 2 months) Łódź Area, Poland & Tehran, Iran Channel Development Representative for Intel Hungary TIM Callcenter December 2005  –  November 2006  (1 year) Warsaw, Poland Chief Product Officer Intellisense Co. (Intellisense Zrt) April 2015  – Present (5 months) Hungary Chief Product Officer Intellisense Co. (Intellisense Zrt) April 2015  – Present (5 months) Hungary Head of Quality & Support Intellisense Co. (Intellisense Zrt) February 2013  – Present (2 years 7 months) Budapest, Hungary Head of Quality & Support Intellisense Co. (Intellisense Zrt) February 2013  – Present (2 years 7 months) Budapest, Hungary International Marketing & Support Manager Intellisense Co. Ltd, (WebCam Laboratory) August 2012  –  February 2013  (7 months) Budapest International Marketing & Support Manager Intellisense Co. Ltd, (WebCam Laboratory) August 2012  –  February 2013  (7 months) Budapest Technical project manager Contractor at Intel Corporation March 2010  –  August 2012  (2 years 6 months) CEE Technical project manager Contractor at Intel Corporation March 2010  –  August 2012  (2 years 6 months) CEE Education Ecosystem Enabling Manager, CEE Contractor at Intel Corporation December 2007  –  February 2012  (4 years 3 months) Budapest, Hungary Intel Learning Series pilot & deployment supervising in CEE countries \nTechnical training & support for ecosystem players \nTechnical problem solving \nSolution development \nMarketing support, co-marketing activities \nVendor alliance development & matchmaking Education Ecosystem Enabling Manager, CEE Contractor at Intel Corporation December 2007  –  February 2012  (4 years 3 months) Budapest, Hungary Intel Learning Series pilot & deployment supervising in CEE countries \nTechnical training & support for ecosystem players \nTechnical problem solving \nSolution development \nMarketing support, co-marketing activities \nVendor alliance development & matchmaking Test Engineer, System Analyst Edge Solutions, contractor to Nokia Siemens Networks November 2006  –  December 2007  (1 year 2 months) Łódź Area, Poland & Tehran, Iran Test Engineer, System Analyst Edge Solutions, contractor to Nokia Siemens Networks November 2006  –  December 2007  (1 year 2 months) Łódź Area, Poland & Tehran, Iran Channel Development Representative for Intel Hungary TIM Callcenter December 2005  –  November 2006  (1 year) Warsaw, Poland Channel Development Representative for Intel Hungary TIM Callcenter December 2005  –  November 2006  (1 year) Warsaw, Poland Languages English Professional working proficiency Polish Full professional proficiency Hungarian Native or bilingual proficiency Russian Elementary proficiency English Professional working proficiency Polish Full professional proficiency Hungarian Native or bilingual proficiency Russian Elementary proficiency English Professional working proficiency Polish Full professional proficiency Hungarian Native or bilingual proficiency Russian Elementary proficiency Professional working proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Testing Software Project... Educational Technology Technical Support Software Design Client Presentation Technical Project... Website Development Scrum Mobile Devices Mobile Applications Woodworking Mobile Technology Computer Science Project Management Integration Web Development SQL Programming Databases Agile Project Management Test Planning Intel Telecommunications Computer Architecture Technical Leadership Android Product Management JIRA Perl Test Management Software Quality... Agile Methodologies Web Applications Djembe Father HTML JavaScript CSS3 Adobe Creative Suite Quality Assurance Software Engineering Software Development Management Team Leadership See 30+     See less Skills  Testing Software Project... Educational Technology Technical Support Software Design Client Presentation Technical Project... Website Development Scrum Mobile Devices Mobile Applications Woodworking Mobile Technology Computer Science Project Management Integration Web Development SQL Programming Databases Agile Project Management Test Planning Intel Telecommunications Computer Architecture Technical Leadership Android Product Management JIRA Perl Test Management Software Quality... Agile Methodologies Web Applications Djembe Father HTML JavaScript CSS3 Adobe Creative Suite Quality Assurance Software Engineering Software Development Management Team Leadership See 30+     See less Testing Software Project... Educational Technology Technical Support Software Design Client Presentation Technical Project... Website Development Scrum Mobile Devices Mobile Applications Woodworking Mobile Technology Computer Science Project Management Integration Web Development SQL Programming Databases Agile Project Management Test Planning Intel Telecommunications Computer Architecture Technical Leadership Android Product Management JIRA Perl Test Management Software Quality... Agile Methodologies Web Applications Djembe Father HTML JavaScript CSS3 Adobe Creative Suite Quality Assurance Software Engineering Software Development Management Team Leadership See 30+     See less Testing Software Project... Educational Technology Technical Support Software Design Client Presentation Technical Project... Website Development Scrum Mobile Devices Mobile Applications Woodworking Mobile Technology Computer Science Project Management Integration Web Development SQL Programming Databases Agile Project Management Test Planning Intel Telecommunications Computer Architecture Technical Leadership Android Product Management JIRA Perl Test Management Software Quality... Agile Methodologies Web Applications Djembe Father HTML JavaScript CSS3 Adobe Creative Suite Quality Assurance Software Engineering Software Development Management Team Leadership See 30+     See less Education Technical University of Lodz BS,  Computer Science 2000  – 2007 Klauzál Gábor Technical School Industrial Electronics Technician,  Industrial Electronics Technology/Technician 1996  – 1998 Technical University of Lodz BS,  Computer Science 2000  – 2007 Technical University of Lodz BS,  Computer Science 2000  – 2007 Technical University of Lodz BS,  Computer Science 2000  – 2007 Klauzál Gábor Technical School Industrial Electronics Technician,  Industrial Electronics Technology/Technician 1996  – 1998 Klauzál Gábor Technical School Industrial Electronics Technician,  Industrial Electronics Technology/Technician 1996  – 1998 Klauzál Gábor Technical School Industrial Electronics Technician,  Industrial Electronics Technology/Technician 1996  – 1998 ", "Summary Specialties:Project Management Professional (PMI Certified) \nLean Six Sigma Green Belt \nBusiness Analysis \nITIL Summary Specialties:Project Management Professional (PMI Certified) \nLean Six Sigma Green Belt \nBusiness Analysis \nITIL Specialties:Project Management Professional (PMI Certified) \nLean Six Sigma Green Belt \nBusiness Analysis \nITIL Specialties:Project Management Professional (PMI Certified) \nLean Six Sigma Green Belt \nBusiness Analysis \nITIL Experience IT Mergers, Acquisitions & Construction, Business Analyst/Project Manager Intel Corporation August 2008  – Present (7 years 1 month) SW AMR Regional Data Center Coordinator & Project Manager (Contractor) Intel Corporation Contractor December 2007  –  August 2008  (9 months) Project Manager - Office of Special Trustee, Department of Interior Chickasaw Nation Industries April 2006  –  January 2008  (1 year 10 months) Served sequentially as the System Analyst, Deputy Project Manager, and Project Manager on a contract with the Office of Special Trustee, Department of the Interior FileNET System Administrator Alabama Department of Environmental Management April 2001  –  March 2004  (3 years) Slavic/Middle Eastern Linguist United States Army February 1989  –  March 1998  (9 years 2 months) IT Mergers, Acquisitions & Construction, Business Analyst/Project Manager Intel Corporation August 2008  – Present (7 years 1 month) IT Mergers, Acquisitions & Construction, Business Analyst/Project Manager Intel Corporation August 2008  – Present (7 years 1 month) SW AMR Regional Data Center Coordinator & Project Manager (Contractor) Intel Corporation Contractor December 2007  –  August 2008  (9 months) SW AMR Regional Data Center Coordinator & Project Manager (Contractor) Intel Corporation Contractor December 2007  –  August 2008  (9 months) Project Manager - Office of Special Trustee, Department of Interior Chickasaw Nation Industries April 2006  –  January 2008  (1 year 10 months) Served sequentially as the System Analyst, Deputy Project Manager, and Project Manager on a contract with the Office of Special Trustee, Department of the Interior Project Manager - Office of Special Trustee, Department of Interior Chickasaw Nation Industries April 2006  –  January 2008  (1 year 10 months) Served sequentially as the System Analyst, Deputy Project Manager, and Project Manager on a contract with the Office of Special Trustee, Department of the Interior FileNET System Administrator Alabama Department of Environmental Management April 2001  –  March 2004  (3 years) FileNET System Administrator Alabama Department of Environmental Management April 2001  –  March 2004  (3 years) Slavic/Middle Eastern Linguist United States Army February 1989  –  March 1998  (9 years 2 months) Slavic/Middle Eastern Linguist United States Army February 1989  –  March 1998  (9 years 2 months) Languages Czech Arabic Czech Arabic Czech Arabic Skills Project Management Business Analysis ITIL LSS Green Belt Business Intelligence Six Sigma Agile Methodologies Rational Team Concert Process Improvement IT Strategy Business Process... PMO Integration Business Process MS Project SharePoint Software Documentation Change Management PMP Analysis Project Planning Disaster Recovery Vendor Management Troubleshooting Leadership IT Service Management Management Team Leadership Solution Architecture Strategy Information Technology System Administration Operations Management Team Building Business Strategy Incident Management Procurement Requirements Gathering Budgets Testing See 26+     See less Skills  Project Management Business Analysis ITIL LSS Green Belt Business Intelligence Six Sigma Agile Methodologies Rational Team Concert Process Improvement IT Strategy Business Process... PMO Integration Business Process MS Project SharePoint Software Documentation Change Management PMP Analysis Project Planning Disaster Recovery Vendor Management Troubleshooting Leadership IT Service Management Management Team Leadership Solution Architecture Strategy Information Technology System Administration Operations Management Team Building Business Strategy Incident Management Procurement Requirements Gathering Budgets Testing See 26+     See less Project Management Business Analysis ITIL LSS Green Belt Business Intelligence Six Sigma Agile Methodologies Rational Team Concert Process Improvement IT Strategy Business Process... PMO Integration Business Process MS Project SharePoint Software Documentation Change Management PMP Analysis Project Planning Disaster Recovery Vendor Management Troubleshooting Leadership IT Service Management Management Team Leadership Solution Architecture Strategy Information Technology System Administration Operations Management Team Building Business Strategy Incident Management Procurement Requirements Gathering Budgets Testing See 26+     See less Project Management Business Analysis ITIL LSS Green Belt Business Intelligence Six Sigma Agile Methodologies Rational Team Concert Process Improvement IT Strategy Business Process... PMO Integration Business Process MS Project SharePoint Software Documentation Change Management PMP Analysis Project Planning Disaster Recovery Vendor Management Troubleshooting Leadership IT Service Management Management Team Leadership Solution Architecture Strategy Information Technology System Administration Operations Management Team Building Business Strategy Incident Management Procurement Requirements Gathering Budgets Testing See 26+     See less Education UC Berkeley Business Analyst,  Business Analysis 2011  – 2013 Business Analytics ITIL Certificate,  ITIL V3 2010  – 2010 ITIL V3 The University of New Mexico Certificate,  Project Management - Master Certificate 2009  – 2010 The University of New Mexico Certification,  Project Mangement - Information Technology 2007  – 2007 Project Management Master Certification The University of New Mexico Certificate,  Project Management Professional Practitioner 2007  – 2007 Troy University MS,  Environmental Analysis & Management 1999  – 2001 Biology/Chemistry, Environmental Analysis & Management Activities and Societies:  Tri Beta Troy University BS,  Biology & Chemistry 1998  – 2001 Picayune Memorial High School College Prep,  College Prep 1984  – 1987 UC Berkeley Business Analyst,  Business Analysis 2011  – 2013 Business Analytics UC Berkeley Business Analyst,  Business Analysis 2011  – 2013 Business Analytics UC Berkeley Business Analyst,  Business Analysis 2011  – 2013 Business Analytics ITIL Certificate,  ITIL V3 2010  – 2010 ITIL V3 ITIL Certificate,  ITIL V3 2010  – 2010 ITIL V3 ITIL Certificate,  ITIL V3 2010  – 2010 ITIL V3 The University of New Mexico Certificate,  Project Management - Master Certificate 2009  – 2010 The University of New Mexico Certificate,  Project Management - Master Certificate 2009  – 2010 The University of New Mexico Certificate,  Project Management - Master Certificate 2009  – 2010 The University of New Mexico Certification,  Project Mangement - Information Technology 2007  – 2007 Project Management Master Certification The University of New Mexico Certification,  Project Mangement - Information Technology 2007  – 2007 Project Management Master Certification The University of New Mexico Certification,  Project Mangement - Information Technology 2007  – 2007 Project Management Master Certification The University of New Mexico Certificate,  Project Management Professional Practitioner 2007  – 2007 The University of New Mexico Certificate,  Project Management Professional Practitioner 2007  – 2007 The University of New Mexico Certificate,  Project Management Professional Practitioner 2007  – 2007 Troy University MS,  Environmental Analysis & Management 1999  – 2001 Biology/Chemistry, Environmental Analysis & Management Activities and Societies:  Tri Beta Troy University MS,  Environmental Analysis & Management 1999  – 2001 Biology/Chemistry, Environmental Analysis & Management Activities and Societies:  Tri Beta Troy University MS,  Environmental Analysis & Management 1999  – 2001 Biology/Chemistry, Environmental Analysis & Management Activities and Societies:  Tri Beta Troy University BS,  Biology & Chemistry 1998  – 2001 Troy University BS,  Biology & Chemistry 1998  – 2001 Troy University BS,  Biology & Chemistry 1998  – 2001 Picayune Memorial High School College Prep,  College Prep 1984  – 1987 Picayune Memorial High School College Prep,  College Prep 1984  – 1987 Picayune Memorial High School College Prep,  College Prep 1984  – 1987 ", "Skills Engineering Management Program Management Process Development Cross-functional Team... Project Engineering Customer Satisfaction Employee Management New Product Ideation Field Operations Issues Resolution Cost Reduction Analysis Product Development Semiconductors Skills  Engineering Management Program Management Process Development Cross-functional Team... Project Engineering Customer Satisfaction Employee Management New Product Ideation Field Operations Issues Resolution Cost Reduction Analysis Product Development Semiconductors Engineering Management Program Management Process Development Cross-functional Team... Project Engineering Customer Satisfaction Employee Management New Product Ideation Field Operations Issues Resolution Cost Reduction Analysis Product Development Semiconductors Engineering Management Program Management Process Development Cross-functional Team... Project Engineering Customer Satisfaction Employee Management New Product Ideation Field Operations Issues Resolution Cost Reduction Analysis Product Development Semiconductors Honors & Awards Awards AMAT CPS, Team Excellence Award, 3rd Quarter 2002\n \nAMAT Customer Productivity Support, Employee of the Quarter, 4th Quarter 2000\n \nCPS, Outstanding Recognition Award, I &W Initiative, 2000\n \nAMAT CPS Award, Global Installation & Warranty Improvement, 1998 and 1999\n \nCertificate of Appreciation, CMP PBG & Intel Account Team Ramp & Retrofit Program, 1999\n \nField Service Engineer, Employee of the Month, 1997\n \nCustomer Letter of Appreciation, Matsushita Semiconductor Corporation, 1997\n \n Awards AMAT CPS, Team Excellence Award, 3rd Quarter 2002\n \nAMAT Customer Productivity Support, Employee of the Quarter, 4th Quarter 2000\n \nCPS, Outstanding Recognition Award, I &W Initiative, 2000\n \nAMAT CPS Award, Global Installation & Warranty Improvement, 1998 and 1999\n \nCertificate of Appreciation, CMP PBG & Intel Account Team Ramp & Retrofit Program, 1999\n \nField Service Engineer, Employee of the Month, 1997\n \nCustomer Letter of Appreciation, Matsushita Semiconductor Corporation, 1997\n \n Awards AMAT CPS, Team Excellence Award, 3rd Quarter 2002\n \nAMAT Customer Productivity Support, Employee of the Quarter, 4th Quarter 2000\n \nCPS, Outstanding Recognition Award, I &W Initiative, 2000\n \nAMAT CPS Award, Global Installation & Warranty Improvement, 1998 and 1999\n \nCertificate of Appreciation, CMP PBG & Intel Account Team Ramp & Retrofit Program, 1999\n \nField Service Engineer, Employee of the Month, 1997\n \nCustomer Letter of Appreciation, Matsushita Semiconductor Corporation, 1997\n \n Awards AMAT CPS, Team Excellence Award, 3rd Quarter 2002\n \nAMAT Customer Productivity Support, Employee of the Quarter, 4th Quarter 2000\n \nCPS, Outstanding Recognition Award, I &W Initiative, 2000\n \nAMAT CPS Award, Global Installation & Warranty Improvement, 1998 and 1999\n \nCertificate of Appreciation, CMP PBG & Intel Account Team Ramp & Retrofit Program, 1999\n \nField Service Engineer, Employee of the Month, 1997\n \nCustomer Letter of Appreciation, Matsushita Semiconductor Corporation, 1997\n \n "]}