{"position": "Purchasing Manager", "company": "Intel Corporation", "profiles": ["Experience Purchasing Manager Intel Corporation 1996  – Present (19 years) Phoenix, Arizona Area Purchasing Manager Intel Corporation 1996  – Present (19 years) Phoenix, Arizona Area Purchasing Manager Intel Corporation 1996  – Present (19 years) Phoenix, Arizona Area Skills Supply Chain Management Contract Management Supplier Management Continuous Improvement Manufacturing Lean Manufacturing Supply Management Global Sourcing Process Improvement Inventory Management Strategy Logistics Management SAP Cross-functional Team... Sourcing Forecasting Leadership Contract Negotiation MRP Procurement Program Management Semiconductors Purchasing Materials Management Supplier Evaluation Supply Chain... Strategic Sourcing Change Management Supplier Development Project Planning Supply Chain Supplier Negotiation Demand Planning Negotiation Operations Management Production Planning Six Sigma See 23+     See less Skills  Supply Chain Management Contract Management Supplier Management Continuous Improvement Manufacturing Lean Manufacturing Supply Management Global Sourcing Process Improvement Inventory Management Strategy Logistics Management SAP Cross-functional Team... Sourcing Forecasting Leadership Contract Negotiation MRP Procurement Program Management Semiconductors Purchasing Materials Management Supplier Evaluation Supply Chain... Strategic Sourcing Change Management Supplier Development Project Planning Supply Chain Supplier Negotiation Demand Planning Negotiation Operations Management Production Planning Six Sigma See 23+     See less Supply Chain Management Contract Management Supplier Management Continuous Improvement Manufacturing Lean Manufacturing Supply Management Global Sourcing Process Improvement Inventory Management Strategy Logistics Management SAP Cross-functional Team... Sourcing Forecasting Leadership Contract Negotiation MRP Procurement Program Management Semiconductors Purchasing Materials Management Supplier Evaluation Supply Chain... Strategic Sourcing Change Management Supplier Development Project Planning Supply Chain Supplier Negotiation Demand Planning Negotiation Operations Management Production Planning Six Sigma See 23+     See less Supply Chain Management Contract Management Supplier Management Continuous Improvement Manufacturing Lean Manufacturing Supply Management Global Sourcing Process Improvement Inventory Management Strategy Logistics Management SAP Cross-functional Team... Sourcing Forecasting Leadership Contract Negotiation MRP Procurement Program Management Semiconductors Purchasing Materials Management Supplier Evaluation Supply Chain... Strategic Sourcing Change Management Supplier Development Project Planning Supply Chain Supplier Negotiation Demand Planning Negotiation Operations Management Production Planning Six Sigma See 23+     See less Education Western International University BS,  Business 1990  – 1996 Western International University BS,  Business 1990  – 1996 Western International University BS,  Business 1990  – 1996 Western International University BS,  Business 1990  – 1996 ", "Summary - Supplier Management, delivery performance related topics \n- Supply Chain Throughput time reduction \n- ERP system (SAP) systems design, testing and implementation  \n- Organization and team development Summary - Supplier Management, delivery performance related topics \n- Supply Chain Throughput time reduction \n- ERP system (SAP) systems design, testing and implementation  \n- Organization and team development - Supplier Management, delivery performance related topics \n- Supply Chain Throughput time reduction \n- ERP system (SAP) systems design, testing and implementation  \n- Organization and team development - Supplier Management, delivery performance related topics \n- Supply Chain Throughput time reduction \n- ERP system (SAP) systems design, testing and implementation  \n- Organization and team development Experience Senior Purchasing Manager Intel Corporation February 2014  – Present (1 year 7 months) Singapore Managing an international team of Supply Chain Analysts that take care of manufacturing partners from the SIFO and OSAT markets; \n- Suppliers Relationship Management \n- Correct procurement orders placement,  \n- Suppliers' on time delivery performances, \n- Inventory Accuracies, \n- Payment topics \n \nOrganization management and development. \n \nERP system (SAP) systems design, testing and implementation Senior Manager, Supplier Management Intel Mobile Communication December 2010  –  February 2014  (3 years 3 months) Singapore Delivery performance of manufacturing partners Assembly Planning Manager ASM Front End Manufacturing Singapore April 2010  –  December 2010  (9 months) Singapore Planning for semiconductor manufacturing equipment Manager, Backend Operations Infineon Technologies December 2005  –  March 2010  (4 years 4 months) Singapore Senior Purchasing Manager Intel Corporation February 2014  – Present (1 year 7 months) Singapore Managing an international team of Supply Chain Analysts that take care of manufacturing partners from the SIFO and OSAT markets; \n- Suppliers Relationship Management \n- Correct procurement orders placement,  \n- Suppliers' on time delivery performances, \n- Inventory Accuracies, \n- Payment topics \n \nOrganization management and development. \n \nERP system (SAP) systems design, testing and implementation Senior Purchasing Manager Intel Corporation February 2014  – Present (1 year 7 months) Singapore Managing an international team of Supply Chain Analysts that take care of manufacturing partners from the SIFO and OSAT markets; \n- Suppliers Relationship Management \n- Correct procurement orders placement,  \n- Suppliers' on time delivery performances, \n- Inventory Accuracies, \n- Payment topics \n \nOrganization management and development. \n \nERP system (SAP) systems design, testing and implementation Senior Manager, Supplier Management Intel Mobile Communication December 2010  –  February 2014  (3 years 3 months) Singapore Delivery performance of manufacturing partners Senior Manager, Supplier Management Intel Mobile Communication December 2010  –  February 2014  (3 years 3 months) Singapore Delivery performance of manufacturing partners Assembly Planning Manager ASM Front End Manufacturing Singapore April 2010  –  December 2010  (9 months) Singapore Planning for semiconductor manufacturing equipment Assembly Planning Manager ASM Front End Manufacturing Singapore April 2010  –  December 2010  (9 months) Singapore Planning for semiconductor manufacturing equipment Manager, Backend Operations Infineon Technologies December 2005  –  March 2010  (4 years 4 months) Singapore Manager, Backend Operations Infineon Technologies December 2005  –  March 2010  (4 years 4 months) Singapore Skills Supply Chain ERP Supply Management Manufacturing Logistics SAP Project Planning Supply Chain Management Testing Electronics Process Improvement Semiconductors Skills  Supply Chain ERP Supply Management Manufacturing Logistics SAP Project Planning Supply Chain Management Testing Electronics Process Improvement Semiconductors Supply Chain ERP Supply Management Manufacturing Logistics SAP Project Planning Supply Chain Management Testing Electronics Process Improvement Semiconductors Supply Chain ERP Supply Management Manufacturing Logistics SAP Project Planning Supply Chain Management Testing Electronics Process Improvement Semiconductors Education National University of Singapore Master of Science (MS),  Logistics , Materials, and Supply Chain Management 2007  – 2009 Masters of Science (Industrial & Systems Engineering), specialization in Logistics National University of Singapore Bachelor of Engineering (BEng),  Mechanical Engineering , Honours 1997  – 2001 National University of Singapore Master of Science (MS),  Logistics , Materials, and Supply Chain Management 2007  – 2009 Masters of Science (Industrial & Systems Engineering), specialization in Logistics National University of Singapore Master of Science (MS),  Logistics , Materials, and Supply Chain Management 2007  – 2009 Masters of Science (Industrial & Systems Engineering), specialization in Logistics National University of Singapore Master of Science (MS),  Logistics , Materials, and Supply Chain Management 2007  – 2009 Masters of Science (Industrial & Systems Engineering), specialization in Logistics National University of Singapore Bachelor of Engineering (BEng),  Mechanical Engineering , Honours 1997  – 2001 National University of Singapore Bachelor of Engineering (BEng),  Mechanical Engineering , Honours 1997  – 2001 National University of Singapore Bachelor of Engineering (BEng),  Mechanical Engineering , Honours 1997  – 2001 ", "Experience Global Materials and Purchasing Manager Intel Corporation September 2012  – Present (3 years) Greater Seattle Area Strategic Supply Chain Manager Intel Corporation 2009  –  October 2012  (3 years) Greater Seattle Area Transformed EPSD’s material strategy from an inefficient sourced finished goods model to a multisource, lower total cost finished goods model. Drove the effort to design products for the supply chain decreasing supply chain risk by increasing a modular design strategy. The supply chain strategy defined a balance between aggressive cost management, quality, supply chain flexibility and customer responsiveness. This strategy enabled EPSD to successfully and profitably manage their in revenue during 2010/2011 while cutting tpt to days from weeks. EPSD World Wide Materials Manager Intel Corp 1999  –  2008  (9 years) Responsible for manufacturing and operations for new product prototyping and high-volume production launches of server motherboards and chassis hardware with suppliers based primarily in China, Taiwan and Malaysia. Defined, Developed and Implemented strategies to reduce total cost for server products associated with Logistics, Engineering, BOM and Quality Materials Program Manager Intel August 1996  –  April 1999  (2 years 9 months) Optimized supply chain for components used to assemble servers in Ireland, Pureto Rico, Malaysia and the US. Collaborated with engineering teams to select componets from strategic suppliers to optimize cost and quality. Drove over $12M savings on $100M of material spends. Commodity Specialist Intel June 1994  –  August 1996  (2 years 3 months) Negoiated contacts for $30M of ASICs and Programmable Logic across 8 separate suppliers developing indicators to measure supplier performance. Global Materials and Purchasing Manager Intel Corporation September 2012  – Present (3 years) Greater Seattle Area Global Materials and Purchasing Manager Intel Corporation September 2012  – Present (3 years) Greater Seattle Area Strategic Supply Chain Manager Intel Corporation 2009  –  October 2012  (3 years) Greater Seattle Area Transformed EPSD’s material strategy from an inefficient sourced finished goods model to a multisource, lower total cost finished goods model. Drove the effort to design products for the supply chain decreasing supply chain risk by increasing a modular design strategy. The supply chain strategy defined a balance between aggressive cost management, quality, supply chain flexibility and customer responsiveness. This strategy enabled EPSD to successfully and profitably manage their in revenue during 2010/2011 while cutting tpt to days from weeks. Strategic Supply Chain Manager Intel Corporation 2009  –  October 2012  (3 years) Greater Seattle Area Transformed EPSD’s material strategy from an inefficient sourced finished goods model to a multisource, lower total cost finished goods model. Drove the effort to design products for the supply chain decreasing supply chain risk by increasing a modular design strategy. The supply chain strategy defined a balance between aggressive cost management, quality, supply chain flexibility and customer responsiveness. This strategy enabled EPSD to successfully and profitably manage their in revenue during 2010/2011 while cutting tpt to days from weeks. EPSD World Wide Materials Manager Intel Corp 1999  –  2008  (9 years) Responsible for manufacturing and operations for new product prototyping and high-volume production launches of server motherboards and chassis hardware with suppliers based primarily in China, Taiwan and Malaysia. Defined, Developed and Implemented strategies to reduce total cost for server products associated with Logistics, Engineering, BOM and Quality EPSD World Wide Materials Manager Intel Corp 1999  –  2008  (9 years) Responsible for manufacturing and operations for new product prototyping and high-volume production launches of server motherboards and chassis hardware with suppliers based primarily in China, Taiwan and Malaysia. Defined, Developed and Implemented strategies to reduce total cost for server products associated with Logistics, Engineering, BOM and Quality Materials Program Manager Intel August 1996  –  April 1999  (2 years 9 months) Optimized supply chain for components used to assemble servers in Ireland, Pureto Rico, Malaysia and the US. Collaborated with engineering teams to select componets from strategic suppliers to optimize cost and quality. Drove over $12M savings on $100M of material spends. Materials Program Manager Intel August 1996  –  April 1999  (2 years 9 months) Optimized supply chain for components used to assemble servers in Ireland, Pureto Rico, Malaysia and the US. Collaborated with engineering teams to select componets from strategic suppliers to optimize cost and quality. Drove over $12M savings on $100M of material spends. Commodity Specialist Intel June 1994  –  August 1996  (2 years 3 months) Negoiated contacts for $30M of ASICs and Programmable Logic across 8 separate suppliers developing indicators to measure supplier performance. Commodity Specialist Intel June 1994  –  August 1996  (2 years 3 months) Negoiated contacts for $30M of ASICs and Programmable Logic across 8 separate suppliers developing indicators to measure supplier performance. Skills Materials Management Manufacturing Supply Chain Engineering Product Development Contract Management Contract Negotiation Product Launch Outsourcing Team Leadership Management Cross-functional Team... MRP Process Improvement Materials Sourcing Supply Chain Management Purchasing Electronics Procurement Strategy Global Sourcing Semiconductors Lean Manufacturing Supply Management Strategic Sourcing See 11+     See less Skills  Materials Management Manufacturing Supply Chain Engineering Product Development Contract Management Contract Negotiation Product Launch Outsourcing Team Leadership Management Cross-functional Team... MRP Process Improvement Materials Sourcing Supply Chain Management Purchasing Electronics Procurement Strategy Global Sourcing Semiconductors Lean Manufacturing Supply Management Strategic Sourcing See 11+     See less Materials Management Manufacturing Supply Chain Engineering Product Development Contract Management Contract Negotiation Product Launch Outsourcing Team Leadership Management Cross-functional Team... MRP Process Improvement Materials Sourcing Supply Chain Management Purchasing Electronics Procurement Strategy Global Sourcing Semiconductors Lean Manufacturing Supply Management Strategic Sourcing See 11+     See less Materials Management Manufacturing Supply Chain Engineering Product Development Contract Management Contract Negotiation Product Launch Outsourcing Team Leadership Management Cross-functional Team... MRP Process Improvement Materials Sourcing Supply Chain Management Purchasing Electronics Procurement Strategy Global Sourcing Semiconductors Lean Manufacturing Supply Management Strategic Sourcing See 11+     See less Education Penn State University MBA 1992  – 1994 University of Vermont BS,  Electrical Engineering 1988  – 1992 Penn State University MBA 1992  – 1994 Penn State University MBA 1992  – 1994 Penn State University MBA 1992  – 1994 University of Vermont BS,  Electrical Engineering 1988  – 1992 University of Vermont BS,  Electrical Engineering 1988  – 1992 University of Vermont BS,  Electrical Engineering 1988  – 1992 ", "Experience Senior Strategic Sourcing Manager -Sales & Marketing Intel Corporation August 2009  – Present (6 years 1 month) Worldwide Indirect Purchasing Operations Manager Intel Corporation January 2007  –  August 2009  (2 years 8 months) Worldwide Global Marketing Services Sourcing Manager Intel Corporation June 2004  –  January 2007  (2 years 8 months) worldwide EMEA Purchasing Manager Intel Corporation April 2000  –  January 2004  (3 years 10 months) EMEA European Purchasing Manager Intel Corporation April 1997  –  March 2000  (3 years) UK & Europe Senior Purchasing Specialist Intel Corporation April 1994  –  April 1997  (3 years 1 month) UK & Europe Senior Procurement Specialist Goldman Sachs January 1993  –  April 1994  (1 year 4 months) London, United Kingdom Responsibilities include project control of the selection and implementation of a new bespoke computerised purchasing system incorporating ‘MS Windows’ based requisitioning, bar-coding and a goods-inwards function. Prepare and evaluate tenders for general service contracts. Negotiate and issue contracts for IT equipment and services. Purchasing Consultant BP Amoco January 1992  –  January 1993  (1 year 1 month) London, United Kingdom Co-ordinated approval and issue of complex contract documents and bid packages, negotiate acceptable terms prior to award. Advise in relation to contractual disputes and re-negotiations. Implement on line contracts data base system. Evaluate RFP for equipment and services for the IT Technical Services Group. Prepare and issue contract documents. Represented companies in contract negotiations with suppliers Senior Procurement Specialist The London Stock Exchange 1987  –  1992  (5 years) City of London Procuring IT hardware and software for the information services within the Trading Markets Division. Managing 8 staff, Purchasing Consultant Umm-Al-Jawaby Oil Services Ltd. 1986  –  1987  (1 year) London, United Kingdom Procuring goods and services for mulitple Oil Companies in the Middle East Materials Co-ordinator Burmah Castrol Limited 1979  –  1986  (7 years) UK, Ireland & Gabon, West Africa. Senior Strategic Sourcing Manager -Sales & Marketing Intel Corporation August 2009  – Present (6 years 1 month) Worldwide Senior Strategic Sourcing Manager -Sales & Marketing Intel Corporation August 2009  – Present (6 years 1 month) Worldwide Indirect Purchasing Operations Manager Intel Corporation January 2007  –  August 2009  (2 years 8 months) Worldwide Indirect Purchasing Operations Manager Intel Corporation January 2007  –  August 2009  (2 years 8 months) Worldwide Global Marketing Services Sourcing Manager Intel Corporation June 2004  –  January 2007  (2 years 8 months) worldwide Global Marketing Services Sourcing Manager Intel Corporation June 2004  –  January 2007  (2 years 8 months) worldwide EMEA Purchasing Manager Intel Corporation April 2000  –  January 2004  (3 years 10 months) EMEA EMEA Purchasing Manager Intel Corporation April 2000  –  January 2004  (3 years 10 months) EMEA European Purchasing Manager Intel Corporation April 1997  –  March 2000  (3 years) UK & Europe European Purchasing Manager Intel Corporation April 1997  –  March 2000  (3 years) UK & Europe Senior Purchasing Specialist Intel Corporation April 1994  –  April 1997  (3 years 1 month) UK & Europe Senior Purchasing Specialist Intel Corporation April 1994  –  April 1997  (3 years 1 month) UK & Europe Senior Procurement Specialist Goldman Sachs January 1993  –  April 1994  (1 year 4 months) London, United Kingdom Responsibilities include project control of the selection and implementation of a new bespoke computerised purchasing system incorporating ‘MS Windows’ based requisitioning, bar-coding and a goods-inwards function. Prepare and evaluate tenders for general service contracts. Negotiate and issue contracts for IT equipment and services. Senior Procurement Specialist Goldman Sachs January 1993  –  April 1994  (1 year 4 months) London, United Kingdom Responsibilities include project control of the selection and implementation of a new bespoke computerised purchasing system incorporating ‘MS Windows’ based requisitioning, bar-coding and a goods-inwards function. Prepare and evaluate tenders for general service contracts. Negotiate and issue contracts for IT equipment and services. Purchasing Consultant BP Amoco January 1992  –  January 1993  (1 year 1 month) London, United Kingdom Co-ordinated approval and issue of complex contract documents and bid packages, negotiate acceptable terms prior to award. Advise in relation to contractual disputes and re-negotiations. Implement on line contracts data base system. Evaluate RFP for equipment and services for the IT Technical Services Group. Prepare and issue contract documents. Represented companies in contract negotiations with suppliers Purchasing Consultant BP Amoco January 1992  –  January 1993  (1 year 1 month) London, United Kingdom Co-ordinated approval and issue of complex contract documents and bid packages, negotiate acceptable terms prior to award. Advise in relation to contractual disputes and re-negotiations. Implement on line contracts data base system. Evaluate RFP for equipment and services for the IT Technical Services Group. Prepare and issue contract documents. Represented companies in contract negotiations with suppliers Senior Procurement Specialist The London Stock Exchange 1987  –  1992  (5 years) City of London Procuring IT hardware and software for the information services within the Trading Markets Division. Managing 8 staff, Senior Procurement Specialist The London Stock Exchange 1987  –  1992  (5 years) City of London Procuring IT hardware and software for the information services within the Trading Markets Division. Managing 8 staff, Purchasing Consultant Umm-Al-Jawaby Oil Services Ltd. 1986  –  1987  (1 year) London, United Kingdom Procuring goods and services for mulitple Oil Companies in the Middle East Purchasing Consultant Umm-Al-Jawaby Oil Services Ltd. 1986  –  1987  (1 year) London, United Kingdom Procuring goods and services for mulitple Oil Companies in the Middle East Materials Co-ordinator Burmah Castrol Limited 1979  –  1986  (7 years) UK, Ireland & Gabon, West Africa. Materials Co-ordinator Burmah Castrol Limited 1979  –  1986  (7 years) UK, Ireland & Gabon, West Africa. Languages French French French Skills Negotiation Contract Negotiation Contract Negotiations RFP Strategic Sourcing Supplier Management Outsourcing BPO Vendor Management Sourcing Cost Reduction Global Sourcing Contract Management Business Strategy Procurement Purchasing People Management Supply Management Supply Chain Management Management Supply Chain Supplier Evaluation Supplier Negotiation Cross-functional Team... Six Sigma Strategy Process Improvement See 12+     See less Skills  Negotiation Contract Negotiation Contract Negotiations RFP Strategic Sourcing Supplier Management Outsourcing BPO Vendor Management Sourcing Cost Reduction Global Sourcing Contract Management Business Strategy Procurement Purchasing People Management Supply Management Supply Chain Management Management Supply Chain Supplier Evaluation Supplier Negotiation Cross-functional Team... Six Sigma Strategy Process Improvement See 12+     See less Negotiation Contract Negotiation Contract Negotiations RFP Strategic Sourcing Supplier Management Outsourcing BPO Vendor Management Sourcing Cost Reduction Global Sourcing Contract Management Business Strategy Procurement Purchasing People Management Supply Management Supply Chain Management Management Supply Chain Supplier Evaluation Supplier Negotiation Cross-functional Team... Six Sigma Strategy Process Improvement See 12+     See less Negotiation Contract Negotiation Contract Negotiations RFP Strategic Sourcing Supplier Management Outsourcing BPO Vendor Management Sourcing Cost Reduction Global Sourcing Contract Management Business Strategy Procurement Purchasing People Management Supply Management Supply Chain Management Management Supply Chain Supplier Evaluation Supplier Negotiation Cross-functional Team... Six Sigma Strategy Process Improvement See 12+     See less ", "Summary I am devoted to and excel in four areas - each area contributing to a robust, deep understanding and application in supply chain management: commodity management, procurement, quality, & analytics. \n \n \nCOMMODITY MANAGEMENT \nI implement sourcing strategies for long term return. Optimizing supply chains through reduced purchased costs, procurement & management costs, increase stakeholder satisfaction & ongoing management for long term relationships and benefits. Utilize cost modeling driving strategic sourcing and contracting, leveraging e-sourcing for total value management. \n \n \nPROCUREMENT \nGovernance, structure, & controls to support robust procure-to-pay (P2P) processes. I leverage Kaizen to map existing processes, identify constraints, and driver improvements to standardize and automate, driving long term reductions in P2P and head count, while supporting sourcing strategies for lean supply chain inventories & reduced monetary investments. \n \n \nQUALITY \nI create collaborative environment, developing relationships utilizing root cause problem solving, LEAN Six Sigma, and supplier audits delivering uninterrupted supply chains with high quality, and low cost. Deploy preventative action / corrective action process, collecting defect data to identify opportunities for improvement and track top performers. Establish balanced scorecards for suppliers (SRC) that measure availability, cost, quality, delivery with annual management reviews for joint collaboration and mutual continuous improvement.  \n \n \nANALYTICS \nBusiness intelligence (BI) is competitive advantage. I develop critical supply chain metrics that will provide leading and lagging indicators of the overall supply chain health. I deploy solutions for predictive analytics to drive decision making to optimize supply chain while mitigating risk and reducing financial investments. \n \n \nI am interested in discussing and exploring supply chain opportunities. Please contact me via InMail or mzmans@cox.net Summary I am devoted to and excel in four areas - each area contributing to a robust, deep understanding and application in supply chain management: commodity management, procurement, quality, & analytics. \n \n \nCOMMODITY MANAGEMENT \nI implement sourcing strategies for long term return. Optimizing supply chains through reduced purchased costs, procurement & management costs, increase stakeholder satisfaction & ongoing management for long term relationships and benefits. Utilize cost modeling driving strategic sourcing and contracting, leveraging e-sourcing for total value management. \n \n \nPROCUREMENT \nGovernance, structure, & controls to support robust procure-to-pay (P2P) processes. I leverage Kaizen to map existing processes, identify constraints, and driver improvements to standardize and automate, driving long term reductions in P2P and head count, while supporting sourcing strategies for lean supply chain inventories & reduced monetary investments. \n \n \nQUALITY \nI create collaborative environment, developing relationships utilizing root cause problem solving, LEAN Six Sigma, and supplier audits delivering uninterrupted supply chains with high quality, and low cost. Deploy preventative action / corrective action process, collecting defect data to identify opportunities for improvement and track top performers. Establish balanced scorecards for suppliers (SRC) that measure availability, cost, quality, delivery with annual management reviews for joint collaboration and mutual continuous improvement.  \n \n \nANALYTICS \nBusiness intelligence (BI) is competitive advantage. I develop critical supply chain metrics that will provide leading and lagging indicators of the overall supply chain health. I deploy solutions for predictive analytics to drive decision making to optimize supply chain while mitigating risk and reducing financial investments. \n \n \nI am interested in discussing and exploring supply chain opportunities. Please contact me via InMail or mzmans@cox.net I am devoted to and excel in four areas - each area contributing to a robust, deep understanding and application in supply chain management: commodity management, procurement, quality, & analytics. \n \n \nCOMMODITY MANAGEMENT \nI implement sourcing strategies for long term return. Optimizing supply chains through reduced purchased costs, procurement & management costs, increase stakeholder satisfaction & ongoing management for long term relationships and benefits. Utilize cost modeling driving strategic sourcing and contracting, leveraging e-sourcing for total value management. \n \n \nPROCUREMENT \nGovernance, structure, & controls to support robust procure-to-pay (P2P) processes. I leverage Kaizen to map existing processes, identify constraints, and driver improvements to standardize and automate, driving long term reductions in P2P and head count, while supporting sourcing strategies for lean supply chain inventories & reduced monetary investments. \n \n \nQUALITY \nI create collaborative environment, developing relationships utilizing root cause problem solving, LEAN Six Sigma, and supplier audits delivering uninterrupted supply chains with high quality, and low cost. Deploy preventative action / corrective action process, collecting defect data to identify opportunities for improvement and track top performers. Establish balanced scorecards for suppliers (SRC) that measure availability, cost, quality, delivery with annual management reviews for joint collaboration and mutual continuous improvement.  \n \n \nANALYTICS \nBusiness intelligence (BI) is competitive advantage. I develop critical supply chain metrics that will provide leading and lagging indicators of the overall supply chain health. I deploy solutions for predictive analytics to drive decision making to optimize supply chain while mitigating risk and reducing financial investments. \n \n \nI am interested in discussing and exploring supply chain opportunities. Please contact me via InMail or mzmans@cox.net I am devoted to and excel in four areas - each area contributing to a robust, deep understanding and application in supply chain management: commodity management, procurement, quality, & analytics. \n \n \nCOMMODITY MANAGEMENT \nI implement sourcing strategies for long term return. Optimizing supply chains through reduced purchased costs, procurement & management costs, increase stakeholder satisfaction & ongoing management for long term relationships and benefits. Utilize cost modeling driving strategic sourcing and contracting, leveraging e-sourcing for total value management. \n \n \nPROCUREMENT \nGovernance, structure, & controls to support robust procure-to-pay (P2P) processes. I leverage Kaizen to map existing processes, identify constraints, and driver improvements to standardize and automate, driving long term reductions in P2P and head count, while supporting sourcing strategies for lean supply chain inventories & reduced monetary investments. \n \n \nQUALITY \nI create collaborative environment, developing relationships utilizing root cause problem solving, LEAN Six Sigma, and supplier audits delivering uninterrupted supply chains with high quality, and low cost. Deploy preventative action / corrective action process, collecting defect data to identify opportunities for improvement and track top performers. Establish balanced scorecards for suppliers (SRC) that measure availability, cost, quality, delivery with annual management reviews for joint collaboration and mutual continuous improvement.  \n \n \nANALYTICS \nBusiness intelligence (BI) is competitive advantage. I develop critical supply chain metrics that will provide leading and lagging indicators of the overall supply chain health. I deploy solutions for predictive analytics to drive decision making to optimize supply chain while mitigating risk and reducing financial investments. \n \n \nI am interested in discussing and exploring supply chain opportunities. Please contact me via InMail or mzmans@cox.net Experience Manager, Global Commodities SolarCity August 2015  – Present (1 month) Phoenix, Arizona Area Global Supply Chain, Project & Program Manager, Quality & ESH Manager Rinchem Company, Inc. May 2008  –  August 2015  (7 years 4 months) Chandler, Arizona Lead teams in US, Israel, & Taiwan to leverage supply chain strategic sourcing and quality best practices improve profitability, compliance, and to differentiate and increase competitive advantage in the market including expansion of market share in semiconductor segment with Fortune 100 customers. \n \n● Created centralized supply chain group, governance, and systems. Infrastructure to support supplier identification, qualification, risk assessment, approval, contracting, measurement, corrective actions, and audits. First year savings ~4.5%.  \n● Implemented first-of-kind dashboards, reports, and interactive tools - ushering business intelligence (Tableau) into the organization - turning raw data into corporate metrics driving quality supply chain business decisions for internal and external customers resulting in ~40% reduction of customer complaints, ~57% reduction of repeat defects, customer retention and stabilization, and award of new seven year contract.  \n● Developed quality organizational strategy, influencing to mobilize resources deploying Kaizen's. Installed root cause problem solving methodology and creation of preventative / corrective action system, driving process and behavioral modification. Two year results: accuracy rate 99.99937% to 99.99997%, DPMO 12.29 to 2.71, process σ 5.86 to 6.04.  \n● Recipient of the annual President’s Award for 2012 delivering critical supply chain and quality solutions to exceed customer expectations, scope and revenue expansion with core, primary customers. \n \nDirect Report Team: Supply Chain , Quality, Safety, Security, Environmental, Health, Data Product Management. 12 full-time direct team members, 1 full-time matrix team member. Global Supply Chain Manager Applied Materials (AMAT) September 2006  –  May 2008  (1 year 9 months) Phoenix, Arizona Breakthrough savings and innovation providing OEM chamber hardware alternative with design for cost and manufacturing process improvement to deliver ~10% ($600K) initial cost savings executing to sourcing strategy for lead market position as preferred provider for low cost, high quality alternate source. \n \n● Matrix management of R&D, Sales, and Engineering of new product and customer development initiatives. Management of customer requirements, internal resources, alpha/beta manufacturing, source inspection, qualification, & high volume manufacturing sourcing, allocation, and management. 28% first year market acquisition / penetration for chamber hardware alternate source and parts extension for semiconductor manufacturers. \n● Created and deployed strategic sourcing plan and procurement strategy for semiconductor equipment, raw materials (direct & indirect), manufacturing capacity, MRO, & administrative spends. Pilot to full-scale operations within ~6 months with a 50% head count reduction. \n \nDirect Report Team: Procurement and Supply Chain Team. 8 full-time direct team members, 1 full-time matrix team member. Purchasing Manager Intel Corporation September 2000  –  September 2006  (6 years 1 month) Chandler, Arizona Led professional staff of supply chain individuals with budgetary responsibilities exceeding $165M for direct (raw materials) and indirect (equipment, spares), delivering minimum annual cost savings ~$16M through execution of sourcing strategies, alternate sourcing, consumption reduction, consignment, and vendor owned inventory programs. \n \n● Managed a team of local and global supply chain professionals / commodity managers against critical success indicators to develop and sustain uninterrupted flow of spares, chemical, gas, quartz, & micro-contamination materials and service to Arizona’s high volume semiconductor wafer factories utilizing just-in-time supply chain methodology. \n● Ownership for headcount, budgets, staffing, contract negotiations, consumption reduction, materials management strategies, yield improvements, design for cost, alternate / direct sourcing efforts, third party logistics program, & recent college graduate program.  \n● Drove business system improvement through automated systemic solution incorporating RFid, glass pipeline, and forecasting accuracy systems, utilizing Six Sigma methodology for analysis and implementation. Results included successful identification and pilot of RFid as a viable technology for organization, $500K ROI for glass pipeline implementation, and $1.75M NPV from forecast accuracy activities, expedite & headcount reduction, and productivity improvement. \n● Recipient of Intel Divisional Recognition Award for creation, deployment, and global execution of economic order quantity strategy to meet ~$12M profitability shortfall through elimination of on-hand inventories in direct & indirect commodities companywide.  \n \nDirect Report Team: Procurement and Supply Chain Team. 15 full-time direct team members, 20 full-time matrix team members. Purchasing Manager SmartPractice June 1998  –  September 2000  (2 years 4 months) Phoenix, Arizona Management of a team of supply chain professionals, Fortune 100 suppliers, manufacturing capacity, & key strategic global manufacturing partners in Asia with annual commodity spends exceeding $45M.  \n \n● Global procurement program implemented for product groups with team oversight of high mix, low volume materials through supplier performance improvement resulting in costs savings. Standardization of purchasing procedures & protocols, including MRP development & implementation. 62% transaction reduction through B2B initiative and EDI development and deployment. \n● Implemented cross-functional tiger team, reporting directly to CFO, to improve margins, market penetration, and generate additional sales through inventory reduction program. Partnered with Marketing and Sales to generate sales through promotions (SPIFF’s) – enabling inventory reduction of 17%, excess inventory by 33%, and backorder reduction by 41%. \n \nDirect Report Team: Procurement and Supply Chain Team. 4 full-time direct team members. 2 full-time matrix team members. Manager, Global Commodities SolarCity August 2015  – Present (1 month) Phoenix, Arizona Area Manager, Global Commodities SolarCity August 2015  – Present (1 month) Phoenix, Arizona Area Global Supply Chain, Project & Program Manager, Quality & ESH Manager Rinchem Company, Inc. May 2008  –  August 2015  (7 years 4 months) Chandler, Arizona Lead teams in US, Israel, & Taiwan to leverage supply chain strategic sourcing and quality best practices improve profitability, compliance, and to differentiate and increase competitive advantage in the market including expansion of market share in semiconductor segment with Fortune 100 customers. \n \n● Created centralized supply chain group, governance, and systems. Infrastructure to support supplier identification, qualification, risk assessment, approval, contracting, measurement, corrective actions, and audits. First year savings ~4.5%.  \n● Implemented first-of-kind dashboards, reports, and interactive tools - ushering business intelligence (Tableau) into the organization - turning raw data into corporate metrics driving quality supply chain business decisions for internal and external customers resulting in ~40% reduction of customer complaints, ~57% reduction of repeat defects, customer retention and stabilization, and award of new seven year contract.  \n● Developed quality organizational strategy, influencing to mobilize resources deploying Kaizen's. Installed root cause problem solving methodology and creation of preventative / corrective action system, driving process and behavioral modification. Two year results: accuracy rate 99.99937% to 99.99997%, DPMO 12.29 to 2.71, process σ 5.86 to 6.04.  \n● Recipient of the annual President’s Award for 2012 delivering critical supply chain and quality solutions to exceed customer expectations, scope and revenue expansion with core, primary customers. \n \nDirect Report Team: Supply Chain , Quality, Safety, Security, Environmental, Health, Data Product Management. 12 full-time direct team members, 1 full-time matrix team member. Global Supply Chain, Project & Program Manager, Quality & ESH Manager Rinchem Company, Inc. May 2008  –  August 2015  (7 years 4 months) Chandler, Arizona Lead teams in US, Israel, & Taiwan to leverage supply chain strategic sourcing and quality best practices improve profitability, compliance, and to differentiate and increase competitive advantage in the market including expansion of market share in semiconductor segment with Fortune 100 customers. \n \n● Created centralized supply chain group, governance, and systems. Infrastructure to support supplier identification, qualification, risk assessment, approval, contracting, measurement, corrective actions, and audits. First year savings ~4.5%.  \n● Implemented first-of-kind dashboards, reports, and interactive tools - ushering business intelligence (Tableau) into the organization - turning raw data into corporate metrics driving quality supply chain business decisions for internal and external customers resulting in ~40% reduction of customer complaints, ~57% reduction of repeat defects, customer retention and stabilization, and award of new seven year contract.  \n● Developed quality organizational strategy, influencing to mobilize resources deploying Kaizen's. Installed root cause problem solving methodology and creation of preventative / corrective action system, driving process and behavioral modification. Two year results: accuracy rate 99.99937% to 99.99997%, DPMO 12.29 to 2.71, process σ 5.86 to 6.04.  \n● Recipient of the annual President’s Award for 2012 delivering critical supply chain and quality solutions to exceed customer expectations, scope and revenue expansion with core, primary customers. \n \nDirect Report Team: Supply Chain , Quality, Safety, Security, Environmental, Health, Data Product Management. 12 full-time direct team members, 1 full-time matrix team member. Global Supply Chain Manager Applied Materials (AMAT) September 2006  –  May 2008  (1 year 9 months) Phoenix, Arizona Breakthrough savings and innovation providing OEM chamber hardware alternative with design for cost and manufacturing process improvement to deliver ~10% ($600K) initial cost savings executing to sourcing strategy for lead market position as preferred provider for low cost, high quality alternate source. \n \n● Matrix management of R&D, Sales, and Engineering of new product and customer development initiatives. Management of customer requirements, internal resources, alpha/beta manufacturing, source inspection, qualification, & high volume manufacturing sourcing, allocation, and management. 28% first year market acquisition / penetration for chamber hardware alternate source and parts extension for semiconductor manufacturers. \n● Created and deployed strategic sourcing plan and procurement strategy for semiconductor equipment, raw materials (direct & indirect), manufacturing capacity, MRO, & administrative spends. Pilot to full-scale operations within ~6 months with a 50% head count reduction. \n \nDirect Report Team: Procurement and Supply Chain Team. 8 full-time direct team members, 1 full-time matrix team member. Global Supply Chain Manager Applied Materials (AMAT) September 2006  –  May 2008  (1 year 9 months) Phoenix, Arizona Breakthrough savings and innovation providing OEM chamber hardware alternative with design for cost and manufacturing process improvement to deliver ~10% ($600K) initial cost savings executing to sourcing strategy for lead market position as preferred provider for low cost, high quality alternate source. \n \n● Matrix management of R&D, Sales, and Engineering of new product and customer development initiatives. Management of customer requirements, internal resources, alpha/beta manufacturing, source inspection, qualification, & high volume manufacturing sourcing, allocation, and management. 28% first year market acquisition / penetration for chamber hardware alternate source and parts extension for semiconductor manufacturers. \n● Created and deployed strategic sourcing plan and procurement strategy for semiconductor equipment, raw materials (direct & indirect), manufacturing capacity, MRO, & administrative spends. Pilot to full-scale operations within ~6 months with a 50% head count reduction. \n \nDirect Report Team: Procurement and Supply Chain Team. 8 full-time direct team members, 1 full-time matrix team member. Purchasing Manager Intel Corporation September 2000  –  September 2006  (6 years 1 month) Chandler, Arizona Led professional staff of supply chain individuals with budgetary responsibilities exceeding $165M for direct (raw materials) and indirect (equipment, spares), delivering minimum annual cost savings ~$16M through execution of sourcing strategies, alternate sourcing, consumption reduction, consignment, and vendor owned inventory programs. \n \n● Managed a team of local and global supply chain professionals / commodity managers against critical success indicators to develop and sustain uninterrupted flow of spares, chemical, gas, quartz, & micro-contamination materials and service to Arizona’s high volume semiconductor wafer factories utilizing just-in-time supply chain methodology. \n● Ownership for headcount, budgets, staffing, contract negotiations, consumption reduction, materials management strategies, yield improvements, design for cost, alternate / direct sourcing efforts, third party logistics program, & recent college graduate program.  \n● Drove business system improvement through automated systemic solution incorporating RFid, glass pipeline, and forecasting accuracy systems, utilizing Six Sigma methodology for analysis and implementation. Results included successful identification and pilot of RFid as a viable technology for organization, $500K ROI for glass pipeline implementation, and $1.75M NPV from forecast accuracy activities, expedite & headcount reduction, and productivity improvement. \n● Recipient of Intel Divisional Recognition Award for creation, deployment, and global execution of economic order quantity strategy to meet ~$12M profitability shortfall through elimination of on-hand inventories in direct & indirect commodities companywide.  \n \nDirect Report Team: Procurement and Supply Chain Team. 15 full-time direct team members, 20 full-time matrix team members. Purchasing Manager Intel Corporation September 2000  –  September 2006  (6 years 1 month) Chandler, Arizona Led professional staff of supply chain individuals with budgetary responsibilities exceeding $165M for direct (raw materials) and indirect (equipment, spares), delivering minimum annual cost savings ~$16M through execution of sourcing strategies, alternate sourcing, consumption reduction, consignment, and vendor owned inventory programs. \n \n● Managed a team of local and global supply chain professionals / commodity managers against critical success indicators to develop and sustain uninterrupted flow of spares, chemical, gas, quartz, & micro-contamination materials and service to Arizona’s high volume semiconductor wafer factories utilizing just-in-time supply chain methodology. \n● Ownership for headcount, budgets, staffing, contract negotiations, consumption reduction, materials management strategies, yield improvements, design for cost, alternate / direct sourcing efforts, third party logistics program, & recent college graduate program.  \n● Drove business system improvement through automated systemic solution incorporating RFid, glass pipeline, and forecasting accuracy systems, utilizing Six Sigma methodology for analysis and implementation. Results included successful identification and pilot of RFid as a viable technology for organization, $500K ROI for glass pipeline implementation, and $1.75M NPV from forecast accuracy activities, expedite & headcount reduction, and productivity improvement. \n● Recipient of Intel Divisional Recognition Award for creation, deployment, and global execution of economic order quantity strategy to meet ~$12M profitability shortfall through elimination of on-hand inventories in direct & indirect commodities companywide.  \n \nDirect Report Team: Procurement and Supply Chain Team. 15 full-time direct team members, 20 full-time matrix team members. Purchasing Manager SmartPractice June 1998  –  September 2000  (2 years 4 months) Phoenix, Arizona Management of a team of supply chain professionals, Fortune 100 suppliers, manufacturing capacity, & key strategic global manufacturing partners in Asia with annual commodity spends exceeding $45M.  \n \n● Global procurement program implemented for product groups with team oversight of high mix, low volume materials through supplier performance improvement resulting in costs savings. Standardization of purchasing procedures & protocols, including MRP development & implementation. 62% transaction reduction through B2B initiative and EDI development and deployment. \n● Implemented cross-functional tiger team, reporting directly to CFO, to improve margins, market penetration, and generate additional sales through inventory reduction program. Partnered with Marketing and Sales to generate sales through promotions (SPIFF’s) – enabling inventory reduction of 17%, excess inventory by 33%, and backorder reduction by 41%. \n \nDirect Report Team: Procurement and Supply Chain Team. 4 full-time direct team members. 2 full-time matrix team members. Purchasing Manager SmartPractice June 1998  –  September 2000  (2 years 4 months) Phoenix, Arizona Management of a team of supply chain professionals, Fortune 100 suppliers, manufacturing capacity, & key strategic global manufacturing partners in Asia with annual commodity spends exceeding $45M.  \n \n● Global procurement program implemented for product groups with team oversight of high mix, low volume materials through supplier performance improvement resulting in costs savings. Standardization of purchasing procedures & protocols, including MRP development & implementation. 62% transaction reduction through B2B initiative and EDI development and deployment. \n● Implemented cross-functional tiger team, reporting directly to CFO, to improve margins, market penetration, and generate additional sales through inventory reduction program. Partnered with Marketing and Sales to generate sales through promotions (SPIFF’s) – enabling inventory reduction of 17%, excess inventory by 33%, and backorder reduction by 41%. \n \nDirect Report Team: Procurement and Supply Chain Team. 4 full-time direct team members. 2 full-time matrix team members. Languages   Skills Strategic Sourcing Strategic Planning eRFx Procurement Supply Chain Management Quality Management Project Management International Business MBA Supply Management Supply Chain... Cross-functional Team... Program Management RFx Process Improvement Strategy Continuous Improvement Logistics Sourcing Manufacturing Supply Chain Management Leadership Six Sigma Materials Management Training Warehousing Change Management Process Engineering Contract Negotiation Coaching Purchasing Team Building SAP Budgets Lean Manufacturing Product Development Operational Excellence Team Management Start-ups Transportation Supply Chain Operations Production Planning Global Sourcing Inventory Management Forecasting Operations Management Human Resources Logistics Management Negotiation See 35+     See less Skills  Strategic Sourcing Strategic Planning eRFx Procurement Supply Chain Management Quality Management Project Management International Business MBA Supply Management Supply Chain... Cross-functional Team... Program Management RFx Process Improvement Strategy Continuous Improvement Logistics Sourcing Manufacturing Supply Chain Management Leadership Six Sigma Materials Management Training Warehousing Change Management Process Engineering Contract Negotiation Coaching Purchasing Team Building SAP Budgets Lean Manufacturing Product Development Operational Excellence Team Management Start-ups Transportation Supply Chain Operations Production Planning Global Sourcing Inventory Management Forecasting Operations Management Human Resources Logistics Management Negotiation See 35+     See less Strategic Sourcing Strategic Planning eRFx Procurement Supply Chain Management Quality Management Project Management International Business MBA Supply Management Supply Chain... Cross-functional Team... Program Management RFx Process Improvement Strategy Continuous Improvement Logistics Sourcing Manufacturing Supply Chain Management Leadership Six Sigma Materials Management Training Warehousing Change Management Process Engineering Contract Negotiation Coaching Purchasing Team Building SAP Budgets Lean Manufacturing Product Development Operational Excellence Team Management Start-ups Transportation Supply Chain Operations Production Planning Global Sourcing Inventory Management Forecasting Operations Management Human Resources Logistics Management Negotiation See 35+     See less Strategic Sourcing Strategic Planning eRFx Procurement Supply Chain Management Quality Management Project Management International Business MBA Supply Management Supply Chain... Cross-functional Team... Program Management RFx Process Improvement Strategy Continuous Improvement Logistics Sourcing Manufacturing Supply Chain Management Leadership Six Sigma Materials Management Training Warehousing Change Management Process Engineering Contract Negotiation Coaching Purchasing Team Building SAP Budgets Lean Manufacturing Product Development Operational Excellence Team Management Start-ups Transportation Supply Chain Operations Production Planning Global Sourcing Inventory Management Forecasting Operations Management Human Resources Logistics Management Negotiation See 35+     See less Education Arizona State University - W. P. Carey School of Business MBA,  Finance 2002  – 2004 Arizona State University Bachelor of Science,  Public Programs August 1993  – May 1996 Arizona State University - W. P. Carey School of Business MBA,  Finance 2002  – 2004 Arizona State University - W. P. Carey School of Business MBA,  Finance 2002  – 2004 Arizona State University - W. P. Carey School of Business MBA,  Finance 2002  – 2004 Arizona State University Bachelor of Science,  Public Programs August 1993  – May 1996 Arizona State University Bachelor of Science,  Public Programs August 1993  – May 1996 Arizona State University Bachelor of Science,  Public Programs August 1993  – May 1996 ", "Summary VICE PRESIDENT / DIRECTOR – OPERATIONS / SUPPLY CHAIN \n \nAs a multifaceted operations and supply chain professional, I maximize output, efficiencies and cost controls to ensure profitability in difficult market conditions. I excel in turning around domestic and international multi-location organizations to best use resources. \n \nI bring seamless integration of new and improved ideas and processes to domestic and international organizations, and I have documented successes that have delivered world class results in manufacturing, semiconductor, alternate energy, industrial equipment, logistics and Fortune 100 companies. My strengths include:  \n \n•\tTransforming organizations into strategically focused high performance teams \n•\tExcelling in managing cross-cultural organizations \n•\tDelivering significant cost reductions \n•\tMaximizing global supply chains \n•\tImproving productivity to ensure profitability \n \nI earned my MBA from Thunderbird, The American Graduate School of International Management, and my BBA is from Trinity University. I am Six Sigma Green belt certified. Others describe me as a self-starter with strong attention to detail. I negotiate win-win outcomes, and have excellent team leadership abilities. Specialties:P&L / Lean Manufacturing / Asian Sourcing / Inventory Cost Control / B2B / Vendor Management Asset Control / MRP / Outsourcing / Contracts / Pricing / Kaizen / Turnarounds / Product Launch Summary VICE PRESIDENT / DIRECTOR – OPERATIONS / SUPPLY CHAIN \n \nAs a multifaceted operations and supply chain professional, I maximize output, efficiencies and cost controls to ensure profitability in difficult market conditions. I excel in turning around domestic and international multi-location organizations to best use resources. \n \nI bring seamless integration of new and improved ideas and processes to domestic and international organizations, and I have documented successes that have delivered world class results in manufacturing, semiconductor, alternate energy, industrial equipment, logistics and Fortune 100 companies. My strengths include:  \n \n•\tTransforming organizations into strategically focused high performance teams \n•\tExcelling in managing cross-cultural organizations \n•\tDelivering significant cost reductions \n•\tMaximizing global supply chains \n•\tImproving productivity to ensure profitability \n \nI earned my MBA from Thunderbird, The American Graduate School of International Management, and my BBA is from Trinity University. I am Six Sigma Green belt certified. Others describe me as a self-starter with strong attention to detail. I negotiate win-win outcomes, and have excellent team leadership abilities. Specialties:P&L / Lean Manufacturing / Asian Sourcing / Inventory Cost Control / B2B / Vendor Management Asset Control / MRP / Outsourcing / Contracts / Pricing / Kaizen / Turnarounds / Product Launch VICE PRESIDENT / DIRECTOR – OPERATIONS / SUPPLY CHAIN \n \nAs a multifaceted operations and supply chain professional, I maximize output, efficiencies and cost controls to ensure profitability in difficult market conditions. I excel in turning around domestic and international multi-location organizations to best use resources. \n \nI bring seamless integration of new and improved ideas and processes to domestic and international organizations, and I have documented successes that have delivered world class results in manufacturing, semiconductor, alternate energy, industrial equipment, logistics and Fortune 100 companies. My strengths include:  \n \n•\tTransforming organizations into strategically focused high performance teams \n•\tExcelling in managing cross-cultural organizations \n•\tDelivering significant cost reductions \n•\tMaximizing global supply chains \n•\tImproving productivity to ensure profitability \n \nI earned my MBA from Thunderbird, The American Graduate School of International Management, and my BBA is from Trinity University. I am Six Sigma Green belt certified. Others describe me as a self-starter with strong attention to detail. I negotiate win-win outcomes, and have excellent team leadership abilities. Specialties:P&L / Lean Manufacturing / Asian Sourcing / Inventory Cost Control / B2B / Vendor Management Asset Control / MRP / Outsourcing / Contracts / Pricing / Kaizen / Turnarounds / Product Launch VICE PRESIDENT / DIRECTOR – OPERATIONS / SUPPLY CHAIN \n \nAs a multifaceted operations and supply chain professional, I maximize output, efficiencies and cost controls to ensure profitability in difficult market conditions. I excel in turning around domestic and international multi-location organizations to best use resources. \n \nI bring seamless integration of new and improved ideas and processes to domestic and international organizations, and I have documented successes that have delivered world class results in manufacturing, semiconductor, alternate energy, industrial equipment, logistics and Fortune 100 companies. My strengths include:  \n \n•\tTransforming organizations into strategically focused high performance teams \n•\tExcelling in managing cross-cultural organizations \n•\tDelivering significant cost reductions \n•\tMaximizing global supply chains \n•\tImproving productivity to ensure profitability \n \nI earned my MBA from Thunderbird, The American Graduate School of International Management, and my BBA is from Trinity University. I am Six Sigma Green belt certified. Others describe me as a self-starter with strong attention to detail. I negotiate win-win outcomes, and have excellent team leadership abilities. Specialties:P&L / Lean Manufacturing / Asian Sourcing / Inventory Cost Control / B2B / Vendor Management Asset Control / MRP / Outsourcing / Contracts / Pricing / Kaizen / Turnarounds / Product Launch Experience Senior Director - Supply Chain Seventy Seven Energy July 2014  – Present (1 year 2 months) Senior Director - Supply Chain Chesapeake Oilfield Services May 2012  –  June 2014  (2 years 2 months) Oklahoma City, Oklahoma Area Chief Executive Officer GILA TRUCKING May 2011  –  May 2012  (1 year 1 month) Gila Trucking, LLC a $15M oil, gas and energy trucking company, 2011 to present. Direct P&L for logistics company including oversight of operations, procurement, fleet management, strategic planning and business development. Manage 50 employees and oversee $15M budget. General Manager NORTH AMERICAN POWER SYSTEMS October 2008  –  May 2011  (2 years 8 months) (NorAm), a $12M industrial equipment company, 2008 to 2011. Managed turnaround activities and oversaw production, warehousing, sourcing and inventory control. Directed staff of 40. Accepted additional role and managed both the North American Power System and Warren CAT positions concurrently. Director of Purchasing Warren Cat May 2008  –  May 2011  (3 years 1 month) Midland, TX • Led the corporate procurement organization responsible for over $100M in spends in indirect and direct commodities. \n• Developed and grew the corporate procurement department and achieved over $5M in savings through alternate sourcing and supplier consolidation while improving product and service quality as measured through supplier report cards. \n• Implemented corporate purchasing policies and developed a preferred supplier base to ensure spending controls, compliance, quality, and cost savings.  \n• Led the Caterpillar Dealerships of North American Purchasing Group as Chairman and negotiated multiple contracts and benchmark projects on behalf of over 40 CAT Dealerships which resulted in cost savings and improved purchasing practices. Director of Purchasing Evergreen Solar February 2005  –  April 2008  (3 years 3 months) Global Manufacturer of silicon wafers, cells, and photovoltaic panels \nDirector of Purchasing \n \nLed the corporate supply chain organization responsible for the development and implementation of global strategic sourcing strategies and supplier management of critical raw materials and capital equipment, overall corporate spending (~$400M global spends), and operational support for technology development and high volume manufacturing operations. \nDeveloped and implemented key supply chain tools, metrics, and business processes: developed and implemented a supplier report card, improved on time delivery from an average of 50% to >85% in 1 year, and oversaw the implementation of a MRP/ERP system corporate wide; developed Corporate Supply Agreements and purchase order terms and conditions; established controls to improve spending visibility and ensure Sarbanes Oxley compliance. \nEstablished strategic partnerships and negotiated multi-year, multi-site supply agreements with key suppliers (U.S., Europe, and Asia) in support of significant manufacturing operation expansions (>100% average annual growth rate) while accomplishing an average of >10% annual cost savings for key commodities. \nLed key corporate initiatives and programs: drove supply chain readiness for joint venture factories in Germany and high volume factory expansion in the U.S., developed strategic cost reduction and sourcing roadmaps in support of corporate long-range plans, implemented a corporate procurement card to improve productivity by 30% while improving spends controls. \nDeveloped the corporate supply chain organization in support of corporate strategic programs and growth in spending from $40M to $400M in 3 years. Americas Indirect Materials Manager Intel Corporation January 2003  –  February 2005  (2 years 2 months) Managed a team of 18 people in support of Assembly Technology Development (ATD) Operations in Chandler and Costa Rica Assembly Test Manufacturing.  \nLed a global, cross functional Joint Material Operations team and drove multiple global teams to achieve $46.6M of cost savings, 68% consignment inventory, and significant improvements in controls, business continuity planning, and business processes. \nCollaborated with cross functional organizations to develop a global infrastructure to ensure 100% materials and service readiness for new capital equipment start-ups. \nDeveloped a global, competitive sourcing team focused on consolidating over 200 suppliers and enabling sourcing of over $180M of material spends through a focused supply base. \nLed a 6 Sigma Green Belt project that delivered 100% warranty capture ($20M ROI) and improved asset management on capital equipment through improved data integrity. Direct Materials Purchasing Manager Intel Corporation April 2001  –  December 2002  (1 year 9 months) Managed a team of 8 people in support of ATD Operations and achieved all time high operational indicator goals (inventory, controls, and cost) in 2001. \nPartnered with Finance to reduce scrap by over 90% and to reduce excess inventory by 62%. Maintained less than 30 days of inventory with no availability issues to ATD. \nIntroduced departmental and global cost savings goals. Achieved $3M in cost savings from a goal of $2M in 2001 and achieved over $28.5M in 2002 from a goal of $16.6M. \nDeveloped a global infrastructure for direct material purchasing organizations to focus on cost savings, people development, business process, and productivity. \nManaged $30M of procurement and inventory for a complex development and engineering operation, ensuring all requirements for direct materials were supported within ATD. Director of Sales FLI LINE TOOL CORPORATION January 1995  –  January 1997  (2 years 1 month) Developed and implemented pricing and cost strategies for core products that resulted in 150% increase in revenue in 2 years.  \nCreated and negotiated contracts with strategic business partners and investors. Senior Director - Supply Chain Seventy Seven Energy July 2014  – Present (1 year 2 months) Senior Director - Supply Chain Seventy Seven Energy July 2014  – Present (1 year 2 months) Senior Director - Supply Chain Chesapeake Oilfield Services May 2012  –  June 2014  (2 years 2 months) Oklahoma City, Oklahoma Area Senior Director - Supply Chain Chesapeake Oilfield Services May 2012  –  June 2014  (2 years 2 months) Oklahoma City, Oklahoma Area Chief Executive Officer GILA TRUCKING May 2011  –  May 2012  (1 year 1 month) Gila Trucking, LLC a $15M oil, gas and energy trucking company, 2011 to present. Direct P&L for logistics company including oversight of operations, procurement, fleet management, strategic planning and business development. Manage 50 employees and oversee $15M budget. Chief Executive Officer GILA TRUCKING May 2011  –  May 2012  (1 year 1 month) Gila Trucking, LLC a $15M oil, gas and energy trucking company, 2011 to present. Direct P&L for logistics company including oversight of operations, procurement, fleet management, strategic planning and business development. Manage 50 employees and oversee $15M budget. General Manager NORTH AMERICAN POWER SYSTEMS October 2008  –  May 2011  (2 years 8 months) (NorAm), a $12M industrial equipment company, 2008 to 2011. Managed turnaround activities and oversaw production, warehousing, sourcing and inventory control. Directed staff of 40. Accepted additional role and managed both the North American Power System and Warren CAT positions concurrently. General Manager NORTH AMERICAN POWER SYSTEMS October 2008  –  May 2011  (2 years 8 months) (NorAm), a $12M industrial equipment company, 2008 to 2011. Managed turnaround activities and oversaw production, warehousing, sourcing and inventory control. Directed staff of 40. Accepted additional role and managed both the North American Power System and Warren CAT positions concurrently. Director of Purchasing Warren Cat May 2008  –  May 2011  (3 years 1 month) Midland, TX • Led the corporate procurement organization responsible for over $100M in spends in indirect and direct commodities. \n• Developed and grew the corporate procurement department and achieved over $5M in savings through alternate sourcing and supplier consolidation while improving product and service quality as measured through supplier report cards. \n• Implemented corporate purchasing policies and developed a preferred supplier base to ensure spending controls, compliance, quality, and cost savings.  \n• Led the Caterpillar Dealerships of North American Purchasing Group as Chairman and negotiated multiple contracts and benchmark projects on behalf of over 40 CAT Dealerships which resulted in cost savings and improved purchasing practices. Director of Purchasing Warren Cat May 2008  –  May 2011  (3 years 1 month) Midland, TX • Led the corporate procurement organization responsible for over $100M in spends in indirect and direct commodities. \n• Developed and grew the corporate procurement department and achieved over $5M in savings through alternate sourcing and supplier consolidation while improving product and service quality as measured through supplier report cards. \n• Implemented corporate purchasing policies and developed a preferred supplier base to ensure spending controls, compliance, quality, and cost savings.  \n• Led the Caterpillar Dealerships of North American Purchasing Group as Chairman and negotiated multiple contracts and benchmark projects on behalf of over 40 CAT Dealerships which resulted in cost savings and improved purchasing practices. Director of Purchasing Evergreen Solar February 2005  –  April 2008  (3 years 3 months) Global Manufacturer of silicon wafers, cells, and photovoltaic panels \nDirector of Purchasing \n \nLed the corporate supply chain organization responsible for the development and implementation of global strategic sourcing strategies and supplier management of critical raw materials and capital equipment, overall corporate spending (~$400M global spends), and operational support for technology development and high volume manufacturing operations. \nDeveloped and implemented key supply chain tools, metrics, and business processes: developed and implemented a supplier report card, improved on time delivery from an average of 50% to >85% in 1 year, and oversaw the implementation of a MRP/ERP system corporate wide; developed Corporate Supply Agreements and purchase order terms and conditions; established controls to improve spending visibility and ensure Sarbanes Oxley compliance. \nEstablished strategic partnerships and negotiated multi-year, multi-site supply agreements with key suppliers (U.S., Europe, and Asia) in support of significant manufacturing operation expansions (>100% average annual growth rate) while accomplishing an average of >10% annual cost savings for key commodities. \nLed key corporate initiatives and programs: drove supply chain readiness for joint venture factories in Germany and high volume factory expansion in the U.S., developed strategic cost reduction and sourcing roadmaps in support of corporate long-range plans, implemented a corporate procurement card to improve productivity by 30% while improving spends controls. \nDeveloped the corporate supply chain organization in support of corporate strategic programs and growth in spending from $40M to $400M in 3 years. Director of Purchasing Evergreen Solar February 2005  –  April 2008  (3 years 3 months) Global Manufacturer of silicon wafers, cells, and photovoltaic panels \nDirector of Purchasing \n \nLed the corporate supply chain organization responsible for the development and implementation of global strategic sourcing strategies and supplier management of critical raw materials and capital equipment, overall corporate spending (~$400M global spends), and operational support for technology development and high volume manufacturing operations. \nDeveloped and implemented key supply chain tools, metrics, and business processes: developed and implemented a supplier report card, improved on time delivery from an average of 50% to >85% in 1 year, and oversaw the implementation of a MRP/ERP system corporate wide; developed Corporate Supply Agreements and purchase order terms and conditions; established controls to improve spending visibility and ensure Sarbanes Oxley compliance. \nEstablished strategic partnerships and negotiated multi-year, multi-site supply agreements with key suppliers (U.S., Europe, and Asia) in support of significant manufacturing operation expansions (>100% average annual growth rate) while accomplishing an average of >10% annual cost savings for key commodities. \nLed key corporate initiatives and programs: drove supply chain readiness for joint venture factories in Germany and high volume factory expansion in the U.S., developed strategic cost reduction and sourcing roadmaps in support of corporate long-range plans, implemented a corporate procurement card to improve productivity by 30% while improving spends controls. \nDeveloped the corporate supply chain organization in support of corporate strategic programs and growth in spending from $40M to $400M in 3 years. Americas Indirect Materials Manager Intel Corporation January 2003  –  February 2005  (2 years 2 months) Managed a team of 18 people in support of Assembly Technology Development (ATD) Operations in Chandler and Costa Rica Assembly Test Manufacturing.  \nLed a global, cross functional Joint Material Operations team and drove multiple global teams to achieve $46.6M of cost savings, 68% consignment inventory, and significant improvements in controls, business continuity planning, and business processes. \nCollaborated with cross functional organizations to develop a global infrastructure to ensure 100% materials and service readiness for new capital equipment start-ups. \nDeveloped a global, competitive sourcing team focused on consolidating over 200 suppliers and enabling sourcing of over $180M of material spends through a focused supply base. \nLed a 6 Sigma Green Belt project that delivered 100% warranty capture ($20M ROI) and improved asset management on capital equipment through improved data integrity. Americas Indirect Materials Manager Intel Corporation January 2003  –  February 2005  (2 years 2 months) Managed a team of 18 people in support of Assembly Technology Development (ATD) Operations in Chandler and Costa Rica Assembly Test Manufacturing.  \nLed a global, cross functional Joint Material Operations team and drove multiple global teams to achieve $46.6M of cost savings, 68% consignment inventory, and significant improvements in controls, business continuity planning, and business processes. \nCollaborated with cross functional organizations to develop a global infrastructure to ensure 100% materials and service readiness for new capital equipment start-ups. \nDeveloped a global, competitive sourcing team focused on consolidating over 200 suppliers and enabling sourcing of over $180M of material spends through a focused supply base. \nLed a 6 Sigma Green Belt project that delivered 100% warranty capture ($20M ROI) and improved asset management on capital equipment through improved data integrity. Direct Materials Purchasing Manager Intel Corporation April 2001  –  December 2002  (1 year 9 months) Managed a team of 8 people in support of ATD Operations and achieved all time high operational indicator goals (inventory, controls, and cost) in 2001. \nPartnered with Finance to reduce scrap by over 90% and to reduce excess inventory by 62%. Maintained less than 30 days of inventory with no availability issues to ATD. \nIntroduced departmental and global cost savings goals. Achieved $3M in cost savings from a goal of $2M in 2001 and achieved over $28.5M in 2002 from a goal of $16.6M. \nDeveloped a global infrastructure for direct material purchasing organizations to focus on cost savings, people development, business process, and productivity. \nManaged $30M of procurement and inventory for a complex development and engineering operation, ensuring all requirements for direct materials were supported within ATD. Direct Materials Purchasing Manager Intel Corporation April 2001  –  December 2002  (1 year 9 months) Managed a team of 8 people in support of ATD Operations and achieved all time high operational indicator goals (inventory, controls, and cost) in 2001. \nPartnered with Finance to reduce scrap by over 90% and to reduce excess inventory by 62%. Maintained less than 30 days of inventory with no availability issues to ATD. \nIntroduced departmental and global cost savings goals. Achieved $3M in cost savings from a goal of $2M in 2001 and achieved over $28.5M in 2002 from a goal of $16.6M. \nDeveloped a global infrastructure for direct material purchasing organizations to focus on cost savings, people development, business process, and productivity. \nManaged $30M of procurement and inventory for a complex development and engineering operation, ensuring all requirements for direct materials were supported within ATD. Director of Sales FLI LINE TOOL CORPORATION January 1995  –  January 1997  (2 years 1 month) Developed and implemented pricing and cost strategies for core products that resulted in 150% increase in revenue in 2 years.  \nCreated and negotiated contracts with strategic business partners and investors. Director of Sales FLI LINE TOOL CORPORATION January 1995  –  January 1997  (2 years 1 month) Developed and implemented pricing and cost strategies for core products that resulted in 150% increase in revenue in 2 years.  \nCreated and negotiated contracts with strategic business partners and investors. Skills Strategic Sourcing Supply Management Supply Chain Management Lean Manufacturing Global Sourcing Six Sigma Purchasing Supply Chain Procurement Manufacturing Sourcing Contract Negotiation Process Improvement Cross-functional Team... Continuous Improvement Contract Manufacturing Negotiation Operations Management Contract Management Logistics Management Program Management Sales Strategy Team Building See 10+     See less Skills  Strategic Sourcing Supply Management Supply Chain Management Lean Manufacturing Global Sourcing Six Sigma Purchasing Supply Chain Procurement Manufacturing Sourcing Contract Negotiation Process Improvement Cross-functional Team... Continuous Improvement Contract Manufacturing Negotiation Operations Management Contract Management Logistics Management Program Management Sales Strategy Team Building See 10+     See less Strategic Sourcing Supply Management Supply Chain Management Lean Manufacturing Global Sourcing Six Sigma Purchasing Supply Chain Procurement Manufacturing Sourcing Contract Negotiation Process Improvement Cross-functional Team... Continuous Improvement Contract Manufacturing Negotiation Operations Management Contract Management Logistics Management Program Management Sales Strategy Team Building See 10+     See less Strategic Sourcing Supply Management Supply Chain Management Lean Manufacturing Global Sourcing Six Sigma Purchasing Supply Chain Procurement Manufacturing Sourcing Contract Negotiation Process Improvement Cross-functional Team... Continuous Improvement Contract Manufacturing Negotiation Operations Management Contract Management Logistics Management Program Management Sales Strategy Team Building See 10+     See less Education Thunderbird School of Global Management MBA,  International Management - Operations 1997  – 1999 Activities and Societies:  Rugby Club Trinity University Bachelor of Science,  Finance ,  International Business ,  Marketing 1990  – 1994 Activities and Societies:  Alpha Kappa Psi ,  Tennis Team Thunderbird School of Global Management MBA,  International Management - Operations 1997  – 1999 Activities and Societies:  Rugby Club Thunderbird School of Global Management MBA,  International Management - Operations 1997  – 1999 Activities and Societies:  Rugby Club Thunderbird School of Global Management MBA,  International Management - Operations 1997  – 1999 Activities and Societies:  Rugby Club Trinity University Bachelor of Science,  Finance ,  International Business ,  Marketing 1990  – 1994 Activities and Societies:  Alpha Kappa Psi ,  Tennis Team Trinity University Bachelor of Science,  Finance ,  International Business ,  Marketing 1990  – 1994 Activities and Societies:  Alpha Kappa Psi ,  Tennis Team Trinity University Bachelor of Science,  Finance ,  International Business ,  Marketing 1990  – 1994 Activities and Societies:  Alpha Kappa Psi ,  Tennis Team ", "Experience President and Owner Ennlovation LLC May 2015  – Present (4 months) Portland, Oregon Area Director, Treasurer Energy Trust of Oregon April 2008  – Present (7 years 5 months) Portland, Oregon Supply Chain Manager, MSO Intel Corporation July 2012  –  May 2015  (2 years 11 months) Hillsboro, OR Facilities Purchasing Manager Intel Corporation October 2005  –  June 2012  (6 years 9 months) Hillsboro, OR Engineering Manager (acting) Intel March 2011  –  September 2011  (7 months) Retired Captain United States Navy 1984  –  2009  (25 years) International SEMATECH I300I Patterning (litho / etch) Director Sematech 1996  –  1999  (3 years) President and Owner Ennlovation LLC May 2015  – Present (4 months) Portland, Oregon Area President and Owner Ennlovation LLC May 2015  – Present (4 months) Portland, Oregon Area Director, Treasurer Energy Trust of Oregon April 2008  – Present (7 years 5 months) Portland, Oregon Director, Treasurer Energy Trust of Oregon April 2008  – Present (7 years 5 months) Portland, Oregon Supply Chain Manager, MSO Intel Corporation July 2012  –  May 2015  (2 years 11 months) Hillsboro, OR Supply Chain Manager, MSO Intel Corporation July 2012  –  May 2015  (2 years 11 months) Hillsboro, OR Facilities Purchasing Manager Intel Corporation October 2005  –  June 2012  (6 years 9 months) Hillsboro, OR Facilities Purchasing Manager Intel Corporation October 2005  –  June 2012  (6 years 9 months) Hillsboro, OR Engineering Manager (acting) Intel March 2011  –  September 2011  (7 months) Engineering Manager (acting) Intel March 2011  –  September 2011  (7 months) Retired Captain United States Navy 1984  –  2009  (25 years) Retired Captain United States Navy 1984  –  2009  (25 years) International SEMATECH I300I Patterning (litho / etch) Director Sematech 1996  –  1999  (3 years) International SEMATECH I300I Patterning (litho / etch) Director Sematech 1996  –  1999  (3 years) Skills Software Engineering Intellectual Property Ion Implantation Lithography Applied Physics Contract Negotiations Patent Drafting Corporate Governance Contract Negotiation Procurement Patents Physics R&D Renewable Energy Leadership Engineering Product Development IC Semiconductors Design of Experiments Semiconductor Industry Purchasing Start-ups SPC Manufacturing Materials Cross-functional Team... Project Planning Management Supply Chain Process Improvement Strategic Sourcing Strategy Navy Program Management Electronics Supply Management Engineering Management Solar Energy Continuous Improvement Nuclear Process Engineering JMP Six Sigma Metrology Process Simulation Quality Management Lean Manufacturing Team Mentoring Professional Mentoring See 35+     See less Skills  Software Engineering Intellectual Property Ion Implantation Lithography Applied Physics Contract Negotiations Patent Drafting Corporate Governance Contract Negotiation Procurement Patents Physics R&D Renewable Energy Leadership Engineering Product Development IC Semiconductors Design of Experiments Semiconductor Industry Purchasing Start-ups SPC Manufacturing Materials Cross-functional Team... Project Planning Management Supply Chain Process Improvement Strategic Sourcing Strategy Navy Program Management Electronics Supply Management Engineering Management Solar Energy Continuous Improvement Nuclear Process Engineering JMP Six Sigma Metrology Process Simulation Quality Management Lean Manufacturing Team Mentoring Professional Mentoring See 35+     See less Software Engineering Intellectual Property Ion Implantation Lithography Applied Physics Contract Negotiations Patent Drafting Corporate Governance Contract Negotiation Procurement Patents Physics R&D Renewable Energy Leadership Engineering Product Development IC Semiconductors Design of Experiments Semiconductor Industry Purchasing Start-ups SPC Manufacturing Materials Cross-functional Team... Project Planning Management Supply Chain Process Improvement Strategic Sourcing Strategy Navy Program Management Electronics Supply Management Engineering Management Solar Energy Continuous Improvement Nuclear Process Engineering JMP Six Sigma Metrology Process Simulation Quality Management Lean Manufacturing Team Mentoring Professional Mentoring See 35+     See less Software Engineering Intellectual Property Ion Implantation Lithography Applied Physics Contract Negotiations Patent Drafting Corporate Governance Contract Negotiation Procurement Patents Physics R&D Renewable Energy Leadership Engineering Product Development IC Semiconductors Design of Experiments Semiconductor Industry Purchasing Start-ups SPC Manufacturing Materials Cross-functional Team... Project Planning Management Supply Chain Process Improvement Strategic Sourcing Strategy Navy Program Management Electronics Supply Management Engineering Management Solar Energy Continuous Improvement Nuclear Process Engineering JMP Six Sigma Metrology Process Simulation Quality Management Lean Manufacturing Team Mentoring Professional Mentoring See 35+     See less Education US Navy Nuclear Power Program Navy 5203P, certified Masters Degree level, proven subspecialty 1980  – 1981 United States Naval Academy BS EE 1975  – 1979 US Navy Nuclear Power Program Navy 5203P, certified Masters Degree level, proven subspecialty 1980  – 1981 US Navy Nuclear Power Program Navy 5203P, certified Masters Degree level, proven subspecialty 1980  – 1981 US Navy Nuclear Power Program Navy 5203P, certified Masters Degree level, proven subspecialty 1980  – 1981 United States Naval Academy BS EE 1975  – 1979 United States Naval Academy BS EE 1975  – 1979 United States Naval Academy BS EE 1975  – 1979 Honors & Awards Additional Honors & Awards Intel TMG Excellence Award - 2014 \n2 US patents in EUV Lithography - 2004 \nUS Navy Meritorious Service Medals (2) Additional Honors & Awards Intel TMG Excellence Award - 2014 \n2 US patents in EUV Lithography - 2004 \nUS Navy Meritorious Service Medals (2) Additional Honors & Awards Intel TMG Excellence Award - 2014 \n2 US patents in EUV Lithography - 2004 \nUS Navy Meritorious Service Medals (2) Additional Honors & Awards Intel TMG Excellence Award - 2014 \n2 US patents in EUV Lithography - 2004 \nUS Navy Meritorious Service Medals (2) ", "Summary Senior Sourcing and Supply Chain leader with extensive experience in the high tech manufacturing and Cloud services. Developed innovative supply chain practices to drive cost reduction while ensuring continuity of supply and time to market. Proven track record of raising the level of organizational performance and strategic contribution. Significant experience in vendor negotiations, outsourced manufacturing, supply chain planning & business process development. United States Government Top Secret Security clearance. \n \nSpecialties: • Leading global supply chain organizations supporting Cloud Infrastructure \n• OEM and ODM negotiations, business award/allocation while ensuring continuity of supply \n• Excel in people leadership, including performance management, coaching, team development & change management \n• Transformation of site/region focused to globally focused & aligned organizations \n• Vendor negotiation and management with particular focus in IT, outsourced manufacturing, site services and consulting disciplines \n• Business process development Summary Senior Sourcing and Supply Chain leader with extensive experience in the high tech manufacturing and Cloud services. Developed innovative supply chain practices to drive cost reduction while ensuring continuity of supply and time to market. Proven track record of raising the level of organizational performance and strategic contribution. Significant experience in vendor negotiations, outsourced manufacturing, supply chain planning & business process development. United States Government Top Secret Security clearance. \n \nSpecialties: • Leading global supply chain organizations supporting Cloud Infrastructure \n• OEM and ODM negotiations, business award/allocation while ensuring continuity of supply \n• Excel in people leadership, including performance management, coaching, team development & change management \n• Transformation of site/region focused to globally focused & aligned organizations \n• Vendor negotiation and management with particular focus in IT, outsourced manufacturing, site services and consulting disciplines \n• Business process development Senior Sourcing and Supply Chain leader with extensive experience in the high tech manufacturing and Cloud services. Developed innovative supply chain practices to drive cost reduction while ensuring continuity of supply and time to market. Proven track record of raising the level of organizational performance and strategic contribution. Significant experience in vendor negotiations, outsourced manufacturing, supply chain planning & business process development. United States Government Top Secret Security clearance. \n \nSpecialties: • Leading global supply chain organizations supporting Cloud Infrastructure \n• OEM and ODM negotiations, business award/allocation while ensuring continuity of supply \n• Excel in people leadership, including performance management, coaching, team development & change management \n• Transformation of site/region focused to globally focused & aligned organizations \n• Vendor negotiation and management with particular focus in IT, outsourced manufacturing, site services and consulting disciplines \n• Business process development Senior Sourcing and Supply Chain leader with extensive experience in the high tech manufacturing and Cloud services. Developed innovative supply chain practices to drive cost reduction while ensuring continuity of supply and time to market. Proven track record of raising the level of organizational performance and strategic contribution. Significant experience in vendor negotiations, outsourced manufacturing, supply chain planning & business process development. United States Government Top Secret Security clearance. \n \nSpecialties: • Leading global supply chain organizations supporting Cloud Infrastructure \n• OEM and ODM negotiations, business award/allocation while ensuring continuity of supply \n• Excel in people leadership, including performance management, coaching, team development & change management \n• Transformation of site/region focused to globally focused & aligned organizations \n• Vendor negotiation and management with particular focus in IT, outsourced manufacturing, site services and consulting disciplines \n• Business process development Experience Director of Strategic Sourcing Microsoft July 2013  – Present (2 years 2 months) Redmond, WA • Lead the sourcing strategy and procurement processes for server hardware fulfillment in support of Microsoft's global Cloud infrastructure  \n• Drive continual cost reduction while reducing lead-time from forecast to server dock and mitigating material liability exposure \n• Manage a global outsourced manufacturing vendor base to keep pace with Microsoft's exponential growth in Cloud services Supply Chain Planning Manager Amazon May 2012  –  July 2013  (1 year 3 months) Greater Seattle Area • Supply chain planning to ensure server hardware capacity and continuity of supply in support of Amazon's global Cloud (AWS) infrastructure.  \n• Consolidated divisional needs to create global demand forecast.  \n• Managed global commodity level (HDD, Memory, SSD) server level planning to ensure appropriate vendor allocations for cost optimization and continuity of supply. Global Purchasing Manager Mentor Graphics Corporation March 2007  –  May 2012  (5 years 3 months) Portland, Oregon Area • Led Mentor’s corporate purchasing organization. Corporate owner of procurement policies & tools.  \n• Created a global sourcing strategy to deliver cost reduction across IT, Facilities/Site Services, Marketing, Travel and Financial Services  \n• Drove specific commodity strategies and procurement transactional efficiency in support of a global customer base \n• Successfully launched SAP procurement application  Senior Materials Manager Credence Systems Corporation November 2005  –  March 2007  (1 year 5 months) • Led materials organization to drive cost reductions and manage materials availability for production and NPI.  \n• Reported to Sr VP of Operations and directly accountable to CEO and CFO as owner of corporate initiatives to reduce material lead-time and liability exposure. \n• Managed materials and vendor relationships in support of on-site and outsourced manufacturing \n• Organization exceeded material availability, lead-time reduction and on-time delivery goals Materials Manager Intel Corporation March 2003  –  November 2005  (2 years 9 months) • Managed an organization of 17 material program managers(MPMs) and buyers in support of a motherboard factory.  \n• Responsible for material availability and reducing material lead-time to deliver Intel silicon to the marketplace. Purchasing Manager Intel Corporation December 2000  –  March 2003  (2 years 4 months) • Managed buyers responsible for managing spending for Intel's Northwest Region.  \n• Developed and oversaw business processes to enable a materials-based competitive advantage in outsourced boards and systems production. Commodity Manager Intel Corporation February 1996  –  December 2000  (4 years 11 months) • Vendor selection, negotiation and commodity management across Facilities, Construction, Site Services and MRO commodities \n• Led multiple company-wide procurement initiatives to drive cross-region collaboration and cost reduction \n• Corporate Purchasing MRO commodity manager responsible for global sourcing strategy for MRO materials and services Director of Strategic Sourcing Microsoft July 2013  – Present (2 years 2 months) Redmond, WA • Lead the sourcing strategy and procurement processes for server hardware fulfillment in support of Microsoft's global Cloud infrastructure  \n• Drive continual cost reduction while reducing lead-time from forecast to server dock and mitigating material liability exposure \n• Manage a global outsourced manufacturing vendor base to keep pace with Microsoft's exponential growth in Cloud services Director of Strategic Sourcing Microsoft July 2013  – Present (2 years 2 months) Redmond, WA • Lead the sourcing strategy and procurement processes for server hardware fulfillment in support of Microsoft's global Cloud infrastructure  \n• Drive continual cost reduction while reducing lead-time from forecast to server dock and mitigating material liability exposure \n• Manage a global outsourced manufacturing vendor base to keep pace with Microsoft's exponential growth in Cloud services Supply Chain Planning Manager Amazon May 2012  –  July 2013  (1 year 3 months) Greater Seattle Area • Supply chain planning to ensure server hardware capacity and continuity of supply in support of Amazon's global Cloud (AWS) infrastructure.  \n• Consolidated divisional needs to create global demand forecast.  \n• Managed global commodity level (HDD, Memory, SSD) server level planning to ensure appropriate vendor allocations for cost optimization and continuity of supply. Supply Chain Planning Manager Amazon May 2012  –  July 2013  (1 year 3 months) Greater Seattle Area • Supply chain planning to ensure server hardware capacity and continuity of supply in support of Amazon's global Cloud (AWS) infrastructure.  \n• Consolidated divisional needs to create global demand forecast.  \n• Managed global commodity level (HDD, Memory, SSD) server level planning to ensure appropriate vendor allocations for cost optimization and continuity of supply. Global Purchasing Manager Mentor Graphics Corporation March 2007  –  May 2012  (5 years 3 months) Portland, Oregon Area • Led Mentor’s corporate purchasing organization. Corporate owner of procurement policies & tools.  \n• Created a global sourcing strategy to deliver cost reduction across IT, Facilities/Site Services, Marketing, Travel and Financial Services  \n• Drove specific commodity strategies and procurement transactional efficiency in support of a global customer base \n• Successfully launched SAP procurement application  Global Purchasing Manager Mentor Graphics Corporation March 2007  –  May 2012  (5 years 3 months) Portland, Oregon Area • Led Mentor’s corporate purchasing organization. Corporate owner of procurement policies & tools.  \n• Created a global sourcing strategy to deliver cost reduction across IT, Facilities/Site Services, Marketing, Travel and Financial Services  \n• Drove specific commodity strategies and procurement transactional efficiency in support of a global customer base \n• Successfully launched SAP procurement application  Senior Materials Manager Credence Systems Corporation November 2005  –  March 2007  (1 year 5 months) • Led materials organization to drive cost reductions and manage materials availability for production and NPI.  \n• Reported to Sr VP of Operations and directly accountable to CEO and CFO as owner of corporate initiatives to reduce material lead-time and liability exposure. \n• Managed materials and vendor relationships in support of on-site and outsourced manufacturing \n• Organization exceeded material availability, lead-time reduction and on-time delivery goals Senior Materials Manager Credence Systems Corporation November 2005  –  March 2007  (1 year 5 months) • Led materials organization to drive cost reductions and manage materials availability for production and NPI.  \n• Reported to Sr VP of Operations and directly accountable to CEO and CFO as owner of corporate initiatives to reduce material lead-time and liability exposure. \n• Managed materials and vendor relationships in support of on-site and outsourced manufacturing \n• Organization exceeded material availability, lead-time reduction and on-time delivery goals Materials Manager Intel Corporation March 2003  –  November 2005  (2 years 9 months) • Managed an organization of 17 material program managers(MPMs) and buyers in support of a motherboard factory.  \n• Responsible for material availability and reducing material lead-time to deliver Intel silicon to the marketplace. Materials Manager Intel Corporation March 2003  –  November 2005  (2 years 9 months) • Managed an organization of 17 material program managers(MPMs) and buyers in support of a motherboard factory.  \n• Responsible for material availability and reducing material lead-time to deliver Intel silicon to the marketplace. Purchasing Manager Intel Corporation December 2000  –  March 2003  (2 years 4 months) • Managed buyers responsible for managing spending for Intel's Northwest Region.  \n• Developed and oversaw business processes to enable a materials-based competitive advantage in outsourced boards and systems production. Purchasing Manager Intel Corporation December 2000  –  March 2003  (2 years 4 months) • Managed buyers responsible for managing spending for Intel's Northwest Region.  \n• Developed and oversaw business processes to enable a materials-based competitive advantage in outsourced boards and systems production. Commodity Manager Intel Corporation February 1996  –  December 2000  (4 years 11 months) • Vendor selection, negotiation and commodity management across Facilities, Construction, Site Services and MRO commodities \n• Led multiple company-wide procurement initiatives to drive cross-region collaboration and cost reduction \n• Corporate Purchasing MRO commodity manager responsible for global sourcing strategy for MRO materials and services Commodity Manager Intel Corporation February 1996  –  December 2000  (4 years 11 months) • Vendor selection, negotiation and commodity management across Facilities, Construction, Site Services and MRO commodities \n• Led multiple company-wide procurement initiatives to drive cross-region collaboration and cost reduction \n• Corporate Purchasing MRO commodity manager responsible for global sourcing strategy for MRO materials and services Skills Negotiation Budgets Leadership MRP Purchasing Product Development Change Management Project Management Supply Management Strategic Sourcing Materials Management Supply Chain Management Supply Chain Procurement Global Sourcing Cross-functional Team... Sourcing Contract Negotiation Outsourcing Vendor Management Program Management Manufacturing International Business Business Strategy Management See 10+     See less Skills  Negotiation Budgets Leadership MRP Purchasing Product Development Change Management Project Management Supply Management Strategic Sourcing Materials Management Supply Chain Management Supply Chain Procurement Global Sourcing Cross-functional Team... Sourcing Contract Negotiation Outsourcing Vendor Management Program Management Manufacturing International Business Business Strategy Management See 10+     See less Negotiation Budgets Leadership MRP Purchasing Product Development Change Management Project Management Supply Management Strategic Sourcing Materials Management Supply Chain Management Supply Chain Procurement Global Sourcing Cross-functional Team... Sourcing Contract Negotiation Outsourcing Vendor Management Program Management Manufacturing International Business Business Strategy Management See 10+     See less Negotiation Budgets Leadership MRP Purchasing Product Development Change Management Project Management Supply Management Strategic Sourcing Materials Management Supply Chain Management Supply Chain Procurement Global Sourcing Cross-functional Team... Sourcing Contract Negotiation Outsourcing Vendor Management Program Management Manufacturing International Business Business Strategy Management See 10+     See less Education Indiana University - Kelley School of Business MBA,  Logistics , Materials, and Supply Chain Management 2002  – 2004 University of Washington BA-Business,  Finance ,  Marketing 1990  – 1995 Indiana University - Kelley School of Business MBA,  Logistics , Materials, and Supply Chain Management 2002  – 2004 Indiana University - Kelley School of Business MBA,  Logistics , Materials, and Supply Chain Management 2002  – 2004 Indiana University - Kelley School of Business MBA,  Logistics , Materials, and Supply Chain Management 2002  – 2004 University of Washington BA-Business,  Finance ,  Marketing 1990  – 1995 University of Washington BA-Business,  Finance ,  Marketing 1990  – 1995 University of Washington BA-Business,  Finance ,  Marketing 1990  – 1995 ", "Experience Direct Materials Purchasing Manager Intel Corporation April 2015  – Present (5 months) Supply Chain Manager Intel July 2013  –  March 2015  (1 year 9 months) Dalian, Liaoning, China Purchasing Manager Intel Corporation 2008  –  2013  (5 years) Chandler, AZ Group Leader Intel 2003  –  2008  (5 years) Commodity Manager Intel October 2000  –  June 2003  (2 years 9 months) Direct Materials Purchasing Manager Intel Corporation April 2015  – Present (5 months) Direct Materials Purchasing Manager Intel Corporation April 2015  – Present (5 months) Supply Chain Manager Intel July 2013  –  March 2015  (1 year 9 months) Dalian, Liaoning, China Supply Chain Manager Intel July 2013  –  March 2015  (1 year 9 months) Dalian, Liaoning, China Purchasing Manager Intel Corporation 2008  –  2013  (5 years) Chandler, AZ Purchasing Manager Intel Corporation 2008  –  2013  (5 years) Chandler, AZ Group Leader Intel 2003  –  2008  (5 years) Group Leader Intel 2003  –  2008  (5 years) Commodity Manager Intel October 2000  –  June 2003  (2 years 9 months) Commodity Manager Intel October 2000  –  June 2003  (2 years 9 months) Skills Supply Chain Purchasing Semiconductor Industry Semiconductors Supply Chain Management Cross-functional Team... MRP Program Management Continuous Improvement Skills  Supply Chain Purchasing Semiconductor Industry Semiconductors Supply Chain Management Cross-functional Team... MRP Program Management Continuous Improvement Supply Chain Purchasing Semiconductor Industry Semiconductors Supply Chain Management Cross-functional Team... MRP Program Management Continuous Improvement Supply Chain Purchasing Semiconductor Industry Semiconductors Supply Chain Management Cross-functional Team... MRP Program Management Continuous Improvement Education Arizona State University, W. P. Carey School of Business MBA 2001  – 2003 Arizona State University Master of Business Administration (MBA) Arizona State University, W. P. Carey School of Business MBA 2001  – 2003 Arizona State University, W. P. Carey School of Business MBA 2001  – 2003 Arizona State University, W. P. Carey School of Business MBA 2001  – 2003 Arizona State University Master of Business Administration (MBA) Arizona State University Master of Business Administration (MBA) Arizona State University Master of Business Administration (MBA) ", "Experience Logistics Purchasing Manager Intel Corporation November 2009  – Present (5 years 10 months) Dalian Logistics Purchasing Manager Intel Corporation November 2009  – Present (5 years 10 months) Dalian Logistics Purchasing Manager Intel Corporation November 2009  – Present (5 years 10 months) Dalian Education Cardiff University / Prifysgol Caerdydd Master’s Degree,  International transport and logistics 2001  – 2002 Cardiff University / Prifysgol Caerdydd Master’s Degree,  International transport and logistics 2001  – 2002 Cardiff University / Prifysgol Caerdydd Master’s Degree,  International transport and logistics 2001  – 2002 Cardiff University / Prifysgol Caerdydd Master’s Degree,  International transport and logistics 2001  – 2002 ", "Skills Global Sourcing Strategic Sourcing Supplier Management Supplier Evaluation Cost Reduction People Development Supply Chain Readiness Contract Negotiation Demand Management Transition Change... Lean Six Sigma Leader Business Process... Business Strategy Team Improvement Mentor Skills  Global Sourcing Strategic Sourcing Supplier Management Supplier Evaluation Cost Reduction People Development Supply Chain Readiness Contract Negotiation Demand Management Transition Change... Lean Six Sigma Leader Business Process... Business Strategy Team Improvement Mentor Global Sourcing Strategic Sourcing Supplier Management Supplier Evaluation Cost Reduction People Development Supply Chain Readiness Contract Negotiation Demand Management Transition Change... Lean Six Sigma Leader Business Process... Business Strategy Team Improvement Mentor Global Sourcing Strategic Sourcing Supplier Management Supplier Evaluation Cost Reduction People Development Supply Chain Readiness Contract Negotiation Demand Management Transition Change... Lean Six Sigma Leader Business Process... Business Strategy Team Improvement Mentor ", "Summary Accomplished Supply Chain Manager \n \nContract Management ‖ Supply Chain Leadership ‖ Procurement ‖ Business Process Improvement \n \nAccomplished supply chain manager with more than 15 years of demonstrated success in leading change, driving enterprise-wide supply chain programs, developing global strategic sourcing strategies for profitability, and streamlining continuous process improvements and opportunities in the semiconductor industry. Strong track record of consistently leading cross-functional teams in the areas of sourcing, supply chain, and risk mitigation.  \n \nCORE COMPETENCIES \n \nStrategic Planning & Operational Execution ‖ Global and Local People Management ‖ Project/Program Management ‖ Quality Assurance ‖ Business Partnering & Influencing ‖ Lean Six Sigma & Business Process Management ‖ Cross-Functional Team Leadership ‖ Procurement & Supply Chain Management ‖ Supplier Negotiations ‖ Problem Solving ‖ Staffing & Team Development ‖ Continuous Process Improvement || Advanced proficiency in Word, PowerPoint, Excel and Visio \n Summary Accomplished Supply Chain Manager \n \nContract Management ‖ Supply Chain Leadership ‖ Procurement ‖ Business Process Improvement \n \nAccomplished supply chain manager with more than 15 years of demonstrated success in leading change, driving enterprise-wide supply chain programs, developing global strategic sourcing strategies for profitability, and streamlining continuous process improvements and opportunities in the semiconductor industry. Strong track record of consistently leading cross-functional teams in the areas of sourcing, supply chain, and risk mitigation.  \n \nCORE COMPETENCIES \n \nStrategic Planning & Operational Execution ‖ Global and Local People Management ‖ Project/Program Management ‖ Quality Assurance ‖ Business Partnering & Influencing ‖ Lean Six Sigma & Business Process Management ‖ Cross-Functional Team Leadership ‖ Procurement & Supply Chain Management ‖ Supplier Negotiations ‖ Problem Solving ‖ Staffing & Team Development ‖ Continuous Process Improvement || Advanced proficiency in Word, PowerPoint, Excel and Visio \n Accomplished Supply Chain Manager \n \nContract Management ‖ Supply Chain Leadership ‖ Procurement ‖ Business Process Improvement \n \nAccomplished supply chain manager with more than 15 years of demonstrated success in leading change, driving enterprise-wide supply chain programs, developing global strategic sourcing strategies for profitability, and streamlining continuous process improvements and opportunities in the semiconductor industry. Strong track record of consistently leading cross-functional teams in the areas of sourcing, supply chain, and risk mitigation.  \n \nCORE COMPETENCIES \n \nStrategic Planning & Operational Execution ‖ Global and Local People Management ‖ Project/Program Management ‖ Quality Assurance ‖ Business Partnering & Influencing ‖ Lean Six Sigma & Business Process Management ‖ Cross-Functional Team Leadership ‖ Procurement & Supply Chain Management ‖ Supplier Negotiations ‖ Problem Solving ‖ Staffing & Team Development ‖ Continuous Process Improvement || Advanced proficiency in Word, PowerPoint, Excel and Visio \n Accomplished Supply Chain Manager \n \nContract Management ‖ Supply Chain Leadership ‖ Procurement ‖ Business Process Improvement \n \nAccomplished supply chain manager with more than 15 years of demonstrated success in leading change, driving enterprise-wide supply chain programs, developing global strategic sourcing strategies for profitability, and streamlining continuous process improvements and opportunities in the semiconductor industry. Strong track record of consistently leading cross-functional teams in the areas of sourcing, supply chain, and risk mitigation.  \n \nCORE COMPETENCIES \n \nStrategic Planning & Operational Execution ‖ Global and Local People Management ‖ Project/Program Management ‖ Quality Assurance ‖ Business Partnering & Influencing ‖ Lean Six Sigma & Business Process Management ‖ Cross-Functional Team Leadership ‖ Procurement & Supply Chain Management ‖ Supplier Negotiations ‖ Problem Solving ‖ Staffing & Team Development ‖ Continuous Process Improvement || Advanced proficiency in Word, PowerPoint, Excel and Visio \n Experience Supply Chain / Risk Mitigation Program Manager Intel Corporation September 2013  –  July 2015  (1 year 11 months) Albuquerque, New Mexico Area Intel Corporation: 09/13 – now\tProgram Manager Rio Rancho, NM  \n•\tOversaw Intel’s global supplier segmentation program which is the foundation for prioritizing the top 300 suppliers based upon strategic importance, and compliance to supplier quality and supply chain sustainability programs. Led proliferation across 10 organizations which resulted in streamlined business process, and enhanced system efficiency. \n•\tManaged business continuity program comprised of technology manufacturing and global supply management organizations. Drove development of governing specifications for business continuity and supplier financial health assessments; assured compliance across 12 organizations through use of metrics, drills, risk impact assessments, audits and controls―resulted in productivity improvements and integration of supply chain execution solutions to maximize ROI. \n•\tLed business and IT operations, systems integration, and mission-critical delivery management by leveraging leading supply chain and applications expertise to manage global disaster events that put Intel’s supply chain at risk.  \n Supply Chain Program / Operations Manager Intel Corporation June 2010  –  September 2013  (3 years 4 months) Albuquerque, New Mexico Area Supply Chain Program / Operations Manager (06/2010 – 09/2013)\t \n•\tDrove strategic planning initiatives and managed cross functional teams relating to Intel’s procurement of new production tools that were on tight install schedules. Program managed critical path tools down by 80% for two generations of wafer factory ramps for AZ, Israel, and Ireland. (First generation down from peak of 153 tools & second generation down from peak of 173).  \n•\tAs business process owner for 6 critical segments of highly complex capital equipment reuse process, drove development, documentation, proliferation and training for Conversion Kit Management System Software Application in partnership with conversion engineers and software application developers; reduced overall production costs. \n•\tSpearheaded annual/quarterly strategic planning and budgeting processes for Capital Planning department. Total HC of 80 with budget of $10M. Global Purchasing Manager Intel Corporation November 2002  –  June 2010  (7 years 8 months) Albuquerque, New Mexico Area •\tEstablished and performance managed a global team of purchasing professionals that drove sourcing and contracting (400+ suppliers), order management (19K PO’s/year) and on-time delivery (90%) for $150M+ in annual expenditures. Managed support equipment/parts readiness for wafer factory ramps to ensure production tools are ready to manufacture wafers.  \n•\tAccountable for implementing operations for multiple factory production ramps at each of our wafer manufacturing facilities in NM, AZ, CA, CO, OR, Ireland, Israel, and China. Drove headcount efficiencies of 20%, supplier consolidation (15%), and average annual cost savings of $2.5M. \n•\tResolved challenge of obtaining agreement from senior management to provide resources for existing headcount to fund team of 12. Initiative enabled effective management of factory ramps over next 7 years.  \n•\tMandated to lead recruiting process (5 HC) and transfer administrative resources to Costa Rica, low-cost geography. \n Purchasing Manager Intel Corporation October 2000  –  November 2002  (2 years 2 months) Rio Rancho, NM •\tPerformance managed 12 purchasing professionals responsible for spares and service support to wafer manufacturing factories in New Mexico.  \n•\tDrove operations for performance to goal expectations in support of F11x production; on time delivery, cost savings, zero bin’s, constrained parts, machine down wait part, and reorder point/BOM management and service. \n•\tLed recruiting, staffing, integration and training team/processes for New Mexico Factory Purchasing Department.  \n•\tCo-lead equipment/spares project roadmap; consisted of $54M in savings/$93M spends, $1.2M excess inventory disposition, P860/P1260 BOM readiness, 40% inventory consignment, and executed excess inventory transfer. \n Commodity Manager INTEL CORPORATION December 1997  –  October 2000  (2 years 11 months) Chandler, Az •\tSupplier owner for 300mm Wafer Prober selection team; $40M contract negotiation. Achieved 200mm to 300mm cost reduction target (30%); Owner of Quarterly Supplier Executive Management Reviews. \n•\tOwner of commodity Purchasing Expenditure Plan, Supplier Report Card, and Supplier Management Reviews; deployed 28 test contactor development programs to High Volume Manufacturing in 8 months. \n•\tOversaw Burn-in Socket and Test Contactors; Annual spends $20M and led 2 corporate contract negotiations. \n•\tLed development and closure of purchase specifications, cost model development, and agreement negotiations. \n Supply Chain / Risk Mitigation Program Manager Intel Corporation September 2013  –  July 2015  (1 year 11 months) Albuquerque, New Mexico Area Intel Corporation: 09/13 – now\tProgram Manager Rio Rancho, NM  \n•\tOversaw Intel’s global supplier segmentation program which is the foundation for prioritizing the top 300 suppliers based upon strategic importance, and compliance to supplier quality and supply chain sustainability programs. Led proliferation across 10 organizations which resulted in streamlined business process, and enhanced system efficiency. \n•\tManaged business continuity program comprised of technology manufacturing and global supply management organizations. Drove development of governing specifications for business continuity and supplier financial health assessments; assured compliance across 12 organizations through use of metrics, drills, risk impact assessments, audits and controls―resulted in productivity improvements and integration of supply chain execution solutions to maximize ROI. \n•\tLed business and IT operations, systems integration, and mission-critical delivery management by leveraging leading supply chain and applications expertise to manage global disaster events that put Intel’s supply chain at risk.  \n Supply Chain / Risk Mitigation Program Manager Intel Corporation September 2013  –  July 2015  (1 year 11 months) Albuquerque, New Mexico Area Intel Corporation: 09/13 – now\tProgram Manager Rio Rancho, NM  \n•\tOversaw Intel’s global supplier segmentation program which is the foundation for prioritizing the top 300 suppliers based upon strategic importance, and compliance to supplier quality and supply chain sustainability programs. Led proliferation across 10 organizations which resulted in streamlined business process, and enhanced system efficiency. \n•\tManaged business continuity program comprised of technology manufacturing and global supply management organizations. Drove development of governing specifications for business continuity and supplier financial health assessments; assured compliance across 12 organizations through use of metrics, drills, risk impact assessments, audits and controls―resulted in productivity improvements and integration of supply chain execution solutions to maximize ROI. \n•\tLed business and IT operations, systems integration, and mission-critical delivery management by leveraging leading supply chain and applications expertise to manage global disaster events that put Intel’s supply chain at risk.  \n Supply Chain Program / Operations Manager Intel Corporation June 2010  –  September 2013  (3 years 4 months) Albuquerque, New Mexico Area Supply Chain Program / Operations Manager (06/2010 – 09/2013)\t \n•\tDrove strategic planning initiatives and managed cross functional teams relating to Intel’s procurement of new production tools that were on tight install schedules. Program managed critical path tools down by 80% for two generations of wafer factory ramps for AZ, Israel, and Ireland. (First generation down from peak of 153 tools & second generation down from peak of 173).  \n•\tAs business process owner for 6 critical segments of highly complex capital equipment reuse process, drove development, documentation, proliferation and training for Conversion Kit Management System Software Application in partnership with conversion engineers and software application developers; reduced overall production costs. \n•\tSpearheaded annual/quarterly strategic planning and budgeting processes for Capital Planning department. Total HC of 80 with budget of $10M. Supply Chain Program / Operations Manager Intel Corporation June 2010  –  September 2013  (3 years 4 months) Albuquerque, New Mexico Area Supply Chain Program / Operations Manager (06/2010 – 09/2013)\t \n•\tDrove strategic planning initiatives and managed cross functional teams relating to Intel’s procurement of new production tools that were on tight install schedules. Program managed critical path tools down by 80% for two generations of wafer factory ramps for AZ, Israel, and Ireland. (First generation down from peak of 153 tools & second generation down from peak of 173).  \n•\tAs business process owner for 6 critical segments of highly complex capital equipment reuse process, drove development, documentation, proliferation and training for Conversion Kit Management System Software Application in partnership with conversion engineers and software application developers; reduced overall production costs. \n•\tSpearheaded annual/quarterly strategic planning and budgeting processes for Capital Planning department. Total HC of 80 with budget of $10M. Global Purchasing Manager Intel Corporation November 2002  –  June 2010  (7 years 8 months) Albuquerque, New Mexico Area •\tEstablished and performance managed a global team of purchasing professionals that drove sourcing and contracting (400+ suppliers), order management (19K PO’s/year) and on-time delivery (90%) for $150M+ in annual expenditures. Managed support equipment/parts readiness for wafer factory ramps to ensure production tools are ready to manufacture wafers.  \n•\tAccountable for implementing operations for multiple factory production ramps at each of our wafer manufacturing facilities in NM, AZ, CA, CO, OR, Ireland, Israel, and China. Drove headcount efficiencies of 20%, supplier consolidation (15%), and average annual cost savings of $2.5M. \n•\tResolved challenge of obtaining agreement from senior management to provide resources for existing headcount to fund team of 12. Initiative enabled effective management of factory ramps over next 7 years.  \n•\tMandated to lead recruiting process (5 HC) and transfer administrative resources to Costa Rica, low-cost geography. \n Global Purchasing Manager Intel Corporation November 2002  –  June 2010  (7 years 8 months) Albuquerque, New Mexico Area •\tEstablished and performance managed a global team of purchasing professionals that drove sourcing and contracting (400+ suppliers), order management (19K PO’s/year) and on-time delivery (90%) for $150M+ in annual expenditures. Managed support equipment/parts readiness for wafer factory ramps to ensure production tools are ready to manufacture wafers.  \n•\tAccountable for implementing operations for multiple factory production ramps at each of our wafer manufacturing facilities in NM, AZ, CA, CO, OR, Ireland, Israel, and China. Drove headcount efficiencies of 20%, supplier consolidation (15%), and average annual cost savings of $2.5M. \n•\tResolved challenge of obtaining agreement from senior management to provide resources for existing headcount to fund team of 12. Initiative enabled effective management of factory ramps over next 7 years.  \n•\tMandated to lead recruiting process (5 HC) and transfer administrative resources to Costa Rica, low-cost geography. \n Purchasing Manager Intel Corporation October 2000  –  November 2002  (2 years 2 months) Rio Rancho, NM •\tPerformance managed 12 purchasing professionals responsible for spares and service support to wafer manufacturing factories in New Mexico.  \n•\tDrove operations for performance to goal expectations in support of F11x production; on time delivery, cost savings, zero bin’s, constrained parts, machine down wait part, and reorder point/BOM management and service. \n•\tLed recruiting, staffing, integration and training team/processes for New Mexico Factory Purchasing Department.  \n•\tCo-lead equipment/spares project roadmap; consisted of $54M in savings/$93M spends, $1.2M excess inventory disposition, P860/P1260 BOM readiness, 40% inventory consignment, and executed excess inventory transfer. \n Purchasing Manager Intel Corporation October 2000  –  November 2002  (2 years 2 months) Rio Rancho, NM •\tPerformance managed 12 purchasing professionals responsible for spares and service support to wafer manufacturing factories in New Mexico.  \n•\tDrove operations for performance to goal expectations in support of F11x production; on time delivery, cost savings, zero bin’s, constrained parts, machine down wait part, and reorder point/BOM management and service. \n•\tLed recruiting, staffing, integration and training team/processes for New Mexico Factory Purchasing Department.  \n•\tCo-lead equipment/spares project roadmap; consisted of $54M in savings/$93M spends, $1.2M excess inventory disposition, P860/P1260 BOM readiness, 40% inventory consignment, and executed excess inventory transfer. \n Commodity Manager INTEL CORPORATION December 1997  –  October 2000  (2 years 11 months) Chandler, Az •\tSupplier owner for 300mm Wafer Prober selection team; $40M contract negotiation. Achieved 200mm to 300mm cost reduction target (30%); Owner of Quarterly Supplier Executive Management Reviews. \n•\tOwner of commodity Purchasing Expenditure Plan, Supplier Report Card, and Supplier Management Reviews; deployed 28 test contactor development programs to High Volume Manufacturing in 8 months. \n•\tOversaw Burn-in Socket and Test Contactors; Annual spends $20M and led 2 corporate contract negotiations. \n•\tLed development and closure of purchase specifications, cost model development, and agreement negotiations. \n Commodity Manager INTEL CORPORATION December 1997  –  October 2000  (2 years 11 months) Chandler, Az •\tSupplier owner for 300mm Wafer Prober selection team; $40M contract negotiation. Achieved 200mm to 300mm cost reduction target (30%); Owner of Quarterly Supplier Executive Management Reviews. \n•\tOwner of commodity Purchasing Expenditure Plan, Supplier Report Card, and Supplier Management Reviews; deployed 28 test contactor development programs to High Volume Manufacturing in 8 months. \n•\tOversaw Burn-in Socket and Test Contactors; Annual spends $20M and led 2 corporate contract negotiations. \n•\tLed development and closure of purchase specifications, cost model development, and agreement negotiations. \n Skills Supply Chain Management Supply Management Six Sigma Cross-functional Team... Procurement Program Management Process Improvement Strategic Sourcing Business Process Manufacturing Management Lean Manufacturing Strategy Contract Negotiation Continuous Improvement Project Planning Leadership Semiconductors Quality Management Negotiation Supplier Evaluation Supplier Development Operational Excellence Team Leadership Supplier Quality Global Sourcing Purchasing Contract Management Strategic Planning Business Process... Operations Management Risk Management Visio Performance Management Inventory Management Training Coaching Value Stream Mapping Budgets Change Management FMEA Sourcing Project Management Analysis See 29+     See less Skills  Supply Chain Management Supply Management Six Sigma Cross-functional Team... Procurement Program Management Process Improvement Strategic Sourcing Business Process Manufacturing Management Lean Manufacturing Strategy Contract Negotiation Continuous Improvement Project Planning Leadership Semiconductors Quality Management Negotiation Supplier Evaluation Supplier Development Operational Excellence Team Leadership Supplier Quality Global Sourcing Purchasing Contract Management Strategic Planning Business Process... Operations Management Risk Management Visio Performance Management Inventory Management Training Coaching Value Stream Mapping Budgets Change Management FMEA Sourcing Project Management Analysis See 29+     See less Supply Chain Management Supply Management Six Sigma Cross-functional Team... Procurement Program Management Process Improvement Strategic Sourcing Business Process Manufacturing Management Lean Manufacturing Strategy Contract Negotiation Continuous Improvement Project Planning Leadership Semiconductors Quality Management Negotiation Supplier Evaluation Supplier Development Operational Excellence Team Leadership Supplier Quality Global Sourcing Purchasing Contract Management Strategic Planning Business Process... Operations Management Risk Management Visio Performance Management Inventory Management Training Coaching Value Stream Mapping Budgets Change Management FMEA Sourcing Project Management Analysis See 29+     See less Supply Chain Management Supply Management Six Sigma Cross-functional Team... Procurement Program Management Process Improvement Strategic Sourcing Business Process Manufacturing Management Lean Manufacturing Strategy Contract Negotiation Continuous Improvement Project Planning Leadership Semiconductors Quality Management Negotiation Supplier Evaluation Supplier Development Operational Excellence Team Leadership Supplier Quality Global Sourcing Purchasing Contract Management Strategic Planning Business Process... Operations Management Risk Management Visio Performance Management Inventory Management Training Coaching Value Stream Mapping Budgets Change Management FMEA Sourcing Project Management Analysis See 29+     See less Education New Mexico State University a BBA,  Business Management 1981  – 1987 New Mexico State University a BBA,  Business Management 1981  – 1987 New Mexico State University a BBA,  Business Management 1981  – 1987 New Mexico State University a BBA,  Business Management 1981  – 1987 Honors & Awards Additional Honors & Awards Divisional Recognition Awards:  \nDivisional Recognition Awards:  \n2014 - Supplier Financial Health \n2011 - Swiss Finance Project \n2010 - P1268 Capacity Upside Response \n2010 - Capital SAP Re-platform  \n2007 - Delivering GNTM Transaction transition to low cost geo \n2004 - Fab Sort Materials People Vision Team Leadership \n2002 - NTM Program Mgmt at Intel’s first 300mm Factory Additional Honors & Awards Divisional Recognition Awards:  \nDivisional Recognition Awards:  \n2014 - Supplier Financial Health \n2011 - Swiss Finance Project \n2010 - P1268 Capacity Upside Response \n2010 - Capital SAP Re-platform  \n2007 - Delivering GNTM Transaction transition to low cost geo \n2004 - Fab Sort Materials People Vision Team Leadership \n2002 - NTM Program Mgmt at Intel’s first 300mm Factory Additional Honors & Awards Divisional Recognition Awards:  \nDivisional Recognition Awards:  \n2014 - Supplier Financial Health \n2011 - Swiss Finance Project \n2010 - P1268 Capacity Upside Response \n2010 - Capital SAP Re-platform  \n2007 - Delivering GNTM Transaction transition to low cost geo \n2004 - Fab Sort Materials People Vision Team Leadership \n2002 - NTM Program Mgmt at Intel’s first 300mm Factory Additional Honors & Awards Divisional Recognition Awards:  \nDivisional Recognition Awards:  \n2014 - Supplier Financial Health \n2011 - Swiss Finance Project \n2010 - P1268 Capacity Upside Response \n2010 - Capital SAP Re-platform  \n2007 - Delivering GNTM Transaction transition to low cost geo \n2004 - Fab Sort Materials People Vision Team Leadership \n2002 - NTM Program Mgmt at Intel’s first 300mm Factory ", "Experience Spares & Service Commodity Manager Intel Corporation October 2014  – Present (11 months) Indirect Materials Purchasing Manager Intel Corporation 2007  –  October 2014  (7 years) Direct Materials Purchasing Manager Intel Corporation 2005  –  2007  (2 years) Material Program Manager Intel Corpoation 2000  –  2005  (5 years) Commodity Manager Intel Corporation 1997  –  2000  (3 years) Senior Buyer Planner Bose Corporation 1994  –  1997  (3 years) Spares & Service Commodity Manager Intel Corporation October 2014  – Present (11 months) Spares & Service Commodity Manager Intel Corporation October 2014  – Present (11 months) Indirect Materials Purchasing Manager Intel Corporation 2007  –  October 2014  (7 years) Indirect Materials Purchasing Manager Intel Corporation 2007  –  October 2014  (7 years) Direct Materials Purchasing Manager Intel Corporation 2005  –  2007  (2 years) Direct Materials Purchasing Manager Intel Corporation 2005  –  2007  (2 years) Material Program Manager Intel Corpoation 2000  –  2005  (5 years) Material Program Manager Intel Corpoation 2000  –  2005  (5 years) Commodity Manager Intel Corporation 1997  –  2000  (3 years) Commodity Manager Intel Corporation 1997  –  2000  (3 years) Senior Buyer Planner Bose Corporation 1994  –  1997  (3 years) Senior Buyer Planner Bose Corporation 1994  –  1997  (3 years) Skills Supply Management Strategic Sourcing Semiconductors Global Sourcing Supply Chain Management Purchasing SPC Six Sigma MRP Cross-functional Team... Materials Management Supplier Evaluation Supply Chain Lean Manufacturing Supplier Negotiation Skills  Supply Management Strategic Sourcing Semiconductors Global Sourcing Supply Chain Management Purchasing SPC Six Sigma MRP Cross-functional Team... Materials Management Supplier Evaluation Supply Chain Lean Manufacturing Supplier Negotiation Supply Management Strategic Sourcing Semiconductors Global Sourcing Supply Chain Management Purchasing SPC Six Sigma MRP Cross-functional Team... Materials Management Supplier Evaluation Supply Chain Lean Manufacturing Supplier Negotiation Supply Management Strategic Sourcing Semiconductors Global Sourcing Supply Chain Management Purchasing SPC Six Sigma MRP Cross-functional Team... Materials Management Supplier Evaluation Supply Chain Lean Manufacturing Supplier Negotiation Education Northern Arizona University Northern Arizona University Northern Arizona University Northern Arizona University ", "Summary Strategic and dynamic Procurement and Supply Chain Professional with over 25 years of extensive experience in supporting both manufacturing and commercial operations within the Pharmaceutical and Semi-conductor industries. Vast experience in procuring and maintaining equipment, services, supplies and direct materials to factory operations as well as project managing complex start-ups. Proven leadership skills with strong track record of building and developing high performing teams that set benchmark performance. Summary Strategic and dynamic Procurement and Supply Chain Professional with over 25 years of extensive experience in supporting both manufacturing and commercial operations within the Pharmaceutical and Semi-conductor industries. Vast experience in procuring and maintaining equipment, services, supplies and direct materials to factory operations as well as project managing complex start-ups. Proven leadership skills with strong track record of building and developing high performing teams that set benchmark performance. Strategic and dynamic Procurement and Supply Chain Professional with over 25 years of extensive experience in supporting both manufacturing and commercial operations within the Pharmaceutical and Semi-conductor industries. Vast experience in procuring and maintaining equipment, services, supplies and direct materials to factory operations as well as project managing complex start-ups. Proven leadership skills with strong track record of building and developing high performing teams that set benchmark performance. Strategic and dynamic Procurement and Supply Chain Professional with over 25 years of extensive experience in supporting both manufacturing and commercial operations within the Pharmaceutical and Semi-conductor industries. Vast experience in procuring and maintaining equipment, services, supplies and direct materials to factory operations as well as project managing complex start-ups. Proven leadership skills with strong track record of building and developing high performing teams that set benchmark performance. Experience Procurement Lead Europe - Integrated Facilities Management Pfizer September 2012  – Present (3 years) Dublin Responsible for leading the IFM program for all manufacturing sites across Europe including developing a pan-European strategy for IFM, ensuring buy-in and support from sponsors and key stakeholders and the effective planning and execution of that strategy. Procurement Lead Europe - Energy Pfizer March 2010  –  September 2012  (2 years 7 months) Dublin Responsible for leading the Energy Category for all manufacturing sites across Europe including Category reviews, internal and external market analysis, developing and setting an energy strategy for the region, planning and execution of the strategy in collaboration with the manufacturing sites. Supply Chain Manager Pfizer January 2007  –  March 2010  (3 years 3 months) Dublin Set up and developed the Supply Chain function, including Customer Service, with responsibility for the supply of a range of prescription medicines and infant nutritional products into the Irish market. Global Fab Commodities Manager Intel Corporation May 2006  –  January 2007  (9 months) Dublin Responsible for managing a team of 7-8 geographically dispersed Supply Base Managers for the supply of critical raw materials (silicon, quartz, targets) to all of Intel’s worldwide wafer-fabrication factories. Fab24 Procurement Manager Intel Corporation September 2000  –  May 2006  (5 years 9 months) Dublin Responsible for all elements of Supply Chain and Materials Management for the construction, fit-out and subsequent 7 x 24 hour operational support of the $2b Fab24 micro-processor manufacturing factory. This included responsibility for direct materials (chemicals/gases/silicon) & indirect procurement (equipment/spares/services), warehousing, and logistics functions. Materials Program Manager Intel Corporation November 1996  –  September 2000  (3 years 11 months) Dublin Responsible for the strategic planning, project management and execution of all activities across all Materials functions in support of the build and start-up of the Fab14 Factory. Led Materials program to ensure all Suppliers were compliant to EU legislative requirements such as CE Marking while resolving technical equipment issues such as 50 v 60 hertz frequency and 110 v 220 volts. Implemented the concept of Copy Exactly to Ireland Materials ensuring that all of our systems and processes were matched to the R&D Process Development Factory. Member of the Fab14 Factory Management Team in the development of long range plans, vision, mission and strategic objectives for the Factory. Direct Materials Purchasing Manager Intel Corporation November 1994  –  November 1996  (2 years 1 month) Dublin Led and managed the Procurement Team for the supply of all chemicals, gases, and silicon wafers, which are the building block raw materials for the manufacture of micro-processors. Site Purchasing Manager Intel Corporation June 1992  –  November 1994  (2 years 6 months) Dublin Established the Site Purchasing non-inventory team in Ireland in support of equipment installation and general site services / facilities. Negotiated multi-million $ contracts and developed service level agreements with 3 major construction companies as well as for all site-wide services including security, catering, janitorial and landscaping. Materials Purchasing Supervisor, Manufacturing Supervisor, Buyer Digital Equipment Corporation August 1985  –  May 1992  (6 years 10 months) Galway Procurement Lead Europe - Integrated Facilities Management Pfizer September 2012  – Present (3 years) Dublin Responsible for leading the IFM program for all manufacturing sites across Europe including developing a pan-European strategy for IFM, ensuring buy-in and support from sponsors and key stakeholders and the effective planning and execution of that strategy. Procurement Lead Europe - Integrated Facilities Management Pfizer September 2012  – Present (3 years) Dublin Responsible for leading the IFM program for all manufacturing sites across Europe including developing a pan-European strategy for IFM, ensuring buy-in and support from sponsors and key stakeholders and the effective planning and execution of that strategy. Procurement Lead Europe - Energy Pfizer March 2010  –  September 2012  (2 years 7 months) Dublin Responsible for leading the Energy Category for all manufacturing sites across Europe including Category reviews, internal and external market analysis, developing and setting an energy strategy for the region, planning and execution of the strategy in collaboration with the manufacturing sites. Procurement Lead Europe - Energy Pfizer March 2010  –  September 2012  (2 years 7 months) Dublin Responsible for leading the Energy Category for all manufacturing sites across Europe including Category reviews, internal and external market analysis, developing and setting an energy strategy for the region, planning and execution of the strategy in collaboration with the manufacturing sites. Supply Chain Manager Pfizer January 2007  –  March 2010  (3 years 3 months) Dublin Set up and developed the Supply Chain function, including Customer Service, with responsibility for the supply of a range of prescription medicines and infant nutritional products into the Irish market. Supply Chain Manager Pfizer January 2007  –  March 2010  (3 years 3 months) Dublin Set up and developed the Supply Chain function, including Customer Service, with responsibility for the supply of a range of prescription medicines and infant nutritional products into the Irish market. Global Fab Commodities Manager Intel Corporation May 2006  –  January 2007  (9 months) Dublin Responsible for managing a team of 7-8 geographically dispersed Supply Base Managers for the supply of critical raw materials (silicon, quartz, targets) to all of Intel’s worldwide wafer-fabrication factories. Global Fab Commodities Manager Intel Corporation May 2006  –  January 2007  (9 months) Dublin Responsible for managing a team of 7-8 geographically dispersed Supply Base Managers for the supply of critical raw materials (silicon, quartz, targets) to all of Intel’s worldwide wafer-fabrication factories. Fab24 Procurement Manager Intel Corporation September 2000  –  May 2006  (5 years 9 months) Dublin Responsible for all elements of Supply Chain and Materials Management for the construction, fit-out and subsequent 7 x 24 hour operational support of the $2b Fab24 micro-processor manufacturing factory. This included responsibility for direct materials (chemicals/gases/silicon) & indirect procurement (equipment/spares/services), warehousing, and logistics functions. Fab24 Procurement Manager Intel Corporation September 2000  –  May 2006  (5 years 9 months) Dublin Responsible for all elements of Supply Chain and Materials Management for the construction, fit-out and subsequent 7 x 24 hour operational support of the $2b Fab24 micro-processor manufacturing factory. This included responsibility for direct materials (chemicals/gases/silicon) & indirect procurement (equipment/spares/services), warehousing, and logistics functions. Materials Program Manager Intel Corporation November 1996  –  September 2000  (3 years 11 months) Dublin Responsible for the strategic planning, project management and execution of all activities across all Materials functions in support of the build and start-up of the Fab14 Factory. Led Materials program to ensure all Suppliers were compliant to EU legislative requirements such as CE Marking while resolving technical equipment issues such as 50 v 60 hertz frequency and 110 v 220 volts. Implemented the concept of Copy Exactly to Ireland Materials ensuring that all of our systems and processes were matched to the R&D Process Development Factory. Member of the Fab14 Factory Management Team in the development of long range plans, vision, mission and strategic objectives for the Factory. Materials Program Manager Intel Corporation November 1996  –  September 2000  (3 years 11 months) Dublin Responsible for the strategic planning, project management and execution of all activities across all Materials functions in support of the build and start-up of the Fab14 Factory. Led Materials program to ensure all Suppliers were compliant to EU legislative requirements such as CE Marking while resolving technical equipment issues such as 50 v 60 hertz frequency and 110 v 220 volts. Implemented the concept of Copy Exactly to Ireland Materials ensuring that all of our systems and processes were matched to the R&D Process Development Factory. Member of the Fab14 Factory Management Team in the development of long range plans, vision, mission and strategic objectives for the Factory. Direct Materials Purchasing Manager Intel Corporation November 1994  –  November 1996  (2 years 1 month) Dublin Led and managed the Procurement Team for the supply of all chemicals, gases, and silicon wafers, which are the building block raw materials for the manufacture of micro-processors. Direct Materials Purchasing Manager Intel Corporation November 1994  –  November 1996  (2 years 1 month) Dublin Led and managed the Procurement Team for the supply of all chemicals, gases, and silicon wafers, which are the building block raw materials for the manufacture of micro-processors. Site Purchasing Manager Intel Corporation June 1992  –  November 1994  (2 years 6 months) Dublin Established the Site Purchasing non-inventory team in Ireland in support of equipment installation and general site services / facilities. Negotiated multi-million $ contracts and developed service level agreements with 3 major construction companies as well as for all site-wide services including security, catering, janitorial and landscaping. Site Purchasing Manager Intel Corporation June 1992  –  November 1994  (2 years 6 months) Dublin Established the Site Purchasing non-inventory team in Ireland in support of equipment installation and general site services / facilities. Negotiated multi-million $ contracts and developed service level agreements with 3 major construction companies as well as for all site-wide services including security, catering, janitorial and landscaping. Materials Purchasing Supervisor, Manufacturing Supervisor, Buyer Digital Equipment Corporation August 1985  –  May 1992  (6 years 10 months) Galway Materials Purchasing Supervisor, Manufacturing Supervisor, Buyer Digital Equipment Corporation August 1985  –  May 1992  (6 years 10 months) Galway Education NAPM CPM, Procurement APICS CPIM, Production & Inventory Management University College Cork Bachelor of Commerce (B.Com.) NAPM CPM, Procurement NAPM CPM, Procurement NAPM CPM, Procurement APICS CPIM, Production & Inventory Management APICS CPIM, Production & Inventory Management APICS CPIM, Production & Inventory Management University College Cork Bachelor of Commerce (B.Com.) University College Cork Bachelor of Commerce (B.Com.) University College Cork Bachelor of Commerce (B.Com.) ", "Languages English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Venture Capital Business Strategy Consumer Internet Investments Start-ups Entrepreneurship Entrepreneur Competitive Analysis Negotiation Marketing Strategy Fundraising Strategy Development Product Strategy Strategy Strategic Partnerships Product Management Cloud Computing See 2+     See less Skills  Venture Capital Business Strategy Consumer Internet Investments Start-ups Entrepreneurship Entrepreneur Competitive Analysis Negotiation Marketing Strategy Fundraising Strategy Development Product Strategy Strategy Strategic Partnerships Product Management Cloud Computing See 2+     See less Venture Capital Business Strategy Consumer Internet Investments Start-ups Entrepreneurship Entrepreneur Competitive Analysis Negotiation Marketing Strategy Fundraising Strategy Development Product Strategy Strategy Strategic Partnerships Product Management Cloud Computing See 2+     See less Venture Capital Business Strategy Consumer Internet Investments Start-ups Entrepreneurship Entrepreneur Competitive Analysis Negotiation Marketing Strategy Fundraising Strategy Development Product Strategy Strategy Strategic Partnerships Product Management Cloud Computing See 2+     See less ", "Experience Purchasing Manager Intel Corporation Purchasing Manager Intel Corporation Purchasing Manager Intel Corporation Skills Supplier Evaluation Supply Management Failure Analysis MRP Strategic Sourcing Global Sourcing Semiconductors Supply Chain Skills  Supplier Evaluation Supply Management Failure Analysis MRP Strategic Sourcing Global Sourcing Semiconductors Supply Chain Supplier Evaluation Supply Management Failure Analysis MRP Strategic Sourcing Global Sourcing Semiconductors Supply Chain Supplier Evaluation Supply Management Failure Analysis MRP Strategic Sourcing Global Sourcing Semiconductors Supply Chain ", "Skills Management Cross-functional Team... Manufacturing Change Management Program Management Training Consulting Skills  Management Cross-functional Team... Manufacturing Change Management Program Management Training Consulting Management Cross-functional Team... Manufacturing Change Management Program Management Training Consulting Management Cross-functional Team... Manufacturing Change Management Program Management Training Consulting ", "Skills Cross-functional Team... Team Management Program Management Integration Organizational... Contract Negotiation Talent Acquisition Performance Management Employee Relations Talent Management Management Supply Chain Vendor Management Strategy Team Leadership Process Improvement Strategic Partnerships Interviews Business Relationship... Global Sourcing Integrity Communication Onboarding Graduate Recruitment Interviewing Competency Based... Building Organizational... Problem Solving Retention Strategies Collaborative Problem... Coaching & Mentoring Mergers & Acquisitions Acquisition Integration See 18+     See less Skills  Cross-functional Team... Team Management Program Management Integration Organizational... Contract Negotiation Talent Acquisition Performance Management Employee Relations Talent Management Management Supply Chain Vendor Management Strategy Team Leadership Process Improvement Strategic Partnerships Interviews Business Relationship... Global Sourcing Integrity Communication Onboarding Graduate Recruitment Interviewing Competency Based... Building Organizational... Problem Solving Retention Strategies Collaborative Problem... Coaching & Mentoring Mergers & Acquisitions Acquisition Integration See 18+     See less Cross-functional Team... Team Management Program Management Integration Organizational... Contract Negotiation Talent Acquisition Performance Management Employee Relations Talent Management Management Supply Chain Vendor Management Strategy Team Leadership Process Improvement Strategic Partnerships Interviews Business Relationship... Global Sourcing Integrity Communication Onboarding Graduate Recruitment Interviewing Competency Based... Building Organizational... Problem Solving Retention Strategies Collaborative Problem... Coaching & Mentoring Mergers & Acquisitions Acquisition Integration See 18+     See less Cross-functional Team... Team Management Program Management Integration Organizational... Contract Negotiation Talent Acquisition Performance Management Employee Relations Talent Management Management Supply Chain Vendor Management Strategy Team Leadership Process Improvement Strategic Partnerships Interviews Business Relationship... Global Sourcing Integrity Communication Onboarding Graduate Recruitment Interviewing Competency Based... Building Organizational... Problem Solving Retention Strategies Collaborative Problem... Coaching & Mentoring Mergers & Acquisitions Acquisition Integration See 18+     See less ", "Summary Purchasing manager with over 10 years of gradual professional growth in purchasing and supply chain, experienced in direct and indirect procurement of various categories for different industries. \n \n-\tExpert knowledge in multiple commodity areas and categories, incl. professional services, HW, telecom, SW outsourcing, logistics, facility management and services, spares and technological materials \n-\tExperiences within cross-cultural environment and highly matrix organizational hierarchy \n-\tAchieved records in supply base management, operational and capital cost reduction with strong interpersonal and negotiation skills \n-\tAchieved leader and people manager with ability to build effective teams and manage geographically dispersed personnel in Russia and EMEA Summary Purchasing manager with over 10 years of gradual professional growth in purchasing and supply chain, experienced in direct and indirect procurement of various categories for different industries. \n \n-\tExpert knowledge in multiple commodity areas and categories, incl. professional services, HW, telecom, SW outsourcing, logistics, facility management and services, spares and technological materials \n-\tExperiences within cross-cultural environment and highly matrix organizational hierarchy \n-\tAchieved records in supply base management, operational and capital cost reduction with strong interpersonal and negotiation skills \n-\tAchieved leader and people manager with ability to build effective teams and manage geographically dispersed personnel in Russia and EMEA Purchasing manager with over 10 years of gradual professional growth in purchasing and supply chain, experienced in direct and indirect procurement of various categories for different industries. \n \n-\tExpert knowledge in multiple commodity areas and categories, incl. professional services, HW, telecom, SW outsourcing, logistics, facility management and services, spares and technological materials \n-\tExperiences within cross-cultural environment and highly matrix organizational hierarchy \n-\tAchieved records in supply base management, operational and capital cost reduction with strong interpersonal and negotiation skills \n-\tAchieved leader and people manager with ability to build effective teams and manage geographically dispersed personnel in Russia and EMEA Purchasing manager with over 10 years of gradual professional growth in purchasing and supply chain, experienced in direct and indirect procurement of various categories for different industries. \n \n-\tExpert knowledge in multiple commodity areas and categories, incl. professional services, HW, telecom, SW outsourcing, logistics, facility management and services, spares and technological materials \n-\tExperiences within cross-cultural environment and highly matrix organizational hierarchy \n-\tAchieved records in supply base management, operational and capital cost reduction with strong interpersonal and negotiation skills \n-\tAchieved leader and people manager with ability to build effective teams and manage geographically dispersed personnel in Russia and EMEA Experience Purchasing Manager Intel Corporation 2004  – Present (11 years) Russian Federation Purchasing Manager Intel Corporation 2004  – Present (11 years) Russian Federation Purchasing Manager Intel Corporation 2004  – Present (11 years) Russian Federation Languages English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills SAP R/3 people management Project Management Supply Chain Management Logistics e-purchasing Contract Negotiation Contract Management Supplier Quality... Risk Management Lean Management Cross-functional Team... Customer Service Supply Chain Microsoft Excel PowerPoint Microsoft Word Microsoft Office Management Procurement Supply Management Purchasing Outsourcing Leadership Negotiation Strategic Sourcing Spend Analysis Human Resources Sourcing SAP Global Sourcing Process Improvement Vendor Management Forecasting Supply Chain... Supplier Negotiation Operations Management Change Management See 23+     See less Skills  SAP R/3 people management Project Management Supply Chain Management Logistics e-purchasing Contract Negotiation Contract Management Supplier Quality... Risk Management Lean Management Cross-functional Team... Customer Service Supply Chain Microsoft Excel PowerPoint Microsoft Word Microsoft Office Management Procurement Supply Management Purchasing Outsourcing Leadership Negotiation Strategic Sourcing Spend Analysis Human Resources Sourcing SAP Global Sourcing Process Improvement Vendor Management Forecasting Supply Chain... Supplier Negotiation Operations Management Change Management See 23+     See less SAP R/3 people management Project Management Supply Chain Management Logistics e-purchasing Contract Negotiation Contract Management Supplier Quality... Risk Management Lean Management Cross-functional Team... Customer Service Supply Chain Microsoft Excel PowerPoint Microsoft Word Microsoft Office Management Procurement Supply Management Purchasing Outsourcing Leadership Negotiation Strategic Sourcing Spend Analysis Human Resources Sourcing SAP Global Sourcing Process Improvement Vendor Management Forecasting Supply Chain... Supplier Negotiation Operations Management Change Management See 23+     See less SAP R/3 people management Project Management Supply Chain Management Logistics e-purchasing Contract Negotiation Contract Management Supplier Quality... Risk Management Lean Management Cross-functional Team... Customer Service Supply Chain Microsoft Excel PowerPoint Microsoft Word Microsoft Office Management Procurement Supply Management Purchasing Outsourcing Leadership Negotiation Strategic Sourcing Spend Analysis Human Resources Sourcing SAP Global Sourcing Process Improvement Vendor Management Forecasting Supply Chain... Supplier Negotiation Operations Management Change Management See 23+     See less Education Higher School of Economics MBA 2010  – 2012 Linguistics University of Nizhny Novgorod (LUNN) Public Relations 1997  – 2000 Linguistics University of Nizhny Novgorod (LUNN) Cross-cultural Communications 1995  – 2000 14 24 Higher School of Economics MBA 2010  – 2012 Higher School of Economics MBA 2010  – 2012 Higher School of Economics MBA 2010  – 2012 Linguistics University of Nizhny Novgorod (LUNN) Public Relations 1997  – 2000 Linguistics University of Nizhny Novgorod (LUNN) Public Relations 1997  – 2000 Linguistics University of Nizhny Novgorod (LUNN) Public Relations 1997  – 2000 Linguistics University of Nizhny Novgorod (LUNN) Cross-cultural Communications 1995  – 2000 Linguistics University of Nizhny Novgorod (LUNN) Cross-cultural Communications 1995  – 2000 Linguistics University of Nizhny Novgorod (LUNN) Cross-cultural Communications 1995  – 2000 14 14 14 24 24 24 ", "Skills Supply Management MRP Strategic Sourcing Cross-functional Team... Materials Management Supply Chain Management Manufacturing Supply Chain Semiconductors Global Sourcing Process Improvement Lean Manufacturing Six Sigma Purchasing Procurement Product Development Continuous Improvement Inventory Management Program Management Contract Negotiation See 5+     See less Skills  Supply Management MRP Strategic Sourcing Cross-functional Team... Materials Management Supply Chain Management Manufacturing Supply Chain Semiconductors Global Sourcing Process Improvement Lean Manufacturing Six Sigma Purchasing Procurement Product Development Continuous Improvement Inventory Management Program Management Contract Negotiation See 5+     See less Supply Management MRP Strategic Sourcing Cross-functional Team... Materials Management Supply Chain Management Manufacturing Supply Chain Semiconductors Global Sourcing Process Improvement Lean Manufacturing Six Sigma Purchasing Procurement Product Development Continuous Improvement Inventory Management Program Management Contract Negotiation See 5+     See less Supply Management MRP Strategic Sourcing Cross-functional Team... Materials Management Supply Chain Management Manufacturing Supply Chain Semiconductors Global Sourcing Process Improvement Lean Manufacturing Six Sigma Purchasing Procurement Product Development Continuous Improvement Inventory Management Program Management Contract Negotiation See 5+     See less ", "Experience Commodity Manager Intel Corporation November 2010  – Present (4 years 10 months) Purchasing Manager Intel Corporation January 2010  –  November 2010  (11 months) Program Manger Intel Corporation January 2008  –  December 2009  (2 years) Materials Manager Intel Corporation April 2004  –  December 2007  (3 years 9 months) China Purchasing Manager Intel Corporation January 2000  –  March 2004  (4 years 3 months) Shanghai City, China Senior Buyer Intel Corporation August 1997  –  December 1999  (2 years 5 months) Shanghai City, China Sourcing Specialist Caterpillar Inc. July 1995  –  July 1997  (2 years 1 month) Shanghai City, China Project Engineer Shanghai Textile Scientific Research Institute July 1984  –  June 1995  (11 years) Commodity Manager Intel Corporation November 2010  – Present (4 years 10 months) Commodity Manager Intel Corporation November 2010  – Present (4 years 10 months) Purchasing Manager Intel Corporation January 2010  –  November 2010  (11 months) Purchasing Manager Intel Corporation January 2010  –  November 2010  (11 months) Program Manger Intel Corporation January 2008  –  December 2009  (2 years) Program Manger Intel Corporation January 2008  –  December 2009  (2 years) Materials Manager Intel Corporation April 2004  –  December 2007  (3 years 9 months) China Materials Manager Intel Corporation April 2004  –  December 2007  (3 years 9 months) China Purchasing Manager Intel Corporation January 2000  –  March 2004  (4 years 3 months) Shanghai City, China Purchasing Manager Intel Corporation January 2000  –  March 2004  (4 years 3 months) Shanghai City, China Senior Buyer Intel Corporation August 1997  –  December 1999  (2 years 5 months) Shanghai City, China Senior Buyer Intel Corporation August 1997  –  December 1999  (2 years 5 months) Shanghai City, China Sourcing Specialist Caterpillar Inc. July 1995  –  July 1997  (2 years 1 month) Shanghai City, China Sourcing Specialist Caterpillar Inc. July 1995  –  July 1997  (2 years 1 month) Shanghai City, China Project Engineer Shanghai Textile Scientific Research Institute July 1984  –  June 1995  (11 years) Project Engineer Shanghai Textile Scientific Research Institute July 1984  –  June 1995  (11 years) Skills Strategic Sourcing Supplier Negotiation Contract Management Vendor Management Inventory Planning Inventory Management Risk Management Materials Management Outsourcing Management Supplier Quality... Supply Chain Management Manufacturing Program Management Project Management MRP Skills  Strategic Sourcing Supplier Negotiation Contract Management Vendor Management Inventory Planning Inventory Management Risk Management Materials Management Outsourcing Management Supplier Quality... Supply Chain Management Manufacturing Program Management Project Management MRP Strategic Sourcing Supplier Negotiation Contract Management Vendor Management Inventory Planning Inventory Management Risk Management Materials Management Outsourcing Management Supplier Quality... Supply Chain Management Manufacturing Program Management Project Management MRP Strategic Sourcing Supplier Negotiation Contract Management Vendor Management Inventory Planning Inventory Management Risk Management Materials Management Outsourcing Management Supplier Quality... Supply Chain Management Manufacturing Program Management Project Management MRP Education Donghua University Bachelor's degree,  Textile Sciences and Engineering 1980  – 1984 Donghua University Bachelor's degree,  Textile Sciences and Engineering 1980  – 1984 Donghua University Bachelor's degree,  Textile Sciences and Engineering 1980  – 1984 Donghua University Bachelor's degree,  Textile Sciences and Engineering 1980  – 1984 "]}