{"position": "Quantitative Analyst Intern - Monthly", "company": "Google", "profiles": ["Experience Quantitative Analyst - Intern NextEra Energy Resources June 2015  – Present (2 months) Juno Beach, Florida Co-Founder Redove Gaming Ltd. July 2012  – Present (3 years 1 month) -Developed a multiplayer action iOS game with three other senior students \n-Developed back-end server API in php \n-Developed UI and game engine in Cocos2D \n Economist Ontario Financing Authority February 2014  –  January 2015  (1 year) Toronto, Canada Area -Financial Modeling for Renewable Energy projects (Province partnered with aboriginal communities) \n-Priced PPA between Ontario and Non-Utility Generators (NUGs) Operations Analyst RBC Capital Markets May 2013  –  January 2014  (9 months) 155 Wellington West -Determined MTM of OTC Power trades \n-Reconciled deals for commodities trading desk in Excel, and programmed macro to speed up process Application Analyst Intern National Bank Financial May 2012  –  July 2012  (3 months) Toronto, Canada Area -Supported trade floor application issues (booking/amending/canceling deals)  \n-Developed and maintained Perl and Shell scripts for Global One trading booking system Prime Brokerage Analyst Intern BMO Capital Markets January 2012  –  April 2012  (4 months) Toronto, Canada Area -Maintained credit margin limits for hedge funds \n-Developed Excel model to improve process of tracking fixed priced bonds from Bloomberg Corporate Financial Analyst Intern Scotiabank May 2011  –  September 2011  (5 months) Toronto, Canada Area -Worked directly with senior analysts and Director of Corporate Finance on General Ledger migration project (from INEA into Oracle PeopleSoft) \n-Migrated Funds Transfer Pricing and Internal accounting allocation rules Business Analyst Intern eHealth Ontario September 2010  –  December 2010  (4 months) Toronto, Canada Systems Analyst Intern Ontario Teachers' Pension Plan January 2010  –  May 2010  (5 months) Toronto, Canada Corporate Banking Analyst Intern Bank of China May 2009  –  September 2009  (5 months) Guangzhou, China Quantitative Analyst - Intern NextEra Energy Resources June 2015  – Present (2 months) Juno Beach, Florida Quantitative Analyst - Intern NextEra Energy Resources June 2015  – Present (2 months) Juno Beach, Florida Co-Founder Redove Gaming Ltd. July 2012  – Present (3 years 1 month) -Developed a multiplayer action iOS game with three other senior students \n-Developed back-end server API in php \n-Developed UI and game engine in Cocos2D \n Co-Founder Redove Gaming Ltd. July 2012  – Present (3 years 1 month) -Developed a multiplayer action iOS game with three other senior students \n-Developed back-end server API in php \n-Developed UI and game engine in Cocos2D \n Economist Ontario Financing Authority February 2014  –  January 2015  (1 year) Toronto, Canada Area -Financial Modeling for Renewable Energy projects (Province partnered with aboriginal communities) \n-Priced PPA between Ontario and Non-Utility Generators (NUGs) Economist Ontario Financing Authority February 2014  –  January 2015  (1 year) Toronto, Canada Area -Financial Modeling for Renewable Energy projects (Province partnered with aboriginal communities) \n-Priced PPA between Ontario and Non-Utility Generators (NUGs) Operations Analyst RBC Capital Markets May 2013  –  January 2014  (9 months) 155 Wellington West -Determined MTM of OTC Power trades \n-Reconciled deals for commodities trading desk in Excel, and programmed macro to speed up process Operations Analyst RBC Capital Markets May 2013  –  January 2014  (9 months) 155 Wellington West -Determined MTM of OTC Power trades \n-Reconciled deals for commodities trading desk in Excel, and programmed macro to speed up process Application Analyst Intern National Bank Financial May 2012  –  July 2012  (3 months) Toronto, Canada Area -Supported trade floor application issues (booking/amending/canceling deals)  \n-Developed and maintained Perl and Shell scripts for Global One trading booking system Application Analyst Intern National Bank Financial May 2012  –  July 2012  (3 months) Toronto, Canada Area -Supported trade floor application issues (booking/amending/canceling deals)  \n-Developed and maintained Perl and Shell scripts for Global One trading booking system Prime Brokerage Analyst Intern BMO Capital Markets January 2012  –  April 2012  (4 months) Toronto, Canada Area -Maintained credit margin limits for hedge funds \n-Developed Excel model to improve process of tracking fixed priced bonds from Bloomberg Prime Brokerage Analyst Intern BMO Capital Markets January 2012  –  April 2012  (4 months) Toronto, Canada Area -Maintained credit margin limits for hedge funds \n-Developed Excel model to improve process of tracking fixed priced bonds from Bloomberg Corporate Financial Analyst Intern Scotiabank May 2011  –  September 2011  (5 months) Toronto, Canada Area -Worked directly with senior analysts and Director of Corporate Finance on General Ledger migration project (from INEA into Oracle PeopleSoft) \n-Migrated Funds Transfer Pricing and Internal accounting allocation rules Corporate Financial Analyst Intern Scotiabank May 2011  –  September 2011  (5 months) Toronto, Canada Area -Worked directly with senior analysts and Director of Corporate Finance on General Ledger migration project (from INEA into Oracle PeopleSoft) \n-Migrated Funds Transfer Pricing and Internal accounting allocation rules Business Analyst Intern eHealth Ontario September 2010  –  December 2010  (4 months) Toronto, Canada Business Analyst Intern eHealth Ontario September 2010  –  December 2010  (4 months) Toronto, Canada Systems Analyst Intern Ontario Teachers' Pension Plan January 2010  –  May 2010  (5 months) Toronto, Canada Systems Analyst Intern Ontario Teachers' Pension Plan January 2010  –  May 2010  (5 months) Toronto, Canada Corporate Banking Analyst Intern Bank of China May 2009  –  September 2009  (5 months) Guangzhou, China Corporate Banking Analyst Intern Bank of China May 2009  –  September 2009  (5 months) Guangzhou, China Skills Top Skills 30 VBA 23 SQL 20 Matlab 15 Quantitative Finance 11 Java 5 PHP 4 Objective-C 2 C++ 2 Python 1 PeopleSoft Skills  Top Skills 30 VBA 23 SQL 20 Matlab 15 Quantitative Finance 11 Java 5 PHP 4 Objective-C 2 C++ 2 Python 1 PeopleSoft Top Skills 30 VBA 23 SQL 20 Matlab 15 Quantitative Finance 11 Java 5 PHP 4 Objective-C 2 C++ 2 Python 1 PeopleSoft Top Skills 30 VBA 23 SQL 20 Matlab 15 Quantitative Finance 11 Java 5 PHP 4 Objective-C 2 C++ 2 Python 1 PeopleSoft                     Education Cornell University Graduate School Master of Engineering (MEng),  Financial Engineering 2014  – 2015 University of Waterloo BMath,  Financial Analysis/Risk Management Coop , 3.7 2008  – 2013 (Open) 1 recommendation Tony Tang ★ Performance Marketer, Affiliates - Mobile User Acquisition @ Machine Zone, Inc. When I think of problem-solving, analytical thinking, technical and programming capabilities, one of the first people that comes to mind is Tianbo Li. A mathematically talented person dedicated to solving challenges effectively and efficiently with... View Cornell University Graduate School Master of Engineering (MEng),  Financial Engineering 2014  – 2015 Cornell University Graduate School Master of Engineering (MEng),  Financial Engineering 2014  – 2015 Cornell University Graduate School Master of Engineering (MEng),  Financial Engineering 2014  – 2015 University of Waterloo BMath,  Financial Analysis/Risk Management Coop , 3.7 2008  – 2013 (Open) 1 recommendation Tony Tang ★ Performance Marketer, Affiliates - Mobile User Acquisition @ Machine Zone, Inc. When I think of problem-solving, analytical thinking, technical and programming capabilities, one of the first people that comes to mind is Tianbo Li. A mathematically talented person dedicated to solving challenges effectively and efficiently with... View University of Waterloo BMath,  Financial Analysis/Risk Management Coop , 3.7 2008  – 2013 (Open) 1 recommendation Tony Tang ★ Performance Marketer, Affiliates - Mobile User Acquisition @ Machine Zone, Inc. When I think of problem-solving, analytical thinking, technical and programming capabilities, one of the first people that comes to mind is Tianbo Li. A mathematically talented person dedicated to solving challenges effectively and efficiently with... View University of Waterloo BMath,  Financial Analysis/Risk Management Coop , 3.7 2008  – 2013 (Open) 1 recommendation Tony Tang ★ Performance Marketer, Affiliates - Mobile User Acquisition @ Machine Zone, Inc. When I think of problem-solving, analytical thinking, technical and programming capabilities, one of the first people that comes to mind is Tianbo Li. A mathematically talented person dedicated to solving challenges effectively and efficiently with... View ", "Summary Innovative professional who is highly skilled at Excel; capable of using pivot tables, vlookups, and other powerful analytical tools learned through practical application and frequent exposure. Able to accurately catalog high volumes of data and run complex analysis as developed through work on numerous projects. Known for being diligent, curious, and accurate. Resume Edit Summary Innovative professional who is highly skilled at Excel; capable of using pivot tables, vlookups, and other powerful analytical tools learned through practical application and frequent exposure. Able to accurately catalog high volumes of data and run complex analysis as developed through work on numerous projects. Known for being diligent, curious, and accurate. Resume Edit Innovative professional who is highly skilled at Excel; capable of using pivot tables, vlookups, and other powerful analytical tools learned through practical application and frequent exposure. Able to accurately catalog high volumes of data and run complex analysis as developed through work on numerous projects. Known for being diligent, curious, and accurate. Innovative professional who is highly skilled at Excel; capable of using pivot tables, vlookups, and other powerful analytical tools learned through practical application and frequent exposure. Able to accurately catalog high volumes of data and run complex analysis as developed through work on numerous projects. Known for being diligent, curious, and accurate. Resume Edit Resume Edit Resume Edit Resume  Resume  Experience Quantitative Analyst Intern Level 3 Communications June 2015  – Present (2 months) Broomfield, CO • Designed applied models used in evidence-based decision-making \n• Optimized pricing structure using time series and cross-sectional econometric techniques Data Solutions Intern sovrn Holdings, Inc. April 2014  –  August 2014  (5 months) Boulder, CO •\tEarned more than $10,000 in company profits through day-trading campaigns. \n•\tInvested company money based on current and previous day analysis and business acumen. \n•\tSummarized analytical results and provided recommendations to business leaders at all levels. \n•\tEffectively managed personal workload with consistently changing priorities. Econometric Research Assistant CSU Economics Department, Harvey Cutler August 2013  –  December 2013  (5 months) Colorado State University •\tProjected Colorado state tax revenue utilizing econometric regression analysis. \n•\tCollaborated on a team of six to publish a report for state government review. \n•\tProcessed over 500,000 rows of data with an extremely high level of accuracy. Staff Auditor Media Audits International May 2013  –  August 2013  (4 months) Greenwood Village, CO •\tAudited and accounted for more than $150 million in corporate accounts. \n•\tPerformed in-depth financial analysis of multiple high value revenue streams. \n•\tConsolidated complex results into clear executive summaries. Quantitative Analyst Intern Level 3 Communications June 2015  – Present (2 months) Broomfield, CO • Designed applied models used in evidence-based decision-making \n• Optimized pricing structure using time series and cross-sectional econometric techniques Quantitative Analyst Intern Level 3 Communications June 2015  – Present (2 months) Broomfield, CO • Designed applied models used in evidence-based decision-making \n• Optimized pricing structure using time series and cross-sectional econometric techniques Data Solutions Intern sovrn Holdings, Inc. April 2014  –  August 2014  (5 months) Boulder, CO •\tEarned more than $10,000 in company profits through day-trading campaigns. \n•\tInvested company money based on current and previous day analysis and business acumen. \n•\tSummarized analytical results and provided recommendations to business leaders at all levels. \n•\tEffectively managed personal workload with consistently changing priorities. Data Solutions Intern sovrn Holdings, Inc. April 2014  –  August 2014  (5 months) Boulder, CO •\tEarned more than $10,000 in company profits through day-trading campaigns. \n•\tInvested company money based on current and previous day analysis and business acumen. \n•\tSummarized analytical results and provided recommendations to business leaders at all levels. \n•\tEffectively managed personal workload with consistently changing priorities. Econometric Research Assistant CSU Economics Department, Harvey Cutler August 2013  –  December 2013  (5 months) Colorado State University •\tProjected Colorado state tax revenue utilizing econometric regression analysis. \n•\tCollaborated on a team of six to publish a report for state government review. \n•\tProcessed over 500,000 rows of data with an extremely high level of accuracy. Econometric Research Assistant CSU Economics Department, Harvey Cutler August 2013  –  December 2013  (5 months) Colorado State University •\tProjected Colorado state tax revenue utilizing econometric regression analysis. \n•\tCollaborated on a team of six to publish a report for state government review. \n•\tProcessed over 500,000 rows of data with an extremely high level of accuracy. Staff Auditor Media Audits International May 2013  –  August 2013  (4 months) Greenwood Village, CO •\tAudited and accounted for more than $150 million in corporate accounts. \n•\tPerformed in-depth financial analysis of multiple high value revenue streams. \n•\tConsolidated complex results into clear executive summaries. Staff Auditor Media Audits International May 2013  –  August 2013  (4 months) Greenwood Village, CO •\tAudited and accounted for more than $150 million in corporate accounts. \n•\tPerformed in-depth financial analysis of multiple high value revenue streams. \n•\tConsolidated complex results into clear executive summaries. Languages MySQL Professional working proficiency Hive Professional working proficiency Stata Professional working proficiency R (GNUS) Limited working proficiency Tableau Professional working proficiency MySQL Professional working proficiency Hive Professional working proficiency Stata Professional working proficiency R (GNUS) Limited working proficiency Tableau Professional working proficiency MySQL Professional working proficiency Hive Professional working proficiency Stata Professional working proficiency R (GNUS) Limited working proficiency Tableau Professional working proficiency Professional working proficiency Professional working proficiency Professional working proficiency Limited working proficiency Professional working proficiency Skills Top Skills 11 Economics 10 Microsoft Excel 1 Econometrics 4 Research 6 Leadership 0 MySQL 0 Stata 0 Hive 1 R 6 Analysis Seth M. also knows about... 0 Gretl 0 Quantitative Research 1 Technical Writing 1 Java 4 Public Speaking Skills  Top Skills 11 Economics 10 Microsoft Excel 1 Econometrics 4 Research 6 Leadership 0 MySQL 0 Stata 0 Hive 1 R 6 Analysis Seth M. also knows about... 0 Gretl 0 Quantitative Research 1 Technical Writing 1 Java 4 Public Speaking Top Skills 11 Economics 10 Microsoft Excel 1 Econometrics 4 Research 6 Leadership 0 MySQL 0 Stata 0 Hive 1 R 6 Analysis Seth M. also knows about... 0 Gretl 0 Quantitative Research 1 Technical Writing 1 Java 4 Public Speaking Top Skills 11 Economics 10 Microsoft Excel 1 Econometrics 4 Research 6 Leadership 0 MySQL 0 Stata 0 Hive 1 R 6 Analysis Seth M. also knows about... 0 Gretl 0 Quantitative Research 1 Technical Writing 1 Java 4 Public Speaking                     0 Gretl 0 Quantitative Research 1 Technical Writing 1 Java 4 Public Speaking Education University of Michigan Master of Science (M.S.),  Applied Economics 2014  – 2015 M.S. in Applied Economics \nConcentration: Econometrics (Economics + Statistics) Colorado State University Bachelor of Science (BS),  Mathematics 2010  – 2014 B.S. in Mathematics \nConcentration: Actuarial Science \nMinors: Business Administration, Statistics, and Economics \n \nOverall GPA: 3.37 \nEconomics GPA: 3.83 Activities and Societies:  Actuarial Club Member ,  Omicron Delta Epsilon (Open) 2 honors and awards Economics Honor Society Omicron Delta Epsilon (ODE) is an international honor society in the field of economics. ODE was founded in 1963. ODE is a... View College of Natural Sciences Deans List View (Open) 10 courses Stochastic Modeling Multiple Regression Analysis Mathematical Statistics Principles of Finance Differential Equations Java Programming Econometrics Advanced Calculus Linear Algebra Risk Management and Insurance See more University of Michigan Master of Science (M.S.),  Applied Economics 2014  – 2015 M.S. in Applied Economics \nConcentration: Econometrics (Economics + Statistics) University of Michigan Master of Science (M.S.),  Applied Economics 2014  – 2015 M.S. in Applied Economics \nConcentration: Econometrics (Economics + Statistics) University of Michigan Master of Science (M.S.),  Applied Economics 2014  – 2015 M.S. in Applied Economics \nConcentration: Econometrics (Economics + Statistics) Colorado State University Bachelor of Science (BS),  Mathematics 2010  – 2014 B.S. in Mathematics \nConcentration: Actuarial Science \nMinors: Business Administration, Statistics, and Economics \n \nOverall GPA: 3.37 \nEconomics GPA: 3.83 Activities and Societies:  Actuarial Club Member ,  Omicron Delta Epsilon (Open) 2 honors and awards Economics Honor Society Omicron Delta Epsilon (ODE) is an international honor society in the field of economics. ODE was founded in 1963. ODE is a... View College of Natural Sciences Deans List View (Open) 10 courses Stochastic Modeling Multiple Regression Analysis Mathematical Statistics Principles of Finance Differential Equations Java Programming Econometrics Advanced Calculus Linear Algebra Risk Management and Insurance See more Colorado State University Bachelor of Science (BS),  Mathematics 2010  – 2014 B.S. in Mathematics \nConcentration: Actuarial Science \nMinors: Business Administration, Statistics, and Economics \n \nOverall GPA: 3.37 \nEconomics GPA: 3.83 Activities and Societies:  Actuarial Club Member ,  Omicron Delta Epsilon (Open) 2 honors and awards Economics Honor Society Omicron Delta Epsilon (ODE) is an international honor society in the field of economics. ODE was founded in 1963. ODE is a... View College of Natural Sciences Deans List View (Open) 10 courses Stochastic Modeling Multiple Regression Analysis Mathematical Statistics Principles of Finance Differential Equations Java Programming Econometrics Advanced Calculus Linear Algebra Risk Management and Insurance See more Colorado State University Bachelor of Science (BS),  Mathematics 2010  – 2014 B.S. in Mathematics \nConcentration: Actuarial Science \nMinors: Business Administration, Statistics, and Economics \n \nOverall GPA: 3.37 \nEconomics GPA: 3.83 Activities and Societies:  Actuarial Club Member ,  Omicron Delta Epsilon (Open) 2 honors and awards Economics Honor Society Omicron Delta Epsilon (ODE) is an international honor society in the field of economics. ODE was founded in 1963. ODE is a... View College of Natural Sciences Deans List View (Open) 10 courses Stochastic Modeling Multiple Regression Analysis Mathematical Statistics Principles of Finance Differential Equations Java Programming Econometrics Advanced Calculus Linear Algebra Risk Management and Insurance See more Honors & Awards Economics Honor Society Omicron Delta Epsilon August 2012 Omicron Delta Epsilon (ODE) is an international honor society in the field of economics. ODE was founded in 1963. ODE is a member of the Association of College Honor Societies; the ACHS indicates that Omicron Delta Epsilon has 88,000 members. ODE currently has 578 active chapters worldwide.  College of Natural Sciences Deans List College of Natural Sciences August 2012 International Baccalaureate Niwot High School May 2010 The IB Diploma Programme (DP) is an academically challenging and balanced programme of education with final examinations that prepares students for success at university and life beyond. It has been designed to address the intellectual, social, emotional and physical well-being of students. The programme, has gained recognition and respect from the world’s leading universities. Economics Honor Society Omicron Delta Epsilon August 2012 Omicron Delta Epsilon (ODE) is an international honor society in the field of economics. ODE was founded in 1963. ODE is a member of the Association of College Honor Societies; the ACHS indicates that Omicron Delta Epsilon has 88,000 members. ODE currently has 578 active chapters worldwide.  Economics Honor Society Omicron Delta Epsilon August 2012 Omicron Delta Epsilon (ODE) is an international honor society in the field of economics. ODE was founded in 1963. ODE is a member of the Association of College Honor Societies; the ACHS indicates that Omicron Delta Epsilon has 88,000 members. ODE currently has 578 active chapters worldwide.  Economics Honor Society Omicron Delta Epsilon August 2012 Omicron Delta Epsilon (ODE) is an international honor society in the field of economics. ODE was founded in 1963. ODE is a member of the Association of College Honor Societies; the ACHS indicates that Omicron Delta Epsilon has 88,000 members. ODE currently has 578 active chapters worldwide.  College of Natural Sciences Deans List College of Natural Sciences August 2012 College of Natural Sciences Deans List College of Natural Sciences August 2012 College of Natural Sciences Deans List College of Natural Sciences August 2012 International Baccalaureate Niwot High School May 2010 The IB Diploma Programme (DP) is an academically challenging and balanced programme of education with final examinations that prepares students for success at university and life beyond. It has been designed to address the intellectual, social, emotional and physical well-being of students. The programme, has gained recognition and respect from the world’s leading universities. International Baccalaureate Niwot High School May 2010 The IB Diploma Programme (DP) is an academically challenging and balanced programme of education with final examinations that prepares students for success at university and life beyond. It has been designed to address the intellectual, social, emotional and physical well-being of students. The programme, has gained recognition and respect from the world’s leading universities. International Baccalaureate Niwot High School May 2010 The IB Diploma Programme (DP) is an academically challenging and balanced programme of education with final examinations that prepares students for success at university and life beyond. It has been designed to address the intellectual, social, emotional and physical well-being of students. The programme, has gained recognition and respect from the world’s leading universities. ", "Summary I am a Ph.D. student in Financial Econometrics at UNC Chapel Hill. My general area of research interest is asset pricing, and I am currently undertaking a project on conditional skewness and quantile estimations of equity returns. I find mathematical finance quite exciting and appealing, as it bears a great relevance to my research. I am seeking a 2015 summer internship in quantitative finance/consulting at the moment, and will be on the job market for full-time positions in 2016. Summary I am a Ph.D. student in Financial Econometrics at UNC Chapel Hill. My general area of research interest is asset pricing, and I am currently undertaking a project on conditional skewness and quantile estimations of equity returns. I find mathematical finance quite exciting and appealing, as it bears a great relevance to my research. I am seeking a 2015 summer internship in quantitative finance/consulting at the moment, and will be on the job market for full-time positions in 2016. I am a Ph.D. student in Financial Econometrics at UNC Chapel Hill. My general area of research interest is asset pricing, and I am currently undertaking a project on conditional skewness and quantile estimations of equity returns. I find mathematical finance quite exciting and appealing, as it bears a great relevance to my research. I am seeking a 2015 summer internship in quantitative finance/consulting at the moment, and will be on the job market for full-time positions in 2016. I am a Ph.D. student in Financial Econometrics at UNC Chapel Hill. My general area of research interest is asset pricing, and I am currently undertaking a project on conditional skewness and quantile estimations of equity returns. I find mathematical finance quite exciting and appealing, as it bears a great relevance to my research. I am seeking a 2015 summer internship in quantitative finance/consulting at the moment, and will be on the job market for full-time positions in 2016. Experience Quantitative Analyst Intern Google June 2015  – Present (2 months) London, United Kingdom Graduate Research Assistant Department of Economics, University of North Carolina at Chapel Hill 2011  – Present (4 years) Chapel Hill, NC, US Statistician Intern American Credit Acceptance May 2014  –  August 2014  (4 months) Spartanburg, SC Designed a business model to evaluate loan payment extension requests from sub-prime auto finance customers. \nExamined customer characteristics and payment histories to determine the criteria for profitable extensions. \nPerformed predictive analysis on quality of extensions and assessed accuracy of these predictions. \nConducted model tuning through machine learning algorithms such as generalized boosted regression model (GBM), AdaBoost, C5.0, classification and regression trees (CART), and support vector machine. Graduate Research Assistant Department of Public Policy, University of North Carolina at Chapel Hill October 2011  –  May 2012  (8 months) Chapel Hill, NC, US Data processing and management using Stata.  \nEvaluated impacts of teacher training programs in North Carolina public schools. \nProcessed large raw data sets for record matching across various years. \nCompiled master files for existing database. Summer Intern, Corporate Finance Department China Merchants Bank July 2008  –  August 2008  (2 months) Shanghai, China Constructed reports regarding firms' accounting standings from balance sheet collected by the department. \nConsulted clients on services such as financial leasing, fund custody, and derivatives trading. \nFamiliarized with day-to-day bank counter operations. Quantitative Analyst Intern Google June 2015  – Present (2 months) London, United Kingdom Quantitative Analyst Intern Google June 2015  – Present (2 months) London, United Kingdom Graduate Research Assistant Department of Economics, University of North Carolina at Chapel Hill 2011  – Present (4 years) Chapel Hill, NC, US Graduate Research Assistant Department of Economics, University of North Carolina at Chapel Hill 2011  – Present (4 years) Chapel Hill, NC, US Statistician Intern American Credit Acceptance May 2014  –  August 2014  (4 months) Spartanburg, SC Designed a business model to evaluate loan payment extension requests from sub-prime auto finance customers. \nExamined customer characteristics and payment histories to determine the criteria for profitable extensions. \nPerformed predictive analysis on quality of extensions and assessed accuracy of these predictions. \nConducted model tuning through machine learning algorithms such as generalized boosted regression model (GBM), AdaBoost, C5.0, classification and regression trees (CART), and support vector machine. Statistician Intern American Credit Acceptance May 2014  –  August 2014  (4 months) Spartanburg, SC Designed a business model to evaluate loan payment extension requests from sub-prime auto finance customers. \nExamined customer characteristics and payment histories to determine the criteria for profitable extensions. \nPerformed predictive analysis on quality of extensions and assessed accuracy of these predictions. \nConducted model tuning through machine learning algorithms such as generalized boosted regression model (GBM), AdaBoost, C5.0, classification and regression trees (CART), and support vector machine. Graduate Research Assistant Department of Public Policy, University of North Carolina at Chapel Hill October 2011  –  May 2012  (8 months) Chapel Hill, NC, US Data processing and management using Stata.  \nEvaluated impacts of teacher training programs in North Carolina public schools. \nProcessed large raw data sets for record matching across various years. \nCompiled master files for existing database. Graduate Research Assistant Department of Public Policy, University of North Carolina at Chapel Hill October 2011  –  May 2012  (8 months) Chapel Hill, NC, US Data processing and management using Stata.  \nEvaluated impacts of teacher training programs in North Carolina public schools. \nProcessed large raw data sets for record matching across various years. \nCompiled master files for existing database. Summer Intern, Corporate Finance Department China Merchants Bank July 2008  –  August 2008  (2 months) Shanghai, China Constructed reports regarding firms' accounting standings from balance sheet collected by the department. \nConsulted clients on services such as financial leasing, fund custody, and derivatives trading. \nFamiliarized with day-to-day bank counter operations. Summer Intern, Corporate Finance Department China Merchants Bank July 2008  –  August 2008  (2 months) Shanghai, China Constructed reports regarding firms' accounting standings from balance sheet collected by the department. \nConsulted clients on services such as financial leasing, fund custody, and derivatives trading. \nFamiliarized with day-to-day bank counter operations. Languages Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 10 R 9 Stata 9 Data Analysis 7 Research 6 Statistical Modeling 5 Matlab 4 Economics 3 Financial Modeling 2 C++ 2 LaTeX Hanwei also knows about... 2 Econometrics 1 Statistics Skills  Top Skills 10 R 9 Stata 9 Data Analysis 7 Research 6 Statistical Modeling 5 Matlab 4 Economics 3 Financial Modeling 2 C++ 2 LaTeX Hanwei also knows about... 2 Econometrics 1 Statistics Top Skills 10 R 9 Stata 9 Data Analysis 7 Research 6 Statistical Modeling 5 Matlab 4 Economics 3 Financial Modeling 2 C++ 2 LaTeX Hanwei also knows about... 2 Econometrics 1 Statistics Top Skills 10 R 9 Stata 9 Data Analysis 7 Research 6 Statistical Modeling 5 Matlab 4 Economics 3 Financial Modeling 2 C++ 2 LaTeX Hanwei also knows about... 2 Econometrics 1 Statistics                     2 Econometrics 1 Statistics Education University of North Carolina at Chapel Hill Doctor of Philosophy (Ph.D.),  Economics 2011  – 2016 (Open) 2 projects GARCH Modeling in Portfolio Selection Designed an investment strategy that can be applied to general portfolio management cases.\nImplemented the strategy through... View Monte Carlo Methods for Option Pricing Used Monte Carlo simulation techniques to calculate European call option prices.\nDeveloped the code such that customization... View (Open) 9 courses Empirical Finance Financial Economics Time Series Probability Theory Stochastic Calculus Financial Statistics Measure Theory Advanced Microeconomics Advanced Macroeconomics See more Georgia State University M.A.,  Economics 2009  – 2011 Activities and Societies:  Phi Beta Delta Honor Society for International Scholars Peking University B.S./B.A.,  Computer Science/Economics 2005  – 2009 (Open) 4 courses Algorithm and Data Structure Numeric Methods Introductory Accounting Money and Banking See more University of North Carolina at Chapel Hill Doctor of Philosophy (Ph.D.),  Economics 2011  – 2016 (Open) 2 projects GARCH Modeling in Portfolio Selection Designed an investment strategy that can be applied to general portfolio management cases.\nImplemented the strategy through... View Monte Carlo Methods for Option Pricing Used Monte Carlo simulation techniques to calculate European call option prices.\nDeveloped the code such that customization... View (Open) 9 courses Empirical Finance Financial Economics Time Series Probability Theory Stochastic Calculus Financial Statistics Measure Theory Advanced Microeconomics Advanced Macroeconomics See more University of North Carolina at Chapel Hill Doctor of Philosophy (Ph.D.),  Economics 2011  – 2016 (Open) 2 projects GARCH Modeling in Portfolio Selection Designed an investment strategy that can be applied to general portfolio management cases.\nImplemented the strategy through... View Monte Carlo Methods for Option Pricing Used Monte Carlo simulation techniques to calculate European call option prices.\nDeveloped the code such that customization... View (Open) 9 courses Empirical Finance Financial Economics Time Series Probability Theory Stochastic Calculus Financial Statistics Measure Theory Advanced Microeconomics Advanced Macroeconomics See more University of North Carolina at Chapel Hill Doctor of Philosophy (Ph.D.),  Economics 2011  – 2016 (Open) 2 projects GARCH Modeling in Portfolio Selection Designed an investment strategy that can be applied to general portfolio management cases.\nImplemented the strategy through... View Monte Carlo Methods for Option Pricing Used Monte Carlo simulation techniques to calculate European call option prices.\nDeveloped the code such that customization... View (Open) 9 courses Empirical Finance Financial Economics Time Series Probability Theory Stochastic Calculus Financial Statistics Measure Theory Advanced Microeconomics Advanced Macroeconomics See more Georgia State University M.A.,  Economics 2009  – 2011 Activities and Societies:  Phi Beta Delta Honor Society for International Scholars Georgia State University M.A.,  Economics 2009  – 2011 Activities and Societies:  Phi Beta Delta Honor Society for International Scholars Georgia State University M.A.,  Economics 2009  – 2011 Activities and Societies:  Phi Beta Delta Honor Society for International Scholars Peking University B.S./B.A.,  Computer Science/Economics 2005  – 2009 (Open) 4 courses Algorithm and Data Structure Numeric Methods Introductory Accounting Money and Banking See more Peking University B.S./B.A.,  Computer Science/Economics 2005  – 2009 (Open) 4 courses Algorithm and Data Structure Numeric Methods Introductory Accounting Money and Banking See more Peking University B.S./B.A.,  Computer Science/Economics 2005  – 2009 (Open) 4 courses Algorithm and Data Structure Numeric Methods Introductory Accounting Money and Banking See more ", "Summary I am currently a graduate student at University of California, Los Angeles, Anderson School of Management, pursing Masters in Financial Engineering. \n \nI am looking forward to a career in risk management, valuation or asset management. Summary I am currently a graduate student at University of California, Los Angeles, Anderson School of Management, pursing Masters in Financial Engineering. \n \nI am looking forward to a career in risk management, valuation or asset management. I am currently a graduate student at University of California, Los Angeles, Anderson School of Management, pursing Masters in Financial Engineering. \n \nI am looking forward to a career in risk management, valuation or asset management. I am currently a graduate student at University of California, Los Angeles, Anderson School of Management, pursing Masters in Financial Engineering. \n \nI am looking forward to a career in risk management, valuation or asset management. Experience Quantitative Analyst Intern Dhandho Holdings Corp June 2015  – Present (2 months) San Juan, Puerto Rico •\tImplement the investment strategy using R and Excel \n•\tBacktest and optimize financial products developed by Dhandho Holdings \n•\tUse Bloomberg and Capital IQ to search for company information of SP 500 constituents \n Research Engineer National University of Singapore January 2014  –  October 2014  (10 months) Singapore •\tCollaborated on a project with Digital Storage Institute of Singapore on improving positioning accuracy of hard disk drive \n•\tConducted academic literature reviews and replicated paper findings on hard disk drive  \n•\tDeveloped MATLAB code, built model with Simulink and validated model through hands-on experiments on hard disk drive \n•\tAnalyzed simulation and experimental results to make appropriate design decisions \n•\tMentored an undergraduate student for the final year projec Final Year Student National University of Singapore August 2012  –  May 2013  (10 months) Singapore Topic: Adaptive Control of Nonlinear Systems Using Multiple Models \n•\tAnalyzed mass in-sample and out-of-sample data and built auto-regressive models for simulations using MATLAB \n•\tDeveloped least squares algorithms, utilized MATLAB toolboxes and researched into latest findings for improvement of current methodologies Intern Industrial and Commercial Bank of China December 2012  –  January 2013  (2 months) Harbin, China •\tPerformed customer service and consultancy for corporate clients  \n•\tDealt with checks as daily routine work and double-checked bank acceptance bills  \n•\tUtilized internal system for daily business recording  \n•\tProvided full cooperation and timely assistance within the whole team Video Committee Head, King Edward VII Hall National University of Singapore August 2010  –  May 2011  (10 months) Singapore •\tLed a team of 25 members and organized weekly seminars for video editing \n•\tPromoted the rank of the team from 09/10 year’s medium committee to 10/11 year’s lower major committee  \n•\tInitiated a project and presented 7 videos by group members to 300 residents in hall Quantitative Analyst Intern Dhandho Holdings Corp June 2015  – Present (2 months) San Juan, Puerto Rico •\tImplement the investment strategy using R and Excel \n•\tBacktest and optimize financial products developed by Dhandho Holdings \n•\tUse Bloomberg and Capital IQ to search for company information of SP 500 constituents \n Quantitative Analyst Intern Dhandho Holdings Corp June 2015  – Present (2 months) San Juan, Puerto Rico •\tImplement the investment strategy using R and Excel \n•\tBacktest and optimize financial products developed by Dhandho Holdings \n•\tUse Bloomberg and Capital IQ to search for company information of SP 500 constituents \n Research Engineer National University of Singapore January 2014  –  October 2014  (10 months) Singapore •\tCollaborated on a project with Digital Storage Institute of Singapore on improving positioning accuracy of hard disk drive \n•\tConducted academic literature reviews and replicated paper findings on hard disk drive  \n•\tDeveloped MATLAB code, built model with Simulink and validated model through hands-on experiments on hard disk drive \n•\tAnalyzed simulation and experimental results to make appropriate design decisions \n•\tMentored an undergraduate student for the final year projec Research Engineer National University of Singapore January 2014  –  October 2014  (10 months) Singapore •\tCollaborated on a project with Digital Storage Institute of Singapore on improving positioning accuracy of hard disk drive \n•\tConducted academic literature reviews and replicated paper findings on hard disk drive  \n•\tDeveloped MATLAB code, built model with Simulink and validated model through hands-on experiments on hard disk drive \n•\tAnalyzed simulation and experimental results to make appropriate design decisions \n•\tMentored an undergraduate student for the final year projec Final Year Student National University of Singapore August 2012  –  May 2013  (10 months) Singapore Topic: Adaptive Control of Nonlinear Systems Using Multiple Models \n•\tAnalyzed mass in-sample and out-of-sample data and built auto-regressive models for simulations using MATLAB \n•\tDeveloped least squares algorithms, utilized MATLAB toolboxes and researched into latest findings for improvement of current methodologies Final Year Student National University of Singapore August 2012  –  May 2013  (10 months) Singapore Topic: Adaptive Control of Nonlinear Systems Using Multiple Models \n•\tAnalyzed mass in-sample and out-of-sample data and built auto-regressive models for simulations using MATLAB \n•\tDeveloped least squares algorithms, utilized MATLAB toolboxes and researched into latest findings for improvement of current methodologies Intern Industrial and Commercial Bank of China December 2012  –  January 2013  (2 months) Harbin, China •\tPerformed customer service and consultancy for corporate clients  \n•\tDealt with checks as daily routine work and double-checked bank acceptance bills  \n•\tUtilized internal system for daily business recording  \n•\tProvided full cooperation and timely assistance within the whole team Intern Industrial and Commercial Bank of China December 2012  –  January 2013  (2 months) Harbin, China •\tPerformed customer service and consultancy for corporate clients  \n•\tDealt with checks as daily routine work and double-checked bank acceptance bills  \n•\tUtilized internal system for daily business recording  \n•\tProvided full cooperation and timely assistance within the whole team Video Committee Head, King Edward VII Hall National University of Singapore August 2010  –  May 2011  (10 months) Singapore •\tLed a team of 25 members and organized weekly seminars for video editing \n•\tPromoted the rank of the team from 09/10 year’s medium committee to 10/11 year’s lower major committee  \n•\tInitiated a project and presented 7 videos by group members to 300 residents in hall Video Committee Head, King Edward VII Hall National University of Singapore August 2010  –  May 2011  (10 months) Singapore •\tLed a team of 25 members and organized weekly seminars for video editing \n•\tPromoted the rank of the team from 09/10 year’s medium committee to 10/11 year’s lower major committee  \n•\tInitiated a project and presented 7 videos by group members to 300 residents in hall Languages English Full professional proficiency Mandarin Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Mandarin Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Mandarin Native or bilingual proficiency German Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills 5 Matlab 3 R 2 Microsoft Word 2 Microsoft Excel 2 PowerPoint 3 C++ 6 C 2 Java 3 CFA level 2 candidate Skills  5 Matlab 3 R 2 Microsoft Word 2 Microsoft Excel 2 PowerPoint 3 C++ 6 C 2 Java 3 CFA level 2 candidate 5 Matlab 3 R 2 Microsoft Word 2 Microsoft Excel 2 PowerPoint 3 C++ 6 C 2 Java 3 CFA level 2 candidate 5 Matlab 3 R 2 Microsoft Word 2 Microsoft Excel 2 PowerPoint 3 C++ 6 C 2 Java 3 CFA level 2 candidate                   Education UCLA Anderson School of Management Master's Degree,  Financial Engineering 2014  – 2015 •\tCoursework taken: Fundamentals of Investments, Econometric, Macroeconomic, Financial Accounting, Stochastic Calculus, Empirical Methods in Finance, Derivatives, Corporate Finance \n•\tExpected coursework in Spring (before June 2015): Quantitative Asset Management, Computational Methods in Finance, Fixed Income, Financial Risk Management (Open) 1 project IAQF 2014 Case Competition Based on pension crisis\nDesigned hedging product for the defined benefits plan's pension risk, priced the product and identified the market for contra-side View National University of Singapore / NUS Bachelor's Degree,  Electrical Engineering 2009  – 2013 •\tDouble major in Mathematics \n•\tDean’s List for outstanding scholastic achievement for 1 semester \n•\tUndergraduate PRC scholarship by Ministry of Education of Singapore for 4 years Activities and Societies:  •\tNUS KE VII Hall Video Committee Head\n•\tNUS KE VII Hall Chinese Drama Member\n•\tNUS KE VII Hall Choir Member\n•\tNUS Chinese Student Society Chinese Orchestra Erhu Member Technische Universität Darmstadt Bachelor's Degree,  Electrical and Electronics Engineering 2012  – 2012 •\tStudent Exchange Program UCLA Anderson School of Management Master's Degree,  Financial Engineering 2014  – 2015 •\tCoursework taken: Fundamentals of Investments, Econometric, Macroeconomic, Financial Accounting, Stochastic Calculus, Empirical Methods in Finance, Derivatives, Corporate Finance \n•\tExpected coursework in Spring (before June 2015): Quantitative Asset Management, Computational Methods in Finance, Fixed Income, Financial Risk Management (Open) 1 project IAQF 2014 Case Competition Based on pension crisis\nDesigned hedging product for the defined benefits plan's pension risk, priced the product and identified the market for contra-side View UCLA Anderson School of Management Master's Degree,  Financial Engineering 2014  – 2015 •\tCoursework taken: Fundamentals of Investments, Econometric, Macroeconomic, Financial Accounting, Stochastic Calculus, Empirical Methods in Finance, Derivatives, Corporate Finance \n•\tExpected coursework in Spring (before June 2015): Quantitative Asset Management, Computational Methods in Finance, Fixed Income, Financial Risk Management (Open) 1 project IAQF 2014 Case Competition Based on pension crisis\nDesigned hedging product for the defined benefits plan's pension risk, priced the product and identified the market for contra-side View UCLA Anderson School of Management Master's Degree,  Financial Engineering 2014  – 2015 •\tCoursework taken: Fundamentals of Investments, Econometric, Macroeconomic, Financial Accounting, Stochastic Calculus, Empirical Methods in Finance, Derivatives, Corporate Finance \n•\tExpected coursework in Spring (before June 2015): Quantitative Asset Management, Computational Methods in Finance, Fixed Income, Financial Risk Management (Open) 1 project IAQF 2014 Case Competition Based on pension crisis\nDesigned hedging product for the defined benefits plan's pension risk, priced the product and identified the market for contra-side View National University of Singapore / NUS Bachelor's Degree,  Electrical Engineering 2009  – 2013 •\tDouble major in Mathematics \n•\tDean’s List for outstanding scholastic achievement for 1 semester \n•\tUndergraduate PRC scholarship by Ministry of Education of Singapore for 4 years Activities and Societies:  •\tNUS KE VII Hall Video Committee Head\n•\tNUS KE VII Hall Chinese Drama Member\n•\tNUS KE VII Hall Choir Member\n•\tNUS Chinese Student Society Chinese Orchestra Erhu Member National University of Singapore / NUS Bachelor's Degree,  Electrical Engineering 2009  – 2013 •\tDouble major in Mathematics \n•\tDean’s List for outstanding scholastic achievement for 1 semester \n•\tUndergraduate PRC scholarship by Ministry of Education of Singapore for 4 years Activities and Societies:  •\tNUS KE VII Hall Video Committee Head\n•\tNUS KE VII Hall Chinese Drama Member\n•\tNUS KE VII Hall Choir Member\n•\tNUS Chinese Student Society Chinese Orchestra Erhu Member National University of Singapore / NUS Bachelor's Degree,  Electrical Engineering 2009  – 2013 •\tDouble major in Mathematics \n•\tDean’s List for outstanding scholastic achievement for 1 semester \n•\tUndergraduate PRC scholarship by Ministry of Education of Singapore for 4 years Activities and Societies:  •\tNUS KE VII Hall Video Committee Head\n•\tNUS KE VII Hall Chinese Drama Member\n•\tNUS KE VII Hall Choir Member\n•\tNUS Chinese Student Society Chinese Orchestra Erhu Member Technische Universität Darmstadt Bachelor's Degree,  Electrical and Electronics Engineering 2012  – 2012 •\tStudent Exchange Program Technische Universität Darmstadt Bachelor's Degree,  Electrical and Electronics Engineering 2012  – 2012 •\tStudent Exchange Program Technische Universität Darmstadt Bachelor's Degree,  Electrical and Electronics Engineering 2012  – 2012 •\tStudent Exchange Program Honors & Awards ", "Experience Quantitative Analyst Intern Warwick Business School Quantitative Analyst Intern Warwick Business School Quantitative Analyst Intern Warwick Business School Skills Skills     ", "Experience Quantitative Analyst Intern Moody's Analytics June 2015  – Present (2 months) Greater New York City Area Analyst Tracxn! January 2014  –  April 2014  (4 months) Bengaluru Area, India ☛Conducted research and published reports on promising startups in various thriving sectors like Mobile Payments, SaaS, Healthcare Tech, AdTech, Enterprise Mobility \n☛Assisted technology team in developing tools and interface to enable Venture Capitalists and Business Development teams track and curate millions of companies globally Derivatives Trader Futures First July 2013  –  December 2013  (6 months) Hyderabad Area, India ☛Traded futures and spreads of soybeans in Chicago Mercantile Exchange using fundamental and technical analysis on an intra-day basis \n☛ Studied the momentum and price action in soybeans and other grain markets \n☛ Analyzed the impact of global economic events and data on the price movement of grains futures Summer Intern HSBC Asset Management May 2012  –  July 2012  (3 months) Hyderabad Area, India ☛Performance evaluation and analysis of HSBC mutual funds in Excel using various ratios and standard ratings. Developed learning material for the HSBC sales team in Hyderabad \n☛Analyzed the relationship between Sensex and various other indices using Regression and Correlation techniques in Excel Quantitative Analyst Intern Moody's Analytics June 2015  – Present (2 months) Greater New York City Area Quantitative Analyst Intern Moody's Analytics June 2015  – Present (2 months) Greater New York City Area Analyst Tracxn! January 2014  –  April 2014  (4 months) Bengaluru Area, India ☛Conducted research and published reports on promising startups in various thriving sectors like Mobile Payments, SaaS, Healthcare Tech, AdTech, Enterprise Mobility \n☛Assisted technology team in developing tools and interface to enable Venture Capitalists and Business Development teams track and curate millions of companies globally Analyst Tracxn! January 2014  –  April 2014  (4 months) Bengaluru Area, India ☛Conducted research and published reports on promising startups in various thriving sectors like Mobile Payments, SaaS, Healthcare Tech, AdTech, Enterprise Mobility \n☛Assisted technology team in developing tools and interface to enable Venture Capitalists and Business Development teams track and curate millions of companies globally Derivatives Trader Futures First July 2013  –  December 2013  (6 months) Hyderabad Area, India ☛Traded futures and spreads of soybeans in Chicago Mercantile Exchange using fundamental and technical analysis on an intra-day basis \n☛ Studied the momentum and price action in soybeans and other grain markets \n☛ Analyzed the impact of global economic events and data on the price movement of grains futures Derivatives Trader Futures First July 2013  –  December 2013  (6 months) Hyderabad Area, India ☛Traded futures and spreads of soybeans in Chicago Mercantile Exchange using fundamental and technical analysis on an intra-day basis \n☛ Studied the momentum and price action in soybeans and other grain markets \n☛ Analyzed the impact of global economic events and data on the price movement of grains futures Summer Intern HSBC Asset Management May 2012  –  July 2012  (3 months) Hyderabad Area, India ☛Performance evaluation and analysis of HSBC mutual funds in Excel using various ratios and standard ratings. Developed learning material for the HSBC sales team in Hyderabad \n☛Analyzed the relationship between Sensex and various other indices using Regression and Correlation techniques in Excel Summer Intern HSBC Asset Management May 2012  –  July 2012  (3 months) Hyderabad Area, India ☛Performance evaluation and analysis of HSBC mutual funds in Excel using various ratios and standard ratings. Developed learning material for the HSBC sales team in Hyderabad \n☛Analyzed the relationship between Sensex and various other indices using Regression and Correlation techniques in Excel Languages English Full professional proficiency Hindi Professional working proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Professional working proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Professional working proficiency Telugu Native or bilingual proficiency Full professional proficiency Professional working proficiency Native or bilingual proficiency Skills Top Skills 11 Matlab 0 R 0 SAS 5 Microsoft Excel 0 SQL 12 C 1 Python 9 C++ 7 HTML 5 PowerPoint Dinesh also knows about... 4 Microsoft Office 2 Financial Modeling 2 Photoshop 2 Derivatives 1 Mutual Funds 2 Microsoft Word 0 Dreamweaver 0 VBA 0 Statistics Skills  Top Skills 11 Matlab 0 R 0 SAS 5 Microsoft Excel 0 SQL 12 C 1 Python 9 C++ 7 HTML 5 PowerPoint Dinesh also knows about... 4 Microsoft Office 2 Financial Modeling 2 Photoshop 2 Derivatives 1 Mutual Funds 2 Microsoft Word 0 Dreamweaver 0 VBA 0 Statistics Top Skills 11 Matlab 0 R 0 SAS 5 Microsoft Excel 0 SQL 12 C 1 Python 9 C++ 7 HTML 5 PowerPoint Dinesh also knows about... 4 Microsoft Office 2 Financial Modeling 2 Photoshop 2 Derivatives 1 Mutual Funds 2 Microsoft Word 0 Dreamweaver 0 VBA 0 Statistics Top Skills 11 Matlab 0 R 0 SAS 5 Microsoft Excel 0 SQL 12 C 1 Python 9 C++ 7 HTML 5 PowerPoint Dinesh also knows about... 4 Microsoft Office 2 Financial Modeling 2 Photoshop 2 Derivatives 1 Mutual Funds 2 Microsoft Word 0 Dreamweaver 0 VBA 0 Statistics                     4 Microsoft Office 2 Financial Modeling 2 Photoshop 2 Derivatives 1 Mutual Funds 2 Microsoft Word 0 Dreamweaver 0 VBA 0 Statistics Education UCLA Anderson School of Management Master's degree,  Financial Engineering 2014  – 2015 (Open) 1 project Automated Topic Classification of News Articles • Built a news topic classifier with stochastic gradient boosting, bagging decision trees and SVM with 89% accuracy\n• Experimented with various text pre-processing techniques such as parts-of-speech tagging, noun extraction, bigrams, and stemming... View (Open) 6 courses EMPIRICAL METHODS IN FINANCE CORPORATE FINANCE AND RISK MANAGMENT STOCHASTIC CALCULUS DERIVATIVES MARKETS ECONOMETRICS FUNDAMENTALS OF INVESTMENTS See more Indian Institute of Technology, Kharagpur Bachelor of Technology (B.Tech.),  Mechanical Engineering 2009  – 2013 Activities and Societies:  Second Senate Member of HJB hall ,  Organizing team head of Mekanika (Open) 1 project Evaluation of Thermal comfort in classrooms Conducted a field study in classrooms of IIT Kharagpur to assess their thermal conditions during the students’ lesson hours. Objective data analysis was then used to check if those thermal conditions were falling within the comfort zone of ASHRAE... View (Open) 8 courses PROGRAMMING AND DATA STRUCTURES ENGLISH FOR COMMUNICATION ELECTRICAL TECHNOLOGY ECONOMICS THE ART OF COMMUNICATION APPLIED THERMO-FLUIDS PARTIAL DIFFERENTIAL EQUATIONS TRANSFORM CALCULUS See more UCLA Anderson School of Management Master's degree,  Financial Engineering 2014  – 2015 (Open) 1 project Automated Topic Classification of News Articles • Built a news topic classifier with stochastic gradient boosting, bagging decision trees and SVM with 89% accuracy\n• Experimented with various text pre-processing techniques such as parts-of-speech tagging, noun extraction, bigrams, and stemming... View (Open) 6 courses EMPIRICAL METHODS IN FINANCE CORPORATE FINANCE AND RISK MANAGMENT STOCHASTIC CALCULUS DERIVATIVES MARKETS ECONOMETRICS FUNDAMENTALS OF INVESTMENTS See more UCLA Anderson School of Management Master's degree,  Financial Engineering 2014  – 2015 (Open) 1 project Automated Topic Classification of News Articles • Built a news topic classifier with stochastic gradient boosting, bagging decision trees and SVM with 89% accuracy\n• Experimented with various text pre-processing techniques such as parts-of-speech tagging, noun extraction, bigrams, and stemming... View (Open) 6 courses EMPIRICAL METHODS IN FINANCE CORPORATE FINANCE AND RISK MANAGMENT STOCHASTIC CALCULUS DERIVATIVES MARKETS ECONOMETRICS FUNDAMENTALS OF INVESTMENTS See more UCLA Anderson School of Management Master's degree,  Financial Engineering 2014  – 2015 (Open) 1 project Automated Topic Classification of News Articles • Built a news topic classifier with stochastic gradient boosting, bagging decision trees and SVM with 89% accuracy\n• Experimented with various text pre-processing techniques such as parts-of-speech tagging, noun extraction, bigrams, and stemming... View (Open) 6 courses EMPIRICAL METHODS IN FINANCE CORPORATE FINANCE AND RISK MANAGMENT STOCHASTIC CALCULUS DERIVATIVES MARKETS ECONOMETRICS FUNDAMENTALS OF INVESTMENTS See more Indian Institute of Technology, Kharagpur Bachelor of Technology (B.Tech.),  Mechanical Engineering 2009  – 2013 Activities and Societies:  Second Senate Member of HJB hall ,  Organizing team head of Mekanika (Open) 1 project Evaluation of Thermal comfort in classrooms Conducted a field study in classrooms of IIT Kharagpur to assess their thermal conditions during the students’ lesson hours. Objective data analysis was then used to check if those thermal conditions were falling within the comfort zone of ASHRAE... View (Open) 8 courses PROGRAMMING AND DATA STRUCTURES ENGLISH FOR COMMUNICATION ELECTRICAL TECHNOLOGY ECONOMICS THE ART OF COMMUNICATION APPLIED THERMO-FLUIDS PARTIAL DIFFERENTIAL EQUATIONS TRANSFORM CALCULUS See more Indian Institute of Technology, Kharagpur Bachelor of Technology (B.Tech.),  Mechanical Engineering 2009  – 2013 Activities and Societies:  Second Senate Member of HJB hall ,  Organizing team head of Mekanika (Open) 1 project Evaluation of Thermal comfort in classrooms Conducted a field study in classrooms of IIT Kharagpur to assess their thermal conditions during the students’ lesson hours. Objective data analysis was then used to check if those thermal conditions were falling within the comfort zone of ASHRAE... View (Open) 8 courses PROGRAMMING AND DATA STRUCTURES ENGLISH FOR COMMUNICATION ELECTRICAL TECHNOLOGY ECONOMICS THE ART OF COMMUNICATION APPLIED THERMO-FLUIDS PARTIAL DIFFERENTIAL EQUATIONS TRANSFORM CALCULUS See more Indian Institute of Technology, Kharagpur Bachelor of Technology (B.Tech.),  Mechanical Engineering 2009  – 2013 Activities and Societies:  Second Senate Member of HJB hall ,  Organizing team head of Mekanika (Open) 1 project Evaluation of Thermal comfort in classrooms Conducted a field study in classrooms of IIT Kharagpur to assess their thermal conditions during the students’ lesson hours. Objective data analysis was then used to check if those thermal conditions were falling within the comfort zone of ASHRAE... View (Open) 8 courses PROGRAMMING AND DATA STRUCTURES ENGLISH FOR COMMUNICATION ELECTRICAL TECHNOLOGY ECONOMICS THE ART OF COMMUNICATION APPLIED THERMO-FLUIDS PARTIAL DIFFERENTIAL EQUATIONS TRANSFORM CALCULUS See more Honors & Awards Certificate of Merit National Standard Examination in Physics (NSEP) May 2008 Certificate of Merit National Standard Examination in Physics (NSEP) May 2008 Certificate of Merit National Standard Examination in Physics (NSEP) May 2008 Certificate of Merit National Standard Examination in Physics (NSEP) May 2008 ", "Experience Quantitative Analyst Intern Akuna Capital June 2015  – Present (2 months) Chicago Postdoctoral Associate University of Maryland March 2015  –  May 2015  (3 months) College Park, MD Research Assistant University of Maryland August 2008  –  May 2015  (6 years 10 months) College Park, MD Visiting Research Assistant Max Planck Institute for Astrophysics May 2008  –  June 2008  (2 months) Munich Area, Germany Visiting Research Assistant Max Planck Institute for Astrophysics May 2007  –  August 2007  (4 months) Munich Area, Germany Quantitative Analyst Intern Akuna Capital June 2015  – Present (2 months) Chicago Quantitative Analyst Intern Akuna Capital June 2015  – Present (2 months) Chicago Postdoctoral Associate University of Maryland March 2015  –  May 2015  (3 months) College Park, MD Postdoctoral Associate University of Maryland March 2015  –  May 2015  (3 months) College Park, MD Research Assistant University of Maryland August 2008  –  May 2015  (6 years 10 months) College Park, MD Research Assistant University of Maryland August 2008  –  May 2015  (6 years 10 months) College Park, MD Visiting Research Assistant Max Planck Institute for Astrophysics May 2008  –  June 2008  (2 months) Munich Area, Germany Visiting Research Assistant Max Planck Institute for Astrophysics May 2008  –  June 2008  (2 months) Munich Area, Germany Visiting Research Assistant Max Planck Institute for Astrophysics May 2007  –  August 2007  (4 months) Munich Area, Germany Visiting Research Assistant Max Planck Institute for Astrophysics May 2007  –  August 2007  (4 months) Munich Area, Germany Languages English Native or bilingual proficiency Marathi Native or bilingual proficiency Hindi Full professional proficiency English Native or bilingual proficiency Marathi Native or bilingual proficiency Hindi Full professional proficiency English Native or bilingual proficiency Marathi Native or bilingual proficiency Hindi Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Skills Top Skills 10 Scientific Computing 8 Mathematical Modeling 4 CUDA 14 LaTeX 10 Physics 7 Plasma Physics 8 Fortran 7 Mathematica 5 Linux 5 Numerical Simulation Anjor also knows about... 6 Numerical Analysis 7 Matlab 3 Unix Shell Scripting 3 Simulations 3 Turbulence Modeling 2 Astrophysics 1 Applied Mathematics 1 Algorithms 0 Python 0 NumPy 0 Matplotlib 0 SciPy 0 Data Analysis 0 Research 0 Programming Skills  Top Skills 10 Scientific Computing 8 Mathematical Modeling 4 CUDA 14 LaTeX 10 Physics 7 Plasma Physics 8 Fortran 7 Mathematica 5 Linux 5 Numerical Simulation Anjor also knows about... 6 Numerical Analysis 7 Matlab 3 Unix Shell Scripting 3 Simulations 3 Turbulence Modeling 2 Astrophysics 1 Applied Mathematics 1 Algorithms 0 Python 0 NumPy 0 Matplotlib 0 SciPy 0 Data Analysis 0 Research 0 Programming Top Skills 10 Scientific Computing 8 Mathematical Modeling 4 CUDA 14 LaTeX 10 Physics 7 Plasma Physics 8 Fortran 7 Mathematica 5 Linux 5 Numerical Simulation Anjor also knows about... 6 Numerical Analysis 7 Matlab 3 Unix Shell Scripting 3 Simulations 3 Turbulence Modeling 2 Astrophysics 1 Applied Mathematics 1 Algorithms 0 Python 0 NumPy 0 Matplotlib 0 SciPy 0 Data Analysis 0 Research 0 Programming Top Skills 10 Scientific Computing 8 Mathematical Modeling 4 CUDA 14 LaTeX 10 Physics 7 Plasma Physics 8 Fortran 7 Mathematica 5 Linux 5 Numerical Simulation Anjor also knows about... 6 Numerical Analysis 7 Matlab 3 Unix Shell Scripting 3 Simulations 3 Turbulence Modeling 2 Astrophysics 1 Applied Mathematics 1 Algorithms 0 Python 0 NumPy 0 Matplotlib 0 SciPy 0 Data Analysis 0 Research 0 Programming                     6 Numerical Analysis 7 Matlab 3 Unix Shell Scripting 3 Simulations 3 Turbulence Modeling 2 Astrophysics 1 Applied Mathematics 1 Algorithms 0 Python 0 NumPy 0 Matplotlib 0 SciPy 0 Data Analysis 0 Research 0 Programming Education University of Maryland College Park Doctor of Philosophy (PhD),  Plasma and High-Temperature Physics , 4.0/4.0 2008  – 2015 Activities and Societies:  American Physical Society Indian Institute of Technology, Bombay Master of Science (M.Sc.),  Physics , 8.85/10.0 2006  – 2008 Fergusson College Bachelor of Science (BSc),  Physics 2003  – 2006 Activities and Societies:  Cultural Society University of Maryland College Park Doctor of Philosophy (PhD),  Plasma and High-Temperature Physics , 4.0/4.0 2008  – 2015 Activities and Societies:  American Physical Society University of Maryland College Park Doctor of Philosophy (PhD),  Plasma and High-Temperature Physics , 4.0/4.0 2008  – 2015 Activities and Societies:  American Physical Society University of Maryland College Park Doctor of Philosophy (PhD),  Plasma and High-Temperature Physics , 4.0/4.0 2008  – 2015 Activities and Societies:  American Physical Society Indian Institute of Technology, Bombay Master of Science (M.Sc.),  Physics , 8.85/10.0 2006  – 2008 Indian Institute of Technology, Bombay Master of Science (M.Sc.),  Physics , 8.85/10.0 2006  – 2008 Indian Institute of Technology, Bombay Master of Science (M.Sc.),  Physics , 8.85/10.0 2006  – 2008 Fergusson College Bachelor of Science (BSc),  Physics 2003  – 2006 Activities and Societies:  Cultural Society Fergusson College Bachelor of Science (BSc),  Physics 2003  – 2006 Activities and Societies:  Cultural Society Fergusson College Bachelor of Science (BSc),  Physics 2003  – 2006 Activities and Societies:  Cultural Society ", "Experience Quantitative Analyst Intern Agilex Technologies May 2015  – Present (3 months) Marketing Intern aabalone[red] May 2014  –  August 2014  (4 months) Client Associate Merrill Lynch June 2013  –  August 2013  (3 months) Pharmaceutical Technician Hope Street Pharmacy March 2009  –  January 2013  (3 years 11 months) Quantitative Analyst Intern Agilex Technologies May 2015  – Present (3 months) Quantitative Analyst Intern Agilex Technologies May 2015  – Present (3 months) Marketing Intern aabalone[red] May 2014  –  August 2014  (4 months) Marketing Intern aabalone[red] May 2014  –  August 2014  (4 months) Client Associate Merrill Lynch June 2013  –  August 2013  (3 months) Client Associate Merrill Lynch June 2013  –  August 2013  (3 months) Pharmaceutical Technician Hope Street Pharmacy March 2009  –  January 2013  (3 years 11 months) Pharmaceutical Technician Hope Street Pharmacy March 2009  –  January 2013  (3 years 11 months) Skills Top Skills 3 Teamwork 2 Teaching 2 Analytical Skills 2 Critical Thinking 1 Data Analysis 1 Communication Skills 1 Public Health 1 Public Speaking 1 Team Leadership 1 Clinical Research Zachary also knows about... 1 Pharmaceutical Industry 1 Analysis 1 SPSS 1 Management 1 Event Planning 1 Data Management 1 Marketing 1 Sales Skills  Top Skills 3 Teamwork 2 Teaching 2 Analytical Skills 2 Critical Thinking 1 Data Analysis 1 Communication Skills 1 Public Health 1 Public Speaking 1 Team Leadership 1 Clinical Research Zachary also knows about... 1 Pharmaceutical Industry 1 Analysis 1 SPSS 1 Management 1 Event Planning 1 Data Management 1 Marketing 1 Sales Top Skills 3 Teamwork 2 Teaching 2 Analytical Skills 2 Critical Thinking 1 Data Analysis 1 Communication Skills 1 Public Health 1 Public Speaking 1 Team Leadership 1 Clinical Research Zachary also knows about... 1 Pharmaceutical Industry 1 Analysis 1 SPSS 1 Management 1 Event Planning 1 Data Management 1 Marketing 1 Sales Top Skills 3 Teamwork 2 Teaching 2 Analytical Skills 2 Critical Thinking 1 Data Analysis 1 Communication Skills 1 Public Health 1 Public Speaking 1 Team Leadership 1 Clinical Research Zachary also knows about... 1 Pharmaceutical Industry 1 Analysis 1 SPSS 1 Management 1 Event Planning 1 Data Management 1 Marketing 1 Sales                     1 Pharmaceutical Industry 1 Analysis 1 SPSS 1 Management 1 Event Planning 1 Data Management 1 Marketing 1 Sales Education The University of Connecticut Bachelor of Arts (BA),  Mathematics ,  Statistics ,  and Economics 2012  – 2016 The University of Connecticut Bachelor of Arts (BA),  Mathematics ,  Statistics ,  and Economics 2012  – 2016 The University of Connecticut Bachelor of Arts (BA),  Mathematics ,  Statistics ,  and Economics 2012  – 2016 The University of Connecticut Bachelor of Arts (BA),  Mathematics ,  Statistics ,  and Economics 2012  – 2016 ", "Summary This is a passionate person who sees with fundamental analysis and thinks with quantitative models.  \nCurrently actively seeking full-time positions in the field of asset management and quantitative analysis. \n \nSpecialties: \n• CFA Level I candidate \n• SAS Certified Base Programmer, proficient in R and Matlab \n• Cross-sectional/time series regression, Monte Carlo Simulation, data processing, back-testing \n• Financial analysis and consulting, asset management, economics modeling, due diligence reporting \n Summary This is a passionate person who sees with fundamental analysis and thinks with quantitative models.  \nCurrently actively seeking full-time positions in the field of asset management and quantitative analysis. \n \nSpecialties: \n• CFA Level I candidate \n• SAS Certified Base Programmer, proficient in R and Matlab \n• Cross-sectional/time series regression, Monte Carlo Simulation, data processing, back-testing \n• Financial analysis and consulting, asset management, economics modeling, due diligence reporting \n This is a passionate person who sees with fundamental analysis and thinks with quantitative models.  \nCurrently actively seeking full-time positions in the field of asset management and quantitative analysis. \n \nSpecialties: \n• CFA Level I candidate \n• SAS Certified Base Programmer, proficient in R and Matlab \n• Cross-sectional/time series regression, Monte Carlo Simulation, data processing, back-testing \n• Financial analysis and consulting, asset management, economics modeling, due diligence reporting \n This is a passionate person who sees with fundamental analysis and thinks with quantitative models.  \nCurrently actively seeking full-time positions in the field of asset management and quantitative analysis. \n \nSpecialties: \n• CFA Level I candidate \n• SAS Certified Base Programmer, proficient in R and Matlab \n• Cross-sectional/time series regression, Monte Carlo Simulation, data processing, back-testing \n• Financial analysis and consulting, asset management, economics modeling, due diligence reporting \n Experience Quantitative Analyst Intern Dhandho Holdings June 2015  – Present (2 months) - Implemented Dhandho Enhanced Index back-testing algorithm in R \n- Collected data from Bloomberg terminal and Excel Add-in \n- Wrote SQL query to pull data from Capital IQ Xpress feed Capital Financing Consultant Shenzhen Tactician Investment June 2014  –  September 2014  (4 months) •\tIdentified the problem leading to client’s financing need through communications and fundamental analysis  \n•\tDrafted customized financing solutions and mentored them in DCF modelling \n•\tAssisted clients in implementing projects and targeted cooperation among business in real estate Finance Summer Intern Stanley Black & Decker June 2013  –  September 2013  (4 months) Towson, Maryland •\tReported weekly manufacturing scorecards to director and analyzed unfav/favorability. \n•\tBudgeted with Hyperion and consolidated financial presentation in monthly and quarterly closing processes  \n•\tAssisted DTV Manager in executing optimal management with world plant managers through teleconferences \n•\tPromoted scorecard system to be user-friendly, efficient and comprehensive using Excel formula and Macro Finance Analyst Intern Hefei Innovation Financing Guarantee Co. June 2012  –  August 2012  (3 months) •\tScripted multivariable regression to identify the impact of new product on returns  \n•\tDrafted due diligence reports regarding financing amount, cost, structure and risk Quantitative Analyst Intern Dhandho Holdings June 2015  – Present (2 months) - Implemented Dhandho Enhanced Index back-testing algorithm in R \n- Collected data from Bloomberg terminal and Excel Add-in \n- Wrote SQL query to pull data from Capital IQ Xpress feed Quantitative Analyst Intern Dhandho Holdings June 2015  – Present (2 months) - Implemented Dhandho Enhanced Index back-testing algorithm in R \n- Collected data from Bloomberg terminal and Excel Add-in \n- Wrote SQL query to pull data from Capital IQ Xpress feed Capital Financing Consultant Shenzhen Tactician Investment June 2014  –  September 2014  (4 months) •\tIdentified the problem leading to client’s financing need through communications and fundamental analysis  \n•\tDrafted customized financing solutions and mentored them in DCF modelling \n•\tAssisted clients in implementing projects and targeted cooperation among business in real estate Capital Financing Consultant Shenzhen Tactician Investment June 2014  –  September 2014  (4 months) •\tIdentified the problem leading to client’s financing need through communications and fundamental analysis  \n•\tDrafted customized financing solutions and mentored them in DCF modelling \n•\tAssisted clients in implementing projects and targeted cooperation among business in real estate Finance Summer Intern Stanley Black & Decker June 2013  –  September 2013  (4 months) Towson, Maryland •\tReported weekly manufacturing scorecards to director and analyzed unfav/favorability. \n•\tBudgeted with Hyperion and consolidated financial presentation in monthly and quarterly closing processes  \n•\tAssisted DTV Manager in executing optimal management with world plant managers through teleconferences \n•\tPromoted scorecard system to be user-friendly, efficient and comprehensive using Excel formula and Macro Finance Summer Intern Stanley Black & Decker June 2013  –  September 2013  (4 months) Towson, Maryland •\tReported weekly manufacturing scorecards to director and analyzed unfav/favorability. \n•\tBudgeted with Hyperion and consolidated financial presentation in monthly and quarterly closing processes  \n•\tAssisted DTV Manager in executing optimal management with world plant managers through teleconferences \n•\tPromoted scorecard system to be user-friendly, efficient and comprehensive using Excel formula and Macro Finance Analyst Intern Hefei Innovation Financing Guarantee Co. June 2012  –  August 2012  (3 months) •\tScripted multivariable regression to identify the impact of new product on returns  \n•\tDrafted due diligence reports regarding financing amount, cost, structure and risk Finance Analyst Intern Hefei Innovation Financing Guarantee Co. June 2012  –  August 2012  (3 months) •\tScripted multivariable regression to identify the impact of new product on returns  \n•\tDrafted due diligence reports regarding financing amount, cost, structure and risk Languages English Full professional proficiency Mandarin Native or bilingual proficiency English Full professional proficiency Mandarin Native or bilingual proficiency English Full professional proficiency Mandarin Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills 6 Microsoft Excel 7 Financial Analysis 5 C++ 6 Matlab 4 Stata 3 Portfolio Management 6 R 3 SAS 2 Leadership Skills  6 Microsoft Excel 7 Financial Analysis 5 C++ 6 Matlab 4 Stata 3 Portfolio Management 6 R 3 SAS 2 Leadership 6 Microsoft Excel 7 Financial Analysis 5 C++ 6 Matlab 4 Stata 3 Portfolio Management 6 R 3 SAS 2 Leadership 6 Microsoft Excel 7 Financial Analysis 5 C++ 6 Matlab 4 Stata 3 Portfolio Management 6 R 3 SAS 2 Leadership                   Education UCLA Anderson School of Management Master's Degree,  Finance and Financial Management Services , 3.825 2014  – 2015 Activities and Societies:  IAQF Case Competition -- construct risk hedging product for pension fund (Open) 2 projects Exotic Options Pricing (MATLAB) •\tPriced own-and-out put option by Monte-Carlo simulation and European & American Options using Black-Scholes.\n•\tImplement... View Back-test VaR with EGARCH and EWMA Volatility Models - Simulated ten thousand 500 daily returns paths using EGARCH model.\n- Estimated daily VaR based on last 250 day rolling... View (Open) 5 courses Empirical Methods in Finance Derivative Markets Fundamentals of Corporate Finance and Risk Management Stochastic Calculus and Derivatives Financial Risk Measurement and Management See more University of Michigan Bachelor's Degree,  Financial Mathematics&Economics , 3.74 •\tJames B Angell Scholarship \n•\tUniversity Honors (Open) 1 project Portfolio Management Project -\tAdjusted indexes on FACTSET to forecast returns using quant screening, valuation and catalytic analysis\n-\tConducted back-testing, portfolio monitoring and tracking active risks compared to benchmark risks\n-\tManaged multi-strategy virtual... View (Open) 4 courses Quant/Value Portfolio Management Seminar in Applied Microeconomics Modeling Programming and Data Structure in C++ Numerical Methods See more UCLA Anderson School of Management Master's Degree,  Finance and Financial Management Services , 3.825 2014  – 2015 Activities and Societies:  IAQF Case Competition -- construct risk hedging product for pension fund (Open) 2 projects Exotic Options Pricing (MATLAB) •\tPriced own-and-out put option by Monte-Carlo simulation and European & American Options using Black-Scholes.\n•\tImplement... View Back-test VaR with EGARCH and EWMA Volatility Models - Simulated ten thousand 500 daily returns paths using EGARCH model.\n- Estimated daily VaR based on last 250 day rolling... View (Open) 5 courses Empirical Methods in Finance Derivative Markets Fundamentals of Corporate Finance and Risk Management Stochastic Calculus and Derivatives Financial Risk Measurement and Management See more UCLA Anderson School of Management Master's Degree,  Finance and Financial Management Services , 3.825 2014  – 2015 Activities and Societies:  IAQF Case Competition -- construct risk hedging product for pension fund (Open) 2 projects Exotic Options Pricing (MATLAB) •\tPriced own-and-out put option by Monte-Carlo simulation and European & American Options using Black-Scholes.\n•\tImplement... View Back-test VaR with EGARCH and EWMA Volatility Models - Simulated ten thousand 500 daily returns paths using EGARCH model.\n- Estimated daily VaR based on last 250 day rolling... View (Open) 5 courses Empirical Methods in Finance Derivative Markets Fundamentals of Corporate Finance and Risk Management Stochastic Calculus and Derivatives Financial Risk Measurement and Management See more UCLA Anderson School of Management Master's Degree,  Finance and Financial Management Services , 3.825 2014  – 2015 Activities and Societies:  IAQF Case Competition -- construct risk hedging product for pension fund (Open) 2 projects Exotic Options Pricing (MATLAB) •\tPriced own-and-out put option by Monte-Carlo simulation and European & American Options using Black-Scholes.\n•\tImplement... View Back-test VaR with EGARCH and EWMA Volatility Models - Simulated ten thousand 500 daily returns paths using EGARCH model.\n- Estimated daily VaR based on last 250 day rolling... View (Open) 5 courses Empirical Methods in Finance Derivative Markets Fundamentals of Corporate Finance and Risk Management Stochastic Calculus and Derivatives Financial Risk Measurement and Management See more University of Michigan Bachelor's Degree,  Financial Mathematics&Economics , 3.74 •\tJames B Angell Scholarship \n•\tUniversity Honors (Open) 1 project Portfolio Management Project -\tAdjusted indexes on FACTSET to forecast returns using quant screening, valuation and catalytic analysis\n-\tConducted back-testing, portfolio monitoring and tracking active risks compared to benchmark risks\n-\tManaged multi-strategy virtual... View (Open) 4 courses Quant/Value Portfolio Management Seminar in Applied Microeconomics Modeling Programming and Data Structure in C++ Numerical Methods See more University of Michigan Bachelor's Degree,  Financial Mathematics&Economics , 3.74 •\tJames B Angell Scholarship \n•\tUniversity Honors (Open) 1 project Portfolio Management Project -\tAdjusted indexes on FACTSET to forecast returns using quant screening, valuation and catalytic analysis\n-\tConducted back-testing, portfolio monitoring and tracking active risks compared to benchmark risks\n-\tManaged multi-strategy virtual... View (Open) 4 courses Quant/Value Portfolio Management Seminar in Applied Microeconomics Modeling Programming and Data Structure in C++ Numerical Methods See more University of Michigan Bachelor's Degree,  Financial Mathematics&Economics , 3.74 •\tJames B Angell Scholarship \n•\tUniversity Honors (Open) 1 project Portfolio Management Project -\tAdjusted indexes on FACTSET to forecast returns using quant screening, valuation and catalytic analysis\n-\tConducted back-testing, portfolio monitoring and tracking active risks compared to benchmark risks\n-\tManaged multi-strategy virtual... View (Open) 4 courses Quant/Value Portfolio Management Seminar in Applied Microeconomics Modeling Programming and Data Structure in C++ Numerical Methods See more Honors & Awards ", "Summary Recently graduated from University of Washington, MS in Computational Finance and Risk Management Program. \n \nInterested in job opportunities related to Quantitative Analysis, Portfolio Management, Risk Management, and Market Research. \n \n• Programming skill set: MATLAB, R, VBA, C++, SQL \n• Construct statistics models and perform various quantitative analysis \n• Extensive communication and leadership experience \n• Work well independently, in team projects as well as across different disciplines  \n• Detail-oriented, motivated self-starter,quick learner with strong problem solving skills Summary Recently graduated from University of Washington, MS in Computational Finance and Risk Management Program. \n \nInterested in job opportunities related to Quantitative Analysis, Portfolio Management, Risk Management, and Market Research. \n \n• Programming skill set: MATLAB, R, VBA, C++, SQL \n• Construct statistics models and perform various quantitative analysis \n• Extensive communication and leadership experience \n• Work well independently, in team projects as well as across different disciplines  \n• Detail-oriented, motivated self-starter,quick learner with strong problem solving skills Recently graduated from University of Washington, MS in Computational Finance and Risk Management Program. \n \nInterested in job opportunities related to Quantitative Analysis, Portfolio Management, Risk Management, and Market Research. \n \n• Programming skill set: MATLAB, R, VBA, C++, SQL \n• Construct statistics models and perform various quantitative analysis \n• Extensive communication and leadership experience \n• Work well independently, in team projects as well as across different disciplines  \n• Detail-oriented, motivated self-starter,quick learner with strong problem solving skills Recently graduated from University of Washington, MS in Computational Finance and Risk Management Program. \n \nInterested in job opportunities related to Quantitative Analysis, Portfolio Management, Risk Management, and Market Research. \n \n• Programming skill set: MATLAB, R, VBA, C++, SQL \n• Construct statistics models and perform various quantitative analysis \n• Extensive communication and leadership experience \n• Work well independently, in team projects as well as across different disciplines  \n• Detail-oriented, motivated self-starter,quick learner with strong problem solving skills Experience Quantitative Analyst Intern Franklin Templeton Investments, Multi-Asset Solutions June 2013  – Present (2 years 2 months) New York • Building Alpha models to evaluate portfolio performance in a regular basis \n• Developing Database for financial data (Index, Fundamental, Economic, Proprietary Indexes..) from various data sources \n• Assisting in quantitive projects, such as cross-asset research, capital market expectation modeling and Scenario analysis Vice President National Tsing Hua University Quantitative Finance Student Association May 2010  –  June 2011  (1 year 2 months) Taiwan •Representative Quantitative Finance Department to communicate with School representatives. \n•Held Quant seminars multiple times, and \"Department EXPO”, which involved introducing Department of Quantitative Finance to other universities and high school students. President International Volunteer Team-Ghana, Africa December 2009  –  August 2010  (9 months) Ghana, Africa •Represented International Volunteer team to collaborate and communicate with NGO in Africa \n• Led team to implement the programs, including IT training sessions, Bike Project, Digital Archive  \nProject and Orphanage Caring Project in Ghana \n•As team representative, reported achievements to the press and government organizations, including  \nTaiwan Ministry of Education and National Youth Commission Quantitative Analyst Intern Franklin Templeton Investments, Multi-Asset Solutions June 2013  – Present (2 years 2 months) New York • Building Alpha models to evaluate portfolio performance in a regular basis \n• Developing Database for financial data (Index, Fundamental, Economic, Proprietary Indexes..) from various data sources \n• Assisting in quantitive projects, such as cross-asset research, capital market expectation modeling and Scenario analysis Quantitative Analyst Intern Franklin Templeton Investments, Multi-Asset Solutions June 2013  – Present (2 years 2 months) New York • Building Alpha models to evaluate portfolio performance in a regular basis \n• Developing Database for financial data (Index, Fundamental, Economic, Proprietary Indexes..) from various data sources \n• Assisting in quantitive projects, such as cross-asset research, capital market expectation modeling and Scenario analysis Vice President National Tsing Hua University Quantitative Finance Student Association May 2010  –  June 2011  (1 year 2 months) Taiwan •Representative Quantitative Finance Department to communicate with School representatives. \n•Held Quant seminars multiple times, and \"Department EXPO”, which involved introducing Department of Quantitative Finance to other universities and high school students. Vice President National Tsing Hua University Quantitative Finance Student Association May 2010  –  June 2011  (1 year 2 months) Taiwan •Representative Quantitative Finance Department to communicate with School representatives. \n•Held Quant seminars multiple times, and \"Department EXPO”, which involved introducing Department of Quantitative Finance to other universities and high school students. President International Volunteer Team-Ghana, Africa December 2009  –  August 2010  (9 months) Ghana, Africa •Represented International Volunteer team to collaborate and communicate with NGO in Africa \n• Led team to implement the programs, including IT training sessions, Bike Project, Digital Archive  \nProject and Orphanage Caring Project in Ghana \n•As team representative, reported achievements to the press and government organizations, including  \nTaiwan Ministry of Education and National Youth Commission President International Volunteer Team-Ghana, Africa December 2009  –  August 2010  (9 months) Ghana, Africa •Represented International Volunteer team to collaborate and communicate with NGO in Africa \n• Led team to implement the programs, including IT training sessions, Bike Project, Digital Archive  \nProject and Orphanage Caring Project in Ghana \n•As team representative, reported achievements to the press and government organizations, including  \nTaiwan Ministry of Education and National Youth Commission Languages English Full professional proficiency Chinese (Mandarin) Native or bilingual proficiency Taiwanese Native or bilingual proficiency Japanese Elementary proficiency English Full professional proficiency Chinese (Mandarin) Native or bilingual proficiency Taiwanese Native or bilingual proficiency Japanese Elementary proficiency English Full professional proficiency Chinese (Mandarin) Native or bilingual proficiency Taiwanese Native or bilingual proficiency Japanese Elementary proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Top Skills 12 R 11 Matlab 8 Microsoft Office 7 Quantitative Finance 6 VBA 6 Teamwork 5 C++ 4 Quantitative Analytics 3 Microsoft Excel 3 PowerPoint Zoe also knows about... 3 Statistics 3 Risk Management 2 Microsoft Word 2 SQL 2 Financial Modeling 1 VAR 1 Portfolio Management 1 Options 1 Analysis 1 Mathematica 0 Bloomberg Skills  Top Skills 12 R 11 Matlab 8 Microsoft Office 7 Quantitative Finance 6 VBA 6 Teamwork 5 C++ 4 Quantitative Analytics 3 Microsoft Excel 3 PowerPoint Zoe also knows about... 3 Statistics 3 Risk Management 2 Microsoft Word 2 SQL 2 Financial Modeling 1 VAR 1 Portfolio Management 1 Options 1 Analysis 1 Mathematica 0 Bloomberg Top Skills 12 R 11 Matlab 8 Microsoft Office 7 Quantitative Finance 6 VBA 6 Teamwork 5 C++ 4 Quantitative Analytics 3 Microsoft Excel 3 PowerPoint Zoe also knows about... 3 Statistics 3 Risk Management 2 Microsoft Word 2 SQL 2 Financial Modeling 1 VAR 1 Portfolio Management 1 Options 1 Analysis 1 Mathematica 0 Bloomberg Top Skills 12 R 11 Matlab 8 Microsoft Office 7 Quantitative Finance 6 VBA 6 Teamwork 5 C++ 4 Quantitative Analytics 3 Microsoft Excel 3 PowerPoint Zoe also knows about... 3 Statistics 3 Risk Management 2 Microsoft Word 2 SQL 2 Financial Modeling 1 VAR 1 Portfolio Management 1 Options 1 Analysis 1 Mathematica 0 Bloomberg                     3 Statistics 3 Risk Management 2 Microsoft Word 2 SQL 2 Financial Modeling 1 VAR 1 Portfolio Management 1 Options 1 Analysis 1 Mathematica 0 Bloomberg Education University of Washington Master of Science (MS),  Computational Finance and Risk Management 2012  – 2013 (Open) 2 projects Portfolio Performance Evaluation -Analyzed different section of market data with rolling window method based on CER model\n-Estimated VaR value, bootstrapped... View Fama/French Model Validation -Modified Fama/French Model by adding selected market variables\n-Used statistical indexes to perform model selection with... View (Open) 7 courses Foundations of Trading Systems Fixed Income Analytics Introduction of Computational Finance and Risk Management Investment Science Options & Derivatives Financial Data Modeling and Analysis in R Intro to Financial Risk Management See more National Tsing Hua University BS,  Quantitative Finance , 3.7/4.0 2008  – 2012 (Open) 1 project Stock viewer interface building - Used C++ to construct interface showing stock movement along with technical analysis tools, such as stochastic oscillator and moving average indicators\n View University of Washington Master of Science (MS),  Computational Finance and Risk Management 2012  – 2013 (Open) 2 projects Portfolio Performance Evaluation -Analyzed different section of market data with rolling window method based on CER model\n-Estimated VaR value, bootstrapped... View Fama/French Model Validation -Modified Fama/French Model by adding selected market variables\n-Used statistical indexes to perform model selection with... View (Open) 7 courses Foundations of Trading Systems Fixed Income Analytics Introduction of Computational Finance and Risk Management Investment Science Options & Derivatives Financial Data Modeling and Analysis in R Intro to Financial Risk Management See more University of Washington Master of Science (MS),  Computational Finance and Risk Management 2012  – 2013 (Open) 2 projects Portfolio Performance Evaluation -Analyzed different section of market data with rolling window method based on CER model\n-Estimated VaR value, bootstrapped... View Fama/French Model Validation -Modified Fama/French Model by adding selected market variables\n-Used statistical indexes to perform model selection with... View (Open) 7 courses Foundations of Trading Systems Fixed Income Analytics Introduction of Computational Finance and Risk Management Investment Science Options & Derivatives Financial Data Modeling and Analysis in R Intro to Financial Risk Management See more University of Washington Master of Science (MS),  Computational Finance and Risk Management 2012  – 2013 (Open) 2 projects Portfolio Performance Evaluation -Analyzed different section of market data with rolling window method based on CER model\n-Estimated VaR value, bootstrapped... View Fama/French Model Validation -Modified Fama/French Model by adding selected market variables\n-Used statistical indexes to perform model selection with... View (Open) 7 courses Foundations of Trading Systems Fixed Income Analytics Introduction of Computational Finance and Risk Management Investment Science Options & Derivatives Financial Data Modeling and Analysis in R Intro to Financial Risk Management See more National Tsing Hua University BS,  Quantitative Finance , 3.7/4.0 2008  – 2012 (Open) 1 project Stock viewer interface building - Used C++ to construct interface showing stock movement along with technical analysis tools, such as stochastic oscillator and moving average indicators\n View National Tsing Hua University BS,  Quantitative Finance , 3.7/4.0 2008  – 2012 (Open) 1 project Stock viewer interface building - Used C++ to construct interface showing stock movement along with technical analysis tools, such as stochastic oscillator and moving average indicators\n View National Tsing Hua University BS,  Quantitative Finance , 3.7/4.0 2008  – 2012 (Open) 1 project Stock viewer interface building - Used C++ to construct interface showing stock movement along with technical analysis tools, such as stochastic oscillator and moving average indicators\n View ", "Experience Quantitative Analyst Intern Xcel Energy Quantitative Analyst Intern Xcel Energy Quantitative Analyst Intern Xcel Energy Skills Skills     Education Colorado School of Mines B.S.,  Economics 2008  – 2011 Colorado School of Mines B.S.,  Economics 2008  – 2011 Colorado School of Mines B.S.,  Economics 2008  – 2011 Colorado School of Mines B.S.,  Economics 2008  – 2011 ", "Summary I am currently undertaking a six month internship as a Quantitative Analyst with Barclay's Investment Bank working in Trading Book Risk/Market Risk. This is a break in my studies in which I am a third year PhD student in the School of Mathematics, University of Manchester focusing in the area of optimal liquidation in limit order books, aiming to submit within the first few months of the 2016 I hold a BSc in Financial Mathematics from the University of Limerick and a MPhil in Mathematical Sciences from the University of Manchester. I have a keen interest in financial markets and am an active trader in the FX & Equities market. Upon completion of my PhD, I plan on pursuing a career in the financial industry in a Quant/Strat related role. Summary I am currently undertaking a six month internship as a Quantitative Analyst with Barclay's Investment Bank working in Trading Book Risk/Market Risk. This is a break in my studies in which I am a third year PhD student in the School of Mathematics, University of Manchester focusing in the area of optimal liquidation in limit order books, aiming to submit within the first few months of the 2016 I hold a BSc in Financial Mathematics from the University of Limerick and a MPhil in Mathematical Sciences from the University of Manchester. I have a keen interest in financial markets and am an active trader in the FX & Equities market. Upon completion of my PhD, I plan on pursuing a career in the financial industry in a Quant/Strat related role. I am currently undertaking a six month internship as a Quantitative Analyst with Barclay's Investment Bank working in Trading Book Risk/Market Risk. This is a break in my studies in which I am a third year PhD student in the School of Mathematics, University of Manchester focusing in the area of optimal liquidation in limit order books, aiming to submit within the first few months of the 2016 I hold a BSc in Financial Mathematics from the University of Limerick and a MPhil in Mathematical Sciences from the University of Manchester. I have a keen interest in financial markets and am an active trader in the FX & Equities market. Upon completion of my PhD, I plan on pursuing a career in the financial industry in a Quant/Strat related role. I am currently undertaking a six month internship as a Quantitative Analyst with Barclay's Investment Bank working in Trading Book Risk/Market Risk. This is a break in my studies in which I am a third year PhD student in the School of Mathematics, University of Manchester focusing in the area of optimal liquidation in limit order books, aiming to submit within the first few months of the 2016 I hold a BSc in Financial Mathematics from the University of Limerick and a MPhil in Mathematical Sciences from the University of Manchester. I have a keen interest in financial markets and am an active trader in the FX & Equities market. Upon completion of my PhD, I plan on pursuing a career in the financial industry in a Quant/Strat related role. Experience Quantitative Analyst Intern Barclays Investment Bank June 2015  – Present (2 months) London, United Kingdom PhD Researcher in Applied Mathematics/Quantitative Finance University of Manchester January 2013  – Present (2 years 7 months) I am under the supervision of Prof. Peter Duck and Dr Paul Johnson in the Mathematical Modelling in Finance and Economics Group. The area I am studying is optimal trading strategies in limit order books. For this topic I study stochastic optimal control problems which lead to non-linear partial differential equations which must be solved numerically. (Open) 1 honor or award University of Manchester Research Scholar Award View Active Member Manchester University Trading & Investment Society September 2013  – Present (1 year 11 months) Manchester, United Kingdom Participating in FX and Equities fund group in which both trades with simulated and live trading accounts. Present trade ideas for currencies, indices and individual assets via presentations and written reports. Developed and back tested algorithmic trading strategies implemented in Metatrader 4 trading platform. (Open) 1 honor or award 1st place in Amplify Trading Manchester day-trading competition View Graduate Teaching Assistant University of Manchester September 2011  – Present (3 years 11 months) Manchester, United Kingdom Provided support to 1st year undergraduate students for (MATLAB based) Mathematical Workshop. \nDemonstration to 1st year undergraduate students, encouraging audience participation and ensuring understanding at each step. \nTaught mathematics service courses to non-mathematics students highlighting my ability to communicate mathematical ideas to a non-specialised audience. Transfer Agent RBC Investor Services January 2010  –  August 2010  (8 months) Luxembourg This eight month internship was completed as part of my bachelor degree. I was part of a 6 person multi-lingual team which managed a portfolio of accounts and funds. Day-to-day work included inputting orders for institutional and private investors, creating new accounts for clients, making reports to fund managers and promoters based on daily, weekly and monthly trading activity. Quantitative Analyst Intern Barclays Investment Bank June 2015  – Present (2 months) London, United Kingdom Quantitative Analyst Intern Barclays Investment Bank June 2015  – Present (2 months) London, United Kingdom PhD Researcher in Applied Mathematics/Quantitative Finance University of Manchester January 2013  – Present (2 years 7 months) I am under the supervision of Prof. Peter Duck and Dr Paul Johnson in the Mathematical Modelling in Finance and Economics Group. The area I am studying is optimal trading strategies in limit order books. For this topic I study stochastic optimal control problems which lead to non-linear partial differential equations which must be solved numerically. (Open) 1 honor or award University of Manchester Research Scholar Award View PhD Researcher in Applied Mathematics/Quantitative Finance University of Manchester January 2013  – Present (2 years 7 months) I am under the supervision of Prof. Peter Duck and Dr Paul Johnson in the Mathematical Modelling in Finance and Economics Group. The area I am studying is optimal trading strategies in limit order books. For this topic I study stochastic optimal control problems which lead to non-linear partial differential equations which must be solved numerically. (Open) 1 honor or award University of Manchester Research Scholar Award View Active Member Manchester University Trading & Investment Society September 2013  – Present (1 year 11 months) Manchester, United Kingdom Participating in FX and Equities fund group in which both trades with simulated and live trading accounts. Present trade ideas for currencies, indices and individual assets via presentations and written reports. Developed and back tested algorithmic trading strategies implemented in Metatrader 4 trading platform. (Open) 1 honor or award 1st place in Amplify Trading Manchester day-trading competition View Active Member Manchester University Trading & Investment Society September 2013  – Present (1 year 11 months) Manchester, United Kingdom Participating in FX and Equities fund group in which both trades with simulated and live trading accounts. Present trade ideas for currencies, indices and individual assets via presentations and written reports. Developed and back tested algorithmic trading strategies implemented in Metatrader 4 trading platform. (Open) 1 honor or award 1st place in Amplify Trading Manchester day-trading competition View Graduate Teaching Assistant University of Manchester September 2011  – Present (3 years 11 months) Manchester, United Kingdom Provided support to 1st year undergraduate students for (MATLAB based) Mathematical Workshop. \nDemonstration to 1st year undergraduate students, encouraging audience participation and ensuring understanding at each step. \nTaught mathematics service courses to non-mathematics students highlighting my ability to communicate mathematical ideas to a non-specialised audience. Graduate Teaching Assistant University of Manchester September 2011  – Present (3 years 11 months) Manchester, United Kingdom Provided support to 1st year undergraduate students for (MATLAB based) Mathematical Workshop. \nDemonstration to 1st year undergraduate students, encouraging audience participation and ensuring understanding at each step. \nTaught mathematics service courses to non-mathematics students highlighting my ability to communicate mathematical ideas to a non-specialised audience. Transfer Agent RBC Investor Services January 2010  –  August 2010  (8 months) Luxembourg This eight month internship was completed as part of my bachelor degree. I was part of a 6 person multi-lingual team which managed a portfolio of accounts and funds. Day-to-day work included inputting orders for institutional and private investors, creating new accounts for clients, making reports to fund managers and promoters based on daily, weekly and monthly trading activity. Transfer Agent RBC Investor Services January 2010  –  August 2010  (8 months) Luxembourg This eight month internship was completed as part of my bachelor degree. I was part of a 6 person multi-lingual team which managed a portfolio of accounts and funds. Day-to-day work included inputting orders for institutional and private investors, creating new accounts for clients, making reports to fund managers and promoters based on daily, weekly and monthly trading activity. Languages French Irish French Irish French Irish Skills Top Skills 11 Quantitative Finance 4 Stochastic Calculus 11 Matlab 1 Financial Modeling 7 Derivatives 5 Numerical Analysis 5 C++ 0 Option Pricing Models 0 Stochastic Modeling 0 FX trading James also knows about... 3 Statistics 1 Quantitative Analytics 1 Bloomberg 2 R 1 Computational Finance 0 Pricing Optimization 0 Technical Analysis 0 Fundamental Analysis 0 Financial Risk... 0 LaTeX 1 Monte Carlo Simulation 0 Applied Mathematics 1 Time Series Analysis 1 Options 1 Scientific Computing 0 Partial Differential... 0 Probability Theory 0 Statistical Modeling See 3+     See less Skills  Top Skills 11 Quantitative Finance 4 Stochastic Calculus 11 Matlab 1 Financial Modeling 7 Derivatives 5 Numerical Analysis 5 C++ 0 Option Pricing Models 0 Stochastic Modeling 0 FX trading James also knows about... 3 Statistics 1 Quantitative Analytics 1 Bloomberg 2 R 1 Computational Finance 0 Pricing Optimization 0 Technical Analysis 0 Fundamental Analysis 0 Financial Risk... 0 LaTeX 1 Monte Carlo Simulation 0 Applied Mathematics 1 Time Series Analysis 1 Options 1 Scientific Computing 0 Partial Differential... 0 Probability Theory 0 Statistical Modeling See 3+     See less Top Skills 11 Quantitative Finance 4 Stochastic Calculus 11 Matlab 1 Financial Modeling 7 Derivatives 5 Numerical Analysis 5 C++ 0 Option Pricing Models 0 Stochastic Modeling 0 FX trading James also knows about... 3 Statistics 1 Quantitative Analytics 1 Bloomberg 2 R 1 Computational Finance 0 Pricing Optimization 0 Technical Analysis 0 Fundamental Analysis 0 Financial Risk... 0 LaTeX 1 Monte Carlo Simulation 0 Applied Mathematics 1 Time Series Analysis 1 Options 1 Scientific Computing 0 Partial Differential... 0 Probability Theory 0 Statistical Modeling See 3+     See less Top Skills 11 Quantitative Finance 4 Stochastic Calculus 11 Matlab 1 Financial Modeling 7 Derivatives 5 Numerical Analysis 5 C++ 0 Option Pricing Models 0 Stochastic Modeling 0 FX trading James also knows about... 3 Statistics 1 Quantitative Analytics 1 Bloomberg 2 R 1 Computational Finance 0 Pricing Optimization 0 Technical Analysis 0 Fundamental Analysis 0 Financial Risk... 0 LaTeX 1 Monte Carlo Simulation 0 Applied Mathematics 1 Time Series Analysis 1 Options 1 Scientific Computing 0 Partial Differential... 0 Probability Theory 0 Statistical Modeling See 3+     See less                     3 Statistics 1 Quantitative Analytics 1 Bloomberg 2 R 1 Computational Finance 0 Pricing Optimization 0 Technical Analysis 0 Fundamental Analysis 0 Financial Risk... 0 LaTeX 1 Monte Carlo Simulation 0 Applied Mathematics 1 Time Series Analysis 1 Options 1 Scientific Computing 0 Partial Differential... 0 Probability Theory 0 Statistical Modeling Education The University of Manchester Doctor of Philosophy (Ph.D.),  Applied Mathematics/Quantitative Finance 2013  – 2016 I am under the supervision of Prof. Peter Duck and Dr Paul Johnson in the Mathematical Modelling in Finance and Economics Group. The area I am studying is optimal trading strategies in limit order books. For this topic I study stochastic optimal control problems which lead to non-linear partial differential equations which must be solved numerically. Upon development of models we plan on using real 'tick' data to calibrate and backtest the model. The University of Manchester Master of Philosophy (MPhil),  Mathematical Statistics and Probability , 1st Class Honours - 3.86/4.00 GPA equivalent 2011  – 2012 I studied probabilistic risk analysis in energy networks due to the uncertainty of future climate change. This project was funded by National Grid, the UKs national transporter of electricity. I developed a linear programming model based upon stochastic optimisation to aid the system operator in decision making under uncertain conditions. (Open) 1 honor or award EPRSC/National Grid Research Bursary View University of Limerick Bachelor's degree,  Financial Mathematics 2007  – 2011 During my undergraduate I received the Hamiltonian prize in mathematics which is presented by the Royal Irish Academy to the highest achieving undergraduate mathematician in each university in the Republic of Ireland. For my final year dissertation I examined financial derivatives which were dependent on multiple correlated assets, also known as spread options. (Open) 2 honors and awards Royal Irish Academy Hamiltonian Award I was presented this award by Nobel laureate Prof. Robert Merton. The Hamiltonian prize in mathematics is issued by the... View University of Limerick President's Letter Received outstanding academic achievement acknowledgement letter in each semester of my undergraduate. View The University of Manchester Doctor of Philosophy (Ph.D.),  Applied Mathematics/Quantitative Finance 2013  – 2016 I am under the supervision of Prof. Peter Duck and Dr Paul Johnson in the Mathematical Modelling in Finance and Economics Group. The area I am studying is optimal trading strategies in limit order books. For this topic I study stochastic optimal control problems which lead to non-linear partial differential equations which must be solved numerically. Upon development of models we plan on using real 'tick' data to calibrate and backtest the model. The University of Manchester Doctor of Philosophy (Ph.D.),  Applied Mathematics/Quantitative Finance 2013  – 2016 I am under the supervision of Prof. Peter Duck and Dr Paul Johnson in the Mathematical Modelling in Finance and Economics Group. The area I am studying is optimal trading strategies in limit order books. For this topic I study stochastic optimal control problems which lead to non-linear partial differential equations which must be solved numerically. Upon development of models we plan on using real 'tick' data to calibrate and backtest the model. The University of Manchester Doctor of Philosophy (Ph.D.),  Applied Mathematics/Quantitative Finance 2013  – 2016 I am under the supervision of Prof. Peter Duck and Dr Paul Johnson in the Mathematical Modelling in Finance and Economics Group. The area I am studying is optimal trading strategies in limit order books. For this topic I study stochastic optimal control problems which lead to non-linear partial differential equations which must be solved numerically. Upon development of models we plan on using real 'tick' data to calibrate and backtest the model. The University of Manchester Master of Philosophy (MPhil),  Mathematical Statistics and Probability , 1st Class Honours - 3.86/4.00 GPA equivalent 2011  – 2012 I studied probabilistic risk analysis in energy networks due to the uncertainty of future climate change. This project was funded by National Grid, the UKs national transporter of electricity. I developed a linear programming model based upon stochastic optimisation to aid the system operator in decision making under uncertain conditions. (Open) 1 honor or award EPRSC/National Grid Research Bursary View The University of Manchester Master of Philosophy (MPhil),  Mathematical Statistics and Probability , 1st Class Honours - 3.86/4.00 GPA equivalent 2011  – 2012 I studied probabilistic risk analysis in energy networks due to the uncertainty of future climate change. This project was funded by National Grid, the UKs national transporter of electricity. I developed a linear programming model based upon stochastic optimisation to aid the system operator in decision making under uncertain conditions. (Open) 1 honor or award EPRSC/National Grid Research Bursary View The University of Manchester Master of Philosophy (MPhil),  Mathematical Statistics and Probability , 1st Class Honours - 3.86/4.00 GPA equivalent 2011  – 2012 I studied probabilistic risk analysis in energy networks due to the uncertainty of future climate change. This project was funded by National Grid, the UKs national transporter of electricity. I developed a linear programming model based upon stochastic optimisation to aid the system operator in decision making under uncertain conditions. (Open) 1 honor or award EPRSC/National Grid Research Bursary View University of Limerick Bachelor's degree,  Financial Mathematics 2007  – 2011 During my undergraduate I received the Hamiltonian prize in mathematics which is presented by the Royal Irish Academy to the highest achieving undergraduate mathematician in each university in the Republic of Ireland. For my final year dissertation I examined financial derivatives which were dependent on multiple correlated assets, also known as spread options. (Open) 2 honors and awards Royal Irish Academy Hamiltonian Award I was presented this award by Nobel laureate Prof. Robert Merton. The Hamiltonian prize in mathematics is issued by the... View University of Limerick President's Letter Received outstanding academic achievement acknowledgement letter in each semester of my undergraduate. View University of Limerick Bachelor's degree,  Financial Mathematics 2007  – 2011 During my undergraduate I received the Hamiltonian prize in mathematics which is presented by the Royal Irish Academy to the highest achieving undergraduate mathematician in each university in the Republic of Ireland. For my final year dissertation I examined financial derivatives which were dependent on multiple correlated assets, also known as spread options. (Open) 2 honors and awards Royal Irish Academy Hamiltonian Award I was presented this award by Nobel laureate Prof. Robert Merton. The Hamiltonian prize in mathematics is issued by the... View University of Limerick President's Letter Received outstanding academic achievement acknowledgement letter in each semester of my undergraduate. View University of Limerick Bachelor's degree,  Financial Mathematics 2007  – 2011 During my undergraduate I received the Hamiltonian prize in mathematics which is presented by the Royal Irish Academy to the highest achieving undergraduate mathematician in each university in the Republic of Ireland. For my final year dissertation I examined financial derivatives which were dependent on multiple correlated assets, also known as spread options. (Open) 2 honors and awards Royal Irish Academy Hamiltonian Award I was presented this award by Nobel laureate Prof. Robert Merton. The Hamiltonian prize in mathematics is issued by the... View University of Limerick President's Letter Received outstanding academic achievement acknowledgement letter in each semester of my undergraduate. View Honors & Awards 1st place in Amplify Trading Manchester day-trading competition Amplify Trading November 2013 University of Manchester Research Scholar Award University of Manchester January 2013 EPRSC/National Grid Research Bursary EPRSC September 2011 Royal Irish Academy Hamiltonian Award Royal Irish Academy November 2010 I was presented this award by Nobel laureate Prof. Robert Merton. The Hamiltonian prize in mathematics is issued by the Royal Irish Academy to the highest achieving undergraduate mathematician in each university in the Republic of Ireland. University of Limerick President's Letter Prof Don Barry, President of the University of Limerick Received outstanding academic achievement acknowledgement letter in each semester of my undergraduate. 1st place in Amplify Trading Manchester day-trading competition Amplify Trading November 2013 1st place in Amplify Trading Manchester day-trading competition Amplify Trading November 2013 1st place in Amplify Trading Manchester day-trading competition Amplify Trading November 2013 University of Manchester Research Scholar Award University of Manchester January 2013 University of Manchester Research Scholar Award University of Manchester January 2013 University of Manchester Research Scholar Award University of Manchester January 2013 EPRSC/National Grid Research Bursary EPRSC September 2011 EPRSC/National Grid Research Bursary EPRSC September 2011 EPRSC/National Grid Research Bursary EPRSC September 2011 Royal Irish Academy Hamiltonian Award Royal Irish Academy November 2010 I was presented this award by Nobel laureate Prof. Robert Merton. The Hamiltonian prize in mathematics is issued by the Royal Irish Academy to the highest achieving undergraduate mathematician in each university in the Republic of Ireland. Royal Irish Academy Hamiltonian Award Royal Irish Academy November 2010 I was presented this award by Nobel laureate Prof. Robert Merton. The Hamiltonian prize in mathematics is issued by the Royal Irish Academy to the highest achieving undergraduate mathematician in each university in the Republic of Ireland. Royal Irish Academy Hamiltonian Award Royal Irish Academy November 2010 I was presented this award by Nobel laureate Prof. Robert Merton. The Hamiltonian prize in mathematics is issued by the Royal Irish Academy to the highest achieving undergraduate mathematician in each university in the Republic of Ireland. University of Limerick President's Letter Prof Don Barry, President of the University of Limerick Received outstanding academic achievement acknowledgement letter in each semester of my undergraduate. University of Limerick President's Letter Prof Don Barry, President of the University of Limerick Received outstanding academic achievement acknowledgement letter in each semester of my undergraduate. University of Limerick President's Letter Prof Don Barry, President of the University of Limerick Received outstanding academic achievement acknowledgement letter in each semester of my undergraduate. ", "Summary I am a junior at Stanford University interested in Computer Science and Statistics. I had a great opportunity at Cutler Group to apply computational methods to valuate and make decisions on options. The experience makes me really excited about architecture design and large scale data processing applied to a scientific field. Summary I am a junior at Stanford University interested in Computer Science and Statistics. I had a great opportunity at Cutler Group to apply computational methods to valuate and make decisions on options. The experience makes me really excited about architecture design and large scale data processing applied to a scientific field. I am a junior at Stanford University interested in Computer Science and Statistics. I had a great opportunity at Cutler Group to apply computational methods to valuate and make decisions on options. The experience makes me really excited about architecture design and large scale data processing applied to a scientific field. I am a junior at Stanford University interested in Computer Science and Statistics. I had a great opportunity at Cutler Group to apply computational methods to valuate and make decisions on options. The experience makes me really excited about architecture design and large scale data processing applied to a scientific field. Experience Quantitative Analyst Intern Cutler Group, LP June 2014  – Present (1 year 2 months) San Francisco Bay Area Cutler Group is an options market making firm in San Francisco. \n-Implemented various parts of the in house trading software, including market alerters, system admin tools, and a data parser. \n-Learned about basic options valuation techniques and trading strategies. (Open) 5 projects Trading Speed Analysis Analyzed time differences between when a favorable quote is placed on the market and the first trade that gets a fill of... View ControlRoom website Created an internal website that keeps track of processes that have started, stopped, restarted, and failed throughout the... View Corporate Filings Alerter Built a web scraper that continuously pulls for new corporate filings from the underliers Cutler Group trades.\nCorporate... View Largest Movers Email/GUI Push -Highlights stocks that have jumped prices and options that have traded above a threshold.\n-Price jumps expose underliers... View FIX Protocol Parser Cutler Group logs all its FIX protocol messages. Cutler Group has a database of these messages with previously deemed... View (Open) 1 recommendation Alex Fontana Software Engineer at Cutler Group, LP Dan is a really smart, hard-working guy. He understands how to write high-quality software, and he has a firm grasp on the ins and outs of systems programming. In just a few short months, he managed to complete an incredible amount of work. We... View Software Developer Granular (previously Solum) June 2013  –  September 2013  (4 months) San Francisco Bay Area -Improved on a method for displaying soil sample data, per request from a grower. \n-Developed a soybean growth stage model that will be incorporated into later software products. \n-Created an application to convert John Deere machine files into geospatial Esri shapefiles. (Open) 3 projects John Deere File Translation Unit Solum's data analytics team requested John Deere machine files be translated into the industry standard for storing... View Soybean Growth Stage Model Implemented a soybean growth stage model that when given a planting date, previous weather conditions, and soybean hybrid... View Soil Sample Results Reformatting Solum was a company founded on providing quick and accurate soil sample results to agricultural growers. One of Solum's... View (Open) 1 recommendation Brock LaPorte Vice President, Engineering at Granular Dan worked on a variety of interesting and very relevant software projects for us this past summer, and did a great job, completing each task he was assigned in a thoughtful manner. He worked very independently, although did not hesitate to ask for... View Assistant Researcher Stanford Paleobiology Lab June 2010  –  September 2011  (1 year 4 months) Stanford, CA -Researched the relationships between atmospheric oxygen levels and body sizes in marine organisms. \n-Conducted data analysis of foraminifera case study. \n-Programmed relationship graphs in R Statistical Programming Language. \n-Research featured in the annual American Geophysical Union 2010 and 2011. (Open) 1 honor or award Bright STaRS Recognized for youth involvement in Earth Sciences research. View Quantitative Analyst Intern Cutler Group, LP June 2014  – Present (1 year 2 months) San Francisco Bay Area Cutler Group is an options market making firm in San Francisco. \n-Implemented various parts of the in house trading software, including market alerters, system admin tools, and a data parser. \n-Learned about basic options valuation techniques and trading strategies. (Open) 5 projects Trading Speed Analysis Analyzed time differences between when a favorable quote is placed on the market and the first trade that gets a fill of... View ControlRoom website Created an internal website that keeps track of processes that have started, stopped, restarted, and failed throughout the... View Corporate Filings Alerter Built a web scraper that continuously pulls for new corporate filings from the underliers Cutler Group trades.\nCorporate... View Largest Movers Email/GUI Push -Highlights stocks that have jumped prices and options that have traded above a threshold.\n-Price jumps expose underliers... View FIX Protocol Parser Cutler Group logs all its FIX protocol messages. Cutler Group has a database of these messages with previously deemed... View (Open) 1 recommendation Alex Fontana Software Engineer at Cutler Group, LP Dan is a really smart, hard-working guy. He understands how to write high-quality software, and he has a firm grasp on the ins and outs of systems programming. In just a few short months, he managed to complete an incredible amount of work. We... View Quantitative Analyst Intern Cutler Group, LP June 2014  – Present (1 year 2 months) San Francisco Bay Area Cutler Group is an options market making firm in San Francisco. \n-Implemented various parts of the in house trading software, including market alerters, system admin tools, and a data parser. \n-Learned about basic options valuation techniques and trading strategies. (Open) 5 projects Trading Speed Analysis Analyzed time differences between when a favorable quote is placed on the market and the first trade that gets a fill of... View ControlRoom website Created an internal website that keeps track of processes that have started, stopped, restarted, and failed throughout the... View Corporate Filings Alerter Built a web scraper that continuously pulls for new corporate filings from the underliers Cutler Group trades.\nCorporate... View Largest Movers Email/GUI Push -Highlights stocks that have jumped prices and options that have traded above a threshold.\n-Price jumps expose underliers... View FIX Protocol Parser Cutler Group logs all its FIX protocol messages. Cutler Group has a database of these messages with previously deemed... View (Open) 1 recommendation Alex Fontana Software Engineer at Cutler Group, LP Dan is a really smart, hard-working guy. He understands how to write high-quality software, and he has a firm grasp on the ins and outs of systems programming. In just a few short months, he managed to complete an incredible amount of work. We... View Software Developer Granular (previously Solum) June 2013  –  September 2013  (4 months) San Francisco Bay Area -Improved on a method for displaying soil sample data, per request from a grower. \n-Developed a soybean growth stage model that will be incorporated into later software products. \n-Created an application to convert John Deere machine files into geospatial Esri shapefiles. (Open) 3 projects John Deere File Translation Unit Solum's data analytics team requested John Deere machine files be translated into the industry standard for storing... View Soybean Growth Stage Model Implemented a soybean growth stage model that when given a planting date, previous weather conditions, and soybean hybrid... View Soil Sample Results Reformatting Solum was a company founded on providing quick and accurate soil sample results to agricultural growers. One of Solum's... View (Open) 1 recommendation Brock LaPorte Vice President, Engineering at Granular Dan worked on a variety of interesting and very relevant software projects for us this past summer, and did a great job, completing each task he was assigned in a thoughtful manner. He worked very independently, although did not hesitate to ask for... View Software Developer Granular (previously Solum) June 2013  –  September 2013  (4 months) San Francisco Bay Area -Improved on a method for displaying soil sample data, per request from a grower. \n-Developed a soybean growth stage model that will be incorporated into later software products. \n-Created an application to convert John Deere machine files into geospatial Esri shapefiles. (Open) 3 projects John Deere File Translation Unit Solum's data analytics team requested John Deere machine files be translated into the industry standard for storing... View Soybean Growth Stage Model Implemented a soybean growth stage model that when given a planting date, previous weather conditions, and soybean hybrid... View Soil Sample Results Reformatting Solum was a company founded on providing quick and accurate soil sample results to agricultural growers. One of Solum's... View (Open) 1 recommendation Brock LaPorte Vice President, Engineering at Granular Dan worked on a variety of interesting and very relevant software projects for us this past summer, and did a great job, completing each task he was assigned in a thoughtful manner. He worked very independently, although did not hesitate to ask for... View Assistant Researcher Stanford Paleobiology Lab June 2010  –  September 2011  (1 year 4 months) Stanford, CA -Researched the relationships between atmospheric oxygen levels and body sizes in marine organisms. \n-Conducted data analysis of foraminifera case study. \n-Programmed relationship graphs in R Statistical Programming Language. \n-Research featured in the annual American Geophysical Union 2010 and 2011. (Open) 1 honor or award Bright STaRS Recognized for youth involvement in Earth Sciences research. View Assistant Researcher Stanford Paleobiology Lab June 2010  –  September 2011  (1 year 4 months) Stanford, CA -Researched the relationships between atmospheric oxygen levels and body sizes in marine organisms. \n-Conducted data analysis of foraminifera case study. \n-Programmed relationship graphs in R Statistical Programming Language. \n-Research featured in the annual American Geophysical Union 2010 and 2011. (Open) 1 honor or award Bright STaRS Recognized for youth involvement in Earth Sciences research. View Languages Chinese Professional working proficiency Chinese Professional working proficiency Chinese Professional working proficiency Professional working proficiency Skills Top Skills 6 Java 5 C++ 3 C 3 Matlab 3 English 3 Python 2 Microsoft Office 2 Research 2 Eclipse 2 Programming Dan also knows about... 0 PowerPoint 0 Microsoft Excel 0 Microsoft Word 0 Windows 0 Photoshop 0 C# 0 MySQL Skills  Top Skills 6 Java 5 C++ 3 C 3 Matlab 3 English 3 Python 2 Microsoft Office 2 Research 2 Eclipse 2 Programming Dan also knows about... 0 PowerPoint 0 Microsoft Excel 0 Microsoft Word 0 Windows 0 Photoshop 0 C# 0 MySQL Top Skills 6 Java 5 C++ 3 C 3 Matlab 3 English 3 Python 2 Microsoft Office 2 Research 2 Eclipse 2 Programming Dan also knows about... 0 PowerPoint 0 Microsoft Excel 0 Microsoft Word 0 Windows 0 Photoshop 0 C# 0 MySQL Top Skills 6 Java 5 C++ 3 C 3 Matlab 3 English 3 Python 2 Microsoft Office 2 Research 2 Eclipse 2 Programming Dan also knows about... 0 PowerPoint 0 Microsoft Excel 0 Microsoft Word 0 Windows 0 Photoshop 0 C# 0 MySQL                     0 PowerPoint 0 Microsoft Excel 0 Microsoft Word 0 Windows 0 Photoshop 0 C# 0 MySQL Education Stanford University Expected BS, MS,  Computer Science , GPA: 4.1 2012  – 2016 (Open) 2 projects Art, Meditation, Nature A journey to observe and understand more about myself and the surrounding world.\n-Daily drawing sessions at the CoHo at... View Contours and Kernels: The Art of Sketching Employed GDA, SVM, Neural Network for classifying objects in human sketches.\nUsed clustering and foresting algorithms for... View (Open) 1 honor or award Presidential Scholar Award for Academic Excellence View (Open) 8 courses Operating Systems Machine Learning Algorithms, Data Structures Probability, Statistics Linear Algebra Theory Number Thoery Ordinary Differential Equations Multivariable and Vector Calculus See more Monta Vista High School GPA: 4.0 2008  – 2012 (Open) 1 organization Monta Vista Habitat for Humanity Recruited 3/4 of the club to help build houses in Morgan Hill and later Cupertino.\nSanded walls, landscaped gardens, dug pipelines. View Stanford University Expected BS, MS,  Computer Science , GPA: 4.1 2012  – 2016 (Open) 2 projects Art, Meditation, Nature A journey to observe and understand more about myself and the surrounding world.\n-Daily drawing sessions at the CoHo at... View Contours and Kernels: The Art of Sketching Employed GDA, SVM, Neural Network for classifying objects in human sketches.\nUsed clustering and foresting algorithms for... View (Open) 1 honor or award Presidential Scholar Award for Academic Excellence View (Open) 8 courses Operating Systems Machine Learning Algorithms, Data Structures Probability, Statistics Linear Algebra Theory Number Thoery Ordinary Differential Equations Multivariable and Vector Calculus See more Stanford University Expected BS, MS,  Computer Science , GPA: 4.1 2012  – 2016 (Open) 2 projects Art, Meditation, Nature A journey to observe and understand more about myself and the surrounding world.\n-Daily drawing sessions at the CoHo at... View Contours and Kernels: The Art of Sketching Employed GDA, SVM, Neural Network for classifying objects in human sketches.\nUsed clustering and foresting algorithms for... View (Open) 1 honor or award Presidential Scholar Award for Academic Excellence View (Open) 8 courses Operating Systems Machine Learning Algorithms, Data Structures Probability, Statistics Linear Algebra Theory Number Thoery Ordinary Differential Equations Multivariable and Vector Calculus See more Stanford University Expected BS, MS,  Computer Science , GPA: 4.1 2012  – 2016 (Open) 2 projects Art, Meditation, Nature A journey to observe and understand more about myself and the surrounding world.\n-Daily drawing sessions at the CoHo at... View Contours and Kernels: The Art of Sketching Employed GDA, SVM, Neural Network for classifying objects in human sketches.\nUsed clustering and foresting algorithms for... View (Open) 1 honor or award Presidential Scholar Award for Academic Excellence View (Open) 8 courses Operating Systems Machine Learning Algorithms, Data Structures Probability, Statistics Linear Algebra Theory Number Thoery Ordinary Differential Equations Multivariable and Vector Calculus See more Monta Vista High School GPA: 4.0 2008  – 2012 (Open) 1 organization Monta Vista Habitat for Humanity Recruited 3/4 of the club to help build houses in Morgan Hill and later Cupertino.\nSanded walls, landscaped gardens, dug pipelines. View Monta Vista High School GPA: 4.0 2008  – 2012 (Open) 1 organization Monta Vista Habitat for Humanity Recruited 3/4 of the club to help build houses in Morgan Hill and later Cupertino.\nSanded walls, landscaped gardens, dug pipelines. View Monta Vista High School GPA: 4.0 2008  – 2012 (Open) 1 organization Monta Vista Habitat for Humanity Recruited 3/4 of the club to help build houses in Morgan Hill and later Cupertino.\nSanded walls, landscaped gardens, dug pipelines. View Honors & Awards Presidential Scholar Award for Academic Excellence Stanford University September 2013 Bright STaRS American Geophysical Union December 2011 Recognized for youth involvement in Earth Sciences research. Presidential Scholar Award for Academic Excellence Stanford University September 2013 Presidential Scholar Award for Academic Excellence Stanford University September 2013 Presidential Scholar Award for Academic Excellence Stanford University September 2013 Bright STaRS American Geophysical Union December 2011 Recognized for youth involvement in Earth Sciences research. Bright STaRS American Geophysical Union December 2011 Recognized for youth involvement in Earth Sciences research. Bright STaRS American Geophysical Union December 2011 Recognized for youth involvement in Earth Sciences research. ", "Experience Quantitative Analyst Intern Genscape, Inc. June 2015  – Present (2 months) Boston, Massachusetts Quantitative Analyst Intern Genscape, Inc. June 2015  – Present (2 months) Boston, Massachusetts Quantitative Analyst Intern Genscape, Inc. June 2015  – Present (2 months) Boston, Massachusetts Languages   Skills Skills     Honors & Awards ", "Experience Quantitative Analyst Intern Stone Ridge Asset Management June 2014  – Present (1 year 2 months) Beijing City, China Summer Analyst The Hina Group July 2013  –  September 2013  (3 months) Audit & Assurance Winter Intern Deloitte January 2013  –  March 2013  (3 months) Quantitative Analyst Intern Stone Ridge Asset Management June 2014  – Present (1 year 2 months) Beijing City, China Quantitative Analyst Intern Stone Ridge Asset Management June 2014  – Present (1 year 2 months) Beijing City, China Summer Analyst The Hina Group July 2013  –  September 2013  (3 months) Summer Analyst The Hina Group July 2013  –  September 2013  (3 months) Audit & Assurance Winter Intern Deloitte January 2013  –  March 2013  (3 months) Audit & Assurance Winter Intern Deloitte January 2013  –  March 2013  (3 months) Languages Chinese English Chinese English Chinese English Skills Top Skills 1 Microsoft Excel 1 Microsoft Office 1 PowerPoint 0 Auditing 0 Customer Service Xinjie also knows about... 0 Microsoft Word 0 Outlook 0 English 0 Windows 0 Research 0 Strategic Planning 0 Budgets 0 Public Speaking 0 Negotiation 0 Matlab 0 Python Skills  Top Skills 1 Microsoft Excel 1 Microsoft Office 1 PowerPoint 0 Auditing 0 Customer Service Xinjie also knows about... 0 Microsoft Word 0 Outlook 0 English 0 Windows 0 Research 0 Strategic Planning 0 Budgets 0 Public Speaking 0 Negotiation 0 Matlab 0 Python Top Skills 1 Microsoft Excel 1 Microsoft Office 1 PowerPoint 0 Auditing 0 Customer Service Xinjie also knows about... 0 Microsoft Word 0 Outlook 0 English 0 Windows 0 Research 0 Strategic Planning 0 Budgets 0 Public Speaking 0 Negotiation 0 Matlab 0 Python Top Skills 1 Microsoft Excel 1 Microsoft Office 1 PowerPoint 0 Auditing 0 Customer Service Xinjie also knows about... 0 Microsoft Word 0 Outlook 0 English 0 Windows 0 Research 0 Strategic Planning 0 Budgets 0 Public Speaking 0 Negotiation 0 Matlab 0 Python           0 Microsoft Word 0 Outlook 0 English 0 Windows 0 Research 0 Strategic Planning 0 Budgets 0 Public Speaking 0 Negotiation 0 Matlab 0 Python Education Tsinghua University Master's degree,  Banking ,  Corporate ,  Finance ,  and Securities Law 2014  – 2016 Tsinghua University B. Econ,  Finance 2010  – 2014 University of Illinois at Urbana-Champaign Exchange Program,  Finance 2012  – 2012 Tsinghua University Master's degree,  Banking ,  Corporate ,  Finance ,  and Securities Law 2014  – 2016 Tsinghua University Master's degree,  Banking ,  Corporate ,  Finance ,  and Securities Law 2014  – 2016 Tsinghua University Master's degree,  Banking ,  Corporate ,  Finance ,  and Securities Law 2014  – 2016 Tsinghua University B. Econ,  Finance 2010  – 2014 Tsinghua University B. Econ,  Finance 2010  – 2014 Tsinghua University B. Econ,  Finance 2010  – 2014 University of Illinois at Urbana-Champaign Exchange Program,  Finance 2012  – 2012 University of Illinois at Urbana-Champaign Exchange Program,  Finance 2012  – 2012 University of Illinois at Urbana-Champaign Exchange Program,  Finance 2012  – 2012 ", "Summary A self-motivated and team-spirited Carnegie Mellon Graduate Student eager to build upon my software development experience in a capacity that would allow me to put into action my enthusiasm for quantitative finance and data analytics. I aspire to work in a position where I am able to leverage data to derive insights and help make meaningful and impactful decisions. \n \nGoutam is currently completing his Masters in Information Systems Management from Carnegie Mellon University. He will be graduating in December 2015. Goutam earned an undergraduate degree in Computer Science and Engineering( B.Tech in CSE) from International Institute of Information Technology, Hyderabad, one of the premier research universities in India.  \nHe is a technology fanatic and loves how he can leverage that knowledge into business decisions that impact the overall systems in the industry. Summary A self-motivated and team-spirited Carnegie Mellon Graduate Student eager to build upon my software development experience in a capacity that would allow me to put into action my enthusiasm for quantitative finance and data analytics. I aspire to work in a position where I am able to leverage data to derive insights and help make meaningful and impactful decisions. \n \nGoutam is currently completing his Masters in Information Systems Management from Carnegie Mellon University. He will be graduating in December 2015. Goutam earned an undergraduate degree in Computer Science and Engineering( B.Tech in CSE) from International Institute of Information Technology, Hyderabad, one of the premier research universities in India.  \nHe is a technology fanatic and loves how he can leverage that knowledge into business decisions that impact the overall systems in the industry. A self-motivated and team-spirited Carnegie Mellon Graduate Student eager to build upon my software development experience in a capacity that would allow me to put into action my enthusiasm for quantitative finance and data analytics. I aspire to work in a position where I am able to leverage data to derive insights and help make meaningful and impactful decisions. \n \nGoutam is currently completing his Masters in Information Systems Management from Carnegie Mellon University. He will be graduating in December 2015. Goutam earned an undergraduate degree in Computer Science and Engineering( B.Tech in CSE) from International Institute of Information Technology, Hyderabad, one of the premier research universities in India.  \nHe is a technology fanatic and loves how he can leverage that knowledge into business decisions that impact the overall systems in the industry. A self-motivated and team-spirited Carnegie Mellon Graduate Student eager to build upon my software development experience in a capacity that would allow me to put into action my enthusiasm for quantitative finance and data analytics. I aspire to work in a position where I am able to leverage data to derive insights and help make meaningful and impactful decisions. \n \nGoutam is currently completing his Masters in Information Systems Management from Carnegie Mellon University. He will be graduating in December 2015. Goutam earned an undergraduate degree in Computer Science and Engineering( B.Tech in CSE) from International Institute of Information Technology, Hyderabad, one of the premier research universities in India.  \nHe is a technology fanatic and loves how he can leverage that knowledge into business decisions that impact the overall systems in the industry. Experience Quantitative Analyst intern Citi June 2015  – Present (2 months) Greater New York City Area Options Market Making and Systematic Trading Graduate Teaching Assistant Carnegie Mellon Tepper School of Business March 2015  – Present (5 months) Greater Pittsburgh Area Financial Computing III (46-903) teaching assistant for MS in Computational Finance students. \nEvaluated Python programming assignments, quizzes and conducted weekly office hours. Graduate Teaching Assistant Carnegie Mellon University August 2014  –  October 2014  (3 months) Greater Pittsburgh Area Intermediate Java (95-713) teaching assistant for graduate students. \nEvaluated Java Programming assignments and conducted weekly office hours. Software Engineer bwin.party digital entertainment June 2013  –  July 2014  (1 year 2 months) Hyderabad Area, India  Collaborated with multiple platform teams to resolve issues with revenue generating user accounts thereby increasing reliability and revenue \n Migrated user account information from 3rd party to centralized in-house database that increased the efficiency by 14% \n Implemented the know-your-customer service in Java to expand business in the French market. \n Pioneered Agile approach and collaborated effectively with engagement teams, resulting in successful, focused and iterated delivery (Open) 1 recommendation siva srinivas Business Analyst at Ivy Comptech Goutam joined our team as a fresher. He is always ready for any challenge, in terms of picking new work and interested towards knowing the minute details of any work given. More than everything, he is ever smiling and handled pressure like a... View Undergraduate Teaching Assistant IIIT Hyderabad August 2011  –  May 2013  (1 year 10 months) Hyderabad Area, India - TA for “Introduction to Databases” from Aug-Dec 2011, “Mathematics” from Jan-May 2012, and “Computer Networks” from Jan-May 2013 \n- Responsibilities included conducting tutorial session and evaluating assignments and exam answer scripts. Research intern Shanghai ocean university May 2012  –  July 2012  (3 months) Shanghai City, China •\tDesigned and implemented an algorithm that achieved 10% more accuracy in detecting Shanghai’s coastline from single and multi-polarimetric radar images \n•\tExtracted coastline to be used for studying changes in land structure.  \n•\tUsed Matlab, C++, R2V Coastline extraction from polarimetric SAR images Edit Quantitative Analyst intern Citi June 2015  – Present (2 months) Greater New York City Area Options Market Making and Systematic Trading Quantitative Analyst intern Citi June 2015  – Present (2 months) Greater New York City Area Options Market Making and Systematic Trading Graduate Teaching Assistant Carnegie Mellon Tepper School of Business March 2015  – Present (5 months) Greater Pittsburgh Area Financial Computing III (46-903) teaching assistant for MS in Computational Finance students. \nEvaluated Python programming assignments, quizzes and conducted weekly office hours. Graduate Teaching Assistant Carnegie Mellon Tepper School of Business March 2015  – Present (5 months) Greater Pittsburgh Area Financial Computing III (46-903) teaching assistant for MS in Computational Finance students. \nEvaluated Python programming assignments, quizzes and conducted weekly office hours. Graduate Teaching Assistant Carnegie Mellon University August 2014  –  October 2014  (3 months) Greater Pittsburgh Area Intermediate Java (95-713) teaching assistant for graduate students. \nEvaluated Java Programming assignments and conducted weekly office hours. Graduate Teaching Assistant Carnegie Mellon University August 2014  –  October 2014  (3 months) Greater Pittsburgh Area Intermediate Java (95-713) teaching assistant for graduate students. \nEvaluated Java Programming assignments and conducted weekly office hours. Software Engineer bwin.party digital entertainment June 2013  –  July 2014  (1 year 2 months) Hyderabad Area, India  Collaborated with multiple platform teams to resolve issues with revenue generating user accounts thereby increasing reliability and revenue \n Migrated user account information from 3rd party to centralized in-house database that increased the efficiency by 14% \n Implemented the know-your-customer service in Java to expand business in the French market. \n Pioneered Agile approach and collaborated effectively with engagement teams, resulting in successful, focused and iterated delivery (Open) 1 recommendation siva srinivas Business Analyst at Ivy Comptech Goutam joined our team as a fresher. He is always ready for any challenge, in terms of picking new work and interested towards knowing the minute details of any work given. More than everything, he is ever smiling and handled pressure like a... View Software Engineer bwin.party digital entertainment June 2013  –  July 2014  (1 year 2 months) Hyderabad Area, India  Collaborated with multiple platform teams to resolve issues with revenue generating user accounts thereby increasing reliability and revenue \n Migrated user account information from 3rd party to centralized in-house database that increased the efficiency by 14% \n Implemented the know-your-customer service in Java to expand business in the French market. \n Pioneered Agile approach and collaborated effectively with engagement teams, resulting in successful, focused and iterated delivery (Open) 1 recommendation siva srinivas Business Analyst at Ivy Comptech Goutam joined our team as a fresher. He is always ready for any challenge, in terms of picking new work and interested towards knowing the minute details of any work given. More than everything, he is ever smiling and handled pressure like a... View Undergraduate Teaching Assistant IIIT Hyderabad August 2011  –  May 2013  (1 year 10 months) Hyderabad Area, India - TA for “Introduction to Databases” from Aug-Dec 2011, “Mathematics” from Jan-May 2012, and “Computer Networks” from Jan-May 2013 \n- Responsibilities included conducting tutorial session and evaluating assignments and exam answer scripts. Undergraduate Teaching Assistant IIIT Hyderabad August 2011  –  May 2013  (1 year 10 months) Hyderabad Area, India - TA for “Introduction to Databases” from Aug-Dec 2011, “Mathematics” from Jan-May 2012, and “Computer Networks” from Jan-May 2013 \n- Responsibilities included conducting tutorial session and evaluating assignments and exam answer scripts. Research intern Shanghai ocean university May 2012  –  July 2012  (3 months) Shanghai City, China •\tDesigned and implemented an algorithm that achieved 10% more accuracy in detecting Shanghai’s coastline from single and multi-polarimetric radar images \n•\tExtracted coastline to be used for studying changes in land structure.  \n•\tUsed Matlab, C++, R2V Coastline extraction from polarimetric SAR images Edit Research intern Shanghai ocean university May 2012  –  July 2012  (3 months) Shanghai City, China •\tDesigned and implemented an algorithm that achieved 10% more accuracy in detecting Shanghai’s coastline from single and multi-polarimetric radar images \n•\tExtracted coastline to be used for studying changes in land structure.  \n•\tUsed Matlab, C++, R2V Coastline extraction from polarimetric SAR images Edit Coastline extraction from polarimetric SAR images Edit Coastline extraction from polarimetric SAR images Edit Coastline extraction from polarimetric SAR images  Coastline extraction from polarimetric SAR images  Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Oriya Professional working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Oriya Professional working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Oriya Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Top Skills 13 Algorithms 12 C 8 C++ 6 Python 6 Java 6 Matlab 5 Computer Science 4 OpenGL 4 Machine Learning 3 Eclipse Goutam also knows about... 3 SQL 3 MySQL 3 Programming 3 Data Structures 1 Perl 0 Linux 0 HTML 0 Software Development 0 Databases Skills  Top Skills 13 Algorithms 12 C 8 C++ 6 Python 6 Java 6 Matlab 5 Computer Science 4 OpenGL 4 Machine Learning 3 Eclipse Goutam also knows about... 3 SQL 3 MySQL 3 Programming 3 Data Structures 1 Perl 0 Linux 0 HTML 0 Software Development 0 Databases Top Skills 13 Algorithms 12 C 8 C++ 6 Python 6 Java 6 Matlab 5 Computer Science 4 OpenGL 4 Machine Learning 3 Eclipse Goutam also knows about... 3 SQL 3 MySQL 3 Programming 3 Data Structures 1 Perl 0 Linux 0 HTML 0 Software Development 0 Databases Top Skills 13 Algorithms 12 C 8 C++ 6 Python 6 Java 6 Matlab 5 Computer Science 4 OpenGL 4 Machine Learning 3 Eclipse Goutam also knows about... 3 SQL 3 MySQL 3 Programming 3 Data Structures 1 Perl 0 Linux 0 HTML 0 Software Development 0 Databases                     3 SQL 3 MySQL 3 Programming 3 Data Structures 1 Perl 0 Linux 0 HTML 0 Software Development 0 Databases Education Carnegie Mellon University Master's degree,  Information Systems Management 2014  – 2015 Quantitative finance, \nData Analytics Activities and Societies:  Keith Block Entrepreneurship 2014 - 3rd place winners (Open) 1 honor or award Keith Block Entrepreneurship, 3rd place winners - Proposed and presented an assistive reader to help make reading and learning fun and effective for dyslexic kids.\n- Proposed entrepreneurial venture that solves a problem in the marketplace and has a significant IT component. The proposal has the... View (Open) 8 courses Machine Learning Machine Learning with Large Datasets Advance Database Management Data Mining Optimization Methods in Finance Principles of Finance Statistics for IT Managers Distributed Systems See more IIIT Hyderabad Bachelor of Technology (B.Tech.),  Computer Science and Engineering , 8.75/10 2009  – 2013 Some Projects \n(1) Assistive Reader Software for Dyslexic kids \n•\tAdjudged in top 2 out of 30 business plans as part of Technology Entrepreneurship course and was selected for entrepreneurial mentoring by Hyderabad4Innovation group \n•\tDeveloped Android mobile application as a prototype to showcase along with business plan presentation  \n \n(2) Automatic shadow detection and removal \n•\tDesigned, implemented and presented an algorithm for automated shadow detection and removal Activities and Societies:  Students’ Training and Placement Committee\n- As a team ,  achieved 100% placement ,  with one of the best average compensation for engineering graduates across India. Team size = 9 (Open) 2 honors and awards Undergraduate Research Award Awarded for making significant research contributions as an undergraduate student View Dean's List and Merit List Semesters: Spring 2010, Monsoon 2010, Spring 2011, Monsoon 2011, Spring 2012, Spring 2013\n View (Open) 10 courses Artificial Intelligence Pattern Recognition Operating Systems Computer Networks Algorithms Computer Programming Data Structures Innovation and Technology Management Technology Entrepreneurship Corporate Strategy See more Carnegie Mellon University Master's degree,  Information Systems Management 2014  – 2015 Quantitative finance, \nData Analytics Activities and Societies:  Keith Block Entrepreneurship 2014 - 3rd place winners (Open) 1 honor or award Keith Block Entrepreneurship, 3rd place winners - Proposed and presented an assistive reader to help make reading and learning fun and effective for dyslexic kids.\n- Proposed entrepreneurial venture that solves a problem in the marketplace and has a significant IT component. The proposal has the... View (Open) 8 courses Machine Learning Machine Learning with Large Datasets Advance Database Management Data Mining Optimization Methods in Finance Principles of Finance Statistics for IT Managers Distributed Systems See more Carnegie Mellon University Master's degree,  Information Systems Management 2014  – 2015 Quantitative finance, \nData Analytics Activities and Societies:  Keith Block Entrepreneurship 2014 - 3rd place winners (Open) 1 honor or award Keith Block Entrepreneurship, 3rd place winners - Proposed and presented an assistive reader to help make reading and learning fun and effective for dyslexic kids.\n- Proposed entrepreneurial venture that solves a problem in the marketplace and has a significant IT component. The proposal has the... View (Open) 8 courses Machine Learning Machine Learning with Large Datasets Advance Database Management Data Mining Optimization Methods in Finance Principles of Finance Statistics for IT Managers Distributed Systems See more Carnegie Mellon University Master's degree,  Information Systems Management 2014  – 2015 Quantitative finance, \nData Analytics Activities and Societies:  Keith Block Entrepreneurship 2014 - 3rd place winners (Open) 1 honor or award Keith Block Entrepreneurship, 3rd place winners - Proposed and presented an assistive reader to help make reading and learning fun and effective for dyslexic kids.\n- Proposed entrepreneurial venture that solves a problem in the marketplace and has a significant IT component. The proposal has the... View (Open) 8 courses Machine Learning Machine Learning with Large Datasets Advance Database Management Data Mining Optimization Methods in Finance Principles of Finance Statistics for IT Managers Distributed Systems See more IIIT Hyderabad Bachelor of Technology (B.Tech.),  Computer Science and Engineering , 8.75/10 2009  – 2013 Some Projects \n(1) Assistive Reader Software for Dyslexic kids \n•\tAdjudged in top 2 out of 30 business plans as part of Technology Entrepreneurship course and was selected for entrepreneurial mentoring by Hyderabad4Innovation group \n•\tDeveloped Android mobile application as a prototype to showcase along with business plan presentation  \n \n(2) Automatic shadow detection and removal \n•\tDesigned, implemented and presented an algorithm for automated shadow detection and removal Activities and Societies:  Students’ Training and Placement Committee\n- As a team ,  achieved 100% placement ,  with one of the best average compensation for engineering graduates across India. Team size = 9 (Open) 2 honors and awards Undergraduate Research Award Awarded for making significant research contributions as an undergraduate student View Dean's List and Merit List Semesters: Spring 2010, Monsoon 2010, Spring 2011, Monsoon 2011, Spring 2012, Spring 2013\n View (Open) 10 courses Artificial Intelligence Pattern Recognition Operating Systems Computer Networks Algorithms Computer Programming Data Structures Innovation and Technology Management Technology Entrepreneurship Corporate Strategy See more IIIT Hyderabad Bachelor of Technology (B.Tech.),  Computer Science and Engineering , 8.75/10 2009  – 2013 Some Projects \n(1) Assistive Reader Software for Dyslexic kids \n•\tAdjudged in top 2 out of 30 business plans as part of Technology Entrepreneurship course and was selected for entrepreneurial mentoring by Hyderabad4Innovation group \n•\tDeveloped Android mobile application as a prototype to showcase along with business plan presentation  \n \n(2) Automatic shadow detection and removal \n•\tDesigned, implemented and presented an algorithm for automated shadow detection and removal Activities and Societies:  Students’ Training and Placement Committee\n- As a team ,  achieved 100% placement ,  with one of the best average compensation for engineering graduates across India. Team size = 9 (Open) 2 honors and awards Undergraduate Research Award Awarded for making significant research contributions as an undergraduate student View Dean's List and Merit List Semesters: Spring 2010, Monsoon 2010, Spring 2011, Monsoon 2011, Spring 2012, Spring 2013\n View (Open) 10 courses Artificial Intelligence Pattern Recognition Operating Systems Computer Networks Algorithms Computer Programming Data Structures Innovation and Technology Management Technology Entrepreneurship Corporate Strategy See more IIIT Hyderabad Bachelor of Technology (B.Tech.),  Computer Science and Engineering , 8.75/10 2009  – 2013 Some Projects \n(1) Assistive Reader Software for Dyslexic kids \n•\tAdjudged in top 2 out of 30 business plans as part of Technology Entrepreneurship course and was selected for entrepreneurial mentoring by Hyderabad4Innovation group \n•\tDeveloped Android mobile application as a prototype to showcase along with business plan presentation  \n \n(2) Automatic shadow detection and removal \n•\tDesigned, implemented and presented an algorithm for automated shadow detection and removal Activities and Societies:  Students’ Training and Placement Committee\n- As a team ,  achieved 100% placement ,  with one of the best average compensation for engineering graduates across India. Team size = 9 (Open) 2 honors and awards Undergraduate Research Award Awarded for making significant research contributions as an undergraduate student View Dean's List and Merit List Semesters: Spring 2010, Monsoon 2010, Spring 2011, Monsoon 2011, Spring 2012, Spring 2013\n View (Open) 10 courses Artificial Intelligence Pattern Recognition Operating Systems Computer Networks Algorithms Computer Programming Data Structures Innovation and Technology Management Technology Entrepreneurship Corporate Strategy See more Honors & Awards Keith Block Entrepreneurship, 3rd place winners Carnegie Mellon University October 2014 - Proposed and presented an assistive reader to help make reading and learning fun and effective for dyslexic kids. \n- Proposed entrepreneurial venture that solves a problem in the marketplace and has a significant IT component. The proposal has the potential of being a viable and possibly transformative growth-oriented startup company. Undergraduate Research Award IIIT Hyderabad May 2013 Awarded for making significant research contributions as an undergraduate student Dean's List and Merit List IIIT Hyderabad Semesters: Spring 2010, Monsoon 2010, Spring 2011, Monsoon 2011, Spring 2012, Spring 2013 \n Keith Block Entrepreneurship, 3rd place winners Carnegie Mellon University October 2014 - Proposed and presented an assistive reader to help make reading and learning fun and effective for dyslexic kids. \n- Proposed entrepreneurial venture that solves a problem in the marketplace and has a significant IT component. The proposal has the potential of being a viable and possibly transformative growth-oriented startup company. Keith Block Entrepreneurship, 3rd place winners Carnegie Mellon University October 2014 - Proposed and presented an assistive reader to help make reading and learning fun and effective for dyslexic kids. \n- Proposed entrepreneurial venture that solves a problem in the marketplace and has a significant IT component. The proposal has the potential of being a viable and possibly transformative growth-oriented startup company. Keith Block Entrepreneurship, 3rd place winners Carnegie Mellon University October 2014 - Proposed and presented an assistive reader to help make reading and learning fun and effective for dyslexic kids. \n- Proposed entrepreneurial venture that solves a problem in the marketplace and has a significant IT component. The proposal has the potential of being a viable and possibly transformative growth-oriented startup company. Undergraduate Research Award IIIT Hyderabad May 2013 Awarded for making significant research contributions as an undergraduate student Undergraduate Research Award IIIT Hyderabad May 2013 Awarded for making significant research contributions as an undergraduate student Undergraduate Research Award IIIT Hyderabad May 2013 Awarded for making significant research contributions as an undergraduate student Dean's List and Merit List IIIT Hyderabad Semesters: Spring 2010, Monsoon 2010, Spring 2011, Monsoon 2011, Spring 2012, Spring 2013 \n Dean's List and Merit List IIIT Hyderabad Semesters: Spring 2010, Monsoon 2010, Spring 2011, Monsoon 2011, Spring 2012, Spring 2013 \n Dean's List and Merit List IIIT Hyderabad Semesters: Spring 2010, Monsoon 2010, Spring 2011, Monsoon 2011, Spring 2012, Spring 2013 \n ", "Experience Quantitative Analyst Intern Ascend Analytics July 2015  – Present (1 month) Boulder, CO Graduate Research Assistant Lehman Center for Transportation Research at Florida International University August 2010  –  November 2014  (4 years 4 months) Miami/Fort Lauderdale Area Graduate Teaching Assistant Florida International University August 2010  –  September 2011  (1 year 2 months) Miami/Fort Lauderdale Area Associate TNA (Tarhe Now Andishan) September 2007  –  July 2010  (2 years 11 months) Tehran, Iran Planning Engineer Pardaraz Consulting Company April 2009  –  June 2010  (1 year 3 months) Tehran, Iran Senior Data Analyst Matin Energy Development Company February 2008  –  December 2008  (11 months) Tehran, Iran Financial Analyst Toloe Investment Consulting Company September 2004  –  September 2005  (1 year 1 month) Tehran, Iran Quantitative Analyst Intern Ascend Analytics July 2015  – Present (1 month) Boulder, CO Quantitative Analyst Intern Ascend Analytics July 2015  – Present (1 month) Boulder, CO Graduate Research Assistant Lehman Center for Transportation Research at Florida International University August 2010  –  November 2014  (4 years 4 months) Miami/Fort Lauderdale Area Graduate Research Assistant Lehman Center for Transportation Research at Florida International University August 2010  –  November 2014  (4 years 4 months) Miami/Fort Lauderdale Area Graduate Teaching Assistant Florida International University August 2010  –  September 2011  (1 year 2 months) Miami/Fort Lauderdale Area Graduate Teaching Assistant Florida International University August 2010  –  September 2011  (1 year 2 months) Miami/Fort Lauderdale Area Associate TNA (Tarhe Now Andishan) September 2007  –  July 2010  (2 years 11 months) Tehran, Iran Associate TNA (Tarhe Now Andishan) September 2007  –  July 2010  (2 years 11 months) Tehran, Iran Planning Engineer Pardaraz Consulting Company April 2009  –  June 2010  (1 year 3 months) Tehran, Iran Planning Engineer Pardaraz Consulting Company April 2009  –  June 2010  (1 year 3 months) Tehran, Iran Senior Data Analyst Matin Energy Development Company February 2008  –  December 2008  (11 months) Tehran, Iran Senior Data Analyst Matin Energy Development Company February 2008  –  December 2008  (11 months) Tehran, Iran Financial Analyst Toloe Investment Consulting Company September 2004  –  September 2005  (1 year 1 month) Tehran, Iran Financial Analyst Toloe Investment Consulting Company September 2004  –  September 2005  (1 year 1 month) Tehran, Iran Languages English Native or bilingual proficiency Persian Native or bilingual proficiency Arabic Limited working proficiency Azerbaijani Full professional proficiency Turkish Limited working proficiency English Native or bilingual proficiency Persian Native or bilingual proficiency Arabic Limited working proficiency Azerbaijani Full professional proficiency Turkish Limited working proficiency English Native or bilingual proficiency Persian Native or bilingual proficiency Arabic Limited working proficiency Azerbaijani Full professional proficiency Turkish Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Full professional proficiency Limited working proficiency Skills Top Skills 15 Matlab 15 Data Analysis 12 C++ 11 R 10 Java 8 Mathematical Modeling 7 Microsoft Office 5 Operations Research 5 Simulations 4 Transportation... Ali also knows about... 3 Stochastic Optimization 1 Bloomberg 1 GAMS 1 Statistics Skills  Top Skills 15 Matlab 15 Data Analysis 12 C++ 11 R 10 Java 8 Mathematical Modeling 7 Microsoft Office 5 Operations Research 5 Simulations 4 Transportation... Ali also knows about... 3 Stochastic Optimization 1 Bloomberg 1 GAMS 1 Statistics Top Skills 15 Matlab 15 Data Analysis 12 C++ 11 R 10 Java 8 Mathematical Modeling 7 Microsoft Office 5 Operations Research 5 Simulations 4 Transportation... Ali also knows about... 3 Stochastic Optimization 1 Bloomberg 1 GAMS 1 Statistics Top Skills 15 Matlab 15 Data Analysis 12 C++ 11 R 10 Java 8 Mathematical Modeling 7 Microsoft Office 5 Operations Research 5 Simulations 4 Transportation... Ali also knows about... 3 Stochastic Optimization 1 Bloomberg 1 GAMS 1 Statistics                     3 Stochastic Optimization 1 Bloomberg 1 GAMS 1 Statistics Education UCLA Anderson School of Management Master of Financial Engineering 2014  – 2015 (Open) 4 courses Stochastic Calculus Econometrics Empirical Methods in Finance Derivatives See more Florida International University Doctor of Philosophy (Ph.D.),  Transportation Engineering 2010  – 2014 PhD Dissertation: Variable Speed Limit Strategies to Reduce the Impacts of Traffic Flow Breakdown at Recurrent Freeway Bottlenecks (Open) 1 test score GRE Quantitative 170 View (Open) 4 courses Fuzzy System Design Stochastic Optimization Algorithms and Topics Data Analysis See more Sharif University of Technology Master of Science (M.Sc.),  Transportation Engineering and Planning 2007  – 2010 Master Thesis: Solving Nonlinear Multicommodity Network Flow Problem by Penalty Function Methods (Open) 2 courses Operations Research Integer Programming See more Amirkabir University of Technology - Tehran Polytechnic Bachelor of Science (B.Sc.),  Civil Engineering 2003  – 2007 UCLA Anderson School of Management Master of Financial Engineering 2014  – 2015 (Open) 4 courses Stochastic Calculus Econometrics Empirical Methods in Finance Derivatives See more UCLA Anderson School of Management Master of Financial Engineering 2014  – 2015 (Open) 4 courses Stochastic Calculus Econometrics Empirical Methods in Finance Derivatives See more UCLA Anderson School of Management Master of Financial Engineering 2014  – 2015 (Open) 4 courses Stochastic Calculus Econometrics Empirical Methods in Finance Derivatives See more Florida International University Doctor of Philosophy (Ph.D.),  Transportation Engineering 2010  – 2014 PhD Dissertation: Variable Speed Limit Strategies to Reduce the Impacts of Traffic Flow Breakdown at Recurrent Freeway Bottlenecks (Open) 1 test score GRE Quantitative 170 View (Open) 4 courses Fuzzy System Design Stochastic Optimization Algorithms and Topics Data Analysis See more Florida International University Doctor of Philosophy (Ph.D.),  Transportation Engineering 2010  – 2014 PhD Dissertation: Variable Speed Limit Strategies to Reduce the Impacts of Traffic Flow Breakdown at Recurrent Freeway Bottlenecks (Open) 1 test score GRE Quantitative 170 View (Open) 4 courses Fuzzy System Design Stochastic Optimization Algorithms and Topics Data Analysis See more Florida International University Doctor of Philosophy (Ph.D.),  Transportation Engineering 2010  – 2014 PhD Dissertation: Variable Speed Limit Strategies to Reduce the Impacts of Traffic Flow Breakdown at Recurrent Freeway Bottlenecks (Open) 1 test score GRE Quantitative 170 View (Open) 4 courses Fuzzy System Design Stochastic Optimization Algorithms and Topics Data Analysis See more Sharif University of Technology Master of Science (M.Sc.),  Transportation Engineering and Planning 2007  – 2010 Master Thesis: Solving Nonlinear Multicommodity Network Flow Problem by Penalty Function Methods (Open) 2 courses Operations Research Integer Programming See more Sharif University of Technology Master of Science (M.Sc.),  Transportation Engineering and Planning 2007  – 2010 Master Thesis: Solving Nonlinear Multicommodity Network Flow Problem by Penalty Function Methods (Open) 2 courses Operations Research Integer Programming See more Sharif University of Technology Master of Science (M.Sc.),  Transportation Engineering and Planning 2007  – 2010 Master Thesis: Solving Nonlinear Multicommodity Network Flow Problem by Penalty Function Methods (Open) 2 courses Operations Research Integer Programming See more Amirkabir University of Technology - Tehran Polytechnic Bachelor of Science (B.Sc.),  Civil Engineering 2003  – 2007 Amirkabir University of Technology - Tehran Polytechnic Bachelor of Science (B.Sc.),  Civil Engineering 2003  – 2007 Amirkabir University of Technology - Tehran Polytechnic Bachelor of Science (B.Sc.),  Civil Engineering 2003  – 2007 ", "Experience Quantitative Analyst Intern UBS Securities Co., Ltd March 2015  – Present (5 months) Beijing City, China Devise a comprehensive set of tests on derivative valuation models to make sure they are sound under all market conditions. \nBuild financial libraries and tools to make forecasting models accessible by the traders and risk managers. \nTest trading strategies using historical market data, work with both clients and structurers to search for and substantiate trading ideas Quantitative Analyst Intern at Financial Engineering Department Founder Securities Co., Ltd. August 2014  –  December 2014  (5 months) Beijing City, China Collected and analyzed policies and related transaction data of private placement in China’s stock market. \nAnalyzed and predicted companies’ corresponding stock price movements in secondary market due to private placement classified by different offering targets and motivations. \nAnalyzed the characteristics of stocks which have strong short-term or long-term growth momentum after the ban of private placement was lifted and their price changes around important events during the offering process \n Quantitative Finance Research Consultant WorldQuant LLC April 2014  –  July 2014  (4 months) Beijing City, China Build models to predict the price changes of different equities from day to day mainly through using past 5 years’ fundamental and technical data of US Top 3000 equities. \nParticipate in designing the daily investment strategy Alpha to maximize the excess earnings. Quantitative Analyst Intern UBS Securities Co., Ltd March 2015  – Present (5 months) Beijing City, China Devise a comprehensive set of tests on derivative valuation models to make sure they are sound under all market conditions. \nBuild financial libraries and tools to make forecasting models accessible by the traders and risk managers. \nTest trading strategies using historical market data, work with both clients and structurers to search for and substantiate trading ideas Quantitative Analyst Intern UBS Securities Co., Ltd March 2015  – Present (5 months) Beijing City, China Devise a comprehensive set of tests on derivative valuation models to make sure they are sound under all market conditions. \nBuild financial libraries and tools to make forecasting models accessible by the traders and risk managers. \nTest trading strategies using historical market data, work with both clients and structurers to search for and substantiate trading ideas Quantitative Analyst Intern at Financial Engineering Department Founder Securities Co., Ltd. August 2014  –  December 2014  (5 months) Beijing City, China Collected and analyzed policies and related transaction data of private placement in China’s stock market. \nAnalyzed and predicted companies’ corresponding stock price movements in secondary market due to private placement classified by different offering targets and motivations. \nAnalyzed the characteristics of stocks which have strong short-term or long-term growth momentum after the ban of private placement was lifted and their price changes around important events during the offering process \n Quantitative Analyst Intern at Financial Engineering Department Founder Securities Co., Ltd. August 2014  –  December 2014  (5 months) Beijing City, China Collected and analyzed policies and related transaction data of private placement in China’s stock market. \nAnalyzed and predicted companies’ corresponding stock price movements in secondary market due to private placement classified by different offering targets and motivations. \nAnalyzed the characteristics of stocks which have strong short-term or long-term growth momentum after the ban of private placement was lifted and their price changes around important events during the offering process \n Quantitative Finance Research Consultant WorldQuant LLC April 2014  –  July 2014  (4 months) Beijing City, China Build models to predict the price changes of different equities from day to day mainly through using past 5 years’ fundamental and technical data of US Top 3000 equities. \nParticipate in designing the daily investment strategy Alpha to maximize the excess earnings. Quantitative Finance Research Consultant WorldQuant LLC April 2014  –  July 2014  (4 months) Beijing City, China Build models to predict the price changes of different equities from day to day mainly through using past 5 years’ fundamental and technical data of US Top 3000 equities. \nParticipate in designing the daily investment strategy Alpha to maximize the excess earnings. Skills 1 Microsoft Excel 0 Python 0 C++ 0 English 0 Communication Skills  1 Microsoft Excel 0 Python 0 C++ 0 English 0 Communication 1 Microsoft Excel 0 Python 0 C++ 0 English 0 Communication 1 Microsoft Excel 0 Python 0 C++ 0 English 0 Communication           Education BFSU Bachelor's degree,  Computer Science , 3.69/4.00 2010  – 2014 Research Experiences: \n \nResearch of Data acquisition and mining under the support of the National Natural Science Foundation of China under Grant No.61170209 and Program for New Century Excellent Talents in University No.NCET-13-0676; \nA New Clustering Model Based on Word2vec Mining on Sina Weibo Users’ Tags. [J] International Journal of Grid and Distributed Computing (ISSN:2005-4262)2014,(06). Indexed by EI Compendex. First author; \nMining on Emotional Trend of Specific Event on Sina Weibo. IEEE Proceedings of the 3rd International Congress on Big Data (EI indexed). First author Activities and Societies:  Volunteer Team leader at JA China.\nBronze Award of ‘Challenge Cup’ National College Students Entrepreneurship Competition. BFSU Bachelor's degree,  Computer Science , 3.69/4.00 2010  – 2014 Research Experiences: \n \nResearch of Data acquisition and mining under the support of the National Natural Science Foundation of China under Grant No.61170209 and Program for New Century Excellent Talents in University No.NCET-13-0676; \nA New Clustering Model Based on Word2vec Mining on Sina Weibo Users’ Tags. [J] International Journal of Grid and Distributed Computing (ISSN:2005-4262)2014,(06). Indexed by EI Compendex. First author; \nMining on Emotional Trend of Specific Event on Sina Weibo. IEEE Proceedings of the 3rd International Congress on Big Data (EI indexed). First author Activities and Societies:  Volunteer Team leader at JA China.\nBronze Award of ‘Challenge Cup’ National College Students Entrepreneurship Competition. BFSU Bachelor's degree,  Computer Science , 3.69/4.00 2010  – 2014 Research Experiences: \n \nResearch of Data acquisition and mining under the support of the National Natural Science Foundation of China under Grant No.61170209 and Program for New Century Excellent Talents in University No.NCET-13-0676; \nA New Clustering Model Based on Word2vec Mining on Sina Weibo Users’ Tags. [J] International Journal of Grid and Distributed Computing (ISSN:2005-4262)2014,(06). Indexed by EI Compendex. First author; \nMining on Emotional Trend of Specific Event on Sina Weibo. IEEE Proceedings of the 3rd International Congress on Big Data (EI indexed). First author Activities and Societies:  Volunteer Team leader at JA China.\nBronze Award of ‘Challenge Cup’ National College Students Entrepreneurship Competition. BFSU Bachelor's degree,  Computer Science , 3.69/4.00 2010  – 2014 Research Experiences: \n \nResearch of Data acquisition and mining under the support of the National Natural Science Foundation of China under Grant No.61170209 and Program for New Century Excellent Talents in University No.NCET-13-0676; \nA New Clustering Model Based on Word2vec Mining on Sina Weibo Users’ Tags. [J] International Journal of Grid and Distributed Computing (ISSN:2005-4262)2014,(06). Indexed by EI Compendex. First author; \nMining on Emotional Trend of Specific Event on Sina Weibo. IEEE Proceedings of the 3rd International Congress on Big Data (EI indexed). First author Activities and Societies:  Volunteer Team leader at JA China.\nBronze Award of ‘Challenge Cup’ National College Students Entrepreneurship Competition. ", "Summary Ph. D Candidate in Physics with 6 years' research experience on financial modeling and 1 year's internship experience in State Street Corporation Summary Ph. D Candidate in Physics with 6 years' research experience on financial modeling and 1 year's internship experience in State Street Corporation Ph. D Candidate in Physics with 6 years' research experience on financial modeling and 1 year's internship experience in State Street Corporation Ph. D Candidate in Physics with 6 years' research experience on financial modeling and 1 year's internship experience in State Street Corporation Experience Quantitative Analyst Intern, State Street Associates State Street January 2014  – Present (1 year 7 months) Greater Boston Area Comprehensive analytics on big datasets from Markit and DataLend \n \nPerforming Data download, security mapping and security lending fee modeling in Java, PL/SQL and Matlab Quantitative Analyst Intern, Enterprise Risk Management State Street June 2013  –  August 2013  (3 months) Greater Boston Area Explored the interaction between 920 macroeconomic indicators across 34 countries and crisis from 1980 to 2013 using statistical analysis and technical analysis \n \nDeveloped and tested parametric and signaling methods to forecast sovereign risk, calculated in Matlab and Excel VBA Quantitative Analyst Intern, State Street Associates State Street October 2012  –  April 2013  (7 months) Greater Boston Area Comprehensive analytics on ETF flow indicator \n \nDesigned and managed a relational database for 8264 ETFs and 2116 indices \n \nDeveloped algorithms and implemented calculations for ETF matching, selection, data quality check and tracking error check in PL/SQL and Matlab \n \nWorked with IT group to automate data download and wrote technical documentation for ETF database Quantitative Analyst Intern, State Street Associates State Street January 2014  – Present (1 year 7 months) Greater Boston Area Comprehensive analytics on big datasets from Markit and DataLend \n \nPerforming Data download, security mapping and security lending fee modeling in Java, PL/SQL and Matlab Quantitative Analyst Intern, State Street Associates State Street January 2014  – Present (1 year 7 months) Greater Boston Area Comprehensive analytics on big datasets from Markit and DataLend \n \nPerforming Data download, security mapping and security lending fee modeling in Java, PL/SQL and Matlab Quantitative Analyst Intern, Enterprise Risk Management State Street June 2013  –  August 2013  (3 months) Greater Boston Area Explored the interaction between 920 macroeconomic indicators across 34 countries and crisis from 1980 to 2013 using statistical analysis and technical analysis \n \nDeveloped and tested parametric and signaling methods to forecast sovereign risk, calculated in Matlab and Excel VBA Quantitative Analyst Intern, Enterprise Risk Management State Street June 2013  –  August 2013  (3 months) Greater Boston Area Explored the interaction between 920 macroeconomic indicators across 34 countries and crisis from 1980 to 2013 using statistical analysis and technical analysis \n \nDeveloped and tested parametric and signaling methods to forecast sovereign risk, calculated in Matlab and Excel VBA Quantitative Analyst Intern, State Street Associates State Street October 2012  –  April 2013  (7 months) Greater Boston Area Comprehensive analytics on ETF flow indicator \n \nDesigned and managed a relational database for 8264 ETFs and 2116 indices \n \nDeveloped algorithms and implemented calculations for ETF matching, selection, data quality check and tracking error check in PL/SQL and Matlab \n \nWorked with IT group to automate data download and wrote technical documentation for ETF database Quantitative Analyst Intern, State Street Associates State Street October 2012  –  April 2013  (7 months) Greater Boston Area Comprehensive analytics on ETF flow indicator \n \nDesigned and managed a relational database for 8264 ETFs and 2116 indices \n \nDeveloped algorithms and implemented calculations for ETF matching, selection, data quality check and tracking error check in PL/SQL and Matlab \n \nWorked with IT group to automate data download and wrote technical documentation for ETF database Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Top Skills 9 R 9 Time Series Analysis 7 Quantitative Analytics 5 Econometrics 5 VBA 2 Portfolio Optimization 2 Matlab 2 SQL 2 Monte Carlo Simulation 2 Statistics Duan also knows about... 1 Quantitative Finance 1 PL/SQL 1 S-Plus 1 C++ 1 Java 1 Machine Learning 1 Database Design 1 Portfolio Management 1 Financial Modeling 0 Derivatives 0 Credit Risk 0 Bloomberg 0 Datastream 0 Physics 0 Stochastic Calculus 0 Analytics 0 Fixed Income 0 Statistical Modeling See 3+     See less Skills  Top Skills 9 R 9 Time Series Analysis 7 Quantitative Analytics 5 Econometrics 5 VBA 2 Portfolio Optimization 2 Matlab 2 SQL 2 Monte Carlo Simulation 2 Statistics Duan also knows about... 1 Quantitative Finance 1 PL/SQL 1 S-Plus 1 C++ 1 Java 1 Machine Learning 1 Database Design 1 Portfolio Management 1 Financial Modeling 0 Derivatives 0 Credit Risk 0 Bloomberg 0 Datastream 0 Physics 0 Stochastic Calculus 0 Analytics 0 Fixed Income 0 Statistical Modeling See 3+     See less Top Skills 9 R 9 Time Series Analysis 7 Quantitative Analytics 5 Econometrics 5 VBA 2 Portfolio Optimization 2 Matlab 2 SQL 2 Monte Carlo Simulation 2 Statistics Duan also knows about... 1 Quantitative Finance 1 PL/SQL 1 S-Plus 1 C++ 1 Java 1 Machine Learning 1 Database Design 1 Portfolio Management 1 Financial Modeling 0 Derivatives 0 Credit Risk 0 Bloomberg 0 Datastream 0 Physics 0 Stochastic Calculus 0 Analytics 0 Fixed Income 0 Statistical Modeling See 3+     See less Top Skills 9 R 9 Time Series Analysis 7 Quantitative Analytics 5 Econometrics 5 VBA 2 Portfolio Optimization 2 Matlab 2 SQL 2 Monte Carlo Simulation 2 Statistics Duan also knows about... 1 Quantitative Finance 1 PL/SQL 1 S-Plus 1 C++ 1 Java 1 Machine Learning 1 Database Design 1 Portfolio Management 1 Financial Modeling 0 Derivatives 0 Credit Risk 0 Bloomberg 0 Datastream 0 Physics 0 Stochastic Calculus 0 Analytics 0 Fixed Income 0 Statistical Modeling See 3+     See less                     1 Quantitative Finance 1 PL/SQL 1 S-Plus 1 C++ 1 Java 1 Machine Learning 1 Database Design 1 Portfolio Management 1 Financial Modeling 0 Derivatives 0 Credit Risk 0 Bloomberg 0 Datastream 0 Physics 0 Stochastic Calculus 0 Analytics 0 Fixed Income 0 Statistical Modeling Education Boston University Ph.D,  Physics (Research on Financial Modeling) 2007  – 2014 Research on financial data analysis and modeling \n \nPublished 4 papers, cited more than 100 times \n \nCourses: C++, Computational Physics, Time Series Analysis, Stochastic Calculus, Monte Carlo Simulation, Machine Learning (Open) 3 projects Agent-Based Model Implemented Monte Carlo simulation for interactions between technical stock traders with different strategies\nConstructed... View Time Series Models and Portfolio Optimization Proposed a multifactor model based on random matrix theory to quantify correlations in multivariate time series\nProposed a... View Intraday News Analyzed influence of 222 intraday news on trends, volatilities and correlations in minute returns of 39 most frequently... View Nanjing University Bachelor's degree,  Physics 2003  – 2007 People’s Scholarships for 4 consecutive years \n \n1st grade award, Academic Research Scholarship  \n \nOutstanding Student Leader in Nanjing University Boston University Ph.D,  Physics (Research on Financial Modeling) 2007  – 2014 Research on financial data analysis and modeling \n \nPublished 4 papers, cited more than 100 times \n \nCourses: C++, Computational Physics, Time Series Analysis, Stochastic Calculus, Monte Carlo Simulation, Machine Learning (Open) 3 projects Agent-Based Model Implemented Monte Carlo simulation for interactions between technical stock traders with different strategies\nConstructed... View Time Series Models and Portfolio Optimization Proposed a multifactor model based on random matrix theory to quantify correlations in multivariate time series\nProposed a... View Intraday News Analyzed influence of 222 intraday news on trends, volatilities and correlations in minute returns of 39 most frequently... View Boston University Ph.D,  Physics (Research on Financial Modeling) 2007  – 2014 Research on financial data analysis and modeling \n \nPublished 4 papers, cited more than 100 times \n \nCourses: C++, Computational Physics, Time Series Analysis, Stochastic Calculus, Monte Carlo Simulation, Machine Learning (Open) 3 projects Agent-Based Model Implemented Monte Carlo simulation for interactions between technical stock traders with different strategies\nConstructed... View Time Series Models and Portfolio Optimization Proposed a multifactor model based on random matrix theory to quantify correlations in multivariate time series\nProposed a... View Intraday News Analyzed influence of 222 intraday news on trends, volatilities and correlations in minute returns of 39 most frequently... View Boston University Ph.D,  Physics (Research on Financial Modeling) 2007  – 2014 Research on financial data analysis and modeling \n \nPublished 4 papers, cited more than 100 times \n \nCourses: C++, Computational Physics, Time Series Analysis, Stochastic Calculus, Monte Carlo Simulation, Machine Learning (Open) 3 projects Agent-Based Model Implemented Monte Carlo simulation for interactions between technical stock traders with different strategies\nConstructed... View Time Series Models and Portfolio Optimization Proposed a multifactor model based on random matrix theory to quantify correlations in multivariate time series\nProposed a... View Intraday News Analyzed influence of 222 intraday news on trends, volatilities and correlations in minute returns of 39 most frequently... View Nanjing University Bachelor's degree,  Physics 2003  – 2007 People’s Scholarships for 4 consecutive years \n \n1st grade award, Academic Research Scholarship  \n \nOutstanding Student Leader in Nanjing University Nanjing University Bachelor's degree,  Physics 2003  – 2007 People’s Scholarships for 4 consecutive years \n \n1st grade award, Academic Research Scholarship  \n \nOutstanding Student Leader in Nanjing University Nanjing University Bachelor's degree,  Physics 2003  – 2007 People’s Scholarships for 4 consecutive years \n \n1st grade award, Academic Research Scholarship  \n \nOutstanding Student Leader in Nanjing University Honors & Awards 1st grade award, National High School Physics Competition, Jilin division Chinese Physical Society October 2002 1st grade award, National High School Physics Competition, Jilin division Chinese Physical Society October 2002 1st grade award, National High School Physics Competition, Jilin division Chinese Physical Society October 2002 1st grade award, National High School Physics Competition, Jilin division Chinese Physical Society October 2002 ", "Experience Quantitative Analyst Intern AGRITEL Quantitative Analyst Intern AGRITEL Quantitative Analyst Intern AGRITEL Skills Skills     ", "Summary Interested in Financial engineering and quantitative analysis. Summary Interested in Financial engineering and quantitative analysis. Interested in Financial engineering and quantitative analysis. Interested in Financial engineering and quantitative analysis. Experience quantitative analyst intern Hua An Fund Management Co. Ltd. June 2014  –  November 2014  (6 months) Shanghai City, China quantitative analyst intern Haitong Securities January 2014  –  May 2014  (5 months) Shanghai City, China Research on quantitative stock selection strategies, and have completed a report. \nThe financial engineering group of Haitong Securities is an excellent team ranked NO.1 last year. research analyst intern Essence Securities Co., Ltd July 2013  –  August 2013  (2 months) Shanghai City, China Assistant of Industry Research in Consumer goods quantitative analyst intern Longqi Scientific Investment October 2012  –  June 2013  (9 months) Hangzhou, Zhejiang, China Research on risk model and quantitative strategy involved in stocks, coding with R for more than 20000 rows, coding with SQL; have a good knowledge about stocks and futures. quantitative analyst intern Hua An Fund Management Co. Ltd. June 2014  –  November 2014  (6 months) Shanghai City, China quantitative analyst intern Hua An Fund Management Co. Ltd. June 2014  –  November 2014  (6 months) Shanghai City, China quantitative analyst intern Haitong Securities January 2014  –  May 2014  (5 months) Shanghai City, China Research on quantitative stock selection strategies, and have completed a report. \nThe financial engineering group of Haitong Securities is an excellent team ranked NO.1 last year. quantitative analyst intern Haitong Securities January 2014  –  May 2014  (5 months) Shanghai City, China Research on quantitative stock selection strategies, and have completed a report. \nThe financial engineering group of Haitong Securities is an excellent team ranked NO.1 last year. research analyst intern Essence Securities Co., Ltd July 2013  –  August 2013  (2 months) Shanghai City, China Assistant of Industry Research in Consumer goods research analyst intern Essence Securities Co., Ltd July 2013  –  August 2013  (2 months) Shanghai City, China Assistant of Industry Research in Consumer goods quantitative analyst intern Longqi Scientific Investment October 2012  –  June 2013  (9 months) Hangzhou, Zhejiang, China Research on risk model and quantitative strategy involved in stocks, coding with R for more than 20000 rows, coding with SQL; have a good knowledge about stocks and futures. quantitative analyst intern Longqi Scientific Investment October 2012  –  June 2013  (9 months) Hangzhou, Zhejiang, China Research on risk model and quantitative strategy involved in stocks, coding with R for more than 20000 rows, coding with SQL; have a good knowledge about stocks and futures. Languages Chinese Native or bilingual proficiency English Chinese Native or bilingual proficiency English Chinese Native or bilingual proficiency English Native or bilingual proficiency Skills Top Skills 10 R 8 Matlab 7 Financial Modeling 6 Microsoft Office 6 Teamwork 6 Quantitative Analytics 5 SAS programming 5 Financial Engineering 4 Time Series Analysis 4 Statistics Linlin also knows about... 3 Statistical Data... 2 Photoshop 2 SQL 2 SAS Programming Skills  Top Skills 10 R 8 Matlab 7 Financial Modeling 6 Microsoft Office 6 Teamwork 6 Quantitative Analytics 5 SAS programming 5 Financial Engineering 4 Time Series Analysis 4 Statistics Linlin also knows about... 3 Statistical Data... 2 Photoshop 2 SQL 2 SAS Programming Top Skills 10 R 8 Matlab 7 Financial Modeling 6 Microsoft Office 6 Teamwork 6 Quantitative Analytics 5 SAS programming 5 Financial Engineering 4 Time Series Analysis 4 Statistics Linlin also knows about... 3 Statistical Data... 2 Photoshop 2 SQL 2 SAS Programming Top Skills 10 R 8 Matlab 7 Financial Modeling 6 Microsoft Office 6 Teamwork 6 Quantitative Analytics 5 SAS programming 5 Financial Engineering 4 Time Series Analysis 4 Statistics Linlin also knows about... 3 Statistical Data... 2 Photoshop 2 SQL 2 SAS Programming                     3 Statistical Data... 2 Photoshop 2 SQL 2 SAS Programming Education Fudan University Master's degree,  Financial engineering 2013  – 2015 (Open) 1 project The Simulated Investment Competition Learn from Xu Youhua, fund manager of Fullgoal Fund Management Co., Ltd.\nServed as captain, learn knowledge of investment and report writing View (Open) 13 courses, including: corporate finance Advanced Microeconomics Asset pricing fixed income Advanced portfolio theory Quantative Analysis of Chinese stock market Financial Econometrics Advanced Financial Econometrics Financial calculation method Options,futuresandotherderivatives See more 3 more courses Zhejiang University Bachelor of Science (B.S.),  Statistics , GPA 3.98/4.00 2009  – 2013 (Open) 4 projects Exchange Program of Internationale Nederlanden Group in HongKong View Statistical project design competition of Zhejiang province Win the first prize.\nServed as captain, research on social recognition of Specialized Master. View Student research program Research on Credit Risk Assessment Study Based on Markov Chain Models, and wrote a thesis. View The energy conservation and emissions reduction competition The first prize in the fourth energy conservation and emissions reduction competition of Zhejiang University; The Second... View (Open) 3 honors and awards National Scholarship top 2% View First-class scholarship of Zhejiang University (three times) Outstanding student of first-class scholarship of Zhejiang University for three consecutive years\n2010、2011 and 2012\ntop 3%... View Outstanding graduate of Zhejiang Province top 3% View (Open) 24 courses, including: mathematical analysis advanced algebra numerical calculation method java Physics probability theory Mathematical statistics Functions of Real Variable Differentiable manifold Stochastic Process See more 14 more courses Zhejiang University Minor degree,  Public Administration 2009  – 2013 Minor in Public Administration of Chu Cochen Honors College of Zhejiang University. (Open) 1 organization Undergraduate of Public Administration (UPA), Chu Kochen Honors College View (Open) 11 courses, including: strategic management Microeconomics Public economics Public policy analysis Decision Science public management Politics administrative jurisprudence Ethics Chinese government and politics See more 1 more course Fudan University Master's degree,  Financial engineering 2013  – 2015 (Open) 1 project The Simulated Investment Competition Learn from Xu Youhua, fund manager of Fullgoal Fund Management Co., Ltd.\nServed as captain, learn knowledge of investment and report writing View (Open) 13 courses, including: corporate finance Advanced Microeconomics Asset pricing fixed income Advanced portfolio theory Quantative Analysis of Chinese stock market Financial Econometrics Advanced Financial Econometrics Financial calculation method Options,futuresandotherderivatives See more 3 more courses Fudan University Master's degree,  Financial engineering 2013  – 2015 (Open) 1 project The Simulated Investment Competition Learn from Xu Youhua, fund manager of Fullgoal Fund Management Co., Ltd.\nServed as captain, learn knowledge of investment and report writing View (Open) 13 courses, including: corporate finance Advanced Microeconomics Asset pricing fixed income Advanced portfolio theory Quantative Analysis of Chinese stock market Financial Econometrics Advanced Financial Econometrics Financial calculation method Options,futuresandotherderivatives See more 3 more courses Fudan University Master's degree,  Financial engineering 2013  – 2015 (Open) 1 project The Simulated Investment Competition Learn from Xu Youhua, fund manager of Fullgoal Fund Management Co., Ltd.\nServed as captain, learn knowledge of investment and report writing View (Open) 13 courses, including: corporate finance Advanced Microeconomics Asset pricing fixed income Advanced portfolio theory Quantative Analysis of Chinese stock market Financial Econometrics Advanced Financial Econometrics Financial calculation method Options,futuresandotherderivatives See more 3 more courses Zhejiang University Bachelor of Science (B.S.),  Statistics , GPA 3.98/4.00 2009  – 2013 (Open) 4 projects Exchange Program of Internationale Nederlanden Group in HongKong View Statistical project design competition of Zhejiang province Win the first prize.\nServed as captain, research on social recognition of Specialized Master. View Student research program Research on Credit Risk Assessment Study Based on Markov Chain Models, and wrote a thesis. View The energy conservation and emissions reduction competition The first prize in the fourth energy conservation and emissions reduction competition of Zhejiang University; The Second... View (Open) 3 honors and awards National Scholarship top 2% View First-class scholarship of Zhejiang University (three times) Outstanding student of first-class scholarship of Zhejiang University for three consecutive years\n2010、2011 and 2012\ntop 3%... View Outstanding graduate of Zhejiang Province top 3% View (Open) 24 courses, including: mathematical analysis advanced algebra numerical calculation method java Physics probability theory Mathematical statistics Functions of Real Variable Differentiable manifold Stochastic Process See more 14 more courses Zhejiang University Bachelor of Science (B.S.),  Statistics , GPA 3.98/4.00 2009  – 2013 (Open) 4 projects Exchange Program of Internationale Nederlanden Group in HongKong View Statistical project design competition of Zhejiang province Win the first prize.\nServed as captain, research on social recognition of Specialized Master. View Student research program Research on Credit Risk Assessment Study Based on Markov Chain Models, and wrote a thesis. View The energy conservation and emissions reduction competition The first prize in the fourth energy conservation and emissions reduction competition of Zhejiang University; The Second... View (Open) 3 honors and awards National Scholarship top 2% View First-class scholarship of Zhejiang University (three times) Outstanding student of first-class scholarship of Zhejiang University for three consecutive years\n2010、2011 and 2012\ntop 3%... View Outstanding graduate of Zhejiang Province top 3% View (Open) 24 courses, including: mathematical analysis advanced algebra numerical calculation method java Physics probability theory Mathematical statistics Functions of Real Variable Differentiable manifold Stochastic Process See more 14 more courses Zhejiang University Bachelor of Science (B.S.),  Statistics , GPA 3.98/4.00 2009  – 2013 (Open) 4 projects Exchange Program of Internationale Nederlanden Group in HongKong View Statistical project design competition of Zhejiang province Win the first prize.\nServed as captain, research on social recognition of Specialized Master. View Student research program Research on Credit Risk Assessment Study Based on Markov Chain Models, and wrote a thesis. View The energy conservation and emissions reduction competition The first prize in the fourth energy conservation and emissions reduction competition of Zhejiang University; The Second... View (Open) 3 honors and awards National Scholarship top 2% View First-class scholarship of Zhejiang University (three times) Outstanding student of first-class scholarship of Zhejiang University for three consecutive years\n2010、2011 and 2012\ntop 3%... View Outstanding graduate of Zhejiang Province top 3% View (Open) 24 courses, including: mathematical analysis advanced algebra numerical calculation method java Physics probability theory Mathematical statistics Functions of Real Variable Differentiable manifold Stochastic Process See more 14 more courses Zhejiang University Minor degree,  Public Administration 2009  – 2013 Minor in Public Administration of Chu Cochen Honors College of Zhejiang University. (Open) 1 organization Undergraduate of Public Administration (UPA), Chu Kochen Honors College View (Open) 11 courses, including: strategic management Microeconomics Public economics Public policy analysis Decision Science public management Politics administrative jurisprudence Ethics Chinese government and politics See more 1 more course Zhejiang University Minor degree,  Public Administration 2009  – 2013 Minor in Public Administration of Chu Cochen Honors College of Zhejiang University. (Open) 1 organization Undergraduate of Public Administration (UPA), Chu Kochen Honors College View (Open) 11 courses, including: strategic management Microeconomics Public economics Public policy analysis Decision Science public management Politics administrative jurisprudence Ethics Chinese government and politics See more 1 more course Zhejiang University Minor degree,  Public Administration 2009  – 2013 Minor in Public Administration of Chu Cochen Honors College of Zhejiang University. (Open) 1 organization Undergraduate of Public Administration (UPA), Chu Kochen Honors College View (Open) 11 courses, including: strategic management Microeconomics Public economics Public policy analysis Decision Science public management Politics administrative jurisprudence Ethics Chinese government and politics See more 1 more course Honors & Awards National Scholarship Ministry of Education of the People's Republic of China October 2010 top 2% First-class scholarship of Zhejiang University (three times) Zhejiang University Outstanding student of first-class scholarship of Zhejiang University for three consecutive years \n2010、2011 and 2012 \ntop 3% \n \n Outstanding graduate of Zhejiang Province Provincial Education Department of Zhejiang May 2013 top 3% National Scholarship Ministry of Education of the People's Republic of China October 2010 top 2% National Scholarship Ministry of Education of the People's Republic of China October 2010 top 2% National Scholarship Ministry of Education of the People's Republic of China October 2010 top 2% First-class scholarship of Zhejiang University (three times) Zhejiang University Outstanding student of first-class scholarship of Zhejiang University for three consecutive years \n2010、2011 and 2012 \ntop 3% \n \n First-class scholarship of Zhejiang University (three times) Zhejiang University Outstanding student of first-class scholarship of Zhejiang University for three consecutive years \n2010、2011 and 2012 \ntop 3% \n \n First-class scholarship of Zhejiang University (three times) Zhejiang University Outstanding student of first-class scholarship of Zhejiang University for three consecutive years \n2010、2011 and 2012 \ntop 3% \n \n Outstanding graduate of Zhejiang Province Provincial Education Department of Zhejiang May 2013 top 3% Outstanding graduate of Zhejiang Province Provincial Education Department of Zhejiang May 2013 top 3% Outstanding graduate of Zhejiang Province Provincial Education Department of Zhejiang May 2013 top 3% ", "Experience Quantitative Analyst Intern Guotai Junan Securities Futures Co., Ltd September 2012  – Present (2 years 11 months) Intern Everbright Securities June 2012  –  September 2012  (4 months) Shanghai Comercial manager assistant Alcatel-Lucent May 2011  –  August 2011  (4 months) Shanghai China Quantitative Analyst Intern Guotai Junan Securities Futures Co., Ltd September 2012  – Present (2 years 11 months) Quantitative Analyst Intern Guotai Junan Securities Futures Co., Ltd September 2012  – Present (2 years 11 months) Intern Everbright Securities June 2012  –  September 2012  (4 months) Shanghai Intern Everbright Securities June 2012  –  September 2012  (4 months) Shanghai Comercial manager assistant Alcatel-Lucent May 2011  –  August 2011  (4 months) Shanghai China Comercial manager assistant Alcatel-Lucent May 2011  –  August 2011  (4 months) Shanghai China Skills Skills     Education University of Limerick Master,  Computational Finance 2011  – 2012 Activities and Societies:  Focus Ireland Volunteer for Fundraising Event Tongji University Master,  International Trade 2010  – 2013 Harbin Engineering University Bachelor,  Economics 2006  – 2010 Activities and Societies:  Student Union ,  Students In Free Enterprise(non-profit organization ) ,  Engineering Weekly ,  Model United Nations University of Limerick Master,  Computational Finance 2011  – 2012 Activities and Societies:  Focus Ireland Volunteer for Fundraising Event University of Limerick Master,  Computational Finance 2011  – 2012 Activities and Societies:  Focus Ireland Volunteer for Fundraising Event University of Limerick Master,  Computational Finance 2011  – 2012 Activities and Societies:  Focus Ireland Volunteer for Fundraising Event Tongji University Master,  International Trade 2010  – 2013 Tongji University Master,  International Trade 2010  – 2013 Tongji University Master,  International Trade 2010  – 2013 Harbin Engineering University Bachelor,  Economics 2006  – 2010 Activities and Societies:  Student Union ,  Students In Free Enterprise(non-profit organization ) ,  Engineering Weekly ,  Model United Nations Harbin Engineering University Bachelor,  Economics 2006  – 2010 Activities and Societies:  Student Union ,  Students In Free Enterprise(non-profit organization ) ,  Engineering Weekly ,  Model United Nations Harbin Engineering University Bachelor,  Economics 2006  – 2010 Activities and Societies:  Student Union ,  Students In Free Enterprise(non-profit organization ) ,  Engineering Weekly ,  Model United Nations ", "Summary Financial Modeling for great teams \nDerivatives pricing&analysis \nFinancial data processing Specialties:Derivatives pricing&analysis, Financial data processing \nFinancial Modeling，econometrics, time-series analysis, Monte Carlo simulation, statistical arbitrage, portfolio management \nC&C++,SAS, MATLAB,Perl,SPSS,EViews,EXCEL,VBA Summary Financial Modeling for great teams \nDerivatives pricing&analysis \nFinancial data processing Specialties:Derivatives pricing&analysis, Financial data processing \nFinancial Modeling，econometrics, time-series analysis, Monte Carlo simulation, statistical arbitrage, portfolio management \nC&C++,SAS, MATLAB,Perl,SPSS,EViews,EXCEL,VBA Financial Modeling for great teams \nDerivatives pricing&analysis \nFinancial data processing Specialties:Derivatives pricing&analysis, Financial data processing \nFinancial Modeling，econometrics, time-series analysis, Monte Carlo simulation, statistical arbitrage, portfolio management \nC&C++,SAS, MATLAB,Perl,SPSS,EViews,EXCEL,VBA Financial Modeling for great teams \nDerivatives pricing&analysis \nFinancial data processing Specialties:Derivatives pricing&analysis, Financial data processing \nFinancial Modeling，econometrics, time-series analysis, Monte Carlo simulation, statistical arbitrage, portfolio management \nC&C++,SAS, MATLAB,Perl,SPSS,EViews,EXCEL,VBA Experience Fixed Income Intern UBS Securities Co., Ltd May 2013  – Present (2 years 3 months) Beijing Sales and Research FM Quantitative Analyst Intern CICC September 2011  – Present (3 years 11 months) Buyside quantitative analysis  \nPortfolio Performance Attribution System design Sales and Trading Quantitative Analyst Intern CICC October 2012  –  April 2013  (7 months) Beijing Internship Goldman Sachs February 2011  –  February 2011  (1 month) The most issue of convertible bonds of SINOPEC Summer intern James & Hina Capital Management Co.,Ltd August 2010  –  September 2010  (2 months) PE research and analysis Summer intern Bank of Communications Limited July 2010  –  August 2010  (2 months) Finance and Foreign exchange business with corporates Fixed Income Intern UBS Securities Co., Ltd May 2013  – Present (2 years 3 months) Beijing Sales and Research Fixed Income Intern UBS Securities Co., Ltd May 2013  – Present (2 years 3 months) Beijing Sales and Research FM Quantitative Analyst Intern CICC September 2011  – Present (3 years 11 months) Buyside quantitative analysis  \nPortfolio Performance Attribution System design FM Quantitative Analyst Intern CICC September 2011  – Present (3 years 11 months) Buyside quantitative analysis  \nPortfolio Performance Attribution System design Sales and Trading Quantitative Analyst Intern CICC October 2012  –  April 2013  (7 months) Beijing Sales and Trading Quantitative Analyst Intern CICC October 2012  –  April 2013  (7 months) Beijing Internship Goldman Sachs February 2011  –  February 2011  (1 month) The most issue of convertible bonds of SINOPEC Internship Goldman Sachs February 2011  –  February 2011  (1 month) The most issue of convertible bonds of SINOPEC Summer intern James & Hina Capital Management Co.,Ltd August 2010  –  September 2010  (2 months) PE research and analysis Summer intern James & Hina Capital Management Co.,Ltd August 2010  –  September 2010  (2 months) PE research and analysis Summer intern Bank of Communications Limited July 2010  –  August 2010  (2 months) Finance and Foreign exchange business with corporates Summer intern Bank of Communications Limited July 2010  –  August 2010  (2 months) Finance and Foreign exchange business with corporates Languages English English English Skills Top Skills 6 Derivatives 4 Fixed Income 4 Quantitative Analytics 3 VBA 2 Time Series Analysis 2 Monte Carlo Simulation 2 Eviews 2 Matlab 2 Financial Modeling 1 SAS Chengwei also knows about... 1 Portfolio Management 1 Quantitative Finance 1 Stochastic Calculus 1 Bloomberg 1 Stata 0 SPSS 0 Statistical Arbitrage 0 Excel 0 Perl 0 Econometrics 0 R 0 Quantitative Analysis 0 VAR 0 Quantitative Modeling 0 Financial Engineering 0 Options Pricing 0 Quant 0 S-Plus 0 Portfolio Optimization 0 Volatility 0 Stochastic Processes 0 Options 0 Probability 0 Trading Strategies 0 Model Validation 0 Market Risk 0 Credit Derivatives See 12+     See less Skills  Top Skills 6 Derivatives 4 Fixed Income 4 Quantitative Analytics 3 VBA 2 Time Series Analysis 2 Monte Carlo Simulation 2 Eviews 2 Matlab 2 Financial Modeling 1 SAS Chengwei also knows about... 1 Portfolio Management 1 Quantitative Finance 1 Stochastic Calculus 1 Bloomberg 1 Stata 0 SPSS 0 Statistical Arbitrage 0 Excel 0 Perl 0 Econometrics 0 R 0 Quantitative Analysis 0 VAR 0 Quantitative Modeling 0 Financial Engineering 0 Options Pricing 0 Quant 0 S-Plus 0 Portfolio Optimization 0 Volatility 0 Stochastic Processes 0 Options 0 Probability 0 Trading Strategies 0 Model Validation 0 Market Risk 0 Credit Derivatives See 12+     See less Top Skills 6 Derivatives 4 Fixed Income 4 Quantitative Analytics 3 VBA 2 Time Series Analysis 2 Monte Carlo Simulation 2 Eviews 2 Matlab 2 Financial Modeling 1 SAS Chengwei also knows about... 1 Portfolio Management 1 Quantitative Finance 1 Stochastic Calculus 1 Bloomberg 1 Stata 0 SPSS 0 Statistical Arbitrage 0 Excel 0 Perl 0 Econometrics 0 R 0 Quantitative Analysis 0 VAR 0 Quantitative Modeling 0 Financial Engineering 0 Options Pricing 0 Quant 0 S-Plus 0 Portfolio Optimization 0 Volatility 0 Stochastic Processes 0 Options 0 Probability 0 Trading Strategies 0 Model Validation 0 Market Risk 0 Credit Derivatives See 12+     See less Top Skills 6 Derivatives 4 Fixed Income 4 Quantitative Analytics 3 VBA 2 Time Series Analysis 2 Monte Carlo Simulation 2 Eviews 2 Matlab 2 Financial Modeling 1 SAS Chengwei also knows about... 1 Portfolio Management 1 Quantitative Finance 1 Stochastic Calculus 1 Bloomberg 1 Stata 0 SPSS 0 Statistical Arbitrage 0 Excel 0 Perl 0 Econometrics 0 R 0 Quantitative Analysis 0 VAR 0 Quantitative Modeling 0 Financial Engineering 0 Options Pricing 0 Quant 0 S-Plus 0 Portfolio Optimization 0 Volatility 0 Stochastic Processes 0 Options 0 Probability 0 Trading Strategies 0 Model Validation 0 Market Risk 0 Credit Derivatives See 12+     See less                     1 Portfolio Management 1 Quantitative Finance 1 Stochastic Calculus 1 Bloomberg 1 Stata 0 SPSS 0 Statistical Arbitrage 0 Excel 0 Perl 0 Econometrics 0 R 0 Quantitative Analysis 0 VAR 0 Quantitative Modeling 0 Financial Engineering 0 Options Pricing 0 Quant 0 S-Plus 0 Portfolio Optimization 0 Volatility 0 Stochastic Processes 0 Options 0 Probability 0 Trading Strategies 0 Model Validation 0 Market Risk 0 Credit Derivatives Education Peking University Msc in Finance,  Finance 2012  – 2014 University of International Business and Economics BS,  Financial Engineering 2008  – 2011 Peking University Msc in Finance,  Finance 2012  – 2014 Peking University Msc in Finance,  Finance 2012  – 2014 Peking University Msc in Finance,  Finance 2012  – 2014 University of International Business and Economics BS,  Financial Engineering 2008  – 2011 University of International Business and Economics BS,  Financial Engineering 2008  – 2011 University of International Business and Economics BS,  Financial Engineering 2008  – 2011 ", "Experience Quantitative Analyst Intern Twenty20 Investments July 2015  – Present (1 month) London, United Kingdom Graduate High Frequency Trading Intern Pilotware Ltd December 2014  –  June 2015  (7 months) London 1. Created new trading data warehouse by organising, structuring and storing the trading records and portfolio status information, making scattered data being available for advanced analytical and statistical research. \n2. Independently developed protocol of external risk management system, which is able to monitor portfolio performance and order status in real time and make decision when trading limits being touched. \n3. Proactively participated to improving the performance of order management system, especially optimizing order tracking process and developing cache to dynamically store order status and order reports.  \n \n Quantitative Risk Research Student Imperial College London April 2014  –  August 2014  (5 months) London, United Kingdom Risk Research Student, supervised by Prof. Paolo Zaffaroni \n•\tCompleted the working paper “application of multivariate Copula-GARCH Model in the Risk Management of Portfolio”, which can be extensively applied into the risk analysis of multiple asset classes and strategies. \n•\tDiscovered the risk contagion pattern in global market based on macro-economic behaviour analysis and advanced statistical analysis on the performance of major market indices in different economic environments. \n•\tDeveloped time-varying and tail-structure changing Copulas-GARCH models to analyse big amount of data set and generate the return prediction of asset portfolios and corresponding multiple market risk measures. \n•\tConducted back-testing on various risk measures under 252-day moving and fixed windows, and concluded that GARCH-Copula methods could improve loss coverage accuracy via reducing failure rate by 15% \n Sales Intern Santander Bank, N.A. October 2013  –  March 2014  (6 months) London, United Kingdom Boosted the campus client base by 25% and enhanced the popularity of Santander Bank by proactively promoting and providing tailored advices on bank products for clients Summer Financial Analyst Huatai Great Wall Futures July 2012  –  October 2012  (4 months) Tianjin City, China 1. Developed the cost projection model for Financing Copper Trading Strategy by using VBA, and collaborated with trading desk to analyse the price volatilities of copper future contracts \n2. Involved in the project of “Financing Copper” Strategy and completed the ‘Financing Copper in China’ report which was published on the Monthly Markets Review \n Quantitative Analyst Intern Twenty20 Investments July 2015  – Present (1 month) London, United Kingdom Quantitative Analyst Intern Twenty20 Investments July 2015  – Present (1 month) London, United Kingdom Graduate High Frequency Trading Intern Pilotware Ltd December 2014  –  June 2015  (7 months) London 1. Created new trading data warehouse by organising, structuring and storing the trading records and portfolio status information, making scattered data being available for advanced analytical and statistical research. \n2. Independently developed protocol of external risk management system, which is able to monitor portfolio performance and order status in real time and make decision when trading limits being touched. \n3. Proactively participated to improving the performance of order management system, especially optimizing order tracking process and developing cache to dynamically store order status and order reports.  \n \n Graduate High Frequency Trading Intern Pilotware Ltd December 2014  –  June 2015  (7 months) London 1. Created new trading data warehouse by organising, structuring and storing the trading records and portfolio status information, making scattered data being available for advanced analytical and statistical research. \n2. Independently developed protocol of external risk management system, which is able to monitor portfolio performance and order status in real time and make decision when trading limits being touched. \n3. Proactively participated to improving the performance of order management system, especially optimizing order tracking process and developing cache to dynamically store order status and order reports.  \n \n Quantitative Risk Research Student Imperial College London April 2014  –  August 2014  (5 months) London, United Kingdom Risk Research Student, supervised by Prof. Paolo Zaffaroni \n•\tCompleted the working paper “application of multivariate Copula-GARCH Model in the Risk Management of Portfolio”, which can be extensively applied into the risk analysis of multiple asset classes and strategies. \n•\tDiscovered the risk contagion pattern in global market based on macro-economic behaviour analysis and advanced statistical analysis on the performance of major market indices in different economic environments. \n•\tDeveloped time-varying and tail-structure changing Copulas-GARCH models to analyse big amount of data set and generate the return prediction of asset portfolios and corresponding multiple market risk measures. \n•\tConducted back-testing on various risk measures under 252-day moving and fixed windows, and concluded that GARCH-Copula methods could improve loss coverage accuracy via reducing failure rate by 15% \n Quantitative Risk Research Student Imperial College London April 2014  –  August 2014  (5 months) London, United Kingdom Risk Research Student, supervised by Prof. Paolo Zaffaroni \n•\tCompleted the working paper “application of multivariate Copula-GARCH Model in the Risk Management of Portfolio”, which can be extensively applied into the risk analysis of multiple asset classes and strategies. \n•\tDiscovered the risk contagion pattern in global market based on macro-economic behaviour analysis and advanced statistical analysis on the performance of major market indices in different economic environments. \n•\tDeveloped time-varying and tail-structure changing Copulas-GARCH models to analyse big amount of data set and generate the return prediction of asset portfolios and corresponding multiple market risk measures. \n•\tConducted back-testing on various risk measures under 252-day moving and fixed windows, and concluded that GARCH-Copula methods could improve loss coverage accuracy via reducing failure rate by 15% \n Sales Intern Santander Bank, N.A. October 2013  –  March 2014  (6 months) London, United Kingdom Boosted the campus client base by 25% and enhanced the popularity of Santander Bank by proactively promoting and providing tailored advices on bank products for clients Sales Intern Santander Bank, N.A. October 2013  –  March 2014  (6 months) London, United Kingdom Boosted the campus client base by 25% and enhanced the popularity of Santander Bank by proactively promoting and providing tailored advices on bank products for clients Summer Financial Analyst Huatai Great Wall Futures July 2012  –  October 2012  (4 months) Tianjin City, China 1. Developed the cost projection model for Financing Copper Trading Strategy by using VBA, and collaborated with trading desk to analyse the price volatilities of copper future contracts \n2. Involved in the project of “Financing Copper” Strategy and completed the ‘Financing Copper in China’ report which was published on the Monthly Markets Review \n Summer Financial Analyst Huatai Great Wall Futures July 2012  –  October 2012  (4 months) Tianjin City, China 1. Developed the cost projection model for Financing Copper Trading Strategy by using VBA, and collaborated with trading desk to analyse the price volatilities of copper future contracts \n2. Involved in the project of “Financing Copper” Strategy and completed the ‘Financing Copper in China’ report which was published on the Monthly Markets Review \n Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Top Skills 4 C++ 4 Matlab 1 Quantitative Finance 1 Financial Risk... 1 MySQL 0 Qt Creator 0 Mathematical Modeling 0 Numerical Analysis 0 Financial Modeling 0 Linux Zhenqi also knows about... 0 Shell Scripting 0 Fixed Income 0 FIX Skills  Top Skills 4 C++ 4 Matlab 1 Quantitative Finance 1 Financial Risk... 1 MySQL 0 Qt Creator 0 Mathematical Modeling 0 Numerical Analysis 0 Financial Modeling 0 Linux Zhenqi also knows about... 0 Shell Scripting 0 Fixed Income 0 FIX Top Skills 4 C++ 4 Matlab 1 Quantitative Finance 1 Financial Risk... 1 MySQL 0 Qt Creator 0 Mathematical Modeling 0 Numerical Analysis 0 Financial Modeling 0 Linux Zhenqi also knows about... 0 Shell Scripting 0 Fixed Income 0 FIX Top Skills 4 C++ 4 Matlab 1 Quantitative Finance 1 Financial Risk... 1 MySQL 0 Qt Creator 0 Mathematical Modeling 0 Numerical Analysis 0 Financial Modeling 0 Linux Zhenqi also knows about... 0 Shell Scripting 0 Fixed Income 0 FIX                     0 Shell Scripting 0 Fixed Income 0 FIX Education Imperial College Business School Master of Science (MSc),  Risk Management and Financial Engineering , Distinction 2013  – 2014 •\tDistinction, Rank the 5% of 111 master students \n•\tPassed FRM Level 1 & Level 2  \n•\tBloomberg Aptitude Test: Global 97th percentile, Math (50/50), Financial Statement (47/50) \n•\tCore modules: Financial Engineering, Investment and Portfolio, Fixed Income, Stochastic Calculus, Numerical Finance, Computational Finance, Risk Management, Advanced VBA， C++ for Finance Activities and Societies:  Bombnet Cooking Society Xiamen University Double Bachelor Degree,  Financial Engineering and Applied Mathematics , GPA: 3.75/4.0 2009  – 2013 •\tGRE: 1450/1600 (Quant: 790/800, Verbal: 660/800) \n•\tAwarded Dean’s List, Second Prize Scholarship during 2009-2013  \n•\tAchieved National Second Prize for National Mathematical Contest in Modelling \n•\tCore modules: Corporate Finance, Advanced Accounting, Case Study with Corporate Finance, Fixed Income Securities, VBA Programming, Options and Futures, Time-series forecasting, Numerical Analysis, Actuarial Science, Optimization Imperial College Business School Master of Science (MSc),  Risk Management and Financial Engineering , Distinction 2013  – 2014 •\tDistinction, Rank the 5% of 111 master students \n•\tPassed FRM Level 1 & Level 2  \n•\tBloomberg Aptitude Test: Global 97th percentile, Math (50/50), Financial Statement (47/50) \n•\tCore modules: Financial Engineering, Investment and Portfolio, Fixed Income, Stochastic Calculus, Numerical Finance, Computational Finance, Risk Management, Advanced VBA， C++ for Finance Activities and Societies:  Bombnet Cooking Society Imperial College Business School Master of Science (MSc),  Risk Management and Financial Engineering , Distinction 2013  – 2014 •\tDistinction, Rank the 5% of 111 master students \n•\tPassed FRM Level 1 & Level 2  \n•\tBloomberg Aptitude Test: Global 97th percentile, Math (50/50), Financial Statement (47/50) \n•\tCore modules: Financial Engineering, Investment and Portfolio, Fixed Income, Stochastic Calculus, Numerical Finance, Computational Finance, Risk Management, Advanced VBA， C++ for Finance Activities and Societies:  Bombnet Cooking Society Imperial College Business School Master of Science (MSc),  Risk Management and Financial Engineering , Distinction 2013  – 2014 •\tDistinction, Rank the 5% of 111 master students \n•\tPassed FRM Level 1 & Level 2  \n•\tBloomberg Aptitude Test: Global 97th percentile, Math (50/50), Financial Statement (47/50) \n•\tCore modules: Financial Engineering, Investment and Portfolio, Fixed Income, Stochastic Calculus, Numerical Finance, Computational Finance, Risk Management, Advanced VBA， C++ for Finance Activities and Societies:  Bombnet Cooking Society Xiamen University Double Bachelor Degree,  Financial Engineering and Applied Mathematics , GPA: 3.75/4.0 2009  – 2013 •\tGRE: 1450/1600 (Quant: 790/800, Verbal: 660/800) \n•\tAwarded Dean’s List, Second Prize Scholarship during 2009-2013  \n•\tAchieved National Second Prize for National Mathematical Contest in Modelling \n•\tCore modules: Corporate Finance, Advanced Accounting, Case Study with Corporate Finance, Fixed Income Securities, VBA Programming, Options and Futures, Time-series forecasting, Numerical Analysis, Actuarial Science, Optimization Xiamen University Double Bachelor Degree,  Financial Engineering and Applied Mathematics , GPA: 3.75/4.0 2009  – 2013 •\tGRE: 1450/1600 (Quant: 790/800, Verbal: 660/800) \n•\tAwarded Dean’s List, Second Prize Scholarship during 2009-2013  \n•\tAchieved National Second Prize for National Mathematical Contest in Modelling \n•\tCore modules: Corporate Finance, Advanced Accounting, Case Study with Corporate Finance, Fixed Income Securities, VBA Programming, Options and Futures, Time-series forecasting, Numerical Analysis, Actuarial Science, Optimization Xiamen University Double Bachelor Degree,  Financial Engineering and Applied Mathematics , GPA: 3.75/4.0 2009  – 2013 •\tGRE: 1450/1600 (Quant: 790/800, Verbal: 660/800) \n•\tAwarded Dean’s List, Second Prize Scholarship during 2009-2013  \n•\tAchieved National Second Prize for National Mathematical Contest in Modelling \n•\tCore modules: Corporate Finance, Advanced Accounting, Case Study with Corporate Finance, Fixed Income Securities, VBA Programming, Options and Futures, Time-series forecasting, Numerical Analysis, Actuarial Science, Optimization "]}