{"position": "Recruiting Program Manager", "company": "IBM", "profiles": ["Experience Diversity Recruiting Program Manager IBM July 2015  – Present (2 months) Washington D.C. Metro Area I am currently on a 24-month \"Tour of Duty\" as a Diversity Recruiting Program Manager for IBM Global Business Services. My focus is recruiting and executing strategies to attract top university talent to our Consulting by Degrees program, which I am a graduate of. In addition, I am committed to developing a solid pipeline for HBCU students and underrepresented minorities at IBM.  Senior Consultant IBM May 2015  – Present (4 months) Washington D.C. Metro Area Organizational Change Management Consultant IBM July 2013  –  May 2015  (1 year 11 months) Washington, District Of Columbia A member of Consulting By Degrees - IBM Global Business Services' world-class leadership & development program for top entry-level graduates; Organizational Change Management Consultant for IBM GBS (Public Sector) in the Organization & People Service Area. Program Administrator Howard University NABEF Media Sales Institute October 2012  –  June 2013  (9 months) Washington D.C. Metro Area Communications Intern Northrop Grumman Information Systems June 2012  –  November 2012  (6 months) McLean, Virginia Intern Comcast SportsNet August 2011  –  October 2011  (3 months) Bethesda, MD Public Affairs Intern Black Entertainment Television May 2011  –  August 2011  (4 months) Washington D.C. Metro Area Outreach & Partnerships Intern National Campaign to Prevent Teen and Unplanned Pregnancy January 2010  –  July 2011  (1 year 7 months) Washington, DC Diversity Recruiting Program Manager IBM July 2015  – Present (2 months) Washington D.C. Metro Area I am currently on a 24-month \"Tour of Duty\" as a Diversity Recruiting Program Manager for IBM Global Business Services. My focus is recruiting and executing strategies to attract top university talent to our Consulting by Degrees program, which I am a graduate of. In addition, I am committed to developing a solid pipeline for HBCU students and underrepresented minorities at IBM.  Diversity Recruiting Program Manager IBM July 2015  – Present (2 months) Washington D.C. Metro Area I am currently on a 24-month \"Tour of Duty\" as a Diversity Recruiting Program Manager for IBM Global Business Services. My focus is recruiting and executing strategies to attract top university talent to our Consulting by Degrees program, which I am a graduate of. In addition, I am committed to developing a solid pipeline for HBCU students and underrepresented minorities at IBM.  Senior Consultant IBM May 2015  – Present (4 months) Washington D.C. Metro Area Senior Consultant IBM May 2015  – Present (4 months) Washington D.C. Metro Area Organizational Change Management Consultant IBM July 2013  –  May 2015  (1 year 11 months) Washington, District Of Columbia A member of Consulting By Degrees - IBM Global Business Services' world-class leadership & development program for top entry-level graduates; Organizational Change Management Consultant for IBM GBS (Public Sector) in the Organization & People Service Area. Organizational Change Management Consultant IBM July 2013  –  May 2015  (1 year 11 months) Washington, District Of Columbia A member of Consulting By Degrees - IBM Global Business Services' world-class leadership & development program for top entry-level graduates; Organizational Change Management Consultant for IBM GBS (Public Sector) in the Organization & People Service Area. Program Administrator Howard University NABEF Media Sales Institute October 2012  –  June 2013  (9 months) Washington D.C. Metro Area Program Administrator Howard University NABEF Media Sales Institute October 2012  –  June 2013  (9 months) Washington D.C. Metro Area Communications Intern Northrop Grumman Information Systems June 2012  –  November 2012  (6 months) McLean, Virginia Communications Intern Northrop Grumman Information Systems June 2012  –  November 2012  (6 months) McLean, Virginia Intern Comcast SportsNet August 2011  –  October 2011  (3 months) Bethesda, MD Intern Comcast SportsNet August 2011  –  October 2011  (3 months) Bethesda, MD Public Affairs Intern Black Entertainment Television May 2011  –  August 2011  (4 months) Washington D.C. Metro Area Public Affairs Intern Black Entertainment Television May 2011  –  August 2011  (4 months) Washington D.C. Metro Area Outreach & Partnerships Intern National Campaign to Prevent Teen and Unplanned Pregnancy January 2010  –  July 2011  (1 year 7 months) Washington, DC Outreach & Partnerships Intern National Campaign to Prevent Teen and Unplanned Pregnancy January 2010  –  July 2011  (1 year 7 months) Washington, DC Languages   Skills Skills     Education Howard University B.A 2009  – 2013 Howard University B.A 2009  – 2013 Howard University B.A 2009  – 2013 Howard University B.A 2009  – 2013 Honors & Awards ", "Skills Personnel Management Talent Acquisition Applicant Tracking... College Recruiting Onboarding Recruiting Employee Relations PeopleSoft Talent Management Performance Management Human Resources Technical Recruiting CRM SDLC Strategy Sourcing Management Program Management Leadership Development Leadership See 5+     See less Skills  Personnel Management Talent Acquisition Applicant Tracking... College Recruiting Onboarding Recruiting Employee Relations PeopleSoft Talent Management Performance Management Human Resources Technical Recruiting CRM SDLC Strategy Sourcing Management Program Management Leadership Development Leadership See 5+     See less Personnel Management Talent Acquisition Applicant Tracking... College Recruiting Onboarding Recruiting Employee Relations PeopleSoft Talent Management Performance Management Human Resources Technical Recruiting CRM SDLC Strategy Sourcing Management Program Management Leadership Development Leadership See 5+     See less Personnel Management Talent Acquisition Applicant Tracking... College Recruiting Onboarding Recruiting Employee Relations PeopleSoft Talent Management Performance Management Human Resources Technical Recruiting CRM SDLC Strategy Sourcing Management Program Management Leadership Development Leadership See 5+     See less ", "Experience Recruiting Program Manager IBM February 2013  – Present (2 years 7 months) Greater Detroit Area Senior Talent Agent VisionIT September 2012  –  January 2013  (5 months) Detroit, Michigan . Full lifecycle recruitment, Leadership/Management, Recruitment Systems Solutions, Salary  \nnegotiation  \n. Behavioral Interviewing, Training, Communication skills, sourcing of hard-to-find skills  \n. Sourcing various IT skill sets/positions including, DBA’s, PM’s,  \nBA, UI’s, UX’s, Developers, Architects, etc. Senior Account Executive Venteon Mobile January 2012  –  September 2012  (9 months) Troy, Mi Venteon Mobile is a provider of enterprise mobility solution. Venteon Mobile’s service portfolio encompasses all of mobile strategy, mobile application development (native apps, mobile web apps, cross-platform apps, and hybrid apps), mobile security, mobile testing and support. \n \nVenteon's Mobile Strategists will collaborate with key stakeholders within your organization to create a mobile strategy and enterprise wide mobile initiative that will enhance your mobile presence while quickly returning your investment.  \nVenteon’s Mobile Developers will develop robust, secure, intuitive and elegant mobile apps that are specifically designed for each of our partners based on their services offerings and client base.  \nVenteon Mobile's extensive experience in Mobile QA allows us to launch fully functional, secure apps across multiple platforms. Senior Account Manager Venteon Partners May 2011  –  September 2012  (1 year 5 months) IT search and consulting firm. Focused on New Business development. \n-Develop new business through cold calls and referral business \n-Recruit for various IT candidates including;Project managers, Business Analysts, Web developers, Mobile Application Developers, and Networking Engineers \n-Mentor junior recruiters Principal ACH January 2002  –  February 2011  (9 years 2 months) Troy, Michigan COO/Partner Web Group LLC January 1997  –  January 2002  (5 years 1 month) Managed operation of recruiting and account management in Detroit and Chicago markets. Helped build company from $0 to $10 million in revenue in 4 years. Directly responsible for hiring and training of sales staff in both markets. Implemented entire restructure of sales procedures and wrote manual for sales staff. Launched an Executive Search branch providing services to Fortune 100 clients. Recruiting Program Manager IBM February 2013  – Present (2 years 7 months) Greater Detroit Area Recruiting Program Manager IBM February 2013  – Present (2 years 7 months) Greater Detroit Area Senior Talent Agent VisionIT September 2012  –  January 2013  (5 months) Detroit, Michigan . Full lifecycle recruitment, Leadership/Management, Recruitment Systems Solutions, Salary  \nnegotiation  \n. Behavioral Interviewing, Training, Communication skills, sourcing of hard-to-find skills  \n. Sourcing various IT skill sets/positions including, DBA’s, PM’s,  \nBA, UI’s, UX’s, Developers, Architects, etc. Senior Talent Agent VisionIT September 2012  –  January 2013  (5 months) Detroit, Michigan . Full lifecycle recruitment, Leadership/Management, Recruitment Systems Solutions, Salary  \nnegotiation  \n. Behavioral Interviewing, Training, Communication skills, sourcing of hard-to-find skills  \n. Sourcing various IT skill sets/positions including, DBA’s, PM’s,  \nBA, UI’s, UX’s, Developers, Architects, etc. Senior Account Executive Venteon Mobile January 2012  –  September 2012  (9 months) Troy, Mi Venteon Mobile is a provider of enterprise mobility solution. Venteon Mobile’s service portfolio encompasses all of mobile strategy, mobile application development (native apps, mobile web apps, cross-platform apps, and hybrid apps), mobile security, mobile testing and support. \n \nVenteon's Mobile Strategists will collaborate with key stakeholders within your organization to create a mobile strategy and enterprise wide mobile initiative that will enhance your mobile presence while quickly returning your investment.  \nVenteon’s Mobile Developers will develop robust, secure, intuitive and elegant mobile apps that are specifically designed for each of our partners based on their services offerings and client base.  \nVenteon Mobile's extensive experience in Mobile QA allows us to launch fully functional, secure apps across multiple platforms. Senior Account Executive Venteon Mobile January 2012  –  September 2012  (9 months) Troy, Mi Venteon Mobile is a provider of enterprise mobility solution. Venteon Mobile’s service portfolio encompasses all of mobile strategy, mobile application development (native apps, mobile web apps, cross-platform apps, and hybrid apps), mobile security, mobile testing and support. \n \nVenteon's Mobile Strategists will collaborate with key stakeholders within your organization to create a mobile strategy and enterprise wide mobile initiative that will enhance your mobile presence while quickly returning your investment.  \nVenteon’s Mobile Developers will develop robust, secure, intuitive and elegant mobile apps that are specifically designed for each of our partners based on their services offerings and client base.  \nVenteon Mobile's extensive experience in Mobile QA allows us to launch fully functional, secure apps across multiple platforms. Senior Account Manager Venteon Partners May 2011  –  September 2012  (1 year 5 months) IT search and consulting firm. Focused on New Business development. \n-Develop new business through cold calls and referral business \n-Recruit for various IT candidates including;Project managers, Business Analysts, Web developers, Mobile Application Developers, and Networking Engineers \n-Mentor junior recruiters Senior Account Manager Venteon Partners May 2011  –  September 2012  (1 year 5 months) IT search and consulting firm. Focused on New Business development. \n-Develop new business through cold calls and referral business \n-Recruit for various IT candidates including;Project managers, Business Analysts, Web developers, Mobile Application Developers, and Networking Engineers \n-Mentor junior recruiters Principal ACH January 2002  –  February 2011  (9 years 2 months) Troy, Michigan Principal ACH January 2002  –  February 2011  (9 years 2 months) Troy, Michigan COO/Partner Web Group LLC January 1997  –  January 2002  (5 years 1 month) Managed operation of recruiting and account management in Detroit and Chicago markets. Helped build company from $0 to $10 million in revenue in 4 years. Directly responsible for hiring and training of sales staff in both markets. Implemented entire restructure of sales procedures and wrote manual for sales staff. Launched an Executive Search branch providing services to Fortune 100 clients. COO/Partner Web Group LLC January 1997  –  January 2002  (5 years 1 month) Managed operation of recruiting and account management in Detroit and Chicago markets. Helped build company from $0 to $10 million in revenue in 4 years. Directly responsible for hiring and training of sales staff in both markets. Implemented entire restructure of sales procedures and wrote manual for sales staff. Launched an Executive Search branch providing services to Fortune 100 clients. Skills Technical Recruiting New Business Development Sales Management Direct Recruiting Staffing Industry Full-cycle Recruiting Internet Recruiting Applicant Tracking... Information Technology Industrial Sector Executive Search Staff Augmentation Recruiting Recruitment Advertising Search Staffing Services Temporary Placement Cold Calling Benefits Negotiation Account Management CRM Contract Recruitment Training Business Analysis Vendor Management Business Development Screening Business Networking Sourcing Interviews Sales Resume Writing College Recruiting Screening Resumes Human Resources SDLC Temporary Staffing Talent Acquisition Permanent Placement Mobile Applications IT Recruitment Talent Management Networking Resource Management Professional Services Boolean Searching Enterprise Software Hiring Consulting Sales Process See 35+     See less Skills  Technical Recruiting New Business Development Sales Management Direct Recruiting Staffing Industry Full-cycle Recruiting Internet Recruiting Applicant Tracking... Information Technology Industrial Sector Executive Search Staff Augmentation Recruiting Recruitment Advertising Search Staffing Services Temporary Placement Cold Calling Benefits Negotiation Account Management CRM Contract Recruitment Training Business Analysis Vendor Management Business Development Screening Business Networking Sourcing Interviews Sales Resume Writing College Recruiting Screening Resumes Human Resources SDLC Temporary Staffing Talent Acquisition Permanent Placement Mobile Applications IT Recruitment Talent Management Networking Resource Management Professional Services Boolean Searching Enterprise Software Hiring Consulting Sales Process See 35+     See less Technical Recruiting New Business Development Sales Management Direct Recruiting Staffing Industry Full-cycle Recruiting Internet Recruiting Applicant Tracking... Information Technology Industrial Sector Executive Search Staff Augmentation Recruiting Recruitment Advertising Search Staffing Services Temporary Placement Cold Calling Benefits Negotiation Account Management CRM Contract Recruitment Training Business Analysis Vendor Management Business Development Screening Business Networking Sourcing Interviews Sales Resume Writing College Recruiting Screening Resumes Human Resources SDLC Temporary Staffing Talent Acquisition Permanent Placement Mobile Applications IT Recruitment Talent Management Networking Resource Management Professional Services Boolean Searching Enterprise Software Hiring Consulting Sales Process See 35+     See less Technical Recruiting New Business Development Sales Management Direct Recruiting Staffing Industry Full-cycle Recruiting Internet Recruiting Applicant Tracking... Information Technology Industrial Sector Executive Search Staff Augmentation Recruiting Recruitment Advertising Search Staffing Services Temporary Placement Cold Calling Benefits Negotiation Account Management CRM Contract Recruitment Training Business Analysis Vendor Management Business Development Screening Business Networking Sourcing Interviews Sales Resume Writing College Recruiting Screening Resumes Human Resources SDLC Temporary Staffing Talent Acquisition Permanent Placement Mobile Applications IT Recruitment Talent Management Networking Resource Management Professional Services Boolean Searching Enterprise Software Hiring Consulting Sales Process See 35+     See less Education Bishop Gallagher 1981  – 1984 Bishop Gallagher 1981  – 1984 Bishop Gallagher 1981  – 1984 Bishop Gallagher 1981  – 1984 ", "Experience Lead Experienced Professional Recruiting Program Manager IBM March 2012  – Present (3 years 6 months) Washington DC Lead Focal for Application Innovation Services Public Sector IBM April 2010  –  February 2012  (1 year 11 months) DC BOM Manager & Corporate Trainer IBM February 2008  –  April 2010  (2 years 3 months) USCIS in Washington DC Executive Recruiter IBM November 2006  –  March 2008  (1 year 5 months) Global Sr. Lead Technial Recruiter IBM Global Business Services 2005  –  2007  (2 years) Sr. Technial Recruiter IBM (contractor) 2003  –  2005  (2 years) Sr. Technial Recruiter Interpath Communications 1998  –  2000  (2 years) Technical Recruiter Manpower Technical 1994  –  1997  (3 years) Lead Experienced Professional Recruiting Program Manager IBM March 2012  – Present (3 years 6 months) Washington DC Lead Experienced Professional Recruiting Program Manager IBM March 2012  – Present (3 years 6 months) Washington DC Lead Focal for Application Innovation Services Public Sector IBM April 2010  –  February 2012  (1 year 11 months) DC Lead Focal for Application Innovation Services Public Sector IBM April 2010  –  February 2012  (1 year 11 months) DC BOM Manager & Corporate Trainer IBM February 2008  –  April 2010  (2 years 3 months) USCIS in Washington DC BOM Manager & Corporate Trainer IBM February 2008  –  April 2010  (2 years 3 months) USCIS in Washington DC Executive Recruiter IBM November 2006  –  March 2008  (1 year 5 months) Global Executive Recruiter IBM November 2006  –  March 2008  (1 year 5 months) Global Sr. Lead Technial Recruiter IBM Global Business Services 2005  –  2007  (2 years) Sr. Lead Technial Recruiter IBM Global Business Services 2005  –  2007  (2 years) Sr. Technial Recruiter IBM (contractor) 2003  –  2005  (2 years) Sr. Technial Recruiter IBM (contractor) 2003  –  2005  (2 years) Sr. Technial Recruiter Interpath Communications 1998  –  2000  (2 years) Sr. Technial Recruiter Interpath Communications 1998  –  2000  (2 years) Technical Recruiter Manpower Technical 1994  –  1997  (3 years) Technical Recruiter Manpower Technical 1994  –  1997  (3 years) Skills Talent Acquisition Succession Planning Recruiting Talent Management Internet Recruiting Applicant Tracking... Technical Recruiting College Recruiting Benefits Negotiation Leadership Development Sourcing Staffing Services Interviews Management Executive Search Human Resources Onboarding Temporary Placement Business Development Screening Contract Recruitment Leadership Employee Engagement Vendor Management Performance Management Workforce Planning Employee Relations Consulting See 13+     See less Skills  Talent Acquisition Succession Planning Recruiting Talent Management Internet Recruiting Applicant Tracking... Technical Recruiting College Recruiting Benefits Negotiation Leadership Development Sourcing Staffing Services Interviews Management Executive Search Human Resources Onboarding Temporary Placement Business Development Screening Contract Recruitment Leadership Employee Engagement Vendor Management Performance Management Workforce Planning Employee Relations Consulting See 13+     See less Talent Acquisition Succession Planning Recruiting Talent Management Internet Recruiting Applicant Tracking... Technical Recruiting College Recruiting Benefits Negotiation Leadership Development Sourcing Staffing Services Interviews Management Executive Search Human Resources Onboarding Temporary Placement Business Development Screening Contract Recruitment Leadership Employee Engagement Vendor Management Performance Management Workforce Planning Employee Relations Consulting See 13+     See less Talent Acquisition Succession Planning Recruiting Talent Management Internet Recruiting Applicant Tracking... Technical Recruiting College Recruiting Benefits Negotiation Leadership Development Sourcing Staffing Services Interviews Management Executive Search Human Resources Onboarding Temporary Placement Business Development Screening Contract Recruitment Leadership Employee Engagement Vendor Management Performance Management Workforce Planning Employee Relations Consulting See 13+     See less Education University of North Carolina at Wilmington BA/BS,  Speech Communications 1984  – 1988 Activities and Societies:  Delta Sigma Phi ,  Student Body President University of North Carolina at Wilmington BA/BS,  Speech Communications 1984  – 1988 Activities and Societies:  Delta Sigma Phi ,  Student Body President University of North Carolina at Wilmington BA/BS,  Speech Communications 1984  – 1988 Activities and Societies:  Delta Sigma Phi ,  Student Body President University of North Carolina at Wilmington BA/BS,  Speech Communications 1984  – 1988 Activities and Societies:  Delta Sigma Phi ,  Student Body President ", "Experience Recruiting Program Manager IBM January 2013  – Present (2 years 8 months) Raleigh-Durham, North Carolina Area Team Lead/Sr. Recruiter Futurestep June 2011  –  January 2013  (1 year 8 months) Raleigh, NC (Virtual Position) Responsible for sourcing, recruiting, pre-screening highly qualified candidates. Human Resource Consultant Constellation Energy - RE Ginna NPP May 2009  –  June 2011  (2 years 2 months) Recruiting Consultant/Sr. Technical Recruiter Beeline - ATK March 2008  –  February 2009  (1 year) Staffing Consultant - Contract Charter Resources October 2007  –  March 2008  (6 months) Technical Recruiter - Contract IBM July 2007  –  October 2007  (4 months) Project Manager DTI September 2006  –  June 2007  (10 months) IT Recruiter TEKsystems August 2004  –  September 2006  (2 years 2 months) Recruiting Program Manager IBM January 2013  – Present (2 years 8 months) Raleigh-Durham, North Carolina Area Recruiting Program Manager IBM January 2013  – Present (2 years 8 months) Raleigh-Durham, North Carolina Area Team Lead/Sr. Recruiter Futurestep June 2011  –  January 2013  (1 year 8 months) Raleigh, NC (Virtual Position) Responsible for sourcing, recruiting, pre-screening highly qualified candidates. Team Lead/Sr. Recruiter Futurestep June 2011  –  January 2013  (1 year 8 months) Raleigh, NC (Virtual Position) Responsible for sourcing, recruiting, pre-screening highly qualified candidates. Human Resource Consultant Constellation Energy - RE Ginna NPP May 2009  –  June 2011  (2 years 2 months) Human Resource Consultant Constellation Energy - RE Ginna NPP May 2009  –  June 2011  (2 years 2 months) Recruiting Consultant/Sr. Technical Recruiter Beeline - ATK March 2008  –  February 2009  (1 year) Recruiting Consultant/Sr. Technical Recruiter Beeline - ATK March 2008  –  February 2009  (1 year) Staffing Consultant - Contract Charter Resources October 2007  –  March 2008  (6 months) Staffing Consultant - Contract Charter Resources October 2007  –  March 2008  (6 months) Technical Recruiter - Contract IBM July 2007  –  October 2007  (4 months) Technical Recruiter - Contract IBM July 2007  –  October 2007  (4 months) Project Manager DTI September 2006  –  June 2007  (10 months) Project Manager DTI September 2006  –  June 2007  (10 months) IT Recruiter TEKsystems August 2004  –  September 2006  (2 years 2 months) IT Recruiter TEKsystems August 2004  –  September 2006  (2 years 2 months) Languages French French French Skills Sourcing Applicant Tracking... Talent Acquisition Technical Recruiting Internet Recruiting Recruiting Vendor Management Screening Customer Service Building Relationships Employee Relations Talent Management Benefits Negotiation Screening Resumes Hiring Temporary Placement Interviews Personnel Management College Recruiting Management Contract Recruitment Executive Search Onboarding Human Resources Employer Branding RPO Corporate Recruiting Staffing Services Workforce Planning HR Consulting HRIS IT Recruitment New Hire Orientations Employee Engagement Recruitment Advertising Deferred Compensation Performance Management Taleo PeopleSoft Staff Augmentation HR Policies Succession Planning Permanent Placement Search Employee Benefits Strategic Sourcing Job Descriptions Career Development See 33+     See less Skills  Sourcing Applicant Tracking... Talent Acquisition Technical Recruiting Internet Recruiting Recruiting Vendor Management Screening Customer Service Building Relationships Employee Relations Talent Management Benefits Negotiation Screening Resumes Hiring Temporary Placement Interviews Personnel Management College Recruiting Management Contract Recruitment Executive Search Onboarding Human Resources Employer Branding RPO Corporate Recruiting Staffing Services Workforce Planning HR Consulting HRIS IT Recruitment New Hire Orientations Employee Engagement Recruitment Advertising Deferred Compensation Performance Management Taleo PeopleSoft Staff Augmentation HR Policies Succession Planning Permanent Placement Search Employee Benefits Strategic Sourcing Job Descriptions Career Development See 33+     See less Sourcing Applicant Tracking... Talent Acquisition Technical Recruiting Internet Recruiting Recruiting Vendor Management Screening Customer Service Building Relationships Employee Relations Talent Management Benefits Negotiation Screening Resumes Hiring Temporary Placement Interviews Personnel Management College Recruiting Management Contract Recruitment Executive Search Onboarding Human Resources Employer Branding RPO Corporate Recruiting Staffing Services Workforce Planning HR Consulting HRIS IT Recruitment New Hire Orientations Employee Engagement Recruitment Advertising Deferred Compensation Performance Management Taleo PeopleSoft Staff Augmentation HR Policies Succession Planning Permanent Placement Search Employee Benefits Strategic Sourcing Job Descriptions Career Development See 33+     See less Sourcing Applicant Tracking... Talent Acquisition Technical Recruiting Internet Recruiting Recruiting Vendor Management Screening Customer Service Building Relationships Employee Relations Talent Management Benefits Negotiation Screening Resumes Hiring Temporary Placement Interviews Personnel Management College Recruiting Management Contract Recruitment Executive Search Onboarding Human Resources Employer Branding RPO Corporate Recruiting Staffing Services Workforce Planning HR Consulting HRIS IT Recruitment New Hire Orientations Employee Engagement Recruitment Advertising Deferred Compensation Performance Management Taleo PeopleSoft Staff Augmentation HR Policies Succession Planning Permanent Placement Search Employee Benefits Strategic Sourcing Job Descriptions Career Development See 33+     See less Education State University of New York College at Oswego Bachelors,  Human Resource Managment 1998  – 2002 State University of New York College at Oswego Bachelors,  Human Resource Managment 1998  – 2002 State University of New York College at Oswego Bachelors,  Human Resource Managment 1998  – 2002 State University of New York College at Oswego Bachelors,  Human Resource Managment 1998  – 2002 ", "Summary I am a Recruiting Program Manager for IBM Global Business Services (GBS). Currently, I support hiring for the Global Smarter Commerce Center of Competency (WebSphere Commerce / Sterling / Order Management / Enterprise Marketing Management / Unica), and the Smarter Commerce and Complex Project Management Practices in Application Innovation Services. My home and office base is near Philadelphia, PA.  \n \nPrior to this role, I was a Professional Development Manager for the eCommerce Practice in IBM GBS. Summary I am a Recruiting Program Manager for IBM Global Business Services (GBS). Currently, I support hiring for the Global Smarter Commerce Center of Competency (WebSphere Commerce / Sterling / Order Management / Enterprise Marketing Management / Unica), and the Smarter Commerce and Complex Project Management Practices in Application Innovation Services. My home and office base is near Philadelphia, PA.  \n \nPrior to this role, I was a Professional Development Manager for the eCommerce Practice in IBM GBS. I am a Recruiting Program Manager for IBM Global Business Services (GBS). Currently, I support hiring for the Global Smarter Commerce Center of Competency (WebSphere Commerce / Sterling / Order Management / Enterprise Marketing Management / Unica), and the Smarter Commerce and Complex Project Management Practices in Application Innovation Services. My home and office base is near Philadelphia, PA.  \n \nPrior to this role, I was a Professional Development Manager for the eCommerce Practice in IBM GBS. I am a Recruiting Program Manager for IBM Global Business Services (GBS). Currently, I support hiring for the Global Smarter Commerce Center of Competency (WebSphere Commerce / Sterling / Order Management / Enterprise Marketing Management / Unica), and the Smarter Commerce and Complex Project Management Practices in Application Innovation Services. My home and office base is near Philadelphia, PA.  \n \nPrior to this role, I was a Professional Development Manager for the eCommerce Practice in IBM GBS. Experience Recruiting Program Manager for Application Innovation Services IBM July 2010  – Present (5 years 2 months) Greater Philadelphia Area My recruiting activites are directed to help IBM source and hire talented IT architects, consultants, project managers and programmers who will aid clients in transforming their customer facing activities by eCommerce solutions. My product focus areas are WebSphere Commerce, Sterling Commerce and Enterprise Marketing Management (EMM), Unica and Lombardi. I also support hiring for the banking and insurance, retail, travel and transportation, and life sciences (pharma.) industries. Professional Development Manager IBM 1997  –  2009  (12 years) Recruiting Program Manager for Application Innovation Services IBM July 2010  – Present (5 years 2 months) Greater Philadelphia Area My recruiting activites are directed to help IBM source and hire talented IT architects, consultants, project managers and programmers who will aid clients in transforming their customer facing activities by eCommerce solutions. My product focus areas are WebSphere Commerce, Sterling Commerce and Enterprise Marketing Management (EMM), Unica and Lombardi. I also support hiring for the banking and insurance, retail, travel and transportation, and life sciences (pharma.) industries. Recruiting Program Manager for Application Innovation Services IBM July 2010  – Present (5 years 2 months) Greater Philadelphia Area My recruiting activites are directed to help IBM source and hire talented IT architects, consultants, project managers and programmers who will aid clients in transforming their customer facing activities by eCommerce solutions. My product focus areas are WebSphere Commerce, Sterling Commerce and Enterprise Marketing Management (EMM), Unica and Lombardi. I also support hiring for the banking and insurance, retail, travel and transportation, and life sciences (pharma.) industries. Professional Development Manager IBM 1997  –  2009  (12 years) Professional Development Manager IBM 1997  –  2009  (12 years) Skills SDLC Integration Technical Recruiting Team Leadership E-commerce Unica Internet Recruiting Recruiting IBM Websphere Commerce Vendor Management WebSphere Application... WebSphere Portal Process Improvement Business Process... Skills  SDLC Integration Technical Recruiting Team Leadership E-commerce Unica Internet Recruiting Recruiting IBM Websphere Commerce Vendor Management WebSphere Application... WebSphere Portal Process Improvement Business Process... SDLC Integration Technical Recruiting Team Leadership E-commerce Unica Internet Recruiting Recruiting IBM Websphere Commerce Vendor Management WebSphere Application... WebSphere Portal Process Improvement Business Process... SDLC Integration Technical Recruiting Team Leadership E-commerce Unica Internet Recruiting Recruiting IBM Websphere Commerce Vendor Management WebSphere Application... WebSphere Portal Process Improvement Business Process... Education University of Nebraska-Lincoln Bachelor of Science (BS) Activities and Societies:  Mortar Board University of Nebraska-Lincoln Bachelor of Science (BS) Activities and Societies:  Mortar Board University of Nebraska-Lincoln Bachelor of Science (BS) Activities and Societies:  Mortar Board University of Nebraska-Lincoln Bachelor of Science (BS) Activities and Societies:  Mortar Board ", "Experience Recruiting Program Manager IBM May 2013  – Present (2 years 4 months) Baton Rouge IBM is a global technology and innovation company headquartered in Armonk, NY. It is the largest technology and consulting employer in the world, with approximately 427,000 employees serving clients in 170 countries.  \n \nIBM offers a wide range of technology and consulting services; a broad portfolio of middleware for collaboration, predictive analytics, software development and systems management; and the world's most advanced servers and supercomputers. Utilizing its business consulting, technology and R&D expertise, IBM helps clients become \"smarter\" as the planet becomes more digitally interconnected. This includes working with organizations and governments to build systems that improve traffic congestion, availability of clean water, and the health and safety of populations. Recruiting Program Manager IBM May 2013  – Present (2 years 4 months) Baton Rouge IBM is a global technology and innovation company headquartered in Armonk, NY. It is the largest technology and consulting employer in the world, with approximately 427,000 employees serving clients in 170 countries.  \n \nIBM offers a wide range of technology and consulting services; a broad portfolio of middleware for collaboration, predictive analytics, software development and systems management; and the world's most advanced servers and supercomputers. Utilizing its business consulting, technology and R&D expertise, IBM helps clients become \"smarter\" as the planet becomes more digitally interconnected. This includes working with organizations and governments to build systems that improve traffic congestion, availability of clean water, and the health and safety of populations. Recruiting Program Manager IBM May 2013  – Present (2 years 4 months) Baton Rouge IBM is a global technology and innovation company headquartered in Armonk, NY. It is the largest technology and consulting employer in the world, with approximately 427,000 employees serving clients in 170 countries.  \n \nIBM offers a wide range of technology and consulting services; a broad portfolio of middleware for collaboration, predictive analytics, software development and systems management; and the world's most advanced servers and supercomputers. Utilizing its business consulting, technology and R&D expertise, IBM helps clients become \"smarter\" as the planet becomes more digitally interconnected. This includes working with organizations and governments to build systems that improve traffic congestion, availability of clean water, and the health and safety of populations. Skills Skills     Honors & Awards ", "Summary Well-rounded consultant, project manager and practice leader with more than twenty years of experience. Strong skills in project management, software implementation (including financial accounting, ERP and Human Resources), business process redesign, knowledge management and business development. Skills in recruiting top talent into highly specialized global roles. \n \nSpecialties: Project Management, Implementation of Enterprise-wide Applications, Knowledge Management, Technology-based Solutions. Summary Well-rounded consultant, project manager and practice leader with more than twenty years of experience. Strong skills in project management, software implementation (including financial accounting, ERP and Human Resources), business process redesign, knowledge management and business development. Skills in recruiting top talent into highly specialized global roles. \n \nSpecialties: Project Management, Implementation of Enterprise-wide Applications, Knowledge Management, Technology-based Solutions. Well-rounded consultant, project manager and practice leader with more than twenty years of experience. Strong skills in project management, software implementation (including financial accounting, ERP and Human Resources), business process redesign, knowledge management and business development. Skills in recruiting top talent into highly specialized global roles. \n \nSpecialties: Project Management, Implementation of Enterprise-wide Applications, Knowledge Management, Technology-based Solutions. Well-rounded consultant, project manager and practice leader with more than twenty years of experience. Strong skills in project management, software implementation (including financial accounting, ERP and Human Resources), business process redesign, knowledge management and business development. Skills in recruiting top talent into highly specialized global roles. \n \nSpecialties: Project Management, Implementation of Enterprise-wide Applications, Knowledge Management, Technology-based Solutions. Experience GBS Global Recruiting Program Manager for Centers of Compentency IBM April 2013  – Present (2 years 5 months) Piscataway, NJ Recruiting Program Manager for IBM's Global Center of Competence (CoC). Work with CoC Leaders to define job roles and recruit top talent into 3 global practice areas: Social & People, Mobile and Supply Chain. GMU Business Leadership Program Recruiting Focal IBM October 2012  –  March 2013  (6 months) Princeton, NJ Worked with IBM global leaders to develop a MBA recruiting program for North America which attracts top candidates to work for IBM in growth markets abroad. Independent Advisor and Consultant Independent Consultant 2005  –  October 2012  (7 years) Independent consultant aiding not-for-profit organizations and a newly formed business in establishing and improving business processes and ensuring that technology tools are fully-leveraged. Senior Manager Deloitte 1996  –  2004  (8 years) Played leadership roles in the areas of client service, practice management and knowledge management. Client service focus included implementing financial/ERP/human resources implementations. Consulting Manager Platinum Software Corporation (now Epicor) 1994  –  1996  (2 years) Lead software implementations and supported the sales force. Responsible for managing client relationships after sale. Senior Consultant KPMG Peat Marwick 1987  –  1994  (7 years) Focus included project planning/management, strategic information systems planning, business process reengineering, EDP audit reviews and the design and implementation of information systems. GBS Global Recruiting Program Manager for Centers of Compentency IBM April 2013  – Present (2 years 5 months) Piscataway, NJ Recruiting Program Manager for IBM's Global Center of Competence (CoC). Work with CoC Leaders to define job roles and recruit top talent into 3 global practice areas: Social & People, Mobile and Supply Chain. GBS Global Recruiting Program Manager for Centers of Compentency IBM April 2013  – Present (2 years 5 months) Piscataway, NJ Recruiting Program Manager for IBM's Global Center of Competence (CoC). Work with CoC Leaders to define job roles and recruit top talent into 3 global practice areas: Social & People, Mobile and Supply Chain. GMU Business Leadership Program Recruiting Focal IBM October 2012  –  March 2013  (6 months) Princeton, NJ Worked with IBM global leaders to develop a MBA recruiting program for North America which attracts top candidates to work for IBM in growth markets abroad. GMU Business Leadership Program Recruiting Focal IBM October 2012  –  March 2013  (6 months) Princeton, NJ Worked with IBM global leaders to develop a MBA recruiting program for North America which attracts top candidates to work for IBM in growth markets abroad. Independent Advisor and Consultant Independent Consultant 2005  –  October 2012  (7 years) Independent consultant aiding not-for-profit organizations and a newly formed business in establishing and improving business processes and ensuring that technology tools are fully-leveraged. Independent Advisor and Consultant Independent Consultant 2005  –  October 2012  (7 years) Independent consultant aiding not-for-profit organizations and a newly formed business in establishing and improving business processes and ensuring that technology tools are fully-leveraged. Senior Manager Deloitte 1996  –  2004  (8 years) Played leadership roles in the areas of client service, practice management and knowledge management. Client service focus included implementing financial/ERP/human resources implementations. Senior Manager Deloitte 1996  –  2004  (8 years) Played leadership roles in the areas of client service, practice management and knowledge management. Client service focus included implementing financial/ERP/human resources implementations. Consulting Manager Platinum Software Corporation (now Epicor) 1994  –  1996  (2 years) Lead software implementations and supported the sales force. Responsible for managing client relationships after sale. Consulting Manager Platinum Software Corporation (now Epicor) 1994  –  1996  (2 years) Lead software implementations and supported the sales force. Responsible for managing client relationships after sale. Senior Consultant KPMG Peat Marwick 1987  –  1994  (7 years) Focus included project planning/management, strategic information systems planning, business process reengineering, EDP audit reviews and the design and implementation of information systems. Senior Consultant KPMG Peat Marwick 1987  –  1994  (7 years) Focus included project planning/management, strategic information systems planning, business process reengineering, EDP audit reviews and the design and implementation of information systems. Skills Business Process Leadership Talent Management ERP Strategy CRM Enterprise Software Business Development Project Management Program Management Recruiting Consulting Skills  Business Process Leadership Talent Management ERP Strategy CRM Enterprise Software Business Development Project Management Program Management Recruiting Consulting Business Process Leadership Talent Management ERP Strategy CRM Enterprise Software Business Development Project Management Program Management Recruiting Consulting Business Process Leadership Talent Management ERP Strategy CRM Enterprise Software Business Development Project Management Program Management Recruiting Consulting Education University of Virginia BS,  Systems Engineering 1982  – 1987 University of Virginia BS,  Systems Engineering 1982  – 1987 University of Virginia BS,  Systems Engineering 1982  – 1987 University of Virginia BS,  Systems Engineering 1982  – 1987 ", "Experience IBM Recruiting Program Manager IBM July 2013  – Present (2 years 2 months) Recruiting Program Manager for IBM Global Business Services. IBM Senior Consultant IBM July 2012  –  July 2013  (1 year 1 month) Washington D.C. Metro Area IBM Consultant IBM August 2010  –  June 2012  (1 year 11 months) Page Program U.S. House of Representatives June 2005  –  July 2005  (2 months) Washington D.C. Metro Area Heather Bryant served as a Page for the U.S. House of Representatives under former Speaker of the House, Denis Hastert. IBM Recruiting Program Manager IBM July 2013  – Present (2 years 2 months) Recruiting Program Manager for IBM Global Business Services. IBM Recruiting Program Manager IBM July 2013  – Present (2 years 2 months) Recruiting Program Manager for IBM Global Business Services. IBM Senior Consultant IBM July 2012  –  July 2013  (1 year 1 month) Washington D.C. Metro Area IBM Senior Consultant IBM July 2012  –  July 2013  (1 year 1 month) Washington D.C. Metro Area IBM Consultant IBM August 2010  –  June 2012  (1 year 11 months) IBM Consultant IBM August 2010  –  June 2012  (1 year 11 months) Page Program U.S. House of Representatives June 2005  –  July 2005  (2 months) Washington D.C. Metro Area Heather Bryant served as a Page for the U.S. House of Representatives under former Speaker of the House, Denis Hastert. Page Program U.S. House of Representatives June 2005  –  July 2005  (2 months) Washington D.C. Metro Area Heather Bryant served as a Page for the U.S. House of Representatives under former Speaker of the House, Denis Hastert. Skills Change Management Business Analysis Testing SAP Organizational... SAP Implementation Consulting Management Microsoft Excel Project Management PowerPoint Change Readiness Leading Organizational... Change Communications Excel Word Document Management Culture Change Recruiting Microsoft Office Data Analysis See 6+     See less Skills  Change Management Business Analysis Testing SAP Organizational... SAP Implementation Consulting Management Microsoft Excel Project Management PowerPoint Change Readiness Leading Organizational... Change Communications Excel Word Document Management Culture Change Recruiting Microsoft Office Data Analysis See 6+     See less Change Management Business Analysis Testing SAP Organizational... SAP Implementation Consulting Management Microsoft Excel Project Management PowerPoint Change Readiness Leading Organizational... Change Communications Excel Word Document Management Culture Change Recruiting Microsoft Office Data Analysis See 6+     See less Change Management Business Analysis Testing SAP Organizational... SAP Implementation Consulting Management Microsoft Excel Project Management PowerPoint Change Readiness Leading Organizational... Change Communications Excel Word Document Management Culture Change Recruiting Microsoft Office Data Analysis See 6+     See less Education The College of William and Mary Bachelor of Arts,  Economics University of Virginia Semester at Sea The College of William and Mary Bachelor of Arts,  Economics The College of William and Mary Bachelor of Arts,  Economics The College of William and Mary Bachelor of Arts,  Economics University of Virginia Semester at Sea University of Virginia Semester at Sea University of Virginia Semester at Sea ", "Summary Rich founded Sunfield Consulting to specialize in talent selection, recruiting process optimization, vendor management, talent assessment guides, interview training, and manager certification programs. His firm has been responsible for implementing nationwide hiring programs for multiple Fortune 250 organizations as well as working with multiple clients to develop and refine recruiting initiatives of varying size and scope. \n \nRich has previous experience with the largest specialized staffing firm in the world, holding responsibility for recruiting professionals and advising clients on talent acquisition across a large geographic area. In addition to over 10 years of experience in the human capital arena, Rich is a Certified Technical Trainer with 12 years of experience developing and delivering training programs for a number of clients. He has worked with multiple Fortune 500 organizations ranging from one of the largest computer manufacturers in the nation, a global automotive leader, the largest provider of real estate software in the world, and several of the largest privately held companies in the United States. After attending the University of Michigan Business School, concentrating in Marketing, Rich has participated in multiple leadership development programs and continuing education opportunities. Rich is committed to exploring new technologies, innovative ways to share information between people, and the effect of technology on talent acquisition. Specialties:Talent Acquisition, Recruiting, Talent Selection, Recruiting Process Optimization, Emerging Talent, Skills Assessment Programs, Multi-cultural Hiring, Hiring Event Management, Vendor Management, Talent Assessment Guides, Interview Training, and Manager Certification Programs Summary Rich founded Sunfield Consulting to specialize in talent selection, recruiting process optimization, vendor management, talent assessment guides, interview training, and manager certification programs. His firm has been responsible for implementing nationwide hiring programs for multiple Fortune 250 organizations as well as working with multiple clients to develop and refine recruiting initiatives of varying size and scope. \n \nRich has previous experience with the largest specialized staffing firm in the world, holding responsibility for recruiting professionals and advising clients on talent acquisition across a large geographic area. In addition to over 10 years of experience in the human capital arena, Rich is a Certified Technical Trainer with 12 years of experience developing and delivering training programs for a number of clients. He has worked with multiple Fortune 500 organizations ranging from one of the largest computer manufacturers in the nation, a global automotive leader, the largest provider of real estate software in the world, and several of the largest privately held companies in the United States. After attending the University of Michigan Business School, concentrating in Marketing, Rich has participated in multiple leadership development programs and continuing education opportunities. Rich is committed to exploring new technologies, innovative ways to share information between people, and the effect of technology on talent acquisition. Specialties:Talent Acquisition, Recruiting, Talent Selection, Recruiting Process Optimization, Emerging Talent, Skills Assessment Programs, Multi-cultural Hiring, Hiring Event Management, Vendor Management, Talent Assessment Guides, Interview Training, and Manager Certification Programs Rich founded Sunfield Consulting to specialize in talent selection, recruiting process optimization, vendor management, talent assessment guides, interview training, and manager certification programs. His firm has been responsible for implementing nationwide hiring programs for multiple Fortune 250 organizations as well as working with multiple clients to develop and refine recruiting initiatives of varying size and scope. \n \nRich has previous experience with the largest specialized staffing firm in the world, holding responsibility for recruiting professionals and advising clients on talent acquisition across a large geographic area. In addition to over 10 years of experience in the human capital arena, Rich is a Certified Technical Trainer with 12 years of experience developing and delivering training programs for a number of clients. He has worked with multiple Fortune 500 organizations ranging from one of the largest computer manufacturers in the nation, a global automotive leader, the largest provider of real estate software in the world, and several of the largest privately held companies in the United States. After attending the University of Michigan Business School, concentrating in Marketing, Rich has participated in multiple leadership development programs and continuing education opportunities. Rich is committed to exploring new technologies, innovative ways to share information between people, and the effect of technology on talent acquisition. Specialties:Talent Acquisition, Recruiting, Talent Selection, Recruiting Process Optimization, Emerging Talent, Skills Assessment Programs, Multi-cultural Hiring, Hiring Event Management, Vendor Management, Talent Assessment Guides, Interview Training, and Manager Certification Programs Rich founded Sunfield Consulting to specialize in talent selection, recruiting process optimization, vendor management, talent assessment guides, interview training, and manager certification programs. His firm has been responsible for implementing nationwide hiring programs for multiple Fortune 250 organizations as well as working with multiple clients to develop and refine recruiting initiatives of varying size and scope. \n \nRich has previous experience with the largest specialized staffing firm in the world, holding responsibility for recruiting professionals and advising clients on talent acquisition across a large geographic area. In addition to over 10 years of experience in the human capital arena, Rich is a Certified Technical Trainer with 12 years of experience developing and delivering training programs for a number of clients. He has worked with multiple Fortune 500 organizations ranging from one of the largest computer manufacturers in the nation, a global automotive leader, the largest provider of real estate software in the world, and several of the largest privately held companies in the United States. After attending the University of Michigan Business School, concentrating in Marketing, Rich has participated in multiple leadership development programs and continuing education opportunities. Rich is committed to exploring new technologies, innovative ways to share information between people, and the effect of technology on talent acquisition. Specialties:Talent Acquisition, Recruiting, Talent Selection, Recruiting Process Optimization, Emerging Talent, Skills Assessment Programs, Multi-cultural Hiring, Hiring Event Management, Vendor Management, Talent Assessment Guides, Interview Training, and Manager Certification Programs Experience Recruiting Program Manager, IBM Global Business Services IBM April 2015  – Present (5 months) Lansing, Michigan Area Working with IBM managing recruiting initiatives for several major Global Business Services projects. Recruiting Program Managers are responsible for delivering recruiting success throughout the organization by guiding Global Business Services executives, business leaders, hiring managers, and candidates through the selection process. The RPM also provides management consulting related to the hiring market including availability, salary, and trends.  Recruiting Consultant Sunfield Consulting June 2006  – Present (9 years 3 months) Sunfield Consulting provides recruiting and related services to Information Technology, Human Resource, and Recruiting organizations. We specialize in forming very strong relationships with our clients and serving as a contracted embedded resource in client organizations. In many instances we help our clients build an in-house IT recruiting capability while helping find talent. We can work with you to provide more traditional full cycle recruiting, resume review, interview assistance, and many other options. \n \nIn addition to traditional and non-traditional recruiting services Sunfield Consulting develops training and auditing for recruiting organizations across all industries. We can help your organization to develop or refine recruiting, hiring, and on-boarding processes. Corporate Recruiting Consultant Cummins Inc. October 2010  –  March 2015  (4 years 6 months) Sunfield Consulting is under contract to provide professional level Information Technology recruiting services to all Cummins Business Units across the US. We have multiple recruiters working at all levels of the organization to find and place candidates in mulitple functions. Recruiting Program Manager, IBM Global Business Services IBM Global Business Services April 2010  –  September 2011  (1 year 6 months) Working with IBM managing recruiting initiatives for several major Global Business Services projects. Responsible for the largest single location hiring program in IBM GBS. Additionally support a very unique technical group within GBS searching for highly specialized and very hard to find skillsets. Recruiting Consultant Whirlpool June 2006  –  April 2010  (3 years 11 months) Sunfield Consulting was under exclusive contract to Whirlpool Corporation for over 2 years as the provider and manager of IT recruiting services across North America. \n \nSunfield Consulting provided an additional two years of Human Resources recruiting, recruiting process management, and consulting services related to multiple aspects of talent acquisition. Information Technology Recruiter Robert Half Technology 2004  –  2006  (2 years) Recruit candidates for a variety of technical positions in Mid and West Michigan. Evaluate candidate's technical and interpersonal skills using a variety of questions and evaluation tools. Serve as manager for consultants while assigned to a client site. Work with a team of Account Executives to achieve placement goals. Perform follow-up analysis to determine internal service levels and insure the highest quality of candidates and service to our clients. Technical Training Manager, Michigan Gateway 2000  –  2004  (4 years) Manage eight market stores located in Michigan. Recruit, hire, and train new technical instructors. Operational and resource responsibility for assigned market stores. Propose, review, and implement new techincal training offerings. Channel Account Manager Fidelity National Information Services 1999  –  2000  (1 year) Started when the company was Moore Data Management, Moore was sold to VistaInfo and then FNIS. Manage a national network of resellers accounting for 25% of the division’s yearly revenue. Recruit new resellers and other technical individuals to the organization. Manage projects to deliver new software products and training to resellers and select customers. Responsible for setting budget goals and meeting those goals. Public Affairs Assistant Ford Motor Company 1996  –  1999  (3 years) Assist in various entertainment and promotional activities, contact and assist national and international professional media, work to promote corporate image. Transportation, delivery, ordering, and maintenance of media test vehicles. Interact with various internal departments in order to achieve assigned goals. Work with engineering staff to translate concepts for media consumption. Recruiting Program Manager, IBM Global Business Services IBM April 2015  – Present (5 months) Lansing, Michigan Area Working with IBM managing recruiting initiatives for several major Global Business Services projects. Recruiting Program Managers are responsible for delivering recruiting success throughout the organization by guiding Global Business Services executives, business leaders, hiring managers, and candidates through the selection process. The RPM also provides management consulting related to the hiring market including availability, salary, and trends.  Recruiting Program Manager, IBM Global Business Services IBM April 2015  – Present (5 months) Lansing, Michigan Area Working with IBM managing recruiting initiatives for several major Global Business Services projects. Recruiting Program Managers are responsible for delivering recruiting success throughout the organization by guiding Global Business Services executives, business leaders, hiring managers, and candidates through the selection process. The RPM also provides management consulting related to the hiring market including availability, salary, and trends.  Recruiting Consultant Sunfield Consulting June 2006  – Present (9 years 3 months) Sunfield Consulting provides recruiting and related services to Information Technology, Human Resource, and Recruiting organizations. We specialize in forming very strong relationships with our clients and serving as a contracted embedded resource in client organizations. In many instances we help our clients build an in-house IT recruiting capability while helping find talent. We can work with you to provide more traditional full cycle recruiting, resume review, interview assistance, and many other options. \n \nIn addition to traditional and non-traditional recruiting services Sunfield Consulting develops training and auditing for recruiting organizations across all industries. We can help your organization to develop or refine recruiting, hiring, and on-boarding processes. Recruiting Consultant Sunfield Consulting June 2006  – Present (9 years 3 months) Sunfield Consulting provides recruiting and related services to Information Technology, Human Resource, and Recruiting organizations. We specialize in forming very strong relationships with our clients and serving as a contracted embedded resource in client organizations. In many instances we help our clients build an in-house IT recruiting capability while helping find talent. We can work with you to provide more traditional full cycle recruiting, resume review, interview assistance, and many other options. \n \nIn addition to traditional and non-traditional recruiting services Sunfield Consulting develops training and auditing for recruiting organizations across all industries. We can help your organization to develop or refine recruiting, hiring, and on-boarding processes. Corporate Recruiting Consultant Cummins Inc. October 2010  –  March 2015  (4 years 6 months) Sunfield Consulting is under contract to provide professional level Information Technology recruiting services to all Cummins Business Units across the US. We have multiple recruiters working at all levels of the organization to find and place candidates in mulitple functions. Corporate Recruiting Consultant Cummins Inc. October 2010  –  March 2015  (4 years 6 months) Sunfield Consulting is under contract to provide professional level Information Technology recruiting services to all Cummins Business Units across the US. We have multiple recruiters working at all levels of the organization to find and place candidates in mulitple functions. Recruiting Program Manager, IBM Global Business Services IBM Global Business Services April 2010  –  September 2011  (1 year 6 months) Working with IBM managing recruiting initiatives for several major Global Business Services projects. Responsible for the largest single location hiring program in IBM GBS. Additionally support a very unique technical group within GBS searching for highly specialized and very hard to find skillsets. Recruiting Program Manager, IBM Global Business Services IBM Global Business Services April 2010  –  September 2011  (1 year 6 months) Working with IBM managing recruiting initiatives for several major Global Business Services projects. Responsible for the largest single location hiring program in IBM GBS. Additionally support a very unique technical group within GBS searching for highly specialized and very hard to find skillsets. Recruiting Consultant Whirlpool June 2006  –  April 2010  (3 years 11 months) Sunfield Consulting was under exclusive contract to Whirlpool Corporation for over 2 years as the provider and manager of IT recruiting services across North America. \n \nSunfield Consulting provided an additional two years of Human Resources recruiting, recruiting process management, and consulting services related to multiple aspects of talent acquisition. Recruiting Consultant Whirlpool June 2006  –  April 2010  (3 years 11 months) Sunfield Consulting was under exclusive contract to Whirlpool Corporation for over 2 years as the provider and manager of IT recruiting services across North America. \n \nSunfield Consulting provided an additional two years of Human Resources recruiting, recruiting process management, and consulting services related to multiple aspects of talent acquisition. Information Technology Recruiter Robert Half Technology 2004  –  2006  (2 years) Recruit candidates for a variety of technical positions in Mid and West Michigan. Evaluate candidate's technical and interpersonal skills using a variety of questions and evaluation tools. Serve as manager for consultants while assigned to a client site. Work with a team of Account Executives to achieve placement goals. Perform follow-up analysis to determine internal service levels and insure the highest quality of candidates and service to our clients. Information Technology Recruiter Robert Half Technology 2004  –  2006  (2 years) Recruit candidates for a variety of technical positions in Mid and West Michigan. Evaluate candidate's technical and interpersonal skills using a variety of questions and evaluation tools. Serve as manager for consultants while assigned to a client site. Work with a team of Account Executives to achieve placement goals. Perform follow-up analysis to determine internal service levels and insure the highest quality of candidates and service to our clients. Technical Training Manager, Michigan Gateway 2000  –  2004  (4 years) Manage eight market stores located in Michigan. Recruit, hire, and train new technical instructors. Operational and resource responsibility for assigned market stores. Propose, review, and implement new techincal training offerings. Technical Training Manager, Michigan Gateway 2000  –  2004  (4 years) Manage eight market stores located in Michigan. Recruit, hire, and train new technical instructors. Operational and resource responsibility for assigned market stores. Propose, review, and implement new techincal training offerings. Channel Account Manager Fidelity National Information Services 1999  –  2000  (1 year) Started when the company was Moore Data Management, Moore was sold to VistaInfo and then FNIS. Manage a national network of resellers accounting for 25% of the division’s yearly revenue. Recruit new resellers and other technical individuals to the organization. Manage projects to deliver new software products and training to resellers and select customers. Responsible for setting budget goals and meeting those goals. Channel Account Manager Fidelity National Information Services 1999  –  2000  (1 year) Started when the company was Moore Data Management, Moore was sold to VistaInfo and then FNIS. Manage a national network of resellers accounting for 25% of the division’s yearly revenue. Recruit new resellers and other technical individuals to the organization. Manage projects to deliver new software products and training to resellers and select customers. Responsible for setting budget goals and meeting those goals. Public Affairs Assistant Ford Motor Company 1996  –  1999  (3 years) Assist in various entertainment and promotional activities, contact and assist national and international professional media, work to promote corporate image. Transportation, delivery, ordering, and maintenance of media test vehicles. Interact with various internal departments in order to achieve assigned goals. Work with engineering staff to translate concepts for media consumption. Public Affairs Assistant Ford Motor Company 1996  –  1999  (3 years) Assist in various entertainment and promotional activities, contact and assist national and international professional media, work to promote corporate image. Transportation, delivery, ordering, and maintenance of media test vehicles. Interact with various internal departments in order to achieve assigned goals. Work with engineering staff to translate concepts for media consumption. Skills Talent Acquisition Interviewing Vendor Management Talent Selection Technical Recruiting Applicant Tracking... Talent Management Full-cycle Recruiting Sourcing Onboarding Hiring Recruitment/Retention Compensation Salary Negotiation Strategic Sourcing College Recruiting Metrics Account Management Process Improvement Contract Recruitment Cold Calling Recruitment Advertising Mentoring Vendor Relations Resume Writing Program Management Team Building Negotiation Contract Negotiation Team Management Recruiting Interviews Leadership Leadership Development Management SDLC Training See 22+     See less Skills  Talent Acquisition Interviewing Vendor Management Talent Selection Technical Recruiting Applicant Tracking... Talent Management Full-cycle Recruiting Sourcing Onboarding Hiring Recruitment/Retention Compensation Salary Negotiation Strategic Sourcing College Recruiting Metrics Account Management Process Improvement Contract Recruitment Cold Calling Recruitment Advertising Mentoring Vendor Relations Resume Writing Program Management Team Building Negotiation Contract Negotiation Team Management Recruiting Interviews Leadership Leadership Development Management SDLC Training See 22+     See less Talent Acquisition Interviewing Vendor Management Talent Selection Technical Recruiting Applicant Tracking... Talent Management Full-cycle Recruiting Sourcing Onboarding Hiring Recruitment/Retention Compensation Salary Negotiation Strategic Sourcing College Recruiting Metrics Account Management Process Improvement Contract Recruitment Cold Calling Recruitment Advertising Mentoring Vendor Relations Resume Writing Program Management Team Building Negotiation Contract Negotiation Team Management Recruiting Interviews Leadership Leadership Development Management SDLC Training See 22+     See less Talent Acquisition Interviewing Vendor Management Talent Selection Technical Recruiting Applicant Tracking... Talent Management Full-cycle Recruiting Sourcing Onboarding Hiring Recruitment/Retention Compensation Salary Negotiation Strategic Sourcing College Recruiting Metrics Account Management Process Improvement Contract Recruitment Cold Calling Recruitment Advertising Mentoring Vendor Relations Resume Writing Program Management Team Building Negotiation Contract Negotiation Team Management Recruiting Interviews Leadership Leadership Development Management SDLC Training See 22+     See less ", "Skills recruiting consulting strategy Business Applicant Tracking... Talent Acquisition Technical Recruiting Sourcing College Recruiting Internet Recruiting Onboarding Talent Management Benefits Negotiation Vendor Management Executive Search Recruiting Strategy Process Improvement Temporary Placement Program Management Management Consulting Consulting Leadership Business Development Interviews Change Management CRM Management SDLC Hiring Strategic Sourcing Professional Services Outsourcing Project Management Start-ups Resource Management Human Resources Forecasting Performance Management Negotiation Business Process... See 26+     See less Skills  recruiting consulting strategy Business Applicant Tracking... Talent Acquisition Technical Recruiting Sourcing College Recruiting Internet Recruiting Onboarding Talent Management Benefits Negotiation Vendor Management Executive Search Recruiting Strategy Process Improvement Temporary Placement Program Management Management Consulting Consulting Leadership Business Development Interviews Change Management CRM Management SDLC Hiring Strategic Sourcing Professional Services Outsourcing Project Management Start-ups Resource Management Human Resources Forecasting Performance Management Negotiation Business Process... See 26+     See less recruiting consulting strategy Business Applicant Tracking... Talent Acquisition Technical Recruiting Sourcing College Recruiting Internet Recruiting Onboarding Talent Management Benefits Negotiation Vendor Management Executive Search Recruiting Strategy Process Improvement Temporary Placement Program Management Management Consulting Consulting Leadership Business Development Interviews Change Management CRM Management SDLC Hiring Strategic Sourcing Professional Services Outsourcing Project Management Start-ups Resource Management Human Resources Forecasting Performance Management Negotiation Business Process... See 26+     See less recruiting consulting strategy Business Applicant Tracking... Talent Acquisition Technical Recruiting Sourcing College Recruiting Internet Recruiting Onboarding Talent Management Benefits Negotiation Vendor Management Executive Search Recruiting Strategy Process Improvement Temporary Placement Program Management Management Consulting Consulting Leadership Business Development Interviews Change Management CRM Management SDLC Hiring Strategic Sourcing Professional Services Outsourcing Project Management Start-ups Resource Management Human Resources Forecasting Performance Management Negotiation Business Process... See 26+     See less ", "Summary Accomplished HR professional with 10+ years of experience and recognized performance in the consulting and legal industries. Effective leader, liaison, team member and individual contributor. Proven history of excelling in dynamic, deadline-driven environments. Strategic member of HR management teams that expanded services and partnered with business leaders to improve productivity and client satisfaction. \n \nSKILL HIGHLIGHTS: \n• Talent Acquisition and Retention \n• Change Implementation \n• Training and Development \n• Project Management \n• Performance Management \n• Leadership/Communication skills \n• Employee Relations\t \n• Team Building \n \nActive volunteer and Board Member with numerous organizations. Summary Accomplished HR professional with 10+ years of experience and recognized performance in the consulting and legal industries. Effective leader, liaison, team member and individual contributor. Proven history of excelling in dynamic, deadline-driven environments. Strategic member of HR management teams that expanded services and partnered with business leaders to improve productivity and client satisfaction. \n \nSKILL HIGHLIGHTS: \n• Talent Acquisition and Retention \n• Change Implementation \n• Training and Development \n• Project Management \n• Performance Management \n• Leadership/Communication skills \n• Employee Relations\t \n• Team Building \n \nActive volunteer and Board Member with numerous organizations. Accomplished HR professional with 10+ years of experience and recognized performance in the consulting and legal industries. Effective leader, liaison, team member and individual contributor. Proven history of excelling in dynamic, deadline-driven environments. Strategic member of HR management teams that expanded services and partnered with business leaders to improve productivity and client satisfaction. \n \nSKILL HIGHLIGHTS: \n• Talent Acquisition and Retention \n• Change Implementation \n• Training and Development \n• Project Management \n• Performance Management \n• Leadership/Communication skills \n• Employee Relations\t \n• Team Building \n \nActive volunteer and Board Member with numerous organizations. Accomplished HR professional with 10+ years of experience and recognized performance in the consulting and legal industries. Effective leader, liaison, team member and individual contributor. Proven history of excelling in dynamic, deadline-driven environments. Strategic member of HR management teams that expanded services and partnered with business leaders to improve productivity and client satisfaction. \n \nSKILL HIGHLIGHTS: \n• Talent Acquisition and Retention \n• Change Implementation \n• Training and Development \n• Project Management \n• Performance Management \n• Leadership/Communication skills \n• Employee Relations\t \n• Team Building \n \nActive volunteer and Board Member with numerous organizations. Experience Public Sector Recruiting Program Manager IBM March 2015  – Present (6 months) Washington D.C. Metro Area High School Placement Counselor K12 November 2014  –  March 2015  (5 months) Determine course placement for high school students based upon the student’s transcript, grade level and the number of credits the student has earned. Conduct course placement call with parents to advise on student’s course path. Maintain communication with families to provide the next steps in the process, answer questions that arise during placement, and ensure appropriate placement. \nCommunicate regularly with high school counselors and administrative staff regarding student placements, transcripts, and any extenuating circumstances as defined by the school’s policies. Senior Consultant The Human Resource Partnership 2003  –  2007  (4 years) Consulted to various clients with a primary focus on performance management, HR policies and procedures, training and development, conflict resolution, executive coaching, retention strategies and recruiting. HR Director PwC Consulting 1997  –  2000  (3 years) Arlington, VA Director Employee Relations, Career Development and Training - 1999-2000 \nDirected the Employee Relations, Career Development and Training functions for a 2,300 person business unit, to include performance issues, sexual harassment, conflict resolution, investigations, terminations, all facets of the annual assessment process (Global Capabilities Framework, Scorecard, Performance Appraisals, Coaching Program), global deployment, partner admissions process, immigration, orientation, and continuing education compliance and training. Successfully managed a staff of 12. \n \n \nSpecial Projects Manager, 1998-1999 \nManaged a variety of ongoing initiatives, on both the business unit and national levels, to include the National HR Career Model, Executive Coaching Program, Global Deployment, and the Partner Admissions Process. \n \n \nLead Resource Manager, 1997-1998 \nManaged Resource Management function for the Washington Consulting Practice’s Center for Performance Improvement (CPI) Service Area, consisting of over 150 staff. Responsibilities included Staff Deployment, Capacity Management, Recruitment, Employee Relations, Management of HR Programs, and New Hire Assimilation. Human Resources Manager Hahn Loeser & Parks LLP 1993  –  1997  (4 years) Cleveland/Akron, Ohio Area Human Resource Manager, 1995-1997 \nManaged staff of 50, including recruitment, orientation, benefits administration and performance reviews. Instrumental in the planning, designing and implementation of job evaluations and descriptions, performance appraisal programs and compensation structure. Responsible for payroll and benefits administration for all partners and employees. Public Sector Recruiting Program Manager IBM March 2015  – Present (6 months) Washington D.C. Metro Area Public Sector Recruiting Program Manager IBM March 2015  – Present (6 months) Washington D.C. Metro Area High School Placement Counselor K12 November 2014  –  March 2015  (5 months) Determine course placement for high school students based upon the student’s transcript, grade level and the number of credits the student has earned. Conduct course placement call with parents to advise on student’s course path. Maintain communication with families to provide the next steps in the process, answer questions that arise during placement, and ensure appropriate placement. \nCommunicate regularly with high school counselors and administrative staff regarding student placements, transcripts, and any extenuating circumstances as defined by the school’s policies. High School Placement Counselor K12 November 2014  –  March 2015  (5 months) Determine course placement for high school students based upon the student’s transcript, grade level and the number of credits the student has earned. Conduct course placement call with parents to advise on student’s course path. Maintain communication with families to provide the next steps in the process, answer questions that arise during placement, and ensure appropriate placement. \nCommunicate regularly with high school counselors and administrative staff regarding student placements, transcripts, and any extenuating circumstances as defined by the school’s policies. Senior Consultant The Human Resource Partnership 2003  –  2007  (4 years) Consulted to various clients with a primary focus on performance management, HR policies and procedures, training and development, conflict resolution, executive coaching, retention strategies and recruiting. Senior Consultant The Human Resource Partnership 2003  –  2007  (4 years) Consulted to various clients with a primary focus on performance management, HR policies and procedures, training and development, conflict resolution, executive coaching, retention strategies and recruiting. HR Director PwC Consulting 1997  –  2000  (3 years) Arlington, VA Director Employee Relations, Career Development and Training - 1999-2000 \nDirected the Employee Relations, Career Development and Training functions for a 2,300 person business unit, to include performance issues, sexual harassment, conflict resolution, investigations, terminations, all facets of the annual assessment process (Global Capabilities Framework, Scorecard, Performance Appraisals, Coaching Program), global deployment, partner admissions process, immigration, orientation, and continuing education compliance and training. Successfully managed a staff of 12. \n \n \nSpecial Projects Manager, 1998-1999 \nManaged a variety of ongoing initiatives, on both the business unit and national levels, to include the National HR Career Model, Executive Coaching Program, Global Deployment, and the Partner Admissions Process. \n \n \nLead Resource Manager, 1997-1998 \nManaged Resource Management function for the Washington Consulting Practice’s Center for Performance Improvement (CPI) Service Area, consisting of over 150 staff. Responsibilities included Staff Deployment, Capacity Management, Recruitment, Employee Relations, Management of HR Programs, and New Hire Assimilation. HR Director PwC Consulting 1997  –  2000  (3 years) Arlington, VA Director Employee Relations, Career Development and Training - 1999-2000 \nDirected the Employee Relations, Career Development and Training functions for a 2,300 person business unit, to include performance issues, sexual harassment, conflict resolution, investigations, terminations, all facets of the annual assessment process (Global Capabilities Framework, Scorecard, Performance Appraisals, Coaching Program), global deployment, partner admissions process, immigration, orientation, and continuing education compliance and training. Successfully managed a staff of 12. \n \n \nSpecial Projects Manager, 1998-1999 \nManaged a variety of ongoing initiatives, on both the business unit and national levels, to include the National HR Career Model, Executive Coaching Program, Global Deployment, and the Partner Admissions Process. \n \n \nLead Resource Manager, 1997-1998 \nManaged Resource Management function for the Washington Consulting Practice’s Center for Performance Improvement (CPI) Service Area, consisting of over 150 staff. Responsibilities included Staff Deployment, Capacity Management, Recruitment, Employee Relations, Management of HR Programs, and New Hire Assimilation. Human Resources Manager Hahn Loeser & Parks LLP 1993  –  1997  (4 years) Cleveland/Akron, Ohio Area Human Resource Manager, 1995-1997 \nManaged staff of 50, including recruitment, orientation, benefits administration and performance reviews. Instrumental in the planning, designing and implementation of job evaluations and descriptions, performance appraisal programs and compensation structure. Responsible for payroll and benefits administration for all partners and employees. Human Resources Manager Hahn Loeser & Parks LLP 1993  –  1997  (4 years) Cleveland/Akron, Ohio Area Human Resource Manager, 1995-1997 \nManaged staff of 50, including recruitment, orientation, benefits administration and performance reviews. Instrumental in the planning, designing and implementation of job evaluations and descriptions, performance appraisal programs and compensation structure. Responsible for payroll and benefits administration for all partners and employees. Skills Organizational... Corporate Recruiting Management Consulting Leadership Development Coaching Business Process... Strategy Change Management Human Resources Talent Management Performance Management Management Training Talent Acquisition HR Policies Business Development Human Resource... Strategic Planning Leadership Program Management Team Building Business Strategy Process Improvement Team Leadership Employee Benefits Team Building... Training Facilitation Recruiting Employee Relations New Hire Orientations Career Development Benefits Administration Consulting See 18+     See less Skills  Organizational... Corporate Recruiting Management Consulting Leadership Development Coaching Business Process... Strategy Change Management Human Resources Talent Management Performance Management Management Training Talent Acquisition HR Policies Business Development Human Resource... Strategic Planning Leadership Program Management Team Building Business Strategy Process Improvement Team Leadership Employee Benefits Team Building... Training Facilitation Recruiting Employee Relations New Hire Orientations Career Development Benefits Administration Consulting See 18+     See less Organizational... Corporate Recruiting Management Consulting Leadership Development Coaching Business Process... Strategy Change Management Human Resources Talent Management Performance Management Management Training Talent Acquisition HR Policies Business Development Human Resource... Strategic Planning Leadership Program Management Team Building Business Strategy Process Improvement Team Leadership Employee Benefits Team Building... Training Facilitation Recruiting Employee Relations New Hire Orientations Career Development Benefits Administration Consulting See 18+     See less Organizational... Corporate Recruiting Management Consulting Leadership Development Coaching Business Process... Strategy Change Management Human Resources Talent Management Performance Management Management Training Talent Acquisition HR Policies Business Development Human Resource... Strategic Planning Leadership Program Management Team Building Business Strategy Process Improvement Team Leadership Employee Benefits Team Building... Training Facilitation Recruiting Employee Relations New Hire Orientations Career Development Benefits Administration Consulting See 18+     See less Education Michigan State University Bachelor's degree,  Social Sciences/HR/Psychology 1993 Activities and Societies:  Alpha Omicron Pi Michigan State University Bachelor's degree,  Social Sciences/HR/Psychology 1993 Activities and Societies:  Alpha Omicron Pi Michigan State University Bachelor's degree,  Social Sciences/HR/Psychology 1993 Activities and Societies:  Alpha Omicron Pi Michigan State University Bachelor's degree,  Social Sciences/HR/Psychology 1993 Activities and Societies:  Alpha Omicron Pi ", "Skills Technical Recruiting Talent Acquisition Applicant Tracking... Internet Recruiting Sourcing Benefits Negotiation Recruiting Contract Recruitment Talent Management Vendor Management College Recruiting Executive Search Screening Onboarding Program Management PeopleSoft Professional Services Human Resources Resource Management Employee Relations Consulting Information Technology Staffing Services Management Networking Screening Resumes SDLC Search Interviews Temporary Placement See 15+     See less Skills  Technical Recruiting Talent Acquisition Applicant Tracking... Internet Recruiting Sourcing Benefits Negotiation Recruiting Contract Recruitment Talent Management Vendor Management College Recruiting Executive Search Screening Onboarding Program Management PeopleSoft Professional Services Human Resources Resource Management Employee Relations Consulting Information Technology Staffing Services Management Networking Screening Resumes SDLC Search Interviews Temporary Placement See 15+     See less Technical Recruiting Talent Acquisition Applicant Tracking... Internet Recruiting Sourcing Benefits Negotiation Recruiting Contract Recruitment Talent Management Vendor Management College Recruiting Executive Search Screening Onboarding Program Management PeopleSoft Professional Services Human Resources Resource Management Employee Relations Consulting Information Technology Staffing Services Management Networking Screening Resumes SDLC Search Interviews Temporary Placement See 15+     See less Technical Recruiting Talent Acquisition Applicant Tracking... Internet Recruiting Sourcing Benefits Negotiation Recruiting Contract Recruitment Talent Management Vendor Management College Recruiting Executive Search Screening Onboarding Program Management PeopleSoft Professional Services Human Resources Resource Management Employee Relations Consulting Information Technology Staffing Services Management Networking Screening Resumes SDLC Search Interviews Temporary Placement See 15+     See less ", "Experience Recruiting Program Manager IBM Canada May 2015  – Present (4 months) Markham, Ontario Permanent Recruitment Manager OfficeTeam, Robert Half International March 2014  –  April 2015  (1 year 2 months) North York, Ontario Transiton Specialist - Job Search Strategy Coach RiseSmart 2012  –  2014  (2 years) Virtual RiseSmart has disrupted the outplacement industry and has earned industry-wide praise as we've changed the way companies manage and measure their employee transition programs!  \n \nAs a one on one job search strategy coach, I support/teach/train my clients in all areas to help them find their next great career opportunity. My days are filled with virtual one on one strategy sessions on a huge variety of topics including: \n \nSelf Assessments and Goal Setting \nTechniques to \"Market\" your Personal Brand \nIndividual Job Search Strategy \nUnderstanding the \"Hiring Manager and Recruiter\" perspecitve \nResume and Cover Letter creation and customization \nStrategic use of Social Networking tools such as LinkedIn  \nInterview preparation and practice \nNegotiating Job Offers Global Learning Program Manager: Employee Professional Learning & Development IBM January 2009  –  March 2012  (3 years 3 months) At IBM, Learning was a global initiative. We collaborated around the Globe to ensure IBMer's had the tools and knowledge they needed to successfully deliver to our clients every day!  \n \nAs a Global Learning Consultant focused on employee development, I assessed business challenges, determined developmental needs within teams, designed or sourced learning interventions, delivered learning programs, assessed impact of those programs and continuously improved them with the end goal of solving the team's business challenges. Career Development Program Manager, Redeployment and Learning Facilitator (classroom & virtual) IBM Canada Ltd. January 2006  –  December 2008  (3 years) IBM was constantly purchasing smaller Software companies during this time frame. Our goal in Career Development was to facilitate the On boarding, Training and Redeployment processes for all new and legacy employees in support of the larger goal of ensuring our clients had a seamless IBM experience.  \n \nIn this role I focused on new and legacy employee redeployment, on boarding processes and related training with a constant focus in the Career Development area. I trained and coached 100's of IBMer's to define and find their own career success within IBM. I also coached employees on managing their careers in an effort to retain top performers! Professional Development Virtual & Classroom Facilitator IBM Canada Ltd. November 1998  –  January 2006  (7 years 3 months) I facilitated biweekly delivery of New Employee Training Programs for IBM Canada for 7 years for new Professional, Campus, and Acquisition audiences with consistently strong feedback. I delivered content on topics such as: Business Strategy, HR Policies and Programs, Career Development and Business skills such as communication, teaming and negotiation.I then coached and mentored many individuals as they acclimated to their new roles. Eventually, I was given the challenge to deliver these sessions virtually and continued to receive strong feedback. Public Sector Sales Specialist and Marketing Program Manager, Education Industry IBM Canada Ltd. January 1995  –  November 1998  (3 years 11 months) In this role I marketed and sold IBM software, hardware and services to the Kindergarten to Grade 12 Industry and the Higher Education Industry in the greater Toronto area. I also ran marketing/sales events across Canada annually and hosted client events at Universities and Colleges across Canada and the US. Our focus at the time was the new \"Think Pad University\" model initiated at Acadia University which successfully spread across other North American universities. Recruiting Program Manager IBM Canada May 2015  – Present (4 months) Markham, Ontario Recruiting Program Manager IBM Canada May 2015  – Present (4 months) Markham, Ontario Permanent Recruitment Manager OfficeTeam, Robert Half International March 2014  –  April 2015  (1 year 2 months) North York, Ontario Permanent Recruitment Manager OfficeTeam, Robert Half International March 2014  –  April 2015  (1 year 2 months) North York, Ontario Transiton Specialist - Job Search Strategy Coach RiseSmart 2012  –  2014  (2 years) Virtual RiseSmart has disrupted the outplacement industry and has earned industry-wide praise as we've changed the way companies manage and measure their employee transition programs!  \n \nAs a one on one job search strategy coach, I support/teach/train my clients in all areas to help them find their next great career opportunity. My days are filled with virtual one on one strategy sessions on a huge variety of topics including: \n \nSelf Assessments and Goal Setting \nTechniques to \"Market\" your Personal Brand \nIndividual Job Search Strategy \nUnderstanding the \"Hiring Manager and Recruiter\" perspecitve \nResume and Cover Letter creation and customization \nStrategic use of Social Networking tools such as LinkedIn  \nInterview preparation and practice \nNegotiating Job Offers Transiton Specialist - Job Search Strategy Coach RiseSmart 2012  –  2014  (2 years) Virtual RiseSmart has disrupted the outplacement industry and has earned industry-wide praise as we've changed the way companies manage and measure their employee transition programs!  \n \nAs a one on one job search strategy coach, I support/teach/train my clients in all areas to help them find their next great career opportunity. My days are filled with virtual one on one strategy sessions on a huge variety of topics including: \n \nSelf Assessments and Goal Setting \nTechniques to \"Market\" your Personal Brand \nIndividual Job Search Strategy \nUnderstanding the \"Hiring Manager and Recruiter\" perspecitve \nResume and Cover Letter creation and customization \nStrategic use of Social Networking tools such as LinkedIn  \nInterview preparation and practice \nNegotiating Job Offers Global Learning Program Manager: Employee Professional Learning & Development IBM January 2009  –  March 2012  (3 years 3 months) At IBM, Learning was a global initiative. We collaborated around the Globe to ensure IBMer's had the tools and knowledge they needed to successfully deliver to our clients every day!  \n \nAs a Global Learning Consultant focused on employee development, I assessed business challenges, determined developmental needs within teams, designed or sourced learning interventions, delivered learning programs, assessed impact of those programs and continuously improved them with the end goal of solving the team's business challenges. Global Learning Program Manager: Employee Professional Learning & Development IBM January 2009  –  March 2012  (3 years 3 months) At IBM, Learning was a global initiative. We collaborated around the Globe to ensure IBMer's had the tools and knowledge they needed to successfully deliver to our clients every day!  \n \nAs a Global Learning Consultant focused on employee development, I assessed business challenges, determined developmental needs within teams, designed or sourced learning interventions, delivered learning programs, assessed impact of those programs and continuously improved them with the end goal of solving the team's business challenges. Career Development Program Manager, Redeployment and Learning Facilitator (classroom & virtual) IBM Canada Ltd. January 2006  –  December 2008  (3 years) IBM was constantly purchasing smaller Software companies during this time frame. Our goal in Career Development was to facilitate the On boarding, Training and Redeployment processes for all new and legacy employees in support of the larger goal of ensuring our clients had a seamless IBM experience.  \n \nIn this role I focused on new and legacy employee redeployment, on boarding processes and related training with a constant focus in the Career Development area. I trained and coached 100's of IBMer's to define and find their own career success within IBM. I also coached employees on managing their careers in an effort to retain top performers! Career Development Program Manager, Redeployment and Learning Facilitator (classroom & virtual) IBM Canada Ltd. January 2006  –  December 2008  (3 years) IBM was constantly purchasing smaller Software companies during this time frame. Our goal in Career Development was to facilitate the On boarding, Training and Redeployment processes for all new and legacy employees in support of the larger goal of ensuring our clients had a seamless IBM experience.  \n \nIn this role I focused on new and legacy employee redeployment, on boarding processes and related training with a constant focus in the Career Development area. I trained and coached 100's of IBMer's to define and find their own career success within IBM. I also coached employees on managing their careers in an effort to retain top performers! Professional Development Virtual & Classroom Facilitator IBM Canada Ltd. November 1998  –  January 2006  (7 years 3 months) I facilitated biweekly delivery of New Employee Training Programs for IBM Canada for 7 years for new Professional, Campus, and Acquisition audiences with consistently strong feedback. I delivered content on topics such as: Business Strategy, HR Policies and Programs, Career Development and Business skills such as communication, teaming and negotiation.I then coached and mentored many individuals as they acclimated to their new roles. Eventually, I was given the challenge to deliver these sessions virtually and continued to receive strong feedback. Professional Development Virtual & Classroom Facilitator IBM Canada Ltd. November 1998  –  January 2006  (7 years 3 months) I facilitated biweekly delivery of New Employee Training Programs for IBM Canada for 7 years for new Professional, Campus, and Acquisition audiences with consistently strong feedback. I delivered content on topics such as: Business Strategy, HR Policies and Programs, Career Development and Business skills such as communication, teaming and negotiation.I then coached and mentored many individuals as they acclimated to their new roles. Eventually, I was given the challenge to deliver these sessions virtually and continued to receive strong feedback. Public Sector Sales Specialist and Marketing Program Manager, Education Industry IBM Canada Ltd. January 1995  –  November 1998  (3 years 11 months) In this role I marketed and sold IBM software, hardware and services to the Kindergarten to Grade 12 Industry and the Higher Education Industry in the greater Toronto area. I also ran marketing/sales events across Canada annually and hosted client events at Universities and Colleges across Canada and the US. Our focus at the time was the new \"Think Pad University\" model initiated at Acadia University which successfully spread across other North American universities. Public Sector Sales Specialist and Marketing Program Manager, Education Industry IBM Canada Ltd. January 1995  –  November 1998  (3 years 11 months) In this role I marketed and sold IBM software, hardware and services to the Kindergarten to Grade 12 Industry and the Higher Education Industry in the greater Toronto area. I also ran marketing/sales events across Canada annually and hosted client events at Universities and Colleges across Canada and the US. Our focus at the time was the new \"Think Pad University\" model initiated at Acadia University which successfully spread across other North American universities. Skills Career Development Career Management Career Counseling Coaching Workshop Facilitation Program Management Team Leadership Training Delivery Project Management Marketing Sales HR Policies Negotiation Human Resources Interviews Management Onboarding Talent Acquisition Resume Writing See 4+     See less Skills  Career Development Career Management Career Counseling Coaching Workshop Facilitation Program Management Team Leadership Training Delivery Project Management Marketing Sales HR Policies Negotiation Human Resources Interviews Management Onboarding Talent Acquisition Resume Writing See 4+     See less Career Development Career Management Career Counseling Coaching Workshop Facilitation Program Management Team Leadership Training Delivery Project Management Marketing Sales HR Policies Negotiation Human Resources Interviews Management Onboarding Talent Acquisition Resume Writing See 4+     See less Career Development Career Management Career Counseling Coaching Workshop Facilitation Program Management Team Leadership Training Delivery Project Management Marketing Sales HR Policies Negotiation Human Resources Interviews Management Onboarding Talent Acquisition Resume Writing See 4+     See less Education University of Toronto Bachelor of Commerce (B.Com.),  HR ,  Marketing and Mathematics 1989  – 1994 University of Toronto Bachelor of Commerce (B.Com.),  HR ,  Marketing and Mathematics 1989  – 1994 University of Toronto Bachelor of Commerce (B.Com.),  HR ,  Marketing and Mathematics 1989  – 1994 University of Toronto Bachelor of Commerce (B.Com.),  HR ,  Marketing and Mathematics 1989  – 1994 ", "Experience University Recruiting Program Manager IBM March 2014  – Present (1 year 6 months) Project Manager IBM November 2012  –  March 2014  (1 year 5 months) Phoenix, Arizona Area Front Desk Lead Valley Heart Associates February 2011  –  September 2012  (1 year 8 months) Chandler, Arizona Technical Recruiter Volt Technical Resources May 2010  –  February 2011  (10 months) Phoenix, Arizona Area Front Desk/Medical Records East Valley Cardiology December 2005  –  July 2010  (4 years 8 months) Schedule patient appointments; Check patients in and out; Explain procedures; Manage incoming phone calls; Manage dictation reports; Design and implement business processes and process improvements; Collect co-pays and post charges to patient charts; Balance daily journal; File, purge, sort, and alphabetize medical records; Enter data into the computer; Complete various computer projects; Scan all medical files into electronic health record; Manage medical release and requests of information to both patients and physicians; troubleshoot computer problems; backup IT administrator; manage all returned mail Personal/Administrative Assistant Arizona Cancer Center February 2007  –  April 2007  (3 months) Implemented and supervised new procurement systems; Managed all of the cancer center's accounts and activities; Performed other clerical/office duties Summer School Care Leader Chandler Unified School District June 2005  –  July 2005  (2 months) Supervised 30 second graders for the 2 month summer program; Prepared art lessons and homework assignments; Aided in homework completion Piano Teacher Cheryl O'Bannion Studio June 2004  –  July 2005  (1 year 2 months) Managed a private piano studio which included managing the finances and scheduling; Instructed a 30-minute piano lesson to 20-25 students a week; Organized and facilitated annual recital for all students to perform University Recruiting Program Manager IBM March 2014  – Present (1 year 6 months) University Recruiting Program Manager IBM March 2014  – Present (1 year 6 months) Project Manager IBM November 2012  –  March 2014  (1 year 5 months) Phoenix, Arizona Area Project Manager IBM November 2012  –  March 2014  (1 year 5 months) Phoenix, Arizona Area Front Desk Lead Valley Heart Associates February 2011  –  September 2012  (1 year 8 months) Chandler, Arizona Front Desk Lead Valley Heart Associates February 2011  –  September 2012  (1 year 8 months) Chandler, Arizona Technical Recruiter Volt Technical Resources May 2010  –  February 2011  (10 months) Phoenix, Arizona Area Technical Recruiter Volt Technical Resources May 2010  –  February 2011  (10 months) Phoenix, Arizona Area Front Desk/Medical Records East Valley Cardiology December 2005  –  July 2010  (4 years 8 months) Schedule patient appointments; Check patients in and out; Explain procedures; Manage incoming phone calls; Manage dictation reports; Design and implement business processes and process improvements; Collect co-pays and post charges to patient charts; Balance daily journal; File, purge, sort, and alphabetize medical records; Enter data into the computer; Complete various computer projects; Scan all medical files into electronic health record; Manage medical release and requests of information to both patients and physicians; troubleshoot computer problems; backup IT administrator; manage all returned mail Front Desk/Medical Records East Valley Cardiology December 2005  –  July 2010  (4 years 8 months) Schedule patient appointments; Check patients in and out; Explain procedures; Manage incoming phone calls; Manage dictation reports; Design and implement business processes and process improvements; Collect co-pays and post charges to patient charts; Balance daily journal; File, purge, sort, and alphabetize medical records; Enter data into the computer; Complete various computer projects; Scan all medical files into electronic health record; Manage medical release and requests of information to both patients and physicians; troubleshoot computer problems; backup IT administrator; manage all returned mail Personal/Administrative Assistant Arizona Cancer Center February 2007  –  April 2007  (3 months) Implemented and supervised new procurement systems; Managed all of the cancer center's accounts and activities; Performed other clerical/office duties Personal/Administrative Assistant Arizona Cancer Center February 2007  –  April 2007  (3 months) Implemented and supervised new procurement systems; Managed all of the cancer center's accounts and activities; Performed other clerical/office duties Summer School Care Leader Chandler Unified School District June 2005  –  July 2005  (2 months) Supervised 30 second graders for the 2 month summer program; Prepared art lessons and homework assignments; Aided in homework completion Summer School Care Leader Chandler Unified School District June 2005  –  July 2005  (2 months) Supervised 30 second graders for the 2 month summer program; Prepared art lessons and homework assignments; Aided in homework completion Piano Teacher Cheryl O'Bannion Studio June 2004  –  July 2005  (1 year 2 months) Managed a private piano studio which included managing the finances and scheduling; Instructed a 30-minute piano lesson to 20-25 students a week; Organized and facilitated annual recital for all students to perform Piano Teacher Cheryl O'Bannion Studio June 2004  –  July 2005  (1 year 2 months) Managed a private piano studio which included managing the finances and scheduling; Instructed a 30-minute piano lesson to 20-25 students a week; Organized and facilitated annual recital for all students to perform Skills Technical Recruiting Benefits Negotiation Recruiting Contract Recruitment Applicant Tracking... Staffing Services Talent Acquisition Sourcing Screening Resumes College Recruiting Screening Multi Tasking Microsoft Office Organization Leadership Medical Records Multi-line Phone Troubleshooting Template Creation Appointment Scheduling Internet Resources Time Management Problem Solving Management Employee Relations Human Resources Onboarding CRM SDLC Consulting Resource Management Networking Healthcare Information Technology See 19+     See less Skills  Technical Recruiting Benefits Negotiation Recruiting Contract Recruitment Applicant Tracking... Staffing Services Talent Acquisition Sourcing Screening Resumes College Recruiting Screening Multi Tasking Microsoft Office Organization Leadership Medical Records Multi-line Phone Troubleshooting Template Creation Appointment Scheduling Internet Resources Time Management Problem Solving Management Employee Relations Human Resources Onboarding CRM SDLC Consulting Resource Management Networking Healthcare Information Technology See 19+     See less Technical Recruiting Benefits Negotiation Recruiting Contract Recruitment Applicant Tracking... Staffing Services Talent Acquisition Sourcing Screening Resumes College Recruiting Screening Multi Tasking Microsoft Office Organization Leadership Medical Records Multi-line Phone Troubleshooting Template Creation Appointment Scheduling Internet Resources Time Management Problem Solving Management Employee Relations Human Resources Onboarding CRM SDLC Consulting Resource Management Networking Healthcare Information Technology See 19+     See less Technical Recruiting Benefits Negotiation Recruiting Contract Recruitment Applicant Tracking... Staffing Services Talent Acquisition Sourcing Screening Resumes College Recruiting Screening Multi Tasking Microsoft Office Organization Leadership Medical Records Multi-line Phone Troubleshooting Template Creation Appointment Scheduling Internet Resources Time Management Problem Solving Management Employee Relations Human Resources Onboarding CRM SDLC Consulting Resource Management Networking Healthcare Information Technology See 19+     See less Education University of Arizona Bachelor of Science,  Psychology 2005  – 2009 University of Arizona Bachelor of Science,  Psychology 2005  – 2009 University of Arizona Bachelor of Science,  Psychology 2005  – 2009 University of Arizona Bachelor of Science,  Psychology 2005  – 2009 ", "Experience Recruiting Program Manager IBM March 2015  – Present (6 months) Rocket Center, WV Senior Business Analyst KeyLogic Systems October 2013  –  March 2015  (1 year 6 months) Director - Recruiting Xerox Business Services, LLC. January 2013  –  October 2013  (10 months) Staff Security Specialist IBM July 2010  –  January 2013  (2 years 7 months) Regional HR Manager National Interest Security Company (NISC) February 2008  –  August 2010  (2 years 7 months) Recruiting Manager Affiliated Computer Services July 2007  –  February 2008  (8 months) Learning & Development Manager ACS, Inc. February 2005  –  September 2006  (1 year 8 months) Recruiting Program Manager IBM March 2015  – Present (6 months) Rocket Center, WV Recruiting Program Manager IBM March 2015  – Present (6 months) Rocket Center, WV Senior Business Analyst KeyLogic Systems October 2013  –  March 2015  (1 year 6 months) Senior Business Analyst KeyLogic Systems October 2013  –  March 2015  (1 year 6 months) Director - Recruiting Xerox Business Services, LLC. January 2013  –  October 2013  (10 months) Director - Recruiting Xerox Business Services, LLC. January 2013  –  October 2013  (10 months) Staff Security Specialist IBM July 2010  –  January 2013  (2 years 7 months) Staff Security Specialist IBM July 2010  –  January 2013  (2 years 7 months) Regional HR Manager National Interest Security Company (NISC) February 2008  –  August 2010  (2 years 7 months) Regional HR Manager National Interest Security Company (NISC) February 2008  –  August 2010  (2 years 7 months) Recruiting Manager Affiliated Computer Services July 2007  –  February 2008  (8 months) Recruiting Manager Affiliated Computer Services July 2007  –  February 2008  (8 months) Learning & Development Manager ACS, Inc. February 2005  –  September 2006  (1 year 8 months) Learning & Development Manager ACS, Inc. February 2005  –  September 2006  (1 year 8 months) Skills Employee Relations Human Resources Recruiting Training Onboarding Talent Acquisition Talent Management HRIS Performance Management Employee Benefits Process Improvement Applicant Tracking... Organizational... Employee Engagement Interviews College Recruiting Team Building Internet Recruiting Leadership Cold Calling Program Management Sourcing Customer Service Deferred Compensation System Administration HR Policies Contract Recruitment Training Delivery Workforce Planning New Hire Orientations Vendor Management Personnel Management Hiring Change Management Conflict Resolution BPO Benefits Negotiation Employee Training Executive Search Call Centers PeopleSoft Screening Benefits Administration Temporary Placement Account Management Personnel Security See 31+     See less Skills  Employee Relations Human Resources Recruiting Training Onboarding Talent Acquisition Talent Management HRIS Performance Management Employee Benefits Process Improvement Applicant Tracking... Organizational... Employee Engagement Interviews College Recruiting Team Building Internet Recruiting Leadership Cold Calling Program Management Sourcing Customer Service Deferred Compensation System Administration HR Policies Contract Recruitment Training Delivery Workforce Planning New Hire Orientations Vendor Management Personnel Management Hiring Change Management Conflict Resolution BPO Benefits Negotiation Employee Training Executive Search Call Centers PeopleSoft Screening Benefits Administration Temporary Placement Account Management Personnel Security See 31+     See less Employee Relations Human Resources Recruiting Training Onboarding Talent Acquisition Talent Management HRIS Performance Management Employee Benefits Process Improvement Applicant Tracking... Organizational... Employee Engagement Interviews College Recruiting Team Building Internet Recruiting Leadership Cold Calling Program Management Sourcing Customer Service Deferred Compensation System Administration HR Policies Contract Recruitment Training Delivery Workforce Planning New Hire Orientations Vendor Management Personnel Management Hiring Change Management Conflict Resolution BPO Benefits Negotiation Employee Training Executive Search Call Centers PeopleSoft Screening Benefits Administration Temporary Placement Account Management Personnel Security See 31+     See less Employee Relations Human Resources Recruiting Training Onboarding Talent Acquisition Talent Management HRIS Performance Management Employee Benefits Process Improvement Applicant Tracking... Organizational... Employee Engagement Interviews College Recruiting Team Building Internet Recruiting Leadership Cold Calling Program Management Sourcing Customer Service Deferred Compensation System Administration HR Policies Contract Recruitment Training Delivery Workforce Planning New Hire Orientations Vendor Management Personnel Management Hiring Change Management Conflict Resolution BPO Benefits Negotiation Employee Training Executive Search Call Centers PeopleSoft Screening Benefits Administration Temporary Placement Account Management Personnel Security See 31+     See less Education Frostburg State University BS,  English 1992  – 1994 Georgia State University Finance 1989  – 1991 Frostburg State University BS,  English 1992  – 1994 Frostburg State University BS,  English 1992  – 1994 Frostburg State University BS,  English 1992  – 1994 Georgia State University Finance 1989  – 1991 Georgia State University Finance 1989  – 1991 Georgia State University Finance 1989  – 1991 ", "Skills Employee Relations Workforce Planning Temporary Placement Human Resources Talent Management PeopleSoft Recruiting Program Management Sales Management Internet Recruiting Talent Acquisition Enterprise Software Management Applicant Tracking... Technical Recruiting SDLC Sales Process Improvement Cold Calling Interviews Team Leadership College Recruiting See 7+     See less Skills  Employee Relations Workforce Planning Temporary Placement Human Resources Talent Management PeopleSoft Recruiting Program Management Sales Management Internet Recruiting Talent Acquisition Enterprise Software Management Applicant Tracking... Technical Recruiting SDLC Sales Process Improvement Cold Calling Interviews Team Leadership College Recruiting See 7+     See less Employee Relations Workforce Planning Temporary Placement Human Resources Talent Management PeopleSoft Recruiting Program Management Sales Management Internet Recruiting Talent Acquisition Enterprise Software Management Applicant Tracking... Technical Recruiting SDLC Sales Process Improvement Cold Calling Interviews Team Leadership College Recruiting See 7+     See less Employee Relations Workforce Planning Temporary Placement Human Resources Talent Management PeopleSoft Recruiting Program Management Sales Management Internet Recruiting Talent Acquisition Enterprise Software Management Applicant Tracking... Technical Recruiting SDLC Sales Process Improvement Cold Calling Interviews Team Leadership College Recruiting See 7+     See less ", "Skills Technical Recruiting College Recruiting Business Strategy Student Recruitment Budget Oversight Business Operations... HR Solutions HR Strategy Job Fairs Job Descriptions Job Search Strategies Getting The Job Done Recruiting Personnel Management Student Recruiting HRIS Talent Management CRM Vendor Management Budgets Human Resources Management Talent Acquisition Sourcing Hiring Operations Management Applicant Tracking... Temporary Placement Training Benefits Negotiation Contract Recruitment Resource Management Consulting Deferred Compensation Screening Resumes Screening Executive Search Staffing Services Onboarding Interviews Employer Branding Workforce Planning Employee Relations IT Recruitment HR Consulting Employee Engagement PeopleSoft Performance Management See 33+     See less Skills  Technical Recruiting College Recruiting Business Strategy Student Recruitment Budget Oversight Business Operations... HR Solutions HR Strategy Job Fairs Job Descriptions Job Search Strategies Getting The Job Done Recruiting Personnel Management Student Recruiting HRIS Talent Management CRM Vendor Management Budgets Human Resources Management Talent Acquisition Sourcing Hiring Operations Management Applicant Tracking... Temporary Placement Training Benefits Negotiation Contract Recruitment Resource Management Consulting Deferred Compensation Screening Resumes Screening Executive Search Staffing Services Onboarding Interviews Employer Branding Workforce Planning Employee Relations IT Recruitment HR Consulting Employee Engagement PeopleSoft Performance Management See 33+     See less Technical Recruiting College Recruiting Business Strategy Student Recruitment Budget Oversight Business Operations... HR Solutions HR Strategy Job Fairs Job Descriptions Job Search Strategies Getting The Job Done Recruiting Personnel Management Student Recruiting HRIS Talent Management CRM Vendor Management Budgets Human Resources Management Talent Acquisition Sourcing Hiring Operations Management Applicant Tracking... Temporary Placement Training Benefits Negotiation Contract Recruitment Resource Management Consulting Deferred Compensation Screening Resumes Screening Executive Search Staffing Services Onboarding Interviews Employer Branding Workforce Planning Employee Relations IT Recruitment HR Consulting Employee Engagement PeopleSoft Performance Management See 33+     See less Technical Recruiting College Recruiting Business Strategy Student Recruitment Budget Oversight Business Operations... HR Solutions HR Strategy Job Fairs Job Descriptions Job Search Strategies Getting The Job Done Recruiting Personnel Management Student Recruiting HRIS Talent Management CRM Vendor Management Budgets Human Resources Management Talent Acquisition Sourcing Hiring Operations Management Applicant Tracking... Temporary Placement Training Benefits Negotiation Contract Recruitment Resource Management Consulting Deferred Compensation Screening Resumes Screening Executive Search Staffing Services Onboarding Interviews Employer Branding Workforce Planning Employee Relations IT Recruitment HR Consulting Employee Engagement PeopleSoft Performance Management See 33+     See less ", "Summary Business professional with over 16 years of diverse work experience providing expertise in human resources, contracts, and the legal field to commercial and Government firms.  Summary Business professional with over 16 years of diverse work experience providing expertise in human resources, contracts, and the legal field to commercial and Government firms.  Business professional with over 16 years of diverse work experience providing expertise in human resources, contracts, and the legal field to commercial and Government firms.  Business professional with over 16 years of diverse work experience providing expertise in human resources, contracts, and the legal field to commercial and Government firms.  Experience Recruiting Program Manager IBM June 2015  – Present (3 months) Parent Liaison Loudoun County Public Schools July 2013  –  June 2015  (2 years) Harmony Middle School Lead Recruiter - Internal Firm Services IBM, Global Business Services (formerly PriceWaterhouseCoopers LLC) March 2000  –  July 2003  (3 years 5 months) Employee Referral Coordinator PricewaterhouseCoopers LLC February 1999  –  March 2000  (1 year 2 months) Contract Administrator Price Waterhouse LLP June 1995  –  July 1997  (2 years 2 months) Rosslyn, VA Senior Legal Assistant PRC Inc. June 1990  –  June 1995  (5 years 1 month) Mc, Lean, VA Recruiting Program Manager IBM June 2015  – Present (3 months) Recruiting Program Manager IBM June 2015  – Present (3 months) Parent Liaison Loudoun County Public Schools July 2013  –  June 2015  (2 years) Harmony Middle School Parent Liaison Loudoun County Public Schools July 2013  –  June 2015  (2 years) Harmony Middle School Lead Recruiter - Internal Firm Services IBM, Global Business Services (formerly PriceWaterhouseCoopers LLC) March 2000  –  July 2003  (3 years 5 months) Lead Recruiter - Internal Firm Services IBM, Global Business Services (formerly PriceWaterhouseCoopers LLC) March 2000  –  July 2003  (3 years 5 months) Employee Referral Coordinator PricewaterhouseCoopers LLC February 1999  –  March 2000  (1 year 2 months) Employee Referral Coordinator PricewaterhouseCoopers LLC February 1999  –  March 2000  (1 year 2 months) Contract Administrator Price Waterhouse LLP June 1995  –  July 1997  (2 years 2 months) Rosslyn, VA Contract Administrator Price Waterhouse LLP June 1995  –  July 1997  (2 years 2 months) Rosslyn, VA Senior Legal Assistant PRC Inc. June 1990  –  June 1995  (5 years 1 month) Mc, Lean, VA Senior Legal Assistant PRC Inc. June 1990  –  June 1995  (5 years 1 month) Mc, Lean, VA Skills Event Planning Recruiting PowerPoint Microsoft Office Customer Service Event Management Microsoft Word Microsoft Excel Marketing Project Management Negotiation Conflict Resolution Coordination DoD Leadership Government Human Resources See 2+     See less Skills  Event Planning Recruiting PowerPoint Microsoft Office Customer Service Event Management Microsoft Word Microsoft Excel Marketing Project Management Negotiation Conflict Resolution Coordination DoD Leadership Government Human Resources See 2+     See less Event Planning Recruiting PowerPoint Microsoft Office Customer Service Event Management Microsoft Word Microsoft Excel Marketing Project Management Negotiation Conflict Resolution Coordination DoD Leadership Government Human Resources See 2+     See less Event Planning Recruiting PowerPoint Microsoft Office Customer Service Event Management Microsoft Word Microsoft Excel Marketing Project Management Negotiation Conflict Resolution Coordination DoD Leadership Government Human Resources See 2+     See less Education Virginia Polytechnic Institute and State University Bachelor of Science,  Family and Child Development 1982  – 1986 Virginia Polytechnic Institute and State University Bachelor of Science,  Family and Child Development 1982  – 1986 Virginia Polytechnic Institute and State University Bachelor of Science,  Family and Child Development 1982  – 1986 Virginia Polytechnic Institute and State University Bachelor of Science,  Family and Child Development 1982  – 1986 ", "Skills Technical Recruiting Recruiting Sourcing Human Resources Interviews Management CRM Employee Relations Consulting Outsourcing Business Process Temporary Placement SAP Training Strategy Integration Employee Benefits Information Technology Leadership Talent Acquisition Project Management Resource Management Management Consulting Process Improvement ERP Business Development Applicant Tracking... Personnel Management SDLC Team Leadership Hiring Vendor Management Business Analysis Benefits Negotiation Networking Talent Management Strategic Sourcing See 22+     See less Skills  Technical Recruiting Recruiting Sourcing Human Resources Interviews Management CRM Employee Relations Consulting Outsourcing Business Process Temporary Placement SAP Training Strategy Integration Employee Benefits Information Technology Leadership Talent Acquisition Project Management Resource Management Management Consulting Process Improvement ERP Business Development Applicant Tracking... Personnel Management SDLC Team Leadership Hiring Vendor Management Business Analysis Benefits Negotiation Networking Talent Management Strategic Sourcing See 22+     See less Technical Recruiting Recruiting Sourcing Human Resources Interviews Management CRM Employee Relations Consulting Outsourcing Business Process Temporary Placement SAP Training Strategy Integration Employee Benefits Information Technology Leadership Talent Acquisition Project Management Resource Management Management Consulting Process Improvement ERP Business Development Applicant Tracking... Personnel Management SDLC Team Leadership Hiring Vendor Management Business Analysis Benefits Negotiation Networking Talent Management Strategic Sourcing See 22+     See less Technical Recruiting Recruiting Sourcing Human Resources Interviews Management CRM Employee Relations Consulting Outsourcing Business Process Temporary Placement SAP Training Strategy Integration Employee Benefits Information Technology Leadership Talent Acquisition Project Management Resource Management Management Consulting Process Improvement ERP Business Development Applicant Tracking... Personnel Management SDLC Team Leadership Hiring Vendor Management Business Analysis Benefits Negotiation Networking Talent Management Strategic Sourcing See 22+     See less "]}